{"Reviews": [{"Title": "Best camera for the price!!", "Author": "Christa", "ReviewID": "R3D5D3Y2C5CV5O", "Overall": "5.0", "Content": "It was a long wait but finally got it last week and then took it for a trip right away, its performance it's outstanding, I got this camera for a TV show we are producing, after seeing a few options we decided to get this one because of several reasons:- Size, the camera is very compact, for a camera that provides broadcast quality image the size is amazingly small.- Construction, this camera has most of its body made out with metal panels, that makes it very solid and also makes it reliable, also the set up of the buttons are easy to access.- Price, there are other models in the market that could deliver a similar quality or probably a little better but the cost is at least $1k more, if you think like I do \"creativity is the main ingredient for a good production\", spending the extra cash doesn't really make a difference as long as you are aware of the camera's capabilities and limitations, but there is always ways to improve performance in some conditions that could affect the correct functionality of your equipment.- Tapeless technology, we bought another AVCHD camera a little less than a year ago, we use it mostly for action shots and underwater recording, the transition was effortless, the advantages and capturing time are reduced to minimal and the quality is amazing, with this model we found that its quality is even better than older models and editing is a lot quicker, also recording cost are cut to almost nothing with new SDHC cards that can be used over and over without loosing quality... Just this fact makes it a must buy!!!After using it for this little time I have managed to work around its many controls and get exactly what I want from it, the response to low light is not the best but it's decent, you can always add a good light for little money and resolve that problem, also the sound quality is excellent, I didn't get the optional xlr adapter piece for it but I am using a 8mm wireless mic system that combined with this little fellow deliver great results!!In short words: \"the new Panasonic AG-HCM40 is not the best camera money can buy but ,to my opinion, it's the best camera money can buy for this price!!\"", "Date": "September 20, 2009"}, {"Title": "Perfect!!!", "Author": "Elkbison \"elkbison\"", "ReviewID": "R1EN3OWUI0OM36", "Overall": "5.0", "Content": "This camera deserves \"6 Stars\" on image quality. I am a Realist when it comes to reviewing a product. First: we must consider the items price, $1995.00. In the \"Professional Video Camera World\", That is tantamount to saying a steal!!! I will not go into features and functions, the description of this Camera is given in detail on the product description portion of this page.Second: Size and weight, Until very recently, a Pro Video Camera came in two sizes, large and super large. The additional problem here is that the general public became used to seeing these monstrosities at events, and broadcasts. Many Video Camera Professionals still look for these monstrosities simply to appease their clients visual expectations. This is the wrong approach, we should stop breaking our backs with our equipment, and instead educate the public of the technological advances that have benefited this industry. The video quality produced by this camera will please the most discriminating client.Third: You have all this quality being recorded on SDHC cards (my advise is Class 10 30mbs or better). Recording on SDHC cards will be a liberating experience for people who used tape in the past. The Quality is much better. You cannot record over scenes by accident. It can be recorded on again and again, without loss of quality. It is not affected by altitude like hard drive consumer models. If you are thinking of getting this camera, Just get it.....think later!!!", "Date": "November 10, 2009"}, {"Title": "Balance of power has officially shifted to AVCHD", "Author": "D. Cannon \"Business Founder\"", "ReviewID": "R3GSI3EHFYSY07", "Overall": "5.0", "Content": "I just met this camera last week, little brother to the HMC150. The HMC40 brings several welcome upgrades to market. I'm an intermediate producer in training with lots of self study and attended a few great workshops. After two years of shooting 1920 HD on the low end I have to say this camera impressed me.PROS:1) MPEG-4. Shoots very good quality in a tiny light weight package. Just love it. Even has time-lapse capability which sure beats roto-ing in post for a time lapse effect.2) You can squeeze two HMC40s in the same size carryon pelican case as the 150.3) Start editing your shots on Mac in only 2-3 minutes without waiting for rendering. No transcoding required, no $600 P2 cards either. But you should use something faster than just class 6 SDHC media if you want to bump up the quality a little, otherwise you might get some artifacts (image problems) with fast motion and striped clothing. Same problem as any media recording slower than the camera.4) I'm cool with renting HMC150 and redrock/letus for higher end projects if necessary. This camera is fine for making DVD projects or streaming HD.5) Great looking shots with 4:2:0 sampling.6) We produce our own stuff, make a profit and clients keep coming back. With a $1995 retail price tag I can finally afford to own two very nice HD cameras.CONS:A) Manual button lovers will need to learn the softkey menus. I love the softkeys with all the same features. No different than using an iphone.B) Two choices for sound: Seperate sound (best) or get the panasonic/beachtek adapter for on camera. I like using seperate sound on a tascam or fostex digital recorder with four seperate channels (mic 1, mic 2, wild background). This gives you plenty of room to remix in post or replace sounds. Great sound is still 50% of the production.C) It's not the same glass lens set as 150/170 so you may need different accessories.D) No timecode jam sync between two cameras. This camera does have its own timecoding (HH:MM:SS:FF). Oh well, I've been living without timecode sync since I started. It just adds a little to the time in post for manually lining up shots and sound tracks. It's no problem to keep using a clapper board anyway. Clappers do give a kinda nostalgic flair for the crew and spectators.I hope this helps. Upgrade cameras every couple of years while the resale value is still a good plan. After shooting a short this weekend I think this is going to be a good two year relationship. I wish you the best.Semper fidelis,David Cannon", "Date": "November 15, 2009"}, {"Title": "A JOY TO USE!", "Author": "E. Hunter Hale", "ReviewID": "RTJ9DNMIQ9KTS", "Overall": "5.0", "Content": "This is the most exciting camera that I have ever owned. Not only is this an outstanding HD video camera but it is also an excellent still camera. While I am still exploring the possibilities of what this camera is capable of I have already come to appreciate the advantages that it offers in controlling the picture quality. The ability to accurately focus quickly as well as to control hot spots in the picture area with the manual f stop control is greatly appreciated. The touch tone screen control works effectively and the ability to choose any three settings for quick access is valuable. I've never seen a camera where the controls were be set up than this one. When hand holding the controls are in exactly the right spot. The ability to do Time Lapse photography is something I have always wanted in a camera and this one does a excellent job. The picture sharpness in the highest recording rate (Approx. 21 Mbps) is breathtaking. My only complaint would be that the instruction book comes only as a pdf file. I printed it off and use it all the time in teaching myself the ins and outs of the superb tool. This is a camera for the person who is serious about creating artistic works that go beyond just shooting a video record. While I'm sure that the Panasonic AG-40 would fit in well with professional TV applications I think that this camera will open up a new world for the serious non-professional who desires to create personal masterpieces. I would pick this as the video camera of the year!", "Date": "November 6, 2009"}, {"Title": "An excellent pro-sumer camcorder to start off with...", "Author": "Vincent P. Del Vecchio \"Vinny \"The Hitman...", "ReviewID": "R3EGVFCMARJF99", "Overall": "5.0", "Content": "If you are brand new to professional or pro-sumer camcorders or figure its about that time to step up from your handycam days into the world of professional audio/video, there is no better \"starting gate\" than the Panasonic AG-HMC40. Its smaller form factor will be a familiar \"path\" in terms of handling and control but will also give you some more real estate to play with the included on-camera controls. Most of this stuff are things within the menus os high-end consumer camcorders but they have been placed on the camera body for quick reach and control. This enabled a lot of on-the-fly adjusting that was simply not possible with lower end consumer camcorders of today.Then they add manual adjusting with a focus ring, an iris dial control, three different user-controlled buttons and a wole host of other goodies that will propel your experience into the real of professional videography use.The included battery that comes with the HMC40 is actually the MID-RANGE model that provides about 3 hours of juice at full charge. Most models of camcorders like this (including the older brother HMC150) usually come with the smallest size 1-hour battery but the fact that Panasonic decided to include the 3.5 hour battery in this kit is simply fantastic. The 8 hour extended battery is always recommended but this three hour long model is definitely a welcome addition that will help offset the cost of buying an extended battery, especially if you don't need longer than a 3 hour model (you can use the money saved for on-camera external microphones, the optional XLR adapter, or external lighting).Speaking of extras, the optional Panasonic XLR adapter is a MUST if you wish to use a good quality XLR shotgun or omni-directional microphone. External lighting is something you DEFINITELY will need if you plan on filming in low light as this camera's low light recording capabilities are mediocre at best without a decent light.Also, don't be fooled. This camcorder records perfectly in it's highest quality mode with a GOOD QUALITY Class 4 SDHC card. As long as the SDHC card you plan to use is a good brand such as Transcend, PNY, Lexar, SanDisk, or other quality brands, a class 4 (with MINIMUM 4MBps write speeds) records perfectly. This camcorder records at a MAXIMUM of 24Mbps (That is MEGABITS per second, which equals 3MBps -MEGABYTES PER SECOND-) and a quality Class 4 SDHC cards writes at a MINIMUM of 4MBps (MEGABYTES per second). The ONLY reason you would want a Class 6 or 10 speed SDHC card if if you wanted a higher transfer speed (which is good when offloading the data off the card onto a computer. A Class 6 or 10 card should have a minimum write speed of 6MBps and 10MBps respectively, with good quality SDHC cards even having a minimum write speed of 16MBps - 30MBps (Lexar, Transcent, SanDisk being my favorites). I've heard bad things with ADATA cards and this camcorder so please be aware in case you plan on using lower quality SDHC cards as you might get distortion, pixelization, ect.I hope this helps you in your purchase of this great professional Panasonic camcorder!", "Date": "July 19, 2010"}, {"Title": "HMC40: GET MUCH MORE FOR LESS $", "Author": "Viridiana Serrano", "ReviewID": "R1OYZ7IZLIQ996", "Overall": "5.0", "Content": "My husband and I run a wedding photography & videography business. We recently purchased the HMC40. For the price range, this camera delivers excellent image quality, both in daylight, and lowlight. Camera gain (noise) is excellent on lowlight situations. Many people have complained that this camera does not perform well in low light, but cameras are all about light. Illumination is key to any shooting scenario. Wedding photography & videography requires on-location illumination (lights and light stands), and on-camera lighting. With just on-camera lighting, this camera delivers superb images. Controls are easy to use, reachable, and well placed. We use this camera as our main camera, and so far, it has delivered excellent results. Lightweight is a plus. Sharpness is very good. If you seek to run a small videography business, this camera will keep your prices affordable, and your video quality high.Do consider that for professional uses you need to complement the HMC40 (and any other expensive camera) with the following: on-camera light, at least 1 extra light on a light stand (fluorescent is good), and an external microphone. I use the following with my HMC40: Varizoom on-camera light, 2 fluorescent flood lights (50W), and the Rode Stereo Mic, plus 1 Audio Technica wireless mic  to use at the ceremony.", "Date": "November 17, 2010"}, {"Title": "A nice upgrade from the JVC HD-7", "Author": "E. Mamaradlo", "ReviewID": "R2ZCMG0ZCCWO2H", "Overall": "4.0", "Content": "Needed a HD camcorder that would replace my dead JVC HD7.  The JVC had better manual controls in terms independent controls of Shutter and Aperture.  Manual Zoom was okay on the HMC40, handling was okay (very light weight), top handle is removable (but sometimes had to put back in -- screws don't align with socket).  The image quality was okay too (not too saturated compared to the HD7).  Auto White Balance is okay, but not great -- just do a manual white balance.  The touchscreen is a nice novelty (has dedicated record/ Zoom/ quick menu/ full menu/ Erase buttons at bottom of screen), and there are 3 independent USER1,2,3 buttons to customize the camera.  It's only 12x zoom.Converting AVCHD to DVD MPEG2 is a bit lacking -- I get super pixelated results.  On the internet, they recommend a high end encoder because the Adobe Media Encoder or Vegas Video don't do a good job.  The Optical Stabilizer is Excellent compared to the JVC HD7's terrible stabilizer.  Over a good camera, you just need a fast PC/Mac to do post-processing.  In the CD disc, there is a utility to convert the AVCHD files to HDV, MPEG2, and Canopus DV codec.  Still testing that utility...I recommend Class 6 SDHC card to record, although the manual said I can use Class 4.  On a 16GB SDHC card with Highest Quality recording, you can record up to 1hr 30min.  Stock Battery last about 90min.  I highly recommend the extended battery from Panasonic -- records up to 7hr with LCD screen open!I did not get the XLR adapter, but was satisfied with the RODE Video Mic connected to the HMC40's miniplug.  Also I like the option to connect to a pair of headphones.  Overall a nice cam for less than $2000.  Get this cam if you're starting out or on a tight budget or just need a second camera.", "Date": "December 28, 2009"}, {"Title": "Great Pro-sumer Camcorder", "Author": "Rick Bennette \"Rick Bennette\"", "ReviewID": "R3ARA7SSETT5G4", "Overall": "5.0", "Content": "Panasonic Professional AG-HMC40 AVCHD Camcorder with 10.6MP Still and 12x Optical ZoomPanasonic Professional AG-HMC40 AVCHD Camcorder with 10.6MP Still and 12x Optical ZoomThe Panasonic AG-HMC40 camcorder provides most of the features and the look of a full professional camcorder, with the convenience and light weight of a consumer camcorder.  What sets it apart from something like a palm sized camcorder is the image quality and the amount of manual control.  The main thing missing that would make this an excellent pro camera is the full manual lens.  While the HMC40 does have a manual focus ring, it controls the focus electronically and not mechanically.  Also, there is no dedicated manual zoom or iris ring on the lens, although the focus ring can be programmed to control these functions one at a time.That being said, the image quality of this camcorder is excellent, even when compared to prosumer camcorders costing double.  The lens maintains crisp focus right out to the edges, with no noticable chromatic aberration (false color fringes around objects).  The lens on my similarly priced Sony FX7 had this problem.Low light capability is very good. It does get a little grainy at 36 db gain but the image still remains sharp.  At 18db gain, the image is crisp with very little grain.  Changing the various video settings from default in the menu can lower the grain and bring out more contrast.  Outdoors, or indoors in bright light, the image is simply stunning.  Colors are very true and well saturated, and you can add more or less saturation in the menu setup.  In a dimly lit room like a wedding reception, you can get by without lights if you have to.There are hundreds of combinations of image adjustments in the menu system, and if you are new to prosumer camcorders, some of these terms may not be familiar.  The camcorder has a cinema gamma mode, a native 24 frame progressive mode, cinema matrix, skin tone softener, detail coring, manual DRS and three preset Knee controls.  When you combine these settings, you get a very film-like image.  You'll need to read the online manual, or just experiment with different settings in different light until you see what you like.  There's enough settings to keep you playing for days.  One in particular, the waveform monitor, is very useful in setting up the manual iris for the brightest possible exposure without hot spots.The internal mike and switchable audio level controls and the ability to turn AGC on or off provides good audio for most purposes.  With AGC on, the audio will not overload even when a few feet from the speaker blast of a loud DJ.  The AGC is gentle, without the harsh pumping action found on consumer camcorders.  An XLR shotgun mike and XLR audio adapter with better manual audio level control is optional and plugs into a dedicated audio port on the camera.  It does not simply convert to unbalanced 1/8 inch jacks as many of these adapters do.  It's truly a balanced line or mike input all the way through, with or without phantom power.  You'll need the XLR adapter and a good boom mike for film production, of course.Battery life is three hours with the included battery, and six hours with an optional pack.  Enough to get you through the day.The camcorder uses the AVCHD format, which is a better compression technique (at the 24 meg mode) than the MPG 2 of HDV tapes.  You can set it for 1080 60i 1080 24p, 1080 30p, 720 24p, 720 30p and 720 60p.  There are four data rates.  5 meg/sec, 13, 17 and 24.  The differences are minimal from 13 to 24.  The image is slightly softer and slightly blocky at the 5 meg setting when there is a lot of motion in the subject, but even at that setting you can still create an excellent image for making a DVD.  It's a good choice for recording long programs on smaller memory cards when there isn't much motion, like a speech.The best feature is recording to inexpensive SD and SDHC cards.  There are no moving tape transports or hard drives to fail, so this camcorder will last until you drop it on the sidewalk or into a swimming pool.  Image quality will probably not improve much in newer camcorders in this price range for some time to come.  With ever increasing memory size SDHC cards getting cheaper every week, this camcorder's recording capacity grows by the month.  It's a great choice for recording events for hire as well as smaller TV station news departments.Rick Bennette, FineArtVideo dot com", "Date": "June 21, 2010"}, {"Title": "Best small pro/prosumer camcorder to date", "Author": "David B. Haynie", "ReviewID": "R1RK97Q42FCVNA", "Overall": "5.0", "Content": "So, I was thinking of \"going tapeless\" for awhile now. I've had a Sony HVR-A1 basically since it came out, and it's served me well, but tape has been such a drag. I briefly owned a Hitachi Blu-Ray camcorder, but found the low quality on AVCHD at the time too limiting. Last year I bought a cheap Sanyo, an FH1, and while you could still see artifacts, it was pretty obvious that tapeless was really starting to exceed tape in quality. It had already won in popularity.Which brings me to the HMC40... what a crazy value. Ok, unlike the Sony, the XLR module is extra, and I consider it a must-have, but it's not horrible that it's unbundled. Some folks have decent off-camera 1/8\" mics, which will work perfectly with this camera. I already have a nice XLR-based Rode shotgun mic, so I was really glad not to have yet another bundled mic that I probably won't use.The camcorder itself it just about ideal. My Sony was a bit on the small side, too many things had to be done via menus, the lens ring was functional but a bit small, etc. The HMC40 addresses this... it's large enough to have a decent array of real controls, the focus/zoom ring is silky smooth, the zoom rocker allows a great range of zoom control. Don't worry about the handle... it looks questionable, but it's aluminum, not plastic.. it won't break.One big potential win for tapeless hasn't always been realized in tapeless models -- different formats. The HMC40 wins big on this: 1080/60i, 1080/30p, a native 1080/24p (eg, not stored as 60i), 720/60p, etc. No SD mode, but I found I was always shooting in HD with my Sony, even if the target was DVD or some other SD output.And the bottom line: quality... the video quality is superb. And handy.. I can play the SDHC card directly on my PS3 (if you don't have a PS3, you missed that model, but many Blu-Ray players can also play back directly from SD cards) if I want to see the video immediately.... and this is the best I've seen from any camcorder I've owned.Naturally, SD cards and AVC may not be for everyone. Tape has the nice fact that's it's always backed up. But I've established backup and archive practices for digital still photo, so video's not all that different, particularly given the falling price of BD-R discs. But if you don't have a good backup strategy, you might want to stick to tape until you do. You'll also need a really fast PC for even basic editing on AVCHD files directly. My Q9550 (Core 2 quad, 2.83GHz, 8GB DDR2 DRAM) is good, though I'd love an i7 system. You can do easier editing via an intermediate CODEC... I use CineForm Neo ($100-ish) for this, and Panasonic has a free download that does some kind of conversion to high bitrate MPEG-2 or something (haven't used it yet myself). So there are solutions.", "Date": "March 25, 2010"}, {"Title": "HMC40 Top of the Line for Price", "Author": "Tom D.", "ReviewID": "R247Y8LD4MSSRT", "Overall": "4.0", "Content": "My Panasonic HMC40 came with Berry Green's HMC book and Edius editing software, adding an extra $250 worth of value to my investment. I just finished reading the book and can assure you that it's packed with valuable information beyond what you will find in the user manual. I would also recommend others to join online user groups like [...] and do some research on this camera, editing software, and work flows people are using. Editing AVCHD is extremely challenging - even for some of the pro's with state of the art software and computers.Coming from a standard definition Canon GL2 prosumer camera, I figured it wouldn't be too challenging to learn the functions of this camera, but I admit, it's a bit more technical than I thought it would be. Sure, you can shoot in full automatic and get pretty good results, but the amazing results come when you learn to use some of the camera's more professional features. (This camera was developed by Panasonic's broadcast division, not their consumer division.)I believe the HMC40 received a bum rap from people worried about the \"jello effect\" of 3MOS sensors (google it). It took a while for people to figure that out before sales took off. I generally shoot in 720 60p mode at 1/60th shutter and unless I really try to make this effect happen...it doesn't cause me an issue. All cameras have their strengths and weaknesses and some people obsess over them rather than learn to operate their equipment within its bounds.At the time I purchased my HMC40 it was clearly the leader of the pack in its price-point. Sony has recently come out with a model to compete against it for around $300 less, but after reviewing its specs (far inferior), unless money is your deciding factor, I would still recommend opting for the HMC40.I gave the battery life 4 stars because, like most batteries, it is a bit small and you always have to purchase another battery. I gave 4 stars for ease of use because, even though the manual is pretty good, it's not easy to use unless you already have plenty of experience with pro or prosumer level equipment. I gave it 4 stars for image quality due to being a bit weak in low light. Fortunately, you can add more gain on this camera than you can get away with some other cameras to make up some of the difference, but Panasonic should have engineered this for better low light performance, especially when they knew full-well this would be used as an event camera (like weddings)where low light ability is critical. Other than that, the image is great when properly exposed. On manual controls I went 4 stars because of how they buried some basic functions in the touch screen menus making it inconvenient to make quick changes on the fly.Obviously, to earn 5 stars this camera would have to be its big brother, the HMC150 at a cost substantially higher. But, for the money, this camera is a very good investment.", "Date": "July 11, 2010"}, {"Title": "Panasonic does it again", "Author": "Brad Wilson", "ReviewID": "R1QV8FW91U4FAP", "Overall": "5.0", "Content": "Having used the AG-DVX100 in its various incarnations, Panasonic has established itself as THE price to performance leader in this price range, and the latest models do not disappoint. Although color and white balance can't quite live up to the DVX100, with manual white balance (which should really be done manually anyway regardless of the auto settings on any camera given a little time beforehand), it is very solid. Both shotgun mics in the 1/8\" jack and using the optional XLR adapter are excellent. The built in mic is terrible for all but the most spontaneous of shots, but I would rather judge a camera in the audio area based on its input options rather than on whatever is built-in.Simply superb for documentary, indie film, or basic TV purposes. Unbeatable in its price range. You can get better, but you will pay much, much more. The SD card is awesome too, I couldn't be happier to finally be rid of moving parts. Manual controls can take some getting used to since they are really just controlling the internal electronics, but they are well thought out and uncluttered.To put it very simply, I've used several TV broadcast cameras that cost 5 or 10 times as much, and yes, they are better. But unless you want to burn that kind of money, this is as far as I'm concerned the current monarch of \"prosumer\" grade video cameras. Both JVC and Panasonic are titans in video cameras and this lightweight entry has a very respectable number of professional features passed down from its older siblings.", "Date": "March 8, 2010"}, {"Title": "Blown away!", "Author": "John \"John_in_NC\"", "ReviewID": "RXNAXOXNXA46K", "Overall": "5.0", "Content": "My review is based on my experience with this camcorder, not necessarily a product review per se.As a pro photographer I have a solid knowledge about stil cameras, exposure and techniques. When I made the purchase here on Amazon.com I knew I was about to step out of my comfort zone when going from my occasional video taping with SD to AVCHD HD. So, last week I purchased the HMC40 along with a Rode Microphone. At first I was a bit overwhelmed when reading the owners manual but then opened up the included \"HMC Book\", a nice spiral wound book that explains in plain English what the functions do and how to do certain things, and found it answered a LOT of my questions.I did some test videos, connected the HDMI to my Toshiba Regza 1080P TV and played them back. My test videos were in 720/60P and the video literally blew us away.I tried to copy a couple clips onto my pc but didn't do it right so the video didn't play. I did a bit more reading and now got a workflow plan. Yeah, if your going HD this is a great unit but DO READ UP on it to decide if you are really ready to make the change! A couple SDHC high speed chips, A Blueray Burner, A BlueRay Player, more memory in the ole PC, an SCHC card reader and more is going to be needed just to get started.I had an important photoshoot coming up where I hired to take photos of a celebrity event. I asked my wife to come along and video with the HMC40 in full auto mode. Her training consisted of 15 minutes of me explaining how to put the camera on the tripod, connect up the Rode microphone, turn it on and off. Showed her the button to record/pause and zoom and that's about it. The results were astounding, I am pretty sure they will want the buy the video from me as well meaning it could possibly pay for itself on its first time out!Had a couple other photogs there come by to check out the Panasonic. He had the Panasonic 700 which I thought was a great unit but he said it was nowhere near the 40 like what we were using.Registration on the Panasonic website was kind of a pain but finally got that all done and then was able to download my user license to the included editing software.So, I am currently in the process of uploading the video we took yesterday and plan to render it to standard definition so I can put in on a regular DVD. When I get the Blueray burner I will then burn it to the higher format.If you are sure you want to go HD then this camcorder is a must have.", "Date": "June 6, 2010"}, {"Title": "6 Star Price, 5 Star Quality, 4 Star Controls", "Author": "Josh", "ReviewID": "R2TU5JXD610WTK", "Overall": "5.0", "Content": "This thing is compact, which is a good thing for most applications.  It can pretend to be a consumer camera because of it's size.  Slapping on a directional shotgun mic really improves audio performance, so no need for the XLR adapter unless you are planning on plugging into advanced audio equipment.Here's the good.  Nice optical zoom, nice view finder and foldout viewer.  Video files look very good, you can really tell this is a 3cmos camera.  Audio quality from the shotgun mic I slapped on (not an XLR, no need because the cord is short and won't act like a huge antenna) is very good, while the built in is passable.  Files are very easy to work with, however see my tip at the bottom.  It's really cheap for a 3cmos, making it tempting as a starter camera for new videographers, and as an extra camera for those looking to expand their hardware on a budget.  Class 6 is the fastest SD card you will need, no need to go higher, the camera doesn't push out any more bits than what a class 6 should handle, I find I get pretty good millage with a pair of 16 GB cards.Here's the OK.  It's tricky to do a smooth zoom with this camera.  I believe you can change the setting to have the ring control the zoom which might help, but still might be awkward if your hand gets in front of the viewfinder somehow.  Lots of control options for balancing color, and how open the iris is.  Autofocus is maybe OK, if filming a non-depth moving target, or even a stage from a distance, do yourself a favor and turn the auto-zoom off.  Brightness levels are hard to discern as well.  The viewer may make it seem not as bright as it is, so be careful how far you adjust the iris settings, or you'll end up with video that is washed out because too much light was let in.  The flip side is the 1/4 CMOS is not the biggest, and low light may end up a little grainy, but I still think it does just fine with the proper settings.  If the light gets just too low, you're in trouble almost regardless of the camera, so maybe get some lights?  Only other semi-gripe is that there is only 1 SD card slot, but with how long each card can go, you'll be hard pressed to find an event where you can't get a 'tape' change in, you'll probably be needing a break as well at that point.I really don't have much in the way of 'bad' to say about this camera.  As far as I can tell it's just a compact camera that performs at/nearly a professional level.  I find the size/price it's greatest assets.For post processing the best advice I can offer is to take the files off of the fat32 formatted SD cards, and get them (if you're using windows) onto an NTFS drive.  Then take all the mts files and merge them into one file.  The easiest way by far is to open up a terminal, cd to where the MTS files are andcopy /b .\\*MTS .\\OutputFile.MTS(this command will combine all files ending in MTS and put them into one file called OutputFile.MTS, which you can obviously change the name to whichever suits you)The reason for doing this is that all the video editing software I have tried did not properly get the audio for the end of each MTS file, and you have audio gaps and video stutter (about 1 second at the end of each MTS file).  I should point out this only happens when files exceed the 4GB Limit of the FAT32 file system.  There are tools and such to combine files, but just shoving all the bits together is all they do anyway, and a copy command can handle this nicely.  I've heard a couple editors will do this seamlessly, but not any I have.  Took me over 2 hours to figure the copy trick out, hopefully I'll save someone some time.If I had the option of giving it a 4.6 out of 5 I would, but I'll just have to round up and give it 5 stars.", "Date": "June 4, 2010"}, {"Title": "Good camera horrible tech support", "Author": "Edward Macomber Jr.", "ReviewID": "R1IEZDFXPSCQ7W", "Overall": "3.0", "Content": "This is a excellent camera, professional results the whole 9 yards. But don't expect ANY tech support, not any, mind you, you won't get any response from panasonic. I didn't well maybe in 5 days any way, at these prices I should have expected the best support any company can give. Not from Panasonic, the ironic thing about all this, is the manual if better written could have avoided all this  grief.They need to upgrade their support. It is sad that such a good camera is crippled by such a callous disregard for their customers. If you by this camera good luck in getting support!", "Date": "July 12, 2010"}, {"Title": "Best camera in it's price range", "Author": "M. Lozano", "ReviewID": "R15GFJ71TVZ7CN", "Overall": "5.0", "Content": "I've owned this camera for about two months now and I believe I've found the holy grail as far as the best quality picture producing camera in it's price range. HD is one of the best inventions that advanced technology has produced in the past ten years and the Panasonic AG-HMC40 is one of the best HD prosumer cameras on the market today. For twenty years I have been buying and using various brands of camcorders and have always stuck with Sony, but I have lately been impressed with some of the new AVCHD cameras from Panasonic. I already own three other CMOS camcorders and have been impressed with the CMOS technology.  I would not hesitate a bit to recommend the AG-HMC40 to anyone looking for the best prosumer HD camera in this price range. If I had to pick a word that best describes it: \"spectacular!\"", "Date": "January 4, 2010"}, {"Title": "What an amazing tool for indie movie makers!", "Author": "R. Nuttmann \"session 7 media\"", "ReviewID": "R1OYMBZTL28UM2", "Overall": "5.0", "Content": "This camera is truly an amazing piece of equipment. It is so easy to use and so intuitive, I was up and running in no time. The focus / zoom wheel is smooth as butter, the menu is easy to navigate, the functions are easy to understand. The camera is light and compact, but big enough to feel like a real camera. The picture quality is amazing, and what a good price!", "Date": "September 20, 2009"}, {"Title": "Better than the HMC150, HVX200, and HPX170 - Literally the Best Camcorder Ever Made for Under $2000", "Author": "Plasma Productions", "ReviewID": "RITITZQ28ICER", "Overall": "5.0", "Content": "I am a professional filmmaker who has produced content for broadcast television. I would not hesitate one moment to recommend the Panasonic AG-HMC40 to anyone looking to get into the world of professional videography without breaking the bank. The HMC40 was the camera I started on, and it was so good I bought a second! Although I have since upgraded to higher-end cameras including the AF100 and Sony EX1, I still find myself picking up the HMC40 to shoot with it. Yes, it's just THAT good!This camera has a decent \"full auto\" mode for the beginner, but in all honesty, if you are going to use full auto you could get a less expensive handicam. The HMC40 is perfect for that person looking to transition from \"full auto\" to professional. Turning off full auto, you can choose automatic or manual control over exposure, white balance, and focus all separately - so you can easily choose how much you want to control, and how much you want to set to \"auto.\" This makes the learning curve very easy!As a professional, I shoot everything on full manual, with the exception of using autofocus when shooting fast moving action such as sports. The HMC40 is a professional camera loaded with every control a professional could possibly want. I especially love the SCENE FILE menu. It's literally the same menu settings found in the HMC150, HVX200, AF100, HPX170, and even the high end Varicam cameras used to shoot Star Wars Episodes I and II. You can select from several awesome gamma curves such as Cine-V for a high contrast, cinematic picture right out of the camera, or Cine-D with dynamic range stretching (a feature even many high end cameras don't have) for a flat picture perfect for color correction.This camera is SHARP. We're talking images so sharp you can almost cut yourself on them. Go into the scene file and turn up your DETAIL and V-DETAIL settings to get the sharpest possible image. Although this introduces a bit of noise into your image, you can also turn up DETAIL CORING to remove that noise. Contrary to popular belief, the HMC40 is actually BETTER than the HMC150, HVX200, and HPX170 in terms of sharpness. The HMC150, HVX200, and HPX170 all have low-resolution 960x540 sensors that then up-scale the image to a fake \"HD\". The HMC40 has true HD sensors that output an actual 1920x1080 signal. In proper lighting the HMC40 is MUCH sharper than the HMC150, HVX200, and HPX170, despite being half the price!! It's even sharper than the AF100. In fact, it's so sharp it almost rivals my Sony EX1 (a $6000 camera). You cannot find this kind of sharpness for under $2000 anywhere else. Period.The three programmable user buttons are pretty sweet. I use button 1 for PUSH-AUTO and button 2 to pull up my waveform monitor. Yes, you read that correctly. This camera features a professional waveform monitor - a feature even the Sony EX1 doesn't have! It's SO much better than a histogram. And it also comes equipped with an expanded-focus button so you easily can grab perfect focus every time. This is a feature the more expensive Panasonic AF100 doesn't even have! I'm amazed that Panasonic packed SO MANY features into such a small, inexpensive camera. The HMC40 is simply a miraculous deal of your money.CONCLUSION: If you want to easily and affordably shoot true professional quality REAL FULL HD video (not a cheap imitation of HD like the HMC150) and also look professional while doing it, this is the perfect camera for you. Get the XLR adapter so you can hook up a professional mic or plug into a mixing board. Attach a shotgun microphone and you've got a pretty impressive professional camcorder that is sure to impress your clients. There are many lightly USED ones selling on Amazon in excellent condition. If you buy it used like I did, you can get an awesome camcorder for entry level professional videography or filmmaking at an amazingly good price!", "Date": "August 17, 2013"}, {"Title": "Great video, not so sturdy", "Author": "Gaji", "ReviewID": "R8TIXXJABUIR9", "Overall": "4.0", "Content": "Just got my camera today and played around with it a little so this is based on first impressions only. The video is brilliant HD, especially under decent lighting conditions. Under low light you may have to play a bit with white balance to get better results and also perhaps, go to manual focus.The build of the camera surprised me a little as this is supposed to be a prosummer camera. To say it politely, it is less than sturdy. The camera does come however with a 3 year warranty (activated once you register) so Panasonic at least believes its good for 3 years of semi-pro use.And here's a bit of info that would have saved me a lot of time: the camera does come with an external battery charger. It also comes with a really small battery - you may want to get Panasonic's 5800mAh VW-VBG6PPK battery [...]).[...].", "Date": "September 11, 2009"}, {"Title": "good camera but beware", "Author": "niles spohr \"danny boy\"", "ReviewID": "R2AEGHITIDOAZ3", "Overall": "1.0", "Content": "Don't be surprised if you receive the AGHMC45 (I did), which really is the same camera but you won't be able to register the warranty because AGHMC45 was originally sold in the Japanese market, not North America (false advertisement). Do not buy this camera from amazon. Find an authorized dealer. I really got screwed on this one.", "Date": "May 17, 2013"}, {"Title": "Good replacement for the canon GL2", "Author": "Mindtek", "ReviewID": "R3V6YO7YNZGEC", "Overall": "5.0", "Content": "Many Videographers who shoot weddings may be wondering how the Panasonic HMC 40 holds up for wedding videography. I was looking for a replacement for my aging Canon GL 2's and wanted to go to a tapeless system. I purchased two HMC 40's well aware of the reviews about this camera not being good in low light situations such as reception halls. Having shot about 8 weddings with these cameras I couldn't be happier with my results. The Panasonic HMC 40 is similar to my GL2's in low light level situations with a couple of exceptions. In low light levels at receptions I noticed that background lighting showed up better and was warmer looking than my GL2's and that there is much more manageable low noise in low light level situations. I also make use of the newer and cost effective 160 LED lights that are easy to find on eBay for about $60.00. I use one on my camera and I put two of them on stands during the reception. These lights are so inexpensive and light weight/ compact that they give me almost complete control over my lighting on the reception dance floor. So in worst case situations I am using three LED lights.. One on camera and two remote. The lights last all night long on six aa batteries they run on and the camera is a fantastic product... The adjustments from the menu provide amazing results. I also love the fact that I don't have to worry about changing tapes. I bought the extended battery which runs the camera for around 7 hours... A 32 GB SD card will record 3.5 hours of 720 P HD video ... I use one card for the whole wedding with memory to spare. If you are a wedding videographer I would recommend this camera to you. There may be a few other cameras out there with a bit better low light level capability but frankly they are much more expensive than the Panasonic HMC 40. As a bonus the camera is much lighter than the GL 2's and you will feel as if you have a little more energy at the end of the night.", "Date": "May 14, 2011"}, {"Title": "Great, but has a huge weekness", "Author": "Daniel Fried", "ReviewID": "R8GC3YE5ZPAZ8", "Overall": "2.0", "Content": "This camera is as sharp as it gets, handles well and is easy to use, however is has a huge weakness. I find it horrible in low light situations. Dark images are grainy,and full of noise. i got it for wedding work and I'm looking for a new camera now because this cant handle a dimly lit room.", "Date": "January 9, 2011"}, {"Title": "Terrible in low light", "Author": "Jeff Aski", "ReviewID": "R1DIKEJMP8WJC5", "Overall": "3.0", "Content": "The HMC40 is superior for it's price point. It has all the professional features you could ask for in such a small body.For outdoor daytime shoots, it rivals camcorders twice it's size and price. BUT in low light situations, it is one of the worst performing camcorders I have ever used.The Canon HV and HF series of consumer cameras gave better low light than the HMC40. Even the Panasonic TM700 was better and it has a similar chip set.The HMC40 has a lot of great features packed inside the ugliest body design ever made. When the camera first came out, I didn't even want to try it because it was so unattractive. But the images speak for themselves and in good light, this camera rocks.The next model, Panasonic needs to include:* Bigger sensors - 1/4 ain't cutting it.* Wide angle lens - at least 35mm if not 28mm, like the HMC150.* Sleeker body design - the JVC HM100 is what the next HMC should look like.* Dual SD card slots* 3\" or 3.5\" LCD touch panel - 2.7\" LCD is garbage.* XLR adapter included w/ camera, not optional.I recently sold my HMC40 to buy a Panasonic GH2. Although they are not the same kind of tools, I am able to adapt my GH2 to do all the things the HMC40 could do and much more.", "Date": "March 13, 2011"}, {"Title": "better quality image from my sony dcr-sr85 hard drive", "Author": "Lucy Lopez", "ReviewID": "RJG76Z9MW6WUH", "Overall": "4.0", "Content": "After comparing the panasonic AG HMC70 and this one,I decided to buy this one because the customer reviews said it was better.it has a better image than my sony dcr-sr85.It's less grainy compared to my sony but still shows noise on the shadows but I intent to use it with a video light so I'll post later the results.I messed with it with different settings,with the 1080/60,1080/30,1080/24 and my conclusion was I will have to use a video light on dark places;even in my office where the sunlight don't hit in the corners of the room it looks grainy.I did read here that many people bought an extra video mic.,but after watching the few minutes of footage of my dog,I noticed the volume was fine.So my guess is that it will be fine when filming an event with the loud music from the band playing.I didn't like it that it has a \"demo indexed manual\" you have to put the cd that came with it in the computer and print the PDF FILE so you can easily read it when need it.The included software was useless for me,after I had to register the camcorder and then get the serial number from the website...I realized it don't open the files,I don't know why.But I'm not planning to use it since I have Sony Vegas movie studio platinum 9.0 and I have already test it and it works fine.It doesn't include a mini USB plug like the one that comes with the canon DSLR cameras,so I used that one to connect the camcorder to the computer and then press \"PC\" on the screen on the camcorder and it opens a window that it says \"Disk G\" then I clicked on different subfolders and then the files are on a folder called \"stream\" and I just drag them to \"my documents\" to save them.And to edit them I drag them from my \"documents\" to the sony vegas software.It doesn't include a memory card so I had to buy one,I bought a transcend 32GB SDHC class 6,and many customer reviews had different opinions about different brands and my conclusion was to buy a 32gb SDHC transcend($100) and 2 kingston 16GB SDHC class 6($65/each),so in case they get goofy either one of them I'll know which one to buy next time and the 16's in case one of them looses the data I won't loose everything at once.I hope not, because I wouldn't like to loose important footage.The manual on the camcorder says that you can loose data if you take in/out many times the memory out of the camcorder so...is staying in,and then to get the data off of it I will just plug the cam to the computer.The battery last 3 and 1/2 hours so I won't buy an extra one,since I always plug the AC/DC to it.", "Date": "April 30, 2010"}, {"Title": "Amazing Camera Is A Dream To Use!", "Author": "Peter Suslock", "ReviewID": "R24XJZFY4MLMDX", "Overall": "5.0", "Content": "When looking for my first Professional Video Camera I researched for months, talked to everyone I knew who shot video and had knowledge of these types of cameras and scoured the web hours on end for reviews, information, joining and posting questions on forums and so on.A friend of mine since childhood is a well known independant filmaker and a huge help in directing me towards a camera I could both handle right away and grow with. After deciding against buying a DSLR he suggested I go back and really take a hard look at the feature set of the HMC40. In addition to superb video -the still images are equally impressive and stand up to any high end SLR so it is in every way two excellent cameras in one.Other models with a similar  set of features and perhaps a few more bells and whistles for hard core pros bumped the price up to 3 grand and higher - way beyond my budget and needs. At less than 2 grand the Panny HMC40 was still a reach but it was looking better and better.The camera is intuitive to use, crystal clear results and no moving parts whatsoever. No belts no heads - no internal moving parts at all - one hundred percent a solid state device. To me, this meat two things, much less that break and or go wrong and no internal noise to get picked up by the built in microphone. The camera is built to last and packed with features.I love being able to use memory cards over tape or a hard drive to capture images and sound. Both recording and transfer is effortless. On auto the camera does virtually everything you can think of and more.One other big plus is the internal Mic - it's brilliant. It does a great job capturing rich, clear true stereo sound and is adjustable for wind and ambient noise reduction. At first I thought I would be using the XLR adapter and shot gun mic most of the time, now I rarley if ever attach it.The menu is simple to read, easy to navigate and the LCD screen is always bright and clear - easy to read your recording speeds, sound levels and more at a single glance even in bright light.This is a wonderful camera you can grow with as it's capable of doing so much more than you might expect. The compact design is sleek and impressive, trust me, it gets lot's of stares and questions. Although larger than any camera I've owned it's beautifully balanced, easy to hold and a cynch to take most anywhere.This has much to do with the included handle, which is also great for low shots plus it has a hot shoe for extra lighting or an external mic. Although I have a Panasonic mic adapter and good quality  mic I find myself never having to use them as the internal mic is simply wonderful. The sound is rich and complex and the built in ambient/wind noise reduction is excellent.Low light performance isn't stellar. I would think it's fine for average use, especially if it's not completley dark. But for professional looking night shots you'll need lighting. It's the one disapointment of the HMC40 that really does stand out. In my case almost all my filming is done in a home chromokey studio rigged with plenty of lighting. Or outside events with family and friends. So the poor low light performance wasn't a deal breaker. However if great low light performance is very important to you - and you don't own and or don't wish to invest in proper studio lighting - then this may not be the camera for you.I would also add that Panasonic has dedicated Pro camera Support and they're terrific, I don't say that about tech support in general but this is a welcome exception.You may have to wait a bit but you'll never be rushed off the phone and chances are you'll never hang up frustrated. These folks know their cameras inside and and out and seem to especially enjoy working with a novice like myself. You get a dedicated 800 number and my expericance has really been excellent - I give the Pro camera division of Panasonic the highest marks as they have proven to be just superb.My first camera which came from a seller named Big Value. It nt only defective (the internal mic was broken) it turned out to be a Gray market intended for sale in Asia only - however when the seller refused a replacement or refund Amazon stepped in and corrected the problem.I would say when buying something this expensive it's always best to look for \"sold and shipped or fulfilled by Amazon\". Because if something goes wrong with a marketplace seller you're at their mercy.**Regarding additional coverage**I had added a four year \"accident Protection\" plan to my cart because it had the Panasonic logo and I thought it was protection backed by Panasonic. However this was not the case. When I was registering my camera I asked about the protection I had purchased and Panasonic informed me that they don't offer extended protection plans.In fact if your camera shows signs of being repaired or serviced by a third party in this case a company called \"Service Net\" my 3 year warranty would be void. Considering the average cost of repair out of warranty is $600 and Lens replacement over $1,000 I wasn't going to take any chances however Service Net refused a refund and I had to open an A-Z complaint to finally recieve a refund.Always speak to the OEM regarding extended care plans - period.Under your coverage for this camera every single thing except loss or theft is covered by Panasonic.The HMC40 is a perfect choice for most anyone and well worth the step up from consumer cams that just can't come close to matching the breathtaking picture and sound quality of the AG HMC40. The results, ease of use, short learning curve and after sale support is excellent.This is a brilliant Pro camera in every respect.", "Date": "November 29, 2012"}, {"Title": "panasonic ag-hmc40 avchd camcorder", "Author": "studentbrian", "ReviewID": "R2TORLVB7D3ZM4", "Overall": "4.0", "Content": "The truly best camcorder i ever owned. too many features to list here. get on manuf website and see them. it packs a lot of features and enough buttons on the side to still be user-friendly without crowding you with 'too much button syndrome'.Great low-light filming ability. Excellent stop/start timing.Excellent lens view and style. I love the multiple user settings feature, though I have not used it yet.The audio quality is great!! With or without ext mic, the sound is perfect.What I am not happy with is that the handle screws did not go in properly all the way for me. 2ND Thing I was not happy with is the size of the LCD and the viewfinder. You cannot see anything through that tiny viewfinder.HOPING they increase LCD size on next model.", "Date": "June 30, 2013"}, {"Title": "Great Camera", "Author": "Jerry Richardson", "ReviewID": "R26TBNUZGYOJOB", "Overall": "5.0", "Content": "My first Hi Def camcorder after years of filming with GL2's and this camera is the bomb! Love it. Simple settings, straight forward recording operations with plenty to set manually if you desire. I film motorsports in the 720/60P mode and footage is great. Low light could be a little better but it has to be a very poorly lit place to make a difference. Panasonic hit another Home Run with this camera! Only thing I strongly recommend is a Wind Cutter for the cameras stock Mic.", "Date": "May 10, 2013"}, {"Title": "Fantastic camera!", "Author": "C. Maziarz", "ReviewID": "R32XAJOLXTU8Z2", "Overall": "5.0", "Content": "This is an amazing camera!  It is so much more advanced than anything I've used.  I decided on this one based on reviews and on its specs since it has everything I require.  I use 2 other Panasonic HD cameras but needed to move into a pro camera and decided to keep it in the family, so to speak.  I am not disappointed!  I would recommend buying the HMC Book so that you can get more from this camera since there is so much to learn/know.  This is the biggest camera I've ever used but it is surprisingly lite!  I used it for several hours today at a pet expo and my arm never got tired.  I also got some great footage!  It was a little annoying having to go to the Panasonic website to download software in order to get the footage off of the SD card and to view it.  A disk is included with the manual and some other items . . . would it have been that difficult to include the software to actually be able to do something with the footage?!One concern . . . I tried to register the camera on the Panasonic website and it wouldn't work.  I contacted Panasonic and was told that the information provided didn't match their records.  I was further told that the country of origin was the culprit.  I contacted the company that fulfilled the order and they offered to provide me with anything I needed to resolve the issue.  I have yet to do this but at least I know the company I purchased it from is willing to help out.", "Date": "March 17, 2013"}, {"Title": "Tops except tech support", "Author": "Dennis R. Whitehead", "ReviewID": "R2TE8QPLPNQEGZ", "Overall": "4.0", "Content": "I purchased as AG-HMC40 as a compact HD travel camera. Indeed, it is a perfect size for that purpose and the images are terrific. The ability to switch to Manual is a real plus and easily done. The on-camera audio is surprisingly good, although omni-directional. I also purchased the XLR adapter which is a must and something Panasonic should have included.The one BIG ZERO is Panasonic Technical Support. I cannot believe how bad, or non-existent, it really is. It took three calls to finally get partial answers to my five basic operational questions. The first two times I called I was told an \"engineer\" would return my call. An engineer for a remote question? Well, I never heard from them anyway. On the third try, the answering person put me on hold to consult sources.I purchased the camera in a run-off between the HMC40 and the JVC GY100. Neither camera comes with a lens of any practical width but that's the nature of small-chip cameras. The Panasonic has enough additional lens to tip the balance. I wish the Panasonic had a second card slot, like the JVC, and XLR outputs, also like the JVC, but I'm happy with my purchase.Finally, Amazon service was excellent. I wish they'd have carried it in their own stock but it shipped right on time.", "Date": "September 27, 2010"}, {"Title": "Great, convenient, high quality", "Author": "N. Nelson-Hopkins", "ReviewID": "R1AOII3AB7FUWI", "Overall": "5.0", "Content": "I recently upgraded to this camera and am very satisfied.  I am a film student and the Hmc40 fit perfectly with my budget.The image quality is indeed awesome, and the battery lasts extremely long.  Almost unnecessarily long compared to my last cam.I highly recommend it", "Date": "December 21, 2009"}, {"Title": "Great Camera!", "Author": "Craig H Strutt", "ReviewID": "RHJVE1F8G82U0", "Overall": "5.0", "Content": "It's done everything I want it to.  It feels substantial.  I has all the features I could want.  I was worried about lower light capabilities, but it has handled everything I could throw at it!  Recommended.  You'll never go back to tape!", "Date": "April 19, 2013"}, {"Title": "Great prosumer camera for the price. Shot indie feature with it", "Author": "Yeppers", "ReviewID": "R3CUBBJCDFHATM", "Overall": "4.0", "Content": "The Panasonic hmc40 is a great prosumer camera for the price range. I shot an indie thriller feature film with it. Makes GREAT images when using outdoors or in well-lit areas.I also got the XLR audio adapter, with an Audio Technica mic. Works great! CLEAR sound.Only con - Low Light performance is not so good. However, the gain isn't too bad on this cam, feel free to 'boost' a little if needed.", "Date": "December 19, 2012"}, {"Title": "Average camcorder quality images", "Author": "J Kiggs \"JKIGGS\"", "ReviewID": "R1SMC5YSGKH7AC", "Overall": "4.0", "Content": "I have had this camcorder for over 2 years now I shoot weddings small events and music videos. I only wish this camcorder has XLR inputs (I had to buy an adapter otherwise the video quality in good lighting is okay but in low light definitely an external source is needed. I like the light weight and ability to add other pro equipment seamlessly (though at a price) for the cost I believe this is a bargain I recently compared my footage with a DSLR enthusiast and he was wowed sure he had the depth of field but i can tweak my camcorder and get very good film looks in the manual mode too. please check out some of my footage on YouTube \"JKAGOSO\" and you'll see what I mean.", "Date": "November 27, 2012"}, {"Title": "Excellent Prosumer Camera", "Author": "Lee Shapiro", "ReviewID": "R27UZF2HCAF4TG", "Overall": "5.0", "Content": "I just received my Panasonic AG-HMC40-P and have been checking it out for most of the day. I also purchased a Rode directional Videomic with it, which I highly suggest.  The on camera microphone is good, but you can really hear a difference with the \"shotgun\" mic, it's very directional, which is good because it cuts down on the sound surrounding your scene, including the cameraman.  The picture quality is excellent, but with these specs you would expect it to be.  It's a little bigger than I expected (not your typical tiny hand held) and if you plan to use a tripod, make sure its a strong, solid one. Because even though the camera doesn't weigh THAT much, it's still heavier than a typical SLR or consumer video camera.  The tripod I have was made for consumers and it's pretty wobbly and I wouldn't trust it in a strong wind.  Definitely worth investing in a sturdy, professional tripod.The only things I can think of that are slightly negative is that it doesn't have a very wide lens.  Other models offer a wider lens and I could have used that.  I do a lot of in-studio chromakey work and I can't move the camera back far enough to get the entire green screen.  Hopefully this camera has the ability to swap lenses.  I'm not sure about that.  The other minor complaint is that the LCD touch screen is very small, it's big enough to see the picture well enough, but if you have big fingers, it's hard to push all the buttons.  But fortunately it comes with a plastic key pointer made specifically for the touch screen.  I'd still rather use my finger though, because it's a hassle to carry the key around with you, get it out of your pocket every time you want to use it.  But as I said that's just a very minor complaint, no where close to a deal breaker.So all in all, it's a great camera, especially for the price.  I did a lot of research before I purchased this camera, and I don't think you could find a better camera (with all the features) for this price.  It's got a handy remote control too, that's a nice plus.", "Date": "March 5, 2012"}, {"Title": "very bad at low light", "Author": "iggy", "ReviewID": "R14Z5CRWJ8XRX2", "Overall": "2.0", "Content": "very bad at low light & audio you need to have light most at the time.i didn't liked.I hope this will help.", "Date": "March 29, 2013"}, {"Title": "Love the camera", "Author": "Randal S. Ford", "ReviewID": "R3PNT8JD9ZGJG1", "Overall": "5.0", "Content": "This is the best purchase I have ever made for a camera.  It is everything it is supposed to be and quite simple to use.  Very good packaging also.", "Date": "April 1, 2014"}, {"Title": "Great Camera BUT NO MIC", "Author": "Michael S.", "ReviewID": "RWBQV6FOOWEGU", "Overall": "2.0", "Content": "Great camera! BUT if you are buying this one forthe mic... THERE IS NO MIC! It comes with the mic adaptor but no mic. If you buy this you will also need a mic. Other than that it is a great camera and I would definitely recommend it as a low budget HD camera!", "Date": "January 27, 2014"}, {"Title": "Great Bang for the Buck", "Author": "Stan Arthur", "ReviewID": "R1BV9HJ840PZZZ", "Overall": "5.0", "Content": "I have three of these cameras that I use in a green screen TriCaster studio. It does not have HD-SDI output, but the price and picture quality make it a good camera for just about any ENG purpose.", "Date": "November 29, 2013"}, {"Title": "Moving from Handcam to HMC 40 - of course it is better ;-)", "Author": "Scott Spence \"Crazy Colour Card Man\"", "ReviewID": "R378VP7UCQG0G7", "Overall": "5.0", "Content": "I was using a Sony handycam before  so this is a huge improvement, I am waiting on my HMC book but have already found lots of information on the internet. Do consider an HMC 150 if they are out there - many people claim that the 150 is superior, but more costly? I am waiting on my Rode NTG-3, to get some really nice sound..", "Date": "November 16, 2013"}, {"Title": "Excelente", "Author": "Gerald Moran Garcia \"gerald_moran\"", "ReviewID": "R2FMNTVKIXU78U", "Overall": "5.0", "Content": "Gran definicion y calidad de imagen, es liviana y facil de maniobrar para llevar en la mano. Estoy satisfecho con la compra.", "Date": "March 7, 2013"}, {"Title": "price & video quality in one", "Author": "Francisco Pablo", "ReviewID": "R7IX71DFBT7ZR", "Overall": "5.0", "Content": "its a good sum of price & quality combine to keep us with the trend and in competition in video coverage.", "Date": "March 6, 2013"}, {"Title": "New To This Product!", "Author": "Kenneth Webb", "ReviewID": "RITLOEH76BOH3", "Overall": "5.0", "Content": "I GIVE THIS PRODUCT 5 STARS ONLY BECAUSE i COULDN'T CHOOSE 4.5. So far I am very pleased with the Panasonic AG-HMC40P. It is light weight and easy to learn the operations.The Delivery was right on time as they promised and I would recommend AMAZON because they are Amazing!!I haven't had the camera long, but I know I'M GONNA ENJOY PLAYING WITH IT.", "Date": "March 3, 2013"}, {"Title": "Panasonic Professional AG-HMC40 AVCHD works", "Author": "Starving Artist", "ReviewID": "RFT9RDO1F8RU9", "Overall": "5.0", "Content": "It worked. That's all I care about. Time is money. It does what it says it is supposed to do!", "Date": "February 20, 2013"}, {"Title": "Bulky and has Lighting Issues", "Author": "Nicholas H. Schreck", "ReviewID": "R13IVBE5CFZCUD", "Overall": "3.0", "Content": "I have owned this camcorder for a year now and I have done a lot of work with it.  I have to say that it is very bulky and doesn't work well with a steadycam.  The auto iris feature is just junk.  Your video will lighten and darken for no reason, even in indoor shots!  It is better to just turn that off.  Still it does take a good quality video.  I wouldn't recommend this camera to a friend but then again the issues haven't bothered me enough to sell mine yet either.", "Date": "June 12, 2012"}, {"Title": "nothing less than excellent", "Author": "Alyan", "ReviewID": "RGPH3GPDA6B0W", "Overall": "5.0", "Content": "Awesome camera I love it.. in great lighting the camera is phenomenal can't think of anything that compares for the money.. like all the reviews say... Terrible in low light but managable iris works well but going too far makes it quite grainy but Defanitly workable even with the down side its a terrific camera, absolutly love it", "Date": "September 26, 2011"}, {"Title": "Impressive Camera", "Author": "Craig Snedeker", "ReviewID": "R33GYN86X2CQH8", "Overall": "5.0", "Content": "I got this camera last year because I wanted something cheap and yet something that shot good-quality footage. I wanted to \"take it up a notch\" from my old Canon FS100 which I had before. I had previously bought a Sennheiser Mic before (for a MiniDV camera which I sold on eBay) and it worked well with the HMC40.The HMC40 shoots really clear, crisp footage in full HD. It's loaded with professional features and manual options that really sets this camera apart from anything I had before. Although this camera is pretty bad in low-light, it has good quality, and I am very happy with my purchase.This camera has shot commercials and even some B-Roll for TV shows and documentations.", "Date": "September 1, 2011"}, {"Title": "Great camera", "Author": "Robert J. Hahn \"Robs Videos\"", "ReviewID": "RAD8IGVC51IIB", "Overall": "5.0", "Content": "I am a Certified Legal Videographer. This camera is perfect for depositions or other legal video uses.It has time and date with seconds. It has easy manual controls and the image is excellent.The files are stored on 32GB SDHC cards and the camera comes with easy to use editing software.I also shoot weddings with this camera and it works great. I am going to buy a second one.", "Date": "December 27, 2010"}, {"Title": "Panasonic AG-HMC40", "Author": "allen", "ReviewID": "R2OLCSCUS16DJ1", "Overall": "4.0", "Content": "I bought this camera to shoot stock footage and it does a great job.  I wish it had a few more manual controls that were not done via touch screen.  Other than that really it does a great job.  The camera has lots of features, and for the price just can't be beat!", "Date": "July 14, 2010"}, {"Title": "Picure quality lacking indoors or low light", "Author": "J. Tyler \"the original JT\"", "ReviewID": "R1AG6OTND7FDGZ", "Overall": "2.0", "Content": "I really wanted to like this camera.  The feature-set is good and I prefer AVC for native H.264.  Unfortunately, the image quality is poor in low light or general indoor conditions, making it unsuitable for documentary-style filming or other scenarios where you are not if full control of light levels.If you are shooting outdoors or in a studio with lighting, this is a good pro-sumer camera for the price.  It is also a great compact size if you need to travel with it often.", "Date": "January 5, 2013"}, {"Title": "HMC40", "Author": "Katie Allred \"Katie Allred\"", "ReviewID": "R32ZPEIAQVNZ2S", "Overall": "5.0", "Content": "Great camcorder, takes amazing shots and really does high definition justice. It also has an amazing zoom. I would recommend this camcorder to the amateur videographer like myself.", "Date": "January 3, 2013"}, {"Title": "Great great GREAT!", "Author": "Yela", "ReviewID": "R35295ZDI57SZH", "Overall": "5.0", "Content": "Thos is a GOOD camera. Easy to use, good quality, as described! I love it!! You can record TV quality with it!... I owned a Advertising Agency, and we have used it to some clients TV ads, and It's great! The quality is great and they are satisfied! :)Highly recommended. We are planning to get a second one of this, because is worth.", "Date": "November 14, 2011"}, {"Title": "Excelente", "Author": "Ronald", "ReviewID": "R2XQ93ARDBAQIN", "Overall": "5.0", "Content": "Tengo 2 meses de haber adquirido esta camara, me considero estar en un nivel intermedio en cuanto a creacion de audiovisuales, y puedo decir que estoy mas que satisfecho con el producto. Una vez que practicas con las diferentes configuraciones que tiene la camara, se logran resultados de excelente calidad. La parte de fotos que en realidad casi no utilizo, por no ser de mi interes, tambien se logran excelentes fotos en ambientes iluminados al aire libre. Con respecto a los comentarios de la calidad del video en condiciones de poca luz, no veo que sea mas grave que las demas camaras que haya utilizado, y jugando un poco con el iris y el drs, se puede mejorar bastante. En conclusion, puedo decir que por el precio se obtiene un producto de muy buena calidad, lo recomiendo!!!", "Date": "February 7, 2012"}, {"Title": "Professional Camcorder", "Author": "M. Everest", "ReviewID": "R12IY8N92X4L3B", "Overall": "5.0", "Content": "Very difficult to get started because Booster software had to be ordered and mailed.  The Serial No. on the camera is not the Serial No. used to register the product.  The Serial No. has to be obtained on-line.  Panasonic website is quite difficult to manuever.  It was very difficult to find anyone who knew anything about this new camera.", "Date": "February 6, 2010"}, {"Title": "Need converter for MAC", "Author": "John S \"Avid audible listener for over 10 years.\"", "ReviewID": "R21J08TFGDYXAK", "Overall": "1.0", "Content": "I bought this  camera thinking that the camera would would work directly with an Apple MAC.  it does not. The output formant (MTS) requires a converter. Of course they don't  include this. I bought one for $69. Also they have a 3 year warranty that gives you a URL to register. The URL does not work, it defaults to a page that is in Japanese.", "Date": "September 10, 2012"}, {"Title": "Bad pixel out of the box.", "Author": "seagullfilm2008", "ReviewID": "R3LIQGMQMOXKJ5", "Overall": "1.0", "Content": "I received this camera today and on my first look I found a bad pixel. This must be a reject product that Amazon is selling. I'd like for Amazon to contact me and Panasonic and get to me a camera that operates as correctly.", "Date": "October 21, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002I9S9PE"}}