{"Reviews": [{"Title": "awesome camera for someone who wants a special edition", "Author": "emk", "ReviewID": "RFIVI8CHXAIH3", "Overall": "5.0", "Content": "If you have the money, and want a special edition, this is fabulous.  Pay no attention to the ridiculous 1 star review.  The D-Lux 4 is an awesome, intuitive camera.  It is best if you have some knowledge of photography before hand, however the manual is great and you can learn with this camera if you are a beginner.If you aren't a Leica fan, oh well, but if you don't own a D-lux 4 or at least used one extensively, it's pointless to rate it.  That was just for you, Timothy. :)", "Date": "October 19, 2011"}, {"Title": "Leica D-Lux 4 Safari Edition", "Author": "Anonymous", "ReviewID": "R2AXBBE8DJTG2O", "Overall": "5.0", "Content": "I purchased this exciting camera almost 4 years ago from Amazon for much less than this price, and to this date have absolutely no regrets. These are the best family, travel, landscape pictures that I have taken in my 40+ years of photography and cameras, starting with the Diana, Ilford Sportsman, various Nikkormats, Canon FT QL, various Olympus pens, Nikon D40X and D5000. I shoot as many B&W; frames as color but almost always in JPEG as I do not like spending time post processing RAW. These days I am curious about the FX format Nikon D600 \"as a second camera\" as it works well with my vintage Nikkor glass. It seems my D-Lux 4 will continue to remain as my go to camera due to portability, performance and more importantly the many years of fulfilling experience.", "Date": "March 18, 2013"}, {"Title": "arrive very fast.", "Author": "Jiayi Li", "ReviewID": "R17GDAB1HM1YNU", "Overall": "5.0", "Content": "The product is exactly what i want.And it arrived really fast, just the next day i purchased it. So surprised!", "Date": "February 17, 2013"}, {"Title": "A let down to the Leica brand", "Author": "T. Hunold &#34;TestShoot&#34;", "ReviewID": "RAMOXYECXSM3Y", "Overall": "1.0", "Content": "I am a Leica lover, I still shoot III series cameras. The safari angle is cool, but for more than an extra thousand dollars on top of the overpriced D-lux 4 anyway. You'd have to be very brand loyal and hit the lottery to consider a horrible camera such as this.Image quality is on-par with $300 Sony's, the low-light is dreadful cameraphone quality. The menus are a pain to navigate. I am used to using my Lumix DX-33. It is clear that these cameras are the best they can be, but the case is redesigned and the dot added to make it a Leica.To be totally honest it is just buying the dot. The V-lux series are much better. The top of the range Sonys, Nikons and Canons are all better in image quality, ease of use.Back to eBay with this overpriced junk.", "Date": "October 31, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002PYXT0M"}}