{"Reviews": [{"Title": "A Solid, Affordable Network Camera", "Author": "R. W. BELL \"rbell95\"", "ReviewID": "R1VZV1L6BOZXY3", "Overall": "4.0", "Content": "This LevelOne network camera is a great solution for watching the front door while I'm at work in my home office.  I can keep a small window open on the screen and get a real-time view of what's going on in front of the house.  Another cool feature is its ability to notify you via email when there is motion in the area the camera monitors.  I can also watch the view from my iPad simply by directing the browser to the camera's IP address.I'm not a geek but I have a fair amount of experience with computers, and I found the setup to be relatively easy.  I did have to do the original setup with a wired connection to my router.  Once connected to the router, you can set the device for a wireless connection, which makes the camera a lot more versatile.A few quibbles: The power cord is a little short for some locations.  Also, the location of the power plug jack on the back of the camera limits the possible angles you can mount the camera.  I thought initially that I might mount the camera at a 90 degree angle from the base so I could put it on the vertical wall inside of a window, but the jack position doesn't allow the camera to go to a full 90 degrees.One other note: I normally use Firefox and I can view the video using that browser, but I don't have the controls available -- the volume, resolution, etc.  On IE8 an ActiveX app was downloaded and that seems to be necessary to have the controls.  I suspect there's a way to get the same capability on Firefox but so far I haven't figured it out.Overall, if you're looking for a reasonably-priced network camera, you should definitely consider this one.", "Date": "January 1, 2012"}, {"Title": "Great Product - Great Value - Added Touch of Security!", "Author": "aliceava119", "ReviewID": "R1M8H890AYWZG", "Overall": "5.0", "Content": "I just bought this product and it's all that I expected and hoped for! I purchased this mainly to keep an eye on my daughter who gets herself off to school in the mornings and is also home for a short time after school. We are able to watch from our work computers or from our iphones or ipads and make sure she gets off to school and home ok and on time.The camera was easy to get setup and is very easy to use. We are really enjoying the piece of mind we have with this.I highly recommend this for working parents who have children or pets at home!", "Date": "January 1, 2012"}, {"Title": "Good Value, Easy to Use", "Author": "will", "ReviewID": "RL0VGGFFV0FC9", "Overall": "5.0", "Content": "I like this product and I think this is a good value for the price.I set up the camera in my office and despite not being a technological whiz, I found it easy to set up.The user interface is also really easy and I was pleasantly surprised to see that I didn't feel lost trying to use it.The video quality was clear and the two-way microphone was an unexpected added bonus.I would definitely recommend this if you are looking for a wireless network camera or even a two-way intercom.", "Date": "December 28, 2011"}, {"Title": "Pretty nice for the price", "Author": "H. Lee", "ReviewID": "R116SIH94306IT", "Overall": "4.0", "Content": "I got this to monitor my front yard.  Some of my neighbors have not been cleaning after their dogs, and wanted to see who it was.  No confrontation, just curious.  Worked out great.The installation was relatively easy.  I say relatively, because on my desktop computer which has all kinds of virus and other protection would not even find the camera, but my laptop found it easy and then the rest was pretty much clicking \"continue.\"Picture quality during the day is decent for the price, pretty much nothing starting around dusk till dawn.The motion detection feature is great.  May need some tweaking for the sensitivity.  Birds flying and tree branches in wind will trigger the motion.Overall, I am happy with it.", "Date": "April 26, 2012"}, {"Title": "WCS-0010", "Author": "Justin", "ReviewID": "RHQTBEYN6Y0XU", "Overall": "5.0", "Content": "I got this camera as a Christmas present and have ahad a blast with it.  Setup was easy, just pop the disc in and follow the instructions.  The wireless feature is cool as well.  We mounted it in the living room with the included base, which seconds as a mount, and can watch our dog run around the house while we are at work from our smartphones.  Good picture quality and easy to setup, a no brainer if you are looking for an affordable network camera.", "Date": "December 30, 2011"}, {"Title": "Horrible Camera - Stay away", "Author": "Kruti", "ReviewID": "R3152WE4127CRQ", "Overall": "1.0", "Content": "I had bought the WCS-0010 camera but the camera gets disconnected from the network after 2 hours and becomes inaccessible from the internet as well as from LAN but for a little while the motion detection images come in. However, after I did the firmware upgrade even the images are not coming in. I have a Keebox camera which is on the same network and that camera has no issues. The manufacturer does not even pay for shipping of the defective unit to provide a replacement. I will never ever buy again from this manufaturer.", "Date": "October 8, 2012"}, {"Title": "More artistic than realistic", "Author": "Peterson", "ReviewID": "R1AM13GI1A51U9", "Overall": "2.0", "Content": "The quality of the images are sub-par. They sort of remind me of colored charcoal artistic renderings. One can get a better quality from the Foscam FI891BW or Loftek CXS3200, both of which offer panning and infrared, features that the LevelOne does not have.", "Date": "May 6, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0023RT0N6"}}