{"Reviews": [{"Title": "Remarkable little camera!", "Author": "\"Gimpy\" Peach Johnson", "ReviewID": "R2DMDB1QZ9YIXK", "Overall": "5.0", "Content": "My last digital camera was a 3.1 MP Kodak EasyShare DX6340 -- a nice little point and shoot in its day, but that was seven years ago! Though it still works like a champ, I decided it was time to upgrade to something a little more compact that also offered better picture quality *and* HD video. I spent over a month shopping around, looking at Canon, Panasonic, and Sony models, and toyed with the idea of sacrificing small size (and HD video) to go with the new Canon G11. Finally, I settled on the new SD940 IS as a reasonable compromise between size, features, and picture quality. I'm very happy I bought this thing -- so far it has really impressed me!This thing is TINY -- it's about the same size and weight as my old Motorola RAZR cell phone (when folded closed). Still, it feels quite solid. Despite the compact size, it delivers amazing performance. It boots up quickly, menus are snappy, and shot-to-shot delay is minimal. Picture quality is very good -- nothing extraordinary, but nothing to sneeze at either. I shot a number of test photos over the past couple days and I'm quite pleased. Macro mode shots are amazingly crisp and detailed. Outdoors in medium sun, I did notice some tell-tale \"purple fringing\" around high contrast areas (the dark green leaves of a tree against a white cloud had a discernible purple halo around them when I zoomed in on the image). I don't know that other P&S; cameras of this size will necessarily do any better with the purple fringing, but I didn't find it to be too bothersome. On my monitor colors looked quite natural, not overly-saturated nor washed out. I tried some of the manual ISO settings and below 400 I didn't notice any grain or problematic fuzziness. Obviously, you can't expect SLR quality with a P&S;, but I'm very happy with the pictures this thing turns out.The aspect that really sold me on this camera is the HD video. Of course, I mostly wanted this to take stills, but I wanted the flexibility to switch to video when the moment calls for it. For such a tiny camera, the HD video quality is stunning! Very fluid motion, sharp picture, and remarkably clear audio! The video is best in brightly-lit situations of course, but it does quite well in low light too if you don't mind a little grain in the image. You can choose between several memory-saving standard-def settings and high-def (which switches to widescreen format automatically). While the optical zoom cannot be used in video mode, you CAN use the digital zoom up to 4x while recording -- a nice little bonus. The video files produced are .MOV files which I was able to import into iMovie on my Mac with complete ease (and very quickly too!).The control buttons are indeed small and flat, but I have had no trouble managing them (it helps if your fingernails are not trimmed too short). People with larger hands or very short fingernails might have a little more difficulty. I'm still getting used to menu navigation on this, but it seems fairly intuitive. I spent ten minutes reading through the \"getting started\" guide that comes with it, and that was helpful in outlining the basic features, but there are a lot more that the guide doesn't cover. This *does* use a proprietary battery, but the charger is fortunately very compact and charges the battery to capacity in 90 minutes. It doesn't bother me that the battery has to be taken out of the camera for charging. So far, after two days, I have not depleted the battery, so I can't comment yet on how long battery life is, but mine has already lasted through several hours of use and is still going strong.This may not be the most versatile camera on the market -- full manual controls are limited -- but for a simple-to-use, high-quality P&S; camera with crisp pictures and HD video, I think it would be hard to beat the SD940 IS. It is extremely small and lightweight and does all that most casual users could want. It may be a bit pricey compared to some others, but it's worth every penny. By the way, if you plan to use the HD video feature, be sure to get a Class 6 or higher SD memory card for best results. (Lower-rated cards may not be fast enough to capture the stream of information being written to the card). Don't skimp on the card -- cheap off-brands are not always reliable and may soon die, taking your irreplaceable photos and videos with them. I got a few SanDisk Extreme III 8GB Class 6 cards to go with this and they work great!Highly recommended!", "Date": "September 30, 2009"}, {"Title": "Disappointed, looking for replacement", "Author": "Kevin K. Fosler", "ReviewID": "R1354611RCUMKD", "Overall": "3.0", "Content": "I have had many Canon cameras over the years, so I expected a lot from this camera.  Prior to this one I had a SD880IS which was larger but had a really good design with a larger LCD and raised controls (not flush like this one).More about the camera .....The main thing I don't like about the camera is that with the auto mode I got some blurry shots.  That was indoor on auto with flash off while subject is not completely still.I had much better luck in program mode.  I think for what I was trying to do the \"kids and pets\" scene mode would have worked better.I always take shots with the flash off because I want natural lighting so maybe I'm just expecting too much of the camera.What I do like:-  Black color, very nice looking-  VERY portable.  With the leather case I could keep it with me all the time.  The leather case has a belt loop and fits the camera very well.-  HD movie mode, although it can get jumpy if you are indoors and moving around, so the camera needs to be very steady (using both hands helps a lot).The menus are OK but I'd like access to ISO via a dedicated button rather than through the menus.So, I am selling mine at a very low price.  The other reviews, IMO, are accurate -- I am probably just expecting too much from this camera's auto mode.Update:I sold the camera today (1-11-2010).  The camera I bought to replace it is the Panasonic Lumix DMC-ZS3.  It produces much better pictures in Auto mode, produces consistently good pictures in other modes, has better HD video that is much more stable, and many other things that I prefer (including 12x optical zoom).Note, however, that it lacks one major advantage that the Canon SD940IS has -- the incredibly small size.  It was a hard decision to sell the SD940IS because with its small size and the excellent belt case available that fits it perfectly, I could have it with me wherever I went and I would hardly notice it on my belt.  For a lot of people that will be the deciding advantage, so it's a matter of priorities.In the end, I decided that it was too confusing for me to have two cameras.  I have found that every camera has its learning curve, and that to take good pictures with many cameras one must take the time to experiment with the various settings.  The Panasonic is much more forgiving and produces better point-and-shoot pictures with less experience.  I suspect that the Canon SD940 can also provide good results but that to obtain them I would have had to spend more time learning how to use the manual settings.I will still keep my eye on the Canon Elph cameras and predict that I will come back to them at some point in the future.  For now though the Panasonic meets my needs better -- your mileage may vary.Update 4-2-2010I bought the successor to this camera, the SD1400IS, and like it much better.  It seems like it sometimes takes Canon a few iterations of a \"form factor\" before they get it right (in my opinion).  The pictures are clearer, and the video much more smooth on the SD1400IS.  I wrote a review of that camera and suggest people skip the SD940IS and consider the SD1400IS instead.", "Date": "December 31, 2009"}, {"Title": "Upgraded from Canon SD750", "Author": "M A", "ReviewID": "R1DMVFAXDEQ290", "Overall": "5.0", "Content": "Please do not be scared away from this camera because of the idiotic 1 star review over battery charging preferences.  This is an amazing camera that takes terrific quality photos.  The auto mode is fantastic.  Just literally take out of the box and start to point & shoot and pictures are clear, lighting perfect ,etc.  The IS function is great.  This was lacking in my 750 (which I loved - but had to replace when I lost it).  Also added HD video which is a nice touch.  My videos are super clear and the sound is quite good as well.  Setting it to Manual mode is quite fun and can really enhance pictures, especially low light and outdoor photos.  The ISO settings aren't nearly as good as my now ancient Fuji F10 but just ok. However, this camera makes up for it with its incredible auto mode, lightweight feel and crisp clear photos.  If you are looking for SLR quality then go buy one of those.  If you are looking for a very portable camera that you can take with you everywhere and makes new meaning to the saying 'point-and-shoot', then this camera is for you.  Don't miss any shots while trying to find the perfect settings.  Set it to Auto and go!  This camera will not disappoint.PS.  I have this one in the blue color.  Be careful it scratches easily.  Get a protective sleeve if you are concerned about that kind of thing.  I however am more concerned with the quality of my photos.  ;)", "Date": "September 29, 2009"}, {"Title": "Excellent little point-and-shoot", "Author": "Fleur", "ReviewID": "R3HNLUQWJSWLL5", "Overall": "4.0", "Content": "Having finally decided that it was time to replace my reliable old Canon Powershot A95, I went ahead and bought this brand-new model, based on the fact that I'm already familiar with Canon products and I've liked what I've seen.  The new camera definitely delivers, and I'm happy I chose this over a super-zoom model that wasn't anywhere near as compact.Pros:  Much, much less shutter lag than my five-year old model (not surprisingly!), very quick start-up and equally quick focus, sharp and clear photos, accurate color, and remarkably compact considering all the features -- fits easily into a pocket.  The wide-angle is a bonus, although I haven't had a chance to play with it much yet.  The software that comes with the camera is the updated version of the older software I had, and is easy to learn and use.Cons:  yes, the battery has to be removed to be charged, but this is a very minor inconvenience and is no different than previous models.  However, scrolling through the menus to get to the various settings is a bit of a time-consuming drawback, mostly because I was used to being able to select modes directly from a scroll wheel on the older model.", "Date": "September 18, 2009"}, {"Title": "Great upgrade from the Powershot sd780!", "Author": "J. Zeiser", "ReviewID": "R2QCDG2BZ2C993", "Overall": "5.0", "Content": "I just received my Powershot SD940.  Originally I had purchased the Powershot SD780, but when this one came out two days later I returned it.  I liked the bigger LCD on the 940 rather than the 780's smaller LCD with an optical viewfinder.  The 940 also has a 4x optical zoom compared to the 780's 3x optical zoom.  Something else I had not noticed until I received the product is that the 940 has an updated menu system.  The menus are laid out more logically and can display help menus to inform the user of the cameras functions and options.  This feature is not offered on the 780.  After owning both cameras, I would recommend upgrading to the Powershot SD940 unless you need an optical viewfinder.  The 940 offers better zoom, bigger LCD, updated menus, and stronger performance (I found that the menus operate more smoothly and with much less lag than the 780).  These are both great cameras, and I should note that the 780 is a bit smaller and lighter.  Unfortunately they both have rather flat buttons that are not raised above the surface which made it a bit hard to operate at first, but I quickly got used to it. I still STRONGLY recommended!", "Date": "August 29, 2009"}, {"Title": "Low-light amazingness. BUY THIS CAMERA.", "Author": "Ian N.", "ReviewID": "R262DIDRTQQ984", "Overall": "5.0", "Content": "I originally bought this little beauty because I needed a tiny camera to drop into my pocket when I didn't feel like lugging the SLR around with me while on a vacation. The size is perfect: literally the size of a credit card, fits into jeans or shirt pocket easily. But the REAL awesomeness of this camera? It has a 3200 ISO mode, that takes surprisingly excellent photos.  On a recent trip to Italy, I was able to use it unnoticed in dimly-lit churches, museums, etc., and even for hand-held night shots on the street. The images do contain some noise, as any would at ISO 3200 -- but this camera allowed me to get pictures that I otherwise would've missed, and that makes it a little miracle in my opinion.", "Date": "November 10, 2009"}, {"Title": "Sharp looking and fun to use", "Author": "CAMPJEEP", "ReviewID": "R3QOU7B9LUHZ37", "Overall": "5.0", "Content": "Battery life is 300  pictures (with flash on = just after chargeing battery).Some set back the brightness of the LCD a couple of notches to save some battery..I have the canon sd 1200 and the start up time is the same 1.5 secs,  the shot to shot times on both are less than 2 secs , (with the flash on 3 to 4 secs avg) and a (full flash for both cameras is up to 6 secs).The black color has a better grip than the other colors. You will need to buy a high speed 4 or 8 gig sd card, you could get by with a 2 gig card if you are not going to be useing the movie mode alot,( No SD card comes with the camera ). When you can, get a spare battery also (NB-4L BATTERY). A nice backup battery is a (power2000) for canon NB-4L for $19.00. It seems to me that (100 iso) is a little sharper in fine detail than (200 iso) useing program mode, thats just me tho, but just try to use 80 to 250 iso  for the best picture. Good image image quality for this size camera useing lower iso's,Highlights sometimes tend to blow out in very bright sun as with all small cameras this size, ( just try not to shoot with the bright sun in frount of you, if possible ).  A very compact camera (a tad thiner than the canon SD 1200 , the 28mm wide lens with 4x optical zoom is a nice feature on this small camera, and the 2.7inch lcd sceen is also very nice and sharp.As point and shoots get better we often try and compare them to digital SLRs ( speed,noise, ISOs, picture quality ) but because of the point and shoots very small sensors it is just asking to much of the little cameras....The SD940 has 720p HD in the movie mode some will like that, I do not use it enough to comment on how it works,sorry.The battery door cover like the canon sd 1200 is very weak. The black color has a better grip(texture) to it than the other colors if that is important to you ,it is not as slipery,The sd 940 will not take pictures like a canon (G 11) or a( S 90 ) but I like the pictures I get from this very small unit, even some in very low light at 400 - 800 iso.I mostly take pictures of bear in the Smokey Mountians (CADES COVE) and love chaseing the grand kids around taking their pictures. ( And this year the Outter Banks NC ).", "Date": "December 13, 2009"}, {"Title": "Impressive", "Author": "David J. Zibble", "ReviewID": "R15SVXKJW2YHKC", "Overall": "5.0", "Content": "I honestly did not expect this camera to be so compact.  Cool!  I brought it in off the porch and the box size had me believing I had only received the SD card.  It was all in there!  I warmed the camera up in my shirt pocket while the battery charged.  90 minutes later I was taking fantastic low light shots of the kids in ISO3200 mode.  We made some \"short films\" of them goofing off and were playing them back on the TV using the mini HDMI output (cable not included).  On par with my Flip Ultra HD,  but the sound is monaural.  No biggee.  After seeing a slideshow of the pictures I had taken, I immediately changed the image recording size to Widescreen.  This format will work very well, as I usually wiew photos on the TV using the Tivo home networking feature.  I crop as needed in Picasa anyway. The 16 GB SD card I ordered with the camera will hold more pictures than I probably took last year, so this amazes me. I will enjoy the lightning fast power up time of the Canon.  This camera joins our old Sony DSC-85 which is by comparison, slow, big, and heavy, but because I like it I will still break it out on Holidays.  I made this buying decision based solely on research done at the Canon website.  Good comparison tools.  Probably will buy another battery just to have.  Liking the removable battery as a feature, actually.  Off to Disney next week for the real trial.", "Date": "October 14, 2009"}, {"Title": "Best wide angle lens pocket camera in it's class.  Offers Canon superior image quality.", "Author": "L. Minster \"lminster\"", "ReviewID": "RQMSKCBXDMQ6X", "Overall": "4.0", "Content": "I was looking to replace my Cannon SD800  (I absolutely LOVE - I think it's the best pocket camera ever made) which had recently met with an unfortunate accident.  The SD940 ended up being the best option to replace my previous camera (which had a wide angle lens).  Here's why:I first purchased the Canon SD980 because it is the newest Canon pocket camera with a wide angle lens and it offers a 5X zoom.  However, I had to return it as the photo quality turned out to be a BIG disappointment.  The SD980 has some serious issues in Auto mode which cause it to produce blurry and/or grainy photos.I returned the SD980 and purchased the SD940.  I am very pleased with the images produced by this model.  The camera is TINY!  I like how small it is, but I would mention that the buttons might be small for someone with large hands.  Camera easily fits in a back pocket.  I am impressed with how well it takes photos in low light.  Some graininess is to be expected, but I think it produces better images than most cameras in it's class.  Also, I found the built in flash to have improved over former Canon models.  The flash seems stronger and more effective.The reason why I give this camera 4 stars and not 5 is that I think for the price, it should offer more features.  It is very basic and doesn't offer any fun or fancy options like color/white balance controls, color swapping or photo effects (which my SD800 did for the same price).  I should also mention that I did have to return the first SD940 I purchased because I dropped it and it broke.  So it is very fragile and needs to be well cared for.  It lacks the durability that my SD800 had.If you plan to use the camera exclusively on Auto mode or are willing to compromise and use \"P\" mode with limited controls (basically ISO & flash), then this is a great camera for you!  Very basic, easy to use and takes great pictures compared to other cameras in it's class (pocket/compact).  The other BEST reason to choose this model is the WIDE ANGLE LENS.  I will not buy a pocket camera without a wide angle lens.  To me, it's of the highest importance.  It allows me to take great shots of groups of people and also landscapes.  Most of the time I am taking pictures of people or kids and it is soooooo much more effective to have the wide angle lens.  I can get about 4 extra people in the same shot as I could with a regular 35mm equivalent lens.The camera also offers HD video.  I've used it in a pinch and was pleasantly surprised.  However, my expectation was not high as I would never count on a pocket camera for any important video.  I buy a camera for photos and a video camera for video.  This assures me the best quality in each case.", "Date": "November 25, 2009"}, {"Title": "Great camera over priced", "Author": "Selma Blackmon \"Selma\"", "ReviewID": "R1G68SBNLTT8UG", "Overall": "4.0", "Content": "This is my first pocket camera. I am very pleased with the size (that is why the expensive price tag), I like the ease, the ability to turn off the sound, the less lag time, the quick response. I only have 2 batteries, will need to purchase more. I am currently getting about 2 hours per battery as it is in continual use with photos of cemetery headstones (genealogy).The camera was recently pruchased and the ease of use is great! My favorite feature is the low light without flash. This is my reason for choosing this model. Thanks to previously read reviews.Yes, I would purchase the camera again for this purpose.", "Date": "October 22, 2009"}, {"Title": "Super Compact with great features!", "Author": "K. Desai", "ReviewID": "R2BTE7SHZ5AS3L", "Overall": "4.0", "Content": "I researched forever after my canon sd450 died. As a DSLR user, I was not looking for a camera to take award winning shots. Instead, I wanted (in this order) :1) Super Ultra Compact2) HD Video3) Decent picture quality for 4x6 and 5x7 printsI feel that this camera fits all of these needs perfectly. It is TINY. I agonized between this model and the sd780. The sd780is is apparently even thinner than this one and includes HD-movie-mode but I ultimately decided to pick the 940is because of its better optical zoom and the wider angle. I believe they are both about the same dimensions except for depth. I can't imagine it being any thinner though so don't let that make your decision.The picture quality goes from great to decent depending on lighting.You will love this camera if you are looking for ultimate portability!", "Date": "November 4, 2009"}, {"Title": "Great Little Camera", "Author": "Steve Medina \"Esteban\"", "ReviewID": "R1ZG0AEQQF09KF", "Overall": "5.0", "Content": "I have always been a fan of Canon Cameras and have had several of them. This compact camera is powerful and ultra portable, I give the camera great reviews except that the buttons on the back are hard to press. I heard the review from many people stating that the buttons are hard to use and thought nothing of it but it is true they are very difficult however I still love the camera =)", "Date": "November 30, 2009"}, {"Title": "Finally....", "Author": "M. Condello", "ReviewID": "RBKUV9EQU2S62", "Overall": "4.0", "Content": "I have had a few digital cameras and this is by far the BEST. It takes great pictures in all different settings- outdoors day and night- indoors, kids, etc.  It is very small so can fit in and out of pockets and small purses easily. Love the big viewing screen in the back too. I have to get used to the menu to able to switch the settings around quicker- but I am sure that will come as I get more familiar with the camera.  I just remarked to my husband the other day how great the battery life is.  I used it for the first time thanksgiving- have taken at least 100 pics and some video- and still have not needed to charge the battery!!!", "Date": "December 12, 2009"}, {"Title": "Upgrade from SD750", "Author": "GadgetGal", "ReviewID": "R8ZW65S2D9IDC", "Overall": "5.0", "Content": "I'd had my SD750 for about two and a half years before upgrading to the SD940 IS. The features of the two cameras are similar aside from the following:The SD940 has image stablization; HD video; battery indicator; smaller size.One thing that the SD750 had over the SD940 is the larger LCD, 3\" vs. 2.7\". But given that the SD940 is smaller overall compared to the SD 750, this really isn't a significant issue. Another thing about the SD750 was that it had buttons that were easier to use, they were raised and bigger but again, bigger camera, bigger buttons.As for picture quality, the SD940 is wonderful, easy to use no matter what setting you use. I've played with the auto as well as the manual settings and both turn out great pics. It's a no-brainer camera, just point and click. Just printed out some 8x10 pictures that look awesome. The battery life is very good too.One thing, this camera is really tiny, smaller than my cell phone though it's nice and weighty for its size, but it might be better suited for smaller-handed users. I can see it being difficult to manipulate for larger hands.", "Date": "November 25, 2009"}, {"Title": "Great camera", "Author": "Mel Cox", "ReviewID": "R24R1S8464RAGX", "Overall": "5.0", "Content": "Great camera. I got it after much research because I wanted to get the smallest high quality P & S. I'm an advanced amateur with two DSLR's but needed a small P & S for the wife to use and for me to carry when I wanted something really, really small.The SD940IS is truly small but delivers very high quality photos.The only quibbles I have are that the menus take some getting used to and the buttons on the back are so small that they require me to use my fingernail rather than my finger to operate them.Other than that, it's a great little camera and I'm glad I bought it.", "Date": "November 1, 2009"}, {"Title": "canon review", "Author": "Okechukwu K. Okoroma", "ReviewID": "R3CDHGSOULWH3O", "Overall": "5.0", "Content": "A fantastic unit.the pictures are crystal clear.battery life for me was above and better than previous units i bought.so in love with this camera", "Date": "December 8, 2009"}, {"Title": "Great for photos & not bulky, e.g. fitted perfectly into my evening handbag to capture moments of a 50th black tie party!", "Author": "A Bermudian Smith \"Onion\"", "ReviewID": "R1890SA34CVIRN", "Overall": "4.0", "Content": "I have been a Canon fan for over 25 years (yes, since 35 mm days) and this is my 4th Canon Digital Powershot Elph camera . . . need I say more! Each model is an improvement from the last & yet doesn't climb in price and the photos this one produces are fabulous, plus it's so compact & light, perfect for traveling or to have on hand for those unexpected shots!  This Canon is definitely value for money too!", "Date": "December 4, 2009"}, {"Title": "SUper Sleek and sweet!  Great LCD!", "Author": "M. Taing \"madness\"", "ReviewID": "R29S85Q6X1RXM6", "Overall": "4.0", "Content": "Let me start by saying i've played with the SD780, SD960, and SD1200 extensively.  Upon opening the box I was immediately impressed by the design of the camera.  The camera is SO much better than what I imagined - what I mean is the body is MUCH nicer compared to the 780 and even better than the photos.  Online it looks like a SD780 - but I think it is much better in the build, and the 2.7\" screen IS that much larger.  It has a solid sleek feel, very thin, but not CHEAP and not so thin or small i'll drop it.  Overall I love this camera.  Has all the excellent features of the newer Canon models we've come to love!  i think this camera is well the money.Having said all that - the photos are mostly good, but not as consistent as I'd like them to be.  This is trus of any of the newer cameras that I have played with, though.  my other two concerns are the lens seems to make actual noise while focusing - i do not know if this is a defect or normal.  Secondly, photos with the flash are interesting - a lot of edging do you call it?  I took a photo in daylight and flash kicked in but background looks like nighttime (indoor).  a little weird.  Resolution is great!  Low light photos with flash are awesome and crisp.  can't have a shaky hand with no flash. If you are a first time Canon user (like I was a few months ago) it takes a little time to get used to how to get clear shots, but then once you figure it out it's good.  All in all - I think this is going to be one of Canon's best sellers.  As far as comparison to the SD960 it very comparible in features and quality - but the design is very different.  I miss the scroll feature of the SD960, but it's easier to delete photos on this one.  I did not own a SD780, I just played with it in the store on several occasions, but I could never get used to it - so I think the SD940 is better in design and ease of use as far as navigation goes.  not sure on picture QUALITY COMparison.", "Date": "September 4, 2009"}, {"Title": "A Great Camera IF the Right Settings Are Used", "Author": "Critical User", "ReviewID": "R11YVSRY2Z8RB1", "Overall": "4.0", "Content": "The SD940 has a lot going for it: Exc build, extremely compact, wide angle, fast lens, high visibility, sharp lcd and effective image stabilization. However, the pics lacked definition and sharpness as compared to those from other cameras in its class, such as the Fujifilm Finepix F70, UNLESS the proper settings are used. I suggest that the camera be set to the Program Mode (center position of the little slider on the upper right side), then  press Function Select(center button on the circle) and choose the My Colors icon. Then press Function Set again and choose N (Neutral). (V for Vivid is another option for punchier scenery colors, but this setting over-emphasizes red tones in face shots.) You will be surprised by the difference that the N setting makes compared to the default and Auto settings. Now you have a great, very small camera that takes sharp photos.Hope this makes your picture taking more enjoyable.", "Date": "March 25, 2010"}, {"Title": "Canon SD940IS, a little jewel", "Author": "Michael T. McCaffrey \"sumofan\"", "ReviewID": "R18J7B4DAQCK7", "Overall": "5.0", "Content": "I just received my Canon SD940IS several hours ago. I ordered it with 2-Day Service, and it came early on the second day per Amazon's usual excellent service. I have the big Nikon outfit, many lenses/bags/tripods, etc., but wanted something little, but power-packed, to take with us on a few upcoming trips. The Nikon is excellent, but would like to keep the travels simple. The SD940 is an absolute little jewel! It will replace the Canon PowerShot SD400 that I've had for years, but it was time to boost the performance (12 mp vs. 5 mp ... also 28 mm wide angle with the 940). I also love the SMALL size of this marvel. You've been reading it fits in shirt or pants pockets, better believe it! It is great in low light situations (yup, tested it), and the LCD worked perfectly in the bright sun. I took a bunch of test pics, they are perfect. I also love the WIDE format Canon offers in the picture menu selections. An added benefit for me is that is uses the same batteries and case that the SD400 used, so now I have three spares. As someone mentioned in a prior review: the \"big\" cameras have their role and place, but having a small, highly portable, dynamo in your pocket means you will be ready to take all sorts of shots you very well might have missed. I would absolutely recommend the reader check this camera out!", "Date": "January 27, 2010"}, {"Title": "Small Handy pocket camera", "Author": "Ajay Mahajan", "ReviewID": "R3ULKS5LXFDTRO", "Overall": "4.0", "Content": "I owned Canon SD 790 before this, and loved it, but had to let it go. This one is obviously more smaller and sleeker. It is definitely better than SD 780 because of 4x zoom, bigger lens and display size, and i feel also a bit more sturdier. However, the picture quality though better than 780 is lesser than older 790The menus are quite nice and usable, and camera is definitely more faster and responsive. It stays nicely in pocket, and good enough to take all types of shots. The video quality isnt bad at all, hdmi o/p is cool and I am wondering why I need my Sony handycam anymore.", "Date": "October 11, 2009"}, {"Title": "Disappointed", "Author": "someone special", "ReviewID": "R15MTA5RD9OIAF", "Overall": "3.0", "Content": "I bought this to replace my Canon SD800 that was 3 years old.  I really wanted the ability to shoot video in 720p.  Contrary to most people, I think these small cameras are great for shooting video, especially of family and kids.  Its small enough to keep in your pocket and whip it out whenever there is something video worthy.  I usually use my camera to take pictures of family and kids, with occassional complex or picturesque shots, and my review is based on that experience.Pros:The camera is very small.  The face is about the same size as the SD800, but it is very thin. Very handy to keep in your pocket.The video is great.  Audio is not so great, as described in the \"Cons\" section.LCD is good.There is a button to go to playback mode, instead of being on the \"mode\" dial.  This is nice since people want to see every shot you take immediately after.Cons:The picture quality is poor compared to my previous Canon point and shoots.  This really surpised me since this has always been a strength of even the cheapest Canons, and even when just using their \"Auto\" mode.  I took a couple indoor pictures of the same thing on my SD800 and then the SD940.  I immediately noticed that the colors weren't quite right and the contrast seemed too high.  I played around with all the manual settings there were, but could never get the pictures to look as good as on my older camera on the \"Auto\" mode.In auto mode, the SD940 often seemed confused.  For example, on indoor shots, it would select ISO1600 instead of using the flash.  Shots were regularly blurry.  Outdoor shots were better in terms of color and lighting, but quite often, they would be blurry.  Pictures were usually blurry from too long an exposure as opposed to poor autofocus.Compared to the SD800, the new camera is also more complex and cumbersome in using the manual features.  I usually use the auto mode about half the time and adjust in manual mode the other half.  I found the SD940 takes longer to setup due to more complex menus and just generally less user friendly navigation.  And this added complexity gave very little in terms of greater flexibility in setup features.After taking a week's worth of pictures on vacation with family, I came home and downloaded the pictures to my computer, and was generally disappointed.  Most indoor pictures were incorrect in lighting - faces too dark, backgrounds washed out, images blurry from slow shutter speeds, colors seemed bland.  Outdoor pictures were better, but an unacceptable number were still blurry.In video recordings, the actual video is great.  Amazing resolution, and does a good job with reproducing lights and colors.  The audio quality is not so great.  Some sounds picked up with too much sensitivity, and others not enough.  For example, a plane went overhead on one video, and although only mildly lound in real life, the video playback made it sound like the camera was right next to the jet engine - completely deafening.  Similary, voices near the camera (like mine as camera operator) played back in booming volume, while voices just 5 feet away sound like a whisper.The camera can also get quite warm during operation.  Probably influenced by the small size.My review of this camera is based on my experience relative to the SD800.  That camera had absolutely no faults.  I had both cameras on my last trip and can compare pictures on my computer.  The SD940, 3 years newer, seems to be a step back in most aspects other than video resolution and size.", "Date": "September 5, 2010"}, {"Title": "Excellent ultra portable camera", "Author": "Julian Kwok", "ReviewID": "R1BCS34I0TW9LZ", "Overall": "5.0", "Content": "I have had this camera for a few months now.  Very satisfied with my purchase.  The camera is extremely pocketable, with a fingerprint-proof matte black finish.  The overall construction feels very sturdy, the \"flimsiest\" thing seems to be the HDMI/digital output cover.  It is slightly thicker than the 780IS, but makes up for it with a slightly larger screen and longer optical zoom.  The main navigation and menu buttons are flush with the body, making them slightly harder to press than regular buttons.  By no means are the buttons not responsive, it is just that there isn't as much tactile response as one may like.  Overall very slick, high quality design and construction.The \"boot-up\" time is lighting fast, you can take a picture within 2 seconds of hitting the power button.  Picture quality is very good, but as others have said there is a bit of noise when blown up to full size.  Due to this I take pictures at 8MPs instead of 12.  Saves space and you can still edit the pictures in photoshop (8mp resolution=3264x2446,) PLENTY of pixels for most people.  The interface is easy to use, making it easy to switch between the different preset picture modes or changing the ISO, white balance etc.  There aren't too many manual settings, but for the most part people who purchase this camera aren't really looking for that.  The image stabilization seems excellent, as well as the auto-focus and face detection.  I have noticed for the face-detection  the subject(s) have to be fairly large in relation to the background and well lit in order for the camera to detect the faces.  What I am saying is that, you can't expect to take a picture of an entire house and expect the camera to detect the face of someone standing right in front of the front door.  The night-portrait setting works VERY well compared to other cameras I have used.  Somehow the flash manages to place enough light on the subject while retaining the brightness in the background.  The HD video quality is very good, though buy a large memory card (I have a 16GB) if you plan on taking videos.  A one minute video will take up around 200MBs!  Also, there is no optical zoom once you start recording a video, only digital zoom.Finally, I have a testament to this camera's build quality.  As one who relishes in being a tourist and snapping pictures at whim, I tend to carry my camera in my hand often instead of in a case or in my pocket.  During a trip to Hong Kong, I was carrying my camera in hand and was slightly nudged causing me to drop my camera.  I'd say it fell a good 3 feet onto solid concrete.  I immediately assessed the damage.  The point of impact seemed to be the top/front edge of the camera (the area between the lens and the shutter button.) I was slightly worried as even though there were only a couple tiny scuffs on the camera, the front of the camera had seemed to slightly \"pop-out\" from the rest of the body.  Incredibly, simply squeezing the front and back end of the camera popped it right back in.  I turned the camera on and everything was just fine.  EVERYTHING was working fine, even the orientation sensor.  Can it survive another treacherous fall, I don't know.  The fact that it is in perfect working order with only the slightest blemishes is truly impressive.Overall, though not perfect, this is still an excellent camera.  Yeah, you may be making minor compromises for the small size(only 4x optical zoom, slight noise when viewing pictures full size, no optical zoom during video recording.)  However the build quality, HD video, easy to use interface, solid overall picture quality make it one of the best ultra portable cameras.", "Date": "March 24, 2010"}, {"Title": "excellent camera!!", "Author": "$agar", "ReviewID": "R34G8ODQNJJKKI", "Overall": "5.0", "Content": "I bought this camera in last month. its very handy, stylish and loaded with cool features. i like the picture as well as video quality, both day and night. overall, it is good for day to day use. i would recommend this camera!!", "Date": "December 1, 2009"}, {"Title": "great little camera.. so far", "Author": "Mindy Chen", "ReviewID": "R3VXHCULS6E5T", "Overall": "5.0", "Content": "i bought this to replace my old digital camera so it is certainly an upgrade in that respect. so far, it has met my expectations- it's very compact, has a big lcd screen, is easy to navigate (i am a canon fan) and is stylish. i have taken some test pictures and they are great, but i haven't dabbled in the hd video function yet. for your information though, if you decide to purchase a case for this camera on amazon, get the canon psc-55. i bought this case in the store and they told me the canon psc-1050 (which I was considering to buy and is made for the sd 780) is too snug. on the other hand, the psc-55 is a perfect fit but unfortunately, it has no additional compartments for camera accessories.", "Date": "November 30, 2009"}, {"Title": "Very Good Little Camera", "Author": "Dr. Bojan Tunguz", "ReviewID": "R36VKKDX48HS98", "Overall": "5.0", "Content": "My wife has gotten this little camera a few years ago as a replacement for her older PowerShot point-and-shoot digital camera. It has been her primary camera for some time, and I have used it quite a bit, particularly when I don't feel like taking my much bigger Canon DSLR camera around. We've both enjoyed its features, and as long as you know what to expect you will probably be very happy with it as well.**** Image Quality ****For the longest time image quality was (more or less) synonymous with the number of megapixels, although this gauge left a lot to be desired. However, that number has not changed all that much in recent years. 12 megapixels is probably as high of a resolution as most people will ever need for their everyday purposes. The improvements have come mostly from the better sensors and image processing, but even those are more incremental than revolutionary. In other words, this PowerShot camera can definitely hold its own compared to most new point-and-shoots. It definitely has better image quality than even the most advanced cell phone camera. With various settings, you are bound to be able to optimize your photographs for most shooting conditions, although I rarely venture beyond the full automatic. The pictures can be printed even on the full-page layouts, although these days I rarely do that. If you will be primarily viewing your photos on a computer or a similar device, then the resolution and the image quality will be more than adequate, even for the Retina displays.**** Video Quality ****When it came out, the 720p was the most advanced video recording standard on the market, and was considered to be the HD recording. However, since then 1080p has become the norm. Even though 720p is still more than adequate for short home videos, if video recording is one of the main features that you are looking for in a camera then you might want to check out some of the newer models. And for everyday shooting, even the cell phone video quality on the new smartphones can be at least comparable to this camera. For the best results I definitely recommend shooting in very well lit places. You should also try to be far enough away from the camera, as it doesn't handle near-focusing too well. The IS seems to be working well even in the video mode, and this helps with the jitteriness of your video.**** Style and Build ****Traditionally these have been some of the strongest points of the PowerShot cameras, and SD940 is no exception. I really like its metallic look and feel. It gives you confidence in its durability, and it signals overall high quality of this product. The camera has been further reduced in size compared to its predecessors, and at just 120 g it's the lightest stand-alone camera that I had owned. It fits nicely into a pocket or a purse, and if portability is one of the things that you look in the camera, then you won't find anything much better than SD940.**** Conclusion ****As mentioned already, this small digital camera has served us very well for many years, and we are still not looking for an upgrade. Some of the newer cameras have more sophisticated settings and features, but if good quality of still shots is your main concern than you won't find anything on the market that will far outperform this camera. It's a very nice little product.", "Date": "June 22, 2012"}, {"Title": "Another great Canon pick!", "Author": "J. Conoley", "ReviewID": "RZ0WK3SHI1WNG", "Overall": "5.0", "Content": "I bought this Canon camera when my five-year-old Canon bit the dust. I would have had to pay $100 to fix it, so I decided to buy a new one. This one is like my beloved old Canon in so many ways. It's easy to operate, which is great for my husband and random people who I ask to take our picture. Plus, it's so light; it's no stress for anyone to carry it around. I love to travel and take pictures of the scenery around me in the new places I'm visiting. While it's no SLR, this camera still takes gorgeous pictures that I blow up and hang up around my house. The quality it great for a point and shoot camera.I read and re-read the reviews on this camera. I'm very happy with my selection and think it's another solid Canon product. I would definitely recommend it.", "Date": "April 23, 2010"}, {"Title": "Great Camera", "Author": "Kevin McRae", "ReviewID": "R1ST2B4ZLPJF49", "Overall": "5.0", "Content": "This is my third Canon Elph digital camera and once again, I am extremely happy with all aspects of the camera.  Very easy to use, great battery life, excellent picture quality, all around great camera for point and shoot photography!", "Date": "January 24, 2010"}, {"Title": "Canon PowerShot SD940IS", "Author": "John T. Hayes", "ReviewID": "R3ODGC6G6UZ14R", "Overall": "5.0", "Content": "Have only had this camera for a couple of months but couldn't be happier.  I replaced a Canon 5.0 megapixel.  Was a little worried at first that I might miss the view finder but after using this camera I don't miss it at all.  The screen is large enough to make it very easy to use.  The controls are convenient, easy to use, and just the right size.  Pictures are fantastic.  Took some last week with no flash of a laser light show and was very impressed.  Somewhat partial to Canon as that is the brand of my digital SLR also but this little camera gets an A+.  Easy to use, easy to carry, large screen, convenient controls.  Worth every cent.", "Date": "November 30, 2009"}, {"Title": "With the SD940IS, Canon has lost it's way", "Author": "Bay Area Tech Junkie", "ReviewID": "RL7W08ZOBSOZ5", "Overall": "2.0", "Content": "I bought this to replace a 3 year old SD1000 with the hopes that another generation of DIGIC processors would improve upon the excellent SD1000. Boy was I wrong. I should have listened to others who have said that Canon has lost it's way. This camera is very difficult to work with to get a good exposure - like a difficult to use SLR, you need to be aware of the lighting conditions and the limitations and quirks of the camera to take a good picture, you can't just point and shoot and feel confident that you've captured the moment. I found myself shooting a large number of photos and fiddling between the fully auto and the manual mode to understand when to use each. The fully auto mode is able to take some very interesting pictures that I was unable to reproduce in manual mode, for example taking a picture from inside a room of the view outside a window - in auto mode it is actually able to expose both the indoor and outdoor elements. However when outdoors the auto mode consistently produces overexposed and washed out photos. Perhaps the most telling sign is that I actually lost the camera during a trip overseas and did not mourn the loss at all - in fact a felt a sense of relief that I wouldn't have to live with it.Other annoyances, the black paint chips fairly easily, the power button is hard to find, and it is nearly impossible to hold this camera without partially blocking the flash, which results in large dark areas in indoor photos.Like a rookie QB with a great arm, this camera had flashes of greatness, but also demonstrated spectacular failures in simple situations and overall was a lot of work to live with. After 8 years of faithfully using Canon Elph digital cameras I'll be looking to other manufacturers now - it was nice knowing you Canon. Buyers be warned - STAY AWAY!", "Date": "August 18, 2010"}, {"Title": "A Very Nice Camera - After Lens Replacement", "Author": "Alan  Houston", "ReviewID": "R1PULA02COBIZD", "Overall": "4.0", "Content": "My ancient Canon SD1000 is the best \"tiny\" digital camera that I have used.  I bought the SD940 to get its wider 28mm zoom.  When there are eight people around a birthday cake, 28mm is more useful than 35mm.I was very unhappy with the quality of photos from the SD940.  Flash photos had what looked like tiny bubbles in most photos.  Outdoor photos were almost always in soft focus and even-toned subjects, such as the sky, had two tiny dark circles visible in every photo.Finally, I sent the SD940 back to Canon.  Just eight days later, Canon delivered it back to me with a new lens assembly.  The SD940 can now match the high quality of my SD1000. I use the \"Program Mode\", and lock the ISO at ISO 100. I set exposure at minus 1/3 stop for more saturated colors.  I use \"My Colors\" to boost sharpness, and reduce contrast.  These settings produce photos that are excellent, but which can often by improved by using \"i-contrast\" during playback to brighten shadow areas.So, with its new lens assembly and with my taking control of focus, ISO, and exposure in the program mode, I am getting excellent photos.  However, people who use the SD940 in auto mode are likely to be unhappy with many of their photos as photos at ISO 400 and ISO 800 are sub-par.Thumbs down to Canon for selling a camera with a defective lens assembly.  Thumbs up to Canon for fixing my camera and returning it to me in just eight days, free of charge.The SD940 uses the same battery as my older SD1000.  I can bring both cameras on a trip and they can share a charger and backup batteries.  The charger is only slightly bigger than the battery, so it is easy to bring on trips.  While I am out taking photos, the extra battery can be charging back at the hotel.", "Date": "November 22, 2010"}, {"Title": "Great camera", "Author": "Toaster", "ReviewID": "R37JSALPYMCIED", "Overall": "5.0", "Content": "This is a great little camera. I have to be honest, I just googled the best digital camera for 2010 and this camera popped up. My last two cameras blitzed within a year of purchase, and I reviewed cameras extensively. Needless to say it was a huge disappointment, I believe one was the Kodak snapshot.I am extremely pleased with this camera, it is very compact and easy to use, and most important..great pictures.", "Date": "October 21, 2010"}, {"Title": "A Lotta Pocket Camera!", "Author": "John K. Adams \"back 9\"", "ReviewID": "RN59NWE4W1JCX", "Overall": "5.0", "Content": "I have been using a Sony that was too big fancy and heavy, then switched to a Panasonic I was less than satisfied with.  My wife has always been pleased with the Canon I bought her from Amazon a couple of years ago and her picture quality has been superior to mine despite her not reading the manuals and totally familiarizing herself with it.  I decided I'd give a Canon a shot and after weighing features, performance, pricing and reviews...I decided on the SD940IS. I bought a refurbished one and began questioning my choice while waiting for its arrival.  After it arrived, I was extremely pleased with its condition...like brand new!  I looked at the little user manual that came with it, but was less than satisfied with it.  I also noted some user's reviews of the camera on other websites, and that made me further doubt my choice.  I finally installed the included Canon software on my laptop and it had a more intensive owners manual in the software.  After taking the time to read through THAT manual, I began further familiarizing myself with the camera and taking a variety of pictures, both fully automated AND with me choosing the settings.  The results I got were awesome to me!  Not every picture was perfect, but with little changes here and there, I was able to get great pictures that would more than satisfy most Point-And-Shoot enthusiasts.  The automated pics were good, but using the P setting and making changes to suit myself got great pictures in my opinion....its just a matter of familiarizing yourself with the available features and their capabilities. With the included software, I have been very happy now with my purchase and have no regrets. I think these have been some of the best pictures I have taken with any of my previous manufactured cameras, and would recommend Canon but suggest you fully familiarize yourself with the camera before you pass judgement or review it.", "Date": "September 13, 2010"}, {"Title": "tiny camera does decent picture and great video", "Author": "A Mom from NC", "ReviewID": "R6J5U4K4O3057", "Overall": "4.0", "Content": "1. This is really a credit card size camera...very very small. very easy to fit into any pocket. Sometime I feel it is too small to hold it. very easy to get the flash light blocked by finger.2. Picture quality just all right. Again it depends what you are comparing too. For point and short, I think it does decent job especially out door. Focus does take some time (this is not a SLR, so do not expect that type of speed). Also I realized some picture around the edge/corner of the picture, objects looks weird (not straight)3. Great video quality, I put it on the HDTV, results are better than I expected. It is not really HD show, but very clear. both out door and indoor.4. I need to use some kind of software to convert the video to the format that a Windows PC or a DVD player can read. that is a down side. So if you do not own a MAC or you are not very good at computer, this might be some issue for you5. Video takes lots of disk space on the memory card.Overall I like it, most because it is so small to carry (i am little sick carrying the SLR and my 2 years old daughter). Also great HD movie function, it is better quality than my hard driver Panasonic camcorder.", "Date": "June 28, 2010"}, {"Title": "Fantastic Camera with great images and videos", "Author": "Suresh Nair \"Suresh Nair\"", "ReviewID": "R3RUL4J1DDHNAN", "Overall": "4.0", "Content": "Great Camera..Video Quality is too good. I love this camera a lot..I wanted a simple point and click camera..Glad to find this one, which is so easy and has great pictures/videos.Would definitely recommend to buy this camera", "Date": "April 24, 2010"}, {"Title": "Great Camera!", "Author": "E. Tran", "ReviewID": "R7QDCMLEH7GLI", "Overall": "5.0", "Content": "This camera is simply beautiful. It is very sleek and light while feeling very sturdy in construction. Start up time for first shot is blazing fast even though continuous shooting is not. LCD is fairly visible even when in direct sunlight thus the lack of a viewfinder is not a deal breaker. While this camera is a little larger than the SD780IS, it packs a 4x zoom and a 28mm wide angle lens which has definitely been useful. Picture quality is not on par with any powershot since the SD790IS but taken for the sleek body, I can't complain. HD video is simply stunning for a camera of this caliber, my Vado HD simply cannot compare to this baby. Battery life is very good, the battery has lasted over 200 shots and multiple videos without a drained battery. This camera is made in China for those who care but it does not feel flimsy at all (the newer shipment of SD780s are from China anyways). Buy this camera if you want a good camera with just the right amount of pep. There are other cameras out there with better IQ but they simply cannot compare to the SD940 as a whole.", "Date": "April 10, 2010"}, {"Title": "Great quality, Great price!", "Author": "Steven Herrera", "ReviewID": "R210PXTQ8KMJCC", "Overall": "4.0", "Content": "Great clear photos! Way better then the stupid \"Coolpix\" camera I traded in for. The color of the photos is really great. I'm probably comparing to the Coolpix which every photo had a yellowish tint.I'd definitely recommend this camera for the price!", "Date": "April 5, 2010"}, {"Title": "Fantastic", "Author": "D. Chandrasekaran", "ReviewID": "RA3Q7RNLN268X", "Overall": "4.0", "Content": "This camera is great, easily one of the best P&S; I've ever owned or even seen among anyone who has a digital camera.  I actually had the same model but with the 3x zoom and lost it on the slopes, so when I came back to get another one, I found this one with the 4x zoom and feel it is worth every penny. I rarely rave about products, especially electronics, but this one has turned out to be everything I wanted, very compact, easy to use, decent battery life, and most importantly, great quality of pics.  I highly recommend it to anyone who is looking in the $200 range for a P&S; digital camera.", "Date": "April 1, 2010"}, {"Title": "Worth it.", "Author": "Mars", "ReviewID": "R2KZHDB922VJDT", "Overall": "5.0", "Content": "Great pics and slim body. The only problem might be that the buttons are a little small....", "Date": "March 27, 2010"}, {"Title": "Awesome Point & Shoot Camera...", "Author": "Ryan L", "ReviewID": "R18NHHK1ZRZ2GX", "Overall": "5.0", "Content": "I've been a loyal Canon SD user for many years. Previously had the SD400 (until it got stolen) and SD600 (gave to my brother). Now after having the newer Canon SD940IS for a month, I feel this camera's sleek and compact style packs a lot of punch. The Black color is also stylish and a good change to the default Silver cameras I've had before.The video quality on 720p HD is amazing and the photos are awesome to capture those special moments. I thought I would need a viewfinder on the SD940IS, but it wasn't necessary since I rarely used the viewfinder on my previous models. Battery life is fairly good, you'll probably get a good 4-5 hours if it is on constantly. I carry a spare just in case.Only one knock is that there is no full manual mode like I had on my previous versions, but the HD video mode overshadows this feature.Overall, I'm satisfied with this camera. Well worth the price and comfort!", "Date": "March 13, 2010"}, {"Title": "great cam", "Author": "Mariah Cuevas \"Mariah\"", "ReviewID": "R35BJGIPQTYKKU", "Overall": "5.0", "Content": "I got this camera for my mom for her bday. She loves it. Its a great camera. Takes guality pictures, small and slim. The black looks good. I recommend this camera for anyone.", "Date": "March 6, 2010"}, {"Title": "overall, really great...", "Author": "fisherKing", "ReviewID": "RGI66LPXWVJVT", "Overall": "5.0", "Content": "funny to read reviews on amazon; same item, some people love it, others hate it.am surprised about the negative reviews for this camera; i've had three other canon's, this is my fave. great pictures, good options. i use it more for \"art\" shots, (see? i put that it quotes to NOT be obnoxious), so am using Vivid color, center-focusing (instead of face), and iContrast. i NEVER use the flash.am really pleased with the pictures i am taking, and the video is great too (when i use it, which is rare).great ergonomics, great size. the black version is unobtrusive. am carrying this everywhere.will enjoy this for as long as it lasts (or until a newer camera insists on being bought...)", "Date": "February 24, 2010"}, {"Title": "Compact and Great Camera", "Author": "Edmond Lau", "ReviewID": "RJRNWKYJMG74O", "Overall": "4.0", "Content": "Canon SD940 is a great camera, highly compact and easy to use.  It is a good camera for amateur users because it provides programmable configurations to play with.  For advanced / professional photographers, this camera provide the mobility.  It may not be as good as DSLR in terms of photo quality and features, but a good compliment when you don't want to bring all the lenses with you during extreme weather.  (e.g. Canadian winter)", "Date": "February 18, 2010"}, {"Title": "Great Camera, Low Price", "Author": "Richard Ashenfelter \"Rick\"", "ReviewID": "R1VLAI9V8Q2UZ6", "Overall": "5.0", "Content": "This is a replacement to my aging SD630.  The build quality is what you'd expect from a $250ish point and shoot.  All metal body, the battery door is sturdy and the buttons have a positive feel.  I shoot all canon products including a 20D and 1DMkIII and this camera is a great addition to the family.  The image quality even at ISO800 looks fantastic and finally, they put a battery indicator on the display rather than only telling you once the battery is low.The only thing I can say I dislike about this camera is that the HD video is not the best and it only use the digital zoom.  Digital zoom has always been a no no to me as it's not a \"real\" zoom but from whatI read, all P&S; cameras work this way so I really can't count it against Canon.", "Date": "February 11, 2010"}, {"Title": "Baddass little camera", "Author": "Frank the Tank \"bbq wannabe\"", "ReviewID": "R2EN75MNG586QM", "Overall": "5.0", "Content": "I really love this camera, it is my first digital camera and boy did I pick a good one. The pictures look really good and the hd video is awesome too, my only complaint would be that in the dark it is sometimes hard to find the power button with it being flush and all, but I can overlook that, the battery live is so so. If you are planning on going on a shooting spree mixed in with video taken, you had better get a back up battery, I did. All that aside I would recommend this product", "Date": "January 9, 2010"}, {"Title": "great point and shoot", "Author": "N. Stran", "ReviewID": "R2A8HDZ94ZPUWF", "Overall": "5.0", "Content": "Not being a huge camera person, I was looking for a decent quality point and shoot camera that I didnt have to have a manual to use. Been using this for over a month and couldnt be happier with it. I usually leave it on auto and let it do its thing, and it takes great pics. Also the camera was smaller than I expected, but the LCD screen is plenty big enough to see the pics without problem. overall, if you want a point and shoot perfect pocket sized camera, this is it!", "Date": "December 28, 2009"}, {"Title": "lived up to expectations", "Author": "Veto P. Napolitano \"forest home\"", "ReviewID": "R13GOD7L3391BY", "Overall": "5.0", "Content": "After seeing the camera in action while visiting a friend I was very impressed with the ease at which the camera was used. The picture quality and the video quality were all that I could ask for being novice. The camera seems to be the right size. fits in any pocket. Smaller and it would be hard to handle. Great product.", "Date": "November 24, 2009"}, {"Title": "Great compact Camera!", "Author": "A. Schlosser", "ReviewID": "R14YS4FAWRNL3V", "Overall": "5.0", "Content": "Barely can feel the camera when it is in my pocket.  The images are fantastic and I can't say one negative thing about it after using it for the past month.  Highly recommend this camera.", "Date": "November 23, 2009"}, {"Title": "canon has won my heart", "Author": "A. L. Montgomery \"photography nerd\"", "ReviewID": "R2Y1ZYUNCZGUSF", "Overall": "5.0", "Content": "as a professional photographer who normally uses nikon products, i finally decided to try something new in the point-and-shoot department. i LOVE this camera. it's great in low light settings even when no flash is being used. it's fast, easily portable and easy to use. definitely a great camera for the price.", "Date": "April 1, 2010"}, {"Title": "Great Camera", "Author": "Zak \"Zak\"", "ReviewID": "R1G2ZUOLL771T6", "Overall": "5.0", "Content": "Fantastic camera, fits perfectly in the hand, compact, super well built, progrmas and features easily found and logically laid out, great quality lens, great video mode, good sound quality from the mic.  All this for $ 200? Cant beat it!", "Date": "December 2, 2009"}, {"Title": "Great on land, and we'll soon see about underwater", "Author": "Nicole", "ReviewID": "R1X0KRMOYCB6OZ", "Overall": "4.0", "Content": "I'm a Canon fan for life. I'm a diver and love to take photos underwater. I had a Canon Powershot A95 for over 7 years, replacing a  broken one with a used one when they were discontinued, and then once that one broke I couldn't find another for a reasonable price. It took amazing pictures underwater and was very good to me. So I decided to upgrade to another Canon, seeing how they make cases for all their P&S; cameras. I bought this camera along with the Canon DC-WP33, its underwater case. I got it yesterday, and have been very pleased with the images. I'm no professional photographer, and stick with the underwater setting (which I love, and Canon's is fantastic, although I wish I could adjust the white balance while in UW mode) while diving. But topside I like simple, easy-to-use yet functional features, and this has loads, more than I'll ever use. I love the color selections, being able to shoot in sepia, black and white, and the the contrast settings are nice as well. I should also add that the built-in flash on this camera is pretty powerful for as small as it is. I'm looking forward to seeing how well it works at depth, without a strobe.It is really small, smaller than my Palm Pre, but just a bit. It fits in the case that came with the Pre, for scale. That's what I'm using it for now. The controls take a little getting used to. I think for the person who wants a high-quality point and shoot that can literally fit in your pocket but takes great pics and HD video, this is the one for you.I will come back and update this review after using the camera on my dive trip, for anyone else contemplating a purchase for similar reasons.", "Date": "December 15, 2009"}, {"Title": "Only if camera size is the most imp criteria", "Author": "B. Roy \"RoyTech\"", "ReviewID": "R2Y2YZACXI50T8", "Overall": "3.0", "Content": "If your last camera was a stone age 3.1 MP Kodak EasyShare DX6340, then almost any camera bought today will be miles ahead. This camera needs to be compared against the current crop of cameras on the market and not an ancient kodak. Technology has really leapfrogged in the past year or two and Canon seems to be resting on its past laurels while other companies are catching up.I bought both this and the Panasonic ZS-7 recently. The ZS-7 is hands down a winner. I also note that there are other Panasonic models rated highly by consumer reports and had I known earlier, might not have bought this one.So why do I rate this model a 3 stars -To start off - the experience wasn't good. The first item shipped to me started getting ill about a month or two after I started using it. Basically, its focussing mechanism would freeze ruining many pictures and videos. Its been replaced since then and I keep my fingers crossed regarding its reliablility. I know another person who owns this camera. He hates it (I do moderately like mine). He hates it because of its very poor flash/low light performance.To sum up - there are three major cons -1) Bad flash/Low light performance2) Fragile3) Slippery to hold4) Rather short battery life if you take videos.5) Lens not as sharp as ZS-76) Rounded form factor means camera cannot stand on its edge easily - topples over. Try not to put it on a ledge and to take that self timer shot.Now the pro's relative to my ZS-71) Small Size - gives it a \"cool\" wow factor and makes you also want to own one. I think thats why I bought mine and \"moderately\" like it.2) Color is good but too vivid sometimes - makes a gray lake look blue in pics.3) HD video quality is good, but ZS-7 is better with better compression with selectable bit rate (AVCHD lite). ZS7 lens also zooms silently all the way to 16X while taking videos. Sound is way better on ZS-7.This camera is made in China. My Panasonic ZS-7 was made in Japan. My experience regarding reliabilility of high tech items out of China has been poor (Seagate drives for example - I've had 3 China made drives fail on me and the first SD-940 camera too failed).If camera size is not the most important criteria, then I'd suggest other \"shirtpocket\" size cameras.I suggest you take a look at the following - Panasonic DMC-FH20, ZS-3, ZS-7; Nikon S-8000; Canon SX210. You will get a sturdier product, better pictures and lot more bang for the buck.", "Date": "July 17, 2010"}, {"Title": "Great Camera but ........", "Author": "Honey Holiday", "ReviewID": "R17BMZ59JNQN39", "Overall": "2.0", "Content": "I loved everything about this camera .... size... functions .... looks for the first 1/2 year. Unfortunately dark spots stared showing up in my pictures. I tried cleaning the lens and other things. Finally after reading several blogs I realized that I needed to mothball this camera(s) (because I had two 940IS cameras). The spots were from specs(dirt) on the camera elements (glass)a condition that I couldn't correct. I corrected all my pictures in Photoshop but never again. This was a very good travel camera with good battery life.", "Date": "October 28, 2012"}, {"Title": "Perfect for daily pocket carry", "Author": "Samuel W", "ReviewID": "R27MCFQWPV384F", "Overall": "4.0", "Content": "I picked up a silver SD940IS on a whim a couple years ago after catching a particularly good deal. I love my Nikon DSLR but I hate lugging it around. For me this camera is the exact sweet spot between good image quality, modest price, and true pocketability. This thing is so small there's really no excuse for not having this in your pocket at all times, and so inexpensive I don't feel over protective.In daylight it is capable of really great shots. The 28mm (equivalent) wide angle is awesome to have and fits well with my style of shooting. The battery so good I've never felt a need for a spare.It's not perfect, of course. Low light performance without a flash is probably below average. It's not particularly fast. Metering can be unpredictable and it will occasionally blow out highlights (I've learned to quickly bump the white balance around if its a shot I really want to turn out perfect).I recently bought a Canon S100 to try and improve the images from my pocket camera. It did take better pictures in many situations, but not amazingly so. For me and my needs it was totally not worth the additional bulk and additional money. I returned it and tucked my trusty SD940IS back into my pocket.If you understand the photographic limitations of this style of camera and the technical limitations of this particular model then you probably won't be disappointed.", "Date": "March 4, 2012"}, {"Title": "When I can't take my DSLR, I love this camera!", "Author": "Bill McNeil", "ReviewID": "R33O9VN3WVOGRZ", "Overall": "5.0", "Content": "I've owned this camera for about 2 years now and it's one of my all-time favorites.  It's the ultimate pocketable snapshot camera.  The wide-angle lens makes it easy to get the whole scene (albeit with some reasonable distortion at the wide end).  The meter on this little sucker is fantastic because it just nails the exposures time after time.  Shooting in the snow at mid-day?  Snow mode nails it.  Shooting at the beach?  Beach mode nails it.  Take some time to learn the settings and this thing is a champ.  Battery life?  Never a problem, not once.  Video?  Pretty darn good, even in low light (just don't expect to be able to zoom while rolling).When I absolutely need to nail the exposure the first time I leave it in auto flash mode.  Yes, the flash pictures are \"flashy\" but if you know cameras then you know it cannot be avoided with a tiny flash like this.  When I have a little more flexibility to re-shoot, I generally prefer to go without the flash and see what I can do with the various ISO settings (up to 3200 if you know where to find it in the shooting modes).  The noise levels are generally very good for such a tiny sensor.Ease of use is very good.  Could my mom use it?  Yes, but probably only in auto mode, where it still performs very well.  But in the hands of someone who doesn't mind rolling up their sleeves and learning a few simple moves, it is capable of a lot more.  That's not to say it offers a wealth of manual options, but there is enough to keep me happy.  Besides, if I want full manual I take my DSLR.One warning that applies to ANY Canon point-and-shoot: it's possible to get dust inside the camera (and it's really annoying when you do because you have to send it in).  The best defense is just buying a little soft case--as opposed to just leaving it on a towel at the beach, which would be, uh, a bad idea I learned.  I bought this one and it's a perfect fit: Case Logic UNZ-2 Small Universal Pocket with Screen Protection (Blue/Silver)  Ugly?  Sure, but my camera doesn't walk away accidentally at parties.Bottom line, this is a really fun camera that I've enjoyed tremendously.  It perfectly fills the role between my somewhat bulky DSLR and my mediocre camera phone.  I can throw it in my pocket on a family outing and know I'll have a tool that will yield some great snapshots.  [FYI, according to Steve's Digicams, this model has been replaced by the Canon PowerShot ELPH 300 HS 12.1 MP Digital Camera (Black).  Let's hope the magic continues.]", "Date": "July 9, 2011"}, {"Title": "Great product", "Author": "Patrick J. Mcnamar", "ReviewID": "R2O2UEF07LYN3L", "Overall": "4.0", "Content": "Typical Canon camera,  durable, full of features, great picture quality but no battery indicator until the battery is about to die.", "Date": "December 2, 2010"}, {"Title": "good picture", "Author": "mirrors", "ReviewID": "R2VK5RKZ1HHOJL", "Overall": "5.0", "Content": "bought it because Consumer reports recommend,take beautiful pictures. so far so good about the quality.", "Date": "November 2, 2010"}, {"Title": "Great Camera", "Author": "jdance7", "ReviewID": "R10OVYFRUEUCLO", "Overall": "4.0", "Content": "I read a lot about different point and shoot cameras. This one had the best review on the quality of pictures in different lighting. I have loved this camera. The only thing I wish is that the manuel explained the different features better. There are tons and tons of different features with the camera, so I have just had to go through and explore them. I love this camera!", "Date": "October 29, 2010"}, {"Title": "very compact", "Author": "Susan Sewell", "ReviewID": "R2WWCZG0W3DAYY", "Overall": "4.0", "Content": "I had previously owned a much larger camera but decided, when it was stolen, to move to a smaller one that fit better into a fanny pack. This certainly fit the bill - actually took me a while to learn how to hold it because it is so small. Pictures are clear and easy to download. Since I've had a Canon before, I could easily understand the menu. People admire the large screen. It does hesitate before actually taking a picture, but not as long as some I've seen. I've really enjoyed the wide angle setting - could fit quite a large group in one shot. Battery life lasted through over 100 photos over two weeks.", "Date": "October 26, 2010"}, {"Title": "great camera", "Author": "Dan Czaja", "ReviewID": "R7DQ77H0D6J22", "Overall": "5.0", "Content": "Bought this camera because it was one of the top rated cameras from Consumer Reports.  Not disappointed.  Camera takes great photos for the occasional shooter and its slim size makes it nice and portable.  I bought an 8GB SD card for it so that I don't have to worry about running out of space.", "Date": "October 16, 2010"}, {"Title": "canon Sd940", "Author": "ahsley benudd", "ReviewID": "R28UNS4PZO108E", "Overall": "4.0", "Content": "The canon SD940 has different features. Not many of them are written down in the helping guide, so we have to figure them out on our own. I like this camera because when you choose a setting, it explains what it is. For example there is not just a picture of a sun, underneath the picture they state what the sun means. Overall this camera is doing me well.", "Date": "October 15, 2010"}, {"Title": "Camera is nice", "Author": "skim", "ReviewID": "RAM77XZQ44PQB", "Overall": "5.0", "Content": "The camera is nice, I love the picture quality. the slimness of the camera and the hd video. This my first digital camera and it is everything I hoped for. The battery life is pretty good.", "Date": "October 6, 2010"}, {"Title": "Love Canon, love this camera!", "Author": "K. Townsend", "ReviewID": "R1V3H8266U4KG3", "Overall": "5.0", "Content": "I've always been a user of Canon's digital cameras and have never had issues with them (aside from when they've been overused and it's time for a replacement, which takes years to get to).  After having my previous Canon Powershot for six-seven years, I recently purchased this newer version of the camera before my trip to Italy and could not be more happy with the quality of the photos and the battery life of the camera (I could take pictures easily half of the day every day for one-two days per charge).  I also love how easy the camera is to use, and I especially love the expanded types of shots you can take to ensure the best quality photos.  Plus, this camera is very compact and can easily fit in your back pocket.I'd definitely recommend this camera to my friends and family.", "Date": "October 3, 2010"}, {"Title": "Canon SD94OIS", "Author": "HMSK", "ReviewID": "R2A8PJDX61D3B4", "Overall": "5.0", "Content": "Very satisfied with camera. Small, portable and lightweight. Excellent picture quality. Simple to use. No lag between shots. Easy to use and I love the features. I would recommend this digital camera.", "Date": "August 5, 2010"}, {"Title": "Great little camera", "Author": "JKRodeo \"JKRodeo\"", "ReviewID": "R2T0SKJAHGIPB4", "Overall": "5.0", "Content": "We have a big Canon digital camera and a big video camera. I wanted something small to take on trips or fishing that could also shoot videos. This is better than I expected! The video quality is great, and the camera is so easy to use. There are newer versions with touch screen, but I think this one is quicker & easier to use.", "Date": "June 18, 2010"}, {"Title": "Great, small camera", "Author": "Jennifer T. Wolke", "ReviewID": "R2EMTVZHQ4Q6P1", "Overall": "5.0", "Content": "If you are looking for a small, very portable camera, this one is great.  It doesn't have a ton of features, but for what I was looking for it had everything I wanted.  The zoom is great for the size and the camera is easy to put in a jacket pocket or loose pants pocket.", "Date": "May 27, 2010"}, {"Title": "Great images!", "Author": "Eli Zepeda \"elighten sf\"", "ReviewID": "RHW3YKQDB8EBD", "Overall": "5.0", "Content": "Everyone that comes across my camera immediately thinks - \"wow, nice...\" That's great and everything, but it wouldn't mean anything if the quality of the images wasn't great. This camera takes fantastic pictures for a point and shoot. Ooh - and I love that I can shoot HD video with it as well. Get a 8GB minimum memory card.I highly recommend it.", "Date": "May 26, 2010"}, {"Title": "Excellent Quality Camera", "Author": "OOna Moona", "ReviewID": "R256ZWCBYMWSCR", "Overall": "5.0", "Content": "I looked at quite a lot of cameras and reviews before deciding to buy this one.I was floored by this tiny camera's performance. This camera is fast! The burst feature is impressive. Indoor pics are very nice, not the greatest, but I think it depends on lighting and technique. Action shots of kids outdoors turned out great. The video quality is very impressive, I was amazed at the sound. Very very satisfied with this purchase.", "Date": "May 25, 2010"}, {"Title": "Great Pics & Easy to use", "Author": "Buster F.", "ReviewID": "R1UT8XL3U485JE", "Overall": "4.0", "Content": "This camera is very portable (fits into pocket or purse w/o even knowing it's there, takes super clear pictures, and decent videoes.  The battery doesn't last as long as I'd like, but overall, heppy with it.", "Date": "February 15, 2010"}, {"Title": "fastclip", "Author": "K. Clipp", "ReviewID": "R5QJRKYPG54IK", "Overall": "5.0", "Content": "Swift delivery with superb features. Well pleased and wife loves it especially with a 16 GB SDHC memory card.", "Date": "February 5, 2010"}, {"Title": "i love this camera!", "Author": "S. Murphy", "ReviewID": "R1XBP5EQKMJAWS", "Overall": "5.0", "Content": "I have only had this camera for a few weeks but i love it. I had bought 4 other camera's before finding this one. I have 2 young kids and i needed a camera that takes pictures fast. In low lighting it takes a sec. to take the picture but with good bright lighting it takes immediatly. The picture quality is wonderful, the pictures are very colorful and so crisp. The buttons are small and flat but they just take some getting use to. This camera is a wonderful camera to own if you are looking for a small great picturing taking camera. I would recommend this camera to anyone.", "Date": "January 22, 2010"}, {"Title": "Takes great pics but the mic for taking videos is terrible", "Author": "P. Romero", "ReviewID": "RDJK32LMCWVIP", "Overall": "3.0", "Content": "I bought this camera because I wanted to upgrade my CANON SD1000 so after reading reviews i bought this camera. I wanted a new Canon with HD video so that was the main reason for upgrading. The SD940IS takes great pictures, you can hardly tell a difference between the SD1000 7.1 MP pics and the SD940 12.1 MP pics, but they do look slightly better on the SD940.  Now the video is another story.  I go out to many electronic dance music parties and I take a lot of video.  I have no video or audio issues with the SD1000 except to say that it's not in HD.  The SD940 is in HD but unfortunately the audio quality on the camera is terrible. The mic is waaaaaaaaaaay too sensitive. I spent an entire night recording about 10 different videos with the camera at a club and in every single video you can hardly make out the song because the bass is just too strong for the overly sensitive microphone.  Focusing on an object while taking video is also another issue.  With the SD1000 all I had to do was push the button and it was immediately focused... with the SD940 the camera had a hard time figuring out what to focus on and I have a few videos that are completely blurry because the camera would not focus correctly. I returned the SD940 and I plan on purchasing the SD780IS instead after watching some videos of the same event I was at and I was pleased with the audio/video quality of that camera.I am giving the camera three stars because the pictures are amazing and it has many different settings, but the video and audio quality are just not good.  Below I'm leaving a link to one of the videos I took with the camera so you can see what I mean. Please see attached video.[...]", "Date": "June 20, 2010"}, {"Title": "Great camera with one disagreeable feature", "Author": "T. Greenwood \"Tom\"", "ReviewID": "R3K89BHP259P37", "Overall": "4.0", "Content": "I just bought this camera, the first thing I notice was the screen is awesome and it takes noticeably longer for the camera to get ready to take the next picture.All my other cameras had the zoom control on the back of the camera where my thumb rest; I have to relearn how to hold this camera because the zoom control is on the front of the camera, yeah it looks like it's on top, but to operate the zoom I have to hook my finger up and over the top of the camera. It is difficult to use finesse while trying to control the zoom. I tend to have jerky zoom. I find the zoom controls disagreeable.Don't use the lanyard that comes with this camera, it has a big bulky plastic piece that mars the paint on the camera when it rest in its case. I now have a new camera that looks like I've owned it awhile. Use your old lanyard.The mode selector switch gets easily knock down to Program of Movie mode while in the camera case or while I'm pulling the camera out of the case.This camera has two \"on\" buttons, the low profile \"on\" button that turns it on, and the \"Preview\" button that turns on just the picture preview.For a point and shoot, I don't need a lot of zoom; the 4x is a noticeable change from my old 3x. Maybe I should have upgraded sooner.The menu is a little complex for me, but all I'm looking for is a point and shoot with a few features that let me control the exposure, like sunset or night shots. It does take great pictures and it's compact. Even with the annoying zoom and slow reset, I like this camera. I like it enough I will give it to my wife while I continue to shop for one that suits my needs.", "Date": "January 20, 2010"}, {"Title": "IS works very well, but videos only in QuickTime format", "Author": "Emmanuel Maicas \"Emmanuel M\"", "ReviewID": "R2T3K5P4XPJ4BK", "Overall": "4.0", "Content": "I've had the camera for 3 months now. The IS works very well, both for pictures and video. My only disappointment is the video format: they are saved only in .mov (QuickTime). Compared to the more common .avi or .mp4, the .mov files are large and will not play on a Windows computer unless QuickTime is installed.", "Date": "August 29, 2010"}, {"Title": "Great camera, with limitations", "Author": "J. Nylander", "ReviewID": "RRI803HHRUDIF", "Overall": "4.0", "Content": "I bought this camera for a family member, but I borrowed it for about 500 pictures on a recent trip to Nicaragua.  I have an older Canon SD870 which I dearly love, but I thought I would like the smaller size of SD940 and it has HD video.  The picture quality is up to normal Canon standards... no complaints there.  Time-to-start-up, battery life are all excellent.  But I have two complaints:  (1) Even though I think I have normal size hands, the buttons (particularly the power and shutter release on the top) are just too far recessed to be accessed easily, and without looking.  On the flip side, my Canon SD870 is just the opposite - it's too easy to accidentally power on the camera.  And (2) Canon replaced one of the dedicated thumb wheel selectors... the shooting mode.  I like to easily be able to select Continuous Mode.  When you need it, you need it right away, and you don't have time to plow thru menus.  For that reason alone this camera will not be replacing my SD870. If that's not important to you then you'll love this camera.", "Date": "August 22, 2010"}, {"Title": "Decent digital camera with HD video recording", "Author": "A. Burla", "ReviewID": "R22DG2ZIEHSROE", "Overall": "4.0", "Content": "I got this camera just a few weeks ago and I shot a few movies in 720p and a few hundred pictures. It's the third Canon SD camera I have so I am quite used with the series. The first one died after almost 6 years, the second is still in use after 3 years.The camera looks small even if it's the same size as the other 2 - it's because the rounded corners. The buttons are OK, the menu has a huge selection of modes, but not a manual one, the image quality is very good for a camera with lenses and sensor that small.Recording video is easy and the quality is good, but there are 2 serious problems: 1. the length is limited not to the space on the card but to some limits Canon imposed with no evident logic behind it and 2. the video is recorded as H264 (great) in a .MOV container (very bad). Editing the video with popular tools like VirtualDub is almost impossible because of the poor choice of the container - AVI is far more popular.One strange problem with the camera is that opening the door to the card compartment shuts down the camera even if the lens is out. I understand why to shut down (it is possible to extract the battery) but no idea why it does not retract the lens.", "Date": "February 26, 2010"}, {"Title": "Great camera to take everywhere", "Author": "Thomas D. Campbell", "ReviewID": "R1WLWGCHGK008H", "Overall": "4.0", "Content": "Most of my photography revolves around my daughter. After noticing that out of the thousands of photos I have taken of my daughter, I didn't have very many with me and her. Carrying a DSLR around everywhere is inconvenient and I wanted something better than my iPhone so I started looking for something I could put in just about any pocket. I read reviews for about two weeks before deciding on this camera. The picture quality is decent enough and it takes 720p video. Its also very easy to hold out at arms length to take a photo of myself and my daughter when we're out and about. it's a great camera to photograph our adventures without getting in the way of the fun. It's also great for photographing places I want to return to later with my DSLR. Overall I'm very happy with it. The only criticism I really have is the battery life.", "Date": "February 19, 2010"}, {"Title": "Great Camer!", "Author": "Jesse Carriere", "ReviewID": "RMKNJJ1JV7P6F", "Overall": "4.0", "Content": "I started to buy cannon about three years ago.  My battery can last for months at a time.  Now the camera I just purchased is incredibly compact and extremely easy to use.  I know reading some of these reviews you can get mixed feelings about the product, but let me reassure you, this is a great point and shoot camera. It has many features for any occasion or event.  If you like cannon, you will love this product!", "Date": "January 7, 2010"}, {"Title": "Great camera!", "Author": "John", "ReviewID": "R8NL2VF234L0U", "Overall": "5.0", "Content": "This camera is perfect to go in your pocket, just make sure you get a screen protector for it.", "Date": "December 12, 2009"}, {"Title": "Best Digital Camera I have ever owned", "Author": "Michael van Vuuren \"Seeker Elite\"", "ReviewID": "R2EA58NRJ7O6KG", "Overall": "5.0", "Content": "which is not actually saying much since I have only owned 3 of them since they were invented. BUT, compared to the Sony Monstrosity I have used for the last 7 years it rocks everything I want to do with it.I am an online reseller and I needed something energy efficient and the rechargeable battery has more than paid for the phone. With the Sony SLR (which only accepted high density/lithium AA batteries) the camera would chew through them at an awful rate maybe 200 pictures per battery. I realize if I shot pics at a lower resolution/pixel rating, I could have conserved juice but going under 3M is awful when photographing Electronics/computer components.The Canon is awesome and the battery last longer.The camera has everything the Sony SLR had in a smaller package. The most important feature for me is the image stabilizer (I have a tremor) - this is the 1 reason I stayed with the battery monster Sony this long.Now me and my Canon are going to be partners for a long time!", "Date": "January 9, 2014"}, {"Title": "size matters", "Author": "Mehmet Berk Erturk", "ReviewID": "R217T21HSZ68Z2", "Overall": "4.0", "Content": "I like the size, fits everywhere. rugged too, my kids dropped several times and bruises on the corners but works well. not good indoor performance but overall a very nice outdoor camera if you like to carry something small.", "Date": "December 15, 2013"}, {"Title": "Great Camera", "Author": "Nina C H. \"ninross\"", "ReviewID": "R2LM804DFMCCQ7", "Overall": "5.0", "Content": "I absolutely loved this camera. It is a great point and shoot. Picks are great and its small. I only do not have because I gave to a friend in another country during a visit. He was going pic crazy with it. I can not believe it still cost so much. I bought it at least 3 years ago and I think cheaper by a few dollars.", "Date": "December 4, 2013"}, {"Title": "excellent", "Author": "Ivonne Bejarano", "ReviewID": "RVTTL69QPD9T0", "Overall": "5.0", "Content": "the camera is excellent and it was sent pretty fast. I am very happy with this buy. excellent pictures. great.", "Date": "November 20, 2013"}, {"Title": "Amazing camera, horrible depreciation", "Author": "Nikola", "ReviewID": "R421LK571ZFJ0", "Overall": "4.0", "Content": "We live in an era of point & shoot cameras becoming obsolete. Although I bought this camera more than three years ago and sold it just a year later, I got only a fifth of what I paid for it, and this was with it in like-new condition and all the original accessories.You can push this thing quite a bit when shooting on manual; it was to the point where some friends couldn't recognize my pictures from it vs. those from my 5D - truly remarkable!", "Date": "June 8, 2013"}, {"Title": "Comfortable and good", "Author": "Maria Fernanda Mejia Salazar", "ReviewID": "R58LGOJFIM1ST", "Overall": "5.0", "Content": "It's a very very light camera that fits in you pocket and takes very good pictures.It's Canon... so it's good!", "Date": "May 29, 2013"}, {"Title": "I love my new Canon", "Author": "Janet J. Marsh \"Nurse Jan\"", "ReviewID": "R5H1NCKIF07GO", "Overall": "5.0", "Content": "This is my 2nd Canon point and shoot. I loved the first one so I upgraded a bit for zoom. Very dependable and long battery life.", "Date": "May 17, 2013"}, {"Title": "Awesome Camera!", "Author": "bookworm", "ReviewID": "RRJ74ZXTY9FWT", "Overall": "5.0", "Content": "This is the BEST camera for a point and shoot!  It is compact, easy to use and takes wonderfully clear photos.  I have had several people who own other well-known name brand cameras comment on the clarity of the photos and ease of use.  It is my second camera of this model and I shopped specifically for it when my other camera was damaged at the airport by the inspectors dropping it on a concrete floor.  I would purchase it again and again...you do not need more pixels with this camera.", "Date": "May 9, 2013"}, {"Title": "Like it", "Author": "Nags", "ReviewID": "R2MRI9RV9KRA95", "Overall": "5.0", "Content": "I like this camera very much... Perfect to carry anywhere...I take this wherever I travel, easy to shoot....Very nice camera..I got a very good deal of 159$.", "Date": "May 9, 2013"}, {"Title": "Show needs more than 12MP", "Author": "cimino", "ReviewID": "R23DBJK3S2RQ6P", "Overall": "5.0", "Content": "This is a very handy camera, great price - better than trying to learn a new one every couple years.  They wear out but you can reuse the batteries!", "Date": "February 4, 2013"}, {"Title": "canon powershot 940 is", "Author": "deedee", "ReviewID": "R35RWWX2CMHL7O", "Overall": "5.0", "Content": "I love this camera, best camera I have ever had. Takes great Pictures. All I had to do was push the button, camera does the rest. Highly recommend it.", "Date": "August 9, 2012"}, {"Title": "Excellent point and shoot camera", "Author": "eugene", "ReviewID": "R6192D9A1BYPS", "Overall": "4.0", "Content": "I've been a fan of Canon's point and shoot cameras since buying my first one in 2003.  This is my third canon point and and shoot as I gave my first one to my parents to upgrade and lost my second camera while on vacation. UI is extremely friendly and can be changed quickly to get the perfect shot. I'm a fan of using the macro and different color settings and find the settings acceptable when I don't want to bust out the DSLR.  While this review is slightly old, I'm sure the upgraded models are just as good.", "Date": "April 23, 2012"}, {"Title": "Awesome Point and Shoot", "Author": "prg007 \"The gadget freak\"", "ReviewID": "R10OA4YBKQNB4M", "Overall": "5.0", "Content": "This is an awesome point and shoot for someone who doesnt want to change any settings and click with a point and shoot.I have had a couple of sony digital cameras but i think canon is much better in point and shoot.", "Date": "January 3, 2012"}, {"Title": "Still Loving it!", "Author": "M. Vanco", "ReviewID": "R1NK5GCZ54M0GD", "Overall": "5.0", "Content": "I bought this Camera in may of 2010, it is now Dec 2011 an I am still loving this camera! It doesn't have the fastest shutter speed, so some of the action photo's will be blurry, but it is small and will be there when you need it. It does excellent video, however the time limit is capped at 10 minutes. Even if you have a 32GB card in it. I have yet to find a way to change this setting and I have looked.The view screen is nice and big the auto setting is my go to setting. Macro takes nice photo's for Ebay. The auto timer is easy to use as are most settings. I do have trouble figuring out how to change the color setting of the Black and white plus. This is where the whole photo will be black and white except for a single color of your choice. Mine is currently stuck on green until I look up how to change it again.I have defiantly put this camera through a lot of physical abuse and it is still going strong. The original battery still has plenty of power, but I always carry spares. The paint around the lens is all chipped away but that is just cosmetic. The lens still functions like day one. Right out of the box I put a screen protector on the back and have never taken it off. The screen protector is very worn, I need to replace it but the screen underneath is pristine. I always recommend a protector go on out of the box.I am sure the price has come down on these since I bought it and that would make it an even better buy today!", "Date": "December 29, 2011"}, {"Title": "Great camera", "Author": "Steve Swanson", "ReviewID": "R362JKZ2XDR102", "Overall": "4.0", "Content": "I've had this camera for over a year now & continue to love it.  Awesome battery life, picture quality & ease of use.  Only issue I have is that the black paint on the trim ring around the lens chips off very easily.  I wish I had gotten the silver version.  I ended up taking the camera apart, removing that trim ring & repainting it myself.Other than that-no complaints.  This is my 4th Canon Elph(one stolen, others just wore out due to extensive use) and thus I swear by Canon & will never own any other brand.", "Date": "November 28, 2011"}, {"Title": "Easy to use!", "Author": "Teresa Hartz", "ReviewID": "R3BMVUSHWO5W3C", "Overall": "5.0", "Content": "Love this camera! Takes excellent pictures. No red eye, great night pics. too. Anyone can use this. Battery life is very good.", "Date": "November 19, 2011"}, {"Title": "Cant go wrong with a Wide Angle...", "Author": "Akbersaeed", "ReviewID": "R3KGRLYC9RPJ4V", "Overall": "5.0", "Content": "Worth Every penny. If your going to get a pocket camera, first off you need to make sure its a canon. Secondly, and especially if your one of those people that like to hold ur camera out in front of urself and take pics at parties, u wanna make sure u have THIS camera or another canon with the wide angle lens. The picture quality is exceptional and the battery life is pretty good. Wont fail you.", "Date": "September 1, 2011"}, {"Title": "Excellent Customer Service", "Author": "L. Theodore Lipka III \"Local Man\"", "ReviewID": "R1KTLEZNSBDGRC", "Overall": "5.0", "Content": "In addition to being a great camera, Customer Service Win.  My camera that I just received last Christmas went in the water while in Cancun.  I sent it in for repair with no receipt and admitting that it was water damage, expecting to be contacted with a repair estimate about a week ago.  Yesterday when I got home, I found that they had sent me a refurbished camera of the same model gratis.  Now that is taking care of the customer.", "Date": "July 28, 2011"}, {"Title": "Great Compact Camera!!!", "Author": "Mateo", "ReviewID": "R1LHHXVFRHE7HN", "Overall": "5.0", "Content": "Bought this camera for my wife, who was tired of hauling around my large DLSR camera with our 6 month old baby. I was sceptical in buying an ultra compact camera, and of the Canon brand after investing $1,500 into my Nikon camera. This little camera has been awesome, takes great pictures, and very easy for my wife to use as a basic point and shoot. Perfect size for carrying in a pocket, although it is almost too small, in that holding in your hand and using the shutter button can be a little difficult if you have large hands or fingers. I'd buy this camera again and would recomend to others!", "Date": "July 8, 2011"}, {"Title": "Thanks to Amazon!", "Author": "Vik", "ReviewID": "R1014R5QVNA0XM", "Overall": "5.0", "Content": "It was first useing of Amazon.com.I am amateur photographer, make photo by SLR Eos 5, DSLR Eos 5D.I have bought the Canon PowerShot SD940IS for my son during trip in Florida.Info about product is good. I have received product with no any problems and inconveniences.During return back at home i tested this camera, result: it was interesting, we have new possibilities to make photos.Thanks.", "Date": "April 11, 2011"}, {"Title": "Perfect Camera for Snapshots", "Author": "xoJessicaLeigh", "ReviewID": "R3PDN031ZHO09L", "Overall": "5.0", "Content": "I bought this camera after my other one was dropped in water and it has completely met my expectations. The tiny size is perfect for any pocket or purse and the battery life is amazing. I would definitely recommend this camera!", "Date": "April 6, 2011"}, {"Title": "Awesome!", "Author": "Jk070602", "ReviewID": "R3DJUUXPKPVUEK", "Overall": "5.0", "Content": "LOVE LOVE this camera!!!  It's perfect for what I need it to do!  Our scuba pics come out great!!", "Date": "March 9, 2011"}, {"Title": "This camera packs a punch!", "Author": "Visionary", "ReviewID": "R19FNNCALTMEQ", "Overall": "5.0", "Content": "First off Id like to say that I bought this camera mainly for the video mode and not for taking pictures.This is a GREAT quality camera that really packs a great punch!  Ive been using this now for over two months and I have to say, Ive never been more satisfied with a camera like this in a long time.  This is a SMALL camera and when I mean SMALL!!! This camera is great to record video and to take photos.No complaints about this camera but I will keep updating my review so if anything breaks you'll be warned... or something like that.", "Date": "February 10, 2011"}, {"Title": "great camera.  have purchased two.", "Author": "eric", "ReviewID": "R1I5GMQ9NLW5A0", "Overall": "5.0", "Content": "I received this camera when it was new as a gift.  and a year later saw that CNET reviewed it as being better than it's successor.  Its a really small point and shoot camera with EXCELLENT picture quality.  I usually play with the settings and use the slow-synchro flash, if any flash at all for great low light pictures.", "Date": "January 24, 2011"}, {"Title": "Canon SD940is", "Author": "Juana C. Price \"Crmn\"", "ReviewID": "R3CRNPIOIBLINH", "Overall": "5.0", "Content": "Excellent camera, I fell in love with this little powershot, though of course its not a D/SLR for you hardcore photographers,but it does more than what its worth,not to mention size of carry anywhere. The shots all come out crisp sharp and clean, figured it would take a while for me to get used to from the posts I read on blurry shots but it fell in place with me, as well as the flush buttons..and yes I do have wide thumbs. I prefer using the manual mode and synchro/flash myself due to the flash time is a bit delayed giving a more natural lighting effect to the shots IMO. It takes great shots in low light environments with no flash as well. I have an 8gb card on mine and so far have been able to record past 10 min of 720p nonstop video, make sure you dont zoom-in while recording,..def beats having a camcorder and camera or using a smartphone as viral video. And no you cannot charge the battery unless you have the battery charger with this item...as I suppose with other cameras and such..so yea, dont lose or forget the charger! Do your research and youll see things like the flip or kodak sport and those end up paying more and doing less..", "Date": "January 4, 2011"}, {"Title": "Great Little Camera", "Author": "Student", "ReviewID": "R1GMULKDZ4RMMX", "Overall": "5.0", "Content": "I got this camera because it's soo small that I can (and do) take it anywhere. and because it has better video quality than other similarly priced point-and-shoot cameras.  The only problem with it is that even though it has image stabilization, it is shaky so you've got to have really steady hands or a tripod or something to get great quality pictures. Typically (from a stable camera)you can blow pictures 1'x2' before they get blurry.  This camera was stolen from me and I bought the same one again because I liked it so much. I've made a promotional Video with it and used it a bunch for helmet cam stuff.  It's the size of a cell phone and I take it everywhere with me.  It's not a great Camcorder because the focus is set when you start it and doesn't change.  The Video is decent paning and shooting movement but pictures don't fare so well.", "Date": "January 3, 2011"}, {"Title": "SO good.", "Author": "Aja", "ReviewID": "R3IW0LWZB6VIB7", "Overall": "5.0", "Content": "This little camera can do so many cool things. I have taken it on a lot of hikes and it kept banging up against rocks. I sent it back to Canon because i had bashed it so many times, the lens would not pop out. Within a few days Canon sent it back to me, practically brand new (minus the scratches i had put on it) Canon is a great company; they are very easy to work with. They didn't charge me a cent for the repair and i was able to take the camera on my trip to Kauai. Love this camera. Definitely a good buy.", "Date": "December 9, 2010"}, {"Title": "GREAT CAMERA", "Author": "Christine Arciola \"Christine\"", "ReviewID": "R2JD2P2LJFRRCT", "Overall": "4.0", "Content": "Camera takes great pictures & easy to use. Had multiple Sony camera, prefer this one definitely. Battery lasts forever and ever", "Date": "December 7, 2010"}, {"Title": "Great Little Camera", "Author": "David L. Ferrell", "ReviewID": "R2T79C5GZ8GPLC", "Overall": "5.0", "Content": "Canon doesn't disappoint with this shirt pocket gem.  Easy to carry, easy to use, loaded with features for more advanced shooting or point and shoot automatically.  Picture quality is good and its video capability is adequate for home use.  We're glad we chose the SD940IS.", "Date": "December 7, 2010"}, {"Title": "Excellent camera", "Author": "Perez", "ReviewID": "R2Z2NYZV3660SQ", "Overall": "5.0", "Content": "Great little camera, it fits anywhere. Ou have to be careful or it can fall very easily.Picture quality us great. sometime you have to play with the settings a bit.I'm happy with it so far", "Date": "December 2, 2010"}, {"Title": "camera", "Author": "Jim", "ReviewID": "R2WI2JVNRGWBBK", "Overall": "5.0", "Content": "Great small camera. Excellent quality pictures.One drawback to the software that comes with the camers (ZoombrowserEX). It only allows printing photos one at a time, you cannot print 4 images per page of photo paper. You can overcome the problem by using the print function for images that is part of Windows.", "Date": "November 26, 2010"}, {"Title": "Nice little camera", "Author": "Vadim", "ReviewID": "R2A2USVBPDPXQN", "Overall": "4.0", "Content": "It is a nice point and shoot very compact camera. It feels good in hands, easy to use.Some pictures came out not very sharp. As all Canon cameras, it takes pictures with beautiful colors. I would definitely recommend it.", "Date": "November 23, 2010"}, {"Title": "Love it!", "Author": "Happy Gma", "ReviewID": "R1EFBNTUJOIZW6", "Overall": "5.0", "Content": "I am not very savy with technical stuff so I had my friend research it for me. I needed something easy to use and compact.  This reached my expectations and more.  I bought the Neoprene Sleeve Case with it which all fits perfectly in my purse.", "Date": "November 23, 2010"}, {"Title": "Amazing little camera!", "Author": "Tex", "ReviewID": "RY5TVX45I98RY", "Overall": "5.0", "Content": "This camera is fantastic. It's so small but yet takes great pictures. You really notice the wider angle lens vs. previous generations, especially when in small tight spaces like taking a picture of a room. It starts up really quickly so you hopefully won't miss too many shots. It doesn't take great quality low light pictures and has a weak flash, but every compact camera has those issues. The HD video mode is a nice feature on such a small camera and perfect for impromptu video moments or times you can't carry something bigger (for example: skiing/ snowboarding). Overall, it's a great camera that can be carried anytime due to it's size.", "Date": "November 22, 2010"}, {"Title": "Good item", "Author": "R. Wilson", "ReviewID": "R1PXN22ORNG4GE", "Overall": "5.0", "Content": "Overall is good product that does just what it is designed to do.  It is easy to use, carry and download.  For the price is is excellent.", "Date": "November 15, 2010"}, {"Title": "Excellent", "Author": "campaholic \"dw\"", "ReviewID": "R1FIBC3WXH7D1X", "Overall": "5.0", "Content": "Bought this as a gift for my folks to replace their old outdated camera and they absolutely love it.  Easy to use and high quality pix and videos.", "Date": "November 13, 2010"}, {"Title": "Canon PowerShot SD940 IS", "Author": "Hanna Beach", "ReviewID": "R269JHJML6VLH8", "Overall": "5.0", "Content": "I did a lot of research and purchased, and returned, two other camera before I found the SD940 IS to be the one.  I am extremely nearsighted and the 2.7\" screen was better than the 3\" widescreen on the SD980 IS.  This camera is perfect in every way.  It embodies just the right stuff!!  Other camera, more expensive and some not, had too much unnecessary features.  I wanted a camer that had some weight to it, took great pictures, great video and was compact.  This camera fit the bill and was perfect for me.  I recommend this camera to those who want a great digital camera with simplicity, yet a lot of camera.", "Date": "August 15, 2010"}, {"Title": "Good Quick Easy to use Camera, Decent Photo Quality", "Author": "R. Nguyen", "ReviewID": "R3VRH9SNWODJO9", "Overall": "4.0", "Content": "Great size and portability. I bought this for my mom b/c it is small and light. It is also pretty much a turn it on, snap a picture, and turn it off, and you're done. She isn't very good with gadgets so I wanted something that would basically do all the adjusting automatically. Her pictures are no longer blurry or too dark. The quality is satisfactory to me, but then again I am used to using a dslr. It fires up pretty quick and snaps the first photo within a couple seconds. It also has a decent wide angle perspective.", "Date": "June 8, 2010"}, {"Title": "love this camera!!!!!!!!!!!", "Author": "sweety", "ReviewID": "R2G9AHVUZOV9BY", "Overall": "5.0", "Content": "This camera has everything.i just love this canon camera and i will keep this camera 4 next 5 years...Bcoz i don't trust any other camera 4 gud result.", "Date": "February 17, 2010"}, {"Title": "Cannot change focus while recording video", "Author": "Mitch Chapman", "ReviewID": "RN2GUO5R4HYV7", "Overall": "3.0", "Content": "I bought this camera for its ability to record 720p video.  Although it was obvious from reviews that the optical zoom could not be used while recording video, it was not at all clear that the camera does not change focus while recording.  If your subject moves closer to the camera (or farther away) while recording, it will go out of focus.I missed this when reading other reviews.  The user manual, which can be downloaded from the Canon USA website, states this clearly -- if you know where to look.Based on their respective user manuals, it appears that the Powershot SD780 IS and SD1400 IS have the same limitation.", "Date": "October 21, 2010"}, {"Title": "Canon PowerShot SD940IS wid angle 12.1 MP", "Author": "Zzzzz", "ReviewID": "R2JL5RXVQ9EPE6", "Overall": "5.0", "Content": "I just bought this camera and the first thing I have to say is that it's extremely small and light weight.  The dimensions on this camera is extraordinary considering all the things this camera can do.  The camera has a 12.1 MP sensor, but megapixels are over-rated as anything larger than 10 is over kill.  I have a Canon 40D, which I love, but it only has a 10 MP sensor that would blow away this camera any day of the week, but I digress.  I used to have a Canon SD890IS which again, I loved, because it was compact and easy to use, but it was still a little bulky to carry in my pocket.  The SD890IS also didn't have HD video playback, which the 940IS does.  To me, with those 2 selling points, I had to test the camera out.Prior to buying the camera, I went to best buy to test out the SD780IS which is the older version of this camera and was amazed at the size of it.  I took some pictures and was relatively impressed so I bought it.  I brought it home and to my surprise, the camera was a return . . . the reason I knew this was because the date was already programmed into the camera and the battery fully charged.  I decided to take some pictures and some video and then return the camera.  After looking at the pictures, it's pretty much what you get, which is an ok camera for indoor shots, but a decent camera for outside shots.  The HD video is somewhat not completely true as it is on 30FPS and it basically makes the video a larger pixel size, which means that it just blows up the video to a 720 format.  It definitely looks much better than the 640x480 and if you intend to view the videos on a large screen TV, a must.The camera controls are a bit under-whelming, but it is intended to be a point and shoot, so even though I wish I had more control, I gave that up for size.  The other camera I really wanted to purchase was the G11 or the S90, but they were significantly more expensive and larger and I wanted the size of the camera to fit in my wife's purse or my pocket.  The controls are extremely basic, meaning you can set the size of the file, timer, flash on or off, and then some canon scenes which basically automatically or you can do it manually, set a scene for a type of picture, e.g., indoor, outdoor, night, etc.Again, the picture quality is what you expect from a small form factor camera and the controls are pretty much non-existent, but for me, this was not the selling point.  I own a great digital SLR, so I didn't need something to compete with that, I needed something that was small, took HD video, was easy to use, especially for the wife, and inexpensive, relative to the other cameras I was thinking about.  I agree some of the other posters that it doesn't take the best pictures, but that wasn't my biggest reason to buying the camera at this stage.", "Date": "November 30, 2009"}, {"Title": "good camera but not very durable", "Author": "PD", "ReviewID": "R2CPW2FDVXVFVP", "Overall": "3.0", "Content": "I bought this camera for work. Compact is what I needed, the features were a bonus. I picked it because the reviews were good. I was happy with it for about a week, until I dropped it. It fell about 2 feet to the ground & landed in stones. It has not been right since. A dark shadow in one corner of all shots. I've tried everything to fix it but to no avail. I found similar complaints on forums, but no fixes. I previosly had a cheap Fuji camera that had probably been dropped a dozen or so times over the last 3 years, but always worked. I think I should stick with inexpensive & clean the butter off my fingers. Lesson learned.", "Date": "May 15, 2011"}, {"Title": "Lens error only after 2 months of light use", "Author": "Kakashi", "ReviewID": "RYJF5IATY9ORE", "Overall": "2.0", "Content": "I've been using Canon's for a long time now and have never had any complaints until now. I bought this camera for my girlfriend and withint 2 months of light use, she received the dreaded lens error message. Perhaps it is just bad luck of getting a defective product or the fact that Canon is now assembling their cameras in China. I never had any problems with their older models which were assembled in Japan. Luckily it is still under warranty, but I am disappointed that Canon's quality has gotten worse and might have to reconsider in future purchases if they keep assembling their camera's in China.", "Date": "April 6, 2011"}, {"Title": "I liked it so much I got a second one when the first one broke", "Author": "Robert P Schillinger", "ReviewID": "RSHRTA2P8GU1N", "Overall": "4.0", "Content": "Background: I've never had a point and shoot camera before except for the horrible ones that came with my cell phones (including my latest crappy camera on the iPhone 3g - which is a great gadget but a crappy phone/service and crappy camera.) I have been using various DSLRs for the past year or so, so I can only compare this PNS with DSLRs or camera phones.That having been said, I was pleasantly surprised with how well this camera does.Landscape: It takes great landscape shots, the wide angle is fantastic.Macro: I love the macro mode, but it is a bit hard to focus correctly, and with the small depth of field inherent with doing macros it's somewhat tedious getting the exact shot I'm looking for.Portraits: The camera does a great job focusing on faces, and is incredibly easy to use when drunk and trying to get a snapshot of folks in a bar.Video: Wow, what can I say. I think that the microphone works surprisingly well for a point and shoot - it's clearly not intended to capture crystal clear sound but I think it's pretty darn good.Size: It's tiny. I have a case that fits the camera and a spare battery, and the whole thing fits very nicely in my pants or shirt pockets (don't put it in your back pocket, you'll forget about it and sit on it.)Feel: It feels chunky - not like it's going to break in your hands.Durability: This is where I mark it down. My father was going on a 30 day European cruise and was going to take his Nikon d90 with all the lenses and various accessories until I suggested that he bring my camera. He tried it out for a few days and decided that it would be perfect for his needs. Right after he took a shot of the Eiffel Tower he dropped it with the lens fully extended and it completely trashed the camera. I would expect the camera to be able to withstand a fall from chest height - not totally unscathed, but certainly not totally destroyed. This is why it doesn't get 5 stars.Extras: There are various modes that you can try out (sepia, black and white, selective color, etc.) but I don't think they are great, I can do all that and more with the software I have. In fact you can do it all for free with GIMP, but I prefer Lightroom 2 and Photoshop CS4 (odds are good I will be upgrading both next semester.)Auto mode: It works fairly well, but Program mode is far better. I find that in Auto mode the camera has difficulties knowing when I'm trying to take a macro shot, so by putting it into Program you can help it out a bit.Overall: It's a great little camera, I liked it so much that I got a second one when my first one was broken.", "Date": "August 4, 2010"}, {"Title": "Almost the best", "Author": "Nik", "ReviewID": "R3T7QQYE6UD7R8", "Overall": "4.0", "Content": "I was searching for good Canon camera, and on couple of websites recommended this camera as the best in the range $180 - $230. I liked SD 1300 IS but SD 940 IS has HD recording so that's the main reason why I opted for this model. Camera is good and I like that it's compact.Everything is perfect except:- microphone does not capture sounds if person who talks is 5 feet away, or it captures, but with very low volume.- when you zoom during recording, video gets blurry- buttons on camera sometimes make noise (type of noise from cheap materials used)", "Date": "July 30, 2010"}, {"Title": "Love it!", "Author": "NYCpink", "ReviewID": "R3GY1WE560XFBC", "Overall": "5.0", "Content": "I love the pictures that it takes!  I love how small it is... fits easily in my purse or in my pocket.  I would recommend it to anyone.  The only thing I haven't figured out yet... how to turn the flash on. There is a setting to detect if the picture needs a flash and a setting to turn the flash off but not to keep it on.  Weird.", "Date": "July 29, 2010"}, {"Title": "Solid camera for the price", "Author": "M. Glaspey", "ReviewID": "R2A83Y0XUNXEJR", "Overall": "4.0", "Content": "The camera is great for the price.  Ultra portable which makes it super convenient to slip in your pocket and take out for the day or night.  Only a few minor drawbacks for the camera.  There is a longer then average saving time when taking pictures when a flash is on.  Also do not expect DSLR photo quality or anything like this out of the camera, you won't be gracing the cover of photography magazine with it anytime soon.  However if you need a solid, high quality, ULTRA compact point and shoot this is it!", "Date": "June 24, 2010"}, {"Title": "Small, fast camera, but poor picture quality", "Author": "Andrew Smith", "ReviewID": "R1VXRZ7LRYPOPF", "Overall": "3.0", "Content": "This is my sixth Canon camera, including two digital Rebels and four PowerShots.  I bought it for its excellent wide-angle lens, and HD video mode in particular.  I wanted the wide-angle lens to capture more of a scene when in a small shooting space, and this camera delivered well.  It has the usual excellent shooting speed and lack of digital delay that I've come to expect from Canons.  The HD video mode is excellent, and the videos look great on my 52\" HD LCD TV at home.The biggest disappointment is the picture quality of the still shots.  The pictures are washed out most of the time, and facial skin tones look pasty.  Pictures look \"flattened\" and there's a loss of the subtle rosy skin tones that makes pictures of faces look like they're wearing thick foundation makeup.  Unlike my previous Canon digital Elphs, which I've kept for 3-4 years, I sold this camera on eBay after only a few months at a significant loss.  Save your money and look for another camera.", "Date": "June 20, 2010"}, {"Title": "Canon PowerShot SD940IS 12.1MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.7-inch LCD (Silver)", "Author": "Carey D. Wilson", "ReviewID": "RD7488VCGYBF4", "Overall": "5.0", "Content": "Excellent product. Portable, easy to use and it takes good quality photos in low light.", "Date": "June 13, 2010"}, {"Title": "user feedback", "Author": "Gengi \"Zoe\"", "ReviewID": "R1X6OLXJRLR0MI", "Overall": "5.0", "Content": "I have not use video feature much yet however, the camera is very simple to operate for 70 years old and took it to short trip and loved it. small enough to place it in our bag and did not add additional weight. Our daughter also own this camera however she own the larger proffetional canon camera with large long lenzes, but she likes this little camera to take along to where ever she wants to go and shoot the photos of her family and friends.", "Date": "June 12, 2010"}, {"Title": "Best Compact Camera", "Author": "S. Kim", "ReviewID": "R2697LA1W685X3", "Overall": "5.0", "Content": "I love Canon.  I think they make the easiest to use and most durable cameras.I had a Canon Elph 200 for years.  It still works, I just wanted the upgrade.What an upgrade I got! I love the wide angle lens and huge LCD screen.", "Date": "February 1, 2010"}, {"Title": "one of the best compact cameras!", "Author": "JP", "ReviewID": "R21T4RH5ZTWVNF", "Overall": "5.0", "Content": "I am now on my 5th Canon compact point and shoot and am amazed at how Canon continues to up their game in this category.  I am so happy with this new one.  The photos are amazing and it is so durable.  I spent days researching and came back to this camera.  A real win.", "Date": "January 5, 2010"}, {"Title": "be prepared to capture images anywhere, with this convenient point and shoot . . .", "Author": "trebe", "ReviewID": "R1CJ4HOGMM78Z1", "Overall": "4.0", "Content": "The SD940IS is an easy to use, compact, take it anywhere point and shoot, with a nice set of basic features, that delivers pretty good results in many general use situations.  How well the camera meets your needs, depends on how you plan to use it.  To that end, these quick observations may be helpful.Camera Body and Basic Operation:It's not weatherproof, but the camera has a durable, solid aluminum body.  The tiny body measures, 3.5\"x2.1\"x0.7\". The design is low profile, where the control buttons are basically flush with the surrounding surfaces.  When powered on, the camera is ready to shoot almost immediately, with the lens extending only 0.8 inches.  The SD940 is easy to operate with one hand, with the recycle time between shots (when not using flash or at high ISO), usually a few seconds.Lens and Autofocus:At the widest angle (28mm) there can occasionally be some funky distortion in the center part of the image.  This aberration usually improves as you zoom in.  The focusing area is typically a rectangular window in the center of the display.  AF performance is usually pretty fast, and reasonably accurate for well lighted, stationary subjects.  The SD940IS is not ideal for shooting on the fly, and generally needs to be held steady to get good results.  Getting decent results shooting moving objects, mostly depends on your skill at keeping the subject in the center, and good luck with focus lock.  The tiny zoom lever is located at the shutter button, and is usually very responsive and operates more reliably than some past Powershots.  Typical for most point and shoots, this camera is not well suited for shooting in low light, as focusing takes a lot longer, the zoom control is less responsive, and saving an image takes longer.Display and color renditionThere is no viewfinder, framing is via the 2.8 inch LCD display.  Most displays are hard to see in direct sunlight, but this one is not too bad.  Color rendition indoors is good, but like some Canon Powershots and DSLR's, when shooting in direct sunlight, images are often tinged toward yellow.  This appears to be mostly an in-camera phenomena, as the color of images when viewed on the computer, look closer to normal.  Seven white balance options are available, but if the color rendition of the display isn't that accurate, making custom adjustments on the fly can be tough.Controls and Display Menu:With such a tiny body and relatively large display, there isn't much space for controls, but Canon makes it work utilizing their familiar control system and menu design for Powershots.  The camera has four basic operational modes, Auto, Program, Movie, and Review.  In Auto mode, you just shoot and let the camera make all the decisions.  In Program mode, basic settings like ISO, Shooting Mode, White Balance and flash, are easily accessible via the main menu.  The text is quite readable, even for those who need reading glasses.Battery and Memory Card Capacity:The camera uses a 3.7 volt, NB-4L type lithium Ion battery, which is a reliable and steady source of power, typically good for several hundred shots per charge.  Performance seems to improve, after the battery has been cycled through a few times.  Carrying at least one spare battery is recommended.  Canon's NB-4L battery is not that expensive, but there are numerous cheaper generic equivalents available on eBay.  The memory card slides into the camera, right next to the battery.  At the highest image quality of 4000 x 3000 pixels, about 2500 images can be stored on a 8GB card.Movie Mode:The SD940IS takes decent quality 720p movies, but the image generally is choppy. The audio track is smooth and continuous, but the video will often skip along.  The zoom function is enabled during recording.  Movies are saved in Quick Time format, unlike some older Powershots that saved video clips as AVI files.Value and Conclusion:Most point and shoot users are looking for a reliable performer, that can produce good results in a variety of situations, with a minimum of adjustment, without breaking the bank.  The SD940IS will probably fit the bill for most casual users.  While not the newest model, the price has dropped, making this a good value, in a highly competitive area of the market.  Those with bigger hands, may want to hold the camera in their hands, and see how the buttons feel, before buying.", "Date": "June 8, 2010"}, {"Title": "Better than the SD780IS", "Author": "Omar Khabaz", "ReviewID": "R29MEGMX6JZMJS", "Overall": "5.0", "Content": "I gave my Sd780 away and after some research I decided to go with this one. It has many nice features especially the wide angle and the decent zoom. It's metal body makes it feel solid. It is ultra small and easy to use. Takes high quality pictures, and video. It has other nice features like color accent. Very happy with it, it's a keeper.", "Date": "December 24, 2010"}, {"Title": "Canon Powershot SD 940IS Purchase", "Author": "D. Crighton \"Dancing with my star\"", "ReviewID": "R2VEXSFKMI5W6J", "Overall": "5.0", "Content": "I was very pleased to receive my order even earlier than the anticipated date. The camera arrived well packaged. I cannot review the quality as it is a Christmas gift-can rate later.This has nothing to do with the vendor but, the only thing that disappointed is that I put my order in early to avoid the rush, and then found sales on this item that would have saved me $65 locally, and I had to pay postage. I will now wait to save next year. Diana", "Date": "December 20, 2010"}, {"Title": "Great Little-Big Camera", "Author": "Big Bird", "ReviewID": "RM1GD3T472XXR", "Overall": "5.0", "Content": "The only thing little about this camera is its outside dimensions.  It takes high resolution photos and videos, it is packed with features.  Has a huge viewing screen.  It's so simple to use, all three of my children (7yrs to 12 yrs) and wife immediately took to it.", "Date": "August 27, 2010"}, {"Title": "Packs a lot of punch in a small body", "Author": "Lady Rein", "ReviewID": "R1RC4M1O7N7P37", "Overall": "5.0", "Content": "I've had this camera for a couple months now. When I received it I was shocked at how small it was, nearly the same size as the battery charger. The picture quality is amazing!! It's easy to use as Canon keeps their functions pretty consistant from model to model. I LOVE this camera, especially for the price payed and the quality received. I would suggest this camera over and over!", "Date": "July 29, 2010"}, {"Title": "Almost, but not quite, perfect", "Author": "db \"db\"", "ReviewID": "R3467LJQ2623UA", "Overall": "4.0", "Content": "This is an overall very good camera that I would recommend, but it still has a few issues.  First, it has some shutter lag, just like many of its competitors. Second, my older Canon SD 1100is seemed to take better still shots.  The fact that this newer camera takes HD video makes it a good buy (the SD 1100is did not take HD video but it did take very good DVD quality video). Portability and build quality are good.  Canon's are a bit more expensive than competitors but I've been mostly pleased with mine and would buy it again.", "Date": "July 15, 2010"}, {"Title": "Near perfect pocket camera", "Author": "Justin Opinion", "ReviewID": "R1OMALZJUD8F37", "Overall": "4.0", "Content": "I wanted a camera to provide an alternative to lugging my bulky Nikon SLRs around on day trips and vacations, etc. I had a previous Sony for this purpose, but it has died and was bulkier than I wanted anyway. Realizing there are trade offs between size and quality, I opted for this Canon after doing some research.After a couple of weeks putting it to the test on several day trips and around the house, I am extremely pleased with this camera. First, it is tiny... I'm talking teeny tiny - which is perfect. Fits in a shirt pocket or pants pocket nicely and is not very heavy. Now I can have a quality camera with me all day and not have to have some bag over my shoulder or an overstuffed pocket.The camera powers up FAST! In just a couple seconds you are ready to shoot, which is great when a photo opp happens. The best setting is \"Auto\", and the camera does a nice job of focusing and exposing your shots. The quality of the images is extremely good and rivals some of my DSLRs. What I was really surprised by, and pleased with, is the HD video quality. This little camera shoots very good quality video!My complaints are few, and do not detract from my enjoyment of the camera, but just enough to prevent a five star rating:- The LCD screen is hard to see in direct daylight. I understand this is the nature of most LCD screens, but because this is the only viewing option, they need to work on improving that.- The mini-USB connection is protected by a small cover that does not open wide enough. I have to force it beyond its comfortable hinge range when inserting a slightly wider connector and am always worried I'll break it.- Once you get beyond the 4x optical zoom and move into digital zoom territory, the picture quality drops quickly. I use the digital zoom sparingly, and when I have no other choice.Overall, I am very happy with this little camera and plan to use it for years to come.", "Date": "May 27, 2010"}, {"Title": "Was defective when I first bought it!", "Author": "rumble", "ReviewID": "R1GNSVWM0VJ17O", "Overall": "4.0", "Content": "I owned 3 Canon Powershots. The picture quality of SD940 was a disappointment compared to SD550. I noticed the blurriness did not correct itself even after pressing the shutter halfway, so I sent the camera back to Canon for repair only after 2 months of ownership. Turns out that the optical sensor was defective and was replaced. Hard to believe but the pictures are sharp now. This means the camera was defective when I first bought it. Canon definitely have a quality issue they need to address otherwise they can lose a lot of faithful customers. I hope they won't be the next Toyota.", "Date": "April 20, 2010"}, {"Title": "Great portability", "Author": "In Arsene We Trust", "ReviewID": "R3T8FPYE4Y09V9", "Overall": "4.0", "Content": "I bought this camera to replace a very old Casio.  My main desire was to have something portable that did good video and could be used at clubs/parties etc.I'm very impressed with the flash when using it in clubs.  Even at a distance it illuminates the subjects. Also the wide angle means you can get everyone in the picture.The macro is excellent, the best I have used in a camera of this size.The daytime picture quality is pretty good but I was expecting a little better.  I am willing to forego this for the share portability of the camera though - easy to slip into the front pocket of a pair of jeans.", "Date": "March 31, 2010"}, {"Title": "Disappointment", "Author": "Sue Smith", "ReviewID": "R27CEPMX2R29Q7", "Overall": "2.0", "Content": "I am a professional photographer, and I actually bought this camera because I saw the good review of another pro.  The camera takes good photos outdoors...that is if you are holding pretty still.  The colors are good and the MP is good, however, I was so disappointed in ALL indoor shots.  Everyone came out blurry, almost a double image. I thought something was wrong with the camera, so I sent it back.  To my disappointment, there was nothing wrong.  They sent me out a new one, and the results were the same!  I took 900 pictures with it and it still was horrible.  As for the camera itself, it was much thinner than the Cannon I bought before, which I thought would be good for pocket carrying, but it is so slippery it's hard to hold onto.  The buttons are more even with the body of the camera, so it is a lot harder to push the buttons than earlier editions of any of the point and shoot Canons.  I am stuck with a camera that I really can't stand at all.  I am upset because we took it to Disneyland with us, and 50% of the shots were not sharp, or blurry.  I would stay away from this camera if you are looking for an excellent camera.  IT IS MEDIOCRE at best.", "Date": "December 23, 2009"}, {"Title": "I love it!!!", "Author": "Chiew Chueng \"cchueng\"", "ReviewID": "R1U65MF303XEI4", "Overall": "5.0", "Content": "It is just cool to have this camera. Small and compact and yet powerful! Nice pictures and videos. But the Videos is not in MP3 format. You have to use QuickTime player to play the videos. Your normal Windows Media Player or Real Player will not open them on your PC. You need to download software like QuickTime.", "Date": "February 10, 2010"}, {"Title": "First time I've had a disappointing Powershot, but Amazon Returns was super nice.", "Author": "Elwood P. Dowd", "ReviewID": "R2SQFTBFYAE2MH", "Overall": "2.0", "Content": "Bought this to replace my SD860 which, after three years of being dropped and crushed (and two trips to Canon for repairs), has started failing again, well out of warrantee.  I thought this tiny camera would be a great carry-arount device for every day, but I just have to say it has disappointed me, almost like I got a bum unit.* The autofocus is quite slow, it spends a lot of time hunting for the right spot.* The autofocus makes bad choices too often once it has settled down.  This is a really undexpected problem, as this is my fourth Powershot, and I've always thought they did great at reading my mind.* There was a not-pretty blotchy character to the images that I can almost replicate on my other cameras by turning the jpeg compression all the way up (i.e., quality down).  This is not what I choose a Canon for.  Even with jpeg compression set to NORMAL, the images remained low quality.So, I suppose Canon might have tried to just squeeze a little too much into this sleek little package.  I returned it, and Amazon was SUPER-NICE to give me full credit despite some bad scratches on the front.  I expected only a partial, maybe 50% refund (yes, I was willing to essentially pay to get this camera away from me), but they gave me all my money back.  I guess my next camera purchase will have to be from Amazon.", "Date": "December 22, 2009"}, {"Title": "Canon's Best PowerShot!", "Author": "D. Devine", "ReviewID": "RERMUI29C2WYC", "Overall": "5.0", "Content": "I used this about a week and I'm really like this camera. My first Canon camera ironically was a PowerShot 35mm that I bought 19 years ago. I took a lot of pictures with it during high school, I lost it during Tropical Storm Allison in 2001 because my house was flooded. I since then supported Sony CyberShot DSC-P50 (2.1 Megapixel) in 2003, and the last was DSC-W7 that was 7.2 Megapixel in 2005. When I got the Apple 24\" LED Cinema Display in May 2009. It has a true 24-bit Resolution with In Plane Switching (IPS) meaning you will have ALL 16.7 Million colors displayed. I went back and look at the pics and Sony really did not look good. Now I see why professional photographers don't consider Sony cameras. I started looking at comparisons with Nikon vs Canon. To me Canon was the best choice with color reproduction and detail and it was apparent across the entire Canon line of cameras. I look at samples well as pictures from individuals on Flickr. I wanted a smaller pocket camera to take everywhere because Camera phones was not cutting it. What helped a great deal was reading the feedback on Amazon and Canon's website. I first look at the SD980 IS and seen it had too many bad reviews. Which I concluded that SD940 IS was the best choice for features, function and ease of use. After a week I can honestly say that this is the best camera I ever own even better than the 3-CCD Sony DCR-VX2000 that cost me $3,000 back in 2000, simply because not only of the picture quality but excellent high definition recording, 720p @ 30 FPS video quality. I also bought a Sandisk 32GB Class 4 SDHC Memory Card in which Canon advise Class 4 minimum SDHC Cards for HD Recording. Sandisk Ultra II are Class 4 with a 15MB per second read with a 9MB per second write. I also purchased the Canon PIXMA All In One MX860 from Amazon also. I dump my HP printers because they always over saturate the picture with extra colors. Print quality from the SD940 IS looks awesome on the MX860. It really make sense to use Canon cameras with Canon printers for best results.", "Date": "December 16, 2009"}, {"Title": "Lens Error", "Author": "Robert E. Hooser", "ReviewID": "R3QTUTH396HZS2", "Overall": "1.0", "Content": "Bought this camera in January of 2010. Now have the Lens Error, a problem that Canon knows about and refuses to fix. Don't buy this camera!", "Date": "September 11, 2011"}, {"Title": "Spend a little more and get the G11", "Author": "Seabiscuit", "ReviewID": "R22CUN40UYEE5O", "Overall": "1.0", "Content": "I'm the sort of person that wants a camera that's more portable than a DSLR, but has just about as many features.  I was very disappointed.  The size was right, but the autofocus was very limiting and even decided whether or not a picture should use the macro lense or not.  It also wasn't very good at this and had a very slow focus time.  If it made a mistake focusing, which it often did, it would take extra long to try again.  Sometimes for a picture of someone sitting on the couch across the room it would pick the macro lens and take over a second to fix itself and then the moment would be gone.  I hated SMART auto focus.  The auto mode in previous canon cameras still allowed you to modify SOME features (like setting macro mode) that way most of it was automatic with a slight change, and then it would forget when you turned off the camera.  This camera did not allow you to change ANY features in automatic mode except turning off the flash.  I ended up returning the camera and ordering the Canon G11, which was way better.  It was more expensive, but this camera wasn't at all worth the money for me.  The G11 is awesome because it has most of the features I use the most in knobs on the top of the camera.  The picture quality is way better.  The 940IS didn't take low light photos very well, as it was very noisy.  I'd recommend spending a little more for a better camera.", "Date": "June 7, 2011"}, {"Title": "unbelievable as a carry every day camera", "Author": "M. salvi", "ReviewID": "R2NHZ5APTZZFTC", "Overall": "4.0", "Content": "I bought this camera to replace my clunky Nikon CoolPix L5 which takes great picttures of plants and apples, but blurs anything that involves anything alive and moving.  I used this camera on New Year's eve in an extremely low lit room.  The camera is light a night camera, and can see in really low lighing situations.  If is February and only now does the battery needs to be recharged. I have taken photos of 3 events in total since New Year's.  So the camera has a definite long life, much more than my previous cameras.  The thing is small and so you will need to use only one hand as otherwise you will place your fingers over the flash.  This is the size of a credit card.  I have placed it in really small purses, and I can carry it around in my purse every day because of its small size.  It does not have options such as black and white, sepia or other variations.  The video is pretty good and I have been able to zoom in while the video is going on. This is very useful.  I am not crazy about the wheel zoom and would have preferred a traditional W /T switch.  THis is a one hand operation camera as there are literally very few buttons to have to deal with.  The wider screen is great as I am getting older.  The camera is so simple to use that I do not need to see the markings on the buttons.  So far I have used only video and AUTO mode.  I bought the camera for indoor family functions which usually have low lighting and so this camera delivers.", "Date": "January 28, 2010"}, {"Title": "Major contrast problems with direct light", "Author": "Adrian Park", "ReviewID": "RGNY57FPLQTT9", "Overall": "2.0", "Content": "I bought this camera for my family trip to Europe and it was a disaster.  I am not sure if my camera was defective but it was completely unable to deal with any light contrasts.  If the sky was bright, the pictures were ruined.  If any object had light shining off of it, such as armour, the pictures had lighting blurs.  Even if sunlight was shining directly on my kids faces, the pictures were ruined.  I tried all of the standards setting, turned the autocontrast on and off, and experimented with manual settings but nothing helped. This camera absolutely ruined most of my vacation photos with it lighting issues.  I have to believe my camera was defective because no one would ever give a positive review with the problems I was experiencing.", "Date": "November 2, 2010"}, {"Title": "Returning it", "Author": "Lars Sveen \"Lars\"", "ReviewID": "RLD8IZWYIC7OS", "Overall": "3.0", "Content": "I was very happy at first when I brought this camera home.  The camera has trouble focusing sometimes but it's not a huge problem.  Picture quality seemed good in various light, camera feels bullet proof and very hefty (not plasticy at all), nice large LCD, 720 video seems to be a good framerate.  But then I went to copy the pictures and soon ran into it's shortcomings.  First I plugged it into my PS3 via USB (I like to copy my pics to that for viewing on my large HDTV) and nothing happened.  After messing around with that for a while, I discovered that it does not operate as a mass storage device, it only works by installing the included software.  I use Ubuntu on my PC so that software is useless (and I really don't want some unnecessary software just to copy my pics).  Oh well, I dug up a card reader and used that instead.  Then I couldn't figure out why I was unable to see the video files on my PS3.  So back to the PC again... and lo and behold they are quicktime movies.  Great... so it records HD video in a format that I can't easily edit or play back on any old device.  I don't want to have to set up a transcoding system so that every time I take some videos I can convert them into something useful.Pros: great hardware quality, colors are very vibrant, very compact, HDMI out.Cons: has trouble focusing, cannot copy files via USB mass storage (requires software), video in a useless format.For me, this camera is a major fail.  But if all you want it for is a simple point-and-shoot, and don't care about these shortcomings, then it's a fairly good camera.", "Date": "September 19, 2010"}, {"Title": "help me", "Author": "Sandra Hargrove \"shargrove\"", "ReviewID": "RX8W0VXRWO6AP", "Overall": "4.0", "Content": "Quick question.... I love my new camera...but why does the E32 keep showing up about one minute after I take a photo? I may return the camera because of this.", "Date": "June 23, 2010"}, {"Title": "Disappointing image quality overrides the benefits.", "Author": "T. Schrickel", "ReviewID": "RG8E6HV3JRZR4", "Overall": "2.0", "Content": "I have loved my Canon cameras, all the way back to my FTb (now you know I'm no kid).  I thought I would replace my battle-scarred SD870 with the tiny SD940, after all it has about the same optical specs and more MP.  I really like the small size, the black matte finish, and the overall high-quality construction - just like all the Canons I have owned.  However, the image quality just doesn't cut it.  I'm not sure why that is, I thought it was just the fact that I was taking a lot of indoor photos in natural light.  But after I tested it in full sun, shooting landscapes, they were very soft as well.  There is no excuse for that type of performance in a $250 camera in today's world.  For me, image quality is most important because I do books and some large prints, and the SD940 has noticeably poorer image quality than the 3-year old SD870.  I had to sell it, now I'm looking for a replacement.", "Date": "February 23, 2010"}, {"Title": "so disappointed :(", "Author": "Sally S.", "ReviewID": "R1C9VN30CY01GB", "Overall": "1.0", "Content": "why Canon? why?!?!?!?!?! i actually regret selling my SD850IS for this piece of garbage. picture quality is horrible... what a downgrade. the 850 was much more attractive, too. this is the only time Canon has failed me... i'm never going for these child's toy-like compact cameras again!", "Date": "May 16, 2012"}, {"Title": "Quality or Cuteness..", "Author": "dmonster", "ReviewID": "R2YIM3DFVJIOIA", "Overall": "2.0", "Content": "I think this is a good starter point and shoot camera for a day out and whatever could go down.. but if you're looking for high quality video/pictures.. This is not the camera for you. I think its compact and cuteness is awesome and I love being able to shove it in my skinny jeans pocket when I'm on the go and it's price is nice and low so dropping it often is not a biggie.", "Date": "November 6, 2010"}, {"Title": "Canon Powershot", "Author": "P Daddy", "ReviewID": "R3VGJNSCOZHJOE", "Overall": "5.0", "Content": "I would recommend this camera to anyone who is considering a purchase. I did enjoy the savings I made thru the Amazon/Chase card. Thank You.", "Date": "June 25, 2010"}, {"Title": "Canon Camera", "Author": "Lola Honey", "ReviewID": "R2IPNE9AHCBFBP", "Overall": "5.0", "Content": "Great camera. I would definitely recommend purchasing a camera through Amazon. Its cheaper, easier, and a lot more relaxing than going to a store to pick one out. It arrived in perfect condition, same as if I would have went to the store and purchased one myself.", "Date": "June 22, 2010"}, {"Title": "Mostly good", "Author": "Ilan", "ReviewID": "R8JPUFQYNSI99", "Overall": "4.0", "Content": "Great camera - had it about a week now, but there is definitely a fault in its construction/ease of use. The ON switch and the buttons on the back are set flush with the camera body making it very difficult to navigate with - especially in the dark.Otherwise its an excellent camera - happy with the quality and its ability to take photos in low light without a flash.Video quality seems excellent too.", "Date": "March 11, 2010"}, {"Title": "Great Camera....Amazing shots.", "Author": "M. Rosenberg", "ReviewID": "R3JEX61TLBFWEG", "Overall": "5.0", "Content": "Bought this at Samy's after going to 2 Samy's and hearing 2 reps tell me it is the one.  Have used it 3 days and for a point and shoot with all of it's good and bad points, this is THE camera. Love it.", "Date": "January 4, 2010"}, {"Title": "Canon SD940is", "Author": "A. An \"pipelinedrew\"", "ReviewID": "R2AERV3WHWAPVK", "Overall": "3.0", "Content": "Cant figure out this camera. In \"Auto Mode\" the \"Camera Shake\" display continues to show up when taking pictures. But then when you move back a step its goes away. And this \"Camera Shake\" icon even appears when i have the camera on a table and all i am doing is pressing the shutter button down halfway. Pictures in auto mode are really not great. So blurry. They are better in the manual (P) mode but you have to really adjust each component to get it right. I had the old Sony digital 10mp cameras and I think their cameras were a ton better. I am definitely not happy with Canon Camera", "Date": "December 27, 2009"}, {"Title": "Compact, but disappointing image, video quality", "Author": "J. Naoum \"joe nome\"", "ReviewID": "R3BMYKGW1S5HK9", "Overall": "2.0", "Content": "Very portable, very small. Image quality suffers- both still images and HD video. S90 stills much better, but no HD video. Last years  sd 790 had very good picture quality also. Sent sd 940 back.", "Date": "December 27, 2009"}, {"Title": "small and just okay", "Author": "Chatty Kathy", "ReviewID": "R2KR5XHTAL64JC", "Overall": "3.0", "Content": "I wanted  a good small camera for my purse. It doesn't do well in darker rooms and the automatic zoom doesn't really zoom. It's best for daylight and close shots. I guess you get what you pay for.", "Date": "June 24, 2010"}, {"Title": "Naccic", "Author": "N. Hsu", "ReviewID": "R1DU6OM62T7IGN", "Overall": "4.0", "Content": "I like the wide-angle and the big preview screen. The of small size of this phone makes it easy to carry.", "Date": "September 6, 2010"}, {"Title": "Same old Canon P&S;", "Author": "Victor", "ReviewID": "R1A0IZPQ4HER31", "Overall": "3.0", "Content": "In the last 5 years I have had a handful of these Canon point and Shoots at my disposal- this one is not much different than the previous iterations, despite the marketing gizmos and the public's uneducated craving for more pixels. Granted, it's still a 'good' camera. Just not much new from any other Canon PowerShot.HD video?  not like this is a crazy 'advanced' feature on a sensor that can see quadruple the HD format. It's a marketing trade name- believe it. And people wowed by the HDMI output are oblivious that this is CHEAPER to engineer- digital ~ digital.  It has nothing to do with Quality and nor does amping it up to 12 MP.Comparing my Powershot of 3 years ago- I tested the shutter delay between shots (yes, a half press pre, we are talking write time- black display) Both are the same. I could care less about the useless face recognition, I just want to recoup for the next shot FASTER. Come on, I know you can do this canon.What drives me nuts is how Canon likes to completely revamp the menu placement. One model has the P (program) then others have M (Manual) and then some have both. Some have a time lapse function buried in the M, others have it as part of the \"Movie\" function. What I like about a company is stick-tuitiveness and consistency- these wishy-washy marketing product managers are living in a haze.Another irk with P&S;'s in general is the on-camera flash. Nikon at one time had function to +/- the flash fill- Canon, not so much. It's always overblown- if you compensate -1 or -2 it loses everything else. I always tape a piece of 1/2 spun over the flash, helps a little.If you want a reliable P&S; and you DONT want to THINK- this might be ok for general use. Thats who it's made for. The average person- not a photographer who wants to get creative. But that's obvious. Right?", "Date": "November 6, 2009"}, {"Title": "3rd Powershot lost to filth in lens", "Author": "katie lukas", "ReviewID": "R16MNDVHBM951L", "Overall": "1.0", "Content": "I am admittedly pretty brutal on my point-and-shoots - I carry them in my pocket (now in a case), I take often dozens or more photos daily in a wide variety of conditions, and I take my camera everywhere.  I was okay with it when my first PowerShot went kaput after a year or so; photos started getting blurry.  I was even okay with it when the second PowerShot got some kind of nastiness in the lens after about another year.  I got kind of piqued when the third PowerShot sprouted similar filth in the lens after less than a year.It took less than a MONTH with this PowerShot to get some dust in the lens.  It was purchased for me for Christmas.  Today, five months later, it sprouted the middle-of-the-lens giant dark spot that just can't be coped with. (It's been pretty bad in the meantime, but I have been trying to put up with it for money's sake.)I carry it in a case, now, after the first couple went on me.  I'm a lot more careful about what I expose the camera to, and it didn't matter - this one went in record time.Apart from this alarming dust problem, I have to counter a lot of the glowing reviews of the Smart AUTO mode.  I had it on Auto for the first few weeks of shooting, for the most part, and discovered that the (semi-) manual mode did me much, much better.  With Auto - indoors, skin was almost invariably bleached out. I got tons of blurry pictures - far more than on \"program mode.\" I've never used auto mode since.I wish they'd given me a more manual mode - something more analogous to the previous generation of PowerShots - I missed being able to change the ISO at the push of the control wheel-button, for one thing.  But I didn't mind that too much, since most people don't seem to want that level of control.  The problem was that the smart auto wasn't very smart at all.On program mode, for the most part, the picture quality was stellar for a point-and-shoot.  All of the PowerShots I've used have moments (I guess it's charging?) when the flash drags down the speed dramatically, but that wasn't a big deal.  The facial recognition on this one is a huge improvement over earlier PowerShots, and I found that the focal point (again, in program mode) tended to be more accurate as well.  Macro mode seemed to suffer compared to the year-earlier model; I had a much harder time getting the camera to focus on the macro object.  I do a fair amount of macro shots and this was noticeable to me.By and large, I have been happy with the PowerShot feature set and picture quality.  If only I could clean the lens, I'd still be using any one of the three I've had in the past 2.5 years.", "Date": "May 3, 2010"}, {"Title": "This replaced My older Canon Model", "Author": "Jabberjaw", "ReviewID": "R28TFBF4IFZQKC", "Overall": "2.0", "Content": "Nothing spectacular here...The only plus is the larger LCD screen for viewing. HD video is VERY disappointing. Looks like any other video quality. Zooming doesn't auto focus so don't even try to Zoom while recording video. In HD 2 minute recording was almost 1 GB of memory. Save your $$ and buy the $125 Canon. I will probably be returning this one to Amazon.", "Date": "November 23, 2009"}, {"Title": "Canon PowerShot SD940IS", "Author": "Stephen A. Wolf \"STEVEWFD\"", "ReviewID": "R1GPS09BA6SRLP", "Overall": "5.0", "Content": "Great improvement over the Canon SD700ISwhich I gave to my son.Have not been able to get the video's toplay on my XP computers YET", "Date": "October 15, 2009"}, {"Title": "Removable batteries are a plus", "Author": "hifivalue on eBay", "ReviewID": "R22ZWR4KXBG64J", "Overall": "5.0", "Content": "I like the removable battery feature because I always carry a spare. One can be in the charger while you still have the use of the camera. I haven't tried the camera yet - waiting for the price to come down or my SD 750 to break. I have had great experience with Canon though and expect this model to be as good as any others this size.", "Date": "October 5, 2009"}, {"Title": "Looks Good", "Author": "Jennifer Ledbetter", "ReviewID": "R12SO9KYKYURBP", "Overall": "4.0", "Content": "I bought this as a Christmas present for my husband, so he has not yet used it.  It looked good and it small and compact which is what he wanted.", "Date": "November 18, 2009"}, {"Title": "Hit Or Miss", "Author": "Cleveland D. Hayes", "ReviewID": "R25O997OAE6NKN", "Overall": "1.0", "Content": "Well I picked this up because I heard Canon made good products and I wanted a camera that took good pictures and recorded HD video so this seemed like the best option at the time in my price range. Boy was I wrong. Menus are easy to navigate and the camera looks great but that's where the compliments end for me. Pictures can either come out good or just plain terrible. This camera can take some very blurry pictures. Alot of the pictures I took came out as if I took them during an earthquake when I was holding the camera as steady as possible. No matter how much adjusting I did it was either a good picture or a bad one. I took far to many bad pictures for my liking.I also dabbed a little with the HD video, it was okay inside for a point and shoot but I took it outside and the screen went completely white. I couldn't see a thing on the screen. Well that was the last straw for me and this camera went right back to Amazon. I played a little with the Sony Cybershot WX1 and then the Panasonic Lumix ZS3 and found the ZS3 to be the better camera out of the three in EVERY way. I am happy with my purchase of the ZS3.If you don't think what I said here is true get the cameras and test them for yourself.", "Date": "November 24, 2009"}, {"Title": "it is not a very good digital camera", "Author": "Don Phan \"Don\"", "ReviewID": "R1LQHQ0XDYZK6U", "Overall": "3.0", "Content": "there is no picture quality setting, so 12.1 mega px. just a fake, review it carefully before you buy.", "Date": "January 31, 2010"}, {"Title": "Disapointed!", "Author": "A. Mejia \"Al\"", "ReviewID": "R38A8979NB4ZVC", "Overall": "1.0", "Content": "The camera deserves every good review and comment given in other reviews. I am most disappointed in the lack of a printed manual, especially since there are not private manuals in the market. To me it indicates contempt for the needs of the customer on the part of Canon.Is Canon giving up its traditional care and concern for its customers?", "Date": "December 13, 2009"}, {"Title": "Camera nice, but battery charging usability bad", "Author": "Chuck Martin", "ReviewID": "R1R0W2DNFQP5Q9", "Overall": "1.0", "Content": "I needed a replacement for my Casio card camera (I broke the LCD). One of the best things about it is its cradle, connected to both computer and power; just drop it in the cradle and it charges, push a button and it transfers images. But the new version do not come with a cradle; you have to take out the battery each time you want to charge it. This is so bad for so many reasons. So I went searching for a replacement.And I found this camera. I played with it extensively in a couple of stores and was tremendously impressed. First, it's almost as thin as the Casio card cameras. Second, it feels solid, not plasticky. It's responsive. The main controls are easy to use, and the screen is big enough and bright. The auxiliary controls (menus and stuff) are a bit challenging because they are flush to the camera body. And I was not able to find the scene modes that make the Casio cameras so incredibly useful (for example, the whiteboard mode or the eBay mode, both of which just work). Interestingly, there;s a cover in the upper right that has both a USB and an HDMI connection. Wow.But this camera suffers fro the same fatal flaw as the new Casio cameras: you have to remove the battery to charge it. Here are the issues with that design decision:First, opening and closing the cover. The cover was not designed to be opened and closed so much. Over time, the hinge will likely loosen, or worse, deform.Second, it's so much ore work to open the cover, take out the battery, find the charger, put the battery in the charger, wait for the charge, put the battery back in the camera. Some might say \"well, it's not that big a deal.\" But usability isn't just about big deals, about fixing big frustrations. It's about the little deals, fixing the little frustrations, the little things that, by themselves uses don't often notice, but that add up over time. This is one of those. And it doesn't have to be: It'd be so easyto simply either provide a cradle or be able to just plug a cable into the camera.Which brings me to, third, the battery doesn't charge when you plug the USB cable in. Huh?? This is so mind-boggling stupid it defies description.Let's not that this Canon camera is not cheap. It's not competing on price, but on quality (as Canon rightfully should). So to leave out this capability on such an otherwise high quality device completely undermines the trust in Canon engineering.To be fair, having worked in high tech for so many years, I'd wager that this really was less of an engineering decision than a management decision. They didn't want to add the small cost it would take, or they wanted to push the model to market before the engineering for it could be completed, something like that.This camera is so new that the major camera review sites ([...]) haven't given it a real run-through, but I'm guessing that the photo quality will be to the usual Canon high standards. And if it wasn't for this incredibly annoying flaw, it'd have been in my cart and in my hands by now. But this is a real deal killer. My search will continue, with the very real hope that Canon engineering (or management) will pull their heads out of their...you know...and fix this in this camera's successor, turning it from a 1-star product into very likely a 5-star product.", "Date": "September 15, 2009"}], "ProductInfo": {"Price": "$289.99", "Features": "12.1-megapixel resolution; 28mm wide-angle lens with 4x optical zoom and Canon's Optical Image Stabilizer\nCapture 720p HD movies; HDMI output connector for easy playback on your HDTV\nCrisp 2.7-inch PureColor System LCD with wide viewing angle\nImproved Smart AUTO intelligently selects from 22 predefined shooting situations\nCapture images to SD/SDHC memory cards (not included)", "Name": "Canon PowerShot SD940IS 12.1MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.7-inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/410B-uj%2BmcL._SX300_.jpg", "ProductID": "B002LITT6U"}}