{"Reviews": [{"Title": "stunning image quality, great value, dramatic upgrade from D60", "Author": "Paul Christensen \"gadget geek\"", "ReviewID": "RIE86APGRWWAM", "Overall": "5.0", "Content": "Summary:- Outstanding (absolutely stunning) image quality, especially in low light and difficult lighting (high dynamic range) situations- 19 point-and-shoot auto modes great for beginners new to D-SLR- Extremely easy-to-use menu system- No compromises feature set not stripped of high-end features- Bright vari-angle screen with LiveView for hard-to-reach shots, but don't consider this a replacement for the viewfinder for most situations- Nice compact body easier to travelD5000 vs. Nikon D60:- Dramatic improvement in low-light and difficult light image quality- Improved auto white balance (but still not perfect)- Slightly bigger (taller and deeper) body, slightly heavier- 11 autofocus points, 3D matrix metering, Auto D-Lighting- Faster continuous shot performance (4fps vs 3)- Up to 63 JPEG/11 RAW images in continuous burst mode (the D60 can capture up to 100 JPEG/9 RAW images)- RAW+JPG with choice of JPEG compression- Full feature set including bracketing- 13 additional auto / scene presets- Additional in-camera editing including perspective control and fisheye- Slightly smaller viewfinder, but adds optional grid line support- LiveView with HD Movie Mode- Multi selector supports diagonal movement instead of 4 directions- Quiet shooting mode reduces shutter noise in quiet situations- support for optional Nikon GPS unit- HDMI output- same outstanding 18-55VR kit lensD5000 vs. Nikon D90:- Equivalent image quality, altho D5000 tends to underexpose capturing all detail vs. D90 tendency to overexpose high contrast shots- D5000 LiveView mode adds subject tracking- Easy to use auto / scene presets along with context sensitive help- More sophisticated interval shooting and time-lapse mode- Additional in-camera editing including perspective control and fisheye- Significantly more compact, lighter body- No autofocus motor in body for older or more professional lenses- No top LCD; must use back display to review settings- No depth of field preview- Lower resolution screen than D90 but vari-angle allows you to compose hard-to-reach shots- Slightly slower continuous shot performance (4fps vs 4.5)- Up to 63 JPEG/11 RAW images can be captured in continuous burst mode (the D90 burst is limited to 25 JPEG/7 RAW images)- Quiet shooting mode reduces shutter noise in quiet situations- .78x Pentamirror viewfinder vs. the D90's brighter .94x Pentaprism- Single command dial means more access to Menu for changing settings- Built-in flash cannot command external flash units with Nikon Creative Lighting System- No option for extra battery grip- Kit lens only 18-55VR vs 18-105VR- D5000 adds Airflow Control System in addition to dust reduction system- Better value, especially body onlyDetailed Review:Having bought my first D-SLR (a Nikon D60) last November, I was intrigued with the announcement of the D5000. At the time of my D60 purchase, I was considering the D90, but after holding both in person, I chose the D60 for its the much smaller form factor, lighter weight, and much lower price tag. I have been largely happy with the D60, although its low-light performance while dramatically better than my old point-and-shoot camera still wasn't fantastic.Given the D5000 uses the same sensor and imaging sensor as the D90, but in a smaller lighter case, I decided to upgrade. And I must say I'm exceptionally pleased with the D5000.What is to like over the D60?1) Stunning Image Quality even in Low Light, without a tripod or fast lensThe D5000 takes exceptional pictures, especially in low-light and in challenging lighting scenarios. The D5000 is the first camera I've owned that can take a picture at night and capture everything (and in some cases more than) my eye sees. And this is in Automatic mode (flash off), without a tripod, using an average-speed (f3.5-f5.6) Nikon VR lens. Truly impressive.I went back and took the same night shots in the same settings with the same Nikon 16-85 VR lens and the results are noticeably better on the D5000 vs my D60. The difference between the D5000 and D60 is almost as dramatic (in low light) as the difference between my D60 and point-and-shoot camera. I've posted a few example images to illustrate.Images captured even at ISO 1600 have exceptional detail and very low noise. Even when you zoom to 100% the D5000 renders these tough shots beautifully.Highlights are controlled and not blown-out, while even low-contrast areas of the picture are captured.2) Ability to capture details in challenging light, automaticallyThe D5000's ability to capture all details of an image, even at night, with areas of highly contrasting lighting is even more impressive than it's low-light performance. As some have noted, the D5000 has a tendency to slightly underexpose these pictures to preserve detail. (The D90 tends to over-expose these shots, illustrating that the D5000 is not entirely a \"D90 in a small case\".)In one example (posted to the customer images), a night-shot of the famous Castro Street theater the D5000 captured the bright neon signs, architectural lighting of the facade, and even the mosaic tile and billboards in the very dimly-lit entry. All again in automatic mode, no tripod, F3.8 ISO 800. When I post the sample pictures they will tell the story better than I could ever describe.I can only think that this performance is related to a combination of improvements over the D5000: 11 autofocus points, 3D matrix metering, next-generation Active D-Lighting, latest Nikon EXPEED processor.3) No-compromises feature set that is still easy to use for the beginnerOne thing that annoyed me about the D60 was its lack of some features (eg. bracketing) intended to \"dumb the camera down\". The D5000 has every control you would ever want, yet its menu system remains extremely easy to use even for a beginner.Example features the D5000 offers that are not available on the D60:- RAW-JPG ability to select JPEG quality (Std,Basic,Fine)- bracketing (useful for HDR post-processing)and I'm sure there are many others I have missed.The D5000 also includes a number of additional SCENE modes (a total of 19) for the beginner used to point-and-shoot simplicity. Everything from Night Landscape, Sunset, Food, Pet Portrait, Sports, and more.4) Useful Live View and Vari-Angle Display for those hard-to-reach shotsA first for Nikon, the D5000 includes a \"vari-angle\" articulated LCD. Despite the specs on paper (230,000 pixels vs the 920,000 pixels on the D90) the screen quality is outstanding - very bright and easy to see even in sunshine.Using the Live View mode, you can take pictures in hard-to-reach angles such as above a crowd, or looking up from a low angle, or taking a self-portrait. What doesn't work so well in Nikon's implementation is that the hinge is on the bottom of the camera, so if you're using a tripod your choices are limited.New to the D5000 LiveView (not on the D90) is subject tracking, which keeps focus on a moving subject within the frame.As others have pointed out, the D5000 LiveView autofocus performance is very slow. The more that I have used it, I must say that LiveView performance is probably  worse than your point-and-shoot camera. Some other owners on the Nikon forums have reported complete failure of LiveView autofocus, although on my D5000 it works.As it is, I compose 99% of my shots in the viewfinder, which gives you the super-fast response of a DSLR in the first place. For me the ability to use LiveView in hard-to-reach situations is a nice feature.What could be improved?- Well, first of all, the video is more of a marketing idea - the sound is monoral, you can't change auto-focus once you start recording, and the video has the infamous \"jelly effect\" when moving from side to side- Although the case is much smaller than the D90, it's still over 1/4\" taller than my D60, and doesn't feel nearly as comfortable in my hands.- The tilting screen is great, but the bottom-hinge design is of limited effectiveness when using a tripod.- Live View autofocus is very slow for a D-SLR (even worse in some situations than a compact digital camera)- Auto White Balance just doesn't get it right with certain lighting. But it's easy enough to correct with a custom white balance (if you have the time when taking the shot) or post-processing the RAW image. I just don't understand why my $300 Canon SD870 does auto-white balance so much better.All in all, however, the outstanding image quality especially in low-light, and features offset the very minor areas that could be improved. For that, the D5000 gets my 5-star vote.", "Date": "May 23, 2009"}, {"Title": "Awesome performance on a lightweight package.", "Author": "A. Ed \"César Lillo de Iquique\"", "ReviewID": "R1FNP6JQXHGLO3", "Overall": "5.0", "Content": "I got this camera back on July, its serial number is inside the range of the recall. But mine havent failed yet after 2 months of full time use.So I just wont send it to repair until it fails, crossing fingers here though. Anyway if it ever presents a problem I will just send it to Nikon since it has full warranty and Nikon's policies are to repair the unit no matter the time or when it fails, could be a lot of time, they will repair it fast for free.Ok now to performance, this camera performs as good as the D300 or D90 step up brothers IQ wise. High ISO performance is top notch, a few reviews over the net show that it has less noise than D300.This little consumer grade camera will do just about everything than other more expensive DSLR's. Like full manual settings, high exposure shots, D-Lighting, in camera editing, etc, etc.The little screen is just perfect, the size and weight too. The menu is user friendly, everything it has looks like a true 2009 model. 5 stars, cant find a flaw.This camera lacks an integrated autofocus motor, but that feature is for use of older lenses and some exotic ones. So it has 87 variety of Nikon and aftermarket lenses to choose from,that is one of the reasons I bought this camera, saving money discarding a feature that I wont ever use since Iam new to phootgraphy and Iam just starting making my own lens collection, with only new AF-S type of lenses that come with their autofocus motor. It doesnt have a top LCD display but I really dont like them, they look old. They are usefull, but really not a need.It has the video feature, wich it isnt as a camcorder quality but way better than a Cybershot, and its a DSLR so I wont go deeper about its video performance, wich anyway is HD 720p, for short clips is perfect.The 4FPS continuous shot is quite good, not professional but works pretty good, almost no different or noticeable than the 4.5FPS on the D90.The thing I like most, is the lightweight, coupled with my 70-300vr its ironic how light it is next to a ton of weight from other cameras with heavier lenses.Cant go wrong with this little camera. This is a great choice if is your first DSLR, or if its your 2nd body. Because if you are serious about photography, for more money u can get a more solid, body with more features, that are usefull for the professional photographer. But for everyone else, this 12.3 MP sensor is the same as the D300 or D90. The Image quality brings a tear to the eye, Period!", "Date": "September 8, 2009"}, {"Title": "Nikon D5000 vs Canon Rebel, keeping it short ...", "Author": "Ruslan Moskalenko \"Ruslan Moskalenko\"", "ReviewID": "R3BNDR0KVQJLL1", "Overall": "5.0", "Content": "If you're looking at this camera, my guess is you've done your home work and figured out that if you want a good DSLR on a budget, your choice is pretty much down to D5000 or Rebel. I came to that conclusion fairly quickly but making that decision was not easy. On paper Canon had better specs for the price but both cameras looked close ...There are numerous reviews comparing those cameras. Most of them are long, detailed and come to the same conclusion - both cameras are good - not really helping much at the end. So here I'll try to keep it focused and tell about the key differences which helped me to set my mind.1. Low light shooting. Recently I went to a party and a friend of mine gave me his Rebel. What I didn't realize before is in order to autofocus the Rebel needs to pop up flash and fire it a few times. Of course, it's not at full power, but still it ruins everything because you can't take a picture without distracting people. You catch some interesting face, point, shoot and those few flashes totally distract the person. Nikon has a white lamp, it's enough to focus but most people won't get distracted. So if you plan to take pictures of people in party like set up - Nikon gives you an advantage. (well, to be fair you can get an external flash which has a lamp for autofocus assist, but we are talking about the cameras here)2. Tilting LCD. Rebel has bigger and better LCD. However, I'm not a paparazzi, but time to time i need to shoot over a line of people in front of me (parades, street performance, small crowded room etc). With the tilting LCD you can raise the camera above your head and still be able to frame the picture. I found that very useful and Nikon has an advantage.3. Extra preset modes. Probably like the most people I used to keep the dial on \"Auto\" most of the time. And it worked ok most of the time. But I never could quickly figure out how to take a picture of my daughter blowing birthday candles or perfect sunset or something white on white etc. So when I tried the extra \"Scene\" preset modes on Nikon, I was really surprised how much better can those pictures be comparing to the \"Auto\". Try them out and keep in mind Rebel doesn't have many of those modes.4. Feel. Nikon has very solid feel in your hands. Maybe it's subjective, but I do like this feeling.So overall, Rebel does have a lot of specs slightly better than Nikon. It's smaller, lighter, the screen is bigger and has better resolution, it has more megapixels. Yes, it's all nice to have but this is a choice between good and even better. However Nikon offers some things Rebel just doesn't have (see above). So I bought Nikon and feel happy about it.A few side notes. The cameras are getting better and better and in a couple years you'll be able to buy a much better camera for the same price. The lenses and flashes on the other side are not changing much and hold value really well. So if you have a choice, try to buy the best lense (and for an expensive lense don't forget to buy a protective filter) and flash you can afford and maybe save some money on the body and upgrade it in a couple years if some new cool technology pops up.Hopefully my review will help you to decide one way or another.", "Date": "December 30, 2009"}, {"Title": "Awesome!!", "Author": "Contributing Author", "ReviewID": "R35W5LEKVYRSRI", "Overall": "5.0", "Content": "I did a lot of research before I decided to go with D5000 - including going to BestBuy and other camera stores and handling the camera to make sure it feels right.  In the end I got the best deal through Amazon (even though a D5000 kit at Costco had an unbelievable deal). I choose not to buy a kit because I wanted specific lenses with the camera.  I wanted one lens that I can travel with without the need to change lenses and another that I can use primarily in doors in low light conditions.  I got the Sigma 18-250mm f/3.5-6.3 DC OS HSM IF Lens for Nikon Digital SLR Cameras and Nikon 35mm f/1.8G AF-S DX Lens for Nikon Digital SLR Cameras lenses.  I also got a Nikon SB-600 Speedlight Flash for Nikon Digital SLR Cameras and an Eye-Fi 4GB Pro SDHC Wireless Flash Memory Card EYE-FI-4PC to wirelessly upload pictures to my laptop (D5000 has built in support for Eye-Fi SDHC cards).  Last week Eye-Fi came out with Eye-Fi 8GB Pro X2 SDHC Class 6 Wireless Flash Memory Card EYE-FI-8PC that has more features and almost the same price (bummer!). I also got UV filters for both lens to protect the expensive lens glass.The cameras I compared before buying were, Nikon D90, D60, Canon Rebel iTL, xTi, etc.I have used it for two weeks now with great results.  Camera is very easy to use, I still have not looked through the manual and have been able to find advance setting easily.  The auto-focus with both the lenses is very fast (faster if using the view-port than using LiveView).  I still have not been able to find a camera case that I feel good with - that is compact enough to easily carry around and I can get my essential accessories in.One big factor for me for selecting this camera was the swivel lens.  Being a big guy, I run into scenarios where I do not have clear line of sight to the subject I am capturing and have always wanted the ability to move the camera higher or away from my body to take great shots and the swivel LCD does a great job at it.  My tipod mount has not had any problem with restricting the swivel movement, but I have seen it at a store, where the tripod mount was huge and restricted the LCD movement.Again - overall highly recommended camera.", "Date": "January 12, 2010"}, {"Title": "D5000: for the budget-conscious intermediate/amature", "Author": "Zachary Wagner", "ReviewID": "R2O74JI0UXL9XI", "Overall": "5.0", "Content": "Having had the D5000 for a few months now, and having used it with a few different lenses, I figured I'd better chime in here, in hopes of pushing this one's rating just a bit higher.  It's certainly deserving.  One of the reasons this camera got a bunch of bad reviews all over the place at first was because of the recall.  Definitely a bummer.  But by the time I received mine, the problem had been dealt with, and I received a perfectly working model.  So how is it?In a word: fantastic.  I've owned one other dSLR in my life, and it was a Canon, and it was a while ago.  Needless to say, this was a HUGE step up for me.In getting truly serious about my photography, this camera has been the tool I've dreamed of having for a long, long time.  It's fast, light, takes wonderful pictures, and is reasonably priced to boot.  The menu system is well laid out, and there's a very useful info button if you want the quick-and-dirty of what a particular setting does.  I've used this camera with Nikon, Sigma, and Tamron lenses, and with all of them it has just performed seamlessly.  Of course, now that I know everything there is to know about this camera, it only makes me want a D3X that much more.  But parting with 7k for a camera is more than a little crazy, especially at my level.So my parting advice is this: if you really, really know what you're doing, you'll probably be a little disappointed and somewhat limited by this camera.  While it does an admirable job at higher ISO's, it's no $7000 camera.  In fact it's no $3000 camera.  Meaning that you will see noise at the higher settings, plain and simple.But if you're not expecting miracles, then this little gem of a camera might just surprise you with a few.", "Date": "October 18, 2009"}, {"Title": "Great camera, but missing one main feature", "Author": "Girl In A Box", "ReviewID": "R1IGFNUN116SJA", "Overall": "4.0", "Content": "This is a great little camera.  I was so excited to get it - it was really easy to use and has so many features to play with. I flipped through the manual in no time and was able to feel completely knowledgeable about it and comfortable with using it for the first time.  When I was considering buying it, I was also considering the D90.  I kept going back and forth trying to figure out which camera was for me and I chose the D5000 because of the cheaper price.  I have been getting into photography more and more and really wanted a second body (I also have the D50, which is also a great camera).  So this camera seemed like a good option before I started thinking about spending thousands of dollars on a professional camera.  I actually used the D5000 to shoot a professional job and it worked like a charm.  However, I recently bought a new lens that did not have the Auto Focus button on it, meaning, if your camera doesn't have the auto-focus motor built inside, then you are going to have to manually focus with these types of lenses.  I knew this when I bought the D5000 and wasn't concerned because I figured I'd stick with lenses that had the auto-focus button and since that was the wave of the future, why would I need old lenses?  Well, I was wrong, I needed this one particular lens and I was surprised when I was reminded that it wouldn't auto-focus with the D5000.  It would auto-focus on my D50, but the D5000 was so much faster and the most important functions for me were speed and focus.  So the lack of auto-focus motor is a deal breaker for me.  I am exchanging it tomorrow for a D90, which has all the features the D5000 has and more.  It is a semi-pro camera and has the in camera auto-focus monitor and very high ISO capabilities.  I will also be paying the $200 difference that I didn't want to pay in the first place, but at least I know I'll be happier with the D90.  Don't get me wrong, I am not giving the D5000 a bad review - I'm just saying, make sure you know what's missing.  If auto focus is at the top of your priority list for a wider selection of lenses, then don't get the D5000.  Spend the extra on the D90.  If you're looking for a camera that's super lightweight, easy to use, takes great pictures and has a million bells and whistles (not to mention the cool graphics on the LCD screen that I really will miss, but are really not necessary - just visual fun), then go for the D5000.", "Date": "March 26, 2010"}, {"Title": "Excellent camera for the beginner to advanced", "Author": "Tech Mologie \"TM\"", "ReviewID": "RJW3RYJ3W1P6J", "Overall": "5.0", "Content": "I just recently purchased the D5000 and have had this camera for over two months.  I've been searching for a digital SLR to replace my SLR (Nikon N90) and fill the gap from my point and shoot (Canon IS970). I have been doing photography as an amateur for 20 some years now and have to say that the D5000 fills what I need perfectly.  I was a bit perturbed about the reports in this forum about the problem with the Nikon and further still about support from Nikon in reporting the problem.  In the past I have not had any problems with Nikon products (maybe lucky?) and they have had great support from their dealers for any questions that I had. If you have a problem with a Nikon product, you have a wealth of choices in terms of support - you can go to a local Ritz or Penn Camera in the Mid-Atlantic if you are not satisfied otherwise. There are a couple of things I was surprised about:1) While I can use my older Nikon Lenses, they no longer work in AF.  You need the new lenses that support the new style of DSLR AF.2) You cannot use the older Flashes - it flashes too strongly for the CCDs/CMOSes and are not compatible with the new mounts. You will need to buy one specifically for these DSLRs.Either of the above is not a problem since purchases should be forward compatible from here on out...My buying thought process was the following:1) Quality pictures2) Quality build and company support3) Compatible with old lenses (to save money)4) Ease of use#1 was readily solved.  This camera is excellent in picture quality - I've been very satisfied with the pictures from high to low ISO with some understandable graininess at 3400 ISO. The CMOS sensor used in the D5000 is the same one as in the D90. Also, the 11 AF points are the same as the D90 and not the 3 point in the D60...  The build is excellent.  It is smaller than the D90, about as light as the D60, and feels solid. The past issue with the lockup is long done, I think.  I've taken about 2000 pictures so far and no lockups and on a single battery with the builtin flash (but not continuous - probably about 20% with flash). I had a bunch of old lenses from my N90 that I really wanted to save money with.  I can still use them but not with autofocus.  I went ahead and bought new lenses anyway except for my 75-300mm Tamron Zoom lens.  It's just a great form factor for that lens (light and small with a minimum barrel length of 2.5inches).  The camera is also incredibly easy to use - it reminds me of how easy my N50 was.  The learning curve on the N90 was a little steep which I suspect the D90 is as well.  I can use the D5000 as easily as I can use the Canon IS970, which I think says a lot - and without having to use the manual.  For getting the right depth of field using Aperture priority, I did need to look that up in the manual...I think the D90 is a great camera and there are more features to it than on the D5000, but the D5000 hit the right spot in what I needed - a really good DSLR that is easy to use, light, and give me enough options to take some serious photography when I want to.So 1,2,and 4 outweighed 3 - I could live with 3 since the only thing I lost was AF. Buy this camera and rememeber to buy a decent flash - if you are a beginner, you will run into the lens barrel shadow that all SLRs/DSLRs have with anything beyond an 18-50mm lens...", "Date": "February 10, 2010"}, {"Title": "Awesome for the money", "Author": "K. H. Alleyne \"Bigachiever\"", "ReviewID": "R3AOO25Y6IS5X5", "Overall": "5.0", "Content": "I'm excited to own such a cute camera. The LCD moveable screen is a HUGE plus for me. I'm becoming VERY advanced in photography and the practice of checking after EVERY image is becoming a thing of the past for me. I like to focus on photography while I'm working so closing up that LCD screen helps me to concentrate on the job at hand. The resolution is blowing my mind. Simplicity is awesome. I love simplicity. The MAJOR reason I got this camera is for good low light performance and it REALLY stands out there. I don't see any noise in my images even at ISO 3200. I can't wait to create a few 20+ inch canvas prints from this camera's images.", "Date": "July 15, 2009"}, {"Title": "Amazon still selling recalled products", "Author": "Happy Amazon Customer", "ReviewID": "R1YIAPEY83XEFW", "Overall": "1.0", "Content": "Despite the fact that Amazon has sold recalled serial numbers in the past, I assumed I was safe to order it from Amazon since it has been a few months since the last problem order as noted on previous reviews.  However, I was extremely disappointed to have received not only a recalled serial number product, but the box itself seemed to have been opened previously.  Just a warning not to order it from Amazon if you believe that they no longer sell recalled products because clearly they still are.", "Date": "October 19, 2009"}, {"Title": "VERY amateur photographer review", "Author": "R Rated \"Keeping it real\"", "ReviewID": "R37VQ1MS3O6VHE", "Overall": "4.0", "Content": "I'm not into taking photos with any degree of regularity.  Let's start there.  In the past, I've relied on point and shoots and cell phones to capture the moment so this giant leap into the D-SLR world was, for me, sailing into unchartered waters to put it mildly.  If you're looking for all the technical jargon and in-depth analysis of the various features, it ain't me Babe.  I do appreciate the efforts of the more learned and their comments/reviews which actually convinced me this D5000 was the best camera value out there and so far, that feeling hasn't been compromised.I got the camera and quickly viewed the accompanying DVD from the Nikon school which helped me understand the camera's capabilities along with the basics of how it operated.  The menu system is fairly straightforward and anyone with basic computer skills shouldn't have any problem in finding their way through the various modes although, at first, I found all the selections and options somewhat daunting so I left the main selector wheel on automatic and snapped off a few pictures to get a feel for the D5000.  The first thing I noticed was the speed and accuracy of the act with no worries about vibration or causing the pictures to blur.Taking clear photos of fast moving objects was another new experience that caused me to warm to the unit.  Through trial and error, mainly the latter, I've also learned the basic skills of zooming in, focusing, and using the various modes for sports action, twilight and a few other modes.  So, for a disinterested photo guy, the D5000 has delivered and actually made me want to search out more photo ops which was the purpose in getting this advanced (for me) camera in the first place.  I'm still trying to figure out the continuous photo mode where you're supposed to be able to take 3-4 pics in a row but that capability is buried somewhere in the various menu options which I'll sort out by reading the manual.A word about the actual choice of the camera over the competitors:  I elected to go with Nikon because of its name recognition, reputation for technical excellence and because of the various reviews I read prior to the purchase.  Maybe the other manufacturers are of similar, lesser or greater quality in this regard, but the Nikon name, to me, has been well worth the purchase price paid.  To me, it was sort of like buying a Toyota car over a Kia if you know what I mean?  At any rate, first time D-SLR buyers will be heartened to know that I made the plunge with the Nikon D-5000 and am glad I did with no buyer's remorse and the D5000 has my recommendation.", "Date": "December 14, 2010"}, {"Title": "Took my time looking for my first real DSLR", "Author": "W. Ivey", "ReviewID": "R3TT0IXQ2EQ7GK", "Overall": "5.0", "Content": "I'd been thinking about moving up to a DSLR for over a year, and actively researching brands and models for about four months. I started out looking at the Canon offerings including the Rebel XSi, T1i and D50 then extended my search to the Nikon D5000 and D90 and also the Sony 4/3rds Alpha offerings. After reading a lot of reviews and comparing full-sized sample photos from each camera I concluded a number of things:1. I probably couldn't afford the lenses that would do justice to more than about 12 megapixels2. Nikon and Sony sample photos were the best. The Canon photos showed more aberration, possibly from the kit lens but it was hard to say3. The entry-level Sony models were just a bit too small for my hands and the range of lenses (I could afford) was somewhat limitedThat left the two Nikons. I liked the \"hand feel\" of the D90, and the much higher resolution of its LCD was really nice as was the top information LCD screen. Its only real drawbacks were weight and whether the high-res LCD was worth the extra money (which I could otherwise apply toward a lens). Then, too, the D5000 had a few features the D90 lacked - features I actually thought I could use. (Interval timer, in-camera image corrections, etc.) Since I didn't have any old Nikon lenses the internal focus motor in the D90 was not useful. And, while obviously lower-res, the D5000's LCD is quite adequate.So, I went with the D5000. Since I didn't want the usual kit lens I bought the body only and bought a Nikkor 35mm f1.8G prime lens initially. (My previous film camera was used mostly with a 50mm f1.4 Zeiss lens so the Nikkor was a reasonable replacement.) I then bought a refurbished Nikkor AF-S DX NIKKOR 18-105mm F/3.5-5.6G ED VR zoom lens (the kit lens for the D90, and a much better \"walking around\" lens than the D5000's kit lens in my opinion). I ended up spending a bit more, but I got the lenses I wanted (the 35mm is really sharp and is great for low-light work).So far, it has produced terrific photos. My previous digital cameras were various point-and-shoot compact models (some of them work very well, but the small sensors have their limits) and a Fuji S9000 (also a small sensor, but is rather DSLR-like otherwise and I did some good work with it). The first few photos I took (with the 35mm lens) really knocked my socks off - the sharpness was astonishing (and without tweaking the default settings). The out-of-the box settings aren't bad at all, and there is a selection of \"scene\" settings (some on the mode dial, some available through menus) to fine tune things. (You can modify or design your own scene settings as well.)To really get the full benefit of this camera be prepared to put in some time with at least the manual. I found the menus easy to navigate after a little exploring, but there are a lot of options you can adjust especially if you want the camera to do some of the kinds of processing you might otherwise do with after-the-fact software.Cons: Not many. I wish it had the LCD of the D90 (or Canon's T1i). I also wish Nikon included more software - you pay extra for the computer control software on the Nikon while Canon provides it for free (not a dealbreaker for me, I don't expect to really need it for the foreseeable future, but ...)Summary: It's a lot of bang for the buck, lots of features to play with, and it makes great pictures. Can't really ask for a lot more than that.", "Date": "December 31, 2009"}, {"Title": "Your mileage may vary", "Author": "bmoag \"ae\"", "ReviewID": "R2TAFMRY2BGF1S", "Overall": "3.0", "Content": "I have been using Nikons for over thirty years. I am a great fan of Nikon although the price point of some of their products does not alway reflect actual quality compared to other vendors and Nikon has the same problems with production quality control as everyone else.I knew this camera had a tiny, dim pentamirror viewing system but based on its size and sterling reviews of its D90-like auto-focus I purchased it anyway assuming I could rely on the autofocus.The D90 is a nice size compared to larger body dSLRs and once you get used to the controls handles well. The video function is quite useful; I have never been a fan of live view. The low noise of the sensor is very impressive compared to just the prior generation of Nikon/Sony image capture devices.Nikon now has the camera only in part because of the recall based on potential early failure of the on-off switch. I commend Nikon for taking pre-emptive action. However potential buyers of this camera should be aware of reports that virtually every D5000 currently in the reatil chain is subject to a recall for this problem.I hope it is only my particular specimen but this camera could not reliably autofocus and systematically underexposes.Exposure issues are partly a matter of taste and can be easily compensated.However the execrable viewing system forces one to rely on autofocus and this particular unit needs bifocals.As I said, your mileage may vary.", "Date": "August 22, 2009"}, {"Title": "Defect Model, Amazon still sell", "Author": "Bin Du \"bryan du\"", "ReviewID": "R2R8PLBAXOIQDX", "Overall": "1.0", "Content": "I bought D5000 from Amazon after Nikon announced the D5000 recall. When I received the camera and check with Nikon website, the camera matched the defect serical number. Therefore, I had to ship it to Nikon for repair the same day. Hope I get it back in one week. Then my D5000 will be a repaired model or refurbished model before I used it.Two comments,1. If I bought it from local store, I can return it right away and buy D90 instead. Sad things for online shopping.2. If Amazon is really a responsible vendor, it should check the serial number and don't ship the defect models.3. If Nikon is a responsible vendor, it should ask resellers to stop seling defect models and send them for repair first. Shame on Nikon!", "Date": "August 6, 2009"}, {"Title": "D5000", "Author": "NoHo91606", "ReviewID": "RTBZR9GZ2S3QG", "Overall": "4.0", "Content": "Fantastic camera with lot's of great features...no need for D90, this is good enough for me.  Love it.", "Date": "September 23, 2010"}, {"Title": "Great entry level DSLR", "Author": "Tal Lev-Ami", "ReviewID": "R33E262F77VCIZ", "Overall": "4.0", "Content": "The decision to buy a DSLR wasn't an easy one. We wanted a camera that minimizes the need for flash (meaning it would bring in A LOT of light), that wasn't too heavy, and not too expensive. It turns out that no camera has yet to optimize all three (something about physics?), so we had to compromise. As compromises go, this was a very decent one. We compared it closely to the D90, and came to the conclusion it had all the same functionality (except for the ability to use additional flashes by wireless connection), and was lighter and cheaper.We've had it now for several months, and taken over 10,000 photos. It's easy to use and takes good pictures (and also takes many pictures quickly, so you can take 10 pictures and choose 1. We leave the camera in burst mode all the time). The video is also quite decent.On the downside, the live-view is not great, and you're much better off taking pictures with the view-finder.We're happy with the camera.", "Date": "July 19, 2010"}, {"Title": "Nikon 5000", "Author": "D. Jaisingh \"Deepak Jaisingh\"", "ReviewID": "R2HUMZJKU8ADNM", "Overall": "4.0", "Content": "I liked the photo quality a lot. Very satisfied with the results.The DVD is a great quick start lesson in photography. The button layouts, interface is very very user friendly.The only thing I did not like was the HD Video quality. Not that great if subject moves out of focus. I know its not a camcorder, but still.Other than, that A1.", "Date": "May 17, 2010"}, {"Title": "SLR Once Again", "Author": "William Thomas \"Kansas Band Director\"", "ReviewID": "R3IL7ZB3NH0JGC", "Overall": "5.0", "Content": "It has been about 20 years since I have owned an SLR camera.  This camera is AMAZING!  It has been so easy to learn and \"get back into the swing of things.\"  The pictures are fantastic. I never took pictures this good with my old Pantax K1000.  Battery life is exactly as stated.  Picture quality better than expected.  The various modes are great for me to get back into picture taking.  I am now able to \"catch\" my kids in motion that I haven't been able to do with my last digital camera.  Thank you Nikon and thank you Amazon for making such a wonderful camera so easy to use and so affordable!  I can't wait to add more lenses to my bag.", "Date": "April 12, 2010"}, {"Title": "Effective compromise", "Author": "Clay Olmstead", "ReviewID": "R1HHMP3VV1Y5KW", "Overall": "4.0", "Content": "I've had my D5000 for almost a year. I've shot several thousand pictures of a variety of subjects: landscape, family, sports, portrait, still life. I upgraded from film SLRs and compact digitals. This is a whole new world. It took me a little time to get all the features and settings where I want them, but I've got the hang of it now.The D5000 is a compromise: it's the sensor from the D90 and a user interface similar to a compact digital. It's right for me, because I wanted better pictures than a compact, taken over a wider range of lighting and action than a compact is capable of. The dynamic range is a huge improvement: no more treading the fine line between blowing out the highlights on one end and losing everything to noise on the other (sometimes doing both at once).I intended on using the articulating screen for taking candid shots of people, but it doesn't work for two reasons: shutter lag and the time to autofocus. In live view, I took pictures of a stopwatch and measured the shutter lag at 0.6 seconds. That's with manual focus and exposure, so I don't see a way to get reduce it any farther. The source of the lag is the mirror flaps down and back up again before the pictures taken. It seems silly, but there's no way around it. At any rate, the delay is too long to capture the moment in street photography. Not in live view, looking through the viewfinder, the shutter lag is very low - too small to accurately measure this way.The other disadvantage to live view is the time it takes to autofocus. If the subject isn't stationary, you have to use manual focus, preset the focus (using either manual or the AEL button) and - this is important - put it in AF-C mode (Continuous Servo Autofocus), so the camera takes the picture BEFORE it decides that it's focused. That last part is casually mentioned in the manual, but without it the camera cranks back and forth on the focus and you get a picture of your subject's hind end as they leave your field of view.One more thing: since it won't trigger flash remotely, this may not be what you'd want for a studio camera. There are several ways to work around this: wired flash, Pocket Wizard, etc. but you'd cut yourself off from being able to fully use CLS. If you think you're going to get serious about studio photography, you probably don't want to set that limitation for yourself right off the bat.All in all, I still like the camera. It takes great pictures, it's flexible and pretty easy to use and it works for a lot of situations.", "Date": "January 13, 2010"}, {"Title": "Excellent - Compact SLR", "Author": "James J. Pupo \"kelli\"", "ReviewID": "R26KJUSJ5L4599", "Overall": "5.0", "Content": "Excellent compact SLR that has all the essential components of the D90 and performs much like the D90. Image quality is outstanding. A great FIRST SLR.  A great TRAVEL SLR. A great BACK UP SLR. Excellent compliment to the D700.", "Date": "January 13, 2010"}, {"Title": "Best DSLR for the money!", "Author": "B. Scott", "ReviewID": "RCI53SK0SZT49", "Overall": "5.0", "Content": "I purchased this camera about 4 months ago and it is an excellent choice! I would recommend the body only, then add the Nikon 18-105mm and 70-300mm. It works extremely well in all lighting conditions and is as fast as the lens you mount on it. The only other thing I would add is an SB600 speedlight. If your thinking about this camera, just buy it, you won't regret it!", "Date": "December 13, 2009"}, {"Title": "Don't worry about recall cameras from Amazon", "Author": "Milton Big Elk", "ReviewID": "R3FPI2DK1CCR62", "Overall": "5.0", "Content": "I love this camera!  You should have no concerns about Amazon sending recall Nikon D5000 cameras.  I got mine last week and it is not among the recall serial numbers.  If they were sending cameras that were recalled, they aren't any more. I must also say that Amazon had the best price I could find anywhere in the reputable marketplace.The only \"con\" I have is that it doesn't fit the hand quite as well as the Nikon D40 that I used prior to stepping up to the D5000.", "Date": "December 7, 2009"}, {"Title": "Requires way more light!!", "Author": "Divergirl \"DiveGirl\"", "ReviewID": "R2BFQ7WX41EO8Z", "Overall": "4.0", "Content": "Out of the three Nikon's I own this one requires way more light than any of the others. That means that the shutter speed is way slower and your subject must hold still much longer to try to get the picture. Indoors the flash needs to go off all the time which my D70 did not.The same light issues go for the video recording.The only other issues I have noticed is that the flash has a much lower profile than some of the other configurations, meaning when shooting with certain lenses at certain fields of view there will be a dark ring on the picture where the lense has blocked the flash.Everything else seems to be working as expected but these two issues are a lot to contend with if you like shooting indoors or with lower light, moving objects and longer zoom lenses. My lense of choice is the newer 18-200 but does block the flash.Good luck and I hope you enjoy the camera.", "Date": "August 14, 2009"}, {"Title": "Buy this camera", "Author": "Amazoner \"reader, thinker, doer\"", "ReviewID": "R2BDV5ZV0PTXQI", "Overall": "5.0", "Content": "I have shot with D700 (2700$), D300, Canon 5D, 7D. I have shot in a variety of settings with 12,000 dollar gear. I say this camera is as good as them, and is the way to go. I recommend [...] about this. Currently, I am going to get rid of the D700, D300 and stick with this camera. I frankly have been influenced by ken rockwell, who has a deep understanding of how to take a good picture, and the influence of equipment on that process. It seems that Nikon sells much high-end and high-priced gear, and yes, if you are a National Geo photographer you can spend 8-30 thousand on equipment. But if you buy this D5000, your ability to take good pictures will not in the least be compromised. Well, OK, if you are shooting football from the 50 yard line, a 20 thousand $ set-up will give you a 5% advantage over this camera! Why so small for spending 50 times the money? Well, for one you get 12 megapixels and 90% of the controls of the $5,000 D3 series. For another, by the time the 20 k$ shooter's pictures get to a printer/web production, the difference is not even visible. Of course, this is a complex issue, but I stick with my words here.Why is this astounding fact true? IMO, Nikon knows they can make more money selling a cheaper camera to many more people.. So they take the technology they developed for the 5 k$ cameras and just put it in the 500 $ cameras. Why not? The sensor chips are already in production and cost Nikon only $10 apiece to make after the development cost is spent. Why should they spend another 100 million to make a lower quality sensor? This is the dirty secret of the Nikon cameras they don't want you to know. Comments?", "Date": "March 28, 2010"}, {"Title": "Good, but should have went w/D90", "Author": "J. Wattenbarger", "ReviewID": "R2HR2XA0B9L9XG", "Overall": "3.0", "Content": "Great camera, but I personally feel I should have went w/the Nikon D90 for the better quality view finder. I believe when judging the quality of the image on the VF- will make a difference in better photographs, either portrait of field work, in post.", "Date": "November 5, 2009"}, {"Title": "Nikon camera body d5000", "Author": "Keith", "ReviewID": "R2YZT773NZHKLS", "Overall": "4.0", "Content": "This camera was a very good deal for 260 dollars. It came with all the accessories, battery and charger, strap , sd memory card etc....", "Date": "January 2, 2014"}, {"Title": "great little camera", "Author": "Kw4nikon", "ReviewID": "R2QFM2BSYGWVQH", "Overall": "5.0", "Content": "I bought this as an astrophotography camera. I sent it off to be modified to see more red, like in the Orion nebula. I like it because it is relatively inexpensive but is light and performs well. This camera is made for lenses with built-in motors, so the body is light. But it accepts older Nikon lenses with some loss of functionality. It has the live view and magnification for focusing, the screen tilts and turns, and it has a 1-sec delay option to reduce mirror slap vibration. I have a remote shutter release with timer and let it shoot all night. Not the most sensitive, but you can't beat it for the money.", "Date": "November 11, 2013"}, {"Title": "Good camera but...", "Author": "Jessie", "ReviewID": "R13Y2P4Y2ELUYJ", "Overall": "5.0", "Content": "This is a great camera . It's way better then the nikon d80 I have plus it has video that is pretty good. I have already made some short videos with music . One thing is I didn't research before I bought it so I didn't know it wouldn't auto-focus with my 50mm f1.8 lens. it's hard to get manual focus shots clearly in focous from a distance unless I push the picture zoom in button then focus when it looks clear then take the picture but that's still difficult if the subject is moving around. But then again this will easily be fixed when I buy a newer nikon af-s lens next month. the pictures I have taken turn out good when they are in focus the ones that look dark I can use d-active lighting to brighten the picture. it works perfectly . I would recommend this camera especially if you are upgrading from a older camera like the nikon d80.", "Date": "August 13, 2013"}, {"Title": "Suddenly stopped working after 3 years", "Author": "Corey Miller", "ReviewID": "R27GSA70D0BS4", "Overall": "2.0", "Content": "Suddenly stopped working after 3 years right in the middle of a shoot :/ it was awful I lost out 600$don't buy.", "Date": "August 6, 2013"}, {"Title": "Love, Love, Love!!!", "Author": "Devin", "ReviewID": "R3CPFAZHXEESVR", "Overall": "5.0", "Content": "I love the quality of this product, the photographs are sharp and all the buttons work. When in Automatic very sharp. Easy to use. The screen had no scratches and came in a very well shipped package. Everything that was that was included with the camera body was there. I would recomend this product to others. It was also shipped very fast and came before the estimated mailing date.", "Date": "May 17, 2013"}, {"Title": "Amazing!", "Author": "Jacqui", "ReviewID": "RG2WQRIQE3JZ0", "Overall": "5.0", "Content": "I had the Nikon 3000 before this one. The camera is awesome, with better picture quality, and camera capabilities then the 3000. The price is amazing, as I checked many different sites before buying it here. Was delivered quickly, and I am loving taking pictures with it!", "Date": "August 20, 2012"}, {"Title": "Nikon D5000 12.3 camara", "Author": "Emilio", "ReviewID": "RUYWTDHQZWJ76", "Overall": "4.0", "Content": "The camara is a great just the video is not that sharp as i wanted but over all it takes good pictures i recommend this camara to anybody.", "Date": "July 3, 2012"}, {"Title": "great camera great price", "Author": "laurencg", "ReviewID": "R2S5UP3D693DGU", "Overall": "5.0", "Content": "after extensive research, this camera met all of my needs at a great price.  getting an older body saves money, especially when it's the lenses that matter the most.  i'm excited to learn how to use my new dslr!", "Date": "June 25, 2012"}, {"Title": "Best small DX camera ever", "Author": "Nick the photog", "ReviewID": "RMQNHP236BB4G", "Overall": "5.0", "Content": "Great image quality, 12MP sensor is much easier on the lens than newer 14MP or 16MP sensors (D3100 or D7000). This little gem conbined with Nikon 18-70 or 16-85 can produce an excellent results, easy printable at 20x30 inches. And it's light and small, you can carry it 24/7, always ready for the picture opportunity.", "Date": "November 7, 2011"}, {"Title": "Another great Nikon", "Author": "TomsMom", "ReviewID": "R39PBUZQTFI6EO", "Overall": "5.0", "Content": "I'm a Nikon girl going all the way back to my original CoolPix 10 or so years ago.  I moved up to the D50 and then finally the D5000.  I like the rotating LCD screen.  I tend to carry the camera in my purse instead of a case.  The ability to rotate that screen keeps it from getting scratched up.  The camera itself is a breeze to use, with so many modes, for every posible situation.  I did buy the extra books about how to use the camera, as the manual is somewhat lacking in information.  But those books are good investments in my opinion if you want to use this for more than just a point and shoot camera.  I replaced the kit lens with a higher end Nikon lens, 28-200.  It allows for a more permanent lens than having to switch between two lessers lens.", "Date": "October 15, 2011"}, {"Title": "Nikon D5000 + Nikon 8-200mm VR II", "Author": "Dipen N. Desai \"donison\"", "ReviewID": "RP4J9397QEOGH", "Overall": "4.0", "Content": "Equipments: Nikon D5000 + Nikkor 18-200mm VR IIExperience: AmatureUsage: 1 Year 6 MonthsClear your mind and remove all -ve thoughts about this lense.  JUST BUY IT.  Use it and then you will realize what is the potential of this lense.  Even a lot of PRO photographers are using this lense 70% of the time when they want to travel light.A perfect lense for all situations.  Definately not a PRO Lenase, but can do more than required for an amature / semi-professional photographer.I want to start my photography career with a decent investment and want to buy a lense that works fine in most of the conditions.  I spent months reading reviews for this lense. See the website list.....- Amazon- B & H Photo Video- Adorama- Abes of Maine- Ken Rockwell- DPReview- Camera Labs- Nikonians- Shutterbug-------- and list goes on.Here are some Pros-Cons based upon real life scenarios that I faced.....-- Can not use in-built Flash of D5000 when 18-200mm lense is set to the widest angel of 18mm.  Gives a ghosty lense shadow at center-bottom of photo.  Flash works fine with 24-200mm range even when barral is fully extended at 200mm.-- Nikon D5000 is a not too heavy (only 560 gms).  Nikon 18-200mm is heavy (again 560 gms).  When this combination is around the neck, because of weight of the lense, it doesnt stay in place.  A user feels unsecure when constantly lense is pointed towards ground.  Also creeping of lense makes condition even worse.  Make sure to use 18mm LOCK more frequently.-- There is significant BARREL and PIN CUSHION distortation (In General: BENDING) acroos focal range.  After reading a lot of reviews, this came to my attantion and now I am observing it more frequently during photography practices.  THIS IS NOT A BIG DEAL.  Not a big deal unless someone photographs straight lines, architectural systems or buildings.  ---- Camera has inbuild correction menu, where this can be corrected.  Bending can also be corrected thru PhotoShop or other similar softwares, but can not be removed 100%.-- Focus ring has very small movement.  Average focusing distance is 4~6 inches.-- Lense uses 72mm filter.  They are not tough to find, but they are not widely used.  A buyer can easily find cheap filters (to start with) on Amazon.++ Camera is designed very well ergonomically.  Only person with bigger hands needs some adjustment time initially.  Overall very much satisfied with size and design.++ Lense is super sharp and focuses extremely quickly in average to bright light situations.  It has some lag when light is not sufficient.  AF illuminator is very handy in certain situations.  But keep in mind that AF illuminator can be disturbing for a close potrait shoots and for wild life photography.UPDATE:  Nikon has introduced Nikon D5100 with slightly higher price.  But some of the additional features are,- Display opens up side-ways.  Much better for a tripod mounted camera.- A better, brighter LCD- All buttons are moved to the left of the camears.  One handed navigation and photography is possible.- Captures 10880p full HD movie- Auto-Focus during the movieVERDICT:  Just buy the combination and head to the field.", "Date": "July 31, 2011"}, {"Title": "Great upgrade from a D60!", "Author": "thepinoy", "ReviewID": "R1FGWZWBQE6X7V", "Overall": "4.0", "Content": "I bought this camera last year, after owning a D60 for just a few months. The D60 was an ok camera, but I quickly outgrew it. I wanted a camera with more features and better ISO performance. The D60 pics would get noticeably grainy after around ISO 800. With the D5000 I can set auto ISO to 1600 and be totally happy with the images. Even ISO 3200 is usable. My camera was part of the recall, but I never had a problem with it. I sent it back anyway to have it repaired, and got it back in about a week. I've taken almost 10,000 images and have yet to experience any problems.My only gripe with the D5000 is having to go through the menus whenever I need to change something. It would be nice to have dedicated buttons for my most frequently used settings. That D7000 looks pretty tempting... :)", "Date": "October 29, 2010"}, {"Title": "Nikon D5000 is HOT!!!", "Author": "D. Noggle \"D. Noggle\"", "ReviewID": "R3LUW650GU6Y82", "Overall": "5.0", "Content": "I have had the camera in my hands for five days.  It does so much more than my old Nikon FN.  The Tamron lens that I matched with the camera is a great combination 18-250.I have super light sensitive shots of friends and objects.  Nature provides nice light contrast as well!The user manual is full of examples and cross-references to get you going.  I really like the heft and placement of the controls of this camera.  I have had photography classes and darkroom experiences.  I am Adobe Photoshop experienced, as well.  This is going to be an exciting adventure in photography.  Give Nikon a try.  The few extra bucks for the name is part of the end result.  The lens you buy makes a difference as well.", "Date": "August 18, 2010"}, {"Title": "Best camera in its class!!!", "Author": "Yash Upadhyay \"Yash\"", "ReviewID": "R2ETQA1QMXWAAJ", "Overall": "5.0", "Content": "Its a great camera and specially if you are a beginner then this is the camera to start with. Awesome features and performance. Great value for money.", "Date": "July 26, 2010"}, {"Title": "Superb lightweight alternative to the D90 / D3000", "Author": "Keith Sebastian", "ReviewID": "R14MVLWSE73MV6", "Overall": "5.0", "Content": "If you are the kind of person who leaves your DSLR locked up in the hotel room because it's too heavy, get the D5000. At the end of the day, you'll have more pictures and NO they won't be worse than the D80 / D90. If they are, then you need to improve your technique :DI am not going to review the tech specs ([...] has already done it, better than I can). Just want to re-affirm what's said about the high ISO performance - Simply stunning!I will recommend the DK-21M magnifier eyepiece as a must have accessory. Makes the otherwise average pentamirror viewfnder much better. Remember to remove the hard eyecup from the DK-21M and combine it with the camera supplied DK-24 eyecup instead.I bought the 35mm f/1.8 and 18-105mm VR lenses with this camera. Absolute joy to use. And so is the SB-400.Feels great not to be lugging around \"pro\" gear and a bagful of lenses and still making wonderful pictures with this little baby.", "Date": "July 26, 2010"}, {"Title": "Worth the money !!", "Author": "Heman", "ReviewID": "R2F6EUHISE2ENO", "Overall": "5.0", "Content": "I would just say that its no less than D90. The picture quality is awesome. Just need to know the basics of photography with DSLRs.", "Date": "July 6, 2010"}, {"Title": "Nikon D5000", "Author": "Ricardo Collazo", "ReviewID": "R1DFO42741R8I0", "Overall": "5.0", "Content": "The Nikon D5000 is an excellent camera.  I like the quality of the photographs and how easy is too use.", "Date": "June 29, 2010"}, {"Title": "Great camera for an aspiring professional", "Author": "A-Tom", "ReviewID": "R12SDEOYWIXIWR", "Overall": "5.0", "Content": "I had a Nikon D40 for two years before deciding to upgrade. This may not be the best fit for a beginner (who might do well to try something simpler and cheaper first) but for the advanced amateur such as myself, it is fantastic.  There are a lot of features to help you out -- possibly more than you will need. Whatever your style and preference, I predict you will be able to customize the settings on this camera to suit and benefit you. One feature that is a big help is the self-cleaning image sensor. The 12.3 MP resolution (vs 6.1 MP on the D40), if coupled with a quality lens -- will give you amazingly detailed pictures.", "Date": "June 28, 2010"}, {"Title": "Nikon D5000", "Author": "Willard W. Krieble", "ReviewID": "RTKKH3ORWNCLE", "Overall": "5.0", "Content": "This is a fantastic camera sold by a fantastic company. Great service. Keep up the good work Amazon.", "Date": "May 31, 2010"}, {"Title": "great camera", "Author": "Andrew S. Costopoulos", "ReviewID": "R249R483SU0YOI", "Overall": "5.0", "Content": "I got this camera, and couldn't be happier with its performance 8x10's come out crystal clear, its super fast, battery lasts forever, and the flip out screen while lets not get into how awesome that feature is, I have the nikon d5000 and the canon rebel xsi, and I use the nikon over the canon 9 out of 10 times", "Date": "March 27, 2010"}, {"Title": "Switched to Nikon", "Author": "milveteran", "ReviewID": "R2LPOUP96V4V4A", "Overall": "5.0", "Content": "I have over 13 years of experience. I recently switched my CN gear to Nikon for it's compactness and availability of a 35mm F1.8. The camera is very light. Its sort of small for my huge hands but that's the price I pay for portability. I find that if I let part of my finger and pinky hang off the bottom of the camera, it's more comfortable to hold. This camera has a Quiet Mode and it's amazing, I don't think I've ever experienced anything like it in another DSLR. My model did not fall into Nikon's recall list.", "Date": "March 20, 2010"}, {"Title": "first serious SLR digital camera", "Author": "Jeffrey R. Schroeder", "ReviewID": "R20P9N7E5KXC1U", "Overall": "5.0", "Content": "I am a serious amateur photographer new to digital equipment and processing. Find the camera very easy to use, am amazed at the menu options available \"in camera\". Once one becomes familiar with the menu options available and learns how to access them quickly, the camera is a joy to use. I am currently trying a free trial of Apple's Aperture photo processing software and find it very easy to use. Expect that I will buy (think it is about $200) it when free trial is over. I am truly amazed at the features incorporated into the camera. Believe that I will soon be buying a quality photo printer to take advantage of the capabilities of the camera.", "Date": "December 28, 2009"}, {"Title": "Skip this Nikon Model, LiveView Doesn't Work", "Author": "Angel_Pen \"angel_rising\"", "ReviewID": "RJEU27PRF2P2K", "Overall": "3.0", "Content": "The ineffective \"LiveView\" mode on the D5000 may prompt Nikon to recall this model, trust me, it is that bad.I tested \"LiveView\" myself because I was expecting it to work acceptably since it is really the only feature that makes this camera different than a less expensive model like the Nikon D60. I spent one hour playing with the D5000 in LiveView and not once the camera managed to find the correct focus, it never ever focused on the subject inside the AF area. And it gets worse, the camera would tell you that it has achieved focus (the rectangle turns green) even if the image is utterly out of focus from corner to corner. The camera was tested under average light situations, such as what a journalist would encounter. I am not interested in the arguments that the camera Live View works only when it is on a tripod or in superbright sunlight (where the sun washes out the LCD screen anyway), that is just ridiculous non-sense.I have heard \"rumors\" about the LiveView failure online but I never in my wildest dreams imagined it would be such a complete failure, it is absolutely useless.The Canon Digital Rebel also offers LiveView but it also does a neat trick which allows you to lower the mirror for a fraction of a second and focus properly, it happens very fast and it works. It would have been extremely easy for Nikon to add such an important software feature, instead, they rendered the presence of a Vari-Angle LCD useless.The only reason I did not give it one star is because the D5000's chip is supposed to perform excelent under low-light conditions and you can still focus through the viewfinder, but, if LiveView is important to you, I strongly suggest you avoid the D5000 entirely and wait for a better model.More cons: low quality LCD resolution, the burst mode does not work as advertised, the menu is harder to navigate requiring sometimes double clicks, menu descriptions been cryptic, etc. It seems this may just be one of the worse Nikon DSLR ever produced.Update July 20th:Just as I predicted several months ago, this model was so poorly built that it prompted a recall. This week Nikon has sent thousands of letters to all Nikon D5000 owners announcing a mayor recall. Based on your serial number you may have to send your D5000 to be \"repaired\" for what they claim is a \"power issue\", even if your D5000 is working now send it anyway, it will probably brake soon so don't wait until that happens. (They do not mention they will fix the \"Live View\" issue). I am afraid there are SEVERAL other issues that won't get fixed so my advice is to RETURN IT and request a full refund!Note: In July 2009 Amazon was forced to temporarily suspend the sale of this model for a few days due to costumer complaints. You do the math.", "Date": "June 13, 2009"}, {"Title": "D5000", "Author": "Titipat Duangchit \"idyllic\"", "ReviewID": "R1LZ036AYBTDDP", "Overall": "4.0", "Content": "i ve just got this camera about 3 days ago , i really like it so much but one thing that i feel depress is i didnt get the waranty form in the box.how should i do? if i dont have the warranty form , Will I be able to  send my camera to the Nikon comoany if my camera have a problem?", "Date": "December 14, 2009"}, {"Title": "But wait, a second recall", "Author": "Sara Smith Joyce", "ReviewID": "R1AKQ7DCHB652L", "Overall": "2.0", "Content": "Yes The recall was a hassle and the whole time it was gone I panicked I might have been scammed, but last week the camera was back. However as I was opening some package a few days ago it found it to be empty box, but with further searching I found  a letter from Nikon. They want it back again. Shouldn't someone from Nikon be trying to contact people personally? I have not even held the camera in my hot little hands for more than a day and now I have to give it bacK Again? I bought my first Nikon in the early 70's and have upgraded when needed. I have never heard of this . Nikon should send us all new cameras, then we can send the bad one in. I like the camera and really don't want to give it up again.", "Date": "August 20, 2009"}, {"Title": "Can't give a fair assessment.", "Author": "Theodore Snell", "ReviewID": "R2I1VFX5GEWN6N", "Overall": "4.0", "Content": "I bought the body because I already had a 50 mm lens that I want to use.I wanted to see if my old Nikon lens would really work on the new digital bodies, it did but it only works in manual mode.So my assessment would not be fair to the new digital body.So far the photographs I have taken in the manual mode have been excellent.When I save up enough money to buy a new lens I will update this information.", "Date": "February 22, 2013"}, {"Title": "Did Nikon lose a bit of quality here?", "Author": "Mickster", "ReviewID": "R13F6Q6V55ZKR0", "Overall": "2.0", "Content": "I received the D500 just this Friday, May 20th. I charged the battery and proceeded to take several photos in the Auto mode to see how it would perform.I was not pleased with them. I then used several of the manual modes as well.I was disappointed on all counts. The photos were acceptable, but just barely.I also own a 4MP Kodak DX6490 that I bought in 2003, so I took comparison photos of the same subject in the same lighting with both cameras.I am disappointed with the Nikon in that the comparison photos, side by side, seem to have a LOT of difference insofar as sharpness and clarity, with the advantage going to my eight year old Kodak.For instance.With my Kodak I took many a photo of the flowers in my garden and was very pleased with the details, even the veins in the leaves, that the Kodak showed.This seems to not be so with this Nikon. The photos look OK, but just \"OK\", and are nothing to write home about. Even setting this Nikon to take \"fine\" photos made no discernible difference.The videos this Nikon takes are excellent and are clean and clear, but I want a camera that takes above average photos, not movies.I will give this Nikon another week or so to see if I am at fault, but at this point I am inclined to send it back.I wonder if Nikon paid more attention to the 36X mega zoom lens and slipped up on the quality of the photos it takes?I, for one, do not want mega zoom...I want quality photos and so far this Nikon is not providing them.It is a shame that an 8 year old, 4MP Kodak can take photos that are visibly better than those I have gotten from this new Nikon. At least so far.On the plus? I love the fast lag time between photos and the bracketing option.Another plus is the quick touch button to put the Nikon into the Video mode.But for good, high quality and visibly sharp photos? This Nikon does not meet my standards and sadly, cannot even meet some of the standards of an eight year old Kodak.", "Date": "May 23, 2011"}, {"Title": "Nikon D5000", "Author": "Kay", "ReviewID": "R14ANHHSVIC84F", "Overall": "5.0", "Content": "I got this camera back in July and chose it because of the high ratings of it's color range and good low light shots. It is my first DSLR and I'm more than happy with the image quality. The RAW files capture a great amount of color range. I used to combine a few photos to make a realistic \"hdr\" image, with this I don't even need to, it's great!The only con is the live view auto focus is REALLY slow..almost useless. I still use live view with the twist screen to compose some shots that are hard to get at odd angles, then I usually switch to normal view and shoot. It would have been great if Nikon added the feature other camera makers have where it lowers the mirror before taking the shot in live view.I did have to send the camera out for the recall, but it came back within a week and i've had no other problems.", "Date": "November 14, 2009"}, {"Title": "Still a problem with power on for Nikon D5000", "Author": "Z. A. \"Happy Camper\"", "ReviewID": "R1DJQMF7YNSOGJ", "Overall": "4.0", "Content": "I need to return the Nikon D5000 I bought from amazon.com - glad I got it from amazon.com so I can easily do that!The serial number of the D5000 body I got is not part of the D5000 recall numbers. The camera powered on the first time I tried it, three days ago.Since the first time, I have to put the end of a paper clip into the reset hole found next to the SD card slot. I found that solution online.When I found I had to do that every time to turn the camera on, I called Nikon support. They suggested to be sure my battery is charged at least overnight.I did that, with the spare battery I bought too. Same problem. Called Nikon again (I got great service from Nikon Support), and they said to return it, after I told them I got it three days ago from amazon.com.The LCD resolution on the Nikon D5000 is almost clear enough for my middle-aged eyes. Not crisp, but good. I do studio and portrait photography.", "Date": "October 18, 2009"}, {"Title": "Nikon D5000 D-SLR body", "Author": "Steven G. Oliver \"Steven-G\"", "ReviewID": "R2WYRNAX8EN7P2", "Overall": "5.0", "Content": "I bought it in Dec 2009 at Best Buy as a \"kit\" with 2 lens & camera bag (which was good quality; however, I found this bag could not hold enough when I added a separate flash: SB-600).The 12.3 MP gives good quality.  The built in flash always pops up in Auto mode; however, there is a way to turn it off (the Mode dial should be set to the \"lightning bolt\" icon with a slash through it).I have only used the AF-S 18-55 mm lens and have taken over a thousand photos at this setting: family, Christmas decorating and Christmas Eve family gift exchange, New Years party, & grandchildren.  All the photos have been good: clear detail and enlargable.  I shoot at the full 12.3 MP setting (large).  This allows for cropping with no grainy appearance.This was a much camera as I could afford, costing about $700 in the \"Kit\".  I wanted the Nikon D700, but could not afford it ($3,000 body only); however, the lenses and flash would work with the D700 when I am able to afford it.  Avoid the D300 (poor photo quality according to reviews).The D5000 uses SD cards & I use an 8 GB one.  Some grandkid motion is too fast for the auto-focus to follow; but with my previous Minolta DiImage A2 (long obsolete) could not catch that motion either.When my Minolta died, I tried some other D-SLRs: Kodak Z980, Canon PowerShot SX20 and SX120.  None compare to the D5000 (but they are less expensive).", "Date": "January 23, 2010"}, {"Title": "Great camera all around", "Author": "D. Tran \"Bruce Wonder\"", "ReviewID": "R2DPNNPRJBY3H4", "Overall": "5.0", "Content": "I had a D40 previously and this is a major upgrade image and use-wise.  It can take low light shots where the d40/d60 will have problems focusing.  Photos using the 35mm 1.8 is super sharp and crisp.  The only reason I did not get the d90 is because all my lenses are already AF-S.  So the D90 will pretty much be a waste of money for more in camera programs I will not be useing.  Although i had to buy the new Tokina 12-24mm DX II with the motor for a $100 more because there's no AF motor in the d5000 body but I am still happy with my lens collection and the money i still saved going for the d5000 over the d90...i bought the d5000 body only on amazon for $659.95", "Date": "July 15, 2009"}, {"Title": "Good entry level dslr", "Author": "R. Lam", "ReviewID": "R1QYXHTZ64BCKU", "Overall": "3.0", "Content": "this is a good entry level dslr and that's about it. There isn't much that that is unique about besides the lcd screen.", "Date": "November 2, 2011"}, {"Title": "Has been over a year", "Author": "GPG", "ReviewID": "R1JTNGRJEGQP4Y", "Overall": "4.0", "Content": "It is a solid starting camera, No complains about performance, few features missing, but it was a chance I know I was taking. I like it a lot so I will pass it on to a family member once I am done with it. Re-sale might be a pain so I am better of not even going there. I saw newer cameras with more features for about the amount of money, so why bother. I am looking forward for an upgrade.", "Date": "November 16, 2010"}, {"Title": "I don't use it.", "Author": "holly", "ReviewID": "R7QHDMNPTRQ1Z", "Overall": "1.0", "Content": "Out of all of my Nikons, this one doesn't focus. Everything is blurry. So it sits there, unused. Complete waste of money. I learned my lesson buying a used camera ~ never again.", "Date": "December 3, 2012"}, {"Title": "d5000", "Author": "Michael I. Proctor \"Biggin\"", "ReviewID": "RNP2344R0R47U", "Overall": "4.0", "Content": "Camera arrived as promised.  Photos are excellent.  I am a long time user of 35 mm slrs and this is my first jump into digital slrs.  A lot to learn but I am excited about the prospects.  We are headed to Cape Cod and Boston soon so I will get to try it out.", "Date": "July 10, 2009"}, {"Title": "Great Camera Amazon.com free shipping is the low rating", "Author": "James M. Ingraham", "ReviewID": "R3H73JZ1CDJPLU", "Overall": "3.0", "Content": "Great Camera we only had the camera a few weeks before going to Alaska, which was the reason to buy at this time.  The camera did a great job over 984 pictures.  The pictures were taken from moving buses, boats, train and dog sledge. We were able to capture Moose, Grizzly Bears, Fox, Wolf, Deli Sheep, Whales, Sea Lions, Eagles, Swans, and Caribou.  The scenery picture are outstanding the one of Mt. McKinley in the evening is just breath taking, the Tundra was getting its Fall colors when we were there and those shots are beautiful, as well as the close up shots of the flora and Fiona.  The videos when we were riding the Dog Sledge (summer trainer had wheels) are great you can hear the Musher working the dogs and answering our questions.  We could not be more pleased with the camera 5 stars all the way.The low rating is Amazon.com free shipping ploy, free shipping if you are willing to wait 3 months for delivery, but if you want it now it is extra.  Well they got their pound of flesh this time but not again, they are not the company they use to be so buyers beware.  There are a couple of other camera supply that are better and better priced once you take in amazon.coms' shipping ploy, try [...]", "Date": "September 30, 2009"}], "ProductInfo": {"Price": "$649.95", "Features": "12.3-megapixel DX-format CMOS image sensor\nBody only; lenses sold separately\nD-Movie Mode with sound; record 720p HD movie clips\nVari-angle color 2.7-inch LCD monitor; one-button Live View\nCapture images to SD/SDHC memory cards (not included)", "Name": "Nikon D5000 12.3 MP DX Digital SLR Camera with 2.7-inch Vari-angle LCD (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Boo7y-0-L._SX300_.jpg", "ProductID": "B00267S7UK"}}