{"Reviews": [{"Title": "Refers to black version- I bought at costco, not here.", "Author": "Michael Baumann \"ffr2822\"", "ReviewID": "R1IYYUUD0HEEYK", "Overall": "3.0", "Content": "Pro:Image quality: Very good. Night vision. Astounding. was able clearly see across a 20ft room in near total darkness. Verified to work with Droid - the cam automatically shifts to a smaller picture size to conserve bandwidth (from 640/480 to 320/240). Image detection works nicely. Email alerts seem to work quite well. DynamicDNS Support built in, though I did not test. Likewise UPnP support.Remote control via both web and droid is great as well, though the 2 second delay takes getting used to.Cons:Yoics. I just don't like having someone else in control of my data. Camera will work just fine without it, if you know how to do port forwarding.No autofocus. Found this one accidentally - you need to manually adjust the lens focus for the field of interest.No Zoom. With all the other toys, that would have been great\"capture\" and \"record\" do not work on Macintosh platform - though the support person I chatted with said that they are aware of it.Wireless: Full disclosure, I'm not sure if this is the router, or the cam but:  Camera claims to support WPA2/AES - During setup, it will \"test\" the connection, and declare it good. Then pull the ethernet cable and... no network. AES works with other equipment in the house.  I switched it down to WPA/TKIP and the wireless is working fine now.You had better know what you are doing, as the manual is less than helpful at times. Get your kid to help out :D", "Date": "July 15, 2010"}, {"Title": "Astak Mole Camera", "Author": "Capt Jack Sparrow", "ReviewID": "R1YH9MXQ37S959", "Overall": "4.0", "Content": "Set up was more challenging than what they lead you to believe, but I called their tech support. The first time the tech answered on the 2nd ring, I was expecting to be on hold for 10+ minutes, so I was not all ready, and told I would call back. Had to wait 5+ minutes on hold, then tech \"Paul\" answered (Paul is not a US citizen, but did OK with the support). With their help, I was able to get the camera on my wi-fi network (on my own I could connect to the camera via ethernet cable, but not wi-fi. So, camera is now working fine. I have to set up notification to my email, and iPhone access. the tech twice said they will do a LogMeIn123 type session to get the camera working on my computer, if I wanted (I did not have the time to do it then). Overall, for the price, a worthwhile camera. I had previosly purchased a more expensive wi-fi camera, could not get to work, could not get support, so I paid a tech who has set up a ton of cameras to come to my house to set up - $200 later, the cameras did not work (they were defective) and I still did not have a camera. This was a breeze compared to that", "Date": "June 29, 2011"}, {"Title": "Horror story", "Author": "Wi-Fi Wizard \"Jeff\"", "ReviewID": "RBWAOZPKK91CQ", "Overall": "1.0", "Content": "The only thing good about this experience was that the camera was delivered by the date specified. Other than that it was a horror story. I have excellent Wi-Fi skills and, after 15 hours of attempts to get it to work, I finally returned the item, in total frustration (Amazon did quickly issue a total refund).I got this camera to work with my Motorola Droid smart phone. I only decided to purchase it , after talking with tech support at Astak. They assured me, that although the ad refers to Iphone compatibility only, they had upgraded it to work with Droids as well.As advertised, it was easy enough to register the camera (at [...]) and have it \"recognized\". However, as soon as I tried to get it to work with my Droid phone, it disappeared from the website. Tech support (which never returns call messages or e-mail messages), finally picked-up the phone after about 10 attempts. He advised that my camera was the older \"silver\" (not black) version, but a simple \"firmware\" download, would resolve the problem. I did the download, and, as I stated earlier, after 15 hours of work, the camera was never again recognized, or functional, remotely (either through my phone or through my computer).Because the promises of the camera are so potentially fantastic (night vision, instant notification on my Droid, after any motion activated event, total remote control from that same phone, as well as the capacity to listen and talk, all done through a wireless network) I am not giving up yet. Just to be sure that the camera claims are not totally bogus, I ordered the black version, from a different non-Amazon supplier (on the Amazon website). You see, Amazon, currently stocks only the older \"silver\" camera, and could not advise me when the black version would be stocked.The alternate supplier went out of their way to get me the camera in time for my trip to our other house (where the camera will be installed). So with the newer version, (Black Mole), in hand, I am off to install and test it. I will give a follow-up review, after completing the test. I am hoping that the problem was either that I got a \"lemon\", or that the difficulty arrose in trying to download the new firmare to the older camera. My thinking is that the current version, with the new firmware already on it, may still work the way the manufacturer promises. I will let you know", "Date": "May 17, 2010"}, {"Title": "Easy to Use!", "Author": "S. Kucklinca \"Moxie Madness\"", "ReviewID": "RDS47WFWOSF2N", "Overall": "4.0", "Content": "The Astak camera is a nifty little gadget that enables the user to monitor office or home safety and capture creative videos that can be posted to Twitter, Facebook, MySpace etc. The movements of the camera are a little noisy (thus not a 5 star review) but sharing with friends and using the camera right out of the box are as simple as plug n play. The price may be more than other off the shelf webcams but you have more control remotely to permit a touch more creativity by \"hiding\" the camera and being part of the action!", "Date": "March 20, 2010"}, {"Title": "Mole Camera", "Author": "Tom-P", "ReviewID": "R2U7J4BPU0R6S9", "Overall": "4.0", "Content": "I've used my camera for over a year now, great quality of video.  It is a little bit of a problem getting logged in to view it remotely, but once connected to the camera I can accomplish all I want to do.  Remote Pan works great and then it goes back to home for my standard view, sends me a picture every 2 hours like I have it set to do.  I have not used the montion sensor.", "Date": "June 9, 2012"}, {"Title": "Don't buy this. No customer support!", "Author": "J. Griffiths", "ReviewID": "R20IUG9T5P37CI", "Overall": "1.0", "Content": "Product discription claims you can access it through their web site but after many tries their web site doesn't see it. Company doesn't answer phone or email.", "Date": "December 15, 2009"}], "ProductInfo": {"Price": "$199.00", "Features": "H264 video compression algorithm for low bandwidth high definition video\nEasy 3 step setup\nAutomatic fault recovery and re connection after network interruption\nSupports simultaneous browsing by up to 10 users\nBuilt in DVR which requires SD card", "Name": "Astak Pan & Tilt Wireless IP Network Camera Monitoring System with Night Vision, Motion Sensor, and Built-in-Audio", "ImgURL": "http://ecx.images-amazon.com/images/I/415YQPGM2wL._SY300_.jpg", "ProductID": "B002CGSF66"}}