{"Reviews": [{"Title": "Small camera, big performance", "Author": "David J. Elfering", "ReviewID": "RPMH21YXISTJC", "Overall": "5.0", "Content": "This past holiday week-end I made the decision not to take my Nikon DSLR with me on a 3 day road trip to Minneapolis. The majority of my time was spent wandering the Mall of America, and the E-P1 was an absolute delight the entire time.This little camera makes me smile each time I use it!If you don't care to word a long, winding review let me summarize it. The E-P1 doesn't have to make any apologies for being petite, its a full fledged camera on its own merit.Positives  * Great photo quality!  * Built in image stabilization (works pretty well too)  * Customizable and responsive interface/buttons  * HD movie mode with autofocus  * Low profile, doesn't get you noticed  * Quiet. I'd say quieter than my old rangefinders and way more quiet than my DSLR'sCould be better  * Battery life  * Perhaps almost too customizable (pretty good learning curve). Keep the manual handy!I'm not a people shooter and certainly not a \"street\" shooter but my week-end was spent at the Mall of America, which is enormous but all in doors. It was an interesting challenge. I found that although I fumbled with the interface and settings a bit, it became very engrossing and almost mesmerizing to shoot publicly with the E-P1. It never drew attention, not once, where as I saw people clearing out from the obvious DSLR guys like fish around a barracuda in the reef.Lens: My only lens is the 14-42mm f/3.5-5.6, which doesn't sound too exciting. However in practice it has been a great general utility lens that has rendered quite nicely, showing nice resolution and sharpness. I can only anticipate what the E-P1 will do with a quality, wide aperture prime. I'm up in the air about my next move, but the 50mm f/2 sure looks tempting. But then again it would be great to try OM mount too! Arg....Auto-Focus: I've read some questions about the auto-focus performance of this camera, but in normal operation haven't see an issue yet. Granted I haven't tried to shoot a basketball game or dance recital yet so take this with a grain of salt. For my people shooting in the mall the AF performance has been wonderful and spot on. When I've gone to outdoor settings or even just trying to snap something quick from my car, I've found that the autofocus is quite a ways behind my D90. I think it is real world quick, but it is probably a step slower to focus than any DSLR on the market. Not saying that's a bad thing, some worth knowing.Sensor: The sharpness I see from this camera is well beyond what I expected, so there may be something to the talk that Olympus removed the strong anti-alias filtering most DSLR's are plagued with. The jpg results thus far haven't required any post process sharpening and the Olympus color engine is a breath of fresh air in my opinion.Handling: Coming form a DSLR will make you take a little time to get used to the difference. Getting used to shooting with a LiveView display will also take some getting used to. There isn't a front/rear two wheel control system as I'm used to with the D90, but there are two primary controls for manual shooting and they can both be worked while shooting one handed. Very nice design! The buttons and functions are all fully customizable but expect to be nestled up with the manual a wee bit to do it. All in all composing from the LiveView LCD became very natural and fluid after a day. High marks to Olympus in designing such a usable system. The only thing I still have to figure out is a button to disable auto-focus so I can go fully manual.Results: The bottom line to any camera is what it can produce. The E-P1 is not a D700, A900 or 5DII. Those are different kinds of cameras that excel at higher ISO and extreme resolutions. What the E-P1 is to me is a system capable of going toe-to-toe with any DX sensor system on the market in terms of deliverable results. No it doesn't shoot 8 frames per second. Again not that kind of camera.This is a practical camera whose size and form factor make it usable in places that larger cameras wouldn't work as well or possibly not at all. I'm seeing very detailed and sharp results up to ISO 1,250.  After years of shooting 35mm, DSLR and even large format I'd have to say this is the most fun I've had with any camera I've owned. Its a camera guy's camera that the beginner can use as well.", "Date": "July 6, 2009"}, {"Title": "Great sensor, overall system needs work", "Author": "Aravind Krishnaswamy \"thedigitalbean\"", "ReviewID": "R16KKQPWV0R5AL", "Overall": "3.0", "Content": "First a little background.  I have a couple of other SLRs and was mainly looking for something to give me close to SLR quality files but in a considerably smaller physical package.  A couple of downsides you should already be aware of from the product description.:1.  There is no pop-up flash.  Not a problem for me, I don't ever use them anyway (your mileage may vary).2.  There is no viewfinder.  Again not a problem for me, got used to that very quickly.Now some observations from having used the camera:- The sensor image quality is excellent.  Dynamic range is at SLR quality.  Noise levels up to and including ISO 800 is very clean.  ISO 1600 has a bit more noise than the Rebel XSI (also 12mp)with the noise increasing relative to competitors from there.- The user interface is intuitive.  I used mostly Aperture Priority and Manual and found it easy to use.  Stuff in the menus were also easily found.  Changing the settings were at times challenging (like ISO) because of the smaller buttons, but given the camera's small size its something I could forgive- Its heavy, almost as heavy as a basic, entry level DSLR.  Now the lens is light as a feather, however I feel a lot of heaviness comes because of the build quality of the camera, which is superb- The RAW processing software that comes with the camera is useless.  The interface is horrible and the stability even worse.  Wait for your favorite RAW processing software to add support and use that.The deal breakers:- The kit lens is slow.  Really slow.  So slow in fact that I found the system to not be very useful when the light levels got low or you were indoors.  Now this could easily be fixed by having a series of fast pancake lenses, which I believe are coming, but sadly they aren't here yet.- The auto focus is slow and unreliable, especially indoors.  I found the AF to be very slow and borderline frustrating.  Again, this was mostly indoors and in low light levels, so a faster lens may alleviate the issue.Overall, this is a fantastic start for Olympus and once the system is fleshed out a bit more (with lots of those fast pancake primes at various focal lengths) I may consider it again.  However with the limited lens selection available today, its not for me.  You need to figure out if you can live with the kit lens (or the 17mm f/2.8 prime) while waiting for more lenses to come out for yourself.", "Date": "July 31, 2009"}, {"Title": "Exceptional out-of-the-box performance, great camera.", "Author": "J. Davies \"shadowportland\"", "ReviewID": "R3VJQ6D0X1NKR0", "Overall": "5.0", "Content": "I had been considering replacing my Leica d-lux 3 with the d-lux 4 when the EP-1 news came out. I immediately sold the d-lux 3 and ordered my EP-1. It is a little larger than I was hoping, but out of the box, the first results were incredible, RAW format on a par with my nikon d-90 RAW, requiring very little post-production. Feels good in the hand, responsive and fast auto-focus and much more satisfying to use than the leica - which I loved. Initial results in RAW much better than the leica, which was always just a little noisy.This is a top notch camera, that I hope will continue to deliver results. The only current drawback for me is that photoshop CS4 doesn't recognizethe Olympus Raw Format (ORF). I have to go through Olympus software to convert, which severely disrupts my work flow, and the software is slow and clunky. Shooting JPGs alongside Raw in case I need the results faster.If they get the plugin updated soon, I'll be over the moon.Very happy with this purchase.", "Date": "July 9, 2009"}, {"Title": "Not as versatile as an SLR, but mountains higher than a point and shoot", "Author": "The Will B \"The Will B\"", "ReviewID": "RFLM3JFRP4DE9", "Overall": "4.0", "Content": "I needed something decent to have in my laptop bag when i wasn't lugging around all my SLRs and Lenses.  This camera seems to be the perfect blend SLR and Point and shoot.  The f/2.8 lens allow me to take great, non-flash photos in low-light situations without an obscene amount of noise.  It has a great, solid build and with a decent amount of weight, it doesn't feel like it will fall apart at any minute like your point-and-shoot.  I would say if you are in the market for something more advanced than a point and shoot, but nice and small, pick it up.Also, I believe this is the smallest device to be able to take 720p video at f/2.8 (m4/3) with stereo audio. Great video device if you ask me.", "Date": "September 10, 2009"}, {"Title": "Reminds me of an old retro rangefinder, as intended", "Author": "C. E. Fougerousse, Jr. \"cefoug\"", "ReviewID": "R2SC4P6P0Q8T08", "Overall": "5.0", "Content": "This camera has been a very pleasant surprise for me. The low light capability is extraordinary and as for framing pictures in bright sunlight I am very glad I got the optional optical viewfinder that fits in the hotshoe. But the picture sharpness and color quality are breathtaking. There is a learning curve on the menus but once you get used to it there are many in-camera scene types to fool with, such as old-fashioned grainy black and white. Most importantly, it is ultra-portable and unobtrusive in a good-looking way. I am thrilled with it!", "Date": "September 28, 2009"}, {"Title": "If I went to heaven... this would be what I would shoot with.", "Author": "Smiley Boy", "ReviewID": "R1Y1F469JHUN3L", "Overall": "5.0", "Content": "Yes, this would be the camera I would use to take photos of heaven.I have had this camera for just over a week now and it is perfect for me - it just has the ideal balance of size, weight, features without sacrificing in DSLR standard IQ quality. If fact, it beats the IQ of my three previous DSLRs!!! (Canon Rebel XT, Olympus E-420 and E-620). I have heard from real users that the high-ISO comes close to the excellent Nikon D90).The design and build-quality is stunning. When you hold it in your hands you just cannot help but admire it from all angles - it is a beauty! The ergonomics, although having that quality dense feel, is comfortable to hold even with one hand. Combined with the *really does work* IS and you can try a new-style of spontaneous shooting with one just hand (try doing that with a DSLR!).Image quality is superb - sharp and with good colour. Olympus in-camera jpeg-engine is noted for being one of the best on the market for DSLRs. The sensor is the best from any Olympus camera to date. Although  I think much of this is down to the latest Truepic V processor.AF is similar speed to compact cameras. It is slower than the AF of the Panasonic G1/GH1 series, but much faster than the LiveView of current Olympus DSLRs. Speed will also improve with faster lenses. For me, it is nippy and is fast enough for me. If you want to take fast action shots or fast children, then you probably would be better off buying a DSLR. At least give it a try to find out if it suits your photographic style.I have not missed the E-P1 in having no flash at all. I prefer more natural looking photos without flash and this camera is very good with shooting at ISO 1600. Even ISO 3200 in rare cases. Usually I would keep to ISO 400, but would not hesitate to shoot higher now.Movie mode seems good (with HD and SD sizes), but have not explored that much yet. The audio sounds great! I have heard that Olympus has used their latest dictaphone technology in this, and you can tell. I think IS needs to be turned off though during movie mode. Also, it is great that it can take SD cards - they are so cheap.LCD is large and bright, and refresh update is fast. Even though it is not as high-resolution as other cameras, I think it functions very well. Some have mentioned of low-battery life. I have not experienced that at all. Never during a day's worth of shooting have I run out of battery. There is a dedicated button that you can assign to switch off the LCD when not in use, but the camera is on standby-by and activates again by pressing any button. With this method and switching it off when not in use, you can save valuable battery life. It is just a matter of being prudent when using it.Overall, this camera is a game-changer. By being able to carry it wherever, whenever, my photographic experience is taken to a new-level. Knowing I have a camera with DSLR IQ in my bag all the time without the bulk is a great feeling of freedom.I would place my bets that this *gem* of a camera will win many design awards and, dare I predict, be crowned `Camera of the Year'.", "Date": "July 12, 2009"}, {"Title": "A good camera, but definitely a \"niche\" camera...", "Author": "Harry M. Shin", "ReviewID": "R3UN5C77Q8FZQZ", "Overall": "4.0", "Content": "1.  For reference sake, I've used many cameras before (film and digital) and thus realize that there is no \"perfect\" camera.  For most photographers who are \"into\" photography, they will agree with my contention that you need at least two cameras; one for \"serious\" work (ie typically a DSLR, but not always) and a compact camera for snapshots (which is also an important part of one's personal photography).2.  With the above said, I have a DSLR (currently E-620), I have a fairly compact camera (Ricoh GX200), but for various reasons, I wanted a smallish camera with HD video (a fair amount exist, most of which was much more compact than the EP-1) that also has good image quality (which for me also means the ability to shoot RAW)--> which really narrowed down the choice to the EP-1 and the Panasonic G1.  I'll conclude this rambling point, by noting that it's important for folks to realize that the EP-1 is a niche camera; ie it does produce nice quality images, it has many (not all) performance features more similar to DSLRs than compact cameras, but it is NOT a compact camera... nor is it as big as a DSLR, even the smallest DSLR.  I just wanted to make this point, because even though it is smaller than any DSLR, no matter what most folks say, unless you solely use the pancake lens, you are not going to be putting this into your pocket.  Even if you did exclusively use the pancake lens, the entire unit is relatively hefty (which is a testament to the construction) and thus most folks wouldn't feel comfortable walking around with this thing in their pocket.  Thus on a personal side note, I've come to the conclusion that I'll use / need a DSLR for my \"serious\" work, EP-1 for most family shots, family travel vacations (ie excellent image quality equal to that of my E620 but without the bulk, HD video etc...) AND a true compact for those situations where I actually need to carry something in my pocket (ie Birthday dinner etc...).3.  Sorry for the long personal ramblings above; so here are my other brief impressions:a.  Build:  very solid.  As noted via others, kind of relatively heavy, but for me, that's a good thing.b.  Image Quality: I shoot RAW all the time, very good image quality.c.  HD Video: I'm not a video expert, but it's overtly better than my regular resolution videos via my other digital cameras.  Via apeture priority mode, you can set the apeture and then one can also adjust the exposure via exposure compensation.  It would be nice if there was a manual focus assist like when one shoots photos (ie having an enlarged image).  The continuous focusing mode is lame and thus one needs to focus manually or single focus lock (which is basically like shooting manually).  Supposedly the EP-2 will be able to track subjects better in video mode.  Unless one shoots subjects which come to / fro in the video and shoots long segments, the above problems should not be much of an issue.d.  Focusing: ... it's not bad.  It's not great, but I didn't expect anything super great in the first place.  When using the zoom kit lens, it is definitely fast enough for 90% of situations.  I agree with many that it is irritating that the camera has to refocus each time you press the button, but in the end it's a minor annoyance.  I haven't used the pancake lens with the EP-1 yet;  I'll get it soon.  Another very important point in regards to focusing, the EP-1 has this very cool feature that if one is in manual or S-M focus mode (I think that's what it's called), as soon as you touch the focus ring, you'll get a 7x or 10x view on the LCD--> translation, it is the quickest manual focus via LCD I've come across thus far.  It's so quick and accurate (because you're actually doing the focus) that when I use my 4/3 Olympus lens on the EP-1 (ex: 12-60mm or 9-18mm) I always use the manual focus method and it works fairly well.e.  Lack of Flash?  It's a nonissue for me because I rarely ever use an onboard flash.  When I need a flash, I use a hotshoe flash (ex: Olympus FL-36 or better yet--> Olympus FL-50R).  But I do agree that having a built in flash is important, especially the smaller the camera you have simply because the purpose of having a small camera is to avoid carrying other gear... like a flash.f.  IS:  I assume it works. It works in my E-620 and this was one of the reasons I stuck with the Olympus Line;  ie the G1 doesn't have in body IS.  To me, this feature is more important than having an onboard flash that I might use 1% of the time.  I use IS a fair amount.g. LCD:  I've used the camera in various conditions, including the worst LCD shooting situation;  sunny day at the beach.  Yea, it can be challenging in such situations but again, only in certain conditions:  trying to manually focus at telephoto.  For most shooting situations while at the beach, on a sunny day, using autofocus--> no problem.  I just turn up the LCD to max brightness.h.  Other stuff:  frame rate is decent, turn on / off time is ok, writing to card seems ok--> ie none of this issues have been noticeable or an irritating issue to me.4.  In summary, it's a no brainier that this camera is more than capable of producing great images and it has the flexibility that all serious photographers want.  I would say the primary issue that one has to clearly figure out in one's mind is for what purpose one envisions using this camera.  It is not a DSLR replacement, but in many instances it could provide similar images (at least non-full frame DSLRs) and it is NOT a replacement for a true compact camera.  It is a niche camera that is capable of some very good images.", "Date": "December 16, 2009"}, {"Title": "Nice camera, but has its drawbacks", "Author": "Wu Yongwei", "ReviewID": "R1IF2JYR6P4QYG", "Overall": "4.0", "Content": "As a owner of a Canon DSLR, I feel both love and annoyance towards this camera. I bought this camera mostly for its portability, and it is good. I do love its small size (with the 17 mm lens), and I can bring it everywhere (which I will not do with my Canon). And I love its look too.I also find the menu easy to use. The super control panel allows one to control nearly everything needed in taking a photo, and it is easy to access. There are also many interesting features not existent in my Canon.It does have its drawbacks. You would not expect the image quality as decent as an APS-C or full-frame camera, and it is apparent, esp. in low-light shots. There are more serious ones:1) Slow focusing. It is not at all comparable to a DSLR, but more like a point-and-shoot DC. The continuous AF is even worse. At least the Fujifilm and Nikon DCs I used before did not continuously refocus when the object did not move. For single AF, the lens will move even when the object is full in focus. There are reviews that the Panasonic micro four thirds are much better in this aspect.2) Slow processing speed. While there are interesting features (like the art filters), they are slow and consumes a lot of battery power. It makes them less useful.3) Bad SD video. While I like the HD video results, SD simply sucks. It is apparent the downscaling is done badly without proper anti-aliasing, and a lot of artefacts are visible. You simply should not shoot videos in SD.UPDATE: After using it for half a year, I think I like this camera. I also tried a Panasonic telephoto lens, and can confirm that the number 1 issue, slow focusing, is only related to the lens. Both Olympus and Panasonic have some nice lenses that can work fast and silently on E-P1.So I am changing my rating to four stars.", "Date": "December 19, 2010"}, {"Title": "Finally, great IQ in a small package", "Author": "operabuff \"obuff\"", "ReviewID": "R2YI60DYSQZXK", "Overall": "5.0", "Content": "I own a couple of high end DSLR's (Canon) with L glass but have always preferred to travel with small, light gear. I have Panny , 2 Richos, plus Fuji. And as much as I have liked aspects of these cameras, bottom line is I've always been disappointed with the final output as compared to the DSLR's. Bought the EP-1 on a whim just before a vacation - I had thought of waiting to see what Panasonic would bring out since I was concerned about the lack of viewfinder and the universally acknowledged slow focus. I couldn't be happier. The focus is not any slower than my other compacts. Yes, I would prefer a viewfinder. But everything else about this camera is fantastic. I was very pleasantly surprised about the the kit zoom - it's really quite good. This camera is just plain fun to use. IQ is really great - better than anything small out there. It's not tiny but for me it handles better than the pocket cameras. I am now an Oly convert! I just ordered an adaptor to use all sorts of lenses I accumulated during my film days. And they are going to be image stabilized!", "Date": "August 21, 2009"}, {"Title": "Great upgrade from Canon Super Zoom S3IS", "Author": "Jonathan Cross", "ReviewID": "R3G0HFIUE9CE8P", "Overall": "4.0", "Content": "I was looking for a camera which was as small as possible, yet capable of professional quality image capture.I travel extensively and cannot be weighted down with a huge D-SLR.  As of July 2009, this was the most compact & feature-rich camera made with such image quality!In general, it's as spectacular as everyone says, but I do have a few problems:1. The battery technology is quite disappointing.UPDATE: This battery works great and only $5! Make sure to buy 1 or 2 extra:Generic BLS-1 Replacement Battery 2. As mentioned, the auto-focus is pretty slow and fails in low-light.UPDATE: Even with 1.1 Firmware upgrade (lens and body), there is no obvious improvement.  Still I have found that I am not missing shots *too* often because of the AF.  If AF performance is a showstopper for you, consider the Panasonic GF1.3. Camera has an amazing list of settings, but I still find that the feature I want is often buried deep inside he menus (even with the *super* menu, etc).  There are a number of useless settings (disabling menu items and buttons) as well and strange limitations as to what options are available for each button.  Why?4. No Photoshop plugin for Olympus Raw (.ORF) files.UPDATE: I am doing fine with Olympus Software and Freeware tools like DC Raw.5. Lenses: As this is my first interchangeable lens camera, I was disappointed to learn about how few Micro Four-Thirds lenses there are.  Seems this will change over the next year or so (looking forward to the 20mm f/1.7 Pancake in October).  There are *many* good \"classic\" (manual focus) lenses available (if one is willing to buy the fairly pricey adapters).There are even ways to \"hack\" your own adapters, but I'm not sure I'm comfortable with that.Overall experience after 7 weeks:I hoped I would still be using this camera in like 8+ years, but it seems that this is more of a 4-6 year investment.This is still the best camera I have ever owned and a joy to use.", "Date": "July 27, 2009"}, {"Title": "Excellent SLR image quality in a compact and stylish form", "Author": "J. Wong", "ReviewID": "R1CBEP7W7ST3W2", "Overall": "4.0", "Content": "I purchased the E-P1 to complement my Canon Rebel XSI and as a \"camera body\" to try out the highly acclaimed Panasonic Lumix 20mm F1.7 lens.  I use this outstanding pancake lens with the VF-1 optical  viewfinder that came with E-P1.I opted for the E-P1 after also checking out E-PL1 & E-PL2 for the following reasons:1.  Image quality: E-Px and E-PLx all share the same sensor and after comparing the images on DPReview, I concluded that they are basically the same. I have also compared the pictures taken with E-P1 vs Canon XSI and I am impressed by the JPEG quality from E-P1.  The color and contrast are very similar to Canon.2.  Performance: Out of the box, E-P1's auto focus was sluggish and shot-to-shot time was long. I immediately updated the camera's firmware from 1.1 to the latest 1.4, and voila, problem solved...the auto focus is now as fast as the E-PL2 I tested in a camera shop.  It is adequate for most landscape and portrait or street photography but I can see the performance as an issue if you are doing a lot of sports photography.  For that, I will still need my Canon XSI.3.  Size & Handling: The E-PL2 feels a little smaller and more compact than the E-P1.  But I like the E-P1's retro styling better.  I also prefer the E-P1's controls and buttons layout.  There are dedicated buttons for Exposure Compensation, White Balance, ISO, AF Mode so you don't have to dig into the menu.  I also like the two dials, which make it easier to make adjustments and change settings.  Of the three cameras, E-PL1 is probably the worst in this department, the best being E-P1/E-P2.4.  Features:  I think E-PL2 being newer, has more features, e.g. art filters, built-in flash. I was at first concerned about lack of built-in flash.  But once I started using the 20mm F1.7 fast lens and was able to capture images in very low light conditions without cranking up the ISO beyond 400, the concerns went away.  I also found out that my Canon 430 EX speedlite works on the E-P1 hot shoe in manual mode, so I can still use it for fill flash if needed.5.  Value:  E-P1 is being phased out so they can be available at very good price...in many cases $400-450 for new camera + kit lens or Zuiko 17mm F2.8 + VF-1.  It is the same price as E-PL1 and $150 cheaper than the newly released E-PL2 selling for $550-$600.Overall, I am very pleased with the camera, as well as the micro 4/3 system.For those who are wondering about the quality of the Zuiko 17mm F2.8 pancake lens, I have to say that it is a great lens and worthy of being included with the camera.  It is more compact and lighter than the Panasonic 20mm. The color and contrast of this lens is almost indistinguishable from the Panasonic 20mm F1.7...which is very good.  In terms of sharpness, you really have to pixel peep (zoom in to 75-100%) to see the slight difference. Zuiko 17mm F1.8 is NOT soft, contrary to what I had read.  It is SHARP, just not as sharp compared to another outstanding lens.  On a scale of 1-10 for sharpness, I would rate the 20mm F1.7 a 9/10 and the Zuiko 17mm F2.8 at 8/10.  The price difference is around $150-$200 between the two.  To me the biggest reason I opted for the more expensive 20mm f1.7 is because of the extra 1.5 stops of light which is valuable to me because I do a lot of low light, evening photography, and the E-P1 doesn't have a built-in flash.  Otherwise, the Zuiko 17mm F2.8 would be a great complement with the E-Px/E-PLx series.  It also looks nicer on the camera!", "Date": "March 30, 2011"}, {"Title": "candid camera", "Author": "J. Gilbert", "ReviewID": "RIBBTLAX2UQAA", "Overall": "5.0", "Content": "I use to roam around with a Leica and 35 mm lens and have missed doing so since buying a dslr.  This little camera is an excellent way to indulge a good old habit.  I an having fun and am very pleased with the results.  The lens quality is  outstanding.  The optical finder is very good and allows me to operate a camera in the way that I was taught.", "Date": "July 18, 2010"}, {"Title": "This little gem has converted a skeptic", "Author": "Chris Cunningham", "ReviewID": "R23DH30KW8LGWT", "Overall": "5.0", "Content": "I bought this hoping it would be a barely acceptable DSLR substitute, expecting I would end up not liking it and sending it on it's way back to the retailer or to someone else by reselling it.  I've been using film and then digital slrs for 20+ years, so I'm used to an SLR. I actually LIKE SLRs, especially sturdy, hefty and fast DSLR's such as Nikon's D200.The e-p1 seemed very......different.As it turns out, vive le difference!While I was pretty skeptical, I figured I wouldn't lose too much if I took a chance on one to try it out.  I'm now glad I did since mine has really changed what I think about this type of camera (bigger sensor, no mirror).I was never entirely satisfied with the limits of the all-in-one digicams out there, although I had resigned myself to getting something like a DP2, LX3 or G11, so that I could travel lighter when I didn't really need the D200.  Basically, when I might be headed somewhere where I MIGHT want a camera, but wasn't planning a trip explicitly for the photo opps.True, there is no eye-level finder(addressed in the e-p2 and e-pl1 with the addon VF), so you have to compose using live-view.  And yes, I'm still getting used to it.  But I've found it gets more comfortable and less \"unacceptable\" the more you do it, so I'm making that adjustment.  Pretty happily in fact given all the positive qualities of the e-p1.I also thought that the AF would be unacceptably slow from the reviews I read, but I haven't found that to be the case.  Yes, it is slower than my D200.  But it turns out not to be a problem for me, even though I haven't upgraded to the latest firmware, which is supposed to provide even faster AF.  Of course I'm not trying to shoot fast moving action with it either, so if you're into that you wouldn't be happy with the AF speed, since there are plenty of DSLRs that are quite a bit faster.So what are the good qualities?Great image quality for a start.  It is really excellent for jpegs, but if you like to shoot RAW and cook the output however you like, you can do that too.  I've started shooting more jpegs, since I hate sitting around in front of a computer (since it's what I do every weekday already).  And the e-p1 really does output a great jpeg.  Of course, the good lenses that are available help as well.  As does the built-in IS.And even though the AF is slower than an SLR, the e-p1 still seems more responsive than most compact digicams I've tried.  Part of the reason that it feels responsive is just the camera's speed, but also the controls work well, which makes changing settings a breeze (for the most part.)  And you can control pretty much everything, which makes the camera configurable and flexible.Speaking of flexible, there are more options for a little camera like this than for a small digicam.  You can good telephoto zooms, normal zooms (like the kit lens), wide-angle and wide-angle to tele zooms, as well as using the four-thirds lens adapter and OM adapter.After using it for a week, I'm much happier with the e-p1 than I thought would be.I do have a couple of complaints thought, one with AF/MF and one with the body design/spec.Sometimes the camera focuses on a background object instead of the foreground object you wanted it to focus on.  When this happens with my slr, I can switch to manual-focus and be ok.  Unfortunately, using manual focus is a little more difficult than I would prefer.  It works ok if the camera is on a tripod, but when using the camera unsupported, it's difficult to hold the camera steady enough with one hand to and fine tune focus with the other.  The camera jiggles around as you're turning the focus ring with your off-hand, so it's hard to get things really sharp.I also would have really like to see the camera and lens dust and weather-proofed some.  It wouldn't need to withstand a torrential downpour (although it would be nice), but enough weather-proofing to stand up to a light rain would be good.  Ditto with dust-proofing.But I have a lot fewer complaints than I thought I would when I first got it.  In fact, until I actually took it out and used it I was planning to return it.  Lucky for me, I gave it a chance and it turned my opinion around. Now I've ordered the four-thirds adapter and a lens I've had my eye on, so I can see that I need to make more room on my gear-shelf for some more micro 4/3 gear.", "Date": "May 24, 2010"}, {"Title": "A Triple but not a Home Run", "Author": "Amazoniac", "ReviewID": "RAZM79O7AXIDV", "Overall": "4.0", "Content": "I have owned this camera for almost a month now.  There have been some disappointments but overall I have been pleased.  I also own two Olympus DSLRs so I bought the adapter that allows me to use those regular 4/3 lenses.  My main interest in the camera was the compact size and the styling.  My other Olympus cameras going back to a 1970's OM-2n have been extremely reliable so I had no hesitation in that regard. My impressions (pro and con) so far are: Pros: 1) excellent image quality even with the kit lense. 2) nice to have both standard and hi def video capability, 3) better noise reduction at high ISO settings than other Olympus cameras, 4) excellent build quality, 5) The \"cool factor\" is very high.  Cons: 1) I wish it had a built in flash for fill in use although I have used my Olympus FL-36 flash on it with no problems, 2) I wish it has some sort of viewfinder and hope a third party electronic viewfinder will become available soon, 3) it is pricey and will likely be a niche product, 4) The kit lenses are not \"fast\" which does present some low light/action issues, 5) accessories are expensive.  Overall, while there are some significant drawbacks I don't regret the purchase. For someone who doesn't want to lug a camera bag everywhere this is a great \"walk around\" camera with image quality that far surpasses point and shoot models.  If they can get the price down and make more lenses available it could be a winner for Olympus.", "Date": "August 4, 2009"}, {"Title": "Short warranty for a poorly made camera", "Author": "NolaKate", "ReviewID": "RNI1I8HJV9W8W", "Overall": "1.0", "Content": "I've been shooting with the Olympus E-P1 for 15 months now and I've been pretty happy with the results, particularly with the Panasonic 20mm lens. However, that all changed two days ago when a pale, streaked arc began appearing on my images regardless of which lens I used. I took the camera to Calumet Photographic to have the sensor cleaned, hoping that there was something I couldn't see on the sensor that was causing the problem. Unfortunately, there wasn't. I've contacted Olympus and since my camera is 3 months out of warranty, I will be charged $168 plus shipping to have the camera repaired (the cost is the same regardless of the repair).Clearly this changes my previous review. No longer does the E-P1 deserve 3 stars.We have to address the built-in obsolescence and shoddy build quality of contemporary electronics, including digital cameras. I'd hoped to have this camera for many years, just as I'd had my Contax G2 film camera for many years. Now I'm not sure what to do. Sell the lenses and the camera? Spend an additional $200 to repair the camera, assuming it can be repaired? All told, I've spent $1260 so far for this camera and the additional lens, about what I'd spent on my Contax G2, which never had to be repaired in the decade I owned it.I get that our economy is based on our consumption of disposable goods. But I don't think I'm crazy for expecting a camera that cost $800 to not be in the \"disposable goods\" category. Yet this one is.I am truly disappointed in Olympus and I will never buy one of their products again.", "Date": "October 14, 2009"}, {"Title": "It's A Love/Hate Relationship! Definitely wouldn't be great for beginners...", "Author": "Red", "ReviewID": "R16415IGL3UAEV", "Overall": "3.0", "Content": "I have been a photography enthusiast for a long time and really enjoy any opportunity I can get to hone my skills as a photographer. I currently use a Canon Rebel T1i DSLR and enjoy it very much (as with all of my previous Canons). The biggest drawback is not being able to have my camera with me at all times due to its large size. Having a large purse is enough to carry as it is.Positives:Rugged and Compact - The metal casing is a refreshing change from plastic camera bodies. It definitely makes the camera weighty, but it is also a necessary evil. The weight adds to the vintage feel of the camera as well as giving it legitimacy as a rugged, respectable, professional piece of equipment. This camera brings back memories of the old Nikon SLR's that my family owned back in the late 70's. I have no problem carrying it, lens and all, in my purse all day. In fact I forget it's even there.Pretty easy transition from DSLR to Micro 4:3 - If you already use a DSLR, chances are you will not need to read the user's manual to know how to navigate through menus, change shooting modes, set aperture/shutter, etc.Shorter lenses! - The lens that came with mine is the 14-42mm which I believe is the 35mm equivalent of 28mm-80mm. I also have a telephoto lens (also micro 4:3) that is the equivalent of 90mm-400mm and it fits in my pocket!In camera photo editing - cropping, red eye, resolution, touch ups..etc.Can attach your old lenses from other manufacturers using adaptors - Good and Bad. Must buy an adaptor and will lose ability to use the len's image stability as well as unable to control aperture. It would save me some money to be able to use my existing Canon EOS lenses. I have also heard the adaptors can get stuck to your lens and are difficult to remove.Bright screen with incredible detail - This screen actually has two adjustments, one for brightness and one for saturation. This is one of the camera's main features and it really does deliver a display that shows true to life color and detail. I have not printed any pictures yet, but supposedly what you see on the screen is what you get on paper. This screen is better than the one on my DSLR.HD Video with stereo recording - I don't do a lot of video but I found this camera performed extremely well in this area. My T1i also records HD video but it's a pain to use. I've never been able to record a moving subject without it getting out of focus on me. When I pushed down on the shutter button to re-focus the camera, the T1i would actually pick up the sound of the motor in the lens as it zoomed back and forth. While this was going on my picture would blur out for a few seconds. It was also impossible to take photos while recording. The snapping of photos actually froze the video on playback. The Olympus Pen solved all these problems. The HD video records using continous autofocus so no refocusing required. The motor runs quiet enough that it doesn't get picked up by the mic. You can take snapshots at the same time as recording videos. Olympus's solution to the frozen video problem was to split up the video into individual segments between snapshots. (Though I haven't played with this feature enough to know if it solves the problem.)Built in leveler - For those who take crooked pictures.Negatives:No battery indicator - the icon flashes briefly on start up but that's about it.No built in optical viewfinder - The camera does not have a mirror box inside (to cut down on the thickness of the camera) which makes a built in viewfinder not possible. The dust reduction system supposedly protects the camera since the mirror is absent but I haven't had this long enough to say whether that matters. If you are used to composing pictures with a viewfinder or have difficult seeing the lcd screen then you will have to purchase one separately. The optional viewfinder attaches to your hot shoe, making it impossible to attach a flash at the same time. Which brings me to my next point...No built in flash - This normally wouldn't be a big deal for me because I prefer to take pictures without a flash. However, for this camera purchasing a flash is an absolute necessity because...It takes the WORST low light pictures I have ever seen! (*no issues with low light HD video)- I've read a bunch of complaints about this issue and assumed it was just a minor problem. But if you're like me then you will undoubtedly feel as though someone just rained on your parade. It really is disappointing. The first challenge was to get the lens to focus on the subject. In a semi-dark room (just barely bright enough to be able to read a book), the camera simply couldn't focus. When it was able to do so, the picture came out dark, blurred, and grainy. I'm not saying it's impossible to take a photo in low light situations, but you have to either manually focus the picture, change your AF setting to continuous instead, or set the camera to manual mode to get it done right. The quickie modes (ie. Night Scene) were pretty much worthless. A few reviewers think it may be a limitation of the kit lens (it's slow) included in this package...if that's the case then expect to pay more money out of pocket for a better lens.It isn't great taking pictures outside even on a sunny day. I took some shots outdoors on the grass with my dogs under a tree's shadow. Using the Auto and P modes produced photos that were incredibly dark (looked like late evening instead of afternoon). I have also noticed that this camera is very prone to camera shake even during the day. I switched to Landscape mode and the photo was much brighter but now overexposed. Again this is more of an annoyance than an issue if you are knowledgable about how to tweak your settings manually to achieve what you want. This is a nightmare for the beginner or someone who wants to take a quick snapshot of a dog that won't keep still. In great contrast to my Canon T1i that is able to take bright, detailed pictures in near pitch black light without any special maneuvering.Price may be higher than current value - After it's all said and done I would say that I spent much more than I bargained for. Having to purchase a flash, viewfinder, extra lenses, filters, etc. will put me over $1500. As much as I love the portabililty of this camera, it doesn't make a lot of sense to spend that kind of money if it is a pain in the behind to get it to perform at it's highest potential.The verdict:Unfortunately the Olympus Pen E-P1 is not quite there yet and cannot replace my DSLR both in speed and quality of photos. I like to capture the moment right, the first time around and this just doesn't cut it. I wouldn't recommend this camera to anyone who is new to manual camera settings or anyone dependent on preset modes. You'll wind up with an uncooperative $1500 point and shoot camera that takes awful pictures..(If you like a challenge though, then go for it!) I will try to see if a faster lens can remedy the problem. If not it will likely be returned.", "Date": "November 5, 2010"}, {"Title": "Excellent and superb!", "Author": "P Roberts", "ReviewID": "R2QMBZL9FGCVFG", "Overall": "5.0", "Content": "This camera is just fantastic, a little beauty. Amazing, excellent, really fun. Superb optics, great feel, cute and portable. I was getting bored with my Nikon D-80, ready for a move up. Considered getting the D-90, but then the Pentax K-7 was released with HDR built-in. Wanted t get back to Olympus, and considered the E-30, and the 620, but I left my decision for so long that the PEN was released. Glad I waited. The PEN is so much fun, its great to have a new toy. The price is just right for an everyday camera, and is size is so much better compared to carefully backpacking around a big d-SLR.And the results .... the pics are superb! Just amazing. Face detection works like a charm. The video is stunning, just brilliant. The shutter is so quick, really responsive, no lag time. The art scenes are so fun to use. Funny little shutter noise. And I still haven't take it off Auto yet! Nice to have some fun exploring.", "Date": "August 21, 2009"}, {"Title": "Great Photos, Great Feel with a Few Small Misses", "Author": "C. Smith", "ReviewID": "R3HVYZ3VEXVVYL", "Overall": "4.0", "Content": "This camera has an awesome feel to it and is a pleasure to hold and take photos with. I have a Canon DSLR and the photos from the Olympus have a quality that is almost equivalent with the Canon. If you are looking for a small camera that takes great photos this is your best bet the only down side is the lack of an internal flash making night photos difficult. There is a choice of an external flash but if your looking for a camera this small chances are you dont want to screw around with another device. All in all great camera hoping to see in the next model an internal flash!", "Date": "August 16, 2009"}, {"Title": "I love this camera.", "Author": "Hadley", "ReviewID": "R1PCQVLAAASDO3", "Overall": "5.0", "Content": "I've been shooting with my trusty Pentax K-1000 or my 4x5 field camera for years.  I finally decided it was time to move into the digital era.  I cannot even begin to express how impressed I have been with this camera.  It's light weight, easy to use, has superb picture quality, and has done really well in low light so far.A few people have complained about the view finder issue.  Or, lack there of.  Honestly, being someone who has mostly been shooting with my 4x5, I've had no problem with focusing and viewing everything on the LCD screen on the back.  The screen is large, I can see it just fine in sunlight.It's my new baby.  I take it with me everywhere. I would definitely recommend it to anyone looking for a mid-range DSLR.", "Date": "April 3, 2010"}, {"Title": "A Gem of a Camera", "Author": "Robert E. Keay", "ReviewID": "RZPF59C13C1I4", "Overall": "5.0", "Content": "I have used my Pen for several weeks now , and the Body is a delight to behold ! However , Olympus failed to fully display the 14-42 Lens fully extended , and the result is a bananna type extended lens , that detracts from the Pen , and its beauty ! I have ordered the 17mm lens , and await its arrival ! I have used the 28mm pancake lens with MF attachment , and my 9-14mm , also , so I can really say the Pen is everything it is advertised ! Great flexible programs , and wonderful pictures , both in P and other modes ! I believe the Pen is in a Class of its own , and can not be really compared with similiar Types of Cameras ! I have the OVF , and it also is quite nice !", "Date": "July 14, 2009"}, {"Title": "Not perfect but very, very good", "Author": "A photographer", "ReviewID": "REPF8Q4OUHOJ0", "Overall": "4.0", "Content": "Ever since I started using digital cameras, I've wished for one to replace my Leica M6 film bodies.  The digital M-series Leicas are beyond my means and are likely to remain that way.  Small, simple and fast, Leicas became my most used cameras in the last years film was my dominant medium and I will always have a fondness for them.  Well, let me first state that the Oly E-P1 is not the perfect replacement for the Leicas.  But it is a camera that can be utilized in a comparable way.  The E-P1 is small (a little too small to suit me, actually), it is fast if set up properly for quick shooting (otherwise it is slow to get into operation and in focusing) but it is not simple by any means.  While the camera body seems to be well put together, the 17mm lens and the 14-42mm kit zoom both feel light and flimsy.  Optically, the lenses are fine.  Maybe not stellar in performance but in the digital world of photography they are as good as will be needed by 95% of photographers 95% of the time.While I do rate this camera and the 17mm lens highly, I also have to point out numerous criticisms based on my own use.  First of all are the multiple menus that initially confuse and complicate the new owner.  Fear not, this hurdle can be overcome but it takes some patience and persistence.  I recommend putting aside the owner's manual and buying copy of the Magic Lantern guide to the E-P1.  It explains the menus in a much more understandable way.  Once understood, the owner will determine how he wants the camera to function, set the functions and forget about the complicated navigation.  I could tell you how I simplified my own E-P1 but it's irrelevant to anyone else's purposes.  Next, the E-P1's ergonomics are not as user friendly as I wished.  The location of the buttons near the right thumb are my main problem.  I have large hands and I tend to push the wrong button at times while shooting.  I also would prefer the control wheel to be located atop or on front of the camera instead of positioned near the right thumb since I will inadvertently turn it without realizing it and change my settings.  The control dial on the back of the camera with associated buttons also can be infuriating when the dial is turned or the buttons pushed simply from the camera bumping and rubbing against my chest while carrying it.  While on the subject of the controls, I always carry the camera with the power on with the LCD off (if I can manage to keep it off).  The Oly batteries don't have great capacity and they run down pretty fast.  You don't get a lot of advance warning either--the battery seems to go from slightly discharged to virtually dead within a short period of time.  For that reason I recommend a spare.  Personally, I have two spares because I've picked up the camera with the battery indicator showing fully charged, gone out for a couple of hours of light shooting and returned with a nearly exhausted battery.Last nitpick concerns the lenses.  The 17mm with optical finder is a joy to use.  With AF being quite accurate, I simply ignore the LCD while shooting with it.  By setting AF to the AFL/AEL button, you can set up a zone of sharp focus and shoot quickly without having the camera refocus for each press of the shutter button.  The lens is sharp but, as previously stated, the performance is not stellar.  I have dozens of lenses collected over 40 years of shooting and very few of them could be called stellar.  I consider the 17mm to be an average good lens in a field of good lenses.  The same for the 14-42mm zoom.  It performs well for what it is.  My nitpick is the build quality of these lenses.  They are simply tinker-toy plastic with loose barrels and what appears to be very fragile construction.  I wish Olympus had put some of the build quality of the camera into these lenses.  Sure, they are light in weight and small but I would prefer a bit more heft to inspire confidence.  Another point on the lenses is the speed.  Discounting the 14-42mm as a simple kit zoom, I don't understand the philosophy Olympus has fostered in building their only (at this time) prime lens as an f/2.8 instead of an f/2 or faster.  The Panasonic 20/1.7 has a more realistic maximum aperture although the focal length is not as appealing to me as the 17mm (35mm vs 40mm in 35mm format equivalence).Okay.  I've given Olympus a hard time so far.  You might ask why I rate this camera so highly given the list of criticisms.  First of all is the innovation.  Micro 4/3 as a concept is appealing.  It allows a lot of latitude and versatility in lens selection.  Adapters abound to fit most anything to the cameras with varying degrees of function.  Great idea.  Also, the concept of building a camera that looks back to photographic tradition.  This looks like a camera.  I really like that.  Next, it really does produce excellent images.  The pictures are better in quality than the standard pocket camera but not quite as good as the better APS-C format DSLRs.  It's a good compromise in a camera body that is designed to be in-between.Overall, this is a great first step.  The E-P2 has been introduced now with its accessory EVF and it will replace the E-P1.  Something else will come along later.  Hopefully Olympus will continue the evolution of the Pen design with an optical viewfinder built into the body.  Already we are seeing other cameras being announced that sprang from the retro Olympus design--cameras such as the recently announced Fuji X100 that is in the larger and potentially better quality APS-C format.  I enjoy using the E-P1 despite my criticisms.  I like it a lot and recommend it highly to anyone interested.", "Date": "September 21, 2010"}, {"Title": "Bringing Fun Back to Photography", "Author": "Bigfoot", "ReviewID": "R1RCSOKM3VMH1W", "Overall": "5.0", "Content": "The Olympus E-P1 is a camera you just want to pick up and begin using. Styled after the PEN cameras of yesteryear, Olympus did a great job making the E-P1/E-P2 look \"retro\", while still retaining plenty of functionality in the digital age. There are some subtle differences between the two different models from what I have read; the E-P1 is a little more basic, while the E-P2 has support for an accessory port under the hot shoe (electronic viewfinder, external mics, etc.). As far as picture quality goes, both units are purported to be identical. Now that some time has passed since the introduction of the E-P1, there are additional newer models in the PEN lineup to consider. In fact, as of the date of this updated review (2/2011), Olympus considers the E-P1 camera a \"discontinued product.\"But don't worry, the E-P1 is still more than capable of holding its own, discontinued or not. The color rendition of JPG files straight from the camera is amazing. (As an amateur photographer, I don't bother with RAW files, so I can't comment on that aspect.) The primary reason that I went with this model was to have a great travel camera that did not sacrifice quality for size. In fact, I have sold off my Nikon dSLR setup in favor of the E-P1. The included 17mm kit lens replicates a ~35mm field of view (2.0x crop factor). The included VF-1 viewfinder has markings to correspond to the 17mm lens, and is just a piece of glass inside some plastic that slips onto the hot shoe. There is nothing displayed in the VF-1, so if you want something fancier you would do better getting an E-P2 or newer model that supports the VF-2 electronic viewfinder.One downside: If you want a flash unit you have some decisions to make, as there is no built-in flash. The Olympus FL-14 is styled to match the E-P1 and E-P2 cameras, but flash output is somewhat pathetic, with no bounce function. The next step up would be an Olympus FL-36R or third-party Nissin di466 flash, both of which are far larger (practically the same size as the camera itself) and have more output & bounce capability.Overall, the E-P1 has a few quirks (sometimes frustrating menu system, no built in flash) but these alone shouldn't stop you from getting this excellent camera.", "Date": "September 10, 2010"}, {"Title": "I love it", "Author": "J. Montgomery", "ReviewID": "R3W51MX6MUHD3W", "Overall": "5.0", "Content": "For this camera, either you \"get it\" or you don't. For me, I love it.  For several years my camera of choice was Hasselblad.  I do fine arts portraiture, often in monochrome.  With my Hasselblad, I loved the quality of the image, the square format, the projected image on a screen for composition, the quality of the camera itself and the versatility of the system.  Now that I have gone digital, the Olympus Pen is my main shooter - for less than the cost of a Hasselblad lens.  Image quality is top rate.  In fact, it is often too sharp and I soften (selectively) in photoshop.  I set it to shoot in square format (one of several options) and i enjoy the projected image for careful composition and understanding of the subtlety of the light falling on my subject.  This camera works great for me because my subjects are sitting still.  If you are trying to get a grab shot of those geese flying overhead, forget it.  This is not a camera for sports or nature photographers.  But for portraiture and landscape it is great.  The camera body quality is top rate.  I shot with Canon prosumer slr's for several years and never warmed up to the plastic, light weight feel.  By contrast, while Olympus Pen is not heavy, it is \"dense\".  Solid.  And with the adapter, I am able to use my old lenses from my 20 year old Olympus OM4 (another great camera).  I love that versatility.  Negative comments?  I do very little video, but for interviews I would like to have had an external jack for a microphone (added on the newer model).  The menu choices are excessive and confusing, and the documentation -- of course -- is poor.  Its all there, but if you are trying to go for a simple experience you have to figure it out.  Other than that, the camera is a tremendous success.  Just be sure you know what you are about with your photography so you will know whether this is a good fit for you.", "Date": "February 11, 2010"}, {"Title": "I love you  , I love you, I love you! (I guess you know the melody)", "Author": "Alex Vox", "ReviewID": "R25AJ5PTNVMBS6", "Overall": "5.0", "Content": "I will mention any of its tech specs, and my \"review\" if it may be called that name is purely emotional. It is small, it is fancy, it is so nice you will be willing to give it a kiss. It has nice rigid and solid feel. It has everything I need need and nothing I don't. It feel like a treat, like a candy.The satisfaction of using it, I mean the personal feelings are the same that made me a photographer some 35 years ago. The image quality is just above any concerns.I have been using cameras form Canon, Pentax, Minolta, Sony, Nikon, Sigma (and so on), and while there are some great babies around (like ALPHA 900 + Zeiss optics), there's nothing else with that tremendous feel and touch that you can put into your jacket pocket. Man, I'm in love!", "Date": "July 10, 2009"}, {"Title": "not bad at all, after firmware upgrades and new lenses. 3.5 stars.", "Author": "Jimbo", "ReviewID": "R3H2YBQE0M4ZL8", "Overall": "3.0", "Content": "This camera is now 2+ years old, but let me tell you why it's worth picking up on the cheap. These are going for very little on the second hand market and totally worth it if you are looking to replace your p&s; it's actually cheaper than the higher end p&s.; With an update to firmware 1.4, the main issue with the slow autofocus performance is not really much of an issue at all. I picked up the body and added the latest 14-42mm II R lens and it focuses quickly and quietly. Not as quick as my Nikon DSLR, but not far behind. It's true the LCD screen is low resolution and not very good but it's adequate for confirming a shot. The build of the camera is amazing; but the new kit lens build quality is cheap. The default color images that come out of the Olympus JPEG engine beat my 2 Nikon DSLRs. It's true what people say about the Olympus colors, they just are wonderful. You'd have to do a lot of color adjustments and processing in my Nikon RAWs to get near it. The only real disadvantage of this sensor is if you get beyond ISO 800 you can see the noise disturb the quality of the images. This is not the case with newer Nikon DSLRs.If you want a zoom, I suggest you add the Panasonic 14-45mm zoom lens. I prefer to shoot with the prime lenses -- Oly 45mm f1.8, Panasonic 14mm f2.5, Panasonic 25mm f1.4. You can get some amazing DSLR quality pictures from these lenses.  I just don't like the Olympus 14-42mm lens. I don't find the optical quality great and the locking button makes it slower and more clumsy to start shooting.  Now onto the menu system.  I think Olympus may have went overboard with the customization in the menu system. This camera is highly customizable but it takes a lot of reading and playing around to figure this camera out. It's not easy to get going if you are want to understand all the advanced features. Even techies will be finding they need to read the manual and look on the internet to figure out a lot of things.Overall, this is quite a bargain camera if you go the second hand route. Add a few good prime lenses and you've got something that's nearly as good as a modern DSLR for much less.  This camera isn't really that different from the newer E-P3. They both use almost exactly the same sensor; there is only a minor improvement. The only thing I long for in the E-P1 is flash; it stings a bit without the ability to use a pop-up fill flash integrated into the camera. Buying an external flash is expensive and adds significantly to the bulk; defeating the purpose of carrying it in a large pocket. I think it's one of the main reasons why the E-P1 is undesirable and unloved; this the low prices.  There isn't a doubt in my mind the newer 16mp will make it into the E-P4 next year and that's the one everyone should upgrade to, not the E-P3. So, just pick this one up in the mean time on the cheap and wait it out.", "Date": "September 30, 2011"}, {"Title": "Wonderful Camera", "Author": "R. Gus", "ReviewID": "R1PSE3ESJJX9KX", "Overall": "4.0", "Content": "I've been a film photographer for over 40 years and have had some difficulty making the transition from my Nikon F to anything digital, until the E-P1 came along.  The E-P1 produces film-like skin tones and colors.  Results require little or no post-camera tweaking.  Low light, hand-held shots are accomplished easily in most situations.  Unlike my old Nikon F (and digital SLRs, for that matter) the E-P1 will fit in a jacket pocket.  Adapters are readily available for 35mm film lenses such as Nikon, Canon, etc. Great Bokeh when hooked up with an old 50mm Nikkor or Canon FD!The menu has somewhat of learning curve to it, but even someone like me can deal with it.  The viewing screen could stand a little more resolution for low light shooting, but is not a terribly big issue.If you are looking for a point-and-shoot camera, the E-P1 is perhaps not for you.", "Date": "February 4, 2011"}, {"Title": "dSLR picture quality in carry \"everywhere\" size", "Author": "E. A. Gonzalez \"creative professional\"", "ReviewID": "R1ADYNHG05E04T", "Overall": "4.0", "Content": "Just what I've been waiting for. The ability to take full control of aperture, iso, shutter speed, etc...and produce high quality images without the bulk of traditional dSLR's.I was so tired of the the limitations of point-and-shoot cameras; small sensor = grainy photos and terrible in low light. I needed more than just being able to put it in my pocket or mega mega pixels (higher count doesn't mean better quality - just a marketing ploy to make it sound better. Bigger sensor = more info per pixel). I wanted, but didn't want a dSLR because i knew i would not use it as often due to its size, unless of course i was on a shooting mission.The e-p1 is not \"pocketable\", but small enough that i can throw it over my shoulder and take it everywhere (i do). It also doesn't scream \"look at me, I'm taking photos\" like the dSLR would make me feel. As a result it makes for great candid photos of family and friends as well as a good street photo system.A lot has been written about poor Auto Focus speed. It's not as fast as dSLRs, but from experience, it's night and day from point-and-shoots. I really don't see it as an issue. I have no problem capturing great moments of my active 1yr old son.Why i decided on the e-p1?1. Excellent build. It is solid!! I held the e-pL1 and it just felt bulkier than expected and had a plastic cheap feel to it.2. Price. It's hard to pass-up on an instant classic at current prices ($499 at Costco online with 14-42mm kit lens).3. Features. It has all the features i wanted from a dSLR;large sensor, interchangeable lenses, and ability to take full control and therefor get more creative.4. In-body image stabilization. I didn't want to limit myself to lenses with built-in IS (plus these lenses are more expensive).5. Better out of camera .jpgs compared to G-F1. This will cut down on RAW image post production. The e-pL1 also produces excellent OOC .jpgs, but if you compare to the e-p1 it lacks some features that make the e-p1 a more serious system.Don't worry about no built-in flash. Those will ruin a photo 99% of the time. The only time i would use it is to soften harsh shadows under a bright noon sun (Time of day i try to avoid anyway). No EVF (electronic view finder), no problem for me. I'm so used to using the LCD that I really don't see it as a limitation.Seriously consider the panasonic lumix 20mm f/1.7 lens. It makes for an excellent low-light combo. I keep this on my camera 95% of the time.", "Date": "June 14, 2010"}, {"Title": "Love it!", "Author": "carolina2834", "ReviewID": "R3LBY4ZFUDTDXC", "Overall": "5.0", "Content": "Long story. My first SLR was an Olympus E-510. After using it a while I started going down this slippery slope of using and acquiring OM glass. I had no problem with the 2x conversion, but the small OM lenses were just screaming to be used on a smaller body. I then purchased an OM2 just for experimenting around and started doing the unthinkable; shooting film. (I've never shot film before.) The small size made it so much fun to carry around; more-so than the E-510. Being glued to the OM2 made me crave an even smaller digital SLR or even a digital range-finder. So I began looking at the options.Epson RD-1? No slouch, but a bit rare and on the pricey side. Leica M8? Maybe if I sold a kidney. M9? Yeah right. Maybe if I sold half my organs. E-420? Loved the way it felt, but it didn't have the E-510's IS to compensate for the smaller/slower Olympus primes; specifically the 25mm pancake. E-620? This one seems okay; smaller form-factor, IS, better ISO performance, and an awesome swiveling LCD. As much as I loved the E-510, I sold it for an E-620. Besides for the funny red-ish indoor WB, I loved nearly everything about the E-620. But there was one little problem. Despite it's smaller size, the OM2 was still making it kind of jealous. The OM cameras were just thinner, sexier, and craved my attention a bit more. As much as I tried to avoid m43s, I knew I had to at least give it a chance. So I tried it at a store, loved it, and reluctantly sold the E-620 and most of my 43 glass to fund the E-P1 and the 20mm Panny prime.All I have to say now is \"wow!\"  What a relief to finally have something to carry around and make digital photography fun. You know how they say the best camera is the one that you always have on-hand? Well for me, the E-P1 is it. I try to avoid the technical stuff as much as possible, but ISO is good, image-quality is stellar, and the size is perfect. Carrying a digital camera around is no longer a personal debate, but now it's a deliberately unconscious act. I'm used to Olympus menus, so it took me about 10 minutes to learn the ins-and-outs of the camera. As for the focusing complaints that I hear about, it's really not that bad. It's actually quite good, in my opinion. I'm not a bird, sports, or action shooter so the focusing problems that others seem to pick up are nearly unnoticeable to me. (I use the center point and recompose, or select a different focus-point when needed.) I guess if anything sucked really bad, it would be the Olympus Master software. I've hated it since the E-510 days. But then I would be rating software--not the camera.The E-P1 isn't perfect, but for me it is. The camera might not be a winner for some, but I can honestly see myself using the E-P1/20mm combo until it malfunctions. (I mainly shoot primes and rarely go beyond 50mm in full-frame.) If you're a DSLR user and simply want a small and nice camera to carry around and have fun, the E-P1 is a great choice. And as your one and only camera? It depends on what you do, but it's working out splendidly on my end. I highly recommend the E-P1.[One more thing, even after playing a camera version of musical-chairs, I still have the OM2 and a set of primes. :o) Although they're not Leica-legendary, I truly believe the OM cameras are timeless classics.]", "Date": "November 19, 2009"}, {"Title": "An excellent camera.", "Author": "G. Bard \"indie writer, reader\"", "ReviewID": "R1NH8JDEX7O0I7", "Overall": "5.0", "Content": "This is a great camera, it does what it says it will do, looks great and works right out of the box. Once you work your way through the menus and shoot wisely you can eliminate the need for post processing. The \"ART\" filters are all great.It looks like a camera, feels like a camera, sounds like a camera (lovely shutter sound)is a camera.Recommended.", "Date": "April 7, 2010"}, {"Title": "This camera is something DIFFERENT and SPECIAL", "Author": "Radio Man \"yarns13\"", "ReviewID": "R357JZC79KPC7W", "Overall": "5.0", "Content": "I was one of the first ones to pre-order the E-P1 maybe one of the few who was able to get it in white. I was not going to write a review because I saw so many other well written reviews I thought I could not add much. What has prompted me to write a review here is that the Panasonic GF1 seems to be getting all raves from owners while the E-P1 seems to be getting bashed too much. I have no stake or purpose to Olympus, matter of fact this is the first Oly I have owned in over 6 years. I HAVE owned the Panasonic LX3, the TZ5 and an older super zoom Pany. The LX3 drove me nuts with the distortion from it's so called amazing lens, The HORRIBLE inaccurate colors from it's lcd, matter of fact every Panasonic I have owned(3) have suffered from very noisy pictures..ugly yellow zig/zag smearing you can see at usually at 400 ISO or higher. I have never gotten natural looking skin tones from any Pany I ever owned..even in raw.. So why am I writing about the E-P1? yet so far saying nothing..just seem to be bashing Panasonic?  BECAUSE though I don't own the GF1 I have read on many different discussion boards that though the GF1 has twice the resolution of the E-P1'S lcd it does not look any better than the E-P1'S lcd..in I have read that E-P1's LCD is easier to view outdoors. I have read the GF1 has some trouble with jpegs on a few colors..I saw samples of the GF1 vs E-P1 on Imaging resource..you will again see Panasonic still has that yellow smearing at slightly high ISO. It has been written the GF1 is really mostly useable to about 800 ISO. I have taken several pics with the E-P1 at 1200 even 1600 ISO and they look VERY clean if there is just a bit of light. The GF1 is $100 more than the E-P1 why?? You are paying $100 more for a tiny flash and NO in body image stabilization, a huge plus for the E-P1 I actually like that you can get the E-P1'S external flash for the same same $100 and it's WAY better than the tiny flip up flash on the GF1.If you want to choose the 14-45mm lens The E-P1's retractable design is ingenious, I guess it will be about 1/3rd to 1/2 has large as the GF1'S lens once you retract the e-p1's lens. This is a HUGE difference, as many are buying these micro \"4/3 cameras for the smaller size.\" With a huge lens sticking out..you might as well carry a Nikon D40 as it's not night and day heavier or twice as large as either the Olympus or Panasonic.As to auto focus speed The E-P1 is plenty FAST. I own the Nikon D90, in live mode the D90 has to be 10 times SLOWER than the E-P1'S focusing speed... The E-P1's colors look \"AMAZING\" super accurate, scary accurate. I have never seen accurate colors coming from any Panasonic I have owned.It's true the E-P1'S menu can be a little confusing, or more that there seems to be many sub menus you may not even know about till you really GET INTO using this camera. I suppose for a point and shoot shooter the GF1 may indeed be better...Pany does have a great intelligent auto mode..But if you want to be creative..the E-P1 gives you so so many options to tweak just about everything.To sum up I am not saying the E-P1 is perfect or really BETTER than a GF1..But it's darn GREAT...has a \"special thing about it\", that makes you WANT to use/play with it. I do hope one day soon they can fit a micro 4/3 sensor etc..into a true point and shoot body. Till then especially with the 14-45mm lens the E-P1 will be much smaller than the GF1. To GF1 readers who are going to bash me for writing about a camera I don't own..I agree with you!,?? I can only base my facts and or opinions on previous Panasonic cameras I have owned, that have disappointed me plus all the research I have done on the GF1 on serious discussion boards from GF1 users, and reading thru some pro reviews. Actually I wrote this more to say what a wonderful SPECIAL \"DIFFERENT\" camera the E-P1 is vs just about any other camera out there.", "Date": "October 11, 2009"}, {"Title": "Excellent!", "Author": "Shojo", "ReviewID": "REEQUELD696A", "Overall": "5.0", "Content": "After reading a lot of reviews I finally settled on the EP1 eventhough the EP2 was available at the time of purchase. I wanted that vintage feel and I don't mind that the camera isn't lightning fast. I'm a very amateur photographer and I like to take my time. If you want a fast camera this might not be the one for you; it re-focuses every time even if you haven't changed your subject. Not sure how many lenses I'll be getting b/c I love the 17mm lens I chose, but it's always nice to have the choice.", "Date": "April 12, 2011"}, {"Title": "An honest review from a average guy just looking for excellent photos", "Author": "Charles in Montreal", "ReviewID": "RYNFCRGP7F44B", "Overall": "4.0", "Content": "It always amazes me the depth of reviews that are available at websites (dpreview, imaging-resource, to name a few but the list goes on) plus the super-detailed online reviews from pros and fanatics.  These are great reviews, but with a many technical details or features that are not always relevant to me.  I am just an average guy who still wants to have amazing photos of my friends, my family, my travels, the scenery around my country house and a bit for my business.  So here is my take:WHY DID I PURCHASE THE PEN E-1?The main reason was I wanted much better quality than my collection of decent point-and-shoots and much more portable than my DSLR which as a few years old anyhow. Had been admiring the Pen since it came out but found it a little expensive.  Loved the design and the reviews regarding picture quality were almost all outstanding.  With the the discontinuation of the EP1 replaced by the EP2, the price came down a lot (about $450 is what I paid, half the launch price).  From all accounts the most important aspects (sensor, pic quality) are the same as EP2 but price is lower. The additional features of the EP2 were not that interesting to me and I like the classic silver design of the original better anyhowWHAT I LOVE?The picture quality (#1 criterion for me) is outstanding.  Great colours, unbelieveable detail.  The build quality and feel are just stunning.  Really a classic look.  I have the viewfinder and the pancake lens kit as my basic set up.  Great family, walking around, street camera.  I also enjoy some of the art settings to create some nice effects.  Bought an adapter for my old Canon lenses so now I have a total set up for superior results.  The size, ergonmics, feel, controls are all superb also.WHAT I DON'T LIKE AS MUCH?Slow and difficult focus in dark settings - this has been mentioned in many reviews.  Makes interior shots a problem.  This is mostly auto mode, but with manual focus and settings it works better.  The lack of flash is also missed.  Would have also liked 1080P video vs. the 720.THE BOTTOM LINEDespite some limitations, it just takes the most fabulous shots I have ever had and this means that I am very happy with the purchase.  Also by having around my neck when walking around I am taking a lot more shots and hence multiplying the real winner results.  The feel and design are just fabulous and I just love picking it up.  Plus it is a beauty - long after all my old cameras are given away or thrown away, this one will also be on my shelf as a classic - I think I will get many years of pleasure and results out of it plus even if I stop using it I will never throw this baby away.  It just looks beautiful and is a first edition of a new classic.", "Date": "April 7, 2011"}, {"Title": "Fantastic Camera", "Author": "John N. Marzich", "ReviewID": "R28563YTD0K71Y", "Overall": "5.0", "Content": "Was tired of my big canon 40d and big lenses. Great pictures but too large hour after hour. This camera took an indoor shot with no flash at over 1000 iso and looked excillent!Very portable and the depth of field looks more 3d than just a flat sharp picture. I have owned an e-300 and e-510 and new olympus had a major idea with the high end Zuiko lenses.Have 2 panasonic lenses and they are excillent also and made in japan.World class camera minus a built in flash.", "Date": "March 11, 2010"}, {"Title": "Olympus EP-1: The Best Compact DSLR", "Author": "J. Cauchi", "ReviewID": "R3S6P6AIS6FDSV", "Overall": "5.0", "Content": "I've had a 35 mm, film, Olympus camera for more than a decade which always took great pictures and still works great . After the Olympus, when digital cameras came put, I used mostly phones for digital picture taking-2 (Sony) to 5 megapixels (Nokia). So, when I decided to upgrade and found that Olympus was releasing a compact DSLR, I decided to get it to see if the quality was still there. I was amazed by the quality and good design of the camera. But, of course, I was also looking for the DSLR quality of the pictures and was not disappointed. I took a lot of pictures of moving people and still life-plants and trees, etc, and all and all the picture quality was excellent-don't forget to focus-video was also great when there is light around but it uses a lot of memory.I think, it's better to get the 17 mm lens to have a smaller body overall and much easier to carry around-and the FL-14 flash is a plus-very light..All and all the EP1 is an excellent upgrade from a standard point and shoot camera since it's much more compact than the standard DSLRs-Nikon, Canon, etc.-and it takes pictures/videos with about the same quality as a standard DSLR.Olympus EP1 Pros and Cons:Pros:1. Excellent modern, fancy, high quality design.2. Menus are easy to use3. Very nice high quality pictures and videos.Cons;1. Low resolution screen2. No integrated flash or light (Videos)3. Video mode uses a lot of memory.", "Date": "December 14, 2009"}, {"Title": "This camera body is a hidden gem", "Author": "fair review", "ReviewID": "RN5IRNB32KB91", "Overall": "5.0", "Content": "The Pen E-P1 may be older, but it is far from long-in-the-tooth. In fact, it is packed with features that a user can utilize and customize in ways that are surprisingly useful. For SLR and DSLR shooters wishing to sample the micro four thirds format, a cost effective way to do this may be to purchase a Pen E-P1 body from Amazon, and an adapter for the branded glass they already own. Granted, one would have to shoot in Aperture mode and focus manually (remember manual focus?), and the monitor may be less than stellar compared to more recent offerings, but this camera's focus assist feature eases the inconvenience. I mounting my older non-VR Nikon primes on this camera and the images are well worth the effort, particular since IS is in-body, which is seldom if ever the case for SLR and DSLR bodies. Shooting with older branded-primes in an IS body with outstanding sensor resolution and what appears to be an exceptional jpeg-engine for a little over $200? This will work....", "Date": "April 19, 2012"}, {"Title": "Very handy and better than average", "Author": "Jon \"Jon\"", "ReviewID": "R1P2UD4IU9S2LF", "Overall": "5.0", "Content": "I bought this camera for its portability.  The built-in stabilization is fantastic.  I can shoot blur-free at 1/8 (I have a stable hand).  Metering is average with highlight clipping almost all the time.  Auto white balance is reliable (I find myself tinkering less on the color cast in PS Lightroom).Noise is very four-thirds.  Wish Olympus would do improve on the noise and finally quench the eternal question of four-thirds noise.Movie mode is very good, albeit with some noise too.Although minimum ISO is 100, the Auto ISO's lowest range is only at 200.Selection of lenses is poor, or should I say negligible?Build quality is superb.4/3 to Micro 4/3 is expensive if you want to use main line Zuiko digital lenses.", "Date": "February 15, 2011"}, {"Title": "Favorite Camera", "Author": "A Painter", "ReviewID": "R2W89PECDGPKVZ", "Overall": "5.0", "Content": "I absolutely love this camera!  The portability and ease of use really makes this camera fun and inspiring.  The jpg quality is a real plus.  Often the photos look so good right out of the camera that I don't need to spend time editing in Photoshop or Lighroom.  I have a Nikon DSLR's and canon and Panasonic point and shoots, but the EP-1 is really the perfect fit for what I do, which is a lot of street/travel photography.  Great camera to just through in a messenger bag and go.  I would highly recommend the Panasonic 20mm to go along with it, amazing for low light.  The kit lens is pretty good too though.  The lack of a viewfinder doesn't bother me because I've spent so many years now shooting with just an lcd, but for those used to a viewfinder you might want the E-P2.  With the price so low right now this is a great value.", "Date": "May 20, 2010"}, {"Title": "Tons of horsepower in a small package", "Author": "JAGFB", "ReviewID": "R2RFFY48J9MDMX", "Overall": "5.0", "Content": "Overall we are very pleased with the E-P1.  The micro four thirds form factor is great in that we are not lugging a full sized DLSR around.We have only had this camera for a couple of week and are learning the ropes.Will provide more information in this review as we get more time with it.The camera is extremely solid and I am sure that it is going to be with us for a long time.", "Date": "February 12, 2010"}, {"Title": "Impressed", "Author": "Jack Gradda", "ReviewID": "R27H8YFSU7U5RW", "Overall": "5.0", "Content": "Okay, I am really surprised that no-one has really reviewed this camera yet, so here goes nothing:The camera looks really retro and really cool. This may depend on your preferences (hipster much?), but I've received several compliments about it. The next thing you immediately notice when you take the camera out its box is its weight. This is by far one of the most lightweight, compact SLR cameras on the market...and make no mistake, this is a SLR camera.The Micro-four thirds sensor is great and pictures come incredibly detailed and crisp in the right conditions. Most lenses that you'll buy for this are auto focused and the shutter release will probably be much quicker that what you're used to.If you going to be taking night shots, you will probably need a flash system that mounts on top of the camera. That will run you about $200, still less than the SLR flashes offered by Nikon/Sony/Canon...There is no built in flash and there is no viewfinder, so if you are used to a bulkier SLR, it may take some time to get used to.If you are looking for an expensive and quality point and shoot, this is probably not for you. If you are just getting into more professional photography and would like to experiment with different lenses and optics, this is a great entry-level SLR camera that is stylish and less bulky than its market competitors while still keeping most of the functionality.All in all, the Olympus E-P1 is a brilliant little device that looks even better. It is sturdy (not sure what it's made off, but it sure isn't your typical plastic), compact and fun.", "Date": "April 13, 2012"}, {"Title": "Battery door broke two months in.", "Author": "G. W. Rickman \"Bill\"", "ReviewID": "R8DEVQTVQOISQ", "Overall": "3.0", "Content": "I traded a nikon slr system for this more compact Micro Four Thirds system. I love the \"any lens works with an adaptor\" nature of the camera. The files that I create with it are of good quality as well. I wish I could say the same for the build quality and customer support. I charged the battery one afternoon and when i put the battery back in and closed the door it would not latch. The catch on the body had simply broken off. The slrs from olympus have locking battery doors of good design and quality but the doors on all of the \"pen\" cameras are bad designs. I called Olympus and I was asked to send in my camera for two weeks to see if it was covered under their limited warranty. When I asked about a loaner I was told they did not provide them, \"have a nice day\" and was then hung up on. I just put my tripod's quick release plate on to keep the door shut now. I kept my nikon lenses and will send this camera in for repair when I have purchased another nikon body so I can sell this camera and get some money for the GF1.", "Date": "April 13, 2010"}, {"Title": "Olympus PEN EP-1. This camera body has breathed new life into my old 35mm film camera lenses", "Author": "PuzzleExpert", "ReviewID": "R2UL61J9VIRIGR", "Overall": "5.0", "Content": "This camera body is exactly as described and everything I hoped it would be at the best possible price.  Using Konica AR to MFT lens adapters I have attached some of the best glass ever made from my 1970s 35mm film cameras.  I have even attached my Celestron C90 spotting scope to it with a Micro 4/3 to t mount!  Takes excellent photos!!!!", "Date": "November 25, 2013"}, {"Title": "fantastic camera, fantastic little lens", "Author": "G_to-the_D", "ReviewID": "R3U1TA8946ODG2", "Overall": "5.0", "Content": "The images you can create with this camera will rival any DSLR, all while being more discrete and portable.  With the very thin pancake lens, this camera is quasi-pocketable.  I say \"quasi-\" pocketable because it is significantly heavier and bigger than most point-and-shoots, but it can fit in a cargo pocket, for example.They say the best camera for any given situation is the one you've got.  The E-P1 embraces that philosophy by giving you a DSLR-sized sensor in a small package.  I now use this camera exclusively for my travel photography.  The low-light performance of lens and body are pretty good, and the color rendition of Olympus (giving pictures that famous \"Olympus color\") are dynamite.  JPEGs straight from the camera are gallery-worthy (depending on the photographer's skill, of course).  The dial and input layouts are intuitive and quick.  I shoot full \"M\" mode (manual) all the time and have no problem quickly adjusting for any parameter (shutter speed, aperture, white balance, drive mode, image stabilizer, noise reduction, etc.).The build-quality is top-notch.  It has metal construction, metal mounts, and feels solid in the hands.  The grips are high-quality and give just enough hold to make you comfortable and confident while shooting.The major flaw that reviewers complained about in 2009 (slow autofocus and few lens choices) have since been addressed with new lens selections and updated firmware.  The newer E-P2 and E-P3 have significant upgrades such as the ability to attach a rave-worthy electronic viewfinder and external microphone, as well as improved movie-shooting performance.  But if you can find the E-P1 for a better price, I say, \"Go ahead and buy it\" without hesitation.There is definitely better glass available for the micro 4/3 format now, but nothing this small and thin.  With the 17mm prime lens, you are really discrete and small... and quasi-pocketable.  That is a worthy trade-off, weighed against bigger lenses.  I find the optical viewfinder worthless.  It adds bulk and doesn't really contribute much, unless you are so used to a viewfinder that you find it necessary.  I don't mind composing with the view screen.Final remarks:  fantastic camera.  The one I use every time as my primary, when the shots really matter.", "Date": "October 15, 2011"}, {"Title": "Camera makes you feel like a pro!", "Author": "Raul Lucero", "ReviewID": "R1PQCGJZRM3WE", "Overall": "5.0", "Content": "This camera rocks! at first I was a little overwhelmed with the controls and hoped the back horizontal scroll was some kind of zoom (had no idea about the interchangeable lenses); however now I'm getting more used to it and bought two more lenses for the zoom, which have made beautiful looking pics. I wish this one had an integrated flash as the EPL1, however it's no big deal because even in the darkest places, my photos always look bright. Good choice, guys!", "Date": "April 11, 2011"}, {"Title": "Great buy - very happy!", "Author": "J. Shen", "ReviewID": "R3G571ER8VDXC8", "Overall": "4.0", "Content": "I suppose I would consider myself an amateur photographer. I am by no means an expert, but I did go to film school and I am a professional videographer. I have been doing still photography for about 16 years now. I've owned and used this camera heavily for a few months now...I love this camera. I admit that I am a sucker for retro styling, but this product really delivers. The body is solid metal construction (unlike the newer pen models), and the weight and feel of the camera are impressive. It is a good compromise between the size and convenience of a smaller point and shoot, and a large DSLR. I agree with other reviews about the slow auto-focus. I take a lot of high-speed sports shots and it is difficult to get a sharp image sometimes. But, this is not a professional camera. Its a great \"pro-sumer\" model that can be taken very far with the right accessories and know how. I highly recommend buying the Magic Lantern Guide for this model. The author has done a lot of research and testing so you don't have to. Get a hot-shoe flash and a good uv filter and you pretty much can take on any situation.I am not usually a fan of digital \"art filters\", but the EP-1 has some pretty cool stuff. I am really into the \"pinhole camera\" effect! There is a long processing time with these filters.The HD video is not bad either. You need a steady hand and I recommend manually focusing as the auto focus is not very good in video mode. Just remember to buy a bigger card (class 6 or better) if you plan on shooting video, it will run out quick!People are constantly coming up to me and asking about the EP-1. The styling is very attractive. When I show them some shots, they are equally impressed. I always hear \"Hey, that's a cool little camera!\" I agree.", "Date": "September 25, 2010"}, {"Title": "Great little camera", "Author": "Reza Farivar \"Rezaf_2000\"", "ReviewID": "R37O01RAC1MMFD", "Overall": "5.0", "Content": "This camera is great. The whole design is the result of a set of compromises that I can totally live with and even like.1. The picture quality is great! Not above $1000 Canon or NIkon DSLR great, but I can live with it. It matches a lot of entry level DSLRs though, and is as good (or better) than what you get from other Olympus DSLRs.2. Given the two control wheels and total customization of the body controls, there is no compromise in the control scheme. Yes, it will take you a month or two to fully get used to it and customize it to your liking. But once there, it becomes an extension of the photographer. No monkeying with buttons and no diving in menus. It becomes a lean, mean photographing machine!3. The small camera size makes it totally feasible to have it always with you. If not in a coat pocket with a pancake lens, you can always have it in your hand bag (purse) or just let it live in your backpack. I have a very thin backpack designed to carry a laptop and a book or two at most, and I can easily have the E-P1 there with the kit lens.4. The kit lens is great. A bit of compromise here compared to maybe the best lenses available, but the collapsible design plays heavily to the portability factor.5. The Olympus color rendition is just fabulous!Because I have it always with me, I now take about 600 photos a months. This alone has made me a better hobbyist photographer compared to before I got this gem!", "Date": "May 12, 2010"}, {"Title": "Olympus Pen E-P1 Is a pretty good camera!", "Author": "Sandra P. Tzuc", "ReviewID": "R3SQVLDUWAWB8W", "Overall": "5.0", "Content": "I recently purchased the Olympus Pen E-P1 and it's a decent camera. It's a combination of a digital SLR and a point and shoot camera. The quality of the images are pretty good. This camera might take time getting use to if you are a frequent user of a DSLR. If you want a really good camera, this is it. REMEMBER THIS ISN'T A DSLR, It only has DSLR features!", "Date": "April 10, 2010"}, {"Title": "A professionals second camera", "Author": "R. Mckinley", "ReviewID": "R3HZT0UHH6KMI", "Overall": "5.0", "Content": "The Olympus PEN EP-1, and its soon to be released followup the EP-2 with the added digital viewfinder, are the perfect second camera for those traveling professional photographers. Lightweight but powerful. With the optional lens adapters, from Olympus as well as secondary manufactures, the range of glass for the body is unlimited. The original PEN line of compact cameras were, and still are, classics. Olympus has done it again.", "Date": "November 9, 2009"}, {"Title": "A beauty", "Author": "BallaghMan", "ReviewID": "R1OET2NOTM9XF7", "Overall": "5.0", "Content": "Pricey camera but worth it......really good construction and feel, and great pictures.  hard to get a nice case for it but did finally find a nice leather one, so we're all good to go!", "Date": "December 28, 2009"}, {"Title": "My first time owning a camera over $125 and I love what it can do", "Author": "Robin J Kim", "ReviewID": "R2FJ1MCZY2GTAR", "Overall": "5.0", "Content": "I don't usually spend more than $125 on a camera, but I was tired of blurry pictures (I like to take action shots and shots in the dark without using a flash). I was blessed to catch this camera body at under $300 on amazon. And what's awesome is that the merchant (orderinstant(USA)) couldn't send this to me on time. Why awesome? Because they decided to throw in a free lens due to that snafu. So I got a free Oly Digital 14-42mm 1:3.5-5.8 ED lens, which I believe is listed at more than $200. Obviously it would suck if I needed this item for a special event and it arrived too late for that event only b/c of the merchant not meeting the deadline. But I doubt this merchant makes that mistake very often or else they'd be losing a fortune in lenses.", "Date": "March 12, 2013"}, {"Title": "excelente", "Author": "nesmari", "ReviewID": "R34AOFDLNW8STQ", "Overall": "5.0", "Content": "Excelente hace un año q lo compre y no ha presentado ningún problema, muy buena cámara y buen servicio, muy responsables", "Date": "November 30, 2012"}, {"Title": "A (large) pocket full of photo good times", "Author": "Geek Chick", "ReviewID": "R2RSFUNTDTAUFC", "Overall": "4.0", "Content": "I have a good friend whose a pro photographer, so when I got fed up with being unable to play with things like depth of field with my point-and-shoot, I asked him what I should get. I wanted some manual control, but on a budget. His instant suggestion? The E-P1.It's been almost a year, and I am still in love with this camera. It's really easy to get started straight out of the box using the auto mode. Is auto-focus a little laggy? Yes. But that's fine by me as I'm usually shooting still life or landscapes as I work on building up my photography chops. I got some really fantastic pictures the first day out, which have helped keep me motivated.There are a ton of lens adapters, so if you have older lenses lying around, check online for a micro 4/3 adapter. This has let me borrow lenses from friends and family without having to throw down for the more expensive native lenses. My current favorite is the OM f1.4/50mm. GORGEOUS. And pretty cheap as these things go--around $125 used.My biggest gripe is the LCD. I don't mind not having a viewfinder so much; I wear glasses, which make viewfinders annoying so an LCD actually helps me a bit. There have only been a handful of times that I couldn't read the screen clearly due to sun; an improvised sunshade fixed that issue quickly (gaff tape is your friend). No, my problem with the LCD is that it's so CRAPPY. Looking at the sleek lines of the stainless steel camera body (this thing is SEXY), Olympus obviously put some money into this camera design. Why the heck did they skimp on an inferior display, especially when it's your viewfinder as well!? Lemons into lemonade, your pictures will look much better when you view them on your computer screen--lots of pleasant surprises--but it's really silly that they didn't spring for something with better resolution.I don't think the menus are particularly hard to navigate or unintuitive, although I recommend taking 30 minutes to dig into all of them so that you have an idea of what's where.Some folks will enjoy the art filters (film grain, pinhole, washed out, super-saturated, there's a few more)--while fun to play with, I'd rather do that sort of thing myself in post--more control that way, plus you still have a clean version of the picture.Overall, I lovelovelove this camera. So did my friend. After seeing me shoot with it and playing with it a bit himself, he broke down and bought one as well a few months later, despite already having a fair bit of pro gear. I think that says a lot.I paid about $250 more for this set (ugh), but really, don't regret it--I've had so many good times with this camera. At this price, I'd say it's a no-brainer if the E-P2 is out of your budget. You don't have to take my word for it--search for E-P1 on Flickr and see what people are doing with it!", "Date": "December 26, 2010"}, {"Title": "White PEN", "Author": "Bonnie Yamamoto \"Bonnie888\"", "ReviewID": "R1P53YA0MDKIEM", "Overall": "4.0", "Content": "Okay, it's been said it's too slow.  But I can't find any camera, this cute, this price and quality on the market.It truly takes beautiful photos.  I love it every day.  If you are not professional photographer and not trying to capture wild bird activity,this camera do a wonderful job.", "Date": "February 6, 2010"}, {"Title": "Big leap forward that needs another iteration; prepare for serious photography", "Author": "Biz Person", "ReviewID": "RLFF01BH0FZ43", "Overall": "3.0", "Content": "I've been using point and shoot cameras, favoring a Canon superzoom for the past two years.  I bought the PEN looking to upgrade to something that would give crisper, better focused images and still be highly portable for travel.  I read all the reviews in detail and thought the design looked cool.So far I've had it for a few days and taken about 50 shots.  There are a few MAJOR issues to consider before you buy this camera:- OK it's smaller than a SLR but that's still heavier than a point & shoot.  In fact it is so dense, I really have to use two hands all the time and I keep worrying I'll drop it.  If this thing falls off the bed, it's going to either smash into pieces or break my toe.- the lens cap has to be taken on and off EVERY time you start up.  How long til I lose that?  There's no spare or way to protect the lens without a cap.  With my superzoom, I tethered the sole cap to my straps, but that does not work so well on a camera with interchangeable lenses.- there's no viewfinder and no flash.  You can buy them each separately but that gives you more widgets to carry around.  It is MUCH less convenient than a superzoom.- you really need to understand photography (aperture ratio, shutter speed, etc.) to use this camera.  The auto-focus does not work in low light.  You can't rely on Auto; it seems like I can often get better images by twiddling with settings.- the free software that comes with it for adjusting RAW is aimed at power users- the loops where the straps attach are stylish but annoying since they have these metal clips that do not rotate at all; the straps keep getting tangled and the metal loops stick out and catch on things.- there is no custom bag for this camera, but it has a novel form factor since you want to carry two lenses along with a smallish bodyNow for the good news:  the crispness of image is superb!  If I can manage to bring this along without breaking it, and if I can manage to learn photography while I am on vacation, then by the end of vacation I may have some gem photos.In short, while this camera looks like a point and shoot with an SLR-style sensor, in fact it is really more of an SLR camera crammed into a tight package.  It's best suited for camera buffs who will deeply appreciate its size and high-quality images.In the next iteration, Olympus should add a better place for your thumb to hold when using it one-handed, fix the straps, add a tiny flash, and upgrade the ease of use of the Autofocus.I am looking forward to learning more about photography and hopefully getting some amazing shots with this camera.  Just bear in mind the Olympus PEN is going to demand special handling and a major learning curve, if you are used to a point-and-shoot digital camera.", "Date": "July 10, 2009"}, {"Title": "true innovation", "Author": "C. watkins \"wayward suns\"", "ReviewID": "R3CNVQF2ZRDNBH", "Overall": "5.0", "Content": "great picture taker, the images are stunning and its so easy to live with.  the image quality is on par with nearly every DSLR out there minus some full format stuff.  i do miss having a flash though, which will be remedied soon enough.", "Date": "August 21, 2009"}, {"Title": "Great camera, lowsy software - Mac user", "Author": "Acuratic \"acuratic\"", "ReviewID": "RFVTQ73NABLGY", "Overall": "3.0", "Content": "I've moved from a Nikon SLR to the Olympus EP-1. I was looking for a smaller camera that took SLR quality pictures and this fits the bill.  Build quality feels superior to Canon/Nikon although time will tell. After a recent trip up the coast and through the woods of Maine I'm very pleased with the results. Getting used to having no viewfinder takes more than a week or two.I use a Mac and store and edit programs with Aperture.  Aperture, even after three months has no support for the RAW (ORF) files produced by the camera. The JPEG's import just fine.The software that comes with the camera is horrendous. It is very amateurish in that there is no File menu and no Quit command. It can't import pictures stored on the hard drive.  And forget about editing with it. This same software is used for updating the camera, lens and flash firmware which can render the camera unusable if a problem occurs.  I love the camera but wish RAW support was available in Aperture. If you don't use RAW then you can easily set the camera to JPEG only.  I've had a running email conversation with Olympus Tech Support and I'm not sure they really understand how bad their software really is. I've certainly tried to tell them in a positive way offering my assistance in beta testing any new updates.I've read other reviews here that the camera can't be used with a Mac. This is untrue.  Photos can be imported into iPhoto and Aperture as easily as any other camera. Simply slip the SD card into a MacBook Pro with an SD card reader slot or use an SD card reader.  Do NOT use the Olympus software or connect camera via cable (which I never do anyway). I've also imported the movies produced by the camera with no problems.  Excellent movie quality.I recommend downloading the manual from the Olympus website (the printed one included in the box has tiny print). Spending an hour or so learning the features is worth the effort. Navigating through the menu and selections is easy.I purchased a second battery although I never needed to use it shooting photos and movies all day.An issue is the lack of available lenses. There are no telephoto lenses available from Olympus besides the 14-42mm. The 17mm 'pancake' lens looks like a good option for low light situations if it were't for the $299 price tag (a bit steep for a camera at this price level).Overall, I love the small-size convenience and photo quality.  The camera with the 14-42mm lens is good value.  If you can do without RAW format, which most probably can, then I doubt you can find a better camera.", "Date": "October 16, 2009"}, {"Title": "Good design, sub-average execution..", "Author": "P. Baek", "ReviewID": "RZWD1EZVTWTQW", "Overall": "3.0", "Content": "I bought the EP-1 and the kit lens 14-42mm. As expected, the autofocus is slow and can't compete with true DSLR's like the Nikon D5000 or even Olympus' own E620. Normal JPEG output looks good but focus is a little too soft and dynamic range is not as good as I would like. Also, start-up time is frustratingly slow....you have to turn the power on, take the lens cap off, and twist the unlock button on the lens barrel before you can even see the image on the LCD screen.....when you have to take a quick shot, forget it! I know that most people are buying this camera for it's retro, hip style and portability, but in reality, the camera is bigger than just about any compact camera out there (including the Canon G10 and Panasonic LX3) and you cannot fit the EP-1 in a pants pocket (esp. with the zoom lens).....once you buy the flash and a few lenses, you'll need a good size camera bag and then you'll end up carrying about the same amount of gear as a typical DSLR. For me, I ended up returning the EP-1 and getting the Fuji Finepix F200 EXR. To me, the F200 took pictures just as nice as the EP-1, esp. at high ISO, is much smaller (fits into a pants pocket), has a built-in flash, and much cheaper. Granted the EP-1 has much more manual controls and features than the F200 and the ability to use different lenses, but in the end, image quality (which is the most important part) is what counts and I found the F200 could hold it's own against the EP-1....not to mention the fact that the Fuji is much smaller, lighter, and thus, more portable than the EP-1 and has a much quicker start-up time.", "Date": "July 17, 2009"}, {"Title": "Olympus E-P1", "Author": "Raleigh Reagan Atkinson \"Digital geek\"", "ReviewID": "R2RPXV92GDC76X", "Overall": "4.0", "Content": "Excellent camera, loved the sensor and picture quality. Major nitpick was the manual. They cover so little on the controls and how to do certain things. Had to call Olympus tech help just to figure out two different controls. Finally after 4 weeks, gave up on it though. Could not get used to the big screen. Kept hoping for viewfinder. Tried the 17mm viewfinder but could not be of any help with the zoom lens. And could never find a way to turn off the screen. Just shipped it off today to another buyer. My loss their gain.", "Date": "September 12, 2009"}, {"Title": "Warning: slow AF speed is a dealbreaker", "Author": "BR", "ReviewID": "R24OB6J69RZ15D", "Overall": "3.0", "Content": "The E-P1 autofocus is absolutely horrible. Even my Canon point and shoot AF is much faster and more accurate. Half the photos of my kids are out of focus due to the slow focus speed or focusing on the wrong subject. I am looking forward to the new Panasonic GF1 (Panasonic Lumix DMC-GF1 12.1MP Micro Four-Thirds Interchangeable Lens Digital Camera with 14-45mm Lens) as a replacement for my E-P1.", "Date": "September 9, 2009"}, {"Title": "reality short of expectation", "Author": "Dorothea lange \"cas photog\"", "ReviewID": "R33J2K9DM1ITGL", "Overall": "3.0", "Content": "I purchased the E-P1 to provide better quality images than my F100 Fuji but easier to carry around than my dSLRs.  And I had high confidence in what I know about Olympus etc. In practice it falls a little short. Manual  focusing with the zoom technique is awkward and less than reliable. Poor low light operations. Slow focusing in automatic.  That being said it is a camera intended to be used at a slower more deliberate pace. And in that regard it works well. But then for the money it operates in a much narrower range of photo opportunities than a high end pt-and-shoot like the Panny LX-3 or an entry level dSLR; therefore it offers less overall value. I find myself wishing I had not purchased it preferring to wait until the mFT systems matured a bit, and perhaps added OV. And the entry lenses are less than stellar. Both fairly slow in aperture; a 20mm 1.8 as standard would be great a a starter.  So it is an OK camera, kudos to Oly for taking a major step in another direction..but I find myself leaving it at home in favor of Fuji or Panny pt and shoots, or when I require the full use of a Dslr. My nikons D90 or D5000 with standard primes lenses are easier to use than the oly. and the grips of the dSLR make for 1 handed shooting. The Ep1 is a niche camera right now. I would lok at the new Panny.", "Date": "September 5, 2009"}, {"Title": "A great little camera", "Author": null, "ReviewID": "R1FVNZOO6NPUMF", "Overall": "5.0", "Content": "This camera is great. It is small enough for you to carry around, but also has the versatility of having a interchangeable lens. I wouldn't see using this if I were a pro, but it is a great prosumer camera.", "Date": "July 21, 2009"}, {"Title": "Good optics easy to use but, pricy", "Author": "Aubrey D. Thomas \"world watcher\"", "ReviewID": "R27E27OZ2YU9WI", "Overall": "3.0", "Content": "The optics and picture are of high quality however it somewhat problematic to cary and change lenses. I would have been better satisfied if it had come with an indirect flash.I find myself most of the time taking an Olympus tuff 8000. The pictures are of very high quality and I can carry it in my pocket.", "Date": "April 11, 2010"}, {"Title": "Very satisfied with this camera", "Author": "Tord P. Ursin", "ReviewID": "R1ZU8FU9VZKV91", "Overall": "5.0", "Content": "The Panasonic 20 mm lens is more fun, so consider buying that as well.The fold-in mechanism in the lens is nice for saving space - but I am already getting tired of using it.", "Date": "May 27, 2010"}, {"Title": "Olympus EP-1 is great", "Author": "Alexandre A. Dedavid", "ReviewID": "R236XZXAZ2UUOT", "Overall": "5.0", "Content": "It's a great camera!The onlly thing missing would be an external flash for free... ;)Anyway, you can balance colours by adjusting time of expositure, ISO and F.I recomend it!", "Date": "October 5, 2009"}, {"Title": "Had it for 3 weeks, just took the first adequate pictures", "Author": "Mark Twain", "ReviewID": "R2ASGBSWKKFWV6", "Overall": "3.0", "Content": "The low ease-of-use score relates to a really terrible manual.  Major basic steps are left out, leaving the user unable to figure out how to access important menu areas.  Symbols in the menu are arcane and trying to go between modes to make changes in menus non-intuitive.  I had to make 6-7 phone calls to Olympus in the first two weeks, after which I got the first photo that could be enlarged to the max in iPhoto with acceptable clarity.  Online support from Olympus is pathetic;  they lose original emails.  The poor display score doesn't refer to ease of seeing the image in the LCD display - it's ok - but rather to using the display menus, which are far too busy and change/blank out within a few seconds.", "Date": "September 28, 2009"}, {"Title": "Not the Digital Holy Grail!", "Author": "shuTTL3bus \"shuTTL3bus @gmail .com\"", "ReviewID": "RZLHX7HNEHN60", "Overall": "3.0", "Content": "Photographers have been anxiously awaiting a small light-weight DSLR replacement with baited breath.  Unfortunately Olympus PEN E-P1 is not it.  The autofocus is way to slow.  Therefore, this puts the PEN more in the realm of the Canon G10 and the Panasonic LX3.  I have a Nikon D700, Nikon D300, and Canon Powershot G10 14.7MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom so I will compare the PEN to the G10.Picture quality:  The Olympus PEN has a bigger sensor and therefore has a better picture quality(PQ) and noise handling than the G10.  However, at ISO80, the G10 makes stunning pictures.  Winner PENErgonomics:  Both cameras are heavy and solidly constructed.  Both cameras are really too bulky to fit into a pocket.  However, the G10 feels better in the hand and the controls are better placed and easier to use.  Additionally, the G10 actually has a built in viewfinder.  Winner G10Handling:  The G10 is flat out the best handling camera that I have used.  I prefer it in many cases to my D700 and I think that is a fantastic camera.  I will say that the PEN controls are really good.  I did find them easy to use but not as fast and nice as the G10.  Winner G10.Performance:  The G10 is pretty quick at focusing and, in my subjective opinion, is faster than the PEN.  Other than that it is a slow camera as it has no buffer and has to write to the memory card.  The PEN, once it actually focuses, can snap off pictures quickly.  However, the slow focusing was a big disappointment for me.  If you are trying to shoot pictures of your kids, you will miss a whole bunch of them.  I will give the slight nod to the PEN but the performance is way way way off a DSLR mark.Flash:  I do a ton of off camera flash work and the G10 is fantastic for this.  Because there is no shutter I can sync the flashes up to the fastest shooting speed of the G10(1/4000! of a second.  The D700 only syncs to 1/250 on normal).  However, in a pinch I do use the built-in flash on the G10 and have shot some really nice photos with it.  The PEN lacks any sort of built-in flash which is an exceedingly poor design decision.  Additionally, the flash sync speed is a measly 1/180 of a second.  Forget using flash in bright sun.  However, it does have a built in flash shoe so you can use a radio transmitter (Pocket Wizard) for off camera flash work.  Overall the lack of flash and slow sync speed is a deal breaker for me and a huge disappointment.  Winner by a long shot, G10.Subjective:  No other type of digital camera replaces a DSLR for speed and picture quality.  However, carrying around and swapping lenses is a big hassle.  Also, lugging around 10-40lbs of camera equipment is not really practical for day to day.  The PEN still has many of the DSLR vices (extra lenses to buy, carry, and swap) and is really lacking on a DSLRs  virtues (fast start up and focusing speed).  The G10 lacks the speed and picture quality of a DSLR but makes up for that with a faster flash sync speed and an all-in-one purchase.  At less than half the price of a PEN, better portability and very good PQ at ISO 80, the G10 is the winner of this category.Overall:  I really really wanted to love the Olympus PEN.  However, the Canon Powershot G10 14.7MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom is a better power-user camera. For portability, I will continue with the G10 for my day to day photography and wait for the elusive holy grail of a small and fast DSLR replacement.  The PEN is a nice camera with outstanding PQ but for the price I would get a Nikon D90 DX 12.3MP Digital SLR Camera with 18-105mm f/3.5-5.6G ED AF-S VR DX Nikkor Zoom Lens or for less than half the price I would get the Nikon D40 6.1MP Digital SLR Camera Kit with 18-55mm f/3.5-5.6G ED II AF-S DX Zoom-Nikkor Lens.  I am sure this camera will find a nice niche with Leica or Ricoh users but if you are someone looking to step up from a basic point-and-shoot camera to delve into more advanced techniques or reliably shoot your kids, I would recommend either the Nikon D40 or a Canon G10 or, maybe, both for the same price as the PEN.Please, someone stuff a four thirds sensor into the Canon G10 and create the digital camera holy grail.", "Date": "July 15, 2009"}, {"Title": "attractive design but medicore picture quality.", "Author": "L. Yu", "ReviewID": "RMM010XNN87CL", "Overall": "2.0", "Content": "I think other than a beautiful design, there isn't really much to write about it being a good camera. I would recommend anyone who is interested in a micro four thirds should save some money for a lumix gf1. It is light year better in performance and as good as, if not better in picture quality than the ep1.", "Date": "May 13, 2010"}, {"Title": "v1.1 firmware", "Author": "Ben Toyoshima \"ben\"", "ReviewID": "R1ST2R5DMJRUIJ", "Overall": "4.0", "Content": "I was REALLY disappointed in this cameras inability to focus in low light. The instruction manual seemed to concur saying if you are having trouble focusing, then focus on something else equidistant and then recompose. That's pretty a bad solution from a company that I used to love (OM-2).  But Olympus didn't seem to get-it with their digital cameras (e.g. using xp flash for a long-long time).The E-P1 had fallen into the bad neighborhood in the back of my dresser drawer where all my old, antiquated or broken d-cams go to retire and become forgotten. And I felt let down by Olympus again.I read on a couple of web-sites they had a firmware update, but you wouldn't know it from the Olympus website which makes no mention of it. The only way you can get the update is via their supplied software: OLYMPUS Master 2.I really disliked that Master 2 required a reboot on my Mac after installing.But it seems to have worked wonders for focusing and I'm jazzed with this babe-magnet, cutie-pie camera again. It is still in probationary testing (I finished the body and lens patch download 15 minutes ago) but I really want to like this camera and the new firmware seems to give it a new chance.I'd love to hear, I mean read anyone elses take on the v1.1 firmware upgrades. A critical before vs after analysis is going to be hard because you cannot go back", "Date": "July 5, 2009"}, {"Title": "It's Confusing", "Author": "Charles Brewer", "ReviewID": "R2YCEMVSM0QCWW", "Overall": "5.0", "Content": "It's confusing.Does the E-P1 include two wiewfinders? No determinating is forthcoming from Amazon. I bought it from someone else (Beach). Good luck to me for finding a line in. Supposedly it will be all right!I blame Olympus for this. Is not the manifest on the Web the right, the true? Supposedly. it's true! Nonsense. We get what we pay for, right?Nonsense! Garbage in, garbage out!", "Date": "October 1, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002CGSYKI"}}