{"Reviews": [{"Title": "East to use first surveillance camera", "Author": "D. Hayek", "ReviewID": "R3G3VLMEDMRL0J", "Overall": "4.0", "Content": "This was my first camera for home surveillance.  This product is very east to setup.  Viewing while connected to the local network provides fairly smooth motion and sound quality.  The web based application for remote viewing is more jumpy but still serves the purpose.", "Date": "December 29, 2009"}, {"Title": "Fun little camera for a nice price", "Author": "Alexis Coxon", "ReviewID": "R2N1ZZ15D5PVEJ", "Overall": "3.0", "Content": "I decided to try out the Lorex camera so that I could see how my kids are doing when I'm away from home. I work nights, so I miss out on a lot of their bedtime routines ... I like being able to peek in at them watching \"Thomas the Train\" in their jammies or just running around being silly while I'm at the office!I did have a little trouble setting the camera up at first, and it was a little bit of a pain to connect it to the router, but luckily my husband is an IT guy, so he helped me take care of most of that. The remote viewing is a little jumpy, as another reviewer noted, and I always seemed to have issues viewing the footage on my iPhone. If you're just using this for fun, the Lorex LNE1001 is probably a fine choice; however, if you're looking for something with solid security features or the like, I'd probably choose something with a few more features.", "Date": "July 14, 2010"}, {"Title": "Definitely not the surveillance camera of my dreams but it is good", "Author": "Alice in Wonderland", "ReviewID": "R2XJ92YRWKGR6V", "Overall": "3.0", "Content": "I consider myself to be relatively computer savvy - which is to say that I can install software and hardware, as long as there are no complicated steps required. I must say, though that I had some trouble hooking this gadget up. A second problem is that it must be connected to my router with an Ethernet cable, which severely limited where I could place the camera, plus the cable running along my floor would probably alert an intruder that there is some device squirreled away somewhere that he might want to check out.But, once the camera was hooked up, it worked pretty darn well. I used it recently while on vacation, and it worked just fine. It's definitely not the surveillance camera of my dreams, but it is good.(Review of Lorex LNE1001 Easy Connect Network IP Remote Surveillance Camera)", "Date": "July 21, 2011"}, {"Title": "Great for Windows, not so much for Mac", "Author": "Eric K. Talerico \"Greenmanwest\"", "ReviewID": "R2346RWWXCM88P", "Overall": "5.0", "Content": "The Lorex LNE1001 is a terrific little camera that does exactly what the ads say it will.  On a PC with Windows XP it was up and running in the short time required to install the software and plug in the USB port.  Its easy to use, and the quality of the images is very good.  As a home protection device, you can't ask for much more.  Things were more problematic when using my Mac Mini though - for one thing, the device supports viewing only for Mac, so you can't record your security footage.  So its good for live monitoring, but not for evidentiary uses.  Also, it was not easy to set up to use with a Mac.  I followed the instructions on the indicated website, which entailed logging into my router and locating the IP address of the camera, but it took several times and a bit of guesswork to really get it operational.  Although the camera's IP address turned up when I logged into the router, I had to improvise to get my computer to recognize it.  Once I did however I was able to access the camera using my Safari browser and it worked quite well.  Be prepared to run a very long ethernet cable if you intend to use the camera outside the immediate vicinity of your computer - there are instructions on how to run the cable on the Lorex website, but you may want to get an electrician in if you've never done it yourself, or get a repeating router so that you can avoid the long cable run.", "Date": "April 23, 2010"}, {"Title": "Not for Mac", "Author": "eddie", "ReviewID": "R30NCQTXSFR2QN", "Overall": "1.0", "Content": "Very difficult to set-up with Mac which is very frustrating because they say it's incredibly simple.  Well...not so much.  Will likely take back.", "Date": "November 15, 2011"}, {"Title": "Problems hooking this up", "Author": "Krusty \"Krusty\"", "ReviewID": "R2HX7WK5A741F5", "Overall": "2.0", "Content": "This camera was not very user friendly. It was problematic hooking it up and I consider myself pretty tech savvy so it was frustrating. We ended up returning it when we couldn't get it to work remotely.", "Date": "January 10, 2011"}, {"Title": "Nice camera for casual users", "Author": "Kingston", "ReviewID": "R2W75LHTVQZMSE", "Overall": "4.0", "Content": "Not the easiest set-up on my Macbook Pro, but it's worked fine since I got it going. The camera requires a wired connection, so as others have mentioned, it just isn't the best choice if you're looking for a setup far away from your computer (unless you're fine with buying and using a really long Ethernet cable). My computer is in my living room apartment so it's usually fine if I want to check up on my dog while I'm at work. For similar casual remote viewing, this system gets my vote. For more robust surveillance (and recording capability) I would probably research another model.", "Date": "October 29, 2010"}, {"Title": "Works nice!", "Author": "Penguin Chick", "ReviewID": "R2YDEP085RD5UK", "Overall": "4.0", "Content": "Well \"easy connect\" might be pushing it a little bit, but just the first time.  This took me about a half hour to hook up.  It would probably take less time for someone a bit more computer savvy than me, but I still think I did pretty good.  Once it was set up, it actually works great!  I use it just to keep an eye on things at home and I'm able to do that with no problem.  Sometimes the connection is a bit shaky, but all in all I'm happy with it.  This is my first experience with this kind of product, and I think for first time users, you will be pleased.", "Date": "October 20, 2010"}, {"Title": "If you want to use this for motion detection , save your money", "Author": "Al Benincasa", "ReviewID": "R396AIS3AE6IOS", "Overall": "1.0", "Content": "Viewing over the Internet works fine, but the motion detection/alert via e-mail function does not work properly. My unit generates an alert every minute or so regardless of the sensitivity setting or the lack of motion in the filed of view (it will sense 'motion' even a dark, empty room). There is also a time lag in the picture processing. By the time the motion detector triggers a picture (on the odd occasion when it DOES work), the triggering object is often out of the field of view. Lorex honors their 1 year guarantee and returns are promptly handled. I sent mine back twice. Unfortunately, all three units (the original and two replacements) exhibited the same problem with motion detection. Since the alert/email function was the reason I bought it, I am very disappointed.", "Date": "August 17, 2010"}, {"Title": "A little misleading", "Author": "holdreaw", "ReviewID": "R28IMH75EFW9DP", "Overall": "3.0", "Content": "Product is very easy to setup and opperate.  Only problem is I wanted to record video and audio, too bad you can only record video with no audio.  I was under the impression that I would be able to record audio.  Otherwise a good product.", "Date": "August 9, 2010"}, {"Title": "Wired way to watch from afar", "Author": "J. Offenbach", "ReviewID": "R1BJ28RMH68R89", "Overall": "4.0", "Content": "The Lorex LNE1001 Easy Connect Network IP Remote Surveillance Camera (White) was not too difficult for me to connect after reading the materials and checking the Lorexcctv website.  A lengthy brochure describes the step-by-step sequence for setup which must be followed in order, but to install on a Mac, I had to go to the website for instructions.  The camera is small in size and a short white ethernet cable was included.  Unfortunately, for our needs, we'll be getting a wireless surveillance camera, but this was an inexpensive way to get started.  We'll also be looking for a camera that enables us to record on a Mac which is not an option with this camera and the reason I've deducted a star from the review.", "Date": "June 16, 2010"}, {"Title": "Great for home viewing, software limits usability of web viewing", "Author": "Tiger", "ReviewID": "RC5KJ4MN6685N", "Overall": "4.0", "Content": "I was impressed with the packaging, materials, and printed instructions that came with this.  It was really well packaged and made an awesome first impression.  It was just so well polished and noticeable compared to so many other electronics.  Setting it up to run & view locally on your home wired network is easy and it works great.  It really didn't take much at all to be able to plug in, install the viewing software, and see what it was viewing with a good frame rate.  I am very happy with this from that perspective.This is the wired version, not wireless.  I can't help but say 4-star instead of 5-start because of being wired.  I am much more limited to where I can place it.  But that is easily solved by just buying a long network cable from a cheaper but reliable place online.  I really wish I had the wireless version though.  It would give so much more freedom to move anywhere you want to monitor anything that has a power outlet within range of your wireless network.  But if you are installing at a fixed location, then just by the cable and run it if you can run a cable out of view or don't care about seeing the cable.  Wired will simplify setup perhaps to avoid network configuration over time.My biggest complaint is with the software for web viewing.  First, what frustrates me most is the 3 separate usernames & passwords for 3 different things.  (1) You have a username & password for the camera itself to protect others from getting access to it on your network somehow and seeing.  But I can't figure out how to change the username & password.  The manual says you can and made it sound easy, but I am a software developer and I couldn't figure it out on the first day.  I'm sure I could keep playing with it, but so far haven't figure it out.  (2) You have a username & password just for the IP address switching service so that the third piece of software can locate it.  (3) You have a user name & password for what looks like a freeware service to view your camera by using (1) and (2) from the website you log onto with (3).  The software was too loosely integrated in my opinion.  It is just too confusing.  I really wish they had one portal that put together everything seemlessly for you, (1) camera admin itself locally, (2) IP switching, (3) web based viewing.  I can't always remember which username or password it is asking for and which to enter.  I was disappointed by the loosely integrated experience after such polished packaging and printed instructions.When you view from the web, the video quality is greatly diminished, but this is configurable when you configure the camera locally and really depends on your internet upload speed.  So I am not considering that a point against it.  It is simply limited by your connection speed, but does a lot to help configure better for it.  You can do better quality choppy video, like freeze-frame, or varous other resolutions.", "Date": "April 21, 2010"}, {"Title": "Super-easy to install", "Author": "DWD's Reviews \"DWD's Reviews\"", "ReviewID": "R23J0THZF026AK", "Overall": "5.0", "Content": "This is my first attempt to install any type of camera. It took me about 15 minutes - it would've taken less but I decided to see if I could install it without reading the instructions. After consulting the instructions and plugging it in correctly it worked right away!It plugs into a local router, comes with window stickers that warn that the \"Premises under 24 Hr. video surveillance\" (2 in English, 1 in Spanish), and and installation stand/bracket with screws and wall anchors.The video quality is pretty good but the internet connection is a little bit herky-jerky (may be my broadband is a bit slow, who knows?).Ideal use for just one camera? Small business or office.To cover a house you'd need multiple cameras and unless you want them all plugged into the same router and run lines everywhere you'll need to upgrade to some wireless cameras.", "Date": "March 24, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002P8M4IQ"}}