{"Reviews": [{"Title": "Newborn photographer thanks to Sony's A380 DSLR", "Author": "Justin Sane \"Halläathrad\"", "ReviewID": "R1971RTBH00C7T", "Overall": "4.0", "Content": "I am a photographer-wannabe graphic and web designer.I have taken this product to photoquests where I've subjected it to different types of landscapes, light and climate situations -- even some soft rain.So far it has behaved beautifully with good battery life, fast enough recording speeds and good image quality even on its lowest settings.The lens work good, but have had trouble trying to get long distance pictures (not enough optical zoom) but it was to be expected, and can easily be fixed by attaching adequate lenses for said purpose.Only issue may be with the LCD screen, as it tends to get scratches on its surface ratter easily, so I'd suggest you get some sort of cover for it (I haven't been able to find it where I live - Colombia, Southamerica). Guess I'll have to buy it through Amazon too.Can't really give much more advice as I am just a n00b at this stuff, but I can tell you this camera has opened a new door in my head and career I think won't be closed for the foreseeable future.Excellent product if you're just learning, I'll let you know if it keeps up.", "Date": "March 2, 2010"}, {"Title": "Awesome camera, great value!", "Author": "PikiNiki", "ReviewID": "R3EJD8D3064XSJ", "Overall": "5.0", "Content": "I initially was drawn to the Sony line of DSLR's because I've used a Sony SLR like camera for a few years now and just love it.  Infact most people already thought I had a full DSLR from the picture quality.  So when it was definitely time for me to upgrade, I knew I had to keep Sony on the list to compare.  I talked to other photographer friends, and most leaned toward the Canon XSI as a good entry level DSLR.  So I compared it to my Sony alpha 380.  In all areas it was either comparable to, or exceeded the Canon, for my needs. To top it off, it was less expensive than the Canon.  So I made the purchase of the Sony, and am in love with it!  I love the picture quality, the ease of use, and for me the live view feature is amazing.  I take a lot of pictures of my dogs, which requires me to lay on the floor a lot, with this camera I can switch it to live view and tilt out the screen, and not have to break my neck in order to get the shot.  I've used it for fast action photography, taking photos of the USMC RS Milwaukee 2010 CFT, and just love the great shots I was able to get.  This is a great entry level DSLR! Don't discount it just because it's not a Nikon or Canon, it is definitely worth a look!", "Date": "September 13, 2010"}, {"Title": "Sony Alpha 380", "Author": "Jaimie Krause \"Time Freezer\"", "ReviewID": "R17UMZVJZJEOF2", "Overall": "4.0", "Content": "This is a very light-weight camera!  I like that I can use two different types of memory.  (SD cards are cheaper than CF.)  The hand grip is a little awkward at first, but relatively easy to get used to.  The kit lens is not the greatest, but I used to shoot with Minolta in the film days and when I first switched over to dSLR, so I have plenty of Minolta / Sony lenses and accessories.", "Date": "May 5, 2010"}, {"Title": "New Shutterbug...newly addicted...thanks to great photos!!!", "Author": "Jeremy D. Morgan \"jammin002\"", "ReviewID": "R2IAH8PPW23O1V", "Overall": "5.0", "Content": "I was a little concerned - after one review stated the camera had some issues.  This made me look - only when I can purchase it with an extended warranty - which I did (From NFM for $529.00 + $89.00 for the warranty).Anyway - the other MAIN reason I went with this camera was the expense of the Nikon and Canon lenses (only with Image Stability or Vibration Resistance).  The price of the Nikon and Canon lenses with these features were easily 2x what it was going to cost me for the Sony/Minolta AF lenses - because of the feature built into the Sony Camera.The sony came with an 18-55mm lens - but I knew I immediately needed a telescopic lense and found one at Best Buy for $200 - I was very happy with the quality of both lenses - but especially with the 75-300mm lens.  I just spent my first morning shooting and WOW - I've never taken more beautiful pictures in my life.Anyway - at this point I am VERY HAPPY with my purchase.  I gave it a 4 out of 5 on the ease of use, only because I've never owned an SLR before - I've only had the point and clicks.  I've had to spend some time learning a bit of \"real\" photography.  Hope this review is helpful and good luck with your camera decision!", "Date": "July 31, 2010"}, {"Title": "Solid little powerhouse.", "Author": "TennTrips", "ReviewID": "R2G40CQGLFSU7B", "Overall": "4.0", "Content": "I've had my Sony A380 for about 3 years now.  For a while I thought I'd made a mistake since I could never seem to get the clarity I wanted.  The ONLY mistake was not getting something other than the 'kit' lens that came with it.  Recently I started playing with the option of other lenses and bought a Minolta Maxxum 50mm f1.7 lens for my Sony.  INSTANTLY I regained the confidence I'd all but lost in this camera!  Sharpness that can CUT!  Since that experience, I've bought SEVERAL other lenses and have been extremely thrilled with the results.  I knew there was a reason I wanted the Sony, and it was BECAUSE of the lenses available at a cost I could afford.  That 50mm was $50 from a pawn shop.  The old Minolta lenses will make your Sony shine.  The colors and sharpness surpass what I've seen from the \"big 2\".  The ONLY thing its missing (but not really) is video.  If you're on a budget like most of us are but still want pro results, this camera matched with some Minolta lenses will make you and your photo's look PRO.  All of the Maxxum line of Minolta lenses work with this camera, giving you a selection of lenses KNOWN for quality and color yet to be matched in today's offerings from any maker.", "Date": "April 19, 2013"}, {"Title": "Blaine", "Author": "B. Brillhart", "ReviewID": "R3I476KLPPBS39", "Overall": "5.0", "Content": "Had and still have a Minolta Maxxim 7000 and 70-210 Minolta \"A\" mount lens and 2x teleconverter. Love photography, but not going to the store to get pictures developed, this is a great camera that gets me into the \"digital\" age and back into photography with relative ease. I'm lovin' it!", "Date": "February 11, 2010"}, {"Title": "very poor build quality", "Author": null, "ReviewID": "R1GCKJIF6RHWB9", "Overall": "1.0", "Content": "I am really frustrated with Sony and my Alpha DSLR, a product with inferior build quality and a customer service that lays the blame on me instead of acknowledging quality problems. I have bought it sometime in 2007 and only had problems with it. After some weeks it just wouldn't turn on anymore and it took Sony several weeks to get it repaired and back to me. Now when I take pictures the resulting file shows a different field of vision than what the viewfinder showed me. Even worse, there is a black right upper corner in every one of my picture. After several tries to get to the right person to help me, Sony told me that any repair would cost a fixed amount of £114.56. Without even knowing what is wrong with my camera. Asking if this functional failure is normal for a Sony product after three years, I was told that this is normal \"wear and tear\". For me a camera that is expected by the producer not to last longer than the guarantee period of one year, is not worth paying for. My next camera, or any electronics product for that matter, will for sure not be a Sony product. I recommend for everyone planning to buy one of their products to think hard about how long he/she plans to use it for.", "Date": "June 4, 2010"}], "ProductInfo": {"Price": "$699.00", "Features": "14.2-megapixel APS-size CCD image sensor for ultra-fine detail\nIncluded SAL1855 18-55mm standard zoom lens\nSteadyShot INSIDE in-camera image stabilization; Eye-Start Autofocus\nTiltable, 2.7-inch Clear Photo LCD Plus display\nCompatible with high-capacity Memory Stick PRO Duo, Memory Stick PRO-HG Duo and SD/SDHC media (sold separately)", "Name": "Sony Alpha A380L 14.2 MP Digital SLR Camera with  Super SteadyShot INSIDE Image Stabilization and 18-55mm Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/41Yj1x%2Bh57L._SX300_.jpg", "ProductID": "B0029U0WZM"}}