{"Reviews": [{"Title": "Very decent little camera for the price", "Author": "J. McDaniel", "ReviewID": "R2E2DFCABF5858", "Overall": "3.0", "Content": "This is a great camera to use if you just want to be able to take clear, high definition photos with little fuss and don't want to pay any more than you have to in order to get it. The touchscreen helps to greatly simplify the operation of the camera as it removes the need for buttons everywhere. The camera itself is very small and compact, making it quite tote-able. The anti-shake technology helps greatly and I would not recommend getting a digital camera that doesn't have it. Something really nice about this camera is that it carries a rechargable lithium battery that can be recharged via a USB to electrical outlet adapter (included) or a USB to PC connection (also included).", "Date": "August 19, 2009"}, {"Title": "point and shoot", "Author": "E. A Young \"tag_you're_it\"", "ReviewID": "R3CABE94LTXTNE", "Overall": "4.0", "Content": "You remember those \"disposable cameras\" you could buy for a few bucks with the film embedded in them?  They had the following functions:  film advance, flash (maybe!), shutter button.  The point is they were simple.  They took pictures that were \"good enough\" for vacation use.  And if you lost the camera, not a big deal -- you only paid a few bucks for it.A step above that, for some few bucks more, you could get one extra feature:  A more durable camera body with the exact same features as above, but with removable and replaceable film.  The Vivitar v8025 is the digital equivalent of that camera.It has: a fixed lens (no zoom), a flash (settings: off, auto, fill, red-eye), settings for ISO (film speed/sensitivity -- basically like loading a different type of film in the camera), white balance, exposure compensation (+/- 3 EV), shooting mode (e.g., landscape, sports, night portrait, auto, etc), macro/landscape switch, and a self-timer.It also has the usual settings for image size (1-8MP), quality, sharpness, some sort of \"shake reduction\" feature, and \"facial recognition.\"In operating terms, it doesn't get much more simple than this for a digital camera.  It makes my DiMAGE Xt seem advanced.  The V8025 can take decent photos and has decent \"auto\" settings, but like any camera, you will need to become familiar with exposure compensation, white balance, and the macro/landscape settings in order to take consistent pictures.What's ok about it?1. You can get it for cheap if you hunt, <$50.2. Big LCD screen (tho nominal resolution)3. Long battery life from a generic cell-phone Li-ion battery.  I've taken over 100 photos, and had it on for over one hour so far, turned it on/off several times, fiddled with settings, and it just entered the 2/3's battery mark.4. The tripod mount is in-line with the lens.  Nice! (not so with my DiMAGE Xt)5. Easy access to flash and macro/landscape modes, and they really work.6. It comes with combo USB cord/wall charger, and uses a standard USB connection.7. Assuming everything else is of good build quality, the lack of moving parts should make this camera durable.  It also looks nice.My gripes?1. The lens and sensor aren't high enough quality to warrant the 8MP resolution.  It's just a sales gimmick to jack up the MSRP.  How often are you going to be printing larger than 8x10 with this thing?  I keep it around 3MP.  see [comment] for more info.  Other benefits of using the lower 3-5MP settings: a. faster card writes b. larger storage capacity2. Important exposure settings (+/- EV, ISO, white balance, shooting mode) are split between two different menu hierarchies.  But even though these settings are things that we need to tweak often, most cameras I've ever seen bury them under menus.3. Which would be OK, but menu navigation via \"touch screen\" buttons is bit gimmicky and not as useful as multi-function directional buttons.  You get used to it after a little bit, though.4. For some reason, the camera resets the \"facial recognition\" and \"shake reduction\" settings with every power off/on.  Annoying.5. A little slow on time to first pic after power on (~5 sec)Don't pay a dollar over $50 for it.  Buy a super-cheap 256/512mb SD card.  Charge it up, set it to 3-6MP.  Keep it on you and use it frequently. Practice your photo composition.  Have fun.  And don't fret if you damage, break or lose it!", "Date": "March 6, 2010"}, {"Title": "Poor quality. . .", "Author": "Tracy Cathers \"TCathers\"", "ReviewID": "R1K7DPGBNJ7465", "Overall": "1.0", "Content": "I purchased this camera around Christmas. When I went to use it, a message would come up saying \"card full\" on the display so I thought something must be wrong with the memory card. I took the memory card back and got a new one (different brand) and tried it with the camera. The same \"card full\" message came up. I then figured something must be wrong with the camera so I returned that camera and got another one--same model. I tried taking a picture with it with the memory card and got the same display--\"card full\". I removed the card to try and take a picture without the memory card installed. I was able to take one picture (which was blurry like a cell phone photo). After that, when I tried to take another, the camera displayed a message saying \"memory full\". I followed the directions given in the manual to the letter and couldn't get the camera to take even one more picture.Also, the camera does not come with a manual. I've never bought an electronic device or appliance that doesn't provide the manual. The package gives you instructions to look up the manual in their site. I did that when I used the camera but when you buy an item like this, you shouldn't have to read the instructions from a website. It should be included in the purchase. In order for me to print up the manual, I would have to do it at my local library (as my printer isn't working) and that would cost over $7 (49 pages). I paid for the camera. The manual should be included in the cost of the camera. Needless to say, I returned the camera and plan to get a different brand.", "Date": "January 17, 2010"}, {"Title": "Point and Shoot", "Author": "Jared Schaffer", "ReviewID": "RJOHCAVDV7FCD", "Overall": "2.0", "Content": "The camera came in good condition, yet just the overall design of this camera seems flimsy, the touch screen is merely 3 dots you can touch. I understand this camera is old stock and may be slightly outdated, but it is not what I thought.", "Date": "November 13, 2012"}, {"Title": "good camera", "Author": "drumels", "ReviewID": "R1SLKBUCWCISHS", "Overall": "4.0", "Content": "I have a grandson who is just 3 but love electronics.  We took a chance and got a real camera.  He has not put it down for 3 days.  His pics may not be the best but it was the best present for him.  His dad likes it also and is using it some, when he can get his hands on it.", "Date": "December 30, 2010"}, {"Title": "Poor image quality", "Author": "Tom", "ReviewID": "R1G2AU3O8U7AU", "Overall": "2.0", "Content": "This camera is a faily simple point and shoot with a nice battery life, but it's all downhill from there. The LCD screen is terrible quality, which I wouldn't mind if the pictures still came out good. However, when put onto the computer the image quality is only mediocre. The 8.1 MP is only a gimmick to get consumers to buy this, as to I later found out that the lens of the camera cannot even support this quality. I have an old 1 MP camera that seems to take about the same quality pictures. I would only buy this if it is a child's first camera or something like that. Otherwise, I would not reccomend this, especially if you plan to use it for taking pictures of landscape, or anything you want good quality.", "Date": "May 18, 2010"}, {"Title": "Poor image quality", "Author": "Tom", "ReviewID": "R7T9B3185G5OH", "Overall": "2.0", "Content": "You get what you pay for. The image quality is poor on this camera despite it being 8MP. I took a picture of a tree across my yard and the leaves almost blurred together. I would only get this if it is a first camera for someone and they do not care if the images come out all that great. I ended up returning this.", "Date": "May 19, 2010"}, {"Title": "just ok,", "Author": "krob", "ReviewID": "R5AUTNKZVDCQ", "Overall": "3.0", "Content": "this is just ok, just your average point and shoot, nothing special, ok for the price, but next time I will spend the extra money for a more quality camera", "Date": "May 17, 2014"}, {"Title": "Disappointment with purchase", "Author": "Patricia Sidote", "ReviewID": "R2HVEE8EKKQGKA", "Overall": "1.0", "Content": "The battery that came with the camera is defective as it does not hold a charge and consequently the camera will not turn on.  Tried charging the battery for 72 hours.", "Date": "February 28, 2014"}, {"Title": "Perfect", "Author": "Vicki Larson", "ReviewID": "RQYL783RS16RJ", "Overall": "5.0", "Content": "This camera if perfect for our needs.  Using the usb to charge is so convenient.  We will buy this camera again.Vicki", "Date": "August 12, 2013"}, {"Title": "Meh.", "Author": "Melody M.", "ReviewID": "R3RFWQS2MN2802", "Overall": "3.0", "Content": "I got this camera for christmas about 2 years ago. Its not wanting to turn on for me anymore, even when it should be fully charged. May just be the battery, but oh well. I am in the market for a new one anyway. This is an OK camera, but if you're wanting really nice looking photos of up close objects or people- then it'll leave you unsatisfied.This is a great starter camera for a young, clumsy teen. It's cheap, so no tears shed if it gets broken or wet. It takes decent pictures, nothing to write to home about. Sometimes they come out grainy if the lighting is too low, and although the flash is very bright- its very slow. This is great for outdoors though where you don't need a flash, and the touchscreen buttons on the side of the viewing screen worked well. The shutter time between photos can get annoying if you're trying to take continuous photos. And the battery takes about 2 hours to charge for me when I plugged it up to my comp.Overall, if you're looking for an inexpensive camera to take OK quality photos (mainly outdoors, mind you)- then this is a good buy. If you want really clear close ups or indoor photos, then I suggest investing a little more and shopping around more.", "Date": "April 8, 2013"}, {"Title": "Xmas Present", "Author": "Cyndie", "ReviewID": "R3BTO7QLQF3OXW", "Overall": "5.0", "Content": "My Mom was introduced to the computer and is now better at maneuvering around than I am!!!  Decided to expand her technical knowledge by adding a camera. She hasn't used it very much, but in time, and with some training, I think she'll embrace it like she did the computer!!!", "Date": "February 7, 2013"}, {"Title": "No sound, but not so bad pics with flash", "Author": "autum", "ReviewID": "RQTAUP3O0GFI2", "Overall": "3.0", "Content": "Bought this for my 10 year. This was rather a quick purchase and it is her first camera. She likes it but we were both surprised in the end that there was no audio. How do you put it on youtube without audio unless you have to buy an external mic. I have not checked out to see if there is that option either. Oh well I learned my lesson. Pictures with flash came out alright.", "Date": "September 7, 2011"}, {"Title": "No audio?", "Author": "beastiesmom", "ReviewID": "R3PWDSGKW995TC", "Overall": "1.0", "Content": "I bought this camera for our son for Christmas particularly because of its programs for Facebook, etc. He has been struggling since then, trying to record videos of himself and friends. Imagine my surprise while doing research for troubleshooting, that this camera has no audio function! Even the video mode on my cheapo phone provides audio! What a waste and it's too late to return it now!", "Date": "January 24, 2010"}], "ProductInfo": {"Price": "$89.99", "Features": "8.1 MEGAPIXEL RESOLUTION\n2.4 Inch screen\n8x digital zoom\nSD card support up to 8 GB\nTouch screen - Face and smile detection", "Name": "Vivitar ViviCam 8025 - Digital camera - compact - 8.1 Mpix - supported memory: SD, SDHC - red", "ImgURL": "http://ecx.images-amazon.com/images/I/51PiN-C6QFL._SY300_.jpg", "ProductID": "B002BWWRCE"}}