{"Reviews": [{"Title": "Nikon D3000", "Author": "J. Martin", "ReviewID": "R3PHTX2XS5OF11", "Overall": "5.0", "Content": "This is a great Digital Camera. I own the Nikon D80 and wanted to get a DSLR for my wife as she has been interested in photography.This camera is a little smaller and very easy to use. We really enjoy the on screen programing on the back of the camera. The D3000 does not come with the live view but that really does not make a difference as if you are taking real photos you want to use the viewfinder and not live view. The quality of the picture are very good and very comparable to the D80. We like the ease of use and the best part is that the lens are interchangeable so we did not have to go out and spend a $1000 on new lens. If you really want a great camera that will work for most amateur or semi pros this is a great camera. It takes great pictures, easy to use and is very fast. It size really makes it a very easy to carry around too. Battery life is incredible, over 600 shots outside. I actually find myself using it more that my D80 when I am just running around taking shots.", "Date": "January 31, 2010"}, {"Title": "Great for beginners", "Author": "cKat609", "ReviewID": "RWTQ94RZYHQGW", "Overall": "5.0", "Content": "I purchased this item but never got it.  I had to go out and buy it at a local store... but that's another story.I have to say, this camera is a great introduction DSLR for people who want to get into photography but don't have that much or any experience taking photographs and don't want to get a second mortgage to buy a new camera.Sure, there are bigger and better cameras out there but this one has pretty much everything a newbie could/would ever need.  I would suggest spending some extra cash on better optics before a bigger camera.  A good lens is a good investment since you can use it with your new camera if and when you decide to upgrade to a bigger camera (i.e. D300 or D700).Long story short... if you're just starting in photography or upgrading from a point and shoot... this is your best bet.  If y", "Date": "April 14, 2010"}, {"Title": "great camera", "Author": "Spencer", "ReviewID": "R3TQOVQ0ZZAQ6Y", "Overall": "5.0", "Content": "The Nikon D3000 body is exactly as described.  It is a replacement for one my older child has claimed.  It is simple to use, and the quality is excellent.Without a doubt, the service I got from HMB was absolutely the finest, fastest, most amazing I have ever had.  My shipment arrived four days before I believed reasonable or even possible.  Rarely have I ever received such fabulous attention to my order.  How you can possibly give such splendid service is amazing.  Well done!Spencer Garrard; Columbus, GA", "Date": "July 6, 2012"}, {"Title": "A Superb Camera (Pix Inlcuded Above)", "Author": "Sherry Louise Peck \"CoverGurl1982\"", "ReviewID": "R3UCNXKWUIZXZ4", "Overall": "5.0", "Content": "I am inlove with my Nikon D3000. I use it for everything, I mean everything. lol. I have loaded several pix above & have added notes to them to explain the features. ENJOY!", "Date": "February 3, 2012"}, {"Title": "Great buy & fast service", "Author": "BoysX4", "ReviewID": "R27GDUWFJ0DY62", "Overall": "5.0", "Content": "The camera came very quickly and in time for Christmas which I wasn't expecting! It was in very good condition as described and we are very pleased with the whole transaction!", "Date": "January 21, 2011"}, {"Title": "Nikon D3000", "Author": "R. Garrard", "ReviewID": "R1EVMYU9CE97MJ", "Overall": "4.0", "Content": "Definitely an improvement over the D40.  The sensor cleaning is a great addition.  A fine camera without a surfeit of unneeded features.  I recommend strongly.", "Date": "June 7, 2010"}, {"Title": "No autofocus with a 50mm 1.8D AF lens", "Author": "James McWilliams", "ReviewID": "R3E9167X1RHO20", "Overall": "3.0", "Content": "I bought the Nikon D3000 body to use with a 50mm 1.8D Nikkor AF lens because I expected to get better pictures in low light with the 1.8.  I was unpleasantly surprised to learn that the 1.8, which is labeled an autofocus lens, will not autofocus on the D3000 body because the D3000 does not have a built-in autofocus motor.  The reason for this omission, I was told, is to make the D3000 body more compact.The designers at Nikon are undoubtedly aware of this omission, but I suspect a lot of D3000 purchasers are not.  Buyers who purchase the kit lens and other lenses with built-in autofocus motors won't notice this problem unless they try to attach a lens that does not have built-in autofocus.Though I had it only a couple of days, the D3000 body seemed solid to me, and I liked the way the shutter speed, f-stop, and other information were displayed on the LCD screen prior to taking a photograph, but anyone buying this camera should be aware that it autofocuses only with lenses that have a built-in autofocus motor, and there are a number of Nikon and Nikon-mount lenses that do not have this feature.I returned the D3000 body and am looking to purchase a compact digital SLR that autofocuses with all autofocus lenses.  Because the D3000 does not, I cannot give it more than three stars.", "Date": "April 24, 2010"}, {"Title": "It is NOT a CMOS sensor", "Author": "DJO", "ReviewID": "R1L0MYI859LBVE", "Overall": "4.0", "Content": "This camera has the CCD sensor, NOT CMOS as claimed in the amazon description. I owned this camera, sold it and moved to the D3100 with a cmos sensor. The D3000 went with me to Europe and other vacation spots and I was very happy with the results. It's a fine entry level camera, and considering the negative reviews it gets, you can probably get it at a bargain price! Just have fun with it. Don't obsess over all the tech nonsense!", "Date": "January 29, 2013"}, {"Title": "Back up camera", "Author": "Laura L. Mongold", "ReviewID": "R3SGE5CJEGFP4H", "Overall": "5.0", "Content": "1st camera- the spring on the card doesn't always work - I purchased this camera as a back up and am glad.  I love my Nikon!  Now I no longer take the sd card out anymore and I download photos straight to the computer.", "Date": "January 19, 2014"}, {"Title": "Perfect", "Author": "Weight", "ReviewID": "R1ZN4L61YQALJ0", "Overall": "4.0", "Content": "Met the description. Met my expectations. Seller very helpful. Everything was in perfect condition with all contents as detailed in the posting", "Date": "December 25, 2013"}, {"Title": "cam in good time.", "Author": "wellm", "ReviewID": "R29I5B20JP80FQ", "Overall": "4.0", "Content": "so far I really like this product. and the price was soo good. can take pics one after another. thanks", "Date": "September 6, 2013"}, {"Title": "Lack of monitor use in framing pictures", "Author": "Jim Poling", "ReviewID": "R31MADLAICXFS4", "Overall": "4.0", "Content": "I like the camera, but I am disappointed that the monitor can not be used to frame pictures. I like using the viewfinder but there are situations where the monitor capability would be helpful. With this camera, the monitor can only be used to view pictures.", "Date": "August 29, 2013"}, {"Title": "Excellent value and quallity.", "Author": "Steve Haviaras", "ReviewID": "RC6X13Y2M7QTT", "Overall": "5.0", "Content": "I'm a big fan of Nikon and am always on the look out for good deals and upgrades.The camera I chose exceeded my expectations for a lower end model since I'm teaching my grandkids about photography.I already had Nokor lenses since I have two other Nikon cameras.", "Date": "August 21, 2013"}, {"Title": "love the product", "Author": "michael", "ReviewID": "RJPPEBGR5G6QI", "Overall": "5.0", "Content": "love the product have had it for 4 months now and and no problems and it an overall great camera but be warned it does not have an auto-focus in the camera meaning you will have to but AF-S lenses meaning regular AF lenses will have to be Manuely focused", "Date": "August 13, 2013"}, {"Title": "A great buy", "Author": "D. C. Norheim \"Danielle\"", "ReviewID": "R1ARO8793Z6NOO", "Overall": "5.0", "Content": "Great camera, it's my 2nd of this model and makes for a great backup so I don't need to switch lenses all of the time.", "Date": "July 19, 2013"}, {"Title": "Another great Nikon product", "Author": "Tom", "ReviewID": "R391CJO9CI9RRY", "Overall": "5.0", "Content": "For a \"lower-end\" DSLR, this camera takes great pictures and has a lot of features and capability.  I know this isn't a pro-grade, beat it to death every day on the road camera, but it will likely have more features than the average owner will use and last longer than they want. (Makes it harder to justify getting s new model)  ;-)", "Date": "January 2, 2013"}, {"Title": "The D3000 is barely more advanced than the D40...", "Author": "Victoria \"Vikki K.\"", "ReviewID": "R3UNSRFKXWISUO", "Overall": "1.0", "Content": "Every company comes out with a loser and this was the one from Nikon.  Not good when it was new.  Problems fixed on the D3100 --- well worth the $100 - $150 more.", "Date": "August 16, 2012"}, {"Title": "Not exactly what I expected", "Author": "Ana Patterson", "ReviewID": "RLFEODRDOJJTH", "Overall": "3.0", "Content": "While there was nothing deceptive in the description of the camera, being a camera novice, I did not understand that it did not even come with the most basic of lenses.  Meaning the camera I bought was unusable without purchasing a separate lens.  It was still a good price, and I was able to find a lens at a reasonable price, so it worked out in the end; however, for those like me, it should be included in the description that the camera was unusable as it was sold.", "Date": "February 26, 2013"}], "ProductInfo": {"Price": "$413.28", "Features": "10.2-megapixel DX-format CMOS image sensor - Nikon's 10.2 megapixel DX-format CMOS imaging sensor coupled with Nikon's industry\nContinuous shooting as fast as 3 frames per second - Combined with fast power-up and split-second shutter response\nBright and sharp, the D3000's 3.0-in., approximately 230k-dot TFT LCD monitor ensures comfortable viewing when playing back photos\nThe D3000's normal ISO range extends from ISO 100 to 1600, allowing for superior shooting in low-light conditions", "Name": "Nikon D3000 10.2MP Digital SLR Camera Body Only", "ImgURL": "http://ecx.images-amazon.com/images/I/41ew3MVq9QL._SY300_.jpg", "ProductID": "B002P8CZ3A"}}