{"Reviews": [{"Title": "Regret", "Author": "Carlos", "ReviewID": "RR5A6PE2L44QO", "Overall": "1.0", "Content": "I regret that there were no reviews for this camera when I purchased it. I later tracked down some reviews from the internet and they were all negative. I have to add to this list. I know this camera is cheap and my expectations were low but, this camera is a complete waste of money. Pictures taken indoors appear like they were taken in a cave at night with no moon. It consumes battery life at a rate that I have never seen before. I rely quite a bit on customer reviews to make my purchases so I hope this helps.", "Date": "March 22, 2011"}, {"Title": "Not worth the money.", "Author": "Dainyel13", "ReviewID": "R2N2IOCIKFG46T", "Overall": "1.0", "Content": "Camera does not have a flash and can only take pictures in extreme sunlight.  Not worth the money only good for children.", "Date": "July 11, 2011"}, {"Title": "not even good for kids - worthless", "Author": "K. Shankey", "ReviewID": "R1N901SY9N18GF", "Overall": "1.0", "Content": "This camera is a complete waste of money.  I purchased it at the last minute so my son could take pictures at camp, and he was so disappointed, as very few pics turned out.  It supposedly has a video feature, but the video is even worse than the pictures, and there is no audio.  Please don't waste your money.", "Date": "July 13, 2011"}, {"Title": "Vivitar", "Author": "EMILY THOMAS", "ReviewID": "R3110S6LJ1CRWL", "Overall": "3.0", "Content": "This camera wasn't what I expect the picture quality wasn't good at all and picture didn't not come out clear", "Date": "December 6, 2012"}, {"Title": "Nice for the Price.", "Author": "Beetlegeise", "ReviewID": "R1ZCXIWR0XOVHP", "Overall": "4.0", "Content": "Wish the pixel rate was higher, but turned out to be a very neat camera.  Was a gift, and the owner is very happy with it.", "Date": "January 8, 2014"}, {"Title": "vivitar", "Author": "Cammi/Horse Lover", "ReviewID": "R3DXT1WK9J8WEX", "Overall": "3.0", "Content": "For me vivitar isn't good. But my daughter won this camera from treasure island, a game room in florida it, was okay. It was cool that you could do affects with it, and take videos but the videos don't have sound which would be nice. The camera also doesn't have a flash.Later that year my daughter brought the camera on a school field trip to St. Mary's. on that day it was raining and cold but there the camera got a single drop on it and it ruined it completely. Keep it away from water. Unless you are looking for an inexpensive camera for a small child I wouldn't get this. I also bought another vivitar camera from amazon that was better but it was waterproof which helped a lot.", "Date": "June 18, 2012"}], "ProductInfo": {"Price": "$29.99", "Features": "5.1 MP\n1.5\" Preview Screen\nVivitar Experience Software", "Name": "Vivitar 5.1MP Camera with 1.5-Inch Preview (VS57G-TA)", "ImgURL": "http://ecx.images-amazon.com/images/I/41eE-6BfOCL._SY300_.jpg", "ProductID": "B002KUXE5Q"}}