{"Reviews": [{"Title": "Great..", "Author": "Rob \"NEVER SEARCH ALONE\"", "ReviewID": "R1LNSKK2FY6AQ0", "Overall": "4.0", "Content": "It works a lot better than my old QSD004.  I have it all configured and port forwarded to my Internet IP with its on port.  I can view it from the Net anywhere I wish and can control the settings.  One thing I did notice is the web manager interface uses ACTIVEX, which was a pain is the *** at first.  Im a big firefox fan and use that browser..so now i have to use explorer to view my system.  I bought a very cheap 500gb sata drive for this at newegg for 40 bucks. Good system for the price and lots of features.  I recommend it, would have got 5 stars but email setup seems not to be functional at this time..see below.Con: I can not get the Email Setup for motion detection to work at all, I have tried over and over, everything is configured correctly. It just doesnt work..I'll update later if this changes.UPDATE: I just upgraded the firmware also, It gives a lot of options to view view smartphone..mine was an android.  It works with my android phone great using the A-see app from the market on an android device.  Okay..heres the bad news.. the firmware seems to have messed up the EMAIL notification..Buzzer sounds wont work anymore also.. My father has this model..we both have contact QSEE to find out if the problem will be resolved..but as some of the other posts on here..Their CS SUCKS... it used to be great when I had a previous model..but we got no answers..no returns AND still have a defective product with certain features not working...I've tried reflashing the same firmware again but have the same results in NO functionality with those features.....  So the firmware has a plus for mobile phones but then negative and taking away needed features....I'm about to go to a new brand of product perhaps when I look again for a newer one next year.Good Luck..last post.UPDATED!!!! Feb 2011..Update on this item, I upgraded the firmware to the latest..when I did the email and buzzer stopped working.. I contacted customer service which actually upgraded the firmware in two weeks and posted it on there website with the fix from my problem. I was very impressed with what they did just from my problem. The email function works..but the buzzer doesnt still. I hardly ever use the buzzer function anyhow, this might be actually a device problem without the firmware upgrade i believe. I am not to worried with that fix as much as the email. I am updating this to give you more of an idea of how it has performed.. Also one other things.. when you have a residence with numerous trees outside which move or leaves..if you turn up the brightness on the the dvr for that camera..it filters out the movement and still gets any motion such as a person without false alarms. A little personal hack I found messing with the settings. :) Until later... :)", "Date": "January 25, 2010"}, {"Title": "I really like this DVR.", "Author": "DS", "ReviewID": "R29NO9Y9ZD5JS1", "Overall": "5.0", "Content": "I bought this dvr to replace my dvr that died after 4 years of continuous use.. This unit runs 4 cameras which is plenty for me. I did some research for ease and  price and this unit stood out.All 4 cameras hook up easily and I had a picture up rather quickly. I did have to contact support because the directions were not specific enough for me to understand on how to make each camera work on motion only. When I first started up the dvr everything was being recorded. They were quick to answer with a email with directions i totally understood. So beside that little snafu everything went pretty well.I have not connected it to the internet as of yet. That is next on my list. When I get time to do it I will repost my experience with that.OH, one last thing the dvr has like a rubber coating on it. Its great for not slipping out of your hands but Im not sure about dusting it. I live in a horse town with  so much dirt and dust everywhere. Its smooth but not like dust metal.", "Date": "August 20, 2010"}, {"Title": "worst customer service possible", "Author": "Gregory P. Stewart", "ReviewID": "R16FODULVSRUIY", "Overall": "1.0", "Content": "Did a firmware upgrade and it bricked the DVR.I copy pasted my live chat conversation with these folks but Amazon wouldn't post it. Suffice it to say that I was on hold for half an hour while I would occasionally hear such silliness as....\"The System is slow today\" or \"I'm getting that information from another co-worker\".They would never come back on the phone after I got connected, or it would ring once and just go dead. I was finally able to get an RMA but they \"forgot\" to send a shipping label. The DVR was one week old.I googled their customer service reputation and it was not good.I returned it to the retail store where I bought it. I ended paying 30 bucks to do so.I will say that before the upgrade the system worked great, but I needed the ability to view my cameras remotely through a Droid phone so I needed the new firmware. I build computers so a firmware upgrade is something I'm extremely comfortable performing.Good product till you need service.", "Date": "September 23, 2010"}, {"Title": "Works Great", "Author": "Frank J. Miller", "ReviewID": "R1A7RLZ2Y2TPWI", "Overall": "5.0", "Content": "Got unit in 3 days. Great service from Amazon...Easy to plug in.The one question I could not find anywhere in the maunal, or on line, was how long will it record for with the 320 ghz that is installed.OK here is it.  About  332 hours,with cid recording. I know someone else  has been wondering.Easy to use, Does everything my old lorex dvd unit does not. Easy to search.I was not able to get the motion detection to work, but it could be me,or my camera's quality, and I have never seen it work on any of the other stuff I have that have the same feature.Probably useless where I live with leaves, dirt, bugs, stuff being moved by the wind.No loss.Frank", "Date": "January 12, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Advanced H.264 Video Compression\nCIF Real-Time Recording per Channel (Record & Display at 120/120 FPS)\nStream Live Video Directly to a remote PC, iPhone, or other Supported Smartphone Running Windows Mobile Pro\nConveniently Backup to USB Flash Drive or USB Hard Drive\nPre-Installed 320GB Hard Drive; DVR Supports up to 4 Security Cameras", "Name": "Q-See QSDR04RTC-320 4 Channel H.264 Real-Time Security DVR", "ImgURL": "http://ecx.images-amazon.com/images/I/31X40pcFIJL._SX300_.jpg", "ProductID": "B002VLYJVM"}}