{"Reviews": [{"Title": "Easy camera to use, nice pictures- when it works", "Author": "T. Wise", "ReviewID": "R16J7KT45Y76KS", "Overall": "2.0", "Content": "I have two daughters, 5 and 8, who really wanted a \"real\" camera for Christmas; so, I picked up a blue and a pink version of this camera, on sale for $59.99 from [...]. This camera normally sells for $99.99The cameras were very cute and girly enough, although the blue is darker than pictured and would be suitable for a boy.Out of the box, the camera is ready to use. It comes with batteries, wrist strap, usb and software. We never ended up using the usb or the software. We popped in a SD card that we had lying around and the girls were off taking pictures of everything imaginable.The menu was very basic and easy to figure out. I didn't even read the instructions until we started having issues. There are 2 menu modes, simple and one that is slightly less simple but, still... simple. I basically set the date and time and set the picture quality to \"super fine\" which is the highest quality there is. I also turned off the picture preview. Everything else I left at factory settings.About 10 minutes after taking hundreds of pictures, daughter 1 brings me the blue camera and says it isn't working. The camera won't turn on. I had read a few reviews that said this camera ate batteries so I changed the batteries and it started working again. I felt dread in the pit of my stomach if battery life was only 10 to 15 minutes. I plugged in the charger. Meanwhile, daughter 2 had no issues with her batteries dying in the pink camera.It wasn't long before daughter 1 was back with the blue camera, upset that it isn't working. Whenever we tried to turn it on, it beeped 3 times and shut off. It was very frustrating. Meanwhile, pink camera is still going strong so I thought it might only be this one camera or some sort of blue cam malfunction. We put it up for awhile and I break out the users manual, which says basically nothing and doesn't even address a 3 beep and powering off issue, and then I try to google it and at some point, I see that her camera lens has not retracted and so I gently forced it to go back in. That seemed to be the magical fix, temporarily. The camera turned on and took many more pictures.As an aside, I noticed that her LCD screen had all sorts of menu and settings icons that my other daughters camera did not have displayed. I checked all the menu settings and they were identical and so I tried to reset the camera in the menu and that cleared it for a short while but then they were back. I have no idea why. It didn't affect camera usability but it annoyed me.It wasn't long before the camera would not turn on at all. I thought this time it might be the batteries, never certain that the first time we changed the batteries was actually necessary, and changing them did not help. But after sitting for like, 10 minutes or so, it would turn on, take a few pictures and then not work again. Eventually, the pink camera had the same issues with not turning on when you tried but eventually coming on after many rests and attempts. I came to the conclusion that this camera was highly sensitive and that probably the particular blue one we purchased was malfunctioning.That said, if you have a lot of patience or it might not be heavily used or relied upon, this isn't a horrible camera as far as ease of use and picture quality. I read several reviews that mentioned horrible picture quality but almost every picture my kids took came out very nicely on my computer display. And these are wiggly, jiggly, unsteady handed kids who were excited and running every which way and many in low light situations. They were demonstrating the very meaning of point-and-shoot.This camera also takes short videos. The quality of which is good enough for a little kid and the max length which is no less than 42 seconds.The battery life was not actually as bad as I originally thought. The original batteries lasted in the pink camera until we returned them both today, Monday. My kids opened them on Christmas. They were used, with flash, as much as they possibly could be when working properly.The internal memory only holds 6 pictures so I recommend an SD card.As for ease- I'm not kidding when I say my 5 year old mastered this is less than 10 minutes and this is her very first mechanical or electronic anything, ever. She has no prior experience with any sort of device.There is no viewfinder which was neither a positive or a negative for either of us. I don't use the view finder, ever, on my own 2 very nice cameras and for a kid starter camera, it just wasn't an issue for us. The LCD was nice enough.I never would pay $100 for this camera. I really wanted to like this camera a lot but it was just too 'sensitive' and unreliable for me or my girls. They are serious about their photography, it seems, and this would not work for us. Too bad because it would be a great starter camera for a young kid. If you have a kid who doesn't care so much or money to blow if it's on sale- it's not horrible.I also can't speak for durability. We simply didn't own it long enough (3 days) to see if it would withstand a good child-size beating. My girls are pretty thoughtful of their things and while I'm sure in time it would have taken a beating, being that it already has 'sensitivity' issues, it might not be so durable.This camera didn't have many reviews when I bought it and the ones it got were mixed but better than any other comparable camera which is why I gave it a shot. We took ours back today and exchanged it for a a Fujifilm J38. We paid $89 for it on sale so I am hoping we have better experience with it.", "Date": "December 28, 2009"}, {"Title": "Great for kids or backup camera", "Author": "raviendha", "ReviewID": "R1H6JSQZB5UQKL", "Overall": "4.0", "Content": "I bought the pink Insignia for my daughter when she was 6 and was very impressed with the quality for the price. And the battery life was great. At first I put the camera on the lowest resolution to conserve batteries. She probably took over 400 pics before they died. I was not able to gauge the picture quality at this point because her photos were of her dad's work boot, the ceiling fan, the dog's tail, her tongue, etc. (The artistic eye of a 6 year old I guess!)A couple of months later we went to the zoo and I decided to take this camera instead of my bigger/heavier Nikon D40. I put in new batteries, bumped up the resolution to the highest setting and was really, really impressed. Not the top of the line quality but for such a cheap camera I was surprised at how well they turned out! Even at the highest setting the batteries lasted for a couple hundred photos. When I did not want to risk my more expensive and heavy SLR we took the Insignia. I really loved taking it to places like Six Flags. I popped it into a Ziploc bag (to protect it on the water rides) and away we went!The camera was also fairly tough. I dropped it on the laminate flooring once from about 3 feet and it held up well. Unfortunately, my daughter dropped the camera on the asphalt and the LCD screen cracked. And, like all inexpensive cameras, it has no viewfinder so was a total loss.As I mentioned in my title, it is a nice camera for a kid or if you are just looking for a cheap 2nd camera. My daughter and I are both getting cameras this Christmas (I'm upgrading to the D90) and I will probably buy this camera for her again.", "Date": "July 26, 2010"}, {"Title": "Not Great", "Author": "Steve Schneider Sr.", "ReviewID": "RCZLJMQA1MA2R", "Overall": "3.0", "Content": "If you want a camera for a kid and don't care if it gets broke then this is an okay product.  I suggest getting rechargeable batteries because you will go through a lot of batteries.  The screen broke within a month.  It was a good price just wish it would have lasted.", "Date": "December 10, 2012"}, {"Title": "Perfect", "Author": "Philly Lady", "ReviewID": "R1GNKQB1T96VGG", "Overall": "4.0", "Content": "I really needed a new camera to take photo's of the family and for vactions and this is just enough for me .", "Date": "September 23, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Point & Shoot\n10.0 MP\n3 X Opt Zoom\n4 X Digital Zoom\n2.5\" Screen", "Name": "Insignia NS-DSC10A 10.0 MP Digital Camera - Pink", "ImgURL": "http://ecx.images-amazon.com/images/I/51DN37J5y8L._SY300_.jpg", "ProductID": "B002RJSYWI"}}