{"Reviews": [{"Title": "Total Junk", "Author": "Brenda H. Nelson \"HestiaBHN\"", "ReviewID": "RHQTGGI6AEFHH", "Overall": "1.0", "Content": "I bought one of these at Walmart and it didn't work properly (don't recall the exact problem), but I was able to return it to the store for a second one. However, the new one was as bad as the first--it would never focus properly--always blurry. I tried to return it to the store, but they would not take back the second one.The information in the camera packaging says to call a certain 800 number instead of trying to return it to the store. I have tried this number a few times and they keep you on hold for  ever and then disconnect.The 1 year warrantee says to go to the website for the location of the nearest Vivitar service center and to send the camera there with all packaging materials and a recipt. But there are no service centers listed on the website! I was able to send them an email from there however. We'll see if I get an answer.Next I searched the internet to try and find these \"Avalonian\" service centers--but everyone is searching-- and no one is finding. So I have come to feel that this company is putting out shoddy junk and bogus waranties. I will never buy another Vivitar product and since they are affiliated with Crayola Crayons I have a good mind to boycott Crayola as well.", "Date": "June 5, 2010"}, {"Title": "All fuzzy all the time, or No Christmas Memories for me...", "Author": "Kalina", "ReviewID": "R3V542AW345K8Q", "Overall": "1.0", "Content": "I wasn't expecting miracles with this camera. But, I was thinking it would be an inexpensive way to get some simple snap shot quality pictures of the holidays with my family and friends.Every picture is blurry. I thought it was me. Maybe I have a tremor. So, I set the timer, set the camera on a counter top so there was NO WAY it was shaking. And yet, blurry picture. I got better pictures with a disposable cardboard camera which was expired and on sale at the local drug store for 5.00.The \"users guide\" is a mini pamphlet and of little use but with a little poking around you can find all the menus and functions on the camera. They aren't intuitive really but they aren't completely useless.Sure, it is small and light. Pop in batteries and an SD card (all sold separately) and you are ready to go.But, my mother passed away this year. I really wanted to have some lasting images of the holiday with my dad, the only family I have left. I wish I could invest a hefty chunk of change into a nice digital camera. But I can't. I hoped this would at least get the job done for a few easy pics of cookie making, silly sweaters and morning coffee. It failed. Miserably. I wouldn't even advise this as a kids camera.Sorry Vivitar. This one is trash.", "Date": "December 14, 2009"}, {"Title": "Pure Trash", "Author": "Barbara Swift", "ReviewID": "R1H4SMK3056CK4", "Overall": "1.0", "Content": "I bought two of these cameras at ToysRUS for twins.  They are a piece of junk and ToysRUs refuses to allow us to upgrade them or give us our money back. You cannot get a decent picture indoors. The color is far off and the pictures are blurry.  Don't waste your money  on this camera.  AND DON'T BUY ELECTRONICS AT TOYSRUS AS THEIR RETURN POLICY FORBIDS ANY RETURNS OF OPENED PACKAGES.", "Date": "October 19, 2010"}, {"Title": "Yes, it IS a cheap camera", "Author": "SaberKat", "ReviewID": "R29R0PZH4AZ33O", "Overall": "3.0", "Content": "I'm never sure what is going through people's heads when they write reviews.  However, when I was dispatched by my place of employment to find a cheap camera to use to document incoming freight this seemed to fit the bill.  Purchased at Target alongside a Kodak 2GB SD card I had this thing ready to rock inside of a minute or so.  And I can't say anything bad about it really.My hands shake when I shoot sometimes and it shows, but I am still able to get decent shots with this camera.  The on board flash is workable for close range and I am able to crank off a hundred or so shots before the batteries die.  Keep in mind this thing was bought for around fifty bucks.I personally own a Canon SX120 IS and Canon Digital Rebel T1i, so no this isn't the only digital camera I've ever touched.  There is no comparison, but look at the respective price tags too.If you're just looking for something to toss in your glove box or purse and are not expecting a lot, I recommend this.  If you're wanting a \"real\" camera, you're going to have to pay a little more.", "Date": "October 30, 2010"}, {"Title": "Great Little Camera", "Author": "Lil_Kitten7", "ReviewID": "RJOGY8F1WD7VG", "Overall": "5.0", "Content": "\"Came fast & in good condition.Only one good review,decided to try it anyways.It works very good.Wanted a small cheap digital for my purse.I set anti-shake 1st thing.Taken 30 pic's & they look very good,just like any camera you have to find the right setting for each pic.I have plenty of experience & all camera's very slightly with their settings.For serious pic's I use my Panasonic DMC-FZ28.\"", "Date": "September 16, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002DUWVKC"}}