{"Reviews": [{"Title": "Great POE camera", "Author": "ntsecrets \"mcunning@yahoo.com\"", "ReviewID": "R1SK8KPDY2RDBJ", "Overall": "5.0", "Content": "I bought this and actually installed it outdoors but under a roof.  Works great and the GPIO inputs also work great.  I hooked it up to an ELK doorbell detector so it emails me 3 pictures of someone ringing my doorbell.  I also have it continuously recording to a nas device and its held up for a year and a half with no issues.  It has held up to 0 deg F to 100 deg F.  The only issue I once had was that when it was disconnected for a few minutes and then plugged back in the camera itself didn't operate.  I left it unplugged for a while and it started working.  It uses about 4 watts of POE power.", "Date": "November 28, 2011"}, {"Title": "Domed Internet POE Camera", "Author": "Jim Coppage \"JJC\"", "ReviewID": "ROUQ1JC7E86G1", "Overall": "5.0", "Content": "I ran one cable back to network switch, POE (stands for power over ethernet) assigned an IP address then I could view the camera from any computer, great picture, no sound but they have models with sound, now all I need is 10 more.A very simple solution if you need a surveillance camera.", "Date": "April 25, 2011"}, {"Title": "Works great once you get one that works....", "Author": "Chris Wineinger", "ReviewID": "R1NE2YS5FGA84I", "Overall": "4.0", "Content": "Camera works better than expected once installed but had to RMA it twice before I got one that worked.We import the stills from the camera into a video software so we can watch a day of activity in just minutes.", "Date": "October 7, 2010"}, {"Title": "Poor support of Internet standards and interoperability", "Author": "P. Prindeville \"Internet hacker at large\"", "ReviewID": "R30C4TPK870UWL", "Overall": "2.0", "Content": "I picked up one of these units because the image quality seemed to be decent and the price was right, but I quickly found out that the MPEG4 stream was sent out as multipart fragments, but each fragment was missing the requisite media-type (reported in the Content-Type) necessary to work across my firewall (since my firewall only allows an explicit list of content types through).I contacted Trendnet's technical support, with a thorough bug report including the nature of the problem, the chapter and verse of the Internet standards that clearly dictate what a well-formed stream should look like, and packet traces collected with tcpdump.After several weeks of waiting on them, their help desk keeps reporting \"still waiting on a reply from the engineers\".Apparently tangible customer issues aren't a pressing concern, and given another opportunity to buy this device, I would not repeat my choice to do so.", "Date": "October 16, 2012"}, {"Title": "For the money, you can't go wrong", "Author": "Brad Cummings", "ReviewID": "R29LNLQM25USDJ", "Overall": "5.0", "Content": "The camera does what it states it will do.  For a cheap dome PoE camera, you can't find anything better.  Easy to setup and get going.  Love the fact that it comes with an app for the Android and iPhone to monitor your cameras remotely.  People cannot give this a bad review for manual PTZ...It states that before you bought it!  If you don't need to control PTZ and just need a fixed camera, this is a great product.", "Date": "February 18, 2011"}, {"Title": "We love these cameras - so easy to set up and use", "Author": "Chika", "ReviewID": "R2RTANO8NAQM73", "Overall": "5.0", "Content": "We use them inside and out with no problems. In 4 years we have to reboot them almost never even..... They just work", "Date": "June 28, 2013"}, {"Title": "this one is good.", "Author": "guiaa", "ReviewID": "R2J9Y6RKNXQYXP", "Overall": "4.0", "Content": "after 5 months 24*7 . still running perfectly over POE. and the SecurVIew PRo also is nice app for small office using.", "Date": "June 8, 2013"}, {"Title": "Camera is ok but lacks features", "Author": "Terry J", "ReviewID": "R258ETCWJTS33B", "Overall": "2.0", "Content": "I purchased 2 of these for a restaurant.  The camera does not have the pan capability.  It is a stationary camera that needs to be adjusted manually.  There isn't a pan capability and the zoom capability distorts the image so much that it isn't usable.  The software is pretty easy to use that ships with it but I used it with Windows XP and after 1-2 weeks the pc needed to be rebooted due to the video software not releasing memory correctly.  Overall I will NOT purchase anymore of these cameras.  You get what you pay for when you purchase these cameras.  PS:  The tech support people were very rude on the phone and when I expressed my issues they said too bad and that I was the only one having issues.  Tech support from India, you have to love it.  You might as well sell products as-is no warranty because that is what I received by purchasing this product.", "Date": "October 20, 2012"}, {"Title": "Manual Pan-tilt-zoom", "Author": "RJ", "ReviewID": "R1TXLL97X1B5ZI", "Overall": "3.0", "Content": "This is a PTZ but no motor.  You need to manually tilt, zoom and pan before locking in the position.  Software is not really needed if you are just going to a browser to see camera views.  Camera is solid, though and many input methods if IP is not your preferred method of access.", "Date": "June 16, 2013"}, {"Title": "Overpriced for the performance offered", "Author": "Ted", "ReviewID": "R2PPU6TN3AVQLC", "Overall": "3.0", "Content": "A bit too large, but these IP cams do the job, but at a price that is too high.PROS:Decent enclosureAnalog video out (main reason I bought these)Easy to setup and operateCONS.Price is too high. If they were priced at $140, they would be a good deal.A challenge to mount on some ceiling surfacesImage quality is lacking, colors are washed outPhysically too large when considering the hardware inside", "Date": "May 11, 2013"}, {"Title": "Protect yourself", "Author": "Marcel", "ReviewID": "R1EPT578ZCVZ8", "Overall": "5.0", "Content": "I use it in the garace to take care the from of my house. Good disign, I use only this brand for routers and cameras, because they never have any problems.I would like something like this, but wireless. They have wireless cameras, but domes cameras don't. I wait for it.I sincronize this camera with my iphone and I can check my house everywhere.", "Date": "July 19, 2011"}, {"Title": "Don't buy this camera!", "Author": "R. Sepulveda", "ReviewID": "R1KC1EVKI1L2QU", "Overall": "1.0", "Content": "I spent an entire day trying to get this camera to function.  I finally connected it to a 5ft network cable and it started working.  Put it back on my 40ft cat5 wire and NO WAY would it function.  Don't waste your time on this.", "Date": "December 7, 2012"}, {"Title": "Pan and tilt by hand????", "Author": "Tim Powers", "ReviewID": "R197S19L5XG8MO", "Overall": "1.0", "Content": "The description of this product is very misleading.  Look out for the word \"manual\" because that's the only indication on this product that you literally have to remove the screws from the housing and adjust the pan/tilt by hand.  I don't understand how an IP camera doesn't have the option to control the camera via software.  Stick with the Trendnetip422...that does everything as advertised including pan and tilt using software.", "Date": "October 1, 2010"}, {"Title": "Nice Camera", "Author": "Michael F. Ciferri Jr.", "ReviewID": "R2MP2638P70KDF", "Overall": "3.0", "Content": "But it would not work with my softwear. I have 3 Foscam cameras and this Trednet camera wouuld not play nice with the softwear I was using. Had to return it", "Date": "October 20, 2011"}, {"Title": "Still in the box", "Author": "J. Marietta \"Junwoi\"", "ReviewID": "R3K4ZBCMSL9AGD", "Overall": "4.0", "Content": "I havent had time to mess with it.  But you want a review so the box looks real nice sitting in my closet.", "Date": "November 3, 2011"}], "ProductInfo": {"Price": "$352.00", "Features": "Secure your home or office with high quality dual streaming MPEG-4  and MJPEG video recording with up to 30 frames per second at 640x480 VGA resolution\nComplimentary SecurView software: view and record up to 16 cameras simultaneously (32-bit only)\n3 password protected authorization levels: (1) Guest User: video with one way audio viewing only; (2) General User: Guest User functionality as well as viewing option controls of live view page; (3) Administrator: full management controls\nNo need to install this camera near a power source, power and data are received through a single Ethernet cable\nManually pan 350° side-to-side and tilt 160° up-and-down for a fixed final viewing angle", "Name": "TRENDnet SecurView PoE Dome Network Surveillance Camera, TV-IP252P", "ImgURL": "http://ecx.images-amazon.com/images/I/31rrg9gR94L._SY300_.jpg", "ProductID": "B002OB4A0O"}}