{"Reviews": [{"Title": "Good camera for a point and shoot except...", "Author": "Miyoko", "ReviewID": "RHVHLDWO2YPL4", "Overall": "3.0", "Content": "I'm a creative photographer and like experimenting with photos manually (light, shutter speed, aperture settings etc...) and already have a great DSLR camera. But sometimes it's a little big to carry places where I'd like to be discrete taking pictures.  I was looking for something small and simple to shoot but would also have advantages over my DSLR.After researching point and shoots I narrowed my choices down to the Sony Cybershot DSC-WX1 and Canon S90.  I liked the low-light capability of both cameras since many of the places I would need a small point and shoot would be indoors and in low light.  I decided to try the Sony Cybershot first because it has a \"panoramic sweep\" feature since I shoot a lot of landscape photos and create panoramics in Photoshop. I wasn't happy about having to buy a memory stick since I already have a lot of SD cards.  Delivery of the Sony Cybershot and the memory stick was fast and I received it before the scheduled delivery date.Having read other reviews of the Sony Cybershot I followed their tips for getting better shots and was able to shoot some impressive pictures, comparing them to identical pictures shot with the DSLR in raw.  The Sony Cybershot pictures were almost as detailed and sharp and the DSLR's smaller in print sizes (ie 4\"x6\" and 5\"x7\").  Major differences in quality showed up when the pictures were enlarged.When I used the \"panoramic sweep\" feature I was very disappointed which is why I give the camera 3 stars.  You can't use other exposure settings or the telephoto while in the \"panoramic sweep\" setting, and if you waver the camera slightly while \"sweeping\" the camera won't make the shot.  I had to try many times to \"sweep\" the SF Bay before the camera decided the \"sweep\" was steady enough to shoot (my arms got tired) and even after all that, the lines in the picture (horizon line, Golden Gate bridge) were crooked where the pictures were \"stitched\" or I wavered.  You NEED a tripod when using this feature.  I took several shots at the same location with the DSLR and \"stiched\" them together in Photoshop that turned out WAY better.Since the \"panoramic sweep\" was one of the reasons I bought this camera, I returned it and ordered the Canon S90 which I am extremely happy with.  The Canon S90 has manual controls, RAW, and the while using the \"stitch\" feature you can use other settings, like telephoto and white balance.For a point and shoot camera overall (except for the \"panoramic sweep\"), the Sony Cybershot DSC-WX1 seemed to be a great camera and was very easy to use.", "Date": "April 19, 2010"}, {"Title": "New camera", "Author": "A. Cooper \"Constant Reader\"", "ReviewID": "R3C4FD3KIH873", "Overall": "5.0", "Content": "Bought this for my wife to replace a five year old Sony she had. The camera works perfectly and takes amazing pictures. It has a lot of options but overall is very easy to use. Takes great low light pictures with very good clarity. Simple to download to the computer and we really like that the battery is charged outside of the camera. To date no complaints.", "Date": "November 2, 2010"}, {"Title": "awesome camera", "Author": "t man", "ReviewID": "R3IOMA34LJ84PI", "Overall": "5.0", "Content": "i bought this as a replacement to my sony w570 which my friend dropped at a house party and stopped working. this take pictures fast, compared to my old one which you had to wait for 2 flashes lol . alil bit bulky compared to my old camera. but i like it plus its sony G lense so you know its one of sony's best lenses, it only takes sony memory stick so sadly my sd from previous camera has become useless. not a photographer but been playing around with it and so far no complaints.", "Date": "February 15, 2012"}, {"Title": "Great camera", "Author": "Dko3030", "ReviewID": "R1F0D6FD9E6P0M", "Overall": "5.0", "Content": "You can't beat the value and ease of use for this camera. It produces pictures with great color and clarity that rivals many entry level SLRs. Good for a wonderful point and shoot. My wife loves this camera.", "Date": "March 7, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002KKBT58"}}