{"Reviews": [{"Title": "Great camera, great value", "Author": "Sky Greene \"Sky\"", "ReviewID": "R1GWWF2BB5C2SP", "Overall": "5.0", "Content": "This Vivitar Camera is not only easy to use and easy to handle, as its light weight and fits nicely in your hand, but picture taking is truly up to par with much more expensive cameras.  Whether you zoom in or out, or whatever the setting you find yourself in, you can count on this camera to take vivid, quality pics.  I highly recommend it.", "Date": "July 6, 2010"}, {"Title": "Great Deal", "Author": "admiretechnolgies", "ReviewID": "R3HURIHXXSJBGZ", "Overall": "5.0", "Content": "The camera is a great value. Not a lot of features but great for decent resolution pictures and doesn't eat up the memory in the SD card.", "Date": "November 13, 2011"}, {"Title": "Worthless Junk **** DO NOT BUY***", "Author": "Anthony D. Delmar \"Satrn8\"", "ReviewID": "R2URLXM2VWQBE9", "Overall": "1.0", "Content": "The Vivitar 8018 takes horrible pictures because most of the pictures were blurry and there was very faint color. The \"color\" pictures were  in Black in white and they came out too bright even though I lowered the Brightness settings. My 2 MP Camera on my phone takes better pictures than this. It uses 3 AAA batteries which the camera has a very short battery life. I used the camera for about two hours and the next day it was dead.  The camera says it Zoom at 8X but it doesn't have an actual one. Bottom line: Save your Money and Don't buy this Camera!", "Date": "April 18, 2010"}, {"Title": "Did not like", "Author": "Arthur Lozano", "ReviewID": "R70XATVUC1ZOU", "Overall": "2.0", "Content": "Don't know if its me or the camera.  I was not able to work the flash correctly.  Many of the pictures were burry after taking them.  I just did not like the camera at all.  I still have it but don't use it.", "Date": "November 16, 2012"}, {"Title": "Hey Guess What?!?!", "Author": "Kali Zyre \"kalizyre\"", "ReviewID": "R1PE8QXXPTSBMJ", "Overall": "2.0", "Content": "The camera doesn't come with a memory card!!!  So you can't use it right out of the package.  I've always really liked Vivitar cameras, but we're off to a rough start with this one.", "Date": "March 31, 2010"}, {"Title": "VERY poor performance", "Author": "camjunky", "ReviewID": "R1ZPVB6UKPTOYZ", "Overall": "1.0", "Content": "Not even 10 months old. Paid WAY too much from CVS (80.00) in Denver b/c I forgot to pack my camera.This piece of junk does not zoom at all. EVERYTHING is fuzzy, all pics. Terrible colors, terrible pics, would NEVER buy vivtar again.very dissatisfied", "Date": "June 18, 2011"}, {"Title": "Great Simple Camera", "Author": "Miltrane \"M B\"", "ReviewID": "R16X53SH9ADH1J", "Overall": "5.0", "Content": "I like to take pictures but am not technically savy.  The camera takes great pictures even when zooming in.  The phone is slim and can fit in your pocket. While I was originally nervous, this is a great camera", "Date": "July 2, 2010"}], "ProductInfo": {"Price": "$89.99", "Features": "Sd Card Support Up To 8 Gb (Sd Card Not Included)\nMovie Mode; Face And Smile Detection; Red Eye Reduction", "Name": "Vivitar V8018 Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41xF0gIO9GL._SX300_.jpg", "ProductID": "B002DZG84W"}}