{"Reviews": [{"Title": "Awesome (and very unique) camera", "Author": "D. Adams", "ReviewID": "R1USIO15OZ81X5", "Overall": "4.0", "Content": "As soon as I saw this red camera, I absolutely had to have it.  I did tremendous amounts of research to figure out if it was actually worth upgrading from my D40, then ordered it the day it became available on Amazon.  While a few things might have been nicer on the Nikon, this camera is a wonderful upgrade.  If the color isn't enough (this is for the red model if reviews become merged later on), it has some very nice specs to it.  Ability to use essentially any Pentax lens ever made (and auto-focus), ISO 6400, 1/6000 shutter, many built-in imaging features(HDR, filters, color tweaks).  This thing is truly a beast!Body; When I first pulled it from the box, I was a little discouraged.  While it is a well made camera, it does have a much lighter and cheaper feel than the Nikon had.  The over-all fit and finish is fine, but the plastics don't feel as high quality.  Perhaps it's because they're smooth, but it's also just my opinion.  A slight concern, too, is that the red appears to be \"painted\", seeing as the inside of the doors are white.  Overtime there's a chance the color could rub off, but I'm hoping this does not happen.  Materials aside, the camera does have a nice feel.  I have large hands with very long, slim fingers and the grip fits my hands great.  The primary controls are within easy reach, with only a couple odd deviations(such as the flash and green soft-button).The LCD on the back is average.  It's your typical resolution, but works fine for previewing.  Now the viewfinder I find to be more difficult to use than the Nikon.  The focal point does not illuminate, making it both difficult to find and difficult to tell what's being focused.  Also I can't seem to see all the specs in the viewfinder.  I do wear glasses so I can't press my eye right against the eyepiece, but this wasn't a problem with the Nikon.  While this certainly isn't a deal killer, it would be something to keep in mind.Shooting performance is great.  This camera is very fast.  Start up time is essentially instant, focusing is lightning fast and it can take nearly 6FPS at it's peak.  I have found low-light focusing to be a little worse than the Nikon, but that's also because the Pentax lacks an AF assist light.  While it can use the flash, it still isn't quite as accurate as the Nikon and it's little light.Image quality is very nice.  Noise is well controlled under most all ISO settings.  ISO6400 is very usable in average lighting conditions.  But as light decreases, noise becomes more apparent.  Many images from this camera do seem a bit more noisy than other cameras at similar ISO settings, but it still can produce comparable prints.  Colors tend to be on the flat side using default settings, but with insane amounts of tweaks, this can be changed to whatever you please.  White balance is managed very nicely too, with much better auto WB under incandescent lighting than the Nikon (though manual setting is still the best).  The stabilizer works well.  It's not as apparent when taking casual shots, but when using liveview, it is very easy to watch (and hear!) it working.  While still on image quality, the movie mode actually astonished me.  The quality is very sharp.  While this is not a movie camera, the videos produced are supurb.  Just realize AF is disabled and the stabilizer does interfere with the audio.Honest, I suppose my only real complaint about this camera are the batteries.  Why Pentax decided to go with AA's rather than a lithium pack is beyond me...  Aside from being a bit clunky (4 batteries over a single pack) the system is rather buggy.  I have been told the \"batteries are depleted\" but then restart the camera and continue to shoot for hours.  Even after upgrading to firmware 1.1, the battery meter tends to jump around.  If Pentax had gone with a lithium pack, this camera would be perfect 5 stars.So to sum up, if you want a camera somewhere between the Nikon D90 and D5000 that strays away from the \"normal\" brands, this is a camera to consider.--Update--After having the camera for almost a month, I figured I'd post a little update.  I still love the camera.  I've had no problems to speak of.  Pictures are looking very nice; people are always complimenting me on the camera and the photos it takes :)I guess my only real complaints would still be the batteries and the white balance.  The battery meter, as mentioned above, is very off.  But all in all it works well enough to guess how much juice is remaining.  As for the white balance, I've noticed it tends to be a bit more off than the Nikon was.  I have a couple flashes, and it seems to be more-so with the Pentax 360FGZ so I'm not even sure if I should blame the camera or not...These things aside, I'm really loving this camera.  I'm a very difficult person to please but I'm exceptionally happy with my purchase.", "Date": "December 15, 2009"}, {"Title": "such a great ( and unique) DSLR", "Author": "Penny P. \"Penny P.\"", "ReviewID": "R3PNK9PS0FT7DU", "Overall": "5.0", "Content": "While attempting to find a good ,mid range ,entry level DSLR, I stumbled across the pentax K-x. I mean, how could I miss that flashy red color. And after extensive research it wasnt just the red color that attracted me to this camera.First off ,after testing many of the canons and nikons around the k-x's class. ( i.e. canon xsi, t1i, nikon D3000, D5000) I found the pentax much eaiser to pick up and get started. Being a previous canon user myself, the T1i seemed far to intimidating. Right out of the box with the K-x I was able to figure out how to adjust settings and within 15 minutes had some half decent shots.However the only thing that did not seem to make sense to me was the placement of the delete button ( all the way over in left field). My hand has to shift to hit it. Which i suppose is not a bad thing, considering there is something heartless about a delete button on a camera. ( I love film and am stuck in my ways)The feel of this in my hands is almost as good as my 35mm metal body film camera (gasp!)it doesnt feel like a cheap toy. Its solid, as one reviewer had also pointed out.The cross processing feature sold me. I do a lot of cross processing with film , which quickly gets pricey. Although its not film , it pleases me ( and my wallet) that I can now get close results digitally. the digital filters are fun to play around with as well, most notablly: Toy camera , which imatates the 'old school' holgas/diana's that hipsters die for now a days.live view seems a bit noisy to me. I can hear the camera 'think' ( click )when I change settings such as the iso. But , then again , this is the first DSLR that I have owned ...so it could be minor issue.Video quality is superb.and above all the price is right. ( much cheaper than the nikon's and canon's you'll come across in its range)I urge those looking at buying a new dslr to look into the pentax K-X . you wont be dissapointed. PLUS who else has got a RED! camera.win win.", "Date": "December 24, 2009"}, {"Title": "The Pentax K-x is a giant killer!", "Author": "Edgar_in_Indy", "ReviewID": "R19XBB344KTX8I", "Overall": "5.0", "Content": "I recently upgraded from my beloved Olympus e-510 DSLR with the 14-42mm and 40-150mm kits lenses in order to get a DSLR with better low-light performance and HD video capabilities. I loved my Olympus, but image quality took a nose-dive at ISO 800, and I liked the idea of having an HD camcorder built into my camera to capture high quality family photos and home videos in one device. I eventually settled on the Pentax K-x after first buying, and then returning, a Canon T2i.I know that the T2i costs almost twice as much as the K-x, and they're not direct competitors, but I think my experience illustrates what a great camera and bargain the K-x is and how, for me at least, it was a giant killer.I initially pre-ordered a T2i for the $900 MSRP after reading the glowing reviews in the press about the 18MP sensor, the high-ISO performance and the killer 1080p video. When I received the T2i, I was surprised by how cheap and plasticky it felt. It's not that the T2i was likely to fall apart, but my Olympus felt and looked like a higher quality camera, even though it was about $200 less than the T2i when I bought it. I realize that the T2i is a Rebel, but for almost $1000, I expected something more solid.Even worse was the Canon 18-55mm kit lens, which felt like a toy compared to my Olympus kit lenses. It looked cheap, and the zoom action felt very cheap, and you could hear plastic-on-plastic as you zoomed in and out. There was no lens hood included, and the optional lens hood was only about an inch deep and looked ridiculous. The front element rotated when auto-focusing, which makes using some filters problematic, and you had to switch off AF to manually make focus adjustments. My Olympus lenses did not rotate the front element, and allowed full time focus override without turning off AF. And build-wise, they looked and felt like a higher end lens. But worst of all, Canon kits lens's optical performance was lacking, rendering the 18MP sensor moot.I could live with the cheap feel of the T2i body and the ugly jelly-bean design, but I came to realize that in order to get a lens that would match the performance of the body, I would need to shell out another $500 or more, and as a hobbyist I just didn't have the budget.The real deal-breaker with the T2i though, was the use of Quicktime format for the HD video. Quicktime is a proprietary Apple video format, and while I must assume it works well on a new Mac, the QT videos often gave PCs problems. I'd read about this from other users, but I figured that with my high-end PCs and my computer knowledge, I would be okay. But both my new Sony Vaio laptop with Windows 7, ATI 4650 graphics and 4GB of RAM and my desktop computer with Windows XP, dual-core processor, 4GB of RAM, Raptor 10K HDD and nVidia 8800GT graphics would stutter on playback of the 1080p files. And finding affordable programs to edit Quicktime HD video files is another headache. I wasn't about to buy a new Mac just to be able to work with the video from my new camera.So back went the T2i, and my quest for a new camera continued. I was just about to pull the trigger on a Nikon D5000, when I came across the Pentax K-x.The first thing that grabbed my attention was the styling. I thought the red was killer, but I wasn't that brave. And the camera looked dead-sexy in navy blue, but when I saw the white version, I was in love. One thing I liked about my Olympus was that it was something DIFFERENT than all the Nikons and Canon Rebels you see every other parent carrying to school or sports functions. I would often get questions about it from people who didn't realize that Olympus even MADE DSLRs. With this Pentax, I would again have something out of the ordinary.Then I started reading reviews of the K-x. One of the great things about the T2i is the high ISO image quality, and according to the reviews and the sample images I was looking at, the K-x was right there with it.And the K-x also did HD video. There were some limitations, such as 720p and lack of full control over exposure while shooting video, but I didn't really mind since the samples I downloaded looked great, even on my 110\" 1080P home theater projector. And 720p files take less space than 1080p and require less processing power to playback and edit. And best of all, the K-x uses Motion JPEG video format, which plays back great on PCs and is compatible with almost any Windows video editing program. The MJPEG format does use more disk space than the equivalent QT file, but hard drives and SD cards are cheap these days, so it's not a big deal.Another great thing about the K-x is that it has sensor-based image stabilization in the body, so any lens you stick on the camera is stabilized. My Olympus used a similar system, and I was very happy with it. The big advantage is that you can be non-stabilized lenses so they'll be smaller, lighter, and less expensive.I ended up buying the K-x in white with the 18-55mm lens. The K-x looks and feels like a higher quality camera than the T2i, and matches my Olympus in this department. The kit lens is also a very worthy piece of hardware.With the money I saved on the Pentax, I was able to buy the legendary Tamron 28-75mm F2.8 lens, a Pentax 55-300mm zoom lens, and a Sigma speedlight. The flash was new, but I got great deals on the slighty-used lenses on eBay and Craigslist.I've been using the Pentax for a couple months now, and have taken hundreds of pictures. I am absolutely thrilled with the camera and couldn't be happier with the photos and videos I'm getting. The T2i did have just slightly more detail, but other than that I would say the K-x has equal image quality. And the 12MP RAW image files of the K-x are faster to work with than the 18MP files of the T2i and take up much less space on SD cards, so you don't have to worry about filling up nearly as fast.That's not too much negative I can say about the camera. I would like it to have a mini-HDMI port and a standard mini-USB port, and continuous auto-focus would be nice in video mode, but no other DSLR has that yet. Stereo mics would also be nice.I suspect that the image stabilization system may not be as good as the one in my Olympus, but I can't say for sure since my 300mm is longer than the telephoto I had with the Olympus and will therefore be more prone to shake.I get compliments on the Pentax everywhere I go, and it's been a joy to use and own. I could not be happier with my purchase.In the future I'll probably add a Sigma 30mm F1.4 prime and a Sigma 10-20mm ultra-wide zoom to my lens kit.Just for the record, I'm not trying to bash on the T2i. It is an amazing camera that is currently without peer in its price range. But if you're like me and you only have about $1000 to spend, I think you will get much more value by going with a less-expensive but almost-as-capable camera like the K-x, and using the extra money on high quality lenses. My F2.8 constant-aperture lens has been a revolution for me, and I recommend every budding photographer make room in their budget for something similar.", "Date": "May 29, 2010"}, {"Title": "Entry DSLR", "Author": "Digital-Self", "ReviewID": "RLSL6Y2VA33TY", "Overall": "5.0", "Content": "Ok, so this is the first time I have reviewed any camera let alone a DSLR. I find the Pentax KX to be an awesome camera to which it fits all the needs I bought it for. My sons are involved in sports so one of the major reasons I purchased this camera was because of the high ISO rate. I was tired of missing all those great shots of line drives up the middle and photo finish swim meets. I like the 4.7 pics per second feature and actually what I discovered was that it can take pictures faster in better lighting. I can just hold the button down and I can take a snapshot of the baseball in mid air flight and just about every step my son would take running to first base without any blur whatsoever.Another great thing about this camera are the turn dial settings. The Night time setting is incredible in which when you take a picture of someone at night in normal pictures taken with other cameras that I've owned, the faces would be whited out practically and the background would be very dark. With the KX those same type of pictures are near perfect. Faces are clear and properly color balanced and the scenery behind the subject comes in clearly. Background night landscapes and focus point faces are all brilliantly displayed.The most powerful thing I noticed was the macro for super close shots. The first day I got the camera I toyed with this setting and took a close up picture of the back of my hand and wedding band. The picture was so clear and close up, I could see every skin pore and every scratch on my wedding band and looked almost foreign due to the intensity of the close proximity to my hand.I did a lot of research before I purchased this camera. The Nikon had some nice features and so did the Canon and Lumix but when I compared features that I was interested in for the dollar amount the Pentax KX was the best solution. *Tip* If you are looking for a new camera, look for what you will be doing the most of, ie. action shots, night shots, close ups, daytime or whatever it may be and focus your research that way. I focused on those first then worked my way out from there.", "Date": "August 4, 2010"}, {"Title": "Best (and only) Red DSLR", "Author": "Peter H. Kosel \"Pete in Sacramento\"", "ReviewID": "R1ZXBHT02XDBUG", "Overall": "5.0", "Content": "I just got mine this week and have not yet had time to learn how to use all the features but can make some comments immediately on preliminary inspection:1.  I like the build quality better than comparable Canon or Nikon models.  The Pentax seems to have a metal body and has a solid feel while others feel more like plastic.2. The Pentax feels better in my hand and is better adapted to one handed shooting because in front the grip widens just above your ring finger to keep the camera from moving downward and in back there is a gentle ridge on the right hand edge of the camera to rest against your thumb and keep the camera from rotating out of your hand.  These features demonstrate carefuk ergonomic design and just plain make the camera easier to hold one handed.  I recall nothing similar on other cameras I've tried or own.3.  It's red.  It's my xmas present to myself and I find this appropriately festive.  Further, it should make it easier to find in the clutter.  The paint job is not glossy and has a good coefficient of friction, enhancing the ability to hold the camera securely.4. The shutter release button auto-focuses before the shot with very little pressure and little or no perceptible motion.  Final shutter release is accompanied by perceptible tactile feedback.  Cameras from other makers take quite a bit more pressure to autofocus which may result in occasional accidental shutter release.5. The full auto mode is adequate for producing decent pictures in a variety of situations.  One doesn't need to learn all the specialized tricks and features right away.6. The camera insists on asking me what language I speak every time it is turned on.  I realize one camera might have several users but I find this inconvenient.  Maybe there is something somewhere in the settings which will suppress it.7.  The Canon software I am used to using to download and organize photos doesn't seem to work with this Pentax.  That's bad software design and I suspect the blame lies at Canon's door.  Generic MS Windows software works OK for transferring files.As I write there are no other reviews of this red KX; I suggest reading reviews of the black model for further info.", "Date": "December 12, 2009"}, {"Title": "Red K-x DSLR - 2010 - with info on appearance of Red!!", "Author": "CGI", "ReviewID": "R30LJ5YN2X8PFO", "Overall": "5.0", "Content": "Quick note for those considering the red model : the body color is not a deep-rich (marlboro) red or even a brighter-but-stll-rich coca cola red. It is a bright, not fully-saturated red with a slight pinkish tone which becomes more apparent when seen in daylight. It's not bad but maybe the white or orange are cooler : ) The back and side views on the official Pentax site are the most honest - - the other views have been tweaked.As you may or may not surmise, the red model's color is my only mini-gripe with my purchase of this amazing camera : read on for details...--------------------------------------( Early 2010 ) I am a graphic design professional with some prior experience with DSLRs - by no means a master photographer but knowledgeable enough to be able to use my own photography in certain professional settings. Money is tight and so I researched hard to find the best possible deal out there for a strong yet economical DSLR. I feel I have made the right choice. I was able to get going with using this camera within an hour of unpacking the box, which made opening up the manual an exercise in will-power, if ultimately rewarding.I was also elated to confirm it works perfectly with the 2 lenses I inherited from my family which had been sitting unused since the early 80s ( 1 was Pentax and the other a macro Toyo lens - used with my father's old analog Pentax SLR).Everything they say about the high-iso is true : thing sees in the dark, period. Overall I have fallen in love with the camera's ease of use : the intuitively laid out controls, and logically laid-out menus make adjustments to even 'deeper' setting quick and pain-free, resulting in great pictures with marvelous depth of field, color and detail. Even the idiot setting is usable if you're under time pressure or you need a 'fail-safe'.>> The only issue, as noted elsewhere, is you must absolutely check which firmware the camera has installed. Do this the minute you get it ( you can do this by switching it on with the menu button pressed. If it says 1.0 you must google Pentax k-x firmware 1.1, scan the links for the official Pentax site, download it for Windows or Mac and install by dropping the downloaded bin file in your SD / SDHC card's volume. Don't forget to format the card : I suggest doing this in the camera - it is less of a pain. Mac users : if you format the card with disc utility, you need to choose MS-DOS formatting, not OSX!!!!Despite the last bit - or the first bit on the red color for that matter - I give it 5 stars because, for the money and the value it gets you, dealing with a negligible take-care-of-and-forget firmware snag is getting away with murder. I in fact wholeheartedly recommend this camera to anyone who just wants to document their life with some damn quality. If you have eyes and reading skills and 500 bucks you can and should use this camera.The promise of digital photography has been fulfilled. Welcome to the future.BUY THIS THING NOW!!!!!!", "Date": "May 6, 2010"}, {"Title": "Colorful K-x is a pocket-rocket and not just for beginners!", "Author": "M. Banas \"panoguy\"", "ReviewID": "RE884NTZ4ZBHW", "Overall": "5.0", "Content": "The Pentax K-x has become one of the most popular \"entry-level\" DSLRs for some very good reasons: it has excellent image quality and colors; it is compact without feeling like a toy; the \"kit-lens\" is actually quite good; and it is easy to use and understand without being restricted or \"dumbed down.\" The fact that it comes in colors in the US, like the Red one here, only adds to the appeal (as of this review it also comes in White, Blue, Green, Orange, Purple, and basic Black). Life is short, so express yourself wherever you can - not everything needs to be monochrome. Besides, having only black cameras, as if they are like a \"pro camera,\" doesn't change them from being small and plastic. Personally, I've found that the Red K-x puts people at ease and they actually look at the camera and smile!Aside from the colorful shell, what does it offer? Well, the headlines are that the high-ISO images this camera produces are amazingly detailed and free from noise (and this means you can use faster shutter speeds in lower light, so your images are sharp without being washed out by a flash). Right now, the K-x has been recognized as the low-priced leader for low-light photography. The colors of the images you get are vibrant and bright (even in low light), and the exposure is quite predictable, although the LCD display on the back doesn't always show this when viewing images on it. Actually, the LCD display is mainly good for setting the options, of which this camera has a ton!So, rather than do a \"dpreview\" run down of all the features, I'll just hit the highlights in two categories (pro/con):PRO:- Compact and solid, with a grip that is comfortable even for larger hands- Fast. Fast to start up, fast to shoot (5 fps!), fast to focus (with the kit lens).- Image Stabilization built into the camera, not the lens, so every lens has \"shake reduction\" (and it works well!)- Can use any Pentax-mount lens from the 1950's onward, and they are now stabilized and have AF-confirmation (you manually focus and the camera beeps when you hit it!)- Comes with the usual \"scene modes\" but doesn't forgo the photographer modes like Av, Tv, Sv (ISO priority) or Program mode- Excellent metering and pretty good AF mean that what you want to capture typically looks good (and the Scene modes help out as well)- High ISO (1600-6400) which is actually *useable* and not too noisy, with an Auto-ISO mode set from the factory!- HD video (720p) is recorded in an easy to view and edit format- The various \"filter modes\" are fun to use, and can even be applied to raw files by processing them in the camera- The supplied lithium AAs last a really long time, and rechargeable NiMHs (like Eneloops) also last a long time and AAs can be bought anywhere- Nice UI for the LCD screen, with clearly visible controls on the body- Pentax makes some of the best lenses for landscapes, scenics, and portraits that are still affordable (example: the DA40mm Limited is tiny, sharp, fast, and all metal and glass for about $350 - incredible!)- It is both fun to look at and fun to use (isn't that why you're reading the review of a red SLR?)CON:- Uses AA batteries, which makes it a bit heavier than other models- Only one dial to change things like shutter speed or aperture quickly (so you can't change both at the same time so quickly)- HD Movies are large (uncompressed) and like all DSLR HD movies, tend to be a bit jittery in fast motion (but the movies are also stabilized against handshake)- Sound on Movies is not too good (built-in mic above the lens, so any focus noise is heard loud and clear)- AF in Live View is sloooow (contrast-detect) and really only good for slow moving objects or bright sunlight- Things like \"face-detect\" and \"HDR capture\" look good in the specs, but aren't so useful without patience or a tripod", "Date": "May 20, 2010"}, {"Title": "You Carry a Great small dSLR & a Piece of Art", "Author": "Farzin Shokouh", "ReviewID": "R2U3HG8HNEGF7L", "Overall": "5.0", "Content": "I can write on & on about PENTAX. I was a Canon analog user since I was 8 years old. After a 10-year interruption with my photography, it was time to get into digital. I started with a FUJI bridge camera (S9100). Looking @ Canon dSLR models did not impress me at all until I handled a PENTAX *ist DL. To make it short, PENTAX is ART. Whether its handling, vivid colors, user-friendliness, and more importantly its pictures are closest to Film.This brand does not advertize much. In fact, they are not good @ it. You have to discover it. Over past couple of years, I've seen how Canikons have tried to use PENTAX ideas & have sold more because of their names (Nikon D40/40x/60 size, Canon redesigning their buttons on their Rebel models).PENTAX colored K-x's are brilliant artistic pieces besides being sharp with great high-ISO quality & vivid colors.", "Date": "March 29, 2010"}, {"Title": "Great Camera for the price", "Author": "Sathappan Ramesh \"Electrical Engineer\"", "ReviewID": "RFLCBX3SMAOLI", "Overall": "5.0", "Content": "This is my first digital SLR. I have sparingly used my friends' Nikon and Canon cameras. When compared to those, the Pentax K-x red is very good and suits me well. The Pentax K-x is also very cheap. It looks like price has nothing to do with quality. Having used manual film SLR cameras for a long time, I am not a fan of all the bells and whistles that come with some of the latest cameras. I feel that Canon and Nikon, have way too many bells and whistles that you have to pay for. Since I never use these bells and whistles, I don't need them. So this Pentax is very ideal and provides good quality artistic photography. In my case as I am an artist, I want to take the picture. I do not want the camera to take the picture for me. All I need is a camera that will let me set the exposure and shutter speeds. I do a lot of low light photography too. Why waste more money on all the fancy pre-programmed stuff. I can get a $1K or $2K camera and set it in manual more and use it. Then I am wasting a lot of money. When I can get the same results (some times better) with a $500 camera, I would definitely go for the $500 Pentax. I just got it and haven't used it much. But so far with the few shots, I am very impressed. I have to learn more about this camera and how use it to my needs. I like the red color. It stands out!", "Date": "March 22, 2010"}, {"Title": "great purchase", "Author": "Sandeep Sharma \"sandeep\"", "ReviewID": "R3C89PQT9H37QI", "Overall": "5.0", "Content": "For the price, this camera is perfect for beginners.Pros: shutter speed, simple menu and picture modes, cool color-red, battery type AA (available everywhere, be sure to use eneloop), size (slightly smaller than other SLRs), many options in menu, video capability.Cons: Still have to find one.some customers mentioned that this camera is a battery guzzler but it's not that bad if you use eneloop or any other Lithium battery.", "Date": "January 11, 2010"}, {"Title": "Best yet for the money", "Author": "Charles H Hallett", "ReviewID": "R2BSAPLUQYPOSY", "Overall": "5.0", "Content": "Just a great camera for the money.  I have had Nikon,sony,kodak in the past up to $1200. retail.  This is by far the best camera I have ever had.  great color too.", "Date": "January 11, 2011"}, {"Title": "Great first DSLR camera!", "Author": "gadget girl \"Sheri\"", "ReviewID": "R3N2J6PMPK99VS", "Overall": "5.0", "Content": "My new Pentax Kx is the perfect camera for someone new to a DSLR. It has wonderful automatic settings to get me through until I take my upcoming digital photography course at my Community College. I was looking for something that I could add on to while I learn, on my limited budget. The Pentax DSLR cameras will use any lenses made by Pentax since 1952! This means that I can pick up good used lenses at a decent price. I am enjoying using the camera at family functions and am gradually learning to use some manual settings. I read a lot about entry level DSLR cameras before I made my purchase and this camera had everything I need at a price nothing else could beat! The bright red color is an exciting addition! It sure stands out from any other camera in its class!", "Date": "November 8, 2010"}, {"Title": "Great Value: Worth it!", "Author": "tmeyer", "ReviewID": "R7TMWZ31KFS6X", "Overall": "5.0", "Content": "Bought this camera as my 1st DSLR and couldn't be happier with it.  I talked to a few people who said I wouldn't get the same photo quality as a Nikon or Canon, but DON'T LISTEN TO THEM.  This camera takes awesome photos right out of the box on auto, and still gives you plenty of control to take your photos to the next level by tweaking all the settings.  For this price, you simply can't get a DSLR with a fuller set of features.Overall Build QualitySolid, feels great in your hands with just the right amount of heft.  The zoom and focus rings on the kit lens have a solid tack to them that reminds me of Nikon kit lenses for the same level.  I'm so glad I got the red body; it looks so slick and people definitely notice when you're not using some generic black DSLRLow Light PerformanceThis is one of the places the K-x really shines.  I was able to take a photo of my room at dusk with only light from one window(no flash) and it came out brighter and clearer than my own eyes saw the room, without any motion blur and very reasonable noise.VideoAnother great selling feature.  The 720 resolution video looks incredibly crisp(shot a rainy day and could see individual raindrops falling) and it still usable, however noisy when in low light conditions.  The image stabilization system also helps take a lot of the shake out of movies, which really make those hand-held shots look a lot nicer.  Only complaint is when turning the focus ring, you can hear it get picked up on the microphone.Digital FiltersIt's lots of fun to play with the digital filters on the camera.  While you could definitely have more detailed control with photoshop, it's nice to be able to edit your photos while on the go instead of in front of a computer screen.", "Date": "July 5, 2010"}, {"Title": "Great Buy!", "Author": "Maggiex7", "ReviewID": "R20IY0TVWJHHZF", "Overall": "5.0", "Content": "I purchased this exact camera about a year ago, as a birthday present to myself. I took classes in our high school for three years, for Black & White film photography. Towards the end of the third year, we were able to start learning a little about digital photography. Of course time ran out -- but I was hooked.I decided to get this camera, because it was very similar to the ones we used in school, and as I was a beginner at the time (still learning..) I figured this camera would be a great first step for me. This camera is VERY easy to use, even if you've never put your hands on a DSLR camera before. For beginners, there is an automatic switch, and the camera will do a lot of the work for you. As your knowledge for the camera grows, you can turn the switch to manual, and take control yourself. Or.. just skip to that step, and learn it inside and out from the beginning!I really like this camera, because it does come with an optional pop-up flash. I never use flash, I'd prefer to use my own lighting, but it's great if needed.Cosmetically, this camera is very appealing, not only to me, but to everyone I meet while it's out on the town with me. Everyone always remarks what a cool camera it is, and that they've never seen a red camera before. I was going to go with original black, but I figured if I happened to misplace it (which is very common for me, even with my most valuable possessions,) this camera would be easy to find. It was nice to take a break from the oh-so-common black camera, and put a bit of my own uniqueness into it.This camera uses SD cards, and it is very easy to transfer pictures from the camera to the computer, however I have noticed that some of my SD cards it will not accept to take pictures on. I always use SanDisk memory cards, and it works with the camera fine. Another thing to point out - there is no internal memory storage, so if you plan on buying this camera, make sure you get a memory card! (256 is not a good size.. it takes about 55 pictures on them.)This camera uses 4 AA batteries. It's great, if you have rechargable lithium batteries. I use Energizer, and the battery life lasts a very long time. I can use my entire camera for three days straight on a family vacation (the camera is always clicking away at family photos) and the battery life doesn't seem to diminish at all -- I still have a full bar at the end of the stay. This might seem common for some people, but I always noticed my digital camera batteries, whether it was Point & Shoot or Digital SLR,  the camera battery starts to die down after a day worth of pictures.I'm not sure if any of this information will be helpful to anyone, but I hope it will. I remember, when I was looking for my first camera, Memory Card and Battery usage was important to me, because that's where a lot of money will go, besides Lenses and other accessories. I am very happy with this camera, and I am still continuing to learn.", "Date": "July 26, 2011"}, {"Title": "Click, click, :)", "Author": "MitchC", "ReviewID": "R1EER6JK9UH6O1", "Overall": "5.0", "Content": "So far I am very happy with my K-X.Such a welcome departure from my point and shoot Nikon.Wow, you press the shutter release and it takes a pic, no waiting.. This is how I remember an SLR.I am still learning the controls on the K-X, but everything seems to be as advertised. It feels great to be back in the SLR world.Pictures are very sharp, I am impressed.  Auto focus is better then I expected.The auto everything mode takes great pics,  I am loving figuring out all the settings She has to offer.A great move for those comping to a DSLR.", "Date": "November 30, 2010"}, {"Title": "fantastic dslr", "Author": "blonde", "ReviewID": "R7R4CEZW82JQL", "Overall": "5.0", "Content": "I've owned this Pentax for almost a year. I am new to dslr's but I received this as a gift.  At first I thought I'd never learn it but to my amazement it's very easy.  You can use it as a point and shoot but I've enjoyed all the settings and how they can change up the image.  I have received complement after complement for my photos. It has made me an avid hobby photographer. I highly recommend this camera.", "Date": "November 20, 2010"}, {"Title": "Pentax K-x - great camera", "Author": "werner45", "ReviewID": "R3CG85KJ0G409O", "Overall": "5.0", "Content": "I've had this camera a little over a month and love it.  I carried it on vacation and took about 200 pictures with it.  The pictures are very crisp and clear.  It copies the images to the memory card fast and it does well in low light.  It feels very sturdy and is easy to hold with one hand.  I really like how I can use many of my old manual focus Pentax K Mount lenses.  A big warning though, use Pentax brand K mount lenses only.  I tried to use an older off brand K mount lens which had a pin that became stuck and made it almost impossible to remove the lens.  The only thing I don't like about this camera is that the auto focus points don't illuminate, so it's hard to tell exactly where the camera wants to focus.  The only solution is to select the auto focus point or focus the camera manually.  This hasn't been a problem for me though.", "Date": "May 31, 2010"}, {"Title": "Awesome red camera", "Author": "C. Alarcon \"Master Uchual\"", "ReviewID": "R2XJJI1YH18RU7", "Overall": "5.0", "Content": "Who could think of a better colour for a SLR camera. Red definitely suits this little Pentax. Light and portable, yet powerful and full of good features. For the price, the D5000 of Nikon and the Rebel Xi from Canon are no match for this little wonder. I am just climbing up a steep (but fun) learning curve, but this does not prevent using the camera as a classy point and shoot. Highly recommended as a full-feature entry level DSLR.", "Date": "May 27, 2010"}, {"Title": "Film makers camera", "Author": "Jp", "ReviewID": "R3CKCYFDQTOQBI", "Overall": "5.0", "Content": "If you are looking for a camera that you can use for filmmaking. then buy this one!I was in the same rut as you (if you are looking to make movies), and I did my research and this camera is amazing at taking videoand the fact that you can change lenses makes it even better! the quality and wide range of lenses make a perfect buy for its pricecheck out this video I made with the camera![...]", "Date": "July 31, 2012"}, {"Title": "Really great, but underrated.", "Author": "N. Pisani", "ReviewID": "R17VVRGSJ96IZ5", "Overall": "5.0", "Content": "I don't know where to start-I really love this camera! I have been interested in photography for 55 years. I shot weddings (my speciality) for most of my professional photographic life. With the advent of the \"digital\" age. I sold all my film cameras and bought my first digital camera a Fuji S20-pro ($800.00). The Fuji is essentially a bridge camera-permanently attached zoom lens. This Pentax repesents my re-entry into the interchangeable lens area. The big guns are Canon & Nikon. But I purchase a camera based on how well I can see through it. I found the viewfinder on the Canon (my life long brand), just too busy.  I wanted a camera with a movable focusing frame. Additional points is that this Pentax is very comfortable to hold and the controls just seem to fall under my fingers. This review is very late in that a few months after purchasing, the Kx was discontinued. Although I see some are still available in some places. The Pentax K-r has taken the K-x's place. I recommend this camera or it's replacement as a simply superb piece of equipment. But a word of caution don't be cheap as I was. I purchased the camera and a few months later purchased a Tamron 18-200 lens. I found the Tamron too heavy to lug around with in the first 1/2 hour around my neck. I purchased the Pentax 50-200mm lens which is about the same size and weight of the 18-55mm that comes with the camera. So my advice for a perfect \"kit\" is: purchase the camera Pentax K-r and the 50-200mm lens together! There is a slight price advantage doing it this way and well worth it. I know I sound like a Pentax convert but Pentax's  case for their cameras are the cat's meow. Not too small, not too big & heavy, but just right to carry around. Oh by the way although my words sign the praises for this camera, I don't give out those praises without backing them up. I always keep everything that comes with a new piece of equipment, so I am in a position to return if need be. With that said I shoot several \"test\" pictures and blow at least one up to a 11x14 size print. I found both lenses (18-55mm & 50-200mm) \"sharp as a tack\".--enough said?", "Date": "December 31, 2011"}, {"Title": "Update: went dead in the water after 16 months of use. Avoid.", "Author": "35-year Technology Consumer \"8-tracks to 802.11\"", "ReviewID": "R14H43UI04EZDP", "Overall": "1.0", "Content": "Update:The original 5-star review I wrote in November 2010 follows below. The revised 1-star review is based on a sudden and total failure of this camera after just 16 months of operation (during which I used it to take around 6500 images).It simply stopped working while I was taking pictures on a clear, calm spring day. It's also the second Pentax DSLR I've had that simply stopped working (although the first one did not develop a problem until it had worked for six trouble-free years).I shipped it to the repair facility (in Arizona) for an estimate, and they reported back that it had powered up there (but needed adjustments to its autofocus focal plane setting). Two totally unacceptable situations have emerged: either intermittent reliability OR a hard failure. Repair estimate was $100. While modest, I've lost confidence in this camera to work when I want it to...--------------------------Original review (from Nov 2010):I entered the world of DSLR photography five years ago with another Pentax camera, the unfortunately named \"*istDL\" 6.1 MP model. It was offered deeply discounted at the time in a package that included two lenses. While it has served well, it had a serious shortcoming (in flash performance), and I started considering the K-x as a replacement over the last year.I couldn't be happier with the choice. The list of things to like about this camera is long. Among them:-Flash performance is very strong. While built-in flashes seldom provide anything other than harsh, direct lighting, this one does a great job across the range of macro distances to full room scenes.-Centralized display information in a bright, full color LCD screen. All of the information you need about mode and camera status are displayed in a single location instead of being split between the LCD screen an camera-top display and the viewfinder. Essential information (shooting mode, ISO, shutter speed and aperture) is echoed in the viewfinder).-Video capture with shake reduction. If you're already making a commitment to maintaining control of your photographs by carrying a DSLR, you'll be glad not to have carry along a separate piece of hardware for video.-Large range of shooting modes: automatic, shutter-priority, aperture-priorit, six different pre-set modes (selectable from the camera-top control wheel) and ten additional scene modes (selectable with the 4-way controller).-Great low-light capture: ISO range is 200-6400. You may not ever want the flash!-HD video capture.-A detailed and informative user's guide.-Lightweight camera body and distinctive red color.Currently deeply discounted by Amazon, this will place a full-featured and immensely capable DSLR in your hands at a great price. A bargain at the normal list, it becomes an even better deal when discounted. A good choice for both those new to DSLR shooting, or early adopters seeking to improve their DSLR experience with state-of-the-art technical improvements.", "Date": "November 25, 2010"}, {"Title": "cool camera", "Author": "crafty", "ReviewID": "R1FCX6LD5YQ1VY", "Overall": "5.0", "Content": "I have just begun using this camera. Pictures are great. Color is a very bright red but I'll keep it. Lightweight, but that's good. Wish lens cap had a string to keep attached like my our SLR. Good price for the features.Pentax K-x 12.4MP Digital SLR with 2.7 inch LCD and 18-55mm f/3.5-5.6 AL Lens (Red)", "Date": "October 25, 2010"}, {"Title": "Love this CAMERA", "Author": "runway36", "ReviewID": "R1OERQQCAA7T96", "Overall": "5.0", "Content": "Love,Love,Love this Camera. Everything I expected....easy to understand and use. Takes great Pictures.Once again great service from AMAZON", "Date": "September 28, 2010"}, {"Title": "Exceedingly good value for the price", "Author": null, "ReviewID": "R1PDI9XCANCLQA", "Overall": "5.0", "Content": "I was attracted by all the positive reviews in Photo magazines and online photo websites.  After owning and using the K-X Pentax camera for about 90 days I am extremely happy with it.  Why pay more for other more expensive brands which offer fewer features.This is a terrific pro-consumer as well as first SLR Camera.  It has all the automatic features of a powerful point and shoot camera and as your photographic skills increase this camera has the ability to use every manual setting of a professional SLR.  While you are learning photography you can experiment with the 11 automatic modes and many scenes which are between fully automatic and the more powerful manual settings of a professional photographer.  It is a great way to learn photography.After using my Pentax K-X for about 90 days I bought two more identical cameras and gave them to my brother and sister as a way to bring our family closer.  Now after dinner we push the food off and pull out our camera's, photos and learned techniques as we talk about photography and what we learned between family get to gethers.  We share photos of our families on facebook and we motiviate each other to learn more techniques in photography between holidays and meetings.", "Date": "August 3, 2010"}, {"Title": "Excellent value", "Author": "Jc Kruger", "ReviewID": "R1GAXQFQAJ30QI", "Overall": "5.0", "Content": "Having done a ton of research before purchasing this camera, I was not dissapointed once if started using it. While it is one of the cheaper options for entry level DSLR, it certainly does not lack in features. Maybe the biggest benefit of this camera would be the ability to use older Pentax lenses, which is perfectly compatible to this model.Having taken more than 1000 pictures in the last 2 weeks, I have been through all of the settings on the menu and I am still finding new features every day.In my opinion, I can only find one fault with the camera, the autofucus speed. This is certainly no big issue, since it is quite usable and also because most of my pictures are taken with auto-focus diasbled.All in all, if you are looking for a inexpensive but great starter camera, this is the one for you.", "Date": "June 24, 2010"}, {"Title": "Got it, Love it", "Author": "Theneville", "ReviewID": "RQY9Y218YWWYJ", "Overall": "5.0", "Content": "I recently purchased this camera through Amazon and I love it. I spent a few evenings with it and used it extensively last night for the first time. While this is billed as an entry level camera I think it has a ton of features that an experienced photographer would love. The complexity of the controls takes a little while to learn but once you do you have a very versatile camera. I will say that this is the most advanced camera I have owned since I had 35mm Pentaxes and Minoltas. It feels good in my hand, nice and solid. I find the CMOS to be very responsive and sensitive. I shoot primarily in low light situations and I did feel that the auto focus was laggy so I switched to manual focus and all was good.Overall, I am genuinely more pleased with this purchase than I thought I would be. I did read one review that commented on the color of the camera, and it is true. The actual color differs from the photographs of the camera. The actual red is a lighter red than it looks like in the pictures. Nitpicking. Overall, a great camera in my humble opinion.One major gripe that I just discovered. Pentax, you gave me the wrong type of USB cable! Instead of the cable I need I got aUSB extension cable. Not so helpful! With the USB extension cable I can now NOT plug in my camera an extra 30\" from my computer. I guess I will now have to go shopping. Ack!", "Date": "June 9, 2010"}, {"Title": "great camera for the money", "Author": "justnothip", "ReviewID": "R2MNJXVFDL73TG", "Overall": "4.0", "Content": "I'm a first time DSLR user and did a lot of research.  I came down to the penatx and a cannon, I ended up getting the pentax and couldn't be happier.  It's set up really well for first time DSLR users and the manual was actually readable.  The in-camera color filters are amazing and camera itself is pretty simple to figure out.  Definitely would recommend for anyone looking for an amazing camera at a very affordable price.", "Date": "January 11, 2011"}, {"Title": "Jake J", "Author": "jerry lee jacobs", "ReviewID": "R1ZIPAZ4GJO4IX", "Overall": "5.0", "Content": "I have researched digital SLR entry level cameras extensively and compared the Pentax K-S with the Canon xs. The Pentax proved to be better built and had a much better feel in the hand. I wanted to buy a Canon because that is all I have ever owned. The Pentax takes excellent photographs of my very active 14 month old grandson. Excellent auto-focus with a higher ISO range than any camera I looked at. Amazon shipped it to me expeditiously with total satisfaction!", "Date": "December 28, 2010"}, {"Title": "I Think I'm Going To Love It", "Author": "Nancy A. Rapchak", "ReviewID": "RPSX3T7NJS2", "Overall": "5.0", "Content": "Wondered about buying a used camera and wondered why the seller listed it as \"Very Good\" instead of \"Like New\". Still wonder. Camera is basically like new. Wish it came with the over 300 page manual. Anyway, needed a more capable camera in addition to my beloved Canon A510. Happy that I can use my old K1000 lenses. I put one on last night but have to look up the settings because it wouldn't fire. Need some tweaking, apparently. Kit lens is mostly sharp but I've seen it not so sharp at times. Think my old lenses will work much better. Love the red. Matches my bass and my roller skates. A must.", "Date": "March 6, 2014"}, {"Title": "Awesome camera!", "Author": "Anna Marie Heidenreich", "ReviewID": "RK67NR6XFWNTZ", "Overall": "5.0", "Content": "I get so many comments from people who see this camera! I am a camera collector and I love it! It is easy and fun to use! I love the color!", "Date": "July 23, 2013"}, {"Title": "Complicated", "Author": "Joe-Anne Corwin", "ReviewID": "RPHZ8X5GIJAP3", "Overall": "5.0", "Content": "The operation of this is complicated, but worth learning!  The photos it takes are outstanding.  It has features that my old fashioned camera required me to carry around, but here, with the click of a button, I have filters and exposures -- and I love that it is RED - I never leave it anywhere!!", "Date": "January 23, 2013"}, {"Title": "AWESOME", "Author": "Davec", "ReviewID": "R2II0N9B0GNCEE", "Overall": "5.0", "Content": "I have had this camera for about 5 months now! I have been going on 6,000 pictures and two photography classes! for the price it has an impressive array of features EX: (shake reduction, sensor cleaning, wireless capabilities)The software that is included has crashed a few times in windows 7 but for the most part has done well! its great on batteries and I have managed to keeep the shutter open for about 3 hours :) (night shooting)!", "Date": "March 15, 2011"}, {"Title": "Love the camera", "Author": "Miles_n_Ish \"Miles_n_Ish\"", "ReviewID": "R51HCZZS8YH4C", "Overall": "5.0", "Content": "Loving the camera.  The item came as described and have no issues with the camera up to this point.  Thanks again.", "Date": "August 10, 2010"}, {"Title": "great camera", "Author": "dmoo", "ReviewID": "R2CV2T70PASB2L", "Overall": "5.0", "Content": "we had a pentax ist but started having electrical trouble with it...the new camera is definitely an improvement over the earlier edition with many more features...love it", "Date": "July 9, 2010"}, {"Title": "Making the Switch", "Author": "S. Davis", "ReviewID": "R1P85O97RYQOZ1", "Overall": "4.0", "Content": "I recently made the switch from my SLR Canon to a Pentax K-X DSLR. My SLR captured stunning detail and I just wish I could get that detail with my new Pentax. I cannot and it saddens me. However, I like the easy to use settings on the Pentax and I like it's ability to utilize high ISO that I could not do with my canon. I am not extremely happy with the stock lens- It is the same lens as my canon but its capabilities seem severely limited in comparison. This is going to be a bumpy transition, but I think I will like the pentax in the end.", "Date": "June 29, 2010"}, {"Title": "LOVE THIS NEW CAMERA ! TAKES GREAT PICTURES, LOTS OF COOL FUNCTIONS.", "Author": "LONNIE", "ReviewID": "REBGPJXPUPT5S", "Overall": "5.0", "Content": "IT'S EASY TO USE, TAKES GREAT PICTURES,HAS LOTS OF COOL FUNCTIONS, LIKE THE FILTER OPTIONS AFTER YOU TAKE THE PICTURE.NICE TO HAVE HIGH DEF VIDEO OPTION TOO. I'LL HAVE LOTS OF FUN WITH THIS COOL LITTLE GADGET. IT'S NOT JUST A TOY,YOU CAN DO SOME REAL SERIOUS ART WITH THIS ONE, THE PRICE ON AMAZON WAS RIGHT TOO, LOVE IT!! LON", "Date": "June 20, 2010"}, {"Title": "So far, I'm impressed.", "Author": "Pana de Que \"DonRolo\"", "ReviewID": "R2CQRRO46O1H0G", "Overall": "5.0", "Content": "This, being my first SLR doesn't leave me with a lot of material to reference for a comparison. But from my perspective, I have so far enjoyed very much my time with this camera. I have already surprised myself with the results and look forward to growing creatively with my k-x.I'll update this review as I explore more of the options and have spent more time with this camera.", "Date": "February 20, 2010"}, {"Title": "Awesome Item", "Author": "Chantal", "ReviewID": "R21G7DDN4FNH5E", "Overall": "5.0", "Content": "Hello everyone, I just recieved thy Purple pentax k-x, I am new with this camera and new to photography, So far I love this camera even though I have the slightest idea what I am doing , Light weight then normal cameras and great for people who have big hands, I am wondering though if anyone has come across any problems, Like i said I just got it today as a early early Christmas gift from My Parents. I took a pic of the tv with it on and when i went to review I have part of the screen blinking in yellow and red is some of the highlighted area  of the pic, maybe I am doing something wrong but want to make sure that there is no defect, but even though i am new to this i love this camera, I love it. If anyone has any suggestion about that little problem i have can anyone help me out.Chantal", "Date": "October 14, 2010"}, {"Title": "Nice entry camera for those who want to start D-SLR", "Author": "M. Davis \"BigDawgOnR1\"", "ReviewID": "R3C92S5S71OE1O", "Overall": "4.0", "Content": "The camera was so cool looking, I admit to buying D-SLR for the first time!I have zero expierience with D-SLR, so was eager to see what the camera would do for me that point and shoot would not.I can say, using this camera with the various settings gives you dramatic control over the picture shoot.  And using photo sw, you can combine images to create cool pics.I'm a D-SLR convert!", "Date": "May 27, 2010"}, {"Title": "Takes great photos sometimes...", "Author": "Peanut Mommie", "ReviewID": "R3MGFBVSONDOWP", "Overall": "3.0", "Content": "I got this camera for my husband for Christmas because he said he wanted it and because we were expecting our first baby and wanted a high quality camera to capture our first memories.  The camera takes really nice quality photos but only half of the time.  The other half of the time, the photos are blurry.  We've had it over a year now and in the beginning it was great with indoor photos and almost brightened up the pictures more so than a compact digital camera would.  But after a year, the camera doesn't seem to take the same level of quality photos that it used to.  Other issues I have with the camera is that it is very heavy and bulky.  I know it's designed to be more ergonomic in the hand but it's actually harder for me to hold than the old boxy style SLR-type cameras.  The biggest complaint I have with the camera is the autofocus speed.  It takes FOREVER to autofocus on an object, especially indoors, and if it's too dim then it won't be able to focus on anything at all.  I was hoping this camera would be our go-to camera for taking high quality photos but for me, it's the camera of last resort, especially when I'm trying to run after a little one to take his photo.  One other thing that some people might think is weird about this camera is that it only takes AA batteries.  That wasn't a big deal for us, but some people might not like that.Pros: Good quality photosCons: Blurry photos (50% of the time), bulky, heavy, SLOW autofocus", "Date": "February 9, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002PJ40Q4"}}