{"Reviews": [{"Title": "Excellent!!", "Author": "Shelbs85690", "ReviewID": "R1FTUHVINEO961", "Overall": "5.0", "Content": "I am a techno-dunce, so I was afraid to use a digital camera, let alone try to upload pics. But this camera makes both super-easy!", "Date": "November 30, 2011"}, {"Title": "THE BEST DIGITAL CAMERA VALUE AVAILABLE--PERFECT!", "Author": "Greg", "ReviewID": "R1C27H0FTIY23E", "Overall": "5.0", "Content": "This camera performs perfectly!  Great lifetime videos and pictures at a terrific price! The other person who wrote a review doesn't know cameras, it was acting as he described because the batteries were low.  They just need to be charged.  The pictures are beautiful and it is so easy to use.  A big thanks to Kodak for making such a wonderful product at such a great value.  Buy one right away!", "Date": "December 17, 2010"}, {"Title": "I love this camera", "Author": "Puna", "ReviewID": "R2CAXVN2DDW2SH", "Overall": "5.0", "Content": "I had one for 5 years, and broke it last week by not putting on the neoprene cover and throwing it in the consol on my car.  I want another one, but am having a hard time getting the tourquoise one like I had.  It's reaqlly a great camera for people like me who no nothing about electronics.  Just aim and click.  I want another one!", "Date": "April 2, 2013"}, {"Title": "SUPER CAMERA! BUY ONE RIGHT AWAY!", "Author": "Donna", "ReviewID": "RUMBFYQE8F217", "Overall": "5.0", "Content": "This camera is great, does everything it says, takes great photo and videos.  It is a super value, get one right away!  No hesitation to recommend.", "Date": "December 18, 2010"}, {"Title": "this camera isnt the best!", "Author": "Christopher L. Snow", "ReviewID": "R3A2O1S9HB769R", "Overall": "2.0", "Content": "ok i bought this camera for my doughter for christmas and it is now june and it is broken. it wont turn on and the lens doesnt close all the way. it only lasted for six months. it takes great pictures but if you are looking for a camera that lasts a long time then this is not the one. it turns on sometimes but only when you press the button a million times! i would not recomend this camera to most people.", "Date": "June 20, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Kodak EasyShare C140 8.2 MP 3x Optical/5x Digital Zoom Camera General Features: Green color\n8.2 megapixel resolution 3x optical zoom 5x digital zoom\n2.4-inch (6.1 cm) indoor/outdoor color display, 480 x 234 (112k pixels) HD Picture Capture\n16 MB internal memory SD/SDHC (Secure Digital High Capacity) expansion card slot Face detection\nBlur reduction", "Name": "Kodak EasyShare C140 8.2MP 3x Optical/5x Digital Zoom HD Camera (Green)", "ImgURL": "http://ecx.images-amazon.com/images/I/41nVHG-eWDL.jpg", "ProductID": "B002YAZCJS"}}