{"Reviews": [{"Title": "Better than expected", "Author": "Summer Clark", "ReviewID": "R2Z94IYPJ8QQI3", "Overall": "4.0", "Content": "First of all, after reading the reviews on this I figured most of them were fake. There's one that goes on how awesome it is that the cable goes through the bracket, another that says it's all metal construction when it is clearly plastic, and some ridiculous story about horse or cow or something. But I bought it anyway because the price was right and it had audio.I've been using this for about 2 months now.First of all,it arrived exactly as described, and everything was in working order. So A+ there.Setup was simple and straightforward, but it did take a good bit of trial and error to get the angle right. Basically there are several different joints with screws in them. You loosen the screws, adjust the angle, and tighten the screw. Of course if you adjust one joint, you have to compensate by adjusting another joint as well. It took some time, but you can get any angle you want if you keep working at it. You will need to purchase a bnc cable with power cord and audio.If you're recording to your computer you will need a dvr card. If you're usig a sound card for the audio, you will also need an adapter to fit a 3.5mm stereo plug. I think with camera and accessories I had about $100 total invested.Daytime video is excellent. Perfectly clear image. I would say the angle is about 65-70 degrees, so it covers a lot of area. The image is clear up to about 30 feet away.Nighttime video is not so great unless the area is well lit. I don't think there are enough IR lights on this. You can see ok up to about 10 ft away straight on from the lens in total darkness, but even then it's not good enough to trip the motion sensor if something moves. If something is off to the side area, you will not be able to see it. Which means if you have it set to only record when there is motion, it probably won't record unless the burglar actually kisses the camera.  This camera is only really useful at night in a lighted area.The sound was way better than expected. I thought I would just hear garbled words, but it picks up audio pretty clearly. I would say it you could understand what is being said in a normal conversation from 15 feet way.I can't say much about durability since I've only had it two months, and mine is under a porch so it is protected from the elements.", "Date": "October 15, 2011"}, {"Title": "Nice camera", "Author": "slvbeard", "ReviewID": "R2QN6OORIWKATH", "Overall": "5.0", "Content": "This is a very well built bullet camera. The case is all metal construction and tamper resistant. Good resolution and color, wide viewing angle, low light works great, and the picture is clear. Automatically switches from daytime color to black and white night vision under low light conditions. Audio from the built in microphone is clear and picks up sounds at a distance with no problems. The mounting bracket seems sturdy as well with a rubber weatherproof material behind the mounting bracket to keep moisture out of the camera.  I would absolutely recommend this camera.", "Date": "April 21, 2011"}, {"Title": "Great Camera for the Price", "Author": "Dominic A. Pizza", "ReviewID": "RLLAZ2MJAKUL4", "Overall": "5.0", "Content": "This camera performs well in both daylight and nighttime IR modes.  I liked the quality of this unit so much that I bought 2 additional ones to use with my Q-See DVR.  Mounting was easy and all necessary mounting hardware was included.", "Date": "June 25, 2011"}, {"Title": "Can't beat this cam at any price!", "Author": "Sherry W.", "ReviewID": "R1XVC9U6AZPTKA", "Overall": "5.0", "Content": "I got this camera to watch my mare who was due to foal.  I have had cams before but this one was the best! Even the b/w night vision was clear! Worked exactly like I wanted right out of the box!  I moved it in the house to keep an eye on my new litter of puppies.  I would recommend this cam for any purpose.", "Date": "June 6, 2011"}, {"Title": "Product arrived faulty", "Author": "Junior Darsan", "ReviewID": "R1PKJD00ZGIUZM", "Overall": "1.0", "Content": "Product was not working when it arrived. After connecting, only the audio worked, but the video was black. I don't recommend this product.", "Date": "November 11, 2013"}, {"Title": "Had to replace it.", "Author": "P. M. Leavitt \"JudgeGuy\"", "ReviewID": "R3AKRKWNJIY2SD", "Overall": "2.0", "Content": "The color faded after less than six months. Could not correct it and was after the warranty date, oh well.", "Date": "June 24, 2012"}, {"Title": "Good cam bad mic", "Author": "amazonreview1", "ReviewID": "REELSB7R41Y6D", "Overall": "4.0", "Content": "The camera arrived on time and in good working order. Great color picture but the microphone sound had a loud hum in it. Otherwise ok.", "Date": "March 28, 2012"}, {"Title": "Had 4 months now. Still going strong", "Author": "ya think \"huh?\"", "ReviewID": "RBFSDESJZP25T", "Overall": "4.0", "Content": "This has a clear picture and has held up great so far. The night vision is way better than anything I have used so far. I can see for about 45 feet at night. The screen is a little grainy when it's in ir but I can still tell what someone looks likes to about 20 ft away. Faces are still hard even in the day for this camera but I had the same problem with all the others I have used. This is better than the ones I got with my Swann at seeing them, anyway but still blurry. I can tell who is messing around if I know them but I wish it was clearer. They adjust easy, are sturdy, and easy to install.", "Date": "March 14, 2012"}, {"Title": "Videosecu camera", "Author": "joe", "ReviewID": "R3QSI24Z9V9Y01", "Overall": "1.0", "Content": "This camera is very bad. I purchased from video secu b-4 and had a good product. There is no less than one star to rate this item. Please make sure your item meet the specs", "Date": "June 1, 2013"}, {"Title": "No Audio", "Author": "Ronald", "ReviewID": "RKUNO6W1ZZNMM", "Overall": "2.0", "Content": "I bought 2 of these cameras and both have only a loud buzzing sound for the audio. I tried them in different locations thinking maybe it may be a wiring issue but got the same results. The video on the camera is very good though, both day & night. Not wanting the hassle of returning them, I just substituted the audio with VideoSecu mini audio microphones which work fine and are only $6.42 each on Amazon.In hindsight, I should have bought cameras without audio and just purchased the mini's separately. If the mini's eventually go bad, I won't be replacing the entire camera.", "Date": "October 25, 2012"}], "ProductInfo": {"Price": "$124.95", "Features": "Built-in 1/3\" SONY Super HAD CCD, color DSP, automatic CDS sensor\nHorizontal Resolution: 420 TV Lines. Minimum Illumination: 0.0 LUX (IR on)\nBuild-in 20 infrared LEDs and 3.6mm wide view angle lens. NTSC system\nCable through bracket protects the camera from vandalism. Built-in Microphone and Audio Circuit\nPackage including: 1 CCD security camera, 1 of 12V DC 500ma power supply, 1 security warning sticker", "Name": "VideoSecu Video Audio Microphone Outdoor Built-in 1/3\" SONY CCD Bullet Security Camera Day Night Vision Wide Angle 20 IR Infrared LEDs for CCTV Home DVR Surveillance System with Bonus Power Supply and Security Warning Decal IR33AB M2R", "ImgURL": "http://ecx.images-amazon.com/images/I/51GfYsMjvAL._SY300_.jpg", "ProductID": "B002S4WUK4"}}