{"Reviews": [{"Title": "Satisfied with my camera!", "Author": "J. Wilson", "ReviewID": "R3R6VCMUKK783N", "Overall": "5.0", "Content": "I received my camera in the mail a few days ago and I have had time to mess around with it. I bought it from QVC and it was featured as a Special of the day. I didn't have any reviews to go from but it appealed to me. I had been looking for a new camera, a step up from my 4 MP camera, which was older and unsatisfactory. This camera has rechargeable batteries, and a charger for the batteries. So far I think I've taken MAYBE, give or take a little, 70 pictures and it hasn't died on me yet. It still shows the bar is full. I was also looking for a camera that had the ability to do panoramic pictures, also.The camera is easy to use and is quick to turn on, take pictures and has a lot of modes which will be fun to try out. I am satisfied for the most part. A lot of people complained that the batteries had an issue, where they had to be put in differently. I didn't have this problem but a lot of people said their cameras worked and some people had the batteries switched and it was the solution.The camera works well if you know how to use it well. Everybody is complaining about blurry pictures, you have to hold down the shutter button until you see green lines on the screen then push down.", "Date": "October 21, 2009"}, {"Title": "Blurry? Not at all.", "Author": "The Crusher", "ReviewID": "R3DOBBMHELXQ07", "Overall": "4.0", "Content": "With all these reports of blurry images, I hate to say RTFM, but that's what's needed. This is a fully auto-focus camera. If you shoot before it locks in and focuses, guess what? You get an out of focus picture. The camera will attempt to figure out what part of the scene you want in focus. If there are faces in the scene, it will lock in on them (as many as 5), and will adjust the aperture and exposure time to provide the correct depth of field. As for the person said it took 2 seconds between pushing the shutter button and the picture being taken, you must be using a completely different camera. Once focus is locked in, when you fully depress the button, there is virtually no perceptible time lag before the picture is taken. The exception, of course, is if you're using red-eye reduction, which works quite well on human subjects.Kodak has a quick-start PDF and a more in-depth instruction PDF manual on line. I'd recommend a read-through to anyone. There are a good number of options available, but if you ever forget what something does, you can always just highlight the option, and press the Info button. Detailed on-screen help will be displayed. It's basically the same text as in the in-depth PDF.The panorama feature is nice. It can't do a full wrap-around, or even a 180, but it can capture maybe 120 degrees. You can scan either left or right. After taking a shot, it shows you the left or right edge of the shot you just took. You just line that up on the screen with the live image, and take another shot. Repeat again, and you're done. The three shots are stitched together and stored, deleting the 3 source images. The results are pretty good, but you have to remember that the first shot determines the focus and light settings. I was unable to see the \"seams\" that are sometimes visible when a stitched image doesn't have enough overlap. The ability to correctly line up the shots in the viewfinder means that less overlap is needed.The video mode is so-so, which is expected. You can zoom in and out while in video mode, which a lot of cameras in the price range won't do. But the zoom looks a little jerky, probably do to image stabilization. I haven't yet tried turning it off to see if that makes a difference. The resulting files are MOV format, so you can play it with VLC Media Player, or any QuickTime compatible player.I bought this because my \"good\" camera is rather big, and can't be slipped into a pocket. Nor would I think of taking a $1,000 camera on a fishing outing or a geocaching excursion. And the camera on my cell phone is less than handy, difficult to aim, and has no flash. This camera fits the bill for an easy take-along shooter. I strongly suggest using NiMH batteries, as it will drain alkalines pretty quickly, especially when shooting video.", "Date": "July 13, 2010"}, {"Title": "Good Prize, Excellent Quality", "Author": "Orgullo Azteca", "ReviewID": "R2FCAC0NGFABIQ", "Overall": "5.0", "Content": "I was a bit sceptic before purchasing this camera because I thought it wasn't going to have good picture quality.  But it has excellent picture quality! It atjusts the picture colors by itself and atomatically.  Pictures look good in the day and in the night.  The recording component it's also good... if you record any setting you will be surprized by the high image quality and the sound.  Another good thing is that is really, really, really easy to use... I feel sorry for the people that spent their money on Canon or Sony (Because they have to press more buttems for an option, while with Kodak you just have to press one and the camera does everything for you).", "Date": "March 27, 2010"}, {"Title": "Nothing Special", "Author": "A Reader", "ReviewID": "R1V29RPX346XDM", "Overall": "3.0", "Content": "I too bought this camera as an impulse purchase from QVC (the only thing I have ever bought from QVC). I do like the size, the camera case, the color, and the LCD screen. As soon as I got the camera, I began shooting pictures around the house. I used the flash, turned off the flash, and used the night feature. Not one of the pictures had a good, clear quality. Today I went outside in bright sunlight and tried out many of the other options (bright sunlight, flower close-up with bright sun, distance, etc.). When I downloaded those photos, none of them were clear either. They look good on the LCD screen, but not good on the computer, especially when they are enlarged. This camera is promoted as being able to take very high quality photos with the ability to print up to 30 by 40 inches. I don't think so. I am going to keep it for a few more days and try out all of the options. But I have a feeling I'll be returning it. I also thought the construction was cheap; it's a very lightweight plastic (but it is made in China, so it would be silly to expect anything else). I also thought that the battery lid might break with a good gust of wind. When I was trying to close it after inserting the batteries, it didn't feel stable at all. I guess this would be a good camera for a child or teen. But I don't think it's what I was looking for (something small, easy to use, and capable of taking good quality, crisp photos).", "Date": "October 21, 2009"}, {"Title": "Pleasant Shooting IF You Read the manual", "Author": "Michael Stagg \"Eyes Like a Shutter, Mind Like...", "ReviewID": "R1VMU5BEX5LAX", "Overall": "4.0", "Content": "I received the C190 as a Christmas gift and have had a few days to play with it. Here's what I've experienced so far:Affordability:Can't beat the price of this little guy. I would say shop around to get the best price, either here on Amazon.com or elsewhere, since it appears the cost varies depending on which retailer is offering the camera.Picture Quality:Contrary to many reviews, the C190 takes great pictures IF you choose your settings according to your needs. I did experience some blurring during shooting but a quick read of the online manual was quite a help. Changing modes and making other adjustments reduced blurring. Remember, this camera does not boast image stabilization, only blur reduction. Even with that, if you shake the camera too much you WILL get blurry images.Features:Plenty! I like the Program mode setting as it allows you to manually manipulate your shot similar to (but not exactly like) a more expensive DSLR camera. The on camera Help is quite nice and answers most if not all questions you may have while shooting so you don't need to print out the manual (Save a tree!). The Smart Capture feature is really good for taking basic shots but if you're like me and using this as a beginner camera you won't want to use it often.The \"EasyShare\" feature can be a bit misleading to some. Unlike the commercial, which can lead you to think you can just upload your images wirelessly - my daughter, who purchased the camera for me thought it was Wi-Fi enabled - you  actually have to physically connect the device to your computer. The software itself isn't difficult to use.Reliability:Although I did have an issue the first day I received the camera (wouldn't power on; figured out the included batteries were; replaced them, problem solved) I haven't experienced any of the other issues some reviewers mentioned like the lens not retracting. I plan on taking it outside to experiment and will update my review according to what I find. For now, so far so good.The Verdict:With a little diligence on the user's part, this can be a useful camera. Just read the manual, learn about the different features and experiment them. I would have given the camera a 5 star rating if the EasyShare feature were actually easy (or better explained in the manual. I'd also suggest subscribing to photography blogs/RSS feeds to learn more about photography. Kodak actually has a pretty good set of resources and tutorials on how to use your camera. Check them out!", "Date": "December 29, 2010"}, {"Title": "Buy at your Own Risk", "Author": "M. Baca", "ReviewID": "RQG4IMNVRN3HU", "Overall": "1.0", "Content": "This camera is horrible. took on a vacation trip and took about 300 photos. Blurry pictures unless you are in direct sunlight, standing about 10 feet away.I bought this because of a great experience with a Z885 kodak. I'm taking it backto the store today and getting a refund.Also, the shutter is slow. You press the button and it takes about 2 seconds to photograph.This is a killer when you're photographing anything moving.Add low light conditions and your photos look like a stoned collage.I'm going to pay to get my Z885 fixed (drains batteries quickly) because that camerawas AWESOME compared to this one.", "Date": "January 20, 2010"}, {"Title": "Inconsistent Pictures", "Author": "Deb D. \"Deb\"", "ReviewID": "R1DY76U6AC2QDA", "Overall": "2.0", "Content": "I have used Kodak EasyShare products since I first started with digital cameras and have always found them to be great, but in this case, I was very disappointed.  Almost 75 percent of the pictures I took were blurry or the lighting was poor.The pictures that did come out were great, but that was rare.  After three weeks of working with the camera and even emailing Kodak, I gave up and sent the camera back. I replaced it with an even less expensive cannon that has consistently delivered good pics.", "Date": "November 19, 2009"}, {"Title": "SAFARI CAMERA", "Author": "Sarge", "ReviewID": "R1PC4DLGCLUX8F", "Overall": "4.0", "Content": "I took this camera on a hunting safari in Africa rather than my digital SLR because it would fit in my shirt pocket. Carrying a pack, rifle and large camera was just too much. Besides, at less than $100, if it got smashed, not too bad.I took hundreds of photos including moving animals, camp surroundings, and trophy photos.It's very easy to use, with a minimum of on-screen menus to figure out. If this camera had a view finder it would be superb. Unfortunately, the LCD display washes out in very bright sunlight, making outdoor shots harder to frame and compose.Forget the Kodak USB and software. Use your Windows to upload photos.", "Date": "March 24, 2011"}, {"Title": "Not a very good camera", "Author": "Latimer", "ReviewID": "RDI5QUDFTD984", "Overall": "3.0", "Content": "At work, all of the reporters got these. Here's what I've noticed:They take decent photos in bright light, but the picture quality is abysmal if you're indoors and people aren't standing absolutely still. The many settings are nice but a bit overwhelming when you're trying to find the appropriate one before the moment passes. The response time is slow, and sometimes I've been sure I pressed the button (and even heard the noise) only to find it didn't actually take a picture or start recording, or that it decided to wait to go off until I moved it to check what was wrong. Very frustrating. Finally, the whole package is pretty bulky for a point-and-shoot, and the \"red\" coloring looks more like pink.On the plus side, the screen is large and pretty easy to make out in the light, but overall I'd recommend buying a different camera. I have a Sony Powershot SD1000 for my own use and even though it's older and has fewer features, I find it much easier to handle and that the Sony actually takes better quality pictures.", "Date": "July 28, 2010"}, {"Title": "I love my beautiful red Kodak camera", "Author": "HappyGrandma", "ReviewID": "R2OX5ACT2I46VW", "Overall": "5.0", "Content": "I love everything about my beautiful red camera. It is really easy to use and the photos are wonderful.", "Date": "March 14, 2010"}, {"Title": "Camera Defective and Kodak 'Support' Nonexistent", "Author": "Hythlodaeus", "ReviewID": "RPSPQ2X17FAF6", "Overall": "1.0", "Content": "The camera worked briefly but was soon unable to recognize ANY SD card.  Whenever a card is placed inside, the camera gives an error message stating that the card needs to be formatted.  When you give it the go-ahead to format the card, nothing happens and the error message pops up again.  Formatting the card externally and retrying changes nothing.  The worst part about this experience is the total lack of Kodak support.  While companies typically make it easy for buyers to obtain older drivers and firmware, Kodak has removed all trace of any software related to this product.  To confirm this, do a search on this error message - i.e. memory card unreadable - and you'll find countless people with the problem and absolutely NO support from Kodak.  Furthermore, Kodak will have nothing to do with you if you attempt to contact them via online chat, email, or phone about this issue.  Since this is how Kodak treats customers who spend money on their products, I WILL NEVER TOUCH ANOTHER KODAK PRODUCT AGAIN.", "Date": "July 26, 2013"}, {"Title": "Great for blurry pictures", "Author": "Orion George \"Orion\"", "ReviewID": "RGQSUPL6MA6II", "Overall": "1.0", "Content": "This camera is the most frustrating camera I have ever used.  It constantly takes blurry shots that generally look ok on the back screen if the lighting is not perfect, which is about 80% of the time in my line of work (in the forest).  Work provided this camera and I feel it is a waste of money.  The most annoying part of this thing is the macro setting focuses on objects in the background further away than I would think a macro photo would be interested in pert'near 75% of the time.  It takes, on average, 3 bad macro shots for one good one.", "Date": "June 12, 2013"}, {"Title": "They don't make them anymore, but, I love them.", "Author": "Gerald I Crockett", "ReviewID": "R3LW8K5I84QWUZ", "Overall": "5.0", "Content": "I had a previous one, loved it, excellent camera, so, when dropped and broken, I bought a second hand one.", "Date": "February 23, 2013"}, {"Title": "Okay Camera", "Author": "Linda S. Peloski", "ReviewID": "R26JZII00HRV8W", "Overall": "3.0", "Content": "I chose this camera to replace an identical one that stopped working.  The lens got stuck open and would not close.  I liked the ease of using this camera, so decided to purchase another one.  It worked good until the third time using, and guess what, the lens is stuck in the open position.  I am returning this camera.  I must admit I'm not as up to date with my 'electronics' as others, however I always thought Kodak produced a good product.  I should have researched them a bit more.  Lesson learned.", "Date": "February 4, 2013"}, {"Title": "Disappointed", "Author": "SteveNV", "ReviewID": "R1Z4SFL0ZNHKZ1", "Overall": "1.0", "Content": "Very disappointed in this camera.  Bought it for my daughter.  I've tried just about everything I can to get consistently good pictures because some people seem happy with this camera. Plus, the camera has teased me with some good quality photos, I just can't understand why not all the time?  Yes I've read the manual.  I'm a pretty good \"techie\" so extremely frustrating.  Thought the the Kodak name was worth something.  Relied on this camera on a couple vacations and luckily had my phone which takes better pictures, but not great.", "Date": "December 23, 2011"}, {"Title": "Great product! Quick shipping!", "Author": "literallykeri", "ReviewID": "R1LI0F5LJVE64", "Overall": "5.0", "Content": "I cannot say enough about how wonderful this camera is!  It takes great pictures, is SO easy to use, and it's so easy to carry around.  I really needed it to take pictures at my brother's wedding: it arrived on time, took beautiful photos of my brother and his bride, and was so easy to carry in my little purse!  Thank you, Thank you, Thank you!", "Date": "July 25, 2011"}, {"Title": "Great camera", "Author": "xtsigs", "ReviewID": "R3VB6P5N0P5QUQ", "Overall": "4.0", "Content": "I want to be a photographer without learning how to set f-stop and all that. This camera lets me pretend that I know what I'm doing most of the time.Initially, I was very disappointed with the quality. I then swapped out the batteries that came with the camera. The quality jumped from a \"C\" to \"A-.\" Since then, I've had a lot of fun with it. Sometimes there is a still graininess even on the highest 11.8M setting (which is the only setting I use).It has a bunch of picture taking settings that remained hidden to me for a while due to, imo, poor documentation.Pros: fairly easy to use; \"smart\" setting is much smarter than me; light; reasonable battery life; fun.Cons: documentation is sketchy; It does not perform well when battery is low (blurry, grainy pictures); I don't trust the battery strength indicator; sometimes pictures are grainy even with new battery.I would probably get the same camera again because of its price, but maybe spending a few dollars more would have been worth it. Now that I am aware of its quirks, I'm having a lot of fun with it.", "Date": "June 1, 2011"}, {"Title": "Disappointed and then some.", "Author": "William R. Davis Jr.", "ReviewID": "R2WAFHDNLD5LAM", "Overall": "1.0", "Content": "When I first purchased this camera the pictures turned out blurry most of the time. I called Kodak and they recommended that I try to hold the camera more steady!!! I had gone as far as mounting on a tripod. First shot would be blurry and if another was imediately taken it would be better. Sent camera in under warranty. When I recieved the camera back it seem just ok. Still some issues with blurred pictures. Took camera on vacation. All my pictures were blurry. All pictures from vacation were useless. Conatacted Kodak again. Try mounting on a fixed surface see if that helps THEY SAID, blah blah blah. I just wasted $120 on this camera and have nothing to show for it. Well one thing to show for it.Blurry vacation pictures. Thought I was getting a premim product but the 5 mega pixel camera I already had takes better pictures than this one does. Would not recommend this camera or Kodak and their service. In fact would highly not recommend. More for poor service than anything else. 2/9/2013. Tried all kinds of different settings. Still no luck and I'm not the only one who has tried it. Last of Kodak cameras I will purchase. This was a waste of money.", "Date": "May 15, 2011"}, {"Title": "[Bad Card] Opps, it's much better than I thought", "Author": "David B. Gifford \"NRA\"", "ReviewID": "R2U396NWDRQ3GJ", "Overall": "5.0", "Content": "Wrote another review somewhere else, and cannot change it.  I need to set the record straight as best I can.This camera does work just fine.  For my previous review, unknown to me, I had a bad SD card which ended up as being totally inaccessible, and it was a Class 10 card.  Now, I use this camera as much as I can, which is easier than carrying my much larger 3 mp camera which is very good.", "Date": "April 30, 2011"}, {"Title": "Great camera", "Author": "D. Fiske \"Greycroft\"", "ReviewID": "R1ABO51LKOVG6U", "Overall": "5.0", "Content": "This is a replacement camera for our need of easy point and shoot in the field. Takes great photos, awesome quick auto-focus and scene recognition. We are very pleased with the transaction and the product!", "Date": "March 31, 2011"}, {"Title": "The dog ate the old one", "Author": "RJL", "ReviewID": "R1A3L9DBJH2GPD", "Overall": "4.0", "Content": "We bought this camera as a replacement for one our granddaughter was given for Christmas (a model C183).  Unfortunately a dog got hold of the original one, and bit it right through the lens.  A local camera store offered to fix it for $200.00.  Duh! We are very pleased with this camera, and our granddaughter is delighted.  She could probably write a more comprehensive review than I, but she did mention that the camera does not play back sound with videos.  Guess you have to hook it up to speakers somehow.", "Date": "March 22, 2011"}, {"Title": "LOVE IT!!!!", "Author": "Hailey Leeder", "ReviewID": "R2L6EZEPB0HPSW", "Overall": "5.0", "Content": "I love this product, It takes great photos. It is easy to use. the product itself was $65 and it was $30 for the s&h; but I still walked out spending less online than I would in store. Fantastic!", "Date": "March 7, 2011"}, {"Title": "a decent little camera, would buy again", "Author": "Midwest reviewer", "ReviewID": "ROB87IBVPNOCC", "Overall": "4.0", "Content": "In general, this is a decent little camera that I am happy with - especially for the money. There are lots of features, including video, and the camera comes in a very attractive red color. It is very light and portable and the construction quality is good. I will say that the focusing mechanism on this camera is more finicky than others I've experienced, and getting good pictures-  rather than blurry ones - calls for careful use of the controls, and selection of the right mode for the environment in which the picture is being taken. In this regard, I advise careful study of the manual - especially the more detailed one available online. When the camera is focused properly, it takes very good pictures. The camera - like other Kodak products - uses the highly convenient and versatile SD chip. I wish that the camera did not require you to open the lens each time you want to just look at old photos. This seems to result in a lot of needless wear and tear on the lens mechanism.Overall, though, a good buy. I previously used a Kodak c613 digital camera that I was happy with as well.", "Date": "November 29, 2010"}, {"Title": "Get's the job done", "Author": "Nan Chen \"cineaste\"", "ReviewID": "R1BJ9X7ANFJB9P", "Overall": "4.0", "Content": "This is a simple yet effective little camera that is very easy to use and reliable. I've had mine for about 5 months and it has worked flawlessly. It's capable of pretty good photo quality in a variety of lighting and is small and light. I have never taken many photos before but I've learned to use it quickly. You can download the photos easily to your computer and the photo quality is pretty good. The zoom, flash, and autofocus are decent and the price was just right for someone who is not serious about digital camera use. It doesn't have many features but it is just a simple and cheap \"beginner's\" digital camera.", "Date": "November 2, 2010"}, {"Title": "Slow and difficult autofocus", "Author": "C. Chen", "ReviewID": "R2XV9YQGWNR61D", "Overall": "3.0", "Content": "This is my 4th or 5th digital camera, and I really wanted to like this one.  It had many of the features that I was looking for - small, portable, still and movie functions, SD card, 5X optical zoom, 12 Megapixels, etc.  It's pretty easy to use, intuitive, and uses AA batteries that are easily replaced or rechargeable.  So why don't I like it?  The zoom is horrible.  I've seen other people critique other reviewers who commented on this as well, cut honestly, I've held down the button partway and tried to get it focus several times and it is just not a reliable when it comes to focusing.  The way that it compensates for shaky hands also doesn't seem to be very effective since the camera seems to have a difficult time focusing in general.  I find myself going back to my old Panasonic, which is far more reliable for snapping pictures (but whose construction quality is worse than the Kodak C190).  Finally, I don't like that you can't view your photos without opening the lens.  I like to look at my photos or show people the photos I've taken and you have to be very careful looking at the photos since the lens is exposed at the same time.", "Date": "August 18, 2010"}, {"Title": "OK - but a few major issues....", "Author": "jlynnva", "ReviewID": "R13607FXLKUT2W", "Overall": "2.0", "Content": "I bought this camera directly from Kodak to replace a Kodak EasyShare C613 - I also own a larger 6 year old Kodak EasyShare as well.The Kodak C613 was a good little camera that I bought for about $75 on sale 2 years ago - I wasn't expecting the best being as we only paid $75 for it  - figured it would be good to take with us when we went places where the larger one would be too bulky to carry with us or for my husband to take along with him on hunting trips - figuring if it wound up broken due to our own negligence we would not be out a lot of money.  It served us well for 2 years before the lens cover broke...When it came to replacing it - we wanted the same - easy to tote around, under $100 with a few different options.  Figuring we have had good luck with cameras from Kodak in the past I bought this camera directly from Kodak and paid just under $100 (had a coupon code for % off).Out of the box it worked well - it took a little while to go through and see all the different scenes and see how it works...there are a few features that were not on the C613 that i really like - such as the Panoramic option - a very cool feature...and the red eye reduction flash does work great...I have had some trouble at time getting good clear pictures - even with proper lighting sometimes it appears the camera is in focus and when I look back at the picture it is not.Video is decent for $100 camera - don't expect the best quality and if anyone is expecting great quality video from a camera then you shouldn't be relying on one that costs under $100.The BIGGEST problem I have having is actually getting the pictures to show up sometimes...One of the things I do like is that you connect the camera to your computer via a USB cable - However I go to load picture up into the Kodak software I have and while I can see the picture as a thumbnail - when I go to bring it up it gives me an error message saying the \"file exists but might be damaged\" - if I try and open it in another photo program (windows picture viewer, HP image) I get some sort of error message as well...when I go to properties for the picture it shows it is saved in a .jpeg format - it just won't open in anything...I have tried 2 different SD cards and pictures on both have done this...In fact I opened a new SD card and took a few pictures of my girls - reviewed them on the camera - but when I went to load it up I got an error message that the SD card wasn't formatted and it erased the pictures on the SD card to format it...that sort of pissed me offBut today was really the last straw as I only took one picture of my kids together for Halloween and guess what is the only picture that won't load...I can see a thumbnail on my computer - but can't open it...I am HIGHLY upset at this and because of this I am going to be looking at returning it to Kodak and getting my money back...I have been extrememly happy with my other 2 Kodak Cameras and for under $100 I could have lived with having to take another picture every now and then if the first one didn't focus right...and lived with a little less sharpness than other more expensive cameras....but not being able to read some pictures is a big deal to me...", "Date": "November 1, 2009"}, {"Title": "kodak easyshare c190 digital", "Author": "Gary W. Burger", "ReviewID": "R8FC9IAGYNRCB", "Overall": "5.0", "Content": "Goodprice on this camera quick delivery.Easy to use and provides excellent digital photosmany easy to use features. Zoom is good.", "Date": "March 13, 2010"}, {"Title": "Very Disappointed", "Author": "Mrs. Virginia A. Butterfield \"pets-n-places\"", "ReviewID": "R17UL0IT11ZXU9", "Overall": "1.0", "Content": "I was excited to get this camera to replace one several years old.  Sadly, I am very disappointed with the picture quality.  As many others have said, many of the pictures turn out fuzzy or blurry.  The camera seems good for general scenery outdoors.  However taking candids of groups of people, most pictures are blurry beyond repair.  Twice I relied on this camera at events I attended and was VERY displeased with the results.  I am going back to my old camera from now on.  Also, for pictures of my dogs and cats, the camera is very poor as far as \"red eye\" even though there is a setting to supposedly reduce it.  Most all cat and dog pictures are ruined by \"red eye\".  I cannot recommend this camera.  It is very disappointing.  Does not matter it it is 12MP if the pictures are not clear to start with.", "Date": "December 23, 2009"}, {"Title": "Nice camera", "Author": "Anne W. Orr \"KnitWit\"", "ReviewID": "R3V96M7PLHF35V", "Overall": "5.0", "Content": "This was given to our son for a gift.  He is very pleased with it. Tells us often how much he is enjoying it.", "Date": "September 7, 2011"}, {"Title": "DEFECTIVE CAMERAS", "Author": "skylerstcoxx", "ReviewID": "R1MRQS31MS3ACL", "Overall": "1.0", "Content": "this camera came to me defective and did not work, when i contacted the seller he was rude and it took 2 full weeks TO REFUND ME AFTER I OVER NIGHTED THE CAMERA BE WARE BUYERS SHADY SELLER!", "Date": "February 17, 2011"}, {"Title": "love my camera", "Author": "ima", "ReviewID": "R1S6BF00BB6J94", "Overall": "5.0", "Content": "I was looking for a smaller and reasonably priced camera, and I like Kodaks a lot, so this really fit my taste and my budget. I am totally happy with this purchase. the camera works perfectly fine, and I am used to Kodak anyway.", "Date": "February 15, 2011"}, {"Title": "FANTASTIC CAMERA & EASY TO USE", "Author": "Verna L. Allen", "ReviewID": "R1QFMP7RKAJWRP", "Overall": "5.0", "Content": "I JUST RETURNED FROM A 28 DAY TRIP TO ITALY & GREECE.  THIS KODAK CAMERA WAS MY CONSTANT COMPANION.  EASY, EASY TO USE; PICTURES ARE CLEAR & GREAT.  SOME OF MY FRIENDS NOW THINK THAT I'M A REAL PHOTOGRAPHER. I HIGHLY RECOMMEND THIS CAMERA.", "Date": "September 19, 2010"}, {"Title": "Kodak Easyshare C190", "Author": "M. Lee \"leethai888\"", "ReviewID": "R25DVZ77F26K6E", "Overall": "4.0", "Content": "The price was right at $99 for a 12MP digital camera, 5X zoom with a battery charger that came with 2 batteries and a camera carrier. I would like a black or charcoal cover for the camera; however, the red one cost $10 to $15 cheaper for the same function. As a smart consumer, I picked the red one of course. This camera may need a faster SD card like Extreme III, the image is blurred even set it at the sport function. Without a faster SD card, it may take 1 to 2 seconds in order to get ready for another picture. It does not happen to my other HP digital camera.The mechanical focus uses too much power in general; therefore, the camera can only take 30 to 35 pictures with flash per charge.The 2.5 inches screen seems small and is not a touch screen; but for the price, it is a very good product. Just remember, for a 3.5 inches screen, digital focus, 12MP and 5X digital zoom will set you back for $250 and more.", "Date": "May 11, 2010"}, {"Title": "A step up with Kodak", "Author": "Lloyd Stoner", "ReviewID": "R2MT2JKDO1CD6W", "Overall": "5.0", "Content": "Kodak EasyShare C190 Digital Camera (Red)  I am sorry to see that the price I paid is higher than the price you list!  I am well pleased with the camera as I expected.  We have used an earlier model of EasyShare  canera for about 4 or 5 years and we have been pleased with it.  This Christmas my wife and I agreed to give each other half of a camera.  The two halves we picked we of the C 190 Kodak Camera which had roughly 5x as many pixels as the camera we had been using.  We also expected that it would be more complicated, and it is.  We both have been through the manual twice and I know we will have to do it again.  Amazon would not accept me as a return customer without a lot of problems.  I guess I haven't done a lot of business with Amazon so they wanted to punish me.  Since the weather was bad and I couldn't go anywhere else I accepted the punishment.  I am the only one who uses this computer and e-mail address.  Yet Amazon would not accept me as the customer that lived at my address.  I finally got the Camera I wanted purchased and delivered in good order.  Then I wanted to buy a tripod....  Much to my chagrin, Amazon again would not accept me or my password.  Now the weather was better so I went to my favorite camera store and bought a tripod for about $5 above the price Amazon wanted.  I usually pay myself $20 per hour so I figure the tripod cost me less at the camera store than I would have had to pay Amazon in time and money.", "Date": "December 31, 2010"}, {"Title": "Kodak forever!", "Author": "Patricia Crowe \"NY transplant\"", "ReviewID": "R2AFO5UZUI98OY", "Overall": "5.0", "Content": "I'm originally from Rochester,NY, home of Kodak.I used to spend hours at the George Eastman house, worked at Kodak, as did my father. Am now holding on to some Kodak stock,hoping it will soar. (lol) I love digital phot.ography.I can play with shots in Photoshop.I ultimately bought the blue cameraI love the choice of colors,compact size,ease of use large size of viewer. Buy Kodak products, make my investment worthwhile.Pat", "Date": "March 5, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "12-megapixel resolution, 5x optical zoom\nSmart Capture feature automatically identifies the scene and adjusts camera settings\nIncludes: Kodak C190 (Red), Wrist Straps, User Guide With Software, 2 Kodak AA Alkaline Batteries Or Equivalent & USB Cable.\n2.7-inch LCD screen\nCapture images to SD/SDHC memory cards (not included)", "Name": "Kodak Easyshare C190 Digital Camera (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/51akaMGaxoL._SY300_.jpg", "ProductID": "B002IVVDHI"}}