{"Reviews": [{"Title": "not bad for the price, but a few concerns", "Author": "D. Kan \"phayde1@excite.com\"", "ReviewID": "R33L3CHNN74P5K", "Overall": "3.0", "Content": "I setup the 4 cams and used my tv as the monitor, had it up and running in about 30 min.  Mounting the cams and getting the view I wanted and installing the cords to where they were hidden took me 2-3 hrs.  Daylight images are pretty good quality. The cams are not waterproof and as other said over 20 ft details get fuzzy.  I have cam 1 overlooking the driveway set under the eaves above garage, cam 2 in mudroom overlooking main entrance and garage (cam1), cam 3 inside looking at back sliding glass door, cam 4 inside living room looking at main entrance. I installed the outdoor wire through a 25 ft long 3/4\" diameter plastic conduit to prevent someone cutting it (use a lubed up electician's fish wire tool helps).  -1/2 star for during the night mode the LEDs cause too much reflection to have the cam setup to record vid through a window even with an antiglare shield.  I recommend when you get the cam angle you like, use a bit of lock tight on the clamp screw (the temporary kind, not the permanent) I can see the clamp getting loose during natural cold and heat cycles.  The settings I use are best quality recording and only on Alarm mode (movement). The motion detector is fine during the day, a bit buggy during the night mode (-1/2 star). car lights shining will activate the recording, moths and bugs also are attracted to the IR light during night mode even with the sensitivity turned down.  During the night mode also there is about a 1-2 second delay from detection to start of recording... the suggested setting is 24/7 record on low quality unless Alarm or movement mode activates a higher quality record setting, but this will eat up a lot of HD space and you end up with a lot of nothing video.  I use about 1% of HD space a day on Alarm only record mode on Best quality so it will possibly record up to 100 days before rewriting, which is pretty darn good.  -1 star is converting the vid (H.264 format) you want to web friendly or any computer viewable (AVI format) requires a few steps and you end up with a pretty large file (the option to convert to MP4 or other format can be done with a secondary converter, will give you a smaller file with decent quality). You can use USB thumb drive or an alternative you can have another external HD and dump your vid there, then use a PC and the provided AVI converter.  You can only convert the one cam vid at a time, so if you have 20 some events on different cam views it will take a while to convert.  Practice this step a few times just in case you need to do it for an incident where you have to submit video as evidence to police.  The remote control is very cheaply made and if you have a fat thumb like me it was a bit cumbersome to use... I only use the remote because it has the easiest to find PB button (playback) compared to going through the menus manually.  I mainly use the provided mouse to navigate otherwise.  If you want better night vid, there are other better quality waterproof outdoor cams available (any brand with a Sony CCD is good or Panasonic).", "Date": "February 1, 2010"}, {"Title": "Defender SN-500-4CH-002 Security System Review", "Author": "K.H.", "ReviewID": "R39DOMPNW07CGJ", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moW7B7VKYY9NYTembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moW7B7VKYY9NYTrefresh_preplay() {\n\ndocument.getElementById(\"cv_moW7B7VKYY9NYTchiDiv\").innerHTML = document.getElementById(\"cv_moW7B7VKYY9NYThiddenPre\").innerHTML;\n};\ncv_moW7B7VKYY9NYTrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moW7B7VKYY9NYTso;\t   \n\n\nfunction cv_moW7B7VKYY9NYTloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moW7B7VKYY9NYTso = new SWFObject(swfLocation, \"cv_moW7B7VKYY9NYTAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moW7B7VKYY9NYTso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moW7B7VKYY9NYTso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moW7B7VKYY9NYTso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moW7B7VKYY9NYTso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moW7B7VKYY9NYTso.setAttribute(\"height\", swfHeight);\n          cv_moW7B7VKYY9NYTso.setAttribute(\"width\", swfWidth);\n          cv_moW7B7VKYY9NYTso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moW7B7VKYY9NYTso.write(\"cv_moW7B7VKYY9NYTflashcontent\")) {\n          fp_resizePlayerSpace('cv_moW7B7VKYY9NYT', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moW7B7VKYY9NYT';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moW7B7VKYY9NYT', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moW7B7VKYY9NYTloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moW7B7VKYY9NYT\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mGJRIEIKO3KOS\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mGJRIEIKO3KOS\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R39DOMPNW07CGJ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mGJRIEIKO3KOS/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moW7B7VKYY9NYTduration')) {\n      document.getElementById('cv_moW7B7VKYY9NYTduration').style.display='none';\n    }\n    cv_moW7B7VKYY9NYTloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moW7B7VKYY9NYTloadSwf(movieID, playerVersion) {\n   return _cv_moW7B7VKYY9NYTloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moW7B7VKYY9NYTnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moW7B7VKYY9NYT', 0, h);\n}\n\nfunction cv_moW7B7VKYY9NYTresetPlayer(w,h,bw,cc) {\n  cv_moW7B7VKYY9NYTnewHeight(h);\n\n  cv_moW7B7VKYY9NYTso.addVariable(\"resetBandwidth\", bw);\n  cv_moW7B7VKYY9NYTso.addVariable(\"cacheCode\", cc);\n  cv_moW7B7VKYY9NYTso.setAttribute(\"height\", h);\n  cv_moW7B7VKYY9NYTso.setAttribute(\"width\", w);\n  cv_moW7B7VKYY9NYTso.write(\"cv_moW7B7VKYY9NYTflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moW7B7VKYY9NYTRollOverImg = new Image();\ncv_moW7B7VKYY9NYTRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81KHBBzoV8S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moW7B7VKYY9NYTpreplay = document.getElementById('cv_moW7B7VKYY9NYTpreplayImageId');\nif (cv_moW7B7VKYY9NYTpreplay) {\n  cv_moW7B7VKYY9NYTpreplay.onmouseover = function() {\n    cv_moW7B7VKYY9NYTpreplay.src = \"http://ecx.images-amazon.com/images/I/81KHBBzoV8S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moW7B7VKYY9NYTpreplay.onmouseout = function() {\n    cv_moW7B7VKYY9NYTpreplay.src = \"http://ecx.images-amazon.com/images/I/81KHBBzoV8S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moW7B7VKYY9NYTpreplay.parentNode;\n\n  var cv_moW7B7VKYY9NYTcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moW7B7VKYY9NYTcurrentClick) {\n      return cv_moW7B7VKYY9NYTcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 5:15 Mins***Updated in the comments section 1 year into owning the system*** (K.H.)This is a video review of SN500-4CH-002 which is Defender's feature-rich 4 Channel H.264 DVR Security System with Smart Phone Access and 4 Indoor/Outdoor Hi-Res CCD Night Vision Surveillance Cameras.This all-in-one system contains everything you need to setup and record a 4 camera surveillance system in your home or business.For my installation, I did not need to buy anything extra or subscribe to any monthly service to use the system.  I can now access the system through any computer in the world as long as it has internet access.  I can also access footage by using my smart-phone when I am on the go.I really do recommend the Defender SN500-4CH-002 system for anyone looking for an affordable 4ch DVR security system with web and smartphone access.", "Date": "January 9, 2010"}, {"Title": "Easy Set Up, Great Software, took 2 hours end to end.", "Author": "M. Klein", "ReviewID": "R2Z5JM094ANHIY", "Overall": "5.0", "Content": "This is a great system as a beginner system goes.  It is limited to 4 cameras which is the only drawback, really making it applicable for home or small business use.I installed this on the outside of my home.The system came well packed, directions were detailed and a snap. It took just over 2 hours to get it all set up.  I would say that I am expert at handy man type jobs, so if you aren't comfortable on a ladder, with a makita drill and spade bit, better leave installation to an expert.Picking the location of the cameras was the toughest part, as I wanted them to have the best views and yet somewhat un-obtrusive.  We have had 3 friends come over since I installed the system and none of them had any clue there were cameras around.I have not tried the web set up yet, but will soon.The software allows you to fast fwd at an 8x speed so you can search easily.  The night vision is awesome as well.  The cameras work well in ambient lighting, so no issues there either.I have a friend who is a police officer take a look at the video quality and he said if anything ever happened, the quality is good enough for law enforcement as well.Bottom line:  If you can drill and route wires, you can install this.  Maybe the best $500 I have ever spent.", "Date": "January 6, 2010"}, {"Title": "Defender Sentinel 500 Series H.264", "Author": "BK \"Bill\"", "ReviewID": "R2D0JX0X7QPTHF", "Overall": "5.0", "Content": "After 3 years of researching for a system to place in my home and with my needs of Web/Smartphone ability this company is highly recommended. My line of work allows me to see alot of professional DVR security systems in Corp. and private retail industry.  I truely believe in camera security over just an audile alarm for homes.  More crimes are solved with a picture over an audible alarm which is monitored. I bought the system due to the cost and features. Once received it was out of the box and running in 10 minutes (No camera's mounted or internet connection at this time). Internet connection took me about 45 minutes (Now I could do it in 5 minutes if I did it over). When it comes to setting up the router read carefully I have Linksey G wireless and everything works using DHCP IP address mode.  I also use a first generation iPhone which does allow me to see the cameras in real time. This unit has capabilities to record on different days, hours and or an area of motion can be set within the cameras view to activate.  The system does have a notification setup for emails which sends a still photograph if the camera is activated (Would be nice if updated software was to add notifications to phone numbers). Added features in the back of the DVR allow setup of an audile alarm.  For around $500 one time fee with no monthly service to monitor or cost to maintain, who can beat this product.  Four cameras with IR are very well made with metal bodies and 60ft of cable.  Video quality is great, clean and crisp.", "Date": "December 24, 2009"}, {"Title": "Overall, a great product", "Author": "Camera User", "ReviewID": "R2KX825BKID23B", "Overall": "4.0", "Content": "We ordered an SN-500 to use in an outdoor application, to monitor a calving barn.  This unit was a great value for the money and is working extremely well for this application. It was easy and quick to install, but took me some time to understand how to make the unit accessible via the internet.  Once it was up an running, we have had no problems.  It works o.k. with a dynamic DNS service, but does not update the DNS address when it changes, only on a set schedule.  This makes the unit go off-line for a few hours before the update occurs if your service provider changes your DNS address on occassion.  This is my only complaint and I can live with it.  The cameras have worked well in sub-zero temperatures with clear pictures during daytime hours.  Night vision also works well and by adding a little light, the picture quality improves greatly.  I would highly recommend this unit for the price.", "Date": "March 14, 2010"}, {"Title": "Its not good for any money", "Author": "M. shevat \"Alientwin\"", "ReviewID": "R2CR868OOZL18U", "Overall": "1.0", "Content": "Two days after the easy installation one camera went to a orange tint. Two days later another camera went to an orange tint. It is something with the infered because it will not function in the dark. I sent one camera back and never heard from my RMA no. or another mailed in its place. The other camera has a wire problem so we have to keep unpluging it and pluging it back in. Its been over a month and I need my cameras. This system has no on-off switch. Not a good camera to use for any small shop. Customer service is no real help since they dont have replacements.", "Date": "April 25, 2011"}, {"Title": "Probably the best low-cost security system out there.", "Author": "Ladonis24", "ReviewID": "R1FI1NELC245KZ", "Overall": "4.0", "Content": "I purchased this system back in January and finally had a chance to put it in. The install was easy and straight forward. The hardest part was setting up the web interface. I'm somewhat computer savvy so I was able to get it. However, your grand-dad would not. But it gave me a nice sense of security while I'm at work to be able to check on why my alarm went off. It works great on my iphone but it could use a better software interface. I couldn't get it to work on my wife's blackberry though. I believe this has something to do with her service. The only problem I've had is that one of camera's has failed already and I'm waiting on a replacement. Hopefully this thing lasts.", "Date": "July 10, 2010"}, {"Title": "Junk!", "Author": "C. Robinson \"Moondog\"", "ReviewID": "R2AJE6DEZOI6AY", "Overall": "1.0", "Content": "I had to return this product...The IR remote control only worked intermittantly:  I checked the battery with a volt meter.  It was new, 3.1volts.I talked to tech support who had me watch the remote through the video camera because the you can see the blinking output on the monitor, so I know the remote was putting out IR.  (Cool).  Problem must be in DVR.  The tech told me that was not unusual for the remote have problems.The DVR networking features also had at least one problem:  The DVR would not accept an IP address from my router when both were set to DHCP.With 2 strikes against it, and tech support not surprised, and all the time I wasted... I just sent it back.I dont have time to waste like that.  Too bad to... I really wanted to like it!", "Date": "August 17, 2010"}, {"Title": "Easy setup difficult review of events, random time change", "Author": "average joe", "ReviewID": "R3LMSX6BL2L96O", "Overall": "3.0", "Content": "Installation could not have been easier.  All features are as stated.  I was dissapointed with the I.R camera performance.I purchased it for trying to catch someone sneaking into my home.  I thought the Motion Sensor settings would do the trick.  They do capture most motion relitively well.  I did have to play around with the sensitivity a few times to eliminate false motion.The problem that almost renders this system useless for me is it's unfriendly interface when attempting to review the  motion triggered events.  It takes 4 to 5 steps to review each event.  It freezes about 50% of the time requiring another 5 steps.  On average it takes about 10 minutes to reveiw a few events because of it's setup.I was also disapointed with the customer care I received.  The unit randomely advances 12 hours maybe every week or two.  When I contacted customer service they told me to send it back so they could bench test it.  They would not send me a replacement.  This unit is less then 30 days old!  I couldn't return the whole unit because all the wires were fished through my walls etc.Overall I'm just so-so on the unit.", "Date": "April 5, 2011"}, {"Title": "archaic backup system", "Author": "Kimberly Gildroy", "ReviewID": "R3BMJJSJJYFIPW", "Overall": "1.0", "Content": "Below, I am only writing about the aspects of this system that have caused me problems and would make me not want to purchase this system.  As far as I know, set-up was easy enough and the picture quality to me looks fine and I can see fine in the night shots, but my husband says it is subpar and grainy, and even at the lowest quality setting does not record even 6 weeks (4 cameras) worth of video (claiming to record up to 2 years on this one 500 hard drive).BACK SYSTEM:  ARCHAICWhen we got to the point of backing it up we discovered the back-up software is very archaic and per the tech support person is only meant to allow backup of 2-3 minutes for \"event backup.\"  In the backup menu, you can only use the wheel on the mouse to change start and stop dates and times and it takes forever for it to recognize and change the numbers, requiring a lot of spinning that mouse wheel to get the numbers to move.  It had an issue with calculating backup capacity if we tried to change the start and stop TIMES of the backup, allowing only a small portion of the USB drive to be used for backup, essentially saying there wasn't enough room on the USB drive.  The default start and stop times are the first and last dates and times the system recorded information.  Ours was approximately 0600 start time and 1733 stop time by the defaults and if we only changed the DATE to the same date start/stop it would back up that approximately 12 hours worth of recording, however if we tried to change the start and stop TIMES it was variable on whether it would backup at all, giving a message that there was not enough capacity on the USB drive with no real obvious pattern of calculating the backup capacity (sometimes it would backup only 30 minutes, sometimes 2 hours, one time got it to back up 6 hours).  When I spoke with technical support the rep said that he was surprised I could back up more than a few minutes, as it is only intended to back up 2-3 minutes at a time, and asked me if I could view the files that backed up hours worth of recording (yes, I can).  He said I shouldn't be able to view the recordings if they were that large and, again, the system is only made to back up 2-3 minutes at a time. (I corrected him saying 2-3 hours, thinking 2-3 minutes could not be right, but he assured me it was 2-3 MINUTES was all that the software was made to backup at one time).REMOTE:  DID NOT WORK MOST OF THE TIME, BUT DID OCCASIONALLY AFTER PUSHING A BUTTON REPEATEDLY (MAYBE UP TO 20-30 TIMES)I tried 1-5 feet away from the device when trying to use the remote, so there was no problem with too much distance between the remote and the device.", "Date": "October 26, 2010"}, {"Title": "It works but not without its nuances.", "Author": "DIGITALid", "ReviewID": "R2CVY6CU8IXUG6", "Overall": "3.0", "Content": "The Good:  The cameras work.  The DVR records video.  The cables are pretty long and the extensions are cheap.  I found a 4 pack of 60' cables for $40 here on Amazon.  Fortunately though I didn't need them.  (They already come with about 60' of slack each.)  The camera kit was very cheap.  You don't need a computer running constantly to host and save this equipment.The Bad:  The remote is worthless and often misunderstands the commands or doesn't detect them at all even from about 5 feet away.  Just use the mouse.  The image quality over the network is terrible.  Often as bad as 1 frame per second even on the high refresh low quality setting.  In its defense (no pun intended) the actual recorded video is much better.  The setup to view across the network is pretty tough.  The videos available on the website help if you have the routers they made videos for.  If not, you're on your own.  Viewing on the iPhone is a terrible hassle and doesn't always work.  I've had it installed for a week and it worked for one of those days.  I have not changed anything nor did I before it just started working on its own.  I hit the server so it DOES see the device but I either get the icon with the question mark or a 404 error.  You will need some attic crawling and the DVR is pretty loud and hot.  The camera mounts don't allow for easy adjustment of the direction you point the cameras.  The lights give off a VERY noticeable red glow at night which is cool since it means you have a clear view but that also means you can't really hide them.  A good burglar could easily spot and avoid them. You have to transfer the videos to a small flash drive in small increments if you want a backup.The Ugly:  The interface of the menu system looks like something from a late 80's VCR.  The motion sensitivity interface is a little strange to decipher. The quarter size holes you have to make in the wall to pass those cables through.The Summary:  I didn't have a grand to spend to secure my home with cameras but these night vision capable cameras work just fine.  They seem to be easily blinded if the wall or overhang is in view (the brightness will auto adjust to the brightest subject) so make sure you have a clear view from wherever you install them.", "Date": "March 15, 2011"}, {"Title": "Awesome deal for the price and features. Already caught the person vandalizing my car", "Author": "Oscar", "ReviewID": "R2N0AW9F7CS4TN", "Overall": "5.0", "Content": "I bought this system to help keep an eye on my car and house. I had researched surveillance systems for quite sometime and this system is awesome for the features and price. I was able to install this in less than 2 hours and all the hardware needed to install was included. I did not have to buy anything else as this a truly a complete system. I have both cars in my driveway monitored as well as my front and back door to my house. I have this system hooked up to my TV but also hooked to my home network. Viewing the cameras from my home network was a breeze and it was not much trouble to setup to view from outside my home on my work PC. What is even better I now have this setup to view on my Droid X cell phone. The main reason I got the camera was because some kids in my neighborhood had been \"keying\" my car and caused me over $1400.00 in damage to my limited edition collector car. The very same day I caught the kid rubbing my hood of my car and I was able to ID him from the cameras, and was able to quickly go outside before he did more damage. I now have video proof and even still shots of him. Bad thing is he is only 8 years old so law enforcement will do nothing, but at least I know and now my neighbors and his parents know. This is a great system, easy to setup, clear picture in day or night and huge hard drive for plenty of storage and easy to back up videos. Only draw back is the remote does not work well and is a little cheap, but if you use the included mouse all is good.", "Date": "March 15, 2011"}, {"Title": "Good and Bad", "Author": "Jordan Munn", "ReviewID": "R12B4ZA6J3LBS", "Overall": "3.0", "Content": "This system has great features for the price, but it was difficult to set up to view over the internet and my iphone because the manual is incorrect and it was hard to get in touch with the support person (I think they've only got one person working support because all 3 times I've talked to someone, it's been the same person).  Now that I finally got the system working the way I like it, one of the cameras died, and the cable on another camera isn't functioning anymore (it shows current video on the monitor, but does not show recorded video on the DVD).  By moving around cables and cameras, I've got 3 of the 4 working great, but I'm not sure how long it will be before any of the other cameras or cables go out.  I never got email alerts working.  The support person says that they do not advertise email alerts in newer systems, because email generated from a machine will usually get caught up in a spam detector.I love the parts that are working, but since I bought a 4-camera system, not a 3-camera system, it's hard to give the full 5 stars.  I've called about 15 times to see if there's anything I can do short of buying a replacement camera, but I can't get a hold of anyone.  I wouldn't count on the \"24 x 7 support\" that they advertise.This was the first camera security system I've ever used, and I'm happy with being able to see around my house anytime from my iphone or ipad.  When I'm in bed and I hear a strange sound, I don't even have to get out of bed to see whether or not it's something I need to worry about.  At any time, from anywhere, I can see my yard, driveway and steps to both doors from my iphone, which is pretty cool.  When I get home in the evening, I can review the DVR recording, which is set up to record for 10 seconds after a motion is detected.  It's pretty boring though, but I can look through an entire day in 10-15 minutes.  Boring is good.When a car came into my driveway after dark a few weeks ago, the SP-301C cameras that came with this system were not able to help.  The car was too far away from the camera, and the headlights washed everything out. To be fair, these cameras are only designed to see up to about 15 feet and the car was farther than that.I do need the 4 cameras though, so I'm currently researching whether I should get a replacement camera for the non-working 4th camera or whether I should get another company's camera, or even purchase another company's system.  I already have one 60-ft extension cable for the camera that's halfway down the 250-foot driveway (the one that didn't help identify a car), so it's either a better, outdoor, night vision camera and another extension cable, or a wireless camera, which has other drawbacks.Because of the badly written manual, not great quality and the poor support (they're very good when you actually talk to someone), I'm not particularly loyal to SVAT.  I just haven't found an alternative that's much better....yet.", "Date": "July 8, 2011"}, {"Title": "Great system", "Author": "D.W.017", "ReviewID": "R5EJZUZUO8CTE", "Overall": "4.0", "Content": "I think this is a good system for the cost. Setup is quick and painless. The camera quality is very good. The night time vision is good if you are within 15 feet. Works on the iphone and the touch. Can't ask for anything more.", "Date": "December 16, 2009"}, {"Title": "not Mac compatible", "Author": "Jay W. Wright", "ReviewID": "RNYMCWIW1THSI", "Overall": "2.0", "Content": "The product info says you can access the video online using a browser, or you can back up files for viewing on your computer.  The info emphasizes that the video format is something readable (h.264)However, this is not mac compatible, and the video format is designed so that you need the company software for viewing.For Mac people, this is not a good product.Note: the manual DOES say the system is not Mac compatible, but the online info doesn't.", "Date": "August 12, 2011"}, {"Title": "So far, so good", "Author": "2010SoCal", "ReviewID": "R29RB2EQDHVNUW", "Overall": "5.0", "Content": "Just wanted to say I installed the system recently. So far it's working great. Everything seems to be of good quality. I purchased it mainly for remote viewing and that's working well. It's nice peace of mind knowing I can view my home from any state.Some notes I wanted to add based on other people's reviews:1) The camera DOES work pointed out a window. I put all 4 cameras inside, with 2 of them pointing outside, one near the front door and one pointed out looking at the garage. There is no problem with glare on the glass, so I'm not sure why that other reviewer had issues. I can see clearly both day and night. It's awesome.2) I would have never been able to figure out the tech side (the port 80, etc.) unless I contacted them for help, so my advice is that if you're not used to doing that stuff, just call right away and save time. It didn't take long for them to help me set it up. I still have to set up the motion detector and all that.3) No service or software is needed for remote viewing. You just use your IP address and it brings up the quad view of your home.Everything worked fine out of the box. I actually bought it months ago and finally had the chance to set it up. So far, I'm happy with the purchase.Good luckUpdate Jan 19, 2013 - Everything is still working fine. I had some problems with remote viewing because my IP was changing when the power went out. I spoke to customer service a few times and they gave me different answers. Then finally found someone with a fix for it. Bottom line, I use no-ip.org as a free service that will fix that problem.Also, no one ever told me that you should NEVER turn off the DVR. If you are at home and don't want the camera filming, just unplug the camera cords, not the actual DVR. It apparently messes up the IP issues.Other than remote viewing issues, I haven't had a problem with anything else.Note: IIRC my price was $500 so this current price of $399 is a steal. I probably would like more cameras though and you can't add any on to this. So that's something to consider.", "Date": "June 12, 2011"}, {"Title": "Picky reviewer gives 4 stars", "Author": "David Anderson", "ReviewID": "RM95I6VK35B3R", "Overall": "4.0", "Content": "first time surveillance system buyer...I spent several hours trying to determine which unit to buy and must say I am glad I purchased the DefenderPicture is a tad grainy during the day BUT the night shots are amazing!!  I am very picky about quality and for 500..you can't beat this system!!!Installation was simple.  I mounted the cameras on my eves outside while it was snowing.  Ran the cable inside the siding corners and then through the sills on the bottom of the house.Great system!", "Date": "February 21, 2010"}, {"Title": "Easy Home Video -", "Author": "JP Vic \"Bee Guy\"", "ReviewID": "RN6BE3MEOTIS1", "Overall": "5.0", "Content": "I mounted two of my cameras outside under the eave.  Have not yet installed the other two.  They say these cameras are `weatherproof' but not `waterproof' - that means don't put them in the open.Easy setup.  In fact as soon as I plugged it in, it booted and then started recording the two cameras.Nightvision works good - but only out to ~15feet.They say you can get 2 years on the storage, but I think that's unrealistic.  Perhaps you could get 2 years if you set up motion detection, and have very little events.  I suspect a much realistic number is 2 months, which is fine for me.I have not yet hooked this up to my home network, as the DVR is in a remote location and I don't have a wire run there (just yet).  Looking forward to remote viewing on my blackberry and ipad", "Date": "October 3, 2011"}, {"Title": "horrible customer service from Defender Co.", "Author": "Dwiseman", "ReviewID": "R244TWMTCHSOCT", "Overall": "2.0", "Content": "this product has had 2 cameras go bad and now the dvr itself has gone bad. getting through to customer service is a difficult task and getting a return call or email is even harder. I got through once and was promised my issue would be resolved and that was the last time I heard from them. I think a security system is something that's best bought local so you have a actual face to talk to if there is a problem. spend your money with someone who appreciates their customers Defender/SVAT security systems isn't the one", "Date": "September 26, 2011"}, {"Title": "Good for entry-level but not great", "Author": "L. Lestha \"urieldewolf\"", "ReviewID": "R3AK3MZ2O5B8RF", "Overall": "3.0", "Content": "Being new to camera systems, I'm sure I was expecting too much for the money. Though overall pleased with the system (it's most certainly a huge step up from having nothing!) there are some things I'm not happy with. The video is fuzzy, at best, and it records even lower res, even on the best setting. Forget reading a license plate or recognizing a face unless they are close to the camera.The night vision also has a limited range, which is to be expected, but it's actually rather better than I expected (it even picks up dust flying around in front of the camera, which I initially mistook for insect swarms.) I don't see that insects are attracted to the infra-red light because, if they were, they'd be constantly buzzing around it. They don't. However, if they fly near the camera, it WILL activate the motion sensor (if you have it set that way.)The controls are rather cumbersome and I find reviewing video to be rather tedious. My system has also demonstrated some odd glitches. For example, I tried to review a motion event yesterday and the system rebooted. I tried again. It rebooted again, just as if it had a power failure. (I have mine plugged into a UPS so no power failure or power glitches of any sort.) A third time, the same result. A previous glitch of a different sort seemed to be solved by unplugging the power, letting it sit for about 30 seconds, and plugging it back in. Maybe that would have worked with this glitch too but I didn't have the patience to find out.On the plus side, the installation was actually very easy -- even for a complete neophyte. Despite the fact that the instructions did not always match up to what was in the box (color of a connection, for example) it wasn't difficult to figure out. As another reviewer mentioned, the cameras can loosen up. As for the cameras being weather-proof, the materials say they're weather-proof and we have two of them exposed and one of them VERY exposed to the elements. It rained the last couple of days and the camera worked without any problems. Winter might be a different story but, so far, rain has not been an issue beyond messing with the motion detection at night. When I contacted customer service via email about the first glitch, they did respond within a few days so that's a plus under the Customer Service category. (I can't say the same for Swann. Grrr!)Motion detection can be a hassle. I find I'm always tweaking the settings between night and day and when it rains. Spiders seem to enjoy casting a line in front of the camera so that it flutters past in the breeze, constantly activating the motion sensor, but I think it's a spider conspiracy because I'm an arachnophobe. ;-DI think, for the money, it's quite good for an entry-level system. For prosecuting criminals, I'm not certain how helpful it would be. What it's been great for is live monitoring our property at work. No more jumping up out the chair to run to the back window to see what's happening behind the building. I can track vehicles that pull out back and see what's going on -- even if I can't CLEARLY see what's going on. Less exercise but much more efficient.", "Date": "June 13, 2011"}, {"Title": "Great low cost home security system", "Author": "Rodrigo Vargas", "ReviewID": "R183UK9Y3LTY3G", "Overall": "5.0", "Content": "Great for its price, does its job fairly well. Easy installation and setup. Video quality could be better, but you get what you pay for. For a complete basic home security system this is a great purchase.", "Date": "February 3, 2011"}, {"Title": "NOT WHAT I BARGAINED FOR.", "Author": "xchrisp", "ReviewID": "R17HP0LREYD3VT", "Overall": "2.0", "Content": "Having just recently installed the equipment I soon realized that the 500 gig hard-drive is too small to do the advertised work.  Using four camera's at the better resolution it seems to be using 10+ percent of disk space in 24 hours!  This means to have decent quality video you will have to store onto other hard drives every 10 or so days.  There is a far cry from advertising \"up to 2 years of recording\" to only 10 days.  This just isn't what I bargained for and it cost almost $600, not worth it in my opinion.", "Date": "October 17, 2011"}, {"Title": "Good product for non-technical person", "Author": "Barbara Roscher", "ReviewID": "R2BR8CEU569ROR", "Overall": "4.0", "Content": "Good instructions with the product.  Easy to connect cameras to the DVR.  Hardest part was actually running the cables in the attic.  Make sure you plan well where you will put the DVR so that you have easy access through your attic running the cables from the cameras to the DVR.  You will also have to have a cable from the DVR to your router.  I installed three outside cameras.  The cameras are weather resistant, so  you have to be careful where you place these outside.  They must have protection from the elements.  I put mine under the eaves of the house and ran the cables through the sophits.  This was easiest for me.Defender website has excellent videos that will help you with connecting the DVR to your network.  I can now view my cameras from my iphone or from my PC at work.The two issues with the system is the weather resistant cameras (rather that weather proof) and the ball joint support for the camera.  It takes a lot of work to get it to support the camera and I had to add a piece of paper to rig it to work.  I am also currently sending in a camera that went bad.Keep in mind you will have to have a monitor for the DVR.Despite these issues, I think this is a good product for the money.", "Date": "May 10, 2011"}, {"Title": "Great product. Poor support.", "Author": "Mark F", "ReviewID": "R2TE5KPQ4ZYZZA", "Overall": "4.0", "Content": "Great Camera and dvr combo. Product was easy to connect. Mounts for cameras could be a little taller to get camera away from surface to allow easy positioning. Had an issue with recording at first. Called Tech Support and was promised a call back as they didn't have anyone available on weekend who could help. Did not receive a call back at all. Figured out that if the time is not set and then the unit restarted, it won't record. Software is ok.. but could be better. Motion record only records up to 99 seconds. On the bright side - Cameras are great. Even night vision is good if there is a light source nearby.", "Date": "March 13, 2011"}, {"Title": "Amazon Let Me Down!", "Author": "Baye", "ReviewID": "R1ZKNOWNEJXKRE", "Overall": "1.0", "Content": "Just got my cameras today.  The package has been opened and repacked. Some wires just thrown in the box.  Looks like someone returned and Amazon just reshipped to me.  I haven't had time to see if the cameras work.  At this point I just want to send it back.", "Date": "May 27, 2011"}, {"Title": "Omg! Great camera system!", "Author": "Jess", "ReviewID": "R26HVFOIPZJTET", "Overall": "5.0", "Content": "We should have bought one of these ages ago! The 4 camera system is great for our house! We used to get all kinds of people walking all over our front yard or using our driveway for a scooter track, and have had people break into our cars, so frustrating! I have to say it has deffinitely decreased the activity around our house and it makes people think twice when they see the cameras up. Accessing it on my iphone when im at work is also very easy and reassuring when i can keep an eye on whats going on while im not home. Deffinitely a great buy if you have trouble makers around your property and useful because it does record up to 48 hrs. of feeds.", "Date": "November 27, 2012"}, {"Title": "Quality system, Simple Installation, Excellent Support", "Author": "BobHam", "ReviewID": "R8U1G1C48C5HM", "Overall": "5.0", "Content": "I purchased the Defender DVR 8-Input system with 4 of Ultra High Resolution cameras about 3 weeks ago.  I found the DVR to be of excellent quality, and easy to install.  I had a bit of trouble understanding the menu settings for the motion detection feature and called the support line.  Candace was very helpful and had me trained in no time with the information I needed.  I mounted the DVR in a central location so the 75' cables reached all corners of the house.  The cameras deliver very good quality color video in the daytime, and the infrared unit (using the included IR LEDs) produced an excellent image in an area where I could not see the ground.  For the price this is a very good system and several of my friends have already puchases theirs after seeing mine.", "Date": "November 25, 2012"}, {"Title": "resolution is lacking, but great setup for the money", "Author": "Matthew Miller", "ReviewID": "R2BLEMDAM2BROE", "Overall": "4.0", "Content": "if you are trying to see minute details, these cameras are not for your,however, if you need to easily and affordably see what going on in an office or around a home, this is a really great value.the remote is really generic, and the menu isn't great, but the basic functionality is decent, and it does what it's meant to do.for the price, I don't think there is a better value", "Date": "December 13, 2011"}, {"Title": "Great unit for the price", "Author": "Homeowner4444", "ReviewID": "R2R054M2HDVOYC", "Overall": "4.0", "Content": "Bought this a deal of the day. Needed a way to see the front of my house from my bedroom because we have no windows showing who is in our driveway or at our front door. Installed very easily (needed an extension cable to reach the back of the house) and works great. Took a few minutes to figure out how to use the system itself but once I got the hang of it it was very easy. Video is great for the price and adds piece of mind. Haven't hooked it up to the web yet but will soon and sync with my phone. I will add an update once I see how it works.Rated it a 4 not 5 because we have it in our bedroom and the unit make a clicking noise (like a computer mouse) a lot, and keeps us up at times. Trying to figure out how to make it stop. Also lights on the front of it are very bright.", "Date": "September 22, 2011"}, {"Title": "Very impressed with this setup, very happy with the extra features", "Author": "M. Hawkins \"MHawk\"", "ReviewID": "R1Y0JLXMS8VEL5", "Overall": "5.0", "Content": "I hope to post a video review of this product soon, but wanted to get an initial review out because I am so pleased with this product.Installation was a breeze, the hardest part was running the cables through the attic and fishing them through a wall to make the connections look nice.  Box came with all necessary equipment, cables, and connections for setup.  User interface is a little \"old\" but works just fine.  Manual included tells you fairly in detail how to use all of the features.I was able to network this system(via wired ethernet) into my home network and after some port forwarding can view from any computer on any network, and even from my AT&T; Blackberry Torch.  The manual even included what website to go to for information on forwarding my router ports(even though I already knew how).Leaving the cameras recording 24/7 on high quality netted me between 7-10 days on the 500GB hard drive, which is more than enough for me.  I now have it set on BEST quality and it only records upon motion detection.The video quality is good, it doesn't always pick up small detail(i.e. license plate numbers), but you can easily ID a car or person from it.Great product, if I ever have to replace this thing, I'll be upgrading to the 8 camera system from Defender without hesitation.  Very satisfied with the product and its features.", "Date": "June 13, 2011"}, {"Title": "Good value budget system", "Author": "Comp Expert \"Comp\"", "ReviewID": "R38DYUR9CJLLWC", "Overall": "4.0", "Content": "Bought this a few months ago and finally installed two of four of the cameras.  Overall, the packaging is very nice and professional looking.  The cameras are okay, nothing great image-wise but not horrible either.  Please understand that high image quality security cameras can cost about half as much as this entire package does!  Mounts are sorta flimsy, attesting to the overall budget aspect of this camera system.  However, they'll \"do\" just fine for a typical homeowner.The DVR itself is easy to configure. It does get loud, however because it has a 40mm fan spinning at a high RPM.  Sounds like a rack PC if you're familiar with those.  Well not quite that bad but close enough. Hence, you need to be careful where you want to mount the DVR unit because keeping it where you're often in the same area will drive you nuts. If you must keep it in a living room or something, ensure you place into an enclosure for sound proofing as well as theft-abatement purposes.  The DVR does have a VGA but NOT an HDMI cable, so placing the unit far from a display can be difficult as it's not as easy to run a VGA without massive signal degradation.  The included mouse is a bit comical since it's cheap but it IS an optical mouse and I can tell you the last budget HP system I bought came with a ball mouse!  So kudos for the manufacturer here.Network access isn't as good as some of its competitors - it's a bit laggy and takes a while to spool up the stream.  I've used Swann DVRs and they are faster and of better quality when it comes to network streaming.  But.. this will do.  Get \"IP CAM VIEWER\" app for Android to view remotely.  You will need to ensure opening up the web port on your router. and ensure you have the DVR as a static IP so the IP doesn't change on you (DHCP will not always use the same IP number; since you're opening a port on your router, the router needs to KNOW what port and ALWAYS use that same port).  With my config, I am able to view remotely with my Droid phone.  Very nice.Not much else to say here.  It does what it claims to do and image quality with the cams are so-so .  I 'm looking to buy a better quality camera for one angle that faces the street since higher quality is very important in more distant shots than very closeup.  Oh, the night vision is weak too, so look for a camera with the rated night vision specs and divide by two for \"real world\" usage.Overall, remember this DVR does get loud with its fan so be careful where you choose to place it.  Definitely don't want it in your bedroom.", "Date": "May 30, 2011"}, {"Title": "Good Product", "Author": "Vincent Casolaro", "ReviewID": "RHIBUARJ3EQO8", "Overall": "5.0", "Content": "Easy to install, network, and view online. Careful using staples to secure wiring, I damaged one cable and had to get another but the company sent one no charge. Defender customer service rocks.", "Date": "June 1, 2011"}, {"Title": "Too long to review video footage.", "Author": "BOYOBOYOBOY", "ReviewID": "RAFHAU42N2U0R", "Overall": "3.0", "Content": "I've decided to sell this.  It takes too long to review video footage.  There should be a 32x viewing setting.  Max is 8.PROS1. Phone - was able to access easily from home PC, I-Phone, and I-Pad2. Features - lots of features regarding recording, storing, viewing, etc.3. Quality - camera picture comes in clear4. Service - no service fee for viewing cameras through mobile devices5. Interface - easy to use6. Cords - good length on cords for the camerasCONS1. Power - turn off control center by unplugging in back (no button on front) and even then cameras are always on!2. Mount - cameras don't stay in position well when tightened down which would be even more of a problem outdoors3. ExtPC - was not able to access from computer on network; could be restriction through internet service provider4. Sound - cameras lack ability to record audio5. Replay - EXTREMELY slow with a max of 8x", "Date": "May 22, 2011"}, {"Title": "Defender", "Author": "Everythingnicki", "ReviewID": "R34FOQMP9ZYM1J", "Overall": "5.0", "Content": "Easy installation as promised, and the night vision aspect is better than I had hoped. I love the ease in setting up masked areas and such.", "Date": "March 24, 2011"}, {"Title": "Decent picture", "Author": "Keith A. Frazier", "ReviewID": "R2G3HPJ3ABTXN7", "Overall": "4.0", "Content": "Not difficult to install, decent quality of picture. It's doing exactly what I purchased it for. I'll amend the review as time goes on and things change(i.e cameras go offline picture fuzzy or anything of that nature). Still to new for a better review. So far not bad, especially since I'm not the greatest with installation of electronic devices. Time will tell, wish I had had it before someone messed with one of my vehicles. That's why I decided to get it. Stay tuned for updates!", "Date": "March 7, 2011"}, {"Title": "Excellent for small Office or Home", "Author": "Ali,", "ReviewID": "R3KG2D99CGAH1N", "Overall": "5.0", "Content": "I just received my Defender SN500, there is NO words can describe how easy it is to install it, i just install one camera and complete the internet setting in 15 minutes ... yes 15, no more.. the other cameras are just plug the wire in. i will spend some more time in clipping the wires on the wall from the cam to the DVR. For now i will fix tow cameras one on my yard (fixed in 15 min) and one on my garage.I guess i will need more wires to connect my Garage cam to DVR it is more than 60ft.I am happy with my system, and i recommend it.", "Date": "February 13, 2011"}, {"Title": "Great cameras and system- but cannot be used with iPhone as listed", "Author": "M. Collins", "ReviewID": "RLASK4FI3N0ZN", "Overall": "4.0", "Content": "Easy to setup and good product, but two selling points on side of box are false: 24/7 customer service is really really bankers hours M-F;  Also video will not show on iPhone or iPad and those terms do not show any help in search on website.", "Date": "June 11, 2011"}, {"Title": "Great system for the price!", "Author": "James Siercks", "ReviewID": "R2BPI8LQSP6V4K", "Overall": "5.0", "Content": "Just finished the install and have all the features operational. For the price this system can not be beat. Four cameras, remove viewing, Iphone access, email alerts, motion sensing, infra red night viewing all work great. Placing the cameras was a trick with pulling the cables through the walls etc but once that was complete the setup was easy. I did call customer support for a little help and they are awesome! The email function may be a problem for some as I was told but that has more to do with your ISP than this product. I would recommend this product to anyone who wants to keep an eye on their home while away and has a little mechanical and computer know how. Don't be alarmed to find your cat digs in the house plants while you are at work!", "Date": "February 1, 2011"}, {"Title": "Excellent and quick", "Author": "Matthew", "ReviewID": "R2B8XX4XH2ICWU", "Overall": "5.0", "Content": "I bought this product for my home. It was extremely easy to install. I decided to put the DVR in a safe and drilling a hole through the back of the safe to run the wires in was the hardest part (nothing to do with this product). I mounted the cameras, ran the wires and plugged everything into the back of the DVR and it was up and running with out a problem. I really don't know how it could be made any easier. Excellent night vision sight distance on it as well. Thanks for the great product!", "Date": "December 4, 2010"}, {"Title": "DVR-04CH-002 security camera system", "Author": "The Ponshop", "ReviewID": "R7NCAY84W7NB9", "Overall": "4.0", "Content": "Technically, the system is really easy to \"HOOK UP\", but not easy to install around the house and through the walls...etc. Picture quality is pretty good. Still trying to figure out the best setting for motion detection...and how to get it to send me a snapshot to my emails. It took me awhile to configure my router to open the ports for this camera. Not the camera's fault...it's the router. Bottom line is this, great product for the cost! I would highly recommend it if you are the DIY person, with a tight budget.", "Date": "November 12, 2010"}, {"Title": "Everything I wanted it to do", "Author": "jackson0146 \"Avid reader, story teller, adven...", "ReviewID": "R2FXLUJWBS42C9", "Overall": "5.0", "Content": "Great system for the amount spent. Easy to install and easy set up to view online and on my cell phone. Cameras are very clear and the system does everything I need it to do. Only issue I had is that two of the wires that came with it had a short in them, but the company sent me new ones for free right away.", "Date": "October 24, 2010"}, {"Title": "Good system while it's working!!", "Author": "T. Tan", "ReviewID": "R2AKUEUVMN5ORK", "Overall": "3.0", "Content": "I had the system installed very simple plug and play. The port forwarding kinda tricky since I 'm mac user in-order to get it work you need to get PC and compatible router ( I own apple airport extreme ). After a few called with support I bypass connected the system to the modem which provided from my isp and finally get it work. After research and another called with support to get it work on my iPhone I need to upgraded firmware to get it work. The app which they recommended aplayer is no longer work (may be just for me). Finally more research there is paid app which is working with the system ($4.99).The system stop working due to the capacity of hdd. I could not play back only show on screen searching.....  !!! A few days earlier we had an event at the business and I want to back up to my external drive. It failed I just realize my drive was full again try to search on time no record show that period!! I need to format the drive again. Try to call the customer support never ever reach anyone only voice mail and wait until they get back. Incase you need immediate answer you may need to do your own research, same as I do.Overall this system is work fine however I just recommend to my friend business get other system instead if you don't need to do research like I did.", "Date": "November 9, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Access live video footage directly from your iPhone, BlackBerry or Android Smartphone\nRecord over 2 years of video footage on the built-in 500GB hard drive\nThe system utilizes the latest, most advanced compression level available saving you storage space without sacrificing video quality\nView video online with no service fees from any computer in the world\n24/7 lifetime live customer support is available through phone, email, and live web chat both before and after you buy", "Name": "Defender SN500-4CH-002 Feature-rich 4 Channel H.264 DVR Security System with Smart Phone Access and 4 Indoor/Outdoor Hi-Res CCD Night Vision Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/41X-n-R%2BskL._SY300_.jpg", "ProductID": "B002UKOUTK"}}