{"Reviews": [{"Title": "Don't bother", "Author": "D. Kelley", "ReviewID": "R1M9BZD0R9371Y", "Overall": "1.0", "Content": "Even considering the price the camera is not very good.  Picture quality is bad, there's no manual available, even online, user interface is poor, etc.  Can't really say anything good about it, actually.", "Date": "July 31, 2010"}, {"Title": "not worth money, a true throw-away", "Author": "Christopher Painter", "ReviewID": "R1KJULQOLK1MHK", "Overall": "1.0", "Content": "Bought this product as a gift for our son.Didn't expect much considering the price, but below are some of the major flaws:1. if batteries die or are removed, all the pictures get deleted2. unable to delete any photos from the camera, whether one at a time or all, even after downloading them3. are forced to use the supplied software to download the photos4. if use the flash 3 AAA batteries lasted about 45-60 photos (almost have to use the flash all the time to take half-way decent photos)5. it will only take 15 photos before memory is fullWas hoping for a bit more from this camera, but I guess I shouldn't have. I will be returning mine to the store I purchased it from.", "Date": "December 26, 2009"}, {"Title": "Holds only 15 photos - 'nuf said.", "Author": "Joshua McNichols \"Joshua McNichols\"", "ReviewID": "R2BGYF3YJCWIMW", "Overall": "1.0", "Content": "Unfortunately, the onboard memory accommodates only 15 photos (no expansion card is available). To make things worse, the batteries constantly run out - it seems we replace them every time we use the camera. The video feature is a joke - a few seconds is all the memory this camera has room for. And since removing the batteries wipes out the onboard memory, that means constantly tethering the camera to the computer to offload its meager haul of photos. Oh, and Windows 7 does not recognize the camera, only Vista and XP.", "Date": "May 26, 2011"}, {"Title": "You don't even get what you pay for", "Author": "Julesy", "ReviewID": "R15O49NBW5R1VT", "Overall": "1.0", "Content": "Even though the camera was only about 30 dollars and I purchased it impulsively, I feel ripped off.  Every feature is cheap and frustrating.  I will be returning this to the store I bought it from.", "Date": "April 9, 2011"}, {"Title": "Not worth the money!!!!", "Author": "phenix1126", "ReviewID": "R2QP5Q72CI0JCI", "Overall": "1.0", "Content": "This camera is sold at a cheap price and after using it I see why. The quality of the pictures is horrible and the software is also low quality.", "Date": "November 26, 2011"}, {"Title": "I wated my money.", "Author": "Skeptic", "ReviewID": "R2PGL4OARLY0Q6", "Overall": "1.0", "Content": "this camerae can only hold 15 pictures and the video on it is 1 frame per second sit looks worse than a stop motion it has no sound and wont take a picture if it isn't light enough the resolution is bad.  the screen is small and this things brakes too easily also if the flash isn't ready it won't take a picture so if the flash is on sometimes there is no picture if the flash is off rarely a picture because its too dark.  But this does make a good toy for my little brothers and sisters the thing I do like is all the options menu. I bought a black one at walmart for $30 over all don't get it I would give it no stars if I could.", "Date": "November 11, 2010"}], "ProductInfo": {"Price": "$12.99", "Features": "3.1 MP\nAdvanced Sports Mode and Auto Scene Mode\nAuto Focus and Auto Power off", "Name": "Vivitar 3.1MP Digital Still Camera (VS28B-SILVER)", "ImgURL": "http://ecx.images-amazon.com/images/I/41IxTb0MULL._SX300_.jpg", "ProductID": "B002KV30A4"}}