{"Reviews": [{"Title": "Pretty amazing point-and shoot camera.", "Author": "KHA", "ReviewID": "RSW0I46BH9XN7", "Overall": "4.0", "Content": "Purchased this to replace my Canon A1000, which I bought last year for a trip to Rocky Mountain National Park.  Had to really struggle to get a good pic with the Canon -- I was very aggravated with it (though I finally came up with some program combinations that worked okay for the low light under the trees).  But I decided for this summer's trip to the beach to try a new camera, with more zoom, and pass my Canon down to my 12-year-old son -- who's not nearly as picky as I am ;-)Did a bit of research (which is always overwhelming because there's such a huge selection to choose from, and such a diversity of opinions on what makes a \"good\" camera).  And I still wanted a pocket camera for convenience when hiking, fishing, float tripping, etc., so the Canon SX20 and Nikon P100 and the like were still too large for my needs.  And then I came across well over 100 user reviews raving about the Panasonic ZS3 -- the predecessor of the ZS5/7 models -- on various websites, and it's reviews were also very good on \"official\" review sites.  What especially impressed me was a review by a couple who guide trips to Yellowstone, were experienced SLR users, and had tried the ZS3 as a compact alternative -- and they loved it for outdoor shots.  So I decided to try out the newer version of the ZS3, the ZS5.(The main differences I saw between the ZS5 and ZS7 were that the ZS5's screen is 2.7\" instead of 3.0\", the ZS7 has two custom \"My Scene's\" instead of one, the ZS7 has a built-in GPS, and the ZS7 also has stereo video instead of mono, with more advanced video technology.  None of those features were important to me for the additional money.)I've had the camera only a couple of days, and have done various side-by-side camera comparisons between the ZS5 and the Canon A1000, and I'm pretty floored by the capabilities and photo quality of the ZS5.  I'm especially impressed with the macro (I like to take wildflower pics).  While no camera is perfect (from what I've seen), for me the ZS5 is going to be just what I needed for outdoor pictures.  I'll update this review once I've had more time to experiment.Update 05/11/10:  Some cons -- (1) Battery door latch seems a little flimsy; wonder if it will get where it doesn't latch tight after alot of use?  Only time will tell. (Other than that, this camera feels solidly built.)  (2) Proprietary battery that has an ID chip built in, and the software in the camera looks for that (on their website, Panasonic says this change was made to ensure battery quality/safety).  However, it appears you can finally get a 3rd-party battery thru Amazon (meaning a whole lot cheaper), and other vendors -- just be sure to look for \"ID Secured\" batteries (e-mail and ask the vendor first if you're not sure).  I knew this before I bought the camera, but figured it should be pointed out.  (3) I've had several indoor shots, in not very low light, that looked fuzzy, especially when you zoomed in on a PC.  Not always the case, though.  I think the \"iA\" mode is not always as intelligent as it should be.  Also, reducing to 4 stars, so as not to mislead anyone that the camera is \"perfect\" -- though it's still \"pretty amazing\", and I'm really happy with it.Update 05/14/10:  The best pics seem to come with my own settings, and not with the \"iA\" mode where the computer is trying to make all the decisions for me.  So you'll want to learn what the various settings do (and there's quite a few of them -- lots of flexibility).  The ZS5 has three \"Custom\" memory slots in which to save your own configurations (which is great -- my Canon had no memory slots, and I was constantly fiddling with the settings).", "Date": "May 10, 2010"}, {"Title": "An astonishingly excellent camera on manual, a mediocre point-and-shoot otherwise.", "Author": "Phalanx", "ReviewID": "R3SUAFKTX4T95S", "Overall": "4.0", "Content": "The Panasonic Lumix ZS5 a.k.a TZ8 is purportedly a point-and-shoot camera. However, if the auto setting is all you will ever use it on, you'll probably be disappointed by its performance. This is not a camera which you can simply set on auto, aim, click the button and expect the pictures to come out excellent all the time.My experience with the intelligent auto has been hit or miss so far. To be blunt, the 'intelligent auto' does not seem exceedingly intelligent at all, and it loves bumping up the ISO (grainy pictures) and pulling out the flash in circumstances where using the said flash doesn't seem to make much sense (wasting battery and resulting in ugly photos). To be fair, it performs excellently when taking pictures in bright outdoor conditions, but if you plan to take pictures indoor and it is the slightest bit dim, the auto doesn't seem to do too well and I ended up with a lot of blurry photos that way. Even with the flash deployed.After spending about a couple of hours taking a bit of time to understand the manual modes and the appropriate settings of each, however, the mediocre point-and-shoot camera became an excellent little camera. The manual modes allow you a lot more leeway on how you want the photo taken, and thus override the choices the irritating auto mode makes, thus saving your indoor photos. You can also do a lot of experimental pictures. (In fact at the smallest aperture setting, the camera allows you to keep the shutter open for a staggering 60 seconds!). So if you know at least a little bit of basic photography and are willing to do your own settings, the camera manages to perform to its full potential and you can get some truly excellent photos.If you're not too keen on reading up on fstops and shutter speeds and whatnot, I should mention the camera does get along quite respectably on its preset scenery modes. There's a pretty nice selection of them, covering outdoors, night scenes, food shots, macro etc. An important thing about getting good shots while using these modes is to give the IA a lot of time to \"make up its mind\" how it wants to take the photo by halfway depressing the button before you take a photo. Do watch for the indicator on the LCD to turn green before committing the shot. There's also a high-speed burst option, which scales down your pictures to about 4 megapixels but allows to you take a lot of pictures in succession very very quickly. (Note: You can also shortcut to this mode under the MS setting on the mode dial)As you all know, the huge Leica lens on this camera is the main attraction and it lives up to its hype. It's advertised as 16x zoom, but only 12x of it is optical, the rest of it done by \"intelligent zoom\", which is basically a surprisingly almost-indistinguishable-from-optical digital zoom. The zoom also works (limited however) in macro zoom mode, which can result in some amazing macro shots. The camera also has conventional digital zoom (which went up to a staggering 90+ times zoom) , but you have to navigate the camera's controls to turn it on because by default it's turned off. The non-intelligent digital zoom however, does produce grainy pictures, but this is expected of digital zoom anyway.When you have a strong zoom, the image stabilization capabilities of a camera become extremely important, and the ZS5 seems to have that covered. I did some testing shooting out of a moving car, sometimes with maximum optical zoom and the camera managed to deliver surprisingly clear pictures despite that.I actually liked the slightly larger size of the camera, since it made it far easier to hold, but the thing that tipped the balance in this camera's favour for me were the controls, which shy away from pressing buttons as much as possible (Sorry Canon, but you lost out to the Lumix in the end because of this). Dials and switches are less prone to accidental pressings, and a nice little feature is that the camera will still recognize situations where the power switch has been left on by accident and will shut itself down to save the battery.The battery life is ok, but not particularly amazing. I would recommend getting a spare battery to keep on hand. Do keep in mind however the battery is a proprietary Panasonic one, and the firmware on the camera will recognize imitation batteries and refuse to use them.The HD video is very nice, although the sound recording is only in mono. The upshot of this camera is that the zoom can be used with the video, and I was very pleased with that because it really does make a lot of difference when you're taking videos of something far away so that you can actually see the thing instead of it being a black silhouette. It does not use the same recording format as the other cameras in the ZS3 or ZS5 however, so if I am not mistaken, the video recordings will take up more space on your SD card.Overall, I am quite happy with this camera, but like I said before, this camera doesn't do too well as a simple point-and-shoot for the casual user. It takes a while to learn to use to get the best out of it. I would however, recommend this camera for people with a casual interest in photography, and aren't afraid to experiment with their own settings. I would also recommend this camera to people who are into photography but want a compact camera with an excellent zoom without having to lug around a DSLR and lens bag.Pricewise, I think it's quite reasonable, and I don't think you can get another superzoom camera from any other camera maker for this price range. Although if you find a ZS3 (the older higher end model of this same series) for about the same price, you won't lose out by getting the ZS3 either.UPDATE 29 Oct 2011: After a little over a year's use, the genuine Panasonic battery that came with the camera decided to suddenly and completely stop working. As I have mentioned before, replacements are not cheap and 3rd party batteries may be blocked by the camera's firmware, so this is definitely something you may want to consider before making any purchases. Still enjoying the camera, the battery factor could be a bit better...", "Date": "June 27, 2010"}, {"Title": "Sweet li'l pocket cam", "Author": "David Chaika", "ReviewID": "R1TMXPH67Q2Q95", "Overall": "4.0", "Content": "I bought this camera two weeks ago and almost immediately took it for a long weekend in the NC mountains, where I shot near 700 photos, including video and some bracketed shots. All outside overcast daytime shots. The camera worked like a charm and is much more convenient than my Canon DSLR and larger Panasonic FZ20. I carried it mostly in my jacket pocket.I have not shot video before, and this one works great! I guess the image stabilization works in video, because mine came out looking pretty smooth, including the zooms, which seem to run a little slower than zooming between still shots. Nice. Sound is good too, I got waterfalls in video and sound.The major prob. with my DSLR is close focus - i.e., none. With this baby you can get down to 3cm. This is real good for wildflower and moss/fern shots. I wish I had brought my 1-ft tripod with me, but still got lots of acceptably sharp shots. Have not printed any blowups to test this yet.Battery life - well I didn't count the shots, but towards evening the alert started flashing at me. Going to buy a second battery, which I would recommend you do, if you want to be sure of a full day's worth of photos. I did a lot of reviewing and zooming in to check that I had things in focus.Great feature of Slide Show viewing -- you get various directional pans of your stills, plus music. Sweet! Wish I could do that on my Windows 7 PC, but I think you can hook up to your TV and get this.Still learning how to use some of the functions. Unfortunately, the printed manual includes only the basic settings, and you have to read the CD manual to find out more details. This is not like the manual for the FZ20. I would like a complete printed manual to peruse.You can set 3 presets, and I tried setting up one. Needed the manual to figure out what all you could do, but I had not brought it with me. That seemed a pretty convenient way to do things and I am going to configure all three settings when I get time.I wonder if there is any way to get the ZS5 to shoot RAW photos like the hack (temporary) for some of the Canon pocket cameras. Think Panasonic will do a firmware update for this?I discovered that the f-stop range is really limited, f/3.3-6.3. You can't get much depth of field when you do closeups. I would say that this is my main issue with this camera, would like to be able to stop way down. But I really like the wiiide angle lens!I was out in rain, and I wish there were some way to put on a lens hood. Had to wipe and blow drops off the lens.I had been worried that my eyes with glasses would not be able to focus on the screen (there is no viewfinder), but then found that you are basically only positioning elements when you make a shot, leaving the focusing to the camera. That worked out great.Remember to take the camera out of Macro mode when you are switching back and forth. I didn't and got a couple of fuzzy shots.The battery door and lock seems weak, and the off/on and wide angle /tele knob are a little too small for me, but I managed ok.One 8GB card, and I used only about 5GB this weekend. Overall I think I have the right camera for my next travel adventure.", "Date": "May 5, 2010"}, {"Title": "Best P&S; Camera on the Market, PLUS Amazing HD Video", "Author": "Jacob L. Mcgee \"jakemcgee\"", "ReviewID": "R2JBK5NHCJO079", "Overall": "5.0", "Content": "This is hands-down the best camera I've owned, and that includes SLR's.Right out of the box, this camera is simple to use. As a still camera, it turns out crazy clear pictures, and the 12x Optical Zoom lens is pretty nuts for this sized camera. I first tried out the Nikon Coolpix S8000, and this thing stomps the Nikon in every way, including the lens. Yes, this 12mp camera turns out better pictures than Nikon's 14mp camera.On top of being a great still camera, this takes GREAT HD video. Super clear, little to no feedback or distortion.Then, if you get into the manual and learn how to really use this camera, there are so many manual adjustments (shutter speed, fstop, etc), it's almost as customizable as an slr camera, save for interchangeable lenses.All in all, this is a great deal, and certainly at the top of the line.", "Date": "April 18, 2010"}, {"Title": "Exceptional Camera", "Author": "CTSIA-100", "ReviewID": "RM5SDXWNYCFE9", "Overall": "4.0", "Content": "The Lumix ZS5 reminds me of the finer 70's era stereo equipment.  Because of keen competition, the finer stereo equipment was \"over-engineered\" which contributed to it almost immeasurable quality and durability.  Such is the case with the Lumix.  Initially I purchased a comparable Canon, but the articles I read about the Lumix ZS5 were etched in my mind...so I ordered the Lumix.  Out of the box the stellar quality and workmanship was obvious; the clarity of pictures is perhaps unparalleled for cameras in this category; and the ease of operation is wonderful.  The quick start-up time still surprises me and the wide angle Leica lens is remarkable on this camera.  It also the right mix of heft without weight so it's comfortable without feeling like a plastic toy!  This particular Lumix has been engineered to become a legend...if that's possible in our \"every 3-month\" technological craze.  Buy it...enjoy it...", "Date": "June 5, 2010"}, {"Title": "One word...Awesome!", "Author": "boarderman", "ReviewID": "R2B6DXZN399AQ", "Overall": "5.0", "Content": "I purchased a Nikon point and shoot two years ago and ever since the day I bought it, my wife complained about it.  It was difficult to use, was slow to take pictures and the quality of the pictures was not that great.  Needless to say, I was hounded for two years to get another one.  So when I finally decided to replace it, I did quite a bit of research on which camera to buy.  Everything I read pointed to this camera and I'm glad that it did.The camera is very well put together.  It feels very solid in your hands but it doesn't feel to heavy.  The lens zooms in and out very quickly and the camera boots up extremely quickly so that you can grab that quick shot.  There are a ton of features which I have yet to use, but fully intend on exploring.  There are tons of pre-set scene modes for shooting as well as alot of manual control features.  It has has an option to record HD video.One of the best features for us was the burst feature.  We have a baby on the way and my wife really wanted a camera which would be able to grab shots of the baby as he moves around.  Our old camera had this feature but it was very slow and the pictures turned out horribly.  This cameras burst feature works amazingly.  It takes what looks like 2-3 pictures a second and they are very clear.Another thing about this camera which is very handy is that it focus's extremely quickly and takes pictures as soon as you hit the button.  Our previous camera would focus ok, but would be very slow to take the pictures.  This new camera will snap a picture as soon as you tell it to and will do it in focus.  It came in extremely handy as we just went on a trip to Savannah and toured the city on a trolley tour.  We were able to get pictures while riding on the tour that we would have never been able to get before.It also has an incredible zoom.  It is quick to zoom and allows  you to capture moments much farther away than most point and shoot cameras.If you are looking for an incredibly easy to use point and shoot camera that will take amazing pictures but also offer plenty of pre-set and manual features, look no further.  I promise you will not be disappointed.", "Date": "September 5, 2010"}, {"Title": "PANASONIC ZS5 BEST IN CLASS?", "Author": "D. A. Paulon", "ReviewID": "R2ZLJWGYDFC2BX", "Overall": "5.0", "Content": "The question is whether the Panasonic ZS5 is the best in the 2010 class of point and shoot cameras.  In my humble opinion it is.  All of the reviews written against this camera, for example poor picture quality and not a real 12X Optical Zoom(you've got to be kidding), are simply not true.  Even the favorable reviews are not necessarily true.  I have been taking photos of some kind over 45 years and I have yet to find the \"perfect\" camera.  Of course, I am not a professional, but I feel I am more than just the casual photographer.I have tested the ZS5 camera against an older, but more expensive Casio Exlim 7.2 Megapixels and my Nikon D70.  All of these cameras are very good, but I wanted to take a more versatile camera on our recent trip to Alaska.  The picture quality was just simply outstanding.  Were all of them perfect?  Did all the 500 plus photos turn out with perfect contrast, sharpness, and focus?  No, to both questions.  But taking pictures of Orca whales on the move, which turned out very good, and a still picture over Resurrection Bay are quite different.  The camera performed in excellent fashion when properly used.  For example, in  manual mode it took almost perfect pictures of the moon rising over the mountains on Resurrection Bay and in IA, the camera performed very well in the sunlight over Exit Glacier.  However, you will get washed out colors, especially on white capped mountains when taking the picture into the light. But that is what most any camera would likely do. One review accurately noted that putting the camera in Scene mode would be very beneficial and I agree with this observation.  And of course, Manual, Aperture, and Shutter speed modes are all there to learn and use to take better pictures by anyone.The camera also did an excellent job with the true 12X optical zoom plus the 4X digital.  Excellent quality if one holds the camera still.As other reviews have noted, the ZS5 does an outstanding job taking macro zoom pictures.  Taking video movies with the camera also showed excellent results; just don't move the camera too quickly.I highly recommend the Pansonic ZS5 digital camera as an all around camera.  To those who are still undecided as to which point and shoot camera to buy, you will not be disappointed with the Panasonic ZS5.  For those who have purchased the camera, stay with it.In conclusion, this is still a point and shoot digital camera.  These cameras have come a long way in quality and price reduction.  All of the major companies make great point and shoot cameras, but that is exactly what they are.  These kinds of cameras have a place for good photography but are no match for a digital SLR, but again, when hiking up the Harding Ice Fields near Seward, Alaska, the Panasonic ZS5 was a perfect litte pocket camera to carry.", "Date": "September 2, 2010"}, {"Title": "Panasonic ZS5", "Author": "Pixl Junke", "ReviewID": "R1U2H7SPTCBQ3V", "Overall": "5.0", "Content": "The Panasonic \"Z\" Series in one word ... ROCKS!As a professional Photographer, image quality is everything.  Forget about what you may have seen, heard, or read from the big-spenders over at Canon or anybody else.  NOBODY has a P & S that can hold a candle to a Panasonic Lumix.  I know, I've used or owned most of them, done side-by-side pixel comparisons . . . and dollar for dollar they can't touch the image quality you'll see right out of the box with this camera.Here's why: Lumix cameras have Leica lenses - which are quite possibly the finest glass in the business. Second, Lumix cameras have set the standard for image stabilization, which is extremely important for razor sharp images.  Lastly, you don't need to think about getting a perfectly exposed picture, because Panasonic Lumix camera have the most advanced calibration system.  Put it in iA mode (Intelligent Auto) you can be assured you're going to have a perfectly exposed image 99% of the time.  Like Ron Popeil said, \"Set it and forget it!\"Again, dollar for dollar, the Panasonic ZS5 (or ZS7 if you shoot a lot of video) is the best P & S camera currently on the market.  NO disappointments!  Check out [...] for examples.", "Date": "October 20, 2010"}, {"Title": "Good photos but the video with it's zoming is its strong point", "Author": "Lawrence W. Stephens", "ReviewID": "R3V2IRGX6S38P4", "Overall": "4.0", "Content": "This is a combined Sony DSC-H55 and Panasonic DMC-ZS5 review. My wife first bought the Sony and was happy until she shot some video. We next tried the Panasonic. They both are very close in the photo results. In normal light and 1 to 3X focal length, they are for the most part equal with Sony having the edge. At max telephoto the sharper lens of the Panasonic makes itself known. In poor light the Sony is very soft and the Panasonic is sharper but noisier. If you don't use either camera for video they are quite close. Now video is another matter. Here it is straight from the properties from a clip from each camera. The Sony records at 1280x720 data rate 9,148 29 frames/second. The Panasonic records at 1280x720 data rate 31,168 30 frames/second. Sony uses MP4 and Panasonic uses MOV. Sony's video is good only for video sharing, moving video to MP4 devices and the like, a lot of pixilation. Shown on a large 16x9 LCD display it is worse than a good SD video. We did not look at the Canon because they lock out the zoom when shooting video. The Panasonic focus while zooming is quite good. There is some zoom noise but it is low. I would recommend a bridge camera if you can get by with the larger size and greater cost as the P/S large telephoto lens/sensor are just too much of a compromise.  In summary, Sony photo 3.6 stars and Panasonic 3.5 stars. Sony video 1 star and Panasonic video 4 stars. Best P/S I've seen is the Canon SD780 IS 3X telephoto. Because we had this camera to compare to, the Sony and Panasonic got low marks in sharpness and noise.Update 8-2-2010: I removed the camera from i/A mode and set the ISO not to go over ISO 200. We are now getting much better photos. The Panasonic I/A mode moved the ISO up too quick. After a couple of hundred photos, I now give this camera 4.5 stars.", "Date": "June 4, 2010"}, {"Title": "Very disappointing picture quality", "Author": "Amazon Customer", "ReviewID": "R24RSVY3MF5B5R", "Overall": "2.0", "Content": "After nearly a month reviewing point and shoot cameras, I eagerly awaited the Panasonic ZS5.  I was looking for a replacement of a Canon A80 that finally died after a number of years.  I was also hoping for a camera to replace an old Canon G1 that I've used for years for eBay (it takes very good close-ups, but has trouble with some colors, and focusing on reflective objects).  I primarily wanted a small point and shoot for my wife, and for times I just need to take a quick snapshot.  I also want some manual flexibility to take pics for eBay, etc.  I use a Canon 30D for most picture taking, and consider myself an enthusiastic amateur.I took about 40 pictures today from landscapes to macros to portraits ... full sun, indoors with the flash ... mostly in iA ('intelligent auto') mode and some in 'P' mode.  Wide angle pics, and zoomed all the way in, and in-between.  I would rate each shot from poor to fair.  One photo of my wife in full sun was 'good.'  I loaded the pics into Lightroom, and looked at each at full size (12M, 1:1).  Each and every image looks pixelated to me: edges are not crisp, with feathering evident almost everywhere.  Not one was as sharp as I would expect...in fact poorer than the much older Canon cameras!  Of course, it's possible I received a camera with a problem, but I'm not willing to try a replacement.  The photos are so poor that I am returning it to \"OneCall\" (company) on Monday.  Most unfortunate is the 15% open box penalty I need to pay to return it.  One possibility mentioned by another reviewer is that the 'iA' mode is the source of the quality problem.  Most of the pictures I took were in this mode and some of the images look \"over-processed\" to me.  For example, grass looks unnatural, the colors seem \"monotone.\"  I can see obvious noise in shadows.  I thought that maybe the camera was using a high ISO setting, but most of the outdoor photos were at 80.This is what else I can say about the camera....  The controls and menu system are well thought out: it was easy to use.  The zoom seemed a little \"touchy\" ... a bit too fast and it was easy to zoom too far (but this is probably something one can learn to compensate for).  Macros seemed good: you can get very close to an object, so I was hoping it would do well for eBay.  However, again, looking at full size images, there was some blotchy pixelization (sp?) that was very evident.  Of course photos for eBay would not be so large and these faults would not be so noticeable, but that doesn't save the camera. Some of the outdoor photos were \"blown out\" ... meaning highlights were totally washed out.  None of the photos \"popped\" ... colors seemed somewhat muted.While writing this, I decided to try another test.  I took a number of photos of a stark object with deep blacks, whites and primary colors (a can of spray paint).  The lettering, for example, is a crisp white font on a pure black back-ground (I checked the edges with a loupe to make sure).  There are bands of deep colors next to one-another.  Each photo I took rendered the colors ok, but there was a definite gray fringe around all the white letters.  A band of deep yellow next to a band of deep blue clearly showed yellow bleeding into the blue.  I took the same photos with the Canon G1, and this was not evident (of course, the Panasonic pictures were larger than the G1's, but I couldn't see any trace of this problem with the old Canon).I cannot recommend this camera based on my limited experience with it.  Maybe I received a lemon, but I suspect the 'iA' mode is at fault.  I've purchased many items from Amazon over the years, and this is perhaps the first one that I must give a negative rating.  I'm also not so thrilled about the $40 I need to pay \"Onecall\" to test drive a dud.  There are other purchasing options (for about the same price) that do NOT charge a 15% restocking fee if only a limited number of pictures are taken.  I would advise buyers to check first.  I will go a different route when I buy the camera that will replace thisPanasonic.5/9/2010 UPDATE:  I'd like to acknowledge that the restocking fee was waived by OneCall (vendor).  When I received the return authorization I was told about the fee, and when I responded to a followup email, I expressed my displeasure for the reasons I mention above.  I LIKED the camera, but thought the quality a problem.  A return email--late last night, indicated they would remove the fee.  This was very gracious of them.  Their customer service proved in the end to be excellent!  I added a star to the review since I am happier with the overall experience, and don't want the review to reflect negatively on the vendor (only the camera).", "Date": "May 8, 2010"}, {"Title": "So, what did I think", "Author": "jbe", "ReviewID": "R2FQASNUBINHF3", "Overall": "4.0", "Content": "I'm not a professional photog, nor an acclaimed amateur, just someone who likes to take pictures and loves gadgets - especially cameras.  I'm not new to digital to cameras, this is my 7th digital camera, that includes two DSLRs.  I can spot quality products, and this one is definitely up there with other cameras in this price range, and then some.  The body is metal except for the battery and SD card door, which is plastic.  The door, just like most other digital cameras, is flimsy, but the problem here is that the latch used to secure the door seems cheap.  It works just fine, and probably will last, but if you hold the camera and admire the fit and finish of the entire camera, the battery door is kind of a joke.  The menu system takes a while to get used to, but it has every manual control (except flash output) that you can think of.  The optical image stabization is awesome, and I can't get over how well the zoom works.  It's a little bigger than most pocket cameras, but because of the 12x zoom, it has to be.  the picture quality is simply outstanding, this is comparing it to my Nikon D50 with the 18-70 ED lens.  The Nikon is nice, but it's 6MP is limiting.  I also compared it to my Nikon L15 8MP P&S;, and still, the ZS5 images are better.  the build difference between the L15 and ZS5 are close.  the Nikon L15, while it's an older model, is smaller, built very well (while being plastic), still doesn't have the heft of the Panasonic.  The Panasonic is a little bigger, but it does so much more, and it does it better.  Again, probably not apples to apples, but that's all I have to work with.The HD video is great.  I did some video while walking and then stopping, and the OIS was on auto, the video was a little jerky, but as soon as I stopped and started zooming and panning, it was great video.  to view your videos don't try to use a PC if it's underpowered, it will look like crap.  Use a Mac or your TV and you'll be amazed at the video this camera produces.It's a fantastic all around camera take along any outing.  It's not really a great \"through in your pocket camera\", because it's a little big, but it will fit. get a small quality case for it.  Need to watch out for scratching the screen, it's shiny and smudges real easy.  probably best to put a cell phone screen protector on it.summary:  I gave it four stars because I don't think it's perfect.  I think that the new Panasonic LX5 or even the new Nikon P7000 might earn a five star rating, but I don't think I'll be shelling out [...] right now.", "Date": "September 9, 2010"}, {"Title": "Video mode", "Author": "Y. Ding", "ReviewID": "R5W1L0NTRWIL8", "Overall": "4.0", "Content": "In video mode, this camera can zoom. In replay mode, it has sound from camera. These are two distinct features that I don't see in other cameras.But it stores the video in *.MOV file format. This format can not be used by Microsoft Movie Maker.I am very satisfied so far but like to provide this information.", "Date": "May 5, 2010"}, {"Title": "This thing is awesome!", "Author": "sunshinestate consumer", "ReviewID": "RG2467MUM5DJV", "Overall": "5.0", "Content": "I'm surprised that this camera doesn't have a little higher rating. I've owned it for about 4 months now and I have taken it everywhere and produced some fantastic photos including some shots of the President, the 1st lady, tons of celebrities, landscapes, NBA games, party photos, and even a panoramic of the Boston skyline at night which came out great. The zoom is phenomenal, it really gets you right up close compared to most point/shoot cameras. The picture quality is outstanding. I previously owned a Canon Powershot which was okay but produced more unusable photos than usable.This camera is a little bulky, but it is far worth it considering the lens capabilities. Also, like mentioned by others, the HD video is fantastic. I shot some footage around Times Square, (granted there's tons of light there) and even at night it looked like real HD Camcorder quality. The flash works good, however in low light conditions you will get a little blurry without a tri-pod, nothing new there. I find that if you use burst mode (which does disable the flash) you will get at least 1 out of 5 perfect shots and just delete the rest. I was reluctant to buy this camera because of the nay-sayers, but I am SO glad I ignored them and bought it anyway. LOVE THIS CAMERA!", "Date": "December 13, 2010"}, {"Title": "Panasonic DMC ZS5 vs Canon SX 210 vs Nikon S8000", "Author": "Nitze", "ReviewID": "R1KNM7HMTGXT77", "Overall": "5.0", "Content": "The title of my comments presents the dilemma I had before going to a camera shop and holding them, testing them and talking with the salesman.  My research suggested, despite the media hype and ads and especially Consumer Reports high recommendation of the Nikon, that I select the Panasonic and I did and I think it is GREAT!!!!!!!  It is the only one of the three in its \"macro zoom\" point and shoot class that had a built in flash (not an annoying pop-up that conflicts with one's hand), has a battery charger that plugs directly into the electrical socket (don't we all have too many adapters and chargers in our lives already to deal with still another cord???!!), had versatility of both Auto and powerful Manual, had nicely placed and useful controls and had a \"handle\" to make it easier for this medium sized woman's hand to hold the camera steadily and comfortably.  The photos are just fine and superior to the Canon Supershot 1200 IS that launched me into the digital photography world.  I plan to use the Canon from time to time, but I am looking forward to my new Lumix world-- for travelling and recording sporting events -- and hope others join me.One question:  \"What do you recommend for a camera case for the Panasonic ZS5?\" Semi soft case? hard? And what manufacturer and model?Thanks!", "Date": "July 8, 2010"}, {"Title": "Little but mighty !!!!", "Author": "denwin", "ReviewID": "RHU4X0AB01SHO", "Overall": "4.0", "Content": "The image quality of this small 12.1 camera ia amazing !! Battery life is super. fits in a shirt pocket. I have a Panasonic/ Lumix slr and the pictures are as good or better. One better aspect is the 24mm wide angle. It will photograph 3 walls of a room. If you wish to be creative it responses to all adjustments of any manual camera. Candle light photos, fireworks, lightning, panaramas, stage shows!!! I feel it is equal to any $1000 SLR you can buy today!!! No changing of lenses, no heavy weight to tote. Downloads easily to the computer to iphoto, and spit them out in an email in seconds !!!!Best value you can find on the Internet !!! Just type www.Amazon.com. Happy Holidays !!!", "Date": "November 21, 2010"}, {"Title": "If you enjoy customization, this is for you", "Author": "Dudeman", "ReviewID": "R39ZR49BEUIFHH", "Overall": "5.0", "Content": "Perfect for the advanced photographer looking to customize his point and shoot experience.Don't pick this camera up and use the \"intelligent auto\" function. If you do this, your photos won't come out the way you want, you'll have basically no customization, and you shelled out an extra $100+ when you could have bought a coolpix.However, after taking my time learning this camera and all of its features, I find that I can take a nice, clear, zoomed, photo in almost any motion, brightness, color, hue, setting, scene, etc. I use the \"A\" or \"scn\" setting on almost all my photos. Also, the zoom is very, very nice.Some of the photos look a little matted (2D) when enlarged, but for the most part the pictures come out very nice looking. Until you go to make posters of photos taken of moving targets in the dark, you'll be fine with this piece of technology.I paired it with a sandisk class 10 30MB/s 8gb card and that allows me to use the \"hi-speed burst\" setting to take nearly 70 consecutive photos before outrunning my buffer.The best: awesome image stabilization lets me take movies and pictures without shaking or blur even with shutter speeds as slow as 6sec without a tripod. Because of this, I rarely ever need the flash.The worst: I keep leaving it at friend's houses. I guess others might find it not so appealing to have to read about their camera prior to optimal operation, but I liked that part.", "Date": "August 23, 2010"}, {"Title": "Great camera for price", "Author": "Daniel Elder", "ReviewID": "R38P9O3AZLTO12", "Overall": "5.0", "Content": "This camera is pretty awesome. I bought it back in June 2010 (it is now March 2011) and I have loved it dearly. My future brother in law researched the best camera for himself to buy, and I just went and bought one also. I will upload a few of the better shots I've taken with it to the customer action shots section. I paid about $220 for it back then, and now it is dropped in price to about $180, so it is even a better deal.I obviously haven't gone out and tried every single camera out there, and I'm not some kind of photo-phile (or I wouldn't have bought a $220 camera), so that is where I am coming from. I'm not a professional reviewer or anything, I'm just giving my opinion. I have used many cheaper (sub $300) digital cameras before, as that's usually all I buy. This camera doesn't suffer from any of the problems I've usually seen cameras suffer from, like failure to focus quickly, or taking for _freaking_ever_ to process a single picture. This camera is pretty quick, even with flash on, and usually takes a great picture the first time. Now I can't say it is a perfect camera without faults and takes the best pictures ever, because then it would probably cost more than $200, right? And then you'd probably just end up dropping it and breaking your $1000 camera, I know I would.PROS:CheapHuge lens and 12x optical zoomLots of options for taking customized shotsTakes pictures pretty quicklyCONS:Not as good as a $500 or $1000 camera, obviouslyBattery latch seems flimsy and light, but i think it might be because it is spring loaded, and I haven't had any problemsTo really get the most out of this camera, you will have to play around with the settings a bit, which might be complicated at first, but the Automatic mode probably works fine for most situationsThis camera has taken many good pictures, and many bad pictures. The LCD screen is so big, though, that you can usually tell right off the bat if the image was blurry. The pictures usually come out great the first time. Even one of my friends said, \"Just use his camera... the pictures always come out good the first time.\" I've seen so many people struggle with their digital cameras (or, god forbid, a camera phone), not even trying to get the \"perfect shot\" but just trying to get a shot that wasn't blurry as heck. Once you get used to messing around with the custom settings, you realize you have quite a powerful little camera to play around with. Or, if you are just an \"automatic\" type of person, this will work at least as good as other cameras in this price range for that, too, and probably with better zoom!", "Date": "March 21, 2011"}, {"Title": "LOVE IT!!!", "Author": "Robyn P", "ReviewID": "R18T0NUHYYS04C", "Overall": "4.0", "Content": "I has a much older Panasonic with a 6x zoom but wanted an update. The Optical stabilizer on my old camera wasn't impressive. I always got blur when using the zoom. Not so with this camera! The zoom is amazing! I lowered the pixel count to 9 and the zoom increases. Amazingly clear zoom shots! I have noticed some fuzziness in night shots, but I have never used anything but the auto mode. The reaction to my pictures is overwhelming! Everyone thinks I'm a pro and have a $$$$$ camera!", "Date": "June 17, 2010"}, {"Title": "panasonic DMC-ZS5", "Author": "S. J. Greiner \"eyes32\"", "ReviewID": "R2CO0QAD6L3URY", "Overall": "5.0", "Content": "Panasonic Lumix DMC-ZS5 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom with 2.7-Inch LCD (Black)I just got this camera to replace a fujifilm 12x Zoom i got last year. It was just ok.  This camera is the BEST hands down!!!  Right out of the box great photos and movies, the best point and shoot camera with great zoom for a compact!! Nothing bad to say about this, the price is fare for this camera!", "Date": "April 4, 2010"}, {"Title": "DONT BUY ANY WITH PANASONIC WITH BATTERY ID SECURITY", "Author": "David A Nugent", "ReviewID": "RGYLXXFXUXC9O", "Overall": "1.0", "Content": "I onwed this camera for 11 months and took 168 pictures.  I bought it from Best Buy for $300 along with another $80 for a four year warranty.  After 11 months, the Battery ID-Security would no longer recognize either of the two Panasonic batteries I bought with it.  After two seeesions of bringing the camera back to Best Buy, they said it was non-repairable and gave me a $149 store credit as compensation!  The $80 warranty with 3 years remaining was a total loss.  Overall, I lost $230 because Panasonic wanted to sell more batteries!", "Date": "January 7, 2012"}, {"Title": "Panney Lumix ZS-5", "Author": "Too Tall \"LF\"", "ReviewID": "R1QFCJAY87RCX0", "Overall": "4.0", "Content": "I've used the camera for a month and I carry it with me almost all the time. For a point and shoot it is superb. I leave it in Program AE. Due to the lens limitation it has very shallow DOF so I just forget that aspect of creativity. If I want that I'll use my Nikon DSLR. Manual is not as easy to use as say a Canon S-90 but it is OK. It's feel, fit and finish to my hand is excellent. It has a solid feeling not like a plastic toy camera. Some might think it's too heavy, but I like it. Picture quality is excellent and the opitcal zoom is great. It would be near perfect with a larger sensor and an f2.0 lens.", "Date": "June 5, 2010"}, {"Title": "It just works", "Author": "John Carder \"chartguy\"", "ReviewID": "R388FXFGDFTUG7", "Overall": "5.0", "Content": "I'm an old school, 35mm guy, who used to shoot with a Leica M3 & M5. These were entirely manual cameras, not even SLRs.Ten months ago, I bought this as a simple, point & shoot camera, and I have to say that it has not let me down. Last week, I was visiting two friends who were building a new house. I wanted to take a picture of them in front of the living room windows. The sun was behind them. This is a prescription for disaster, with shadowed faces. The flash balanced the light perfectly, and I got both the background and the faces. No adjustment at all on my part, just the IA setting.I have done macro shots (gorgeous). I have shot a forest fire five miles away. I've shot in low light. I've shot in broad daylight. I've shot action shots. It has handled it all beautifully, and the knob stays on IA.Let me tell you about two other quibbles:The flash can take a second or two to charge up after a flash shot. I'd prefer it was a bit quicker, but given the size of the battery, that's all you're going to get.They polarized the view screen. That's actually a good thing, making it easier to see outdoors. The downside is that if you're wearing polarized sunglasses, and turn the camera 90° (portrait, not landscape), it will appear black (until you take off your sunglasses).For me, this is what a \"point & shoot\" should be. Plenty of zoom flexibility, combined with a big enough lens to work in low light and an auto setting that works for me. This is not a DSLR, but it does not try to be one. It is a camera that is small enough that I take it with me a lot more. I bought a Lowe case for it that has a small pocket that fits the charger perfectly. I have yet to run the battery flat, but this way, I can charge it in the motel when I go to bed, without having to carry a bunch of bricks.I had pretty much stopped taking pictures until I got this camera. Now, I'm snapping pictures all the time. It's just so easy, and it works.", "Date": "September 16, 2011"}, {"Title": "great alternative to lugging my DSLR", "Author": "M. Mahoney", "ReviewID": "R8YY8HSYG68T", "Overall": "5.0", "Content": "I usually shoot with a canon DSLR, and was looking for something to use when I don't feel like lugging a huge camera around.  After doing my research, I was going to go with the Lumix LX5, but I was hesitant about spending $400.00 for a point and shoot.  I saw the ZS5 in a store, tried it out and ended up deciding that this was the point and shoot for me.  I've been playing with it for a couple of days and am very pleased so far.  I always use the manual modes, and find that the camera has been doing exactly what I expect it to do.  It's also been taking some great pics in low light situations.  I was worried about shutter lag - because I remember having a hard time photographing my children (who never sit still) with my point and shoot from several years ago.  The shutter lag seems to be minimal, barely noticable, which is great.  I'm also stoked that I can now also shoot decent video with this camera!!!  There are so many photos I've missed because I was worried about taking my DSLR with me.....  Now I can always have a camera AND video camera with me and still end up with impressive pictures.", "Date": "January 26, 2011"}, {"Title": "Wonderfull camera", "Author": "BZ", "ReviewID": "RGT7Q67TG61FC", "Overall": "5.0", "Content": "I looked at many cameras before making this purchase. Panasonic has always been great with electronics and you can't beat Leica for a great lense. Like a combo made in heaven. The picture quality is amaizing. The camera is easy to use. I love it.", "Date": "November 23, 2010"}, {"Title": "My new little camera", "Author": "akv", "ReviewID": "R2JMKY8PDXJPDR", "Overall": "4.0", "Content": "Just got my hands on my new Lumix zs5. With whatever I have experienced so far, here are the bits:Pros:1. Excellent image stabilization, you can take pictures hand held in very low light. They obviously have grains as you would expect in compact camera, but images comes out much better then my previous Olympus camera (3 year old)2. Video recording is excellent in low lightCons:1. Mechanical button for on-off. I think push-buttons make more sense then the sliders in place.2. Proprietary USB data cable. I just don't understand why do electronics maker have to come up with their own design for standard things like USB cable? Can someone please help me understand that?I will keep on updating the review as I experiment more with my new camera.", "Date": "November 10, 2010"}, {"Title": "Panasonic Lumix DS5", "Author": "Graham Palmer \"Thylacine\"", "ReviewID": "R3AG9MFPPUAFFB", "Overall": "4.0", "Content": "You get plenty of bang for your buck with this model and you save a few dollars if you don't need the GPS feature of the DS-7.It has amazing HD video and burst capability and the 25mm wide angle and 300 zoom lens is an awesome combination.This camera gets more use than my SLR now days as it takes photos using Aperture or Shutter priority and Manual modes.", "Date": "September 8, 2010"}, {"Title": "Not Sure Of Picture Quality Yet", "Author": "L Wood", "ReviewID": "R3J3UZ8SZSMXBJ", "Overall": "3.0", "Content": "I purchased the Panasonic ZS5 camera in early August. I have taken  a cpuple of hundred pictures and several videos with the camera. The camera is user friendly but I would like to be able to refer to the operation manual while learning the features of the camera. The Instruction manual comes on a CD in the form of an Adobe PFD file that is some 170 pages in length. It is not a handy reference item to carry with you, although I could print the info to carry around while learning the operation.The camera has worked incredibley well in the video mode, although the file is quite large.I have tried to use several of the options in the picture modes. The pictures look very good on the camera screen, but when downloaded to the computer and cropped to a standard picture size to be printed (5x7, 8x10 etc.),they are quite \"noisey\" or \"grainy\" in a lot of cases. They can be improved with photo editing software, but I am disapointed that they have to be worked on that much.I have not printed any of the pictures yet. I think that the printed copies, after editing,  will prove to be acceptable in most cases, but they do not appear to be as sharp and crisp as pictures fron my small Canon point and shoot or my Canon DSLR.Further work, knowledge, and refinement on operation of the camera may correct all of the negatives I feel at this time. The 12x optical zoom is great in a small point and shoot camera. And it has a lot of desirable features. Pictures seem to just be a little soft in most cases.", "Date": "August 28, 2010"}, {"Title": "Great travel camera", "Author": "Benson C. Look", "ReviewID": "RSMP9W0SEU3PW", "Overall": "5.0", "Content": "I wanted a small pocket camera for when I travel.  I looked at several other cameras from Nikon, Fuji, Kodak, etc and decided to give the Panasonics a tried.  I tried the DMC-FH20.  I found it too small for my hands to use and the lens performance was not to my liking.  I felt my fingers were getting in the way of the camera's flash and sensors.  Some of the pictures just weren't sharp enough for me.  I exchanged it for the DMC-ZS5.  It had all the features I wanted.  The ZS7 has GPS which is not that important to me.  I couldn't justify the added cost for that feature.Pros:I like the physical size and the hand grip.  It feels well balance with controls that are easy to reach.  Thumb of right hand holding the camera is comfortable and doesn't interfere with any control.Lens is genuine Lecia lens.  Larger higher quality lens then the one used on the FH20.  In order for cameras to be built smaller, you have to compromise on the lens quality.Images in good light are excellent.  Photos are sharp with good depth of field.Optical lens range from 25 to 300 is fantastic.  This camera is getting me to think about retiring my older Kodak P712.Menu system is pretty straight forward.  Took some time to learn were everything is, but getting use to it.  I most cases I just push buttons and found out how to access the different features without having the read the manual.Shot short video clips that came out great.  Beats having to carry a video camera as well.Cons:Low light performance is not as good as my older Kodak P712.  Experience a lot more noisy and out of focus photos.Weak flash good for close distances only.  I did supplement it with a slave flash for night time and some indoor shooting.I would have preferred a push button for the review instead of the slide switch.  With how much I switch back and forth from camera to review mode, I don't know if the slide switch is going to hold up.Shooting at 12 megapixels creates large files of about 6 meg each.  This takes up hard drive space and takes 3 times longer to upload to printing service like Shutterfly as compared to my older 7.1 megapixel Kodak P712.Bottom line:I highly recommend the camera.  I am still learning the different program modes and seeing how they work.  Every camera has its own design personality with things I like and dislike.  With that in mind you just have to learn what the limitations are and how to work with them.  Over all I happy with this camera.", "Date": "August 18, 2010"}, {"Title": "HORRIBLE CUSTOMER SERVICE", "Author": "Melissa M. Belmonte", "ReviewID": "R4CJMFZ01CWGF", "Overall": "4.0", "Content": "Great camera, but I received a broken battery charger, and the process to get it replaced under warranty has been ridiculous.  Panasonic seems to have horrible customer service.  I still haven't received a replacement charger after speaking to them several times.  This is ridiculous.  Even if I love the camera after using it for a while, I would never buy another Panasonic.", "Date": "July 28, 2010"}, {"Title": "Excellent in daylight, needs some handling at night", "Author": "Utayba", "ReviewID": "R2BFV4WB8W4W3F", "Overall": "4.0", "Content": "I'm not a pro photographer but I do understand the basic of photography. This camera is very good. In daylight you can get excellent pictures whether you use manual or automatic settings. The iA works quite well too.. in iA the chosen scenery mode shows up when you try to focus the picture, and it has been quite impressive so far. However, things are not that easy at night.... I took many night photos in NY city. When the flash is on, the photos came out fuzzy in many cases. Things got better when i forced the flash off, but the photos came out dimmer naturally. I think the image stabilization becomes very sensitive in low light (you really have to be very still to take a good photo with the flash on)...Controls, build, and ease-of-use are all very good and live up to expectation. The battery/flash locking piece is a bit flimsy, but is holding on so far....Things I love about this camera:- excellent photo quality in daylight- excellent zoom- excellent HD video and stabilized/smoothed zoom-in during video shoot.I do recommend this camera as a point and shoot.... but remember it is point and shoot +++ but not an SLR.", "Date": "July 7, 2010"}, {"Title": "AMAZING Camera!!!", "Author": "Georgia", "ReviewID": "R375NZRNGL90GA", "Overall": "5.0", "Content": "This camera is AMAZING!! I was shopping for a new camera before taking a vacation in France. I wanted to be able to take focused photos without a flash, take photos quickly and have colors and light register truthfully. This camera did ALL of this. The Leica lens is what sold me, and for the price...its a joke how good this is.", "Date": "July 6, 2010"}, {"Title": "Excellent value, well designed camera", "Author": "Ken Kaufman \"Lak Boymer\"", "ReviewID": "R1OIXXK68PK2QE", "Overall": "4.0", "Content": "The good points of this camera have been well described.  For me, size and layout of controls are excellent...any smaller and it would be difficult to handle.  The controls and menu selections are easy to use.  And, overall, picture quality is good to excellent.  That said, most of my photos are scenery, usually involving contrast in brightness, colors, and depth of field.  In scenery mode, camera will not focus closer than 5 meters, so need to be aware of that.OK, one BIG complaint.  I got into photography ages ago, when rangefinder 35 mm (Leica) cameras were about the best, then SLRs were developed.  My previous digital cameras all had viewfinders.  The problem is...MOST compact digitals rely on a battery hungry LCD display that is not worth squat in sunlight!  I've tried to photograph incredible vistas...sun and clouds, ranges of mountains, mists, etc., without much guidance from the LCD display.  Granted a good viewfinder (parallex correction, etc.) would add to costs, but...for so many situations it would really help!", "Date": "July 2, 2010"}, {"Title": "\"Great little point and shoot \"", "Author": "T. Lindsay", "ReviewID": "R3PFI5WRF9XRSZ", "Overall": "5.0", "Content": "I'm a novice , but I'm thoroughly pleased with my results. I used it outdoors today for the first time WOW !! Clarity and colors look great. Indoor pictures are great with proper lighting. With low light good not great. I'd highly recommend. HD video is a pleasant bonus crystal clear. Definitely a keeper. I'm headed to the Bahamas in July I can't wait !", "Date": "May 22, 2010"}, {"Title": "Less Than a Year Old & Already Malfunctioning!", "Author": "T. Harris", "ReviewID": "R1TDF7HXXLA9L1", "Overall": "2.0", "Content": "We did a lot of research on this camera, as it was being offered by Best Buy for $200 a few months ago. We desperately needed a new camera as the one we'd had for 5 years had died. We wanted a camera that had a built in video camera especially, because we have a toddler & wanted to capture special moments on video w/o having to drag out a separate camera. The reviews on this were good, and in our price range. We knew we wouldn't get a better deal on a video/digital camera so we went ahead & bought the Lumix.Honestly, the camera has way more features than we were looking for & the instruction manual SUCKS. There were a lot of things that I had to look up online, but for just snapping pics of our son & taking video, it was great. However, we've had the camera only 10 mos now, and it's already been malfunctioning.First, odd lines like a grid showed up on the screen when taking a picture. We never changed any settings, and have NO clue why it just started doing that. Luckily, they don't show on the pics themselves.Second, when using the \"baby\" feature (a very neat option that puts in our son's name & age at the bottom of pics when in this setting...there's also an option for our dog that does the same thing) it suddenly started turning all the pics blue. All other pics in all other settings are normal color, but when in the baby setting, there's a weird blue hue. Again, we changed NOTHING in the settings.Third, the zoom button has been sticking the last week or so, and when we turn it to zoom, it doesn't stop like before. Now, it keeps zooming ALL the way to the last zoom setting. And tonight, we set up our Christmas tree, and I tried to take pics of our son in front of it & the button to take the pics just stopped working altogether.The battery is brand new, and we take very good care of this camera. Am not sure why it's malfunctioning so soon after we bought it, but we can't afford a new one, and def won't be buying a Panasonic any time soon.", "Date": "December 5, 2011"}, {"Title": "Exceeded Expectations!", "Author": "Marilyn Scott-Waters \"The Toymaker\"", "ReviewID": "R37LQIEO7LQ6L5", "Overall": "5.0", "Content": "I'm a children's book illustrator and bought this camera to take reference photos. Little did I know that I was getting a camera that also took beautiful pictures without having to be a professional.I was at the nursery and was snapping pictures of the flowers, not really paying attention to what I was doing. When I got home and downloaded the photos they were incredible. You can see the pollen on the stamens and the dewdrops were crystal clear. Colors = spot on!Another great feature is the battery charger. My old Coolpix ate batteries like candy. With the Lumix all I have to do is plug it in for a couple  hours and I'm good for days.I'd read that this camera wasn't that great for indoor low light photos. I use the \"food\" setting which works fine for me. It's under the \"Scene\" menu.So if you want a wonderful little camera that makes taking pictures a joy, the Lumix DMC-ZS5 is for you.Here's a link to a photo I snapped in my front yard of a dragonfly.[...]", "Date": "July 2, 2011"}, {"Title": "Simply the Best", "Author": "Kevin Rose", "ReviewID": "R39Q4FXKGLKFAK", "Overall": "5.0", "Content": "There is a lot of good information out there so I will keep this brief.I have worked in the electronics industry for six years now, I have sold hundreds of cameras.  In my professional opinion this is the best camera you can buy.  With a high quality Leica lens, a 12x optical zoom, Panasonic's high quality brand name, and all in a point-and-shoot sized package, there is no reason to buy any other camera.I only gave this a 4 star for ease of use because this camera has a lot of great customizable options for pictures that I love, but that a beginner might be overwhelmed with.  Don't worry though, just leave it on \"intelligent automatic\" mode and you don't have to worry about it!", "Date": "June 30, 2011"}, {"Title": "two months in and still happy", "Author": "jgenivive \"jgenivive\"", "ReviewID": "R1NDCTWIP2P3SE", "Overall": "4.0", "Content": "I've been in love with my old Canon Powershot, so intended to buy a replacement Canon.  I was seeking manual controls, a high range of manual aperture, shutter speeds, and ISO, and of course high image resolution, high zoom, high quality, and lots of flexibility.  This Panasonic caught my eye, and had all of these features.  Some reviews for the Canon equivalent complained about the placement of the flash and spinning dial to change manual functions.  This camera's setup avoided those problems.  It's taken great pictures so far, in both Auto and Manual modes.  Battery life appears good.  Only disadvantage is that it lacks manual focus and the aperture range is somewhat limited.  Also, the camera will stay in Macro mode even after you turn it off, so make sure to take it out of Macro when you're done.  Great pocket camera.", "Date": "April 5, 2011"}, {"Title": "Used it for 2 weeks in Africa", "Author": "Bert", "ReviewID": "R33NZM0E3IXJLM", "Overall": "5.0", "Content": "I bought a ZS5 a  month before our trip to Botswana.  It took fabulous pictures that were so good we could see the incredible detail on a small bird 15 feet away. Some of them were breath-taking.  My wife called them National Geographic quality.  I used the auto IA mode for all the pictures.  Never a problem.  The zoom was great.  I had trouble under low light in the evening taking zoom pictures but so did the guy next to me with his $800 digital SLR.  When we were finished we compared the lcd pictures and mine looked identical to his. Later, on the computer, they were spectacular.  I am a casual photographer and I have never taken pictures like this before. My wife was using an older Sony camera and about 20% of her pictures were blurry because we were in a moving land rover or in boats or dugouts.  I had maybe 2% of my 500 pictures that were blurry which I attribute to the camera's anti-shake capabilities.  Maybe someone with more  experience would do better but I had these problems: 1)I wish it had a view finder.  The lcd screen in the bright sun was hard to see and I couldn't find small birds.  I missed a few pictures as a result.  2)  I wish I could see the manual.  The CD that came with it explains the computer side  but I still haven't found how to use the camera.  I would love to turn off the feature that shows the last picture taken for a few seconds which delays the next picture.  3)  The battery is supposed to last for 330 pictures.  After 220, the camera showed a full charge.  At 240, it showed 2/3 charge.  At 250, it said I had no battery power left and shut down.  A little more warning would help. That was my experience and as I said maybe someone more knowledgeable with cameras could avoid these problems.  I am going to try to sort these out because I've never taken pictures like this before.", "Date": "February 24, 2011"}, {"Title": "Not a bad little point n shoot", "Author": "cianke", "ReviewID": "R33ZQG2H1DNRTV", "Overall": "4.0", "Content": "I recently got the ZS5 to shoot pictures of my kids and to have something small and portable to capture those quick moments when I would miss the shot trying to get out a DSLR and mount a lens and....I chose to go with the ZS5 instead of the ZS7 for a few reasons. First of all I never shoot video with my stills cameras. I just feel that they are better off shot with a proper video camera. (I wouldnt brind a spoon to a knife fight either you know) I also dont really need the GPS function personally. It might be a nice feature if you travel alot but I always label my folders on my computer for my trips so I didnt see spending the extra for me. Last and not least price. I got the same image quality, which is what cameras are about, for less money.Overall I have to say I love this camera. It takes great shots. They are sharp and have nice color. My wife even decided to get the same camera after I wouldn't let her steal mine. My only complaint is the playback function switch. It can be awkward after being used to just hitting the shutter button on other models to go back to shooting pictures. I have missed a couple shots cause I forgot to put the switch back in recording mode. This is the only reason I gave it 4 stars instead of 5. It isnt as big of a deal now that I am used to it but and I really would purchase again after seeing the pics.One last thing I really love about this camera I love is the macro modes and how close they focus. I took a picture of a flower on a weed in the woods behind my house and basically put the lens in the flower to take it. It came out Tack sharp and made the little 1 inch flower look as big as a daisy. I love it!!!!!", "Date": "December 10, 2010"}, {"Title": "Powerful, no simple to use as a point and shoot", "Author": "Robert P. Raines", "ReviewID": "R1W99QUD90243D", "Overall": "4.0", "Content": "If you want a simple point and shoot, and don't know much about advanced settings about camera's this might not be for you. I still struggle with it, but I knew going in that this camera may require additional time to set it up right.Outdoors + sunlight it takes amazing photos.", "Date": "November 28, 2010"}, {"Title": "Excellent Camera", "Author": "JSK", "ReviewID": "R3LBHJG0SGMH2P", "Overall": "5.0", "Content": "I have used Canon and Sony cameras in the past and can say that this camera gives much better pictures than either of the others in the same class. The macro is awesome and the details and colors are beautiful in the photos it produces. Also, having the additional zoom capabilities are a great feature that is difficult to find in other cameras in this class and price range. I would recommend this camera for those looking for a good point and shoot camera or someone looking to do a little more as it has many functions.", "Date": "September 30, 2010"}, {"Title": "Solid Travel Camera", "Author": "I am Sam \"Sam\"", "ReviewID": "R42GK578UA4Q5", "Overall": "4.0", "Content": "Just came back from my vacation with the new ZS5 bought from Amazon. So far I like it as a travel camera.Pros:1. Battery life. No additional battery was needed after whole day of shooting pictures and short videos at Seaworld.2. Wide Angle and Powerful Zoom. It makes my life easier when I need to take pictures across the street or cover as much scenery as possible.3. Picture quality. The quality of pictures comes back surprisingly good in most cases given the fact I shoot most of my pictures at daylight. The white balance in most cases is correct.4. HD Video. O.I.S. makes the video quality very good.Cons:1. Low light performance. Don't expect anything good after sunset even with flash.2. Moving object.  Better use DSLR for running kids because of the shutter lag.3. Learning curve. There are 178 pages of user manual to go through before you can master the function.4. Face recognition.  Sometimes it is not fast enough and sometimes the shadow on the face makes it fail to work.5. HD video. It is stored in mov file and I wish it can store the video in avi file and encoded in h.264 format which is the standard media player format.In short I like it as a travel camera because it gives you lots of flexibility in a compact body. As long as you know when and where to use it you will get good result. At the price of $200 I am happy.", "Date": "September 7, 2010"}, {"Title": "Super, wonderful little camera!", "Author": "Passionate Dressage Diva \"Passionate Dressage...", "ReviewID": "R24V842P1PPC7A", "Overall": "5.0", "Content": "I got this camera for my horseback riding vacation to Scotland. It did not disappoint. I used the 'intelligent auto' mode and can't say enough good about it. The zoom and quality of photos was incredible! The image stabilization worked like a charm. The wide angle was fantastic for the vistas of the Highlands. The motion picture mode and continuous shooting features are also excellent. The software is very user friendly and the directions on how to use the features is excellent. I took one extra battery and a 16 GB card (didn't want to run out of room). Originally I only wanted to spend $150 or so. But am sooo happy I went the extra and purchased this camera!", "Date": "July 15, 2010"}, {"Title": "great small camera", "Author": "David", "ReviewID": "R1KC1WSH37FMLD", "Overall": "5.0", "Content": "I was attracted to the ZS5 because of Leica lens quality and the versatility of the 12X optical Zoom and the ability to take movies.  The camera exceeded all my expectations.  The pictures I have taken so far are very good, and I expect them to get better as I become use to the manual controls and automatic setting. Plus the small size means I call haul the camera every where instead of a bulky camera bag with a heavy long lens SLR. Now I not saying the ZS5 will replace a good SLR camera, but it does a great job in a small portable package.I think the thing that surprised me the most was the ease and quality of the moves.  I tried a few and now I am hooked.  So the feature I though I would use the least is now my favorite.", "Date": "June 24, 2010"}, {"Title": "Great quick pix camera", "Author": "C. T. Mansfield", "ReviewID": "RX91FHGN8629K", "Overall": "5.0", "Content": "This is the second Panasonic Lumix that I've purchased.  The first was stolen.  I love the sharpness of the images and the color clarity.The marriage of Panasonic and Leica is a good one.", "Date": "June 7, 2010"}, {"Title": "Persistant shadow", "Author": "VZ", "ReviewID": "RIU92V3YVWBLE", "Overall": "1.0", "Content": "I liked this camera very much for 18 months, then a mark appeared on the pictures as if there were dust or water spot on the lens.  I thought it an anomaly so ordered a second one.  Voila  Same problem the first time that one was used.  They continue to get good ratings, but twice burned... I'm switching brands!", "Date": "November 27, 2012"}, {"Title": "Lens Gets Dirty in Windy Conditions", "Author": "Jingle Male", "ReviewID": "RJBVN7IFFI9DQ", "Overall": "1.0", "Content": "I love this camera in every way except one.....and it is critical.  The lens is open to the air and after using in windy, humid or dusty conditions, the lens gets dirty on the inside!THE LENS GETS DIRTY ON THE INSIDE.  You cannot clean it.The camera store said it would cost more to clean the lens than to buy a new one.  ALL MY PHOTOS NOW HAVE GRAINY SPOTS FROM THE DIRTY LENS.Everything else about this camera is the absolute best: image stabilazation, powerful zoom, excellent control in manual, great preprogrammed scene control (love the aerial photo select and used in many planes).Unfortunately, a DIRTY LENS trumps them all.  I am looking for a new camera, which is why I am back at Amazon.", "Date": "November 25, 2012"}, {"Title": "Lens error lock up after light usage", "Author": "Dan", "ReviewID": "R2N5DHR06EVHJE", "Overall": "2.0", "Content": "I have had this product for two years, so it is out of warranty. I have not used the camera very much, but recently I received a \"Focus Error\" message \"Turn off Camera and Turn On Again.\" I looked online and saw that many other people have had the same problem with this camera. Disappointed in a product that doesn't last.", "Date": "August 25, 2012"}, {"Title": "Ehhh.", "Author": "Adrian B", "ReviewID": "R2L412UES19ACL", "Overall": "3.0", "Content": "The only thing is when recording a video at a place that is exceptionally loud such as Electric Daisy Carnival, the audio quality of the camera lowers itself to a really muffled sound and it is quite annoying if you're an audiofile. Other than that, picture are good.", "Date": "July 28, 2012"}, {"Title": "great lens and price", "Author": "King Skwirl", "ReviewID": "R2A16V7F2D5PKQ", "Overall": "4.0", "Content": "It was hard to leave my stealthy Canon 850is, especially with this heavier pocket bulky lens upgrade...but a good friend has several and I've enjoyed playing with them. it's hard to look back now. The new Lumix has a sweet 12x, 25-300mm equivalent Leica-branded zoom lens which was my deal maker. It takes great pictures, but truly shines if you come off of auto mode. In fact, the automatic settings are pretty mediocre and wash a lot of shots with over exposure or bad color balance. Take the auto mode off and start using the camera in programmed, shutter, or aperture mode and you'll get great pictures. The menu system is a bit cumbersome considering the extra levels for a simple format or base settings functions. Canon and Sony are simpler. Battery life is good. Biggest gripe is the on/off switch placement. It does not take much to trigger, and this has caused it start/open up while going into (and while inside) the Lowe padded case I have. It happens with a slimmer cheaper case I found on Amazon too.", "Date": "November 14, 2011"}, {"Title": "Super Camera", "Author": "FC Bob \"bob5958\"", "ReviewID": "R3BMCY4GYPECLD", "Overall": "4.0", "Content": "I've owned this camera for about a year and have put it to use on many occasions. It's been to the beach, graduations and I use it at work, professionally to photograph work related projects. In all of these uses, I haven't been dissapointed. The camera has perfomed well and has been reliable. The Leica Lens is sharp and has no detectable distortion in the 8X10\" size.Panasonic's Software in my opinion is the best. It's easy to use and intuitive.  The only \"downside\", is the battery. It's a propritary battery, where I would prefer AA Batteries.", "Date": "August 14, 2011"}, {"Title": "Review of Lumix DMC-ZS5", "Author": "Ansley", "ReviewID": "R3BP6DK02CMCRI", "Overall": "5.0", "Content": "The Panasonic Lumix ZS5/DMC-TZ8 meets my needs for a camera.  Those needs are: functionality (fast focus, quick flash); simple design in hardware (buttons are few and self-explanatory); a zoom with clarity.Although I've noticed this with every digital camera I've ever used, this camera is no different in its capture of light and color.  When there's an indoor picture taken using the ever-so-handy iA (intelligent auto) setting, dark brown hair becomes red.  Lowlights come to the forefront, and this same general occurrence holds true for most human subjects photographed no matter the hair color.  For that reason, I choose the M setting (manual) when snapping a candid shot of someone who isn't moving.  Sometimes I set it on M for any indoor pictures.I've found that objects are captured closer to their actual appearance outdoors using the iA setting.  Verdict: M is a good setting for indoor photography; iA is best setting for outdoor photography.The iA setting also conveniently detects the subject of your photography, and it selects the most appropriate setting to capture that subject.  You can see this as it happens in the top left corner of the display.  With this convenient option, the pictures you take are optimized.  Other features are a simple zoom function using the wheel around the flash button, and an easy zoom button that will automatically zoom to the framed subject.Overall, I prefer this camera for outdoor shots over indoor. The Lumix features numerous fun settings.  There's even a special setting for your pet(s).  The options are nice to have, and so is the video.  I've rarely used the video, but it is a clear picture with good sound quality.  If you don't wish to change settings often, I recommend this camera with its convenient (and high in clarity) automatic function.Camera rating: five stars...For ease of use, lightweight and pocket-size.  For the price range, I am happy with this camera and will use it for many years.", "Date": "August 3, 2011"}, {"Title": "Very Good Pocket Sized Digital Cam", "Author": "Alikazam", "ReviewID": "R2I2AVFRFPFQPK", "Overall": "5.0", "Content": "I love this camera.  Have had it for about 6 months and it is hands down the best little high zoom digital camera I've ever used.  I'm no expert, but the video that this produces makes m wonder why anyone would want a camcorder?  It zooms up to 12x in video mode while shooting video, though it is slower so as not to make noise on the video audio track.  I use it for car events a lot and videoing drag racing events and it works great!  I've even had several friends use it and say they were amazed how well it made them seem as photographers or videographers as the built in stabilization and intelligent features certainly helped versus older digital cameras.  I love it and my only real complaint is that it has a proprietary battery and doesn't use something off the shelf, like a AA.  I lost my charger too so had to order another one (off of Amazon of course), but that is not the camera's fault, so I give it 5 stars.", "Date": "April 29, 2011"}, {"Title": "Best P&S; camera I have owned", "Author": "Zaphod", "ReviewID": "R3LUA66RKVNDX", "Overall": "5.0", "Content": "I purchase supplies for a mid size construction contractor, and this is the best point and shoot camera I have purchased to date.  While it is not up to par with a more expensive DSLR, it is a super camera for the price this is at.", "Date": "April 26, 2011"}, {"Title": "Happy with my Lumix", "Author": "Maria", "ReviewID": "R1ALO6MI4YKNYM", "Overall": "5.0", "Content": "My Lumix Panasonic DMC - ZS5 takes very sharp beautiful photos. Easy to carry around in my purse and when I charge the battery, it last a very long time.  I still think I got a great deal on the price.  To my surprise, I found out that all my children have the same camera. My camera is black, my daughter's in-law has a hot pink one.  My daughter (who is a professional photographer) and her fiancee has the same camera, too. This tells you how great this camera is.", "Date": "April 24, 2011"}, {"Title": "Good Overall", "Author": "J. Capobianco", "ReviewID": "R6PD07V8R3AJK", "Overall": "4.0", "Content": "I bought one of these on Ebay and now have the TZ3,TZ4 and now the zs5.I shot the same scene with all 3 (and the fs15).The Zs5 and TZ4 were the best.While the zs5 offers more functions and reach, the TZ4 has sharper edges and slightly better color, it is also slightly better constructed. The zs5 controls noise slightly better, but the TZ4 has better low light noise and no chroma noise. There is no usable difference between the 12mp and 8.1mp image,its a lot less than you think. The tz3 and fs15 are good overall but neither are as uniformly sharp and good at high ISO's.If you find a good TZ4 for a good price don't pass it by. The Zs5 has a better movie mode, but you really can't notice the difference between the WVGA and High Defwith the exception of the amount of memory it uses.Update,after shooting only 521 pics the camera developed a focus and zoom error. It wasn't dropped, banged, os taken near sand. Forget this camera stick with the TZ4 of TZ5 if you can find a good one.Shame on Panasonic,seems they are going the same cheap route as Canon.", "Date": "March 16, 2011"}, {"Title": "Good camera", "Author": "JonathanB715", "ReviewID": "R3G0RU02FUDI56", "Overall": "4.0", "Content": "A little background about me:  I'm a casual photographer, upgrading from a Canon P&S; that was small, had a 3x zoom and took very good quality photos considering it was eminently pocketable.The Panasonic ZX5 is larger, but still pocketable (I don't wear tight pants - if you do you may not find it so pocketable).  Considering the effective magnification of the telephoto, this is impressively small.  I bought it because I finally broke the Canon after 4+ years of abuse.  I'm a cyclist and dropped that camera several times while going 20+ mph - the last time finally did it in.  I'm hoping the Panasonic will be similarly durable.Likes:-  partially metal body feels high quality and (hopefully) durable-  wide end of the lens is noticeably wider than the Canon.  I'm finding this very useful for a variety of shots.-  telephoto reach - the long end of the telephoto has astonishing reach for such a small camera.  I know other camera makers have similar lenses on their cameras in this category, too, but it really is amazing to be able to zoom in to the same extent as someone with a foot long lens on their full frame DSLR.-  In good light photo quality is very good.  I'm not a pro, and don't look at a pixel level.  Most of the shots are only viewed on my screen, then emailed or uploaded to a photo sharing website.  If printed, rarely over 5x7.  The quality of the photos is fine for my purposes.-  Menu system is well thought out and organized for the most part.-  Image stabilization seems to work well, certainly better than the IS on my old Canon camera.  Necessary for my shaky hands with that long zoom......-  speed and responsiveness is quite good - better than most cameras I tried in this price range.Dislikes:-  Low light performance - no better than my old Canon, and the colors start to look strange (greenish cast to yellows) as ISO gets bumped up by the camera.  I'm going to start using the manual settings to see if I can find some that work better for me in low light.  The combination of small sensor and slowish lens is normal for this price point, but will never make for a good low light camera.-  low light with that long zoom becomes unusable, even with IS.  The aperture gets smaller at the longer focal lengths, and if there's any motion you just can't find a setting that can give a decent shot.  A tripod helps, but this will never be the camera's strength.  Stick to shorter focal lengths in low light.-  Camera is quite heavy for it's size - I know when it's in my back pocket when out riding my bike.That's it - overall a good camera and good value, particularly now that it's being closed out (Panasonic has introduced replacements).", "Date": "March 16, 2011"}, {"Title": "love my camera", "Author": "shane", "ReviewID": "R1W9J0W5TTEQW6", "Overall": "5.0", "Content": "I love this camera, it is compact enough to carry in your pocket, yet has zoom to really get good pictures at sporting events.  The only small downside for me, is that you have to take the battery out to charge it. If you could charge it in the camera, it would be perfect!", "Date": "February 3, 2011"}, {"Title": "Very nice camera", "Author": "Stuart Sirott", "ReviewID": "RKTYZZOKQSZ11", "Overall": "5.0", "Content": "Very nice camera - I love the flexibility the lens provides - its also one of the drawbacks - its difficult to hand hold with the lens at the limit - I'm hoping that as I continue to use it I get better steading it.Pictures are very nice and I'm sure that I will continue to learn how to use more of the myriad of settings to get even better results.I would have liked it to be smaller (my old camera was a Cannon SD750), but that's just me - the easier it is to carry the better the possibility it will be in my pocket when that Kodak moment comes up. Can't conceive how they could pack all the features into a smaller package but one can dream.", "Date": "January 23, 2011"}, {"Title": "Great intro to Digital photography", "Author": "Tim", "ReviewID": "R20VXI5DOI22P4", "Overall": "5.0", "Content": "Still learing about digital photography after using 35MM FOREVER!  I'm really enjoying this camera.  A friend who is quite accomplished and does professional photography (she has really awesome equipment) pointed me toward this camera. I'm very satisfied.", "Date": "January 19, 2011"}, {"Title": "Best pocket camera you can get!", "Author": "Ernest P. Bellavita \"Ernest Bellavita\"", "ReviewID": "R15AWLBL89A2XL", "Overall": "4.0", "Content": "I still have an older model of this camera and have been very happy with it. The reason I am getting a new one is for my wife. She is asking for a new one, because there the usb latch broke. Now I have taken this camera on a 5 day 50 mile backpacking trip across the Northern Cascades in WA, so I don't think it was a quality issue. The camera still works fine after being rained on for 2 days and traveling in pocket while I hiked up 4000ft of mountain. The only gripe I had with the last one which seems to be a problem with this camera as well is night pictures. The camera can never seem to take good pictures in the dark, don't know if the flash isn't powerful enough or what, but night pictures never seem to come out very well, no matter what setting you use. I love the zoom; best zoom in any pocket camera that I have ever seen. Daytime pictures are awesome. The feel and use of the camera are great. The menus are easy to use, the controls; everything. This newer version feels a lot lighter then the last one I owned. Overall, I would recommend this to anyone who wants to take great pictures in daylight or outdoors where you need a zoom.", "Date": "January 11, 2011"}, {"Title": "Love this camera", "Author": "Dee", "ReviewID": "R3CWROVUHB8DT7", "Overall": "5.0", "Content": "I love this camera, I wanted the black body w/it's sleek look.  It is a little heavier than my previous point n shoot but it is well worth it to have the options it gives you.  The price was great for what was given.  I took it out of the box, didn't have time to read anything and took pics at our Christmas party.  They came out pretty good for not knowing anything about the camera and it was dark in the room but the quality was better than my other camera.", "Date": "January 9, 2011"}, {"Title": "Great Camera", "Author": "tstanley79", "ReviewID": "RZTNTIE1QGEFV", "Overall": "5.0", "Content": "We bought this camera for a trip to Disney World. My wife took the majority of the pictures in auto mode and they turned out great. Other members of our family have a much more expensive camera and, in my opinion, ours turned out better. The different modes are easy to switch too as well. In many places a flash could not be used, but the picture still turned out great in the night time mode. We would definitely recommend this camera.", "Date": "December 13, 2010"}, {"Title": "Still testing", "Author": "traveler", "ReviewID": "RL898SEZSYY0C", "Overall": "4.0", "Content": "I bought this camera because of the 16x feature which I am happy with.So far the macro is disappointing. I'm hoping it improves when I get used to the camera. It is not as easy to work with as I had hoped.  As a result I leave it on automatic most of the time. I have not taken a lot of pics in low light but the ones I have came out better than expected.", "Date": "October 23, 2010"}, {"Title": "THIS LITTLE CAMERA IS AMAZING!", "Author": "Nancy J. Mcdaniel", "ReviewID": "R2FBJCMU3I12FT", "Overall": "5.0", "Content": "I love this camera!  I previously had a Nikon coolpix P90, which I absolutely hated!  I wanted something that would take good pictures inside and out, and take a nice video.  I picked the perfect camera for that!!  I used the video first, and it is incredible!!  I do use a  SanDisk 8GB Extreme SDHC Class 10 High Performance Memory Card, which I would recommend if taking videos with this camera.  I love the size of this camera, and it would fit in your pocket or purse. It's very user friendly, and easy to navigate with the menu button.  I would recommend this camera to anyone who wants a point and shoot camera that takes great pictures and is easy to operate.", "Date": "October 14, 2010"}, {"Title": "A good Point and Shoot", "Author": "Gail Lee Mac", "ReviewID": "R2TFTLWY00MFMA", "Overall": "5.0", "Content": "I have a significant amount of Nikon Pro level equipment and do some commercial photography. I wanted a P&S; that was around $200 that could be used as a travel camera.I have not used any of the scene modes, but the Intelligence mode and the aperture and shutter modes work extremely well.  The zoom and stabilization work very well. Mostly importantly for me, the images are incredibly sharp. This is a camera you need to speed sometime with unless you want to only use the Intelligence mode - but remember this is a 25mm-300mm (35mm eqiv.) zoom and it can take advantage of all of the power built into this little camera.It is not a substitute for a $3000 DSLR and f2.8 zoom, but it will take very good images if you spend some time learning all of its features. I'm  picky about my images (website: [...])Upto 13 x 19\" printed images look good. There are lots of choices now in travel zooms, the ZS5 is a good one at a fair price point.This camera is good enough that getting photoshop elements (less than $100) will let you really learn photography.Because of the small sensor the limited f stop range is not a real problem when it comes to depth of field. F6.3 on a camera this size is like f11 or so on a DSLR.The Intelligence zoom gives you 16X and it is very hard to tell from the 12x optical - looking at 100% resolution at the pixel level.Given that this camera has a \"super zoom\" and lots of settings besides the Intelligence or program mode, I rate it very highly. With so many ways to configure this camera, the only problem I see is taking the time to use it to learn it before you head off to Europe or Africa, or on vacation here in the US.", "Date": "July 28, 2010"}, {"Title": "12 zoom sweet", "Author": "rick", "ReviewID": "R2EO487330OQ4N", "Overall": "4.0", "Content": "Nice cameraIt is shirt pocketable. A little heavy but easy fit and heavey is good for holding.Saturation is a little weak.Software is somewhere between poor and unusable. Pictures do not display properly.25-300 is fun. Very versitile. Maybe too many selections to set up quickly.MY PET PEEVE: Every camera needs an optical viewfinder. When one uses reading glasses it doesn't matter how big or good a digital screen is, it's not possible to see the scene and the screen.Recommend this camera although a bezel adjustment like some of the new cameras would be nice but they are under 5X which is a no go.", "Date": "November 1, 2010"}, {"Title": "Panasonic Lumix DMC-ZS5", "Author": "Rdurof \"Mister D.\"", "ReviewID": "R169BCHD07BECB", "Overall": "5.0", "Content": "Exactly what I was looking for, long zoom for birding/wildlife, yet compact enough to fit (barely) in pocket.  Only thing I don't care for is Panasonic software - a lot more complicated/squirrely than the Canon software I was used to.  So I am using Picasa 3 instead for taking pictures off camera and into my laptop and that works just fine.", "Date": "September 21, 2010"}, {"Title": "excellent", "Author": "A. T. Smith \"ATS In Maine\"", "ReviewID": "R2YA6AXNC3ZNL1", "Overall": "5.0", "Content": "I bought 4 of these. I Dropped em, worked em hard, Gave one away and had one stolen Keep one on me at all times. Good at micro & macro enough said...", "Date": "November 24, 2013"}, {"Title": "great camera", "Author": "dominick prodoti", "ReviewID": "R3B491QZH2XDNC", "Overall": "5.0", "Content": "really like this camera.Easy to use,reliable and nice and small,great!!Has a lot of features that I would never have thought to use but they are cool to use and I am not a camera nut.", "Date": "October 3, 2013"}, {"Title": "Works Great", "Author": "rhm", "ReviewID": "R2QWETYE57W80U", "Overall": "4.0", "Content": "Great little camera with great angle lens for its size. We take pics of apartments and condos and it can come to terms with most every sized room.", "Date": "July 7, 2013"}, {"Title": "Best point and shoot I've ever had!", "Author": "Gregory Lowell Kiser", "ReviewID": "R3EH77EOEID2UL", "Overall": "5.0", "Content": "I had one of these previously and used it for 4 years and damaged the SD card slot. It was going to cost over $200 to fix (I had gotten it for a little over $350 at the time), so I looked here. I found it for around $90.00 refurbished and it's just as amazing as my first. The description had said it had minute scratches (I had to search for them.)  This camera has every feature you could want and is like a DSLR in more convenient form. With everything from a manual, sports, and high speed function to an underwater one, I could not be happier with me freedom with it. It takes photos just as well, if not better at times, than my Canon Rebel XS. It's awesome and I'd highly recommend it for good high quality photos and ease of use.", "Date": "June 11, 2013"}, {"Title": "Everything is good except the picture quality", "Author": "Gyorgy", "ReviewID": "R27RE6HLPXC2JF", "Overall": "2.0", "Content": "It has a good feature set, HD video, good display etc. But the picture quality is bad. I had a ZS1 (I was happy with that one) and I have decided to upgrade due to the additional features. And I am disappointed. The pictures have much more noise than pictures took with the old camera. Even in small size the difference is obvious. I do not recommend this camera. (I used to have other cameras, I also have a DSLR, I know how to set a camera. The picture quality problems are not coming from the wrong settings.)", "Date": "June 8, 2013"}, {"Title": "great pictures", "Author": "David J Fischer", "ReviewID": "RU4XBEUEE3W6W", "Overall": "5.0", "Content": "The lense and zoom are amazing you cant go wrong.  Highly recommended, very easy to use takes great picturesthanks", "Date": "May 9, 2013"}, {"Title": "Lumix camera", "Author": "Harold", "ReviewID": "RO0AX7ZS8USE3", "Overall": "5.0", "Content": "I loved this camera but it didn't last very long ---- Not the camera fault though . I went into the ocean with it in my swim trunks pocket to my dissapointment . SO I ordered another on , this time getting the next one up on the scale I got the DMC-ZS8 . Its good but I really miss the ZS5 , I was just getting used to it .", "Date": "December 26, 2012"}, {"Title": "i really liked this camera a lot", "Author": "laurencg", "ReviewID": "R3VOH92VK6AZC3", "Overall": "1.0", "Content": "but it broke after a few months.  the lens projects/retracts when it turns on and off, and i guess the motor died.  one day it stopped focusing, and then the lens would no longer move, and then there was an error message on the display.  (i don't remember exactly what it said now.)  i just so happened to be in another country when this happened so it did this at one of the worst possible times too.", "Date": "December 9, 2012"}, {"Title": "Panasonic Lumix DMC-ZS5 12.1 MP Digital Camera with 12x Optical Image...", "Author": "EBIEV", "ReviewID": "R27MHUZ0OFH2R7", "Overall": "5.0", "Content": "Excellent camera, fits in pocket easily. Awesome zoom. Computer program that comes with it makes storing pictures a pleasure. Would definitely buy this camera again.", "Date": "November 27, 2012"}, {"Title": "Panasonic Lumix from Big Value Inc.", "Author": "RDB", "ReviewID": "R29C4WDV9WN1OB", "Overall": "5.0", "Content": "I had reservations when ordering this Used Like New item.I previously owned this exact camera.The package arrived quickly, there was no way to determine that this item was not brand new. All functions are like new, the photos come out with great clarity as do the videos.I highly recommend this camera and vendor and am very pleased with my purchase.Richard", "Date": "June 2, 2012"}, {"Title": "Versatile Small Camera", "Author": "John M. Sparks", "ReviewID": "R234RAKF1TOI9F", "Overall": "4.0", "Content": "I am very pleased with this camera, it gives me the Zoom range I like because,  we do a lot of Museum, Gardens, and Zoos visiting. With the Zoom range I can go from a Close-up Flower, to a Bird up on a tree. The only problem I have with it is, when the sun is behind me, this wipes out the viewing window. I hear a hood for viewing is available for the back which allows holding up to your eye. The only thing I can recommend as a caution is if you think most of your use is outside, then consider a Camera with both options. john", "Date": "May 30, 2012"}, {"Title": "Great , Best go to Camera!", "Author": "ron Kreml", "ReviewID": "R10OHPTPW1UBID", "Overall": "5.0", "Content": "After almost two years since I have made this camera My third leg it has never let me down.  I have found it to be good in low light to a degree that hand held braced works great.  This little well constructed photo tool has been to the beaches of Kauai to the shores off Block Island,RI and ZS5 has made a great camera to just grab and pop a shoot without loading up the big canon....and the results are very sharp compared to others of this class that I have tried.  I am going to recommend this to my daughter with her first child on the way and for developing an eye for composition.  I know its strange but this Lumix is a friend needing a name.", "Date": "March 23, 2012"}, {"Title": "Lumix zs5", "Author": "up north in michigan", "ReviewID": "RA3X6J66KZ8RG", "Overall": "3.0", "Content": "Purchased this camera 14 months ago to replace an Olympus. Noticed a couple months ago that there were squiggly lines in the picture when using the zoom. Researched the problem and found there is dust on the lenses. Notified Panasonic and was told it could be replaced with a refurbished camera for an additional fee of $192.00. Will be looking for another camera but not a Lumix.", "Date": "September 5, 2011"}, {"Title": "Worth the $", "Author": "Peter Subosits \"p subs\"", "ReviewID": "R3HDOV2PGJ0BSA", "Overall": "4.0", "Content": "I did a lot of research on the best travel zooms, and this one consistently performed well in lab tests done by magazines and websites. I bought it for around $215 and I am very glad I did. It's easier to say what this camera does poorly than what it does well, so I'll point out some of its weaknesses that I noticed. In indoor settings with no flash, it does pretty badly if your subject isn't still or you are without a tripod. The flash is decent...A little bright at times for me, but editing on Picnik/Photoshop can easily fix that. This camera produces excellent scenery shots, but I think its strongest point is the macro shots. Just put the camera in macro mode and it will produce professional looking shots. There is a manual mode but the Program Aperture mode is so good that I hardly ever use it, it really is like a much more expensive camera the way it captures sharp details of flowers/food while blurring the background. The battery life is very good. And lastly, I enjoy fun photo effects so the \"High Dynamic\" and \"Film Grain\" scene modes are favorites of mine! Basically, if you are looking for a great travel zoom, this one is hard to beat. It's a bit chunky but can fit in my purse.", "Date": "August 1, 2011"}, {"Title": "Love this camera", "Author": "Amazon Shopper", "ReviewID": "R725CR0BSHXI6", "Overall": "5.0", "Content": "I don't know too much about photography but this camera is great. I've had lots of comments on pictures I took on a recent trip to Ireland, that the pictures look professional. They're surprised the pictures weren't taken with a really expensive 35mm. I dont use all the different settings (havent had time to figure it out). There is a trip feature that you put the dates of your trip, and title it. Then when your home it will sort the pictures by days on the trip. Great camera, would highly recommend.", "Date": "July 2, 2011"}, {"Title": "This is a fantastic camera", "Author": "Jack", "ReviewID": "R3TZHO992KHOCW", "Overall": "5.0", "Content": "I am a pretty experienced photographer and this is my fourth P&S.; It is by far the best P&S; camera I have ever owned. Unlike other cameras I have owned, the many options this one has actually improve the picture quality instead of make things more difficult and artificial looking. I love the macro, three presets are nice, the feature allowing me to reduce the file size and gain more optical zoom power is awesome, and the battery lasts just as long as advertised. One thing I have missed on my other P&Ss; is Nikon's \"best shot selector\" feature. But here I can use exposure braketing, get three quick takes, and then pick the best one of the three when I'm at the computer. It works just fine. I find that the image stabilization works quite well, though nobody should ever expect I.S. to reduce blur when zooming beyond 8X. On any camera, including this one, be prepared to use a tripod or some other form of physical stabilization for the higher zooms. Some people have complained about the Intelligent Auto feature, but I find it surprisingly accurate. It's the first camera I've owned that can actually tell automatically when you want to take a macro shot.Since this isn't your simple P&S; camera, be prepared to read the instructions and keep going back to them as you try out all the options. There's so many good ones that you'll enjoy every opportunity to try a new one out. One drawback is that the instructions don't have an alphabetical index, just a detailed table of contents in the front, so you sometimes have to search for the feature you are researching. The \"find\" menu on Adobe helps a lot. Panasonic blew it on the included image handling software, which I find useful only for reading the properties of photos so I know what settings I used. And even then it doesn't have a complete list of the ZS5's features.I guess to summarize, there's four rules to good photography: 1. Be there. 2. Have a good camera with you. 3. Know how to use it. 4. Use it. This camera fills the bill on #2. The rest is up to you, but with the ZS5's nice size, good quality, and great features, you have no excuses.", "Date": "June 29, 2011"}, {"Title": "Great pictures!", "Author": "Kristy", "ReviewID": "R2BB522XNPV79I", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1S4I9QX6LKP2JembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1S4I9QX6LKP2Jrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1S4I9QX6LKP2JchiDiv\").innerHTML = document.getElementById(\"cv_mo1S4I9QX6LKP2JhiddenPre\").innerHTML;\n};\ncv_mo1S4I9QX6LKP2Jrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1S4I9QX6LKP2Jso;\t   \n\n\nfunction cv_mo1S4I9QX6LKP2JloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1S4I9QX6LKP2Jso = new SWFObject(swfLocation, \"cv_mo1S4I9QX6LKP2JAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1S4I9QX6LKP2Jso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1S4I9QX6LKP2Jso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1S4I9QX6LKP2Jso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1S4I9QX6LKP2Jso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1S4I9QX6LKP2Jso.setAttribute(\"height\", swfHeight);\n          cv_mo1S4I9QX6LKP2Jso.setAttribute(\"width\", swfWidth);\n          cv_mo1S4I9QX6LKP2Jso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1S4I9QX6LKP2Jso.write(\"cv_mo1S4I9QX6LKP2Jflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1S4I9QX6LKP2J', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1S4I9QX6LKP2J';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1S4I9QX6LKP2J', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1S4I9QX6LKP2JloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1S4I9QX6LKP2J\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m183W363G5OKQ5\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m183W363G5OKQ5\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2BB522XNPV79I\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m183W363G5OKQ5/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1S4I9QX6LKP2Jduration')) {\n      document.getElementById('cv_mo1S4I9QX6LKP2Jduration').style.display='none';\n    }\n    cv_mo1S4I9QX6LKP2JloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1S4I9QX6LKP2JloadSwf(movieID, playerVersion) {\n   return _cv_mo1S4I9QX6LKP2JloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1S4I9QX6LKP2JnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1S4I9QX6LKP2J', 0, h);\n}\n\nfunction cv_mo1S4I9QX6LKP2JresetPlayer(w,h,bw,cc) {\n  cv_mo1S4I9QX6LKP2JnewHeight(h);\n\n  cv_mo1S4I9QX6LKP2Jso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1S4I9QX6LKP2Jso.addVariable(\"cacheCode\", cc);\n  cv_mo1S4I9QX6LKP2Jso.setAttribute(\"height\", h);\n  cv_mo1S4I9QX6LKP2Jso.setAttribute(\"width\", w);\n  cv_mo1S4I9QX6LKP2Jso.write(\"cv_mo1S4I9QX6LKP2Jflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1S4I9QX6LKP2JRollOverImg = new Image();\ncv_mo1S4I9QX6LKP2JRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81AQwLDcYLS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1S4I9QX6LKP2Jpreplay = document.getElementById('cv_mo1S4I9QX6LKP2JpreplayImageId');\nif (cv_mo1S4I9QX6LKP2Jpreplay) {\n  cv_mo1S4I9QX6LKP2Jpreplay.onmouseover = function() {\n    cv_mo1S4I9QX6LKP2Jpreplay.src = \"http://ecx.images-amazon.com/images/I/81AQwLDcYLS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1S4I9QX6LKP2Jpreplay.onmouseout = function() {\n    cv_mo1S4I9QX6LKP2Jpreplay.src = \"http://ecx.images-amazon.com/images/I/81AQwLDcYLS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1S4I9QX6LKP2Jpreplay.parentNode;\n\n  var cv_mo1S4I9QX6LKP2JcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1S4I9QX6LKP2JcurrentClick) {\n      return cv_mo1S4I9QX6LKP2JcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:24 MinsThis camera takes excellent pictures, even without fussing with all the manual settings. But there are a lot of manual settings to fuss with if that's your thing. I like a combination of both. The O.I.S. is amazing. I practiced taking pictures while my hand was in motion, and some came out blurry (I was moving my hand fairly fast) but some came out perfect (when I slowed my hand speed but was still moving). You could take pictures while walking and you'd probably never know you weren't standing still. Even the best camera will give you a blurry picture if you're moving too fast, but I was very impressed that you could move at all and still get an amazing picture. I was able to take videos up to 8 minutes long, which I appreciated. I thought the quality was good, both picture and sound. Another thing I appreciated was the zoom. Other cameras I have used gave me very grainy pictures when using the zoom, even only to 2x, but this camera I can zoom all the way to 12x and still get an amazing picture. I haven't really tried extending into the digital zoom range much, only a little, and it still seemed pretty good comparatively. I like the size and feel, and it seems to be well built. There are a lot of pretty great things about this camera and I am very happy with the purchase.In short, what I love most about this camera is:- Great O.I.S.- Quality zoom- Video length- Size (I have small hands, and this fits well without being too small)- Sleek feel- Feels like quality materialsAbout the video I included, it is just a short video I took while at Iguaçu Falls in Brazil, it isn't me talking about the camera. It was overcast and I was standing in a shadowy area, and the video still came out pretty good in my opinion. The falls are extremely loud, and the camera video sounds just like it did when I was there, except not as loud! You can see a butterfly flying in front of the camera a couple times in the beginning. (Sorry I turned the camera sideways in the middle.) Just a side note, this is only a very small portion of the falls. No picture or video will ever do it justice! Even the professional panoramic shots. It is one of the 7 natural wonders of the world.", "Date": "June 19, 2011"}, {"Title": "Second time around", "Author": "bonsangue66", "ReviewID": "R1HARNQ4021NA7", "Overall": "5.0", "Content": "Love this camera, lots of fun and takes beautiful pictures. I bought it again, my first (older model) fell in the water. This camera is not water proof.", "Date": "May 11, 2011"}, {"Title": "Great Camera for Still Shots", "Author": "Kihea", "ReviewID": "R2ZP77L03UM1PW", "Overall": "4.0", "Content": "I really love the Panasonic Lumix Cameras.  This one has lots of features, including utilizing JPEG format for older computers, instead of SDXC format for Windows 7 and above. The movies taken inside aren't as smooth and clear as my older DMC TZ7, but nevertheless, acceptable.  I also take lots of outdoor shots and love the 12x feature. In general it's an easy camera to use.  The hand-hold part is a bit difficult to deal with, but I'm getting used to it.This camera is a real find for me.", "Date": "May 10, 2011"}, {"Title": "First digital camera", "Author": "gwalsh", "ReviewID": "RY9CVK8M89370", "Overall": "5.0", "Content": "This is my first digital camera.  My daughter brought one and she highly recommended the camera. I am higly pleased with all aspects of the camera.  My husband who is a tech phobia loves this camera.  Might have to buy another just so he and I do not fight over who is taking pictures.", "Date": "May 10, 2011"}, {"Title": "Great Camera, Excellent Resolution, Better ZOOOOM!", "Author": "Alkamir", "ReviewID": "R3S5UBRMFT920Y", "Overall": "5.0", "Content": "This camera by fair away, beats any Sony Cybershot series W. , the zoom its excellent, and the image quality its very good even on low light conditions. i would recomend it to anyone.", "Date": "May 5, 2011"}, {"Title": "Lumix DMC-ZS5", "Author": "organizer957", "ReviewID": "R3PWBDIQJ919AB", "Overall": "5.0", "Content": "This camera is a nice fit for me because of its ease of use and nice picture quality.  I like the mechanism for the 12x zoom.  So far, I am very pleased.", "Date": "May 4, 2011"}, {"Title": "Good, but low light is an issue", "Author": "Alexander Quinn", "ReviewID": "R13DYQJSVYRV06", "Overall": "4.0", "Content": "Given how far the sensors have come along, I was hoping this camera would do better in low light.  That part was disappointing.  Also, it uses an oddball plug, so now I have *THREE* different micro/mini USB cables around my computer.  Why couldn't they just use the normal mini-USB?  However, the buttons feel nice, better than the Canon I had before.  The camera feels sturdy.", "Date": "April 22, 2011"}, {"Title": "Nice little camera", "Author": "Barry N. Wilensky", "ReviewID": "R3SBKJ58Z090G3", "Overall": "5.0", "Content": "I bought this camera to replace my Nikon point and shoot. After reading lots of reviews all over the web and understanding that model change time was coming, I decided that this camera was an excellent choice.  Great price, very good speed of writing, and excellent optics.  I use it in my school classroom, and it will join my Canon Rebel T2i this summer on vacation.  I don't really know which camera I will use more.  This one is pretty good for standard size pics.", "Date": "March 14, 2011"}, {"Title": "Excellent value, super manual capability", "Author": "JTM", "ReviewID": "R1EGLI4OD9ZNPZ", "Overall": "4.0", "Content": "As a relative newbie in photography I am  enjoying the full range of zoom and the auto/manual capabilites of this camera...Being the first camera I have owned in over 20 years, I find this to offer one of the best values in small camera arena...", "Date": "March 9, 2011"}, {"Title": "Outstanding camera", "Author": "kevin dwyer", "ReviewID": "R2OW9HMVQJ8BS3", "Overall": "4.0", "Content": "The Pamasonic is outstanding. I have a Nikon D300 and the Panasonic takes almost the same quality picture. The lens is sharp and the equivalent of a 25mm-300mm lens.Really top quality.", "Date": "March 7, 2011"}, {"Title": "great point and shoot", "Author": "R. Fuchs", "ReviewID": "R2ZAHQ87HZJCFL", "Overall": "4.0", "Content": "I have had a lot of point and shoot cameras and this one really fits the bill for me.  There are lots of preset options, plus you have options to focus it on your own, which is rare to find in a point and shoot.  It's a bit bulky, but still fits in my pocket so I can take it everywhere I go with my two sons.  If you are looking for a good point and shoot that gives you a bit more control and a decent photo, this might be the camera for you.", "Date": "March 1, 2011"}, {"Title": "You will not be disappointed!", "Author": "Mike Robinson", "ReviewID": "R3HUKPKIKFJY9H", "Overall": "5.0", "Content": "I got this to go on vacation in Hawaii. After major disappointment with previous camera purchases, It is nice to finally find a product that I have no complaints about!", "Date": "February 21, 2011"}, {"Title": "Lumix DMC-ZS5", "Author": "Rheath", "ReviewID": "R3L8R99M9BNXNK", "Overall": "5.0", "Content": "I've been a DSLR user for seven years, but after a recent vacation was interested in something more compact. I began researching the category of travel zoom cameras and found several good candidates. I wanted the flexibility of manual settings, a long zoom, good macro focus, and good low light response. This seems to be a great combination of all those. The solid feel of the camera puts me in mind of some of the classic 35mm range finders I used decades ago. It's all I wanted and I'm still exploring more its features. I'll still use my DSLR, but won't have to lug it around on vacation.", "Date": "February 20, 2011"}, {"Title": "Handy size, good distance", "Author": "Jan Hurst \"artist and calligrapher\"", "ReviewID": "R3R4PCZIIIYOVL", "Overall": "4.0", "Content": "Pretty good camera for the price, and though I love the long distance I can get with the zoom, I miss the low-light capabilities of my old Fuji.  Also, it is slow to re-set for the next photo...not so hot for pix of active grandbaby.  For general use, however, I have to love the Leica lens.  The output is great, the size is small enough to pack with me every day - which I do - and it is great for taking pix both for my art pursuits and of my finished work.  See my blog to see great snaps of the aforementioned grandbaby [...], and some of my work at [...].", "Date": "February 11, 2011"}, {"Title": "versatile camera", "Author": "sea tern", "ReviewID": "R2LDMCCV9DN59W", "Overall": "5.0", "Content": "I am very happy with this camera, which I have had for a month.  On a recent flight I used \"aerial\".  The pictures are really terrific, zoomed. In time I will experiment with shutter and aperture priority as I have not done that yet. The only complaint I have is that when I grab it with my right hand and take a snapshot, my hand pushes buttons that I do not want pushed.  Have to use 2 hands to avoid that problem.", "Date": "February 4, 2011"}, {"Title": "Totally satisfied", "Author": "Juancentro", "ReviewID": "R2C5SMDGAKVF85", "Overall": "5.0", "Content": "The best camera I ever had, period.Very good auto mode, and simple scene modes to fit difficult pictures", "Date": "January 20, 2011"}, {"Title": "great camera!", "Author": "Casey C. Alvey \"Casey Alvey\"", "ReviewID": "R2G33G6A5906OM", "Overall": "4.0", "Content": "I bought this camera for my husband and he loves it.  It has a great zoom and is very small and easy to travel with.", "Date": "January 18, 2011"}, {"Title": "Lumix ZS5", "Author": "James Haddon", "ReviewID": "R2SGEQF89OWFFK", "Overall": "5.0", "Content": "First off we are discussing a point shoot camera, not a even a 'high end\" point & shoot, given that, this is an e x c e l l e n t camera. Fits in your pocket, albeit a tad bulky, it still easy to carry. The lack of color noise in contrasty situstions is above average, and the user inter face is a breeze to use. I have other point & shoot cameras, and I never strayed from the Canon line up because of the ease of use.After purchasing the Lumix, I have to say that optics are very impressive and can hold their own against my Canon G-12. For comparison sake, I also have a Nikon D200, that becomes 'work' when taking happy snaps because of the bulk. I am very happy with this Lumix and would recomend it anyone looking for a little point & shoot with great optics, decent sensor abilities, and ease of use. It also a well made piece to boot.Having had this camera, and used it for a week or two now, I will look at other Lumix products. It has had that much of a positive impression on me!", "Date": "January 12, 2011"}, {"Title": "Great camera if you are most interested in good pictures", "Author": "J. Cowing \"I like dangerous toys...fun!\"", "ReviewID": "R3S24JTEI0PTQ3", "Overall": "5.0", "Content": "I am not a camera guru...I play with Photoshop Elements, not the full Photoshop Suite, so I consider myself and enthusiast.  I think it is important that you understand this so that you can know where I am coming from.This camera generally takes great pictures...I have had a couple instances where I needed a quick photo in a very high contrast area where it has failed me (an indoor shot with a sliding glass door and snow outside...didn't have time to play with settings to figure out how to get it to take a decent picture).  For point and shoots I have always bought Canons, but I really didn't like the reviews I read on the comparable Canon so I took a chance on this camera.  I also own a Sony DSLR, again want to outline my frame of reference.  I prefer my DSLR as it gives me more options, but honestly, a camera that isn't with you isn't going to get the shot, and I can't carry a DSLR around everywhere with me.  I took the DMC-ZS5 on vacation to Reno/Tahoe and I have to say it really impressed me.  It took great pictures (I will try to attach a couple).  The camera did an incredible job with snow.  My only complaint about it are the controls and menus.  I wish it had a dedicated video button to start recording a video, and the menu system, while not overly complex works differently than my previous Canons and my DSLR.  I am getting used to it, but it still seems a bit counter-intuitive.  It also does not have some of the cute functions that some others in it's class have (smile or wink sensor to trip the shutter is the one that I can think of but I remember others when I was researching). The HD video (720P) is acceptable, but it is not going to replace your camcorder as it isn't that good and you are limited to 8 minute and 30 second clips.In summary, if you want an affordable picture with a big zoom that takes great pictures, and can live without some of the newest features and video isn't a major deal for you this is a good choice.", "Date": "January 9, 2011"}, {"Title": "LumixZS5", "Author": "DB", "ReviewID": "R1BHH7YZX6QLIV", "Overall": "4.0", "Content": "Panasonic Lumix DMC-ZS5 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom with 2.7-Inch LCD. 12 Megapixels and 12X zoom are a good combination to give great pictures at any distance. Most of my limited use of the product was over the Christmas season so lots of great portrait style photos. All in all very pleased .", "Date": "January 8, 2011"}, {"Title": "Best for the $", "Author": "JPmexico", "ReviewID": "R2I9WVQ7MQP0RI", "Overall": "5.0", "Content": "Had this camera for 5 month now.  Excellent!  This has the flexibility with many manual controls, great shots and some nice features.  I'm not going in-depth for this review but I hounded the web prior to purchasing and still am a happy camper!  Expecting many years of point and shoot use and easy traveling.  Dial down most of the shots to 5 or 8 MP to conserve space; 12MP if I really want to edit the work later.Basically, if you want some nice features, don't crave GPS, need a flexible camera for all the occasions to easily slip into a bag or even a pocket... I doubt you'll find a better option for the money!", "Date": "January 5, 2011"}, {"Title": "Panasonic DMC-ZS5 is Best Point & Shoot for the Money", "Author": "Cap'n G", "ReviewID": "R9TLQKQDCYIF6", "Overall": "5.0", "Content": "I purchased the Panasonic DMC-ZS5 with 12x optical zoom to replace my Sony 4x optical zoom camera when its shutter would no longer open.  I looked at quite a few cameras and the Panasonic was the highest rated point-and-shoot camera even close to the 229.99 sale price I paid. For those who want a simple point-and-shoot camera this one is awesome!  The \"Intelligent Auto\" has taken excellent pictures right out of the box with no fussing.  The photos are MUCH better quality than I had on my Sony camera (I've take over 200 photos so for with the Panasonic).  Also, the camera is solidly built and it just feels like you are holding a quality piece of electronics when you hold it.  A similarly priced Nikon felt cheap by comparison.  If you are looking for a point-and-shoot for under $300, GET THIS ONE!!", "Date": "December 29, 2010"}, {"Title": "Great camera", "Author": "Robert W. Hackler \"TheHack\"", "ReviewID": "R32DSG8HAFHFMH", "Overall": "5.0", "Content": "This is a great camera. I like the automatic settings and the ease of setting your own exposures and f-stop.", "Date": "December 29, 2010"}, {"Title": "Great camera for price", "Author": "Tina from Brooklyn \"Piedmont photobug\"", "ReviewID": "R13BES0NT4QKVL", "Overall": "5.0", "Content": "I love the pics from this camera - clear and crisp.  Feels just right in my small hands, not too small but still compact enough for a solid feel, esp, with the slight front 'bump'.  Zoom has no trouble focusing but the macro takes a bit of time to get focused.  Optical zoom provides good images; digital zoom not good at all.  Some features I will never use but the quality of images is why I bought the camera and the Leica lens is just fantastic.  I'm still annoyed that Panasonic only provides a small manual and DVD - I bought a manual on line to really learn all the camera's features.  Otherwise great camera for the price.", "Date": "December 2, 2010"}, {"Title": "Great Camera", "Author": "D. Wall", "ReviewID": "RID3O5PW8J0P5", "Overall": "5.0", "Content": "This is really my second camera.  Loved the first one.  Pictures and everything was great.  With my first took it to the beach where it ended up getting a little sand on the lens and that lead it to start having problems with the auto focus and zoom then it stopped working all together.  Because I really loved the camera I decided to try another (this time avoiding the sand) and so far it has not disappointed me in the quality of the pictures.", "Date": "December 2, 2010"}, {"Title": "A good value", "Author": "Scap", "ReviewID": "R28Y1906LJLIUG", "Overall": "5.0", "Content": "The Panasonic ZS5 may be the best in its class.  Some of the features are not intuitive, so you may have to consult the owner's manual a few times, but once you figure it out, it's not too bad.  The only real downside I have experienced is it does not perform well in low light.  But overall, it's a very nice camera for the money.", "Date": "November 30, 2010"}, {"Title": "Panasonic Lumix DMC-zs5 is close to perfect.", "Author": "judith secher", "ReviewID": "R21MXEXYWLOAEZ", "Overall": "5.0", "Content": "Panasonic Lumix DMC ZS5 is a great camera. Zero complaints. It is inexpensive, perfect weight, size, and ease of use. Most important, it produces sharply detailed photo images. Much improvement over Canon cameras I used in the past. Long battery life for rechargeable battery. Prior cameras ate up AA batteries quickly.Caveat: a little tricky to order a backup battery on the Internet. Need to be careful to buy the EXACT battery made by Panasonic for this exact model only, and definitely not one of the less expensive ones, none of which are exactly the same as the Panasonic.", "Date": "October 26, 2010"}, {"Title": "Panasonic Lumix DMC ZS5", "Author": "doug welsh", "ReviewID": "R1006VVT7S8G2G", "Overall": "4.0", "Content": "Seems to offer lots of features plus quality.i usually don't take much time reading manuals--so i have been able to do the basic stuff and am pleased so far.when i want to figure out how to do something that's not obvious, then it's a bit difficult to quickly find and understand how to accomplish what i'm looking to do.would i buy it again? absolutely. a great feature/price point.", "Date": "September 5, 2010"}, {"Title": "Amazing little camera that does it all!", "Author": "carolyn \"carolyn\"", "ReviewID": "R1P6KAQA1D4YSM", "Overall": "5.0", "Content": "I just received this camera and it's so intuitively designed, I was able to quickly discover its amazing ability to do everything from a wide screen format to a giant zoom to tight closeups - all from a small pocket size device. It works well in low light, easy to disable/enable flash, change settings, move into different modes, etc. Given the camera's size, the picture quality is also far better than I expected. Easy to download files from the card or the usb cable. The movie mode creates very high quality files. I will no longer be lugging around large cameras and lenses!", "Date": "August 30, 2010"}, {"Title": "great camera!", "Author": "martianmisfit", "ReviewID": "R2FPS97NCNXACL", "Overall": "5.0", "Content": "got it as a present for the wife and she loves it. camera works great and it was actually cheaper on amazon than at retail.", "Date": "August 9, 2010"}, {"Title": "Warning: Screen scratches easily!", "Author": "Michael Indgin", "ReviewID": "R2RP0RATQGIOKL", "Overall": "4.0", "Content": "While I own this camera and love the quality, versatility and bells and whistles, you have to protect the viewing screen. It scratches if you look at it wrong. Be sure the first thing you do with this or any camera with a screen is protect it somehow.", "Date": "May 31, 2010"}, {"Title": "Great camera - UNRELIABLE Panasonic replacement battery quality; POOR Panasonic customer support", "Author": "RK", "ReviewID": "R4TWUUN39MZB2", "Overall": "3.0", "Content": "First, the positive: Bought the camera (Panasonic Lumix DMZ-ZS5) in April 2010. After a year of using the camera, I still find it to be a great super-light \"pocket\" camera with an excellent feature-set (super-wide angle lens, optical image stabilization, intelligent resolution, large variety of auto-exposure settings, and manual exposure control). Several previous reviewers have done a great job explaining these features, so I won't repeat them here. I consider myself an advanced user, and I like to experiment with several exposures for each composition (whether using this point-n-shoot, or my SLR) - so I always like to travel with (at least) a couple of spare, fully-charged batteries. The battery that came with the camera seems to work as advertised (~300 pictures) and I am still happy with its performance. So, I am upgrading my rating by one star (consider this as 5-stars for the camera, but 2-stars for the battery system & 1-star for Panasonic customer support).Now, the negative (or, why 3 stars?): Based on warnings from other reviewers (both here and elsewhere), I decided to buy two brand-new Panasonic replacement batteries (from the Amazon marketplace). Before purchasing, I checked that these were IDENTICAL to the one that came in the original box (PANASONIC DMW-BCG10pp). I paid over 75% of their list price - so, I did not go for the cheapest batteries out there. After the batteries arrived, I checked that both came individually wrapped in (seemingly) genuine Panasonic cardboard/plastic packaging. Both had identical markings their sides, as compared to the original that came with the camera. However, owing to work/travel commitments, I did not get a chance to test out these new batteries for over 3.5 months. Just recently, I took the batteries out of their packaging, charged them, and tried to use them. But the ZS5 refuses to recognize the battery, shutting down within 3-4 seconds with the message: \"This battery cannot be used\". I waited several hours, recharged the batteries, and tried again - with the same result. I looked online and found that this message results from ID-secure feature built into their cameras to identify non-Panasonic battery packs. I then tried Panasonic's support web-site, but found nothing related to either battery problems or firmware updates for the ZS5/ZS7.So, I called Panasonic's customer/tech support (U.S.), hoping for some sort of a firmware download or some other \"re-setting\" procedure that would let me over-ride the camera error-message. To my surprise (and after three phone-transfers), instead of helping me figure out why TWO, BRAND NEW, Panasonic batteries were being rejected by their own camera, the rep kept insisting that I bought the battery over 90-days ago, so they cannot help me! Now perhaps I am naive, but I consider a battery to be brand new (within a reasonable time-limit, of course), as long as it has not been abused or used before - so it should not matter whether I bought the batteries 90 days vs. 110 days previously (at the time I called them). They could not even tell me if there are ways to identify a genuine \"PANASONIC\" battery pack!During our extensive online review prior to buying this camera, the battery issue never come up. But now when I type the exact camera-error message in Google, I get several hits on this subject (all pertaining to Panasonic Lumix cameras). I was stuck abroad with only a single working battery, and TWO BRAND-NEW batteries that didn't work! I eventually found a Panasonic vendor in the country I was living in and bought another 'genuine' Panasonic replacement battery for higher than the list price - this new battery pack seems to be working well so far.So, I wanted to put this warning out there that in spite of Panasonic's advertised \"stringent\" standards that purportedly make their batteries so much better, their camera's failure tolerance seems to be so tight that many of their own batteries fall outside of it! I find it frustrating that there is no way to tell which of the \"PANASONIC\" branded batteries are really genuine until you pop them into the camera - even if you pay attention to details, or fork-out close to the list-price. So, the lessons learnt for me are: (1) Don't expect that the \"Panasonic\" brand implies a guarantee of quality or reasonable customer/technical support; (2) If you plan to buy any Panasonic Lumix camera, or any of their new ID-secured battery based cameras, check online for 'battery cannot be used' or 'battery failure' for that camera before purchasing; (3) Be prepared to go through the hassle of trying out several replacement batteries, EVEN if you buy Panasonic's own; and (4) Thoroughly test out any spare replacement batteries you buy within the first 90 days (I guess the last one's a \"DUH!\").I have never bought a camera outside of Canon before, and will most likely go back to Canon after this - I am afraid I cannot trust Panasonic to \"do the right thing\" at this point.Panasonic Lumix DMC-ZS5 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom with 2.7-Inch LCD (Black)", "Date": "July 21, 2010"}, {"Title": "Panasonic doesn't respond to customer needs", "Author": "rachyilicous", "ReviewID": "R9V3ZYXKXNECI", "Overall": "1.0", "Content": "I bought a Panasonic Lumix DMC-ZS5..within three months the camera broke.  I returned it to Panasonic, paid for the shipping, and got a replacement camera.  The camera broke this time in less than 2 months in the exact same way as the first camera.  It was obviously a poorly manufactured product.  Yet despite my best efforts, Panasonic would  not issue a refund and I was stuck with a broken replacement $200 camera.  Panasonic had terrible customer service.  I was happy with the camera when it was working and it took quality pictures, but a broken camera doesn't do me any good.  I was terribly disappointed with Panasonic and will really think twice about purchasing a Panasonic product in the future.", "Date": "February 11, 2012"}, {"Title": "NEVER buy this camera", "Author": "Ellie K", "ReviewID": "R14OKGXWP2HPMT", "Overall": "1.0", "Content": "I bought this camera 6 months ago. within that time i have had to get a replacement 3 times. And as of today (6 months after buying it) I have to return it again. It keeps getting an odd black dot in all the pictures. There is nothing on the lens or inside. It just continually has this weird black dot show up. I will never buy this camera again. If you want a great camera dont buy this one.", "Date": "July 25, 2011"}, {"Title": "Good solid camera for every day use", "Author": "faeryfriendz", "ReviewID": "R2U95QYMT6ELN6", "Overall": "4.0", "Content": "I love the quality of the pictures and it is very easy to upload pics to the pc... the only con is that the electronic zoom is very difficult to control.  It seems to be an \"all or nothing\" zoom... still working on understanding that.", "Date": "October 4, 2010"}, {"Title": "great camera!!!!", "Author": "Thomas Irvin", "ReviewID": "R13WFSWYZS70RY", "Overall": "4.0", "Content": "bought this to replace our old point-n-shoot.  only had for about a week, and love it.  there are a ton of settings, and scene options.  the zoom is amazing.  great picture quality.  gave it 4 stars because of price, i paid $210 in Aug 2010, and  I'm sure the price will continue to drop.  You more than likely will need read the manual, as i need to do, to fully understand how to use all the different settings and scene modes.", "Date": "September 20, 2010"}, {"Title": "Not impressed", "Author": "Curley Joe", "ReviewID": "R1RDZAQZC9N33G", "Overall": "3.0", "Content": "I bought this camera because it had very good reviews.  The picture quality is pretty good when there is a lot of light, but in low-light conditions there is a lot of noise in the images.  Just zoom in to any dark portion of an image and you'll see what I mean.Also, I don't know why they use the proprietary QuickTime format for video instead of standard MPEG.  QuickTime eats up too much space, and most programs can't deal with it properly.", "Date": "September 7, 2010"}, {"Title": "Fantasic camera with flaws and high learning curve", "Author": "Jennifer German", "ReviewID": "R1PIWTJ9WH9BLI", "Overall": "3.0", "Content": "Firstly, this is Not a 12x optical zoom or 16x zoom camera.  It's zoom is 16x from the camera's starting point, which is not normal 1x vision.  Meaning: when you look at something with your own eyes, and then look at it through the camera, that object is further away looking through the camera.  Which allows the camera to take a wider field of view picture.  But 2x optical zoom on the camera gives the same distance as if you are looking at the object without the camera.  Which means 16x zoom is actually only 8x true zoom.  And it's not even all optical!  That was my biggest issue, as I was looking for a super-zoom camera and was disappointed to find out this truly isn't one.Secondly, this camera has a High learning curve.  Repeat: HIGH learning curve.  Annoyingly so.  The camera takes amazing pictures whenever the settings are correct for the situation.  The problem is no one setting is correct for even just all the most common situations, and what you want to photograph can change on you fast.  And the instruction book that comes with it has NO information on the dozens of different pictures modes and options.  (I haven't checked the digital PDF document on the CD to see if there's a real instruction manual on there.)  Here's just the stuff I remember right now of what I've found: - The intelligent auto feature works well outdoors in normal light, but very not well other times. - The \"A\" mode works indoors in normal light, but not low, and in sunlight. - Portrait works in indoor bright light and outdoor shade or other low light. - Baby 1 works best for high action, like dancing and sports. - Self-portrait is the only mode that maintains the self-timer setting you choose between pictures. - To get a fast recovery speed between picture taking you need to turn off image review. - Oh, and more than half the time you'll want to set the flash to force off to get true colors! - Etc, etc.Last negative in my opinion is that the door that covers the battery and SD card and is held closed by a latch is very flimsy.  I fully expect that's gonna be the first thing to break.On the plus side:- the video this camera takes is excellent quality.  I was surprised at how much detail and how fine the resolution.  Just keep in mind the camera can't light for a video, so it won't work in darker situations.  But get a large SD card so you can take longer length videos!- \"MS\" mode (which is My Scene) is handy because you can customize a scene and save it under MS for later use quickly.- the navigation controls on the back of the camera are easy to learn and well placed for fingers.- fits in a purse easy, and normal pockets too- the panorama assist is very cool!Overall, the camera is too flexible without giving help on how to make it work best, but when you come across the right settings it does fantastic stuff.", "Date": "July 30, 2010"}, {"Title": "Decent point and shoot, horrendous customer service", "Author": "mamber-m", "ReviewID": "R2T1HMYGV6S02P", "Overall": "1.0", "Content": "It's not mainly about the camera, which is decent but no DSLR. I purchased this camera since it offers a lot of manual controls, but you don't use the control much anyway if the quality is average. You do the manual control because the picture quality is good. I hoped I can use this unit like my DSRs, but at the end I didn't. At the end, I use it like any other point and shoots that I own, so having more options than the average P&S; does not matter at the end. And I guess this is the biggest sales point of the camera.Image quality, weight, durability... all qualifications are average compared with other respectable manufacturers like Canon, Nikon, Fuji, or even Sony/Minolta (no American or Korean manufacturers included). Nothing stands out (positively or negatively) compared with other $200-300 P&S; cameras. I purchased because Panasonic P&Ss; usually get a good review at Digital Camera Review and I didn't hate the other Panasonic P&Ss; that I own, but it's hard to see any difference from my Canon P&Ss; in terms of image quality.What stood out is the amazingly bad customer service of Panasonic. So... my camera stopped working, which happens unfortunately. It is within the warranty period so Panasonic agreed to exchange (not to a new unit, possibly factory refurbished one. Cheap...). i shipped back my unit to the service center, and I got delivery confirmation. But basically the service center lost the unit (or they say they cannot locate the unit). I managed to talk to a person at the service center after a couple of emails and a couple of not-returned phone calls, and she promised to search and call me back in a day or two. But nothing happened after a couple of weeks. Actually 3 months passed since my camera was delivered to the service center. I sent several follow up calls or emails, but no response. I guess I have to give up.I think the camera is decent, but not much better to accept the horrible service. Basically, if you buy a unit, consider that there is a risk that there is no warranty implemented. Considering the service, and the average quality, I would never buy a Panasonic again. and I recommend you to do the same.", "Date": "October 6, 2010"}, {"Title": "Perfect for my needs", "Author": "David P. Werlich", "ReviewID": "R25FASF0OXOJZL", "Overall": "5.0", "Content": "My third Lumix camera and the best  one yet.  Has a wide range of manual settings and the Intelligent Auto feature for fine results without much effort.", "Date": "August 4, 2013"}, {"Title": "small controls", "Author": "John B", "ReviewID": "R13LJ8EBJSEWEG", "Overall": "3.0", "Content": "Just got a panasonic DMC-ZS5 and right off the bat the feeling was no good and all the controls were TOO close.Took a pic with it and it seemed ok,But the body is just too small for my hands,May be good for a girl.So i'll be looking for a slr with a view finder.Then atleast you have the feel of a camera not a toy. I dose have a wide lens 25mm,thats another reason i bought it.", "Date": "January 24, 2013"}, {"Title": "Nice camera- except for the quality of the pictures...", "Author": "G. Furciniti", "ReviewID": "R32ELOB6FUAXZA", "Overall": "2.0", "Content": "I bought this camera after scouring the internet for a quality point and shoot camera.  I am trying to take nice pictures of a fast moving toddler, and thought this was the answer.  I'm a not a photography buff, so I was looking for a camera that I can set on automatic and snap away.  I was very disappointed when I downloaded the first set of pictures.  Many of my Christmas morning pics were blurry- a problem I never had with my old canon sd800.  My primary reason for looking to upgrade was a snappier response rate and quicker flash recharge, both of which seemed to about the same as my old camera unfortunately.  I was happy with the construction and feel of the camera, but was underwhelmed with the image quality on the automatic setting, and I don't have the know how or patience to play with the custom settings.  So, I'm returning it, and I'm stepping up to the Canon SD95.  Yes a bit more expensive, but the kids are only little once.", "Date": "December 27, 2010"}, {"Title": "Perfect for amateur usage", "Author": "Robert Edward Ahrens", "ReviewID": "R3R6F0NF74YLLX", "Overall": "5.0", "Content": "I bought this camera to use occasionally at events and parties, basically amateur usage.  It does exactly what it should.  The quality is great, when uploading to the computer it is clear even zoomed in.  The video is also good quality, although there is no light available for video use, so only use it in well lite areas.  Can't complain about it.", "Date": "September 18, 2010"}, {"Title": "Panasonic Digial \"Point and Shoot\" Camera", "Author": "Paul B.", "ReviewID": "R9WA8EQAI72KZ", "Overall": "4.0", "Content": "Great camera, particularly the zoom capabilities.  And I do like the rechargeable battery design (versus the AA format found with many cameras in this class).  I do wish there were more printed instructions on using the camera -- since it seems to have far more capabilities than I am accustomed to.  But unfortunately, it does not come with an instructions manual -- other than the \"fast start\" type.", "Date": "September 9, 2010"}, {"Title": "Panasonic, where is my camera?", "Author": "Jessica Vosburgh \"kvos\"", "ReviewID": "RFXY7UN39SNK1", "Overall": "1.0", "Content": "Good list of features. Lacking manual focus which this camera should have. Great Zoom. I took several good pictures before the camera broke. The video quality is good as well. When the camera worked, I was happy with it and could stand to deal with the other issues, but now I wish I never had strayed from Canon.PROBLEMS!!!1. The lens broke 3 weeks into owning the product. 2 weeks of lost time while camera was with Panasonic Exchange Center. VERY FRUSTRATING!!2. I had to fiddle around with the settings quit a bit to get the image quality to be good. A lot of the automatic settings produce very poor pictures.3. The way the camera save images on the SD card (file storage format) is poor. You cannot create folders. All files are stored in one AND ONLY one folder.4. Due to the file storage format, you are essentially required to use their software to download the images if you want them in separate folders based on day of image capture.6-10-10 UPDATE: Panasonic sent me a refurbished unit in place of my broken ZS5 unit. I was frustrated and asked to get a new unit, not a refurbished one. They said that was not their policy and they have done all they need to do for me.My Advice:1. Camera takes decent pictures, but not great.2. Panasonic Customer service/policy is not good.3. Buy a different brand (based on my experience)", "Date": "May 5, 2010"}, {"Title": "Lumix", "Author": "Allan Hawkins V", "ReviewID": "R3ORXBVGTZ6FFG", "Overall": "3.0", "Content": "Great camera, powerfull zoom, but as all my Panasonic cameras, I got a dust particle inside the lens, How??? I really don`t know but seems to be very common with Panasonic.After a few months using this camera, lens get more dust inside. Poor seals inside.Forget the IA mode, totally frustating.7/09/2011HOW you jump from $214 to $339? Make NO sense!!!", "Date": "September 21, 2010"}, {"Title": "Great Camera for Price", "Author": "M. Owen \"Maureen\"", "ReviewID": "R9KSQ9OL7JRW2", "Overall": "4.0", "Content": "I was looking for a compact camera that had a lot of options.  This one does it!", "Date": "July 19, 2010"}, {"Title": "Lumix DMC-ZS5 LCD Screen", "Author": "PSLB \"stlouber\"", "ReviewID": "RRWJBVWKILIAD", "Overall": "4.0", "Content": "Very good camera but it is difficult to see properly the LCD screen when you are taking photos in the sun. Zoom and video are excellents.", "Date": "November 26, 2010"}, {"Title": "Panasonic DMC-ZS5 Not Acceptable", "Author": "Larry F. Crowell", "ReviewID": "RMSX3CV883QXY", "Overall": "1.0", "Content": "Pros: Wide angle lens, Great zoom, Compact sizeCons: iAuto is iDumb, Features Don't Work, Very Bad Flash PerformanceMy Uses: Live Music Videos, Live Music Pics, PortraitsUse: I take pics of live music acts, especially in large venues and small clubs, so I want a compact camera with long zoom, wide angle, and good low light performance.Present camera: Canon A720is, 8MP, 6x zoom, 35mm equivalent lens, 2.8, 1600ISOThe specs on this Panasonic DMC-ZS5 are so promising, and the performance is so disappointing.There are two KILLER REASONS that I have rated this camera Not Acceptable.1. The flash performance is totally unacceptable. About 1 out of 10 pics come out exceedingly blue tinted. Take a look at the pics in this link. Two consecutive shots within the same minute, same camera settings, stage lighting did NOT change.[...]The tinted pics can be approximately corrected in software with -15% blue and +15% red, if one was willing to do that. I'm not.2. I could not get any of the advertised \"Focus Lock\" features to work. I tried AF Tracking and both Continuous AF modes. No matter what I tried, when I pressed the shutter button, the camera still went through the Auto-Focus process. The AF-Assist lamp even came on. Panasonic claims a 0.005 second shutter lag with these \"Focus Lock\" modes; not achievable.I have 21 OTHER REASONS why this camera is not a good choice. Here's just a few. If anybody wants to know more of them, I'll be glad to post.3. For what I do, the iAuto mode is essentially useless. All of the indoor live music shots that I tried came out blurred. The reason being that iAuto decided that they were \"Night Portraits\" and shot them at 1/8 second or so.4. Almost all of my pics were coming out too dark. I had to continually use EV of +1 or +2.5. The slow speed of the 2-speed zoom is essentially useless. The zoom lever is way too touchy to access the slow speed.6. The software PhotoFunStudio quit working. \"Cannot continue the operation because the folder or file is being registered.\" I didn't bother to try re-installing it.7. The Hi-Sensitivity Mode (ISO6400) is pretty much useless. I was shooting Av mode at 1600ISO and getting a shutter speed of 1/20, which was kinda slow. So, I switched to Hi-Sensitivity and guess what, I got the same ISO and shutter speed, except at reduced resolution. Why bother?8. The Quick Menu is incomplete. Still have to use the main menu for some settings, like turning Intelligent-ISO on/off. Having two menus just confuses the issue. Looks like two menus were designed by two different groups of people who didn't talk with each other.9. In iAuto I took a night flash portrait @ Tv=1/8 Av=3.3 ISO=400 Size=2560x1920. Why wasn't the size 4000x3000, like I asked for?10. I sent messages to Panasonic, via their web site, about #1 and #2. No response after 7 days. And, the message text block on their site doesn't allow enough characters to explain problem, nor will it accept attachments.11. - 23. Contact me if you really want to know. Reasons 1. through 10. should be enough to scare you away.", "Date": "June 23, 2010"}, {"Title": "Not a Simple Point and Shoot", "Author": "Tracy Rogowski", "ReviewID": "R2UUSRJFJ3IWY0", "Overall": "3.0", "Content": "I purchased this camera for a trip to Disney, since I felt the camera I had did not take Great pictures. I read countless reviews and narrowed it down to this Lumix and a Cannon 1400s. I felt the Lumix would be a smarter choice since the optic zoom was greater. During my trip, I felt like I was constantly \"monkeying around\" with the settings...and missing shots . Fortunately, my brother and his family were on the trip with us and he is sharing his pictures with me. Also the AI (intelligent automatic) setting did not take great pictures. I realize I need a simple point and shoot that takes great pictures, so I will be trying the Cannon next. If anyone has any better suggestions for me I would appreciate them.", "Date": "November 11, 2010"}, {"Title": "Dont think BUY", "Author": "Efem Esi", "ReviewID": "R2B5ZZOPUSN8OP", "Overall": "5.0", "Content": "Really doesnt need to many words. Do the research, this camera is the best in this price range. Dont worry about the lack of 100s of reviews on amazon. More buy more review.", "Date": "July 17, 2010"}, {"Title": "Lumix DMC-ZS5 Camera", "Author": "Hartmut Voelker", "ReviewID": "R3H8N4FDZA2JFB", "Overall": "5.0", "Content": "The Camera was a grat purchase and takes great clear photos it also very easy to use.I would recomend this camera without hesitation.", "Date": "May 9, 2010"}, {"Title": "Awful customer service", "Author": "Jelf", "ReviewID": "R15X4GDY9C6DQU", "Overall": "1.0", "Content": "I am a semi-pro photographer and wanted something small to carry around for informal family shots.  I chose this camera for it's quality and balance of features after researching extensively.  The camera is nice, but not intuitive for someone new to Panasonic.  I need to go to the manual often for small adjustments and feature instructions (I still reference my DSLR manual after several years for rarely used functions). UNFORTUNATELY no printed manual comes with the camera!  There is a little start-up guide that is nothing more than how to charge the battery and turn on the camera, but the manual is only included as a .pdf file on a disk.  Now, the reason I bought a point-and-shoot was to use it when I wasn't home so I didn't have to lug my DSLR around.  I could print the manual - all 90 pages - and carry it in a folder with me... but really?  So I called customer service and discovered that you can order one for the low price of $23.69 plus $5 s/h!  When pressed for the reason a fairly expensive point-and-shoot doesn't come with a real manual, I was given the response that it is only for \"advanced\" features.  I gave them a hard time and eventually was re-directed to a manager who said the most they could do was waive the shipping and he advised me to print my own.  When I explained I didn't want to carry a file-folder around and wanted a compact manual (honestly!), he said that the $24 dollar one was printed the same size (8.5\"x11\").  I asked if he saw the absurdity of this situation and he agreed but could do no more.  Although the camera appears to be a quality little machine, I am extremely disappointed with the customer service.", "Date": "December 27, 2010"}, {"Title": "Poor indoor image quality", "Author": "K", "ReviewID": "R268O0WHC2TZU6", "Overall": "2.0", "Content": "I returned this because the indoor image quality wasn't good enough (In sunlight the pictures are excellent).  Instead I bought the Canon SX130IS.  It is a lot better, but not ground breaking either.", "Date": "November 27, 2010"}, {"Title": "Horrible display image", "Author": "Wop36", "ReviewID": "RCVAG3INAP2VD", "Overall": "1.0", "Content": "I would not recommend this camera. It had a horrible LCD display and the video it took was terrible quality. With all the great sub compact cameras out there I would strongly reccomend finding another one to buy.", "Date": "August 21, 2010"}, {"Title": "Disappointing", "Author": "R. Glaza \"rtred\"", "ReviewID": "RG34JMYG4A37D", "Overall": "1.0", "Content": "Unless you are a serious photographer this camera is a waste!!  Automatic settings create lousy pictures.  Very complicated to figure out.  have not yet figured out how to make corrections so the colors come out closer to what they should be.  Bought this because of the reviews and features, but the truth is in the pictures and they are lousy!!", "Date": "July 26, 2010"}], "ProductInfo": {"Price": "$299.99", "Features": "The DMC-ZS5 features a powerful 12x optical zoom lens (35mm camera equivalent: 25-300mm)\nThe 25mm ultra wide-angle lens has about twice the shooting area as a standard 35mm lens\nThe Intelligent Zoom with the DMC-ZS5  extends the zoom ratio by approx. 1.3x maintaining the picture quality even combining a digital zoom\nThe Sonic Speed AF system in the DMC-ZS5 has a maximum speed of approx. 0.35 second (wide-end) / 0.41 second (tele-end) for auto focusing\nThe POWER O.I.S. (Optical Image Stabilizer) nearly doubles the hand-shake correction power of conventional MEGA O.I.S", "Name": "Panasonic Lumix DMC-ZS5 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom with 2.7-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51D2NyEr%2B-L._SY300_.jpg", "ProductID": "B00395YA90"}}