{"Reviews": [{"Title": "Good camera for the money", "Author": "S. M. Jagodzinski", "ReviewID": "RZ7QHAEX4A5GL", "Overall": "4.0", "Content": "So my Kodak 8MP camera finally died I we needed to get a new one fairly quickly.  I decided to look at something under 150 dollars and was initially looking at Kodak, Canon, and Sony.  I stumbled on this one and I must say it is a very respectable camera.My take:- Housing is solid- At the highest resolution I can take 1100+ photos with a 4GB card- Picture quality is GREAT even in low light- Video was better than expected.  I have a nice Camcorder but this will be great as a backup.  Very clean and not choppy like previous cameras I have owned.- I like the \"auto\" shooting.  We moved from close to far and light to dark with no problems.  Great pics every time.- Menu is easy to navigate and quick to access.- I have not gotten a chance to test battery life but I plan on getting a backup anyways.- SDHC memory is cheap and the 4GB card I purchased from Amazon for 12 bucks works fine.- The only drawback I have is that on initial pictures sometimes I was holding the camera wrong and covering the flash.  The camera is very flush so you need to make sure to hold it correctly in low light so the flash is 100%.Overall, I have not had the camera long enough to see how \"durable\" it is, but 1st impressions are very good.I purchased this for $99 bucks on sale and for that price it is a no brainer. I would have been happy to pay the $130 dollar regular price. It has options that most of the 200 dollar cameras have and it feels solid unlike most of the lower priced options.", "Date": "April 27, 2010"}, {"Title": "All the features I want in a point-and-shoot at a killer price", "Author": "DrummerBoyInCalif", "ReviewID": "R3P7LX96TD5XT0", "Overall": "4.0", "Content": "I own a Canon DSLR.  It's great and all and I'll never replace it (until it breaks, that is), but for some outings where I just want to take \"we were here\" photos like at amusement parks and dinner out with friends, the SLR camera can be cumbersome, so I shopped around for a compact camera under $100.SL605 was just about the only model I could find under $100 with the features I wanted:  at least 8MP resolution (has 12.2MP), a standard rechargeable battery that charges over a cable like in your cell phones (instead of AAA batteries you have to take out), video mode, a modest zoom capability, and a decent LCD screen.  The shutter lag (my biggest complaint against compact digital cameras) on the SL605 is nothing like the SLRs, but quick enough to get all your still shots and portraits.  Other cameras with similar features all seem to cost at least $30-$40 more.I was pleasantly surprised to find additional features like auto slide show mode (with built in music) and auto eye-detect focusing (which doesn't work all the time, but I know of no camera that does).  Maybe I'll find more features once I read the manual.The camera comes with a nylon wrist strap, battery, charger cable (that doubles as USB cable), a clear plastic front cover for scratch protection (tacky for me so I don't use it), and a software CD.  The SD card (not included) is about the only thing you need to buy to get going.Someone gave this camera a 2-star rating saying \"blurry pictures\" -- I'm willing to bet the person probably has to practice holding the hand steady...  Anyway, mine works fine.Happy clicking.", "Date": "August 6, 2010"}, {"Title": "The Camera Standard", "Author": "Netname", "ReviewID": "RSYGCDSK21QCU", "Overall": "5.0", "Content": "I got this camera for $100. Tip: Buying black costs $10 more than the other colors, just buy silver.Pros:- Rubberized buttons- Comes with a free plastic faceplate case (pretty much useless, but it's the though that counts).- 12.2mp- 5x Optical Zoom- Angled shoot button- Auto settingsCons:- The screen is a tad bit slow- You have to go all the way to menu to change the modes- Don't know yet...The camera's auto setting basically takes care of everything. It adjusts to whatever your taking a picture of, in the dark, someone's face, or lots or movements. There is an icon that shows that it changed the setting automatically. Of course you can always go manual mode and choose yourself. Menu system is fun and flashy.Zoom is great, much better than the standard 3x optical zoom the other cameras have. Picture quality is good in light, haven't tried it in the dark yet.Having more megapixels isn't always better. It is the same case with this camera. It is all about the lenses, and this camera has decent lenses, too bad it doesn't have schneider lenses.[...]Also, remember to get a fast sd card. A class 4 or more should do... i think... Otherwise pictures save slow.", "Date": "August 11, 2010"}, {"Title": "Decent Camera, Unless...", "Author": "RonboNC \"The Picky One\"", "ReviewID": "R3KDDYAS8THAPM", "Overall": "2.0", "Content": "Was searching for a portable point and shoot to supplement my Canon SX120 which is a bit bulky.  Research led me the Samsung SL605 which has some great specs: 12 megapixel resolution, 5x zoom, small and portable.  Up to now I have only owned Canon digi-cams but I thought I'd give Samsung a shot since I do have one of their TV's.  I wasn't able to test the SL605 at the store besides holding it which was a mistake...Purchased the SL605 for a bit under $100 which is a great deal and brought it home all excited.  Nice LCD screen, nice packaging and immediately started shooting.  Everything looked great until I put the images on my PC and looked at them more closely.  Images were all a bit out of focus and lacked sharpness compare to ANY of my Canon P&S;'s.  I tried a couple of different settings and made sure to center the subject and make life easy for the auto-focus.  Still no go, the overall image quality is definitely a couple of steps down from what I'm used to.  Looks fine on the LCD but once on a PC you can see the problem.  And I'm not talking about blowing up the picture a lot, I imagine you'd see the soft edges at small to medium size prints, ugh.  So if you haven't owned a P&S; before, you might be happy with the Samsung SL605.  Me, I'm going back to Canon and ordering an A495...", "Date": "October 14, 2010"}, {"Title": "Surprisingly Good in Auto, fun to explore its other settings", "Author": "J. Conner \"qm2-703\"", "ReviewID": "RLFDJ56YZYYAB", "Overall": "4.0", "Content": "Not quite the optics compared to Nikon L22 or Canon A3100, but very close...not near as bad as the 2 star review here, in my picture-by-picture comparisons on a 22\" monitor. Its lens is f3.5, so its shoots a little darker in low light, but still acceptable.  Video looks equal to A3100 also.Case is plastic and not the best feel, but I'm glad I copied the CD manual to my PC and spent a fun couple of hours... Has a lot of settings, some very useful, I liked the night mode button, the ISO and EV settings, and I even found the Smart Auto to be pretty good.I will continue to compare it to my wife's A3100IS, and revise this review if I see any big problems.For $79 and everyday use, I am keeping this little guy, and saving for A Nikon L110 , Fuji S1800, or Lumix FZ35 to be more serious.UPDATE 8-1-2011 :Still very happy...for $79 this was a very nice deal.  Awesome indoor video at a Korean \"hot-pot\" dinner under normally bright kitchen lighting.  Yes, a missed picture once in a while, but mostly indoor with motion that was my fault.  Very light to carry, and simple to use. At this price range, maybe ther will be a dud along with the good, but I definitely got the good.", "Date": "December 22, 2010"}, {"Title": "Alright shot/features", "Author": "Toark", "ReviewID": "R2DOTBXB28Y63K", "Overall": "3.0", "Content": "For an $80 camera I guess that this was a pretty good deal. It does everything that a point and shoot should do, but not as well as I had hoped. The pictures tend to come off pretty blurry, even at close range, and action shots are almost impossible to have come out right. Pretty good for still shots or family photos, but if you're looking to do anything with more detail or precision I would look at shelling out a bit more money for a better camera.", "Date": "January 3, 2011"}, {"Title": "Real Man's Camera", "Author": "John C. Duncan", "ReviewID": "R3QNKLELFRYPVS", "Overall": "5.0", "Content": "The SL605 in not a sweet little Pink Purse packer. It's a TUFF little camera you put in a Zip-Lock baggy and stick in your shirt pocket, backpack, fishing box, or pickup console.  This camera is a clear winner in price, features, and performance over its competition, even before you add in its more rugged construction. Samsung's usb charging system is also a PLUS with this camera. A wall outlet charger is included, but it will also charge from any usb source. The battery is charged while remaining inside the camera like a cell phone.  Finally. If you have a little MAD MONEY, you might want to drop another $2.00 for a car/boat usb charger.", "Date": "November 22, 2010"}, {"Title": "Very Good for the Price", "Author": "I-Man", "ReviewID": "R36TTZ0IBCZXU2", "Overall": "4.0", "Content": "My old camera was a Kodak easyshare that was about 4 yrs old.  This one has lots of features and is very compact.  It does not do well at all in low light no matter the time of day. In good lighting it does a wonderful job and takes great pictures.  I do not like the software that comes with it because it is not very user friendly and I still have not figured out how to send pictures through email.", "Date": "August 6, 2010"}, {"Title": "SAMSUNG SL605", "Author": "J. Luis Medina Mondragon", "ReviewID": "RO7KYOICQTL74", "Overall": "4.0", "Content": "This camera is perfect for the point and shoot photographer who does not need many manual options. Was a surprise for me that the camera has bracketing, who is a very good option to choose the better picture between three. The protector for the front of the camera is very week and low cost, a little part of plastic that has to be insert in the front of the camera was broken in one week, but was not a problem for me, I only put it in the trash, and that is it, you really do not need that protection. It is not usable. The quality is very good and the quality of the picture is standard, not bad, not superb.", "Date": "January 3, 2011"}, {"Title": "I guess I was too cheap... --UPDATE--", "Author": "Johnny Twain", "ReviewID": "R2RAZ6VJX06J4H", "Overall": "5.0", "Content": "Although I wanted a small, compact camera for casual shooting on vacations and such, I guess I comprised money for quality. Don't get me wrong, this is an extremely durable camera, it looked nice on the display at the store, and it was the cheapest out of the bunch. I thought it was perfect until I realized the quality is very poor in low light conditions. Even when holding the camera still WITH flash in almost any mode, indoor pictures come out blurry, out of focus and grainy. Maybe I haven't played enough with the features, but even the DIS (digital image stablization) failed to properly process the image to a decent standard. Only when pictures are taken in the bright sun, do they come out fine.I'm gonna play around with it a little more, than stash it somewhere until we go to Florida, or some other extremely bright place so the pictures dont look like they came from a cheap toy camera.--UPDATE--We recently went on a hiking trip- and I remembered to un-stash the camera to take some pictures. I was pleased with the quality of the pictures outdoors! And ever better, the unit is extremely durable, feels nice and sturdy, and the rubber cover of the buttons kept dirt from my fingers out. The camera, for the price, is extremely useful for the outdoors!", "Date": "December 27, 2010"}, {"Title": "Excellent Camera for the Price", "Author": "Miles J. Diamond", "ReviewID": "R1210L89SDSIZG", "Overall": "5.0", "Content": "This is the second Samsung point and shoot I've owned, I had the SL420 before this one, which took very nice pictures, but I thought it was a little too bulky and had way too many options to sort through. The SL605 seems much more refined, it has a nice solid, well built feel to it, the buttons on the back have a rubber pad over the top, the plastic around the edge of the camera has a textured coating which gives it a nice grip, and so far I'm happy with the pictures it's taking. The only negative I've noticed so far is a vignetting caused by the flash on close up indoor shots. I'm very happy with this purchase and would highly recommend this camera to others.", "Date": "November 28, 2010"}, {"Title": "Average quality, features I needed, great price.", "Author": "tbl", "ReviewID": "R2LIBH6FRAOTB3", "Overall": "3.0", "Content": "I'm a police officer and needed a camera for calls I respond to on patrol. Our PD won't provide patrol officers with cameras, and the investigators (who have the good DSLR cameras) only respond for the more serious crimes.On a cop's salary it's hard to come up with the money for a high-quality camera, or to justify spending very much on one since there's a chance it'll get damaged being carried around daily in my gear bag. I needed a camera for around $100 with at least 10 MP, but most important to me was a rechargeable battery that I could charge via USB with the battery still in the camera. That way, while the camera's still sitting in my gear bag, I can plug the USB cord into the camera and then into the laptop in my squad car to charge the battery. I don't have to worry about the cost or bulk of carrying spare batteries, remembering to bring the camera into the house on my days off to charge it, or taking a rechargeable battery out and putting it in some external charger. Additionally, I wanted the USB cord to make it easier to transfer files from the camera onto a desktop computer to burn them on a CD to be put in evidence (our desktop computers at work don't have card readers on them so without a USB cord I'd have to carry a card reader to plug into the computer too). So after some searching I got this Samsung for $100 from a big-box electronics retailer that had it on sale.After having used the camera on patrol for a year now I can say it's adequate. The photos it takes look great on the LCD screen, but once you look on a computer you can tell they're much softer and not as sharp as what I think they should be. They're acceptable for court, at most they'll be printed at 8\" x 10\" size or displayed on a mid-sized TV monitor, and they give a good depiction of the scene. But any attempt to zoom in on or blow up the images quickly lets you know this is not a very high quality camera. There is quite a bit of noise present in the photos unless there is a lot of light (and I work nights, so my shots are often taken in less-than-well-lit situations). I've taken several photos side-by-side with my personal/family Canon SD1200 IS 10.0MP that's about a year older and the Canon takes much sharper and clearer pictures under every condition I've tried. If it weren't for the fact that the Canon's battery has to be taken out and charged in a wall charger I'd think about using it at work and saving up for a new family/personal camera. One other minor issue I've noticed is that the USB cord sometimes doesn't indicate that the camera's fully charged. There's a light on the end that plugs into the camera that turns from orange to green once it's fully charged, but oftentimes it won't change to green (even after a few hours of charging) until I start wiggling that end a little.So, for now at least, this Samsung will do. As I said, the more serious crimes get an investigator with a DSLR camera that takes high quality photos, so for the misdemeanor offenses my camera's used for the photos it takes will suffice.", "Date": "February 23, 2012"}, {"Title": "Not a Good Choice.", "Author": "sip123", "ReviewID": "R3KQ2O9VU3PW53", "Overall": "2.0", "Content": "I was looking for a very simple point and shoot to replace my aging Canon. I wanted to be able to charge the camera through my computer and I wanted a short lag time in between taking pictures, and this one seemed to fit the bill. I do enjoy those aspects of the camera. However, I have had the camera for 5 months now and I would return it if I could only find the paperwork. The auto settings are terrible - I've missed a lot of shots because of its inability to focus. Not that it focuses in the wrong place, but that it thinks I'm trying to take a close-up and the whole picture is completely fuzzy. Changing the shooting mode takes a lot of clicking around, as does switching to video mode, which I find to be really inconvenient. Additionally, the lens does not always open when I turn on the camera. It takes some tapping with my finger. This shouldn't be happening to a 5 month old camera. Completely unsatisfied with the product, unfortunately.", "Date": "October 2, 2011"}, {"Title": "Don't be suckered in by fancy specs", "Author": "joe", "ReviewID": "R2UUJKYTHDHAAY", "Overall": "2.0", "Content": "I bought this camera as a gift but also use it - I was sold when I saw it had superior specs to most (not just megapixels but better zoom etc) and got it on sale for a fair bit cheaper than the others.  Plus it (supposedly) had good customer reviews.  PS I have taken my share of pictures, including a fair bit of 35MM SLR work.  I know how to take pictures (not that this should really matter much with this kind of camera).It stinks.  Why?  Mostly because it often takes poor pictures.  The quality is often nowhere near what you'd expect even on \"good\" pictures and yes it DOES have a nasty tendency to take very blurry pics.  It is also the worst camera I have ever used (going back even to my old Kodak pocket instamatic, vintage 70s) in terms of \"red eye\" or similar deer-in-the-headlight eye problems.  This problem is extremely common and more than a little annoying.Want more?  Its so-called \"smart auto\" (ie \"just let me point and shoot\" mode) is a joke.  It rarely seems to know how to properly handle a pic, often using too much or not enough lighting, more blurry pics, etc etc etc.  In fact it's so bad I finally gave up on using it.I could go on, but you get the point.  It's OK in other ways (battery etc) so I give it (barely) 2 stars, but it's a poor camera in the most critical of all areas - taking good pictures - and I would suggest almost anything else.", "Date": "June 12, 2011"}, {"Title": "Terrible photos", "Author": "Jeff Wilson", "ReviewID": "RJ43IWFYYRE0I", "Overall": "1.0", "Content": "I don't understand how this camera has so many good reviews.  The quality of the photos is very poor compared to other cameras in the same price range.I purchased this camera after damaging my old 8 mega pixel samsung camera.  The older samsung took great clear photos so I thought I'd stick with the same brand.  I assumed these pictures would be even higher quality as the megapixels are higher.  This is not the case.  This thing takes horrible pictures.  Even on the brightest day the photos look blurry.  It's not an issue with the settings.  The images all look fuzzy.  Don't waste your money.", "Date": "March 1, 2011"}, {"Title": "Very Disappointing", "Author": "Jonathan Abbas", "ReviewID": "R3N80I0PGTR9WN", "Overall": "1.0", "Content": "With my current camera (Fuji F100) on the way out (startup time about 5 seconds, something internal is unhappy) I saw this for $61 at TigerDirect and thought I'd try it. tested it on a recent caribbean trip where it was a lot of outdoor bright light shots, basically conditions in which point and shoots should excel. Not this one. In bright sunlight the sky was washed out and the clear blue of the caribbean was not as vivid as I would have liked. Also, when the sun was in a certain position there's a rainbow ring in the bottom left corner of photos which ruined what would have been more than a few good shots. I got some great shots of a sunset using sunset mode, and some cool shots of the horizon and sky when there was waning light, but indoors and in bright light picture quality was poor. Also, when reviewing the pictures on a larger screen, any zooming revealed very pixelated images, so that cropping would be almost impossible.Take home message: terrible in bright light, below average in indoors, can produce great pics at certain light conditions, but very unreliable and you'll miss out on a lot of great pics. You get what you pay for, and as it's $60 may be good for a 10 year old's first camera, but not meant for anythign mroe serious. I'm sticking with my Fuji till it dies for good, then getting a Panasonic DMC-ZR3.", "Date": "December 29, 2010"}, {"Title": "Easy to use camera.", "Author": "Nancy Nolan", "ReviewID": "R1ZDQOFTETL031", "Overall": "4.0", "Content": "Easy to use.  Small enough to put in my pocket when I'm hiking.  I get great pics in spite of not being a very adept photographer1", "Date": "August 11, 2013"}, {"Title": "Great Digital Camera", "Author": "Theresa Dobersztyn", "ReviewID": "R1XJIKNSXW2CF5", "Overall": "5.0", "Content": "I purchased this camera for my daughter who was going away to college.  She is pleased with the product and continues to get much use out of it.", "Date": "May 22, 2013"}, {"Title": "Great Camera", "Author": "Linda J Molesky", "ReviewID": "RGRCH57OVSC11", "Overall": "5.0", "Content": "This is the best camera I have ever had.  I take it with me wherever I go.  It takes great photos and is small and can fit easily in a small purse or jacket pocket.", "Date": "January 20, 2013"}, {"Title": "Great camera for what I paid", "Author": "Brian C \"Bobazonski\"", "ReviewID": "RW1S75UG8D2U2", "Overall": "4.0", "Content": "When I bought this at TigerDirect, it was listed at $80 but I had a $20 credit so it only cost me $60. For THAT price, it's awesome. It takes great photos in very bright conditions, but poor photos indoors (unless they are up-close). If you, say, take a picture of something sitting on a table in front of you in a dark room, the picture will turn out great. It adjusts well to how much light the flash puts out, unlike my cell phone's camera, which will just give me a completely washed-out picture. HOWEVER, if you want to take a picture of, say, a group of people standing 20 feet away, in a living room lit by two 60-watt bulbs, it will turn out fuzzy, the color will look messed up, and there will be orbs all over the place.I hardly ever use my raw picture files, but instead usually use Picasa's \"I'm Feeling Lucky\" feature, which will compensate for lack of color and low contrast in most pictures.One small complaint, is that all my pictures have a smear near the top left corner where the picture turns out a tiny bit darker than the surrounding area. I usually only notice it in pictures where the color is constant through that area though, such as when the space is occupied by the blue sky. It only harms the brightness and possibly the color, it doesn't smear the photo or anything. And I've tried wiping off the lens, I think it's an internal issue with the camera. It's not noticeable at all on pictures that are \"loud\" in that area, like if I take a picture of a dense landscape.Overall, unless you think of yourself as a professional photographer, this is a great camera for kids, teens, and adults alike. Battery life is good, too, and generic replacements are a couple bucks.", "Date": "July 23, 2012"}, {"Title": "Practical camera - another good thing by Samsung", "Author": "EK", "ReviewID": "R7GKFF6TS1UC1", "Overall": "5.0", "Content": "I use it for my job. It is very practical camera, very good quality pictures in a daylight light. I consider it light weight and it is easy fits in any jeans pocket. Rubber buttons are easy to operate and camera easy fits in one hand. The best feature for me is the voice stamp of the pictures. You have to select it manually for every picture you want to have a voice stamp, but it does let you to leave a voice memo that is saved as separate file with same name as picture. Important feature for my job.", "Date": "July 14, 2012"}, {"Title": "Sturdy beast", "Author": "Aitor Porro \"LondonR\"", "ReviewID": "R1JFPQH7FX7WAV", "Overall": "4.0", "Content": "Does what it says on the tin.Its sturdy, handsome, if a little heavy, but an awesome camera with great functions.If what you want is a compact point-and-shoot with basic manual capabilities, then this is the puppy you need.", "Date": "March 30, 2012"}, {"Title": "Great Product for the Price", "Author": "AmazonAddict", "ReviewID": "R2DY4CBYF966S3", "Overall": "5.0", "Content": "I think this camera does an excellent job for the price. I purchased it about ten months ago and we are still going strong. I also love that it holds a charge for so long. Like I literally never have to charge it. So I think for 100 bucks or less this is a steal !", "Date": "June 1, 2011"}, {"Title": "BETTER THAN EXPECTED! Really good to take pictures of kids, dogs and unicorns :)", "Author": "Mailith Rodriguez", "ReviewID": "R1GA3PYXL0HKY0", "Overall": "4.0", "Content": "It doesn't look like a very expensive camera BUT the images are reeeeaaaallly goood! I love it. Is very simple to use it however I'm still learning some features! I have 3 weeks using it and the daylight images are excellent! The colors are vibrant! Really nice. I have 2 issues though. At night it doesn't have good quality pictures, it's a little bit granulated (specially in the blacks) OR I still don't know how to use it at low light. The other issue is that is not so simple to adjust the focus at \"macro\". I think it has to be in a SPECIAL MODE to be able to use that button. But, as I told you: I'm still learning how to use it. Like it a lot. So, I think is a really good camera for vacations, family trips and a day at a park. I surely recommend it!", "Date": "March 30, 2011"}, {"Title": "Great second camera", "Author": "Macknifetx", "ReviewID": "RRJIPPOQ2EJTO", "Overall": "4.0", "Content": "I ordered this unit as a Christmas present after having purchased one as a backup for my Nikon. My sister loves this camera and tok it on a cruise with her. The versatility, weight, options and quality for the price is great.", "Date": "February 24, 2011"}, {"Title": "Can someone help me?", "Author": "LOL123", "ReviewID": "R2QJ44WALJVR8P", "Overall": "4.0", "Content": "I really like this camera. Considering I got this camera for $79, it is quite afforable. I like how it comes with a anti scratch case for it. The picture quality is quite well. But, I need help. When taking the pictures, if you press the shutter button, an orange light comes out. Does anyone know how to turn in off? Please and thank you.EDIT: I just deleted a few pictures on accident.Is there a way to retrieve them back? I use a memory card for it. If you know, please tell me.", "Date": "December 5, 2010"}, {"Title": "Not as good.", "Author": "Avidphotographer", "ReviewID": "R3Q1IPDBJR3SSA", "Overall": "2.0", "Content": "I bought this camera based on the reviews I read online. I was quite disappointed. The picture quality in the smart mode is quite horrible. The pictures tend to be very blurry and out of focus. Video can be even worse. Zooming in & out during video shoot causes a lot of color changes & brightness changes. Removing the camera from the smart mode helps. Night shots are quite bad too.Overall I am very unsatisfied and would not recommend this product.", "Date": "May 29, 2010"}, {"Title": "SAMSUNG IS THE BEST", "Author": "Danny", "ReviewID": "R1U6I5FAJ8RVU5", "Overall": "5.0", "Content": "This camera is the best of the best was what I was looking, it fits my needs, I recommend it to everyone.", "Date": "April 3, 2012"}, {"Title": "Good price for a good camera", "Author": "lagcastello", "ReviewID": "R242E77T298BQP", "Overall": "4.0", "Content": "The price is good for the camera. It's simple to use, good pictures, and a good size.Good point and shoot.", "Date": "December 26, 2010"}, {"Title": "Great Phone!", "Author": "erwlyn", "ReviewID": "R1DKI0EVPOJ6WB", "Overall": "5.0", "Content": "I was very happy with this purchase, it's a great phone. I love the zoom and the view screen is huge. I'm not a professional photographer, but the pictures look good. Even better, the battery is rechargeable with the included charger!!!!", "Date": "September 28, 2010"}, {"Title": "Don't buy this unless you buy a Memory Card!!!", "Author": "NANCY A DICKEY", "ReviewID": "R2AELN9EFW0XRA", "Overall": "1.0", "Content": "Without a memory card this camera only takes 2 pictures before the memory is full! I know nothing about cameras, so I read the reviews and decided this would be a good one for my daughter, who is also a novice. I had her open this present first Christmas morning so she could take pictures of our first white Christmas and was SO disappointed when it said MEMORY FULL after 2 pictures.  Of course by the time she could get one this morning, the snow was long gone.  To me it is like selling a battery operated something without batteries - what good is it? But at least they usually tell you \"needs AA batteries, not included\".", "Date": "December 26, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "5x, 27-135mm equivalent wide-angle lens. 12.2 MP\nAnti-scratch Mask and rubberized construction around buttons, on bottom and around LCD display for durability and protection against dust\nSmart Night Mode for superb photos in low-light situations\nDigital Image Stabilization helps prevent blurry photos at slower shutter speeds", "Name": "Samsung SL605 12.2 MP Digital Camera with 5X Optical Zoom and 2.7-Inch LCD Screen (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41nXh3%2B8xAL._SY300_.jpg", "ProductID": "B0036RBER2"}}