{"Reviews": [{"Title": "Granddaughter loved it.", "Author": "M. Stobaugh", "ReviewID": "RI5EURVYVHPLX", "Overall": "5.0", "Content": "We struck Gold with this item!  This was a gift for a 10 year old Granddaughter's birthday.  She called us and told us how much she liked it.  She found it easy to use and was already downloading  her pictures to the computer.", "Date": "August 11, 2013"}, {"Title": "nice little camera", "Author": "C. A. Gibson", "ReviewID": "R1KEI8H8GVE2GV", "Overall": "5.0", "Content": "This is a great little camera, easy to use, takes very nice pictures, and is small and light enough to keep in my pocketbook inside a little makeup purse. And a great price!", "Date": "October 9, 2012"}, {"Title": "Great camera for granddaughter", "Author": "James Horton", "ReviewID": "R4W3IR0DV1UVB", "Overall": "5.0", "Content": "I purchased this camera for my 6 year old granddaughter. It has just enough features to take good photos without being too confusing for a young person (or older person for that matter!) :-)  She is able to seemlessly perform all the functions on the camera including deleting photos. The camera takes good pictures and she feels like a real photographer. I think this camera, for the price, is a much better choice vs. kids cameras. Also, easy to upload photos on the computer with the included USB cable. Only downside, goes through batteries quickly.", "Date": "August 4, 2013"}, {"Title": "Great mini camera, long on features short on price!", "Author": "Courtland J. Carpenter", "ReviewID": "R2Z61UQMC2UQX3", "Overall": "4.0", "Content": "It wasn't that long ago that 10 MP camera's were several hundred dollars.  I read somewhere about 6 years ago that the standard for professional film was equivalent to 11 MP, and so 12 MP camera's at the time were selling for several hundred if not over a thousand dollars.  Not to mention the special features, zoom, fuzzy logic, special effects, face detection.  While this camera cannot compete with the high end ones of today, by yesterdays standards it's an excellent camera.  The price is definitely right today!The internal software supports a panoramic mode, a movie mode, stabilization mode, and a portrait mode.  It as an 8X digital zoom in addition to the 3X optical zoom.  Navigation seems to be easy with the joypad, zoom toggle and other buttons on the back.  The 2.4 inch color LCD screen has impressive resolution for a camera this cheap, I was able to photograph and zoom in to read the text on this very review.  The camera itself is light and small enough to fit in my shirt pocket, something that you wouldn't mind taking on a vacation.  Secure in that it won't stand out as something to steal, but powerful enough to take many of the pictures those expensive cameras used to do for you.  If it does get stolen, well, you're out a few bucks, but for the price of this, you could carry a couple backup cameras just like it.Downsides, yes even the best products have them, and this is a battery eater.  I'm not sure it would have been better to have a rechargeable pack as some of it's higher models have, you definitely need to feed it with Lithium batteries, standard alkalines well be eaten up by the first couple dozen pictures.  It is probably possible to feed it rechargeables, just make sure to give it something with a 1.5 voltage, as the 1.3 volt rechargeable may or may not work.  One more thing, not a negative or a positive you do need to get a micro SD card, they are sold in grades, I got a 30 MB/sec one a 16Gig (max for this unit I think) a SanDisk for about 20 bucks as a local Office Supply store.  Overall a great buy and an even higher recommend than the stars would indicate.  Yes I know you like to use your 12 MP cell phone, and that's all well and good.  Consider though, a real camera lens, a quality zoom, and something dedicated to creating good pictures is usually better than the after thought camera that goes into most phones.  While it lacks the ability to instantly post to facebook, the way things are today out on the web, maybe we should take some time before we do those posts anyway!", "Date": "September 14, 2013"}, {"Title": "NICE CAMERA", "Author": "KBROWN", "ReviewID": "R1TLS92IXJN5TH", "Overall": "4.0", "Content": "I purchased this camera for the convenence of a smaller camera.  My main camera is one that is alot bigger with multiple lenses, not one i wanted to carry around Disney Land.  This GE camera takes very nice picture. Except i couldn't get good night pictures. My daughter said i had to turn the flash off, but i couldn't figure out how (she did).  It is not a heavy camera at all, but it is not the lightest one i have picked up.  I would recomend this camera for the price.", "Date": "April 5, 2011"}, {"Title": "Works Great", "Author": "Andrea  E Menzies", "ReviewID": "RCT0YJXCL1M84", "Overall": "5.0", "Content": "Clear and fast working camera.  Better for day photos than for night.  So quick and portable, you take it with you more places faster than the larger cameras with more features.  When you need better photos with more flash than a cell phone camera, but don't want to fuss with a huge camera for test shots this is the camera to use.  A real photo work horse at a discount price.  Clear photo with nice features.", "Date": "March 9, 2013"}, {"Title": "Great Camera", "Author": "Theresa Neumann", "ReviewID": "R2EDRW1CP862V1", "Overall": "5.0", "Content": "I bought this for my daughter and she really loves it.  She unfortunately dropped it in a stream while taking pictures.  It stopped working and we thought it was done for.  She was to say a bit upset.  Amazingly she tried turning it on a week or so later and it is working perfectly again.  Pretty good for an inexpensive camera.", "Date": "September 8, 2013"}, {"Title": "Good, but not simple enough", "Author": "M. Oja \"Queen Marina\"", "ReviewID": "R383D4LD1EDWU5", "Overall": "4.0", "Content": "Although this camera is pretty simple to operate, it's still not simple enough for me.  I want the very basics in a digital camera.  I use it occasionally.  Taking photos and downloading them is easy.  It seems to have a long battery life, too (which I hear is rare in digital cameras).", "Date": "December 7, 2011"}, {"Title": "Does the job", "Author": "Fish Hunter \"Eddie\"", "ReviewID": "R29FO7SXFWSLC5", "Overall": "4.0", "Content": "Takes quality pictures and can be transfered to your hard-drive by cable.  Smaller than I thought.  Fits in your palm.  Overall a good buy!", "Date": "March 8, 2013"}, {"Title": "love it", "Author": "kritterspot", "ReviewID": "R1D3EJB1183S2D", "Overall": "5.0", "Content": "love this camera. this works great. it takes great pictures. its not too complicated to use, in fact I figured it out without the manual. the price was pretty good compared to what other cameras cost. overall this is a great buy.", "Date": "June 18, 2013"}, {"Title": "Very easy to use.", "Author": "A-Chan", "ReviewID": "R81S8MKHKD8VO", "Overall": "4.0", "Content": "I am not the most skilled when it comes to digital cameras, sometimes I have to examine them like we examine a TV remote we've never used before. Thankfully, it took me about ten minutes to figure out the most basic controls and I have already taken a lot of pictures.The screen even at the highest brightness setting is terribly dark in a dimly lit room, and the screen is black in a room with no lights. As mentioned in other reviews, this camera is dependent on good lighting. However, the flash is brilliant, and it takes VERY crisp and clean photos.The instruction packet that came with the camera doesn't match the camera itself. Most of the buttons it describes aren't on the camera. There is very little that it says about changing settings, besides the date and time.Other than that, I still found this easy to use. The zoom is great, and even at full zoom, I still get very clear and clean pictures. No blurs or pixels. It may not be the most high-tech digital camera, but it isn't bad at all, and does the job well.", "Date": "October 15, 2013"}, {"Title": "Great product for the price", "Author": "Ann Riley", "ReviewID": "R1VCRAR1CUHI2", "Overall": "4.0", "Content": "It's an easy to use point and shoot camera.  It does get a bit difficult to scroll through the settings though.  The paperwork that came with the camera was very basic and was not for the camera that was in the box, so basically I had to figure it out on the fly.  That being said....takes great pictures and that's all I wanted", "Date": "January 14, 2014"}, {"Title": "Christmas gift", "Author": "Militaryswimmer", "ReviewID": "R2Z3XJVZMBSEWI", "Overall": "4.0", "Content": "My aunt was happy with the camera and now she is taking lot of pictures if my baby cousins and all of there tous", "Date": "January 11, 2014"}, {"Title": "Good Camera", "Author": "DelieB", "ReviewID": "R3S3JS6DGA47XS", "Overall": "5.0", "Content": "Good camera for a first timer.  Got this for my grandson's first camera.  He was thrilled when he opened the package.", "Date": "December 26, 2013"}, {"Title": "Quality camera.", "Author": "Patricia M. Barbieri \"patb\"", "ReviewID": "R2KGD29T0JDRRL", "Overall": "5.0", "Content": "This camera takes great pictures.  It is also very durable.  I bought it for my 6 year old grandson.  He dropped it twice with no damage to the camera.  On his own he was able to figure out how to delete pictures he did not want to keep.", "Date": "December 9, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "10MP Digital Camera with 3x optical zoom and 5.7x digital zoom\n2.4 Inch vibrant LCD with auto brightness\n8MB internal memory with SD/SDHC card support up to 16GB\nFace detection, in camera red eye removal, image stabilization, panorama\nUses 2 AA batteries so you'll never be stranded waiting for your camera battery to charge", "Name": "GE C1033 10MP Digital Camera with 3X Optical Zoom and 2.4 Inch LCD with Auto Brightness (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41mbFG3WOOL._SX300_.jpg", "ProductID": "B003B437ES"}}