{"Reviews": [{"Title": "Top notch images", "Author": "Jeffrey \"HandyGeek\"", "ReviewID": "R1K5VKGKOXHENV", "Overall": "5.0", "Content": "Having owned many pro-level cameras in the past, it was difficult for me to find a solid and versatile point-and-shoot. This camera has everything I was looking for and just a bit more.Pros:I am impressed with the amount of control the H55 gives me.Panoramic imaging built in (its nice to see the results right away rather than just eyeballing it) .Image quality - wow @ 14MP, the images are gorgeous.Color accuracy is great with good lighting.The camera handles quite nicely and is very easy to navigate.The wide angle lens is fantastic at this price. As a pro I would have spent a couple hundred on the lens alone.Excellent range on zoom. I was quite happily surprised.Battery life seems much more adequate than the W330 I previously purchased and returned.Cons:The flash is far from balanced and seems too hot to be used for fill. I'm new on this camera and I'm used to pro-level equipment, so I'm sure I'm expecting too much here. That, or I just don't yet have the hang of it.Color accuracy breaks down at lower light levels. Since I didn't have a real meter with me, I couldn't tell at which precise number breakdown begins to occur. I would guess around 4 lux is about as good as it gets. Beyond around that, it gets pretty noisy. I'll experiment with some night shooting when I have it on a tripod. But I won't get my hopes up.Doesn't seem to allow you to manually close the lens. Not a dealbreaker, but it would seem a fairly simple feature to offer.", "Date": "March 29, 2010"}, {"Title": "Nice Images!", "Author": "Everything´s Possible \"Openworld\"", "ReviewID": "R2H66DOLZVOX4B", "Overall": "5.0", "Content": "This camera has an excellent Optical 10X zoom, images can be seen clearly and with rich colours. Also using the 20X digital zoom photos have many details, you can apreciate like lines in a wall or symbols in a stone. 720p video looks great when played in my laptop and it does not have blur or moving lines like in other camera's brands, thanks for the mp4 format, very, very portable. Nice panoramic photos, I use them as wallpapers. Only one thing I couldn't do with this camera was shooting the moon or filming it, may be I have toread the manual with more calm. SD Cards supported, nice move!", "Date": "March 29, 2010"}, {"Title": "great outdoor, not so great indoor", "Author": "Amazon Customer \"eclectic wonder\"", "ReviewID": "RCLSLVQ020EC7", "Overall": "3.0", "Content": "Good: outdoor lighting, fantastic - nice color saturation, quick response, sharp images, panoramic motion interestingBad: slow, slow, slow in low light or indoor conditionsThere was a noticeable lag especially in lower lighting when the flash went off.  I have never returned a camera, and this one went back.  I was disappointed in the indoor condition performance as compared to previous W-series Sony Cybershots and Canon PowerShots especially.  I returned the H55 for a Canon S90. It's too bad because the outdoor lighting photos came out beautifully.", "Date": "May 3, 2010"}, {"Title": "great picture quality and zoom functions", "Author": "Mr. Umesh K. Dubey", "ReviewID": "R293KTGVYNEC0N", "Overall": "5.0", "Content": "I have been looking for a replacement to my previous Sony 5.1 MP camera for which i paid the same amount that I paid for this camera.  It's amazing to see a sea change in the quality of the pictures especially under relatively lower light conditions and outdoors. The zoom is outstanding. I can agree with the previous reviewer that the picture blurs, but I have a different take.  If the object moves or if the hand shakes a little.  In my view this is OK becasue multi-burst function has been disabled by default.  But, I have taken moving pictures and it comes out fine most of the time.A word of caustion that do not purchase this camera primarily becasue it has HD recording.  The picture quality of HD recording indoor under medium to low light is noisy.  And even in outdoor, the movie function can't replace what a full blown HD camcorder can do.I recommed this camera to anyone who is looking for shooting great quality indoor/outdoor pictures.  The smaller pocket size of the camera is really a big plus compared to it's predecessor, H-20 model.I haven't utilized all it's features.  I will right more when get to know more about this camera.  One last thing that the black plastic housing looks cheap.  I wish Sony had added some metal and hardness to the body of the camera.  Overall, I give it 5 stars becasue the camera excels in its bottom line functionality which is to take excellent shots.Well, I have some bad news.  After a week of use, I noticed that the camera is washing away the colors if the person is wearing lighter colored clothings like light blue, light green, light yellow, or cream colors. It happens when taking pictures indoor. The lighers-colors in iMode settings don't come exactly the same.  They appear whashed away.  I am having a second thoughts about this camera.  Not to mention that the outdoor pictures are perfect and even the indoor pictures are great if the person is in dark colored clothes.", "Date": "April 1, 2010"}, {"Title": "nice camera!", "Author": "J. Skilton", "ReviewID": "RXFLZ5I0LV1PH", "Overall": "5.0", "Content": "This has been covered to death, so a few brief comments on my personal experience.  I bought this to use as a point-&-shoot, and did not expect to get more than I paid for, but was pleasantly surprised.1 - extremely easy to set up and use.  Charge the battery, install a media card, and turn it on.2 - Battery / memory card door is pretty cheesy.3 - takes good pictures.  pics have good color and brightness, need little to no post-processing.4 - low light pictures are -really- good (for low-light pictures), waay better than I expected.  Bravo twilight mode.5 - panorama mode works well and is priceless if you do much shooting in tight quarters, or of large groups - however, no zoom.  Wide-angle only, which maximizes cylindrical distortion.  I still love it.6 -  I do mostly stills and had little interest in movie mode.  Very much appreciated saving $100+ from the HX5V.7 - Works as advertised.  If this is what you want, buy with confidence..", "Date": "May 24, 2010"}, {"Title": "So HAPPY", "Author": "Michael", "ReviewID": "RBEVH0MDT3INK", "Overall": "5.0", "Content": "Sony Cyber-shot DSC -H 55.I have owned two other cameras in the past.  My last Camera, before this one, was a 12 Megapixel.  And I thought it, at first to be ALL THAT.  This was only because my previous camera had been a four Megapixel.  I was so impressed with the increase in the resolution that is all I could see was the ability to crop photos to a better end then I had been able to.  After the newness had worn off I began to realize the Cameron was just a lemon.  So with this camera, that mistake will not happen again.  The (14 Megapixel) of this Sony camera is not that different from my (12 Megapixel) camera that I am replacing.  So I will look past the resolution difference with ease.However the (10 x) zoom lens is NEW.  Not only to me, but to all (point and shoot) cameras I have ever seen.  Now, the 10 x zoom lens that I am talking about is NOT digital zoom.  But rather, purely optical.  There is a digital zoom offered in the menus of this camera.  But I simply turned this feature off.  If I want to do any digital zoom, I'll do it in Photoshop on my own time.Other perks include; a battery and charger.  The battery is lithium.  And knowing that a lithium battery must be conditioned before its true capacity can ever be obtained.  And even before the battery had been `conditioned' it was still able to take approximately 400 shots.  And of course four or five HRS of me playing around in the menus with the features.  And I know from past experience this can be one of the biggest power drains on a camera battery.  And this is only the first cycle.  I don't foresee a need in my future to buy a spear battery.While I am on the subject of batteries, I need to mention.  The battery charger is a cute little thing.  The part of the plug that actually goes into the wall will fold into the plastic housing.  So it is not a burdensome piece of machinery to store.  And the whole thing is extremely small.  It is only 3\"x2\"x1\".  To me that sounds ridiculously small, and if it were not right here in front of me I might not even believe.  But it is true.  It will fit in my small camera case, instead of the drawer.  I already have enough mess around my room.Also about batteries, there is a handy little gauge, on the LCD screen, that reports the amount of battery left by a four bar indicator (like a cell phone).I spoke earlier about the massive zoom lens.  But I didn't even tell how this camera can also take a macro picture up to about 8\" away at full wide angle (zoom out).  The 8\" I just spoke could be off a little by + or - an inch.  The manual that could tell me for sure is over there in that box, and I am over here.  And I'm a lazy person.I'm really impressed at how small this camera is.  It will fit very nicely, with lots of room to spare, in my chest pocket.  I do wear a 2X shirt, but there is so much room left over, I bet you could fit this camera in a large size pocket.  I haven't had a chance to test it; I'm just using my best estimate.  On outings, being able to tuck this camera away in my pocket will be way awesome.  And it is so light weight.And it weighs very, very little for such a nice camera.  I have a cordless optical mouse hooked up to this computer.  So by comparing weight, the mouse is the more heavy of the two.I think I have touched on the biggest topics I can think of at this sitting, but to sum this up.  This is the best camera I (personally) have ever owned.  This would include 2 other digital cameras (one SLR type & one point and shoot) and a couple `film cameras' 110 and a 35mm SLR my uncle left to me.  And after comparing it with all the other ones available at the stores, it IS the best.  I compare every time a store has a display, to see if mine is still better.  Even some of the `better' SLR types that sell for $100's, fall short.  I would be really upset to see that a little `point & shoot' can beat my $800 `SLR type' camera.  At $225 and $25 3 year extended warranty from Samsclub, I have a new gizmo and I did not break the bank.", "Date": "October 8, 2010"}, {"Title": "A Great Little Camera", "Author": "nica \"nica\"", "ReviewID": "RLCE33B37XIH", "Overall": "5.0", "Content": "When you cannot or do not want to take your SLR, Take the SONY DSC-H55 instead. The range of features lets you take advantage of a wide variety of situations. In a darkened room with stage lights, the photos are well-balanced in color and contrast. Also, the movement is captured without blurring. The panoramic feature is great although it takes a little practice to \"get it right\" and not cut off the panorama too soon. HD video results in a nice capture of movement even for as short a period as 10 seconds but it does burn a lot of battery energy. Get yourself a spare.(I didn't but I will.) Macro shots are a little difficult to capture \"in the wild\" but indoors, nice photos can be captured. The 10X zoom is big improvement over 3-4X zoom. When I wanted details from a distance, I got them. Wide angle shots were good within limits. Size-wise, the camera fits in the smallest of pockets. I've only had this camera a few months but I keep it with me all the time. Still learning to exercise its features, especially manual control of the lens.", "Date": "May 25, 2010"}, {"Title": "Not as great as it seems", "Author": "Rafael F. Sanchez", "ReviewID": "R24MNKCKMISRJ2", "Overall": "3.0", "Content": "The camera has some nice features but also some problems.  First the flash is too strong.  The photos with the flash at a normal distance come out too white.  There is no setting to adjust the strength of the flash.  The metering system gives a setting of overexposure.  At 0EV the graph curve is usually slightly to the right and the photo comes out overexposed.  I find myselft having to adjust the setting to -0.3EV or more to get the correct exposure.  This is the biggest problem with this camera, maybe it's a defective problem with the one I have.The nice feature is the panoramic feature where you can easily take a panoramic photo and it comes out really great.  The wide angle and zoom features are also a plus along with the HD video.", "Date": "July 6, 2010"}, {"Title": "Don't do it!", "Author": "Susan Fisher \"ClubFisher\"", "ReviewID": "R2A6GEPBEVDY66", "Overall": "3.0", "Content": "We're a Sony family. And recently we bought this newer cybershot...NOT as a replacement, but we wanted the two new features: the 14.1 MP and the 180-landscape.We're disappointed.1) On Amazon, the camera listed the lens as CARL ZEISS...IT IS NOT...I went to the Sony website, found out the real facts, wrote Amazon, they updated the listing...and lss: the lens just is not the par of Zeiss...I know, I know, Sony says they did this, to me anyway, because it is equal quality...and maybe they'll say Zeiss makes it...but it's just not as crisp as our 10.1 or 12 cybershots with the Zeiss.2) The cameras focusing is slippery...whether I use auto focus and no matter how we set it up, there is NOT consistency in same shots as far as  how the shots are focused. Further, the lens makes a lot of noise trying to focus. Also, when videoing (forgetaboutit) much too much of my videos are blurry...again, the camera cannot focus. yes, even using the image stabilization we still get blurry shots or focus that is not on target (relying on the focus feature where the grid does show up on the LCD).3) The noise mentioned in #2...There is a slight, but discernable eletronic grinding noise...Sony via phone service was concerned...'this should not occur'  so I sent it in for service...I was called, SONY IS GREAT when it comes to service, and they said, 'this is normal'...so there you have it. I have a normally 'louder than no-sound' cybershot that doesn't focus well and makes a ton of noise.4) Inconsistent...of course #1 and #2 makes for inconsistent shots, BUT that's just plain irritating and disappointing...and it's NOT what Sony's known for ----so we're primarilly keeping with our older Sonys and only use this for the landscape mode, however NOTE...5) The landscape mode, which is very, very awesome in concept is just not implemented well yet. I'd not buy until maybe next or 3rd generation. The camera allows you to set your 180 swing to go from left-to-right, up-to-down or visa versa of either of these. GREAT concept...Further, the camera's smarts tell you when you're not doing the swing smoothly enough, per se, or perhaps you moved too much off the center and it will tell you, essentially it isn't taking the shot, and you can retry. Okay, sounds good. BUT there are times when I've taken the picture and the shot is broken into slices and so the photo is a long landscape, but with blank spots between portions of the whole image. This does not happen every time, but too many times and frankly, not what the camera should be doing. So again, \"DON'T DO IT...don't buy this version!\"We paid full retail from an Amazon dealer ($250)...and bummer, it's been serviced once, we were told there's nothing out of the norm' with our camera...and so, we have what Sony knows they produced...a bit sub-standard...and we're knowing it was more or less a loss of money.We say at this point if you really want to buy a Cybershot: DON'T buy this one. Get one with Carl Zeiss lens, and for now, stick to the old fashion way of making a huge landscape...many shots, and cut and paste in your choice of  photo management tool! And btw, our 2nd choice is the Olmypus Stylus 550(water resistant if you have kids it's a real smart camera to own for all the shots from sprinklers and tubs to oceans, fishing, rain play etc.)", "Date": "July 19, 2010"}, {"Title": "Incredible Camera", "Author": "Jason Jimenez", "ReviewID": "R33SGBDXS5N3F0", "Overall": "5.0", "Content": "This truly is the best camera I have ever owned. I have bought probably 10 cameras on Amazon. I am not a professional by any means but I love photography.This camera is truly amazing. The pictures are crisp, clear and the colors are brilliant. I literally bobbed the camera as I walked and took pictures at a car show. Every single picture came out perfect. I have nothing bad to say about this camera. It reigns supreme.", "Date": "May 18, 2010"}, {"Title": "The best. Number one!!!!", "Author": "A. Quicho", "ReviewID": "R1E2PZ6VPJA2R", "Overall": "5.0", "Content": "The best camera and video combination I've ever purchased!!! I did purchased the Samsung dual  touch screen but I returned it the next day due lot of noise in the picture and is not simple to operate. I also purchased the Fine pix with 10x zoom but also with a lot of noise in the picture when I downloaded it at the PC.  This is the best camera for a 10x zoom.  I could have bought the HX5V Sony model but too expensive for me. I found no flaws.", "Date": "April 3, 2010"}, {"Title": "Disappointed", "Author": "J. Parbus", "ReviewID": "R23I24EZVZCEPB", "Overall": "2.0", "Content": "I bought this camera on Aug. 30, 2010. It sounded great with many great features none of my other cameras had.About a week later, my husband and I went to Las Vegas. I hadn't really had time to read all the camera's  instructions yet but had fun trying out all the functions. The panoramic views were great, used it at the Grand Canyon and Hoover Dam. All outdoor daytime shots were beautiful. Then came nighttime. I was so disappointed. All the night photos were washed out, blurry, hazy, etc. I chalked it up to not knowing the proper settings to use.Since then, I have read the manual several times, adjusted settings over and over and the shots never got better. I live near a lake and love to photograph the gorgeoue sunsets. This camera misses the subtle shades of reds, pinks & blues. I really wanted to like this camera, but couldn't.  I returned the camera today.", "Date": "October 17, 2010"}, {"Title": "Takes all the fun out of it", "Author": "Ben Franklin", "ReviewID": "R20T41LHXI1N2F", "Overall": "4.0", "Content": "This camera meters and fills in shadows by metering those shadows. I have never seen a camera that could fill in the shadows of a subject standing next to a wall without using fill lights or multiple flash units. As a professional videographer and a highly advanced armature photographer, this technology is a little concerning because it takes all the work that went into making great pictures pretty effortless. With that said, it was a good buy for my wife that does not want to know that particulars about taking good pictures, but just wants a camera that will take good snap shots that are not blurry and have good color saturation. There are a lot of other good features in this camera as well, such as the panorama mode. It stitches the photos instantly giving you an 180 degree panorama shot.", "Date": "June 1, 2010"}, {"Title": "Best  200 bucks I've spent", "Author": "Jeffrey Bregg \"splinter\"", "ReviewID": "RC0J9FUSUDWWH", "Overall": "5.0", "Content": "I looked at the reviews before I bought the camera (I always do  before I buy anything).  The reviewers gave it a high rating and I whole heartedly agree.  It takes great pictures and the zoom (10x) is really fantastic.  I have used the zoom to take a picture of a truck that I couldn't read the writing on.  The built-in flash is great. The 3\" screen let me read what was on the truck with ease. The panarama feature is really great. I took a picture of my yard from one side to the other by just standing in one spot in front of my house and turning.  The movie setting is also great.  I used it film my yard and gave audible discription of what I was looking at.  And I could zoom in while shooting the movie. Other reviewers mentioned noise when using the zoom when shooting movies but my camera didn't make any noise that I noticied.  Hope it stays that way.  You have to buy a memory stick separetly.  I bought an 8gb stick (by Lexar) and it works fine.  You can take movies that are just under 2 hrs. to over 5 hrs. depending on the picture size (you set the pic. size from the menu).  Remember that like everything else today, the manual you get with it is small and you need to download the disk that comes with the camera to get the full manual you can then read on the computer. The computer maual is really excellent. Everyone I showed the pics to (on the LCD screen) were extremly impressed.  Best money I've spent in long time!!  It only weighs 7.1 oz. w/ battery.  I do recommend buying an extra battery and case (it doesn't come with a case).", "Date": "July 18, 2010"}, {"Title": "Photo Lag", "Author": "david in CA", "ReviewID": "R1JB6WTG6W21JP", "Overall": "1.0", "Content": "it has some good features pretty easy to use, good size and a good feel but...any time you use the flash, the time between the button press and the picture being taken needs to be measured in eons (definately not miliseconds)I have a lot of sony products including a previous cybershot (bought in 2004 that had less delay, though some) and i had hoped that 6 years on this would have been improved instead of getting worse.Forget a picture of your kid blowing out the candles on their cake, they will already be cutting it by the time this captures an image and the chance of catching a great but fleeting smile .. you as well put a blind man with leg shackles and hands tied behind his back in the yankees stadium.Very disapointing product from a company that usually creates great ones.", "Date": "December 27, 2010"}, {"Title": "Good photos but MP4 video, the pits", "Author": "Lawrence W. Stephens", "ReviewID": "R11WPP312VAZQ4", "Overall": "3.0", "Content": "This is a combined Sony DSC-H55 and Panasonic DMC-ZS5 review. My wife first bought the Sony and was happy until she shot some video. We next tried the Panasonic. They both are very close in the photo results. In normal light and 1 to 3X focal length, they are for the most part equal with Sony having the edge. At max telephoto the sharper lens of the Panasonic makes itself known. In poor light the Sony is very soft and the Panasonic is sharper but noisier. If you don't use either camera for video they are quite close. Now video is another matter. Here it is straight from the properties from a clip from each camera. The Sony records at 1280x720 data rate 9,148 29 frames/second. The Panasonic records at 1280x720 data rate 31,168 30 frames/second. Sony uses MP4 and Panasonic uses MOV. Sony's video is good only for video sharing, moving video to MP4 devices and the like, a lot of pixilation. Shown on a large 16x9 LCD display it is worse than a good SD video. We did not look at the Canon because they lock out the zoom when shooting video. The Panasonic focus while zooming is quite good. There is some zoom noise but it is low. I would recommend a bridge camera if you can get by with the larger size and greater cost as the P/S large telephoto lens/sensor are just too much of a compromise.  In summary, Sony photo 3.6 stars and Panasonic 3.5 stars. Sony video 1 star and Panasonic video 4 stars. Best P/S I've seen is the Canon SD780 IS 3X telephoto. Because we had this camera to compare to, the Sony and Panasonic got low marks in sharpness and noise.", "Date": "June 4, 2010"}, {"Title": "Great photos, great zoom, and easy to use", "Author": "Tradecraft \"Commit to Win\"", "ReviewID": "R38FL1DO5EGOYP", "Overall": "5.0", "Content": "I bought the Sony Cyber-shot DSC-H55 14.1MP Digital Camera to replace an older Sony Cyber-shot that was 7.2 MP. What a great difference this camera is in settings, ease of use and it takes great photos.I did a lot of research, read tons of reviews and went to the store to look at many different point and shoot cameras to replace my old Sony camera. The Sony Cyber-shot DSC-H55 was my choice and I am very happy with my decision.The Sony Cyber-shot DSC-H55 is very easy to use. The iAuto setting automatically optimizes camera settings and works great. If you don't want to mess around with learning all of the options the iAuto setting will work fine for your needs. I have taken pictures in almost complete darkness that came out perfect without too much brightness from the flash to cause a \"white out\" effect.I love the 10x Wide Angle Optical Zoom which really allows me the ability to get a close up photo from a distance. My prior Sony Cyber-shot only had a 4x zoom and the 10x zoom is so much better. This was a huge factor for me when I bought this camera and I have not been disappointed.The Sweep Panorama Mode takes awesome photos but can take some practice to use correctly. The 14.1-megapixel allows you to take excellent and clear shots that can be blown up to a large size photo of 16\"x20\" with great clarity and quality.The HD video quality has been great. One feature that I really like is that you can zoom while taking video. Some of the older Cyber-shots do not have this ability. But, if you zoom while taking video you will hear the noise from the lens moving in your video. Not a huge deal but it is a factor when shooting video.There is a card slot for optional Memory Stick Duo media and SD media. I currently use a 4GB Sandisk Secure Digital SD HC Memory Card which holds about 1,207 pictures when the camera is set for the highest resolution. If you lower the resolution it can hold thousands of more photos.Battery life has been awesome and I have not had any issues with the battery dying too soon. I did purchase a spare battery as a backup. I would hate to lose the opportunity for great photos due to a dead battery.The one compliant that I have with this camera is that the battery door seems fragile and very easy to break so use extra caution when putting in the battery. Again, not a deal breaker but extra caution is needed. Also, there is a slight pause when you take photos but this seems to be a common factor with most of the point and shoot cameras.I definitely recommend the Sony Cyber-shot DSC-H55 14.1MP Digital Camera for its ease of use and great picture quality. This camera will let you shoot like you are a pro. I am very satisfied with this camera.", "Date": "January 21, 2011"}, {"Title": "Nice Camera to take Pics on Day Light.", "Author": "R. F. Galea", "ReviewID": "R2KOOR5U6W6MCV", "Overall": "4.0", "Content": "The Resolution of the images is great, and the video is also excellent. But when you use the camera with the Flash at Night, it can be a little obnoxious, You have to wait at least 2 or 3 seconds for the flash to operate and for the camera to stabilize the image, and even you can get a blurry or moved image. But Still a good camera. =)", "Date": "October 21, 2010"}, {"Title": "The little camera that CAN DO IT!", "Author": "C. Robert Edewaard \"DYI Bob\"", "ReviewID": "RJZZWJ0AAAQH4", "Overall": "5.0", "Content": "This camera never ceases to amaze me.  I have owned it about 2 months and I have taken over 1200 pictures under all circumstances.  I carry it with me everywhere. I am a serious amateur photographer who owns 3 digital cameras, and has owned many more.  I take hundreds of pictures a month, and my specialty is journal photography of events and nature shots(lots of indoor, outdoor and macro shots). The image stabilization is incredible (supposedly double stabilization).  I got great shots  from a moving boat of moving skier.  The wide angle (35mm equivalent f 25mm, yes 25mm) is so convenient for indoors and scenic shots.  The flash looks so tiny yet can fill a room even a wide angle.  It can do automatic scene selection almost perfectly, face recognition too.  It goes to macro mode with no setting change.  The 10X optical zoom is smooth and accurate, and with IS I have gotten incredible hand held pictures.  If you take a lots of pictures, get a spare battery (under $10 on line). You will love this camera.  I hope this one lasts A LONG TIME.  Bob in Florida", "Date": "August 24, 2010"}, {"Title": "Great for landscapes and outdoors, Very bad for indoors! (Read)", "Author": "hammodi", "ReviewID": "R6DZPNPF991DG", "Overall": "3.0", "Content": "this camera does it all in outdoors, the quality is great! and the image stabilization works just finePros:1- Good quality outdoors.2- 10x Zoom is outdone.3- I've never seen a better panorama mode.4- Video Quality is great at day time.Cons:1- Very bad at night time2- Little bit cheaply made3- Battery life is way too short.Scores.Performance:  B+Durability:  CQuality:  AVideo Quality: B+Zoom Quality:  BBattery Life:  FHope this helped!( i got this Camera at BesyBuy for $89.99 a year ago, it was an open item but it was newly advertised. so it was like-newThe Point is this camera is overpriced and if you want to buy a camera you should pay a little more for a Cannon camera or a Nikon CoolPix!", "Date": "January 2, 2013"}, {"Title": "poor images, flash overexposes constantly", "Author": "Knightmessenger", "ReviewID": "R1KX50OXST65N", "Overall": "1.0", "Content": "I really wanted a camera that had more advanced features and better quality than a point and shoot but was still around the same size and not too expensive. Well this does have a lot of features but no matter how many endless combinations I tried, they just did not produce a good image in low light or using a flash. Everything was either too bright or too blurry, wrong color tint or over saturated.Basically it just does not look natural. Outdoor photos look decent but nothing special. Even the cheapest point and shoot would look respectable. This does not.I'm very particular about the quality of an image but even a casual observer can tell many of the pictures I've taken are not even close to halfway acceptable. The other problem is the wide angle lens makes everything look so stretched out and distorted. While that is useful in some cases, it shouldn't be set that way on default so that you have to zoom in a little just to get a normal image.I saw another similar sized Panasonic camera at a friends house and tested it out. Even in almost total darkness, the images with the flash looked bright to see everything but still soft enough that it still looked like night.Panasonic Lumix DMC-ZS7 12.1 MP Digital Camera with 12x Optical Image Stabilized Zoom and 3.0-Inch LCD (Black)I would get that or the Panasonic ZS8 (later model) instead.", "Date": "July 13, 2011"}, {"Title": "Great camera.... and then not so great!", "Author": "crazytwins \"crazytwins\"", "ReviewID": "R6AXETPFBB2OP", "Overall": "3.0", "Content": "Originally thought I finally found the camera for me. Easy to use, liked the features and zoom it offered.Initial pictures taken, the quality was excellent. Really liked the quality of low light shots. But then upon taking outdoor shots... wasn't so happy. Colors just weren't coming out right, and tried many different settings. Many of the shots I took had a fake painted look to the colors. I just really hate when the color is off. If it weren't for that, would have loved to have kept this camera!  The images were coming out SO clear and crisp and I was highly impressed.Only other thing I didn't care for was it was pretty slow between shots.I thought the colors came out much better with the $80 less Sony DSC-W350... though that is only 4x zoom but pretty much the rest of the features were similar. Would really recommend that as a less expensive option.", "Date": "September 16, 2010"}, {"Title": "Sony does it again! :-)", "Author": "Sheepfreak \"WoolTales\"", "ReviewID": "RGV4LKRBVO1Q3", "Overall": "5.0", "Content": "I LOVE my Sony camera.  It's the second Sony I own.  I also own two others so I have a comparison.  The Sony H-55 (like my W70) turns on quickly so I can catch that quick shot.  The battery life is phenomenal.  The battery on vacation and taking multiple shots every day will last me about a month.  With normal around-the-house usage...about three months.  It takes a great picture and I really like the picture software that comes with the camera.  It has organized all the pictures on my computer (9 years worth).  The camera is simple to use for the novice yet has manual over-rides when one wants to take a more \"creative\" shot. I HIGHLY recommend this Sony camera.", "Date": "June 30, 2010"}, {"Title": "good and bad", "Author": "W. W. Wager", "ReviewID": "REV4N6P52OBXS", "Overall": "3.0", "Content": "Purchased this camera recently and used it for a weekend.  Good:  Zoom, sharp lens, good stablization, good colors in bright light, movies in good light, auto macro.  Bad: movies in low light, movie audio noise from focus (I think), sweep panorama disappointing quality (would be an awesome feature if better). All in all, worth what you pay for it, but not the \"ideal\" camera.  I debate whether I will keep it --", "Date": "June 22, 2010"}, {"Title": "Good point and shoot", "Author": "David Mac \"Dave Mac\"", "ReviewID": "R3SURRAC9BZKEQ", "Overall": "4.0", "Content": "Thou its a good speedy point and shoot its not the fastest but it does have great picture quality in daytime lighting situations. The night time shots could be better.", "Date": "May 29, 2010"}, {"Title": "Their (Sony's) advertising met my expectations", "Author": "Al Sterling", "ReviewID": "R35Z4J9KI2Z3QJ", "Overall": "5.0", "Content": "I'll apologize for not being more specific, but I'm short on time. This is the second \"clamshell\" model camera by Sony that I've purchased. The other model, almost 3 years ago, also performed quite well. I'm a Vietnam Era Combat Photographer type, and after coming \"home to the World\" back in 1969, starting shooting commercially, part time, while back in college. Going from analog-optical to full digital imaging, I appreciate \"optical zooms\" and decent lenses. Remember that the \"weakest link in the chain\" for photography is always THE LENS! With or without 14 megapixel resolution, this camera is a very good value. I bought this one for my older brother, a Korean War Vet, who also spent his early years in photography. Both he and I were very impressed with the performance of this \"under $200 digital camera.\" And yes... there are other similar cameras out there, but I find myself caught in a \"Sony Cycle\" right now; having had good luck with their line of low cost cameras. BTW, as a hobbyist photo-nut, I'm shooting with a Pentax K10, primarily because it allows me to use my older circa-1970 Pentax M-Series manual lenses.", "Date": "June 26, 2010"}, {"Title": "DSCH55", "Author": "Phillip Hankland", "ReviewID": "RFQR9Z1VZ9CCN", "Overall": "5.0", "Content": "This camera for it's size takes excellent pictures, the zoom is terrific, and the best part is the in camera trimming feature.Good battery life and easy to use menus, another great Sony Product.I have had many Sony digital cameras and all have been excellent.", "Date": "February 12, 2011"}, {"Title": "Love this camera", "Author": "Dr. Elaine O. Chaika \"book, movie, tech lover\"", "ReviewID": "R1D9JPMI66U9OM", "Overall": "5.0", "Content": "I don't know how real photographers would rate this, but for a total picture taking klutz like me it is perfect.  I used to ruin pictures with my unsteady hand and general ineptness.  It's almost impossible for me to get a bad picture with this, however.  The anti-shake really works.  The wide angle is the widest I've seen so far in a point and shoot.  One thing I really love is the panorama feature.  No stitching individual shots.  Just slowly pan.  Wonderful!I bought a cybershot about 18 months ago and, although it was good, it didn't have a wide enough angle to take pictures of laarge buildings while we were visiting London.  And there was no panorama.  We're traveling again, and I didn't take my camera with me, thinking I'd use my iPhone camera alone.  That did not work out, so I Amazoned this camera and have been delighted with it.My only criticism, and it's true of all digital cameras and cellphone cameras: with no separate viewfinder, you can't see what you are taking a picture of in bright light. Getting rid of viewfinders was a bad move.", "Date": "February 1, 2011"}, {"Title": "Great item, highly recommend", "Author": "Rob R.", "ReviewID": "RUZUULJCBWS7P", "Overall": "5.0", "Content": "This is my second Sony digital camera.  The first was a Cyber-shot 7.2MP camera and that was smaller in size, but also is a great camera.  Eventually the Cyber-shot 7.2 broke down and the lens does not properly open when you turn it on. However, it may have got sand in it and it may be that I just need to clean it.This new 10x optical and 14.1MP camera is top of the line. Most every picture came out well, during the first shot, and I was easily able to use the panoramic feature without reading the manual.  It is a bit larger than the 7.2MP camera, and a bit larger than my Nikon Coolpix S570.The battery life went from 50% down to ZERO without notice and that would have negatively impacted me if I had not been traveling with a spare one.  But it did take longer than expected to get down to 50%.  I was happy that the same battery used for their 7.2MP camera also worked in the 14.1MP version.The flash worked well, but often it is not even needed.I did not use most of the features of the camera because the automatic functions met most of my needs.If my camera were stolen or lost, I would definitely buy this same model again, and I would strongly recommend the same camera to my friends, family, and coworkers.  I could not be more happy, especially when compared with my Nikon which I very much dislike, along with the Nikon technical support that took forever to help me resolve why some wedding photos I took did not come out!  (which they barely helped me with, and that does nothing for the photos I missed at a relative's wedding!)I would strongly recommend this SONY camera. I also gladly look forward to buying their next model in a few years from now.R", "Date": "December 13, 2010"}, {"Title": "Very nice camera", "Author": "mjtytrin", "ReviewID": "R2XARU2FXQ12V8", "Overall": "4.0", "Content": "Takes great pictures in bright light.  Almost no delay, crisp colors, great pics.  My only complaints - when you zoom in more than about 5x (the camera goes to 10x), the pictures get a little blurry.  Same thing happens in low light.  There is a pretty significant delay and the pictures often come out a little fuzzy.  Otherwise, I've been really happy with it so far.  It seems pretty comparable to the Canon Powershot A1100 that I switched from.", "Date": "November 11, 2010"}, {"Title": "techqie camera-interesting to try new features", "Author": "hibiscus1", "ReviewID": "R3QHG11VG6D26P", "Overall": "3.0", "Content": "I couldn't wait to get this camera when orders were taken before sold. After 6 months of playing around with it, I'm a glad to have tried some of its latest technology in a compact point&shot.; Comparing this to a Canon 700IS I bought, I originally missed the optical window in Canons' old camera. Secondly, loading the Sony's software PMB on Windows XP is slow and I don't like the analyzer program running while you're loading pictures onto the computer-its just to pain stalking-slow as compared to Canon's old software. I don't know why you just can't load pictures onto the computer and that's it. A full description manual would have been nice to be included with the camera kit. Fine tuning the audio when using the movie mode in zoom would be recommended. I got a lot of distortion audio when using zoom in HD mode. However, in a compact camera with automatic settings like Easy and Intelligent modes, shooting is a breeze. I do like, how you can take 2 same pictures at different exposure settings, smile & face sensitivity recognition, and the slideshow with music while watching on your camera. As, technology changes rapidly every year this camera is interesting to use if you don't mind spending for its amusing gadgets.", "Date": "October 18, 2010"}, {"Title": "Excellent so far", "Author": "Stpgirlie", "ReviewID": "R1IMK265R98PK6", "Overall": "5.0", "Content": "Have had the camera for a few days, and so far, works wonderfully.  Despite what others say, the image is captured quite quickly for most shots.", "Date": "July 15, 2010"}, {"Title": "great", "Author": "mohammad awais", "ReviewID": "R2PQ0SHIUML0XS", "Overall": "5.0", "Content": "because of it,s quality of picture i love itwas a great experience u must buy it and enjoy it", "Date": "December 22, 2013"}, {"Title": "Good little camera that does most things well", "Author": "BillJitsu", "ReviewID": "R2KHIQSK12HLG8", "Overall": "4.0", "Content": "I bought this camera mostly because I wanted get as much 'bang for the buck' in an easily-portable camera as I could without spending too much.  The key phrase here is \"easily-portable\".  I realized going in I was going to be making a few compromises as a result of buying something so small, but I didn't end up making as many as I thought.So far, the things I've liked most about this camera are:1) Easily portable (fits in a jacket/jeans pocket)2) 10x optical zoom is nice and maybe its strongest feature.3) Decent array of settings to appeal to those who want to take more than just 'snapshots'.The only drawbacks, really are the following:1) The battery/memory card door is pretty flimsy and comes open a bit too easily.  Not a huge deal but a minor annoyance.2) The controls are all fairly tiny and a bit flimsy.3) The flash is nothing to write home about and tends to wash things out a bit.4) There's a noticeable delay when in manual focus mode between depressing the shutter and the image being captured.Others have complained about the exposure in low-light settings.  While I agree the camera takes a little bit of work indoors as opposed to outside on a clear day, I was able to get pretty good images after playing around a bit in manual focus mode and resetting the white balance.  However, if you just want a point-and-shoot and don't ever plan to move the camera out of the \"easy\" modes, this could be a concern for you.To be sure, you can definitely find bigger cameras out there that take great pictures and have a lot of bells and whistles.  But if you want something portable with a nice zoom that takes good pictures and gives you some control over them, this is a pretty good option.", "Date": "October 22, 2013"}, {"Title": "like the features", "Author": "Raymond J. Rizzuto \"rjrizzuto\"", "ReviewID": "R3M7DF11FBYA4Z", "Overall": "5.0", "Content": "I bought this for my son to take on a trip to Germany.  He made good use of it.  I like the features, especially panorama mode", "Date": "September 27, 2013"}, {"Title": "great camera", "Author": "Sara Berry", "ReviewID": "R3FW79UZ8MT2ME", "Overall": "5.0", "Content": "great camera. great zoom. easy to use. clear pic. i would recommend this camera for anyone. Sony cameras never disappoint.", "Date": "August 26, 2013"}, {"Title": "Sony DSC-H55", "Author": "SAD", "ReviewID": "R1H4LRFJF3TLTZ", "Overall": "5.0", "Content": "A repeat customer . . .  I dropped this camera out of a locker (5 feet up) on a concrete floor when I was in Costa Rica and it quit working.  I liked it so much I went and bought another one just like it.  Can't ask for a better recommendation than that.", "Date": "July 26, 2013"}, {"Title": "Good", "Author": "Western Bank Wolf Pt", "ReviewID": "R3JR2Z678SWKOC", "Overall": "4.0", "Content": "Takes great pictures and is easy to use.  You must remove the battery to charge it, that is the only drawback I have noticed.", "Date": "July 8, 2013"}, {"Title": "good camera!!", "Author": "farmers and traders bank", "ReviewID": "R394BKEAAUG5SB", "Overall": "5.0", "Content": "my wife loves this camera.the pictures that I have taken with this camera have turned out really well.this camera also has great zoom capibilty.", "Date": "June 22, 2013"}, {"Title": "Great Camera", "Author": "Dennis Littlefield", "ReviewID": "R39RUQ9VJGRNOR", "Overall": "5.0", "Content": "I've purchased three of these.  It's a great combination of 14 MP, 10X lens and size!  The only thing I'd have changed is the flimsy door for the battery and memory card.", "Date": "June 12, 2013"}, {"Title": "Freakin' Badass", "Author": "V. Goode \"Beauty Expert\"", "ReviewID": "R2DWK6QIJEKJIG", "Overall": "5.0", "Content": "I brag to my friends how super awesome my camera is. When I got it, my friend was driving me around San Francisco and there was a dude running as we were driving and I snapped a quick pic, and it was perfectly clear! Despite me in a moving vehicle and the dude running!The Video Quality on the High Definition VIdeo Camera is superb. I used my little handheld Sony to shoot some video for a marketing piece for my company, and people can't believe how professional looking the video was and that it came from tiny camera! Although, warning.... the sound quality on this is terrible and the sound cuts out when you are zooming and filming. But for my project, we used music and a voice narration on the final cut, so all I needed was the beautiful video quality.I mostly use my camera for (concerts and local band) shows and for photos at night and it does great! Most my shots are from a distance at a show and I've gotten amazing facial close ups of lead singers and this camera shot some killer shots of Vince Niel and Gene Simmons that honestly should get printed and framed.Alot of my friends ask what I recommend for an easy point and shoot that will fit in their purse and I ALWAYS recommend Sony Cybershots! I've had 3 of them over the past 10 years. And my first one was when digital cameras first came out, and it was better then most the cameras in my digital photography class that kids trust funds paid triple for.", "Date": "May 9, 2013"}, {"Title": "Cyber-shot", "Author": "countrygirl2012", "ReviewID": "R3RMLNKTUQLR4L", "Overall": "5.0", "Content": "This camera is a great camera for someone who is wanting a quality picture without so much bulk to their camera! I love it and I love taking it on trips with me to capture some great moments. There is a lot of settings that you can adjust to get the perfect lighting shot. I wouldn't recommend this camera to someone who is not very technology smart. It is a more complicated camera so you can not just snap a photo and get the perfect picture; you have to adjust the exposure.", "Date": "April 25, 2013"}, {"Title": "love it", "Author": "Kalvin", "ReviewID": "RI4X9KBDL8MRI", "Overall": "5.0", "Content": "i currently have this product for 3 years and orderring a second one for my uncle who is looking for one like mines", "Date": "March 29, 2013"}, {"Title": "Buena camara", "Author": "Wilfredo D. Maestracci", "ReviewID": "R2LJFD50IJ7S9L", "Overall": "4.0", "Content": "Muy buena camara.. me gusta mucho la calidad de sus fotos, sobre todo las de noche son muy buenas, lo unico malo que puedo decir de ella es que trae un cargador de bateria y hay que sacarle la bateria para cargarla.. en vez de conectar la camara y cargar la bateria automaticamente..", "Date": "February 18, 2013"}, {"Title": "Some good some bad", "Author": "Real person \"Engineer\"", "ReviewID": "RM1HQN86EQQYO", "Overall": "3.0", "Content": "I have owned and used this camera for a few years now and have found some really good things, and really bad things about it.  Most pictures taken without zoom are excellent, especially ones of people and stationary objects.  The camera is slow to focus, so motion is not a strength and neither is its zoom which makes focusing especially difficult.The camera is light and compact to carry, and has a lot of settings to adjust to a wide range of types of pictures.  The down side is that the adjustment knob is way too easy to turn, and almost always is in the Scan mode when you try to grab it out and shoot.  I also had a lot of issues on how close the shoot and on/off buttons are.  I've lost a lot of shots waiting for the camera to come back on.The battery and charger are great.  Easy and quick to charge, and good for a lot of shots.  I would however suggest a second battery as backup.Download and the application to receive are terrible.  If you don't have the specific cable when you are away; you don't download.  The application tells you, and not you telling it what and where you download the photo's...it is not very useful for anything but moving pictures.Overall the camera was OK.  Mine was a good overall camera, but at the end of one beech outing, the lense got sand in it, and has rendered the camera useless.  Would I buy it again?  No.", "Date": "February 16, 2013"}, {"Title": "Worth for money", "Author": "Vikram Balasubramaniyam", "ReviewID": "R1RPQV45I45YTT", "Overall": "4.0", "Content": "No special reasons..bought this for my younger who is in early teens and going to start photography. Good one to start with.", "Date": "January 20, 2013"}, {"Title": "Exelente", "Author": "Jeffry", "ReviewID": "R28WJQZBMCPXZN", "Overall": "5.0", "Content": "El producto esta genial no tengo ninguna queja ningunaLa presentacion es lo mismo que espere y trabaja genial, las fotos quedan muy buenas.", "Date": "December 27, 2012"}, {"Title": "Sony Cyber-shot DSC-H55 14.1MP Digital Camera with 10x Wide Angle...", "Author": "T&L; \"T&L;\"", "ReviewID": "R3BK3LDFREFYBU", "Overall": "4.0", "Content": "Sony Cyber-shot DSC-H55 14.1MP Digital Camera with 10x Wide Angle...was a gift to another person.  there are so many options for getting a sony cyber shot that to the non-technical and not tech literate it is difficult to decide on and buy.  as it was so difficult we did not follow up and get the sony digital video camera as that is really too complicated for us as we are first time buyers;  options are not explained well.  So we are not buying any more sony photography gifts.", "Date": "December 5, 2012"}, {"Title": "Great camera !! True colors", "Author": "Hari Katakota \"Harry\"", "ReviewID": "R8ASD1WWSRIZ4", "Overall": "5.0", "Content": "Wonderful camera. Best camera ever I bought..Very good outdoor pictures. True colors. Just set it to auto mode and start enjoying pics..", "Date": "November 26, 2012"}, {"Title": "Exelente camara", "Author": "Dhanna", "ReviewID": "RXXXXHGSL34RI", "Overall": "5.0", "Content": "Ya tengo un año con la camara y a sido exelente, toma muy buenas fotos y es una camara bastante completa. La recomiendo las fotos se ven casi profesionales.", "Date": "November 16, 2012"}, {"Title": "Great Camera at low low cost.", "Author": "Gopalakrishna M. Elluru", "ReviewID": "R3GEC470SIBUGT", "Overall": "4.0", "Content": "This is a great camera with a lot of new features at a low low cost.  It is said to be used, but looks like factory rejects because of minor scratches on the LCD viewing screen.  Everything looks like new except for a minor scratch on the LCD viewing screen.", "Date": "November 7, 2012"}, {"Title": "La mejor camara", "Author": "Liu", "ReviewID": "R1GWL20MORFZAE", "Overall": "5.0", "Content": "De las que he tenido en esta Marca, esta me ha resultado muy buena, es pequeña, discreta, sus funciones son muy prácticas, fácil de utilizar y la batería genial.", "Date": "November 22, 2011"}, {"Title": "Very Nice camera", "Author": "Moses", "ReviewID": "R3E7LHCL3XT9S2", "Overall": "5.0", "Content": "I loved this camera and still loving it.. it takes awesome photos and the zoom is very nice...I personally like it very much and got one for my dad as well", "Date": "November 4, 2011"}, {"Title": "super picture quality", "Author": "Saurabh", "ReviewID": "R3N86AJ5QTSIJK", "Overall": "5.0", "Content": "Very good camera. I love to have it. Outstanding light capturing mechanism. Very handy and even a small kid can capture very good pics.", "Date": "October 4, 2011"}, {"Title": "Step down from the H20 model", "Author": "M. Stone", "ReviewID": "R3HPJTDJ9S9MXO", "Overall": "3.0", "Content": "I'm going to stick with my older model of Sony DSC-H20. The photo quality is better.  After using the H55 model, I can see that like most Sony cameras, it does fine taking photos in daylight and bright light or outdoor settings.However, I've taken this camera to several concerts, which always poses a challenge to Sony cameras - with the H55, under low light conditions, there is more noise and with some of my concert photos, there is a strange purple haze that makes everything and everybody look purple.  I noticed this while taking a photo at a concert, I could see even on the LCD screen that the people on the other side of the arena from us were looking like a purple blob in the background.  It looked the same when I opened the photo on my computer.  My Sony DSC-H20 never did anything like this!There is also generally just more noise and graininess with the H55 in low light.  It also still has the same flaw as the H20 model, which is that it has a hard time capturing any movement, whether it's a moving cat, moving child, moving rock singer, etc.  My little Canon SD1200 camera can capture moving things better than either of these Sonys!When browsing the sample images posted at Amazon, many people here post a lot of landscape pictures, and they are so pretty.  Any digital camera can capture landscape, the real test is whether it can capture people and pets who are not perfectly still all the time.  Sony cameras always seem to fail in this area.On the bright side, it does make a good video camera, the sound quality on both models is excellent.  One good thing about the Sony digital cameras is their video modes DO have great sound quality, probably the best for filming things like concerts. I've seen YT videos from concerts filmed with Canon and Panasonoc models, and the sound is not as good - Panasonics sound more muted, and with many Canons, the reverb and static is awful!BUT BEWARE: On the H55 model, if using the zoom lens while filming, the sound will go down (not totally mute, but just lower) while zooming in and out.  This is very noticeable when filming at a concert for example.  I filmed a really good song at the Bon Jovi show while using the H55 for the first time & didn't realize until after I got home & saw all my videos what the sound was doing.  It's pretty noticeable, and really annoying.  Luckily for me, I had used my old H20 for most of my video clips, so all was well.So it looks like my search for a good all around P&S; with a bigger zoom lens will have to continue.  Meanwhile I'll still use my Canon SD1200 for everyday snapshots, and my Sony H20 for video clips.", "Date": "September 21, 2011"}, {"Title": "Good camera, but still is not best for this price", "Author": "Otabek", "ReviewID": "R1QLO2TRFUS2GJ", "Overall": "4.0", "Content": "A month ago I got this camera. It is good constructed, handy and easy to use. It comes with ion battery, it's available to make 250 shots+20 min HD video. I go to trips very often, therefore I bought additional battery. The best thing there is panoramic mode. But it is very noisy while shooting video, and it has no DIGITAL ZOOM. And battery clips which attached under the camera is REALLY WEAK, so be careful, can be broken easily. NIGHT MODE is awful, I am not fun of night modes, but it could be better. I had canon sx110 and sx130 before. sx130 has better HD video noise avoid and images are better sometimes, but it is has very slow shooting. So go for it, if you need compact and handy digital camera with panoramic mode. Overall I recommend it!!!", "Date": "September 12, 2011"}, {"Title": "Good Work", "Author": "Richard Moya \"Gichad\"", "ReviewID": "R1YMNCIO4UE5VN", "Overall": "5.0", "Content": "Good job, excellent working group, satisfied with the purchase and delivery time ... not hesitate to recommend and return to work with PCs.", "Date": "June 28, 2011"}, {"Title": "Amazing", "Author": "hpis2cool", "ReviewID": "R238IM6IIY9X4Z", "Overall": "5.0", "Content": "Just completely satisfied with this product! The Intelligent Auto is amazing and very convenient! You get quite a few manual options (for a non-professional camera) and the zoom is the BEST I've ever seen in any point-and-shoot camera! The casing isn't the best (plastic and I get a little scared the battery lid will break sometimes but this is because you get what you pay for. The camera is VERY CHEAP for what it does. I'm sure it'll work just fine for you if you take care of it. Highly recommended product!", "Date": "May 16, 2011"}, {"Title": "Wonderful camera - till it broke", "Author": "B. Morris", "ReviewID": "R21A8OQPGRXTDP", "Overall": "3.0", "Content": "This little camera takes incredible shots, on a par with my (older) Digital SLR. The zoom works great and has sold me on the need for a longer zoom even in a pocket camera, and the stabilization worked wonders with my high-action family.In fact there was only one problem with the camera at all, albeit a very impactful one: The dial to switch photo modes broke and would just spin and spin without selecting anything. This can be quite annoying when you can't get the thing off of \"video\" mode, or it's stuck in \"macro\" or \"low light\" and you want to get a shot of your kids playing in the pool.The camera was so good, ironically, that my wife and I used it despite the problem for over a month. Work-around - turn the camera off, set the dial, then turn it back on again and 'sometimes' it would set to the right mode.Recommendation: don't get this camera, but if a fix or a new model that includes a fix, ever comes along, I'll join you in buying one then...", "Date": "May 6, 2011"}, {"Title": "Great camera with the right size", "Author": "X. Andrade", "ReviewID": "RX65CPQ0VJVPV", "Overall": "5.0", "Content": "There's not much I can add to what has been said already, I absolutely love this camera, specially its size, it's small and compact enough that makes it easy to take it anywhere you want in your jeans' pocket and at the same time tough enough that it won't break or get damage if you bump it by accident while in your pocket.The picture resolution is I would say 4 and half out of 5, I'm still a fan of 35mm film I think nothing can't beat that however this camera gets closer to that. The battery lasts a long time, I actually used it for a couple of hours a few weeks ago and today I took it out of my drawer and the camera still had power to keep working and that's what made me write this quick review.Over all I'd give it a 5 out of 5, the only problem I found is the stable shot feature, sometimes doesn't work well especially if you try to take pictures while in a car.", "Date": "April 29, 2011"}, {"Title": "I really wanted to like this camera", "Author": "A. Campbell", "ReviewID": "R39CZ8VCMLUEFY", "Overall": "2.0", "Content": "Sadly I am back in the camera market as this camera was stolen with some incredibly precious family videos that for some reason I could not get to transfer to my pictures software (don't think that was a camera issue). I came back here to post a review so that others will think again before they purchase this camera. I had VERY high expectations but the proof is in the pictures and even on the \"EASY\" mode, they just did not meet my expectations. I'm not a professional photographer so I can't give you technical details but I am a picture buff and have enjoyed some very good cameras over the years. The lighting sensor seemed off (either overexposure with the flash or not enough light and was dark)and what bugged me the most was the distortion of the subject. It literally would change the shape of people's heads/bodies. Every now and then I would get a good picture but I just could not count on consistently getting good pictures. Trying to take pictures that involved motion almost never worked out. I did have the best luck with outdoor pictures with natural lighting. Another issue was the location of the flash. You had to constantly make sure your finger did not block it. I do have some good pictures but I won't be purchasing this camera again as I gave it a year of use and I was overall very disappointed.", "Date": "April 29, 2011"}, {"Title": "Point and shoot with a very nice feature set", "Author": "rayneu \"photoray\"", "ReviewID": "RJLB7NNPHA8DV", "Overall": "4.0", "Content": "It's a decent camera - full disclosure: I am very picky and have sent back several other point and shoot cameras before keeping this one.  The image quality on the lcd is very good; the actual image on the computer is less stellar but for around $150, I can't really complain.  I am used to DSLR cameras and nothing compares to the image quality of a bigger sensor with better lenses.  The Sony H55 takes very good snapshots and the exposures are accurate.  I take very few flash photos and don't like to take images in dark environments since the flash usually destroys the scene so I can't comment on how the flash works.  I enjoy using the panorama stitching mode for an extreme wide angle look - it has very quick rendering and is simple to use.  Sony phone support told me that \"some SD cards cannot be used with this camera\" when I called and reported an error reading two brand new 8 gb Sandisk SD cards I bought specifically for it.  Had to back down to a 4gb card... I guess they really want you to use their proprietary memory sticks... The HD video is clean although the multi-cable usb cord interface is way too bulky to pack with the camera unless you get a huge bag; the sound is what can be expected with a small microphone on the side of the camera.  I use this camera for snapshots and ebay seller images.  Overall, Sony has done a good job with this camera and I recommend it to anyone who needs a simple camera for outdoor shots and indoor no flash images.", "Date": "April 22, 2011"}, {"Title": "Love the camera but-----", "Author": "lynn21", "ReviewID": "R1I5NA5MVKT8P5", "Overall": "5.0", "Content": "I really love the ease of this camera.  I just traveled to Spain, Prague, Austria and Germany. Now I would like to download my pictures to my laptop.  How do I do this?  I only have the yellow, red, white, cable that came when I ordered this from Amazon.  Help!!! What do I need to buy in order to hook up this camera to my laptop???", "Date": "April 8, 2011"}, {"Title": "Excellent choice", "Author": "Daniela", "ReviewID": "R29W88A13DJY2F", "Overall": "5.0", "Content": "I'm glad that I bought this camera because it takes great pictures and the relation between quality and price is really good.", "Date": "March 27, 2011"}, {"Title": "Excellent", "Author": "kas", "ReviewID": "R9WCHPIOXBODV", "Overall": "5.0", "Content": "This is one of the best product I have ever purchased. Also I was surprised after seeing that it is a product of Japan.", "Date": "March 24, 2011"}, {"Title": "Love the camera, very little to complain about", "Author": "MGLC", "ReviewID": "R39Z8HHUWC1V2T", "Overall": "4.0", "Content": "This camera is pretty awesome.The quality of pictures is Superior to anything in this price range.We did however have to send it back because the shutter would not open and shut all the way without help. This bothered me and I sent it back.Other than that, camera is awesome!", "Date": "March 14, 2011"}, {"Title": "Sony Cyber-shot DSC-H55 14.1MP", "Author": "Pawan \"Bh pawankishore Reddy\"", "ReviewID": "RK1P038G348XE", "Overall": "5.0", "Content": "I am fond of taking pictures. Not a big time photographer but when ever go for an outing then its always obvious that i will be incharge of camera. I bought this camera for a good deal and its the best one that i got for such a price. Its look is awesome. The pictures that it takes is so clear and perfect. I just love this camera. Nothing that i can complain about this camera.", "Date": "February 17, 2011"}, {"Title": "Excellent camera", "Author": "Marcos P. da COSTA", "ReviewID": "R1WXY3QU03WR6S", "Overall": "5.0", "Content": "This camera has an excellent Optical 10X zoom, images are crisp, clear and the colors are brilliant. Video looks great when played in my laptop. Nice panoramic photos. I recommed this camera to anyone who is looking for shooting great quality indoor/outdoor pictures.", "Date": "February 15, 2011"}, {"Title": "Amazing picture quality...impressed with very first few pictures", "Author": "Rajendra Prasad", "ReviewID": "R6O3SRZG7B2IE", "Overall": "4.0", "Content": "I did a lot of research for buying a decent camera and decided to buy H55. It had great reviews and it has lived up to its expectations. I was a little skeptical using it the first time but was pleasantly surprised to see such a fine quality of pictures. I read about one issue in other reviews and I agree with it...the pictures doesn't look as good on the computer as they are on the camera LCD screen. I don't understand why...may be there is a mismatch between the pixels of camera LCD and computer LCD. I guess I'll need to try reducing the pixels on camera and then compare the quality..overall I'm satisfied by this camera...worth my money...", "Date": "February 11, 2011"}, {"Title": "awesome camera", "Author": "Joannie", "ReviewID": "R2GZ63JOZ0T3N9", "Overall": "5.0", "Content": "This is a great camera, the sharpness of the pictures is unbelievable, and the zoom is great. It takes great video's and it adjusts the camera to the picture your taking. This is a must have!!", "Date": "December 29, 2010"}, {"Title": "Very Poor Performance for still photos", "Author": "seeker7 \"seeker7\"", "ReviewID": "R25X5UR58XXH01", "Overall": "2.0", "Content": "This review is filled with superlatives, but it is for a reason.  This is probably the most disappointing electronics/technology purchase I have ever made, and that includes my experience with Windows Vista!  This camera is not much better than the camera in my Blackberry.  No joke.  This was purchased to replace a Sony DSC W35.  The old technology was head and shoulders above this camers.  This camera has lots of features, some of them are very nice, but the picture quality is abyssmal.  The panorama function is nice, but the results are very grainy and useless for enlargement or printing.  Low light performance is SHOCKINGLY poor.  The noise in low light is terrible.  There is a focus issue as well, particularly in low light.  The lens is excellent, but the sensor stinks.  Program modes are not reliable.  Color saturation is unpredicable.  Flash is near useless.  LCD is useless in outside light.  There is no viewfinder.  This camera is incredibly underwhelming.  If you want to see a comparison of the quality of this camera and the old 7 MP DSC W35, go to my smugmug account at [...].  Look at the album called Lonely Ride.  The last 3/4 of the pictures in that album were taken with this camera.  You will see very poor quality, and even these are the best of the best this camera can take.  Over 50% of the photos on that trip  were discarded because of poor quality.  Next, look at any album entitled El Paseo Mexicano (there are 5 or 6 of them).  Compare the quality.  El Paseo Mexicano was taken with the cheap, 7 mp camera.  It is light years better than this piece of junk.  Do not buy a DSC H55 unless you can live with cell phone camera quality pictures.  Do not be mislead by the 14 MP label.  This camera is junk quality.  If you are budget constrained, you will do much better with a DSC W150, for the same money.  You won't have panorame, you wont have as good of a lens, but you will get focused, sharp, predictable pictures.  With this piece of junk, getting a good photo is only a 10% probability.  With the DSC W150, the odds increase to about 80% or more.  Sony should be ashamed to release a product that this inferior.  I really wonder how they can sell this thing with a clean conscience.", "Date": "May 20, 2010"}, {"Title": "Shoddy quality", "Author": "M. D Wilson", "ReviewID": "R1OZ3K3V9JHBL5", "Overall": "1.0", "Content": "In the two years I have owned this camera, I have had to send it into Sony service twice. Once was for the zoom button that broke due to some internal spring breaking, and another time was for when the lens stopped opening.Another problem with this camera is that the wheel to select your camera mode is placed right next to shooting-button and doesn't lock into a mode very snugly. So I would frequently unintentionally change shooting modes while taking pictures.The battery cover does not snap shut securely, and has a habit of swinging open at bad times.The camera takes good pictures, and the zoom when it works, works well. But I have never had so many problems with a Camera. This was my first, and likely last, Sony Camera.", "Date": "December 1, 2011"}, {"Title": "Nifty features, major malfunctions", "Author": "jtvt \"Justin\"", "ReviewID": "R3VPJOTG4SAE53", "Overall": "2.0", "Content": "This would have been a 4 star item if it lasted longer than 2 weeks. First the good - Big zoom, big MP number, and fits in the side pocket of Carhartts pants, covered what I was looking for. Included in the deal at no extra charge I got the very cool sweep Panorama feature and honest HD video!This panorama mode really is groundbreaking (at least up here since I've yet to see it anywhere else) and if patent law allows I'd be surprised if it doesn't become industry standard. Unfortunately it captures the full (3 image?) pan frame in half the memory space of one regular photo, so pan photos were a little grainy when viewed under zoom.Video quality was superb, best ever on a pocket camera for this reviewer. Even in low light concert situations it surpassed expectations. Speaking of concerts though, zooming while recording did cause very noticeable background noise and an accompanying drop in audio quality.Picture quality was standard for a mid-range point and shoot. Not amazingly sharp and a slight difficulty capturing off the cuff motion shots, but definitely more than acceptable for most uses.And the bad - Two weeks into ownership I went to turn it on. Still on the original battery charge, no drops, dust or water, no likely cause for any damage whatsoever. Screen says, \"Turn power off and turn on again\", or something like. I do, many times, to the same result. Tried charging the battery, no difference. Took it back to the big W and got the impression from the clerk this wasn't the first return they had seen.Big, big red flag there. The fact that it worked for two weeks before just conking out makes me wonder what's to stop any of these from dying for no reason 3 months in, or 13 months in, out of warranty? Second Sony I've had but I took my money and ran to a different brand.", "Date": "December 9, 2010"}, {"Title": "Very poor", "Author": "MatisseFabric", "ReviewID": "RP3EZLQFGI8J8", "Overall": "1.0", "Content": "I've had cameras from four manufacturers - this is easily the worst.Time for another camera, even though this one is very new.It's a long list of problems. Here we go:1) Start-up and shut-down times are very slow. If you shut down thecamera, and then change your mind, it will take 5 seconds or more.The switch between ON and OFF takes long enough so that it's hardto keep straight whether you are successfully turning off (on)the camera or not.2) Low light is disastrously bad in this camera. Don't do it. Very brightdaylight or don't take the shot.3) The zoom is often extremely slow - it just can't decide that itshould go for it, after you have asked for a zoom. Many secondswasted, waiting for the software to get a clue.4) Focus is incredibly slow, hunting back and forth. Often it doesn'tfind focus in the end. Lots of blurry photos.5) The mode dial gets spun around very easily. You must constantlycheck to make sure that you're in the mode you want to be in.6) Flash washes out everything. Badly mis-calibrated.On the plus side, this camera has a very nice lens. But it is totallywiped out by the terrible digital / software side of the camera.Don't buy it.", "Date": "November 14, 2011"}, {"Title": "Very sluggish and bad in low light", "Author": "Saurabh Upadhyay", "ReviewID": "R3PCSOTCKELK9D", "Overall": "2.0", "Content": "Seems like a good camera at first, but after some use I started to find its weaknesses. So called smart zoom is annoyingly slow. Shutter speed is also very slow. Takes good quality pictures in the daylight or well lit area, but completely useless in the night. If you don't use flash in the dark its grainy and if you use flash its overly bright on face. Overall I would say bad camera for its class and price.", "Date": "October 23, 2011"}, {"Title": "Very poor photo quality", "Author": "C. W. Price", "ReviewID": "R2PAZRYAO5ZSAM", "Overall": "2.0", "Content": "I'm a point-and-shoot traveller who wanted a small camera for travels to Asia. My old Nikon Coolpix 7600 had some sticky buttons, so I thought I'd upgrade to this Sony. The photo quality from this camera is so poor compared side by side to my Nikon; even from photos printed 6 years ago. The only thing I like on this camera is the panorama mode. I don't know enough about cameras to explain why this Sony takes such horrible photos on Auto or Easy mode, but if you're a novice shooter like me, don't get this camera. I'll be buying another (and cheaper) coolpix next time.", "Date": "July 2, 2011"}, {"Title": "My 3rd Cybershot", "Author": "Arun Singh", "ReviewID": "R1L1KS52M5BFYD", "Overall": "4.0", "Content": "I love the zoom and ability to take Panoramic pictures. The two big reasons why I purchased this camera and I am very happy with that. I used this camera for my recent Australia trip. I found small fraction of the pictures to be out of focus and the time to record the picture to be a wee bit long. The longer time to record could be due to the bigger image size. I am not too sure yet about some pictures not being very sharp (5 out of 80). I have to look into that a little more and I will update later on that issue. I like the compactness of the camera. There is a photo transfer application which comes on the camera as an exe file. Before one is able to transfer the image to their pc they have to run this application. In my opinion that application added extra steps and was not much use to me.Sony Cyber-shot DSC-H55 14.1MP Digital Camera with 10x Wide Angle Optical Zoom with SteadyShot Image Stabilization and 3.0 inch LCD (Black)", "Date": "February 22, 2011"}, {"Title": "Stunning pictures, excellent videos", "Author": "Justin R. Hodge", "ReviewID": "R38X39FWYJEH23", "Overall": "5.0", "Content": "When I started looking for a new camera I one with a powerful zoom and sharp images, but I also wanted to find one that takes great videos as well (I was tired of having to carry around both a camera and camcorder).  With this in mind, there were a few minor features, like the ability to zoom while taking a video, that I looked for in each camera I considered.  I finally decided to buy this model (about 7 months ago), and I have to say it is the best camera I have ever owned.  The pictures almost always come out crystal clear, and the videos are smooth and with excellent audio quality.  It met and surpassed all my expectations.  The Intelligent Audo mode is great for everyday use, and the image stabilization works very well.  One feature I particularly like is that when you take a picture in some low-light settings the camera snaps two pictures, each sith different settings, and lets you choose which one is the best.  I also like the panorama mode.  I have not used the Program and Manual modes, but they appear to offer plenty of customization options to more professional photographers.  I only have two minor complaints about the camera:1.  The microphone is on the top of the camera, so it's easy to accidentally cover it with your finger when shooting a video.2.  When using the panorama mode, if your picture does not use up the entire panorama view the rest of it is left gray.  I'm not sure why the camera doesn't automatically trim off the extra space.Overall, I would definitely recommend this product to any potential buyer, whether they're a simple point-and-shoot user or a more experienced user who wants plenty of flexibility to tweak a variety of settings.", "Date": "February 19, 2011"}, {"Title": "LOVE this camera!", "Author": "xnana21x", "ReviewID": "R1Z038F3PA6PB5", "Overall": "5.0", "Content": "I've owned 2 Sony Camera's before this one. I love the picture quality of sony, but always had problems with a little bit of blur. I have 2 young kids and they are always running, so to try and get a picture, there would always be blur. I decided to try out this camera and LOVE IT. The I Auto is fabulous! I haven't had any blurring photos. the pictures are AMAZING and colors are AMAZING. i Love it. I don't have anything negative to say. the price and the quality are perfect. I highly recommend this camera!", "Date": "February 17, 2011"}, {"Title": "Upset with dial on top of camera - Easily Broken!!!", "Author": "kmurph", "ReviewID": "R1WYTJYGVVNRJM", "Overall": "3.0", "Content": "This was a great little camera.  However, the dial on the top of the camera no longer works.  Ultimately making the camera inoperable.  Very disappointed as we did love the camera.", "Date": "February 10, 2011"}, {"Title": "Great camera", "Author": "Catherine Jones", "ReviewID": "R4SVKZNT49Y2Q", "Overall": "5.0", "Content": "I'm definitely not a photographer, but I think this is a really good camera. I did a lot of research on point and shoot cameras and this one was the best for the money.", "Date": "February 10, 2011"}, {"Title": "Husband loves his new camera!", "Author": "Bargain shopper", "ReviewID": "R2UKLLR6K6WLM2", "Overall": "5.0", "Content": "Best gift Santa tossed in my hubby's stocking! Pro photographer nephew recommended this as the best camera for the money and he was right. Great pic quality, easy to use in a variety of shots and inexpensive compared to others with this many pixels.", "Date": "February 6, 2011"}, {"Title": "H55 Digital Camera", "Author": "mohan vashisth", "ReviewID": "R1ZOYJ9KVNF8E3", "Overall": "5.0", "Content": "This is my 2nd H55 Camera.I love this little & light piece.I rate myself a little more than a beginner. Previously I have CanonA620.That Camera is also good but that needs AA bateries & I hate that.I like H55 being a chargble batery.Technical photo features of this camera is worth of its price being a 10X zoom, panorama & other features.I have yet to completely explore it but my experiance by now is good.", "Date": "February 3, 2011"}, {"Title": "Great Camera", "Author": "DaDDEEoOH", "ReviewID": "R2S71TUM82VQ4V", "Overall": "5.0", "Content": "Excellent price for such a great all around camera, if your not looking into a SLR this is a super camera, everything is adjustable in one setting for a more advanced user or just shoot away and not worry about anything.  Video recording is top notch great quality, suggest at least a 8gb memory stick duo HGpro which will get you about 110 minutes of HD video", "Date": "January 28, 2011"}, {"Title": "Heat camera", "Author": "Sheri L. Cranmer", "ReviewID": "R1F51LIEWTO0MF", "Overall": "5.0", "Content": "This was a Christmas present for my 24 year old son whe is in the photo industry. He loves it. Good enough for me!", "Date": "January 8, 2011"}, {"Title": "Solid build and features for the price", "Author": "Ajax", "ReviewID": "RDGA42O1G8K4O", "Overall": "4.0", "Content": "I think this is a good choice for someone who needs a simple, hi-res point and shoot.  I've been getting good results in our dimply lit house with the intelligent auto settings.Remember to order a memory card and a case!", "Date": "November 18, 2010"}, {"Title": "Amazing zoom", "Author": "Axolotl82", "ReviewID": "R13MEFAMC2T0NX", "Overall": "5.0", "Content": "A terrific camera.  It is very compact but has a fabulous optical zoom that captures fine detail in low light from substantial distances.  Settings are as simple or as detailed as the user wants.  Would prefer AA batteries to lithium, but these recharge easily and stay charged for a long time.  This is the first camera I have bought that lacks a direct viewfinder, but the screen is visible even in bright sunlight.  Overall, I couldn't be happier.", "Date": "November 2, 2010"}, {"Title": "Great camera.", "Author": "Chanson S. Sim", "ReviewID": "R1H8NIU6GWBBCT", "Overall": "4.0", "Content": "First of all for $225 and free shipping this camera awesome for the price. I'm thinking that i should of went with a lower megapixel camera, to me if it makes any sense to anyone that it might be to detailed that the picture looks fake, might be a good thing. In a low lit room its not the greatest even with the flash, sometimes i find myself covering the flash with my fingers because of the placement of the flash. Great features. The only draw back is that the camera does not come with Carl Zeiss lenses.", "Date": "August 12, 2010"}, {"Title": "great little camera", "Author": "sir", "ReviewID": "R2AAJJBJJEG83G", "Overall": "4.0", "Content": "pocket size with lots of features or easy mode if you don't want to mess with everything manually. i love it. even better with SD compatibility.", "Date": "July 21, 2010"}, {"Title": "Wonderful camera for the everyday user.", "Author": "Matthew A. Kramer \"the reviewer\"", "ReviewID": "RUTSWMYEKLM3U", "Overall": "5.0", "Content": "Sony had come along ways with their camera, I purchased this camera just before going to my daughters graduation. I also upgraded from my older 6mp Sony P&S; camera. I'm not an expert photographer, but this camera suites 99% of my needs. the movies in HD are just great, as wells as the telephoto lens. I would recomend this camera because it just about has everything and still fits in your shirt pocket, which means you are like to have it when you want it most. Unlike a SLR", "Date": "May 25, 2010"}, {"Title": "Super Simple", "Author": "Mark Twain \"MT\"", "ReviewID": "R2OOOJA7CMGX20", "Overall": "5.0", "Content": "This is one of the few point-and-shoot camera's I've seen that holds true to its name. Never had a camera that took better pictures, in as many different light conditions as this one.", "Date": "January 22, 2011"}, {"Title": "Good features, but still slow", "Author": "SL", "ReviewID": "R2OHXDG76D4W9K", "Overall": "4.0", "Content": "I've just recently bought this camera before a 3-week vacation trip, and my impressions are based on that trip. Camera has a number of good features, namely an x10 zoom, 3\" LCD screen, panoramic picture taking, and what I liked the most - a very impressive image stabilization system. Battery life is decent - 2 or 3 days of rather intensive picture taking.Negatives include a somewhat bigger package (not sure anything smaller can have an x10 zoom), and a very slow interface. Operating zoom is a challenge, as it is obviously micro-controller operated, and sometimes is busy with something else, when you are trying to frame the picture. Turning the camera off is also excruciatingly slow.", "Date": "December 13, 2010"}, {"Title": "GReat camera", "Author": "fiddler \"imbuzz\"", "ReviewID": "R2R8ONFA2IJ5MN", "Overall": "5.0", "Content": "The panorama feature is what makes this truly worth having.  14.1 MP not bad either.I am a wide angle fan which is why, for a point and shoot, I have a Leica 3 Lux 4 with a 24mm (35mm equivalent) lens rather that the 35mm equivalent in most other point and shoots. Then comes along this very nice 14 MP camera that does so many things simply and well and does panoramas too. I am amazed at how easy it is to get a panorama of scenery. landscapes, building interiors and exteriors. The resolution is not huge on panorama but I suspect that there will be others following suit, even into the DSLR field. The latter is of course a reason to wait but then everyone needs a simple portable pocket point and shoot and this is now mine.", "Date": "October 4, 2010"}, {"Title": "AWESOME", "Author": "wxmr2212", "ReviewID": "R3WWXF8BMIMHP", "Overall": "5.0", "Content": "Great Product. Best purchase ever. It's exactly what I was looking for. I totally recommend this item.  HIGH QUALITY AND GOOD PRICE!!!", "Date": "February 26, 2013"}, {"Title": "Does It All", "Author": "Captain Brock \"Adventurer\"", "ReviewID": "R3QG09S6JOB2EM", "Overall": "5.0", "Content": "Highly recommended, a distinct notch above typical point and shoot cameras. Insane good battery life and file space with 8G card. I really only use auto-mode and it works very well. This model is proven and still up to date two years after purchase. Very impressive hi-def video with surprising audio through the pin-hole mic. We taped Adelle at 140 meters in the dark and the results were amazing. I am an experienced shooter but not a serious photography buff; for me this Sony does everything I could ask for.Minor caveats: Zoom during videos may corrupt audio. No intermediate resolution between VGA and 5M. Video is MP4 only.", "Date": "December 31, 2012"}, {"Title": "good camera in this price range", "Author": "Vaibhav Kumar", "ReviewID": "RLALM23LHLKAK", "Overall": "3.0", "Content": "a good camera in this price range .. day pics r great, zoom is good, low light pics not that good...", "Date": "December 19, 2012"}, {"Title": "Really bad camera", "Author": "Sujay", "ReviewID": "RTE62B2D2HZG9", "Overall": "1.0", "Content": "Only good time I spent with this camera was first 3 months. After that faced many issues with the hardware. First ccd and then motherboard went kaaboom. now service center is asking me money more than the cost of this camera..", "Date": "June 20, 2012"}, {"Title": "Aweful Indoors", "Author": "Margi Piotrowski", "ReviewID": "R2NSIADUSCD1VP", "Overall": "1.0", "Content": "We bought this Sony a few weeks before Christmas and discovered that the indoor shots are almost always dark and blurry.  Ruined our holiday and son's 10th birthday party pictures.  Outdoor shots are decent, especially if the subject is perfectly still, color is good- you will always need to use flash indoors.  No good for sports shots.  In camera guide is not much help in the moment, so you are left to read the 60+ page instructions.  Spend your money elsewhere.", "Date": "January 29, 2012"}, {"Title": "camera review", "Author": "dku", "ReviewID": "R2TEAM5VJIBA1K", "Overall": "5.0", "Content": "Loves this camera. It is all it says and more. Very easy to use!! The picture is quality is amazing.", "Date": "December 18, 2011"}, {"Title": "Great camera for price", "Author": "Paul", "ReviewID": "RRAAIYMT6RC3T", "Overall": "4.0", "Content": "This camera was great for my trip to india. The zoom is really good the video quality was good and you can zoom while recording. the paneramic view feature was really useful at some of the locations i was visiting. The images taken by the camera are really clear most of the time.i had the sony w55 before this one its basically a couple of years older but over all same model different body. the only problem i had with that one was the the botton to take pictures eventually popped out so the camera was useless this camera has the same botton and im kind of affrid of that but after heavy use in india nothing happened so i guess im in the clear for now.Pros-14.1MP really clear pictures also very large image files.-HD video (720) with other video setting for less quality.-fairly thin-10x zoom-supports both SD cards and memory stick pro due.-the auto setting is very usefulCons-the botton to take picture feels cheap and it has broken before on the older model.-there are no picture filters available like in the last one model.-takes a bit to warm up-takes a bit to take a picture (not really for sports shooting or fast shots)-motion blurs easily-some pitures come out grainy with low lighting-battery dies really quickly with constent use", "Date": "March 9, 2011"}, {"Title": "Great and incredible Digital Camera from Sony.", "Author": "Ivan Gonzalez Landaeta \"ivigontu\"", "ReviewID": "R109QO6X2U1V5G", "Overall": "5.0", "Content": "A little expensive and heavier than W380 with same 14 MP. Its 3\" LCD is a plus. So is the panoramic picture taking routine that takes the drudgery out of stitching individual panels. The SDHC memory card slot is more popular than the memory stick duo which often requires an adaptor to read.The DSC-H55s 10x wide (25mm equivalent) lens takes better shots from greater distances and wider landscapes in a compact body. Take breathtaking panoramic shots.I love this camera!!!!!!!", "Date": "January 17, 2011"}, {"Title": "Only complaint is the lack of color options", "Author": "Katelyn M. Tasky", "ReviewID": "R2F4Z7122YNHNG", "Overall": "4.0", "Content": "I've searched and rifled through the Handbook for this camera and there doesn't appear to be a color menu. The older Sony Cybershot I had had a color menu in the Program function that enabled you to choose Black and White, Sepia, Vivid, and Natural color modes, but this model doesn't appear to have that.Besides that, it's everything I wanted in a new camera. The zoom is great, especially for the price, and the intelligent auto settings, for the most part, work great. There are a few things that have changed in the layout of the menus than my older model, but for the most part it was easy to pick up and use.Best part is that Sony cameras all take the same battery, so for my Europe trip last week I took my old and new batteries, which I switched between, allowing me to charge one while I used the other.All in all, a good buy, just wish they had the color setting they had before.", "Date": "January 13, 2011"}, {"Title": "Impressive Camera", "Author": "Kenneth G. Nielsen \"Kenneth\"", "ReviewID": "RXW64MOA74Z65", "Overall": "5.0", "Content": "This camera provides the most important thing to good pictures: A great lens! Past that, have fun with some amazing technology including blink detection, face detection, panorama shooting and stuff of little interest to a serious photographer, but a whole lot of fun for those who simply want to take awesome pictures. I'm more a serious photographer so I wanted some control over settings which this camera provides. You can set, for instance, no flash by default, and have that setting retained when you use the camera again later. The only thing I will be careful not to push on this camera is the ISO speed. Anything over 80 (lowest) ISO speed begins to seriously degrade image quality. To counter that drawback, the lens is fast 2.0 so can give good shots in low light situations.I highly recommend this camera for a person who wants a small point and shoot with excellent 'big camera' capabilities.", "Date": "January 8, 2011"}, {"Title": "Excellent product", "Author": "Mora", "ReviewID": "RYIXDUEEX3XK5", "Overall": "5.0", "Content": "I'm very happy with this camera, it has the option of intelligent auto adjustment, which is very usefull to take pictures quickly and for people over 40 like me, who can't see without lenses is suitable. The 3.0 inch LCD is fantastic. This camera takes pictures quicklier than previous Sony cameras I have had.", "Date": "December 29, 2010"}, {"Title": "Best camera for this price", "Author": "George", "ReviewID": "R2OD0782MWA3AY", "Overall": "5.0", "Content": "The camera makes high quality pictures no matter the conditions. You can choose between several options (automatic, inteligent automatic, manual, etc.) depending the experience you have with cameras.This is the best camera with 14 MPix resolution and 10x optical zoom for its price.It has good design and variety of features.", "Date": "December 15, 2010"}, {"Title": "Risky- Choose wisely", "Author": "HelloWorld", "ReviewID": "R2B7MCT2EUNYOK", "Overall": "3.0", "Content": "I bought this camera from dell because of the deal. I got case, 4GB memory card for $201. I am disappointed because I have been a sony guy for a while and I am not sure I will return. I screen is blurry and the so called \"noise cancellation\" is very weak. The camera is also very slow. You need to be in high light areas for a decent picture. lets face it how often am I going to be in day-light? I guess this what you get for the price. 14.1 MB is not all that at all.", "Date": "December 3, 2010"}, {"Title": "dsch55 best camera for your money", "Author": "elvis", "ReviewID": "R18DN8O3LVG3AK", "Overall": "5.0", "Content": "i have had cameras before this one but this is so far the best camera i got. i recomend it", "Date": "November 27, 2010"}, {"Title": "Excellent!!!!", "Author": "Rhonda Kay Stiles \"charlie\"", "ReviewID": "R2AHM9S8TIM4T1", "Overall": "5.0", "Content": "My husband I purchase the sony 14.1 HD panaramic digital camera in Knoxville, TN 10/15/10 and is exactly what we were in the market for.  Exceptional and awesome features and what a price.  We were in the right store and the right time.  Not only was it marked down but marked down to a awesome price!  I would highly recommend this camera by far!  We have a samsung which I still use at times and will use as a backup camera.  We went from a 6mp to a 14.1 which is what we were looking for also it features HDMI and HD with a 10x zoom and 3\" screen so overall I can tell you that it passed the specs with us and has the spectations of this sweet camera!  Also love my little sony case too.  Since we have the sdcards we also went ahead and purchase a 16gb sdcard and so glad we did.", "Date": "November 16, 2010"}, {"Title": "So far so good!", "Author": "J. Scarlett", "ReviewID": "R1UHV4GCGUXU6Y", "Overall": "5.0", "Content": "I purchased this camera a few weeks ago, and have to say, am very pleased with the outcome as of yet. I am by no means a professional photographer, but the quality of pictures is really great! Prior to the sony, I had been using an Olympus point and shoot and well lets just say, the sony is ten times the quality! The fact that although the viewfinder is a little grainy, the camera takes really clear crisp pictures, depending on the function you are using. So far I have used the easy function, pet mode, and intelligent mode and all are super! I also really like the wide angle feature and digital zoom feature- both are major upgrades from the olympus models I have used in the past. I purchased this camera primarily because I am expecting my first child to be born and after losing my last camera cannot simply rely on my iphone to capture every moment of my daughters birth. Once she gets here, I will have played with the Sony more and can update my review, should anyone care!", "Date": "November 7, 2010"}, {"Title": "Great Camera", "Author": "colorado mike", "ReviewID": "R3P36XHLQ3OUND", "Overall": "5.0", "Content": "I bought this camera for my honeymoon and couldn't be happier.  I was looking for a good point and shoot camera that shot well in day and nighttime settings.  This camera does it all...  Would definitely recommend...", "Date": "August 22, 2010"}, {"Title": "Decent camera, definitely needs improvement.", "Author": "D. Castaneda", "ReviewID": "R3M1C8370U8S9C", "Overall": "3.0", "Content": "Finally, sony cameras can support SD cards, +1 for that. However, I don't think this camera is worth five or four stars. Physically it is a nice camera with good features, but a good camera should take good pictures. I am not at all satisfied with the pictures it takes without flash, they are grainy and blurry. I've played around with different settings like changing the iso setting, but I'm still not satisfied. Also, the flash is too strong and washes out color. Go to a store like best buy and see for yourself. Don't settle for this camera. I heard the HX5V is the better camera with the Exmor R lowlight sensor, and even though it's outside my budget I might try it out. I had a Samsung HZ15W, which I really liked(battery life is pretty bad though), but since someone lost it :(, so I wanted to try something different. If anyone has any suggestions on a better camera for under three hundred dollars, let me know, because I'm still searching.In short I want:-Takes good pictures, both indoors and outdoors and in lowlight conditions-shoots HD video, 720p is good enough(becoming a standard on digital cameras)-min 10 megapixel-would prefer 10x optical zoom, but not a must-good battery for at least 300-350 pictures on a single charge-Size should be small(like the HZ15w or smaller)-should have good features(samsung and canon seem to do well here, never tried a nikon though)-Manual and smart auto settings(something I liked about my samsung)", "Date": "April 19, 2010"}, {"Title": "great buy!", "Author": "reveiwer", "ReviewID": "R1SYKA2ZYQUB2C", "Overall": "4.0", "Content": "This cam has really awesome features --especially the panaroma sweep! its amazing product! I have ordered it to India all the way from amazon.com after revewing the product throughly. I already possess a sony cybersot older model which is nice & slim. But his h55 model clearly outweighs the kind of features, picture quality and zoom it has! the only good thing would have been if the cam was ultra-slim like the older cybershot models!", "Date": "July 2, 2010"}, {"Title": "Will only take still-life photos", "Author": "E", "ReviewID": "R1NZ70NENFU1IO", "Overall": "1.0", "Content": "This camera is utterly useless if you are trying to take pictures of children, pets or anyone/thing that will not pose absolutely still for a minimum of 5 full seconds. Even using a tripod makes photo taking with this camera almost impossible (I tried). I have to shop the ever-loving 4311 out of every photo just to fix the color balance, as everything is either orange or green. Most of the picture I take of my kids has them motion blurred. Of the photos where my older daughter will sit still, we got good results. We also got good results when my baby would sit still. Unfortunately, that takes about 100 tries just to get 2-3 usable and non-blurry pictures. There is almost no control on settings- I have it set to 800ISO and turned \"smile recognition\" down to \"barely\" so that it wouldn't wait until it saw a smile (its idea of \"smile\" and mine are vastly different it seems)- but that's about it.I did not have this problem with my Cannon which had a \"children/pets\" setting. This camera has a \"pets\" setting, but I'm not sure exactly how it's different from any of the other settings other than nighttime, which turns everything green. It also will auto correct to \"twilight\" in any lighting other than flood lights (we use two 100watt floor lamps, a 100watt halogen and two 40watt table lamps just to get the camera to take pictures that aren't grainy messes) or direct sunlight. The middle of the day in my living room is apparently \"twilight\" (unless we use aforesaid lighting) and receives the green treatment. It takes forever to focus, and once your subject moves it goes out of focus to an almost comical degree. The camera likes to wait until it thinks the photo is \"optimal\", which means that it will not actually take a photo when you press the button (sometimes several seconds later after the baby has crawled off), so you lose baby smiles and sibling hugs/kisses entirely.I tried to use the camera in low-light setting in order to take photos of lights in a dim room (candles with only a table lamp to get the low light), and they didn't even show up. I got a solid black grainy background with a white circle of indistinguishable grainy light and vague outlines.If you like to set up a brightly lit studio with solid same-depth backgrounds and shoot perfectly posed and still subjects- this camera may work for you. Otherwise? Pass.", "Date": "March 8, 2011"}, {"Title": "Sony Digital Camera DSC-H55", "Author": "Dennis Kidwell", "ReviewID": "R1P2TZTP30NJ0S", "Overall": "5.0", "Content": "This is a great camera.  I love the features, image stabilization, 3 inch LCD, 14.1 MP, 10x wide angle optical zoom and smile dection to name a few.  The most important thig is this camera takes great pictures and is small and easy to carry.", "Date": "May 15, 2010"}, {"Title": "Mediocre camera", "Author": "BangForMyBuck", "ReviewID": "RJNNX0FEXZ8UN", "Overall": "2.0", "Content": "Bought this a month ago to replaced a Canon SD750. I've only played around with it here and there sinc. Yesterday, went to a birthday party yesterday and pulled out my new camera to use.  The H55 takes great outdoor pictures and the panoramic mode is awesome, but indoor it SUCKS. There's a noticeable lag (1/2 second almost?!) when taking pictures. In a room that's dimly lit, there are 2 flashes first, then there's probably a half second lag before the picture gets taken. If there's a lightbulb just above you or the subject, the picture comes out too bright. The video is supposed to be in HD 750p, but the clarity of the video captures looks kinda weird. Can't really describe it but it just doesn't look right.I was hoping to return it to Amazon, but I've already past the 30 day Return windows.  I probably should have done more research on this first, but having a Cybershot HD Camcorder HC5 for 3 years that is just absolutely awesome, I thought their camera's would be just as good. WAS I WRONG!", "Date": "May 9, 2010"}, {"Title": "This Camera Has Been Good To Me", "Author": "Bryan Laurienti", "ReviewID": "R15SHB8SJ8EIWC", "Overall": "5.0", "Content": "I bought this camera in January 2011 (almost exactly a year ago), and over the course of using it, I've become a professional photographer. Well, maybe not. But it is the easiest digital camera I've ever owned. I've only had one problem with it, and it was my fault. Shortly after I bought it, a co-worker used it to photograph some stuff in the office, proceeded to plug it into their USB port, but it didn't work. Apparently, it wasn't a USB port and the result was that it utterly destroyed my camera's ability to connect via USB. All was not lost, however, because I can still use the memory/SD card to retrieve my photos and videos.As for features, it has plenty. I particularly enjoy the panoramic setting as well as the smile detection. The videos are always perfect, and that helps if you enjoy enjoy sharing them with others and you've had the experience of friends scoffing at your shaky videos, which they probably didn't want to watch in the first place! I'm not a photography expert at all, but I do believe in one of the settings it takes multiple CR2 images (very high quality) that you can somehow assemble on your computer to create HDR images, which are those vibrant, unreal looking photos. I recently upgraded to an 8GB SD/memory card because I use it too much!Anyway, I love this product and highly recommend it to anyone looking for a simple, straight forward camera.", "Date": "January 24, 2012"}, {"Title": "Junk DO NOT BUY", "Author": "Curtis T Bowers", "ReviewID": "R2GSK0K9BDGI8Z", "Overall": "1.0", "Content": "Had this camera for about 2 years and it broke already. We only used it about 8 times for birthday parties and special events. It started out taking great pictures, but now the image sensor is out of whack. Everything is over exposed in normal lighting conditions and with or without flash. If a picture is taken in a dark room, with very limited light you can see a picture and there appears to be rings around the picture starting in the middle and going out. Sony wants $90 to just check it for repair. Never buying Sony again.", "Date": "October 13, 2011"}, {"Title": "I have never hated a camera before", "Author": "Laura Treider", "ReviewID": "R238BGLX570WK1", "Overall": "3.0", "Content": "I bought this camera without reading any reviews when the Canon that I loved suddenly broke after 4 years right before my son's Halloween party.I hate this camera. The pictures it takes are nowhere near as nice as I'm used to, and the lens cover keeps getting stuck partly open or partly closed. It's not worth what they're asking for it. I might pay $100 for this camera, that's it.", "Date": "May 16, 2011"}, {"Title": "Perfect except the charger ( from other model)", "Author": "Rodrigo V. Vejar", "ReviewID": "R3FLZPMC5ZI1TX", "Overall": "5.0", "Content": "Todo perfecto. La camara es muy buena y cómoda. El único error es que enviaron un cargador de batería que no sirve ya que es de otro modelo!!!!!El vendedor no hizo un check list del producto.", "Date": "February 14, 2011"}, {"Title": "Good Camera!", "Author": "Luis", "ReviewID": "R2VME5Q84RM7BH", "Overall": "5.0", "Content": "A friend say to me. Why you buy a Sony Camera the Cannon are better! in this moment a take a picture in sweet panorama and finally he saw d=the difference between Sony  and Canon.The quality when you use the zoom is magnificent, honestly I LOVE THIS CAMERA and the seller by on time.", "Date": "January 16, 2011"}, {"Title": "More Goods than Bad - Good Value", "Author": "Yogi", "ReviewID": "R2KIUD0N2EWD6Z", "Overall": "4.0", "Content": "It has been 2 months since I owned this camera. I am impressed with the feature set that comes with the camera, especially the 3\" LCD screen, 10x wide angle zoom, Panorama/HD video features and the semi-manual controls.It's easier to quote just the drawbacks: Size is a little big (that's because of 10x zoom), Slow interface response, Battery life is okay but not great, Low light pictures are just fair and could be better.I give it a 4 star rating considering the few cons listed above. It is definitely a good value for the money and recommended.", "Date": "December 24, 2010"}, {"Title": "Nice camera - Value for money", "Author": "Tarun", "ReviewID": "R2OQ41B0C243XH", "Overall": "4.0", "Content": "I own this camera for a while now, and I must say that I don't have to repent on my decision.Its great value for money. It takes great pictures in well lit conditions, for little darker places, it is average. It gives me fair bit of manual controls, which is impressive.", "Date": "December 13, 2010"}, {"Title": "Excelente Camara", "Author": "Cristian Robles \"CRISTIANZAO\"", "ReviewID": "R2HXPCGZ8S9UBV", "Overall": "5.0", "Content": "Son 2 camaras Sony H55 las que he comprado, muy bonitas y muy facil de manejar, el zoom es muy bueno y la definicion excelente, recomiendo este modelo", "Date": "December 5, 2010"}, {"Title": "It is just I need", "Author": "Sofi", "ReviewID": "RW5CPKC9XWFDY", "Overall": "5.0", "Content": "This is really amazing product from Sony, picture quality is amazing and even the videos are of HD quality", "Date": "September 23, 2010"}, {"Title": "Good compact camera with 10x zoom that works!", "Author": "Gary L. Lindsey \"G\"", "ReviewID": "R2S9IF86PUUXZU", "Overall": "5.0", "Content": "Always have used Sony compact cameras, and this is the best one yet.  Especially for the price, the camera has numerous features which I won't repeat here, but they all seem to work as advertised.  Good camera.", "Date": "June 5, 2010"}, {"Title": "Had to change my mind about this one", "Author": "slim \"57psalm\"", "ReviewID": "R382XRTQZZ4Y76", "Overall": "4.0", "Content": "I went from thinking this thing was a piece of trash, to actually buying one.I have no regrets!I was looking for a new compact digital for travel, preferably with a wide lens as well as good zoom. I never trust what they claim for a zoom factor anymore.The first thing I do when I am trying out a camera is turn off the digital zoom. It's worthless. It can't take the place of resolution. Any photo editing program can give you \"digital\" zoom after you've taken the picture.To determine how the zoom really looks, I put the camera up in one hand, zoom it in on something far away as far as it will go, and compare the image frame with what my eye sees.  On full zoom, this camera manages to get images slightly bigger than what my eye sees. Zooming out, it can make things look almost microscopic.Pros:---------------------------------------------------CMOS does better in low-light settings, hands down. 'Nuf said.Very compact size for such a large zoom factor.Small enough for travel.Zeiss lenses - the best IMHO.Built-in lens cover that automatically closes and opens for you. No more dangling lens cap!Panoramic feature is really pretty good, provided there isn't a lot of movement (on your part or the camera frame) when you take the picture. The picture doesn't look hardly distorted or \"fish-eyed\" either.Sony didn't change much on the controls. I'm glad for that as I hate having to learn a new system on every camera I own.-----------------------------------------------------------------Cons;14 megapixels. Why, you ask, do I say this is a con?  Average 35mm film is about the equivalent of 8 megapixels.  Having super-high resolution only takes up more memory without really giving you a noticeably better picture, especially if you are printing out 5 x 7's or smaller. I wish I could have found a 10 megapixel camera with twice as much zoom.I cannot get a good focus in macro mode using the \"intelligent auto mode.\" It makes no sense to me. My other digital cameras do not have this issue.  I can put them in \"macro\" mode, and zoom in so that the object fills the frame, and it will auto focus.  This camera won't do that. Instead, when I zoom in on the item, it gets blurry and won't focus no matter how close or far away the object is. So I back it out to wide angle mode, hold the object closer, and then the camera focuses and I get the picture I wanted. What is the point of macro mode when it won't focus on objects within 2 feet?------------------------------------------------------------------Overall: I'm glad I bought it, even if the zoom is disappointing. The panoramic feature has worked out well for me so far.It will be great when traveling because it is really compact.Now if I could find a camera that acts like an SLR, but is the size of a pocket camera, with at least 10 megapix, I'd buy it in a heartbeat.", "Date": "June 7, 2010"}, {"Title": "Not Worth Getting", "Author": "D. Jones", "ReviewID": "R3MWNZFCHQLADF", "Overall": "1.0", "Content": "I got this camera as a Christmas gift.  My brother had one and his took good photos.  I used it straight out of the box on auto.  Every photo I took was horrible.  The photos were over exposed in every situation.  I took indoor photos, I took photos on a field trip for my daughter where the lighting was perfect and still the pictures came out blurry.  I wanted a point and shoot that I did not have to think about. I can't believe what horrible photos this camera took.  I have owned several point and shoot cameras over the years.  This was by far the worst one yet.  Needless to say it was returned.", "Date": "January 16, 2011"}, {"Title": "Great camera... NOT!  Watch out!", "Author": "A. Dionne", "ReviewID": "R1L5G3I9E5U9OV", "Overall": "1.0", "Content": "First off, let me say that I love Sony Cybershots.  I own several. I bought this one for the 10X optical zoom and sports setting.  It was with me last night for my son's baseball game and I am so impressed.  It takes GREAT shots, even better than my other cameras.  Love it.Oct 2010. Well, let's just say my glowing review has now been downgraded.  WATCH OUT.  Customer relations and repair will not do anything with this camera.  My pictures are horribly distorted.  The subject will be long or curved. For instance, I took a picture with my son and his body is HUGE and his head is SMALL.  Another time, my husband and I were taking a picture and the camera distorted my face to be very long and much larger than my husbands even though we are sitting side by side.  I called Sony for repair. I sent my camera in and Sony replaced the optical unit.  They sent it back. I used it again and the same problem occured.  I called and said that I wanted a new camera, same model and they said NO.  My mom purchased the same one at the same time and hers works perfectly, Sony doesn't care.  They said to send it back for repair and they will test it. The test came back and Sony said it worked according to specifications... needless to say, they are sending it back and I am throwing it away.  I have owned Sony forever.  I have radios, tv's, cybershots and camcorders.  I will not be buying Sony again.  Don't do it!  I have spent at least 6 hours over the course of the last week to have this issued resolved and after $250 and 6 months of use, the camera is junk.  Not really worth the money.", "Date": "April 17, 2010"}, {"Title": "great camera at a great price", "Author": "M. \"M.\"", "ReviewID": "RIFBLEGC2QUTB", "Overall": "5.0", "Content": "Only thing it does not have is a sound recorder. Takes really great pictures, lots of great features at a low price.", "Date": "December 25, 2010"}, {"Title": "Sony DSC-H55", "Author": "Sachin Khade", "ReviewID": "R2PF3MQ7IMKQCK", "Overall": "5.0", "Content": "This is really amazing product from Sony, bought it after lots of R&D;, picture quality is amazing and even the videos  are of HD quality....really amazing camera any fresher can user this camera, just point and shoot....i am loving it...i  bought 2 one for myself and the other for my friend.", "Date": "June 7, 2010"}, {"Title": "Camara muy buena", "Author": "Estenin Romero", "ReviewID": "R30F4HVT14Q4L6", "Overall": "5.0", "Content": "Esta camara es buenisima me parece una de las cosas buenas que ha sacado sony por tan bajo precio comparadas con otras marcas el unico defecto que veo en fotografias nocturnas es lo granulado pero escogiendo la escena correctamente me parece muy buena por lo que la califico con 5 estrellas", "Date": "December 17, 2010"}, {"Title": "Simple and high quality", "Author": "Philipe Kupferman", "ReviewID": "RER1V0EDR4JZY", "Overall": "5.0", "Content": "I'm very happy with my purchase... it's small and i got high quality pictures with a very good zoom.", "Date": "May 6, 2010"}, {"Title": "Pretty good camera so far", "Author": "John Kessler", "ReviewID": "RMTUNNHTMI81V", "Overall": "4.0", "Content": "So far this camera has done pretty good.  The only complaint I have is that if the subject moves at all while taking the pic it seems to always blur.", "Date": "March 31, 2010"}, {"Title": "Beware Sony Warranty", "Author": "Frank R. Bellacera \"Frank\"", "ReviewID": "R1Q646MPJ42NPU", "Overall": "1.0", "Content": "I don't own this particular camera but you should be aware of my experience with the Sony warranty that came with the camera. After only 3 months, the camera just stopped working while on vacation. I returned the camera to the repair facility in Laredo, TX (at my own expense).  A couple of weeks later I received an email requesting my authorization to go ahead and repair the camera. The cost estimate was: $45 for labor and $593.58 for parts. WHAT!! The cameras original cost was less than $300. So what about my warranty? When I called the repair facility, a very pleasant young man informed me that their experts found a piece (???) of the camera broken which led to the failure of the camera. They summarily determined that the part was broken by my misuse.  I explained that there was nothing visibly \"broken\" when I returned the camera (there are only 2 movable parts on the outside of the camera) and that it stopped working in the middle of taking normal snap-shots. That's it. So-sorry! End of warranty. End of story.", "Date": "March 13, 2011"}, {"Title": "Shoping", "Author": "Ski", "ReviewID": "R17EYNIIGQXDWR", "Overall": "3.0", "Content": "The sweep panaramic feature is what really interested me.  Took a SDHC card to a store an snaped a bunch of pictures. When I looked at them on the computer and HDTV, decided not to buy at this point.  Really recommend if interested in this camera to take a SD card and take sample pics first.  Sweep feature is cool.", "Date": "May 18, 2010"}, {"Title": "Good Camera", "Author": "Junaid Bhatti \"J.A.B\"", "ReviewID": "R35NUOQL0OMF9O", "Overall": "4.0", "Content": "For the price its an excellent Camera. I am satisfied. SONY hardly ever lets me down.", "Date": "April 23, 2010"}, {"Title": "dissappointed", "Author": "A. Thema \"h.a lecture\"", "ReviewID": "RD081Q36HD0XP", "Overall": "1.0", "Content": "I am sure I got a lemon, the pictures are so grainy it makes me wonder if it is a 14.1 mp. I had high expectation, I am very disappointed...", "Date": "November 25, 2010"}, {"Title": "Dissapointed!", "Author": "M. Scian", "ReviewID": "R23XCN7TUBIA1E", "Overall": "1.0", "Content": "I researched a lot of cameras and stuck with Sony for the 4th time. It is hard to review a camera better than a single star since the camera would continually come up with re-insert memory card. In just a couple weeks of use and a few different memory cards I missed some great pictures of my kids. It looked like a great camera but I cant risk losing photo ops! Back to drawing board. I wish it worked for me.", "Date": "April 24, 2010"}, {"Title": "AMAZON ITEMS ARE GOOD AND ECCONOMY", "Author": "Ramu", "ReviewID": "R3BDUXMJKAK03Z", "Overall": "5.0", "Content": "AMAZON ITEMS ARE GOOD AND ECCONOMY as comparitve to all other........amazon maintaining the time to time delivery................", "Date": "July 19, 2010"}, {"Title": "Don't Buy this Package: Camera + Memory Card + carrying case", "Author": "J. Warling \"zombie fan\"", "ReviewID": "RVPOMQFSM65G0", "Overall": "1.0", "Content": "\"Frequently Bought Together\" INDEED!  But not sent together, if at all.I assumed that a company like Sony would include a memory card with their cameras but this one does not.  If a $200 price tag doesn't give them enough profit margin, they should raise the price so that they can include a memory card.  I have 3 words for Sony:  CHEAP CHEAP CHEAP!  I also thought I was buying an \"extra\" card with this package.  The camera arrived, the carrying case arrived, but the memory card (sent separately from \"Digital Media Source\") never did.  Amazon instructed me to contact the seller.  When I did, I discovered that others had had the same experience and that Digital Media Source refused to make good the missing memory card which they sent via untrackable USPS.  I'm sure they'll blame the post office.  Buyers have to hastle Amazon to get their money back.Too bad that companies like Sony & Digital Media Source make Amazon make up for their lousy business practices.Sony Cyber-shot DSC-H55 14.1MP Digital Camera with 10x Wide Angle Optical Zoom with SteadyShot Image Stabilization and 3.0 inch LCD (Black)", "Date": "December 27, 2010"}, {"Title": "DO NOT BUY - this camera only capture images at 72 DPI!! totally worthless", "Author": "Melissa \"Melissa\"", "ReviewID": "RVLWYWPNADN37", "Overall": "1.0", "Content": "my business requires photos to be at least 300 dpi (photos for magazine articles, newspaper articles, graphic artists building advertising material)I've just been on chat with Sony support and they've confirmed this camera only captures images at 72 dpi. this is absolutely unacceptable and should be on the packaging!I am so disappointed, especially b/c my last camera i loved, which was a sony cybershot, so i went with Sony again.If you utilize your camera professionally, DO NOT BUY", "Date": "December 6, 2010"}], "ProductInfo": {"Price": "$240.00", "Features": "10x optical zoom Sony G-Lens (25mm-equivalent wide angle); Capture breathtaking images in Sweep Panorama Mode\n14.1-megapixel CCD sensor; 3.0-inch LCD screen\nHD Movie mode (720p); take stable movies while walking in Active Mode\niAuto automatically optimizes camera settings; Smile Shutter technology automatically captures a smile\nCard slot for optional Memory Stick Duo media and SD media", "Name": "Sony Cyber-shot DSC-H55 14.1MP Digital Camera with 10x Wide Angle Optical Zoom with SteadyShot Image Stabilization and 3.0 inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41KkUhiLHOL._SX300_.jpg", "ProductID": "B0033VKKB2"}}