{"Reviews": [{"Title": "See reviews for this camera with the kit lens", "Author": "T Boyer \"seattleparent\"", "ReviewID": "R8HWF0JKT7PIM", "Overall": "5.0", "Content": "There are many reviews and extremely positive. Look up the camera with the 14-45 kit lens.This is a fantastic high-end camera with image quality in many situations comparable to -- even better than -- a lot of mid level DSLRs.With the highly regarded 14-45 Panny lens, as a \"walking around\" camera for outdoor shooting it really can't be beat IMHO.However as the one reviewer here points out, this camera has an autofocus system that isn't as fast as most true DSLRs.If you shoot a lot of sports or wildlife, the G1 is not your camera -- you really need a full size DSLR with a bigger sensor and fast lenses.Low light performance, similarly, is not bad if your subject is relatively stationary -- but not comparable to the newest DSLRs. For example, ISO800 is at the edge of this camera's performance range, but on the Canon Rebel T2i, ISO3200 will still produce great images. The T2i is twice as much money and a lot more bulk, however.", "Date": "December 16, 2010"}, {"Title": "A \" Sleeper \" !", "Author": "Robert E. Keay", "ReviewID": "R1HRWPOT9BYRJ3", "Overall": "5.0", "Content": "I purchased this Camera last June , and I find it a Delight to use . I mainly use the 20mm Lens , and I find it Very Fast and a Nice Format of 40mm ! I have used the 14-42 Lens and that too gives pleasing Results ! I have taken some very early A M Pictures , and the Strength of the Lens Really produces Breath taking Shots ! I have other digital Cameras , but find Myself gravitated to this specific combination ! One click of Mode Dial , and I have B & W capability at My fingertips ! I have been into Photography for over Half of My Life Time , and This Camera has given Me Infinite Pleasure ! Used Properly , it can give You Pleasure also ! R E Keay", "Date": "December 13, 2010"}, {"Title": "Sweet little DSLR-like camera", "Author": "MM \"MM\"", "ReviewID": "R2UJWCQELS8KQB", "Overall": "4.0", "Content": "Small, light, sturdy.  Great pictures. IA mode is very accurate in exposure and focus.  Hard not to like this full featured camera.", "Date": "February 19, 2011"}, {"Title": "Plenty of camera.", "Author": "Scott M. Comptois", "ReviewID": "R3N4M3K7A04EG3", "Overall": "5.0", "Content": "Not in production any longer, but I'm buying up as many of these cameras from the interwebs as possible for my business.  It functions as a reliable and consistent camera for MOST uses.  Down side is low-light photo taking capabilities.  Pluses are its flexibility from full-on Auto to Manual.  (No 'B' or bulb setting is a bit of a drag though).Only 12.1 megapixels, but has not been a problem.  I avoid the Panasonic kit lenses and use only Leica Micro four-thirds lenses or the Pan-Leica lenses which are more affordable.  I have three of these cameras now.One design flaw - when using a remote flash trigger and connecting to hot-show, the pins can jump too far forward if not careful and jam.  The only way to remove then is to 'break' it off.  I've broken two transmitters and one camera so far with this problem.  A quick fix was to superglue a small plastic peg just in front of the hot shoe to prevent the transmitter from sliding too far forward in the hot shoe and locking that second pin in the wrong hole.", "Date": "November 30, 2012"}, {"Title": "Poor Action shots", "Author": "Jen", "ReviewID": "R1H6MET50HXC7S", "Overall": "1.0", "Content": "I purchased this camera based on the positive reviews.  I used this camera in both the IA mode and Action modes.  My main purpose is to take pictures of my children.  All of the pictures were blurry, even after calling Panasonic to direct me through the problem.  The lens that comes with the camera is useless.  No zoom.  You have to buy an additional lens to take pictures of anything far away.  This camera is also very complicated to use.  I would not recommend this camera for a novice like myself.", "Date": "December 2, 2010"}], "ProductInfo": {"Price": "$599.95", "Features": "12.1 MegaPixels * Micro Four Thirds Lens System\n3\" Free-angle LCD Display & EVF * Self Cleaning Sensor\nFull-time Live View with Contrast AF * Intelligent Auto Mode\nHigh Sensitivity (ISO 3200) * HDTV Output\nCreative Color Modes * Compact Camera Body", "Name": "Panasonic Lumix DMC-G1 12.1MP Micro Four Thirds Interchangeable Lens Digital SLR Camera (Black Body)", "ImgURL": "http://ecx.images-amazon.com/images/I/41FPQeGfLYL._SX300_.jpg", "ProductID": "B003BR8BE6"}}