{"Reviews": [{"Title": "Best Kodak Point and Shoot Yet...", "Author": "Howdydooit", "ReviewID": "R3NJZH0QKZ4DXL", "Overall": "5.0", "Content": "I have used a myriad of pocket cameras in the past, including other Kodaks. Sometimes it seems as if Kodak will hit a home run and then take two steps back, but it seems as if they've broken through with consistent improvements (V550, V1253, M341, etc.).  If it's one thing Kodak has understood well since they invented digital photography, it's make a camera easy to use, and produce pleasing photos.Generally, on the point and shoot side, Kodak's attributes have been ease of use, beautiful display, great video (especially since they started doing HD a few models back), and beautiful, vivid pictures. They also make it pretty easy to update the camera's firmware when they correct a bug or improve a feature.  Typically, Kodak pocket cameras have been weak in low light, sharpness has tended to suffer greatly under borderline lighting conditions, and speed to set up can be slow.Recently they've really improved things with features like face recognition, the camera's ability to analyze scenes and 'figure out\" your composition, and other attributes that make life easy for point and shooters, but unless the light was with you, you had to work at it more than you should.It's been in a lot of Kodak's traditionally weak areas where I found this camera to have so many improvements.  It's substantially faster than earlier models.  There's no time to play a little \"boot up jingle\" because when you hit the power button, this camera is ready for action before you are.Taking pictures in questionable light, with or without flash, is noticeably much better than in my past experience.  Before I would have to fiddle with a \"scene mode\" and/or the flash, and/or the aperture setting to get something I could reasonably use when conditions were nominal.  That's great when you have the time to fiddle with it, but not so hot when you're at a poorly lit reception or some other indoor event and you have to act fast.What originally attracted me to the camera was the 8x zoom and previous success with features like smart capture (intelligent scene detection and analysis), and panorama mode.  I know my wife will love face recognition - the ability to quickly find pictures of the kids among the hundreds of photos she accumulates on a memory card. Of course the ease of use is big...I just got back from a \"cruisin' weekend\" at the beach with some buddies - thousands of classic cars.  Nivana.  My buddy had his Canon pocket camera and was reading the manual so he could figure out how to delete pictures.  I looked at it and couldn't see the markings on some of the controls, much less figure out how to delete something.  Kodaks always have had dedicated delete and review buttons.  Also a menu button and joystick with 4 other controls for quick access to common features, a flash toggle button, scene mode button, etc.You really waste no time getting up and ready to shoot. The main thing is we're instantly taking pictures and shooting HD video of hot rods that suddenly appear on the boulevard without staring at the back of the camera. Something I would take for granted - quickly deleting things we don't want were a luxury for him.  That model he had might have been easy, but my attitude is, if you can't figure it out on the fly, then it's more complicated than it needs to be.  If anything, that's a Kodak attribute, but I think some people overlook the deeper features because they assume the camera must not be very sophisticated because it's so easy to use.The bonus this time was the near instantaneous readiness, clearer night shots, better color in low light, and less fiddling to try to make a useful shot in questionable conditions.  It's obvious to me Kodak took a lot of the criticisms to heart, kept the good things, added a quality 8x optical zoom, and made the other things better.", "Date": "May 24, 2010"}, {"Title": "Firmware update fixes freeze-ups", "Author": "ge", "ReviewID": "R1FW9A6U0JBL64", "Overall": "4.0", "Content": "After much research I purchased this camera for one reason - low shutter lag for its class.  We have a two year old who moves quickly and it was pretty much impossible to get a good shot with my Olympus Camedia D-595, which seemed to take about two seconds from the time the button was pushed until the actual shot was taken.  Mostly I was capturing the back of her head, if she even ended up in the frame at all.  This camera snaps very quickly so it has achieved its purpose.Unfortunately, after a couple days of use I experienced the freeze-up problem so many other reviewers have complained about.  Every time I would use the review function to look at the pictures I had taken it would lock up and require battery removal to restart.  I decided to return it but read about the firmware update Kodak put out to fix the issue, which some other reviewers have mentioned.  It is available on their support page ([...]).  It was very easy to install and completely fixed the problem.  I definitely recommend people otherwise satisfied with this camera try this before sending it back.Picture quality is fine for a point and shoot camera.  I only took a couple videos and was not very impressed with the quality (grainy) but they were taken indoors in low light so I will withhold judgment on that.My one complaint so far is that you have to turn the camera on and have the lens pop out in order to use the review feature and look over photos that were already taken.  My Olympus allowed me to review the pictures on the camera without actually turning the camera function on and unnecessarily exposing the lens and working the gears.  I guess that is a minor issue though.The bottom line is it does what I wanted and I now am able to capture some good candid shots of my speedy daughter.", "Date": "January 4, 2011"}, {"Title": "Easy to use!!!", "Author": "Loves to read!", "ReviewID": "R2OQVTCTE361E1", "Overall": "5.0", "Content": "This camera is so easy to use you don't even need to read the directions! Picture quality is superb! Options abound!", "Date": "September 12, 2010"}, {"Title": "Don't waste your money, video is horrible", "Author": "Sublx8ed \"sublx8ed\"", "ReviewID": "R31WDLWHSPJ1HK", "Overall": "1.0", "Content": "What I liked about this camera before I bought it was that it was 14 mp, HD video, and 8x zoom.  What I don't like about this camera after I bought it is...  Most of it.  The video was especially disappointing, it's very grainy, jumps horribly when you move the camera and doesn't like normal indoor lighting very well.  I can't tell you how grainy it really is.  I even ran it through filters and conversions and it still stunk.The pics that I took although 14mp still looked grainy to me, not horrible, just not as clear as I expected from such a high MP camera and a supposedly great lens.I will be taking this camera back in the morning.  Very disappointed and won't be purchasing a Kodak again.  First and last!", "Date": "February 9, 2011"}, {"Title": "LOVE!", "Author": "Okiegal", "ReviewID": "R343XJR7A91EZT", "Overall": "5.0", "Content": "AWESOME CAMERA!  RECEIVED SUPER FAST AND LOVE THE PINK!  CAN'T GO WRONG!  LOVE THE LARGER LCD SCREEN AND VERY EASY TO USE WITHOUT THE MANUAL!  NEVER HAVE SEEN A 8 OPTICAL ZOOM IN SUCH A COMPACT CAMERA, BUT IT'S NICE! WRIST STRAP IS EASY TO ATTACH AS WELL.  PICTURES TURNED OUT GREAT AND LOVE THE NIGHT TIME SCENERY!", "Date": "April 28, 2010"}, {"Title": "Great value/price relationship", "Author": "J. A. Rodriguez", "ReviewID": "R20KGEP3QO27LT", "Overall": "5.0", "Content": "I was looking for a camera with an optical zoom greater than 5x without having a semiprofessional look/size. I didn't find many, and the Kodak M580 was by far the cheapest one, so I gave it a try.The device is extremely easy to use. It does not have too many buttons and their functions become clear even before reading the user manual. It does save pictures and video in HD, but you may want to get an SD card, since the internal memory won't get you very far. The proprietary rechargeable battery makes it easy to recharge and lasts quite longer than AA batteries (rechargeable or otherwise) I have used in other cameras. Of course, it will be a chore to find a replacement battery when this one's lifetime has expired, but I expect it to last a long time -- after all, it's a camera, not a laptop.Why pink? Because it's a gift for Mother's Day.", "Date": "May 7, 2011"}, {"Title": "Good camera", "Author": "Janine L. Johnson", "ReviewID": "R1GEJ2554O1720", "Overall": "5.0", "Content": "I got this camera just before a long road trip and took 522 photos with no difficulty during the next 9 weeks. I highly recommend it!", "Date": "September 14, 2010"}, {"Title": "Kodak EasyShare M580", "Author": "Marilyn T. Dale \"Marilyn\"", "ReviewID": "R38LJ8O8VK652", "Overall": "5.0", "Content": "Just amazing! This little camera is fabulous!  Amazon you did it again.  Arrived on time in perfect condition,  just perfect.  Easy Share is easy to use....Quality of pictures is outstanding for such a small price,  the variety of scenes available is excellent and easy & fun to use.  Did a portrait using the candlelight setting it's as good as a pro.  It's great for an old lady like me it removes wrinkles lol... This little camera is a powerhouse.  I am quite a bit older and don't use the features to put your pictures on face book, you tube etc ..I'm sure when my Great Grandchildren check this camera out they will want me to buy them one for Christmas...I will say the buttons are small,  but you have to expect that on a pocket size camera.  I have memorized their placement and now have no problem at all.  I just love this fun little camera. The tripod is amazingly sturdy and very good quality, of course I had to try it out,no problem or worry about the camera falling or tipping over. The video is excellent too,  but I most likely won't use this feature as I have a Video Camera. Thanks Amazon Great little camera from Kodak I would highly recommend this M580.....Kodak EasyShare M580 14MP Digital Camera with 8x Wide Angle Optical Zoom and 3.0 Inch LCD (Pink)", "Date": "March 20, 2011"}, {"Title": "great pocket sized camera", "Author": "bob zaret", "ReviewID": "R2J351X3RJAL55", "Overall": "4.0", "Content": "Only camera in price range with 8x zoom! Rechargeable batteries. Only issue is buttons are on tiny side.Bob", "Date": "April 17, 2011"}, {"Title": "camera malfunctioned", "Author": "Jean Brennan", "ReviewID": "R26N4195H4398X", "Overall": "1.0", "Content": "We returned the camera because it kept freezing up and had to be turned off and turned on again in order to work.", "Date": "February 20, 2011"}, {"Title": "DOA", "Author": "Wild0nTheRun", "ReviewID": "RW8BPXT3XUXZB", "Overall": "1.0", "Content": "Didn't work out of the box. Kodak tech support was useless. Even went out to buy a new battery to see if that was the problem.  Replacement didn't arrive in time for event it was bought to be used for.  I'll stick to Sony products.  Amazon customer service was however fantastic.", "Date": "May 28, 2010"}, {"Title": "Don't buy this item", "Author": "Debibear", "ReviewID": "R3J2RI4FARRBA0", "Overall": "1.0", "Content": "This seemed like a great camera, but upon receipt it didn't come with a charger for the special battery it took, and no matter how still I held the camera the photos are shaky. I could rest the camera on a table and they would be wavy. Not satisfied.", "Date": "June 27, 2011"}, {"Title": "Just what I was looking for!", "Author": "Abdul Shehu \"\"is it better to be smarter ...", "ReviewID": "R2GMA3NOIUUS70", "Overall": "5.0", "Content": "I love taking pictures just for fun and what I have always been looking for is  a cheap digital camera that produces crisp and crystal clear images without much effort. And the Kodak EasyShare M580 14MP Digital Camera with 8x Wide Angle Optical Zoom and 3.0 Inch LCD (Blue) does just that! For some time now I have been watching reviews on youtube and searching a lot of techie websites for the best point-to-shoot camera below the $200 mark. I finally settled on the Sony DSC-W350 14.1MP Digital Camera with 4x Wide Angle Zoom with Optical Steady Shot Image Stabilization and 2.7 inch LCD (Black) after I've seen that CNET has chosen it as its best digital camera of 2010. This finally sealed the deal for me and I later got it. However, I was highly disappointed with the picture quality of the camera. Pictures come out noisy even in the best lighting conditions. Unfortunately, I immediately decided to get rid of it. I finally traded it for the Kodak Easyshare M580. And, boy was I glad I did!The Kodak Easyshare turned out to be much better in terms of producing quality pictures than the Sony. Pictures come out rich, natural and very clear. Even though the Kodak lacks the Sony's appealing looks and potability, it has better features. For example you can set the exposure before taking the picture. The HD video is the same as that in the Sony.However happy I am having the Kodak instead, I still feel sad when I look at the few shortcomings it has:1. Picture quality at night is horrible (if anyone knows the best settings for this please help)2. The macro mode is nothing compared to the Sony. Most often it doesn't work properly.3. At full 8x optical zoom, most pictures come out blurry. You have to have superb steady hands to get a clean shot.4. Lastly, I sometimes hear some creaky noises as the lenses and other contraptions in the camera are been adjusted. I never observed that with the Sony.Barring all these however, if your main interest like mine is only crystal clear images, then the Kodak is for you. Besides, its battery lasts more than the Sony.I highly recommend this and a big thanks to Kodak! Looking forward to better cameras from them.", "Date": "January 22, 2011"}, {"Title": "Love It", "Author": "Melanie", "ReviewID": "R2MOP86FP83R9L", "Overall": "5.0", "Content": "The M580 is an excellent quality point and shoot camera. I've had it about a month, and this camera takes great video and delivers perfect photos. Although I did have a few problems with it freezing on me, 4 times to be exact, which is the only downside, but overall its a great camera. I love my Kodak... and I think it's a great buy.", "Date": "August 4, 2010"}, {"Title": "Takes great pictures of documents, Nice video, Amazing outdoors!", "Author": "Martin Brunelle \"Jazzygemini\"", "ReviewID": "R2XO2RKQV5ZZ09", "Overall": "4.0", "Content": "I spent about 100 dollars on this camera, and as usual with Kodak, I'm beyond impressed. I would give it 5 stars, except that it takes some effort to get a clear picture. I got this primarily to take photos of books (inside pages and outside cover) for my online bookstore. As long as you hold the camera perfectly still, it takes excellent shots of any kind of writing on paper (there is an option that you can select for taking pictures of documents). But if you move the camera even slightly when taking shots, than the picture is no good. So the trick is to learn how to hold the camera perfectly still. Has an amazing built in video camera (not as good as a normal video camera but I was quite surprised with the video and sound quality). The storage card that comes with it, is too small (only holds around 12 pictures or 1 video), so I recommend purchasing a much larger storage card (get a high quality one that stores information quickly, if you plan to use the video camera). The Kodak EasyShare M580 comes with all the usual perks you expect in a digital camera (there are endless ways to change settings). The battery life lasts a long time and no extra batteries ever need to be purchased. I have also used this camera to take normal shots of people, buildings, nature, clouds and other things, and the picture quality is \"far\" better than Satisfactory. For a low priced, nice looking camera with great video and pictures, this may be the best there is!", "Date": "October 29, 2011"}, {"Title": "Kodak Easy share M580", "Author": "Kumar", "ReviewID": "R13USLO1BDF2RH", "Overall": "3.0", "Content": "Pros:Picture quality is good.Cons:NO memory card, very less internal memory, Settings are not user friendly.", "Date": "August 8, 2011"}, {"Title": "bad camera...surprised by this bad product from kodak.", "Author": "marcella \"gingerdac\"", "ReviewID": "RDSBMVR678I5D", "Overall": "1.0", "Content": "believe the previous reviews ...this camera freezes, blurry.........it only takes good pictures if you are outside with bright light..i'm so disappointed with kodak. my previous camera from them was a c330 which is awesome, the only problem now is that i need to buy aa batteries..", "Date": "August 5, 2011"}, {"Title": "\" Lens Obstruction\"", "Author": "Carrie McCrosky", "ReviewID": "RWNW3O8OGKVOE", "Overall": "1.0", "Content": "I got this camera in March , this was my third Kodak digital camera, I was really liking it until I turned it on one day and the lens comes out only partially and immediately goes back in with the message \" Lens Obstruction\" then it just shuts down. I have not been rough with this camera, it has never been dropped, occasionally it will work say 1 out of 20 times being turned on. It is fully charged, appears to be completely undamaged, have tried compressed air. Has anyone else had this problem? I see most everyone who has a negative review too purchased about the same time I did, perhaps a faulty batch of cameras? Basically was great until it mysteriously stopped working .October 2,2011 Edit, My camera jsut completely stopped working, no turning on, nothing, completely unresponsive.", "Date": "July 12, 2011"}, {"Title": "love it", "Author": "aj", "ReviewID": "R3NXZONQ3D7T84", "Overall": "5.0", "Content": "I love this camera. It is easy to use. I still have not even read all of the owners manual. My 9 year old can even use this camera. The picture and video quality are great. I could not have asked for a better camera. The battery life is great as well. Have hours of videos and tons of pictures that I have shared. I bought this camera because my kids are into sporting events and the video I have taken of my little girl running the barrels and poles on her pony is priceless... Thanks Kodak for an easy to use camera that allows me to share my video with my family and friends.", "Date": "June 6, 2011"}, {"Title": "Great Camera!", "Author": "K. Ann Jorgensen", "ReviewID": "R1IEFS86LR1SM5", "Overall": "5.0", "Content": "This is the Best Kodak Digital Camera I've ever owned! It is Very easy too use and the 3 inch LCD Screen is Great! I like to pictures of my cat and Fish  55 gallon tank, and outside also!", "Date": "September 16, 2010"}, {"Title": "Does what it should", "Author": "Amazon Customer", "ReviewID": "R2GK6L9VDEO2N3", "Overall": "4.0", "Content": "I bought this exact camera to replace another Kodak digital camera that the shutter button quit working on.  It was more like a DSLR with a 10x zoom and more bulky casing.  About a year later I lost my first M580.  I was happy to find this one on Amazon.  The 8x zoom is pretty good for the price point.  I tend to lower the MP a little bit so that my pictures are more clear.  That may sound like a contradiction, but the higher resolution tends to be much more sensitive to blur when the subject of the photo moves (like my kids do) or if you don't have a steady hand (which I don't).  I was most impressed by the video ability of this little camera I am a teacher and go to grad school as well.  I had to video my self working with students for several of my classes.  The videos all turned out very nicely with good quality audio.  The camera has been pretty easy to operate and seems to hold a charge for a reasonable amount of time.  I use it about once or twice a week and my battery has been charged since February 22 (I am recharging it as I write this).  Overall I am pleased it didn't cost a lot, came with accessories I wasn't expecting (SD card and case), and does a good job.  I am still secretly wishing for a DSLR.", "Date": "April 17, 2013"}, {"Title": "Not bad", "Author": "DP", "ReviewID": "R3OHLOTAC1D682", "Overall": "4.0", "Content": "We paid 100 and for the price its not a bad camera, now a days it lacks some of the bells and whistles, but the picture quality is second to none.", "Date": "January 22, 2013"}, {"Title": "A great camera!", "Author": "Michael C. Loguercio \"Mike\"", "ReviewID": "RN75ZLVKDQM5S", "Overall": "5.0", "Content": "I bought this camera after looking at all the reviews on your website. I am glad that I bought it. i have two other Kodak cameras and have loved them as well. But the other two didnt have a microphone so when I did a video, it wouldnt have any sound. This one does , as well as other great features. I really like the 14 MP and the great zoom..pics dont come out blurry. i would highly recommend it.", "Date": "January 5, 2013"}, {"Title": "Pretty great camera", "Author": "MaoRanma", "ReviewID": "R10FUC15AQDFRI", "Overall": "4.0", "Content": "I don't know what everyone's issue with camera quality is, this camera takes some pretty nice shots, and even better ones if you know how to tweak your settings for what you're shooting.Also, this camera has an IR trigger port, but it's on the back? So I don't know how well it works, as I've not had any experience with cameras that have this feature.One good thing those is this has a tripod connection on the bottom. I had a Canon camera that had one too, but it was off center because of the battery weight on one side, so getting it to stand a certain way with my mini-tripod was a pain at times. This camera though has one directly center, and I have no issues at all working with it on a tripod.", "Date": "November 25, 2012"}, {"Title": "I took a chance....", "Author": "lovebird", "ReviewID": "RNU8TRPNR7ZKC", "Overall": "2.0", "Content": "I read  some of the reviews with lens problem, but thought I would luck out. NO!!!  I just brought this camera in 2011, I use it a few times and  loved it, it took great pics. I just went on my vacation so i was taking more pic and using the cam daily. the cam stop  focusing  and starting saying lens error and shut off. I tried doing the troubleshooting thing but gave up. So am back on Amazon buying another cam. the cam takes great pics but can't deal with the issues.", "Date": "August 26, 2012"}, {"Title": "don't buy this camera please", "Author": "Lalala", "ReviewID": "R2XRO1BQBRA503", "Overall": "2.0", "Content": "i hated this camera from the moment I bought it. If I could have only spent 50 more dollars I would have gotten a sony that would have lasted me more than this. first of all the picture quality is ridiculous, it is hideous and very blurry at times. when you see photos in your computer it gets really blurry when you zoom even a little bit. and if you like cropping photos then please don't buy this.  have had this camera for a year and it just died two weeks ago, the same \"lens obstruction\" thing mentioned on another review. plus i have had issues with it in the past, for a while it had this huge black mark in the middle of the lens which would come up in every photo. horrible camera, horrible pictures, horrible battery life. I have had a Fuji before, a Canon and a Sony and by far they were all better than this, especially the Sony (it was like the oldest model too, but took AMAZING pics). didn't think I would be back so soon looking for a camera! so now I am out here shopping again to look for a camera, and I'm definitely getting a Sony. Sorry Kodak. The only pro of this camera was definitely the color.ps. the picture quality on this camera was so bad that at my brother's engagement party i took a few photos, and then just put the camera back in my purse away in disgust at the image quality. i ended up using my cousin's 5 year long Sony which took amazing pics for such an important event in our lives. i was praying for this camera to break so I had an excuse to buy another one, so I'm kind of glad that it got ruined. If you're like me and pictures represent memories and are very valuable to you, PLEASE INVEST IN A GOOD CAMERA.", "Date": "May 25, 2012"}, {"Title": "pretty pink", "Author": "elizabeth lada morse", "ReviewID": "R3BZX9VIULV6V4", "Overall": "4.0", "Content": "I have owned (and worn out) 2 similar kodak cameras, this one has a couple quirks.  e.g. play back images flashes on screen then disappears.", "Date": "November 25, 2011"}, {"Title": "A lot of camera in a small package!", "Author": "Joyce M. Blodgett", "ReviewID": "R3H6BQ8N4V1O39", "Overall": "5.0", "Content": "Good lens and a very nice zoom in small camera.  Lots of sharing options.  Like the ability to point and shoot OR choose settings.  Got it to replace Easy Share which I liked that had met with a tragic accident.  Still learning what this has above that camera but so far I like everything about it.  Easy to handle.", "Date": "November 18, 2011"}, {"Title": "Kodak EasyShare M580", "Author": "Tracey Takemori", "ReviewID": "R2EYW7LYY4UAJB", "Overall": "5.0", "Content": "This is the second Kodak EasyShare M580 I've purchased as a gift.  They are very nice cameras for the money and take nice photos.  Especially like the 3.0 LCD on the back.", "Date": "July 5, 2011"}, {"Title": "is OK", "Author": "sweeperjohn", "ReviewID": "R2AS072CWPSI3U", "Overall": "3.0", "Content": "This camera did not perform as well as I hoped. It is not that much better than the 10 meg.,3x zoom camera that I have. The camera does work Ok, and takes good pictures.", "Date": "July 21, 2011"}, {"Title": "disappointed with outside pictures", "Author": "edu", "ReviewID": "R3IDAOXFEP32YB", "Overall": "3.0", "Content": "Works great for inside pictures but outside pictures are blurry.  Very disappointed take a lot of both inside & outside pictres.", "Date": "July 14, 2011"}, {"Title": "Kodak Easy Share M580 Digital Camera", "Author": "Suzanne M.", "ReviewID": "R2TD8SZFFU39ML", "Overall": "5.0", "Content": "I purchased this camera for my Granddaughter and she loves it. It has a lot of great features for her to use. She loved that it was a bright pretty color too.My only issue is the fact that I ordered it on June 2, 2010 and paid for(expedited) 2 day shipping and didn't receive it until June 7,2010. I was sure I would have it in time for her Birthday with 2 day shipping.  Very disappointing!", "Date": "July 4, 2010"}, {"Title": "loved it initially!", "Author": "Anabel L. Flaherty \"anabel flaherty\"", "ReviewID": "R3P6M8WK4SI9A", "Overall": "3.0", "Content": "This camera is easy to use, small and travels well.  It took great pictures for the first few weeks then just stopped.  Thanks to Amazon for making things right!!", "Date": "November 11, 2011"}, {"Title": "Kodak is the best for me", "Author": "marge matthews", "ReviewID": "R1FLWEO4YHDBTQ", "Overall": "5.0", "Content": "I have had different Kodak digital cameras for over 20 years.  I tried another brand this time similar to the Easy Share M580.  I ended up sending it back and bought the M580.  It's a great overall camera.  Very easy to use and download.  I will not \"stray\" again!!!", "Date": "August 6, 2011"}, {"Title": "Price change from email", "Author": "Kindle Customer \"crw80\"", "ReviewID": "R1PICYSS9ZBE5X", "Overall": "1.0", "Content": "Got an email from Amazon with a $89.26 price, when I add to the shopping cart its $94.  Bait and switch? I was ready to buy it and even $94 is not a bad price, but Amazon or their parters switching the price does not make me want to buy from them", "Date": "July 9, 2011"}, {"Title": "great camera too bad amazon sucks", "Author": "Momof61977", "ReviewID": "R2ZD6WOE2IIXOL", "Overall": "4.0", "Content": "This is the best camera ever! ITs quality is 100% all around. The only thing that ever worried me about it was the zoom it seemed like it took a minute to extend all the way so that made me worry it was going to break or stuck and it did Kodak fixed it though because it was still under warranty. I bought my camera from Beach Camera they are a seller on Amazon but I bought it from them off ebay, Amazon charged me 5 times for this camera that I ordered once and wanted to charge me again......it was ridiculous. I dont think Amazon has any clue what they are doing. I used my debit care and they caused me to go into the negative. I hate Amazon and the fact that they dont train their employees correctly is disgusting. Anyhow if you buy this camera you will be pleased but buy it directly from Beach Camera or Kodak. Beach Camera sells it cheaper than anyone else on Amazon by the way.", "Date": "August 14, 2010"}, {"Title": "EasyShare not so easy.", "Author": "C. Caballero \"Gadget girl\"", "ReviewID": "R3V85B8EQHVQRX", "Overall": "2.0", "Content": "This camera claimed that it could share to Facebook, Flicker, YouTube, email, etc. but it will only do it when you have it plugged into your computer. For that I can do it myself. The zoom was slow and you have to push down very hard on the button for it to work. The buttons at the top also won't work unless you apply a lot of pressure. The screen is nice but the pictures came out a little too dark in broad daylight. No worth it. Sending it back and going back to my 3 year old Panasonic Lumix that takes way better pictures.", "Date": "April 27, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14-megapixel resolution for stunning prints up to 30 x 40 inches\n8x optical zoom; 28 mm wide-angle lens\n3-inch LCD with KODAK Color Science Technology\nKodak's Smart Capture feature\nCapture images to SD/SDHC memory cards (not included)", "Name": "Kodak EasyShare M580 14 MP Digital Camera with 8x Wide Angle Optical Zoom and 3.0-Inch LCD (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41OK3XGDMzL._SX300_.jpg", "ProductID": "B0031RGGBG"}}