{"Reviews": [{"Title": "better than I expected", "Author": "D. Wright", "ReviewID": "R1CZGWPBY6BGS4", "Overall": "4.0", "Content": "I bought this camera on an impulse because it was cute and THEN I started reading the reviews (usually I obsess over reviews for weeks before I buy something). I have to say, after reading some of the reviews, I started regretting my purchase before I ever got it but then, it arrived. Since I have only had the camera for a day, I'm sure I'll have more to say about the it after a few weeks of use but I have to say, so far, I am pleased. If you tweak the settings a bit(ISO, flash and program modes), you get a pretty decent picture and it seems like its pretty fast too(which could be in part because I have a higher class memory card and am using a lower mega-pixel setting than the default 12). I think I'm going to enjoy my purchase, far more than other reviewers say I am supposed to. Which is a shame for them, but great for me and my cute little \"impulse buy\" camera. I'm excited about my I-10", "Date": "August 31, 2010"}, {"Title": "Loved the look and form factor; the images, not so much", "Author": "J. Wilensky", "ReviewID": "R2XO5XNSO9P70V", "Overall": "2.0", "Content": "Wow, I wanted to love this camera ... the aesthetics/design got me as soon as I saw the first images released back in January. I have enough old Pentaxes (including an Auto 110 Super) to really appreciate the retro look, styling and old-style logo. The form factor was actually quite nice, with a good balance, small but really nice right-hand grip, and a pleasant grippy texture. It was a bit light (plasticky) for its size.But the picture-taking experience -- slow, slow, slow, at least by 2010 standards. I think the 2004 PowerShot I have is faster. Flash photos were terribly slow because of the preflash, which seemed to add an extra second and a half to the process. And images were soft overall, but softer as you zoom anywhere near the telephoto end. Noise and speckling was apparent at nearly all ISO speeds. As far as positives about image quality, in bright daylight, at 80 ISO (the sensor's base speed), images weren't bad and the lens did show good flare resistance.Videos were technically HD, but at quality poor enough that it didn't seem to be worth the higher spec. Zoom in video mode is only available as digital zoom, which degrades image quality immediately.Sliding battery cover was very fragile and seemed prone to become misaligned and I was very, very careful with it; I would always worry about its durability.I didn't get to check out any of the really fancy features like pet face recognition. Human face recognition seemed to work reasonably well, though the photos weren't necessarily better exposed because of it. In fact, basic flash photos/snapshots seemed washed out, with very muted colors.All in all, a very big disappointment. I knew it had fairly average camera specs (fairly run-of-the mill point-and-shoot specs for a 2010 p&s;) with a cool design, but the photo quality was such a step backward from anything else I'm using today that I had to return it.", "Date": "March 21, 2010"}, {"Title": "Great camera for a Great price", "Author": "AutumnNoel", "ReviewID": "R2S2J7XEVEZAGA", "Overall": "4.0", "Content": "ok, I love this camera. I was debating for quite a while whether I should get it or not based on the mixed reviews it had. Personaly I love it. First off, I love the way it looks, more importantly I love the pictures it takes. The pictures are great. Never blurry, no red eye, crisp and clear. I own a canon slr so I wanted something of good quality but small and light. I love the interface of the camera, the menu setup etc. Very easy to navagate. The camera itself and the software it came with have some very cool features that I love. The quality of pictures zoomed in are not so great but never are with a point and shoot. The video is good. Basically this camera is a great value for the price on amazon. I dont think it would be worth the original 300 something dollar price tag but for the hundred dollar range it has now it is well worth the price. I recomend this camera to anyone looking for a simple point and shoot that takes good pictures.", "Date": "March 4, 2011"}, {"Title": "Cool looking but incredibly noisy pictures.", "Author": "Constance Moore", "ReviewID": "R3L8HQ7NJDEX07", "Overall": "2.0", "Content": "I bought this camera sight unseen.  I liked the look and the fact that it had just hit the market, figuring it would have the ability to take a good picture was a given.  I Do not consider megapixels much when considering cameras, so the fact that the I-10 had 12 megapixels does not mean much or figured into my decision to buy this camera.  I just want a smooth looking picture from a camera that fits in my pocket.  The I-10  is small so fitting into the pocket is easy.  So one star for size.  I like the style- the retro camera shape, the white paint, off white textured \"vinyl\", another star.  Where it does not get any stars-Build quality is one one word cheap, but mostly the I-10 does not get stars for the reason it exists to take a nice picture.  The imager is noisy and the lens lacks any sense of sharpness.  The price of this camera is around $299.00 if it were $99.00 the picture quality would not be so surprising, but at $299.00 I expected better.  Very Disappointed.", "Date": "March 5, 2010"}, {"Title": "Perfect for my purposes!", "Author": "Thomas C. Nagy \"Music Teacher\"", "ReviewID": "R1YGZFJ27ZCMVH", "Overall": "5.0", "Content": "I bought this camera to photograph my family events and my art work.  All aspects of this camera are terrific.  It is a camera that offers more features and specs than many cameras at twice the price.  Its best feature, however, is its portability!  No more lugging large SLR bodies, or larger point-and-shoots.  I can carry this around in my pocket!  Another remarkable features is the battery life.  I can go weeks without a charge.If you are looking for SLR quality photos, then buy SLR cameras.  If you are looking for a portable point-and-shoot with great features and very high quality photos, then buy this camera.  You won't regret it.", "Date": "June 25, 2010"}, {"Title": "PENTAX OPTIO i-10", "Author": "therickyandco", "ReviewID": "RM9Y0DZRZBM78", "Overall": "5.0", "Content": "When i first bought this item i wasn't sure about the brand because i didn't know it but once i got it i was happy the only problem is the video is not HD and some pictures have a lot of noise i consider those the only two problems on a scale 1-10 i go for 8.5", "Date": "November 14, 2010"}, {"Title": "Pentax I-10, very happy with it, and the remote feature ROCKS !!!", "Author": "Davyo", "ReviewID": "R2VKTTOTDNXMNM", "Overall": "5.0", "Content": "I was in need of a camera that can work with a remote shutter release and didnt want to spend a ton of cash on a high end camera just to have the remote feature.In my search for a cheaper camera with a wireless remote I found out Pentax is about the only brand that offers a lower priced camera with a remote shutter release feature.In spite of some of the negitive reviews I ordered the Pentax I-10 here on Amazon, got it for around $85.00, the IR remote was about $12.00,, I figured how could I go wrong at that price,,, and I didnt.This is my first Pentax (I have owned every other brand of digital cam except Pentax),, my opinion,, I think this cam takes very good pictures, it looks cool and the menu is very easy to navigate.Anyhow, my main reason to buy the Pentax was for the IR remote feature,, to my suprise the Pentax also takes pretty good pictures,,, its a keeper !!!CheersDavyo", "Date": "March 23, 2011"}, {"Title": "Nice little camera with great form", "Author": "Ashley Schwebel", "ReviewID": "R213RIP9T8E95N", "Overall": "4.0", "Content": "I wanted something small, that I could shove in my pant pocket or bag, I wanted it to be cheap with decent enough specs and most importantly in a world of a thousand compact digital cameras-- something that wasn't generic looking. This was the first cameras I saw, and it caught my eye and I would've bought it right then and there but I felt that I should look around because I wasn't in the mood to be impulsive. But after browsing the internet for hours and reading a thousand of reviews with the exact same conclusion (side note, they should really expand the number rating system on this websites because everything ultimately ends up being a three or four)I ultimately bought this, sight unseen and still somewhat unsure. But with the exception of just a few nitpicky things(see below) it was exactly what I was going for. I had it in my front pant pocket while bike riding the other day, it was cheap, good looking pictures and cool to boot. And below are some more technically things and whathaveyou that hopefully will make this rambling review more helpful.Good things:-Small-Lightweight-Rechargeable battery (as anyone who ever has has a camera that takes AA batteries knows, this is clutch)-Cooler than friend's canon powershot-Easy to hold-Auto Focus assist lamp(its pretty nifty)Nitpicky Things-This might just be me as more than anything I'm into how things look but the mode menu screen made me sick--it was too user friendly-It took a decent amount of seconds between pressing the on button and the camera actually being able to take a picture-The on button is in an awkward position...its a little hard to reach even with my skinny fingers-The battery door is opened accidentally with a decent amount of frequency", "Date": "April 19, 2011"}, {"Title": "Very well could be a five star, fantastic point and shoot!", "Author": "Christopher J. Foxley", "ReviewID": "R2JGMOCK88VRVX", "Overall": "4.0", "Content": "This camera feels like one should. It's light, has a big screen, all buttons are in good places and your hands don't cover up any essential components.  I also really like the positioning of the flash, it's where an eternal would be (on top of the lens) and this also means less likely to cover with your hand.  Has a myriad of cool features and shoot modes, and menus are very simple (mostly pictographic) and easy to use.Also very impressed with the lens, flash, and shutter speed.I just got it today, and am excited to break in the IR remote and Eye-Fi features, very impressive for its price point.Might not be the camera I travel around the globe (It feels pretty plasticy) with but I can see this being a regular companion to events, nights on the town and just general day to day life.", "Date": "March 9, 2011"}, {"Title": "Pentax Optio I10", "Author": "justimagine", "ReviewID": "R1GC9ZZO97IF0R", "Overall": "5.0", "Content": "Great camera for a point and shoot. Didn't expect it to compete with a digital SLR but gives great color saturation and its multiple modes address all my needs.", "Date": "January 21, 2011"}, {"Title": "Pentax Forever", "Author": "Russell49", "ReviewID": "R1EUM1S7GW2X87", "Overall": "5.0", "Content": "I have been a Pentax user since the 1970's when my wife purchased my first camera as a surprise birthday gift. Since that time I have accumulated 12 Pentax models over the years. I have never been disappointed with the quality of the cameras and this particular model is great, and easy to use.", "Date": "January 29, 2011"}, {"Title": "Pentax Option I10 Digital Camera", "Author": "CT0123", "ReviewID": "RLAJGXM715ZLP", "Overall": "5.0", "Content": "Mom bought this using my amazon prime account and she loves it. The color (black), design/shape and usability are all up to par if not better than the older Pentax digital point and shoot cameras.", "Date": "August 31, 2011"}, {"Title": "just got it", "Author": "just got it", "ReviewID": "R3FWSVDIKXVMX8", "Overall": "4.0", "Content": "i just got a classic black Pentax Optio I10so, very, too prettybut i was expecting it to be little bigger than the sizebut but but i love it :)))", "Date": "May 6, 2011"}, {"Title": "My Little Pentax", "Author": "C. Mailes", "ReviewID": "R2KX56P6HJKV5S", "Overall": "4.0", "Content": "It's a good little camera, easy to use and very small so it fits into a pocket easily. I've only had it a couple of weeks so it hasn't been used all that much, but being a Pentax I'm sureit will be great. I only have Pentax cameras, and I will use this one for quick shots or when I don't want to lug my large SLR around.", "Date": "April 19, 2011"}, {"Title": "Very pleased", "Author": "C. Graham \"art buff\"", "ReviewID": "R1EPU5UIZN5VLQ", "Overall": "4.0", "Content": "After reading some not so great reviews on Amazon, I was nervous about buying this camera. For under $100, this is a great point and shoot. I wish it had more manual options, but it has enough features to make me happy. It's not a perfect camera, but it shouldn't have to be at this price. It's also very small, which is nice, but I do worry about the thin plastic door over the battery and memory card falling off. Be gentle with it. Overall, a nice camera.", "Date": "April 14, 2011"}, {"Title": "Decent Camera at this price", "Author": "Rohit", "ReviewID": "R2RJEKTE9DVBZY", "Overall": "4.0", "Content": "Overall this is a good camera for the give price and takes good pics in outdoors and a bit okey pics indoors. But all in all takes good pics 5x optical zoom.... the design is nice very different.... I liked it and will surely recommend it....", "Date": "February 28, 2011"}, {"Title": "Great little camera", "Author": "SteveD \"Steve\"", "ReviewID": "R3RHD3M62FE2FW", "Overall": "5.0", "Content": "For the price, It has great IQ and fits easily in the pocket.  The macro capabilities, i.e., close up, are especially good.", "Date": "January 9, 2014"}, {"Title": "Great for the price", "Author": "sound8", "ReviewID": "R16763JD4YZUYU", "Overall": "5.0", "Content": "I purchased this on Amazon for $34 as a used item, and it turned out to be fantastic!  If you can find a price even close to that, buy it.  I was just looking for a simple point and shoot as I have plenty of great lenses for my Pentax K-5, K-30, and K-01, but for the price this camera is phenomenal!Love it so far!", "Date": "April 22, 2013"}, {"Title": "cheap and ok", "Author": "Derry", "ReviewID": "R2CVNXWAWQ454C", "Overall": "4.0", "Content": "cheap and good. i will recommmend it to my friends and family and . . . . . . .", "Date": "January 11, 2013"}, {"Title": "like it", "Author": "villy", "ReviewID": "R38J1TUEOSBGUZ", "Overall": "4.0", "Content": "I really like the camera.  My only gripe is with the battery charger that was provided.  It never worked properly.  I like Pentax cameras.", "Date": "January 12, 2012"}, {"Title": "So far so good!", "Author": "ADE OMI", "ReviewID": "R1LTIMBGFQBMW6", "Overall": "4.0", "Content": "The camera is super cute, but that really is besides the point.  It can zoom into really tight images from about 10 ft away and take clear pictures.I haven't uploaded images yet or printed, but so far so good.  I love pentax so I'm sure the images will be great.  The interface makes it very easy to change settings so that you can get the desired effect, and you don't have to be a techy to take a good picture!", "Date": "February 26, 2011"}, {"Title": "Cute design, subpar performance", "Author": "garabaldi", "ReviewID": "R2YH8YXXZVXCPC", "Overall": "3.0", "Content": "The camera is actually very tiny, it's probably smaller than the Canon powershots which was a bit disappointing. The camera is almost entirely plastic and has a cheap feel to it. It's very light compared to my Canon which has an metal body. Mine actually arrived with two dead pixels which was very annoying so it made the playback quite difficult considering it's already a small screen. I returned it and I'm hoping the new one I receive doesn't have any dead pixels. I had a chance to look a few features and can say that this is more of a fun camera. It's not for taking serious pictures with high resolution, stick with Canon for that. This camera is loaded with digital features such as toy camera, vintage inspired looks, those are the only major pluses in addition to the design.", "Date": "March 15, 2011"}, {"Title": "Could be better", "Author": "Rivadeneira Luis \"Luis Rivadeneira\"", "ReviewID": "R3MNWQ0GXJ451A", "Overall": "3.0", "Content": "I expected a little more from Pentax. This was a $250 camera when it was released and the price dropped to less than $100 in around a year. This is not a bad camera but it is not worth $250. For the price I paid I'm satisfied, it is about the same quality as a Casio with similar specs but looks nicer. The quality of pictures and video is very decent, nothing more. The position of the tripod mount is not a big problem considering how small this camera is, it is barely bigger than the tripod head. Very portable and very easy to use.", "Date": "March 15, 2011"}, {"Title": "Pentax", "Author": "Michelle Littleton", "ReviewID": "R29A99MZOUMCJ3", "Overall": "5.0", "Content": "The item is just what I was looking for. It arrived promptly and as described. I got a great deal and am very happy with it.", "Date": "December 16, 2010"}, {"Title": "For the price is OK", "Author": "Tay Arreaza Ch", "ReviewID": "RTOU5ZYNZD8BT", "Overall": "4.0", "Content": "For the price is a good camera, but i was looking for a better quality, i bought this to try if it was good, is not bad but i gave it to my mom and i bought a Olympus more expensive.", "Date": "June 20, 2011"}, {"Title": "Indoor image quality is low", "Author": "Frank Han", "ReviewID": "R6WFWZ91Q6XQ9", "Overall": "3.0", "Content": "I've had this camera for a few weeks now.  I haven't taken loads of pictures, but I've taken enough to see that the image quality is lacking.  I have some outdoor shots that look nice.  But indoor shots all seem blurry, fuzzy, lacking in crispness, whether with flash or withoutHaving only paid about $100 for this, this may be a camera I give to my 11 year old.  Was really hopeful, as I love the size/weight combination.  But the images are not good enough for this to be our family camera.", "Date": "May 31, 2011"}, {"Title": "Pentax Camera", "Author": "TerryS", "ReviewID": "RSI7PNVCLDM93", "Overall": "5.0", "Content": "Purchased from digideals.  Delivered when promised.  Camera has a lot of features that are found in more expensive cameras.", "Date": "March 26, 2011"}, {"Title": "A Great Camera", "Author": "Bradley S. Anderson", "ReviewID": "R17W5KLP8812CF", "Overall": "5.0", "Content": "This is a wonderful camera with some creative features. I love it and it takes great pictures with ease.", "Date": "March 30, 2010"}, {"Title": "A Good P&S;", "Author": "T. Walquist", "ReviewID": "R227EJQMHM7LAW", "Overall": "4.0", "Content": "This camera is everything it promises to be. It takes pretty solid images, especially for a point and shoot, and is easy to navigate. The retro look doesn't disappoint in real life, though it makes the camera less sleek than its peers.The only reason it didn't receive five stars from me is that it arrived broken; the zoom lever wasn't properly connected. I don't know whose fault that would be, but it was a minor inconvenience. It's currently being repaired at Pentax, and I look forward to using it when it returns.", "Date": "August 16, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.1 megapixel CCD\nWide-angle, 5x optical zoom lens (28-140mm equivalent)\n2.7\" LCD display\nClassic styling in an ultra-slim design\nTriple shake reduction technology includes a mechanical sensor-shift mechanism, digital Pixel Track SR & Movie SR", "Name": "Pentax Optio I10 12.1 MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch LCD (Pearl White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41OND0EnCnL._SX300_.jpg", "ProductID": "B0035LBMAS"}}