{"Reviews": [{"Title": "Inexpensive quality", "Author": "D. Spinella \"DaculaDom\"", "ReviewID": "R21Y7QCH6TTGNC", "Overall": "5.0", "Content": "Although this camera has a few quirks, after a brief introductory period and the purchase of an SD card, my wife loves it.Why I bought it: This camera was a gift for my wife who has a very nice camera (a Sony about a half-step below a professional camera) which she uses most of the time.  She wanted something small that she could stick in her pocket for those spur of the moment occasions that crop up at children's school parties and such.  This camera fits the bill.It easily fits into her pocket (either shirt or jeans), takes high quality photos, has numerous optional settings, and with an 8 GB SD card has room for over 2000 photos at the highest quality settings.  It takes AA batteries, so there is no \"I forgot to charge the camera\" issues.Quirks:1) The first quirk is the way the camera reacts when its memory is full.  This is simple to do if you don't buy an SD card immediately.  The camera defaults to the highest MP setting (12) which allows about four or five photos on the camera memory.  Then the camera displays a message saying that the memory is full.  Ours also seemed to have a hiccup the first time it happened and we had to turn it off and turn it back on using the play button on the back of the camera.  After this, the camera was fine.2) The batteries.  This camera uses AAs.  I have heard arguments against this, but my wife and I prefer this feature.  Our reasoning is simple: if the batteries run out, almost every store on the planet carries AAs.  We can walk into any of them and buy more.  You can't say the same if you forget or use all of a proprietary battery that is unique to a specific camera.  For the eco-conscious, you can still use rechargeable batteries, they are just going to be rechargeable AAs.3) Snap-time.  I don't even know if that's a term, but it describes the issue fairly well.  This camera takes a while to capture the photo.  While this is a bit annoying, the wait seems in line with most of our friends' and families' cameras.  I have only witnessed one camera not have this issue and I know for a fact that one cost over $3,000 (i.e. a bit out of our budget.)NOTE: There may be a setting that changes this that we have not found yet.Overall: we have had a very good experience so far with the camera.  We are extremely hopeful that this will continue.", "Date": "December 21, 2010"}, {"Title": "Great pictures, but not reliable", "Author": "Truth Seeker", "ReviewID": "R2PNGJNMTC21JN", "Overall": "2.0", "Content": "After reading mixed reviews, we chose to order this camera due to the low price and seemingly comparable quality to other 12mp cameras.  After receiving it very promptly, it worked well for the first 2 days, as others mentioned and then decided to suddenly turn off with the lens stuck out.  We tried changing the batteries and pushing the power button several times, but nothing worked.  We set it down and hours later, the lens had retracted and it worked again.  I told my daughter if it happened again we would return it.  Within 12 hours it did exactly the same thing with the lens again stuck in an out position and no buttons would work. All of this is very sad because the picture quality is excellent.  We were at my brother-in-law's wedding and lost a lot of shots because of the lack of dependability.Hopefully Polaroid will address this issue, because if it weren't for the camera shutting down, I would highly recommend it!  It isn't happening to everyone who buys it, since some of the reviews don't mention it, but enough that it is cause for concern...Regarding the return, it was very simple and Amazon is paying the return shipping.  I highly recommend ordering through Amazon!", "Date": "January 3, 2011"}, {"Title": "Nice for the money. Sharp pictures.", "Author": "Breck A. Honeycutt \"Luvfpitch\"", "ReviewID": "R30WYAU5OCSOY0", "Overall": "5.0", "Content": "The pictures from this camera are very sharp and for the money can't be beat. This camera comes with software cd, 2 duracell ultra AA batteries, and usb cable. All that is needed is an SD card for picture storage. Night pictures with flash and anti-shake look very clear and detailed. Can't say enough about this camera's features along with Amazon's price of roughly $50.", "Date": "December 11, 2010"}, {"Title": "THIS MAY HELP", "Author": "TANDRAT", "ReviewID": "RV5B1VR3OVFYH", "Overall": "4.0", "Content": "I read the reviews before I ordered this camera, there were some good and bad, but the bad had me concerned, but I ordered it anyway and sure enough it dit just what the negative reviews said.  It took one test picture and shut off and didn't come back on.  It came with Duracel batteries so I thought they were pretty good batteries so surely that wasn't the problem, but it was.  I bought Energizer Lithium batteries and the camera came right on and I've been taking pictures all day long.  I also ordered a 4gb memory card along with the camera so I would have enough memory to take lots of pictures.  So please don't be afraid to buy this camera, just be sure to have lithium batteries to put in it.", "Date": "February 4, 2011"}, {"Title": "Basic Digital Camera, worth the price", "Author": "Denis P", "ReviewID": "R191YNWECIJJI6", "Overall": "4.0", "Content": "This camera can be a nice, inexpensive option for the casual user. I had read the reviews posted prior to purchase and wanted a backup to my two smartphone cameras (IPhone and IPod) for use when traveling. I installed the batteries with the camera and began taking some test shots. No sooner than my 4th or 5th shot, the camera stopped working. After replacing the batteries and installing an SD card, I tried again and the camera worked perfectly. Clearly, any buyer should begin use with a memory card (of any capacity) to allow for adequate storage and with fresh batteries.The test pictures were printed using your basic (CVS) service and even with enlargement, I was moderately impressed with the quality of the print.So the two steps a new user should follow are:  1. replace the batteries included with the camera with fresh high capacity batteries and  2. use a memory card immediately before use.", "Date": "January 8, 2011"}, {"Title": "Awesome little camera!", "Author": "tearstainedrose", "ReviewID": "R3GSP4TV9IG934", "Overall": "5.0", "Content": "I bought this camera mainly to take pictures of my daughter. I wanted one that would take good clear photos without breaking the bank. This camera does that. the pictures are great and it's easy to use. it has some good features and settings. Battery life is great.  I would highly recommend this camera, especially to parents.", "Date": "June 9, 2011"}, {"Title": "Very Professional Features!", "Author": "Robert Gamble", "ReviewID": "R1MWKE17YI8CSS", "Overall": "5.0", "Content": "It was unexpected when I started using the camera to find that it has many professional features. Unexpected because it's call a \"Point and Shoot\". But the list of features includes everything for fully automatic, to being able to adjust every photograph setting. I'll use the automatic setting for now, but being able to adjust things as needed will be useful.", "Date": "December 19, 2010"}, {"Title": ":(  Takes nice pictures when it decides to work!!!", "Author": "Curlygirliediy", "ReviewID": "R1UQ7SAJ21YWLL", "Overall": "2.0", "Content": "I had high hopes for this camera when it arrived today, unfortunately for me the one that I ordered is crazy! The first few times I pressed the power button it would not turn on. After finally getting it to come on I tried taking pictures with it, during the first shot the camera cut off and I couldnt get it to come back on. The camera comes with 2AA duracell ultra batteries and the display showed that it was full when I got it to come back on. I wished I hadnt desired to save money since at the time there was another camera on sale for about twenty more bucks. I had found another of these when searching similar items that is about the same price but after checking targets(the seller) website for reviews I found one in which a reviewer had the exact same problem I am having and theirs ended up with the lens stuck out and useless after only one week, until I read that I had considered giving this one until my birthday at the beginning of the year to act right before returning it. I still may try the one from the different seller since maybe its possible I happened to buy one of the defective ones, fingers crossed because I have the pogo and thought another poloroid product would be the best paired with it. Finally got my 5 pics off the camera and I must say it does take excellent pics which is why I gave 2stars Switching to record mode for the first time is a bit tedious but once you have done it once you can press the scene button which brings up a mini menu where you can choose recent settings and it will be in that menu. Still sad I have to send it back", "Date": "December 23, 2010"}, {"Title": "Not Reliable", "Author": "Bryan", "ReviewID": "R30DPTBT47XRVJ", "Overall": "1.0", "Content": "I recently bought this model of Polaroid for my daughter and it broke almost immediately. After searching online, it is a common malfunction. When I contacted Polaroid they said it would be under warranty for a year and had me go buy special batteries and try other stuff. When none of that worked they denied my warranty. I wont be trusting Polaroid for digital cameras or I will at least review the model THOROUGHLY online before purchasing.", "Date": "March 18, 2011"}, {"Title": "DO NOT PURCHASE", "Author": "D. Borak", "ReviewID": "R1SODO5RKSCZWZ", "Overall": "1.0", "Content": "I don't write a lot of reviews, but this camera is so awful, I felt the need.  It stopped turning on after 3 months of use.  Polaroid won't allow it to be returned since I purchased it from an Amazon seller - not an authorized seller, they say.What a piece of junk.  My advice would be to not buy this camera or anything from Polaroid.", "Date": "March 21, 2011"}, {"Title": "Broke in 7 months", "Author": "CJ", "ReviewID": "R3JCGH9USHEPOJ", "Overall": "1.0", "Content": "Santa gave this camera to my daughter for Christmas just 7 months ago.  Today, while taking the batteries out to replace them, two small screws came out as well.  We cannot find where the screws came from and the camera no longer works.  I only hope that Polaroid will replace the camera, but I have my doubts.  It's a cute camera and the price is perfect, but you would certainly hope a camera would last more than a few months.", "Date": "July 27, 2011"}, {"Title": "Broke after a month", "Author": "Stina J.", "ReviewID": "R3TCFT15LTTRVT", "Overall": "1.0", "Content": "This camera took pretty good pictures for about a month, but then it broke.  I think the mechanism that slides the lens forward is stuck because when we try to turn it on, the display lights up, the camera makes a few honking sounds, and then it shuts down.  Although it does take movies, it's a pain to switch to video mode.  The video option is the last item under a settings menu that has multiple pages--if you don't know there are multiple pages, you might never find this option.", "Date": "July 23, 2011"}, {"Title": "Don't Waste Your Money", "Author": "neobahamut101", "ReviewID": "R335K58VIGHZG5", "Overall": "1.0", "Content": "Don't even bother with this camera, it was nice and worked good for about 3 days and after that it started slowing down. It would take the pic and then take like 10 seconds to show on the screen, and since it has gotten slower and slower. Now I was just taking pictures and the pic never popped up on screen, and it won't shut off turn on or anything. It has brand new batteries and has barely been used,I tried changing batteries and everything. The lens is now stuck out won't turn on or off. Complete crap DON'T WASTE YOUR TIME OR MONEY", "Date": "September 12, 2011"}, {"Title": "good so far", "Author": "tommy leung", "ReviewID": "R2J7P4D1M4RFDS", "Overall": "3.0", "Content": "I bought this camara from another website which was a package that included the pogo printer as well for a very good price. I mentioned this because after reading the reviews here I was a little hesitant but the price was too good to resist and decided that it was worth the risk. In the end I figured if the camera didn't work then I would at least still have a nice little photo printer.I would like to address that I didn't have the lens problem that other reviewers had mentioned of. That's not to say that the problem does not or couldn't exist. To be on the safe side I registered my products right away with polaroid.And after browsing through the manual I am pleased to find out that there is options to shoot video as well as take pictures in hd quality. 16:9 aspect ratio to be more specific. I have not tried it but it's nice to know that it's there. I can however say that the settings and adjustments are there for anyone who is willing to take the time to go through the manual to get a handle on the features. And yes they do make a difference as I noticed just by taking three of the same pictures in my room but under different settings.In all I would say that this camera has enough features to rival if not beat the other mass marketed digital cameras that you would find at costco, walmart, target etc. Don't be discouraged by the so called lens problem that the other reviewers have stated had happened. To counter this just make sure that you are getting a sufficient warranty wherever you purchase it from.", "Date": "July 9, 2011"}, {"Title": "Blurry pictures", "Author": "Mark Sobkowiak", "ReviewID": "R2E47NNTHVVWNM", "Overall": "2.0", "Content": "This camera was cheap enough....but took blurry pictures and was hard to figure out all the operations....I would spend twice as much and get a better camera without issues.", "Date": "January 22, 2011"}, {"Title": "Same problem as other reviewers!", "Author": "tacojohn33", "ReviewID": "R3IWWJ39TLC8PJ", "Overall": "2.0", "Content": "I agree that this camera takes good pictures and I was really happy with it for about 3 days. Now I am having the same issue with not being able to turn it on. It will work every once in a while at random, but for the most part, it doesn't even come on with brand new batteries in it. If it does, it shuts off in the process of taking a picture and now mine also is stuck with the lens out. Not sure how to get it back in, but I guess if I can't I will be returning it that way.", "Date": "December 25, 2010"}, {"Title": "Use only NiMH rechargeable batteries", "Author": "Steven Whitney", "ReviewID": "RJOPQ1TQQH5IL", "Overall": "5.0", "Content": "I like this camera very much. It is my first digital camera. It was sent to me as a gift, purchased at Amazon.Because of its lackluster customer reviews, I probably wouldn't have selected this camera myself, and would have missed out.The features I've found most useful:Very good user manual. Because this was my first digital camera, I studied it for several hours. There are many settings options. I found that they became intuitive surprisingly quickly, and they're organized into a menu structure that also became intuitive with a surprisingly short amount of practice.It uses standard rechargeable NiMH AA batteries, not a proprietary battery pack.Tripod mount. I use a tripod whenever possible, and am getting amazingly sharp crisp pictures with very good color.Large bright LCD display with intuitive readable layout that can be set to show all the important settings currently in effect while composing a shot.The flash is very bright and is wide-field, so I've had no problems with insufficient coverage of the area in a shot.Configurable sounds.The Programmed exposure mode (P) works well for most conditions. (I was less satisfied with the completely automatic AUTO (A) exposure mode.)Macro focus works well.There is a Manual (M) override for the exposure settings, which I've found interesting and useful.The center-weighted light metering mode is very good.Auto-Focus works very well. I have its mode set to Wide.Depth of field is surprisingly good under all conditions so far, even though the camera's aperture range seems quite narrow compared to SLR film cameras. Maybe that's normal for digital cameras.Using only the internal memory (no separate memory card) and with JPEG compression set to Normal, I'm getting about 28 photos at 3 megapixel size before memory is full. It says it holds about 9 12-megapixel photos, or 118 640x480 photos, but I haven't tested those settings.Battery \"problems\"The camera came with two Duracell Ultra alkaline batteries dated 2016, 4 years in the future. I put them in the camera, turned it on, set the date and time, pressed OK, and that's as far as I got. The camera turned itself off because it thought the batteries were exhausted.It appears to me that you simply cannot use alkaline batteries in this camera (in spite of their being provided in the package), even if you set the battery mode to Alkaline. They cannot deliver the current surges required by this (or probably any) digital camera.For a couple of days, I used some Energizer NiMH AA's that I had, but only got about 9 flash photos per charge because they were old.With new Duracell 2450 mAh NiMH rechargeable batteries, I've got at least 100 photos so far (most of them with flash) on a single charge and haven't exhausted the batteries yet.Moral of the story: if you don't have high capacity NiMH rechargeable AA batteries and a charger, get those items at the same time that you purchase this camera. You'll need them.I thought I should mention that because some of the customer review complaints have been about an apparently dead camera, and I have to wonder if the batteries might have been the real problem, considering that the only thing I was able to accomplish with the provided batteries was set the date and time.When I searched Amazon to see what other camera I might have chosen for myself instead of this one, I couldn't find anything I would be confident about liking better than this one, especially at anywhere near the price of this one.", "Date": "January 22, 2012"}, {"Title": "Sadly disappointed", "Author": "sayit", "ReviewID": "R12IZHDTNGOZU5", "Overall": "1.0", "Content": "This canera takes one picture and then quits working. If I take out the batteries and re-install them the camera will take another picture and then quit working again. The batteries are new and show a full charge on the battery icon. I am very disappointed with this camera and feel I wasted my money.", "Date": "June 6, 2011"}, {"Title": "Best $50 camera I could find!", "Author": "GarrettNE", "ReviewID": "R2J44FT95PQUUR", "Overall": "5.0", "Content": "I've only had the camera for a month, so my 5 star reliability rating has no backing. However, the look, feel, and ease of use on this $50 camera are excellent. I didn't even read the directions, I just surfed through the 2 menus for about 10 minutes and now I know how to use every feature. Also, I've never seen a 12 megapixel camera for just $50...Do to all of these things, I have no problem rating the product as 5 stars.", "Date": "May 18, 2011"}, {"Title": "Great Camera", "Author": "Katy", "ReviewID": "R24TYDI1ZB4CW3", "Overall": "5.0", "Content": "The anti-shake feature on this camera is awesome. Anyone can use this camera, from 5 years old to 105 years old! I wasn't able to take a decent picture with other cameras that I tried because my hands shake all the time. This camera captures images so beautifully! I even let my 6 year old take pictures and his were equally wonderful. Make sure you put in a extra storage memory card, because you won't want to delete any of your pictures!Polaroid CIA-1237RC 12MP CCD Digital Camera with 2.7-Inch LCD Display (Red)", "Date": "April 18, 2011"}, {"Title": "Not reliable", "Author": "Daniel Kiser", "ReviewID": "R3GK9887BLEIM9", "Overall": "2.0", "Content": "I got this camera because it was the best value on the market at the time.  Once it arrived, I played with it for 10 minutes or so, and soon realized the problem that everyone else was having... it wouldn't turn on.  This particular camera I knew was a problem, because I never did end up getting it back on.  So I returned it and order another one (this time from a different seller hoping that things might be different).  It was no use.Once my second one arrived, it had the same issue, but was a tiny bit more reliable.  I could get it on if I played with it for a few minutes, pushing the button ever so carefully and differently.  Variety was no solution.  When I needed it, it was not available, so I called Polaroid.  Of course they wouldn't admit fault, but this is a bad model number.  So I returned my second one.In the end, after all this time had passed, the best value on the market (excluding this crappy camera) was a Kodak EasyShare C183 Black 14MP Digital Camera w/ 3x Optical Zoom for $59 at Walmart Online.  I went for it.  Not only does the 14MP camera work better, it has more features and is many, many times better overall.Bottom Line:Don't waste your time.  There were clearly some issues in production of this thing, because it is a magnificent camera aside from a very necessary element.  Avoid it at all costs.", "Date": "January 21, 2011"}, {"Title": "love this camera", "Author": "doris", "ReviewID": "RENBOQDOSI8FA", "Overall": "5.0", "Content": "ok so far this is a great little camera i read the reviews before i bought it so i got it today in the mail put my own good camera batteries in it and a sd card turned it on set the date and it cut off on me and i thought oh no i am going to have the same problems some people where saying about it not cutting  back on ok it would not cut back on by the on button on the top so i got the directions out started reading them come to find out there is 2 ways to cut the camera on one is the top button the other is the play button the button on the back of the camera that you preview  your taken pictures with all you do is mash it and the camera comes on mash it again to take pictures cut it off with the button on the top of the camera hope this helps please read directions and look at the diagram to find the play button that way you want have to return your camera oh by the way i bought this camera for my son for Christmas and i am going to buy another for me", "Date": "January 21, 2011"}, {"Title": "Junk!", "Author": "Mike", "ReviewID": "R1EBEZKK9OKHL4", "Overall": "1.0", "Content": "I bought this for my mother as a Christmas present after CAREFULLY looking at the reviews.  I see a bunch of new ones now with the same issue I ran into.  I was showing her how to use it and it would not turn back on.  I could not imagine what I was doing wrong, for goodness sake it was a digital camera - something I have been using since introduction into mainstream.  After I handed it off to someone else and they could not turn it on, I boxed it back up and completed a RMA and dropped it off this morning at the Post Office.  I felt the brand would have produced a better quality item.  It felt cheap and loose, terrible SD card locking mechanism and counter intuitive menu.  This is an over priced child's disposable camera.  I am totally disgusted that Polaroid would put their name on this POS.  DO NOT BUY!", "Date": "December 27, 2010"}, {"Title": "Piece of ----", "Author": "KimmyGee", "ReviewID": "R2YW5M2OXCSJG0", "Overall": "1.0", "Content": "This rarely even lasted 3 days. Please please don't waste your money and buy this, When it was working, the quality of the images were terrible (which was expected), but it stopped working literally after 3 days. Everytime I try to press the on button, it would beep and shut right off again. Very frustrating since I have photos stored within its own memory card which only carries like 6 photos.", "Date": "April 29, 2012"}, {"Title": "I LOVED MY CAMERA", "Author": "Helen Baker", "ReviewID": "R2YEKSNC8SGYMG", "Overall": "2.0", "Content": "This camera was great for about a year, replaced with the Lithium batteries as suggested. NOW it won't turn on or off. SAME PROBLEM AS OTHERS ARE HAVING. And its waayy to late to try and return it now, and also the one year warrentee no good, as \"amazon\" not recognized dealer. I guess you get what you pay for, it worked for one year for fifty bucks. DON'T BUY UNLESS YOU AREN'T THAT UPSET ABOUT LOSING 50.00 BUCKS.", "Date": "December 24, 2011"}, {"Title": "First time customer at Amazon.com", "Author": "daisy2552", "ReviewID": "R3ET8III4X9WKX", "Overall": "5.0", "Content": "This was my first purchase I ever made with Amazon.com. I was alittle nervous as I ordered the camera being used as well. I received my camera before Thanksgiving. This was a pleasant surprise because I never even anticipated that I would as it was so close in time.  I was more than happy with my camera. The camera was exactly as subscribed and more than I expected it to be. Polaroid CIM-1237R 12 MP Digital Camera with 3x Optical Zoom, Red", "Date": "December 21, 2011"}, {"Title": "the little camera", "Author": "baby", "ReviewID": "R3KCK15LQFDKEW", "Overall": "5.0", "Content": "got camera have not used it yet. it came on time and it looks like is was a great buy, but if i would do it again i would buy a bigger camera because my fingers are big and the buttons are small.", "Date": "December 7, 2011"}, {"Title": "Great buy", "Author": "O. Forsythe \"No, don't knit for me.\"", "ReviewID": "R1XW92HLRJNJP9", "Overall": "4.0", "Content": "I love this camera. This is the second one I've gotten and I love it. The camera does use up batteries alot but I resloved that issue buy using rechareable batteries. The pictures are really great quality and it's easy to use. Sometimes it has problems turning on but don't let that discourage you. The audio and video are decent enough. My advice though is to try it out for yourself.", "Date": "November 1, 2011"}, {"Title": "Great camera for the price", "Author": "ONamat", "ReviewID": "R1V68NVRO1THR4", "Overall": "5.0", "Content": "Great camera for the price, i mean 12MP for that price is great! And at the same time Polaroid is not bad for the price.", "Date": "November 1, 2011"}, {"Title": "Great Snapshot Camera to carry around", "Author": "Gary", "ReviewID": "R1F1I4G9DK6E4K", "Overall": "5.0", "Content": "I like this camera a lot. The flash lights up the room fairly well unlike some cameras I have owned. This is surprising since it is so small. Love the large screen. I would prefer it to have a viewfinder (non digital preferred) which is has none. On a sunny day the screen is not up to the task so a viewfinder is essential. I would recommend it as a 2nd camera to carry around because it is so small and unobtrusive. My other camera is a Nikon D80 which is great for special occasions, but I seldom use it because it is so large. Takes great snapshot pics without effort from user.", "Date": "September 13, 2011"}, {"Title": "EXCELLENT", "Author": "Jimmy Morales", "ReviewID": "R3H6N7UWU7Z2Z4", "Overall": "5.0", "Content": "THIS CAMERA IS VERY VERY GOOD... EXCELLENT.. I LIKE THIS CAMERA, THE COLOR, THE MATERIAL, MY BOY ARE HAPPY.. ITS VERY BEAUTIFULL!..", "Date": "August 30, 2011"}, {"Title": "Too hard to do video", "Author": "Catbyter", "ReviewID": "R1UWPOTWGYS14P", "Overall": "2.0", "Content": "It is at least SIX menu clicks to get from picture mode to video mode, depending on your settings -- more if you're using anything other than Auto.  By that time, any video opportunity is long past.This is my first Polaroid camera since they came with developing film inside.  At this point, it will be my last.  I cannot believe it is that difficult to switch from picture mode to video mode.  Am I the only one who wants to take a video with this camera?So far the point-and-shoot is a little slow compared to other Canon cameras I have owned.  And for the record, Canon cameras have a dial on the top, so you just click over from camera to video.  Some even have a dedicated video button, so there is no switching at all.Polaroid customer service told me (after 30 minutes on hold) that no one had ever given negative feedback on the difficulty of getting to video mode.  Personally I find that hard to believe.Overall I would give the camera three stars, but for the difficulty of doing video, I think two stars is generous.  Video is a major feature for me.", "Date": "August 22, 2011"}, {"Title": "Love It So Far!", "Author": "S. E. Bradfield", "ReviewID": "RUVTE8ZOP8LIA", "Overall": "5.0", "Content": "This is my first digital camera, and I've only had it for a few weeks. I'm still learning all the ins and outs, and some of it isn't easy, but then I haven't really taken the time yet to explore everything fully. I mainly bought it for the Macro (close-up) feature, but I've been having fun just taking ordinary pictures, and they look great!For a cheap point-and-shoot, I have no complaints.", "Date": "August 15, 2011"}, {"Title": "Didn't last long", "Author": "Lillian \"Lil\"", "ReviewID": "R2RTJSOSWDKKGA", "Overall": "2.0", "Content": "I bought this as a birthday gift for my sister.  I bought it because of the price.  It didn't last.  After about a month and a half of use it stopped working.  She is having the same problem some of the other people described of the lens coming out but it doesn't work.  We have tried changing the batteries but that didn't help.  I had bought it because of the price.  Also because there were some good reviews.  So I wouldn't recommend it to anyone to buy.  We had another polaroid camera that worked well but this one didn't.  The only reason we had to replace the other was the camera got dropped on the ground a couple of times and stopped working.", "Date": "July 5, 2011"}, {"Title": "decent item if you have the right equipment", "Author": "addglitter2", "ReviewID": "R2ODOHBKDFAB08", "Overall": "4.0", "Content": "I received my camera yesterday and after reading all the reviews I was a little nervous, but I did as most suggested and it worked fine.  I had a 1 G memory card from my other camera that died on me over memorial weekend so I put that in right away.  I also put new batteries in it and not the ones that came with it.  Was a little disappointed because the description said that it used 2 AAA batteries so I had purchased lithium batteries in that size when actually it is 2 AA.  I usually use lithium anyway with my cameras as they have better life so I will purchase those soon.The picture quality was excellent and my \"techie\" son was impressed with it.The camera felt pretty light to me, but hey, I don't want a big bulky camera to carry around.Hope this helps.  I think if you have the SD card and the right batteries from the start you'll do just fine.", "Date": "June 22, 2011"}, {"Title": "great little camera", "Author": "steven", "ReviewID": "R1H6WLCCYR9GAB", "Overall": "4.0", "Content": "the camera is a very easy to use right out of the box, picture quality is awesome for the price (makes my $200.00 hp look like a toy)point and shoot right out of the box, haven't even read the directions yet, and i pretty much getting good photos with no prompting, the only thing that was not right was the specs when i was seeing if this was what i wanted, it said it took AAA batteries and i went out and stocked up on rechargeable batteries, only to find out when i got it that it took AA, if thats the worse of it, i think that i made out on this deal, thank you Polaroid for a quality camera at a great pricethanks now i have a camera my wife will use..", "Date": "March 7, 2011"}, {"Title": "Just fine", "Author": "Marko", "ReviewID": "RS18ZD9EJMAAA", "Overall": "3.0", "Content": "Most of the digital cameras I purchased before included a memory card; this one doesn't, except for the memory of the hard drive of course, but with very limited space (3 shots and that space is gone! Just compare to any other digital camera you already got). But in general terms is a good camera with lots of options and a very reasonable price.", "Date": "February 25, 2011"}, {"Title": "The lemon Christmas present", "Author": "John Hammontree", "ReviewID": "R79BT665WRX8N", "Overall": "1.0", "Content": "I purchased this camera for my daughter.  We took it on a vacation and the camera worked well.  We did not encounter any issues related to the battery and the pictures came out OK for a point and shoot. Fast forward two months (the camera had been placed back in the box and rested on a shelf.  We were packing to go to a family function and my daughter excitedly grabbed her camera, turned it on to test the batteries and it would not turn on.  No problem, we have new batteries.  With brand new batteries the camera will no initialize.  The initial power on results in the lens cover opening briefly and then three beeps and it shuts off.  I think there may be an issue with the gears for the lens assembly binding up.  It is still under warranty so, I will look for a repair center however, I do not believe there is one in driving range.  That being said the shipping to have this camera repaired will most likely cost more than the camera is worth.  Six months of ownership.  One week of use.  The camera is effectively nothing more than electronic waste.", "Date": "July 6, 2011"}, {"Title": "12MP Ploarid Camera", "Author": "Bargin Girl", "ReviewID": "R14FI99WB7KKBU", "Overall": "4.0", "Content": "I have had this camera for two weeks now. Purchased to replace another digital camera that quit working. I just plugged in my SD card and started taking pictures. Picture quality is very good. Camera also adjusted for extra background light from windows very well. It does come with AA batteries. I am still using the original batteries, but do not expect them to last very long. I have found that lithium batteries last the longest in digital cameras, and that rechargeables are your best value. Also I use an SD card reader to upload my pictures to save battery power. This camera is not very thin and the red body is plastic, but overall a very good value for the money.", "Date": "January 31, 2011"}, {"Title": "Christmas purchase", "Author": "Kathy A. Weak", "ReviewID": "REAKFALDY2UUP", "Overall": "5.0", "Content": "They absolutely love it. The reason the camera was purchased, besides being a present, was that I have one in pink and used it on vacation to New York state. The pictures came out beautifully, as if they were done professionally. It takes amazing pictures for a camera that only uses 2 AA batteries. Very impressive. One other feature that is great on the camera is the anti-shaking it has. With my camera, I had it outside of a moving vehicle at 60 mph and the pictures came out as if I was standing and taking the pictures. This is a fabulous camera for the price.", "Date": "January 11, 2014"}, {"Title": "JD Camera", "Author": "Jeniffer Nanlal", "ReviewID": "R2GOR23SX1R595", "Overall": "5.0", "Content": "My son loved his new camera and quickly started taking pictures of everything. He loved the colour and the size.", "Date": "December 30, 2013"}, {"Title": "Polaroid is not finished making cameras.", "Author": "Belden", "ReviewID": "R1PD5MB1FTKG34", "Overall": "5.0", "Content": "Great Camera.  Well worth the price.  Cannot complain, takes great pictures. Memory is not substantial, otherwise no problem.  I recommend.", "Date": "December 11, 2013"}, {"Title": "5 Star camera for a Great price!!!", "Author": "Jennifer F Shubelka", "ReviewID": "RVW6KNKSBGKDK", "Overall": "5.0", "Content": "This is a great camera. Polariod made a great little digital camera. 12 Mega pixels, Good zoom lense, and it takes fanastcic pics. The view window is very good as ell. I like that you can make pics black and white and Sepia as well as color. It has panoramic, different scene settings, facial recognition, red eye reduction and some other amazing features. My son loves this camera and got some prizes at the Fair for his pictures.  He loves photography and there are some cool things you can do with this little camera. It travels well and takes regular batteries, which is nice if you are somewhere and need to pick up batteries. You don't need to sit and let it charge up.  Definitely worth getting the 8 gig disk to go with this camera. I also got a Polaroid mini printer he loves it. He is filling books with stories and pictures. What a cool product. 5 stars definitely!!!", "Date": "November 19, 2013"}, {"Title": "Not good", "Author": "cheryl williams", "ReviewID": "RUY8W3LDLRJPY", "Overall": "1.0", "Content": "This camera was really bad, it only worked for a few weeks and pictures weren't clear, my cell phone pictures were better.", "Date": "July 1, 2013"}, {"Title": "East of use is great", "Author": "Susan Ortyl", "ReviewID": "R2SHS148SO66EE", "Overall": "5.0", "Content": "I really like this camera.  Took it on vacation to the Florida Keys and was able to take great indoor and outdoor photos at all times of day.  Love the ease of use.", "Date": "February 10, 2013"}, {"Title": "Great Starter Cam", "Author": "Rashemia", "ReviewID": "R3EMJRBMJN3UIZ", "Overall": "4.0", "Content": "I bought this camera for my father and it was very easy for him to handle. This was his first digital camera and most of the options were straight forward. He is a hunter so this camera was easy for him to pack and carry with him.", "Date": "February 9, 2013"}, {"Title": "Good quality", "Author": "pib", "ReviewID": "R29UBWJED8J29V", "Overall": "5.0", "Content": "Received product much sooner than expected; quality was great and nothing broken. Was exactly what I expected with no problems.", "Date": "January 25, 2013"}, {"Title": "Didnt last a week", "Author": "Precilla Adams", "ReviewID": "RWD23PSERTBWN", "Overall": "1.0", "Content": "Bought this for my 12 yr old daughter who likes to take photos. Chose it b/c of the size and price and polaroid is a well known brand. She had it a few days and then one day it just stopped working properly, it would \"snap\" a photo but nothing would display on screen. we tried new batteries, leaving it off for a day, taking the memory card in and out, nothing worked. it is now an expensive paperweight. I wouldnt waste your money on this camera.", "Date": "January 21, 2013"}, {"Title": "all right", "Author": "Hernan", "ReviewID": "R22RFOQCMLEPB8", "Overall": "5.0", "Content": "It is a great product. good packaging, good price,absolutely, I recommend it. . . . . . . . .", "Date": "December 11, 2012"}, {"Title": "Great, but...", "Author": "Olivia", "ReviewID": "R2U29ZHJV2M4T7", "Overall": "4.0", "Content": "I bought this camera at a Black Friday sale a few years ago and loved it. It took very clear pictures and had a nice focus, but the very first time it fell, it stopped working. Now, it very rarely turns on. Overall, it is a good camera, but it has very poor shock resistance.", "Date": "November 18, 2012"}, {"Title": "Camera Died just outside of  return window but within Warranty", "Author": "Karl", "ReviewID": "R3AUTBM4F0ONND", "Overall": "1.0", "Content": "Camera Died just outside of  30 day return window but well within Warranty window ... I contacted Amazon first but I was slightly outside the return window so I contacted POLAROID and it was a hassle but I finally, after many many many phone calls got an authorization so I could ship it (at my cost) to Polaroid's repair center. After several months , the return center contacted me and explained that they could not repair the camera and the only camera they could offer me was an older 8 MP model that had been refurbished. This was totally unacceptable and was in complete violation of the terms of the one year warranty. I contacted the Attorney General's Consumer dept. regarding Polaroid's Warranty. I finally bought a LUMIX by Panasonic, same size but a real good quality camera at a much higher price.", "Date": "November 12, 2012"}, {"Title": "Great pix for the money", "Author": "Jack Enright", "ReviewID": "R57DZ9SYSRZRD", "Overall": "4.0", "Content": "I have taken thousands of Pix with this little camera and most with great results. The zoom feature works well if you can hold still or use a tripod for distance. Its easy to replay and use the many features like flash and composition settings. Its a good camera to take hiking and fishing because it fits in your pocket. I have received great reviews from my pix of Crater Lake on Flicker taken from this camera. Jack Enright, Author of Return of the Ancient Mariners.", "Date": "September 8, 2012"}, {"Title": "Polarooid, very good", "Author": "janice-50", "ReviewID": "R2VBU39PISKE0B", "Overall": "5.0", "Content": "This camera has been a very good to us, my daughter has taken so many pictures with it, I can hardly get the camera from her, ha! I bought the camera for her about 2 years ago, Still taking beautiful pictures. Good Job  Janice", "Date": "September 3, 2012"}, {"Title": "bad camera", "Author": "C*****", "ReviewID": "RXSMPTLL1XEPA", "Overall": "1.0", "Content": "this camera is absolutly bad. it dosnt not take a clear picture at all, and it it very flimsy and breaks quite easily. i am afraid to set it down to hard. it is also very bulky and an akward size.", "Date": "June 22, 2012"}, {"Title": "Polaroid CIM-1237R Digital Camera", "Author": "Quentin Sands", "ReviewID": "R24OTFQ88CXNJF", "Overall": "3.0", "Content": "This was my first purchase from this company and I found the company to be very reliable. The camera came on time and it worked fine right out of the box. Everything was just as described,the only drawback is that it only works with two AA sized batteries not the Li-ion cadnium rechargable ones which makes battery purchasing an issue for those who don't like the hassel. All in all it does everthing that as described so that what counts. I definately will purchase again.", "Date": "May 22, 2012"}, {"Title": "Good Price", "Author": "Regina", "ReviewID": "R2QZB7U7XQBOJR", "Overall": "4.0", "Content": "I purchased this as a gift for grandparents. Its easy to use and simple but takes nice photos. They seem to really like the camera.", "Date": "April 16, 2012"}, {"Title": "Good Camera, relation price quality.", "Author": "Isnel Sarramera \"Simple Flute Maker\"", "ReviewID": "R3HCMC084R0HHX", "Overall": "4.0", "Content": "This Camera is a good option for people who is looking for a cheap camera with good quality pictures. it has many functions, that's amazing!  i put all setting to maximum quality and the pictures are decent, with a good illumination the photos has good result. the function that i use is macro, because i work with small pieces in my workshop and i have to capture all details and the picture with all quality configuration to high the result is acceptably. i put four stars because the only thing bad is when you use flash on your photos the battery run out fast. i use NiMH Sony Rechargeable with 2800mAh and still happening. In general, good option to buy if you want a cheap but good camera. you have to buy too 4 recahrgeable batteries.", "Date": "April 12, 2012"}, {"Title": "pics", "Author": "kingnolin \"theking\"", "ReviewID": "R3CKF9L3DNWL4G", "Overall": "4.0", "Content": "ordered this camera for a co-worker my boss actually who knows nothing about new technology like this and she is thrilled at what she can do with her camera quick delivery good camera", "Date": "April 2, 2012"}, {"Title": "Problems with turn on", "Author": "José", "ReviewID": "R1YYQZY58SI7QE", "Overall": "2.0", "Content": "I have problems with the power button, sometimes the camera not start, and one time my pictures were deleted from memory card", "Date": "March 16, 2012"}, {"Title": "Polaroid CIM-1237R 12 MP Digital Camera with 3x Optical Zoom", "Author": "Robert Hovey", "ReviewID": "R1LY1SPVUH3YA8", "Overall": "3.0", "Content": "The camera takes good pictures. There can be no question about that. After all that is what we want from a camera. The resolution is very good. Zoom is OK for a simple point and shoot. So I am completely satisfied with the quality of this inexpensive camera.I bought it \"used\" from Amazon so I won't complain that areas of the LCD are failing. The only negative comment I would make is that it is slow. From the time I press the button 3 seconds elapse before the picture is taken then the camera is exhausted and takes 5 seconds to recover. I know this is not so important when you compose the picture - but if you want spontaneity - very often the moment is gone.", "Date": "March 16, 2012"}, {"Title": "POLAROID DIGITAL CAMERA", "Author": "Sara12345", "ReviewID": "R12RQK7FHFQEU1", "Overall": "5.0", "Content": "I purchased this camera to replace my other Polaroid camera that my 2 year old son dropped. The screen cracked and would still work, eventually the camera wouldnt allow me to upload pictured to my computer with the USB cable. It still takes pictures though.This camera is a pretty color and fits in the Polaroid bag that I purchased separately. I used the 2 Duracell batteries that were provided in the box, and I was only able to take a few picture before I turned it off. When I tried to turn it back on, it wouldnt work. I kept pushing the button, before I realized that it was the New batteries that had already died. They were 2 new batteries that were still in the shrink package. So I know they werent used! After installing 2 new batteries, the camera has worked great every time I have to take a picture. I've only had the camera a couple of weeks, but my other Polaroid lasted more than 2 years before it was dropped.", "Date": "March 6, 2012"}, {"Title": "the camara took 6 pictures and dint work again", "Author": "orlando smith", "ReviewID": "R35TC3T96Z08IZ", "Overall": "1.0", "Content": "i knew when i bougth this camara that it was a cheap camara, but i dint think it will be so bad, my wife just took a few pictures with it, and the camara quit working. i wanted to returned it but she lost all the documentations and received for it. well, looking at the brigth side, i still have my health.", "Date": "February 17, 2012"}, {"Title": "Camera purchase", "Author": "C. W. Dewalt Jr.", "ReviewID": "R2ADX4SHNHRCNQ", "Overall": "4.0", "Content": "This camera was purchased as a compact, toss in the pocket, camera less bulky than another very good seven-year-old digital camera. I do miss the old fashion compose the picture looking through the small opening at the top of the camera especially when taking a picture in the bright sunlight.I am satisfied and feel like I got what I paid for.", "Date": "February 6, 2012"}, {"Title": "not a good product", "Author": "val", "ReviewID": "RIOEI19R3E079", "Overall": "2.0", "Content": "I received this product and it worked fine for about 3 weeks then all of a sudden it stopped working, I changed the battery but still nothing. A couple of days later it started working, not even a couple hours later it stopped working with the lens stuck out, now it won't come on period. My daughter threw away the original box but i'm still hoping to return it. It is very fustrating, I was depending on this camera to record my delivery!", "Date": "January 29, 2012"}, {"Title": "Do not purchase. Do not waste your money!!!", "Author": "James Bond", "ReviewID": "R2D9I3IN1T1NQC", "Overall": "1.0", "Content": "It stopped turning on  after one day of use!!! Each ten times you pressed the button only one or two works.", "Date": "January 15, 2012"}, {"Title": "Terrible-DO NOT BUY AT ANY PRICE", "Author": "GW", "ReviewID": "RBYV38YQPCTD5", "Overall": "1.0", "Content": "The camera kept turning off after a few pictures.  I called Kodak and they recommended only using expensive lithium batteries, which I did.  Then the camera stopped working altogether.  This is a piece of garbage at any price and no wonder Kodak is going out of business with this kind of customer service.", "Date": "January 15, 2012"}, {"Title": "porn on camera!", "Author": "kca", "ReviewID": "R2JJ504IWJ7OXD", "Overall": "1.0", "Content": "I purchased this camera as a new item. It clearly had been used. I bought it for my mom for Christmas. When she opened it up and took a picture the memory was full...strange bc it was supposed to be new. Not! There were naked pictures of women..I am disgusted and warn all never to purchase an item from this seller!", "Date": "January 6, 2012"}, {"Title": "Great camera!", "Author": "Ray", "ReviewID": "R1GNZ5TYWA31HO", "Overall": "4.0", "Content": "Really like this camera! It takes great pictures and has many different settings for different kinds of light! Has worked great!", "Date": "August 26, 2011"}, {"Title": "Poor quality", "Author": "C. West", "ReviewID": "RJH8AVTNPN4D0", "Overall": "1.0", "Content": "Ordered this item June 19/2011. Stopped working in August - 1 month after returns expired.  Camera froze.  Piece of junk.  Don't buy.", "Date": "August 20, 2011"}, {"Title": "Worthy Investment", "Author": "cecarle61", "ReviewID": "R1FLYOTF4K7GIG", "Overall": "5.0", "Content": "I purchased this for my daughter's 14th birthday.  She loves the camera but it takes a while to get used to the operating features.  Reading the instructions would probably be beneficial but most teenagers seem to think they're smarter than that.  After reading the previous reviews, I purchased the recommended batteries along with a 4gb card.  So far the camera works great and takes really great photos.  Well worth the money!", "Date": "July 12, 2011"}, {"Title": "Great camera, picture quality was excellent!", "Author": "Alex I", "ReviewID": "R3ID0AVQQSHOSY", "Overall": "4.0", "Content": "Bought this camera for my wife and she loved it. Picture quality was great.You can't go wrong if you're thinking about buying this.", "Date": "July 11, 2011"}, {"Title": "Great little camera", "Author": "just me", "ReviewID": "R2PXAGONEUI0U8", "Overall": "4.0", "Content": "Take nice picture and it will even shoot video.  You can't ask for anything more from something that you can slide into a pocket and walk around all day with.", "Date": "June 7, 2011"}, {"Title": "Great pictures", "Author": "P. Osborne", "ReviewID": "RZ0Y9DFGZVGK9", "Overall": "3.0", "Content": "The camera takes great pictures, and is easy to use.  I have taken over a hundred pictures with it.  My only complaint is a lot of times you have to play with the on button to get it to turn on.", "Date": "May 2, 2011"}, {"Title": "polaroid camera", "Author": "bar", "ReviewID": "R1AM6XI2HYIM9I", "Overall": "5.0", "Content": "Polaroid 12 Megapixel Digital Camera, with 3x Optical Zoom, 2.7\" Color LCD Display, SD card compatible, Model i1236 Bundle (Black)the camera operates very well.  i am a new operator with digital cameras and this camera works well for me.  i needed to purchase lithium batteries for it and it is going strong.  the anti-shake button helps alot.  thank you for making and selling such a small but powerful digital camera for the beginner.", "Date": "April 28, 2011"}, {"Title": "Very Pleased", "Author": "Carmenrg", "ReviewID": "RXQJVDBCQJ1BZ", "Overall": "5.0", "Content": "I upgraded from a 5 mp to this 12 mp camera and I'm quite impressed. The pictures are crystal clear, almost as if you were there. The video quality is superb in almost any light. I really like the smile detection feature because I think it's neat and you don't have to push any buttons as soon as someone smiles. The only thing I am unhappy about is the instruction manual. I've had to figure out about 98% of the features and functions myself because the instructions were just basic. I would recommend this camera to anyone.", "Date": "March 29, 2011"}, {"Title": "Red Polaroid Digital Camera", "Author": "A. De SANTIS \"ArticFox\"", "ReviewID": "R1U1BRRB3GXHP4", "Overall": "4.0", "Content": "I bought this camera expecting a much thinner, sleeker body.  The little cover over the disc slot is hard to open, but the camera itself takes good pictures.  Not exactly what I wanted, but it does the job for a 'point & shoot' camera.", "Date": "February 11, 2011"}, {"Title": "Great camera!", "Author": "HotAZMama", "ReviewID": "R2O5DQQ5ICVPV1", "Overall": "5.0", "Content": "I bought this as a gift for my teen daughter. She loves it.  It's easy to navigate and takes great pictures.  With 12 megapixels you get great photos that you can enlarge and photoshop without destroying the quality.  The only thing I suggest is getting rechargeable batteries because digital cameras eat them up!", "Date": "February 11, 2011"}, {"Title": "Quit working after a few days.", "Author": "dbo", "ReviewID": "R1GDKRNBUEOPE9", "Overall": "1.0", "Content": "I ordered 3 of these 1 for myself and 2 for Christmas presents along with the POGO printer.  Thought it was a great idea.  I used my camera for a few shots prior to Christmas.  On Christmas day I had the camera out and ready for our family gathering.  Installed an SD disk as I new we'd be taking lots of photos.  Quit working after just a few shots.  Changed batteries with no luck.  Put it aside and got out my old camera.  I remembered it this morning (Feb 2) and discovered my return window had expired Jan 31.  Not sure what the warranty is, but I'll post if I have any success.Haven't heard from the people we gifted the cameras to, but I can't give it a good review.  I definitely like the little printer though, and it works with most cameras.", "Date": "February 2, 2011"}, {"Title": "disappointed", "Author": "md", "ReviewID": "R27C5BRT3SEUZ7", "Overall": "1.0", "Content": "I ordered two cameras as Christmas gifts.  Neither camera works.  Nice, huh?  Too much hassle to send back b/c they were opened.  How do you know they will work if you don't open the boxes?", "Date": "January 20, 2011"}, {"Title": "Great Camera! Great Price!", "Author": "Jimmy McComas \"C. Karabinos\"", "ReviewID": "RIJU7ELF0RCPD", "Overall": "5.0", "Content": "I bought this camera for my daughter and she LOVES it! Great pictures and I get more pictures of my grand daughter! Great camera, great price!", "Date": "January 8, 2011"}, {"Title": "Disappointing", "Author": "jessica", "ReviewID": "R1LP4QL5BKCMAI", "Overall": "1.0", "Content": "I bought it for myself with a gift certificate (12-25-2010). I was excited about this camera, for the features it was a good deal for the price. Worked for one day, took a few pics then would shut off when trying to take a picture and then never came on again. Had to return, was very disappointed because I really liked the camera, color and all.  Should not be sold until problems are fixed.", "Date": "January 4, 2011"}, {"Title": "Don't buy it - Had to return it", "Author": "N.H. Old Guy", "ReviewID": "R2ROJF3XQ21EFS", "Overall": "1.0", "Content": "Despite other reviews telling of problems with this camera, I decided to give it a chance because of its low price. I had it for almost a month, but it never worked right. I used it only for snapshots and not movies. I took about 50 pictures. After this short period of time, the \"Replace Batteries\" warning appeared; and I had to replace the batteries. Also, the camera was very hard to turn on. I had to press the \"On\" button many, many, many times to get it to come on. And then, unless you kept taking one photo after another, it would shut itself off. Definitely do not recommend this camera. I returned it.", "Date": "January 27, 2011"}, {"Title": "it sucks", "Author": "Ben", "ReviewID": "R37BJYF2B1YUFS", "Overall": "1.0", "Content": "Wow, this thing sucks!  It has a very slow recharge between shots, does not turn on from time to time, and basically feels more like a toy than a camera.", "Date": "October 8, 2011"}, {"Title": "Won't Turn On Most of the TIme", "Author": "David J. Clarke", "ReviewID": "R2EB6S1OJ015DN", "Overall": "1.0", "Content": "I just bought it and have the same problem as many of the others.  It won't turn on most of the time.  Fresh batteries, it turns on the first time I insert them.  Will sometimes turn on when I open the door and then close it.Must be a design defect, I'm returning it and will try something else.", "Date": "June 1, 2011"}, {"Title": "Save yourself a headache!", "Author": "Rub1", "ReviewID": "R2E9FXH39VMM0J", "Overall": "1.0", "Content": "I bought this camera for my son's birthday. It worked pretty nicely for about a week. After that we couldn't turn it on. We put new batteries, nothing. If we try 100 times to turn it on it turns only 5 times. How are you supposed to use it that way? Thanks good for amazon no-hassles return service.", "Date": "May 1, 2011"}, {"Title": "Dissapointment; Don't Buy", "Author": "Victorie Rune", "ReviewID": "R1H3TZDTYED37E", "Overall": "1.0", "Content": "I was so excited to get this camera. My old one, aNorcent DCC-725 7.0MP Digital Camera with 3x Optical Zoom, had finally kicked the bucket, and with a new baby, pictures are a way of life. I tend to by off brand with cameras, and though I've never had a problem with them, I decided to go with Polaroid this time based on price and the fact that they were Polaroid. I figured that as good as my cheap Norcent was, a dedicated camera brand with a lot of history would be even better.How wrong I was. It worked well for about a week; then it started giving me issues turning on. It was still turning on, I just had to hit the power button three or four times to do so.I figured the problem might be the batteries, so on the way to my son's first carnival, we stopped and picked up a set of batteries for it; a set of Energizers, and the ones specifically meant for electronics (also a brand I've used extensively, they work phenomenally).We got to the carnival and I was able to take two pictures. After that it refused to come on for the rest of the evening. I was really upset that it chose to stop working when it did; I had no ability to just go pick up an alternative where I was, and I shouldn't have had to.Over all the picture quality is really good, but there is something wrong mechanically with these cameras. Customer service was great and I had no problem at all returning it, though. I returned it a week ago, it got there yesterday, and my refund is in my account this morning. I'll probably be putting it toward another one of my faithful off brand cameras.", "Date": "March 10, 2011"}, {"Title": "Forget It", "Author": "Debra L. Robinson \"Little Librarian\"", "ReviewID": "R3KLO8V3XKAGKP", "Overall": "1.0", "Content": "Bought it to replace my grown daughter's lost camera.  It wouldn't work straight out of the package.  Inside pictures too dark.  Outside picktures too bright.  In between came out with green and blue blocks and looked like cartoons.  As soon as she gives it back its being returned for credit.", "Date": "July 16, 2011"}, {"Title": "Garbage", "Author": "D. Porter", "ReviewID": "R2TKYNEN9ZYK0", "Overall": "1.0", "Content": "Before I bought this camera, I read some good reviews about it and some not so good reviews. If you buy this camera, you are rolling the dice that it will work for more than a month. I am extremely disappointed. Even the first picture looked like crap. Now, after a month, the camera is useless.", "Date": "May 20, 2011"}, {"Title": "My 1st reaction was - Do NOT buy!!!", "Author": "Vaniko", "ReviewID": "R2G825CNXOROZ3", "Overall": "4.0", "Content": "Please, read both parts of my review.Part 1The camera takes nice pictures, has got nice settings... if you manage to turn it on.When it arrived I started to test it. I've made 9-10 shots and turned it off to remove SDHC card. Moved pics to computer, quality was decent, then I put card back in the camera and pushed power button. No response! At all! It's dead!!!Do NOT buy this junk!!!Part 2. The next day experience.I'm really confused. The next day I've decided to try my luck and pushed power button and the camera turned on. Since then it works just fine. I tried to reproduce the problem and here are my observation: Do not push ANY (I mean ANY) button while it is connected to the PC via USB cable. It went dead every time I did so. Actually 3 times, then I stopped to tempt my luck.Other than that it works just nice and smoothly. No problem with turning it on/off. The picture quality is great, it's easy to operate and has got many, many settings to play with.Overall, excellent family camera, especially considering the price.Would I recommend it to anyone? Hmmmm, I guess so. But taking other reviews into consideration, it seems like some kind of gamble, though.p.s. Changing rating from 1 star to 4 stars.UPDATE: After 6 months of heavy abuse from 12 years old kid the camera still works fine.", "Date": "January 18, 2011"}, {"Title": "Total garbage", "Author": "OHGREATONE2", "ReviewID": "RECN8JUFT8MUF", "Overall": "1.0", "Content": "I HAD THIS CAMERA FOR ABOUT A MONTH AND IT TOOK VERY CLEAR PHOTO'S HOWEVER ON THE NIGHTI NEEDED IT THE MOST THE SCREEN WAS BLACK, AND THE DARN THING WOULD NOT WORK, AND IT NOW LIES IN MYGARBAGE CAN WHERE IT BELONGS.", "Date": "October 9, 2011"}, {"Title": "DOA", "Author": "Joe W. Phillips", "ReviewID": "R3ON8BWHY07BNY", "Overall": "1.0", "Content": "This camera despite being well packaged and boxed was dead when my daughter opened it up for Christmas.  She was so dissapointed as was I when Amazon could do nothing but refund the lighting deal price I paid.  So I wind up spending twice as much for a replacement camera.", "Date": "January 14, 2011"}, {"Title": "Not satisfied", "Author": "Alia Chase", "ReviewID": "R17XWX34NUQ2G5", "Overall": "1.0", "Content": "I lost my old camera around Thanksgiving and have been pretty upset since I love taking pics of my kids. I looked around and checked out a few cameras here, compared a few and thought that for the price this one wouldn't be to bad. Once I got it though and took it out of the box I noticed how cheap and light it seemed. Thinking it'll do, I installed the batteries that came with it and tried to get it on. I tried to take a few pics of my son, it only holds 4 pics so luckiliy I had a sim card. It froze numourous times. Nothing I did would get it going again. I'd take a pic and the camera wouldn't flash or do anything. I tried to take the batteries out to see if I can restart it, but if stayed open but not on. I tried new batteries and that didn't work. I was pretty upset. My son is almost 2 and has had 3 surgeries. I want pictures of him as a baby/toddler so I can show my family who lives far way. Plus have memories. I was at Walmart shortly after getting this camera and found a similar one for 49$.", "Date": "February 20, 2011"}, {"Title": "terrible and very dissapointing, im disgusted at polaroid, shame on you", "Author": "lily", "ReviewID": "R4B8QKKNTYLXB", "Overall": "1.0", "Content": "i cant believe this piece of crap, i thought it would be of excellent quality because of the name brand polaroid. they need to take this camera off the market. when i opened the box the package was cut through the middle in an angle. the camera was not damaged so i decided to open it and possibly keep it. yeah right. i think the camera came on the first day, my son tell me lol. im so upset i dont even remember, then i shut the camera off cause we had to leave the house for a while. the next few days i decided to check the camera out some more and the stupid dum camera came on then shut off while i was taking pictures, lol. i tried cutting it back on, it did not come on, i pressed the button over and over again continuously, it still did not come on. so i gave the dam thing a break, it still didnt come on, im like what the hell is going on, this is a new name brand camera, why the power button shuts off while youre taking a few pictures? why does the lens in the front of the camera get stuck when the camera shuts off. so basically, the lens is just sticking out, when it should go back in when the camera shuts off. the lens also go in on its on without u doing it yourself.  why does it come back on in like a half hour or more hours, when it shouldnt go off in the first place, and it should come on anytime u want it on. the battery was also full, this is the batteries that came with the camera,  duracell ultra. lol this camera is a scam and do no not waist your money on this crap, im happy i did not have this crap when the lunar eclipse happened, you cant depend on this camera, it would have dissapointed me on the lunar eclipse day.  this was not my first choice of cameras, i ordered another camera before this,  a purple fuji, but the camera looked used and was missing a usb cord, so i sent it back and got refunded, and used my refund money to purchase this crappy polaroid camera. i am happy that other people made comments about polaroid errors, when i read your comments i was laughing because i couldnt believe i wasnt the only one experiencing this. the same problems other people have with this camera i am going through this now. i am sending this boot leg piece of polaroid crap back and want all my money back lol. shame on u polaroid. i should have got a cheap unknown digital camera, and i just might do that lol. so no more polaroid no more fuji. dam scam.", "Date": "January 17, 2011"}, {"Title": "I HATE THIS CAMERA", "Author": "Ashley Harmon", "ReviewID": "R14044KLZ7899L", "Overall": "1.0", "Content": "Honestly, just save your money. Even the packaging suggests this camera should be $19.99. I wish I would've just spent the extra 20 dollars and got a real camera. Camera sucks, flash sucks, and the software is primitive. Turns on fine, does everything fine. It's just a piece of trash. SAVE YOUR MONEY.", "Date": "January 6, 2011"}, {"Title": "Good price!", "Author": "tatcol \"tatcol\"", "ReviewID": "R390VU2H060N1T", "Overall": "5.0", "Content": "I just picked this up as a gift - the price is irresistible! About batteries v. chargers - I have found that batteries tend to last a LONG time in a camera, so I have no problem with the lack of a charter. In fact, I have come to prefer batteries over chargers where cameras are concerned.BTW, a review is not the place to set out concerns like that.", "Date": "December 7, 2010"}, {"Title": "almost bought it", "Author": "c barton", "ReviewID": "R2MBPT6R2OX1ML", "Overall": "4.0", "Content": "i was sold on the item and was gonna buy it it had everything i was looking for the price was awesome all the bells and whistles then the last thing i saw was powered by two aaa batteries i dont like replacing batteries it was a deal breaker i was heart broken i really wanted it", "Date": "February 2, 2011"}, {"Title": "polaroid camera", "Author": "Grace R. Mcgovern", "ReviewID": "R3P007WYEO25QC", "Overall": "5.0", "Content": "Arrived on time in perfect condition. A gift for my little girl and she loves it and has no trouble operating the controls.", "Date": "November 3, 2010"}, {"Title": "Avoid", "Author": "Marshall Jevons", "ReviewID": "RHCVPWBJQQTVE", "Overall": "1.0", "Content": "Bought for my young daughter. She loved it, for the twelve hours it almost worked. Right away, turning it on required a repeated press of the on button until it would randomly cooperate. Then, after 12 hours, every time we turned it on, it said \"Goodbye\" and turned itself off, despite fresh batteries and memory card. Her toy cameras worked better than this piece of junk.", "Date": "December 8, 2010"}, {"Title": "No charger capability????", "Author": "Michael B. Austin \"Michael\"", "ReviewID": "R2FUOGEGG6QIOR", "Overall": "1.0", "Content": "Looks like a great camera but doesn't appear to have a charging capability so you have to keep feeding it batteries?  How stone age.", "Date": "December 7, 2010"}], "ProductInfo": {"Price": "$90.99", "Features": "Anti-shake stabilization\nFace tracking, smile and blink detection\nIn camera red-eye removal\nAudio tag and 32MB built-in storage\n3.8 x 1 x 2.4 inches ; 4.8 ounces\n12 Megapixel\n2.7\" LCD Display\n3x Optical Zoom\nBuilt-In Memory Storage: 32MB", "Name": "Polaroid CIM-1237R 12 MP Digital Camera with 3x Optical Zoom, Red", "ImgURL": "http://ecx.images-amazon.com/images/I/41aArTLh36L._SX300_.jpg", "ProductID": "B003E47FWU"}}