{"Reviews": [{"Title": "Arguably, most options in its class; quality stills; exceptional high-speed video; amazing HD movies; with some minor issues", "Author": "Amazon Customer", "ReviewID": "R13T8X8OAOXLRC", "Overall": "5.0", "Content": "The camera arrived in a compact box containing the camera, the battery, a wall charger with USB cable, a CD-ROM containing RAW conversion software among other items, Quick Start Manual, warranty, and wrist strap. Apparently to save cost, the 131 page user's manual is located on the CD-ROM rather than provided in hard copy format.It took 2 hours and 20 minutes to fully charge the battery before the camera could be used. The charging cable is quite short about 20\", so an extension cord will probably be needed to reach from the power outlet to the camera. The cable provides a relatively large red lighted arrow on the camera side when the camera is charging that turns green when the camera is fully charged. Although the cable has a standard USB profile at one end, the other end has a profile I hadn't seen before. The \"mini dashboard\", i.e, the two analog dials on top of the camera, one for battery charge and the other for memory usage, do not work in the charging mode. Thus, you can't see charge progress on the battery dial and need to rely on the charging light's 'not charged'/'fully charged' indicator.Operation of the TL350 is not obvious. For example, a red circled button on the camera back can be pressed to begin and end a movie, This was done to allow the shutter button to be used for still photos while recording a movie. An outstanding feature, but this implementation is not intuitively apparent. Some options are unavailable in certain modes when other modes were previously selected, which options are available or unavailable in what mode is not immediately obvious. For example the 'Image Adjust' mode for changing contrast, sharpness, or saturation appears as unavailable if any 'Photo Style\" or 'Smart Filter' choice was previously made.I found a problem when I first tried to transfer images from the camera to my Windows 7 computer. The camera was not recognized. While other maker's digital cameras worked without problem via my external powered USB extender the Samsung did not. Fortunately, when I connected it directly to my computer it worked without problem. It seems Samsung's USB connection is a bit more temperamental than some others. Once operational, files transferred relatively quickly, on my system averaging about 4.5MB/second when transferring larger groups of photographs.Two, possibly helpful, points: 1)It's not necessary, and perhaps undesirable, to install the current version of the iStudio SW mentioned in Samsung's manual. Its image editing software that's not necessary for file transfer, and it may occasionally cause computer 'hangups'. 2)To conserve battery life when the camera is off and you want to view your stored photos press the playback button to accesses the playback mode only, without lens extension or start sound, and press this button again to turn the camera off when you're done.The TL350's specifications give its maximum aperture as f/2.4, at the wide end. The EXIF data with my photos shows its minimally better at 2.38. At 24mm, the f/2.4 lens is relatively sharp in the center although a bit soft at the corners, and shows some barrel distortion. In aperture priority mode the telephoto has a modest aperture range of f/5.8 to f/7.5, and the wide-angle f/2.4 to f/7.2. On my camera, the lens seems sharpest near f/2.4 at the wide and mid ranges, and around f/7 only near the 120mm setting.One nice feature is the textured right front grip which makes the camera easier to hold without dropping. Unusually, for a modestly priced camera, the TL350 provides raw, manual, aperture priority, shutter priority, and interval exposures modes, and the ability to zoom when taking movies.Its default settings produces more natural colors, less sharpened images, and less aggressive noise reduction than some of its competitors. Noise is reasonably well controlled at ISO settings of 400 and below. At lower ISO values images are quite good. ISO 80 and 100 images held up reasonably well under enlargement, although some artifacts became visible at higher enlargements. Between ISO 400 and 800 noise is clearly visible. I found ISO 800 was the highest level at which I achieved acceptable, although slightly noisy images. At ISO 1600 noise showed a rough texture. At ISO 3,200 shadows contained 'blotchy' areas of color noise, so its best employed only for emergency use. JPG images at the highest quality setting have been between 2.9 to 4.6 MB, with the occasional smaller or larger file.This camera has a number of unique and useful features, and a few, arguably, 'gimmicky' ones. Of real value is the AMOLED (active-matrix organic light-emitting diode) display. According to the specifications this 3\" screen has a 10,000:1 contrast ratio and 920,00 pixels, this display is really amazingly sharp and usually visible even when used in sunlight. However, I still would have liked even a minimal optical viewfinder, useful not only for bright sunlight scenes where glass reflections make it difficult to easily see the screen, but also to allow the camera to be held against the body for greater stability. I also like the display's various options which can go from image only to overlaid detailed information including a histogram.It takes outstanding full HD 1920 x 1080 pixels, not the more common 1280 x 720 pixels, video at 30 frames/second with stereo microphone. This camera allows shooting high-speed movies to allow video capture of action that would normally be difficult to record. For example, flying birds, insects, bats (more about this below), children playing, golf swings, etc. Resolution at the 1000 fps mode is perhaps more 'gimmicky' than serious at 192 x 64 pixels. The 240 fps rate, with a resolution of 432 x 320, seems the more usable option. The 60 fps at 1280 x 720 pixels option, although originally specified, was not included at production launch. One evening I noticed two animals flying in my garage. They were moving so fast it was impossible to tell if they were birds of bats. The high speed recording (slow motion playback) option confirmed they were bats. I now leave the garage light on if the garage will be left open in the evening :-).Three relatively novel features of the TL350 I use and like are: 1) it's ability to take still images and movies simultaneously, 2) its time lapse option, although there are no indicators once the TL350 has been set to this mode, and its quite easy to unintentionally disabled it, and 3) its panoramic option, which produced images with 2 to 3 million pixels; in landscape mode images were about 700 pixels high. One additional, relatively novel, feature is its ability to record 10 fps in high-speed burst mode at full 10M resolution. It also provides 5fps, and 3fps options.One other arguably 'gimmicky' feature is the analog \"retro dials\" on the top of the camera. Since the same information appears on the AMOLED screen these dials appear superfluous, particularly since they don't work when the camera is in charge mode.This camera is not without some disappointments. In high contrast situations, small sensor cameras typically blow out highlights or lose shadow details. That's still the case here. The stills and video are usually outstanding, but its auto white balance seems poor in low light. Some of Samsung's cost cutting decisions (e.g., the very short USB cable, requiring the same cable used for charging to be disconnected to transfer photos, the user's manual on disk, only 22 MB of internal memory, and the failure to provide an external battery charger so a separate battery could be charged while the camera is in use) are somewhat disappointing. A slightly greater disappointment is the Drive Mode Dial located on the camera's back. Its used to select, e.g., movie speed, self-timer, bracketing, interval settings, etc. Its hard to know why Samsung's designers chose a rotating cylinder-style dial which, at least on my TL350, is somewhat difficult to use, when a simple thumb-wheel would have seemingly been easier and quicker.In the past I've bypassed Samsung cameras in favor of competing models from, e.g., Panasonic, Canon, Fuji, Sony, etc. However, based on my experience with this model, Samsung's digital camera technology now appears competitive.Bottom Line: The camera is relatively fast and responsive. Noise control at ISO 800 and below is higher than I anticipated for a sensor this small. It has a truly exceptional 24 mm wide angle lens, interval timer, 1920 x 1080  HD, and high-speed movie options.  Surprisingly for a camera in its class, it offers manual, shutter priority, aperture priority, interval options, and raw mode.  In most shooting situations the TL350 made the right decisions to produce excellent results. Its lack of some options not intuitively obvious in some modes, along with some minor but unfortunate cost cutting decisions, are probably its chief deficiencies. The camera is generally quite easy to use, except for the 'Drive Mode Dial'.  Although it does not always provide the sharpest still images in its class it comes very close, and its HD/HQ movies are, arguably, the best in its class. Put simply, its combination of capabilities is just not found on other compact digital cameras. Its deficiencies are minor compared to the totality of it's capabilities.  It's energy efficient AMOLED provides exceptionally sharp, bright, and saturated images, while conserving battery life.  Although I can't confirm the maximum number of photos that can be taken before the battery needs recharging, my experience shows its over 200.  Outfitted with a Sandisk 8GB EXTREME III SDHC  card, particularly useful in movie modes, the camera will record about 1,470 still photos at its highest quality setting. Overall, an exceptional camera.", "Date": "August 6, 2010"}, {"Title": "Wonderful featureset, good image quality", "Author": "powerop", "ReviewID": "R1JG9A11W921ZI", "Overall": "5.0", "Content": "UPDATED: 6/1/11My main impression of the camera is great. I'm no professional but very picky with the end product that I choose to keep. I've owned the Panasonic lx3, Canon A590is, and Canon T2i, and currently own my old Fuji s6000fd and Pentax k-x. Some of my comments are direct observations, some are opinions.I'll start with the CONS and let the camera try to redeem itself.- Charging the battery is done within the camera. Works, but can't use camera while charging and only one battery at a time unless you buy an independent charger. Plus the provided cable is 18 inches long only.- Drive modes such as bracketing, shooting speed in fps, and timer countdown are handled via a slow barrel-type roller on the side (see pic). Its not intuitive, still getting used to it.- No distance scale information (Focal/zoom length you are at) displayed anywhere.- No blinking clipped shadows or highlights. Although, you can display a histogram.- Not enough info during playback. Shows ISO, aperture, shutter speed, histogram, flash, date, and photo number. Wish it showed resolution, white balance, mode used, etc.- No program shift in P mode. But thats an advanced feature, no biggie.- Macro mode does not focus on infinity. Not surprised, but some compact cameras still do (albeit slowly).- Vice versa for Normal mode. Without focal length info, there are times when I have to guess whether to start in macro or normal. Keep in mind, however, Auto mode changes this for you, PASM modes do not.- ISO value, whether auto or defined, is not displayed during capture mode. Stinks.- Panorama shots seems lower resolution than normal shots. One example shot was 3200 x 720 pixels.- White balance can be swayed by strong colors (see pic), such as vibrant yellow/orange/red making green leaves a little bluish.- You can't use Image styles and Filter effects at the same time, such as vibrant + miniature.- At 24mm, colors are less vibrant at F7.2 (min aperture) than F2.4 (max aperture). Not so much at 120mm (telephoto).- Green leaves are not as vibrant as the flower themselves.- Flash is too bright for extreme close up macro. Although, you can adjust intensity levels up to +/-2.- Auto ISO never goes beyond 400, even in complete darkness.- No control over Noise Reduction, not a common feature in slim compacts.- Some noise reduction can be seen at base iso.Sure sounds like this camera sucks, but I haven't told you the PROS yet. I'll start off with the image quality, then move onto everything else.+ ISO noise in RAW files are outstanding in a minimal sense. See pics. I have no regrets shooting iso 3200 in RAW format (.SRW). Btw, Lightroom 3.4 can read .SRW and has automatic lens profile for the TL350.+ ISO noise in JPG are very good. See pics. Imho, up to 400 is very similar and great. Iso 800 is good. Iso 1600 decent. Iso 3200 is still better than most.+ Noise reduction for jpgs does a good job keeping detail.+ Metering is excellent. It gets it right, even in movie recording. See some of my pics.+ Lens is pretty sharp at default settings, making Auto mode a great choice.+ If you use in camera sharpen +2 and saturation +1 in PASM modes, flower and food shots jump at you. Watch out!+ No IQ difference between jpg normal, fine, or superfine quality. So I pick normal and reduce my jpg file size by more than half.+ Best sharpness, contrast, and color achieved at 24mm at widest aperture - the most used setting.Now onto performance, handling, and features.+ Uses real aperture values ranging from F2.4-7.2 at 24mm and F5.8-7.5 at 120mm. Most cheap cameras have 2 apertures using ND filters.+ PASM modes for complete control of your shots. Max manual shutter speeds are 16 sec and 1/2000 sec.+ Flash syncro goes as fast as 1/750 sec. Normally its like 1/250 sec.+ Flash works generally well. Can manually adjust intensity levels +/-2.+ Choice of EV or white balance bracketing up to +/-2. White balance is done either blue-amber or green-magenta.+ Continuous Kelven scale as white balance choice. Well implemented. All white balance presets can be adjusted in a B-A,G-M square grid.+ Fast focus! Focus areas cover most of the screen. Can choose 3D tracking.+ Light metering is great. My shots are almost always nicely exposed.+ AMOLED screen is so awesome. Vibrant. It does better in direct sunlight than my Pentax k-x.+ Buttons and dials well layed out. My copy had good resistance on the mode dial.+ Direct ISO button. Very sought out nowadays. Fn button brings up quick access to everything else in a similar menu layout to Canon compacts.+ Performance is very good for a compact. 10 continuous JPGs took about 13 seconds to fully write to Class 6 sd card. A single RAW file took about ~6 seconds to clear buffer, but you can keep taking photos while thats happening.+ Intervalometer to shoot pictures at set intervals up to 48 hours! In this mode the camera automatically shuts off between shots and turns on its OWN to take pictures. Crazy.+ Panorama shots couldn't be easier to make: Hold shutter, pan, release shutter. Camera can be orientated vertically or horizontally as well as pan vertically or horizontally. Think tall buildings versus landscape.+ High-speed motion videos in 240, 480, and 1000fps. Although, the faster you go the more tiny the resolution. 240fps is usuable.+ High-speed still shots are great with option of 10, 5, or 3 fps shooting. Limited to 10 shots for all choices, but this is at full 10mp resolution. Very nice.+ Can record just sound as voice memos in WAV format...like a voice recorder. Can also attach up to 10 second voice memos directly to photos as you take them. Great idea for short story or reminders of special moments.+ The analog gauges are not gimmicky to me. They rest at zero when camera is off then go to correct levels in real-time when you use the camera. Its like watching an engine rev up. Its much more accurate than a small battery icon with bars. The other gauge is for space left on your sd card (like your gas tank).Movie mode actually gets its own list because its so much.+ Full HD 1920 x 1080 pixels at the cinematic 30 fps with stereo sound is very rare in a compact. Has no interlacing artifacts compared to other competitor's 24 or 25 fps.+ Movie quality is outstanding. Sharp lens and excellent metering helps a lot.+ You can apply vignetting, miniature, or fisheye effects.+ You can pause video recording and resume recording. Camera keeps it as one video.+ Simultaneous still shots during movie recording. While recording you can press the shutter button at any time to take up to 6 full resolution shots. Does not interupt the movie.+ During playback mode while watching your movie, you can pause and choose to capture ANY frame that you paused at and save it as a still photo...ANY and all frames if you wanted to.+ Can choose to mute during zoom. Although, the zoom was not loud at all. To give you an idea, my fingers rustling the camera around was louder.+ Zoom sensitivity during movie recording is automatically lowered so that zooming is slower, smoother, and queiter. If you choose zoom mute, the sound enters back in a fading-in crescendo fashion.All in all a very good value from a little camera that could. I highly recommend it. Make sure you register your warranty with Samsung ;)", "Date": "May 28, 2011"}, {"Title": "Excellent camera but questionable support", "Author": "Cheryl M. Todd", "ReviewID": "R3L6P6GMIGI5YK", "Overall": "4.0", "Content": "After an extensive review of cameras that could be considered in this class, performance wise, (Canon G12, Sony NEX3/5, Panasonic Lumix LX5, Olympus E-PL1, Canon S95, etc.) I selected the TL350 for several reasons.  First, I wanted a quality camera that would fit in a coat pocket because we travel a lot and take a lot of photos on the fly.  While I appreciate the inter-changable lens features of other cameras I didn't want to carry additional \"gear\". I want to be able to shoot quickly without stopping to change the lens to get the proper perspective. I wanted good manual controls because I prefer the flexibility and creativity available in one of the priority or manual shooting modes.  I wanted an ergonomic camera. I wanted a good quality lens. I wanted fill-flash options. I wanted a bright LCD screen. I wanted the ability to shoot in JPEG and RAW. I wanted an intuitive user interface. I wanted a good panorama option, and I wanted a camera that has good battery life. I don't care much about video so I didn't spend a great deal of time on the pros and cons of video for each camera.The TL350 does virtually everything I wanted plus it has an excellent video interface, ease of use with good quality images and sound.  You can even take a photograph while shooting video. It has many more features including Smart Automatic, Program, Aperture Priority, Shutter Priority, Multiple Scene, Burst, Manual, Movie and Dual Image Stabilization Modes. There are a lot of portrait options and the panorama scene mode is a piece of cake to use and worked flawlessly on my last trip. Most people will use Smart Automatic or Aperture Priority Modes but the other modes (other than Dual IS) also provides real options for creative photography because they are full of various filters, EV controls, ability to manage numerous lighting situations, bracketing for 3 separate lighting situations, rapid burst shooting, low light options, multi metering and focusing controls, etc., etc.  You get the idea.  There is post shooting editing controls to adjust exposure, contrast, sharpness and RGB editing.  I've never had these in a camera before and you can do much the same with decent editing software but it's nice to be able to tweak an image on the spot.  On trips I generally review my images each night and will use this feature to make minor adjustments. But the best feature that this camera has, in my opinion, is its Smart Range function. In high contrast images this feature allows the camera to take two simultaneous photos with different exposures, and then overlays the bright area of the underexposed photo and the dark area of the overexposed photo to produce one photo with a dramatic increase in visual range.  Except in extreme situations you can get texture in the low and high values of a relatively high contrast scene.  Before, either the highlights were blown out or there was no detail in the shadow areas.  This reminds me of the zone expansion process Ansel Adams often used to create many of his beautiful images.  I'm told some of the very expensive digital cameras can take up to 5 photos and merge them into one image but that this little inexpensive camera even has the ability to do that with 2 images is outstanding. This feature obviously lowers the local and overall contrast of a scene so I don't find it to be very useful in bright outdoor scenes even when there are dark shadows bright skys because lowering the overall contrast eliminates some of the drama of many scenes but I found it to be a tremendous tool that saved and/or created a number of my photos on a recent trek to some Indian ruins in Utah where there was some extreme local contrast conditions. I intended to post some examples but apparently this review space only allows video posts??? Some people say that the memory card and battery reading dials on the top are gimmicky but I love them.  Just a glance and you know the battery and card status and the battery meter is more precise than the LCD read out anyway. On my recent trip I experimented with a number of the features and found that using the \"cloud\" exposure setting for all exterior photos was better than using the \"sunny\" setting even if it was a bright sunny day.  The color rendition/saturation was better in almost all cases so I now use the \"cloud\" setting for all my \"normal\" exterior photos.  I have found this to be true on all the point and shoots I've owned and it's the same with the TL350.  And, all of this for $239 from Amazon. That's half the price of some of the competition.My biggest concern with going with this camera is that it's a Samsung and I hadn't heard great things about their support services.  I would have felt more comfortable with Canon or Panasonic but the TL350 had all the features I wanted and the reviews were so glowing I decided to overlook it.  Well, I'm already experiencing some problems in this regard.  I'm a Mac user and the Raw Converter software supplied on the CD with the camera is only compatible on a PC.  The manual, which I printed, says there is Raw Conversion software for Macs on the Samsung website.  The problem is you can't find it.  I went through 4 Samsung techs and they didn't know how to locate it either.  One guy even told me it was built into the Mac...NOT.  A day later their tech department actually called me and said that it was available on the Samsung \"Imaging\" web page which is different from the Samsung web site.  I found it there and loaded it onto my Mac.  Great, good follow up support and problem solved...I thought. When I tried to load the Raw files to my Mac the files were still rejected as unrecognizable.  All the JPEG files loaded fine.  I called tech support back and they have no idea why the files won't download.  Their answer is to call Apple.  Great, another day and half wasted talking to techs who should know what their products do and don't do.  For now I'll just load the JPEG files into iPhoto.  I'll pursue the RAW issue another time...aaarrrggghhh!Update 4/9/2011: I have still been unable to download RAW images onto my iMac.  I've talked to knowledgeable people and they recommended that I update my iPhoto to the current version which I did.  iPhoto still didn't recognize the RAW files.  I even downloaded and installed Adobe's DNG RAW converter which states that it recognizes and converts RAW files from the TL350 but when attempting to transfer RAW files from the camera iPhoto still didn't recognize the files.  At this point I'm trying some other options and am considering installing Apple's Aperture to see if that does the trick but I'm not sure what's causing the problem and there's no guarantee Aperture will recognize the files either since it's an Apple iPhoto upgrade. I think it's probably an Apple iPhoto issue and not a Samsung issue.  Since the TL350 is relatively new it may be that iPhoto doesn't have a recent upgrade that recognizes the TL350 RAW files. There's a solution...I just have to find it.I've enumerated above the excellent positive features of the camera.  The cons for me are:1.  I have large hands and the camera is actually a little too small but the grip pad on the right side does make it easier to hold and it's easy to drop it into a pocket. A person with \"average\" size hands will find this camera very comfortable and easy to hold.2.  The USB cable supplied is about half as long as it should be.  Not too big a deal but why would they make it so short?3.  Others have said battery life is excellent. It's OK, but I haven't found it to be all that great so I bought an extra battery and that works well for me.4.  Tech support staff very friendly but woefully lacking in knowledge about their own products.5.  If you want the full manual, which I would suggest, you have to print it and it's 131 pages!6.  The vertical mode dial on the side of the camera for timer and burst mode images is a little awkward to use but that's a minor nitpick and I don't use burst mode much anyway.7.  After using the camera in bright sunny conditions as well as in subdued light I think the biggest negative with this camera is that there's no viewfinder.  Even though it has a great LDC screen I really would have appreciated an accurate viewfinder when I was in bright light situations. That would make this camera a perfect compact point and shoot option.In summary I would give the camera 4.5 stars (would have been 5 with a good viewfinder) and Samsung 3 stars.If you're NOT a Mac user who wants to shoot some images in RAW this is a great little camera (and it's possible that problem is a Mac iPhoto issue and not a Samsung issue) .  If I get a fix for this issue I'll update my evaluation. I really like the manual options, features and versatility of this camera and I unhesitatingly recommend the TL350 to friends.  By the way, this camera doesn't come with a carrying case but the Caselogic TBC-312 Pocket Video Camcorder Case is a perfect fit with an exterior pocket to carry an extra battery and memory card or two.", "Date": "April 1, 2011"}, {"Title": "Patience is rewarded, has quirks", "Author": "DRPBL", "ReviewID": "R16T9VEA7VDFY0", "Overall": "5.0", "Content": "UPDATE: DEC 2010 - As was recommended in comments,  I updated the firmwear.  Mode dial sensitivity and roller bar problems are gone. I give this camera now 5 Stars.Previous review BEFORE firmwear update:The TL-350 has more features than most equivalent cameras, and takes decent photos even at higher ISO levels (ISO 400 is quite good). But it needs some attention.  I purchased it to replace a dropped LUMIX DMC LZ5, which was a great travel workhorse. The Samsung takes reasonable RAW, processes them quickly, and has a very usable zoom range. Lens is fairly fast. 1080p video is great, panorama stitching is great, takes both raw and jpeg simultaneously, takes jpegs while in video mode, and has reasonable battery life.The good: Small, and feature packed. Feels very well built. Takes nice travel quality photos ONCE you figure out how to press the forward-angled shutter release without touching the mode dial. The two analog battery and memory storage capacity dials actually are a nice touch.The bad: The top mode dial is extremely sensitive. Will shift you in and out of mode just by touching it. Caused ghosting of images, much like double exposures. Keep your shutter finger away from it.The rear \"roller\" selector for adjusting bracketing fps and shutter timer is another weird one. You have to keep rolling it like a low res pc trackball to select what you want. An annoyance. ISO 80 is not as noise free as I would have expected, but noise does not increase significantly at higher ISOs.Bottom line: I came close to returning it due to the undocumented \"double exposure feature\", but took the time to work through it's quirks's. A professional photographer friend claimed my pictures were of \"average\" quality, which I took as \"pretty good\" for the sensor size and camera cost.  If you want to play with high-end camera features, but are not willing to go to the larger form factor and cost of a micro 4/3 to get better quality, this will do it for under $300.October 2010 Update: one month later - the high speed video recording is a blast - playback in slo-mo shows you a whole new set of micro features of your world you never appreciated. Worth buying for this feature alone, especially if you have children or pets. Re: picture quality - as stated above, high ISO photos are very good, and now appreciate that the dual anti-shake mode works so well in low light. I have not owned a camera yet this versatile. Would go five stars if it had just a bit better picture quality when shooting at \"optimal\" settings (e.g. ISO 80) and did not have the roller bar control mentioned above.  Analog dials are now addictive. Give this serious thought if you are a looking for rewarding \"play with\" camera.", "Date": "September 28, 2010"}, {"Title": "Better than S95, LX5, and FH100 for video", "Author": "Jeff Aski", "ReviewID": "R3HDUFU437IL6S", "Overall": "5.0", "Content": "This is the best point and shoot camera for indie filmmakers and no one knows about it.I've owned a Canon S95, Panasonic LX5, and a Casio FH100.  While they each had their advantages, the TL350 had the best bang for the buck.Let's look at the specs that matter for video on all these cameras - they all have manual control over exposure, shutter speed, aperture, white balance, and ISO, so I'm skipping that:Canon S95- 1/1.7\" CCD- 28-105mm- f/2.0-f/4.9- MPEG-4/H.264 .MOV- Stereo Linear PCM audio- 1280x720 @ 24fpsPanasonic LX5- 1/1.63 CCD- 24-90mm- f/2.0-f/3.3- AVCHD Lite/MJPEG- Dolby audio- 1280x720 @ 30fpsCasio FH100- 1/2.3 CMOS- 24-240mm- f/3.2-f/5.7- AVI/MJPEG- IMA-ADPCM stereo audio- 1280x720 @ 30fpsSamsung TL350- 1/2.4 CMOS- 24-120mm- f/2.4-f/5.8- MPEG-4/H.264- AAC, WAV Stereo audio- 1920x1080 & 1280x720 @ 30fpsHere's why the Samsung TL350 is the best:(1) Price. Don't know if this is a big deal for you, but for me, under $250 is a bargain.  Especially for the only camera to shoot 1080p video.  The S95 has been pushing $400 since it's been released.  Way too much.(2) Best Focal length/F-stop balance.  The LX5 only goes up to 90mm.  The S95 only goes down to 28mm.  The FH100 has a great 24-240mm range, but suffers horribly from a slow lens at only f/3.2 - it's not that great in low light.(3) Back display.  I don't know the exact specs, but the display on the TL350 blows all the other compacts out of the water.  It's sharper and brighter and reminds me of the display from the iPhone 4.(4) Build quality.  The S95 is too small.  The LX5 is too big.  The FH100 is too thick.  The TL350. . .just right.  Also, the old school battery and storage gauges on the top of the TL350 makes it fast and easy to always know how much power and card space you have.  You think that doesn't matter, but it's very convenient.(5) Video quality.  Now this has a lot to do with a combination of factors.  It starts with the sensor, then the lens, and finally the frame rate and codec.  The LX5 gives the best video quality.  There's no contest here.  LX5 is brilliant.  So why is it not better than the TL350?  Because you would never bring an LX5 with you.  It's a monster.  It will not fit in your pocket.  It has a lens cap that will probably get lost.  You might as well get the Panasonic GH2 or GF2 or the Olympus Pen.  So saying the LX5 has better video quality than the TL350 is like saying the Canon 7D has better video quality.  Yeah, of course it does, because it's a completely different kind of camera.If you want a small compact point and shoot that you can put in your pocket and take anywhere AND that will give you excellent film-like video.  Get the Samsung TL350.  It boggles my mind that everyone is beating off to the Canon S95 when the TL350 has more features, 1080p video, and for almost half the price.", "Date": "March 2, 2011"}, {"Title": "Great camera, better then S90 and LX3", "Author": "SM", "ReviewID": "RR7B9O6QTH45C", "Overall": "5.0", "Content": "3 days ago I bought 2 Samsung cameras: TL350 and TL500. Both of them are just awesome!I also bought Canon S90 and Panasonic LX3 2 weeks ago.After testing all 4 cameras I found out that even TL350 beats both S90 and LX3.Quality of both indoor and outdoor images and white balance are visibly better when using TL350 vs. to S90 and LX3.Pros - terrific Amoled screen - good image quality (most important characteristic) - great white balance for the most situations - good HD movie quality - great body construction - good ergonomicsCons - there is no external charger, the USB cord is too shortI highly recommend to buy the TL350.Tomorrow I am going to send back to the store both S90 and LX3 (thanks to Amazon for its great refund policy)", "Date": "August 9, 2010"}, {"Title": "Impressive", "Author": "Zacc", "ReviewID": "R2DPM9945W6V9V", "Overall": "4.0", "Content": "You're probably tired of reading lengthy consumer comments if you are looking for a compact camera with top notch features and image quality so I'll keep this short.IQ on this cam is better than ANY other compact I have tried, (and I have tried them all) by using my memory cards in store display cameras then analyzing them on my computer.Amoled screen is outstandingShot to shot time is very fast as long as you are not using in-camera picture editing such as beauty mode which softens skin tones. Any in-camera processing will slow the processing time in the camera. I can take continuous pictures almost as fast as I can press the shutter. There are also numerous high speed shooting modes for action shots.Beauty mode is amazing for shooting portraits. It effective smooths skin and hides wrinkles and skin imperfections similar to post processing.Colors are exceptional with minimal adjustments. Skin tone is consistently accurate even when shot indoors with flash. The flash intensity does need to be adjusted to the conditions but I find the flash very effective and capable. This is hard to find in a compact. There are five flash intensity settings.Auto Focus is quick and accurate.Video is amazing in good light. It also gives you the ability to shoot still pictures while using the video without interruption.Low light photo's without flash are very good with minimal noise. This is due to the bright lens.I thought I would miss having a high power zoom but that's not the case. 5x is adequate for 95% of my shooting.Overall, I would rate this camera a solid 9 on the scale of 1-10. This is my main go-to camera anytime I travel and need a lightweight and small carry along. My wife uses only the smart Auto mode for her shots. The pictures consistently come out sharp with good color and accurate white balance. Don't hesitate buying Samsung just because it's not a Panasonic, Nikon or Cannon. They knocked the ball out of the park with this model. BTW, I don't give 5 star ratings unless a camera does EVERYTHING better than every other camera out there. There's just no such beast.", "Date": "August 22, 2010"}, {"Title": "Well said \"to good to be true\"", "Author": "Ghosted \"cw amaz\"", "ReviewID": "R3O3B8K1QOGN88", "Overall": "2.0", "Content": "Wholeheartedly agree with the other reviewer who indicated that the camera, as advertised, is too good to be true. Here is my list of the advertised \"feature\" and the corresponding reality:1. RAW format support. Samsung had opted not to support the universally compatible DNG format for their own version of RAW, SRW. Now if Samsung worked with major companies like Apple (who's iPhoto and Aperture apps represent two of the three most popular photo library apps) to insure support this wouldn't be an issue. Unfortunately Lightroom is the only major app at the time I write this that supports it. Thankfully if you have a lightroom workflow then that support is quite good. Kudos for Adobe. Lightroom also helps with issue number two.2. Schneider Kreuznach Lens. While the optics on this camera are quite good in terms of detail and color fidelity (much of which is a function of the sensor) the lens has a significant weakness in terms of barrel distortion distortion. It's significant enough to really alter the feel of photos (it's had not to have your eyes drawn to an object you expect to be flat, say like a wall, and have it be curved in a photo. Lightroom has a lens correction feature so again, if you have a lightroom workflow this is significantly less of an issue. While I wouldn't want to software correction in a professional situation, this is a point and shoot camera after all.3. Video Capture Capability. This is where they really let go from a QC standpoint. The camera is (hopefully they will correct this) as capable of shooting 720p video at 240 frames per second. This feature does not exist at all. They advertise several other frame per second options, however it's not obvious without looking at the manual that each of these has resolution limitations, most of which are so low that this feature becomes more of a toy than a tool. Metering seems broken in video mode when shooting in anything other than 30FPS, with images being significantly under exposed. 1080p recording allows no control of bit rate and the default rate seems a bit low (read: quality isn't what it could be). There is no audio in the other FPS modes. Playback of the FPS modes ends up with a time laps photo effect, which could be a sought after effect but shouldn't be the default. That could be corrected in software, but that's asking a lot of a user to know how to do.4. Advanced Programing. I'm just going to lump up all my thoughts into one broad category. The user interface is mediocre and non standard. This is the only camera that I have to spend time re-familiarizing myself with each time I go to use it. It's a pain for me, but if you just use the auto settings it shouldn't be an issue. Heck, if you're more clever than I then perhaps it won't be an issue. But it was for me, your mileage may vary.Finally the folcus and metering seem slow sometimes with a delay that isn't there on more scenic shots. Still, the photos it does take are quite nice. If you use lightroom and only think of the video as a convenience feature then you might be completely happy with this camera. If you don't want to shoot in RAW at all, you might be happy.But for those features you could be in the $140 category. That this unit is significantly less than the Canon equivalent is what saves it from a one star. Still, had I to do it again I would have spent the hundred extra bucks.", "Date": "April 16, 2011"}, {"Title": "AWESOME!", "Author": "courtney", "ReviewID": "R1335INYFWM152", "Overall": "5.0", "Content": "I didn't buy this camera from amazon. I actually bought it from buydig(dot)com because it was cheaper. before i purchased the camera i read reviews on amazon so i thought it was only fair that i posted my thoughts on the camera.THIS CAMERA IS AMAZING!it is seriously the BEST camera i have ever had!! it takes SUCH amazing pictures! it was a little difficult for me to get used to the settings because I just take pictures for fun i'm not too sure about things like shutter speed and things like that. the screen completely blows my mind. it is so vivid (much vivid than the upload keep that in mind! but the upload is STILL very very VERY clear!)!i use this camera with the sandisk extreme 8GB class 10 memory card! for those wanting to use 16GB i called samsung and they DO NOT recommend using a 16GB card. I'm not sure why this is but i was told to use a 8GB SDHC class 6 or above. the only thing that is kind of a bummer is you can't shoot say black and white while in fish eye mode and stuff like that but thats okay! :)", "Date": "March 3, 2011"}, {"Title": "Honeymoon Camera", "Author": "John Spirit \"JetSon\"", "ReviewID": "R1LUG8YAR7HECD", "Overall": "5.0", "Content": "We bought this camera for our honeymoon, and it was absolutely perfect.  The panaramic mode is fantastic, works really well.  Video recording is easy.  Picture quality is great.  Battery life is long.  No problems with anything.", "Date": "February 17, 2011"}, {"Title": "Best overall if you're looking for 1080 HD video", "Author": "Hernan Parra", "ReviewID": "R32SKXHF9VQ38E", "Overall": "5.0", "Content": "Buy this instead the lx5 or s95 if you want a great prosumer photo camera with usable 1080HD video and you can sacrifice some luminosity and sensor size. You get more zoom, autofocus while filming, nice amoled screen and smaller size.", "Date": "December 9, 2010"}, {"Title": "Hot little camera!", "Author": "pbinner", "ReviewID": "R2B4FK3N50DSOC", "Overall": "4.0", "Content": "Stumbled onto this camera by chance, was poking around for a small compact that shot raw files, had a wide angle, fast quality lens and some telephoto. Manual controls were important and I needed good macro ability too.Read as many current reviews as I could find as Samsung is relatively new compared to the other popular brands. I did buy a small point and shoot 4 yrs ago (Samsung) and had to return it as it completely failed after 3 days.Because of the camera options and the unbelievable  current price of this camera, I thought I'd give it a shot and bought one. One of the reviews I read described this camera as a \"sleeper\", I have to say that this is defiantly the case!This is a \"Hot little camera\"! Once you figure out how to work the many options available, what you can or can not do in a particular mode (some functions are not available in RAW and various other functions, you have to remember what you have selected if you are using different modes), the fun begins.The picture quality is fantastic! Keeping in mind that this is only a \"point and shoot\", the low light and close up shots are stunning. The controls over the White Balance as well as in Manual (there is even a manual focus in macro) along with many other options, give this camera terrific shooting controls. You need to play with it for a few days to discover all the options. Has an in camera panorama stitching as well as an interesting \"action\" panorama mode and then there are all the video options, I haven't even gotten to them yet. How about \"time lapse\" too, I love it!It also has a good solid feel to it and for the most part feels good in your hand. Very compact, easy to carry in your pocket, great travel camera!There are a few \"Quirky\" things... the barrel roller where your thumb fits at the back, adjusts self timer, burst, and video FPS. etc., it's different but you can get used to it. Would like to see more EXIF info on the playback screen but the \"Function\" button is a great feature! The 2 dials on the top, show battery and card amount, are great, quick and easy to read, I like it. This is replacing my Panasonic DCM FX 500, there is no comparison although they are very similar in many aspects, the WB2000 is easier to use and far surpasses the Panasonic in picture quality and controls.The one disappointment with this package is that Samsung has restricted the RAW file management to Silkypix 4. Hopefully there will be a change to this (software upgrade PLEASE!) as this makes no sense in today's digital world. Sure you can work with it but it is very limited and there are other more interesting editors available and Samsung should give their customers the choice. JPEG management is not a problem.That aside and sure there are compromises and limitations that some people will find but this is a fun and sophisticated point & shoot, you need a bit of experience to work with this if you want to use the options available otherwise look at something else. For the price, you won't find anything as good as this and it deserves a chance along with the very few other popular brands that offer all the functions that come with this camera.", "Date": "May 15, 2011"}, {"Title": "Great high-ISO camera", "Author": "Goliath", "ReviewID": "R3THXHB9A3WPYZ", "Overall": "5.0", "Content": "I was looking for a compact that combined good high-ISO performance (my last camera was a Fuji Finepix F10) and full HD video. The TL350 is one of the few cameras that excels in both. I was initially disappointed by the noise at ISO 800 and above UNTIL I tried taking pictures in RAW. At 800, 1600 and 3200, if you shoot in RAW and fix the noise yourself (I use Adobe Lightroom), the results are excellent.I'm very satisfied by this camera - nice size, beautiful display, and good manual control. The two minor drawbacks for me are the couple seconds it takes to start recording video after pressing the button and the lack of an ISO-priority mode. Regardless of this I think for now, in this class, the TL350 provides the best combination of low light photography and video capability.", "Date": "December 6, 2010"}, {"Title": "Powerful Compact Camera", "Author": "bigrig", "ReviewID": "R2C5OXYKA0KREM", "Overall": "4.0", "Content": "Pros -Widest angle lens available in compact (24mm)2.4 aperture is pretty good for low light (Not as good as Canon S95 2.0)Manual Controls and RAW format imagesGood balance between noise reduction/detail1080p HD Video, with the ability to take full-size stills10 frames per second shootingSmall sizeCons -No user customization of controlsWhite Balance drifts during videoSamsung RAW Converter softwareNo stand-alone battery charger includedNo Type D micro-HDMI cable includedI like to shoot without flash when possible - this camera enables that with a fast 2.4 aperture and low noise levels from the 10MP sensor.  ISO 400 noise is fairly low, ISO 800 is usable.  This is in comparison to my Canon DSLR, where ISO 1600 noise is low, and ISO 3200 usable.I did not find the Samsung RAW Converter software easy to use.  But Lightroom 3.3 now supports the TL350 RAW format and I am happy with that.I was disappointed no stand-alone battery charger was included, or the Type D micro-HDMI cable needed to connect the camera to a HDTV.  But I was able to pick those up cheap off ebay.My main complaint is the user interface.  If the functions of the thumbwheel and navigation wheel were able to be customized by the user (like on the Canon S95), it would make changing settings faster, and the camera would be more enjoyable to use.  I'm hoping Samsung addresses this with a firmware update, and I could improve my rating to 5 stars.", "Date": "November 2, 2010"}, {"Title": "Questionable reliability!", "Author": "Jeff \"H\"", "ReviewID": "RS5YWJAKPIEX5", "Overall": "1.0", "Content": "I bought this on January of this year.  But even before I bought this I did all my homework checking reviews and firmware updates and making sure that what I was buying is what I wanted.  So upon reading the reviews I decided it was worth a try.  Once I received it, I charged up the battery, I followed the step by step instruction to update the camera's firmware precisely because Samsung warned that premature shut off of the camera will result in damage.  Once all of that was done, I took some pictures and videos and uploaded it into my computer.  I installed the program that came with it and found it to be useless because it didn't add anything to my viewing experience of the pictures or videos I just created.  In fact the video player was awful.  For some reason it distorted the movie upon viewing.  I tried other media player like VLC player and windows media player and both show an awful horizontal type of distortion on the top side.  But when I used Apple's QuickTime player, it displayed the movie without any distortions.  So I recommend people use this program when viewing movies.OK, now this is where Samsung truly failed for me.  I took multiple picture and videos, about one hundred or so, and review these and noticed that a couple of pictures were coming out weird because I noticed horizontal distortion and weird light exposures.  At this point I was worried about what could have been the problem.  I thought at first  the \"Transcend 32 GB Class 10 SDHC Flash Memory Card TS32GSDHC10E\" was deflective, so I bought another SCHD card, this time from Best Buy \"SanDisk - Extreme HD Video 8GB Secure Digital High Capacity (SDHC) Memory Card\" because I was in a hurry to test a card with a smaller size with a reliable brand name with good reviews.  To my surprise, the picture I took with this new card did the same thing.I called Samsung, explained the situation, they did a couple of troubleshooting, and the problems kept on appearing.  They told me to ship it for repairs, so I did.  Got it back a week or two later and it worked fine without anymore problems.  I don't have the original paper that showed the repairs done, but I remember it stated they repaired a couple of things like the light sensors.  Anyway this whole experience was stressful.  Even now I'm very caution about the reliability of the camera.  I haven't used it for months until today, hence the reason I'm writing this review.Anyway, once the camera was in working order, I would say the picture quality is fairly good.  The videos are video clips, limited to 20 minutes intervals.  The 30 fps becomes noticeable when I panned away or when an object is moving really fast creating a jittery effect, however the video is very detail since it's 1080p.  Video mode does not allow manual focus, lighting, and exposure.  When taking picture while taking videos, the picture aren't that great because it lack the manual control function, no option to even flash.  Zooming in and out will be noticeable through the audio because it creates buzzing sounds.  The panoramic view decrease resolution, so I don't think I will be using that at all.  And the overall layout of the buttons and dial is not that great.So in conclusion, I think you're better off with a Canon S95, which I heard take absolutely beautiful picture at par with SLR cameras.-----------------------------------------------------Updated on 6-13-2011:  Currently I'm in the process of getting a refund from Samsung.  About a week ago I was getting ready to use this camera for a graduation for one of my family and I was testing the camera after months of idleness.  When I tested the movie clip mode, I noticed that there's a couple of dead pixels that appeared in the movie clips I recorded.  It's extremely noticeable as the room got darker.  I ruled out the LCD as the cause because the problem also showed up when I viewed it from my computer.  I made sure the lens were cleared and it still had the problem.  I call Samsung and they told me to send it back for repairs once again.  Couples days later, I got a call back and they told me it was not repairable.  I assume this problem was created when they first repair the camera for the horizontal distortion.  When I tested the movie mode months ago, I didn't notice it because all the shots were taking in bright areas with good lighting must of hidden the dead or sucked pixels from appearing in the shots.Samsung couldn't offer a replacement because there weren't any TL350 in stock.  Perhaps if I gotten a working TL350, I would have rated this high like everyone else, but probability was against me when I got my deflective camera.  So I will have to give this a rating of 1 for defectiveness.  There's no way I can rate this higher since I don't have a proper working camera in hand.", "Date": "May 26, 2011"}, {"Title": "Great camera!", "Author": "Dawid S Swierczek", "ReviewID": "ROS3M7R4YRYA4", "Overall": "5.0", "Content": "I've heard people say \"don't buy Samsung\". I knew some of their cameras had a problem with with focus. I've ignored it and I bought this camera. The camera feels like it was made from titanium while others feel like cheap plastic so that's a huge plus for TL350. It has so many options I don't even know where to look for settings I need (although over time I'll learn). But the menu itself is made so that a total newbie can use this camera without a problem (but I recommend reading the manual first).The Auto setting works great. It controls every setting brilliantly and so far focus works. I personally prefer the Manual setting. For shooting video you can even choose what lighting are you using. I use halogen lamps, and it has that option right in it. Didn't try it yet but sure will.I've had this camera only for a day, and if any problems occur I will update this review to let you know.", "Date": "August 25, 2010"}, {"Title": "awesome cam that can do what other point and shoots can't", "Author": "Jeffrey Rubin", "ReviewID": "R2EWBKBO1JT1Q9", "Overall": "5.0", "Content": "Look, let's be real here. You can get a feel for a camera from handling one in store, but only to the extent that you can assess ergonomics.do you know how many times the display model has fallen out of its mount and onto the floor, been manhandled by customers, etc.? how many damaging slams has the lens taken? And so on.The real proof of this item's value is what it can do that competing cams can't match: YOU can shoot real HD video AND 10 MP photos at the SAME TIME! this greatly enhances your chances of capturing the kinds of memories you'll want to save and cherish.I've got a sony TX-7. wonderful cam. i'm not giving it up. but when there's a rare occasion and i want to make sure i document it properly, the sony will give way to the samsung.", "Date": "July 31, 2010"}, {"Title": "great camera", "Author": "GS4 owner", "ReviewID": "R3S7RV5FVMBS2Q", "Overall": "5.0", "Content": "Bought this camera several years ago to replace my aging KODAK point and shoot.Needed something that had 1080p videoThis camera came at a descent price and has worked very well in several environments.PROs: high quality images and video at 1080p, several image options including panoramic modeCONs: tends to loose a charge over time have to make sure it is charged 24 hrs before use", "Date": "January 11, 2014"}, {"Title": "Good value", "Author": "Hockey Person", "ReviewID": "R13KVBHH7OZ44N", "Overall": "5.0", "Content": "I love to shot  in slow motion.  This is a good low price show what happens a speed to fast in normal speed.", "Date": "November 13, 2013"}, {"Title": "GREAT PRODUCT", "Author": "Francisco Sener", "ReviewID": "R348I3DTDWGKZU", "Overall": "5.0", "Content": "THIS WAS A GREAT GIFT FOR MY WIFE AND IT WORKED GOOD FOR HER. SHE BOUGHT ME THE SAME MODEL FOR ME FOR MY BIRTHDAY AND MINE HAD ISSUES SWITCHING MODES AND MENUS ON ITS OWN - THE FIRST ONE WAS A GREAT DEAL. THE SECOND ONE WE BOUGHT WAS A TOTAL DISASTER!", "Date": "February 13, 2013"}, {"Title": "Very little noise in the photo", "Author": "Olha", "ReviewID": "R7S1ZMGVOH6X", "Overall": "5.0", "Content": "Product is a 2010 release but to this day he has no competitors (very little noise in the photo) 5 stars", "Date": "December 25, 2012"}, {"Title": "Could've been the best P&S; if not for the quirks", "Author": "K. Shin", "ReviewID": "RS9RRW9WUTW70", "Overall": "3.0", "Content": "ARRRGH!!!This is how I feel when it comes to Samsung TL350 (WB2000). It could've been so good. This camera could've been an ethusiast's dream P&S; camera.(BTW, it's 7/2012 now and this camera is long out of production)Samsung TL350 is a decent camera with tons of controls. I like the photos in general but it's a bit bland. I have the setting on Vivid at all times. Even then, I pump up the color and contrast later on my computer. Low light capability is quite decent. There is a \"DUAL\" mode which automatically bumps up the ISO to 800 and of course applies IS. I find myself using this a lot indoors, esp in restaurants. The pics at 800 are a bit grainy but it's fine for general use and looking on computers. Note, in terms of low-light, there's no competition here against Canon's popular S95/S100, G12, Nikon P300/P310, Panny LX5 and other similar cameras. First, the sensor size is one of those small ones found in most other p&s; camera. Then the max aperture tops out at 2.4 compared to 1.8 and 2.0 from the competition. It's not bad in low-light, just not the best in class.Zoom range of 5x is very nice and at the time of release, it beat out S95, P300, and LX5, but did it at a sacrifice to the max aperture.Video is fine but can be slow to start.  Video's audio capture is fine too but it seems to drown out bass and the mic is ill-placed at top and to the very left edge so on more than one occasion, I've covered it up with my finger. Also, there is audio attenuation to prevent clipping in very loud settngs (like concerts). This is great but the very first split second of the video is not attenuated. Thus, in loud places, you hear a loud \"pop\" then the camera immediately attenuates to normal levels. This is a bit annoying b/c I must cut that out later via video editing software and it can get cumbersome. However many cameras seem to do this. I wish they'd all cut the first split second out. 1080p is recorded without a hitch; just make sure you use a quality class 6 or 10 card.  The separate video record button is also very convenient. It's becoming more of a standard feature now and this is good.  You can press the shutter button during video but note, you're not taking full res images on top of recording the video. You're simply taking a freeze-frame of one of the video's frames and recording that as a photo, thus the res is 1920x1080.The analog meters for battery and memory card usage are completely unnecessary. That said, they're cool to look at. They scream retro and make the camera stand out from a design angle.What kills it for me is that this camera is SLOOOOOOW. It's painfully slow.If you turn it on and press the shutter right away, it's not bad. However if you want to mess with the settings like I do - whether it's ISO, AWB, EV, or any other real and useful settings, then you must wait until the camera fully \"powers up\".  By this I mean, it takes about 5 seconds for you to be able to change these settings. You know when it's ready when you see the analog dials for battery and memory card move to their positions.  For example, I turn the camera on and immediately I hit the ISO button on the control dial. Click... click...click, click, click... it just won't do anything!  Then finally after the camera is ready and the analog dials move into place, you're able to go to the ISO screen to change the settings.  Let's say I took a close up of my lunch earlier so the camera was in macro mode.  Later I turn on the camera to capture a \"Kodak moment\" afar. However the image is blurry b/c the camera is set to macro. So to get it back to normal, I have to sit there and wait 5 seconds. By then, I've missed the shot.  You get the point...This is simply unacceptable. It's too frustrating to use. If the reason the camera is so slow to start is b/c it has to wait for those analog gauges to sweep into place, then it's a major fail. I hope that's not the case.  On top of that, the general speed of camera navigation is very slow to respond to your button clicks. Perhaps the software is not optimized or the processor is painfully slow; as such, these things add to the frustration. It's just not a \"snappy\" camera.Now, you can use the \"Fn\" button as a shortcut to the commonly adjusted settings (i.e. mp count, Jpeg vs RAW, EV, AWB, metering, etc) more detailed full menu. This button is quite handy actually. Unfortunately, this too takes 5 seconds to access from startup. It's just too slow. I do wish there was one more button on the back for direct access to EV. That way, both ISO and EV would've been just a button press away.Another could've been is that the camera has 2 control dials - excellent! But they can not be used for controlling aperture and shutter separately with each dial. The regular circular dial controls both (swapping turns) and the well placed vertical rotating switch only controls things like number of frames, timer, and backlit mode, which is wasteful to NOT use such a precious dial for shutter for example.With all that said, why did I get this camera?  Well for a few reasons:1. I did not know all the quirks (esp about camera's operation speed) prior to buying.2. Other reviews were generally really good.3. Had tons of features.4. Price was so much better than the rest. I got mine in Feb 2011 for $225. A bargain compared to the $360-399 S95 at the time.If you're now in the market to get one used or at a bargain, consider the frustrations of it being a very slow camera.", "Date": "July 15, 2012"}, {"Title": "Favorite camera yet", "Author": "Kyle \"cylem\"", "ReviewID": "RUW9FZ9XSJSEO", "Overall": "5.0", "Content": "I had a canon s95 and it was alright but i really thought it was limited on features. I missed my old casio fc100 with its high speed features. Sure the s95 took great pictures for a pas but really the quality between good and average pos cameras. If your really serious about that you want an slr. WhT i get a compact camera for is to not miss moments plain and simple. This camera with its precapture, interval shooting, 1080p video, 10fps picture taking, high fps video, capturing photos while shooting video, zoom function during video, plus a 5x zoom. These are Ll things this camera has that the s95 doesnt have but this does. Everyone is hating on the right side thumb wheel and i thought i would hate it but i find it very handy, i hear updating your firmware helps with it s make sure to do that.What does the s95 have over this? The control ring is cool but not more useful than just the real dial on the camera which the s350 has. And some features like step zoom with it felt kinda pointless. It has a few color modes too and an annoying popup zoom. Its also a decent bit more expensive depending on where you look, so really unless you need the front control ring or small bump in photo quality then the choice is simple.Ive owned 3 canons, an olympus, fuji, kodak, samsung, casio, nikon, sony, panasonic camera and this is so far my favorite, for a close second i would look at the casio fc100 or 150 they are awesome hih speed shooters as well with a few different sppedier settings.", "Date": "January 12, 2012"}, {"Title": "I would buy this Camera Again!", "Author": "T. Swanson", "ReviewID": "R3T2625TTDHOUD", "Overall": "4.0", "Content": "There are some good reviews already, so I will just add some specific comments. This is a great automatic and manually controllable camera (aperture, ISO, etc.) that is solidly built with a lot more positive than negative qualities.VIDEO:  The videos are very good and in HD but when there is no sound you can hear a low level gear noise in the background coming from inside the camera.PICTURES: I also have a Sony and Canon pocket digital camera and they take good pictures, but when I send pictures to my friends or post on facebook I get more positive comments about how good the pictures are. I also like that it allows the user to work with raw data.SCREEN: Outside landscape or people shots are easily seen on this screen. I take a lot of pictures of rock art and ruins in the bright Four Corners sunlight and many times with my Sony and Canon digital cameras I can barely discern the rock art I am trying to photograph. Often I have missed portions of the rock art because of this difficulty. The Screen on this camera provides the best images for me to see in bright sunlight of any of my cameras. There are still times I do not capture the entire object, but this happens far less often than with my other cameras.CAMERA MODES: All of the camera modes work well but one and that is the SMART(?) camera mode. Smart camera mode is actually an oxymoron for this camera as it frequently gets confused and cycles through scene types for minutes at a time trying to figure out whether it is a landscape, portrait, etc, and it will not let you take a picture. Sometimes I have held the button to take a picture down for more than a minute and no picture is taken when it accidently gets into the SMART mode.  I avoid using this mode and pick the fixed aperture or ISO modes and the camera works great. Related to this as others have writen, the camera mode button easily turns when you handle the camera and it can move into a different mode like smart when you want it in aperture. There have been times I wanted to take a quick photo of moving wildlife and never get a photo because the button turned to the SMART mode. Other times I want to take a stil and find out it moved into the video mode--very frustrating!FOCUS/DIGITAL ZOOM: There is a mult-point focus mode which I like to use since I often take photos with some things close and others farther away and I want them all in focus. It works great except in this mode the digital zoom is disabled. I often switch between modes so I can use digital zoom to photograph something a long ways away and let it use the single point focus. I have tested some photos using both the multipoint and single point focus modes and do not notice very little if any difference, so I just leave the camera in single point focus so I can always use digital zoom. At high digital zoom levels you need to hold the camera fairly steady or the shot will be out of focus. This has happen several times so I often take 2-3 photos of the same subject at long ranges to make sure at least one of them comes out good.BUILD QUALITY: It feels more solidly built than most of the other pocket camera and even the newer Canons in my opinion. I dropped it once from about 3 feet high on a rock and everything still works.BATTERY LIFE: I have taken 200-300 pictures in a day and never had the battery run down. After every days use I recharge the battery and even carry a spar battery but have not had to use it in the 8 months I have had the camera.OTHER: A couple of times the camera has locked up and I could not do anything, even turn it off. To get out of this state I had to remove the battery and then the camera worked great again.EDITING SOFTWARE: It is ok, but I like the PMB software that comes with Canon much better. Gimp 2.6 is a FREEWARE product that is very good, but I find myself liking the results best from Photoshop Elements 8.BATTERY CHARGING: ; Yes charging the battery is mainly done in the camera, but I bought an external charger on ebay for $5.99 that works outside the camera and can be plugged into a car's cigarette lighter.This is a very good camera that would be a 5 star camera: if the SMART mode didn't get stuck in cycles trying to determine the scenery type and preventing you from taking a picture; the camera mode would stay in the mode selected, and the gear noise when taking videos was not present (my second TL350 since the noise was so loud on the first TL350 I had that It was returned).", "Date": "September 1, 2011"}, {"Title": "awesome feature-packed camera", "Author": "Mike", "ReviewID": "RLOZ5UZTYR8DV", "Overall": "5.0", "Content": "I bought this for $240 on another site and am totally happy with it. The camera has a cool retro look (yes, I like the dials on top!), an amazing screen, and a really solid feel. It's not a DSLR but it takes much better pictures than I expected at this price and is packed with a ton of useful features to get creative with. For those who don't care to mess with shutter speed or aperture, the scene modes are very useful and the smart auto mode usually works well. I've had no problems with battery life though I do keep a spare. The image stabilization could be better in low light but other than that I have no complaints. In my opinion, it's the best camera in its price range.", "Date": "August 16, 2011"}, {"Title": "Great camera.", "Author": "larryws1098", "ReviewID": "R32XEW3CH9RY78", "Overall": "5.0", "Content": "I purchased this camera used and got a very good camera for less than I had expected to pay.  It takes a wide angle picture and is crisp and clear. Zoom is actual lens and 5x.  The display is incredible, as big as most of the back of the camera and so bright I can see it in sunshine.  When viewing images you can use the zoom to enlarge the picture to examine the clarity of details.  I was needing a camera that would take flash pictures of the grandkids without having to wait for the flash to charge between takes, the kids are allways moving.  I can get flashes off every 3 seconds.  The charge is during idle time if you put it on flash setting.  Then it is a second or less when the button is pressed.  I would recommend this camera to anyone wanting point and shoot, home pictures.  That is what I do and have been quite pleased.  Battery charge lasts longer than advertised.  The computer supplied software includes a RAW manager but I don't use it, I prefer to look at the camera as a USB drive and download files directly.  I recommend this camera.", "Date": "July 24, 2011"}, {"Title": "Great feature, great lens, but some firmware bugs", "Author": "flashwaver", "ReviewID": "R1YYLWMXZ81M5R", "Overall": "4.0", "Content": "This camera has some very appealing features and an excellent 24mm wide angel lens. However, the camera tends to lock itself up once in a while during image review. It's not a huge hassel as you can just take out the battery and put it back in. All in all, a great pocket size camera if you can live with the rather high price and occasional lock up.", "Date": "December 29, 2010"}, {"Title": "Awesome", "Author": "AlecD", "ReviewID": "R2FAYI022LUEU4", "Overall": "4.0", "Content": "This camera is packed full of features for being so small.  This camera is no dSLR but the pictures it takes are fairly clear.The slow-mo video mode is pretty awesome as is the HD video.", "Date": "September 23, 2010"}, {"Title": "Short USB charger", "Author": "Foma", "ReviewID": "R32B8GXEHXOMAJ", "Overall": "5.0", "Content": "Hello.Some may be dissapointed about short USB charger.I think it's not that. It's short, because you can put it into small camera bag, when you have travel.For home use you may buy USB extension.And add, that AMOLED display it's really good.", "Date": "August 21, 2010"}, {"Title": "Perfect travel camera", "Author": "Johnny V.", "ReviewID": "R11NNMLLJMKJFZ", "Overall": "5.0", "Content": "IT takes a lot of trial and error, but I finally learned that all of the expensive camera gear I have can be a drag to travel with especially in bad weather. This is the one. Picture quality great,easy to use good zoom range, and to top it off, a swivel screen. Hang it from your neck and use it at waist height. This one is the answer, quality images from a camera that can be used one handed under a umberella.", "Date": "January 20, 2011"}, {"Title": "Unfortunately, too good to be true...", "Author": "Karenofnine", "ReviewID": "RPBORV4O1J2JU", "Overall": "3.0", "Content": "I was so excited when I heard about this camera, and at first use, it was amazing: you can easily take high-quality pictures during a video without disturbing the flow of the video, you have incredibly sharp 1080p in a small body, it's wide angle with good pics and all for a fairly cheap price.Nevertheless, I ended up returning this camera twice. The first time it kept crashing, something I've never seen a camera do before. Figuring I had a dud, I got a replacement. Next time it happened again, and Samsung said it was probably because my memory card had pictures on it taken with a Canon. I reformatted the memory card, and although the problem with crashing seemed to have gone away, it was just really slow in general. After turning it on it took a good five seconds to be able to take a video--far too long for little kids! It also took a few seconds to process pictures after taking them. This happened even after installing new firmware to increase its stability. And then pictures started turning out blue with weird lines...Samsung said that all the problems may have been that the memory card was not fast enough--however, after reading other reviews complaining about its general lack of stability, I decided it had to go back, a camera needs to be reliable first and foremost. I was sorry to miss out on all the features, however!I gave it three stars instead of two because if you are willing to get a fast memory card, install new firmware, and in general find some slowness acceptable, it could be a good camera. But for my needs, speed is of the essence. You'll also need to put up with a very slow customer service--I called for help installing the firmware and actually figured it out before the customer service rep did!", "Date": "October 20, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0036RDP9C"}}