{"Reviews": [{"Title": "Panasonic DMC G2 Does Not Dissapoint!", "Author": "K. Bennett", "ReviewID": "R1DURW5J8W0E2Q", "Overall": "5.0", "Content": "I did it! I made the switch to the four thirds format and I am glad I did.(Not that I have alot of old lenses) If you have a standard sized DSLR you will appreciate the size and weight immediatly. This is by no means a pockatable camera.. but more like a camera that you will carry in one hand with a wrist strap attached. For the money this camera will blow you away. It quickly shoots sharp, well exposed photos that look great, both with and without the flash. The camera is reserved about bumping up the ISO speed in auto...so this means even photos taken inside with the flash within flash range will be taken at ISO 250 or lower. So for all of those who have read that this camera does not have the best photo quality at high ISO speeds... over 800 it doesnt really matter, as most photo situations will not require it to. The auto white balance is excellent.. but if you want even better photos manually quickly and easily set the WB via the touch screen and WOW, WOW, WOW! I also have a Canon Rebel XSI that I have compared to this camera. The reality is that they both take great well exposed photos, the difference is that The Panasonics auto focus Does Not Miss. When it focus and locks.. you are 99% garanteed to capture a sharp well exposed photo... as long as you don't shake the camera. With the Canon it focused and locked but I noticed only about 90% of these pictures would be sharp. The Canon also produces much softer pictures in general but I guess this is a matter of personal preferance. In short with the Panasonic in hand, I feel that I end up with more great pics at the end of the day. I feel good knowing that I'm going to get great pictures when I am on vaction or at an indoor party. The Panasonic is an excellent all around camera. The picture quality is so good that most people will not be able to tell the difference between this and a high end DSLR. The differences are just too suttle to notice. So don't just look, go ahead and get one of these cameras.. it is awesome. 90 plus percent of you will love it. Trust me! It basically offers all of the ease and new technologies of point and shoots, combined with DSLR quality photos with DSLR flexibility. By the way this camera is very well constructed and has a great rubber/velvet feel. I am now looking for a buyer for my Canon XSI............LOL", "Date": "November 26, 2010"}, {"Title": "Enjoying this camera.", "Author": "D. McDermand \"meadowlark\"", "ReviewID": "R3ETD8LT8FH55B", "Overall": "4.0", "Content": "I bought this because it is a full-featured camera that is reasonably compact. At 5'1\", 110 lb, 70 year old female, I didn't want to be packing around a full sized DSLR and its large accessories. I had been tracking this camera's development for several years. I was quite tempted to buy some of the previous versions but felt they weren't \"quite there yet\" but decided to get on board with the G2. The controls are very well organized and quite user friendly. The camera has a quality feel to it and is pleasant to handle. I have gotten several complements on its appearance. The only downside is there are not that many lenses available for it yet but what there are cover a good range and seem to be pretty decent lenses. The lenses for this camera are also more compact than regular DSLR lenses. So far I am quite pleased with this product.", "Date": "January 16, 2011"}, {"Title": "Love my G2", "Author": "Vincent F. Tsai", "ReviewID": "R3OEOP8HB5GJ7D", "Overall": "5.0", "Content": "Received this camera as a birthday present in November and I've shot thousands of photos since.  I gave it some extensive use before writing this review... you just can't write relevant reviews on things without spending the proper amount of time on it, especially cameras.  Obviously like any product it has it's strengths and weaknesses, but overall the G2 is such a joy to use and a perfect camera for my needs.  I wanted a compact lightweight camera that still has all the features of the larger DSLRs and this is it.  The G2 might look like a DSLR from the photos online but set it next to a Nikon D5000 and you will realize how small it really is!  Size is definitely the main factor for buying a Micro4/3 camera.  I can bring it with me almost anywhere I go and I don't feel weighed down with all the bulk.  If you're leaving your heavy DSLR at home all the time because it's too big then what's the point right?Another thing I love about the G2 is how functional it is.  Don't be intimidated with all the dials and buttons, they're a good thing.  I love how most of the important functions can be directly accessed on the camera body.  I hate having to scroll through the menu to change a setting!  Because of this the camera handles brilliantly.  I can adjust or change all the settings without taking my eyes off the subject.  The touch screen is cool, but I don't use it too much. It is a redundant system so it's up to you if you want to use it or not.  Unfortunately Panasonic is going the opposite direction with the G3.  Seems like they've really simplified the form on it to focus on touch-screen functionality.  Now I've never handled the G3 so it might be a great camera, but I like my dials and switches.  :)Now let's talk about image quality.  The G2 is capable of some beautiful photos, but not in all situations.  Indoor low light shots are disappointing with the kit lens, not terrible, but not great.  Definitely look into the 20mm pancake lens if you shoot a lot of indoor stuff.  I know it's more money you have to spend but isn't that the whole point of buying an interchangeable lens camera?  I do mostly outdoor photography and the G2 produces some great photos.  I have uploaded some samples in the image gallery.  It is definitely a step up from what's capable with point and shoot cameras and I would say can hold it's own against most entry level DSLRs.Some more quick notes:  I love the blue color, it's a nice change from the sea of black cameras out there.  Battery life is excellent I managed to pull off 500 shots on one battery once!  I still have a back-up battery though, old habit.  Invest in a fast SD card, its worth it.Conclusion:  If you are looking for a compact and lightweight alternative to mainstream DSLRs, I would put this on your list.", "Date": "June 25, 2011"}, {"Title": "snapshot", "Author": "Jazzgryl52", "ReviewID": "R15A53CBI6BWJB", "Overall": "5.0", "Content": "Okay, this is my first pro camera. I know absolutely nothing about photography. I now possess a great interest in learning the art of taking and publishing photos. My memories have become treasures. after reviewing a consumer website of the best cameras I found this one on amazon. I read all of the reviews and was convinced this would be right for me.  I used it while on vacation in minnesota. all of my photos came out great! Yes, I recommend this camera. O I really love the touch screen. I still have a lot to learn and it's a little overwhelming but I'm open to learn.", "Date": "June 8, 2011"}, {"Title": "Excellent alternative to SLR", "Author": "Gabriel Young", "ReviewID": "R18B1ZYO6HNMJE", "Overall": "5.0", "Content": "I have a Nikon D5100, a low/mid DSLR, but this G2 really gives that some serious competition! The G2 pictures are breathtaking. I think Panasonic found a sweet spot niche for people who are ready to graduate from point-and-shoot but don't want make the leap to the SLR world.Here are some pros and cons when compared with the other types:COMPARED WITH A POINT-AND-SHOOT+ Pictures are significantly better in any environment+ Much better in low light with no flash+ Much better for active shots (or moving kids!)+ Can swap lenses for varying needs- Doesn't fit in pocketCOMPARED WITH AN SLR+ Much more portable since it has smaller body; even lenses are smaller- Pictures are not as crisp though most 4x6 shots are very, very similar- Not as many manual options- Don't have as many lens options", "Date": "December 20, 2011"}, {"Title": "GREAT CAMERA!!", "Author": "J. Cordray \"Joe\"", "ReviewID": "R1S2APT7NKCS77", "Overall": "5.0", "Content": "Originally I was looking for a point and shoot. I was looking at the LX5 and or the G12 which are more larger P/S but over time I found that I wanted the interchangeable lenses. I like being able to upgrade or not be restricted but at the same time I wanted something smaller than my D40 and the only way to do that was to commit more funding to my cause which eventually became the Micro 4/3 cameras and the Panasonic G2. Now I have to admit I'm a very casual end user when it comes to photography so some may read this and say what the heck are you doing buying this thing? I want a high quality versatile product. I want to be totally happy and this camera makes me happy. Why? Because its as easy to use as a point and shoot but it has a lot of manual features too. I know I'm just scratching the surface of what this neat machine can do! The first thing I notice is the swing out display. I can see myself at any event that has a large crowd in front of me where people are taller than me, no problem i can raise this camera up high and tilt the display down to get the footage or shot. I can bounce in between camera and video w/no issues. I can turn that display around and face the subject and even get in their myself! Perfect for me and my fiance! I like the continous mode feature if that's what its called. I can snap a lot of photos by just holding down the button. I like how i can change subjects to focus on and the touch screen. I like the AF. One thing about this type of camera is that I have had to ween myself from the whole Zoom thing. Step up to the subject or edit/crop it later. Now, I don't miss the zoom. This camera is amazing. Two features I no longer think are deal breakers, MegaPixels and ZOOM. The editing features on the camera are really nice and I found them easy to use just messing with the controls. I'm very hands on and the last thing I do is read the manual (typical right?). But there are a lot presets kind of like \"effects\" you can use which are nice some of them are very usable. A lot of color enhancements or u don't have to use them at all. When I don't use it I find that I can easily get the quality I am accustomed too with my D40 especially outside in the Sun. Very nice clarity. Also consider purchasing the pancake lense. I went ahead and ponied up for it. Whew..quite expensive for someone who's not super serious but yeah after I saw videos on you tube and photos posted with it. I had to have it. The focus/out of focus contrast in taking photos is really cool and video looks really nice through it. I can't put into technical terms how I feel and maybe where it would stand in comparison with other cameras in it's class but when I see the results, I just know its right and at the end of the day I feel so solid about this purchase. I wish everything I came across was this good. I spent some money but if you want quality and you can afford it, that's what you do. Thank you Panasonic and thank you to the seller who did an excellent job getting the camera out to APO. I really do appreciate it.", "Date": "August 21, 2011"}, {"Title": "Highly Capable, Fun, and Easy to Use. Micro 4/3 and the DMC-G2 Delivers!", "Author": "Terrance S.", "ReviewID": "R404EJ94GCMSP", "Overall": "4.0", "Content": "I've come to appreciate that the best camera in the world is the one that you're willing to use. I lead an active lifestyle, and I also enjoy amateur photography, so the ideal camera for me is one that takes good pictures while not being much of a hindrance. I know that DSLRs offer the best image quality and performance in low-light and action, but I chose to go with the Panasonic DMC-G2 and Micro 4/3 system because it's a great compromise between size, image quality, and fun.Compared to my previous prosumer cameras (Olympus C-5050z, Canon G9), I found that the DMC-G2 delivers outstanding picture quality, and offers a complete set of external controls and manual modes while remaining relatively compact. I've owned the DMC-G2 for over a year now, and looking at the new Micro 4/3 and Sony NEX offerings (including the new G3), I would still probably go with the G2 for its external controls, better ergonomics, good electronic viewfinder, and overall flexibility. Also, I prefer to be low-key while shooting, so I really appreciate the casual look of the DMC-G2 in blue.One of the biggest factors that drew me to the Micro 4/3 system, besides near-DSLR performance with smaller bodies and lenses, was the fact that just about any camera system's lenses including Canon, Nikon, Leica, and even C-mount can be used with Micro 4/3 cameras with purely mechanical adapters. It should be noted that most of the adapters for other systems do not make electrical connections, so auto-focus, auto-aperture, vibration reduction, etc will not function. Frankly, I enjoy manually focusing and setting the aperture, so this is a non-issue for me. (Micro 4/3 cameras can automatically meter and adjust the shutter speed, and there is a manual-focus magnification assist) Modern lenses generally lack an aperture ring, so unless you're willing to set the lens aperture using a native body by using depth-of-field preview and then swapping to the Micro 4/3 body, I wouldn't bother adapting them. I'm currently using a Nikon 50mm f/1.2 AI-s on my DMC-G2 via a Voigtlander Micro 4/3 Adapter for using Nikon F Lenses, and I'm loving it! (equivalent to 100mm f/1.2 on a full-frame camera!)My primary complaint about the DMC-G2 is that it's not particularly durable, and photos get rather noisy above ISO 800. I have to admit that I don't exactly baby my stuff, but after only a year of use, there are visible scratches and dings on the camera body from simply resting it on hard surfaces such as stone or concrete. My Canon G9, which has served me for nearly 3 years, seems to have fared better! Generally speaking, the DMC-G2 is consumer camera, and it's just not as well built as my previous metal-bodied prosumer cameras.Overall, I am thoroughly enjoying my blue Panasonic DMC-G2. I think the camera is well thought-out, and I especially like the dedicated external buttons and dials for adjusting common parameters. I also found that I make use of the dedicated video-recording button fairly often. (While the G2's video quality is limited to 720p, it is significantly better than many entry-level \"1080p Full-HD\" cameras!) I particularly like the articulated touch-screen since it opens up all sorts of creative possibilities and it's a great focusing aid, and I also appreciate that the touch screen is not required for normal operation. Finally, I was pleasantly surprised at how good the camera's Intelligent Auto mode is, and I use it often when asking strangers to help take group photos. After using the DMC-G2 for nearly a year, I believe that the Micro 4/3 system and mirrorless cameras in general will have a bright future.", "Date": "July 21, 2011"}, {"Title": "Highly recommend this camera", "Author": "Pattil1224", "ReviewID": "R133ZV1GCLQ3DJ", "Overall": "5.0", "Content": "Great camera.  Very intuitive right out of the box.  I am a 57 year old active woman looking to branch out from the advanced beginner point and shoot status.  Lightweight.  I also purchased the neoprene sleeve for this camera.  Very high quality shots with only a few quick glances at the \"quintessential guide for DMC G2\".", "Date": "June 8, 2011"}, {"Title": "Best Christmas gift ever!", "Author": "Leoncito76", "ReviewID": "R2HGBSKIZU22IB", "Overall": "5.0", "Content": "High quality images. Camera is very light and smaller than most SLR cameras.The camera controls might seem a little intimidating at first, but they are very easy to navigate and master.", "Date": "January 10, 2011"}, {"Title": "I'm a novice...", "Author": "Rebecca", "ReviewID": "RB6XQ7YNUJNRD", "Overall": "5.0", "Content": "I had to do a lot of reading of the manual to figure some things out, but I am making progress. I do like the position of the buttons and love the touch screen. It's light weight and comfortable. I like that you can take pictures while you are shooting a video. The USB cable connection at the camera worked once and now I have to take the SD card out to download pictures. The cable isn't covered under warranty. But I'm not sure it is the cable.... Overall I really like the camera.", "Date": "January 4, 2011"}, {"Title": "G2 May be even better than G1", "Author": "Jackster", "ReviewID": "R22OT8OT5C9G17", "Overall": "5.0", "Content": "This is a beautiful camera. My G1 takes incredible pictures.Recently in The Grand Tetons,and Yellowstone.Some very cool improvements here.(And I got it CHEAPER than my G1!)I gave the G2 to my girlfriend for xmas so she would stop borrowing my G1.Hmmm...did she win again? I'm not much for making movies,but time will tell.", "Date": "January 4, 2011"}, {"Title": "i love this camera very much i want to buy it but it is very expensive can you sell me a cheaper one just like the blueone", "Author": "tiny", "ReviewID": "R14J7FM1H0FPVA", "Overall": "5.0", "Content": "the camera is very lovely i love the blue camera it is different from the black,silver,red.i fall in love with the camera the moment i saw it i want to purchase the stunning blue one ,but it is a little expensive can you sell me acheaper one just like the blue one drop the price lower please.", "Date": "May 29, 2012"}, {"Title": "Great mid-pro camera with nice feature set", "Author": "Wires \"Jordan\"", "ReviewID": "R1LNR70W0Q1T1U", "Overall": "4.0", "Content": "This camera is really nice. The features make it stand out, even small things such as the movable screen. The pictures come out great using the iA function, keep in mind this camera needs alot of light to work well because the higher iso settings dont come out the best. Also its comfortable to hold and easy to use. I would like to think of it as the camera in between a point and shoot and a DSLR. One thing that is annoying is the EVF (view finder) has a sensor so when you put your eye to it, it will shut off the lcd, that can be annoying when your holding the camera close to you and it turns off the screen that you are looking at because the evf is within a few inches of your shirt or body. This camera is a little older now but can still keep up with most of the canons and the nikons, so I wouldn't shy away from a 3/4 camera just because its a tad older model. Also because most of these are going to be sitting in boxes in warehouses, make sure you update the firmware for the body and lens to the 1.1 when you get it to help the shots and focus.", "Date": "May 9, 2012"}, {"Title": "I Nice Camera with Lots of Options", "Author": "wfiles6975", "ReviewID": "R1C6VMJR0NRPWX", "Overall": "4.0", "Content": "The Camera has been great, lots of options and easy to use. It took some time to learn the feature. I wish the lens would zoom more, I didn't realize that it didn't when i purchased the camera.", "Date": "January 1, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Touch-screen operation with 3-inch free-angle LCD and Contrast AF system\nIncludes Lumix G Vario 14-42mm/F3.5-5.6 ASPH./MEGA O.I.S. lens\nDual Full-time Live View for LCD and LVF\n12.1-megapixel Live MOS sensor and Intelligent Resolution technology\nHD Movie in AVCHD Lite and HDMI compatibility featuring Viera Link", "Name": "Panasonic Lumix DMC-G2 12.1 MP Live MOS Interchangeable Lens Camera with 3-Inch Touch Screen LCD and 14-42mm Lumix G VARIO f/3.5-5.6 MEGA OIS Lens (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/416yc7G4ZKL._SX300_.jpg", "ProductID": "B003AOAXKK"}}