{"Reviews": [{"Title": "Great addition to the line up!", "Author": "Mark Dale \"photo phanatic\"", "ReviewID": "R2B2UT6UGSRHKC", "Overall": "5.0", "Content": "Ricoh's new P10 28-300mm is a great addition to the GXR line.  The sharpness and color saturation is fantastic and focus is fast for this unit.  I had the prime 50mm on 100% of the time  but because of the flexibility of the zoom lens 28-300mm zoom; I now have this on most of the time.  I still think the primes trump zoom lenses and for portrait and macro-focused shooting, I would go with the 50mm.  But for everyday shooting and just having this compact available for \"the moment\", it's hard to beat.  I find myself leaving my Pentax K-7 and all my Pentax Star lenses at home and now carry this camera on day hikes because of the size and weight.My hope is that more prosumers and professionals recognize the genius of this unique camera and at least give it a try before buying the standards like Olympus, Canon and Leica.  I was going to buy the Leica X-1 and after reading the reviews and doing the side by side comparisons for both the Ricoh GXR and Leica X-1, I am sure now I made the right decision.  I had high hopes for the Leica but the price/performance is just not there and while many will find the Ricoh an expensive alternative to other pro-level compacts, you get what you pay for unlike the Leica X-1.  Even if Leica was at the same price point, I would still opt for the Ricoh over the Leica. That is a powerful statement considering.There are updates available for the Ricoh to address some issues that were glaringly apparent in the reviews I read and for the most part, Ricoh did a good job addressing them.  I look forward to what's next for this camera and will be checking out the 28mm prime when it's introduced sometime this year.  Lastly, it appears Ricoh has up the stakes by reducing the price of the combo GXR camera body and the P 10 28-300mm with an offering price of $500.00.  Same as the Canon G11 and the Olympus P.  For the quality and size of sensor that competes with the SLR camera's, there's not a more capable camera on the market.  If your budget is in this range, buy the Ricoh, you won't be disappointed.  But remember, this is a pro-level camera that has sophisticated features but there is that omnipresent \"Green Button\" for those who are not comfortable shooting in other modes.Way to go Ricoh!", "Date": "August 6, 2010"}, {"Title": "Great Price", "Author": "J. Ogul", "ReviewID": "RV4A8EOURU0A0", "Overall": "5.0", "Content": "Great price on this and it works perfectly on my Ricoh GXR.  This lens has an amazing range at 28mm to 300mm and focuses quickly and accurately.  Its what I will leave on the camera all the time.", "Date": "March 10, 2014"}, {"Title": "macsareback", "Author": "macsareback", "ReviewID": "R2Y05MAI8NZIM9", "Overall": "4.0", "Content": "This is a good starter lens, but the S10 is much better. This lens is more versatile than the S10, but doesn't touch it in low light applications. If you can't afford the S10, go with this then.", "Date": "December 15, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003M5H7PG"}}