{"Reviews": [{"Title": "Very happy with this camera", "Author": "Greg Sumner", "ReviewID": "R1GXVFM45WT63F", "Overall": "4.0", "Content": "This is our 5th point n' shoot camera over the years, intended for go-everywhere pocketability.  Our previous two pocket cameras were Canon's (SD300 and SD600).  The Sony is a little bigger but improves on them greatly.The Sony DSC-W370 operates under the premise that people want the camera to be easy.  Not just easy but dead simple.  So much so that it includes an \"easy mode\" and \"smile sensor\" to automatically take the shot when the camera sees a smile.  All of the advanced controls are hidden, although easy to get to if you want them.What mattered most to us:- Speed.  The camera starts up, focuses, zooms and shoots very quickly.  The auto-mode, which we use most of the time, is very smart.  I haven't been able to fool it yet.- Easy.  You really don't need to do anything but keep the camera in Intelligent Auto mode.  It will surmise what you're trying to shoot and pick the right mode quickly.  My 5 year old took some photos today, he could use the camera with no instruction.- SD/SDHC memory card.  Sony finally quit trying to lock us into their memory sticks.- HD movies.  We used the movie mode in the Canons more than we ever thought we would.  So this time 720p movies was important.- High quality.  At any zoom length the shots are crisp.  I tested Fuji, Olympus, Canon and Nikon at the same price range - the Sony beat them all.Negatives -Only a few and they're minor.  The zoom buttons are smallish, and it's easy to go past 7x optical zoom and right into digital zoom, which as a rule I don't use.  You are able to disable digital zoom.  I also disabled the musical menu jingles.  You will too I bet.There are very few available buttons on the rear of the camera.  This was obviously deliberate - this is supposed to be an Easy camera.  But the buttons are smallish and the wheel is also rather small.  There are only a few dedicated keys and they're for the most basic of functions - flash, screen brightness and smile mode.  That's it.If you're an advanced photographer and you want quick access to functions like ISO, EV or shooting modes then this camera may not be for you.  Those functions ARE available with a few more key presses.Smile Mode seems silly to me.  The camera can be set to automatically take the shot when it detects a smile.  I can tell when somebody is smiling, although to be fair the Sony might actually be better at it than a human is.  I haven't tested this yet.I wasn't able to test the Panasonic ZS3, the W370's closest competitor.  At the time I purchased the ZS3 was a full (...) more expensive, but they'll probably drop the price now that this Sony is out.", "Date": "March 15, 2010"}, {"Title": "A KEEPER: Almost Returned it after Reading Reviews", "Author": "T. Swanson", "ReviewID": "R345W1R7CCB443", "Overall": "4.0", "Content": "While out in the desert I dropped my Canon SD870 for about the third time in 3 years on a rock and the mirco-gears were no longer in alignment--camera would no longer focus at all. I was heading out on a week trip to extremely remote areas so I needed to buy a camera in one day to take with me. Not having a lot of good value options, I settled on this model and then came home and read the reviews. It was too late to take the camera back and get another one, so I had to live with this choice. So I read the manual and experimented by taking pictures around my house. The following are my thought after using the camera for a few weeks on different trips.SPEED: Since I am an electrical engineer, it did not long to discover that all of the intelligent smile, red eye and other detection algorithms were taking a lot of processing time slowing down the camera. After turning them all off the seed improved a lot. Next I put in a 4GB Sandisk Class 6 SD memory card and that helped some more. In fact the speed to take still shots was about the same as my old Canon. However, when using the flash it does take about 2-3 seconds to recharge and be ready for taking the next photo, but I can live with that. The camera automatically uses the flash outside more than I like, so I turned it off and it the camera operated faster. All of the intelligent detection algorithms really slow down the camera. With all of them shut off the camera is ready to take a picture in about 1-2 seconds depending on the resolution of the picture your taking. That is about 1 second for a 5M versus 2 seconds for 14.1M of resolution. That is just the time it takes to write the image to the SD card. If you get the class 10 SD cards I am guessing it will be closer to 1 second to write the image to memory.BATTERY LIFE: There are different modes you can set the camera to operate that control the amount of current used to operate. Because of all of the bad reviews, I set it to the \"Stamina\" mode as I was going to be away from power sources to recharge the battery and was planning to take lot of pictures. On a trip to Chevelon Canyon to take pictures of Petroglyphs I used it continuously for 3 hours and took 291 5M resolution pictures. I turned it on and off about 50 times that day and after doing this for about 3.5 hours and 291 images later, the battery showed 2 of the 4 bars of still available battery life. I turned it on the next day and took another 100 images and there was still one bar of battery life available. I did not use the flash for any of these pictures. Using it the way I did, would allow taking 400-500 5M resolution pictures which is more than I got with my Canon.BATTERY CHARGING: My canon took about 30 -45 minutes to charge, but I now think it used a higher current than the Sony and so it gives a quicker, but not as deep of a charge. It was shocking to learn the Sony took about 3 hours to charge. It must be a low current slow charge method which usually makes batteries last longer and hold their charge better.PICTURE QUALITY: I am not a professional, but people have told me I take good pictures. With that in mind I could not see distortion around the edges and corners as I read in other reviews. Maybe some or one of the auto detection algorithms does compensation that messes up the images? With the camera setup in a minimal auto mode as described above, the pictures I have take are of the same quality as those I took with my SD870--VERY GOOD!WIDE ANGLE LENS: It does not have the digital zoom lens feature the SD 870 does and it is fantastic compared to the fixed zoom of the W370, and the wide angle is not as wide, but if you move closer or further back a few feet it gets the job done. When your truing to take a picture of a cliff dwelling located on a ledge that is difficult to get closer to, digital zoom is missed.PHOTO EDITING SOFTWARE: It comes with a reduced function NERO photo editor. They only allow certain functions to get you to buy the package. NERO will not even allow a person to delete a photo from their computer unless they buy the upgrade. Well you can go to where your photos are stored and delete them yourself or just use a good inexpensive photo editor and forget using NERO.  I tested the results of the NERO editor against the FREE editing capability in PICASA (free by Google online) and I could not see any difference. I just transfer the images and then use an editor to do the croping, etc.CONSTRUCTION: I checked out a couple of the canon model for a similar price and they weighted about half as much as the W370 and did not feel like they were built very solidly. This camera is as sturdy as my old SD870. While taking pictures the first day I had to jump from rock to rock over a flowing creek and when I landed on the far side the camera went flying and landed on a large flat & smooth boulder and slide about 6 feet before stopping. I cringed as I picked up the camera hoping at least the pictures were good, since it was such a remote place. After trying the camera it worked fine and I have not found any negative issues with it since. It is a rugged well built camera.REVIEWERS: I think reviewers often do not read the manual and therefore do not set things up correctly, work for the competition or work for the manufacturer and so there can be a lot of dis-information to sift through. The middle ground reviewers are probably most accurate (LOL)?OVERALL: This camera is solidly built, has a large 3\" diagonal viewer that is easy to read, takes good pictures and a lot of them with one battery when the auto detection features are turned off. It is just what I need and a good value in my opinion for the price. Now, if I had to buy a camera again and had two weeks to get it, know what I now know, I would buy it again.", "Date": "June 27, 2010"}, {"Title": "Good", "Author": "the-movie-guy \"movie and electonics buff\"", "ReviewID": "RJUQTGB14673K", "Overall": "5.0", "Content": "Let me say, I've owned several Sony digital cameras over the years. First a DSC-P50 circa 2001, then a couple of random ones I purchased new and wound up selling because they had poor picture quality. Then in 2005 I purchased a Sony DSC-W7 (7.2 mp) point-and-shoot. This is a good little camera but the PQ has always been a little hit and miss. I would say I got one or two good shots out of every 100.Some problems with the W7 were autofocus that didn't focus properly (especially in indoor, low-light conditions), redeye was pervasive (even with the redeye reduction feature turned on), and shutter lag time. (One feature I liked about the W7 was the inclusion of an optical viewfinder, which it seems most of the manufacturers have now abandoned on these small digital cameras.)Most of these problems seem to be addressed with the newest (2010) generation of Sony DSC point-and-shoots. I decided this was the time to replace the W7, and it came down to a choice between a DSC-W330 and DSC-W370. After taking some test photos in the store, and sending those photos to my personal computer at home for analysis, I decided to purchase the W370.The W370 does not have an optical viewfinder, but it has everything else, and does everything right. The low-light, indoor shooting that the W7 could not handle is not an issue at all for the W370. Each indoor shot has been clear and well-focused, with exquisite background detail in shot after shot. In 10 test shots, only 1 came out bad, whereas with previous Sonys there might be 4 good shots and 6 bad.The quality is light years ahead of the W330. I was attracted initially to the W330 because of its sleek look and small form factor (the W370 does not have this sex appeal), but the W370 blew the 330 out of the water in terms of photo quality, especially autofocus (always sharp) and redeye reduction (no redeye or hint of redeye at all in shot after shot).In sum, I purchased the W370 and haven't looked back. This is an excellent little camera and everything a digital camera should be. Takes excellent photos whether indoors or out, natural light or artificial, bright conditions or low, etc. I highly recommend this product.", "Date": "March 7, 2010"}, {"Title": "High Hopes......dashed...", "Author": "Tone Loc \"Tony\"", "ReviewID": "R2OWS0U2SJF6UC", "Overall": "3.0", "Content": "I was looking for a point and shoot upgrade to my old DSC-W50 which I loved and took many, many great pictures with. I heard that this model was coming out soon so I waited about a month for it to go on sale. Most of Sony's other similar models before this one had been reviewed well so I thought, better zoom, HD video, 3.0 in screen, priced under $250, should be a \"can't lose\" situation.Well I was wrong.The camera itself is impressive as all of the above is true, however, it's seriously lacking in the most important thing. Picture Quality. I used the camera for a couple weeks at a few social events where lighting wasnt perfect (translation = indoors). I guess the problem is that this camera is geared towards being easy to use, \"intelligent auto focus\". Well it's not that intelligent. I constantly found myself having to try to trick the camera and adjusting all the settings possible. But the truth is that who has that kind of time when you're in the moment? Remember the old saying \"A Kodak Moment\"?  Well it's more like a frustrated moment. It also took a while to write to my memory card (Sony ProDuo) in a couple shooting modes. For certain scenarios with good lighting or up close where the flash can do it's work you should be fine. But now a days I expect a lot more from a camera. Especially in this price range.  The video noise mentioned in other reviews is true. I didnt notice any battery problems as mentioned in other reviews.To be fair, here is The Good:  The panorama feature is absolutely awesome. It does a good job of lining up the different shots as you pan from one side to the other.  The screen is just awesome, everyone commented on how nice that was. It is an easy camera to use as there arent much in the form of controls or options to control. And it does have a high zoom but I find it less of a strong point when the exposure lacks a clear bright picture. Being able to zoom in and out during video shooting is a plus (but a slight minus when you hear the noise during playback). HDMI out is a huge plus for viewing vid's and pics since many more people have Flatscreens now days. I purchased my HDMI mini to HDMI cable on Ebay for about $5.So I decided to return it and foot the shipping costs. I then researched like crazy and visited BestBuy and Frys at least 4 or 5 times and found that sadly, there werent any cameras that really made me feel that much better about returning my W370. Most of the comparable cameras at least in regards to the features of the W370, cost $300+. They all seem to have flaws. So instead I decided to make the jump to the \"Advanced Point and Shoot\" category. They're not as sleek or pocket friendly but you really do get your money's worth when it comes to picture quality and options. In case anyone cares, I went with the Panasonic Lumix DMC-FZ35 12.1MP Digital Camera with 18x POWER Optical Image Stabilized Zoom and 2.7 inch LCD and I'm extremely pleased with it so far.If you need that one camera to last you a couple years, this is probably not the right one. If you happen to have money to spend on a slick looking camera that will perform well enough at least some of the time, some of the features here make it worth at least that. Hope that makes sense.", "Date": "April 15, 2010"}, {"Title": "Wrong Battery Info from Sony!", "Author": "T. Corey", "ReviewID": "R1G374BHDLGWM2", "Overall": "5.0", "Content": "I received this camera yesterday and, so far, am delighted with it.  That said, please be advised that if you wish to purchase an additional battery, which I did when I pre-ordered my camera, the information for the battery type is incorrect on the Sony website.  They state that the battery type is N when it is in fact K.  They are not interchangeable as they are different size batteries and will not work with the charger that comes with the camera.  The accessory kit that is indicated for this camera also included the N battery.  I spoke with Sony and informed them of this error today, they are shipping me the correct battery, and hopefully they will be correcting this information soon.", "Date": "March 11, 2010"}, {"Title": "Pros & Cons", "Author": "mucon", "ReviewID": "R3A6GIWC70T56Z", "Overall": "5.0", "Content": "Pros:-sweep panorama picture is really tremendous-noob like me can take great pictures using this particular camera-distant object looks as clear as crystal-Cool HD Movie (clear pictures, clear sounds, can zoom while recording)-adjustable in many aspects (scenes, megapixels, timer, etc)-makes you feel special (really!)Cons:-short battery life-not much memory (I highly suggest you buy a memory card together with this)-hard to detect smiles-sounds of camera while zooming is recorded during video mode", "Date": "March 18, 2010"}, {"Title": "Returned it the next day", "Author": "Toyz \"SMK\"", "ReviewID": "R6F6ZKG3MUS5Y", "Overall": "1.0", "Content": "One of the worst Cameras I've ever bought. I really am surprised by so many people giving glowing reviews to it. Surprising no one speaks of the horrible shutter lag. I bought it at a best buy, there were a couple of open items for that camera and bought one which I thought was a good deal knowing how well a lot of Sony cameras were. I was wrong.The low light pictures are abysmal and I tried taking a few shots but all i got was blurry movement because the subject had already moved away, that's how long it takes for the camera to capture a picture.Definitely don't recommend it.", "Date": "June 26, 2010"}, {"Title": "DO NOT BUY THIS CAMERA", "Author": "BOHICA", "ReviewID": "R1OLPY81UB8SOM", "Overall": "1.0", "Content": "I am a Sony man through and through and have successfully guided most of my family towards their cameras as well!  My parents recently purchased a DSC W220 and it takes such crystal clear pics, I was amazed at the detail.  After seeing this, I decided to upgrade from my 10mp to this guy at 14mp.  I didn't have it long enough to really check everything out, all I know is that the picture quality was horrible!  That crystal clear wow factor that I had anticipated was beaten back into the pipe dream it came from... the picture quality was better outdoors (high light), but still not acceptable!  After three days of wasted vacation photos, I called to get my return authorization number!  The only real difference that I can come up with (that would lead to the picture quality being so much worse than the 220) was the fact that this model does NOT have the Carl Zeiss lens???  Who knows, I just know that this is no where near the camera I was hoping for!  DO NOT BUY!", "Date": "August 16, 2010"}, {"Title": "easy to use, great pictures", "Author": "sitting duck \"meat-is-murder\"", "ReviewID": "RO7Z2APHZB94C", "Overall": "5.0", "Content": "I have owned several generations of Cybershots and they are by far offer the best combination of ease of use with quality of pics.  I am replacing a Nikon point and shoot and going back to Sony which is far less complex and great for everybody in the family to use.  Everything from the info lithium battery to intuitive controls and features make Sony a pick above the rest.  Other cameras from Canon, Panasonic, and Nikon may offer overall better picture quality but when you combine features the Cybershot strikes a great balance between ease of use and overall quality of pictures.", "Date": "June 3, 2010"}, {"Title": "Disappointing", "Author": "M. Materan \"MyM\"", "ReviewID": "R1UMVZ7CJXV560", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo133T29AZBG232embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo133T29AZBG232refresh_preplay() {\n\ndocument.getElementById(\"cv_mo133T29AZBG232chiDiv\").innerHTML = document.getElementById(\"cv_mo133T29AZBG232hiddenPre\").innerHTML;\n};\ncv_mo133T29AZBG232refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo133T29AZBG232so;\t   \n\n\nfunction cv_mo133T29AZBG232loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo133T29AZBG232so = new SWFObject(swfLocation, \"cv_mo133T29AZBG232AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo133T29AZBG232so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo133T29AZBG232so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo133T29AZBG232so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo133T29AZBG232so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo133T29AZBG232so.setAttribute(\"height\", swfHeight);\n          cv_mo133T29AZBG232so.setAttribute(\"width\", swfWidth);\n          cv_mo133T29AZBG232so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo133T29AZBG232so.write(\"cv_mo133T29AZBG232flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo133T29AZBG232', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo133T29AZBG232';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo133T29AZBG232', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo133T29AZBG232loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo133T29AZBG232\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m17A6CXHTDDZIT\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m17A6CXHTDDZIT\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1UMVZ7CJXV560\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m17A6CXHTDDZIT/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo133T29AZBG232duration')) {\n      document.getElementById('cv_mo133T29AZBG232duration').style.display='none';\n    }\n    cv_mo133T29AZBG232loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo133T29AZBG232loadSwf(movieID, playerVersion) {\n   return _cv_mo133T29AZBG232loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo133T29AZBG232newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo133T29AZBG232', 0, h);\n}\n\nfunction cv_mo133T29AZBG232resetPlayer(w,h,bw,cc) {\n  cv_mo133T29AZBG232newHeight(h);\n\n  cv_mo133T29AZBG232so.addVariable(\"resetBandwidth\", bw);\n  cv_mo133T29AZBG232so.addVariable(\"cacheCode\", cc);\n  cv_mo133T29AZBG232so.setAttribute(\"height\", h);\n  cv_mo133T29AZBG232so.setAttribute(\"width\", w);\n  cv_mo133T29AZBG232so.write(\"cv_mo133T29AZBG232flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo133T29AZBG232RollOverImg = new Image();\ncv_mo133T29AZBG232RollOverImg.src = \"http://ecx.images-amazon.com/images/I/71b1V8hrX9S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo133T29AZBG232preplay = document.getElementById('cv_mo133T29AZBG232preplayImageId');\nif (cv_mo133T29AZBG232preplay) {\n  cv_mo133T29AZBG232preplay.onmouseover = function() {\n    cv_mo133T29AZBG232preplay.src = \"http://ecx.images-amazon.com/images/I/71b1V8hrX9S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo133T29AZBG232preplay.onmouseout = function() {\n    cv_mo133T29AZBG232preplay.src = \"http://ecx.images-amazon.com/images/I/71b1V8hrX9S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo133T29AZBG232preplay.parentNode;\n\n  var cv_mo133T29AZBG232currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo133T29AZBG232currentClick) {\n      return cv_mo133T29AZBG232currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:32 MinsI love sony cameras but this is a disaster, the video is blurry even when set on a table (see the video) and the photos are blurry when zooming.I am totally disappointed with this camera.", "Date": "March 7, 2011"}, {"Title": "Great little camera!", "Author": "David W. Richter", "ReviewID": "R30S7DZR16SJ90", "Overall": "5.0", "Content": "This is my second Sony Cyber-Shot and, like the first, I love it. It has enough variables that you can control your picture quality and compensate for various conditions, yet is easy tom operate. The size is wonderful-- small enough to fit in my pocket or take when I'm out biking. Yet it has a large screen and enough heft to actually feel something there. Like most of the new pocket cameras, it has far more mega pixels than you'll ever need, but that's not a problem, just a waste of technology. There are about 8 or 10 models of Cyber-Shots and I'd be hard put to tell anyone which is best. Just choose a price range and go for it. This one is a little gem.", "Date": "May 29, 2010"}, {"Title": "Biggest piece of GARBAGE EVER!", "Author": "Myriam Miller", "ReviewID": "R2QPZWD82G8VP1", "Overall": "1.0", "Content": "This camera is garbage!  It takes forever to focus and takes crappy quality pictures.  The audio is horrible.  The video is terrible as well, most of it is blurry because the camera keeps refocusing every couple of seconds.  The screen cracked on the inside somehow and on the Sony website there are a lot of reviews stating the same thing.  I would not recommend this camera to anyone.  It's definitely not worth it at all.  Sony you have let me down.", "Date": "June 25, 2010"}, {"Title": "Incredible Camera!", "Author": "Jason Jimenez", "ReviewID": "R15BES59M94F6W", "Overall": "5.0", "Content": "I love cameras. I have in the past mostly bought Canon's. I reviewed this Sony Camera on this site and some other camera sites. It got very high marks and I must say that the camera lived up to the hype. It is fantastic. The pictures it takes are so clear and crisp. I took it to a local old car show and even as I bobbed down the street, every picture I took came out crisp and clear. Absolutely amazing.The shutter speed is amazing. I can snap pics faster with this camera than any other. It is truly an amazing camera!Jason", "Date": "May 12, 2010"}, {"Title": "Unreal...", "Author": "M. Jennings", "ReviewID": "R1GCDDT8CPC2C4", "Overall": "1.0", "Content": "I have owned Sony products for a long time and have always loved them, however, I sure wish I had logged on before buying this piece of junk!  I agree with all the previous... SLOW to take pictures... out of FOCUS.. exposure POOR... take three pictures of EXACT same subject and you will have three different pictures. I will be taking the camera back to the store tomorrow. Do NOT buy this camera!", "Date": "July 30, 2010"}, {"Title": "Great still shot camera; crappy audio playback on video corrected", "Author": "Adrian D", "ReviewID": "R84130RINIPWN", "Overall": "4.0", "Content": "I was so excited to finally get my DSC W370.  The still pictures look great, the panoramic sweep mode I like but just like the 3 other reviewers, I am so disappointed with the audio during video playback.  The audio is ok if there is no other sound interference nearby but if you video record while in a moving car or a plane, the sound is totally useless, so distorted, unless the camera has a setting to correct this. I have a DSC H7 and I think it has the same still picture quality but the sound recording is definately distortion free.  I recorded a video while we are on a single engine 4 seater cessna and the sound quality is good.  Engine noise of a plane versus engine noise of a car.  This is where I am disappointed, thinking if you buy a newer camera, it is an improvement of their older model.Update:  After chatting with Sony's product support they told me to \"initialize\" (click on menu then scroll down until you see the briefcase icon, then click on it and after scrolling down some more you will see \"initialize\"), its like re-formatting the camera back to factory specs.  Initialized my camera and now the mic sounds better, not as sensitive as before.  Video recording in a moving vehicle is still distorted but not as much. Just lower the volume of your video player. I surrender and reality has sunk in. Now I give it a 4  from 3 stars :-)and am gonna try to look for another small video camera for HD videos.", "Date": "March 26, 2010"}, {"Title": "THE NEED FOR SPEEEEED!", "Author": "James Keener", "ReviewID": "R32YG6WODWKQ56", "Overall": "3.0", "Content": "I broke my own rule when I bought this camera - I bought it on impulse without doing my usual research.  I've had some great Sony cameras before and I was impressed when I saw the features of the DSC-W370.  Just the improvements I was looking for, at a very reasonable price, so I pushed the button.  The problem arose when I got it home, unpacked it and pushed another button - the shutter button.  In bright indoor light, with a large sliding glass patio door opposite me, I tried a picture of my canine companion.  After pushing the button, I probably could have gotten myself a cup of coffee while waiting for the shutter to actually activate. (Yes, I'm exaggerating.) But the lag time was incredible, totally unacceptable.  Outside, it's a little better, but not by much.  Sorry, but that's a deal breaker for me.  Like the other reviewer, I also considered whether my camera was just a lemon, but then I finally did what I should have done before making the purchase.  I went online and read some reviews, and all the professional reviewers downrated the 370 because of its long shutter lag.I can't comment on the other features of this camera, because I didn't keep it long enough to make any judgements on them.  All I can say is, if you expect to do any sports action shooting, or catching your dog, kids, or grandkids in that oh-so-cute pose, forget the 370.  It ain't gonna happen.  You'll be too late every time.One of the pro reviewers commented that Sony cut some corners on this camera in order to keep the price down.  Although I'm not a camera technician, that sounds like a reasonable assumption.  But it seems to me that they really cut the wrong corners on this one.Like the other person above, I also switched to the Sony Cybershot HX5V.  For a few bucks more, you go from 7X optical zoom to 10X higher quality lens, and more importantly you get a big improvement in speed.", "Date": "May 23, 2010"}, {"Title": "Didn't meet expectations!", "Author": "Naveen M \"NM\"", "ReviewID": "R1S3IEIIPKCXIV", "Overall": "2.0", "Content": "W370 was compared against a Nikon Coolpix S6000 as the specifications for both cameras match very closely. Having seen photos from a Coolpix S6000, this W370 was giving very soft and less detailed shots when compared to the Nikon CP. Nikon CP S6000 have more modes in the camera. The HD recording is better and more smooth to operate in a Nikon than this Sony.Macro shots from Nikon was much better than that of Sony.I returned this item and brought a CP S6000 for my wife. I had returned a CP S6000 before Sony W370 purchase due to a battery issue.", "Date": "June 1, 2010"}, {"Title": "excellent camera", "Author": "talkerlonger", "ReviewID": "R2KOJY66BSDUMY", "Overall": "4.0", "Content": "after experimenting with different brands of cameras over the years i've settled on sony as my camera of choice. i recently made a lateral/upgrade to the W370 and couldn't be happier. after reading the pro/con reviews i noticed a common thread. pros do their research and learn about how to use the camera. cons take it out of the box and thats it. each camera is unique and you must learn the intricacies and algorithms to maximize your cameras performance in the capacity you want to use it. as previously noted, you can turn off some of the features to make the camera function appropriately in the setting you need. if you are taking pictures of nature and have no people in your view you dont need the smile recognition or blink recognition etc turned on. learn about your new camera, know it. its as different as you are. enjoy and happy picture taking.", "Date": "January 23, 2011"}, {"Title": "Piece of Junk!", "Author": "Bambi", "ReviewID": "R34D5TCIYG1OPO", "Overall": "1.0", "Content": "I originally bought this camera for almost $300, that was THE worst $300 I could have EVER spent. I should have bought a PS3 with that money!The picture quality is horrible. Especially when a picture is taken indoors. The colors mesh together and it almost looks like a watercolor painting. The detail in pictures are lost, and it's impossible to restore them again. Even when using Photoshop. The time between pictures lag horribly. I took this camera to an alumni football game and I regret it. Taking pictures of my friends was just hard. The camera would focus on whatever was floating in the air, the camera would take forever trying to take a picture that by the time it took the picture it would be nothing because my friends would be in another spot (and this is actually using the sport feature!).The video quality SUCKS. Even when you are outside in the brightest day in Florida this camera would somehow, someway find a way to get out of focus and pretty much stay that way. Sometimes even zooming in and out doesn't help. There is also a clicking noise in the background that makes it annoying to even watch a video or even listen to it. When this camera does FINALLY focus, the colors are amazing and the sound is pretty good. But that's only when the camera finally decides to cooperate.The panoramic pictures are horrible. The fact that it took its own panoramic photos was interesting, but not worth the money. The quality of these pictures are terrible and sometimes aren't even stitched correctly. Don't even think about shining the camera toward bright light when on the panoramic setting. It would literally stop and say \"Cannot take picture\", so I advise anyone buying this camera to not take a panoramic picture on the beach. Because it won't work unless it's on the most cloudy day.In summary, this camera is terrible and I wouldn't recommend it to anybody. The camera is just crap and lags way to much to take a decent photo in action. The video quality can't stay in focus and the panoramic setting isn't all it's hyped up to be.", "Date": "January 12, 2011"}, {"Title": "Great Entry level Point and Shoot", "Author": "George Morris", "ReviewID": "R2ON732XC8SUFU", "Overall": "4.0", "Content": "The good: Simple to operate; 7x zoom lens in a compact body; inexpensive for its general specifications.The bad: Long shutter lag; mediocre low-light photos; lower-end components.The bottom line: Sony's Cyber-shot DSC-W370 is an inexpensive compact camera with a long lens; however, its shutter lag and low-light photo quality keep it from earning a higher rating.Review:On the surface, the specs-to-price ratio of the Sony Cyber-shot DSC-W370 is excellent. It has a 14-megapixel resolution, a 7x zoom lens, a 3-inch LCD, supports 720p HD movie capture, and has an HDMI output for quickly connecting to an HDTV--all for less than $230. The W370 is sort of the update to 2009's overall excellent W290; however, the model actually has more in common with the 2010 W350.On the surface, the specs-to-price ratio of the Sony Cyber-shot DSC-W370 is excellent. It has a 14-megapixel resolution, a 7x zoom lens, a 3-inch LCD, supports 720p HD movie capture, and has an HDMI output for quickly connecting to an HDTV. The W370 is sort of the update to 2009's overall excellent W290; however, the model actually has more in common with the 2010 W350.The \"on the surface\" qualifier is because it's not immediately apparent where Sony cut corners to get the price low. For example, Sony has three classes of lenses; from lowest-end to highest, it's Sony, Carl Zeiss, and Sony G. The W370 has a Sony lens--and not terribly wide one, if that matters to you. This camera also doesn't use Sony's Bionz image processor, which helps explain the increased image noise at higher ISO sensitivities and its slow shooting performance. If you're after a Sony compact with very good photos and shooting performance, go with the W350. If you're in love with the idea of a reasonably priced camera with a 7x optical zoom in a compact body, the W370 is worth checking out, but it's not without sacrifice.Key specs Sony Cyber-shot DSC-W370Dimensions (WHD) 3.9x2.2x1 inchesWeight (with battery and media) 6.3 ouncesMegapixels, image sensor size, type 14 megapixels, 1/2.3-inch CCDLCD size, resolution/viewfinder 3-inch LCD, 230K dots/NoneLens (zoom, aperture, focal length) 7x, f3.6-5.6, 34-238mm (35mm equivalent)File format (still/video) JPEG/MPEG-4 (.MP4)Highest resolution size (still/video) 4,320x3,240 pixels/1,280x720 at 29.97fps (progressive)Image stabilization type Optical and digitalBattery type, CIPA rated life Lithium ion rechargeable, 230 shotsBattery charged in camera No, external charger suppliedStorage media Memory Stick Pro Duo, SD, SDHCBundled software Picture Motion Browser 5.0 (Windows), PMB Portable 1.1 (Windows, Mac)The camera is available in silver--actually more of gun-metal gray; red; and green versions, all have chrome trim on the top and right side, and the W370's body is compact enough to squeeze in most pants pockets or handbags. The 7x lens adds some weight to the package, so you probably won't forget that you have the camera with you. The camera's body is metal and a bit too slippery to securely use one-handed; there is a slight bump out on the right front, but not enough to make a difference. If you've ever hesitated to buy a Sony camera because its devices use Memory Stick media, you will be pleased that the 2010 Cyber-shots accept SD and SDHC cards as well as Memory Sticks. On the right side of the body is a flip-open door that hides a Micro-USB/AV port and a Mini-HDMI port.The card slot and battery compartment are protected by a door that doesn't lock and slides open easily; something to keep in mind if you're going to keep it loose in a bag. The camera's battery life is average for its class, but that's actually pretty short and the pack must be removed to charge it. Though internal memory is limited, it does host a small piece of software for quickly uploading photos and movies to sharing sites when the camera is connected to a Windows or Mac computer.The W370's controls are straightforward. On its top are the power and shutter release buttons. The power button is flush with the body and, though easily pressed, it'll require most users to look to locate it. The remaining controls are on back to the right of the LCD, which was barely bright enough to use in sunny conditions. A zoom rocker that some people may find finicky sits at the top and below it is the shooting mode dial. Playback, Menu, Delete, and a circular directional pad handle all other tasks. In addition to navigating menus, the directional pad can change flash and timer functions, change display information, and activate smile detection. Sony's menu systems remain fairly logical and uncomplicated compared with its cameras prior to 2009's interface changes. Out of the box, it's simple enough to master its controls after a little use.General shooting options Sony Cyber-shot DSC-W370ISO sensitivity (full resolution) Auto, 80, 100, 200, 400, 800, 1,600, 3,200White balance Auto, Daylight, Cloudy, Fluorescent white, Fluorescent natural white, Fluorescent day white, Incandescent, Flash, CustomRecording modes Easy, Intelligent Auto, Program, Sweep Panorama, Scene, MovieFocus modes Multi AF, Center AF, Spot AF, Face Detection (Adult, Child)Metering modes Multi, Center-weighted average, SpotColor effects NoneBurst mode shot limit (full resolution) Up to 100 photosThe W370 is well-suited for snapshot photography, and people who like a lot of control shouldn't consider buying it. That's not to say this Sony doesn't give you some control; the Program Auto lets you adjust ISO, white balance, autofocus points, light metering, and exposure values as well as control the amount of Sony's Dynamic Range Optimization used for rescuing shadow detail. Its Intelligent Auto scene recognition mode turns out reasonably reliable results without any adjustments, but there are still a couple options available to you like exposure and setting face detection priorities. An Easy mode takes away all options except for image size (large or small) and enlarges onscreen text. There are 10 scene shooting options including High Sensitivity, Beach, Snow, Food, and Pet. There's a version of Sony's Sweep Panorama feature, too, that let you quickly and easily take panoramic shots horizontally or vertically. While fun, the results just aren't as good as those taken with Sony's Exmor R-based models such as the WX1 and HX5V. Consider them for Web use only or very small prints. Lastly, the Movie mode records at resolutions up to 720p HD with a mono mic for audio.Overall, the W370's shooting performance is average for its class, with its biggest issue being shutter lag. The time from off to first shot is an OK 2.3 seconds. Its shot-to-shot times averaged 1.9 seconds without flash and 4.2 seconds with flash. Its full-resolution continuous shooting mode is good for this category of camera at 1.3 frames per second. However, the W370's shutter lag--how quickly the camera captures an image after the shutter-release button is pressed--is poor at 0.8 second in bright conditions and 1.6 seconds in low light. If you're considering the W370 for capturing moving subjects, you'll likely be disappointed. However, with some practice and the continuous shooting mode, you might get lucky.The W370's photo quality is good to very good, losing points because its low-light quality isn't as good as the less expensive W350's is. In the ISO 80-200 range, photos you take with the camera look better than expected for its features and price. However, if you view them at 100 percent, the pictures have a decidedly digital look to them and might appear soft and lack fine detail. Photo prints at 8x10 inches or smaller looked nice, natural, and relatively sharp. Even larger prints up to 13x19 inches are fine as long as you're not overly critical on image quality. Higher ISO photos--those at and above ISO 400--are where this camera falls apart in comparison to the W350. The W350's color performance was consistent from ISO 80 to 3,200 and while its noise suppression made subjects look painterly, the photos were still usable for small prints when sensitivities above ISO 400 were used. With the W370, these higher ISOs yield poor results with noticeable shifts in color and a lot of noise.Ideally, a 14-megapixel resolution should buy you a fair amount room for cutting down your images. If you're one to crop in a lot on subjects and then want to create 13x19-inch prints, you probably won't be happy with this camera--or any other current sub-$230 compact.Despite not having a wide-angle lens, the W370's images have some barrel distortion when taken at the lens' widest position. Having a slight pincushion distortion when the lens is extended is common, but there was no sign of it from the W370. The camera's center sharpness is pretty good, though my test camera is softer on the left side, particularly in the upper corner. The amount of fringing around high-contrast subjects is average to above average for its class. At small sizes, it's easy to overlook, but anything larger than a 4x6, and your eye will likely be drawn to it.The W370's color performance is very good and reasonably accurate. Reds tended to look oversaturated, but otherwise subjects looked bright and natural. The camera's exposure is generally good, but blown highlights are frequent. Its white balance is also good.The camera's video quality is respectable, too, on par with an HD minicamcorder. You can use the 7x zoom while you're recording, but the lens movement is jerky and you will hear the lens motor on your recordings--though this is common for compact cameras.The Sony Cyber-shot DSC-W370 is a decent camera for those interested in getting the most specs for the least money. However, Sony makes trade-offs to get the low price such as using its lowest-quality lens and a less capable image processor than its Bionz Engine. As is the case with most models in its class, the W370 is at its best in bright conditions for portraits and landscapes. Regardless of the resolution stamped on its body, the photos will generally not be great viewed at their full size from a foot away on your computer screen. However, they will look fine on prints at 8x10 inches or smaller, when viewed on a TV from a proper distance or when viewed on your favorite photo-sharing site.", "Date": "March 7, 2011"}, {"Title": "didn't like it at all", "Author": "subu", "ReviewID": "R2CDOCYIQX3OPT", "Overall": "2.0", "Content": "Looks and feels nice, great zoom but, picture quality is bad.... 1 out of 3 pictures comes blurry...even if you move for a second after clicking you got a bad picture. Night time photos are worst. colors are changed in photos. outside photos come ok. Even with my old cyber shop i dont get blurry pics.I used sony cyber shot 7.2Mp for 3 years now and was better than this one.... i would say for $200 you can get better camera.I would not advise anyone to buy this camera.", "Date": "August 5, 2010"}, {"Title": "I hate it", "Author": "LAX", "ReviewID": "R94SH1KBU89HU", "Overall": "1.0", "Content": "I bought this camera about a year ago. I think this is the worst digital camera I ever had. Some points which I hated the most1. The images are extremely bad in low light. Always shaky. No image stabilization whats so ever.2. Cannot shoot pictures in a quick succession. I loose a lot of photo capture moments bcoz the camera takes too much time to get back to the camera mode after the first picture is taken.5. The video is horrible as well. The zoom is always lost with video being blurry all the time.I do not recommend this at all..", "Date": "November 6, 2011"}, {"Title": "perfict customer service,", "Author": "wiccan pride", "ReviewID": "R2XI7YRIXE6PHE", "Overall": "5.0", "Content": "This camera is a great deal and im very glad to own it,customer service is great for answering questions and catering to our needs,i could not be more happy with my new camera and i will own it for a long time to come,no question in my mind about it lasting,it is Sony!", "Date": "October 24, 2010"}, {"Title": "Piece of garbage -- 3rd POS from SONY", "Author": "Tony", "ReviewID": "R3JYIT8031QXBU", "Overall": "1.0", "Content": "This is one of the worst cameras I've ever used.  I have used manual SLR, digital SLR, and point and shoot cameras.  I keep buying SONY thinking it'll get better with the next one, but it hasn't so far.This is by far one of the worst investments I've ever made.  It takes too long to take a picture.  They are often either washed out or blurry.  The settings don't function well with the environment we are in.We have had so many good shots turned garbage that I am boycotting SONY.  The lens cover doesn't close all the way any more.  This is our 3rd SONY piece of garbage technology and we will never buy SONY again.Video mode goes blurry and sharp.  It doesn't matter how much or little light there is in the area.  I constant have to zoom in and out to get it to refocus again.We have had ocassions where other point-n-shoot cameras have taken pretty good pictures, but this does not compare at all.Don't waste your money on this.  We paid about $300 @ Fry's.-----UPDATE------Two years and three service repairs later, it is still a piece of junk.  Video is blurry/sharp/blurry and after the so-called \"repair\" by SONY, we don't have sound.", "Date": "November 17, 2010"}, {"Title": "not so hot and very slow", "Author": "JayBird", "ReviewID": "R3N9EOZPLKAY82", "Overall": "2.0", "Content": "First off, I would not buy this camera again.  If I had time I would send it back but need it for a project that I have and not enough time to exchange.  Since I need the panoramic function I will keep it and add a cannon next year.Pros: only one I know is the panoramic mode.  It works really cool for that one function.Cons: way to slow, anything that breaths, moves, or crawls is way gone in the minimum of 4 seconds it takes to set, focus, and what ever else it is doing that takes so much time.Pictures are OK sometimes blurred, movies are too jittery and don't work well with zoom. Most of a movie is spent in blur or not even in view trying to chase it.Still photos and panoramic are the only things going for this unit. If you have to have panoramic then this is the camera for you.  Note that turning it down to 10 mp and turning off most of the automatic stuff that were the reason you purchased the camera will speed the shutter up from 4 second to about 2 seconds (still too slow for catching even my family).", "Date": "July 6, 2010"}, {"Title": "Will you make up your mind please Mr. Camera?", "Author": "TATWA&B;", "ReviewID": "R39UWN4O9VYHJ3", "Overall": "2.0", "Content": "The whole point of Auto Intelligent mode is so I can point and snap and be in awe.Well with this camera its more like point, wait for focus and camera to make up its mind, snap, First flash....... second flash(in low light of course), 1....2....and a half and there is your so so picture.Ugh i got frustrated with it after a while and returned it. Which should be a shocker since im always satisfied with everything but not with this camera. It just was not worth the dos cientos. Oh and the battery life JEVUS man!!!!!I would stay away from this camera.Two Stars because it looks decent in daylight but what camera doesn't?", "Date": "April 25, 2010"}, {"Title": "Usually love Sony", "Author": "Glenda L Egstad", "ReviewID": "R86S24B2GNE7Z", "Overall": "1.0", "Content": "Let it be said we have a SOny TV, Sony video camera and Sony DVD player.  Usually love Sony products.  Thought this camera was an excellent choice to get photos of my kids at various events and scenery on vacations.  The scenery photos were awesome.  Only good thing we experienced.  Worst camera ever owned!  Should have known by the cheap battery cover that keeps popping open and is very flimsy. As mentioned in a prior review, the shutter lag is very slow. If taking a picture of a still subject, they have to wait and not move for at least 3-4 seconds before the photo has actually been taken. Forget trying to get moving objects, they are blurry even with the slightess movement. Lastly, we just threw it in the garbage because evertime you try to take a still photo in the regular mode, it goes into video mode. After 3-4 tries, it finally takes the still photo(after 3-4 second lag time) Steer clear!!!", "Date": "February 28, 2013"}, {"Title": "Enjoyed It Now for Two Years", "Author": "Roger W. Hirsch \"Momo\"", "ReviewID": "R1NU3HSVTK3SHA", "Overall": "3.0", "Content": "I have used this camera a lot as the pocket alternative to my larger digital SLR equipment. It has gone to Alaska, Hawaii, and a few of the lower 48s. I am very pleased with the quality of the photos I get from it.The strong points for me have been the wide range of photo possibilities, including panorama photos and video. There are several settings for photo resolution, lighting, etc. Lens quality is very good, and it yields sharp pictures even at lower resolutions. Low light photos are not great, but doable. The battery strength has been good.The weak points for me have been shutter lag--good for portraits, landscapes, etc., but any movement such as sports is a problem--and a flip-open door on the bottom where you find the battery and the SD card. It tends to pop open easily and could be snapped off, even in your pocket or purse.Taking in its features, photo quality and the weaknesses, it is a solid average to good camera and I would recommend it for general use.", "Date": "August 11, 2012"}, {"Title": "An OK camera, but not great", "Author": "Michael \"Tell us about yourself!\"", "ReviewID": "R26KOH1JY0D9WT", "Overall": "2.0", "Content": "I got this camera as a present to myself. After researching for sometime for a small, yet high resolution digital camera that could also do HD video, I settled on the Sony DSC-W370 as an upgrade to an older Nikon Coolpix.PROS:Size - nice. Not paper thin, but good for my purposesExpandable Memory - a big plus in my book that it accepts SDHC cards.Lion Battery - the battery lasts longer than any other camera I've owned, so much improvement for me.Photo Modes: WOW - I'm still learning all the options here. The Panoramic mode is AWESOME & Easy.Large LCD screen - very niceAutofocus & Image stablization - I can use all the help I can get.CONS:Autofocus goes crazy in Movie Mode - this is the most annoying aspect of the camera. The camera is constantly trying to refocus and as a result, the image is often mostly blurry. This is most notable in low light conditions, or when you move the camera. there appears no way to turn this off.  Regular Camcorders are able to autofocus without causing anywhere near the level of blurring that this camera produces. It's like the autofocus can't lock on to the overall image to keep it in focus but is trying to lock on to specific objects. It is so very annoying and pretty much makes this camera useless for video.Autofocus is slow - when taking a regular still, the camera takes way too long to focus.Long lag time between shutter button push and picture taking - I think this is related to the slow autofocus.The door covering the battery and SD Card slots is cheaply constructed. The door could very easily break off. There is also a small spring loaded plasitc blue retaining latch that keeps the battery in place. This too could easily break if not careful when changing batteries.The plastic door covering the USB & HDMI ports is also flimsy and cheaply constructed. Could easily break if not careful. I never use the built in USB or HDMI, so this is not a big issue for me as I never open the door.+++++Overall, the camera is good as a still camera with some nice features. I typally import the pics to my PC directly from the SD card rather than hooking the camera up to USB. I guess its a matter of preference.  I do worry though everytime I have to open the door cover to the are where the SD Card and Battery reside - like I said, the door is rather cheap and could break off if not careful.I wish I had looked further before buying this camera.  I'm rather disappointed overall. I was looking for a replacement for my Nikon Coolpix still camera and my Flip Camcorder, and hoped the Sony DSC-W370 would be it. Unfortunately, it doesn't come close to what my Flip ULTRA HD can do.", "Date": "February 12, 2012"}, {"Title": "Wonderful pics but some major dislikes!", "Author": "CharlieCom", "ReviewID": "R1TJOWE7TCQPOP", "Overall": "3.0", "Content": "First off... I've had several Kodaks including their 14 megapixel Z1485 and Z1285 cameras. The Sony DSC-W370 doesn't just take better pictures, it absolutely excels over the Kodaks.The DSC-W370 takes better pictures than any camera I ever owned. Taking a picture of a doorknob two houses down the street, the DSC370 could clearly see scratches on the door surrounding the doorknob. The best the Kodaks could do was a blurry doorknob and blurry scratches -- course it was a ways off, but where the Sony excelled, the Kodaks failed to produce clear images (the Sony has an excellent lens).The Sony also has a powerful flash. It doesn't just light up a little area right in front of the camera, it lights up the entire living room. I was more than pleased with the flash.----Now then, the Sony DSC-370 has enough cons that I ended up selling it:1. It's slow to auto-focus. And once an item is focused, give it a few seconds and it automatically goes out of focus and then has to focus again.2. The sweep panorama mode is great. However, if anything moves while you're panning the shot, you get multiple images. For example, a man sitting in a chair moved slightly while I was panning the shot -- and in the panorama picture he showed up with three legs.In another picture, a car was moving during the panorama sweep. In the final picture you saw the same nose of the car about a half dozen times.  (comparing Kodaks -- Kodaks take panoramas by combining side-by-side \"still\" shots into one panorama image. It's more work, but at least you don't get three legged people)3. Movie mode is where the Sony DSC-370 is at its worst. Setting the camera on a stationary desktop and taking a movie of a dance floor, the camera went in and out of focus about every thirty seconds. And it doesn't just go out of focus, it's slow to get back in focus.The problem in movie mode is that most camera functions, such as manual focus, don't work in movie mode. So there's nothing you can do about the camera going in and out of focus during movie mode.Sound recording is also a disaster in movie mode. The auto sound level records so loud that nearly every recorded sound distorts. I recorded a \"not so loud\" live band at a senior citizens dinner. The music came out terrible because it recorded so loud that it distorted. And if you talk while making a movie, the recorded sound is so loud that it practically blows out your speakers on playback.The auto sound record levels are just too loud -- and you can't do anything about it because there's no \"manual\" sound record revel option. On the other hand, I haven't seen that feature on anything less than outright professional cameras. Even so, most cameras do a fair job of recording sound in movies, but I can't recommend the Sony DSC-370 because of the sound distortion.Conclusion: In my opinion, even in auto mode, the Sony DSC-370 usually takes outstanding and professional quality pictures. It's a bit slow to focus, but it takes the best pictures of any camera I've ever used. I like the camera, but I wouldn't recommend it for taking movies (use a good camcorder if you want movies).", "Date": "January 7, 2012"}, {"Title": "pretty great camera for a reasonable price", "Author": "chris", "ReviewID": "R37YW2WXHEPO92", "Overall": "4.0", "Content": "I bought this camera because we didn't want to take our bigger video camera on vacation with us and I wanted a relatively simple point and click, user friendly camera that would almost always take wonderful photos.  I was mostly interested in it's optical zoom, megapixel quality, the LCD screen, layout of the buttons and the battery power, and not so interested in the video functions. The only thing it didn't come with was a memory card but those are easy to get. We used it on vacation and I'm mostly happy with it.  It takes very nice pictures even on the medium megapix setting.  The battery life is decent, it lasted at least 8 hours for me but given that I wasn't taking constant photos I would've expected it to last longer. It can be hard to see the LCD in bright sun but from what I'm told this is common on most comparable cameras and it wasn't much of a problem.  Also, there is a delay between snapping the photo and seeing it which may be normal or perhaps I need to learn more about settings to adjust that.  The only concern I have is that the door to the battery and memory card feels a little flimsy, like it could break easily.  in conclusion, so far this camera is pretty fool-proof, the photos are very good and the price was right.  no regrets.", "Date": "May 12, 2011"}, {"Title": "Disasterous", "Author": "AMO", "ReviewID": "R2WZ0XPZOOW9EC", "Overall": "1.0", "Content": "Horrible. Very slow when taking still shots. If I am trying to take a picture of someone moving, the picture is always blurry. Video is really really bad. It keeps refocusing that I have to download all my videos and edit them, deleting the bad parts. Finally decided to replace it after 4 months after trying everything to get it to work. The vast amount of options kept giving me hope that I will eventually find the right settings to take good still and video shots. I basically wasted my time, effort and money. This is my first ever review that I write, but this is definetly one of my worst buys. I felt I had to warn others. Don't buy it.", "Date": "April 5, 2011"}, {"Title": "piece of crap", "Author": "Sylbo \"sylbo\"", "ReviewID": "R1PMMUG8VHPPST", "Overall": "2.0", "Content": "This camera has terrible focus in both camera and video modes.  It takes very poor quality videos, the focus moves in and out during a video, which makes the scenes blurry.  It's extremely annoying.  I had a 5MP Canon Powershot before this and it took MUCH better pictures and videos.  The microphone for videos is awful, the sound quality is very disappointing.  Forget about low light pictures, there is no setting in the intelligent auto or scene selection or any other choice for that matter that allows for a decent low light photo.  To top it off, there is terrible lag time between photos.  Again, the Canon I had previously, which was a much older camera, took muck better pictures and had almost NO lag time.  This camera has been a huge disappointment from the beginning.  The auto focus rarely works, face detection doesn't work at all.  The smile detection works occasionally.  The only redeeming quality about this camera is the sweep panorama but the pictures are SO grainy in that setting, it's not really that impressive.", "Date": "January 4, 2011"}, {"Title": "Digital Camera", "Author": "Beatrice Mcgovern", "ReviewID": "R2ISGHA2YUAD9U", "Overall": "3.0", "Content": "I had purchased this camera to replace an older model Cybershot camera when I lost the cord to recharge the battery and it could no longer be replaced. I am dissappointed in the quality of the photos as compared to the older camera.  I am hoping as I become more familiar with the camera the sharpness and quality will improve.", "Date": "December 28, 2010"}, {"Title": "Kid Un-Friendly and Terrible Video Quality", "Author": "Teresa", "ReviewID": "RINUU02TGRANC", "Overall": "1.0", "Content": "Why oh why did we not read the reviews on this camera first?? After searching and searching we picked up this camera looking for something that would take nice clear HD video of our toddler son and great pictures as well. What a huge dissapointment! The video is beyond terrible and a complete waste. It constantly refocuses as you are recording so you get a video that goes fuzzy and clear, fuzzy and clear, the entire time. We tried changing everything and it didn't matter what we did. We even took a video of a picture on the wall to see if it was the movement but nope, still continued to refocus.  As for the pictures, the quality was nice but like others have stated, the time it takes to get the darn thing to take a picture is worthless, especially if you are photographing children. We needed a camera that would quickly take a picture when we hit the button but it waits and waits and by the time it takes the pic, the kids are off to the next thing or done smiling. We tried the burst option and that's awful too. The time between pictures is much too long so the person is out of the frame by the time the second picture is taken. We tried out a Panasonic burst feature and it took pictures so quickly that when you played back the pictures it almost looked like a video it was so seamless.  Please, please don't buy this camera. We made the mistake of buying it from Fry's so now we get to pay a 15% restocking fee for the stupid thing. There's one less family dinner we get to have this month, thanks to Sony.", "Date": "January 25, 2011"}, {"Title": "Maybe I got a lemon? Long shutter delay & out of synch video/audio. I returned.", "Author": "M. Clarke", "ReviewID": "R27FBG7LAW51OJ", "Overall": "2.0", "Content": "I had such high hopes for this camera but everything about it worked MUCH slower than I expected. It takes a couple seconds to turn on & be \"ready.\" The lag time between pushing the shutter button and the camera being auto-intelligent to take the photo was MUCH too long. A few times I thought maybe I hadn't pushed it in hard enough after pressing halfway to focus, so I'd move the camera to look at it & it would finally fire. (literally 2 seconds after pushing)My main reason for purchase was as a second camera to my DSLR. One that I could drop into my diaper bag & pull out on a moment's notice to catch my cute little toddler in action. My performance standards are realistic. I don't expect DSLR quality...but I DID expect quality that at least matched my 5 year-old, old point & shoot camera. By the time I got this one on & the photo taken, my toddler was off to the next thing and just a blur in the corner of my photo.The video was also a major disappointment. I thought the image stabilization seemed pretty non-existent. I took videos of my son in the bathtub w/ 2 overhead lights on (bright room) and the camera took up to 10 seconds to focus after pressing halfway & then record. Midway through the minute long video, it lost focus for several more seconds. I was still standing about 6' from the tub and had not zoomed/moved camera. My 2nd attempt at video was of a singer on stage - dimly lit - and the video and audio went out of synch about 10 seconds into the video & got progressively worse as I continued to film. The microphone is on the top left edge of camera & I admit, I may've been holding it incorrectly (in the dark) for best output...but that shouldn't have caused the synch issue, just the crackly static!While this was definitely not the camera for me, I did really like the panoramic feature. As a graphic designer who has manually stitched photos together, this feature is pretty awe-inspiring! This camera might make sense for someone who only takes landscapes/scenery/stills and doesn't plan to use the video. Mine is in the box headed back to Amazon tomorrow morning.", "Date": "April 27, 2010"}, {"Title": "Poor outing for Sony", "Author": "E.L.", "ReviewID": "R2KMCXLUXK4QFL", "Overall": "1.0", "Content": "Well, I'm hoping I got a lemon, but I was extremely disappointed with this camera.  On day one, the camera was working fine, but the pictures came out soft and very slightly blurry.  They just weren't as crisp as I feel they should have been.  On day two, the pictures seemed like they were getting worse.  On day three, the lens was making a sort of grinding sound when I'd zoom in/out and it appeared the image stabilization quit working.  Needless to say, the pictures were bad.The 7x zoom was nice, the camera was a good size (not too big, not too small), and the panorama mode was neat.  The soft/blurry pictures and, obviously, the mechanical failure after two days were bad.  I ended up swapping for a Nikon S6000 after reading the reviews and it's fantastic.", "Date": "June 15, 2010"}, {"Title": "pretty cool", "Author": "CEO of UFO HQ", "ReviewID": "RH1ALUH9C86MJ", "Overall": "3.0", "Content": "Most things about this camera are good. Resolution, shutter speed (don't know why people complain about this. Can't say I've had more than 1-2 motion blurred pictures out of ~300 I've taken), high quality, HD view (16:9 picture taking. It basically cuts the top and bottom off and ends up using 11 MP, but considering most things are in 16:9, I find this extremely useful), and physically it's pretty light and small.the main thing that people are complaining about is the autofocus, which is admittedly little tricky:there is absolutely no manual focus available. So you have to move the camera around and/or wait for the right focus to occur (doesn't take more than a few seconds even when you're trying to take weirdly focused pictures. Usually takes ~1 second or less since it's always trying to correct for best focus possible) So it's not that big of a deal once you get the hang of it.*I do NOT use this camera for professional photos but I do like to think that some of the pictures I got with this camera are on the same level.Overall, recommend it.UPDATE: 4 Months after purchase:+ Have taken 5,000+ pictures and 100+ videos.+ I do not use the software that comes with the camera, at all. I use integrated SD Card reader of my laptop and is very convenient.- The camera has developed a serious problem: if I have it set on either mode P, Panoramic, or Video, it randomly jumps between the 3 (without the dial turning). and I have to reset the mode (switch dial to something else and come back to what I want). This happens roughly once every 10-20 shots.- The battery has not yet gone dead but that was a result of restricting the use of camera and is a hassle. Usually lasts about 250 pictures.- The camera also has lag at times. Looks like the more settings you have turned on, (face detection, smile detection, red eye correction, etc.), the slower the camera response time. This is definitely not what I expected from Sony.Overall, I no longer recommend it. The panoramic view is very nice and all, but this SONY camera is too cheaply built and has too many problems to be Sony.", "Date": "April 3, 2010"}, {"Title": "Sadly Disappointed", "Author": "S. Arroyo", "ReviewID": "RDA6T0XI2B1AD", "Overall": "2.0", "Content": "I feel compelled to write a review because I feel like I was led astray by the reviews that are out there, now.  Firstly, I should say that there aren't that many reviews for this camera (it's a new model) but I also read up on the earlier model (which received 4.5 stars, as well) and (mistakenly) decided that this must be a good camera given the all the great feedback on both models, combined. Boy was that a BAD assumption.I currently have a Canon SD that is 4-years old, has traveled around the world with me and has taken great pictures!  However, it has also been dropped several times and repaired (through the warranty) twice, and basically reached the point where it's on the last leg.  Given this - I decided it was time to get a new camera. I was torn between the Canon SD1200, the Olympus 7010 (recommended by a friend)and the Cybershot (recommended by my sister.)  The only downside to the Canon was that it does not zoom as far as the others - which I think is a great disadvantage when you're sitting at the back of the school auditorium attempting to shoot pictures of your child on stage at the front.  Reviewers of the Olympus noted that it did not take great pictures inside - another disadvantage when I'm shooting many pictures of my children in their school functions.  After talking to the sales rep at Best Buy - I determined that the Cybershot was the better camera for my simple, point and shoot needs (although a bit more expensive)and, in his opinion, a much better brand than Canon or Olympus.Imagine my disappointment when I showed up at my niece's 1st birthday party, new camera in hand, and unable to take even 1 good picture!  =(  For 3 days we shot footage of all the festivities and out of a hundred - I got less than a dozen I can actually use.  All my pictures came out blurry - regardless of the setting. The shutter speed is SO SLOW that it was IMPOSSIBLE to get a picture of someone who was in motion (and what kid is ever standing still?!?) But even asking my brother to stand perfectly still with my niece - I could barely get a shot that wasn't blurry.  We tried every setting - the only one that even turned out a halfway decent picture was if we put it on \"continuous shoot\" we'd get 1 out of the 3 that wasn't blurry.In all fairness to the camera - I will admit I did NOT read the manual.  Simply because I bought the camera on Thur night - with all intention of reading the manual on the 4-hour road trip on Friday.  Only to find out (once on the road) that the manual is not enclosed in the box - but must be accessed online.  (Great for going green - not so great for my road trip reading.)  None the less - I came home from my trip, convinced that I should read the manual, first, then decide if I was keeping the camera.  However, after further thought - I realized that if I can't even take one good picture on \"easy\" mode (and given my 4-year knowledge of basic camera shooting on my Canon) then this is certainly NOT the camera for me!  I'm not talking about messing with exposure and ISO speeds - I just want to tell the camera I'm at the beach - it's cloudy - autofocus / autoflash and shoot.Maybe I'm just naive - but this is how simple it is on the Canon that I own - so I assume other cameras will work the same.  I will be returning this camera, today. I really have no interest in giving Sony another shot - so it's back to Canon. A forewarning to anyone looking for a nice, point and shoot camera - this one is NOT for you!", "Date": "March 29, 2010"}, {"Title": "Camera Noise Recorded on Video", "Author": "Brian Wasicki \"thatbrian\"", "ReviewID": "RMCLN3XKD2AVC", "Overall": "1.0", "Content": "This is an OK camera *if* you only use it for still images and not for video. It is worthless for video because the camera sounds (internal mechanics) are recorded on the audio, and they are very loud! Even if you do not adjust the zoom while shooting, there is still a noise still overwhelms the audio. It must be the auto focus.I realize that this is a camera first and a video recored second, but it is supposed to do both, and I need a camera that does both, therefore the one star rating.I have returned the camera and purchased the Panasonic Lumix DMC-ZS3 10.1 MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 3 inch LCD (Black)~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Update 3/28/10The Panasonic DMC-ZS3 takes fantastic pictures, and the audio is not ruined with noise from it's lens motor. Some (audio) noise is recorded if the lens is adjusted (zoomed) while shooting video, but it is minor compared to the almost constant and loud noise from the Sony DSC-W370.Mac users: I was able to import video recorded in AVCHD Lite directly into iMovie 09 without a problem.", "Date": "March 18, 2010"}, {"Title": "What's Up With Sound Quality!", "Author": "Janet Ficklin", "ReviewID": "R2Y7JT5IT9L5GB", "Overall": "3.0", "Content": "I was so excited to record with this camera on my fligh. I found one great thing and one horrible thing.Great thing: The absolute best qualityHorrible thing: This camera has the absolute worst sound quality!I played back the footage of the flight and it was all full of static sounding audio. I'd think that if Sony who has with out a doubt made great cameras in the past like the DSC W290, which has great sound quality, the DSC W370 would have even better!!My other extremely cheap camcorder was worth only $90.00 and it even had better audio quality on it. I'm not sure if I'm the only one with this problem or not, but if so Sony ~NEEDS~ to fix this!", "Date": "March 23, 2010"}, {"Title": "I don't recommend it.", "Author": "A. Blaylock \"A. Blaylock\"", "ReviewID": "R2NUTSPUJT52EM", "Overall": "2.0", "Content": "When I first purchased this camera, I loved it. I was sleek, chic, and took nice pictures. I took about 450 images with it (not a lot) in the first year. Then, less than 30 days after the one-year warranty expired, the shutter and lens ceased functioning properly. It either continuously opens and closes when I turn it on, or it stays stuck open. In either case, I can't take a picture. My research for troubleshooting revealed this is a common problem. I tried a new battery, and every other recommendation I found. No success. I called Sony Service Center. They admit it is a common problem, but wanted to charge me a minimum of $107 to fix it. I suspect that if it is a common problem, it is a defect. They asked the \"escape responsibility\" question, \"Did you drop the camera?\" No. The camera looks beautiful - not a scratch on it - I kept it in a case. Right now, it functions as an attractive paperweight.If I knew then what I know now, I would do more research and purchase a more reliable brand that repairs DEFECTS at no cost. As nice as it was when it was working, it is worthless to me today, 13 months and only 450 images later.", "Date": "May 21, 2011"}, {"Title": "Slow Shutterspeed", "Author": "RobeeHed", "ReviewID": "R2MQ4X41L7AZEI", "Overall": "2.0", "Content": "We were on vacation when we had our cannon powershot stolen. We went to Best Buy and the salesperson sold me on this Sony camera. We soon realized that all our photos taken under low lightening were terrible! Get ready to wait 3-5 seconds after hitting the button before it decides to take a picture. With kids, there is no chance of capturing the moment. We missed the return period by a day and have been stuck with this camera. I just bought another cannon powershot and now love taking photos again.", "Date": "May 1, 2011"}, {"Title": "Terrible Camera - Returned", "Author": "Bombo", "ReviewID": "R3UFDNM95NLRLT", "Overall": "1.0", "Content": "The lag time is so terrible.  People get so annoyed when you take pictures of them because they stand there seemingly forever.  And then they blink when you do take the shot so you take another one.... then the cycle keeps going. I took it with me rock climbing and you just miss the shots you want.  You take a picture of the same thing and it comes out different all the time.  I say less than a quarter of the pictures I took are useable.  When you connect it to your TV, the pictures are displayed out of focus!!!  When you use the timer, the picture is out of focus too!  I bought it for the panorama feature but not worth it at all.  I gave it one star because 0 star is not an option.", "Date": "September 10, 2010"}, {"Title": "Great Camera Takes Poor Videos", "Author": "Mickey King", "ReviewID": "R1ELLJ601NXFLO", "Overall": "3.0", "Content": "This camera takes very good pictures. Everything looks beautiful and amazing. Some of the colors on indoor shots are a little washed out, but that's not a huge deal.Sadly, the \"video\" feature leaves a lot to be desired. I've only taken two videos with it, but the sound was horribly distorted on both. I taped part of a baseball game and then a blues band that was playing across the street from the ball game. The sound should've been very easy to capture in both events. Instead, it's so loud and distorted, it ruins the video and makes me not want to watch any videos shot with this camera.After I posted this review, I took an indoor video. A line appeared in the middle of the video during playback. And the camera had trouble focusing. I assume this is because it doesn't do well in low to medium lighting. So not only was the sound quality extremely poor (i.e. distorted), the video was blurry with lines that appeared on playback as the camera struggled to focus. I expected a little bit better quality from a SONY product!Bottom line: Great camera, bad \"camcorder.\"", "Date": "May 28, 2010"}, {"Title": "GREAT CAMERA BUT EATS BATTERIES", "Author": "Bob in NH", "ReviewID": "R2CUZMUAN3BTHL", "Overall": "4.0", "Content": "A terrific camera but the sad thing is that it eats batteries.  I have ordered two extra batteries to try and keep up with the limited shots I take with it.  Quality of the shots are always good but no one likes to change batteries that often.  Very frustrating and worse in the winter which can be expected.", "Date": "January 22, 2014"}, {"Title": "Excellent!!!", "Author": "Maie W. Coronado", "ReviewID": "R11T7HW07G46A5", "Overall": "5.0", "Content": "Excellent!!! A great way to shop... I recomended for everyone. You get what you want without moving from ypur home", "Date": "October 5, 2013"}, {"Title": "Terrible Camera", "Author": "Molly", "ReviewID": "RQ0YN2HSQVAC9", "Overall": "1.0", "Content": "My parents gave this camera to us for Christmas and they were so excited to give us a great camera to take photos and movies of the grandkids... what a disappointment!  It's terrible for taking pictures of kids, the shutter speed is so slow that I've missed thousands of adorable shots of my kids.  No amount of playing with the settings has yielded batter results, and believe me, I've tried!  Low-light photos are blurry, or, if you use the flash, terribly washed out and unnatural. Taking video is incredibly frustrating as the camera automatically refocuses every few seconds and causes the picture to go blurry then come back into focus.  I can't wait to get rid of this piece of junk.", "Date": "July 15, 2013"}, {"Title": "My Camera", "Author": "Carol L. Castillo", "ReviewID": "R779K0Z0A42PA", "Overall": "3.0", "Content": "My daughter purchased this for me.  I have the book of instructions and she helps me when she visits. It is difficult for me to comprehend.  Keep hoping.", "Date": "April 2, 2013"}, {"Title": "I passed this on to my friend and she likes it too.", "Author": "Carol Zillig", "ReviewID": "RLRRJ18M3XZ7O", "Overall": "5.0", "Content": "I just purchased a newer digital camera recently, so I sent this one and all the accessories to my friend.  She enjoys it as well.  I would recommend it to anyone.", "Date": "February 10, 2013"}, {"Title": "Crap", "Author": "Glenn M. Ramseyer", "ReviewID": "R2ACVUKML1LQEB", "Overall": "1.0", "Content": "Compared to my Sony N-2 10 MP it is crap. The resolution sucks. I love my other Sony cameras. Am very disapointed with this one.", "Date": "December 27, 2012"}, {"Title": "Excellent Camera", "Author": "Kruxoli", "ReviewID": "R2PTDSEK4JFSAR", "Overall": "4.0", "Content": "I bought this camera for my wife as a Christmas present a couple of years ago.  She loves the camera, and all the features on it.  Lightweight, easy to use, and loaded with features.  The 14 MP quality also produces some excellent photos.", "Date": "December 18, 2012"}, {"Title": "excelente camara", "Author": "nestor pereira", "ReviewID": "R3DNSFHUSFZWQN", "Overall": "5.0", "Content": "rapido y seguro el servicio me gusto el producto porque era justo lo que vi es justo lo que me llego", "Date": "December 11, 2012"}, {"Title": "Good picture quality, but broke twice in 1.5 years!!", "Author": "Mommy2CC", "ReviewID": "R3AQR1J4ZSOK1B", "Overall": "2.0", "Content": "The camera started turning off right at 1 year. After thinking we could just replace the battery, the year warranty passed and we were stuck with this issue. At 1.5 years, the lens got stuck and is well over the cost of the camera to get fixed. Just got a new cyber-shot with better reviews in hopes of having better luck. So much for capturing our only child's milestones with the previous one :/. Awful camera!", "Date": "October 19, 2012"}, {"Title": "Pretty Good Camera", "Author": "Dan", "ReviewID": "R3P2GFRPLQUUGO", "Overall": "4.0", "Content": "This camera was a great camera. I only had it for about a month until someone using it to take a picture of me dropped it onto a wood floor. The lens gears would no longer move in and out and the camera made grinding noises and became useless. I am not saying it is the cameras fault but I have read it is a pretty easy camera to break. I dont expect any camera to survive a 4 foot fall onto a wood floor but their might be tougher cameras out there. The pictures came out great and the wide angle lens is a must. The steady shot and panoramic features are pretty cool. The 14.1MP is plenty unless you are looking to take 4 feet by 6 feet pictures. Take the discount on this camera over the more expensive 16MP version it isn't worth the difference.", "Date": "September 9, 2012"}, {"Title": "I LOVE THIS CAMERA!", "Author": "Teren's Mom \"Janet\"", "ReviewID": "R1YJ857VEEYFN9", "Overall": "5.0", "Content": "This camera was a birthday present that I picked out myself.  Love the green color (my favorite), the ease of use, and the small size.  It fits right in my purse slot for easy accessibility, carry it with me at all times.  Pictures are great, and I like the panoramic feature.  This is a refurbished camera.  I buy refurbished items all the time, they usually work as good or better than new because the bugs have been repaired at the factory.  I would recommend this camera.", "Date": "July 17, 2012"}, {"Title": "very good", "Author": "echo", "ReviewID": "RX3S1T4JZ5T3N", "Overall": "4.0", "Content": "It is a fine camera, with clear picture. I bought it for my father and he likes it very much.", "Date": "April 26, 2012"}, {"Title": "Not very good", "Author": "Huberson Tape", "ReviewID": "RZPBA8G6C24VR", "Overall": "2.0", "Content": "product Started to give problem on focus after some months. can not see image on the screen for some second because the lens get out of focus than will suddenly come to normal. Very bad sound quality on recorded materials. and pictures are not stable and not very good when using 3x or above zooming.will not recommend this camera.", "Date": "January 2, 2012"}, {"Title": "I love this camera.", "Author": "jodawn13", "ReviewID": "R1V1HEZE5JKLQ1", "Overall": "5.0", "Content": "I saw the upgrades for this camera and even bought a version of an upgrade but returned it the same day. This camera has better zoom and even though the other camera had 16mp, 14 is just as lovely of a picture.It's a little heavier for a modern pocket-size camera but it's perfect for me and the panorama option is one of the best on the market.I got this camera last year but left it out in a rain storm (oops)....even after searching the market I decided I wanted to keep this same camera...older version or not.", "Date": "November 28, 2011"}, {"Title": "Sleepiest camera EVER", "Author": "SuckFony", "ReviewID": "R1ZQ50XO3Z7XNO", "Overall": "2.0", "Content": "Battery life is terrible.  I have never, EVER gone out with my family and made it through a whole day with batteries intact...and we're not snapping high resolution pictures every 30 seconds or anything.The camera hibernates after like 30 seconds, so when you're waiting to take a self timed photo of, say, the stroke of midnight, or 11-11-1 11:11:11, you'd better make sure you set the camera up within 30 seconds of it, because it's going to sleep while you wait for the count down, and when you wake it back up, all the settings are going back to default.  We spent an hour staging a once in a century photo, down to synchronizing clocks in the camera, the house, watches, etc, so everything would show 11:11:11, and what did I get?  A frantic race to reset the photo mode just in time to get a shot of 11:11:25.  Way to go, Sony.", "Date": "November 11, 2011"}, {"Title": "Not Good for Video Recording", "Author": "T. Salazar", "ReviewID": "RKEDGILL9C38X", "Overall": "2.0", "Content": "PROS1) I didn't use this product much, but I suppose most of the camera works well. Look at the other reviews.CONS1) During video recording, the zooming mechanism creates a sound that then becomes part of the video. BEWARE!!! If you are planning to record videos of yourself talking, avoid this camera. The place that you are video recording has to have a lot of noise so the zooming mechanism sound won't come out in the video.", "Date": "October 6, 2011"}, {"Title": "Experiencia con la camara", "Author": "Jania A. Almonte \"jania\"", "ReviewID": "RJP7VCU48A0TB", "Overall": "3.0", "Content": "no recomiendo esta camara ya que dura demasiado tiempo para tirar una foto, porque tiene que reconocer primero la cara de la persona y luego la sonriza. Tengo una bebe pequeña y la oportunidad de tomar fotos son unicas y con la lentitud de esta camara es imposible hacerlo.", "Date": "September 28, 2011"}, {"Title": "La mejor", "Author": "Francis Ropero", "ReviewID": "R3E9XIP8LH7B19", "Overall": "5.0", "Content": "Esta camara es lo mejor que he comprado ya que su optimo zoom acerca mas las fotos y en cuanto los megapixel que son 14.1 no podia pedir mas simplemente es lo maximo lo recomiendo saludos cordiales desde caracas Venezuela", "Date": "September 26, 2011"}, {"Title": "my final sony camera", "Author": "squid", "ReviewID": "R2WIT0VXAWJFM7", "Overall": "2.0", "Content": "This camera was bought as an upgrade for my old dsc-w55.  The specs seemed good at 14 mp and 7x zoom.  I didn't really want the panoramic feature but it seemed an interesting feature.First thing you notice is that the construction is cheap and plasticky.  It is light, but in a bad way.  It's also very slow; many times I missed the shot I was going for because the time between pressing the button and a picture being taken is so long.  Add to that a strange mechanical noise that the camera makes while adjusting (which is constant in video mode) and you have a BAD camera.  I will never buy sony again.", "Date": "September 25, 2011"}, {"Title": "My Sony DS-W370 Digital Camera", "Author": "Dwight Parlin", "ReviewID": "R2BRNTHYMFIG5E", "Overall": "5.0", "Content": "The Sony Cyber-Shot DSC-W370 is the easiest camera to use that I have ever had.  It is small and compact.  It is High Definition 1080, has a 7x Optical Zoom, 3.0\" LCD Screen and takes Sweep Panoramas up to 280 degrees.  All you have to do is aim and shoot.  The camera does everything itself.  You don't have to do nothing.  I love this camera.  It was worth every cent I paid for it.  Also it has a rechargable battery.  You don't have to buy batteries.  I bought my camera in a bundle so the 4 gb memory card came with it.  I am very satisfied with this camera and I have no dissapointments.", "Date": "May 22, 2011"}, {"Title": "Very Happy", "Author": "Jennifer Frederick Lathem \"Jennifer\"", "ReviewID": "RJ4IZC9A6AWLZ", "Overall": "5.0", "Content": "I love my camera. When I first brought it I thought did I need a new one and now I use this over my other cameras that I do have. I am the type of person that takes the family pics. So i need a good one.", "Date": "May 15, 2011"}, {"Title": "Misleading description", "Author": "Cristiano Alencastro \"Cristiano\"", "ReviewID": "R28N1X1PW9WVEA", "Overall": "2.0", "Content": "This is a poor camera with blurry images. On Amazon description, it says it comes with Carl Zeiss Vario-Tessar Lens, but its not true! It comes with Sony Lens. It takes nice Pictures outdoor, but its not good for indoors.", "Date": "April 18, 2011"}, {"Title": "Blurry pictures and slower autofocus than previous model", "Author": "S. Nova", "ReviewID": "R28DZ9X5B1RHYC", "Overall": "2.0", "Content": "My previous camera in this line (a Sony DSC-W150) took fantastic, sharp indoor photos. Auto focus was quick, pictures were noise-free. When I lost it, I wanted another Sony Cybershot in the same series to replace it. I expected another great all-around pocket camera for taking pictures of pets, family and friends. I have been so disappointed--after taking an impossibly long time to autofocus, it takes grainy, blurry photos everytime. There are much better options at this price point.", "Date": "April 3, 2011"}, {"Title": "Sony Cyber-shot", "Author": "Z. PENA \"ZMAN\"", "ReviewID": "R2H54OWZUW7EVK", "Overall": "5.0", "Content": "Great camera,very bright flash,love the panorama, but slow adjusting to the focus so the pictures doesn't come out blurry.Over all very happy with the camera.", "Date": "January 3, 2011"}, {"Title": "Sony dsc-w370 camera", "Author": "huntinbob06", "ReviewID": "R3403NUZ3FXFQG", "Overall": "5.0", "Content": "Great compact 14 megapixel with high def video. After shooting over 200 pictures and about 15 minutes of video, the battery is still going. Amazing!", "Date": "December 31, 2010"}, {"Title": "only the best", "Author": "daren", "ReviewID": "R1PL818VFOX0YD", "Overall": "5.0", "Content": "sony seems to be one of the best camera makers,i have tried other makes and models only to come back to sony,this model works great for my wife.", "Date": "December 31, 2010"}, {"Title": "Very good at this price", "Author": "Planoguy", "ReviewID": "R1UC4ZFK2ARLUW", "Overall": "4.0", "Content": "I bought this camera as a gift.  Very happy with its quality of image and its look.  The only problem with it is the life of battery, and it is expensive to buy an additional back-up battery.Overall, good camera at the price.", "Date": "December 30, 2010"}, {"Title": "Juanka's Photografy", "Author": "Juanka", "ReviewID": "R2CJIIRY98EBYG", "Overall": "5.0", "Content": "My experience in the way to buy by Amazon was so good.The camera is so perfect to enjoy the special moments of life.  Congratulatios.", "Date": "December 29, 2010"}, {"Title": "question", "Author": "georgette", "ReviewID": "R1817ZHTMKRAXY", "Overall": "4.0", "Content": "i want to know if the camera comes with the auxiliary cable for the computer, i mean the USB cable", "Date": "December 27, 2010"}, {"Title": "Worked for two weeks", "Author": "chloe", "ReviewID": "R33IARKU9QFKT5", "Overall": "3.0", "Content": "after i received the camera in the mail i was initially excited about it. it has a lot of great features and i especially like the panoramic option. however after using it for only two weeks the screen was not working right. there was no visible crack and i keep my camera in a hard case just so things like that don't happen. after calling the company about it they said that my only option was to send it in for repair which can take up to 14 days. i've sent it in and am awaiting it's return. will put up a follow up review when i get it back.", "Date": "October 26, 2010"}, {"Title": "Disappointing....poor exposure and color", "Author": "Outdoorsy", "ReviewID": "R1PDY08D8NGKSN", "Overall": "2.0", "Content": "Purchased July 1, 2010 and took many pics while on camping/hiking trip in the Rockies.  The image quality of this camera is very inconsistent.  Some shots taken merely seconds apart look very different; one will look good and the next will have poor color and poor exposure (over exposed/washed out).  This varying color and exposure also shows up when recording HD video.  I am a competent photographer who understands auto-exposure control and its limitations.  I would return the camera if I could.  Just sent it in to Sony for warranty \"repair\", hoping they find something wrong with it...and can fix it!", "Date": "September 19, 2010"}, {"Title": "Sony it's not a Sony", "Author": "Braulio R. Santos", "ReviewID": "R3C6WMY8UOGNK7", "Overall": "2.0", "Content": "I bought this camera 3 years ago, when was a new model by Sony.Have good things like panoramic pictures, but in 2 weeksof use  the front door to protect the lenses was stuck.When the memory card is close to the high capacity, the camera stay crazy, doesn't work OK until you clean the memory card.SONY, it's not a SONY any more.... very disapointed.", "Date": "May 27, 2010"}, {"Title": "So Disappointed", "Author": "John \"John\"", "ReviewID": "R1GHBZJSICGUNE", "Overall": "1.0", "Content": "I got this camera from Sony Style Store and used only 3 hours. It stopped working. LCS Screen showed \"Turn power off and on again!\". I tried but not made it working. Looks like I wasted $200 now. Now, I do not trust Sony product any more (just like \"Toyota\").", "Date": "July 10, 2010"}, {"Title": "Short Battery Life", "Author": "Naida E. Gonzalez", "ReviewID": "R1KZRQLLZ2HM0L", "Overall": "3.0", "Content": "Very short battery life.  Sweep Panorama is a great feature.  Took it to Europe and also took my Canon Power Shot.  Not all places I stayed at had the capability of using an adapter (and using converter is not an option on the Sony camera)to charge battery.  Pictures taken with both cameras were comparable in quality.  However, I still have a lot to learn about the many features the Sony offers.", "Date": "May 27, 2010"}, {"Title": "Camera basically salvage after 13 months.", "Author": "Jason Kemp", "ReviewID": "RXO52NGLZW727", "Overall": "1.0", "Content": "I used to buy everything Sony, and it seems lately, that I'm not.I bought two Sony desktop computers, which were both junk.I bought a Cybershot about 10 years ago, which lasted almost 9 years.Even after buying this camera, we still like our old one better.This camera has all the features you want.I mainly bought it for the zoom feature while using movie mode.My mother-in-law turned it on and the lens assembly was stuck.Calling multiple places for repair, they said that replacing the lens assembly is close to a $200 repair.Researching online gave me the same answer.Needless to say, this is the last Sony digital camera I'm buying.For point and shoot, you're better off not spending more than $100.Very disappointed in this.", "Date": "July 1, 2011"}, {"Title": "Sony Fan - Disappointment", "Author": "NatureGuy360", "ReviewID": "R2JP0KCOBOBB8Y", "Overall": "3.0", "Content": "I really had high hopes for this camera when I purchased it over a year ago. As a loyal Sony Fan, I owned a Sony DSC-W50 prior to this camera, and it was a great point-and-shoot for its time. I thought things could only get better when I brought the DSC-W370 home.On the outside, the camera features a glossy finish, and stylish silver accents. In addition to the three inch view screen on the rear, this camera looked very sophisticated, yet trendy. Unfortunately, the picture quality never could live up to the hype.The picture quality was just awful. Let me back that bold statement up with a little bit of information. Although I am not a master of photography, I know my way around a camera. No matter which settings I chose, and no matter how much I played with the white balance, it was physically impossible for this camera to take anything better than average photos. By design, the pictures always came out flat, washed out, and lacking in any rich color whatsoever.Disregarding the picture quality, all of the other features of the camera seemed to work as promised. After spending a year of disappointment with this camera, I finally decided to give Sony one more chance. In fact, just recently I upgraded to the Sony DSC-WX10. Wow, what an improvement!At the end of the day, no matter how good a camera looks on the outside, and no matter how many bells, and whistles it has, if the camera cannot physically take good pictures, then it is not a smart investment.Overall rating is three stars out of five. I am still a Sony fan, but I do not recommend this camera.", "Date": "June 29, 2011"}, {"Title": "Mary S", "Author": "Mary S.", "ReviewID": "RSQRATTHTW4B0", "Overall": "1.0", "Content": "We purchased this camera at Best Buy.  Since buying it, we have been completely disappointed.  The amount of lag time between pushing the button and the picture actually being captured is insane.  You will not capture any special moment, so don't even bother trying.  This camera is a true piece of junk.  It spends so long deciding to take the picture that you've missed your shot.  I stress-whatever you do, don't buy this piece of garbage.", "Date": "May 12, 2011"}, {"Title": "Worst Sony Camera I've owned", "Author": "Ras834", "ReviewID": "R3U11LBOZ25SOR", "Overall": "1.0", "Content": "I owned 2 previous Cybershot Cameras so this one was a huge disappointment.  The lag is horrible and picture quality varies from good to horrible.  Can't take a decent \"HD\" video because the focus goes in and out as complained by other reviewers.  I was still under Sony warranty when I sent it in for repair as I figured I might have gotten a  lemon.  Sony is sending it back to me saying they found nothing wrong with it.  I even sent them a sample video showing the problem with the bad focusing.  After having two previous Cybershot cameras I was happy with this one will have me swearing off Sony cameras for good.  Should have bought a Cannon like everyone I know recommended.", "Date": "April 21, 2011"}, {"Title": "Good value for the Price", "Author": "Christian H. A. Reis \"Christian\"", "ReviewID": "R23UWNLBVQ9VIF", "Overall": "5.0", "Content": "Simple, effective, pocket-size-point-and-shoot camera. Got it at Best Buy on a weekend sale + case + 4Gb card for about USD140+taxes.", "Date": "March 1, 2011"}, {"Title": "Had high hopes, but the picture quality is disappointing", "Author": "Trailman", "ReviewID": "R3BRBVCL63YS6G", "Overall": "2.0", "Content": "Just take a look at the picture of the Eiffel Tower that I uploaded to the customer picture section. My wife used my 7 year old Olympus C340, a clunky dynosaur of a digital camera. I used the Sony that had just bought for this trip in a rush on the way to the airport.Yes, the gadgets are impressive. I like the panoramic pictures. The resolution is low (video resolution), but it still beats manual stitching.However, all of this is of no use on a camera that does not take decent pictures. Both pictures in my comparison were taken from the same perspective on the same day at the same time. The Olympus picture beats the Sony in all disciplines. It is sharper, the colors are crisper and more accurate, there is more detail (look at the leaves), and all of this with 1/5th of the resolution.The Sony DSC-W370 is not a keeper.", "Date": "December 2, 2010"}, {"Title": "Sony DSC-W370 Digital Camera", "Author": "Russell J. Pendred", "ReviewID": "R2DPMD8Z72F0I7", "Overall": "5.0", "Content": "This is a great product at a wonderful price, thanks to Azazon.com The product performance is equal to my $2000 Canon digital camera with a 18mm-270mm zoom lense -- great camera - high quality - excellent pricing - outstanding shippment time  RP", "Date": "October 5, 2010"}, {"Title": "great pocket camera", "Author": "George Huson", "ReviewID": "R6TH9LBJMFVRJ", "Overall": "5.0", "Content": "purchased to be able to carry with me in my pocket, really did not expect to much on picture quality. was greatly surprized. great pictures even at 7x full zoom!", "Date": "June 24, 2010"}, {"Title": "Great camera", "Author": "Brian", "ReviewID": "R132O2K6KAYCI8", "Overall": "5.0", "Content": "I love this camera an all around great camera, even looks good!!!! Its extremely easy to use. Takes fantastic pictures and video. Its a snap to get great shots with all the automatic features. Takes great close ups and zooms in on far away objects or valleys, moutains whatever. Zoom in on close things like ten feet and its like you can zoom in and take a great shot of a green pepper at ten feet and it fills the whole picture with crystal clear image for blow ups or back rounds for your computer its great. I bought another one just for the car!!", "Date": "October 18, 2010"}, {"Title": "Could be a lot better", "Author": "MusicLover", "ReviewID": "RGZ1ME0AZ86ZA", "Overall": "2.0", "Content": "I am an amateur photographer who is hooked to her SLR, but I wanted something smaller to take overseas, or when I couldn't lug around my larger camera, so I looked into this. I have had it for 2 weeks and am returning it for a few reasons. For me the main one is that it is HORRIBLE with focusing. It seems to not be able to make-up its mind on how it wants to focus. Another issue, like many other complaints here is the video. I do not like all the noise in the zoom while filming, it's distracting.Some of the features were nice, such as the sweep panorama. But, overall I was not happy with this camera.I quickly bought the new Sony HX5V, which is a bit more expensive, but 10x better than this camera and I highly suggest it.", "Date": "March 30, 2010"}, {"Title": "Blurry videos, average picture quality", "Author": "B. Bernardo \"comic cruiser\"", "ReviewID": "R21YFV37GM62Z8", "Overall": "1.0", "Content": "I purchased this camera (DSC-370,Green) today and taken around 100 shots in different settings (day, night, indoor and outdoors) as well as used it's video mode (again in different settings with and without moving subjects). The price as well as the promise of impressive specs lured me to try this compact point and shoot. The results were disappointing. The pictures were average and some were blurry (in the short amount of time I've used it). I normally use a Sony alpha DSLR for serious photos and have also used a Nikon CoolPix L20. The photos were inferior to the Nikon and did not show as much details (the Nikon was only 10 MP). The videos were also repeatedly blurring in and out of focus (which was frustrating). The whirring noise (which was mentioned by other reviewers) was also present. The main problem may be the regular Sony lens (which is not the better Carl Zeiss lens).I also purchased a Sony Cybershot DSC-350 and will be trying it in the next few days. Upon initial assessment and using it side by side with a few pics and videos, it appears that the 350 has the upper hand, producing clearer pics and clearer videos. I will reserve judgment on the 350 until I have examined it further though I must also mention that the 350 has the better Carl Zeiss lens despite being around $50 cheaper than the 370.I will be returning this DSC-370 largely due to average quality photos and poor quality videos( My DXG HD camcorder records better videos). If you must purchase a Sony, try to acquire one with the better quality lens as it makes a big difference.", "Date": "May 12, 2011"}, {"Title": "good service/good product", "Author": "S. Rogers", "ReviewID": "R2M5E7ULZVPXTY", "Overall": "5.0", "Content": "We pitched in and bought this camera for my dad.  He had an old one and we were tired of him having to put up with poor quality pictures.  He is really having a great time with this camera and the pictures are looking much better.", "Date": "March 12, 2011"}, {"Title": "long delay", "Author": "MarshaMarsha", "ReviewID": "RU46CW7G5MGQ8", "Overall": "2.0", "Content": "If you like holding a camera still for what seems like 5 minutes, and getting a double flash, so everyone's eyes are closed, then this is the camera for you!  Action shots, forget it, birds have migrated to Mexico by the time the picture is taken.", "Date": "March 8, 2011"}, {"Title": "Great camera", "Author": "waihung", "ReviewID": "R2OGMSF3GXMAQ3", "Overall": "5.0", "Content": "This camera is truly a great one. It has a lot of features for the price. And those features really work unlike on other brands.Great 14MP resolution, really really detailed pictures. And also pictures look vivid and bright.Night shots rarely have noise even when the ISO's turned up.For people who just want a simple and great camera, this is it.", "Date": "February 10, 2011"}, {"Title": "Good camera", "Author": "carlos", "ReviewID": "R2AFXF2E8PRDTQ", "Overall": "4.0", "Content": "is a good camera, easy to use and with good zoom and resolution, very functional and the photos come out very good.", "Date": "January 30, 2011"}, {"Title": "panorama, digital camera, w370, shoot digital cameras, photography, 14mp, 10x optical zoom, excelent", "Author": "JB", "ReviewID": "RQZ7VPDJZ9SDF", "Overall": "4.0", "Content": "It Takes impressive, 14.1-megapixel photos with this compact digital camera. The DSC-W370 captures amazingly detailed images with a Carl Zeiss Vario-Tessar 34mm equivalent wide angle 7x zoom lens. Reviewing your shots is easy on the 3.0\" LCD and advanced features including easy mode, iAuto and SteadyShot image stabilization eliminate the guesswork in tricky lighting environments. There's also awe-inspiring 243-degree sweep panorama mode and 720p HD movies. For displaying pictures in breathtaking HD, use the built-in HDMI output.I cetainly recommend this camera to  everyone.", "Date": "January 30, 2011"}, {"Title": "Terrible video quality", "Author": "Pixiella", "ReviewID": "RVZHZCOQ2TMOQ", "Overall": "1.0", "Content": "I'm so disappointed with this camera.  My main complaint is that the video mode just doesn't focus properly.  It stays focused for 30 seconds or so then re-adjusts itself, blurs and re-focuses.  I thought I was doing something wrong and tried looking for settings to adjust, videoing different subjects, different lighting conditions etc. but nothing worked.  I looked online for a solution but just got forums with loads of other people complaining about the same problem.  I know it's not a video camera but even so ... I bought this Sony camera because the spec seems so high for the price but in the end it went back to the shop and I had to argue the toss for a refund.  The stills it takes are ok but the flash is blindingly bright meaning people tend to squint, the shutter lag is long and the battery life is poor.", "Date": "January 23, 2011"}, {"Title": "The Best Camera", "Author": "Bhavya", "ReviewID": "R1BYYM1BSBEP3A", "Overall": "5.0", "Content": "A very good one. Great compact 14 megapixel with high def video. After shooting over 200 pictures and about 15 minutes of video, the battery is still going. Amazing!Sony is the best camera i have ever found", "Date": "January 20, 2011"}, {"Title": "Congratilations", "Author": "Jose Flores", "ReviewID": "R235KY4DEQIN2O", "Overall": "5.0", "Content": "I am completely satisfied with the purchase of this product. My sincere congratulations, hopefully with information on your part to purchase accessories and other devices.Sincerely, Jose Flores.", "Date": "December 18, 2010"}, {"Title": "w370 review", "Author": "david", "ReviewID": "R317G3DSFKYF0S", "Overall": "3.0", "Content": "w370 is ease to use but, focus was slower than i expected.  waiting time is about 4-5 second between shots that is too long.  it tends to over expose when taking shot at relately close distance which is a step backward compared to other sony products i used before i.e. w300 and tx7.  taking hd video, this camera seemed to loose focus quit a bit.  battery duration was another shortcoming.  other than these many weaknesses, this camera does do a good job taking pictures in day time and the resolution was great.", "Date": "October 29, 2010"}, {"Title": "Awesome camera", "Author": "Ruby Simon \"Precious Ruby\"", "ReviewID": "RWP0KD56911EA", "Overall": "5.0", "Content": "I liked this camera caz one of my friends has it. The picture quality is really good. Actually better than the slr i purchased. packing too was good. It was delivered on time.", "Date": "October 27, 2010"}, {"Title": "I definitely do not like sony lenses.", "Author": "M. L. Maurice Alfonso \"m03\"", "ReviewID": "RSNGPFV20QTW5", "Overall": "3.0", "Content": "I really didn't thought there was much difference between sony lens and carl zeiss, but yes.I compared this camera with a w350 that has the same features of the W370 but with a Carl Zeiss lens. I stayed with the w350.W370 It is not so disappointing, you'll have fun if you get it. but is much better the w350.", "Date": "February 21, 2011"}, {"Title": "not what i expected in a sony camera", "Author": "Vibin Koshy", "ReviewID": "R3HI1VLL2Y28AB", "Overall": "3.0", "Content": "Not what I expected in a Sony camera. not many options and the photos are not that of good quality", "Date": "January 5, 2011"}, {"Title": "needs improvement/ very poor quality of pictures", "Author": "James Makasiar \"McGyver\"", "ReviewID": "R1ZLDRF6QERF8G", "Overall": "1.0", "Content": "I am not so happy with this camera.1. You have to press the shutter for a few seconds before it snaps a picture.2. Recovery after every shot is long.3. the size is quite big and bulky.The video is good quality. Battery life is not so long. Stick with the sony DSC w330. it is sleek, lightweight and gets quick pictures with long battery life.The quality of the pictures is not getting any better. I have 8 out of every 10 shots that is out of focus. I have to request my objects to keep still otherwise, picture will be blurred when processed.This will soon be a piece of junk in my closet.", "Date": "September 25, 2010"}, {"Title": "Sony DSC-W370", "Author": "R. Ritter", "ReviewID": "RN8PSCL7AUK2Q", "Overall": "5.0", "Content": "Nice camera. Small, light weight, easy to use, and takes good pictures. 7x optical zoom is a nice plus. I have no complaints about the camera.", "Date": "May 16, 2010"}, {"Title": "Great", "Author": "V. Avila \"Mom of two\"", "ReviewID": "RMB15YZT6ATPY", "Overall": "5.0", "Content": "Sony has never failed me when it comes to cameras. I've had three sony cameras and this one is very good for someone like me that just needs a camera to capture family moments on pics or video. I love the fact that you can zoom in when you're recording and the different settings you can use when taking pics. Love the camera. Thank you.", "Date": "November 29, 2010"}, {"Title": "new camera for wifes b-day", "Author": "W. Caldwell", "ReviewID": "R2OB1ZZK9GEZAB", "Overall": "4.0", "Content": "the camera does everything it is supposed to do, out of the hundreds of pics we've already taken only a couple have not been up to par and for the over all price i am pretty happy the purchase.", "Date": "March 29, 2010"}, {"Title": "Great camera", "Author": "Nolan D. Spann \"Hawaiiliven\"", "ReviewID": "RZOT2GENHFBI0", "Overall": "5.0", "Content": "best point and shoot camera i have ever had.  i bought it as a gift for my wife, and she loves it!!!", "Date": "May 21, 2010"}, {"Title": "Not what it was made out to be", "Author": "Hospice Nurse", "ReviewID": "R1H7LHGN01WTZ9", "Overall": "1.0", "Content": "This camera had info that was exaggerated!  The camera was returned after christmas and the money was used for a better camera.", "Date": "February 1, 2011"}, {"Title": "sony DSC-370 a bulky deal", "Author": "Kushal Mittal", "ReviewID": "RK8TR9826X7S", "Overall": "2.0", "Content": "the product is quite a lot bulky.its big in size ...heavy in weightand no that good in lookspicture results is like any other camu can enjoy these features in any other sony DSC seriesi would suggest sony cybershot DSC-350 a better value for money.", "Date": "May 13, 2010"}, {"Title": "This is a \"would be!\"", "Author": "sandymae", "ReviewID": "R2CT9OBEJOK58X", "Overall": "3.0", "Content": "This camera would be a great product as is the case with most or all of Sony products....I say \"would be\"  because the camera is incomplete.  The camera is missing a memory card.  Since when is a camera sold without a memory card?  Even a sample memory card which allows only a few photos would be a great thing.  As it is, I have been sick & can't get out to purchase a memory stick so I have no idea if the camera even works. I will be glad to revise the review at such time when I can actually use the camera.", "Date": "February 13, 2011"}, {"Title": "Stink stank stunk", "Author": "Leigh P", "ReviewID": "R4MFYT0SY7998", "Overall": "1.0", "Content": "My friend had the predecessor of this camera and when my Pentax optio sustained a \"fall\" this spring, I purchased the Canon Cybershot.  It's been terrible from the beginning.  The dial on the back of the camera spins far to easy - you reach for it, and it almost always is in video mode because the dial was inadvertently spun.  Indoor photography is slow and of very poor quality.  I'm not new to cameras. I own 3 Nikon SLR's, but you always want a point and shoot for sports and lesser events and I hoped that this would be the right one, after purchasing 2 Nikons for daughter in law and husband in 2009.  I'm so disappointed that I didn't buy the Nikon. Sony DSC-W370 14.1MP Digital Camera with 7x Wide Angle Zoom with Optical Steady Shot Image Stabilization and 3.0 inch LCD (Green)Final straw was last weekend when I hosted a breast cancer fundraiser and the unit suddenly stopped working.  No display, just a grey screen and blank photos.  How frustrating.  Fortunately I had brought the Nikon as well as a back up, just in case.", "Date": "October 7, 2010"}, {"Title": "I found the same camera for $180 with free shipping and bought it last week", "Author": "Aren Tasci \"goody\"", "ReviewID": "R3IS7L8LESJW8G", "Overall": "1.0", "Content": "i found the same camera Sony DSC-W370 14.1MP Digital Camera for $180 with free shipping in electronics expo with the coupon code STLENS and bought it last weeki received it in 2 days and i really loved it", "Date": "June 28, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.1-megapixel resolution; 7x (34mm) optical zoom lens with 3.0-inch LCD\nCapture breathtaking images in Sweep Panorama Mode\nOptical SteadyShot image stabilization reduces blur; iAuto detects 8 scenes and optimizes camera settings\nCapture your videos in HD Movie mode (720p)\nAccepts Memory Stick Duo/Memory Stick PRO Duo/Memory Stick PRO-HG Duo (not included)", "Name": "Sony DSC-W370 14.1MP Digital Camera with 7x Wide Angle Zoom with Optical Steady Shot Image Stabilization and 3.0 inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41c1CQO906L._SX300_.jpg", "ProductID": "B00328HR9O"}}