{"Reviews": [{"Title": "AMAZING little Camera Highly Recommend", "Author": "Petite Bohemian", "ReviewID": "R2JLE3YUTZFJO6", "Overall": "5.0", "Content": "Before purchasing this camera I did a lot of research. I currently own Nikon SLR as well as a Kodak Z700 so was looking for a compact camera that can give me the high quality pictures I get from my Nikon and the video capacbility I get from my Kodak and after a lot of reading decided on the Olympus Tough 6020. I just got it today only a few short hours ago and have to say I am very impressed, easy to use right out of the box (after initial charging of the battery) and I have already captured great pictures and videos. Some reviews say the camera does not turn on right away which is not true once you go into the menu initially and to your \"setup\"  and turn PW to \"off\" that prevents the logo from initially loading everytime which is why some say it it slow to start, a very easy fix if you take the time to go through your setup menu when you get it instead of just pointing and shooting right off the bat. The pictures I have taken both indoor and outdoors are clear not grainy and the HD video is awesome. This camera even has sound when previewing your vids from camera, which I love since my Kodak didn't I would never know what sounds were on vids before until I uploaded them to edit them not anymore =) I also love the macro and super macro settings as I love to take close ups of flowers and things. I have not tested the waterproof as of yet but will this eve and I am sure it will do just fine. I must say that so far this is one sweet camera and I am not a photographer newbie and take my cameras and work serious so if you take the time to set your camera up and go through your menu setup you will be just fine. I give this camera 5 STARS and a big thumbs up!!!", "Date": "October 27, 2010"}, {"Title": "Waterproof, dust and crushproof, but slow to start, until firmware update", "Author": "Ryan Harsted", "ReviewID": "RWO43QDRVATIS", "Overall": "4.0", "Content": "This is my 2nd Olympus waterproof camera, after owning the 790sw 7.1 megapixel, I decided to \"upgrade\" The camera works great after it \"boots\" up which takes 2-4 seconds which doesn't seem like much but when you are trying to capture action shots from the camera being in an off position, its way to slow, much slower than the older 790sw I owned. It also seems the time between shots takes longer. Overall I would recommend it if you needed something fr harsh environments as I do.*UPDATED 3-30-11 went to the olympus website and upgraded the firmware, there was a fix for \"slow start up\" works 100% better now", "Date": "February 23, 2011"}, {"Title": "Broke within a week", "Author": "bguthas", "ReviewID": "RYOLYW8R8JAZE", "Overall": "1.0", "Content": "My girlfriend and I took a month long vacation in Nicaragua. We both bought stlylus tough series cameras. Mine got water damage within the first week from being used in a pool, 5ft deep at the deepest point. My girlfriends camera received water damage within two weeks from being splashed in the surf. Customer service has been less than helpful and I still haven't received a new camera over two months later.", "Date": "July 25, 2011"}, {"Title": "awesome", "Author": "Kimberly D. Yaschyshyn", "ReviewID": "R3HIIQJJ6RY46P", "Overall": "5.0", "Content": "I love it...got it and the next day took it white water rafting... it was dropped, hit, smashed, dunked...and nothing stopped it from working, taking great pictures and videos and still looking brand new. My friends went out to get one of their own!", "Date": "October 21, 2010"}, {"Title": "So Cool", "Author": "M. Fuhrman", "ReviewID": "R35UB6437J0QNM", "Overall": "5.0", "Content": "I have had this camera for only about a week and I love it!  The pictures and movies are so clear. Also I cant wait to use the underwater feature on our next vacation. It also gives me some peace of mind knowing that it can be dropped from 5 ft and not be damaged. Their program you use on the computer is great too. So many awesome features!", "Date": "April 8, 2010"}, {"Title": "Trick Me Twice", "Author": "3Bagger", "ReviewID": "R5MHC141M0QD", "Overall": "1.0", "Content": "I had purchased this camera a couple of years ago and was very happy with the quality. However, the first time I took it in the water (a swimming pool), it leaked and died. Being past the 1-year warrantee, I could do nothing but replace it. So I purchased another one in May 2011 and it worked great for a couple of weeks. But the first time I took it into the water (a swimming pool), it had problems again. This product seems to predictably have issues so I replaced it with another manufacture.  Don't buy the Olympus Stylus Tough, your throwing good money away.", "Date": "June 29, 2011"}, {"Title": "great pictures, you'll want the extended warranty though", "Author": "Marita Wilterink \"Spanish fan\"", "ReviewID": "RD4QVXG5XQIM", "Overall": "4.0", "Content": "I've had this camera for just over a year and taken it all over the world multiple times. I've used it in all the extreme conditions that it was meant to be used in. I've gotten many compliments on my pictures and videos and overall I really do love the camera.This being said, it has broke twice while using it underwater. The screen will say \"no connection\" when I try to turn it on. I always use the 'lock' on the side and rinse it in fresh water after taking it in the ocean so I'm not sure how water keeps getting in the battery compartment, but it does.I sent it in the first time and they fixed it, but this time it's been exactly a year so I'm not sure what I'll do.I highly recommend buying the extended warranty if you get this camera.", "Date": "May 2, 2011"}, {"Title": "Great camera!", "Author": "R. L. Beall", "ReviewID": "R27BY7VOFEGLYP", "Overall": "5.0", "Content": "We are consulting engineers and need cameras to record status and progress of large construction projects. Hazardous duty for any electronic equipment and we have lost cameras when dropped or from water, dust, etc.  This unit has all the features we need and is tough enough for this type of use.", "Date": "April 26, 2010"}, {"Title": "UN-balanceed & lousy interface.", "Author": "Jay Finnsey \"Truth in Reviews!\"", "ReviewID": "R2QW9JO84ZPYB1", "Overall": "1.0", "Content": "Ok... I thought I did a lot of research here, looking at quality of image and quietness of the video zoom, etc. on some of the best online camera review sites... and of course, the waterproofing and durability. (I wanted this for a beach vacation, pool use, hiking in wet weather, etc.)When I got this camera I was shocked at how unbalanced it felt in my hand. It is VERY heavy for such a small camera, and all that weight is toward the left. This make it difficult to take a one handed shot. The body is VERY SLIPPERY and no texture to help with your grip. Within a day of simple testing, the colored panel in the front already developed a scratch. Cheap electro-N-coloring.The functions are not intuitive at all... for example, trying a simple thing like turning the camera on and then trying to zoom in you get \"not available in the current mode\". Huh? A default setting should allow fully auto picture taking with no restrictions on a simple thing like zooming, regardless of the mode you are in.I also HATED where they put the lens. It is EXTREMELY EASY TO CAPTURE YOUR FINGER IN THE SHOT if you hold this camera the same way as you would hold 99% of other point and shoots.BTW... I'm a pro (over 40 years advertising, catalog and editorial) so a good test for me of a point and shoot is just that--point and shoot! Spend a few minutes fresh out of the box with the camera... running through menu selections and settings... and just use the camera simply and easily. This camera has got to be the most unintuitive point and shoot I've ever seen or used. I don't even care about the image quality... even if it were outstanding, the interface and poor design would steer me away.I returned it. Don't buy one, you'll regret it.", "Date": "June 23, 2011"}, {"Title": "Do Not Buy This Camera", "Author": "Gary D", "ReviewID": "RIYYUG0AAPO9N", "Overall": "1.0", "Content": "I bought this camera for a trip to Kauai (in fact, there now as I write this).  I wanted a camera to take in snorkeling and also one that I was not worried about getting wet if caught out in a rain shower.  I have a Canon DSLR, but did not want to spend hundreds more for an underwater housing.  After the third snorkeling session (camera no deeper than arm's length below the surface)and probably no more than 90 minutes in the water, the Olympus Stylus Tough 6020 camera died.  Screen just flashes on and off.  Not very \"tough\" it seems.  Because it has no range finder, if you are out in the sun, the screen is almost impossible to see. So, save your money and either buy another brand or just rent an underwater camera at one of the drive shops.", "Date": "April 30, 2011"}, {"Title": "Great Camera", "Author": "Alfred P. DeRosa", "ReviewID": "R2N3NMTDYB56X2", "Overall": "5.0", "Content": "Extremely durable, we us it everywhere, even in salt water and it does great.Would buy one again, exellent camera!!!", "Date": "April 15, 2013"}, {"Title": "STAY AWAY!!!", "Author": "Cody O.", "ReviewID": "R3LE1VZ2MR3GJQ", "Overall": "1.0", "Content": "I purchased this camera just over a year ago, always acted a little funny but never had any real problems with it. Then about 10 days after the warranty expired this \"waterproof\" camera got completely waterlogged, water in the image sensor and is now completely useless. Of course olympus wants me to send it in so they can tell me how much it will cost me to repair. This is a complete outrage, the camera is rated at 16ft waterproof, and was only used in a pool that is 6 ft at its' deepest. BUYER BEWARE. Stay away from this awful camera. It will break on you. Go with a more reputable brand such as Nikon or Canon.", "Date": "June 18, 2012"}, {"Title": "Love it!", "Author": "dhstudent", "ReviewID": "R2DPFBWVKYA4IV", "Overall": "5.0", "Content": "I love this camera. It is amazing, I have taken underwater pictures and dropped it before and it holds up fine. I have even spilled juice on it before and just had to rinse it off. It is easy to carry around everywhere and comes in great colors. I would recommend this camera to everyone!", "Date": "November 9, 2011"}, {"Title": "The Best Item I've ever Gifted", "Author": "Janelle Wilson", "ReviewID": "R1IOO0R693ESHY", "Overall": "5.0", "Content": "I bought this camera for my husband who was asking me for a durable and easy to use under-water camera. We took it to the pool and the picture quality is amazing! I was afraid of the camera blacking out under water, but it didn't! Picture quality is awesome, it comes with easy to install software for your computer, and it records in HD!!!! This camera is the Beezzz Neez!", "Date": "August 15, 2011"}, {"Title": "Love this camera! Don't believe the bad reviews!", "Author": "Cassie Rodgers", "ReviewID": "R38TOOE2GDF9OY", "Overall": "4.0", "Content": "I got this camera to replace my Kodak point and shoot, and it's great!  If you know how to use a camera, you'll have no problem with this one.  A lot of the reviews are people complaining about blurry pictures and start up time, i honestly don't think they know anything about cameras.  That being said, I'm not saying I'm a professional, but I know a bit about cameras.  I've owned about 5 point and shoot cameras and 2 SLRs.  I think the majority of the bad reviews is caused by the average users basic knowledge of a camera, most people have no idea what half the settings are, or what they mean, so the bad picture quality, is their own fault.Hey, if you have it on macro, of course the picture will be blurry, if you're taking a picture of the sunset...learn how the camera works before giving it a horrible review.The pictures come out great, as long as you have all the right settings.  Changing between the different modes on the camera is fast and easy, and all the settings for that mode are right on the same screen, so it's so easy to quickly adjust a setting if you needed to.  It's a great little camera to have!The only real complaint I have, is the mic for the video is behind the camera, sort of right where your finger would go when you hold it.  So you're not going to get great audio at the thing you're aiming the camera at, since the mic is facing you.  If you were talking, sure it's not a problem.  So if you take a lot of movies, you might want to go with another camera.", "Date": "August 8, 2011"}, {"Title": "leaked", "Author": "Susan", "ReviewID": "R7TV0JAJU99JV", "Overall": "2.0", "Content": "Bought this camera for my 11 year old son last year for our trip to Niagara Falls. It seemed very durable and easy to use. We used it \"in\" the falls and were very happy with the pictures that we developed. Got the usual flattering pictures of us in our ponchos getting soaked. Most pictures were outside. Inside quality is average, but that is why I have my Canon Rebel XTI. This camera was for that trip, the beach and the pool.Unfortuantely we took some pictures this summer in the pool. Less than one foot underwater. The camera leaked. It was just past the one year warrantee. It is ruined and has not successfully dried out. Called the company and a reputable camera store and both said that once the circuit board gets wet, it needs to be replaced at a cost of at least $150. The company also recommends that it be sent in to have the seal replaced annual at the cost to the comsumer. I didn't do this and was not actually aware of that. Seems a bit high maintenance.I would recommend this camera for rain, the beach and poor weather but I hesitate to say it should be submerged. Have a backup if you are away on vacation (just in case). I am currently shopping to replace that camera for upcoming cruise and would not take a chance on the same brand.", "Date": "July 27, 2011"}, {"Title": "Good for butter finger", "Author": "T. T. Ming", "ReviewID": "R1PA6LQ9QCQQVD", "Overall": "4.0", "Content": "I was attracted to this camera because it has waterproof and shock proof. I got this for my daughter and takes video of her in the swimming lesson. The videos are very useful for stroke correction.The shock proof feature is also useful for children as they tend to drop whatever they hold. With the 6020 I can be sure the camera would come back working after going field trip. After using this green 6020 for a month, I bought another blue 6020 for my son.The image quality is what one would expect out of a normal point and shoot camera. Jpg artifact seem pretty strong and picture quality is only acceptable up to ISO 800.  As far as P&S; image quality is concern, I still prefer my old 6MP Fuji F31fd.One irritating point is that the LCD and metal surface tend to get scratched easily.  My plastic body Fuji Z33WP seem to attract less scratch.", "Date": "July 20, 2011"}, {"Title": "Really good camera for the money.", "Author": "Nikola Tesla", "ReviewID": "R3DCJGHNCQATXO", "Overall": "5.0", "Content": "Buy this camera if you need a camera to take with you on vacations that you don't need to worry about getting wet. This is my first digital camera and I took it backpacking at Shenandoah on the Appalachian trail. I found it pretty easy to use overall and dependable.My only quarrels with it are the automatic panorama takes some practice to get it right (it's hard for it to track open sky so try to get more features in the picture, fix the white balance and ISO so they are constant,  and use a tripod if you can) , I had some difficulty getting the self shots to focus (by some, I mean 3 out of 84 self shots, so not many and this is my first digital camera), and the battery life only seemed to last me 110 photos although playback of about every photo since I was self-shooting and deleted ones where I blinked or was out of frame (I just bought another battery <$10). The camera was constantly covered in dew, rained on, and had a 35lb backpack laying on top of it. Despite all of that, it worked flawlessly.Make sure you have the right scene set for iAuto, you don't serious expect landscape mode to take a good family picture do you?I posted some pictures in different modes so you can get of sense of some the cameras features and capabilities.Pros:DurableFeature rich (any mode you realistically need, even a beauty mode)Sharp picturesEasy menusFine zoom (allows further zooming without degrading the picture like digital zoom does).Cons:Short battery lifePanorama takes practice/reading the manual to master, but worth itZoom is somewhat limited (because of the waterproof case)", "Date": "June 23, 2011"}, {"Title": "Very impressed", "Author": "Rygelthe17th", "ReviewID": "R3UO8LMUZHHB1L", "Overall": "5.0", "Content": "I have been a big fan of the tough series. I have owned several versions of them. This is my latest.All in all this is one incredible machine. Since it arrived I have been putting it though its paces. I love the new controls (at least for me)they really let you use all the cameras features quick and easy. I can transition from a normal pic to a pano to a micro faster than previous models and the record button gives you instant video recording so you never miss the action. The one water tight door that houses your battery, card and all your ports lessens the chance of a leak and the lock makes me more comfortable since the door wont open in my pocket an break off like one of the first models I had. The Sequential shooting mode brings the best out of what i loved about SLR's for capturing action and sports shots.The software is the same or beta for the GPS compatible models out now cause it is still in the camera settings but is grayed out.Haven't had it in the water yet but will update when I do.Pro's: Brings the best out of all the previous models and some great additions. Has duel timezones so you know what time it is where you are and back home for when your traveling. the photo editing in camera is pretty effective, and saves time editing later. User manual is in the on-board software that worked, so you always have it with you.Evey electric device has some problems but this is still a great camera. Here are some cons just for your info, most might be adjustment issues since I'm so familiar with these cameras. And dont be discouraged you can always right more about the bad than the good.Con's: The normal Sequential is a little slow for my liking but the High speed more than makes up for it. It allows you to add voice recording to any picture, but you cant delete it in the camera so if you mess up you lose space till you get to a computer. The Panoramic auto function has messed up on me a few times by not detecting the edge till late and stitching images together with too big of gap to match. (The manual pano mode is the way around this that i have found.) \"Not really a con but\":It doesn't have a high depth rating but you get what you pay for and 16ft is more than enough for snorkeling and shallow diving but I wouldn't take it to close to that without an external case. And in my experience salt water leaves a film on the lens so always wash in clean fresh water after any underwater activity. The on-board software glitched when i tried to load it onto my computer, but I haven't really tried to fix it yet. It locked up wile loading and shut down but the computer still showed it as installing so I had to restart my computer, did the same thing after restart.", "Date": "June 15, 2011"}, {"Title": "Works great", "Author": "Jeremy \"Jeremy\"", "ReviewID": "R26V8UGB66HFHH", "Overall": "5.0", "Content": "Used it 3 times under water up to 20 feet no problem. the pictures come out crystal clear. im sure if you take froper care of the camera it will last and not leak.", "Date": "May 30, 2011"}, {"Title": "Worked Great Until it Didn't", "Author": "B. Pena", "ReviewID": "RJQT2638XC30F", "Overall": "2.0", "Content": "Took this camera on a trip to the Caribbean and was very happy with product until last day of trip when it stopped working on us after being in only 3 feet of water-seriously this is supposed to .  Phone is now dead as disco and the return labels have already been printed.  Too bad too, because I was very happy with the quality of the pic's and really liked the thought of shooting pictures under water.", "Date": "April 16, 2011"}, {"Title": "Not as good as I had hoped", "Author": "Jessie Whitesides", "ReviewID": "R2W36FSL22GZJB", "Overall": "2.0", "Content": "I researched \"Tough\" Cameras for a few months before I made my purchase.  As somewhat of a skilled photographer I am unfortunately very disappointed in this camera.  The screen has good clarity when taking pictures and video; however, after taking a still shot, the image looks blurry on the screen, leaving you with no idea if the actually image is clear.  It does not seem to judge light conditions very well, often telling me that the camera was shaking in daylight conditions.  I also found it cumbersome to sift through the \"scene\" features on this camera.  While the camera worked very well underwater for snorkeling, it fell short on land. I purchased the camera based on design and durability, believing that a company like Olympus would have figured out how to take digital photos, but I was wrong.  The biggest issue for me - the internal lenses fogged, leaving me photo impaired for the remainder of a vacation in Central America.  I will not buy another Olympus.", "Date": "October 5, 2010"}, {"Title": "Broke after 2 1/2 weeks!", "Author": "David", "ReviewID": "R314X1XGUHIHIH", "Overall": "2.0", "Content": "I love this camera, and  its predecessor the Olympus 770 SW (which worked fine, but i lost it). However, after less than 3 weeks of use, it will turn on but then nothing else happens, and the power button has to be pressed twice to turn it off, because the first time the lens cover closes then opens again.I have taken it kayaking near Washington DC, and it worked great, but the reason I bought it is for the marine biology field study program in Turks & Caicos, which is where I am right now. I used it snorkeling, always in less that 10 feet of water (its waterproof to 16 feet), and have been very conscientious about washing all the saltwater and sand off its exterior and lens, and have kept the battery and memory card closed at all times except when charging and uploading photos.The camera worked fine, but after it ran out of batteries and I charged it a few days ago, the camera stopped working. All it will do is attempt to turn on (the screen flashes \"olympus\") but then the screen goes dark and appears on, but completely black, no menu, no image, nothing. None of the buttons do anything, pressing the zoom and shutter controls doesnt move the lens or take pictures, and it even has trouble turning off. I'm abroad for the next 3 weeks and now have no camera for field marine organism ID sessions and mesurements, or for personal photos for that matter, and can't do a damn thing about it until im back in the States.I dont know if this is an electrical, software, physical or factory defect problem, but I've read a few reviews of olympus underwater and tough models having a similar problem, so I'm hoping I can at least get the camera fixed or repaired by olympus, but nothing can replace the photos I can't take now. I like the camera when its working, but now its just a $240.00 paperweightALSO it is not as scratch-resistant as it claims; my LCD has lots of tiny scratches, and the rim around the lens cover has started to chip away in some places; I wish I had a protective case or even an underwater case for it, but that defeats the purpose of this camera, doesnt it?All in all, if I had to do it again, id get a normal camera with a waterproof case, or spring for the 8010 model, which seems more durable (though if this problem is internal or factory related, that wouldnt help me anyway)", "Date": "July 21, 2010"}, {"Title": "Rugged features are great!!!", "Author": "Lauren", "ReviewID": "R1EE89N3HB1AXC", "Overall": "3.0", "Content": "If the purpose of purchasing this camera is to use it for it's rugged features then the camera is great! However if it's an amazing photos you want this might not be the camera for you.", "Date": "July 19, 2010"}, {"Title": "love this camera.", "Author": "J. Warner", "ReviewID": "R1FIYV9L3QCAM5", "Overall": "5.0", "Content": "I am 6' 6\" tall and weigh over 250 lbs. and am pretty clumsy.  I destroy most things. . . Not because I want to, because things just aren't made to hold up to me.  This Camera IS : )  AND, it takes very good pics.  I take it with me EVERYWHERE.  I have dropped it and kicked it and bounced it across parking lots and on the beach and down the stairs.  I have left it in my car in the dead of summer and the dead of winter.  If you want or NEED a \"tough\" camera... THIS IS IT : )", "Date": "December 31, 2013"}, {"Title": "Very Useful!", "Author": "Dani O", "ReviewID": "R3CM0XZFH0ZSTB", "Overall": "4.0", "Content": "I love that this camera is waterproof. I've taken it on a cruise with me, to water parks, white water rafting, boating, in the lake, in the pool, even when it might rain. I've also brought it places where I know it might get dirty like a 'paint 5K' because I knew I could wash it after. This is great for those kinds of use. It takes half decent pictures but it has a hard time in bright light and darkness. I wouldn't use this as you regular camera but it is great for vacation or when you can't bring your other camera. I've had it for about 2 years now and haven't had any problems. The battery life isn't great so I suggest getting an extra battery and a floating strap (it will sink). Overall well worth the money and I recommend it.", "Date": "October 26, 2013"}, {"Title": "Great price, great camera!", "Author": "joe devito", "ReviewID": "R2FN3XUXGQO65F", "Overall": "5.0", "Content": "I bought this camera for a vacation in the Dominican Rep.  We used it at the beach, pool, zip lining and snorkeling.  It took a few drops and lots of water and worked great the whole tome.  it takes good pics and is easy to use.  The video is good too, even underwater.", "Date": "April 8, 2013"}, {"Title": "Works Great For Me", "Author": "Joseph Or", "ReviewID": "R164T0GJIF49C3", "Overall": "4.0", "Content": "Saw some concerns about this Camera when I bought it.I've used it for a couple of years now while kayaking. Have carried it attached to my PFD. So it has gotten banged around some. Been under water with me more than I want to admit. Has seen chlorine pool action while practicing. I'll keep using this one till it dies and then look at whichever model they have on the market that replaces it.", "Date": "April 5, 2013"}, {"Title": "DONT GET IT", "Author": "cathryn yarbrough", "ReviewID": "R36B2NHUMCQE3B", "Overall": "2.0", "Content": "It's was a good camera for one year. But a month after the warranty was up it broke and was no longer waterproof. Even when the lock was on, the camera leaked water and I wasted a good camera, money, and time.", "Date": "March 20, 2013"}, {"Title": "Great outdoors camera", "Author": "Michael Becker", "ReviewID": "RHG30EJNGDFHS", "Overall": "5.0", "Content": "Lovey camera and use it on the boat at the coast. I also took lots of video and they worked great. Good for the money", "Date": "November 24, 2012"}, {"Title": "Poor Image Quality - Broke First Time in Water", "Author": "Rubaflo", "ReviewID": "R3JQY5UK7NPNTW", "Overall": "1.0", "Content": "Had the previous Stylus Tough for several years and loved it.  Finally bit the dust and decided to just upgrade to the newer model.  What a mistake!  The camera was woefully slow, very poor image quality and broke the FIRST time it went in the water.  A complete decline in Olympus cameras and will be buying another mfr next.", "Date": "March 11, 2012"}, {"Title": "What a great little camera", "Author": "Cmetrav", "ReviewID": "R2C8A1PTDEYFE5", "Overall": "5.0", "Content": "I recently ordered this camera for my wife. We have used it 5 or 6 times now and we are really beginning to love how easy it workas as well as the features. The best feature I have used so far is the panaramic veiw and how easy it is to use and how it leaves part of the last frame on there so you can lign it up just right. I have also used it in low light and I amazed with how well it captured the bon fire and we could still see all the faces of the people around the fire as well. I look forward to seeing how well it takes pics underwater and will be trying this feature later next month I don't think I have ever used a point and click camera that does such a great job with the focus and images being so crisp as well. If you are looking for a great little camera that you don't need a PHD to use", "Date": "October 10, 2011"}, {"Title": "Disappointing overall", "Author": "WaterColors", "ReviewID": "R1DUDWFUMIGDXV", "Overall": "2.0", "Content": "This camera appears very similar to the 8010 - in form and function. But one of the critical practical differences is that the water-tight lock (which insulates the battery, memory card, ect... from water) is built much worse than on the more expensive cameras. This is a simple mechanism but it appears that Olympus made is worse so that the customer would purchase the more expensive camera.As you can figure from the above, the issue that I had with the camera is that once it was brought into the water, it leaked and was destroyed.As for the picture quality - I did not like how it works inside - always need flash and the pictures still come out sub-optimal. This is common with all such insulated cameras.Bottom line, either purchase the 8010 or look for another series.", "Date": "September 23, 2011"}, {"Title": "Small and tough", "Author": "L. Lee \"HerpGirl\"", "ReviewID": "R2BX3JZPK3X61I", "Overall": "4.0", "Content": "Overall this camera is made to be tough and take decent pictures.  There are some aspects that aren't great, but overall it works well.  I use it as a field camera (I have a larger digital SLR, but when I'm out in the field, I don't like to carry it).  I bought it because it was tough and waterproof--both very nice features for me.  In that respect, it worked very well.  I have dropped it and taken pictures in the rain, and it works like a charm.  It is nice and small, so it is portable.  The battery life is also very good.The flash is really powerful--which can be really good.  But indoor pictures are constantly turning out poorly because of the strength of the flash.  I find myself taking pictures without the flash and just accepting the slight blur. The settings were also not intuitive.  I was constantly trying to figure out how to change them and often would give up and go for the automatic--which never was very good.  I finally started taking them in automatic and changing the lighting and such in a computer editing program.So all in all, I can't say that this camera was awful because it did have some pros that I think were beneficial to me and could be to other people.PROS:SmallToughWaterproofCONS:Flash can be too strong in portraitsNot intuitiveSettings were frustrating to learn and use", "Date": "August 16, 2011"}, {"Title": "Bought camera for my daughter.", "Author": "Kerry S. Baker \"Reader\"", "ReviewID": "R3D8EO4UDKFW6F", "Overall": "4.0", "Content": "I bought this camera for my daughter in California and thought the underwater option was a positive. Well, I've seen the results and they are fabulous!!!She was a little leery of taking that first underwater shot (!) but has taken some fantastic pictures.  So glad I bought it for her and based on what she says, I rate it highly and I'm glad I bought it for her!", "Date": "July 10, 2011"}, {"Title": "Great camera!", "Author": "P. Solis \"Pachi\"", "ReviewID": "R3NO3MR5AHNYKK", "Overall": "5.0", "Content": "This camera is great! I took it to a rafting trip in WV and to the beach, it works perfect! You do have plug into the computer before insert the memory card, but other than that is a great addition to your electronics ! :)", "Date": "July 8, 2011"}, {"Title": "Water Proof Camera", "Author": "V. KOERNER", "ReviewID": "R1CFIDUBUDH8AQ", "Overall": "5.0", "Content": "Easy to carry, water proof to swimming depth,shock proof from kids height.  A High quality camera that is easy to use, easy to carry around kids to get the once in a childhood shots", "Date": "May 1, 2011"}, {"Title": "Grreat camera for anything! Underwater works great!", "Author": "H. Goldberg", "ReviewID": "RK1G97419XMWB", "Overall": "5.0", "Content": "I bought this for  vacation to Mexico. The camera work wonderfully. I took it snorkling twice and love the pictures and video I got. Unlike my old camera that broke after a day at the beach (sand got in the lens). This camera is still going strong after going to the beach everyday for a week!", "Date": "January 7, 2011"}, {"Title": "Breakable.", "Author": "Kathryn", "ReviewID": "R11LLQVRV3CHZ1", "Overall": "1.0", "Content": "When I saw this camera in the store, I was very impressed. The salesman took the camera and banged it against a metal post, showing that it would not dent or scratch, or even better, break. Then he showed us that he could step on it, and drop it from a certain height, and it would remain in good condition. The thing that really got me interested, was that it was waterproof. I went to Greece over the summer, and I had a very hard time trying to figure out what setting to use. During the night time, if I had a dark picture, you would see \"bubbles\" all around and it would totally ruin your picture. I sent in my camera twice, over six months. It would not turn on, and the pictures would not upload to the computer. The memory card that was supposed to fit in the camera didn't slide down all the way. In all, I would not suggest this camera to anyone who enjoys sending in their camera often, and enjoys not knowing which setting to use.", "Date": "January 2, 2011"}, {"Title": "Best point-and-click for the money", "Author": "Dirk", "ReviewID": "R1V258AYWKV9NK", "Overall": "5.0", "Content": "I have been through two point-and-click cameras in the the last few years, this one is by far the best. It is smaller and lighter, and I like doesn't have the telescoping lens sticking out the front. There are a few low profile buttons on the back that are easy to switch settings with using the LCD, no knobs to turn. It is by far the most durable camera that I have had, and waterproof is a nice change. I also really like the rechargeable battery; just like my cell phone it charges as I have it plugged in to the USB port. I think it will pay for itself just in the battery savings alone. I find it responsive and quick to take pictures that I want, the panoramic utility is awesome, and it comes with a nicely made picture management transfer utility. Online support from Olympus is easy to navigate.I have no bad things to say at this point!", "Date": "November 8, 2010"}, {"Title": "So far so good", "Author": "J.P.", "ReviewID": "R2I63ZVH3054RB", "Overall": "4.0", "Content": "This camera takes pretty good quality photos. Except in low-light. ALL of the low-light pictures taken from a distance greater than about 5 feet away have been extremely pixelly, even with flash. Pretty disappointing when you're trying to get a group shot. The panoramic setting is fantastic, super easy to use, and - oddly enough - picks up small details even from very far away. Perhaps next time try panoramic with flash during low-light group shots? who knows. The manual for this camera is online I believe. Haven't tried the underwater feature but hopefully it will work out, it seemed to get good reviews from other users. It's a little slow at navigating the different scenes and functions, but it's been improving with time. I love how I can drop this camera (super clumsy) and know it will be a-OK! Good buy so far. And pretty color!", "Date": "September 13, 2010"}, {"Title": "GREAT CAMERA!!!", "Author": "DRASH", "ReviewID": "R14M9QGHUQS9UO", "Overall": "5.0", "Content": "Awsome camera. I was a little nervious at first about dunking it in water but it worked great for underwater pictures and video. I need an extra battery and i bought a 16gb sd card which gave me over 4000 pictures or over 5 houres of video.", "Date": "September 3, 2010"}, {"Title": "good camera", "Author": "faye544 \"faye544\"", "ReviewID": "ROOC7TJ0PNXBH", "Overall": "4.0", "Content": "I needed something durable and small for taking pictures while out with my toddler. This camera has been through the ringer already when she plays with it! It takes nice pictures & I don't worry about her getting her hands on it.", "Date": "August 16, 2010"}, {"Title": "great so far!", "Author": "E. McLain", "ReviewID": "R1Q529BUNL0STS", "Overall": "4.0", "Content": "So far so good....I have had this for a month and takes great pictures and the water/underwater pictures are great.  We spend tons of time at the beach, our pool and the waterpark so waterproof was necessary.  The only complaints I have are 1.) the battery runs out pretty fast and 2.) it takes a long time to turn on and off.  Maybe because of that I leave it on a lot and that's why the battery runs out!!!", "Date": "July 31, 2010"}, {"Title": "Good Camera", "Author": "Jon Reynolds", "ReviewID": "RO40KTQ1D0230", "Overall": "5.0", "Content": "I haven't pushed the camera to the specification limits that the product pushes.  But I am impressed.  Picture quality is great.  Pictures look 100x better on a computer screen rather than the small 2.7 inch screen.  This is a wonderful point and shoot.  Start up time when you power the camera on isn't the fastest but it is quick.  The menu options are very easy.  It is very easy to switch the flash on and off, which the option I toggle back and forth the most.  Dark photos with a flash do not look all that spectacular but still have great detail, but what do you expect, eh?My one qualm is the USB cable.  The USB cable provided is not like the old standard USB cable that you use for peripherals like your printer.  The end you plug into your camera is a bit newer technology.  I'm guessing it allows the camera to charge more quickly.  So my advice is to get a small case that allows you to ALWAYS have that cable with you.  You will need it to charge the camera.  I love the USB to A/C adapter that comes with the camera.If I broke/lost this camera I would buy another.", "Date": "June 16, 2010"}, {"Title": "Never is not Better", "Author": "Ken M Francis", "ReviewID": "R2BVVPGI03FW9F", "Overall": "1.0", "Content": "This was my 6th Olympus camera. I have been a fan of the cameras ease and durability.  Not the case with my new Stylus Tough. I miss the function dial from the past cameras. Scolling a menu is no as quick as setting a dial.  The time between pics was also slower than past models. But worse of all, my camera died after 5 minutes of snorkeling. This was my 3rd under water Olympus... seals were checked before I jumped in the water. Not the kind of misfunction you expect from a new camera while on vacation! I am marching my camera over to Olympus Headquarters as soon as I return home!", "Date": "April 15, 2011"}, {"Title": "not work'n", "Author": "A. Kriener", "ReviewID": "R39WT0AU1VGTQM", "Overall": "2.0", "Content": "Still not working after 2 months now.  It took the company about 1 month to send me a charger and that aint it so now i have to send it in and that sucks.", "Date": "July 14, 2010"}, {"Title": "Very Slow and the Battert life is awful", "Author": "Aacitimaster \"poet04\"", "ReviewID": "R3EBNTVC4WWOLW", "Overall": "1.0", "Content": "I purchased this camera some months ago for my wife and son. I searched some reliable websites and chose this one. We have thrown several cannon and olympus point and shot digital cameras away because those were simply broken as we fell them down on the ground by mistakes. This model has however a couple of serious problems that irritate us. First, when we push on button, the lens door open immediately but the camera is not available to take. The software takes time too long to initiate. So it's almost impossible to take a shot of an important moment we face suddenly. Second, the battery life is worse than any other ones I have uses so far. My conclusion is that if you want to use this camera as a regular point and shot one, it's not wise to have this. To be honest, if possible, I'd like to return or exchange this with other regular yet durable one. Worse is that any review articles from I read from CNet for instance have little mentioned on these problems.", "Date": "August 23, 2010"}, {"Title": "Too Sloooowwwwww", "Author": "Daniel Williams", "ReviewID": "R3DXB5BSZIT4BF", "Overall": "1.0", "Content": "I am not a pro when it comes to cameras, but I do know that 5 seconds from the time you push the power button until you can take a picture is unacceptable.  This review sums it up fairly well: http://www.amazon.com/Olympus-Stylus-Digital-Camera-Pink/product-reviews/B0031RGEUO/?ie=UTF8&showViewpoints;=0&filterBy;=addOneStarI returned this and bought the Sony, and am much happier now. http://www.amazon.com/Sony-Cyber-shot-DSC-TX5-SteadyShot-Stabilization/dp/B0033VMM3G/", "Date": "July 24, 2010"}, {"Title": "A great buy", "Author": "Brandon Lee Padgett", "ReviewID": "R7RA0ON9BFKAF", "Overall": "5.0", "Content": "This camera is a great buy for ony one who is going to be out side in the elements and wilderness.  It's tough and easy to use.  Also it takes pretty great pictures, and that is always a plus when buying a camera.", "Date": "April 18, 2012"}, {"Title": "I LIKE IT SO FAR", "Author": "bricks and mortar WON", "ReviewID": "R2H8E7DX1RV9U7", "Overall": "4.0", "Content": "IT HELD UP UNDER WATER AND TAKE A VERY GOOD QUALITY PICTURE. THIS IS MY SECOND OLIMPUS WATER CAMERA AND THEY SEEM TO HOLD UP VERY WELL FOR THE PRICE", "Date": "August 16, 2011"}, {"Title": "Tough camera", "Author": "alex", "ReviewID": "RUO25D0MIRLXL", "Overall": "4.0", "Content": "The camera is pretty great. It does as said, for now. The shipping was pretty slow but all in all a great buy.", "Date": "July 10, 2011"}, {"Title": "Great Camera at a great price", "Author": "Bilaal N. Kirkland \"Veteran08\"", "ReviewID": "R37A4XIBYEHQZS", "Overall": "5.0", "Content": "This camera is very easy to use with an easy set-up. I have not tried it under water yet but with this camera I'm not scared to let my little children run around taking picture with a fear of them dropping and breaking my camera.", "Date": "May 29, 2011"}, {"Title": "So far, so good", "Author": "Connie", "ReviewID": "R1Q04ZRTVTL0WX", "Overall": "5.0", "Content": "We bought this underwater camera for a trip to Mexico. We haven't gone yet, but have used it around the house. It is good so far. It is a little heavier than I expected and a little bigger (buying a case for it was a little tricky). Overall it is a nice looking camera that is easy to use. I hope it works as well under water.", "Date": "April 29, 2011"}, {"Title": "Not very Tough, Photos are blurry", "Author": "Baillynn", "ReviewID": "R1VQP726TTYVOE", "Overall": "2.0", "Content": "I Bought this camera in November, owned it for a month and I dropped my purse with my camera in it and the camera broke.  The camera would turn on but the screen remained black with just a white blur on the bottom right corner.  I paid extra for the camera because I thought it was supposed to be indestructible but I was very wrong.  Also the pictures always seemed to turn out blurry, I'd have to take several pictures of the same frame to get a good one. I tried every setting and always ended up with the same result. I tried referring to the owners manual,and well there wasn't one. I had high hopes for the camera with four small children I need a tough camera but was disappointed in the product and had to return it.", "Date": "January 20, 2011"}, {"Title": "slow to react & ask your foto subject to stand still for a while", "Author": "michael", "ReviewID": "R3UPP1L8OOBFZ7", "Overall": "1.0", "Content": "this camera would not take sharp pictures of a person that is not standing still -  at daytime!!! exposure times seem to be awkward. switch on ceremony: wait 5 seconds while as you enjoy the olympus song tataataaa.the camera is robust but not as easy to use as the our 3 year old olympus my1030.we really liked our old my1030 but after 3 years water came into the camera. the old camera used to be waterproof and good. we returned the new camera.", "Date": "August 17, 2010"}, {"Title": "Disappointed", "Author": "Savvy Shopper", "ReviewID": "R1SL2B6ZS9H4D1", "Overall": "1.0", "Content": "I was initially excited with my camera purchase because a few of my friends have this camera, only to have it break 2 weeks later... I only used it one day!  It was working fine, and then I had it in my camera case on my dresser, and the next week, it wouldn't work properly!  Sometimes it turns on, sometimes it has an error message.  The few occasions it does turn on, it displays a \"card error\" message.  Since I didn't open it for a few weeks after I got it, I can't return it on Amazon and now I'm S.O.L.  How disappointing.", "Date": "July 11, 2010"}, {"Title": "Tough Camera Body and Great Photos and Videos", "Author": "Chic Shelby", "ReviewID": "R29X45GE1UTFIT", "Overall": "5.0", "Content": "I recently purchased this camera, via Amazon, and have been quite happy with it. I took it to a pool party recently and all the kids wanted their picture taken underwater! I emailed the photos to the parents. The photos are high quality and can be enlarged to a 8x10. It is small and fits in any bag. Plus it's green and I love green! I haven't tested the \"shock proof\"ness of the camera...that kind of freaks me out but I like that it has it.*My husband and I recently returned from the Galapagos Islands and this camera captured the entire trip in photos and videos. We hiked with it swam with it went from photo to video on land and in the water. The photos are of HIGH Quality and the Video is great too. You can easily go from photo to video and back. The video does consume a little more battery sooner than the photo feature but this is to be expected. This camera is far from my Nikon D60 but I have control and get great quality photos from a point and shoot.*You can see my [...]", "Date": "July 2, 2010"}, {"Title": "Great camera.", "Author": "opeapod", "ReviewID": "R20DIEZ711UE4P", "Overall": "4.0", "Content": "We have only had this for a month but love it.  I chose this camera because I have broken my last 2 digital cameras from dropping them (have had multiple surgeries on my hands and dont have the best grip).  The camera states that you can drop it from 5 feet and have it be okay.  We're not trying that out, but I can believe it.  We also travel a lot and do a lot of snorkeling and pool activities with the kids.  We havent tried it out in the ocean yet but the underwater pool pictures are awesome.  It is very durable and we feel comfortable with our 5 and 6 year old boys using it in the pool to take pictures.  It has a lot of settings and is a little difficult to understand what to use each setting for but as we continue to use it and play with it, we are learning more. They have a setting on there where if you hold the button down, it takes continuous pictures.  This was great at my niece's graduation when they were throwing their caps in the air, or other fast speed activities.  Overall, definitely worth the money!!", "Date": "July 2, 2010"}, {"Title": "Broke after second day of vacation horrible do nottt buy this thing.", "Author": "Gino", "ReviewID": "R2MA411CKMAK97", "Overall": "1.0", "Content": "You're better off buying a cannon camera and buying a waterproof hard case for it.luckily i returned mine to the store i bought it from, but i bought it the day before i went to the Dominican republic. I was excited to have the chance to get so many good pictures on my trip. Sure enough second day it broke on me, in the POOL not even in the ocean. It never opened up but water got inside of the camera somehow. The battery compartment is horribly designed i could see easily having it open up under water. Apparently it breaks without it opening but, needless to say I was quite pissed due to the fact i only have two days worth of memories.", "Date": "July 9, 2010"}, {"Title": "What they don't tell you", "Author": "J. Loucks \"JLoucks\"", "ReviewID": "R1BVYF88C0O0I6", "Overall": "1.0", "Content": "I bought this camera and it works ok outdoors, but once you take it indoors and shoot more than 10 feet the pictures are extremely grainy.  It was so bad I sent mine in for warranty repair. They sent me a new one, and it was just as bad! There is something wrong with this whole line of cameras. Worse than my $98 Canon!", "Date": "June 8, 2010"}, {"Title": "Broke after a few days", "Author": "Seamus", "ReviewID": "RB5ZY8F9YUWZO", "Overall": "1.0", "Content": "We bought this for a trip to Costa Rica mostly because it was supposed to be durable and I didn't want to bring the SLR. It worked the first few days and then on one of the later days, it had an error message \"no connection\" and it would not take any more pictures. Luckily I was still able to get the pictures off the camera. Now I'm going to have to send it in for repair. We never dropped it and it went in about 1-3 feet maximum depth of water. In terms of picture quality, it's not bad but not impressive and there is a noticible lag before taking the picture.*** Our second camera (replaced under warranty) has worked until now (9/11). Looks like I'm not the only one who has gotten a lemon from the comments below. Was mostly disappointed because we couldn't take pictures for the last couple of days on the trip.", "Date": "June 13, 2010"}], "ProductInfo": {"Price": "$279.00", "Features": "14.0 megapixel CCD\n5.0x wide optical zoom\nWaterproof up to 16 ft\nShockproof up to 5 ft", "Name": "Olympus Stylus Tough 6020 14MP Digital Camera with 5x Wide Angle Zoom and 2.7 inch LCD (Green)", "ImgURL": "http://ecx.images-amazon.com/images/I/41mjCc4e2SL._SX300_.jpg", "ProductID": "B0031RGEUE"}}