{"Reviews": [{"Title": "Stellar image quality in small package", "Author": "Enche Tjin", "ReviewID": "R1RTIFEQ6S4TC6", "Overall": "5.0", "Content": "Sigma DP series are unique because it is the first compact camera that utilize a large sensor size equivalent to Digital SLR camera. It is also unique because it use Foveon sensor instead of more popular CMOS / CCD sensor. So far, only Sigma uses this type of sensor. Sigma uses it on compact DP series (DP1, DP2) and DSLR like SD series (SD10, SD 14, and upcoming SD15).Foveon sensor has different characteristic than regular sensor, which I will discuss a bit on image quality section.So, what is new about DP2s? Sigma DP2s is an update of DP2, so it has many similarities like the image sensor, shape etc. The main improvement is in the processing speed. DP2s use TRUE II engine which Sigma claims to be faster than TRUE I which is employed in DP1.Main Specs- 14 MP Foveon sensor- 24.2 mm f/2.8 lens equivalent to 41mm in 35mm camera.- True II processor- 2.5' LCD screen, 230k resolution- ISO 100-800 expandable to 3200- 3 fps continuous shooting- 9 selectable auto focus pointsBODY & HANDLINGSigma Dp2s weighs 260g, and its dimension is 4.4 x 2.4 x 2.0 in. (113 x 60 x 50 mm). It is just a bit bigger than Panasonic LX3, an advanced compact camera, and smaller than Panasonic GF1, a micro four thirds camera.Sigma DP2s has metal casing. The design is plain and boxy, at a glance, it is almost similar to Canon S90 IS but larger in size due to the bigger sensor and lens.Despite the plain and boxy design, it is good to hold and does not attract attention.  When it is on, the lens will extend out around 1 inch.Sigma DP2, the former model has been criticized quite heavily because of the unclear labeling (dark text in black button). In Sigma DP2s, the labeling become clear (white / red in black body).LCD screen is quite small compared to today standard (2.5' in) and low res (230k) but it is good enough to compose picture.To change important setting, Sigma has QS (Quick Set) button which you can access various important settings such as ISO, WB, Release mode, film mode, image quality, aspect ratio, metering and flash. It is not the quickest way especially if you compare with DSLR or m43 cameras that has plenty of dedicated buttons, but this works fine.To change aperture, shutter speed, exposure compensation and to navigate the menu, you will rely mostly on up and down button and four way buttons.Menu system is quite simple, there are 21 items that you can modify. However, the menu is not categorized.Sigma also has unique Manual Focus with distance indicator. This is helpful for manual focus, and you will use it quite a bit because DP2s AF is not working very good when shooting close subjects. MF is easy to operate, just push the OK button to magnify the screen.IMAGE QUALITYAs I mentioned before, Sigma DP series is unique because of the Foveon sensor.\"Traditional color film uses red, green, and blue sensitive color layers in the emulsion to capture the image. The Foveon uses the same approach to image capture with three overlapping layers of light gathering, with each layer sensitive to a different color.\" AnandTech.This has several consequences. Sigma produces smaller image size (2652×1768×3 layers) (approx 4 MB) compared to popular Nikon D90 12 MP sensor (4288 x 2848). Sigma also has more noise in higher ISO setting. From ISO 50 to 200, image is very clean. ISO 400 is very good and ISO 800 is the limit of acceptable image. In Nikon D90 or other DSLR, 1600 or even 3200 is still very good.However, in term of image quality: clarity, color, and sharpness, Sigma DP2s really shines. It is excellent in pixel level, good contrast and saturation. I like the skin color, and the JPG output require less brightness/contrast adjustment compared to most DSLR I've tried.PERFORMANCETo process image from Foveon sensor require good processor. And this is what Sigma lacks in previous DP cameras (DP1 and DP2). This is made worse because Sigma is not a strong electronic company like Sony or Samsung. Therefore, processing image and general performance of DP1 and DP2 is slower.However, Sigma uses new processing engine called TRUE II, which I think improves the overall camera performance significantly. I say \"significantly\" because I haven't tried the previous generation.For me, DP2s performance is very good compared to compact cameras. It starts up and shut down reasonably fast (around one to two seconds). Auto focus speed is quite slow but bearable at around .5 to 1 second. When shooting close subjects, auto focus regularly won't work well.Overall, the performance of Sigma DP2 is about a bit below average compared to compact cameras. However, it has been improved significantly from previous series, which could be a lot worse (according to critics).What to like about Sigma DP2+ Image quality (color, crispness in detail, sharpness) is excellent in low ISO+ Sharp and popular 41mm (normal) equivalent lens with reasonably fast lens f/2.8+ JPG output requires less post processing adjustment+ Solid built quality with boxy inconspicuous design+ Simple user interface and Quick MenuWhat I don't like about Sigma DP2- Auto focus performance could be a bit faster- Auto focus won't work well especially for close subject- LCD screen freeze when shutter is half pressed for AF- Poor image quality at ISO 1600 and 3200 and it is only available when you shoot in RAW- When shooting in long exposure, the processing become longer than usual. It could takes up to 4-5 seconds.- Long exposure  is limited to 15 secondsCOMPETITORSLeica X1 12.2MP APS-C CMOS Digital Camera Price: $1995Leica employ 24mm f/2.8 lens (equiv. 35mm), an APS-C sized sensor (equal to DSLR camera) and no nonsense classic interface design, including dedicated shutter speed and aperture dials with excellent built and \"Leica feel.\"Ricoh GXR Interchangeable Unit Body with Ricoh LENS A12 50mm F2.5 MACRO Camera Unit, 12 Megapixel $1080Ricoh GXR is an unique interchangeable lens/sensor (lensor). Ricoh GXR - A12 also use 12 MP CMOS sensor that you will find in DSLR cameras. Ricoh cameras are famous for its user interface.Panasonic Lumix DMC-GF1 12.1MP Micro Four-Thirds Interchangeable Lens Digital Camera with LUMIX G 20mm f/1.7 Aspherical Lens $800Panasonic GF1 is a compact interchangeable camera that use four third sensors. It is smaller than CMOS or FOVEON. GF1 is more responsive. It has leading auto focus performance and wide array of lenses.CONCLUSIONIf you choose Sigma DP2s, it should be because of its image quality. Because the overall performance (speed) is not that great, DP2s is suited for people who is more deliberative in making photos and less suitable for fast action photography.Subjective Rating - Relative to mirrorless camera and compact with large sensor 2010Image Quality : 6/5 Excellent qualityFeatures : 2/5Performance : 3/5Body and Handling : 3/5Value for Money : 3/5For image samples and iso comparison plus other reviews, please visit my blog. You can find the address through my profile page. Thank you for reading.", "Date": "June 5, 2010"}, {"Title": "Great Camera", "Author": "Hg Wells", "ReviewID": "RYFYMMJNGFWIO", "Overall": "5.0", "Content": "I recently bought the Sigma DP2S along with a normal point and shoot zoom camera, the Panasonic DMC-ZS7. I was going to wait for the Sigma SD 15, which has not been released as of the date of this review, but I wanted to try out the Foveon sensor. I have considered replacing my entire Canon system with Sigma's SD 15 based on the image quality I have seen and comments by some pros. While waiting for the SD 15 to become available, I decided to try out the DP2S. I figure I'll return it after trying it out. Well, that was the plan. After having played with it for a few days, I'm at the point of not being able to return it. It's a wonderful camera. Image quality is terrific, better than even some of my Canon's L lenses. No zoom. No interchangeable lenses. Expensive camera. But great photos. And that's the bottom line why I get a good camera. Not only am I increasingly likely to keep it, but I still also anticipate getting the SD 15 when it's out. The SD 15 is a full SLR with a variety of good lenses available. The DP2S only has the built-in, non-zoom lens. Why am I paying so much for a non-zoom \"compact\" camera, I ask myself, especially since I now have the Panasonic point-and-shoot and anticipate getting Sigma's SLR? Someone somewhere called Sigma's Foveon sensor cameras the \"poor man's Leica.\" And I now understand why.The menu system and controls of the DP2S are different from most digital cameras. But I like them. The more I have become used to them over the past few days, the more I resent the more \"traditional\" digital complications. I love the unusual manual focus option. (Read the manual to understand the zoom to focus option.) I also find the Sigma software good, though it is limited in its functionality and it can't seem to handle opening large numbers of photos on my Mac without crashing. Like others, I really hope that Apple will begin to support Sigma's RAW format. It is frustrating that iPhoto and Aperture do not support SIgma RAW at the moment, though the JPEGS are, of course, supported. And you can convert to JPEG in Sigma's software and then import wherever you want. The software is a free download from Sigma's website so you can try it out without having to get the camera.The view screen on the back is difficult, sometimes impossible, to see in bright sunlight. Like others, I'd love a built-in full function viewfinder. The optional one does have the full display of settings. Low light performance is really not great, as people have mentioned elsewhere. The camera is slightly big to wear on my belt and I'll have to look for a camera case that it fits in with a belt loop to see if I can make it work anyway. I prefer a camera on my belt. That's what I do with my point-and-shoot so that I'm never without a camera. There might be an additional thing or two I'd prefer they do different and I suspect Sigma will do those in future models. But the bottom line is that this camera can take great photos and it's easy to use. The metal build feels good and I like its simple looks. But don't try out the camera thinking you'll return it. It's proven tough for me to do.For me, the camera has made taking pictures fun again. It's not the work getting all my Canon equipment together to go take photos now, except that photo opportunities for which a zoom is needed are naturally lost. But the lens is great and the sensor is great and, with others, I can highly recommend it.  I'm really looking forward to Sigma's SD 15 when it's finally out.", "Date": "June 15, 2010"}, {"Title": "The DP2S may become your most frequently used camera", "Author": "R. Tse", "ReviewID": "R1TTYLDCKJTO22", "Overall": "4.0", "Content": "So much research and reviews were dedicated to the pros and cons of the X3F. For the skeptics, let me say those claims on superior dynamic range and color accuracy are all true. The tradeoff on occasional inconvenience caused by the lack of a zoom lens for better image quality produced is well worth it. So what is missing? For now, the DP2S still feels more like an artist tool. This pocket size camera will need to add more features such as face detection in its next upgrade before winning over the crowd. Nonetheless, those who have been holding off a purchase, waiting for more interchangeable/mirror-less models to choose from may want to think about why Sigma and Leica are the only two brands so far that offer compact models with APS-C size sensor and a fixed focal length lens. After owning one, I firmly believe this is the right combination to go forward with.", "Date": "May 19, 2010"}, {"Title": "Best Still Image Quality in Its Class", "Author": "Joe Cho", "ReviewID": "R7NDKTJ2CR6SE", "Overall": "5.0", "Content": "*August 2010: (from time i purchased)I am not going to explain the details as above users have explained more than enough.i tested out indoors and outdoor shots, and despite all of what it can not dos, the image quality is amazing, and this little thing will embarrass some of big bulky and more expensive DSLRs. SigmaDP2s is slow, Point and shoot is not easy, but more like think and compose then press the shutter with confidence. Definitely not for beginners and definitely not for a fast moving objects. The stunning picture quality can be achieved usually with still objects with a tripod.Taking one shot at a time is what this camera is for. Video quality is bad, don't bother with it.the only thing good for is the image quality, and it's the best in its class which is the only reason i bought it.I will post more photos as i test out more and after later time..*January 2012 - After using this camera for about 16 months: DP2s produces exactly the same as the new. So far no problem, no error, does the same job every time producing that colorful foveon sensor that Sigma claims that is unique and film like... still very happy with the camera.*January 2013 - After 28 months of owning, this camera is very unique in that it has foveon sensor. Now there are many point and shoot cameras at this price range produces less noise, better looking fast camera, but the picture quality and the way it process the picture is somewhat outdated and slow, but still unique and special. Still produces that fantastic life like rich vibrant colors. Recommend for thinkers artsy peeps out there.*December 2014 - I mostly used D700. D600 was good but oil/dust problem, D800 files are too big. D700 is semipro good for back up pro cameras. SigmaDP2s. Still rocks. the image quality is very different from other sensors. Just different not better but i like it. I tried to sell it but there is something about it that i want to shoot with it once in awhile. Big fan of foveon sensor. I hope Sigma keeps on making improvement on this sensor. Full frame size plus higher iso plus the speed would make it one of the best camera.", "Date": "August 9, 2010"}, {"Title": "Want to like, but hard to love", "Author": "mmoe", "ReviewID": "RM3C6UKYQCSBW", "Overall": "3.0", "Content": "I bought the DP2s with limited information as all who buy it probably has. The concept of capturing all three RGB values at each pixel for true color without interpolation is something that I think most experienced photographers can appreciate. If you don't understand what I'm talking about, it is most definitely not for you.Sadly, the first thing to great you into the Foveon sensor world with this camera is an LCD screen that seems like it came out of the late 90's. It's neither large, nor is it detailed in what it shows. Most previews displayed are difficult to even make out until you zoom in, because the screen can't resolve an even passable small version of what you just shot.Next, you run into the highly illogical button arrangement, which is ironically centered seemingly around using the camera in program modes as an amateur or beginner might. I say ironical because this camera is probably one of the most enigmatic cameras ever made and would be the last choice for an amateur or beginner anyways, so why design an interface for that kind of user? Once learned, the interface is functional, but not a pleasure to use in the way that the Samsung TL-500 is. In manual mode, you adjust the aperture with left and right arrows, but for some unknown reason you don't use the up and down buttons to adjust the shutter. Instead, you are meant to adjust the shutter with the zoom in/out (in playback) buttons, which are inconveniently placed where they are easy to bump and change the exposure with your thumb. The only bright spot to the interface is the \"QS\" button, which is admittedly a very convenient way to access commonly needed settings like ISO, white balance, metering, flash, focus points, and color rendition (vivid, normal, etc.).Among it's many quirks is a manual focusing dial, which is quite pointless since you can't actually tell if anything is or isn't in focus on the inferior LCD. If they had only made the dial assignable somehow, you could make it the aperture or shutter or something that would be convenient to be able to adjust by such an accessible dial. I also wish they had put the \"focus\" feature in the \"QS\" menu, because I seem to always bump that particular setting from auto to distant or manual. I have a hard time seeing when I would use the manual focus option, and I've gone out of my way to make use of it from time to time with no real feeling that I'm getting something in return for the efforts.The camera is a bit slippery to hold, and if not for the neck strap may have found it's way to the ground a few times by now. There are some raised bumps, but it's nothing like having some rubber there.The battery life is actually pretty decent. Not great, but not bad. I have two batteries (can't recall if it came with two or not), and have never found myself without plenty of juice.Image quality is the real reason to look at this camera, and here it is still a mixed bag. It can produce some of the most amazing 5mp images you've ever seen, or it can produce really bad images that are only rivaled by my cell phone from 5 years ago. The trick is, you have to figure out which situations it's good for and which it isn't. Hopefully I'll save you a little trouble.This camera is nearly identical, in my mind, to shooting ISO 100 Fuji Provia (slide film). The colors are not over the top, but they can be right at the edge of being too much which is exactly what I'd hoped. If you are shooting in daylight conditions (color temp) and can expose properly for ISO 100, the DP2s produces absolutely stunning photos which rival my original Canon 5d (which I prefer to the mk2). It doesn't have quite as much detail, but the color is unbelievably good. In fact, I suspect that I will reach for the DP2s over any other camera (and I have a lot of them!) for walking around in daylight (or cloudy even) conditions. You can't help but be amazed by the film-esque quality to the colors. I'm a huge fan of film and still shoot a lot of it, but I'd say this camera takes that look to another level.Now for the bad about being similar to ISO 100 slide film. If you shoot this camera under low color temp conditions (light bulb, florescent, etc.), it just looks awful to my eyes. Even at ISO 100, there is quite a lot of weird colorations that seem to swirl through the image. It really is much like shooting slide film in those conditions. Even with color corrections, it just isn't the same look it has in daylight. Plus, once you've had a taste of what you COULD get, it's hard to accept that there are limits. Additionally, I find that shooting at increasingly high ISOs is similar to pushing slide film. It gets noisy first (ISO200, yes already!), then starts to color shift in places, particularly adding greens (ISO 400) and goes completely south at ISO 800 (in my opinion). As I've used the DP2s, I've tried and tried to like it at anything other than ISO 100 and daylight conditions, but I simply can't because there are so many other cameras that run circles around it in those same conditions.The auto focus system is not so good and gets confused from time to time. It's also quite slow and would never keep up with people moving. Also, keep in mind that the lens is fixed at a normal length, (in the neighborhood of 40mm, f2.8)which somewhat limits the situations where it is useful. If you like using a normal lens, it will be perfect.So, what is this camera good for? Not much, but when it is good, it's really good. I've settled on using it outdoors only or in studio when I have something that I think could use the color fidelity (with daylight studio strobes). It excels at landscape photography, architectural photography and any still life photography with daylight conditions. Other than that, I find it subpar for most other uses as compared to cameras such as the Fuji X10, Samsung TL-500, Canon S100, etc.", "Date": "January 8, 2012"}, {"Title": "You'll feel a fool to own", "Author": "Max Rottersman", "ReviewID": "R8J4YV801C3E9", "Overall": "5.0", "Content": "Others have given very good reviews of this camera, both positive and negative. What hasn't been said is that with this camera you'll feel like a fool.  Although it looks very neat, to the uninformed it will look like some $50 P&S.;  To a photographer it will look like a joke next to their bejeweled D3x or 1D, 5D Mark II, etc.  I too, love my Canons and believe they should beat this little no-name camera out of the water.  But they don't.  I've been trying for 2 years.  Yes, the full-frame cameras take photos that are difficult to distinguish, to me, from this camera.  But they're $3,000+ set-ups and they are very BIG and very HEAVY.The DP2 is a very small camera.  You can take it everywhere and you won't scare anyone.  People relax around it because it looks so non-threatening.  With good lighting, or a good flash, the images out of this camera are like the best Leica 35mm film you've ever taken.  My friends and family love the photos I take with my little Sigmas, but their eyes glaze over when I explain why they're so good.  Also, when I show photos taken with my G12 for example (a fine camera) they often don't see the difference.  I SEE it.  And I don't want to see it because I would rather have all the high ISO and ease of operation from my other cameras.  But I KNOW the difference.  Every owner of these cameras, who strives for the best quality photos they can take, knows.  It's lonely. Other photographers are snobs (and want to justify their cameras) and normal people just shrug. I just wanted to point out this other difficulty in owning these cameras (Oh, Sigma photographers are often snobs in their own right). You feel like a fool.  But when I open the images on my computer (the camera LCD is useless), I find images that give me pure bliss. Images that give me the same thrill I had when I first started developing my own photos at the age of 11.", "Date": "January 15, 2012"}, {"Title": "Best IQ out there!", "Author": "MTurney", "ReviewID": "R1CLQUF1KLGKN4", "Overall": "5.0", "Content": "I was previously a user of the Sigma DP1, and sold it a few months back. Since then, I have tried a Rivoh GRD III, Olympus E-P2, and Panasonic TS2. None of them came close to the image quality of the Foveon sensor in the DP2s. The build quality is also stellar - feels solid in your hand, even if just a bit 'slick'. I'm also glad to see that Sigma has added an interval timer and quick settings button for rapid changing of settings.", "Date": "November 18, 2010"}, {"Title": "Sigma DP2s, unique", "Author": "VWalter \"TV Casualty\"", "ReviewID": "RH3I4G2NUSG48", "Overall": "5.0", "Content": "The Sigma DP2s is unique. I cannot say it is a point & shoot, but it is not a DSLR either. It is somewhere in the middle. Do not buy this camera if you want a convenient camera to pop a few quick shots of anything. It is better for a photo that takes time. The DP2s is for a person who hunts for that spectacular image & demands extraordinary image quality. I have not seen images this great since my last film camera broke in 2004 & I went digital.I struggled between getting a DSLR or this camera. However, I only wanted to shoot with a fixed lens & this camera is only a few $100 more than a decent 50mm lens for a DSLR. I am not a professional, I don't make a living taking pictures, & I didn't want to spend two grand on a camera. I wanted to spend $400, however you could buy two of these cameras for the price you would pay for one DSLR that takes equal image quality.I am amazed by the image quality, I cannot recommend it more. To get the best review, just search DP2s on Flickr & view the images people are capturing with this tool.", "Date": "November 20, 2010"}, {"Title": "Don't be scared away", "Author": "Santa Ana Amazon", "ReviewID": "R3DA9POUV5CNY4", "Overall": "5.0", "Content": "I read so many reviews complaining about this camera that I almost didn't purchase it.  I had traded in my entry level DSLR in search of a compact that could give decent image quality and bought one of the more expensive point and shoots.  It had all of the bells and whistles and took decent pictures -- but nothing great.  So I returned it and took the plunge on purchasing the DP2S -- mostly because of the quality of the images that I saw from other users online.I've now had the DP2S for two weeks and could not be more pleased.  The quality of the images are the best from any camera I've, and better than the entry level DSLR that I traded in.  The DP2S give a richness in its image quality that is totally unique when compared with other cameras -- no doubt because of the unique construction of the three-layer Foveon sensor.Many reviewers complain that this camera is slow to focus.  That's true, it's not fast, and this certainly would not be a camera for sports photography.  Nevertheless, if you are willing to take a few seconds to set up your shot, this camera will give you some gorgeous shots.  Furthermore, if you're skilled at estimating distance, the manual focus can be faster in certain situations.  I have gotten more complements on the photographs I've taken in the last few weeks than I did on the all the photographs I took in the year previous to this.Also, the camera is fun to use in manual mode.  It has separate buttons for aperture and shutter speed, which makes taking pictures a very tactile experience.  So if you're feeling concerned by the nay-sayer reviews, I suggest ignoring them and giving this camera a try.", "Date": "November 20, 2010"}, {"Title": "An Outstanding Tool For Photography", "Author": "projekt", "ReviewID": "R27EKG8JUBMJHP", "Overall": "5.0", "Content": "Having owned and used the Ricoh GRD 3 and the Leica D-Lux 4, I must say that the Sigma DP2s just shatters what I held high of those two cameras. They are both sensational cameras that are a joy to use and to bring along during your travels.But the SIGMA has out done them, not in terms of design, size or UI friendliness, NO both the GRD 3 & D-LUX4 are strong in those departments, stronger in fact than the DP2s.However, where the DP2s wins, is in image quality and truly the FOVEON sensor is something to admire about SIGMA.Yes, the camera is slow to focus, but there is the manual focus dial to lend a hand. Yes, the LCD is small and cramped; its resolution is of poor quality when compared to the other cameras that I own, but it gets the job done. Yes, the battery life per charge is half that of the other two, but you can always buy an extra battery. Yes, it is bulkier than the other two, but the build quality is beautiful. Yes, there are strange noises coming out of the DP2s as it tries to focus (whether in auto or manual focus, there is always a whine), but strangely, I love it. Yes, it is very poor when it comes to photography in low-light, but I realized that I can use one of the other two cameras that I own for such occasions.This camera has a lot of short comings. I was weighing whether to purchase it or one of the micro 4/3 cameras that are the entire rave. But at the end, I settled with the DP2s. Not because the micro 4/3 cameras are of inferior quality, no. But my uses and photography style was in parallel with what the DP2s had to offer. And honestly, I do not want to fall in the trap of acquiring expensive lenses and accessories that distract from the peaceful hobby of photography. The DP2s is equipped with a prime lens; its focal point was what won it against its sibling the DP1.Anyone deciding to purchase any of the SIGMA DP series should understand that these cameras offer great image quality and pleasure in taking wonderful shots but reached with deliberate decision making when manipulating its controls and patience. It actually teaches you to relax and enjoy photography. And in reality this is what photography should be like, an enjoyment. It is designed for those that enjoy indulging themselves in this mesmerizing hobby.It is NOT for the point and shoot crowd.And the accompanying software that comes with the camera, the SIGMA Photo Pro, is very easy to use and is well suited with the .x3f images of the FOVEON sensor. I enjoy using it.I have attached a few shots taken with the DP2s of my recent trip to Scotland, UK.", "Date": "April 19, 2011"}, {"Title": "It 's not for everybody", "Author": "E. Hung", "ReviewID": "R2JMKJKBDQ1O1T", "Overall": "4.0", "Content": "The Sigma DP2S is a specialty compact camera that can rival my Canon EOS 7D + L lens in terms of image quality. It 's that good, BUT only with lot of light. The camera is SLOW. Focus is SLOW and makes weird noise. It 's like an old man. My wife hated it. Strangers who took pictures for us thought this camera was some kind of a joke. Yeah, BUT wait until you blow up the picture in the monitor screen. For that matter, you have to use RAW and Sigma Photo PRO for conversion and post processing.In terms of ergonomics, the DP2S is not bad at all. It comfortably slips into my hands and draws no attention from anybody. I like the simplistic user interface and it took me no time to learn. I 've found myself carrying it all the time instead of the bulky EOS 7D. It 's perfect for DAY TIME street photography.Don't bother using ISO400 and above. Certain shadows or dark area in the frame may have a magenta cast depending on the camera 's mood, and it 's not easy to get rid of using color and white balance adjustment in Sigma Photo PRO.Also don't buy it new at full price. There are lots of people who got pissed off by Sigma because of the SD1 pricing. They are dumping their Sigma's at deep discount. I got mine from another person who had bought it from Amazon. If you want a compact backup camera for your DSLR without sacrificing image quality, this is the one.", "Date": "July 18, 2011"}, {"Title": "Unique Sensor-But Several Negatives", "Author": "Emoya", "ReviewID": "R14MVAKC73PEN3", "Overall": "4.0", "Content": "The DP2s is a camera with a unique sensor but with antiquated performance and many negatives.Simply put, the camera performs well under good, natural light at low ISO (no more than ISO 400). The camera performs horribly in low light or artificial light. Green and sometimes yellow banding coats the shadows and dark areas like wildfire. A very strange aberration that supposedly is caused by the foveon sensor.So, in low light and/or artificial light it is advised to convert those pictures to B/W to avoid that defect. Although, if you keep the ISO at around 100 there is less aberrations. However, shooting under those conditions, you will probably need a tripod and shoot unmovable objects. This is if you want your pictures in color, if shooting in B/W there no need to worry about the color aberrations. B/W pictures will eliminate the banding and you can probably shoot up to ISO 800.The positives of the camera are in sharpness, and the certain \"look\" the foveon sensor produces. It is true the the DP2s produces DSLR like quality pictures. The auto-focus is slow, but it is reliable. The interface and the menu system is OK too. The screen on the camera is bad. Not up to date with modern cameras. It is also a noisy camera, and it makes a grinding noise when turning on or off, or when focusing. The build of the camera is not terrific; it is OK.In conclusion, the DP2s is somewhat of a one trick pony. It is terrific in good, natural light, and for landscapes or architectural photography. Not so great for street photography or sports.I would recommend this camera for someone who already has a primary camera, and would be purchasing this as a secondary camera. I could not recommend this camera as a primary one; there are simply too many negatives to use this camera in all applications.An Update to the camera...I thought about my 3 star review of the camera and realized it wasn't a fair rating. The problem with rating this camera is that there is no other camera to compare it too. The foveon sensor is unique and therefore cannot be compared to bayer sensor cameras. I have to say that I do like this camera. It is simple and straightforward in it's application. And, so, I upped the rating to a 4 star. The positives and negatives are clearly stated; it is up to the buyer to decide whether a camera with a foveon sensor is worth the investment.", "Date": "November 18, 2013"}, {"Title": "Leica quality at a tenth of the price", "Author": "Brad R \"Brad R\"", "ReviewID": "R3F02NO2LJS2VS", "Overall": "5.0", "Content": "Long story short I have had a DP2 for about four years now. A week ago died and decided to fork $1k for the Merrill version. Great camera but the contrast was way too strong for my taste. I really couldn't stand that camera and retuned it to Adorama after only two days.Decided to buy a DP2X but Amazon Warehouse just listed a DP2S in like new condition for $300. Took the chance (though I was looking for the X version) and ordered it. I love it. Just like the DP2 and then some extras, like the missing focusing noise (more like grinding) from my old DP2.For people looking for neutral colors, DP2, DP2S and DP2X seem to be the best. I wanted to like the Meriill version but unfortunately the high contrast and over saturated images are not my style.", "Date": "January 8, 2013"}, {"Title": "Ruins other cameras", "Author": "gvondassow", "ReviewID": "R1HUATIX5GTCRR", "Overall": "5.0", "Content": "This review is written after several months and thousands of photos with the Sigma DP2s in a wide variety of scenes.Images created by this camera, when the focus is correct and light is sufficient, are very hard to find flaws in.  Every hair or grass blade can be sharp and distinct.  The separated red, green, and blue channels are equally sharp, unlike any other single-chip camera.  It's a revelation, and it simply ruins all other compact digital cameras in comparison.  The DP2s isn't suitable for everything - can't use it for close-ups, for example, and obviously no zoom - but it is terrific for everything from portraits to landscapes, as long as one accepts a fixed angle of view.The lens is very sharp at 2.8, whether close or far, but not as sharp at 8 or above.  The autofocus can be tricky, but it is accurate.  It is too slow for action photos.  For example, one can't easily take a snapshot of something while walking past it.The camera interface is straightforward.  I had no trouble figuring out all the controls that I needed.Underexposed images do not look good and often cannot be salvaged.  For reasons I haven't quite figured out, some tones drop out before others, such that underexposed pictures have a solarized look.  This means that in low-light scenes it is not practical to avoid using the flash by using a too-short exposure and instead.  For low-light scenes, the high-ISO modes are reasonably useful; although they are quite noisy, the noise suppression is good enough that it works for snapshots.Potential buyers should know that with this camera it seems pointless to work with JPEG files; all its real virtues require saving in X3F format, which in turn requires Sigma Photo Pro to open, adjust, then export images.  This is unfortunate; Sigma Photo Pro is a bit slow, and it's not exactly feature-rich, which means that to do anything else with the pictures besides adjust contrast and so forth, one has to export a separate version and edit in another program.The accessory close-up lens seems worthless: it approximately halves the minimum field of view, and simultaneously halves the resolution.  Fortunately it's cheap, but crop is cheaper.But whatever the minuses - no zoom, no action photos, no macro, tricky for low-light, etc. - they are easily outweighed by the stunning image quality on the kinds of scenes it's good at.", "Date": "July 4, 2011"}, {"Title": "Sent a bad product and no apology, not impressed by the company, the product I got elsewhere and it is fine.", "Author": "Frank C. Ewing", "ReviewID": "R3A24NF2AKWKZW", "Overall": "2.0", "Content": "I was sent a defective unit, sent it back with an explanation and that I had talked to the factory folks. Not even the courtesy of a reply...Did purchase one from the company at Sigma, reconditioned by them for the same price roughly....it works.", "Date": "November 24, 2013"}, {"Title": "great camera", "Author": "janice thompson", "ReviewID": "R81F34CUJQ03Y", "Overall": "5.0", "Content": "I love this small camera.  I especially like that you can take 3 shots at different exposures and the convert to HDR.  Just don't buy the external viewfinder.  You can see thru it just fine, but it doesn't show focus so you have to look at the screen anyway if you are trying to manual focus.  The photos that happen with this camera are wonderful.the photo", "Date": "July 8, 2012"}, {"Title": "Has no peer", "Author": "Killzen", "ReviewID": "R3TSFCQ7A8ASUG", "Overall": "5.0", "Content": "I will skip all the technical points, etc...this is a beauty...not a toy...simplicity encapsulated in one small package..I bought this with a dose of skepticism, after considering DSLR'S, just on the concept of the sensor itself, thinking it might not live up to expectations and that I could return it and buy that DSLR. No way. This small package is an incredible piece of engineering...the color is amazing...the fact that it has a fixed focus lens is a plus, as it makes you 'think' the shot and the resolution from the lens is incredible...the colors are incredible...but again, this is NOT a point and shoot...this is an artist's camera, a piece of professional equipment which you will not regret buying...a caveat: shoot in RAW mode...once you load the files into a good software editing program you will know why...and the controls are convenient, the major functions are at your fingertips and the clutter common to other digitals has been simplified, and yet, you have total control over the creation of the photograph...do I have any complaints?...none that would make me send this beauty back...", "Date": "January 1, 2012"}, {"Title": "Like a woman...", "Author": "Trevor Goodchild", "ReviewID": "R127CL2H8A4H3S", "Overall": "4.0", "Content": "This camera is difficult, temperamental, terse, frustrating at times, but rewarding once you master it.Seriously this camera is not for candid shots and not for low light (think 5/sec exposures).  BUT, you can take some incredible pictures with a steady hand and a subject which is sitting still.If they could add an IS system and zoom this would be the perfect camera.", "Date": "December 24, 2010"}, {"Title": "Could have been so much better", "Author": "dan l rolle \"tuckerjade\"", "ReviewID": "R17SAUSKDKWM2A", "Overall": "2.0", "Content": "I bought this camera after reading several reviews.  I wanted a small (feature packed) camera that had manual controls.  Here are some of my short thoughts on this camera and why I have rated it the way that I have.Form Factor:  The camera is unquestionably small.  The lens, despite being a fixed focal length extends out from the camera upon power on.  This adds an unnecessary atheistic twitch that really takes away from the look of the camera.  It would have been nice to have a fixed length, non-retractible lens similar to the X100 or some of the primes on other brands like Olympus.  The camera does not match its competitors (price point) when it comes to design.  It feels very much like a toy camera and one that should cost about $150 instead of $600.Image Quality:  The camera takes good images at ISO 100-200. Above that I found the images to be just not usable.  Grain above 800 was completely horrible and no level of post processing could resolve it.  Other cameras with this size sensor blow this camera out of the water.  The lens is not high-quality, and I was disappointed by the level of chromatic aberration.If this camera was $200 I would have given it 4 stars, but the price does not meet the quality.", "Date": "January 12, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003AMMZRG"}}