{"Reviews": [{"Title": "Exilim EX-S200", "Author": "Richie E. \"Richard E.\"", "ReviewID": "R15UY4C9H94P4D", "Overall": "4.0", "Content": "A nice and slim little pocket camera. I bought this to replace an older camera I have had for years. It was 3MP. The software that came in the package was useless. The only feature you could download was to upload videos to youtube. My copy did not work. You will have to download the user manual from the Casio website to figure out the features of this camera. Still learning but so far so good. I also like the Orange color.", "Date": "December 29, 2010"}, {"Title": "Easy to use", "Author": "glenn kringle", "ReviewID": "R3VXGVE383BMAN", "Overall": "4.0", "Content": "Easy to use and takes movies and stills with easy and great quality for an inexpensive camera hold a charge a long time and fits in your pocket", "Date": "December 11, 2012"}, {"Title": "Great Service", "Author": "F", "ReviewID": "R16JQQ4NLGFKXK", "Overall": "4.0", "Content": "Got this as a gift for as friend. She loves the camera and the service was great. I got the I item about two days later after ordering", "Date": "June 10, 2011"}, {"Title": "Not an intuitive camera, have to remove battery from camera to charge it", "Author": "Sweetest", "ReviewID": "R3QWV373MOBXV4", "Overall": "1.0", "Content": "I did not care for this camera.  The shutter button is very difficult to push due to the small camera size and the slick body.  Often the camera would slip down while I was clicking a picture, causing a blurry picture.  Also you have to take the battery out of the camera to charge it.  I prefer a camera that has a charging dock or cord that you can hook into the camera without actually removing the battery.  I keep my camera charging when I'm not using it, so its always charged and ready to go.  I've never had a need for a second battery for my digital cameras, but with this camera it would be essential.  The battery life also seems very short.  After a full charge, I took 7 or 8 pictures, let the camera sit for a couple of days and the next time I used it the camera refused to work after about 6 or 7 pictures.  I was at the Grand Canyon and the only camera we had with us was dead!I did not find the camera to be very intuitive to figure out and the manual is not very well written.  There was a multi-step process involved in uploading the pictures from my card.  I was never actually able to upload the pictures from the camera, because I couldn't figure out how to open the door on the camera to connect the USB cord!  The manual was no help and I didn't want to force the door open because I had already decided to return the camera.  It shouldn't be that complicated to upload pictures.  I ended up putting the card into my old camera and uploaded them using that camera's one step process!On top of all that the pictures, which were mostly outside were just OK.  I expect less than stellar pictures inside with a smaller camera, but I've never had trouble  getting decent pictures outside with a decent compact camera (which I expected this camera to be, for the price I paid).I decided to go with the Nikon Coolpix S6000 14 MP Digital Camera with 7x Optical Vibration Reduction (VR) Zoom and 2.7-Inch LCD (Red)  and it is perfect!  It is a bit larger, but it has a good feel and I have no problems with the shutter button.  I was able to figure out all the basic functionality without the manual (including uploading the pictures).  The battery charges in the camera and the pictures I have taken already are very crisp... even the inside shots!  For a smaller price, this is a very similar but better performing camera!", "Date": "October 22, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "New slim-line body design in exciting & fun colors with simplified rear button interface\nImage Stabilization\nPremium Auto Mode\nHD MovieSpecifications\nImage Sensor - 1/2.3-inch square pixel CCD / Total Pixels - 14.48 megapixels (/million)", "Name": "Casio EX-S200EO 14.1MP Digital Camera with 4x Optical Image Stabilized Zoom with 2.7 inch TFT LCD (Orange)", "ImgURL": "http://ecx.images-amazon.com/images/I/51nbno6eDNL._SY300_.jpg", "ProductID": "B003Y74AES"}}