{"Reviews": [{"Title": "After one (sunny)  day, totally happy with the Sony A290", "Author": "mack77", "ReviewID": "R2XYOK40ODZX8A", "Overall": "4.0", "Content": "Took my new A290 to the local park/aircraft museum & got really great photos with everything set to standard.  A tree with grey/green foliage, came out looking 100% natural, where other cameras have not looked so good.  Green grass looked perfect.  Metering excellent, and white balance looked great when the white balance was left at auto.This might have the same sensor as the Sony A380, but I think Sony have subtly tweaked the settings for jpegs as they look fantastic.I used to have a Nikon D40, & while it took fantastic photos, the menu system was infuriating compared to the A290.Other comments:1.  Battery needs to be charged for about 4 hours in total (including an hour *after* the charging light goes out.)2.  18-55 kit lens zoom action can feel a little stiff when brand new. (Not too uncommon with budget lenses)This lens is pretty good according to the experts though.  And much sharper than the old 18-70 Sony kit lens.3.  The camera strap is fine, but not easy to thread through on one side.  But I always have trouble with these!4.  ISO 1600 shots taken indoors show faint noise.  (Prob. about the same as a Nikon D3000 worse than Canon 1000D/Rebel XS.)  However, the A290 has far less noisy high ISO pictures than any compact with a small sensor.5.  The eye detection sensors that switch off the display are a nice feature.6.  Nice to hold having a rubberised finish.8.  Great value for the money!!9.  I've really enjoyed my first outing with this camera.  A lot of fun to use.Re. Battery life.  Battery life can be hugely improved if the 'Eye Detect Autofocus' function is turned off.With this turned on the A290 seems to be continually trying to focus.Also turn of the 2 second review display after each photo.With these two functions turned off I got 346 photos with the battery still showing 3/4 full charge.  Temp. wasaround 20 degrees C & included a bit of reviewing of photos but not much.The automatic eye detect function still works & turns off the display when you raise the camera to your eye.", "Date": "December 30, 2010"}, {"Title": "An excellent camera for the amateur wildlife photographer", "Author": "Kharan", "ReviewID": "R18YG0J90XQKJ8", "Overall": "4.0", "Content": "I bought my Sony A290 five months ago, and I've been using it regularly since. For starters, it must be said it's really easy to handle for most things. The usual complaint I've read about the grip being too small for large hands seems to be unfounded - sure, you don't have a lot of legroom, but compared to a superzoom like the Panasonic FZ38 or the Fuji S1800, the Alpha has more than enough to spare. And the camera's as light as a feather, even when compared to a Rebel XTi, much less an EOS or a D40. Which, it must be said, makes it great to take quick shots (you can for instance sling it to capture a passing bird, whereas I'd be afraid to do as much with a heavier DSLR). Still, it's not that light, and so not really suited to one-handed shooting unless you have excellent pulse.How's the basics? The pictures have great quality, and capture faithfully what the eye sees. Depth of field, at narrow apertures, is quite good, and the 18mm setting of the lens is a monster for landscapes. Speaking of the kit lens, it has almost no bokeh except when stressed to great lengths, so keep that in mind if you're thinking of portraiture (but when it does come out, it's quite pleasing). On the other hand, pictures of moving subjects are this camera's and lens' strongest point; the SteadyShot function can correct gross shake, but keep in mind it's slow to recharge! This is not necessarily bad, as you can, for instance, take four frames in a sequence - let's say of a passing car: the first will be very sharp, while the two next ones will exhibit amazing panning, and the fourth will be stable again. Also, the SteadyShot function is built into the camera, so you can use it with older lenses (this is a HUGE benefit). By the way, if you're looking for a camera to use always on full auto, then I'd recommend you to get something else, as it doesn't have the brains to produce good results except in fairly normal conditions (the auto-focus is especially lame).Why the four stars? Well, I have a few gripes with the A290. The first and most blatant is NOISE. This is NOT a camera for low-light exposures, due to a combination of noisy images, terrible quality at higher ISO, and a flash that I swear consumes like 10% of the battery each time it's used! If you want mostly daylight pics, like me, then you'll find it to be excellent quality for the money. But otherwise, it might be wise to invest in another device. The second one is the method to change aperture on full-manual (I only use this mode, BTW, so it might not apply to you) - it requires one to press the AV button, which is awkwardly located, and can cause mistakes even after months of practice. The third one is the menu; while very user-friendly, it's sometimes a tad too simple. Not that I use it too much, but still. Also, the camera doesn't revert to instantaneous shooting after shooting with the timer, which will cause you some mild annoyance. Finally, the focusing ring is sloppy and a bit imprecise - but this is a problem of the kit lens, after all.The good things? Well, it's the cheapest DSLR in the market, I think. It has no superfluous or otherwise gizmo-like functions to interfere with shooting. The few it has are well-accomplished and useful (shooting B&W; with the Alpha is simply wonderful!). It's fast, light, and very simple to wield. For nature and wildlife photography, the colors and sharpness that it achieves are stupendous, a step above any compact. The full-manual mode is very intuitive and can be mastered in a few days. It's automatic white balance is excellent. And the batteries last quite a while, as long as you don't use it's interrogation device... err, flash (it's quite powerful). In this regard, and perhaps better, it consumes almost no power when left on and in standby (I once left mine two days in this state, and it still had some power left!) so you can keep it always ready to shoot.The veredict? The Sony Alpha 290 is an excellent camera for those seriously interested in photography, but are just starting, and also for those who want the quality and capabilities of a DSLR at a reduced price. I'd especially recommend it to wildlife and nature enthusiasts - as long as you don't require low-light pictures, or extreme zoom, then it'll do nicely for you. The Sony lenses are good, and growing in availability, so this is a waning concern. Also, a lot of accessories are popping out for the Alpha range. As a camera to learn the ins and outs of manual, SLR photography, you'd be hard-pressed to find one as user-friendly and cheap as this one. All in all, I'm very satisfied with my purchase, and I wouldn't hesitate to recommend this camera to someone else, nor would I doubt to purchase another Alpha range DSLR.", "Date": "March 6, 2011"}, {"Title": "Happily surprised", "Author": "daloaiza", "ReviewID": "R2RWV7TRYR5VMY", "Overall": "5.0", "Content": "Like the others who bought this camera, I was somewhat skeptical about buying it. Two things convinced me: the price of course and the fact after some research (and this really should be mentioned louder) I found out that the lens mount is the same as the Minolta and Konica-Minolta lenses, so you can use your old AF lenses (I had a Minolta film SLR with a 28-80mm and a 75-300mm lenses). So when I bought it, I already had a three-lens set.I used it first around New Year's in NY and it literally weathered the storm. I found it to be really friendly to use, light, confortable (yes, you have to turn off the 'Eye Detect Autofocus' function for yours and your battery's sake) and with very sharp images as a result.I haven't used the presets much, since I like to keep things more manual, but when I was really surprised was three weekends ago, when a friend asked me to shoot a band's gig to use in a video he was making: because of the low light and basic lens, I had to take it up to ISO 1600 and expected very noisy pics, which wasn't the case at all.You can see my three favorite (I went home with more than 300 pics that night) in [...] as well as a couple more I've uploaded with this camera.If you're getting your first DSLR, this is a very good option to consider.Enjoy!", "Date": "March 1, 2011"}, {"Title": "Great Camera Best Bang for the Buck", "Author": "Pat", "ReviewID": "R7ABY84C815DY", "Overall": "5.0", "Content": "The product aside from a well respected brand is truly a great product. It performs as described and the construct is well done it is not cheaply made.  The price is on sale so overall a very good deal. The seller delivered pretty quickly.", "Date": "May 18, 2011"}, {"Title": "Excellent camera", "Author": "Pablo O", "ReviewID": "R32J6MABV0TEOB", "Overall": "5.0", "Content": "Well i wasn't that sure of buying a Sony alpha camera, but for the price i was tempted, i can't be more happy for buying it... an excellent camera, great and sharp image, really easy to use.", "Date": "February 4, 2011"}, {"Title": "Tha camera arrived as shown in the advertisment, but has a defective lens, which will cost more that the camera to replace.", "Author": "James Carbary", "ReviewID": "R1CNM9XWBUXHAB", "Overall": "2.0", "Content": "The camera functions like it is supposed to, and without problems.Unfortunately, the lens that came with the camera is defective and worn out, and it refuses to focus properly.The lens was obviously severely abused and not taken care of properly. The electrical contacts on the lens are completely wornout from removing the lens too many times without keeping the electrical contacts properly lubribcated. Metal particles from the worn out electrical contacts have entered the internal workings of the lens and caused the internal gears and motor to wear out and malfunction as well.The auto focus will not work properly because it appears the gears that lock the auto focus motor inside to the lens elements are worn out or stripped out. The lens also has dust or metal particles trapped inside between the internal lense elements. There is no way to clean the dust out of internals in the lens because the lens would need to be disassembled to clean it, which is impossible to do without breaking it or further damaging it.Overall, I would have purchased a brand new camera with the money that I paid for the high prriced used camera that I purchased from amazon. The quality and value were very poor for the high price that I paid for the camera, and I would have been better off spending my money on a new camera that works properly and comes with a facory warranty.", "Date": "September 22, 2013"}, {"Title": "Frequent use since Christmas of 2010", "Author": "Candi Parker", "ReviewID": "R2VVYCJJXOAYOB", "Overall": "4.0", "Content": "Now we're halfway through 2013 and the camera is still working perfectly. I often use it to shoot artwork, which I usually do in full sun. It is not a great camera for low-light photography and the flash does not improve things. The video feature is reliable, but the sound quality is poor. For the price, this camera has served me very well.", "Date": "June 21, 2013"}, {"Title": "Perfect", "Author": "momofmany", "ReviewID": "RSBV5TN2UL4I", "Overall": "4.0", "Content": "My daughter uses this camera to take all of her school pictures. She is getting very good at all of the workings.", "Date": "May 6, 2013"}, {"Title": "Sony A290 Review", "Author": "Shannon Z", "ReviewID": "RSUWTJETD1VDN", "Overall": "4.0", "Content": "The main reason I got this camera was because it was a lot cheaper than most other DSLRs.  I had never had a Digital camera before and this camera's features were super easy to use and the cameras help guide is very useful and thorough, they also use simple terms to break it down easier for beginners.  One of my favorite things about this camera is that Sony sort of aimed it at beginners and really simplified the features.  The A290 also offers a number of specific scene modes like for action shots, scenic shots, or night shots so it is really easy to use which is why I really enjoy this camera.", "Date": "February 8, 2013"}, {"Title": "Maybe I got a lemon?", "Author": "T. Craw", "ReviewID": "R1DDSG465Z1QP4", "Overall": "1.0", "Content": "I bought this camera in May of 2011, and was so excited to venture into the world of DSLR photography.  The first month was bliss, and I thought the camera was awesome, since all I had to compare it to were a string of film and digital point-n-shoots.  In July of 2011 we took our family vacation and on the first day of that vacation my a290 stopped working.  It would turn on, but wouldn't auto focus and none of the menu buttons would work.I shipped it immediately to Sony for repair. They sent it back with a note saying nothing was wrong with the camera. WHAT!?! So, I pulled it out of the box, and turned it on. Sure enough, the auto focus and menu buttons were once again working.  BUT, now the camera never would get a sharp focus.  No matter what lens I used, the focus was always soft. I sent it back to Sony two more times with this issue, each time they told me nothing was wrong. My warranty has now run out, and I'm stuck with a DSLR that won't focus correctly. Thanks a lot Sony!Oh, and the battery life is nonexistent! You can spend a few hours shooting, and have to recharge.  It's the worst.I wouldn't recommend this camera to anyone.", "Date": "August 8, 2012"}, {"Title": "best for begining", "Author": "johnnyg", "ReviewID": "R23O1JDINRO732", "Overall": "5.0", "Content": "i needed an slr for my photography class and i learned so much and the prices here are so great and save me a large amount of money. i have always used sony and i always will.", "Date": "July 6, 2011"}, {"Title": "Buy This Camera!", "Author": "JohnnnRe", "ReviewID": "R3UETK8JBPKIX3", "Overall": "5.0", "Content": "I have heard bad things about this camera since it first came out, just ignore what other people are saying and get it. This is the best camera I've ever gotten. I LOVE it!", "Date": "October 19, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "SteadyShot INSIDE in-camera image stabilization\n14.2 MP resolution for ultra-fine detail\nSmallest, lightest alpha DSLR series body for improved handling\nIntegrated on-screen Help Guide for easy operation\nGraphic Display lets you visualize camera settings", "Name": "Sony Alpha A290L 14.2 MP Digital SLR Camera with 18-55mm Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/51DNeSQRu5L._SY300_.jpg", "ProductID": "B003VWDSJO"}}