{"Reviews": [{"Title": "Surprisingly Good", "Author": "JMH", "ReviewID": "R3BEBB60U1V25P", "Overall": "4.0", "Content": "Very convenient shirt-pocket camera that produces pleasing images.  Versatile and plenty of features for such a small package.  Good enough to substitute for a Super Zoom on a casual day trip.  Bought the camera while on vacation in the Caribbean, and never pulled out the D-SLR again.  Good video, not bad indoors and in low light, and nice iA feature for immediate situations.  Would like a bit more than the 5x zoom, but otherwise would buy it again.", "Date": "April 30, 2010"}, {"Title": "Great little camera!", "Author": "Dan \"Dan\"", "ReviewID": "R3AEVZ7TDIWIAP", "Overall": "4.0", "Content": "I needed a good knock around camera to take with me for just snapping pics and to keep in my bag. This fits the bill perfectly. good zoom range, fast lens for low light shooting, fast response and can take rapid shots. This ia a good little camera!The images are clean and crisp and at 14 MP I can blow them up to a decent size.", "Date": "April 5, 2011"}, {"Title": "LCD Screen is poor-Dont buy it", "Author": "JBJ", "ReviewID": "R64LOZU07P5PB", "Overall": "1.0", "Content": "I purchased the Lumix for a point & shoot camera and it works well for that.  However the LCD screen is defective and shows white vertical bars anytime there is a bright light in thet field of view (Ie Sun, Lights).  I sent the camera back to Panasonic and got an immediate replacement with no quibbling.  The replacement unit does exactly the same thing.The problem is annoying.  Don't buy the camera till they fix it.  A little research online gave me the impression this is a pervasive problem on this camera series.", "Date": "July 20, 2011"}, {"Title": "I just want my FS20 back", "Author": "David and Lindsay Dreher", "ReviewID": "R11GMX7ZMXWSG4", "Overall": "2.0", "Content": "Bought this as a replacement for a DMC-FS20 (no longer manufactured by Panasonic). Boy am I disappointed.It was like the image stabilization didn't work in this camera! The photos were almost ALL blurry. I don't use the zoom, so that isn't a factor here. Also, the text on the menu/set button has begun to wear off after only 2 days of gentle use.", "Date": "October 4, 2010"}, {"Title": "It's so awesome!!!", "Author": "fun goats", "ReviewID": "R1Q87TBZWL204", "Overall": "5.0", "Content": "This camera was so easy to use.  I didn't have to read the directions.  My brother plays hockey, so I wanted a camera that would be good for a fast sport.  It worked great.  The battery has a great life time.  I was really impressed with the quality and easy to understand about this camera.", "Date": "March 5, 2011"}, {"Title": "I AM TRULY SATISFIED", "Author": "Stephanie D.", "ReviewID": "R134PLK8VGM8DK", "Overall": "5.0", "Content": "I LOVE LOVE LOVE this camera. I got it on time and when I opened the box I was happy with my choice color (black) I brought this camera after searching for a really good one to meet my expectations which include great pictures even in the dark. I tested this by turning off my lights and taking a random photo it came out pretty clear so I'm very satisfied with that. I also wanted crisp photos as well as non blurry photos on action photos. When I say action I mean  my two children in action. I had them jump around and run while taking pictures and they came out great no blurriness, and it caught some really great photos of my daughter while in the air. There are other features like aerial and candle light that I'm excited to try out. All in all this is a GREAT camera. Highly recommended.", "Date": "February 16, 2011"}, {"Title": "Work horse in a pony.", "Author": "art college professor", "ReviewID": "R2U3SCRYVVQAAG", "Overall": "5.0", "Content": "I received the FH3 for a present more than three years ago. I love the Lumix lens and the photos/video/settings/screen/zoom. Terrific. Great travel camera.", "Date": "June 18, 2012"}, {"Title": "great little camers", "Author": "doris", "ReviewID": "R1G5H5TDND54HU", "Overall": "4.0", "Content": "I enjoy this camera very much...easy to use and takes great photos.  Maybe the only downside for me was the zoom feature.  I could use a higher zoom option, but overall a great purchase", "Date": "August 29, 2011"}, {"Title": "Very Poor Warranty Return/Exchange Policy", "Author": "Bryan in PHX", "ReviewID": "R37QWM11UIJNO1", "Overall": "4.0", "Content": "Update: Panasonic CS called me wanting to correct the mistake and replace the Pink camera for a Black model. I must credit them for stepping up. I had already purchased a new camera and the Pink model is already planned as a gift.Very Poor Warranty Return/Exchange PolicyI am looking to replace a DMC-FH3 with another model.But hesitant to purchase another Panasonic camera after my recent exchange experience.Overall I have always been satisfied with Panasonic products up until my recent camera exchange.Panasonic has a very poor exchange policy. You get a Refurbished Camera, Not necessarily the same model or color. You also pay for freight to ship it to Texas.--------------Panasonic Product Exchange Notice --------------In accordance with your model's warranty coverage, your product will be exchanged instead of repaired. The exchange model will vary depending on availability, and will be of the same, similar, or comparable model in a factory remanufactured condition. Color match is not guaranteed, and will depend on availability.My DMC-FH3K broke after just a few months. The lens would no longer retract fully into the camera body the majority of the time, and had to be coaxed by repeatedly turning on and off.I sent my Black camera into the Panasonic McAllen TX Exchange Center and received back a Refurbished Pink DMC-FH3P (as in Pink) camera. Seriously, a Pink camera to replace a Black model???I had even sent a cover letter with Bold Type stating \"Please replace with another Black (in color) model camera\", which they ignored, or perhaps sent Pink as a sick joke.On the Plus side. I now have a Refurbished Pink camera to give as a graduation present to a young niece.But now I need to purchase a new camera.", "Date": "April 30, 2011"}, {"Title": "Great point and shoot camera", "Author": "Phillip Frink", "ReviewID": "RWCJ7AXO1U8CE", "Overall": "5.0", "Content": "When I was looking for a camera that I could cary around, not be cumbersome and would be priced not to break the bank. This fit the bill. I am a photographer and it is hard to always have my big camera with me. Especially when I just want candid shots of my kids. This camera is perfect for what I want it to do. I am not looking to print anything bigger than 11x14, the resolution is good enough for that. The camera is easy to use and the quality is good. I have had the camera for a few months now and have had no issues with it. I would suggest this camera if you are looking for a easy to use camera with good quality photos.", "Date": "March 27, 2011"}], "ProductInfo": {"Price": "$159.95", "Features": "14.1 Megapixels\nOptical Zoom 5x / Digital Zoom 4x Focal Length f=5-25mm (28-140mm in 35mm equiv.) // Extra Optical Zoom (EZ) 5.9x (4 - 3 / 10M), 8.4x (4 - 3 / 5M), 10.5x (under 3M)\nLens LUMIX DC VARIO\nOptical Image Stabilizer 2 MEGA O.I.S. (Off / Auto / Mode1 / Mode2) Photo & Movie modes\nAF Metering Face / 9 pt/ 1pt; Focus Normal / Macro, Zoom Macro, Quick AF (Always On)", "Name": "Panasonic Lumix DMC-FH3 14.1 MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.7-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/513yRMocqkL._SY300_.jpg", "ProductID": "B00395WIA8"}}