{"Reviews": [{"Title": "Solid Camera", "Author": "GeoUtah", "ReviewID": "R2WX0LZB02A8Q4", "Overall": "5.0", "Content": "This is a great little machine. Very pleased with image quality, very stable, well made camera. Good value for the price. I had a Nikon Coolpix I purchased for a Grand Canyon vacation. It randomly turned itself off and shut down after less than 2 days of use.No such problems with the Olympus Stylus 7030 14 MP. Zoom not blurry and resolution excellent.", "Date": "February 28, 2011"}, {"Title": "Not impressed at first but more positive now...", "Author": "J. Gustafson", "ReviewID": "RHFH3AXNKR920", "Overall": "3.0", "Content": "Bought this on sale...I have a DSLR Camera and my wife has a very nice Sony point and shoot I bought her for x-mas.  I wanted something small to take with me on excursions...I didn't expect much.  I didn't even get what I was expecting.  The camera has issues determining what you are intending to shoot...so what you want to be in focus is often out of focus while the background or foreground is clear.  The flash tends to wash out items that are withing 6 feet.  There is dust inside the lens...not sure how I am going to get that cleaned.  Since I have only had the camera a week there is a VERY high potential that this camera is going to be returned.  I am very disappointed, expected more from an Olympus camera.Added 10.22.11  Unfortunately I wasn't able to return the camera...shouldn't have dragged my feet.  About 3 weeks after purchase it developed a region of dead pixels, I haven't used the camera since, mostly because I wasn't too happy with the images coming out of it.  I took it out to take some daylight pictures of and the dead pixel area had grown from the size of about 3MM to 20MM.  Have since dropped teh review from 2 stars to 1 star.  I very strongly recomend that indivduals look elsewhere for there camera needs...I have nothing positive to say about this camera.Added 11.25.12  The pixel situation cleared itself up about a month after I updated the review.  I have no dead pixels right now.  I don't use the camera often but the battery life is fantastic for when I do use it.  Picture quality is still OK.  I expected point and shoot right out of the box, after playing with some settings the picture quality and focussing improved.  I just can't trust the auto settings as they tend to mess up the picture quality again.  I do not have the auto setting issues on my DSLR or my wife's camera.  All in all not a bad camera provided you are willing to manage the settings yourself.", "Date": "September 25, 2011"}, {"Title": "GREAT camera for the price!", "Author": "TJ", "ReviewID": "R3C8QPI8V08Q0M", "Overall": "4.0", "Content": "For the price, you can't beat this camera.  Very user friendly and takes very clear, crisp pictures.  The ONLY negative that I have found with this camera is the shutter speed.  It's not the best if you're trying to catch your daughter scoring a goal at soccer.  Great buy...very happy.", "Date": "September 20, 2011"}, {"Title": "good camera", "Author": "Amazon Customer \"wiifit addict\"", "ReviewID": "R3K57WL6DJFW0B", "Overall": "5.0", "Content": "This camera works very well for my needs.  Took to the mountains for Fall foilage and got some excellent pictures.  Also did great zooming in on the football field at a college game.", "Date": "October 30, 2010"}, {"Title": "Great Little Camera", "Author": "mjd001", "ReviewID": "R3C4D01M6SQFTF", "Overall": "5.0", "Content": "I love this camera.  my brother - a professional photographer - was impressed with the features vs the price.  My husband thinks the pictures are great.  Easy to use and the software has a lot of nice features.  The software does take time to dowload before you can upload your pics but that it has been easy since.  Totally worth the $$$$$$!", "Date": "November 12, 2011"}, {"Title": "Great Camera - Many Features", "Author": "Linda K. Vanlerberg \"Linda\"", "ReviewID": "R19W6NYXCS929U", "Overall": "5.0", "Content": "I really like Olympus Cameras. This is my third point and shoot Olympus.  This is one has the most features by far, and I am still trying to understand them.  My main reason for buying this is selling online and posting pictures. It does a great job for that.  The other special features this camera has are really cool, and one of these days I will use, or my 16 yr. old daughter will show me how.", "Date": "October 27, 2011"}, {"Title": "Overall... Happy!", "Author": "homesweethome57", "ReviewID": "R2B1NXIB76GCP5", "Overall": "5.0", "Content": "No complaints on this one - easy to use right out of the box and simple to edit after the fact!", "Date": "August 30, 2011"}, {"Title": "GREAT CAMERA!", "Author": "Michael D. Cole", "ReviewID": "RNDOVLWUNSM8T", "Overall": "5.0", "Content": "Had a Stylus 7030 and gave it to our granddaughter for her summer trip to Europe.  She loved it.  Takes great photos.  Bought this as a replacement because it's been such a great camera.  ZeeMo had the best value on the web and delivered very promptly.  Very satisfied.", "Date": "July 16, 2011"}, {"Title": "Great PIctures", "Author": "J. J. Scott", "ReviewID": "RDVNALPBOQWA5", "Overall": "4.0", "Content": "I loved this camera. I bought this to replace an 8 year old 4mp Olympus that just wouldn't die. I ended up giving it to my niece who is still using it! That camera sold me on Olympus cameras for life. Anyway, so I bought this camera and have been really happy with it. It is now on rice though since a birthday swimming party that got a little wild. Too much splashing and the camera ended up getting water in the lens. I looked at water proof cameras but no great reviews so I decided to replace my new camera with the exact same one, just different color. It was not a flaw of the camera that (potentially) killed it, just user error. I'm still holding out hope that putting it on rice will eventually resurrect it. If it does, then I'll just have 2 great cameras.", "Date": "January 19, 2012"}, {"Title": "Durable", "Author": "Maddy", "ReviewID": "R2E9S3UPEY6MT7", "Overall": "4.0", "Content": "I ordered this camera a few months back to take quick pictures without lugging around a big professional one. A few nights ago I realized when doing some laundry my camera had been washed. I put it rice overnight and then next morning put in the batteries and it worked just as it had before. After having camera's that died after dropping them in shallow puddles, this was shocking. This camera is super tough.", "Date": "January 7, 2012"}, {"Title": "Great little camera", "Author": "N. Greif \"N Greif\"", "ReviewID": "R3QYVKKTDFS35T", "Overall": "4.0", "Content": "Took this on vacation with very little information on how to use but it was a matter of checking out the boxes on the right, charging up the battery and shoot pictures.  I still need to check out putting them on the computer but my sister said it was very easy.  Cannot give it a 5 star rating due to not completely using all the basic stuff but would definitely recommend. It was what I was looking for, small, compact & easy to shoot pictures.", "Date": "November 17, 2010"}, {"Title": "Sorry Camera and ever worse customer service.", "Author": "MLS", "ReviewID": "R39SJ6MZHXD9SJ", "Overall": "1.0", "Content": "I got this camera after taking pictures discivered that I couldn't import the pictures to my computer. After calls to olympus they said either the camera was bad or the usb cable. They offered me a USB cable for $30.00. Which I declined since it should be under warranty. They then told me to sent the camera and cable to them, which cost me $15.00 out of my pocket. I will never buy another olympus product if this is the way they stand behind their products.", "Date": "April 12, 2011"}, {"Title": "Great camera", "Author": "nisha", "ReviewID": "R34KQACFAUHSVQ", "Overall": "5.0", "Content": "Great camera has lasted me almost 2 years now. The only issue is that it is starting to turn off on its own and the door to the lens wont open all the way, but still take great pictures. Thinking about giving it to my son that needs a camera.", "Date": "January 30, 2014"}, {"Title": "This is our second one!", "Author": "Tanya Lawson \"MovieBuff\"", "ReviewID": "R30RXCASOYINE9", "Overall": "5.0", "Content": "We bought this camera for the \"first\" time about 3 1/2 years ago and LOVED IT! However, about 18 months ago, the screen cracked somehow (NO idea how.....was never dropped), and when we had it looked at to be fixed, it would have cost $149! So, we started looking around for a new simple camera. We could never find one that had all the features we loved so much on this one, without the $300 price tag. What did we do? We bought another Olympus Stylus 7030 :)  No screen problems since!", "Date": "June 14, 2013"}, {"Title": "Great Camera", "Author": "Pamela L. Smith \"Wheaten Mom\"", "ReviewID": "R1I65MPXXMNUIP", "Overall": "5.0", "Content": "This is a great grab and go camera - didn't like that you have to purchase the instruction booklet separately.  I guess that is one way to keep the initial cost of the camera down!  Anyway, it does way more than I need it to!  Great value.", "Date": "September 19, 2012"}, {"Title": "Goes downhill quickly", "Author": "mkmeissner", "ReviewID": "RNV7SJ0EDNUSK", "Overall": "2.0", "Content": "At first the pictures on this camera were really good, but I didn't use it much because of how slow it was. I started using it again on a regular basis and not only has the picture quality gone downhill, but now the lens won't even come out. It started struggling at first, now it just won't come out. It tries but then the camera just turns off. It's still under warranty so we'll see how that goes...", "Date": "June 13, 2012"}, {"Title": "Great camera", "Author": "Ron", "ReviewID": "R3HHAX9YTVO6EG", "Overall": "5.0", "Content": "Great camera, full of features, takes good pictures, it looks good too,and it is easy to use, compact size, it can not be beat for this price.", "Date": "January 22, 2012"}, {"Title": "A great little camera for a good price!", "Author": "thechelseaclare", "ReviewID": "R8J1KVIJQTBF6", "Overall": "4.0", "Content": "I am rather pleased with this little camera! My favorite feature is how well it performs in low light. I will say though that the flash is VERY harsh and tends to wash people out. Otherwise though, it's a great size and was a great value. I'm very happy with its features, especially for the price! :)", "Date": "January 20, 2012"}, {"Title": "Olympus Stylus 7030", "Author": "Melinda Mejia", "ReviewID": "REX6JNN3QWXBJ", "Overall": "4.0", "Content": "Camera works great. It is fairly easy to use. It has several \"scene\" settings that work nicely. It doesn't use regular AA but has it's own camera battery that needs to be recharged more often than I would like. Using the video option drains the battery very quickly. I've had to recharge in the middle of taking pictures/video. Still a cool camera. Love the way it looks.", "Date": "December 28, 2011"}, {"Title": "Olympus Stylus 7030 digital camera", "Author": "Mike McCormack", "ReviewID": "R3FXONEFKZZ27Z", "Overall": "4.0", "Content": "I use this camera for my work in the automotive industry to document critical issues that we might be having with regards to quality or a physical problem with our manufactured parts. It is easy to use and the excellent quality of the shots really makes my job easier with clarity and color. A great buy at a great price.", "Date": "December 19, 2011"}, {"Title": "Olympus Stylus 7030", "Author": "kahunafiveoh", "ReviewID": "R3MH6BGYHV7T85", "Overall": "5.0", "Content": "Camera was as advertised, works very well in various light fields, pictures high excellent quality. When transferred to jpegs quality remains. Would recommend for the casual photographer who likes to keep photo records.", "Date": "November 28, 2011"}, {"Title": "Easy to use-great pics!", "Author": "Kathleen McConnaughey", "ReviewID": "R2QNK844ISPWLF", "Overall": "5.0", "Content": "Wanted to upgrade my existing camera. This is an easy set up and great pic quality. Only wish I had thought to buy more for Christmas gifts!", "Date": "November 28, 2011"}, {"Title": "Amazing pictures", "Author": "C. Gorrell", "ReviewID": "R2008BYVST0MN4", "Overall": "5.0", "Content": "I bought this for my 13 year old daughter.  She loves taking pictures and this camera is perfect for her.  It take amazing pictures. They're never blurring and so clear. She loves playing with the merging of two photos to make one panoramic picture. It is the perfect camera for her.", "Date": "November 12, 2011"}, {"Title": "Not what I expected", "Author": "TravelTheOceans", "ReviewID": "R16RRTXOZ4ZSGK", "Overall": "2.0", "Content": "I purchased this camera after doing some research on point and shoot cameras. Ratings were average to above average so I assumed why not, right?!  WRONG!!  I took it on a family vacation and was extremely UNhappy with it.  Some times the pictures would turn out red as well as the display screen.  The zoom is HORRIBLE! Pictures are grainy and unclear and this was just on the 7x zoom (or shorter zoom) not the extended zoom feature it offers, pictures were even worse when using that!  No matter what setting--the shutter speed is sssllllooo[...]  Sport mode is a joke, b/c of slow speed you cant get anything timed right.  However, for a basic point and shoot camera it does the trick.  Takes decent potrait style photos, other then that I wont use it again.  I'll use my Nikon SLR.", "Date": "July 14, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0031RGEQS"}}