{"Reviews": [{"Title": "sony will not honor warranty if water leak", "Author": "sony no more", "ReviewID": "R10EHES8249O3U", "Overall": "1.0", "Content": "This camera is advertise to be waterproof but yet after using it for the first time in a 5ft deep swimming pool, the camera leaked and when I send it in for warranty, they blamed it on a missing screw?  why would I be removing the screw on a brand new camera?  They flat out lied just to have a reason to not cover the product.", "Date": "August 9, 2010"}, {"Title": "Sony dishonest", "Author": "Kayaker", "ReviewID": "R26BA8D36D15YT", "Overall": "1.0", "Content": "The camera stopped working after 1 month.  Sony did not cover the warranty because of water damage.  Repair cost $250 (full price of the camera).  Don't buy this product if you plan on using it in the water!!!!", "Date": "October 26, 2010"}, {"Title": "DO NOT BUY", "Author": "unhappy camper", "ReviewID": "R7OF4NE99SE2V", "Overall": "1.0", "Content": "Do not buy this camera. If you have bought it, do whatever you can to return it. Here's why:1- The CAMERA:-During my second time using it under water (shallow depth), water crept in after half an hour. I got multiple error messages and then it just died. I had NEVER dropped it, even though you are technically allowed to. Honestly, when compared to a Canon of similar price range (that my friend bought for the trip), the photo quality was inferior as was the LCD screen. Sony's only superior feature was the underwater advantage, which FAILED with disappointing colors.  (Canon has a comparable feature for panoramic shots, not as cool but just as functional).2- The SERVICE:-When I contacted customer service about the warranty coverage, they required that I send the camera to the Laredo Repair Center in Texas. This was quite inconvenient, especially b/c I had bought the camera for a 1 year trip abroad and was in Asia at the time. They gave me all the information I needed to include. They told me I did not need a reference number during our online chat. I called customer service just to verify, and they confirmed. So I sent the camera back. I had not heard anything for nearly 6 weeks, when I finally called again and was told that I had to deal directly w/ Laredo b/c Sony had no record. Besides placing me on hold for thirty+ minutes and then hanging up on me on THREE different occasions, each time I called Laredo I got a different story. 1) \"the camera was never delivered.\" 2)(After I sent them the delivery confirmation), \"the camera was delivered, but we can't fix it so we are either sending you a new one or a refurbished one. we'll call you back in five minutes.\" 3) (when they never called back), \"this was human error and we won't be replacing it\" (more nonsense that I don't have the energy to type ensued, including him mixing up my file with two other people) \"um, a supervisor will call you back by the end of the day\" (never received call back).JUST BUY A CANON. THIS IS RIDICULOUS. SONY- I HOPE YOU READ THIS AND 1) CONTACT ME TO RESOLVE THIS ISSUE 2) CANCEL YOUR MANAGEMENT CONTRACT WITH THE LAREDO REPAIR CENTER (I HAVE TO ASSUME THAT YOU WOULDN'T ALLOW THIS LEVEL OF INCOMPETENCY WITHIN YOUR OWN ORGANIZATION).", "Date": "December 7, 2010"}, {"Title": "Great underwater performance", "Author": "L. Chua \"supermom\"", "ReviewID": "RRUYE8DRVVRFO", "Overall": "5.0", "Content": "I bought the TX 5 for 2 reasons: 1) picture and video quality 2) underwater performance1) Picture qualityThe TX5 one great camera that is tiny and beautifully crafted. Picture and video quality are both great. And the extras like \"smile detection\" and panoramic features do not dissapoint.I still use my Casio Exilim and another old Sony Cyber-shot, and picture quality wise Sony's cameras have always been better than Casio's. Casio's low light quality and anti shake capability never worked well, or else I would have bought the Casio G1 from my local Costco and save $100. Instead, I got the TX5 and I am very satisfied. I also love the fact that the TX5 takes standard SD card.2) Underwater performanceThis is the best underwater *compact* camera money can buy IMO. Its underwater performance is just superb - at least for now :) I can't say the same for other compact underwater cameras. Check out reviews of other cameras on Amazon if you don't believe how other cameras leak and die very quickly.A VIDEO is worth a million words, so I'll let my video do the talking. I have uploaded more than one video, but the following one was taken 8 feet underwater and survived with flying colors:[...]Other videos are tagged with \"TX5\" under my youtube account: [...]Get wet and have fun!", "Date": "April 27, 2010"}, {"Title": "Best Point-n-Shoot I've Ever Owned", "Author": "Hannah Caroline \"Hannah Caroline\"", "ReviewID": "R3LOGMOWB6S0M4", "Overall": "5.0", "Content": "In the past 3 years I've owned 6 digital cameras:  5 point-n-shoots and a DLSR.  Though I always select products with high ratings, I'm picky and easily dissatisfied with purchases I make.  The point-n-shoots often performed poorly in dim lighting and tended to produce pictures with too much noise.My Canon DSLR T1i was leader of my pack, capturing stunning shots at warp speed.  However, as anyone who shoots the \"big boys\" knows, these cameras are heavy to pack around and they're sensitive to impact, to dust, and to temperature & humidity. While a DSLR is essential to the professional photographer, a quality point-n-shoot fits the needs of most of us hobby photographers.  Because I do a lot of shooting in the mountains, I decided to purchase a durable camera for those times when weather conditions are less than stellar.FEATURESWasn't sure I'd like the touchscreen, but it's user-friendly and far sturdier than I'd expected.  The touchscreen also gives you bigger \"buttons\" to push, making it easy for those of us with large fingers. The camera features a nice slide-show with music.  The battery compartment door has a metal hinge. How many cameras nowadays have that??  More metal, less plastic on this camera.  I have shot underwater only once with it, which was fun but not something I'm likely to do often.  I've taken it out on many rainy, cold days, however.  I now cannot imagine owning a delicate \"regular\" camera ever again.PROS & CONSThis camera produces some of the finest quality photos of any point-n-shoot I've seen.  Excellent, clear shots both night and day.  The pictures I've taken show no visible noise and have brilliant color saturation.  There is still shutter lag with this camera, which sometimes tests my patience.  I also wish there was greater zoom capability, but that feature is limited on waterproof models. Of course a DSLR has greater versatility and can perform feats that a point-n-shoot cannot.  But this little camera is tougher and is a fraction of the weight.RECOMMENDED ACCESSORIESI bought the Sony slim case that clips onto your belt loop.  Perfection!  Despite the pride I used to feel in shooting my DSLR, I now find myself heading to the mountains a little lighter.  I clip this little camera to my belt and hit the trail.  The round nylon wrist strap that comes with the camera is uncomfortable over the long haul.  I bought the OP/TECH USA Cam Strap and highly recommend this little gem.  This camera has a tricky strap holder (teeny-tiny hole), so I had to feed the new strap connector through with tweezers, but it was worth the hassle.  This sturdy neoprene strap is so soft and comfortable!  Also, the battery life is not impressive.  I bought a backup battery, and recommend this to others if you'll be out shooting for lengthy periods of time.  The soft camera case, soft wrist strap, and backup battery can go a long way toward helping you enjoy a happier day.  :)HOW IT HANDLES SHOCKOn a recent hike in the mountains, I was climbing a rugged rocky area to photograph a waterfall, when I accidentally dropped this camera.  The footing below me was solid rock and the camera fell approximately 4'.  I held my breath as I scampered over the rocks to pick it up.  The metal cover was scratched up, but the camera continued taking shots like nothing happened.  Very impressed with that.  I had been wearing a neck strap, which was swinging as I hiked, banging into my chest and annoying me, so I unhooked the camera from it.  That's when said accident happened.  I'm now using the neoprene wrist strap mentioned above.  (See my review on this product, and on the recommended camera case, if interested.)COMPARISON WITH A SIMILAR CAMERAI also bought the popular PANASONIC LUMIX TS4 12.1 because I was impressed with the tough housing of that camera.  After one weekend of shooting, however, I returned it to Amazon.  Photos did not match the quality of this camera's-- not even close.  On the Panasonic Lumix, indoor pics looked \"stark\" rather than \"soft,\" colors were off by more than a shade, and nighttime shots were dark, somewhat fuzzy, and had \"ghostly\" streaks in them.  I was shooting both cameras side by side for comparison, and there simply WAS NO comparison.  Makes me appreciate my little Sony even more!UPDATE 9/28/13:  This past weekend I visited the Lewis & Clark Caverns in Montana.  During the 2-hour tour in darkness with minimal light, I shot numerous pictures of the caverns, as did virtually everyone else on the trip.  There were many, many comments from friends and fellow tourists about how beautiful the caverns were and how disappointing it was that they could not capture that beauty on their cameras due to the darkness.  My pictures, however, taken on this trusty little Sony Cyber-Shot, came out crisp and rich in color and detail.  People were so wowed that some friends of mine requested copies of MY pictures to take home so they'd have memories of this special experience.  Again, excellent camera, SUPERB pics in low-light conditions. :)", "Date": "July 31, 2010"}, {"Title": "DSC-TX5 - One unit to replace your Point-and-shoot and video camera....", "Author": "Camera Noobie.....", "ReviewID": "RIVS5DRNURGGN", "Overall": "5.0", "Content": "Excellent all-around camera.  HD Video great.  Extremely responsive.  Pictures look awesome.  Of course, shockproof, waterproof, and dustproof are huge bonus.The only 'con' I can think of is the fact that you can't 'lock' the touchscreen, and while it is active, you may inadvertently touch an on-screen button.  There may be a screen lock feature, if so, I just haven't found it yet.", "Date": "April 18, 2010"}, {"Title": "Almost perfect for hiking", "Author": "Edgar Johnson", "ReviewID": "RXCGHH5TLQL6O", "Overall": "5.0", "Content": "I got the TX5 specifically for hiking, based on its promised durability and light weight. On my first trip out (a three-night solo hike), I had a 90-degree heat index the first day, and 18 straight hours of rain the second day. The camera, which rode in the front pocket of a pair of nylon pants that got soaked completely through, held up like a champ. By the end of the second day, I was taking pictures in the downpour with no worries about the camera's durability at all.It does not have the same image quality as a DSLR, but considering that I wouldn't have dared to take a DSLR out of its bag on a day like that, the TX5 allowed me to get dozens of shots I would not otherwise have managed. If you're looking for something small, lightweight and (so far, at least) able to handle whatever nature throws at you, I highly recommend this camera.", "Date": "May 10, 2010"}, {"Title": "Customer Service does not stand up with water leaks.", "Author": "gplunk", "ReviewID": "R26SI8CTPEO45J", "Overall": "1.0", "Content": "I am very disappointed with the coverage by Sony on the warranty.  Less than 90 days owned and the camera leaked.  They would not stand behind the warranty.  Customer Service said they had no way of knowing how the water got in the camera but it was not covered by warranty.  I would not purchase again!  Waste of my money since it did not perform as expected.", "Date": "September 6, 2010"}, {"Title": "Excellent digital camera and video recorder with a few minor issues", "Author": "Willie V. Hughes", "ReviewID": "R38RX9Y349GIDE", "Overall": "5.0", "Content": "I bought this camera with the thought of selling my dedicated Panasonic digital camera and dedicated Flip HD video camcorder.  I tested this camera out heavily over the last few days at an indoor ice rink with lots of motion and poor lighting, and at a colorful outdoor festival on a sunny day.The camera is really slim and appears to be waterproof, windproof, and shock resistant.  Feels sturdy-- much of the camera body is metal.  The LCD screen is touch sensitive and there are virtually no buttons you need to press on the camera body (you just slide the cover down, take your pictures, and then slide the cover up).Pros:+ Camera profile is slim and appears very sturdy.+ VERY fast to use.  You can slide the cover down, take a picture, and slide the cover back up in about two or three seconds.  Most cameras won't power up and shut off nearly that fast.+ Excellent picture quality.+ Lots of settings to tweak if you like to make things complicated.  Otherwise there's an \"Easy\" setting which basically just allows you to take great pictures automatically.+ Takes excellent HD video.+ Camera organizes photos nicely in camera by date and makes selection by thumbnail easy.Cons:- Curiously there is a stainless steel sliding cover for the front, but no such cover for the back.  The sliding front cover makes you THINK you could slide this in your pocket and go, but I worry the rear touchscreen will scratch.  Will need a case.  Given that Sony has marketed this camera as so tough, they should have made it possible to carry around WITHOUT a case.- Rear touchscreen is a fingerprint magnet since all menus are accessed from it.- Pan feature is pretty weak.  Sony suggests you can make panoramic photos without a tripod, but the camera will have error messages if you do not pan with a REALLY steady hand.- Zoom strength is limited due to constraints of slim profile.- No optical zoom.  Digital only.Overall Verdict: I'm keeping this camera, and selling my Panasonic digital camera and my Flip HD video camera.  This camera is so slim and easy to use that I think I will be more likely to use it in various situations since it's so portable.  A great camera is no good if it's sitting at home during all the times you want to take photos or video!", "Date": "April 17, 2010"}, {"Title": "Poor Quality and warrenty service", "Author": "Mary", "ReviewID": "RCX8RO719U6HJ", "Overall": "2.0", "Content": "I bought this camera because of the good reviews on speed and because of the waterproof and crushproof properties.  When I first got the camera it was fantastic - good speed, great touch screen, sleek design - overall thought it was a great camera, although a little on the pricey side.  Only 1 month later, and 2 trips in the water and the camera would not turn on, even after attempting to charge the battery several times.  SONY instructed me to send it under warranty to Precision Camera in Connecticut. I sent it out (having to pay for postage) only for Precision Camera to have lost it at some point.  Supposedly they are now sending me a replacement camera (2 months later) of an \"upgraded\" camera - the TX7 - which I can purchase for $50 cheaper than the TX5 I originally had, and it is not waterproof or crushproof, the whole reason I bought the TX5 in the first place.  Overall I am very disappointed in the camera and SONY warranty fulfillment.", "Date": "October 30, 2010"}, {"Title": "Spectacular Camera", "Author": "janice thompson", "ReviewID": "R26ZXYXKI8B0VV", "Overall": "5.0", "Content": "I received this camera a few days ago.  I couldn't be more pleased.  The touchscreen is amazing.  I love that it turns on and off by the lens cover.  The photo quality is just fine for a point and shoot.  I own the Sony WX1 which I love.  I bought this camera for using under water and for it sturdiness.  You will not be disappointed if you purchase this tiny powerhouse of a camera.  Good low light shooting too.  I LOVE it!!!!", "Date": "April 7, 2010"}, {"Title": "Very Good Camera", "Author": "J Higgins \"J Higgins\"", "ReviewID": "R2Y618M0DIOJ7Z", "Overall": "5.0", "Content": "1) I work in a very harsh environment2) I live in a city that has countless continual fleeting photo opsOver the past 10 years I have owned the best compact cameras from Nikon (4), Canon (1), Nikon (1) then Panasonic (2). The last Panasonic has been in for warrantee service 3 times for dark spots on the pics.Then I bought the SONY DSC-TX5, which is by far the best performer of all.While the Canon took consistently good photos, the others left a much higher ratio of unacceptable photos. Good performance in rushed.... unexpected situations is essential.The first day I had the SONY DSC-TX5 I went snorkeling. It performed extremely well while providing a carefree point and shoot experience..... no fumbling or delays in understanding the functions. Ever since, the DSC-TX5 has provided consistently good photos, even in low light without flash. I wish I had a camera that performed so well in low light over the years. I would have gotten many more great pics.The SONY DSC-TX5 performance is beyond my expectations. It is refreshing to have a carefree camera that works so well. Most other cameras also have great specs, but the SONY DSC-TX5 does three essential things where the others lag.1) Take consistently GREAT pics2) FAST start-up with equally fast ease of use input and shooting response3) Great low light performanceI've heard horror stories about SONY service, so I hope the DSC-TX5 never fails. So far it is VERY sturdy and reliable.", "Date": "June 12, 2010"}, {"Title": "Water leaked and ruined camera sony did not fix claiming damage.", "Author": "J. Dann", "ReviewID": "R37J22RJDW3POZ", "Overall": "1.0", "Content": "I took my camera into a foot of water and later that day the lens fogged up for 3 days. I had to push the preview picture then switch to camera to take a picture after that but not in the water anymore. I sent it to sony to get fixed. They said that it is damaged from a small crack on corner. This crack lets water get in and now it is corroded inside and it can not be fixed.I never noticed any crack. So i am forced to get a new camera make sure you get extra warranty that covers water damage.  Good luck and be careful with this camera it is fragile.", "Date": "September 2, 2010"}, {"Title": "Flawless?", "Author": "Harkanwar Anand", "ReviewID": "R12VID8G5GFWB", "Overall": "4.0", "Content": "I have been playing around with my cousin's camera and I didn't believe him when he said that his camera can be used under water - it actually works, this was all over the place and it actually worked in our swimming pool. I am inclined to give it 4 stars for that alone but I must mention that the quality of the images are maybe better or as good as I have seen on any \"digital camera\"  . .This looks like an ideal option for someone who's looking to get a camera that is portable and not a digital SLR.Here are some other things I noticed about the camera, firstly, don't get it in this colour, it just looks horrible I feel, get the black one.I wish the \"playback\" (or review images/video) button was placed more conveniently and the plastic wasn't so plastic. This is maybe the only flaw of the camera but for the price one can hardly complain.We clicked images on 5 megapixel intentionally and they came out swell and better than ever. I found that images in the dark look better than the older Sony Cameras but this one is a definite improvement. There is still room for improvement because I was walking through Vegas with this camera but I got nowhere trying to tweak the settings or what have you. There was a time I Had to use the blur/burst feature to get the camera to take still images correctly.The panorama feature is awsome, the videos are good if not great. The battery life is good, more or less the same whether you fling it in the water or not.This is an ideal camera for someone who has a camera older than 24 months and is looking to get something that will last for a couple of years. The water proof feature makes this great. The battery takes a while to charge and if you remove it half way or say after 35-45 minutes it will say battery lose soon. So yeah you have to make sure the battery is fully charged, avoid charging the batteries unless battery is low. The flash is good. I never use the accompanied software.I have a Canon 780 but if I had to change, I would change to this. I'm gonna wait 6 months and see if they release an update and maybe I'll buy that. Buy this is if your digital camera is out-dated.I give full marks to Sony for the beautiful LCD display and the ease-of-use - taking marks away mainly because it's not a night owl and configuring the settings was difficult in a well lit Vegas.", "Date": "October 24, 2010"}, {"Title": "DO NOT BUY!!!", "Author": "LP \"LP\"", "ReviewID": "R1DA20R5LIEYTD", "Overall": "1.0", "Content": "BEWARE!!!I bought this camera six months ago.  After a few minutes in the pool, the camera was filled with water.  Sent it to repair at the Laredo center, since it would naturally be under warranty.  In summary, they blamed me for a missing gasket!  Also, since the camera had water in it - it VOIDED the warranty.  That is absolutely unacceptable and POOR customer service.  Sony should be ashamed of themselves for ripping off their everyday customers.  They stated there were no known defects to the camera!!!  Read the internet, it is documented everywhere about the NON-WATERPROOF issues of this camera - AND how you blame the consumer for its problems!  I wish I had read more about this camera myself before purchasing it. Thanks for nothing.", "Date": "July 8, 2011"}, {"Title": "Performs adequately but falls short of being \"top notch\"", "Author": "Ephraim Risho", "ReviewID": "R348IL3KMU8FOI", "Overall": "4.0", "Content": "I won't complain - I do like this camera for what it offered me - a waterproof, compact, rugged pocket model I can take anywhere. I've now taken it backpacking, canoeing, hiking, and I find it slim and rugged enough to throw into any pocket or bag without worry. That is this camera's strength.On the plus side, the LARGE display works marvellously, and I find the controls easy to use quickly with a little practice. However, when it comes to image quality and the ability to tweak settings, this camera is seriously lacking.The colors and image handling are not as vibrant or accurate as Canon pocket cameras. I don't expect any pocket camera to have the capability of a DSLR with large lens, but at the same time, I did expect more from this one.I was quite disappointed that there are no real \"program\" settings. You can lower or raise the exposure, but that's about it. I wanted to take a photo of a sunset, and later the night sky with stars and the horizon. This camera couldn't handle it, no matter how hard I tried. All it needs is the ability to program leaving the shutter open for ten seconds, or a decent night-setting. Granted, I couldn't fiddle with it in the dark too well, so it may be possible with more effort, but I found it annoying that I couldn't just change the settings manually.This is an automatic camera. It will try to figure out everything for you. So, don't expect it to be able to take those absolutely unbelievable shots out in nature. You'll need a DSLR with rugged case for that. It's for memory shots. While whitewater rafting I won't mind pulling it out of my pocket and snapping some shots in the rapids. And for that, I am glad I bought it.", "Date": "September 10, 2010"}, {"Title": "NO WARRANTY FOR WATERPROOF! SONY AWFUL!", "Author": "R. Wilson-Heckathorn", "ReviewID": "R2UJZ2B4JV5W9F", "Overall": "1.0", "Content": "DO NOT BUY THIS CAMERA!!! IN FACT, START LOOKING AT CANON, NIKON OR OLYMPUS!I used to say this was the best small camera money can buy. The image quality and the intelligent panorama feature are AWESOME! This camera performs miracles in low light scenarios like bars and nightclubs...Unfortunately, there aren't enough miracles in the world to save you from Sony's Laredo based \"Service Center.\" This morning I spent 2 solid hours on the phone talking to half witted customer \"service\" robots. I was told the same thing by about 8 different people and was finally escalated to the \"ceiling\" of customer service where I was promptly sent right back to the beginning. AWESOME!Once back on the phone with the Laredo center, they tried to put me back on the merry go round again. I told them to not even think about it and give me a supervisor to talk to (side note, first time I asked for a supervisor, the guy refused to give me one, then hung up when I asked for his name. Great service guys!!!). After a few minutes I got a \"supervisor\" who basically told me the same thing AGAIN!Here is their logic: My camera is not eligible for warranty due to corrosion, which voids the warranty. So in affect, if your \"waterproof\" camera gets wet, the warranty is void. It really is a genius catch-22 they have created. Make a \"waterproof\" camera and give it a warranty, when it fails revoke the warranty based on it being broken!I tried to explain repeatedly that water is what causes corrosion in electrical devices and that the seal failing was the reason for that. The response was always the same crap.As of right now I'm waiting for someone from the Laredo facility to call me back. Not holding my breath. Though, I can guarantee you they have not heard the last of me... Poor Charlene (with the agent ID of CQYY) will most certainly be hearing from me for the next week or so...", "Date": "July 7, 2011"}, {"Title": "Warranty voided b/c it leaked & horrible customer service", "Author": "Gary Haith", "ReviewID": "R2BL2NU20EWK62", "Overall": "1.0", "Content": "SONY - PLEASE READ!This is one of the first reviews I've ever submitted -- I want to save other people the same money, frustration and time.Bottom Line: If you would buy the camera with a water damage exclusion in the warranty & knowing that it is not possible to ensure that the camera won't leak, then go for it.  I would not buy this camera again & I would recommend never talking to warranty service at Sony -- it is a maddening time sink, I was cut off 4+ times.Details: This was a great camera while it worked.  Unfortunately it can leak (mine was good for 6 months, but then leaked) & the Warranty is voided by water damage (even though the warranty does not say it).  Absurd (& has got to be illegal -- class action anyone?), but true.I'm technically competent and I was extremely careful to use the camera according to the guidance (<3M deep, no yellow showing on the battery closure, clean gasket, no dropping, etc...) & it stopped working with various weird error messages.  I paid to send it to the Loredo repair center and they told me it had corrosion inside & thus the warranty was voided -- they hung up on me 2x when I politely asked for a manager.  When I called the main Sony cust service number and explained, they told me the warranty excluded water damage -- they rescinded that statement when we could find no such clause in the Warranty.  They then told me that water damage is \"automatically\" assumed to be user error with no possibility of review and no evidence provided or needed on their part.  Their resolution was for me to buy a refurbished model of the same camera for the same price as the new camera on Amazon.  I was escalated up 3 levels (5 reps total) until I was sent back to the Loredo center again... mind numbing.", "Date": "July 7, 2011"}, {"Title": "Be wary of this camera and don't trust the warranty", "Author": "Paul \"Pablo\"", "ReviewID": "R1SSB6VY1SKTWT", "Overall": "1.0", "Content": "We bought three of these cameras after a much loved DSC TX-7 was damaged in a torrential rain in Costa Rica.  Gave one to each of my kids before a trip to the Galapagos where we knew we'd be in and near water.  We were quite happy with them but I did notice that the mechanism that closes the battery/SD Card compartment did not have a very well designed latch (appears to open with a bump or friction in just the right direction, and it is not obvious when it was locked closed).One day, my son's camera just wasn't working.  We discovered a greasy substance on one of the battery terminals.  Our suspicion was that water had leaked in, even though we had not used it outside the guidelines.  The paint also pealed off the lens cover (a known defect that supposedly would be repaired at no cost).  When we returned to the states we sent it in for repair.  The repair service determined that there was indeed water damage, but because they (Sony) determined that the seals were intact the problem must have been our fault.  Repair denied, cost exceeded value-- it was totaledHaving had an unrelated problem with a simple repair of a Sony VAIO computer (it took 5 weeks for a warranty repair) I have little confidence in Sony.Interestingly, my daughter dropped her TX-5 on the same trip breaking the lens cover and damaging the body.  They repaired that at no charge even though it was our fault-- go figure!", "Date": "June 6, 2011"}, {"Title": "Is that a real Sony product??", "Author": "Ricardo lirani bassanezi", "ReviewID": "RGZV777KNNQYG", "Overall": "1.0", "Content": "Well,I'm totally disapointed with Sony because of this camera.I have just used it for 2 weeks then it died. First time using the camera under water, after few minutes, it stopped working, the screem got crazy and it never turn on again. I have burned 300 bucks on nothing! I have followed all procedures, stayed in a place with less than 2 meters deep, only about 15 minutes after, the camera sttoped and never work anymore. I'm an old user of Olympus Stillus camera, and I love that, it still working for more than 4 years.After chating with Sony specialists they told me to send it to Laredo Repair Center in Texas,I'm in Brazil, so I expent U$40 to send the camera to the repair center and guess what, to fix the camera they charged me U$ 576!!!!! It's under warranty, I just used the camera as the specifications described in the manual and it get stuck, do not work anymore. That's the worst product I ever have with the worst support.My equipment still at Laredo Repair Center, I hope sony can solve this problem ASAP!!!!The support is awfull, customer suport and Laredo is even worst. I have wrotten a letter describing the problem, how it was used, everything in details and it looks like nobody read it. They just put the status at internet, to fix, it custs U$576!!!!! Call support to approve it. I have paid U$270 in the camera, its more than twice to get it fixed!! I called them and they told me many technical stuff and that simply the camera cannot be fixed. I have asked for a formal email about the problem and what cause it and they cannot send it!!!! Its awfull, please do not buy this unit, when you look at it, its beatyfull, looks like a good device, however, its totally disapointing, only if you need to burn 300 bucks, its better if you get a ligther and burn it, less headache you have.I have tryied to contact the Customer Center to open a complaim and they do not have a way to contact the Laredo Repair Center, how is this possible? I have called more than 6 times to convince an attendant that It's under warranty . They will try to contact Laredo repair Center however until now, I still waitingI will not recomend this camera neither for the worst enemy in the world. If you buy this camera, forget about WATER PROOF, IT's NOT AT ALL WATER PROOF!!!! Sony, if do you review that, I just want what I have bought, a camera with water proof characteristics.", "Date": "April 5, 2011"}, {"Title": "Rock Solid!", "Author": "ColdRail", "ReviewID": "RNWWPKR2BFPWC", "Overall": "5.0", "Content": "Spending many days a year running whitewater and flyfishing on our Northwest rivers I knew it was just a matter of time before I would need to replace my inexpensive Kodak EasyShare digital camera with a water proof camera.  Well this Spring I flipped my raft and fulfilled the Kodak's destiny as a paperweight.  I did the research and selected the Sony DSC-TX5 for its waterproofness, thinness (fits in my wader's front pouch perfectly), and strong ratings on image and video quality.I have had the camera for over 6 months using it extensively for the above purposes and have been extremely pleased.  I can't overemphasize how the thin profile of this camera makes it so easy to carry that you find yourself taking it more places and using it more than you would with some of the bulkier waterproof cameras currently out there(for example slipping it into a biking jersey pocket).The other reviews can provide the technical detail on this camera but I am writing this review as a testimonial to its durability.  At the risk of appearing as a total bone head with my gear (which I am typically not) I managed to lose the camera on Halloween eve when we went with our kids to a Halloween party.  I remember leaving the party with my phone and camera, which was in a black leather case.  The next morning I couldn't find the camera in the house or our truck.  Making a long story short after searching for it for 2.5 days we found it in the street outside our friend's house where the Halloween party was.  I must have dropped it in the dark while loading the kids up.  It had got mixed into some leaves and sat in the rain all of this time.  Upon opening up the case it appeared that the camera had been ran over at least once because the sliding metal lense cover was slightly tweaked and dented.  Fearing the worse I slid open the cover and was pleased to see the LCD screen fired up.  In fact the only thing wrong with the camera was that the clear coat on the stainless steel sliding lens cover flaked off from soaking in the rain all of that time.  We have since used the camera many times with no ill affects from my idiotic indescretion.So if you want a camera that is water proof, bomb proof, idiot proof!, and takes great photos and video, I can recommend the Sony DSC-TX5.", "Date": "November 20, 2010"}, {"Title": "Great little camera for the pool!", "Author": "Roy E. DeMeo, Jr.", "ReviewID": "R4YFW1I6GME0C", "Overall": "5.0", "Content": "I bought the Sony Cybershot TX5 for a trip to Aruba. I loved it. It's so compact that it is comfortable to carry around. We used it heavily in the pool and on a snorkeling trip. The camera took great photos, over 800 of them in 12 days. It did really well caoturing action shots such as jumping off a water slide or rope jump. I got photos that I never would have gotten without it. I kept the camera in the pool for hours at a time so that I could always be ready to get a great shot. I worried that this amount of water exposure would damage the camera, but it kept on working without problems. It did need to be recharged frequently however because we were taking so many photos. Only problems were that low light shots were poor and the clear sealant on the sliding cover is peeling off. I also would have liked a flash-on setting because the auto-flash wasn't always reliable. Also we took so many photos that its a huge job to select and edit the best ones. I recommend getting the Canon 34\" metal neckstrap for Elph cameras and Olympus camera float for this camera as well.", "Date": "September 13, 2010"}, {"Title": "Love this camera", "Author": "Emma S.", "ReviewID": "R3N5QVKI9QYHQV", "Overall": "5.0", "Content": "After my point and shoot Nikon committed suicide for the second time (in a year and a half) in my purse by giving itself a lens error, I decided to get a camera that didn't have a moving zoom lens.  I had previously owned an older model Sony cybershot that I loved, and that lasted for years, so I looked up the newer version of it.Because I mainly use my point and shoot for throwing in my purse or pocket and going places, I was intrigued by the rugged aspect of this camera.  Since my husband and I are both drop prone, and like being outdoors (and often near sand, dust and/or water) I decided to buy it.It is perfect for our needs. We have taken it swimming in the ocean and pool, hiking, and it has so far survived my purse.  It is tiny, and I like that it is so much cuter and sleeker than most other waterproof cameras.The picture quality is excellent for a point and shoot of its size, and it has a really cool panoramic feature which lends itself to the \"rugged\" places this camera can go.  It is not an SLR in terms of image quality, but for what we are using it for it takes really great photos.All in all, I am really, really happy with this camera and am glad I spent the extra [...] for the water/shock/freeze proof features.  It was already going to be [...], so why not?", "Date": "June 24, 2010"}, {"Title": "Great camera", "Author": "Rafael", "ReviewID": "RIHDAR6UQARJK", "Overall": "5.0", "Content": "This is a great camera. Works perfectly underwater, making movies and photos in great quality. I recommend for anyone who wants a portable waterproof camera!!!", "Date": "September 20, 2010"}, {"Title": "Great overall camera", "Author": "Nick Camp", "ReviewID": "R3UJ46EK1EJFB8", "Overall": "4.0", "Content": "Most all aspects of this camera are great.  We have used regular compact cameras with external waterproof enclosures before but this is astronomically better as there is no \"prep\" time to use it.  Just take it out of your pocket/purse and jump in the water.Couple of things to note however:1. It doesn't float and has a 10' depth limit so suggest you buy a floating wrist strap if you use it in the water.2. Touch screen is a bit hard to deal with in bright sunlight3. Front lens port tends to get \"greasy\" from being touched.  Even in water you will want to wipe it off before taking pictures to avoid blurry pictures....", "Date": "August 31, 2010"}, {"Title": "Wow!", "Author": "boomerang", "ReviewID": "R3N6BNYSGKGJHW", "Overall": "5.0", "Content": "I received this camera for my birthday and wow!  I'm so amazed.  First of all let me give you some background.  My husband and I purchased a Sony Cybershot DSC-T1 in 2004.  With camera, memory card and case we spent right at 1000 for the camera.  6 years and approx 8000 pictures later my T1 is still going strong.  I've been looking at other cameras for a while now, but couldn't buy one bc my T1 wouldn't give up.  Well some how the TX5 slipped through my search.  I didn't even know Sony made a waterproof, shockproof, dustproof, freezeproof camera.  This camera does so much it'll have your head spinning.  I'm not even going to try and list pros/cons bc there are no cons and my pros list would be to long.", "Date": "August 6, 2010"}, {"Title": "Very very happy with camera", "Author": "Kitty Hooligan", "ReviewID": "RI2FFUHU0QRKH", "Overall": "5.0", "Content": "Very happy with camera, under water shots in pool were fun to take.  Sweeping panorama shots are great.Having a camera I don't have to be very careful about dropping or getting wet is such a relief.The underwater and panorama features closed the deal for me.I'm a huge Sony fan, have yet to be disappointed.Anyone have a recommendation for best memory card to use for fastest recording?", "Date": "June 16, 2010"}, {"Title": "Worked fantastic, until....", "Author": "Phil Reed", "ReviewID": "RW8D9VFP8YWAP", "Overall": "2.0", "Content": "Used it for 2 years, works or worked fantastic, last hiking (April 2013) trip the lens started vibrating uncontrollably, now cannot take any photo's at all.  I googled the problem and found many many forums discussing (complaining) about this;  I expect a digital camera to last more than 2 yrs.ps - the lens isn't vibrating today as it rests in a drawer...go figure.", "Date": "April 6, 2013"}, {"Title": "Waterproof... HAAAAAA!!!!  I'll give them splash resistant!", "Author": "Cameron Rados", "ReviewID": "R1PS28UYNOTJLC", "Overall": "1.0", "Content": "I wanted to love this camera so badly.  My Sony DSC-N1 was a fantastic camera, but the fatal flaw was that it was not waterproof.  I purchased the housing to compliment my water baby lifestyle, but hated the bulk that waterproof housing provided.  Then I found the TX5.  I was given the camera for Christmas 2010 from my future In-Laws.  It worked flawlessly on the dry land for a few months, but after only 2 waterborne trips before it leaked and decided to quit... worst part was the second trip was our honeymoon.  After returning from the honeymoon, my new father-in-law decided he was going to take on Sony and get the camera replaced.  If anyone could have strong-armed Sony into replacing the camera, this man would have been it.  Sony would not budge saying that the camera had been \"abused\" and would not replace.  After 2 months of arguments, my FIL gave up on Sony and was offered a refund through the buyer protection program on his American Express card.SONY CUSTOMER SERVICE SUCKS!!", "Date": "January 25, 2012"}, {"Title": "Work for me", "Author": "G0Horns!", "ReviewID": "R3O6EFBESVMTAE", "Overall": "4.0", "Content": "I've had my camera for almost a year now with no issues.  I've been rough with it and has a couple dings but works great.  I thought the water seal would go bad, but so far so good.", "Date": "July 27, 2011"}, {"Title": "Buyer Beware", "Author": "Kevin J Plotner", "ReviewID": "R337N163DLR1YB", "Overall": "1.0", "Content": "I bought this camera as a Christmas gift for my wife. The image quality isn't the greatest nor is the zoom but she takes my kids to the beach often to swim in the shallows. She has used the camera maybe 4 or 5 times in shallow water. It leaked. This voids the warrantee thus removing the camera from our life. Three months, 5 uses, $$$ down the drain. The most expensive camera I ever purchased. Beware, according to Sony the only way moisture gets in the case is if you swim with it open - though it worked fine every time she went, though I rinsed it in fresh water after every use on the beach, in water or not, though I checked for the \"yellow mark\" to show that it wasn't closed (and it was) - we had to have had it open in the water for the little moisture to get in. Never will buy Sony again, I suggest you don't either.", "Date": "April 15, 2011"}, {"Title": "All great except for skin/coating, which peeled off after first bath", "Author": "Priscilla Teixeira", "ReviewID": "R19RP8YMDY9PU0", "Overall": "4.0", "Content": "I have been buying Sonys for some years now, I got a tx200, liked it a lot, then bought a wx1, felt like ir was cheaper than the tx200, but  I liked a lot the widescreen autostitch feature, the dynamic range optimization, and also the wider angle lens. So i went another go when I read that this tx5 was waterproof. I liked this camera more than wx1. But something peeled off from the front cover after the first bath. I dont know if the coating is supposed to come out, but it doesnt look like so, because its not  like  a thin vinyl that you usually take off, it felt more some hard thin resin, and part of it \"unglued\", but part of it is still sticked to the camera and wont come off now that its dry. It was just a 10 minutes  sea bath, and I washed it in clean water after, just like the manual recommends (didnt drop it into acid or something!).", "Date": "October 17, 2010"}, {"Title": "Satisfied.", "Author": "franky88", "ReviewID": "R2AVVJAAKJ67X9", "Overall": "5.0", "Content": "I bought this TX5 from J&R; through Amazon Payment only because J&R; price is $299.00.better than Amason! it's my first experience. it seems to me J&R; delivery service is also better than amason: Fast and safe.The camera is slim and stylish. easy to carry, easy to use, lots of useful functions I like, itried to use it at home with low light and also outside with fog, also I tried to take some pictures of my turtle in a basin full of water, photoes are great, camera no leak....But the bettery life is really to shot and no soft case accopanied.", "Date": "June 30, 2010"}, {"Title": "NOT LEAK PROOF!", "Author": "Mysweetnismo", "ReviewID": "R25PIIDH7PM743", "Overall": "1.0", "Content": "Not only did the paint on the camera lens completely peel off, once i did bring it underwater for snorkeling, it leaked! about 40 minutes of being underwater i started seeing multiple errors on the screen. I sent it in for repairs and did not honor the in warranty camera which i paid well over $300.Beware if any Shock proof cameras from sony!", "Date": "October 10, 2013"}, {"Title": "Owned this camera for 3 years and it's still my favorite", "Author": "ACmartin55", "ReviewID": "R22VLPED8376ZU", "Overall": "4.0", "Content": "I don't understand all the hate this camera is getting in recent reviews.  I don't know if Sony changed the way this thing is built or people are abusing this thing to the point that it fails.I bought this camera off my buddy who won it in a raffle a few years back and it's by far the best point and shoot camera I have ever owned.  The time interval between pressing the shutter button and the camera actually taking the shot isn't too bad.  The picture quality while not DSLR quality is still good enough for you to create nice desktop backgrounds and even photos worth canvasing.  The only things you need to watch are the gaskets on the door that accesses the battery and memory chip.  Make sure that is clear of any sand grains or dirt so the seal is true when it's closed.  Also the door itself seems a little flimsy in the way it's attached so i've always been careful to not toss the camera or mishandle it when that's open.  All this said, i have dropped this thing in rivers, lakes, puddles, mud, on concrete, smashed in to ice while snowboarding and it keeps on ticking.Treat this camera right and it will treat you right.", "Date": "June 24, 2013"}, {"Title": "Great Motion and Detailed Shots", "Author": "Joseph J. Zarzano \"Joe Z\"", "ReviewID": "R2A4JM0586JTWK", "Overall": "5.0", "Content": "I have used this camera for over 2 years and even though I have a Canon DSLR, and a Panasonic DMC-ZS19, I still go back to this easy to use camera, if I just want something reliable I can put in my pocket. Have never had a problem with it.", "Date": "April 9, 2013"}, {"Title": "excelente super nice", "Author": "Alec J. Diaz Rojas MUN304259", "ReviewID": "R33K11SO653IP6", "Overall": "5.0", "Content": "definitely one of best sony models, provides a very good quality images, and the great advantage of being able to take pictures underwater that's the best, recommended 100%", "Date": "March 7, 2013"}, {"Title": "great in and out of the water", "Author": "Jess Wright \"home repair junky\"", "ReviewID": "R9BD4FOYLFZZ9", "Overall": "5.0", "Content": "I have had this camera for years and it is in the water a lot and has been around the world many times. I have taken it diving, snorkeling, and many trip down the river all with no issues. It is great at the pool with kids. The best part of the camera is the size, it fits in my pocket and when I travel it is always on me. The time to turn on and take pictures is just a few seconds. This is important for those times riding in a van and catching the fast shot you only have a short time to capture. Image quality is great. The camera has been well worn and still no problems. Just watch out for sand getting into the cover slides.", "Date": "February 9, 2013"}, {"Title": "Good quality", "Author": "D. Lee", "ReviewID": "R2PPF5W0YI6CZW", "Overall": "5.0", "Content": "I've owned four point and shoot cameras over the past 10 years, and this one is by far the best one in terms of durability and night time picture quality.  My previous Canons were pretty good until they stopped working after 2-3 years.", "Date": "January 23, 2013"}, {"Title": "nice design, OK pictures", "Author": "DB9", "ReviewID": "R23RZD9WXC0R4B", "Overall": "3.0", "Content": "I like the slide-on slide-off nature of this camera. Sliding down the metal part in the front turns it on and snapping it back up, off. makes it easy to use the camera quickly. As with most digital cameras, outdoor and well lit shots turn out great. In low light situations, problems still persist. A lot of times pictures will look nice on the LCD screen but are actually very blurry when viewed on a PC. Still, a nice step up from my old camera but point and shoot still has a long way to go. I haven't dared try the waterproof feature of the camera. It may work, I just don't want to find out.", "Date": "December 13, 2012"}, {"Title": "Worked fine for two years.", "Author": "Leslie Jackson", "ReviewID": "R2MVOMAGF50MKR", "Overall": "3.0", "Content": "I bought this camera two years ago. Shortly after the color on the cover begins to chip off and finally chips completely off. After two years I found I can't close it and this is a waterproof camera. Sony says it will be over a 120 to ship and to repair. Best Buy gave me the same estimate. There is obviously only a small piece missing. It shouldn't cost so much to fix sadly. The waterproof portion worked well for me never had any problems with it. I am now just frustrated trying to figure out our to fix the problem of the camera not closing.", "Date": "October 1, 2012"}, {"Title": "Solid performing waterproof digital - takes a beating and keeps on ticking", "Author": "Rocky Moutain Gal", "ReviewID": "R1CXVZBYTYTCEP", "Overall": "5.0", "Content": "I bought this camera as I fly fish frequently and I wanted a camera to take on the river with me that would take great photos, had good macro capabilities, and could get wet often.  I have used this camera for 2+ years and really abused it.  It has continued to perform flawlessly.  I have dropped it into the river many times and had to retrieve it and so far, it has never stopped working.  I will certainly buy the next Sony TX waterproof model once this one no longer works but for now I am very pleased with it.Features I like:- Digital quality of photos.- Waterproof- Small and light - easy to carry- Rugged- Has a flip down cover over lenses which is great if you are rough on the camera- Movie mode and picture mode- Panorama mode- Takes SD cards which are not too expensiveFeatures i don't like- The picture management software that comes with it. Forget it. It is junk. I couldn't download new drivers.  I use iPhoto now instead of the software that came with it.Love it! However the price now on Amazon is almost as much as the TX-20 so you should compare them before popping for this older version.", "Date": "September 10, 2012"}, {"Title": "Touch screen went out", "Author": "Narley HD 4 Ever", "ReviewID": "R26FYUANVBDSIR", "Overall": "3.0", "Content": "I bought this camera almost 2 years ago and have enjoyed the panornama, underwater and the size, but now the touch screen went out and Sony wants around $150.00 to fix it. Tough call for a 2 year old camera. Also this camera is no good for shooting pictures towards the sunlight. It gives a hazy look around the edges. I've had 100s of pics ruined because of this. Olympus has a new underwater one coming out next month (June 2012) Olympus TG-1iHS 12 MP Waterproof Digital Camera with 4x Optical Zoomfor around $400.00. You can purchace fisheye lens and tele converter one also.  Might go that route. All in all I have enjoyed this.", "Date": "May 27, 2012"}, {"Title": "This is the BOMB!", "Author": "RockLobster", "ReviewID": "R1MIHOALWV28C5", "Overall": "5.0", "Content": "O.k., I've had this camera for almost a year.  It takes EXCELLENT pictures and the features/modes available allow you to take the best shots possible given ligth situation.  The burst feature takes the guess work out of shooting fast action subjects.  The wide angle, though can be a little bit distortive, is very, very useful in terms of taking pictures of people in a small room.  I've had only good luck in taking underwater pictures!  No leaks and excellent pictures!  The This camera is very portable and fits nicely in your shirt pocket.  It takes up little space in my wife's purse.  The camera is very easy to use, yet packs a lot of features to rectify nearly all lighting situations like back lighting, etc.  I've had great luck with the battery life.  The movie quality is good too.  I wish it had an hdmi output like in the TX10.  Overall very pleased with this camera.  I've taken it skiing, snowboarding, grand canyon, bryce canyon and has performed and taken great pictures.  I will either try to find a used one or the TX10 for a purchase soon.", "Date": "April 24, 2012"}, {"Title": "Not bad while it lasted...", "Author": "Flipper", "ReviewID": "R36NADCJBG2YZ5", "Overall": "3.0", "Content": "I bought my DSC-TX5 about 18 months ago (Aug 2009), and I loved the one-hand operation and slim profile. Unfortunately, when/if the touch screen on this baby goes, you can forget about it, though, because there are no alternatives to control it.It worked fine (although with only OK resolution) for two tropical getaways as well as many social occasions, but I must've bumped the screen on a barnacle or rock during a swim because now I cannot control the camera anymore.On the plus side, despite numerous swims, it never leaked for me. However, the screen was starting to show some blotching in areas other than where it was damaged by the barnacle or rock, so perhaps it was only a matter of time until it quit anyway. Although the colored coating of the lens cover soon began to peel after a few swims in the Caribbean, I decided not to worry about it (a known issue covered by Sony warranty).Considering that I managed to take about 3700 photos and vids with it, I won't complain too loudly, but because of my experience with the touch screen my next underwater camera will be one with proper controls! And probably another brand, unless Sony has demonstrated superior durability with newer models.", "Date": "March 17, 2012"}, {"Title": "Stopped working after 16 months", "Author": "alphabravo", "ReviewID": "R2SKJZFLLVVVZF", "Overall": "1.0", "Content": "This camera takes good photos either on land or in water. We bought it mainly because we are often on the coast or on a boat so plenty of salt water and sand.  We used it at the beach -wonderful so you do not have to care about sand and salt water. We also took nice pictures while snorkeling. But that is when it works. It quits working all of a sudden while snorkeling 16 months after we bought it . So warranty has expired and Sony technician  wanted $ 139 to fix it. For that amount I can buy a cheap camera waterproof and throw it after a year. I was expecting with the price I paid for what I thought would be a good rugged waterproof camera I would have for over 2 years at least. Should have bought the Olympus!", "Date": "January 7, 2012"}, {"Title": "excellent camera!", "Author": "erin", "ReviewID": "R3PRH4FIP2UIR8", "Overall": "5.0", "Content": "I bought this camera to take on a year long trip around the world--I wanted something that was small and easy to carry, but still took good quality pictures. This camera was an excellent choice. It has been through a lot of wear and tear, and I have not had any problems with it at all. I have used it underwater many times--in lakes, pools, oceans--and never had any problems, and the underwater pictures and videos are awesome! The picture quality is great--I've been around a lot of other cameras to compare it to over the past year, and the only pictures that turned out better or were better quality were from dslr cameras. If you want a good point-and-shoot without losing quality, definitely buy this camera!", "Date": "November 29, 2011"}, {"Title": "A good camera.", "Author": "Dwight Smith \"D S\"", "ReviewID": "R3KNP3CU7R1QLQ", "Overall": "5.0", "Content": "The use of a SD card is a great improvement for Sony; it gives the use the ability to download pictures to other media with out an adapter.The water proof works as expected. I have used it in the rain and canoeing / kayaking with no issues. It takes hits well as I keep it strapped to my wrist while paddling.The auto selection feature works great but can inhibit fast shots because it chooses a different type of shoot setting. If you set it up ahead of time for fast motion shots it won't be a issue.Take some time with the camera to learn all the nice.Over all I am very pleased with this camera and I would recommend purchasing this product.", "Date": "September 22, 2011"}, {"Title": "Do not buy! Camera is not waterproof. Sony warranty worse.", "Author": "mike", "ReviewID": "R3GIPGRTWMM1PJ", "Overall": "1.0", "Content": "I will make this simple. Do not buy this camera. I will go further and say, do not buy any camera which Sony claims as waterproof. There replacement for this camera is the TX10. I sent camera to Sony warranty 8 monthes after purchase. I'm thinking camera is still under 1 year warranty. Sony responds with an simple email: If I want the camera repaired it will cost $637.00. I jumped in a swimming pool with the camera for less than 10 seconds!!! 5 minutes later camera stopped working properly. Investigating, I took out the battery and saw a sign of moisture in the compartment. I checked the camera battery closure at work under a microscope. I did not see sand or any type of particle that would compromise the closure. The gasket was complete. My experience with Sony customer service, and there warranty department was horrible. I would have felt better throwing the camera against a wall. This Sony Warranty experience will be a reconsider for all Sony cameras. Camera looks cool, but does not perform as Sony advertises.", "Date": "August 9, 2011"}, {"Title": "great as far as waterproofing, HORRIBLE Low light/flash pictures", "Author": "Stephen \"radman2020\"", "ReviewID": "R20LBWIBTHY14X", "Overall": "2.0", "Content": "I so wanted to love this camera....I needed a high quality waterproof camera that won't get ruined on the beach.  This camera does that.  But this cannot be my all around point and shoot.  It takes absolutely horrible flash pictures.  They are either very overexposed or under.  Even when properly exposed, they look overexposed on the screen (cannot adjust)so you don't know what you have.The twilight feature that takes pictures without a flash works well....and partially helps with pictures that would otherwise need a flash....but sometimes you just need a flashI find the touch screen cumbersome and not always responsive.I love the panorama feature.  It works very well.In summary, great for daytime pictures.  Otherwise, you are stuck..  Unacceptable for such an expensive camera.  Very very disappointing.", "Date": "August 7, 2011"}, {"Title": "wow", "Author": "Blake Hunter", "ReviewID": "RURQZPU10U8IS", "Overall": "5.0", "Content": "this thing is TINYfeatures all work GREATpix look good...even indoors at nightmain issue is the DATA port....is some weird special plug...u have to use it for usb or video...bulky....other than that so impressed!!!!....my gf got this one....i like it so much i'm ordering a black one!!", "Date": "July 29, 2011"}, {"Title": "Dissapointed.", "Author": "R. P. Najera \"Rochiz\"", "ReviewID": "R3EQMFYQBKJVQG", "Overall": "2.0", "Content": "I really wanted to believe in this camera. I really did want to think \"its a good camera\" BUT:Good Points:Night PicsWaterproof (dont want to risk it that much though)Bad Points:Pricey for a 10mpThe cute red painting started to peel off because of the hot weather, like a fu3\")% sticker.No Black and White PicsReceived it with a dead pixel. \"Ok, ok\", i said....I got it replaced and, again anooother dead pixel in the screen.Too much colorI got in xmas a nikon coolpix. cheaper,way cheaper, but MADE WITH QUALITY....and well....I guess ill change my likings.Bad Bad SONY!!.", "Date": "May 24, 2011"}, {"Title": "Works as advertised", "Author": "Reviewer1", "ReviewID": "R1MAHNKGSRCQJV", "Overall": "5.0", "Content": "I bought this so I could take pictures and video of my family while we went on trips expecially water related trips.I have taken it to 2 water parks so far and the product works as advertised. The camera takes pictures and video underwater and in water and the quality is amazing.In short, it's a great little point and shoot camera that works underwater and has a touch screen interface.", "Date": "April 26, 2011"}, {"Title": "Excellent Camera for the Size", "Author": "Detailed Shopper", "ReviewID": "R2WK95UKHB3UBZ", "Overall": "4.0", "Content": "Love the small size of this camera.  I purchased it for a trip to Mexico and used in underwater for snorkeling as well as in the pool.  Like the instructions said, I made sure to give it a soak in fresh water afterwards to clean it and had no problems.  It took great pictures and was easy to use.  I never thought I'd like the touch screen, but now prefer it over my other camera!  The panoramic sweep is also unbelievable! This is a great camera to throw in your purse and have with you at all times.", "Date": "March 16, 2011"}, {"Title": "Great Product", "Author": "Boomedoc", "ReviewID": "R2DHEVN08NYCWQ", "Overall": "5.0", "Content": "A very good product for a very reasonable price. The quality was good and it was as it appeared. Would recommend it to friends.", "Date": "March 5, 2011"}, {"Title": "Really worth it!", "Author": "Leandro Castilho", "ReviewID": "R2FFUCVCEAYOF9", "Overall": "4.0", "Content": "This camera is just amazing for the price it costs and for its portability. Until now I have not explored all its potential as I used to do with my old Canon A520 (which I still love!), but the features I have used worked really fine.PROS: super-portable, very good video image and handheld twilight function, which allows you to take fotos with low light. Large LCD screen and quick to recover between two fotos. Underwater feature brings extra fun for using the camera, with a really good imageCONS: to access USB connector you must open the battery slot. As I constantly plug my camera into a TV or computer, I am affraid this could cause damage to the slot and consequently let water into the camera. LCD screen should have a \"lock\" function, because sometimes you touch it and change camera functions without wanting to. As a camera to use underwater, it should also have a wrist adjustment. You should always be alert not to letting your camera fall into water.", "Date": "January 21, 2011"}, {"Title": "WONDERFUL CAMERA", "Author": "carebear", "ReviewID": "R1B3OELQDHHAXH", "Overall": "5.0", "Content": "Love this camera. It has lots of cool settings and is very light, portable and i don't have to worry about getting it wet or dropping it. Great product!", "Date": "January 20, 2011"}, {"Title": "Nice Camera", "Author": "R. J. Hoover", "ReviewID": "R34CX546PZ3XQS", "Overall": "3.0", "Content": "Portability great.  Love the panorama and macro features.  Only qualifiers:-  Have not yet taken it into the water to ocean testing.  Will therefore reserve judgement on waterproofing.-  Some minor view screen scratching after brief use.-  Good quality pictures for casual viewing however they don't handle enlargement well.  Tend to be a bit grainy.Update:Took it out for underwater testing to 100 feet (with marine pack).  Well pleased with picture quality for this price range cameras.", "Date": "December 31, 2010"}, {"Title": "Excelent!!!!!!!!!", "Author": "Jenny", "ReviewID": "R3UTVX2ESJ9RJ1", "Overall": "5.0", "Content": "I love this camera, is thin, pretty and also the pictures are terrific. underwater is good. Inteligent mode is perfect.", "Date": "December 11, 2010"}, {"Title": "Poor quality pictures in low light.", "Author": "Swankitty", "ReviewID": "R2CPFOT86PB7N1", "Overall": "4.0", "Content": "I have the Sony cyber-shot 10.1 VX DSC-N2 that I have had for about 4-5 years and it takes awesome pics at all times. I thought I couldn't go wrong w the newest waterproof version!The camera is great during the day and ok underwater. I do not like the quality of picture in low light. It also has a setting where it takes 2 pictures at one time and I can not get this setting to turn off.I'm sure I just need to sit down for a few hours a learn the ends and outs however just don't have that time!The older version was a simple point and shoot that made an amazing pic everytime! This new one caused me to miss a few candid shoes on my honeymoon : ( not happy for the price!Amzom did a wonderful job w selling and shipping! Very happy on that end!", "Date": "November 16, 2010"}, {"Title": "Great camera", "Author": "J. Hammerstein", "ReviewID": "R20MCE3GND7AW8", "Overall": "4.0", "Content": "So far this camera has worked as advertised.  The pictures are very good.  We got some great shots using the burst mode of our friends jumping off the high dive.  I'm impressed with the ease of taking panoramas and even having people who were moving still be in focus.  I also like the low light feature of taking multiple pictures and combining them instead of holding the shutter open.  The pictures in low light seem to be less prone to blur.We haven't actually used this camera underwater.  Not something I plan to do, but we did take it with us to a water park and had no problems.  I did store the camera in a case in any high speed rides...it was actually small enough to fit in one of those waterproof cases that one can wear around the neck.The touch screen in the back is great. Not as sensitive as an iPhone but good enough.  I did purchase one of those clear films to cover it to prevent scratches.The main con we've seen so far is battery life.  It drains it very fast.  We just purchased a second battery for it because of this.", "Date": "August 25, 2010"}, {"Title": "Great Sony camera", "Author": "Hayri Izgi", "ReviewID": "R2UJA5X896G7BK", "Overall": "4.0", "Content": "My girlfriend lovs this camera i purchased for her..She made extensive use of it in our recent trip..Very portable and easy to use..We havent tried the waterproof attribute but i have no doubt it works great..i recommend it..", "Date": "May 2, 2011"}, {"Title": "not waterproof", "Author": "cirrusdragon", "ReviewID": "R2SW7MWZJTMP0H", "Overall": "1.0", "Content": "leaked first time in the water at about five feet.  buy a canon, it has a better picture anyway.", "Date": "May 16, 2011"}, {"Title": "Buena Camara para llevarla a todos lados", "Author": "Alba J. Orama Torres \"Javier Ruiz\"", "ReviewID": "R212PLS4KYV3M6", "Overall": "4.0", "Content": "La camara Sony Tx5, es  ideal para llevar a todos lados. Tengo un hijo de 4 años y cuando la compre pense en el, ya que es resistente a los golpes y es divertida para usarla en la piscina. No me gusta mucho la calidad de la fotos, ya que salen saturadas en el modo automatico. Es muy sencilla de usar. Otro cosa nueva es la fotografia panoramica.Javier RuizUtah", "Date": "June 20, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Certified waterproof, dustproof, shockproof and freeze-proof\n3.0-inch wide touch screen for easy operation and viewing of images and movies\n10.2-megapixel \"Exmor R\" CMOS sensor for enhanced low-light performance\niSweep Panorama Mode captures stunning panoramic images; fast capture with 10fps at full 10.2MP resolution\nCard slot for optional Memory Stick Duo media and SD media", "Name": "Sony Cyber-shot DSC-TX5 10.2MP CMOS Digital Camera with 4x Wide Angle Zoom with SteadyShot Image Stabilization and 3.0 Inch Touch Screen LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41bJRIUS5WL._SX300_.jpg", "ProductID": "B00385XYU2"}}