{"Reviews": [{"Title": "It works...period!", "Author": "Carolin", "ReviewID": "R1DK70LQVVQYCC", "Overall": "3.0", "Content": "If the picture is taken very close to the object and underwater the resolution is good. But if I try to take a picture above the water has a very bad resolution, happens the same if the picture is taken underwater but far from whatever I want to photograph. The advantage is that are digital pictures but I would have preferred a better resolution above and underwater even though the price would be higher.", "Date": "May 4, 2011"}, {"Title": "It's a crap", "Author": "Shuping Lu", "ReviewID": "R315DQS2BPTR58", "Overall": "1.0", "Content": "The resolution is very poor.  I don't think any camera in such low resolution should still be made or sold, since adding a little bit more money you can buy a much better digital camera.  Even if it can go underwater, what's the value if you can't see a person's face clear?", "Date": "January 5, 2011"}, {"Title": "the case is waterproof, otherwise garbage", "Author": "Cory Johnson", "ReviewID": "R2XNJB9YRUYBEH", "Overall": "1.0", "Content": "Terrible resolution, tiny photos, a complete rip-off. You're better off with a one time use camera. Don't bother with this one.", "Date": "July 10, 2012"}, {"Title": "Not what was described", "Author": "alanlee", "ReviewID": "R1XSZY8KIT9SWA", "Overall": "1.0", "Content": "Camera is completely useless, can't load images to computer. Daughter cannot use or view images. No view screen to do so, need to provide more information when selling a product", "Date": "December 10, 2012"}, {"Title": "Caused computer problems", "Author": "LeeAnn R Scott", "ReviewID": "R34566JK35FIQQ", "Overall": "1.0", "Content": "The software that you are REQUIRED to install before you can pull the photos from the camera pulled every photo from my computer and none from the camera. When I deleted them from the program it deleted them from the computer, meaning that it had not only opened every photo, but it had moved them from their original home too.The images we finally got were grainy and blurry, probably because this is really just a cheap crappy camera in a plastic box. There's no underwater technology here, unless you count \"Plastic Box\".", "Date": "September 24, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Use in or out of the water\nCase is waterproof up to 30 Feet\nTakes up to 152 Digital Photos\nUSB Cable for Quick and Easy Download & Snap Shot Software", "Name": "Spongebob Squarepants Underwater Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/61s8RdFKX8L._SY300_.jpg", "ProductID": "B003FJGVG0"}}