{"Reviews": [{"Title": "Blue Christmas", "Author": "Podatide", "ReviewID": "RZDJYJTA287U2", "Overall": "5.0", "Content": "I got this camera two weeks ago (an early Christmas present for myself).  Last week I took it to Disneyland for its first big test, and I'm happy to report that it passed with flying colors.  The camera feels really good in my hand(s), solid, and ready.  It powers up quickly so I didn't miss a shot.  And the pictures were terrific in bright sunlight and in low light situations as well.  And when the sun went down and the Christmas lights came on, I was able to get some nice shots, handheld.  Image stabilization and auto-focus worked like a charm.  This is my first experience with a DSLR so I can't make comparisons (but a friend's new Canon was having difficulty focusing in low light); I can only say that this little camera is great!  And the price is hard to beat.  And the color?  Nothing else like it.  If blue isn't your thing, try green, orange, pink, etc.", "Date": "December 16, 2010"}, {"Title": "Pentax is often overlooked", "Author": "James R Chadek", "ReviewID": "R2CZYSRM5N52E4", "Overall": "5.0", "Content": "First know it uses AA batteries. You are never far from more. The 8x Energizers have lasted more than 800 pics so far.Easy lens swapping from earlier K mounts gives you a great base.Great for point and shoot or technical set your self work.Way more camera for the money than the department store Canon or Nikon.A 5 star all the way around. The second one I have gifted.", "Date": "December 29, 2010"}, {"Title": "Love the color...very nice camera", "Author": "Y. Wang \"yy\"", "ReviewID": "R1LBLICJWTJ7D2", "Overall": "5.0", "Content": "I bought it from another retailer. Really love the blue, which makes the camera special in your hands! The features and performance are great.", "Date": "December 23, 2010"}, {"Title": "very impressing color", "Author": "buckfisheye", "ReviewID": "R1HFTRJ8E3WV7H", "Overall": "5.0", "Content": "Don't worry the color would peel off, it look pretty firm and nature on the camera which makes the camera fashioned", "Date": "November 16, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Box Contents - K-x camera, smc DA L 18-55mm Lens, USB Cable, Strap, Hotshoe Cover, Eyecup, Body Mount Cover, AA Batteries, Software\nHigh resolution 12.4 megapixel CMOS image sensor features sensor-shift\nLarge 2.7 inch LCD features Live View with contrast, phase difference, and Face Detection autofocus (up to 16 faces)\nCapture widescreen HD video in full 720p resolution (1280x720) at 24 FPS cinematic framerate, using any PENTAX 35mm lens\nPowerful automatic modes, including PENTAX Auto Picture and scene modes,\nShake Reduction for stabilized image and video capture up to 4 stops max\nEnsures the perfect shot in any situation, while helping new photographers learn DSLR photography", "Name": "Pentax K-x 12-Megapixel Digital SLR Camera Kit/1 - Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/51701ak9XhL._SY300_.jpg", "ProductID": "B003QZV18Q"}}