{"Reviews": [{"Title": "Very Good Trail Cam", "Author": "Dave T.", "ReviewID": "R3PY5JMBF5EC4M", "Overall": "4.0", "Content": "I have a Bushnell Trophy Cam and got disgusted with all the photos that were either missed because of the trigger speed, or you just got the end of the animal.  On most of my Reconyx photos, it triggered right away, although on a couple it seemed like it should have picked it up earlier.  Haven't figured out why yet.  I also got a sequence of night photos on the Reconyx of an animal I couldn't recognize due to motion blur.  Don't know what caused that since it didn't happen on any of my other photos.I saw one review where it was said that the Trophy Cam took better photos than the Bushnell.  True the Bushnell can take them up to 8 megapixel, while it is 3 on the Reconyx.  But megapixels is only one factor in image quality, and usually only if you are going to do alot of photo editing on the jpeg images or if you are going to produce large prints.  I would prefer a 5 megapixel because I do editing and would make framed prints if I got a photo I really liked.  I use the trail cams not for tracking game for hunting purposes, but because I like wildlife and want to see what is roaming about on my property.A few points:- the HC600 has a black light for IR, so you can also use it as a security camera, which is one reason I purchased it.  You can get the HC500 for $100 cheaper if you take the standard red light IR.  Actually the HC500 has better flash range.  Other than the IR, the 2 cameras are identical.- get a good quality SD card like Sandisk.  8 gigabyte is plenty for me.  Definitely get a Class 10 card though.- I've had the camera only for 6 weeks or so, but am having problems with the Tenergy premium rechargeables that are recommended by Reconyx.  They discharge much too quickly.  I got no satisfaction from Tenergy customer support - they wouldn't make it right.  So I would recommend Sanyo Eneloop instead - expensive but worth it.- Check out other sites for pricing.  The price is about the same everywhere, but with some sites you get 1 or more free accessories such as batteries/charger or a security box.- One complaint I have is that the photos contain info lines at both the top and the bottom, and no way to make them optional as you can do with other trail cams.  The bottom info line also has the name \"Reconyx\" on the lower line, which I thought was tacky to have forced advertising on your photos.- These cams don't do videos, which I also would have liked.", "Date": "July 25, 2012"}, {"Title": "Night Range is Limited", "Author": "Dane", "ReviewID": "R3TWEMK20XYZ6B", "Overall": "3.0", "Content": "I've had this camera for almost a year now and I'm still on my first set of lithium batteries.  The quality is apparent when you hold it in your hand and after a year out in the weather it still performs like it did when new.The motion sensor and fast trigger speed do help to catch game that's moving quickly but like any camera working in low light the animal is blurred by the slow shutter speed.  Daytime pictures are clear and can capture animals that are moving without blur unless they are moving quickly.My only disappointment is the night time IR flash range.  There is no visible glow even when looking directly at the emitter but the advertised night time range is very optimistic.  Like any trail camera it does better if mounted in an open location where sky glow or moonlight can help illuminate the scene.  If you have it deep in the woods animals at 50 feet are just glowing eyes.  At 30+ feet you get a ghostly image that leaves you generally identifying the animal by size and outline.  At less than 30 feet details start to appear with the image getting better the animal gets.  Placing the camera in a clearing, with open sky above, will get you the 50ft advertised range especially if there is a full moon.", "Date": "June 9, 2012"}, {"Title": "Can't get any better than this", "Author": "RGJ \"R. Gordon Jones\"", "ReviewID": "R3GK43KCYNZKW8", "Overall": "5.0", "Content": "I was looking for a quality deer cam and this is it. It's U.S. made and uses a CMOS sensor like the high end digital camera's. Picture quality is outstanding and pictures taken in complete darkness look like quality black and white photos. I mounted this camera in my back yard to do some test shots and was very surprised at the results. If you are looking for a quality trail camera and don't mind spending a few dollars more than the China made junk. This is the camera for you.", "Date": "November 6, 2011"}, {"Title": "Reconyx HC600", "Author": "P. Riley", "ReviewID": "R2SF5K2XDPTSPE", "Overall": "5.0", "Content": "I'm glad I read all of these reviews. I was thinking about getting a 2012 Bushnell, but after the reviews - no way. I own two Reconyx Cameras, a Rapid Fire MC60 HO and the new Hyperfire HC600. Both are GREAT cameras! I have used the MC60 HO for four hunting seasons with no problems and the HC600 is just as good. Matter of fact I strapped a Moultrie and Reconyx to the same tree, set both on 1 pic with a one minute delay over corn pile. Reconyx took over 1000 pics, Moultrie took less than 300. You get what you pay for. I did have to send my new HC600 in for a problem. I got the camera back within 10 days of the date I shipped it and they answered the phone when I called - answered all of my questions and even gave very techinical instructions and advice on how the camera works and how to set it up. The best customer service by far. Buy a Reconyx and you WILL SEE WHAT YOU HAVE BEEN MISSING. It is worth every penny!", "Date": "October 1, 2012"}, {"Title": "Exceeded Expectations", "Author": "RJD \"23456\"", "ReviewID": "R30W1JQLQX7FDB", "Overall": "5.0", "Content": "Have had the camera for 3 weeks.  Item arrived within a few days.  It is a VERY easy camera to set up compared to others I have used.  It does not have any extraneous plugins etc.  No power or camera plugs which I don't mind.  You must take the card out and insert into another devise to see the pictures.  I have no problem doing that with my laptop or camera in the field and in fact prefer this method since I just switch out cards.  Easier to review pictures at my leisure than standing out in the woods squinting at the little hand held screen I have for some other cameras.It appears to be very well built.  The door has a rubber insert to help with a weather-tight seal.  I rub a little vegetable oil on it to help, which I do with most seals on my various equipment.  Veg Oil works with other outdoor items and I expect it will work on this.  The camera has already sat out in very sever thunderstorms (3+ inches of rain) without effect on operations.Pictures are very good, day and night.  Clear and sharp IMO.  I am not looking for publish quality photos.  If you are, then these cameras (and most others) are probably not good for you.  I just need to see what is out on the property.  I measured 20, 40, and 60 feet and placed range markers.  I have pictures past the 40 foot marker of deer walking through at midnight during a new moon.  Vey clear photos.  I am anxious to see if I will get anything out to 60 feet.  Especially two legged creatures.If this camera holds up well for the next year or two, I think I will have found my long term camera supplier.  I have 5 other cameras, 3 no longer function and the other 2 are just not as easy to work with as this one.  The trigger is very fast and I get great shots.  I get blank shots with one of my other cameras; it is that slow.Apparently no reaction to the flash either.I like this camera a lot.  If it works well over the next hunting season, I may go for one of the remote transmission types in the future.", "Date": "June 16, 2013"}, {"Title": "Still not as good as the Reconyx RC60", "Author": "Shaun", "ReviewID": "R3PGL9PXISK9SE", "Overall": "3.0", "Content": "I bought this camera thinking that it would be the best trail camera out there and in my opinion it's not. I Gave it 3 stars for the quality, size, design, all are outstanding. I have used the camera all through this season and compared it to my other two Reconyx RC60's that i have had for years and find to be awesome trail cameras. In my comparison was the HC600 picture quality was not as good as the RC60, i found it did not capture as well as the RC60, the digital screen at 25 degrees above zero would be scrambled and hard to read the RC60 at 20 below zero was still perfect just a little slower, the HC600 door freezes shut at the top making it hard to open without shifting it off target the RC60 never a problem. I think Reconyx cameras are great cameras but something somewhere has changed what that is i don't know, i think i will keep my eye out for those few used RC60's that are out there and pop up from time to time and buy them and in my opinion the Reconyx RC60 is the best trail camera for the money ever made.", "Date": "November 22, 2012"}, {"Title": "Good, but not great.", "Author": "Art Vandalay", "ReviewID": "R3624SO44E08SU", "Overall": "4.0", "Content": "My wife bought me one of these after I tried a couple cheaper cams and was unimpressed with the results.  The Reconyx HC600 was far better than the ones I tried before, but for the price I'm not all that impressed with the picture quality. That said, picture quality is adequate for my use which is to see what deer are walking by my stand areas.  It doesn't miss many pictures and overall I like the camera.  Too expensive for me to buy a couple more (which I want to do)and like I said, for the money I thought the pic quality would be better.  Looking at some other cams now.", "Date": "June 3, 2012"}, {"Title": "Reconyx HyperFire Infrared Digital Game Camera HC600", "Author": "James Sohn \"Jim Sohn\"", "ReviewID": "R6K6VOIVW7DSS", "Overall": "5.0", "Content": "Exceptional product. Have used it every day since purchasing on December 10th 2010. Getting great pictures both at night and day.", "Date": "January 29, 2011"}, {"Title": "Great Product!", "Author": "R395", "ReviewID": "RWJJTQ8CIO8S", "Overall": "5.0", "Content": "This product is easy to use and it sets up quickly. I would highly recommend this product to anyone who wants to keep watch on animals in an area.", "Date": "June 14, 2013"}, {"Title": "What isn't to like?", "Author": "Ed", "ReviewID": "R1NB4NRVXGKH70", "Overall": "5.0", "Content": "I received this camera almost a year ago now for a Christmas present.  The camera has worked flawlessly for about eight months straight.  I am using energizer lithium batteries and they are still at 99% battery life.  99% with eight months of continuous use! I have my camera set on a 3 shot burst mode with a second interval between the 3 burst shots, and a one minute down time until it can be triggered again if anyone was wondering how the batteries are still trucking along so nicely. Though, I haven't used it during winter yet and the coldness always has an effect on battery life so I am interested to see what will happen as we are approaching it.  The camera rarely ever gives me false triggers and gives crisp images.  I would definitely recommend the camera if you have the money.  You definitely get what you pay for, and I believe it is worth it. My uncle has two of the HC500 models and neither of us have encountered any problems with them.", "Date": "December 10, 2012"}, {"Title": "This is a great game camera...", "Author": "Rudi", "ReviewID": "R3PP20XO1VUWRB", "Overall": "5.0", "Content": "No flash, takes a lot of pictures with very little battery drain. The night pictures are of good quality, the day pictures are really good. Highly recommend this camera.", "Date": "January 17, 2014"}, {"Title": "Excellent day light trail camera, only fair as a night time camera.", "Author": "Steve Williams", "ReviewID": "R3LXQTOE58DS3R", "Overall": "4.0", "Content": "I spent the big bucks on this to have a good camera to let me know when deer and pigs show up at my feeder.  Once the sun is out, I get solid images.  Downside is that at night it switches to infrared, and the built in infrared light is poor at best.  Anything more than about 8 feet away is pretty much not visible in the images.  To get the most out of this I am going install multiple solar powered green LED lights so I  can see what is showing up.", "Date": "January 14, 2014"}, {"Title": "Best of the trail cameras", "Author": "NoSpam", "ReviewID": "R21D9U5DAI3Q25", "Overall": "5.0", "Content": "They are expensive, but I've switched to these from the Bushnell Trophycams.  Bushnell doesn't seem to have any parts for their cameras, such as the door gaskets, which will of course eventually go bad and leak water into the camera.The Reconyx triggers faster, has better picture quality and doesn't have visible LED flash.  And I know I won't be throwing it out in 3-4 years because of a $1 gasket.", "Date": "September 11, 2013"}, {"Title": "Just what he wanted!!", "Author": "Belinda Melson-Kennedy", "ReviewID": "RN8ZO0BVT9VMH", "Overall": "5.0", "Content": "I bought this for my husband and he loves it!!  Very high end so if you are tired of poor performance out of the cheaper made game cameras, this is for you!", "Date": "March 23, 2013"}, {"Title": "Updated review", "Author": "Gary Stonge \"GSO\"", "ReviewID": "R33SNOOTJTV43H", "Overall": "3.0", "Content": "I have a Bushnell trail cam and figured I would try this unit because of the faster trigger speed and stealth flash. The trigger speed is fast, but the picture quality is not good and does not compare to the Bushnell.I contacted the factory and they were pleasant to deal with and quick to respond. They suggested different settings, none helped improve the picture quality. The camera just does not take clear pictures - day or night if any object in the field of view is moving. The pictures are blurred with any movement - forget trying to read a license plate. It may be the 3 mega pixel camera is not enough.Update - I did not return the camera and I have had this camera in operation now for 2 years. It has performed well. I have a total of 3 cameras, 2 are Bushnell's. One of the Bushnell's that is the same age has failed - takes continuous pictures so it is back for repairs. If the Reconyx picture resolution was better it would unquestionably be the best camera, even though the cost is quite high. At this point if I were to buy another unit, I would choose the Reconyx.", "Date": "December 28, 2011"}], "ProductInfo": {"Price": "$549.99", "Features": "Infrared\nRechargeable Battery\n3.1 Megapixel Camera\nCodeLoc Pass-Code Protection\nMade in the USA", "Name": "Reconyx HyperFire Infrared Digital Game Camera HC600", "ImgURL": "http://ecx.images-amazon.com/images/I/51noQ9KiwzL._SY300_.jpg", "ProductID": "B003K230GQ"}}