{"Reviews": [{"Title": "Not bad while it worked, but had problems", "Author": "Compdoc", "ReviewID": "R3NIGEWTP9W2SC", "Overall": "3.0", "Content": "I used this camera to watch through the front window to the street and sidewalk in front of the house. I worked well for 1.5 years, and then it died. It's webgui was ok, and let you setup the important features of the image and control things like the IR leds.But it did have problems: It's IR leds, being under the dome next to the lens, would reflect back to the lens from the dome so that they obscured the recorded image. And without the IR leds this camera can see nothing in the dark, so I was never able to use this camera to record during the night. However, I've found that led reflection from the dome is a common problem with dome cameras that have their IR leds arranged next to the lens.One other thing I didn't like about this camera was that it has a large, green power led that is lit all the time. This gives away the camera's location at night, and in my case, also reflected back to the lens from the glass window it was looking through. I had to cover the power led with tape.", "Date": "June 25, 2013"}, {"Title": "Do not buy - no after warranty repair available", "Author": "DS", "ReviewID": "R3KVTOIQECEOFF", "Overall": "1.0", "Content": "I have a DCS-6620G and DCS-5300G. They both developed minor problems shortly after the 1 year warranty ran out. The DCS-6620G ethernet port failed and the DCS-5300G pan capability failed. I called DLink tech support and they told me that they will not repair these products or exchange them after the warranty, and that there are no authorized service centers. I escalated through 3 levels of tech support and then to US customer support and was given the same story and no way to get them repaired. The customer service lady stated that this was their policy on all products. They expect you to discard your $800 camera and buy another one. I recommend you don't buy any DLink product costing more that $100 - $200 as they are not very reliable and are disposable once they fail.", "Date": "October 6, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003ZUSKBI"}}