{"Reviews": [{"Title": "Great for the Price", "Author": "Annie K.", "ReviewID": "R3IC7Q4ZNF3GXV", "Overall": "4.0", "Content": "I honestly loved this camera, and I was so pleased with the way my pictures turned out.  The first one I bought had a manufacture defect (it wouldn't read my SD card correctly.)  I bought it from Best Buy and they exhanged it hassle free.  I never noticed a bad lag, and I thought the colors of the pictures always turned out stunning (I'm not really a photographer so when a camera makes my pictures look good, I'm always excited.)  The zoom was fair, and the camera didn't function well with low light.  It has some really fun built in features, like fish-eye.  I didn't like the software that came with it, I prefer to just transfer pictures from my SD card.", "Date": "November 26, 2010"}, {"Title": "Fragile. Horrid Battery.", "Author": "James S. Leseke \"lesekejames\"", "ReviewID": "R3C7PAORGEIU4R", "Overall": "1.0", "Content": "In two years I have gone through three of these little cameras. For the most part they have rested in either a backpack or a roller. But no matter where they have resided, the zoom lenses have died an ugly death. They zoom out and just stay that way, refusing to budge. The last one, a brown unit, just died for no apparent reason. Granted the battery door snapped off early on, not a good sign, but since the door was only partially gone, a scotch tape repair got the unit back in the fight.It was then I decided that this brown Fe would be the last I would buy. The unit eats through its rechargeable battery like there is no tomorrow. The focus is dodgy as all get out and set up is slow. Flash photography really chews through the battery whilst having a painfully slow recharge. Finally the Fe uses an oddball propriety USB cord. Yes, you can get an aftermarket cord from Amazon, but really, why the mondo-bizzaro cord? I hate having to fish out that cord and making sure It's correct. Almost every other manufacture uses a Mini-USB, why depart from the standard other than to pry a few more shekels from unwary consumers?Even at $80.00 the Fe is a poor buy. I only works if you are a very casual photographer who seldom actually uses the camera, and even then you are cursing because the dang battery has expired after a few flash shots.", "Date": "April 16, 2013"}, {"Title": "Olympus FE-4020", "Author": "Paul", "ReviewID": "R1TSHPOSJ24NT5", "Overall": "5.0", "Content": "I am a home inspector and need a camera light and compact for my job, this camera takes remarkable clear pictures with adjustment on the fly to close up shots and in dark places.I would recommend this camera to all my friends and I would always use Olympus in the future.", "Date": "October 16, 2011"}, {"Title": "ehh ..", "Author": "Jay", "ReviewID": "RC3MCWX43AUCM", "Overall": "3.0", "Content": "Before I purchased this camera, I had a Fujifilm. I don't know which make/model it was however. This camera is nice especially for the price I bought it, don't get me wrong. BUT! No matter how stable the camera is, pictures almost always come out blurry/pixelated. It's very frustrating, I did have an older and bulkier Olympus some years back and it did the same thing. Maybe it's their brand. It does have a lot of fancy features, but those don't really interest me. Pointing and shooting is simple enough for me. But it is a nice sturdy camera, but I wouldn't recommend it.", "Date": "May 23, 2011"}, {"Title": "looks aren't everything", "Author": "leahbia", "ReviewID": "R1BSJIMW3B0WR0", "Overall": "2.0", "Content": "This camera looks great when you first take it out of the box. It's sleek and the color I chose (gray/brown) gives it a nice modern feel. I bought this camera as an upgrade from an 8.1 mp sanyo and figured the increase in mega pixels alone would give me better pictures  but I was wrong. Pretty much every picture I take is blurry or sketchy. I've tried adjusting the settings like using the anti-blur mode or increasing the image size but nothing seems to help. Pretty much every picture looks like the photographer was running and jumping while shooting. Even when placed on a flat surface for timed photos the pictures come out blurry. I'm no expert photographer but this isn't a super high class camera either. It can't even produce decent photos for Facebook. Definitely disappointed, I'm getting rid of mine asap.", "Date": "May 15, 2011"}, {"Title": "Poor quality photos", "Author": "stekib", "ReviewID": "R1TUQAZPP8E5J", "Overall": "1.0", "Content": "This camera was purchased to replace a Sony 5 MP camera. I assumed that 14 MP would completely blow my old camera out of the water. The only reasonable pictures I get are in full light. In full automatic mode, the color rendition is poor. Therefore, it must be set to sun, incandescent, or fluorescent for every change in lighting. The old Sony performs much better than this camera. Now looking for a replacement for this cheap Olympus camera.", "Date": "December 28, 2010"}, {"Title": "so-so", "Author": "vik", "ReviewID": "R5ZBGE93QX9H9", "Overall": "2.0", "Content": "very hard to use out of doors, which is why i like viewfinders. i snapped about 50 shots from a seated position, without viewing them, and many were not reallysharp. I have a 6mp argus, also point and shoot, and it gives me sharper images.I bought this one to take to a wedding because it fit in my suit pocket.", "Date": "August 29, 2011"}, {"Title": "Horrible", "Author": "SStrickland", "ReviewID": "R3IAK6O9HBELWN", "Overall": "1.0", "Content": "I never leave reviews but this camera is so awful I have to. It takes horrible pictures, not one of my pictures has ever turned out completely clear. Looks and feels cheap also. Horrible camera!", "Date": "July 1, 2011"}, {"Title": "Quality issues", "Author": "Gracie0204", "ReviewID": "ROPFFVKHVBD8H", "Overall": "1.0", "Content": "I got this camera for Christmas and used it quite a bit. I had issues with blurry photos - especially in the woods - which is odd because it wasn't like anything was moving. Now the camera lens won't open - it just decided to stop working. I have had a Cannon with only 4 megapixels that lasted forever and is really durable. I don't think this camera is a good quality product. On a side note - I hate the software for downloading the pictures - it is too facebooky for me.", "Date": "June 3, 2011"}, {"Title": "The engineer who okayed this needs to be fired and barred from the profession", "Author": "Joseph C. Cavaleri", "ReviewID": "R1CY98TMWT23QB", "Overall": "1.0", "Content": "I purchased this on special- an impulse buy to be sure- because I needed a high megapixel count for my side gig as a graphic designer. I didn't need an exemplary camera because it would all be changed with Photoshop.... however this is a tragic waste of precious minerals and plastic.Echoing someone else' review: The Olympus FE-4020 can't take a clear picture in moderate lighted situations (such as a very brightly lit room). I took fourteen photographs with varying settings, yet only four came out clear. That's a 29% success rate- if I'm generous and round up!Almost worst is the way the light sensors render the image 'photographed'. (In semiquotations because there is no way any halfway serious photographer would consider what this thing creates photographs.) There is a very slight, but noticeable, sphereing effect to the images produced. I took a 'photo' of my laptop and saw- much to my surprise- its body arc up and down in ways the body doesn't actually do! In another photo the sphereing effect is more drastic due to the perspective. A perspective that is typical enough to shoot at regularly. It's almost reminiscent of an amateurish 3D-render from 3D Studio Max in 2003- but it's an image of a real thing in real space and not formed within a computer.Let me summarize: My iPhone 3G camera shoots better, sharper, pictures at 2-megapixels than this Olympus does at 14-megapixels at drastically smaller filesizes. 500 KB vs. 2.50 MB. That's beyond pitiful.This camera is going back tomorrow!", "Date": "May 24, 2011"}, {"Title": "Calidad de Olympus", "Author": "robin perez", "ReviewID": "RI6GZ43BSVTRT", "Overall": "4.0", "Content": "Olympus se diferencia por la calidad de su imagen. La observación sobre el producto es lo delicado de la cámara, hay que manejarla cuidadosamente", "Date": "May 1, 2011"}, {"Title": "Ok for the money", "Author": "Mcgregor R. Pearce \"Mr. Mac\"", "ReviewID": "R1LCQ1QTFPPLU6", "Overall": "3.0", "Content": "The camera worked just fine, until my daughter got sand in it and it died. Too bad the battery didn't fit  my other Olympus cameras.  I wish someone had told me.", "Date": "October 21, 2010"}, {"Title": "I received a LEMON!!!!", "Author": "KW", "ReviewID": "R334O9NLBZR1EQ", "Overall": "1.0", "Content": "I got the product home and it looked cheap. It looks a lot sleeker online. That aside, I put the battery in and tried to charge it so I could see the picture quality. Wouldn't turn on. I tried everything. Was disappointed.", "Date": "June 12, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0031RGEOK"}}