{"Reviews": [{"Title": "Great waterproof camera!", "Author": "Corey B. Myers", "ReviewID": "RMUL0JJRLK1IH", "Overall": "5.0", "Content": "I read just about every professional review I could find for waterproof digital cameras, and I was just about set to buy the Panasonic DMC-TS1 until I saw a number of user-reviews that said the TS1 leaked for them in saltwater. I wanted a camera that I could use for snorkeling, so this was a concern until I saw the release of this Panasonic DMC-TS2 with greatly improved \"toughness\". It is now waterproof to 33 feet along with being shockproof and freezeproof, so I jumped on it. Canon makes a really nice waterproof camera too (Canon D10), but the Panasonic TS2 has similar picture quality (these two cameras are ahead of the pack in this category)and is MUCH more pocketable and attractive. I love that this camera looks like a regular compact point-and-shoot, is very rugged and waterproof, is pocketable, takes great pictures, has a 4.6x optical zoom, and a ton of other features I won't even get into.When I first got the camera, I took comparison pictures with this camera, an old Canon SD200, and my newer Fujifilm F200EXR. This camera far exceeded the old Canon and was very comparable if not better at some pictures than the very good Fujifilm. Ok, that was a good start, now to see how it holds up in the saltwater for several hours every day on a Caribbean cruise...After a week of snorkeling, no leaks whatsoever!...I was planning on just bringing this camera when I go to the beach, go to the pool, go flyfishing, and go on backcountry skiing trips, but after taking close to 1000 pictures last week on my Caribbean cruise (about half of them underwater, and down to about 20 feet), it just might have become my everyday camera as well!If you need a rugged, very waterproof camera, that is still small enough to go everywhere with you, AND takes great pictures, I would definitely recommend this one.Oh, and if you will be snorkeling or boating, I would recommend the Olympus Floating Camera Strap. It worked perfectly with this camera.", "Date": "May 11, 2010"}, {"Title": "Excellent underwater video and photos, but note a few important exceptions", "Author": "holamateo", "ReviewID": "R1M7IC9KT9AOCI", "Overall": "4.0", "Content": "I have been very happy with the image and video quality of the Lumix TS2 and it seems very robust so far.  The underwater video quality is just stunning.  I'm glad I did my research first as I learned from others mistakes before using my camera.  Here are a few things you might want to watch out for.1. All waterproof cameras will leak if you use them carelessly.  Never open up the camera doors when at the beach or pool.  Make sure to take it home, dunk in water, clean it off, let dry off, in order to keep sunscreen and sand out of the gaskets, etc.  If you try to swap cards while at the beach with greasy sunscreen and sand covered fingers, you're likely to compromise the sealing gaskets and ruin your camera, regardless of brand/model.  I loaded mine up with an empty 8GB card and full battery before going out so I don't have to worry about anything.  If you're like me and never read manuals, at least make sure to carefully read through the care and maintenance section so you can avoid ruining your camera.2.  The included paper manual is very sparse and does not explain all the icons or photo+video settings - but it does cover care and maintenance (read this section as mentioned above).  You have to download the pdf manual from the Panasonic site to learn the full features of the camera - features like below item #3.3. Unless you're a pro videographer, change your video settings from AVCHD Lite to Motion Jpg.  See pg 92 in the pdf manual.  AVCHD is a format made for pro cameras, which is great if you are a videographer  But I've read about lots of frustrated TS2 users online who just want to view their movies or upload them to Youtube without needing lots of specialized software and training.  Save yourself the hassle and change to .mpeg BEFORE taking lots of video and life will be simpler.4. If you just want to point and shoot and not touch settings, set the dial to iA and the camera does a good job at taking care of everything for you.", "Date": "June 19, 2010"}, {"Title": "Great HD Video For Such A Small Camera!", "Author": "Michael Trotman", "ReviewID": "R1MD7OT27L1HM8", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3NNMAH6MI4ADGembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3NNMAH6MI4ADGrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3NNMAH6MI4ADGchiDiv\").innerHTML = document.getElementById(\"cv_mo3NNMAH6MI4ADGhiddenPre\").innerHTML;\n};\ncv_mo3NNMAH6MI4ADGrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3NNMAH6MI4ADGso;\t   \n\n\nfunction cv_mo3NNMAH6MI4ADGloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3NNMAH6MI4ADGso = new SWFObject(swfLocation, \"cv_mo3NNMAH6MI4ADGAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3NNMAH6MI4ADGso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3NNMAH6MI4ADGso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3NNMAH6MI4ADGso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3NNMAH6MI4ADGso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3NNMAH6MI4ADGso.setAttribute(\"height\", swfHeight);\n          cv_mo3NNMAH6MI4ADGso.setAttribute(\"width\", swfWidth);\n          cv_mo3NNMAH6MI4ADGso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3NNMAH6MI4ADGso.write(\"cv_mo3NNMAH6MI4ADGflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3NNMAH6MI4ADG', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3NNMAH6MI4ADG';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3NNMAH6MI4ADG', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3NNMAH6MI4ADGloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3NNMAH6MI4ADG\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1L9M5V1EHRAF3\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1L9M5V1EHRAF3\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1MD7OT27L1HM8\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1L9M5V1EHRAF3/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3NNMAH6MI4ADGduration')) {\n      document.getElementById('cv_mo3NNMAH6MI4ADGduration').style.display='none';\n    }\n    cv_mo3NNMAH6MI4ADGloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3NNMAH6MI4ADGloadSwf(movieID, playerVersion) {\n   return _cv_mo3NNMAH6MI4ADGloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3NNMAH6MI4ADGnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3NNMAH6MI4ADG', 0, h);\n}\n\nfunction cv_mo3NNMAH6MI4ADGresetPlayer(w,h,bw,cc) {\n  cv_mo3NNMAH6MI4ADGnewHeight(h);\n\n  cv_mo3NNMAH6MI4ADGso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3NNMAH6MI4ADGso.addVariable(\"cacheCode\", cc);\n  cv_mo3NNMAH6MI4ADGso.setAttribute(\"height\", h);\n  cv_mo3NNMAH6MI4ADGso.setAttribute(\"width\", w);\n  cv_mo3NNMAH6MI4ADGso.write(\"cv_mo3NNMAH6MI4ADGflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3NNMAH6MI4ADGRollOverImg = new Image();\ncv_mo3NNMAH6MI4ADGRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81go33MA0JS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3NNMAH6MI4ADGpreplay = document.getElementById('cv_mo3NNMAH6MI4ADGpreplayImageId');\nif (cv_mo3NNMAH6MI4ADGpreplay) {\n  cv_mo3NNMAH6MI4ADGpreplay.onmouseover = function() {\n    cv_mo3NNMAH6MI4ADGpreplay.src = \"http://ecx.images-amazon.com/images/I/81go33MA0JS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3NNMAH6MI4ADGpreplay.onmouseout = function() {\n    cv_mo3NNMAH6MI4ADGpreplay.src = \"http://ecx.images-amazon.com/images/I/81go33MA0JS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3NNMAH6MI4ADGpreplay.parentNode;\n\n  var cv_mo3NNMAH6MI4ADGcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3NNMAH6MI4ADGcurrentClick) {\n      return cv_mo3NNMAH6MI4ADGcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:35 MinsThis is a quick video taken by hand while standing on a moving boat.  The video is stable, clear, and vibrant.  I gave away my video camera recently because with a 32GB memory card I can now take hours of video with the Panasonic Lumix DCM-TS2.  I love this camera!  Waterproof, shockproof, dustproof, great photos, and video.", "Date": "June 19, 2010"}, {"Title": "Panasonic Lumix DMC-TS2", "Author": "Eric Jain", "ReviewID": "R3E1L8OE21FAFM", "Overall": "4.0", "Content": "Received this as a replacement for a DMC-TS1 that died while snorkeling. The waterproof latches on the DMC-TS2 look more reliable, and a silicone jacket that can be pulled over the camera is included. We'll see if that helps...Like its predecessor, the picture quality is as good as can be expected from a compact camera. The movie quality is better than expected. The image stabilization appears to have been further improved, and while low-light pictures can still end up fuzzy, it helps a lot when recording movies, especially when zooming.The sliding zoom button (which had taken me a while to get used to) has been replaced with a (more common) toggle button. The buttons and menus in general are simple and straightforward (i.e. no more tedious than on other cameras I've used). The only thing I don't like too much is the mode dial wheel, for which I don't have much use, and which can be turned inadvertently.I like the folded lens setup and the quick start-up and shut-down. Unlike with the DMC-TS1, you no longer need to press the power button for several seconds to get the camera to turn on. The high-pitched noise that the DMC-TS1 emitted while turned on is gone as well. Like its predecessor, the DMC-TS2 feels solid and well-built (but a bit on the large side, compared to some other compact cameras).In any case, this camera will be with me on all my future outdoor trips!", "Date": "April 30, 2010"}, {"Title": "Put to the test-Great camera", "Author": "William D. Feffer \"The Bill\"", "ReviewID": "R1ON6KMJAWQBMT", "Overall": "5.0", "Content": "After reading dozens of customer and technical reviews I chose TS2 (blue version). The price was a little higher than some of the competition, but after taking about 1,000 pics in and out of the water in Huatulco Mexico and under all kinds of conditions, I am very happy. I'll state my only negative first. I was not really happy with the quality of the underwater photos taken while snorkeling, but it was not entirely the camera's fault. The water was pretty rough so it was cloudy and it was really tough to hold still enough to frame the shot much less not move the camera. I found that the anti-shake worked very well in other circumstances however. I tried the Sports mode underwater and that helped some. I did get some really nice shots in calmer waters.Above the water I was amazed at the exceptional quality the camera produced. I used it in all kinds of conditions. We were on the beach, on the ocean, in remote villages, inside of buildings, in the rain and in the jungle. I even got blasted by a couple of big waves. There are almost no bad shots caused by the camera. I tested it with all kinds of setting combinations.I found the controls very easy to set whether underwater, during the day and even at night. There is a wide range of settings in all of the modes except the Intelligent Auto mode which senses the conditions and makes the right choices anyway. It seems to have a great dynamic range even when not using the feature designed for those conditions. I was able to change settings almost as fast as I could think about it. For example, I could turn on and off the forced flash faster than I could say smile. I did not test the shock-proof feature, but it gave me a lot of peace of mind.The LCD was very bright even in the day and underwater. I was able to keep the brightness at the default level. It lets you turn it up, but that will consume the battery more quickly. The first day out, I only got about 200 shots before the battery died. After turning down the LCD and turning off the Auto Review, I went a whole day without exhausting it. I had to learn to keep my fingers out of the lens at the top left of the camera, but a different grip solved that issue. I made a couple of video clips and was very pleased with the quality.Playback is as easy as plugging into a TV. It even does a slide show with music. The supplied USB cord makes downloads easy. It is a very substantial and attractive camera even wearing the supplied silicon skin. It fit in my pocket nicely. It turns on faster than you can compose a shot and there is very little shutter lag if any. I have been a professional photograper for a lot of years. I rate this camera very highly in spite of the higher price.", "Date": "June 17, 2010"}, {"Title": "THE PERFECT ACTION CAMERA", "Author": "NeuroSplicer", "ReviewID": "R1IVT5APM3KOFR", "Overall": "5.0", "Content": "In brief: if Batman had a camera, this would be it!I was looking for a camera I could take with me to the beach or rafting without ever worrying about it. I wanted something I could drop in a backpack, leave it on the sand and take it in the sea without giving it a second thought. By now I am a satisfied PANASONIC/LUMIX customer, ever since my favorite FZ28K (the most convenient creativity camera) and my trusted TZ8 (the perfect city-tourist camera).So, when, after all the research it came between this camera and the Olympus Stylus Tough-8000, I showed some brand-name loyalty and went with the LUMIX. And the important thing is that I never regretted it.This camera comes with a very bright wide-angle 28mm Leica lens which is optically stabilized, capturing on a 14.1MP sensor and an adequate 4.6x zoom (128mm). Typical for a LUMIX, it has a working intelligent Auto (iA) setting that gives you a piece of mind: perfect photos every time, without having to fidget with the settings.Departing from the auto settings, the camera offers almost 20 shooting modes, 5 color modes, 6 focus modes and decent aperture range (f/3.3 to f/10) and shutter speeds (8 to 1/1300).The camera is Waterproof up to 10m/33ft (which means you can safely take it splashing and snorkeling but not diving without an extra casing). So far, neither condensation nor sand have slipped through the seals.It is also advertised to be Shockproof to drops up to 2m/6.6ft and Freeze-proof -10C (claims I have yet to test - no, I am not putting it in the freezer, it will have to wait 6 months for the slopes to open!).For such a small lens (and such a dense sensor - will the MegaPixel-war ever cease?) there is surprisingly little noise. Given enough light the pictures are flawless. When indoors or with limited light the ISO will increase and so will the noise. I can understand such things to be important to photography enthusiasts but for the purposes I bought it, this is an excellent camera.I don't usually use my photo camera for videos but it is nice to know the option is there. The video (up to 1280x720) can be captured either in AVCHD Lite format or AVI (make sure to have a large enough memory card if saving in AVI). As an added bonus, you can zoom while shooting a video and (almost) no whirring noise registers.My only gripes are that the position of the lens is something I had to get used to (unless I wanted to both include my left hand in the shot and leave smudges on the lens) and that there is no viewfinder. Understandable for a compact camera but having the sun behind you will test the anti-glare capability of the 2.7' LCD.The camera comes in 4 colors: inox-gray, royal-blue, metallic-yellow and safety-orange. I opted for the later out of vanity (it... matches the orange details of my summer watch) - but as an added bonus it is really easy to find even if it has slipped to the bottom of your backpack.An excellent (made in Japan) action camera.HIGHLY RECOMMENDED!", "Date": "June 15, 2010"}, {"Title": "very good waterproof camera", "Author": "Rolls", "ReviewID": "RSRI9TYS2764Q", "Overall": "5.0", "Content": "I purchased this camera to compare to the Pentax W90 which i also bought from amazon.  This camera was far better than the W90, the video was clearer (especially in sunny conditions) and you can use the optical zoom while in movie mode.  On the W90, you can only use the digital zoom in movie mode, and there is much noise.  The regular still pictures were also much better on the TS2 -  however, I think the macro feature on the W90 was a little better.  For panorama shots on the TS2, you need to use photo editing software to mend them together, which is not too bad because you can use more then three files to make a really large panorama.  The W90 makes the panorama in the camera itself.The zoom button on the TS2 is a little close to the shutter button, but it is not too bad to get used to.  Underwater pics and video on the TS2 are also very good, much better than the W90, in my opinion.  While the TS2 is not a high end point and shoot or DSLR, it does take very good pictures and video.  And even though I really liked the style and menu system of the W90 better, I sent it back because for this much money the camera should take decent video and photos and it did not - luckily, amazon is very good about returns!  (Another thing about the TS2 which i thought was good, is that the seals look like they are easy to replace.)", "Date": "June 8, 2010"}, {"Title": "Great camera, minor issues.", "Author": "E. Sinn \"esinn4\"", "ReviewID": "R1OYJK5U3OFO7Q", "Overall": "4.0", "Content": "Great camera as others have said.  With respect to the quality of the pictures, keep in mind that this is a waterproof camera so there are compromises.  I love it but there are a few pointers I want to share with new buyers.I bought the orange model.  Nice.  Cool looking.  But when I do closeup shots, the subject gets an orange glow.  Not Panasonic's fault, of course.  What do you expect when you buy an orange camera?  I was not aware of that when I got it.  So for your underwater closeups with air bubbles, the bubbles will have traces of orange.I have more serious cameras for closeups (but not underwater closeups) and the orange camera looks nice.  On the other hand, if I could do it again, I would seriously consider a black/silver/grey one.The idiot mode (the one where the camera does everything for you) is not idiot enough.  If you turn off the flash in another mode, the flash stays off in idiot mode.  I prefer an idiot mode that cannot be changed at all so that in a hurry (like if an ivory billed woodpecker suddenly flew into my bedroom), you can turn to it and be fairly certain that an acceptable picture will be taken.Dustproof.  Waterproof cameras are also dust proof.  If you carry a camera in you pocket all the time like me, it is nice that it is dust proof since dust eventually ruins all cameras carried all the time in a pocket.  That's just the way I like to use it.  Other people who don't carry a camera like me does not have to worry, of course.Lens.  The lens is great.  I wish they put it in the middle like a traditional camera.  It would make it easier to adjust to.  After a while, you get used to it and it does not matter.  Maybe there are design constraints.I took it to the waterpark for 3 days.  Did the wave pool, water rides, water slides, jumped into the pool from the sides, dive to 5 feet, lazy river for 6 hrs, 2 hr each day, shower.  I would estimate the camera probably spent 3 hours under water and 1 hour being splashed (like at the end of a water slide that empties into a pool).  No problems.  I did not use the neoprene case either.These are all minor.  I love the camera.", "Date": "July 1, 2010"}, {"Title": "It survived a 14 day grand canyon river trip", "Author": "Ryan Walker \"rgwalker\"", "ReviewID": "RG2R3IU3ASWZB", "Overall": "5.0", "Content": "I bought this camera so I could take it down the Grand Canyon on a 2 week river Trip. The camera worked the entire time. It has some features I really like, like auto bracketing It seems durable and it got wet every day of my trip with now problems. For me it seems to be quite intuitive but I work in Photography and know camera's.  I now carry it with me every day it is durable enough that I feel like it can withstand the bumps and jarring of everyday life and because its waterproof I don't have to worry about spilling on it. It may not be the point and shoot with the most features, but if you are looking for a camera you can take and not be worried about it constantly this is the camera. What good is a camera you have to put away all the time, you need it right there to capture the things as they are happening that moment.  The image quality is on par with most point and shoots I have been around. It takes good pic's and the video being HD is nice also.As far as a river rafting camera it worked perfectly I got a lanyard for around my neck and would stuff it inside my life jacket. On the big rapids would put the life jacket buckle thru the lanyard in case I ended up in the water. I don't think you could find a better test than 2 weeks on the Grand Canyon as far as testing ruggedness there was lots of wind blowing sand and dust. Moisture all around and times that it took some shock while climbing up rocks and stuff it would swing down and bang against them, if I wasn't paying attention. It has served me well so far well I guess that's all I have.", "Date": "May 26, 2010"}, {"Title": "Great Little Camera", "Author": "S. Covey", "ReviewID": "R2FCP9F6LL654Z", "Overall": "5.0", "Content": "If I could I would give this camera 4.5 stars.I have been waiting for a camera like this for a long time. The waterproof capabilities on this camera are pretty amazing. The video capabilities of this camera are incredible for how small it is. Recording at 720p in the AVCHD codec yields tremendous results. This camera is a perfect travel camera and perfect to take with you on a hiking trip or something similar. Picture quality is good in daylight, however, using the flash on this camera brings low quality results. But what can you expect from a small camera like this? Small cameras are never really going to be the best cameras indoors using the flash. My main purpose for getting this camera was to have a small compact rugged waterproof beast that can handle anything from vacations to excursions. You will not regret getting this camera.", "Date": "April 8, 2010"}, {"Title": "Excellent Camera Real-World Amateur Photographer", "Author": "Robert \"HarriedTraveller\"", "ReviewID": "RMIJ1F7K6XYHR", "Overall": "5.0", "Content": "We got this to replace our Olympus Tough which after a few years of faithful service was been passed down to the teenagers. Having just gotten back from a trip to the national parks in Canada, we could not be happier with it. The camera took great photos (at least to our untrained eyes) in a variety of conditions from sunrise to mid-day from sun to rain, indoors and outdoors, close and distance. With some 900+ snapshots behind us we are very pleased with the quality of both the pictures and the HD movies. Of course the best part of these rugged cameras is that you can take them (as we did) rafting, on the hiking trail, etc. and it is small enough to slip into a back pocket (where it won't break when you accidentally sit on it getting into the car). It already has a few battle scars from drops in the boat and off a mountain bike(doh!) but it survived no problem. And the videos of us going through class IV rapids with the camera recording are priceless. We have a higher-end camera but it is too delicate and too bulky to bring along when you are out in the \"wilderness\" or on the beach or even just banging around on your bike.Likes1) The controls are pretty easy to work - even with gloves on2) The automatic mode (iA) does a good job of selecting the right scene3) We had great luck with the image stabilization4) Very sturdy and absolutely no problems with water (not sure I would take it snorkeling but worked fine for us getting very wet in the lake and in the rivers)5) Very quick to turn on6) Did I mention it takes great pictures and video?Dislikes1) You have to be careful with the waterproof seals to make sure there is no dirt etc when you close it (i.e. do not change the batteries unless you are in a clean, dry place!) [note to Panasonic: this certainly could be a bit more fool-proof like with two waterproof doors in case one fails]2) AVCHD Lite was a pain and needed to be converted on my Mac to get into iMovie - initially it imported at the wrong speed and with audio and video out of sync but was salvaged with some downloaded conversion software and two hours of aggravation(I should have listened to the other reviewers and changed format before we started!)3) You have to wait through that boring little presentation of waterproofing tips when you first turn it on and if you do not go through the whole thing it will keep coming back until you do - so watch all the way through the first time!Bottom line, we love this camera and we are sure we made the right choice in replacing the old Olympus. You won't be sorry. We paired it with the Transcend 16GB card TS16GSDHC6-P2 and had all the room we needed for a 10 day trip. Enjoy!", "Date": "July 29, 2010"}, {"Title": "Buy this camera - you won't be disappointed", "Author": "K. Towner", "ReviewID": "R29Q9RGQ9O9OW1", "Overall": "5.0", "Content": "I did considerable research before selecting this camera.  It was a great purchase.I needed a camera that would shoot high-quality photos and video without complicated settings.  Something waterproof for the pool and water activities and tough enough to take day-to-day abuse.  After a month-long family vacation and nearly 20GB of photos and video, I can strongly recommend this camera as an outstanding tool.Everything, including underwater, high-speed multiple frame shots, and low light came out beyond my expectations, both as stills and on video.  The ability to plug the camera directly into your HDMI port on a TV to share photos and video (separate cable needed) was a plus, and the quality of the video is superb.  One button video recording was a great feature.I would recommend paying the extra $$ for a class 6 or better SD card, because it will improve the speed of saving your photos and video so you don't miss that next shot.  I also used a class 4 card once my primary filled up and that worked fine, but it was a bit slower.Do your homework and see what the professional reviews are saying, but if you want an all-around tough and capable camera, this is a great choice.", "Date": "June 18, 2010"}, {"Title": "perfect", "Author": "julienyc", "ReviewID": "R2YMO3QB9LG7KL", "Overall": "5.0", "Content": "I bought this camera for my photographer boyfriend. He usually handles expensive cameras, film and digital, but I wanted him to have a point and shoot he could take with him anywhere - especially underwater during his shoots and on our vacations. We absolutely love this camera. It's fast to take pictures, easy to switch from camera to movie, easy to turn off the flash when you don't want it > although it's really not a bad flash. In the 2 months we've had it we've been amazed with the quality of the photos, and films. Seems just as good as some of the best point and shoot cameras out there, with the huge advantage of going underwater!! We're loving it.", "Date": "August 22, 2010"}, {"Title": "Great Camera...While it Lasts", "Author": "seamonkey10", "ReviewID": "R2FTB73SN1X6RD", "Overall": "4.0", "Content": "I read a lot of reviews for waterproof cameras, and found that everyone reviewing them had different problems.  The cheaper Fujifilm didn't seem to take great pictures, the Canon seemed to leak for others, and the Olympus tough seemed to be really slow.This one seemed to be the one with the least problems, so I decided to go for it.WATERPROOF? - For now, yes.  I took it out for several hours in the ocean, and it survived.Why do I say \"For now\"?  The product manual seems to acknolwedge the fact that this camera's waterproof features last only about a year.  The rubber seal is thin, and salt water, sun, and time will eventually corrode it.  All water needs is the tiniest of cracks in the seal, and your camera is done.  I like my camera, but I know it's only a matter of time until this eventuality occurs.  Still, I cleaned it with fresh water, and used my little brush like recommended.  The silicone cover is also handy to protect it a little more.  The manual also seems to say that something like big crashing waves could be a little too much for this camera.I guess know this for all waterproof cameras: The clock is ticking.UNDERWATER PICTURES - They're good.  You'll need proper light, but the pictures that come out look great.WORKING THE CAMERA UNDERWATER - The buttons are easy to understand.  The arrangement could have been a little easier, but it's easy to know what you're doingREGULAR PICTURES - They look nice.  14 MP, I would say in some ways it rivals my DSLRMOVIES - They're good, not great, but this is a camera not a video camera, so the videos are decent.  You'll have to decide between AVCHD Lite and MJPEG.  Motion JPEG is an easier file extension to work with (since it's a Quicktime)  I decided to go with the proprietary Sony / Panasonic filetype because it takes up about half the amount of space on your SD card as MJPEG and it's HD.The tradeoff I made, though, is that I have to import my movie files into Windows with my Panasonic software, which takes a long time.  It converts them into .h2ts files along with three other associated files.I had to type .h2ts into the search function in order to find my videos among the thicket of associated file wrappers, and move them to another folder.  After that, I have to convert them to MP4 files using Handbrake (a free software) and then I'm free to finally put them into photo editing software.It's a lot of work.FILE NAMES - For some reason, Panasonic decded to name all the files with really long numbers.  On my other cameara, I just look for IMG-1002, so I know it's the 1002nd photo, but on this camera, Panasonic names them 1000040404(100001002) and it makes it really hard to look for photos.So far I'm happy with the camera, but I know I'll be mad the day I put it in the water and lose everything.  If you're looking at this camera as a long-term investment, you'll be disappointed.  If, however, you want some underwater pictures and know the risk, then go for it.I'd recommend a floating wrist strap if you go in the water.  You'll need it when the water gets rough.", "Date": "August 9, 2010"}, {"Title": "Great camera for all around work", "Author": "Branko", "ReviewID": "R21T6L9QANUHR3", "Overall": "5.0", "Content": "I bought this camera for my construction business. It turned out great for dust, water and drop resistant.It fell off a ladder(6ft) and fell into mud, still works like a charm, but remember to use the supplied neoprene coverfor added protection. One word of caution, the camera has some sort of sensor or software to tell apart original Panasonic batteries from after market. It will shut down if you use after market batteries.", "Date": "September 25, 2010"}, {"Title": "Great Camera!", "Author": "CFred", "ReviewID": "R36XS6M28PQ44C", "Overall": "5.0", "Content": "Bought this camera for a trip to Hawaii.  Camera is excellent.  Took amazing pictures and video, and worked as well as one could expect an camera to work underwater up to 30 ft.  I used it scuba diving, snorkeling and in waterfalls.  It dropped a few times and handled all the travel and hiking we did.  After a month we love the camera.  Only thing I ever saw with the fogging up was when I submerged it in a cool pool of water for a few minutes and then took pictures out of the water a few minutes later.  Some fogging occurred but then went away in about 5 minutes.  The size could be smaller, but for all the features and ruggedness it is acceptable and can still fit in my short pockets.  I would recommend it.", "Date": "August 31, 2010"}, {"Title": "Leaked water due to its small, cheap door seals", "Author": "Ricker", "ReviewID": "R2END96D4YLRAY", "Overall": "1.0", "Content": "If you are in the market for a water proof camera then please make sure you do your research and know the risks you take buying this product!This is my second waterproof camera, and after my first one failed on a vacaction, I became super cautious with this one.I took this camera on a snow trip to Switzerland recently and had no problems with it. Was impressed by its video quality, though it did lack in the auto focus department, constantly changing focus.Came back from my holiday and went to the beach with this camera for the second time.Was splashing around in the shallows, taking the camera no more than half a meter underwater. After getting some fun photos. I put the camera back in my bag and when I took it out again to check out my snaps an hour later. After turning it on, noticed that the screen was doing weird electronic \"i'm dying\" kinda things like flickering, and flashing weird electronic lines. So i quickly turned it off, fearing the worst. Opened the battery door and peared inside. And yes, there it was, a couple of very small drops of water on the battery and SD card, and the lipmus paper had changed to purple showing that water had entered.Sure enough after removing the battery and letting the camera dry out for a week or 2. I tested the camera to see if it could be ressurected. NOT a chance in hell! Wouldnt even turn on.So I decided to put my faith in a waterproof camera again. I did so much research this time, and in regards to waterproof cameras this one was supposed to be the best. I'm very annoyed that this camera has failed on its second water exposure. I got to use this camera for all of 3 months and then it was goodbye.For those reading this review looking for sound advice about their decision to purchase. Forget the photographic qualities this camera might exceed in when compared to other waterproof cameras i.e take a moment and disregard all the functions and qualities this camera might exceed in, in regards to the quality of the pictures and the quality of the video etc. If you are purchasing a waterproof camera, for the reason of it being waterproof, make sure your prepared to sacrifice many photographic qualities and find the most rugged designed waterproof camera of the bunch, not the overall winner of all the qualities of a camera.This camera can take some ok to fairly nice pictures out of the water and some nice pictures in the water, but its not a winner in its durability to keep the water out. And lets be honest, thats what this camera is supposed to be about! So i'm a very disappointed customer who has had to waste another hard earned $250 bucks.I have another panasonic camera, and it takes beautiful pictures, so panasonic knows how to do the picture part well. I just dont believe they have built this camera to withstand normal everyday use thats to be expected if this camera is taken in the water. The rubber seals on the casing doors and extremely thin, the hinge and seal mech used to hold the doors closed are small and not strong and its this small area that downfalls what would of been a nice camera otherwise.Be sure to check the range of waterproof cameras and take a good look at their door seals, and their door closing mechs.So can I recommend this product to others?If you telling yourself that you will hardly use this camera in the water, so you still think it'll be a good purchase. Well then.... dont bother buying a waterproof camera, you sacrifice much photographic quality to attain the waterproof status. For the same price on a standard camera, you will get a camera that takes a much sharper, cleaner and well colored picture.If you decide you do indeed want a waterproof camera cause your like me, and are outdoors alot hiking and such, and you want something rugged that you can throw in the pack and such and most importantly use in the water without concern. Well then this review is for you. The camera is rugged, but not in the water. So be wise and learn from someone else who has been there before you, TWICE.Panasonic does not hold their warranty when the water gets in. Do I want this review to be damaging to Panasonic's sales on this camera. Honestly? Yes I do hope this helps to lessen sales for them. But its not for that reason I write it. I too like most intelligent online buyers, use reviews from both everyday users and from the technology reviewers to make decisions when purchasing equipment. So I hope this review will help others to be aware of the main flaw on this camera, which happens to be the most important area, its seals and closing mechanism.", "Date": "March 13, 2011"}, {"Title": "Fantastic Camera", "Author": "C. Borresen", "ReviewID": "R2PY9V0HSXCZZQ", "Overall": "4.0", "Content": "I got this camera to replace my Sony DSC-P150 (a great camera in its time). Since we have a new baby and I'm not great with photography, the specific things I wanted in a new camera were ruggedness, simplicity, stabilization, and HD video.After researching a bit, I ended up with the Panasonic DMC-TS2 (blue). In the dark, this camera doesn't really add much to what I had in the Sony - it's still a bit grainy. Size-wise, I give up a little pocketability with the TS2, but the weight is very similar. In every other comparison, the TS2 is a killer upgrade.In a reasonably lighted situation, the HD video is great. The image stabilization and the ability to zoom during the recording function help me to shoot stuff that doesn't make everyone seasick during playback. Photos are also nice. I have twice the megapixels, but more importantly, a great lens and image processor.The lens barrel doesn't extend on the TS2, and while there is no viewfinder, the screen on the back is bright and clear. The menus for adjusting every nuance of the camera are clear, large, and easy to access, and I would not be surprised to find that I can make a few adjustments and get the low-light shots looking good, too.For now, I have it set to intelligent autofocus, and it hasn't gotten a picture wrong yet. Really impressive.In summary,Positives:Lightweight, waterproof, shockproof, freezeproof housing. Simple, relatively intuitive user interface. Bright, clear view screen and menus. Excellent HD video, very good photograph quality.Negatives:Might fit in a big pocket, but it's a little bigger than other compact cameras. Mini-HDMI port but no cable; included cable goes from the proprietary port to RCA (red, white, yellow). No analog viewfinder.Overall:Excellent camera if you need to replace an older point and shoot. You could get similar features without the ruggedness for slightly less money, but I think I'm going to love not worrying about this camera.", "Date": "October 26, 2010"}, {"Title": "Great Waterproof Camera", "Author": "G. Brooke", "ReviewID": "R3VSV4NL2SBEHW", "Overall": "4.0", "Content": "I've had the DMC-TS2 for 6 months now.  I've taken it snorkeling in Cancun, snorkeling on the Devils river, down many water rides at the Schlitterbahn water park, hikes in the rain, to several swimming pools and on two canoe trips and on a trip to Germany.  The camera is super rugged and you never have to worry about taking your camera out in the rain, dust  or grime.I've owned several Cannon digital cameras and I prefer the cannon's picture and menus.  While I prefer the Cannon's picture quality, the HD Video on the Panasonic is so much better.  With the HCSD memory you can take great videos with this camera. The camera is a little large, but smaller than the other waterproof cameras I looked at.  I got this camera over the Cannon waterproof camera because the Panasonic is so much smaller.I would definitely recommend this camera if you are looking for a water proof camera.  If you go hiking and don't want to worry about dust or dirt definitely get this camera.  This is a great all around point and shoot with great video quality.", "Date": "August 28, 2010"}, {"Title": "Exactly what I wanted", "Author": "muldenator", "ReviewID": "R3MEO2O9SVM95K", "Overall": "5.0", "Content": "I recently purchased this camera to replace my 6 yr old 3MP Panasonic. I was looking for another Panasonic as we were happy with it and were used to it's controls, etc. My wife desired something smaller and more of a point and shoot. This camera is exactly what we wanted. It has just the right amount of features for the average user. The \"simple\" mode works well--and when you aren't satisfied with it there are all kinds of settings and other presets to accommodate. The HD movie feature works excellent. It's size is unbelievable for what it does.So far I have tested the waterproof capabilities and they do not disappoint! It's amazing. We purchased this camera for the sole reason that we can take it swimming, canoeing, skiing, camping, etc. It comes with a silicone jacket that serves as extra protection to ensure that the compartments remain closed during underwater use. I leave it on b/c it serves as an all-purpose protector and makes the camera easier to hold.I would highly recommend this camera. It's high quality and high on features.", "Date": "August 9, 2010"}, {"Title": "Panasonic DMC-T Underwater camera", "Author": "Dan", "ReviewID": "R3FDPF58D85N9F", "Overall": "1.0", "Content": "The few photos I took were OK but lacked sharpness. My old Canon A710IS with Canon housing produced much sharper photos. The Panasonic camera died within a couple of minutes of using it in water. There was no evidence of leakage in the battery or connector compartments. If water was the culprit it must have entered somewhere other than the user accessible compartments.  IMHO the unit is not ready for prime time.  Amazon service was excellent and they accepted a return without problem.", "Date": "August 24, 2010"}, {"Title": "It is not waterproof", "Author": "ES", "ReviewID": "RRP2U4WEP2JK8", "Overall": "2.0", "Content": "The camera leaked water and the screen fogged up despite taking careful precautions to make sure the compartments were closed and locked. I used it twice for snorkeling before it broke. Later I found out a friend also has this same camera and somehow water got in and the display screen hasn't worked ever since.So I'm giving the camera two stars because while it does take high quality photos it does not live up to the advertised \"waterproof\".", "Date": "November 20, 2010"}, {"Title": "Great fun waterproof camera", "Author": "ozimax", "ReviewID": "REII28N6OPP62", "Overall": "5.0", "Content": "Can I start by saying something, please? What is it with these idiotic reviewers that give a camera 1-2 stars because the retailer makes a mistake? Review the camera, NOT the retailer. If you want to pan the seller, do so, but use the correct forum. There, that's off my chest! Now, for the camera itself.I purchased my own Christmas present from Amazon earlier this month. (My wife has given up buying me presents as she only thinks of socks and jocks etc:-)) I have wanted something waterproof for quite a while now, seeing it's always raining up here. Here's a quick review.1. Image quality is surprisingly good for a compact. It has noise at 400 ISO and above, but that's to be expected. I have made the mistake of comparing images to those from my 5D Mkii, but you can't do that. A FF sensor versus a tiny compact sensor means apples compared with oranges etc.2. Waterproofing seems good thus far. There is a process for keeping the camera dry after being in salt water. It just takes a little time to make sure all is clean and dry. The camera is well sealed.3. Construction. The camera, for a compact, is built like a mini tank. I am a big fan of Panasonic cameras, having owned an LX3 last year.4. Ease of use. It isn't the easiest camera to operate, especially in the water. The buttons are small, the shutter button and zoom rocker are most probably too close together and are easily confused by someone with average sized hands.5. Miscellaneous. There is no RAW format available on the FT2, so JPG is it. No problem really as it's for snapshots. I use the \"vivid\" settings and they seem nice and saturated. The underwater shots are a little off colour wise, but who's to worry? It's not for serious photography, but for having fun.I am seriously impressed with the 10 frames per second mode. It is fast, and although only 3mp images are allowed, that is plenty for a 6x4\" print. Even in low light I was impressed with the focussing abilities of the FT2.I haven't seriously done anything with the video mode, but it seems OK in 720 HD format.All in all, this is one fun camera, which stays in my pocket/glovebox at all times. I look forward to giving it a good workout over the Christmas period.", "Date": "December 22, 2010"}, {"Title": "Awesome Camera", "Author": "JenSom", "ReviewID": "RBL9UNDUM1NVH", "Overall": "5.0", "Content": "After I didn't seal our old camera (a really good Canon S1IS) properly in its underwater casing I found that it was time to buy a new one! So, a very important aspect for me was that it be waterproof. I was excited to hear that this was now an option. I was a little disappointed that the zoom wasn't higher but the pictures that I took on our vacation to Belize settled that. This camera takes awesome pictures. The HD quality videos are great. I used to take only videos snorkeling and then capture still shots but this camera takes excellent shots either way. Plus, capturing a still shot is made simple when using the software that comes with the camera. I love this camera!", "Date": "October 26, 2010"}, {"Title": "Great little camera for outdoors and vacations", "Author": "E. J. Bolisay", "ReviewID": "R29PKQVPLV5URH", "Overall": "5.0", "Content": "I love this camera.I typically use a DSLR for photos, but lugging around a DSLR to places like the beach is difficult, especially when you have to worry about the elements (sand, water, etc.) as well as security (unless you don't like to go into the water).  So I decided to go for a rugged point-and-shoot that was lightweight and waterproof, so that I wouldn't have to worry about it.  I am sure glad I got this camera.I originally was worried about the drop-off in picture quality between my DSLR and this camera, but in most situations I barely notice the difference.  It took a little while to get used to all of the shooting modes, etc. but once I did, I found that my photos came out just as well as they do on my DSLR.  Focusing is fast and the response time of the camera is quick.  Additionaly, with the weatherproofing on the camera, I am able to take more unique pictures from exotic angles without fear of dropping the camera or exposing the camera to a hazardous situation.  The results are awesome landscape beach and water / underwater photos and very good standard photos.Overall, it is a good point-and-shoot camera that produces great outdoor pictures in many difficult settings.", "Date": "October 17, 2010"}, {"Title": "Awesome", "Author": "JC", "ReviewID": "R3W0XVGOHYJRU8", "Overall": "5.0", "Content": "This camera is everything I had hoped for. High 14MP, HD video, wide angle, waterproof. I use it all the time. Since it is practically bullet proof, I even let the kids on my block use it all the time. When we have a block pool volleyball game, the kids take the above and underwater pics and video. Totally cool. I recommend it to anyone that wants a point and shoot that can do pretty much anything.If there is a need for an improvement, I guess it would be for a longer zoom.other than that. this thing rocks", "Date": "August 9, 2010"}, {"Title": "Mine leaked and broke after 6 months.", "Author": "Chico", "ReviewID": "R3AOKY0RQ7SBVL", "Overall": "2.0", "Content": "I've had this camera for about 6 months.  It's rugged, takes reasonable (but below average) pictures, and is somewhat waterproof.  I primarily used it at surface level in the ocean and carefully cleaned it according to the instructions after each use.  It looks like Panasonic is going to honor the warranty and send me a TS3 replacement.  I'd rather get a ZS something, or superzoom because I don't expect the TS series to hold up to the level of water use I bought it for.  It's probably fine for gentle use at the beach and around water.", "Date": "August 12, 2011"}, {"Title": "This thing is TOUGH", "Author": "Dog lover", "ReviewID": "RTAJJELEL8C6R", "Overall": "5.0", "Content": "I got this camera to replace an aging Casio that performed well as a party camera. The Casio was tough, too, barely surviving a few drops, but it was showing its age: it had pocket lint obscuring the lens, the lens mechanism was getting creaky, and there was sand in the crevices from the beach.I wanted a pocketable camera that I wouldn't have to worry about such things with, so I got the DMC-TS2.I felt that waterproof cameras had caught up reasonably well to regular point and shoot camera image quality, so I pulled the trigger.Initially, I felt image quality to be slightly inferior to my 4 year old Casio. (Exilim EXZ-700)This was kind of disappointing, but it wasn't that bad. It definitely lacks in darker indoor situations, and the flash is kind of weak. Also, the images look very warm (reddish) to me. I have a crazy theory that the orange body I got is reflecting onto my subjects and making them look orange. Oh well.This camera takes pretty decent low noise night shots in comparison to my last camera. Nice if you are on someone's balcony and want to get a cityscape shot or something. It will expose up to 60 seconds. Obviously not nearly as good as a DSLR, but still not bad.Ok, now on to where this camera shines. I took my honeymoon last week in Cabo San Lucas, Mexico. When buying this camera, I knew I'd be using it a ton on this trip, and it passed with flying colors.It allowed me to get shots I never would have been able to get otherwise. Normally I don't take a camera near the pool, and sparingly at the beach. (The sand issue.) With this unit, I was never left without a camera. Shots in the hotel pool, sea kayaking, at the beach, underwater, etc. were all taken. And the images are much better in bright sunlight. This camera definitely excels in outdoor shots. It's made for summer activities.The manual states you shouldn't jump in pools with the camera, as this sudden hit of water pressure can overwhelm the seals and cause leakage. Of course I dismissed this and went for it anyways. I went down the waterslide at the pool first, shooting a video. Looked great. Then a few days later I shot some video while I jumped off a 30 foot cliff into the ocean. The camera handled it beautifully, all while recording in HD. I also dove down probably 25 feet while snorkeling. Perfect operation.Then I took it in the ocean and got some pics of some very heavy waves crashing on my head. Sand was everywhere, but the camera made it out without a scratch. I was very impressed. This thing is tough. I also had it in a zippered pocket in my wet swimsuit every day, and it was fine.As for ergonomics, the camera is very simple and easy to use. The controls are sort of oversized and overtextured, but they feel perfect when you are doing active things like snorkeling. And the underwater pictures looked great. It's cool being in a boat and you see some fish, you can just stick the camera underwater and snap away. I also used the aftermarket Olympus float strap, it floated the camera very well in salt and freshwater, FYI.As for negatives, aside from low light image quality, I did notice condensation inside the lens after I dunked the camera in cooler water and brought it out into the 90 degree heat. This went away after you let the camera sit in the sun for maybe 10 minutes. Kind of annoying, but I guess it's to be expected.Other than that, I love this thing for vacations. The battery life was very impressive as well, and it's not even scratched despite being in my sandy pocket and getting punished by the sandy surf.I say get this camera for your pool/beach vacations. You won't be disappointed and will be very happy with the shots you can achieve.", "Date": "May 26, 2011"}, {"Title": "Wife loves the camera", "Author": "Ranger", "ReviewID": "R14K9D8L24EDEN", "Overall": "5.0", "Content": "Purchased this camera for my wife who hates to worry about f-stops and apertures.  Snorkled our brains out in the Caribbean, and she took both photos and video underwater.  After getting used to the fact that the lens is on the upper left-hand corner (her fingers showed up in the video a few times), and playing with the different features (hint - use underwater mode instead of beach mode, no matter how shallow the water), and sticking with iA instead of attempting to figure out everything else, she really likes the camera.One word of caution, though: my wife follows instructions to a fault.  So, we did not experience any problems with water leakage.  However, there was another couple on our cruise with the exact same camera (as well as purchasing it just before the cruise).  They didn't have such good luck with waterproofing, and their camera died after a sandy beach day.  They claim they used the brush, etc., but we were sure to soak the camera for a few minutes with the rubber cover on it, then soak it for 10 minutes with the rubber cover off.  Then, we dry it with a towel and let it sit for a couple of hours before opening it to take out the battery and/or the SD card.  Then we use the brush on the open doors.  We suspect the other couple was opening it immediately after soaking it and not letting it dry out properly.  Just a thought.", "Date": "March 5, 2011"}, {"Title": "Awesome Camera!!!", "Author": "BigL805", "ReviewID": "R20H6CB0CC3X5W", "Overall": "5.0", "Content": "I purchased this camera for our trip to Cancun. I did allot of comparing with other waterproof cameras. I was very pleased with my purchase of the TS2. All you have to do is follow the instructions which are very easy. Before use, make sure you clean the seals with the brush provided. I had the camera submerged in water for 1hr straight at one time and I had no problems with it. Took some great pictures of the family while we where snorkeling in Cancun. Once your day is over and you are not going to be using the camera, rinse the camera with some fresh water, make sure you dry it completely, there might be a little water left around the speaker area so just shake it a little. The pictures where amazing and its very rugged as well. My son dropped it from about 3ft onto some rocks and it still functioning great. The quality of the pictures are great. Trust me, I posted some pics on Viator for our snorkeling tour and people where asking me which underwater camera I was using? I was very happy with the picture quality. If you are looking for a waterproof camera look no further the TS2 will meet all your needs. A little on the expensive side but well worth it.", "Date": "December 27, 2010"}, {"Title": "Excellent rugged camera", "Author": "Edmund Rucci", "ReviewID": "R2WD45TS349ALN", "Overall": "5.0", "Content": "I bought the Panasonic Lumix after doing quite a bit of research on rugged/waterproof cameras.  This was one of the few cameras which had no complaints about leaks, and after using it in several wet environments, I can support that claim.The camera takes great pictures, and also has a decently fast shutter and save speed, which you sometimes don't find in pocket sized cameras.  It's a bit large to carry around in your pocket on an everyday basis, but for trips or outdoor excursions it's plenty small to easily carry around.Bottom line: this camera is great value and I strongly recommend it", "Date": "December 13, 2010"}, {"Title": "Should be rated for 3 feet not 33 feet - water damage", "Author": "charles895 \"charles895\"", "ReviewID": "R21IRP56L7WRH1", "Overall": "3.0", "Content": "Have had this camera for a few months now.  I've taken it on a rafting trip, the pool, snorkeling and gotten a bunch of nice pictures.  Like most waterproof camera's, pictures are not as good as non-waterproof alternatives, but this is the best I've tried to date.  Most major issue was lens did not shed water like my Pentax under water camera - which means constantly wiping lens to remove water drops.  But the camera does take nicer pictures than my first underwater camera and seemed like a winner.BUT today we went Snuba diving - max depth is 20 feet - you are on a hose that will not let you go deeper.  After about 10 minutes in the 10 - 15 depth range, I notice camera would not display images, yet I was able to play back images previously taken.  After a few more minutes, the camera starts clicking and making strange sounds.  The internal focus motor is going crazy.  So I head to the surface, turn it off and hope it gets better.  Back at the room, the camera still isn't taking pictures and now the camera emits a wining noise when turned on and ask that I set date / time.  After setting date/time, it says turn off and turn on.  I do this and then it says please set date time.  So the camera is shot.  I looked into the battery compartment and there is no water inside this compartment - I'm guessing it seeped in some other point on the camera, but this camera is not good for 33 feet.  More like 5 feet.Hopefully Panasonic will honor its warranty.Warranty 9/9/2010 - Panasonic sent me a re-conditioned camera which looks like new and has remaining warranty of original unit.  Going forward, I will not submerge this camera more than a few feet.FYI - if looked in battery compartment and noticed the water detection sticker has a white/pink checker board pattern which has the same pattern the unit I sent in for repair.  I assume this sticker goes totally pink if water touches it.  Therefore, my old camera did NOT leak water into battery compartment - so there is some other seal which fails under pressure.  Anyways, I'm much happier now that I have a working camera.Raised from 1 star to 3 stars rating.  Would have rated 4 stars if unit had not failed in middle of our vacation as camera, does take great pictures if you can deal with limitations inherent with waterproofing design.", "Date": "August 18, 2010"}, {"Title": "Don't plan to use for more than once underwater", "Author": "buyer123", "ReviewID": "R235T0A1DVID1W", "Overall": "1.0", "Content": "I have been through 2 of these camera's and now moved on to the canon D10 to see if it is \"waterproof\" I take pictures of saltwater corals everyday for business and both of these cameras have lasted a month. they start to deteriorate and then leak water in. I followed the instructions on soaking in fresh water after every use. Don't buy this camera if you plan to use underwater.", "Date": "November 21, 2010"}, {"Title": "Returned 3 times to Panasonic", "Author": "Jeremy Enright", "ReviewID": "R1EVO96Z7Z58VB", "Overall": "2.0", "Content": "Nothing but problems with this camera.  It is not shock proof by any means, and I've returned 3 of them for warranty service within a 15 month time frame.  The first time occurred when I took the camera rafting in Columbia.  I had the camera on my wrist, made a paddle motion with my plastic ore, and the camera hit the rod of the ore.  The distance was no more than the length of a camera strap and the screen cracked.  I returned it to Panasonic, and they sent me a blue refurbished camera (I was told there were no more silver cameras available).  The second camera broke a couple of months later after being dropped twice from two feet.  It simple wouldn't turn on.  Again, returned it to Panasonic and was given a blue refurb (no silver available).  That camera last about 6 months before an error message would appear on the screen and the camera would turn off.  I reached out to Panasonic (3 months outside the 1-year original warranty time frame).  They offered to replace it with a new (non-refurb), upgraded model.  Again, silver wasn't available, nor was blue.  I was thus sent a red camera.  I sold it on e-bay.  Tired of dealing with a camera model that always breaks.The camera did take decent enough pictures, and great video.  However, as with most users, durability was the major reason why I bought the camera.  If it's not durable, then there is no point.", "Date": "November 9, 2011"}, {"Title": "No lens cover", "Author": "Jennifer Jones", "ReviewID": "R2MKG52YA25LDP", "Overall": "4.0", "Content": "I just got the camera, in fact the battery is still charging up for the first time. My first impressions are mostly positive.  This is my second Lumix camera and I've had very good luck with my first one.  I do see one area of concern, however.  There is no mechanism to cover and protect the lens when the camera is not in use.  I'm anticipating having to take extra care.  I'd planned on being able to carry the camera in my pocket but now that I've realized the lens has no protection, it will always have to be stored in the case.", "Date": "March 13, 2011"}, {"Title": "Going to have to attempt a warranty", "Author": "Peter", "ReviewID": "RO3AM6XFQLLWM", "Overall": "3.0", "Content": "Having owned this camera for about 8 months, I've taken several thousand pictures without a glitch. During my recent trip snorkeling, the camera met its end in salt water. All precautions were taken to ensure that lint, hair or sand was not inside the silicone liners. Although I was able to take a few dozen pictures under water, I suddenly noticed that the LCD screen went dark and the camera would no longer function. Water seems to have leaked thru other areas of the camera because when I checked the battery & accessory cover, everything was 100% dry in there. Oh well, will try to warranty :(", "Date": "February 26, 2011"}, {"Title": "Great all weather camera!-Panasonic DMC-TS2 Tough Camera", "Author": "Christopher R. Daddato \"Combat Photographer, ...", "ReviewID": "R3IPZJZSSSW7XZ", "Overall": "5.0", "Content": "I own and use five \"Leicasonics,\" so I know how great they are. They are the leaders in digital cameras, the innovators! Just about all of the great technological advances were first brought out by Panasonic. As a former Vietnam combat photographer, I wanted a camera to use in all weather and the TS2 fills that bill perfectly! I am especially impressed by it's high speed and excellent picture quality. Panasonic Lumix DMC-TS2 14.1 MP Waterproof Digital Camera with 4.6x Optical Image Stabilized Zoom with 2.7-Inch LCD (Silver)Panasonic offers the ability to obtain Leica Optics at affordable prices.", "Date": "January 4, 2011"}, {"Title": "Dead after less than 2 years.", "Author": "Ben Davis \"fencing fiend\"", "ReviewID": "R3LRNIVGJLHS7S", "Overall": "1.0", "Content": "Sweet camera but it desperately needs a lens cover like the olympus! 16 gigabyte card will get you over 2000 14 MP pictures!  Saweeet!  Menus are a little confusing and take some getting use to.  LED light for the video is smart but blinding up close, I guess there is a firmware download that might address this issue.  Only came with a CD so I have no way of installing the software of my CD-less laptop.  Isn't it about time they start using Micro SD cards for this stuff!?I love the weight, feel, and look of this camera, plus it can take a beating!I have an older blu-ray player, inserted the SD card directly into the player and was able to play the 720HD video directly from the card without messing around with anything.  I used avchd lite recording mode (default).The silicone cover is a pain in the @ss, I'm going to cut holes in it so I can take out the SD card without taking off this cover everytime, along with the battery..... and video output.....Will update this after a few months of use!UPDATE:  DEAD after 2 years.  No signs of water leakage, fails to read any sd cards and will only take pictures with its own internal 2 mp per picture memory.  It's now a paperweight at best.  My girlfriend bought a Canon this week and image quality is far superior than this one had ever been and it's also 12 mp's.", "Date": "January 3, 2011"}, {"Title": "Panasonic DMC-TS2 with video examples", "Author": "T. Delight", "ReviewID": "R3JMI8T48NLBPT", "Overall": "5.0", "Content": "I really really really like the complete ruggedness of this camera.  Hanging out with horses all day and being able to video/snap a pic and then shove it in a pocket without worrying about it falling out of said pocket and breaking is a dream!  I'm used to carrying around a nikon d200 with extended lens and so this is quite a new experience! However, that said, I am using this camera for it's movie capabilities mostly cuz of the ccd instead of the cmos chip, (not really the issue to say this is a photo camera, not a video camera, so nobody needs to flame me for such) and I find that this itty bitty camera is a little difficult to zoom in/out while videoing because of it's slightly awkward 'rectangular' design.  And the microphone picks up all kinds of staticy noises... but I tend to delete the video sound post processing and put in my own so what the heck! Not that big of a deal.  The video quality is lovely compared to my old Sony D8 except for the slight shakiness that all these new, small cameras have.  That is the main difference when comparing the old style cameras to anything new.  A tripod is unusable most of the places I go and the certain heft of the old style camera tended to make people hold more firmly and keep the video steadier.  But that heft also made me less likely to WANT to take the camera so it's kinda a catch-22.  Anyways, I use VirtualDub and the Deshaker filter to get rid of 'most' of the shakes and life is good for what I want!Since I can't seem to link directly to the videos, if you go to youtube and search for CheckerboardfarmsCA and through the videos of horses...\"Andalusian Mare for Sale: Contessa CK at her first Dressage Show\" was done with this camera on a tripod.\"Andalusian Mare for Sale: Contessa CK's Tricks\" was done with this camera held by hand.So don't look at the colors or 'sharpness' of the vids... post processing to enhance colors and then compression changes everything.  The actual video from the camera is sharp as a tack and lovely.  But do notice that the zoom in/out is a little abrupt and hard to keep smooth.  Also, that is the 'best' I could do as far as smoothing out the shakiness.  Someone else may do better but for a 'slightly' (minimally? :) ) average computer user,that is the best I could do in an amount of time that didn't exceed my kid's high school years... LOL", "Date": "December 19, 2010"}, {"Title": "BETTER THAN ANTICIPATED", "Author": "BRIAN", "ReviewID": "R2UB8PI1AXFWEV", "Overall": "5.0", "Content": "Had a difficult time choosing btw this one and the Canon.  Have had good experiences with both.  Yr ago bought one of the higher priced Panasonic and the pic results have been remarkable.  This experience and size led me to the Panasonic.  The quality of the pictures have been excellent, even when made into a poster.  Flash pics quite acceptable.  Wanted a compact rugged camera and this one is fully meeting all requirements.  I am impressed that at this price have a camera at this quality level. Panasonic & Leica have hit the mark with this one.", "Date": "December 17, 2010"}, {"Title": "Snorkel-proof and drop-proof! Woo-hoo!", "Author": "AJ4733", "ReviewID": "R2GT2L83ZMGMH2", "Overall": "5.0", "Content": "After reviewing a ton of underwater cameras I took the leap of faith on this one.  It wasn't the sexiest camera out there looks-wise, but it had pretty solid performance reviews.  I bought it specifically to take snorkeling as I'd been so bummed with the awful disposable camera pictures our last trip.  I was terrified getting into the water with it but figured there was no turning back.  We snorkeled for over an hour and I drug it around in the ocean attached to the floating wrist strap (also highly recommended) I got for it with no problem.  It takes pictures faster than my old Canon which was great - quick focus. And it took pretty amazing pictures I thought - in and out of the water.  My kids also knocked it out of my hands at one point and it dropped to the ground in its rubber casing that comes with it and again, no problem.  I am THRILLED. :)", "Date": "December 12, 2010"}, {"Title": "Tough camera", "Author": "M. Albrecht", "ReviewID": "R1YL5ZYCUWWBV5", "Overall": "5.0", "Content": "I bought it for work, having to take pictures outside throughout the year.  It works great.  It's heft is indicative of its sturdiness.  Not a heavy camera, but not an all plastic one either.The shutter lag time is minimal for a non-SLR camera.  The video high quality and the microphone is great for a camera. The optical zoom is sufficient for how I use it.Yes, I have dropped it, and it keeps working.  I took it snorkeling and my only complaint was self-inflicted: If you use it in water, don't forget to wipe the lens off.", "Date": "December 4, 2010"}, {"Title": "Excellent...", "Author": "Peter L. Szmrecsanyi", "ReviewID": "R25BSBK5A1C1JS", "Overall": "5.0", "Content": "Excellent camera, was in between this one and the Olympus Stylus Tough but I'm really glad I went with the Panasonic as the image quality is excellent. Another feature that impressed me was night time photo, they came out really well, and the video recording which has great quality too!", "Date": "November 8, 2010"}, {"Title": "WoW ! This Camera is Perfection !", "Author": "SemperFuzz", "ReviewID": "RFDAS466YRIGU", "Overall": "5.0", "Content": "Sold my Nikon SLR D40-x and bought this camera and never looked back.  Rugged, compact, comes with a protective clear silicone cover.  Battery lasts a long time and pictures are beautiful.  Buy it you will Love it.", "Date": "October 29, 2010"}, {"Title": "I does what it's meant to.", "Author": "B. Hall", "ReviewID": "R18AWUM7KQ7UIF", "Overall": "5.0", "Content": "We purchased the TS2 shortly before our trip to Hawaii.  I thought about purchasing the Canon PowerShot D10, but my son wanted to get a camera that looked more like a camera, not a toy.  I own a Nikon D-90 and didn't want to expose it to the beach environment.So, off we go to Hawaii and three days of snorkeling.  Granted all of our time was spent in water no deeper than 10 feet, but the pictures we obtained were amzaing!  The colors were very good, especially on sunny days, and the focus was pretty sharp.  Because we had this camera we spent hours in the water.  We were able to take home pictures of a part of our trip we enjoyed the most and share them with family.This camera did what it said it would do.  I rinsed the saltwater and sand away from the silicon jacket.  All seals remained water-tight and we experienced no problems.  I don't think you'll be disappointed with the camera's performance.", "Date": "October 13, 2010"}, {"Title": "Great pocket camera", "Author": "Tattoo", "ReviewID": "RDS4SAPBALOOT", "Overall": "5.0", "Content": "This is a great pocket camera.  Simple to use in the auto mode and great capability in the specific modes.  Took on a 14 day backpack and got excellent pictures.  Even took one directly into the sun and the software completely removed the glare.  The rubber case protector makes handling east and adds protection.", "Date": "August 27, 2010"}, {"Title": "solid camera, best picture quality for its class...", "Author": "S. Mathai", "ReviewID": "R1DKFEZTR96J0T", "Overall": "4.0", "Content": "Once I received the camera, I found it to be a versatile tool. It has a ton of scenes you can choose from to get a better shot and the intelligent auto option makes taking shots a breeze. I like the security it provides in terms of its shockproof, waterproof, and crushproof capabilities but it does not take amazing photos. The photos are a bit grainy and it definitely doesn't compare to my former camera the panasonic lumix dmc1 in terms of picture quality but for it's class of indestructible cameras....it is the best in it's class. Overall I would recommend it to another klutz like myself.", "Date": "July 21, 2010"}, {"Title": "I tried to love it... not impressed + water damage", "Author": "Jeff K", "ReviewID": "R2L8CRRRD170BA", "Overall": "2.0", "Content": "I really tried to like this camera.  I did my homework, wanted something pocketable but still reasonably rugged and waterproof for an upcoming vacation.In full sun, it takes great pictures. in low light, my 3 year old Canon powershot does a MUCH better job.  all of my vacation pictures taken at night are worthless, including in slightly dim restaurants etc.The image stabilization doesnt seem to be very useful, videos are difficult to keep steady and in low light modes (longer lens opening) you must use a tripod.however, biggest problem is that the camera failed on me after a few days!  I was extremely paranoid about ensuring all doors were closed and locked, and that i washed it off after each use and let it dry completely.  Nevertheless, after the 4th day or so (probably went in the water 5 times for 45 minutes total), i noticed the screen fogging up.  within an hour, dead, with water in the lens and screen.Thankfully, the amazon vendor was extremely helpful in getting an RMA processed.  I hope that mine was just a lemon, because it is an attractive and feature filled camera.  its also possible that i caused the flooding, but i was genuinely careful and not in what i would consider a \"rough\" situation.  Unfortunately, I am now just looking at the Sony TX7 even though its neither rugged or waterproof since its just so pretty (and apparently takes good pics).", "Date": "June 4, 2010"}, {"Title": "much worse than expected", "Author": "Julian Thomas", "ReviewID": "R2TPXAZUM3CINO", "Overall": "1.0", "Content": "Had this camera (yellow color) for a few days. Pictures taken under bright sunlight with iA mode are very good and comparable to those taken by DMC-ZS1. Low light pictures are far worse. Video is not sharp and color is not bright even under bright sunlight with iA mode. Maybe I should play with other mode to see whether I could get better result. Audio is mono. With the included silicone case on, you can not take out battery/SD card or open the USB/HDMI door to transfer pictures to computer. The camera can be pretty comfortably fit into pocket but the lens has no cover so it might easily get scratched unless you put the camera in a case. Will check how it holds up in water soon.Update:Just got back from 7 day Caribbean cruise. The camera is dead just a few minutes into water when I was swimming at Magen beach with my kids in St, Thomas. The water where we were swimming is less than one meter deep! Although all the doors were closed and locked, water still got into the camera from somewhere. I could see water came out from INSIDE the camera once I removed the battery and the 16 GB SD card (also ruined) after dry up the outside of the camera and open the door on land. The lens and LCD screen also fogged up. Before get the camera into water, I carefully read the instruction from the manual and triple-checked to make sure that all the doors were closed and locked and even used the brush (yes, the camera comes with a small brush) to brush the rubber seal to make sure there is nothing there to cause leak! I read some customer reviews about water leaking from TS1 and thought TS2 is the improved model and should not have that concern. How wrong I am! I used to have a old Olympus waterproof camera. Though the shutter lag is almost unbearable, it was truly water-proof. I have taken fish pictures at least 2 m deep in the sea without problem. The TS2 is my 4th Panasonic camera. I used to have FZ10, FX9, ZS1 and really love them. This one is really a joke. I gave it one star because it could take ok picture and video on land before went into water! Waiting to return the camera.Update 2:[...]'s response to my return request is quick and polite (At the time I ordered it, amazon did not have the camera. My amazon order went to [...] directly). The return is quick and painless. Really great customer service!", "Date": "April 10, 2010"}, {"Title": "not worth the money", "Author": "Ted Fraedrich", "ReviewID": "R3IQB6CJJ5T3ME", "Overall": "2.0", "Content": "This camera has a high probability of taking an out of focus picture.  Low light pictures are never in focus.", "Date": "September 21, 2013"}, {"Title": "So far so good", "Author": "akas", "ReviewID": "RUBX3407FEQJG", "Overall": "5.0", "Content": "A compact point and shoot that can be submerged in the water. Took this on a cruise, snorkeling and ziplining. It held up very well. We made sure to read all the warnings and clean it as required after each excursion. Make sure it's dry before you open any part. Always use the plastic cover that gives it the anit-slip grip as well as keeps the doors securely in place.", "Date": "May 31, 2012"}, {"Title": "For Ski Mountaineering and Kayaking . .", "Author": "Cuica Maracas", "ReviewID": "RDX2EQGELOT7S", "Overall": "5.0", "Content": "This is a tough little guy with great photo quality through the  Leica lense.  Photo quality is quite decent and I've used it on extended winter mountaineering trips, whitewater kayaking, and out in the ocean.  We also have a non waterproof version of the Panasonic with better photo quality but this one has stood up to some pretty extremes conditions.  It would be nice if they had a threaded mini tripod tapped into the case, but ie had good luck just propping it on a case, etc.", "Date": "February 20, 2012"}, {"Title": "My pics come out way better than my friends& fast shooting.", "Author": "C. Ross", "ReviewID": "R2N3MSPZDAHB2G", "Overall": "5.0", "Content": "GREAT Camera! This has taken a beating on the beach, in kayaks,at concerts, underwater, pool, been dropped while biking, had drinks spilled on it at the dance club, been put in the cooler by mistake and still takes the fastest, best pictures of all my friends cameras. The lighting looks lovely, the moon, sunsets and nature shots  amazing, burst mode is like a stop action movie its so fast, and  I am the  worst photographer! I just play with the settings from sports to candlelight to sunset to underwater ect.This model is actually a replacement (free from panasonic/amazon.) The first camera worked for 350 days then underwater the buttons stopped working, so to take a picture youd have to turn the camera off and as soon as you turned it on it would take a picture (5 actually because the last setting i had it on was burst). Then turn it back off. None of the buttons were working. took it home, dried everything, same issue. so they said mail it in, it couldnt be fixed & they sent a replacement (which happened to be a newer better model.) So its my 3rd panasonic and its really, really great. REALLY!", "Date": "January 12, 2012"}, {"Title": "Sturdy but indoor pictures not so good", "Author": "Kjell", "ReviewID": "R2XRBTMISXGJRG", "Overall": "4.0", "Content": "Sturdy camera and good outdoor pictures. Indoor I am disappointed, though. Too dark with flash sometimes, and if I try without flash it is hard to get focus.", "Date": "November 3, 2011"}, {"Title": "Panasonic Lumix MMC-TS-2", "Author": "silverfox4646", "ReviewID": "R2107IHWMGUCSJ", "Overall": "2.0", "Content": "As Paul Harvey used to say. Now for the rest of the story. The camera is shockproof and waterproof and freeze proof but it is most defiantly not Fog proof. I needed to use this camera shooting couples from the water, on the sand, in the water or under the water. Well in each one of those setting the camera took anywhere from 20 to 35 min to temperature acclimate its self so I was stuck saying ok my camera lens has fogged up we need to wait before I can take photos of you in the water, and then ok I need to wait to take photos of you playing in the water. Now I am talking the Caribbean in Aug and Sept where the air temp and water temp are within 4% of each other if not the same and the camera would still fog up and not just for a min or 2. Now I know exactly what the problem is the outside glass that protects the lens needs a special gas that is used between window pains to keep them from fogging. There would be so much condensation on the inside of that glass and actual water droplet would form sometimes and then I was done for the day not just 20 to 30 min. A guy went out on a dive with the lumix and came back and said it took the whole 1st tank of air when he hit the water with the camera before it unfogged, Thank God, it was a 2 tank dive. I can assure you a skier that keeps the camera in his pocket and it is anywhere close to his body would not be able to take photos on a ski trip because as soon as he took that camera out that had been warmed by his body and exposed it to the cold air I think from my experience that camera would fog up in a nano second. Now if you can keep the temperature constant the lumix takes great photos and could not be easier to use just don't take it from the beach into the water or the other way around without expecting a 20 to 35 min defogging time.", "Date": "September 21, 2011"}, {"Title": "Not dependable enough", "Author": "RickM", "ReviewID": "R35WSS7B0Y3P71", "Overall": "2.0", "Content": "I bought my TS2 in 2010 in preparation for a diving/snorkeling trip to Fiji. The camera took good, not great, pictures and video both above and below the water for two days before the lens started fogging over after 10-15 minutes in the water. All the waterproof seals around the battery and connections were dry, but somehow moisture got into the lens casing and made the camera essentialy unusable underwater. The pictures it took were pretty good, but it began to fog up sooner and sooner. I returned it to Panasonic under warranty and they replaced it immediately, without arguement. (Note: Search around and you'll find a lot of threads about this exact problem with this camera)The replacement worked just great until a trip to Hawaii a month ago. It made it into the water once before failure. Out of nowhere, when the power button was pressed, an error message indicated the battery door was not closed. Well, yes it was! I checked it and cleaned it thoroughly and couldn't get past the problem. So two trips and the camera failed on me both times. I was out of Panasonic warranty by this time, but fortunately I'd bought a SquareTrade extended warranty and they paid me off for the camera because it couldn't be fixed.So, good design characteristics were undercut by poor execution of the build. I am a fan of Panasonic cameras and camcorders, so am very disappointed the TS2 didn't live up to it's marketing hype. Maybe the TS3 will be better. If you just need a ruggedized camera, with some water resistent characteristics I'd say it's great for that. If you really want a camera to go in the water with, get a waterproof case for a good P&S.; You'll end up with a better overall camera and better underwater protection.", "Date": "May 17, 2011"}, {"Title": "not so waterproof and average picture quality", "Author": "surf808", "ReviewID": "R14VSK02OF8CTF", "Overall": "1.0", "Content": "I recently made the jump from Canon to panasonic.  Read all the reviews and thought this would be a great waterproof camera to have.  The picture quality is comparable so long as you are outside during the day.  Anything with low light( inside, night time, sunset) has poor photo quality.  It served its purpose as a waterproof camera until 3 months into using it, it leaked and filled with water.  I promise, no sand was in it and the seals were well closed.  I sent the camera in for repairs.  Panasonic lost the camera for over a month and I had to send many hours on the phone trying to find someone who could help.  For warranty repairs, they charge $45 just to look at the camera and then $100 per hour to fix it.  That's a lot of money for a camera that will be outdated within a year.  Canon has never been a problem for me with repairs.  Ultimately, I now have a panasonic paperweight and will avoid their company at all costs in the future.", "Date": "May 4, 2011"}, {"Title": "underwater camera", "Author": "D. Garchow \"weed queen\"", "ReviewID": "R7E3HGTMX2BRL", "Overall": "4.0", "Content": "just got back from British Virgin Islands sailing on a 48ft katamaran for 9 days. camera was great for underwater pics & others. just haven't figured where the flash is. great for beach & when sailing. was watertight as far as i could see. 1st set of pics a little water was in the battery compartment but dried it out good overnite. took underwater pics the next day and after that - no water in compartment. seemed fine - still worked after that. still working now at home. was easy to figure out even without reading the instructions but you should practice settings at home first because there are a lot of to choose from. small/ compact/ lightweight. picture color great. pics turned out as good as any other digital camera i have. i'll use this for regular picture taking also. will be great to use when snowshoeing as instructions say can be used to 14 degress. i wish i used this camera more than i did on this trip for on-shore/non-water pics instead of the kodak because kodak bulkier and heavier. pics are just as good. 1st battery did seem to loose life fast (but did a lot of practice pics and played with settings before we left -maybe that's why) changed to second when 1 bar on battery display just so i wouldn't get stuck snorkeling with no camera battery underwater. second battery seemed to take many more pics than the 1st - second still almost full. between the 2 batteries took over 400 pics. would recommend camera to anyone. i also bought 2 batteries (do for all my cameras). got the class 10 sd card which holds more pics than a normal person can take in 4 lifetimes. i thought was kind of pricey only because i have 2 other digital cameras, but i now feel well worth the money. would be great if you do a lot of beachy, canoeing, pool stuff with kids/grandkids. follow the underwater instructions diligently.", "Date": "February 22, 2011"}, {"Title": "Awesome camera for the traveler or just picture taking junkie", "Author": "AnaS.", "ReviewID": "R1MLMWQ29Q4QD", "Overall": "5.0", "Content": "I bought this product from Amazon and just received it a few days ago.  Being curious, I decided to see what this baby could do before I leave for my 2-week adventure to Asia with friends (wanted to make sure that this camera could hold up to just about anything before taking off in case I had to buy a new camera).Well...I've gotta say...after spending the past 2 days testing it out I am in LOVE with this thing!  I've dunked it in the snow, dropped it a few times, even had a friend take some pictures during his scuba diving lesson to test out the underwater quality ...which was amazing by the way, even with really nothing around to take pictures of, the pictures of him came out great. :) I even tested it out for everyday use by taking it to the bar, taking pictures at night outside, even tried out the starry night feature on the scenery options.  Every single picture basically came out great.  I did have some issue with the flash timer but I'm still a newbie and learning my way through the camera features.The only thing that I wasn't crazy about was that this camera isn't as sleek as say the Sony Cybershot nor is it as thin and that it is only a 4.6 optical zoom...they need to make a good underwater camera with a higher optical zoom!!!!I'd say for travelling or just everyday use, this camera gets my vote.  Though to be honest, I will probably just use this as my travel camera due to its ability to be underwater and in colder temps and get myself the wide lens 12.1 optical zoom panasonic as my everyday camera as I like a camera with the ability to have a great zoom.", "Date": "January 14, 2011"}, {"Title": "Fantasic Camera (if you read the book)", "Author": "steve", "ReviewID": "R3LRP59A4OWQ3C", "Overall": "4.0", "Content": "I like most people like to pull a camera out and snap a picture. One can do that with this camera with moderate success...HOWEVER.....reading the cd that is included with the whole manual is mandatory reading to get the most out of the camera. I also echo other reviews that the lens position takes a little getting used to  and you WILL have a few shots early on with your finger in the picture. Also, I put a 32 gb card in the slot and the camera said it had +-5500 pics left.(as I expected). However only said it had 8 minutes of HD recording left. Called Panasonic and they had me reboot 3 times and then figured out that you can only take HD video in 8 minute bursts before putting in a chapter break. Not a big deal IF YOU READ THE MANUAL!!all in all.....good purchase and better than all the others.", "Date": "January 13, 2011"}, {"Title": "worked well for a while", "Author": "Amazon Customer \"Chet Brewer\"", "ReviewID": "R2Q6FJKNFXRRZW", "Overall": "3.0", "Content": "I bought this camera about 6 months ago for use around and in water. I used it on a couple of trips to the Caribbean as well as sea kayaking around my house. Picture quality was good and a lot of the presets worked well, especially water, motion, and sunset/night photography. I was pretty careful to clean camera and seals carefully after each trip to the beach, soaked in fresh water for 30 minutes then dried before removing battery or memory card. On my 8th or 9th snorkeling trip it looks like one of the seals let lose and the camera starting buzzing and shut down. I returned it to shore and soaked in fresh water before opening. It was full of water although the battery compartment orings still looked good.So on a sample size of one it looks like the ruggedness of this model is suspect. Wish it wasnt so because despite the clunky design it worked pretty well till it failed", "Date": "January 1, 2011"}, {"Title": "Great Camera", "Author": "mr. i", "ReviewID": "R2QIB85K8NR1MW", "Overall": "5.0", "Content": "I bought this for my girlfriend which has a habit of not taking care well of her electronics but was in need of a digital camera. She uses the camera constantly in a farm enviroment as well in hiking trips. We are constantly on the move and therefore the camera seemed like a good investment. The image quality is amazing! Highly recommended for outdoor people.", "Date": "December 28, 2010"}, {"Title": "Panasonic Lumix DMC-TS2", "Author": "Oscar", "ReviewID": "R2NJZDZDE28NR4", "Overall": "4.0", "Content": "Pros: Easy to use. Rugged design, yet stylish. Excellent picture quality. Cons: Wished it came with its own custom designed Panasonic leather case. No lens cover.Have used it now for over 3 months.  Very happy with it.", "Date": "December 15, 2010"}, {"Title": "Decent for a waterproof camera", "Author": "don y", "ReviewID": "R1WOETGVMC6E39", "Overall": "4.0", "Content": "Overall a pretty good camera- good resolution pictures, not crazily bad noise despite pretty high pixel count, stayed waterproof as advertised for (so far) a single use in a pool- didn't push it too hard, only 5ft depth.  Obviously not a worst case gritty salty sandy beach scenario that people are complaining about leaks on, but Panasonic/Lumix had so so so many notes on foreign debris in gaskets and such so that it seems you would be doomed if you attempted to switch cards or batteries on the beach.  Short of a much bulkier external housing camera with bombproof gaskets, I think Lumix did about as good as they could, keeping the form factor small and fairly pretty- I like it better than the asymmetric flowy shapes used by some other manufacturers.  Downsides - dunno why the heck (other than to charge people more $$ to replace) Lumix opted for a proprietary funky USB cable- not mini or micro USB.  Lose it and you're spending more than for just a generic mini/micro USB replacement.  In the end, maybe moot, because battery life is only average/adequate, you'll run out of power before you fill up a 16gb SDHC card whether running video or pictures with some flash. Since you have to pop open the battery/card hatch to recharge the battery anyway, might as well pop out the SD card each time to download, rather than using the USB cable.", "Date": "December 13, 2010"}, {"Title": "Excellent rugged camera", "Author": "Walter C. Bronson \"WaltBPE\"", "ReviewID": "R9GBJAB5EBSSL", "Overall": "4.0", "Content": "Just got back from first vacation with this camera.  If you like an active vacation and/or lifestyle and dont want to worry about carrying around an expensive fragile camera, but still want good pictures, this is the camera for you.  We spent time snorkling, hiking on a windy sandy beach, and zip lining.  The camera held up well throughout and took some very nice pictures of people, landscape, and underwater.  My only complaint is that it is a little slow between pictures, but I assume the burst mode will compensate for that if needed.  I had a rugged Olympus Stylus before this, which died snorkling on the last vacation.  My fault, had it in the water too long.  That was a great camera too, but did not take as good a picture as the Panasonic.For the size, zoom, ruggedness, and picture quality, thisis a great camera for active people.", "Date": "December 2, 2010"}, {"Title": "Was great...", "Author": "Christopher M. \"Chris\"", "ReviewID": "RWAYDKUWH8F4H", "Overall": "2.0", "Content": "I was debating between this, the Pentax Optio W90, the Olympus Tough 8010, and the Sony Tx5. In the end, the Lumix won out. I made the right choice. It has a sort of polished beauty, with a shiny silver finish, ruggedized sides, and a great LCD screen. It responds and turns on quickly, takes some pretty darn good pictures, and even better video. With my slightly easygoing testing of its endurance, it's performed admirably, taking some 6 foot drops onto wood. I haven't gotten a great chance to test its waterproofness aside from the sink, but I will update on that. It has a good locking system that I'm confident will keep the water out, and although idiot-proof is just something waiting to be proved wrong, it seems like it. It has a good menu, with tabs for video, pictures, and the intelligent-auto function. While it's zoom is slightly slow, it works very quietly in video, barely able to be heard. It's built-in memory will let you take about 8 high-res photos, about 10-20 seconds of video. With an 8-gigabit card, you can take upwards of 1,300 high-res pictures, and about 180 minutes of video, 70 minutes per video. It's battery life is good for a point-and-shoot, with around 370 pictures off of a full charge. It's software is standard, although it can crash. The pictures I've taken with it seem good, even at full digital zoom if it's given a chance to focus. I will update later...UPDATE:Unfortunately, the quality didn't last. I took it on a trip up Mt. Marcy in New York and put it into a very shallow stream(at most 3-4 inches deep) to take a picture of the cool stream bed. I took it out and continued on. Later, when I took another picture, it seemed fuzzy. When I looked at the lens, there was condensation all along the inside of it. Nearer to the top on the hike, disaster struck again. The camera slipped out of my hand, from about a foot and a half above some slab rock. I picked it up, but didn't turn it back on. Assuming it was okay, I kept going. A little while later, I decided to take a picture of a valley view near the top. To my surprise, when I turned it on, half the screen was blacked out. The camera still takes great pictures, as only the screen was damaged, not the lens, but I am extremely disappointed at the low quality. I will be looking for a replacement camera.", "Date": "November 12, 2010"}, {"Title": "Finally!", "Author": "trucky105", "ReviewID": "R200IPPU0MB08N", "Overall": "5.0", "Content": "We finally found a camera that keeps up with us!  From the beaches to the ski slopes this camera totally rocks!  Keep it clean and charged and it keeps up with you and takes awesome pictures!", "Date": "August 21, 2010"}, {"Title": "Great Camera", "Author": "P. Mason", "ReviewID": "RW023GTU4YAOZ", "Overall": "5.0", "Content": "Excellent camera.  This camera much faster than other cameras in its class.  Used the camera in the water and in the rain on a week long cruise, no issues at all.  Overall, great camera and takes very good pictures for a waterproof camera.", "Date": "August 9, 2010"}, {"Title": "great camera, needs a lense cover", "Author": "gearhead", "ReviewID": "R2IVYOWSZAYCY0", "Overall": "4.0", "Content": "Great solid camera, it's not 100% intuitive but easy enough to use.  My only real complaint and a a pretty big one is the lack of cover for the lens.  Its marketed as water proof and shock proof, for me that means mtn biking, snowmobiling but mainly water sports.  When paddle boarding or kite surfing it needs to be in a pocket, however there is no lens cover so I am worried about it scratching the lens.  It's too big to leave in a case and you wouldn't want the case to get wet.  Great camera, bad design without a lens that automatically closes like almost every other camera on the market.", "Date": "July 22, 2010"}, {"Title": "Disapointed by the video and especially the sound quality", "Author": "Greg", "ReviewID": "R1MMB6QEIE4UZ0", "Overall": "2.0", "Content": "My main use for this camera is to bring it in places where I would not dare bringing more fragile and expensive equipment. This is overall a decent rugged P&S; camera for pictures, although I still miss the better UI of my previous Canon. It is very dust proof, pretty solid and can be cleaned up easily. But I am totally disappointed by the video recording side. The image stabilization that does a good job for the pictures is failing totally on the videos. The continuous auto-focusing is actually continuously defocusing the video in low light or when zooming in and out (fortunately this can be turned off). More annoying is the sound quality. It's very bad compared to previous similar cameras I had. The camera has a very average sound quality in normal levels to start with (mono). But it cannot handle loud scenes properly. If you are planning to use this camera at events with high volumes, like concerts, with plenty of bass, you'll need to move a literally a few miles aways from the speakers. Otherwise the bass will be turn in clipping noise and the auto-leveling will attenuate brutally most of the rest of spectrum, until the beats stop for a few seconds. What a frustration! My previous P&S; (Canon SD870) did not have any of those problems and even if the video was not 720p, the result was a lot better. I was expecting something better for the price.", "Date": "September 16, 2010"}, {"Title": "Significant issues", "Author": "MoeAlfa \"emwmd\"", "ReviewID": "R3UUPWDO5G18MN", "Overall": "3.0", "Content": "Picture quality at higher optical zooms is simpy awful and the color balance is consistently too bluish.  However it is tough as nails and battery life is superb.  Have used now for several seasons of sailing, including some offshore races, where I just left it out in the cockpit for all to use, and have taken it snorkeling often.  No idea how it compares to other junky little waterproofs.", "Date": "January 12, 2014"}, {"Title": "Very good", "Author": "alex agranovich", "ReviewID": "R195JAZL70HQ20", "Overall": "5.0", "Content": "Reliable, user friendly. Resistant to water as suggested. Took it all over the world and it's never failed. Highly recomended", "Date": "December 17, 2013"}, {"Title": "Meh.....", "Author": "Derek Stone", "ReviewID": "R1VWE4CY2Z87XP", "Overall": "3.0", "Content": "No need for proprietary wiring.  Use a USB/Micro USB and call it a day, Panasonic.  For this reason, I will only look at electronics with 'easy to use/find' connection wiring.I refuse to buy another connecting wire, and therefore refuse to buy Panasonic again.  Folks, look for cameras that use USB's, for your own sanity.Camera works fine, but they got greedy with the wires.......so tedious.", "Date": "November 13, 2013"}, {"Title": "LOVE IT", "Author": "bill bronson", "ReviewID": "RMJ6ZKML2N3OL", "Overall": "5.0", "Content": "I love this camera.  Although I would love a DSLR, this is perfect for me, because I am prone to abusing cameras and like to have something that can handle some shock and some wear and tear.  I've had it 10 feet underwater, 15,000 feet up on a mountain (at -25F), in blowing dust and dirt, its been dropped on rocks in rivers and onto concrete from 5 feet, out of my truck and my pocket many times, and still takes awesome pictures.  I used it to take my wedding photos and they turned out great, with very good definition across the full field and great color.  For a point and shoot, this this is the best!!!", "Date": "October 31, 2013"}, {"Title": "Very good point and shoot..", "Author": "J. Ortiz", "ReviewID": "R2VQ0412Z6NGZU", "Overall": "5.0", "Content": "Very good camera.  Works extremely well underwater.  Panasonic has extremely good warranty.  Been using it for years, have taken hundreds of pictures.  Have been used at the local pool, water park, beach.  Work flawlessly...Highly recommend for anyone looking for a waterproof camera.", "Date": "October 8, 2013"}, {"Title": "Love this camera.  Drop it, submerge it.", "Author": "WIStoney", "ReviewID": "R2XQ47B07PC92O", "Overall": "5.0", "Content": "There are only two things I don't like...no lens cover (gets smudges and pocket lint) and no viewfinder with option to turn off the back screen, which is bright at night.  Other than that, this camera has been to combat in Iraq, travelled to Europe, swam in two oceans, canoe camping, mountain hiking.  It's tough and takes great pics.  With a 32 GB card, it will take a lot of pics!  I got a float strap for canoe trips and an extra battery.", "Date": "September 11, 2013"}, {"Title": "Bought in June 2010, used under water for 10+ times, still good!", "Author": "Yau Fong Chan \"Kylab\"", "ReviewID": "RDS00WNHJO1W4", "Overall": "5.0", "Content": "The image quality is ok if there is enough light. The iphone will produce better image than this camera when use indoor. However, the video quality is excellence by today's standard. The build quality is good as well. very tough.", "Date": "March 7, 2013"}, {"Title": "Great and Indestructible", "Author": "B. Dawson", "ReviewID": "R1MPNUYNF7CHQM", "Overall": "5.0", "Content": "This camera is amazing.  It takes great photo and videos!  It's also indestructible.  Waterproof, dustproof, freezeproof, shockproof!  We use it snowboarding and it has always worked like a charm (even when my Sony stopped working at -36!).  Definitely worth the price of admission.", "Date": "March 6, 2013"}, {"Title": "Perfect Camera for travels and outdoors!", "Author": "C. Mao", "ReviewID": "R1MXSAGPEUT5MR", "Overall": "5.0", "Content": "Bought this camera for a present for my then boyfriend, now husband.This camera has now been to the beaches and coast off of Belize, to snowboarding trips in Colorado, to the water park in Texas, and on many hikes.It withstands all that is stated in the product description.Pros: Ease of use, different features for different settings (underwater, portrait, etc), durability and ruggedness, and quality of photos, small enough to fit in your pocket without fear of breaking it, great design.Cons: Pricey (but well worth it).I also own a Nikon D90, and have had several other cheaper and smaller cameras. Various things happened to those various cameras such as: salt water damage from living by the beach, breaking from dropping the camera. One of the toughest things with a larger camera is the difficulty of carrying it.I have been able to take this camera everywhere without the anxiety of \"hurting\" it and having to buy a new one.The Megapixels on this camera is also the same as my DSLR so the pictures come out great. I would highly recommend this camera for someone who is active and plans on using this camera in any environment. I would rather have this one versatile camera then have all the other cameras I've ever bought.", "Date": "March 5, 2013"}, {"Title": "NOT FOR UNDERWATER USE", "Author": "S. Fry", "ReviewID": "RS9JB04UYEMLG", "Overall": "1.0", "Content": "had this camera for over a year, fine for \"rain use\" but went snorkeling with it, and the seals failed & leaked on the second swim!  Of course it's out of warranty and Panasonic want $180 to fix it.  NO THANKS!  I'll get a \"real\" underwater camera next trip.", "Date": "July 16, 2012"}, {"Title": "Amazing!!!!", "Author": "Courtney", "ReviewID": "R1GF9HASGWW99T", "Overall": "5.0", "Content": "I've had this camera for about 2 years. I've used it underwater many times but typically have used it as a point and shoot camera. I've always loved it, but yesterday, I was shocked and amazed!! I was tubing in a river that had some rapids. I had my camera with me. T the very end of the river, I was flipped from my tube and my camera was gone!!  I was heartbroken....I had tons of pics that I had not transferred!!  Six hours later, my cousin and I remember that the river becomes much shallower after the dam closes. So we head down in an attempt to figure out exactly where I lost the camera. I was excited to look, but at that point was thinking that if by some miracle we found the camera, it surely wouldn't work after 6 hours in the water. After wading through the river for about a mile, we found the spot where the camera was lost. And 6 inches away, is my camera wedged between some rocks!!!  We grab it and the first thing I attempt to do is turn it on....and it works!!!! I am so shocked that after 6 hours in a rocky river, in a spot where the current was literally knocking us over, my camera survived and is as good as new!!! I HIGHLY recommend this camera!!!!", "Date": "July 10, 2012"}, {"Title": "Everyday-use sort of camera", "Author": "J. Kent", "ReviewID": "R381OSCDKZBG1G", "Overall": "4.0", "Content": "I bought this as an everyday-use sort of camera. I've been using it for a while and it isn't perfect, but it does an okay job for most things.The main failing of this camera has to be its poor low-light performance. I'm by no means a photographic expert, but the small lens and sensor combined are the likely culprits. This problem is exacerbated somewhat by the relatively small built in flash.The other major quality gripe I have is the resolution. The optics of this camera are not even close to resolving 14 MP. Zoom in on any pic from this camera, and you will see blur long before you see pixels. Think of this camera as closer to 8MP maybe, or less even.Beyond the quality issues the functionality of this camera is great. The 5x optical zoom is plenty for a pocket camera like this, and zooming during video is nice.The camera boots up in about a second, and can take pretty quick shots; this makes it great catching unexpected pictures. Plus, there is no telescoping lens or lens cap to wait far. It is literally 3 seconds between having the camera in your pocket and taking a picture.Being water proof and rugged is a major plus. I've taken lots of underwater shots with it; there is less light available underwater, which can be an issue, but otherwise it works great.This camera does a good job of being there when you need it, and getting the shot you want in time. I recommend it on these attributes; if that isn't what you need there are cheaper cameras with better quality.", "Date": "May 6, 2011"}, {"Title": "Very disappointed. Bad waterproof camera.", "Author": "mgalleri", "ReviewID": "R26CIWFHKRGYC9", "Overall": "1.0", "Content": "I bought this camera before a vacation trip to the Caribbean sea at Colombia. I'll ready had a good camera but I was looking for a waterproof good one. When I received it, I tried it in a swimming pool and it worked ok. And since the pictures outside the water were also good quality, I just travelled with my brand new waterproof Panasonic camera. But I was very disappointed after the first time I introduced into the water. I just could take 2 pictures before the camera hung because it had water inside. And all the lock buttons were in the right place. Now, it is not working anymore.", "Date": "April 4, 2011"}, {"Title": "Shots I never could have taken", "Author": "Lenny", "ReviewID": "R39IC90Y8ZY7ZF", "Overall": "4.0", "Content": "I bought this on Amazon, but they delivered it too late, so I actually ended up buying it in a physical shop and returning the Amazon one. Top marks to Amazon for their return policy!That over with. The camera is waterproof at least to a depth of about 3ft - I took some underwater shots just for fun. I bought this camera to allow me to take a camera into the water with me rather than snorkelling / or underwater shots. I took it into the sea, into a waterfall, a lake, and got holiday snaps I would never have had with a standard digital camera.Main PointsDoes what it says on the tin - it is waterproof.Picture Quality - I think it is good. Not as good as a comparably priced non-waterproof camera, but that is not the point!It floats with an Olympus STRAP FLOAT attached. This was a concern of mine when purchasing it. A float strap is a must if you plan on taking it into the sea / river / lake.Burst mode - fast somewhere between 3 - 4 per second is my estimation. V good for taking action shots - surfing etc.No viewfinder - only a screen. (I think this is good, because it allows you to see more easily if there is a droplet of water on the lens)Optical zoom - better than I expected. (It is self contained inside the camera)Ease of use: I found it simple to use. No complaints.Why not 5 stars?It should be possible for the camera itself to detect when there is water on the lens clouding the image. Maybe I'm being picky, and I don;t know if any camera has that built in, but software should be able to detect it pretty easily and put a warning signal on the screen.", "Date": "February 17, 2011"}, {"Title": "Nice camera - worth the money", "Author": "Capt Dan", "ReviewID": "R52LNNN883E63", "Overall": "5.0", "Content": "I did a good bit of research before buying this camera.  I started searching after using one someone else had.  I figured I could find something as good but cheaper.  That didn't happen.Some things to know!!  I saw this camera cheaper from a few NYC dealers.  They actually told me the camera was shipped with a non-recharable disposable battery!  They wanted $80 for the real battery.  Not a bargin.I had a camera mask and it leaked pretty fast.  This camera has gone down about 20ft so far and it was fine.  I've taken a lot of pictures and had it in saltwater maybe half a dozen times so far and it has been a champ.The only problem I've encountered is that you can't see the display under water unless you have a mask on.  So I've missed some pics.  The camera mask idea is a good one but they can only go to 10 ft and mine leaked at 10 the second time I used it.I got this from Amazon and the customer service was amazingly great!  Very helpful (I needed to change the shipping address the next day as I got a ticket for the sunny Carib where I'm using this camera.)", "Date": "February 12, 2011"}, {"Title": "Great camera!", "Author": "Tom", "ReviewID": "R2S0DRBA89IN6U", "Overall": "5.0", "Content": "This is my first camera and it is great! I am not an expert on pictures or video quality but for my needs this camera is great.Style - superb, looks great and feels comfortable to hold the button layout is awesome and easy to use setup(there is also an auto setting so you do not have to configure anything the camera does it for you).ruggedness - have not really dropped it but did test it and it withstood a drop of about 4' or so. I just wouldn't advise slamming it on the ground.waterproof - GREAT! I was nervous at first because it said in the instructions nothing could be on the orange seals for the compartments or water would get in. I used the supplied brush and cleaned it good. then took it in my pool. No leaks at all. I went all the way to the bottom which is 6' and worked perfectly.overall the quality is great and pictures were fantastic in and out of water. The videos for this are also not bad however the mic on the camera sometimes might get covered by a finger which muffles the voice. However I would recommend this camera to anyone and I think is one of the best waterproof cameras!", "Date": "February 9, 2011"}, {"Title": "Not what I expected for the price...", "Author": "Lisa A. Roper", "ReviewID": "R1SRCUFCET7HYG", "Overall": "3.0", "Content": "We've had this camera now for over six months and we are not very happy with it.It's not very easy for my non-techy husband to use.  When taking pictures indoors or in low light... the automatic photos all come out very grainy and most are blurry as well.  The pictures are overwhelmingly have a red or yellow overtone.  We missed some great pics at our friends wedding and on our honeymoon.  Outdoor bright light pictures are fine, nothing to brag about, but not bad either.The saving grace on this was the video option and the underwater capability... The HD video quality is AMAZING (although, you'll want to change the default format or you won't be able to share it with other people).  We used it for our honeymoon in Mexico and the in the water pics/video's came out pretty good... shots we otherwise would not have had.Overall we are NOT happy with the camera, especially at the price we paid.  My $89 7 meg Sony Cybershot takes MUCH better pictures.  I wish I had either purchased the bulkier Sony or the lower priced Olympus.", "Date": "February 3, 2011"}, {"Title": "love it!", "Author": "jojo", "ReviewID": "R2JFN8W7TFC2AD", "Overall": "5.0", "Content": "so far, love this thing!  my new every day point and shoot.  the extra stabelizer is a little overrated, but overall, you can't go wrong with this camera.  video isn't so good in dark conditions, but there are a lot of functions that can be played with that i haven't gotten to.  i totally recommend this camera based on picture quality, style, and waterproofness...", "Date": "January 31, 2011"}, {"Title": "Awesome camera!", "Author": "Rita", "ReviewID": "R1YPDD7V41Q2F1", "Overall": "5.0", "Content": "I bought this camera because I wanted to make sure I had a high quality camera that I could take anywhere  for pics and recording video.  I've dropped this camera about 5 times already, not unusual for me though; but not having to replace it is awesome! I use the iA mode a lot, it works very well and for a point and shoot camera this it the best : D  .  I've put some pics up of a few pics that I've taken, I really enjoy taking pictures whenever I can now!  I have an aquarium so I took some pics \"underwater\" of my axolotls to check out the quality; very nice pics as well!  Hope this review helps!", "Date": "January 30, 2011"}, {"Title": "Almost does it all !!", "Author": "cmlegend", "ReviewID": "R1GPVMUJIDCBT4", "Overall": "4.0", "Content": "I was looking for a camera that would last as long as my Canon SD600 which in fact lasted 5 years. But why not get an underwater camera which I can enjoy filming my kids in the pool or doign some video on my next sun destination trips...I have done over 4 hours of camera comparaison from different high ranked camera review sites and the 2 best were Canon D10 and Lumix TS2.Canon is cheaper but is bulky and looks like a kids toy. So Lumix was the best choice since it can easily be put away in your pocket without looking like you have a piece of salami in your shorts !I bought the silver but I'm always regretting not getting the blue one but my wife keeps telling me that Silver looks more professional and not too flashy...Alright, now the review... This camera does it all except for 2 things... Its perfect underwater, the HD movies are easy to import into your favorite movie editing software. The pics looks amazing and it really is a ncie camera to look at. The silicone jacket can protect the camera from scratches but unless you do skateboard with it, its really not useful. It makes the camera difficult to put in your pocket... The IAF mode (intelligent pics) is the best since you don;t have to worry about anything... simply point and shoot and the pic will look very good....The cons: So far I only saw 2 things they should of done... the custom timer doesn't let you take more than 1 pics at a time... my old Canon could let you customize it between 1 and 10 pics in one timer.The other thing is the lense... its always open so you can scratch it. Panasonic says that the lenses is anti-scratch but between you and I..it will eventually scratch. Unlike the Olympus which has the little closing trap... but the Olympus sucks in rating...So far I am very impressed... and totally recommend buying it. Even if you don't live near the ocean... since you can use this camera everywhere and not worry about anything. Beach, snow, outdoors, on a boat or anywhere else...One last thing... if you take it on a boat or go in the ocean, get the floating  wrist strap from Olympus.. it could help if you ever drop it in the water.Cheers !", "Date": "January 28, 2011"}, {"Title": "Awesome", "Author": "jbolf6", "ReviewID": "R2QB08199EZ54T", "Overall": "5.0", "Content": "This camera is awesome. I use it metal detecting and it performs flawless. Need a camera like this if you are going to use it out doors contantly", "Date": "January 27, 2011"}, {"Title": "Bad pictures", "Author": "Dr Pots", "ReviewID": "R3CFX4YJTP8HP6", "Overall": "2.0", "Content": "I bought this camera for it's toughness and waterproof ability and for being a supposedly high spec point and shoot.Largely disappointed with this camera. Comparing to a canon of a similar price but not water proof, the pictures are really, really bad. Colors are muted and grainy, with focus more by luck than judgment. Don't attempt to use the auto settings as you will end up with worthless grainy images. The camera has extremely slow focusing and very bad light metering. The lens is in a ridiculous place where you always put your finger when you hold the camera. The camera randomly takes lower resolution images if it thinks the conditions are not right.I never been more disappointed with a cost to quality ratio. It is as bad as an old disposable 35 mm film camera.On the positive, if you can get the camera to focus on the subject you want, the video can be really good, and underwater it takes OK pictures, but no where near as good as my 4 year old much lower spec canon SD-1000 in a waterproof case.If I could return this I would.", "Date": "January 22, 2011"}, {"Title": "Poor Pictures with Flash", "Author": "JeffS", "ReviewID": "R1F4FFLOW62TWM", "Overall": "2.0", "Content": "Any pictures with a flash had an orange hue, regardless of where I took them.  Outside pictures were very good, and the video was excellent quality.  Too many rules to follow to ensure water proof and dust proof.  They should make it easier, and definitely fix flash shots. I had a Pentax Optio before - much better shots than this one but it finally broke.  I returned the Panasonic - can't live with the poor flash quality.", "Date": "January 21, 2011"}, {"Title": "3.5 Star rating.", "Author": "Crabs Rugby", "ReviewID": "R1G5MYPGCUCBWO", "Overall": "3.0", "Content": "My fiance and I bought this for our honeymoon in the virgin islands. We wanted a SLR but they are too big to travel with and are super expensive with extra lenses, and waterproof casings... That being said we stayed at a condo on the beach and for several days had the patio doors open (ie warm in room) and then we decided to use the AC about 4 days in the inside of the camera lense fogged up! Yes that was probably our fault but keep in mind with a sealed waterproof camera you can end up condensing moisture inside the camera when going from warm to cold. We opened the room back up to the outside air and it fixed itself over night...Other than that the underwater seals did great! No water leakage. However the photos aren't the best.. I had an old 7MP sony with a Zeiss lense and it took much better land scape and night photos. There is some noise in the backgound of the photos out of the water. In the water I found myself needing to take the same picture 2-4 times to get a good one to keep. Photoshop does help correct some of color and light issues you get under water. the other problem is keeping the camera still while snorkeling... The image stabilization works ok but the camera definatly works better if you are under water and not moving. I'm sure the pictures would get better if I knew how to use all the menus and functions that it has built in... But let's be honest with ourselves here... How many of us are going to learn what each sub-menu item does and remember how to use it? I am a point a click user for the most part and have written this review as such.The Ruggedness is good as i have dropped it several times (another good reason to buy if you are hard on electronics). Battery life is ok... We turn it off and on a lot and that seems to wear the battery down quickly and when using it on a regular basis during the day... Well you'll need to recharge every night to be safe for the next day.I was hoping to \"have it all\" with this camera. Great pic quality, good video, and great under water, and superior ruggedness. We ended up with an ok pic quality, great ruggedness, and haven't tested the video yet. I have found the 14mp will allow you to crop down a shot significantly and still be decent quality to print and put on the wall. All in all it's a good little camera and we would probably buy again for use on the beach, in water, and small enough to travel with. We'll probably still get an SLR in the future for better pic quality when we want it. I posted 4 pics of from the night palm tree shot to the scenic view of a bay.", "Date": "January 21, 2011"}, {"Title": "High level of noise in low-light situations", "Author": "chins01", "ReviewID": "RUDTKBV1ZXTN", "Overall": "2.0", "Content": "I purchased this camera with the intent to use it as an all purpose camera. I was looking for a camera that could work just as well on a kayaking or hiking trip as at a wedding. While this camera may be great for outdoor shots taken in bright light, the picture quality is awful for indoor pictures taken in semi-low light situations. The pictures are very noisy. I hesitated to give this camera two stars because I think the rating really depends on your intended use. If you'll be using it mainly outside in rugged situations I'd probably give it 4 stars. If you intend to use it as an all purpose camera it's worth about 1 star. I haven't tested the underwater features yet because I unfortunately plan to return the camera.", "Date": "January 16, 2011"}, {"Title": "Bought one for my brother, and he loves it.", "Author": "Evan", "ReviewID": "RD8OCHRGLPO29", "Overall": "5.0", "Content": "My brother is a trained photographer, and as far as waterproof, ruggedized cameras go this one is great.  He's very happy with the image quality day and night, plus it hasn't had an issue in water.  It's a little pricey, but a great camera nonetheless.", "Date": "January 15, 2011"}, {"Title": "It works underwater", "Author": "Jonathan Gillaspie", "ReviewID": "R3DSUAI9PXE8ER", "Overall": "4.0", "Content": "It doesn't take the best pictures I've ever seen, but the ability to take it into the pool or give it to someone who is likely to drop it without worrying about it makes up for it.", "Date": "January 12, 2011"}, {"Title": "Lack of lens cover fatal flaw", "Author": "Jordan Kushner", "ReviewID": "R1BFW7L7QDQGVW", "Overall": "2.0", "Content": "Took one night of pictures.  Most pictures were ruined by dust particles on the lens.  If you carry your camera in a pocket, rather than in a case, this isn't the camera for you.Amazon's return policy/procedure is painless and fast.  Much more convenient than waiting in line at Best Buy.  Kudos to Amazon for that.", "Date": "January 11, 2011"}, {"Title": "Great Camera", "Author": "mikew", "ReviewID": "R3G31Z5Z8OU9XL", "Overall": "5.0", "Content": "Puchased this camera on a recommendation from a friend for a family trip to the Bahamas. Wanted something to use while snorkling and at the water parks. Worked great, easy to use and helped capture a lot of great moments. No problem in the water and veery clear pictures and videos.", "Date": "January 10, 2011"}, {"Title": "In the short time I've had it it's great.", "Author": "bisjack", "ReviewID": "R24WD7XURC7XPZ", "Overall": "4.0", "Content": "I received this camera yesterday and since it's winter in Indiana I've not had a chance to be in the water with it, yet.  The picture quality is just as good if not better than the other Panasonic point and shoots that I own.  Even though I was warned that the waterproof cameras don't shoot as well as the others.  Not true with this one.The styling is modern and attractive.  The menu is easily negotiated.  The one irritant is the instructions about waterproofing it's operation that comes on everytime I turn it on.  I've been shooting outdoors and indoors with it with and without flash.  Great detail and the red-eye eliminator really works.  I give this a 4 star rating at this time only because I haven't had the opportunity to take it in the water.  For a dry alnd point and shoot it's a 5 star.  After I get some wet experience I may want to modify this rating.", "Date": "December 4, 2010"}, {"Title": "Not so perfect... Camera for Outdoors Lovers.. updated review due to leakage", "Author": "Amer", "ReviewID": "R1SSQZ1YY16GZP", "Overall": "3.0", "Content": "I got this camera yesterday from BH photo for [...] bucks. I use my cellphone camera for regular day to day photos. I am minimalist & prefer to carry as little as possible. So I will use this camera only for adventures.This is big but not too big camera. It will fit in your jeans but tightly. A lot of people were complaining on online forums/reviews that zoom & shutter buttons are too close, but I think it's not really any problem for most people. Perhaps people with really thick fingers will have some issues.Controls are very natural & easy to figure out without reading the manual.The supplied sleeve is perfect. I had another waterproof camera before this one. I knew that not to open battery cover underwater but one of my friend opened it underwater & ruined the camera. I will keep this camera in sleeve to prevent accidentally opening battery cover under water.Photo quality is pretty good. I haven't done enough tests but really this camera is for capturing great adventure shots and NOT for producing billboard sized advertisements. Indoor photos came out perfect with & without flash. I will take some outdoors photos this weekend. (weekend starts in 2 hours)Only complaint I have is that I wish this camera was slimmer & slightly more stylish. Then I could use it as everyday camera as well. And then it would be 5 stars camera.--------------------------Update 6/20/2011After a year it seems, seals are not as tight as last year. I was at pool this weekend when my camera decided to stop working. Battery was fully charged. Took it home, saw some moisture leaking in HDMI compartment. I let it dry overnight and it started to work again. but not sure if I will be using it underwater anymore now.I learned that you suppose to apply silicon gel to water seals every time you take it under water???So I took one star off.", "Date": "August 6, 2010"}, {"Title": "Highly recommend", "Author": "ASchrad3", "ReviewID": "R31N9WWHP179ZB", "Overall": "5.0", "Content": "This camera takes great pictures / videos. I am very impressed and would highly recommend.", "Date": "July 20, 2010"}, {"Title": "great above and under water photos", "Author": "Mary Ann E.", "ReviewID": "R1D6TU2P29D3BE", "Overall": "5.0", "Content": "We purchased this camera before a trip to Big Island, Hawaii hoping to have one camera to take land and under water photos.  We are pleasantly satisfied.  The photos we took on land were very clear and sharp....and even more pleased by the photos we took underwater while snorkeling.  The photos are crisp and clear both above and below water.  We love having just one camera for both!", "Date": "July 20, 2010"}, {"Title": "Best camera you could ever buy", "Author": "Tori", "ReviewID": "R1OSOSAMGQ8Q78", "Overall": "5.0", "Content": "This is honestly the best camera that you could ever buy.  The picture and video quality are both excellent. Works great in the pool and in the water at the beach too. What impressed me most about this camera is that i actually dropped it in the mud and then ran it over with an ATV when i was on vacation and it still works perfectly.  This camera is a great value for the price.  Buy this camera and you will not be disapointed!!!", "Date": "September 11, 2010"}, {"Title": "Great Kayaking Camera", "Author": "Reeeeeeeder", "ReviewID": "R1MI99XSUC3BYQ", "Overall": "4.0", "Content": "used this in windy and very wet conditions kayaking, so far so good.camera could be slimmer, and the controls are pretty lame.. but I just hit 'record' and it works fairly good.just happy to have camera I can use anywhere, and video is very good once you set it to Quicktime recording", "Date": "November 22, 2010"}, {"Title": "Get One!  This is a great camera.", "Author": "RML", "ReviewID": "R1VDDNQXYFEP0N", "Overall": "5.0", "Content": "I shoot pro Nikon SLR's and really like the Lumix point and shoots.  This one is great.  The video has both formats and the usual high quality well saturated pics from the camera.  Even though it is a bit heavier than the non waterproof models, I like the ease of the controls.  The are bigger and easier to use.  Underwater the images are fantastic.  Great camera and you will love it.", "Date": "July 6, 2010"}, {"Title": "Great photos and video", "Author": "John Antista", "ReviewID": "RS6WJ9C9I59O6", "Overall": "5.0", "Content": "Very easy to operate. HD video was impressive - the zoom and management of light levels in particular - and the format played well on my PC without the need to download any additional drivers, etc (Windows7 machine).  Flash is not overly bright and shoots well in low light with relatively little graininess.  It also seems better built / engineered than the competing Olympus models, also offering better video than the equivalent models.", "Date": "April 25, 2010"}, {"Title": "Great service from Amazon but really bad camara for panasonic", "Author": "Carmen Carrero", "ReviewID": "R2N00SYH1EEBVK", "Overall": "1.0", "Content": "Like it is a water proof camara in one year I only usted a couplu of times, the principal lens always got misty and after a year of bought, one of the locks of one of the camara doors, ( a little piece of plastic that locks the camara) just broke by itself, I sent the camara to panasonic in texas and they ask me to pay a fee of 180,00 for the repair when the camara costs now 200 american dollars, my revew DONT BUY THIS CAMARA!!! is a bad one and the service of panasonic does not work!", "Date": "June 7, 2012"}, {"Title": "rattles", "Author": "Olive", "ReviewID": "R25AH3Z41KGS71", "Overall": "3.0", "Content": "just received my camera yesterday and if i shake it something rattles inside. is this normal or should i contact amazon for a replacement? i havent even taken it outside yet, just took some test shots inside the house and it seems to be working. also, have not tested in underwater.", "Date": "January 20, 2011"}, {"Title": "Good water resistance, but afraid to use underwater", "Author": "Tom \"Tom\"", "ReviewID": "R2D1PBKE4BVLQG", "Overall": "3.0", "Content": "I have had the camera only a couple of weeks.  It is easy to operate and the pictures come out fine.  It seems reasonably rugged, but based on all the reports of issues with using it underwater, I view it as water resistant, not waterproof.  Since I intend it to be used during hikes and bike tours, it seems like a good fit.  Be aware that it is significantly more bulky and heavier than a similar camera which is not water resistant.", "Date": "January 12, 2011"}, {"Title": "Great until", "Author": "T. Cook \"UsedCarSalesman\"", "ReviewID": "R2ZYNK9IARBDWL", "Overall": "2.0", "Content": "I bought this camera while deployed to Africa for its so called ruggedness and reviews. I had it for a bout 2 weeks and went to lake Ghoubet for a little snorkeling. I checked the camera seals were clean, locked the doors on the camera was in the water for about two trips of 15 min at a depth of less then 3 feet. By the time I got back from the trip (about a 2 hour drive). The camera quit letting me take pictures, and now says \"turn off and turn on the camera\" after being on for a few min. I did take a lot of good pictures, prior to the issue, but you can get a lot of good pictures from a normal camera that isn't so called \"waterproof\" for half the price.", "Date": "August 22, 2010"}, {"Title": "This camera is the Bomb!!!", "Author": "Batman09 \"batman09\"", "ReviewID": "R16GS3ZH40MPBS", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moAGDA6D1EBJOUembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moAGDA6D1EBJOUrefresh_preplay() {\n\ndocument.getElementById(\"cv_moAGDA6D1EBJOUchiDiv\").innerHTML = document.getElementById(\"cv_moAGDA6D1EBJOUhiddenPre\").innerHTML;\n};\ncv_moAGDA6D1EBJOUrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moAGDA6D1EBJOUso;\t   \n\n\nfunction cv_moAGDA6D1EBJOUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moAGDA6D1EBJOUso = new SWFObject(swfLocation, \"cv_moAGDA6D1EBJOUAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moAGDA6D1EBJOUso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moAGDA6D1EBJOUso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moAGDA6D1EBJOUso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moAGDA6D1EBJOUso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moAGDA6D1EBJOUso.setAttribute(\"height\", swfHeight);\n          cv_moAGDA6D1EBJOUso.setAttribute(\"width\", swfWidth);\n          cv_moAGDA6D1EBJOUso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moAGDA6D1EBJOUso.write(\"cv_moAGDA6D1EBJOUflashcontent\")) {\n          fp_resizePlayerSpace('cv_moAGDA6D1EBJOU', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moAGDA6D1EBJOU';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moAGDA6D1EBJOU', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moAGDA6D1EBJOUloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moAGDA6D1EBJOU\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1OQ0Y3KV3Y9NE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1OQ0Y3KV3Y9NE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R16GS3ZH40MPBS\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1OQ0Y3KV3Y9NE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moAGDA6D1EBJOUduration')) {\n      document.getElementById('cv_moAGDA6D1EBJOUduration').style.display='none';\n    }\n    cv_moAGDA6D1EBJOUloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moAGDA6D1EBJOUloadSwf(movieID, playerVersion) {\n   return _cv_moAGDA6D1EBJOUloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moAGDA6D1EBJOUnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moAGDA6D1EBJOU', 0, h);\n}\n\nfunction cv_moAGDA6D1EBJOUresetPlayer(w,h,bw,cc) {\n  cv_moAGDA6D1EBJOUnewHeight(h);\n\n  cv_moAGDA6D1EBJOUso.addVariable(\"resetBandwidth\", bw);\n  cv_moAGDA6D1EBJOUso.addVariable(\"cacheCode\", cc);\n  cv_moAGDA6D1EBJOUso.setAttribute(\"height\", h);\n  cv_moAGDA6D1EBJOUso.setAttribute(\"width\", w);\n  cv_moAGDA6D1EBJOUso.write(\"cv_moAGDA6D1EBJOUflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moAGDA6D1EBJOURollOverImg = new Image();\ncv_moAGDA6D1EBJOURollOverImg.src = \"http://ecx.images-amazon.com/images/I/91cQ%2BusQVpS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moAGDA6D1EBJOUpreplay = document.getElementById('cv_moAGDA6D1EBJOUpreplayImageId');\nif (cv_moAGDA6D1EBJOUpreplay) {\n  cv_moAGDA6D1EBJOUpreplay.onmouseover = function() {\n    cv_moAGDA6D1EBJOUpreplay.src = \"http://ecx.images-amazon.com/images/I/91cQ%2BusQVpS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moAGDA6D1EBJOUpreplay.onmouseout = function() {\n    cv_moAGDA6D1EBJOUpreplay.src = \"http://ecx.images-amazon.com/images/I/91cQ%2BusQVpS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moAGDA6D1EBJOUpreplay.parentNode;\n\n  var cv_moAGDA6D1EBJOUcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moAGDA6D1EBJOUcurrentClick) {\n      return cv_moAGDA6D1EBJOUcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:00 MinsI took this camera to Hawaii.I had a great time!!!Did tons of snorkeling with it and took lots of pictures!!It takes incredible underwater pictures and video!!!Buy this camera....dont even look at the canon or the exlim....I looked at all of them for a couple of months....Im really glad I chose this camera!!!At 14.1mp takes great everyday pictures and video too!!!", "Date": "October 30, 2010"}, {"Title": "Don't buy this camera", "Author": "Rena P. Crispin", "ReviewID": "RFBBSAAI4TFPC", "Overall": "2.0", "Content": "don't get this camera unless you're prepared to deal with the hassles of transferring your photos from the camera to your computer. The manual is not helpful. I discovered that if I want to use the software that comes with the camera to transfer images, I have to remove all other photo editing software from my computer--photoshop, irfanview, etc. and even then it doesn't work. If you don't care about transferring images to your computer, but care about picture quality, don't get this camera. The quality of the images is poor. If you don't care about those two features but want something that claims to be rugged, give it a try. I never got to that point because I returned the camera.", "Date": "March 3, 2011"}, {"Title": "The Lumix Camera", "Author": "John Mohr", "ReviewID": "RFD2CJCNYFDR3", "Overall": "3.0", "Content": "The camera is a bit difficult to get used to.  The picture button is not as responsive as other small cameras I have owned and the flash is also slow in responding.  As a result we have missed pictures we might otherwise have enjoyed.As a result I will probably only use this camera during outdoor activities, e.g. fishing, golf, etc.I will probably look for a different camera for everyday use.", "Date": "August 14, 2010"}, {"Title": "Good :)", "Author": "Corygirl \"Corygirl :)\"", "ReviewID": "RCN8HZL8408PY", "Overall": "4.0", "Content": "I like this camera, but the only thing that I don't like, is that it doesn't have lens cover, good pictures, nice HD video", "Date": "July 13, 2010"}, {"Title": "Does not take kayaking video that's worth watching!", "Author": "R. KO", "ReviewID": "R339U78YUASU56", "Overall": "2.0", "Content": "It is a great sport camer for picure taking.  However, fine print in user manual says image stablization does not work for moving sujects --- translation: you have to SIT/STAND STILL and DO NOT PAN for the image stablization to work when you take video!  Otherwise the video footage shakes so much it is not worth watching!  I bought this mainly for taking video on kayaking outtings, guess what, none of the video footage taken with any kind of boat movement except in extreme flat water has so much hand induced (not boat induced) shaking and it makes the viewer sea sick.  It is such a shame that a device made for water sport can not handle day to day real water sport environment... I sincerely hope a firmeare upgrade fixes this problem!Updated 6/1/10:The problem is that small hand shakes are not being removed when the camera is moving along with the boat. I have no problem having the video panning with the boat movement, which gives the viewer the real life feeling of being on a boat. It is the handshakes that are not being removed because the image stablization fails to work when the camera is moving with the boat. My Sony point and shoot camera does not have this problem, even though the video shows the rocking effect from the boat, it is not shaking due to hand shakes.", "Date": "May 30, 2010"}, {"Title": "Huge Disappointment", "Author": "L. Qi", "ReviewID": "R1DU4PMCHAGYMX", "Overall": "1.0", "Content": "It's probably harsh for me to give it a 1 star. Because it's not worse than any other P/S camera currently on the market. But I just hate the way Panasonic(and other manufacturers as well) boost the pixel count to entice consumer while pay no attention to those real weakness of most P/S: dynamic range, noise etc.The picture taken with this camera is FULL OF NOISE. It's virtually useless on 14M pixel. Even under direct sunlight, ASA 50, noise is still everywhere. My Canon EOS-5D does a better job at ASA 1600.I had an 5 years old TZ2 camera does a better job than this brand new shining one. Why? Because TZ2 has much less pixel count on the same size of CCD!Manufacturers should stop pumping up pixels and deliver something real. It is absolutely nonsense to squeeze 14MB pixel into such a tiny chip. Even for APS size chips, 15~18M is the maximum", "Date": "July 21, 2010"}, {"Title": "very bad camera", "Author": "Stefano Desideri", "ReviewID": "RY76IOHOVEKWP", "Overall": "1.0", "Content": "I was waiting long time for this camera, on the paper i t was very good, but they have a lot of defect in conception.The quality of the picture is quite good in daylight but in the night the overall quality of the picture is very bad: you will just have a lot of noise. It is no protection on the lens: it very easy to put the fingers on it, then the quality of the picture will even worst.The next point is the zoom command: practically impossible to use!! The shoothing commad also is not well designed because is not where you are expecting.I take in the hand the \"Olympus miu\" and it seams much better from the design point of view: there is protection for the lens, zoom is ergonomically well made. If you really need underwater camera please buy Canon or Olympus.", "Date": "August 24, 2010"}, {"Title": "Bad seller", "Author": "Ggjax", "ReviewID": "R3KJPE2WAZ1UHV", "Overall": "1.0", "Content": "I gave 1 star to make sure everybody reads it. Dont buy from portable guy! Sent me an open item in box looks like trash. The camera itself could be 5 star but i had to reorder it from ebay! Bad amazon experience wont use them again.", "Date": "December 13, 2010"}, {"Title": "No Viewfinder", "Author": "H. Silver", "ReviewID": "R3CAIMW7KNGZ5U", "Overall": "1.0", "Content": "I cannot comment on the optics of this camera. I never took a picture with it. I took it out of the box, saw there was no viewfinder, put the camera back in the box, and returned it to Amazon. [Side note: Amazon's return procedures went very smoothly.] I guess it is just a personal thing with me, but I loathe trying to take a photo with the camera at arms length and the sun's glare bouncing off the LCD screen. I suppose it was my fault for not noticing that this camera didn't have a viewfinder before I ordered it, but I must have naively assumed that only cheap, crappy cameras lacked a viewfinder. My bad.", "Date": "September 1, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "The DMC-TS2 is dropproof from a height up to 6.6ft in accordance with the MIL-STD 810F Method 516.5-Shock test standard.\nWith freezeproof to -10 degrees C/14 degrees F, the DMC-TS2 supports shooting while skiing, snowboarding or skating.\nThe DMC-TS2 features an LED light that records beautiful motion images even in dusky underwater environments or at a nighttime camp.\nPhoto & Movie modes\nOptical Zoom 4.6x / Digital Zoom 1 4x", "Name": "Panasonic Lumix DMC-TS2 14.1 MP Waterproof Digital Camera with 4.6x Optical Image Stabilized Zoom with 2.7-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51LrcIf1J0L._SY300_.jpg", "ProductID": "B003960F7K"}}