{"Reviews": [{"Title": "Very Nice Camera, depending on what you are looking for", "Author": "H. Kotecha", "ReviewID": "R13AIGTDR2YUAM", "Overall": "5.0", "Content": "I have had this camera for over three weeks now and would like to share my thoughts on it.Firstly, the main attraction for me in this Camera was the Slow Motion video mode.I must say that i am not disappointed on that front. Not only does it allow shooting at 240, 420 and 1000fps, but it also has a 120fps shooting mode at VGA(640 X 480) quality. That is very impressive.Last i checked, this is the only product at around 250 bucks that will let you do that (and other cheaper Casio models).The photo quality of the camera is also surprisingly good for the price. There are many preset modes that are a click away, which let you pick the right settings for the scenario. Among these modes are the High Speed Lighting and the High Speed Night Scene. Both of these modes offer bright and clear pictures during the day and night resp, under low lighting, without needing a flash (I hate flash, it makes the photos look fake). The preset Macro mode also takes very nice pictures.One other big advantage of this camera, is the the High Speed Burst mode that is a button away. On pressing the button, it rapidly takes many images of the subject in action and slows it down for you on the LCD. You can then click whenever you feel the moment is right, to always get the desired picture.Since, this is getting too wordy, i will list some of the other good things that i noticed about this camera:1) A multi-motion capture mode that generates really cool images (Google this mode)2) Very stylish look and a bit of weight adds to the 'Rich' feel of the camera3) HD videos(720p) look great on a HDTV and otherwise4) The built-in video editor lets you chop the video the way you want (This is very helpful, as slow motion video capturing leads to some boring stuff if nothing is happening on screen)5) The audio quality from the mic is very good6) There is Eye-fi support, if you care7) A Youtube capture mode and direct Youtube uploading from the Software8) Ability to set your own Present modes, from photos you like9) If you lower the resolution to 7MP or 4MP, the optical zoom levels go up(7.9x at 4MP). It may not exactly be optical zoom (I dont hear the lens moving), but it is still much better than digital zoom.I also have a few quibbles about this camera:1) The Dedicated video record button is little tough to press with the thumb2) The battery life is okay3) The body attracts a lot of fingerprints4) The LCD quality is not the best5) The manual is almost pointless as it doesn't talk about the usage of a lot of featuresThere is also an older version of this camera on Amazon, the FC100, but this one has several advantages over that, mainly the Backlit CMOS sensor (for low-light photography) and the 120fps VGA shooting mode.Overall, you should definitely get this camera ifA) If you don't want a DSLR, but want a pocket Camera that has good enough quality to expose that little artist within you.B) If you love watching and shooting slow-motion videos and/or HD(720p) videos.C) You don't like tinkering with the settings but would like to have preset modes that do exactly what you want.", "Date": "May 13, 2010"}, {"Title": "Okay, but not as good as it predecessor (EX-FC100)", "Author": "Socalh2oskier \"Socalh2oskier\"", "ReviewID": "R2QM8XEJEZKDBM", "Overall": "3.0", "Content": "I \"upgraded\" to this camera because of reviews that raved about what a great camera this is, and how it supposedly \"improves\" upon the FC100 by taking 40 fps, instead of \"only\" 30 fps, and that it allegedly takes much better low-light shots.  Unfortunately, this purchase was a mistake.  The EX-FC150 is a nice camera, but the predecessor FC100 takes much better photos in all conditions, and especially in low light situations.  Thus, I am quite disappointed.  If I had never experienced the FC100, I would probably like this camera just fine, as it takes, for the most part, excellent photos.  It does improve upon the FC100 in one respect--continuous shooting mode now gives you photos at 9 mp, instead of the 6 mp of the FC100.  But this is the only improvement I see between the two.  And, given the choice, I prefer to put up with only 6 mp continuous mode photos in exchange for the vastly superior low-light capabilities of the FC100.So, all in all, this camera is okay, but unless you really need the increased megapixels of the FC150, I suspect you'll be much happier with, and save yourself some money, by ordering the FC100 instead.", "Date": "July 19, 2010"}, {"Title": "Great Camera from Casio", "Author": "Jeremy T. Hannan \"bboy\"", "ReviewID": "RU4IJXKGVE79A", "Overall": "5.0", "Content": "So I purchased the Ex-F150 with high hopes. And so far have been very pleased with the results.  When push comes to shove, the fc150 is a point and shoot, so you cannot expect the quality to be the same as its mother camera the fc100 slr. I previously owned a Canon Powershot 750 7.1Mpxl camera, and I think that the casio takes better pictures with its many settings for lowlight, high speed and numerous other settings.  These allow shots that were previously impossible with my Canon, the video looks fantastic (if you want to see the slowmotion vid's i have taken search my username \"bboysloth\" on youtube.My only complaint is that from the time I take the picture (which it always captures at the right time) to the time I can take the next picture takes a good 3-4seconds.  Probably due to the fact that with most of the settings the camera is performing multiple functions, and combining information of many photos that it took all at once to combine them into the great photo you see later. So given the functions that the camera is performing depending on settings, the wait time is understandable.My only other complaints are that the manual is HORRIBLE in teaching you how to really use the camera and its exorbant amount of cool features, which leaves it mostly up to you to figure out how to use each feature.  This IS facilitated by a very simple and straight forward menu, but never the less was a slight disappointment for me upon receiving the camera.  Also when you delete a photo, BE CAREFUL, because there is also an option (which I now hate) to delete all photos on the SD card right next to the delete 1 picture option, so if you are in a hurry, be careful not to wipeout all your pictures by accident (which has happened already to me twice).When you are using the high speed features for low light, fast moving, or anything else, the quality of the shot does reduce to 9M instead of the camera's full capability of 10M but unless you are making a HUGE blow poster of your creation, you will not notice the difference.Overall a great camera, especially for the many features and video options that you get.  Again, don't expect the video to out-due a camcorder, and don't expect that just because it has a CMOS sensor that it will outperform an SLR. But I would say that it is one of the closest things I have found in a point and shoot to getting the features of an SLR (and working at best buy has allowed me to test pretty much every camera out there).Hopefully this review helps.**I will also add (as I misplaced it quickly) the usb connector (to connect the camera to a computer/device) is kind of proprietary and hard to find. So be very careful to not misplace the cable, or you will have a great time finding another one...i do beleive it is a 6 pin mini usb to usb 2.0 cable...", "Date": "June 10, 2010"}, {"Title": "Adequate", "Author": "flatcurve", "ReviewID": "R1MMBHCSC31L83", "Overall": "3.0", "Content": "The pictures this camera takes are comparable to most other small point and shoot digital cameras in this price range. I also own a Sony and Canon Powershot. The Canon is my personal favorite for image quality, because I like the color balance the best. However that's not to say anything is wrong with this Casio.The reason I purchased this camera was simply because I needed to shoot some high speed video to evaluate the operation of a machine that I am building that runs at very high speeds. This camera was actually way cheaper than hiring a professional high speed crew to come out and shoot it for us, so I decided to give it a try. It was more than adequate for our needs, and I'm glad that I got it.A few caveats though:- This camera (and ALL high speed cameras) needs a lot of light to shoot at high speed. That means you either need to film outdoors in full sun, or get yourself some 1000W halogen work lights. This isn't a flaw in the design of the camera, that's just the nature of high speed video.- The resolution, as others have stated, is rather low the higher your frame rate gets. 420fps just pushes the edge of acceptable. For me, I was able to visibly see the vibration and harmonics in the movement of my machine at these speeds in spite of the low res. So in that sense, it did exactly what I needed. If I needed more accuracy, or had to measure something against a scale, I wouldn't rely on this camera for that. But it's certainly great in finding out what is shaking in an assembly.A few gripes:- The buttons are ridiculous. The on/off button is tiny and nearly impossible to push for a guy with huge mitts like mine. Same goes for the video record button.- High speed recordings seem to become unstable and jittery after 2:00-2:30 minutes. That may seem like a lot, but when shooting at 420fps, that's only about 15 seconds in real time.", "Date": "October 15, 2010"}, {"Title": "Performs better then expected", "Author": "Uncle Paul", "ReviewID": "R2V9N3CC4IPLHS", "Overall": "5.0", "Content": "I crew on a number of dragrace cars and needed a high speed camera to video the car off the starting line.I shot my first video with it and when playing it back on the TV everyone was amazed at the quality. It will save my teams countless hours.", "Date": "June 20, 2011"}, {"Title": "Great camera, but has some annoyances", "Author": "Shaun", "ReviewID": "R1BKDQFM9X4TI1", "Overall": "3.0", "Content": "Having owned two previous Casio Exilim cameras, I am quite familiar with the Exilim series and have been a real proponent of their work for years.  This camera is no exception.  Great optics, great firmware, and a mind blowing number of options.Pros: - 10.1 megapixel images look amazing - High speed videos are really neat - Face detection (in portrait mode) works really well - High speed still shooting has produced some amazing photos of my 7 month old! - Great size - Full Eye-Fi integration (on screen display of Eye-Fi status) - Highdef (720p) videos look fantastic - Continuous shutter adjustment during video shooting is very nice when you go from indoors to outdoors in a videoCons: - Automatic lens cover sticks after a 2hr hike on a windy day... light tap fixes it - Really likes to switch to high speed still shooting modes when BestShot is left to \"automatic\".  This gets annoying because it will take 15-20 photos in 2 seconds and then you have to wait 30 seconds for it to write them all to the SD card. - Highspeed video is really unusable beyond 240fps, as the video size shrinks as you increase the fps (120fps = 640x480; 240fps = 448x336; 420fps = 224x168; 1000fps = 224x64)", "Date": "September 16, 2010"}, {"Title": "great slo-mo", "Author": "P. Gully", "ReviewID": "R1BX87088O6QLG", "Overall": "5.0", "Content": "I bought this camera to record runners and play back in slow motion in order to correct form. It is fantastic for this purpose. The screen is large enough that I can play back instantly and let the athlete see and make corrections. My only complaint is the camera instuctions are very limited and I figured everything out by trial and error. It comes with an AV connector so I am able to connect it to the monitor in the gym and play back on a larger screen.  Love it!", "Date": "November 11, 2011"}, {"Title": "great camera", "Author": "joe", "ReviewID": "R1VA3Q25ES03NM", "Overall": "5.0", "Content": "this is the best camera i have bought. it takes exellent photos and amazing slow motion videos,( 1000fps is really cool but you need a lot of light. it is also kinda low resolution)and i love the exposure time in the photos AND videos. you can set it at a max of 1/40,000 !!  really cool!  i highly recomend this camera to any person that wants to expeirement with slow motion videos (and a very slim one, for that function itself.)the only complaint i can even think of is the batterie life. it is very good, but if you like me and want to shoot a whole bunch of video, buy a spare.  this is the best camera ever for the cost and slimness. i highly recommend this. i do not regret buying this", "Date": "August 10, 2010"}, {"Title": "it is good as a camer", "Author": "M. Almeer \"MAJ\"", "ReviewID": "R3GB6S8T722ZAL", "Overall": "4.0", "Content": "It is a good camera, in terms of still shots and video recording.but the camera outer case looks not solid,i feel the battery door will broke in my hand every time I open and close it", "Date": "October 10, 2010"}, {"Title": "Very close - but no cigar", "Author": "old arkiedan", "ReviewID": "R2O6POXSJR77YI", "Overall": "4.0", "Content": "I really wanted to love this camera. I wanted a fast, responsive camera that I could carry in my pocket, leaving my Pentax DSLR at home. This camera seemed as though it would do it. I kept it for about a week, playing with the still imager settings and the video. In the end I sent it back to Amazon.Here's why:The image quality was just okay, not great. I didn't expect it to equal my Pentax DSLR but I did want to print large images. I'll quickly admit I didn't print anything during the test period but, rather, made a judgement based on full-sized images on my computer. They were not up to my standards, admittedly from my DSLR. The next problem was the video, which was, to be charitable, not very good. I was put off by my inability to zoom or focus during filming video. I slowly overcame shortcoming that but it was a chore.A couple times while playing with the menus the camera locked up. I had to remove the battery and re-insert it to get the thing going again. No big deal? Well, yeah, it was a big deal.Thus, overall, I liked most everything, other than the problems stated above. I'm now deciding between the sister Casio, the FH100, and the Sony HX5V. I'm leaning toward the Sony.arkiedan", "Date": "June 21, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0032ANBWY"}}