{"Reviews": [{"Title": "Screaming Deal", "Author": "James M. Bailey", "ReviewID": "R3J6SB19FSW2RH", "Overall": "5.0", "Content": "An E-P2 body, brand new with full factory warranty, for under $300?  It's a no-brainer, esp. for those who already have a slew of m4/3s lenses and need a spare body.  Took about a week to get it from Cameta, which also had free shipping.Oh yeah and this robustly-built camera takes outstanding pictures, esp. when paired with a fast prime lens like the Panasonic 20mm F1.7 or M.Zuiko 14mm F2.5.  As long as you don't need a built-in flash, because like the E-P1 the E-P2 does not have one.  I could not justify paying $400-500 more for an E-P3 with built in flash and slightly faster autofocus, at least yet, so this one fits the bill nicely.Very highly recommended!!!(Update 2/16/12: have used a slew of old OM lenses (w/$23 Fotodix OM-u4/3 adapter) on this fine little camera, and the results are nothing short of amazing-- especially the medium range teles like 135 F2.8 and 100 F2.  Picked up a near mint 200 F4 at a camera store for under $100, and it's resolving power is truly spectacular.)", "Date": "January 17, 2012"}, {"Title": "Excellent camera at a bargain price", "Author": "A photographer", "ReviewID": "R1R5PEQ17W69DC", "Overall": "4.0", "Content": "I don't think you can beat the value here--the excellent E-P2 camera body for less than $300.  It's worth grabbing one (or more) while they're available.  Personally, I've been using the E-P1 since just after the introduction and I jumped on the E-P2 at this price.  The only real functional difference between the two cameras is the ability of the E-P2 to use the Olympus electronic viewfinder.  I also bought one of those.The E-P2 shares the same ponderous menus as the E-P1.  That's unfortunate but in reality you only have to wade through them until you have the camera set to your preferences.  After that, all the vital options are available on the quick menu.  The buttons and dials are a bit fiddly.  The control wheel/button combination on the lower right is too easy to turn/press without meaning to--you can turn it off.  The top right wheel is not in my favorite shape or placement but it's usable.  Buttons are close together.  The wrong one is easy to press when you have large thumbs.  Those are my nitpicks on both the E-P1 and E-P2.But both cameras have lots of good points as well.  Since the E-P1 has been around for a while, I won't dwell on the features the two cameras share.  You can find reviews of the E-P1 here at Amazon and more technical reviews online.  The biggest difference is the electronic viewfinder availability for the E-P2.  The EVF gives a good, big and bright view of the subject matter.  It also allows the user to fill it up with all manner of shooting information.  You can put so much stuff in the viewfinder it can interfere with seeing the subject.  I prefer a clean viewfinder and this can be problematic.  In order to remove all the information from the viewfinder, you also have to remove it from the rear LCD (which cannot be activated at the same time as the viewfinder anyway).  That means you aren't able to tell at a glance what the camera settings are.  It's better to just accept some information overlay and try to ignore it as you shoot or do a lot of button pushing while you eye is on the finder.  Since I prefer eye level shooting to LCD viewing, I'm willing to accept the EVF's shortcomings.  Fact is, most of the time I prefer using prime lenses with their appropriate accessory optical viewfinders with both the E-P1 and E-P2.  When using long lenses or zooms or adapted manual focus lenses, the EVF is pretty much a necessity.I really like the E-P2 and the entire E-Pen concept.  Picking up a second body at a bargain was a great surprise.", "Date": "March 10, 2012"}, {"Title": "Loving it", "Author": "B. Duong", "ReviewID": "R1J78T6S7PLO4Q", "Overall": "5.0", "Content": "I use this camera with the Panasonic Lumix G 20mm f1.7, and the pair is quite handsome for the price range.  I'm an amateur photographer who upgraded from a point and shoot.  I was going to go with an entry level DSLR but this fills the bill.  RAW image quality right off the bat is awesome.  And with a little bit of Photoshopping I'm getting beautiful photos.  Pics can be quite grainy at ISO 1600 and above.", "Date": "February 4, 2012"}, {"Title": "Fanastic Camera", "Author": "Jonathan Wall", "ReviewID": "RELWRH4V0BVL3", "Overall": "5.0", "Content": "Trust me, photography is not about focus speed or noise reduction. This camera is well built and is capable of fantastic photos.  For the price, this is a bargain. Better to buy the body only IMO as the kit lens is just ok, and there are some fantastic lenses for this camera.", "Date": "February 4, 2012"}, {"Title": "nice little camera", "Author": "joprof", "ReviewID": "R2097QX785DJES", "Overall": "4.0", "Content": "Loved using the old 1/2 frame pen series and this is a very nice digital camera that brings back the feel of the old PENs.  I like the button positions on this much better than the elp1 (harder to accidentally  trigger the continuous (movie) aspect).  The electronic viewfinder is an excellent addition especially for longer focal lengths and lower lighting where I find the only real drawback: at low light the lcd is very noisy although the images are still very good. Also like the feel and heft of this over the smaller versions such as the elp1.  Got a chance to try the ep3 while in Japan and it seems from the one first brief use (in store) that this may have overcome some of the slow focusing and noisy lcd.  Overall like the e-p2 a lot, and it's much easier to travel with 2 bodies (elp1 and e-p2) plus a few lenses than taking an equivalent grouping  of lenses and bodies of my larger (Canon) equipment", "Date": "November 10, 2011"}, {"Title": "A nice backup camera", "Author": "Lihong Zhao \"Minimaine\"", "ReviewID": "R1ES35ST23E9YB", "Overall": "4.0", "Content": "I bought this camera just recently as a backup for E-P3. It is a solid stylish camera, without the cheap plastic feel of E-PL2. The image quality is quite good. Compared to E-P3, it lacks the lightening autofocus speed, but it is enough serving as a backup camera. And for its current price, it is definitely a bargain. Recommended.", "Date": "September 16, 2011"}, {"Title": "Perfect Second", "Author": "Robert gloyd", "ReviewID": "RDWBD32V9D46W", "Overall": "5.0", "Content": "I bought this as a body only, a 2nd Micro 4/3 to backup my G5.  I love it. It's small but feels substantial and it shares lenses with the G5.  Now to tweak the settings a bit more and find a fast 17 or 20mm lens.  It is destined to be my daily carry, in my jacket pocket or backpack.", "Date": "May 11, 2013"}, {"Title": "Awesome camera!", "Author": "Alli", "ReviewID": "R2E0YOJ8FM24P6", "Overall": "5.0", "Content": "Very well built. The manual is mediocre but the camera is great. Get a book to learn how to access some menus and change the settings. Takes great pictures!", "Date": "January 19, 2013"}, {"Title": "great bargain", "Author": "Dan C", "ReviewID": "RSUYC2COMBS0T", "Overall": "4.0", "Content": "I picked this up a year ago. As long as you don't try to take pictures in dark rooms, and you use it with Panasonic or MSC Olympus lenses and the latest firmware, the focusing speed is actually pretty good. It's hard to fault this camera at this price. The jpeg output is exceptional, and the IS really saves a lot of shots. (I love having a spot metering button too.) Sure, the newer micro 4/3 cameras are better, but you'll wait a long time before they drop to these prices.", "Date": "December 8, 2012"}, {"Title": "E-P2 Micro 4/3 digital Camera  Body", "Author": "miller", "ReviewID": "R3Q8LLNUQ8QOPC", "Overall": "4.0", "Content": "I like the body's light weigh and size, handy, good for travel. Better than the E-P1, especial the electronic feature.over all is satisfied.", "Date": "November 18, 2012"}, {"Title": "Great camera", "Author": "Wayne Joerding", "ReviewID": "R21AD0QP9NHEEZ", "Overall": "5.0", "Content": "This is a great camera.  It's not state of the art from Olympus in 2013 but a big improvement over the E-P1.  I bought the EVF to go with it and am very happy to use this as my travel camera as I wander around SE Asia for two months.", "Date": "November 17, 2013"}, {"Title": "Awesome camera", "Author": "Erkka Karjalainen", "ReviewID": "R3HBJRFUQSHGSP", "Overall": "5.0", "Content": "This camera is really good if you are looking for affordable, small camera with interchangeable lenses. I use it currently with Panasonic's 14mm Lumix lens and I love it. Much easier to carry everywhere and takes good photos even with the iAuto setting. I just need to buy another lens with a little longer focal lenght as the 14mm is too wide in some situations. With the current lens it is just awesome for street and indoors photography. I'm in love with it!", "Date": "July 27, 2013"}, {"Title": "Pen EP2. Imperfectly Perfect.", "Author": "BSChi", "ReviewID": "R3UJHF9F3VF4F1", "Overall": "4.0", "Content": "I bought this camera 3-4 years after it came out, so I was already buying in a technology \"hole\" compared to the latest models.  The camera comes with no flash, mine came with no zoom (standard 17mm pancake), and is rather bulky and heavy for a non DSLR.There is no wifi, social media, GPS, and all that other fun stuff you can find on $300-$400 cameras.  What it does have is sleek looks, EXCELLENT picture taking, and old school awesomeness. This is one of the best purchases I've ever made.", "Date": "July 9, 2013"}, {"Title": "Awesome camera for the price.", "Author": "Ryan", "ReviewID": "R21M9LFOPOL9E", "Overall": "5.0", "Content": "Great image quality, nice build quality and design, and way more flexibility than a regular point and shoot. It's way less conspicuous than a big canon or Nikon, and its a very powerful camera if you know what you're doing.", "Date": "January 30, 2013"}, {"Title": "A treasure", "Author": "Felipe Cardenas", "ReviewID": "R1PQ4BRTXMYXHR", "Overall": "5.0", "Content": "A treasure camera. Who said that it is a camera for nascent. The quality of the images are extraordinary and the camera allows you to share legendary lenses. The price by now, allows you to get a powerful digital camera. I have amplified images of 40 x60 cm and the quality is incredible. I have been a Leica M6 user fore many years and with this camera I can use my old leica and other lenses and I just multiple my possibilities. Great camera for the price. For sure you will get extraordinary photos. I am telling you: photos with a professional quality when you print them.My photostream at[...]", "Date": "April 7, 2013"}, {"Title": "Awesome for day shots", "Author": "Anthony Yong", "ReviewID": "R168YZP6LYBOY8", "Overall": "5.0", "Content": "Great camera, day shots were great, night shots without flash need to use higher ISO number and increase the EV.  Would be getting a dedicated flash and 40~150mm zoom when enough funds exist.", "Date": "December 1, 2012"}], "ProductInfo": {"Price": "$399.99", "Features": "Micro Four Thirds Mount : The Micro Four Thirds Mount on the E-P2 provides many key benefits\nFour Thirds System Lens Adapter : Other Four Thirds Format lenses can also be used on the E-P2 with an available MMF-1 Four Thirds System Lens Adapter\nTruepic V Image Processor : In addition to more detail, the image sensor\nIn-body Image Stabilization : The camera's In-body Image Stabilization system compensates for up to four shutter\nArt Filters : A series of eight built-in Art Filters for replicating countless striking and dramatic effects", "Name": "Olympus PEN E-P2 Micro 4/3 Digital Camera Body (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/21N%2B7feKg2L.jpg", "ProductID": "B003E47XR2"}}