{"Reviews": [{"Title": "Bullseye for Point & Shoot Upgraders", "Author": "W. Jenkins \"Adwords Pro\"", "ReviewID": "R1ZAKG1OH5LCBL", "Overall": "5.0", "Content": "I'm experienced with 35mm SLRs and Digital Point & Shoot cameras, and I recently bought this camera (Sony NEX-3 with 18-55mm lens) because I have been disappointed with the quality of photos I can achieve with Digital Point & Shooters. Having been originally spoiled by my Nikkormat and Minolta 35mm cameras I found myself taking fewer and fewer pictures on my small Digital cameras simply because the pictures were just OK. So, with some important life events coming in the next couple of years I decided to upgrade, yet I dreaded the thought of carrying around a bulky and heavy DSLR.The NEX-3 has solved this problem for me: Great pictures, excellent indoor pictures often with no flash needed, and much better portability than a DSLR.Before purchasing I read the reviews and noted some were especially critical of the user interface Sony designed for the NEX series, so when I went to the store to try one I was expecting the worst. Instead, I found the NEX to have an extremely elegant and seductive interface, much better than any of the Digital Point & Shoot cameras I've had. I repeat, the interface is actually seductive. Now, if you compare the interface to a DSLR you will immediately see that the controls are not always visible and at-hand, they must be pulled up on the screen via the menu buttons. Therefore, I do not recommend this as a \"downgrade from DSLR\" camera until you have tried one in person. However, with my SLR experience I was pleased to see the animated representation of the P-A-S-M knob. And once \"A\" (aperture priority) is chosen, for example, the aperture adjustment is directly available as part of the viewfinder display. The interface is immediately recognizable to anyone with DSLR/SLR experience.The second thing that struck me while testing the camera at the store was how fast it is. It powers up very quickly, and the delay between shots is better than any digital point & shoot I've seen.Based on these in-store observations and the consistently strong reviews regarding picture quality, I decided to purchase the NEX.There are several cool and innovative features on the NEX that I've not encountered before, and I'll mention the two I think most people will find useful.- The panoramic photo feature will knock your socks off. The camera automatically captures a series of images while you pan from one side to the other (or up-down) and then stitches the images together into a single panoramic photo. This performs very well, and is very useful for many outdoor scenes.- The integration with Eye-Fi wireless SD memory cards makes for a very nice automated transfer of your photos to your computer and to online sharing sites. When I'm shooting in my house the photos are uploaded right then, while I'm shooting. If I'm away from home then when I return I simply turn on the camera and the photos automatically upload and after a minute of idle time the camera shuts off. If you buy a Sony NEX I strongly recommend you consider getting an Eye-Fi wireless SD card.Upon buying the camera I left the next day for a trip to Colorado for a wedding and to visit friends and family. Everyone that saw the camera was enthralled with it. My daughters immediately took to it and snapped many excellent photos using it. My wife's reaction during the return trip: \"That camera has already paid for itself!\"Other details:- I'm getting about 300 pictures on a battery charge, and will probably purchase an additional battery within 6 months or so.- The high resolution view screen is part of the secret to liking the camera. You get immediate satisfaction from seeing the excellent picture quality.- The flash is workable but will not impress anyone with DSLR experience. I hope Sony comes out with an improved version.- If Sony introduces a normal lens (30mm) it will be tempting, since it may allow the camera to be easily carried in a coat pocket.- I don't take a lot of videos, but the NEX-3 video is quite good and will suffice for any purpose I will ever have.I highly recommend this camera for someone upgrading from a Digital Point & Shoot.", "Date": "August 25, 2010"}, {"Title": "The Most Useful Travel Camera I Own", "Author": "L. C. Feigin", "ReviewID": "R3R1G5T776EH6Y", "Overall": "5.0", "Content": "I own numerous cameras ranging from small pocket point-and-shoot, underwater cameras,  to high end heavy SLR's. If I had to pick one camera to replace them all, this would be the one!  The two most outstanding features that put it in this position of distinction are its light weight, and the large APS sensor which produces excellent images even in dark rooms without flash, that are equal to those produced by an SLR.The images are sharp and free of the \"grain\" that the small cameras produce.  It is light enough to carry around all day.  Others have commented about battery life, but I am able to shoot 300 images using up only 30% of the battery.  This means it is capable of shooting 1000 images on a charge ( without flash ).The zoom 18-55 mm zoom lens is of good quality, and since I usually shoot indoors, is of more than adequate resolution, even with ISO of 1600.  The wide angle 16 mm does appear sharper however. I also purchased the full frame  Fisheye attachment which is much fun to use and even works in Panorama mode.[...]The video mode is quite good, and even the sound quality is surprisingly good with the built in microphone. The flash does work but is slightly clumsy, and I had to read the instructions to get it to work ( It has to be screwed in and flipped up ).Cons:  The menu system is overly complicated, and more buttons are needed in the camera.  I have been using Sony cameras for years and know the system well, but even I had problems with it.  I would like if a Macro Lens were available, and also a short zoom of about 100 mm, and a normal portrait lens of about 50 mm f/2.0 for available light - narrow focus.  It should be noted however that there is an adapter of other Sony lenses available.  I love the Panorama mode, and set it to wide and vertical mode, and then turn the camera sideways.  However it is not really that that sharp.  My tiny Sony DSC-WX-1 takes higher resolution shots.Summary: Light weight and image quality of a full size SLR camera, great for low light and travel.Addendum for the next 1000 images:  Great quality images outdoors although the screen is difficult to see in bright sunshine,  the battery seems to last forever with about 300 shots on using only 20% of the charge,  quiet, lightweight and much easier to carry around compared to an SLR and does not attract attention when photographing questionable subjects for artistic purposes of course.  It works very well with LENSBABY lenses ( and adapter to attach to the body ) because the manual focus can be enlarged 14x.  This is much better than the expensive SLR's. Also, I recently shot close ups of flowers outdoors and found that the anti-shake software actually sharpened the motion of the flowers in the breeze.GREAT TIP:  I use the \"continuous advance mode\" for almost all pictures at 2 1/2 frames per second and find one image is always much sharper than the rest.  With people I get varied expressions and eliminate blinking. Since the battery charge lasts forever and the memory cards hold many thousands of images, this is the only way to shoot, even with scenics.", "Date": "February 21, 2011"}, {"Title": "Sony Nex-3", "Author": "Emily C. Dupree \"mook\"", "ReviewID": "RMW9FZZ2YWECP", "Overall": "4.0", "Content": "I just bought this camera a week ago. I wanted to upgrade from a point and shoot and head into the DSLR world. It's just a hobby for me. I'm not a professional and really don't know too much about cameras. I had in my mind that I was going to go buy a Nikon D5000. I had read lots of reviews and that camera got pretty solid reviews for someone who was new to the DSLR world. I went into the store and didn't like the feel of the camera. I am 5'1 and have very small hands. I felt that the D5000 was bulky and heavy for me. I thought I would not want to carry something like that around. The store clerk showed me the Sony NEX-3 and explained what it was. He spoke very highly of it and said for someone like me it would be a great camera. I bought it and have been playing around with it. I am not certain I am going to keep it. I really liked using the Macro setting on my point and shoot for taking photos of flowers to get just a little more detail. The macro setting on this camera is not great. My point and shoot does a better job and there is not a macro lens out yet for this camera to my knowledge. I don't feel that I have very much control over the camera when it's in certain settings. The camera will disable certain features when you are using certain settings. Something as basic as wanting to shoot in black and white is disabled. My point and shoot can do that in any setting. I dont understand why I cant in this camera. I can't change the focus area in most of the settings which I don't like. Therefore the camera focuses on what it wants to whether than what you intended unless you are in PASM. I am not skilled yet with using the PASM settings but would like to learn and I'm not sure this is the camera to learn on. The camera does not have a lot of buttons, it's all built into the LCD. It can take a few minutes to change the settings and you have to push like 6 buttons to get to it so you may miss your shot if you want to change something and need to do it quickly. I will say that this camera does take great photos and is definitively an upgrade in that respect from my point and shoot. It takes great photos in low light. I haven't even used the screw on flash because I dont feel like I have needed it. The other con is the battery life. It's awful. I rate it about a 3. If you are going to be out all day I would have a backup. They cost about $80. The manual says you can shoot about 300 photos. That's not very much. Overall, I do think this camera shoots great photos as a point and shoot but if you want more control over you will need to get a DSLR. I think I may return it. I will get used to the feel of it hopefully.UPDATE:I did end up keeping the camera and there was an update that I downloaded from Sony and it fixed the battery life so it now does not drain as quickly. I am very happy about that. The camera is in the shop for repair right now. The LCD screen turned black at the top and cut off abuot 1/3 of the picture. Sony is fixing it under the warranty that came with the camera. I dont know what caused this and have not seen any other reviews where this has occurred so may just have been my model. Now that I have been using the camera for quite some time, I am glad I bought it and not a bulky DSLR. It is so light weight and I can carry it with me any where I go. It takes fantastic photos in almost no light. I havent even had to use my flash. I cant wait to get it back from the repair shop. I have missed it.", "Date": "August 16, 2010"}, {"Title": "Amazing little camera", "Author": "Savi", "ReviewID": "R1V99X28C6XBZG", "Overall": "4.0", "Content": "As a photography enthusiast for many years, I've been looking for something that was not as complicated or as costly as a DSLR. I stumbled across the NEX-3 and the price point was appealing. After a lot of research, I purchased this camera several weeks ago from Amazon Warehouse Deals as a \"used\" item, saving me over $100! I wasn't sure what to expect, but this camera was basically brand new. It was labeled as \"Like New\" so I'm guessing it was purchased and opened, then immediately returned. As of writing this review, I see there are none left at the price I paid, so I got lucky.Since receiving the camera, I have taken close to 2000 photos with it. Every review I've read here and on popular gadget websites is spot on. This is an amazing upgrade from a P&S; and will not disappoint. In fact, I purchased this camera right about the same time as my cousin purchased a Nikon d5100 and she was questioning if she made the right choice after seeing the photos I uploaded to Facebook. I've managed to take some pretty amazing shots with very little knowledge about shutter speed, aperture and ISO. Meanwhile, my cousin is struggling with her DSLR. I've learned a lot about photography from using the NEX-3. The Intelligent modes are great, but now I shoot mainly in A/S/M which offers me a lot more control. That's the beauty of this camera. It's pretty good even in the auto modes, but really excels in more experienced hands.Without getting into too many details, I'll just say that this camera is amazing if you're a looking to get into photography as a hobby. And if you're getting into photography, you also know that lenses are important, even more so than the camera itself. Sony's E-Mount system is still young so we only have a few to choose from, but it appears that this is the future for Sony. You're buying into a system that should have some longevity. Although E-Mount lenses are expensive, that's the price you pay for OSS and a fast autofocus, keep in mind that there is a very robust market for adapters that let you use some amazing manual lenses. I've just purchased a few inexpensive lenses and adapters and can't wait to try them out. I also have some comfort in knowing that if I do purchase more expensive lenses, I can use them on other bodies as well if I ever do decide to upgrade to a DSLR. Now here's the big thing...I may never need to upgrade. This little camera performs as well, if not better than many of the entry level DSLR's! If there are any downsides, it's the battery life, which has been improved on the newer NEX-C3 and the lack of an external flash. The latter being rather minor because it really defeats the purpose of having such a small camera in the first place.I'm very happy with my purchase and would highly recommend this to anyone that is getting into photography. If you're a Professional photography or are looking to eventually go pro, I'd say stick with a DSLR, but this would make a great addition to your arsenal if you've got money to burn. Make sure you purchase an extra battery pack! (reason I gave it 4 stars)", "Date": "August 17, 2011"}, {"Title": "Chose Sony NEX-3 over Panasonic GF2", "Author": "Tekam17", "ReviewID": "RO6608FE4F1V", "Overall": "5.0", "Content": "I was debating to get the NEX-3 or the highly hyped Panasonic Lumix DMC-GF2. After reading numerous reviews and especially this article from PC Mag [...] I chose the NEX-3 for one important feature: the sensor type and size. The sensor used in NEX-3 is a real sensor that used on Sony's DSLR line-ups. On the other hand, Panasonic GF2 use Micro four-third spec sensors that is smaller than Sony's APS-C sensor. According to PC Mag, GF2's Micro Four Thirds sensor is more than five times larger (225mm²) than Canon PowerShot S95 (the king of point and shoot). APS-C sensors (370mm²), like those in the Sony NEX-3, are 8.5 times larger than Canon S95's 1/1.7-inch sensors and 1.6 times larger than the Micro Four Thirds sensors. APS-C sensors also perform a bit better than the GF2's in low-light. I tested all 3 in real life (borrowed a GF2 from a friend who bought it from Asia, and I own a S95), and result is exactly what PC Mag says. NEX-3 is simply better! I was glad I made the right choice.", "Date": "February 8, 2011"}, {"Title": "An excellent small, light, and reasonably priced everyday camera to supplement my Alpha 900", "Author": "MCC", "ReviewID": "RF01G2XUDHEF0", "Overall": "5.0", "Content": "The NEX-3 is a wonderful addition to my Sony A900 DSLR that allows me to have a very small and light second camera body that produces amazing image quality in a small package.  It's not as \"fast\" as my A900 when I want to change settings and tweak a shot, but the images this little camera can produce are amazing.  Though the LA-EA1 alpha mount adapter allows the use of alpha mount lenses, autofocus is not available.  However, manual focus with the beautiful 3\" LCD is a breeze, and Auto-Focus with the NEX 16mm is fairly quick and highly accurate.", "Date": "July 8, 2010"}, {"Title": "More camera than a compact Canon!", "Author": "J. Chow \"latinpanda\"", "ReviewID": "R2P52ZQ0WAR5SJ", "Overall": "5.0", "Content": "I've been a long time user of Canon compacts...my last was an SD1200.  However, I've never been quite happy with the photos.  Don't get me wrong.  They're ok.  But first, low light pictures suck.  Also, sometimes they don't have a crispness that you get with a big dSLR.  However, I have no intention of buying a big dSLR because I'll never carry it around to my daughter's birthday or trip to the beach.  It's just too cumbersome.  My wife bought this baby for me for Christmas.  I have to say that I really like it so far.  The lowlight pictures are very good.  Sony has some interesting technologies that allow this camera to take much better low light pictures.  I've been amazed by some of my Christmas tree pictures in the dark.  Beautiful.  Second, I think I now realize that there is no substitute for a bigger lens.  This is critical for sharp pictures.  However, the body of the camera is still relatively small.  I will admit it's bigger than a compact Canon, but it's not nearly as huge as dSRL.  Lastly, I am not a huge photo guy, but I know when I see a good photo and when I don't.  I do play around with the settings quite a bit.  The camera does not seem like a professional one, but it's got a balance of more user friendly settings, which I like a lot.  However, if you want to change aperture or exposure, you can.  I would definitely recommend the zoom lens.  There is no substitute for true lens zoom vs. a digital zoom.  1 con:  I needed to install a firmware update from the computer, which was sorta annoying.", "Date": "January 21, 2011"}, {"Title": "Great for what it is", "Author": "Jonathan J Phillips", "ReviewID": "R2QPTSYW8YF9VR", "Overall": "5.0", "Content": "First off I just wanna say that I am by no means a professional photographer, but I have many friends who are. As soon as you get past the digital navigation of the camera and start to use its manual settings the pictures and video you can capture are really amazing. As soon as I started hosting/sharing photos and videos a lot of people thought that this was a cannon t2i or something else more expensive. I also do some minor color correction to the videos I take and you can really get some professional looking footage. I bought the boom mic that sony provides for the nex-3 and it captures pretty good audio considering I take it to really loud concerts and such. The onboard mic isnt half bad either. Over all I think if your looking at this camera because your not a pro so you dont want to put out the pro bucks for a crazy camera then you will love it. AND its pretty dang small.Negatives-I had to put a antiglare/finger print resistant screen on the camera. the regular glossy is way to reflective and smudge prone and considering you dont have an optical viewfinder its kind of important to see what your shooting.-Battery life is not as long as I would like it to be. I had to purchase two batteries because I got tired of waiting for the one to charge. Also they dont have any kind of power adapter or port for capturing straight to a hard disk.", "Date": "April 20, 2011"}, {"Title": "Good image but with faults", "Author": "Sambucka", "ReviewID": "R1JY5NTCT8DEST", "Overall": "3.0", "Content": "The pancake lens it comes with is only suitable for landscape photography. You have to be in someone's face to take a portrait photo, so it's not a versatile lens like 20mm pancake on GF1 or 30mm on NX10. Flash is needed with some photos and it is really a bother to keep taking it on and off with a tiny thumb-screw. Also, there is no dedicated function dial, so you have to keep going back into the menu to change shooting mode and other settings. If Sony would address these issues in the next model then it would be a great little camera, but now it is not a \"versatile\" small APSC camera, you actually need the bigger 18-55 lens, which makes it really not that \"small\".", "Date": "August 2, 2010"}, {"Title": "Great camera!", "Author": "Zaxmom", "ReviewID": "R31CJNGO1UIM86", "Overall": "5.0", "Content": "I really love this camera! It takes great pictures that are clear and crisp. The zoom is pretty good too. I love that it takes wide angle pictures also. This is a plus. I would recommend this camera to anyone who wants a great everyday camera.", "Date": "March 17, 2011"}, {"Title": "Great Camera but not a Compact.", "Author": "Jess", "ReviewID": "R8RUBJLUEP8R5", "Overall": "4.0", "Content": "This is a great camera that takes amazing photos.  We purchased it for the birth of our first child and we have been very happy.Pros: Great Pictures, Great Quality,  Easy to Use, Smile Detection (Awesome), Very Cool Features to the tech challangedCons: Not a Compact!  Although it is small it does easily fit into a purse, pocket and is not as easy to grab and catch the photo all the time.  I tend to still use my phone camera to take most pictures.", "Date": "August 5, 2011"}, {"Title": "Stop looking", "Author": "Robert Kniesteadt", "ReviewID": "R3G78EU0VXYQ0Y", "Overall": "5.0", "Content": "I bought this camera used because I needed a compact DSLR for class.  So far this is the best camera ever.", "Date": "February 13, 2013"}, {"Title": "meets expectation", "Author": "yichao Zhu", "ReviewID": "R1KZG8J1YT4WT2", "Overall": "3.0", "Content": "the camera is lightly used, w/ small scratches on the lens. it performs well under low ISO. but does not fit to 16-59 lens.", "Date": "November 27, 2013"}, {"Title": "Great camera!", "Author": "BPortman", "ReviewID": "RGMI70BWM9OIB", "Overall": "4.0", "Content": "Purchased this camera back in April and love it so far.  Love how easy it is to use and the pics that come out are as close to professional as they get.  I use this camera for my makeup shots and after applying some photoshop, the results are fantastic.  Seller was great as well.  It was delivered in the time frame that the seller said it would be and all parts were included that were suppose to be included.  My only complaint would be that the flash is not attached to the camera, but other than that, I'm very pleased with this purchase.", "Date": "June 5, 2012"}, {"Title": "the best point and shot camera with interchangable lenses", "Author": "®", "ReviewID": "R1B5LX0W7XSEV4", "Overall": "5.0", "Content": "I saw this device about less then 1.5 years ago and was impressed.  I needed to upgrade my DSLR, so I got a Nikon D7000.  Since then the priced dropped and I found a refurbish model at Sony Outlet store and it is a bargain. Sony loves to create introduce new models like the NEX7, 5N, C3 giving the Nex 5 and 3 a price drop.Positives:1. You get the same size APS-C cmos sensor as most dslr not Full frame.  but the image is not as good as my d7000.  No other brands has a sensor this size at this price (got mine for 370.  Fujifilm X100 is 1,350 with a fixed lens.  4/3 system from Olympus and Panasonic use a smaller sensor.2.The size and design is great.  I did also get the pancake lens so it is quite compact.3. very fast autofocus (AF), it could be a tad sharper in some case.Neutral:1. The Nex5 does have a better magnesium alloy body and there was only a silver model, I prefer the black color for camera.2. The lack of external buttons, but there are 3 programmable buttons so it isn't that bad.  After one day I knew where all the button were and it was that simple.  I have the ISO, programmed and that was the main button I need.3. When you manual focus it zoom, which I find very odd.  I will give it more time before I decided if it is a good or bad thing.4. there is a 3rd party nikon f mount adapter but you lose AF, but not for the Sony Alpha mount adapter.The bad:1. pricey accessories, but I knew this.  I already have a big camera with accessories so I won't be buying anything new here.  But the option is there.2. true viewfinder.  I like the glass optical viewfinder OVF and the extra costly EVF is not hte same and expensive.3. Battery drain is an issues if you do photo-stroll.  OVF cuts the power drain for dslr, here it does fall a sleep, but lcd is a drain.4. not a big deal but the image quality IQ is not the same as dslr (more noticeable in night shots, bu tnot a big deal.All in all there isn't a better camera at this price at 400ish if IQ is a question.  I have a point and shoot too and cost me 320 and has a tiny sensor.  It is a fun camera to carry around, but too bad it isn't small enough for the jean pocket.", "Date": "September 23, 2011"}, {"Title": "Sony", "Author": "Chrissydlc \"Chrissydlc\"", "ReviewID": "RL1GG512ZLNRS", "Overall": "3.0", "Content": "I really wanted to love this camera, but instead I just like it. It takes really nice pics, but I am really unsatisfied w/ the zoom.  I bought another interchangeable lens and was not happy w/ the zoom at all.", "Date": "July 8, 2011"}], "ProductInfo": {"Price": "$581.49", "Features": "The quality of a DSLR in about half the size, weight\nWorld's smallest, lightest interchangeable lens camera\nSame APS-C sensor size, same resolution as Alpha DSLRs\n14.2 MP; up to 7 fps shooting; ISO 12800 sensitivity\nSweep Panorama captures incredible landscapes", "Name": "Sony Alpha NEX-3 Compact Interchangeable Lens Digital Camera w/16mm Lens (Silver)- 14.2 Mpix", "ImgURL": "http://ecx.images-amazon.com/images/I/51kuHgvjhUL._SY300_.jpg", "ProductID": "B003MPSING"}}