{"Reviews": [{"Title": "Camera of the year", "Author": "John Thompson \"Technical dunce\"", "ReviewID": "R8COZ8MTDZXTL", "Overall": "5.0", "Content": "GE E1486TW 14MP Digital Camera with 8X Optical Zoom and 3.0-Inch Touch Panel LCD with Auto Brightness (Red)Purchased after reading reviews all over the web.Amazing camera simple to use, wonderful photos in all conditions.On receiving it I charged the battery for 4 hours as advised in the instructions.I then took forced flash/ panorama/ video/ single shot/ continuous shot and every other type of action to try to wear the battery out.It held up for as long as I needed, or wanted it to.All photos were clear and very well balanced light wise, even into the sun.The only thing I would warn of is not to cover the A/F lens on the front left of the camera with your finger when taking pics. Pity they didn't put this somewhere above the lens, out of the way of hands.Perfect camera, perfect pics, could take a pic of a black cat in a coal cellar.", "Date": "June 21, 2010"}, {"Title": "I LOVE LOVE LOVE THIS CAMERA", "Author": "Leanne R. Baldwin", "ReviewID": "RLWNQZOBX8C37", "Overall": "5.0", "Content": "I also bought this camera from HSN but in the purple which I absolutely love the color.  The features on this camera are incredible.  The pictures are clear and very crisp.  It is extremely easy to use.  I carry it with me in my purse at all times and when I need to I just take it out and shoot and the pictures come out great.  I have looked at many cameras and have done my research and this camera is by far the best value for your money.", "Date": "May 9, 2010"}, {"Title": "Great Camera", "Author": "Quality and Value \"Business\"", "ReviewID": "R3GVJVJ83XCBQC", "Overall": "4.0", "Content": "1st camera I've owned in over 20years.  It's compact yet the touch screen is large enough to be seen (I have a lot less than 20/20 vision), easy to use for those of us that don't look forward to reading manuals.  If taking pix at 14 megapixals the internal storage is hella small it only holds 3 pix.  I purchased a 8GB SD (class 10) at 14MPX this yeilds over 1,000 pix.  The pix quality is excellent.  Zoom quality is good (1st time working with zoom) I loved being able to get close up shots without being close to the target.  Amazon's price made it well worth the money - saw the same camera on HSN - cost $50.00 more!", "Date": "September 9, 2010"}, {"Title": "Great reasonably priced camera", "Author": "Jason Jimenez", "ReviewID": "R1HAJO1EWMQLIC", "Overall": "4.0", "Content": "I have an uncontrollable addiction to cameras so I'm always buying different ones off of Amazon. Trust me I'm no pro,  I just taking pictures and I love cameras. What i loved about the GE E1486TW was that it took incredible clear and brilliant pics, is compact and very reasonably priced.I have bought many higher priced cameras that may contain all the bills and whistles but can't take as clear and sharp a picture as the GE.Really easy to use.", "Date": "April 18, 2011"}, {"Title": "A Good Little Camera", "Author": "David E. Zellen", "ReviewID": "R10XENAW1J54QC", "Overall": "4.0", "Content": "I purchased this camera because it offered a good compromise between size, features, and price. I wanted a small camera that was easy to slip into my pocket, yet had a decent size zoom and features, and offered decent photo quality for a mid priced camera.  Here are some of the strong points about it. Quality construction, the case is all metal and very well made. I have had previous cameras by Olympus and Fuji that were not as well made. The LCD touch screen has a finer resolution than most other small cameras, over 300,000 pixels as compared to 230,000. I also find the touch screen to work very well, with the touch sensitivity being just about right even with an LCD proctector. I found that a 3\" protector didn't fit well because the screen is recessed so I used a 2.9\" one. There are quite a few options and adjustments available in the menu for a camera of this price. I am not using it for real serious photography, using it mostly for my Ebay pictures. But I find my photos usually turn out well. The flash looks kinda small, but seems to be strong. Sometimes the auto focus misses it's mark, but I have heard of that happening with many cameras. Battery life is OK. I recommend keeping a spare battery if you do a lot of shooting. I haven't tried the movie mode. I do see that the zoom won't operate in movie mode. Macro mode is fair, with the closest shots being 5cm. So I am pleased with this camera and think it is a safe bet for those who don't expect a $150 camera to perform like a $400 + one.", "Date": "February 5, 2011"}, {"Title": "Best camera I've EVER had", "Author": "Victoria J", "ReviewID": "R2O9I49S7ZV7Y4", "Overall": "5.0", "Content": "I've been through a few good cameras before, but the E1486TW is my favorite by far.I've had this camera for about 1-1/2 years and it's as good as it's made out to be.This camera is easy to use, takes professional-looking pictures and has an amazing zoom range, all for a great price of $160.Here are some pictures I took just today so you can see the picture quality of this camera.[...]It also takes good people shots, night shots, action shots, etc.I LOVE this camera and highly recommend it.", "Date": "April 6, 2011"}, {"Title": "GE E1486TW Camera", "Author": "Sandy S", "ReviewID": "RL1KQCRJ6JEBP", "Overall": "5.0", "Content": "Love this camera.  Had another one but dropped it.  Bought 3 or 4 other cameras to replace this one,  never really happy with other cameras.  Found this one again and bought it.", "Date": "June 13, 2012"}, {"Title": "Simply the best and easiest.", "Author": "Mafalda Quinn", "ReviewID": "R1O6XGF93BDCJS", "Overall": "5.0", "Content": "I had the 12 mp GE before and was blown by the quality, the true wide angle lens and the ability of panorama capture, a real plus when traveling ( think Grand Canyon).  It now I \"graduated to the 14 mp. Easy, uncomplicated menus, great for somebody who does not like to read instructions.  The video has a grinding noise. But I travel with my Kodak Zi8, which takes fabulous HD videos. I have learned not to use 1 camera for everything.  If you put the GE on auto, and cancel the flash, you will be able to take superb indoor pictures, but make sure you hold the camera VERY steady.", "Date": "April 18, 2011"}, {"Title": "fun & easy to use", "Author": "enigma \"sportswear\"", "ReviewID": "R3SML93D77LIAH", "Overall": "5.0", "Content": "I bought this camera for my daughter's birthday. She was very happy with the color the ease of use, the touch screen is a big plus. She was very pleased with the picture quality & when she wanted to change the way a photo looked she did it with such ease. I'm not good with all this new technology, but I found the camera easy to use. We love it. The price was excellent also.", "Date": "March 8, 2011"}, {"Title": "Excellent camera", "Author": "beckles", "ReviewID": "RHHA9YZNAZUYK", "Overall": "5.0", "Content": "Like most everyone else, I've been swept away by touchscreen technology, so of course my camera had to have one. I searched and researched, looking for the best deal, and I must say, this camera is a great deal. All pictures come out clean, crisp, and natural with warm colors. And this comes from someone who deals with camera shake. Also, there are a ton of different modes to shoot in. I really like the video capture as well. If you decide to get it, you will enjoy!", "Date": "February 25, 2011"}, {"Title": "Awesome suprise", "Author": "Lois", "ReviewID": "R21XHWCTBZJ7C7", "Overall": "5.0", "Content": "Great camera, and great deal. Was pleasantly suprised by the color. More of a hot pink than a red.  LOVE IT....Takes better pics for me than my $1200 one from years ago.  what a fantastic deal...My family tries to steal it from me..", "Date": "January 2, 2011"}, {"Title": "Grandson & Daycare compatible", "Author": "Paula's Daycare", "ReviewID": "R1LS2EVWNNLN08", "Overall": "5.0", "Content": "I'm feel like a paparazzi sometimes with having a Grandson & a daycare--i love to show off the kids!! Great pic quality and easy to use. Great camera--used to just a reg. camera and love all the different modes available on this one.", "Date": "July 25, 2010"}, {"Title": "best point and shoot for the price", "Author": "Jason Pancari", "ReviewID": "R1F1OAJIQTEIBG", "Overall": "5.0", "Content": "I am a guy i purchased this camera from Hsn the black was defective they had no option but the send the red i figured lets try to red it is something a woman would carry its a fusica color. but who would say a hatred thing about your camera someone that doesnt know you probably kids and you would just ignore them. I am a Single Male im 31 and to be honest it doesnt bother me. The features are amazing on it the 28mm wide,vivid mode, and more i took a picture outside it was pitch black of my tree and it light right up there was no delay at all. compared to the fe5020 olympus thats terrible so much delay and grainy pictures taken with that one. Ge your really did a good job with this camera keep up the good work.", "Date": "May 5, 2010"}, {"Title": "GE  E1486TW  14MP", "Author": "jesserayjames", "ReviewID": "R1ZW8GUUFR7I8Z", "Overall": "3.0", "Content": "The camera works well, but the battery doesn't hold a charge long, always have to recharge it, just before I use it, even though I may have only taken 20 or 30 pictures... not really happy with camera and may be returning it..............", "Date": "May 22, 2011"}, {"Title": "Broke in a day", "Author": "Becky", "ReviewID": "R7AM81E0XET6J", "Overall": "1.0", "Content": "This camera was cute, although bigger than other digital cameras - it was the size of an \"old school\" camera camera.  Shutter broke less than 24 hours after it was opened.  What pictures we did manage to take turned out mostly fuzzy.  We bought it here from 3rd dealer Discounts Jungle and they were prompt in issuing return/refund procedures, however, they do have a restocking fee - so we were out that plus shipping to/from.  Overall, really not happy with this purchase.", "Date": "September 11, 2013"}, {"Title": "good", "Author": "Victor Hugo.", "ReviewID": "R34CTSNIMIDSQM", "Overall": "5.0", "Content": "is a good product, relationship, quality - price is fair, you can purchase recoemndar comes well packed, good overall. is recommended.", "Date": "August 27, 2013"}, {"Title": "Quality camera, compact size", "Author": "D. Fournier", "ReviewID": "R3U264CYVITR6A", "Overall": "5.0", "Content": "I bought this camera for my daughter for a trip she was taking.  I knew she would be unable to download pictures on her trip, so I wanted her to have a decent size screen to review pics.  This camera is durable, has great features and a big display screen, good battery life, and is easy to use.", "Date": "August 11, 2013"}, {"Title": "Very Powerful Camera - Great Price !", "Author": "Ernie fm NC \"ErnieC\"", "ReviewID": "R1Q9CG36D9EH1L", "Overall": "5.0", "Content": "8 X Zoom and Image Stabilazation is somthing I would not thought possible for a camera under $100.  This model takes great photos, the stabilization works great (you still have to try to hold still, particularly for zoomed shots).  Color, sharpness, ease of use ... all great.", "Date": "June 26, 2013"}, {"Title": "Nice camera", "Author": "lee", "ReviewID": "R2U3Z59Y76BBLZ", "Overall": "5.0", "Content": "I was pretty pleased with this purchase, I bought this for my boyfriend for his birthday and he really likes it. The only problem was that i did not receive my wrist strap for it. But other than that i have no complaints. Its user friendly and really sleek.", "Date": "December 29, 2012"}, {"Title": "GE Digital Camera", "Author": "Suzanne M. Ronkovitz", "ReviewID": "R1TIQUWN4FWM5V", "Overall": "5.0", "Content": "Camera received was great, and as described.  The only negative was that I didn't know it didn't come with a memory card, so we had to go out and buy one.  Seems to take good, clear pictures and is easy to use as my 13 year old daughter has mastered it already.", "Date": "February 12, 2012"}, {"Title": "great camera!", "Author": "Maria", "ReviewID": "R3M3JB1MM13NO", "Overall": "5.0", "Content": "I bought this camera 2 months ago and it works as if it was new! has a lot of features and is priced very cheap!i would recommend this camera to anyone from a professional photographer or an average picture taker. takes great pics and has a lot of features!", "Date": "April 22, 2011"}, {"Title": "CAM", "Author": "Ryan", "ReviewID": "R2AB2OQLJHK9KE", "Overall": "5.0", "Content": "MY FIRST DIGITAL CAMERA O H MY EVERYBODY I KNOW THAT I TOOK A PIC OF LOVES THE QUALITY OF THE PICS WHEN THEY ARE DONE THE TOUCH SCREEN IS REAL NICE HAVENT RECORDED ANYTHING YET STILL WORKING ON THAT", "Date": "January 22, 2011"}, {"Title": "great camera!!!", "Author": "satisfied", "ReviewID": "RR3X9C8QA321L", "Overall": "5.0", "Content": "This is a very good camera!! it takes excellent pictures, even in dark settings... The only thing to be careful of is to make sure the camera is on the  correct mode for the setting that you are in, because if it is light outside you dont need flash but if your indoors where could be dark at times i put it on where it on forced flash so it depends on what you like, but the pictures come out very clear, i am very satisfied with this purchase!!!!", "Date": "September 28, 2010"}, {"Title": "love it", "Author": "Tiffany L. Hamilton \"Tiffany\"", "ReviewID": "R2916INMGPWZL5", "Overall": "5.0", "Content": "Love the camera. easy to use and great pictures. More of a fushia color than red (which I love)", "Date": "June 28, 2010"}, {"Title": "Very Disappointed!", "Author": "O. Rivera", "ReviewID": "R3ASU16F889SUC", "Overall": "1.0", "Content": "I was so excited when I received the camera.  I wanted it so that I can just put it in my pocket or purse.  The size is great, no complaints there.  I took pictures at home and they came out great.  I put a plastic on mine to protect it from scratches while I made up my mind about my purchase.  I had trouble with the touch screen.  You have to press really hard with the touch screen.  For some reason I thought that it would be as easy as an iphone, not the case with this camera! I had a wedding to attend this weekend.  The pictures look great on the view screen.  They look great when transferred to the computer.  Horrible when printed.  The pictures look really dark.  The manual only has about 30 pages in english, not very user friendly.  Too many buttons on the screen to choose from and like I said the manual wasn't too helpful.  In search of a new camera now.  Would not recommend in my opinion.", "Date": "March 22, 2011"}, {"Title": "Good camera", "Author": "Bruce E Walker", "ReviewID": "R2NC4QNKGHFXXW", "Overall": "4.0", "Content": "I bought it for my mother to use at my niece's wedding. She never got it out to use it. I cannot comment beyond that.", "Date": "June 21, 2013"}, {"Title": "Good camera but had a problem with it.", "Author": "Renee A Renner", "ReviewID": "R3490NC9SINUCZ", "Overall": "2.0", "Content": "I did a lot of searching and reviewing before deciding on purchasing this camera.  When I got it I charged the battery a little bit and used it that evening and the videos turned out pretty darn good.  The battery of course lost it charge because I didn't charge it long enough so I put it back on charge.  Now mind you it was hard getting the battery in and out of the charger it was awful darn tight even getting it out of the camera was a pain.  So I fully charged the battery put it in the camera and now the camera will not turn on.  So needless to say this will be returned and I went out and bought a Sony.  Otherwise, this camera was ok.", "Date": "July 17, 2010"}, {"Title": "Nice camera, until it falls once", "Author": "ALEX", "ReviewID": "RP261GM1TAP0Y", "Overall": "1.0", "Content": "I bought this camera per the amazing reviews I have seen on it. I bought this camera in September of 2011 and unfortunately, am no longer able to use it. Two months after I purchased this camera it fell off of the coffee table onto the carpet, hardly a worse fall than any other camera I have had which has dropped numerous times due to children/accidents, and the lens (i believe internally) broke and it will not close fully. It is only able to take a picture with half the lens and comes out with half the picture blacked out. I would rethink this camera decision if you need something durable. It is not. I have numerous Sony cyber-shots that have been through whirlwinds with children and they all still work perfectly well. This broke falling two feet from a coffee table onto a cushioned carpet. And broke.", "Date": "March 6, 2012"}, {"Title": "it broke after a week", "Author": "nns", "ReviewID": "RQWEPBNGFE4DT", "Overall": "1.0", "Content": "it froze after a day and then it broke after a week but it does take a good pic", "Date": "July 7, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14MP Digital Camera with 8x optical zoom and 6x digital zoom\n3.0 Inch vibrant touch panel LCD with auto brightness\n18MB internal memory with SD/SDHC card support up to 16GB\nFace detection, in camera red eye removal, image stabilization, smile detection, blink detection, and face auto-exposure\nLithium-ion rechargeable battery", "Name": "GE E1486TW 14MP Digital Camera with 8X Optical Zoom and 3.0-Inch Touch Panel LCD with Auto Brightness (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51xMsJzR6fL._SY300_.jpg", "ProductID": "B003GYZ5AC"}}