{"Reviews": [{"Title": "Great for price", "Author": "drock", "ReviewID": "R2YLAURIVPQA80", "Overall": "5.0", "Content": "This is a great camera. I bought it on sale at a retail store for $100. Well worth it. 14.1mp and 8x Optical zoom. You can't get that from most digital cameras under $200. It also takes great video. Although it seems like it burns through the battery quickly, it might be from me replaying videos. All in all, its a great camera for the price.", "Date": "November 14, 2010"}, {"Title": "Great camera, super value", "Author": "Thomas Siebern", "ReviewID": "R1ZP7E1GUMJC44", "Overall": "5.0", "Content": "Love this camera, takes great photos, has more features than cameras costing $200 and up", "Date": "September 1, 2010"}, {"Title": "Nice camera but.......", "Author": "Cindy", "ReviewID": "R2ZBEFSSVHAFHR", "Overall": "2.0", "Content": "This is a nice little camera and has lots of features for the price, I especially like the video feature, you can take a video as long as you have memory and battery to support!  We use it all the time, nicer than having to carry a camera and a video camera.But, there is one problem, after 9 months of use, the lens won't retract and it keeps shutting itself down.  It's too late to return it to Amazon and I don't see any information on warranty service on this webpage.I loved the camera, but I'm dissappointed.", "Date": "May 4, 2011"}, {"Title": "great purchace!", "Author": null, "ReviewID": "R2FFCTWFCQB5EF", "Overall": "5.0", "Content": "This is a nice little camera with really amazing features for the price.  Planning to get a second one for myself, as my husband has taken this one over. Seems to me, GE cameras are very underrated.", "Date": "December 19, 2010"}, {"Title": "pretty good", "Author": "C. Rushton", "ReviewID": "R1HNCICQSISCC2", "Overall": "4.0", "Content": "I really like this camera. Bought for my son is actually better than mine. Only problem when you try to review pics, occasionally camera will freeze up and do nothing. Have to take batteries out, put back in then works fine. Great mp and really good zoom.", "Date": "August 16, 2013"}, {"Title": "so far great camera for the price", "Author": "hopesview", "ReviewID": "R29FG1AC2L668I", "Overall": "4.0", "Content": "We bought this for our 13 year old son for his birthday.  He has taken many pictures with it and so far has no complaints.  The pictures are clear.  The battery doesn't last as long at some other cameras but does charge quickly.  I would also recommend buying a memory card because you can only take a few pictures with the internal memory.  Great item though so far!", "Date": "October 17, 2012"}, {"Title": "So far so good", "Author": "Valueminded \"leadpedal2\"", "ReviewID": "R18LUC1H2NRH4M", "Overall": "4.0", "Content": "I bought this because of the powerful zoom lens and the inexpensive price.  I love taking zoom photos of nature and wanted something light and easy to stash in my pocket.  So far, it has worked pretty well. I took some indoor photos and was surprised at the scope of the photos. Alot more of the room was captured in each frame than I thought would be.  For example, I thought I was just taking a picture of the desk, and I got a photo of the desk and the entire wall behind it. Also, I wish it had a regular viewfinder, just because it is easier to keep the camera steady when you can brace your arms against your sides as you would using a regular camera. Using both the optical and digital zoom at full power, the pictures can be fuzzy and out of focus. I took 3 photos in a row of the same exact shot and they were all fuzzy. I am not sure this was because I didn't hold the camera steady enough or if the camera itself didn't focus well at the extreme range of Zoom. I  have uploaded some examples.", "Date": "November 3, 2011"}, {"Title": "GREAT PIX...........BATTERY SUCK-ER.", "Author": "t_hill", "ReviewID": "R1A6ISQL1S0P6P", "Overall": "3.0", "Content": "YOU MUST CHARGE IT LIKE AN iPOD (IMMEDIATLY OUT OF THE BOX/LOW POWER) OR IT WILL DRAIN YOUR BATTERY.  CHARGE IT AT HALF MASS AND AGAIN IT WONT DO ITS JOB.  PIX ARE GREAT OTHER THAN THAT.  IVE GONE THRU 4 BATTERIES.  I SHUDDA STAYED WITH MY SONY CYBERSHOT.  AT LEAST THAT BATTERY LASTED.", "Date": "December 20, 2011"}, {"Title": "Good camera and price", "Author": "C. Dye", "ReviewID": "R3VWYLPT0TVUEU", "Overall": "4.0", "Content": "For the price, this camera takes good quality photos, is easy to carry and use.  I had a Canon before and this takes photos that are as good in quality.", "Date": "April 15, 2013"}, {"Title": "Better than expected", "Author": "Brenda Wells", "ReviewID": "R2DQ5PNVROKPFU", "Overall": "4.0", "Content": "I was very satisfied with this camera. It takes nice pictures and we have used it repeatedly to post pictures online. The only fault was it needed a memory card which are inexpensive and the battery doesn't seem to last as long as expected.", "Date": "March 18, 2013"}, {"Title": "GE E1480W 14MP Digital Camera with 8X Optical Zoom and 3.0-Inch LCD...", "Author": "Theresa S.", "ReviewID": "R1BNW2WW6ULH6U", "Overall": "4.0", "Content": "Purchased this camera for my daughter for a Chrismtas present.Accurate description, looks like a quality camera, Have not used it yet,packaged well, speedy delivery.", "Date": "December 18, 2012"}, {"Title": "Great price and quickly received", "Author": "Christopher T. Rose", "ReviewID": "RHS0HRGJMYRO5", "Overall": "5.0", "Content": "The item was new and well packaged. It arrived very quickly after bought. The buyer was very friendly and the product was extremely quality. Great pictures and video, links well with Mac computer. Rechargable battery is the greatest idea.", "Date": "October 26, 2012"}, {"Title": "great for a newbie", "Author": "PAULA LISOWSKY", "ReviewID": "RRA8WE8G1JC3H", "Overall": "5.0", "Content": "I bought this camera for my mom, who is 84. This is her first digital camera...she learned to use it very quickly and is very pleased with it, as am I.", "Date": "November 18, 2011"}, {"Title": "good camera", "Author": "Rongbing Zhao", "ReviewID": "R2LDX3KFHV8FCF", "Overall": "4.0", "Content": "good camera, especially compare to its price.the only thing is the battery  can not insist long time", "Date": "January 26, 2011"}, {"Title": "Not Good", "Author": "EC", "ReviewID": "R3L4S3PQQ58KMA", "Overall": "1.0", "Content": "I bought this digital camera as it appeared to be a good value for a camera with an 8x optical zoom. I hoped it would be similar to my Samsung Digital Camera with a rechargeable battery and ease of use. Unfortunately that is Not The Case!It's advertised as coming with a rechargeable lithium battery BUT to recharge the battery you have to take it out of the camera and plug it into a separate recharegeable unit. My Samsung is Much Easier as all you have to do is plug the cord into wall outlet and the other end into the camera. Can you imagine if you had a cell phone where you had to take out the battery every night and plug that battery into a separate rechargeable unit. What a LOUSY Design.The menus are not nearly as simple to navigate as the Samsung. All in all I would not buy this camera again!", "Date": "October 16, 2012"}, {"Title": "terrible experience", "Author": "hernando", "ReviewID": "R1EMVBV1QY5BKQ", "Overall": "1.0", "Content": "it only work one time only. i tuned on and it stop working, and because i live outside the us is very dificult to claim the guarantee", "Date": "July 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "14MP Digital Camera with 8x optical zoom and 6x digital zoom\n3.0 Inch vibrant LCD with auto brightness\n18MB internal memory with SD/SDHC card support up to 16GB\nFace detection, in camera red eye removal, image stabilization, smile detection, blink detection, and face auto-exposure\nLithium-ion rechargeable battery", "Name": "GE E1480W 14MP Digital Camera with 8X Optical Zoom and 3.0-Inch LCD with Auto Brightness (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ni-ysD36L._SX300_.jpg", "ProductID": "B003B49HVU"}}