{"Reviews": [{"Title": "Peek-A-Boo", "Author": "eslowmotion", "ReviewID": "RUXIBDKQYRFUA", "Overall": "5.0", "Content": "This Surveillance system is by far one of the best items in security i has ever purchased,no more running to the door to answer it,the install was kinda easy for the do it your selfers,i love it and would recommend it to any home owner.", "Date": "September 24, 2011"}, {"Title": "church use", "Author": "Raymeril", "ReviewID": "R1AXRFYZER6FGS", "Overall": "5.0", "Content": "We purchased this to be used for our church building where the kids stay during the service, parents can be buzzed in and viewed thru the monitor.  Works great and was exactly what we wanted.", "Date": "March 4, 2013"}, {"Title": "Great buy!", "Author": "Margie", "ReviewID": "R1PUC13P5F83SJ", "Overall": "5.0", "Content": "I have crippling arthritis and it was hard for me to get to my door before the people left..so I purchased this surveillance system..It works really good..When people ring the doorbell or knock, I can view them without them knowing..Then, if alright, I can push the talk button and talk with them and they can answer me..I feel safer and more independent..It was just what I needed..I give it 5 stars..Margie Morrow", "Date": "May 21, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "This bundle includes a SVAT VIS300-7M2 hands free 2-wire color video intercom surveillance system with 7\" LCD monitor and outdoor night vision security camera and a bonus electric door strike remote unlock mechanism\nWorks with your existing doorbell wiring so setup is fast and hassle-free\nSafely identify visitors with video and audio before deciding to answer the door\nEnjoy the convenience of hands free operation; Night vision camera gives you around the clock protection\nDoor strike compatibility allows you to remotely unlock your door; Wiring distance of 164'; 7\" LCD screen", "Name": "SVAT VIS300-7M2 Hands Free 2-Wire Color Video Intercom Surveillance System with 7\" LCD Monitor and Outdoor Night Vision Security Camera & Bonus Electric Door Strike Remote Unlock Mechanism", "ImgURL": "http://ecx.images-amazon.com/images/I/41p0kNYbFyL._SY300_.jpg", "ProductID": "B0036F9LCO"}}