{"Reviews": [{"Title": "GREAT SOLUTION FOR IN WALL MONITOR!!", "Author": "Technician", "ReviewID": "R2KFEXC9J6Y0TM", "Overall": "5.0", "Content": "I am security installer and I had a job to mount in the wall a monitor in my customer's kitchen. I did some research looking for the right unit until I found this Pyle 19\" monitor. First I have to say this unit is a brain storm idea.1) When I cut the sheet-rock, even I if i do not cut exact on the line, the Plexiglas the unit comes with, will cover the hole.2) The Picture quality is great on this items when the customer answers the door he can see who is in front of his house.3) It matches great to the customer's kitchen wall and looks great!Note, for those \"in-home\" users, the unit does not include a 120v AC power supply to convert to the needed 12v DC that the screen requires. You must provide this yourself. You will need to buy this model in the link.http://www.amazon.com/Pyramid-PS2K-AC-DC-Adaptor/dp/B001OSCE7Y/ref=sr_1_8?ie=UTF8&qid;=1330616060&sr;=8-8", "Date": "March 1, 2012"}, {"Title": "Arrived DOA, replacement also DOA", "Author": "K. Dean", "ReviewID": "R12C3PLZ283O2V", "Overall": "1.0", "Content": "Received the first unit, the packaging looked okay but the edge of the metal frame was dented. I assume it was either a return or came like that from the factory. It powered on fine, the RCA worked fine... I did not have a high quality DVD to test it with. The VGA input did not work at all - computer recognized the screen but would not display to it. I tried various Windows laptops and a MacBook. RMA'd the unit and asked for a replacement as I was happy with the look and feel of the screen.Received the second unit, opened the box but did not bother taking the screen out of the box - the small power fuse box was broken in half right on the top. This time I asked for a refund as I am going to order a different brand and hope for better luck.Note, for those \"in-home\" users like me: The unit does not include a 120v AC power supply to convert to the needed 12v DC that the screen requires. You must provide this yourself. I was able to power it with a spare 12v 2.0amp DC power pack that I had on hand, but I am not sure what amperage it requires.", "Date": "February 1, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0037ZAJ9C"}}