{"Reviews": [{"Title": "Pretty good camera", "Author": "Jack", "ReviewID": "R3C9MLGPZS1MEZ", "Overall": "4.0", "Content": "This camera is diguised as a motion detector, however, the pinhole for the camera is a black dot on this white housing. I guess most people would not be aware it is a camera, but somebody with a little knowledge would quickly suspect it is a camera due to the black dot on it.Overall, the picture is OK & it has a nice field of view. I feel the color is a little washed out but I was able to adjust the brightness & contrast in my DVR, making the picture a little better. However, despite it's shortcomings, I am definitely able to make out features & identify who is being caught on video. So I am satisfied overall with the camera.Also, there is no infrared/nightvision with this camera, but I knew this buying it. I planned to use this camera to catch after hours theft from an office where the lighting may be dark. If the room has no light, you will see nothing. However, it does very well in low-light. For my purposes, I leave one of the office computer monitors on screensaver with no timeout. This provides little light for a person to see, but the camera uses this light efectively. Actually, with just the monitor on with no other lights I find it hard to see with my eyes but the camera view is nice & bright. So it's a good Low Lux camera. I am thinking of just putting in a night light intead of the montor to provide that little bit of light the camera needs.Also, it looks new, so you may want to dirty it up or scuff it a bit to make it look like it's been there for a long time to add to it's covert feature.", "Date": "July 28, 2011"}, {"Title": "this is not a stand alone camera", "Author": "Steve t \"SCT\"", "ReviewID": "R15DG2T47MGDF9", "Overall": "4.0", "Content": "I purchased this to use as a stand alone security camera, not realizing it needed to be hard wired to a recording source.I returned it with no questions asked and got a quick refund.", "Date": "April 30, 2012"}, {"Title": "cameras", "Author": "Jason Chin Sang", "ReviewID": "R3793KFU14VNRP", "Overall": "3.0", "Content": "The picture quality is good for the price. I expected it to have voice and it did not. Will not purchase this particular model again will look for one with which picks up sound.", "Date": "February 19, 2013"}, {"Title": "Pretty good - definitely covert!", "Author": "SDI", "ReviewID": "R3R5EUM2BF3PD8", "Overall": "4.0", "Content": "These are next to impossible to spot as a camera unless you know what to look for and are looking for them.  They tend to get a little bit of a washed out image in our office due to being so close to florescent lights in the ceiling, but still easy enough to see who is stealing paper clips from the supply closet.  In darkness you can't see anything because there aren't any infrared lights on it.  We just keep a permanent light on where we have several of these set up.  Easy to install and position/aim - good wide angle that shows an amazing portion of the room (albeit a little distorted like a fish eye due to the wide angle).  Definitely recommend if you need to know who is stealing the bosses lunch from the fridge or how attentive your babysitter is.", "Date": "December 11, 2012"}, {"Title": "Good camera", "Author": "D. Perry Jr.", "ReviewID": "R1APT93L6HHX2R", "Overall": "4.0", "Content": "Picture quality is great with good lighting. Not bad under low light. I wish it have infared for night. But overall a good product for the money.", "Date": "October 23, 2012"}, {"Title": "I was surprised in a good way.......", "Author": "YADA YADA YADA", "ReviewID": "R3UNJ1P5O0EJSP", "Overall": "5.0", "Content": "To begin with it's shipped Fedex, received in less than a week so I was happy with that. Good customer service too when I called.I didn't know what to expect for this camera since it is a pinhole type lens etc. but I was surprised that it has a good 45 degree or so view and with pretty good color!! It even matches up with other $50 outdoor mounted cameras I have. I also have another motion sensor camera that I purchased from another seller online from China and the color or view isn't as good. (It also took a month to get that one.)This isn't really for outdoors but I figured out a way to use it for that. I caulked all around the outside, in the back by the wires and around the part where the motion sensor is. The only part I didn't caulk was were the lens is and it has gone through some rain storms ok but we had a bad storm the other day and it fogged up. From what I figure due to the extreme wind with the rain some moisture got in through the lens. I tried to wipe it dry with a cloth from the outside but that didn't work. What I did then was drill two holes in the bottom to vent and it went away. I don't know how long it will last outdoors since I figure that moisture may affect something one day but still I'm pretty happy! I would buy another if it does cause problems and recommend this camera and company!!", "Date": "April 20, 2011"}], "ProductInfo": {"Price": "$65.00", "Features": "1/3\" Sony CCD High Video Quality 480 TV Lines\nLong Range IR 75ft/23m Covert Motion Detector Security Camera\n3.7mm Fixed Pin Hole Lens lets you focus and control your security environment\nCovert Motion Detector", "Name": "Vonnic C402W 1/3-Inch Sony CCD 480 TV Lines 3.7mm Fixed Lens Covert Motion Detector Security Camera (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/210YqzHJPqL._SY300_.jpg", "ProductID": "B003TOXP2O"}}