{"Reviews": [{"Title": "Sleak, Stylish and Functional", "Author": "Michael W. Akridge", "ReviewID": "R2QP6EST5TWM0F", "Overall": "5.0", "Content": "I spent sometime with it and now here are my thoughts. Well I must say I really like the look of it. The build feels great except the buttons. Nothing is wrong with the buttons but because its so small its something to get use to basically.*edit. A word about its quality. I just dropped it from eye height onto a hard surface. It still works/looks like new. Very impressed.Next point. Its very thin and small. The zoom however is not compromised by this and is just great while taking pictures at full zoom are very clear/sharp.The video feature is great. You can use zoom while recording, and there are different quality settings to save space.The nav is simple enough and it doesn't have too many features. I know cameras for the same price often have almost too many options but this has a nice balance. That is both a plus and a minus. If your a control freak then this is not for you. If you love the simple life then this is a good pick. Its just super easy to use and take good pictures. While its not loaded with features/manual controls it does come with plenty of preset options.  This will do for anybody really.Summary:The pictures come out great, zoom is great, style is great and the video is good for the price (I paid $150.) Panorama stitch mode is very nice as well. The camera isn't the best in the world but fair for the price.*Edit: Tried the easyshare software using my Mac. Its very easy to setup, just plug into computer and turn on the camera. Once the install is done you can setup all you have to do is put in your account info for the sites you want to have options to auto upload later on. The share button is easy enough. The software will also ask when you plug in your camera if you want to copy your photos and after if you want to wipe the camera card. Very simple and easy. Has nice options of uploading size to reduce time, send to e-mail accounts, and comment to on pics before publishing to sites like facebook.", "Date": "October 1, 2010"}, {"Title": "Huh? It's a Kodak?", "Author": "J. Kearney \"taste arbiter\"", "ReviewID": "R7J2UN6T7JTYA", "Overall": "4.0", "Content": "I bought this camera as a gift.  I didn't look close and thought it was a Canon camera - which is all I have ever bought before.  Only when I went to buy a SD card for it did I realize it was a Kodak camera.  Guess what?  It's great!  Big screen.  Excellent pictures.  No manual needed to figure out controls.  USB plug not hidden away.  I'm thrilled with my goof.", "Date": "October 27, 2010"}, {"Title": "So far so good", "Author": "K. Watanabe \"karlw2000\"", "ReviewID": "RCWA17T9KELL4", "Overall": "5.0", "Content": "I've only had it for 2 days, but it takes great pictures.  Does a great job on focus and no shake when I did max zoom.  I've been doing comparisons of these long shots vs max zoom and it's incredibly clear.  Not even using a tripod.  Looking at it, you wouldn't think it would take so much better shots than my casio that cost 3X just 2 years ago.", "Date": "September 26, 2010"}, {"Title": "Bittersweet", "Author": "L.L.", "ReviewID": "R2I6D57M3ZII3F", "Overall": "3.0", "Content": "I really wanted to like this camera but looks like I will have to return it. I'm a dedicated Kodak camera user and recently bought this one as an upgrade to an old one that experienced water damage. The camera itself is well made, thin and easy to use as expected. Shutter speed is excellent as always. However compared to other kodak cameras bought in the past the picture quality is just not that great. Close up shots tend to come out great. However any photo in which I had to zoom is definitely not what I expected. Also the display screen images are very grainy compared to display screens on previous Kodak cameras I owned. Honestly for 130 dollars you can't really complain too much. However  as a dedicated Kodak camera user I prefer and expect better picture quality. Now I'm tempted to purchase the Canon 1400is which my sister recently purchased and picture quality is excellent.", "Date": "December 22, 2010"}, {"Title": "I want to run over this camera with my truck!", "Author": "JSRobertson", "ReviewID": "REU8T31DU3705", "Overall": "1.0", "Content": "I have owned a lot of cameras and have never had one that I could say I absolutely hated until the M590.  From the day I got it out of the box, I have had nothing but problems.  It often will not take a picture.  Then 5 or 10 seconds later, it takes one.  I have many pictures of my carpet and ceiling.  It freezes up and says \"processing\" and the only way to get it to stop is to take the battery out.  It won't turn off about every 3rd time I use it and the only way to turn it off is to take the battery out.  The zoom often won't work, and then suddenly 20-30 seconds later it will zoom on it's own.  Maybe I received a dud, but I see that at least 1 other user has had similar issues.Only pros: it's cheap, cute, and the battery lasts a decent amount of time.  But it's not worth $10 in my opinion.", "Date": "March 12, 2011"}, {"Title": "GOOD BUT NOT PERFECT", "Author": "N. Cunningham", "ReviewID": "RWGROKW138FA3", "Overall": "4.0", "Content": "Most of the claims for this camera are accurate.  Easy to use, variety of use modes,very light and thin.  That said I am still trying to figure out the correct settings as the quality of pictures is not what I hoped.  The one negative aspect is that it is very easy to turn the camera on, which I have done accidentally on several occasions resulting in using up the battery.  Generally the battery life is very good with that exception.", "Date": "October 24, 2010"}, {"Title": "Love it - better than a Nikon S80", "Author": "Bobby Meeks", "ReviewID": "R3TRLYTDTJM3H5", "Overall": "5.0", "Content": "Short and sweet - got this camera on sale - there was a Nikon S80 at the same place (also on sale) and this was the better of the two.  I kept it and returned the Nikon in 2 days.I am a very experienced photographer with a GREAT DSLR (Pentax KX) and have had many digital cameras...PRO: FAST shoot time from power on, plus quick turnaround between shots.  GREAT image quality in many varied settings using basic camera setting.  Really good video a plus.  USES THE SAME POWER CORD AS ALL OF MY OTHER DEVICES!!!!!!!  A HUGE plus - I can use my existing car and home chargers for my phone and it seems to do fine.  All menu buttons are REAL buttons and don't require a warm - dry - un-gloved hand to navigate a touch screen(like the Nikon) - this is going to be important in the winter.  Easy to stick in a pocket since it is so small!  Built tough best I can tell.  Green light for distance is cool.  Can shoot a great shot in pitch dark using the range finder and flash (don't know why anyone would ever need that, but was a cool test).  No lens sticking out the front - very pocket friendly.CON: Like several reviews said - the power button is dreadfully sensitive!!!!  Picking up the camera and putting it in a pocket will turn it on.  Good news is the battery has been pretty tolerant.  I would love to see a firmware update that addresses this by simply adding a one second press to turn the camera on and off.  That would eliminate the accidental power cycles.  Another con is that it uses MICRO SD, not a huge deal, but I can;t re-use the already massive supply of SD cards I already own nor can I just plug the memory card into my laptop - but again, not a huge deal.  Face tracking is not the fastest, but pretty good for a hundred dollar camera (on sale).This is a good choice and a pleasure to own so far.", "Date": "October 3, 2011"}, {"Title": "I love my Kodak M590.", "Author": "Amazon Customer", "ReviewID": "RYO6IFTNW02UP", "Overall": "4.0", "Content": "I am very glad I decided to buy the Kodak M590. It is, overall, a pretty amazing camera. It's super slim and sleek and very adorable. It takes very clear, crisp, beautiful pictures even without flash or if you have to zoom in a lot. It takes pretty good video for a point and shoot camera and it even let's you take still pictures from a video. There aren't a lot of confusing buttons, there's only a few and they're very basic and self explanatory.I also like how you can scroll through your pictures and pick which ones you want to share on all the networking sites like Facebook, Flickr, etc.. The easy share button is definitely a plus. As soon as you plug it in to your computer, your pictures are sent to where you want them to go.My one and ONLY complaint is that when you take pictures without flash, you have to hold your hands very still! If you move even a little, it will come out blurred. It took me a few tries to get a good picture of my lit-up Christmas tree with the lights off and my flash off to get a good picture. As long as you can sit tight for the one second it takes for the picture to show, you'll be fine.I would definitely recommend this camera to a friend! Enjoy!", "Date": "December 20, 2010"}, {"Title": "kodak camera is great!", "Author": "angie15", "ReviewID": "R3N5YTJDCBY9R2", "Overall": "4.0", "Content": "This camera is great- small & sleek. It is easy to use but has so many darn settings!! I wish the power on button was not so touchy, I think if you breathe on it, it turns on. Otherwise, great- probably one of the best cameras I've ever bought. Overall, I would rec this to  a friend! Shipping was fast and it is brand new and exactly like its described!", "Date": "February 21, 2011"}, {"Title": "Nice, compact travel camera", "Author": "Kristen Barau", "ReviewID": "R24Y1Y0P8EDT6S", "Overall": "4.0", "Content": "I bought this camera over the summer.  I have been traveling a lot more & would either be using my mom's bulking older camera or my iPhone 3Gs.  The older camera was inconvenient to bring along with me & had too many attachments to keep track of.  The iPhone camera is super convenient, but not very good quality.  So, I knew I needed to make an investment on a new camera.  I looked around & decided on this one.  Overall, I'm happy with the purchase.  The camera is small & the color & look of the camera is appealing.  It took me some time to learn how to switch through all the modes & to zoom, but once these were learned, I could switch through them easily & quickly.  The picture quality is great & the facial recognition software is nice.  The software used to upload the photos onto your PC is auto installed & easy to use too.  The only thing that was really disappointing for me with this camera is the Facebook share feature.  I had thought that you could select it on the camera & it would automatically upload onto FB.  However, it doesn't do this until you actually connect the camera to your PC.  At that point, I'd want to view the pictures & possibly modify the pictures a bit before uploading.  So, the auto share feature seems pointless to me which is disappointing b/c that was something I was really excited about when I ordered it.  I would still recommend the camera - it does take great pics - just be aware of how the FB share tool works.", "Date": "January 21, 2011"}, {"Title": "Great Value!", "Author": "Carrie Hanson", "ReviewID": "R1AFJPFJTQF8W2", "Overall": "5.0", "Content": "I've been using this camera for about a month now and I think it's an awesome camera for the price. As far as 'point and shoot' cameras go, this is the best I've owned (I've had Casios and Nikons before). All the pictures I've taken have come out incredibly clear, even those that were taken in low light or using the max zoon. Using the camera is easy to figure out and pretty self explanitory- I've only had to get out the instruction booklet a few times. I also haven't had the problem with the power button that others do, where it turns on very easily.Overall, I am very pleased with my purchase! For the price, you won't find a better camera.", "Date": "December 29, 2010"}, {"Title": "Great features but low quality pcitures", "Author": "mehoolio", "ReviewID": "RVE5BAQTTL4QI", "Overall": "2.0", "Content": "The camera is great, thin, the easy share function is awesome, the video camera is easy to use. The issue is the qulity of still pictures. Sometimes it is sharp *(never as sharp as my casio exilim though) and sometimes it is pretty poor sharpness. I am not sure why. Close ups seem to be sharper but distances of around 10 feet are really hit or miss. The casio ex-s770 has much cripser pictures", "Date": "September 9, 2010"}, {"Title": "Poorly designed", "Author": "Robert L. Eichler Jr. \"Bob\"", "ReviewID": "R3CPSE06T7CIP2", "Overall": "2.0", "Content": "Unlike other reviewers who gave this camera a bad review, I don't really have a problem with the picture quality.  You do have to stand fairly still while taking pictures, especially if the flash is off, to avoid getting grainy/blurry pictures, but that's been the case with every digital camera I've owned.However, my family and I just got back from a vacation, and as I offloaded the pictures from the camera and looked at them, I found that in a good portion of them, either my finger was blocking half the shot or it was a picture of the inside of my pocket.  That's my problem with this camera - it's really poorly designed.  The lens is in the upper left corner (as you hold it to shoot) and the button to take a picture is at the top right.  So the natural way to hold it leaves your fingers right over the camera lens unless you're really, really careful about it.  And the buttons must be awfully touchy because I ended up with the camera going off at least a half dozen times while it was in my pocket.There are five buttons in the back - flash on/off, delete, menu, info and view picture.  They're right up against each other, and if you're in a dark environment (like an indoor ride at an amusement park), it's REALLY easy to accidentally press the delete button when you meant to turn the flash off or bring the menu up.The kicker is that when we got home, I discovered that the first 60 or so pictures that we took were just gone.  No idea what happened to them - they're just not on the camera any more.  I know they were there just a couple days ago, because I got bored waiting to get on a ride and looked through them all.  I don't know if I accidentally pressed a button or what, but the whole first day and a half of our vacation was just magically deleted off the camera.I guess once I get used to how the thing functions and learn to avoid the pitfalls it'll be an OK camera, but right now I'm pretty disgusted with it.POSTSCRIPT - a couple months ago my daughter was using this camera to take some pictures and set it down on her bed.  It slid off and fell about two feet onto the knobby end of an extension cord on the floor.  That was enough to destroy the camera.  The outer casing was dented really badly, and the camera wouldn't power up any more.  So on top of all its other flaws, this camera is really flimsily built.  Frankly I was glad it got destroyed because it gave me the excuse to go buy a much better camera.", "Date": "June 1, 2011"}, {"Title": "All that glitters is not gold", "Author": "Mr. N", "ReviewID": "R1MV16GYDRBMRD", "Overall": "1.0", "Content": "I should have looked at other reviews before I bought this!...I thought hey; purple camera, getting it for my intelligent sister, its feminine and looks simple as well as sleek...jackpot!....maybe?....boy was I wrong; you know how when you send a gift and someone likes it, they call immediately and thank you, if not they still call you immediately and...'tell you'...to put it nicely. Alright, so long story short, don't mind that huge megapixel number, the picture was terribly grainy when it zoomed in and who on earth wants to manage grainy memories...its not like you can photoshop it till its not grainy. I ended up returning it and sending her something nicer, about the same size, but she loved it....thank God.", "Date": "May 12, 2011"}, {"Title": "Stylish Cute Perfect", "Author": "BluAmbition05", "ReviewID": "R13KG9L4X82S4M", "Overall": "5.0", "Content": "I read some of the reviews and kind of was hesitant about purchasing this camera. I'm happy I got it! It was the perfect birthday gift to me. I don't have to wait for the camera to load I can keep hitting the shutter button and it captures every second. LOVE IT!", "Date": "January 11, 2011"}, {"Title": "Kodak M590 Easyshare really fair for the price, =) really neat!", "Author": "Vodskar", "ReviewID": "R1C2YO09D9PZBB", "Overall": "5.0", "Content": "Easy to use, variety of use modes, very light, thin, big screen.The one negative aspect is that it is very easy to turn the camera on, which I have done accidentally on several occasions resulting in using up the battery.Generally the battery life is very good with that exception.Easyshare software is very easy to setup, just plug into computer and turn on the camera. Once the install is done you can setup all you have to do is put in your account info for the sites you want to have options to auto upload later on. The share button is easy enough. The software will also ask when you plug in your camera if you want to copy your photos and after if you want to wipe the camera card. Very simple and easy. Has nice options of uploading size to reduce time, send to e-mail accounts, and comment to on pics before publishing to sites like Facebook.The camera isn't the best in the world but fair for the price, can't beat the Amazon price, and really fast shipping.", "Date": "December 3, 2010"}, {"Title": "Sleek, but not great", "Author": "J. Comeaux \"AudioBook Fan Extraordinaire\"", "ReviewID": "R3RZ6WNHPJDGVZ", "Overall": "3.0", "Content": "I really like many things about this camera (sleek, easy-to-use Kodak user interface, fingers don't get in the way), but the one thing that was unacceptable was the photo quality. If i hadn't had a Canon PowerShot nearby, and just for fun took a family photo with both, and then compared, I would not have realized it is just second-best. I really missed having a Kodak (my previous one went swimming and didn't survive), and the Canon interface was new and different, so I spent a hundred dollars on a new Kodak. But side by side, it was obvious. I guess it's the lens sharpness that just doesn't match the Canon. I am returning this Kodak after one-day's use. And like I said to my son, if I didn't have the Canon to compare to, I would not have known.", "Date": "March 8, 2011"}, {"Title": "Kodak M590 you don't need look any further", "Author": "J. Montgomery \"ND80\"", "ReviewID": "R2OH01DPR3C7XI", "Overall": "5.0", "Content": "One great point and shoot camera, and a very smart one also. Can't beat the Amazon price, and fast free shipping.", "Date": "October 25, 2010"}, {"Title": "Okay", "Author": "Traci \"college student\"", "ReviewID": "R3GM4EUU5RS263", "Overall": "3.0", "Content": "It's a good camera for outside shots. I was really impressed with the pictures I took at a zoo in bright sunlight. This camera is awful inside or at concerts. Video is decent inside and outside.I wish I would have returned it when I had the chance. It's an awesome size but if you stick it in your pocket your very likely to turn it on because the power button is in the worst place. If your only looking to take pictures outside and you find this on sale - it is good for the price.", "Date": "December 27, 2011"}, {"Title": "Great camera for the price", "Author": "Juan Cazador \"Juan cazador\"", "ReviewID": "R1BIX4OO8NKUUH", "Overall": "5.0", "Content": "This is a very good camera for the price. I have owned two of them. I gave the first one away as a gift after having it for about 7 months, and immediately bought another one for myself again. I paid less for the 2nd one, which I bought here at Amazon. The first one I bought at Office Depot for $80.00, which was still a great price, and Amazon's price was even better.I only find two minor faults with the camera. The first one is that the button for turning the camera on and off and the one for snapping photos are the same size and are side by side, which sometimes causes one to shut the camera off when you meant to snap a photo, or you snap a photo when you meant to shut it off.The second problem is that the instruction manual is practically useless. It's so vague on some things and does not even mention others. When I had my first camera I ran into a problem where it would shut off when I connected it to the computer via USB cord to download photos. It would just shut off completely. No where in the instruction manual could I find any reason why. Finally, by trial & error I discovered that the microSD card had to be formatted by the camera. The option for this is found under \"configurations\". THIS IS NOT EVEN MENTIONED IN THE INTRUCTION MANUAL! Once I formatted the camera never gave me trouble, and  I recently bought another card, a 32GB microSD card for it. I went into \"configurations\", formatted it, and all's well.Aside from that, the camera is great, and it takes video of a quality that's equal to a camcorder. I've never had a digital cam that takes quality video until this camera. Every other digital camera I've had in the past took great photos, but the video was of inferior quality. Not so with the Kodak M590. The video quality is crystal clear and in MP4 format.", "Date": "November 30, 2011"}, {"Title": "Problems from Day One", "Author": "Mark Witt", "ReviewID": "R2RN74AARVPHM5", "Overall": "2.0", "Content": "I bought this as a gift for my Wife on her birthday. In the first two days it corrupted the memory card by not saving correctly. So I bought a new card, thinking maybe it wasn't the camera. It had tons of issues with taking pictures in low light and it trying to focus. During my buddies going away party we couldn't get the thing to work. It now has problems with the button itself. When you click it to take a picture, it will pop the focus and not take a picture. We have to turn it off and on again to make it work. It is a nice design and when it works it is a nice camera. I did contact their customer service and they said it was beyond return (At 4 months is when I called). So we are stuck with it.", "Date": "October 27, 2011"}, {"Title": "Very Nice Point and Shoot Camera", "Author": "C. Chen \"Flawless0369\"", "ReviewID": "RQ2BUULN2JF16", "Overall": "5.0", "Content": "This is a great camera for someone wanting to just point and shoot without the huge lenses.The camera is small, portable, and the picture quality is good enough for point and shoot.Battery last for a long time between charges.This camera uses micro SD instead of the stand SD card, not that it's a bad thing, but it would be nice if it was specify in the product description.I ordered a 8GB SD card and couldn't use it.  Good thing I have some Micro SD sitting around.", "Date": "September 27, 2011"}, {"Title": "great little camera", "Author": "Dona", "ReviewID": "R3W24CNXISW8W9", "Overall": "5.0", "Content": "I was introduced to this camera by a friend.  She was taking photographs of printed material and it was close up and clear.  My \"good \" camera can take only so close and you have to be 36\" away and then zoom in.  I was in need of being able to get really close up.  Fantastic little camera.  I just keep it is my purse it is so small.  I have taken it to the store to have prints developed by using the larger card and inserting the one in the camera so it fits the machines.  Learned that from a salesman.  I had to buy that extra.  No mention of that in the directions.  I am still trying to figure out how to download it to my computer.  I find the directions a bit lacking.  That is my only complaint.", "Date": "May 22, 2011"}, {"Title": "Just as described !!", "Author": "Mizz Spice Monroe", "ReviewID": "R1HHDSNCUNK1UO", "Overall": "5.0", "Content": "This item was just as described,I love it and u can't find a better price anywhere! Atleast not new beware of anything cheaper it could b refurbished", "Date": "November 14, 2010"}, {"Title": "Very good camera for a very good price!!", "Author": "Jose", "ReviewID": "R2I4CV0IP2LKYG", "Overall": "5.0", "Content": "Nice image, very easy to use, only thing was the battery drains faster than most usual cameras but overall its like an experience.", "Date": "September 25, 2010"}, {"Title": "Good Camera but gets stuck often", "Author": "Ram \"Ram\"", "ReviewID": "RKAXGO4WUSL3D", "Overall": "4.0", "Content": "We bought this camera thru amazon. This camera is good for all basic photo needs. We like the various settings on the camera for dark lighting conditions etc. The pouch that came with it is so handy. This camera often gets stuck. When we switch it ON, it never turns ON and we have to remove open the battery compartment and remove the battery and reinsert it back so that it \"resets\". Other than that we do not have any problems with this camera. The picture quality is good and the easyshare application is so easy to use to export pictures to the computer and sharing.", "Date": "May 9, 2011"}, {"Title": "In LOVE", "Author": "M. Avery", "ReviewID": "R1IDQVNKTJL77Q", "Overall": "5.0", "Content": "I love this camera!It's a really good point-and-shoot camera! the photos are crisp and clear and they've made easier to use than previous models!I love the share button! Uploading photos on facebook is such a hassel, the share button makes it easy! And u can use the share button for other websites and to email! I love it!I love the tagging system. it makes searching for photos so simple and not time consuming (u don't have to go through the photos one by one!)It's thin, and nice looking, but also unique! LOVE IT!", "Date": "February 3, 2011"}, {"Title": "Wrong design for power on & off button", "Author": "Stevenk", "ReviewID": "R3675WXRM12XWN", "Overall": "3.0", "Content": "It is very easy to wrong touch the power button when you carry it on the go. I think it is the design problem. When put it into the pouch after used, every time¡E you have to ensure carefully not to switch it on.  Nevertheless, the system can be set to power off automatically when not use for a moment.", "Date": "January 2, 2011"}, {"Title": "Great little camera", "Author": "cashefox", "ReviewID": "R1WUKQUNSR3KSE", "Overall": "5.0", "Content": "This product was shipped exactly as advertised.  I am very pleased with the product, price and shipping. I would recommend this to anyone wishing to carry a pocket size camera.", "Date": "August 20, 2013"}, {"Title": "Awesome Cam!", "Author": "Jigar", "ReviewID": "R1B8JN3JPED9RY", "Overall": "4.0", "Content": "Great cam, very very cheap price compare to the features it gives with that price. Great one, I will recommoded this product", "Date": "June 18, 2013"}, {"Title": "My camera", "Author": "Carolyn McCoy", "ReviewID": "R1ONJ3OUPBBFTX", "Overall": "3.0", "Content": "No scratches. But I had to return it because when you turn it on it was snowy. Sometimes you would have to take battery out to turn it on as well.", "Date": "June 14, 2013"}, {"Title": "Very bad camera", "Author": "Xantub \"Blurpo\"", "ReviewID": "R3RW311LORZMNP", "Overall": "1.0", "Content": "I bought it about 1.5 years ago. It started perfect but now it's gone crazy. You click on a button and it gets stuck on it (press 'left' and it'll go left forever, press 'info', same thing), and then it has several seconds delay trying to do anything, until several seconds later and you can only 'reset' it by removing the battery. Not recommended.", "Date": "November 26, 2012"}, {"Title": "It was the perfect little gift to myself!", "Author": "Yasmeen", "ReviewID": "R1LRZZFNSP49NX", "Overall": "4.0", "Content": "I bought this camera in 2010 I believe..  And it was perfect until about a month ago. It died :( Just stopped working. BUT I'm pretty sure I've dropped it a couple of  times, so I'm not blaming the camera. It was very easy to work with, and the pictures came out surprisingly good quality for this 14mpx camera.I would definitely recommend this camera! Especially in Red.It's small, sleek, pretty, AND performs very well! Also, it's super cheap. ;)I'm now deciding which camera to buy... Hmmmmm.", "Date": "November 21, 2012"}, {"Title": "Hate this camera!", "Author": "Anonymous", "ReviewID": "R8FP0KYO41BLQ", "Overall": "1.0", "Content": "DO NOT BUY!!!  My mom and I have identical cameras and they have the same problems:CONS:1.  The camera does not always turn on.  Most of the time I have to take the battery out and then turn it on.2.  If you cannot hold the camera perfectly still it will take blurry pics.3.  Cheap cheap cheap.  Do not buy the cheapest camera you can find!!!", "Date": "July 31, 2012"}, {"Title": "Love this little camera!", "Author": "Mommyheckel", "ReviewID": "R1L10AAMYHT6XL", "Overall": "5.0", "Content": "This is a great compact little camera that is perfect for trips, or everyday use!  I have another larger Kodak camera, but I wanted this one when we went to Vegas.  Something small and lightweight. I have used it so much since...I haven't even gotten the other camera out of the case in over a year!  It takes great, clear pitures, and is very easy to use!  I recommend this camera to anyone looking for size, ease, and dependability!", "Date": "July 19, 2012"}, {"Title": "I LOVE IT!!!!", "Author": "EMARK1", "ReviewID": "R22NARGDRIHYR4", "Overall": "5.0", "Content": "I received this camera about a year ago for a Christmas present. I loved it! Being that this is my first digital camera EVER, I thought it was going to be difficult to learn to use it. To my surprise, it was relatively easy. I figured out most things on my own and used the instruction manual when I couldn't figure something out. The pictures are wonderful and I am loving the features of this camera. Sadly, someone else liked my camera too and stole it from me. I searched high and low for a replacement and couldn't find one. I am so glad I turned to Amazon. I found a replacement for a great price. I am anxiously awaiting its arrival! THANK YOU AMAZON!!!!", "Date": "March 9, 2012"}, {"Title": "very dissapointed", "Author": "BreeAnne Green", "ReviewID": "ROHKLVN5Q8P4N", "Overall": "2.0", "Content": "I bought this camera for my sister around Christmas and she used it once and put it up. When she went to use it a couple months later it would power on but not take a picture. So now she is stick with a gift that don't work.", "Date": "December 17, 2010"}, {"Title": "Good camera but...", "Author": "Barbara Joe Williams \"Barbara Joe-Williams\"", "ReviewID": "R37WHILP0BFN1O", "Overall": "4.0", "Content": "I've had this camera for one day and I love everything about it except for one thing. You have to manually set the date stamp on each picture after it's taken. To me, that's a big pain because I've gotten used to having the date automatically stamped on my photographs. I just switched from a Nikon back to Kodak and I'm disappointed with this feature. What were they thinking?", "Date": "January 6, 2011"}, {"Title": "Very good Camera for the price", "Author": "Contrail D. Allen", "ReviewID": "RYDT111A9EU67", "Overall": "5.0", "Content": "This camera is great on the go. Easily fits anywhere and the photos are terrific. Great deal for the price you pay.", "Date": "October 9, 2011"}, {"Title": "Cool Cam", "Author": "LH", "ReviewID": "R3M9UBLD0R2RYL", "Overall": "5.0", "Content": "This is a great cam, for the price its a good alternative to expensive cams, you get the main caracteristics of a expensive cam in this one, like 14 megapixels, 5x optical zoom, image stabilizer and more. Good deal", "Date": "September 1, 2011"}, {"Title": "So far so good", "Author": "JayC", "ReviewID": "R3S7041Y7DB5L7", "Overall": "5.0", "Content": "I bought this camera for my 9yr old he loves it. We recently went to the central park zoo and he took a bunch of great photo's. He likes it.", "Date": "August 19, 2011"}, {"Title": "Kodak M590...a disappointing purchase", "Author": "KC", "ReviewID": "R1BIJWQWKPC8T6", "Overall": "2.0", "Content": "I am a Kodak digital camera fan. I have previously owned 3 Kodak cameras (CX7250; M833; M1033). I currently own the Z950. (Best ever). Upon deciding to purchase the M590 for my daughter I was impressed with the advertisement of the camera being the \"world's thinnest\" camera and the fact that the user would be able to upload pictures to YOUTUBE, Facebook, etc. with the push a button after connecting to the computer. Anyway, upon receiving the camera I loved the design of the camera. After owning so many Kodak cameras I am very familiar with the \"bells and whistles\" and also I think the Kodak cameras are very user-friendly. First, I think the camera was defective because the camera would not charge up after plugging the USB cord in the adapter. I was unable to take pictures if it was not plugged up. The pictures came out ok but the display on the 2.7 LCD screen were grainy and not clear. The body of the camera had too much plastic making it have a \"cheap\" feel to it because of the lightweight thin body. I repeatedly tried to charge the battery but it just would not work...so I returned the camera for a refund with no problems from Amazon. Also, after I had purchased the camera, Amazon had the camera for a lower price than my purchase price. I bought another Kodak camera...M580 which is excellent. (didn't purchase from Amazon but Amazon has that camera also). Before purchasing any electronic items I find the reviews helpful before making a final decision to buy.", "Date": "July 19, 2011"}, {"Title": "Kodak EasyShare M590 Digital Camera - Silver", "Author": "Omega66", "ReviewID": "R289DZC0651NN0", "Overall": "4.0", "Content": "Nice camera, really small, not heavy at all, easy to use and looks cool.The only thing I don't like about this camera are the zoom buttons, it is really hard to zoom in or out pictures.Overall I will definitely recommend this camera to everyone, specially for the price (less than $90).", "Date": "June 12, 2011"}, {"Title": "Spectacular photos!", "Author": "Cynthia McFarland \"Cindy McFarland\"", "ReviewID": "R1IXIKW6V5SJOU", "Overall": "5.0", "Content": "Love my new camera. So tiny and compact and takes spectacular pictures. The only negative thing about it, is when you pick it up it's so easy to accidentally click-on the Power button without noticing it. Other than that I love the slim compact design and am very happy with this purchase!", "Date": "May 8, 2011"}, {"Title": "HAPPY", "Author": "John D. Jacoby \"JAKE\"", "ReviewID": "RXYQSVOVQMT0", "Overall": "5.0", "Content": "My Kodak M590 is just the camera I needed. Simple to use and no lens projection. I wanted a small camera that I could carry with me without feeling burdened. I am not a camera buff, but it takes good videos. Happy!", "Date": "April 6, 2011"}, {"Title": "Excellent Photos", "Author": "FJones", "ReviewID": "R1L2QAO40GIHSC", "Overall": "5.0", "Content": "I absolutely love this camera. It takes wonderful pictures even at the zoom level. The focus feature provides clear, crisp photos. I love the size of the camera. I can easily slip it in my purse or my pocket.", "Date": "April 2, 2011"}, {"Title": "Love the style of this camera", "Author": "Ebo", "ReviewID": "R3ACBHW6XQMJD4", "Overall": "3.0", "Content": "I owned a Olympus digi cam for 4 years of no problems and it finally klunked out on me and I never had time to repair it so I got this one.  I like the style of the Kodak however, the top buttons are extremely sensitive to touch when reviewing your photos- the camera will cut off at times.  It also doesnt recognize everyone's face when taking pic or tagging individuals.  You can only store up to 20 names for tagging.  The battery life is not as long as I like either.", "Date": "April 4, 2011"}, {"Title": "Worked then the charger went bad", "Author": "Crystal J", "ReviewID": "R1XDFHGD44YO0X", "Overall": "3.0", "Content": "If u want a simple camera without the bells and whistles this is one to chose. It is suitable for a night out with friends or a day at the beach but surprisingly after 4 months the charger was not charging it anymore. Economy is low now and i expect when i buy something it would last. So now i gotta look a charger other than that its not bad.....", "Date": "June 20, 2011"}, {"Title": "Excellent Product", "Author": "Olaveslj", "ReviewID": "R3OGT50WHRD1IT", "Overall": "4.0", "Content": "This is my first product Kodak, the camera is really easy to use, the zoom is very good. I am satisfy with this product", "Date": "May 14, 2011"}, {"Title": "Gift", "Author": "Ed Waterman", "ReviewID": "R3EHES2D6G547F", "Overall": "4.0", "Content": "Purchase was a gift for our grandaughter, and have heard no9 problems with it. So she must be happy with it.", "Date": "January 20, 2011"}, {"Title": "gift for my daughter,, she loves it!", "Author": "Reen727", "ReviewID": "R1ZF44DPI890S0", "Overall": "5.0", "Content": "I bought this for my daughter as a Christmas gift.  She absolutely loves it.  She said its easy to use even if someone were not completely electronically literate.  I'm one of those people. lol I tried it out and must agree with her.  I would highly recommend this to everyone.  It takes great pictures.  As usual, Amazon had the best price!", "Date": "January 15, 2011"}, {"Title": "Christmas gift for wife", "Author": "synjun", "ReviewID": "R1LPRJCMOR312I", "Overall": "5.0", "Content": "The m590 is sorta hard to hold onto and accidently push buttons, if you change settings from smart capture to scenes and you turn it off, it defaults back to smart capture a little frustrating. The share software didnt work with the Kodak Easyshare at first had to reboot. After a few days it seems to be a great camera, you just have to get used to it...", "Date": "December 28, 2010"}, {"Title": "Camera hung up repeatedly", "Author": "Ken \"Ken\"", "ReviewID": "R290CTIOIOEZ6G", "Overall": "1.0", "Content": "I got this as a present, but in trying it out the first day, the camera hung on me.  I couldn't get it to turn off, and had to remove the battery.  Kodak customer support said the memory card was probably bad, so I replaced this, and it kept hanging up, and the memory card from the Kodak camera worked fine in my Olympus.  It seemed to happen more often when I switched between camera and video mode.  My daughter noticed the same thing when I gave it to her.  It would happen about every 30 minutes of shooting, just enough to be a pain in the neck and make you miss good shots.  One of Kodak's other Easyshare cameras had a similar problem.  Kodak said they hadn't heard of that problem on this unit.  I guess they have heard about it now, as I'm reporting it.  Kodak said I could send the camera back for repair, but I opted to return the unit for a refund, which I guess is a good reason to shop on Amazon.", "Date": "February 23, 2011"}, {"Title": "Misleading \"Share\" Features", "Author": "pickle_joos", "ReviewID": "R1SXANBCX7XK7B", "Overall": "3.0", "Content": "I purchased this camera when I heard about the wifi-enabled sharing feature - of course it's too good to be true!  I thought it would be so handy on my upcoming honeymoon to send pictures directly to Facebook, or to family members via e-mail.  But...it doesn't exactly work like that.  You can \"tag\" your photos for upload to FB, e-mail, YouTube, etc. on the camera...then when you connect your camera to the computer, it quickly and easily distributes these photos to whatever site you've previously indicated.  Not so bad, but definitely not as convenient as I was hoping.  Reviews of this product were misleading and now I wish I had purchased a different camera.Additionally, the power cord is a little finicky - have to really wiggle it in the microUSB port to get the camera charging, and I didn't figure this out for several days.  The good news is that most cell phone chargers with a microUSB cord will also do the trick, making it convenient for traveling and consolidating.I will say that it takes good pictures and the features are very easy to use.  Upload to the camera/social media is fast & extremely easy.  Good quality for the price.", "Date": "September 21, 2011"}, {"Title": "Easyshare M590 Digital Camera", "Author": "brrrrabbit", "ReviewID": "RBNMNH2D4GK50", "Overall": "3.0", "Content": "WORKED GREAT FOR FIRST 2 WEEKS NOW I HAVE TO SHIP IT BACK AT MY EXPENSE BECAUSE IT WILL NOT TAKE PICTURES AT ALL! QUITE DISAPPOINTED AT THIS TIME ESPECIALLY NOW IT'S THE HOLIDAYS YET I STILL WANT THE SAME CAMERA REPLACED BECAUSE I AM IMPRESSED HOW WELL IT DID TAKE PICTURES.", "Date": "December 25, 2010"}, {"Title": "Very Disappointing", "Author": "Frank Long", "ReviewID": "R25YMOSM5DHVYC", "Overall": "1.0", "Content": "I have purchased at least ten inexpensive digital cameras within the past 2 years. (the kids loose them quickly) All have been priced between $100 and $200. The Kodak M590 is by far the worst. At least 50% of the photos are unacceptable..out of focus, no flash when needed, flash when not needed. I certainly hope my camera is a defective unit and other units of this model are more reliable.", "Date": "March 23, 2011"}, {"Title": "Waste of time and money", "Author": "F. Fetrat", "ReviewID": "R3T4HVJROLU3Q7", "Overall": "1.0", "Content": "I bought this camera during black Friday deals, I was hoping for an average pictures quality with a sleek and handy design but non of them came true. The picture quality was so low, I'm a DSLR user and know how to play with manual options but despite what is says about high ISO sensitivity I could barely take any good picture in normal room light. The buttons were so awkward and inconvenient. I returned it and chose a similar Panasonic FP1. Who cares about 2mm extra thickness!!!", "Date": "December 1, 2010"}, {"Title": "Looks great; if only it worked...", "Author": "Shelia Owens", "ReviewID": "RLZ86TETBGGYJ", "Overall": "1.0", "Content": "I ordered this sleek looking camera for my daughter for Christmas, and it was a bust. She wanted a Kodak because of the direct upload to Facebook feature.  Unfortunately, she never got a chance to use it because the battery never charged - AT ALL!  She could take a picture only while it was plugged into an AC outlet. So, I returned it to Amazon and will now go with a tried and true Canon.", "Date": "December 30, 2010"}, {"Title": "WORSE camera ever!!", "Author": "Dethpix", "ReviewID": "R1FQRWQHGBM28R", "Overall": "1.0", "Content": "This is the worse camera I ever had! I seriously hated it and sold it back a few days after buying it, I wouldn't even buy it for 1$ I swear keep your money safe, you'll be disappointed!!No auto focus, pictures are all blur no matter which scene you choose, noise pictures, can't work properly without flash on, flash to bright make you look like a zombie with red eyes!!People who like this camera truly never used another camera than this one cause even the 10$ camera that my sister bought last week makes better photo than this one & it's a 5megapixels camera!DO NOT BUY ITTTTT!!!!!!!", "Date": "February 16, 2012"}, {"Title": "Power button does not always work", "Author": "millerbw", "ReviewID": "R39ZM3A2OT5YI3", "Overall": "2.0", "Content": "This camera on first use outside would not power up or turn on. We had to uninstall the battery, each time the power switch would not work properly, in order to get the camera to turn on.", "Date": "December 12, 2011"}, {"Title": "this dead all the time", "Author": "bolinchen", "ReviewID": "R3NF9M3TVGZPEO", "Overall": "1.0", "Content": "after i bought this, and after a long time no use. resently i use it, and find it can not work well, all ways dead.so, when i want to take some picture, i have to use another camera", "Date": "November 5, 2011"}, {"Title": "Won't turn on, hard to share pictures", "Author": "R. Slomovitz \"qlfan1979\"", "ReviewID": "R9NPAP5MDYKRN", "Overall": "1.0", "Content": "I got this camera on clearance and paid $40- and thankfully that's all I paid for it... It's the worst camera I have ever had. It won't turn on half the time, the thinness of the camera makes it fall over if you breathe too hard, and the picture quality is not good. I kept the camera because I now use the itsy bitsy teeny memory card in my cellphone, thinking I could just put it back into the camera to load on my computer- but it won't even do it now. I've only had the camera 5 or 6 months max. I would probably get any other camera out there than this one.", "Date": "July 20, 2011"}, {"Title": "A Camera That Refuses to be Turned on", "Author": "Y. Zhu", "ReviewID": "R2E4C9HVQN567N", "Overall": "1.0", "Content": "I bought this camera for a birthday gift. But it never works as it is supposed to do, i.e., taking pictures. It absolutely refuses to be turned on. It is my third Kodak digital camera and it may well be my last Kodak product!My first Kodak camera costed my over $400 and it last slightly over one year. Then suddenly a black strip appeared in the middle of my len and the camera is useless. Last year I bought another Kodak camera after I fotgot the pains I had with my first Kodak. It actually works well for its price. So I decided to buy M590 to give it as present. But weeks late I learnt of the problem.", "Date": "July 1, 2011"}, {"Title": "Excelente", "Author": "Johnny", "ReviewID": "RO2YYO3X94S0P", "Overall": "4.0", "Content": "El articulo fue entregado en la fecha prevista. La camara funciona perfectamente, aunque se toma mucho tiempo entre tomar una foto y la proxima. La recomiendo.", "Date": "April 21, 2011"}, {"Title": "Don't buy it", "Author": "Maximus", "ReviewID": "R10KUQG3325GU3", "Overall": "1.0", "Content": "Cheap in quality... Could not get battery door closed and when I did the camera would not charge at all.  Returned it back for refund.", "Date": "December 31, 2010"}, {"Title": "Not what I was expecting", "Author": "Debra Tischler", "ReviewID": "ROAARCLPQ9APK", "Overall": "3.0", "Content": "The power button is very exposed and it turns on when left in your purse or pocket or just by picking it up. It isnt compatible with the ipad so I cant directly download to it. And I was not aware how the easyshare button worked, but it was nothing like what i expected.", "Date": "November 19, 2010"}, {"Title": "Disappointing kodak product", "Author": "Julie", "ReviewID": "R17I45QFIGYZBA", "Overall": "1.0", "Content": "I use only kodak for my business. I bought this camera to replace another point and shoot camera. I got this is and was disappointed at the the feel and look of it. After a month of using it, I am very very very disappointed and will be sending it back to kodak. Normally I give Kodak 5 stars, but this product get no stars from me. Very disappointed!!", "Date": "December 27, 2010"}, {"Title": "Disappointing", "Author": "Samuel H Patterson", "ReviewID": "R24M8V2KCSI71S", "Overall": "2.0", "Content": "Easy Share only works with limited OS's. I guess I did not read the fine print close enough.", "Date": "October 16, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14 megapixels for high-quality pictures\nOne-button upload to e-mail, Kodak Gallery, YouTube, Facebook, ORKUT, and FLICKR sites\nKodak’s Smart Capture feature\nKodak’s Face Recognition feature\n5X optical zoom with image stabilization", "Name": "Kodak EasyShare M590 14 MP Digital Camera with 5x Optical Zoom and 2.7-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/418VUWHG4SL._SY300_.jpg", "ProductID": "B003VTZE4E"}}