{"Reviews": [{"Title": "Great little camera", "Author": "M. Levy \"mgl02178\"", "ReviewID": "R378RS63MZOVN7", "Overall": "5.0", "Content": "Bought it as an addition to my much bigger Sony camera. This Lumix is small but full of features. Ready to shoot in an instant, just slide down the lens protecting door and push the shutter button. Auto setting takes great pictures every time. Takes great movies too, but the zoom does not work in movie mode - small inconvenience. Very intuitive functions, easy to learn. Love it, it's always in my pocket!", "Date": "April 19, 2010"}, {"Title": "Most fun digital I've had yet", "Author": "Joanna Cross", "ReviewID": "R39IB063GF3P2N", "Overall": "5.0", "Content": "I bought this camera after getting frustrated with a recent purchase I made of another digital camera.  Its pictures were almost always fuzzy and out of focus.  It was difficult to figure out how to navigate the menu and the response time was very slow.  After spending several days looking, I saw a TV advertisement for the Lumix.  I checked with my son (who has to approve all things electronic or digital)who thought it was a great product.Since buying the camera I have taken pictures in high and low light, indoors and out.  I have photographed landscapes, group photos, wildlife, and others.  The menu is easy to understand and navigate and the picture quality is good.  I am very happy with my purchase.", "Date": "May 11, 2010"}, {"Title": "Fantastic little camera!", "Author": "Mark C. Merrill", "ReviewID": "RZCWBJTEZGQMJ", "Overall": "5.0", "Content": "This is a fantastic little camera. The pictures are absolutely crystal clear. It is quick to use, just slide the cover open and shoot, the battery lasts for a long time and charges fairly quickly. If you are looking for a great pocket camera, this is it. besure to get a memory card for it as  the internal memory doesn't hold much, but cards are cheap.", "Date": "May 7, 2010"}, {"Title": "So far so good", "Author": "Eileen_KM", "ReviewID": "R1VHCLAXTMIR5L", "Overall": "4.0", "Content": "Overall, a great camera.  Picture quality is much much better than past Nikon S230 & an underwater olympus point & shoot.  This is what was most important to me.I will say that the touchscreen features are good but not great.  Also the camera is a little thicker than anticipated.  Finally I noticed w/ the video function that I'm unable to zoom in & out, it just stays @ one focal point!  Unless there's another way, this is a HUGE negative!But again, overall, I'm quite happy with it.  It's become my primary camera.", "Date": "April 28, 2010"}, {"Title": "Eh.", "Author": "Linda Weitzman", "ReviewID": "R3JDN31YUWRCA6", "Overall": "3.0", "Content": "I'm feeling a bit confused after reading so many glowing reviews of this camera when I've had it for over 6 months and have been very disappointed with it.  Probably 1 of every dozen or so photos I take, turns out blurry for no reason I can find.  Its zoom is unimpressive, and its ability to take close-up shots is shoddy at best.  Also, contrary to a few reviews I've read on Amazon, I've found that it takes very poor quality photos in low light:  Either the detail can't be seen for the darkness, or everything is blurred.  The image captured is much, much darker than what I actually see around me while taking a photo.  It also performs quite poorly for motion or action shots.That said, there are some good features on this camera.  The lens cover that turns the camera on or off is very convenient and protects the lens.  The HD video quality is excellent, but you can't zoom in or out while shooting and the video format is automatically saved in QuickTime, which is a bit of a minor con for me personally, but may not be so for everyone.  It is a touch screen, which is great, and it has a quick-menu option so you can change certain features without having to scroll through every possible option.If you just want a basic point-and-shoot camera and don't need a high zoom quality or clarity in low-light or moving scenes, then you can pretty much disregard my negatives.  This camera takes wonderful still shots *almost* every time.  However, if you want to get the most out of every feature on a digital camera, you should definitely look elsewhere.  I am trading this in for a Canon; I never should have strayed from their line.", "Date": "November 26, 2010"}, {"Title": "Love this camera!", "Author": "Ellen \"I'm a bibliophile since early childhoo...", "ReviewID": "R22S2SXJSMS28", "Overall": "5.0", "Content": "I'm still figuring out the details, but I'm in love with this camera. It's so tiny and has a 14 mega pixel  setting. I really can carry it anywhere. Just adore it.You can't use a camera you don't have with you. Just fabulous.", "Date": "July 1, 2010"}, {"Title": "Could be better", "Author": "Linda", "ReviewID": "R32LK5H107DKTY", "Overall": "2.0", "Content": "I have owned this camera for about 6 months now. The only reason we got it was because it was on sale, and honestly, I wish we would have waited and done more research.Here's why:1) The biggest annoyance is that the lack of options to manually configure the camera the way you want it. I'm somewhat familiar with tweaking the ISO, aperature and shutter speeds to make photos look more natural, but it doesn't appear this camera has any means for you to adjust all of those manually. I've looked all through the menus several times, and all I can find is ISO and exposure. The instruction manual is no help. The English part of the manual is only about 25-30 pages long, with most of the pages wasted on stuff like \"how to set the clock\" or \"how to charge the battery.\" It only has instructions on how to take photos in \"intelligent auto\" (as if anyone would need instructions on how to press a button) IT DOES NOT EXPLAIN ANY OF THE MANUAL ADJUSTMENT OPTIONS OR SCENE MODES, so you are pretty much left to experiment with it on your own if the auto mode isn't working out for you.2) This camera is not good with indoor shots. In darker settings, photos appear grainy if you turn off the flash, and washed out if you leave it on. I have had to go back and manually fix photos to take out red-eye, even with the anti-redeye option turned on.3) The camera doesn't always automatically detect close-up objects in \"intelligent auto\" mode, or may focus on further objects while blurring out the closer ones that you want to be in focus. I could fix that if I could manually adjust the aperature, but of course, I can't do that because I don't know where the option is if there is one.4) This camera is not very good at detecting motion and adjusting the shutter speed accordingly. You end up with a lot of blurry photos if your subject is moving. The \"sports\" mode does surprisingly worse than just leaving it on intelligent auto.5) Most of the scene modes are terrible. There was a \"baby\" scene mode, and I set the camera to that thinking it would actually be good to take pictures of our baby (you would think). But the shutter speed on this setting is very slow, and as infants tend to move around a lot, most of the pictures turned out hopelessly blurry, and I had to delete some really good shots (sadly, including some of our baby's \"firsts\"). And the worst part, is that I couldn't really tell they were blurry until I loaded them onto the computer and looked at the photos full size. By then, I had been shooting with that scene mode for over a month.6) The USB cable does not charge the camera. The only way to charge the battery is to take it OUT of the camera and put it in the battery charger. This doesn't work out for us well because we bought this camera to take pictures of our new baby. Whenever he's doing something I want to take a picture of, it's not just a simple matter of grabing the camera and unplugging a charger real quick . I have to get the camera, put the battery in, slide the tab in place, and then close the door to the battery compartment and slide another tab to lock it. And by the time I am done doing all this, I have usually missed what I wanted to take a picture of.Anyways, this camera is great if you plan on taking pictures outdoors of subject capable of holding still while you take the shot. If you don't want a basic \"camera-for-dummies\" that can't manage complex subject matter well, I would look elsewhere.I reccommend the Canon PowerShot S90, instead. We got it after reading an article in PC Magazine ([...]). It's far more flexible than the Panasonic Lumix FP3, and we have been very happy with it.", "Date": "November 28, 2010"}, {"Title": "Couldnt have been happier", "Author": "J. Neef", "ReviewID": "R28WRMG8REZ32H", "Overall": "5.0", "Content": "This camera is amazing. I bought it for my girlfriend who is a technophobe and she took to it like a duck to water. The touch screen is very handy and is very intuative. There is a setting screen where you can litterally select from 30 differnt lighting conditions from \"candle lit diner\" to \"outdoor action shot\" and it makes every adjustment you would need to take an amazing photo. The only thing I would say is for the most part leave it in the auto adjustment because if you have the wrong \" custom setting\" the photos need some adjusting.The camera is just great. From the way it turns on to the battery life as well as the way that is set up. When you wanna use it just open the lense cover and that turns it on and off. So its only on when you are useing it. This is a great battery saver and we took several hundred photos for several days and as long as we charged the battery over night we never had an issue. I have recomended it too all my friends and will continue to sing its prasies.Do yourself a favor though and order a 16gig memory card with it as the photos are very detailed and large file sizesORDER IT AND LOVE IT", "Date": "September 20, 2010"}, {"Title": "Great Video - Worst Still Pics I Have Ever Seen!", "Author": "Ed Osworth \"The Joy Professor\"", "ReviewID": "RKEMKBHYWIYB9", "Overall": "2.0", "Content": "I feel like I bought a different camera than most of these reviews talk about - because this one really sucks!After reading all the great reviews I bought this and was totally disappointed. I passed on the Nikon FinePix because it didn't have an HD Video mode which this does. Took dozens of test stills and videos and was amazed at the beautiful clear HD videos it takes.And flabergasted at how consistently BAD the still photos are - no matter the settings.Im low light a horrible yellow tint saturates everything -  in medium light the pics all look dark.And focus is all over the chart - about 1 out of 3 photos came out in focus. most are totally out of focus - even in daylight...In my opinion - and this is my 10th digital camera - EPIC FAIL", "Date": "December 29, 2010"}, {"Title": "Great Compact Camera", "Author": "Mayakah Hunter", "ReviewID": "R30NGGSLMUUGSC", "Overall": "5.0", "Content": "I love this camera.  It is easy to use and very compact.  I wish the video portion could record more than 8 minutes at a time.  This is with an 8 gig memory card.  But if I want serious video I will have to get a video recorder.", "Date": "September 2, 2010"}, {"Title": "Great Little Camera!", "Author": "Linda W. Howard \"LinderBeth\"", "ReviewID": "R29G9ITXETAY7R", "Overall": "5.0", "Content": "This is the \"little camera that could.\"  You won't be hesitate to take it along ... it slides into a shirt pocket.  The picture quality is excellent and it's pretty simple to use.  The video is a great feature, too.  I encourage you to buy this little gem ... you won't be sorry.", "Date": "October 31, 2010"}, {"Title": "Memory card", "Author": "LaVonne Hauwiller", "ReviewID": "RYK4L3LOQ2E76", "Overall": "4.0", "Content": "I did not get a memory card with this camera. Wasn't I supposed to?How many pictures does it store with the internal memory?", "Date": "January 24, 2013"}, {"Title": "Great Panasonic product.", "Author": "Keems", "ReviewID": "R36VYUPDRD905H", "Overall": "5.0", "Content": "I bought this camera for my sister as a gift (shes 13) and she loved it. Simple, cute, and quality.", "Date": "April 21, 2011"}, {"Title": "Returned it", "Author": "Liset Alfonso \"Liset Twoboys\"", "ReviewID": "R3IA4S4RZ5QJEC", "Overall": "2.0", "Content": "Great looking camera, small and sleek. But I was so dissapointed with the pictures that had to return it. Indoors pictures, forget about it, blurry, fuzzy and weird colors, outdoor pictures ok, as long and they they are taken while on daylight. As much as I loved it looks I returned it and got a Sony, and what a difference.!!!", "Date": "January 5, 2011"}, {"Title": "Fell apart after 6 months", "Author": "rjb", "ReviewID": "R25EYPVNTLLGL4", "Overall": "1.0", "Content": "The hinge to access the battery and SD card broke after 6 months.On top of that, it started insisting the SD card is write protected.After swapping back and forth between a couple of SD cards to verifythey weren't write protected, the camera is now not releasing the card.-Dick", "Date": "December 17, 2010"}, {"Title": "I love it - with a caveat", "Author": "Lee Newland", "ReviewID": "REB80IFJ1PM6I", "Overall": "4.0", "Content": "I've been looking for a compact point & shoot camera for about 6 months. I did a lot of looking, reading and searching - which made me pretty sure about what I wanted. A small camera I could carry in my purse or hand, easy controls, sharp images, zoom and image stabilization. This has all the right attributes. I'm very, very pleased with it. It doesn't have all the whistles and bells, but it exactly suits my purposes (memories, not art).Addendum 06/23/2011. I still love the camera, but there is a major problem with it. The little door on the bottom which gives access to the battery and memory card broke at the hinge. I have never treated the camera roughly or been careless when opening it up. When I called Panasonic I was told that that was not covered under the warranty. They could fix it, but it would cost more than $50. I was not a happy camper.", "Date": "September 17, 2010"}, {"Title": "Canon 780IS is better", "Author": "Kenneth A. Attorri", "ReviewID": "R1XSKWSP3RV9VW", "Overall": "3.0", "Content": "I own both a Canon 780IS and a Panasonic Lumix DMC-FP3.Lumix Pro's: photo quality; intuitive controls; clean retro rectangular design; touch screen commandsLumix Con's: video quality clearly inferior to Canon 780IS; rectangular shape is retro cool but not ergonomic in the hand --- I found myself accidentally pressing buttons, covering the microphone hole, or with a finger on the edge of the photo, or fearing it would slip from my handI prefer the Canon 780IS.", "Date": "September 6, 2010"}, {"Title": "I picked a good one.", "Author": "John Frantz \"Go Away!\"", "ReviewID": "R8PW33XY738SS", "Overall": "4.0", "Content": "We've used this camera several times at this point.  So far so good.The only reason it hasn't gotten all 5 stars, is that I haven't figured out, or read the instructions, for all of the features yet.  Yes, I know that is my fault.Seems to be very easy to use, and takes good, clear pictures.  Consumer Reports also rated this camera highly and a good value for the cost.And I'm a complete amateur when it comes to picture taking.", "Date": "August 15, 2010"}], "ProductInfo": {"Price": "$182.16", "Features": "14.1-megapixel effective recording\n4X optical zoom (4X digital zoom/16X total zoom)\nHD movie recording (1280 x 720 pixels at 30 frames per second)\n3\" touchscreen LCD\nUltra slim compact camera made of high-quality aluminum", "Name": "Panasonic Lumix DMC-FP3 14.1 MP Digital Camera with 4x Optical Image Stabilized Zoom and 3.0-Inch Touch-Screen LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/410xNh736KL._SY300_.jpg", "ProductID": "B003962ED8"}}