{"Reviews": [{"Title": "excellent P&S; memory card is MICRO SD, not SD!", "Author": "GMGB", "ReviewID": "R2N0OO21DONRJ", "Overall": "5.0", "Content": "NOTE: Do not buy this camera bundled with an SD card.  The card supported is micro SD.  We had no problems using an 8GB microSD card with this camera.Pro's:- excellent image quality- fast- decent flash- awesome video's- dual IS is great for low light without flash- 5x optical zoom- zooming all the way out gives a good wide angle shotCon's:- battery drain with dual IS because of post processing- takes a bit getting used to switching between modes", "Date": "May 19, 2010"}, {"Title": "Samsung TL110 Digital Camera", "Author": "TechVoodoo", "ReviewID": "R198UM8USMKV", "Overall": "5.0", "Content": "Compact, sleek n slim, attractive design, good picture and video quality, user friendly, fully loaded and of course, the price tag is under 150 bucks? What else do you want?It's 14.2 Megapix, plus 5X optical zoom which is above the standard for its class.I've been using this camera for 6 months and I've not found any problem yet.I am thinking of buying another one since my girlfriend has already put it in her purse. There's another new model just came out ( The Samsung TL240 ) which has more features and it's sold around $200 but it's not as compact as this one. So, go grab one before it's discontinued. It's onsale now around $120 somewhere on the internet but I think Amazon.com always has a best price.Btw, I found just one problem which I just laugh about it since it's not a big deal to me. It's clearly a huge mistake from Samsung about the SD/SDHC memory card supported, it's not compatible. This little camera only uses microSD card. Technically, it's all about space saver and compact but the microSD is expensive and it's not handy cause its size. Again, this is not a big deal breaker for me since I download the file straight out from the camera without taking out the memory card. Well, if you're a big fan of microSD then this is a must have!The battery life is good enough if you got it fully charged. It takes about 2 hours charging from AC adapter, you can charge it using the USB port on your computer too but it's not efficient.I don't think people would be ready to aim for the HD movie from the digtal camera because this only captures up to 720p in mp4 playback. Beside, if you record the video in the 720p mode, you would need at least 8GB of memory so you can record for more than 30mins. The video playback is good, clear picture and sound. The night mode is cool too.Overall, this is the best compact camera out there in its class. I would give it 4.5 star rating because of the memory card supported but I think the cons is not a big deal for me and it would be a pros for someone else so 5 stars for this little bad boy. Happy shooting!", "Date": "September 10, 2010"}, {"Title": "Great Camera for the price; versatile, compact.", "Author": "Joe \"Joe\"", "ReviewID": "R9INV5CS3X2M8", "Overall": "5.0", "Content": "Time we've owned this product:  1 week.Review: Excellent.Ups: Compact, small, and easy to use. Seems to take excellent pictures in all conditions with \"SmartAuto\" mode. Also a program mode available with plenty of adjustment options. MicroSD card sold separately, but not a big deal. It cost us $20.00 for a 4GB microSD card at Target.Downs: Users manual requires a computer to read/download.  That's about it. So far so good.I would recommend this for anyone who needs a simple but capable digital camera.  Great buy.", "Date": "June 20, 2010"}, {"Title": "Has a serious internal dust problem", "Author": "Old Radio Guy", "ReviewID": "R2BKZPHW20FFZ", "Overall": "2.0", "Content": "UPDATE: Since I wrote this review, I've had to return 2 of these. The fit between the lens barrels is loose enough to let dust and lint into the camera, where it settles right on the sensor (the sensor is soldered flat to the circuit board, instead of being raised slightly). My pictures look like thay have bacteria or mold on them. I used to photoshop them, but now there's just too much dust, and that doesn't work with video anyway. A couple other models, including some Canons, supposedly do this. I read that the HZ30W also does this, so maybe it's poor design on Samsung's part. I watched it suck in a piece of lint as the lens closed the other day, and I got most of that out, but blowing air into the camera has not worked - it only moves the dust around. I would buy something else if I had the chance. What good is a pocket camera that you can't put in your pocket unless you keep it in a plastic bag?This is the perfect camera for a guy who wants to take something to a ballgame, but doesn't want to carry around a brick, like a DSLR or a larger P&S.; Slips into a tight jeans pocket and you almost forget you have it because it's only as thick as a Blackberry Curve. The brushed stainless steel case takes a beating in your pocket, and it only comes in masculine colors: Silver, black, and orange. No baby blue, or pink. The case is slippery, so use a lanyard. This takes MUCH better than average 1280 x 720 HD video, and it does so in dark settings, like an auditorium (your kid's play, science fair awards, etc). It's not \"full\" HD (1080p) but it's remarkably close. IMPORTANT: This camera zooms optically while you are recording video, and the lens drive motor is real quiet. You might hear a tiny bit of a buzz in the background as you zoom in and out during a school play or a wedding, but at a football or soccer game, you'll never hear it. You CAN mute the audio while zooming, but losing the audio while zooming is 10 times more annoying than any camera's lens motor noise. Sitting at a soccer or football game at or near the 50-yard line, the 5X optical zoom frames the goal posts nicely on either side of the screen. That's about all you can ask for. It has digital and lens Image Stabilization, but there's only so much you can do to prevent shake in a camera that's the size of a pack of smokes, and half as thick. So the 5X zoom is just about right. BTW, you can pause the video during playback and capture any frame as a still picture. The resulting picture isn't bad.Outdoor picture quality actually beats my old Canon A630, and that camera has held off all challengers up to 14 mp for the past 3 years. I'm a civil engineer, and I use this on the job all the time, and it takes a serious beating and still works perfectly. HD videos shot through the windshield of a moving car are clear enough on playback to read small lettering on road signs, and also on the license plates of passing cars.Indoor photos aren't quite as good unless you \"tweak\" some settings, like the pixel density. I've found that 10 and 12 mp often beats the full 14.1 setting. My daughter's Canon SD1300is takes noticeably better indoor flash photos, but the video on this Samsung shames the Canon. Like any pocket camera, you have to play with the settings to get the best results.This has some great \"effects\" settings (13 in all). The \"sunset\" mode can turn a mediocre sunset into a Windows background-quality shot, and so can dawn. \"Children\" is good for forcing a fast shutter speed.The storage media is a microSD, which is inconvenient if you're the type who likes to stick your card into a smart card reader. But the special USB cable that plugs into the camera works just fine, and you just drop & drag with Windows Explorer. Messing with your card just wears out the contacts anyway.Since I bought this (I bought mine as factory \"re-certified\"), two co-workers have bought one.", "Date": "January 13, 2011"}, {"Title": "Highly Recommended", "Author": "Glenn", "ReviewID": "RSU3FIKF7Q82T", "Overall": "5.0", "Content": "Wow this camera is something else for the price it takes great pictures and HD video. In video mode you can use the zoom (this is a plus I looked at many other cameras not capable of doing this) the camera is real easy to use and has nice features. I recommend using a Micro SDHC 8gig class 4 or higher card.", "Date": "August 23, 2010"}, {"Title": "Samsung TL110: Good camera overall", "Author": "Coco", "ReviewID": "R3PKAX4J9Z7ZDA", "Overall": "4.0", "Content": "I needed a compact camera to take with me to night clubs and events, at which I can snapshop pictures of myself, of the moving lights, and of the djs quickly to capture the moment.This camera was slim, hence perfect for carrying around and had a good zoom lens compared to its thinness. It was also in my price range.But it had this lagging problem when I use the smart mode. The smart mode is an auto lens mode, and therefore the lens takes time to automatically adjust.It took at least 3 seconds each time before I could take another photo.When you're out and trying to take pictures and everybody's waiting on you, 3 seconds after each picture is a long time.However, you can take pictures with the smart mode off and you won't encounter that lens lag.You'll just have to play around with the aperture and other settings such as lighting to take the pictures you want if you're not using the smart mode.I've taken some awesome pictures.Make sure to take multiple photos with different settings if you want the best result.This camera does have photo editing feature right on the camera, with which you can crop, invert the color, use fish eye, etc on the pictures.This is really not necessary though since it's easier to edit your photo on your computer on a bigger screen than on a small lcd screen.The memory card used is the small micro SD card also used in mobile phones these days, not the bigger SD card.", "Date": "May 24, 2011"}, {"Title": "Nice compact camera", "Author": "foxymc", "ReviewID": "R2OAVDNOVPJWK8", "Overall": "3.0", "Content": "This camera is not great but not terrible either. It does the job with good quality pics and the battery lasts long. I like that it has 14 megapixels and how compact it is. I also like that you can crop pictures right on the camera. I love that the plug can be detached and used as a USB cable to upload your pics into computer.I only really use the Smart Auto mode. The Twilight mode comes out blurry almost all the time. Also, it takes a while to switch from camera mode to viewing the photos (atleast 5 secs) which I've never encountered with my old Canon or Sony digital cams. Overall though, I think it's worth the price.", "Date": "January 21, 2011"}, {"Title": "excellant camera", "Author": "john", "ReviewID": "R1OKMTEBJ1AIYT", "Overall": "5.0", "Content": "This is my 5th camera that i have bought from this site, i love it a lot, i give them as christmas gifts, everyone loves them", "Date": "March 28, 2013"}, {"Title": "Nice pictures but frustratingly slow", "Author": "spalaw", "ReviewID": "R2FTTYWJ3V1RIX", "Overall": "3.0", "Content": "I have had this camera for a while.  I purchased it because I wanted a small pocket size camera that is easy to carry around.  It takes nice pictures, but I am now looking for another compact camera for one primary reason - the lag time on this camera is frustrating.  Especially when using the flash, there is an unacceptable lag time that this camera takes to snap the picture.  Sometimes I actually think maybe I didn't push the button and then it finally takes the picture.  I can't say I have played around with the camera long enough to know for sure that there are not more optimal settings, but this occurs in the smart mode or my own programmed mode.  Sometimes I think the issue may be partly a problem with the battery power because it seems to perform better just after a full charge.I am also rarely happy with the low-light pictures.I love the size of this camera and it takes nice pictures most of the time, but I am moving on to something else.", "Date": "February 20, 2013"}, {"Title": "Nonstandard Proprietary Connector", "Author": "BigBen&Parliament", "ReviewID": "RNQ0MS553UTWT", "Overall": "2.0", "Content": "This uses a funky cord to charge the camera and connect to the computer.  It should have been micro-USB like the rest of the electronics world...except Apple.  It doesn't use standard batteries either.  We don't use it much anymore because these reasons and the proliferation of phone cameras.", "Date": "June 23, 2012"}, {"Title": "Would've gotten five stars but...", "Author": "Jess", "ReviewID": "R2R9QQBZ6N03AW", "Overall": "4.0", "Content": "This camera is the perfect camera for people who just like to take good quality pictures and video. I only paid 100 bucks and I've had it for about 4 months. These are what I think the pros and cons are.Pros:-5x Zoom-Different scene modes-Very durable- dropped it about 5 times and it's still going strong-Very cute/clean exterior-Perfect sized lcd screen-Great quality pictures-smart autoCons:-During video mode, when you zoom in or out, the sound mutes for that millisecond. Can be annoying-Turning off the flash gives you a very naturally toned picture that the flash won't. However, you can't take action shots with the flash off. It'll blur beyond belief.-smart auto gets it right most times but other times it blurs pictures, so look out for that.Overall this is the best camera I've owned. The cons are so small they can be overlooked. I've had two Sanyo cameras before this. The first was great(can't remember the make) but they don't make it anymore. My brother smashed my lens so I got the newer Sanyo camera which was the worst camera ever. To top it off I dropped it once and it was done. Waste of $75.", "Date": "April 29, 2012"}, {"Title": "Better than expected", "Author": "Cloud", "ReviewID": "R22MB13EZFO94O", "Overall": "5.0", "Content": "Overall I very happy with this purchase. It has many features for a point and shoot camera. It's much smaller than I expected, which is a plus and it takes great pictures.", "Date": "March 12, 2012"}, {"Title": "Easy to carry and use and takes great pictures.", "Author": "GMC", "ReviewID": "R16F0RUHOVDCUX", "Overall": "5.0", "Content": "This camera is so slim compared to others I've owned. This one takes great pictures and I get good battery life. The zoom lens works well and with a high capacity memory card you can take pictures for weeks before having to unload them to your computer. I really like this camera.", "Date": "March 2, 2012"}, {"Title": "worth the money", "Author": "michelle", "ReviewID": "R3BTM6TDS9QR2I", "Overall": "5.0", "Content": "this camera is excellent. the fact that it needs a micro sd card was no problem for me. i bought an 8gb card at walmart for $20. it takes excellent pictures and you can edit your pics in the camera if you want. the cord that comes with the camera is also the usb cord for your computer (even though it doesnt tell you that). theres also software built in the camera that loads into your computer to photo edit but i actually prefer picasa. also on the camera when you go into the modes it tells you on the camera what everything is so you dont have to look at the manual, which is actually on the cd that comes with it. you can get other cameras for a lot bigger prices but this camera is actually as good as higher priced cameras.it has a lot of percs with a cheaper price., i am huge on reading reviews and i based getting this camera on the reviews i read. it took me several days to decide. i like amazon for reviews because it has everything. it also takes excellent quality video.", "Date": "December 25, 2010"}, {"Title": "Amazing Camera", "Author": "Uniqueteen \"Nelle S\"", "ReviewID": "R1BRN9G0P9T6EQ", "Overall": "5.0", "Content": "Definitely worth it. Its an affordable camera that packs a whole lot of punch. The features are great and plentiful and the pictures are professional quality. For a point and shoot this is the way to go. This is way better than my old Kodak.", "Date": "August 2, 2010"}, {"Title": "Samsung Digital Camera", "Author": "Elizabeth Hall", "ReviewID": "R2FNBD6CY77R7F", "Overall": "5.0", "Content": "Fast delivery and the product was brand new as stated in description. zero problems; good seller.", "Date": "July 11, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "27mm wide angle lens\n5x optical zoom\nDual Image Stabilization\n720p HD quality video", "Name": "Samsung TL110 14 Megapixel Digital Camera with 5x Optical Zoom, 27mm Wide Angle Lens, Digital Image Stabilization, HD Movies, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51NpEvChnsL._SY300_.jpg", "ProductID": "B0036R85RO"}}