{"Reviews": [{"Title": "Not the greatest, but not the worse", "Author": "bena", "ReviewID": "R2NYJW1M07L4QU", "Overall": "3.0", "Content": "I just bought mine from target along with a 2G SD card all for under $100. My biggest concern when buying a camera was the zoom. It has 3x optical and 5x digital, but it seems like I should get a lot closer. The main reason why I rated it three instead of one or two was because it's still WAY better than my cellphone. I've had experience with other kinds of cameras, but they're really expensive and I really wanted something everyday that I could carry around with me. It's really light and I love the strap that comes with it. I also like how it has different settings for what kinds of batteries you might use. I didn't realize it that it was set on alkaline and it drained my batteries right up. Still, it's a pretty decent camera if you're looking for some more on the go and less professional. I've taken pretty darn good pictures on my cellphone with barely 2MP this is definitely trading up to something better.", "Date": "May 3, 2011"}, {"Title": "Worked for only 5 minutes", "Author": "abakul", "ReviewID": "R1BEEJIKJQGTBK", "Overall": "1.0", "Content": "The camera worked for only 2 brief sessions. It was used twice for a total of a dozen pictures. Now it won't turn on. I'm using new batteries. The camera has never been dropped, never been outside, never near sand or grit, never near water. Too bad Poraroid didn't test it for so much as 5 minutes before they shoveled this piece of extrement into the market. They got my money this time, but never again.", "Date": "November 11, 2012"}, {"Title": "Cheap quality", "Author": "Bradley Peterson", "ReviewID": "R48FOYGLXJQCZ", "Overall": "1.0", "Content": "We owned the camera for less than a month.  Today it slipped out of my hand and landed on my shoe.  That was enough to internally break the camera.  The lens now shifts inside loosely, only a portion of the lens now can see out (the rest of the photo is black), and the camera beeps when it turns off because it jams when it tries to retract the lens.  This thing is cheaply built.  It's value is no better than that of a disposable camera.", "Date": "September 13, 2011"}, {"Title": "It works great for a minute...", "Author": "E K Maxmias \"Frighteningly Real\"", "ReviewID": "R2JT1V3LEBM08L", "Overall": "1.0", "Content": "...then it doesn't work at all.  Apparently, if you breathe too hard on this camera it turns into a digital picture viewer.  Just the slightest bump and the lens will no longer retract and the camera is finished taking pictures-forever!  I won't go on about all the features this camera has (which are plenty) because to talk about the features of something that stopped working after a month is pointless.  Save your money and buy a real camera from a good company like Canon, Olympus or Nikon.  Polaroid has become pointless since instance pictures went the way of the dinosaurs.  STAY AWAY FROM THIS CAMERA!", "Date": "August 12, 2011"}, {"Title": "Not Reliable Model", "Author": "Bryan", "ReviewID": "R3JSFJEMDHO9JZ", "Overall": "1.0", "Content": "I recently bought this model of Polaroid for my daughter and it broke almost immediately. After searching online, it is a common malfunction. When I contacted Polaroid they said it would be under warranty for a year and had me go buy special batteries and try other stuff. When none of that worked they denied my warranty. I wont be trusting Polaroid for digital cameras or I will at least review the model THOROUGHLY online before purchasing.", "Date": "March 18, 2011"}, {"Title": "Great Stuff!", "Author": "Cassandra Beard", "ReviewID": "R1UU5DJ1FPD5JR", "Overall": "5.0", "Content": "The camera is fantastic. The screen is clear and there are many functions I was surprised to find on a camera this size and price. I am very satisfied with this project and plan on buying another as a gift at Christmas.", "Date": "October 20, 2012"}, {"Title": "OK quality...if it doesn't break", "Author": "mikthefish", "ReviewID": "RXB3GHIVLWB76", "Overall": "2.0", "Content": "Got this camera for my 7-year-old daughter. She was able to use the controls easily, so this model would be good for someone who is not tech-savy. The pictures were decent compared to our 10MP Canon, but not significantly better. The USB socket is nonstandard, I am assuming so that if you lose the included cable, you would need to buy one from Polaroid. Battery life was decent.It was a very good camera for my daughter (especially because we got it in pink)...until it stopped working 7 months after we bought it. I don't know of any incident where it was abused or dropped. She was using it one day, then went to turn it off and it just jammed. Now the lens won't retract and when we turn on the power the camera shuts down instantly. Polaroid support website was no use (just marketing info) and help line was unhelpful.I did some online googling and found that the lens jamming is a common problem for this model. I've had other digital cameras last 4+ years, so I take this as a quality issue and will avoid Polaroid going forward.", "Date": "October 11, 2011"}, {"Title": "snappy", "Author": "xtreme_xeriscape", "ReviewID": "R89FAM33IYZPL", "Overall": "4.0", "Content": "good picture quality, camera's a little big for a pocket which was the goal, but works well on readily available batteries (AA)", "Date": "July 4, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Anti-shake stabilization\nFace tracking, smile and blink detection\nIn camera red-eye removal; Audio tag\n2.7-Inch LCD Display\n32MB built-in storage", "Name": "Polaroid CIA-1237SC 12MP CCD Digital Camera with 2.7-Inch LCD Display (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51lHtT%2BLHFL._SY300_.jpg", "ProductID": "B003B2ITG6"}}