{"Reviews": [{"Title": "keyless entry lock", "Author": "Thorough Customer \"Thorough Customer\"", "ReviewID": "R35SL33QFDKAWR", "Overall": "4.0", "Content": "As a previous owner of a morning industry lock I can attest this lock is very sturdy and works as indicated.  It is easy to install and the directions are straight forward.  The only reason I gave it 4 stars is because in previous versions of the lock a person would only have to turn the knob to exit (not entering).  In this new version you have to manually unlock it first in order for the lock to disengage and then turn the knob.  The company is aware of this and they call it a safety feature.  It is somewhat annoying to have to unlock the lock before exiting (NOT ENTERING) a doorway.  Other than that the lock is top knotch!The merchant shipped the product the same day and it arrived without any inconvenience.", "Date": "April 18, 2011"}, {"Title": "Keypad breaks 6 months after install", "Author": "Matt", "ReviewID": "R136K5WJHH0EQR", "Overall": "1.0", "Content": "This product was easy to install, just like all of the other reviews indicate.  I really like the feature where it auto locks after 10 seconds - makes sure my garage stays locked after everyone is coming and going (my garage is more of a man-cave than a garage).The reason I marked this as one start is simple, I have had 2 of these locks, and they BOTH started malfunctioning in the same way after the same time period.  The entire right column of keys stops working... which is really aggravating when you have a password that uses those numbers... it only took about 6 months of each to break in the same way, and Morning Industry warranty is applied, but you have to pay to ship it to them, AND add $10 for shipping back...I'd suggest another lock...", "Date": "September 9, 2011"}, {"Title": "Works perfectly", "Author": "Vincent P. Maffeo", "ReviewID": "RFT03M9H06W8Q", "Overall": "5.0", "Content": "I read the other reviews about the autolock, but its not an issue at all.  Works like most doors, where you open to go out and lock.  I believe that takes all of 1 second, so it's not a big deal for me.  Overall, my wife and I are very happy we purchased this product.", "Date": "August 26, 2011"}, {"Title": "Problems from the start", "Author": "Wild Woman", "ReviewID": "R4TBUPHW0E4NU", "Overall": "1.0", "Content": "This lock has not worked well since we bought it. I complained to the seller and he said I would have to call him to walk through troubleshooting it. It was a gift for my daughter who is disabled, with the idea it would be easier than using a key. The knob is too slippery to turn easily. It locks when it is not supposed to. Sometimes it won't unlock. Poor quality and poor response from manufacturer. And it was overpriced for the quality! Would not buy again. Wish I could return it.", "Date": "September 30, 2012"}, {"Title": "Design Flaws mean time to return this item", "Author": "L. Tavrow", "ReviewID": "R15ZQUAWS4S2T1", "Overall": "2.0", "Content": "I just purchased and installed this item.  The installation wasquite easy and the door knob works (sort of) correctly.  Itlooks great and everything about would be great except for twoseries design flaws:1. If you are inside and want to get out and the door is locked(i.e. the standard case), you have to unlock it first by turningthe unlock switch.  You can't just turn the knob like on a regulardoor knob.  I called customer support because this is such achoke and I assumed I did something wrong.  They said that thisfeature is called \"panic entry\" and \"they removed it on the HKKseries\"  However, they claimed that they are coming out with a newmodel in a few months that has it back -- at least they figuredout the it was necessary.2. There is a switch under the battery cover that lets thisgo into \"auto lock\" mode.  Without \"auto lock\", you have to relockthe door after you open it -- not what you expect or what happenson a normal lock.  In \"auto lock\", it relocks after about 10 seconds,which is OK.  However, then you can never keep the doorunlocked without unscrewing the battery cover and turning off\"auto lock\".  All you want is for the door to stay lockedbut let you open it once after entering the code.Needless to say, I am returning the unit to Amazon.", "Date": "November 11, 2010"}, {"Title": "Awesome lock!!!", "Author": "Rock \"Rock\"", "ReviewID": "RMRU5D355DGDX", "Overall": "5.0", "Content": "Got this lock for my bedroom door to keep my nosey 13 year old out while I'm at work. The instructions were very easy to follow and we had no problem installing the lock, but once installed, we found the bottom row of numbers were the only ones that worked... Bummer. We called the company and left a message, within 30 minutes, a gentlemen called us back and went over installation and troubleshooting. When it still seemed faulty, he had us email a receipt and sent out another keypad! We were shocked!! It came in 2 days and worked flawlessly! Very happy with the product and applaud their AWESOME customer service!!!", "Date": "June 19, 2012"}, {"Title": "Couple of design flaws", "Author": "user", "ReviewID": "R3FVZLH2LP9HDS", "Overall": "2.0", "Content": "Like other reviewers I notice 2 design flaws.  #1) You have to manually unlock the door before you can exit from the inside and #2) once you unlock the door before entering it stays unlocked until unless you re-lock it (this also goes for exiting....i.e., you have to unlock to exit but remember....you now have to re-lock after exiting or it stays unlocked.  Flaw #1 is just annoying and #2 is a safety risk as it would be easy to assume the door will remain locked like every other manual door knob works.  I had read this in other reviews but one review indicated that a certain model # did not have these \"safety\" features.  I tried to get that model # but it works just like the rest.  I wander what made them decide to \"reinvent\" the door knob.", "Date": "April 21, 2012"}, {"Title": "perfect", "Author": "Devin Meyers \"Mtdew fan\"", "ReviewID": "R2106AJ298C6VC", "Overall": "5.0", "Content": "This came with fetures I did not know about.  The greatest is the auto lock.  I have had this a while and I have people going in and out 10 to 12 times per day.  It is solid never locked me out.  I highly reccomend.Cons: None.", "Date": "February 17, 2011"}, {"Title": "Great", "Author": "Ava H. Coley", "ReviewID": "R3KRT8JB0D7QEU", "Overall": "5.0", "Content": "This was an excellent shopping experience.  I wish all my purchases could be made online with as little hassle as these. Great Shopping Experience.", "Date": "April 14, 2014"}, {"Title": "Good unit", "Author": "Judy L Scott", "ReviewID": "R1KKX9JNKGK6GA", "Overall": "5.0", "Content": "We now have three units and they are built well. Directions are good and installation is easy. We have only used these on the inside, not out side of the house.", "Date": "March 19, 2014"}, {"Title": "Great battery operated lock.", "Author": "Batnuni Bandit \"Spatsizi\"", "ReviewID": "RBTOD4HDPGJEE", "Overall": "5.0", "Content": "Great product. Tired of not having the keys with me when I get to the shop. Saves me time and makes it easy for the family to access the shop using their own numbers.", "Date": "November 19, 2013"}, {"Title": "Can't get wet", "Author": "dennismi37", "ReviewID": "R2TFSNMF6VDW90", "Overall": "1.0", "Content": "I bought this for an outside entry door and it worked great until the first time it rained and it got wet.  I called the company and they said it is not suppose to get wet, but I said it says that it is for an \"Entry Door\".  They charged me ten bucks for the replacement part that was suppose to fix it.  I installed it and the knob still does not work.  What a piece of junk.  It will probably work great if you were to use it where it won't get wet, but not for outside.", "Date": "October 11, 2013"}, {"Title": "LASTED 13 MONTHS", "Author": "E. Pecora", "ReviewID": "R1MY0QUZSNSPNC", "Overall": "1.0", "Content": "BOUGHT LOCK ON AUG 25TH, 2012 MIDDLE NUMBERS ON KEYPAD DO NOT WORK.  FOR THIS KIND OF MONEY EXPECTED MORE LIFE.BEWARE WARRANTY IS LIFETIME ON EXTERIOR FINISH, 25 YEARS ON MECHANICAL PARTS AND 1 YEAR ON ELECTRONIC PARTS. GUESS MORNINGSTAR NOWS WHICH PART IS POORLY MADE. ALSO, WEB SITE SUPPORT DOES NOT EXIST, STRANGE WEB SEARCH FOR LOCKSMITHS", "Date": "August 16, 2013"}, {"Title": "Works Very Well", "Author": "BP36WEST", "ReviewID": "R2DE1G5LNW4ZTA", "Overall": "5.0", "Content": "This had some bad reviews and I don't know why, I put it on my bedroom door and it keeps the nosey kids out. You can't beat the price either. Overall if your looking for a great keypad doorknob this is the one for you.", "Date": "July 31, 2013"}, {"Title": "The battery does not last long.", "Author": "Felipe", "ReviewID": "RXIWWZGWVQXFQ", "Overall": "3.0", "Content": "The battery does not last long, and the lock got stack during very cold wet days in the winter. Easy to install", "Date": "July 6, 2013"}, {"Title": "Bought two.", "Author": "ben5cc", "ReviewID": "RSESTLBHA3ET7", "Overall": "5.0", "Content": "Just what we needed.  Liked the first one so much we ordered a second one.  It looks nice on our doors and no more keys to worry about.", "Date": "March 4, 2013"}, {"Title": "Keeps the kids out of my office", "Author": "L. Morgens \"LPM\"", "ReviewID": "R2IBUMADBHH3G4", "Overall": "5.0", "Content": "For the money, this lock has been great in keeping my kids out of my office. Works well as indicated.", "Date": "February 4, 2013"}, {"Title": "i like it", "Author": "April", "ReviewID": "R2VRM3XVCXWIA2", "Overall": "5.0", "Content": "but the only down thing is that it doesnt light up in the dark so i have to feel the keys to see if i am pressiwng the right numbers. Other than that i love it, it works! Easy installing!", "Date": "November 28, 2012"}, {"Title": "Good concept poor product", "Author": "Trying to be honest", "ReviewID": "R153MMVQ7ME38R", "Overall": "1.0", "Content": "I think the concept of this product to be great. But this product needs some better quality to work. It stopped working after a month and I had to almost brake into my garage one day it stopped working. It made the sound like it worked but wouldn't open and the key didn't work with it either.", "Date": "September 10, 2012"}, {"Title": "Works as describe", "Author": "Sherlockhomey", "ReviewID": "RDT0HYOVEOCON", "Overall": "4.0", "Content": "I bought this lock for my warehouse door; it provided temporary codes for some of the temp workers. The lock is pretty easy to install and one of best function is the ease to program the code. Its simple 2 step process, you press the S then enter the code and unlock button! We had the other brand where you need a master code to do the programming and once the master code is compromised then we need to change a new lock. We have this lock on the door for about 2 month now and its holding up pretty well for 6/day useage!", "Date": "July 23, 2012"}, {"Title": "another new keypad lock for our closet door!", "Author": "victoryColumbus", "ReviewID": "R2KGXOPBRZ5EUD", "Overall": "5.0", "Content": "I am on my third locks purchase from Amazon, actually the 2nd from Amazon as the first one was purchase on other website. I am not a locksmith but have been fixing most of my house from DIY stores, its clear that there are two systems of lock sold in Home Center 1. the Schlage system where you can always open the door from inside without turning the thump turn, and 2. the Kwikset system where you always have to turn the thump turn to unlock the door to get out. I just want to leave a review here as there seem to be bad reviews resulted from the differences of the 2 systems. I personally prefer the Schlage system where you do not have to unlock the door to get out and since I have programmed the auto lock system on this knob lock, I can't never be lock out! Before I have this lock, I would be lock out of my Schlage lock once a while, so I always leave a extra key hidden outside.  One thing I would like to add to this lock is that the knob is different from the previous version, the old knob lock has a smaller knob but its solid brass and this new new version has a bigger knob. We have no problem with all three of our locks other then changing batteries every few months. The remote control lock with internet access seems to drain the batteries much faster then this keypad only lock. We are getting this lock due to new housemate and it serve as perfect solution to lock up some of the security item in my closet!", "Date": "July 23, 2012"}, {"Title": "Rubbish", "Author": "GordonF238", "ReviewID": "RFP7B6LHXUMM4", "Overall": "1.0", "Content": "DOA.  Tried two sets of batteries, not a sound.  Total rubbish, but then again, what would you expect from a bargain brand?", "Date": "June 27, 2012"}, {"Title": "Takes a little time to get use to!", "Author": "Tamie L. Marsh", "ReviewID": "R16SQ34KLAWLOR", "Overall": "4.0", "Content": "I bought this lock to go on my bedroom door; so I won't need to have another key.  It had to be modified a little bit to make it fit on my door but that was an easy fix with a wood chisel.  My problem is with the operation of unlocking the door with the code.  I will press my code and push unlock and it sometimes will make the noise like it unlocked but it didn't.  Sometimes it will take me 3 or 4 times to enter the code before it will unlock and sometimes I have to use the key.I haven't had it that long so it might be just me.  I am going to call their customer service line when I have a day off and troubleshoot this with them.All in all I like the product:  very well made.", "Date": "February 24, 2012"}, {"Title": "door knob", "Author": "pgeeds", "ReviewID": "R3OUWCW86B9CH0", "Overall": "5.0", "Content": "works great love it, purchased at a great price, arrived quickly and in great shape. Will continue to make purchases with Amazon.com", "Date": "September 13, 2011"}, {"Title": "I bought 2 locks so my wife didn't have to look for her keys!", "Author": "John", "ReviewID": "RIIGNF3OLFOED", "Overall": "2.0", "Content": "I installed locks on 2 outside doors. They were easy to install and easy to set the combinations. In less than a year one quit working. I called customer service and they said parts would be sent out soon. About a month later the second lock quit working. Upon calling customer service they said parts would be comming for both locks in a few days. Good news, the parts came and I was able to repair both locks. I hope they don't break in less than 6 months again.", "Date": "June 8, 2011"}, {"Title": "Works Perfectly!!", "Author": "happydad", "ReviewID": "R31LPSR2BU4U8J", "Overall": "5.0", "Content": "We needed to limit access to our bedroom.  We wanted something secure but would be easy enough for us to come and go as we needed.  This lock fit the bill.  It was easy to install and operate; and has work perfectly in the month that we have been using it.  It doesn't exactly match the other knobs in the house but is close enough that it would take close examination to tell the difference.  Lowes and Home Depot have a product like this but at a higher cost.I would purchase this product again.", "Date": "January 23, 2011"}, {"Title": "Very easily picked. Useless.", "Author": "50 eyes \"Inspector Gadget\"", "ReviewID": "RU3Z1QUM03IRJ", "Overall": "1.0", "Content": "Warning! This lock is very easily picked. Useless. This problem is not unique to this lock, but this is easier than most to pick.  [...]", "Date": "July 13, 2012"}, {"Title": "2 years later", "Author": "Steven", "ReviewID": "R3W35EZU5WFL75", "Overall": "3.0", "Content": "I bought this in November of 2009, now 2 years later it's still functioning.  My ONLY gripe is that sometimes I get locked out of my bedroom.  The lock doesn't seem as powerful as it used to be.  I get locked out of my room at least 1/4 times of using it.", "Date": "December 13, 2011"}, {"Title": "one star because at least the key will open door", "Author": "J. O.  Va \"Gluten free baker -va\"", "ReviewID": "R2H34ICGU4BJ6G", "Overall": "1.0", "Content": "Very disappointed!!It didn't accept the code [4 digits] we could only get positive response from last 2 digits [sometimes, not always then] Now it recognizes one number but still doesn't open. My daughter says she hates the thing and to get rid of it.I have to have the key with me at all times.  Tried new batteries...nothing still.Also Handle very slippery! It's hopeless if the knob or your hand is damp.Tried to get help during business hours, both mailboxes are full and can't take any messages.  Email address only gave fax number, the mailing address and one of the numbers I tried. It would not take you to cust. service and I couldn't seem to get anyone to talk to let alone any help. The info email address they gave is not recognized and will not come up! Next time I need to fax them.I will not purchase from this company again. We have 2 other locks from Schlage that are problem free. Almost same price.", "Date": "December 12, 2012"}, {"Title": "Worked for two months....", "Author": "S. Black \"SBlack\"", "ReviewID": "R1GB18LV3KEBGS", "Overall": "1.0", "Content": "It installs easy enough.  Programming easy.  I thought it was a deal because it was so much cheaper than the rest. Some of the keys began to not work. I changed the code to avoid these.  Then it just stopped working. Just outside the return period. That's $45 a month for the convenience.  To get the warranty I have to send the lock at my cost plus $10 for them to send it back....is it worth it...or do I just eat it?  I would not buy this again.  It just seems to reak with problems.", "Date": "June 30, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003EGTN6Y"}}