{"Reviews": [{"Title": "Uber easy, even for a novice!", "Author": "Richard C. Nichols \"whereisrich\"", "ReviewID": "R23KY3QEVCH9J7", "Overall": "5.0", "Content": "I used this with the the Viper 5901 in my 09 Silverado. I have never installed anything in a car before. Programing was a breeze, once I got to a windows machine. I could not get the software to run in Linux. Took me an evening to read through the manuals and program this little guy. The next evening to install. It made bypassing the security a breeze not to mention saving all the time tracing door lock wires, hoot pin switch and other wires.", "Date": "July 5, 2011"}, {"Title": "Tried it with Bullldog remote but never got it to work", "Author": "Glenn Doss", "ReviewID": "R2VR5VSBO5VXOB", "Overall": "1.0", "Content": "This unit may work fro you but I never got it to work.  I tried many times but no sucess.  it would not work", "Date": "December 9, 2012"}, {"Title": "Make it work right", "Author": "Tom Cones", "ReviewID": "R3NN24ZR79ENDX", "Overall": "5.0", "Content": "With this unit I was able to override alarm to make remote start unit be able to operate the trucks door locks.", "Date": "December 11, 2013"}, {"Title": "no better bypass.", "Author": "Chris", "ReviewID": "R1KU76YH49S208", "Overall": "5.0", "Content": "Have purchased many directed electronic bypass units and haven't been let down yet. This particular unit has to be updated with the most current firmware using the directed electronics XKloader2. quick and easy plug and play connections and firmware updating. bypass units works like it should, Xkloader2 shaved maybe 30 minutes and at least 10 wires off my installation.", "Date": "December 10, 2013"}, {"Title": "Warning: You must have or buy a XKloader to flash this module!", "Author": "Jamie Larson", "ReviewID": "R1J9DWZ3L53QYW", "Overall": "2.0", "Content": "I bought this to go with a Viper Remote Start system.  I knew it had to be flashed with vehicle-specific software to work, but assumed that it had a standard USB connection to do it.  That was a bad assumption!  I now have the unit in the vehicle, but can't use it because I can't get this module flashed without ordering a XKLoader2 for another 30 bucks that I will only use ONCE.  I went to Best Buy, a DEI dealer, to see if they would flash it, even for a price, but was told by their technicians that they no longer use these modules and didn't have the XKloader.  I checked with another local installer, and he told me pretty much the same thing.  Another intersting note: when I went to Viper's (DEI) website to find out how to flash this thing, I got a popup saying avoid buying their products from a list of websites (including amazon), and if you did, the warranty would not be honored. At this point I am hoping that it will work after investing another $30.", "Date": "January 6, 2013"}, {"Title": "Install was quick and easy.", "Author": "James A. Walker", "ReviewID": "R1O9K44BA8I3CB", "Overall": "5.0", "Content": "I purchased this to go with a Bulldog Deluxe 500 in a Chevy Avalache.  It was simple to install and a snap to program. Highly recommend for installing remote starters in new cars.", "Date": "March 9, 2012"}, {"Title": "Bought this for my car", "Author": "Thelovelybuer", "ReviewID": "R2YPRYYKAHOYBO", "Overall": "5.0", "Content": "Works as intended no faulty unit and no headaches installing it.Used it on a Oldsmobile Aurora and it works without any problem. Installed it with Python 5704P without any problems been about 2 months and with the brutal winter. Its very nice to have a working car starter.", "Date": "December 31, 2012"}], "ProductInfo": {"Price": "$59.99", "Features": "New Platform #9 covers all of the same vehicle as the XK01, XK03, XK06 and XK07. Use a new GM all fimware that covers almost every GM vehicle and is preloaded on the module.\nDoor Lock, Override Module, and Remote Start Ready Module for Almost All Chrysler Models, Preloaded with DLPKGM Firmware\nBlend of multiple XK modules in one\nCovers all of the same vehicle as the XK01, XK06 and XK07", "Name": "Directed Electronics Inc XK09 XpressKit Door Lock Override Module", "ImgURL": "http://ecx.images-amazon.com/images/I/4102Gaf7f%2BL._SX300_.jpg", "ProductID": "B00314WNYI"}}