{"Reviews": [{"Title": "Ok for the price", "Author": "DR", "ReviewID": "R2OEN50C6LEWXY", "Overall": "3.0", "Content": "Both chime and alarm modes work and the alarm is very loud. Good alarm for the price. I was hoping to have it mounted in the garage and switch between chime mode when I am home and alarm mode when I am away. There is no way to do this without removing the battery cover. If left in the alarm mode, every time I walk by I have to wait and enter the code. Other than that alarm works as advertised. I have not tried any other alarms and do not know if there is a better one.DR", "Date": "August 25, 2013"}, {"Title": "very good!", "Author": "boxings best", "ReviewID": "RMYE2RO4NYXIC", "Overall": "4.0", "Content": "This is a very good alarm. It's very loud and does what it's suppose to do. The only problem I have is it takes a little too long to alarm once triggered. It take 30 seconds when 20 is enough. otherwise it is a nice alarm for the price.", "Date": "March 29, 2013"}, {"Title": "The Best Motion Alarm I Found on Amazon", "Author": "Amazon Addict", "ReviewID": "R113NL9816YXJD", "Overall": "5.0", "Content": "I looked at probably a dozen motion alarms and settled on this one. I wanted something I could set-up in my office and turn on each evening when I leave. This product is simple, extremely loud, and it works. I mounted it on a high corner of my office. When I enter my office in the morning it lets off a single chirp, which reminds me to enter the password to disarm it. Yes, this could potentially tip off a burglar that you have this alarm, but I would guess most burglars would not even notice it or ignore it. I'm glad it chirps, because otherwise I would probably forget to enter the password and turn it off. I liked that you can great your own password for it also, I set a numeric password that is easy for me to remember. If an intruder hears this thing wailing, they'll probably assume it is a full blown alarm system and that the police are on the way. Inexpensive protection.", "Date": "March 2, 2013"}, {"Title": "It serves its purpose and works!", "Author": "garlandbob", "ReviewID": "RG9YF60LTUBBQ", "Overall": "5.0", "Content": "I bought this unit at a local `brick & mortar' store last summer and I set it every time that I leave my house.  It's mounted about 7' off of the floor onto the wall within my front door's entryway, facing down the hallway and also into my living room.Two hours after I left the house this morning, the local police department called my cell phone saying that my house had been broken into.  I got home within 3 minutes of that phone call; the police got to my house within 2 minutes of my neighbor calling them.  They reported hearing an alarm going off and saw two teenagers running out of my garage that they had pried open because they failed at prying my front door open.Within the 30 second window of the alarm waiting for the pass code to be entered they ransacked two bedrooms.  After hearing the alarm squeal, panic must've set in because they left lights on and only made it out of my house with my PS3.  My Nikon camera bag with 3 feet away and my home computer was another 2 feet from that.I strongly feel as though this simple alarm did its job.  If I didn't have this or some other audible alarm system, I feel that the thieves would've done more damage and would've gotten away with a lot more.Btw: This alarm is still operating on the initial set of batteries that I installed when I got it in July 2012.  I think this weekend, Swann cameras are going up around my house.The thieves got away and no good description was given!  My neighbor two houses down and across the street heard this alarm.  The front door where it's mounted was closed.  It was heard at multiple bends; through the living room, into the laundry room, through the garage and out into the neighborhood.  It's not ear piercing, but blasting for the duration that it did was loud enough to be greatly effective!Since it's `motion activated', I wish it could be set for instant alarm too once triggered.  It's non-adjustable delay is 30 seconds.  Other than that, it gets 5 stars!", "Date": "January 29, 2013"}, {"Title": "very good", "Author": "D. Erickson", "ReviewID": "R25SO93VNUJBDB", "Overall": "4.0", "Content": "We have used these type of alarms in several homes over the years.  We use them as a deterrent.  If someone enters our house or a room, then they'll be surprised by the alarm.  It's simple, well made, and practical.  Volume is sufficient.  No false alarms or problems.  We've used this unit about four months now.  Battery still strong after this period of time.  We had it armed for two weeks during the Christmas break and it held strong during the entire two week period.We don't mount the alarm to the wall.  We set it on a table or book shelf.  It's a bit wobbly when we set it on a table, so a good design change would be to make it a bit more stable if it's place on a shelf or table top.", "Date": "January 6, 2013"}, {"Title": "Product works fine but is a little too sensative", "Author": "Alfred J. Trimble", "ReviewID": "R2ZOTG1QI3J997", "Overall": "3.0", "Content": "I wanted to use this product to let me know when my puppy approached the back door so that I couldget him out before there was an accident.  The angle of coverage was too broad and I not only got the dogbut us as well as we walked around.I think this is a good product for what it was intended and I will take it with me as I travel as a security device.", "Date": "December 31, 2012"}, {"Title": "Very useful", "Author": "Harry", "ReviewID": "R6APZDDZB0KXI", "Overall": "5.0", "Content": "Inexpensive way to guard your property: good quality for the price,the sound that this little thing makes is just UNBEARABLE!!!It's not hard to program it,you can move it from one room to another and I'd recommend it to anyone who doesn't want to spend a fortune for expensive alarm systems. Just make sure to install it on a spot that an intruder won't see,otherwise he'll break it and the unit will stop making noise. And don't forget to replace the batteries every 6 months.", "Date": "September 20, 2012"}], "ProductInfo": {"Price": "$24.99", "Features": "Powerful 120+ Db Siren Sounds When Any Activity Is Detected By Pir Movement Sensor\n120° Wide-Angle Detection\n2 Settings - Chime Sound In Alert Mode & Siren In Arm Mode\nCompatible With External Siren, Magnetic Sensor Or Shock Sensor\nEasy To Use With Entry & Exit Delays\nPasscode protected, powerful siren 110dB+ sounds when any activity is detected by PIR movement sensor\n120 degree approximately) wide angle detection with multi-directional mounting bracket\n2 Settings - chime sound (alert mode) & 110dB+ siren (arm mode) selection\nUse in conjunction with other alarm products to maximize your safety", "Name": "Swann Passcode Protected Motion Alarm SW351-KCH", "ImgURL": "http://ecx.images-amazon.com/images/I/316tRg2OqWL._SY300_.jpg", "ProductID": "B003XQITTW"}}