{"Reviews": [{"Title": "Excellent Value", "Author": "bibliobob \"bibliobob\"", "ReviewID": "RUAMP6NFQIXOV", "Overall": "5.0", "Content": "For serious photography, I prefer a big, heavy digital SLR. But where my goal is not photography but I want a camera along for snapshots, I use this.I expected to buy a Lumix LX-series or Canon S95 - both attempts to match the capabilities of a SLR as much as possible in an easily-pocketable camera. But as I kept reading the reviews I got more confused, until I remembered the basic laws of physics haven't been repealed.To roughly summarize the camera review sites, all major-brand subcompacts do a good job in bright light. The differentiators are low light, flash, performance, and manual control. And when you read carefully, you realize there's not a lot of practical difference here either. But there's no way to compare them without exaggerating the differences, which makes them sound more significant than they really are.LOW LIGHTIn low light, digital cameras increase the ISO, which means the weak signal coming from the sensor is amplified. This also amplifies noise, which causes an overall grainy look and, in dark areas, colored confetti.  I don't expect any camera to work well in low light; this goes for pro-level DSLRs and film cameras as well. So paying extra for a camera that's really bad in low light rather than terrible doesn't make a lot of sense to me.  It's a lot like choosing sunglasses based on their performance in dim light, or a screwdriver for its ability to drive a nail.FLASHFor flash, a commercial photographer typically uses a power pack that may draw 15 amps AC and power multiple heads which range in size from 4\" diameter to over 36\". Subcompact cameras have ridiculously small batteries and tiny flash tubes (typically under 0.2 sq inches) located at the worst possible place: near the lens.  It amazes me that any of them work as well as they do. Do I really care that one extends to 13 feet and another only 11.75? There have been times where I'd wished for a more powerful flash, but I'm thinking an extra 30 feet; I wouldn't notice an extra 2 or 3.The A3000 flash will synch any ordinary slave flash if you turn off the red-eye feature in the camera. It won't meter it, however, so it's easy to wash out the picture. I believe this is true for all Canon subcompacts.PERFORMANCEWhen prefocused, picture-to-picture processing time is barely noticeable -- less than half a second. When you include focusing time, less than 2.5 seconds. It's faster with the continuous shot option, which does not refocus between exposures. This is respectable, and more than enough for my needs. To keep up with a very active child or pet, you might want faster performance. Tested with 4 GB Lexar Platinum II 9MB/sec SDHC.MANUAL CONTROLI use manual control on my SLR most of the time. I had it on my last two subcompacts, and seldom used it. The A3000 doesn't have it. The only time I missed it was using slave flash. If I'm out with the family, I don't want to be thinking like a photographer, so the camera will probably make better decisions. And manual control is less convenient on a subcompact because of the ergonomic compromises necessary for such a small camera. Nice to have, but as processors get smarter, less important.MEGAPIXELSThe best professional color printers print 90,000 dots per square inch. That means it takes 4 x 6 x 90,000 = 2.2 megapixels for a 4 x 6 print. 5 x 7 = 3.2 megapixels. 8 x 10 = 7.2 megapixels.  Higher megapixels increase image file size and shot-to-shot delay (while the camera compresses the image and writes it out to the card). The only advantage to \"higher resolution\" than that required for your final print: you can crop the picture a bit without losing any picture quality. The A3000 is 10 meg; if they had a 6 meg version, it would be a better camera. Canon knows this; they also know megapixels are a lot easier to sell.SENSOR SIZEBigger is better, but more important than sensor size is pixel size - the larger the pixels the higher the dynamic range, which means more detail in very bright and very dark areas. It usually means better low-light performance and less noise because of other engineering choices available because of the larger pixels.The difference in sensor size between this and some of the more expensive small cameras (S95) seems significant until you put it into perspective. The pixel size of a Canon S95 is 6% that of a 12-meg professional DSLR (FX format). A3000 is 4%. Given the dynamic range and low-light performance of a pro DSLR isn't that great, I don't see any reason to pay a premium for 6% vs 4%.CONCLUSIONMy ideal small camera - pocketable, usably large viewfinder (I can accept a smaller LCD), 5-6 megapixels, manual control, image stabilization (small cameras are hard to hold steady), not cluttered with silly features - is no longer made. If a camera manufacturer wants me to spend more, they're going to have to come closer to that; more megapixels won't do it.Until then, I'm OK with the A3000. Pictures are excellent for a subcompact. Flash even in a big room is more than acceptable for on-camera flash, focus is quick and remarkably adept at identifying the right subject, image stabilization works as well as I'd hoped. Controls are well laid out and intuitive. LCD is bright and clear, even outdoors. The shutter release could be more prominent, and I may attach a thin rubber disk to make it easier to find by feel.The A3000 doesn't looking expensive, so subjects tend to ignore it. And I'm more likely to take it along because it if gets damaged or lost, or encounters the uneconomical-to-repair \"lens error\" that seems to afflict all brands, it's not a big deal.  Manual is pdf file on disk, also available on-line. Camera made in Malaysia. 1-year limited warranty.7 July 2011 UPDATE: The \"excellent value\" comment was based on a selling price of under $100 directly from Amazon.", "Date": "November 7, 2010"}, {"Title": "TERRIFIC FOR TRAVEL CANDID SHOTS!", "Author": "Ed Hooks, Acting for Animators", "ReviewID": "R2Z8YTIFAFZWQK", "Overall": "5.0", "Content": "Purchased the camera for my wife, who was going to Thailand on a University trip.  She came back with 500+ photos, taken in all kind of light conditions.  All except two or three were in sharp focus, and the best of the lot are good enough to put on the wall.  She had to recharge the battery once a week, she says.  We uploaded her photos to our computers, no problem.  I would recommend this for any casual photographer, including the one that is technically challenged.", "Date": "December 31, 2010"}, {"Title": "A3000 IS Review", "Author": "G. Chris \"Please believe me!\"", "ReviewID": "RYHB0PALHEK3C", "Overall": "4.0", "Content": "I've owned over countless Canon/Sony models over the decade but just want to give a heads up since this is a new model and I wanted to give my opinion first.I just got this today. Very cheap feel...camera feels very hollow and light. Pictures are great as usual from Canon. Not as many functions as my SD940 but a good point and shoot for the price. The right corner nob is a new twist for Canon ELPH models which looked weird at first but fast if you want to switch shooting modes (compared to my SD940). The thickness could be more compact given that the camera feels so light and hollow inside. The buttons need to be more crisp but its the pictures what matters most. Overall, decent camera for the money. If I had to buy again for the same price, I would go with the SD1200 which is more solid and compact.", "Date": "February 19, 2010"}, {"Title": "canon powershot a3000is", "Author": "H. kim \"newamazonfan\"", "ReviewID": "R1NYMWLU7SOBWY", "Overall": "3.0", "Content": "Got the camera one week ago and already had one problem.  After taking about 200 pics (for work indoors), the camera stopped working.  The screen went white and could not take any more pics.  Took out the battery and hoped this would reset the camera but nothing.  Was on the way home to return the camera and decided to try one more time to see if it works.  It started up and for the past 4 days, no problems.  I am debating whether to return or not so I am keeping the box and all packaging in case it happens again.  The pics don't look great on the camera screen but when I downloaded them onto my computer, the pics were fine.  I am not a professional and for $150, the quality of the pics are more than good enough.  Praying the problem was a one time glitch....  If it does break down, I will definitely let everyone know so they will be aware of this issue.", "Date": "February 24, 2010"}, {"Title": "Canon A3000is Camera", "Author": "james a. kloster", "ReviewID": "R2IDES7P17FEGG", "Overall": "5.0", "Content": "I ordered this camera for to replace my wife's old Canon. It's a small compact camera that fits her small hands quite well. This little camera takes great pictures indoors and out under all lighting conditions. It feels solidly built and has more functions than she normally uses, but it's nice to have them available when the need arises. Her last camera had a lot of scratches on the LCD, so I put protective film on this one right away as the large LCD looks like it will be prone to it as well, maybe even more so. My only complaint is that it doesn't have a through-the-lens viewfinder like her old one, but the LCD is large and bright enough even in sunlight. The Lithium battery lasts 10 times longer than AA batteries before it needs recharging.", "Date": "April 14, 2011"}, {"Title": "Great Camera for the Price", "Author": "David R. Halperin", "ReviewID": "RMHS5980HJDQF", "Overall": "5.0", "Content": "I purchased this camera at Sam's club for $120 including tax. I was considering a powershot 1300 but this caught my eye. I enjoy the rotating knob on top, that is what hooked me. The photos seem to be as good as my Canon that last year cost me over twice as much. It has all the controls you need for everyday snapshots, and then some. It is light weight. It is thick enough to hold onto securely. The photos come out very sharp. Low light capability seems just fine. I normally use Program Mode so I can set my own ASA (100 or 200) and Neutral Color. You could spend 100 dollar more a get a few more functions but not necessarily better photos. I think you would have to put out 200 dollars more to get results and control that was significantly better. I don't take a lot of video so the video capabilities of this camera (which I have not even tried yet) might be one reason this camera is so inexpensive.", "Date": "August 2, 2010"}, {"Title": "Simplicity meets quality.", "Author": "C.H.", "ReviewID": "R30YUMHP7S7K8F", "Overall": "4.0", "Content": "I am not a professional photographer but I do appreciate quality, and I greatly enjoy casual photography. I tried out this camera in a couple of stores and it really impressed me with photo quality and ease of use. In fact, I had already ordered the Sony Cybershot DSC-W350 to replace my previous Sony, but will be returning it as soon as it arrives. The W350 really has too many features I don't need, but this camera has just what I need - the ability to take great pictures in different circumstances. Not to mention, the price is pretty nice from many retailers.Also, I like the way it feels in my hands. It's kind of chunky compared to other digital cameras of this generation, but I actually prefer that, as it's easier to hold and control. The buttons feel sturdy, and I like the fact that it has a mode selection wheel, which is very simple to use.Out of all the digital point & shoot cameras I have had the opportunity to use over the years (including an older Canon, a Sony, and a Panasonic), I have found that this camera is the best at producing colors that are true to life. That is one of the major points that sold me on this camera, and was quite surprising to me!The auto mode and easy auto mode work okay and are a good option if you just want to take a picture without having to mess with settings, but I prefer to use the program mode and adjust the available settings myself (keep in mind, this is a point & shoot so the manual settings are limited). I feel I can get better pictures, most of the time, if I tweak the settings myself. However you prefer to take the pictures, the options are there at the turn of a wheel!The only bad thing I can really say about this camera is that the microphone is not all that great. It's perfectly FINE for most videos, but videos of concerts can sound badly garbled if it is very loud or if there's a lot of bass. If not for that then I'd give this camera a perfect 5 stars.Overall, I really enjoy using this camera. It's not a pro camera by any means, but it is a nice point & shoot for everyday use, and 10 megapixels is PLENTY unless you plan on printing poster sized pictures. This camera caught me by surprise, and I'm glad it did! However, if you're in the market for something very compact, or with a lot of bells and whistles, then you might want to skip this camera. I've only had this camera for a few days, so I can't yet say how it will hold up in the long run, but if anything goes afoul then I will update this review.For your consideration, I have a few sample pictures uploaded in the image gallery.", "Date": "January 15, 2011"}, {"Title": "Hits the Mark", "Author": "Ralph DeCesare", "ReviewID": "RZGHJHRIO33Y5", "Overall": "4.0", "Content": "This is the third digital camera I have owned.  I've used it for a few days now and feel comfortable recommending it.  I've tested it out in various lighting conditions both indoor and out.  Each time the picture qualitly has been good to great.  Exposure seems right on each time just on the auto setting.  If for some reason the conditions are not right the compensation settings can be accessed  right from the top wheel which is a nice feature.  It is only 10 mega pixel, but I've since learned that picture quality and the number of mega pixels don't necessarily go hand in hand, at least not with cheaper point and shoot cameras.  For example I originally bought a Nikon which was a 14 mega pixel camera which I returned because the picture quality was terrible in anything but outdoor conditions.  My only complaint with this one is the buttons on the front of the camera are confusing as they do different things depending on how the camera is set, but that seems to be the case with most electronic equipment these days.", "Date": "October 4, 2010"}, {"Title": "Great Camera", "Author": "Denise Romero", "ReviewID": "R1WIV4TGRJCE5Y", "Overall": "5.0", "Content": "This is a great little camera.  It is nice and small and it takes great pics.  It is really easy to use and I love it.  Also, the rechargeable battery that it comes with charges fairly quickly and it lasts for a long time.", "Date": "March 17, 2011"}, {"Title": "Canon Powershot works", "Author": "Mark Coates", "ReviewID": "R2GL515ZV5KPQF", "Overall": "5.0", "Content": "This was my first digital camera and I found it easy to use and the quality of the pictures excellent. The computer program was also easy to implement for transfer of pictures and video.  A good value for the money", "Date": "September 5, 2010"}, {"Title": "Great little camera", "Author": "Sun City Walt \"Walt\"", "ReviewID": "R2CA77SPJ0IZ6Q", "Overall": "5.0", "Content": "A terrific compact point and shoot camera at a reasonable price. The pictures were clear and sharp. The flash worked fine. I was taking great pictures right out the box. The instruction manual is clear and useful. Compared with my old Canon elite, the pictures are significantly better in quality and clarity.", "Date": "April 24, 2011"}, {"Title": "WOW!", "Author": "T. Sewell", "ReviewID": "R1L93LYPA1QW3D", "Overall": "5.0", "Content": "I just wanted a basic camera that could shoot decent pictures of friends and family. My frustration as of late has been AA batteries. I'm tired of using them. That's particially why this camera caught my eye. I'm an amatuer when it comes to photography and really don't need some of the bells and whistles that come with say the Canon ELPH 300? The bundle that Amazon is currently promoting is a steal so I jumped at the opportunity to own this most excellent camera. I wasn't quite sure what to expect, but after turning on the A3000 and taking a few photos, I was really impressed. Out of the 30 or so pics I've taken, not one is blurry or to bright/dark or soft. I'm not sure if it's even possible to take a bad photo. Every picture was crystal clear. Very sharp images for an entry level camera. I am extremely happy with my purchase. I played with the video for a few minutes and it's nothing to shout about. Those interested in shooting video, this is NOT the camera for you. However, I have other devices that take video and only wanted a camera to take pictures. I highly recommend this camera. It's budget friendly, produces amazing photos, and best of all it uses a lithium ion battery :) It even comes with a charger so I dont have to pull out my laptop everytime it needs to be charged. Speaking of which, I haven't drained the battery completely to see how long it lasts but after 2 hours of fumbling with it I still have a full battery. This is truly a great value. Plus you really can't go wrong with Canon.", "Date": "May 25, 2011"}, {"Title": "Cheap & good!", "Author": "Helen S. Lam", "ReviewID": "R1DHH9ESV7SE11", "Overall": "5.0", "Content": "I loved my first 4 MP Nikon camera and subsequently bought a 12 MP Nikon camera last year.  However, although the camera looked very nice (all sleek metal and black), I was disappointed with the shutter lag especially when taking pictures of active children.  My son dropped this camera during a trip to the zoo this year so I was on the market for a new camera.  This time, my goal was to get a cheap and easy to use camera.  Having the latest technology was not the driving factor in my decision-making.  I really like this camera's price-point and the ease of use.  The shutter lag seems to be less than my Nikon and the picture quality is the same or maybe even better than my Nikon.  So, I recommend this camera to those who likes a simple and affordable point and shoot.", "Date": "May 19, 2011"}, {"Title": "Compact, easy to use, decent picture quality...", "Author": "35-year Technology Consumer \"8-tracks to 802.11\"", "ReviewID": "R339ELRFRZ4CPP", "Overall": "4.0", "Content": "...and at current the current Amazon sales price, you can't hardly go wrong with this point and shoot.Depending on how you count, the A3000 IS offers up to 18 separate shooting modes, including video recording (.avi format). The 2.7 inch LED display screen is bright and viewable in even in direct sunlight. This camera is light and generally intuitive to operate. Still image quality was fine, and will provide enough resolution to print to 8\" x 10\" without loss of fidelity (the online description claims 13\" x 9\", but I could not test that large with my printer). Video is standard definition, and when used indoor, you can expect significant noise/graininess in the .avi output files. This still may be preferable to carrying a second video capture device if video is not your primary interest.I did not install the included utility software that came with camera. Two separate Windows 7 machines (a latptop and desktop) immediately recognized it, and I was able to transfer and delete images and videos without removing the SD card. The user guide indicates that video transfer, metadata and image orientation can all experience difficulty if the Canon software isn't used, but I experienced none of these.I didn't discover any show-stopping issues with this camera, and at the current discounted price, it's an excellent value. Why 4 stars? Three main reasons:(1) No included user guide. You must either copy this (.pdf file) from the utility CD or download from Canon's site. Sorry: a printed full user guide should ship with the camera. And, the .pdf version should have included color (present only to differentiate labels for the two models of camera the guide is written for).(2) No SD memory card included. I'm lucky to have some extras around. If you gave this as a gift to somebody without one...the joy would be delayed until the next trip to a brick and mortar store. Even if it were a low capacity one, a memory card should have shipped with camera.(3) Proprietary form factor battery charger. Going on the road? Make sure you take it with you. While I'm sure this was a choice made to accommodate the camera's thin profile, the use of CRV or AA batteries would have been more user-friendly. The user manual indicates it will take approximately 230 pictures between charges. If you're taking a lot...that's not going to get through many shooting sessions. Aftermarket batteries are available on Amazon for less than 10 bucks; you might want to consider buying one or two and keeping them charged.", "Date": "June 7, 2011"}, {"Title": "Not impressed so far - too slow", "Author": "Yarii", "ReviewID": "R2B3ZWWMG54YIM", "Overall": "3.0", "Content": "Unfortunately I no longer have my Panasonic DMC-FH1 which was a great camera for a low price.  Panasonic Lumix DMC-FH1 12.1 MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.7-Inch LCD (Silver)  I decided to replace it with this Canon A3000IS camera instead.  What a mistake!  I'm still on the fence about keeping this camera.Although the Canon A3000 does have its redeeming qualities.  I like the selector dial instead of using menus.  I like the tripod mount being made of metal instead of plastic.  Love that this is the first Powershot to use a lithium-ion battery instead of AA batteries.  I like the build quality considering it's an inexpensive, plastic camera.  And I absolutely love the video quality considering it's not HD.....even the sound quality is great with the videos.  The clarity, sharpness and colors of the pictures is impressive......*whenever* I'm lucky enough to capture a good picture.Why can't I get a good picture you may ask?  This camera is extremely SLOW...slow to focus, slow in processing the picture I just took - the screen forever says \"Busy\" before I can go on to my next shot.  There is no excuse for it being this slow since it uses a lithium battery.I'm using a Class 10 SDHC card, so I can't blame the card on the slowness either.I take a lot of pictures of my pets, and by the time I focus by pressing the shutter halfway, and then all the way to take the picture, my pets have already moved on to other things.  I can imagine it would be just as frustrating taking pictures of children unless you can get them to hold their pose.  My Panasonic (see above link) was extremely fast as all Panasonic cameras are...quick to focus, quick to capture, no delay between shots, etc.  Not this Canon.", "Date": "May 3, 2011"}, {"Title": "WOW", "Author": "Sam Iam not \"Claad\"", "ReviewID": "RXLI9OA822WFO", "Overall": "5.0", "Content": "This camera was purchased thinking that it would \"just get by\" for my needs.Don't let the price fool you.This camera has been used EVERY day at work, from taking site shots torecording model and serial numbers. It has a place with it's pouch on my side.The quick response and lack of having to fumble around for the correct setting makes thisthe best digital camera that we own.", "Date": "June 18, 2011"}, {"Title": "AMAZING CAMERA!!", "Author": "aliceinwonderland", "ReviewID": "R28AD5L5EQ3GY7", "Overall": "5.0", "Content": "I got this camera for my boyfriend's birthday and he loves it!! It's such a good camera! Takes great pictures; I even took shots while driving in the car and they were great!! Turned out very clear and not blurry at all, even in a moving car!! It's an image stabalizer so the pictures are very very nice. It also runs on a rechargeable lithium-ion battery, which was what I really shopped for and considered it a huge plus. I don't like AA battery cameras and this one was so so great! I would like to buy this exact one for myself soon since I don't like my current Olympus camera.This camera is a little bigger than I had expected, but not so much that you can't put it in your pocket. It's easy to start up; just turn it on and start taking pictures!! Awesome camera; wish i could give it more than 5 stars!! =]", "Date": "June 5, 2011"}, {"Title": "Good entry-level point and shoot", "Author": "SRD", "ReviewID": "R1EGR2O2N8X1F4", "Overall": "4.0", "Content": "I normally shoot with an Olympus E-410, but I got tired of lugging it around town and was looking for a cheap, compact point and shoot.  I wasn't interested in gimmicks like dual LCDs or HD recording since I probably wouldn't use them anyway.  After reading reviews, I settled on this camera and am relatively pleased.  Picture quality is about what I'd expect and need for its intended use - casual shots of family and friends.  User interface is intuitive and the camera does have a nice set of features for a camera at this price point.  My only gripe - and this may be more related to the SD card - is the delay in between shots.  It's possible that my card writes slowly, but I haven't gotten around to trying a new one.  That aside, I would recommend this camera to anyone who's looking for an inexpensive, quality compact camera.", "Date": "June 25, 2011"}, {"Title": "Good camera for the price", "Author": "emcsaleh", "ReviewID": "RPWXI82OAP8XK", "Overall": "4.0", "Content": "I've had this camera for about 2 months now. It is very easy to use and holds up to a lot of abuse (I've dropped it a few times and even dropped it in the toilet once at a party!). The picture quality is decent. It's a good camera for on-the-go as its size allows for easy travel.", "Date": "June 16, 2011"}, {"Title": "Works Great", "Author": "Kevin R.", "ReviewID": "R3HPTO96MUB0JB", "Overall": "4.0", "Content": "Its slightly thicker than other digital cameras, the LCD screen is quite clear. Beast of all the modes dial is a the top so there is no need to fidget with the buttons to get to any settings. But for TT$643.00(US$99.94) you absolutely can't go wrong. Down here a canon with 10mp would cost more than TT$2000(US$310)", "Date": "May 30, 2011"}, {"Title": "Buyer's Remorse", "Author": "Lisa C.", "ReviewID": "R3F4DI127GNZW7", "Overall": "1.0", "Content": "I wanted to replace my worn-out Canon PowerShot Elph... this isn't it.  My biggest complaint is the 1-2 SECOND delay between pressing the shutter release and the camera actually taking the picture.  I've lost countless shots this way, despite being in a fast-shutter mode such as \"kids and pets\" and using a freshly-charged battery.  In video mode, it cannot focus quickly or accurately enough, and I've lost countless videos too!  It's utterly useless in low light (can't focus), and I currently have 8 layers of Kleenex wrapped over the flash to prevent it from blowing out every other shot.  I would still trust the Canon name, but go for an Elph.  I did a 365 project on an Elph and love it.", "Date": "January 1, 2013"}, {"Title": "Broke 5 days in", "Author": "Paulina", "ReviewID": "RCX1TTBL9S5H3", "Overall": "1.0", "Content": "I bought this camera expressly for my post-graduate backpacking trip. On day 5, it said \"LENS ERROR\" and refused to close when I turned it on. Not only did I have to purchase a more expensive one (and now have to use a converter every time I charge it) but I also had the blessing of carrying around the camera as a dead weight (boo!) Thanking my lucky stars for Amazon's fantastic customer service policy, though!", "Date": "August 13, 2011"}, {"Title": "Great camera for the price", "Author": "Pi Man \"Ron\"", "ReviewID": "RXCZWXLJN5FS0", "Overall": "3.0", "Content": "I bought this camera to take on vacation for my 8 yr old grandson to use. For the price this is an excellent camera for a novice. It is very lightweight, which for me is a con since I use a DSLR and the heavier camera can be held steadier.It is simple to use, and takes good pictures in good light. Inside it is best to use flash to avoid excessive noise. It fit my requirements very well: Image Stabilization, 4X zoom,Easy to use, Cheap (No great loss if it were dropped or lost.) My grandson loved it. He took over 500 pictures, and he enjoyed it very much. We went out on a whale-watch boat for about 4 hours, and the battery lasted all day with no problem.In this price range, I dont't think you could find anything better.", "Date": "July 25, 2011"}, {"Title": "Horrible picture quality", "Author": "Dmitry Goldenberg \"Dmitry\"", "ReviewID": "RTWN3Y4WO90I7", "Overall": "1.0", "Content": "Purchased this camera because older canon digital Elph fell and broke the lens.  This camera's picture quality was so bad that I returned it and purchased a 300HS.  300HS has excellent picture quality and great video and features.  I have several cameras and the small one is used for travel/small events.  The 300HS is well worth the money compared to this camera.  This camera takes pictures that are barely in focus, colors are terrible no matter how close you are to your subject.  I am a huge fan of Canon, have a 30D and now the 300HS.  This one simply falls far short of delivering quality pictures at any price.", "Date": "July 6, 2011"}, {"Title": "Excellent for its size and portability", "Author": "Richard Widman \"Richard\"", "ReviewID": "R30N33HUNF76VV", "Overall": "5.0", "Content": "I needed a camera to have with me all the time, belt or pocket sized, replacing my dead Samsung L100. After reading dozens of reviews I decided on this one. My use is pictures of the grandkids, my car restorations for my web sites, and delivery or quality problems to send to my suppliers, using the macro a lot.Canon has gone a long way with this one from the Samsung and 3 Sonys I've had in the last few years. The automatic setting is really automatic, and it shows you the settings it is determining. It not only adjusts flash but macro settings, face, and other things if you have it on auto. No more forgetting to change from macro and losing your next dozen pictures. This of course adds a second or so in taking the first shot, but that was only really noticeable the first day or so. I haven't played with all of the non-auto settings yet.Videos are extremely clear and detailed, showing nicely on full screen.Another plus is the lithium battery, so it is lighter and less bulky, takes more pics per charge. Lithium can/should be recharges before hitting zero, so I prefer those.The colors are much more vibrant than the Samsung and Sony it replaces.On the negative side, it is just as the Samsung and Sonys in detail in shaded areas, so when there is a large range of light I still need to dig into the shadows with iphoto and bring them back. Detail is great until you get it way out to full zoom, then it becomes a little grainy.I ordered a second one for my office and another for a friend.BTW: the \"Case Logic\" case Amazon recommends for it is a perfect fit, with both a belt loop and a loop to fasten it to things", "Date": "June 26, 2011"}, {"Title": "Simple digital camera for a non-techie", "Author": "Costume Nut", "ReviewID": "R1BS3AL8C71EE2", "Overall": "5.0", "Content": "I like simple. Hate cell phones, won't have a PDA. Even non-digital cameras--except the disposable kind--are a challenge. This one, however, is perfect for my use--snapshots of scenery and of furniture and craft projects I'm working on. Even the manual was easy to understand (not always the case, as we all know). The only thing I'd have liked to know before buying it is that the memory card is not included. It was no big deal but since I knew NOTHING about digital cameras it never occurred to me it wouldn't be included.", "Date": "June 23, 2011"}, {"Title": "Outstanding Photos and Value", "Author": "Beau Mccoy", "ReviewID": "R2SVMSLD2OETNN", "Overall": "5.0", "Content": "Canon has made the best point+shoot cameras for the last 10+ years. This camera takes fantastic photos that are clear as day. This is the fourth PowerShot I have owned and it has the highest photo quality. I especially like the image stabilization and the face selector! These help make sure the pictures come out in focus and everyone's eyes are open!  There is a slight delay after you take the photo while it processes. I cannot find anything wrong with it other than that.  This camera is an unbelievable value for the low price.  If you care about your pictures then you owe it to yourself to put down the smartphone and use a real camera like this.", "Date": "June 22, 2011"}, {"Title": "Handy little pocket digi cam.", "Author": "J. S. Coile \"1designguy\"", "ReviewID": "R14PN5LC2327IZ", "Overall": "4.0", "Content": "Got this for my mother to take on an Alaska cruise.  Gave it a good test run before she headed out.  Very pleases with the results in outside light.  Colors were accurate and vibrant.  Image quality was good for such a small sensor.  No sense in pixel peeping these little cameras.  They just aren't made for that but the images displayed well on the computer screen, used in a slide show on larger monitors and printed (nice up to the couple of 5x7s we printed).Solid feel.  Good LCD display.  Easy to use (buttons and icons are similar to other Canon products).  The price is right so if something horrible happens to the camera, you won't cry about having to get another.", "Date": "June 21, 2011"}, {"Title": "Decent for the Price", "Author": "Enlightened1", "ReviewID": "R14LDNKE7HSP2I", "Overall": "3.0", "Content": "This camera is a decent camera for the price. It's got 10 mega-pixels which is great, and looks stylish and modern. It's very lightweight and easy to transport. It takes amazing close-up shots. What's not so great about this camera is that although it has 10 mega-pixels, you have to hold the camera very still in order to get those crystal clear shots, otherwise many of the shots come out slightly fuzzy. Also, there is a shutter delay. Something I noticed is that the actual prints from this camera come out clearer than the digital downloads. Overall, good camera for the price.", "Date": "June 18, 2011"}, {"Title": "Not so great... returning.", "Author": "JodiSug", "ReviewID": "RH1L08M9ART1V", "Overall": "2.0", "Content": "I have always had Canon point and shoot cameras with great success.  This one had an amazing price but the quality is just not what I expected.  The camera is very light and cheap feeling and the pictures are just ok.  The photos that turn out have pretty decent quality, they are crisp and the light looks great however about 35% of the photos I took were blurry.  The auto focus takes way too long to catch the shot.", "Date": "June 14, 2011"}, {"Title": "Pleasant Surprise", "Author": "Bill L.", "ReviewID": "R3W1TG1A9JOTV3", "Overall": "5.0", "Content": "I was surprised at how good this camera is even though we are led to believe again that more is better - 10 meg is what was touted as the latest and greatest last year, or was it last month.This camera is for snapshots of course, but with a little creativity it can and does give really good results for those who want a little more. I remember in photography school years ago being given the assignment to build and use a pinhole camera, with film as the medium, and bring back creative photos. I did just that and it was a great learning experience on how to do much with little.  In this digital age this camera is probably considered to be rudimentary by many - perhaps it is - yet I have fine photos that I would be proud to show anywhere. If this is simplicity I am blown away.  I do not hesitate recommending this camera which for the price is a great and quality buy. The battery lasts beautifully in spite of what some reviewers say, and the interface with computer and TV worked the first time without any tinkering. I miss not having a viewfinder but I am getting used to composing a picture by taking an extra few seconds to move the screen - which is a little problematic in bright sunlight. a minor problem to be sure.  I am glad I ignored the impulse to go for 14.1 meg. etc and try this camera. It is a ten dollar upgrade from the same model Consumer Reports recommended as a best buy. For the ten dollars movement stabilization is included for these getting older hands, a great feature.  A little care is needed for focusing which I am finding not hard to do.  No downside for any average user and a pleasant challenge for advanced photographers, which will keep one away from the technology and into creating pictures in the way I always have, without constant adjustment as the tool easily becomes second nature.", "Date": "June 9, 2011"}, {"Title": "great product", "Author": "Margo", "ReviewID": "RT90YF21O7", "Overall": "5.0", "Content": "I was supprised by quility of the pictures. would be good to have zoom more then 4x. Otherwise the product is great and i would recommentd it to anyone. It takes 110-230 v so you can use it in Europe.", "Date": "June 7, 2011"}, {"Title": "Everyday household user who upgraded from a Canon Powershot A520.", "Author": "pixels and bits", "ReviewID": "R2MKIGJ8ZKFIIY", "Overall": "5.0", "Content": "Goodness, I've got to start from scratch.  The A3000IS is half the size and weight of my old  Canon Powershot A520 (that I paid nearly $300 for about 6 years ago).  It is 10 Mega Pixels over the 4 I used to have.  Then there's all the software and interior updates and improvements.  I'm going to need to start from square one again to learn this new technology.  I can't you how impressed I am with image clarity and ease of use.  I am having problems getting my Windows 7 machine to notice its existence.  It doesn't matter how many times I reload and update the software or how many different USB ports I try, my system refuses to \"see\" the camera.  It happened with the old Canon too so it is likely an issue with my computer.  I am beyond frustrated.  If anyone knows why this might be happening, I'd be very grateful for a comment.  As it is, I can transfer images via an SD card, but that's not ideal for the way I use the camera.  Anyway, I still love this little jewel of a camera.  It's extremely high quality and jammed full of all kinds of bells and whistles.  When I bought it Amazon was having a promotion offering this camera for less than $80 with a great camera bag and brand name SD card included.  It was such a great deal, I couldn't pass it up.", "Date": "June 3, 2011"}, {"Title": "Best Camera I've Had Yet", "Author": "Jennifer Belanger", "ReviewID": "RHP9HXNVZIWMI", "Overall": "5.0", "Content": "I absolutely love this little camera. I replaced my Casio Exilim with this Cannon camera when my Casio shutter button stopped working all of a sudden. I couldn't be happier with my new Cannon camera. I haven't ever owned a Cannon before but I read the reviews on this camera and decided to try it out. I'm glad I did and this little camera came with a few bonuses. It was under $90, it had free shipping, came with a free 4 GB memory card and a Lowepro camera case, too. It takes very clear, clean and crisp pics of everything I've tried it on inside and outside. It is very easy to use and operate and has a lot of options/functions for different settings with each different picture you would want to take. I will definately be suggesting this camera to everyone I know and don't know yet, lol. I think everyone should know what a good little camera this one is.", "Date": "May 22, 2011"}, {"Title": "Terrific pictures", "Author": "David B \"dwb\"", "ReviewID": "R3O9VKW0L7AXY0", "Overall": "5.0", "Content": "I am an amateur who is looking for good pictures of vacations, weddings, etc. I am nowhere near any expert class but I read the reviews from the experts.I got the camera yesterday and took about 8 pictures. The flash was great and the outdoor shots (on a cloudy day) were so sharp.The camera is light and plastic, it's not built to be mishandled. Some people referred as it felt hollow but I don't know how that can be felt.I am replacing another 10 MP Fuji camera that worked OK for a while the the pictures became very hit or miss. I saw the difference in quality with the few pictures I took with the Canon.I follow up if there are any problems but so far I'm really happy with this purchase.", "Date": "May 13, 2011"}, {"Title": "Very good camera for the money", "Author": "Earthstone", "ReviewID": "R3MK5DOANB9NU7", "Overall": "5.0", "Content": "Takes good pictures and the batteries last a long time (and recharge in a hurry) - I'd recommend this to anyone who wants a dependable, light weight camera that is easy to use and takes good photos.", "Date": "November 25, 2013"}, {"Title": "Great little Camera", "Author": "Robert Valderas", "ReviewID": "R324XPK84FUK45", "Overall": "5.0", "Content": "Great little camera! Clear pics too. Used  it @ a recent Rolling Stones concert and was able to zoom in on the band and get some great shots. Battery life is nvery long too.", "Date": "November 19, 2013"}, {"Title": "Good product for the price", "Author": "LW", "ReviewID": "R311XNFQJANQXI", "Overall": "5.0", "Content": "Served me well over the last few years, not too fancy, but it's easy to use and takes good quality pictures.", "Date": "October 22, 2013"}, {"Title": "this camera is great", "Author": "Jill M. Hackenberg", "ReviewID": "R1QXT84JIO282G", "Overall": "5.0", "Content": "i bought this after dropping my old Canon camera and this one is great, has a great zoom feature and now has rechargeable battery so i no longer need those annoying AA size batteries. very compact and easy to use.", "Date": "September 18, 2013"}, {"Title": "meets my needs", "Author": "buddy", "ReviewID": "R1G3LTADP3ZK5N", "Overall": "5.0", "Content": "for regular snap shots, not complicated to operate,nice design.i am tored to write more,next time i will skip the review", "Date": "August 11, 2013"}, {"Title": "Canon PowerShot A3000 Does What I Need It to Do", "Author": "Betty Parise", "ReviewID": "R3OBGBJDRNPRI6", "Overall": "5.0", "Content": "My camera, though inexpensive, serves me well.  I'm a senior citizen, and I need an easy camera to use.  This one couldn't be easier, and it takes very good pictures.  I'm very happy with it.", "Date": "July 22, 2013"}, {"Title": "Good picture quality", "Author": "Sudipto Desmukh", "ReviewID": "RPDV8S532JD01", "Overall": "4.0", "Content": "Slightly costly than Nikkon but good picture quality.You can get this if you have a better budget as always goes with Cannon.", "Date": "June 24, 2013"}, {"Title": "Awesome camera, quick service.", "Author": "James", "ReviewID": "R1WU23G3VEYBSI", "Overall": "4.0", "Content": "Camera was better than I expected. Shipping was quick. There was more included in the box than I anticipated. I didn't have to buy any new cables or anything.", "Date": "June 6, 2013"}, {"Title": "Reliable Camera - Two and a Half Years & Going", "Author": "Tommy B.", "ReviewID": "RSFYXWK2P1JWT", "Overall": "5.0", "Content": "Although I didn't purchase my camera via Amazon, I did pick this up in September of 2010 and it's by far one of the best (and most durable) point & shoot cameras that I've ever used. Granted it doesn't have all of the bells and whistles that other cameras may have, however it's most certainly a reliable contender with it's simple, yet efficient interface. Despite what some of these reviews have said, the pic quality is stellar and the battery lasts for quite some time. I have a proper DSLR, but for taking quick shots on the fly, the Canon A3000 is excellent!", "Date": "May 8, 2013"}, {"Title": "Gio", "Author": "gio", "ReviewID": "R1BWCAH49A5ECD", "Overall": "5.0", "Content": "It is great camera for this price. It takes good quality pictures. Very practical and amazing camera. I bought it in 2011 I still have.", "Date": "April 24, 2013"}, {"Title": "a good quick point aand shoot camera", "Author": "baron", "ReviewID": "R2FV56WR6OG6VV", "Overall": "4.0", "Content": "for the average person this camera and its successors are perfect for the average photographer who wanrs a camera that can be pocketed.  It'[s good value for the dollar.", "Date": "April 12, 2013"}, {"Title": "The only problem", "Author": "jmcread", "ReviewID": "R14GAUSWY4NI2W", "Overall": "5.0", "Content": "The only problem with this camera is that it gets complimented on the pictures that I take.  More than one friend (who take pictures regularly) has said, \"Your camera takes good pictures.\"  OK, it does. I wanted a reasonably priced camera that takes good pictures.  After reading many reviews, I decided on this one.  I would like more zoom, and maybe something \"easier\" to operate, but this does the job nicely.  Keep those compliments coming.", "Date": "January 19, 2013"}, {"Title": "excellent!", "Author": "Twang", "ReviewID": "R2BKRVYYWCOMWH", "Overall": "5.0", "Content": "bought for my son... and he's a film student.. he likes it's features and performance!very decent price and solid quality", "Date": "November 26, 2012"}, {"Title": "Compact and Light", "Author": "Hank", "ReviewID": "R1RBIGTH69R5LD", "Overall": "5.0", "Content": "This camera is exactly what I needed to purchase for my wife as as light compactcamera with the Canon name behind it. The low price of this item is amazing. She hasused this camera as soon as receiving it, and is pleased with the results.", "Date": "September 22, 2012"}, {"Title": "It was a great camera to take with me everywhere", "Author": "N. Chernyavskaya", "ReviewID": "R3GT5ERGAWX9N4", "Overall": "3.0", "Content": "If only it was higher MP camera! Everything else about it is perfect. Not a big of battery eater, compact, clear, takes really great pictures! I loved it and used it for about 2,5 years, but it just have started giving me Camera Error, and it seems like fixing it won't worth it, and I should just buy a new one. Too bad, cause these things are supposed to work for a long time, aren't they? So, anyway, a bummer. I treated mine well. But it's ok. I will get one with a higher resolution now. Still just 3 starts because it's stopped working. :(", "Date": "September 11, 2012"}, {"Title": "Wonderful little camera", "Author": "Charles D. Havener", "ReviewID": "R3SYNJ1T960DAL", "Overall": "5.0", "Content": "I love it. I didn't realize it came without a memory card so I had to go to Walgreen's and get a 4GB Sandisk on sale for $10. I have taken a hundred flash pictures and battery still good. The software that comes with it for Windows is excellent. Very easy to get photos into PC with USB cable provided and very easy to send e-mails with images.", "Date": "August 25, 2012"}, {"Title": "Excellent", "Author": "Ray Ray", "ReviewID": "R3T27NCMX6AYSG", "Overall": "5.0", "Content": "It takes clear photos and the battery life is very good.  I love the manual dial to switch between modes.  Easy to download on a computer.  Perfect $100 camera.", "Date": "August 12, 2012"}, {"Title": "Good reliable device", "Author": "Vitaly V.G. Chaban", "ReviewID": "R1IQV9G1UXPQDP", "Overall": "5.0", "Content": "Good reliable device. I never had problems with it during 1+ years. A good value for the money it costs.", "Date": "July 31, 2012"}, {"Title": "fine camera", "Author": "XJ", "ReviewID": "R23XNJDPXEYHWR", "Overall": "5.0", "Content": "This camera replaces an identical Canon A3000IS that disappeared sometime since February of 2012..... absolutely no idea where the previous camera, charger, case and camera cards went.  If, by chance, a Canon A3000IS, Serial Number 032021003443, shows up on some Internet selling site I'd like to know about it.  The camera IS REGISTERED with US Customs and Border Protection.", "Date": "July 19, 2012"}, {"Title": "Camera's performance under difficult wilderness vacationing.", "Author": "Scott Aguiar", "ReviewID": "R1J0XTNYZYCU42", "Overall": "5.0", "Content": "The camera is very user friendly;anyone can master its use by playing with it. It's very durable and has a long battery life. The picture quality can be adjusted to achieve an even greater quality of picture. The auto focus feature enhances your ability to shoot your desired target. The Optical Zoom allows you to take close up pictures and to see long distance targets much closer and with great detail. Finally, the camera is nice looking, sleek, and beautifully colored.They should send me a new one for free since I provided such a great review and recommendation.", "Date": "May 25, 2012"}, {"Title": "Great except for 1 thing!! Where's the manual?!?", "Author": "Dennis Owen \"Mulano\"", "ReviewID": "R1Q9O3N9ED84SH", "Overall": "4.0", "Content": "The camera works great and alot of the stuff is self-explanatory.If you play with it for awhile you can figure out how to use it and discover alot of features. I didn't know I can do videos as well which is a plus because that is what I was looking for!! Guaranteed a good bang for your buck! The only disappointment was not receiving a manual for the camera. I received a manual on a warranty but not for the instructions on how to operate the camera.Overall,it's pretty good and I don't have any hard feelings toward the seller,except that 1 error.", "Date": "May 1, 2012"}, {"Title": "In Response to all the 1 Star Reviews!", "Author": "Mario Borgatti \"dunesailor\"", "ReviewID": "R14OB123NJML4L", "Overall": "5.0", "Content": "I'm going to post several images subtitled \"Response to 1 Star Reviews\" of the Canon PowerShot A300IS. The bad reviews referring to the A3000IS picture quality are unknown to this owner. The examples of the posted photos were taken under a wide range of conditions and directly address the issues which some reviewers seem to be have concerns with, e.g., close-ups, low light, focus and color aberrations and some other problems. Please keep in mind that the images posted by Amazon are compressed and do not represent the images in their highest detail, even so, they are quite acceptable. Undoubtedly, there are superior cameras available, but In my opinion this camera is a gem, especially when one considers the price for the package.", "Date": "March 11, 2012"}, {"Title": "Awesome camera for its price", "Author": "XYZ", "ReviewID": "RKY3PVBQ7LFCO", "Overall": "5.0", "Content": "For its price, this is a very good camera. I don't know much about photography but this camera fits the now-and-then needs of a non-photographer extremely well (gives decent quality pics and is easy to handle). Light weight, good battery life, slot for memory card are some other advantages.", "Date": "February 15, 2012"}, {"Title": "this camera is awesome!", "Author": "Passbyguy", "ReviewID": "R25UUR3YDNXWGV", "Overall": "5.0", "Content": "I bought this camera as a replacement of my other one that broke. Its tough sturdy and everything my previous camera was. Now I have to try and keep it away from my band mates.", "Date": "February 7, 2012"}, {"Title": "Only received the box!!!!!!!", "Author": "J. Bauer \"Ginkgonkempo\"", "ReviewID": "RRQNK598R9VB6", "Overall": "5.0", "Content": "My wife ordered this for me on behalf of my kids for Christmas. To their surprise and mine, I opened it up to find a box containing not one, but two sets of cables, and no camera. I have contacted the seller and will update this review once they have made it right.Update: two days after my initial email to Amazon, I have my camera and our first purchase was refunded. Amazing customer service from Amazon, I am blown away, oh and the camera is pretty nice too!!", "Date": "December 25, 2011"}, {"Title": "it works.", "Author": "meganissima", "ReviewID": "RB5HKP0AX1UW4", "Overall": "4.0", "Content": "The camera seems to collect dust under the screen and doesn't hold a charge for more than a day.  The pictures displayed on the screen are a little bit fuzzy but when viewed on the computer, they appear just fine.  This is a good little point-and-shoot camera that takes average pictures.  Has a great zoom.  Sometimes getting it to focus on what you want your subject to be if it's not in the center of the view is difficult and a bit frustrating but no other complaints.  If you want a camera that you don't mind charging the night before each use, it's a great option.  And try to keep it in a case and not in a pocket to keep the dust and other particles from obstructing your camera's picture-taking ability.", "Date": "December 5, 2011"}, {"Title": "Great Camera", "Author": "Muru Venkat", "ReviewID": "RMSE7NJJ6JBN9", "Overall": "5.0", "Content": "Great camera with excellent flash performance.  I wanted to buy a cheap \"use and throw\" camera for travel and when Amazon sold this camera for $79 with 4GB card and case, I could not pass up.  I was anticipating average performance from this little shooter but I was pleasantly surprised by this camera. Real colors (something rare in a canon), good exposure and excellent flash performance. Idea travel camera!!", "Date": "December 1, 2011"}, {"Title": "Canon Powershot", "Author": "Fred G Andrews", "ReviewID": "R274I8OYT6UWVK", "Overall": "4.0", "Content": "This is my first digital camera after years of using 35mm SLR cameras. I wanted light, easy, low-light and fast \"shutter\", and an optical zoom, that would allow me to take some decent snaps. The camera was easy to set up. Luckily I had ordered a memory card since the camera has no resident memory - that was not clear in the description of the camera.It is lightweight and the optical zoom is sufficient for most situations. I am not used to looking at a screen to compose my pics and the outdoor glare occasionally made viewing the image on the screen impossible. I was also a bit dismayed at how long it took to freeze the frame between pressing the button to shoot and the actual picture being captured. The camera is constantly refocusing with even the slightest movement on my part.I did get some good snaps but others were a bit blurred if there was movement by the object being pictured. This may be a learning curve issue for me. I will hopefully improve. Overall I recommend this camera.", "Date": "October 18, 2011"}, {"Title": "canon powershot, a sure good buy", "Author": "Irene Soderberg", "ReviewID": "R1JUPXGQ6T0LV2", "Overall": "4.0", "Content": "it's a decent camera, easy to use and it takes surprisingly good pictures.i'd recommend this for any person that wants a simple camera.", "Date": "October 15, 2011"}, {"Title": "Very Nice Camera for the Price", "Author": "BigKHuna", "ReviewID": "R1DQ0KYIQJUBGM", "Overall": "4.0", "Content": "Very nice camera for the price. Excellent pictures and video. Easy to use. Easy to transfer to computer. I recommend this camera.", "Date": "October 6, 2011"}, {"Title": "Awesome!", "Author": "GOblivion", "ReviewID": "R30ZIU7X6E832", "Overall": "5.0", "Content": "Not only was it a great price, but it's a great camera.  Compact and yet full of features.  It takes great pictures and video.  I couldn't be happier with a digital camera.  It's perfect for capturing my children's moments.", "Date": "September 30, 2011"}, {"Title": "totally disappointed", "Author": "Dioz", "ReviewID": "R38L9ZFD9LAA2T", "Overall": "1.0", "Content": "Totally disappointed. Lens error 03 was noted after 2 time of usage. Camera low light photo were pretty bad. Daylight photo were just ok, slightly washed out.", "Date": "September 29, 2011"}, {"Title": "Perfect for on the go", "Author": "Working Mom", "ReviewID": "R26VMD5VHMFMNS", "Overall": "5.0", "Content": "I was on my 3rd Sony Cybershot and looking for a camera for my son in college when I ran across an amazing deal for the Canon Powershot and after reading great reviews I gave it a try. After receiving it I decided to keep the Canon and gave my $250.00 Sony Cybershot to my son. I was not disappointed - the Canon is perfect for my use. I always have my camera with me to take snap shots of my kids or nice sky shots - this camera is great for both. It is compact and lightweight, really easy to use and takes great pictures. It works much better in artifical light than the Sony Cybershot. The video quality is good as well, it can easily hold its own against the pricier models. Shutter speed is a little slow but not significantly enough to take away from the overall 5 star rating I gave this camera. The pictures print out in great quality with my inexpensive color printer. If you like to take pictures anywhere, anytime - this is the model to go with.", "Date": "August 9, 2011"}, {"Title": "This is a great camera!", "Author": "Madalynn", "ReviewID": "R33XA71YXSPGJT", "Overall": "5.0", "Content": "I ordered this camera when it was on a big sale, and I'm sure I will never regret this purchase. I have had it for upwards of 3 months, and during that time I have taken thousands of pictures. They all have good picture quality, and I am more than satisfied with them. One of the things this camera does very well is closeups. It focuses quickly and I love how my closeups turn out. :)The battery life is very long; it can last for 3-4 days of constant use and picture replay. It recharges in only 2-3 hours. I also love the video quality on this camera, as well as the sound. Not to mention how sharp the camera looks! It is also pretty tough; mine has fallen twice ;/, but it still works as well as ever! I would definitely recommend this to a friend. :)", "Date": "August 7, 2011"}, {"Title": "Canon does it again", "Author": "RLAR", "ReviewID": "R1BWWHYKI1K9AE", "Overall": "5.0", "Content": "We were going on our honeymoon and needed a good camera quick.  I reviewed a lot of reviews on a lot of different cameras.  Most of all, I wanted a camera that would fit in my pocket, but at the same time take excellent pictures.  I read reviews until I was blue in the face.  My son spoke to a good friend of his at church that repairs cameras and the only cameras he recommended were Canon's.  Well, Amazon had this particular Canon on sale - a $260 camera for $79.Well, by the time I read all the reviews and got back to this camera, there were only 3 left, so I bought it.  We went to Alaska on the Holland America cruise lines and took 250 pictures and had them developed today.  WOW! They are beautiful!  We are so impressed with the quality of the pictures-close up, zoomed, far away, you name it, it took excellent pictures.  I am very impressed with the camera and with Amazon's pricing.  I will definitely return to buy other products from Amazon.  God bless", "Date": "July 28, 2011"}, {"Title": "SWEET AND DEPENDABLE", "Author": "C. J. SCHMITT", "ReviewID": "R3T1RWL5R1TDUL", "Overall": "5.0", "Content": "Excellent camera in every way.  Good looks, very efficient operation, and exceptional value from Amazon.  Took more than 1300 pictures in a two-week period of family and vacation activities and was very pleased with the camera's performance and the picture quality.  Purchased one also for my wife and she experienced similar results in all aspects.", "Date": "July 28, 2011"}, {"Title": "Good Camera!", "Author": "San", "ReviewID": "RR7LLQYBDGFH9", "Overall": "5.0", "Content": "The Camera is good! Picture quality not good on screen but excellent on Computer. Nice and easy to use plus Cheap!!", "Date": "July 27, 2011"}, {"Title": "Good enough backup/ starter camera for kids", "Author": "treezilla", "ReviewID": "R36XK2KT5E2TIE", "Overall": "4.0", "Content": "For the price, they make great gifts for someone on their first camera. I thought the battery door was a bit flimsy and night shots were not great -- but for what it is, good enough. daytime shots were great. don't expect this thing to do any wonders and you'll be happy.", "Date": "July 26, 2011"}, {"Title": "The perfect beginners camera", "Author": "Kirk", "ReviewID": "R3BBJKNDPHP1KZ", "Overall": "5.0", "Content": "I had been looking for a camera that takes nice pictures and videos also, yet compac.  This is the perfect camera.", "Date": "July 26, 2011"}, {"Title": "I love this camera", "Author": "Daniel Lopes", "ReviewID": "R3SCI4RKKVGOWV", "Overall": "5.0", "Content": "very happy to get my 1st digital camera that works great, still learning how to do things but it will come with time.", "Date": "July 25, 2011"}, {"Title": "Easy to use, but disappointing quality and speed", "Author": "CaptainBasic", "ReviewID": "R160ZLZGT21H8", "Overall": "3.0", "Content": "This is a nice camera, but it is VERY slow. Also has trouble focusing in complicated environments and makes strange choices on preset scene options. Compared to my last Cannon SD1300IS this thing is like a toy.  Nice camera, but not up to what I normally expect from Cannon.", "Date": "July 25, 2011"}, {"Title": "good camera at a great price", "Author": "Lyle G. Lane", "ReviewID": "R2P1YRKJNV5AFC", "Overall": "5.0", "Content": "I have been looking for a good camera for a long time especially one from a noted manufaturer like Cannon. Thanks Cannon.", "Date": "July 24, 2011"}, {"Title": "Great camera for the challenged", "Author": "MT", "ReviewID": "R246HVYIZBNIN7", "Overall": "5.0", "Content": "This camera is great. I have always been challenged by digital cameras, don't know why I own several computers, but this little one has changed all that. The instuctions/setup is super easy, the pictures are great and your subjects don't have what for a couple of seconds before they move to get great shots. 3 very active grandchildren have had very clear pictures taken. It has been fun to take them as well, and with not the least bit of frustration. Uploading onto the computer was very easy, the software comes with a very nice archiving system that is easy to format. Would recommend to anyone who has given up trying to take nice pictures with digital cameras.", "Date": "July 24, 2011"}, {"Title": "Great at $79 Amazon June 2012", "Author": "R. Hogner \"Dr. Bob\"", "ReviewID": "R3FZH67NBKFDVE", "Overall": "5.0", "Content": "This was a great deal. A colleague referred it to me after he bought his from Amazon at $78.Price creeeeeep?", "Date": "July 22, 2011"}, {"Title": "Excellent", "Author": "Grant A. Batson \"guitar maker\"", "ReviewID": "R23PM4S6MUVRLE", "Overall": "5.0", "Content": "Price was great and the quality of these little cameras gets better and better.  I bought this one for my 12yr old daughter's b-day and immediately wanted to trade with her.  It outperforms so many other cameras, in my opinion... for a point and shoot, that is.", "Date": "July 22, 2011"}, {"Title": "Not bad for a little camera.", "Author": "DaleN", "ReviewID": "R175UQ0UU4J9L6", "Overall": "3.0", "Content": "For a little camera it comes with alot of bells and whistles. Takes clear shots and is east to upload to computer.", "Date": "July 18, 2011"}, {"Title": "Great Camera", "Author": "Jessica Wheelis", "ReviewID": "R12NJYVBL8NMGA", "Overall": "5.0", "Content": "Very happy with my purchase. Price was very reasonable and size works great to carry in my purse. Glad I made the purchase.", "Date": "July 17, 2011"}, {"Title": "picture quality saves it", "Author": "R. Robinson", "ReviewID": "R381BRR43JE8FF", "Overall": "3.0", "Content": "This must be near the end of the line in terms of this design model and it's upgrades and I am sorry I did not know it sooner. The Canon Powershot A3000IS is a little adjust-a-dial, four way toggle button camera that looks remarkably like an old Vivitar which came free with a printer 7 years ago, but the canon is bigger.  I think of it as almost manual in that it is frustratingly slow in the most automatic settings, and to use the others I don't have to be a photographer but I do have to be an analyst with experience for how each setting works best compared to each other and under what conditions. Sadly the moment is often lost, even with the children/pets setting.  The LCD screen does not reflect the color of the image accurately, which is a good thing. The stabilization feature seems to work better with a moving subject than a shaky hand - on our trip a number of the outdoor photos I took while milling around the group of people had to be ditched for lack of focus but the dancing shots and the snaps my kids took out of the car window driving home were surprisingly clear.The camera arrived just before a wedding so I brought it to the garden reception which I would think is tricky lighting - it did very well there. Using the zoom I caught a photographer with my kids and later sent him the pic - he replied that it looked like a postcard, minus the doofus with the camera. :) The shades of light in the pond and leaves looked invitingly beautiful while keeping skin tones natural. Conversely it also took some pleasant photos of people gathered in the shade of the tents despite a bright sunny background that was impossible to eliminate.In conclusion, I will be needing to spend more money on another camera sooner than I wanted to, but there is a good chance I will look closely at other offerings by Canon because the quality in the shots is really very pleasant.", "Date": "July 15, 2011"}, {"Title": "Good camera for its price", "Author": "A. P. R", "ReviewID": "RRNY2OLPGF3O9", "Overall": "4.0", "Content": "I thought the picture quality was going to be better. However, it is not bad at all. If you want to use this camera for trips or other non professional photography related events this is a very good and affordable camera.", "Date": "July 15, 2011"}, {"Title": "Canon Powershot A3000IS", "Author": "MCB 74 \"\"Dan\"\"", "ReviewID": "R18Y708031K0T4", "Overall": "5.0", "Content": "This is a great camara for close-up photos that I use for selling on Ebay.  I also use the 1300IS and it's the same way---sharp clear close-ups.  I also use it for outside and distance photos and it is a fine snapshot camara.I have had several digital camaras over the years: I've been on Ebay since 1998---and these two camaras are the best close-up camaras I've owned, out of perhaps eight camaras.", "Date": "July 15, 2011"}, {"Title": "Great camera for the price", "Author": "Joel E. Boydston", "ReviewID": "R3S5BI5AQ9GZHX", "Overall": "4.0", "Content": "This Canon is priced right and has most of the features I required. It's a little bulkier than my previous Nikon Coolpix camera, but still fits comfortably in my pants pocket (for less than 1/3 the price!) And, although the on screen selection icons and menu progressions aren't very intuitive and take a little getting used to, this camera can be used to create superb photos. I can easily recommend it for someone looking to buy an inexpensive, full-featured camera. I'd buy it again with no concerns...", "Date": "July 15, 2011"}, {"Title": "Great Camera", "Author": "c", "ReviewID": "R33OB26PMFA8JP", "Overall": "5.0", "Content": "Great camera! Haven't figured out all the options but I am looking forward to learning. Takes great pictures as true to the natural colors as possible even with the flash. Does have a slight delay when taking a picture but faster than the rest I have used. I would recommend to anyone! In fact will be purchasing one for Christmas for a family member I liked it so much!", "Date": "July 12, 2011"}, {"Title": "Better than what I had expected", "Author": "Hitesh Khandelwal", "ReviewID": "R91R4HKQBM91E", "Overall": "5.0", "Content": "I was looking for some cheap digital camera to purchase and after some surveying I ended with this. I would recommend this camera to anyone with tight budget (< $100). It is slick so that you can keep it inside your jeans pocket, and just works the way it is supposed to work. Quality is good in day light and fine during night.", "Date": "July 11, 2011"}, {"Title": "great", "Author": "Allison \"AKQ\"", "ReviewID": "RUJYVNRSBSBO5", "Overall": "5.0", "Content": "this item is a great item it was on sale its surely worth the money, every las penny of money spent its worth, the picture quality is awesome, takes great clear pictures and videos as well", "Date": "July 9, 2011"}, {"Title": "I got a great price on this at Wallyland, but I'm not happy....", "Author": "S. vaneck", "ReviewID": "R2O3WGMWM3MKE9", "Overall": "1.0", "Content": "This recently replaced a Kodak easyshare that was comparable in price but is no longer made.  It is worse in almost every way.  It is slightly bigger.  It is harder to use.  The pictures are worse quality, and are typically pretty grainy.  Honestly, I doubt this camera takes better pictures than the cheap digital camera I had 6 years ago.  At 10 MP, the digital zoom should actually be functional, but the pictures become very grainy almost instantly.  The battery needs to be removed to charge it (unlike the older easyshare).  When downloading picture the camera needs to be turned on, so if it is left plugged in, the battery gets drained dry.  It is much slower.  It lacks some nice features that my old camera had.  As someone else pointed out, the focusing is schizophrenic.  It even feels cheap.  Yeah, it does have a manual mode where I probably have more control, but that really isn't a feature I want from a cameral like this especially given the end result.Yeah, maybe I'm being overcritical of this camera, but at the end of the day, it is slow and takes marginal pictures.", "Date": "July 9, 2011"}, {"Title": "Very pleased with Canon PS A3000IS", "Author": "Jay", "ReviewID": "R2DMB8JZLSB6ZW", "Overall": "5.0", "Content": "This is my third Canon.  The first ELF was a work camera that travled all of the country.  The second PowerShot worked great and was given to my wife whose Sony camera died after 20 years.  So far the A3000IS has performed flawlessly.  You can see the video screen easily in bright sunshine.  The 4x telephoto lense and the electronic photo lense is fantastic and I've taken some amazing shots with both.  I bought this camera on sale for $79.  What a bargain.", "Date": "July 7, 2011"}, {"Title": "good camera", "Author": "Matthew", "ReviewID": "R35PV5QKQC0DRP", "Overall": "4.0", "Content": "This camera was a great price for the item. The only problem we had with purchasing this package was that an SD card was not included. These days that seems strange. However, the camera is great, pic quality is beautiful.", "Date": "July 7, 2011"}, {"Title": "its okay but...", "Author": "Virus", "ReviewID": "R55R7ZMWJMYN0", "Overall": "3.0", "Content": "VEry nice product, very nice picture and videos and sound and compact and big screen and several options and all. Battery lifetime was pretty decent in my tests, evebn though there was no viewfinder to save some energy.My ONLY critique is that the optical zoom does not work when shooting a movie. Only a lower quality digital zoom exists but we cannot benefit the full function of the zooming experience, even if its an only 4X zooming. For this reason, I gave it to my brother as a present, cause the price/quality is pretty decent.", "Date": "July 7, 2011"}, {"Title": "surprisingly good photos and easy to use", "Author": "Constance L Darner", "ReviewID": "RZ6WV28RGIPAU", "Overall": "4.0", "Content": "I needed a new camera but my old one still worked so I bought this for $39.00. $79.00 sale price less $40.00 if you open a charge account. How could I go wrong? Took hundreds of photos on Alaska trip and they came out great!!! I keep learning new things about the camera but when you set it for \"easy\" it is really easy and you don't have to know much more. Highly recommend.", "Date": "July 6, 2011"}, {"Title": "Good Point and Shoot", "Author": "Senlin", "ReviewID": "R3IDQX0QYEB3UW", "Overall": "4.0", "Content": "This is a good camera for the money. It is so small it fits in a cigarette case I no longer use (yay), and although liteweight, it feels sturdy and well put together. It is a little slow on shutter speed so don't expect any successful candid shots unless the subject is asleep.The pix come out a bit light; maybe I can adjust that somehow. The user guide is bare bones. Even so, I like the camera and would recommend it for point and shoot users.I personally miss having a viewfinder. I guess they are slowly going obsolete on lower-end cameras. It comes with a battery charger and it holds the charge well and the screen is large enough to work with. BUT be warned, you need to buy a card separately as one is not included, which makes no sense except to get more moeny for somebody else, who knows.I got a good discount and paid hardly anything for it. Amazon Customer Service is DA BOMB and helped me work through a tiny issue by issuing a gift card. So buy it. It's a good deal.", "Date": "July 6, 2011"}, {"Title": "Great point-and-shoot, with fast time between flashes", "Author": "Jon", "ReviewID": "R2897GZMW8RO8W", "Overall": "4.0", "Content": "I bought this as a gift for my girlfriend and it's been great! She loves the camera. I'm pleased with the performance for this class of device. The thing that won me over was reading on here about the fast time between flash shots versus others in the class. I'll agree that 5 seconds is way better than 10! Overall, great camera for the money.", "Date": "July 5, 2011"}, {"Title": "Perfect first camera for a kid", "Author": "J. Johns \"Music Fan\"", "ReviewID": "R3M163Q5FGAXR0", "Overall": "5.0", "Content": "I bought this camera, the 6th Canon point and shoot, for my 6 year old daughter.  She turns seven in a few months and I wanted an inexpensive camera for her to learn on.  I tried it when it arraived and it exceeded my expectations.  With zoom and image stabilization it can't be beat by any other brand/model in it's price range.  Combined with the free memory card and case, I couldn't be happier.  It seems fairly sturdy and not so small that it would be easy to drop like our Elphs.", "Date": "July 5, 2011"}, {"Title": "Broken upon arrival.", "Author": "scott johnson", "ReviewID": "R3IOJRPL0QXETS", "Overall": "3.0", "Content": "The camera was broken within a few pictures.  I called Canon Customer Service and they asked me to send only the body of the camera back for repair or replacement.I mailed in the camera body and revieved the replacement in about a week, I just sent it regular mail so that was great service.The camera they sent back was not just the camera body but a new camera with battery and everything.  The only problem was that it was not a new camera but a repaired return.", "Date": "July 5, 2011"}, {"Title": "Very Good Value", "Author": "K.O. \"K.O.\"", "ReviewID": "R3A30T4S61Q3E", "Overall": "4.0", "Content": "This camera is certainly adequate for what we needed it for - something extremely portable for beach and pool trips with family when we don't want to lug around the big DSLR, good picture quality, good 4x optical zoom, and Canon quality and ease of setup.  The ability to use the optical zoom while shooting video is an added bonus, considering that our prior Canon A520 point-and-shoot did not have that ability [...]We also like the rechargeable Lithium-Ion battery instead of the 2AA's our old point and shoot needed.The price was also great - we paid $79 and we had Amazon credits, so the final price ended up being $17 with one-day shipping and no sales tax!We don't like the slow 1fps continuous shooting (the A520 had better fps in Continuous mode), the 2-3 sec delay between shots in Auto mode, and the 3-4 sec delay between flash shots.  The slowness is really the only drawback.Overall a very good point-and-shoot for the price.", "Date": "July 2, 2011"}, {"Title": "Fantastic camera!", "Author": "jomamavt", "ReviewID": "R5PAEH6ISLA3V", "Overall": "5.0", "Content": "My last camera was an HP from 2002. What a difference! I was anxious about the set up because I have vision problems but it is so clear and easy. EVERY SHOT I have taken has brought me joy!Thank you everyone for your reviews. They helped me to take up this hobby again and I can't explain how wonderful it is to work with photos again!", "Date": "July 2, 2011"}, {"Title": "Canon PowerShot A3000IS 10 MP Digital Camera with 4x Optical Image Stabilized Zoom and 2.7-Inch LCD", "Author": "Wayne B. Hodges \"WBH\"", "ReviewID": "R3OZ98QBL8MLKP", "Overall": "5.0", "Content": "I needed a compact to supplement by Canon Digital SLR when I need to take shots without the bulk.Locally I viewed compacts in various camera stores to get an idea of what is available and prices etc.I researched online and always end up on Amazon.com, I am a long standing customer, not a smooth ride with Amazon, particularly in you reside elsewhere in the World some itedms are not available online for some reason or another.I immediately saw this camera priced vry nicely and looked at the same one in camera stores and saw that the cost was higher locally.so after checking the specs and features I made the purchase.It arrived.I haven't been dissatisfied with my purchase and I am continually amazed by what is featured in this Canon Comapct.At the moment I am still on a learning curve, however I have taken many different types of pics and I am more than satisfied with the result.Very happy from Australia.", "Date": "July 1, 2011"}, {"Title": "This Camera is a Treat", "Author": "J. Jones \"Telescoper\"", "ReviewID": "R3I7JPGFAT2986", "Overall": "5.0", "Content": "Since it is just what I was looking for (and cheap - as in inexpensive) to tide me over til my next DSLR. I'm delighted with this great little picture taker. I'd say image stabilization is mandatory with these little cameras (and it has a special setting for kids/pets!). The movie-taking ability is a big plus. Thirty minutes on a 4G and 2 hours on a 16G card.", "Date": "June 30, 2011"}, {"Title": "Great, affordable camera!", "Author": "Amy C Cromwell", "ReviewID": "R3C054DLB48L1Q", "Overall": "5.0", "Content": "After years of striking out with cameras, I have finally found one I love! Extremely easy to use, as well as lightweight and affordable, this camera is sure to please", "Date": "June 29, 2011"}, {"Title": "Nice package for the money", "Author": "A. Bodao", "ReviewID": "R2C8YE2CGP422L", "Overall": "4.0", "Content": "I Needed one day delivery on this camera and Amazon came through-again. I've had \"Amazon Prime\"I for 3 years now and have only used one day delivery twice. Both times because of foul-ups at stores locally and both times Amazon delivered as promised.Thanks Amazon.Now the Camera. The picture quality from this camera turned out quite good. It does very good in bright sun, as well as overcast conditions. And indoor, low light variations it was adequate, meaning, out of 10 shots 1 or 2 were underexposed. Auto focus worked well in most conditions. Video produced good color, good focus, and clear videos.Pros:Image quality. (In good light)Image Stabilization2.7 LCDSub $100. priceCons:Shot to shot times are poor-about 2 seconds. If you need something faster, don'tget this camera.", "Date": "June 28, 2011"}, {"Title": "inexpensive, easy to use", "Author": "Amy Henry", "ReviewID": "RZ5ZV0A4FJP19", "Overall": "4.0", "Content": "I've gone through several digital cameras, as I guess I'm rough with them.  Thus, I'm not spending big money any more on one.  Instead, I figured I'd look for a decent cheapie that will get me through the summer.  This one, which I got for $80 plus the free case and memory card was a great deal.  I read all the reviews and found that most were in agreement that it wasn't the best and it wasn't the worst.  Good enough!I've used it several times now and I really like it.PROS:It's easy to navigate the features, and I took both stills and two videos with it.  Picture quality was excellent.  It's easy to change between flash and none, easy to change the style settings, and even easier just to leave it on AUTO and let it focus. The zoom feature lets you adjust zoom while focusing, which is kind of cool (my last one didn't do that). Also, playback is a different style than most DC's and is very convenient-on my old one it was very easy to delete when you wished to playback.  Not cool!CONS:The only things that bother me are that it is so light, it feels like it may break easily.  As long as I don't drop it, I should be fine.  Also, the auto shutoff feature shuts it off a bit too soon for me, so I'm looking to adjust that.I'm not expecting much, so I'll be delighted if this works into the fall.  Will update my review then!", "Date": "June 27, 2011"}, {"Title": "Passable", "Author": "VLR", "ReviewID": "R32KETDTQHNLYO", "Overall": "3.0", "Content": "I bought this camera because photos from my \"old\" Canon Power Shot A40 could not be downloaded to my Windows 7 PC and Canon does not have a driver! The new camera was less expensive and is not nearly the quality of the A40. Canon has now told me I can buy a card reader and that will fix the problem - I'll give it a try and if it works the \"new\" camera will just be used as a back-up", "Date": "June 24, 2011"}, {"Title": "Optimal for everyday use.", "Author": "gpatama", "ReviewID": "R1G1ID69T9TYVE", "Overall": "4.0", "Content": "Good:- Reasonable price with promotions ( camera bag and SD card)- The picture quality is acceptable for non-serious photographer.  It provide a bit better than my 2 years old 10 megapixel camera which was 2 times price.- I prefer SD card over micro SD because most of standard computer have a slot so no worry  when forget bringing sync cable.Should be better:- The plastic flip cap of battery and SD card slot seem to easily broken.- Auto focus mode is quite slow espacially in poor light condition.", "Date": "June 21, 2011"}, {"Title": "Easy Use with Good Quality", "Author": "J. Zhang \"helen\"", "ReviewID": "R2LJPFFZ32OLA3", "Overall": "5.0", "Content": "This digital camera is light and small, very suitable for daily carry and use. I feel its picture quality is good enough for a non-professional. In particular, I love its battery, which can keep very long time after charging.", "Date": "June 21, 2011"}, {"Title": "Cheap but...", "Author": "Axi", "ReviewID": "R2ILQ1YEXEYEH9", "Overall": "3.0", "Content": "Got this camera because I wanted to save money but pretty soon I've found that it's photo quality when it comes to poor light conditions or moving objects the photos are not focused and very grainy.Another minor problem with the video is that the zoom is digital and when you use it the picture's quality goes down.Overall, this is not the best camera for you if you want a camera which has better quality than the average mobile phone camera.", "Date": "June 19, 2011"}, {"Title": "Love, Love, Love!!!", "Author": "Grannysaver", "ReviewID": "R2KPKA7LWDD92N", "Overall": "5.0", "Content": "I love this camera.  Very easy to use.  However, I did wish it would come with a memory card.  Takes beautiful pictures.", "Date": "June 15, 2011"}, {"Title": "camera", "Author": "Hope", "ReviewID": "RWBMCTXVMVSQE", "Overall": "4.0", "Content": "Very nice camera for the money... very small and compact to take along anywhere. Nice photo quality and ease of use", "Date": "June 12, 2011"}, {"Title": "Great, would be better with a view finder...", "Author": "Brenna", "ReviewID": "R13FA4SPWXCO8Y", "Overall": "4.0", "Content": "I really enjoy this camera! My first and current camera was a six year old canon powershot I got as a graduation present years ago, and I've got to say, the powershot has come far! While I do miss the viewfinder (it makes my hand steadier) the picture quality is great, and 10mpx for $89 is a total steal! It's super lightweight and I love not having to carry out the double A's anymore with the rechargable lithium battery. It's great picture quality, and my photographer best friend with a DSLR agrees that this camera is a great deal and definitely more than acceptable in the quality of the image for the price.", "Date": "June 11, 2011"}, {"Title": "Mother's Day Gift", "Author": "Tana Matos", "ReviewID": "R2PWOPN8EA4E5Y", "Overall": "4.0", "Content": "I bought this camera for my mom as a Mother's Day gift. So far she loves the camera and she has no complaints.", "Date": "June 2, 2011"}, {"Title": "Great Camera!!", "Author": "Ricky", "ReviewID": "R292Q8B89MBL80", "Overall": "4.0", "Content": "This ultra light weight digital camera has anything you would ever want for every day digital photography. It is light-weight,slim, has features that other digital camera's do not have such as auto red eye correction when taking pictures. The camera has an amazing macro-focus so than digital pictures look more professional, an addition to that the camera is pretty easy to use, like all cameras, it comes with a usb, strap, and sometimes with a bag. I have been through at least 4 cameras. This would have to be the best through them all. In order I went through kodak,sony, cannon, and this is the camera I am on. If you have red eye in all of your pictures like I do. I would recommend this camera for you since it corrects it once you have taken the picture.", "Date": "May 30, 2011"}, {"Title": "Very Disappointed-Loved my A550, thought this would be nice upgrade--i was wrong", "Author": "Elizabeth Brown", "ReviewID": "R1H69KO5GPHO5O", "Overall": "1.0", "Content": "I purchased this as an upgrade for my well worn Canon A550.  There is nothing i like about this camera-i understand that this is an inexpensive point and shoot--so was my A550 but the quality of pics is awful--whether in auto, any of the pre-set modes or manual. the only time the pics are decent is if i'm outside in bright daylight with sun at my back--indoor pics are just terrible, regardless of the setting.  the amount of time from taking the picture to it being saved is painfully slow. i don't expect it to be even remotely like an SLR, but again, i was thinking it would be at least one step up from my A550--not 10 steps below.  i'm already having lens issues after about 100 pictures.  compared to the A550, the focus buttons are awkward and not one-hand usage friendly.i will be trashing this camera and looking for something else-i will be searching out other manufacturers because of this camera---", "Date": "December 25, 2010"}, {"Title": "Great little camera", "Author": "George Botkin", "ReviewID": "R25OX8IZEJKX04", "Overall": "4.0", "Content": "Fast boot time and shutter responce was great. Gave it to Mother in law for a big trip and she loved it.", "Date": "May 30, 2011"}, {"Title": "TINY LITTLE POWER !!!", "Author": "Yuva", "ReviewID": "R2L6ZW5WQPCQDG", "Overall": "4.0", "Content": "Just recently got this item in the mail.I have to say I am impressed with the promptness from time of ordering to time of recieving the item. I am an international customer and to recieve it in less than two weeks is really astounding! So kudos to the company for that!On a more technical side I am a previous canon owner as well. So as per usual I was impressed with the power that this little guy was packing! Obviously you can't expect SLR quality with a pocket camera, but it takes some pretty good shots and the learning curve for the camera is a matter of minutes.The only downside is the CMOS sensor. In poor lighting conditions, the pictures come out a bit fuzzy. With respect to price per what you getting, this is a pretty good camera. If you have the extra cash to dish out however, then you can check the Sony Cybershot!", "Date": "May 10, 2011"}, {"Title": "Not good for fast picture taking or moving subjects!", "Author": "Mary M. \"MEM\"", "ReviewID": "R207P3MD876GZ7", "Overall": "2.0", "Content": "My old Kodak Easyshare Z760 finally bit the dust after many years of loyal service and I was excited to buy another camera. I did my research--consumer reports rated this product as a best buy and I found that several private individuals rated it very good as well. I am not a professional photographer--just a grandma that likes to take LOTS of pictures of her fast-moving 3 year old granddaughter! And that was the first problem I encountered. In half of my photos she is a blur. The background is clear, but she isn't. If she is sitting still, I can get a great picture. But if she so much as moves a hand, then that hand is a blur. The second issue has to do with processing speed. I frequently like to take several pictures in a row--click, click, click. My old Kodak could do that, but my new powershot can not. It takes a good 4 seconds between shots to process and get ready again. I know that may sound fast, but it's not, really. A lot can happen in 4 seconds, especially with kids! And the last of my complaints--the camera kept blinking the \"shaky camera\" icon at me, meaning I wasn't holding the camera steady. I've never had trouble with that before. My pictures were never blurry, nor did I shake when using the Kodak.All that being said, the camera does take very good pictures when the subject is unmoving and it is easy to use. It is very lightweight, but does have a cheap plasticky feel to it.I am returning the camera and hunting for another Kodak!", "Date": "March 22, 2011"}, {"Title": "Very nice for our needs", "Author": "Alyunya422", "ReviewID": "R3FYYI5TNERI0W", "Overall": "4.0", "Content": "Very nice light camera with good zoom and veryt nice picture quality. The only issue I have with it is that I boutght it of my in-laws and not only they, but even I are confused in the symbols on the botton because they are small and the meaning is not always clear", "Date": "May 9, 2011"}, {"Title": "Excelente producto!", "Author": "JOSE AGUIAR", "ReviewID": "R2L9W6N6XHRLDM", "Overall": "5.0", "Content": "Satisfecho, buen producto para todo consumidor de cámaras digitales de clase baja/media diría yo. Un gusto con tantas fotografías que he tomado.", "Date": "December 23, 2012"}, {"Title": "Arrived malfunctioning; no support", "Author": "J. Timothy Kern \"geriatric rocket rider\"", "ReviewID": "RYP1RXJ8U6P9N", "Overall": "1.0", "Content": "Received A3000IS as a gift, unopened. Looked cute; probably would make a good backup/pocket cam. So I charged up the battery and read the manual. Images would show on the viewfinder, but the camera wouldn't take pictures. Tried online help -- yup, it's wrong. Tried phone support -- yup, it's not working. Got an RMA number and sent it in -- and got an estimate for a $92 flat-rate repair!Called and explained I didn't have the original shipping info. (It was a gift, and we're not talking any more. TMI.) I asked if they'd run the serial number to see if it had been manufactured within the past year. At least that would tell us whether it's under a year old! Couldn't/wouldn't do that. They just sent another estimate.Now, refurb cameras (what they'd send me if I paid $92 for a \"repair\") are selling for $69, and new cameras are going for $95 -- and Canon wants me to send them $92 for an out-of-warranty exchange. THE CAMERA DIDN't WORK RIGHT OUT OF THE BOX. IT's A NEW CAMERA.I've been shooting Canon since the 1970s, sometimes professionally. Never again.", "Date": "January 25, 2012"}, {"Title": "GREAT CAMERA AT A GREAT PRICE", "Author": "LASTCALL", "ReviewID": "R2J5L6U2MJHWP6", "Overall": "5.0", "Content": "AT $71 THIS IS A GREAT CAMERA WITH CASE AND A 4 GIG SDHC CARD.  PICTURES JUST AS GOOD AS MY $700 NIKON D50", "Date": "July 29, 2011"}, {"Title": "Great little P&S; with one caveat", "Author": "Todd", "ReviewID": "R3RFBVUDXEQFDG", "Overall": "5.0", "Content": "I really like this little inexpensive P&S; camera. At it's price point, it's not likely to be beaten in feaures, or lens quality. I keep trying out these inexpensive Canon P&S; cameras, and they're typically terrific save for one flaw.The one flaw that they all seem to suffer from(even the later models with the Digic IV processor) is the inablility to deal with lots of material in the red part of the spectrum. I should note that I'm not a professional, but a relatively serious amateur that has pretty high standards for even the least expensive P&S.;The oversaturation of complex reds in a scene(I use a particular spot in my flower garden to test for resolution of this admittedly hard to deal with subject) shows the camera's limitations. The reds are not so oversaturated that the subject loses all definition, but the reds do lose a lot of sharpness. I should note that macro shots of individual flowers are very sharp and there is little color shifting. They are also resolved to an unexpectedly high degree.Battery life with the Li-ion battery is reasonable. Some people will dismiss this camera because of the proprietary Li-ion battery, but not me. Rechargeable batteries with included charger at this price point are really a plus.Since I'm comparing this camera to other sub xxx dollar cameras, it doesn't warrant removing a star for it's inability to resolve a very complex scene with five different - and brilliantly colored - shades in the red part of the spectrum. No camera(Canon or otherwise) around this price point - and many that are multiples of the cost of the A3000IS - I have tried have a roughly equally difficult time with this scene.In summation, it doesn't get much, if any, better than this for your money spent. I'm hopeful that in time, as the pixel wars die, and that CMOS sensors migrate into the bottom of manufacturer's lines, things will likely change, but for now..this little P&S; is a quite competent camera at a bargain price. Oh, and the video isn't bad either ;)", "Date": "July 13, 2011"}, {"Title": "Promotion??", "Author": "mickey", "ReviewID": "RZ2HKZRWYI8B8", "Overall": "4.0", "Content": "When ordering, you claimed \"instant\" $30 would apply and no s&h; fee..I paid s&h; and there was no $30 (I applied properly)", "Date": "June 23, 2011"}, {"Title": "Good camera", "Author": "K. Abozeeter", "ReviewID": "RX5RNKX9WO9S1", "Overall": "5.0", "Content": "Got this as a gift for my dad.  He's been using it for 3 months and has no complaints.  Probably takes 150 photos a month and uses all of the auto settings.", "Date": "March 31, 2011"}, {"Title": "Pleased", "Author": "Noirlene", "ReviewID": "R2U3V1UHEBOR9B", "Overall": "4.0", "Content": "I bought this camera for my recent trip to Italy.  I wanted something small and light weight.  It worked well.  I should have taken more time prior to the trip to get to know more about it.  I took over 464 pictures.  I was surprised that the battery needed to be charged more often than I had expected.  Luckily I took the charger  and the converter with me", "Date": "December 1, 2010"}, {"Title": "Impossible to get battery back in.", "Author": "Robert \"I wish Audible would provide a better...", "ReviewID": "R11X3UJGAWGPYV", "Overall": "1.0", "Content": "I loved the camera, but it is impossible to get the battery back in.  Canon put an plastic piece of crap to hold the battery in an fit is almost impossible (currently impossible, I can't get it in) to get the battery back in.Don't buy this until they have a decent battery clip.  Too late to return, so I am trashing this camera.  I loved Canon cameras, but no more if they build junk like this.", "Date": "February 24, 2012"}, {"Title": "First Digi Camera", "Author": "bobhc2 \"bob\"", "ReviewID": "R25DVMWYU7OJ01", "Overall": "4.0", "Content": "First time user learning how to operate camera needing to learn more about red eye!  Otherwise so far so good!", "Date": "August 25, 2010"}, {"Title": "Terrible picture quality", "Author": "Mum to 3 boys", "ReviewID": "RJGYRNSDP6QQT", "Overall": "1.0", "Content": "I know how to shoot pictures.  I am not expecting the quality of these pics to be equal with what I would get on my DSLR, but I did expect them to be better than my Blackberry.  The images are not clear, and many of them are a blur thanks to the shutter speed.There are many wonderful reviews on this camera, but I have seen much better photographs from many other lower end point and shoots.", "Date": "May 16, 2011"}, {"Title": "Disappointing", "Author": "dom085", "ReviewID": "RQO6P1RBNRLHO", "Overall": "2.0", "Content": "Pictures were terribly noisy, camera seems to rely heavily on high ISO's to take a picture. Couldn't stand the graininess, looks like photos are printed on sandpaper.The lousy thing focuses worse than a kid with ADD, and takes forever to do so. I would hold the shutter halfway down holding the camera as still as a corpse, and it would still take 5 seconds before it satisfied itself with faint blobs of color and beep as if it was ready for Ansel Adams to come over and take his masterpiece. THERE WAS NO REASON IT COULDN'T FOCUS. This pos has cataracts, I swear.Cheap feel to the body. The edges weren't aligned nicely, and chintzy plastic body had unfinished edges. It feels like holding one of those disposable digital cameras with Hannah Montana on it or something that they give away free when you buy a foil balloon or some crap. It probably floats in water.I foolishly rushed in to buy it since it was marked from somewhere in the $200's down to $99. It's not even worth that.I would consider keeping it if I found one on the sidewalk, but only if the trash can was too far away.", "Date": "December 29, 2010"}, {"Title": "Missing a crucial element", "Author": "William Gekas \"Bil Gekas\"", "ReviewID": "R3K3WNGV77V9KZ", "Overall": "1.0", "Content": "I ordered this camera as a gift for  a friend.  I AS NOT INFORMED THAT IT NEEDED  a MEMORY CHIP to make it work.  I ignorantly gave it to my friend but she had to purchase a chip.  Imangine my embarrassmen!  It seems that a firm with the vast experience of Amazon would know to inform customers of a simple fact such as that.  Please pass this along to the policy makers so that somone else may be saved the discomfort of such an omission.  I am a regular customer but I was so mad that I almost deleted Amazon from my browser.  I am over it now but I will certainly shop around before I buy any more technical things from you.BIL GEKAS onedirector1@gmail.com", "Date": "August 1, 2011"}, {"Title": "Og like magic picture rock", "Author": "Brian Connors", "ReviewID": "R3JV0KH3AF8YRV", "Overall": "4.0", "Content": "Og not know much about modern world, and Og scared of tiny little magic picture rock, make paintings that look like Og. So Og go buy one.Og happy, not pay much for magic picture rock. It sort of ugly rock, and Og have trouble holding with one hand -- need four fingers, not much hand grip. Og friend Thag remind Og that Og use two hands for picture rock, though Og still find rock bit awkward. Og walk round town, make rock make pretty paintings. Og note paintings look very pretty, though noisy when very small. Og also appreciate lack of silly picture options that Og know perfectly well how to do on computer. Og disappointed no charge by USB, though, and no webcam. Only so many outlets in Og cave.Og want do more, though, so Og loaded Canon Hack Development Kit on magic picture rock to test more capabilities. Raw pictures look good, bit dark; mess with shutter speed, get painting of stars. Crappy painting, but Og glad it come out at all. Maybe Og play with scripting, use rock for time lapse painting. Og note ImageBrowser software not handle raw files though, wonder what DSLR magic picture rocks use. Og not have clear picture of battery life, since CHDK make battery go byebye fast. Og also not test video, since Og have high-definition magic picture rock for that. (Thag disagree on this point, but Og rock, Og review.)If reader want good, cheap picture rock with good hackability, do lots magic for you. Og have only one question though: why little man in picture rock never run out of paint sticks?", "Date": "March 19, 2011"}, {"Title": "Okay for the price but not a keeper.", "Author": "HappyME", "ReviewID": "R21I9W3R1SWYR7", "Overall": "3.0", "Content": "This is a rather nice little point-and-shoot and an decent value. BUT! There just is no excuse for not having a view finder. I know the low end p&s; cameras don't any more but they should. I found I could adjust to shooting indoors and in high definition settings. But outdoors with a nondescript background, I can't find my subject. It's hit or miss on getting those shots and I hate that.I do like the image stabilization and lithium battery. My previous camera for this application took super shots and had excellent image stabilization. But it was an \"A\" model that required AA batteries. Not only was it heavy but it was constantly \"hungry\".I would keep this except that even being a good deal, it's money I feel I've wasted. If I can't use the camera for all-around casual work, it's just not a bargain at all.If, at some point, I can afford a small Canon camera that does have a view finder, I'll certainly take a close look. Meanwhile, I'll stick with my A570 and lesson learned.", "Date": "May 22, 2011"}], "ProductInfo": {"Price": "$249.99", "Features": "10.0 megapixels, 4x optical zoom, and built-in Optical Image Stabilizer\nLithium-ion battery makes the camera lighter and offers an easy alternative to recharge\nNew scene modes, including Super Vivid and Poster Effect; Smart Auto selects from 18 predefined shooting situations\nLarge, bright 2.7-inch LCD\nCapture images to SD/SDHC memory cards (not included)", "Name": "Canon PowerShot A3000 IS 10 MP Digital Camera with 4x Optical Image Stabilized Zoom and 2.7-Inch LCD", "ImgURL": "http://ecx.images-amazon.com/images/I/4192cojYusL._SX300_.jpg", "ProductID": "B0032JRRWK"}}