{"Reviews": [{"Title": "Love this camera!", "Author": "christine holden", "ReviewID": "RRN6M86QMVHBW", "Overall": "5.0", "Content": "This little camera is perfect for anything you need it for. It has enough settings to capture the right picture at the right time. You cannot go wrong with Panasonic Lumix. I had a pink panasonic Lumix and my bf had it in his pants pocket while we were snow boarding. Needless to say, too many falls and now a broken camera. So I replaced it with a Nikon cool pix. It was an emergency. Horrible camera. So I went and bought me another Panasonic Lumix. This camera has never done me wrong so I bought another one. I will baby this one to the fullest. It takes great photos, has a lot of settings. It also has HD video recorder.", "Date": "October 18, 2010"}, {"Title": "Great camera", "Author": "Amazon Customer \"the admiral\"", "ReviewID": "R10S7BQSCXPAE4", "Overall": "5.0", "Content": "In my search for a competent upgrade from an old Kodak digital camera, I test drove the GE A1455, the Panasonic Lumix DMC-FH1, the HP PW460T, and this camera, the FH3.  The FH3 wins hands down. It was the only one of the bunch that took consistent high quality photos (see my upload of the shot I took of the moon during a morning walk). Definitely pay the extra $20 and go with the FH3 over the FH1. I could not get a sharp image with the FH1. I have reviews posted of each of the other three cameras, but suffice it to say that this one had the best picture and video quality by far.", "Date": "February 24, 2011"}, {"Title": "Lumix FH3 camera", "Author": "Harold Price", "ReviewID": "R2PLYEA5LHD35K", "Overall": "5.0", "Content": "Found this camera very easy to use, well made and small and light weight.Panasonic Lumix DMC-FH3 14.1 MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.7-Inch LCD (Silver)", "Date": "October 19, 2010"}, {"Title": "Not worth the hype", "Author": "Community Home Mortgage Corporation", "ReviewID": "RRB8DPNSJJB5B", "Overall": "1.0", "Content": "I purchased this camera through Amazon and have to say that the performance was horrible.  I do not know if I got a dud or what, but the pictures were not very clear and there was a reddish film over all of the pictures as well.  The colors were not vivid and the lag time from one picture to the next was very slow.  This is not the camera for me at all.", "Date": "March 8, 2011"}, {"Title": "panasonic lumix dmc-fh3 camera", "Author": "thrillofthehunt", "ReviewID": "R2R3LKSNFZC9FB", "Overall": "5.0", "Content": "Being owner/founder of an indoor 3d archery range, makes it is especially important to have a \"GREAT\"camera on my belt to capture the form and grace of our indoor archers while experiencing the excitement of THRILL OF THE HUNT\"; and now i do with the Panasonic Lumix DMC-FH3. I also purchased the optional battery which extends the life of the shots considerably + a nice carrying case (not the magnetic one with the small belt loop capacity).Excellent quality shots, even in very low light. Definately would buy,buy,buy again!Visit THRILL OF THE HUNT @ [...] and see what this camera does for yourself... on the photo gallery tab.", "Date": "March 6, 2011"}, {"Title": "Panasonic Lumix DMC-FH3", "Author": "Charles Mcmullen \"chasman\"", "ReviewID": "R1S0UNW0BO7H0N", "Overall": "5.0", "Content": "I purchased this camera to take pictures of some of my hobbies.  It works great; I had no problem learning how to make adjustments and switching to viewing mode.  I also purchased an extra battery for insurance of taking pictures when I wanted to.  I would recommend this camera with no problem. The auto adjustment feature takes a lot of guess work out of taking pictures.  It is just what I needed.", "Date": "December 15, 2010"}, {"Title": "terrible  camera", "Author": "Portland", "ReviewID": "R2AQMDXWZR9OA6", "Overall": "1.0", "Content": "I purchased this camera through Amazon to replace an older, cheaper Fuji I'd misplaced. The picture-taking ability of this camera is horrible. Some random shots may be be vivid but overall, the quality of clarity and color no way came close to other cameras I've used. I've tried shooting on auto as well as every possible custom setting but to no avail. I'v spent hours trying to resolve the problem with Panasonic C/S. They ultimately replaced the camera with a similar model but the replacement is equally pathetic. They refused to credit me with any of my purchase cost because more than 3 months had elapsed since purchase date. I don't think I'll buy any Panasonic product ever again.", "Date": "November 16, 2011"}, {"Title": "GREAT PICTURES", "Author": "R. G. \"Bird Watcher\"", "ReviewID": "R17VO7XCAWKIDC", "Overall": "5.0", "Content": "Purchased this as an upgrade from a Sony DSC S70 model.  At first, I was not sure I would like this camera.  But, after a few pictures, WOW!  I love it.  Great point and click with a zoom!  I never had zoom.  It is compact and a great camera to have handy.  Will not hesitate to purchase another Panasonic camera.  It is easy to load pictures onto my computer.", "Date": "August 7, 2011"}, {"Title": "Great camera for the price", "Author": "N. Goodman \"Nicole\"", "ReviewID": "R13ITJR3PCLD95", "Overall": "4.0", "Content": "I purchased the camera because I was going to Hawaii for my sons wedding.  The pictures came out great but the one feature that I didn't take into consideration was night shots.  The wedding was late afternoon into the evening so all the pictures while the sun was up are beautiful but as soon as the sun went down, it was really hard to see the background of the shot.  That is the only reason I gave it 4 starts.", "Date": "June 20, 2011"}, {"Title": "Better than I expected", "Author": "MZ", "ReviewID": "R1LQZRTP247B12", "Overall": "5.0", "Content": "I ordered a point-and-shoot digicam for vacation photos (and, let's face it, pictures of my cats).  I'm quite surprised how very well this pocket-sized camera works.  The last few years I've been using a pro-level digital SLR, which I'm not even certain I will use anymore.  A very nice feature on this camera is the ability to change file sizes, the camera even tells in traditional terms (8x10, and so on) how large one can take a photo and still have it reproduce well.  I only wish my graphic design clients could have that as a reference!  I've had this camera for perhaps a month now and may change my mind later, but so far, so good. Oh, it did not come with a case or a screen protector, but I had plenty of protectors and made my own case.", "Date": "April 28, 2011"}, {"Title": "great point & shoot camera", "Author": "tom a", "ReviewID": "R1IJINS8PC70XM", "Overall": "5.0", "Content": "great camera. easy to use. zoom and wide angle great. great low light capabilities. rechargeable battery awesome. only problem, no memory card, built in memory not enough.", "Date": "April 22, 2011"}, {"Title": "The FH20 is a great little point and shoot camera", "Author": "T. KEENE", "ReviewID": "RIAJYRKEUYEJK", "Overall": "4.0", "Content": "The FH20 is a great little point and shoot camera for everyday photography,  The overall image is clear, and the range of zoom from Macro - 8x makes it a versatile and handy toolGood Image Stabilization, nice big screen, 720 HD video too nice, not so good in low light, all and all a nice Camera", "Date": "April 12, 2011"}, {"Title": "Love it!", "Author": "melissa", "ReviewID": "R2XSZK26ZVE774", "Overall": "5.0", "Content": "I absolutely love this camera. It takes great pictures for a point and shoot and it has a lot of cool features. I previously owned a Canon PowerShot which just doesn't compare, at all. I can't get enough of this camera!", "Date": "February 3, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.1 Megapixels\nOptical Zoom 5x / Digital Zoom 4x Focal Length f=5-25mm (28-140mm in 35mm equiv.) // Extra Optical Zoom (EZ) 5.9x, 8.4x (4 - 3 / 5M), 10.5x (under 3M)\nLens LUMIX DC VARIO\nOptical Image Stabilizer 2 MEGA O.I.S. (Off / Auto / Mode1 / Mode2) Photo & Movie modes\nAF Metering Face / 9 pt/ 1pt; Focus Normal / Macro, Zoom Macro, Quick AF (Always On)", "Name": "Panasonic Lumix DMC-FH3 14.1 MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.7-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51esYENG4BL._SY300_.jpg", "ProductID": "B003962E3S"}}