{"Reviews": [{"Title": "A Great Little Camera", "Author": "Timothy A. Warren Jr.", "ReviewID": "R29DUHM04MDYO8", "Overall": "5.0", "Content": "I have had the camera for a few days now and really put it through the paces. It is by far one of the best little point and clicks that I have had and I have had at least 5 in the past 5 years. It's built well and has a exceptional battery life (275 picks per charge on average with 14 meg pictures) and the recharge is fairly quick. I added a 16gig memory card for the video recording aspect and I love it. I can record 5 hours and 50 mins of 720p on the thing which is way nicer than the Flip that I was looking at. I used to get an occasional blurry shot with my other cameras from them not focusing well on moving objects (kids) but with this one I haven't had a bad shot yet on the kids running in the yard. It truly is amazing.All in all it's a great little camera for the price.And don't let the other guy scare you off from this camera. He more than likely put the card in before he hooked the camera up to his computer. By the way, make sure you hook the camera up to your computer BEFORE you put your memory card in. But if you screw up and put it in first all you have to do is clear out your pictures, eject the card and then plug it up to the computer for a fresh install.", "Date": "March 31, 2010"}, {"Title": "Awesome little camera!", "Author": "Michael Craig \"Mike\"", "ReviewID": "R2ZROMT80XAZTJ", "Overall": "5.0", "Content": "I just bought this camera at best buy in Miami on vacation. I took it to the beach multiple times, went snorkeling for a couple of hours, and use it for everyday shots. The pictures are crystal clear. The 720p HD video looks awesome, especially on your HD tv. No issues with this camera. No problems with hooking it up to the computer. Just plug it in and there it is. Charges fast. Takes a sd card for extra memory. I don't know what happened with these others peoples' cameras. Probably user error. Don't let the 1 star reviews scare you away.All in all, great camera. Battery life was long. Took a ton pix at highest resolution, video, and editing on the camera, and it lasted all day. About the same size as my regular didital camera. Nice features. Best buy has it on sale for 269. Go for it", "Date": "May 11, 2010"}, {"Title": "Great little point and shoot.", "Author": "A. Hyatt \"TortugaDelMar\"", "ReviewID": "RHWG6EK409T3G", "Overall": "4.0", "Content": "I liked this camera out of the box. The software is intuitive, the options varied and I took it to the tidepools right away and got some great super macro shots of marine life underwater. Rinsed off the saltwater and took it to the mountains for the long shots. It is small enough for a pocket and great for hiking and backpacking - no worries on dropping etc... Still playing with it and learning all the options but I highly recommend the camera. It does all that it says it does; it is compact and burly. Found the digital zoom fuzzy and worthless but overall a great deal - excellent improvements over the older models and well worth the price.", "Date": "April 24, 2010"}, {"Title": "Amazing camera!", "Author": "Nichole", "ReviewID": "R3FYYQIS9H9FNB", "Overall": "5.0", "Content": "After punishing this poor little camera all summer, i've gotta say i am deeply impressed with it. The case is now scratched and a bit worn from all the abuse i've put it through, and not only is it still holding up like a champ but it takes astonishing pictures; during my whitewater rafting trip i caught some killer 'mid action' pictures and never had to worry about keeping it dry, and never once had a blurry shot no matter how rocky the ride got.The panorama option is also a phenomenal addition- i have some amazing sunset shots that look seamless thanks to the built in sensor (automatically lines up and takes the next 2 shots for you- all you have to do is move the camera and it does the rest). The zoom really impressed me too, especially underwater (just make sure you set it to the underwater option- i found that makes a big difference).I also love how easy this camera is to use- my dad bought the new Canon underwater camera for our California trip, and he spent the better portion of every killer moment tryin to adjust his settings or figure out which button to push. If you read the manual on it and learn the Canon before hand its a pretty cool camera, but personally when i'm in the heat of the moment for an awesome shot i dont want to be fiddling with buttons and trying to remember how to get to whatever setting i need.I give this camera an A+, and i'm really looking forward to seeing what improvements they make on it in the next couple years.Sincerely,An Avid Action-Photo Junkie :)", "Date": "August 11, 2010"}, {"Title": "Broken? That's just TUFF", "Author": "rongedagain", "ReviewID": "R31D2WNW0AQENO", "Overall": "1.0", "Content": "BEWARE OLYMPUS RECONDITIONEDAfter less than 10 min. video and 30 or so stills (mainly to test my new camera and brag about its features) my factory-reconditioned 6020 crapped out. At 120$, it was a steal but, less than a week after the 90-day warranty expired, the camera refused to recognize the fully charged battery or any battery. Throughout this period, despite the cameras freezeproof, waterproof, shockproof  `abilities', I coddled this baby. After weeping on the phone to Olympus they said they'd take a look at it and maybe clean the contacts or something. I sent it special UPS (12$-recommended) and after a month of various delays, the service center finally said that they could repair it for 130$. Uh...How `bout just cleaning it? NO. Diagnosing? NO. After threatening bad reviews they lowered the price to 73$--as you can see, I'd rather warn you guys.", "Date": "September 16, 2011"}, {"Title": "Good, just not perfect", "Author": "A. Jones \"AJ\"", "ReviewID": "R1Z4YQUXXCP796", "Overall": "3.0", "Content": "Bought a 6020 while on a cruise ship \"it was the best they had\".Pros:Was delighted at the picture quality.. ability to zoom up and still maintain clarity with the image stabilization.While in the formal dining room getting white balance accurate was a challenge with all of the red hues in the room.. buts thats true for my 600.00 sony too.Movies are spectacular, while the screen shows good reproduction, its nothing like once you get it on your computer!Very close shots while moving does cause some pixilation but the only way to solve that is to go from 720 to 1080 full HD and faster shutter speeds.I took this camera down to maybe 15ft \"possibly 20\" with no leakage whatsoever. However the little lock switch is easily moved if careless and the door opens rather easy after that... \"made me nervous!\"Cons:The metal lens protector on the front will move and not bounce back to position if the camera is turned off.This seems to be an issue with the 6020, and I found it to be true on 3 others \"as I took mine back\" and the lower models \"6000 and below\" didn't seem to do that.The way to reproduce the problem is to take a towel or a slightly damp fingertip and gently sweep downward. The metal screen will move and stay in the mid position you leave it rather than bounce back up when released to assume it position to protect the screen.Another issue which I'm not sure is an issue:.. when you zoom up or zoom back.. there is a funny sound emitted on playback.I can't tell if its supposed to be there to indicate you are zooming, but if so.. thats a lame feature that should be removed.I read a review of the 8010 and it had the same issue.Last.... I wasn't able to find a details view of any picture or movie file to see the kb size.I expected a 300.00 camera to not have the lens protector issue. They tried to downplay it.. but I figure if you need a protector, you need it.. if you don't, you don't.And I believe this to be a bug with the 6020 since I didn't see it in the lesser models of they same brand.The time mostly likely to need a lens protector is when the camera is off and not under your full attention, and thats when it malfunctions.", "Date": "April 26, 2010"}, {"Title": "Excellent, full-featured point-and-shoot digicam; minor gripes keep it from five stars...", "Author": "35-year Technology Consumer \"8-tracks to 802.11\"", "ReviewID": "RATGNJAU5F8G4", "Overall": "4.0", "Content": "This camera has many positive attributes that should make it attractive to the casual photographer or videoographer (or even to serious hobbyists who might themselves unable to schlep full size gear).Among its obvious postive features:(1) multiple output options (USB and HDMI)(2) multiple charging options (AC adapter or USB from a computer)(3) excellent still picture quality (up to 14 megapixel resolution)(4) HD video capture(5) image stabilization for both still and video image capture(6) internal memory storage or removable SD/SDHC card(7) waterproof, shockproof, dustproof design (to a point, of course), and works from well below freezing (14 degrees F to 104 degrees F)(8) auto or manual options allowing increased control over many common photography options (including a wide range of lighting conditions, 80-1600 ISO values, flash and macro settings)(9) \"tap control\" of the four-way controller allows you to change menu functions with a flick of your finger (especially useful while wearing gloves)A few nagging gripes keep this from reaching the \"five star\" level.(1) No included user guide. In the box you'll find a quick start guide, but if you want the full user manual, you'll need to download it from Olympus as a .pdf file. This camera is feature dense, the user manual is 80+ pages long, and it should have been included in the box. While the camera has built-in help functions, they simply aren't a substitute for the bound manual that should have been included.(2) Lens placement. The lens for this camera is inexplicably placed in the top left corner (relative the photographer). This is a location you will soon learn to keep your left hand fingers clear of while shooting, Why it wasn't placed in a location where photographers aren't likely to grasp is anybody's guess.(3) Non-intuitive 4-way \"arrow pad\" controller. Most of us have been using these for years now; this one takes some time to figure out. Spend some time with the manual to understand its menus and order of operation before taking any high-value pictures.While all of these were preventable, they don't detract from the overall value of this camera. I purchased this for upcoming travel in a harsh environment likely to test each of its waterproofing, shockproofing and dustproofing. While I haven't exposed it deliberately to any of these yet...I'll update once it's been initiated.", "Date": "August 8, 2010"}, {"Title": "Good build quality, awful picture quality.", "Author": "Louis Adesso III", "ReviewID": "R2PWATIJJV6EMB", "Overall": "2.0", "Content": "The camera feels solid and well made; good user interface, fair number of options for a point-and-shoot. The bundled PC software is bloated and buggy, but that's to be expected.The picture quality is terrible. I spent days trying all possible combinations of quality/speed/lighting settings, but the colors always come out unforgivably washed. It's just so much worse than even my cell phone's camera that I'm packing it off for a return. Very disappointed, since as I said the overall build quality seems quite good.", "Date": "September 11, 2011"}, {"Title": "Olympus Tough Camera  6020 - Not What It Says It Is!", "Author": "Garrett E. Coble", "ReviewID": "R2PVSISUD96WAW", "Overall": "1.0", "Content": "After some basic research for a camera to be used solely for vacations to tropical locations, I settled on the Olympus Tough 6020 camera.  I was sold on the features of the camera, particularly the ability  shoot pictures and video under water.  What a mistake.In the month of July 2011, my girl friend and I took a cruise to the Caribbean and on the second island stop of our cruise my camera died. I sadly discovered later that water had collected in the camera.  My girlfriend and I had booked an excursion to swim with sting rays that day and unfortunately I was unable to capture some of the most significant portions of that event to my camera failure.  Consequently, I was forced to purchase over the counter instant cameras to chronicle the remainder or our trip which consisted of 3 days.  Not only did I lose a few pictures that were shot on the cameras hard drive (luckily I shoot the majority of the trip on memory flash card), but I lost my ability to video the last three days of our vacations.Since returning home, I have returned my camera and in fairness Olympus fixed and returned it within two weeks. Nonetheless, after further investigation it is obvious I am not the only one who has purchased this camera and has had similar outcomes.  I, like the other reviews I have read, made sure that my camera was locked and that I did not go below the water levels indicated in the manual (never went lower than 6 feet of water).  Consequently, it is clear to me that this camera does not support what it advertises.  My suggestion to Olympus is fix the seal problems for this camera or stop advertising that it can take pictures under water.  My vacation was altered by the fact that the camera didn't do what it said it could do and I will never be able to capture some of the memories I lost due to a defective product. As it stands now, Olympus has lost my patronage for any of their products in the future. I definitely, have no confidence in putting this camera in the water ever again.", "Date": "August 4, 2011"}, {"Title": "Mostly very good", "Author": "'Zon Customer \"rex\"", "ReviewID": "R1HY5KFOC19NU1", "Overall": "3.0", "Content": "This camera is pretty good overall. Has a solid feel to it - I didnt test the 'ruggedness' fully yet, but I generally carry it without a case, throw it in my pocket or a bag and dont worry about it. Picture quality is ok, focusing is very good most pictures are not blurry. The only weird issue I had is with the lighting, it can't seem to figure out the proper adjustment. Like a lot of cameras, takes great pictures outside in good lighting, but sometimes the flash will fire in a bright setting - not a huge deal if the picture comes out good, but could drain the battery. The bigger issue is in variable lighting sometimes it comes out too dark, it can't seem to figure out the lighting properly. One sunny day I took a picture into a shaded area which was also fairly bright and the picture came out extremely dark, it looked like it was night.As it is I'm keeping it anyway, got it for $135 on Ebay and I think its worth that price, wish a firmware update could fix the lighting though.Added: I finally used this in a pool, it works great. Pictures in the pool were great and the camera went underwater many times with no problems, very waterproof. Make sure you lock the battery door in the place, the waterproofness worked very good.", "Date": "June 24, 2011"}, {"Title": "Swim with da' fishes!", "Author": "Mark Browning", "ReviewID": "R1D4Y7ZQ6A0681", "Overall": "4.0", "Content": "I bought this camera in preparation for a cruise to the Carribbean. It was great to have a waterproof camera to take through rainforests, waterfalls, kayaking, snorkeling, swimming with turtles, etc. The picture is pretty good (see other more technical reviews for picture quality). Its not like even a low end DSLR, but for its use its likely good enough.I was especialy interested in taking the camera snorkeling on the coral reefs there. It goes down 30ft, which is plenty for snorkeling: the furthest I could comfortable descend is about ~20ft. However, once you get down that far, there are a couple of issues I didn't realize until after my first batch of botched pictres:1. The much lower light level means things have to be *still*. I'm not sure why I thought this camera would magically overcome the shutterspeed/focus distance rule of thumb...2. In coastal regions, any non-clear water will almost ruin any pictures used with flash.3. Zooming dosn't really help for the above reasons.So, take your habits with normal photography and double them if you plan on taking this camera below the surface: stay still, don't zoom in low light, and use the flash sparingly, especially in coastal/cloudy water.", "Date": "June 5, 2011"}, {"Title": "Excited for the camera, disappointed when I got it.", "Author": "John", "ReviewID": "R3QEVJGDPAB29P", "Overall": "1.0", "Content": "When I got the camera in the mail I took it with me on a fishing trip.  On the river I took numerous pictures with all the settings to be very disappointed.  The quality was so terrible, I double checked all the settings to make sure it was not user error.  About a week later when I used it on an intertubing trip the camera started giving me error messages and started shutting off.  I followed the guide given with the camera to help maintain and check for the waterprofof feature and water got behind the screen and inside the lens.  So now I ended up spending a lot of money on a broken camera.  I'm hoping olyumpus will fix it and that I just got a bad apple.  I was just suprised how the quality of the pictures turned out so bad.", "Date": "August 20, 2010"}, {"Title": "Love it love it love it", "Author": "FlorShh", "ReviewID": "R19HKV89T4UG1Y", "Overall": "5.0", "Content": "I bought it 3 years ago and i still have it, it works great and take great pictures under the water, it has felt and hit the floor so hard a bunch of times and still works great, love it", "Date": "November 13, 2013"}, {"Title": "love it", "Author": "Mary Romo", "ReviewID": "R2D6OLHPR68OLD", "Overall": "5.0", "Content": "It worked great in Hawaii under water.  It recharges in minimal time and the pics are clear.  I only wish you could use regular batteries with.", "Date": "December 31, 2012"}, {"Title": "Too much work", "Author": "J. Gratian", "ReviewID": "R1UHA4EO5HXZSS", "Overall": "2.0", "Content": "Picture quality out of the water is good.  Picture quality while snorkeling varies greatly.  Some are decent and some are just trash.  The real problem is the 'water proof' part.  Have used the camera on several vacations for snorkeling.  Three out of four times I ended up with water inside the camera.  Turns out that even if you do everything correct, Olympus still requires you to send the camera to them every year to replace the water proof seals.  For a nominal charge of $ 29 (plus your freight) each and every year you want the camera to work as a water proof camera.If you are shooting in wet settings and not submerged I think you will be okay.  But if you plan on submerging the camera plan on getting the camera serviced every year.For myself I will be looking at a different company to purchase my next snorkeling camera.Additional note:  Brand new the camera experienced water invasion on first use.  Was covered under warranty.  Several months later on second use the camera again experienced water invasion that was covered under warranty.  The following year when the exact same thing happened outside of warranty it was considered lack of maintenance on the seals and not covered.  I believe the camera's seals or alignment were defective from day one and if you experience water invasion you should demand a replacement camera and not allow a repair.", "Date": "August 7, 2012"}, {"Title": "Durable & great photos", "Author": "Merc8541 \"Polar XXXpress\"", "ReviewID": "R34AIL8MBB7HRJ", "Overall": "5.0", "Content": "I've had this camera for about 3 years now, and it has taken a beating. I used it to film my motocross exploits through various trail rides and it has given me great video. I've dropped it a number of times, and it can withstand a rough owner. Also, I've used this on vacation and taken pictures with it in fresh and salt water. No problems! worth the money if you always break cameras by dropping them, or treating them rough.Battery life is fairly good, but I always carrying an extra for filming, as the battery generally last only a few hours for that feature.", "Date": "July 11, 2012"}, {"Title": "Great in bright daylight!", "Author": "Luxma", "ReviewID": "R13S44HPRR7MW1", "Overall": "4.0", "Content": "I bought this camera because I wanted one that I can take with me regardless of what I'll be doing. I've been able to go to the beach, rainforest, under waterfalls, as well as in the city when it's raining and I don't want to risk my DSLR. It's a great adventure camera, but the pictures are not as great when there is low light. The photos are great in bright daylight, but not so much in other situations. Definitely not what I would use for indoor photographs. But the great thing about it is it's durability. If that's your main concern, then it's a good buy. It was for me, because I already have other cameras for other purposes. But I wouldn't purchase this one as my sole or main camera. Also, when you're shooting in water make sure you don't have water drops on the lens when you're going to take a picture. Just put it underwater and bring it back up to remove any drops without touching the lens.", "Date": "July 5, 2012"}, {"Title": "Bad Idea", "Author": "Joel John L. Mailuyal", "ReviewID": "R2PJB5LO5382UO", "Overall": "1.0", "Content": "I have had this camera for about 3 months now. For the first two months it did really good underwater. But just a few weeks ago water has been sipping in. then I remembered that the first time i put it in the water the camera turned off for no reason. I thought that the battery was weak because we have been taking pitures. But just a few weeks ago i took it into the water and it died. Now I know for sure that i charged it before I went swimming. So now I know that something was up. so I brought it home and waited for it to dry and then I opened it and found that it has water in the battery compartment. so I took out the battery I made no attempt to turn it on and just waited for the inside to dry. then I put the battery back on and it worked again. so I tried it all over again bringing it to the ocean and same problem. But now i cant return it because its way pass the return date. I lost a lot of money on this.I deeply regret buying this item.", "Date": "May 24, 2012"}, {"Title": "Tough Camera", "Author": "Deployed Combat Medic", "ReviewID": "R2318XHWQYU1OR", "Overall": "5.0", "Content": "Rain, Sleet, snow or hail. I keep it in my Combat shirt or on my Body Armor for this whole deployment, and it has survived alot. It keeps up with me, takes great photos and videos and uploads them well.  Quality with ruggedness to withstand falls, drops, rain, scrapes, and the every day life of a soldier in Afghanistan.Warning: Not Bulletproof.", "Date": "February 8, 2012"}, {"Title": "loved this camera ... til I took it snorkeling", "Author": "Jilly from philly", "ReviewID": "R3VXI0PT0FULY8", "Overall": "3.0", "Content": "I really liked this camera for about a year.  It always took decent pictures, the scene modes were pretty good, and of course it was easy to use.  I used it in the rain here and there even dropped it a few times and it was always fine.  Then one day in st john I decided to take it snorkeling for a few hours ... I got some great shots and then the next day it just stopped working.  I have always maintained the waterproofing according to the instructions and put it in fresh water after I had it in salt water.  However the day after the first time I used it in salt water it no longer worked.  I tried replacing the battery (since I had it for a year) but it soon became clear something was very wrong.  I thought maybe I had it too deep in the water, but it is supposed to be good to 10 ft and I was never deeper that 2 or 3 feet.  Did I expect too much from a 180 dollar camera? maybe ... but I won't be purchasing another one.  Although I have to say it was a great little camera while it lasted.", "Date": "January 25, 2012"}, {"Title": "mediocre", "Author": "kbulman", "ReviewID": "R10P6DBWKC9KAA", "Overall": "2.0", "Content": "I had bought this camera to replace my Olympus Stylus Tough-8000 that died after a beach vacation. I expected to love this camera just as much as the previous one, but I'm not quite as fond of it. Admittedly, I have not tried this one underwater even though I've had it for a year now, but I do take it with me to concerts, friends' sporting events, etc. Sometimes I get amazing photos, but other times they come out blurry (especially in low light). It also has incredible lag time from when you hit the button to take a photo & when it actually decides to go ahead & shoot. This is highly frustrating because you end up missing tons of moments you'll never get back (such as your friends getting married). I also find that I cannot just hand my camera to a friend to take a photo because it takes too much effort to figure out how to use (especially if you're just wanting to point & shoot) & most likely the photo will end up blurry because most people don't think about doing their best to make sure the camera doesn't move AT ALL.Overall, this is an ok, functional camera. I am, however, hoping to find a much better one that I will be more pleased with.", "Date": "November 27, 2011"}, {"Title": "not really a water camera", "Author": "luckylindie", "ReviewID": "R3PI7U05865NW", "Overall": "2.0", "Content": "Purchased this camera thinking it would be great for taking underwater photos.  I used it 2 times and had to send it in for repair.  It seems it isn't really water resistant.  Once I got it back I used it another two times and had to send it back in for the same reason.  Water got in the camera and damaged it.  Would suggest buying a different brand if you want to use it for underwater pictures.", "Date": "November 23, 2011"}, {"Title": "Wonderful camera, for an amazingly low price", "Author": "Nick N", "ReviewID": "R3RNSWD8ORWX9N", "Overall": "5.0", "Content": "This camera is awesome! the pictures have always turned out great, and the waterproof / shockproof casing on it makes it the perfect camera for a clutz like myself.The 720p video is great also, with pretty good audio when played off a computer..The night pictures are pretty good also, but you have to be sure to turn off the flash manually sometimes, otherwise you cant see anything.One thing that i do have to warn about though, is that pictures always look blurry on the camera screen, so at first you might want to take a few pictures of the same thing... but i promise that they always turn out great when viewing on a larger screen.Ill be posting some pictures that i took with this camera, so that you can see the quality yourself.", "Date": "October 17, 2011"}, {"Title": "Cheap, Durable, Tough, Great pictures and decent Video", "Author": "Expecting What I Pay For", "ReviewID": "R21DSDV2PP085U", "Overall": "5.0", "Content": "I expected a lot with a tough camera, and it truly is waterproof, but make sure you slide the coking mechanism over or it won't be.  Also, the pictures are great quality and crisp.  I use it a lot on cars, and the detail is great.", "Date": "September 16, 2011"}, {"Title": "Don't buy it", "Author": "crsj", "ReviewID": "RY8PGX15QWFYM", "Overall": "1.0", "Content": "My camera only last for 1 month, I used it for one week in the beach and it took great pictures underwater, then I used it in the pool (1 meter or less deep) and water got in (the lock was secure) I don't recommend this camera to anyone! unless you want to lose some money..", "Date": "September 10, 2011"}, {"Title": "Not the best picture quality", "Author": "Green98", "ReviewID": "R34LVVXPH81L6E", "Overall": "2.0", "Content": "I did read the reviews before purchasing this and this camera was on another site rated highly for waterproof digital cameras so at only $170 I thought I would give it a shot since it was relativly low priced.I took this camera on my vacation to the Bahamas, it got rained on but I never submerged it into a pool or the ocean.  I really HATED the picture quality.  A digital camera this day and age should be easy for the user to use.....it should produce the same quality pictures each time.....mine were 50/50.  Half my pictures were nice, they other half was shotty meaning the pictures were blurry.  Some of you who love this camera may say it is \"user error\" but come on.....yes I know there is that press before you click where you focus on the person, but when you are in the blaring Caribbean sun the camera does not always have that available.  This camera does not do well in super sunny places, pictures are too blurry.Anyways....... I was not happy with my vacation pictures, mainly because it did not produce 100% crystal clear picture quality.  It may be a good camera to give to the kids but dont count on this as your main camera.  Good thing I also brought a higher quality Olympus digital camera with me which produced 100% crystal clear pictures.  Buy this and use this for when you are IN the pool where this can get wet, but dont use it as a day to day camera.....you'll get better picture quality elsewhere.", "Date": "September 5, 2011"}, {"Title": "Great for water sports \"Kayaks\"", "Author": "Whitewater Splash", "ReviewID": "RPS7QGVR49MW1", "Overall": "4.0", "Content": "I bought this camera just for Kayaking. It takes quality photos and is very simple to use. It does have limited range in distance which is a little disappointing. Overall it a good value but it will not be my final water camera. I need more zoom distance for all the scenic views.Had my first spill in the Kayak and the camera did not pass the test of being water proof. I will be contacting Olympus \"I'm still in the 90 day limited warranty time frame. I hope they stand behind it, I will keep every one posted. I have not changed my rating as of today.Just wanted to let everyone know that Olympus did repair my camera in a very timely matter. I have not had a chance to see if it is waterproof or not after the repair.++", "Date": "August 29, 2011"}, {"Title": "Durable Point & Shoot", "Author": "Luke", "ReviewID": "RMO3DUEDLIQIF", "Overall": "4.0", "Content": "Does what it's built to do. I bought this camera to take on a trip to Yellowstone and Grand Teton National Park. our itenerary included lots of hiking, kayaking and just outdoor activities in general. Therefore I wanted a cemera that would take decent pictures for the areas I wasn't comfortable carrying my wifes expensive (and more fragile) Nikon.Here's the pro's:1) It's Durable: Well Duh! It's made to be a durable camera. I havn't actually dunked it yet, but it got splashed on and had a dime size peice of hail hit it right on the shutter and no problem. So no complaints there. The feel of this camera doesn't leave you afraid to carry it either. It has some weight to it which I like.2) Easy to use and figure out, but not useless either: You don't have to be a professional photographer to sort out the settings. Most items are fairly self explainitory. But while it's easy for the novice (Me)to just say \"hey look at that [Click]\", there are enough adjustments to make the pro (my wife) happy using it as well.3) Compact.Even with the floating case it still fit easily into the front pocket of my PFD (life vest) and didn't hinder my paddling at all. While hiking I mostly carried it in my cargo pants pocket or shirt pocket. Sat on it a few times too which goes back to the durability.4) Cost. At about 200 bucks tops, this is a great camera. The last point and shoot I owned was a Cannon and cost about 400. So considering this one takes equal quality pictures and has the added durability, it's a no brainer.No for the Cons:1) The charger! you have to leave the battery in the camera to charge it. A fact that I did not realize before taking on my trip. I had left the cord at home to save space packing thinking that the little box that plugs into the wall was a stand alone charger like all my other cameras have been. Fortunately, I found a universal charger made by Logitec that worked. This is my main gripe because it just really irritates me that I can't have a spare battery that I can just change back and forth with while the other is charging.2) the pictures tend to be rather dark. Don't get me wrong, the quality is great, just the brightness needs to be up a notch or two.3) had some problems with the auto panoramic mode when the battery get's low. kinda weird that the battery power would have an effect on function of the software, but all I know is that when the battery was low it wouldn't work right, on full charge, it works great. Go figure?Overall a winning camera for the cost. The picture quality is good for a point and shoot. Many of the reviews will say they suck, but as the husband of a graphic design artist, I'd say they are on par with others in the SAME CLASS. So as long as your expectations are in line with a point and shoot then you should be happy with this camera.", "Date": "August 22, 2011"}, {"Title": "Good little tough camera!", "Author": "OutdoorThorman", "ReviewID": "R27A3ZMAI8BRML", "Overall": "3.0", "Content": "This little camera was bought as a replacement to our old waterproof camera that we left at the top of a mountain (Olympus Stylus 850 SW). With much research and review reading, we decided to get this camera. Over the past month it has performed just as good, if not better than our old one. The few problems I have run into are: Won't center focus to take a picture and flashes a red box instead of green, warning that if you take the picture it won't be in focus. I have run into this twice, but I just turned the camera off then back on and the picture took just fine of the exact same subject I was originally trying to focus on. #2 thing I don't like, functionality-wise, is that when you take a picture and the review of the image pops up, you can't delete it at that same time. You have to go into playback mode then delete the picture, then go back into shooting mode. I miss being able to quick delete a picture. #3. Coloration isn't very brilliant. Post-editing required. That's about it. This camera has prooved waterproof in the ocean, freezeproof on a glacier-filled mountain, just wish it was sand/dustproof for the beach. I would recommend this camera to any of my friends who want a durable, small, outdoorsy camera.PS:  This float strap works great if you are afraid of dropping the waterproof camera but it sinking. It keeps the camera afloat and is bright and easy to see. Olympus STRAP FLOAT ORANGE", "Date": "July 27, 2011"}, {"Title": "Awsome lil camera. Only paid 115$ for a refirb", "Author": "Dominic David Fuller", "ReviewID": "R20IR43K3S9XRQ", "Overall": "5.0", "Content": "Went from taking pics on my droid to this lil baby so it was quite the jump. The manuals are terrible, but after a little playing around i have everything figured out. Pics are crisp, clear, and really capture life's moments exactly as you saw them with your eyes. The camera never seems to struggle to adjust to get the best pics as other point and shoots have for me in the past. Lastly the software that comes on the camera is very simple to use and not all extra complicated and filled with useless options. With my other cameras i would never have use the software that came with it, but on this one I will....Awesome camera, and I would defiantly buy a refirb again if i saw something i wanted.", "Date": "June 4, 2011"}, {"Title": "GREAT underwater camera", "Author": "Smoman", "ReviewID": "R1MFTX6BZL6XKR", "Overall": "4.0", "Content": "I purchased the 6020 for going on a Disney bahama's cruise and it worked GREAT! My family and I went on a dolphin excursion and the camera took some amazing pictures and videos(above and below water).Pro's: Great underwater pictures and videos, no water leaking in the camera, SDHC compatable, very reasonable prices out there for such a great camera (I bought mine online from an Olympus refurbished dealer for $145)Con's: Doesn't take great \"mountain\" (long distance when trying to use zoom) pictures, video has some lost pixels when all of the way zoomed in while in a dark setting, and uses batteries very quickly due to using flash in almost every indoor picture.Overall: GREAT, GREAT, GREAT BUY!!!! I highly recommend buying this camera if you want quality underwater pictures.NOTE: Be sure to wipe/blow the water drops off of the lens after bringing it above water or you WILL have water spots on parts of your pictures. Just something to help you out if you buy one.Setup: Olympus tough 6020, three batteries, separate battery charger from the cable included with camera, 16 gb SD card (Great size for this camera because the HD video uses a lot of memory). All of this was bought for $180. Shop around and you can get great prices!", "Date": "April 17, 2011"}, {"Title": "Take me to the beach", "Author": "Nicholas B Alexander", "ReviewID": "R3KOYAJYLF5NEU", "Overall": "5.0", "Content": "I went surfing with a friend that had this camera and ever since then I wanted, no I NEEDED this camera. Luckily my wife dropped our old camera (from three feet) and the whole thing broke. Since I got the Stylus Tough 6020, I have already crashed while tree skiing, launching it into the snow. It survived the impact with a tree and landing in the slushy wet snow and kept recording the whole time. The quality of photos is great. I love it.", "Date": "March 31, 2011"}, {"Title": "Good little Camera", "Author": "T. Foster", "ReviewID": "RCC7E2T7X6H7X", "Overall": "4.0", "Content": "I was considering purchasing this camera for personal use but was turned off by the reviews.  However, I needed a waterproof camera for work, and this ended up being the only one available immediately in town.  I am glad it was.  I use this camera primarily for taking close-ups (think inches) away in either bright sunlight or very dim and shadowed areas.  It even has a LED that can be turned on to light up very close pictures.  It doesn't overshadow those close-ups like a flash can.  In fact, there's the general close-up mode, the super close-up mode, and then the ultra close-up mode with the LED.  The general close-up mode will use a flash, and I've found it works fine to leave it on when taking regular pictures as well.  The super close-up does not allow you to use a flash, but it can take closer pictures.  The LED is amazing.  These modes would be great for engagement rings, baby feet and fingers, and pretty much everything.  You only have to be a few inches away for it to focus.There are many different options with this camera.  I've found that I stay most often in the program mode.  I will agree with other uses that sometimes the pictures appear washed out or too dark, in which case, you can adjust the amount of light you want in.  It is very easy and has worked every time for me.  There is a beauty mode, several underwater mode, pets mode, etc.  I like the artistic modes too, although I have not had much excuse to use them at work.I also use it in dark areas (think dusk to twilight) to focus on objects 20 feet away.  The camera is the slowest when taking multiple pictures in a row with the flash.  The flash does take some time to recharge, but I don't think this is a big issue.  I don't want to have anyone moving so fast inside my house that I can't wait for the flash to recharge.  Outside, you can turn the flash off, and the camera still takes clear pictures.I rated the durability at a 4 because after reading the review from the gentleman who left the camera on his golf cart, I was careful not to expose the screen to any sharp objects, but the screen was still scratched within the first week.  This camera definitely needs a carrying case or maybe buy one of those cling-on screen covers used for cell phones.  An as yet unfounded fear is that buttons and seals do not look particularly waterproof.  I have not taken it underwater though, and I have no plans to.I've tested the shock absorbing capabilities as it falls out of my pocket while sitting down onto tile floor below.  No damage noted.In short, a great little camera.  I think you'll be the most satisfied with it if you know some basic concepts of photography (such as providing adequate and appropriate lighting), but this is a solid little camera.  All I have to do now is wait for my little Cannon Powershot to kick the bucket....", "Date": "November 7, 2010"}, {"Title": "The Most Awesome Thing Ever", "Author": "Corey Quin \"rndmbuyer\"", "ReviewID": "R27UMONONENZW8", "Overall": "5.0", "Content": "Ok so I did some shopping around before I decided on this camera because my old camera broke.  Though this camera was more expensive than some of the other camera's I looked at, I chose this one for a couple of reason's over the others:1.  It is water and impact resistant2.  It is small enough to carry around without being a hinderance3.  Picture quality is awesome4.  This is the first version of the tough series to use SD memory cards (a big factor in my choosing process)Anyway I really needed this camera because I was going on vacation and we were visiting Florida and some of the theme parks there.  I am always one to enjoy quality technology and I feel I made the right decision with this camera, because:1.  The features and different picture options make taking good/creative pictures easy and fun2.  When we visited a water park, on one of the slides, it flew out of my pocket.  And true the the stylus tough series it  survived and takes pictures just as well.3.  Well since I was at a water park it got wetNow as with any piece of technology there are some drawbacks:1.  It does not have the zoom capabilities as some other cameras2.  The battery life of the camera isn't as long as I would like (last about 3/4 of a day for me)The zoom capabilities I can do without because I use the camera for more social events, like going out to the beach or going to Disneyland.  I really don't need to take pictures of something 1000's (I know exaggeration) of feet away.  So really the battery was the biggest disappointment, but that means I just carry an extra one around with me.  In all I would recommend this camera to anyone as an everyday, ever activity camera.", "Date": "November 2, 2010"}, {"Title": "Good for underwater, above, not so great", "Author": "Tuno", "ReviewID": "R19Z234WUT4WLW", "Overall": "2.0", "Content": "This is a great camera for getting stuck in a monsoon or were there will be danger of splash on a lake. Above water the pictures do not come out well at all. The flash overexposes every picture and the ones that are exposed correctly the color is way off. If I was using this purely for snorkeling it would be great but I need something that looks good above the water as well. It has been about 3 months and now the camera won't even turn on. Sending it back to Olympus, we will see....", "Date": "October 10, 2010"}, {"Title": "tough lil camera", "Author": "vix205", "ReviewID": "R3ABVW2Q28JIIM", "Overall": "4.0", "Content": "the camera does what its suppose to do, i really like this camera, it is a great camera, the only thing i do not like is that you have to charge the battery while its inside the camera, which would be a problem for people with more than one battery like me since  i like to take a lot of pictures and video, the video quality is amazing, picture quality outdoors, underwater, in a well lit room are amazing, picture quality in low light rooms are good, overall it is a good investment specially if you like to be outdoors and underwater", "Date": "June 29, 2010"}, {"Title": "Excellent camera", "Author": "G. R. Rodriguez", "ReviewID": "R1M48EBN9Y4DZW", "Overall": "5.0", "Content": "I bought this camera because I went to a trip to Cancun, and I wanted to get underwater pictures. These pictures, if taken under fair conditions (sufficient light, clear water), the quality is very good. My surprise was that, when taking outdoor pictures, the image quality is excellent. The wide angle allows you to take great scenic photos. The video is also great, 720 p. image quality, and great sound too. The only con is that the panoramic mode under if used as automatic is not very good. Manual or computer panoramic mode are better. If someone is interested, I could send some pictures (outdoor or underwater). Please only let me know.", "Date": "June 13, 2010"}, {"Title": "Great Camera, Don't listen to the 1 star reviewers", "Author": "Raven's Haven", "ReviewID": "R3FHM8ZH4ZOFNI", "Overall": "5.0", "Content": "I bought this to replace another Olympus that was damaged.  I liked the durability the description offered and I have been pleased with Olympus cameras in the past but I was not blindly \"set\" on this camera so I read many of the reviews here.  I noted a disproportionate amount of 5 stars or 1 star.  Those who rated 5 stars pointed to the 1 star reviewers and said they were not paying attention to the actual features,or 'learning' how to use it properly.Now that I have it, I agree 100%.  The 1 star reviews noted a delay in start-up,excessive shutter lag, and the inability to take photos in rapid succession.  Well, as the others have said, those people just didn't read the manual,'play' with the menu,or otherwise 'just try'.  I understand that some people think everything should be plug and play, but if you really want something that has all of the 'bells and whistles' you are going to have to put some time into it. Within 10 minutes of just 'playing around' I found how to change turn off the immediate preview, and change the shutter speed from normal to 'sequential' to 'HI sequential'.  (If turning in a circle and taking 10, perfectly focused photos in 3 seconds is too slow, then yes, this is the wrong camera.)It has in-camera editing, including cropping,changing from color to B&W; or Sepia, creating a calendar, clearing skin and the other options that my previous Olympus had like Macro,Portrait, Motion, Candle-light, etc.There is also an 'in-camera' manual that you can access simply by pressing the ? button, which offers helpful tips with step-by-step.The photos are great and the HD video is even better, very crisp and clear.It's pretty sturdy, and thicker than the last one I had but it is still very light.  I have not yet tested the waterproofing yet, nor dropped it on purpose because I would rather not scratch it.The only aspects that I didn't like were that this model uses an SD card instead of the xD card that Olympus cameras typically use,(Now I have to buy a new card!)and the fact the you can't remove the battery to charge it. The battery does remove but to charge, you open the side and plug in the mini-USB provided, that uses an outlet or a PC.  Leaving this side flap open during charging makes me concerned about damage/dust/etc, however, it does charge pretty quickly so I guess I can live with that.Best Buy retails this same model for $299, but this was on 'sale' for $223, so it was more than I expected and $80 cheaper.", "Date": "October 14, 2010"}, {"Title": "This thing's a beast.", "Author": "Evan", "ReviewID": "R2P0QUPTN7KY44", "Overall": "5.0", "Content": "On my first hike after I bought this camera, I ended up having to hack some foot-holds in a steep snowfield that covered the trail. As I bent double, chopping steps with my little hand shovel, the camera slipped from my breast pocket. I watched with horror as it slid down the snow and sailed triumphantly off of the cornice into 6 feet of open air. When I had scrambled down to recover it, I found it lying on the hard talus below--utterly unperturbed by its short excursion.Unfortunately, some weeks later I had attached it via the included wrist strap to my kayak. A bone-headed move; the strap is obviously not meant to do more than dangle the camera from your wrist. By the time I recovered my capsized kayak some miles down the river, the leash had snapped and left the camera lying somewhere at the bottom of the river--just fine, I have no doubt, but not in a place I could recover it.Stunningly, Olympus replaced it with a refurbished unit! I swapped out the included strap in favor of some 550lb. test paracord, and since then it's accompanied me on all my adventures, taking stunning underwater video as I snorkeled through Iceland's continental rift lake and panoramas on massive glaciers in the far north of Swedish Lappland.If I have one complaint, it's that the cable has a proprietary connector, so mini-usb won't work.", "Date": "December 18, 2011"}, {"Title": "Camera", "Author": "Useful \"wolfy\"", "ReviewID": "R29SMJT69J3JTQ", "Overall": "3.0", "Content": "Pro's:  Waterproof, tough, and compact,Con's:  Software is only PC compatible, no disc with camera, and pictures are so-so.I would recommend this camera for an outdoors man, not for a camera buff.", "Date": "January 8, 2011"}, {"Title": "Died after 5 months but great photos", "Author": "D. Young", "ReviewID": "R39PRBIW50D7YN", "Overall": "3.0", "Content": "---13 Sept, 2010---3 stars. I'm pretty impressed with the Olympus customer service.  I mailed in the dead camera and about a week later I got a completely new one with no cost to myself.  The techs diagnosed that water had gotten into the USB compartment and they replaced it for free under the warranty.My previous likes and dislikes still stand.  Good: great pic quality, great video quality, great underwater photos and video.  Bad: slow to turn on, slow between taking pics, so-so photo quality in low light.---Old review from 26 Aug, 2010---1 star. I have to update this review and rescind my Buy recommendation.  The camera died after five months of use.  I'm not sure why.  The screen says \"No Connection\" when I try to turn it on.  The battery is fully charged and I can still use it to check the time when the camera's off.  I can also connect it to the computer and browse the camera's internal memory.  However, it won't turn on all the way--the shutter won't open and the screen says \"No Connection\".  I contacted Olympus support and they told me to send it in for repair.Also, I still stand by saying that the camera takes great photos and video above and under water.  However, there's quite a lag between taking each shot.  And it takes more time than other cameras to start up.  This means that if you want to quickly turn on your camera to catch that one shot or perhaps catch multiples of the same shot, you have to wait a bit.  (There's a feature to take high-speed photos but that drops the picture quality to 3 MP.)---Old review from From 27 Apr, 2010---4 stars.  I'm very satisfied with this purchase.  Great performance over the past two months.  I've taken it snorkeling in Key West and swimming around the Gulf of Mexico.  I'm very happy with the waterproof video quality, deeper around 12-15 feet.  I'm also very happy with the photo quality.  The pictures look great.  I'd recommend this camera to anyone looking for a tough, waterproof point-n-shoot.", "Date": "April 27, 2010"}, {"Title": "50/50", "Author": "Jose", "ReviewID": "R1RNPL5G4HJHH7", "Overall": "2.0", "Content": "The first day I bought the camera it worked really well. We loved the fact that we can be in the water at the pool/beach/water park and take pictures and not worry about water damaging the camera. The pictures looked great, until we used it for recording. I wasn't able to hear sound from the video. This was the second day using the camera. I let the camera dry out and did not use it for a few days to see if it would eventually work, and unfortunately it did not. I returned the camera and decided not to get another one. Maybe I was unlucky and got a defected camera, it happens. I did not want to risk it.", "Date": "December 4, 2013"}, {"Title": "Great camera, broke very quickly after underwater use", "Author": "GK", "ReviewID": "R2BADBS68UTIQO", "Overall": "2.0", "Content": "Broke really quickly after 2 underwater uses. Other than that it was a great camera with fantastic detail and very easy to use.", "Date": "November 29, 2013"}, {"Title": "Olypus Stylus Tough 6020", "Author": "Peter Polo", "ReviewID": "RYQ2TSA8P9FQG", "Overall": "5.0", "Content": "I have owned many cameras and this one is by far my favorite. It is compact, water resistant, and extremely easy to operate.", "Date": "September 15, 2013"}, {"Title": "Got water damage with first use", "Author": "Isabella", "ReviewID": "R3026AS4HK2YN5", "Overall": "1.0", "Content": "I got this product and followed the directions exactly but the first time I used it, it got water damage and there was water in the lens. I tried dozens of times to contact the seller and get a refund, as it does have a one year warranty, but no one ever got back to me. this was in 2011 and here it is 2013 and I still have never heard from this company about getting a refund or them honoring the warranty. I wouldn't buy this camera from this company", "Date": "August 21, 2013"}, {"Title": "awesome camera", "Author": "Jon", "ReviewID": "R2CICM66G9TMK", "Overall": "5.0", "Content": "this thing is great. I accidentally opened it underwater and it dried up and is still working. What an awesome item.", "Date": "August 16, 2013"}, {"Title": "Great concept but returned twice already", "Author": "suzanne ross", "ReviewID": "R1F4NG16Z1E1IA", "Overall": "3.0", "Content": "Love the camera, picture quality is excellent.  The camera has had to be returned twice so far for repairs.  The 3 year camera accident protection plan was worth every penny as I would have had to replace the camera twice so far.", "Date": "July 17, 2013"}, {"Title": "died on us....", "Author": "mark", "ReviewID": "R24QPJ0WE7ZWB", "Overall": "1.0", "Content": "This camera was a disappointment. It only lasted on two vacations before it completely died. (of course it was just out of warranty by then...) I was very disappointed as we had treated the camera very well in spite of it's \"tough\" status and had only taken it into the water for photos (only while snorkeling in shallow water) a few times. It is NOT waterproof and is NOT \"tough.\" Spend your money on a better camera.....", "Date": "July 14, 2013"}, {"Title": "Love it so much, bought another one as a gift", "Author": "T. Khetia", "ReviewID": "R25Y4I3UVY68IF", "Overall": "5.0", "Content": "I owned the 6010 version of this camera and I have loved it so much that I bought another one for my best-friend, who was getting married. I figured this is one of those gifts that can be used for years, in many trying conditions. The fact that the newly married couple was going to go to the Maldives, I thought this would make for a great product, for underwater shots, island shots (due to its wide-angled zoom), and its clutz-proof, which is what both he and I really require, as growing up, we were both clutz-masters!", "Date": "July 2, 2013"}, {"Title": "Terrible product", "Author": "Holl", "ReviewID": "R3RNEV4T6AHTN5", "Overall": "1.0", "Content": "I have been purchasing the Olympus Stylus Tough waterproof cameras since they came out. Yes, that is a few because they just don't last. Each year I have sent it back to Olympus and paid to have it re-waterproofed as you are supposed to do with this product. This past year (July 2012) I sent mine back as usual although they sent back the wrong camera back to me when the re-waterproofing was done. After the hassle of calling them to find out what happened and then sending this other camera back to Olympus they sent me a refurbished version of the camera that I originally had. Less than a year later during the first time that I used this camera in the water the camera broke. I contacted Olympus to see how I could get it repaired and was told that I would have to pay for the repairs! Olympus lost my camera and sent me a bad one and then I have to pay to get it fixed? I will never buy another Olympus product again. I am so disappointed with their products and customer service.", "Date": "June 27, 2013"}, {"Title": "Good Tough Camera", "Author": "Michael F", "ReviewID": "R2H8SA8ZBCD68C", "Overall": "5.0", "Content": "My military unit issued Olympus camera's.  The only thing that has ever effected this camera is if the lens gets scratched.  But overall, very durable.  When it came itme for myself to get a personal one, Olympus is who I turned too.  I'm not very \"techy\" but this camera had everything I need.I have dropped it many many times and it has always held up.I would reccomend and I will buy again when the need arises.", "Date": "May 9, 2013"}, {"Title": "The camera no longer works very dissapointed", "Author": "colleen", "ReviewID": "R1WTTNL10YXIDL", "Overall": "2.0", "Content": "I had this product for less than 6 months and it no longer works. Unable to charge the battery, tried changing the cords it was a malfunction inside the camera, I'm very dissapointed.", "Date": "May 3, 2013"}, {"Title": "Great!", "Author": "Mallosaurus.Rex", "ReviewID": "R139GV1IVBBF2E", "Overall": "4.0", "Content": "This camera is great! The only thing I don't like is if your recording a video and use the zoom, it's kind of loud. Also when you're recording a video the sound quality isn't as great as other cameras I have used. Underwater though is amazing! This is the first underwater digital camera I have had and I love it! I have been all over the word with this thing. I bought a floating wrist strap for it just in case I dropped it.Unfortunatly the only time I have dropped it is on land though! But it took the fall like a champ.", "Date": "April 26, 2013"}, {"Title": "PERFECT", "Author": "jorge i gomez duque", "ReviewID": "R10MPWOF0C7S12", "Overall": "5.0", "Content": "Everething is perfect, the machine and the shiping!!!good conditions, good shiping, I am very happy for the service.  AAA+", "Date": "April 10, 2013"}, {"Title": "I love it", "Author": "Yolanda Feliciano", "ReviewID": "R1I4X109PE7VA1", "Overall": "5.0", "Content": "Camara fabulosa, me encanta, la he recomendado a muchas amistades. La he llevado en mis viajes p2or el caribe, Europa y Estados Unidos de Americca", "Date": "April 4, 2013"}, {"Title": "Great camera for outdoor use", "Author": "N. Lenich", "ReviewID": "R1D92322RMGOKH", "Overall": "4.0", "Content": "I bought this camera to take on vacation because I didn't want to bring my really expensive digital camera along. The normal \"auto\" setting for the camera has horrible picture quality, as other reviews said, however if you just change the setting you can eliminate this. I thought it took great photos on the \"underwater\" setting both when under water and when not. Overall myself and my family really liked this camera because it allowed us to take pictures when on water rides (we even now have a family video of going down rapids which was really awesome). Also, the panoramic setting is pretty awesome too. I would recommend the camera, however if you're not tech-savy and good with adjusting settings for the area you're in, I would say try something else.", "Date": "March 28, 2013"}, {"Title": "Awesome Camera!", "Author": "Tony Ford", "ReviewID": "R21OYZDQWHIB6F", "Overall": "5.0", "Content": "I was lucky with mine as I found it in the river a few years ago when I was tubing with a friend. It was in about 6 foot of water which I noticed while walking threw some rocks & honestly thought it was a piece of metal because of the silver color & picked it up with the intention of tossing it out of the water so no one would get cut. Low & behold I scored without even knowing it because I thought it was just a normal digital camera when I found the HD SD card inside & was going to ditch the camera its self. It was all green & shimmy but after I got it cleaned up & let it sit a while it worked perfectly! Being in the cold mountain water for 6 months no one finding it & it still worked! I still have this camera even now sitting here charging up on its data cable. I am thinking of selling it here next month to try & get a later model but I would defiantly recommend this camera to anyone who is looking for every day use water or otherwise as well as for the HD videos. I don't think they allow links here or I would show up a few videos I did with it.", "Date": "February 22, 2013"}, {"Title": "Not as tough as a normal camera", "Author": "Don Branson", "ReviewID": "R2UCUNW6NQDGW4", "Overall": "1.0", "Content": "I've had two other previous digital cameras, both Canons.  I bought this one in 2011 for backpacking since I need one that can handle abuse and getting wet.  I never dunked it and never dropped it.  I just sent it in for repair for the second time, and they're asking $112 to fix it.  Ouch.  Plus, their web site won't let me log in to approve or reject the repair.Given the quality control issue with their cameras and their inability to stand up a working web site, I think I'll buy a camera from a company that will still be around in a year.", "Date": "February 11, 2013"}, {"Title": "Good Product. As expected. No compains. If you compare prices and is the best, there is no hold back to it.", "Author": "MARCOS Y YOSIDA", "ReviewID": "R1WR7C1ALY1LC8", "Overall": "5.0", "Content": "Good Product. As expected. No compains. If you compare prices and is the best, there is no hold back to it.", "Date": "February 7, 2013"}, {"Title": "not what is says", "Author": "Reginald Anderson", "ReviewID": "R2I07ZIG6VE2H", "Overall": "1.0", "Content": "used under water and camera got destroyed by water. Company refused to make good on because it was a year old. Had to buy new one. should call it water resistant not water proof", "Date": "February 4, 2013"}, {"Title": "Great Products", "Author": "Beaner", "ReviewID": "R1759JDUQ07ZWC", "Overall": "5.0", "Content": "We love this camera and have taken it all over the world.  It works great under water and takes great photos.  We also use it skiing in the mountains and have not had any issues with it.", "Date": "January 2, 2013"}, {"Title": "one tough camera", "Author": "jabieb", "ReviewID": "R3W3VJAO82TQQP", "Overall": "5.0", "Content": "Seem to be a bit more blurry than my last camera. Which is the same model. I use these for work. They are very tough and take better than average photos. Most of the time. The photos are the same quality as my expensive nikon. Plus ive dropped this thing from better than 20 ft and it still works. Really. My last camera of the same. We were on a canoe trip and it went in. Yea, for about 45 minute before I found it. It still worked. I highly recommend this camera", "Date": "December 28, 2012"}, {"Title": "I am completely disappointed by this product.", "Author": "LauraM04", "ReviewID": "R26XM2KKEQTEAR", "Overall": "1.0", "Content": "I've tried multiple settings - it's a headache to get a good picture with this camera. My images continually come out dim and blurry. My camera worked nothing like the model I tried in the store. With other cameras I've ownedd images were vivid and quick to take. This camera has been a nightmare and the icing on the cake is that just over a year after I got the camera (I've only used it a handful of times) I took it snorkeling and it completely died after 10 minutes in the water. I never went more than 1m below the surface. Saltwater penetrated the shell - it's toast. I would not recommend this camera to anyone. EVER.", "Date": "August 16, 2012"}, {"Title": "waterlogged", "Author": "leaguer67", "ReviewID": "R2AI94QKSRF2BE", "Overall": "1.0", "Content": "good  pictures with my experience,had camera for ten months ( a gift ) had taken in the  water no more than 10 times ,unfortunately the last time i used the camera it leaked in only 2 feet of water, camera totally ruined,factory did not honor warranty because i had no receipt.", "Date": "August 1, 2012"}, {"Title": "not so tough", "Author": "John A", "ReviewID": "R2XPS0UOB59ZET", "Overall": "1.0", "Content": "Bought this camera a while ago for travel, sports, snapshots, but never took it underwater until my trip to Aruba with my wife this June. I took the unit in the ocean, and it instantly filled up with water and stopped working. On the camera case itself it says \"waterproof to 5 meters\" but I don't think I had it even 5 centimeters. Waterproof, no.", "Date": "June 20, 2012"}, {"Title": "Water in back screen", "Author": "chadwick a haynes", "ReviewID": "RS3GIF9EIPI40", "Overall": "2.0", "Content": "I bought this camera and have used it twice. It worked great the first time I used it. It has water in the back screen the second time i used it. The back screen is not cracked. Water did NOT come in the camera from the battery and SD card door. It must have leaked around the screen. I WOULD BUY FROM SOMBODY THAT OFFERS A WARRANTY IF IT LEAKS LIKE BEST BUY!", "Date": "June 16, 2012"}, {"Title": "Not at all tough-warranty a must!", "Author": "Shaggy", "ReviewID": "R2ZC7988SG50EV", "Overall": "2.0", "Content": "I really wanted to like this camera and did except I felt I had been lied to about the \"tough\" quality of this camera.  I had it a year with light use and when I finally got to put it to the test while snorkeling in Tobago, the camera lasted no more than 10 minutes in the water and believe me I kept it well above the 15ft rule, and locked all the compartments and yes the Ocean ended up inside my expesive camera.I was 2 1/2 months over the year warranty and Olympus said to send it in and they might be able to do something, ahhh!!! that was cool of them, or so I thought.  I paid 15.00 to ship it to them, no prob.  I didn't hear if they even recieved it until I called them almost three weeks later.  The technician didn't even try to break it to me easy that they were not going to pay for a dime of it.  She said that olympus recommends that I change the seals in the camera every year, at 38.00 plus the additional shipping.  Are you kidding me?  I paid the extra money to get a tough camera and it can't take a lightweight snorkel trip and it has to be worked on yearly.  They said they could fix the camera for 127.00.  Great! Thanks Olympus, I can buy a new one for that price, No kidding!  So be cautious and buy the warranty if you insist on Olympus.", "Date": "April 30, 2012"}, {"Title": "Really, I hate this camera", "Author": "Bjorn Stromsness", "ReviewID": "R2RZJQZ2EE9PS0", "Overall": "2.0", "Content": "Turn the thing on and snap a picture.  For me, the odds are about 4:1 that the picture will be blurry. Unless I manually change settings the photos are almost always out of focus.  Takes forever to actually get the thing on and take a picture and I really dislike that lag time. The flash washes out pretty much any photo.  I only take pictures outside with this and my iPhone takes better pictures about 90% of the time.  Just wish the iPhone had better resolution, which it will soon.It's waterproof... so, that's good.I've had 3 other waterproof digital cameras and this is my least favorite. I'm looking forward to when it dies so I can justify getting a new one.", "Date": "April 21, 2012"}, {"Title": "Broken", "Author": "Mck", "ReviewID": "R1ZUM8BSWTBYRL", "Overall": "1.0", "Content": "Bought this from beach camera.  It was refurbished but I didn't think it would be broken.  I contacted them at first but then decided to try and learn about the camera, thinking it was my fault for it not working.It doesn't charge now or upload pictures to a pc.  It was always blurry and the menu option didn't work so I could never delete or view pictures.Waste of money and I wish Beach Camera would stand behind their sale! They told me to contact Olympus....who wont fix it because it is refurbished and bought from Beach Camera.  Buyer beware - dont buy from beach camera and dont buy refurbished!", "Date": "March 17, 2012"}, {"Title": "Hate this camera", "Author": "RiverRat", "ReviewID": "R2MM6Z6Q0HW6E8", "Overall": "1.0", "Content": "I normally use my dSLR, however when I am in the water, it is much easier (and safer) to use a waterproof camera.  I bought this to replace an old Olympus waterproof unit that I wore out.  This camera is awful.  Rarely does it take a photo that is actually in focus and it is super slow.  I came on to Amazon today to buy a Sony waterproof as a replacement for this worthless product and thought that I would write a review on it in hopes of someone avoiding the mistake I made.  Don't waste your money.", "Date": "March 11, 2012"}, {"Title": "Good camera gone bad?", "Author": "Tim", "ReviewID": "RILGM5ALRAPDK", "Overall": "2.0", "Content": "This camera has had an excellent reputation for durability, underwater performance and quality photos in the past. I was really looking forward to finally getting one...but it seems the newest \"tough\" version let the software geeks go a little nuts, while giving the durability the minimum attention.  If you are looking for a simple to use, tough camera that produces excellent photos, you will likely be frustrated with this camera. Its toughness appears to still be there, although I have not tested it to its limitations; only dropped from 1 foot or so and only took it to approx. 15' of depth.  I actually don't feel comfortable taking it to its underwater limitations. Have a dedicated underwater camera, the first thing I noted on this camera was the frail lid sealing mechanism which seals the water out of the battery, memory card and charging port. It closes so lightly that I don't believe the O-ring, which is already extremely thin to begin with, is put under much compression at all.  The next thing of concern is the lens protector which opens when you turn the camera on, and closes automatically when you turn it off. This unnecessary little feature appears flimsy and does not inspire much confidence.  If a lens protector is really necessary, they would be better off just recessing the lens more, or having a manual sliding cover. I expect it will be the first thing to break....only time will tell.  The REAL problem with this camera is the programing. It seems the slightest change in lighting conditions just throw this thing out of whack. Where a simple point and shoot camera would just show you exactly what you see...this camera will give you something totally unacceptable. Extreme over-exposures and under exposers seem to be the norm. Sudden movements, such as action shots or any spontaneous moving will show up as just a blur as well. It is possible that I just don't have its settings dialed in, but in my opinion I shouldn't have to do that to begin with.  So it appears that they have \"over engineered\" it from a photographers standpoint, and under engineered it from a robust simple toughness standpoint....NOT what I was looking for.  In short, I really wanted what this camera WAS, but not so happy with what it IS...", "Date": "March 10, 2012"}, {"Title": "Great So Far", "Author": "Fergy22", "ReviewID": "R1Q66ZPMPTG5I4", "Overall": "5.0", "Content": "I have had this camera for about a month now, SO Far it is great. I tested it in my fish tank worked great the fish were not to happy but great underwater photos and video. It seems to me the most important thing is to keep the seal on the door completely dry and dirt free. Must wipe the seal down after every underwater use so next use will keep the seal water tight. This is a point and shoot camera not a $1000 SLR so the photo quality is good for what it is. I am taking it on a cruise in about a month, so I will make sure I understand how the camera works and practice with it alot before I leave. I would recommend a second battery so you can keep shooting and not miss that perfect shot. The only complaint so far is the camera is small and my hands are big I havent found the perfect grip for it yet, and they should have included some type of wrist strap for it.", "Date": "February 5, 2012"}, {"Title": "Blah", "Author": "DRiggs", "ReviewID": "R3IHVTXF90VRV8", "Overall": "3.0", "Content": "First, please note that this camera can only be under water for 1 hour. I didn't keep it under water too long, but I didn't catch that until after I took it to Hawaii. This camera works *okay*. I typically don't buy anything that has less than 4 stars, but I was going to Hawaii and this was the best rated waterproof camera in my price range. The focus is too slow for my taste, and often it doesn't focus right; pictures are blurry. Good thing about digital cameras is you can tell right away. The time between pictures was also longer than I'd like. That said, the quality of pictures that were in-focus were good. And the underwater video turned out pretty good also. And... I resold it for more than I paid for it, so that was good. Yay for people who shop Craigslist and not Amazon. Ha.", "Date": "February 5, 2012"}, {"Title": "Great Camera for Any Use", "Author": "slowbutlow36", "ReviewID": "R1U55KLZSM0X76", "Overall": "5.0", "Content": "Great camera for kids, water, or any day use. Takes great underwater video and pictures. I love that I can give it to the kids and not worry about them breaking or damaging it!", "Date": "January 22, 2012"}, {"Title": "Olympus Stylus Tough 6020", "Author": "Donny D", "ReviewID": "R2RK1NM35UR8B5", "Overall": "5.0", "Content": "Amazing camera and great price. A little hard to use with macs but overall takes beautiful pictures and great video. My son already dropped it and it sounds fine after I picked it up. This is a good camera that I will purchase another in the future.", "Date": "January 3, 2012"}, {"Title": "stylus tough", "Author": "huntinmn", "ReviewID": "R2YDFH8CP5NRFX", "Overall": "2.0", "Content": "We bought this camera because of the waterproof feature.  We have used it in light rain and even checked before our trip in the bathtub.  It seemed to work fantastic.  However the first time used under water at a depth of 2 feet (snorkeling) bubbles came out of the lens and the camera quit working.  A little disappointed in that because the main reason for buying the camera was for this trip to the Virgin Islands.  Our friends have the same camera and has worked wonderfully in the same setting.  The camera is a point and shoot but is a little slow at the shooting.  Too bad it is not as tough as they claim.", "Date": "December 7, 2011"}, {"Title": "No complaints", "Author": "francoit hogue", "ReviewID": "R2URBXYTK5TVGG", "Overall": "5.0", "Content": "Love it, takes really good pictures. The quality of the underwater pictures is amazing. No complaints from me about this camera. I've had the camera since August and have been using it regularly.", "Date": "December 6, 2011"}, {"Title": "Poor camera", "Author": "Michael A. Tyler \"Tyler\"", "ReviewID": "R34KAJ79N9KN7X", "Overall": "1.0", "Content": "I've owned this camera for about 3 months. I have taken roughly 2000 pictures and despite sending it to an Olympus  rep and reading the manual cover to cover (which I rarely ever do) I still can not get this camera to focus properly. I actually had to buy a cheap Polaroid digital camera in Rome to salvage some pictures during a recent trip.  The Polaroid takes a much better photo even though it may be the cheapest camera on the market.  Do yourself a favor and buy another product.", "Date": "November 2, 2011"}, {"Title": "run of the mill point and shoot", "Author": "Kina", "ReviewID": "R12WWNCC5GFS29", "Overall": "3.0", "Content": "This is the same run of the mill point and shoot, pretty much the same as most and the same quality, there are a lot of features and the video recording is decent.", "Date": "October 24, 2011"}, {"Title": "Great Camera", "Author": "chris", "ReviewID": "R1B7M897N3VTR5", "Overall": "5.0", "Content": "This camera takes great pictures, great video, is the perfect size, easy to use, and quite possibly the best camera I have ever owned. I have had it wet and underwater many times, including a 20 minute test in the sink as soon as I got it to make sure it is 100% waterproof, and again the camera exceeded my expectations.", "Date": "October 17, 2011"}, {"Title": "Mac users beware!", "Author": "Desi Vial", "ReviewID": "R2O3I6RZE2EEZT", "Overall": "2.0", "Content": "The instructions provided with the camera, as well as the camera itself, are targeted toward PC users.  There are no instructions with the camera, and none I can find so far online, for Mac users.  The initial instructions for charging the battery and setup and initializing of the camera do not work with a Mac.  I had to call tech support to find out that you can not charge the battery on the Mac, you must use the adapter [provided] and a wall outlet.  The first tech support person told me I do not need to initialize the camera, and that when connected with my mac it will automatically download photos to iPhoto.  The truth:  It does not automatically download to iPhoto, and I still don't know if I need to initialize the camera [I've gotten opposite opinions from 2 tech people...they clearly are not trained well on Mac use].  Here is how to download photos to iPhoto:1. Insert the memory card [sold separately].2. Take some pictures.3. Turn the camera off.4. Connect it to your USB port on the Mac.  If iPhoto does not come up, click iPhoto and get it up on the screen.5. The camera should present a menu on the LCD screen, with one of the options being \"Storage.\"6. Scroll to \"Storage\" and press OK on the camera.7. Pics should now download to iPhoto [mine did].It took me 3 calls to tech support to find this out.  One tech person told me the problem was my iPhoto software and I should contact Apple [I thanked him, and called back to get a more knowledgeable person].  After 4 calls and 2 emails to tech support, I still do not know if I need to initialize the camera or not.  The camera is working, but apparently initializing provides the camera with valuable software???  Or provides the computer with the software???  I'm waiting for a reply on this.To their credit, Olympus tech support is prompt, once you get past the phone tree.  Select the option that allows you to talk to a person!  The tech support number [hard to find on the website] is 888-553-4448.My rating does not reflect the camera itself, just the fact that Olympus apparently decided to ignore a significant and growing percentage of their market, Mac users.  I expect more from Olympus.", "Date": "October 15, 2011"}, {"Title": "Exc Product for the Price!", "Author": "fgomecs", "ReviewID": "R6N4EWCEY0ZQ8", "Overall": "5.0", "Content": "The price was excellent, the camera is made for its purpose. The more features the more expensive the cameras get (I compared this with the Sony with GPS, the Olympus 610, 310 etc.) and this camera is what I needed - BUY WHAT YOU NEED DON'T BUY WHAT YOU WANT :). If I want more fancy stuff I can use my other Cannon Rebel XS. You decide if you want to pay more for fancy stuff. Good pick if you want an affordable, waterproof, backup camera. This will help me take good pictures were my Rebel can't be taken (rain forest, underwater, etc)", "Date": "October 12, 2011"}, {"Title": "Great Camera!", "Author": "EmilyR", "ReviewID": "RETEKUP1KX6V", "Overall": "5.0", "Content": "I've gone through many cameras over the years and I absolutely love this one! I love all the scene options, especially panorama. The menu is easy to understand and the screen is huge, which is great. I do however with there was a view finder so taking pictures in the dark would be easier.", "Date": "October 10, 2011"}, {"Title": "Stylus tough 14 mp camera", "Author": "PJ", "ReviewID": "R37392YZHV4HNV", "Overall": "5.0", "Content": "This is my second stylus water proof camera.  The first was a 7mp that unfortunately went missing.  I purchased these cameras to carry with me pretty much full time when I'm out and about so I'll not miss a \"photo of opportunity.\"  Because I am out in all sorts of weather I need the waterproof feature and the drop proof ruggedness.  It also acts as a backup for when I'm out with my full size camera and something goes wrong with it.Don't know that I would trust the waterproof feature 100% for underwater photography, especially if it has been opened in unfavorable conditions (at the beach) and the \"O\" ring seal gets contaminated (not an uncommon problem).  The warranty won't cover water intrusion damage in that case.Only caution I have is that the camera has limited capability in low light conditions.  Best to bring along a full size camera if you are shooting in low light or at least use a steady rest for the Stylus Tough.Great camera because of its survivable attributes!  Highly recommended if it fulfills your needs.", "Date": "October 8, 2011"}, {"Title": "Great purchase", "Author": "isabel ms", "ReviewID": "R1XZ60LMM6MP62", "Overall": "5.0", "Content": "The perfect camara for my family! Is very versatil,great pictures and fun to used.We carry all the time for a greats memories.", "Date": "October 7, 2011"}, {"Title": "Perfect !!!! works like a charm", "Author": "Steve Stamos", "ReviewID": "R9NWI6RLFRW2W", "Overall": "5.0", "Content": "This camera is great... i mean waterproof, you can't beat it !!!!  Super clear pictures, great video.Learn how to use some of the settings and you'll have a great camera.", "Date": "September 24, 2011"}, {"Title": "Great water proof camera", "Author": "monica ortega", "ReviewID": "R14UFZXADSVKZV", "Overall": "5.0", "Content": "Great waterproof camera. We used it on our trip to Puerto Rico and it was great. The under water shots and video were great.", "Date": "September 16, 2011"}, {"Title": "great camera", "Author": "will", "ReviewID": "RWWBRRONI944Z", "Overall": "5.0", "Content": "great camera does a great work of underwater picture i use it for scuba diving it in the underwater housing i,m really happy with the quality of the photos and the ease of use", "Date": "September 15, 2011"}, {"Title": "good deal", "Author": "John M. Praskey \"johnp3350\"", "ReviewID": "R2I6KUQR9BNVFM", "Overall": "5.0", "Content": "Have been using it for past few weeks works great taking regular photos was easy to use functions similar to my older olympic cameras, will try it out Sunday snorkeling", "Date": "September 15, 2011"}, {"Title": "Sometimes it doesnt want to focus", "Author": "AAAA", "ReviewID": "RPSPSRY5MP03C", "Overall": "3.0", "Content": "It works very well, but the only problem is that sometimes aftesr you have taken 3 or 4 pictures, suddenly it is impossible for the camera to focus and you have to turn of the camera and turn it on again to make it work, I cant say how durable it is, since I have just got it.", "Date": "September 5, 2011"}, {"Title": "Love it!", "Author": "Erin Johansen \"erin\"", "ReviewID": "R3I22ON4HNY6TZ", "Overall": "5.0", "Content": "Bought the camera for a trip to Hawaii and SOOOOO Happy I did!  Takes great pics and had great success with its ease of use and waterproof ability.  Definiately a worthwhile purchase for someone that likes adventure and to have fun and not worry about banging around their camera!", "Date": "August 30, 2011"}, {"Title": "olympus tough camera", "Author": "dbp", "ReviewID": "R2TP2FXZ3LA87Y", "Overall": "4.0", "Content": "This is a nice camera, specially I liked what it offered for the price, it takes nice pictures, it is easy to use, I don{t like it though that it always starts on the automatic setting when you turn on the camera even if you changed to scene or something else before, but I guess many people would rather start in auto mode than on their previously set mode in case they forget about it....", "Date": "August 16, 2011"}, {"Title": "buy a new camera and sent me a refurbished", "Author": "winston gomez", "ReviewID": "R1GHUDEUA8P2RX", "Overall": "1.0", "Content": "Debo decir que he sido engañado, compre y pague un articulo nuevo y recibi una camara remanufacturada. exijo un reembolso por la diferencia porque una camara reacondicionada cuesta mucho menos de lo que pague...NO RECOMIENDO COMPRAR EN ESTA TIENDA.", "Date": "August 15, 2011"}, {"Title": "Great little camera for family vactions", "Author": "Crazy Canuck \"McDuff\"", "ReviewID": "R1S79SYEMWAV9H", "Overall": "4.0", "Content": "Simple aim and shoot with above average picture quality. Only miss is the delay between operation of the shutter button and the actual shutter operation..........otherwise no other complaints.", "Date": "August 10, 2011"}, {"Title": "Good underwater camera for its price", "Author": "MightyMingster", "ReviewID": "RQX1GFHO8IR6V", "Overall": "5.0", "Content": "This is the second Olympus Tough that I have own. The first one died after 3 years of taking it the the beach and eventually the seals give up and let water in (sea water). This camera takes decent pictures during the day when there is plenty of light available. I would say the picture quality is decent, but isn't the best. However, its good compare it to other point and shoot cameras. The 720p HD video is great to have as well.I do have a couple of complain about this camera thus far. One, I took it to the pool and the beach already, I notice that each time, there is a little bit of water after I get home and try to load the pictures. This tells me that the camera will most likely fail within a couple of years due to water leaking into the seals already. Another point I do not like about this camera is that... every time I turn it on, it asks me to connect it to a pc before I start doing anything. I DON'T want to connect it to a PC so leave me alone. Just take the pictures like you are suppose to. There goes a few seconds wasted trying to get the camera to start taking pictures.Over all its a good camera and for the price, you can't beat it.", "Date": "August 4, 2011"}, {"Title": "It's not a great point and shoot camera..", "Author": "Richard Shuman", "ReviewID": "R2H9R0ZNMQJKPA", "Overall": "2.0", "Content": "If you're looking for a camera to wear while you're floating the river or swimming in a pool/lake/ocean then this is it. If you're looking for a camera to occasionally use in a wet environment, but otherwise you want to pull it out of your pocket and get a good photo quickly, this isn't it. I used this camera for almost a month trying to learn how to use it well, but never succeeded, i believe due to the camera itself. The iAuto mode rarely turned out a picture in focus and I was having to take multiple of the same shot to get one decent one. Although I believe something was internally wrong with my camera, I was NEVER able to get an in focus picture when zooming more than half way in (using either digital or optical zoom). To get a quality shot it I feel like you have to select the correct camera setting first, which just adds time and annoyance. I've been using Canon Powershots the past 10 years and this camera doesn't even compare to the Canon's point and shoot capability. Just my 2 cents!", "Date": "July 30, 2011"}, {"Title": "Nice, but no owner's manual or software included", "Author": "Scott Humphrey", "ReviewID": "R1JI4BACV3JZWX", "Overall": "4.0", "Content": "We ordered this through Amazon but they fulfilled it for Beach Camera.  Good price, nice clear pictures.  It has a built-in owner's manual to some extent, but when we tried to initialize it following that manual it jammed up and wouldn't complete the function.  When we tried to troubleshoot, it referred us to an owner's manual.  Again, it did not come with any printed owner's manual OR software although the internal manual also referenced included software.After much frustration getting the camera initialized, without which you cannot download pictures to your computer, my husband went to Olympus's web site and downloaded both the manual and software.  Now the camera is functioning well.Maybe vendors other than Beach Camera are including the manual/software, or maybe we just got one boxed by someone having a bad day at the factory and it was accidentally omitted.  Not sure, thought I'd warn others.Hard to rate because we haven't been through all the paces with it yet.  However, pictures are clear and my 10 year old son, who it is for, seems to be picking up on the different features quickly on his own.  Gave it 4 stars because of omitted support materials.- Mominator", "Date": "July 29, 2011"}, {"Title": "Nice camera", "Author": "john", "ReviewID": "R2SQDPC526OI3I", "Overall": "4.0", "Content": "Really nice camera, I bought it for my brother in law.He says the camera works very good for its price.It is fast and it is waterproof!I gave it 4 stars because I had the previous model and it was damaged by a friend of mine in our pool... No so waterproof... Apparently the battery cap was not properly closed so water came in....  I guess they should make a better battery cover...", "Date": "July 22, 2011"}, {"Title": "great deal on a quality camera", "Author": "j", "ReviewID": "R1SPEOJQUDSRQ3", "Overall": "5.0", "Content": "this is a great camera that fully lives up to product specifications and expectations.I work at a camp in the Florida Keys where we go paddling, hiking, kayaking, snorkeling and fishing - we're out in the sun and saltwater literally all day, every day.  So far, this camera has endured pretty rustic conditions without sacrificing quality.  It takes great pictures and video both in and out of the water and is pretty easy to use.  This camera also picks up sound well in video mode.The 'manual' is stored in the camera, which was new to me, but it wasn't difficult to figure out.  All in all, I like that better because it saves resources, as well as the added benefit of a 'tutorial' scenario where the user can practice different shooting modes and methods, etc.Battery life is satisfactory - for me, it's lasted about 4-5 days without a recharge, with pretty frequent use during that time period, of both video and picture mode.The software that comes with the camera is a little odd, but that might just be me, and either way it is in no way a deal-breaker.Comes with USB cable and A/C adapter, as well as a rechargeable battery.", "Date": "July 16, 2011"}, {"Title": "waterproof, great pictures and HD video at a great price!", "Author": "Mr. Do it All", "ReviewID": "R30EEPU4L3P1IR", "Overall": "5.0", "Content": "love this waterproof camera, i have bought one for my immediate family and one as a gift to my best friend and everyone loves it! 14mp sensor, good optical zoom with image stabilization. playback of hd video via the mini hdmi port so it connect to our big screen no problem. in camera panorama is nice too!regarding the shutter lag reviews. While i will admit the shutter lag (time in between shots) is not the fastest it is also not the slowest and actually is about the same as any previous point and shoot i have owned in the past. welcome to the reality of point and shoot digital cameras where shutter lag can varry by tenths of a second between models, oh please! its all good! The olympus stylus 6020 with all its features was a good deal for us as a regular point and shoot and when you add the TOUGH factor it was a no brainer!", "Date": "July 14, 2011"}, {"Title": "Camera quality", "Author": "Chase", "ReviewID": "R3DFQS0MD86UR3", "Overall": "4.0", "Content": "The camera is an excellent camera. Although, I did not receive instructions for camera use. Pictures got deleted either when the camera ran out of batteries or when the battery got taken out. Other than those faults the camer is a great camera!", "Date": "July 10, 2011"}, {"Title": "Great Camera", "Author": "Brazel", "ReviewID": "ROAYCXY5CBTCX", "Overall": "5.0", "Content": "Well with 4 kids we needed something tough. This is a great sturdy camera. The pictures are look great and the zoom is perfect for us. We travel a good bit and this camera is easy to use and easy to carry in my purse. Highly recommended!", "Date": "July 4, 2011"}, {"Title": "Great so far!", "Author": "MarinesGirl2011", "ReviewID": "R29AN3LTQPRM9W", "Overall": "5.0", "Content": "Ordered this product on Friday the 10th, it shipped yesterday, and I received it today! So far, I love it! I had to buy this camera for my boyfriend who is currently in Afghanistan. He broke his brand new camera during a sand storm, so he needed one that would not only survive that, but also himself (he's not so great with keeping cameras alive). I've been playing around with it and so far it seems to be a great camera. I'll find out what he thinks once I ship it off to him. Great service, fast shipping, and the camera came with everything it needed! Definitely look forward to buying from seller again!", "Date": "June 14, 2011"}, {"Title": "Instruction very lacking.", "Author": "P. Michael Spirito", "ReviewID": "R3TNVG9UIE58VS", "Overall": "3.0", "Content": "I like the camera, BUT.  You had better be a mind reader to figure out how to operate it.  This is my 4th digital camera in the past 10 years.  I am no fool. The instruction sheet was one page written in a dozen languages.  Arabic and Chinese among others.  It starts with \"plug the camera into a computer AND load the software\"  What software?  There is none! Its the firmware in the camera and it is already there.  (I checked with Olympus) AND no computer is required.Icons and settings?  OMG.  More than you can shake a tripod at.  There are three options for the push to shoot button.  There is one photo per click.  And more than one photo per click.  And third, \"Faster\" than more than one per click.  The third setting is hold the button down and it will continous shoot photos.  Yea, right.  I have a 14GB-Class-10 memory card installed. Class-10 is the fastest card there is.  You can't tell the difference in speed of the photos being taken.  Slow, very slow.What is the real difference between; \"Automatically optimizes the camera's settings based on the shooting situation\"  and  \"The camera is set automatically based on the scene.\"  There are 11 scene modes and 21 sub-scene modes.  There are three underwater settings.  Close up, landscape, and action.  Does this camera do anything automatically?BOTTOM LINE:  Good for the money, it shoots underwater and is small and shock-proof. Operation is aggravating.", "Date": "May 17, 2011"}, {"Title": "It only lasted a month", "Author": "Chris S. Bizzelle", "ReviewID": "R29MCCWFY08MFV", "Overall": "2.0", "Content": "My wife and I saw this camera in Best Buy and she really liked it.  We bought it without thinking to check Amazon, which was a huge mistake it was $100 cheaper on Amazon.  We returned the Best Buy one and ordered it from Amazon.  We got it for our trip to a beach resort.  Well the first few times we used it in the pool it started acting really funny.  The screen would work, show menus but the camera itself wouldnt show anything ont he screen, yes the lens was open.  It was very odd, we waited a few minutes and tried again and it worked fine.  We thought it was just a glitch and moved on.  Sadly, it wasnt.  We took it in the pool the next day and noticed it had water in the battery compartment, even with the latch set to locked.  Luckily we went back to the room and I had one day left to request a return with Amazon, and since its defective they paid the return shipping.  I really want to like this camera and might buy another one after were refunded.  It takes nice pictures and does great video but I fear its not really reliable.  We did buy a Squaretrade warranty, I'd suggest doing that if you buy one, its cheap and will protect you for I believe 2 years.  We had another Water proof camera but it failed after a year and a half.", "Date": "May 12, 2011"}, {"Title": "Olympus Tough Review", "Author": "Liz", "ReviewID": "R1PU166Q6PDBMC", "Overall": "5.0", "Content": "The camera is great.  I love the stability control which allows for great pictures even when your hands aren't the steadiest.  I also love that you don't have to freak out if you drop it, or submerge in water.", "Date": "April 25, 2011"}, {"Title": "Great Camera", "Author": "Cardinal", "ReviewID": "R106OULQZDXL5A", "Overall": "5.0", "Content": "We bought this for our teenage son to take on an upcoming trip.  The camera is easy to use, and takes incredible pictures.  We are thinking of buying another on just for us!", "Date": "April 20, 2011"}, {"Title": "great camera", "Author": "papa", "ReviewID": "R3PKNXGEDZ96WY", "Overall": "5.0", "Content": "camera is great, just that it didn't come with any real instructions, like most cameras do. My previous Olympus did. This one shoots HD in the video mode. If you already are familiar with digital cameras, then one could possibly figure this one out, but instructions basically told you how to open up and charge the battery, nothing about the different modes, etc, had to go on line to find some adequate instructions. Amazon still has the best deals and pricing for cameras.", "Date": "April 10, 2011"}, {"Title": "Exactally what I wanted", "Author": "Allan R. Erickson", "ReviewID": "R2AQE4MK7THZDE", "Overall": "5.0", "Content": "I have always enjoyed Olympus products. The Olympus Stylus Tough 6020 lives up to my expectations. Excellent qualify, ease of use with intuitive controls and great pictures. The tap control is very handy when wearing gloves under water. I highly recommend this camera. The fact that it is a factory reconditioned camera with full warrenty at a fraction of the cost of a new one is just icing on the cake.", "Date": "April 4, 2011"}, {"Title": "Awesome camera", "Author": "luckycarms03", "ReviewID": "R9YV7GXK1HF3O", "Overall": "5.0", "Content": "This camera is wonderful wonderful wonderful and ideal if you are taking pictures anywhere near water...I bought it for my cruise recently and was so happy I did. I snorkeled, did some scuba diving, and jet skiing and I got awesome underwater and land photos. What I love about it is that you can set the scene to whatever environment you are in. It also has a function that allows for shooting continuously. This camera is completely waterproof as long as you keep the battery encasement dry and closed (and it has a lock for safety). I was worried about this at first but soon felt comfortable that it wouldn't be ruined if I go snorkeing with it. It is waterproof up to 16 feet and shockproof as well. An awesome buy! (make sure to order a memory chip also!)", "Date": "January 30, 2011"}, {"Title": "what happened?", "Author": "J. D. Sprecher \"jds'boo\"", "ReviewID": "REL0EGYEA2WE2", "Overall": "1.0", "Content": "I own an Olympus Stylus 720sw that has been awesome. It survived a fall off the car hood @ 20 mph and worked. So I was excited to upgrade to this model for a recent Honduras trip. I did take about 200 shots that were of a comparable quality to the 720, I have not really checked out closely from the memory card. The 1st time I took it in snorkeling at surface level, I got 1 picture and the controls/screen went haywire. I left the water and dried off the camera and discovered that salt water had gotten in to the battery compartment and shorted everything out. The other camera had survived the fall from the car, grade IV whitewater inside and outside my life vest and multiple underwater uses. I sent the camera back to Amazon with explanation and they gave me a refund no questions asked. The battery compartment was closed so I don't know if this was a defect or fluke. I really like the Olympus tough series, but am hesitant to try another camera of this model. Any thoughts on this or recomend a different model or brand?", "Date": "January 24, 2011"}, {"Title": "AWESOME PRODUCT", "Author": "Bonnie", "ReviewID": "R27TQJGKNTPU00", "Overall": "5.0", "Content": "When I ordered my camera I received it earlier then the estimated time, which is awesome. When I got the camera it came looking great. When using the camera underwater in the pool, along with outside the pool the camera took great pictures. The camera has a lot of settings to choose from to make sure you are taking a good picture. I love how the camera is very durable and can be taken underwater. Was a fun and new experience with this camera and I would recommend it to everyone! It was a great buy!", "Date": "December 30, 2010"}, {"Title": "Wouldnt wast you time", "Author": "Mike", "ReviewID": "R3HHCF167DPXNQ", "Overall": "2.0", "Content": "Was given this camera as a birthday prescent just before my holliday to Thailand. To all the people saying how good the picture quality is, you must be working for olympus! I am so dissapointed, thought id taken some lovely pics but when they were put onto my pc they were all blurred, poor colour with no chrisp in any of them. Albiet the video recording is good and it is a strong camera with the benefit of being waterproof, but I want it to take pictures! I am now about to go and buy a new camera, feel sorry for my Mum for wasting her money!", "Date": "December 19, 2010"}, {"Title": "Okay Camera", "Author": "Jeannine", "ReviewID": "R34B3MK3JU81WY", "Overall": "4.0", "Content": "I recently got this camera as a gift and it is alright. It is great for the underwater features but other than that, I feel like it could take better pictures. Even when focused, most of the pictures come out blurry. I would recommend this camera but not for everyday use, then I would get something more complex. If you are a photographer this is not the camera for you..", "Date": "December 5, 2010"}, {"Title": "best camera ever", "Author": "nueves", "ReviewID": "RZJ4GUHDVJUZB", "Overall": "5.0", "Content": "underwater video!leave it in the car at night!nice magic photo option pinhole!I love this cameralittle zoom options - but then you know lens zoom will not breakAlso good prompt delivery on item...YES!", "Date": "September 23, 2010"}, {"Title": "Buy the camera and not the package", "Author": "B97209 \"@Large\"", "ReviewID": "R12XD4SNVVY5Z8", "Overall": "4.0", "Content": "I bought one of the Tough cameras a few years ago.  I like it very much and got this one as a gift for my fiancee.  We use them for video half the time.  We use them skiing, surfing, sailing as well as the usual activities. Since it was a gift, I bought the bundled memory and case with it.  The memory is the wrong memory.  It is the memory for the older model.  The memory was so cheap that it wasn't worth trying to return it.  The bundle gets four stars while the camera gets five.", "Date": "June 16, 2010"}, {"Title": "Not Waterproof", "Author": "Lisa W \"LRW\"", "ReviewID": "R2K9MODA6F0HVM", "Overall": "1.0", "Content": "I had high hopes for this camera, having read that many waterproof digital cameras have issues with water getting into them.  Being one of the newest of the underwater digital cameras, I had reasoned that surely the leak issues had been resolved.  I bought this for snorkeling in Hawaii and on the second use, water got into it.  Luckily I purchased black tie protection on it from Best Buy so I don't anticipate any problems with repair or return.  But now I am stuck on vacation without an underwater camera.  Save your money and buy one with a separate underwater housing- wish I had now.  Probably going single use at this point.", "Date": "April 5, 2010"}, {"Title": "Video Sucks, Images are soft", "Author": "Neil Drake", "ReviewID": "R14MSJHU7NIFKD", "Overall": "1.0", "Content": "This camera is truly garbage.  I've been a photographer for quite some time and not the \"I have a nice D-SLR so now I think I'm a photographer type\"It can't shoot video near water with the sun out, and the images it takes are soft, poorly exposed and bleached, regardless of settingsSkip to 1:08 to see how terrible it shoots video on the water into the sun.[...]", "Date": "August 30, 2011"}, {"Title": "incredibly disappointed", "Author": "BostonClick", "ReviewID": "RPA6YHQ1RJWZ4", "Overall": "2.0", "Content": "The Olympus Stylus was the only camera I owned that cracked its LCD - and it didn't even fall. It was in bag that tipped. I am incredibly disappointed in Olympus and this camera. (That said, pictures it took during the short period of time I used it were great. I also liked the digital filters that come with the camera)", "Date": "July 9, 2011"}, {"Title": "Not compatible with MAC", "Author": "Lilly", "ReviewID": "RW7NOV0TT6JBM", "Overall": "3.0", "Content": "The puictures are great but I havent tried underwater yet so far its good, but ive had to insert the memory card into my old camera to upload pictures because it doesnt register on MACs. Maybe there is compatible software out there I am unaware of?", "Date": "June 28, 2011"}, {"Title": "Less than a year and we have had to send it back twice.", "Author": "Amber D. Murray", "ReviewID": "R9EQSRTCZBLV", "Overall": "1.0", "Content": "So frustrated with this camera. We bought it because we live in a tropical area and go to the beach a couple times a week. The second time at the beach, it filled up with the water. The battery compartment was closed and locked. We sent it back for repair and they replaced it... We thought it was a fluke... Nope. We just took it to the beach and AGAIN the battery compartment filled with water. The screen is full of water. I am over it. I want a camera that is not going to fill up every time we take it to the beach. I have been over and over the instruction manual trying to figure out if we are doing something wrong and I am coming up with nothing. Maybe it just hates Guam. We have sent it back again. Hopefully they will replace it again and then I will immediately be putting it on Ebay and using the funds to find my husband a different water proof camera. This is ridicules.", "Date": "April 25, 2011"}, {"Title": "Found the perfect camera (for me atleast)", "Author": "Moxie", "ReviewID": "R19PXHYJYKSOKI", "Overall": "4.0", "Content": "There were some very specific things that I was looking for in a new camera.-- Drop proof (dropped my old one which lead to its official breakage)-- Waterproof (I want to be able to take it in a pool)-- Able to withstand heat (I live in the desert, triple digits are not uncommon)-- The lens must not go out/expand from the camera (a part of the lens on my old camera broke off due to this)With those criteria, I went on a hunt. Luckily, this hunt was during a sale or I might not have been so lucky. The main purpose for my camera is to take quick pictures (friends, pets, random places I go). I am not going to be going on an amazing vacation and need amazing, stellar pictures that sell them self.Come to find out, I am pleased. Maybe that is because prior to this, for the last 6 months, I have only had my Blackberry (2.0 megapixels) camera. The quality is really good but does take a considerable amount of time to get used to the menu settings (I still don't think I am). I have played around with it a bit and have realized the difference between some of the most common settings. I am thankful for the pet feature (though I use sport more often for this as I have a kitten) and firework setting.Also, night shooting seems to be sub par... so just do not plan to use it for that.Word to the wise, get multiple batteries. It tends to drain quickly unless you compromise quality. Particularly if you are going somewhere all day (like we went to Disneyland and took 4 batteries for an all day venture). It does not charge in my computer and must be charged in a wall. But a spare wall charger while you are at it if you want as well.All in all, the quality is great for what I need it to be. Point, shoot, forget. I want to throw it in my purse and not be concerned. It does this job and far beyond, thankfully.It does not really come with an instruction manual to speak of, so be prepared to play around a lot and have things not make sense at first.", "Date": "June 13, 2010"}, {"Title": "Returned!  Way too slow", "Author": "G. Countryman", "ReviewID": "R34MGO0SMIZEFD", "Overall": "1.0", "Content": "I've been looking at getting this camera for a while.  I finally decided to get it and ended up being very disappointed.  The response was way too slow.  When I push the button to take a picture I don't want a delay.  I'm used to the quality of my Canon Elph and this camera did not compare.  Despite the fact that I was very attracted by the water-proof and shock-proof capabilities I decided to return it.", "Date": "July 2, 2010"}, {"Title": "Nothing good about this camera", "Author": "Neil Jauquet", "ReviewID": "R3329ZLXRJOZM6", "Overall": "1.0", "Content": "I bought this camera in replacement of my former Olympus Stylus 720SW which had broken after my son opened the battery cover while taking pictures in the lake. I love, love, love my 720SW, and assumed that the current Olympus water-proof cameras would be an equally quality product.  WOW, I was wrong.Dislikes:1.) Large for a \"in-the-pocket\" P&S; camera.2.) Exterior material selection felt cheap and plasticy.3.) No physical manual.  Only a PDF manual that the camera downloads onto your computer the first time you plug it in.4.) User interface is horrible. Navigating through the menus to change settings, is not intuitive and not organized.5.) Picture quality is poor when you down select anything less than 14MP.6.) No advanced picture taking settings like \"available light\" , \"candle light\" , \"behind glass\" & \"night portrait.\"  All settings that my old 720SW had and which I used a lot.7.) Start up speed horribly slow, losing the kodak moments.  I read on some reviews that you could change this.  But the lack of intuitive or organized menu, I had no idea on how to get to the screen to change it.  Did I mention that there is no physical manual?Hates:8.) IT WOULD LOCK UP after taking pictures occasionally.  You would take a picture, the flash would go off, but the screen would sit in the \"thinking\" position.  The only way to get it to work again, was to pull the battery out, put it back in and turn it on again. Utterly unacceptable.9.) IT WOULD SHUT OFF without reason while I was setting up a posed picture.  Battery charged, no buttons pressed, just sitting there, lining the kids up or whatever, and 'beep' the camera shut off.  Again COMPLETELY UNACCEPTABLE.Bottom Line: DO NOT BUY THIS CAMERA!!!  Its likely the two \"Hates\" that I listed were indications of a defective camera. but the SEVEN items that I listed above that are reasons enough that I would not recommend the camera to anyone.Thankfully the seller -- Beach Camera Company -- authorized a return for full refund.  Which we did, and bought then a Panasonic Lumix TS3.  So far we love that camera. Better build quality, better picture quality, better user interface.If you are looking for a water-proof rugged camera, do NOT and I repeat do NOT buy this Olympus.", "Date": "November 12, 2011"}, {"Title": "Terrible pictures", "Author": "Guillermo Monroy", "ReviewID": "R26TN75G5KHZM3", "Overall": "1.0", "Content": "This is my fourth digital camara, having Sony and Cannon before buying this one. The camara is definitely durable many functions and options but poor picture quality. Most of the pictures come blurry and the color of the pictures is greyish. The flash is very poor. Probably seven out of ten pictures are terrible. I consider my self pretty knowledgeable in picture taking and I have tried changing all the functions and nothing improves the quality. Do not buy this camara!", "Date": "September 12, 2010"}, {"Title": "Power Button Too Sensitive", "Author": "Amazon Customer \"Nikki L\"", "ReviewID": "R3EHDVPWX0ZEP5", "Overall": "2.0", "Content": "I have one really big problem with the camera - it continually turns on when it's in my purse. I know I should probably have it in a case but I figure that an indestructible camera shouldn't need extra protection. On many occasions, the camera will turn on in my purse and then make an hour long video which will completely drain my battery. It's incredibly frustrating and has led to me not having enough juice to take pictures.The waterproof lock on the battery also doesn't seems very secure to me. I feel like I could pry it open pretty easily. This is the second waterproof/damage proof camera I've owned (I lost the first and this was a little less expensive as a replacement) so it's worrisome that I feel the waterproof measures aren't very helpful.", "Date": "March 28, 2012"}, {"Title": "Camera is too fragile, too expensive to repair", "Author": "Bevin R. Brett \"bookworm\"", "ReviewID": "R3JFSDY2TE0W87", "Overall": "1.0", "Content": "I have bought four of these cameras over the last four years.  They work fine as a camera.  But they aren't tough.  The shutter on the front gets gunk in it, and stops working properly.  At about 6 feet under water, the second one died a horrible death.  The third one died just after I had bought a fourth.  If it had died before, I would not have bought the fourth.  It just stopped working, although it has never been roughly treated and has not been more than a few feet under water.  They want $120 to fix it....  I'm going to try the Intova-CP9-Compact-Waterproof-Digital - cheaper than having this one repaired just to die again.", "Date": "January 23, 2012"}, {"Title": "HORRIBLE PRODUCT", "Author": "Brittany Poling", "ReviewID": "R28XE3FMPJM33I", "Overall": "1.0", "Content": "I purchased this camera from New Harbor Distributors and the entire purchase order was defective. The charger was never sent, only an empty box and the camera stopped working within the first month. The camera is supposed to be waterproof and shockproof, but the minute I went into the water the shutter broke as well as the digital screen. DO NOT BUY THIS PRODUCT OR ANYTHING ELSE FROM NEW HARBOR DISTRIBUTOR! You will loose your money.", "Date": "December 26, 2011"}, {"Title": "FACTURA", "Author": "CARLOS SANCHEZ", "ReviewID": "R1Z63WDF9T6GRR", "Overall": "4.0", "Content": "BUENAS TARDES AMIGOS DE AMAZONLA CAMARA FOTOGRAFICA PRESENTA UNA FALLA Y PARA QUE EL SERVICIO TECNICO ME LA REPARE ME SOLICITAN LA FACTURA DE COMPRA DE LA CAMARA.POR FAVOR NECESITO QUE ME LA ENVIEN A MI CORREO ELECTRONICO PARA PODER ENTREGARLA EN SERVICIO TECNICO Y ME REPAREN LA FALLA DE LA CAMARA FOTOGRAFICA.GRACIAS POR SU ACOSTUMBRADO APOYO", "Date": "September 7, 2011"}, {"Title": "Comparison to older version Olympus Stylus", "Author": "Moira Lowe \"mclfromct\"", "ReviewID": "R2MUDAFGDGAL9W", "Overall": "3.0", "Content": "I bought this camera to replace my Olympus Stylus 770SW that recently failed due to a water leak after 4 years of moderate use.  I hadn't realized Olympus recommends changing the protective seal every year, so maybe that was the cause.  I was very happy with my old camera, so decided to replace it with the current mode.  The Olympus 6020 seemed to fit the bill and came with a few new features.  I was excited to try it.I received my package in 2 days (love Amazon Prime!) but I have to be honest, I immediately wanted to return it.  I haven't yet, as I decided to see if it will grow on me.  To be fair, I am using my old Olympus as a baseline, so others may not have the same expectations.Pros1.  Uses a standard SD card.  The old version used a smaller version which meant I couldn't swap them out with other cameras (yes, we own several different digital cameras.)2.  I like the black body - very sleek.Cons1. To charge the battery, you leave the battery in the camera, open the slot where the batter/SD card are, and put the attach the charger to there.  This may sound silly, but I prefer a standalone charger.  Now I just have an extra cord I have to remember which divide it belongs to.  The old camera had a separate charger where I could put the batter in.  I just liked that set up better.  I still have the old charger, so I was hoping it would work, but the battery is different, so no luck.2.  Not Mac compatible.  I did some research and read it was Mac compatible, but not true.  Only compatible to download the manual (see # 3 below).  It is not compatible with the Mac software and users have reported issues in transferring pictures to a Mac.  I have done some research and understand there is other Olympus software that may work.  I will try that and report back.3. No manual with the camera.  Seriously.  Who doesn't provide a manual?  Well, technically they do, but it is inside the camera. So, you have to connect your camera to a PC and then read your manual online.  I don't generally read the manual cover to cover, but I do keep them in my camera case so when something crops up (on vacation, for example), I can check the manual and adjust.  Well, I won't be able to do that unless I am also toting around my laptop.  So, I guess I better read and memorize that manual, huh?I haven't actually taken any pictures with it yet.  We are going on a beach vacation in 10 days and I am still deciding whether to keep this or exchange it for something else.  Problem is, I can't find much else I like out there.  I don't understand why Olympus messed with a good product.  My old 770SW was great.  Maybe I should check for one still on the market.If I decide to keep the camera (which I probably will) I will report back on how it actually works.  I did invest in the highest grade memory card recommended by Olympus so that should help with speed.  The one flaw of the old Olympus was it was S-L-O-W!!!!So, all in all, this is an okay camera.  I just wish Olympus understood the phrase, \"If it ain't broke, don't fix it!\"", "Date": "August 3, 2011"}, {"Title": "Excellent", "Author": "lucytot", "ReviewID": "RWO97GUP1310Y", "Overall": "5.0", "Content": "Excellent pictures video and good quality, the color are very strong, you can have some fun when you try to get pictures over the water!", "Date": "June 7, 2011"}, {"Title": "Olympus Stylus Tough", "Author": "Prelude2akiss21", "ReviewID": "R1OA7RV8EMH4RI", "Overall": "5.0", "Content": "AMAZING! I received the camera I purchased 2 days after I ordered it and it was in the exact condition it was said to be in!", "Date": "May 18, 2011"}, {"Title": "Takes Great Pictures", "Author": "photogirl1987", "ReviewID": "R1A21TLV0TM9J9", "Overall": "5.0", "Content": "This camera takes great pictures.  I love it so much!  I like the panormic feature of the camera and the multi shot capabilities.  I haven't been able to take it in the water yet.. but can't wait! High Quality camera!!", "Date": "May 7, 2011"}, {"Title": "Did not last...", "Author": "Rich", "ReviewID": "R24TUEI3V40OZU", "Overall": "1.0", "Content": "I used my friends Olympus Stylus Tough 8000 last year on a snorkeling trip in the Dominican Republic. I completely submerged the camera for hours and it worked great. I snorkeled several times for the whole week and it did not fail. So I opted to buy my own Olympus to use on my next trip to Mexico. I used the camera the same way I did with my friends camera and water seeped into the camera. I thought that with the newer model 6020 (the old is 6000) they improved on a already good camera but NO. The camera was definitely lighter which seemed to me to be more fragile than the old model.  So the camera eventually didn't work. It wasn't that tough afterall as the Olympus Website promotes it to be.", "Date": "January 7, 2011"}, {"Title": "Arrived with defects!!!", "Author": null, "ReviewID": "R2LUU6RUR4I81K", "Overall": "1.0", "Content": "The only thing I did was to charge the battery. It went not possible to take one picture after the camera arrived, it came with defects.", "Date": "September 3, 2010"}, {"Title": "Couldn't be more disappointed", "Author": "Richard Graham", "ReviewID": "RSJXY2SK7W9BQ", "Overall": "1.0", "Content": "My sister wanted to give me a digital camera I've been longing for since it was introduced a few years back...the Olympus Stylus Tough...waterproof, shock resistant, great images.  But, to save a few coins because she'd have to ship it to me here in China, she opted for a refurbished, warranted 6020 model.  It arrived yesterday, shiny and black and glittery chrome...I counted all the pieces in the box and checked them against the Quick Start up guide, then sat down at my PC to get ready to ENJOY my new camera...first one in more than 10 years!  USB cable connected? Check, camera affirmed this warning me not to remove the cable and showing me a Big Z with an arrow at each end indicating, I suppose, the interactive setup process.  Step followed step until finally ib was setup and my PC's pictures found and added to ib's library.  I went to have dinner while the Tough finished charging.  An hour and a half later it said it was 100%.  Disconnect from the PC and cable and turn on...a slight hesitation then a little clink to show the lens guard was open...the monitor screen lit up...gray...and...nothing, nada, zip.  No image, no message, no view of the room in front of the camera ready to focus and shoot, NOT A D____ THING!  I reviewed instructions.  Charged the camera a bit longer with the AC adapter, and got the bright idea of trying to turn the cam on while it was connected to the AC.  With some trepidation I depressed the tiny on/off button and, LO and BEHOLD a little tune played and a block letter OLYMPUS appeared on the screen.  Nothing more.  In frustration I poked buttons as indicated, menu etc and finally there was a whirring sound and the letter P as promised, appeared right of center and slid over to the top of a list...possibly the current settings?  A few second more and that \"clinking\" sound of the lens guard closing told me nothing more was going to happen.  A half dozen more tries produced the same result.  No lens capture, no images, no messages.  Dead.  A lemon?  An unchecked refurb from Beach and Amazon?  Dunno, but nobody seems to be answering at Olympus ...well, once, but the call quality was so poor, THEY hung up.  Maybe...just maybe, the great camera I've longed for for so long is ...just waiting for customer support, or repair or replacement...but, the documents warn...NO International Warranty is available.", "Date": "March 18, 2011"}, {"Title": "Oly", "Author": "Marc", "ReviewID": "R1HNALRIGF9YLB", "Overall": "5.0", "Content": "Had trouble with the first camera I received but was taken care of right away. Excellent product and service", "Date": "May 23, 2010"}, {"Title": "not mac compatible as advertised!", "Author": "Peter D. Stickney", "ReviewID": "R25T05GSIUY2EK", "Overall": "1.0", "Content": "Dont buy this camera if you have a Mac. The box says its Mac compatible but you need to use only windows to initialize the camera per the manual!Someone has to stand up and tell these people that we aren't all computer geeks . These things are supposed to make life simple. This camera sounds great if you want to deal with a windows based system with all its quirks and flaws.Also buying through Amazon results in tons of email especially if your order is spread amond a few companies. I'm attempting to get refunds an my returns and doudt I'll ever see them unless I spend hours screwing with it.!!the button for to \"Tag this Product\" which is recommended doesn't work!AVOID AMAZON  unless you have nothing better to do than deal with this mess!", "Date": "March 17, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14 megapixel high-resolution CCD\n5x optical zoom allows you to get dramatically close to the action, and capture everyone and anyone in sight\n2.7\" LCD features an extra-wide viewing angle and anti-glare technology for easier composing and shooting even in direct, bright sunlight\nRevolutionary system of waterproof seals and gaskets keeps water out so you can take pictures as deep as 16 feet underwater\nDurable metal body with an innovative shock-absorbing technology protects it from drops of up to 5 feet", "Name": "Olympus 14 Megapixel Stylus Tough-6020 Digital Camera- Choose Color", "ImgURL": "http://ecx.images-amazon.com/images/I/41PlpvExtAL._SX300_.jpg", "ProductID": "B0031RGETU"}}