{"Reviews": [{"Title": "7030 Olympus", "Author": "Snookie", "ReviewID": "RHZIE9YYRZC0S", "Overall": "5.0", "Content": "This camera is small enough to carry with you where ever you go and does a big camera job with very clear photos.", "Date": "May 26, 2012"}, {"Title": "Love this camera!", "Author": "Nicole M. Hanna", "ReviewID": "R1TNK54RYWOU1D", "Overall": "5.0", "Content": "I barely have to edit the pictures I take with this camera. The pink/purple color is awesome! Takes great pictures!", "Date": "December 23, 2011"}, {"Title": "Absolutely great for the price", "Author": "Adam S.", "ReviewID": "R1HVMSVUAVC3DE", "Overall": "4.0", "Content": "With this purchase i continue to find that Olympus is a great value for the money. We have had the camera for sometime and it is a solid performer for what it is. You can get fantastic picture quality when in the best light but like most cameras in this range darker lighting will give grainier and less crisp photo's and video.Ease of use is good, especially if you're familiar with Olympus products. The user guide is built into the camera so it's always with you.Video is what you'd expect at this price range, meaning it's not the best you will get and is probably a little outdated in terms of resolution now that HD is coming around. The audio is a little above par but of course with the caveat that it's good for the price range.Overall you'll find this camera reliable and capable. If you're looking for more than this camera offers you should probably be bumping up your price range.", "Date": "November 12, 2011"}, {"Title": "Not a bad price but.....", "Author": "Barbara Bouton \"Barbara Bouton\"", "ReviewID": "R36ER6HEGZDW2B", "Overall": "4.0", "Content": "I bought an Olympus Stylus 7030 with this past year, a brand new one but someone decided to steal it and I did not have the money to replace it with another new one so when I saw the price of this camera I had to have it. I knew it was refurbished but it has a 90 warranty and I know this is a good camera but I didn't expect scratches on the screen or something sticky on the chrome. Other than my expectations of the wear and tear I was pleased with the product for the price.", "Date": "September 5, 2013"}, {"Title": "It's nice", "Author": "A. Engle", "ReviewID": "R2Q0N20N8UVB58", "Overall": "4.0", "Content": "It's your basic point-and-shoot camera- it's not taking super high quality pro shots but it definitely gets the job done and has a decent video feature.  It is also super cute!", "Date": "December 14, 2012"}, {"Title": "Terrific camera", "Author": "Russell D. Mayer", "ReviewID": "RZRZ3FVS9SNN1", "Overall": "4.0", "Content": "I am extremely pleased with my choice of camera.  I had purchased a previous model several years ago and was happy with that one too.  The 7030 has the functionality and convenience that I was looking for in a digital camera.  I strongly recommend it (although, maybe not the color).", "Date": "November 16, 2011"}, {"Title": "Olympus 7030", "Author": "JJM", "ReviewID": "R1746Q7ALMFXGJ", "Overall": "3.0", "Content": "This was a gift for my daughter and it was really nice except after 5 minutes the LED screen went blank and never came back on.  Contacted Olympus and sending the camera in for warrenty repair.", "Date": "December 30, 2010"}, {"Title": "Just got this camera and can't figure out how to ....", "Author": "kp \"kp\"", "ReviewID": "R1HVN0A1XBXRL3", "Overall": "3.0", "Content": "User guide could be easier.  I can't figure out how to shut off 4 second audio recording with each shot.Don't want to spend hours with translated online guide.  Should come with easy steps for most common functions.  Still better than the Sony I returned so far.  They should make these with grippy pads on them so you can handle them easier.  May have to improvise some. Frustrated so far.  Trying to find a user group onnline..", "Date": "May 24, 2010"}, {"Title": "\"Purple\" camera that's really fuchsia.", "Author": "Ar Mo Chroí", "ReviewID": "R3S389ZI1ZAE6D", "Overall": "3.0", "Content": "Bought this today from another brick & mortar store for a few dollars less than Amazon's price.  I have had it for about 8 hours, so here are my thoughts for now.The things I love most about it:* It's small, so it's very easy to slip into a purse or pants pocket & take with you.* Easy to use.  There's no need to fiddle around with a user's manual for a couple days to learn the functions.* The 4 effects included:-- Pop Art (there's no discernable difference between this & a regular picture)-- Pinhole (gives you a black ring on the edges of the picture)-- Fisheye-- Drawing (this is fussy at best.  Some pictures come out great, but others look whitewashed with some grey specks on it even if the items you're taking a picture of shows up perfectly on the screen.)* Works with both SD & SDHC memory cards.* The \"?\" button that brings up an explanation of what you're confused about.  Cuts down on consulting a user's manual.* Compatible with my Windows 7 laptop.* In-camera photo editing software so you can edit pictures after you take them.  (I haven't tried this out yet.)* Power save option.  There's about a 5 second wait before the camera goes into power save mode.Cons:* The \"shell\" around the lens is loose right out of the box.* Can't permanently turn off the flash with the option of turning it back on temporarily to use it.* Rechargeable battery that can only be charged via USB port to computer or via the same method to an included AV plug.* Moving persons drew a complaint from the camera the few times I tried it. (\"Face Detection Failed.\")* Processing time with the post-photo display is a long wait.  I turned the function off to cut down on the write time.* The zoom is much too fast.  I had to adjust my touch/hold time on the buttons to get the amount of zoom I want.* It refuses to ignore screens (window screens, etc.).  I have a screened in porch in a high-rise apartment building & get some spectacular views of sunsets that I cannot take pictures of because of the blasted screen.  I've tried with a variety of cameras, & none of them will \"ignore\" the screen & take a picture of the scenery beyond it.I haven't tried out video mode yet, & will update my review when I do.*****UPDATE 7/22:  I've played with video mode a few times.  The microphone installed within the camera is hypersensitive.  It picks up & amplifies every little noise around you.  It begins to blow out after doing a folk song a cappella like \"She Went Through the Fair\", or \"Ave Maria\" (by Schubert & by Bach/Gounod).  I'm a mezzo soprano & have never encountered this problem with all the other cameras I've owned.  Even when I was speaking in my normal voice, it was still blowing out.Also, the zoom is fixed in video mode.", "Date": "July 5, 2011"}], "ProductInfo": {"Price": "$227.88", "Features": "14-megapixel resolution for high-quality, poster-size prints\n7x wide-angle dual image stabilized zoom\nShadow Adjustment Technology; AF tracking\nCreative Art Filters\nCapture images to SD/SDHC memory cards (not included)", "Name": "Olympus Stylus 7030 14 MP Digital Camera with 7x Wide Angle Dual Image Stabilized Zoom and 2.7-inch LCD (Purple)", "ImgURL": "http://ecx.images-amazon.com/images/I/41DvxmtrqfL._SX300_.jpg", "ProductID": "B0031RGERC"}}