{"Reviews": [{"Title": "Excellent Camera - Few Minor Glitches", "Author": "A. Favre \"AF\"", "ReviewID": "R1QDNE7J9TY1U", "Overall": "4.0", "Content": "A great camera for a good price.  Camera boots up quickly and takes pics quickly (I am upgrading from a 4 year old Easy Share product).  There are only a few minor \"glitches\" you need to be a aware of with this point and shoot. The first is flash and button location. If you aren't paying attention, your finger that you use to snap a photo can easily get in the way of the camera flash.  The only other \"irritation\" at the moment, is the face recognition.  It appears there needs to be a SIGNIFICANT amount of contrast between foreground and background for the face recognition to work effectively.  Body against a blank background with flash - YES.  Any other scenario, it is rare that the face picks up a tag.Has a proprietary battery that needs to be charged in camera.  Could not easily find an external charger for the battery and I looked extensively.  Picked up a an after market product instead.As always, comes bundled with Kodak software on the camera.  This can be a plus or minus depending on your feelings about Easyshare software (I have not been a fan as it automatically places pictures in it's own file structure unless you tell it to place it where everyone else in the world places their photos - My Pictures - assuming this software still does this, please correct me if it has changed as I avoid Kodak software by default nowadays).A great, compact, VERY FEATURE RICH camera with a few minor irritations.  If I had it to do over again, I would buy this camera.I don't really understand the pricing \"game\" with this device, but it must be an amazon thing.  All cameras in this series are identical except for color. I picked up the blue one as it was about $5 cheaper than any other.  Also was not \"allowed to see the price\" unless it was in the \"cart.\"  This feels like old-school salesmanship, but perhaps the claim it is required by kodak is legit.", "Date": "June 22, 2010"}, {"Title": "A headache for beautiful pictures", "Author": "gunngirl", "ReviewID": "R1LTSCWO7ZF5NE", "Overall": "2.0", "Content": "I bought this, for some inane reason that I'm thinking about now, for the fact I can share on Facebook. A stupid reason I know, as iphoto has a facebook button that easily lets you share pictures. That's the least of my problems with this camera. First, it's a little bulky and didn't even come with a camera strap. But the main problem is it is too tempermental. One slight click can quickly corrupt your memory card and be the difference of you being happy or crying over the 450 photos of your Italy trip lost. Yes, they will be locked on the memory card, but they will not load into iphoto, flickr, photobucket, etc.This happens when I switch to record video. For some stupid reason, the video does not work right and it corrupts the entire memory card. This has happened TWICE! I went on a trip to California in memory of Michael Jackson, went to his houses and Forest Lawn and took many pictures so you can see I wanted them. I also just tooled my city of Chicago taking pics of the sets of Transformers 3--more things I will never see again, and the video once again corrupted everything on the camera. I don't know what is wrong with the video feature, but whenever I switch to take video, every pictures that is taken after the video does not show up. Pics up to that first video will show up but will not come off the camera.  This to me makes this camera a piece of $150 junk that I can't return because of the measly 14 day return policy.I should not have to worry about using my camera and simply clicking one button to switch to video should corrupt and ruin all my photo memories! I am disgusted this has happened a second time. The pictures that do come out are beautiful, but there are other cameras that also take beautiful pictures. I don't know if it is the camera, or some setting or what. I have yet to find a setting that would result in this happening. it is a headache to say the least.  If you do buy this, BEWARE of something like this happening, believe me it's not worth the disappointment and anger.I would suggest you buy a Sony Cybershot or hell a Cannon. Anything but this camera in particular. If anyone has had this experience I'd like to know what you did to stop it. Let me know.  angelsslayer@yahoo.com", "Date": "July 18, 2010"}, {"Title": "Love my camera", "Author": "D. Cooper", "ReviewID": "R1TYE4URDQRHIK", "Overall": "5.0", "Content": "I have this camera and I just love it.  It is easy to operate, creates beautiful pictures - and videos.  (I have not yet learned how to increase the volume on videos, but will talk to support about it.)  I have had no problems at all with charging the battery.... simply connect the camera via enclosed usb cable to an electrical outlet and it's charged in no time.  It's easy to transfer photos from camera to computer folders - just select the one you want it to go into.  Yes, I would buy it again!", "Date": "July 12, 2010"}, {"Title": "Lemon", "Author": "S. L. Stamper", "ReviewID": "R1UZ2F4ZKBPGC7", "Overall": "1.0", "Content": "I purchased this for my husband's birthday. The battery will not charge unless the battery door is slightly open. After the charge is complete, the camera will not operate unless the battery door is slightly open. If you close it, the camera will turn off. We returned it, and got a replacement. The second camera did the same thing. Chat support was no help at all. They just told me to return it to the store where purchased for an exchange.", "Date": "May 17, 2010"}, {"Title": "Not as good as expected", "Author": "M. WILSON", "ReviewID": "R1JBED0ZGOCZH7", "Overall": "3.0", "Content": "Pictures dont come out as good and some pictures come out looking fake. not as crisp as I expected. Had to return first one battery compartment issue. I know how to use cameras. I had tried different settings and everything.", "Date": "September 2, 2010"}, {"Title": "Avoid this camera", "Author": "Kylie From Pittsburgh", "ReviewID": "RIBORFAK7AJSC", "Overall": "2.0", "Content": "We bought this as a present for my grandmother. We took it out of the box to test it and to make sure we knew how to operate it to show her. Well lets just say it is fairly simple, so we took a few test pictures. They turned out VERY grainy, with a lot of noise. So we checked the settings, thinking this is a 12.1 MP camera could do a bit better than that, nope, my year old Sony Cyber-Shot took better pictures.Also we uploaded the pictures on to my laptop and after the annoying software installations we verified that the pictures were indeed grainy.I would advise anyone who is looking into this camera to turn elsewhere.", "Date": "December 23, 2010"}, {"Title": "Great for the money", "Author": "katieh192", "ReviewID": "R1JFUFK0UVIZQN", "Overall": "4.0", "Content": "This camera is easy to operate if you have used a digital camera before.  Takes good quality pictures, except for a few in low light conditions.  It offers a lot of different settings for close-ups, nighttime, etc.  However, I suggest having the flash on for most pictures.  Overall, I have had no problems with this camera and would recommend it for everyday picture taking.", "Date": "February 15, 2011"}, {"Title": "unexceptional camera", "Author": "Upstate Guy", "ReviewID": "R2WOOLN9B2OHBQ", "Overall": "2.0", "Content": "I was disappointed with the camera.  Picture quality, at best, is uneven.  I bought the camera with the idea that through its simplicity I might be able to learn my way into digital photography.  The only thing that its use has done for my picturing taking long-term is make me wish I'd spent the money for a better camera.  The camera does not appear to have an anti-shake feature.  The absence of anti-shake makes the zoom, which of itself is unimpressive, near useless.  When I was a pre-teenager, I received a Kodak Bullseye as a Christmas gift.  The Bullsye was a fabulous camera for the time.  Memories of my use of the Kodak Bullseye only heightens my disappointment with this Kodak camera.", "Date": "November 17, 2010"}, {"Title": "A bit worst than mediocre", "Author": "R. PEREZGATELL", "ReviewID": "R24SFF59038LG5", "Overall": "2.0", "Content": "I bought the ES M550 because a former Kodak camera was dropped and the viewer stopped working. Other than that the camera worked fine but it was impossible to frame a picture as it has no viewfinder.The firing and control buttons are next to each other and cannot be easily distinguished in low light. The firing button should have been separate, distinguishable and further right to avoid the confusion. The grip area is a bit awkward and is is almost impossible to shoot with only one hand, which I would say is a must with point-and-shoot cameras, no?The zoom is mediocre in range. When fully zoomed the photos will sometimes be out of focus. Another item is the programming. The smart-capture feature is a good idea because it will customize the focus according to the scene (macro or long shot) but cannot be customized enough to shoot flash in daylight, something called \"fill-in flash\" which any photographer knows is handily needed. You have to use an alternate setting that is not smart.The camera itself is not a good point and shoot device. The focused item can be selected by pointing the camera where you want via a small green rectangle, but this is the minority of cases. Most of the time with casual situations there is no time to select the focus and the M550 is simply too slow to focus and many pics will show up out of focus.A very dumb thing is that the M550 will not charge while connected to the computer. So you have to charge it first if you have a dead battery and want to copy the photos to the computer. The predecessor generation of EasyShare cameras did charge when connected.", "Date": "January 7, 2011"}, {"Title": "Slow Camera", "Author": "MoodyWitch", "ReviewID": "R3BQXLW1E8N9RN", "Overall": "1.0", "Content": "I have 2 Corgi's that love to run and chase each other and play but the camera is so slow that the girls are out of the picture before I can snap it...and it wasn't a cheap camera when I bought it 3 years ago.", "Date": "November 23, 2013"}, {"Title": "worst camera I've ever owned", "Author": "luv2camp", "ReviewID": "R1IXV5VJTOLI8I", "Overall": "1.0", "Content": "Picture quality is not that great.  The battery just crapped out and I've barely used it.  Kodak has gone downhill and I for sure won't buy another Kodak.", "Date": "September 11, 2013"}, {"Title": "Great pictures in good light but having charging issues now", "Author": "Dissapointed in SF", "ReviewID": "R6NH751SVCLJN", "Overall": "4.0", "Content": "Camera takes good pictures in light.  Its weakness is in low light where the pictures are not good.After owning this camera for a couple of years it has developed charging issues and is very temperamentalabout charging.  Otherwise I have been happy with the camera.", "Date": "June 16, 2013"}, {"Title": "Kodak Easyshare M550", "Author": "Lily", "ReviewID": "RSOU8O2VM6PB8", "Overall": "5.0", "Content": "It it just what I expected according to price and description. Takes good pictures, has a lot of features, easy to handle, in my case I chose blue color, I think it looks great. I highly recommend it if you don't want to spend too much money on a camera.", "Date": "November 9, 2011"}, {"Title": "Great Camera for a great price", "Author": "Mary K. Arensberg", "ReviewID": "R36H2WMO8OK14Q", "Overall": "5.0", "Content": "This camera does everything I want. Easy to set up and easy to use. Picture quality is great and the price was outstanding.", "Date": "November 9, 2011"}, {"Title": "Great Camera", "Author": "Julian Lewis \"jrlewis\"", "ReviewID": "R1FYGONRBHHCGT", "Overall": "5.0", "Content": "This camera work like a charm, I have not had any problems with it and I have been using it for 6 months now I think. I got a used one, picture quality is great, tag feature is wonderful.I love this buy.", "Date": "November 8, 2011"}, {"Title": "Waste of money", "Author": "Taylor Phillips \"spicegirl\"", "ReviewID": "R28ORQ3SE4HF1G", "Overall": "1.0", "Content": "I purchased this camera about 7 months ago as my previous Kodak Easyshare had given up the ghost. It seemed to have the features I wanted for a point and shoot, was light-weight and the memory card fit into the card reader on my new ACER. The battery would not hold a charge so purchased a second battery. Same thing, no charge. Now the camera will not power on or accept a charge. This is definitely my last KODAK camera.", "Date": "September 11, 2011"}, {"Title": "A dissapointment", "Author": "Jim975", "ReviewID": "RUEB463020L4W", "Overall": "2.0", "Content": "I purchased this camera earlier this year and used it on vacation this summer for the first time and was very disappointed with the picture quality.  The pictures were very grainy.", "Date": "August 30, 2011"}, {"Title": "fifty bucks not bad", "Author": "Call me KID", "ReviewID": "R1OWV1SVIXW366", "Overall": "4.0", "Content": "I just bought this camera at Costco which included a four gig sd card and a case and strap wall charge plug and cable for computer and the wall wall charge plug, one out of four pics when tested on my cats was blurry, so far six more shots or so and only one was blur.  Camera is kind of tiny and I have small hands, cost me fifty five dollars with the instant discount they were offering there.  My last camera was a five hundred dollar sony that no matter how much you moved the pics were perfect, was five megapixels, this one in my opinion is worth fifty dollars or so, don't have to be such a finatic with it like I used to be with my high end stuff.  This one is twelve megapixels which means if I ever get a printer again I can do big prints and not lose resolution, which is nice.  Seems a little slow to me on the time it takes to see something to the point of the photo being taken, my only complaint.  I't has to lock on and do it's thing, my sony was instant or at least I remember it seeming that way.  But fifty bucks for 12 mp and 5x zoom (doesn't seem like 5x zoom) seems fair to me so far, and that's indoor tests only nothing with a good outdoor lighting situation where digital cameras really are meant for. Note have not tried any motion shots. I also notice the pics indoors when viewing lcd view look awful on the screen, I mean really bad, but once flash go's off the pics look nice, kind of hard to judge what picture will look like though indoors with not much light.  My sony was always clear no matter what, though once again that was five hundred dollars eight years ago not fifty.", "Date": "July 6, 2011"}, {"Title": "I love this camera!", "Author": "Terry Johnson", "ReviewID": "R2ZJTQMK4RNGRG", "Overall": "5.0", "Content": "I found the Kodak EasyShare M550 12MP camera on sale for $55, so the price listed here seems unusually high. For the price I paid, it's a great little camera. It's a lot less bulky than the Canon Powershot I was replacing and takes much better pictures. Plus, I love the Share feature (I didn't think I'd use it at all, but I really like it)!Many of the negative reviews I read before buying stated that there was trouble with charging the camera. Initially, I had a similar problem. But then I noticed a little red switch inside the battery compartment which holds the battery securely in place. It isn't spring-loaded, so you have to use your fingernail to push it over the battery. Once the battery was firmly connected to its electrical contacts, it charged perfectly and seems to hold its charge well.I was hesitant to buy this camera after reading mixed reviews, but I'm really glad I did. For the casual, amateur photographer, it's an awesome camera. I recommend shopping around, though, as I found it for almost half the price that was listed on Amazon.", "Date": "June 18, 2011"}, {"Title": "HATE THIS EASY SHARE (love older ones)", "Author": "Nancy \"Nancy\"", "ReviewID": "R1EJLQJTZ67BMU", "Overall": "1.0", "Content": "i've had 3 easy share.  main complaint is that this newer model has buttons that aren't as user friendly. i hate pics in dark places (like concerts) and it's not easy to change from pic to video or other settings. also, the sound on the video was messed up.  i'm returning this today and will search for one of the older easy shares that is WAY more user friendly than this one", "Date": "March 22, 2011"}, {"Title": "Good Camera", "Author": "Siome42", "ReviewID": "RYLRXOPJ4HA1S", "Overall": "4.0", "Content": "I'm happy with this camera. I was looking for something that was rechargeable, more than 10 MP, and easy to use. This camera delivers & is pretty affordable. It's a good point & shoot camera, but it does take some practice to get the hang of. I would probably buy this one again. The Easy Share Software is a pain to use & install, but it does work.Update: 5/8/11I had to send this camera in for service repair. Kodak replaced the entire motherboard & sent me back the refurbished camera. It was covered under the warranty, but getting the claim number was a pain because the online service tech made me retry everything I had already done to troubleshoot the problems. The USB port had been wallowed out by the USB cord & wasn't making connection, so the camera wouldn't charge or upload data.After receiving the refurbished camera, I still have some problems with it randomly turning itself off. I also can't really take it anywhere because the power button's location causes it to be turned on unintentionally during transport & I end up with a dead battery. Frustrating when you're trying to capture a picture. I would not buy this camera again. The Easyshare software no longer works on either of my computers, so I'm now using Picasa. I think Kodak is a nice idea, but their software doesn't perform well, and this camera isn't meant to be used every day.", "Date": "February 8, 2011"}, {"Title": "KODAK M550 CAMERA", "Author": "Robert Hansen", "ReviewID": "RVIY65ONLSLDP", "Overall": "4.0", "Content": "GOOD PRICE.  EASY TO USE.  GOOD PICTURES, EXCEPT SUNSET PICTURE HAD NO COLOR, EVEN WITH SPECIAL SETTING.I HAVE NO IDEA HOW KODAK SOFTWARE WORKS FOR SAVING PICTURES.", "Date": "September 27, 2010"}, {"Title": "awesome product", "Author": "sam jacobs", "ReviewID": "R3SDZ0S6VQEYN1", "Overall": "5.0", "Content": "IF YOU ARE LOOKING FOR A REALLY GOOD QUALITY CAMERA AT A GREAT PRICE THIS IS IT. I HAVE TRIED OUT SO MANY CAMERAS THE PICTURES ARE VERY CLEAR ON THIS ONE ITS A DURABLE CAMERA. AND WORTH EVERY PENNY. I WOULD HIGHLY RECOMMEND THIS CAMERA!", "Date": "February 11, 2012"}, {"Title": "IM DONE WITH AMAZON!!", "Author": "Stacey 876", "ReviewID": "R30C8DGVVN27RI", "Overall": "1.0", "Content": "I ordered -Drawers out come they never came! after two months i called customer service they sent another one THAT one took almost a whole month to get here.Worst stuff sold BY AMAZON you cant track! -I didnt give up hope, I ordered Skintight IT NEVER GOT HERE AGAIN!!!! i called after 2 months the company was so sure they sent it, they gave me back my refund and said refuse the bottle if it comes in the mail its been 4 months it never CAME!-I STILL didnt give up hope because some stuff i ordered from amazon was still comming.THE LAST STRAW!!: I ORDERED THIS CAMERA FOR MY HUSBANDS BIRTHDAY IT NEVER GOT IT IVE BEEN WAITING ON IT SINCE FEBRUARY..OH YA IT THROUGH AMAZON SO I CANT TRACK IT....IM DONE WITH AMAZON I WANT MY MONEY BACK AND IM CLOSING THIS ACCOUNT..I GIVE UP..I THOUGHT IT MIGHT HAVE BEEN THE POSTAL SYSTEM BUT I SEND GIFTS TO DIFFERENT ADDRESSES AND THEY NEVER SHOW UP!", "Date": "April 1, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "12-megapixel resolution for stunning prints up to 30 x 40 inches\n5x optical zoom; 28 mm wide-angle lens\n2.7-inch LCD with KODAK Color Science Technology\nKodak's Smart Capture feature\nCapture images to SD/SDHC memory cards (not included)", "Name": "Kodak Easyshare M550 12 MP Digital Camera with 5x Wide Angle Optical Zoom and 2.7-Inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41qfAasn1fL._SY300_.jpg", "ProductID": "B0031RGGDY"}}