{"Reviews": [{"Title": "Great camera for value", "Author": "The Saeko", "ReviewID": "RSB13EZ8JROOC", "Overall": "5.0", "Content": "I own 2 other cameras a Nikon Coolpix point and shoot 12MP and a 15.1 Rebel T2i DSLR.For a 200 dollar camera, it really isn't all too bad.  14MP and 5x optical zoom. Lens[ 4.7-23.5mm 1:2.8-6.5 ]OVERALL feeling: (4.8 of 5)It has pretty clear picture taking capabilites and is very USER FRIENDLY.  Panaramic function works amazingly well.  The camera itself is a great size and looks pretty slick, it doesn't look like a cheap camera.  I think anyone would be happy with this purchase.  It has a HDMI port and can take SDHC memory cards.  You charge the camera battery with the battery in the camera, and the power cord is plugged into the camera itself, that is a nice feature, to not have to pull the battery out all the time to charge(like the coolpix i have).  The buttons light up when touched momentarily and the camera has a nice power save option; all nice features.HD VIDEO: (4.8 of 5) Not too shabby, volume is a little low, but im pretty sure there is a speaker option.  I noticed it today.  It definitely is always a nice feature to be able to capture video, in High Def no less.  Only downside is that you can't take pictures while video recording, i like that option on my DSLR.Lighting: (4.3 of 5) you have a few different options depending on location: sunny, cloudy, what type of indoor lighting i.e 3 different flourescent settings and 1 incandescent.  Weird thing is cloudy works better indoors under flourescent light better than all the flourescent settings.  Very slight exageration of the yellow hue.  Cloudy whittens things up and makes the room look as if it were under regular incandescent bulb lights.  All in all, you can place it on WB auto, and the setting the camera auto selects works better than fine.I am quite satisfied and feel anyone else would be as well..and i spent 250 buying from an overpriced Postal Exchange lol.", "Date": "October 13, 2010"}, {"Title": "Near perfect", "Author": "Old Jim in TX", "ReviewID": "R3KKUFD296X0Z", "Overall": "5.0", "Content": "I have used cameras of one type or another for close to 50 years.  Had my own darkroom back in the days of film.  Have had digital models since 1M was as big as they got.  Wanted a small one to carry around. Cell phone cam is just too much trouble and too limited.Read all the reviews for all the small Olympus, Cannon, Panasonic, et al.  Used my girlfriend's Cannon.  Decided that since an old Olympus E100RS Sports Photographers model was the best I have EVER used I would stay with the brand.I love this little thing!  It is hard to hold still on long tele shots and I doubt I will ever get used to not having a viewfinder but I still love it.  Have used it in Program mode mostly and played with some programed Scene shooting.  Love the Super Macro best of all.  Have some great close ups of my honeybees.Does everything it is supposed to and does it well.  People who have had problems using it just didn't Read The F****** Manual.  I downloaded the manual from Olympus's web page as soon as I ordered the camera.  I enjoyed reading about it while I waited for it.  Didn't wait long.  Amazon got it to me in record time.  Ordered late Monday, used free delivery, still had it on Friday. Thanks Amazon!I don't like the software that came with it.  Uninstalled it on day two.", "Date": "April 17, 2011"}, {"Title": "Good results for a fair price", "Author": "S. J. Bennett", "ReviewID": "R2FO02EDOXR1CK", "Overall": "3.0", "Content": "This camera takes mainly good photos straight out of the box. There's no real need to play with the settings which I like. My main use for this camera is photographing people, and I preferred using the standard Auto setting as opposed to the portrait scene setting - in portrait, the pictures were mostly a little too pink. The standard auto setting reproduces skin tones nicely. It does seem to be a little soft on detail indoors though - you can't really tell it's 14mp unless you're outdoors on a sunny day.One gripe is the processing speed - even with a quick card, after you take a photo it takes a good 8 seconds before the camera is ready to take another one. That's annoying if you just missed 'the' shot, and then the next opportunity happens while you're waiting for the camera to sort itself out.The video quality could also be better - especially on the sound front, and it suffers badly from over exposure in sunny outdoor settings. So don't buy this camera if you're looking for the best of both worlds, but if you just want good pictures for a reasonable price this is a contender.", "Date": "December 25, 2010"}, {"Title": "Big Kudos For My Little Camera", "Author": "AniMaeWest", "ReviewID": "R28NWVVELCC3JZ", "Overall": "5.0", "Content": "I love my little Olympus Stylus 5010 14 MP Digital Camera with 5x Wide Angle Dual Image Stabilized Zoom and 2.7-inch LCD (Titanium) purchase through Amazon! I have owned several small cameras and they have all performed poorly (not through Amazon). But not this little guy, I can't leave home without him. This 5010 is rugged, light, easy to use and the MENUS ARE SO EASY TO USE AND NAVIGATE THROUGH! My fat fingers are not an issue with the basic dial-a-menu scheme. My only irk is when I'm reviewing images on the camera I almost always touch the shoot button and the image disappears, I have never had a successful hand off to someone else to show them a stored image. But that's common with most cameras, so no real gripe, I just want to show my little gem off all the time. Some people have stated that 14mg is overkill. But,  I took a photo of something that didn't show up to well in the shot, it was nice and clear, but tiny. Then I zoomed in while previewing the image and there is was, exactly what I wanted, that little tiny image I was going for filled the whole LCD screen! That's what 14 MP's is for.  I love the pinhole and B&W; settings and the manual settings are a blast! Oh, if you depress the entire dial button while the camera is off, the date and time is displayed for a few seconds; NICE!", "Date": "May 30, 2011"}, {"Title": "\"This tiny camera will blow you away\" is right!", "Author": "James Johnson", "ReviewID": "R3IIMV0QJN99G3", "Overall": "5.0", "Content": "While visiting Amazon, I bought this camera on an impulse, mainly because of its low price, $87.99, and the highly respected reputation of Olympus. The manufacturer says, \"This tiny camera will blow you away\", and are they right! I've only had mine a few days and am already amazed at the image quality and abundance of features on this little gem. The 14mp images are really outstanding for a camera of this price or any price for that matter. Two particular features that have truly \"blown me away\" are the HD video and the panorama mode for still images. The one-button HD recording is a major plus and the video is astounding! But the panorama mode is just incredible, using the auto mode is so simple, just take two or three consecutive photos, lining up the pointers on the screen as you do so and then sit back and watch the camera build the panoramic photo...unbelievable and so easy! Also love the in camera editing that can be done, particularly the Beauty Fix...granted it's not Photoshop, but, hey, it only cost $87.99! I haven't been this excited over a new camera since I acquired my Nikon D200 a couple of years ago. A definite 5-star rating at this price!", "Date": "May 13, 2011"}, {"Title": "Great Little Camera", "Author": "K. Manigault", "ReviewID": "R241WYSUVLXPVU", "Overall": "5.0", "Content": "This was a bargin Don't waste your money getting this same camera in one of the colored editions. It takes the same quality pictures for a much cheaper price. It is easy to use and took great pictures at night in low light. A newer version just came out at over twice the price. Grab this one while you can. The only problem I had was the directions were written in tiny writing so it was difficult for me to read so it was good that it was easy to figure out.", "Date": "July 13, 2011"}, {"Title": "Don't expect too much...", "Author": "jray", "ReviewID": "R2QAFOBN7E3YOZ", "Overall": "3.0", "Content": "I bought his camera to replace a Canon I had for years before it got sand in it and quit.  I saw the price and features of this name brand camera and thought I'd give it a shot.  I was expecting a mediocre display, so-so picture quality, etc., and that's what I got.  The only real complaint I have with it is the delay between pushing the button, and actually taking a picture.  That's VERY inconvenient (and annoying). The Canon was MUCH superior to this thing, but all in all, it's O.K.  Bottom line is: YOU GET WHAT YOU PAY FOR.", "Date": "August 14, 2011"}, {"Title": "Great camera and a even greater price.", "Author": "madisonPA", "ReviewID": "R22QM1N9TL1OXV", "Overall": "5.0", "Content": "This is my first digital camera I've ever brought. Although I am no professional photographer, I wanted a nice quality camera that wouldnt break my pockets. After many reviews and camera choices later I decided to go with this one. I am so happy with my decision!!! This tiny camera is awesome. The look is very sleek. It takes amazing pictures. The battery lasts a long time. The turn around time of taking back to back pictures isn't long at all. Its so many postives about this camera with the biggest one being the price.The only negative (which isnt a big negative) thing I would say is that the zoom doesn't go as far as Ive seen other cameras go but it still goes a good distance.Overall I would most definitely recommend this product to others.", "Date": "July 22, 2011"}, {"Title": "Olympus 5010", "Author": "desconss", "ReviewID": "R16NMY94R247N1", "Overall": "5.0", "Content": "Did my do diligence prior to purchase and was rewarded with a product worthy of my effort. Can't beat the product for theprice. Don't expect to have any problems with it's use. If i do I will let you know.", "Date": "June 22, 2011"}, {"Title": "What a great deal!", "Author": "Lisa Ruddick", "ReviewID": "R2I0JITTQB972A", "Overall": "5.0", "Content": "The camera came with very few instructions, which initially concerned me, but when I started exploring the camera I understood.  There's no need for a lot of instructions.  The camera is completely intuitive, with everything easy to use and understand.Clarity is perfect.  Night pictures were unbelievable.  A lot of features, including panaramic pics.The casing is sleek and thin.  On top of all this, the price was amazing.  Very, very pleased with this product.", "Date": "August 6, 2011"}, {"Title": "Excellent value", "Author": "keisukehonda", "ReviewID": "R19PZ9AVMSVS0Q", "Overall": "5.0", "Content": "Recently my Canon Powershot from around 6 years ago broke down, and I had to go camera shopping. I spent hours pouring through the point and shoot cameras available on Amazon, before deciding to go with the Olympus Stylus 5010. No other camera combines the features, quality, and price that this camera brings. I ordered it and received the camera after four days. I could not be more pleased with this device. The first thing I noticed was that it was very small, both in length and width, something that the product photo does not accurately portray. This worried me at first, but I tested it out and taking photos and navigating the menus were a cinch. The camera comes with a usb cable, a charger head, an av cable, a Lithium ion rechargeable battery and instructions (there is a full user manuel on the Olympus website).I took some test shots, both with and without flash, and was highly impressed. The 14 megapixels really show its power when even after zooming all the way in playback mode, the picture remained clear and sharp. I took some close up shots, and despite my hand noticeably shaking, the pictures remained focused, even with the flash off. The only gripe I had was that the color was a tad bit drab for my liking. You can also capture video at 720p simply by pressing a large red button, which is a very handy feature.The 2.7 inch screen is spacious and very clear, though as an earlier reviewer mentioned, the pictures look much better from your computer than the camera screen. I recommend buying some sort of screen protector as well, since the screen is not \"edged inward\" whatsoever.Overall, I was more than pleased with the capabilities of the camera, especially considering the price it is being offered at. Definitely an excellent buy.", "Date": "August 4, 2011"}, {"Title": "Beautiful shots!", "Author": "Michael Ratliff", "ReviewID": "RHP7VA61KDH7W", "Overall": "5.0", "Content": "I have gone nuts taking pictures of everything. I love this camera, except that the picture in the viewer isn't as good as the picture that you upload to your computer. So that's not necessarily a bad thing. I got a class 6 8 gigabyte memory card for mine and barely am I filling it up. I have since ordered some accessories for this camera. I made a video of my travel trailer and it did pretty well,except for some vertical blues appeared from the overhead lights from time to time.", "Date": "May 25, 2011"}, {"Title": "Very nice little camera with easy features", "Author": "Janette", "ReviewID": "RJJLUM74D0BHQ", "Overall": "5.0", "Content": "We love this camera, nice picture quality for snap shots and family fun. My 5 year old can even use its simple features. If your looking for a pocket camera with a good quality picture I would highly recommend it!", "Date": "September 3, 2011"}, {"Title": "Great Little Camera", "Author": "C. Brandt", "ReviewID": "RI8PUAYFXG1PF", "Overall": "5.0", "Content": "After years of trying to find the perfect camera for me, I found the Olympus Stylus 5010. Trying to figure out all the readouts is very simple, surprisingly I can understand them. This camera take great pictures, the video is simple to use and the camera is small enough to fit in a shirt pocket. Just the right size to take on my travels and not be burdened with a camera hanging around my neck.  Also this camera has a wide variety of styles for your photos, which really surprised me. You can do a \"drawing\" style photo which is about the craziest thing you can do. Photo is black and white and it looks like a pencil drawing, very artistic.  Love this camera.", "Date": "August 19, 2011"}, {"Title": "Good camera for the money!", "Author": "farmerscotty", "ReviewID": "R3R27U77RWP02K", "Overall": "5.0", "Content": "I have had several Olympus cameras over the last few years and have always stayed with that brand.  This was a delight to turn on and setup was really easy and they have addressed several things on older cameras in there line.If your looking for a quick in the pocket and go camera this is it.......I got this for my daughter to take on a trip.  She will have to give it back to me after she returns!I really like the ease of charging the battery and hooking up to the computer........no need to take the card or battery out.Good deal for the money.enjoy!", "Date": "August 3, 2011"}, {"Title": "Great little camera", "Author": "Mary Ann Burdelski", "ReviewID": "R23EETAJ8KA0H5", "Overall": "5.0", "Content": "I had an Olympus FE that I had to replace.  I found this camera with a very good price.  It takes clear pictures, very good video.  I am still getting used to the settings, as they are different than the old camera. The only change I would make is to add the behind glass setting that was on the old camera. I don't think this camera takes quite as good pictures through glass.I really like the quick button to take video, and have used that quite a bit. It lets me switch immediately to video with one button. Video does drain the battery more quickly.", "Date": "July 28, 2011"}, {"Title": "Great camera!", "Author": "Katherine", "ReviewID": "R24VWXGWS824N4", "Overall": "4.0", "Content": "This camera is perfect for people who want something simple and easy to use. I had a Nikon D3000 and it was just too bulky to take to the park or sporting events. I wanted something on the cheaper side that had good megapixels and portability! This camera, besides being a beautiful blue color, is excellent! HD video is great and pictures are great too! There are only a few cons to this camera that I've discovered. First, the place where you put in the battery and SD card, the covering is removed and holds onto the camera with two plastic hinges, whereas my Nikon has a sliding opening. I am extra cautious that I am not too hard on them and not to break them! Secondly, if you are shooting towards direct sunlight, it has a tendency to make stripes appear on the image. A simple adjustment fixes this however. I'm looking forward  to using this camera!", "Date": "October 4, 2011"}, {"Title": "Simply Magnificent", "Author": "Nonye", "ReviewID": "R3YBTZPY54QML", "Overall": "5.0", "Content": "In a few words, i'll say i have been 100% satisfied with this purchase. Its pictures are crystal clear and i really love the one-touch HD video button. It may appear small but has has a sleek and very mature look and at the price i got it for a few weeks ago ($85), i'll say it was a steal. Absolutely satisfied.", "Date": "August 19, 2011"}, {"Title": "Great Camera, Better price!", "Author": "Kevin P. Foley", "ReviewID": "RB1K48VWQQRFK", "Overall": "5.0", "Content": "I have had this camera for about a month now and it is just perfect for what I use it for. I am not a professional photographer but it takes just great pictures. The menus are easy to follow and the zoom is just awesome. While taking pictures at a family reunion I did not have to recharge my batteries at all during the day. I just recharged at night and the next day I was good to go for another day of shooting. I could not be happier for this purchase.", "Date": "August 8, 2011"}, {"Title": "Mixed feelings, poor image stabilization", "Author": "Gail A. Mcgregor", "ReviewID": "R373UK8KZUDZP7", "Overall": "3.0", "Content": "I bought this camera with high hopes. I am slightly disappointed. I chose Olympus because I loved my last one, a stylus 800. This one is better in some ways but a lot worse in others. Basically the image stabilization is horrible. That is my biggest disappointment. I bought this camera for my mom's wedding and all the pictures of us taken going down the aisle are extremely blurry (my cousin took them from one of the tables). If you don't hold it extremely still for a few seconds the picture will not turn out. This is also the case if the subject is moving and having a chihuahua, my subject is often moving. I'm not sure if I just don't have the settings right but it seems like there is absolutely no image stabilization which is something I really need and really liked on my last camera. The good things about it are the quality of the HD video and images. The HD video is actually very nice. I am happy with the sound too. Still images also turn out very nice, even in dark rooms (I don't like to use the flash).Overall, there are some really nice things about this camera but the one thing that I needed, it fell short on.", "Date": "June 29, 2011"}, {"Title": "LCD screen fails; camera now dead.", "Author": "Thomas T. Amlie", "ReviewID": "RZTIYVXF7L4I3", "Overall": "1.0", "Content": "Started out pleased with camera.  In fact, bought a second one soon after the first.  Then the clouds appeared.  On the LCD display a single black dot appeared, and then spread and multiplied fairly quickly.  Both cameras now have 4 patches of black \"fuzz\" on the lcd screen, each about 0.25\" across.  I don't know if it's the pixels burning out or something else, but it makes the camera frustrating to use, since you can't actually see what is in the picture at those locations.  I'm generally extremely careful with my possessions, so it wasn't a matter of physical abuse or damage.  To top it off, one of the cameras now refuses to power-on.  Push the power button and the lens goes in and out 3 times and then it powers off.  Waste of money, with a 2 out of 2 failure rate.", "Date": "August 14, 2013"}, {"Title": "based on the classic", "Author": "Tracie Crawford", "ReviewID": "R1YWN08IAI7MGM", "Overall": "5.0", "Content": "i have the older version of it, the \"classic\" if you will.  mine is an olympus d-425, is about 7 years old, titanium, has the video feature (but with no sound) and people are often astounded at the shots i have taken and continue to take with this camera.  i do not leave home without it and couldn't be more proud of the quality it has delivered.my \"classic\" camera has served me well in amazing videos and phenominal pictures using the very same memory card from my original purchase.  i simply upload the pics using the included cable.  i keep about 3/4 of the pics on the card for use in my digital picture frame on my desk at work, then when i need more room for new pictures i delete pictures i get tired of.  my camera doesn't have a retractable lens but it does have the zoom feature.  i take 99% of my pictures using the motion/sports option on my menu dial.  the quality and clarity seem to be the best for all occasions.this camera is the best thing i have bought besides my house in the past 10 years!  it took very professional quality pictures on my trip to the bahamas in 2005.  night/snow pictures i took last year could be compared to those out of a magazine and although the manual said not to point the camera directly at the sun, i do...usually zoomed in as tight as i can get...it has not once disappointed me.  i've taken about a hundred pictures while pointing it directly at the sun.i purchased my camera on sale at sears and paid $50 for it in or around 2004.  based on the quality of pictures i have taken over the years it is easily worth $500 in the return it has yielded.", "Date": "November 23, 2011"}, {"Title": "Ok camera", "Author": "Patrick J. Mcintyre", "ReviewID": "RSFYWTZ8XT8KK", "Overall": "3.0", "Content": "I bought this camera and I had mixed results compared to my other one. Indoor shots come out fair but outdoor shots came out nice. It has a focus but it needs to capture it before the shot is taken otherwise the the picture comes out dark.  The other issue is the door to connect the cable to charge or connect to computer seems fragil and could break off easily and the other annoying issue is to view the pictures only you need to have the lens opened. Overall this took fine pictures but be carfull of the door to conect the cable and should buy additional battery units so you can continue taking shots or making videos.", "Date": "October 3, 2011"}, {"Title": "so far so good", "Author": "not mark twain", "ReviewID": "RDDLI7WMMJA5N", "Overall": "5.0", "Content": "This camera so far is just what I was looking for.  I wanted a very small camera to take on vacation.  This one is very small and thin but still has a nice big screen.  The only thing I would have liked in addition is a viewfinder, but then the screen couldn't be as big.  The color quality on the automatic setting seems to be very good, even for inside the house at night with the lights on.", "Date": "October 3, 2011"}, {"Title": "Nice little Camera", "Author": "Mark", "ReviewID": "R2A12OAI40MDOU", "Overall": "4.0", "Content": "Bought to take overseas on business/pleasure trip.  I wanted a small camera that I could put in my pocket.  This camera fits the bill, takes good quality photos and has decent zoom capabilities for a very inexpensive camera.  Taking indoor pictures in some of Germany's Cathederals the flash did not illuminate the shot  very well, but no camera flash would light up the inside of such a large area.  I'm sure I could have made some adjustments to the manual settings and had better results.  As it was I received the camera, charged it up and went on my trip.I did not have time to study the User's guide.  Used \"Auto\" mode for all pictures.The 14 Mega Pixel resolution lets you take some distant shots and then crop the picture to your liking.I would recommend this camera and will use it often as it is more convenient than a larger camera.", "Date": "October 3, 2011"}, {"Title": "Great Digital camera", "Author": "C. Bogart", "ReviewID": "R1KM7TF8VIWXDY", "Overall": "5.0", "Content": "Camera was as advertized. Small, compact, lightweight, lots of pixels. Too soon to tell about battery life. Very attractive housing.", "Date": "September 10, 2011"}, {"Title": "Good for Price", "Author": "LMMobile", "ReviewID": "R2TCNEZUVHJY24", "Overall": "4.0", "Content": "This is a good camera for the price.  There are definitely better cameras on the market but none are any where close to this price range. I would recommend this camera for everyday use.", "Date": "September 7, 2011"}, {"Title": "olympus camara", "Author": "Lynette Waller", "ReviewID": "R2OVUN2GU989VQ", "Overall": "5.0", "Content": "I purchased this very reasonably priced camara for my son just before he went on a Boy Scout campout out west. He didn't get very much time to work with it before leaving, and he hadn't used any camara much before this, but I told him to just take pictures of whatever he wanted. The pictures he took were great! This is such a simple to use product. It is easily recommended to others as a point and shoot camara.", "Date": "August 10, 2011"}, {"Title": "Love it!", "Author": "hael40", "ReviewID": "R22V7ZY8PY38TG", "Overall": "5.0", "Content": "I love this little camera! I still haven't read the manual that installed to the computer...I will eventually. The functions were pretty easy to learn just by playing with them. This camera has wonderful preset settings that you can scroll through ex: sunrises/sunsets; fireworks; moving subjects; animals; foreground/background, and so on. I absolutely love it. The zoom works great; I don't like to zoom so far that it uses the digital; don't like pixels appearing in my prints, but I also haven't checked it out either. I have used it to catch some of the most beautiful sunsets, and I even caught a lightning bolt using the \"firework\" setting! I love this camera and cannot believe I got it at such a great price.", "Date": "July 22, 2011"}, {"Title": "Nice camera for the money", "Author": "irisheyes", "ReviewID": "R1QTSWLNTJ5NNG", "Overall": "5.0", "Content": "I am really happy with this camera purchase.  I am mostly taking family photos and this camera works great for that purpose.  I have owned it for about 2 weeks and am very happy so far.  The display is very clear and easy to view.  Using the different features is very user friendly.  Great deal for the money.", "Date": "July 19, 2011"}, {"Title": "Good Budget Camera", "Author": "reppster", "ReviewID": "R29NX9K9KBK10", "Overall": "4.0", "Content": "Two days after receiving my camera, the lens wouldn't close after powering off. After a quick replacement by Amazon, I was back in business.  It is easy to use and easy to set up.  The only thing I wish it had different was more zoom. This is a budget camera that does everything as advertised. I would recommend for using as a nice little camera to carry in your purse or backpack.", "Date": "June 30, 2011"}, {"Title": "So so", "Author": "mckc", "ReviewID": "R3QDH7XS66HOYP", "Overall": "2.0", "Content": "I got this camera because it has 14 mp and the price was good. I have not used it much and turned it on the other day and noticed some of the pixels on the screen had burn out.  this really speaks a lot about the product.  I would not recommend this product to anyone.", "Date": "March 25, 2013"}, {"Title": "DO NOT BUY!!!", "Author": "Lori Danford", "ReviewID": "R3QR8T7UWDFRCK", "Overall": "1.0", "Content": "This camera is TERRIBLE!!  I'd give it a 0 if I could!  I've had it for one year, and I'm yet to take a clear picture.  I spent a decent amount on it, so I keep trying to make it work, but all I've done is miss out on a whole year of pictures.  Even if you're only 5 feet away from someone, you cannot tell who the person is in the picture!  It's riduculous!!!  I will never buy Olympus again!!!!", "Date": "November 5, 2012"}, {"Title": "Olympus Stylus 5010", "Author": "Rob66", "ReviewID": "R1U6ICW0MYK4XU", "Overall": "4.0", "Content": "Olympus Stylus 5010 : Nice point and shoot camera.  Very compact (about the size of a deck of cards).  Good image stabilization and zoom.  2.7 inch LCD is plenty big enough for reviewing images.  Lense completely retracts into camera on shut off and makes it easy to take in and out of a case.  720P video recording is quality too.  Takes very clear pictures especially if not zoomed out all the way.  Very easy camera to operate and download to computer.  Camera colors were a nice option.  Price was very good compared to similar cameras with lesser features.", "Date": "March 15, 2012"}, {"Title": "Clicks constantly * Only PC compatible? Going back", "Author": "CottageGardener", "ReviewID": "R12DO61BOTMP2", "Overall": "1.0", "Content": "Reviews were so encouraging - loved it out of the box. Small size is amazing.And then. Surprise! Can only be formatted with a PC? Are you kidding me? No one thought to mention that anywhere in the description.Charged it with the included wall charger, and - like so many other reviewers have mentioned - it \"clicks\" constantly. Don't know what it means, but it can't be a good sign.Housing is attractive, but cheap.  Those little plastic doors are so fragile and barely attached...it's only a matter of time.", "Date": "December 31, 2011"}, {"Title": "Great gift", "Author": "Ms Thea \"emaven\"", "ReviewID": "R1ZABWLWZFLQ5N", "Overall": "5.0", "Content": "I bought this camera as a replacement gift for my teenage grandson who has outgrown his old point and shoot.  He is thrilled by the features and the qualitiy of the prints. It looks nice and feels sturdy.  I got quite a bargain.", "Date": "October 8, 2011"}, {"Title": "awesome little camera", "Author": "Frank Bailey", "ReviewID": "R2128EM7PFA1YU", "Overall": "5.0", "Content": "This camera has a lot of bang for the buck.  It takes outstanding pictures in any scenario. It can be point and shoot or you can configure it to your liking.", "Date": "October 4, 2011"}, {"Title": "Great camera for the price", "Author": "B Haigh", "ReviewID": "RGABJXMFWLK9R", "Overall": "4.0", "Content": "This camera is very small and light and easily fits in a purse or pocket. Easy to use and takes great pictures, I sometimes have problems focusing in on objects in the distance, and have to double check the instructions as there is a way to overcome this (but I always forget what it is).", "Date": "September 29, 2011"}, {"Title": "Pocket sized", "Author": "Susan B", "ReviewID": "R1O1PZSP0RXB48", "Overall": "5.0", "Content": "Got the camera for a vacation where I decided I would take pictures not just carry around a camera.  Because of it size and easy to use features I have lots of great pictures.  Small enough to put in your pocket and takes really nice pictures.", "Date": "September 27, 2011"}, {"Title": "Great product !", "Author": "jabe", "ReviewID": "R2B9AX7MR28O8F", "Overall": "5.0", "Content": "I am very happy with this camera, it has crystal clear images. It's ease of use is a big plus, and it's light weight makes it easy to bring anywhere. I would recommend this camera to anyone looking to buy a new one !", "Date": "September 22, 2011"}, {"Title": "Nice small camera", "Author": "retiredprof", "ReviewID": "R1LX6FYYDDY3HV", "Overall": "5.0", "Content": "Wanted a small shirt pocket camera with reasonable zoom at an affordable price.  Mixed Amazon reviews on this one but the price was less than half the original suggested retail so worth a chance.  Camera better than I expected.  Image quality quite good, battery life more than reasonable, 5x zoom smooth if a little too fast.  Under a $100 this is a good deal.", "Date": "September 18, 2011"}, {"Title": "Very nice camera", "Author": "Rajasekhara Guntaka", "ReviewID": "R15F3B7WX1KHTO", "Overall": "5.0", "Content": "This is one of the best point-and-shoot cameras. I am big fan of Canon cameras. I am little skeptical when buying this camera because this is not from Canon. But it turns out to be a great one. Took pictures in low light, got nice pictures. Panorama and Effects are fun. I took lot of pictures of Nature and Landscapes in drawing mode. They are superb. I strongly recommend this camera.", "Date": "September 16, 2011"}, {"Title": "Great", "Author": "A. Espinosa", "ReviewID": "R2EK7JOY5DY6GE", "Overall": "5.0", "Content": "this is a good compact camera with easy to use controls. takes good pictures and comes with easy to use software.", "Date": "September 9, 2011"}, {"Title": "LOOOOOOVE MY NEW CAMERA!", "Author": "A. Siwicki", "ReviewID": "R3RR7GZQG8TXAL", "Overall": "5.0", "Content": "I bought this camera about a month ago as a bday present to myself. (Is that weird? Lol.) I love the color, I love the size, I love the quality of its pictures as well as all the creative filters you can use on your photos. It's obviously early in the game, but I do not have a bad thing to say about my new adorable little blue camera!", "Date": "September 8, 2011"}, {"Title": "More than Perfect for the price", "Author": "ALK", "ReviewID": "R2HN3FNT81FG4G", "Overall": "5.0", "Content": "I have been looking for a small camera for years, really YEARS. I have returned so many over priced cameras and lost parts to many others. The rechargeable battery and Sport mode sold me. There are many better cameras out there, but not for this price. This is the BEST deal for a point & shot you'll ever fine :)", "Date": "August 15, 2011"}, {"Title": "wow! Great Camera", "Author": "Donna Harder \"Donna\"", "ReviewID": "R3JEQZ28JZQRW7", "Overall": "5.0", "Content": "I received this camera about 2 weeks ago and I love it.  It was to replace my Kodak camera that quit right after the two years of warranty. I was surprised at the features on this little camera. The pictures come out really clear and crisp. It was easy to figure out how to use even without the manual. I am very happy with my purchase.", "Date": "August 10, 2011"}, {"Title": "Current generation, good entry level price", "Author": "owookiee \"owookiee\"", "ReviewID": "RRPHY9S14XUVQ", "Overall": "4.0", "Content": "For the current price this camera is fluctuation around, it's a great deal for a \"current generation\" point-and-shoot.  By that I mean it has: 14 megapixels, image stabilization, and low light compensation.  These features are huge upgrades over the previous generation of cameras that lacked image stabilization.  In the hands of my very-non-photographer spouse, this camera takes way better pictures in varying conditions than did the Nikon Coolpix L10 we replaced.My biggest complaint is the controls and cable door are very cheap plastic, and I feel it's just a matter of (little) time before they crack and break.", "Date": "August 23, 2011"}, {"Title": "Good, but not for $200", "Author": "Anonymous#1337 \"speshal_k\"", "ReviewID": "RKHNWL1B1OAIJ", "Overall": "3.0", "Content": "I purchased this at the current price of ~$100 and for THAT price it's a decent camera.  I would feel differently if I paid full price for it.The image quality is mediocre, can see edges around items / contrast issue which indicate a cheap sensor.Menu system is the new, crappy one they started implementing a couple years ago.  Also lack of manual controls make this a minimalist point and shoot.  The video quality is fine, what I would expect.Zoom and focus during zoom at adequate, but sometimes it just doesn't work well at max optical zoom.  Ditigal zoom (past the 5x optical) is grainy, which I expect as it's interpolating and not actually 'zooming'.  Best is just to use the 5x optical and crop the picture later in a photo editor program.Battery seems to last for a hundred+ photos, which is what I expected.  Replacement can be found on amazon for $11/ea shipped.  I grabbed a few and carry them with me.This is not a weather resistant model, so I expect it to die from internal corosion sooner than later.  If you can affor dit, buy a Stylus model with weather resistence.", "Date": "August 11, 2011"}, {"Title": "cmaera", "Author": "Waiting for Tomorrow", "ReviewID": "R3NUR5VZGAKG94", "Overall": "4.0", "Content": "Love, love, love this camera. Only problem is that it makes funny noises sometimes. I would recommend this to anyone who wants a nice high quality camera. Don't expect professional looking pictures, but definitely better than most others.", "Date": "November 25, 2011"}, {"Title": "Keep looking", "Author": "douglas kaiser", "ReviewID": "R3JAWON53CT97C", "Overall": "1.0", "Content": "I hate this camera.  It takes about 2 seconds from the time you push the button for a picture to take.  It has caused me to miss a lot of good moments.  Others I have asked to take family pics have the same problem.  You're better off using your phone.", "Date": "December 24, 2013"}, {"Title": "Disappointed in product", "Author": "April L. El' Majrab", "ReviewID": "R3MX6OZ0XXYSV0", "Overall": "2.0", "Content": "It doesnt work very well. and i left it out in the car on a hot day and know I have little smudges on the screen...but it never really took very good pictures...", "Date": "November 27, 2013"}, {"Title": "Great replacement camera.......", "Author": "Martina \"gc\"", "ReviewID": "R1CJD586X1MC9Y", "Overall": "5.0", "Content": "Had a brand new one and damaged it by mistake.  Loved the old one, but didn't want to spend the money on a new one as it was only 6 months old.  I love it and it works great.  Will take better care of this one!", "Date": "June 5, 2013"}, {"Title": "Affordable great camera", "Author": "Kevin Krekeler", "ReviewID": "R2FOKM7WDXBKRN", "Overall": "5.0", "Content": "Can't beat the price and functionality of this camera. I'd say it competes with those $200 cameras but I don't use it as much as I hoped once I got the iPhone", "Date": "April 6, 2013"}, {"Title": "Incredible picture quality, but more complex than I had hoped", "Author": "James Ratterree", "ReviewID": "R2VSVW88M4C348", "Overall": "4.0", "Content": "This camera is a nerd's dream.Also, a dedicated amateur's dream.It's a bit more complicated that I wanted to deal with, but the quality of photos is stunning.Forget about their proprietary picture photoshop wannabe...  only a nerd would like it, or spend the multi-hours involved in becoming proficient at using it.", "Date": "March 4, 2013"}, {"Title": "Nice little camera", "Author": "griz86", "ReviewID": "R1AEQYGXJBLDR0", "Overall": "4.0", "Content": "This is a nice reliable camera for taking snapshots. There are many features that I simply haven't used in the two years that I've had it. I wish the zoom was more powerful for distant shooting but it's adequate for most situations. The battery life is amazing.", "Date": "January 12, 2013"}, {"Title": "Great camera", "Author": "Glenn A. Mcmurrian \"Steven Browning\"", "ReviewID": "R38LFYQ74XSQO1", "Overall": "5.0", "Content": "nice camera and very easy to us just point and shoot and that is it ... ... ... ... ...", "Date": "January 9, 2013"}, {"Title": "Wonderful camera", "Author": "Grum", "ReviewID": "RU0S3K5UEO0CZ", "Overall": "5.0", "Content": "A great buy and comes highly recommended. Used frequently on a point and shoot basis. This item is also great value for money.", "Date": "December 27, 2012"}, {"Title": "Great general  camera", "Author": "gregg carboni", "ReviewID": "R364ILUKKLBV1C", "Overall": "4.0", "Content": "I found this camera to do general pictures excellent but long distant shot just OK, Very easy to operate and built very well.", "Date": "December 16, 2012"}, {"Title": "Buy a Coolpix", "Author": "Charles", "ReviewID": "RHUJEUABNI72U", "Overall": "2.0", "Content": "I am not a photographer. My main criteria for a camera is that it is small enough to fit in my pocket.The Stylus met that requirement. I had a Nikon Coolpix but dropped it on a tile floor and broke the lens. The Coolpix worked well and took good pictures for 2+ years. The Stylus has done OK, but compared to the Coolpix it is inferior. There is a delay between the time when the button is pushed and when the flash goes off. Plus there is a longer recovery time between pictures. Today the lens didn't retract when I turned the camera off, which prompted this review. Had I been able to do things over, I'd have brought another Coolpix.", "Date": "October 7, 2012"}, {"Title": "Awesome Camera", "Author": "Craig Sonis", "ReviewID": "RL8WNL4JGR4WT", "Overall": "5.0", "Content": "I love this camera!  I got it once my old camera just broke.  I bought this one on a whim after quickly reading the reviews and I can tell you I have NOT been disappointed at all. I'm just a point-and-shoot photo taker so if you are looking for a million f-stop setting this isn't the camera for you.  But if you want a nice, light weight, easy to use camera then this is the camera for you.99% of the time I leave this camera in scene mode and it takes outstanding photos.  It's also great at taking photos in the evening when the light is very low.You will want to purchase a SD card (I got a 16GB card and that seems to be plenty).  And you should also look to purchase some additional batteries as while the main battery is good, I couldn't get though a 12-hr day in NYC on just one battery.  Don't buy the $20 Olympus battery though, just get one of the lower cost generic brands that work with this camera (I found one on Amazon for $2.50 each). Lastly, you will want to purchase a camera case, i got a Case  Logic one found here and it works perfectly > http://www.amazon.com/Case-Logic-QPB-201-Molded-Compact/dp/B0039BPG4M/ref=sr_1_11?ie=UTF8&qid;=1349282775&sr;=8-11&keywords;=case+logic+camera+caseMy wife at this point doesn't even bring her camera anymore when we travel as this thing takes great photos and with a 16GB cardHighly recommended!", "Date": "October 3, 2012"}, {"Title": "Very short battery life and depresingly low memory", "Author": "Maria Sederberg", "ReviewID": "RQ4J573RB5PVL", "Overall": "2.0", "Content": "My main concern about this camera is that it plugs directly into the wall. THe idea is that it's nice to not have to worry about taking the battery out and possibly forgetting it, but the camera doesn't hold a charge very well. I took it on a trip to East Africa and was very disappointed by how carefully I had to conserve the charge. Since the battery doesn't come out, I couldn't carry a spare with me.Also, my camera, within three weeks of use, started to show black pixels on the viewfinder, making it hard to see the image I had just taken. The quality of the pictures seems all right, but not worth it to me.", "Date": "August 28, 2012"}, {"Title": "One drop and done", "Author": "engageant", "ReviewID": "R3U8HTRGTHJIDH", "Overall": "2.0", "Content": "Picked this up for my wife for Christmas.  Worked OK for a few months - nothing notable.  Dropped it once from about 2 feet up, and now the lens doesn't open.  Time to move to something that's built a bit better.", "Date": "August 3, 2012"}, {"Title": "Disappointed", "Author": "Leslie J Neilon", "ReviewID": "R10N0931NQPZL5", "Overall": "1.0", "Content": "Bought from Amazon for great price. It took good pictures for 14 months - then lost focus. Olympus wanted more than the camera cost to repair it. When I complained about poor customer service they offered to reduce repair cost by half. Is this the way to do business? No more Olympus products for me - they are only built to last twelve months.REVIEW UPDATE: I think a senior person at Olympus who really cared about customer service got to hear about my problems with this camera - and contacted me directly. As a result I got a new replacement and I am happily 'snapping away'. This should have happened in the first place surely?", "Date": "July 20, 2012"}, {"Title": "Bad product bad customer service", "Author": "SJEFF", "ReviewID": "R2T8UAM6MJIAK3", "Overall": "1.0", "Content": "The product broke within 2 months, it is lightly used.  We sent it to Olympus for repairs, they quickly got it back for no charge.  Then it broke in the exact same way within another 2 months.  We sent it back for repairs and then after repeated requests for updates on repairs with no response or information we got a letter almost 3 months later stating that to get it repaired we would have to pay $85, which is almost as much as we paid to get it in the first place.  This camera obviously has a manufacturers defect and has nothing to do with misuse.  We keep in protective case, it was never dropped or thrown around.  I will never ever buy an Olympus product again if only for the horrible lack of customer service in my requests for information on the status of the camera.", "Date": "May 29, 2012"}, {"Title": "NEVER BUY OLYMPUS AGAIN", "Author": "G. Gallant \"Gina\"", "ReviewID": "RRPPURMIZK7C8", "Overall": "1.0", "Content": "Totally died after 6 months. Nothing but a black screen. I can turn it on, and the lens opens, but then noting. I sent it to the company, but so far, I have not heard anything, and I had to pay to ship it!UPDATE 5/25/12:  I sent it to the company, and they said it was all dented so they want $89.00 to fix it (It was only $139 new) The camera was sent to them looking brand new!UPDATE 5/29/12: Called customer service, after a lengthy conversation, they agreed to fix it as a \"one time courtesy\". When it arrived I looked at it very carefully and saw no dents. UPDATE 10/12/12 The camera is still working. Unfortunately I am stillvunable to recommend this camera because it is for lack of a better word: frustrating. It is fine for a still picture of a flower, or a posed family picture, but because the time between pushing the button (and yes, it is pre-focused) and the picture captured by the camera is long (between 4-6 seconds)- many shots are lost. 4-6 seconds probably doesn't seem like a lot, but when you are trying to take a picture of a child at play... forget it. When at an event, people around you have taken half a dozen photos before this camera finally clicks, yes, I think frustrating is exactly the word. UPDATE 3/3/13 If I had the money to replace it, I would. I hate this camera because it takes so long to take one picture.", "Date": "May 10, 2012"}, {"Title": "Half of the picture out of focus", "Author": "wonderoussole", "ReviewID": "R2TWNV58AC3G5V", "Overall": "1.0", "Content": "I took this camera to Luang Prebang, Laos and was very disappointed by it performance. My wife used it for snapshots and the left hand side of the pictures were blurry. I brought my DSLR so all was not lost. I am going to have the satisfaction of stomping the hell out of this camera as it is garbage. My first Digital camera was a Mavica bought in 1999, I bought a Asahi Spotmatic in 1969 at the Saigon PX. I know how to use a camera. I have had only one worse camera and it was a Fuji 35 MM compact, I have never bought another Fuji product and I will never buy another Olympus product.", "Date": "May 4, 2012"}, {"Title": "great camera", "Author": "Cheryl", "ReviewID": "R19QQCUA3ZSX9B", "Overall": "4.0", "Content": "Bought this camera back in December. Holds up well and has some good features along with good quality pictures. My only complaint is when u turn it on, u have to change to automatic every time, can't have it set to automatically be on that setting", "Date": "April 30, 2012"}, {"Title": "versatile, dependable", "Author": "Todd", "ReviewID": "R32Q6NLWCKHX7", "Overall": "4.0", "Content": "I bought this camera about a year ago, and I wanted to put it through the paces before I reviewed it. I'm quite satisfied with the purchase, and the things that I worried about before buying it proved groundless.I haven't used the \"auto\" functions much - and if you know what \"exposure compensation\", \"ISO speed\", and \"white balance\" are, you probably won't use \"auto\", either. The colours are quite good, provided you set the white balance correctly.** READ THE MANUAL **Pros:- small (can fit in a shirt pocket) and light- great in low light (use exposure comp)- useful modes (e.g. \"pet\", for constantly moving pets or children)- More than 800 MB of internal memory- Great battery life- video is very good- fast (if you use a class 10 card and 5MP setting)- real-time spectrum graphCons:- uses a non-standard cable- image stabilisation changes ISO setting- some settings not saved when shut off (e.g. 2-second timer)Contrary to what another reviewer wrote, this camera IS compatible with a Mac. It just won't \"initialise\" on a Mac, which means that (the first time you use it) you have set the time and date manually. I've used it with an iPad.Remember, more mega-pixels does *not* mean \"better picture\". It just means \"bigger picture\". If you don't need poster-sized prints, cut the size down to 5MP. It will save a lot of space on the card, and the camera will run faster. I let this camera sit for the winter and, months later, it still had nearly a full charge. An AC adapter is included, but I've never had the battery die on me in one day's use. The image stabilisation is both mechanical and optical. The \"optical\" part means that it increases the ISO speed to compensate for shaking. Changing the ISO speed changes the picture. I just use the 2-second timer, which gives me plenty of time to stabilise the camera after clicking the shutter.The spectrum graph is very useful (read the manual) as it shows you if the picture is too dark or bright. I'm not a camera expert. I'm just a guy who read the manual, and I can make this camera do pretty much whatever I want.", "Date": "April 1, 2012"}, {"Title": "barely enough", "Author": "Simon Says...", "ReviewID": "RCPK6VFLZPRB5", "Overall": "3.0", "Content": "Good: - The camera is very simple to operate. - small and can easily fit in your pocket - cheapBad: - poor Picture Quality - awful LCD displaySummery:not recommended if you are looking for something small that gives decent Picture Quality, a little bit better than taking pictures with your cell phone...", "Date": "January 6, 2012"}, {"Title": "Not good", "Author": "mrlindgren456", "ReviewID": "R2LYGVPFYN1JE7", "Overall": "3.0", "Content": "I got it thinking it was going to be really good, but after 9 months it started breaking. If you're looking for A beginner camera this is it, but if you're looking for you're second or third this is not it. My suggestion is to look at the kodak playsport.", "Date": "January 5, 2012"}, {"Title": "Great for outdoor video in bright light, not so much for everything else.", "Author": "Adam", "ReviewID": "R1EID1Q382S6O0", "Overall": "2.0", "Content": "I've owned this camera for nearly a year, and I'm slightly disappointed.  It was bought mainly to have a very compact camera for a trip to Europe, and logistically, it was great for that--it's tiny, and the rechargeable battery seems to last for at least 100 pictures.  But, where it really matters--the photo quality--it's lacking.Compared to our cheaper/older Kodak Easyshare C613 ($100 3 years ago), this camera just doesn't take crisp high-quality pictures in anything less than bright, sunny days outdoors, despite adjusting its settings.  In such good conditions, photos are bright and vivid, and we have several good daytime photos from our trip thanks to this camera.  On the flip side, we gave up on using it indoors, as those photos always turned out blurry.  Always, regardless of settings.  Surprisingly, I think this camera takes much better video than still images (even in low lighting--which doesn't make much sense to me).  So, we've made this our \"video\" camera, while the Kodak is back to being our main camera for photos.When the conditions are good (which is rare), this is a good camera.  Unfortunately, nowadays there are many better choices on the market within the same price range.  I've been impressed with Sony Cybershot DSC-W570 and the Canon Elph 100; friends recently bought those at the same price range, and the photo quality was very crisp, even indoors.  I won't be picking up another Olympus anytime soon.", "Date": "January 5, 2012"}, {"Title": "Grainy pictures", "Author": "Sofia \"Sofia\"", "ReviewID": "R26LW2K3099E3X", "Overall": "2.0", "Content": "I bought this camera based on it's excellent reviews. I was really disappointed in the quality of the pictures. It could be my camera has a defect, but it was no where near the quality I expected based on other customer responses. I returned mine.", "Date": "January 4, 2012"}, {"Title": "olympus stylus 5010", "Author": "ty \"tyw\"", "ReviewID": "R3972K3B2J3SC8", "Overall": "3.0", "Content": "So far unable to use camera, unable to do start up on computer, and no direction booklet.  Camera is size I like, and looks like it would be good to handle once I can get going.", "Date": "January 3, 2012"}, {"Title": "defective", "Author": "calv10", "ReviewID": "R3SGW1W7G7LS2J", "Overall": "1.0", "Content": "We have purchased many times from Amazon without problem.  Unfortunately, we have had trouble with this camera from day one.  Error messages regarding the memory card repeatedly showed up.  On our second attempt to take pictures while vacationing, we thought that the problem was with with the card.  We then took it to a camera shop who replaced the card. This didn't help.  We were told that the problem was with the camera, not the card.  We could not return to Amazon since it had been over 30 days.  Very disappointing.UPDATE: Mailed the camera under warranty to Olympus who returned the camera stating that it was repaired. I am not comfortable trusting that this camera will ever be dependable.", "Date": "December 27, 2011"}, {"Title": "great camera", "Author": "Carolyn Smith", "ReviewID": "R113VJI508MLB8", "Overall": "5.0", "Content": "Bought this camera before going on a cruise.  It is easy to use, nice and light to carry.  Nice price.  So far I'm very happy with it!  I did have to laugh, though, when the battery went out just when we were at a show in Spain and I wanted to take photos.  The other reviews had said the battery life is a bit short.  But as long as we know that, we can prepare better!", "Date": "December 8, 2011"}, {"Title": "Blown Away", "Author": "DrewC", "ReviewID": "RBY32FUNDIXVJ", "Overall": "5.0", "Content": "This camera blew my mind! For the price it is worth every penny. Very simple and fun to use. This cheap little camera captures amazing detail in every picture and video.", "Date": "November 30, 2011"}, {"Title": "great so far", "Author": "z.o", "ReviewID": "R37NCN161OOWUD", "Overall": "4.0", "Content": "Light weight, pretty blue color. Easy to use even without following the instructions to the \"T\". It has Panorama mode which was a thing I wanted for a while. The zoom can be adjusted to fine or digital and has the steady mode, which even if my hand trembles and the screen shows to be out of focus, the camera will adjust it and take a fine picture. Battery can be recharged inside the camera with the USB plug and play or AC/DC adapter. Video mode is great, can be adjusted from 480-1080dpi.Pros: Light weight, compact size, attractive, easy to use, rechargeable battery, great image on the LCD screen, customizing sounds and size of pic and video. face detection, auto focus, etc.Cons: The tiny door where the charger plugs into, seems very fragile. Once opened, it's hard to snap it shut. Doesn't come with memory card like other bundles. I personally have several SD memory cards available so this isn't an issue. But ideally it should be provided with the camera.I still have to play with the effects, but so far, it doesn't fix the red eye on pets because camera cannot detect their face. So in this matter I give it 4 of 5 stars, because camera is great but not perfect.Will continue to play with the camera features and instructions. I will post an update review after that.", "Date": "November 28, 2011"}, {"Title": "great price.great camera", "Author": "hugh brannigan", "ReviewID": "RZA2WVR70RQX8", "Overall": "5.0", "Content": "camera comes with instructions,web site and lots of goodies right inside it.Just plug it in,follow a few simple steps and it downloads ALL you need to know about the camera.It also downloaded a program that transfers all your pictures from your old computer files onto their more updated and better filing system.Well worth the $90 i paid for it.", "Date": "September 11, 2011"}, {"Title": "Great Camera", "Author": "Anderson Sosoo", "ReviewID": "R3IQSJXHUBELBQ", "Overall": "5.0", "Content": "The camera is working great so far. Never had any issue since I started using it about a couple of weeks ago. Battery life is great.", "Date": "July 6, 2011"}, {"Title": "Booooo", "Author": "Kindle Customer", "ReviewID": "RTNU3P1BQ1Q5R", "Overall": "2.0", "Content": "I bought this camera to take quick shots of my baby. Since it's winter and she's a newborn, we spend a lot of time indoors. It seems to take horrible photos, and the flash seems weak. I'm hoping it will be better outdoors, but for what I need it for right now, it just doesn't cut it. I've resigned it to just taking videos instead.", "Date": "February 8, 2012"}, {"Title": "Nice Camera But No Instruction Manual Included", "Author": "Mark H. Blangger", "ReviewID": "R3E6PICS3L4X5B", "Overall": "4.0", "Content": "I bought this camera to replace an antiquated, bulky Kodak digital camera that I've had for years. I really like the sleek design and large screen, but was shocked and of course disappointed that it didn't come with an instruction manual or mail-in warranty card, which one would think are standard on such items. Consequently, I downloaded the manual online, but no warranty card is available online. Maybe they don't include a manual because it's 74 pages long. Even so, even a condensed version of instructions would have been helpful. I've had it for only a couple of days, so hopefully it will be as good as expected.", "Date": "November 11, 2011"}, {"Title": "Good Camera", "Author": "cempluk", "ReviewID": "R1OB4SKMY1D9OP", "Overall": "4.0", "Content": "I bought  this camera for fun.I live in Indonesia.I think this camera is a Japanese product.But I was surprised, because the camera was made in Indonesia, where I live now. Woww this camera trip from Indonesia to the United States, continues to Indonesia again.Overall, this camera is pretty good.Only in the dark or dim room, the image capture is less good.Blurred images. It seems that auto ISO does not work well.in the light / outdoor, it has good picture quality.", "Date": "October 11, 2011"}, {"Title": "GOOD SMALL CAMERA", "Author": "Elaine Grenn", "ReviewID": "R340S0THH8ZQKN", "Overall": "5.0", "Content": "I wanted a good, small camera that I could take with me when I travel.  This camera meets that criteria.  It takes good pictures, is user friendly and can fit into your pocket.", "Date": "October 11, 2011"}, {"Title": "not so great", "Author": "Stanislav Anikin", "ReviewID": "R1X6UVOTRNDG6W", "Overall": "2.0", "Content": "bought this camera to take photos of my baby girl. Very disappointed in the performance of this item. Main problem is that it doesn't focus well especially without the flash. My blackberry phone takes better pictures in this mode. I was going to return it but by the time I realized it was the camera, it was too late.", "Date": "January 7, 2012"}, {"Title": "Terrible quality", "Author": "Art", "ReviewID": "R1OM7JOZMJSTUY", "Overall": "1.0", "Content": "It is a mystery to me why this camera got good reviews. Maybe people are using it for outdoor sports photography, and maybe it works OK for that? As far as regular indoor shots go, Don't buy this camera! I can't believe that it is 14M pixel. My old 6M pixel camera that is 8 years old takes pictures that are of similar quality to this.If I had a chance to look at some of the images it produces before buying, I would have looked onward to another camera in the same price range.I would have been willing to buy a more expensive camera if I knew that $118 would only get me this..But I think that I still can get a decent camera for just over $100, this is not that camera.This camera produces the kind of photographs that one would expect from a smartphone, which can be had for a little more money. I guess I was hoping for better quality images from something whos sole purpose is to take pictures. That's what a camera is for.I am terribly disappointed with this purchase, and I really want my money back.", "Date": "December 28, 2011"}, {"Title": "Friendly", "Author": "limordrori", "ReviewID": "R290D0YILYHV1Z", "Overall": "5.0", "Content": "Very friendly camera - friendly to use. It's relatively small, and so very easy to carry around.Didn't get to investigate yet all the camera's capabilities.", "Date": "December 18, 2011"}, {"Title": "Stylus", "Author": "SSANDY53", "ReviewID": "R3EW1JAGJ9GNUC", "Overall": "5.0", "Content": "I brought the camera after borrowing a similar Olympus for vacation.  This camera is great and the presets are perfect for me.  You can connect camera to your computer and customize settings according to how savy a photographer you want to be.  It is light weight, small and does a great job", "Date": "October 15, 2011"}, {"Title": "camera", "Author": "David", "ReviewID": "R3NAZZG8Q7GEKJ", "Overall": "4.0", "Content": "Camera is vary good.. actually has some internal MEMORY !!! wow. the strange part is the vidio..... It is COMPLEATLY seperate from the camera...Vary hard to work with... the camera \"snap button \" DOES NOT start and stop the vidio. a seperate lil red button does this..when u dounload it to a program... like kodakeasyshare...it tends to ignore the vidios.... The camera dounloads \"I B \" software on the first 2 computers u connect it to. thats  a little odd too... its a strange  photo software tool...takes a while to learn it..the owners manual is pathetic at best...BUT  again  the CAMERA is great!!!! takes 1st class pics!!!", "Date": "October 9, 2011"}, {"Title": "Awesome beginner camera", "Author": "NAC", "ReviewID": "R1EULVL4O8FEFY", "Overall": "4.0", "Content": "Fair quality, simple menu, yet the controls are a bit orthodox. Make to sure buy a case for the product is very sensitive. You are to enjoy your first camera - now made in China. It used to be American...", "Date": "September 4, 2011"}, {"Title": "Stopped working after 3 uses", "Author": "Elizabeth Driscoll", "ReviewID": "R2UR2V59LT28IN", "Overall": "1.0", "Content": "I owned the Olympus Stylus for about 6 months and was able to use the camera approximately 4 times.  The camera was working fine, took nice pictures and I was able to take a 30 minute video for school.  However, when I went to use if for our Christmas party, the shutter would not close.  The camera still turns on and can take pictures but the shutter errors and remains open at all times.This camera is also very user unfriendly when it comes to uploading photos.  I had connectivity problems with the camera and my computer (HP) almost every time that I plugged in.  Eventually the two would communicate but it always took some finagling.There were some positives.  It takes nice photos.  Got me an A on my video presentation. Is a simple point and shoot camera with nice resolution.Unfortunately, after less than 6 months, this camera has officially but moved to the trash and fingers crossed that the Canon I just purchased holds on a little longer.", "Date": "December 31, 2012"}, {"Title": "Broke", "Author": "Megan E, Akers", "ReviewID": "R346JLG759XKEO", "Overall": "1.0", "Content": "THis camera was really nice and then it broke. Stopped working. they told me to buy another camera, because the amount to pay for this would be the same. DOn't buy cameras used!!!", "Date": "December 21, 2011"}, {"Title": "Excelente producto", "Author": "yara zamora", "ReviewID": "R1KLORC2056H6L", "Overall": "5.0", "Content": "Muy buen producto, lo recomiendo ampliamente, excelente vendedor, el envío fue rápido, ningun contratiempo, la camara, estuche y memoria todo llego en buen estado.", "Date": "September 3, 2011"}, {"Title": "No Bang for your Buck", "Author": "Whoo hoo", "ReviewID": "R6PH11WCFEISR", "Overall": "2.0", "Content": "The item seems very cheap. The front plate is made of hard plastic (not metal). The menu buttons on the back are made of cheap plastic which seem very flimsy. It does not look like it would stand the test of time. I like cameras that will last two or three years, but this doesn't look like it would last me 6 months. The quality of the pictures do not look like they were taken with a 14-megapixel camera. My 3.2-megapixel camera phone takes higher quality photos. I have tried taking pictures with all the settings, in dark light and in sun light, and they all seem fuzzy. The camera delay is also inconvenient. I purchased this camera at a discounted price of $99 (which is $100 off the original price) however you are better off paying an extra $10 to get a higher quality camera from a well-known brand.", "Date": "April 25, 2011"}, {"Title": "Way too complicated for me!", "Author": "Cheryl Riley", "ReviewID": "R2H4CF1BE2JCEL", "Overall": "3.0", "Content": "I was so excited to get a new camera after my Nikon was broken, so I decided to try the Olympus. I think that it is a great camera, but I am a picture novice so all of the options are a little overwhelming. The pictures and video are great, but I miss the simplicity of the Nikon. Also, I'm not a big fan of the fact that the directions are in the camera. I think the camera would be great for persons knowledgeable about the technical components of camera, but next time I will pick a simpler option.", "Date": "September 12, 2011"}, {"Title": "Camera shipped without a battery.", "Author": "A. Jordan \"book junkie\"", "ReviewID": "R3UG69U9XH3PEI", "Overall": "2.0", "Content": "I would dearly love to rate this camera's qualities, but I can't, as my camera came without a battery, even though the box said a battery was included. I have had to order two batteries, one to power the camera and another as a replacement. I am very disappointed about this. I've had two Olympus cameras in the past and have liked them very much. However, my disappointment here is fresh.", "Date": "August 14, 2011"}, {"Title": "Thought it was a titanium case", "Author": "Bruce R Fink", "ReviewID": "R3IT7BV0TKWY5X", "Overall": "3.0", "Content": "The case is not metal like my Canon SD 1000. I thought it was metal. Returned product and bought the Canon.", "Date": "February 22, 2011"}], "ProductInfo": {"Price": "$199.99", "Features": "14-megapixel resolution for high-quality, poster-size prints\n5x wide-angle dual image stabilized zoom\nOne-touch button captures HD video in 720p\nAF tracking; Creative Art Filters\nCapture images to SD/SDHC memory cards (not included)\nCapture images to SD/SDHC memory cards (not included)\nAF tracking and creative Art Filters\n5x wide-angle dual image stabilized zoom\n14-megapixel resolution for high-quality, poster-size prints\nOne-touch button captures HD video in 720p", "Name": "Olympus Stylus 5010 14 MP Digital Camera with 5x Wide Angle Dual Image Stabilized Zoom and 2.7-inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41MYcUgrdqL._SX300_.jpg", "ProductID": "B0031RGEPE"}}