{"Reviews": [{"Title": "Best point and shoot camera around", "Author": "Heather Reddy", "ReviewID": "R3G0HG72ZJUI90", "Overall": "5.0", "Content": "I agonized over which high-end point and shoot camera to buy (considering the usual suspects: Canon Powershot, Panasonic Lumix, etc). In the end, because I wanted a camera with some built-in creativity (the miniature mode and the Holga mode sold me), which worked in low lighting (I have been astounded at beautiful photos I get with low light and no flash) and which had an intuitive interface, I went with the unconventional, lesser known Ricoh CX3. I simply couldn't be happier with this camera. The image stabilization, even in low lighting, is great, the scenes easily accessible, fun and functional, the auto setting yielding beautiful pictures, and the more creative scenes (particularly the \"miniature\" mode) are great. Something to be noted particularly with this camera is that its macro setting is phenomenal; I've taken macro photos of flowers that have left my DSLR friends jealous. To me, the RIcoh CX3 was the highest priced point and shoot camera, but also the one with the features I wanted. It's been worth every penny. I haven't done much HD video recording, but it's nice to have that capability. I think this is the finest point and shoot on the market. It's met my needs for taking everyday, artistic photos of my family, surrounds and pets.It's not ultracompact, but it fits nicely in a purse or satchel pocket. Barely needed to consult the user manual to figure out the controls.", "Date": "September 26, 2010"}, {"Title": "good, small camera with many features", "Author": "a.walker", "ReviewID": "RYYUYCXJFH6PK", "Overall": "4.0", "Content": "Although you can just pick up this camera and immediately use it to good effect, practice and reading the instructions is a must to fully appreciate all of the functions. I purchased this camera for 3 main reasons- 1) good zoom, 2) good video 3) small size. I took for granted that this camera would produce fine pictures, and that the LCD screen would portray the fine pictures well. So far, no disappointments after 2 months and well over 600 photos and video I'm happy. The camera does more than I want, so I'm still learning the \"how to's\", and expect that mastering all the features is likened to a full time study, (whereupon, I have no time). Some of the extras: The special effects are fun, the bracketing of different exposures, tints, and colors while taking one photo yields interesting results, the capacity to focus manually may even turn me into an artist, and yes you can zoom in and out while taking video.I like the build quality of the camera. It is heavy for the size, and has a solid, well made feel about it. Not plasticky. For the most part, the design makes sense. There is no viewfinder, but I do not see where one is necessary. The power button is recessed so accidently turning the camera on or off is difficult to do. A selector dial is conveniently placed on top, and the zoom is operated by a toggle surrounding the shutter button, (good and bad). The screen produces beautiful images at a reasonable size, (do purchase some 3\" screen protectors). The ricoh battery has good life, and the charger, (which comes with the camera) is easy to use.Aside from what I like about the camera, I'll mention the dislikes: The camera is not the most comfortable to hold; small size vs. big hands. My fingers are far from nimble and I've goofed while taking some important video, (read zoom is near the shutter button). To many customizable settings, or should I say, not enough time to learn about the camera's many featuresthe wifes point of view:For those of us who use magnifying eyeglasses to read, (my wife), and those of us who are not into electronic gadgetry, (my wife), or just choose not to learn, (guess who), this camera is perhaps not such a great choice. The camera is small, hence small, hard to read writing to indicate different functions. The camera is chocked full of options- hit the 'menu' button and a book of choices appear, (not good for someone who just wants to point and shoot, although there is this option should your wife, who needs reading glasses, finds it).All in all, I like the camera. For my purposes, the Ricoh meets all expectations; It takes excellent photos and videos, and is easy to stow. Would I buy it again? Yes", "Date": "December 18, 2010"}, {"Title": "Beautiful camera", "Author": "Donald A. Brodzik \"whatever\"", "ReviewID": "RCSJUUDMT6VEX", "Overall": "5.0", "Content": "I'm very pleased with this camera. The form factor is terrific. Controls easy and intuitive. Takes beautiful pictures and movies. Pictures transferred to MacBook Pro's IPhoto easily. Movie avi files came in nicely to Imovie.The camera's display is lovely and the macro capability at within 1cm is terrific. Low light performance might be improved but for me it was still acceptable. All in all a terrific package with a lot of unique features.", "Date": "April 7, 2010"}, {"Title": "The ENVY of my friends", "Author": "Jeanette \"jnetlove\"", "ReviewID": "R1QR67G12TYJ1U", "Overall": "5.0", "Content": "I bought this camera a year ago from Amazon and am only first getting to write the review for it now as my sister in law inquired of me what camera I have so that she can purchase the same one.  The camera itself is durable and rugged.  The lens is outstanding-- and the 10x optical zoom is an incredible feature in a camera this small.  The macro lens is INCREDIBLE!  I can't rave enough about the incredible macro photos I have taken-- especially of plants and small animals in Central America.  The quality of the photos that you can take with this camera is really impressive.  However, I caution that you do need to read the instructions.  Basic functions are intuitive, but to really make maximum use of the camera, you will have to read and study.  I am still learning what this camera can do a year later.  Nonetheless, I recommend this camera highly without reservation.  I also would mention that at this point, the CX-5 has been released.  I am not sure how it compares to the CX-3, but it might be worth comparing the two models since the 5 is just the more recent version of the 3.", "Date": "August 3, 2011"}, {"Title": "Love this camera!", "Author": "Lynn Z. Chatfield", "ReviewID": "R16TFTMWEO12ZZ", "Overall": "4.0", "Content": "As a casual photographer, I wanted a small, practical and user-friendly camera, and this is exactly what I got.  My previous camera was very basic and I was looking for some upgrades including the macro feature and a functional zoom. I have been able to take terrific photos using both features. There are a generous number of modes from which to choose in attempt to capture the perfect shot, but you really do not need to use these to get a great photo. The automatic mode delivers clear, sharp photos. However, if you do want to really use all of the features this camera has to offer, your choices are great. The scene mode alone has 13 different options. I still have not used all of them but find it very helpful to be provided a summary of when to use each one when I am scrolling through the options on the menu.The camera is small, light and easy to carry to any event. The texture on the handle allows for a good grip. I thought not having an optical viewfinder would be a negative but I don't even miss it.  The screen is large and clear, & you know exactly what image you are capturing. (I did purchase the anti glare screen protector which helps when taking photos outside) The battery charges relatively quickly, and has charged long enough for me to take pictures for hours at a wedding or long hike without worrying about needing to recharge it.  The charger is compact and easy to travel with, and when I have needed to recharge the battery, it occurs relatively quickly.Deleting photos is extremely easy. You are given the choice between deleting individual photos, multiple photos or all of them.As much as I have enjoyed this camera, there are 2 small inconveniences that I have noted.  There have been very infrequent instances when the camera requires an extra second or two to correctly focus on the object when preparing to shoot the photo.  Although it has been infrequent, the majority of the time has been when I have been using a zoom lens and the macro feature at the same time. As I am still trying to learn all about this camera, I am wondering if it is telling me that I am not using the correct mode when that occurs. If given a second or two, this usually self corrects and focuses correctly on the image.  The other inconvenience is there has been a very slight delay between when pushing the shutter and the actual picture being taken.Overall, I am very happy with this camera. The price was right, the size is perfect for my small hands and the quality of the photos are superb! I am extremely happy with my decision to purchase this camera.", "Date": "June 23, 2011"}, {"Title": "Perfect", "Author": "Christine Fortier", "ReviewID": "R1B7LO89C0I5M8", "Overall": "5.0", "Content": "I bought this camera for the macro. I need it for my handmade online business. EXCELLENT! I can put the lens touching the object and presto...a perfectly clear, absolutely beautiful picture. I am so happy with it!! The rest of the multi-functions are over my head, I just needed the macro. The camera is more heavy and solid then other cameras I have held which makes me think it is well made and not of cheep parts. Honestly, I could not be happier.", "Date": "August 8, 2011"}, {"Title": "Very disappointing image quality.", "Author": "Adam", "ReviewID": "R1865AIGNLGMVM", "Overall": "1.0", "Content": "Wanted to replace my awesome 6yr old Panasonic DMC-FX01 6MP Compact Digital Camera with 3.6x Optical Image Stabilized Zoom (Black) with a more advanced compact that offered better low light ability and more controls. I remember reading about and being impressed by the Ricoh GR when it came out, but the fixed lens was a turn off. The reviews on Amazon for this camera were really good and it was on sale for $169 so I took a shot. Off the bat, it was larger and heavier than I hoped. Yes it can take pictures in low light but the image quality is sub par. Hard to describe b/c I can't upload a full quality image but the best example I have is this: I took some pictures of my 1 yr old nephew. He was sitting in his high chair after being fed. It was day time, there were several windows in the room provided plenty of light. I shot in ISO 200 and achieved nicely lit, bright photos. However, the rendering of skin tones on his face was bad. You could very easily see all the different color speckles the image sensor used to represent flesh color.I then found a review on DPreview.com that also rated it poorly. My fault for not doing my homework. I returned the camera and through more research quickly learned that the best pocketable advanced camera out there is the Canon PowerShot S95 10 MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom and 3.0-Inch LCD. Despite costing $300, I went ahead and ordered it and am glad I did, it's awesome! Smaller, fast lens, cool features and great quality.", "Date": "December 4, 2011"}, {"Title": "The little camera that could!", "Author": "EcoActive", "ReviewID": "R1HM7BM7OKSDB", "Overall": "4.0", "Content": "Was very surprised at the quality and speed of focus. The Lens is incredible with no barrel distortion at wide setting and tack sharp. Have owned canon 950 elf titanium and this is better to me.This lens is superior. The depth of field in zoom really shows the quality for sure. Noise, always a problem with small sensor cameras. This is not horrible and use it indoors with great photos. Reduce size to send e-mails and the normal size would show some noise but good light are fantastic.For the small amount of money and construction quality can't be beat. Owned a lot of cameras and tested. This is a great all around that is not too big. Have Nex-5 ,olympus E-p1 that are better but use fixed lenses on them where as this is a most versitle camera. Have uploaded some for samples. Their normal size looks way better than these cropped but you get the idea.", "Date": "November 3, 2011"}, {"Title": "Great Digital Camera", "Author": "marielabeau", "ReviewID": "R13R5PODQY32LK", "Overall": "5.0", "Content": "Wasn't sure what to expect for such a low price but this camera is absolutely GREAT!  Can use it with the automatic settings for really wonderful pictures and am now anxious to learn the settings to \"do it myself\".", "Date": "January 14, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0036DEERI"}}