{"Reviews": [{"Title": "Very pleased with the NX10", "Author": "Marius Piedallu Van Wyk \"Lailoken\"", "ReviewID": "R227F5UV2JLYKR", "Overall": "5.0", "Content": "Having been reading up on most cameras since the release of the Nikon D90 on dpreview.com I finally thought the NX10/NX11 was my perfect camera. And having it for a week now I'm pretty pleased with it.I've been following all the Nikon models D90 / D3000 / D3100 and the Canon Rebel line as well as all the Micro Four-Thirds cameras and the Sony NEX-3/5. I've read reviews and comments and looked at all the sample images.I've considered the availability (and reviews) of lenses, weight/size of camera, image quality and video.The NEX-5, Olympus PL2, Nikon D3100 and the Samsung NX10/NX11/NX100 were all on my short list. I finally settled on the NX10.The NX10 :The Pros:Great image quality, although not quite the ISO range as some other cameras.Very good built-in flashSmall and light with a solid constructionVery easy user-interfacelarge sensor size (APS-C , better than all Micro Four-Thirds)The Cons:Video is not 1024p (only 720p)Very few lenses still (the ones that they do have are great though, and more are coming)Incorrect Assumptions: (about the NX10)It DOES support an optional external GPSIt DOES support the iFunction lenses (after a firmware upgrade).Based on the fact that I could really not see the difference between the NX10 and NX11 and the low cost of the NX10 at the moment, I decided to buy an NX10. So far both I and another person (with a Nikon D90) took photos of the same event and had opportunity to compare... and I am pleased to say my photos were a lot better looking (with no post-processing done to either).I love the Samsung Pancake 20mm lens (with iFunction) and is a good addition to the standard (non-iFunction) IOS lens that this shipped with.", "Date": "February 21, 2011"}, {"Title": "Excelent Camera", "Author": "Michael Khalsa", "ReviewID": "R2XO29EYW06AT0", "Overall": "5.0", "Content": "I purchased this camera a couole weeks ago along with a 50-200MM zoom.The camera feels great ( i have large hands), is easy to use, and the menu system works well.Pictures in automatic (smart) mode are sharp, although in lower light conditions it will tend to lower the shutter speed before increasing iso.Be sure to update the latest firmware available from samsung website.Some settings in menu are only available for particular shooting conditions, for example if you want to put it in raw mode, then be sure to set the dial to Apature first. In a way this makes sense because raw is only available when not using the smart mode, such as apature priority, but it can be an intial stumbling block when first setting the camera up - once you understand this premise then the rest is very smooth sailing.I have not tried video yet, however from what i have read, like many cameras with video built in, the quality is excelent when camera movement is not needed, but falls apart for action shots in the artifacts introduced. Also there is no external microphone jack so sound quality will be sub-par. If video is important, then the panasonic G series would be a better choice, but better yet would be a dedicated video camera.The senseor is 50% large in size than the panasonic g-series with 20% additional pixels. What that means is that there is 30% more area of the on each pixel for bringing in light, and thus more headroom for improvement. I am sure over the months Samsung will tweak their alogrithms to take better advantage of this.On time is excelent, as well as processing time; of course raw is going to take a bit longer.Be sure to get yourself a good quality card for the camera.I can carry the camera with the 18 -55 kit lens and the 50-200 zoom (300mm film equivilant) in a zeikos bag with only a 9 inch main compartment -that is the reason for getting a camera like this. It is not a studio replacement, but not intendended to be - for everything else it is fun and far better than a point and shoot if you know how to use it.", "Date": "August 4, 2010"}, {"Title": "NX10 - A Great replacement/complement for DSLR", "Author": "Kevin Lee", "ReviewID": "R18J3SVJW4GER6", "Overall": "5.0", "Content": "I was previously a user of DSLR and i got bored of the size of the DSLR camera after using it for some time. Then i found out from my friend that Samsung actually produces a camera called NX-10 which has exactly the same sensor size for DX type DSLR camera.It just took me less than 30 minutes at the shop to decide that this is the right camera for me and let me explain why. Like i said, first of all, i really like the size of this camera, it's not as small as some of the compact point and shoot camera, but it's not as big as the DSLR either. That makes it very easy to tug this small camera into a normal bag without ever needing to carry another separate bag just for DSLR. And next, besides the size, this camera can actually produce pretty good pictures! Yes! with available light at the shop, i took a couple of pics and they all look pretty sharp and amazing! By the way, the unit i tested was using the 35mm f2 pancake lens, i am not sure how the performance will be using the normal kit lens but using the supplied 35mm f2 pancake lens, this camera can really produce pretty neat images! So i am not really going to talk a lot more about other stuff because i think these two main points should be the real reason why you should get this camera, great performance at small size, you won't even feel burden with carrying it around unlike the big chunky DSLR camera.Now, on the negative side, the HD video claimed by the camera, uhmm...well the performance isn't really that great. There's no AF on the video so most of the time, when my subject move either nearer or further away from me, the video gets kinda blur. And the other cons i can think about is the lack of proper flash like what we get from DSLR. I mean you don't have flash commander and you can't get separate flash which can perform tricks such as ceiling bounce flash etc. So what you get is pretty much shooting the flash right on the subject of your pic. The AF speed is not as fast as dSLR but i think it's still usable. And oh yeah, the low light performance is not really that great either, it's acceptable, but beyond iso800, it ain't that good anymore.Basically, i think this camera is really like a direct replacement for the entry level dSLR and i bet the performance is on par with older DSLR such as nikon d40 and nikon d60. In fact the ISO perforomance should be on par with nikon d80 level. So you can roughly expect what you should be getting from this camera.I don't think this camera can totally replace DSLR but yes, at times it feels great to be able to go for a tour and enjoy your holiday without having the need to lug around a big camera when you don't really need it, and yet it produces pretty great images. So come to think of it again, i think this shall be a great complement to your DSLR system.", "Date": "November 13, 2010"}, {"Title": "Great compact APS-C camera, but weak video", "Author": "The Folded Space", "ReviewID": "R27UUV7DQ9ODXV", "Overall": "3.0", "Content": "I did a wide range of test shots recently and was quite impressed, though I found the sensor to be quite noisy. For this reason, I see no advantage over the emerging Micro four-thirds format, which I can see having greater staying power than this camera with its mostly proprietary lenses. The included lens in this kit, however, is quite versatile.The real problem is if you want to rely on this camera for video as well. In ideal conditions, the video looks quite good. Taking advantage of the large sensor and selection of lenses should put you ahead of most consumer grade camcorders. There are very few controls, though. There are also audio sync problems and file clipping issues that are not addressed in the firmware update at this time. This has been a deal-breaker for me as I wanted to eliminate the camcorder. Were it not for this, I'd rate it 4 stars and would've kept the camera.", "Date": "April 22, 2010"}, {"Title": "Great Compact Camera", "Author": "AL-Musafer", "ReviewID": "R2V1L1FER6AJ0C", "Overall": "5.0", "Content": "Update:I was planning to buy a small professional camera so I can take it where ever I go, the choices was between1-Panasonic GF1 2-Panasonic G2 3- Olympus EPL1 4- Samsung NX10Comparing these camera with the Samsung NX101-Panasonic GF1 old jpeg engine, no EVF, weak indoor photo with flash2-Panasonic G2 weak indoor photo with flash, more expensive bigger size3-Olympus EPL1 slow auto focus, flimsy control, 14-45mm Kit lens not sharp, 2.7\" screen are not so clear.4-Samsung NX10 price of entry level, image quality and feature of higher levelThe camera is excellent I can't resist I buy it with 18-55mm kit lens although  I was hoping it will come with the 30mm lens as a kit.Menu is very easy and will organize and you have everything in controlAMOLED screen Display is very clear also you have lots of helpful Dynamic data on screenEVF View finder is large and clear with lots of data very useful in bright lightLive view is always life coz this camera has no mirrorBody is will design the size is small and comfortableThe 18-55mm lens is sharp unlike other camera kit lensAuto focus is fast and accurateImage quality is excellent; soon I will upload some picturesSorry for my uploaded Pictures its not that clear coz its modifide by amazon and resized then lose qualityto see my image go to flickr search for my name AL-MusaferHighly recommend this cameraThanks for your new product Samsung NX10 Camera ,,", "Date": "April 26, 2010"}, {"Title": "Good camera, though the kit lens is delicate.", "Author": "Steven Grandy", "ReviewID": "R1SS5NDNH86HKK", "Overall": "3.0", "Content": "I really like how this camera feels and overall I'm satisfied with the picture quality.  The amoled screen comes in handy in bright situations but the one gripe I have with this camera is that the bayonet mount on the kit lens is made of plastic and is quite flimsy.  The after-market lens offerings have metal mounts and I expect they would be more robust than the kit lens. Since the lenses for this camera carry the OIS, it would make sense that Samsung would build the camera suitable for normal use.", "Date": "October 25, 2011"}, {"Title": "Amazing camera", "Author": "R. Chen", "ReviewID": "R1DDF0A3LOIWJB", "Overall": "4.0", "Content": "This is a great camera for those stepping up from point and shoot's. It comes with a set of lens that allows you to take great photos and videos.my only con would be the fact that video length is only 25 minutes. i've read on forums that the processor will overheat after 25 minutes and that is why it's capped. it's a shame since most point and shoots will record forever... overall, it's a fun camera to have, it's light and i've taken over 1500 shots with flash with only a single charge. it's pretty exciting to be able to do so much with one charge.", "Date": "January 21, 2011"}, {"Title": "Price", "Author": "FOWG", "ReviewID": "R3BKF2UXNEG9SD", "Overall": "5.0", "Content": "I wanted an SLR, but was not willing to pay the usual price. Along came the Samsung NX10, the SLR which is not an SLR. There is no mirror to direct the image, rather there is a small screen visible in the viewfinder which accomplishes the same thing in a light weight, compact package. It has interchangeable lenses and a threaded lens to accept filters.(manual zoom) My only concern with the construction is the lens mount is plastic and I wonder how long before the lens is out of alignment. It seems to be fully up to date with all the digital features and for an old fogy it can be fully manual as I remember cameras...........cool. It is everything I wanted at a price I was willing to pay.", "Date": "November 30, 2010"}, {"Title": "Great hybrid camera!", "Author": "TjienPing", "ReviewID": "R3W2DYNATURBYC", "Overall": "5.0", "Content": "I come from Point and Shoot background, and had recently learned that to take great photographs, you need a camera with large image sensor. With a large image sensor, you can have more control over your depth of field, and greater dynamic range and low-light photography performance.Read this for more info:[...]However, coming from point and shoot, I don't want to lose the size advantage, so I looked for the smallest camera with large image sensor. I considered micro-four-thirds camera. Had Samsung not released NX10, I might've ended up with one of the m4/3 cameras. However, I like the APS-C sized sensor this camera offers, and it has great online reviews, so I ended up buying this one. Sony also has APS-C hybrid cameras, NEX series. I didn't consider them much because according to the reviews, the camera doesn't handle well if you want more manual control.I could not be happier with my choice with NX10. There's already a lot of reviews online that you can read that outlines its strength and weaknesses.I bought this camera with the pancake 30mm lens. I hardly ever use the standard zoom lens it comes with.With the pancake lens, you really end up with a small camera with DSLR capability. Its image quality is superb. It handles really well.If you want to see sample images from the happy users, look at this thread:[...]", "Date": "July 7, 2010"}, {"Title": "Samsun NX-10 is Not Mac Friendly", "Author": "Stan Winterman \"Walrus\"", "ReviewID": "RAX0Z9OI6A4SI", "Overall": "2.0", "Content": "This camera, the Samsung NX-10, is not Macintosh friendly.I made movies with it, and transferred them to my Mac (MacBook running OS 10.6.5) via USB. But neither Quicktime (ver 10.0) nor iMovie'O8 could fully import the files. After repeated failures, I chatted with Samsung customer support about this problem. I was told that I should use the software that is packaged with the camera. But the packaged software is for PCs only, and, according to Samsung customer support, the camera is not tested with Macs. Samsung customer support suggested that I return the camera, and I did.I have two other cameras, a Panasonic Lumix FZ35 and a Canon Powershot S90. Both of these are compatible with my Mac. I have no problems importing movies or photos.", "Date": "December 17, 2010"}, {"Title": "Perfect images", "Author": "William L. Smith III", "ReviewID": "R3L1N4WT04TLZY", "Overall": "5.0", "Content": "This camera takes incredibly clear and detailed fotos.  Whether with or without the flash, fotos are excellent.  I will recommend this camera to any and everyone I know.", "Date": "March 11, 2013"}, {"Title": "Sharp Stills Great Camera", "Author": "TACRANCHER \"dwadmin\"", "ReviewID": "R54ULJJ29TFJJ", "Overall": "4.0", "Content": "I have worked with/on computers and electronics for over 20 years. I am a novice photographer. Although plastic, body is tight and sturdy. Nice compact size. Good heft to hold on to. Controls (dials and buttons) are easy to reach. Good egronomics. Battery life/time is good. Photo quality is sharp and accurate. Good quality kit lens. It is wide at the lowest setting and still very sharp at the longest setting. I have the 18-55mm and 20mm lenses. I-Function is handy and smart! While most I read complain about EVF, I would rather have EVF. EVF is WYSIWYG and optical viewfinder is not always what the photo will look like. The video is acceptable for clips but, the video routine in firmware needs to be cleaned up. Video is jerky at times. I like it so much for the still quality, I sold my D3100.", "Date": "January 28, 2012"}, {"Title": "Best Little Camera", "Author": "Northwest", "ReviewID": "R1K8MEQTQE3FO7", "Overall": "5.0", "Content": "This is the best camera you can find. It is comparable to other cameras on the market, but this not only cheaper but you gain more features. The only slight downside to the camera vs other Samsung Point and Shoot cameras, is that you have to take out the battery to charge it. You cannot simply plug it into your computer and charge up the battery. Minor draw back. Beyond that there are no other draw backs to this camera. It is super easy to use, super easy to switch from various functions and features and manual features.  It allows for control when you want it, and ease when you just want to snap something great while you are there. The dial on the right side allows you to change the exposure with ease while looking at the picture you are taking. Every button is laid out perfectly where it can be reached easily but not in your way that you are accidently pushing buttons.  It is smaller and lighter than other cameras like it, and it is packed with more features for less. I have used other brand cameras before buying this one, and the Samsung Nx10 is the clear winner on all counts. You will not be disappointed with this camera. the lens that it comes with is great, I additional ordered lens that is easily changed out.  Samsung Lenses are hard to find, but remember that Pentax and Sigma make lenses that fit (size) this camera. Also if you are worried about the size of the camera not fitting other lenses, there is also an adaptor that can be purchased ($30) that fits on the end of this camera that allows for any lens to be used with it. I was worried that by going with the small size of the Samsung Nx10 (being mirror-less) that I would limit myself to only being able to explore what Samsung put out there for it, not the case. Additional lens, and accessories are available and you will NOT be limited with this camera. You can buy whatever you want for it, but you really wont need to buy lots and lots with it, the camera is jam packed with features as it is, and the lenses available cover just about everything you will want to do.  There is nothing limiting about this camera at all. Everything that worried me about buying it has been solved and cleared up and it is amazing. I recommend it to anyone from beginners to pros, because you can add anything you want to explore where you want.  I like to think of other brands saying \"we have a lens for that\" while Samsung says \"we have a function for that\" its the best all around package camera you will ever find.", "Date": "December 21, 2011"}, {"Title": "Great camera for an amateur photographer", "Author": "Intothewild", "ReviewID": "R1JM0FRO2C3T8W", "Overall": "5.0", "Content": "I am an amateur photographer.  Each big trip we take I have found that I wanted a new camera because the last latest and greatest just wasn't good enough.  I never had the desire to get a DSLR because we take a lot of backpacking trips and did not want to lug around a big camera. When planning our latest trip, I went searching again.  I debated between the Sony and the Samsung because DSLR like sensor and the small size.  I ended up choosing the Samsung for the easer to set up.  I can tell you that I love this camera!  The pictures that I took hiking up Mt. Whitney were some of the best pictures I have ever taken.  And yes, I did carry this around my neck the whole way up with the standard lens.  I had bought the pancake lens thinking that it would be better for backpacking trips but I felt limited and left it behind.  To do over, I would not waste money on the pancake lens.  One other minor comment is the camera sometimes cleans the lens upon start up. This is a minor issue but it may be a hindrance for action pictures.I really cannot comment too much on the video.  I take pictures not videos. I did play around with it.  It seemed fine, but I did not try to push it to the limits.", "Date": "November 25, 2010"}, {"Title": "Best compact DSLR camera", "Author": "dalleto", "ReviewID": "R2M2HKQC0RHIMJ", "Overall": "5.0", "Content": "This is a great camera for beginners and someone who's into a compact DSLR camera, its not for really a fast pace sport action camera but good for gathering, sports, events. The video and picture was good. For the price of the camera and its capabilities, its a big bargain...I'm having my third lens next week for this camera... I'm loving it.", "Date": "November 19, 2010"}, {"Title": "NX10 is world best hybrid DSLR!", "Author": "Choi Seon Woo \"johnny hananim\"", "ReviewID": "R1DXB6U4IMZKTE", "Overall": "5.0", "Content": "I wanted to small compact mirror-less Dslr.I tried Panasonic GF1, Olimpus EP2, E-pl1and I decide buy samsung Nx10 because it has APS-C sensor.That's mean better picture quality than M3/4.APS-C sensor is 50 percent bigger than M3/4 sensor( Panasonic,Olimpus)Nx10 is the only one hybrid DSLR has APS-C sensor.It's Too big size sensor than  M-3/4 -Olimpus,Panasonic.and Too much 14.6M Pixel than M-3/4's 12M Pixel.So, Nx10 Picture quaility is best in the hybrid Dslr!besides , Nx10 value is much cheaper M-3/4.moreover , Nx10 is very small and light- it's similar M-3/4.I think NX10 is best mirror-less DLSR in the world.I used i-phone 3GS camera. but it's quality  is very poor.So I buy Nx10 and 30mm pancake lense.It's perfect !Nx10 go into my suit pocket easily, so very portability.and then , samsung plan 20-50mm zoom lense in june.It's very compact because OSI is excluded.That's size is close on  30mm pancake!You plan to Hybrid Dslr, Check It.1. Very small size and light weight.2. APS-C sensor -high Quality picture . 14.6M Pixel.3. Very fast autofocus speed. Nx10 is similar panasonic, it's world best .4. AMOLED screen is very cleary and bright than general LCD.5. high resolution viewfinder and flash.6. 30mm, 20mm pancake and 20-50mm very slim compact zoom( samsung plan sell in june)7. High build quality, fine finish,vintage design,\"feel luxury\"8. Finally , much cheaper all have above all spec.But Nx10 has only one demerit.NX10 APS-C Sensor technology is fall behind few years ,especially Canon's up-to-the-minute APS-C sensor.NX10's high ISO noise is a lot.I tested  NX10 and Canon 550D sensor.(Nx10 : 14.6M Pixel)ISO 100- ISO400 is very clear.ISO 800 is pretty good.But ISO 1600,3200 is rough.( Canon 550D : 18M pixel)ISO 100-ISO 1,600 is very clear.ISO 3200 is some rough.( NX10 ISO 800 is better than 550D ISO 3200)But ISO 6,400 is rough.Nx10 sensor fall behind \" 1.5 shutter stop\" Canon 550D.But Canon 550D is NOT Hybrid DSLR, so It's Much Bigger than Nx10.If you want i-phone like slim light camera with Dslr Picture quality.I Highly recommended NX10.", "Date": "March 23, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.6-megapixel effective recording\nAPS-C-size CMOS image sensor (23.4 x 15.6 mm)\nSamsung 18-55mm f/3.5-5.6 OIS zoom lens (35mm equivalent focal length: 27.7-84.7mm)\n3X optical zoom (approximate)\nBuilt-in optical image stabilization", "Name": "Samsung NX10 - Digital camera - prosumer - 14.6 Mpix - With 18-55mm Lens - supported memory: SD, SDHC -  black", "ImgURL": "http://ecx.images-amazon.com/images/I/51jcDbC7IuL._SY300_.jpg", "ProductID": "B003CY9RWS"}}