{"Reviews": [{"Title": "Great Camera", "Author": "P. Hoffmann", "ReviewID": "R1FLHKQFFDMBIV", "Overall": "5.0", "Content": "Really love this camera.  I bought if for my wife so she could email and send pictures to Facebook without having to transfer pics to our computer first.  Easy to set up and use.  Just got back from two weeks of vacation and we didn't use our digital SLR at all because this camera takes such great pictures.  Also, the video in HD quality is outstanding.Some of the \"smart\" modes had problems, but I've found this true with all digital cameras.  The regular point and shoot mode works best.  The options for scenes are very good.  I took some of the best sunsets shots I've ever taken with this camera.Here's a good video review of the camera:  [...]", "Date": "February 2, 2011"}, {"Title": "Excellent Picture Quality, Excellent Connectivity", "Author": "T. May \"Escapist\"", "ReviewID": "R3OX0S903HVX72", "Overall": "5.0", "Content": "I was a bit concerned when I first saw this camera reviewed. I love the idea of a network connected camera if for no  reason that being able to delete shots and clips off the memory card directly to places like flicker and youtube. Once they are in the cloud, they are reasonably secure until I can download them later and burn to my NAS drive. But if the quality of the photos suck, what's the point?What was really cool, was that I was able to transfer pictures to my Android phone via Blue Tooth too. I have uploaded files many times without any issues.Up until this camera I have been a die hard Olympus fan going all the way back to the UZ-2100. Even though it suffers from good pixel saturation, that camera had EXCELLENT optics for it's time. With almost 7 times more resolution and a much faster processor... this camera rocks! Last year I put down my SLR because it was too cumbersome to drag along with me on a daily basis and on vacation. I picked up this camera JAN2011 and I have been using nothing else since. I even use it for some HDR bracketing processed photography. It's kicks ass over my 12 mp SLR and it's just as fast. The image file size is of no concern to me. I can still get plenty of HQ photos and videos on a single 8GB Micro SD chip.I did notice that the street price (not on Amazon) has dropped since I bough this camera. I think the new version will be out soon.My only complaint is that it doesn't shoot in RAW format. But, with 14+ MP, who cares?", "Date": "March 11, 2011"}, {"Title": "Samsung CL80 Does What It Says and It Is Easy", "Author": "Walter Riker", "ReviewID": "R1WJTTUOS277LW", "Overall": "5.0", "Content": "Very happy with our Samsung CL80. The pictures are everything Samsung says and the ability to close-ups is amazing. I have shot snow crystals on leaves and many other things, pushing the camera and it comes through. I am using it to capture the items my wife and I cut in glass prior to putting them into the kiln and  the CL80 does a great job. We are very happy with the camera, with Samsung and with Amazon.", "Date": "February 12, 2011"}, {"Title": "Great pictures!!! and HD video!", "Author": "H. C. Kim", "ReviewID": "R9AL122PTS069", "Overall": "4.0", "Content": "I bought open box item from best buy payed $150.00.Dame the picture is great, touch screen respond great. HD video recording great.But wifi seems not working well.  Anyway, I don't use wifi stuff anyway.  for the price I payed and quality of pictures... I think this camera is last one for me, no more another digital camera!!!Although, I need to learn more about this camera.  It seems like have more powerful functions, if you don't want to use auto mode....", "Date": "March 28, 2011"}, {"Title": "happy", "Author": "jj", "ReviewID": "R1NU7U0FRBGLRJ", "Overall": "5.0", "Content": "I am very pleased with this camera. I must admit it has more bells and whistles than I can use but for a back-up camera on hikes and bike rides it's perfect. The pictures are very resolute; the ease of loading onto my computer was a whiz; the auto settings are perfect for quick shots of wildlife; the battery seems to last forever. I would totally recommend this camera to anyone. However, the technical aspects of this camera are a little daunting to me because I am not much of a \"techie\" but for others it may be a snap. The auto settings are every thing I need.", "Date": "June 2, 2012"}, {"Title": "Takes great pics!", "Author": "Mae W.", "ReviewID": "R8WZK7GZ49L5Z", "Overall": "4.0", "Content": "Brought this camera for my BF's son. He's 13 and took him sometrial and error to figure out how to work it...but he did.", "Date": "April 19, 2013"}, {"Title": "locked up occasionally, finally died before 2 yrs old", "Author": "William C. Symons", "ReviewID": "R1V1D9WN6SQCYM", "Overall": "1.0", "Content": "I did not buy this at Amazon, but as a prime member, wanted to post my review for this camera. Picture quality was great. Heavy solid body felt like good quality.Had taken about 1000 pictures when it died, and no abuse including drops.The facebook utility was kind of cool and useful, but a bit quirky to use, since it does not remember passwords.Occasionally it would lock up with the lens extended, and I would simply remove and reinstall the battery. Then last summer it locked up and would not restart or shut down period. Web search for resolution was no help, I got the feeling this was a rare issue. It was just out of the warranty period, and Samsung was happy to take a look at it for nearly the cost of the camera. I left the battery out for a week, draining the internal battery, and it restarted. It worked for another month, then it really died. The lens extended, but the system and screen would not start, couldn't take pictures, and it would not shut down. Only the blue power light worked. Removing battery for weeks had no effect. Off to electronics recycling for this camera:-(", "Date": "March 8, 2013"}, {"Title": "Great Pic, Complicated Wireless", "Author": "jlc1261 \"enterpriser2151\"", "ReviewID": "R1RCMDV9E1E5FP", "Overall": "4.0", "Content": "The pictures are very sharp and there are numerous settings and functions that I'm just beginning to learn.  However, the wi-fi connectivity is a bit wonky and I have yet to get it to connect in any meaningful way.  I tend to dive in with a gadget instead of reading all the manuals, but something like this should be pretty self expanitory, yet it is not.  I can still connect the camera via a cable and that works well.", "Date": "January 7, 2013"}, {"Title": "Love the product - but there is NO support!", "Author": "Robert F Pannett", "ReviewID": "R2WILY16BC7FP", "Overall": "4.0", "Content": "I couldn't figure out how to upload pictures to Facebook. It could be a compatibility issue with Facebook Timeline.  Anyway, there is absolutely no support for this product.  It works great, otherwise!  I think it was an early wifi-capable camera, with more features than you can shake a stick at.  I can even connect wirelessly to my flat screen TV and swipe the touchscreen on the back to display pictures from the camera on the TV.  Awesome product, terrible (virtual lack of) support.", "Date": "December 26, 2012"}, {"Title": "great $75 camera, can.t complain at all!!!", "Author": "steve", "ReviewID": "R29K6IL8R3JWEC", "Overall": "5.0", "Content": "bought through amazon for $75 from BLINQ as new with 1year warranty. a great deal in anyones book. VERY happy with product, i'm a pixel peeper and i still love this camera and all it's features 11/19/2012 couple weeks since last review still not a single problem and i really put this camera to the test.", "Date": "November 4, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Share images and videos instantly with Wi-Fi: Share images and videos wirelessly. Instantly send a photo to another mobile phone using Bluetooth. Or rely on the Wi-Fi capability to email it directly from the camera or upload it seamlessly to Picassa, Facebook, YouTube, and samsungimaging.com. You can even upload a video you just shot to YouTube.\nIntuitive photo taking with multiple features: Samsung's innovative features make taking photos easier and more intuitive. The Slanted Shutter is designed to better fit your finger; a full-size lens takes in more information; and a 7-degree tilt-back body makes taking self-portraits a breeze.\nBrighter screens with AMOLED technology: Colors pop and shadows become saturated on an AMOLED screen. A response rate 3000x faster than an LCD display creates a brighter screen with reduced glare at any angle, even in direct sunlight.\nFull HD-quality video in a still camera: Capture high definition 1920x1080p video at 30 frames per second on your still camera and leave the camcorder at home. H.264 format has a recording time that's 4x times longer than MJPG and a stereo microphone for crystal-clear audio. Connects to any HDTV or HD monitor with an HDMI cable.\nDual Image Stabilization corrects shaking: The Advanced Dual Image Stabilization (IS) combines both optical and digital image stabilizers to capture crystal-clear, blur-free shots even in low-light or fast-action scenes", "Name": "Samsung CL80 14.2 Megapixel Wi-Fi Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41n6g4Kd0kL._SY300_.jpg", "ProductID": "B0036RBEB8"}}