{"Reviews": [{"Title": "Do not buy this product!", "Author": "T. Wecker", "ReviewID": "RLRBQ7DR7X965", "Overall": "1.0", "Content": "I purchased this camera for my 8 year old to use on her school field trip.  She was so excited about all of her photos and videos.  The battery kept going dead as we were reviewing the pics (the battery life lasted 1/2 day in this camera).  When I changed the batteries, all the memory was lost.  She was in tears.  I called Polaroid customer service and they said this happens when you change the battery.  Horrible product.  Very disappointed in a trusted name like Polaroid.  I thought my daughter would get bad photos with a $[...] camera.  Instead, she just has memories that were wiped away.", "Date": "May 5, 2010"}, {"Title": "Zero stars???", "Author": "Stacy \"cheetaah\"", "ReviewID": "R11TEF56JK4S9W", "Overall": "1.0", "Content": "Awful camera.  I bought TWO of these for my pre-schoolers for a cross-country roadtrip.  The camera has no lens cover, so little fingers always smudging, no strap even comes with it.  Worst bits?  Camera only holds 30 pics (imagine!  With a 5yo this is 5 minutes of pictures!!!), then you need to manually delete or download before they can take more.  Battery lasted 1/2 day.  I decided we need to take these back to the store for a refund.  They stink.  And the kids are SO disappointed!!!  Thought we'd be able to make scrapbooks using their photos and a few of ours, and now they can't do that.", "Date": "August 3, 2010"}, {"Title": "had to return", "Author": "Nana Ann", "ReviewID": "R19NC1GQTGHQI5", "Overall": "1.0", "Content": "could not get camera to download to computer...  had to return....  picked up Vivitar for about same price at local drugstore instead", "Date": "July 24, 2010"}, {"Title": "Please Read This!!!", "Author": "lisa gibson", "ReviewID": "R62S9BSQH7IO7", "Overall": "1.0", "Content": "Polaroid should be shut down for doing this to people!  Well not shut down, but the people who passed this product off as sellable to the public should be fired.  REALLY.  My wife & I got this along with a digital photo frame for my sons 10th birthday (which is today) In hopes he would learn some basic concepts in photography and be more like his dad which is a professional photographer, instead he got the biggest discouragement ever.  Right at the birthday table he opened the camera, got the batteries in it and started shooting. After the second POOR quality photo taken, the battery indicator started flashing, then shut down.  You talk about a dear caught in the headlights; my son asked me-what's wrong with the camera?  I had to swallow my pride and tell him the truth about some companies, and told him lets get our coats on and go buy a real camera like a an Nikon point and shoot.  I should have known better... thanks Polaroid, I really thought a company my parents used to film me at my boyhood B-day parties would be good enough for my son's too. Shame on you!!! P.S. I checked the reviews before going out to get another camera, and to my supprise, you guys screwed a lot of other kids days up too!", "Date": "December 8, 2010"}, {"Title": "Don't be tempted by the low price and brand name", "Author": "J. Rookard", "ReviewID": "R3HOPGJIGG0T73", "Overall": "1.0", "Content": "I bought this camera at Target for my 7-year-old. She took it to a Major League baseball game, was thrilled to be taking her very own pictures, got home and the pictures were all gone. She was in tears. I reviewed the process for deleting photos and it was obvious she didn't delete the pics she took, the camera somehow malfunctioned. Also, the LED Flash is a joke - it barely lights up an object 12 inches from the camera.I'm taking it back.", "Date": "August 29, 2010"}, {"Title": "Should have known!", "Author": "Darin Jeffers", "ReviewID": "R3QODYIEJKOASS", "Overall": "1.0", "Content": "Next time I'll check the review before purchasing. Absolutely the worst camera I've ever owned, and I'm even including the old 110 keychain camera I got out of a vending machine in the 1980's.", "Date": "April 20, 2011"}, {"Title": "Don't Buy this Camera!", "Author": "onegodbeliever", "ReviewID": "R22GJ1VI8IT8LM", "Overall": "1.0", "Content": "Had the same issues noted by others. Photos mysteriously self delete, and I could never transfer photos to my PC.  Don't buy this totally useless piece of junk.", "Date": "January 23, 2011"}, {"Title": "Horrible camera. Polaroid should be ashamed.", "Author": "pam", "ReviewID": "RSGLDMQ184PZS", "Overall": "1.0", "Content": "This is the worst camera I've ever owned. Every picture is red, dark and grainy and nearly impossible to see...even when using the joke of a flash. I bought this for my son and we're both very disappointed. He has the cheapest cell phone on the market and even IT takes better pictures than this camera. I expected much better from Polaroid. I would've rated it zero stars if it would've let me.", "Date": "December 30, 2010"}, {"Title": "Horrible \"camera\" - DO NOT BUY!", "Author": "C. Whiddon \"squeekybuddha\"", "ReviewID": "R1P4WRVTMSW9PI", "Overall": "1.0", "Content": "We bought this camera for our 4 year old son for Christmas. He was SO excited as were we, we wanted to see the world through his eyes. This \"camera\" takes horrible photos! At first we thought it was just a poor display on the camera but once we uploaded them to the computer we realized the actual photos were the same grainy, poor color capture that we saw on the camera screen. UGH! I have never felt I wasted [...] more in my life!", "Date": "December 26, 2010"}, {"Title": "How can you go wrong with a camera like this!", "Author": "Rhegie", "ReviewID": "R3LGS5N8SG13YE", "Overall": "5.0", "Content": "USB Port! 500MB free disk space! Webcam function! Color Monitor with 16-bit graphic capability! Inexpensive and have such a great quality!", "Date": "December 15, 2013"}, {"Title": "Enhanced Resolution!", "Author": "Timmy C", "ReviewID": "R33SHFK1I7S0JC", "Overall": "5.0", "Content": "Love it! 1.3 MP MP CMOS sensor enhanced to take up 2.0 MP photos! with a compact design lets you take your camera anywhere!", "Date": "December 15, 2013"}, {"Title": "Waste of money!!!", "Author": "Scoop \"Moondaughter\"", "ReviewID": "R24POAGNVHGPT2", "Overall": "1.0", "Content": "I purchased this a gift for my daughter...thought Poloroid was an awesome brand. Not so for this particular camera! We bought an $8 camera at a checkout that is better than this one!!!! Do not waste your money on this! The pictures come out blurry no matter what you do. There is no way to be still enough...maybe a statue could do it? The max pictures we were able to get it to store is 25, and that number has gone down to around 18. Do not buy this!!!Great as a gift for my 3 year old granddaughter! Who happens to own this camera now!", "Date": "December 13, 2011"}], "ProductInfo": {"Price": "$24.99", "Features": "8MB built-in storage\nTakes video Clips\nPolaroid Pixel Technology\nAAA Batteries. Web Cam", "Name": "Polaroid CAA-200LC 2MP CMOS Digital Camera with 1.44-Inch LCD Display (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41zx-8IyCTL._SX300_.jpg", "ProductID": "B003E47FUM"}}