{"Reviews": [{"Title": "The Ricoh GXR - an truly underrated but excellent prosumer camera system", "Author": "Let it Be \"Alan\"", "ReviewID": "RYYDEIL06E69S", "Overall": "5.0", "Content": "As an avid photographer and gear collector for 2 decades, I have never a fan of Ricoh cameras until I own my very first Ricoh camera - the Ricoh GXR P10 kit three months ago.Outside of Japan, Ricoh has long been an underrated camera manufacturer as its camera department had been concentrating its manufacturing resouces on P&S; or point and shoot rangefinder film and digital cameras. Otherwise, Ricoh has been relatively well-known in the imaging and document reproduction industry for its photocopier machines like Canon, Minolta and Fuji Zerox.Up to recently, July 2011, Ricoh bought Pentax to built interchangeable lens camera business which may see it grow in the future.It is known to few photographers, that Ricoh does make a series of high quality and excellent prosumer grade amateur cameras the GX, GRD series, which according to their marketing department is targeted at \"serious female photographers and middle age male amateur photographers, which I fitted into the latter category.To begin with this prosumer-grade camera, the GXR is quality built and a system camera, by design it is both quirky and bold at the same time. Its innovative design had surprised many a seasoned photographer and the gadget crazed hobbyist like myself.The GXR is essentially, the camera body itself and works with the interchangeable lens and sensor modules which comes as an option. The P10 or 28-200mm zoom lens module comes as a kit option with my GXR purchase and I heartedly recommend this GXR P10 kit to first time owner of Ricoh cameras.It is compact, extremely portable and delivers excellent image quality with superb (though not superior) optics in the P10 interchangeable lense-sensor module. According to Ricoh by building the lens and the sensor together optimizes the lens design and sensor capability in a single package and beats obsolescence (until Ricoh releases the next module, of course)The GXR is a camera designed by photographers for photographers, a lot thoughts has been put into its design and it is really a class of its own.It is a camera to be owned experienced by its owner.A picture speaks louder than words and therefore I posted some of my best shots taken with the GXR P10 kit in this Amazon.com page to share, it is most objective looking at the photos produced with the GXR to decide how good this camera is and to take it out on a trip to experience the joy of using it.The Ricoh GXR is a feature rich camera which could easily beat the best Nikon P&S;, the Nikon P7100 on superior built quality and lower price point. In addition, the GXR is a system camera with interchangeable lens, useful accessories and upgradable expandability.People who really like the Ricoh GXR and made wonderful pictures with it will know it is their camera once they first feel the camera and test it at the nearest friendly camera retailer shop, period.Potential owners should visit the Ricoh GXR site for detailed technical and system information. The best feature to highlight is the 1cm MACRO capability which allows for stunning close up shots of everyday objects.Thank you for reading my humble user review, and my pictures made with my SXR P10 kit, I hope this review is useful to you.", "Date": "September 29, 2011"}, {"Title": "5 Stars for the GXR System, not so for this lens", "Author": "Adams Jeirs", "ReviewID": "R2MD14WRD76VEL", "Overall": "3.0", "Content": "Don't get me wrong, this is a fine lens module for vacations and other instances when you need a zoom. It is equal to, or better, than many of the compact cameras in this class. However, once I purchased the A12 50mm f/2.5 Macro GR Lens for the Ricoh GXR, I haven't used this P lens module at all.The A12 is superb, it will finally allow you to show off your photos with pride. If you are looking for this P10 system for vacations, I noticed that 90% of my vacation photos were taken at the 28mm (equivalent) setting. So the Ricoh GXR body with the A12 28mm f/2.5 GR Lens woud have been a much better system for me in Europe last summer. I really regret not having spent the extra, as large sensor and superb glass on that lens module would have been ideal.I recommend this system highly, but not this P10 lens module. Spend the extra on one of the A12 modules (or both) -- you won't regret it!", "Date": "November 2, 2011"}, {"Title": "Nice photos, intriguing feature, but alas, not perfect", "Author": "S. Melvin", "ReviewID": "R38GCT2PTALZ9X", "Overall": "4.0", "Content": "Ricoh has designed a camera like none other.  Instead of buying a xx MP camera that, as technology advances, you simply have to live with or sell - Ricoh allows you to adapt your needs as technology adapts.  Want more MPs?  Buy a new mount to fit on the body.  Want more zoom?  You can get that too.  Yes, most of these features area also available on SLR cameras, but how many are available on a camera the size of a medium point-and-shoot?As for photos - this camera can take some stellar photos, capturing the light, as the photographer intended.  All too often cameras advertise spectacular new features, but the chip utilized to translate the real world into digital information lacks the ability to actually capture what the photographer thought they were seeing - pictures can end up too blue or too red...a bit too dark or too blown out.  Ricoh's chip seems to handle all these tasks just fine and the photos produced are above par.Unfortunately, this leaves the one area where this camera is lacking - updates and modules.  Ricoh had a great idea, but due to lack of interest (most users want a simple point-and-shoot or a very fancy SLR - this camera sits between the two), it seems that new features are lacking.  You can certainly find lens attachments, if you are willing to dig deep enough on the internet, but it just never made its debut on the market as we had hoped.Overall I am quite satisfied with this camera and the extra parts we purchased for it at the beginning.  It takes great pictures and is easy to transport when on the road (something that makes taking our SLRs less and less desirable).  Ricoh had bold plans to release some excellent lens adapters for this camera and we are still holding out hope that it does.  This technology was just a bit ahead of its time - or perhaps was outdone by the fact that affordable, who cares if they break and get thrown away, cameras are released on nearly a daily basis - and on cell phones to boot.", "Date": "October 5, 2013"}, {"Title": "Good starting kit for GXR system", "Author": "Raul Ocampo \"z68rsoa\"", "ReviewID": "R1YXW4RMK2Q7OS", "Overall": "4.0", "Content": "When I bought it I knew this was the wrong camera. My other cameras are film or digital SLRs with prime lenses. I have Nikons for speedy autofocus and a Pentax for the jewel-like look the FA 43mm/1.9 and FA 77mm/1.8 give. Even the Nikkor 28mm/2.8 D, 2nd cheapest lens in Nikon's line, gives images of remarkable clarity compared with the Ricoh P10 module.So why did I get it? I wanted to shoot video and as someone who's never owned a digicam it's something I can now do at 720p. True the files are large but I can import them into video editing software and compress it down to H.264. It's also tiny and I can almost forget I'm carrying it; something impossible with an SLR or larger camera.Also there's a Leica M mount module coming up and that opens up a world of vintage Leica and modern Zeiss M and Voigtlander lenses to use. I don't know if the M mount module will be able to do video but I'm covered with the P10.All in all I'm satisfied with the kit and saving my money for M lenses.", "Date": "March 28, 2011"}, {"Title": "Tried to like this camera", "Author": "Jean A Freitag", "ReviewID": "R1FZCOGFZLYSZS", "Overall": "3.0", "Content": "I am returning the second Ricoh P10 that I have purchased, it seems for the first week or so, It works well, then it starts to freeze, you can't turn it off or turn it on.  I have to remove the battery when this happens to reset the camera.  This problem continued to get worse,and happen more often,  so I am returning it.As far as the quality of pictures, I found it to be very responsive and very clear pictures.. especially in low light.The camera is  very well built camera and just the right size, but the problems outways the good qualities.", "Date": "February 7, 2011"}], "ProductInfo": {"Price": "$499.00", "Features": "Lens, image sensor, and image processing engine comprise an integrated unit which can be changed to match the scene being photographed.\nWorld's smallest and lightest digital camera with interchangeable lenses\nSystem potential expanded through use of interchangeable units\nBody exterior is die cast magnesium, and the the surface is covered with a corrosion-resistant \"pear-skin\" coating.\nThe automatic exposure modes include program shift mode, shutter priority mode, and aperture priority mode.", "Name": "Ricoh GXR Interchangeable Unit Digital Camera System with 3-Inch High-Resolution LCD and P10 28-300mm f/3.5-5.6 VC Lens with 10MP CMOS Sensor", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BXHD5VLZL._SX300_.jpg", "ProductID": "B003M5H7Q0"}}