{"Reviews": [{"Title": "Awesome", "Author": "Nik", "ReviewID": "RWB34FZ8ITXHC", "Overall": "5.0", "Content": "We were a little hesitant about purchasing a refurbished camera.  We are glad that we did.  It is in perfect condition, there are no flaws or anything that we can see.  No spots on the lens when taking pictures. Overall we are very happy with this product.", "Date": "October 11, 2012"}, {"Title": "Nice camera!", "Author": "hip-hop restore", "ReviewID": "R1XZZV01VQX7OY", "Overall": "5.0", "Content": "Love the 7d.  Great or shooting videos and photoshoots as well.  The 5d mark II & 7 d changed the game!", "Date": "May 14, 2013"}, {"Title": "Outstanding build quality and layout", "Author": "TomVette \"TomVette\"", "ReviewID": "R3515JC3PLG12I", "Overall": "5.0", "Content": "I compared this camera to the excellent Canon 70D and opted to purchase the 7D. This camera is constructed around a die cast metal body. Though this may sound immaterial compared to the polycarbonate plastic used in most SLRs, to me it is not. This camera has an excellent balance, great weather sealing and the alignment of the body and lens is quite precise and durable.  The camera is very responsive and has a professional rated shutter mechanism and the Canon professional control layout  which is outstanding. The picture quality is superb, though the new Canon 70D is clearly superior in movie mode if that is a priority. Highly recommended.", "Date": "January 3, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "18.0 Megapixel CMOS Sensor and Dual DIGIC 4 Image Processors for high image quality and speed.\nISO 100-6400 (expandable to 12,800) for shooting from bright to dim light.\n8.0 fps continuous shooting up to 126 Large/JPEGs with UDMA CF card and 15 RAW.\nAdvanced movie mode with manual exposure control and selectable frame rates: 1920 x 1080 (Full HD): 30p (29.97) / 24p (23.976)\nIntelligent Viewfinder with 100% field of view, wide viewing angle of 29.4°, high magnification of 1.0", "Name": "Canon EOS-7D Digital SLR Camera Body, 18.Megapixels - Refurbished", "ImgURL": "http://ecx.images-amazon.com/images/I/2173FIyUtQL.jpg", "ProductID": "B003AUZJ8K"}}