{"Reviews": [{"Title": "Triple Plus", "Author": "Mommy D \"Dominique H.\"", "ReviewID": "R1NPAKY8XB5SYJ", "Overall": "5.0", "Content": "I ordered this Zumi and was completely FLOORED when I opened it to use it for the first time. The different color settings made each and every film shot amazing. My favorite so far is the Hard Monochrome. It just gives your film images a hard edge that not even really great video editing equipment can. I'll be taking this with me to Paris in the spring and plan on filling up quite a few memory cards with it! SO glad I waited for this edition!", "Date": "February 9, 2011"}, {"Title": "Beautiful little image maker", "Author": "Zantigar", "ReviewID": "R1YCJNADL4TVD6", "Overall": "5.0", "Content": "Hands down one of the most amazing artistic tools I've ever gotten.  Yes, yes, the technical resolution of the image is average by today's standards, but that's the way it was MEANT to be.  The geniuses at Superheadz have tweaked the image making software in such a way that this camera produces a totally unique, stuttery-motion \"imitation Super 8 filmish\" look that, in my humble opinion, way outdoes any other mini video recorder - INCLUDING the Apple iphone Super 8 app.  The only way I can describe it is that it \"embosses\" the images of world, sharpening and highlighting features so that even tiny figures in the background make an impression.  I'm telling you there's nothing else out there like this.  Yes, it's a little pricey for what it is in terms of what you're getting physically - a plastic \"toy\" digital camera. But judging by the extraordinary images this device produces, I'd say it's a BARGAIN at under $200!  How does one put a price on images of ecstatic beauty?  If you are an artist, you know what I mean.  If you have any doubts, go to this link and check out a sample I shot:[...]note: this product is for eccentric artistic types only.", "Date": "July 22, 2011"}, {"Title": "If your looking for a Lomo and still wondering about digital this is it.", "Author": "Dave", "ReviewID": "R2BO68QH7FBHK0", "Overall": "5.0", "Content": "I was looking for a good Lomo type of camera and the Zumi+++ fit the bill very nicely for me.  Granted it isn't a camera for everyone but with the saturation of colors and the ability to make videos with it worked for me great.  Have been using mine for about 2 weeks and I am still finding new ways to take pictures with its various options.  (Side note do buy the charger when buying the camera because it will be habit forming as you start to use this camera.)  Also the camera is rather small so it will take some getting used to on how to use it.  But once you do - you will be taking gads of pictures.  For me it is highly recommended.  The card makes it very convenient to download your pictures onto your computer.  Or you may simply choose to take your card and get the pictures you like developed.", "Date": "June 23, 2011"}, {"Title": "Harinezumi 2+++", "Author": "Dena Moon", "ReviewID": "R299BU22WIFER5", "Overall": "5.0", "Content": "This is a great fun little camera!  It gives the 'old' vintage and unpredictable feel to the photos. Not the main camera for our household but great for the more artsy stuff.  I love the different color options, and the video option too.  I've gotten some great vintage feeling silent video footage with this.", "Date": "October 22, 2011"}, {"Title": "NOT WHAT IT'S ADVERTISED AS.", "Author": "Tiffany", "ReviewID": "R2NHCRKGY9NGGB", "Overall": "1.0", "Content": "If you want the 8mm film look get a Harinezumi 1 and not a 2.The zumi 1 has a larger CMOS sensor and 1 less megapixel.", "Date": "September 10, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Digital Camera\nFocus Type: Fixed\nLens: 35mm f/3.0\nStorage: MicroSD (not included)\nBattery: CR2 (not included)", "Name": "SuperHeadz: Digital Harinezumi 2+++ Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41bq%2Bc9XzwL._SX300_.jpg", "ProductID": "B004GFZ9CY"}}