{"Reviews": [{"Title": "Worst camera ever", "Author": "Katie L. Wilson", "ReviewID": "R1WD1UJS5R2FSB", "Overall": "1.0", "Content": "The camera flash stopped working after the first day, the batteries only last for 20 minutes before the camera goes dead and it takes terrible pictures.", "Date": "October 29, 2012"}, {"Title": "Not too well made", "Author": "Elvin", "ReviewID": "RC4AQ6V6TT45T", "Overall": "1.0", "Content": "It is just fine for a starter camera for a child, but really is poorly made and hard to navigate.", "Date": "January 20, 2014"}, {"Title": "Cute camera, but not user friendly.", "Author": "Angela TeGrotenhuis", "ReviewID": "R3G0ZIN4HLC5V9", "Overall": "2.0", "Content": "I ended up returning this product because it was not worth the money. The picture quality is low and not worth the price. Although, it is very cute....I would rather have something a bit higher quality. Not what I expected is that respect.", "Date": "January 7, 2014"}, {"Title": "Great value, but I wish this had a rechargeable battery...", "Author": "Catherine", "ReviewID": "R1EOWDJ4AHOLC", "Overall": "4.0", "Content": "I love how cute and fun this camera is, and the size and features are perfect. It is a great value. I only have two complaints about this camera. First, like other reviewers, I could not attach the neck strap, and more importantly replacing AAA batteries in a digital camera is a hassle. I even bought a battery charger, but cameras go through the battery power so fast. I have been burned by expensive digital cameras in the past, so I guess for the price of this one, I can deal with the inconvenience.", "Date": "December 20, 2012"}, {"Title": "Cobra diamond digital camera", "Author": "Valerie", "ReviewID": "RJ6NMY2DSUTM6", "Overall": "5.0", "Content": "It was a very good deal I got on it. It does take good pictures. Love it, love it. I would recommend this product.", "Date": "November 3, 2012"}, {"Title": "Very cute camera", "Author": "Vantasy", "ReviewID": "R2F274RXUP7C9D", "Overall": "4.0", "Content": "I luv my camera it is cute and light, the only thing is the strap is difficult to attach. It is one of those bling items you can wear around your neck as part of your outfit. Luv it alot.", "Date": "November 16, 2011"}], "ProductInfo": {"Price": "$119.95", "Features": "2.4-Inch LCD Screen\n8x Digital Zoom\n12.0 Megapixel\nWorks as a Camera, Camcorder, Voice Recorder & PC Camera\n16 Mb Internal Memory", "Name": "Cobra Digital DCAV527 12.0 Megapixel Diamond Digital Camera with 8x Optical Zoom - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51PZJzhI4CL._SX300_.jpg", "ProductID": "B004EQ0KV0"}}