{"Reviews": [{"Title": "I LOVE THIS CAMERA", "Author": "Mary Buchanan \"Mary B\"", "ReviewID": "R3LYB77IKT2CN9", "Overall": "5.0", "Content": "Delivery of the camera  was super fast and I got to use my Amazon points so got an even better price than listed.  I have always used a point and shoot so this was my first Digital SLR.  My grandson is 10 and started racing motorcycles this year.  I wanted to get action shots of jumps and I am amazed that I took these pictures.  I love the 3 shots per second option.  I have great shots of him crossing the finish line in the air and have taken some beautiful pictures of nature.  It certainly isn't me I have to give all the credit to this camera.  I can't speak from a professional level but if you are an amateur and want to start getting beautiful shots out of the box this is the camera for you.  LOVE IT!", "Date": "October 24, 2011"}, {"Title": "Nice one", "Author": "NEO \"Stupidity Kills\"", "ReviewID": "RK96CXVJUQXAI", "Overall": "5.0", "Content": "works fine. it's my first dslr and it's sooo fine. just really have to be in a really dust-free area when installing the screen protector. arrived on time so i could start getting great pix", "Date": "February 4, 2012"}, {"Title": "Great", "Author": "Unbelievable Movie", "ReviewID": "R2WFPHSLL0FFBJ", "Overall": "5.0", "Content": "Package came as specified! Camera is amazing! I recommend it for others to buy this camera for this seller!It is a great camera to beginners, I open the package and took amazing pictures of sunset, kids! Great product!", "Date": "May 30, 2012"}, {"Title": "Great Starter Camera", "Author": "katybabyjo", "ReviewID": "R2MPC97HCZU2OU", "Overall": "5.0", "Content": "I wanted a camera that I could get action shots of my nephews, and as someone who doesn't really have time to care about the logistics of photo's this is just the ticket. I wanted something under $500 that would take great pics.  This is great, not much more I could ask for.", "Date": "January 27, 2012"}, {"Title": "Super deal!!", "Author": "Anita Smith", "ReviewID": "R1CSZB976OYW5R", "Overall": "5.0", "Content": "This is the best present I could ever give myself.  Great price for the package.  So glad we purchased it.", "Date": "November 18, 2013"}, {"Title": "Grandbaby", "Author": "joseph gaughan", "ReviewID": "R2Q77RCDKQ2QPD", "Overall": "5.0", "Content": "This camera is awesome!  We cannot say enough of how it takes pictures!! Would recommend this to anyone! Thank you.", "Date": "June 7, 2013"}, {"Title": "love it!", "Author": "jamie", "ReviewID": "R3PLPT9L0MAUEW", "Overall": "5.0", "Content": "i love this camera... it my first \"complex\" camera and its pretty easy to use and the bundle tat it came in is wonderful. not a single problem nor complaint, so happy and already taken about 500+ pics since the first of march.", "Date": "March 25, 2013"}, {"Title": "awesome", "Author": "X", "ReviewID": "R3PSTFA7AYHFGE", "Overall": "5.0", "Content": "this package deal was great! its the perfect starter kit for someone moving up from point and shoot cameras who wants to take that next step in photography.  the photos we take with this camera and standard lens are beautiful.  the complete package is just perfect!  we are more than pleased with everything.  thanks to the seller and amazon for providing a great product at a great price!", "Date": "January 17, 2013"}], "ProductInfo": {"Price": "$459.95", "Features": "KIT INCLUDES 10 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\nCanon EOS Rebel T3 Digital SLR Camera Body & EF-S 18-55mm IS II Lens + Spare LP-E10 Battery for Canon +\nTranscend 16GB Class10 SD Card + Vivitar 58mm UV Glass Filter +\nPD Digital SLR Camera Case + Precision Design 57-In. Tripod + LCD Monitor Screen Protectors +\nPD SDHC Memory Card Reader + PD Memory Card Storage Wallet + <10> PD 6pc Complete Cleaning Kit", "Name": "Canon EOS Rebel T3 12.2 MP Digital SLR Camera Body & EF-S 18-55mm IS II Lens with 16GB Card + Battery + Case + Filter + Tripod + Cleaning & Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51hkxOUCnyL._SY300_.jpg", "ProductID": "B004O2CK4O"}}