{"Reviews": [{"Title": "fun camera, wonderful pics, an EXCELLENT point and shoot... love it. just bought a second!", "Author": "Pete Henry", "ReviewID": "R21TUMBRCUWL2W", "Overall": "5.0", "Content": "i LOVE this camera.  it is small, versatile, very easy to use, innovative (the front lcd screen which shows you the live shot, just like the back screen, is a brilliant idea for self portraits and group shots.... just brilliant), and takes simply EXCELLENT amazingly crisp and sharp pictures.  my other point and shoot was a sony with a carl zeiss lens -- now you know those are good lenses, but this samsung beats it hands down.best best feature of this is the front lcd screen which lets you see the picture, just as if you were looking at the back lcd.  so so innovative, so smart, and once you use it you wonder why all cameras don't have this amazing useful bit.picture quality is superb.  even on email mode, this picks up details that my sony had never seen and i couldn't believe it.  seriously... a sony with a zeiss lens you would think is perfect!... but this is better.  very very very happy with this purchase and i simply love this camera.  i bought it in time to go to a wedding, and all the guests were awed with the front lcd also saying, oh my gosh i have to get one of those..... !!! and actually for one relative i hadn't seen in a while at the wedding, she was so in love with the cam to take family shots, i bought her one on the spot as a surprise, from amazon too!my few pet peeves..... 1) this is a great camera, can you at least somehow make it look a little sexier?!!!  it looks like any other camera on the market, but i think is much much better.  basic black is SO SO boring.  i didn't realize it comes in silver!  but some other inventive colors would be nice too... also it seems to be VERY hard to get it in a color here in the u.s., tho i did find some on ebay after i had bought it on amazon.... dayam!!!).  2) battery life seems to be VERY short - about an hour with some active shooting.  an hour shooting at a wedding or family event is NOT a lot of time!  i have since bought backup batteries, and carry them.  3) this has a wonderful lcd on the front, which it says you can turn on by tapping.  but no -- you must paw and pound at the front lcd for it to turn on.  you have to paw at the front lcd to hard to turn it on (if you don't use the actual \"front lcd button\" to turn it on) that i actually thought the camera was broken.  4) though it has a touch-screen lcd on back, it never responds particularly accurate to my finger swipes even though i did calibration, it works much better with the stylus.  when you \"whoosh\" the screen to go to the next screen, it ie goes too fast and goes all the way to the last screen.  even if i whoosh it slowly just trying to move a screen ahead.  then i have to whoosh oh so slowly and carefully back. 5) some of the menus, since they have several screens of options, need to have an indicator that shows there are more screens with options, like the sidebar on a window when you're on a computer that lets you know you can keep scrolling down.but still, right now i wouldn't trade this camera for any other point and shoot on the market.  it is great and i love it..... seriously, you will too.  ;-)**************October 2011 UPDATE....ok, now that i've had this camera a few months i can still say, I LOVE IT!  BUY IT!  ONE OF THE BEST POINT AND SHOOT CAMERAS OUT THERE.......!plus seriously, EVERYONE who sees the front LCD loves it and says omg i must get that!camera still works fine.  i am a little less careful with it than when i first bought it and it was nice and pristine and shiny.  it gets knocked around a bit in my messenger bag, and it does turn on by accident b/c the \"on\" button gets hit.  but it is taking a licking and keeps on ticking.......my only TWO complaints now that i've had it a few months......1) it takes a LONG TIME to get ready for the next shot.  like i think 4 seconds almost?!  when you are trying to shoot at an event, you probably will loose the shot!  of course, the reset is b/c it has to write the info to disk, battery must recharge flash... but seriously.  this is about the slowest point and shoot i've ever used.2) the \"kid shot\" function shows a little cartoon to get an inattentive baby's attention.  BRILLIANT IDEA BUT...... it actually makes the kid look the wrong way in your photo, unless he or she is cross eyed!  OH WELL!  at least they are smiling........still, this is a BRILLIANT camera and i love it.  it is still right now the only point and shoot i'd buy.  oh actually another improvement they could make is to wifi it.  samsung does make wifi cameras, so you can transfer pics without cables and cards.  but this one isn't one of them.  next generation maybe?..... hopefully?.......but seriously.  you'll be very very happy with this.  i love this camera.  pretty sure you will too.  unless you're you know uptight and grouchy.... or something like that......", "Date": "July 28, 2011"}, {"Title": "Just a great camera and I take it with me wherever I go", "Author": "Ron", "ReviewID": "R1VKJBJEHKHZDI", "Overall": "5.0", "Content": "I was planning to purchase a new camera back in December 2010 but did a lot of research and at one point I almost purchased the Samsung ST600 but was going to wait until we received our tax refund.  I continued my research just in case something new came out and sure enough the ST700 was introduced.  I waited until it was available and did some shopping around and found it for $221.00 which I thought was a great price.  I have been using it but it has so many features that it is going to take a while to get through them all.  The size is just great for all the stuff it has on it and friends are amazed at the quality f the photos and so am I.  I also like the interface with my computer using the cable or pulling the card out to insert into the computer.  I live in a wooded area and so we have all sorts of animals since we all left our back yards natural and the deer and other animals are there to take live videos and post them on Facebook.  I hope t a lot of enjoyment from the camera.  I think it was a great buy.Ron", "Date": "May 16, 2011"}, {"Title": "Great Product", "Author": "B. Sebastian", "ReviewID": "R3P0ZY8592Y03V", "Overall": "4.0", "Content": "This product is visually beautiful for a camera and for a point and shoot it has A LOT of features. I really liked the wide arrange of photo and video options you can choose some with a lot of stunning effects and picture quality.There is only a few things i wish could have changed with the product.1. I wish the touchscreen was a little more sensitive. (Overall it isn't THAT bad, but its manageable)2. Be careful not to get any hard dust or debris in the lense because it WILL refuse to close if it gets to clogged up. This camera is definitely not a rugged all terrain camera, but a delicate camera to be carried in a hard shell camera case.3. The front LCD could be a little bit more accurate with what the final picture would look like. I kinda wished the LCD in the front would display the final look of the picture from looking from the back as well.Summary: Other than being an outstanding point and shoot camera with a ton of great features and beautiful stunning pictures, the construction quality of the possible lens malfunction, front LCD inaccuracy, and touchscreen in-sensitivity makes my rating not a full five stars. BUT! The picture quality and its great user friendliness definitely makes up for it and it being a dual screen LCD camera makes it great, innovative, and fun.", "Date": "July 11, 2011"}, {"Title": "Horrible. Returned it right away and regret purchasing in the first place.", "Author": "betweenthepages", "ReviewID": "R2UU2R19V2RASI", "Overall": "1.0", "Content": "I was so excited for this camera. After doing a lot of research and price comparisons I thought I'd found the perfect camera for me--something that I could take self-portraits with with friends and family, but that could also work for scenic photography as well. Boy, was I WRONG. As soon as it arrived I regretted buying this horrible device. Let me make a list to simply the strikes against it:1) The touch screen is IMPOSSIBLE to use. This comes from someone who has an iPhone, tablet, and multiple other touch-screen devices in her home. It is very inconsistent and does not do what you want to it to, ever. You have to try and re-try multiple times to simply move from one picture to the other or to delete a single photo.2) It is SLOW. And I mean, noticeably awkward and stone-age slow. It seems like a full minute (probably more realistically about 15-30 seconds) for the flash to come after you press the button to take a picture. This means not only do you totally miss the moment you're trying to capture, but when trying to take a picture with a friend you stand there smiling like an idiot for about 20 seconds. This is probably the feature of the camera that makes it not only inconvenient but unusable. What's the point in a digital camera if you might as well be using a daguerrotype?3) NO forced flash on. The only option is \"auto flash\" which is NOT acceptable when taking photos outdoors or in dark conditions. It ruined many a photo before I had the sense to return the camera.4) Very loud and noisy. The volume probably could've been turned down but the camera did NOT have a user-friendly interface, and so I could not for the life of me figure out how to shut it up, even though, as I said, I am usually quite tech-savvy.5) The front-LCD screen is horrible quality. This was the main reason I purchased this camera and yet the image was so blurry it was practically useless. Images were fuzzy and the screen was always dark, so you couldn't really even tell what you'd look like in the picture.Those are the bulk of my complaints, but, as you can see, that was QUITE enough to make me send it back disgustedly. This was a wonderful concept for a camera, and I admire the idea behind it greatly, but the execution is just far too poor to make it worth any sort of money, much less the high amount they ask for it. I returned this camera for a refund (thank goodness) and went back to buy a replacement for my old Lumix that had served me so well for 4 years. And I'm very glad I didn't wait too long to do so.", "Date": "July 7, 2012"}, {"Title": "Beware..there are cheats out there", "Author": "SM", "ReviewID": "RT4EDOSZQYRR4", "Overall": "1.0", "Content": "Iam writing this review to caution everyone about this seller..I got carried away by the ratings for this seller and  regret buying from them.A damaged item was shipped to me and now there are excuses to take it back and at different times they change their stand.I had shipped this out of US and at first a return label was generated and upon relaizing it is outside US they got bold ..must have thought that I will not be able to take any actions..Return shipping is like more than 30usd which seller wants me to pay and there is no offer to compensate atleast some % of the cost..it is like penalizing me for buying from themAlso the ratings seems manipulated and iam 200% sure that this cannot be genuine ratings shown there..probably amazon should do an audit to find out whether the ratings are the work of an insider.I had bought this camera and the package arrived on time and there was no damage to the package..upon switching on the camera it was noticed that the front LCD ,which was the main feature,is not working..rather u can see a crack.This was a refurbished product and have learned a lesson...if u pay peanuts(it was 90 usd ) u will get a monkey..tks", "Date": "July 5, 2012"}, {"Title": "Samsung ST700", "Author": "james2", "ReviewID": "R1E8B9FZW3CM2J", "Overall": "1.0", "Content": "Received my new Samsung ST700 yesterday. After fully charged the battery, I started to experimenting with it.  Unfortunatuly, the camera die on me after a couple hours. The lense would not retract. The on/off button does not work. The shutter button does not work. It has less than one day's use! I thought Samsung has better quality control!", "Date": "July 2, 2011"}, {"Title": "Update:  Dead at 18 Months...", "Author": "D. Todd Miller", "ReviewID": "R2LR5D3E4WKOFV", "Overall": "2.0", "Content": "I've owned my Samsung TL700 for about five months.  I've been quite happy with the picture quality in bright light or sunlight; indoors or dim light yields just an \"OK\" picture, without making manual adjustments to the settings.  The camera functions are intuitive, smart phone-like, which I appreciate.  During my two phone calls to customer support, I've received good, efficient responses to my questions/concerns.The biggest issue with this camera is battery life.  Should you store this camera for more or a day or two, the battery will become completely drained.  Customer support stated this was a \"malfunctioning battery,\" and sent me a new battery.  However, I have the same issue with the replacement battery.  I thought, perhaps the case is pressing on the camera, causing it to power up; however, the battery still drains with the camera sitting on a shelf without the case.  This is more of an annoyance than anything; I simply recharge the camera the night before I know I am going to use it.Other than the battery issue, I have no complaints about the camera:  easy to use, light to carry, small enough to fit in my pocket, good photos (especially outdoor pictures).Update (12/24/2012):  The problem with battery drainage was never solved, even with a \"repair\" at the service center (at my expense to ship).  The touchscreen became progressively more difficult to use, seemingly insensitive to the touch.  I am very gentle with my cameras, but the build quality proved to be less-than-stellar over the long haul, with problems developing in the lens mechanism.  Alas, at my dear friend's wedding, the camera stopped working altogether, giving me a blank screen with an error message advising me to contact the service center.  I don't expect electronic products to last forever, but a $200 camera should have more than 18 months (and about 600 shots) worth of life in it.  It's a pity, as the photo quality was usually stellar for a point-and-shoot.I am a bit of a Samsung fanboy:  I own Samsung TVs, Samsung DVD players, a Samsung Galaxy S3 smartphone, and a Samsung laptop.  This camera has been my only bad experience with a Samsung product. However, given my disappointment with Samsung's camera, I replaced it with a Canon SX160.", "Date": "October 24, 2011"}, {"Title": "Super Deal!", "Author": "Gerardo E Escalante Z", "ReviewID": "R1M5H5MPQRFT5W", "Overall": "5.0", "Content": "Hi guys!I bought this Samsung ST700 refurbished for like $70 including shipping... and its awesome!The camera looks and work like brand new. It came super well packed (not in the original box)and just a battery charge away to start using it.I have been reading some of the negative reviews for this camera and it turns out to be from people that just didn't read the instruction. (available for downloading at Samsung's website).  The touch screen is firm and precise and with a very user friendly and intuitive menus layouts. The smart modes for pictures and video are foolproof! just point and shoot.What came in the box? (comparing to the factory new camera)-Camera.-USB Cable and AC adapter.-Battery.What didn't came in the box?-Strap,-Touch pen,-Cleaner,-User manual CD-ROM,-Quick start manual.I was expecting this because on the seller description for \"refurbished\" items, they warn about some minor accessories may be missing. So no problem there.It was a super good deal. The seller (tech for Less) deliver it extremely fast and in unbeatable conditions, but they didn't answer any of my emails.Overall experience: EXCELLENT.>>UPDATE<<In case you are going to be shooting continues video, the battery is going to die on you in about 30 to 40 minutes. Other than that this camera is awesome.", "Date": "August 22, 2012"}, {"Title": "Camera Review", "Author": "Review", "ReviewID": "RCQQ6OF0DIDAP", "Overall": "4.0", "Content": "The dual screen for self photos works great.  However, it does take a long time to reset to take another picture.  Overall, fairly happy with this product.", "Date": "December 29, 2011"}, {"Title": "Great camera", "Author": "Roberto Benejam \"- R. Benejam\"", "ReviewID": "R39OGO7IFGKHDX", "Overall": "5.0", "Content": "I bought this camera for my g/f and she loved it! I love cameras and have better ones, but as I told my friends, this is a (not in a bad way) \"girls camera\"..! One to have fun with and with double screen, so she can take pictures that she likes...Quality is not the best, but take good pictures, the back is touchscreen, so everything operates that way. The front LCD can be turned off when not using it, so battery will last longer that way.One final advice: BUY A MEMORY CARD!!! This camera only have 30 MB storage capacity, that means just 2 pictures..! It uses a MicroSDHC memory card, so be sure to get one when you buy the camera!Well, I definitely recommend it... You won't regret it!", "Date": "November 21, 2011"}, {"Title": "Just awful", "Author": "J. Tran", "ReviewID": "R8YG1TLB9SUE2", "Overall": "1.0", "Content": "I just finished processing my return for this item. After a day of use, which was more like testing out the camera with random pics, the camera just gave out. When turned on, it just shows a constant \"Processing\" message on the LCD and there's nothing I can do with it. I thought maybe I'd give it a few days, pull out the battery and let it rest but nothing resolved the issue.I would've requested a replacement but I'm wary as to whether the replacement would give out on me as well. It's unfortunate because the dual LCD was a really nice feature. I guess I'll have to purchase something else.", "Date": "June 24, 2011"}, {"Title": "Samsung ST700 camera review", "Author": "Debbie", "ReviewID": "R1CUU9PS7299ZC", "Overall": "1.0", "Content": "This camera takes ten to fifteen seconds after pressing the shot buttonto take the picture  I am very frustrated because I purchased the camerato take pictures of my cats, and this long wait time after pressing thebutton has made the camera incompatible with the purpose for whichI purchased the camera.  Also, the fact that the camera only usesrechargable batteries makes it frustrating because after putting a newbattery in, the camera needs to charge before use. The camera's ideaof a faster wait time before taking the picture after pressing the shotbutton is to wait ten seconds instead of fifteen seconds. By that time,my shots have been lost.", "Date": "June 7, 2013"}, {"Title": "Touchscreen is behind times", "Author": "Ryan", "ReviewID": "R3MZSFBIQUV7SD", "Overall": "1.0", "Content": "In a world of iPhones and tablets this touchscreen just doesn't cut it. Extremely unresponsive. Good pictures but way slow. Get the one without the touchscreen.", "Date": "January 11, 2013"}, {"Title": "Beauty mode is awesome, but the rest, not so much", "Author": "KinAZ \"KinAZ\"", "ReviewID": "RKBEP6EO1YVT", "Overall": "3.0", "Content": "I'll be honest, I bought this camera for the \"beauty mode\" feature.  My friends have this camera and our photos always looks flawless.  What woman doesn't want a flawless photo?  Before this camera I had a Canon Powershot ELPH 100HS 12 MP, which I loved, but it lacked this feature and took too long to take photos.  First off, I hate the all touch screen feature of the Samsung.  It's finicky and fingerprints are inevitable.  Also, I consider myself pretty tech savvy and I don't feel that this camera is very user friendly.  I continually have to refer to the user's manual, which is annoying.  I guess it serves its purpose, but I would be happier if it was more like my old camera.  Lesson learned.", "Date": "September 27, 2012"}, {"Title": "Great Camera", "Author": "antn", "ReviewID": "R24KX9BJON9FU1", "Overall": "5.0", "Content": "so far I'm very happy I purchased this camera. Love the fact you can take a picture of yourself with the front monitor and the pictures even after going into full zoom turn out so clear.", "Date": "August 6, 2012"}, {"Title": "Amazing features, could be more sensitive.", "Author": "Jano", "ReviewID": "R3FMT7APZNA05J", "Overall": "5.0", "Content": "This camera is packed with tons of amazing features, you have the option to select which size megapixel you prefer, from 1 MP to the full 16.1 MP. The main screen could be more sensitive to the touch even after calibration. I highly recommend this camera for individuals with children since it offers a feature to attract the attention of the child before the picture is taken.", "Date": "April 2, 2012"}, {"Title": "Good Camera!", "Author": "Henry Infante", "ReviewID": "R32HMTC94NT2WK", "Overall": "4.0", "Content": "I love this camera... it works good! all my friends like the screen in the front when I take pictures with them... kids love the little clown and the dancing penguin video and it always is making them smile... on the other hand, the on/off button is pushing itself all the time while it's in the camera bag.  but bottom line, it was a good option for me!.", "Date": "March 31, 2012"}, {"Title": "Excellent, comfortable with the product,", "Author": "Jose", "ReviewID": "R3LQHHDYTS7E3B", "Overall": "5.0", "Content": "excellent, comfortable with the product, the product works wonderfully and the management of selling and buying was very goodno bad comments", "Date": "November 18, 2011"}, {"Title": "love it!!!", "Author": "0413", "ReviewID": "R2YWQVT6XQFKI5", "Overall": "4.0", "Content": "I love this camera its awesome!! The one thing I dont like is how you look thru all the pictures I havent seen just a button to go from one to the other... You have to use your finger or that pen deal that they give you. maybe there is a way you can go thru the pictures but I havent found it. Other than that I love the camera!!", "Date": "June 27, 2011"}, {"Title": "Say Cheese!", "Author": "Rhonda Garcia", "ReviewID": "R1J0VBOZ9TWE9K", "Overall": "5.0", "Content": "The picture quality is great. The front LCD is a bonus. I'm not that great at taking photos of me and my son alone. There is a small amount of delay between pics but not that much.", "Date": "October 10, 2013"}, {"Title": "No longer using, had for 1 year", "Author": "JD", "ReviewID": "RYTUH79RKTDVY", "Overall": "2.0", "Content": "So nothing was really wrong with this, it just wasn't very user friendly.  My wife just bought a newer camera that was less and is far more advanced.  I was lured in by the picture on both sides, and it was a novelty that was enjoyed the first two or three times, but really not that useful.", "Date": "August 21, 2013"}, {"Title": "good", "Author": "fabiola arias baez", "ReviewID": "R2CW4HDSYASU7W", "Overall": "4.0", "Content": "so far, all I've bought cameras have gone pretty good, and as I love. and i buy it for a friend", "Date": "July 3, 2013"}, {"Title": "AMAZING", "Author": "Carlie Smith", "ReviewID": "R122BXT1ROVYIR", "Overall": "5.0", "Content": "This camera is amazing. I love photography and got this camera for my birthday and I fell in love with it SO fast. It's fantastic!!!!", "Date": "February 19, 2013"}, {"Title": "Zoom shutter got stuck", "Author": "APARAJIT MALLI JAWAHUR BAP", "ReviewID": "R1UZ8D4USF268E", "Overall": "3.0", "Content": "I had high expectations for this camera. But, in just 3 weeks, I started facing issues.While switching on, zoom got stuck but can be manually pulled out. But, while switching off, zoom gets stuck again with the shutter half open-half closed. I felt really bad....Now, I have service it to get it repaired..", "Date": "January 31, 2013"}, {"Title": "Christmas gift for son-in-law.", "Author": "O'Henry \"brandy\"", "ReviewID": "R2NSRZQUUPUZKG", "Overall": "5.0", "Content": "This camera was a Christmas gift for our son-in-law. He enjoys taking photos and is amazed at the quality of the prints.", "Date": "January 29, 2013"}, {"Title": "excellent", "Author": "Edwin Gamboa", "ReviewID": "R1MK4LFHXJXCMV", "Overall": "5.0", "Content": "It's great with my perspective beyondI like very simple functions qI do not like the price but worth itTo all my friends and family", "Date": "January 24, 2013"}, {"Title": "great", "Author": "Jeffery R. Robinson", "ReviewID": "RJR7Z5FK34Q99", "Overall": "5.0", "Content": "very nice , my son is very happy with this , keep up the good work ! i will keep shopping here", "Date": "January 22, 2013"}, {"Title": "excelente", "Author": "valentin velasquez", "ReviewID": "RQTQKN1DMJ6G7", "Overall": "5.0", "Content": "cámara de muy buena calidad, alta resolución, moderna, versátil, me gusta mucho, tiene muchas configuraciones para cada ocasión en fin una cámara que vale la pena tener.", "Date": "January 18, 2013"}, {"Title": "Great little camera", "Author": "Paul", "ReviewID": "RHK2BBIFYYJJN", "Overall": "5.0", "Content": "This is a great point and shoot camera.  The front display is a wonderful feature as well, it makes taking self-portraits very easy.", "Date": "January 12, 2013"}, {"Title": "I love it. Works fine.", "Author": "cust0701", "ReviewID": "RCWE17UDEYCTM", "Overall": "5.0", "Content": "I bought this camera about 3 months before and it works perfectly. The only problem is that it has a short battery so I recommend to buy a second one. Other than that, I love the quality of the pics and the camera itself. :)", "Date": "January 8, 2013"}, {"Title": "Muy Bueno", "Author": "Roberth Reyes \"Rereyes\"", "ReviewID": "R12TEAHJZ7SL92", "Overall": "5.0", "Content": "Excelente producto y de muy buena calidad. se los recomiendo con confianza. El vendedor es muy atento y resposable. se los recomiendo.", "Date": "December 27, 2012"}, {"Title": "This camera is not very good at night video", "Author": "ramon", "ReviewID": "RYU8D6ZXX3MY6", "Overall": "4.0", "Content": "is good for everything but night videoPhoto quality is excellent and the front screen gives a beautiful look, I take away a star for the poor quality of the video night, even if it's a camera, not a camcorder", "Date": "December 26, 2012"}, {"Title": "product does not work well", "Author": "rigoberto charaima", "ReviewID": "R2IQW4TGHMWFH0", "Overall": "2.0", "Content": "turned it on for the first time and fails zoom does not move and the camera says you have to take for service.  I solve this problem?", "Date": "December 5, 2012"}, {"Title": "Digital camera for non-professional", "Author": "DitchRider", "ReviewID": "R1GSHZJ84ODJCI", "Overall": "5.0", "Content": "I think this is a great camera.  I'm not a pro by any means.  I just wanted a camera that had the dual LED screens for self portraits, family portraits and that second screen actually has apps that grab kids attention to keep them still and keep them smiling!!!  Its a great camera!  Easy to transfer pics with a microSD to USB adapter.  Yeah, it doesn't have wifi but it does have some cool features that I didn't expect.  I'm really happy with this camera.  I bought extra rechargeable batteries, larger miniSD memory card, screen protectors and a case.  The biggest problem I have... is to remember to grab it!!! I'm sooo used to using my cell phone.  Anyway, when it comes time to upgrade digital camera, the other feature I'd like to have is wifi for quick/easy upload to FB or wifi printer.  But don't let that be a deal killer.  Its a good camera.", "Date": "April 28, 2012"}, {"Title": "Excellent!", "Author": "BC", "ReviewID": "R1EGPGG0JN8QNR", "Overall": "5.0", "Content": "The design was sleak and functionality was fancy.Especially self shot function was the best.You can see yourself where you are in the scene.Just be careful not to stare at the screen when you click the camera.Once you are sure of your pose in the shot, turn your eyes to camera lenz quickly before taking a picture.of course, if you want yourself to look at the different angle, then you don't have to look at the lenz.I took tons of my picture myself with this camera and couldn't have better pictures before whether taken by other people or by me.This camera also has lots of other functions you will like.Play around and you won't regret.This camera is my main camera and will be for a long time.Completely satisfied.", "Date": "December 8, 2011"}, {"Title": "samsung camera review", "Author": "Carol A. Sands", "ReviewID": "R2PZIYZYR9UMSJ", "Overall": "5.0", "Content": "I'm very satisfied with this camera! I am still finding out more of the capabilities. Have had it for 5 months, but only use it occasionally due to my busy schedule. So, I am really a beginner. Light weight and easy to carry. I appreciate the dual LCD screens on front and back. However, I don't really have a good traveling case to go with it, that is small, yet can carry the accessories. Love the convertible cable that comes with it. Just adding an adapter that converts the USB cable to a wall charger. Good job!", "Date": "November 12, 2011"}, {"Title": "Loving this camera", "Author": "Samantha L. Woolery \"Addicted to vamp romance\"", "ReviewID": "RBNH1SILEIH0Y", "Overall": "5.0", "Content": "Great camera, a little sophisticated but easy to figure out.  Love the rechargeable battery and the beauty shot feature.  Upload is super easy too!", "Date": "October 9, 2011"}, {"Title": "Awesome Camera", "Author": "Adry", "ReviewID": "R2LJCFO542JGMD", "Overall": "5.0", "Content": "This camera have good pictures and great versatility, i just love all the functions it make it easier, i can used everywhere and bring it with me all the time", "Date": "October 6, 2011"}, {"Title": "Camera Since Christmas", "Author": "Karinna Quengal", "ReviewID": "R20WXTC6LYU9MX", "Overall": "4.0", "Content": "We've been using this camera since Christmas. My husband bought it for me as a gift knowing I wanted something a little higher quality to take pics with the kids and during school events. It's very simple to use and shots are great, print well, and I like the overall color.", "Date": "August 23, 2011"}, {"Title": "front screen camera is a hit", "Author": "Robert J. Erskine Jr.", "ReviewID": "R1FRX40CZ9S99B", "Overall": "5.0", "Content": "My 17 year old loves this camera! Easy to use, download, high quality shots and good touch screen make me very happy with the purchase. If you turn the camera on you to take pictures then this is the one to buy.", "Date": "June 25, 2011"}, {"Title": "Samsung EC-ST700 Digital Camera", "Author": "Luis D. Martinez", "ReviewID": "R14FI2T5DW4W8B", "Overall": "1.0", "Content": "I purchased this camera as a birthday gift for my wife. It was supposed to be the latest and greatest in the market with dual view technology. With just a few pictures taken, not even a week after having received it, the camera stopped working. The battery wouldn't charge, the camera would not turn on, and if it turned on it would froze up and get stuck with the lens out. Probably it was just bad luck that I got a deffective product and it is not a reflect of the product as overall, but I will never know unless I had another one to compare. I contacted the customer service and they didn't have a replacement camera so I'm returning the item and requesting a refund.", "Date": "May 14, 2011"}, {"Title": "Far price", "Author": "Joey.ro20", "ReviewID": "RFIOL47GUY6RQ", "Overall": "4.0", "Content": "Battery lifes great two screens ones touch some great features hdmi capable my gf dif enjoyed it for christmas.  Cost me 220", "Date": "December 18, 2011"}, {"Title": "Great camera!", "Author": "Patdrin", "ReviewID": "R6BAKX8B0Q0S0", "Overall": "5.0", "Content": "I love this camera. It is easy to use - even the touch screen. I am not a picture fan but this camera is changing me.", "Date": "June 28, 2011"}, {"Title": "I like.", "Author": "Luis", "ReviewID": "RCLW48DW8OIY5", "Overall": "5.0", "Content": "I like.The camera is great, excellent technology I like how compact it is, the battery life is very long, the only thing I noticed is that it has a delay in orders on the digital display, but the update is easily correctable. The seller fulfilled as promised and delivered on the agreed date. Definitely give it five stars.", "Date": "December 28, 2012"}, {"Title": "decent camera", "Author": "an a", "ReviewID": "R23YSER985WTY5", "Overall": "3.0", "Content": "I love the children feature but it did not last long with my son he got bored with it after a month. The pictures did not highlight the background it almost blacks out everything but the subject, im not sure if this can be adjusted. overall it takes pretty decent pictures", "Date": "May 23, 2012"}, {"Title": "SMALL PROBLEUMS, NOT DESIGNED WELL", "Author": "B.  NASKI \"Bamboo\"", "ReviewID": "R7ZCOCM9KA1F2", "Overall": "2.0", "Content": "I AM USED TO THE STURDY SONY CYBERSHOTS,  PUT IN THE POCKET,  ECT,  TOUGH,WAS INTERESTED IN THE DUAL VIEW,  SO WENT WITH THIS 700,  THE ON OFF BUTTON IS EASY TO HIT,  AND I FIND IT TURNED ON BY ACCIDENT ALL THE TIME WHEN I CARRY IT,  WENT FROM POCKET TO A STRAP AROUND MY NECK,  I PUT UP WITH THIS FOR A COUPLE OF WEEKS, AND NOW THE LENS SHIELD INTERMITTANTLY DOSENT OPEN, AND NOW ONLY PARTIALLY CLOSED,  I LIKE THE QUALITY OF THE SHOTS AND THE CAMERAS OPERATION,  I JUST WANTED TO GET IT REPAIRED OR EXCHANGED, BUT ENDED UP AFTER ANSWERING QUESTIONS ,  THE AUTOMATIC PART OF AMAZON,JUST SAID RETURN FOR REFUND,  WILL TRY TO REACH A HUMAN!ROB", "Date": "June 26, 2011"}, {"Title": "Absolute Crap!!", "Author": "MissChristiane", "ReviewID": "R1JSEA3EQVNKDD", "Overall": "1.0", "Content": "I literally received this camera 4 hours ago and have already packaged it up to return it. Firstly, the construction of this camera is poor and cheap. It feels like it will break with just one drop! The picture quality is just unacceptable, no matter what mode I put it in and regardless of the 16 MP. Having the camera zoomed in made the quality worse. The touch screen is impossible to work with and not nearly sensitive enough! Of coarse, it's decent when you use the stylus but really... who on earth is going to use a stylus for a camera? I am not one of those people! The front LCD screen is a great idea, but you cannot just \"tap it\" to turn it on, I had to practically hit it for it to respond! The flash makes all faces look washed out and gives off a Very poor color! I even tried taking some pictures outside in hopes that it would do some justice there but no, the picture quality is just as terrible and does not take pictures nearly fast enough for me. I went through Every setting possible and sure, some of the features are cool. But overall this camera is by far one of the worst point and shoot cameras I've ever used! Save your money and the headache of dealing with a return.", "Date": "July 27, 2011"}, {"Title": "exelente", "Author": "amvir", "ReviewID": "R2IE8AKBU0KKRD", "Overall": "5.0", "Content": "muy bue  producto , reconmedable al 100 x 100  las imagenes muy bellas la resolucion , tenia mis dudas respecto a esta vercion pero de verdad q en  el,poco tiempo q la e probado, me  siento muy contento !", "Date": "December 7, 2011"}], "ProductInfo": {"Price": "$279.99", "Features": "3.0 Touch LCD PLUS 1.5 Dual view LCD\n16 Megapixel\n1.8\" Dual LCD for perfect portrait shot\n3.0\" wide Touch LCD for Easy of use\n720 HD Movie", "Name": "Samsung EC-ST700 Digital Camera with 16 MP, 5x Optical Zoom and Touchscreen (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qoOAGmJnL._SX300_.jpg", "ProductID": "B004L3R2EY"}}