{"Reviews": [{"Title": "Good card, one really annoying piece of software", "Author": "Wireless Lou \"cellular consigliere\"", "ReviewID": "R4I6USJ3ZZHUV", "Overall": "2.0", "Content": "I purchased this card because it offered what I was looking for: an inexpensive DVR solution for my home.  The card installed fine.  The problems begin after installing the software.When I ran the Eyeonet software, it automatically changed the resolution to 1024x768. It's not documented here on Amazon or in the .pdf manual that there's no way to revert back to a higer resolution while the software is running.My understanding of having a PC-based DVR system was that it could run in the background while I perform other tasks; apparently Ameta International (the software vendor) has other ideas; they either want you to just buy their DVR or a second PC to run as a stand-alone solution.This one issue is the reason I've given this product such a low star rating; it basically requires me to buy a second PC, or be forced to start/stop using the DVR while I'm performing other tasks (or playing games) on my PC.  There's no reason this software can't run in a window like a normal application; it actually uses very few resources and could easily be plugging away in the background on any reasonably up-to-date specced PC.", "Date": "July 25, 2011"}, {"Title": "Fun to play around with", "Author": "Nico", "ReviewID": "R3VXNAAWHEEIRU", "Overall": "4.0", "Content": "The card works as advertised.You need to be running Windows XP or Linux, the screen resolution changes to 1024 x 768 when using the software.In general, I would say the card was worth $30.I contacted Videosecu by phone because I had some questions on the card, they tried hard to answer my questions regarding the extra connections on the card. The bottom line was the additional connections are not available for general use, it is for alarm connections that require a pigtail connector that is not available, neither is the pin out for me to make my own.Again, this card and software is worth the $30 + shipping to play around with!", "Date": "December 28, 2011"}, {"Title": "Overall great value, a bit technical", "Author": "Mark", "ReviewID": "R1JZDVBY55M241", "Overall": "5.0", "Content": "Purchased this along with 2 cameras for a DVR project.  Card works fine, just make sure you have the required Intel based PC and Windows XP.  The software it comes with works fine.  The manual it comes with isn't much help (stopped trying to understand it after a few pages).  Some settings need a little technical knowledge (such as frame rate, video compression, and network settings).  I am now able to login to the DVR from my smartphone and check up on the house in real time.  Has a ton of settings for motion detection and alarms and alerts (can email you, though I haven't set this up yet).  Overall, not a bad value for under $30.", "Date": "May 31, 2012"}, {"Title": "Total Junk. Then you get Ripped Off when you return it.", "Author": "Badfishon", "ReviewID": "R318EPLHVI2BG1", "Overall": "1.0", "Content": "This total piece of junk repeatedly crashed making it completely useless. After four un-install and re-install attempts yielded the same result I figured it was either the card or the drivers. Went to VideoSecu's site for a software or, moreover a fresh driver download to no avail. In fact, you can't even find this DVR card in their product lineup, most likely discontinued because it's total scrap.Enter the RIP OFF stage of this less than pleasant transaction.I get an RMA from Amazon or warehouse seller, through Amazon I should say. So I send it back, at my own expense, couple of days later I get a refund notice from Amazon. The refund is minus the original shipping fee and minus 15% of the purchase price. It is later explained to me that they do not refund shipping, not even when they ship you a defective product, and they will charge you a 15% re-stocking fee, ya know.. to re-stock said defective product back into their inventory so they can sell it to another victim whose just trying to get things done while staying within their budget.Then the icing on the cake. They try to blame my PC for not meeting system requirements, and or some kind of \"installation problem\"I assured them my three year old, totally Intel based, custom built Mega Gamer would have no problem running this card or any other PCI based anything for that matter.Bottom line, if you serous about video security spend the money on a GeoVision system from a reputable dealer, unlike these warehouse seller crooks, backed by Amazon.It's not a lot of money but on principle alone, this is the last purchase I will be making on Amazon.com", "Date": "September 28, 2011"}, {"Title": "Very pleased", "Author": "Chris", "ReviewID": "R29W9OGLZDB0BM", "Overall": "5.0", "Content": "I have had this product for about a month now and am very pleased. It has some very nice options and I didn't find it too difficult to learn them. I am using a 32GB flash drive ($19.00) to store the recorded videos and it is more than enough with four cameras set on motion detection. You can also set specific areas (zones) for the motion detection to ignore and record on.It also has an RCA video out on the back of the card to hook up to a TV in another room. It also has some editing options when reviewing recorded video such as zoom, blur, and sharp corrections and screen shot. I am running windows XP with Intel system. My only problem is setting up the remote viewing network. It logs me in from the phone but logs me back out after about 20 seconds. If anyone has any advice to help me resolve this i would much appreciate it.", "Date": "October 2, 2012"}, {"Title": "Works as stated.", "Author": "Winston Smith", "ReviewID": "R2T2F4XUCWRZJ6", "Overall": "4.0", "Content": "I bought this card to replace a rigged system using Contacam and a quad splitter. I have an old Dimension XP unit to use as a server. I had thought BNC went out with Novell networks, but BNC is easy to work with. I found out when I got the system up, security camera setups are limited to camera resolution. Want beautiful screen shots, buy hi resolution cameras. Mine are so so. I had to reformat the hard drive to FAT32, and then use a separate partition for storage. Don't forget to buy your BNC conversion fittings. A thumb drive can be used for storage too, but I opted for the hard drive. I may still use my quad, and plug it into this card, and then have 7 cameras. This software takes some getting used to, but it has what you need. I will be glad when SS hard drives drop in price. Keep your powder dry.", "Date": "January 29, 2013"}, {"Title": "awful", "Author": "Akwasi Akwaboah", "ReviewID": "R2E1JQQDQCTBD7", "Overall": "1.0", "Content": "I received this dvr card on 01/08/2013 in the afternoon but this dvr card is just a peace of garbage, i emailed the seller in regards to defective card i received from them. They refused to send me return information \"address\" they kept telling me to follow the instruction on the side of the jumper. They also told me the jumper has 4 pins switch but it came with three. They're just repoff. Please don't even bother buying from these guys because if you buy defective item  this seller won't replace it or refund your money. They're are really bad.", "Date": "January 9, 2013"}, {"Title": "Not durable.", "Author": "stugacz \"stugacz\"", "ReviewID": "R40EZWC8ZUK2F", "Overall": "1.0", "Content": "It lasted 13 months then died. Contacted vendor and was told the warranty is only 90 days too bad. I would not recommend this product for a the long term. A year is about the best you can expect from it.", "Date": "August 3, 2012"}, {"Title": "A bear to set up", "Author": "G. Jackson", "ReviewID": "ROZ62JOJLNQM", "Overall": "3.0", "Content": "I agree that this is a fun card to play with for $30. Works as described for the most part. Took me 4 days on and off to get it to work with my Win XP setup . Had to try many different combinations of manual installs and uninstalls etc to get whatever correct combination ended up working. The readme file says to do it one way and another setup file says to do it the opposite way. Rather contradictory right out of the box. I believe you would have to be a very experienced computer person based on the problems I had. Once  its up and running is OK. Automatically changing screen resolutions is a bit annoying.", "Date": "May 25, 2012"}, {"Title": "Professional level, Perfect", "Author": "Kenneth", "ReviewID": "RLZ6E0AO9F00M", "Overall": "5.0", "Content": "We have the unit installed for only a week, the hardware/software install went smoothly, the configuration settings of the software options seem endless -- a testament to the full featured capabilities of this product. This product is more than adequate for any home or business use. I am very satisfied with this product.", "Date": "October 2, 2011"}, {"Title": "Great product!  Great performance!", "Author": "David J. Murphy", "ReviewID": "RQCOJTA1KSUOV", "Overall": "5.0", "Content": "Have had this card installed in my computer for well over two months and running 24/7.  Takes up little or no CPU resources, or none that I'm aware of.  Worked right out of the box!  Easy installation and set-up.  Just make sure to check the card BEFORE you complain that it doesn't work and insure the #1 switch is in the up (on position)  Instructions, for a change, are in readable and understandable English... not Chinese/English (Chinglish)  Kudo's to VideoSecu for this one!", "Date": "April 29, 2011"}, {"Title": "Does not work", "Author": "tired101", "ReviewID": "R8XLDMHTQBJPA", "Overall": "1.0", "Content": "Tried this card in 4 different computers. It would not work in any of the computers. Device manager did see a dvr card. But software could not see the card to start the program. Does not work", "Date": "January 31, 2011"}, {"Title": "its okay would not use in a serious application.", "Author": "Erin D. Murphy \"Erin\"", "ReviewID": "R32X5GK5UWGFFA", "Overall": "3.0", "Content": "I put it in an older system, still in spec for the unit and computer crashes when I go to high quality recording, outside of that its a good unit.  I did catch those bugger who were braking into car in the neighborhood.", "Date": "November 27, 2013"}, {"Title": "Major let down", "Author": "JOHN DOE", "ReviewID": "R1HCXBSH8JV56D", "Overall": "1.0", "Content": "I gave it one star because it don't work at all. The install disk it came with is all scratched up like its been used and it wont even read it. It didn't come with the manual that read about and i'm VERY sure this was already sold to someone else and returned multiple times.  How is something like this even Legal??These people really ripped me off good. It don't seem like Amazon is coming down on these people and they are getting away with theft. I also called the people that i bought it from and they dont answer my calls. I am very upset and i don't rec amend anyone buying ANYTHING from these people. This little town is south of me and im on the road ALOT. I WILL pay them a visit soon enough and it WILL be resolved one way or another and i will re-post to let everyone know how it went.", "Date": "May 25, 2013"}, {"Title": "VideoSecu 4 Channel Pci Card", "Author": "Charles W. McLamara", "ReviewID": "R29PA3PMFPIMIS", "Overall": "5.0", "Content": "It does the Job.Installation is as easy as putting the Software in the optical drive and sending it to a bare drive of it's own for a clean install and format.Hook up all of your cables,and your cameras and your not missing a thing.Thank You", "Date": "February 15, 2013"}, {"Title": "Pig in a poke", "Author": "Alex Humble", "ReviewID": "RW0OAOAAFR5AS", "Overall": "1.0", "Content": "How can one buy this product when resolution, the most important parameter of a security system is not mentioned? Absurd!", "Date": "February 10, 2013"}, {"Title": "Works, but you had better be a computer whiz", "Author": "ComputRFixer", "ReviewID": "R2234152N2XE9X", "Overall": "3.0", "Content": "It took a very specific Intel based chip set in the computer to make it work, but it does work and work well. I bought two cards, and the dip switches are not addressed in the instructions, but it is imprinted right on the cards. Dip switches have to be set properly, especially when using two or more cards. I have a wonderful computer guy who worked all the details out for me. He has access to many computers, processors, motherboards, and he spent a few days working ti out for me (Even though I am a computer person myself, I do this every day, and he is more of a hardware expert. so it was worth it for me not to hassle with it. Now I have a nice 8 camera system. The software will create a drive within a drive for storage too. I used a 1TB drive.", "Date": "January 21, 2013"}, {"Title": "Card works great however the software leaves a lot to be desired.", "Author": "DrDave", "ReviewID": "R2D3E5IUN484N", "Overall": "3.0", "Content": "Expect a long learning curve when configuring the software. It isn't very explanitory. Explore the installation disk before you start and install the driver first. Then install the software. For some reason, the initial install screen neglects to do this.", "Date": "December 7, 2012"}, {"Title": "U Get Moneys Worth", "Author": "Stephen Ricket", "ReviewID": "R1VFRTWGUGNHGD", "Overall": "2.0", "Content": "The software is \"Eyeonet\" that comes with the VideoSecU card.  Turn off your screen savers because it will conflict and cause the cameras to go black (at least on crt - don't know if they also blacked in motion recorded).  Minimizing the screen the software will not let you log back in or maximize and it will not permit keeping specific (4 channel) view.  But you get what you pay for.  For those on a budget this can do the job.", "Date": "November 8, 2012"}, {"Title": "Vary good card and software for the price", "Author": "StormTec2.0", "ReviewID": "RIIZC2CTAELJN", "Overall": "5.0", "Content": "I must say I was a little scared buying such a cheap card but this one does everything I need like digital recording, Motion detection, 4 channels and so on. The software is great and easy to use. Id recommend using a stand alone computer just for surveillance cause that's what I did and that's truly how it should be done to get 24/7 Proformance. I also use a separate 80GB Hard Drive for just the recording but im doing it professional style to get the most out of it. I really recommend this card to a person who is or knows someone at least advanced in computer tech. Dont be a baby if your using it on a computer full of crap and data and/or you use it for gaming. I have my custom gaming high end computer and my CCTV Dell computer.", "Date": "November 25, 2011"}, {"Title": "Works well, great software", "Author": "Ogden", "ReviewID": "R3E1JCA68EM6O0", "Overall": "5.0", "Content": "The software is top-notch and easy to use, lots of features in included software such as Motion detection alarms. The picture is clear and crisp, not overly sharp and the product works without fault. I recommend this product.", "Date": "September 27, 2011"}, {"Title": "Great video capture and more", "Author": "Linda S. Wright \"Ronald P Wright\"", "ReviewID": "R420WUZLMHM8Y", "Overall": "5.0", "Content": "Excellent equipment and software to set up a surveillance system in your home or small business. You do have to have some experience in working at installing computer boards and related software. While the cd manual for the  excellent software that comes with the PCI card is very comprehensive, there is NO documentation for the PCI board at all. I would like to know what the switches and extra pin outs on the board are used for. Although the board and software works perfectly the only problem that I have is getting the combined 4 camera screen to show properly. I don't really use this screen and everything else picture quality, recording, playback, motion and object detection are great. Even with my very low end cameras the picture is great. With the software included at this price it is a major bargain. If anyone out there has the pin out for the board, please let me know.", "Date": "July 16, 2011"}, {"Title": "this item sucks big time", "Author": "WOLF", "ReviewID": "R2T8MZ54S0F84K", "Overall": "1.0", "Content": "i have a requiements that is asked forthe picture quility is blurrie at best.it's hard to recall a recorded screen.you have to hv a separate hdd or partition your c:hdd.you have little control over the dvr.there's no help online or at the place of purchase.i can't snd it back as its not the product as im told.the pictures you see on the items ad page has to be a fake.so ending take this to heart don't buy the VideoSecu 4 Channel DVR CCTV Security Surveillance System PCI Video Capture Card C53", "Date": "July 31, 2011"}, {"Title": "REVIEW ALL COMPUTER SPECS/REQUIREMENTS FIRST!!!!", "Author": "originalindividual", "ReviewID": "R3SVIZ75GKJZYF", "Overall": "1.0", "Content": "VideoSecu 4 Channel PCI DVR Card for CCTV Home Security Surveillance System C53 DOES AND WILL NOT WORK ON YOUR COMPUTER IF YOU DO NOT MAKE ABSOLUTELY SURE THAT ALL.....ALLLLLLLLLL SPECIFICATIONS/REQUIREMENTS ARE NOT MET...............1 STAR FOR ME", "Date": "September 14, 2012"}], "ProductInfo": {"Price": "$124.95", "Features": "4 Channel CCTV Security Surveillance System DVR PCI Video Capture Card\nRecording and display rate 30 FPS\nRecord Mode: Motion/Schedule/Manual\nFull remote capabilities (PSTN, ISDN & LAN network)\nInput Connector: BNC", "Name": "VideoSecu 4 Channel PCI DVR Card for CCTV Home Security Surveillance System C53", "ImgURL": "http://ecx.images-amazon.com/images/I/61HNBb%2BLm7L._SX300_.jpg", "ProductID": "B0044R75JE"}}