{"Reviews": [{"Title": "Not perfect, but definitely worth 5 stars", "Author": "Billy", "ReviewID": "RI8A8Y2YPG7PN", "Overall": "5.0", "Content": "I just spent 2.5 weeks traveling Ireland with this camera so I've had plenty of time to get my hands dirty. I can honestly say this camera is amazing! It's small and lightweight but still packs a 30x zoom and takes great photo and excellent video. I see tons of reviews already with lots of detail so let me try to convey quickly my impressions of this camera after some hands on time.Ergonomics:Camera is just about perfectly sized and shaped in my book. A nice big hand grip on the right with a rubberized feel gives it a professional, well made feel and makes it easy to handle. The rest of the camera is kind of a brushed matte black which also gives it a very professional look. Handling for photos is great as well as it's large enough to make it easy to take two handed photos with the left hand balancing the front of the camera and lens ring and the right on the hand grip. This gives great control over the camera while snapping shots. The focus ring on the lens is a great for fine tuning your zoom to perfectly compose that distant subject. I was surprised how much I used the lens ring instead of the zoom in/out toggle next to the shutter.Display/Screen:Brilliant high resolution display so images, menus and video are all clear and crisp on screen. The screen itself seems pretty fragile so I'm considering adding a little protective cover to the screen. I have a hx9v as well and the screen is similar if not the same and my hx9v got a deep scratch in it from just a day of carrying in my pocket. The articulating feature is surprisingly useful. I didn't think I'd need or want this but the ability to hold the camera up high or down low and tilt the display so you can still view the camera is a handy feature.Video:top notch video, 1080p video with something like 60 frames per second, how can you beat it! Video is very clear and smooth with little to no artifacting or blurring. You can even snap still images (i think they're 3-5 MP) while taking your video. I don't think another camera in it's class can compete with this camera from a video standpoint. The AVCHD format is something I'm still learning to work with though and I find it's not the easiest to work with on a Mac. There don't seem to be many readily available video players for AVCHD and the way the movies are stored isn't the most straight forward way to facilitate browsing through your movies. Basically, things get stored in a not so simple folder structure and you have to know what you're looking for to find your movies. And like I said, then getting them to play, at least on a Mac, isn't so straight forward either. This could very well be a \"newbie\" thing from my standpoint and it's this format that allows the camera to take such brilliant high resolution video in the first place so I'm willing to deal with some learning curve/hassle here until AVCHD is more widely used.Photos:Photo quality is excellent when viewed at Large size or smaller and still very good at larger sizes. This is the only area where I wasn't floored by the performance of the camera. If you are looking for dSLR quality photos and/or are a big \"pixel peeper\" than this camera is not for you. Sony employs some pretty heavy noise reduction which results in noticeable artifacting when viewing images at full size. The hx100v allows from adjusting the level of noise reduction to \"-\" in the menus but even set to minus I found the NR heavier than I'd like. One of the downfalls to the megapixel race, unfortunately. Who needs 16 MPs crammed onto a tiny sensor like this? But that's a whole other discussion. The photo quality is still very good and more than satisfactory for me, especially with everything else the camera provides. Another feature of the Sony is the sweep panorama. This allows you to click the shutter and pan the camera across a landscape and the camera intelligently creates a panoramic photo in-camera. This is pretty remarkable and I used this a LOT on my trip! You have a few different size options from STD to WIDE to High Resolution. It's a lot of fun and provides for some very scenic photos that can range from a beautiful landscape to a \"fisheye\" still view of a crowd or a town. What's most incredible is how good the processing is at handling moving objects. I took panoramic photos of scenes with cars and people moving through the scene as I panned and it almost allows resolved them perfectly without any blurring or defects. I have noticed sometimes moving objects will be incorrectly \"spliced\" or solid lines such as lines on a basketball court or a fence or railing will be \"spliced\" a bit but this doesn't happen often and from research I've done this is more often the users inability to pan the camera smoothly than the camera processing something incorrectly.Conclusion: The bottom line for me with this camera is it is just plain fun to use. Great video, sweep panorama, a 30x zoom and good photo quality makes for a wonderful package. I am incredibly happy with this camera and have zero regrets about not having my dSLR with me on my trip. The 30x zoom gives you incredible range for capturing the perfect photo, the photo quality is good, if not very good, and only pixel peepers and those printing poster size prints will be unhappy with the results. The video and sound are best in class and the camera now handles SDHC cards so you're not bound to Sony memory sticks any more, although it can use those too. Anyone looking for a \"do it all\" camera that packs a huge zoom in a small body and takes great photo and video will love this camera.Surprise likes:Articulating screen is greatZoom/Focus ring on the lens is great for fine tuning your composition when zooming and also provides manual focusSweep panorama. I knew I'd like this feature but didn't realize how much.Annoyances/Gripes:AVCHD format for movies isn't the easiest to work withCamera not widely available yet (I had to have family pick it up from a best buy in South Carolina and bring it with them on the trip to get it)Screen seems very vulnerable to scratchingAbout me:This may help people understand my wants/needs in a camera. I'm an avid enthusiast/hobbyist. I love taking photos and I'm very tech savvy and very discerning about my tech purchases. I want a camera that provides as close to a \"do it all\" package as I can find. That means I need a large zoom range, good video and photos and it has to be portable if not pocketable. I share 99% of my photos over the web so crystal clear photos and super size prints aren't much of a need for me. I do like an occasional large print to hang on the wall but that's rare. I bought and returned a nikon s9100, a canon sx230, a sony hx9v all in the process of picking out my new camera for this trip. The hx100v blows them all away, although the hx9v is close.Hope this was a helpful review! Go get this camera and start having fun with it!", "Date": "June 11, 2011"}, {"Title": "Amateur's Review of HX100V", "Author": "markose123 \"markose123\"", "ReviewID": "R32MR8KZRKE78B", "Overall": "5.0", "Content": "Below are my thoughts on why I chose the HX100V:1) I need a new camera with video. I wondered about getting a DSLR but then found a bridge camera to be more covenant (as far as size), flexible (as far as features, especially the zoom range) and more affordable.2) I wanted a camera with tilt screen since I'll be taking angled pictures and video. This feature does make a difference for me.3) I hate Sony's exclusivity to only their memory card. This camera did not have this problem; I can use non-Sony memory cards.4) The 3-inch screen resolution on this camera was much greater than other bridge cameras. In my thinking, I'm using this screen all the time, so why not get the best resolution.5) I didn't care much for the RAW feature. I take pictures and don't do much editing afterwards.Now here are my thoughts after using the camera for one weekend, with the disclaimer that I'm not an ardent photographer. First, my positive thoughts so far:1) I love the zoom on this camera. Wow! With smart zoom and image stabilizer turned on, it can zoom up to 216x's. Granted the picture gets a bit fuzzy around 50-60x's but it's still recognizable. The zoom makes it feel like a camera that the FBI would use!2) The movie mode worked well. Clear to see on my TV and great sound. Again, the tilt screen-option helps tremendously.3) I love the background defocus feature. Awesome! The pictures look professional. You do have to keep the right distance in order for it to work. But even if it doesn't work, it'll still take a normal picture with a message letting you know that it didn't work. Make sure you follow the instruction on the screen that tells you how far away from the subject you need to be. As you zoom in further, the distance from the subject increases. It takes some practice.4) The size and weight are manageable. You can't fit it in your pocket, but at least you can carry it around all day without much hassle (plus you look like a better photographer since you have a bigger camera :)).5) I used the camera for most of the day on Saturday. Battery needed to be recharged at night. Granted, I did not use the GPS feature at all. But with normal use, the battery holds its charge.6) The smile detection feature is great! I turn on this feature and it automatically takes a shot when the subject smiles (the level of smile can be adjusted as well). This will especially be awesome for taking baby pictures. Plus, you can set up the timer on the camera to take a shot when one or two subjects are seen. It's great to take self portraits with my wife.7) Panoramic view is useful at times. It's easy to use once you try it a couple of times.8) Lower light shots are decent on this camera. It helps to set it to Superior Intelligent mode where it will take a few shots and combine them (note: file size is not much larger when doing this). The pictures are definitely brighter than my older cameras in low light. In addition, the back-light feature on Screen mode produces brighter pictures.Below are my negative thoughts (after only one weekend of using it):1) It's not a SLR camera. So don't expect SLR pictures. I've compared it to my old Sony point and shoot camera. The same pictures side-by-side shows some differences, but it's not major. The value of the HX100V is being able to tinker with setting to get a better picture (though I'm still learning this as I go). Plus, the intelligent mode does a better job in adjusting the settings. And most importantly, the zoom and extra features (defocus, smile detection, panoramic, video, etc.) sets it apart.2) The manual ring in the front was hardly used. I admit, this feature was very attractive before buying. But after using it, I'm more comfortable using the regular zoom. The manual focus feature seems less useful since the camera already does an awesome job of focusing automatically.Plus, if want to adjust the focus manually (when for instance shooting two subjects behind each other), I've found using the \"tracking focus\" easier. To do this, push the middle \"control button\", which will pull up a box where you place the object to focus on. Then push the middle button again and it locks this object in focus. Furthermore, you can use the dedicated \"focus\" button on the camera to do some manual focusing as well.So in essence the manual focus ring is not as responsive when compared to SLR cameras, since it's electronic. But with other options available, it's not as a big deal.3) I wish the \"custom\" button on the camera would have more options. For me, it would have been great to program the \"defocus\" feature to this button. This way I can activate it with a push of a button instead of going to Screen mode and choosing it, or the MR mode.4) It's very easy to leave your fingerprints on the screen. I'd probably have to do some research on finding some protective sticky that won't leave fingerprint marks (if it even exists).5) The lag time when I move the \"mode dial ring\" is a bit slower since it also shows which mode I'm moving it to on the screen. I don't see why the 3-inch screen shows these changes since I'm already looking at the dial. Plus, I don't think there's a way to de-activate the screen showing this info.It's a small complaint since I have to wait for the screen to go \"live\". But I did find that you can start taking the next picture while the review screen is coming up.6) I don't see myself using the 3D feature since I don't plan to get a 3D TV. Plus, unless someone can give a great reason to use the GPS on this camera, I don't see it being used much. The cost of battery life seems to overweight its benefits. But, GPS may come in handy if I'm on a traveling tour and I buy an extra battery.7) The file sizes of the pictures are around 5MB when it's set on the 16MP mode. I shot the same picture with 16MP and 5MP (the 5MP picture makes the file size around 2MB). I couldn't see any major differences in these two pictures side-by-side. Since the maximum size I'll print these pictures will probably be 8x10, I'll be keeping the camera on the 5MP mode. Plus, this mode gives greater zoom than 16MP (with smart zoom turned on).8) The video file sizes are large. A few seconds of video takes around 20-30MB's. So I'm thinking I'll keep the video mode lower (and not in the maximum-HD option) since I plan to burn my videos to DVD for storage. Even in these lower modes, the videos are still great.These are my overall thoughts so far. I hope you find it useful in making your decision. And thank you again for all those who have posted before me on this camera.", "Date": "May 24, 2011"}, {"Title": "Very good camera.  Not all features well documented.", "Author": "Arthur Black", "ReviewID": "R1SCZED6VMEJLU", "Overall": "5.0", "Content": "Over the years I have owned different 35 mm SLR cameras plus early model digital cameras.  I purchased the DSC-HX100v about a month ago.  Prior to that, I owned the previous Sony model, the DSC-HX1.  I tend to judge digital cameras by how closely they can mimic the speed and ease of shooting of a traditional SLR.  And with the expectation that they will also offer new smart features.In this review I'll try to touch on a few of my likes, and one concern now resolved for the DSC-HX100vOverall I would say the DSC-HX100v is a nice upgrade from the DSC-HX1, which I also considered a good camera.Face detection:  These days I take a lot of family pictures.  I very much like the face detection feature of the camera.  The camera can detect several faces in a scene, and then balance lighting across all.  A rather complex function to do with a traditional SLR.Built in GPS:  I like the built in GPS.  I use Adobe Photoshop Elements to organize my photos.  That software can read the GPS information on each photo.  It will show the location of photos on a map.  Or will show all pictures taken near a specific location.  This makes it useful to record GPS data on all photos.  With the DSC-HX1, I had used an external Sony GPS, the GPS-CS3KA to track my route, then mark location on the pictures.  That worked well.  But you had to be careful to ensure that the clock of both units were correctly set.  It was easy when traveling to make a setting error on either the GPS or camera when you changed to a new time zone.  With the clocks out of sync, the GPS would have trouble matching your travel locations to the photos.  The clock sync problem is now resolved with the built in GPS.  In the limited testing I've done, the sensitivity of the built in GPS seems acceptable.  It seems comparable to the external hand held GPS-CS3KA.Viewfinder / display screen coordination:  Due to my SLR background, I have a strong preference for composing pictures using the viewfinder rather than the large format screen.  The Sony viewfinder image resolution is good.  Time lag is minimal.  One nice touch on this new model.  The camera has a mode that will turn off the large screen, and turn on the viewfinder when you hold the camera up to your eye.  The camera has a sensor next to the viewfinder.  When you move the camera away from your eye, the large format screen turns on again.  A nice bit of human engineering.Video plus pics:  The video on the DSC-HX1 was good.  But video on the new camera is much better.  Full HD 1080.  A nice touch with the new camera is that you can simultaneous take still pictures while recording video.  The camera has two separate shutter buttons, one for video and one for photos.  You can start recording video, then press the photo shutter when you would also like to simultaneously capture a still photo.  With the DSC-HX1, if I wanted to take a still photo, I first had to stop recording video.Lag between pictures:  A basic criteria I use for judging camera performance is how quickly I can compose and shoot a sequence of pictures.  The default on the DSC-HX1 was to display the picture after shooting.  Before the view finder would became live again, you had to wait for the displayed picture to time out.  This created a time lag between pictures.  But there was a work around on the DSX-HX1.  It  had a menu option that allowed you to turn off the photo \"display after shooting\" function.  This allowed you to compose and shoot pictures in fairly rapid sequence.  Approaching the speed of a traditional SLR.  Sony eliminated this menu option with the new camera.  The new camera defaults to forcing you to look at each resulting picture for a fixed time period after shooting.The good news is that there is an undocumented solution to this problem.  (Thanks to another reviewer for pointing this out to me.)  After taking the picture, during the \"display after shooting\" period, you can over ride the display time by pressing the shutter button half way down.  When you do this, the camera returns to the live view mode almost immediately.  I did not find this feature documented in the manual.  And neither the Sony chat line person nor the Sony Style store clerk I dealt with was able to offer a solution.  But the feature is built into the camera.  It now actually works better than the HX1 since you can set the camera to display all pictures, but then quickly stop the display on a shot by shot basis if you are in a hurry to take the next picture.  Very nice.Delay between pictures when using the half-press of the shutter is minimal. I did one quick test and was able to shoot 10 pictures in 30 sec, or one picture per three sec. This included doing a brief pause, perhaps a second, each time the viewfinder became live to simulate framing each new picture before shooting it.  If you wanted to shoot faster than this, you would have the option of using the burst modes.Documentation:  Sony provides a CD with the camera that contains a pdf copy of the intro manual.  And an html version of the full manual.  The html only format makes it very difficult to print out the full manual.  The search ability of the html manual is also limited.  I really wish they would provide the full manual in pdf format.  It's a bit silly to force me to lug along a laptop if I want to check the full manual.  They do have an abbreviated version of the manual built into the camera.Conclusion:  Some challenges with the documentation.  But an excellent camera.  Based on the tip from the other reviewer, I've changed my rating from four stars to five stars.", "Date": "June 8, 2011"}, {"Title": "Returned it for a DSLR - now I'm happy", "Author": "Keith in Dallas \"K\"", "ReviewID": "R3INK2NRB4CPXI", "Overall": "3.0", "Content": "OK,My quest for the perfect camera began 1 year ago. I had a simple Canon SD750, which I thought was a good digital camera. I didn't know anything about DSLRs or super zooms - I thought those big cameras were 35mm. Anyway, I was at party where someone had a Panasonic FZ28. I really liked it. I didn't know there were cameras that had such high zoom. And so my camera education began....After A LOT of research, I bought a Panasonic FZ35. I had this camera for 10 months. It took razor sharp pictures in daylight, the zoom was fun, but it lacked low light performance. After much more research, it appeared that the Sony HX100V had great low light performance, so I decided to sell my FZ35 for the HX100V. I justified the $$, and bought it. Here is what I liked and disliked....Likes: The camera is solid, has great features, great picture quality with sunlight, good high ISO up to about 800, SD card compatible, great zoom, good portrait low light pictures, great burst shooting, excellent video.Dislikes: SLOW shot to shot times, SLOW start up, SLOW zoom, poor low light action shooting (burst - no flash), slow movie starting. I ended up missing many photo opportunities while waiting for the camera to write the last set of pictures to the card. The slowness of even changing modes was very frustrating. This is my biggest complaint, and I even tried to rectify it and purchased a Scandisk Extreme Pro. The camera was quicker, but not quick enough for me. As for picture quality - indoor portraits with flash - very good. Outdoors - good, although my FZ35 was sharper outdoors (sucked indoors).What I have come to realize is that there is no perfect camera for everyone, you must first define your priorities and make sacrifices. In the beginning of my quest for the perfect camera, I ranked cost and portability as my number (1) priority, followed by HD video, and than features. After almost a year of shooting with the FZ35, and 2 months with the HX100V, I realized that most of the pictures I am taking are of my son's TaeKwonDo tournaments. The FZ35 could not handle the indoor lighting, and the video was average. The HX100V did better if shooting with flash or using video, but not so good trying to capture action shots indoors (burst mode). I tried using it at a tournament, but ended up having to use video (which turned out great). The shutter lag and low shutter speeds needed caused missed shots or blurry pictures. I tried using it at an airshow, but the tracking focus had trouble keeping up even in good light. I tried using it to take pictures at a birthday party at an indoor roller skating rink - useless, I put it back in the car. I was left wanting more.I determined that my priorities had changed to indoor action picture quality as number (1), with portability and video not as important anymore (as I rarely used the video on the HX100V, and I was already carrying a bag to hold the camera stuff). I decided to try a DSLR, and ordered the Pentax K-R.I am a lot happier with the DSLR as it's low light action shot is amazing, gorgeous portraits, start up and shot to shot times are speedy. Yes, it cost me more money, but the picture quality is worth it for me. No, it's not as portable, but it is the smallest DSLR and lenses are cheap for this camera. It isn't much bigger than the Sony HX100V.So, if you've gotten this far in my review, please know your camera  priorities first so you don't end up going through what I did.This is a great camera if your priorities are:- portraits (indoor or outdoor)- outdoor (action, stills, wildlife)- HD movie makingThis is not a camera for:- Indoor action- fast moving subjects (such as an F/A18 going 700 mph)- needing to change settings quicklyI thought I would miss the zoom, but my 300mm lens gets me almost as close. Cropping the picture gives almost as good picture quality as the HX100V did without cropping. Now I understand all the fuss around larger sensor cameras (DSLRs). It makes a HUGE difference.If you pan on taking pictures of landscapes, indoor stills, outdoor anything, movies, than this camera will do it beautifully. If you have kids with a lot of indoor sport activities - you'll need a DSLR, unless you are just making a video. Hope this helps. :)", "Date": "October 31, 2011"}, {"Title": "Amazing camera", "Author": "Robert", "ReviewID": "R3FYK4FXIZ3SF6", "Overall": "5.0", "Content": "Just a quick review...I've had the camera for 3 days now, and I'm really enjoying using it for just about everything.The zoom/focus on this is very impressive.  30x optical zoom, and then after taking the picture, you can even zoom in an additional 8x on the image itself (from the camera).  The image stays crisp, even when zoomed in as far as it goes.The 3D is a nice touch, but since there is no 3D screen on the camera itself, you can only view your 3D images/panoramas by connecting the camera via HDMI to a 3D-ready television/monitor.  The 3D is extremely nice though, when it is hooked up to a TV.After a little configuration, you can get the camera setup to essentially run how you want, all the time with minimal changes being done.I'm using a 16GB Class-10 SD-card, and there is very little processing time, even after recording 3D panorama.On the body of the camera itself, there are small raised areas that are slightly textured.  These areas make the camera extremely easy to grip, and you almost have to try to drop this thing.  The camera is a decent physical size, so don't be afraid of crushing it if you have big hands (like those tiny point and shoot cameras).You can also adjust the LCD screen, so you can angle the camera without having to worry about not being able to see, or turn yourself into a strange position.", "Date": "May 6, 2011"}, {"Title": "Excellent for Video and decent for Still shots", "Author": "G. Ward \"HDFAN\"", "ReviewID": "R1Y04VVYGK4OH5", "Overall": "4.0", "Content": "I would give this 4 1/2 stars as no camera is perfect. The 1080p/60p footage is some of the best I have seen in a compact camera like this and even better than some camcorders.  Does very well shooting in low light andthe image stabilization is among some of the best I have seen in a Camera at this price.  Menu is very easy to use and you can navigate through it with ease.Pros:Great in lowlightGreat Still shots1080p/60p is sure sweet in a camera at this price.Still shots are very good.Price, you can find them for under $400Zoom is pretty amazingLength of video doesn't seem to be a problemNice Bright LCD and Electronic view finder on those bright days.Cons:Auto Focusing can be an issue in very dark scenesManual Focusing should work in every mode.LCD would be nice if you could flip it to the side and or close it off.For the Money it is really hard to complain about it's faults as I have seen people comparing this unit tovery expensive camcorders.Enjoy!!!", "Date": "May 29, 2011"}, {"Title": "Sony has done their homework - excellent combination of quality and features!", "Author": "Byrna", "ReviewID": "R3FNIX00DWJ803", "Overall": "5.0", "Content": "I finally got this camera when it became available here in Montreal, Canada and picked it up yesterday.  It's pretty obvious even after one day, how superior it is to any other camera in this sensor size class.  I am posting this review here because the camera is not even showing up in my searches on Amazon.ca...Firstly, the videos are amazingly smooth at 60 frames per second PROGRESSIVE (or 60p; not interlaced like some competitors) at full HD (1920x1080).  I have tried panning quickly (quicker than one would normally pan if one doesn't want to tire the eyes of the audience) and filming cars - both of which produced no choppiness as it did with the Canon PowerShot SX220 HS (which I returned due to its choppy videos at only 24p).  I have tried low-light photos indoors with tungsten or halogen lighting and at night with just the street lights and car headlights and both come out quite beautiful with a minimal of graininess.  This graininess is actually only evident if you enlarge the photo to full size or more than, I estimate, a 21x28 inch print size.  And these would have to be taken with 1600 ISO or 3200 ISO in order to be \"bothered\" by the grain.  When I view the photos on my 24 inch wide-screen Samsung monitor and also on my 40 inch Sony LCD HDTV and they look formidably sharp and beautifully exposed, with good colours and pixel sharpness/definition.I would like to point out that I am a former owner of a DSLR - the Canon EOS 50D, which I sold, to change my photo habits for a more affordable camera which could also do excellent full HD videos.  I have also done SLR photography as an amateur since 1981 and even took some photography courses in a degree program, so I'm quite familiar with camera features and how to take photos.  This Sony HX100V hits the spot RIGHT ON!  It has an astounding lens range from 27mm - 810mm at 4:3 photo format and today, I took a video of some pigeons grazing on a field at maximum zoom, hand held and they were as sharp as at any other lens zoom setting, and with very little camera shake and this is amazing for me!The GPS is also pretty good at picking up signals.  It had problems when I was in the balcony of my solid concrete and brick apartment (9 floors) which has other high buildings around it and a high-voltage hydro transformer next to it, but after walking about 100 feet to the other side of my building on the sidewalk of my street, the GPS picked up the signal faultlessly and kept it.The flash is also quite versatile.  It has a \"slow synchro\" setting which makes the background and the subject much more natural-looking and more evenly illuminated compared to the normal direct flash setting.This camera is a wonder because you have control over everything and can adjust anything from white-balance, to exposure during videos, to flash exposure compensation, manual (user controlled) focus point selection and even manual focus!The camera's auto-focus is very good and can track subjects really quickly.  It is probably best to use the multi-focus setting if you are filming in busy places with lots of people or other subjects (like team sports) and you have the option of even selecting your own focus point.The menus are also intuitive and quite easy to navigate and even have a built-in \"help\" feature right in the camera menus themselves, whereby, when you press the button on the lower right of the LCD screen with the \" delete / ? \"  symbol, you can check some basic instructions on many features.The LCD screen is at the same high-quality resolution as most DSLRs and as my old Canon 50D - at 921,000 pixels!  It was bright and very sharp, making photo composition very easy.  The electronic viewfinder is also very easy to use and sharp enough to use comfortably.  The viewfinder also has a dioptric adjustment so that you can vary its focus/sharpness according to your eyes, adding yet another feature to this camera from the higher-end DSLRs, which again delighted me!  However, Sony could consider having a fully reversable (180 degree) LCD screen which one can flip to face you when taking self-portraits or when not behind the camera.  This feature would help save time in composing your shots.The ergonomic fit of the camera in my hand was also perfect with that right-handed protrusion serving as a grip, making me miss my old DSLR even LESS!  In fact, I don't miss my Canon 50D at all with this amazing HX100Vs quality and versatility and perhaps most importantly, the amount of control it gives the photographer over changing settings and consequently, over his/her photos.The only gripe I have is a gripe that many people probably already have is that the instructions are not printable in one shot.  You have to literally navigate to each page you want to print and print them.  Though this can be adapted to in a way, since we can then only print the pages and sections we need, while leaving out the obvious and basic sections which we already know about.  But still, a PDF Acrobat format instruction manual is definitely called for.This camera puts all the cameras in its class to shame since it does things which no others can do yet - 60p video combined with an optical amazing zoom range (I have not even tested the digital zoom yet which would magnify even more), an intelligent and quick auto-focus, flash and overall excellent picture and video quality and all this, while still giving full manual control over all the settings that even professional photographers would be impressed with and many thought would only be found on higher-end cameras.Way to go Sony! You've done your homework and brought out a great camera which beats the competition hands down!", "Date": "June 17, 2011"}, {"Title": "Sony HX100V - Fantastic Camera (Especially for the price)", "Author": "Jerry K. \"Jerry\"", "ReviewID": "R3EMWAZNJO4FDO", "Overall": "5.0", "Content": "I got this camera from Best Buy for approximately $100 less than what Amazon (and others) would be selling this camera if they had it in stock. It's very much in demand and apparently Sony has had manufacturing problems because of the earthquake in Japan. After ordering it a few weeks ago I picked it up two days ago. Went out for my first shooting today and happy with the photos I took. If you're expecting the same quality as a $1,000 camera then look elsewhere - if you're looking for a camera that stands at the top of the list for bridge cameras then you have found your camera. I would suspect that prints up to 10x8 would be fine - small prints of 4x6: I doubt there would be loss in quality compared to most $1,000 cameras. I sold my Sony A55 so I could have a bridge camera that came all in one package. By the way, the review above this with 1* - the person obviously has no idea how to rate a product if he hasn't even tested out the camera yet and is giving it a low rating because there was no battery charger - just do what I did: go on e-bay and buy one for $5.00. The two ratings above this with 5* ratings (IMO) are very accurate.Edit: a week later - first, the person who only gave it one star because there was no battery charger has pulled their review (as they should have). This camera comes under the heading of a P&S; - but it is so close to a DSLR that the only thing missing is a better quality sensor (Xbut then that is why this is a sub-$400 camera and a good DSLR with a decent lens is $1,000 (and more).  The video on this camera is clear and bright and HD quality - you don't get a photo camera because it has great video - but I guarantee you could not tell the difference in video quality between this camera and a top-of-the-line video camera. Not all photos I have taken would be considered great but there are some good ones - that is for sure. I am still learning what works best (so many different controls and settings) - but the bottom line is you won't be sorry (in fact, you'll be thrilled) that you purchased this camera (because it is in short supply some people are paying over $500 on E-bay)!", "Date": "May 21, 2011"}, {"Title": "Excellent Value And Feature-Set", "Author": "A. A. Katz", "ReviewID": "R1I2ZIF5DXBU83", "Overall": "5.0", "Content": "I was skeptical about this camera from the get-go. 16 million pixels in a 1/2.3\" sensor is just a depressing thought. Even though this has the Exmor rear-illuminated sensor (which is supposed to deliver more light to each pixel), 16 million pixels on a tiny, tiny sensor is just an insurmountable challenge in terms of noise.I was sorely disappointed with my first shots and considered returning the camera. As always, even at the lowest (-) settings, Sony applies heavy-handed noise reduction and sharpening. At 100% (pixel-peeping), there were sharpening artifacts on many edges and yet the pictures didn't look all that sharp at normal viewing resolution.So I took the camera to the local botanical gardens to give it a good test compared to my more professional kit (I also shoot with a Nikon D7000 and a bag full of lenses). Just like my reaction to the early H-series cameras, I was amazed at the quality and detail and sharpness of these nature shots, some of which were quite difficult (red flowers, for example). They post-processed well in Photoshop CS5, and I printed as large as 9X12 and showed them at an outdoor exhibit and sale - where they were much admired and sold well.I decided to keep the camera. The more photos I take with it, the more fun I have and the more I have come to respect it. I just stopped pixel-peeping and got happy!As for low light, this is not a very effective low-light camera. Like all of its predecessors, anything over ISO 400 shows either noise or heavy noise-reduction. Usable, but not particularly good (I'm spoiled by the Nikon D7000, which is excellent at higher ISOs). On the other hand, the hand-held twilight mode can produce some really remarkable results in low light.What can I say about the video? It's world-class. In fact, I decided not to buy a relatively expensive separate camcorder after viewing video I took on this camera. I don't use the highest resolution (though it's nice to have it), because I burn my videos to standard DVDs, which don't support 1080i. So, I use the 720p, which looks gorgeous, rich and clean on my 52\" LCD TV, even from a DVD (as opposed to direct-connect through the Hx100's HDMI cable).Pros:Brilliant, well-exposed, saturated shots with beautiful dense and accurate colors.Incomparable zoom range with incredible accuracy and sharpness thanks to the Carl Zeiss design.Fast focus, fast shooting, big buffer.Takes SD cards!Battery life is excellent. To date, I have never run a battery completely out.Video is nothing less than superb.Flash is not only excellent, but it color-balances to the original non-flash image, meaning your flash shots look natural instead of cold and overlit.Panorama is positively amazing.Price is excellent compared to the rich feature set.Cons:Long zoom means that, at telephoto, minimum focus range is 8 feet.Heavy-handed noise reduction and sharpening. They should offer RAW on this camera series.They should let you turn off AutoReview for faster shooting.iAuto is not as \"intelligent\" as it should be. I got a fair share of under-exposed, over-exposed and blurry shots in that mode. Aperture-Priority and Manual modes are excellent.Conclusion: If you want a camera with huge capabilities that lets you concentrate on your subjects instead of the camera, this camera should be at the top of your list. If nothing else, it's huge fun to use!", "Date": "August 19, 2011"}, {"Title": "Sony HX100 is a winner", "Author": "David L. Brown", "ReviewID": "R1OQ7XQKV472U5", "Overall": "5.0", "Content": "First let me start by saying that I also own a Canon SX20is which is a good superzoom. The Sony Hx100 that I purchased one week ago far exceeds the Canon by all measures. I have already taken over 200 pictures with it and I must say that if you really explore the settings you can get almost DSLR like results. I also own a Canon T1i, XSI and the former owner of a Sony A200 and Olympus Evolt all SLR's (Just as a reference to my familiarity with good IQ). The Sony is a great bridge/superzoom. I also considered the Fuji HS20 and the Canon SX30is but in all fairness to those cameras I only compared the specs when deciding. I stongly recommend the Sony based on my experience with it. I wish I had all three though.", "Date": "June 15, 2011"}, {"Title": "Great Pictures and Features", "Author": "B Joslin", "ReviewID": "R1PP2PPYJM3F7Z", "Overall": "5.0", "Content": "I've been looking for several months to upgrade from my Canon G9 (high end point and shoot 12.1 MP with lots of flexibility).  I loved the quality of the Canon pictures - colors and clarity were always good.  The camera had some very nice features:  1) the 12.1 MP was great.  I frequently crop my pictures and print zoomed up portions not just the original shot. 2) There were enough scene modes to allow for creativity without a lot of fuss. 3) It was bigger than a typical P&S;, but still small and lightweight.  But --- there were a few things that it lacked.  1) The 6x optical zoom was nice, but not very powerful.  2) Burst mode and action shooting wasn't the greatest.  3) Night shots were good with a tripod, but often blurry without one.  4) It had 1080p videos, but once you started recording, you couldn't zoom in or out.I Take lots of vacation photos.  I often blow them up to print 8x10 up to 13x19.  I scrapbook, and splice videos and images into pretty complex slideshows.  We watch them on a 35 inch high def tv, so want the images to increase without loss of clarity.I've read lots of users reviews, and think they're really helpful to hone in on the pros/cons that I was most interested in, so I thought I'd return the favor and share my experiences looking for a high end point and shoot camera.I looked at four cameras, but ultimately chose to keep the Sony HX100.What did I look at?Fuji FinePix F550EXR.  Brand new 16MP ultra-compact point & shoot.  Took great indoor and outdoor pictures; loved the panorama feature and thought the GPS could be handy.  Didn't like the flash popping up constantly under my left thumb; and the startup on the camera was very inconsistent - from 3 secs up to 15 secs to be ready to shoot (with the GPS featured disabled).  I knew the slow start up would cost me shots in the future and I was a little nervous about keeping steady with such a tiny camera, so I sent it back.Panasonic Lumix DMC-F35.  A step down in megapixels from my canon, but if the picture quality was great, I could live with that.  Had a bigger zoom, so I figured that would compensate the Megapixels and still allow me to crop as I like to do.  The camera was classified as a \"bridge\", so it was much bigger than both the Fuji and my current Canon.  What did I like about this one?  The outdoor shots were phenomenal.  Took some really good shots of birds outside that would have been specs on my old camera.  I found I didn't mind the compromise in size, and actually liked having some of the heft of an old SLR back, as it made zoomed shots easier to keep steady.  But, the indoor shots were terrible.  Grainy, grainy, grainy!  What's up with that?  How could this camera be so good outdoors (macro flower shots were awesome) but worse than a little point and shoot indoors?  Unfortunately, back to the drawing board.Next I tried the new Panasonic Lumix DMC-G3.  This one was a 16 MP micro 4/3s camera.  Interchangeable lenses, which I wasn't sure I wanted to lug around with me on vacations, but image quality again was rated very high.  Finally got one in - and I found I couldn't take a decent clear picture out of the box.  This camera has a new combination touchscreen and traditional dial interface, including the ability to focus by touching the screen.  I thought it would be fairly straightforward( I'm a veteran computer, smartphone and Ipad user - how tough could it be?) But it was not intuitive.  Needing to be up and confident in shooting with this camera for an imminent overseas vacation, I decided I didn't want to take the chance on trying to learn it at the expense of some once-in-a-lifetime shots.  Might be a great camera, but not for me.  I know I want to spend more time enjoying my vacation than composing the shot to remember it...strike 3.I picked up the Sony HX100V.  It had all the features I was looking for, including a prety unbelievable up to 810mm zoom (35 mil equivalent).  That would have required a lift just to hold up on my old Pentax SLR!  I picked it up an started clicking away on IAuto.  But I like to use the other features too, so I tried using a slow shutter speed and shot a nearby waterfall at dusk (high dynamic ratio).  Wow.  I was pretty impressed.  The handheld twilight mode took some really nice buildings lit up at night, and the zoom did even better than the Panasonic for catching some local wildlife. (It's probably got a fair amount to do with the Carl Zeiss lens, which I've had on prior cameras and really liked the optics.)  At first I thought the pictures looked a bit washed out; but a side by side comparison of the same shots taken with my Canon actually showed that the Sony color and contract were better!  (That's why we take pictures, isn't it?  Because what we remember sometimes isn't as close to reality as we thought???)  The speed of the camera is impressive - starts quickly, focuses quickly.  Another thing I really like - the automatic switch between the screen and the electronic view finder.  I found on some bird pictures, I lost the bird when trying to use the screen, and wanted to switch to the viewfinder.  On the Panasonic, I had to hit a button to do that, which meant I moved the camera and lost my subject.  On the Sony, I can just move the camera up to my eye and it automatically switches to the EVF - Sweet!  Took a few videos as well - great clarity, very good sound, and it was a nice add on that I could zoom while shooting.I really like the features on this camera.  As I said, I'm heading out shortly on vacation, and want to take some cityscapes with the panorama feature.  I think I'm going to have a lot of fun with the options on this camera, without flipping through the 275 page maual to find out how to do something.  It's not as brag-worthy as carrying a Leica or a thousand dollar slr, but it takes great pictures that I'll enjoy printing to frame in my house, show as slideshows to the family, and burn to watch videos on our Playstation 3.If you're looking for a really feature-packed bridge camera, that also doesn't give up on image quality in favor of the gadgets, I'd recommend this Sony.", "Date": "July 21, 2011"}, {"Title": "sony hx 100v vs canonsx30is and nikon p500", "Author": "jim jim", "ReviewID": "R1Z8PKR7T9070L", "Overall": "4.0", "Content": "bought p500 and canon sx30is at the same time i compared both and i took the p500 back, the battery life was too short and the pictures wasn't as good as the canon,3 other people told me the same. i also didn't like the way the p 500 would focus when u zoomed all the way out it bounced all around. took p500 back and bought sony hx100v to compare to the canon, they are close, the pictures from the canon were not as crisp, with purple fringing on photos and the lcd screen is not nearly as nice as the sony. i liked the color on the canon photos in auto mode a little better,the sony is a little red, but if you go into a different mode you can change the setting to real. i took hundreds of photos with all three of these cameras and my scores for each are:  sony 90 out of 100  canon sx30 is 84 out of 100 (didn't like lcd) nikon p500 75 out of 100 .  sony wins out because of lcd and picture crispness.", "Date": "August 28, 2011"}, {"Title": "No software for Mac or Windows XP-64 bit Edition!", "Author": "C. Bruce", "ReviewID": "R3B5YSGKCJYSB5", "Overall": "3.0", "Content": "I had this camera for a few days and my initials trials were satisfactory. However, I have one warning that was not pointed out by the other reviewers. The PMB software that comes with the camera does not work on the Mac. There is a \"light\" version of this software for the Mac, but it only handles the basic import and display of pictures, it does not handle video or 3D pictures at all. I had a second  computer that runs Windows XP-64 bit and ... the PMB software does not work on that operating software either! Fortunately my laptop runs on Windows XP (32 bit) and that did run the PMB program. This was not an ideal solution for me, I didn't want to use my laptop to store my pictures. I seriously thought about returning the camera, but at the end reluctantly decided to keep it. I realize Windows XP-64 bit is not widely used but how difficult can it be to modify the Vista or Win 7 versions to make it run in it? And I am amazed that a big company like Sony would dismiss the Macintosh users of its customer base (and I know this has been going on for several years now)! How expensive can it be to hire some programmers to write a decent Mac program?", "Date": "July 8, 2011"}, {"Title": "Love My Sony DSC-HX100 Camera", "Author": "Glenn A. Michaels", "ReviewID": "R2T2UYJD5JPGUW", "Overall": "5.0", "Content": "I just got back from a two-week trip in Europe with my new Sony DSC-HX100V Camera and wanted to add my feedback to help others and thank everyone who helped me choose this camera. In summary, this is a fantastic camera and was a pleasure to use. It is a large step up from my older version from Sony. I took more than 4,000 photographs in two weeks. and put the camera through about every test that it could have.In more detail, here are the key aspects and my two cents on them.Overall Camera Performance: This camera is a work horse and had many features that made it a dream to work with and a couple that are major issues in my opinion (which I will cover later). I used the Superior Auto automatic feature almost exclusively with the hand dial located near the shutter release I quickly tweaked the EV levels when necessary. It also does this for you automatically by taking three bracketed photographs. I chose to have the instant control which worked very well for me. The battery life was very good. I had three batteries which lasted longer than I anticipated. I would charge them daily which more than met my needs. Only once did I run out of batteries and used my new Sony DSC-H70 at that time. I actually switched between cameras depending if I needed a really wide angle or wanted to be less obvious.Picture Quality: Picture quality was outstanding even at the longer focus distances. What an incredible range of framing options with the 30x Zoom. In many cases, since I was shooting at the highest 16M size I simply made minor edits in the camera after the shot. I was totally amazed at the picture quality at all ranges day and night. Even though I took a monopod, I never used it. All photographs were either hand held or I found a natural tripod at night to add some minor stability. I was more than impressed with the picture quality and so were the people I was traveling with.Ease of Use: This is a very easy camera to use. Most things are well placed and there are great features. It is lightweight, very user-friendly and was a joy to use. The weight is well distributed and makes it an easy camera to keep with you at all times. I just enjoyed using this camera and it just got easier.Two Major Flaws: Again, this is my opinion, but I found two flaws in the camera design that impacted my work with the camera. First and most important, this camera will allow you to delete an entire days worth of photographs without asking you if you are sure you want to do this. Click and they are gone! Paris at night...gone. I went back out until 5:00 a.m. to re-shoot. Before the trip, my son deleted some photographs and I was furious - not at him but that it could have happened. And then I did it. I was tired and looking at photographs and deleting some and then a day's worth were gone. This is a huge flaw and I would by no means let it stop you from getting the camera. I ended up manually protecting all of my photographs before I would look at them. Just be careful. Second, is that I kept turning on the movie function which is a small button located in the wrong place for me apparently! I missed a few shots stopping the movie.Very Highly Recommended: I would highly recommend this camera. This trip and this camera were both dreams come true for me. Watch the delete button and you should be very happy. I have added some photographs to the page to show the level of detail and performance in some of the most challenging shots.Two Months Later: I am very happy with this camera. I had some 11x14 prints made and they are amazing quality. I will try larger soon. I did notice some purple showing up in small details with extremely bright sunlight but it is very rare.", "Date": "July 2, 2011"}, {"Title": "After buying 4 camera's from 4 different manufacturers I found this beauty!", "Author": "The Walkers \"Mother of 3\"", "ReviewID": "R2TD1H7S77XRFC", "Overall": "5.0", "Content": "I went through camera H3LL before buying this camera. I started with an Olympus, then Cannon, then Nikon, and each one I knew within 10min - 24hours they were going back. I really hated the Olympus - not the same as it used to be.. picture quality was the worst of all 4. The Cannon was already giving me problems with not turning on after a few hours (went though the same thing with my Cannon camera two years ago), and then there was the Nikon. I really wanted to like the Nikon, I mean it was my favorite appearance wise (went with red) but the picture quality was just bad. The Cannon took better photos! So I finally bought this camera, and within 12 hours I knew I was no parting with this camera for anything!You should know - I am not a professional photographer in any form. I use my camera mainly to take pictures of my kids. This is important because kids are not the easiest subjects to get.. they are constantly moving and you have to have a camera that takes multiple shots in a row at high speeds otherwise you will never get a photo of a smile :)I love -1. The looks - it looks awesome. I pull it out and people always say \"wow, that's a nice camera\"2. The form of the camera. All the right indention, grips, and such to make holding it easy on the hands.3. I love the ability to move the screen up, down, and extent in and out. When my kids are down low I just move the screen facing up to me and lower my arms, no getting down on the ground.4. I love the photo edit options built in such as red eye reduction. Very few camera's have this now days and of all the ones I have used Sony is by far the best.5. I have never had a camera do this... it is fantastic.... but you can take a regular photo and then have the camera zoom in and crop out all area you zoomed out of the frame. This is fantastic because it does not affect the pixels. If I did this on my computer it would lessen the pixels and prevent me from blowing the photo up to larger formats.6. Any edit you make to a photo is saved, but also the original is saved as well. So if you see the photo on your computer and do not like the edit then you still have the original.7. The zoom... yea enough said there! WOW 30X and they mean it.8. The zoom is fast in and out but not insane fast. This is important I learned from owning the Nikon. It would zoom so dang fast that I would loose my object immediately. I would spend another minute lightly tapping the zoom back out to find the subject and then tap tap tap tap tap zoom back in to get the photo withe my subject in it. FREAKING ANNOYING!9. The auto intelligent photo really works! Out of all 4 cameras the only auto intelligent photo that worked was the Cannon. The Sony by far has a much better working intelligent photo though and even a super auto intelligent photo option. I like both but the super one takes a while in between photos since it is actually editing and fine tuning your photo after it takes it.10. The pixels are perfect. They are clear and accurate in color and tones.11. The HD video is great. It is fast, clear, and the sound is good.12. Panoramic shots are superb and print out perfect.13. 3D option is super cool but I have not used it.14. The face detection is always spot on... I mean it never gets it wrong.15. The background de-focus is AMAZING! I love this feature!16. I very rarely get blurred photos. Even when the kids are riding bikes are playing around the photos still come out clear. I did not have this with any of the other camera's I went through.17. The smile shutter is great and works perfectly! You can even adjust it to the size smile from grin to big teeth showing smile. I captures the photo perfectly every time.18. Face softening feature is nice but honestly I do not use it very often.19. Anti blink feature really works - I had two cameras that boasted about this feature and it did not work. With this camera.. it works and works perfectly. I even tried it would several faces together and not one closed eye in any of the photos!20. Transfer jet is an incredible feature but I do not have anything to try it on yet.21. I love how you can either zoom with the zoom button on top of the camera or you can zoom with twisting your hand around the actual lens..22. All of the buttons are perfectly placed.23. The continues shooting mode is really nice and you get like 10 photos in the blink of an eye.24. I hate not having the view finder but this camera surpasses that! It is electronic and has everything the big screen has.25. HUGE screen. I love the big screen...26. The time that laps between photos is the shorted of all the camera's I tried. It was really fast, I am talking like 4.5 seconds between snapping a photo and being able to snap another... I just timed it myself to be 100% accurate. Now this is using (yes this is very important) a SanDisk SDHC Card #4. Those who are complaining about slow shutter speed are most likely using a cheap class level 2 card or off brand card (I SAID MOST SO DON'T GO ALL CRAZY IF YOU THINK THE SPEED IS SLOW AND YOU HAVE A HIGH PERFORMANCE CARD!)When I used my friends class level 10 SDXC card and OMGosh... the shutter speed was like 2 seconds or something! Crazy speed but expensive SD Card! For those who want to learn more about SC card classification just Google it... there is tons of info on the web.27. My husband loves the GPS feature but I have not used it and don't plan on it being that I do not want anyone having info of my kids whereabouts... overprotective like that... or so I have been told :). My husband uses it to take shot of his kill when he is out hunting, x marks the spot I guess.. I dunno? LOL28. The battery last a long time to me... I take on average 200-400 photos before I recharge it. Another plus is that the battery is a Sony common one, meaning all of our Sony products (camcorder, camera) both have the same batteries so that is helpful when it comes to charging them and buying an added external charger which I feel was a must.29. Great low light photos. I have tons of the kids asleep looking like angels and they all have come out clear and there was no blur or darkening of the pictures.The Cons -1. It is heavy after a while holding it with one hand while getting the kids to act right for the shot.2. I hate that it pops off the lens cover but I fixed this by tying the lens cover tether to the actual carry strap to the camera. So now I just turn it on and let it pop the cover off itself. It just hangs there until I power the camera down and put it back on.3. This is stupid to complain about but I am being totally honest here... I do not like how previewing photos with the camera off is set up. If you press the play button to JUST preview your photos on the screen, (not turn the camera on) everything works great and goes as it should BUT if you use logic and press the play button again to turn the preview off it actually turns the camera on! The way to turn off the preview without turning the camera on (this is so stupid to me) is by literally pressing the power button for the camera. That turns off the photo preview and does not power up the actual camera. So CraZy to me!4. Another minor... I wish you just push the shutter button to record a movie instead of finding the movie record button with is on the back of the camera by the play button. I like shooting movies with the view finder but it is too awkward to find and press the button with the camera up to my eye, and I do not want to set the dial and then press record while I am not even focused on my shot.So as you can see... from a Mom's point of view... I think this camera is a huge part of our family and I could not imagine having any other camera in it's place. I love this camera.", "Date": "February 6, 2012"}, {"Title": "Really good camera!!!", "Author": "Steve", "ReviewID": "R3GYXUVUVDIPB9", "Overall": "5.0", "Content": "Ordered from Sony website on April 10. I was on hold and got a notification from Sony that the release date of this camera changed from April 22 to May 27, but I think 5 days after I received the box with the camera. O boy I just love this camera.This is my first camera that I've ever bought and I was hesitating at first because I was interested in the FujiFilms Hs20, but after seeing the reviews, I didn't like it because it just didn't fit me. When I saw this camera however... Boom I just fell in love with it and had to get it. I'm new to cameras so... :)I took about 100 pictures outside of my house and 100 at my neighborhood park. Wow I was amazed. Everything went well, the colors were sharp and vivid. The camera focusing was pretty good. A+I really like the movie feature for this camera, because the framerate is clear, really good autofocusing, just great! Only flaw is that after I reviewed the clips, I've noticed that there is some buffeting noise because of the windy weather. I'm not completely annoyed, because I had the same problem with my camcorders... I just wish they could fix the camera and get a better mic or at least add a input for a mini mic.Anyways, great product, great camera, I don't regret buying this :).", "Date": "May 10, 2011"}, {"Title": "HX100V Competes Well In Its Class Despite Weaknesses", "Author": "HuskerDog", "ReviewID": "R1CIY1I9K36M1G", "Overall": "3.0", "Content": "I purchased this camera after previously owning a Canon SX30 that struggled focusing.  As an amateur nature photographer, it was frustrating to miss so many shots, even though I realize smaller subjects like birds present quite a challenge for these cameras.  Because I'm hiking through varying lighting conditions, I run the risk of missing my fleeting subjects entirely if I stop to change settings, so an excellent auto mode is a must.  Here are some observations after about 1000 shots with the HX100V.- I'm missing far fewer shots now, as long as I stick with the default \"Multi\" focus setting; the other AF options are less reliable, especially in low light.  One frustrating thing about zoom shots with this camera is you have to be at least 7 feet away for the camera to focus.  I'm noticing the need to step back a few feet as I'm trying to get closeups of butterflies.  With the Canon, I could be 4 feet away with 35x zoom and still get the shot.- Auto Exposure/Color:  Rarely a concern with the Canon, the HX100 is hit or miss.  50% of the time I get an absolutely beautiful exposure with brilliant color, the other half yields overexposed/underexposed shots with either oversaturated or undersaturated colors.  Refocusing once will generally clear the overexposures.- One feature that deserves special attention is Backlight Correction HDR, which lets me expose for a sky while still giving me color and detail in the foreground, and brings out leaves in shadow when focusing on a high contrast flower.- Sony really cut corners with this viewfinder.  Not only is it small, but the design is such that there isn't any breathing room for my eye area, so oils and perspiration quickly cloud my vision on a hot day.- Sharp closeups are easy; the camera will focus with the lens just an inch or two away, no Macro mode needed.This camera was obviously designed with versatility in mind.  Is it the best camera for wildlife?  Probably not.  But it is a very good performer overall, with decent image quality and a feature set that puts it near the top of the megazoom class even when considering its weaknesses.", "Date": "July 29, 2011"}, {"Title": "A great camera", "Author": "David L. Winters", "ReviewID": "R3J32T8MVJYFM5", "Overall": "5.0", "Content": "I want to start out by saying I am glad I waited. Amazon did not have this camera in stock and so I waited until Best Buy had it. I bought it at Best Buy last weekend for $399. The camera is exactly what it said it is. Sony put alot of really good features in it including the 3D capabilities and HD movies at 60FPS. I also like the fact that there is no shake at all on the movies or pictures even at full zoom. The auto features are great. You have two settings for auto. I also like the fact that you can now use the SDHC cards on this camera. I am going to try a 32GB or 64GB for space for movies and pics. I think Sony products are good and durable. I almost bought the Fujifilm HS20 but after seeing the reviews decided not to and wait for the Sony. The pictures are sharp and full of color. I think all the reviews speak for themselves, this camera is well worth the $399. The only cons are the camera is a little bulky in size and aftermarket batteries can get stuck in  the battery compartment.", "Date": "June 9, 2011"}, {"Title": "Not for Wildlife!", "Author": "Bob", "ReviewID": "R3MK41JH5C57NJ", "Overall": "1.0", "Content": "First of all, I'm an amateur photographer.  I have used digital zooms since 2001 and I have had made a point of keeping up with the technology, always buying the best camera on the market.  This year  I purchased the Sony DSC-HX100v.Any camera does well with general photography, such as landscapes, people, etc and the Sony DSC-HX100v is no exception.  An image of woods or a field that is slightly out of focus or slightly under-exposed might still look good.I don't photograph these things.I shoot wildlife which I think is more exacting.  When you enlarge a picture of a butterfly, every photographic flaw pops out and it doesn't take much to ruin a picture.  I use zoom to telephoto to capture birds and mammals and close up for butterflies and dragonflies.  I sometimes shoot in automatic mode but more typically I use the manual settings or (P)rogram for extra control.The Good:The Sony DSC-HX100v has a proprietary battery, which I much prefer over the rechargeable AA's .  The camera also has a battery meter to tell approximately how many minutes of battery life is left.  I typically took 300+ photos on an outing and the battery still had  charge left on the battery.There are both a viewfinder and a large LCD screen on the back of the camera.The panoramic mode worked very well - you simply sweep across a landscape as you hold the shutter button downThe camera has a great grip; it balances well in your hand.  The proprietary battery keeps the weight down.There is a built-in in user's manual that you can refer to right in the field, on the camera's LCD screen.Placement of control buttons was not distracting.There is a combination zoom/focus wheel on the lens, which I didn't use.  You can also zoom using the more usual lever.The Bad:- LCD screen was useless in the sunshine.  It simulated midnight over the ocean on a starless night.- You can switch between 3 viewing modes - viewfinder only, LCD screen only, or both.  If you chose viewfinder only, then playback was also in the viewfinder only - an irritating annoyance.  You could solve this problem by choosing the viewfinder-LCD combo, but then the camera acted strangely.  When you first look through the viewfinder, it would be blank but when you start to zoom the lens in or out, the viewfinder would turn on and work.  Another annoyance.- What you see is NOT what you get.  Often the subject appear to be in sharp focus in my viewfinder but later I found out that the camera was out of focus.  It was very frustrating that many photos turned out lousy because when I was composing them in the viewfinder, they looked sharp.  I lost a lot of good photos this way.In order to avoid this, you need to pay attention to a little green dot in the lower left corner - a dot that is out of your eye's view as you compose your subject.  You must purposely take your eye off the subject to look for the green dot.  If the green dot is solid, the camera is properly focusing on the subject.  If the green dot is flashing, the subject is out of focus, even if it looks to be in focus in the viewfinder.  In either case, you have move your eye back to the subject and compose the shot again.  A pain in the butt.  Sony should have moved the green closer to the center of the screen so you can monitor it without taking your eye off the subject.To get the green dot to stop flashing, you had to zoom back, often quite far back.  Thus you lost the advantage of the powerful zoom.There is a \"beep\" that sounds if the green dot is in focus, however, there are beeps for other functions on the camera as well.  You cannot differentially turn off some beeps and not others, so you have to have all the \"beeps\" or none.  I don't want the camera beeping when I'm trying to shoot wildlife.- Exposure Compensation, a function I use a lot, is on a push button spin wheel - very handy.  However, Sony made the mistake of having 4 functions on this spin wheel - ISO, aperture setting, shutter speed, and exposure compensation.  Initially you click on the function that you want to change and then keep turning the wheel to get the desired setting.  However, the sensitivity of this wheel leaves a lot to be desired.  As I was trying to set the shutter speed, the wheel must have slipped and I was, instead, increasing  exposure compensation.  It was annoying trying to get out of that mode and get back to the shutter speed mode.Image stabilization (IS)  - erratic.  Often the little waving IS hand popped up to tell me that the image was not stabilized even though stabilization should not have been an issue.  On one occasion, this hand popped up when I was shooting a truck over 3 hundred feet away, in bright sunlight, with a shutter speed of 1/640 or 1/800 second.  There is no reason why image stabilization should have been a factor since the shutter speed was so fast.  Yet, the photo turned out slightly blurred!Zoom - This was bizarre.  Sometimes for close subjects, such as a butterfly near the ground just in front of me,  I could zoom out 30X and get a nice image. But other times, in order to get a sharp photo ( to get the solid green dot described above), at the same distance, I had to reduce the zoom down to 2X to 8X - which is one heck of a reduction.  I could not figure out why there was a difference.  Using my Canon PowerShot SX10IS in exactly the same situation, I was able to zoom out a full 20X (the limit of the camera) and still get a sharply focused photo.  I realize that with 30X zoom, I cannot get as close to the subject, zoomed full out, as with my 20X Canon.  But the Sony camera  just simply acted inconsistently.The Ugly:- Image Quality was inconsistent.  Even when the green focusing dot was properly  lit and the waving image stability hand was under control, photographs still did not look good.  Some of my photos are tolerable but I never attained the crystal sharpness that the Canon PowerShot SX10IS gives me.  All my Sony photos were \"soft', or slightly out of focus.  Correcting them with software just didn't quite get it right.Making certain that (1) the green was solid and not flashing, and (2) making certain that the waving IS hand was not waving at you, was very distracting and took away from the enjoyment of photographing my subjects.I read on-line that the Sony and other camera manufactures are cramming too many MP's into too small a sensor and as a result are giving up image quality.  I suspect that if this camera used relied on 10 MP instead of 16 MP, the Sony DSC-HX100v would be a really winner.I'm sending the camera back for a refund.  The Sony DSC-HX100v has many great features but it's not the camera for me.", "Date": "July 6, 2011"}, {"Title": "almost a hit, but flawed", "Author": "MrOutacontrol", "ReviewID": "R2KLHXPNWNRJRX", "Overall": "3.0", "Content": "This is an interesting camera.Strengths-1. good image quality, nearly on par with a 4/3 at low iso's (provided you dial back the noise suppression and do a bit of work in gimp or photoshop).  No raw output, but with the noise reduction at minimum I don't think you loose much,given the sensor size. focus is accurate and fast.  Color balance is a cut above, Saturation is just a tad high but not bad.2. that lens!! No need to buy/carry extra expensive lenses. The lens is surprisingly sharp, with much less barrel aond pincussion distortion than the Canons I have looked at. I don't see much softness in the corners, very little chromatic aberation.3. decent low light performance for a small sensor, has built in features which can help produce above average \"snapshots\"4. Outstanding video--the videos I took at a wedding were of higher quality than those of the professional videographer.5  sound quality is better than most.Shortcomings-1. controls/buttons need to be looked at to be used as they are almost impossible to find by feel. This is a problem in low light situations.2. under incandescent, white balance off, most cameras in this price range are more consistant.  Can be fixed by manually selecting tungsten.3. camera \"feel\" is a bit cheesy, can be traced to a vibration from the lcd screen mounting arrangement4. software does not support linuxBIG ISSUES1. The lcd color profile is grossly out of wack.  When taking pictures (not videos) it is GROSSLY oversaturated, tending toward bright orang/red.  This makes adjusting the picture very difficult to impossible, which is one of the biggest reasons for choosing a bridge camera over a compact.2. Noise reduction sometimes goes crazy, leaving patches of the image (and in a few cases the entire image) smoothed to a detail-less smear.SONY HAS RECIEVED MANY COMPLAINTS ABOUT THESE DESIGN DEFECTS BUT WILL NOT ACKNOWLDGE A PROBLEM LET ALONE ISSUE A FIRMWARE FIXOther thoughts-good battery lifeGPS works, seems to be slownice to have manual focus, manual zoom just controls the electronic zoom.I have owned it for about a month so I have no info on dependabilityBottom line, this camera produces better images than similarly priced canon and nikon cameras.  The new Panasonic fz150 appears to be capable of better image quality without the above mentioned \"big issues\", has a hot shoe and raw output, but is not as good re: focus speed or accuracy and color balance. Given this, I would have probably bought the Panasonic if I had it to do over.", "Date": "October 9, 2011"}, {"Title": "Finally, A Fun Camera with Everything", "Author": "Fred \"mrdata22\"", "ReviewID": "R3IZG0RN172KK", "Overall": "5.0", "Content": "Waited for years for camera manufacturers to make this camera with the features included.  Each generation of all camera brands lacked all of the features I wanted, such as 10 MP, live view, flip-down LCD (not swing-out), super zoom of 15x or more, image stabilization, easy to use auto-intelligence setting (for when I want a fast shot, e.g., for fast kids, dogs, birds, etc.), manual control settings available, ability to turn an on/off grid on display (for us who is composition challenged), long battery life, variety of charging options, and inexpensive memory cards.  The Sony HX100 can use several different types of cards, e.g., SD, SDHC, etc.Finally, after years of waiting and watching manufacturers getting closer to my \"want list,\" suddenly the Sony HX100 comes out and has all the features I want and then some.  Besides having all the features above, this camera comes with a hard copy  \"printed user manual,\" plus user manual on C, online  and built into the cameras menu system. Included in the box is an NP-50H (H series) \"Action Force\" battery, 6.8 volts, 870mAh battery and cable so you can charge the camera directly without taking the battery out.  I prefer charging outside the camera, so I easily found a second NP-50H \"Action Force\" battery online, rated at 900mAh (even better) and it works perfectly. Then, I also easily found a \"travel battery\" charger for the H series or NP-50H battery, which will work with either the 870mAh or 900mAh battery. It works perfectly too.As it comes, the HX100 comes with several cables. One cable for attaching the camera to a HD television to display your photos directly from the camera. Another cable for charging the camera with the battery still inside, or for downloading photos.  Here again, I prefer to use a multi-memory card reader attached to my PC, instead of downloading directly from the camera  (just my preference). I have used multi-memory card readers made by Transcend, HP or Kingston, just to name a couple that work very well.  I also bought a Transcend 12gb SDHC memory card for this Sony.  Works great.Additional info: - In camera charge takes 100 minutes - Shots per charge: 410 using the LCD or 440 shots using the viewfinder. - Very easy to use, with help advice available in the camera menu to help  you take better Photos. - Easy menu system. - CD comes with User Guide, Picture Browser Guide software (to catalog and  tweak all images on your PC). - Picture quality: Images tack sharp and great color. - Low light photos are excellent too, even without using the cameras  night time scene settings.In summary, yes, DSLR cameras are going to take superior quality photos compared to non-DSLR cameras.  However, this camera comes close and has the DSLR's beat because it is smaller, lighter, and has just one lens that does it all compared to my DSLR which requires a backpack to carry all the lenses.  I know.  I have one of those too.  I enjoyed what one reviewer said \"The Sony HX100 puts the fun back into photography.\"  I totally agree.", "Date": "August 7, 2011"}, {"Title": "Great Zoom, definitely need Fireware Update to Fix Bugs", "Author": "L. Wong \"Hollywood Legend\"", "ReviewID": "R4QU2UQCAXTTK", "Overall": "4.0", "Content": "Pros:  30X Zoom  shoot Panorama  3D is a plus  Focus is very good  Manual Focus Ring  10 FPS Burst  Best HD Movie Cam  Battery.  Shot over 1000 pictures, still have batteryCons:  Processing Times. You need to wait after each picture taken.  *Definitely a big problem, Sony need to come out with a Firmware to Fix this ASAP  No Macro Button, very Strange", "Date": "July 12, 2011"}, {"Title": "DSLR's Baby Brother", "Author": "Neiklot", "ReviewID": "R2PDWAVSTXD0ZC", "Overall": "5.0", "Content": "I've had the Sony Cyber-Shot DSC-HX100V for a solid week now and I can confirm that this has been a very good buy! Coming from a Canon SD4000IS Point and Shoot I was looking to upgrade to a advanced consumer level product and this delivers on all ends! I was contemplating on the the HX100V and the NEX-5, yes I know they are two different classes all together but I was contemplating on whether I would truely utilize the prosumer product that is the NEX-5. What ultimately got me to get the HX100 over the NEX is the fact that I wouldn't be utilizing the NEX to it's fullest potential and didn't want the hassle of having to get multiple lenses for different scenarios. For those who are avid travelers will understand this dilemma!Granted the price difference alone may have been a factor I can truely say that for those who what to step up from a standard Point and Shoot camera to a more advanced featured watered down DSLR you won't regret getting the HX100! For those individuals looking to get the HQ images produced by top of the line DSLR or Micro 4/3 cameras you'll be disappointed. This camera is made for those who are wanting to have the customization of a DSLR but watered down to cater to those coming from a point and shoot. For the price point this is a great buy!", "Date": "May 25, 2011"}, {"Title": "Some significant minuses", "Author": "Oldanalyst", "ReviewID": "R187Q8P4A3P3VQ", "Overall": "3.0", "Content": "The large zoom range and the fast shutter speed sold me on the HX100. I purchased it and immediately took pictures to test the various features. It was fall around here and the leaves had started turning colors and we had some beautiful weather. So I was able to test most of the features of the camera. I was pleased with the ease of use. I was able to get excellent pictures of most anything in bright sunlight. The panorama features worked well although it has some drawbacks. You can get a better picture by using software to merge pictures. You have more control over the pictures size by doing this.The color rendition was quite good and the lens stabilization even at high zoom worked well. The lens is not real sharp at the maximum zoom but this is not surprising. There are not many negatives of most of the functions of the camera. I suspect most people would be happy with this camera.I was able to take a number of videos with the camera and they all turned out to be quite good. The sound was fine and the pictures were quite sharp. The only problem was that the camera did not always maintain the correct white balance indoors which made color a bit off at times. But generally, I was pleased with the video quality.However, I returned the HX100V and purchased a Panasonic FZ150. I did so mainly because of a few features that I did not like or that I missed having. In indoor shots I took, I had a lot of trouble getting the camera to correctly handle white balance. This produced some off colors. I also missed being able to record in RAW mode. A couple of my outdoor shots would have benefited greatly from having recorded them in RAW mode. I am aware that many people do not use RAW mode so this would be a non-problem for them. Also, for some reason, I missed that this camera does not accept screw in filters. This means that you can not use a UV filter (probably to avoid lens scratching) nor can you use a polarizing filter. I have read that there is an attachment available for filters but that it is hard to find.Two rather irritating (to me) features were not photographic. The lack of an external charging device for the battery is strange. It would seem that it is less expensive to provide an external charger rather than supply the clumsy cords for the internal charger. The second irritating feature is the lack of a reasonable users manual. Supplying it in multiple file HTML format on a DVD is no substitute for a reasonable manual. Supplying it in PDF format would at least allow you a way to relatively easily print out any parts of the manual you want to keep handy.From my perspective, the camera would be given 3 stars but if you do not find those features I disliked to be of interest to you, then the rating would go up to 4 stars. I was quite pleased with the Panasonic FZ150 I bought as a replacement and I reviewed this camera elsewhere.", "Date": "November 10, 2011"}, {"Title": "Sony Cybershot DSC-HX100V is an outstanding camera!", "Author": "F. Genao \"Lisandro Genao\"", "ReviewID": "RC7FOLRE84K2H", "Overall": "5.0", "Content": "I have always wanted to buy a DSLR camera until I found out about this new line of bridge cameras. It's a crossover between point and shoot and DSLR. Looks like a DSLR but cost like a top of the line point and shoot with a lot more versatility, incredible zoom, and no extra expensive lens attachments to buy. So I have been doing some research for a few months now and have been putting my focus on the this Sony and also on a Panasonic DMC-FZ100 which in particular I think is also a beautiful camera. Personally I chose the Sony because it's a 16.2mp vs 14.1mp on the Panasonic, 30x zoom vs 24x for the Panasonic and last but not least Sony has the best Optical Image Stabilizer in the business. It has an active image stabilizer than uses 3 different ways to eliminate camera movement. These where the main features than made me choose the Sony. Also, for years the brand has never let me down. The Panasonic has a slightly wider lens and shoots 11fps in burst mode as opposed to 10fps for the Sony. Which means the Panasonic will take 11 pictures in one second in burst mode and the Sony will take 10 pictures in one second in burst mode. That is definitely not a big deal for me. The HX100V is absolutely fabulous! The pictures are crystal clear. The camera has a feature for low light picture taking that snaps several pictures automatically and according to the amount of ambient light. It then combines all of the pictures into one low light crystal clear picture. With virtually no picture noise also known as grain. I read a one star review that another member gave this Sony. I hope he did not return his camera as of yet because these are pretty hard to get right now. He was complaining that the camera did not have a feature to disable the picture preview after you snap a shot and that you would basically have to wait for the preview to finish before the LCD became available for the next picture. Well my friend all you simply have to do is press the shutter button half way and the LCD and camera become available instantaneously for you! I believe the camera gives you a preview of about 2 seconds which is definitely not a long time but if it is than in 1/8, 1/4 or 1/2 of a second press the shutter button half way and immediately the the preview is off and and the camera is ready and focused for your next picture. Just because the camera is showing you a preview of the picture you just took doesn't mean you have to wait for it to finish to shoot your next pic. I have not even read the user guide, I just used common sense. If you already own this camera try it. If you are considering to buy this camera don't let one persons opinion prevent your from buying this awesome camera. The video is spectacular! It records video at full HD resolution, 1920 x 1080 @ 60 progressive fps and records this resolution onto the memory card @ 28Mbps. The next step up from that is 3D-HD. In burst mode the camera takes 10 consecutive pics in one second, no delay, no lag time, no preview. After it takes the pictures it takes a couple of seconds to record the pictures that were just taken. I purchased my camera @ Bestbuy on 62nd Street and Broadway in NYC for $399. It was the last one in stock and I was getting the run around from the sales rep. He kept telling me that it was already sold but the system was showing one in stock. Well the store manager took care of that! I think the rep was holding it for himself. Good luck guys and enjoy your purchase.", "Date": "June 22, 2011"}, {"Title": "Best Bridge Camera Yet!", "Author": "RJGUY", "ReviewID": "RR20RL0NRWW1U", "Overall": "5.0", "Content": "I've had this camera for a month now and continue to marvel at it's versatility. Prior to this I had the original HX1, and a Sony 100 & 300 DSLR. I love the DSLRs but due to their size they don't travel as well as the smaller bridge cameras. I've owned the Sony Nex 3, which I sold as I couldn't get along w/o a viewfinder. When you buy the HX100V you do give up some of the sharpness of the DSLR lenes, but for the average photographer you're not going to notice a difference, as long as you don't need RAW picture files, which the HX100 doesn't do.What it does do very, very well is to take excellent pictures in all lighting conditions including low light w/o a tripod. Add to this some fun options like defocusing the background and the adjustable view screen are only but a few of it's advantages. Rememmber the last time you were at the beach and you were trying to take some pictures - typically you can't see anything on the view screen in direct sunlight. But, the HX100 has a super viewfinder that automatically turns off the LCD screen as you look into the viewfinder!You can go from full auto to many manual settings - so there are ample opportunities to become creative with this camera.Now, one of my favorite things about this camera is that I no longer have to carry my Panasonic TM700 camcorder. I purchassed that camcorder about a year ago due to it's ability to take 1080P at 60 fpm, and with one of the best optical image stablizations systems available. No more jumpy videos with the Panasonic. But wait, the HX100V has the same type of optical stablization and shoots in AVCH Hi Def video at 1080P 60 fpm just like the Panasonic! Shoot perfect videos in beautiful color w/o video that gives you a headach to watch. It's super! You can even begin walking with the video running and you'll notice it adjusts for this movement as it goes into it's highest stablization setting automatically. My Panasonics is for sale and I couldn't be happier with the Sony. And oh yes - it even has Geo tagging, so you'll always know where you were when you shot that great video and took those fantastic pictures. I think you will enjoy yours as much as I enjoy mine.", "Date": "August 5, 2011"}, {"Title": "Very awesome camera", "Author": "Arrowcatcher", "ReviewID": "R1XFRRB2LRZFDU", "Overall": "5.0", "Content": "I have a DSLR with three lenses and have owned several \"superzoom\" cameras from Sony, Canon, and Olympus.  This new Sony model is a performance standout.  I won't duplicate longer reviews here, but here are a few highlights for me:1. Truly wonderful optics.  Little or no chromatic aberration - best I've ever seen in a superzoom. The telephoto performance has jaw dropping resolution.  I've taken some amazing shots with it.  With the long zoom it's almost like a spy camera.2. Very responsive - focus, flash in particular.  I've never seen such zippy picture setups.  It rivals my DSLR in this way.3. Love the exposure bracketing feature and use it all the time set for .7 EV.  A super function.4. Outstanding low light performance.  I've taken some amazing low light level shots - all hand held too.  There are some \"SCN\" features to help with this.  You won't believe what you can do.  It can do intelligent image stacking, all automatically.5. The auto HDR (High Dynamic Range) features are amazing and unique.  There's no match for this on any competing product.  This feature is the reason I bought this camera right when it became available.This is certainly the most advanced camera I've ever touched, given the auto HDR features.  It's in a class by itself.  I've already recommended it to friends, and one has bought it from Amazon for a gift.", "Date": "July 13, 2011"}, {"Title": "Lives up to my high expectations", "Author": "Karen L. Hope", "ReviewID": "R3D49XTES9322Y", "Overall": "5.0", "Content": "I'm not going to write out a detailed review as I haven't yet had it quite long enough to try out all the amazing features and settings, but I will say this: so far (having used it continuously for a week) I absolutely love it.  I have been looking to get a new camera and upgrade from my 3-year-old $150 pocket-sized Canon for awhile now.  I have spent countless hours over the last 6+ months researching all the latest and greatest.  I knew I wasn't up (experience- or price-wise) for a DSLR but wanted a REALLY good point and shoot.  I initially went with the Nikon P100 last year until I ended up perhaps purchasing a lemon and had it lock up on me within the first hour of testing it out.  Back to the store it went after I read other reviewers having the same issue.  Then I came upon Sony's HX1, which got rave reviews but I didn't really want a camera that was a couple years old.  So I decided to wait.After the holidays I began reading about the HX100 and prayed it was going to live up to all I hoped it would be.  I waited for it to be released and then waited for reviews.  Although there are virtually no professional reviews posted (that I could find anyway), I tried to read every review I could find by the few people who got their hands on one... and thankfully I was impressed enough to give it a shot.I ordered it through Best Buy and had it shipped to the store for free.  And I am so, so impressed with this camera.  So far I have only had it on \"auto\" and it has taken the most gorgeous photos.  I can only imagine they'd only get better as I play around with the settings.  I also took a couple videos of my daughter and they looked and sounded amazing.  I tried several macro shots and they turned out just beautifully.  Even my husband (who is the last one to ever put his hands on a camera -- it's always me) wanted to use it today at the zoo.  It's an easy feel in the hands and there are so many features that it becomes actually fun for him to use.  He was shocked, as I was, to see how vivid and clear the photos were on the screen.Again - I have a LOT to test out with the camera, but I just wanted to add another review.  When I was doing all my research I really appreciated every time someone took time to post one.  I don't hesitate for a moment to highly recommend this camera!", "Date": "June 12, 2011"}, {"Title": "Who needs a DSLR when you have this?", "Author": "E.Garten \"E.Garten\"", "ReviewID": "R1WI3TPMNOHWFW", "Overall": "5.0", "Content": "I have owned several Canon DSLR cameras as well as pocket cameras from almost all brands. I also own a Full HD Panasonic Camcorder. Since I bought this Sony camera I realized I don't need anything else. This is an amazing camera that packs all the needed features for those who like shooting stills or videos without the hassle of carrying around large and heavy bags with lens and other accessories. The picture quality in daylight is fantastic. The ultra high zoom is more than what you will need for any situation and the fact you get it all in a small, compact and fun to hold form factor is a winning combination (even if you cannot do certain extreme things a professional DSLR will let you that you can always get close to with editing software).PROS:- Excellent feature set packed into a small compact camera.- 30x optical zoom - who needs more than that- High resolution screen with tilt- Sharp, vivid still pictures- Excellent full HD 1920x1080p video with optical zoom while filming- User friendly controls and on-screen menu- burst mode allows 10 consecutive shots with one press - great for fast moving scenesCONS:- Shooting video in low light may result with soft colors that will require tweaking your player color controls- Lens cap strap must be used with the camera neck strap. Why can't Sony add a ring to secure lens cap directly to body?- No ability to add UV filter to lens for protecting it- Charger that comes with the kit is not compact enough. I had to buy an OEM one that sticks directly to the wall with no wiresOverall one of the best cameras I have owned. If you are looking for ways to take excellent stills and videos while keeping zoom capabilities you have with interchangble lens cameras - this is the one!!! It is small enough to carry all the time (I reccomend the small low pro camera cases) but powerful enough in terms of features, zoom and battery life to rely on for serious trips and events.While I have several tips for improving it - I am giving it five stars due to performance and bang for the buck. You get so much for such a low price that anything less than five stars will be unfair", "Date": "November 27, 2011"}, {"Title": "Camera is great, but amazon's price is RIDICULOUS!", "Author": "John Abraham \"John Abraham\"", "ReviewID": "R3CZARD8TKHRAR", "Overall": "5.0", "Content": "After contacting Amazon by e-mail, chat, and phone, I could not convince them that their price is wrong, even though Sony is selling this product for $100 cheaper. I was forced to buy this product from Crutchfield and I am VERY happy with the camera. The video quality is absolutely amazing for this price range. Pictures are great and the zoom is awesome. The video stabilization is the best I have ever seen. Even when zoomed to the full 30x, the stabilization keeps the pictures sharp and the video is stunningly smooth even zoomed in that far. Look no further is you want a super zoom is good quality, because this camera will exceed your expectations.Pros---Excellent video quality-Good pictures-Top notch stabilization-Great feature set-Sturdy body and build qualityCons---Lens wobbles a bit(typical with super-zooms)-Picture quality has room to improve-No built in lens capAMAZON NEEDS TO FIX THE PRICE ON THIS PRODUCT!", "Date": "July 13, 2011"}, {"Title": "Great Super Zoom from Sony", "Author": "MERTMAG \"mertmag\"", "ReviewID": "RSGYRLTJ5FIRH", "Overall": "4.0", "Content": "I really like this camera. I did have to return the first one due to a over exposure problem but with Amazon it was painless. Having said that I must say for a point and shoot with an almost ridiculous focal length it is excellent. The hand held shots are amazing considering that the optical zoom extends to 30x and 122x with digital. My shaky old hand can even get a shot without blur. The menus almost do too much and are a bit overwhelming at first it really is not bad considering the quality at high ISO and the lack of CA at the extremes the lens shoots at. If you want to see the difference in image quality at cameralabs.com where you can compare it against other super zooms. I wish it would shoot in raw but it is after all a point and shoot not a DSLR and anyone who tries to compare it to one is being ridiculous. You can set several custom profiles and return to them with a few presses of the buttons. The video is really amazing and the focus tracks well in good light. In poor light it does hunt a bit and that is the only reason I gave it 4 not five stars. You can try to nit pick it to death but over all it is a fine camera as long as you take the time to learn how to use it. See the images I included that are hand held shot is a dark room with the flash and zoomed to 30x and one outside zoomed to 122x with the digital zoom. Also hand held. They are a testament to the anti-shake lens.", "Date": "September 28, 2011"}, {"Title": "So close, yet...", "Author": "h0ping", "ReviewID": "R2UJF53CQJIB1D", "Overall": "3.0", "Content": "I was so excited to get this camera.  I'm not an ultimate photographer, but I like to play one on the weekend.  This camera takes great pictures.  This zoom is excellent and the colors quality is equally impressive.  Now to the reason I only gave it 3-star and ultimately returned it... the burst mode.  I take a large majority of my pictures in burst mode.  This camera stalls to record the images at the end of every burst set taken.  Beyond that, it only takes a minimal amount of burst images. If you don't use this feature, then you will love the camera.  If you do, you wont.  Just my two-cents.", "Date": "October 19, 2011"}, {"Title": "One step above the rest", "Author": "Gross Benjamin \"Benny G.\"", "ReviewID": "R1KOW7G89L3MVS", "Overall": "5.0", "Content": "Six months ago I purchased the Canon Sx30 SI The Camera provided images at medium quality The difficulty was mainly in video and photography in a poor lighting conditions. Difficulty maintaining focus and slow reaction. I sold my camera and I purchased  Panasonic FZ100 Results in similar quality I returned the camera to the store Today when I have a  Sony HX100V I finally can enjoy.I Have The camera a few days by now. I do not stop to admire her abilitiesSharp images, rich colors and a very strong flashExcellent video - webcam clear and in focus even in difficult conditionsMuch better capabilities than the Fuji hs20 Fuji, Panasonic fz100, and Cannon sx30isWeaknesses:Screen inferior to that of Canon and PanasonicInability to connect an external flashInability to connect filterStrengths:All parameters", "Date": "July 1, 2011"}, {"Title": "Wonderful SLR like Hybrid Camera", "Author": "Alin S. Steglinski", "ReviewID": "RV9VPP5RXRQA9", "Overall": "5.0", "Content": "I bought this on November 17, 2011 so I have had this bad boy for a long enough time to really know it and take a lot of photos with it.This camera was the successor to my Panasonic Lumix DMC-FZ5Panasonic Lumix DMC-FZ35 12.1MP Digital Camera with 18x POWER Optical Image Stabilized Zoom and 2.7 inch LCDSo let's get started with the review.POWER - Like all electronics Power is necessary, and so are a necessary evil. Batteries. I found the battery that came with the camera to be quite good in terms of quality and life but if you are an active shooter who does not get around to a charger extremely often or forgets to charge then you will want to buy extra batteries and an external charger. This camera can either use externally charged batteries or you can charge one in the camera and use it at the same time with the included AC adapter, the AC adapter is extremely useful and is a welcome addition to my suitcase when traveling as whenever you are near an outlet you can juice it up or even shoot video or photos without touching the internal battery. This is great for when you are filming from a tripod and are not moving around much and are near an outlet, same goes for when you are shooting pictures from a tripod and not moving much.BUILD QUALITY - The camera is solid feeling and has a very durable look to it, the finish is not a shiny finish that will scratch, it is a dull finish for the camera body with speckles, almost texturized. I find this to be very welcome in my equipment. The lens has a shiny finish around the ring for zoom and focus which look's like it would get scratched ugly instantly yet I have had mine for over a year and put it to hell and back and still no scratches. The zoom / focus ring its self has some small scratches but that's the hard knock life my camera's live. The articulating screen is welcomed by me as it is not flimsy and is very solid on this camera, unlike some other camera's that I have tried. This screen is something I am not totally going to panic if I drop the camera. The lens and optics even when dirty produce the same quality images.IMAGE QUALITY - This camera produces stellar images all around, even in the pitch black of night time photographing the moon at 120x digital zoom came out very smooth with a minimal effect of image fringing which is common in digital zoom! This camera produces wonderful HDR stills with no Photoshop Required, just select Backlight Correction HDR, shoot the picture, and wait about 5 seconds and the screen pops out a HDR image! I really love working with this cameraVIDEO QUALITY - This camera produces wonderful HD video but there is only one kick in the teeth, you are limited to 30 minutes per video segment, and then you lose 5 seconds while it closes the file on the memory card, then you can tap record again. Annoying but otherwise okay. It is a camera, no one said this is a Camcorder. If you plan on shooting a lot of video where time is crucial then consider a Camcorder.Professional quality camera without the Professional price and need of being a professional to run it. And if you are a pro then you will appreciate this camera's manual focus and manual setting mode as you can go from a full auto into a SLR-like experience at the flip of a switch.Overall this camera beats every other super zoom camera I have tried hands down.If you are on the fence about buying this camera for photography get off the fence and get in the door and buy it.If you are on the fence about buying it for video, think again and consider a Camcorder.", "Date": "August 3, 2012"}, {"Title": "EXCELLENT", "Author": "Snowman", "ReviewID": "R2RVNH51Y19NI7", "Overall": "5.0", "Content": "My wife bought this camera based on features and reputation, And I was completely impressed.  My inlaws have a Nikon L120 that is less then 1 year old and they are looking replace their Nikon with this camera instead.  My family and I just returned from Walt Disney World and my pictures were amazing without touch up, and between the features and the picture quality, I would reccommend this camera to anyone time and time again.  Also the sony software was easy to use, I just had to download the patch to use it with windows XP.", "Date": "November 19, 2011"}, {"Title": "Best Superzoom I Have Ever Used", "Author": "Brian", "ReviewID": "R3U8U9LZL12312", "Overall": "5.0", "Content": "This is an amazing small sensor camera. I am pleasantly surprised at the quality images that this camera produces.The Carl Zeiss lens is amazing.. for covering such a large range it has surprising low amounts of distortion and aberrations.Despite what I read elsewhere, the images seem to be holding up very well to pixel peeping, though you will not get the same level of detail you would get with a DSLR but unless you are going to print very large(above 8x10) prints, I doubt you will notice much of a difference.The twilight handheld mode is great. It takes 3 shots and combines them to reduce noise(since noise moves it can take the best pixels of the three shots and use it) and even works with a moving object by using one of the pics for the moving subject and then combining the other 3 to reduce noise in the surroundings.Takes HD video with stereo sound.Takes up to 10 frames per second... drawback is, once the buffer is full you will be waiting 10 seconds before you are ready to go again.Battery life is rated at 400 pictures(with the GPS turned off) and it will get at least that many. It doesn't come with a separate charger so you plug the camera in to charge the battery but there are many aftermarket chargers and batteries that are very inexpensive.You don't have to switch to \"macro mode\", in just about any mode, the lens can focus as close as a half inch.Some people report \"soft\" pictures but I just changed the sharpness from STD to HIGH and the images are very sharp.If you are ready to step up from a point and shoot but do not what the hassle or expense of multiple lenses, this is the best superzoom bridge camera on the market that I have used and I have used and/or tested many of them.", "Date": "November 15, 2011"}, {"Title": "Probably the best camera for the money", "Author": "cartographer", "ReviewID": "RQ4J7LAWF4UQ8", "Overall": "5.0", "Content": "I was getting tired of switching lenses on my Nikon D80, and couldn't find the focal length or the zoom that I wanted within a reasonable price range.  For the price of a decent macro lens, I found this camera offered macro, zoom, and everything in between for a small fraction of what upgraded my D80 would cost to make the same transition.  SLRs may give you more customizability of lighting and color once you hit the world of Photoshop, I want to be able to be able to see what I'm going to get right up front, and manage the color and lighting when I take a picture.  And if you take wildlife photography, having a good fast lens that offers zoom is a big plus.  I could spend $12,000 on such a lens. When you pay $400 why would you?  And as an added bonus you get HD video.  The only thing missing is a lighting shoe for a larger flash.  But given it does ISO 3200 fairly well, that's not bad for what you get for the money.  I even took the sharpest picture of the moon I ever could take, which was never possible with my $600 VR lens on my Nikon.  My only qualm is the default video format doesn't work directly on a Mac, and I had to buy a $40 video conversion software to make it fully Mac compatible.", "Date": "September 22, 2011"}, {"Title": "A must to buy !", "Author": "Constanzo", "ReviewID": "RNCSVZP6QJFBY", "Overall": "5.0", "Content": "I am the sort of person who looks for reviews, tests on the net before deciding what to buy. I have owned a Canon SX10-IS for two years and I was wondering if changing for the Sony DSC-HX100V would be worth... I also have two Canon 40D Digital SLR and two Pro series L lenses for more serious shootings (freelance photographer from time to time). So I think I can tell what a good quality picture is.I needed a light, versatile photo-video camera for any travel or family souvenirs. Well if you are looking for an excellent quality picture camera with a huge zoom and some gimmicks or functionalities (smile detection, panorama views, GPS...) this is THE ONE. I do not regret at all my older SX-10 IS which is so old-fashioned now...Videos are tremendous.Just one negative point : the superb screen could be more protected (this is where Canon is better with its 360° articulated LCD screen).For the rest, the Sony DSC-HX 00V is above everything in its class. A must.", "Date": "August 16, 2011"}, {"Title": "No better purchase on sight...!!!", "Author": "aaanouel", "ReviewID": "R2KDP3PL3J9IRH", "Overall": "5.0", "Content": "Sony Cyber-Shot DSC-HX100 is actually the best Bridge Camera on the market, no kidding.Almost a professional camera it usurp their territory making PRO Quality HiDef clear and crispy shots (16MP).30X Zoom plus Digital Zoom take you to the smallest details. Optical Image Stabilization is excellent.All-in-One Camera no need to be carrying a lot of stuff, lenses, etc.As easy and automated, or as complex and manual, as you'd like to use it (or your family).Very completed camera with a lot of good features, much more than you can imagine.There's no better bridge camera to date*!!!* Not even Canon IX30IS, really.", "Date": "July 5, 2011"}, {"Title": "Great camera!", "Author": "Toy Lover", "ReviewID": "R161JHQXRM0D60", "Overall": "5.0", "Content": "I bought this camera as an upgrade to the Cannon Elph I had been using.  (Got it at Best Buy with a 10% off coupon)  I debated spending a bit more for a DSLR, but given the fact that I am only a novice photographer and don't have the skill level to use all the features/lenses of a DSLR, this seemed like a good compromise.  I've owned this camera for about 3 weeks now and have been very pleased with it.  I've primarily used the auto settings and have taken some amazing photos.  Outdoor shots in particular look quite professional.  I especially love the background defocus option.  Even my 14 year old daughter has taken professional looking photos with this camera.  I've taken a number of photos of my kids running around in the yard, playing ball, etc. and in most every case, the photo has turned out nice and clear, even with the action involved.  I have had a bit more trouble getting high quality, sharp images indoors in low light, but I'm still playing around with the settings and I chalk it up to user error more than camera quality.  Let me be clear that the pictures are still very good, just not AS incredible as outdoor shots in good lighting (which I'm guessing may be true of any camera until you really know how to use it.)  I have been reading posts on dpreview and beginning to educate myself on Fstop, ISO, aperature, etc.  I think with a bit more knowledge of these settings, I will be able to tweak things and produce the results I'm looking for in all situations.  For a newbie like me this is definitely a great camera.  I look forward to learning how to use more of the settings/features, but in the meantime, it makes it very easy to take great shots just using the auto/intelligent auto setting.  Some of the other reviews are much more specific and probably more helpful, but just wanted to add my two cents.  I would definitely recommend this camera!Only con so far is the lack of a manual that comes in printed form, or is easily printed from a computer, and the fact that I scratched my view screen on our first outing with the camera.  I think it might have been scratched by the zipper on the camera case as I was removing it from the bag.  The screen definitely needs a protective layer on it as it easily accumulates fingerprints, and is easily scratched.", "Date": "June 24, 2011"}, {"Title": "Sony HX100V  Love it so far", "Author": "Renee", "ReviewID": "RRVKT0XWINO82", "Overall": "5.0", "Content": "Originally pre-ordered this Camera from Amazon in February.  After reading the discussions on the camera I canceled my Amazon order and purchased this Camera on Best Buy com on the 17th of May with in store delivery (I picked the camera up yesterday 5/21).  I haven't had a lot of time to play with it, but this evening I took 81 pictures.  The HX100V takes great photos and if you use the two automatic settings it couldn't be easier. I've been using a Sony H9 (15x zoom)and decided I wanted the 30x zoom feature; which by the way is awesome. I would recommend this camera to anyone that has a desire for something better than a point and shoot, but doesn't want to get a digital SLR.", "Date": "May 22, 2011"}, {"Title": "Great camera...too bad Sony doesn't help the average photographer!", "Author": "Larry D \"PC Larry\"", "ReviewID": "R1MG09GDMU1QJN", "Overall": "4.0", "Content": "Geez, Sony!!!  You make a great camera and don't help the person taking photos how to work with it and make their experience better.There are SO MANY options and features, Sony just doesn't tell you how to use them.  Their manual is on-line only (except for the in-camera manual..ha).  On top of that, you can't even download it into a PDF or printable object.  You find the feature you want, then have to print that page only.  That's lousy.I've had a Sony H5 for the past five years and loved it.  I only upgraded to get HD video and better burst mode, better everything.  Don't get me wrong.  I love the camera.  It's just that some features are there...in the camera.  But when I want to find out more about it, the manual just tells you how to find it in the camera.  Not what it will do for you.For example, using the new Intelligent mode, it shows an icon when Macro is being used.  Now try finding anything in their manual abut Macro.....none....zero....nothing!  That's amazing.So I am not mocking the camera.  It's really cool.  But don't expect much help from Sony and their manual.  I happen to be one of those people that every so often, I looked in my H5 manual to see more options when I have an unusual photo op.  Maybe I'll get used to it.  I will eventually get to know the features by trial and error, I guess.There are hundreds of positives.  One of the few negatives:  No ability to add a filter over lens, because they didn't put screwable mount on front.  Visible features display is a bit much....too many icons.  HD movies are cool, but you need to use Sony software (provided) to get them out of the camera onto your pc so you can convert to WMV or whatever else.  I ended up going for the MP4 mode so I can copy directly into my Cyberlink Power Director software.  It's still HD and nice.  Also you can shoot a photo while video making....can't do that with my H5.Overall, I would recommend this camera.  It's loaded with features....just be ready to figure things out on your own.", "Date": "June 25, 2011"}, {"Title": "Great!!", "Author": "The Bird", "ReviewID": "R29JLZ3IQCROAL", "Overall": "5.0", "Content": "The HX100V is all that I need when I'm out on my kayak, It's good for all my close ups and nature filming.I am not a camera person don't know to much about taking pictures but this camera works for me.", "Date": "December 1, 2011"}, {"Title": "Sony DSC-HX100V - Even better than expected!", "Author": "RickNY", "ReviewID": "R3M4IODN39NCFL", "Overall": "5.0", "Content": "I bought the Sony DSC-HX100V before going on a trip to Italy.  I wanted something better than the usual sub-compact camera, but not as large, heavy and expensive as a full-blown SLR.  The Sony fit the bill.First of all, there is the lens.  At a 30x zoom, it beats any zoom you can get on an expensive SLR (or SLR-like) camera.  Of course, with an SLR you can choose to have multiple lenses that can cover any range of magnification, but that means carrying a lot of VERY EXPENSIVE, and heavy equipment.  If you are on a professional photo-shoot, that is fine, but for the casual leisure time photographer it would be a burden.The Sony has more features than you can imagine.  Besides all the usual scenes and modes, it has some unique characteristics, that are truly useful, not just hype.  The most amazing is its ability to overcome some of the limitations of the sensor.  While the Sony CMOS sensor is quite good for this class of camera, it is not the equal of an SLR's a larger, more sensitive sensor.  The Backlight Correction and Superior Auto modes, do a fantastic job of real-time correction for lighting conditions.  The camera automatically takes up to 6 shots, and combines them to correct lighting, and improve low light noise performance.Another incredible feature is the iSweep Panorama mode.  With one press of the shutter, the camera lets you pan the scene, and automatically takes as many pictures as needed, then links them together perfectly.  No need to manually stitch them together yourself.There are so many other features, such as built-in GPS, Anti-Blink, Anti-Motion Blur, Smile and Face Detection, etc. that are too numerous to describe.  All this at a very reasonable price.  I highly recommend the Sony DCS-HX100V.", "Date": "November 21, 2011"}, {"Title": "A Beginner's Point of View", "Author": ":D", "ReviewID": "R18S1QKRWH468S", "Overall": "5.0", "Content": "My first--and only--camera was a Sony DSC W530 from 2006. I started shopping around for a camera that did what I wanted. I wanted a camera that did the following things:a) was easy to useb) took good photosc) allowed me to learn about photography while still in my comfort zoneI looked at getting a Nikon P500 and an entry-level DSLR but eventually this one, that I stumbled on by mistake, was the winner.This camera does everything I wanted and MORE. I would even venture to say that it's better than the Nikon D3100 that I looked at simply because it's simple to use and can do a lot of things that the DSLR could not. The manual mode is very straight-forward and the controls are all very intuitive. The in-camera guide is the most useful thing that I've ever experienced--no sifting through the index to figure out how to do something! This camera takes excellent photos and has already gotten me interested in photography. I love that the zoom on the lens functions as the manual focus when you choose to put it in that mode. It's just a great camera all around and I recommend it for any budding photographer!", "Date": "October 24, 2011"}, {"Title": "Excellent Bridge Camera", "Author": "B. Scott", "ReviewID": "RQCP2NRPFCS5N", "Overall": "4.0", "Content": "I picked this up to use when I don't want to carry around my DSLR. I have had this camera for about a month now, here are my initial impressions.The Good:Power up timeFocus timeVarious shooting modes, including HDR and handheld nightPicture quality and color is very goodDisplay is excellent and turns off when you look through the EVFBattery lifeThe Not So Good:No external battery charger, but I knew that when I bought itPictures can get a bit noisy at times, low lightLens cap, but I think I'm getting use to thatOverall an excellent camera that I am having a lot of fun with!", "Date": "October 23, 2011"}, {"Title": "Great camera", "Author": "CAWireless", "ReviewID": "R2E2B1B14ZD0CD", "Overall": "5.0", "Content": "I've had this camera for a few weeks now, and I have to say that I love it. This is somewhat surprising, as I was never much of a fan of superzoom cameras (they don't have the pocketability of a Canon S95 nor the picture quality of a DSLR). I purchased my first Sony camera (a DSC-TX9) not too long ago and was impressed overall, so I was happy to consider another Sony (we were a longtime Canon household but our Rebel T3i just wasn't getting a lot of use because it was so bulky). Due to the limited zoom capabilities of the TX9, I decided to spring for the HX100V based on the many good reviews on Amazon. I had a chance to give the camera an extensive workout on a recent vacation to Hawaii. Photos were taken primarily on auto (I am very much the non-serious recreational shooter), and in a variety of lighting settings. Overall, the camera passed with flying colors.Although it is definitely not a shirt-pocket camera, it is still much lighter than a full DSLR and wasn't a pain to carry around in a backpack with other gear. Startup time is quick, and all the menu controls are quite intuitive. The 30x zoom range is a marvel. There are other superzooms that have a wider zoom range, but there was really nothing that I couldn't capture with this, so it was a non-issue for me.Pros:30x optical zoom!Very little shutter lag (I was able to catch action shots easily)Beautiful LCDHaving a built-in GPS is pretty handy if you do a lot of travel photographyPanorama mode is a lot of funGreat image quality on auto setting (you can probably get even better results if you are handy with manual settings)Best video quality I've seen in a non-DSLR cameraLight for its sizeOne-touch video button on the back of the cameraCons:The one-touch video button is slow to start recording (you'll miss at least 4-5 seconds after pressing it)The LCD gets washed out in bright lightThe lens cap is fairly flimsy and falls off easilyOverall, despite some initial misgivings about getting a superzoom, I'm very happy that I bought the HX100V and highly recommend it for anyone looking for a great travel camera. As an added bonus, I can now ditch having to carry a separate camcorder for most events - the video on this camera is that good.", "Date": "September 4, 2011"}, {"Title": "One of the BEST Superzoom Cameras", "Author": "rpt2k", "ReviewID": "R296LGSLDFIQCG", "Overall": "5.0", "Content": "If you are in a market for a powerful superzoom camera and don't care about lugging around a trailer to carry your SLR and its accessories then this is THE camera you want to buy. I was considering this with Panasonic and Fuji superzooms. I ended up choosing Sony. This is my first Sony camera ever. I was Panasonic owner for a long time. But I have to say this is one of THE best cameras I have ever owned. It is FAST and produces amazingly clear and accurate photographs. The price is a bit steep but you definitely get what you pay for.I recently used this camera for our trip to Pictured Rocks in Michigan (if you haven't been there then you are definitely missing it, and should plan for it). I was amazed by the quality of the pictures I was able to capture. The 1080p video recording is amazingly crisp. I was able to capture fish under the clear water of Lake Superior. The panorama feature is very well implemented. I did take quite a bit of panoramic pics of the area.I will definitely recommend this over any other superzooms. You will not go wrong with this one!", "Date": "August 31, 2011"}, {"Title": "Excellent Camera", "Author": "H. N. Shankar \"HNS\"", "ReviewID": "R1AFI27W9N5XJ", "Overall": "5.0", "Content": "I start the review of this excellent camera with a request for correction on the lens nomenclature. The Lens is Carl Zeiss Vario-Sonnar T, which is a Carl Zeiss Professional grade lens, and not Vario Tessar Lens as indicated on Amazon. I want Amazon to note and c orrect this serious error. I have bought the camera and there is an errata correction sheet enclosed that indicates this correction.I have been an amateur photographer for the last 30 years. I have never wanted to buy DSLR due to bulkiness and prohibitive costs to have zoom range upto 30X. I also wanted a camera that captures good still pictures as well as be capable of HDMI P. This does it all.I like nature and wildlife photography without having to use a tripod.This camera meets my requirement with 30X optical zoom, Video upto HDMI 60P, various modes such as smart panorama. Also the camera can take stills in various formats. I have used a 32 GB, Sandisk SDHC extreme III card (Class 10+) to ensure adequate memory capacity with speed.  I am truly amazed at the shake free pictures that I get at 30X zoom made possible by optical shake correction. I recently took a shot of a pigeon on top of a ledge about 40 feet away with 30X zoom. I am able to see the toe nail of the pigeon clearly. The videos are excellent due to high frame rate. In my view the camera captures true colour. I am making this statement with my visual perception without extensive laboratory tests. As I capture shots on the move and not into any artistic photography this camera suits me very well and I am convinced that I don't need a DSLR. The GPS with Compass is very good helping me capture location data. I just used the GPS function to automatically set the time of the Camera clock and direction of view. The camera battery life is good though with GPS On there is 25% exrtra drain. I have bought a spare battery with charger to address this issue. This has  excellent stereo microphones right on top with a wind noise cancellation option. I am yet to test this feature in high wind conditions. At the moment I am assuming that it is going to be good.I strongly recommend this camera. I did consider, Olympus, Canon and Nikon before buying this one as it has all the features that I want.HNS", "Date": "August 4, 2011"}, {"Title": "Great All-in-one Super-zoom", "Author": "Peter N. Deweese", "ReviewID": "R26LCNQQHMCHEI", "Overall": "5.0", "Content": "I upgraded from a DSC HX-1, and this is a very similar camera with a long list of great upgrades.  The most important to me are:* SD card option, where I can put an eye-fi for automatic wireless transfer.* 30x zoom built in! I previously used a screw on lens, which was awkward to take off for closer shots.* 1080p60 video with good stabilization!  Amazing.* Much better screen.* Zoom / Focus ring gives better manual control.* GPS/CompassIt is a great package for the price.  The only way to get better for telephoto shots is to get a good DSLR *and* spend a lot on lenses.  Two caveats with this camera:  It has a good lens but a small sensor, so 30x is best for high light situations such as a soccer game.  I use full zoom with burst mode at swim meets for the best dive sequences.  Videos are no longer saved in an easily readable format.  They are .mts, which will require conversion to standard playable formats.I love this camera and highly recommend it.", "Date": "July 30, 2011"}, {"Title": "Even better than HX1!", "Author": "X. Chen", "ReviewID": "R30IBOUS6QMW8R", "Overall": "5.0", "Content": "I have been using HX1, the previous model of this camera, for like 2 years. And I totally loved it. That's why I didn't hesitate at all to purchase HX100V when it first came out. Took it to the Alaska trip immediately after. After 10 days' intensive usage, here is some of the things I noticed.-- The general purpose of taking vacation pictures is served as well as the HX1, even better. With the 30X zoom, I can capture the animal shots clearly from very far while in the national parks.-- One of the new features I appreciated particularly is the HD panoramic. I always liked Sony's I-Sweep feature. Now I can do it \"taller\" (I mean width) with standard clarity.-- I noticed that, even the resolution is set to 16MP, the file size isn't so big, from 3M-4M.-- One thing that upset me was that, when taking the photo in I mode, reviewing the picture on the LCD shows very strong color, as if it's using the \"vivid\" setting. Then I changed to P, and manually set to \"real\" color, that solved the problem. HX1 doesn't have this issue. However, after loading the picture to my computer and viewing from the computer screen, the colors are right even the photos were taken in I mode. So I think it could be an camera LCD display issue. Could just be a firmware issue, since P mode doesn't have this problem. But that's just a minor thing.I love this camera. Although somehow bigger than HX1, it's still easier to carry around comparing to a DSLR.", "Date": "June 14, 2011"}, {"Title": "Sony support is awful", "Author": "D. Williams \"ready\"", "ReviewID": "R24U8GMIY1E3HN", "Overall": "3.0", "Content": "This camera was perfect for my line of business, used 5 days/week. The camera was working GREAT, purchased on Sept 15, 2011. One day last week I was 40 miles away from my office, taking pics of property, & screen flashed message \"Turn power off & back on\" error C:32:60. Wouldn't take another picture. Ruined my day. Logged in to Sony support, got Event ID # to ship the camera in for repairs. Got an email the next morn \"We are sorry..... cancelled\" so I did it again. Same thing next morning..... I called the support phone number the email directed me to. That call was answered by a machine telling me to call ANOTHER number. Called the next number where I sat on hold for over 15 min. I hung up, the camera is in the box waiting to be shipped back- repairs that I will have to pay a minimum of $25 plus shipping to & from costs. The camera was awesome, but it only worked for 7 months- not worth the $450 I paid for it. I believe when you buy a product, you buy the brand- product should have been great(more stars) but the brand let me down.UPDATE: June 25, 2012. Well, it has taken a while, but I just received my repaired Sony camera in the mail today. I have not used it yet, but will post after I have. The website to request repair never worked, after trying 5 different times. I would have never been able to get this unit sent in if it hadn't been for a very diligent person at Sony. He responded & communicated via email until we got this worked out. It only took about 2 weeks between me shipping it in & them getting it back to me repaired. All the time in between was lag in communication between Sony support & me. So if you can get a live person's attention, you have a chance at getting your unit repaired.UPDATE: August 15, 2012. Camera works great. While we were waiting for this one to be repaired, we bought another just like it.  Both are great. No quality complaints.", "Date": "April 29, 2012"}, {"Title": "I wish the color was accurate....  Everything else is amazing.", "Author": "MichaelAsher \"MichaelAsher\"", "ReviewID": "RXKOTJ6JAFED5", "Overall": "3.0", "Content": "Just bought the camera last week.  After taking pictures outside, I noticed they all had a pink tint to them.  I went through nearly every setting, even the \"realistic color\" setting, which is odd that there has to be a \"realistic\" color setting.  Why wouldn't realistic color be the standard.To make sure, I also bout the Canon Powershot hs40.  While the canon doesn't have panoramic, not as crisply focused pictures, the color is naturally amazing.  I went back and forth and when comparing photos of red rocks in the desert, there was just no comparison.I wish there had been a way to make the colors look real, everything else was great.", "Date": "February 25, 2012"}, {"Title": "A powerful yet simple to use camera", "Author": "M. Povoa \"Marcello Povoa\"", "ReviewID": "R2PYI1FON2VW0B", "Overall": "5.0", "Content": "If you want a \"one stop shop\" camera, with all you need integrated in one solid device then the HX-100V is probably a wonderful choice for you:No lenses or parts to carry around.Hardware and software beautifully integrated.30x optical zoom.A powerful set of automatic and manual functionalities.Excellent interface usability. Easy to use, with a user guide inside the camera.Fast processing speed.Some cutting edge computer graphics based filters, shape recognition etc.Great image quality.Full HD movie.And much more...The HX-100V is an elegant design from Sony. It shows how fast compact cameras are evolving, becoming pretty solid computers at the same time. It's a powerful yet simple to use photo machine.The price is not the cheapest in the category -- however if you think all you get for around $430 it becomes a good deal.Great camera. I have one and have been obtaining nice results, and a very pleasant user experience.Highly recommend.", "Date": "December 2, 2011"}, {"Title": "Excellent camera at a reasonable price", "Author": "bpparrish", "ReviewID": "R1P1NO2ZRXFGKE", "Overall": "5.0", "Content": "My wife and I bought this camera after having several compact cameras break on us. We were looking for a camera that was more powerful than the compacts that we had purchased before. However, we did not want the hassle of dealing with the lenses of a DSLR. This camera is an excellent trade-off. It takes beautiful photos with little to no adjustment. Very good camera for the avid amateur.", "Date": "November 28, 2011"}, {"Title": "max zoom with good outcome", "Author": "Agus", "ReviewID": "RPSZQYFAEQ2XM", "Overall": "5.0", "Content": "I was going to buy P500 in Best Buy but felt disappointed with the result of its max zoom (36) because the picture was blurry. Then I tried Canon SX30is, the outcome with max zoom was better than Nikon but still not clear. Finally, I was stunned with the outcome of this Sony HX100. The camera took pictures fast and the outcomes with its max zoom was amazingly clear compared to Canon and Nikon which are well known as camera makers.I should have had this camera if UPS did not miss me three times without leaving me any notice.", "Date": "November 5, 2011"}, {"Title": "One Great Camera and Video recorder all wrapped into one", "Author": "R. Kofoed", "ReviewID": "R2R67A7AMZKH5T", "Overall": "5.0", "Content": "I have had this camera for about 3 weeks and have taken over 700 images and videos. I have been an avid photographer for over 30 years and have Nikon's Best DSLR like the DX2. This camera handles some of the toughest lighting conditions. the 27 -810mm lens is perfect for a travel camera without carring around all those heavy lenses. The HD video is fantastic every bit as good as my stand alone video camera. Battery life is awsome last 2-3 hours of use per battery. Buy 1 extra battery and you are good to go. Even at full magnification you get crisp clean images that are well balanced. I have had to post process very few of the 700 images I have taken so far. Had a situation where it was sundown slight blue strip in the sky, lit up wall tent in the background, campfire in the forground and it handled all that different light perfectly. I cant say enough good things about this camera. Buy one you wont be sorry.", "Date": "October 30, 2011"}, {"Title": "DSCHX100V Review", "Author": "Frank J Calandra", "ReviewID": "R1W2TQKJ2QKITK", "Overall": "4.0", "Content": "Impressive camera with lots of capabilities.  Problem with camera is the electronic view finder is too small for me to compose my pictures.  I have also experienced about 70 percent of the pictures are dark but editable.  It's as though they are 1/2 f-stop underexposed.  I would recommend this for purchase but it has not satisfied my needs and requires too much editing to correct the dark pictures.", "Date": "September 21, 2011"}, {"Title": "Best Superzoom I've Ever Owned", "Author": "GG", "ReviewID": "R2J1A1MQAZGIUA", "Overall": "5.0", "Content": "I took the Sony HX100V with me on a trip to Hawaii(along with the Panasonic LX5 and TS2 waterproof).  The HX100 performed as well as the LX5 for me.  I was able to take excellent macro photos of flowers.  The color and detail were exquisite.  Landscape photos looked as good as the LX5.  The 1080/60p video I took at an evening luau show was so smooth and natural , it seems that I am right there when I watch it on my HDTV.  I was able to achieve the \"ribbon\" effect of a waterfall with no background blurring (setting Shutter Priority at 1/4 second with the ND filter on).  Sony has absolutely steller image stabilization.  All of my full zoom 30X photos were crystal clear with no blurring.  I was able to take photos of monk seals and a dove's head at full optical zoom with no blur at all!  The camera is loaded with practically every feature imaginable (Handheld Night, Sweep Panorama, dedicated movie button, settings for sharpness, saturation, etc.).  I have no complaints about the HX100, and I feel that it is definitely worth the price.Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "Date": "September 19, 2011"}, {"Title": "Best Camera I've Ever Had", "Author": "Linda Mahoney \"Linda M.\"", "ReviewID": "R21C37A7CIFQ7J", "Overall": "5.0", "Content": "I bought this camera based on the high reviews it had received and I can add mine to the rest.  The picture quality is beautiful and the HD movies are perfection.  The ease of use is fabulous and all I've tried so far is the automatic.  It can \"read\" the conditions amazingly fast and takes very good low light photos.  Just about all my pictures so far have been in focus and exposed correctly.  I look forward to using the manual mode and all the other features this camera has, and it has a lot.  The super zoom capability is wonderful, but as expected, the quality of the picture deminishes with the amount of zoom.  Still, it's great to have the ability to use \"super zoom\" when the occasion calls for it. Battery life is excellent! Overall, I love this camera!", "Date": "September 13, 2011"}, {"Title": "What a camera!", "Author": "Paemon", "ReviewID": "R3T9EZBWK6Y8D2", "Overall": "5.0", "Content": "As a beginner, this \"bridge\" camera is everything I need to grow as a photographer. It takes amazing photos and is very easy to use (especially after watching some reviews online). I highly recommend this product. If there is one minor detail that I would be critical about, it would be the charging process. I like external battery chargers(wall chargers). Maybe because I'm used to small point and shoot cameras, but charging the battery while inside the camera can be a little annoying. Specifically when you need a second battery charged. I bought an external car battery charger so that would not be an issue on long photography adventures. With that said, It is overall the best camera for the price!", "Date": "August 18, 2011"}, {"Title": "Amazing Technology", "Author": "Terrier Fan", "ReviewID": "R2OOXBTYAAOHZ6", "Overall": "5.0", "Content": "I live on a large lake and decided to buy a long zoom point and shoot after missing too many great shots. When I buy a new piece of technology, I generally tinker and fuss over the bells and whistles for the first month or so. Eventually, I stop playing with the bells and whistles and just turn the thing on! What I learned with this great camera is to trust the technology. As you have read in many other reviews, this camera is chock full of cutting edge options and they are impressive. However, this camera is at its best when you put everything on \"auto\", concentrate on your subject, and simply point and shoot!  The images are amazing, especially at full zoom. I strongly recommend this product.", "Date": "August 16, 2011"}, {"Title": "A love/hate relationship", "Author": "Kimberly A. Bettes", "ReviewID": "RMB44MYJ92R64", "Overall": "2.0", "Content": "I've had this camera for almost 2 years now. There are things I love about it, and things I hate.What I love:--The tilt out LCD screen. LOVE IT, and will never again have a camera that doesn't have one.--The long zoom.--The great pictures. When all goes right and the stars align in the heavens, the pictures are sharp and clear.--The compact design.What I hate with every fiber of my being:--The processing time between shots. I take a lot of shots that need to be taken quickly. People, animals, etc. This camera is absolutely terrible for that. Once you take a photo, a bar pops up on the screen and it takes several seconds to process. That's several seconds in which I cannot take another photo. I've missed a TON of great shots because of this. There's no way to turn it off, no way to make it stop.--Images always look fabulous on the LCD screen, but not always so fabulous on the computer. An image can look crisp and clear on the camera screen, but when I transfer them to the computer, they might be a little blurry or too dark. It doesn't always happen, but it happens way more than it should.--The video file format and the transfer process. I've never had a camera that used the file format that this camera does, and I'll never have another one. It's horrible. Absolutely horrible. I'd say it was a pain in my backside, but this makes a pain back there look like a day at the park. It's THAT bad. However, if and when you ever get the video off the camera, converted to a different format, burned to a DVD, and get it on your television, it's great. High definition video at its finest.I've spent the last 2 years kicking myself for not buying another Fuji. I'll never buy another Sony camera.", "Date": "September 15, 2013"}, {"Title": "LOVE my Sony!", "Author": "J. Olson", "ReviewID": "R1F7Y001R6SG7L", "Overall": "5.0", "Content": "I attend a lot of concerts & special events.  This camera is AMAZING!! Easy to use & switch between the variety modes allowing me to get the best picture!  Can't begin to say enough about the simplicity of operation that provides professional results.  The zoom is amazing & a feature I insist on when looking for a camera.  Sony delivered again with this great camera! Keep it coming Sony!", "Date": "June 29, 2013"}, {"Title": "wonderful camera--battery dies very quickly so far (opened it with 60 mins left, used it very little and its at 25 mins)", "Author": "cjb20938", "ReviewID": "R2Q5734KGGIFCL", "Overall": "4.0", "Content": "I would give 5 start review but the battery dies very quickly it seems like. The camera itself is simply amazing, the picture quality is great, keep in mind this just came in the mail this morning so still learning all the modes and such. I went on a picture taking spree as soon as I opened the box and have uploaded some, straight out of the camera. I will see in a few days just how good it does with people and low light (other than in my house with lights on)...hope it's as good as with plants in the sun.The camera is a little bulky feeling but feels sturdy, and love the manual zoom on the lens...haven't used the normal zoom once yet.", "Date": "July 9, 2012"}, {"Title": "Good consumer camera", "Author": "Tad C. Niemyjski \"Roc Doc\"", "ReviewID": "R3EQGHVLD0QDNP", "Overall": "4.0", "Content": "This is a very good camera for the price.  It is very feature laden with good manual controls, but can be as simple as a point and shoot.  Overall, the picture quality is very good and photos can be enlarged to 8x10 inch.  However, if you want to work with the photos at a pixel level, step up to a DSLR.The video quality is very good, but the processing of the videos can be time consuming.  Also step up to a large Class 10 SDHC card for video.", "Date": "June 24, 2012"}, {"Title": "Horse action pictures.", "Author": "Mike T", "ReviewID": "R39JD6EBV1P79R", "Overall": "5.0", "Content": "Very good at capturing a wide variety of horse action shots from large variety of distances within seconds. Burst mode is very good for studying the feet of horse in complex manuevers. Adjustable Zoom is very good in keeping subject in sight while going away of towards camera. Very valuable capability.", "Date": "May 21, 2012"}, {"Title": "Near-Pro quality in compact size", "Author": "joetahoe", "ReviewID": "R39JXCL7NBO60B", "Overall": "5.0", "Content": "Bought this for my dad... and I wasn't sure exactly how good it was although I knew from research that it was rated very highly.The functions it has built in are amazing.  From gps to panoramas to extreme long steady zoom... this camera does it all without having to swap out lenses like larger dslr cameras.I would highly recommend it for anyone not wanting to spend more than $500 and wanting awesome results.", "Date": "May 17, 2012"}, {"Title": "Time is important sometimes", "Author": "Bloomington", "ReviewID": "RBUHUIFRD87ZG", "Overall": "3.0", "Content": "How good is the camera is one of the things that I cannot write more then the other reviewers have wrote about it. The only thing that I think sony did it wrong with this great came is the time that the camera takes between pushing the button and taking the pic, and the time that the camera takes to display the taken pic before being able to take another pic.The problem is there is no way to disable this function through the settings!!!!!!!!", "Date": "January 18, 2012"}, {"Title": "GREAT PRODUCT", "Author": "RABIDJAWA", "ReviewID": "R11JOSTMOMCSIV", "Overall": "5.0", "Content": "I have used this camera for 1 month with no problems so far.  There is a slight delay writing the image to the card (this was an issue for some other reviews, it has not posed a problem to me, if I am looking to catch multiple images quikly I just set the mode to burst & can take 10 images back to back like a slide show, pick the best one & delete the rest).  The optical zoom is amazing (took a picture of a piece of paper from 15 to 20 feet away & could read regular print with zoom--perfectly clear even after digital zoom)  I am truely impressed.", "Date": "January 3, 2012"}, {"Title": "A Nice Step Up from DSC-H50", "Author": "A. Culley", "ReviewID": "R26ULT4KVDCBN9", "Overall": "5.0", "Content": "My DSC-H50 was starting to be a little fuzzy at max zoom even with a tripod and I had taken over 16,000 photos with. I was thinking DSLR, but just not ready to make the leap I came across this newer Sony model. I have only taken a few pictures but the ones I've taken are excellent. I like that the camera body is heavier and sturdier than the H50. Most of the controls are the same with some nice upgrades. There are two functions that are not on this model that were on my H50 1)there is no way to turn off the auto review function so there is a delay for the next shot. The camera does ready itself by pushing the shutter half way but just being able to turn it off would be nicer. 2) The flash mode has two modes No Flash & Auto Flash, but no Always Use Flash as on the H50. That again was a nice feature on the H50. I was also disappointed that the included USB cable was only 2' long and could not be used by me(I had to purchase one separately). I would highly recommend this camera for its excellent photo production. It's probably not for the beginner, but a nice upgrade for those with earlier point & shoots.", "Date": "January 3, 2012"}, {"Title": "AWESOME", "Author": "Betty", "ReviewID": "RDUX76CU8ZBI", "Overall": "5.0", "Content": "This camera is just near perfect as you can getseems pricey but I have much more expensive cameras that do a lot lessfor the price you can not beat this one, does it all and does it well--very lightweight", "Date": "November 29, 2011"}, {"Title": "Power Buy", "Author": "A. L. T \"deal_seeker\"", "ReviewID": "R1V2GGV1YY8ESX", "Overall": "5.0", "Content": "I am not a professional photographer, I bought this camera as a gift for my wife, who knows a lot more than me, this camera rocks! for the price it does pretty much everything that more expensive cameras do.  My uncle is a professional photographer, he is a Nikon fan, but he was impressed with this camera, the quality of the pictures is noticeable great, easy to use, turn on quickly which is good if you have kids, I highly recommend it.", "Date": "November 17, 2011"}, {"Title": "Fantastic All Around Camera", "Author": "Eduardo Parra", "ReviewID": "R8EUTTTN3KTLQ", "Overall": "5.0", "Content": "Great all around camera, takes fantastic pictures, is fairly fast, and has a good size and weight. Great when you want to move from the basic point and shoot but do not want to get a DSLR. Fantastic battery life.", "Date": "November 17, 2011"}, {"Title": "Great Camera", "Author": "Seth", "ReviewID": "R1JFYKUI1K65QB", "Overall": "5.0", "Content": "I've been using this camera for taking photos of customer products and hobby video production. great camera I would recommend for anyone who wants a powerful easy to use camera!", "Date": "November 14, 2011"}, {"Title": "brilliant piece of work", "Author": "shooter", "ReviewID": "R16WQWM5UWVRHT", "Overall": "5.0", "Content": "This camera is amazing which gives SLR like picture clarity even though its not an SLR. Optical zoom will go upto 120x and with a steady hand the image clarity is pretty decent. The shutter priority helped me to take good pictures. ISO3200 will help you take to night pictures without flash as if it has been taken morning time.Even the battery life is really good. It will last for an entire day and you can capture more than 400pics.Cons: Only one file format(JPEG)Zoom capability can be extended moreUSB charging should be provided.", "Date": "November 12, 2011"}, {"Title": "I LOVE this camera", "Author": "Aussiebat", "ReviewID": "R3RSO73AV9ZKNZ", "Overall": "5.0", "Content": "I have had the camera almost a week and took it on a major test this weekend to take pictures for my blog. First, I will say that I reduced it down to 12MP because I read a review on another site that said that was better than the 16MP it was capable of.My shots came out magnificent and clear. As others have said, it is not a DSLR but for my purposes the photos were great. I was able to take shot after shot with little or no hassle and the 30x zoom came in handy when I was shooting butterflies in a rainforest museum. I was able to get up close without disturbing my subject with results that looked like I was standing right over them.I also took some video and will admit that the getting the AVCHD set up for my editing software was at first a hassle but I have gradually gotten used to the process I need to follow. The video (which is why I bought the camera) produced very clear detail and looks like I used a professional camera. The audio really surprised me in that it is very sensitive despite the fact the mic is on the top of the camera.For still shots I was able to shift from auto to manual with little effort and being new to the camera liked the information it gave on the different options. I jumped around a lot taking all kinds of shots and was later more than pleased with the results.I already had a Sony H-1 camera and had resisted getting a new camera because a lot of the features offered were just plain gimmicks that didn't make me want to try something new. I checked them all (Canon, Nikon, and various other models) and then stumbled on to this one. Despite the fact the video is proprietary I think I got the best of the deal. I see myself using this one for quite awhile as it feel substantial in your hand without being bulky and the photo/video product is great for my needs.Thanks amazon!!", "Date": "October 30, 2011"}, {"Title": "Fantastic bridge camera", "Author": "Kris Korpenfelt", "ReviewID": "R2FV5MOW8TIOUS", "Overall": "5.0", "Content": "This camera takes fantastic pictures under any conditions I've yet thrown at it, it's easy to use, and the battery lasts half of forever. The various feature modes, which I thought were a gimmick at first, are actually pretty fun. Panorama mode is neat too, no more stitching the pictures together manually.My only complaint is the charging method it comes with is garbage. To charge the battery, you need to leave it in the camera and hook the power adapter to the camera itself. Do yourself a favor and pick up the third party battery charger (which charges the battery itself) in a pack with two spare batteries for about $30: 2 Pack Battery Kit For Sony Cyber-Shot DSC-HX100V Digital Camera Includes 2 Extended (1000mAh) Replacement NP-FH50 Batteries + LCD Screen Protectors + MicroFiber Cleaning Cloth.", "Date": "October 11, 2011"}, {"Title": "Good but the video is a bit slow", "Author": "G. Fong \"etrekkie\"", "ReviewID": "R1UT3495RU4JYJ", "Overall": "4.0", "Content": "The camera is very nice. A little on the heavy side. I have owned many mega-zoom before and this is the biggest and heaviest(also has the most zoom of course). The video button is very slow to start if you are in photo mode. 5 seconds. Almost unusable in a sporting event. I almost have to return the camera because of this. But it is much better if you switch it to video mode first... then may be a one second delay. It is not the best but at least usable. The video quality is fantastic. The Superior Auto Mode takes good pictures but it's very slow. It takes a few seconds before the camera is ready to shoot again. It is not for sporting events. The regular Auto Mode is much faster.I hope they can fix the video button delay in photo mode. It is a bit of an effort to have to switch it to video mode first.A hot shoe for flash will make this camera more complete. I got this slave flash to compensate Neewer Digital Slave Flash + Bracket Set for Digital SLR DSLR Cameras or any Digital Camera!. Not bad for the price.Updates:I sold the camera and bought the Panasonic DMC-FZ150K. I love it! Less zoom, less pixels, less GPS, less Panorama mode shots but it is much much faster. Video mode is almost instantaneous. 12 shots burst mode. 5 shots burst with flash! Bye bye Sony.", "Date": "September 20, 2011"}, {"Title": "Awesome Camera", "Author": "Vasudevan Rajannan \"No Geek\"", "ReviewID": "RIIDWY6AY8YW0", "Overall": "4.0", "Content": "This is an awesome camera and a great alternative for d-SLRs. I am not a photography professional, and hence I cannot quote in technical terms. But from a layman's standpoint, go for it!!!It has very good image quality, great zoom, good colors even in full zoom, great HD videos. The handheld twilight mode is awesome. I have uploaded picures here that I took in Niagara Falls.I am still playing with it on using with manual mode & settings like aperture, focal length and hence I gave it 4 stars.", "Date": "August 24, 2011"}, {"Title": "Absolutelly Great", "Author": "Leo Maia", "ReviewID": "R3GR6GAI9EX5EG", "Overall": "5.0", "Content": "I spent a lot of time trying to decide which camera should I buy. I checked all megazoom cameras around and finally decided for this Sony HX100v (the \"v\" is for GPS).I couldn't be happier. This camera is absolutelly amazing. The zoom is fantastic, it's fast and has a great picture quality. I has a lot of scene modes and that is very useful since I'm not a pro and don't want to waste time trying to be one.Great job, Sony.", "Date": "August 9, 2011"}, {"Title": "Just an exceptional camera!!!", "Author": "Carmen R. Towles", "ReviewID": "R121GPIIECIIC3", "Overall": "5.0", "Content": "I won't get into the mechanics of this camera. That has been stated in most of the reviews already. What I will say it that this camera is just fantastic.  It does a hellava lot and does it well. As another reviewer stated. I too was waiting for a camera that just did it all and did it well in a small compact body. Never thought in a million years it was going to be Sony that was going to make this happen. I had left them years ago. But they hit the mark with this one. Good Job Sony!! You've got a winner here. I just love this camera!! Intuitive and easy to use. You can just pick it up and start shooting right out of the box. And that lens...all I'll say is WOW!", "Date": "August 8, 2011"}, {"Title": "sony camera review", "Author": "photonut", "ReviewID": "R3EMME6NXOJ2NL", "Overall": "5.0", "Content": "This camera is an excellent buy from Amazon.  The camera offers everything a modest camera person would want.  Remember if using the 3D mode you still need the glasses with a 3D source.  The Panoramic picture view is fabulous, but you need to master the control to get the picture you want, so keep learning about it.  The normal pictures are just great, and the setup is easy to follow if you learn your controls.  To enjoy this camera, you do not need to be professional, you just need to learn the user guide.  The user guide is also available on the internet for easy access questions.  thanks.", "Date": "July 30, 2011"}, {"Title": "Sony Dsc-hx100", "Author": "James", "ReviewID": "R35ZG9VZF524MH", "Overall": "5.0", "Content": "The camera is very sturdy, and in my opinion well design, 30x optical zoom which includes greater digital zoom at lower resolutions.  Night stability is considerably better than some other of Sony cameras, which I've had at least 3 other.  Has many features, worth trying.  The camera is every bit worth it's value and more.", "Date": "July 29, 2011"}, {"Title": "Superb Camera!", "Author": "Datiko82 (from Republic of Georgia - Sakartvelo)", "ReviewID": "R1NGVGE7OAJ4C4", "Overall": "5.0", "Content": "This is an excellent camera for me. As I am an amateur and this is my first camera I'm absolutely satisfied with its features and of-course the quality of pictures and videos. Two days I have it and love it already.", "Date": "November 20, 2011"}, {"Title": "Bill_de", "Author": "Bill_de", "ReviewID": "R2D31VVKW41725", "Overall": "4.0", "Content": "I have been using Nikon professional DLSRs since the D1x hit the market. Typically I shoot with the 200-400vr or the 500AFS. I also spend some time kayaking and got tired of dealing with the excess weight and bulk in the little boat. I didn't expect this camera to compare, but it is better than my expectations.On the plus side;The camera is comfortable in my hands.The battery life combined with an 8 gig card provides a good amount of shooting.The images are sharp [the image stabilization works] and the color is good.The exposure is good, and in tough lighting the HDR feature saves the day.High speed shooting is HIGH SPEED.I have made usable prints up to 8 x 10.The negative;The auto focus does not work well in low light.Manual focus is slow because of the amount of rotation needed.JPEG only file format limits post processing.I have not tried all the features. But, the panoramic works and only took a couple of tries to find the right pan speed for best results. Somebody else will have to talk about 3d and video.I would recommend this camera.", "Date": "September 28, 2011"}, {"Title": "Know Its Limitations", "Author": "David S. Lott", "ReviewID": "R1A9DSCQJIBYL3", "Overall": "3.0", "Content": "This camera has some good features but there are limitations and compromises that buyers should weigh carefully.The best: high quality lens, 30x zoom actually works, readable lcd screen, competent menu system, very good quality video, broad array of features.The problems: written documentation is really terrible, the software does not work on mac, no raw option, electronic range finder is mediocre, must buy separate battery charger or be stuck with the in camera charge system, menu is not intuitive, on camera documentation is only fair. Like all compact or \"bridge\" digital cameras, the smaller sensor limits image size and quality, though the jpegs on the HX100 are adequate.Did I mention that the documentation is bad? Unless you (a) already know quite a bit about digital photography or (b) love to dive into a trial and error learning curve, you are going to be frustrated. There is a pipsqueak printed manual in the box, but it's a trial even to download the more detailed manual from the CD. There's nothing automatic or intuitive about the download. I am pretty comfortable with computers and I nearly gave up. Then, if you figure out how to open the manual and use it, you find it's no more than a C+.Bottom line: Unless you have prior technical knowledge and are willing to roll up your sleeves to tackle the poorly documented (but otherwise adequate) menus, you will end up using \"Easy Mode\" all the time and missing out on the best features.", "Date": "February 11, 2012"}, {"Title": "Sony Has Hit the Spot With This Camera.", "Author": "John Tummons", "ReviewID": "R2N60G24GBB1HV", "Overall": "5.0", "Content": "I have been impressed with this little Sony DSC-HX100 camera. Nothing like my Canon 5D Mark II but more than adequate for general use with great pictures. I would recomment it as a second camera to an SLR or first camera if you are not going to get an SLR.", "Date": "June 7, 2011"}, {"Title": "Traveler", "Author": "Traveler", "ReviewID": "R2U9Y5HYWXLLJT", "Overall": "5.0", "Content": "The camera was delivered less than an hour before we departed for two weeks in east Africa, so obviously no time to 'learn' how to use it.  [I had ordered from a Big Box store over two weeks earlier, but it didn't arrive; overnight shipment by Amazon saved the day.]  But it is remarkably straightforward, at least for general shooting (still experimenting with other capabilities).  I got some absolutely amazing shots of a wide variety of wild animals, birds, people, and scenery, and am in awe of the capabilities of a 30X digital zoom.  So far I am not as impressed with video mode, but that isn't a primary interest and it may simply reflect a learning curve.  Camera has a great 'feel' in the hand.  I am old-fashioned, and prefer to compose with one eye looking through the viewfinder, which is very easy to use.  Over 2800 shots on a single 16 Gig card - and it was still not full.  A spare battery is essential for such photo opportunities.  Recharging was easily accomplished each night.  Even better now that I have obtained a separate charger - which I wish had been included with the camera.  This camera allowed me to take photos that far surpass anything I could have taken on the 10X digital camera I have used for years - especially important when one may be shooting wild animals in their habitats from distances of 50 - 100 m at times.  Maybe I can pay for it by selling prints of some of my more dramatic photos!", "Date": "November 25, 2011"}, {"Title": "SONY CYBER-SHOT DSC-HX 100V", "Author": "John Folger", "ReviewID": "R1Q7BPN0X15JN6", "Overall": "5.0", "Content": "Everything I expected from this camera.  Great zoom with clear pictures.  Nicer to carry around then a DSLR, with almost the same results.  Would recommend it to your viewers.", "Date": "January 17, 2014"}, {"Title": "Fantastic Camera", "Author": "MKR", "ReviewID": "R1XC90DPFLWP3D", "Overall": "5.0", "Content": "Zoom is just unbeleivable. Picture quality is great. Took it to African safari and was able to take pictures at distance and upclose without having to worry about changing lens as in SLR camera.HD movie qulity is very good.", "Date": "January 3, 2014"}, {"Title": "Exceeds your expectations", "Author": "Datesmcgee", "ReviewID": "R14C8EJ8BO637N", "Overall": "5.0", "Content": "I used this for video taping drag boat races. Awesome quality video. I love the optical zoom. Thinking of getting the new 50x model...", "Date": "December 30, 2013"}, {"Title": "An Unexpected Video Bargain", "Author": "Rick Bennette \"Rick Bennette\"", "ReviewID": "R2SLMT8XNYCG83", "Overall": "5.0", "Content": "Most camcorders in this price range are weak in the video recording ability. The HX100 records some of the most natural looking, sharpest video in and above its class. It is actually sharper than the video from my Sony Alpha 57. While some users may report color that lacks the movie look, it is because this camera records more like your eye sees images with colors that are natural and not overly saturated. It is not the most light sensitive camera in low light, but it produces an image that has very little grain as the lighting gets darker. Even Sony's own successors, the HX200 and HX300, don't produce an image this sharp and clean, although they are more saturated in color.Most camera functions can be controlled manually, which is a plus for this class of camcorder. The lens, while exhibiting a fair amount of geometric distortion (straight objects appear slanted) at wide angle, the chromatic aberration (color fringes around objects in the corners of the image) is very well controlled. Battery life as good, the camera feels well balanced and turns on and is ready to record in under two seconds.", "Date": "December 2, 2013"}, {"Title": "Fantastic Camera!!!", "Author": "toots53085", "ReviewID": "RTIH7JRFECTDN", "Overall": "5.0", "Content": "I love my new camera!!  The pictures are so clear and so far I can figure things out but always more to learn!", "Date": "October 7, 2013"}, {"Title": "Excellent product!  Very pleased with purchase.", "Author": "Marcin G. Rembisz", "ReviewID": "R3VJG8BTS2F8V6", "Overall": "5.0", "Content": "I was slightly hesitant to purchase this camera refurbished, but the savings over a new camera just couldn't be beat.  The camera arrived quickly and in excellent condition, and so far has produced quite pleasing pictures.", "Date": "September 6, 2013"}, {"Title": "Read This For Acurate Info And An Honest Review!", "Author": "superdood", "ReviewID": "R2L5086NNV7HI7", "Overall": "5.0", "Content": "This Is Such A sweet Camera im almost at a loss for words. The panoramic mode is awesome and you can use it from left to right right to left up to down and down to up. Along with the all the other picture features this camera is amazing. You even get crisp pictures if you focus right in the 120X digital zoom. in the pictures i added you can see a squirrel at about 300yrd giver or take. The microphone on this camera is pretty fair considering its a camera mic. You can spend thousands of dollars but all camera mics stink. But this one wasn't to bad. it has the ability to take a burst shot of 10 pictures a second :O and a burst shot of 3 with different picture and color settings. Along with a built in Manual WOW!!! and it has so many modes from Pet shot to Fireworks its AMAZING so im giving this awesome ***** Five star. Professionally 4 1/2 but i gave it 5 any way because i got mine for $169.99", "Date": "July 26, 2013"}, {"Title": "Great multi-function camera", "Author": "Mark", "ReviewID": "R1K78QAMQKOB26", "Overall": "4.0", "Content": "The HX100V is a very good camera and I got it for a very good price. The camera is great as a point-and-click, but also has many advanced features. My only disappointment is the fact that it is difficult to transfer video to Apple OS.", "Date": "July 7, 2013"}, {"Title": "Like!!", "Author": "Nellus Danny", "ReviewID": "R2LL5UHSHAYUGH", "Overall": "5.0", "Content": "Amazing camera for amateur like me... i enjoy using it everytime . the only problem is the file format is not in RAW data", "Date": "May 27, 2013"}, {"Title": "Great Camera", "Author": "mehcat", "ReviewID": "R3RAI67AI3TLGP", "Overall": "5.0", "Content": "Great Camera. Exactly as ordered. Easy to use. View finder and zoom are nice features. Taking lots of outside photos.", "Date": "May 12, 2013"}, {"Title": "Simply WoW", "Author": "Melito", "ReviewID": "R3H932ST19FTZR", "Overall": "5.0", "Content": "I just start to use it, but it is great, it had a little scratch on screen but I buyed as used so I didn't spect to be perfect 100% the features are just great, and I love timming on pulse photo button and the response of the camera", "Date": "April 22, 2013"}, {"Title": "Love it love it love it", "Author": "i buy a lot", "ReviewID": "R3P55R1RKDDCI2", "Overall": "5.0", "Content": "ok, i did a lot of research on this product and decided on this.  it works fantastically and i have not had issues. the zoom is amazing. i hope to keep it for a long time.", "Date": "April 17, 2013"}, {"Title": "Almost idiot proof", "Author": "Colin Lamoureux", "ReviewID": "R2RTNPB101VLOP", "Overall": "5.0", "Content": "I have had this camera now for over one year and I really love it. The quality of the still pictures is excellent with complete flexibility and control over how you go about the task. The zoom feature is incredible!Of course Sony have since brought out the DSC-HX200V but the only significant difference appears to be the mega-pixels which have increased obviously with all other features pretty much staying the same. Good value for money.", "Date": "April 5, 2013"}, {"Title": "Jury's still out", "Author": "Alice B", "ReviewID": "R37X1VI0YCNUI2", "Overall": "4.0", "Content": "First:There's no sun in Washington, so I can rarely get natural light. I hate that I can't get photos of my infant baby, no matter what setting, and have realistic color. Every picture comes out unnatural. She even gets red-eye with this expensive piece of junk.  I've used a Sony Cybershot several years ago with only 7 megapixels, I was much happier with that camera. I'm so sad that I hate this camera and the Amazon 30-day is up. I even spent more money for a case and such. SO MAD.Later: I don't know what I did but things are better. Video works well in light, I'd keep it for that alone.", "Date": "March 19, 2013"}, {"Title": "Awesome camera - very unhappy with SONY and dissatisfied", "Author": "Abzman \"Resourceful One\"", "ReviewID": "R2M0EZ6OPESHQS", "Overall": "2.0", "Content": "Purchased many Sony cameras in the last few years for myself and relatives.  Loved this series. Bought this one directly from Sony and after a couple of months noticed a spot in the pictures especially when taken in sunlight.  I realized it was a spec inside of the lens.  Contact Tech support and they asked me to use a special cloth to wipe the lens!! I re-explained it was INSIDE from the factory and no way to get rid of it.  They asked me to send it in at my cost, pay for return shipping, and also pay a warranty service fee!! Screw that.  That's what I get for buying it online from the manufacturer.  They can mail you a defective product and get away with it.  You have to spend more money to get it to where it should have been in the first place.The camera is ok otherwise with very nice features.  Picture quality under certain conditions can be better. Flash doesn't engage in Auto mode when you expect it to so the pictures come out dark and grainy.Still, I will never buy from them again and will spread this bad experience to everyone I know.  Very disappointed.  I spent a lot of money on Sony products over my lifetime but this is the end.", "Date": "March 15, 2013"}, {"Title": "Thanks", "Author": "Scott L Calaway", "ReviewID": "R17RGKWH1CL8S6", "Overall": "5.0", "Content": "Thanks for the great service. 15 more words 12 11 10 9 8 7 6 5 4 3 2 1", "Date": "March 5, 2013"}, {"Title": "Good pictures and easy to use.", "Author": "Charlotte Mom", "ReviewID": "R2ZRH29AIBL71L", "Overall": "5.0", "Content": "My daughter has gotten some excellent pictures with this camera.  None of us are experienced photographers, but the settings are easy to use and find.  Nice step up from a point and shoot.", "Date": "February 28, 2013"}, {"Title": "Love it.", "Author": "nelleys", "ReviewID": "R34PYOAQW8INAL", "Overall": "5.0", "Content": "Great quality shots. I used this camera for a family vacation in Orlando and it worked perfectly. No complaints at all", "Date": "December 19, 2012"}, {"Title": "Perfecta", "Author": "Rodo", "ReviewID": "R17OV00P4FH4C2", "Overall": "5.0", "Content": "Excelente camara para principiantes, toma muy buenas fotos y tiene muchas funciones interesantes, el video es de muy buena calidad, me falta probar el 3D", "Date": "December 13, 2012"}, {"Title": "Camera", "Author": "Harvey Patterson", "ReviewID": "RH7M4SIK3FEKH", "Overall": "5.0", "Content": "I spent a lot of time reviewing which would be the best camera for my use. I came up with the Sony because I wanted a view finder as well as the window, and it takes great pictures and is easy to use.", "Date": "December 4, 2012"}, {"Title": "Sony cyber-shot", "Author": "krish", "ReviewID": "R2GX0E8CYHTJ4N", "Overall": "4.0", "Content": "I am very satisfied with this product, it is definitely worth the money.Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "Date": "October 19, 2012"}, {"Title": "Sony Cyber Shot DSC HX100V", "Author": "Penny Warner", "ReviewID": "R1GF7ATRNL93NL", "Overall": "4.0", "Content": "Found this camera to be heavier than my previous Sony Cyber Shot, great clear crisp pictures, a little fuzzy when taken out to 30x, but overall a great camera that will meet all my needs.", "Date": "October 9, 2012"}, {"Title": "EXCELLENT FOR ITS KIND", "Author": "C. Philippe", "ReviewID": "R3U4BWFXW1TBMX", "Overall": "5.0", "Content": "I love this camera. I've been using it for almost a year now and it never fails me with my shots. Great product from Sony!", "Date": "September 10, 2012"}, {"Title": "It's no D-SLR but tops as a bridge camera", "Author": "CrimsonHail", "ReviewID": "RTUL1DN1NH03G", "Overall": "5.0", "Content": "Easy to use, light weight, feature packed, quick performance. The pictures it takes are not D-SLR quality but still great in most cases. A little grainy in low light but that's to be expected. Powerful zoom, sometimes difficult to get focused on what you want but it does auto focus quickly. Video quality and sound is excellent. Highly, highly recommended for beginning and intermediate picture takers. Enjoy! Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "Date": "August 28, 2012"}, {"Title": "Shelter Pet Photographer Review", "Author": "Meagan", "ReviewID": "R1LGRH11GCFIWR", "Overall": "5.0", "Content": "To start, I photograph pets at a local shelter to help get them adopted. When my Canon Powershot crapped out on me I was looking for something more ... less point and shoot, but I knew I wasn't ready for a full on DSLR camera. This camera is amazing! It is easy to use. The Superior Auto gives amazing detail in low light, which helps for indoor kennel shots since the shelter I go to has horrible lighting. Outside, the photos are crisp and vibrant. I rarely edit and when I do it's just to give it more contrast. If you have hyper dogs, the burst mode is awesome for capturing goofy expressions. This camera makes my photographs look more professional AND it's fun to use. The interactive screens make it easy to understand and operate. The only real downside is the process time after a photo is taken, but then- I am impatient!Basically if you are a novice photographer that wants to take awesome photos while learning the different settings- Look no further!!", "Date": "August 28, 2012"}, {"Title": "Lives up to the hype.", "Author": "J Grace", "ReviewID": "R28QRS639VECHB", "Overall": "5.0", "Content": "I'm just really deciding to get into photography and I wanted a really nice camera, but I didn't think I was ready for a DSLR yet.  So I researched on a really good super zoom and this camera consistently ranked as the best. I have not been disappointed. This thing has too many features to name, and yet it's super easy to use. And while I learn more and more it still retains the capability for me to customize settings. This camera is definitely worth the buy.", "Date": "July 30, 2012"}, {"Title": "excellent product", "Author": "JESUS DAVID MALAGON", "ReviewID": "R1D3ROBAAHBYL5", "Overall": "5.0", "Content": "Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 VideoI loved this very good product, the seller fulfilled all recommend it. I get no problems and packed", "Date": "July 26, 2012"}, {"Title": "Simply very good", "Author": "Rafael Cermeño", "ReviewID": "R1JP372J4CI1HA", "Overall": "5.0", "Content": "The best camera I've had are profecionales shots made ''by ordinary people but has many features that allow for higher quality pictures, has an impressive nsistema realicar automatic and manual shots, the videos are excellent, I would recommend for someone who is a photographer but like photos profecionales simply very good.", "Date": "May 4, 2012"}, {"Title": "Great camera", "Author": "Caro", "ReviewID": "RLA4R7TN0HLFO", "Overall": "5.0", "Content": "I 'm starting to enjoy the camera but for the little time I've used it is a great camera. Unfortunatelly i couldn't buy the new model!!", "Date": "April 20, 2012"}, {"Title": "Amateur's opinion", "Author": "georgiaopoly", "ReviewID": "R3SOU0S6QOOLIL", "Overall": "5.0", "Content": "This is a great digital camera for someone looking for something that has great image quality and has a great zoom range at an affordable price.  I purchased this camera about 2 months ago and absolutely love it.  Pictures get a little fuzzy at the 30x zoom without a tripod or an extremely steady hand (I recommend the tripod).  I did not think that I would have any use for the tilting screen, but the tilting screen makes taking angled pictures easier.  This camera's layout is very simple and is easily understandable.  The only thing that I wish that this camera had would be a hot shoe for a bigger flash to go into.  Overall, this is a great camera for someone looking for an affordable camera that has a high zoom capability and a great image quality.", "Date": "March 20, 2012"}, {"Title": "What a jump ahead in Quality!", "Author": "Alan Vaughn", "ReviewID": "R2C1W019H7ZF9L", "Overall": "5.0", "Content": "No disappointment here. I had a H50 which is the older version of this camera. It was good at 9megapixels with a 16x zoom, but this camera puts it to shame.The quality of the photos are spectacular with the larger sensor and upgraded processor. It has all of the bells an whistles you would expect from a Sony and then some. It's diverse in it's ability to deal with various shooting situations and gives you options to please everyone.I immediately fell in love with it. It makes the perfect second camera to my A77 for some quick shooting.I took it to a Disc Golf tournament and the comments of people standing near me when I zoomed in on the players driving off the Tee, were mostly of astonishment with how far the 30X lens reaches out there.If you like good pictures and want a camera worth the money, this is the one.It does it all at a great price and then it throws in HD video that will amaze you.", "Date": "March 12, 2012"}, {"Title": "*' Great camera", "Author": "A. Alharthi \"B.L.\"", "ReviewID": "R227G4ZG2RP1GR", "Overall": "5.0", "Content": "The best  zoom Ever tried for a digital cameraAnd the HD video is awesome.The only problem is the HD video extension, gotta have to covert itAnd there's no driver for MAC OS", "Date": "March 6, 2012"}, {"Title": "Amazing Camera for the price", "Author": "Lisa \"Lisa Renee\"", "ReviewID": "R34PT4P6UWPIAL", "Overall": "5.0", "Content": "If you are looking for a nice camera but don't want to spend money on a DSLR then I would recommend this camera. The basic functions are easy to use for an amateur like me and the pictures look professional! I have people asking me to take pictures of their kids and I always say it isn't me its the camera lol. On that same note there are so many functions available on this camera that I do not even pretend to know how to use. I am hoping to take a class with a local photographer soon to learn more about how to use this camera. For now I stick with the presets :)", "Date": "February 5, 2012"}, {"Title": "Camera discontinued?", "Author": "GWEGRET", "ReviewID": "REZAI4IOSJ6CD", "Overall": "5.0", "Content": "I bought this camera 3 months ago.  I loved it; however, I had some problems with it and returned it to the Sony repair center.Long story short, the shipment was lost.  Tried to buy another one and guess what?  The product has beendiscontinued.Does anyone know why?", "Date": "January 13, 2012"}, {"Title": "SONY CYBER-SHOT DSC-HX100V", "Author": "HJB", "ReviewID": "R18ROL29XW3Z2S", "Overall": "5.0", "Content": "I wanted to use the camera before I gave a review. So far, the pictures are good quality. I haven't went through all the options yet. I purchased the camera to take sports pictures. So far, most of mine are blurry. It takes too long to flash. I'm sure it is just a setting issue. Looking forward to getting the results I want.", "Date": "January 1, 2012"}, {"Title": "Converted HTML User Guide to PDF -- Sony DSC HX100V", "Author": "Seth H. Shaw", "ReviewID": "RPFCIHSVPH9GA", "Overall": "5.0", "Content": "I'm at a loss to understand why Sony only provides its expanded user guide in HTML format, not PDF.  Tired of endlessly clicking -- and waiting -- for the next page to appear, I decided to compile a PDF version.  It's not perfect since links within the pages are not active, but if you open Bookmarks (in Acrobat not your browser!) you'll see the contents for the guide with links to the proper pages.  The Dropbox link below will open in your browser (if you have an Acrobat plug-in) or in your stand-alone Acrobat program.  Save it from there.  Oh, BTW, love the camera, and looking forward to learning more about it.[...]", "Date": "December 31, 2011"}, {"Title": "Great Little, Does Everything Camera", "Author": "Charles Blackmore", "ReviewID": "RLSOIPTU8LFRW", "Overall": "5.0", "Content": "I have used this camera in many applications and it is a remarkable little camera. Dollar for dollar I don't know what you can find to match this SONY. To see the capabilities of this camera in stages from Wide-Angle to Maximum Zoom go to: (...)", "Date": "December 25, 2011"}, {"Title": "Excellent product with great output", "Author": "Gaurav Sharma", "ReviewID": "R2XFM3UH41WV1Y", "Overall": "5.0", "Content": "Bought this camera after using a point and shoot. Great results and easy to use. slightly bulky. has great clarity and my wife and kid love it.", "Date": "October 30, 2011"}, {"Title": "Best superzoom camera", "Author": "Luciano Menna", "ReviewID": "R2V80FH13OT9KI", "Overall": "5.0", "Content": "I have received my camera a week ago and I didn't have too much time to test it, but I'm very satisfied so far. This camera replaces an HX-1 I owned previously and I liked very much.Before buying it, I have studied almost all of the superzoom cameras (I still don't want to upgrade to DSLR) and my requirements pointed again to Sony. And the flexibility of accepting SD cards only helped a little more.First of all, I've got impressed with the professional look Sony has given to this camera, specially with the ring around the lens. They also have improved the intelligent auto mode, so some shots taken under low light are automatically recognized by the sensor and it does all the job. And the results are good.Other good improvement is the possibility of creating three customized modes easily accessible: there are situations you can anticipate some values for aperture and speed and you don't have time to switch between them. A DSLR feature, in the end.I haven't tried the GPS feature, but it can be useful for my Picasa web albums.One negative point, at least on my case, is that I can't use my telephoto lens VCL-DH1757 on the HX-100V.", "Date": "October 28, 2011"}, {"Title": "best camera for entrance level", "Author": "fitomenz", "ReviewID": "R14QO0CZ6YEQDE", "Overall": "5.0", "Content": "Sony always have a very colors on picture but this one is excellent, very easy to use, just need an manual book easy to use, the lcd is incredible and the price is fine, the video recorder is very good and sony change the battery for a littium but need a battery charge exterior not with the camera and good that cahenge the memory for a sd. I recomend this camera for his feature and price.", "Date": "October 23, 2011"}, {"Title": "Sony Cyber Shot DSC-HX100V  16.2 MP", "Author": "Mr. Reginald Daniels \"reggied\"", "ReviewID": "R1M9N05U8K6L0Y", "Overall": "5.0", "Content": "Great simple to use camera.  I would recommend it to anyone.  This is my third sony camera so I am really a sony customer.", "Date": "October 22, 2011"}, {"Title": "Sony DSC-HX100", "Author": "Ralph Magarian", "ReviewID": "R2XFX5BMSH2R7N", "Overall": "5.0", "Content": "I don't usually write reviews of any kind unless a product is top-notch. Sony has done it this time with their DSC-HX100. First, I must say that I have owned four digitals before. A Fuji, a Canon cyper and two Nikon DSLR's. The last one was a Nikon 5000 which made me walk stooped over from the weigh. I sold them all and tried the Sony. It's perfect. Takes great pictures,has fantastic magnification without the extra lens and simple to use. It does have enough of the options that I need.  I would recommend this camera to anyone that wants a little more than a point and shoot.", "Date": "October 10, 2011"}, {"Title": "trip", "Author": "marilyn", "ReviewID": "R1S6DN7G1APAUA", "Overall": "5.0", "Content": "I bought this after much pondering for a trip to Alaska.  I thought that even though it would give me the long focal length I wanted, it would be bulky compared with my older point and shoot. Also purchased was a small case, not from Amazon, I needed to see it in person.  This became my camera bag an purse for the trip.  Although the camera was larger, this was not a problem and being able to get long shots without changing lens was great.  The battery has about 4 hours , but if you are shooting as I was, the extra batteries and charger, which I also bought from Amazon, came in handy.  The battery provided must be charged in this camera, so keep that in mind.  I am very pleased with the picture quality, the quickness of the camera--allowed me to get the whale's tail!-- and the many features.  I am still learning how to use it and want to learn more about the low light exposure.  The only problem I noted was that at times the flash filled when I didn't want it.  this was easy to overcome, however, I just held the flash down manually.  This was probably an owner malfunction, not an isssue with the camera.  Looking forward to lots more pictures.", "Date": "September 28, 2011"}, {"Title": "HAVE HAD 4 OTHER DIG-CAMs IN  THE PAST YEAR", "Author": "FERN", "ReviewID": "RC9TC2Y7Q9IYM", "Overall": "5.0", "Content": "This Camera is WONDERFUL...I started last Christmas looking for a camera that had every thing I wanted and none had it all. I  ordered & returned 4 Dig-Cameras in the past year...I read about this camera and liked what I had read, and said why not try...It has most all the things I wanted in one. So I orderd it and I LOVE IT. It is very hard to please me...BUT It so far is GREAT..I found things on it I didnt even know it had..The pictures are wonderful color and clear. The ZOOM is great and you dont lose anything in the pic,with close or far zoom.also if you buy & keep, CK here on Amazon for the DEAL ON 2 PK BATTERIES & CAR CHARGER..$32.90 .MINE IS ON THE WAY.One at Sony will cost ya $59.99...soon as i fifure out how to post on here I will post PICs...You know there can always be a lemon , BUT SO FAR THIS IS NOT ONE...GOOD LUCK", "Date": "September 27, 2011"}, {"Title": "La mejor camara antes de tener una reflex!!", "Author": "Carlos Mafla \"Bronzon\"", "ReviewID": "R39CJRFRREZ8OY", "Overall": "5.0", "Content": "\"La camara es excelente! enfoca muy rapido, el sensor va de maravilla y las fotos salen perfectas!!!\"La funcion HDR es muy buena ya que no es necesario llevar al pc la camara!", "Date": "September 21, 2011"}, {"Title": "Not for Oversees Charging", "Author": "Iyad Jabbour", "ReviewID": "R1HYF24691M7T0", "Overall": "4.0", "Content": "Great digi cam. I didn't use all the features but nice. All the reviews gave it a hight ratings. 2 things I have:1-Flash is very stonge that I believe might give unrealistic colors.2-The charger that comes with it is hard to use outside the US-like plug-ins. And hard to take away if you are going on a trip. My suggestion to Sony. It's better to send a travel charger with the cam than a video camera charger, especially that mostly people will never use it while it's pluged. I wish they included the \"Color Art\" option in it.", "Date": "August 18, 2011"}, {"Title": "Rusa", "Author": "rusa", "ReviewID": "R6ZCWWLQ0P29M", "Overall": "5.0", "Content": "Adore this camera.  Wanted something new after my first sony...I think that in some detailes sony is better then canon or any other photo cameras", "Date": "August 18, 2011"}, {"Title": "great camera", "Author": "lovebug", "ReviewID": "RXA8AVVA964DS", "Overall": "5.0", "Content": "I was amazed with picture quality, shutter speed and low-light performance! This camera takes great photos and is very easy to use :) I started to take lots of pictures after I purchased this camera... it is so much fun to take great pictures!!", "Date": "August 17, 2011"}, {"Title": "Satisfied!", "Author": "Calm Ocean \"eMagnet\"", "ReviewID": "R2JF4Q7J18EFES", "Overall": "5.0", "Content": "This  point and shoot camera has finally meet my various expectations: long range, image quality, easy to use with options for manual controls, and high quality video, too.", "Date": "November 22, 2011"}, {"Title": "Great Bridge Camera", "Author": "Rickdeckard", "ReviewID": "R1IGHDGUXBR909", "Overall": "5.0", "Content": "The Sony Cyber-Shot DSC-HX100V is an excellent Bridge Camera, it takes amazing pictures, gives you a lot of alternatives do enjoy photography. The zoon is great.", "Date": "November 22, 2011"}, {"Title": "SONY HX-100V: Simply perfect... and affordable", "Author": "F. Erbetta", "ReviewID": "R6X9KM975Q1N5", "Overall": "5.0", "Content": "I bought the Sony HX-100V through Amazon a few months ago and I could write pages and pages giving you reasons why it is perfect in picture quality and price. But the best way for you to believe me is simply trying this camera. The 30x zoom is marvelous and it has a system that compensates the unwanted movements of your hands. The results are always sharp, never blurring pictures. And the colors it produces, WOW! Try it and you will get surprised. This will the camera I will use for the rest of my life.", "Date": "November 10, 2011"}, {"Title": "One Amazing Downgrade", "Author": "Nicole", "ReviewID": "R2L17PVI66PTNH", "Overall": "5.0", "Content": "I \"downgraded\" to this camera after becoming exhausted with having to buy and carry around all the expensive accessories for my DSLR.This camera is a DREAM. It's sharp, compact, and has a very wide range of capabilities. It's fast, has a superb zoom range (freakish actually)and takes extraordinarily sharp images. It is well worth what I paid for it. My only complaint is the view-finder. I'm getting used to using the LCD screen but I was surprised initially to find that the view is merely a tiny, interior screen. This camera, with all it's capabilities, is fabulously convenient. I would give it more than five stars if I could.Some things that impressed me:* The flash does not wash out the subject.* Even in low-light the images are sharp!* The full-size image is not pixelated but sort of fuzzy. This really enhances the photo.* The zoom has a crazy range. Of course when zoomed to the max it's very sensitive to the minute shaking of your hand but set it on something stable and viola!Buy it. You won't regret it.", "Date": "November 4, 2011"}, {"Title": "Excellent Camera!", "Author": "JESUS ARTURO NAVAS", "ReviewID": "RR6AKBNLRTOHA", "Overall": "5.0", "Content": "I came to Venezuela a few days ago and so far I have not done more to explore all the wonderful functions.  It may not be an expert in digital cameras, but I think the image quality (especially low light) is excellent, not to mention the optical zoom and HD video quality.Me llego hace unos dias a Venezuela y hasta ahora no he hecho mas que explorar todas las funciones maravillosas. Tal vez no sea un experto en camaras digitales,pero a mi juicio la calidad de imagen (sobre todo a poca luz) es excelente; ni hablar del zoom optico y calidad de video en HD.", "Date": "October 5, 2011"}, {"Title": "Sony Cyber-Shot DSC-HX100V 16.2 MP 30x Optical Zoom Lens", "Author": "Ernestine Woodcock", "ReviewID": "R1SZ9J3UNMB2RB", "Overall": "5.0", "Content": "For my use, it's perfect.  Just returned from a National Parks tour and the pictures are amazing.  Went to a grandson's soccer game and the shutter speed and zoom lens provided action shots not attainable prior to this camera.  Not real happy with indoor shots or scene selections, but using intelligent auto on everything gave me outstanding results.  Sony personnel are very helpful for operating questions.", "Date": "October 1, 2011"}, {"Title": "Excellent Camera", "Author": "SeMSeM", "ReviewID": "R22FJ9HMH9YDDI", "Overall": "5.0", "Content": "I bought this camera a month ago after lots of readings, and I must say that I am impressed, it is by far better than the competition in the market either from Fuji, Pana, Canon or Nikon. It almost have all the settings that are in DSLRs at a very good price.", "Date": "July 25, 2011"}, {"Title": "Video, software and transfer to computer.... a disaster", "Author": "Fernando Garcia", "ReviewID": "R3PX6UXIQZMNY3", "Overall": "1.0", "Content": "I have been using the camera for almost 6 months and pictures were good. It was only when i tried to transfer the videos to the computer when everything went wrong.1. Incompatible with Mac.2. Software was lame and could not download a significant part of the videos.3. Videos cannot be seen as in the camera. They break, accelerate, slow down and sound is not precise.Only buy this camera if you like the real 8 megapixel resolution on your pictures, 16 is a bluff, there is no difference between the both of them, except for the usage of memory.Only buy this camera if you are going to visualize the videos on the camera, and looove to spend hours on your computer researching for a way to get your videos.Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "Date": "April 9, 2012"}, {"Title": "PROBLEM BOX", "Author": "MAVERICK", "ReviewID": "R122HUQCSRVPRW", "Overall": "2.0", "Content": "Show defect... show defect ... show defect ... show defect... show defect... This show me defect ... A problem is a box ... no security", "Date": "December 18, 2013"}, {"Title": "dont you dare deal with them", "Author": "jamal alrajhi", "ReviewID": "R3EWA5HKLOZD8B", "Overall": "1.0", "Content": "the seller describe it as a good condition camera. I describe it as what the hell are you talking about. that camera looks like a thousand year old. it looks like some one legacy from his grand grand grand grand father, or you know what it was used at the Iraqi war. please return my money back and take your flinstones camera back with no twisted games.thank you", "Date": "November 7, 2013"}, {"Title": "BEAUTIFUL CAMERA OMG.", "Author": "Rick", "ReviewID": "R1OEBDN4O6LEXS", "Overall": "5.0", "Content": "At first I was kind of skeptical buying this used from a user who only had 3 people total rate them 5 stars. When I got the package today and opened it, everything was neatly organized. The charger and wires rubberband-ed and in a bag, and the camera (along with the neck strap) in a camera case. Everything works more than fine and is in excellent condition. I still have little knowledge of how to use this kind of camera, but I'll learn. Thanks ARCaron!", "Date": "January 16, 2013"}, {"Title": "Great Camera", "Author": "Shahzad Saleem \"Shawn\"", "ReviewID": "R1AHBT2O14Z5V2", "Overall": "5.0", "Content": "This is a great camera. I have used many cameras in life but none come close to this one in functions and quality.", "Date": "February 3, 2012"}, {"Title": "Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full", "Author": "subero86", "ReviewID": "R3TLAYAB6DK1KF", "Overall": "5.0", "Content": "Excelente , el zoom es lo mejor que he visto, nitidez increible, lo mejor en camara que he tenido, las fotos no salen nunca movidas.", "Date": "January 24, 2012"}, {"Title": "ESPECTACULAR", "Author": "GONZALO FUENTES", "ReviewID": "R146O3FXVVWOKW", "Overall": "5.0", "Content": "HA SIDO UNA GRATA SORPRESA SUS CAPACIDADES . LA CALIDAD DE LAS FOTOS Y VIDEO SON INSUPERABLES.RECOMIENDO DE TODAS MANERAS ADQUIRIRLA.", "Date": "November 9, 2011"}, {"Title": "Awesome Camera For The Price", "Author": "Bobby Flash \"Bobby Flash\"", "ReviewID": "R34HUBWUCC30EK", "Overall": "4.0", "Content": "Had this camera for a few day's now an it is nice,just two things i think Sony sould fix on it,in video mode  when go to press the record button it's a little slow to start recording an i fine you  hear the zoom on your recording as you are zooming in or out so if you are filming in a quiet place you can hear it, but as for the rest of the camera it is great, video an still's picture's  fantastic, i recommend it to anyone who wants a good quality camera", "Date": "October 14, 2011"}, {"Title": "Not a bad buy", "Author": "Nazim", "ReviewID": "R1C006L46TK1NM", "Overall": "4.0", "Content": "To be honest the Camera is not a bad buy especially for someone like me who take photos for my partygrenada website. However, I am having a constant issue of the photos showing red. In other words instead of getting the natural colours I am getting a constant red in the photos.I do admit that I am still playing around with the Camera, but after owning (I still own them) a Sony DSC-S85, DSC-F828, DSLR-A100, DSLR-A550 and a DCR-SR88 you would think I am fully aware of the 'basic settings' of the DSC-HX100. like I mentioned the redish colour issue is my only problem with that Camera besides the Battery life.", "Date": "August 31, 2011"}, {"Title": "Very good camera. I'm very satisfied.", "Author": "Brian Pinto", "ReviewID": "R2GULYYRXCIU5", "Overall": "5.0", "Content": "It is a very good camera. I am very satisfied with it's performance. I can surely recommend it for anyone looking for a bridge camera.", "Date": "August 19, 2011"}, {"Title": "Awesome Camera... But I Need More Inormation", "Author": "Peter Gordon \"PAPG\"", "ReviewID": "R124OAWV1BGJ45", "Overall": "5.0", "Content": "I just received the camera so have not gotten the opprtunity to fully explore its capabilities. Nonetheless, the few pictures I've taken so far are superior & the video quality is 'super excellent'. Notwithstanding, some pictures seem to be excessively red when viewed on the camera's display screen.  Is there a particular cause for this phenomenon?I just started using the camera 2 days ago, but didn't get the Manual with it because the bearer (a friend) after receiving the package, opened it, and mistakenly left the manual behind, this I'm unable to read up about the camera. I will get the manual eventually, but is there somewhere online it can be downloaded?", "Date": "July 19, 2011"}, {"Title": "Bad focus for a Sony camera", "Author": "Donald P Otlewski", "ReviewID": "R2KPX91CAL25W1", "Overall": "1.0", "Content": "What can I say I was sadly mistaken to believe that this camera was good. I read the reviews and saw that there were some problems with the focusing this camera. I bought it anyway because I have had very good results with the Sony camera that I have. I first thought that it was user error. I used this camera for a week and was very dissatisfied Amazon took it back that made my day. The only thing is that I have two extra batteries that will only fit Sony cameras of this model. Would not recommend this camera to any one.", "Date": "December 19, 2012"}, {"Title": "Had to ship it back...", "Author": "N. Menas", "ReviewID": "R1FYGXQMHOI5D", "Overall": "2.0", "Content": "Received timely from GRL Recoveries and the camera looked brand new. Unfortunately, manual focus did not operate properly and camera seemed flimsy. Zoom lever around the shudder button was loose and zoom lagged behind actuation. Similarly frustrating was the rattling of the 4 way controller on the back of the camera, sounding as if it had rattled off, at least on the east side of the switch. Finally, focussing at long zoom or in low light was impossible as camera continually took out of focus pics in every mode. I sent the unit back to GRL Recoveries and have asked for a relacement.  I will let you all know how they respond to customer returns and if they promptly replace obviously defective products.", "Date": "April 24, 2012"}, {"Title": "Espectacular", "Author": "Fabian Avellaneda", "ReviewID": "RM4IEQ2ODCNDS", "Overall": "5.0", "Content": "La cámara ha cumplido todas mis expectativas, toma fotos espectaculares y los videos en alta definición son buenos. Recomiendo el producto para personas que no son profesionales de la fotografía.", "Date": "November 28, 2011"}, {"Title": "Good camcorder but we expect that Sony fix some issues", "Author": "MC", "ReviewID": "R1HMJQV76NGH5F", "Overall": "4.0", "Content": "I gave 4 stars because Sony can do much more.This camcorder is one of the best in its category. Thus we expect that Sony will fix some issues like the ones mentionned by the reviewers and especially the following :* wide-angle lens 27 mm - Sony can make better; other brands does better: Nikon(24mm) and Panasonic(25mm)* Zoom - we could have a perfect image by stretching it to the higher zoom at the higher megapixel - We expect Sony to give more than 35x zoom next year ! Many  other brandt already released them.* The Video size : It will helps if Sony can not only give the HD record option, but also the low resolution option like WVGA, VGA, XVGA; not only HD takes a lot of places and it consumes time to convert from HD to a * * lower resolution with a software. Why not having this features directly from the camera.* Video stabilization and speed - We expect Sony to lower the speed while taking video and to give a better video stabilization.* For a better ergonomic Sony could swap the selector roller and the on/off switch button and also put the finder/LCD button behind the camera instead(like near the LCD screen)* Price - The camera worth the price but other good brandt are 100$ or more cheaper. Sony could revise it next year to get more buyers.Congrats to Sony for these features :- Background Defocus- Superior Auto Mode- Sony PMB Portable software- Motion Detection- Sweep Multi Angle Mode- Anti-Motion Blur Mode- TransferJet technologyThis movable LCD is very good and useful to take photos from different angles, we hope Sony will still keep it in future cameraI recommend this camera to Everyone", "Date": "June 13, 2011"}, {"Title": "received replacement camera", "Author": "Barry S. Ephaim", "ReviewID": "R2YW1JE2BMO211", "Overall": "4.0", "Content": "First camera I received was factory defective right out of box. Customer service from Sony was non existant. Still haven't gotton a reply. Amazon, on the other hand. in thier usual manner, immediately upon getting my complaint sent me a new camera with return label for defective one. New camera works perfectly. It is a cross between traditional small point and shoot and larger more complex programable lens changing cameras. It fills its nitch perfectly. The 30X zoom is both quick and sharp.It can be simple point and shoot or you can easily program it for many specific weighted applications like appature, shutter speed, skin tone, night time hand held or tripod, and many others. Instruction manual not easy read and am still figuring out some features, but getting great pictures with more advanced stuff to come. Still use older sony when small size important and lack of zoom is not important.Automatically shifts between tilting view screen and viewfinder. easily deletes unwanted pictures, and very easy to use HD Camcorder. Low price make it incredible camera. Definately recommend if willing to carry larger than point and shoot camera.", "Date": "November 27, 2011"}, {"Title": "Excellent", "Author": "RR", "ReviewID": "RH3VFMBQMBZ73", "Overall": "5.0", "Content": "I have started using and love it. Excellent zoom, quality of video. I have tried indoor and out door. Not tried in low light yet.Overall, I am very much satisfied.", "Date": "September 29, 2011"}, {"Title": "Sony Cyber-shot DSC-HX100V", "Author": "Pam :D", "ReviewID": "R12LJDNV6MZ86A", "Overall": "5.0", "Content": "I am still learning how to use all the new features this camera includes, but so far, I'm delighted with the photo quality and the zoom range is amazing.", "Date": "August 31, 2011"}, {"Title": "Happy with it ...", "Author": "Dips", "ReviewID": "RXCJCGICI4ASI", "Overall": "5.0", "Content": "I bought the camera after a long wait and the wait was worth it . I like all it's features and mostly tht can record HD quality video . I would say for a beginner it's a good way to start photography... Worth it's price!!!", "Date": "August 10, 2011"}, {"Title": "Auto preview - deal breaker!", "Author": "yo", "ReviewID": "RO24ITDYKFQ3", "Overall": "1.0", "Content": "All previous reviews note the plus qualities on this camera. Like others, I have used/have other brands so I'm familiar with many of the Pros and Cons of the cameras.When I got it and started shooting pictures I loved the camera, then testing out the video was even better, then I really started paying attention to how I take pictures, sometimes I just want to shoot as many in a row as I want but I found that I was not able to, the auto preview would not allow me to shoot another picture until that one went off the display, hence my annoyance.  This may be small for some of you but big for me, even with the burst effect turned on.  I missed too many shots.I looked for an option to turn this off, could not find anything in the documentation.  Got online with Sony support and they confirmed that this is by design, there is no option to turn the auto preview feature off.So, if you are not concerned with having to wait for the display to clear so you can take your next picture, then I give it two thumbs up.I have several 8gb and 16gb sdhc cards so I'm not concerned with filling up the card with unnecesary pictures.  Editing comes afterwards, so for me, auto preview is the deal breaker.  I'm returning the camera.", "Date": "June 16, 2011"}, {"Title": "Sony DSC-HX100V", "Author": "Juliet Hettinger", "ReviewID": "R2OHL762T4TAD9", "Overall": "5.0", "Content": "I just bought the new Sony DSC-HX100V and it rocks!  I haven't mastered all you can do with it yet, just getting started.  I'm looking for some tips, advice etc on how to use all the features. I'm coming from using a point and shoot (Sony DSC-W200) so it's a lot to learn. Anyone interested in chatting about this camera and teaching me all the features please e-mail me at JulietNoel35@gmail.com. Thanks!", "Date": "June 23, 2011"}, {"Title": "Just not right for me.", "Author": "Tom", "ReviewID": "R2K3TXPQ9PIAW4", "Overall": "3.0", "Content": "This camera is fine, it does have a nice zoom but it didn't blow me away. Probably its just me, I had some unrealistic expectations. It does have lots of options and one can have lots of fun with it. I do however own a Samsung point and shoot T34-HD and the quality of my still pictures are just as good. (since I have this camera for a few years I just expected this Sony would do a even better job)The video was great, my Samsung works very good but this one is better.As for the zoom I didn't use it as much as I thought I would, the pocket size of my Samsung works better for me and the menu  is just more to my taste. I was hoping for a new gadget but I will just stick with the old but great.I am not a professional I just like taking pictures and this camera didn't convince me to keep it.Update: I think I found what I was looking for: DSC-HX9V , its also a Sony, smaller zoom but its more functional for me. The size allows me to keep it in my pocket or at least not in plain site all the time, the video is just as stunning the rest of the gadgets are just the same as HX-100V. As I mentioned before HX100V was great, it just was not right for me. I'm a happy camper now.Pictures came out great.", "Date": "September 6, 2011"}, {"Title": "Maybe I Got a Lemon", "Author": "velero", "ReviewID": "R3RP6FODDWG2C9", "Overall": "2.0", "Content": "Despite its shortcomings, my HX1 has been so much fun to use that I ordered the HX100 directly through Sony two months before it was released. How could I go wrong with an updated version with a Zeiss lens?No one was more disappointed than me when in the HX100 images the soft ends of my cat's black fur looked red and gray. The mud-caked 25-year-old reflectors on the tractor out in the field looked like they had been washed up and connected to electricity.I re-initialized the camera and reset the white balance, but nothing helped, so I had no choice but to send it back to Sony.I should have known that going from 9 megapixels on the HX1 to 16 on the HX100 was too far a leap, so now I cherish my HX1 more than ever.Still, after reading so many positive reviews, maybe I should have considered an exchange.Has anyone owned the HX1, purchased the HX100, and found that it was worth the upgrade? (I don't care about video).", "Date": "July 26, 2011"}, {"Title": "Sony Cyber-Shot DSC-100HV Digital Camera", "Author": "Timothy J. Healy", "ReviewID": "R1ZG6AYG2UTOP7", "Overall": "5.0", "Content": "This is one fantastic camera. I researched about a dozen cameras befor I selected this camera. It's the best of its type and price range. Also, I used Amazon's 6-month payment plan, making it easier to do business with Amazon.", "Date": "October 5, 2011"}, {"Title": "BF SONY CYBER-SHOT", "Author": "Robert E. Finney \"Finns\"", "ReviewID": "R24PVQQPVNU0QO", "Overall": "5.0", "Content": "I have not had the camera long enough to give it a complete evaluation. So far the limited use I have given it has proved to be excellent.", "Date": "October 1, 2011"}, {"Title": "Best camera Ive owned", "Author": "randel", "ReviewID": "RQLIHX2VTT4KX", "Overall": "5.0", "Content": "Really did alot of research and also had a niece who bought this camera at a different retailer, I got a better deal on Amazon!! I love shopping Amazon.  Love the camera, lots of great functions, does a lot by itself, pretty much a point and shoot. Best decison I have ever made. Worth every penny.", "Date": "September 23, 2011"}, {"Title": "Just a normal digital camera, but bigger, with GPS, and with extra zoom.", "Author": "Felipe De la Peña", "ReviewID": "RU5HAD7I4AO75", "Overall": "3.0", "Content": "I ordered last Friday and this Monday was already in my door!!! wow!. But well, this is a review for the camera not the delivery service, right?I've been using a Sony DSC-W35 for 4 years, it's a fantastic camera with awesome macro and great landscapes autoconfig, but in my last travel I really missed all these new tricks like the wide panoramic pictures -specially at Mariposa Groove :'(- and extra zoom. So, based on my experience with Sony, I decided to give Sony another try with the HX100V (the Nikon P500 was very close).I bought this camera mainly because:1. I'm a hiker, so I really want to keep track of my sightings in each shot with the embedded GPS. Neither Nikon nor Canon have this.2. I like wild life, so I need extra zoom.3. I love macro-photography, so I wanted a camera with the same macro capabilities of the DSC-W35.4. I'm addicted to accessories, and this camera will kept me away from bankruptcy because it has so few of them. I can reuse the same memory sticks that I had for the old camera and use the SD cards of my other gadgets. If I would've gone for a DSLR, I'd simply never be happy knowing that I'd never be able to afford the neverending list of nice accessories.5. I love landscaping, so I need good panoramic features.Why three stars?The camera zoom do not focus in the medium distance. If you want to take pictures from spiders that are like 2 or 3 meters distance you need either approach to the dangerous spider the enough to use the macro or walk away like 10 meters to use the zoom.Conclusions:1. Except for letting you to select what subject you want to focus, this camera will take your shots and exclude you from thinking. If you just want to take family photos and video and impress your friends with the zoom, this camera is definitively for you.2. If you are going to spend 430 bucks in this camera, may be is better to spend another few bucks and get a DSLR: they are the same weight, same size, same functions and will let you take better shots.3. For me, this is just a normal digital camera, but bigger, with GPS, and with extra zoom.4. For me, this camera (and the Nikon P500 and the Canon SX40) are not an intermediate between digital cameras and DSLRs, I think these are just trivial digital cameras with some steroids.5. This camera is just for fun. If you want to be seriously fun, get a DSLR.", "Date": "November 2, 2011"}, {"Title": "Viewfinder", "Author": "Amazon Customer \"mychiquita\"", "ReviewID": "R24P3L5VIGAAU", "Overall": "3.0", "Content": "Not a review (yet) but a question that Sony couldnt answer.  Image is blurry through the viewfinder.  When you press shutter button halfway, green focus buttons appear but the view finder image remains blurry.  I want to use the VF for most pictures and for focusing.  Can this be remedied?  Big box electronics store staff could not answer either.", "Date": "September 28, 2011"}, {"Title": "Disappointing Image quality", "Author": "Steve in Dallas", "ReviewID": "R1SK8CN5Y0U8S5", "Overall": "3.0", "Content": "After 300 pictures taken with the range of settings recommended for various lighting conditions, I took advantage of Amazon's generous return policy. I had wanted a good long-zoom camera to go with my excellent Panasonic LX5, and ordered the HX-100 based on users' photo samples on dpreview.com and comments of \"professional\" photo web site reviewers. Now I understand why so many samples in discussion groups and flickr.com are pictures of well-lit flowers, bees and birds. That's where this model seems to excel. It's not even close to my much-missed Panny ZS3 and FZ-18 in IQ. That's not to deny the fun factor that comes with the HX-100's many bells and whistles. At day's end, it's IQ that matters, so my personal conclusion is buyer beware. I find it hard to believe there are so many glowing \"user\" reviews for this $450 product, given the its mediocre IQ. Now the challenge is finding the super-zoom camera still on the market that's not mottled by too many pixels on a small sensor.", "Date": "August 19, 2011"}, {"Title": "so far so good", "Author": "akram", "ReviewID": "R1EOQYQ0QA3XXR", "Overall": "3.0", "Content": "\"yesterday was the first use, the first impression was wooooooooooooow amazing' I couldn't take bic in daylight, but indoors to be honest it's like other digital cam with high resolution & body. I'll wait & see how much it can go far outdoors\"", "Date": "February 24, 2012"}, {"Title": "Good camera, GPS does not work", "Author": "F. Mo", "ReviewID": "R10H8KYDF7EWSR", "Overall": "3.0", "Content": "One of the main reason I chose this camera is the GPS function.  But it did not work on the unit I received.  I was in an open soccer field for one whole hour with the camera on and this camera still could not find the GPS signals it needed.  So, no position information was available with the pictures taken.  It could barely acquire three satellites (kept on loosing them), but could not found the fourth one it needed.  I will send this camera back for a refund.Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "Date": "August 27, 2011"}, {"Title": "ok dslr, pretty good for price", "Author": "Carlos", "ReviewID": "RLF1LPEJI9ZIO", "Overall": "3.0", "Content": "Sony looks they are trying to undercut canon and nikon, looks like their products shoot pretty decent pictures, but that versatility and design lags behind canon and nikon", "Date": "October 22, 2011"}, {"Title": "Some cool extras but awful quality!", "Author": "hunter1", "ReviewID": "ROK6FFGP63E5F", "Overall": "2.0", "Content": "If you want to look beautiful in your pictures, do not even go close to this one, It has an extra wide lens plus a 16MP processor in a point and shoot camera which means worst face capture, you won't like your pictures with this one, if you only shoot outside views, this is a nice camera but if you like to be in the picture, this camera makes you hate yourself. I suggest buying Canon G11 or G12, 10MP but great picture quality, G11, G12 are keepers, this one is not. Another problem is overly saturated, high contrasted pictures, very unnatural and later on you'll even have problem editing them in Photoshop.", "Date": "July 24, 2011"}, {"Title": "Quality issue", "Author": "From the South", "ReviewID": "R2AA8B7DPKOXZY", "Overall": "2.0", "Content": "The camera works great, except that, when moved, the lens \"rattled.\"  It seems it did dot affect its performance at this time, but did not want to take any chances and had to return it.  Too bad:  I always expect the best from Sony, but, no more...", "Date": "July 17, 2011"}, {"Title": "useless user CD", "Author": "J. M. Maggi", "ReviewID": "R1JGW84GQ3CPMY", "Overall": "1.0", "Content": "After much research I ordered this Sony camera. It's a great camera with a useless cd manual. I've got a mac and maybe that's the problem but this manual is about useless.To  do the most basic research into the operations of the camera turn into a hair pulling  plate throwing frustration filled excercise.", "Date": "September 27, 2011"}], "ProductInfo": {"Price": "$438.90", "Features": "Vario Sonnar T 30x optical zoom\nFull HD 1080/60p to capture fast motion movies\n16.2 MP \"Exmor R\" CMOS sensor for superior low-light performance\nBacklight Correction; get details in difficult lighting\nHi-speed Linear focus for dramatically clearer images", "Name": "Sony Cyber-Shot DSC-HX100V 16.2 MP Exmor R CMOS Digital Still Camera with Carl Zeiss Vario-Tessar 30x Optical Zoom Lens and Full HD 1080 Video", "ImgURL": "http://ecx.images-amazon.com/images/I/41zGjABjW6L._SY300_.jpg", "ProductID": "B004H8FND0"}}