{"Reviews": [{"Title": "Excellent compact camera at great price", "Author": "Winter", "ReviewID": "R82CO9FA39GN5", "Overall": "4.0", "Content": "All compact point and shoot cameras have tiny sensor about the size of a fingernail on the pinkie finger and then the manufacturers cram a large number of pixels onto the sensor so each photosite is too small to be effective at capturing light. This results in pictures that seldom look great at 8x10 and picture taking at ISO 400 or lower. Add in slow lenses and these are good only for snapshots and 4x6 pictures. Enter the new Micro Four Thirds camera format that has a sensor that is 6 times the size of the compact P&S; cameras and with a more conservative 10-12 megapixels in total and able to produce good looking 11x14 prints from pictures taken at ISO 1600.This is still a small and lightweight camera. The camera with its 14-42mm lens attached and battery inserted weighs only 17 ounces. My DSLR zoom lenses alone weigh more than that, and some more than twice as much. The camera is unusual in that it not only has an internal flash and a hot shoe for a standard flash it will also wirelessly control an off camera flash which can be either one of the expensive Olympus strobes or the excellent Metz 50 AF-1 strobe that costs half as much at $199. The upper end Nikon cameras have this feature but it is unusual to find it on a small camera such as this.Lens quality is good though they are slow. f5.6 at most focal length settings which is why the high ISO capabilities are so valuable. The camera has internal optical stabilization that is not very good. Optically stabilized lenses are at least 3 times as effective. This is compounded by the lack of a viewfinder. Having to hold the camera away from your face to frame a picture increases camera motion a good deal. I took a series of shots at 1/160th with this camera, a D300, and a D3, and the lenses on the Nikon cameras were not optically stabilized but still the Nikon shots were a great deal sharper. Bracing the camera against something, a tree, wall, rock, or using a tripod would help.In spite of the camera's shortcomings it is a very big improvement over the very best compact point and shoot cameras available. The larger sensor is the critical factor. For 50% more cash the Sony NEX cameras provide a still bigger sensor and faster lenses but the advantage in size is not nearly as great as with the MFT micro four thirds cameras. For anyone seriously into photography and less concerned about weight on of the entry level DSLR's from Nikon or Canon are a better long term investment.My wife has been using this camera on our travels and loves it. She is not a camera buff and dislikes reading manuals but found this camera with its sophisticated scene modes very easy to use and with great results. A simple example was taking pictures of flowers on a trip to Costa Rica (which surpasses any other place in this regard where we have traveled). There is a macro flash mode that provided perfect exposures of the flowers with a completely black background. I know how to do this with my Nikon cameras and flash but the Nikon flash alone costs as much as the Olympus camera with its built-in flash and zoom lens (and weighs as much too). Scene modes are nothing new but Olympus has taken a step further than the usual \"people\" \"macro\" \"scenic\" modes I have found with point and shoot cameras.The Olympus is twice the size of the average P&S; camera but provides 6x the image quality and sells for the same price or less than that of cameras like the Canon G series with their tiny sensors. And the Olympus offers the option of interchangeable lenses should you want to do so in the future. I do not even try to use a P&S; indoors or in low light situations, but the Olympus is one that rises to the occasion very well. It is not a perfect or the best camera but for $450 it is the best in its class by a long shot.", "Date": "March 6, 2011"}, {"Title": "Wow. What a great setup!", "Author": "GOB PROGRAM Y/N \"Example of a Real Name\"", "ReviewID": "R3VZFHHV6UTRIE", "Overall": "5.0", "Content": "I've owned a handful of point and shoots from Sony to Leica, and 3 DSLRs. Two Canons and a Sony Alpha. Like so many people, I got into DSLR's because I wanted something that took better pictures than my cell phone does. Sadly, DSLRs are huge bulky expensive things, packed full of needless complications, not to mention the unavoidable snobbery of psuedo-photographers.This camera got me, and most, exactly what I wanted. Portable, SLR quality pics. Less complicated controls. Not LESS control, LESS COMPLICATED control. It's not just easier, it's more evolved. The DSLR dial is another needless thing. Buttons are just easier to control.Camera has lots of iArt setting things. Cool. 16 programs, full auto, full manual, etc. The JPEG processor is an industry leader. The camera is well made.The lenses are also great, and a good pairing. You probably wont need to buy anymore, and you can always ad filters and adapters to them.You can get an inexpensive adapter to use full sized SLR lenses if you want.The firmware updater is brilliant. You can ad new features to your camera, and lenses, with an excellent one-click updater. In fact, Olympus just released a new version that greatly speeds up the auto-focus (which was a common gripe), and also ads compatibility for newer types of lenses and digital viewfinders. How cool is that?!?", "Date": "December 27, 2011"}, {"Title": "Awesome Camera", "Author": "Amazon Customer \"Tippy\"", "ReviewID": "RNPD1WM22WKCA", "Overall": "5.0", "Content": "I am no photographer, so I wanted a \"real\" camera that would be easy to use. This is it! It has so many great features. The art filters are really cool and the on screen controls in the iAuto setting make things so simple. I also bought the Olympus Pen EL-1 for Dummies so that I can learn about all of the features of the camera. I have only had it for a week, but so far I could not be happier. The quality of the pictures is incredible. I am going to be learning about some of the manual options so that I can do some of the settings on my own. The large lens that comes with this kit is incredible. I don't think that I will be using the smaller one very much.If you don't know much about cameras, but want to upgrade to a camera that gives you the option to go manual, this is the one. You can go from fully auto to fully manual and everywhere in between.", "Date": "June 3, 2011"}, {"Title": "Great quality pictures", "Author": "Michael J. Clark", "ReviewID": "R1OXE19GSKKOB8", "Overall": "5.0", "Content": "I purchased this product for my wife as a Christmas present.  I have several cameras including the Olympus e620, and i am always amazed at the quality of the pictures this camera takes.  It was this reason that I decided to go with the Olympus pen instead of the competition, and I am quite glad i did.  This camera takes just as good of a photo at the e620, and is about 1/3 the size.  What's more, and what makes it ideal for my wife as that it is able to take these photo's without having to have too much knowledge, just point and shoot, and you can get a studio quality image.  The only drawback i see is not having a viewfinder, although one can be purchased.  This can make it difficult to use on a sunny day, however, she does not seem to even notice, mainly because most inexpensive cameras these days don't have a viewfinder.  The only other con is that the lenses seem to be a little expensive to add on.A final thought on this camera is don't buy the more expensive model.  There simply is no need, why?There are two types of people that this class of camera should appeal to, the first would be an amateur who just wants to take better quality pictures without having to study photography.  For these people the camera fits the bill perfectly, and the more abilities the camera has just makes it more confusing.  When this happens you either get frustrated and stop using the camera altogether, or you just ignore the advanced functions because they are too much of a bother.The second type of person is the more advanced user, who is looking for a compact camera, and is willing to sacrifice the advanced functions for an inexpensive alternative when it is just not practical to bring a bunch of equipment along.In both cases this camera fits the bill and fits it at really inexpensive price point.  I think for just about anyone, this camera is a terrific value and a great purchase.", "Date": "March 9, 2012"}, {"Title": "Best value I found on this item", "Author": "Shahidur Rahman", "ReviewID": "R4U4W21RJGCMP", "Overall": "4.0", "Content": "I researched extensively before I bought this item. This definitely was  the best value I found. This is an addition to my Olympus E seris DSLR. I was looking for a compact DSLR than the bulky DSLR's and I wasn't disappointed.", "Date": "June 27, 2011"}, {"Title": "Great fun for all kinds of situations!", "Author": "Fusiondave", "ReviewID": "R1YDIUQJUIIYEH", "Overall": "5.0", "Content": "At a refurb price of under $400, the PEN E-PL1 with 2 lenses is a bargain!  This camera is so portable that it's my choice among other dslrs in my possession in many cases.  Yes, the controls for most settings are hidden under the myriad of button pushes but the SCN modes are pretty convenient and good for most situations.  It certainly won't replace a full dslr for a serious photographer but it fills a niche at a great price point!  And yes it takes great pics!", "Date": "July 6, 2012"}, {"Title": "compact efficient beauty that is affordable!", "Author": "T. Beat", "ReviewID": "R1OIR504BRA6FJ", "Overall": "4.0", "Content": "My Konica Minolta digital slr was stolen in December so I've been trying to find it's replacement for a couple of months now. I was looking for a smaller type of SLR but didn't want a point & shoot. When I traveled, I didn't like that my prior big dslr would spot me as an out-of-towner so something less obvious would be plus but not critical. I learned more about the compact-camera type through online research and by going to Best Buy for advice. I found this lower end model of the Olympus PEN that I thought would do the trick. It reminds me of my first camera, a 1981 Nikon EM, but could it do the job?Found out real fast that yes, it can do the job. I went for the body with two lenses and love them. It's small, light, easy to use, has automatic settings as well as manual (yay!). The only thing that I'm still challenged with is the manual focus. I haven't learned yet how to access this which I really prefer for certain shots. The auto focus can be a bit sensitive so that's why I prefer the manual as well.Overall, for the price (only $375) for two lenses, the quality of photos, and the convenience, I highly recommend this line of cameras.", "Date": "April 15, 2012"}, {"Title": "Good Kit", "Author": "J. Glass", "ReviewID": "R2CL6WCH7T85OW", "Overall": "4.0", "Content": "This is a very good kit to step up from a point and shoot (P&S;), as the EPL-1 has features of both a P&S; and a DLSR. This kit also includes both the 14-42mm and the 40-150mm lens.  I found the E-PL1 easy to use, with good image quality from the kit lenses.  Higher ISO photos, however, have a lot of noise, as do long exposure photos.  The in-camera menus are not as easy to use as, say, an entry level Nikon DSLR but they work.  The supplied software is not as good at others out there but it is sufficient and necessary if you shoot in RAW format.Overall a solid starter kit in the micro 4/3rd world.", "Date": "April 27, 2013"}, {"Title": "Great Camera Setup", "Author": "Jeff Abbuehl", "ReviewID": "RG1B6QD030USY", "Overall": "5.0", "Content": "took this setup on a Trip and took some awesome pictures very easy setup easy to use and easy to veiw", "Date": "December 16, 2012"}, {"Title": "A very fun little camera", "Author": "Stephen Spitzer", "ReviewID": "RTK91TFP4189E", "Overall": "4.0", "Content": "I bought this after seeing lots of micro four thirds mentions in camera forums and such places. This particular model is the the cheapest one out there, and since I was not sure how much I would enjoy it I bought this version. Actually, bought a refurbished one through Amazon along with two lenses.  I also bought some accessories, the best one is the VF-3 viewfinder, which is a great match for this camera.  I also bought the E-PL1 For Dummies book, and have used it often to figure out what is going on as the manual that came with the camera is not overly clear to me.There are a good number of buttons to push to get to some menu items I use often, and that is a bit bothersome, but overall the camera is lots of fun to use.  I am coming off a Panasonic FZ150, and was not sure if I would enjoy the Olympus as much, but since getting it I have hardly picked up the Panasonic.I am not making this overly technical, but do want to mention a few things. The E-PL1 has a hot shoe that you can use for an external viewfinder. I recommend that whatever camera you get have either a viewfinder or a way to attach one. The camera also has a pop-up flash, something I also consider a must have for a camera.", "Date": "October 10, 2012"}, {"Title": "Amazing Camera!", "Author": "Terry L. Simmons", "ReviewID": "R3ROZCJ26RC3O1", "Overall": "5.0", "Content": "This is an amazing camera for a beginner in DSLR. Compact size makes it as easy to carry as some point-n-shoot cameras, but with all the benefits of a DSLR. Highly recommend this and the \"Dummies\" book for this camera.", "Date": "March 21, 2012"}, {"Title": "The olympus pen e-pl1 12.3mp live mos micro four third", "Author": "Hong tiem Nguyen", "ReviewID": "R10T0Q0JA50GPL", "Overall": "4.0", "Content": "I like my Olympus camera because i can use either lens 14-42 or 40-150mm and i am going to buy the connector lens , using for two kind of camera Olympus and canon also , thank you very much for your production, i appreciate that .", "Date": "February 25, 2012"}, {"Title": "Can't wait to get into it.", "Author": "tequilasundae", "ReviewID": "RSZWVJV0JQB3O", "Overall": "5.0", "Content": "First thing i noticed about this camera is its heft. By that I mean it feels solid, like when you slam the door on a German car. I received this camera in the early evening, and have had to work every day since, so I have yet to take it outside the house, and in pleasant weather. What I like about it so far, is the art filters, and the ease of auto operation. My photog skills are high amateur at best, so I have a lot to get into.", "Date": "January 16, 2011"}], "ProductInfo": {"Price": "$549.99", "Features": "Includes 14-42mm Micro Four Thirds Lens & 14-150mm Wide-Angle/Telephoto Zoom Lens\nLive View on 2.7\" LCD Display - Live Guide Image Manipulation\n12.3 Megapixels - 19 Automatic Scene-Select Modes\nHD Movies (720p) - 6 In-Camera Art Filters\n3 In-Body Image Stabilization Modes", "Name": "Olympus PEN E-PL1 12.3MP Live MOS Micro Four Thirds Interchangeable Lens Digital Camera with 14-42mm f/3.5-5.6 Zuiko Digital Zoom Lens & Olympus M.Zuiko Digital ED 40-150mm f/4.0-5.6 Lens (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51s10cXjzxL._SY300_.jpg", "ProductID": "B0046L558G"}}