{"Reviews": [{"Title": "Great little camera!", "Author": "Leslie", "ReviewID": "R1TR4VPRFPDR4M", "Overall": "4.0", "Content": "I'm pretty happy with my purchase.  The photo quality is better than I expected for point-and-shoot photos, even at maximum zoom indoors.  Outdoor photos look a little better than the indoor ones, but I expected that going in.  The video records in HD and it looks great, though it does get a little choppy-looking when you're at maximum zoom.  I purchased the camera for my family's summer vacation photos/videos and so far it has been wonderful.  Camera requires a microSD/SDHC card that is NOT included.  Camera will take about 900 photos with my 4GB microSDHC card (more if you lower the resolution).  Will record about 13 minutes of HD video with my 4GB card.  I'm not sure yet how long the battery will last between charges.  The only gripe I have is that it there is no button to switch quickly between photo and video modes.  You have to manually choose video from the on-screen menu for video mode, and then manually choose photo again to go back to photo mode.  A little time consuming, but not a deal-breaker for me.  I would definitely recommend this for use as a casual photo/video camera that you can stick in your purse or pocket and go.  Please note: there is no touchscreen option on this model.", "Date": "June 15, 2011"}, {"Title": "It's a camera", "Author": "John", "ReviewID": "R1T8FCFFKU9ZD", "Overall": "3.0", "Content": "I bought this camera for my wife for Christmas, and thought I had made a good purchase. Actually, she hates it. The reason for that is the exponentially long period between pushing the picture button and the point where the camera actually takes a picture. In most real-life situations, the moment is over and the smile has faded into a fake, frozen grimace in the 3 seconds this thing takes to snap a picture...spend a little more and get a decent camera!", "Date": "January 17, 2012"}, {"Title": "great", "Author": "Nava_Sensei", "ReviewID": "RHIMIT4PER0L1", "Overall": "5.0", "Content": "very good item, like all Samsung products, the quality of the materials give a you a mark of resistence and durability", "Date": "February 7, 2013"}], "ProductInfo": {"Price": "$149.99", "Features": "Smart Auto & Smart Button for \"Easy of use\"\n14Mega Still + 720p HD Movie (MJPEG)\n720 HD Movie\n14 Megapixel,2.7 LCD", "Name": "Samsung ES-ST90 Digital Camera with 14 MP and 5x Optical Zoom (Indigo Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41k66Bd5dzL._SX300_.jpg", "ProductID": "B004OZM9LU"}}