{"Reviews": [{"Title": "Completely faded in less than 1 month", "Author": "dowza13", "ReviewID": "R2BJSK66W3BVG6", "Overall": "1.0", "Content": "Don't waste your money.  The quality is a joke. The sun and rain will fade this in less than 30 days.", "Date": "August 25, 2011"}, {"Title": "Easy to read & post", "Author": "Douknowme", "ReviewID": "RZ93ASSPIEGDS", "Overall": "5.0", "Content": "I had two other Camera & Audio recording signs that faded over the last three years. I read the reviews and purchased them. In order to stop any potential fading I wrapped them with a see through tight plastic. I needed the two language versions and these fit the need", "Date": "November 21, 2012"}, {"Title": "easy fix", "Author": "Jacqueline  Ann  Glenn", "ReviewID": "R294M793OAZ6NL", "Overall": "4.0", "Content": "If you want them to last a long time just laminate them. You can get 8.5\"x11\" self laminating sheets at Walmart or Kmart they just barely fit but it works great", "Date": "January 28, 2012"}, {"Title": "Warning signs", "Author": "jerry", "ReviewID": "R21TIT7LOYLQDZ", "Overall": "5.0", "Content": "These are nice as they have bilingual warnings and we are in great need of this. Our theft rate has risen quite a bit, as we are being overrun by non english speaking people.", "Date": "March 6, 2013"}, {"Title": "They are fading.", "Author": "linda sider", "ReviewID": "R32DWRF8M65RTA", "Overall": "3.0", "Content": "The signs are fading in the sun and rain.  Understood they were for outside.  Not much good if someone cannot read them.", "Date": "January 8, 2013"}, {"Title": "Just as advertised", "Author": "Randall Crum", "ReviewID": "R1ESZJH1YKM13F", "Overall": "5.0", "Content": "Great product.  I use these at my vacation rentals where I have security cameras.  So far, no break ins. I recommend.", "Date": "November 26, 2012"}, {"Title": "Fade Quickly!", "Author": "Ship Fedex! \"The World On Time!\"", "ReviewID": "R2DMLJDPUMJ1MK", "Overall": "2.0", "Content": "These stickers fade within just a few weeks if exposed to sunlight. Hav'nt used the signs yet so not sure about them.", "Date": "December 8, 2013"}, {"Title": "waste of money", "Author": "gdgardner", "ReviewID": "R2N04P53Y40IBL", "Overall": "1.0", "Content": "wht cheap crap. my 13 year old could hav printed better. its not a sign its sticky paper with 1990 printer lines", "Date": "November 5, 2013"}, {"Title": "Signs get mildew quickly, stickers fade in sunlight", "Author": "J. Degraaf \"Amatuer Reviewer\"", "ReviewID": "R13AEH45ZQ5KZQ", "Overall": "2.0", "Content": "I bought these because the price was right; however, the signs get mildew on them quickly when kept outside. The stickers, if placed in any sort of direct or filtered light, fade extremely fast (within 5 weeks the red was basically gone). Would likely be good for indoors and better for low sunlight areas.", "Date": "August 17, 2013"}, {"Title": "VERY POOR QUALITY", "Author": "Patrick \"Hawkbl8\"", "ReviewID": "R32QY4TQD8IWRH", "Overall": "2.0", "Content": "i WAS RATHER DISAPPOINTED IN THESE SIGNS AFTER THEY HAD BEEN UP FOR A SHORT TIME THEY FADED IN THE SUN.", "Date": "January 2, 2013"}, {"Title": "The labels faded..", "Author": "CK from LA", "ReviewID": "R2BSB9TRW6TKAH", "Overall": "1.0", "Content": "It took about one week amd the labels faded. Another week and they stopped sticking. Waste of money. Do not buy it", "Date": "December 6, 2012"}, {"Title": "Not so Good", "Author": "Thomas I. Garcia", "ReviewID": "R3NH2D81B7EJMC", "Overall": "2.0", "Content": "A little disappointed in these signs.  Obviously, I wanted them to post outside.  I have only had them out for a short while and they are already fading with exposure to the sun and the elements.  The maker should consider putting a better protective coating on these signs so that they can withstand the elements and last longer.", "Date": "November 11, 2012"}, {"Title": "Could be better", "Author": "El Malo", "ReviewID": "R2SM6EEV906LV8", "Overall": "3.0", "Content": "The small stickers bleached out by the sun even in the shade. The large stickers is more like a sign. Looks ok but a bit too big. Thanks for bringing good deals on line.", "Date": "October 19, 2012"}, {"Title": "Very bad odor", "Author": "BOCAGIRL", "ReviewID": "R2J4SYAM73PACG", "Overall": "2.0", "Content": "Definitely could not keep these in my house when I opened the envelope as they have that IMPORTED stink!  I will cover with laminate as suggested so they do not fade from the sun and post outside.", "Date": "March 11, 2013"}], "ProductInfo": {"Price": "$49.95", "Features": "Large ones size: 11.5\"x8.3\"\nSmall ones size: 3\"x2\"\nThis is the quick, easy way to warn criminals that they are being watched\nEasily posted and removed\nCan be applied to any smooth surface", "Name": "VideoSecu 3 large & 3 small security warning signs/stickers/Decals for CCTV video surveillance camera 1RV", "ImgURL": "http://ecx.images-amazon.com/images/I/61dBEUNPGnL._SY300_.jpg", "ProductID": "B004D9GTVI"}}