{"Reviews": [{"Title": "Challenging to set up", "Author": "John Rogers \"JR\"", "ReviewID": "R2M8A39UFA51NM", "Overall": "3.0", "Content": "I bought this as an intro to cameras.  The device was on special and I figured it would help get my feet wet.  I have been a geek for over 30 years and I met my match with this one.  One needs to be a geeks geek to follow the set up instructions - especially the ones to provide remote access and setting up the motion detection fields.  As a camera it works just fine but I would never ever recommend this to anyone I know as I do not know anyone who could actually get it set up. This device will not even store the date settings when unplugged for a few minutes.  Sorry Trend Net but get your instructions written MUCH more clearly and and I think you would have a decent product.--October 2011 update--  OK to be fair to this product now that I have the hang of it I have to say it is working as advertized and I can view the image from anywhere in the world with a click of the button.  Yes it took a while but with a little research on the internet the pieces kind of came together.  Don't give up.  Would I buy another one.  Yes but I would opt for the night vision option as well.  Night vision is kind of important in a surveillance cam.  Good luck", "Date": "September 5, 2011"}, {"Title": "not easy, but eventually works with Mac OS and iPhone, iPad etc..", "Author": "Hans Blix", "ReviewID": "R14RXSI4DBOGKV", "Overall": "4.0", "Content": "I had hell to try to work this using my Mac. i even used an XP netbook to config with failure..Then, 6 months after i purchased it, I got it working using Mac..Here is how..1. I connected it to Airport Extreme route via Ethernet cable (alternatively, you can connect it to your provider router)2. Since the reserved IP was no longer valid, I logged into my Action tech router given to me by Verizon FIOS service3. I identified the device from Actiontech network menu based on the MAC address (the device MAC address is printed at the back of the camera). based on the MAC address, i identified the new IP address4. Once identified the IP address, copied it into browser (Firefox in my case)5. Voila...user name and password..admin..admin..in both cases..make sure you change the password later6. now I am in camera configuration, i was asked to use the user name and password by Java again for some reason, no problem, retyped it both7. now it is time to config your camera, change camera name etc...most importantly, see if it is working..it should give you a nice live image now..8. then ensure that from network-->wireless, you configure it for your WiFi network, you should let it scan for the network from the menu and see your wireless network9. click on the WiFi network find10. select security setting now.. make sure select the right wireless security your WiFi router uses, and correct password11. now, we know that t=camera works while connected to router via Ethernet cable.. but you want to use it wireless right?..12. to do that, first unplug the Ethernet cable, then unplug the power for the camera13. no need to hurry and move the camera away, test it in the same place just in case you need to plug back if wireless connection fails14. now, connect the camera to power, after few minutes it should connect to your WiFi and green light needs to start blinking, if not, Houston, we have a problem...15. lets hope that green light started blinking, now log back into camera with the IP and see if you see video16. if everything is done right, you were able to configure WiFi connection from camera setting earlier, you should be bake to see something if so, skip the next bullet- If wireless connectivity fails I suggest you reset camera settings and start over..I tried to restart without resetting, but failed, reset deletes all previous configurations and takes you to back to a clean start..i know hassle but better to start from scratch.. the way to reset is to push a pin into a small hole on the rear of the camera for 6 seconds and let is go while camera is powered.17. Hoping that now your WiFi connection is working..  means you are good to go.. just unplug the camera and install it anywhere..18. But here is the issue, your camera is configured to be access within your WiFi network. Don't you want to use it on 3G network or away from home?19. If so, you need to get another IP address.20. Verizon Actiontech router handles it for me. It has a setup remote access function listed next to the camera in network lists of all connected devices.it will give you an external IP address. This number contains the following:a. [...] b. your FiOS gateway's Internet IP Address, c. :, d. port number(s) of your web camera21. -read the IP address to use it from outside..write it down..you will need it..I will tell you when below..22. Accessing via iPhone and iPad over WiFi or 3G:23. Now all is good to go, if you have iPad and iPhone, download LiveCamsPro app24. Select security camera option25. go to add camera26. Select the camera model from the initial list, make sure you select the right one for this camera27. In setting menu enter IP address, give a name to your camera (e.g. Home camera 1), username, password from original camera setting (I hope you changed default password), I chose refresh rate as 1..28. Now, you should be bale to access your camera on 3G network while away from home.REMEMBER: Due to lack of ActiveX, certain camera functions from IP access via browser will not be available when using Mac and non IE browser..Anyhow, I know this is a way too long review, but the goal is to help Mac users out there..If you have issues and cannot resolve after few resets, just add comment to this review, I will try my best to help.Good luck !", "Date": "May 8, 2012"}, {"Title": "Not bad", "Author": "F. Lee \"MKMR\"", "ReviewID": "RE0DGOIY0S0FH", "Overall": "5.0", "Content": "I got this one for 59.99 - 20 rebate. took about 20 to 30 minutes to set up.it does what if says.The reason for 4 star is after I did a port forwarding, when I try to access it from internet, somehow the active x gives me a blank view. but when I access it within home network, it does work fine.The motion detector does send a bunch of emails with attached picture to me when a motion is detected. so this part is working fine.overall, for 40 bucks, this is pretty much the best you can get.Update: the internet access works fine, turns out my company blocked the active x.for 40 bucks, I am willing to give a 5 star to this product.", "Date": "December 13, 2011"}, {"Title": "Bought a dozen Trendnet cameras over the last two years and love them", "Author": "Christopher Hinton", "ReviewID": "R662BJ10AH5TR", "Overall": "5.0", "Content": "We've tried various different cameras and have found the Trendnet products to have a consistent quality level and user-experience.  Although not perfect in terms of setup, they are pretty good - and the feature set does everything we need.Our main usage is to set each camera to upload an image every minute with an overlay of location and time. This is a great way to monitor activity over extended periods of time.  The secondary usage is for live viewing to check on things when needed.I would say that the additional provided software for viewing the cameras is of limited value - but these cameras are flexible enough to do most of the things you need if you are okay writing a bit of HTML and JavaScript.  And they work great with iPhone/iPad apps like LiveCams.Overall I've been very impressed with reliability, having 5 of these (the earlier model) running for 18 months pretty much untouched - uploading millions of images to my external website.Not for everyone probably, but if you want a solid dependable camera, with a good feature set, then this is worth buying.", "Date": "November 9, 2011"}, {"Title": "Dont bother-set up is a nightmare and documentation is bad", "Author": "T. Dailey \"evanston irish\"", "ReviewID": "R3JX5T5FJO8J87", "Overall": "1.0", "Content": "I tried to set up this camera following the directions precisely.  However, the actual setup doesn't proceed the way the documentation says it does.  Then I clicked the button to set up the wireless network and the screen disappeared, and from that point the button disappeared and there was no way to get back to the wireless setup.  Even resetting the camera and the laptop didn't change that.  The instructions claim the camera is pre-set to DHCP, when in fact the opposite is true - it is preset to a static IP address, and you have to make some setting changes just to get it to where the instructions claim should be the factory pre-sets.  I am a pretty technical person, but this thing seems almost impossible to set up - and I'm now at an impass - the setup process doesn't even offer me the ability to re-try setting up wireless and apparently there is no way to get back to that screen.  As far as I'm concerned, this is a poorly-designed, horribly documented and unpredictable piece of junk.", "Date": "May 9, 2012"}, {"Title": "once setup, good product.", "Author": "Doug Taylor", "ReviewID": "R22HN9AFXFKVBG", "Overall": "3.0", "Content": "I bought this fairly cheap on black Friday. I had been looking into getting one to use as an always on weather webcam. This one is easy to setup but the image quality is at it's lowest. any lower and I would have returned it.", "Date": "December 13, 2011"}, {"Title": "Works fine for what it is", "Author": "escape", "ReviewID": "RQ9YRFFYDC4CO", "Overall": "4.0", "Content": "First of all, I don't understand why people complain that it's so difficult to configure.  It didn't take me more than 10 minutes to have it up and running.  This included re-configuring the router so that video could also be accessed from the \"outside\".The motion sensor part is a bit finicky, but it works, at least during the day.  Resolution could be higher, but at this price point, you really can't expect it.  For a basic remote monitoring device, this isn't bad.", "Date": "December 11, 2011"}, {"Title": "doggy daycare cam", "Author": "kellybrown", "ReviewID": "R2LPK9Y4B4JYVL", "Overall": "5.0", "Content": "We purchased two of these cams for our doggy daycare clients to watch their pets when they are with us. If you want a firsthand view of the picture quality- check out our website at [...] They work great!!", "Date": "September 20, 2011"}, {"Title": "unreliable", "Author": "Greg", "ReviewID": "R27EXEZ54W6CFX", "Overall": "1.0", "Content": "I helped a friend install two Trendnet TV-IP110WN security cameras. It took a couple of frustrating hours to realize that the installation instructions simply did not work. Then a long phone conversation with a true \"geek\" with experience installing the same camera model achieved some success in getting the WIFI connection up and running. That lasted about a month with images sent to my email account. But one of the cameras failed soon after installation. It was returned and replaced with a new camera; but then the second of the 2 original cameras also failed to send images. The combination of difficulty in setting up the system, compounded by unreliability in its operation is truly disappointing.", "Date": "October 26, 2013"}, {"Title": "Insecure.  Beware.", "Author": "Glenn Connery", "ReviewID": "R1LWADTIFK1JHN", "Overall": "1.0", "Content": "\"A few weeks ago, a blog called Console Cowboys exposed a security vulnerability in some models of Trendnet home security cameras...\"http://www.theverge.com/2012/2/3/2767453/trendnet-ip-camera-exploit-4chan", "Date": "September 4, 2013"}, {"Title": "NOT NEW ASADVERTISED!!!", "Author": "Bob", "ReviewID": "R1XESFQ7LP4S8J", "Overall": "1.0", "Content": "Loose parts in box, not the original packaging!Advertise as new but it has been taken out of the original box and being resold as new.False advertizing!!I will never buy from this vendor again!!Trendnet is good but I now don't trust this seller!!", "Date": "June 28, 2013"}, {"Title": "Get the job done", "Author": "Dennis", "ReviewID": "R24MZP5CIT7ZKH", "Overall": "3.0", "Content": "Personally I didn't have too much problems with this product. My biggest problem is TRENDnet not having any decent software. I set up 5 cameras in one house and 1 camera in my office. The cameras in the house used one software program from TRENDnet and the other camera used a totally different software. Apparently they don't make software that works with all their cameras. I ended up using mainly android apps and open source software that lets me view them all on one program.The cameras also do not work well unless you setup your network under a static ip address. So basically anytime anyone goes to that house, I have to setup their device on the static network. The firmware is old and very slow to configure the cameras, after I got everything working I was almost done with messing with them anymore. The other problem was the automatic recording feature only works locally and you cannot reliably get e-mails to be sent out.TLDR: It's not bad for viewing and sometimes hearing conversations in a room. Don't expect it to be simple to setup or do all of the features it's suppose to flawlessly.", "Date": "June 20, 2013"}, {"Title": "Trendnet, basic, but reliable", "Author": "George D. Robertson", "ReviewID": "RY7RDH7QM0875", "Overall": "4.0", "Content": "Yes, this is a low-end camera.  Keep that in mind.  THere's no PTZ, few bells and whistles, but I've had several running 24/7 now for well over a year, and they do just fine.  For indoors with adequate lighting , or outdoors during daytime, it works fairly well.  You can tweak the view with the settings, and manually adjusting the focus by turning the lens a bit.  Range on the wireless is average, but it does have a standard RP-SMA connector, so if you want to put your own external antenna on you can.Cons- without SIGNIFICANT lighting at night, you ain't seeing squat.  There's no B&W; option, so keep it lit, and you'll be fine.", "Date": "June 5, 2013"}, {"Title": "Great camera as long as there is light in the room", "Author": "Carolina Avila", "ReviewID": "RT148HX2QRNBQ", "Overall": "4.0", "Content": "This camera is very easy to setup. Had it running in less than 20 minutes. The only problem is that it lacks of infra red lighting so if you turn off the light, there goes the security. It is good for a place with good lighting.", "Date": "May 14, 2013"}, {"Title": "Works through web", "Author": "Frank Bello", "ReviewID": "R1J6QMI8LHLUU8", "Overall": "3.0", "Content": "This item works through a hard wired connection the Internet. No wireless ability. Kind of useless if not near a pc or laptop. Also no recording.", "Date": "February 25, 2013"}, {"Title": "Good for the price!", "Author": "Frenchyaz \"Salut\"", "ReviewID": "R1Y6TFJ8JJU2DG", "Overall": "4.0", "Content": "I got the TV-IP110WN V2.0 which states on the box with a red sticker \"New Firmware\". When I looked, it seems like the version I got is 1.2.2 build: 66 which is not even on the Trendnet web site yet (tinyurl.com/8zxq2zd). Not sure what it brings over build 65 but it seems to be working ok so far.I love technology when you can intuitively pull the item out of the box and use it. This one, after poking around, I ended up reading the manual as the camera didn't want to connect with the wireless. The manual states that as soon as your done putting the settings (SSID, ...) you need to unplug the camera from the outlet AND you need to unplug the RJ45 cable!I did it, didn't work on the first time. I had to factory reset the camera then do it again. This time, after a few seconds, the signal was picked up and I was up and running. I'm using WPA2-PSK with AES and it works for me.Setting SMTP was a breeze. I have COX as an ISP and I just had to set smtp.cox.net as a relay using none for \"Authentication mode\" and just filled the \"Receiver #1 email address\" with my Gmail account. No need to use TLS or SSL. I tried the motion detect feature and received emails with pictures right away.Image quality is ok, somewhat pixelated though. 3X zoom is pretty much useless. It is nice to have the date and time while recording and be able to select what days/hours you want an active recording/monitoring.I have just tested the Android app SecurView in order to watch your camera through the Internet and it worked. You have to know how to set up port forwarding on your router (see many how to on line). Also, you will have to change the camera port as usually port 80 is used by something else (you can use 8000 range usually).All in all, for $39 it is hard to ask for more if you have just started to experiment with in home wireless camera.I might buy a couple more down the road when on sale.", "Date": "October 8, 2012"}, {"Title": "Stopped working after 2 months of use", "Author": "Greg V", "ReviewID": "R1XI43XPRTUW1X", "Overall": "1.0", "Content": "Very buggy interface and it stopped working 2 months after I started using it.  Do not buy this product, it's not worth the cost for a glorified paperweight!", "Date": "September 30, 2012"}, {"Title": "Discontinued item", "Author": "Harry", "ReviewID": "R1P1OAATL5HR2Z", "Overall": "1.0", "Content": "Followed instructions to a T. Never was able to get wieless to work.  Went to Trendnet and found out this item is on the discontinued list and has been replaced .  Received instructions from customer service and also followed it to a T. No results.  Please don't waste your money.", "Date": "August 8, 2012"}, {"Title": "Failed after 48 hours", "Author": "Felipe Calderoff", "ReviewID": "R105GSGK3914IY", "Overall": "1.0", "Content": "It set up immediately when I plugged it into my router. Picture was decent. Unfortunately, the camera failed after 48 hours. What was a cheap internet camera, will be much more expensive after all the hassle of paying for shipping to return it for warranty service. I do not recommend this camera.", "Date": "June 14, 2012"}, {"Title": "Poor Product", "Author": "Max Lent \"Consumer\"", "ReviewID": "R2MBXOXKLPW00M", "Overall": "1.0", "Content": "This camera never quite worked for me.  I could set it up so that it would work, but it never operated correctly for more than 24 hours.  Now it won't work at all.  If I have it connected to the network by cable it works, but the WiFi eventually stopped working altogether.", "Date": "May 3, 2012"}, {"Title": "There are better cameras (including other Trendnets)", "Author": "Tom Servo", "ReviewID": "R2Q4IYQ0R0AXFK", "Overall": "2.0", "Content": "I'm reviewing TV-IP110WN Hardware version 2. This is a 802.11n/wired Ethernet camera with no night vision capability.THE GOOD:+ Supports 802.11n+ InexpensiveTHE BAD:- Images have a lot of motion blur to them (in good light). For some reason other Trendnet cams that I've used don't exhibit this problem. I find this motion blur unacceptable. I do not know if this is something new to TV-IP110WN version 2 or if it was also present in version 1.- Frame rate is only adjustable in 5FPS intervals (5FPS, 10FPS, 15FPS, etc)- Only MJPEG compression is supported (no MPEG4 or H.264)OVERALL this camera feels like a cheap imitation of a Trendnet camera - I guess they have to cut corners and make them cheap to sell at this price? Unfortunately due to the motion blur I can't recommend this camera. Instead you might want to check out others which I have reviewed:TRENDnet TV-IP602WN ProView Wireless Pan/Tilt/Zoom Internet Surveillance CameraTRENDnet TV-IP312WN SecureView Wireless N Day/Night Internet Surveillance Camera Server with 2-Way AudioCisco-Linksys Wireless-N Internet Home Monitoring CameraLoftek Newest CXS 3200 Wireless/wired Pan:340°&tilt;:100°,ir Cut, Dual Audio Alarm Ip Camera,8-10 Meter Night Vision ,67° Viewing Angle,easy Installation.white(replace 2200)I hope you found this useful!", "Date": "April 4, 2012"}, {"Title": "not user friendly", "Author": "S. Sigurdsson", "ReviewID": "R2FM1GLIVCWZI7", "Overall": "1.0", "Content": "Configuration is not very intuitive but manageable however I was not able to get the record on motion to work which makes this camera useless to me.I also baught the Logitec Alert 750i and that one was super simple to install motion activated recording was easy to set up but the downsides are that one only supports 6 cameras vs the 16 or was it 32 of the Trendnet and you can only view your logitec cameras via the application or logitechs website dosent seam to have direct browser access.", "Date": "July 11, 2011"}, {"Title": "Setup Impossible", "Author": "Stephen J. Nardi", "ReviewID": "R17IQ3ZNYSBQVH", "Overall": "1.0", "Content": "I'm not a full fledged member of the Geek Squad but I've been using computers for 20+ years and I can't complete the setup on the camera. I've spent 7+ hours over 2 days with no luck. Online support consists of being directed to re-read the manual over and over again. Troubleshooting section is poorly written and of no value whatsoever. Unless you are extremely capable with network systems(in which case you could just build you own),do not buy this camera. Mine just found the bottom of my garbage.", "Date": "December 11, 2011"}, {"Title": "Excellent Value", "Author": "Ann-Marie", "ReviewID": "RGJS2WC1R732Q", "Overall": "5.0", "Content": "As commented by others, setup is not intuitive.  I'm no stranger to networks and internet protocols but it took me 6 hours to get it working.Having got it working I'm totally delighted with the picture quality, resolution, color depth.  It is 10 times better than another camera costing nearly twice as much.So if you have the patience to struggle through the setup or someone with experience to help you, this is a great camera.", "Date": "September 10, 2011"}, {"Title": "Worked for a day", "Author": "E. Gerken", "ReviewID": "R3P9OIC4Q34PUT", "Overall": "2.0", "Content": "I had high hopes for this unit, but it didn't work out.  First of all, the streaming video never worked for me, but I was OK with that.  All I wanted was something that would send pictures of the front door to an email address.  The software was ok, but it had a real hard time finding the unit on the network most of the time.  I finally got it to send me emails, it did that quite well, and the pictures were good quality, too.  However, after disconnecting from the wire network and enabling wireless, the unit didn't seem to work anymore, even if it was right next to the wireless router.  I turned the unit off, and reconnected the Ethernet cable to see if it was still working, but it will no longer talk to the network.  I reset to factory default using the pin button on the back, but now it must be completely hosed, because I can only ping the unit from my cmd console a couple times before it becomes unreachable again. Usually only 2 pings get through to it.  I'm going to play with it some more, but I don't think there is much I can do now.  I think I'll buy one of those 20 dollar web cams and set it up with my laptop.  I give it 2 stars because it doesn't work, but it almost did!", "Date": "January 14, 2012"}, {"Title": "It wasn't \"broke\" yet they just *had* to go fixing it.", "Author": "Todd S.", "ReviewID": "R2Q3V0OL9OB0WT", "Overall": "1.0", "Content": "I have quite a few similar Trendnet cameras in use. This is the first of this type of upright form factor that I ordered because I was needing to place it in a window where it just fits better than the other cameras.I was expecting the installation and operation to be the same and just as painless as the other Trendet cameras but it wasn't.First of all, the existing IP viewer setup software wouldn't detect this camera. No big deal. I just used the included disc which had an interface that looked like it was a program written for a 1989 Commodore. OK again, no big deal. The camera was installed fine. Nice picture. Easy installation.The problem is that unlike all the other Trendnet cameras, this one only offers a Java video stream. It does not offer still pictures or Active X video stream.I use these cameras on a mobile phone to check in remotely so without the capability to at least view a still picture, the camera doesn't do a lot of good. I often do use web browsers to view the cameras also but again, I'm mostly loading the still pictures. I don't have time to wait for the java applet to load.Trendnet may be updating all the cameras to this useless new firmware but at least for the time being the 501W camera does let you view stills and I do highly recommend that camera.There is an Android app out there that supposedly let you view the camera. Utterly worthless. Download it and see.I did check with tech support and they confirmed it. This camera just won't do the job for me.", "Date": "October 10, 2011"}, {"Title": "Not impressed", "Author": "Moosemiester", "ReviewID": "R1TTJZ7X1TA5X1", "Overall": "1.0", "Content": "I remember when $50 got you something worthwhile.Had this product for a few hours, and has worked all of twice now.Out of the box, hardwired, it came right up, configured the wireless, spent an hour trying to get it back and for no real reason it started working on the wireless.  Reset button, doesn't work, plug it in hardwired, it won't connect, etc. 20 or 25 unplug/plug it back in and holding the reset button for various durations it decides to work again - never did reset to factory settings.So I unplugged it and moved it to where I wanted it.  That's the last time it worked.  Been through 25 unplug/plug it back in cycles.What this product is, is a $50 amber LED light in a pretty white box that looks like a camera.The desktop software provided \"Secure View Pro\" doesn't work at all, it saw the camera on the network (once), but just displays \"Connecting\" forever.I'm running a 6 core PC, less than a year old, on a Cisco E3200 Router, the camera is less than 100 feet from the router.Really pathetic.  Will return it.  Stay away unless you're looking for a fake camera to scare thieves, it works well for that, although if they are smart they will see the TRENDnet label and know it's not a real camera at all.The \"N\" doesn't mean it works on the new 5Ghz wireless -- It means No, it doesn't work.  This is a 2.4 Ghz device.", "Date": "December 31, 2011"}, {"Title": "Works Great!", "Author": "R. Painter", "ReviewID": "R2MI3L9UXUSC5W", "Overall": "4.0", "Content": "Easy administration interface and works great during daylight. Easy to configure viewing over the internet with port forwarding on your router. I'm looking to buy another one.", "Date": "August 4, 2011"}, {"Title": "Ok Cam if you want to Spend Time Looking At it", "Author": "S. Bryant \"Music Lover - Urban Mics\"", "ReviewID": "R1LJBYSDIGW7N6", "Overall": "3.0", "Content": "I now have two TV-IP110WN's. Somebody really should have stopped me when I got the first one, but what was I thinking. After learning that I could focus the camera (not covered in the Manual) I was impressed with the Images. The Zoom on this thing is a joke so if you need to see something far away. Don't buy this one. Setup was not too hard for me (but I am a geek about stuff like this). But what I did hate was the lack of Record on Motions. Why even has the cam if you are not going to offer that? Well to be fair they do offer it in a Software package that was harder to setup that the cameras. Now here is another note. If you are going to aim them outside your house (as I did - Kind of wanted to see them as the walk around looking for the best way to get in - and hoping if they saw the cameras they may not want to come in), be ready for a ton of time trying to set the Motion Detection. It was a pain - Because of the sunlight changing the cameras pick up a lot of motion noise (as I like to call it) cause the cameras to send me over 200 emails in less than an hour. This camera is best used for indoor viewing where you can control the lighting. Point it outside and well. I hope they see them before they brake in!", "Date": "September 6, 2011"}], "ProductInfo": {"Price": "$194.00", "Features": "Up to 4x greater coverage as compared to wireless g IP cameras\nView, record, and manage advanced features from any Internet connection\nProgram motion detection recording, email* alerts and more with complimentary software\nOne touch Wi-Fi Protected Setup (WPS) wireless connection\nSupport up to 640 x 480 pixels resolution at up to 30 frames per second", "Name": "TRENDnet TV-IP110WN SecurView Wireless Internet Surveillance Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41cAckNT0XL._SY300_.jpg", "ProductID": "B004UBSHQO"}}