{"Reviews": [{"Title": "Great customer support!", "Author": "G. L. Boutain \"glboot\"", "ReviewID": "R1NRC84H1B2RZ3", "Overall": "5.0", "Content": "This is an easy system to get up and running with everything I needed in the box.  The cameras are well made and give a good image for a system in this price range.  Night viewing is quite good up to 30' to 40' and starts to fade out after 50' or so but works perfectly at a dark entry.  Hooked this up to a television for local viewing as well as networked and port forwarded.  Viewing over the internet on a pc or smart phone works great and my customer uses it often.  I emailed customer support a couple of times during the port forwarding and they were very quick to respond and knowledgeable as well, couldn't be more impressed with the support!  Thanks Aposonic!  My only complaint would have to be the clumsy user interface they used on the dvr and the poor search capabilities of recorded video.  I will use this system again for other customer installs.", "Date": "October 5, 2011"}, {"Title": "Well done surveillance kit", "Author": "Night Cat", "ReviewID": "R34U31TPUEY8PE", "Overall": "5.0", "Content": "We've set the system at our client's office for over 6 months. Last weekend he got a break-in incident and called us for help.We log into the DVR and try to locate the footage. Bingo! We saw the whole process of the burglary occurred on Sunday morning.Most importantly, the long-range camera caught the car's license plate about 30-40 feet away.  Now we backed up the footage and handed to the police.  With the system, 20,000 worth property would be saved back.  Now we consider to add 3 more Aposonic brand cameras into the DVR for firmer protection.  Thanks to Aposonic's support and its reliable system! I'd say for security purpose spend your money on the right one.", "Date": "June 7, 2012"}], "ProductInfo": {"Price": "$619.99", "Features": "Set D1, Half D1, CIF Real-time Recording and Playback / Set different Frame Per Second on each channel\nSupport UPnP, No port-forwarding is needed\nSurveillance Motion & Sensitivity Zones - DVR Motion detection triggered events can be promptly notified by loud audible alert and / or Email notifications to PCs or smart phones.\nEventful Alerts - Configurable per channel, Surveillance Signal Loss, Motion Trigger, Audible Alarm, Alert Durations, Recording Log Management. Pre-installed 1TB SATA drive.\nLive view and access control through Internet Explorer, Firefox, Chrome, and Mac OSX/safari. Streaming live video on mobile smart phones or tablets via free app", "Name": "Aposonic A-BR18B5-B1TB 8-Channel H.264 Professional CCTV Surveillance Security Camera System with 1TB HDD / HDMI Output, Mac Ready", "ImgURL": "http://ecx.images-amazon.com/images/I/41cDsayDgQL._SX300_.jpg", "ProductID": "B004PYD8Z6"}}