{"Reviews": [{"Title": "Sturdy and works reasonably well", "Author": "The Careful Consumer", "ReviewID": "R1A69Y7OWEHMCY", "Overall": "4.0", "Content": "This review is based on my trying out the inspection tool for a short while.  I plan to use it to check the amount of insulation in the walls of my house, the condition of some of the interior joists that are partly hidden, and the like.  I think it will work, but maneuvering and using it seems to require some practice and trial and error.ProsIt seems to be sturdily made.It works equally well with or without the extension.You can read newspaper print with it, but not perfectly clearly.  You need to have the camera from 2\" to 3\" from the newspaper.You can recognize a paper clip from about 2\" to about 9\" away.The flexible tube is somewhat rigid, so you can position it from one end, with the other end where you cannot see it or hold it.It works underwater.The light works well.  You can see into dark areas.ConsThe depth of field is undetermined.  Sometimes I can get a good view of the objects from long distance (6\" to several feet), but other times I can't.  It makes using the inspection tool difficult.Underwater use requires quiet water, otherwise you see bubbles and currents.The flexible tube is somewhat rigid, so it is hard to snake down a toilet or flexible downspout.The camera/light assembly on the end is thicker than the flexible tube, so it can get caught in tight places.Some other Amazon sites showed this tool being sold in a plastic carrying case. It came to me in a cardboard box.You will find out that some parts of your house are very dirty.In short, it lets you see things you would not otherwise be able to see. I do not know how it stacks up against other similar products.", "Date": "September 14, 2011"}, {"Title": "i would pass", "Author": "Amazon Customer", "ReviewID": "R1RV34OSUTGV9", "Overall": "3.0", "Content": "Tough to navigate. maybe its me, but i find it difficult to maintain a run without having to remove it again and again. I tried running through a 4\" waste pipe and gave up. When you look into anything on a right angle, like down the beams in a ceiling , good luck. That was difficult too.I threw in the towel 90% of the time. i guess for a short distance with a straight run its good. but how often do you see that . i bought extensions , straight run is okay. forget bends.", "Date": "January 29, 2014"}, {"Title": "Fantastic", "Author": "Kevin Klun \"Mr.K\"", "ReviewID": "R2UQVDVICQD80U", "Overall": "4.0", "Content": "Only con is the difficulty to move the snake around to go exactly where we want but otherwise, this tool helped me a LOT of time inside the walls, fishing electric cables, seeing obstacles, etcAmazing tool for the price and compared to other.With the extension, it's even better! Perfect under water, very good in low light conditions, batteries last a LONG time (wireless is BEST).Woudl recommend to anyone.", "Date": "May 23, 2013"}, {"Title": "picture clarity not too great", "Author": "chevyhalfton", "ReviewID": "R3R53AOMTZLH7A", "Overall": "3.0", "Content": "works okay, but monitor picture quality a bit dark and grainy.  i would have liked better resolution, but not a bad deal for the price.  i got the set with the extension.  recently had a mouse drop down behind the wall.  i was able to cut a view hole and look down to see it before taking it out.  kind of creepy to see the buggy little eyes looking back at me on the monitor!", "Date": "December 31, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004BJIYOU"}}