{"Reviews": [{"Title": "Swi-View LCD Viewfinder makes nice addition to Canon 60d", "Author": "SDesign", "ReviewID": "R2GFCFBD56UC7E", "Overall": "5.0", "Content": "I am using this on a Canon 60d and I wanted to provide some details as to how this LCD viewfinder/loupe functions for me. Please note: I noticed that the same reviews come up under two different products, so I want to be clear that my review is for the 3:2 Swi-View LCDVF LCD Viewfinder for Canon 60D, T3i, any other 3:2 3\" LCD Cameras by Carry Speed SOLD by Photo Smart, NOT the one sold by Cowboy Studio. The Cowboy Studio offering, according to them (in a customer service email), does not come with the neoprene cover that allows attachment to your swivel screen. The one that Photo Smart offers comes with: viewfinder, strap, microfiber cleaning cloth, two metal self-adheasive frames and neoprene cover.First off, I have never been interested in permanently attaching any metal frame to my LCD to allow the typical magnetic attachment of a viewfinder/loupe. That is why this product is so beautifully elegant. The one from Photo Smart comes with Carry Speed Swiview Swi-View for LCD View Finder fits any 3\" Swivel LCD Screen as part of the kit.If you purchase the Cowboy Studio offering: 3:2 Swi-View LCDVF LCD Viewfinder for Canon 60D, T3i, any other 3:2 3\" LCD Cameras by Carry Speed you will need to purchase the Carry Speed Swiview Swi-View for LCD View Finder fits any 3\" Swivel LCD Screen as well if you want to use it with your 60d or T3i swivel screen and not require the adhesive frame.Attachment is a breeze with the neoprene wrap, just flip out your LCD, wrap the viewfinder with the included Swi-View neoprene cover and secure to your LCD.**A word of caution, if you out in direct sunlight, be sure to bring something (the included microfiber cloth works great) to put over your viewfinder/loupe when you are not actively using it. The direct sun can shine in and burn your LCD very quickly much like a magnifying glass.**This viewfinder solution provides great results and allows you to see much more clearly when adjusting focusing during video recording, especially in very bright conditions. There is no diopter adjustment on this model, but I wear glasses and have no problem getting good results with my glasses on. You can check the accuracy of the loupe by holding the camera focus button halfway and once the camera is finished focusing, be sure what you see through the viewfinder/loupe is in focus as intended.I use this solution with my 60d and my \"DSLR Follow Focus\" from DSLR Solutions (google search) mounted on a modified version of the CowboyStudio Shoulder Support Pad for Video Camcorder Camera DV / DC and it works great! I am able to put my eye up to the viewfinder attached to my flipped out swivel screen and walk around and focus with near identical functionality to a larger shoulder mounted camera.ConclusionThis viewfinder/loupe is a fantastic value costing a fraction of the more expensive offerings and produces really nice results. It makes hitting critical focus during video recording much easier and will be a regular addition to  my camera setup. Since I did not see many reviews talking about how this product works with Canon 60d, I wanted to provide some insight. I hope some people find this information helpful.", "Date": "November 25, 2011"}, {"Title": "Canon T3i WARNING!", "Author": "KeS", "ReviewID": "R1RORU1XMKBRMK", "Overall": "4.0", "Content": "This looks like an pretty good item, but I wanted to warn Canon T3i users as the description says it works with that.The T3i has a viewfinder than is closed. You open the viewfinder, swivel 180 degrees, and snap it back into itself. Now it is just like any other camera. To protect it and put it away, you swivel it 180 degrees and snap back in.Here's the problems. If you mount the metal frame, it's adhesive. if you try and \"put away\" the viewfinder it will no longer work, you'll have to leave it in itsopen\" position with the viewfinder exposed.I thought I could get around this by purchasing the metal mounting hardware that mounts to the bottom of camera. This would work very well, but if you have a battery grip on your camera liek mine, forget it. It won't work.I am rating this high as I can see it would work well with other cameras, just not the Canon T3i (600d) series.", "Date": "June 23, 2011"}, {"Title": "Yeah, it's a knock-off, get over it!", "Author": "shnelson", "ReviewID": "RCOCSQ8SYMNQ5", "Overall": "5.0", "Content": "It should be obvious to anyone that this is not a true LCDVF model viewfinder. The seller should get dinged for this and be forced to correct their wording, but I'm not going to base my review off of a misleading title since I knew what I was getting into when I made the purchase.This little gem is at the right price and the optical quality is perfect for me to finally rack proper focus with my t2i. The construction is hard plastic and seems like it will take some abuse. Inside of the tunnel it is lined with a felt like material, which picks up lint pretty easily. Comes with a handy lanyard and a neoprene carry case.I originally mounted it directly to the camera, the paint started flaking off the first metal bracket within a few hours but the effects were only aesthetic. Magnet holds strong and takes a forceful bump to knock it off the mounting bracket.My screen protector finally showed up, so I pulled the original metal bracket and mounted the second one that comes with directly to the protector. I like this route because there's no longer any adhesive touching the camera, but I need to find a better way to secure the bottom if it's going to go through any type of abuse.In my opinion, someone finally priced a view finder appropriately and this one does exactly what it is supposed to do.", "Date": "April 18, 2011"}, {"Title": "Exactly what I was looking for", "Author": "EBC", "ReviewID": "R1UP5OOU7MBF9R", "Overall": "5.0", "Content": "I have a Canon 60D (with articulating screen) and this viewfinder is exactly what I was looking for. The downside with this and many of the other competing products is that once you stick the magnet to the viewfinder, providing quick and easy viewfinder attach/detach, is that you can't close the screen against the camera as you normally would (screen-side in, plastic side out). One of the benefits of this product vs the competing products is the neoprene sleeve. I like the idea of NOT sticking magnets to my viewfinder and the neoprene sleeve allows you to slide the viewfinder on and off the camera easily, with out putting any adhesive on your screen. So that's a win for me. A potential downside of using the sleeve only is that you can't close the screen at all. It has to remain open to use. However this is could be advantageous if you're using it with a shoulder rig, in that you don't have to buy the additional, increasingly popular, \"offset plate\" for your rails.Little bonuses: extra adhesive plate (in case the stickiness wears off) and it has a little plastic eye on it to attach a lanyard to keep it around your neck.All in all, a great product to aid in sharper focus and better visibility in bright conditions.", "Date": "September 26, 2012"}, {"Title": "Awesome product for a fraction of the cost of others!", "Author": "tcon0422", "ReviewID": "R7V815XBIHULH", "Overall": "5.0", "Content": "I love this little thing!  It makes filming in daylight so much easier, makes focusing on moving shots easier, adds some stability to the shots as well, and cost a tiny fraction of what other companies make too.  Only warning is to be careful not to leave the open/exposed side out because it has a sort of carpet-like fabric inside that can collect dust.  I recommend using your extra magnetic strip, leaving it in the plastic bag, and putting that on top to act as a plastic screen to cover the opening.", "Date": "September 11, 2011"}, {"Title": "Better quality?? Or get what u pay for?", "Author": "Just in time", "ReviewID": "RR0K9GVU8WFLL", "Overall": "2.0", "Content": "In the first week I used it twice. Went to take away from camera and one magnet pulled out of viewfinder. The viewfinder works for what it is but quality not so hot.JustinPacenotes.tv", "Date": "July 25, 2011"}, {"Title": "I use on T2i - gamechanger", "Author": "Mr.Bort", "ReviewID": "R2Y35PQBV7OBJ9", "Overall": "5.0", "Content": "So great for a (low cost) 3:2 loope... I (carefully) added to the metal frame with a stronger glue for, er, permanence. This loope is that good at critical focus and cam usage in the daylight. Looks cool while shooting, also.", "Date": "July 13, 2011"}, {"Title": "A Very NIce Product!!", "Author": "peeech \"peeech\"", "ReviewID": "R10EA4GKNVRM63", "Overall": "5.0", "Content": "Don't buy an expensive Hoodman, get this instead for your DSLR.  I use mine on a Canon 60Da, and it works great.  I like the way the case wraps around the LCD screen to hold the hood/loupe tightly.  The loupe is large and allows you to see the whole screen without effort.  I use it for solar imaging and for celestial imaging at night.  It's great for manually focusing whatever optic is on the cam.  Easy on, and easy off, can use magnets if you wish.  The little case that comes with it works very well and is light tight.", "Date": "March 3, 2013"}, {"Title": "Doesn't work for me!", "Author": "HDNut \"Jim\"", "ReviewID": "R2YO8BBUEXVODO", "Overall": "1.0", "Content": "I could not get the metal plate to stay on the Canon T3i. It pops off very quickly. To make mattersworse, I wear glasses and the lens is not in focus for me. Since you have no adjustment, you're outof luck. It looks like the only viewer to use is one that straps on and can focus and they run about $80for a hoodman.", "Date": "January 11, 2013"}, {"Title": "Very functional for low cost", "Author": "Brian Procopio \"wooingscotsmanproductions\"", "ReviewID": "R890BY1IKNJFM", "Overall": "4.0", "Content": "FIrstoff, I shoot with two different Canon DSLR cameras, a 5d mii and a T3i.  I used one of the included magnetic mounts on the back of my 5d and it's fantastic.  I'm still on the fence about putting the mount on the t3i though, for, as some have mentioned, placing the mount frame on the screen then means you can no longer fully close the LCD screen on the back of the camera.  So, for now, I'm using it with the included velcro-pouch/attachment thing which, truthfully, seems pretty good.  I haven't had the chance to REALLY put it through the paces with some active shooting, which may be the deciding factor for me on whether or not to affix the more solid magnetic mount to the camera.  Overall though, I have NO issues using this, and I do wear glasses.  The difference in my shooting in broad daylight is phenomenal.", "Date": "January 10, 2013"}, {"Title": "Indispensable and working great", "Author": "mdti", "ReviewID": "RP2GLZDWME7VG", "Overall": "5.0", "Content": "This is an indispensable product for any LCD equipped camera. I use Canon 60D and the LCD is impossible to use in daylight when sun is shining. You can't see much, and it is often out of focus when you thought it was focussed. Many pictures were blurry as a result.This view finder solves that problem and now I can focus and see what is actually happening on the LCD (not only the pic, but all the shooting info from canon or magic lantern firmware).I found that the magnifier actually allows to see at 1:1 size, that is to say, same size as in reality.I went for the full deal: viwfinder (it comes with the cover to attach it to the camera LCD). I also purchased the metallic frame to screw on the camera mount, for when I don't need to flip the lcd but I haven't used it: i prefer to slide the lcd inside the viewfinder+pouch pre attached, and it works fine like this in absolutely all positions (of course, you can't have the LCD fully inside the camera as usual, it is slightly in diagonal, but it matters 0% or less).  I don't use the glue-able frames neither, because i want to be able to close my LCD fully, which is possible with this viewfinder and its pouch (which came in the package), as you just slide it to remove it.I don't have sightseeing problems and found that this viewfinder is good to go as is, without any modification.I've built my own \"hood\" before i got that one, which was better than the pro hoods because much longer, but hoods are much less efficient, because they wouldn't have a magnifier.I've bought a lot of gizmos for my canon 60D, and the Swi-View \"carry speed\" is simply the best item that i purchased. I use it all the time, and if i ever get lazy and don't use it, i regret it.So, if you always use the LCD screen to focus and get shooting infos (I shoot in video mode 99% of the time, and you don't have access to the analog viewfinder on the 60D, only LCD is available), get this pack and make yourself happy with a better camera and more great pictures thanks to that viewfinder....I also ordered the cover as a seperate package,, but it was already inside the box of the viwfinder, so now I have two of them. The second one will be used once i waste the first one. I give it 6 month to 1 year lifetime, but I only had it for a week, so i can't tell about its exact lifespan (how long before the elastic of the cover becomes to loose to use, or the velcro too wasted to close it).It all looks good anyways, go for it, there is no other alternative at that price, and the price is worth more than every penny.nb: cover = pouch in good english...", "Date": "September 17, 2012"}, {"Title": "Great Product", "Author": "R. Shorrock \"BigFig\"", "ReviewID": "R2J26X789JJNYE", "Overall": "5.0", "Content": "Normally, I don't use something like this, but after a few slightly out-of-focus shots during a movie shoot, I had to get this. And I can't say that I was sorry I did. It works as advertised. If you do any HD shooting outdoors, this item needs to be in your kit. I'm shooting on a Canon 60D, and I find that I'm using it more indoors as well as out. Because I normally have to use reading glasses for fine detail, it's tough to get really good focus in HD, especially shooting with a shallow depth of field. So this LCD viewfinder works great for me, as I don't have to use my glasses. The 3 power magnification on this thing more than makes up for the +1.25 diopter on my glasses.", "Date": "August 15, 2012"}, {"Title": "Pretty dang good for the price", "Author": "Bloodpoet", "ReviewID": "RI2H8QBTNO4", "Overall": "5.0", "Content": "I ordered mine with the base that mounts to the threads on the camera, and the neoprene wrap with velcro, but to be honest, I like the way it mounts to the adhesive one better. The eyepiece, for some reason, stays in place better with that one, and its better for keeping out ambient light. It has adequate magnification. Not too much, but plenty to make racking focus a snap. For the money you're spending, this is good gear.", "Date": "July 30, 2012"}, {"Title": "Great product for the price", "Author": "jtirrell", "ReviewID": "R2N24CPOFN3C2O", "Overall": "4.0", "Content": "I always keep this in my bag!  It is so nice to use, the neoprene/velcro attachment option is really nice if you don't' want to adhere anything to your camera and thus remove the option to close the LCD scree side in.  No complaints, simple, works.", "Date": "May 16, 2012"}, {"Title": "great view finder for the price", "Author": "Jamieson C Mundy", "ReviewID": "R3UF0XYMRPH469", "Overall": "5.0", "Content": "why spend 200 dollars on a view finder? Ive used the z-finder, this tool is way way cheaper and does the job right!", "Date": "February 7, 2012"}, {"Title": "3:2 Swi-View LCDVF LCD  not to bad", "Author": "connieo", "ReviewID": "R1IAWZU8I4DO8E", "Overall": "3.0", "Content": "not bad for the price, this will do temporally. I found it gave me a clearer view of my shot on the spot apposed to finding out later what look good on my LCD screen, was not as clear or out of focus once uploaded from the camera...", "Date": "November 4, 2011"}, {"Title": "Works...", "Author": "Eugenia Loli", "ReviewID": "RXC2CIIEEKSK1", "Overall": "5.0", "Content": "It's a bit big for my Canon 5D Mark II, but it does fit. It covers about 25% of the buttons on the left, and it's close to the on/off button on the other side, but even with that little problem, the buttons are still usable with a bit of effort. I don't mind them covered a bit, as long as they still work. Other than that, the product works as advertise, although its glass needed good cleaning before using.", "Date": "July 17, 2011"}, {"Title": "Missing Pouch + Low Quality Plastic", "Author": "kk", "ReviewID": "R3MQIVTCXI3D04", "Overall": "2.0", "Content": "Did I mention the missing pouch??... I'm surprise how badly made/cut the eye piece is. It's also quite dirty, makes me rethink before sticking my eye into it. I will test run with it this week. Will update this review...", "Date": "January 14, 2014"}, {"Title": "Nice product", "Author": "Dan G.", "ReviewID": "RS8ZU7SDRL8CX", "Overall": "4.0", "Content": "this viewfinder does exactly what it's supposed to do without the need to permanently attach a frame to the camera.  I've used it several times in the field and i have no complaints.  The price is right also.  Don't pay upwards of $100 and up for a viewfinder when this will suffice.", "Date": "December 25, 2013"}, {"Title": "Best bang for your buck", "Author": "Brody", "ReviewID": "R1NWC5BNS2SN0I", "Overall": "5.0", "Content": "I use this every shoot. Is it bright outside? Doesn't matter. Holding your camera on a monopod above the crowd? Just angle it towards you and you can focus no problem. For the price, a must buy.", "Date": "November 3, 2013"}, {"Title": "piece of garbage", "Author": "Rock R.", "ReviewID": "R1WS9X7JH5NCN3", "Overall": "1.0", "Content": "I bought this for my 60D the frame falls off with a whisper, its a complete pain in the ass to use and with the frame on the i cant close my screen so i cant permanently put it on.  save your money buy something else.  also the image is not good very grainy and hard to use it to focus.  might be usefull outside if the damn thing didnt keep falling off.", "Date": "October 12, 2013"}, {"Title": "It does not remains attached to the camera, it keeps falling", "Author": "ana rosa", "ReviewID": "R3NRPRAOPNTKDG", "Overall": "1.0", "Content": "It does not remain attached to the camera, it keeps falling, and I have to glue it always, so it is not good", "Date": "June 20, 2013"}, {"Title": "Works perfectly and at a great price", "Author": "Jamison M.", "ReviewID": "R1FYVLIIJ0FDZM", "Overall": "5.0", "Content": "Works perfectly and at a great price.Holds on nicely and has a good travel case.I would highly recommend this to a friend.", "Date": "May 25, 2013"}, {"Title": "Very useful kit for Canon EOS 60D if you are shooting against sunlight!", "Author": "Sherif Sallam \"Sherif\"", "ReviewID": "R1QV9ZDRHNDFMG", "Overall": "5.0", "Content": "I really like this kit, before it was difficult for me to review photos on beach because of strong sunlight, which is not allow for me to see my shoots through the LCD and check the photo lights and flash exposure.The box contain 7 piecesif you have LCD protector, and you don't close your LCD, feel free to use the sticky frame on the LCD. it will not damage your screen because it will be on the screen protector (your screen film protector should be a good quality), but you will not be able to close the LCD.I really like this kit.", "Date": "April 22, 2013"}, {"Title": "It doesn't come with Velcro Pouch", "Author": "I4Y", "ReviewID": "R8HULFDBYPX5B", "Overall": "3.0", "Content": "I thought this was going to come with the velcro pouch not a carrybag but I took my chance anyway. The viewfinder itself works great, it doesn't even need a diopter. I gave it 3 out of 5 stars because it doesn't come with the swi-view velcro pouch for use with flip-out screens just as on Canon T3i and also the metal frame doesn't precisely fit the entire size of the LCD screen. Also the metal frame tends to easily fall off with a slight bump to the view-finder when it's attached. I don't know if this is intentional by the manufacturer or defect. I mean by intentional because many of us DSLR owners wouldn't like something like that to be permanently affixed to the screen but at the same time it's not very dependable because it'll fall off. I would be insane to crazy-glue it LOL!!!  Lastly is the fact that it didn't come with the velcro pouch so I had to order it separately (extra expense). I just hope that when I receive it it's not another dam carry bag since item descriptions in Amazon don't always match the product.Aside from all that I said the delivery was quick and arrived prior to the estimated date which is always a plus.", "Date": "April 13, 2013"}, {"Title": "love it", "Author": "jaime santos", "ReviewID": "R2MCXX5DEBLGCJ", "Overall": "5.0", "Content": "it is great light weight and love the amplification, helps a lot in focusing not only for video but for photography too.", "Date": "March 27, 2013"}, {"Title": "ONLY BUY THIS ONE", "Author": "Wes", "ReviewID": "RI9VAWXPOAQO0", "Overall": "5.0", "Content": "This is the real deal. Get it and forget the gluing onto one camera lcd......nOOOOO. Buy it youll be happy with it.", "Date": "March 26, 2013"}, {"Title": "decent for the price", "Author": "jason moore", "ReviewID": "R2LNZIFZ90PWV9", "Overall": "3.0", "Content": "decent for the price.. self stick tape couldn't hold the weight of it. cut these down to size and it worked great http://www.amazon.com/Command-Medium-Mounting-Refill-9-Strip/dp/B0014CQGW4/ref=sr_1_18?ie=UTF8&qid;=1362200594&sr;=8-18&keywords;=removable+hook+tapealso the mganifine glass in it is poor quality or not looking good that closely at the lcd screen", "Date": "March 1, 2013"}, {"Title": "Best LCD viewfinder on the market", "Author": "Little_Forks", "ReviewID": "RXWG3L6R11QNZ", "Overall": "5.0", "Content": "This LCD viewfinder works great on the Canon 60D (or any other camera with swivel screen) but would work on any camera. It improves focus, cuts glare, and slides on/off quickly and easily. The best part is that you don't have to put any magnets/adhesives on your camera. And you can't beat the price!", "Date": "December 16, 2012"}, {"Title": "ViewFinder", "Author": "Yossi", "ReviewID": "R1ZK0BIYF0CFH1", "Overall": "4.0", "Content": "I ordered it a little late so i didn't get it on time for my video shooting session.It looks good, no adjustments on the unit, simply stick it on and use.I have it installed, but didn't use yet.", "Date": "June 7, 2011"}], "ProductInfo": {"Price": "$33.49", "Features": "2.5 X magnification, FREE Swi-View pouch included !!!\nThe eyecup can be fold down for compact storage.\nExtra Large and Soft Eyecup for comfortable use.\nStrong magnets installed\nQuality made Metal Frame with Nutches for best effect.", "Name": "3:2 Swi-View LCDVF LCD Viewfinder for Canon 60D, T3i, any other 3:2 3\" LCD Cameras by Carry Speed", "ImgURL": "http://ecx.images-amazon.com/images/I/51y8AHLZscL._SX300_.jpg", "ProductID": "B004RG4MNE"}}