{"Reviews": [{"Title": "Great Camera for Long Distance", "Author": "T. Carlson \"toneman\"", "ReviewID": "R2S57U70VOCBI4", "Overall": "5.0", "Content": "This is a great camera for long distance viewing if you have a large property.  I have a small horse ranch about 800 feet from my house.  The distance on the camera is listed as 750 feet so I was nervous about purchasing one.  It worked fine!  So I have two cameras now and can watch/record my horses from the house and see if any unexpected guests show up.  So far I am very satisfied.", "Date": "April 27, 2012"}, {"Title": "MY BAD - I was a DUFUS", "Author": "Robert L. Dietrich", "ReviewID": "R23739UA37VZO0", "Overall": "5.0", "Content": "It originally seemed that this camera was incompatible with my original DW-700 single camera security system. WHY, I DID NOT know 'cause I couldn't find my Owner's Manual. It is not like the little ball cameras that First Alert sells in groups of four with a different monitor. They are nearly IDENTICAL \"DIGITAL\" cameras to the DW-700 camera. This one would NOT \"PAIR\" (link/sync) with my monitor. I tried it SEVERAL times. I even switched camera positions with my original camera, to no avail. Well, I FINALLY found the Owner's Manual on the First Alert website in some obscure small print in the download section after looking for it THREE times. The truth is, I was a DUFUS & forgot to push the link button of the cable area of the camera itself during the SIXTY second time frame that the monitor gives you. A pretty TRICKY endeavor when you have to climb a tall ladder quickly at night.", "Date": "January 4, 2012"}, {"Title": "Police said get a survalliance  camera.", "Author": "Carrie Hickerson", "ReviewID": "R254LTZ64EYHVR", "Overall": "4.0", "Content": "I have a home next door to a house full of thieves . So I bought the main system and needed an additional camera. This company has made my life so much easier . I no longer have to get up at night frightened and open my door to see what was that noise or worse just sit and worry. From the safety of my room I can see what is going on. I have been able to phone the police and show the footage of what they were up to. (2 arrest) I have told over 100 other neighbors to get this system. I know this company has a least sold 10 of these after people came over and watched what this does. Opening your door is not safe. Proving what is happening takes a lot of stress off.My neighbors know I now have cameras. I have them hooked high on my roof so they can not get to them ( but can see they are being filmed) they have broken into 6 houses, but now leave mine alone.", "Date": "May 29, 2013"}, {"Title": "This is NOT a stand alone camera", "Author": "TheOldGuy", "ReviewID": "RAQRB5NNZTWCE", "Overall": "2.0", "Content": "This product is not a stand alone product. It requires the DW700 or similar system. This is not made clear in anything I've read about it.  As I pointed out to First Alert, \"can be used with the DW700\" is not the same as \"requires the DW700 ...\" So,we bought it and are now having to return it since it is useless without the parent system.The stars rating is on the lack of accurate description. I can't evaluate the product, since I don't have the necessary equipment for it to work.", "Date": "May 5, 2012"}, {"Title": "works great", "Author": "STEVEN A MURPHY DVM", "ReviewID": "R9EOV0DF1D6A8", "Overall": "5.0", "Content": "works great in low light and daylight. Color camera in daylight/ infrared at night. Good sound. Used as barn/ foaling stall camera. THis is the second camera in use with previous purchase monitor and camera setup. Transmitting over clear line of sight greater than 500 foot distance.", "Date": "March 3, 2013"}, {"Title": "First Alert Single Digital Wireless Indoor/Outdoor Camera", "Author": "Red", "ReviewID": "R2XV5GQFMGCSB2", "Overall": "5.0", "Content": "We love First Alert Single Digital Wireless Indoor/Outdoor Camera.  I works great in daylight and nighttime.  I highly recommend this camera.", "Date": "April 4, 2013"}, {"Title": "Wireless First Alert Digital Indoor/Outdoor Camera", "Author": "JForeman64", "ReviewID": "RG3OFIC69HX6P", "Overall": "1.0", "Content": "Product purchased as a returned item; supposedly not used.  Camera would not work after set up.  Would not connect with First Alert Monitor.", "Date": "September 1, 2012"}, {"Title": "fun", "Author": "John Raba", "ReviewID": "RA59NQ44WV2TE", "Overall": "4.0", "Content": "I bought the first alert system on eBay for a very good price. My primary reason for buying it was to view wildlife at night. I only had the system for a few weeks when I decided that 2 cameras would be better than one so I could place them in multiple places around my property. In the past I saw bears frequently at night and even during the day but haven't seen them in a while. I am hoping to capture them on the camera come spring.  I really like the system and the only negative I have to say is that the picture isn't the best for the price but is suffice.  I recommend the system as you can set it to run on a schedule or by using the motion detector.The recordings are stored on a micro SD card which you can watch on your TV or your computer.  The system allows for up to 4 cameras. The wireless feature makes it so you do not have to run wires everywhere....You just need a nearby electrical outlet or extension cord.As my title indicates, the system is fun but is also a nice security system.", "Date": "February 15, 2014"}, {"Title": "Added as 2nd camera", "Author": "Galen A. Crandall Jr.", "ReviewID": "RCRKD7FBTVOLC", "Overall": "5.0", "Content": "Works as advertised and as expected. I haven't had them long enough to see how they work in sub-zero temps; time will tell!", "Date": "October 11, 2013"}, {"Title": "easy to use", "Author": "dave montez", "ReviewID": "R1FGTHEGNZ2L2O", "Overall": "5.0", "Content": "camera works very well, had 2other ones, easy to install and easy to sync. just push a button on the camera line and it was done.", "Date": "July 8, 2013"}, {"Title": "Replacement camera", "Author": "Don Olsufka", "ReviewID": "R2JAW3X8DUS16F", "Overall": "4.0", "Content": "I bought this camera to replace one that wouldn't go into infrared mode at night.So far, it is working great.", "Date": "May 28, 2013"}, {"Title": "not sure", "Author": "Juan", "ReviewID": "R22VVBQ2SPP2PL", "Overall": "3.0", "Content": "Purchased two.  One of the two's night vision went out and had to return.  No problem returning for credit and ordered another.  So far ok.", "Date": "September 23, 2012"}, {"Title": "Sadly & Horribly disappointed", "Author": "Joe Feedback", "ReviewID": "RL3ZZMTELJOJN", "Overall": "1.0", "Content": "I am sadly & horribly disappointed with my First Alert D-520 Wireless Security Camera.I purchased 2 D-520's as camera 3 & 4 add-ons, to the First Alert DW702M Wireless Camera System.The First Alert website led me to believe that the D520's would work for my DW702M system [\"...be used with the first alert DW-700 digital wireless security system.\" - and -  \" ...Great add-on camera for other camera systems\" ].However, the D520's do not 'Pair' with my DW702M receiver/dvr.I was led down this horrible road because the DW702M owner's manual - included in the box - and - the current online product info at the First Alert website, didn't specify which add-on camera I needed to purchase.To First Alert's minimal credit at best - the owner's manual mentioned that the camera model # in the system box is the \" D702MC \".  However, when looking up this model #, I was led to the D520.Furthermore, even after exstensive research in the owner's manual and on the web to determine how to trouble shoot the 'pairing' issue, I couldn't find an answer.Therefore I'm returning the DW702M Wireless Camera System to my local hardware retail store and will email the corporate offices to encourage them to stop selling this product because either (1) It's a defective product  (2) The manufacturer fails to educate customers of the appropriate optional devices, which are required to fully utilize the 'Systems' prodcuts that they sell.I'll also return the D520's to Amazon.I could call the First Alert tel # for customer support, however, after spending over $500 for the system & additional cameras, and utilizing a great amount of time to self-empower myself to troubleshoot, I'm not spending additional time on (1) A defective product - or -  (2) A manufacturer that fails to educate customers of the appropriate optional devices, which are required to fully utilize the 'Systems' products that they sell.Stay away from the First Alert 'Wireless Camera System' products, until they get their act together.", "Date": "February 3, 2013"}, {"Title": "POSEIDON", "Author": "wilmer", "ReviewID": "R32DNUUC6ACKJN", "Overall": "4.0", "Content": "REALMENTE ES BUENA CAMARA PARA TIPO RESIDENCIAL, ESTOY SATISFECHO COJE BUENA SENAL POTENTE AUDIO Y TRABAJA EN LAS PEORES SITUACIONES DE CLIMA, REALMENTE LA RECOMIENDO", "Date": "April 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004MNSH60"}}