{"Reviews": [{"Title": "Y do so many misunderstand what MegaPixel is???", "Author": "AzItLies", "ReviewID": "R2766CT07NQUCJ", "Overall": "5.0", "Content": "This is an excellent Camera. It turns on and is ready to shoot in about a second. And if you change the default image size from the huge 16 megapixel to something more commonly used in the real world (and you have a fairly fast SD card), you can be ready for the next picture in less then a second.It's sad to see so many people fail to understand this, and I'd say shame on Canon for not making this clear in their \"start up\" documentation. Even the CNET review pointed out it was slow writing a 16 meg file to the card (as would be expected), and my belief is CNET said that to chide Canon for not making it clear the setting should be changed to \"what's appropriate for your picture needs\".Most people are not making Poster Sized Prints! And because of that, creating 16 megapixel images is a total waste of hard drive (and flash SD card) space, not to mention the time one has to wait for it to write it to the flash card (as so many have complained about).Please take the time to do a Google search and read some of the freely available information on this subject. A 16 megapixel image is no more clearer then a 4 megapixel image on your 22\" monitor.I hope that's enough information to get people started to better understand this \"megapixel\" thing. The camera has the ability to write out a 16 megapixel image (yes that will be slow)... but the vast vast vast majority of us do not need this feature, it's overkill to the max... It's all the other features this camera has that make it a great choice!", "Date": "August 27, 2011"}, {"Title": "WARNING: Image Distortion Occurs with this Model (and no one is talking about it)!!", "Author": "Kimmylikins", "ReviewID": "R17HL0FEFO513O", "Overall": "2.0", "Content": "As an owner of multiple Canon camera's in my lifetime, including my current 7.1 mp \"Powershot SD750 Elf\" and 16 mp \"Rebel T2i\" DSLR, I really put confidence in Canon's products. Or, I did. Now I am just frustrated and at a loss for where to go from here.First you should know that while I am not a professional photographer, I am far from a beginner and am pretty adept with technology. I purchased the \"Canon Powershot A3300 IS\" as a replacement for my now outdated and thoroughly used 7.1 mp Elf. I was beyond excited when it arrived and beyond disappointed after using it. Half of my images came out with a barrel-type distortion at the upper edge. This occurred mainly in close-up images that filled the frame, but also in a shot that was composed at about a 6 or 7 ft distance of three children. The two children squatting down were perfectly centered and look beautiful; but the child standing behind them who was just above the center of the frame, ended up with an elongated lump head.  The close-up images would cause the heads and faces of the people in the picture to be elongated and at times even skewed. They basically end up looking like individuals afflicted with certain types of dwarfism, where there is an exaggerated forehead; or, in some of the images, the subjects looked like they were in a fun-house mirror with weird elongated and skewed faces and heads. The distortion was more subtle in some shots and more obvious in others; but I know my own family, and it was fairly easy to look at the image then look across the room and see that something was clearly wrong with the picture.  I did not notice the distortion with scenery shots or photos of my cat quite as easily, but it *was* there in some images if I looked VERY hard.I scoured the Internet for anyone who might have experienced the same issue, as none of the Amazon reviews mentioned it from what I saw. I could not find any answers. I called Canon technical support and found myself talking to a man who cut me off numerous times, asked me questions that I had already explained the answer to and generally seemed aggravated to be working at the moment. (NOTE: This is the exact opposite of a very pleasant technical support conversation that I had with an extremely helpful gentleman about 4 years ago in regard to my then new Elf.)  The tech support rep told me that he had never heard of this problem; he thought it may just be a bad egg in the bunch. I followed his advice and returned it to Amazon for an exchange.  Unfortunately, the second A3300 IS had the same exact problem. I packed it right back up and shipped it back for a full refund.I rated the Canon Powershot A3300 IS at a mere two (2) stars because despite all of the options, the bells and whistles, not to mention the aesthetically pleasing color options, the A3300 IS was a complete disappointment. What good is a camera with great image quality - even if it was a point-and-shoot that some how was able to rival a DSLR - if the images are distorted??  I am certainly not framing or sharing images of my child or my family if everyone looks like they are the Conehead's long lost cousins the Bigheads.  :o(After all of the back and forth with Canon and Amazon, I discovered that CNET's review found the same exact issue as I had with the A3300 IS. (I have no idea how I missed this when I did my initial research, but I have pasted the info below as a reference.) So, despite what Canon's tech support rep was trying to sell me: This *IS* an issue with the A3300 IS model and I *DO* know what I am talking about. Where do I go from here? I really don't know. The A3300 IS was the most appealing Canon replacement for my good old Elf; but with the A3300 IS removed from the game, I am considering a Nikon COOLPIX or maybe even a SONY Cyber-shot. Unfortunately, my heart just isn't in it anymore. Hopefully Canon will rectify this blunder and offer a comparable model, less the fun-house effects, sometime in the near future.FROM THE CNET WEB SITE:\"There is slight barrel distortion at the wide end of the A3300's lens and maybe a little with the lens in telephoto, too. Center sharpness is good, but there is softening at the top, bottom, and sides and, at least on my review camera, the bottom corners were visibly smeary.\"READ THE ENTIRE REVIEW AT:[...]", "Date": "May 28, 2011"}, {"Title": "Canon Powershot A3300 IS", "Author": "krycom", "ReviewID": "R1ATCGXCFR4XW8", "Overall": "5.0", "Content": "The Canon PowerShot A3300 IS is small enough and nicely fits into your pocket. Being 16 Megapixels and tons of shooting modes your going to need to browse the manual a few times to learn all it's features if you want to get some amazing pictures from it.  The A3300 does have an Auto mode and bonus Easy Mode setting on the dial.  In easy mode only a couple settings work and gives brief instructions on how it works,  such as the shutter and zoom,  otherwise the camera decides everything else for you.  It also has a scene mode and special effects mode with allow for some creative shooting such as Fisheye lens, miniature, toy camera,  etc.  The camera feels very well built in your hands and the only down fall I found so far is that the flash is at the very top right hand corner and you can have a finger in the way of the flash if your not careful.Canon Powershot A3300 16 MP Digital Camera with 5x Optical Zoom (Black)", "Date": "March 16, 2011"}, {"Title": "Shutter lag is HORRIBLE if you have kids!", "Author": "6 Bugs Mom", "ReviewID": "RC99B7577TBTS", "Overall": "3.0", "Content": "I received this and quickly put it back in the box to return as soon as I tried shooting photos of my kids. I wanted a point and shoot to fit in my purse for those unexpected \"Kodak Moments\" but it literally takes 2 seconds after you press the button to snap the shot. Very frustrating as a parent! It takes nice pics otherwise. But read up on the shutter lag - the part they don't advertise.[...]We ended up getting the Nikon S8100.  MUCH better for a quick point and shoot. I also love the scene selector - it selects the right scene for the conditions you're in. Not as high MP as the A3300, but unless you plan on printing out massive images, the S8100 is awesome. It has 10x optical zoom AND one touch button HD movie mode. Check it out!", "Date": "March 18, 2011"}, {"Title": "Beautiful images with very little effort", "Author": "Douglas B. Yarbrough", "ReviewID": "R37VP6S3V87TQJ", "Overall": "5.0", "Content": "I agree with the recent Digital Camera Review article:\"The A3300 IS lets users capture beautiful images and highly detailed HD video clips with very little effort - no matter his or her level of photographic competence. Portraits, landscapes, outdoor images in various lighting situations, night shots, and indoor pictures can all be captured easily when users shoot in the A3300 IS's Smart AUTO mode. Whether you're shooting macro close-ups of spring flowers, capturing a glowing sunset, photographing your kids playing T-ball, or nailing that dramatic vacation picture at Yellowstone or the Grand Canyon you can be confident that the A3300 IS will consistently produce the best pictures possible.Canon's \"Smart Auto\" mode stands, in my opinion, head and shoulders above those of their competitors. If you want to take great pictures but you don't want to have to worry about anything technical, rush out and buy this one. The A3300 is an ideal first digital camera, an excellent choice as an \"always in Mom's purse\" family camera, and a very good choice for travelers who want a small, lightweight, relatively tough and fairly inexpensive \"go anywhere\" digicam.\"", "Date": "April 9, 2011"}, {"Title": "Love this camera, Cannon A3300, even a technophob can use it.", "Author": "Pat", "ReviewID": "R1QKT80CL8WS1X", "Overall": "5.0", "Content": "I did a lot of research before purchasing this camera.  My last camera used film, this is my first digital and first compact camera.  I love it. It is foolproof and perfect size.  I bought the [[ASIN:B004HW73O8 Canon Powershot A3300 IS 16 MP Digital Camera with 5x Optical Zoom (Red].  I get confused if electronics/cameras have lots of gizmos, dials and settings, but this camera's functions and settings are explained clearly on the screen when selected.  There is an Easy Setting so you don't really have to think or know what light setting and all that and your pictures will turn out great.  It does everything you could possibly think of or at least what I wanted, at an excellent price.  It takes great pictures and video and comes with a battery, charger and cables and has internal memory as well.  It catalogues and dates your pictures and can create slide shows.  Today, I learned - fooling around - that I can change the pictures I take right in the camera.  Say, for instance, I felt my arm looked too big or flabby in a photo that was otherwise perfect, with my husband, (not that this was me of course) I can crop it and edit out part of my arm and walla, the perfect couple picture.  My hands shake when I hold a camera, very subtly, but this corrects for it with image stabilization.  I just love this little camera and am so glad I moved to a digital compact.  My goodness, the options are unreal!!!  Red eye correction - can I tell you how many pictures I've seen ruined, otherwise good pictures, due to this.  At the price I paid, I feel I got a great deal.  This camera is user friendly, a pleasure to learn, comes with a manual on disk, is light as a penny, and.... takes great pictures of moving objects too.  I Definitely would recommend it.", "Date": "August 14, 2011"}, {"Title": "Great camera...Gets the job done!", "Author": "LJ", "ReviewID": "R3PWJXHS68W6VL", "Overall": "4.0", "Content": "I love this camera because it gets the job done, and it's so compact that it's easy to carry in a pocket. It takes great pictures, especially outside. Indoor picture quality isn't that great which is why I'm giving it 4 stars instead of 5. I think it is worth the price though!", "Date": "April 16, 2011"}, {"Title": "great little camera", "Author": "Joan Fox", "ReviewID": "R38HZCV5A9O3I4", "Overall": "5.0", "Content": "bought this specifically for the size, and image stabilization feature. (upgrade to my canon sure shot)  I am fully satisfied with the results.  The larger screen, and increased number of functions and ease of use right out of the box. First power up was quick, and with a set of plug adapters it will work in Europe without transformer.  I'm particularly fond of the \"discrete\" setting which will take out the noises of the camera for stealth purposes.  The test shots using zoom lens, in available/low light produced shake free images of people from across a 30' span.  The beef I DO have, is the manual is on CD, not paper, so it's not so handy for quick reference on tricky shots. (bright window, etc)  The movie test was also great. This camera did not come with memory card, so additional amazon purchase suggested - I went with the larger gb and doubt I'll ever run low. and, a friend came by yesterday with her new camera - and is using a hard plastic travel case for soap to protect it in her purse (a buck?) not too glamorous, but what a great idea!", "Date": "April 15, 2011"}, {"Title": "Great for the cost", "Author": "A. L. Randall", "ReviewID": "R2DN0RSIF48IXB", "Overall": "5.0", "Content": "I wanted to spend some time using this prior to reviewing it but after 2 months of service here's were I stand. Great point and shoot I got it after my SD950 is was stolen and I Like it. Now coming from the Titanium 950 to this the camera A3300 doesn't feel as sturdy but so far it's held up. The picture quality is slightly better with the A3300 and I love all the cool lens effects. One lens effect I wish they would have added from the SD950is is the Color Accent I felt that made for some ingeniuous pictures. The battery life is great on theis camera as well I shot for an entire weekend on 1 charge.I'm going to be getting a dSLR soon but this will hold me over.", "Date": "April 25, 2011"}, {"Title": "Don't buy from PCNation wait for Amazon", "Author": "Scott", "ReviewID": "R2XBNHIY7QFUN1", "Overall": "3.0", "Content": "I've been waiting for this camera since January. Amazon still had pre order on it. Today March 8th 2011 PCNation had it in stock replacing Amazon's link. So I purchased it because it said they were in stock. Well when I got the invoice it said BACKORDERED. PCNation is misleading and they haven't had them in stock at all. I called them directly and the CS rep said they were supposed to come in on Feb 28th. So again they never had them in stock. I cancelled my order and wanted to post on here letting anyone know not to order from them.update, they are in stock now. 3/14/11Tested:So I got the camera.. finally, but i'm a little disappointed in the picture quality. I did side by side tests with my trusted Powershot SD 950 and my results were 50/50. 95% of the pics taken on the A3300 like landscapes, trees, wooded areas, almost everything set in the widest zoom out had sharpness issues using the auto and smart settings. P and live were only slightly better. (P & Live let you set contrast, sat, bright, sharpness etc. The centers of the camera were fairly sharp but all four corners were clearly not in focus. Compared to my 950 there was clearly a sharpness issue. There's also a saturation issue and feel that the auto features knock it down a little too much and pics can look muddy. I attached photos to show comparison.Then I tested out the macro feature and did side by side tests with both cameras again and these seemed to be closer in comparison. The 950 had less noise and more bokeh though.Build quality is ok on the A3300, the battery door is also the location for the memory card which felt a little cheap so I'd be careful. The shutter button is a little too far centered and i kept wanting to press the setting dial which is on the edge of the camera. The zoom in/out slider is located with the shutter button and its a bit difficult to manage as well as feeling very breakable and loose. The 3\" LCD is very nice but compared to my 950 you can see small pixel dots on the A3300. Startup/zoom in/out seems as fast as the 950. Photo taking is slightly faster with the A3300 as well as focusing and another thing I noticed is that the subject focus lock (green square on lcd) found the subject I wanted in focus faster and more accurately then my trusted 950.After taking a pic, the time to save to my memory card was still just as slow as the 950, i'm using a class 6 memory card and should see faster saves with the A3300 but don't. The size of the camera is nice, its a little lighter than the 950 and thinner but the same length but that fine. I do like the wider angle as well as the 5x optical zoom. I'll be doing more tests on this camera in the coming weeks and will post more info.If your looking for a new camera that has many features, large lcd, comes in colors and is fairly compact, this may be a good choice but remember that photo quality/sharpness isn't the best but most won't notice.UPDATED March 28, 2011well, sadly after testing and comparing a bit more, i've decided to return this camera because the sharpness just isn't there. I decided to purchase and test the Panasonic DMC-FH25 Panasonic DMC-FH25A 16.1MP Digital Camera with 8x Wide Angle Image Stabilized Zoom and 2.7 inch LCD (Blue) and i'm glad I did. Its a little more money but well worth it. The size of the camera is about the same as is the weight. Its also Blue and is 16mp too. The screen is 2.7 and not 3 but no big deal. The camera is much faster all around including taking the photos and most of all saving is very quick. The focusing is just as fast as the canon although there were a few times there pressing the button half way didn't do anything, not sure why, Look for my full review on the camera.", "Date": "March 8, 2011"}, {"Title": "great product and price", "Author": "Hal R. Hodes \"Halberto\"", "ReviewID": "R186PIDOBS0DJG", "Overall": "5.0", "Content": "After waiting for this camera to be released, I'm not dissapointed. I don't understand the price difference between the red and other colors, but $179.00 is a fantastic price for the 16MB and 720 video . Easy to use features and the size is perfect. I decided to go with this latest , highest MB camera available because I keep camera's a long time and I feel this capabilities will carry me forward many many years. Hal", "Date": "March 21, 2011"}, {"Title": "Picture distortion occurs", "Author": "Mr. P", "ReviewID": "R2EQL7QAHK8IMH", "Overall": "2.0", "Content": "I totally agree with Kimberly S. Desio.  Experienced similar picture distortion issues and I just returned the camera and going with Sony Cybershot.", "Date": "January 3, 2012"}, {"Title": "Excellent little camera", "Author": "Alec Cooper", "ReviewID": "R22S030YDB344F", "Overall": "5.0", "Content": "I love this camera, it was exactly what I was looking for: a reasonably priced pocket size camera that still takes good pictures.  I bought this camera as a supplement to a full size Canon PowerShot S5 IS (which has been succeeded by, I believe, the PowerShot SX30 IS).  I wanted something I could stick in a pocket and carry around on short trips and in social settings that would be a much better camera than my phone.This camera is excellent, and the pictures are only slightly less sharp than on the S5, which has a much larger sensor.  Just about the only feature I would have liked as an addition to this camera is full manual control for shutter speed and aperture, but that's far from necessary for the situations I wanted the camera for.This is an excellent pocket size camera, and would be great as a first digital camera for beginners or as a supplement to a larger camera for more advanced photographers.", "Date": "May 26, 2011"}, {"Title": "Crisp, Clear, Bright Photos, Super long batt life & very fair price", "Author": "casimone", "ReviewID": "RCQUK26NWIIQH", "Overall": "5.0", "Content": "I was Not expecting great battery life, I was hoping for decent, but oh how pleasantly surprised! Granted it was some years earlier since my last camera purchase, so maybe it's an industry standard by now. However, if you are as unaware of this new standard as I was or perhaps it is not a new standard after all, then let me fill you in. I took pictures all day long and the battery just lasted and lasted. I took hundreds of pictures and some videos, in total several minutes in clips and it still wasn't until the next morning when I had to pop in a new battery and put the original in the charger. I had ordered 2 replacement batteries because I was anticipating the need to change them often. However, one could easily recharge in the evening and be set to go with the same batt the following day. I would suggest one replacement is well enough, (unless you take zillions of videos). I never yet had to swap to the third replacement and only once did I have to swap to the second after the batt charged all night because I took at least a couple hours worth of videos. Now I rotate through all 3 of them and they all seem to last as long as the day of their first use.Now enough of batt life.The images the camera takes are bright, clear, you can set it to auto and have a perfect picture every shot or you can choose to do your own settings.Some of my favorite settings are the miniature and macro. There are many options and then options on top of those. There is too many to explain all and on top of that I still have yet to experiment with all the possibilities, which is surprising considering I had it for over six months now.I will say in auto it takes *Great shots all around* Night* Day* Close-Ups* Far away* Even flyby shots In the car*Even at times when I rushed to get a flyby picture I was surprised the camera at least 50% of the time captured a great image even though my jolting hands were likely giving the thing havoc. Mind you, it is best to expect to hold the camera steady, aim and take your pic, in that manner the camera will never fail to produce a wonderful picture.I will point out the only two downsides & one minor nuances that I can think of, while they didn't matter to me, they still may be issues important, or not, to you and thus it will help you decide to get or skip over this camera for yourself.When taking a video with a very bright light (like the actual orb of the sun) it tends to bleed right across the video in a thin streak. *Note this is not a concern for pictures, ONLY videos* I do not often have such a bright light in my video, so this was not a major concern to me. If you like to take videos of the sun, fires, candles or other bright lights you will be irritated by this.There are a few options to take night/dark area photos, one of these is the low-light option and it does not produce the sharpest image. But if you do not mind softer edges it will capture shots in what appears to be exact duplicate lighting of real life.This was not important to me, because I tend to like to use the flash in low light areas anyway and the pictures I tend to want without flash are of lights, which the camera does not need the low light to capture.Now the minor nuances is I had to adjust myself to the camera to enable proper focus by giving a little pressure to the shutter button a second or half a second before taking a photo. It was slightly off putting at first, but now it is second nature.The value of this camera for cost feels like a steal. I feel like I have a 300-400 dollar camera. As for the battery life, well it seems like the camera ends up paying for itself with the amount I have saved in comparison to the battery consumption of my past cameras.Very happy with this camera.*I want to Add; I read everywhere about this camera before buying, watched reviews on youtube, elsewhere and everything said was great (save for those picking on tiny things when comparing to much more expensive cameras). However, when it came down to it I almost was not going to buy this camera because of the Ridiculous claim of distortion by the other reviewer here on Amazon!!! To think what I would have lost out on! That review that actually in FACT DID NOT HELP the 199 people that said it helped cause they lost out on a great camera! We can assume the kindest thing and say that reviewer must have left the camera in the \"Fish-eye\" option, which is a playful option to make funny photos. (Honestly I think the whole review is someones idea of a horrible joke or a competitors idea of throwing people off the scent of a great buy, cause the fish-eye thing is pretty obvious to discover!) I found ZERO distortion in ALL the photos I took with this camera, other then the intended ones, as the fisheye does a funny barrel look, the miniature option fogs the bottom and top to make things look tiny, as edges are blackened to create a viewmaster sort of effect with the toy-camera option. As I mentioned above there are too many options and options to list. Anyway I am thrilled I ignored that review!!*", "Date": "August 29, 2012"}, {"Title": "State of the Art for an Easy Camera", "Author": "Sophy0075 \"bluestocking\"", "ReviewID": "R1VB6JMNWETCE", "Overall": "4.0", "Content": "I purchased this camera to replace its 7 megapixel ancestor. Most of the buttons and menus are similar to my previous camera, so my learning curve was not as steep as it might have been, however, I must admit I have not yet experimented with the camera's video capabilities, nor have I yet taken fireworks or rapid action photos. Still, anyone over the age of four and seniors can use the \"Auto\" or \"Easy\" functions and end up with some decent shots.I would give this camera five stars except for the following quirks:1. The focus delay (pressing halfway down, then pressing the snap button) takes some getting used to.2. The RGB coloring is off when taking photos of a focal length more distant than 15 -20 feet. I will have to read the 200+ page instruction manual to learn how to correct this. Right now, I'm just fixing photos individually using the \"edit\" function. This is definitely the most irksome defect.3. I wish the 200+ page instruction book came with the camera, rather than having to download it. It seems to me that if I pay over $100 for a camera that its manufacturer can spend a few quarters to include a hard copy booklet in the packaging.I used the camera for 10 days straight taking over 200 photos, many with flash, and my battery lasted through that and the process of editing many photos and downloading them to Facebook - I think that's pretty good battery life.Regarding Amazon as a seller, I was pleased with the speed with which my camera was sent to me, and the security and protection of the packaging. I was also pleased with the price Amazon offered.", "Date": "June 15, 2011"}, {"Title": "Canon A-3300 Service worse then the poor product", "Author": "MARY E MATHERS", "ReviewID": "R1XXCZYKDXYO0M", "Overall": "1.0", "Content": "The only thing worse then the Canon A 3300 camera is Canon Technical Support!My new A3300 worked for four days then died. I sent it back to Canon, they returned a cheaper model camera. After many hours on the phone they sent me another A3300 but it was the wrong color. After waiting three weeks the color didn't matter. After using it three times it too died. In five weeks I had a working camera for seven days.I called Amazon and they said \"no problem, send it back and we'll refund your money and pay for shipping\". Now thats customer service!The A 3300 felt cheap and flimsy and I wan't satisfied with the ease of use or the quality of the few pictures that I was able to take with either camera. I'm going with Panasonic or Sony this time.Canon never again!", "Date": "September 9, 2011"}, {"Title": "AMAZING! AMAZING! AMAZING!", "Author": "Spunk Smith \"Spunk\"", "ReviewID": "R3VPWZRR3XXM7R", "Overall": "5.0", "Content": "okay for every one who has bought this camera and is not satisfied there must be something wrong with the camera! I use this for my boarding vids and the quality is INSANE! this camera is AMAZING! 16 MP THIS IS THE REAL DEAL!", "Date": "January 23, 2012"}, {"Title": "great camera", "Author": "mander", "ReviewID": "R2AVLIYXHVGW5", "Overall": "5.0", "Content": "Better than i expected, since it replaced a 10 year old camera... a lot has changed, sharper images, better zoom capabilities, cool features I haven't even figured out yet!  Don't forget to buy a memory stick at the same time or you will not be able to play!", "Date": "November 4, 2011"}, {"Title": "GREAT--- For a wax museum", "Author": "Chelsea", "ReviewID": "ROZK98KKWIF6D", "Overall": "2.0", "Content": "The title of my review means this: If your subjects are dead or standing completely still, the photos will turn out great! But like another reviewer said: If you have kids that move, forget about getting a clear, focused photo. For the price I paid ($158) I'm not happy. I have a $90 Sony Cybershot that takes photos just as well. The shutter lag is just too slow for me. Another thing I'm not happy about: No user manual. Just a set-up manual. So if you don't have a PC, like myself (well, I do but at the moment it's broken) then forget about learning how to actually USE your camera because all the bells and whistles are explained on a software disk. So dumb. Not everyone wants to or can go run to a computer just to figure out how to use the camera. My BFF has a $450 Canon. It's amazing. I should have either robbed a bank to afford that one, or stuck with Sony or Nikon for the cheaper camera. I'm in limbo about taking it back though because I will admit, the macro up-close shots are pretty sweet. But...no one takes photos from 3 inches away all the time. So, overall this camera is decent enough for a point-and-shoot, but NOT for the price. But if you're rich and $160 is nothing to you,then buy it for your teen; they will love it. And buy yourself the $450+ Canon; they are worth every penny.", "Date": "May 31, 2011"}, {"Title": "Returned it", "Author": "Leslie C. Smith", "ReviewID": "R1XQYPYAM7IN6V", "Overall": "1.0", "Content": "Too complicated for an electronically challenged person such as myself.  I was looking for someting you simply point and shoot pictures with.  This camera requires decisions . . .", "Date": "July 19, 2013"}, {"Title": "Don't fix what ain't broke", "Author": "Juice", "ReviewID": "R26NY8HCNTKN0U", "Overall": "5.0", "Content": "This camera is so easy to use!!I bought one last year but lost it on a recent vacation.  Full of my vacation shots, of course.I got back home and started looking at the new model but the new model isn't as user-friendly and they didn't really make any technical improvements (MP or zoom) so the hunt began for this older model.I ended up paying more than what the current model is selling for but well worth it!!", "Date": "March 20, 2013"}, {"Title": "Canon Pwershot A3300", "Author": "C. Petrie", "ReviewID": "R3H7HFRC78J62F", "Overall": "3.0", "Content": "I like the camera, however the CD that came with it had a program that Canon no longer uses. I had to call Canon and get help in getting my pictures on the computer. I will continue to use it and keep trying through trial and error to get what I expected from it.The people at Canon are very nice to work with and I'm sure I will be calling them again.", "Date": "March 18, 2013"}, {"Title": "Good camera for the price.", "Author": "deadline", "ReviewID": "RG12OXDRFHKKT", "Overall": "4.0", "Content": "Takes good pictures in various lighting conditions.The battery lasts well and recharges quickly.Flash is powerful enough for most conditions.", "Date": "March 12, 2013"}, {"Title": "Lot of Camera with many features for very little investment!", "Author": "St. Byron \"St. Byron\"", "ReviewID": "R13CK1IBU3MT2G", "Overall": "5.0", "Content": "Incredible camera for the Price!  Many features like electronic Zoom lens, Auto focus, face recognition and many more!  And OH! did I mention 16 MP!  Enlarges shot to large sizes with super high resolution!  Super Buy!", "Date": "March 7, 2013"}, {"Title": "Love Canon", "Author": "Sehkcee \"Sehkcee\"", "ReviewID": "R234KAP173TBKE", "Overall": "4.0", "Content": "My original powershot took prettier pics I guess theres a way to change the settings but I haven't figured it out yet and probably wont because I now have a iPhone.", "Date": "March 6, 2013"}, {"Title": "Nice features", "Author": "O. Castillo", "ReviewID": "R1DTNL8PP7GYIJ", "Overall": "4.0", "Content": "I have always enjoyed the Canon color processing, and this camera did not disappoint.  Great color, very compact size, and many features make this a great little camera.", "Date": "March 3, 2013"}, {"Title": "I love this camera!", "Author": "alexisfaith", "ReviewID": "R1D7SAKKS4PUON", "Overall": "5.0", "Content": "I love this camera, I've had it for over a year now. It has great features. I especially love the toy camera effect. Of course, I also love that it's pink. Great simply and easy to use camera.", "Date": "February 28, 2013"}, {"Title": "camera", "Author": "summersgal01", "ReviewID": "R1C3ND1ZN8EIV8", "Overall": "5.0", "Content": "takes wonderful pics have used it a lot fast charging easy to carry i love this camera would definitely recommen this", "Date": "February 12, 2013"}, {"Title": "GREAT CAMERA, GREAT PRICE!", "Author": "Mike7456", "ReviewID": "R31P5E9NPCTQ9G", "Overall": "5.0", "Content": "Works good and Canon has the best bang for your buck.  Perfect for my wife's purse and has some picture enhancements that provide some added value.", "Date": "February 8, 2013"}, {"Title": "Camera", "Author": "Jess", "ReviewID": "RNYZ47JNSAI30", "Overall": "3.0", "Content": "It was a good camera, it had a lens error in less than a month though, I had only taken it out of my camera case, turned it on, and it malfunctioned. Not the seller's fault though! And they refunded my money for it fully and were easy to work with!", "Date": "January 31, 2013"}, {"Title": "Canon Powershop A3300 IS 16MP Digital Camera with 5x Optical Zoom", "Author": "LAM", "ReviewID": "R2SA5M5VCK17FS", "Overall": "5.0", "Content": "I LOVE this camera!  It is compact and very easy to use and takes GREAT pictures!  I use this all the time now for personal use AND work use.  I haven't even read the directions yet, it is that easy to use.  And I love that the battery takes minimal time to recharge and that charger is lightweight and portable.  LOVE IT!!!", "Date": "January 13, 2013"}, {"Title": "A good camera.", "Author": "S", "ReviewID": "RT67P29U6J97Y", "Overall": "3.0", "Content": "Quite a good camera, Somehow it fell and the screen broke. I think it may be a bit fragile because it was actually in the case when it fell.", "Date": "January 13, 2013"}, {"Title": "Like it.", "Author": "Rusty G", "ReviewID": "R3R8KD66D725Q0", "Overall": "4.0", "Content": "Had mine several months now. No problems with it. Although on the camera  video playback the volume isnt very loud at all.  Nice little camera. I like it..", "Date": "January 2, 2013"}, {"Title": "Slow", "Author": "Graeme Alkins", "ReviewID": "R3W3VUZ9Q1MTNY", "Overall": "2.0", "Content": "I agree with other negative reviewers, this camera is a pain to use when it has to focus and the length of time it takes to finally shoot. For the price it can probably satisfy more patient persons.....", "Date": "January 2, 2013"}, {"Title": "Good Camera", "Author": "Just Some Guy \"Cas\"", "ReviewID": "R1ZVQO498265O6", "Overall": "4.0", "Content": "It takes beautiful photos, but takes a long time to take the shot (which I understand most new cameras do, but when you are trying to take photos of 3 year olds you only have 1 second to take the shot before they run away and the memory is lost forever).Everything else about the camera is great. As such, if you are using it to take photos of adults, then its fine, but if you are using it to take photos of young kids it may not be the best choice for you.", "Date": "May 30, 2012"}, {"Title": "A cut inside Blade Runner!", "Author": "W. Rodick", "ReviewID": "R3BLSLGFV9HN", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2ZI25M7OHKE7embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2ZI25M7OHKE7refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2ZI25M7OHKE7chiDiv\").innerHTML = document.getElementById(\"cv_mo2ZI25M7OHKE7hiddenPre\").innerHTML;\n};\ncv_mo2ZI25M7OHKE7refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2ZI25M7OHKE7so;\t   \n\n\nfunction cv_mo2ZI25M7OHKE7loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2ZI25M7OHKE7so = new SWFObject(swfLocation, \"cv_mo2ZI25M7OHKE7AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2ZI25M7OHKE7so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2ZI25M7OHKE7so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2ZI25M7OHKE7so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2ZI25M7OHKE7so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2ZI25M7OHKE7so.setAttribute(\"height\", swfHeight);\n          cv_mo2ZI25M7OHKE7so.setAttribute(\"width\", swfWidth);\n          cv_mo2ZI25M7OHKE7so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2ZI25M7OHKE7so.write(\"cv_mo2ZI25M7OHKE7flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2ZI25M7OHKE7', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2ZI25M7OHKE7';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2ZI25M7OHKE7', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2ZI25M7OHKE7loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2ZI25M7OHKE7\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3JLY9Q4CO9LAJ\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3JLY9Q4CO9LAJ\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3BLSLGFV9HN\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3JLY9Q4CO9LAJ/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2ZI25M7OHKE7duration')) {\n      document.getElementById('cv_mo2ZI25M7OHKE7duration').style.display='none';\n    }\n    cv_mo2ZI25M7OHKE7loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2ZI25M7OHKE7loadSwf(movieID, playerVersion) {\n   return _cv_mo2ZI25M7OHKE7loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2ZI25M7OHKE7newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2ZI25M7OHKE7', 0, h);\n}\n\nfunction cv_mo2ZI25M7OHKE7resetPlayer(w,h,bw,cc) {\n  cv_mo2ZI25M7OHKE7newHeight(h);\n\n  cv_mo2ZI25M7OHKE7so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2ZI25M7OHKE7so.addVariable(\"cacheCode\", cc);\n  cv_mo2ZI25M7OHKE7so.setAttribute(\"height\", h);\n  cv_mo2ZI25M7OHKE7so.setAttribute(\"width\", w);\n  cv_mo2ZI25M7OHKE7so.write(\"cv_mo2ZI25M7OHKE7flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2ZI25M7OHKE7RollOverImg = new Image();\ncv_mo2ZI25M7OHKE7RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81Juy-btpcS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2ZI25M7OHKE7preplay = document.getElementById('cv_mo2ZI25M7OHKE7preplayImageId');\nif (cv_mo2ZI25M7OHKE7preplay) {\n  cv_mo2ZI25M7OHKE7preplay.onmouseover = function() {\n    cv_mo2ZI25M7OHKE7preplay.src = \"http://ecx.images-amazon.com/images/I/81Juy-btpcS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2ZI25M7OHKE7preplay.onmouseout = function() {\n    cv_mo2ZI25M7OHKE7preplay.src = \"http://ecx.images-amazon.com/images/I/81Juy-btpcS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2ZI25M7OHKE7preplay.parentNode;\n\n  var cv_mo2ZI25M7OHKE7currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2ZI25M7OHKE7currentClick) {\n      return cv_mo2ZI25M7OHKE7currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:57 MinsA brilliant piece of kit this Canon A3300 compact camera. I prefer it set up in widescreen mode (W) which is meant for widescreen television use but is a perfect fit for digital photo frame (shown in video).The biggest difficulty is getting accustomed to the wide-angle lens. Perfect for outdoor landscapes and city scapes, more general use means careful use of the zoom function. Indoor shots are excellent thanks to the range of shutter speeds and the flash. The Macro setting had me staring at the hairs on the trunk of a Rosemary plant on my kitchen shelf! Very impressive.Its first use was for an ID photo I needed. I used the self-timer and being someone who wears glasses was appreciative of the non-flash picture. Colour was tweaked in my Adobe Elements photo software.I would suggest that this is no camera for beginners. The range of options still has me dipping into that 200 page manual. Whilst the Easy switch enables kids to use the camera this has a 16 mega pixel default setting for an A2 size photo. In other words: TREAD CAREFULLY!The image stabiliser for movie makers feels like the camera is on a tripod. A quality memory card like the one shown in video is a must for making movies. It was a film that immediately sprung to mind when I first switched on the camera after charging the battery. The film Blade Runner: The Final Cut inspired my video and seems to get better each time I view Ridley Scott's dystopian nightmare world of darkness and rain: \"If you're not cop - you're little people\" says the fat controller of Harrison Ford's former occupation.The camera case is EXPro Hardcase, camera case for Canon Powershot A3300 IS,. Glad I chose the red option for my camera - a sexy little number!", "Date": "March 20, 2012"}, {"Title": "Perfect pocket camera", "Author": "Angela Large", "ReviewID": "R74BUTOH3DN0P", "Overall": "5.0", "Content": "My old camera died so I went looking for a new, small, inexpensive camera to replace it.  This camera had a lot of great reviews.  And, of course, the brand has a great reputation.  So far, I've used it quite a bit.  It is very easy to use.  Very quick to power up.  Lots of settings to chose from.  Huge playback screen, it just about takes up the whole back of the camera.  Very happy so far!", "Date": "March 4, 2012"}, {"Title": "Okay for intended purpose", "Author": "Dan Yoder", "ReviewID": "R2RPGUD5PZH8U6", "Overall": "3.0", "Content": "This camera is a great point and shoot camera.  If you are used to digital, then this is a great choice.  Great video, which I suggest if you are taking pics of small children, or moving objects.  If, however, you learned to shoot on a 35mm, you will have a learning curve with this camera, as there is a 3-5 second lag time between when you press the button, and when the actual shutter functions.  Thinking your picture has been taken, you then move the camera, and the picture is blurred.  Also, when the subject is moving, your pics will be blurred, regardless of megapixels.  I believe persons who learned to shoot on digital pics will love this, but if not, expect a learning curve.  All in all, I do love this camera!", "Date": "January 22, 2012"}, {"Title": "Better than OK camera", "Author": "schreibf", "ReviewID": "R17A2ZIM5RLI55", "Overall": "4.0", "Content": "I bought my A3300 about a week ago and was a bit surprised to find the optical zoom ability at 6.3x then a digital zoom at 20x!  I've taken a few pics at 20x indoors where the flash could illuminate well and they turned out better than I expected.  The camera is so small it's easy to cover something like the microphone or flash when you don't want to.  Start up and pic to pic times are fair.  The 16 MP resolution can be adjusted to 8 or 2 or VGA (I would have preferred 4 MP).  Pic/video quality is OK for me although some will object.  It's not perfect but for the price and portability it's pretty good and extra chargers and batteries are cheap! I now carry mine everywhere in a hard case for protection.", "Date": "December 12, 2011"}, {"Title": "i love it", "Author": "ghada", "ReviewID": "R1238UOD4P9QGC", "Overall": "5.0", "Content": "This is an excellent Camera. It turns on and is ready to shoot in about a second. And if you change the default image size from the huge 16 megapixel to something more commonly used in the real world (and you have a fairly fast SD card), you can be ready for the next picture in less then a second", "Date": "November 29, 2011"}, {"Title": "Perfect", "Author": "Jose D. Soto", "ReviewID": "R5EDTKF1UTMKC", "Overall": "4.0", "Content": "Considering the price, this is a nice camera to travel with and take great pics. So far I have no complaints.", "Date": "November 18, 2011"}, {"Title": "Amazing!", "Author": "Sharpshooter", "ReviewID": "R373XG0B8NLWTR", "Overall": "5.0", "Content": "This product is amazing.  It is all that Canon stated it was.  It is simple to use (I'm an auto-type photographer)and the zoom is great.  I especially appreciate the large LCD viewing screen. I hope it offers me years of enjoyment as did my last Canon digital camera.", "Date": "October 28, 2011"}, {"Title": "Love this camera!", "Author": "StephanieLovee", "ReviewID": "R20WKJOSV3RK3Q", "Overall": "5.0", "Content": "Amazing camera! 16 MP is definitely very clear. It automatically changes the lens for each surrounding which is great! I couldn't have asked for a better camera! It is the best point and shoot camera you can find!", "Date": "October 27, 2011"}, {"Title": "Canon Powershot A3300 IS", "Author": "LPrete", "ReviewID": "R1WIH1OEIRB628", "Overall": "5.0", "Content": "This is the best little camera I've ever owned.  I love the clarity and simplicity of the Canon Powershot A3300 IS.  I've never owned another brand of camera, why quit a good thing and the price at Amazon was the best I could find.", "Date": "October 23, 2011"}, {"Title": "Good picture for a fair price", "Author": "JJr", "ReviewID": "R10XIQQSQM494Y", "Overall": "4.0", "Content": "My only negative comment is the shutter lag. It's easy to use, good picture, compact, nice point and shoot camera. If you're far from professional, this is a good buy.", "Date": "October 10, 2011"}, {"Title": "Great Camera, Great Price", "Author": "Alan Fischer", "ReviewID": "R1KPF2OQKF6VTU", "Overall": "5.0", "Content": "Very happy with the quality of this camera. The pictures it takes are wonderful. Easy to use and all at a great price. Highly recommend.", "Date": "October 9, 2011"}, {"Title": "Anthony Mozzo", "Author": "Anthony", "ReviewID": "R19MCPP5UK9FAK", "Overall": "5.0", "Content": "I give this camera a excellent rating, easy to use and the picture qulity is great. the rechargeable battery charge last a reasonable time even when recording video.", "Date": "July 5, 2011"}, {"Title": "Great camera!", "Author": "V. Oswald", "ReviewID": "RLNR1PRU8T88F", "Overall": "5.0", "Content": "I've only used it a few times but I have been very pleased with it so far.  The shutter speed is much faster then my older Canon (to be expected) and my pictures seem to be a lot more vibrant as well.  Not to mention, the camera is so light weight that I don't feel like I'm carrying a brick in my purse anymore.Great camera, highly recommend it...especially for the price (best price was on Amazon!).  This is my 2nd cannon in 5 years and I can't say enough good things about the product.", "Date": "July 1, 2011"}, {"Title": "Great Canon Camera", "Author": "Ella Harmon", "ReviewID": "R3U1ROXBEJBYC0", "Overall": "5.0", "Content": "This camera takes great pictures and video. It is easy to use. Small enough to be easy to carry with you.", "Date": "May 26, 2011"}, {"Title": "Cheap Material", "Author": "M. Castillo \"M C\"", "ReviewID": "R1IBGZUHZ5IMWC", "Overall": "2.0", "Content": "After days of searching for a replacement for my Kodak 12MP, I thought this was the perfect one. I assumed that 16MP would give me amazing pictures... BIG disappointment. My friend has a Canon 14MP Powershot and that one does take better pictures. After reading all the features this camera had, I decided to order 2, one for me and the other one as a gift. BIG mistake, the material is very cheap (plastic). As soon as I opened the box and felt the material, I immediately printed out a return label. It looks and feels cheap.", "Date": "July 19, 2011"}, {"Title": "Not for all situations", "Author": "Jennifer Rankin \"mysticspring\"", "ReviewID": "R1CBF76IORDMK9", "Overall": "3.0", "Content": "I wanted a small, easy to use camera to take camping, horseback riding, etc.  This fits that bill but one feature I either haven't found or it doesn't exist is a \"sports\" setting.  From the time I hit the button to take the photo to the time the photo actually takes is about 3-4 seconds and changing the setting doesn't seem to help.  I think I'm going to swap cameras with my husband and let him take this one to construction and maintenance sites and I'll take his cheaper Kodak for my action shots.  It is possible that I haven't learned this camera enough but if you want action shots, I would definitely research it well before buying.", "Date": "July 12, 2011"}, {"Title": "Decent pictures, but very slow!", "Author": "CMT", "ReviewID": "R3UDZQN9TWABYM", "Overall": "3.0", "Content": "My husband and I purchased this camera to replace an older Canon Powershot Elph that we gave away. We liked that camera and were sure that we couldn't go wrong with another of the same brand. Although the few pictures we took with this model looked fine, we will be returning the camera simply because it is just too slow. The shutter lag after you press the button is about two seconds, which is a really long time if you're trying to catch a candid shot. The camera also requires several seconds after it actually captures the shot before it's ready for another. This is, of course, a problem with all digital cameras to some degree, but this (newer) camera is noticeably slower than our old Elph. It's not a bad camera in terms of image quality, ease of use, or anything like that - it's just slow.", "Date": "July 5, 2011"}, {"Title": "I like Canon Cameras", "Author": "T. Armstrong \"60's fan\"", "ReviewID": "R2L9MA461CNC7V", "Overall": "4.0", "Content": "Overall the Canon Powershot A 3300 IS is a very good camera.  It is easy to use, takes great photos, and is a high resolution 16 Megapixels.  I bought this camera as an upgrade from the Canon Powershot A 2100 IS.  In my opinion the A 3300 IS is not as well made as the A 2100 IS (which in my opinion is the best of the Powershot series of cameras).  The Canon Powershot A 3300 IS does have more features than a lot of its Canon Powershot predecessors, which I do like.  All in all, the Canon Powershot A 3300 IS, will outperform most of its competitors.  The only negative aspect is the 5x zoom, I think Canon could have at least made it a 7x zoom.", "Date": "March 23, 2011"}, {"Title": "Decent, not brilliant.", "Author": "Charity Burseth", "ReviewID": "RCW67M9I0ZLHG", "Overall": "3.0", "Content": "Pretty good camera, just very slow speed between shots. If you need to take multiple, quick shots in succession, look else. Also, software does not work w/ windows vista. I had to put the SD card directly into the computer, instead of uploading w/ the usb camera plug-in. Otherwise a pretty decent camera. Typical canon fair.", "Date": "June 16, 2011"}, {"Title": "Mediocre Pictures", "Author": "Mark Chevy", "ReviewID": "R19PQXYN7CJO3K", "Overall": "3.0", "Content": "I purchased a Canon A3300 to replace a Fuji JZ300 which I had purchased to replace an older 6MP Fuji E550.  The Fuji JZ300 had problems focusing (see my review).  The 16MP A3300 has no problems focusing, and, at first look, the pictures seem to have good resolution.  But, as you take a closer look, they look sort of muddy.  Worse though, the a3300 colors look off and unnatural.  Outside pictures are ok, but are over-exposed and a bit washed out.  Some can be corrected with picture enhancement software.  Camera settings don't seem to help much - I've tried them all.  Indoor pictures look sort of yellow, which I can't seem to correct with either camera settings or enhancement software.  I find myself wondering how more resolution can result in worse looking pictures, especially when examined close-up.  Very disappointing.  Anyhow, I am left with using my e550 with slightly lower resolution, but much better looking pictures. (I should note that the a3300 HD videos are ok.)  Not sure what to try next!", "Date": "September 17, 2011"}, {"Title": "Stopped working after a few days!!!", "Author": "Farid", "ReviewID": "R15VFTGLVKOVPP", "Overall": "1.0", "Content": "It worked for only a few days!!started to have problem turning on and the stopped turning on completely.I didn't really get enough time to see how the quality can be.Very disappointment with this product.", "Date": "September 3, 2012"}, {"Title": "Bought as as gift.", "Author": "Joshua Rand-Castillo", "ReviewID": "RH5UIR9VO3CO6", "Overall": "3.0", "Content": "I have no idea how good this is. I bought if for a gift for someone not comfortable with technology and she seems to like it when she uses it.", "Date": "January 21, 2014"}, {"Title": "used Canon Powershot", "Author": "Tracy Beggs", "ReviewID": "R3UZ2XW7A57K21", "Overall": "5.0", "Content": "I rcvd the camera in good time, it came with a battery and a battery charger. I bought a memory card for it at a local store. I just went to Canon's site to pull the instruction manual and I am set.  The camera is in working condition, no problems at all. I don't think I will be purchasing brand new cameras any longer - the price for this was very good,  I saved money and I have a great camera now.", "Date": "January 9, 2014"}, {"Title": "works great", "Author": "J. fuller", "ReviewID": "RHYYZ4PE6UU6", "Overall": "5.0", "Content": "Husband had his camera like this stolen out of his vehicle and was upset. Found it on amazon. It is very easy to use and pictures are great.", "Date": "January 5, 2014"}, {"Title": "Nice Camera", "Author": "M. Sookhoo", "ReviewID": "R3C7J8VAQRLRV0", "Overall": "5.0", "Content": "This camera really works well and so far has not disappointed me.  The reason for buying is the size since it can fit easily in my pocket but the pictures are exceptionally good.  I also like the rechargeable battery that it comes with and must say that (on a full charge) it lasts long enough during the day to fulfil my needs.", "Date": "November 18, 2013"}, {"Title": "This camera is really nice though I’ve only used it once. I prefer my phone as a camera now really. Yet, this is perfect!", "Author": "Kay Glenn", "ReviewID": "RBFQ84CQATED0", "Overall": "5.0", "Content": "This camera is really nice though I’ve only used it once. I prefer my phone as a camera now really. Yet, this is the perfect camera. I just keep forgetting to get batteries for it as it doe just batteries quickly. This is a great camera for the great price necessary for me. Thanks again to amazon we found what we were seeking to find...", "Date": "November 16, 2013"}, {"Title": "Good", "Author": "Lilly \"Lilly Bell\"", "ReviewID": "R1M56GC3XYLJ63", "Overall": "5.0", "Content": "This camera takes awesome pictures. The resolution is amazing and the pictures always come out crystal clear, no blurring at all. Also resilient as I am kinda clumsy.", "Date": "November 7, 2013"}, {"Title": "canon powershot A3300 IS 16 MP  DIGITAL CAMERA", "Author": "Carolyn Tudor", "ReviewID": "R2F445BU9VX075", "Overall": "5.0", "Content": "I enjoy this camera  for its ease in taking photos and the quality of the product. My previous camera was also identical to this one but black. I had dropped it  so immediately ordered another", "Date": "September 14, 2013"}, {"Title": "fun", "Author": "tinalea", "ReviewID": "R25EZJ9QE94418", "Overall": "5.0", "Content": "Fun and function little camera that was purchased for my daughter. She had a nice professional camera but uses this one more because of the size and quality of photos she gets from it.  Great purchase!!!", "Date": "September 3, 2013"}, {"Title": "Not as good as I thought", "Author": "A Customer", "ReviewID": "R2FMR5IZ6RDU6A", "Overall": "3.0", "Content": "It's nice for the price but i wish the shutter speed was quicker and the focus was a little better", "Date": "August 20, 2013"}, {"Title": "Wish it had more zoom", "Author": "Lindsey E Houchens", "ReviewID": "R2S3JSG6L8TF0F", "Overall": "3.0", "Content": "This camera had a great review in Good Housekeeping Magazine, which is why I bought it.  Unfortunately, I should have done some more research before buying.  On the plus side, it is very easy to use and compact.  It also has a high megapixel value.  On the downside, it has a low optical zoom at only 5x. I was at a friend's wedding recently and couldn't get a good picture of the bride and groom because we were too far back in the reception hall.  It also does not perform that well in low light.", "Date": "August 3, 2013"}, {"Title": "Perfect, just what my daughter needed", "Author": "bennie hester", "ReviewID": "R2M516E2LDARJS", "Overall": "5.0", "Content": "Get for the cost. She loved it. I would recommend this gift for your teen. the pictures are outstanding. I would buy more for family members.", "Date": "July 23, 2013"}, {"Title": "Canon digital camera", "Author": "carolyn hilton", "ReviewID": "R251VPN7S0XUG1", "Overall": "5.0", "Content": "We've been wanting a digital camera for some time & just decided that now was the time to get one. I kept checking on Amazon until I found one that I thought would do what we wanted. We've very pleased with it.", "Date": "July 21, 2013"}, {"Title": "I Like it.", "Author": "sushanta", "ReviewID": "R3LRUIB9CFCPBE", "Overall": "4.0", "Content": "Very good and robust product. This is a nice camera for rough use at anywhere. Its make sense to spend money for this.", "Date": "July 20, 2013"}, {"Title": "good camera", "Author": "Dawn Thilmony", "ReviewID": "R2M9CZVCABRRT1", "Overall": "4.0", "Content": "This was a replacement for another one - exactly the same.  We are quite happy with the camera and would recommend it to others.", "Date": "July 15, 2013"}, {"Title": "Excellent camera", "Author": "Austin", "ReviewID": "RJRFVTWK18KPA", "Overall": "5.0", "Content": "Had no problems with the camera. Looks good works well.  The only problem we had, is my daughter let a friend us it.  It came back dropped and scratched.  Do not lend your cameras to others.", "Date": "July 7, 2013"}, {"Title": "Canon Powershot", "Author": "The Smurf Family", "ReviewID": "R1W0LAUEI2E64U", "Overall": "4.0", "Content": "This camera is SO easy to use. I love the fact that it comes with a rechargable battery, instead of using AA's. The quality of pictures that this camera takes is also good. It's not too big; a really nice size. This camera would be  kid or adult friendly. It's that easy to use! I am very pleased with my Canon Powershot A3300 IS camera!", "Date": "June 30, 2013"}, {"Title": "Used for Business", "Author": "Gregory A. Adkins", "ReviewID": "R1K9FVODGH1BYS", "Overall": "5.0", "Content": "My wife and I own a real estate appraisal business and use this camera as our primary tool for taking house pictures. It has been used daily for months and we have taken thousands of photos with it. Works great. Never misses a shot. It is very easy to use but gives tons of options. Great camera!", "Date": "June 26, 2013"}, {"Title": "Great Camera", "Author": "Lovie1170", "ReviewID": "R22QTGUEAJYQLI", "Overall": "5.0", "Content": "Bought for my son as gift..he is very happy with this camera..for the price it is an excellent buy.  He takes many photos, I think, thou, he said its recovery period between shots is a little too long.", "Date": "June 9, 2013"}, {"Title": "Great camera, wayyyyy under the radar", "Author": "Movielighter", "ReviewID": "RR4BL8CXQJHEU", "Overall": "5.0", "Content": "There is a lot more to these cameras that most people realize. Has full auto mode and a manual mode for more specific operation. Great quality!  I purchased it for commercial footage in a tight spot (small mount in a tree) and ran it for a time lapse sequence that very easily fit in into a full 1080p production (still footage at even 12mp is more than 2k in video). Camera is light, battery lasts 1.25 hours running photos every 5 seconds, does not draw attention like a DSLR or larger camcorder.", "Date": "June 7, 2013"}, {"Title": "The Camera H Served Me Well", "Author": "David Schechter", "ReviewID": "RUUCHZA052KR6", "Overall": "5.0", "Content": "We've been all over the world with this camera and I've had no problems using it.  It works very well.", "Date": "May 11, 2013"}, {"Title": "cannot beat the quality or durability of this camera for the price.", "Author": "Bryan Moes", "ReviewID": "R3KK5P3R26W1QD", "Overall": "5.0", "Content": "This camera takes great photos up close and at a distance.  the Image Stabalizer (IS) option on this camera makes it great for taking close up photos clearly the first time you take a photo.", "Date": "April 15, 2013"}, {"Title": "Pocket size camera", "Author": "Patricia A Myers", "ReviewID": "R1JG0KJTCYRPUG", "Overall": "5.0", "Content": "I use this a lot and the pictures come out very clear.  I would recommend this to anyone looking for a small camera with a zoom.", "Date": "March 20, 2013"}, {"Title": "THE Point & Shoot!", "Author": "PMFog", "ReviewID": "RSYA3AWP3FXPC", "Overall": "5.0", "Content": "This little bundle of technology is so good I'm planning to take it to heaven to make one amazing album!", "Date": "December 16, 2012"}, {"Title": "Very Nice camera", "Author": "User Sierra", "ReviewID": "R2FQESPB6IM405", "Overall": "5.0", "Content": "This camera is very nice for the price I paid for it ($99 in a goldbox deal). It takes very good looking pictures. I love the autofocus feature, the only thing I dont like is how slow it actually takes the pictures because of the autofocus. Maybe it`s just a setting that I havent figured out yet. Otherwise I love this camera for the price I paid for it. It`s easy to use and the size is perfect for carryng it around anywhere.", "Date": "December 10, 2012"}, {"Title": "Nice camera for the price", "Author": "Jordan Bach", "ReviewID": "R1QCTJFAH72SKS", "Overall": "4.0", "Content": "It's a very nice little point and shoot camera.The quality of the pictures turns out very well and the effects are great to play with.The only downside is that some settings make cause the camera to make a strange noise no matter what i switch around.It was still worth the money just for a small camera to carry around.", "Date": "December 9, 2012"}, {"Title": "Very easy to use camera.", "Author": "Pacific Northwest", "ReviewID": "R3O3MM78GI97YC", "Overall": "4.0", "Content": "This camera takes great pictures. It did a great job capturing a lightning storm at the Grand Canyon on video! I'm very happy with the resolution. The battery lasts a long time, much better than my Nikon. It works well taking pictures of my cats inside without a flash. My cats eyes usually glow when using the flash, so this feature is great. Was disappointed the the camera in my Droid phone captured the Grand Canyon color better than this Canon around sunset. It works great for taking action pictures at Seahawks games.", "Date": "December 8, 2012"}, {"Title": "Quick delivery, good price", "Author": "Jarm", "ReviewID": "R1OBWQ92A0OJMY", "Overall": "5.0", "Content": "Had to replace this camera from last year becuase it was dropped several times.  Prior to that it was a good camera and took great pictures.  No complaints and was a good price.", "Date": "November 30, 2012"}, {"Title": "Unhappy", "Author": "merryberry", "ReviewID": "RDO909IXJQ8N5", "Overall": "2.0", "Content": "I have been a fan of Canon cameras for years; however, I have been quite unhappy with this model. For the most part, pictures taken outside during the day in good light are very nice. However, indoor photos have been hit or miss and, as a result, very frustrating. Photos are often blurry or partly blurry, and/or dark regardless of how light or dark the room is. The shutter speed also seems to be quite slow and often delays. Recently I have found I have to wait to take a picture as the screen says something to the effect of \"waiting for flash to charge.\" This is extremely incovenient. I've tried to work with the different options on this camera in hopes of improving the quality, but nothing seems to help. I find it frustrating that this was my \"upgrade\" from my last camera, and the old camera takes MUCH better pictures. Unfortunately, now I'm trying to find yet another replacement. As someone else mentioned previously, I am now nervous about purchasing another Canon.I would definitely consider a different camera before spending the money on this specific model.", "Date": "November 18, 2012"}, {"Title": "it's pretty good, it's cheap and meet my requirement", "Author": "lily", "ReviewID": "R9SF7EBTLY95C", "Overall": "4.0", "Content": "it looks good, and the basic requirement is good enough for taking a photo, very clear, but maybe you need to wait for sometime during taking photos, the video is clear too, it's worth.", "Date": "October 30, 2012"}, {"Title": "Great Camera, tricky flash settings.", "Author": "abartinc", "ReviewID": "RVETYWWX98ZV8", "Overall": "4.0", "Content": "I've had this camera for about a year now, I love it. Takes great photos, and has plenty of settings to chose from. The only issue I have is which setting allows me to have the flash on at all times, which there is one. Sometimes the shutter time is slower than I'd like as well.", "Date": "September 3, 2012"}, {"Title": "Canon Powershot A3300", "Author": "dhork", "ReviewID": "R36P3CS8Y8VDVA", "Overall": "3.0", "Content": "Camera was not as sturdy as I had hoped.  It is made of a plastic type of material and not a more solid metal-like substance.  Buttons also feel like could easily break.  I would recommend spending a bit more and getting a better quality camera.", "Date": "August 7, 2012"}, {"Title": "Gym Girl 52", "Author": "Terri Beach", "ReviewID": "R1AXG72PLA3ZNR", "Overall": "5.0", "Content": "Very please with this product.  Hope to get much use out of it.  It is very compact and the quality of the pictures seems to be very good!", "Date": "July 25, 2012"}, {"Title": "super powershot", "Author": "joker", "ReviewID": "R1LKQ2ENFRT9UH", "Overall": "4.0", "Content": "superb camera for the best price. picture quality is good and video recording is excellent. I bought this for my brother-in-law and he is very happy with its performance", "Date": "July 12, 2012"}, {"Title": "2x the pixels for 1/2 the price", "Author": "S. Crawford", "ReviewID": "R3D8AF7Y0OXRVN", "Overall": "4.0", "Content": "I love my new Canon.  I'm getting twice the megapixels for 1/2 the price of my old camera (which I also loved)Lithium battery lasts a LONG time and pictures turn out great.  I no-brainer.", "Date": "July 9, 2012"}, {"Title": "AWESOME CAMERA!", "Author": "Anonymous", "ReviewID": "R2Y584MSVZLCWR", "Overall": "4.0", "Content": "This camera is awesome! The only problem is that it can't take many videos and I think that's just the memory card. It has a cool zoom that can capture a great picture of an animal. The flash is nice, but don't try to take pictures of shiny objects or it might ruin the picture a little. It's easier to veiw your pictures inside, but it's worth it. Even though I gave this useful camera four stars, it's really four and a half, but I don't think you can do that. This camera is definately worth the money! If it doesn't work like I just wrote, it's not the product, just the camera.", "Date": "July 9, 2012"}, {"Title": "canon powershot", "Author": "sylvia", "ReviewID": "R1CYGIN34KE5C3", "Overall": "5.0", "Content": "The camera is just like new.  It takes great pictures and the colors are really true.  It does a great job with purples, blues and closeups. It focuses very well.  It's hard to get a bad picture.", "Date": "May 22, 2012"}, {"Title": "Wife has one....like it so much....I bought one too", "Author": "Rooftopp", "ReviewID": "R196OC9JQFBV23", "Overall": "4.0", "Content": "Video is easy and sharp.  Lithium rechargable battery saves battery cost.  Best point and shoot I have had experience with and I have owned about 6 point and shoot digital cams.  She has got a pink one and I got the blue :-)I have owned 7 digital cameras and this one has been the best.  Nice night shot ability.", "Date": "May 15, 2012"}, {"Title": "canon 3300", "Author": "bish99", "ReviewID": "R1PI65H0T1BZO5", "Overall": "4.0", "Content": "Nice camera with date stamp at a reasonable price!  These are hard to find!! So many new cameras are great but do not show the date & that is required for our work!!", "Date": "May 3, 2012"}, {"Title": "Great Camera", "Author": "Jade", "ReviewID": "R33KMB8LK6R8OA", "Overall": "5.0", "Content": "This is a wonderful camera. There are so many options, bells and whistles. I love the optical zoom and the ability to correct or manuver the shot. This camera is easy to use and has many, many functions. Still trying to learn them all.", "Date": "May 1, 2012"}, {"Title": "Love this camera!", "Author": "Rachel", "ReviewID": "R3GOAVZRY3ID90", "Overall": "5.0", "Content": "This camera is great! I gave it to my husband for his 25th birthday! He loves it & takes it everywhere with him. It is a great camera, especially for the low cost! We're very satisfied!", "Date": "April 11, 2012"}, {"Title": "My daughter loves this", "Author": "Erin Sullivan", "ReviewID": "R1JROP13CBIEK9", "Overall": "5.0", "Content": "This was a birthday present for my 9 year old daughter. She loves photography and had a very basic model digital camera before this one. She loves it. The pictures are great, it is easy to use. It also takes pretty good video. I even like using this sometimes (when she isnt using it)", "Date": "April 10, 2012"}, {"Title": "Good camera at a good price", "Author": "Jason R. Thurgood", "ReviewID": "R2KM51RKD9WDH2", "Overall": "5.0", "Content": "Bought this camera to replace our old Samsung.  Always been pleased with Canon.  Pleased again.  Camera performs well and has been reliable.", "Date": "April 10, 2012"}, {"Title": "Great for the price!", "Author": "amanda", "ReviewID": "R3PO7JRNKLHQLF", "Overall": "4.0", "Content": "Camera feels cheaper than my older power shot camera, however takes better pictures! I'm not a photographer or anything but feel that this is a great every day camera.The price has dropped on digital cameras finally!!!", "Date": "April 6, 2012"}, {"Title": "Why there is no charger given with the Camera", "Author": "CanonBuyer", "ReviewID": "R2IATW58W1NDIV", "Overall": "2.0", "Content": "There was no charger given with this camera. Not sure if they missed it.  Atleast charger part should be avialable.", "Date": "March 31, 2012"}, {"Title": "Canon A3300", "Author": "Same Old Same Old \"monitress\"", "ReviewID": "R23FHHB5K444J3", "Overall": "5.0", "Content": "Bought it because my son bought one and said it was good.  It is GOOD!  You can review your shots without getting the lens to pop out. Bought a Canon wireless all in one, too.  Together, they make a great pair.  GREAT pictures!  I'm no professional, but I can see the quality.  Focuses for you, balances light.  Zoom doesn't distort picture and blurr it.  Does a good job at taking everyday pictures.  Some professionals even like it.", "Date": "March 29, 2012"}, {"Title": "Cannon A3300 Camera", "Author": "John C.", "ReviewID": "R3FWIPA5XEXYQE", "Overall": "5.0", "Content": "Goodday, I purchased a Camera -Cannon A3300 as my wife has a camera which we paid big money for with very little results., every time one took a picture the batteries had to be replaced it was unrealible to operate.  This Cannon is a must have for the novice or a pro, it is small has a charger,it is very easy to operate and it takes you beaute pictures. The price was excellent and the packaging and delivery was spot on.  This was my first purchase from Amazon and it will not be the last.", "Date": "March 17, 2012"}, {"Title": "Awesome little Camera", "Author": "gypsylatt", "ReviewID": "RGHXGWLZNKWHL", "Overall": "5.0", "Content": "I am by no means a photographer.  I love this little camera.  Bought it to replace my HP 6 megapixel digital camera.  The photos I've taken are great and the video of my musician boyfriend taken at night was incredible.  I would recommend this camera to everyone.  Glad I bought it!!", "Date": "March 15, 2012"}, {"Title": "pretty sweet canon camera", "Author": "ashley miles", "ReviewID": "R21CPMJH3BH9IB", "Overall": "5.0", "Content": "I must say i got this camera on a recommendation from one of my friends and i am pretty satisfied. This is my first digital camera and even though i already had a camera it was an older model and its not digital. So i read the reviews and reread them and made a decision to try it out for myself. Cameras are like people in other words they have personalitys and they need to match the person who will be using it.  Play with the camera in the stores first and then go on amazon.com and buy it so you already know what your getting yourself into. And so that what you end up with matches what you want and matches your personality and ultimately youll be happier.!", "Date": "March 14, 2012"}, {"Title": "Good Camera for great price", "Author": "Red Devil", "ReviewID": "RC6XBY1GOSO4L", "Overall": "4.0", "Content": "Good Camera for great price.Nice to have for taking Casual pictures at home, outdoors etc...I would like to recommend this.", "Date": "March 14, 2012"}, {"Title": "Great Pictures for the Price", "Author": "J. Evleth \"Surfer Joe\"", "ReviewID": "RRD63X81YBUHL", "Overall": "5.0", "Content": "We bought this camera for our ten year old son. He is very happy with it, and I have to say it takes very good pictures for the price we paid.  For basic still shots, even at a moderate distance, the quality is quite good.  Don't expect this product to compete with a good quality SLR,but for something in the $100 price range it's hard to complain.", "Date": "March 13, 2012"}, {"Title": "Canon Powershot A3300 16 MP Digital Camera with 5x Optical Zoom (Black)", "Author": "Jibran", "ReviewID": "R2GKVXJZMZMJC2", "Overall": "5.0", "Content": "Good,Delivery on time, As good as mentioned..!!!Camera is working fine, it been 2 months i have been using it..No problem till now", "Date": "March 12, 2012"}, {"Title": "A great purchase... For first camera.", "Author": "Joseph", "ReviewID": "R2DZ2IH9ILTEMH", "Overall": "5.0", "Content": "This is the first camera I have ever owned.  I bought it for its price mainly, and its style.  The Canon Powershot A3300 is a great product. The only problem I have had with it is the LCD screen gets scratched very easily, this can be avoided if you buy a screen protector or be very careful with when wiping of residue.  There are many settings on the camera that work are very useful; I keep my on the auto setting. Overall the Canon Powersrhot A3300 is a fantastic buy, I would recomend it to anybody.", "Date": "March 5, 2012"}, {"Title": "Very Nice Cannon A3300", "Author": "Luai F. Alzoubi \"Loai Foad\"", "ReviewID": "RPYME2DKXFZHG", "Overall": "5.0", "Content": "I had bought Cannon A3300 Camera, It's very nice and very powerful camera. I advice to buy this product from cannon.", "Date": "March 2, 2012"}, {"Title": "My new camera", "Author": "Joe Frederick", "ReviewID": "R2NKHB3V4UAVJ9", "Overall": "5.0", "Content": "This was probably the best camera that I have ever purchased.  I am totally pleased with the pictures that were taken on it while on vacation.  This camera is very easy to use even for my tech challenged wife lol.  The pictures were clear and sharp", "Date": "February 19, 2012"}, {"Title": "good camera", "Author": "Dave", "ReviewID": "R1YA79YE5BWZST", "Overall": "4.0", "Content": "I liked this camera and had no problems with it. I took some great pictures on my trip to Hoover Dam. I also like the different shooting modes.", "Date": "February 19, 2012"}, {"Title": "Awesome Camera", "Author": "Mattea", "ReviewID": "RKXYY02RUW3LQ", "Overall": "5.0", "Content": "This camera was everything I asked for and more...the color was perfect... The screen is so nice and big and clear ..it has good zoom...easy to use..good quality of pictures...and it arrived just in time for me to take pictures of my dog that I've had for ten years. My poor dog just passed away suddenly with anemia(I'm very sad) ..anyway thank you Canon for another excellent product!!!!", "Date": "February 16, 2012"}, {"Title": "quality", "Author": "mazouz", "ReviewID": "R1C7W6NF74RHVB", "Overall": "4.0", "Content": "nice camera and good brand plus quality brand and i will be all the time and purchasing from this website", "Date": "February 16, 2012"}, {"Title": "Very good camera !!!", "Author": "Ranga", "ReviewID": "R1YYGP1TRJM8EJ", "Overall": "5.0", "Content": "Very good camera and worth for money.... I like this camera and recommend for people who want to be simple and smart because it is very easy to use !!!", "Date": "February 12, 2012"}, {"Title": "Great gift", "Author": "Cris VM", "ReviewID": "R1ATVRJPAUP3VN", "Overall": "5.0", "Content": "This was a gift for someone who was looking for something very specific in a camera. When looking at all other brands this was the one I chose after much research. The recipient loves it. I am a big fan of Canon!", "Date": "February 7, 2012"}, {"Title": "Canon Powershot A3300 IS", "Author": "SGM97B", "ReviewID": "R3463Z4WDIUKYK", "Overall": "4.0", "Content": "It feels really lightweight and cheap but so far it is very satisfactory. There is often a delay between pushing the shutter release and taking the picture. That is annoying but I'm getting used to it. The picture quality is good and it is simple to use. The battery lasts a long time. I'm happy with it.", "Date": "February 6, 2012"}, {"Title": "Point and shoot", "Author": "Ray Eagle", "ReviewID": "R1UAVMCS2YTFSR", "Overall": "5.0", "Content": "Was looking for a easy point and shoot camera. This camera makes great pictures with no effort at all. A lot better than my last Cannon.", "Date": "February 2, 2012"}, {"Title": "xmas gift", "Author": "tigger", "ReviewID": "R1HSKVELZAU7C2", "Overall": "5.0", "Content": "ARrived promplty, well packaged.  This was an amazon wish list purchase so I am guessing the receiver did all the research on this already and was interested in getting this particular make and model.  He seemed pleased.  I do not know how well it performs.", "Date": "February 1, 2012"}, {"Title": "Good Bang for Your Buck", "Author": "Montrose Harbor", "ReviewID": "R2TEBLJYF0LP22", "Overall": "4.0", "Content": "While this is not the best point and shoot out there, the price is for the MP.  The photo quality is pretty good, but in low light or fast action it is lacking.  It has a good zoom and fairly good stabilizer.  The flash takes a long time to load up and can be too bright.  Overall I would recommend this camera, very good for the price paid.", "Date": "January 18, 2012"}, {"Title": "Just ok", "Author": "innkeeperfred", "ReviewID": "R1872RPP2OVY46", "Overall": "3.0", "Content": "We have had Canons in the past and have been pleased with them. This one although when it works takes very sharp pictures on Auto it sometimes does not flash when it should and flashes sometimes when it does't need to. Also takes very long to shoot at times up to 6 or 7 seconds while it goes through it's face recognition etc... My wife likes our old one better even though the screen no longer works...", "Date": "January 13, 2012"}, {"Title": "Solid Performance", "Author": "DG", "ReviewID": "R33HPDLLPPSB8L", "Overall": "4.0", "Content": "Have had the chance to use this camera for a month and have been impressed by the improvements in Canon's controls, stability and zoom functions.  For a camera this inexpensive it accomplishes most every shot that I need.  My only complaints about speed and image clarity are issues common to lower cost camera.  Not big enough issues to prevent me from using this camera and enjoying on most trips.  This camera is a great value.", "Date": "January 11, 2012"}, {"Title": "Perfect for the price.", "Author": "utahphil", "ReviewID": "R12B3K4XG1IUW8", "Overall": "5.0", "Content": "I gave up looking for a small super zoom camera that would be a good replacement for my beloved Canon T1i SLR.  I tried the Panasonic DMC-ZS9, the Canon HX230HS, and the Fuji 505EXR.  None came close to my SLR and I felt the price of around $200 for those cameras at the time were a bit of let down.I have now been using this little guy for about a month or so.  It takes pictures a little bit slow but the images are pretty good.  Now they are not SLR quality but at $100 I could not be happier.  Very small camera.  The 5x zoom is generally adequate for my uses (taking to parties, dinners, etc. to just get some good friend snapshots).  I have not used the video mode much (it only has digital zoom in video and I am not sure why).  However, the digital zoom (which I generally dread to use) gives you a decent additional distance on the telephoto end when taking photos.Since I use the camera mainly for friends/family at night time events, the flash photography was essential.  So far, so good.  Everyone was enjoyed the results which are not overexposed.Great little camera when you just don't want to cart around a kit with enough zoom to give you some flexibility to reach out and grab your friends.  Aftermarket batteries are readily available and work great.  Got two replacement batteries for about $5.  At this price point, I doubt you will feel the need to keep looking.", "Date": "January 8, 2012"}, {"Title": "Can't beat the photos for the price!", "Author": "C. Kimhan \"Pork Chop's Mom\"", "ReviewID": "R62CP8K2L31YL", "Overall": "5.0", "Content": "I had bought another point and shoot and was very disappointed and returned it.  (Amazon took it right back) so I thought I would try this one based on the other reviews.  I took 100 snap shots this morning of my dogs and pigs.  At least 90 of the 100 pictures came out clear!  Even the ones I took in the dark!  This camera was on special for $99 at Christmas time but was on backorder.  I decided to wait for the price and it was a good wait!  I am totally happy with the camera, it's light, it has a big screen area, and awesome photos!", "Date": "January 4, 2012"}, {"Title": "100% satisfied", "Author": "Johnny B", "ReviewID": "R2S4UP9KDG1RH", "Overall": "5.0", "Content": "Anything human-made has limitations.  Understanding how the trade-offs work is key to satisfaction with your purchase. The larger the resolution you use, the longer it will take the camera to write the image to disk and be ready to take the next photo.  The slower your SD card is (class 4, 6 , 8 or 10)the longer this process will take.  The weaker your battery is, the longer this process will take.  If you buy a Porche which will do 180 miles per hour, you don't drive it at 180 miles per hour every day.  It is the same thing with a camera; it will shoot a 16 MP photo but this is its absolute limit.  Don't expect to shoot all 16 MP photos and have the camera ready at a nanosecond's notice or that the entire photo will be crystal clear.", "Date": "January 3, 2012"}, {"Title": "Fantastic!", "Author": "khope89", "ReviewID": "R1H5XKHB3LGA8R", "Overall": "5.0", "Content": "To be completly honest, I was iffy about the camera at first. The dial for the settings looked cheaply made and the picture appeared blurry. After about a week of using it and getting used to it I LOVE IT! I am very happy about my purchase and satisfied with the camera! Would reccomend to anyone! :)", "Date": "December 30, 2011"}, {"Title": "Great Camera", "Author": "chad", "ReviewID": "R1X7S6MYOO6WIT", "Overall": "5.0", "Content": "I love the camera.  It came pretty quickly and it works great.  So far it has taken great pictures.  I haven't had a lot of time to play with the extra features, but I really like it so far.", "Date": "December 29, 2011"}, {"Title": "Canon A3300", "Author": "Angela M. Hernandez", "ReviewID": "R3RQS98M6Q1R52", "Overall": "5.0", "Content": "Great camera @ a great price. Takes beautiful point and shoot pictures and has a variety of features and settings.", "Date": "December 27, 2011"}, {"Title": "not bad!", "Author": "May Cruz", "ReviewID": "R15V2OL1D7KRED", "Overall": "4.0", "Content": "I got this came a as an early Christmas present and am pretty happy. It took me a bit to adjust it according to the lighting but once I had it this thing took some really great pics. It takes really great daylight pictures and I love the different effects. I do get lots of blurry pictures, not sure if its me or the wrong settings. Its small and fits great in my hand and pocket. Hopefully I can get a good case for this since I have a tendency to drop and break my cameras.I've always wanted a dslr but can't afford and hopefully with some practice I can take beautiful pics with this little pink baby!", "Date": "December 26, 2011"}, {"Title": "Great!!!!", "Author": "Max \"Pat J.\"", "ReviewID": "R12T6NI608V0RX", "Overall": "5.0", "Content": "Exactly the item my daughter wanted.  Takes great photos.  Handy to use and carry.  Item was sent fast.  Would recommend.  Thanks.", "Date": "December 26, 2011"}, {"Title": "Good product.", "Author": "Pam", "ReviewID": "RZI5XM1S2R0J", "Overall": "4.0", "Content": "Light weight, thin built, easy to carry in my pocket. Only wish the Zoom button would be easier to operate. Over all, Canon is a trusted brand.", "Date": "December 26, 2011"}, {"Title": "Prasenjit", "Author": "Prasenjit Ghosh", "ReviewID": "R2QKCLRBXZISAM", "Overall": "4.0", "Content": "decent purchase..look wise not that great but take good snaps.also, video recording comes a bit blurry.It can be recommended with this price..", "Date": "December 24, 2011"}, {"Title": "great little camera", "Author": "A. Vernon", "ReviewID": "R18K53JMNP22SA", "Overall": "5.0", "Content": "I have only begun to use this camera, but it appears to be a real bargain. Great features at a bargain price. 5X zoom and 16MP, more than I'll need. I'll give it areal workout at Thanksgiving.Amazon's price and shipping care are the best there is.", "Date": "November 21, 2011"}, {"Title": "Great Camera!", "Author": "Lesli Hinshaw \"I LOVE reading.  I also drive ...", "ReviewID": "RGMGWC2XFGNCM", "Overall": "5.0", "Content": "I've had the camera about 2 weeks.  I'm an amateur just wanting better photos of family and family events.  Every single photo I've taken so far has been great.  Pictures are crisp, clear and look great whether taken at night or day.  This camera is great and I would recommend it to a friend.", "Date": "September 5, 2011"}, {"Title": "canon powershot a3300", "Author": "Sally Bridgham", "ReviewID": "R3R3PF3XBQUSE5", "Overall": "5.0", "Content": "This item was shipped in a timely manner.  So far I have been very pleased.  It is easy to use and the picture quality is excellent for such a small, inexpensive camera.", "Date": "September 2, 2011"}, {"Title": "Great for a beginner", "Author": "Mark Midura", "ReviewID": "R2TSS0NM93YRCH", "Overall": "4.0", "Content": "I'm new to cameras and bought this based off of past experiences with Canon and reviews. So far I like it a lot. The picture quality is what I expected for the price, the time in between pictures is a bit long sometimes (2 seconds roughly) and it's not great at motion shots. It does take some beautiful pictures though and I think anyone would be happy for the price.", "Date": "August 20, 2011"}, {"Title": "Best for its price", "Author": "Pav", "ReviewID": "R32FZA99AHQB7F", "Overall": "5.0", "Content": "All the cameras that I bought in the past had serious problem of taking pictures in the night. This is relatively better and cheap. It is easy to use and definitely worth the money.", "Date": "August 6, 2011"}, {"Title": "camera for work", "Author": "456par", "ReviewID": "RDZR38JKZ49KD", "Overall": "4.0", "Content": "I bought this for the price for where I work.  We needed to upgrade.  Very easy to use.  But still not see the stability feature for this.  Great camera for the price with the amount of Pixels.", "Date": "August 1, 2011"}, {"Title": "Nice, but dissapointed", "Author": "David", "ReviewID": "R2IE6AL764SYS0", "Overall": "3.0", "Content": "So I got this camera with good expectations. I previously was using an ooold sony cybershot, so I needed to change and upgrade. I read a bunch of reviews and decided this, plus I know Canon is a good brand. But, I'm slightly disspointed with the product. The images are very sharp, it has a dullness about the pictures - my old cybershot actuall looks better in some cases. The colours are fairly good. The various scene options are a nice-to-have. The night shots aren't bad, but still not great. Don't get me wrong, I'm not expecting a $500/$1000 quality photos, but like I said, my ancient cybershot pics actually look better than some of these (bright sunlight pics even). So for that reason I'm dissapointed.", "Date": "July 28, 2011"}, {"Title": "Camera Powershot A3300", "Author": "Visa \"Marz\"", "ReviewID": "R2SHO7TN7EVR2N", "Overall": "4.0", "Content": "I found the camera easy to use and a nice size.It has a nice range from wide to zoom.I thought the sale price was reasonable.For my picture taking, it serves all my needs.MarZ", "Date": "July 10, 2011"}, {"Title": "Very good camera", "Author": "Phan Anh", "ReviewID": "R7CLAI76KDH1P", "Overall": "5.0", "Content": "- It is light, beautiful and easy to use. The quality of picture is good. When I choose Auto mode, the average quality of picture is approximately 5 MB, it is awsome. The black color makes  it stronger. I love this camera. I strongly recommed everyone to buy this camera.But it cannot take photos at night. The taken picture at night is terrible.", "Date": "July 6, 2011"}, {"Title": "Great camera!", "Author": "Melissa L. Lockhart \"mel baby\"", "ReviewID": "RLZZQQL5JJMDV", "Overall": "4.0", "Content": "I am not a great photographer, so I need a camera that makes it easy for me.  This camera does that.  I had an older digital camera that was old and had certainly served its purpose.  I searched and read reviews and asked friends and finally decided on this camera.  I was not dissapointed.  I took it on our family trip to Disney World and it was perfect!  I bought the case to hold it in and it hang on my purse.  It was light and easy to carry around, and took GREAT pictures.  It adjusts itself so there are no blurry pictures!  I love this feature, because that used to be my specialty.  I have been very satisfied with this camera.", "Date": "June 22, 2011"}, {"Title": "Nice camera for the price", "Author": "J. Scott Williams", "ReviewID": "R2IE2WQPU5CYJG", "Overall": "4.0", "Content": "I haven't used this camera to much so far.  I purchased it to replace another Canon I have had for many years before it finally died.  This one seems a little more cheaply made but takes excellent pictures.  Time will tell how durable it actually ends up being.  The features seem excellent and easy to work through.", "Date": "June 21, 2011"}, {"Title": "Canon Powershot A3300", "Author": "camerabuff", "ReviewID": "R2HDGJFPSM9CNL", "Overall": "5.0", "Content": "It is a good little camera to carry around when I don't want to use my Canon DSLR. The quality of the pictures are as good as my DSLR. It was a good buy for the money.", "Date": "June 20, 2011"}, {"Title": "love it", "Author": "Nanner", "ReviewID": "R25LX7L0UTL026", "Overall": "4.0", "Content": "We had to get another camera after our 3 year old stomped on ours.  This is our thi Canon camera and second Powershot.  We love it and find it easy to use - pretty much the same as our old powershot.", "Date": "June 17, 2011"}, {"Title": "Very nice little camera", "Author": "Laura", "ReviewID": "R1R0YXT4IX8QMY", "Overall": "5.0", "Content": "I purchased this camera last weekend from a local store. No complaints so far about the quality!  I have played around with the features all week and am impressed with them all.  It takes clear, concise pictures, even when using the zoom.  The steady shot feature makes taking good pictures a breeze! I would recommend this camera to anyone who wants big quality in a economical little camera!", "Date": "May 15, 2011"}, {"Title": "Love this Camera", "Author": "Shenanigans", "ReviewID": "R16IWDULECT1QR", "Overall": "5.0", "Content": "Great for anyone who likes to take good pictures, but doesn't want to have to take out a second mortgage to afford their camera. I was really excited to get this camera delivered. I ordered it through Amazon, received it just a few days after ordering, and it was in great condition. Love the blue color. I was trying to decided between this camera and the Nikon Coolpix S4100, approx the same price. Basically, this won me over with the lens options and creative filters. At first it seemed like a lot of confusion, but after reading the manual and playing with the camera for a little while, I figured everything out. My favorite features are the motion tracking, face detection, and the different lens options. It also has a custom timer (so if you don't like 2 sec or 10 sec, or if you want it to take more than 1 shot, you can adjust it). It's compact, responds quickly, and takes great pictures. The only thing I would change is the zoom, wish it was a little more.", "Date": "April 5, 2011"}, {"Title": "Canon no longer has good cameras", "Author": "A. Balasa", "ReviewID": "RQCK5SMH6R6LR", "Overall": "1.0", "Content": "I had a number of cameras during the last 6 or 7 years, all Canon. All had good image quality, some were more forgiving in low light, some not. My last one ( 890is ) died after 2 1/2 years and when I compare the images taken with it with the ones taken with Canon PowerShot A3300 IS 16.0 MP I can only say I am considering buying a used 890is. I have tested two Canon A3300: the first came probably damaged, it took pictures that were \"fractured\" - half good and half discolored and a couple of pixels off. The replacement came after three days and works, but the colours are unnatural, especially with flash on or auto in low light, and the images fuzzy and pixellated. For example, an image of the Christmas tree taken from 5 ft away shows fuzzy branches with the new camera, crystal clear needles on branches with the old 890is ( same tree, same light, same room, same year ). I need a point and shoot camera, not a SLR replacement, so I tested it only in full auto mode and I have no intention of fiddling with settings; that is why I need a point and shoot device. The conclusion is: DOES NOT WORK. Sorry Canon, you lost it. By the way, I have seen people complaining about cameras made in China; mine were made in Malaysia and the quality was still abysmal.During all this, the Amazon return policy is flawless, to say the least, but if I were them, I would no longer stock these things that do not work.", "Date": "January 17, 2012"}, {"Title": "Not a camera for baby/toddler pictures NOT for spontaneous shots either!", "Author": "L.W.", "ReviewID": "R22ZMEE8I0DPRI", "Overall": "1.0", "Content": "I have only had this camera 4 days but am quick to find this camera is not fast enough to catch those spontaneous moments on film.(It's actually slower than my last camera) It also has a bright red light that shines while it's getting into focus. It's extremely bright and when I try to catch a special moment from my 20 month old son, he quickly moves and turns as the red light shines into his eyes. I turned the camera on myself to see how bright this was and it is so bright that after I turned away from it, my vision was affected like someone just snapped a bright flash in my eyes! Horrible for a child (or anyone)!!!! I now cover up that light with my finger when taking pictures of him.There is no manual on how to use the camera. There is a disk however which is the 'manual', but it is inconvenient as you then don't have the quick access to instructions you need when trying to take a picture or when away from a computer to put the disk in. That's a pain. Lastly, I ordered this as super saver shipping and it took 2 weeks to get it. The only positive, the picture clarity is great! I wish I would've ordered a Fuji like my last camera- I loved everything about it but had to replace as it was stolen.UPDATE...4 MONTHS LATER AFTER THE PURCHASE: This camera is horrible! It takes forever when it's self adjusting the auto focus and actually take a picture. So frustrating as I have missed so many spontaneous shots of my toddler. I wish I never would have bought this. Going back to Fuji!ANOTHER UPDATE...9 months later already needs a new battery!!!!", "Date": "January 19, 2012"}, {"Title": "No telephone camera for me!", "Author": "deltapearl21972", "ReviewID": "RX21D5BVWZE0Y", "Overall": "5.0", "Content": "I love, love, love, love, my new camera.  It's so light!  It does not add weight to my purse and I can carry it ever where without feeling like I'm carrying a bowling ball with me.  I love everything about it.  The battery is small, compact, light, and inexpensive.  I love, love, love it!", "Date": "October 9, 2011"}, {"Title": "Only lasted 6 months before breaking", "Author": "JohnL", "ReviewID": "R1Z7447LQS8MZD", "Overall": "1.0", "Content": "Well here's a camera that doesn't last long. Only six months and the lens broke. Good for close up shots only, and even then, most of my pictures turned out blurry. Never again, I'm going back to Nikon.", "Date": "August 7, 2012"}, {"Title": "Disappointed", "Author": "R. timms", "ReviewID": "R2MYZKEF70REK5", "Overall": "2.0", "Content": "Cannon dropped the Ball on this oneVideo Sound garbled at timesMy SD750 is a better CameraMay be more mega pixels , but quality of photo very lacking in auto modeI returned it for refund", "Date": "December 27, 2011"}, {"Title": "Very Slow camera", "Author": "Kenneth", "ReviewID": "R3AKF8CJIMH9T7", "Overall": "2.0", "Content": "This camera is OK for regular users, but I have to say that is very slow on shooting... I never seem a Canon camera as slow as this one, it's impossible to get a good shoot on the first try... but if you are OK with it go ahead, it's a good price for regular camera.", "Date": "August 8, 2011"}, {"Title": "CUTE AS A BUTTON!!!", "Author": "AVISB \"AVIS\"", "ReviewID": "R1G43BKJ5QJQG7", "Overall": "5.0", "Content": "I love my little red camera. I needed a new camera and wanted a smaller one. The color was part of my decision and CANON is a great brand. It has been a good camera and works well.", "Date": "August 21, 2013"}, {"Title": "Canon Powershot A3300", "Author": "iSh3rlock", "ReviewID": "R24MLLM6NGKHE3", "Overall": "5.0", "Content": "really nice looking camera. bought for a friend of mine. and she's really happy. don't know what to say anymore. this is a gift :)", "Date": "March 18, 2012"}, {"Title": "Excellent Customer Service!", "Author": "internetshopper72", "ReviewID": "R2C9H7UAUT0A5U", "Overall": "5.0", "Content": "I have had this camera for 2 months and love it.  It is easy use and easy to load pictures on my computer.  Takes great pictures too!Update: After 6 months I started having frequent \"Lens Errors\" with the camera.  It would just shut down.  I was frustrated because the camera had only had light use.  I contacted Canon.  I spoke with a helpful woman in their Virgina call center.  I loved speaking to someone in the US!  She gave me the info to mail the camera back to them as it was still under the 1 year warranty.  She said they would either fix it or send me a new camera.  Less than 2 weeks later I received a new (refurbished) camera in the mail and it works great.  Couldn't be happier with Canon's customer service!  I will only buy Canon when I'm ready to purchase another camera.", "Date": "January 6, 2012"}, {"Title": "cute, small, but must remove battery to charge it", "Author": "freelancer and mom", "ReviewID": "R3PJ2CUQTY32PG", "Overall": "4.0", "Content": "I bought this point-and-shoot as an alternative between my bulky SLR and my phone's camera. I like the size, I love the fact that it comes in colors, I dig the sound effect options, and I've been pleased with the photo quality. I don't usually take lots of video so I can't speak to that.The quirky thing about this camera is the battery. You must remove the battery and plug it into the charger. I accepted this technique with my SLR, but I've never owned a point-and-shoot with this requirement. The manual had lots of instructions about charging the battery right before it will be used, depleting the battery between charges, and not leaving the battery plugged in for too long. (Apparently the battery will start to bulge). I'm a little concerned that it will be hard to manage the charge if I use the camera spontaneously or take it on a trip. On the bright side, it's not necessary to drag along a laptop just to charge the battery.ADDITION: Now that I've had the camera for a few months, I just love how portable it is. I especially love that when I use my Canon Pixma printer with this camera, I have the option to crop the photos from the camera before I print them. I've been very pleased with the overall quality of the photos and the zoom feature is better than I expected. I also ordered a second battery, so I can swap out the depleted one as needed. The battery recharges quickly.", "Date": "April 13, 2011"}, {"Title": "Camera blows", "Author": "Arsenalfan17", "ReviewID": "R2Y09A1E14WYS6", "Overall": "1.0", "Content": "I bought this camera for my girlfriend's birthday and thought I was getting a great deal and a good camera. But upon opening it the camera would turn off when you powered it up so I got another one and the lens on that new one didn't work and it didn't even turn on!! Short story they suck.", "Date": "June 16, 2012"}, {"Title": "This camera is awful.  Poor quality photos and videos.", "Author": "T. O Rice \"timr688\"", "ReviewID": "R2ATSL82K7W2H1", "Overall": "2.0", "Content": "I am pretty pissed.  I've had this thing for two months and haven't taken a good picture yet.  Every picture is grainy.  I thought it was me so I read the manual.  The pictures are still grainy.  Videos are no better.  I've taken several videos and none of them were any good.  The object is always out of focus and the quality is just not up to par.  Every lost photo and video is an opportunity lost forever.  I'm tired of it and plan to sell this camera on Craiglist.I used to have an A2000 and it was effortless.  Every picture was a masterpiece.  I didn't have to do anything special, it was just that easy.  Too bad the camera had a faulty battery life detector.  I bought two of them and they both had the same problem.  Eventually they wouldn't turn on even with brand new batteries.  I am done with Canon.Update 09-11-01:  Another month of tinkering has gone by and I've learned to take somewhat better photos, but the quality is still well below other point-and-shoots I've owned.  In fact, it takes worse pictures than my cell phone. The video is just dreadful.  There's no other way to put it.  The camera has a real focus problem in video mode and anything farther than one foot from the lens is out of focus even though it looks crystal clear on the LCD.  Canon claims the A3300IS takes 1080p HD.  That's laughable.  The video is useless.  A whole summer of photos and videos wasted.  I'm through with this camera and Canon.  I sold it for $100 and used that money to go towards a Nikon D3100.", "Date": "August 20, 2011"}, {"Title": "No manual focus. Far too tiny.", "Author": "heavymetalman", "ReviewID": "R2S1AJXN23MXBL", "Overall": "2.0", "Content": "Yeah, the pictures look great but you shouldn't have to try and try and try over and over and over again to get it to focus on what you want. This is REALLY frustrating. I don't like products which don't work easily. Why couldn't they simply make it manual focus? I can do it myself in about 1 second.And, What's with this teeny-tiny stuff? WHY? For what frigging reason did they try to make it so teeny so that you can't even hold it without accidently pressing one of the many teeny buttons? What the heck is with that?I only give it 2 stars. Canon is out of touch with people and has no idea of what people want in a camera.", "Date": "June 1, 2012"}, {"Title": "Good price, bad experience.", "Author": "Hugo", "ReviewID": "R4NWED8OU6U2H", "Overall": "3.0", "Content": "If you like the stylish Canon Camera, I would suggest not to spend your money on this beautiful and fancy product. What I mean by this is that the Camera itself is fantastic until the Lenses \"error\" come across.It was very functional to me for 3 days when I was on vacation and the least you expect is your camera to fail while having such an adventure.It might have been just mine but keep it in mind, the camera is not perfect.I'd like to thank Amazon.com for such a great online buying experience. They solved my issue right away. As soon as I returned it, my refund came too.Looking forward to buying a new Canon Powershot. No doubt about it but this time i'll be careful when selecting it.", "Date": "February 23, 2012"}, {"Title": "Canon Powershot", "Author": "SumankPanchal", "ReviewID": "R3QPRKRE9O8QCJ", "Overall": "5.0", "Content": "Its a very good product and very usefull procudt for me.I am always looking for this kind of new product which is usefull in day by day use.", "Date": "July 10, 2011"}, {"Title": "Horrible Indoor Pictures!", "Author": "JayceeBelle", "ReviewID": "R23IH4SIRBXCHF", "Overall": "1.0", "Content": "I was so excited to get a Canon camera. I've heard nothing but good things about the brand. After much research, I decided to get this model. I did not like it at all. The pictures all came out grainy and absolutely horrible. When fully zoomed in, the pictures are barely recognizable. I cannot say much else about this camera's features and specs because after about the 20th awful picture using all of the different modes, I simply put it back in the box and returned it. As for the body of the camera, it feels really cheap; even toy-like. The buttons are very flimsy and very loose. No bueno!Instead, I got the Panasonic Lumix DMC-ZS8 and it's AMAZING!", "Date": "May 10, 2011"}, {"Title": "Not as advertised.", "Author": "TheShadow", "ReviewID": "RE2XPTSSC2NY0", "Overall": "1.0", "Content": "I bought this camera as a replacement for a Kodak 10mp camera thinking 16mp would be that much sharper.  Boy was I ever wrong.  I tried every possible setting trying to get a sharp clear photo even half as good as my cheap WalMart Kodak.  But all I get is VERY grainy photos that will not enlarge at all.  I contacted Canon and they said I should be getting clear sharp photos and would I please send the camera to them to check it out.  In about two weeks I received a brand new unopen replacement.  Nothing has changed. All photos are very grainy and I am stuck with a piece of junk.  This is not my first digital nor is it my first digital Canon.  My first Canon was a 6mp which made FAR superior photos than this one.  These little cameras are suppose to be point-and-shoot and it shouldn't take a professional photographer to use them.", "Date": "May 30, 2011"}, {"Title": "buena camara", "Author": "eduardo", "ReviewID": "R3MDXVASO83EBO", "Overall": "5.0", "Content": "excelnte camara funciona muy bien hubo un pequeño invonveniente con la entrega per todo fue resuelto, era para un regalo y mi hermana quedo muy contenta", "Date": "October 17, 2011"}, {"Title": "DO NOT BUY! This is a terrible product from a good company.", "Author": "M.C.S. \"M.C.S.\"", "ReviewID": "R3QQXZA7P20FN1", "Overall": "1.0", "Content": "The only reason I gave this one star in the review is because I could not give it a negative rating by Amazon standards.DO NOT PURCHASE the Canon Powershot A3300 IS, 16 MP Digital Camera with 5X Optical Zoom!I cannot stress enough how displeased I am with the quality of images produced with this cheaply made point and shoot camera. I thought that being a Canon camera (I have a Canon t3i which is an exemplary camera, among other cameras made by Nikon, including an SLR, a DSLR and several point and shoot models), it would undoubtedly stand up to its manufacturer's name. But it does not.Not only does the camera take an exceedingly long time to focus, but it also seems to contain a light inhibitor (go figure) of some kind because it shoots well only in extremely bright sunlight. However, try using it indoors, and you will fail to achieve even reasonable images. EVERYTHING turns out blurry which leads me to believe there is a defect in the lens that does not allow sufficient light to enter through it. For comparison purposes, let me say that I had a Sony Cybershot that I purchased well over a decade ago, and while it has far less MP to its name (maybe 3 or 4 MP) it produces substantially better results than the newer Canon Powershot.To say that I am truly disappointed is to voice my concern in mild terms. I am only too sorry that I gave these cameras to my kids for Christmas (age range: 10-15 years of age). They were the ones who alerted me to how useless these things were. I honestly expected far more Canon.Save your money and go elsewhere. I am now very reluctant in getting anymore point and shoot cameras from Canon.DO NOT PURCHASE this product.", "Date": "May 9, 2012"}, {"Title": "Too Fragil!", "Author": "Magnus", "ReviewID": "RF0QLN7EQC6VO", "Overall": "2.0", "Content": "This ultra compact is too small and fragil.  I never got to take a single picture. The first time I tried to use it, it slipped out of my hands and fell lens down on the table breaking the lens mechanism and iris.  Also, the buttons are hard to use with my big fingers.I will now be purchasing a full sized camera.", "Date": "July 1, 2011"}, {"Title": "satisfied", "Author": "claire", "ReviewID": "RE11EQN1P7C3W", "Overall": "4.0", "Content": "i choose the pink one for myself. When i got the camera, the color is somewhat little darker than the picture. However, I like it although i prefer the light pink.", "Date": "December 1, 2011"}, {"Title": "Ponderous to use and poor pictures", "Author": "andrew steere", "ReviewID": "R1YNOH8UD3LF5S", "Overall": "1.0", "Content": "This camera was a complete disappointment. The functions are in no way intuitive so I found myself pushing button after button without achieving the response I was seeking. (To be fair, I didn't read the manual. Should I have to read the manual to figure out how to see the photo I just shot? I was hoping not.)I tried loading the software multiple times and STILL can't get the darned photos from the memory card to my computer. The process consistently fails after it looks as though the pictures have been successfully retrieved.And most significantly, the pictures are plagued by odd lighting. There seems to be a shadow in the upper left corner of 20% of the photos regardless of atmospheric lighting and/or whether I use the flash or not.If you're looking at this camera, I'd sort the reviews by lowest first, and beware of what seems to be an issue for more than one user. Then buy something else.", "Date": "June 6, 2011"}, {"Title": "A cheater", "Author": "Terry", "ReviewID": "R2Q3DCCARWYZCK", "Overall": "1.0", "Content": "I placed an order to them and waited for almost one month. Meanwhile, I also tried to contact them but got no reply. It seems they do not exist or maybe they just want to have our money. Cheater!!!!", "Date": "March 30, 2012"}, {"Title": "Canon Powershot A3000", "Author": "Vivian", "ReviewID": "RKX8UCIQRYG0U", "Overall": "3.0", "Content": "I am not sure if this camera is the orginal from Canon company or not, but its weight really light and fragile compare to the other Canon's, make me feel like it's a fake one. The qualify is not that good as I saw in the review. Well, next time I rather buy any electronic items from the stores where I can see and test them. Even though, Amazon has a good customer service, and I could return it, but I didn't want to because it's not a convenience.", "Date": "November 8, 2011"}, {"Title": "Returned", "Author": "Nori", "ReviewID": "R1NIEHPEBBNXRL", "Overall": "4.0", "Content": "Originally bought it because it was a 16MP nicely compacted Canon that stated \"The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject \"pop.\"Sounds amazing for $179...Received and it was pretty much a regular nice digital Canon camera with high MP. It doesn't do the amazing background blurring effect and since that was why i bought it, i decided to return it.But the 16MP is nice & the camera lcd is 3.O...takes nice big pictures..I actually like my smartphones camera better & editing apps better.***UPDATE: Moved from 3 starts to 4. The comments below are right, this product is better than what I previously wrote. I was just expecting greatness, but for less than $200 you can't beat this camera.", "Date": "April 5, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.0 effective megapixels, 1/2.3-inch CCD image sensor; 5x wide angle optical zoom and 4x digital zoom\n3.0 in. TFT LCD display with wide angle viewing; Built-in flash; 720p HD video recording\nOptical Image Stabilizer; DIGIC 4 Image Processor; Discreet Mode; Creative Filters\nSmart AUTO (32 scenes); Face Detection; Red-eye correction\nUSB 2.0 Hi-Speed; SD card slot (card not included)\n16.0 megapixels, with a 5x wide-angle optical zoom (28mm wide) with optical image stabilizer\nRecord movies with 720p HD video\nLarge, clear 3.0-inch LCD\nSmart Auto intelligently selects settings from 32 predefined shooting situations\nDiscreet Mode disables the sound, flash and AF beam for use in quiet areas", "Name": "Canon Powershot A3300 16 MP Digital Camera with 5x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41dIuL6c9HL._SY300_.jpg", "ProductID": "B004HW73OS"}}