{"Reviews": [{"Title": "good for a $100 camera", "Author": "D. FRENETTE \"Dan\"", "ReviewID": "R3N5AGDIBGJ0WJ", "Overall": "4.0", "Content": "I picked this camera up at Costco for $100. It included a 4 gig card and a decent little case. This is the smallest camera I could find, if you are looking for a decent little point and shoot this camera fills the bill (do not pay more than $100 though). It has a Lith-ion battery and a good easy to use charger- you should be able to get a couple of hundred pics and some video out of each charge. The vid is pretty bad but usable- this is definitely not a substitute for a camcorder, but it is handy if something is happening and you want a quick vid (like a dog catching a frisbee). If you want a very very small camera to put in your pocket for candid shots this is your best bet (its small size is its best quality). Do not let the 16 megapixels fool you, the image quality is much lower than many cameras with far fewer megapixels, but it is just not that kind of camera, if awesome image quality is your concern buy a Nikon D90- if you want a tiny tiny camera to throw in your pocket for $100 get this. Basically image quality= not super but ok, battery and charger= excellent, size= simply the smallest available, video= pretty bad, but usable, price= if you get it for $100 it is a great deal, pass on it for more than $100.", "Date": "June 15, 2011"}, {"Title": "EXTREMELY POOR CAMERA DO NOT BUY!!", "Author": "lydia_gosling", "ReviewID": "R1XSM2ENC8ASD7", "Overall": "1.0", "Content": "I was so excited when I received this camera for Xmas after losing my Samsung on a night out and I have been nothing but disappointed with it! I expected some fab Xmas and NY photos and all I have got is a blurry mess! There are lots of different setting options, none of which are good. You either get really blurry, really red, a focussed person but a horrid blurry background! There is no 'auto' which adapts to any situation, you have to faff about trialling and erroring in every different situation you're in! The best option seems to be one where you have to push the shutter half-way down first to focus and then push it the whole way down to take the photo...imagine asking someone to do this whilst taking a photo of you on holiday or in a noisy nightclub?! I am sick of trying to find different settings for this camera and am very disappointed I have no xmas/NY memories, just a blurry mess!! I am taking it back tomorrow and going to swap it for the basic Samsung I had which took fab photos all on 1 setting!!Fujifilm FinePix JX 400 camera black", "Date": "January 11, 2012"}, {"Title": "Instant garbage", "Author": "Seattle Hiker", "ReviewID": "R2UWMHJM24GH7R", "Overall": "1.0", "Content": "I purchased this camera during a recent trip on Maui as I wanted something that could carry along during trips, filling in when my big SLR was a little bulky to use. I have owned many different point and shoots and SLRs, digital and not, and this camera is by far the most disappointing camera that I owned. Needless to say I returned it.The good:- it's a small camera- daylight video is 'OK' quality- It makes decent pictures of sunsets- Two user selectable presets that allow you to select common scenarios (portrait, panorama for example)The bad:- Pictures come all out fuzzy looking / washed out <<== unacceptable! (I suspect light leaking into low quality lens causing contrast issues)- White balance on video indoors is horrible with no options to adjust- The panorama feature is cool at first look but results are often disappointing with bad stitches- VERY BAD: the lens casts a shadow on flash images, causing a shadow in the right bottom corner. COME ON camera designers. This is bluntly stupid!I had a few shots that kind of looked OK, but I did not even care to further inspect any of the images I downloaded to my computer. Very disappointing.I expected this to be a better camera than my wife's Panasonic DMC-FX01P, which is 5+ years old by now, but the Panasonic is much, much better.Stay away from this camera.", "Date": "September 5, 2011"}, {"Title": "Do NOT buy this camera", "Author": "Nichole Dumas \"DaniVandal\"", "ReviewID": "RBF3R279LQOOU", "Overall": "1.0", "Content": "I was so excited to get this camera as a gift. My old one had stopped focusing when you used the flash, and since I've just had a baby, I wanted tons of photos. This camera was awful! The pictures were okay, except for the fact that due to a horrid design flaw, there's a shadow in the bottom right corner of every photo, unless you zoom in (thus making the lens shorter). It's all because of where the flash is in relation to the length of the lens.Years ago I had a small fuji that was fantastic, so I was really looking forward to this one. I took it back less than 12 hours after getting it because it was so awful.I recommend the Nikon CoolPix S4100. That's what I got to replace this peice of junk and I've been THRILLED.", "Date": "October 4, 2011"}, {"Title": "Tiny camera for tiny fingers", "Author": "M. Ziegler", "ReviewID": "R3QMDZMXPPJT9T", "Overall": "3.0", "Content": "Takes decent photos outside, low light or indoors with flash it's not as good.Like: The size, and light weight. Compact charger.Dislikes: Power button is really hard to work because it's flush with camera and right next to shutter release and zoom controls.The battery is really small and is held in place by a release lever inside camera. I like the orange stripe on the battery that matches the color of the release lever, but I would prefer a push lock, push release system for the battery like the sd memory card (which shares the same compartment) The battery must be removed to charge in the included charger. The wall charger does not have the orange color key to indicate which way the battery is inserted, although the battery will only go in one way. (You may have to try all four possibilities to accomplish this LOL).It's a decent camera for the price, but I would consider the Panasonic Lumix DMC-FP3 because I have had great results from the prior three Lumix cameras that I have owned.", "Date": "August 17, 2011"}, {"Title": "Good buy", "Author": "Christopher E. Muhlbeier \"Bump79\"", "ReviewID": "R3HYORZWBSJOKH", "Overall": "4.0", "Content": "I've had this camera for almost two years now and it has treated me very well and has taken good pictures for the price. I regularly put it threw some abuse fly fishing, hunting & mountain biking in Montana/Alaska and had no issues whatsoever. Good buy.", "Date": "September 2, 2013"}, {"Title": "Good for what you pay", "Author": "Nathan A.", "ReviewID": "RJ3AIO93NMVQM", "Overall": "5.0", "Content": "Good basic camera. Not a lot of bells and whistles, but easy to use. I bought this for $100 and it served me well as a point and shoot.", "Date": "August 23, 2013"}, {"Title": "Do not waste your money!", "Author": "cristenc10", "ReviewID": "R3CROT0AJCY8OU", "Overall": "1.0", "Content": "Bless my husband's sweet heart. I had been using a digital camera with no frills that I had bought for $25 at WalMart 7 yrs ago. It still worked fine, but he wanted to get me something newer and spiffier for my birthday. So he got me this camera. I have to say that my camera from the dinosaur ages produces better-quality pics than the Fujifilm Finepix. This camera really is terrible! I have tried taking pictures on every setting, and over half of my photos come out blurry. You have to push the button down halfway to focus, and then push the rest of the way to take the pic. Even after I do this, the pics are still out of focus. So many potentially great shots have been ruined with this camera. Complete waste of my husband's $100. And don't even think about getting good-quality action shots! This thing produces blurry pics even when I'm holding my hand as still as possible and my subjects are sitting still as statues. Wanna get those great shots of the kids on the trampoline or doing gainers off the diving board? Forget it.", "Date": "November 20, 2011"}, {"Title": "Wouldn't Buy", "Author": "Anonymous", "ReviewID": "R1TGNUK2TJJTQS", "Overall": "2.0", "Content": "This camera at first worked perfectly fine but now its showing a redness on every photo that cannot be removed, charge does not last.", "Date": "February 20, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "16 MP\n5X OPTICAL ZOOM", "Name": "Fujifilm FinePix JX 400 camera black", "ImgURL": "http://ecx.images-amazon.com/images/I/31Nt1Ixk2TL._SY300_.jpg", "ProductID": "B004UBW5GW"}}