{"Reviews": [{"Title": "had this for over a year now and it works great", "Author": "Maleko \"islndsnw\"", "ReviewID": "R3MFYBRYRX1V4M", "Overall": "5.0", "Content": "First thing I did was throw in a cheap 2tb sata hard disk drive.  booted it up,  added the latest firmware and set up everything as stated in the remote monitoring guide and taaaddaaaaa it all works.  The cameras are sort of wide angled meant to be mounted up high someplace I think, but work relatively well.  Night is another story, the few IR bulbs in around the lens is ok, I mean it does what it says but distance is cut considerably, but maybe a better camera for areas that you'll want patrolled at night would be a good option.  But for the price, it comes with 4 cameras,  generous length of cabling.  I added a small Ethernet to wireless AP (access point) device that connects to my Linksys router wirelessly.  The Linksys router supports UPNP so the remote setup was pretty easy, check if your router supports upnp, if not maybe it's a good time to upgrade.  The default port on the QC444 is 80, so don't forget to set it to 85 like the remote monitoring instructions say, or you wont' be able to connect via explorer/firefox/chrome etc...  Overall for the price, great.  I had this installed as someone was stealing my mail.  And to prove I was receiving or not receiving mail.  Well guess what, once I installed it, all my packages started arriving like they did before.  And like others said, the interface looks outdated and simple, but that's all you need, it gets the job done.  I especially like how you can set parts of the screen on any camera for movement and it starts to record when it detects movement in that area.  That way the hard drive doesn't fill up as fast as it only records when it detects.  Wind in the trees caused my Q-See to start recording so it works quite well.  For a small home or business, this 4 camera unit is great.  Oh and the cameras require one outlet, and the Q-see unit requires an outlet.  I saved one power outlet by using an AP that uses usb power off the QSee, but that's it.  Good value.", "Date": "September 15, 2013"}, {"Title": "Works", "Author": "wowsuchprofile", "ReviewID": "RZMJBDMOXHEBK", "Overall": "5.0", "Content": "The interface of the software looks outdated, but it does what it needs to do.  Pretty easy to use once you get the hang of it. Everything works as described, so if you need a DVR fast, this is a fine choice.", "Date": "January 2, 2012"}, {"Title": "It works fine", "Author": "Old Man", "ReviewID": "R2ISYVR83IQM0V", "Overall": "4.0", "Content": "This DVR does what it's made to do and does it well. At first I thought I got a defected item and returned it for another one. When I saw the same problem it was me. The manual had me confused but I went to the site of the maker and it's lot better than the manual. Very helpful and detailed site and it's got me going so I'm happy with the product. It works fine. Now only time will tell.", "Date": "May 31, 2011"}, {"Title": "Clear as a BELL!", "Author": "Detective #1", "ReviewID": "R3J0UAHQD9662C", "Overall": "5.0", "Content": "HEy - was very easy to set up - works great and was a big HIT with the police!YEP, caught the crook - thanks to this GREAT product!!!!", "Date": "July 23, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0046TL2US"}}