{"Reviews": [{"Title": "Brandnew Camera! Best seller! Trustworthy! Nice Price!", "Author": "Kyo1999", "ReviewID": "R3EIFXYGGGCY3Y", "Overall": "5.0", "Content": "I am pleased to be the first person to review this!I Viewed a lot of 60D on Amazon, and Finally chose the extra Value kit here!When I recieve the package,the 8 pounds box impressed me.Everything is arranged very reasonable and well located in box.1, Camera and 18-200 mm lens are put in the canon offical kit box, with cables, Battery,belt, instruction manuals....2, Camera Bag is so good, with a lot of small pockets with it.3, the TWO 4GB (class 6) comes with the brand of SCAN-DISK....what else I could say! haha4, One important is that these stuff are well protected with a lot of airbags in the box.5, THE PRICE is unbeatable! the only price close to it is from Canon itself on amazon, However, they will take 1-3 months to ship! I just cant wait at that time. SO That was one reason why I changed my purchase to Adorama!!! Btw, even their price only includes the Body and Lens, no other else! Thus, the same lowest price here, you will get more!!!6, ALL things in the package are totally brandnew. Nothing is refurbished.7, The second reason why I bought it here is that one of my friend who works in this area told me Adorama is nationwide company for decades.8, Very nice purchase experience, Trushworthy Seller.", "Date": "June 21, 2012"}], "ProductInfo": {"Price": "$1,099.00", "Features": "18.0 Megapixel CMOS sensor and DIGIC 4 Imaging Processor for high image quality and speed.\nISO 100 - 6400 (expandable to 12800) for shooting from bright to dim light.\nImproved EOS HD Video mode with manual exposure control, expanded recording, Movie Crop recording in 640 x 480, sound recording level adjustment and an external microphone IN terminal for access to improved sound quality.\nVari-angle 3.0-inch Clear View LCD monitor for shooting at low angles and 1,040,000-dot VGA with reflection reduction using multi coating and high-transparency materials for bright and clear viewing.\n5.3 fps continuous shooting up to approx. 58 Large/JPEGs and 16 RAW.", "Name": "Canon EOS 60D DSLR Camera Body Kit, Black with EF-S 18-200mm f/3.5-5.6 IS Lens - U.S.A. Warranty - Bundle - with 2 4GB SDHC Memory Cards (total of 8GB), Camera Bag, Spare LP E6 Lithium-Ion Battery, USB 2.0 SD Card Reader", "ImgURL": "http://ecx.images-amazon.com/images/I/21DpgXQQSSL.jpg", "ProductID": "B004E40738"}}