{"Reviews": [{"Title": "Better than I thought it would be!", "Author": "PRG", "ReviewID": "R3K0A77ZNWX5UO", "Overall": "4.0", "Content": "I have my Powershot A2200 for about two weeks now. I was a little concerned about the mixed reviews but I thought I would take a chance. I have and love my Canon G10 but did not want to carry it everywhere with me.  I needed a little camera to carry with me and not worry about. I purchased my Powershot A2200 for 129. and could not complain about that. I liked how you can move through the different modes quickly and I especially liked the live mode. I am an artist and it is very important for me to control color and contrast and I can easily do that in the live mode. I understand the problems some of the other reviews complained about especially the blurriness. I too had blurry photos when I first started using it. This camera has a learning curve - it is a very sensitive camera and you have to become familiar with it and choose the mode ( program, live , auto ) that is best for you. Also there are several options to control in the focus of the camera. I suggest you become familiar with it to improve your results.  This is a good camera for someone like myself that is familiar with using cameras and want options for controlling images.  If you just want to point and shoot and not think about it - this may not be the best choice. I am really impressed with the photos I have taken. I mainly use the live mode - it is a very flexible mode - shooting well in low museum light and even out of a fast moving car.  Given what I received for this cost I am very pleased. I love my little light canon camera.", "Date": "April 29, 2011"}, {"Title": "Good for what it's made for,", "Author": "Y. Farhi", "ReviewID": "R30IS8GXKABO4B", "Overall": "4.0", "Content": "Well here's my story,I am a 13 year-old kid that has been in to photography for quite some time now so I figured I am a good enogh photographer to get a DSLR. But that takes money, and money takes time.So I decided to save up some money but still I wanted a camera. So I found this.Now it's not something that a pro would use, but what I like about it is that if you're looking to become pro, you can learn about iso and white balance while you can also play with the fun art filters and scene modes.I find the discrete mode very good if you want to take pictures of sleeping baby's and etc. The toy camera mode is great for vintage style photography.One thing that bugs me is that in low lighting the camera doesnt react well.", "Date": "September 10, 2011"}, {"Title": "Clear pictures with little delay.", "Author": "FyrDragon81", "ReviewID": "R2J79R135LD3WN", "Overall": "5.0", "Content": "I really like this little camera.  I spent several weeks shopping around for a digital camera that could do it all and I think I got it when I bought this camera.  It met most of the criteria on my wish list with 14.1 MP and 720p HD video.  The X4 zoom was initially my only disappointment but after playing around, I soon discovered that it goes more than x4, just at a lower quality picture.I love how easy this camera is to use.  It takes really clear pictures with ease.  My previous digital camera had over a second delay and half the time my shots turned out fuzzy.  With the \"Easy\" mode, the camera does all of the work for you and usually the camera is right.  I use this to take pictures of my 3 year old daughter who is constantly on the move and the camera takes nice clear shots.  Also the camera is fast (for a digital).  From the moment you click the button, it is only a split second before it takes the shot which makes it easy to capture the moment you want to keep.I also enjoy the \"Discrete\" setting.  I used this setting while visiting a museum and I love that there was no embarrassment of beeps and clicks while I fumble with the camera to turn off the flash.  It's fast and quiet and the camera still took a good picture in low lights w/o the flash.  However I did have to rest my arm or the camera on a stable surface.I haven't played around much with the video camera yet.  The zoom lense is noisy so I think that might pick up with the sound quality but considering I had good luck with still photos on low lights, I don't think the video will be a problem as long as the camera isn't jostled too much.For the price, this is the best camera your money can buy.  I know that there are better camera's out there with more features, but this does everything I could ask and more for a family camera.", "Date": "August 6, 2011"}, {"Title": "Don't rely on Auto mode & you'll be happy for the price", "Author": "Adam Norris", "ReviewID": "R3VNGFL74OI6ZO", "Overall": "4.0", "Content": "This is not the type of camera where you can leave it on auto and assume everything will be fine. I did that but within a couple of shots I found the settings to be overly bright & very noisy as it looks like the ISO had been cranked up to 1600 (which is ridiculous for any compact) for a not so dark room. Its best to switch straight to Program mode and get accustomed with the manual controls. Thankfully Canon has realised that some people don't know anything about cameras and has provided an inbuilt help system (which can be turned on/off) to set examples of what each thing does, this can save a lot of time & avoid reading through the 200 page PDF manual! Very handy for those who are just about to leave on vacationThe discreet mode is great for those that need to take a photo but don't want to attract any attention. This mode will not use flash & will not make any sound at all aside from a tiny mechanical movement. Unfortunately the LCD screen will still continue to emit light since there is no manual viewfinder to look through. The colour reproduction is actually pretty accurate, its possible to replicate what you see with your own eyes (something that's usually impossible whilst indoors with compacts). The optical zoom mode is nice, you get a choice of both 4x optical & digital zoom of up to 16x. If you want to preserve your photos I strongly suggest turning digital mode off. Thankfully its quite obvious where the digital zoom will come into play as it'll pause for a second before continuing & you'll notice a line inbetween the zoom bar. The LCD screen itself is nice & large & easy to view under direct sunlight - a problem that arises even amongst DSLR users!Now for the bad points, the lack of IS (image stabilisation) is disappointing as a lot of images in low-lit rooms will get blurry even if your hands seem like they're barely moving. The all plastic casing is also worrying, I'm pretty sure that the tripod holder isn't even metal which means it could wear down quickly & wobble around. The delay between shots is very slow taking about 4 seconds to get from one to the next. The plastic cover that covers the USB transfer cord is also disappointing as not only is it hard to get open but feels like it'll eventually be ripped off accidentally. Although this camera seems to take good photos via manual controls you'll instantly notice upon zooming in that it'll still have digital noise including the flash shots so detail will be lost during editing even if you're only shooting in 2MP (less than 20% of its full resolution). Camera distortion is another issue with that rounded affect on straight objects at angles and a lot of the features are gimmicky and aren't helpful for anyone who's serious about photography.However I'm probably being a bit too harsh since coming from a DSLR. It is an all round good budget $100 camera & you'll no longer have to worry about using flash for dark indoor shots which usually kills the photo with false lighting. Just be warned that digital noise will popup on occasions & a few shots will get pretty blurry without image stabilisation, if this worries you, aim for something a bit better.", "Date": "September 7, 2011"}, {"Title": "Great little camera!", "Author": "Matt Hoover", "ReviewID": "R2EUVLXFMFNRI1", "Overall": "5.0", "Content": "I read the other review of this camera and decided to purchase it anyway. This camera takes great pictures!  Its inexpensive, small, and simple to use, exactly what I was looking for.  5 stars!", "Date": "March 23, 2011"}, {"Title": "Not up to Canon's standards", "Author": "MikeMar1955", "ReviewID": "R1HKIF1I3JWPWL", "Overall": "2.0", "Content": "Canon cameras have always been the best for the money, not this one.  Although the camera has numerous features that are attractive there are two issues that detract, Lag time and battery life.  When the battery is freshly charged the lag time is comparable to the SD line of cameras.  After ten to 15 shots the lag time gradually gets too long. I would not recommend using it for shooting pictures at an event, it ma be okay for still lief pictures.  The battery is a lithium-ion, same as the SD series.  However, it is rated at only 740 mAh compared to 940 mAh on the SD series.  On a recent trip the battery died after seven hours of usage.  Today the battery monitor said I had used 1/3 of the capacity in 2.5 hours.  I recommend spending the extra money on the SD series or buying a different brand.", "Date": "April 25, 2011"}, {"Title": "Great Pocket Camera", "Author": "Scott", "ReviewID": "R27PI4OO6KKFYG", "Overall": "4.0", "Content": "I bought this camera from Amazon just before we left for vacation to Florida, the Gulf Coast, and New Orleans.  I needed something small and light that would be easy to tote around, and this definitely fit the bill.  I didn't have enough time before we left for vacation to figure out all of the options and adjust to the learning curve, but I still managed to take some excellent pictures.  I had some trouble taking good, clear pictures at night though - I couldn't get the flash to produce the clear images that I needed at times, but I think that is mainly due to my inexperience with the camera itself.  It has some cool options (miniature effect, macro mode, fisheye lens) that I played around with and turned out several great pictures.  I've posted a couple of these pictures on Amazon that I took with the Canon A2200.  Overall, I'm happy with it and would recommend this camera, especially to those who need a good camera that's easy to use while on-the-go.", "Date": "June 11, 2011"}, {"Title": "Mom armed with Canon = Every Kid's worst nightmare", "Author": "Tashpeters", "ReviewID": "R1FA5TC3C77XDD", "Overall": "5.0", "Content": "I love this camera. I have owned a Samsung camera, I paid over $200 for, it was also a good camera. When it broke after about 2 years, I bought a Fuji. We don't use that one anymore because it took too many blurry pictures. I got this Canon camera because it was on sale at Target. Target gave us a $30 gift card for buying it. What a deal!  It has a lot of modes to choose from, should satisify the simple shooter to those looking to take better and varied pics for something like a SCRAPBOOK anyone?!? The fish eye effect would rarely be used, but you see its interesting for funny photos (they picture a dog that was shot using the \"fisheye\" effect above). Maybe if you hate someone from work you can use fisheye and make their nose look huge then tag it on facebook, I don't know. Hehe.But here are some of the features:First of all, you can always change the settings of the timer, flash, and display (you can have the date show on the pictures...or choose not to) no matter which types of pictures you wish to take. You always have the options to change those things.Now for the meat: The notches you can choose on the wheel up top are: Program, Live, Auto, Easy, Scene, Effect (I guess I'll call this one that), Discreet, and Video.Program mode, you can adjust all of these settings:ISO speedWB setting (white balance I think)My Colors (black/white, sepia, custom, etc.)Single shot or Continuous shotEvaluate (brightness based on overall scene)Size of the shot (From 4320x3240 for 16x20 inch pictures down to 640x480 for email attachment pictures...they also include a widescreen option)Normal quality or Fine qualityLive mode you can adjust:Dark --------------  LightNeutral ------------VividCool ---------------WarmI never use that mode.The auto mode they choose all the settings for you other than:Size (16x20\" quality or email attach quality, and all the qualities in between)Normal quality or Fine qualityEasy mode, you cannot change anything other than the things you can always change, like timer, display, and flash. Guess they wanted to make easy mode...well...easy.For Scene mode, the choices you have the options to adjust depend on the scene you select, for instance, if you choose portrait you cannot adjust white balance, but if you choose blur reduction, you can. The scene modes you can choose are: Blur reduction, portrait, landscape, kids&pets;, smart shutter, low light, beach, foliage, snow, fireworks, and long shutter.In effect mode (don't know what it's actually called, but in function set the effects are the things at the top you can change) you can change the effect; choose from fisheye, miniature, toy camera, monochrome (b/w, sepia), super vivid, and poster effect (a unique feature). In most of those effects you can change to normal or continuous shot, and normal or fine quality. Some you can also change the picture size.Discreet mode is fantastic, you can take pictures quietly and discreetly, all you hear is a tiny \"click\". Won't even wake a sleeping baby, trust me. You can adjust white balance, colors, single or continuous shots, picture size, and quality normal or fine.Video you can adjust standard or miniature effect, white balance, colors, and quality from HD movie 1280 or down to 320 (longer movie, lower image quality)There is also a zoom in/zoom out on this camera, and a massive amount of other things you can do as well...like downgrading the picture size after it has been taken, viewing slideshows, etc.  You really would need to read the book to learn of the full potential of this camera. I recommend this camera. I do get some blurry pictures, but not too many. The stats on blur are probably about 1/10 really blurry, and 2/10 slightly blurry (from an isolated blurry arm to edging seems a tiny fuzzy). Most of them are clear. The pictures I take are mostly pictures of my kids at home. I love this camera, and I hope you do too if you decide to buy it.I hope that helps you all make your decision, and you are welcome!", "Date": "January 21, 2012"}, {"Title": "Excellent point and shoot for non-hobbyists", "Author": "Daniel S. Glickman", "ReviewID": "R2N3GQEMHM0IMJ", "Overall": "5.0", "Content": "I gave this camera to my girlfriend for Xmas as her Samsung point and shoot was borrowed by one of her daughters and returned without the shutter button.  How does that happen?So to begin this review, let me start by saying the A2200 is NOT a camera for a hobbyist, semi-pro or someone wanting to shoot in manual and learn the exposure triangle.  It would NOT be my choice for a creative tool to be used to \"make art\".  However, for the vast majority of amateur camera users, who just want to point and shoot and take snapshots, this little Canon is a ton of camera for the money and all they will need.  For under $90 street price, you get a lot of bang for your buck, and much better image quality than you can get with an iphone camera.First, the lens is very good for the price class:  opens up to f/2.8, 4 times optical zoom and 28mm on the wide end.  Better specs than the lens on my $300 Canon SD780.  Second, the processor, DIGIC 4, is also very good and Canon somehow managed to pack 14.1 megapixels on to a 1/2.3\" sensor without creating a noise monster.  Third, Canon figured out how to make a SMART AUTO setting that actually works properly.  For a novice or someone who just wants to take snapshots, this is all they need.  Just compose, squeeze the shutter half way to lock in focus and exposure, and snap away.  If you can't do that basic procedure, stick with your camera phone.  Seriously.  Rant:  It amazes me how many people spend no time at all composing, then they plunge that shutter button down, shaking the entire camera, not letting the poor thing autofocus.  And then they take crappy pictures and blame it on the camera.If one wants to expand their photographic envelope just a bit, the A2200 has creative filter options, such as miniature effect and fisheye, to name just two.  Also comes with a lithium rechargeable battery and more cables than my Nikon DSLR shipped with. Canon is good about giving the consumer a decent set of accessories.I've tried all the creative filters and various settings and it was not difficult for me to take a few artistic shots with the A2200.  My guess is the majority of users will keep it set to SMART AUTO and be happy with the results.Bottom line: the A2200 is an excellent choice for someone desiring an inexpensive point and shoot.  And produces much better results than a camera phone.", "Date": "January 14, 2012"}, {"Title": "Alright.", "Author": "Virtually Done", "ReviewID": "R4M6JX7CUYXWB", "Overall": "3.0", "Content": "For $100 bucks, it's not bad. It has a lot of features (mini mode, fisheye mode, vivid mode, ect..). It has the potential to take great photos, but I often find it difficult to focus with certain lighting; and there is sometimes a delay after taking a photo (no \"continuous\" shooting). I will say i'm impressed with its durability. I've dropped it on concrete floors, throw it around, and it still works like it did when I first bought it. It has a large screen in the back (no viewfinder), so if you do end up somehow getting the LCD screen to break... well, good luck. This camera supposedly shoots in 720p HD. I guess you could call it \"HD\", if HD looked something close to 360p. And once recording has started, it does not re-focus. Plus, the audio recording isn't great (a lot of noise). Overall, this camera is probably worth about what it's priced at ($100). It's nice if you're using it as a backup camera, vacation camera, or something to replace your DSLR for small events. If you're looking to create beautiful wonderful professional photographs, either have patience, or look for another camera.", "Date": "May 6, 2011"}, {"Title": "Awesome new camera", "Author": "Caitlin Colleen", "ReviewID": "R15BWPLXVY0EPQ", "Overall": "5.0", "Content": "I purchased this a few days ago to replace an older camera, and I love it. All of my test shots have turned out beautifully when I uploaded them, and the new fish eye and miniature settings are fun to play around with.My only concern is that the flap that covers the a/v out ports now opens in a new way, so that the pieces holding it on are under a bit of strain when it's plugged in to your computer.", "Date": "April 7, 2011"}, {"Title": "Lives up to Canon brand", "Author": "KittyC", "ReviewID": "R1Z9H3RUO1QPJ", "Overall": "5.0", "Content": "This is exactly what I expect from the Canon brand. The pictures look great, and the camera is super easy to navigate. All of the photo options are fun to tinker around with. If you don't like to mess with settings, then there is an auto mode that takes pretty good pictures. For those of us that like to have more control over the picture, there is a mode for that as well. You can't really change too much beyond shutter speed, iris, and other such basics. If you want to get really in depth, then you shouldn't be shopping for a point and shoot camera. The camera is light weight and compact. If you want something to fit into a pocket while you're out and about, then this is definitely the way to go. The last Cannon I had has held up for years. The only reason I bought a new camera was for an upgrade. Cameras have more oomph now than they did six years ago! And this one was worth the hassle of upgrading! I expect another six years of picture taking with this one.", "Date": "June 5, 2011"}, {"Title": "Works Wonderfully. Get it!", "Author": "Shelly Mak", "ReviewID": "R2N8U17EB4L2AZ", "Overall": "5.0", "Content": "Ignore all the negative nancy's on here. I feel like they're not realizing that this is JUST a compact camera.. It's not going to take the same pictures as a DSLR. If you want a camera that takes professional looking photos, drop another 700-900 dollars on a nice camera.This camera is great for the price it's being sold at. First of all, it's a Canon; there's no going wrong with these cameras. I have a Canon Rebel t3i and t2i but wanted a smaller canon to carry around in my purse. This Power Shot is great, the 14 MP *along with* my 32G memory card allows for really great, clear pictures. Obviously if one is moving rapidly and shaking the camera, you can not expect any camera to take a clear picture, but with good lighting or a flash, this Power Shot takes clear pictures. Even when there was low lighting, the camera still takes decent pictures (but not as clear).I've taken this camera on several rendezvous over the past month since I've gotten it, and have used it at the beach (high light exposure), camping in the mountains (fire and nature), at parties (people moving very quickly), and on rainy days (poor natural lighting). This camera succeeds my expectations for a compact camera, and wherever my pictures are posted of these events, people always complement them and suggest that I \"bring my camera next time we all go out\".", "Date": "March 27, 2012"}, {"Title": "Great point & Shoot Camera", "Author": "Aaron", "ReviewID": "ROAYU687HVU5M", "Overall": "4.0", "Content": "I wanted a nice point and shoot camera on black Friday. Now, I am not a professional photographer, I do know the difference between a digital SLR camera and the lenses and technologies which make them such a popular choice amongst consumers, however, I wanted to get back to the basics of point and shoot. The A2200 is a great digital camera, it provides excellent optical zoom, which, to those of you aware of, is the actual camera lenses functioning to focus on an image.Digital Zoom is a feature I usually shy away from, yes, I am aware that not every single camera out there isn't going to be equiped with some form of digital zoom that relies on the camera processor putting in pixels for the image to 'appear' closer, but, still comes out grainy. So, with the auto focus, auto flash and battery fresh out of the charger, I snapped a few shots around my house. I must admit, I was a little turned off by the grainy film washed look in the LCD screen, but my photos come out gorgeous on my computer. While I don't need to edit them down from the huge 2xxx by 10xxx format I took them in, I am still experimenting with lower resolutions to find my personal 'sweet spot' that fits my needs. All of the features that come with the camera are pretty standard, including anti-blur, various scene modes and a few other options I haven't necessarily envisioned myself using but i will definitely experiment with them throughout the life of this camera.I have been using my cell phone to take pictures, which holds one major problem that digital camera's all remedy, which is a dedicated button for snapping pictures and above average anti-blur feature along with a better flash. (Honestly, I read reviews on tech websites, i don't see how the reviewers can touch the screen to take the photos without shaking and ruining the picture).I am using an 8GB memory card, it's great capacity with the max settings, I have some where around 1700 photos I can take before needing to transfer the files over.A few points I didn't touch on but, might be a selling point:Does not have a touch screen, I mean, the button layout isn't fancy, but it's made to where you can get around within a few presses.The video is so-so, but, you don't use digital camera's to record video, it's a feature i will rarely useComes with composite out cables for review on a television, cable length is pretty short, but most blu-ray players and televisions have card readers anywayNo view finder is built into this unit, get used to using the LCD screen when taking a photoI'd buy this camera for those who want a point and shoot, it's a great niche between price and function which I highly recommend coming from a FujiFilm FinePix camera with 6 less MP and 3x optical, it was a sweet deal when I got it (free) but the quality of the photos I took were often grainy, blurry and 3 out of 10 times unusable.I bought this camera on black Friday with Amazon Prime, shipped last week and due to the weekend, I received it the following Wednesday. Great camera definitely recommend it as a budget choice.", "Date": "December 1, 2011"}, {"Title": "Excellent little camera for general use!", "Author": "DFS", "ReviewID": "R23Y3XIMZWR55V", "Overall": "5.0", "Content": "Looked at a lot of different cameras before picking this one. Used it for a vacation trip, and am very satisfied with the results. Battery lasted for several days. Video works great. I also use it for close-ups to post photos for products on eBay, and it is easy to do. Lots of options.Picture is clear IF you don't just snap - it takes a second for it to focus, so push the button half-way, pause, then all the way. The only downside is that it takes a while to actually get the picture. We were at Seaworld and tried to photo the whales jumping out of the water. By the time the picture actually took, all that was left was a splash of water. So not good for instant shots, or at least I haven't figured that out yet.Worth the money. And I bought a Case Logic TBC-302, which is perfect for this camera. Less than $6 on Amazon.", "Date": "September 23, 2011"}, {"Title": "lemon", "Author": "Ngineer", "ReviewID": "R2PYMPRIKWSJ6I", "Overall": "1.0", "Content": "For all of the good reviews I read about this camera, maybe I got my hopes up a little too high.  It's been a week now and after about 150 pictures, it's going back tomorrow.  It's a nice small camera with some cool features, but picture quality is terrible.  My wife's old point and shoot got wet and went to camera heaven while we were on vacation, so I thought this would make a good replacement.  It was a little more than I spent on the previous camera, but Cannon has made a good name for itself and I figured it was a safe bet.  Well, I figured wrong.  Maybe one out of 10 or 15 pictures comes out decent in good conditions.  In all but bright light, it is nearly impossible to hand hold the camera and get a sharp shot.  The auto white balance is often wrong.  In bright light I get a haze over the pictures (lens flare?).  In low light I get reflections of what looks like dirt on the lens even after I have carefully cleaned the lens with a lens cloth.  Out of 150 or so pictures, I have maybe 10 decent ones and none that are any better than just decent.  Our previous point and shoot took such good pictures that I started to neglect the SLR.  This camera takes only slightly better pictures than my daughter's $20 digital camera.  With all of the good reviews I have read about this camera, maybe mine was a lemon, but I'll be gun shy when it comes to cannon in the future though.", "Date": "September 8, 2011"}, {"Title": "Great for its price range", "Author": "C. John Smith", "ReviewID": "RMWVX14UGG985", "Overall": "5.0", "Content": "A lot of people reviewed this negatively but I feel like they just don't know how to use it properly. If you don't take the time to learn about the camera first it will just shoot average pictures, but if you read the manual and play around with it you can take some awesome shots.", "Date": "June 13, 2012"}, {"Title": "Not even close.", "Author": "Beast", "ReviewID": "R3V89V3VI89QL3", "Overall": "1.0", "Content": "I have to say, this is the disappointment of the year.  This camera is horrible quality, every picture I took looked blurred or slightly off focus.  The auto function setting was intolerably long between clicking the button and the actual picture taking.  After several seconds of auto-focusing, flashing orange lights at the subject, and then finally flashing, the picture was still out of focus and washed out or blurry.  The flash is too bright so your subject is bleached with an over abundance of light.  Trying to take pictures of pets was impossible because it took several seconds flashing the pet with this orange light that ultimately make the pet look away so all you get is a blurry side of it's head.  Let's move on to video.  Fuzzy, low quality, bad resolution, poor sound. Everything about this camera was a disappointment, only the shape and size was acceptable. I owned a Canon A20 10 years ago and the picture quality from that 2 megapixel camera was far better than this.  I think Canon has really dropped the ball on this one.  Do not waste your time and money, your cellphone takes better pictures than this.", "Date": "March 24, 2012"}, {"Title": "Great Little Camera! Always works, Always gets perfect shots, So many Features!", "Author": "Rick Widner", "ReviewID": "RK82151AKLO2", "Overall": "5.0", "Content": "This is a wonderful little camera. I received it for Christmas, and it was just about the time to replace my old Powershot sd600. This is such a big upgrade! I love the discreet mode, perfect for shooting during a speech or meeting. I like how there are so many options for getting the best picture, but I mostly use the Auto mode. I like e 4x optical zoom, with an additional 8x digital zoom.  I don't see why there are so many low reviews, this camera has worked perfectly for me, and It is the best camera I have ever used. Wonderful price, too.  It works great outdoors, indoors, and I really like the feature where you can tell it what kind of lighting you are under, like Daylight, cloudy daylight, tungsten, fluorescent, high fluorescent, or custom. I also like how there is a separate button to turn face recognition on or off. Iuse that a lot.  Overall, A great camera, lots of features, works perfectly, and great for shooting video.", "Date": "February 5, 2012"}, {"Title": "Great Fun for the Money", "Author": "Steven R. Jones", "ReviewID": "RQ78QMIFCN5IZ", "Overall": "5.0", "Content": "I've been into photography since high school.  I have many film and digital cameras and love to take \"great\" photos.  I'm not a big fan of Photoshop.  I prefer to make minimal adjustments of contrast, saturation, etc. and let the photo speak for itself.  I got this little Canon to carry with me when I don't feel like lugging around the DSLRs...the A2200 is so small it can fit into a shirt pocket, jeans pocket or easily into a ladies small purse...very convenient.Picture quality is excellent!  I have taken low light shots at a concert, taken some cool close ups, played with the various special effects settings and had a great time creating some really interesting photos.  Beyond this the picture quality is quite good.  No it will not replace the 5d, the 7d or even a good quality Rebel, but it can take some great shots.One thing I was curious about was controlling the camera to take advantage of the f/2.8 aperture...there are no Aperture Priority modes that would think to be pretty simple to program into the camera, but if you play around enough with Live mode you can get the camera to act accordingly.  So yes, you can even take some good...on the spot portraits.For $80 this is definitely a five star camera. Probably one of the best buys in very small point & shoots out there.  Sure you can get a much better small camera with the S95, but then wouldn't you rather put that money towards a good DSLR lens?... I know I would.", "Date": "December 26, 2011"}, {"Title": "great little camera", "Author": "Charles in Phoenix", "ReviewID": "R2R2ODA8O36RBB", "Overall": "5.0", "Content": "I needed a small camera to document the condition of foreclosure properties. It didn't need to be fancy. Just needed to take decent photos and include a date stamp. After some research the Power Shot A2200 seemed like the best choice. I was immediately glad I made this choice. It is was very easy to set up, takes great photos at exactly the size I needed and it is very easy to download the photos to my computer.Suddenly, one day it stopped taking photos. Not sure what happened but it was just total blackness instead of a photo. I called the customer service number and they were extremely helpful. They e-mailed me a shipping label to send the broken one back and I received the new one within 2 weeks. Thanks Canon!!!", "Date": "September 20, 2011"}, {"Title": "Awful camera.", "Author": "Sweet Concorde", "ReviewID": "R2O01XQ6GWCNZF", "Overall": "1.0", "Content": "I used to own a Canon A95 and a Fujifilm J10. I replaced the A95 with a Powershot SX20IS. After I dropped the Fujifilm and broke the lens (whoops), I replaced it with this Canon A2200. I bought it on sale, and with an employee discount and I am still dissapointed with it. It isn't bad because it's an inexpensive camera, it's just bad. I don't trust the Canon name anymore.Even in ideal lighting conditions most pictures turn out awful. The other day I took my son out to the zoo. It was really nice out - sunny, but not too bright. I thought I could trust the A2200.First picture (auto mode): the lighter colors are washed out (with white patches, even), the rest of the colors are muddled. Fuss with the settings a bit - my son's pink cheeks are blotchy red, his jeans are neon blue. Fuss with them a little more - his face is either bright white or bright pink, his hair is either gray or dark brown with a funny looking \"crown\" of reflected light. He is either frozen by an overly-aggressive flash, or he looks like a grainy blur. I finally fuss with it enough to get a really fantastic looking picture (as good as I would NORMALLY get with any of my other/previous cameras) and the next ten pictures I take look overexposed. Sometimes I can get a good photo - but most of them are way off.This camera might be fine for some people, but from my experience it is not a good camera compared to others in the same price range. Keep looking.", "Date": "January 17, 2012"}, {"Title": "easy camera", "Author": "miguel martinez", "ReviewID": "RF80SQ3PSNBEO", "Overall": "5.0", "Content": "Easy to use, excellent resolution, even zoom. Very portable, is the complement for a bigger camera, for example, in a complicated trip, or bike trip. I recomend this, in addition, it is a canon.", "Date": "June 26, 2011"}, {"Title": "For my Teen Daughter", "Author": "RingWorlder", "ReviewID": "R2M111CN25HGJW", "Overall": "5.0", "Content": "I bought this for my teenage daughter. She has told me what a great choice it was and how the features are easy to use to get the type of photo she wants. The USB hook-up to a computer and internal software connect without a hitch. For the price and features it can't be beat. You should also by a SD card for it. 8GB or more High Speed SD Cards are really cheap.", "Date": "July 27, 2012"}, {"Title": "Good for what it is...,", "Author": "Ava Brooks", "ReviewID": "R1RP13PLKGPYF4", "Overall": "5.0", "Content": "I just love this camera. I wanted a simple camera that took good pictures and this is the one. The pics are so clear and beautiful vivid colors. I have had compliments on my photos. I don't know why some reviews said the pics were blurry...none of mine have been and I am not experienced at all with cameras ! I would recommend this product .", "Date": "May 21, 2012"}, {"Title": "Produces the grainiest picture ever", "Author": "Pipigurl", "ReviewID": "RENCP8BZRMQAO", "Overall": "1.0", "Content": "My 3-year old Canon Ixus 80IS finally died late last year (after dropping it on the floor many times) and I was hunting for a good deal on cameras. This model came on sale at Target in November for $80 plus a $10 gift card. I was happy when I took it out of the box... the red color was a nice touch. However, my heart sank as soon as I started taking pictures. Old cameras tend to produce grainy photos at low light settings, but even in a well-lit room the pictures from this camera were so grainy. Dismayed, I returned it to Target and researched the Ixus counterpart in the US, which turned out to be the Powershot ELPH 100 series. I waited (around 6 months) for the price to drop to $102 and then I grabbed it. It's well worth the wait. Stay away from this A2200 piece of junk.", "Date": "May 24, 2012"}, {"Title": "Amazing!", "Author": "Judith", "ReviewID": "R9WABJ1PQ4SPW", "Overall": "5.0", "Content": "It took me a long time to actually find a camera that I liked and this one has extremely clear pictures and it's all good quality along with the amount of mega pixals. Overall, it's a great camera although I know it's been said that the actual quality of the camera isn't that great since the plastic seems frale, it's actually very sturdy because I have dropped it once already. But overall, GREAT CAMERA!", "Date": "July 6, 2011"}, {"Title": "Everything I expected", "Author": "Staceyvb7", "ReviewID": "R2SB31O76A7VCW", "Overall": "5.0", "Content": "I'm a pretty simple person and needed a simple camera.  Glad I bought this one, because it is very easy to use and I didn't even have to read the user manual.  I recommed this camera for good quality pictures on a budget.", "Date": "August 14, 2012"}, {"Title": "Great Quality for the Price", "Author": "Poo", "ReviewID": "RGVF3P7HIGSSC", "Overall": "5.0", "Content": "After trying various point and shoot i kind of settled with one. Three thingsEase of UseGood Quality even for indoor picturesValue of Money", "Date": "August 6, 2012"}, {"Title": "Very Nice Product", "Author": "Rajj", "ReviewID": "RKUVKLU4G77MK", "Overall": "5.0", "Content": "Its very nice, compact, small and good product.. we liked it very much.Also the display, options provided are nice..", "Date": "July 30, 2012"}, {"Title": "clicking noise when on", "Author": "Max123", "ReviewID": "R2DSSO2AN2PX3N", "Overall": "1.0", "Content": "This is my third Canon camera.  The first 8 years ago worked really well until someone dropped it.  The replacement was a complete lemon.  The fully charged batteries would always show as low and the camera would shut off, and now this one makes a clicking noise everytime I turn it on.  I got another lemon from Canon.  that's two out of three. I think this company is really taking it's customers for granted and going downhill fast.  This will be my last Canon.", "Date": "April 27, 2012"}, {"Title": "Great little camera!", "Author": "G. G. Perkins \"Twilightfanatic\"", "ReviewID": "R1U5MY8IQL841I", "Overall": "5.0", "Content": "I spent about a week researching camera's under $100 and finally decided on the Canon Powershot. I am not dissappointed! This camera is fantastic. It is super easy to use and takes great pictures. The charge lasts a long time. I only had to charge it the first time and the battery is still full. I would recommend this camera to anyone looking for a simple to use in-expensive camera that takes great pictures. I haven't used the vidoe feature yet so I can't comment on that but I'm sure it works well.", "Date": "March 26, 2012"}, {"Title": "Great camera. Especialy for the price.", "Author": "brownd379", "ReviewID": "R2OQLKAR31ESXL", "Overall": "5.0", "Content": "Not sure about those people who have bad mouthed this camera. I've taken this with me on several trips now and have had great success. The picture quality has been great. I put in an 8g SD card and I have yet to even get close to filling the memory. If there is a down fall to this camera it is during video. I noticed that if I zoomed in to close to my subject the picture becomes a little grany. Other than that I would recomend this camera to anyone looking for a camera that gives great pictures at such a low price. Buy this one with out fear. You wont be sorry.", "Date": "January 15, 2012"}, {"Title": "Far Above Expectations!", "Author": "Tiki Torch", "ReviewID": "R6PG979FSYCBF", "Overall": "5.0", "Content": "I love this camera! I could use it in minutes after I bought it. Its quality is amazing! It has all the basics, and a few extras such as fish eye. After I bought mine, my whole family wanted one of these cameras!", "Date": "August 9, 2011"}, {"Title": "Nice lil Camera for the price", "Author": "twagn", "ReviewID": "R38L22R48DS35Y", "Overall": "4.0", "Content": "I bought this camera for it's small size, cheap price and as an alternative to my DSLR. Very nice image quality at ISO 80 in P mode where you have some control over the image. Although their is no image stabilization unless you switch to scene mode and then it's called 'Blur Reduction' ...new one on me...and no choice of ISO other than AUTO. Also it shoots at a reduced resolution. I guess you can't have it all at this price. Just make sure you have your mini tripod ready for those important shots unless your in scene mode and choosing 'Blur Reduction'", "Date": "June 11, 2011"}, {"Title": "Great camera!", "Author": "grh", "ReviewID": "R144V58OH6H3VX", "Overall": "5.0", "Content": "It is small enough to fit in your pocket or purse and yet the photos are fantastic. Really impressed with this camera.", "Date": "May 1, 2011"}, {"Title": "Excellent", "Author": "Yudith", "ReviewID": "RU4MS775MCOKM", "Overall": "4.0", "Content": "The product I received it in excellent condition, the pictures are really optimal, easy to use product, I recommend it. -", "Date": "March 19, 2013"}, {"Title": "for the price, super!", "Author": "mama bear in wnc", "ReviewID": "R3FINOGV7X4857", "Overall": "5.0", "Content": "Nothing fancy...easy to figure out, takes good enough pictures...easy to download onto computer.  Cannon consistently good, again, for the price!", "Date": "March 14, 2013"}, {"Title": "it is good camera", "Author": "Vitaliy", "ReviewID": "R3S1IE9HR5F6HR", "Overall": "4.0", "Content": "i bought it for my wife and she likes it and she loves picture. it is good picture but not perfect.", "Date": "March 11, 2013"}, {"Title": "Defective", "Author": "Edx D", "ReviewID": "R26CKCDI23N3Q2", "Overall": "1.0", "Content": "I had to return it - images of pictures taken have yellow shadows, almost no color, & are fuzzy; even after restoring to default setting. Costed me $7.78 in postage to return it to Go4Computers in Miami.", "Date": "January 19, 2013"}, {"Title": "Canon Powershot A2200", "Author": "Allan", "ReviewID": "R322DG141B2F6D", "Overall": "5.0", "Content": "Muy buena cámara a un precio justo, es una opción acertada si buscas bonitas fotografías en tus paseos, fiestas demás actividades.", "Date": "December 16, 2012"}, {"Title": "Great!", "Author": "Christopher D. Kelosky", "ReviewID": "R2IFE5VPZJWTSB", "Overall": "5.0", "Content": "I bought this for my wife and she absolutely loves it!  She loves how great the pictures look for a small digital camera.", "Date": "October 23, 2012"}, {"Title": "good working camera", "Author": "alenika", "ReviewID": "R2AKSQ9RX5MBNU", "Overall": "5.0", "Content": "good camera. I expected it being bigger, it is though very small, more like ixus, not powershot. I had 530 before, getting used to this one. It doesn't delay shots as 530 did, waiting for the flash to charge. Not sure if it is plus, as because of this more opportunity of low quality photos with poor lighting. That is, you should control it yourself, not rush when taking photos. It was 8GB memory card included, charger, and 1 square battery.", "Date": "September 28, 2012"}, {"Title": "Simple but great camera...", "Author": "Thomas", "ReviewID": "R1049SWNKC8S17", "Overall": "4.0", "Content": "I love Canon point & shoots. This is one of the cheapest ones, but the image quality is still great. It doesn't have too many advanced features, but it has everything what you would expect from camera for $100.", "Date": "September 27, 2012"}, {"Title": "Nice product for the price", "Author": "Cynthia A. Luisotti \"cyndelu\"", "ReviewID": "R2NE7QKI2W8X0A", "Overall": "5.0", "Content": "I ordered this as a gift. I like it for the very small price. I gave it to a child. Really nice and small and easily fits in your pocket. This camera lives up to the brand.", "Date": "September 12, 2012"}, {"Title": "Good value", "Author": "Michael", "ReviewID": "R3Q978WNR2VENG", "Overall": "4.0", "Content": "The camera was good quality at a great price. No issues with performance and the picture quality is excellent. I would recommend for all purpose use.", "Date": "September 9, 2012"}, {"Title": "3 cameras, 3 broke!", "Author": "marcie", "ReviewID": "R1Y7UGMHP8CX73", "Overall": "1.0", "Content": "Oh my oh my... this camera!!! I got my first one right around Christmas time. I liked it... it was great. It took good photos, was compact, easy to use... all was fine until about 2 weeks after I got it. It came up with a \"lens error\" and would make this awful clicking noise and then shut off. I thought it was a fluke, so I returned it and got another. About a month after that, the SAME problem. I contacted Canon and they were excellent about accepting the camera back and replacing it. Then came my THIRD A2200. Not long after I got it.... THE SAME PROBLEM!!!!! This is obviously a flaw in the model. I have owned several Canon products including a SLR, Elph, Video Camera and various lenses. I have NEVER had a problem with any of them. I don't think this was user error.I will say though, Canon customer service has been AMAZING! Each time they accepted my camera with no problem and this last time I sent them a note asking them to please send me a comparable model and a representative called me and offered me the A2400IS which is an upgrade and so far, so good!", "Date": "August 27, 2012"}, {"Title": "Great Camera", "Author": "AJ's Review", "ReviewID": "R2I1Z02UD6AHOI", "Overall": "5.0", "Content": "Love the camera, great zoom and auto focus.  Light weight and comes with a lot of adapters which was a surprise.  Takes great pictures and was a great bargain", "Date": "July 22, 2012"}, {"Title": "I am enjoying my Canon Powershot", "Author": "Marionina", "ReviewID": "R1ZETGFT9Z5SDL", "Overall": "5.0", "Content": "This camera does everything I require it to, and the best thing is I don't have to keep buying batteries for it all the time. I just wanted a simple camera that I can \"point and shoot\", and this answers all my needs.", "Date": "July 12, 2012"}, {"Title": "Usage of camera", "Author": "Dianne E. Clune", "ReviewID": "R1O55A1OFGKCW6", "Overall": "4.0", "Content": "So far I really like the pictures the camera takes, but when I took videos they didn't load onto my computer and were lost but, that's probably my technological fault .", "Date": "July 6, 2012"}, {"Title": "Nice little camera", "Author": "Jose Sanquiz", "ReviewID": "R1N2GEN63TTMNN", "Overall": "5.0", "Content": "Excelente camara, la calidad de las fotos es muy buena, el Smart AUTO es muy bueno, y la calidad del video perfecta.", "Date": "June 28, 2012"}, {"Title": "This was a gift", "Author": "Shoebuyer", "ReviewID": "R26CFDGUTPAOMN", "Overall": "4.0", "Content": "I bought this camera as a gift...It's pretty cute and practical. But when we were at her daughters party, it gave us trouble, some of the pictures we were taking were blurry.Now idk if that happenstance because of lighting or what, but it happened a couple times, and we became frustrated!", "Date": "May 18, 2012"}, {"Title": "Value for money and for a avarage user this is awsome. My first hand experince with Canon.", "Author": "Thisanthi", "ReviewID": "RE3T3RYY0RLT9", "Overall": "4.0", "Content": "This is the first time i bought a Canon camera as I was always buying Nikon for the last 15 years. I bought this for my brother as a present and was n't sure the product quality until I used it now and I am glad I bought this one as it has good picture quality and also the features available. Ergonomics are better than Nikon and for anyone looking for a camera at a price around 100 $ I would recommend this is a  very good camera.", "Date": "April 17, 2012"}, {"Title": "Canon Powershot A2200 14.1 MP Digital Camera with 4x Optical Zoom (Black)", "Author": "Subsydave", "ReviewID": "RRHPK222RJ0W6", "Overall": "4.0", "Content": "Very Nice ProductPros: Compact Feel, Great Screen Resolution, Love the 'Discrete' ModeCons: Non Metal Casing, Have to hold on to the button a bit before picture is actually taken", "Date": "April 14, 2012"}, {"Title": "Best Camera We Have Ever Owned", "Author": "jlrjturner", "ReviewID": "R26QVKM5R16LJD", "Overall": "5.0", "Content": "Seriously, our last canon cost over $500 and didn't take as good of pictures. It was harder to use and much bigger, but it lasted 4 hard years so we thought we would buy another. I am glad we did.", "Date": "March 27, 2012"}, {"Title": "Great camera", "Author": "D. Crighton \"Dancing with my star\"", "ReviewID": "R14F8UI4O7BCLN", "Overall": "5.0", "Content": "I received the camera ahead of schedule. It seemed almost immediatley,I was quite impressed as I wanted it for a holiday gathering.  The camera has now been used for 4 months and all the features are working and fine. I am happy with the service, vendor and camera.", "Date": "March 20, 2012"}, {"Title": "Canon A 2200 Camera", "Author": "Pops", "ReviewID": "RP4XVRAML6NSH", "Overall": "5.0", "Content": "Ordered the set.  Shipped fast, well packaged.  Setup time was quick and fairly easy.  Camera is compact and easily carried.  Prices on extra battery vary widely.  Canon website $47.00, ebay $3.00 with shipping.  (Long shipping time).  Amazon $5.00 +Haven't used it much but seems to be a good deal.  Would recommend it.  Noticed what a friend used and choose it.  Pops", "Date": "February 19, 2012"}, {"Title": "Good purchase", "Author": "PW", "ReviewID": "R344E894J9GLDV", "Overall": "5.0", "Content": "I bought this camera for my 7yo grandaughter. She was able to learn the camera functions easily and has fun using it. I could not find it in red in any store, buying through Amazon I received it in 3 days and for a better price.", "Date": "January 8, 2012"}, {"Title": "Excellent camera, super easy to use", "Author": "J. Marciniak", "ReviewID": "R2FI7YK6TI983K", "Overall": "5.0", "Content": "I love this camera! It is super easy to use and takes crystal clear pictures.  I took pictures in a pitch black room on auto and they came out crystal clear.  I have not had any blurry pictures.  It is the best camera I think I have ever had.", "Date": "December 31, 2011"}, {"Title": "Slow", "Author": "Tom Collins \"tomlogic\"", "ReviewID": "R1LU8V75OVU1T2", "Overall": "2.0", "Content": "Disappointed by how slow this camera is when taking pictures.  I purchased it to replace a PowerShot SD1100 IS Digital Elph.  I realize that it's saving larger files (14.1 megapixels versus 8.0 megapixels), but I can't wait 2 seconds in between shots.  I will likely replace this with another Canon Digital Elph -- reviews of the Canon PowerShot ELPH 100 HS 12.1 MP CMOS Digital Camera with 4X Optical Zoom (Silver) claim that it can do bursts of 8.7fps.", "Date": "December 26, 2011"}, {"Title": "Good for what it is...", "Author": "Bo Henderson", "ReviewID": "RLBBP6KNSA3HW", "Overall": "4.0", "Content": "Let's be honest, you are not going to win any major photography awards with this camera, but this camera is not made to do that.  This camera takes pretty good looking photos (14.1 MP)& is easy to operate.  You can get more complicated, but the point & shoot feature is not bad.  All in all, it does what I need it to do, though I do which it felt a bit sturdier.  If you are looking for a inexpensive, good camera, you could do much worse.", "Date": "December 1, 2011"}, {"Title": "Powershot", "Author": "L. E. Teatum \"augur\"", "ReviewID": "R24SXH765D324F", "Overall": "4.0", "Content": "This was a replacement camera for a Canon Powershot SD750 that had been the work horse of My wife's 5th grade class events for several years. It got damaged at a school event, and the kids were heart broken, as they quality of the images posted on the class website were always great. The new Powershot had a slight learning curve for all the features but has made a great appearance for the new school year!looking forward to many years of good use from yet another solid Canon camera.Canon Powershot A2200 14.1 MP Digital Camera with 4x Optical Zoom (Black)", "Date": "November 5, 2011"}, {"Title": "Great camera for the price", "Author": "H. Peltier", "ReviewID": "R3CZ1MJZGQDRM0", "Overall": "5.0", "Content": "We purchased this camera for our trip to Alaska.  We are not great photographers, but we got wonderful pictures.  So easy to use, zoom worked very well for capturing wildlife in the distance.", "Date": "September 10, 2011"}, {"Title": "Outdoors", "Author": "Walley", "ReviewID": "RSTQALA6P7LX2", "Overall": "5.0", "Content": "Took this out to the lake in Canada, many outdoor pictures, from the float plane and boat, moving or still the camera took great pictures.  Many commented on how good they were.  All were taken with just the auto setting.  Great Camera.", "Date": "August 25, 2011"}, {"Title": "Canon Powershot A2200 Camera", "Author": "Cindy M. Obrien", "ReviewID": "RATH46JF4VTRZ", "Overall": "5.0", "Content": "I just love this camera. I wanted a simple camera that took good pictures and this is the one. The pics are so clear and beautiful vivid colors. I have had compliments on my photos. I don't know why some reviews said the pics were blurry...none of mine have been and I am not experienced at all with cameras ! I would recommend this product .", "Date": "August 14, 2011"}, {"Title": "Light, fun, plastic", "Author": "P. M. Isom", "ReviewID": "R1TF3E8YG8DW4G", "Overall": "4.0", "Content": "I loved the price on this Canon. I recently sent a digital Elph through the wash and needed a replacement. I was looking for a good price point that would still produce a quality image. This camera is great fun with many features including all of the treatments such as toy, fisheye, miniature... There are enough controls for those with DSLR experience to keep you interested and enough features to make experimenting fun. But it's also terrific if you just want to turn it to auto and snap away. The micro mode works very well. Photos are crisp and clear. Very nice low light photos.As other folks who have purchased the camera have discovered, the cover on the port for downloading pictures is flimsy. I also was a little disappointed in the plastic feel of the camera (My ruined Elph was metal), which detracts from the aesthetics, but the price point and the lightness make up for it. I would have paid a bit more for metal.All around it's a great buy. I wouldn't buy anything but Canon for consistent color, quality, and breadth of fun and useful features.", "Date": "May 11, 2011"}, {"Title": "DO NOT BUY THIS CAMERA", "Author": "anonymous", "ReviewID": "R1IRYVD1CCOJJS", "Overall": "1.0", "Content": "I am a DLSR user but wanted to buy a point and shoot camera that I can bring without hassle and I decided to buy this  on Thanksgiving Day {Nov 2011}. I didn't buy this here in amazon but just want to warn people that this camera is a junk! The lens is jamming and I didn't even know why because this was never drop at all. The last thing I used this for is when I took a picture of my kid while snow sledding and lens got jammed. Very, very disappointing indeed.Nevertheless the photos are acceptable but what good can you get if you can no longer used it? It lasted me only a good 2 months for this JUNK!", "Date": "April 26, 2012"}, {"Title": "Such a Disappointment!", "Author": "A. Best", "ReviewID": "RQ0VE1OORTXWY", "Overall": "1.0", "Content": "I ordered this camera after seeing positive reviews, loving the price, and trying it out in store. Even though the pictures look great on the back of the camera.. after 3 weeks of trying different modes and settings, I still couldn't get a clear picture. The colors were washed out, all the shots were blurry unless the subject was sitting PERFECTLY still (and even then it wasn't great). I thought this would be a step up from my old clunky Kodak Easyshare, but found myself regretting the change. Thanks to Amazon's amazing return policy, I'm now shopping for a new camera, AGAIN.Don't buy this camera unless you're planning on giving it to a toddler or using it for a paperweight. It's kind of expensive for a toy or a paperweight.", "Date": "January 14, 2012"}, {"Title": "Great Camera", "Author": "kjerod", "ReviewID": "R19WW2NB8TSNMS", "Overall": "5.0", "Content": "i love this camera.It takes great pictures and is the perfect size. The only downside is that the battery life on this camera does not last long. Thats the only thing so far but other than that this is a wonderful camera for a great price!", "Date": "August 26, 2011"}, {"Title": "Nice point-and-shoot for the price", "Author": "C.A.", "ReviewID": "R1W2V420SPA35P", "Overall": "4.0", "Content": "I bought this camera on sale at Best Buy a week or so ago and am impressed by it's picture quality considering it's so inexpensive. I agree with earlier reviews, you need to really practice a little to get the best settings for a particular shot. But you get used to it, and many cameras have learning curves, not just this one. I don't seem to be having any problems with lag between shots, but I did notice the reviewer who complained about that said he/she was using class one and four cards (class one is very slow). I use a Transcend class 10 card, which you can get here on Amazon really cheap. No lag here, besides what would be expected of any point-and-shoot. Anyway, I am generally happy with this camera.", "Date": "May 29, 2011"}, {"Title": "Good", "Author": "Olivia", "ReviewID": "R3RMXKDSM4C9TP", "Overall": "4.0", "Content": "This camera is good.  When I got it, I was so surprised at how small and sleek it is!  Very adorable and easy to put in a purse or carry around.I got it as a present for my mom, so unfortunately, I cannot attest to the picture quality.  I wouldn't even review it except that when I gave it to her, I was so disappointed because it does not come with ANY memory.  If you buy this, you must purchase a memory card as well to even try the camera out.", "Date": "November 3, 2011"}, {"Title": "Canon A2200 14.1 MP 4x Optical Zoom", "Author": "Satyameva Jayate", "ReviewID": "R1ZZXZO386WUZ", "Overall": "2.0", "Content": "Received this Product in good condition. But the quality of image is not good. Almost all the images are blurry and I 'm not satisfied with this product. Would not recommend this product to anyone. I bought this for my friend and I already own a Nikon D40 DLSR camera.", "Date": "October 4, 2011"}, {"Title": "NICE CAMERA!", "Author": "Sparkle", "ReviewID": "R1OPDCEC9QAVHN", "Overall": "4.0", "Content": "BOUGHT THIS CAMERA BECAUSE OLD CAMERA DIED. NEEDED A CAMERA FAST AS GRADUATION DAY WAS APPROACHING. THOUGHT THIS CAMERA WOULDN'T BE WORTH THE MONEY. BUT OVERALL ITS A GOOD CAMERA FOR THE PRICE AND IT TAKES EXCELLENT PICTURES.", "Date": "June 29, 2012"}, {"Title": "great condition!", "Author": "K. Gin", "ReviewID": "RGRALOH2U9TFV", "Overall": "5.0", "Content": "Brand new as listed. Came in about 5 days of shipping instead of 10. Works great but takes a bit of getting used to for a point and shoot powershot (holding shutter halfway to focus then clicking). Overall very satisfied and worth the price for a simple general picture taking camera", "Date": "June 15, 2012"}, {"Title": "I love this camera", "Author": "david", "ReviewID": "R9UPP20LD7E5D", "Overall": "5.0", "Content": "If I had the time I would probably bore you with all the research and comparisons I made. Let's just say I'm really impressed with what this little camera can do! Also it's easy to operate, download to computer, edit, etc. and the price was definitely right.", "Date": "March 16, 2012"}, {"Title": "Better cameras out there", "Author": "Kaiyan", "ReviewID": "R28HZILNNCQMU2", "Overall": "2.0", "Content": "This wasn't one of the best cameras I bought from canon which really disappointed me. Sometimes when taking a picture it would come out with a yellow-ish background to it so maybe I need to adjust the settings but it took some time. The flash also makes the pictures not come out well either as it came out dark and sometimes blurry. Of course we can also just photo shop the lightning and all but I don't want to do that for every shot with this camera. Natural lighting was fine.", "Date": "December 29, 2013"}, {"Title": "Broke within one week of use", "Author": "TheZen", "ReviewID": "R3QITVGB6FAE07", "Overall": "1.0", "Content": "Bought a refurb directly from Canon.  Had it for one month, but only used it for less than a week.  The lens barrier somehow gotten detached - no idea how it happened, as it wasn't dropped.  But Canon's warranty won't cover it, and wants to charge me over $50 to repair it.  Never buying Canon again.", "Date": "December 3, 2013"}, {"Title": "I used to hate taking pics or being in pics. Not anymore thanks Canon Powershot A2200", "Author": "Nichelle", "ReviewID": "R10ZHS3UY5WFUC", "Overall": "5.0", "Content": "I love my Canon! I can take all my pics alone & they come out GREAT! Unlike depending on my friends like I have in the past.", "Date": "November 24, 2013"}, {"Title": "Canon A2200 Powershot camera works good; easy to use.", "Author": "EleganzShopper \"EleganzShopper\"", "ReviewID": "R34R0P4WDEWAIT", "Overall": "5.0", "Content": "Canon Powershot A2200 Digital Camera is easy to use and takes good pictures.I'm happy with it. I bought two of them. I owned an earlier canon. This has an automatic settingwhere the camera identifies whether it is a portrait or landscape picture for example. It works pretty good.With my previous camera I had to set the dial to landscape or portrait before taking the picture; but with this camerait is automatic. It also knows when I'm indoors to use the flash. I like how the camera feels to operate. This is a lag between pressing the shutter button and camera taking the picture sometimes. I am happy with it.", "Date": "November 2, 2013"}, {"Title": "Does the job", "Author": "Claudine \"J.G\"", "ReviewID": "RDPINT6I9TAST", "Overall": "3.0", "Content": "Didnt take pics as clear as I want it to, but it does the job. Okay for a starter camera.", "Date": "October 28, 2013"}, {"Title": "Very good for that price", "Author": "Eduardo", "ReviewID": "R2ZYVTRI4V6YFA", "Overall": "4.0", "Content": "This camera is light, nice, takes good pictures and it's easy use. In the nights works perfectly. Also it's coming with sd micro memory 4gb and a cloth case.", "Date": "October 21, 2013"}, {"Title": "AWESOME CAMERA!!", "Author": "Socamaniac", "ReviewID": "RBIQVBZ68MFOD", "Overall": "5.0", "Content": "I bought this camera on a deal, and I wouldn't have mind paying full price for it. It's so easy to use, customisable, and durable. Only downside, hard taking pics of moving objects at night properly...but other than, great product.", "Date": "September 15, 2013"}, {"Title": "good aption", "Author": "DANIEL VELASCO", "ReviewID": "R18RREU9LPYZL0", "Overall": "4.0", "Content": "the camera is nice, practical and fits in a pocket. the battery does not keeps power for several days but does the job, good pictures except for fast action shots", "Date": "September 6, 2013"}, {"Title": "Pretty good digital camera", "Author": "TKG", "ReviewID": "R1XWWTSF99TKZY", "Overall": "4.0", "Content": "I got this as a replacement for an older camera, an Casio Exilm. For those who don't know the Exilim is a heavier weight camera with similar dimensions to the Powershot this is due to it's metal casing. In comparison the power shot has a plastic case and I suspect if anything going to break it might be the little hatch on the bottom that allows you to put in or take out the battery and memory card. That said the first run with it was trouble free, the operating features on the camera worked very well and the images without adjustment were quite clear. Transferring photos off was as easy as using the included cord to connect to a computer and letting the computer 'find' the camera. Form there it was like accessing another hard drive. So far so good, in a few months I'll come back and re-reveiw pending some field service. 4 stars at the moment more possible depending on how this camera works out.", "Date": "September 5, 2013"}, {"Title": "Get what you pay for, disappointed.", "Author": "leah baltazar", "ReviewID": "R2R40QE0M2VRFP", "Overall": "2.0", "Content": "It is an okay camera. The quality of pictures it can take is less than that of my iphone 5. I dont even use it because my phone can take better pictures! Disappointed.", "Date": "August 28, 2013"}, {"Title": "Canon Powershot A2200", "Author": "James Byrne", "ReviewID": "R2LAFLK4RRYS6D", "Overall": "4.0", "Content": "This is the second A2200 camera that I have purchased as a gift for a family member. The camera is a very good value, easy to use, and exceeded the high expectations of each recipient. The custom battery lasts a long time and comes with its own charger.  It is far better than other digital cameras that we have purchased in the past three years. The camera is also small and it has very good buttons. Oh, and it takes great photos!", "Date": "August 5, 2013"}, {"Title": "Exactly as described", "Author": "Frank", "ReviewID": "R1THY3DWRA10O5", "Overall": "5.0", "Content": "I got this camera for a great price and it served me well on a few trips I have been on already. Great quality pictures!", "Date": "August 5, 2013"}, {"Title": "Canon Powershot A2200 14.1 MP Digital Camera with 4x Optical Zoom", "Author": "Jim Stafford \"Longhorn2002\"", "ReviewID": "R2T7RNYQTKZO86", "Overall": "5.0", "Content": "GREAT CAMERA, TAKES WONDERFUL PICTURES, I THINK IT'S SILLY TO HAVE THEM PRICED BY COLOR, BEING AS THEY ARE ALL THE SAME CAMERA.MINE DOESN'T LOOK BLUE, IT LOOKS PURPLE!OTHER THAN THAT IT'S A WELL PRICED CAMERA AND WILL DO WHAT YOU NEED IT TO DO", "Date": "August 3, 2013"}, {"Title": "I love it", "Author": "Marian Nufer", "ReviewID": "R2PHM0I4BCK88F", "Overall": "5.0", "Content": "I'm so happy to have a camera I can carry in my purse and still get good pictures! It's great.", "Date": "July 20, 2013"}, {"Title": "slight lag time between firing and pressing firing button", "Author": "Andrew Schaeffer", "ReviewID": "RJCZ41XT5S6HX", "Overall": "4.0", "Content": "I use this camera on a daniel reetz diy bookscanner setup.  The speed at which it takes pictures is sufficient.  The time it takes to flip a page in between shots usually compensates for the slight firing lag time.", "Date": "June 21, 2013"}, {"Title": "Works Well", "Author": "dovh49", "ReviewID": "R2KO7IKHFAZYEE", "Overall": "4.0", "Content": "I've been using Canon Powershots for a while. This one seems to works just as well as the others. Although the \"easy\" setting doesn't seem to be a nice as the previous \"auto\" setting on previous cameras. But just as a general user I like it.", "Date": "June 18, 2013"}, {"Title": "good camera for the money", "Author": "Jeff Pugmire", "ReviewID": "RB6RYJG9JZ9L5", "Overall": "5.0", "Content": "Very nice inexpensive point and shoot camera.  Very easy to get pics off of it. Like the red as well.", "Date": "June 9, 2013"}, {"Title": "Excellent buy!", "Author": "ColeMc3 \"Cole\"", "ReviewID": "R3CKLIBY98XZQJ", "Overall": "5.0", "Content": "For less than $100 this camera is so awesome. The pictures are clear and crisp, even without the flash. Taking videos is a snap and it has some good refining settings that are helpful. I especially love the custom timer...I can take multiple pictures at a time with one timer setting. You will like this camera I guarantee it.", "Date": "June 5, 2013"}, {"Title": "Good everyday camera.", "Author": "Gustavo Tamborlim Simoes", "ReviewID": "R33JD7GPHLS8JK", "Overall": "4.0", "Content": "Nice product,  with the known Canon quality. Doesn't have many features but it's very rugged and takes care of day-by-day needs.", "Date": "June 3, 2013"}, {"Title": "White dot on camera lense", "Author": "rockstar", "ReviewID": "R38XBY6KMAGO82", "Overall": "3.0", "Content": "Make sure lense is clear. otherwise you can see a small white dot on all videos. Rest of the things are really very good. Thanks Seller", "Date": "May 31, 2013"}, {"Title": "Canon Powershot A2200 14.1 MP Digital Camera with 4x Optical Zoom (Red)", "Author": "nadine charles", "ReviewID": "R2S35IP8U5WXHP", "Overall": "5.0", "Content": "bought this for a friend she loved it, and she got exactly what was advertise on the picture, thanks happy customer, it was a bundle too.", "Date": "May 22, 2013"}, {"Title": "Great camera!", "Author": "Carol", "ReviewID": "RV5T1ILB68YP4", "Overall": "5.0", "Content": "I have one and bought one for granddaughter and grandson, and they all love it. Easy to use and excellent sharp pictures! Carry it in my pocket and wouldn't be without t!", "Date": "May 1, 2013"}, {"Title": "I love the Camera, but it is NOT Silver!", "Author": "Andrew W. Harris Jr.", "ReviewID": "RSUJMVHI33COV", "Overall": "5.0", "Content": "I have had great experiences with Canon Cameras and wanted another to use to take my photos for my bodybuilding.com webpage. I ordered the camera in silver. However, when the camera shipped it was red! While I am not happy that the color substitution was made with NO explanation, I did not have the time to return the camera in order to receive the color I requested. It takes beautiful photos and I constantly get great comments about the quality of my pictures.", "Date": "April 16, 2013"}, {"Title": "Nice Camera", "Author": "Mehrnaz", "ReviewID": "R29AUXPU0Y4RG6", "Overall": "5.0", "Content": "I take unforgettable pictures with this cute camera.  It is so easy to operate it and I am very happy.", "Date": "April 14, 2013"}, {"Title": "Great point and shoot camera", "Author": "Mah Jongg Girl", "ReviewID": "R1MFQ3E5XJQD8R", "Overall": "4.0", "Content": "I bought this camera for a vacation, and it lived up to its promises.  It's small, lightweight, easy to use, and perfect for my point-and-shoot needs.  I find the buttons a little small for my arthritic fingers to manipulate, and the color a little dark to see the buttons clearly, but I think it's a great camera for most novice or casual photographers.", "Date": "April 1, 2013"}, {"Title": "Good quality", "Author": "Valarie", "ReviewID": "R2GN7EYF1EWO6A", "Overall": "5.0", "Content": "I haven't used it much since I received it a few days ago. But, from what I've seen it looks great. The color is better than the picture's color imo. I wanted the black camera at first, but, settled for blue because of the prices. I don't regret it.I'm excited to actually put this baby to good use!", "Date": "March 25, 2013"}, {"Title": "Camera", "Author": "Raul", "ReviewID": "R1D9F5EF1TO6S0", "Overall": "5.0", "Content": "Works amazingly and is awesome.!!!! I recommend this product for anyone wanting a simple but awesome camera. This camera is simply the best.", "Date": "March 21, 2013"}, {"Title": "So happy", "Author": "wanda  martinez", "ReviewID": "R2MZCSZ1NCG4D6", "Overall": "5.0", "Content": "We love it...the price and quality are so good ....thank you so much!!! We recommended this product to our friends and family", "Date": "March 17, 2013"}, {"Title": "Good for what we needed it for", "Author": "Brett Lofgren", "ReviewID": "R3QN0PLA2UAJBQ", "Overall": "4.0", "Content": "My wife and I were teaching in Korea and our camera broke. We were going to be traveling more around Korea and then in Europe and needed a camera! It is a very good camera-easy to use, takes quality pictures, and just overall does the job. However, after arriving back in the States, our iPhone takes clearer pictures. As far as point and shoots go, this is a very good one and we would recommend it.", "Date": "March 8, 2013"}, {"Title": "no me gusto", "Author": "FRANK CARDOZO VENEZUELA", "ReviewID": "R166ZTTSSD8D0Z", "Overall": "1.0", "Content": "I am not satisfied because only sent the camera battery charger. not send the installation CD, or USB cable or adapter so the tv qualify with a star and do not recommend them.", "Date": "February 13, 2013"}, {"Title": "Celia", "Author": "Celia Jacome", "ReviewID": "R3J9HOO9M9KK4N", "Overall": "5.0", "Content": "Excelente cámara de 14MP, lo más atractivo es que es de excelente marca y tiene un precio muy económico, la recomiendo.", "Date": "February 11, 2013"}, {"Title": "should state that it needs a memory card", "Author": "D. Irby \"Searcher\"", "ReviewID": "R15XE2JNT23LL9", "Overall": "4.0", "Content": "Excellent product but in order to use it you must first buy a memory card.  Other then that its a very good camera", "Date": "February 6, 2013"}, {"Title": "CAMERA", "Author": "WILLIAM NANNEY", "ReviewID": "R1BBK0DASP23C0", "Overall": "4.0", "Content": "WORKS FINE, NOT AS GOOD AS THE KODAK 1033, BUT WORKS FINE.  I WOULD RECOMMEND IF YOU WAND A POINT AND SHOOT.", "Date": "February 3, 2013"}, {"Title": "Excellent!!", "Author": "José Mendoza", "ReviewID": "R1DZTQVRFQQXQ8", "Overall": "5.0", "Content": "High quality camera, hight quality pictures!! excelents configurations options to make your pictures better!! came with al its accesories i recommend!!", "Date": "January 31, 2013"}, {"Title": "Good", "Author": "Brat79", "ReviewID": "R247LAEJIMDI0G", "Overall": "5.0", "Content": "I love this. It is the first camera I have bought in a long time, and it works great. The photos do have a habit of coming out pixelated though, and I am still not sure why as it isn't all the time, but it is easy & convenient.", "Date": "January 23, 2013"}, {"Title": "Good camera", "Author": "Mr Happin Shamory", "ReviewID": "R1WEWYYJ45Y387", "Overall": "3.0", "Content": "It works well, output nice prints.  Only wish it had internal memory.Shooting and recording time is excellent with the battery.", "Date": "January 9, 2013"}, {"Title": "It's a good camera and very compact", "Author": "Mauricio Dardon", "ReviewID": "REIMRTO0OES5V", "Overall": "4.0", "Content": "I like it because is  compact and fit in my pockets.  The price and delivery were so good. I recomended this camera, just need a SD memory because not included in the box.", "Date": "January 8, 2013"}, {"Title": "SUPER!!", "Author": "Heide", "ReviewID": "R2ORR4MUMVYZW3", "Overall": "5.0", "Content": "This was an absolute steal for the money. I use this everyu holiday and major event. I take it out into the park and use it for still life pics. Focus opts. great. easy to carry. battery life last long. I am very happy with my purchase.", "Date": "January 4, 2013"}, {"Title": "Very nice camera for the money!", "Author": "Kyle", "ReviewID": "R5F1I4RI326KV", "Overall": "5.0", "Content": "Canon quality and easy to use.  I own 2 of these and they have been excellent cameras.  They don't consume batteries like they're going out of stye and take fine pictures.  Definitely would buy again.", "Date": "January 2, 2013"}, {"Title": "Too slow and feels cheap", "Author": "Greg", "ReviewID": "RO64IEMU6U1G5", "Overall": "2.0", "Content": "It's a cheap digital camera that feels like it's made of cheap plastic and is very slow to respond. You have to wait at least a full second between taking pictures, which is not good when you are trying to get any kind of action shot, even with the supposed action mode. I would spend the extra money and get a camera that is capable of recording 1080p video as well, and that isn't made entirely of plastic.", "Date": "December 19, 2012"}, {"Title": "Happy", "Author": "Richard Workman", "ReviewID": "R14LZPAME8DR5I", "Overall": "5.0", "Content": "Great camera at a great price...we are very happy with this purchase. The video feature works surprisingly well... overall very user friendly even for someone who has never owned a digital camera.", "Date": "December 19, 2012"}, {"Title": "Given as a gift to a little girl who wants to take photos of her baking adventures", "Author": "SYBIL BLAZEJ-YEE \"A librarian and dog walker\"", "ReviewID": "R1I9W7GPX3R0RI", "Overall": "5.0", "Content": "I gave this digital camera to a ten year old who wanted to take shots of her delicious baked goodies that she was making with the possibility of using the photos in a kids' cookbook.  Nice, easy to use, compact and ready to carrywherever you go.  Thanks Canon!Sybil Blazej-Yee, Librarian, Artist and a Dogwalker and a Children's Book Author", "Date": "December 7, 2012"}, {"Title": "Ok", "Author": "Kent", "ReviewID": "R1HYP1LJPDYPLL", "Overall": "3.0", "Content": "I probably wouldn't buy this camera again, no issues, but just has afew features that are cumbersome. It doesn't take as good as pictures as my other canon camera, altho that one is much more expensive which is the powershot elph 300 HS. That camera is super good.", "Date": "November 28, 2012"}, {"Title": "!My Friend in Havana Loves It!", "Author": "Michael N. Landis", "ReviewID": "RFN5PHI0O2V7A", "Overall": "5.0", "Content": "I bought the camera for a friend I stay with in Havana.  To see him opening the package was to be transported back to my own childhood on Christmas morning!  Despite its modest \"point and shoot\" technology, already he  has created many memorable fotos, and a few videos, the best of which he incorporated onto a disc for me. He has artistic talent, even making the ten semi-finalists and honorable mention in a photo contest sponsored by the HavanaTimes.org.  His last--and first--digital camera was lost by a friend to whom he lent it, so now he's back in business.  He'll be sending me additonal fotos as e-mail attachments, so I look forward to a continuous flow of images from my \"home away from home.\"  Finally, I am so glad I was able to give him this gift, since he and his wife nursed me back to health through \"green\" (rather than, as he says, \"industrial\") medicines (leaves and roots from trees, bushes and herbs on his property), after a particularly severe bout of gastro-intestinal problems this last trip (Sept-Oct. '12).", "Date": "November 4, 2012"}, {"Title": "nice camera for the price", "Author": "Sue B", "ReviewID": "RPLCVGD3NNQG7", "Overall": "5.0", "Content": "My old Canon s400 elph stopped working and I needed something to take pictures with..this was a deal at $69..it is a nice camera,easy to use. The layout is basically the same as my old one so I didn't have much to learn,there is a learning curve with any new device,so take the time to play with it to understand how it works. The pictures are great,there is a difference from what you see on the LCD to uploading to your computer, but have some fun with it. I'm happy with it but all my cameras are Canons as are my printers. :)Canon PowerShot S400 4MP Digital Camera w/ 3x Optical Zoom", "Date": "August 10, 2012"}, {"Title": "GOOD Enough", "Author": "Elsie Jasmin", "ReviewID": "R1SB9I5UIAB55M", "Overall": "3.0", "Content": "I would thought it was be new 2012 type of camera but seem like a 2009 camera but it does work fine. I dont have any complaints for it right now except i need to know how to operate it because it seems so technical.", "Date": "June 21, 2012"}, {"Title": "LENS WILL NOT GO IN AFTER ONLY 45 DAYS", "Author": "Lawanda Youngren", "ReviewID": "R2F9VNHLYITR1", "Overall": "2.0", "Content": "TOOK GOOD PICS UNTIL ONE DAY WENT TO TURN OFF AAND LENS WOULD NOT GO IN - CAMERA LOCKED UP AND WILL NOT WORK AT ALL AFTER ONLY 45 OR 50 DAYS OF USE - LASTED LESS THAN 2 MONTHS AND NOT ABLE TO RETURN FOR CREDIT AFTER 30 DAYS...", "Date": "May 17, 2012"}, {"Title": "Powershot great little camera", "Author": "L. Wells \"travel reader\"", "ReviewID": "R1FC5XPR6TND32", "Overall": "5.0", "Content": "Great little camera for travel, use as family capture...Also works as a first digital camera for a kid. Easy to use, and has rechargeable batteries.", "Date": "April 27, 2012"}, {"Title": "Nice camera!!", "Author": "Frank", "ReviewID": "R3ICLK46DMUDDZ", "Overall": "5.0", "Content": "good product for good money. i bought this for my girlfriend, and she love it. easy to use. not that many features . hey its a cheap one !! what do you expect !!!", "Date": "April 26, 2012"}, {"Title": "Great Camera", "Author": "Joe", "ReviewID": "RHJXAYL1SXYJZ", "Overall": "5.0", "Content": "I recently lost my other camera which was an Olympus and I didnt care much for it anyway. I decided to look for a relatively innexpensive camera. I have had bad experiences in the past with other brands as well. I own a canon printer and its the best printer I have ever had, so I decided to try a canon camera. And I was not dissapointed!! This camera is very light, simple to use. I am no avid photographer but for what I need it for it works great. I take pictures of my friends and I out on our motorcycles, Messing/driving around our classic cars, and I occasionally sell stuff on Ebay. When you zoom in on something it doesnt get grainy like most other cameras I have had in the past. It is very slim to and doesn't create too much bulk in your pocket. Only downside of it is you cannot take any pictures without an SD memory card in it. Some other cameras you can atleast take a few on the camera's memory. But, you cannot with this one. But, Im sure everyone by now has a couple SD cards lying around their houses, and they are really cheap at walmart or target.", "Date": "April 10, 2012"}, {"Title": "Great all around camera", "Author": "EvoBora", "ReviewID": "R1134K869ZSSYU", "Overall": "5.0", "Content": "Have 6 of these in service now and haven't had any issues with them.  They take great pictures, don't have embeded software so it works great with our Symantec SEP and network security structure.", "Date": "March 19, 2012"}, {"Title": "My 8 year old digital camera takes better pictures", "Author": "Tara", "ReviewID": "R2LJZOUXO719NX", "Overall": "2.0", "Content": "Bought this camera last night, and I am going to return it asap. I wanted to replace my 8 year old Sony cybershot camera with 7.2 megapixels and has trouble focusing, so I decided to try this Canon Powershot. The photos taken with this Powershot are blurrier, poorer color quality, grainier, and overall much less quality. I love Canon (my main camera is a Canon DSLR, so I wasn't really wanting to spend much money to replace my small digital I carry everywhere) but the Powershot A2200 ended up being one big fail.", "Date": "March 9, 2012"}, {"Title": "just right", "Author": "alan a tomaric", "ReviewID": "R2241237Z9HARY", "Overall": "5.0", "Content": "even though I own a canon rebel and several olympus pocket cameras,this is a handy, well thought out pocket camera. everything I need for most situations. I got what I expected plus a little more.", "Date": "February 19, 2012"}, {"Title": "neutral", "Author": "Brian", "ReviewID": "RRTQMKOX3Z414", "Overall": "4.0", "Content": "It has worked well.  I bought it for my wife.  She likes the convenience of her android phone for pics and video but she prefers the quality of this camera.  She switches between the two.  The Canon is okay, but I suspect it is just a learning camera for my wife.  She is already wanting something more advanced.  Mega-pixels are not the only indicator of a good camera.", "Date": "January 21, 2012"}, {"Title": "Not Bad At All", "Author": "Peachy Fox", "ReviewID": "R16UD08FCNSGGB", "Overall": "4.0", "Content": "I needed to take pictures for my college graduation and reception, and I felt my old Samsung Digimax 4.0 MP camera was due for a retirement. After reading reviews, I bought this PowerShot thinking it would be somewhat of an improvement. That was an understatement. It's such a great little camera. I'm so used to changing AA batteries every couple of times after using the flash on my old camera, yet the PowerShot didn't need to be charged for weeks after taking hundreds of pictures.Even though it takes great pictures, it has a major flaw, but it's not the camera's fault. If you're not a person who is up to speed on the auto-focus feature on digital cameras, it might take a bit of practice to understand how it works. I let my mom use the camera at my field of study's pre-graduation ceremony and she had such a hard time taking pictures. I had her take a few practice shots the day before and even though she struggled a bit, I thought she would be able to use it well. Nope. She was highly frustrated with the auto-focus and hated the idea of not being able to just point and click. Instead, it's more like point, lightly hold down, wait, then click. After the ceremony, she told me she didn't like the camera at all and would be using the old digital camera from now on (which didn't have the precision auto-focus).My own complaint would be the zoom feature. If you zoom too far, the pictures, even at a far enough distance, come out grainy and fuzzy. Still, it's a great little camera for the price. I originally was going to use the camera for graduation and sell it if I didn't like my experience with the PowerShot. I've had it for nine months so far and I have zero regrets of my purchase!", "Date": "January 16, 2012"}, {"Title": "This is really a great value", "Author": "Preston B. Nalder", "ReviewID": "RZ0PLF7X3F1BI", "Overall": "5.0", "Content": "We paid 80, and this camera has been great for us.  Great pictures and very handy.  We can't believe a camera of this value works so well...", "Date": "January 15, 2012"}, {"Title": "Canon Powershot", "Author": "mhall", "ReviewID": "R3OZIV3HYDXG5F", "Overall": "5.0", "Content": "Camera arrived quickly and in excellent condition.  I didn't notice it didn't come with a memory card, so my daughter couldn't use it on Christmas day.  However, this was clearly listed in the description, so it was my fault.  She has since enjoyed it very much.  Great product, great company.", "Date": "January 4, 2012"}, {"Title": "Great camera for the money, really nice pictures!!", "Author": "Rachel E Hoffman", "ReviewID": "R7HJQ47CPDPLK", "Overall": "5.0", "Content": "I bought this camera to upgrade from an older model.  It is a great point & shoot camera.  It is easy to use, takes really nice pictures & downloading photos & videos is a breeze!", "Date": "January 2, 2012"}, {"Title": "Awesome Camera!", "Author": "Shannon", "ReviewID": "RWNMOWEYA14I2", "Overall": "5.0", "Content": "Great camera - my Mom loved it as her Christmas gift! Nice size screen and beautiful color. It's perfect for her because it's basic and not very complicated. She doesn't like a ton of extra features, and this has options, but it's also simple to use. Overall, great value for the price. Perfect for a person who simply wants a nice picture.", "Date": "December 27, 2011"}, {"Title": "Product worth the money", "Author": "Rags", "ReviewID": "R1DKZOXMY2PACP", "Overall": "4.0", "Content": "Very basic camera worth the money. Go for it, enjoy your trips with easy snapshots.Those who are in need of camera that is too easy to use and not in need of extreme special quality, this is for you.", "Date": "December 25, 2011"}, {"Title": "Love It!", "Author": "loves reading", "ReviewID": "R10OI542YP9XZ1", "Overall": "5.0", "Content": "Easy to use. Pictures turn out very nice. Review of the pictures on the camera is nice and easy. Love that the battery is rechargeable, can't count how many batteries I've been though with my old camera.  Like that when you turn the camera the picture turns to fit the screen, lets you see details better. Love the large screen on it and the slim size. It takes the guess work out of taking a nice picture, red eye is automatic and it steadies it's self so you don't get those blurry pictures. Has some very nice and fun to use features. But it's still an easy to use camera if you want to just use the auto setting you get nice pictures without having to fuss with finding the right setting.  And so happy I waited and got it at a great price makes everything even better with the great price I got. Over all very happy with it and will be using it for years to come.", "Date": "December 8, 2011"}, {"Title": "prefer the Ixus...", "Author": "N. Batcheler", "ReviewID": "R363YVF65X09FG", "Overall": "4.0", "Content": "Bought this as a replacement for a slightly tired Canon Ixus which we've had for five years or so. The A2200 is substantially cheaper than the Ixus was but it shows, it's all a bit plasticky. Seems to work OK though, in that it takes decent photos, so what do you want for $110 or whatever it was. It does seem to take a while to be ready for the next shot, maybe that's because it's writing to the card and I have a slow card? I just bought a Nikon Coolpix S3100 as well which is similar spec, slightly cheaper, and feels a bit more solidly built while being smaller, so we'll see how that works out.", "Date": "November 25, 2011"}, {"Title": "Love the easy settings", "Author": "Ann White \"Ann\"", "ReviewID": "RRA0X007I20ZM", "Overall": "5.0", "Content": "We love this camera. It's much thinner than the old Cannon we had and the settings are easier for me to use! Beautiful pictures and you cannot beat a Cannon.", "Date": "August 23, 2011"}, {"Title": "Good camera.", "Author": "Steven Anderson", "ReviewID": "RCDQX5XDMI99W", "Overall": "4.0", "Content": "I had originally bought another brand but the pictures turned out pixelated when printed so I couldn't live with that so I was told by the sales person at the store I went to to try Canon. It was just a few dollars more so I bought it. So far I'm happy with it. I have read the about the problems with battery but I don't take many pictures so that shouldn't be an issue for me. The things I was looking for was picture quality and ease of use. Those two things seem fine. I am satisfied with the pictures and the settings are fairly easy to set and understand for a none photographer.", "Date": "August 15, 2011"}, {"Title": "Great product.", "Author": "Sandip Shah \"SonyFan\"", "ReviewID": "R2LPQCOU6SQNJN", "Overall": "4.0", "Content": "I actually bought this product for gift. I checked it performance by taking couple pictures, downleaded to computer, the results is amazing. Great product.", "Date": "July 6, 2011"}, {"Title": "Don't Get It.... Mine was only camera that didn't work at Christmas", "Author": "His Royalty", "ReviewID": "R2XK2ELRIMXXC7", "Overall": "1.0", "Content": "This camera IS too sensitive to low light, but not just low light.  At Christmas, several cameras were taking pictures and working fine, but this one was the only one that would not, not only on certain settings but on all of them.  I trust it would work outdoors, but I didn't spend this money to have a camera for 'outdoor use only.'  I'm not super picky about a camera, but if I have one, I do ask that it take photos! Look for a different camera!", "Date": "January 5, 2012"}, {"Title": "GREAT CAMERA!", "Author": "GabVal", "ReviewID": "R2G1ZDCZ1B2IF5", "Overall": "5.0", "Content": "After purchasing three different types of cameras for family use, I decided to keep this one since it gave me the BEST PICTURE QUALITY!!  The others where on the same price range (Sony cybershot, and Nikon), and none of those brands worked very well for what I was looking for.  I take a lot of pictures to my kids and family, we use it for traveling and so far it's been wonderful, I LOVE IT!!", "Date": "July 20, 2011"}, {"Title": "Don't waste your money", "Author": "Redwine", "ReviewID": "R1AONUR23FWC0", "Overall": "1.0", "Content": "I have three of these models that didn't even last for 6 months, one lasted three weeks. There is an issue with the lens retracting system. I contacted Canon with no results. Don't waste your money.", "Date": "May 28, 2013"}, {"Title": "Wrong parts sent", "Author": "Casey", "ReviewID": "R346HU8VAWELK8", "Overall": "1.0", "Content": "The camera I purchased was sent with a charger that was not a cannon charger. Let alone, a charger that wasn't even compatible with the camera's battery. When I contacted the sender, his response was ' did u plug it in from the wrong direction?' REALLY.... I'm still waiting to see my refund.", "Date": "December 15, 2012"}, {"Title": "great little camera", "Author": "light", "ReviewID": "RCT07UP6INT2A", "Overall": "5.0", "Content": "The camera arrived in about 2 days, instead of the 5-8 days. which was awesome since I bought this item as a gift. The family who got the camera loves it. They really like the rechargeable battery and the fact that the menu is easy to use.", "Date": "June 23, 2012"}, {"Title": "Missed photos", "Author": "Jeff S Mueller", "ReviewID": "R15H54KHMSHC0V", "Overall": "3.0", "Content": "This camera does not click fast enough. The best picture was the one you tried to take 3 seconds ago. Clicking the camera did not take the photo instantly it delayed the shutter. I also had more blurred photos than I had with other cameras.", "Date": "January 1, 2012"}, {"Title": "GOOD CAMERA", "Author": "Aldemar", "ReviewID": "R5SSMK3JG6BZZ", "Overall": "5.0", "Content": "MUY BUENA CAMARA, PEQUEÑA Y BIEN FUNCIONAL, LES RECOMIENDO YA QUE ES DEL TAMAÑO DE UNA TARJETA DE CREDITO Y TIENE MUY BUENA DEFINICION EN SUS IMAGENES", "Date": "December 16, 2011"}, {"Title": "Love It!", "Author": "Jonathan Plazewski", "ReviewID": "R3S1LN68A7NO4U", "Overall": "5.0", "Content": "I got this camera a few days ago and absolutly love it. I was considering the Canon Powershot A3300 16 MP Digital Camera with 5x Optical Zoom (Black) but decided to stick with the less expensive A2200 and it has exceeded my expectations. Just the past few days I have taken some great pictures. I'm so glad I purchased this.", "Date": "May 30, 2011"}, {"Title": "Broke in a week", "Author": "K. Downer", "ReviewID": "R1A24Q19F6073R", "Overall": "1.0", "Content": "I used the new camera for about a week until the lense got stuck open, rendering the camera useless. I will be returning it.", "Date": "June 15, 2011"}, {"Title": "Grainiest photos I have ever seen", "Author": "Aaronb483", "ReviewID": "RJIBNUHZ0TJK6", "Overall": "1.0", "Content": "I love Canon products, but this camera produces the grainiest photos. I know 14 megapixels is a lot for a small chip. But I never thought it would be this bad.Please leave a comment if you think I have a bad camera or I have it set wrong.", "Date": "November 6, 2011"}, {"Title": "Piece of junk", "Author": "Dirk Grupe", "ReviewID": "R2OHKDGE7164Z5", "Overall": "1.0", "Content": "To start with the positive aspects of this camera first, it has a nice red colorand the time is in 24 hours and you can also adjust the date format. It alsoallows you to define a lot of settings yourself, so you do not have to dealwith automatic settings. Also it has a relatively large display so you can viewthe image. I also think it is quite easy to operate in general. To set thebasic shooting modes with a little wheel is a very good idea.However, otherwise it is basically a quite expensive piece of junk!It is probably one of the slowest digital cameras on the planet.I don't know what happened to Canon, but theymust have thought to design a retro-camera with readout out times you had withthe first digital cameras about 15 years ago. Unbelievable! If you want to makeany kind of photo of a moving object it will be moved out of the picture by thetime you can shoot the photo. Even if you try to take a photo of a static objectthe quality of the photo is poor. It is grainy, noisy, and blurry. I have setthe camera to 80 ASA, the Fine resolution and 14.1 Mpix and still got grainynoisy photos. The optics is poor, too. All photos show a blurring which you'llget from scattered light in the optical system. My son has a$25 Vivitar camera which is not only significantly faster, but the images areonly slightly worse. Now you won't expect an excellent photos with a $25 camera, butyou can expect some decent shots from a $100 camera. We also have a 4 year old Canon SD 1100ISwhich is a good camera, so I did expect that in 4 years Canon would haveinvested some money into development. Well, they did, for some gimmicks, like atoy camera effect of softening for portraits. However with this camera this is apermanent feature. Instead of wasting money for gimmicks like this it would havebeen better spending the money on developing better optics, CCDs and readoutelectronics. The A2200 is basically useless, except if you like grainy, blurryimages of something that does not move. Then this is the camera for you.So as a conclusion, the A2200 looks nice but that it. Otherwise I would notrecommend this camera at all. It's a complete waste of money.My wife actually returned it back to Walmart and got a blender instead. The money iscertainly better spend that way.", "Date": "January 4, 2012"}, {"Title": "The manual could be better.", "Author": "Life long reader \"Bill\"", "ReviewID": "R1HQK7BWYL1RGF", "Overall": "3.0", "Content": "I worked in a photo lab for several years and took thousands of images.  I have enlarged several, which are now hanging on our walls.The digital age has arrived now, and I welcome it.First, I like the cameras' size.Getting started, the manual states that the date, when entered will hold for a long time.  As the manual stated, I removed the battery when not in use.  After reinserting the battery, the date shows up blank.  This has happened a number of times.  I am missing something.  I noticed that the manual was printed in China, which could present a problem.  I then installed the CD on the computer, and after a number of steps involving registration, the message came on screen that no brochure was available.  Has anyone else had similar concerns?", "Date": "December 25, 2011"}, {"Title": "Canon Powershot  A2200", "Author": "lydia", "ReviewID": "R31LE0DPLGSWUJ", "Overall": "5.0", "Content": "I just bought this canon powershot A2200 yesterday. I love the functions, the easy to use buttons. I cannot wait till tomorrow to go and take pictures.I love the size of the camera and needed a small camera besides my Nikon D50 which is sometimes awkward.  I returned the Kodak camera and decided to try Canon!! I had a canon many years ago and remember how sharp the pictures were!!", "Date": "November 8, 2011"}, {"Title": "Good value", "Author": "Harry", "ReviewID": "R313DKMQT9FPZB", "Overall": "4.0", "Content": "Got this camera for my friend but had to do some testing before i could give it to him, so I took a few shots and tested all the features in it. I liked the Macro feature in this camera- it was really cool that a camera with less complexity could do it. Had an ideal flash for night time pictures. Overall I would recommend anyone to buy this. But would have been glad had a got an SD card with this.", "Date": "March 28, 2011"}, {"Title": "stupid", "Author": "soni abraham", "ReviewID": "R87WSZCEQMEH3", "Overall": "1.0", "Content": "cheating,this one never working,no battery inside,click button is not functioning,led screen completely scratched,i hate it ,they said it is look like brand new but nasty", "Date": "March 6, 2013"}, {"Title": "Great camera takes nice pictures", "Author": "austin83339", "ReviewID": "R2RZWSC03NNZFC", "Overall": "4.0", "Content": "got this for my mom for Christmas easy to use and takes nice pictures. Camera is great but description was a little vague and had several scuffs on the screen but overall a great camera.", "Date": "December 31, 2012"}, {"Title": "don't buy refurbished!", "Author": "lilkonza", "ReviewID": "RNABSSIM4CQH7", "Overall": "1.0", "Content": "Received a broken item.  The on/off button is defective.  Not a good bargain since I still don't have a camera and will have to pay the local camera shop to fix the button.", "Date": "June 15, 2012"}, {"Title": "Dayenu (for better or for worse)", "Author": "Brian Connors", "ReviewID": "R11HG967WW8CVD", "Overall": "4.0", "Content": "I went into this with an interesting problem. You see, the A2200 is a reasonably solid camera with surprisingly good picture quality for the fingernail-sized sensor, which is par for the course with Canon; the optics are about equivalent to the kit lens on an EOS Rebel DSLR, so although you won't be reading shelf tags from 50 feet away, you can still print out a pretty good sized blowup of any given shot. If you don't need 1080i video out of a pocket camera, this is pretty much all the pocket-sized camera you'll need. (Yes, it's pretty slow on the draw, but if you need speed, consider moving up to a system camera, or at least a bridge camera like the SX40.) The 14.1Mpx resolution is excessive bordering on ludicrous, and unless you need HDMI out (in which case you should move up to the Elph/Ixus series), you're not going to need much more than this. (Which is not to knock the A3300, but...)But one of the big selling points of Canon's 2011 A-series (at least from the 1200 up) is the addition of what Canon calls Creative Filters -- a series of special effects that mimic some of the capabilities of other cameras. That's the sticking point here, and, well, apart from fisheye (which works well enough to avoid spending gazillions on a fisheye lens for your DSLR) and the monochrome settings (bluescale is an interesting touch), most of it is fluff. The miniature setting, for example, is meant to duplicate the miniaturizing effects of shooting long distances with a macro lens, and really kind of doesn't work. The toy camera setting (probably the feature that will most jump out at a prospective buyer) is, to put it politely, fraudulent; it's like a Budweiser version of a Holga. It lacks the unpredictability that makes toy cameras popular, and the aggressive vignetting is a little too extreme unless you crop back to a 120-like square frame. (It also seems to pull some strange optical tricks when used with a flash and sharp corners, but I don't think I could reproduce that if I tried.) The Live View mode is much more useful if you want to tweak the colors to get that expired film look. The Discreet mode is a very nice feature indeed, perfect for taking into a store and taking picture notes of price tags or other sneaky behavior that you'd normally pull with a cell phone. Video quality is okay, not spectacular; the lack of image stabilization and live video zoom on this model makes it more of an afterthought than a useful feature, though it should work fine on a tripod.I was not able to test some of the more esoteric capabilities; the CHDK port for this model is painfully buggy (a supposedly-usable version shipped a couple days before this review but I haven't installed it yet), and from what I understand raw pictures come out with badly garbled color data, rendering them essentially useless for any purpose but debugging. One-handed operation is clumsy (one attempt while writing this review accidentally triggered the onscreen clock function) but workable with some practice. The software is the same software that Canon ships with all their cameras; I can't speak for the Windows side, but ImageBrowser for Mac has most of the same functionality as iPhoto, only a bit less polished.So, in conclusion, if you need an inexpensive pocket camera, the A2200 should be everything you need. You won't go wrong with it, although some of the features it includes are vastly overrated. (Expect to be laughed out of the room if you're entering your photos in a low-fi photo competition; it's incapable of sucking enough to do the job right.) For that reason, I have to give it only four stars. If all Canon had given us was a solid replacement for cameras like my old, beat-up A3000IS... well, you read the headline, but...", "Date": "December 20, 2011"}, {"Title": "GREAT LITTLE CAMERA", "Author": "washercan4", "ReviewID": "RP1MTULDIUGWW", "Overall": "5.0", "Content": "My husband and I love this camera! It is small and compact, and takes wonderful pictures. We love the high quality of video it takes! Perfect camera for perfect price!!", "Date": "May 21, 2011"}, {"Title": "Missing Battery", "Author": "ASEEM DAYAL", "ReviewID": "R1A5BLMY47UPAG", "Overall": "1.0", "Content": "Hi , I just wanted to let you know ,  I had presented this camera to a overseas friend of mine ; he informed me that the package was missing the battery. He ended up purchasing  a new battery from a  local store - It is an embarrassment for me :-(", "Date": "November 5, 2012"}, {"Title": "You can't change the file resolution", "Author": "miatamiata", "ReviewID": "R1Y9OHM0XXT48A", "Overall": "3.0", "Content": "Pros:- Price- photo quality- rechargeable battery and charger- compact- nice looking- easy to useCons:- cannot change the file resolution, so you end up filling up cards and disk more quickly than I would like. The quality is decent for the price, but I wish there was the option to save as a 4-6Mpixel file.", "Date": "August 10, 2012"}, {"Title": "mid price, low quality", "Author": "Aric", "ReviewID": "R3J6B5FNIMYL9J", "Overall": "1.0", "Content": "I have Nikon D40 DSLR. I figured I should have something compact for trips and such.It produces the lowest quality pictures I ever saw, especialy in low lighting.Stay away from this camera !!!", "Date": "August 8, 2012"}, {"Title": "Very unsatisfied--From a digital camera owner of many models", "Author": "H", "ReviewID": "R2ESNJILSKDER8", "Overall": "1.0", "Content": "As a digital camera owner of many different models, owned several models from Canon(A series, S series and dSLR), nikon and fuji, too, this Canon A2200 is very disappointing. It's very hard to focus in low light conditions and even harder when making a video in low light. And the sound is very bad when making a video, very muffy and not consistent. I used my very old Canon SD1000 and this new Canon A2200 to take videos at exactly the same time and the SD1000 gave perfect focus(no pre-focus needed) and sound effect(clear and crispy, nearby or far away sounds). But the Canon A2200 gave very unclear sounds and it took forever to focus when taking a pic or video.Stay away from this A2200. Very disappointed with Canon this time.", "Date": "July 3, 2012"}, {"Title": "A Gift", "Author": "Eviebarbi", "ReviewID": "R369AYF6AYGU8H", "Overall": "4.0", "Content": "This is a gift so I don't know how well the camera works but I noticed that the body is cheap. Seems like made of thin metal case like a toy. No SD Card either. Perhaps new cams don't get them. But I like the color, it's Dark Purple/Blue.", "Date": "August 22, 2011"}, {"Title": "Canon Rocks", "Author": "ecreed", "ReviewID": "R2Q0CVVZVZMDPC", "Overall": "4.0", "Content": "Its a great little camera. Takes sharp pictures.  I wish I had waited to purchase it, however.  I could have gotten it $40 cheaper locally at Target.  I wish Amazon had a price garantee.", "Date": "May 15, 2011"}, {"Title": "Worst Canon Ever", "Author": "Izabella Medvinsky", "ReviewID": "R1EHSUNA8EUWDG", "Overall": "1.0", "Content": "I have had many Canon cameras throughout the years (my unfortunate tendency to take them everywhere means they get banged up a lot).  And I've always been satisfied until this one.  It is HORRIBLE.  If there is any sunlight at all, the pictures come out completely white.  It does not register the color green for the most part.  Worst of all, the videos taken are in some primitive format that I've no idea how to work with - what on earth was wrong with AVI?  I am going ot be buying a new camera come Black Friday, because I just can't stand this one.", "Date": "September 29, 2012"}, {"Title": "ddd", "Author": "daimar", "ReviewID": "R6KRS4EU2JPWM", "Overall": "5.0", "Content": "todo super bien, todo llego en muy buenas condiciones y con todos sus accesorios, todo super bien, todo llego en muy buenas condiciones y con todos sus accesorios, todo super bien, todo llego en muy buenas condiciones y con todos sus accesorios", "Date": "February 16, 2012"}, {"Title": "xmas gift", "Author": "tigger", "ReviewID": "RUPRFFL9FI04V", "Overall": "5.0", "Content": "This was a gift. So I have not actually had an opportunity to test it out.  It did arrive promplty and with all the accruments listed.  Well packaged and the received appeared pleased.", "Date": "February 1, 2012"}, {"Title": "camera dead in a weak", "Author": "canonfail", "ReviewID": "R1K7HO305Z1NWY", "Overall": "1.0", "Content": "This product went dead in 20 clicks....did not expected this from CanonPictures were very nice, video was good too but ZERO reliability", "Date": "July 23, 2011"}, {"Title": "Mala calidad de imagen pesima mejor toma las fotos mi Blackberry 8900 javelin", "Author": "OSWALDO J. ZULETA C \"Oswaldo Zuleta\"", "ReviewID": "R3POW7Z7Z1M89", "Overall": "1.0", "Content": "pesima calidad de imagen no recomendada no la compren mi telefono toma mejor las fotos 8900 javelintube una canon mas vieja y era de 8 mp tomaba las fotos 100 veces mejor que esta parece clon china", "Date": "January 21, 2012"}, {"Title": "Exelentee", "Author": "keilis", "ReviewID": "RF19ZINEC75YZ", "Overall": "5.0", "Content": "Exelente !!! un producto de buena calidad, llego es perfecto estado los recomiendo desde venezuela, Gracias por la venta muy puntual", "Date": "February 5, 2012"}, {"Title": "Not a point-and-click", "Author": "contractswriter", "ReviewID": "R1SAL4HB92ZD8D", "Overall": "1.0", "Content": "Unfortunately I had to return this camera. It's not a simple point-and-click and the \"auto focus\" isn't quite what it's touted to be. You have to hold the shutter button down half way until it finds it's focus and then take the picture. We read the manual, tried different settings, and it's just not an easy camera for action shots (most of our pictures are action). It was a great little camera/video otherwise, but not what we needed for easy and quick photos. 3/4 of the photos I took at a wedding were blurry, didn't matter if they were inside or out.", "Date": "November 1, 2011"}, {"Title": "i don't remember dates..", "Author": "bugbama", "ReviewID": "R1J7MESITQ9N1B", "Overall": "4.0", "Content": "Does anybody please tell me if you can put the DATES in the picture of this camera. I have canon sd600, but won't print dates on the picture. It is important to me to see the dates of its photos that I have taken so I could keep track of my two girls progress. Thanks i am disperate to know.", "Date": "May 30, 2011"}, {"Title": "WARNING!!", "Author": "JenJan", "ReviewID": "R1XWUJ2MTUE13D", "Overall": "1.0", "Content": "I just recently bought this camera for my mom on Mother's day and it was a total waste of money! The first time she used, she loved it and the pictures came out great! We went to a concert last week and brought the camera (second time using it) and right when we turn it on THE LENS JAMMED and now it won't work. We keep receiving a message that states lens error and restart camera. Mind you, we have NEVER dropped the camera and there was no dirt or anything on the camera. It was in perfect condition! I decided to do some research to see if I could fix it myself and it turns out that a lot of their Powershot cameras have this issue and people want to charge $100 just to fix it! Might as well buy a new camera. But I'm definitely not going to buy a Canon!", "Date": "May 29, 2011"}, {"Title": "This is now my favorite camera", "Author": "sveeds", "ReviewID": "R2II6CB0XPEI8N", "Overall": "5.0", "Content": "This camera has so many different functions it makes taking pictures a breeze.  I was able to take a clear picture of the moon which was really cool.  Also with the software that came with my canon printer I am able to take pictures from a video.  Very good purchase.", "Date": "February 12, 2012"}, {"Title": "NOT VERY CONVINCING ME", "Author": "Nay Venezuela", "ReviewID": "R8Z4RYFRO5Z6F", "Overall": "3.0", "Content": "OTHER COMMENTS I HAVE READ AND AGREE WITH THEM, INDOOR CAMERA IS VERY POOR IMAGE DESIGN IS SEXY BUT NOT MEET MY EXPECTATIONS EXPECTED OF CANON", "Date": "January 31, 2012"}, {"Title": "Fits the introduction perfectly.", "Author": "Birjan", "ReviewID": "R1SS9NDQKVPP9G", "Overall": "3.0", "Content": "Everything in its place and the item is exactly it is introduced. The camera is not good. I do not like the quality of the pictures. It takes pictures with 7 Mp, it seems.", "Date": "August 3, 2011"}, {"Title": "DISAPPOINTED", "Author": "Michelle Armstrong", "ReviewID": "R27T2OCBUU66FY", "Overall": "2.0", "Content": "I've never written a review before, but I had to share my disappointment with this camera!  I have owned Canon Powershot cameras for over 8 years but the quality of this was is so poor that I'm returning it to Amazon!", "Date": "July 9, 2011"}], "ProductInfo": {"Price": "$139.00", "Features": "14.1 effective megapixels, 1/2.3-inch CCD image sensor; 4x wide optical zoom and 4x digital zoom\n2.7 in. TFT LCD with wide viewing angle; Built-in flash; 720p HD video\nDIGIC 4 Image Processor; Discreet Mode disables sound, flash and AF beam\nSmart Auto (32 scenes); Creative Filters\nUSB 2.0 Hi-Speed; SD card slot (card not included)\n14.1 megapixels with 4x wide-angle optical zoom (28mm wide)\nRecord movies with 720p HD video\nSmart Auto intelligently selects settings from 32 predefined shooting situations\nLarge, clear 2.7-inch LCD\nDiscreet Mode disables the sound, flash and AF beam for use in quiet areas", "Name": "Canon Powershot A2200 14.1 MP Digital Camera with 4x Optical Zoom (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41rP7LuIKtL._SY300_.jpg", "ProductID": "B004HW73QQ"}}