{"Reviews": [{"Title": "GREAT camera. cheap accessories", "Author": "Salfa", "ReviewID": "R24QKXEYM3V12C", "Overall": "4.0", "Content": "I knew about the camera before I purchased it. My mom owns one. The camera itself is amazing. However, the accessories lack quality. The zoom lens works just fine and has amazing range for the price. The card is a lower end brand but is all you'll need unless trying to get the best you can out of the 1080 video feature of the camera. The bag is okay but one of the clips that hold it shut broke rather easy, so be easy on it. The tripod stripped out very quickly so I can't use it with the zoom lens where I need it most. You will need to cut the screen protector to fit the screen. It is a universal protector. The video is good if your a beginner and would like to learn more about how to use the camera's settings properly. OVERALL: Even though the accessories lack quality, I am satisfied with the product. Was worth the money.", "Date": "September 25, 2011"}, {"Title": "Great Setup for beginners", "Author": "Alan Sprague \"Fixitman\"", "ReviewID": "R3GK79WBWXZC0B", "Overall": "5.0", "Content": "I have never owned an expensive camera before, but decided the kids are growing like weeds and I want great pics now. This kit comes with everything I needed to get going. It took me about an hour to read the basic use instructions, but it was very easy to get going. I need a lot of practice, but used it at two track meets, and the pics are fantastic! I only wish I would have gotten it a few years ago. I have yet to watch the DVD that came with it, but I know that will help quite a bit.", "Date": "May 11, 2011"}, {"Title": "Asavings", "Author": "William McCullough", "ReviewID": "R6E5F18SYASJ1", "Overall": "4.0", "Content": "I wrote on my first review that my camera bag had a broken strap. Vendor refunded me for the bag AND sent me a new one. I am very grateful for the service from them. I am enjoying the camera but haven't been able to figure everything out about it. Am taking a class to better understand it.I recommend this vendor.", "Date": "November 27, 2012"}, {"Title": "Great so far.", "Author": "Mary C.", "ReviewID": "RV3EEUODBBVHZ", "Overall": "5.0", "Content": "I bought the Nikon D3100 because of the reviews.  I have a digital point and shoot camera that I am very happy with, but wanted to advance my photography.  I got it out of the box. Put it together and was able to take some pictures to make sure it worked.  This is a Christmas present for me.  I shopped for the best price and Amazon was it.  I plan on taking classes to get the most out of this camera.  Wish me luck.", "Date": "August 29, 2011"}, {"Title": "Nikkon 3100", "Author": "Falcon", "ReviewID": "R36SDATGSLBR9R", "Overall": "5.0", "Content": "Great package and first camera.  Of course I did have to pick up the \"For dummies\" book to figure out about taking pics of waterfalls.  Love it, still need to pick up a polorized lens and I will be all set.", "Date": "June 15, 2011"}, {"Title": "Great Deal !!", "Author": "tony", "ReviewID": "R33NEAM5QGHGB5", "Overall": "5.0", "Content": "I got my camera bundle promptly and the price was the BEST I could find anywhere. The customer service was excellent,as I thought I was missing something, and they were willing to do what ever was required to fulfill the order.", "Date": "November 5, 2011"}, {"Title": "Great starter SLR camera", "Author": "Darryl Harris", "ReviewID": "ROHEZKN24IA45", "Overall": "5.0", "Content": "I've had this camera for about a month now and let me tell you I am quite impressed. I've taken aroung 250 test shots and they almost all came out great! Plus all the extra stuff that you get is a big bonus. Especially the extra lens. Very happy with this purchase.", "Date": "August 5, 2011"}, {"Title": "love it", "Author": "rnt weiz", "ReviewID": "R1GI2285M06XBJ", "Overall": "5.0", "Content": "I purchased this product just prior to a family vacation to Florida so that I would make sure I would be able to use it for a family trip to Italy. Just out of the box the ease of use is amazing. I am looking forward to exploring all the great features of the camera and expanding my photographic knowledge. The bundle pack has all that I needed and will need for a long time to come", "Date": "March 31, 2011"}, {"Title": "Nikon D3100", "Author": "Robert C. Brown", "ReviewID": "R1P3IUAQDYTPVQ", "Overall": "5.0", "Content": "I ALWAYS WANTED A D3100, AND BUYING IT THE WAY I DID WAS GREAT,EVERYTHING I NEEDED IN ONE PACKAGE  I LOVE THE CAMERA AND ALL THE ACCESORIES.", "Date": "January 8, 2014"}, {"Title": "•Well Padded Multi Compartment Gadget Bag with Pockets & Strap", "Author": "martin trujillo", "ReviewID": "R1IJC28FECHEDJ", "Overall": "3.0", "Content": "Well, everything was good but the Multi Compartment Gadget Bag was completely full of Mustiness, I had to wash it before using it because it might affect the lenses and the camera itself, even when it was well packed, it looked as if had been wet for a long period and as I said, it was completely covered by MOLD. It really disappointed me as I was expecting everything in good condition and it really looked like OLD.", "Date": "December 18, 2013"}, {"Title": "beautiful setup and incredible price!", "Author": "Lauricia \"artgirl\"", "ReviewID": "RPDS9GUQZ31EJ", "Overall": "5.0", "Content": "beautiful setup and incredible price! Gifting for my daughters 18th birthday and excited for her new journey as a world traveler and photographer", "Date": "December 3, 2013"}, {"Title": "Awesome deal", "Author": "Danny Henderson", "ReviewID": "RSX9HP4D22NGP", "Overall": "5.0", "Content": "This camera is excellent. It takes pictures that are better than I have ever been able to produce with any other camera I have owned. It is easy to use, but also has a lot of great advanced features for when they are needed. Everything in the kit is good quality, with the battery, sd card, camera, lenses, and cable being very good. Since I am not a professional photographer, this is perfect for me.", "Date": "November 29, 2013"}, {"Title": "Perfect", "Author": "Nicole Konderwicz", "ReviewID": "R2TXW8OLEV5O29", "Overall": "5.0", "Content": "This is great for a first camera, especially if your just a beginner.  It was the cheapest price around and it works wonderfully! It comes with all the necessary equipment needed for beginning.", "Date": "November 10, 2013"}, {"Title": "Love the camera", "Author": "Shannon Morgan", "ReviewID": "R9EMZGOPNRKE6", "Overall": "5.0", "Content": "I have only had this camera a few weeks, but I have captured some amazing pictures! I did lots of research and am happy I decided on this camera bundle.", "Date": "November 7, 2013"}, {"Title": "Wonderful!", "Author": "Mr &Ms.H; \"Mr &Ms.H;\"", "ReviewID": "R28UZ48ZJNWLK7", "Overall": "5.0", "Content": "This is my first Digital SLR camera. Very easy to learn to use....takes about 3 days to get the 'Hang' of it. More than I expected. Well worth the money. Takes great pics!", "Date": "October 23, 2013"}, {"Title": "Nikon Camera", "Author": "Chris C.", "ReviewID": "R1YR20VPR8NJLO", "Overall": "5.0", "Content": "This was a great package for a good price and I have really been enjoying using my camera. When it was available, it shipped fast and I was happy to have it!", "Date": "October 5, 2013"}, {"Title": "Great deal for this camera", "Author": "Richard A Przybylinski", "ReviewID": "R30LZQGTKR5GD", "Overall": "5.0", "Content": "This is a nice camera set up for a reasonable price. I would recommend this to anyone starting out with a digital slr.", "Date": "August 26, 2013"}, {"Title": "ALL I hoped for and more", "Author": "Eileen", "ReviewID": "R3V38NP7ZU5JC7", "Overall": "5.0", "Content": "So far, all good. Shipping was fine, it was all packed very well, lots of goodies included. Like the camera and still have lots to learn. I am using this for photos of flowers and plants, birds, butterflies and landscapes. Plan to do portraits of family soon.", "Date": "July 24, 2013"}, {"Title": "Great purchase for a beginer !!", "Author": "kevin l. willis", "ReviewID": "RMBEJ2I67PBT", "Overall": "5.0", "Content": "This is my first real camera and I am so pleased by the ease and quality that it provides.  It was a no-brainer to get this package cause of all the accessories that were included.", "Date": "July 19, 2013"}, {"Title": "Gift for graduate", "Author": "Montgomery", "ReviewID": "R3EW4N0E22YY1H", "Overall": "5.0", "Content": "I got this for my daughter as a graduation gift. She LOVES it, it's easy enough to use and hasn't put it down since she got it really.  Money well spent for the quality and amount of items you recieve~", "Date": "June 28, 2013"}, {"Title": "Nikon D3100", "Author": "mayela", "ReviewID": "R9K4LK1A1QIM7", "Overall": "5.0", "Content": "it was what I was expecting.  thank you, I recommend this item. It was intended for my 16 years niece, and she was happy with it.  Camera arrive in perfect condition and in a timely manner", "Date": "January 29, 2013"}, {"Title": "Awesome Camera Kit", "Author": "AngiAnn", "ReviewID": "R1D7X7CGMXBV7H", "Overall": "4.0", "Content": "This kit is awesome and comes with just about everything you need.  The camera takes awesome pictures and if you purchase the Nikon D3100 book along with this, you'll be in even better shape.  Once you have the book you can understand how to use the camera to its abilities.  I would recommend this to just about everyone.", "Date": "July 28, 2012"}, {"Title": "camera", "Author": "Deborita", "ReviewID": "R2J1GX6CZCR4KE", "Overall": "5.0", "Content": "This camera takes awesome pictures if you know how to use it. I would have liked to have recieved it a more timely manner. But the camera itself is great.", "Date": "January 3, 2012"}, {"Title": "Kate's Birthday Gift", "Author": "lorraine coppola", "ReviewID": "R2R3THEQFG7DWK", "Overall": "5.0", "Content": "The Nikon 3100 is a wonderful camera. It is a BD gift for our daughter, who is an outstanding ceramic artist. This camera will allow her to take the high quality picturesshe needs for her portfolios and for all her future projects.", "Date": "May 8, 2013"}, {"Title": "Faulty camera", "Author": "Striker", "ReviewID": "R1JOL2VLF8ZCAD", "Overall": "2.0", "Content": "I bought this product and received all the items. When i tried to use the camera it kept on saying error press shutter release button on the LCD . After enquiring i released that the camera was faulty. All other items in good working contition.", "Date": "March 10, 2012"}, {"Title": "UN FINO DETALLE", "Author": "wilhelm hurtado", "ReviewID": "R16ZN26ESD4FKV", "Overall": "4.0", "Content": "UN KIT CON LOS IMPLEMENTOS BASICOS PARA HACER BUENA FOTOGRAFIA, UN FINO DETALLE AL ARMAR ESTE COMBO CON ESTOS IMPLEMENTOS", "Date": "January 30, 2013"}], "ProductInfo": {"Price": "$899.99", "Features": "Nikon D3100 14.2MP Digital SLR Camera (Body) - Nikon 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens (Includes manufacturer's supplied accessories)\nSigma 70-300mm f/4-5.6 SLD DG Macro Lens with built in motor - 52mm UV Protection Filter - 5pc Deluxe Lens Care & Cleaning Kit\n16 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nWell Padded Multi Compartment Gadget Bag with Pockets & Strap - Additional EN-EL14 Reachargeable Lithium ion Replacement Battery\nFull Size 59\" Tripod W/Case - Jumpstart Guide to Digital SLR Cameras - BONUS!! Mini HDMI to standard HDMI cable - Free 25 Quality Prints (Promo code # on invoice)", "Name": "Nikon D3100 14.2MP Digital SLR Camera with 18-55mm f/3.5-5.6 AF-S DX VR Nikkor Zoom Lens and Sigma 70-300mm f/4-5.6 SLD DG Macro Lens with built in motor + EN-EL14 Battery + 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51ABuwyYnUL._SY300_.jpg", "ProductID": "B004LBVWC4"}}