{"Reviews": [{"Title": "Wonderful product for the price", "Author": "Avid Reader \"Nate\"", "ReviewID": "RIMA043U5U610", "Overall": "5.0", "Content": "This is a great little camera.  It is not waterproof as it comes, however a little bit of work and you can make it waterproof.The one that I received had a crack in the housing over the lens.  I knew better than to stick this into any water pipes.This worked well to check on problems with my engine.  Again, do not place in water as not waterproof like stated in description.", "Date": "March 15, 2012"}, {"Title": "Excellent choice for inspections needing long focal length", "Author": "K. Giroux", "ReviewID": "R1FQL1WFHWYN9D", "Overall": "5.0", "Content": "Although the highest clarity is within a few centimeters, this camera delivers passable images up to 10' away, which is just what I was looking for.  The adjustable LED lights are also a nice feature.  I'm over 60 and had no problems loading the software in my late model PC and it was up and running in 3 minutes from opening the package. The price is also a feature.  Bravo!", "Date": "September 8, 2012"}, {"Title": "Not usable", "Author": "Y", "ReviewID": "R1OE8SICHR02I1", "Overall": "1.0", "Content": "The one I got is out of focus and the picture is viewable only at 2 to 3 inches from the camera.  It is usless.  I had a hard time to contact the seller to get it return or exchange. The LED lights work fine and adjustable.", "Date": "July 5, 2011"}, {"Title": "Terrible camera made in 1997", "Author": "Alex", "ReviewID": "R1BHMS5U7M56K8", "Overall": "1.0", "Content": "Don't buy this camera. It is made in 1997. Terrible picture quality. The video is extremely fuzzy and terrible blurry quality.", "Date": "February 12, 2013"}, {"Title": "Fixed Focus", "Author": "Joe Black", "ReviewID": "R3CKADS53XZ9WH", "Overall": "3.0", "Content": "Picture is good when around 8cm from the lens, but not much further. not suitable as a webcamthe camera end seems quite solid... but the USB assembly at the other end seems flimsy", "Date": "December 6, 2012"}, {"Title": "What do you expect for les than $10?", "Author": "Colby Schrom", "ReviewID": "R13V0E2374G48E", "Overall": "2.0", "Content": "The quality is poor. The camera is too small to fit under doors or be stealthy. It requires a disk that doesnt fit in my computer to run. The disk is about half-sized. It can work as a security camera, but must be plugged into a computer to work.", "Date": "March 10, 2013"}], "ProductInfo": {"Price": "$22.39", "Features": "5M/16ft  WATER PROOF SEWER PIPE DRAIN CLEANER INSPECTION CAMERA\nHigh resolution with 1/6 CMOS camera\n4 LED lux luminance lights can work better when the light very dark\nCan record video, and save the video in the PC", "Name": "5m USB Cable Wire Camera Snake Endoscope Spy Cam 4 LED", "ImgURL": "http://ecx.images-amazon.com/images/I/41BecZsmY1L._SX300_.jpg", "ProductID": "B004ZWFTE6"}}