{"Reviews": [{"Title": "Plain looking but takes nice photos and could not be easier to use.", "Author": "G. Uhl \"Allons-y, ... and don't blink.\"", "ReviewID": "RRV0RMIBC2RYO", "Overall": "4.0", "Content": "This camera is not the sexiest looking consumer electronic but it takes very good photos, it is super easy to use and it will not break the bank.Just like with a flip video camera, you can pop open the usb connector on this camera and plug it into your computer and you're good to go. I prefer to work with windows explorer and my own software which is the default if you do not load the software that comes with the camera. I think this is better than a program starting every time you plug your camera in. And it is nice not to have to find cables or pop your memory card out. It's very convenient feature.It accepts sd memory cards or the mini sdhc with an adapter jacket. You have to charge the battery by plugging the camera's usb jack into an ac adapter that comes with. The cord on the charger is super short.I've been using a camera with 10X optical. This GE has 7X optical and this would be fine for most casual photos.The buttons and controls are easy to figure out and use. There are the usual auto scene features (on the beach, at night with fireworks, portrait and so on). The stabilization works very well. The flash works well also and can be turned off and has the usual settings.The feature I use all the time is the macro setting. On this camera it is not the icon of the flower in the auto scene listing, instead it is the icon of the flower right on the back of the camera. So this makes it easier to access but you have to select it every time. I'm very impressed with the macro shots I've taken so far with this camera.The camera works good in low light also. I did some tests in low light with no flash and the camera took nice photos with these conditions.The video works as advertised. With high capacity cards and the large view screen on this I can see grabbing this instead of the flip video for many things. However, the video format is *.MOV which is not cool. You can use MOV for amazon reviews and facebook but you cannot watch them in quicktime or windows media player. You have to convert them first. I use Pazera movtoavi software - free from cnet site. But that's a pain. Also the files are huge when you shot the video. But the zoom works while shooting.It has a relatively small footprint. Would fit easily into a pocket.", "Date": "August 25, 2011"}, {"Title": "Great little \"take along\" camera!", "Author": "javajunki", "ReviewID": "R3AXCLB08PW9GY", "Overall": "5.0", "Content": "I own a full sized DSLR with all the accessories but despite my love of photography, there are times when a big camera is bulky and more of a hassle than help. Other times safety or security is a concern so having a small, inexpensive camera handy is preferred. This fits the bill exactly!I also own the predecessor to this camera - the GE E1265 which is only 12.2 megapixels but provides a panoramic features as well. It has held up well despite being left in the car 99% of the time. It's the perfect size to take along when out and about, reviewing real estate (landlord) or just for those random emergencies when a photograph is needed. This new GE camera does the same but better. It's roughly the same exact size, appears well made and durable (only time will tell if it is as solid as the prior model) and conveniently fits into a purse or shirt pocket with ease.This model has 14.1 megapixels and a 7x zoom with a panoramic feature (something I LOVE especially when taking photos of real estate!). It can shoot a short video and comes complete with a carry strap, battery, cable extension and charger. An optional card expands memory. Nice sized 3 inch view screen and accessible function buttons.The panoramic feature is one of my favorites - to use, you simply select panoramic, take the photo then scan the camera to line up with the clearly denoted indicators. Take the next two shots and the camera does the rest!I was a bit concerned about the USB - from the description, it seemed like it was required to plug in in order to charge...something I don't like. Fortunately, this allows both battery or direct plug-in making it ultra convenient especially on the road. Ditto for uploading photos/video - choose between the cable or USB. You are NOT limited to one or the other.Bottom line - a solid little \"take along\" camera with great features, clear photo and exceptional price. It's not fancy, you are not paying for a big name but if you want a camera that does the job without having to worry about loss, damages or getting stolen, this is a great choice.", "Date": "October 24, 2011"}, {"Title": "Okay camera with some good features!", "Author": "Theresa M. Studer \"Terra57\"", "ReviewID": "R3N7AM1QQSJ6ON", "Overall": "4.0", "Content": "To be honest when I first got this camera I thought it was a bit on the cheap side as far as how it was made.  I have been playing with it and it does have some really nice features that I don't have on any of my other digital cameras and I really think this is a good starter camera or for someone who can't afford a higher end piece.  Great for teens as I'm sure they will be able to squeek as much out of it as they can.I posted some pictures so you could get an idea of exactly what a few of the functions are and what they can do.  I have to say I am impressed with the ones I have played with.  Not overly fond of the automatic setting as I think the color gets a bit distorted and washed out but you can't have everything.  We are just in the aftermath of Hurricane Irene so two pictures display that.I really really love the panoramic function.  It's sooooooo easy to use and does a fantastic job.  Great colors considering.  The sketch function is cute and would be great if you would like to print it out and color things in by hand.  Great for the kidos if you take photos of animals or even them.  It will give them something fun to do on a rainy day.Also, there is one function that has 3 different frames so that you just center what you're taking a photo of in the middle and it's done.  You can see this with my photo of Molly in the photos above.  It's cute and would be great for taking pics of children.  I used the macro function for the photo of the African Violet bloom and I think it came out rather nicely.  Color is true which is a surprise as it seems pinks, purples and blues tend to not come in true on most cameras but did pretty good here.Lastly is the photo of my front walkway after Irene and the colors in this are beautiful.  I used a natural function and was pleasantly happy with the result.The cons of this are that it's not the easiest camera to use and it really ticks me off when they put a cd disk with the guide to a pdf file on how to use the darn thing.  What if you don't have a computer!  You'd be up a creek without a paddle.  Not quite sure how I like the charging on this as you go through the USB connection.  Also, the USB connection is a nice idea but I'm afraid of it breaking and the USB cord is very short which did not make me any to happy.Overall though I think it's a cute camera for the money and a good buy for tweens, teens, an elder person or just anyone who has never used one of these before or for those where $$$$ are a bit on the tight side in today's economy.", "Date": "August 28, 2011"}, {"Title": "Decent entry level digital cam", "Author": "Nuknuk", "ReviewID": "RBMYA1DME5U4L", "Overall": "3.0", "Content": "The images produced by this camera is surprisingly good. They are noisy with visible graininess, especially when you get to higher ISOs, but at this entry level price point, the resulting images are not bad at all.  It has 14 megs of resolution which is huge,  that is even more pixels than my first DSLR, an 8-meg Canon Rebel.There is a separate button for the video which is very convenient.  That way you don't have to fumble in the menus if you are switching to still and videos to and fro.The looks is OK, not like the more popular branded cameras, but decent enough.  The LCD screen is huge, and bright even on daylight.  Like most LCD cameras of today, to place a bigger screen, there is no more viewfinder.I was so excited to try this camera for HD videos. This camera can take videos using optical zoom, and it can do it while in the middle of shooting the video.  I have several digital cameras, two Fujis, including an HD Flip and Creative Vado, they can all shoot HD videos but zooming is always a letdown.  The Flip and the Vado can only do digital zoom while the point-and-shoots cannot do it during the shooting.The result wasn't exactly what I was hoping for. Although it can zoom during the video shoot, the focusing is so hesitant that it constantly refocusing even if you are done zooming.  It cycles between sharp and blurry every second.  This can be remedied by turning off auto focus on the video mode.  This just negated the optical zooming capability - what a bummer.  The video is also not at par with the quality of the dedicated video cameras like the Flip and the Vado (by the way, Flip has stopped making their cameras.) On the other hand, it does a better and smoother job on panning.  The Flip and the Vado looks like they are skipping frames when you do panning.", "Date": "October 13, 2011"}, {"Title": "Mediocre camera that takes acceptable pictures for a Benjamin", "Author": "Ursiform", "ReviewID": "R1C0UQJ2KKXIDD", "Overall": "3.0", "Content": "Pretty much everything about this camera says \"cheap\". You can only charge the battery in the camera. Instead of a miniature female USB port, it has a full-size male plug that folds out (used for both charging the battery and data transfer). It's relatively sturdy, but would still be easy to break off. The included charging cord (which is a fairly unusual full-size male-to-female USB cable) is short; you'll be well chained to your charger or computer with this one.Options are limited, but this isn't a camera for a sophisticated photographer. The menus are generally straightforward, if not always efficient. The macro mode is decent, the flash is decent. The zoom is rather slow to engage, and the autofocus can be slow. The 33 mm (35 mm equivalent) wide angle limit is not very generous, and will limit your ability to capture group shots; this limit is not unusual in a cheap camera, as wide angle capability is challenging in digital cameras.*Pictures are reasonably sharp. They'll beat anything a cheap camera could do five years ago, with more flexibility than the camera in your cell phone. If you really need a camera at the hundred buck level, this one is serviceable. If you are willing to wait and watch the ads, you can probably score a major brand** camera at close to this price. It may be a closeout of last year's model, but it may still be a better value. And if you can move up to the 150-200 buck range you can certainly do better.This is a cheap camera that works. That's about it.* The sensor chips in digital cameras are more sensitive to the angle the light comes in than is film. That makes wide angle lenses challenging for digital cameras. So cheap ones don't go very wide.** No, GE doesn't make cameras. As is the case with most consumer products, GE has sold their name and logo to low-end producers. The GE logo on it doesn't signal quality.", "Date": "August 27, 2011"}, {"Title": "Loved it at first, but it was a big disappointment.", "Author": "Gared", "ReviewID": "R3C6QMEW8Q360O", "Overall": "1.0", "Content": "I bought this camera for work (I often need to take photos for my job to document issues). It takes good photos and I like the option for a time and date stamp which I need for work. I also wanted a camera with a built in USB plug so I wouldn't have to carry and possibly lose a cord. So at first I thought this camera was great. I even recommended it to a co-worked who bought the same one.I did notice that when plugging it into the computers, it wouldn't always connect. I had to unplug and replug it, sometimes into different ports or computers. My co-worker mentioned the same issue with his. After a while it got worse and worse and now is completely unusable. I took less then a year, but of course longer then the return time would allow. In general I would have thought this was a defect with the one I had, but since my co-worker had the exact same issue that progressed the same way, I have to assume it is a problem with the design of the device. I am disappointed as a camera with a built in USB plug is very hard to find.", "Date": "November 12, 2013"}, {"Title": "The GE 14MP Digital Camera Isn't Suitable for an Internet Retail Business", "Author": "J. B. Hoyos", "ReviewID": "RDLC21JRAMBVN", "Overall": "3.0", "Content": "Initially, I was excited to be receiving the GE 14MP Digital Camera from the Amazon Vine Program because it was 7X.  My Kodak EasyShare M341 Digital Camera [Kodak Easyshare M341 Digital Camera (Black)] is only 3X.  Having been a faithful member of the Amazon Vine Program for over three-and-half-years, I have posted a tremendous amount of photographs of various products; this is part of my desire to produce a more complete, more honest review of a product.  Many customers have found my photographs helpful.  These photographs have all been created using my Kodak EasyShare, which, as its name applies, is an Easy camera to operate.  Via the internet and the Kodak EasyShare, it is Easy to Share one's photographs with the world.  The GE 14MP is not as user friendly as the Kodak EasyShare.  The owner will definitely find himself/herself perusing the user's guide on how to perform certain functions on this complex camera.  The Kodak EasyShare is more expensive but I believe it is of higher quality.  I've owned it for nearly two years and it has never given me any problems.  The GE 14MP appears more flimsy in design, especially the built-in USB plug for charging.  The first time I used it, I got an error message; the USB cord, I assume wasn't connected tightly enough.  I'm always afraid the plug is going to break.  What I like the most about this GE 14MP is that it takes High Definition (HD), 16 X 9, videos.  Last year, I attended the seniors' Christmas cantata at my church.  I sat in the third or fourth row and videotaped their performance during the last song.  When played back, the video looked great on my camera's 3.0 Inch LCD screen.  However, when I viewed it on my computer, I was disappointed to see how grainy and amateurish it looked.  I had to keep telling myself that it was better than nothing.  Also, because of HD, a lot of memory is required to videotape an entire performance of a play, concert, cantata, etc.  It is best to buy a 32GB flash card for the external memory.  Furthermore, using the video function will quickly drain the battery.  Be sure to charge the camera before videotaping a special event.  I also took photographs at the above mentioned event.  Zooming in on people's faces was highly enjoyable.  Unfortunately, the photographs were extremely grainy.  Again, I kept telling myself that it was better than nothing.  A month ago, I attended my friend's daughter's senior play in which she had a starring role.  I sat with her family on the second row and snapped various close-ups.  Unfortunately, once again, the photographs were all very grainy.  Only a few of them were remotely presentable for e-mailing to my friend.  On a brighter note, I used this camera to photograph friends and family during the Thanksgiving and Christmas holidays.  The photographs were all taken indoors and used with a flash and they were all comparable to the ones I normally take with my Kodak EasyShare.  The part about the GE 14MP that was extremely disappointing and detrimental to my enjoyable hobby of being an amateur reviewer is that it does not take good photographs of objects that are close to the camera.  (The GE 14MP also doesn't take good photographs of objects that are very far away.)  Sometimes, you need to take a close-up photograph of an object in order to highlight surface details.  As hard as I tried, I could not use my GE 14MP to take photographs that were worthy enough to post on Amazon's website for any of my reviews.  Business owners who rely on posting photographs of their products on the Internet will not want to buy the GE 14MP.  On Amazon's website for the GE 14MP, I have posted two photographs of the same Blue Boy-type figurine.  I used two different cameras (GE 14MP and Kodak EasyShare) that were placed relatively at the same distance and angle from the object.  Both cameras were set on Auto Flash.  I downloaded the photographs to my PC and pasted them together for a side-by-side comparison.  As one can see, the photograph on the right, which was made by the Kodak EasyShare, is more presentable for posting on one's business website.  The GE 14MP is a good camera for taking ordinary photographs under normal circumstances, such as when one is at small family gatherings and the subjects are requested to pose.  However, it is not a good camera for atypical circumstances when the subjects are either too close or too far away and/or are moving quickly.  Don't expect the GE 14MP to take the same quality of photographs as that of a more expensive camera.  Treat it as an entry level camera, the type you'd give to one of your children as an inexpensive gift, and you won't be disappointed when it doesn't perform to your expectations.Joseph B. Hoyos", "Date": "May 15, 2012"}, {"Title": "Good entry-level camera", "Author": "Cowboy Bill \"cowboybill\"", "ReviewID": "R3HBLLWCO34CMO", "Overall": "3.0", "Content": "This camera is simple to use and takes pretty decent photos. It's aimed at folks who want the camera to do most of the work and make most of the decisions. (I'm guessing that's around 90 percent of people who use cameras.) With its low price, it's a good value.I bring this to events where I have a 10 percent chance of losing the camera. The photos are good, indoors and outdoors, and if I lose the thing I'm not losing a $400-plus device.If you have a very good phone with a decent camera, you probably have 80 percent of what this camera offers. If not, this camera is really fits the bill. It doesn't have the bells and whistles of more expensive models, but that's a good point for most people. It's perfect for travelers and younger kids.", "Date": "February 22, 2012"}, {"Title": "Say Cheesy!", "Author": "Celeste \"Vodka, Apple Pucker & Sweet 'n' Sour\"", "ReviewID": "R20P72HMYOOT5O", "Overall": "4.0", "Content": "It's amazing how fast technology moves. A few years ago, a 14 MP 7 x optical zoom digital camera for under $100 would have been unbelievable. Now, it's fairly common. So, why should you choose this camera when you can get a Sony, Canon, Polaroid or a host of any other more well known manufacturers at the same price point? There is no really good reason. Most of these small point and shoot cameras aren't that different from one another, and the photo quality on this camera so far seems fairly middle-of-the-road. So, what is it that makes this camera worth purchasing? For me, it has some really neat (and some really cheesy) special features.The most interesting feature that this camera has is easily the panoramic function. It allows the camera to string three photos together to become a single photo. Very cool for scenic landscapes or large group pictures. Another really neat feature is the sketch option. It is a lot of fun to play with and the kids in your family will adore having personalized coloring books. Another interesting feature is the ID setting. It came in handy when we were taking ID pictures at the office, although because of the format it uses to download, I still had to do some cropping. However, if you want to take and print out your own smaller pictures, this feature is perfect.Finally, I'd like to talk about the built in USB transfer attachment. This is what I call an almost good idea. In theory, I love that the camera has a built in USB attachment, meaning I can charge the camera or download pictures on any computer with a USB, which means every computer. The problem comes in with how the USB is attached to the camera. You really need to sit there and hold the camera while it downloads, otherwise you will have the weight of your camera on the USB connection. If the USB connection breaks off, even if you can download your pictures directly from the memory card, you won't have a way to recharge the battery since the battery charges when the camera is plugged in.For me, the thing I like most about this camera is the cool special features. I'm planning on taking lots of family pictures for Thanksgiving, them making family coloring books for the kids for Christmas!", "Date": "October 16, 2011"}, {"Title": "Good picture quality even indoors, but unusable video mode", "Author": "Gadgester \"No Time, No Money\"", "ReviewID": "R3OK4WR7RF1UV4", "Overall": "3.0", "Content": "The GE J1470S is a lightweight compact camera with 14 megapixels and 7x optical zoom. It also features digital image stabilization that has some, but not much, stabilizing effect to reduce blurs due to handshakes.  One thing that surprised me was its picture quality, which is quite good in most situations, from sunny outdoors to indoors with adequate lighting. It's when the lighting is dim that it fails to deliver at high ISO (sensitivity) settings.  One thing I like is its flash output is more even than most compact cameras from this price range... and definitely more powerful.The user interface is not very intuitive, but not too difficult to learn, either.  One bug I've found is, you cannot turn off digital zoom (which you should) in the video mode without losing that setting the moment you turned off the camera or changed to another mode.That's not the only problem with the video mode, unfortunately.  The video mode (which features 720p, VGA and QVGA resolutions, all at 30fps) is pretty much unusable due to a \"hunting focus\" problem, that is, the camera is unable to remained focused on the subject when shooting video, even when the subject does not move!  This is extremely frustrating, because any video you shoot is bound to be switching in and out of focus frequently, causing nausea upon playing on a PC or TV.If you dont' plan to shoot video on this a lot, it's actually a quite capable still-shot camera.", "Date": "September 5, 2011"}, {"Title": "It refuses to work.", "Author": "Jessica Barnes-Lopez", "ReviewID": "R36Z39AA03CZSW", "Overall": "1.0", "Content": "If I could give this any less stars, I would. I bought this after comparing multiple reviews.  PC World said it was the best for the price. This camera has only worked twice. It just completely stops working after charging for hours. The picture quality looked green, colors were not vibrant at all. Charging was awkward. The zoom was great, but still a poor quality picture. $50 completely wasted. I was left with no camera on our Thanksgiving trip to the snow.", "Date": "December 18, 2013"}, {"Title": "Love It", "Author": "Dawn Anderson", "ReviewID": "RDM3OIP5RZ0QF", "Overall": "5.0", "Content": "Love this Camera, Got it as a give for my husband. Searched the reviews and this one was the best for what we are looking for. Good Price, easy use with the computer!", "Date": "October 7, 2013"}, {"Title": "GE Smart J1470S-RD 14 MP with 7 x Optical Zoom Digital Camera, Red General Imaging", "Author": "pat", "ReviewID": "R1MZXBU5AOJKZA", "Overall": "4.0", "Content": "Arrived Quicker than thought still learning . but so far a very nice compact camera I can carry with Bit the strap and battery missing over very nice camera for the price.", "Date": "June 14, 2013"}, {"Title": "GE Smart Camera Model J1470S", "Author": "TEA", "ReviewID": "R1RP1CLZ78M03G", "Overall": "4.0", "Content": "I wanted a camera to take with me all over and it had to be tiny,about the size of a deck of cards with a three inch view finder and take goodpictures and video. I just got my camera today. Set up was very easy and simple.It has a three inch view finder and 14MP and a 7X optical zoom and all under a $100.00.Charging was fairly simple of battery, battery placement took me several times to insert right. I like the cameras ease of use. I have not tried video mode yet.Please note you need a SD card of class 6 and above to shoot good video per instruction book on camera. I took several pictures so far and I likethe way they came out. It does have several picture modes a nice feature for a lower priced camera. You do not need the camera software to beinstalled if you have windows 7 at least I did not.Down loading of pictures from camera to computer is easy just make sure you have a spare usb or buy a usb hub. Note this is not shown how in manualconnect camera usb to usb extension then to usb on computer, my reason for a four star not a five star rating.I have some concerts coming up and want to take it to shoot some video at the shows.I will let you know more how I like it in days to come, I try it for thirty days and if I like it I keep it.", "Date": "May 9, 2012"}, {"Title": "Good Camera but...", "Author": "Michael Sanders", "ReviewID": "R78PDVZMGKEVD", "Overall": "4.0", "Content": "I dig this camera it takes great pictures and resets fast so you can get to take your next picture sooner... Just be wary of the little flip out USB connector (so far so good but) it just feels like one day I'll be preoccupied with something while connecting the USB cord to the camera and then there'll be a snapping sound and that will be that... The thing I DO like about the connector is that \"it is not proprietary\" and any USB connector, cord or extender will do for charging and uploading...", "Date": "November 17, 2011"}, {"Title": "easly slips in a pocket", "Author": "T. J. newnum \"REDEEE\"", "ReviewID": "R2F16N78P68LW0", "Overall": "4.0", "Content": "I bought this camera because I wanted a slim pocket camera that I can put in my golf bag, car or pocket.This camera has a lot of features and a very good zoom for this low cost camera.So far I am pleased with this product.", "Date": "October 10, 2011"}, {"Title": "Do you really want a \"GE\" camera? Only if you must have IS at this price.", "Author": "Dave \"Dave\"", "ReviewID": "R1D5056N7C0DLH", "Overall": "3.0", "Content": "You will never be happy having spent $100 on this camera, because it looks and feels like a cheap plastic toy camera, and for the same money you can get a Canon, or Sony, or Nikon, or another brand that makes cameras. And their cameras will feel as though they are not toys. This one is working OK after a few days, but I have no sense that it will last.The photos aren't bad, and they have the same problem all very-high-pixel-count cameras with small sensors have: They have a lot of noise in them. This camera would produce better photos with an 8meg sensor.Perhaps the one thing this camera offers that most don't at this price is image stabilization. So if you must have that, here it is, and it works well enough.I didn't pay for this camera, but had I done so, I'd have returned it, as I'm quite sure that the housing won't last long.", "Date": "August 25, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004LB4SA2"}}