{"Reviews": [{"Title": "Product descriptions are 100% accurate", "Author": "Andrew J Lund", "ReviewID": "R21EGWAZ08YPWS", "Overall": "5.0", "Content": "A previous reviewer stated, inaccurately, that the product descriptions for this unit are misleading. This is not the case. I am submitting this review to (hopefully) correct the misperceptions created by that review. (If said reviewer happens to see this, check the last part of my review to see how to correctly use your unit. I think you will be pleasantly surprised to see it will, in fact, very easily do exactly what you purchased it for, based on your stated needs.)Here is the Amazon.com product description (my comments added):\"The new iVision achieves both by giving you the ability to not only know when somebody is outside your home, but to view and talk to them from the safety and comfort of any location in the house. The iVision package includes a convenient hand-held wireless receiver with 2.25\" LCD monitor and battery operated doorbell/camera unit with over 300ft. transmission range.  (Specifies that the door unit can be battery operated, which is accurate.)  In addition, the doorbell/camera unit can be hardwired into existing doorbell power supply to allow the user to utilize a \"browse\" feature on the handheld unit.  (Very clearly specifies that ***IF*** you wire the door unit to the existing doorbell power supply, ***THEN*** you can do more things with it. Note that this says nothing about wiring it directly to AC power - this unit operates on low voltage only.)  This feature allows the user to monitor the view from the doorbell/camera unit on the LCD display.  (States what the addition capability is. Monitor simply means to be able to view the camera at will, versus interacting only as a two-way video intercom when the doorbell button on the door unit is pressed. It should be noted that this product is called a VIDEO INTERCOM, not a full-time surveillance camera. And it really shouldn't come as a surprise to anyone that the ability to sit around viewing the camera whenever you want, for as long as you want, would require some additional power source at the camera besides the small batteries it uses. The manufacturer locked that function out when on battery only mode so people wouldn't sit around constantly running down the batteries in the camera unit.)One can certainly understand if, upon receipt of the product, the purchaser realizes he/she did not fully understand the product description and decides to return it. (My sympathies to the reviewer who apparently went through product return hell.) But to give the product a one star review because you didn't fully digest the words you read is unnecessary. I have used many Optex products over the past 15 years, and I say with complete confidence that they make uncommonly solid, reliable products.HERE'S HOW TO WIRE THE DOORBELL/CAMERA UNIT, QUICKLY AND EASILY:Note: This assumes the existing doorbell a) Exists, b) is functional and c) is a hardwired doorbell. The overwhelming majority of homes in the US have hardwired doorbells. Whether they are functional is obviously a matter of whether they have been maintained in working condition. If your existing doorbell system uses a wireless doorbell button (usually done as a quick, inexpensive fix when the hardwired unit malfunctions, rather than having it repaired), you will not be able to use the browse mode on the camera without wiring low voltage power to the doorbell/camera unit. If you don't know what that entails, find or hire someone who does.Installation: Hardwired doorbells use a transformer inside the house to convert AC power to a low voltage power source that operates the doorbell system. Basically the same as all the bazillion transformers we all have plugged into our outlets to power various things, except this one is hardwired directly to your AC wiring instead of plugged into an outlet. That low voltage output powers two things - the doorbell itself (the actual ding-donger), and the button by the door. ALL THAT IS NEEDED TO HARDWIRE EXISTING DOORBELL POWER TO YOUR NEW DOORBELL/CAMERA UNIT IS TO TAKE THE EXISTING DOORBELL BUTTON OFF THE WALL AND ADD A FEW INCHES OF TWO-CONDUCTOR WIRE, GOING FROM THE TERMINALS ON THE BACK OF THE BUTTON TO THE POWER INPUTS ON THE DOORBELL/CAMERA UNIT. REATTACH THE OLD BUTTON, SCREW THE NEW UNIT TO THE WALL, AND YOU ARE DONE.If your original doorbell was working, then the new one should now be ready to go. Note that this means the unit is intended to be mounted next to the door (just like your existing doorbell button), not on the door directly. If you don't care about the extra capability gained when hardwiring, and just want to stick with battery operation, slap it right on the door if you want to. Keep in mind that if you choose not to wire it to the existing doorbell, the existing doorbell cannot activate the video intercom, as a previous reviewer noted. But that really shouldn't seem like rocket science to anyone smart enough to get online and order products.  :-)I am not affiliated with Optex in any way. I am self-employed in a service industry. I just ordered one of these units for my mother, who is about to have hip-replacement surgery. It's a brilliant design, easily installed and operated, and from a good, reputable manufacturer.", "Date": "January 7, 2012"}, {"Title": "Pretty nice system to have!", "Author": "Josh C", "ReviewID": "R11MOX36U60RMU", "Overall": "4.0", "Content": "There is not too much to say that isn't already mentioned by Andrew.  I took off 1 star because this is a half duplex system.  Meaning that if the person outside is talking and you start talking from inside then you can not hear the person outside while your voice is transmitting to them. For 200+ bucks full duplex it should have been full duplex.  Conversations are limited to 60 seconds.  The device does store snapshots of the individuals that ring your doorbell so that you can see who may have stopped by while you were out.  The camera works great in darkness but not very good when the suns brightness is reaching the camera.I think some way of communicating with the person at your door without opening it is important to have.  Being able to see them and automatically snapping a picture is a huge plus.Heres how we installed the device on my house that has Vinyl siding.  We removed the doorbell then removed the 2 wires that was hooked up to the doorbell.  we then drilled a hold from the right of the doorbell (where the vinyl meets the lip thats next to the door frame) hole into the doorbell hole then attached those 2 wires to some wires in a flat telephone line.  We then hid the flat phone line in the lip next to the door frame (where the vinyl meet the lip) and we mounted the intercom right next to the lip.  Looks great but right now my intercom is only being held by the vinyl so its not as secure as I would like it to be.  Perhaps I need longer screws or maybe needed to find a \"stud\" first.  We are newbies at this kind of stuff.", "Date": "January 8, 2012"}, {"Title": "Don't purchase this from Surveillent", "Author": "Smart Shopper \"Smart Shopper\"", "ReviewID": "R2WUEKWLJ4CVMH", "Overall": "1.0", "Content": "We purchased a device advertised as a two-way intercom security system.  However, it only works if communication is issued from one-end thus not fully making it two ways.  This did not suit our needs and we contacted Surveillent via phone four times over a period of three weeks to initiate a return authorization prior to the 30 day return window and received no response whatsoever.  We then contacted the company via email through Amazon.com and finally received a response.  They made no apology for lack of customer service in returning our initial phone calls and proceeded to tell us that it was our fault we purchased the wrong product even though the product description is very limited and reads as follows:Technical Details* 300ft transmission range, line of sight* Two way Intercom 2.25\" LCD Color Monitor* Live browsing feature when door / camera unit is hardwired* System can store up to 163 images* Day/Night OperationI explained that there was no way we could know how this works without seeing the product.  What then ensued was the single worst online shopping experience I have ever had.  Surveillent told us that we had abused them by \"trying to using their products as our own research facility,\" mocked our \"inability\" to do proper research and subsequently harassed us through seven different emails.  They threatened us with a \"dream team of lawyers\" that they had $30 million in sales and they were going to \"teach us a legal lesson.\"  Clearly at Surveillant not only is the customer not always right they are to be abused while shopping.  If you want to by this product do so through a different Amazon seller in case it doesn't suit your needs.", "Date": "June 4, 2011"}, {"Title": "Very easy to setup!", "Author": "gadget-o-holic", "ReviewID": "R37R53GC81IVNR", "Overall": "5.0", "Content": "This thing is great!  After getting quotes from local alarm dealers I decided to look in to this because it was hundreds of dollars cheaper than what I was quoted for wired systems.  I was a little unsure if this would work since I live in a 4 story row home but after getting it setup it works just fine.  My only complaint is that when people press the button it only rings on the unit itself.  It would be nice if it would also send a signal to the rest of the doorbells in my house as well.What I did then is put my original doorbell button right below this unit, spliced in to the same doorbell wire.  When people see this unit, most of the time they press the regular doorbell since it's not immediately noticeable on the unit where the button is.  Using this setup all of my doorbells ring which alerts me to somebody outside.  Then I just go to the remote viewer and press the answer button to activate the camera.  The security this provides me and my wife is excellent because my front door does not have a viewing hole to see who's outside.Setup was a cinch too!  All you have to do is remove your old door bell, mount the bracket, and attach the wires to this unit.  Then put the unit in to the bracket and lock it in via a screw on the bottom and you're set!  If you want to plug in your original door bell like I did, just get any thin wire and attach the additional wire to the back of this unit and run the wire to your old door bell.  Should work just fine.  Since this works off of low voltage wiring, it's also nice that you don't have to mess around with fuses and such at your fuse box during installation.", "Date": "October 25, 2012"}, {"Title": "As expected", "Author": "Greg", "ReviewID": "R12RRFJ5GM3VMU", "Overall": "4.0", "Content": "Product does as it represented.  Communicates around 100 feet through an exterior wall, three interior walls and up to a second story in the house.The only real draw back is if you mount the exterior unit to utilize an existing door bell connection the camera has no upward adjustment.  At that mounting height you get a picture of a waist.", "Date": "January 4, 2013"}, {"Title": "Good for what it cost", "Author": "Kindle reader", "ReviewID": "RV9W3NCCISZK4", "Overall": "4.0", "Content": "Received this item just a few days after ordering it, FAST.  Suspect it was drop shipped from somewhere closer to where I live and that's why it got here so fast.  The product package was just placed inside of a 12 x 12 x 8 cardboard box with no packing so it bounced around inside.  The product package was damaged because of this but the product itself was OK.  I bench tested everything right after receiving it.In my work I have installed several similar systems.  There were commerical quality products costing 3 to 4 times as much as this one.  This product seems like a fair price for what it does.I decided to wire the power to the door camera unit so we would have the ability to turn the camera on from the monitoring station without the bell call being pressed.  This can be a bit of work depending on the location.  In our case it included accessing the attic.Overall I would say this item is worth the cost.", "Date": "March 3, 2012"}, {"Title": "Works great...!", "Author": "Danny P. Hurles", "ReviewID": "R313J09L6UV65F", "Overall": "4.0", "Content": "I installed the iVision off my existing doorbell. By doing it like this, when someone rings my doorbell, it rings in the house as it normally would. I can then answer through the iVision.  If you wire the iVision in replacement of your existing doorbell, it won't ring your house doorbell, but it will automatically snap 2 pictures of who is at your door, and ring your handheld unit. That's great if you're not home...the handheld unit blinks to let you know someone arrived. Then you can review the pictures.  If you keep your doorbell, and they press that, it doesn't automatically take their picture, and it doesn't ring the handheld unit...just your regular doorbell.  So your choice of whats more important to you.  For that reason I deducted a star.  But it's a great unit...I really like it.  You can take a manual picture at any time from the handheld unit, if it's wired to your doorbell.", "Date": "February 21, 2013"}, {"Title": "Good product, but cannot support multiple monitors", "Author": "cinnamon girl", "ReviewID": "R1LGL1TB3BKZOP", "Overall": "4.0", "Content": "Andrew J Lund's review is so thorough and accurate, I'm very surprised that I have something to add to it.If it is important to you to have the ability to use multiple LCD monitors with a single doorbell camera unit, this product isn't going to suit your needs. The instructions include information about pairing a new monitor with a camera, but I just learned that these instructions are provided only in the event that either your camera or monitor has stopped working, and you are replacing one of the two items.I installed this unit a few months ago, and I've been pleased with it, except that I have a 3-story house and it would be much more convenient to have a monitor for each level. I recently purchased two additional complete units, with the intention of pairing the monitors with the existing doorbell camera, and each time I'd go through the pairing exercise, only the newly paired monitor would work. I just contacted Optex technical support and was told that there is no way to use multiple monitors with this unit.Apparently, within the next few months, Optex is planning to launch a new product that will support the use of multiple monitors simultaneously, so if that would better suit your needs, you might wish to wait.", "Date": "December 17, 2012"}, {"Title": "Exactly as described.  Works great.  Clever design!", "Author": "David Rechtschaffen", "ReviewID": "R37H3HPO7AJ62Y", "Overall": "5.0", "Content": "See my reply to Andrew J. Lund's review for more specifics. It's all there.  I just wanted to add my own five star rating. I'm thoroughly impressed with the Optex iVision unit.  The only comparable systems that I'm aware of can be found off of Alibaba and other such direct from mainland China marketers. Beware though, those units are garbage, right down to their poor fit-and-finish. Trust me. I found that out the hard way.This unit is filled with many clever, common sense design features. These come into play, both in terms of installation options, and in day-to-day usage. It's truly an excellent unit.", "Date": "July 11, 2012"}, {"Title": "As Described", "Author": "S. Morrison \"Steven M.\"", "ReviewID": "R1UZ1LNWE9TH9D", "Overall": "4.0", "Content": "This product is an excellent device for anyone who wants to monitor their entry points without being at that entry.  Instructions for installation are straight forward and easy to follow.  Two options are available for mounting the camera; 1) 6-AA batteries for wireless installation or 2) wired installation using existing electric doorbell.  Either method is easy to set up.  The only problem is that you can only adjust view angle left to right or up; no down angle; however this is true with most monitors of this nature.", "Date": "June 8, 2013"}, {"Title": "Excellent product", "Author": "Denise Adema", "ReviewID": "RD69ZAUC3YXJV", "Overall": "5.0", "Content": "We have a security system, but this allows us to talk to people at our front door without opening the door. We love the camera feature that takes a picture when we don't answer.  The only problem is that it doesn't have a wide enough angle to see either really tall people or really short ones who stand close to the doorbell.  It was easy to install.", "Date": "April 20, 2013"}, {"Title": "Fantastic for a single woman!", "Author": "Karen E. Bubelis \"5starnana\"", "ReviewID": "R2OA2P2OHIDUNP", "Overall": "5.0", "Content": "This would make a great gift! I'm going to get one for my mom. I bought this for my my place and I love it. I love that when the door bell rings I can now see and talk to whomever is at my door from the safety of my home.Listen up girls, it's easy to install and you can do it your self. I don't have a drill so I just bought some of those self-stick outdoor better then Velcro strip thingies (you can find them where they sell tape) and stuck those on the back of the device, then onto the house itself. The fit is tight and secure and it's way cheaper then buying a drill. Plus, it's easy to uninstall and take with me if I move.The hardest part was taking off my original door bell button then splicing extra wire length (only if you need more) so I could put it up higher then my original doorbell. It's low voltage wire so make sure you don't let the two ends touch each other (I didnt know how to turn off the electricity) and you won't get shocked. I taped off one of the ends just to be safe. I went to OSH and they helped me find bell wire, wire nuts and the self stick Better then Velcro thingies.I went through the hassle of hard wiring the device because I wanted to be able to browse the camera live at will. Otherwise with just the batteries you can only use the camera if someone rings the door.For the price this is a great product. I am extremely pleased. I keep the remote on my nightstand at night and move it with me to the other rooms during the day. I feel safer living alone having this extra safety feature installed.If you live in a two story house you can bring it upstairs too. You won't have to run back down to see who is at the front door.Oh and for the reviews that said its not good quality or toy like, I disagree.  Plus, it works exactly as described.  Some people just don't read the directions all the way.  Now I want to tackle installing a fixed camera and a DVR for 24 hour recordings in addition to the IVISION doorbell/Intercom/camera system.", "Date": "September 2, 2012"}, {"Title": "Reservations .................. unfounded!", "Author": "Carl L. Ward", "ReviewID": "R2DC06D21UFSM6", "Overall": "5.0", "Content": "I had several reservations when I purchased this camera for an in-law. But it was easy to setup and easily handled the range (my biggest worry). My relative is very happy with this item and I told him that I would make sure to put a good review on this product.This is a great product especially for the price.", "Date": "May 23, 2013"}, {"Title": "Good visuals", "Author": "Nils D.", "ReviewID": "R37O6YTYJNZMOR", "Overall": "4.0", "Content": "The only problem is trying to get enough of an angle to keep the person in view.  Otherhwise, it is simple to install and you can have it working in minutes.", "Date": "April 2, 2013"}, {"Title": "Does It's Job - Waterproof and Effective", "Author": "big_art", "ReviewID": "R1CZSEL3OJRGO9", "Overall": "4.0", "Content": "I just had this installed about two weeks ago.  I have the doorbell camera mounted unprotected in the open and it has weathered some heavy rain and a little bit of hail in that time period and works the same as day one.My only gripe is that you can't use the \"Browse\" feature (let's use preview in live view for a few second to get a quick live video snapshot of what's happening in the field of view of the camera) unless it's hard wired.  Not everyone may be mounting this directly into the doorbell wiring, for me, it services an entrance gate to my home which is away from the main door.  I think there should be an option to enable this, even if running on battery power (which mine is).  It should be up to the owner to decide if they want to drain the batteries away by using the browse feature at will.The range is decent but not stellar.  Still, it is useful and I can have an interrupted conversation from my home which is up a long flight of stairs from the unit location and blocked by 1-2 walls.  If I move to my kitchen 2-3 walls away, it gets choppy real quick and becomes nearly unusable.It has a feature that captures a photo of whomever rings your doorbell - very neat.I have no feedback on longevity yet, but I will definitely come back to this review if I experience any problem soon.  I would give it 5 stars if it had a little bit better range and allowed the user to use all features regardless of setup.", "Date": "March 9, 2013"}, {"Title": "The product solve the problem of running new wiring in my Home", "Author": "Gorgi", "ReviewID": "R15LLNPISSS45H", "Overall": "4.0", "Content": "I like, the audio and video quality. it is very good and above average compared to other products.I like the frequency range 2.4 GHz, there is no interference with home WiFi which is interrupted with 800-900 MHz product.I like the wireless feature of this product.I like the range 300 ft,  if you install in a concrete building it will be about half or may be quart but it is satisfactory to cover living room, kitchen and some bedrooms. It will depend on structure of your building.I like the mobility feature of Hand Held Hands Free monitor unit.I do not like that you cannot initiate a call from monitoring unit, people sometimes miss call button and just knock on the door.I do not like need of hardwired camera door unit to monitor (Browse). It should work on battery even if it consumes battery because hard wire means you lose part of wireless feature.I do not like you can not open door remotely, if you will use iVision on remote gate, you will need to add a wireless gate opener. You can not open a door with iVision. It is clear you should not open your house door for people unless you reach door but it is different story when you want to use it for remote gate.", "Date": "February 16, 2013"}, {"Title": "Love it! and easy to install", "Author": "Clay", "ReviewID": "R2XQKFJR9M1L5N", "Overall": "5.0", "Content": "I just got this yesterday and it installed in about 5 minutes. The hand-held video device is sooo handy and the picture quality is very good.I tested it out tonight when I came home. I have one small light by my front door. I pressed the button (which takes a picture of whomever is at the door) and the nighttime photo was clear.My front door and my office are at separate ends of the house and  a lot of times I am downstairs. This has already proved useful. I highly recommend this product and I wish I had another reason to purchase one.Kerri from Seattle, WA", "Date": "October 17, 2013"}, {"Title": "Dark images on Screen", "Author": "gbf17116", "ReviewID": "R1QAEDBIPJNYSE", "Overall": "3.0", "Content": "Just received it about a month ago.  So far so good.  My only complaint is the pictures on the screen are very dark even during the day.  Makes it hard to determine who was at the door.", "Date": "October 10, 2013"}, {"Title": "Works well, but limited distance", "Author": "Dale \"DaleDJ\"", "ReviewID": "R3AJRHZQ7UGPQZ", "Overall": "3.0", "Content": "This unit works as advertised, but the range is a bit limited. It seems to be able to penetrate about 20 to 30 feet into the house. When you go through more than about two wall, the video becomes choppy as does the audio. If you have only one wall between the bell and the intended usage location it should work well for you.", "Date": "August 24, 2013"}, {"Title": "Plan Before You Order", "Author": "WilliWu", "ReviewID": "R2VF3Y7JWPD4D5", "Overall": "3.0", "Content": "There are three practical installation options and you should NOT order until you decide which one you plan to use and are willing to live with the limitations of the option you select. These limitations are driven by the fact that you can NOT activate the camera/intercom from inside unless you select an external power option. Additionally, a visitor will not see anything that looks like a familiar doorbell button (see manufacturer photo of outdoor unit) and will probably not press the bar on the bottom of the unit.Option 1: Internal battery power. Easy installation, but people may not recognize the button and you will not be able to activate the unit to see or hear them when they knock on the door.Option 2: External power from wiring that leads to your current doorbell button. Easy to hook it up, no new wires to run and you can activate the unit to see/hear a visitor who misses the new button and knocks on the door. Problems are limited field of view that will cut off the visitor's head if the unit is less than five feet off the floor and the risk of not hearing the knocking.Option 3: Leave old doorbell in place and mount new unit in a remote location with external power. The 40 KOHM impedance of the new unit is high enough so that you can power it in parallel with your old doorbell button. This allows you to activate the unit from inside when you hear your old doorbell and provides a better view. The lens is best suited to a distance of five to eight feet from the visitor. This was my plan till I realized how difficult/sloppy it would be to extend the power wiring to the new unit. I returned the unit for this reason.In summary, this is a well made unit that I would only recommend to someone who knows which installation option they will use and is willing/able do the required wiring.", "Date": "September 10, 2013"}, {"Title": "A really good purchase ...", "Author": "BlackPudding", "ReviewID": "R3MCOPD7YUOYZL", "Overall": "5.0", "Content": "This is a very, very good investment.  You don't need a peephole, you can see as clear as day who is at your front door and you are not constrained by the placement of the unit as it's as portable as a cellphone.  I could be in the bathroom and still check who is at the front door.  The unit records the time of arrival as well and it is very easy to playback.  Love the sense of security!", "Date": "December 26, 2013"}, {"Title": "Eh - would probably select something else next time", "Author": "Marcelo Rosa", "ReviewID": "RLQ1CVWLM7P3H", "Overall": "3.0", "Content": "Purchased this to replace existing NuTone intercom / doorbell. I hardwired the outside unit in place of the old NuTone unit to avoid having to replace batteries but was disappointed to find that unlike competing products which allow you to wire to your existing doorbell, the iVision will NOT also ring your existing inside chime/bell. It only uses that wiring to power itself.The second issue was that the rechargeable battery to the inside unit was either defective or very old because it failed to hold a charge. I had to purchase a new battery back, which I was only able to find via Batteries Plus, at a cost of over $15. I can get over the design issue that essentially disabled my existing doorbell (by hardwiring the outside unit) but It doesn't seem fair that a $200 product comes with a dead / defective battery pack!", "Date": "December 23, 2013"}, {"Title": "Works as decoy but wouldn't buy it again.", "Author": "Sandy Palmer \"Whatever makes my little one re...", "ReviewID": "R20CGMKBJMGJV3", "Overall": "2.0", "Content": "The door bell really isn't all that loud and my Dad installed it and connected it up to our main door bell and it's not working.  He can do just about anything.  Wouldn't buy it again but it does do what I got it for.  Keeps solicitors away.", "Date": "December 10, 2013"}, {"Title": "CAVEAT EMPTOR: what you read is not what you get!", "Author": "Eric J.", "ReviewID": "RKWN1WD9FU2SG", "Overall": "1.0", "Content": "First:When unboxing, you will discover that the product build quality is more like a toy made by Fisher-Price than anything adequate...Second:After installing it you will find that the range is far from being what is advertised (300ft) but rather like 25ft rendering the system almost unusable in \"normal conditions\" which means :1 - with the transmitter --- outside the house --- and the receiver --- inside of it --- (unless you want to use as a walkie-talkie for your kids : see above...)2 - granted you have at least an external wall in your house and it is not made of 1/4\" corrugated plasticThird:You will hear and see that audio and video quality are extremely poor even when used in \"optimal conditions\" (ie: like 15 feet emitter from receiver!!!)Then you will contact the seller for an RMA and this is where it gets really messy :(Please read the fine prints as they will charge you 25% restocking fees (I know that's my fault I should have read before ;))And to add insult to injury, you will experience the very worst customer service I've ever seen in my life with them mocking you as you didnd't do your homework, treating you in a condescending manner and sending you some of the nastiest emails about how stupid you are.Do other Amazon buyers a favor, don't patronize Surveillent!p.s:I forgot to add that the constant use of smileys on their customer service emails is rather disturbing especially when treating you like a fool :(", "Date": "February 16, 2012"}, {"Title": "Packaging is misleading-not a two way intercon", "Author": "Eye MD KC \"circumspect\"", "ReviewID": "R3PWMB7KA51V7A", "Overall": "1.0", "Content": "The packaging and claims made for the Optex iVision wireless '2 way intercom' are misleading. You can only see and talk to the person on the other door IF THEY RING THE DOORBELL. If they knock on the door or use your existing doorbell you can neither talk nor see them. The \"doorbell\" on the camera unit is hard to see and almost all strangers at our door knock and we find the unit useless. A call to Optex 'customer service' was met with indifference about the misleading nature of the packaging claims. It was explained that to be able to \"look\" and \"talk\" from the inside you have to be able to attach the unit to AC wiring. This is not practicle on this location. I would not have bought the unit if the package clearly stated that to be truly \"two way\" it had to be wired to live current instead of just attached to the door and run on batteries. Now I have two holes in my door plus a unit that does not increase our security. Definitely do not recommend this unit.John in Kansas City, Missouri", "Date": "October 12, 2011"}, {"Title": "I tried hard to like this product.  But can't...", "Author": "Cynthia Elefante", "ReviewID": "R2GUD08EQ6KKUM", "Overall": "1.0", "Content": "Everything arrived as advertised.  I installed the product as instructed without issue.  But, the rechargeable battery pack was defective and wouldn't hold a charge for longer than 1 hour after charging overnight.  I don't want a new unit, just a replacement battery pack.  I contacted Amazon, who informed me that the seller can't help me, but gave me the name of the US distributor, and that Amazon would reimburse me for any costs.  OK, sounds good.  I tried contacting the distributor with no luck.  They refuse to answer my email.  Now I'm frustrated.  This piece of Chinese engineering is no longer worth the aggravation of trying to get a simple replacement part.  Forget it.", "Date": "October 7, 2013"}, {"Title": "poor transmission range and no option for second monitor", "Author": "Dr. Gary Seeman", "ReviewID": "RUIUS7SOMBEJH", "Overall": "2.0", "Content": "The product seems high quality and works out of the box, but the transmission distance is completely inadequate. We live in a small house, 1300 square feet. The monitor is intended for a small building 20 feet behind our house. From that location the sound quality is so scratchy it is unusable. The product is rated for line of sight transmission of 100 yards. There's a caveat in the user manual that says the distance may be less if there are intervening walls. But if it can't transmit this small distance, the product is useless.Also before trying this out we were wondering if we could get a second monitor so my wife wouldn't need to carry the one she would keep in her office in and out of the house. The manual and product literature do not offer a second monitor connect option.Think about this for a minute. It's a front door video doorbell intercom. Who would need it more than someone who wants to know who's at the front door from close behind the house? It doesn't work for that.", "Date": "September 22, 2013"}], "ProductInfo": {"Price": "$319.95", "Features": "300ft transmission range, line of sight\nTwo way Intercom 2.25\" LCD Color Monitor\nLive browsing feature when door / camera unit is hardwired\nSystem can store up to 163 images\nCamera unit instantly captures image when doorbell button is pressed", "Name": "Optex iVision Wireless 2-Way Video Door Intercom System", "ImgURL": "http://ecx.images-amazon.com/images/I/41zquJivwAL._SY300_.jpg", "ProductID": "B0046FTZPQ"}}