{"Reviews": [{"Title": "Superheadz clap digital camera review", "Author": "Mr D", "ReviewID": "R3U32I8YIKJY1E", "Overall": "4.0", "Content": "There is only on button and a power on and off switch.The camera feels like rubber coated plastic.The camera is really small about the size of two usb thumb drives.underneath the camera there appears to be threaded metal to take some kind of tripod or holding devise.Don't panic there are English instructions on the reverse of the Japanese instructions.I would advice any one who buys this camera to take plenty of pictures as even with a small memory card in there you will get a lot of pictures and not all  of them will be good (remember no view finder). This camera does not capture fast moving images very well but as a result you get some interesting but accidental effects.But still images are absolutely fine.I managed to have this camera on standby for about an hour taking about 60 pictures without the cameras battery dying and still had plenty of space left on a 2gb micro sd card. video is also possible by holing and pressing the only button for the amount of time described in the instructions.Overall this is a fun camera so don't take it too seriously.", "Date": "August 3, 2011"}, {"Title": "Nice", "Author": "DISKOTHEQUE", "ReviewID": "R2JJGXZN52W0VH", "Overall": "4.0", "Content": "For $50, this is the best camera you can buy.  However, it has wicked motion blur.  Not really a problem for me, as I plan to take pictures on vacation with it and not much else, but it might be hard to use the video functionality or to take pictures of people.Buy it, it's fun.  I want to try carrying it around while I ride my motorcycle.", "Date": "March 22, 2012"}, {"Title": "Teeny Tiny Camera", "Author": "Mimi's pen", "ReviewID": "R2W6L1CKRLMVXG", "Overall": "5.0", "Content": "Our grandson was thoroughly pleased with this camera and kept fooling with it during his birthday celebration.  Haven't seen any of the pix yet, though!", "Date": "April 28, 2013"}, {"Title": "Sent it back...", "Author": "Rixxter \"Asian food nut\"", "ReviewID": "R22OV66035NURA", "Overall": "1.0", "Content": "Do not actually know whether or not this cute little camera worked, as I could not get my computer to recognize it.  I had taken 4 or 5 pictures, but they are no good to me IN the camera. On the plus side ... the red light did blink as advertised :)", "Date": "January 14, 2014"}, {"Title": "Can you review something that doesn't work?", "Author": "Jason P. Everett", "ReviewID": "R243MVVY5HIC5B", "Overall": "1.0", "Content": "I have purchased two of these cameras. The first never worked, at all. The second took three pictures and never worked again. And the three pictures were pretty pixelated. I will not waste my money on a third.", "Date": "March 3, 2013"}, {"Title": "ok", "Author": "giacomo", "ReviewID": "R1PBAZE1CTVFP4", "Overall": "5.0", "Content": "ok, the buying has been satisfying and the clap camera rocks! I love it, I love it. I advice it to everybody", "Date": "February 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004WJAYSS"}}