{"Reviews": [{"Title": "Returned the LX5 & S95...kept the P300", "Author": "Patswamp", "ReviewID": "R3TE0PNEOJC4NR", "Overall": "5.0", "Content": "Over the last couple of weeks I've bought all three, returned the Canonand Panasonic. Here's my opinion (again this is mostly opinion, notfact):- P300 and S95 are almost the exact same size, LX5 was too big (i.e., toothick for a pocket)- P300 and LX5 both have direct video record buttons- LX5 and S95 both shoot RAW (wasn't a factor for me, but may be foryou)- All three have great picture quality (1. P300, 2. S95, 3. LX5)- Two have great video quality, S95 is just OK (1. LX5, 2. P300, 3. S95)Because I have an SLR for high-quality pictures, I just want a portablep&s; for when I don't feel like carrying an SLR. That factor hurt theLX5, which I thought was the best camera, just not pocketable.The LX5 had great video, really fast focusing (for pics and vid), andstrong build quality. It's JPEGs were the worst of the three, but thirdbest in this class is generally better than 1st place in a lesser classof cameras. It felt solid. I liked the direct video record button. Idisliked the lens cap.The S95 never did much for me, it's pics were good but not better thanthe P300. It's video was definetly the worst of the three, but again,solid for a point and shoot. The ring around the lens was cute, but feltloose to me. The lack of a direct video record button was limiting and Ifound the auto pop-up flash annoying (it pushes your finger out of theway, both other cameras have mechanical flash pop-ups).The P300 is great. Love the picture quality and video quality. Warning,the video is jumpy on pans, this camera won't take the place of an HDvideo camera, but it's great for a point and shoot. The direct videobutton is great too. The lcd screen is beautiful. The camera turns onand snaps very quickly. Shot to shot is excellent too. Picture qualityis great (again, I'm a JPEG user, if you're all aboutRAW-post-processing-for-point-and-shoot-quality-pics you may have adifferent experience).You can slice this opinion a million different ways, all three areawesome cameras. Pick what the most important factor or two is for youand decide based on that. For me, the discriminators were size and videoquality (as they all took great pictures).Update 1:After using this camera extensively for a week or two I've come to appreciate it more. Some of my recent findings which may or may not be helpful to you the reader:- Indoor video can take on a soft appearance and the colors can be off under certain lighting conditions in auto mode, however, it appears that manual tweaks in the program/manual modes carry over from photo to video. So you can set the AWB to a better lighting mode in one of the manual modes and simply switch modes as the lighting situation dictates. Outdoor video continues to be outstanding in auto mode.- The creative modes (black and white, soft, etc.) can also be used for video, again you will need to be in a program/manual mode (P, A, S, M). Of these I do find the black and white to make interesting video depending on what you're shooting.- The fast motion and slow motion modes for video are quite fun to use (they may not be all that useful, but they're fun).- The panning motion panorama (easy mode?) combined with the Nikon software if pretty impressive. The stitched assist mode panorama works well too. It's particulary impressive in multiple monitor set ups, I can spread the picture across 3 screens and see an impressive panorama.- Having no \"welcome screen\" is the way to go if you want a quick start up.- The camera does not weigh much, it's a little off-putting at first, but light is good.- I love being able to decide if the flash should be used by flipping the switch because I usually do not want a flash (fill flash is all I use pretty much) and it's apparent by looking at the camera if the flash is on or off, there's no digging into menus to find out.- If you're reviewing your work (via HDMI for instance) on the camera or a tv you can press (and hold) the play button instead of power to avoid opening up the lens.- The battery has provided a long life per charge, I haven't tested it but it may be better than advertised. Two drawbacks: it goes from fully charged to empty without much warning (icon is full, and then it's down a bar for a few minutes, then empty) and you plug the camera in to charge vs putting the battery into a charger (that's a draw back because you can't swap a fresh battery in and charge at the same time, if you buy the separate charger you can do this. I bought both an extra battery and charger to avoid any power outages).- Applying after effects in the camera works well and the camera automatically copies the original.- This is a piece of advice that will be obvious to some (ok, it's really for my mom): set the date and time accurately and don't have the date imprinted on your pictures. This info is part of the \"meta data\" that you can see on any computer. You want an accurate date so you can sort photos later if required and you don't want the date imprinted on the photo because it ruins the picture and is already in the meta data.Update 2:- I have been using this for over 6 months now. It's seen a couple of vacations, kid's events, hiking expeditions, holidays/birthday parties, etc. My satisfaction with this camera has grown over the months not diminished.- The price is a lot better now than when I bought it, it's particularly attractive at under $250.- It's light and compact, I have no problem putting it in pockets or holding on to it with the attached lanyard.- It starts up and fires a good picture wicked fast. This is key for a point and shoot as most of the scenarios you want a camera for don't necessarily involve composition, it's more about capturing moments as they happen, often without warning.- I still am not completely satisfied with the video, this is where Nikon can definitely improve the camera for the next iteration. It's good video, just not as good as the LX5 and nowhere near as good as a stand-alone HD camcorder (a future dinosaur?). The video is about on par with the iphone 4s, perhaps a tad better.- Speaking of the iphone 4s, I was worried/hopeful it would make the Nikon P300 obsolete in my house. It didn't. The P300 just takes way better pictures. Full sunlight with no tricky shadows and no popping colors--they're probably equal. All other shooting scenarios especially low-light--P300 is a lot better.- I still hardly ever need the flash, it excels in low-light.- I was intrigued by the new Canon S100, I haven't used it yet so I can't give you a comparison, however, preliminary reviews make it look like an incremental update to the S95. With the switch from CCD to CMOS it actually seems closer to the P300 than the S95 was. It still has the silly ring and auto pop up flash that I didn't care for from the S95. I'm not a Canon hater by the way, I love their products and own several.- One regret: I never actually needed a second battery. I probably shouldn't have bought it. It has sufficient battery life for most people.", "Date": "March 29, 2011"}, {"Title": "Excellent low-light pictures and HD video!", "Author": "robbieY \"robbieY\"", "ReviewID": "R84M4XZPJJ3I1", "Overall": "5.0", "Content": "Note: this review is for the layman--who wants to eventually learn to use manual features--but ends up using only auto-mod, so all you pros please don't make too much fun of me.I'm a father of a 2-year-old and I take lots of indoor shots and tons of video clips. My almost 3-year-old camera was a Canon SD790IS: 10 MP, 640p video (Yes, very low resolution but it never lost focus!), mono microphone.Question: Is it too much to ask for a camera with great low-light abilities, Full HD video, a stereo microphone, and no removable lens cover? Apparently the answer was YES!I bought a Canon SD4000IS but returned it because it couldn't hold a focus in HD video mode. Not even on stationary objects using a tripod! Ridiculous!My online search continued with finding cameras that had good video but too many megapixels (above 12 MP is bad) for a point-and-shoot, which made the pictures worse!I eagerly awaited the reviews for the Canon SX230 but was devastated when I noticed blurring in some posted videos by infosyncworld.I was even ready to shell out the big bucks for the Panasonic LX5 but it has a removable lens cover! Are you kidding me? I don't have time to remove the cover before powering up.So finally, this Nikon P300 comes along and it does everything I wanted! Finally! My 2-year search has ended!The HD video is amazing! The focus stays sharp throughout. I don't think I'll be using the 1080p mode too often (I have a Canon VIXIA camcorder that records 1080p that I use for birthdays), 720p has made me very happy. Even the slow-motion mode can record in HD! Check out YouTube for cool slow-motion videos. A lot of new Canon models recently released can record in slow-motion but only very low quality, less than 640p.Video mode records in 30-minute chunks, that's enough for me. When recording in 720p, the camera's LCD displays a countdown from 30 minutes going down instead of a counter going up. I find this useful, you'll know how much time you have left. I need to read up more on this though, maybe different SD cards can record for longer.Many professional reviewers scoffed that this camera did not have RAW Tiff capabilities. I don't care that it doesn't have RAW tiff. If I want RAW tiff, I'll buy a DSLR in the future.I like how the flash only pops up when you physically pop it up with a switch on the side. So far I don't need it. The flash design is great, it allows you to place your left index finger right behind it when it's raised. I didn't like how some new Canons have a flash that automatically pops up each time you power it up. For shots where you don't want a flash, you'd have to always fold the flash back down. Try imagine telling that a hundred times to friends: \"yeah, turn it on, but push the flash back down, yeah, no, like this...\" Annoying. Also, too many moving parts just seem more cumbersome and more likely to break.Some minor complaints:1. When importing pictures onto my Mac, I have to manually rotate the portrait shots. Canon did this automatically.2. I have to charge the battery in the camera. I can purchase an external charger but that's another $30. Plus I hear the charger has a long cord instead of a flip-out 2-prong design like the Canon chargers.I love the design, the dials are sturdy, the record video button is very helpful. Buy it! you'll love it!", "Date": "April 13, 2011"}, {"Title": "If video as well as stills are important to you", "Author": "sharoninmass \"sharoninmass\"", "ReviewID": "R1XYK3TY7TR3G5", "Overall": "4.0", "Content": "\"Should I buy this camera?\" is like asking \"Should I buy this car?\" The answer to both questions is: It depends on what's most important to you. For me, I was looking for a point-and-shoot that takes good HD video as well as good still photos, and is reasonably small, light and affordable. I already have a DSLR, and wanted a camera to complement that -- one I could slip in a pocket and take to the beach or an evening out without having to worry about it.I believe other commenters that there are P&S; cameras out there that take better photos than the P300, but those models are either considerably larger and heavier, a good deal more expensive (one comment here compared a camera costing $500 with this one at slightly over $300), or the video quality is unacceptable. After a lot of research, the P300 turned out to be the camera that best met my needs.I've only had this for a couple of days, but here's what I like so far:* Nice ergonomics. I enjoy holding and using the camera, which isn't something I can say about my previous P&S.;* Large, bright, sharp LCD* A good mix of manual controls for when I want them and auto settings for when I don't.* Macro closeups are excellent* Low-light performance is generally good for a P&S;, especially with the fast 1.8 lens.* I've been pleased so far with my outdoor shots, although I haven't really had a chance to do much with this outside yet because weather's been bad* The flash only fires when you first pop it up, so it doesn't inadvertently ruin a shotWhat I don't like so far:* White balance in mixed indoor lighting seems worse than average* As I read in another review, video can be jerky while panning* Detail in distant objects doesn't look as crisp as in photos I've seen from competitors in its class* (updated) You will hear motor noise when zooming in and out on video (at least I do)* (updated) Focus in auto mode is limited to frame center* (updated) Photos taken in portrait mode don't auto rotateThere are some interesting features such as in-camera HDR and one-shot panoramas I've yet to try. All in all, I'm looking forward to taking this with me when I'm going places where I don't want to take my considerably heavier and bulkier DSLR.UPDATE: After reading the manual, now I know why I've been less than happy with some of my shots in Auto mode: Auto mode focuses on the center of your frame. If you don't always stick your subject dead center -- and most experienced photographers don't much of the time -- don't use Auto mode. If you have a P300 and are unhappy with its focus and metering, try using the program mode or auto scene selector instead, when you want to \"point and shoot\" instead of using the manual controls.UPDATE 2: A few more tests and I'm a bit less happy with the camera. If I could drop this down to 3.5 stars, I would. I really like the ergonomics, the menus, the LCD. Using it is still fun. I've shot a number of comparisons with my old 8 MP Canon SD 850 and the results are mixed. Macros are way better, but that's not what I bought the camera for. I didn't bother comparing video since the P300 HD I'm sure will blow away the SD 850's SD. In other situations it was mixed, with the P300 not always better.Like all point-and-shoots, this is a compromise and there is going to be a sacrifice in return for weight, size and affordability.FINAL UPDATE: I took the P300 out for some serious shooting last weekend, including several hours with my friend and her new Canon S95. We tried shooting several of the same scenes (although P300 zooms out a bit wider and S95 has a bit more of a telephoto, so it often wasn't exact). I was happy with the vast majority of the P300 photos. There were some where the S95 versions were better, especially when it came to detail in the photos. But without comparing, I was pleased with the majority of photos I shot with the P300. The difference didn't seem all that massive except for a couple, and that might have been because I didn't select the best mode.On the other hand, the P300 video was quite a bit better than the S95 video, if that matters to you. It does to me. I shot a video at an indoor party last night and was very happy with the way it came out. I didn't hear any motor noise when zooming in and out in what was a pretty loud room.Ergonomics: I enjoyed using (and carrying) the P300 more than the S95. It's slightly lighter. I like the Nikon dials and menu setup more than Canon's -- that's just personal preference, but I've never particularly cared for the menu setup on my old Canon P&S; either. I also found the mode selector dial somewhat hard to turn on the S95 compared with the P300.Bottom line: I'm using this to post photos on the Web and occasionally make 4x6 prints, and also to shoot video from time to time. If I was looking for a primary camera to shoot serious still photos -- that is, if I didn't also have my DSLR -- I'd likely pay more and go with the S95. But as a casual supplement to a DSLR, I recommend the P300.", "Date": "April 5, 2011"}, {"Title": "makes a great carry camera.", "Author": "J. Parkes", "ReviewID": "R1ISWMSOMBUIDA", "Overall": "4.0", "Content": "I am a Nikon fan and though Cannon has done a better job with it's P&S; cameras, Nikon has finally stepped up it's game.I use a Nikon D90 with an array of great lenses, but the truth is unless i plan a shooting day i'm just tired of having to lug around a DSLR and it's bag of essentials. I will always need the big rig, but on a daily basis the P300 is great, slips in a pocket and is very quick to start and snap pictures. I find it comes with me every day without thought or worry. The only big deal for me is the lack of a circular polarizer filter for outdoor use here in Florida, but i don't think any P&S; will give you that.The low light performance is terrific as is the vibration reduction system, there are a lot of scene modes to play with and full manual control. The auto focus is quirky and i need to pay attention, but is fairly reliable....as for all around performance i'd give it a full five stars if it weren't for the auto focus, the image quality is fine, though outdoors the camera has a tendency for light artifacts if your not careful, but that's so in all the P&S; camera's i've tried.The optics are great, the battery life is good, the flash is rarely needed but works well, Start up is under two seconds. low light performance is terrific, the video feature is fine for an occasional video shooter like me, but will never replace a good quality video camera.In all a great little pocket camera, keep an eye on your focus and you're going to get good results.I expect the next generation of this model to have improvements in its auto focus, but then no camera is perfect, and the skill of the shooter is always going to be in overcoming some shortcoming in every camera.I'm happy i have it, i use it daily, and i don't regret the purchase at all.-----------------------------------------------------------------------------------------Update~May 11I have taken thousands of shots now with the p300, and learned quite a bit about the camera's....quirks??....not a bad thing, all cameras have their quirks.The p300 continues to impress me beyond measure with its low light/indoor/night time performance!! In fact i get better results using no flash at all for 90% of my shots!There are those who really must have RAW files, for 95% of us we don't need RAW, and jpegs are just great out of this camera.One of my favorite features of the p300 is the high contrast black and white mode, along with the low lighting performance it has produced fantastic salable images!! Everyone's an artist with this camera!!Indoor work is very good, as good as a dslr if you learn this camera's functions. Bars and restaurants are usually difficult without a flash, but the p300 makes the flash almost obsolete except for certain types of shots.I often find i can do quite well without a full dslr camera, and if your'e in the market for high qaulity, but not size and price, this would make a great camera for you.I have not been outdoors much as the weather is not the best for outings yet. will update when i do.", "Date": "April 27, 2011"}, {"Title": "A really good point and shoot", "Author": "cmike2780", "ReviewID": "R212ALMQRAKSUH", "Overall": "5.0", "Content": "needed a point & shoot that had the manual controls of a D-SLR, compact enought to carry around everyday and had a quality lens. Very limited choices out there if you wanted to fill all three criteria's. After looking at the Nikon P7000, I decided to wait for the P300 and I'm glad I did. I liked the viewfinder on the P7000 and the hot shoe, but it was slow and still a little too bulky for everyday use. The interface is a lot faster on the P300 and the fast f1.8 lens is awesome for a point and shoot. The LCD is big and bright and the controls are very easy to learn. I like the video button, but I wish it was customizable for white balance or ISO control. This is a really great camera and the images are almost as good as my old Nikon D40. Almost.Indoor low light shots with the f1.8 are clean and sharp. You won't believe it was possible with a point and shoot. I also really like the retro body look.Update No.1:  As an arhitect, I use this for documenting projects in the field. The fast lens is really great for those indoor shots when all the light you have is the built in flash and a flashlight.  The images are clear and sharp and I couldn't have been happier with this purchase.  The pano is a really great way of documenting entire facades. It won't replace my D90 any time soon, but it's really nice having a good quality camera that fits in your pocket.", "Date": "March 31, 2011"}, {"Title": "Amazing", "Author": "Joseph Albanese \"The Joe Show\"", "ReviewID": "R3MQ0A6AZNATKU", "Overall": "5.0", "Content": "As a long-time Nikon fan, I have always found assurance when purchasing Nikon products. Their cameras are sturdy and durable. Their lenses are sheer perfection and set the standard for the others. Overall, Nikon stands for quality.So, it is no surprise that the newly released Coolpix P300 follows in that tradition and more than upholds the good name of Nikon.I am going to Europe shortly and my (truly wonderful) D300 is just not adept for airline travel or long, rambling, walks. Although the picture quality is perfection plus, the size and weight of the unit (I do have the battery pack attached) makes it quite a handful and not recommended for sightseeing. In their quest to perform miracles, Nikon managed to take the best qualities of the D300 and reproduce them into the P300.First off, the picture quality is excellent.  Surprised? Not really but it is good to know that in a day and age of \"slapped together\" products, this Nikon camera is still up to par with the rest of the line.  Ease of use?  If you use the AUTO function, you've mastered photography. A pro?  Then it has all the manual verstality that any photographer could need.But it is the weight (or lack of it) that is truly impressive.  Although the camera has a good, solid feel when you hold it, it weighs in at a mere few ounces. Light and slim enough to fit into your pocket.  Although tiny in size (and the P300 is miniscule), the quality of the prints it produces is truly amazing.And the rest?  You can take pictures at night with no problems, the flash is good and winning accolades is the zoom - wide angle.Although I will using this as I trek through the United Kingdom and France, don't be surprised if you see me sporting this camera around the good, old, USA.", "Date": "March 23, 2011"}, {"Title": "Nikon P300", "Author": "A. Markwell \"Andy a700\"", "ReviewID": "R1BB63LUM09SXI", "Overall": "5.0", "Content": "I ordered my Nikon P300 on Tuesday evening using the free postage option, it was with me by Friday, great service by Amazon.I'd previously owned a Canon S90 which is a superb compact, but only has a 28mm wide angle lens & VGA video. I settled on the Nikon P300 as it has a really fast 1.8 lens at wide angle, an extra wide 24mm lens (these are 35mm equivalent focal lengths), and full 1080P video so great for travels. It doesn't have RAW but then if I want to go to that level I'll use my SLR Camera.My only initial reservation in buying this camera was it has a smaller sensor than the S90 so I was slightly concerned at a possible image quality loss & more noise. I needn't have worried. The picture quality from this compact is amazing and low light capabilities superb. I took some pictures last night to try it out when it was semi dark and the camera produced great results, it can see much more light & detail than my eyes can (& no I don't wear glasses yet!!).There are loads of other features I'm looking forward to trying out, but the 1.8 lens has got to be the real selling point. Another good feature is that if you have a modern TV with CEC control, you can use the TVs remote control to control your photo & video playback from the camera when hooked up via HDMI lead. Clever!!The only thing which is not a brilliant idea is that the battery charges in camera, it's great if you only ever need that one. However, chances are you'll need another when travelling or on holiday (I mean vacation to you readers, I'm English !!). The Nikon chargers are expensive so I've just purchased an alternative brand charger & spare battery off here very reasonably priced.In summary, if you want a superb compact with a fast wide angle lens & full manual controls, forget the Canon S90 or S95, get this & it's cheaper too!.... I'm off to take photos!! (if it's not raining, I'm in England !!!)", "Date": "May 11, 2011"}, {"Title": "Review from father of young children who also owns a DSLR", "Author": "Peter Choi \"Geek\"", "ReviewID": "R26J84EDNNL5IT", "Overall": "4.0", "Content": "Chances are that if you're even considering this camera you've already read tons of reviews that reiterate the camera's features and specs.  Here's a practical review that I hope you find helpful if you're in the same situation I am.I own a Nikon D90 DSLR camera.  I started photography as a hobby before my oldest child was born 4 years ago.  I'm by no means a photography expert (that takes YEARS), but I've gotten very familiar with common photography techniques and controlling manual settings, i.e. aperture, ISO, shutter speed, white balance, etc.  My kids are currently 3 and 1.My primary goal in getting this camera was to replace an aging Canon SD500 point and shoot.  I wanted something fast and light that I could take with me on day trips (and possibly traveling) instead of my DSLR, as well as something that wouldn't be too intimidating for my wife to use.  I also considered the Olympus XZ-1 and the Sony HX9V (I know, they're all in different classes).What attracted me to the Olympus was the fact that it has the largest sensor, widest aperture across its entire zoom range, and hot shoe for attachments.  What attracted me to the Sony was the fact that it had the best video and longest zoom range.I settled on the Nikon P300 because it appeared to offer a balance between the other two and it happened to be the cheapest of the bunch (at the time I bought it the price dropped to a REALLY low price so I just pounced on it).What I like===========================For a point a shoot, this camera is pretty fast, i.e. the time to take a pic after you turn it on and the time between shots.  This is crucial with kids.  You can also turn on continuous shooting which does something like 7 or 8 shots per second at full resolution, almost twice as fast as my D90 DSLR!  Great for kids!  Get every facial muscle twitch as they slide down that slide!  Woohoo!Ergonomics are great.  Love the rubber bumper on front.I love that it has a dedicated video button.I thought I would miss having a longer zoom range, but in practice I find that I don't really use it much anyway.  With kids you're usually right there by them.  Unless you're a bad parent, then boo on you.The large aperture is great for getting quick shots in low light.  However, it's not magic.  You can only do so much, even with a wide aperture.  I still get blurry shots every so often, probably need to jack up the ISO.  It appears that the auto settings max out the ISO to 800 (anything higher causes a lot of noise in the image), so to get higher ISO you have to be in one of the manual settings and set it manually.  With kids, you tend to leave it on full auto because, really, you don't have time to fiddle with settings.Photos come out crisp and clear as long as you don't pixel peep (zoom in 100% to look for imperfections).  Color reproduction is amazing, colors really pop without being unnatural and overly saturated.  Metering is usually spot on, meaning it knows how to balance the contrast with different amounts of light in the frame.Love that it has a physical pop up flash so that you can control for a certainty whether the flash fires or not.  Also like that it's a mechanical spring loaded mechanism rather than a motorized flash, one less thing to break.I love the boxy retro look and feel.  Even though it's bigger than my old Canon SD500, it feels lighter.  It fits great in my pockets, regular or cargo.  I can use the same pouch from my Canon if I want, too.Screen is HUGE and BRIGHT and CRISP.  No problems whatsoever seeing it outdoors with sunglasses on (except when turning it sideways if you wear polarized glasses, then you can't see it at all, blah).I like that it takes video in H.264 .mov file format.  It seems to be more universal and can play on more devices without having to convert it or install a special codec.  The Sony takes video in AVCHD format.  The Olympus I didn't even bother to check because after seeing video samples, I didn't really care to even bother.  I love that there's a dedicated exposure lock while taking video, but I wish I could set it before I start recording.  Maybe there's a way, I just need to look it up.What I don't like===========================Yes, it takes 1080p HD video at 30 frames per second with stereo sound, woohoo!  Buzz words galore!  The videos come out crisp, the colors are great, BUT, the image stabilization SUCKS compared to the Sony, and the mics suck up wind noise like Charlie Sheen sucks up blow.  Also if you pan too fast it gets choppy.  Maybe I need a faster SD card, but I'd think that if the SD card had issues keeping up with the camera it would just stop recording altogether rather than skip frames.  Who knows, I'll give it a shot.The autofocus doesn't always work right when recording video.  I have it set to continuous autofocus, but it seems to have a hard time deciding what to focus on.  In fact, even if you leave it pointing at a non-moving subject, you can sometimes see the focus going in and out on its own.  If you're following your kids around and they go close to far to close, and you try to zoom in and out, the focus takes a while to catch up.Also, when you're recording video in a relatively quiet environment and you zoom in or out, you can hear the zoom motor in the video recording.  zzzzzzz.  zzzzzzzzzzzzzz.  zzzzzzz.  That's what it sounds like.The camera can be quirky.  Sometimes it doesn't turn on, or it turns on then off then on.  Once, it locked up on me and I had to take out the battery.  The battery door can be easy to open if you hit the release just right.It does not come with an external battery charger, you have to charge the battery in the camera.  The connector is proprietary, not mini or micro USB.  The battery lasts an OK amount of time, but I'd get a spare and an external charger if you can.  The battery life indicator doesn't give much warning as to when it will die, it goes from full to low then off quickly.Other notes:===========================So the photos aren't as good as a DSLR or probably the Olympus.  The video isn't as good as the Sony.  But for the price, you really can't go wrong with this camera.  It isn't perfect, but I think so far I'm impressed, and it's been a great camera to carry around and follow the kids with.", "Date": "October 4, 2011"}, {"Title": "Awesome.", "Author": "Jules Fitzegibbons", "ReviewID": "R3E5X6BHSVEY9P", "Overall": "5.0", "Content": "Europe trip 2011.  I had to decide whether or not to bring my Nikon D90, Canon 7D....or buy a little point and shoot that might be easier to carry around.  Well about a week before I left for Europe, my friend over there had his D90 stolen....SO, I opted for the Point and Shoot.  After much research online I decided on the Nikon P300.  It was the best decision I could have made.  I'm a photographer by trade, and the images coming from this camera are pretty amazing.  Everyone else I travelled with stopped using their cameras after a while and we just used the P300 because the pics were so much better (Crisper images, better in low light (no flash needed), nice wide angle lens, etc, etc).It also shoots decent video - Not great, but decent.  The video looks great on the little 3\" screen but once I played it through HDMI to my 46\" TV at home, didn't hold up quite as great. Video quality is no where near a Canon 7D or similar, but still for under $300 it's more than I expected.  And again in low light, it still looks great.My favorite thing about this camera is that I almost never had to use the flash - even at night.  It performs on par to a DSLR's low light abilities (yes a bit more grainy, but still quite usable (super fast lens 1.8 I believe).  I can't say enough good things about this camera.  It's the first point and shoot I actually enjoy using.  It's menus are simple, it's easy to use.  Ultra compact - fits in your pocket - not like some of the other leading Point and Shoots.One other great thing about this camera is it sort of lets you choose your exposure in Auto Mode if you trick it.  I've tried this with some other P & S's and it doesn't work well, but this camera will lock exposure when you hold down the shutter button half-way....SO if you want to over exposure your scene a little (to compensate for backlighting for example), you just aim the camera down (or to a darker area) to open up the f-stop and lock the exposure and then boom press the shutter the other halfway down and you've got a little extra light.  At first this was a little weird, but after doing it a couple days, it became second nature.  The camera does have manual shutter and aperture controls (Again awesome feature you don't find on many other P & S's) but this little trick is actually faster once you get the hang of it.  Also - other great feature - Flash will never go off in Auto mode unless you click the button to raise it up.  I especially don't like flash unless for a little fill or something so - for me this was a great little extra bonus.  We got some amazing shots just using the exposure-lock trick in Auto mode with this camera.  I'll try to upload some pics soon.So ANYWAY, everyone that went with me on the trip and the people I've showed our pics to are all raving about this camera now too.  I don't rave about too many products, but this is a great one.Oh one other cool feature that seems kind of gimmicky but I ended up using it all the time was the high contrast black and white filter.  I wanted to upload our pics during the trip and I love B&W; photography for architecture - and the B&W; pre-set on the camera creates really unique looking images, so anyway - not great if you're going to post-process, but if you want instant B&W;'s it's a much better filter than most other Point and Shoots I've used and really fun.", "Date": "August 24, 2011"}, {"Title": "Amazing little camera", "Author": "G. OLAIZOLA", "ReviewID": "R2PEG0H3F0HQ9M", "Overall": "5.0", "Content": "First of all, I am not a professional photographer and I don't care much about the possibility of getting photos in raw, but I like to get high quality and crisp images when I shoot.In the last couple of years I've had a few digital cameras, compact and DSLR to compare with, and this little camera is amazing. I am glad that I bought it. I've had it for a week now and I have been testing it in many situations. I am very pleased with the results so far and I couldn't believe the images that I have been able to get at very low light. They are amazing! They are clear, crisp and full of details that I could barely see in the scene with my own eyes!!HD videos are excellent too and battery life is pretty good. I recommend this camera to anyone.", "Date": "April 26, 2011"}, {"Title": "Small but Powerful", "Author": "Shahr Yar", "ReviewID": "R1JJREA93I22NO", "Overall": "5.0", "Content": "I'm not much for words, but as a professional photographer, I love it. And my girlfriend who I bought it for does too. So great to be able to tuck such a powerful camera into a pocket or purse.The lens on the P300 is amazing. The ability to get short depth of field shots in such a compact camera makes me wonder when I might feel compelled to lug around my SLR when not working on an assignment. The only advantage SLRs have, in my experience so far, are the ability to zoom to lock a focal point and then recompose, as well as save in RAW format. But those are perfectly acceptable for a compact camera.Lovin it.", "Date": "July 15, 2011"}, {"Title": "Why I picked Nikon P300 over Canon S100 and Lumix LX5", "Author": "D. Choi \"Early Adopter\"", "ReviewID": "R4WZUQGEAI1TC", "Overall": "5.0", "Content": "First I just want to say there is no camera that is perfect for everything.  I own a Nikon D7000 DSLR with some serious lenses and love the Depth of Field type shots.  Knowing that why did I pick the Nikon P300 simply because of its price and feature for it.  Its the best bang for the buck.  I could have pick a smaller camera but I really wanted the P/A/S/M capability even though it doesn't have RAW.  If I want RAW then I pick up my D7000 and get the right pics.  The whole point of this camera is the size and for what it offers. The smaller P&S; cameras cant give the same performance.  This camera has a f1.8 vs Canon S100 f2.0.  Panasonic Lumix LX5 is too large and should be compared to the new Mirrorless cameras like the GF, NEX, Olympus PEN etc.Here is why I still picked the P300 over the S100 even with its improvements.1) Price $275 vs $4402) Screen 3\" 921K vs 3\" 461K3) Panoramic shots 180 and 360 degrees4) Built in effects5) 1.8 vs 2.06) 24MM vs 25MM and doesnt have f5.9 like the CanonThe advantages of the S1001) RAW Files2) Control Ring & User define3) Built qualityThe both have1) rubber finger grip in front and back2) CMOS but Canon I think is bigger3) 1080P Video4) P/A/S/M controlIf you buy this keep your expectation real all of these cameras cannot get pictures anywhere near a real DSLR that Blur background factor you cannot achieve the same results.  If you want something better invest $500 into Nikon P7100 or Canon G12 for the compact and control.Again I picked this as a simple camera to carry around with P/A/S/M features and great video.  Low-light is very good but not DSLR quality in any of these cameras.  Noise level in ISO 800 and greater is high again you cannot get the same quality in even the entry level DSLR. I don't like using flash when I don't have to.  AWB is average not DSLR quality.But the price of the Nikon P300 vs all other compact manual cameras is the best and what you get for it is amazing.  If you are traveling and someone steals it, it won't be that bad of a loss vs. S100. That to me is the deciding factor because the end result is the same - photo quality.  But if you want the best picture just use your DSLR and don't complain lugging it around.Again why did I pick this because it was cheap and i wanted the P/A/S/M features for when I travel and cannot bring my Nikon D7000 DSLR around.  Mostly for partying at nights in clubs in NYC where having a DSLR can be a pain to carry around.  My other party camera is the Nikon PJ1100 - girls go gaga over the projector and its fun to project images on people.  It gets their attention and I become the attention.  Enjoy life everyone....Update... I got this case Lowepro Santiago 20 Camera Case (Black)Fits like a glove and also holds an extra battery too", "Date": "September 16, 2011"}, {"Title": "Really happy", "Author": "Glen", "ReviewID": "RXN4901HPX12F", "Overall": "4.0", "Content": "I compared the G12 and the S95 Both may be a bit better camera, but the P300 cam in at $100 cheaper on Amazon. I tried the Video and Continuous shooting (Sports) the only complaint I have is that the screen goes blank during the Continuos shooting and the Zoom isn't functional during video. Pic are Fine and the screen is bright enough to see in bright sun. BAttery is rated at 240 pics. I got more than that when I didn't use a flash and about that when I used the flash all the time. Love the Wide angle. I can get ay more in view than the previous camera. Also love the 2 dial system to control and see the f-stop and Shutter speed in manual mode. Backlight feature impressed the daylights out of me. Feel free the shoot against a window. Also, It doesn't look like anything more than the average point and shoot for those who may steal a DSLR. The optical zoom is low but the optical is fine. Can always crop it afterwards.", "Date": "June 16, 2011"}, {"Title": "Returned P300 for its unsatisfactory 1080/720 HD video quality", "Author": "Jeffrey Lee", "ReviewID": "R1J324JIPANVIV", "Overall": "2.0", "Content": "Pros:1. Nice ergonomics2. Good appearance3. Rich features4. DSLR grade LCD display5. Support 120fps 480p movie6. Competitive price in it's classCons:1. Choppy HD movie in 1080 and 720 mode. DO NOT BE fooled by the advertised 1920x1080 p30. Yes, nominally P300 can record in 1920x1080 p30 format, but the quality of the recorded video is unacceptable. I'm not comparing it with a high-end camcorder, DC can not compete with them for video recording. I'm talking about the comparison with DC from the same class, such as Canon sx230. I bought P300 and borrowed a sx230, so I could shoot the same scene and compare the result side-by-side. When you pan or zoom, P300 produces heavily choppy images, SX230 has similar effects but considerably less. Even without panning or zooming, the AE of P300 produces blinking effect in the recorded video. To avoid this, I have to manually lock and unlock AE during the recording, which is painful. SX230 does not have this AE issue at all.2. With the provided charger, the battery can only be charged with the camera body. That means you can not use the camera while charging a spare battery simultaneously.---Some update:Someone blamed me for using a slow SD card when comparing HD video performance.I don't think this is the reason for the choppy images (It's common for a point-and-shot, more or less). First, the card I used was a Sandisk Extreme Pro SDHC 8GB (45mb/s), I think it's fast enough. More important, I used one *same* card in two cameras when recording the video one by one. Yes, the scenes could not be identical, but practically are the same. Then I downloaded the videos to a dell xps-8300 to compare side-by-side. I tried to eliminate differences other than the camera itself in the comparison, so the performance differences were due to the camera, not the card or other factors.I would like to be clearer for my point. An inferior video performance of P300 was what I observed in my comparisons. My test WAS NOT a lab test, but a real-world test that simulated my daily usage. I tried both in a dim indoor environment and a bright outdoor street view using auto mode, results were similar. Unfortunately, another camera outperforms P300.", "Date": "June 29, 2011"}, {"Title": "Superb Camera - Perfect", "Author": "D. Hannan \"David\"", "ReviewID": "R63RXZHKU6B20", "Overall": "5.0", "Content": "Being a Nikon DSLR user for years, I wanted to remain loyal to the Nikon brand.  After reading review after review for weeks, I was turned onto this little beauty.It's amazing.  I was amazed as to how light the camera weighs, but not light as in \"cheap\".  Just not heavy or \"tank-like\".Focus is razor sharp, low light ISO is quite literally the best I've experienced in a point and shoot of any kind.  It really is on par with some of the more expensive Nikon DSLR range (not quite D700 or D3, but up there).It feels good - controls are intuitively placed and solid.  The dials feel as they've been attached by Thor's hammer - really solid.Best point and shoot I've owned - I used to be a Cannon guy in the point and shoot line - not any more.Oh, and if like me you were tempted by the Nikon Coolpix S9100, save your time - don't buy it.  It's worthless.  Those $1 one-use-only cameras at CVS take sharper pictures.  I returned it within two weeks - awful, bulky, and feels cheap.", "Date": "January 13, 2012"}, {"Title": "Best in low-light, like it better than the Canon S95", "Author": "russ", "ReviewID": "R2B8UP7S2YTBD8", "Overall": "5.0", "Content": "I've owned and tested the GF1, S95 and I like this one the best.  This camera fits in your pocket nicely, I don't really shoot my DSLR anymore.  I like to take night photography of the city and this camera is a rockstar.  I no longer carry a tripod anymore.  The back-lit CMOS sensor is what I attribute the low-light abilities which, when I tested against the S95 was the clear winner with proper white balance and sharper pictures.  Not to knock the S95 at all, its great.. but I prefer the P300.", "Date": "October 19, 2011"}, {"Title": "Fast Low Light Wide with good Panorama", "Author": "M. Svendsen", "ReviewID": "R3AW8F10CXBKGL", "Overall": "5.0", "Content": "I have used this camera about 8 months ~ 2300 pics.Semi Auto Only 'auto scene' with 'auto select' is fully automatic. This is your point and shoot setting. No other dial settings are automatic. You will have to turn on the macro for close ups and set the shutter speed and aperature when the camera tells you it needs you to change something in order to get a good picture. It does this by flashing a red box if the camera cannot focus. At first I wanted fully automatic point and shoot until I tried to focus a Panasonic S3 (which has very good reviews) on a nearby object. The S3 would not lock onto the nearby object but always selected a far away object. After that I considered keeping the P300.Lens/Low Light/Wide angle One of the main reasons to buy this camera. Low light pics inside dont require a flash unless really dark!  Take a shot in an almost dark room and this camera will  see it all without a flash! 'Night scene - tripod' without  a tripod, was not good until I set it for 'night scene'  'hand held'  the results are very good night shots.(Hand held setting turns on anti shake and best shot functions) The resulting night shot lets you read a street sign about 75 feet away using only 3M pixels and street lighting only. I have used the flash a few times out of hundreds of pics. Wide angle lens captures a lot of area, nice!Quality/Cost You pay more but get more. Feels like quality in your hands, body, knobs, dials, buttons are all metal. Solid build not much plastic.The dials make everything fast. This camera is designed to get the aperature and shutter settings out of the menus and onto the dials so you have quick access to them.Features This camera has many useful features. Menus change for dial settings revealing more options. Fireworks setting is no good w/out tripod. smeared firework photos. Auto settings are not as automatic as other brands. Ex. Macro only comes on after turning it on, and only turns off after turning it off. Even if the camera is turned off it stays in macro mode until you turn it off. I like this as you can continue your macro shooting without having to reactivate the macro evertime. But other brands (Canon and others) automatically set the macro just by getting close to a subject.  At first I did not like this but now I like it.Size Not a super compact camera and not a large camera. Fits easily into a mans shirt pocket with room to spare but not a very small camera either. The right size to hold in your hands with well positioned rubber grips. Camera is light weight.Misc  Fast start up and shutter. Beautiful hi res display, Battery charges inside camera. Good if you dont want to remove batteries not so good if  you want to have two batteries for quick changing. (you would have to buy an external charger) Compression may be a little high - sharp photos but could it be sharper? The 'scene' setting with auto select is better than 'auto' mode most of the time. Battery life is 200-300 pics but battery meter goes from full to dead in only 15 minutes. 'Special' USB charge/download cord, it is propietory, Not good as the cord takes more room than a short USB cord. Cord on bottom of camera, so camera rests on its face or back while charging or downloading. Zoom is 4.2X which is all I need. Wide angle and low light is more useful to me than a big zoom. Color saturation could be more, you can add more manually.Panorama Much better than other cameras. You can panorama horizontal AND vertical, cooool. Vertical panoramas are great for city shots of tall buildings, etc. Not enough time for 180 sweep, 120 deg. is most you can do with 180 deg setting.  360 deg sweep is too long for 180 deg. Manual panorama assist is difficult. Though not perfect I use panorama frequently.Summary This camera is for anyone who wants a Quality LOW LIGHT portable FAST camera with WIDE angle and full control. Not for someone who wants  just a point and shoot (although it can be a point and shoot in 'auto  scene' ) I was going to return it for the high cost until I experimented  and discovered it is worth the money. Would have given four and a half  stars because of special cord and not enough time for panorama. Low cost point and shoot cameras feel cheap. I like quality things because they last...I hope it does last a long time.", "Date": "January 21, 2012"}, {"Title": "A good semi-premium compact...", "Author": "Gladius", "ReviewID": "R2WCCQQYU6HF51", "Overall": "4.0", "Content": "In today's world, Canon just released a $799 P&S;, so I'll call this semi-premium.  I tested this camera against several others, and while all cameras have trade-offs, this camera suits me.  I tried the G12, SX40, P500, 100HS, S95, D3100, and a few others I already own.Initially, I kept the G12 (the P300 was a late attempted purchase by me) and am very happy with it.  It was $369 from Amazon and is a great all-around machine that should last a long time.  It has controls galore snd can be used by amateurs to pros.  It has a larger than typical P&S; sensor, RAW, good build quality, good lens (if a bit slow at 2.8 - 4.5), viewfinder (rare these days in P&Ss;), good articulating screen, good ergonomics, good macro, and so on.  It's fast enough.  5x telephoto.  Fairly easy to carry but big for a P&S; (as I knew).  The viewfinder is important as I'm used to using one and pics have less blur from camera shake.  Also good for sunny days.  IQ is excellent.So, what about the P300?  I wanted a second, smaller camera that could fit in a pocket.  The S95/S100 is (are) too similar to the G12.  I also wanted a camera with a faster lens for indoor use without flash.  Price was something of an issue and the P300 for $245 with a 1.8 wide angle lens (to 4.9; 4.2x telephoto) seemed worth a try.  The 1.8 usually allows for decent pics without flash.  Other fast lens cameras are about $100 more.  The LCD does not articulate but is very high quality at 921,000 pixels.  The camera is fast for a P&S.;  The sensor is not larger than typical P&S; sensors (such as the one in the G12) but the P300 does very well with its backlit 1/2.3 sensor (vs. 1/1.7 on the G12).  Build quality is not quite up to G12 standards but it is metal and MUCH lighter than the G12.  IQ is very good and colors are excellent.  The flash is easy to turn on and off and is mechanical (one less thing to break) - very nicely done.  There is no viewfinder but the camera is fast enough and has a good enough IS system that I get little blur despite modestly steady hands.  It has no RAW but I don't yet use RAW (and may never use it).The camera does have internal battery charging but not a big issue for me --- one can always spend just a little and get a wall charger if it is an issue (get a third party charger and/or 2nd battery).  Video could, perhaps, be a bit better, but I'm primarily interested in pictures.  For these two reasons, four stars and not five stars.For me, these cameras compliment each other very well.  I'd say I'm an advanced amateur looking to become a better advanced amateur.  Next for me could be a longer zoom P&S; (SX40?) or, perhaps, a DSLR like the D31000 (about $550 with good kit lens).  We shall see.I know the P310 is coming out soon but it has few changes from the P300.  More megapixels (not necessarily good in a compact with a small sensor --- e.g., noise), one more control dial, and, perhaps, better video.  And it will cost more at first, if not for a long time.  It seems to have the same lens, looks the same, and doesn't seem very exciting for P300 owners.  Maybe if the sensor were increased to about 1/1.7 size.  Even then I'd have to read some reviews and be convinced.  I absolutely don't see the need for 16 megapixels.P.S.  Just as many prefer the S95 to the S100, newer is not necessarily better.  The P300 just works and easily pumps out good shots.  The 1.8 lens is a great feature for $245 (maybe soon to get even cheaper).  Recommended.", "Date": "March 22, 2012"}, {"Title": "Decent All-Around Performer But Does Have Issues", "Author": "Sacha Potter", "ReviewID": "R1UN9S6UHTA87N", "Overall": "4.0", "Content": "I needed a camera for days when I didn't want to lug my DSLR around.  I've owned two Panasonic travel zoom cameras but wanted something that could produce better low light photos and had full manual controls. I shopped around and narrowed down my choices to the Nikon P300, Canon S100, and the Sony HX9V. I ended up with the P300 and have listed my impressions below.PROS-Decent all around photo quality-Decent low-light performance given sensor size-Fast f/1.8 lens-Attractive design-Comfortable to hold (even for larger hands)-Build quality is good-Fairly compact and light weight-Screen is very sharp and reasonably bright-Full HD video capture w/ stereo sound-Menu structure is intuitive-Direct movie record button-Metal tripod mountCONS-Auto focus is sluggish or nonexistent in movie mode-No orientation sensor means portrait pics get imported sideways-No RAW image capture-Aperture drops to f/4.9 at full zoom-In-camera chargingMINOR GRIPES-Camera doesn't display ISO info pre-shot-No \"quick\" menu during shooting-Charger port is located on the bottom of the camera-Menu operation is sometimes sluggish-Battery door is flimsier than most other plastic ones-Battery door can open when removing camera from your pocket (maybe that's just me)The erratic autofocus during movie recording is big issue for me but overall I like the camera. So far the photos are above average quality for the price range / sensor size.  The f/1.8 lens allows you to use a lower ISO more of the time. I am still undecided as to whether or not I will keep it but so far the pros outweigh the cons.UPDATE: I ended up returning the camera for the Sony HX9V. The Sony is fantastic for movie recording but is worse at higher ISO because over active noise reduction smears details. The Sony is also larger and harder to fit in your pants pocket.", "Date": "October 27, 2011"}, {"Title": "Awesome little camera  READDDDDDD", "Author": "jason", "ReviewID": "R3RJ4E08OOVDKA", "Overall": "5.0", "Content": "I am not a pro but a casual family shooter and just needed a camera that worked!!!!I have read alot of reviews that say this camera had choppy 1080 p video .  While first shooting video when i got the camera the video played back perfect on my camera and when i uploaded to my computer and played it back on i photo it started to get choppy????The camera is not the problem......it is the computer......playing 1080 video takes alot of resources  so make sure you turn off all other programs if you have this problem and booommm  problem was fixed  video was nice and smoothAs for taking regular photos......  awesommmmeee.  takes some getting use to how to navigate thru menus ect but once you learn to operate the camera it works great  espically in low light areas  i was taking pics of item and hardly had any light (no flash) and pics were still turning out great.I have taken aprox 400 pics so far and have no complaint for a 280$ camera!!!  If you want better then just go spend more money but for a small compact easy to carry around camera AAWESOME choiceI recommend buying a extra battery and battery charger so if out all day you can take photos without fear of draining your battery you only get about 200-250 pics depending  if you use the flash alot or not...I also purchased a SANDISK 10 speed class 32 gb sdhc card so you are not waiting on the memory card to load data..  it is very nice shot to shot is quick and video is never waiting on the memory card which you can get if you use slower cards like speed 4 ectIf you are also looking for a perfect little case i bought the LOWEPRO APEX 30 fit camera extra battery  perfect and has protective weather reistant cover  nice and small easy to pack around a theme park all dayI have ownened a DSLR and they are great no questions  but they are big and this is great is your are looking for the following1:  small easy to carry around2: 1080 hd video with sound3: Great Low light pic quality4: menus are easy once you learn them5: the anilty to manually control your pics if you want6: a camera that works great in auto mode for the wife to be able to take great pics7: awesome regular photos", "Date": "August 30, 2011"}, {"Title": "Great camera", "Author": "Old Hiker", "ReviewID": "R31QG0KO9TOGED", "Overall": "5.0", "Content": "I have used my Nikon P300 for three months now and I am very happy with it.  It is the fourth digital camera I have owned and by far the best.  I especially like the 24mm equivalent wide angle lens.  The fast f1.8 lens opening is also useful for taking inside pictures without a flash.  This is nice where a flash creates glare in a photo.Another feature that I like is the two panorama methods.  With easy panorama you can just choose either 180 or 360 degrees and pan the camera.  With panorama assist you actually build up the panorama slice by slice.  In either case this is a very valuable feature for me as I like to photograph mountains when I hike.The camera can take some extremely beautiful night time pictures.  It is fun to experiment with this capability.The controls are very logically laid out--the best that I have seen on a digital camera.  You can record a movie by just pushing a button, no need to go to the menu or dial.The pictures are very sharp.  I was always disappointed with the Canon PowerShot A590IS's picture quality.  The Nikon is far sharper for flash and non-flash shots taken indoors.  I have not tried the more expensive Canon's so I am not sure how they perform.I am a fairly experienced photographer and feel that the controls on this camera are more than adequate for me.  I like to use both aperture and shutter priority in certain cases.All in all, I do not see how one could ask for anything more in a compact digital camera.  I will definitely recommend this camera to my friends.  I don't think you will be disappointed if you buy it.I can add that if I lost this camera today, I would immediately buy another one. I can't say that about some digital cameras I have owned.", "Date": "August 28, 2011"}, {"Title": "P300: First Impresions", "Author": "K. Jones", "ReviewID": "R1397IR9M7Z2HT", "Overall": "5.0", "Content": "Greetings,I bought a Nikon Coolpix P300 a couple of days ago to replace a Cannon SD1000 that recently quit working. My primary camera is a Nikon D7000, but I like to have a smaller compact to carry with me in situations where I don't want the lug a big bag around. I won't go through all the detailed specs on the camera since you can find those in dpreview's detailed review. I just wanted to share my initial impressions from a real-world user's perspective.1. Construction. This thing seems reasonably well built, but does not have the same tank-like feel of the SD1000. I never had any worries about slipping the SD1000 into my back pocket and leaving it there (even if I sat down on it). While the P300 will fit in my pocket, I doubt it would fair as well if actually sat on.2. Controls / Menus. The control layout is fine and very usable. I like the dual wheel control. The menus are easy to navigate. I wish there was a way to program the wheel not being used in aperture to shutter priority mode to control the ISO.3. Image Quality. The image quality is good. Not large sensor DSLR great, but good. I was concerned after reading a lot of reviews that the images might appear over-sharpened, but this is really not the case (or maybe I just prefer my images a little over-sharpened). I haven't had a chance to really put the camera through its paces, but thus far, I'm pleased with the image quality.4. Video. I didn't buy the camera for video, but it is always nice to have that capability. The P300 has a couple of interesting modes that I haven't had the chance to play around with yet. I have shot some sample normal 1080 video, and it seems to work well enough for a P&S; camera. Some reviewers have commented that the AF doesn't work well in video mode, but I found it worded perfectly well using single point AF (which it what I use 90% of thI haven't Ihaven't tried it with other modes.5. Other Features. The camera has several other interesting scenes/features that I probably won't use on a regular basis and haven't tried out yet such as the Night Landscape mode, HDR, and Panorama.6. Overall Impression. I like it a lot. I like the sort of retro boxy look (I hate the current rounded look of the Cannon P&S; cameras). I seriously considered the Cannon S95 over this camera, but in the end went with the P300 due to the wider (and faster lens), better LCD, looks, and cheaper price. I know many feel the 1/2.3 sensor can't compete with the 1/1.7, but I honestly can't tell that much difference in the examples I've seen posted, and to be honest, they both fall well short of my D7000.If you want a small convienent P&S; camera with some manual control and decent low light performance, I don't think you'll go wrong with this camera.Kurt", "Date": "July 31, 2011"}, {"Title": "Perfect combination", "Author": "Neil Suhre", "ReviewID": "R3MY0SMAX100KK", "Overall": "5.0", "Content": "I've been searching for an easy-to-carry companion to my Olympus DSLR - a mix of image quality, portability, and features.  Spent a lot of time reading reviews, comparing specs, etc. and had my choice narrowed down to the Nikon P7000 and the Nikon P300.Very different cameras to be sure.  The toughest question I had to answer in my mind was, \"What is most important?  Portability or features?\"  While I loved everything I read and experienced about the P7000, portability won out in the end and I chose the P300.Knowing I was giving away some features and, perhaps (based on a number of reviews) some image quality, I was a bit skeptical when the camera came in.  I'm happy to say that my skepticism was short lived.So far, so good - really good!  For the price (sub $300), the combination of features and image quality are fantastic.  As others have mentioned about cameras in this range, they will not compare to the DSLR in terms of either features or quality, but for what it is, it fits the bill perfectly.The f1.8 lens, at the wide angle, delivers great low light and macro quality.  Across the range, again, I'm quite pleased with the image quality versus my last point and shoot.  Have mostly experimented with P and M mode - P for those times when I really want to simply point and shoot.  I find the buttons and menus very intuitive even though they differ from my Olympus, which makes moving into Manual mode a snap.Though I didn't buy it for it's video capability, I have used it with very satisfactory results.  Shooting friends playing badminton, the P300 kept up with the fast action and produced usable audio.  My friends were amazed at the quality while viewing the video in camera.I continue to put it through it's paces, but for now, I am totally satisfied with the P300.  For it's price, it really performs!", "Date": "June 23, 2011"}, {"Title": "Nikon P300", "Author": "JAK", "ReviewID": "R3UTXJDRMGIT3F", "Overall": "5.0", "Content": "An outstanding camera if you can live without shooting in RAW format, which I can!  Great size, weight & feel!  Very portable and a great substitute for your DSLR when traveling light.  As a frequent global traveler who travels light this camera meets all of my expectations.  Low light capabilities are very impressive; I also like the fact that you have to actively select the flash if you want to use it. One disclosure would be that I am a Nikon fan, but I did direct comparisons with the Cannon S95, which is also an exceptional camera of similar size and weight... but I could not justify the extra $100 for what I need the camera for.  Overall, I am very happy with the P300.", "Date": "April 26, 2011"}, {"Title": "Nikon COOLPIX P300", "Author": "Sophia T", "ReviewID": "R33VYODLM93BJV", "Overall": "5.0", "Content": "This is truly an amazing camera.  I've owned several Panasonic cameras with Leica lens in the past because I love their clarity and sharpness. However, this time I decided to give Coolpix P300 a try instead of going for the LX5.What I needed is a camera that is compact, and takes good pictures in low light. I have a 2 months old baby who is most playful starting from 9pm until dawn. So the camera needs to be able to capture motion in a dimly lit room.After owning it for 3 weeks and taking shots in various lighting conditions, I can say for certain this camera deserves 5 stars in terms of low light capability.Images are not as sharp or clean as Leica (when you compare at 100%), but every moment is captured exceptionally well. The colors are accurate even with mixed or minimal lighting, and the lens are fast. I have absolutely no complaint about the image quality.  What I am a little uncertain is the casing.  As said by another reviewer, it does feel flimsy. Like, you can break it if holding it too tightly kind of flimsy.  Also, the auto focusing on the video seems a bit off when you zoom in during recording.Other than that, this is a perfect camera because in addition to consistently producing great images:Its price is budget friendlyIt has a big and really, really nice screen.Excellent HD movie recording capability.Its menu is easy to navigate.Shutter and aperture setting give photographer lots of freedom to be creative.I am sure there are cameras that can do better, such as Olympus XZ-1, but it will also cost significantly more.", "Date": "May 21, 2011"}, {"Title": "AWSOME OUTDOORSMAN CAMERA", "Author": "mjh", "ReviewID": "R1EHG9LA20NLWV", "Overall": "5.0", "Content": "Being in the outdoors a lot was looking for small ,easy to use ,quality camera. Took this gem to Alberta Nov. 2011. At 18deg below zero, had to keep in shirt pocket because froze up, but suspect this would be true of any camera at that temp.(Batt.issue?)Took out of pocket for a least half hour for pictures/videos with no freeze up. AWSOME pictures/video !!!! VERY easy to use!! I give it TEN stars!!", "Date": "January 7, 2012"}, {"Title": "Nikon P300", "Author": "Jeff T.", "ReviewID": "R356WHV4ILMGS3", "Overall": "5.0", "Content": "I've owned several Canon DSLR (Rebel, 30D, 5D), various Canon L lenses, 4 Canon P&S;, and 2 Fujifilm P&S.;  This is my first time to try Nikon camera because Canon S100 was out of stock when I purchased it.  I am happy with the Nikon.  Here is some comparison against the DSLR and other P&S;:- I was able to get hold of Canon S95 and tested S100 at the store.  The lens sharpness on the P300 is very comparable to the ones on S95 and S100.- The color from S95/S100 seems to be more realistic, but the Nikon color is more pleasant.  However, I found there is less noise in Nikon in low light condition probably because of Nikon's cooler white balance.- I prefer the shuttle click in Nikon because I can trust there will be a picture taken.  For Canon, it would not fire a shot if it cannot get a focus lock.  This is especially important for me.  I found I'd often miss a picture when I asked someone to take a picture because it would not get a focus lock.- Some people complain that the F1.8 does not provide enough depth of field.  I found the opposite.  I think it is an advantage to have deep depth of field for the P&S.;  I mainly use P&S; for my travel and family vacation.  I would be able to use F1.8 for the low light condition while keeping everything in focus.  I can never do the same with my Canon 85mm f1.8 lens on the DSLR's.- The video on Nikon is not as nice as those on the Canon and Sony.  The video is \"jumpy\", and the IS is not smooth.  However, the IS for the still picture is very impressive.  With CMOS sesnsor + 24mm wide angle + good IS, I almost no longer need to use the flash and still be impressed with the nice clean low light picture from P300.", "Date": "December 30, 2011"}, {"Title": "Amazing camera for the price", "Author": "KD", "ReviewID": "R2IN0LSQ5414NL", "Overall": "5.0", "Content": "Moving from an SD1000, this is an amazing camera. Great low light performance and excellent HD video. It's a great camera that can be carried with you at all time with extremely good image quality for such a little camera. I'm still amazed at how good this camera is at taking pictures without flash.I was undecided between the S95 or S100 versus this one. The quality difference at least to my eyes is imperceptible based on pictures posted in the reviews. I just cannot justify the difference in price between the S95 and this one. Pocket cameras can never replace a DSLR so if you're a camera enthusiast who wants the best quality and portability, you will need a semi-pro point and shoot that you can carry at all time and a real DSLR for when image quality is paramount.For the same price as the S100, I bought both the P300 and a 50mm F/1.8 prime lens for the DSLR. I'm extremely satisfied and happy with my decision.", "Date": "October 3, 2011"}, {"Title": "What A Great Little Camera", "Author": "JerzeyBird", "ReviewID": "R2OTIPOQDNESU", "Overall": "5.0", "Content": "I purchased this camera for situations where my bigger Nikon DSLR is too cumbersome or not allowed.  I'm extremely impressed with all the features this little camera packs in for such an amazing price.  I was able to get a couple of  photos of hummingbirds that were actually better than my SLR because the lens in the P300 is so fast.  In this case I found shooting via \"live view\" in the monitor actually made it easier to get the shot than shooting thru my SLRs view finder because my eye wasn't stuck up against the camera and I could see the birds coming in for a landing and actually get the lens on them [if you've ever shot hummingbirds you know how frustrating it is to get the focus right on them because they move so fast]. The menus are intuitive and extremely easy to navigate, and second nature to any Nikon user.  I had the menus mostly mastered in the first shooting without reading the manual.  The controls are easy for quickly changing shutter speed and aperture while shooting, and getting at the ISO is just another click.  The picture quality is what you'd expect from a Nikon.There are some things that aren't perfect for my taste, but I'm willing to put up with them in a compact camera.I find that it over exposes in manual. I've read complaints about this in other Nikon DSLRs, although I don't find it to be true in mine, but in any event, I compensated by under exposing a bit and I'll set an exposure compensation for it.  This is easy enough to tweak when shooting in shade or inside, but when shooting with the full sun at your back forget about shooting in manual because you can't see the monitor to adjust settings because of glare.  You can't see the exposure indicator at all even though +/- exposure is highlighted in yellow.  Not having shot with live view before, given that my DSLR settings are well-lit in the view finder no matter what the shooting environment, I found this inability to set shooting parameters in the sun a huge fail, but I imagine this is a problem in any camera that has manual settings and requires shooting from live view.  I guess I'll have to shoot in a landscape or other scene setting when shooting outside in the sun but I'm not especially happy about that.The video is awesome, both visual and sound quality, but shooting in 3D 1080p creates a file that's not going to play smoothly on most computers because of their limitations in video card acceleration and monitor resolution.  I have a fast NVIDIA video card designed for gaming and, along with my maximum computer monitor resolution of 1280 x 800,  it can't handle that video playback without significant stuttering.  I'm going to try to play it on my HD television and see how that does.  It also created a 4 min video that came in at 650MB [!!], which is almost the size of an entire movie file.  This is just a case of an improvement in one technology [the P300] creating incompatibilities with existing technology.  Given there are six video shooting speeds, this is not actually a problem at all, just giving readers the heads up on challenges to playing the full 3D 1080p vid on other devices besides the camera itself.The one thing that does bug me about the video is that it saves the files in .MOV format, the one format that many video editing and compression programs don't handle.  So, for example, to compress the video I describe above so that it can play on a typical computer and be small enough to upload to Vimeo or Flickr or Facebook, I'd use Virtual Dub....doesn't work with .mov.  So now I have to find something to convert the .mov to something I can work with.  Pain in the neck.  Maybe I can reset the camera to shoot in a more common video format.  I'll actually have to read the manual to find this one out.That Nikon did not include an external charger for this camera is kind of lame, but maybe at this price point doing so was not feasible.  Spend the extra 25 bucks and get an external charger so that you can charge an extra battery or charge the one with the camera much more quickly than charging it in the camera.  The built in charger takes much longer and comes with a large cord, which takes up valuable space if you're packing this kit for travel.  I purchased an extra battery and the external charger.  I've gotten great battery performance with shooting multiple 1080 movies and a couple of hundred photos at highest quality.  It appears as though I still have a full battery, but I know that sometimes the battery indicators drop all of a sudden; ergo, extra battery.", "Date": "September 1, 2011"}, {"Title": "Very worthy little camera", "Author": "Q", "ReviewID": "RF61KX548YXTR", "Overall": "4.0", "Content": "Reasons to buy:Small and light: pocket size with built in lens cover. About the size of a pack of cards not counting the lens, which adds about 1/2 inch thickness when closed. The Tamrac 3819 Neo's Digital 19 Camera Bag (Black) fits this camera snugly and includes a belt loop and a small slot for spare SD card or batteryGood low-light performance with \"fast\" f 1.8 lens at wide angle (this is the key distinguishing feature of this camera, and the main reason to choose it over similar cameras)Picture quality is generally good.Bright detailed view screenPop up flash with manual switch (no automatic pop-up, which can cause problems)Decent zoom capability for size and weight.Nikon BrandResponsive controls. Power on and off, etc.Size and price are less than competitors Panasonic LX-5, Olympus XZ-1, and price is less than the same size Canon S-95 (about $100 less)Many manual controls for advanced users to max out performanceHD movie ability works fine.I did some panorama shots which turned out well.Problems:Rather small in the hands and the controls are small and fiddly. For example, the \"on\" button is so small that you have to use your fingernail to turn it on and off.Autofocus is unreliable in very low light, and at extreme close range (hence the four star rating).Given the fact that there are two dials in addition to the main mode selector, there should be more quick 'n easy access to picture taking adjustments. For example, in \"Scene\" mode, you have to call up the menu to change scene. It would be a lot more convenient to use the scroll dial on top. In \"scene\" and \"auto\" modes, both dials don't do anything. And in P, S, and A mode, only one dial is active, and the other dial doesn't do anything. Only in full manual mode are both dials active. The other dial could be used to adjust ISO or exposure (in auto or scene mode).When the ISO is automatically raised above the base sensitivity of 160, the letters \"ISO\" appear on the view screen; but there is no indication of what precise ISO is currently in use, which would be much more helpful.Door on battery and memory card is fragile, & flimsy, but you don't have to use the door on a regular basis since you can charge your battery and download photos through the usb cable.The flap that hides the usb cable is very thin and flimsy.Overall, I'm glad I bought this camera and I use it regularly when I need something small and light to carry around for hiking or sightseeing.", "Date": "August 20, 2011"}, {"Title": "Excellent Camera", "Author": "Nick", "ReviewID": "RU3WP4W5LB303", "Overall": "5.0", "Content": "Recently bought this camera as a gift to myself. I'm not a professional photographer, but I do prefer using a camera that can take a good picture. Being that I'm not a professional photographer, the fact that it doesn't support RAW format means nothing to me, and I wouldn't have noticed had it not been for all the negative reviews from professional photographers out there complaining that it isn't worth buying for lack of RAW support.This camera takes brilliant photographs. The resolution is amazing, and the 1080p HD camera not only takes incredible videos, but I was very surprised at the quality of the internal microphone. If you want a high quality camera but you're not interested in dropping half a grand on something you'll never fully utilize because, like me, you just want a nice point and shoot, this camera is far and above the best I've used. Competing Olympus and Canon's similarly marketed may be better in that they support RAW, but that also means they are a good deal more expensive. Fantastic in low lighting, and macro.Impressive quality. Body is sleek and solid, and not at all \"flimsy\" as some reviewers seem to complain. The option of the pop-up flash--rather than Nikon's higher end DSLRs which pop up for every picture and need to be pushed back down--is a really nice change of pace.Only CON with this particular sale is that it doesn't include and SDHC, so buy one of those at the local photoshop (research the appropriate format first).", "Date": "July 10, 2011"}, {"Title": "Nikon P300", "Author": "NinjaAlex", "ReviewID": "R2S8MV8CQPW7A0", "Overall": "5.0", "Content": "This was an awesome camera, going down the highway at 70mph got countless blur-free sharp pictures.Highly recommend this camera. Just wish it had a higher zoom range.", "Date": "July 8, 2011"}, {"Title": "AWESOME little camera!", "Author": "Juan J. Viagran", "ReviewID": "R2U1EPQDI36P7X", "Overall": "5.0", "Content": "before buying the P300 bought the P7000, have to return it 3 times till I gave up and bought the P300.Love this little camera..Takes AWESOME pictures, fast AF, great in low light.24mm 1.8 lens HUGE plus.1080p video its GREAT.Battery life is great, but for a full day usually I need to put the second battery.All and all HIGHLY recommended.", "Date": "June 13, 2011"}, {"Title": "First Use", "Author": "Sammy", "ReviewID": "R2GBBAII8MY01P", "Overall": "5.0", "Content": "I bought this camera for use on our first two week cruise.  I am very happy.  I did not need to use the flash once during the trip.  I am going through the over 1000 pictures I took and they all look good.", "Date": "June 7, 2011"}, {"Title": "Chosen over LX5 and S95", "Author": "Diani", "ReviewID": "R3NLPZWYDCZYDV", "Overall": "5.0", "Content": "My reasoning and after reading all the reviews. Point and Shoot cameras to me are cameras that will fit in my pocket. So this eliminates the LX5. My friend owns the Leica version and I was just going to pick it up to tease him on paying $200 more than me just because of the red Leica badge. But this camera is just to big. I've looked at the Canon S95 for over a year but the body is just not for me. It's slippery and I can't get a grip on it. The size of it is perfect though. Here's what it came down to.Pros for me: on Nikon P300. The fast lense 1.8. Quick start up. Takes the best shots I've seen in low light situations. The full HD 1080 since I do lots of youtube videos and with stereo sound. Combined with being still light and small.Cons for me: Flash will not fire on HD video. My Motorola Atrix flash works when using the HD video.Camera will not work while plugged in charging. But that's okay I found 2 OEM batteries and OEM portable charger online for $16.99Requires of using Nikon USB n HDMI cables. Now gotta carry additional cables along with, phone, iPad etc..Overall for $100 less that the Canon S95 it's a no brainer unless you shoot in RAW. The camera may feel like it's not solid since it is so light but it is. The screen is so bright and detailed as well. The battry life is also amazing and I probably won't need the other 2 batteries but for backup only. 4.5/5 stars for me. You can't have everything", "Date": "June 23, 2011"}, {"Title": "Great Compact Camera - Pro Quality", "Author": "Chris C.", "ReviewID": "R2VS1F72V1M4AS", "Overall": "5.0", "Content": "I just got this camera and have only taken about 100 photos with it - but so far it is great.  Amazon got it to me in a day with Prime Shipping - Love it.  The lens is the by far one of the best I have seen on a compact camera - it is very fast and performs very well in low light situations.  I have a D3100 and a D7000 - but I find myself at weddings and other events where lugging around a big DSLR is just not something my wife will let me do.  This camera is a perfect companion.  The video capability is also great - I am going to take it along with all my gear on vacation and do some comparisons.  I will post my findings.  If you are on the fence, Amazon has a great price and you won't be disappointed.", "Date": "June 15, 2011"}, {"Title": "Very nice for the money!", "Author": "FerDomz", "ReviewID": "R2A4JXUKLK20DI", "Overall": "5.0", "Content": "I wanted a camera to get me started on photography basics, one that I could easily take on travels, and family and friends events, and not too expensive; I did some research and finally decided that the Nikon P300 was what I needed.This camera has a CMOS sensor (the sensor is the equivalent to film in non digital cameras) which is said to produce better quality images (than CCD sensors, the other available technology), although it is a smaller sensor compared to other compact cameras.So far I love the Nikon P300, it takes good pictures in automatic mode, and you can also mess up with manual settings for shutter and aperture. The macro funcionality is fantastic and also the panorama mode which is very easy to use. If you don't want to try manual or semiautomatic settings you have scene selection with options like sports, portrait, beach, sunset, gastronomy and others.Another thing that made me buy it was the full HD video (1080p @30fps), few compacts have this video resolution.If you are interested in a camera that lets you learn some things about photography, without spending a lot of money, this is for you.Other interesting cameras that you might like are the Canon Powershot S95, which is very recommended from many photographers, but it is like $100 more than the Nikon P300, and does not have de full HD video, and although it has a larger sensor, it is CCD; and the Panasonic Lumix LX5, which is $100 to $200 more than the Nikon P300, also has very nice features. I just decided over the Nikon P300 for the sensor type, video resolution and price.And finally, one thing that could be important to you is that the Nikon P300 does not have RAW format, I do not need it now as I do not edit my pictures with Adobe Photoshop or other software, but this feature is a big deal for pros; so take it into account.", "Date": "June 6, 2011"}, {"Title": "Mostly good except for some quirks", "Author": "M. Srivastava", "ReviewID": "R2AFPEYGOOUKWF", "Overall": "4.0", "Content": "Owned this camera for a week now and already have a few irritants to report. But first the good stuff.1- Excellent fast f1.8 lens- works better than my canon g12 in low light (g12 is f2.8 only)2- Love the high res screen3- Minimalist form/design appeals to me4- Interesting scene modes- like the panorama and high contrast monochrome in particular5- pop up flash is easy to understand-works only when popped up6- 24mm wide angle - i am considering a tokina 11-16 mm for my canon t2i but i like the fact that this little camera also has wide angle capabilities. Hope to take some creative pics and post soon.I was wanting to buy the P310 (which is still not available as of Feb 2012) but settled for the p300 as it is cheaper and doesn't have a 16 mp sensor (a bad idea IMO for such small sensors). Also considered the canon s100 but that is too expensive and the G1x's price is simply obscene. Sony Hx9v was another option but the lens on p300 is way better.Now for the irritants:1- Proprietary charging port- Nikon, why? Not to mention the brick like wall adapter that is half the camera size.2- The charging equipment mentioned above makes it hard to fit the whole camera + adapter+USB connector in a portable case that can be attached to your belt. I am still struggling to find one on amazon.3- The battery indicator on LCD is not dependable. It goes from fully charged to half suddenly and then within a few shots it drains completely. If you see it at half level, safely assume it is 95% consumed and recharge asap. I hope P310 has his fixed. I guess my big G12 battery has spoilt me.4- The playback button needs to be pressed longer than expected in order to turn on the camera without extending the lens. At first i thought the only way to see images was by turning the camera on completely by pushing the power button. I haven't read the manual so this may be my bad.5- Finally, the images do not rotate when you rotate the camera (like it does in the iphone and G12). Maybe it is not a feature. I also hear a low ticking sound each time i shake the camera. Maybe it is the VR system but i dont know. If any of you also hear it please comment. I hope it is not a defect in my unit.So far, i am still enjoying the camera results. The 1080p video is very good too.Image quality is fantastic for a P&S.;I will still test this camera out for a few more days and if i dont find any new flaws i may just keep it. Currently I want to rate it 3 stars because of the negatives but going with 4 stars due to excellent image quality and video capabilities. Thanks for reading and hope this review helps.", "Date": "February 21, 2012"}, {"Title": "Reviewers are to harsh with this little jewel", "Author": "B. I. Sevilla \"El Chubasco\"", "ReviewID": "R3ITM63OM3LO3D", "Overall": "4.0", "Content": "This camera takes very good pictures. It is a good value for the money you spend. There has been criticism about the performance of the panorama function in low light. I took a couple while dancing in a club under very low light conditions and the camera had no problems stitching the panorama. There has been criticism also about having access to iso controls. It takes to press the menu botton and you are right at the iso control, the contro dial on top changes the iso. That easy!!! Very easy to use, feels like a small DSLR  (I have owned SLRs for almost 20 years) without the bulk. I just took it to a concert last night. Excellent performance, I got great pictures. I uploaded some samples.In addition, the camera looks very sleek. Out of all the cameras on this range the P300 is the most well designed. It looks very elegant.I recommend this camera, take it anywhere, anytime and you will get fantastic pics.", "Date": "January 28, 2012"}, {"Title": "Amazing Camera", "Author": "Cristian Alfaro", "ReviewID": "R1UQI0AW5PYNAH", "Overall": "5.0", "Content": "I got this camera on November 2011 it's quick even with low light shots, no blurry night shots anymore, although video is not that impressive. I'm really happy with this camera, i've had it for almost 3 months now without any issue. I totally recommend this if you are looking for a fast and reliable camera, it's worth the price.", "Date": "January 24, 2012"}, {"Title": "Works great in low light", "Author": "W. Solis", "ReviewID": "R3K5OGKQAOQIZR", "Overall": "5.0", "Content": "I bought this camera as a back up to my DSLR.  I wanted something portable with decent picture quality.  It came down to two choices based on personal preference and research: the Canon S95 or Nikon Coolpix P300.  I think both cameras are great, but at the time the Nikon was about $80 cheaper, so I ended up buying the Coolpix P300.  I'm very happy with the quality of the pictures.  I seldom use flash unless I really need it.  The lens is fast and sharp.  The only downside is the low zoom, but you can't have eveything.I highly recommend this camera.  It's well build, light and several manual features.  The best thing though, is the fantastic lens.", "Date": "December 6, 2011"}, {"Title": "S95 killer", "Author": "Andrew", "ReviewID": "R383LY887V8OEJ", "Overall": "5.0", "Content": "The S95 got all the rave reviews, so I decided to give it a shot.  I was impressed at first but did not like the poor focus and color tends to be too \"red\" to my taste.  Then I stumbled on the Nikon P300.  After a week, I returned the S95.  Pictures on the P300 were nearly always in sharp focus and have natural looking color.  Auto focus in movie mode was hit or miss.  Roughly 25% of the time it would not autofocus, but I found a trick: keep your finger on the shutter, it will maintain focus.  Low light or indoor movie is bad, but I think it's the same case for S95.I purchased the P300 when it was $100 less than S95, but price was not a factor to me.  I just wanted an advanced compact that produces decent pictures...Even now the S95 costs only $30 more than P300, I'd still pick P300.  I was aware that the S95's sensor was larger than that of P300, but somehow, P300's picture quality is still better in my opinion.  P300 made in China while S95 made in Japan.Nikon did a great job on this model.  I can't say the same for Nikon's cheaper models though, they're crap!", "Date": "November 18, 2011"}, {"Title": "Another \" Sleeper \" by Nikon !", "Author": "Robert E. Keay", "ReviewID": "R32FDJUHXU5ZVE", "Overall": "5.0", "Content": "Even with My Minimal Usage of this Delightful Camera , I find it to be Just Perfect ! Low Light Pictures are Real Good ! Small and Hardly Noticeable to Carry on a Neck Strap , and even though Start Time Lags a Very Little , it is Truly a User Friendly Camera ! I do not use or need Raw Capability , as My needs are more than fulfilled with the JPEG provided ! I find the 24 mm to 100 mm a Most Perfect Range for My Uses ! Simple to Program , and No Book Needed , at least for Me ! So Far , nothing but Praises for this Little \" Jewel \"  from Nikon ! Hopes this Brief Review at least encourages an Interest for \" Some One \" out \" There \" ! R E Keay", "Date": "July 19, 2011"}, {"Title": "Awesome Point and Shoot!", "Author": "J. Ard", "ReviewID": "RBQ01K6L3GI1X", "Overall": "5.0", "Content": "Bought this to carry along so I don't miss shots when I'm not lugging around my DSLR. I've read several reviews saying this is not an enthusiast P&S; as it does not shoot RAW. I would think most people looking to purchase this camera want something for those days they left the DSLR at home (i.e. not planning to shoot RAW anyway). I carry this backpacking (on multi-day trips when weight is an issue), I carry it at work for quick random shots, and I have it in the car \"just in case\". If I plan to shoot RAW, that's just it: I PLAN to shoot RAW. If I'm going to bother shooting RAW, I'll use my DSLR - that's why I have it. I bought this to be a P&S; that I could simply use to take a picture when planning isn't possible and this camera truly delivers. Shots are colorful, sharp and well exposed. Low light photography (don't care for on-camera flash) is exceptional. Gives you Aperture and Shutter Priority modes, full Manual and Programed Auto along with full Auto (which I never use), exposure compensation, and color saturation and hue adjustment options just to name a few. Some of the scene modes are actually kind of useful and I find myself using them at times when I'm rushed and have to fire a shot quickly or miss it. Showed some photos I took indoors with no flash to several photography enthusiasts (Nikon, Canon and Sony DSLR users) and their response was \"WOW, you took those pictures with THAT?!?\" The f1.8 lens (beating out all the competition in this price range) is far more valuable then shooting RAW (in my opinion). If shooting RAW is what keeps you from buying this camera, you're missing the point. This isn't meant to replace a DSLR, it's a camera for those of us who own one but can't carry it everywhere and can't stand not having artistic control when photographing (so a \"regular\" P&S; just won't cut it for us). Learn to get the exposure you want in-camera (or at least close to it) and you won't worry about shooting jpeg from a Point & Shoot. Keep in mind that despite how much I LOVE this camera it IS a point and shoot. Don't try to compare it to a DSLR as I keep seeing in other reviews. It just isn't that. But it is the best P&S; I've owned or used and don't regret choosing this for an instant!", "Date": "March 13, 2012"}, {"Title": "COOLPIX P300", "Author": "P. Johnson \"User\"", "ReviewID": "R306JS3H6826GS", "Overall": "5.0", "Content": "Have used for a few weeks. This thing produces TACK sharp images. It \"back focused\" a few times, probably operator error. The colors are vividly realistic. This will be my walking around camera, the Canon collection will be on reserve for heavy duty use (MK5Dll, 7D, etc.) Also I like the SDHC storage. Much cheaper than CF per Gig..Made in China. (What isn't made in China? I bought a jug of Apple juice, fine print, \"concentrate from China\"..)", "Date": "June 14, 2011"}, {"Title": "Probably the best P&S; I've owned.  Ever.", "Author": "F. R. Padilla \"frp\"", "ReviewID": "RA6MQKTS7B9EL", "Overall": "4.0", "Content": "I am a Nikon snob.  If that turns you off, stop reading now.  If not, please continue.Let me start with my disappointments -- no RAW format available, the lens housing juts out from the front (in off mode), the function wheel on the back may accidentally be pressed while turning it.That being said, what I love -- super fast lens, I mean super fast (and PERFECT for low light), ergonomic rubber grips, crystal clear display, size, weight, good manual features.I had a Canon ELPH, and I will never use a Canon again (personal preference).  Instead of carrying my D90 on some trips, I take the P300 with me and have no regrets in doing so.  Feels fantastic in the hand, and is ultra portable (vs. a DSLR with a 24-70mm f1.8), and the wide aperture at 24mm is wicked fast.  Buy this. You won't regret it.Best review on the interwebs -- [...]", "Date": "June 7, 2011"}, {"Title": "It's what I wanted", "Author": "Alan A. Siegel \"Al the baker\"", "ReviewID": "R2ZBTCFSENE6R", "Overall": "4.0", "Content": "I wanted a camera with a big lens to obviate need for flash. The P300 allows sharp images during dance performances and at museums without disturbing flash. It also offers a choice from seven images (sports setting) of a child who can't remain still. The modest zoom range is a reasonable compromise to get sharp images in existing or low light", "Date": "June 7, 2011"}, {"Title": "Excellent Camera - only a few small nits", "Author": "Online Shopper", "ReviewID": "RM31Y5PYO5XF6", "Overall": "4.0", "Content": "All around this is a great camera.  Takes excellent pictures and good HD video (not perfect, but really nice ... a little soft and sometimes jittery when panning).  My only nits are the forced center focus in auto mode and no battery charger included (must use a cable and charge in the camera).  Otherwise great camera... especially for the price!", "Date": "May 14, 2011"}, {"Title": "Lens wonky, service department dishonest", "Author": "LivingBear4588", "ReviewID": "R2HUKPHT5TEQN4", "Overall": "1.0", "Content": "I don't know if they are all like this but my P300 came with a wonky lens giving odd fisheye distortion in the pictures. On one side of the picture rectangle faces and bodies and other objects would be stretched out in a way that never happened with any other camera I've owned. The service department took it and claimed to fix it but the distortion was still there, and later during a second trip to the service department they admitted that it had never been fixed the first time. And after that they refused to fix it the second time saying I had damaged it! I did not damage it but it would be irrelevant even if I had because if it wasn't damaged the first time they should have fixed it then! This was my first and last Nikon product. They have a good reputation but I got burned. I do not recommend!", "Date": "May 10, 2013"}, {"Title": "Perfect Camera for New Parents", "Author": "Amazon Customer", "ReviewID": "RJBOPGKM8KRPJ", "Overall": "5.0", "Content": "I haven't written many reviews before, however, because the Amazon reviews were so helpful in finding this camera, I felt like I owed a contribution to the discussion.What the P300 is:This is the absolute perfect camera for new parents.  We were initially contemplating a DSLR purchase.  I wanted to shop around though because I've known a good number of people who bought DSLR cameras to take pictures of their babies only to find that they never use it.  The last thing they want to do is lug around another bulky bag.  The P300 is large enough to be sturdy but still small enough to carry around and use regularly.Additional features that make it great for new babies:  - Excellent low light pictures and image stability  - Rapid start up allows you to capture quick shotsWhat the P300 is NOT:It is not a professional grade camera.  If you want to make large prints and have perfect lighting, this isn't the camera for you.  We ultimately decided that we wouldn't be staging large photo shoots for our infant and so moved down to cameras at a lower price point.Summary:The P300 is essentially a high end camera for the casual photographer.  The primary benefits I've seen so far are the high quality low light shots and the rapid start up to shoot time.  Would buy it again in a heart beat as it has been perfect for our needs.", "Date": "December 29, 2011"}, {"Title": "Amazing little camera", "Author": "Jersey John", "ReviewID": "R1OXYEKB3WDGUL", "Overall": "5.0", "Content": "I am very pleased with the performance of this little point and shoot, especially its low-light performance.PROS- small and compact- fast start up- low light performance- simple controls- super sharpCONS- common point and shoot limitations: lens flare, vignetting, limited bokeh, high noise at max zoom.I would highly recommend this camera. Easy to carry and takes great photos.  Buy it, take it with you and click away!", "Date": "December 15, 2011"}, {"Title": "We love this camera!", "Author": "TriRockMama", "ReviewID": "R3IH5G2CHXXTRA", "Overall": "5.0", "Content": "We are definitely not camera experts, but we wanted a camera that was both \"dummy-proof\" and flexible enough to enable us to tweak it enough for specialized shots. This camera is both; plus it's super durable and feels great to the touch! We would highly recommend this camera for families such as ourselves.", "Date": "December 10, 2011"}, {"Title": "Great Camera!  Good low light pics.", "Author": "Joseph T. Dietz \"joedietz\"", "ReviewID": "R2SVL7VZ6VPDU9", "Overall": "5.0", "Content": "We've had this camera for about 3 weeks and have taken 100-200 pictures and video with it.  So far I really like this camera.  It is not super small (which I like) and fits nicely in my larger hands.  Controls are in good spots (although on/off button is a little small and I sometimes can't depress it all the way down at first try).  Screen is large and very clear/sharp!This camera takes great low light shots (without a flash).  We've taken many shots indoors at night (with low lamp light) and also shots outside in the evening and the pictures are very nice.  We have two small children and although the camera takes great low light shots, the moving kids always come out blurry without the flash.  With the flash the kids are not blurry, but then you get that unnatural flash lighting (not terrible though).  Color otherwise seems very good.Auto mode and scene auto select mode seems to work fairly well in most situations.  I don't like that the sports mode takes multiple pictures, but maybe I will eventually learn to like it.The HD video seems very nice too.  There is a slight audible noise when zooming in and out while filming, not loud, but it's there.  This doesn't bother me too much, some cameras can't zoom at all while taking a video.Overall I am really happy with our purchase and I would recommend the camera.", "Date": "November 29, 2011"}, {"Title": "Just right for the times you don't need your DSLR", "Author": "Mikelbon", "ReviewID": "R3Q08ABZ466UTY", "Overall": "5.0", "Content": "I was looking for a camera to replace my small Canon point and shoot that disappointed me.  This fit the bill.  Small, feels good in my hands, has just enough features and fast lens.  Would have liked spot metering but the panorama scene and continuous shooting features made up for that.After a year and a half of use, love it even more. The many shots taken in dimmly lit pubs on our Ireland trip have a real intimate feel because I didn't need the flash.", "Date": "September 11, 2011"}, {"Title": "Excellent camera with good image quality and very nice video", "Author": "Prabhu Shankar", "ReviewID": "R3Q5SXYVYJZYQN", "Overall": "5.0", "Content": "This is a very nice camera for the money. The image quality is excellent with vivid colors and sharp details. The quality is not as good as my Canon DSLR, especially when you look at 100% magnification, but better than all the compact cameras I owned before. It is also very fast compared to other compact cameras. I was very surprised with the quality of the 1080p video, it is very nice with good colors and detail. The only problem in video is while panning the video gets little jumpy.Couple of problems I noticed is that1)During Macro shots the camera has hard time focusing properly.2)The remaining battery indicator seem to be not accurate. In play back mode is shows half full but in capture mode (camera or video) it shows almost empty. Also the battery does not last whole day (for e.g. a day in vacation with about 100 shots and 10-15 mins of video)", "Date": "July 29, 2011"}, {"Title": "Amazing Manual Controls", "Author": "Thomas", "ReviewID": "RTJ6DZTH8CNVV", "Overall": "5.0", "Content": "Although I have only had this camera for 24 hours I am so pleasantly surprised with the controls.  I like the control i have over it far better then the S95 that i have been playing with for the past 4 months.  (its my brothers but i borrow it often).  I will update this review after I have had more time with it.", "Date": "June 15, 2011"}, {"Title": "Good....for the price.", "Author": "mrbubble \"mrbubble\"", "ReviewID": "R2OQMEWEKZUEVE", "Overall": "4.0", "Content": "I own a Canon S95 as well. Compared to the S95 this feels like cheap plastic. It takes pretty nice pictures but sometimes I think the edges are a little distorted. Almost like a mild fisheye effect. Seems to have good battery life and some examples of the depth of field I get with this lens is impressive.If you can afford the extra $$$$ I would still buy the Canon S95. (NOT the S100)If not, this is arguably the best camera for your money. Feature sets of both cameras are remarkably similar.As always, with all the point and shoot cameras, take multiple exposures when possible to help to insure you get the best photos.", "Date": "February 27, 2012"}, {"Title": "Like having night vision!", "Author": "George Hayao", "ReviewID": "R6NYZRLSWOIMR", "Overall": "5.0", "Content": "I got this camera on recommendation from my cousin's husband, who said to look at this camera if I was looking for a camera with low-light capability, and he was so right.  I rarely have to put on the flash, so I can shoot more inconspicuously.  And the quality of the pictures is still great.  Would highly recommend this camera.  Also, the response is very fast.  It's almost like I don't have to focus first.  If there is something I want to quickly get a picture of, I literally just have to point and shoot.  The picture almost always comes out in good focus.  Can't go wrong with this one!", "Date": "October 9, 2011"}, {"Title": "Poor Nikon customer service", "Author": "Luis", "ReviewID": "R1JOPX2IML6DPH", "Overall": "4.0", "Content": "Received my Nikon p300 in a timely manner from Amazon and began to use it to get use to the different settings as I had a trip planned.  The pictures were crystal clear on the brilliant high res screen.  Indoor low light pictures were beautiful with NO flash!!  Everyone was amazed.  Then went on my trip and experienced the following.  First, don't buy the camera for the zoom.  Yes, it works well for the short distance pics, like for portraits.  But for wildlife, even at a relatively close range, will not give you the satisfaction as a more powerful zoom.  But I knew this going into this purchase...maybe the next generation p300 will have a better zoom.  Now for the problem...during my trip, I used my video for the first time.  It seemed to work well, until I used the zoom.  Then the camera froze with 'lens error' appearing on the screen.  Had to remove the battery to reboot the camera and get it working again.  So tried the video under different settings and circumstances and whenever the zoom was used, the camera froze with lens error.  When I got home, I called Nikon and went through the usual reseting the camera, recharging the battery, changing memory cards, etc. and after 4-5 phone calls, they finally said I needed to send in the Camera to Nikon to be serviced.  My new camera, a month old, already needing service...and I had to pay the shipping to them!!  Then I get an email, saying it was not under warranty and the cost would be $87.  Of course, I called and explained everything and the foreign rep put me on hold and came back and said there was a mistake and it should be under warranty and she would email be that confirmation immediately.  Never received it so I called back and the new foreign rep told me she (the last rep) made a mistake in telling me that and the service dept. would have to review the warranty and get back to me.  Several days passed and I heard nothing, so I called back.  Put on hold and eventually, they came back with...yes it is covered under warranty.  It will be fixed in 7-10 business days and returned to me.I was never worried about coverage since it was paid for by a credit card which has separate coverage.  But this whole episode has left a bad taste in my mouth with Nikon.  I will have to think twice about Nikon purchases in the future or buy it at Best Buy and get their warranty coverage.  Let's hope this is an isolated flaw just in my camera and not a design problem with the zoom during the video mode creating that lens error.Follow-up....After 2 weeks, finally got the camera back, but it still had the same problem...it was NOT fixed...unbelievable!  This time, I call Nikon USA corporate who had someone from service return my call.  They had me send the camera back, at heir cost.  When received, he confirmed it was still coming up with 'lens error'.  Said all they did last time was a firmware update and thought that should have fixed the problem.  NOT!  He then agreed to send me a new camera, which arrived several days later.  The new camera is working well so far.  Since this was a brand new camera, Nikon should have replaced it from the get go.  POOR customer service, but fortunately ended well.", "Date": "August 23, 2011"}, {"Title": "All is good until....", "Author": "General \"ver\"", "ReviewID": "R16OJ3I7B1O1GB", "Overall": "2.0", "Content": "I really love the pictures and everything, my friends are amazed specially on low lights, but suddenly 3 days ago there is a shadow on the pictures, I thought it was my finger on the lens or some dirt, but there was nothing. Even on the screen you will see a dark shadow and on the pictures itself. I dont know if it can be fixed, bought over a year not used often, always on the cabinet with a thick pouch, never been dropped I don't know what happened.", "Date": "July 24, 2013"}, {"Title": "P300 - OK camera...but not for pics of kids", "Author": "gm510", "ReviewID": "R2LBFV858W39YS", "Overall": "2.0", "Content": "I purchased this camera when my daughter was a baby and was fairly pleased with the photos at first. Colors looked very crisp and vibrant. My disappointment began at her Baptism when I handed the camera to a family member and when I saw the pictures there was quite a bit of blur from movement. I then realized the flash does not pop up on its own when set to automatic like my old camera did, and the flash helps freeze the motion. I also own a Nikon d5100 and know how to set my camera manually. I consider myself semi-pro as I have been doing photoshoots for children of friends and family. I understand that you can also freeze the motion by setting the shutterspeed, but I was looking for something to get quick snapshots of my daughter. There is usually no time to think about all the manual settings or releasing the flash now that she is running around. There is also quite a bit of distortion at the wide angle and sometimes my daughter would look out of proportion. I would play with the camera settings so much that I missed many good photo opportunities as she would move on to the next thing. I stuck with this camera as long as I could since it was fairly expensive for a point and shoot, but recently decided to order a camera that is waterproof and shock proof. Looking forward to getting some pictures at the pool and beach without worrying about it getting wet or dropped.With that said, if you are looking to take photos of stationary objects, the P300 could work for you.", "Date": "April 14, 2013"}, {"Title": "Excellent camera.", "Author": "Edward Young", "ReviewID": "REE7Q28A2U1BF", "Overall": "5.0", "Content": "Very good camera, taking excellent high quality low ligt pics.  Movies are also very good, but would be nice if it had different movie format options, and maybe a little more zoom. Seems a little fragile, due to the small size, so get a good case like the \"Case Logic TBC-303 Medium Camera Case\", which fits the camera perfect for on the go pictures.  All in all, a great little camera, that does a great job in just about every area.  Good Price, all considered.", "Date": "February 3, 2013"}, {"Title": "Perfect.", "Author": "Billy J. Golden \"Litenin\"", "ReviewID": "R3CD1YZ6LP6JXZ", "Overall": "5.0", "Content": "Bought this after reviewing it via consumer reports. They rated it highly. This camera is so easy to use, full of features, and can really take a licking. I have dropped this camera on a linoleum floor with the lense out, and my son covered it in birthday cake at his 1st birthday party. Still works. Bought extra battery, dont need it. It may not be a flashy color or be advertised that highly, but you cant go wrong with this P300.", "Date": "January 28, 2013"}, {"Title": "Great in low light, zoom is a bit prohibitive, proprietary cable(!)", "Author": "K. E. Hawes", "ReviewID": "R1RT9GCGKJQJ8D", "Overall": "4.0", "Content": "I had a Canon SX210 that has 12x optical zoom. However, the Canon SX210's image got a bit grainy with the extra zoom and was poor in low-light settings. My brother had the Nikon and I was dazzled by the low-light images. I also like how you can charge it via USB, with the camera, so it's great for on-the-road use! I hacked a spare (grrr) proprietary Nikon cable (c'mon, Nikon, what's up with that?!) and made a 6-inch version of it, to tuck it in my camera case. This way, I have everything I need, except an outlet, in one place.If Nikon had been a kinder, gentler designer and used the *UNIVERSAL* micro-USB connector, I could carry only one tiny connector, for all of my device - now I need two. So, I pinged Nikon one star, for this poor design choice.", "Date": "December 20, 2012"}, {"Title": "A \"Have it all\" Camera", "Author": "Jane Arun", "ReviewID": "R2B7JS9XBCULUK", "Overall": "5.0", "Content": "that we absolutely love. My dear husband gifted this to my father and being a camera enthusiast, loved it instantly. Nikon had put in great manual features into this point and shoot camera. Above all the Video and Audio quality is very good. Occasionally we also record slow motion video of birds taking off or our son's first steps. After 9 months, we have ordered one for ourselves and we highly recommend this product.", "Date": "May 8, 2012"}, {"Title": "Great Camera!", "Author": "Vishmandu \"Born To Shop\"", "ReviewID": "R3FJ83WXO34WI1", "Overall": "5.0", "Content": "This is my 4th or 5th point and shoot camera, and as you might know they just keep getting better.  Previous camera was a Canon ELPH that also takes great pictures, but being 5 years old it's just outdated technology.  The Canon is still going strong, but that's the wife's and I needed one for my business.  This Nikon P300 is amazing.  First of all the f1.8 lens combined with the image stabilization allows you to take photos that simply are impossible with the older digitals (forget the old SLR's).  I have taken photos in auto mode with NO FLASH at 1/5 of a second shutter speed, hand held, and you can count the threads in the clothing when magnifying the photo.  You can't hold a camera freehand at that slow shutter speed and get a clear photograph.  Well you can now.  OK, maybe I'm just impressed coming from an older camera.  But really, the flash seems to be of very limited need.  Took a photo of a darkened room I could not see the other side of, but the camera could, with no flash.  The photo makes the room look likes its in daylight.  How's it do that?  The auto-scene mode is really neat.  The camera reads the situation and adjusts itself for the best photo.  Took some photos of a rising moon that look almost professional.  And the sunrises and sunsets are much better than I've been able to get with the older camera.  One downside is it does not come with an external battery charger.  You're supposed to charge the battery in the camera, I guess while you're sleeping?  Shame on Nikon, but its a cheap workaround.  There's dozens of after market battery chargers for under $10 on AMAZON, and one kit that includes 110VAC charger, cigarette adapter, and two high capacity batteries, all for under $20.  I got the PowerGen that charges a wide range of batteries for under $10 and it works great.So I have yet to find a scene or image this camera cannot capture if I set it properly.  And in most cases it sets itself.  Oh yeah, the flash.  The flash does not pop up automatically.  You slide a small catch when you think you may need the flash and it pops up on the top left of the camera.  But there is still room for your finger so you can hold the camera firmly.  Great solution over the S8200 that just pops up unexpectedly.  The camera regularly warns you that the flash is down, so you shouldn't miss any shots due to lack of flash.  And again, the lens is so fast (light sensitive) that you very often don't need the flash anyway.  I took several great shots thinking that surly the flash was needed, but there was no flash.  I then remembered that I had forgotten to pop the flash up, but the P300 captured the shot anyway.  When you do need the flash it is very bright.  I know I have taken flash shots out to 30 feet with plenty of light to do the job, and that was outdoors at night.I've had the camera for only two weeks, and have a lot to learn.  But so far I could not be more pleased.  I shopped for weeks and think I definitely got the most camera for the buck, and a great camera at any price.  It makes taking pictures fun all over again.", "Date": "February 22, 2012"}, {"Title": "Noise reduction (NR) helpful feature", "Author": "ecomathematician", "ReviewID": "R1KO8Z47P5RT62", "Overall": "4.0", "Content": "NR (Noise Reduction) is an interesting feature of this camera.  It is in the Landscape menu. The camera quickly makes several exposures,  and then,  in about ten seconds,  calculates the final picture (slightly cropped w.r. to what you see on the screen).  Big plus: the picture looks better (quite good even at ISO 1000), chromatic aberration (color fringing) disappears (there is not much of it, anyway).  Minus: you have no control over  ISO, aperture.  Works only at speeds shorter then 1/30 s. Even so, I like NR - for objects that are not moving.  Other pluses of this camera: very good wide angle shots with excellent  1.8 aperture, good stabilizer. Can you get a Canon or Nikon DSLR with stabilization at f/1.8, even if you are willing to spend many times more? Manual control: P,A,S modes.  It has three levels of HDR. I prefer the first one, since too much HDR makes pictures artificial/ unnatural.  The  BSS (Best Single Shot) works on P300 only at at speeds shorter then 1/30 s. The camera takes several exposures and chooses the best one. This camera is very fast. So why does not this work at slower speeds? I had a much slower Nikon camera with BSS,  which took seconds to make the six to nine  exposures  (necessary for BSS).  I wish Nikon P300 could use BSS (and maybe even NR) at slower speeds,  in the A (aperture priority mode),  as this would  be very useful in low light.  And of course I wish the camera had only 7 MP instead of 12 MP. This would be more than enough  for such a small sensor and such a lens.  You  can make excellent 30 cm x 40 cm pictures with 7MP.", "Date": "February 8, 2012"}, {"Title": "Wonderful camera", "Author": "Paulo R. S. Pereia \"Paulo from Brazil\"", "ReviewID": "R24CRWNUPZ0R1Z", "Overall": "5.0", "Content": "Crisp photos, perfect colors, long life battery. Much better than Canon. It's like put a professional camera on your pocket.", "Date": "February 5, 2012"}, {"Title": "Best small sensor P&S; around with a few limitations", "Author": "The Folded Space", "ReviewID": "R1KX7UC9DNEW4J", "Overall": "4.0", "Content": "Many have compared this to the Canon S95, and the two are similar in terms of features, but make no mistake - the Canon does have a larger sensor. Chip size isn't everything, though. Thanks to the fast lens, pretty good amount of manual control and sensitive back-lighted CMOS, the P300 does exactly what a P&S; should do very well.I wish the zoom had a little more reach. The video should dedicate higher mbps to achieve clearer video. This is the weakest area and keeps it from matching the performance of better dedicated camcorders.", "Date": "December 5, 2011"}, {"Title": "Tell a friend.", "Author": "Edward Quist", "ReviewID": "R1655I1KHG7X7Z", "Overall": "5.0", "Content": "Good value, this is an amazing camera. The preview screen is bright and the anti shake feature is sure to be appreciated for those split second photo opportunities.", "Date": "November 29, 2011"}, {"Title": "Best point and shoot I ever had", "Author": "Raymond E. Durkee", "ReviewID": "R51VXDKK5MXFZ", "Overall": "5.0", "Content": "I have had this camera for about 3 months now, took it on a European trip as my only camera and I absolutely LOVE it.  The combination of the very wide angle and the fast lens makes taking the kinds of shots you normally take with a point and shoot (low light and inside where you want wide angles) very easy.  Does just fine in bright outside.  The color is impeccable.  This is probably my 5th digital camera and the quality I get from it rivals my old pile of Nikon F's in their day and certainly the best digital.  The glass is vastly superior to my last Canon AIS 720 which was crap--if that was indicative of Canon quality I will never own another--all of my old Fuji's had better lenses than the Canon.  I have gotten used to the lack of a viewfinder (it is just a habit you developed, you really can't see anything through those things anyway, do you!).  This has enough manual settings that you do not need to use to occupy any photo nerd and the auto setups make much more logical sense than just allowing/requiring you to manipulate every variable, but--given the ease of fixing digital images after the fact, all the settings are IMHO more or less superflous.  I think the only weak point is the hotness of the flash--it creates a hot center in your pictures that I have not seen with some others when close in---but you can take pictures in such low light with this camera that the flash is less important.  This one is a keeper. Hats off to Nikon.", "Date": "November 28, 2011"}, {"Title": "DSLR replacement for photography enthusiasts", "Author": "A. Loyola", "ReviewID": "RRCJEDNFYB234", "Overall": "5.0", "Content": "I got tired carrying around a heavy and dorky DSLR. This camera does the job fine for a photography enthusiast. It takes amazing good pictures in low light, thanks to the backlight sensor. The screen is big and covered in glass (gorilla prob). It looks sturdy and BS free. All manual features permit creativity.Video is great, can use zoom during recording and keeps focus. (Not like fix focus flipcamera). This means that I can record something very close, then move the camera to something far and it will focus like a video camera.Proprietary usb cable could be a problem, but I got 2 extra batteries with wall charger. Bring an extra battery and leave the cable in the box.High dynamic range (HDR) is available for night portrait pictures only.", "Date": "August 27, 2011"}, {"Title": "Convenient", "Author": "trang.tran", "ReviewID": "RBSI4G8I47KU5", "Overall": "5.0", "Content": "There are times when carrying around a DSLR can be a hassle. I often get paranoid of my baby in certain environments. If you want to take pictures conveniently,the Nikon P300 will give you great results with clear picture quality.With the P300, you have to get familiar with the many options and features it provides. If you're a novice, not knowing what each option offers may cost you a great picture moment.As well, the body of the camera is sleek and professional. Depending on how you think of it, this gives you a boost of confidence in taking pictures around others without them critiqueing your camera.The zoom on this camera is mediocre. When zoomed in at its max, the picture will sometimes appear to be blurry. It just depends on what you're zooming in on. I personally do not have to use the zoom that often and when I do, it's not necessary to get in that close to the object.In addition, my video quality has turned out great as well. I don't really have much to say on the video feature though.", "Date": "August 26, 2011"}, {"Title": "I LOVE MY CAMERA", "Author": "Lindsay H.", "ReviewID": "R2URD30L8KQBN7", "Overall": "5.0", "Content": "I got this maybe a month ago and this camera is so amazing the image quality is fantastic! I have a big Canon SLR camera and it use to be my baby until got this camera I LOVE THIS CAMERA!!!!!!", "Date": "August 5, 2011"}, {"Title": "Exactly what I was looking for", "Author": "Path res", "ReviewID": "R1KGM8WP34T0RB", "Overall": "5.0", "Content": "Exactly what I was looking for.  Excellent photo quality.  Quick start up time and little lag time between photographs.  Price was also excellent when compared to similar canon and sony cameras.", "Date": "January 9, 2012"}, {"Title": "Very happy with this camera", "Author": "V. A. Coburn", "ReviewID": "R1D4SL89MGRJR0", "Overall": "5.0", "Content": "I am a Canon junky in the past.  I had Canon SLR SX, Canon G11, Canon SD940, and SD1000.  I was debating weather to get Canon S95 or S100 vs Nikon P300.  Since I don't use RAW setting, that option was not a big factor.  In the end, it was price that determine that I get Nikon P300 since it is $100 less than Canon S95.  Since Canon S95 had so many bad review regarding error message, I decided to give Nikon a try for change.  I am totally surprised by the capabilities of this camera.  The low light capability is unbelievable.  You almost never need to use flash.  I only use flash as daytime fill-in for back light.  The Portrait setting is very useful to me.  I find that I can take my own picture held at arm length using Portrait setting and the pictures come out excellent with perfect skin tone and actually hide my imperfection on my face!!!  Now that is priceless in a camera!!!", "Date": "November 13, 2011"}, {"Title": "Wow", "Author": "Louis D.", "ReviewID": "RE5HWDPLH63VV", "Overall": "5.0", "Content": "If you are an amateur picture taker and want great pictures, this camera is for you.  Even the more seasoned photographer has all the options to use this fully manual camera.  I love the fact that you have the option to keep the flash up or down depending on the picture you are taking.  The pictures are crystal clear and the camera is so easy to use.  I haven't used the video yet but if the video looks anything like the pictures you won't be disappointed.", "Date": "October 26, 2011"}, {"Title": "Best point and shoot for me!", "Author": "Pochograper", "ReviewID": "R5JEJ0T2LZH84", "Overall": "5.0", "Content": "Honestly, I never had a a P&S; camera before, I always had my DSLRs with, I have a 2 Canon 60Ds D700, D300, D90 and a D40 which I use as my everyday DSLR. I've been a professional photographer for 10 years now and I'm telling you I am quite impressed. Honestly, I never liked coolpix cameras cause they always had bad reviews. But when I saw the quality and capabilities of this camera, I bought it right away, and Amazon is selling it for a very reasonable price. I barely use the flash...... low light conditions not a problem. It gives you a lot of options to choose from to manually adjust the camera to you preferred setting is awesome, kind of like a small DSLR with a fixed lens.Though I'm not much impressed with video mode though. But for the price and quality. its okay.Well, I suggest you get one before they run out.", "Date": "September 23, 2011"}, {"Title": "Perfect camera that actually takes flattering photos", "Author": "Annie", "ReviewID": "R44ZH9DO6UVKS", "Overall": "5.0", "Content": "I don't usually write reviews, but I had to because I'm so impressed by this camera. And when it comes to digital cameras, it takes a lot to impress me.Back in the days of taking pictures with film, I looked fine and dandy in photographs. But when the digital age hit, I wanted to duck and cover everytime a camera came out. And upon seeing pictures with me in them on my computer, I always think things like \"No way, my teeth aren't that yellow, my nose isn't that big, and I'm not that fat, I don't care what this photo says. DE-TAG.\"Call me vain, call me self-conscious, but I can't be the only one who gets frustrated when what they see in the mirror and what they see on the screen seem like two completely different things. This doesn't just go for people, it can go for landscapes, scenery, cars, flowers, you name it. It never looks as good on camera as it does in reality, unless you want to lug around a big dinosaur of a camera and make a lot of tedious adjustments just to get a decent photo.I didn't think it was possible to have convenience AND good pictures until I got my hands on the Nikon P300. It's small, and it has the option to make a lot of manual adjustments, although not as many as some people would like. As for me, I am perfectly content to use the scene modes, letting the camera do the work for me. And there is a nice array: Portrait, landscape, sports, night portrait, party/indoor, beach, snow, sunset, dusk/dawn, close-up, food, museum, fireworks show, black and white, panorama, pet portrait, night landscape...just remember to put the flash up or it won't go off. Still getting used to that, but I don't mind it. It makes images look like they do in reality while still maintaining color and crispness. I don't know how this camera does it when so many others like it can't, but that's just it. I don't have to know and I don't have to be a photography expert to get good photos from this camera.", "Date": "August 10, 2011"}, {"Title": "Best Compact Camera with Manual Controls", "Author": "C. T. Vu \"Tech Wizard\"", "ReviewID": "R3P4T9HB9XHLMT", "Overall": "5.0", "Content": "This is the best digital compact camera that I've even owned (I've had Canon, Panasonic and Casio). What I like most about the Nikon P300 is its fast lens: I don't use the flash anymore, except for difficult lighting situation. The P300 is quite small and unobtrusive, which is great for street photography. The many manual controls make changing the setting a snap!", "Date": "August 6, 2011"}, {"Title": "A+", "Author": "Sid", "ReviewID": "R3MIP2OPH2DT9F", "Overall": "5.0", "Content": "I bought this camera after going through various reviews online and was actually waiting for a review from CNET.com on this, but since I had to buy camera soon so I bought it after reading the reviews on Amazon only. The camera is really good, very easy to use for novice users like myself. I generally shoot on Auto mode only. But I spent sometime on the manuals which came with the camera and now I use various other shooting modes as well.The video quality is also very good and since it has a separate button for HD recording it makes it a lot easier to switch. Panorama is awesome too. The camera is a little expensive for me. But it is worth spending that much amount if you don't want to buy big D-SLR's or other HD Cannon cameras. The number of Pixels is almost double than that of Cannon 500 ELPH. Really good camera and would recommend this to anyone looking for a point-n-shoot and for taking group pictures with friends and family. It is small enough to fit into your pockets and still take great pictures in very low light. The concept of Flash having a separate button is good, which solves the problem of sometimes people keeping their finger on the flash.Hope the review helps.", "Date": "June 13, 2011"}, {"Title": "Great Camera, but power button broke already", "Author": "wphoto", "ReviewID": "R3P5DBB47XLQVI", "Overall": "3.0", "Content": "I have this camera for only one month, and took maybe 2000 pics for 2 short day drip within the city. The on/off button already had problem and now i sent back for service. Very disappointed. However, this camera is probably one of the best one in the market for this price. I like the CMOS feature that allows to take low lighting photo. So if you try to get one, make sure your on/off button is working probably.", "Date": "October 8, 2011"}, {"Title": "AVOID this camera: Focusing design flaw, especially for videos", "Author": "Sunny \"'Retired' Engineer\"", "ReviewID": "R8VHELCYWINYV", "Overall": "2.0", "Content": "DISCUSSION OF A FOCUSING DESIGN FLAW of a Nikon P300 Camera and Comparisons to a similiarly featured Samsung TL350.I have been a camera enthusiast for 40 years now and have dropped all my big SLRs and lens since the new compact digital cameras offer such excellent quality. I have worked my way thru 5 sucessive generations of Canon digital elphs, the S410 up to SD780 IS, including a SX110Is and recently decided to upgrade to one of the new BiCMOS compact cameras which allow 1080p HD videos. As my grandkids started arriving I found I also wanted to have high quality videos of them. I avoided the new line of Canon BiCMOS cameras because of the poor location of the flash which produces a shadow of the lens during wide angle flash photos.I ended up buying a Nikon P300 in March. As a still camera it has excellent image and color sharpness when it works, but I have found that it has focusing problem for stills and especially when doing videos. I had numerous discussion with Nikon online service which do not seem well informed about specifics of this camera - at least not at the level of a photo enthusiast. (They can tell you simple things about the operation but are pretty shallow in understanding photography issues.) I sent files of the movies showing the focusing problem, reset all the settings as they requested (no effect) and finally sent the camera back to their US east coast service center in April. They told me the camera was within specifications and returned it to me with the lens cleaned of course!  SO CLEARLY NIKON HAS EVALUATED MY CAMERA AND FINDS THAT IT IS WORKING AS DESIGNED ! UGHHH!After extensive testing of the video even after coming back from their service center, it appears that the lens design of this camera is very poor and will not even closely maintain a focus when starting from wide angle and zooming in, even in bright sunlight. After focusing on a contrasty, distant object in the focus bracket, and then zooming in, everything goes out of focus. And by panning the camera after zooming to find the focus distant, it appears to be focused 4 feet away ! SO clearly the lens focusing mechanism is messed up since once the focus is set on a distant object (near infinity) it should remain fixed (or at least nearly so) as the lens is zoomed in.So for example, if your child is on a sunny beach say 50 feet away and you start with a wide angle video focused on your child and then zoom in, everything goes out of focus. Even objects at essentially infinity go out of focus! I posted some examples of frames from such videos on a photo blog for those wanting to see how bad it is: [...]I have also found that 2 out of every 10 still shots of people on the Nikon P300 also turn out to be out of focus -not quite as bad as the videos - but still noticable on a 4x5 and clearly noticable on a 17\" PC display.Out of frustration with missing these videos and stills on the Nikon P300, I recently purchased another BiCMOS camera - a Samsung TL350. This Samsung model seems to be highly under-appreciated based on the reviews. ( Probably because Samsung does not have the \"reputation\" in photography that Nikon or Canon do.) The TL350 also does 1080 HD videos and has much more reliable focusing than the Nikon P300. The Samsung TL300 allows you to zoom in from wide angle and the object remains in focus! ( as it should with any camera !) So the identical videos zoom shots that became out of focus on the Nikon remain razor sharp on the Samsung !In terms of still shots on the SL3050, a few out of every 100 shots may be slightly out of focus which is a reasonable hit rate for me. The overall sharpness on the pictures from the SL350 is virtually identical to the Nikon p300 eventhough the Samsung is 10 megapixel versus the Nikon's 12 megapixel sensor; and the Samsung allows more control over settings, if you so desire - such as color balance for different lighting conditions as well as saving a raw file along with a jpeg file. The main negatives of the Samsung SL350 is that the zoom does occasionally create a clicking noise when filming and the zoom is abit too fast ( makes your video look very amateurish.) There is a setting on the Samsung that allows the sound to be disabled during zoom which works fine since for these telephoto zoom shots your subject cannot be heard anyway.Another attractive feature of the Samsung is that it allows time lapse as well as high speed photography ( up to 1000 frames per second) even thought at these higher speeds the resolution is significantly degraded. It allows some really fun movies of the grandkids ! The build quality of the Samsung is really solid and impresive and reminded me of the older solid Canon digital elphs, unlike the the Nikon P300 which seems more flimsy.One plus for the Nikon is that the colors that come directly out are bright and vivid, and properly color corrected - as seemed the case with Canon digital elphs - thereby not requiring any further post processing (which I tend to do anyway on my best photos!) In comparison the Samsung images taken at the same time under the same conditions need a slight color correction. (My daughter who has a photography degree from RISD said that it is a trivial correction and that both cameras produced virtually identical photos and videos.) Note that there have been many discussions of the advantages of Nikon's f1.8 lens, but I find that in my shots, the camera rarely goes this low on auto mode - it seems to prefer to always lengthen the shutter speed instead. (Also the F1.8 aperature is only for the wide angle lens.)", "Date": "July 13, 2011"}, {"Title": "Wish I had gotten a different camera", "Author": "sally", "ReviewID": "R3DD6EV1YI7O3Z", "Overall": "3.0", "Content": "I did extensive research prior to purchasing this camera almost 6 months ago.  Based on the reviews, I thought that I'd really like this camera, but I have to say that I now wish I had gotten a different one.  Prior to this, I had a Canon that lasted me 4 years.  With the advancement of technology, I had expected this one to to much better, I liked my old camera better.  In auto mode, this one takes HORRIBLE action shots.  They're a complete blur.  Now, I know that you can manually adjust the speed, but a point and shoot camera should not require that in order to take a decent picture.  My old camera (made 5+ years ago) had an auto setting that took great motion pictures.  Also, I have to use the backlit setting vs. the night setting in order to take any night shots.  I doubt that I'll be keeping this camera half has long as my old camera.  I'm just upset that I'm going to have to buy a new camera so soon.", "Date": "February 27, 2012"}, {"Title": "Excellent Camera", "Author": "Cindy", "ReviewID": "R3LCL87NJOLAQO", "Overall": "5.0", "Content": "This camera met all my expectations...I really love using it.  The only problem I have, (and its not with the camera directly) is that they give you a quick manual.  The more detailed information on the camera is on a disc (they were going green).  This is not good since I like to carry the manual with me and refer to it as I may need.  I ended up having to print over 100 pages (both sides of paper) to use as a better reference.But all in all, LOVE IT!", "Date": "March 15, 2012"}, {"Title": "Just give it a shot and judge for yourself....", "Author": "Estuardo Gordillo \"cafe\"", "ReviewID": "R1SUDQWAQRB2CF", "Overall": "5.0", "Content": "It is been a while since I have not have a camera this size(point and shoot) that gives me the control and quality as this one does, I been reading a lot of reviews and this camera is between the three best of his category,I am not a professional photographer but I do like to take good pictures and play with my cameras, I had several cameras but so for for the size, quality and price this one is one of the best. but do not take my word test it yourself...and for this price... great camera... just be sure that you may need some time to get used to all the features of  this camera, it is not your regular point and shoot...Well a little more than a month and this camera is just great...I posted some of my pics, which it is the first time I do something like that but this is a really good camera, have some learning curve for sure but what does not...", "Date": "January 26, 2012"}, {"Title": "Great P&S; camera", "Author": "Honolulu Dude", "ReviewID": "R2XFD49F24E63I", "Overall": "5.0", "Content": "Great camera, loads of image features, sharp images and great in low light. Can't speak to a full comparison vs. the S8100 (I just checked it out at Costco); but other than the zoom feature, I prefer the P300.", "Date": "December 30, 2011"}, {"Title": "Best point and shoot camera", "Author": "Glenview Cheryl", "ReviewID": "R1LB9O6Y26UNPK", "Overall": "5.0", "Content": "Bought this Nikon P300 a few months ago and used it mostly at home. The performance under low light is the best among all the point and shoot cameras I have used in the past. It starts up instantly and ready to shoot, my previous sony DC takes forever to get the 1st shot.  This is what I value the most as a compact digital camera, the convenience, the exact reason why we need a compact camera. It has to get ready when I want it to. There is a dedicated button for video shooting which I like. Other cameras I have used need to switch to video mode before shooting videos. Editing tool and special filters are powerful and interesting to play with. The flash pops up manually, I find the position of flash is adequate; I am not inconvenienced at all.Suggestions: the dial on the right side does not have much use. It can adjust shutter under manual mode. Under Scene mode it does nothing. I think it is a better idea to use it select from different scenes, so I do not have to enter the menu to select scenes.", "Date": "November 30, 2011"}, {"Title": "nikon camera", "Author": "ivy", "ReviewID": "R14HP7A92OTX6X", "Overall": "5.0", "Content": "love this camera  it is lightweight and durable.  It takes great pictures and is very user friendly.  It also takes great night pictures.  I've had problems with night pictures with other cameras in the past....this camera is great.", "Date": "November 7, 2011"}, {"Title": "Great camera!", "Author": "Deb", "ReviewID": "R1XG4IG5OQXNX7", "Overall": "5.0", "Content": "This camera is wonderful! Light, versatile, and takes fantastic pictures. It is so easy to use and has way more options than I'll ever need", "Date": "November 3, 2011"}, {"Title": "We like it!", "Author": "Lee C. Buttrill", "ReviewID": "RZUWXMR24L1Q5", "Overall": "4.0", "Content": "Needed to replace a PNS that I dropped and did not want to deal with Sony's memory standard.  This is a great little camera.  Good speed, bright flash, very easy to point and shoot right out of the box.CONS: just give me a mini USB port to make the device accessible through a PC.  This comment is not just to this camera, but almost all PNS cameras.  I have a card reader, but it is nice just to plug and play the whole device into any system with a USB port.", "Date": "October 17, 2011"}, {"Title": "Great P & S camera, but horrible packaging", "Author": "L. Da Vinci \"Renaissance Man\"", "ReviewID": "R5KHKFM3BYQ3J", "Overall": "4.0", "Content": "I have had this camera for just 3 days. I was shocked when my package came by UPS, the box crushed, with gaps in the box, whereby the camera box was visible. There was no padding inside the Amazon box, no filler, or bubbles or \"air bags\"  The camera box itself was also crushed, and it was a miracle that the camera was not damaged or pilfered. I don't understand why amazon would this time be so careless about the packaging, where in the past even a $30 item has been protected and packaged better than this camera.I like the camera, it has a choice of full manuals controls, or aperture preferred, or shutter preferred, or fully automatic; it also has exposure bracketing, and many other features I have yet to learn. Comparing it to other similar cameras, it is very sharp, besides being compact and sharp looking.", "Date": "September 30, 2011"}, {"Title": "Nikon Coolpix P300", "Author": "Michael A. Hurd", "ReviewID": "RG8MYLRWCRXL5", "Overall": "5.0", "Content": "Takes great pictures, easy to use, and the battery lasts a very long time. I've taken hundreds of pictures and still had plenty of battery left.", "Date": "September 27, 2011"}, {"Title": "So easy to use, logical intuitive controls", "Author": "Harlan", "ReviewID": "R1TIS1QIZF09NJ", "Overall": "5.0", "Content": "Just like the last two Nikon digital cameras, I love this model.  They just get better and more intuitive.  If you want easy to use, good quality photos, and a well made sturdy camera, I would recommend this model.  The S9100 may be more modern looking, but this is much easier to use (my opinion).", "Date": "September 21, 2011"}, {"Title": "Long time Canon user loves the Nikon P300", "Author": "Amazon Addict", "ReviewID": "R3HHM2NIO0P5Q4", "Overall": "5.0", "Content": "I guess I should start by saying that I have historically been a fan of Canon cameras and I buy a lot of cameras so I have a pretty good idea about what is out there on the market. Here are the cameras I have owned in the past couple years. Canon EOS 40D 10.1MP Digital SLR Camera with EF 28-135mm f/3.5-5.6 IS USM Standard Zoom Lens, Canon PowerShot SD1100IS 8MP Digital Camera with 3x Optical Image Stabilized Zoom (Blue), Canon Powershot SD990IS 14.7MP Digital Camera with 3.7x Optical Image Stabilized Zoom (Black), Canon PowerShot SD780IS 12.1 MP Digital Camera with 3x Optical Image Stabilized Zoom and 2.5-inch LCD (Black), Canon PowerShot SD1200IS 10 MP Digital Camera with 3x Optical Image Stabilized Zoom and 2.5-inch LCD (Dark Gray), Canon PowerShot S90 10MP Digital Camera with 3.8x Wide Angle Optical Image Stabilized Zoom and 3-inch LCD, Canon PowerShot SD4000IS 10 MP CMOS Digital Camera with 3.8x Optical Zoom and f/2.0 Lens (Black), Canon PowerShot SD1400IS 14.1 MP Digital Camera with 4x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch LCD (Black), Canon G12 10MP Digital Camera with 5x Optical Image Stabilized Zoom and 2.8 inch Vari-Angle LCD, Canon PowerShot ELPH 500 HS 12 MP CMOS Digital Camera with Full HD Video and Ultra Wide Angle Lens (Silver)  As you can see I was a pretty big fan of Canon and have been for years but recently I started having a desire to be able to capture 1080p video as well as have a camera then could take decent pictures. The last couple Canon cameras listed were some that I tried but one thing that really bothered me is that most of the Canon cameras limited video capturing to 10 minutes. I would be in the middle of recording and it would just stop and I didn't notice it stopped and would miss important segments of the video. This was a deal breaker to me so I sold the Canon's and decided to give Nikon a shot and I am glad I did. I am very happy with the quality of the video and I am not limited to 10 minutes and it takes great looking pictures as well.. Also as a bonus there is the high frames option on the camera that allows you to make slow motion video which I wasn't really looking for in a camera but it is really cool to have. I would highly recommend this camera.", "Date": "August 1, 2011"}, {"Title": "Good upgrade", "Author": "William Garcia \"W.Garcia\"", "ReviewID": "R1KMVHKBUZXOEP", "Overall": "5.0", "Content": "I Use to own a sony t-77. it has an excellent size and good appereance. But photo quality was poor and night shots even worst.Decide to pick this camera and it just great. Image quality is excellent and night shots are awesome. Very easy and confortable to use.A bit bulky compare to my last camera but image quality is superb", "Date": "June 4, 2011"}, {"Title": "Zoom doesn't work", "Author": "Shari", "ReviewID": "R2BBHKZR8CDAGA", "Overall": "4.0", "Content": "I bought this from Amazon thinking I was getting a new camera. The one I received was obviously used. The biggest problem was that the zoom did not work. For a regular P&S; photo, in order to zoom I had to repeatedly click the zoom button and even then it didn't advance the zoom very often. Zooming out worked fine. Usually with a zoom I just have to hold it until I get the zoom I want, but this one I had to keep clicking. I sent it back to Amazon.The photos were fine, and I liked how quickly it took a photo. Didn't try video.", "Date": "January 10, 2014"}, {"Title": "Nikon P300 Coolpix", "Author": "Bruce", "ReviewID": "RGKXJZQU4H48Q", "Overall": "5.0", "Content": "small, easy to use, good focus screen, switching from photo to video is remarkably easy.  Photos on the computer screen are first rate and very clear. I truly like this camera. (I  dropped it on a hard surface and it did not damage).", "Date": "December 29, 2013"}, {"Title": "Good stuff", "Author": "Knucles", "ReviewID": "R21SYR4JVNYG83", "Overall": "5.0", "Content": "Works as promised. More then 1 year of usage now problems found, only joy. Working as it should doing good its thing.", "Date": "October 27, 2013"}, {"Title": "Fill the job for the price", "Author": "Mario Fendry Utama \"dought\"", "ReviewID": "R3W36CVHMF2FIF", "Overall": "4.0", "Content": "I was an amateur in digital photography and bought two Nikon cameras (P300 and AW100). I bought these for the intention on taking pictures of kids playing sports and their other related activities (birthdays, presentations, exhibition, etc). There were sufficient function to control the semi-manual and automatic settings on the P300. It produces excellent color balance, clarity and impressive on semi/medium low-light. One small complain I have about the P300 was about the slowness in capturing the first picture with good focus on active kids. Sadly, I was not able to compare and explore more of its function as my car was broken into and happened to have the camera (serial number is 30019478) in the car.", "Date": "October 22, 2013"}, {"Title": "It broke on me, I was very careful with it", "Author": "FaeryTale \"Better shopper\"", "ReviewID": "R1ZGA8I4MG2SDL", "Overall": "2.0", "Content": "Just one the shutter closure stopped working. I ended up having to send it in and the repair which was not under any type of warranty cost me $107.00. The camera is great for creating settings. Its almost like a miniature DLSR. The only thing it can't do is change lenses. It is a Nikon, the pictures come out great.", "Date": "September 25, 2013"}, {"Title": "Fine little pocket camera.", "Author": "William Porter", "ReviewID": "R1R1PNFEJ2JU7X", "Overall": "5.0", "Content": "The wide angle is surprisingly wide, but can be quickly narrowed to any degree of normal or telephoto, although it takes a delicate finger to find just the right zoom spot.I take a lot of photos of other photos and pictures on walls in museums and art galleries.  My old Canon made the sides bulge when close in.  This camera does not, and I like perfect rectangles a lot better.", "Date": "September 14, 2013"}, {"Title": "Little Big Camera!", "Author": "robert v airhart jr", "ReviewID": "R16Z8QPOW6UXHG", "Overall": "5.0", "Content": "Small enough to fit in my pocket, with very nice results. I have 67 video's on YOUTUBE, a majority shot with my Coolpix P300.", "Date": "September 2, 2013"}, {"Title": "http://www.amazon.com/gp/product/B004M8SVGG/ref=cm_cr_ryp_prd_ttl_sol_3", "Author": "Jimmy Le", "ReviewID": "R32NNDYWBIZPQS", "Overall": "5.0", "Content": "I had one in the past but given it to my son, now I bought another the same model P300, it is a great camera, good pictures and nice HD video camera. Thanks for prompt delivered.", "Date": "July 22, 2013"}, {"Title": "Great Price", "Author": "tech junkie", "ReviewID": "R2W6MJV4KJ4RW1", "Overall": "4.0", "Content": "Took great low light pictures, but not as good as my old Canon S90. It shoots good HD video also.", "Date": "July 1, 2013"}, {"Title": "Fantastic camera", "Author": "John Olson", "ReviewID": "RW7SPBE2SBFB7", "Overall": "5.0", "Content": "Small, easy enough to use, fantastic pictures, lot of options, fits in a shirt pocket, and well worth the money.", "Date": "May 28, 2013"}, {"Title": "Beautiful", "Author": "Rodolfo Q. Z \"roqz\"", "ReviewID": "R2MM2FFO7P5K9M", "Overall": "5.0", "Content": "Got this for a voyage two years ago, and still is my every day camera, beautiful pictures, great 1080p video, pant's pocket form factor, the batteries last one day of taking pictures like crazy. I don't like that the battery door is easy to open and many times when I take the camera from the bag that happens. Also, it has frozen a couple of times that required removing the battery.The newest model include GPS and better sensors, definitely I will continue to buy the models of this series. Not very pro, but neither a simple point-and-shoot.", "Date": "April 29, 2013"}, {"Title": "Camera takes great pictures", "Author": "MoodyLu", "ReviewID": "RJPW22NEAOU3V", "Overall": "4.0", "Content": "Well, I'm a beginner digital camera user and this camera is a nice size and takes great pictures.  Nice and sharp.  Pretty easy to grab and go take pictures.  However, sometimes I get lost in the menus and have to look up stuff in the manual.  If I haven't used it in a while, I forget stuff.  I have learned not to share this with my significant other, as it is not easy to figure out how to put the settings back.  All in all, a great camera.  I just have to get more used to it.  The LCD screen is nice and big.  Good for my old eyes. And the zoom is easy to work and makes taking pictures from far away easy as pie.  I think Nikon lenses give you the sharpest picture but I am no expert.  It has video but I don't use it - it takes up too much battery.  Recommend you buy a second battery if you are going on a cruise or longer vacation.  I lost some good pictures when my battery died unexpectedly.  Doesn't give you much warning.  However, I would buy this camera again.  No camera is perfect especially for a beginner.", "Date": "April 26, 2013"}, {"Title": "It still takes great photos by 2013 standards", "Author": "joe picchietti", "ReviewID": "RSPREVWXTTDNW", "Overall": "5.0", "Content": "I originally bought this as a backup to a dslr but, it has taken so many good photos throughout the years that I love it. It can take photos very fast, so it's perfect for fast moving children!", "Date": "April 17, 2013"}, {"Title": "Geat Pocket Camera", "Author": "BTB", "ReviewID": "R2UOZB060LXUMK", "Overall": "4.0", "Content": "I bought this to replace a point and shoot my wife uses in her business.  This Nikon is amazing for its size and price.  It shots sharp pictures, does video, and its menus are easy to use.  I \"borrow\" this regularly when I don't want to haul my DSLR someplace.", "Date": "March 28, 2013"}, {"Title": "Still have trouble with photos in low light", "Author": "Rational but Imaginative", "ReviewID": "R2DNIWI79A1QBC", "Overall": "4.0", "Content": "I got this camera because of all the great reviews of photos in low light, but I don't think it performed any better than my Canon 8 MP.  When I try to use the flash to compensate, things come out way to bright with glare.  Why can't they make a graduated light flash that adjusts to lighting conditions?", "Date": "January 13, 2013"}, {"Title": "Best Camera I've ever owned!", "Author": "Miriam", "ReviewID": "RSGJI75WBERPN", "Overall": "5.0", "Content": "I've had this camera for over 3 years now and It still takes awesome photos, the settings are spot-on and it's sturdy! I've dropped it a couple of times and it has never been affected by it! Great Buy!", "Date": "January 11, 2013"}, {"Title": "Definite 5 star when comes to pictures", "Author": "Gregory Topor", "ReviewID": "R2PAFMZPPPXXZ2", "Overall": "5.0", "Content": "Got it on \"special\" amazon pricing for $230 over a year ago...Besides DSLR Pentax K200D and 4/3 SLR like Panasonic GH2 with few lenses and point & shoot Lumix LX5 and LX7, this Nikon P300 is my favorite. At the price I paid it's a steal.Just came back from Riviera Maya Mexico and this one was pretty much the only one I have been using, didn't feel like hauling around back pack with my photo equipment.Videos are pretty good however there are definitely better ones, Lumix LX7 is much better when comes to recording videos. Even LX5 that records \"only\" 720P videos is better.I see the current price is hoovering around $400 and in my opinion it is too much for it but as mentioned at the price I paidits fantastic. Awesome performance in low light, to me its better than newest Lumix LX7 with it's f1.4 (P300 is f1.8)", "Date": "December 4, 2012"}, {"Title": "Great quality.", "Author": "D. Barker", "ReviewID": "RKN1738M6F7L1", "Overall": "5.0", "Content": "Got this for my wife last Christmas and I've been really impressed with it.  It takes high quality pictures with great color, very easily.  Video too.  I've done a few low light shots in the evening that amazed me.  One in particular was people sitting around a campfire.  The camera did an amazing job of blending the brightness of the fire with the lower light faces, etc.  I didn't think it would work, but it did.", "Date": "December 2, 2012"}, {"Title": "Good in low light, but quick to blur in action", "Author": "A. Neuman", "ReviewID": "R2EENNCWKBW07A", "Overall": "3.0", "Content": "I thought this was the best of both worlds in terms of a F1.8 lens in a compact camera.  It does have the ability to shoot in low light without a flash, but I recently realized that all motion shots I take are blurred.  I realize I am not using the camera to its fullest, but it doesn't perform well unless you have a still subject in low light or an action shot outdoors.  The video is great and works well.  Where we have used the camera repeatedly, at weddings, it really falls short.  Pictures up close in low light without too much movement are better than most others, but anyone say walking down an aisle looks like my iPhone took the picture.  I am going back to a hybrid camera, a DSLR is too much work with all the lenses for me.", "Date": "November 13, 2012"}, {"Title": "Spot on photos", "Author": "CMM", "ReviewID": "R18A5PYMAXTWCU", "Overall": "3.0", "Content": "I received this camera for Christmas last year. Very shortly after receiving it a spot began showing up in everyone of my photos. I am very careful with my camera and am disappointed in this. It ruins every photo I take. It will take at least $150-200 to get fixed. Unfortunately I have heard from some other people with this same camera that they had the same problem. Hmmm- is it a problem with camera production?", "Date": "October 17, 2012"}, {"Title": "Amazing Camera", "Author": "sammitch", "ReviewID": "R98M3G52944NY", "Overall": "5.0", "Content": "This camera is simply amazing. The color and the picture quality surpassed what I was expecting. I haven't bought a new camera for a few years and the quality difference is phenomenal. For a point and shoot camera it has a lot of extra capabilities that I haven't began to understand. This is great for the price and nikon's craftmanship is above and beyond!", "Date": "October 11, 2012"}, {"Title": "Bought it for my mother, and she loves it.", "Author": "beestee", "ReviewID": "R3JQ4IQNCKIT3B", "Overall": "5.0", "Content": "My mom is not the greatest at comprehension when it comes to electronics. I was on a mission to find a camera that I wouldn't mind using when I needed to, but that my mom could operate with ease since she would be the primary user.She enjoys the camera so much that she uses it every day!", "Date": "August 24, 2012"}, {"Title": "This Camera Rocks!", "Author": "Mango", "ReviewID": "R1M63288YNOZJT", "Overall": "5.0", "Content": "I bought this camera a while ago, and I wanted to test it out for awhile before i made a review.  I haven't had any problems, the pictures are very sharp and crystal clear. I really wanted a DSLR but this is perfect and does the same quality photos just like it from past experiences, AND you can take it on the go instead of carrying a HUGE camera. The HD video is phenonmenal! Although it tends to auto change the lighting when its too sunny or too dark...which is probably something i have to do manually(if i want it to stop) The voice or speaker is clear, I created many family albums and mini movies and they look great! I'm a perfectionist with it comes to photography and so everything has to be perfect and you can get it with this camera in one shot! Evening when moving it paints out the perfect snap shot. Also, the battery life is amazing! i take lots of photos and video and with one charge it last up to 4-5 days!!! and for it to charge competely its like 15-20 min. I recommend this camera!!! Very good if your looking for crystal clear photos and if you want something small or compact. Well worth every penny!", "Date": "August 19, 2012"}, {"Title": "Great camera", "Author": "mooselook", "ReviewID": "R11GPTVVO6W185", "Overall": "5.0", "Content": "We bought this camera to replace a 10 year old camera that had always been difficult to use. We wanted one that we could easily use and took good photos. This camera delivers on both issues. I would recommend this camera to anyone who wants excellent pictures along with a \"user friendly\" platform.", "Date": "August 15, 2012"}, {"Title": "So far so good...", "Author": "KJ", "ReviewID": "R3FFTJ8Q9DW240", "Overall": "5.0", "Content": "I purchased this camera about 3 weeks ago right before taking two separate trips, one to New York and one to Hawaii.  I have been very pleased with the camera so far.  The photos I have taken have turned out well, with good colors and focusing.  The pop-up flash takes a bit to get used to sice it occurs right where I generally grip the top of the camera, but it's not a big deal.  The camera is more bulky than other compact point-and-shoots, but still fits comfortably in a front pants pocket.  It takes very good photos at low light.  I'm not a huge camera buff, but purchased this camera hoping that it would provide better quality photos than the Canon SD1400 compact P&S; that I bought a year or so ago.  So far it has not let me down.", "Date": "July 23, 2012"}, {"Title": "Sharp pictures", "Author": "shopper \"blue light\"", "ReviewID": "R3C5LG50ZXZ5TI", "Overall": "5.0", "Content": "It takes wonderful pictures.  You must invest a little time and thought into reading the instructions and practicing with its settings to fully realize all that the camera can do.  If you're just a point and shoot person, this camera is overkill for you.  Why buy a Cadillac to go back and forth to work?", "Date": "July 8, 2012"}, {"Title": "Love this camera++++", "Author": "Sharon L. \"Sharon L.\"", "ReviewID": "R3GQI5IGLPVNW", "Overall": "5.0", "Content": "Taking photos is extremely easy using this camera. The software and download procedure is just as simple. I haven't gotten into any elaborate photos yet but it takes great pictures. The zoom feature is quite clear and sharp. Very happy with the purchase.", "Date": "June 11, 2012"}, {"Title": "So far so good", "Author": "BigStan \"RegularGuy\"", "ReviewID": "R1Y4NW9O4BDP0B", "Overall": "5.0", "Content": "I just got this camera and I am totally impressed with the low-light pictures.  I didn't have a compatible SD card so I tested on internal memory after formatting it. With 90mb of internal memory I think I can get about 40 pictures for now. I plugged the usb cord from the camera into my computer and Windows Vista automatically loaded the driver.  After confirming the driver had loaded I then clicked on my Computer in the Vista Start menu and sure enough the P300 icon was there and I clicked into the folder until I found the photos.  I didn't have to bother installing the Nikon software that came with the camera.  I just selected the photos I wanted and copied them to my Pictures folder in Windows.  After pasting the photos I use a photo editor I like Corel's PaintShop Pro to crop or edit the photos.  I have used Adobe's Photoshop but I like the frugal and easier-to-use PaintShop Pro. You can pick up the older software version on eBay for $13.00. The Nikon saves in jpeg format so I am pleased.  I like to keep things simple.I had a bit of a tough time using my big finger to jog in the date and the time in the camera.  The control is a bit sensitive to off-center hits. Fortunately I shouldn't have to program this much.  On the screen a tiny red clock sign flashes if you don't input the date and time.  I do not like this feature but I realize having the date and time helps the camera to name the jpeg photo files properly.  This is going to be my go-to camera for indoor and night pictures.  All in all I am very impressed and do not mind the battery situation. I may buy the Wasabi battery and charger kit.  I will try to get by without it first.  More important was that I ordered a camera bag and SDHC card.  I will update this review in month or two after using the camera more.", "Date": "April 6, 2012"}, {"Title": "Great Camera!", "Author": "Robyn Howes", "ReviewID": "R4CMRD9CWBZ2B", "Overall": "4.0", "Content": "Nice quality camera for a much better price than some of the more professional cameras. Great starter for those who are interested in photography but don't want to spend top dollar!", "Date": "February 21, 2012"}, {"Title": "Great camera!", "Author": "D. Dimauro", "ReviewID": "RCDJ4YKVMEVXK", "Overall": "5.0", "Content": "Excellent still photos and videos with nice sharp edges. Colors are very vivid and lifelike. The camera performs very well with both photos and videos in low light situations.  I've had both Panasonic and Canon point and shoot cameras with image stabilizers that don't work as well as this one. This is my first Nikon camera but it will not be my last. I think this camera is a great bargain!", "Date": "December 1, 2011"}, {"Title": "Nikon P 300", "Author": "D Yang", "ReviewID": "R1YDR6UV4TQ6C4", "Overall": "4.0", "Content": "I purchased the Nikon p300 when it was sold at a special low price.  I like the fast F 1.8 lense that will allow more light in.  The result of low light images without flash are very good.  However the panorama pictures are not as good as I expected.  There are two moods you can select.  The first one is easy panorama, which gives you a picture directly from the camera but the picture files are very small, only 900 some pixels in height and the image does not freeze moveing objects as well as the Sony wx 5 camera does.  The second one is panorama assist mood, you need to use the computer to complete the sequential pictues into one.  In this mood you can set your file size and zoom setting of your choice.  I did not make many HD movie tests. The mic seems to pick up lots of noise when I was taken it in a quite room.  This may be true for all small pocket cameras.  The battery is charged inside the camera body.  The charging wire has a USB plug at the other end connecting to the AC adapter. So you may use the same wire upload the image files to a PC without taking the SD card out and get the battery charged as well at the same time.  If Panorama picture is not a important concern of yours, I would recommand the Coolpix p300", "Date": "November 28, 2011"}, {"Title": "not for indoor video use", "Author": "Sinan Akciz", "ReviewID": "R3DR9UG0FRKBYB", "Overall": "3.0", "Content": "The main purpose of ordering this camera was its highly recommended video quality. As new parents, we did not think that carrying a digital camera and a video camera was a good option. Why not take a camera which can do both, we thought. We also wanted it to be small, so that we would not think twice about taking it with us everywhere. We have used the camera inside our house for several days, doing test shots under different conditions (everybodies house is lit different) and played them on our hdtv. For us, image quality and focus capability was not good enough to justify having another point and shoot at home (Canon s90 is our other one). If we did not already have the s90, we would have kept it. If you have a regular point and shoot camera, don't think twice and get it.", "Date": "October 15, 2011"}, {"Title": "An excellent camera after 1 year+ heavy use", "Author": "R. M. Scott \"pedi neurosurgeon\"", "ReviewID": "R2CIFNAO0RXRDO", "Overall": "4.0", "Content": "I've had the camera now for two months (but see below) and took it on an 8 day hike, where it was taken in and out of an REI camera case multiple times.  I took more than 400 pictures with it during this time.  The image quality is great, and some of the scenes it rendered beautifully -- shooting into the sun, sunsets, backlit scenes -- were spectacular, better than any point and shoot I have ever had (Sony Cybershot; Canon Powershot being my most recent ones, both malfunctioning after a year or two).  There are many options readily understandable on its program, and I particularly liked the ability to chose aperture or shutter priority modes.  The \"scene\" program (for shooting fireworks, night scenes) looked like fun, but using it was not intuitive in the field, even though I read through the complete guide prior to my trip.  The camera simply excelled in low light situations.  Its drawbacks are related to ergonomics -- in a hurry, it was hard to find the tiny power on switch.  It was too easy to press the wrong prominence on the top of the camera when one wanted to activate the shutter.  The camera is larger and heavier than the typical point and shoot, and it is surprising how much difference  an ounce or two and a slightly increased thickness makes when one tries to carry the camera in a pants or shirt front pocket.  In summary, a great camera which was worth the extra expense in terms of image quality, but not so good for its ergonomics and its heft.  The picture quality was worth putting up with these drawbacks, however.Additional comments:  I have revisited this review after  more than a year's heavy use of the camera.  It traveled again with me on another hiking trip, and once again, the camera functioned flawlessly, with striking picture quality in all kinds of lighting and weather.  The picture quality was particularly good in very low-light settings.  The comments regarding ergonomics made above remain relevant, however.", "Date": "October 2, 2011"}, {"Title": "Great Product!", "Author": "John D. Culbertson", "ReviewID": "R163AFGEITSYP0", "Overall": "5.0", "Content": "This was my fourth digital camera. I wanted, first, small size, and this is the smallest camera I've ever owned. Very easy to bring along to every gathering, which is what I tend to do. I wanted it to be a camera for dummies with the ability to grow in skill, making tweaks in the pictures taken as I learned more. This camera definitely provides that. I've learned several new things in the three weeks that I've been using it. It has video which I really don't give two hoots about (but now can change my mind). As near as I can tell from reviewing pricing, the video component is pretty close to being a \"free\" app. The price was right when compared to my local camera store.The only downside is the directions provided. They come on CD in the form of a PDF file. That's pretty much ok, I guess. It makes the physical package much smaller - esp since the directions are 200 pages in length. But I was willing to pay to have them printed so that I could read them, make notes, and reference them over time. I took the file to Staples and they were not permitted to print it for me because it is copyrighted! REALLY not good.Some buyers don't even own computers, and what are they supposed to do?But, all in all, I highly recommend this camera. I've received several complements on the improvement in my pics from the last (Nikon) camera.", "Date": "August 22, 2011"}, {"Title": "Excellent Pocket Camera", "Author": "sailorboy414", "ReviewID": "R1F5XQ39P2L6DT", "Overall": "5.0", "Content": "Great photos all around. You can take indoor pictures without flash (important if you want to take baby pictures without flash). Night shots with burst mode are very good. I took photos of a building at night, handheld. Last year I took at the same photo with another camera and I needed a tripod. Pictures look the same. Very impressive. Very little noise. Panorama works well. Haven't really tried the video yet because I just don't use that feature as much. Overall the camera is all you want or need in a pocket camera and when you compare the price to Canon S95 it becomes a great buy. I have been through many cameras to find one that does everything I need. Looks like this one is the one! Get this... you won't regret it.", "Date": "May 21, 2011"}, {"Title": "Spendy but worth it", "Author": "Jeff Carrete", "ReviewID": "R15BS4U81YDTGC", "Overall": "5.0", "Content": "I got this camera so that I can take pictures in low light with and without a flash.  I can now leave my SLR at home especially for when you have to pack light and you can be assured that you'll come home with some nice shots.  The zoom on this isn't all that great but that's not what i bought it for.", "Date": "April 29, 2011"}, {"Title": "Unhappy with resolution", "Author": "Spencer Crandall", "ReviewID": "RADWKHMYXO1VF", "Overall": "2.0", "Content": "This camera, while it takes sharp pictures, takes them with way too much noise. I've upgraded to the Canon PowerShot G15 with the hopes of major image quality gains, despite the loss of portability. But, that's what my iPhone is for (super portability) and it takes photos that are just as nice anyway. It's well built, never had any problems, but the amount of noise and (forgot to mention this) the poor autofocus in low light finally put me over the edge. I don't think point and shoots have ever been Nikon's strong suit anyway.", "Date": "April 10, 2013"}, {"Title": "Good for the price", "Author": "HLK", "ReviewID": "R1MH9JIDYDJJ4B", "Overall": "5.0", "Content": "I have both this camera and the Canon S95. Initially I was a big fan of the S95, but it was too slow and missed shots. Then I got the P300, it has a much faster lens with far fewer missed shots. I work as a photographer and I could write on and on about the technical stuff but the bottom line is that the Nikon P300 is a better camera in certain situations, whereas the S95 works better in others, so I own both. If I had to choose, I'd pickthe P300, simply because I have a professional camera for quality photos and the P300 for when I need to get a photo quickly, I can just reach into my pocket and it's ready.", "Date": "March 13, 2012"}, {"Title": "Excellent low light camera", "Author": "Scuderia Ferrari", "ReviewID": "RUDSDGMNV9Q72", "Overall": "5.0", "Content": "This is definitely the best compact point and shoot camera I have ever purchased.  The 1.8 lens makes shooting in very low light conditions super easy with very crisp pictures and no distortion.  Im continually amazed with the quality of the pictures.Im not professional photographer by any stretch of the imagination but when showing pictures to those friends that do have very expensive SLRs with 5K+ lenses, they all agree that this camera produces excellent quality pictures.Get this camera while you can!  You wont be disappointed.", "Date": "March 4, 2012"}, {"Title": "Easy to take GREAT pictures!", "Author": "OTF", "ReviewID": "RA818S2HB2RBO", "Overall": "5.0", "Content": "Can't say enough good things about this camera.  Had purchased a cheaper 14mp camera a few months ago from another leading brand.  The pictures from this one are night and day better.  It is not about the megapixels but the quality of the light sensor and lens.  Pay the extra money and get a better point and shoot.", "Date": "February 28, 2012"}, {"Title": "Great Second Camera", "Author": "G. Kostovick \"Mac Geek\"", "ReviewID": "R2OLLT2A0SHL0P", "Overall": "5.0", "Content": "Have been looking for a point and shoot to carry along with my DSLR and this fits the bill. Has a great lens and similar controls as the larger camera;", "Date": "October 30, 2011"}, {"Title": "All around great camera", "Author": "Ben G.", "ReviewID": "R1EGORS2DSTNM1", "Overall": "5.0", "Content": "I had another Nikon (S70 model) with all onscreen controls.  That was \"cool\" at first, but became painful to actually use.  I love the controls on this, the zoom is solid and the picture quality is excellent.  No complaints with this camera at all...", "Date": "September 13, 2011"}, {"Title": "Quality indoor and low light images", "Author": "K. Battula \"Cyber shopper!\"", "ReviewID": "RPTDGNEC5QJGL", "Overall": "4.0", "Content": "Bought this mainly for usage in indoors and low light circumstances and i am quite pleased with the image quality especially when there is not enough natural light out there. Of course need to do more reading to understand all the rest of the modes and how best to use this under all circumstances.", "Date": "September 11, 2011"}, {"Title": "Best Point and shoot on the market", "Author": "Josh Rifkin \"riffking\"", "ReviewID": "R24SBO1YO0LV63", "Overall": "5.0", "Content": "this camera takes the best pictures in low light. The preset is perfect. Also the manual adjustments are easy and produce incredible shots. Pretty intuitive. I am in love with this camera", "Date": "August 21, 2011"}, {"Title": "Good Camera but some Cons", "Author": "canonfan", "ReviewID": "R3SVUFFX6LSGSP", "Overall": "3.0", "Content": "I liked this camera because HD 1080P and 1.8f Lens. The cons i have is it used a custom usb cable to charge or connect to the computer. I have to remember to carry this \"special\" cable to use or charge. it is bad because i have to carry other cables too. I am already carrying my 2.5 disk enclosure and Mini USB Cable. I am already using this cable for my Sony Video camera, Canon DSLR Camera and Enclosure. I don't know why they can't make it all standard.Other issue is to charge or connect to the computer which you have to do, the connector is bottom of the camera. It doesn't stand after that. So i have to buy screen protector. Every other connector is on its side except the USB + Charge + A/V Out. I don't know who designed or got a concept like this.All other buttons and controls are very user friendly and even has a full manual control with two rotator one for fstop and another one for shutter speed.Still looking in to the image quality.", "Date": "May 24, 2011"}, {"Title": "Takes a Fast Picture", "Author": "Wandering Hoosier \"dog lover\"", "ReviewID": "R20GXE52V8FRLX", "Overall": "4.0", "Content": "This is really a great camera.  I previously had a Sony point and shoot and a Panasonic Lunix.  This is by far a vast improvement over both.The camera is very small and lightweight.  It fits easily into my pockets.  Most important to me, it takes very fast photos.  I must add, though, that the person in the photos must be still for the quick second when the picture is being taken or else the picture will be blurry--the reason I gave the camera four rather than five stars.  However, the camera quickly allows the photographer to take another subsequent photo, thus decreasing the chance that all photos will be blurry.This camera is also good in dark situations.  I tend to take inside photos and am very impressed by the pictures the camera takes in sub-optimal light.The zoom and other features of the camera have been adequate for my everyday needs.  A professional or serious photographer might want a camera with more options, but for an amateur picture taker, this camera should suit everyday needs.", "Date": "December 26, 2011"}, {"Title": "The best pocket carmer in the world", "Author": "Shi Shang", "ReviewID": "R28GPISMY3T5K6", "Overall": "5.0", "Content": "I bought this camera last year on sale for $230 something. No doubt it is the best pocket camera in the world. Small, beautiful, portable, very fancy pictures compare with other pocket camera, especially in the night.I will give it 10 stars!!!!!", "Date": "June 22, 2012"}, {"Title": "Excellent camera for the price", "Author": "Rene Santos Cobos \"Velerito\"", "ReviewID": "RK610D2BM6QUN", "Overall": "5.0", "Content": "Excellent camera for the price, nice photos, the optical zoom works fast and smooth, clear and sharp pictures, the video is full HD, I noted only the fault of a continuous shoot for activities like sports or pictures of small children's playing. I recommend strongly this camera.", "Date": "March 12, 2012"}, {"Title": "Small and Powerfull", "Author": "Plain Wayne", "ReviewID": "R2F5XYAT2NJ7R5", "Overall": "5.0", "Content": "I needed to replace my 10 year old digital. I wanted a camera that will fit in my pocket and yet have high resoloution and also be fast. I am very happy with this selection. I purchased a 16GB memory card and extra batteries as well. I haven't tried the HD video yet so I can't comment on that.", "Date": "March 11, 2012"}, {"Title": "Mike", "Author": "mike", "ReviewID": "RUR0BCQ32BKUR", "Overall": "5.0", "Content": "I own a Nikon D90 DSLR camera and wanted a point and shot to carry in my pocket. This camera is unbelievable. Low light shooting is great with out a flash. Action shots are good for this type of camera. start up is very fasy", "Date": "December 14, 2011"}, {"Title": "Great camera", "Author": "Elodea123", "ReviewID": "R20HI1ANGIDGQT", "Overall": "5.0", "Content": "Very pleased with this camera so far. A little pricey compared to other point and shoots, but I think worth it was it. The macro mode is fantastic and the camera is great in low light conditions. I also like the menu set up for the different modes. Great for an amateur photographer, but also has manual modes if you want more advanced options. A nice camera!", "Date": "December 5, 2011"}, {"Title": "Great camera... only one potential flaw", "Author": "Jonathan Steinmann", "ReviewID": "R4YZ7QHSM6U7K", "Overall": "4.0", "Content": "The camera is well designed, and takes nice pictures and video. The only flaw I see with the camera is the cord.  The cord is used to both transfer photos as well as charge the camera (no batteries / quick swaps), which means you better have a full charge and check before leaving an electric outlet anywhere you go.  But that's a minor issue... the cord uses a proprietary end to it that no other camera uses but Nikon.  That means if you lose this cord, your camera is a brick.  Can you buy a new cord from Nikon, sure, but I personally dislike when companies do things like this because it ultimately hurts the consumers.  All in all, I can live with the cord situation, but I think it's inconvenient for many users.", "Date": "September 6, 2011"}, {"Title": "Good camera, bad for video", "Author": "neblinc", "ReviewID": "R27I4BLJ34AN1J", "Overall": "3.0", "Content": "Camera is what I expected. It is very light and can feel less stable when using it.Videos are not good at all when you use zoom.", "Date": "January 27, 2012"}, {"Title": "Basic Usage", "Author": "Ava Baby", "ReviewID": "R1WV85O8FGUDO1", "Overall": "4.0", "Content": "I have used the camera in default setting and quality is amazing. I'm really surprised. A tad bulky, but no way was this marketed as a compact digital camera. The zoom range is worthy of the buy. My little ones, 3 and 4, can even take photos. Scary, yes, but handy that they can. Will upload photos shortly.", "Date": "August 9, 2011"}, {"Title": "Disappointing", "Author": "Chris Alas", "ReviewID": "RZB8W896DE0Z5", "Overall": "3.0", "Content": "So after reading multiple reviews on this product I decided to test it out for myself. A little background; I am a professional freelance fashion photographer with 5+ years of experience with cameras, and Nikon in particular.I had been researching for a decent point and shoot camera to accompany me during every day trips, and especially for night time / low light club & event photography. Originally I had purchased the Sony WX9, which besides the extreme noise reduction algorithms and extreme smudging of detail at high ISO, I was somewhat pleased with the camera (my favorite feature was the Superior Auto mode that combined up to 6 shots for an \"HDR\" effect).Not quite 100% satisfied with the WX9, I set out to compare a few other cameras, and due to price and a few other factors, finally settled between \"upgrading\" to the WX10 (hard to get locally), or the P300 (also hard to get locally). I decided the WX10 was close enough to the WX9, so I would instead try out the Nikon P300 to see how it faired.After receiving it in next day air shipping from Amazon.com, I returned it within 24 hours. Here's why.Unwrapping the P300, everything seemed decent. It is pretty light, a bit too square for my tastes but it is easy to hold. Like some other reviewers mentioned, the casing seems to be made of some high grade plastic and not metal. It felt solid, but just looked like an amateurish toy camera in my hands. I also didn't like that the speaker holes were right inside the tiny grip on the right side, somewhat counter intuitive. I'm not a fan of the extra \"mode dial\" on top either, it's usually where the shutter button is and my finger kept wanting to press it to shoot.Being a long time Nikon user, the P/A/S/M controls were easy to use, however I was disappointed in the lack of Scene modes. The 921k screen was very nice, but one thing that bugged me was that it did not automatically update the screen when changing exposure/iso/shutter/aperture. Most newer cameras do this standard. Taking pictures was pretty easy, I did not see any noticeable Auto Focus \"seeking\", and it was tested in my room with very low ambient light levels. I will say this, it had great exposure of dark/night shots, even without the HDR setting, which takes me to another gripe. The HDR effect is only available as a Scene setting. This would be much better if available as an optional setting for ALL Scene modes.By this point my old WX9 or even the untested WX10 seemed better suited for my tastes. I prefer the punchier, more vivid colors of the Sony sensor as compared to the Nikon P300 out of the box. Granted, I did not play around with the saturation controls, so take it with a grain of salt. I'm not bashing the IQ of the P300, indeed, it does seem to have slightly better detail (less smudging) vs the Sony P&S;'s, but still far worse than say a P&S; with a larger sensor and higher pixel count. I also found the sheer lack of settings and options available very frustrating. Sure to some the Sony cameras may seem like overkill with their features, but I would rather have MORE settings and features available to me than LESS. The P300 did OK with panoramas, nothing great. The HDR Backlight was alright, but only combined two shots I believe. It was difficult to get a steady snapshot of myself while hand holding the camera, I thought it came with auto shooting smile/face recognition, perhaps I was mistaken. Another feature that should be commonplace nowadays.What really broke the deal for me was the P300's video mode. In summary, one word: HORRID. The HD video is jumpy, dismal low light AF/tracking, and the zooming motor is EXTREMELY loud in the video, and there is no feature for noise level reduction such as \"wind noise reduction\". I did not bother testing the 120fps high speed mode.All in all, it IS a decent camera, but if you are looking for something to take quick and steady shots that look great no matter what the environment with features to cover most of your needs (and then some), look elsewhere. If I had the money I would probably look into the Canon S95 (hate that lens ring though). I ordered my WX10 and am sure to be happy with it considering how much I enjoyed the WX9.", "Date": "June 26, 2011"}, {"Title": "Prefer the S95", "Author": "D. Morris", "ReviewID": "R27VUEPM0RCO5U", "Overall": "4.0", "Content": "Have both the S95 (for about a year) and now the P300 (for about a month).  To be honest, I prefer the S95.  Some facts - I'm a casual photographer but I hate using something like the Canon SD1400 - too slow and the pictures are more often bad then good.  Got the S95 and have been using this as my point and shoot camera ever since (I have a D90 for the bigger stuff like the kids playing sports).  Picked up the P300 because we needed one for work.  My personal thoughts are1. The S95 takes better shots2. The S95 has a better screen3. The S95 is easier to use4. The video on the P300 is choppy (one of the primary reasons I went with this camera)5. The charging system is asinineNow I've read that lowering the video quality can help and wish I had done that before I really needed it.  I know I can purchase a separate charger (negating some of the savings over the S95) and I know that plenty of people will say this takes just as good of a shot and is easier to use.  But in my opinion, the S95 is a better camera.  More expensive, but better.", "Date": "September 9, 2011"}, {"Title": "Great camera for $300", "Author": "David Chan", "ReviewID": "R16HUURKGX0IH8", "Overall": "5.0", "Content": "I tested several cameras (Nikon P300, Canon 500 HS, Sony HX7V) and keep the Nikon P300 finally.Pro:1) Great outdoor image quality. All three camera I tested are good.2) Indoor image quality is the best among the ones I tested.  Even though it is not perfect, the color, noise and focus are decent when keeping the image not higher than ISO 400.3) HD video is decent.  P300 pick up some background noise but not too bad.4) I like the position of the flash (left with popup).  The shadow caused by the flash is minimal (unlike the HX7V).5) Menu is very responsive.6) Focus is fast.  All three camera I tested are good.7) No need to remove the battery for charging.Con:1) It doesn't have 3:2 aspect ratios.  I don't know why most of the compact cameras don't have this option.  It is the default size to printing 4x6 photos.2) The auto mode has only center only focus instead of auto select focus.  Very strange.  So, P is the auto mode actually for this camera.I actually like the canon 500 HS a lot too bad it has several flaws to me.1) 500 HS has a crazily loud motor noise when you zoom in/out during the video shoot.2) Touch screen is not good.  Selection is ok.  But scrolling is hopeless. Also, very easy to select something randomly.3) 720p video size is bigger than P300 (almost double).  May be file format related.4) Inconsistent indoor photo quality.HX7V has 2 fatal flaws I cannot tolerate:1) Slow.  Menu selection is very slow when browsing photo or delete.  It takes 4 sec for it to actually record video after pressing the button.2) I hate the shadow caused by the flash.Feature that are in Canon 500 HS I would like to have in P3001) 3x2 aspect ratios2) Less background noise when shooting video with no zooming.3) More interesting body colorsFeature that are in HX7V I would like to have in P3001) Shooting 2MP photo while shooting video", "Date": "May 18, 2011"}, {"Title": "Great camera but very delicate", "Author": "MiamiMedic", "ReviewID": "R2PXTRMG78N49I", "Overall": "4.0", "Content": "The P300 has set a new standard for cameras.For those that love their DSLR but hate looking like a dork when you taking it to bars,clubs,dinner,etc this camera is for you.The manual features are superb with easy access to shutter speed and F-stop controls you most definitely would be able to take just as good pictures as with your DSLR you left at home.I cant wait to use my P300 at night with its f1.8 lens.But keep in mind it will not stay at f1.8 at all zoom ranges.Its 1080p video also looks great but haven't really tried it out yet.Also its LCD is HUGE unlike most other cameras you can actually see the details of pictures you take.Why I gave it four starsReceiving this camera today my first impression upon removing it from the box it that I will break it.For its average size it has no weight.Compared to an Olympus PEN and an SN95 which feel like they can survive a fall the P300 feels like something might crack.Besides its lack of protection or sense of security the camera is just amazing.", "Date": "March 24, 2011"}, {"Title": "great features above average IQ", "Author": "®", "ReviewID": "R1Z19ZL2X03FM2", "Overall": "4.0", "Content": "I used my Nikon D7000 like 95% of the time.  The other 5% of the time is this camera which is small is more portable.  The main reason I got it was it was the cheapest PASM camera at the time.  Everything else was 400 or more.  I think it takes good images but not the best (but good for the price).  It is weak indoor like all other P&S; (without the flash) producing noise.Positive:1. Metal body most in this price range is plastic.2. PASM and single point auto focus is very good. IT is very intuitive.3. Does its own HDR (not bracketing) and panorama works fine.4. Image quality (IQ) is above average in the P&S;, but no the best.5. LCD screen is very sharp.6. good control, has two scroll wheels.Negative:1. No RAW2. Battery, when it is half full on the icon it goes really fast.Charging via USB.  Some people like it, I prefer not.3. I don't like P&S; camera and no viewfinder so I don't enjoy shooting them.All in all it is a good camera for its price.  I like the built and control quality.  I would prefer better IQ indoor.  So now I have a Sony Nex3 to take time away from this camera.  I was carrying to many lenses for the D7000 and my back was getting tired.  The Nex 3 is now my walkaround camera and P300 in my work bag all the time because it is small.", "Date": "September 27, 2011"}, {"Title": "Nikon P300", "Author": "Phil Jungbluth", "ReviewID": "R207GWXSSCXH0U", "Overall": "5.0", "Content": "I'm very satisfied with my new camera so far. One of the best features is I purchased this on Amazon and saved about $100.00! Also I like how it can take a clear photo even if the subject is backlit. My photos are extra sharp in comparison to what my old mini camera could do. I've only made a few test shots so far but as the holiday approaches I'll be using it quite a bit. It was recommended by Consumer Reports so I decided to make the purchase and I'm glad I did. Thanks CR and Amazon!!!", "Date": "December 15, 2011"}, {"Title": "LOVE LOVE LOVE THIS COOL PIX CAMERA!!!", "Author": "Brenda C. Thompson \"Brenda\"", "ReviewID": "R4X022ENF25WE", "Overall": "5.0", "Content": "THIS WAS A FAST AND EASY TRANSACTION. I LOVE THE EASY WAY IT IS TO WORK IT AND THE CRISP CLEAR PICTURES IT MAKES. NIKON HAS DONE IT AGAIN AS ALWAYS A RELIABLE COMPANY.", "Date": "December 9, 2011"}, {"Title": "Great camera so far", "Author": "Duane E. Hampton", "ReviewID": "R3ST0CRHNBJ5S", "Overall": "4.0", "Content": "I am new at this so I was very conservative in my ratings. I have had no issues yet and it has performed perfectly.", "Date": "October 1, 2011"}, {"Title": "A \"CASE\" for Nikon COOLPIX P300.", "Author": "Vinni", "ReviewID": "R3JLVLT2NUCM5Z", "Overall": "5.0", "Content": "----------This is \"NOT\" a camera review. \"PLEASE\" read other reviews for information about this camera.I just want to talk about a \"CASE\" for P300 because I spent a lot of time looking for one but was mostly disappointed with what is available out there. I hope this helps those who are looking for a 'case' for it.(I 'didn't' want to rate it but that option is not there. My rating is 5 stars because I am happy with it.)----------CASE- The first case I got for it was 'Nikon Coolpix Black Leather Case Product Number: 13059', the one that Nikon recommends for P300. But, the cover/flap doesn't close with the camera inside the case so I returned it.- Then, I got 'Cosmos Black Leather Case Cover Bag For Nikon Coolpix P300 Camera + Cosmos cable tie' from Amazon. That case is definitely only for P300. I have a liking for leather cases. But, sadly, I had to return that one too. There was no free space with the camera inside it, like no room at all. You also have to be a little careful while using that case and will have to explain to others how it works. I didn't want something that was complicated in any way. It looks nice though.- FINALLY, I got the 'Case Logic DCB-302' case. It's not a perfect case for P300 (and is not a leather case) but it's nice. It's got a pocket that can be used for an extra battery or a memory card. Case Logic doesn't recommend it for Nikon P300 but a Kmart close to where I live had it in store, so I went there and checked it out and got it. I tried a few cases at Best Buy too but this case was the best one I came across for this camera.People with P300 should check it out.", "Date": "March 26, 2012"}, {"Title": "Good for quick snap shots", "Author": "YK", "ReviewID": "R2SINR2FU2PS4U", "Overall": "3.0", "Content": "I have a DSLR camera, but I felt difficult to bring this for a travel.So, I bought P300 a week ago.External appearance is not good looks like weak, but picture quality is great for me.Especially, it gave good quality pictures inside a building.Only one concern is AF ability during movie recording.It showed poor AF ability for movie especially.", "Date": "May 9, 2011"}, {"Title": "good for adorama and nikon p300", "Author": "jose bravo", "ReviewID": "R3HTWTTYKOW8HR", "Overall": "5.0", "Content": "The product arrived on time. The service from adorama was very good.I received the camara in venezuela without any problems, full accesories, according the advertised for amazonI have been testing the camara and it is amazing, good image quality(very good in low light), easy to operate, well builded. Of course you must read the manual to get more from this product, but you can be lazy and set  it in automatic, the p300 does it very well. I have not tested the video, but it appears to be good.I give 5 stars to nikon p300.Good for amazon and adorama", "Date": "March 24, 2012"}, {"Title": "Very happy with the nikon coolpix p300", "Author": "K. Anello \"kaamed\"", "ReviewID": "R14C4VAR2M4YQI", "Overall": "5.0", "Content": "This was a gift for my wife to use so she doesn't have to bring her cannon rebel SLR. with her all the time.  She is very happy with the pictures this camera takes.  Very bight and crisp.  She also likes the different functions that the camera has that can be used depending on the conditions of the shot.  She very happy with the camera.", "Date": "December 18, 2011"}, {"Title": "OK at best.....", "Author": "P. Baek", "ReviewID": "R3QKG80W8I71VM", "Overall": "3.0", "Content": "Pros:*  Small and lightweight*  \"fast\" 1.8 lens*  Crisp, detailed, smooth 1080 video (the best I've seen so far in a compact camera)*  Decent low-lght images (ISO 400 or below)*  Reasonably pricedCons:*  Flimsy build quality*  Image quality just average in general (detail, sharpness, colors not as good as the better compacts from Olympus or Panasonic)*  Terrible AWB*  Very limited manual controls*  No RAW", "Date": "March 29, 2011"}, {"Title": "Not compatible with MAC OSX", "Author": "Sue", "ReviewID": "R3F6CZAZ23JHPD", "Overall": "4.0", "Content": "Was very pleased with performance of the camera, great photos and video. But spent frustrating week making it work with Apple's iMovie application. Once that was accomplished I found that saving the crisp JPEG image to DVD was impossible. I made many calls to Apple and they tried to help but in the end it appears to be that the camera is not fully compatible with Mac OS X. I had no help from Nikon Technical help who listened to my query and then put me on hold, never to return! When I was researching the camera I read many glowing reviews but none mentioned whether the work was transferred to PC or MAC. I also emailed and phoned Nikon to ask them if the camera would work with iPhoto and iMovie. I was assured \"Yes\". In truth you can transfer to those two applications but not as seamlessly as with my old Canon camera.", "Date": "June 24, 2011"}, {"Title": "case too small", "Author": "Gerard Majerus \"gege\"", "ReviewID": "R15B6WA4VD31CD", "Overall": "4.0", "Content": "Do not buy the Caselogic TBC-302 case that Amazon suggests in the \"Bought Together\" section of the Nikon Coolpix 300, I did and found out that it is too small for the camera. The camera's dimensions, are 1.3 x 4.1 x 2.3 inches, the case's inside dimensions are 1 x 4 x 2.5 inches (those dimensions are Amazon's).", "Date": "May 18, 2011"}, {"Title": "A tiny little deal breaker.....", "Author": "ojh333 \"ojh333\"", "ReviewID": "R1PB1820LTNHY8", "Overall": "3.0", "Content": "Let me just say, that at first, I thought this was a fantastic little camera.  The picture quality was outstanding, loved the ease of use and menu systems, however, my awe ended abruptly when I downloaded my first batch of photos.UGH!  For a camera as fantastic as this, Nikon has neglected to add a simple auto-rotate feature.  This means you will have to manually rotate any and all photos you take in portrait position.  The software disk included with the camera has an import program which allows you to do a batch rotate, but you will still have to manually sort and click every single photo you want to rotate.  It's shameful that Nikon can't put this basic feature on such a nice camera.  For me, it was a deal breaker.  I don't care how nice the camera was, if I have to manually mess with every single photo I take, it's not worth it.  I returned it.In addition, and in case you care.....Nikon customer support is not very friendly, helpful or even useful.  They did respond quickly, but I received different answers each of the three times I asked about the exact auto-rotate feature.  The camera was also a little on the bulky side and felt a bit.....cheap......when held in the hand.", "Date": "September 7, 2011"}, {"Title": "not impressed", "Author": "Karen D", "ReviewID": "R1APY93PV337TL", "Overall": "2.0", "Content": "I have a Nikon DSL and was looking for something pockesized when carrying a larger camera is not practical.  I was dissapointed in P300 I snapped a few pics around the house, mostly stills and had a difficult time getting anything in focus...my iPhone takes better pics!  end result, returned the P300...", "Date": "October 19, 2011"}, {"Title": "user friendly doubtful", "Author": "marv T", "ReviewID": "RC7K9KFS4FJXC", "Overall": "1.0", "Content": "I anticipated this xmas gift for several months, finally I had it and was very happy to get started on sending photos to relatives and friends. I read all the quick start instruction and the full manual several times to avoid any problems.But upon starting my new hobby, confusion reared its ugly head and remove that gleeful smile off my face.  Out of many attempts I was only able to email 1 photo attachment (by acident), many dissapeared into thin air.The nikon p300 software is very user unfriendly, it leaves you hanging in mid air with no help whatsoever. If this had not been a gift from a family member I definitely would have return it as soon as possible.Beware of the complicated software. I'll just wait and buy a basic model on sale without the bells and whistles, then smile againNikon COOLPIX P300 12.2 CMOS Digital Camera with 4.2x f/1.8 NIKKOR Wide-Angle Optical Zoom Lens and Full HD 1080p Video (Black)", "Date": "January 5, 2012"}], "ProductInfo": {"Price": "$369.00", "Features": "12.2 -megapixel CMOS sensor for high speed operation and exceptional low-light performance.\n4.2x Wide-Angle Optical Zoom-NIKKOR Glass Lens\n4-way VR Image Stabilization System\nEXPEED C2 with enhanced image quality and processing speed\n3-inch Ultra-High Resolution (921,000-dot) Clear Color Display", "Name": "Nikon COOLPIX P300 12.2 CMOS Digital Camera with 4.2x f/1.8 NIKKOR Wide-Angle Optical Zoom Lens and Full HD 1080p Video (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/414a3AYSyyL._SX300_.jpg", "ProductID": "B004M8SVGG"}}