{"Reviews": [{"Title": "Don't Miss This One!", "Author": "Cybermed Rick", "ReviewID": "R36MMXG4N9RHQZ", "Overall": "5.0", "Content": "Probably the best digital point and shoot camera I've ever owned.  Takes great pics and videos. Not a battery hog either.  You can't miss with this camera!", "Date": "November 26, 2010"}, {"Title": "Worst piece of consumer electronics I have purchased", "Author": "Kennen Haas \"Kennen\"", "ReviewID": "R3JYUYI7HZCVTB", "Overall": "1.0", "Content": "The camera had terrible latency issues.I would throw it in the garbage if I was unable to return it.I turn it on. The screen comes on. I set the date and time.I try to activate the zoom. I seems not to work, about 3-4 seconds later the zooming occurs.I press the button to take a picture... nothing. I press again and, click, picture taken. I try to uses the thumb pad to delete the picture, no response. The screen goes black. At this point the camera is totally non-responsive.I press the power button to turn it off, but the lens stays open for about 10 seconds before it goes off.This is the second Kodak camera I have purchased that has been dysfunctional to the point of being useless.Fool me once... you know the rest.", "Date": "January 23, 2011"}, {"Title": "Perfect/new camera", "Author": "Glendaleguy", "ReviewID": "R3VXZRI8VW5S5W", "Overall": "5.0", "Content": "SThank you very much. Shipped very fast to my residence & well packaged, still in original sealed package with all accessories. Works beautifully.", "Date": "April 1, 2013"}, {"Title": "Great Camers", "Author": "Kathryn Yoachim", "ReviewID": "R3I2UE0HTH5EZB", "Overall": "5.0", "Content": "I had this camera before and used it before for many years with no problem. Then it had been dropped a couple and started having problems with the lens opening. Thats why I got another one. Love it and would recommend it to anyone .Pictures are very nice.", "Date": "December 21, 2012"}, {"Title": "Kodak EASYSHARE C195", "Author": "Boblove3r", "ReviewID": "R35INPYRZ0TMAF", "Overall": "4.0", "Content": "I received this product in just the right time period that was anticipated.  It is as easy to use as most of these point and shoot digital cameras advertise.  You just point and shoot.  You only have two or three things that you need to set and then you take the pictures.  I have only skimmed the surface on the advanced features and don't quite understand their use, but that will be half the fun of learning how to use the camera and become an adequate photographer!", "Date": "November 13, 2012"}, {"Title": "Kodak C195 Camera", "Author": "lmm", "ReviewID": "R1WDNS2MDPHFPX", "Overall": "5.0", "Content": "I love this camera! It's easy to use and it takes great pictures. The only drawback is the \"crop\" option only lets you crop to one size.", "Date": "April 14, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0042U7TYY"}}