{"Reviews": [{"Title": "Love it!", "Author": "E. Nuila \"eK\"", "ReviewID": "R2RPTI2EW5B158", "Overall": "5.0", "Content": "Love it!!! Love it!!!Love it!!!This is a great camara. Great value for what I paid, I nice improvement from the previous model. Love it!", "Date": "December 4, 2012"}, {"Title": "Some Issues and breaks easily", "Author": "Martin \"eBay Powerseller\"", "ReviewID": "RM5MQ5YRBKFZD", "Overall": "2.0", "Content": "I very rarely (if ever) leave a negative slanted review. I felt compelled to do so after purchashing this camera in order to warn other buyers.This isnt an awful camera but it has its issues. The camera takes great pictures, is small and was relatively inexpensive in a bundle deal.The main problems I had with it were:1- It is very difficult to see the backscreen in the sunlight. This was a comment from everyone I let use the camera taking pictures here at my home.2- I dropped the camera once on a vinyl floor and it broke. The retractible lens got jammed wouldnt go in or out and thus the camera became useless. IT appears there are two loops for the lens, the inner one and the outer one. The inner one is tilted slightly will not work properly moving in and out of the outer loop. There is no way to fix the camera (unless you are someoen that does this sort of thing).The best things about this camera are..1- It takes great pictures indoors. It balances lighting very well and people love the way the indoor pics make them look.2- Its small and with its stretch case easily fits in most pockets.Ive had a long history with FUJI and still own (and am now using) the S3000 camera. It is versatile, takes great pics indoors and out since its an older style where you can peek through the eye viewfinder or see through the backscreen so you can see outdoors. Its only a 3 megapixel but has worked reliably and has been dropped numerous times on hard surfaces.", "Date": "June 30, 2011"}, {"Title": "What a piece of junk!", "Author": "JB", "ReviewID": "R1N6IL1LCD7NSS", "Overall": "1.0", "Content": "I purchased this camera at Costco for a Vegas trip. I had taken maybe a total of 6 photos when I dropped the camera on the carpet. With most any other electronic device I have ever owned this would have caused northing or a ding. On this camera however the entire lens came off! It's not sturdy and I certainly wouldn't suggest buying it. What a piece of junk. I had to use a disposable camera for my whole Vegas trip!", "Date": "July 21, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "14 million effective pixels; 1/2.3 inch CCD sensor; 5x optical zoom lens plus approx. 6.7x digital zoom\n2.7 inch color TFT LCD monitor; HD movie 720p with sound\n6 scene SR AUTO recognition; Motion Panorama mode with auto stitch\nDigital image stabilization; Face and Blink Detection; Smile and Shoot mode; Auto red-eye removal; Tracking auto focus\nUSB 2.0 High-speed; Video output NTSC / PAL selectable; SD/SDHC memory card slot (card NOT included)", "Name": "Fujifilm FinePix JX300 Silver 14MP Digital Camera with 5x Optical Zoom and 2.7-Inch LCD", "ImgURL": "http://ecx.images-amazon.com/images/I/51avFo9C%2BuL._SY300_.jpg", "ProductID": "B004SBM3YI"}}