{"Reviews": [{"Title": "Midland Video Cam", "Author": "Doctor Moto \"DRM\"", "ReviewID": "R34B19RV98NU75", "Overall": "3.0", "Content": "Pros: Inexpensive, easy to use. Has just an OFF/ON switch, and not much else. Charges via USB cable or 110V adapter. Movies can be easily viewed or edited on laptop or desktop computer.Cons: Cheap construction. Microphone cannot be turned off. Only suggested solution is to stick a piece of tape over the hole. Manual is very succinct and lacks detail. No viewfinder, and aiming is by trial and error, mostly the latter. Has single focus wide angle lens, which gives a fish-eye view of the world. Accessories provided are of limited utility and a puzzle to use. Camera is not waterproof.In summary: You get what you pay for. OK for a beginner, but if you plan to do serious filming you'd better invest a little more in a quality product.", "Date": "June 9, 2012"}, {"Title": "Good HD camcorder!", "Author": "ferdz", "ReviewID": "RNFIKI571C5KX", "Overall": "5.0", "Content": "After purchasing the xtc100 and was happy with it, I needed to get the HD version (xtc200vp3).  Both are great cams for its price.", "Date": "December 6, 2012"}, {"Title": "Very small and portable", "Author": "FABIAN", "ReviewID": "R1ONY4819XUKIG", "Overall": "4.0", "Content": "Thats sports cam seems like a toy, but its real!! The wide angle is perfetc for first person shoots in open places. Good when there are a sunny day. No recomended for nigth recorders....", "Date": "November 29, 2012"}, {"Title": "Great for the price", "Author": "Darrin Jackson", "ReviewID": "R14TU55BWUWJO3", "Overall": "4.0", "Content": "Quality picture perfect for capturing video at speed( sport bike enthusiast) video was captured at 70 plus flawlessly frat product", "Date": "June 9, 2013"}, {"Title": "excellent", "Author": "spencer", "ReviewID": "R3BO5HMMMZG3IL", "Overall": "5.0", "Content": "it may not be a go pro but for the price you cannot beat the xtc you will not be disappointed!", "Date": "May 17, 2013"}, {"Title": "Happy", "Author": "Albee Sanchez", "ReviewID": "R2LN69VB1AIDG0", "Overall": "5.0", "Content": "It a great cam recorder if you buy the case with it it's great for paintballing buts even without it very good beginner cam", "Date": "May 5, 2013"}, {"Title": "Inexpensive fun", "Author": "denster", "ReviewID": "R3FOAPM9TA62PS", "Overall": "5.0", "Content": "Works much better than should be expected for the price. For the novice this is all you need. Very nice.", "Date": "April 29, 2013"}, {"Title": "My First Camera", "Author": "Megan", "ReviewID": "R3V3LWWTTOXLGE", "Overall": "4.0", "Content": "This camera is very small, which is very convenient for portability. The only thing that turns me off is the image quality when in low lighting. The visual gets a grainy effect if you aren't in a well lit room. It's very simple to use for those who aren't tech savvy. I do highly recommend that you buy a class 4 mini SD card. The lower the class, the lower the image quality.", "Date": "December 19, 2013"}, {"Title": "Midland XTC-200VP3 720p High Definition", "Author": "DAVIDE", "ReviewID": "R3AFEWA87ORMSH", "Overall": "5.0", "Content": "Midland XTC-200VP3 720p High Definition Wearable Action Cameraperfect has a lot of accesories and work realy goodthe shipment was fast and the package perfectreally good", "Date": "February 25, 2013"}, {"Title": "great little cam", "Author": "paul", "ReviewID": "R1CT1KIWAEHJCU", "Overall": "5.0", "Content": "film my track days at barber motorsports with this bad boy.  solid stable pic and small footprint.  Check out pbsch on you tube to see my footage", "Date": "February 9, 2013"}, {"Title": "I returned this for a refund.", "Author": "Rickochet", "ReviewID": "R12H4LIN5OY3ET", "Overall": "2.0", "Content": "I found that this camera had many short comings that I was not happy with.  The camera did not stay recording and would shut down after a few minutes of run time.  The battery was fully charged  but still would shut down.  The picture that was recorded was very grainy and below par for a 720p.  I have a friend who has a GoPro 720p  that is very clear.  The download to the computer also took a very long time, even for the short bursts of recording the camera was able to obtain. I would suggest that if you are looking for reliability and clarity, spend a little more and purchase another brand of cam. Sorry Midland... you make awesome weather alert radios, but not so good on the cameras.", "Date": "October 6, 2011"}], "ProductInfo": {"Price": "$169.99", "Features": "Hands-free, fumble-free, wearable video camera\n720p high definition with 140 degree viewing angle and 16:9 aspect ratio\nIncludes goggle mount, handlebar mount, helmet strap mount and universal mount\nEasy to use with single slide operation even with gloves\nEasily share your adventures with plug-n-play software", "Name": "Midland XTC-200VP3 720p High Definition Wearable Action Camera with 4 Types of Mounts Included", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ycu9gQPLL._SY300_.jpg", "ProductID": "B004QMA3WS"}}