{"Reviews": [{"Title": "Not happy", "Author": "David Yazel \"voracious reader\"", "ReviewID": "R1X165RGY4UXRI", "Overall": "2.0", "Content": "I did have high hopes for this camera, even though it is priced so low.  The reviews that could find were pretty good.  First the good:  It is a solidly built, attractive camea that fits well in the hand.  The image stablization seems very good.  After going through several cameras destroyed by damage I was looking for something I could take cycling, hiking, etc and have it survive modest drops, rain and sand.  It might be that this camera will handle the elements well, but I was so unhappy with the quality of the pictures and the camera's performance that I wil be returning it today.The first big negative is that it takes 4-5 seconds to start up.  Given that the most recent coolpix cameras are basically instant on their startup I really don't see an excuse for this.  Second, the auto focus is extremly slow, often 2+ seconds.  And finally the shutter lag after depressing the button is 2 seconds.  This means from the time I take the camera out of my cycling jersy until I can take a picture is 9 seconds.  That is a long, long time.Secondly, this camera is pretty much the worst I have seen in low light conditions. And I use \"low light\" loosely since basically anything other than full sunlight is a problem. Anything inside, even with full lighting, will be blurred.  The other thing is that inside pictures make very \"orange\" looking pictures unless the flash is used.The description of the camera tauts its ability to take \"sports\" pictures and to \"hold\" focus on moving objects.  I just can't agree with this at all.  I tried a whole variety of pictures of moving objects including running children, cyclists and slow moving cars and it just blurs.  I wish I could upload some pictures taken with the camera to show what I am talking about.While I didn't have high expectations of their \"continuous\" shooting mode, it is basically worthless at a picture every 4-5 seconds even with a class 10 memory card.  Looks like I am going to have to investigate more expensive options.The movie capture ability was actually pretty decent although I do see a lot of artifacts in the encoding when I play it back.  But the capture is very smooth.", "Date": "April 6, 2011"}, {"Title": "Picture Quality is Poor", "Author": "B. Anderson", "ReviewID": "R35LZ20YNL1WUN", "Overall": "2.0", "Content": "I have used this for about 500 pictures in different settings and I have to say, the picture quality is poor.  There is a complete lack in depth of focus.  I took a team picture, two rows of athletes, and all of the faces except the two kids in the middle were blurry.When taking video there is an inherent vibration that makes watching anything more than 10 seconds, sickening.  This includes videos taken using a tripod.", "Date": "April 2, 2011"}, {"Title": "great underwater camera!", "Author": "radish", "ReviewID": "R2RHT3YMQ1RLRP", "Overall": "4.0", "Content": "I love this camera for underwater pictures, they turned out great! The only cons, and reason for 4 out of 5 stars is, you cant see the pictures on the display screen in the sunlight(we waited till we put it on the laptop) and I could not take a decent picture indoors. I just didnt have time to play with the camera before we travelled. I am sure there is a way to make the camera take great pictures indoors or in our case, in underground caves.", "Date": "April 18, 2011"}, {"Title": "One of the best cameras in this category!", "Author": "A. Antonio \"CMDTA\"", "ReviewID": "R4U3TASVLXKUX", "Overall": "4.0", "Content": "I want to start by saying that a lot of the reviews for this camera really surprise me.  You buy a camera that is designed to be abused and then complain that it doesn't have the best picture quality?Nikon, Panasonic, and others make a camera very similar to the Fuju XP30.  The major difference is the XP30 cost about a third of the other makers.This camera feels like it should be fragile but you really can drop it, drown it, and use it in some extreme conditions.  The picture quality is outdoor daytime lighting is very good. The optical zoom in a camera like this is a nice feature that comes in handy. The GPS doesn't only work well it's amazing that this camera even has one.  I challenge you to find any other camera with built in (real)GPS for under $130.  They just don't exist.The low light quality is not good but I wouldn't expect to take decent photos in low light with a $130 point and shoot camera.The one place that this camera does suffer is it's battery life.  This thing will chew right through it's charge in less than a day.  The best thing you can do is buy a second battery if you are going on vacation and plan to be taking a lot of photos.  If you are only going to  be using it for four or five hours of shooting between charges you shouldn't need a second battery.Overall you are going to have a hard time beating this camera.  Waterproof, dust proof, drop resistant, cold resistant, and GEO tagging for under $130. I've seen a lot of $130 point and shoot cameras that don't even include a battery.", "Date": "April 26, 2012"}, {"Title": "a huge dissapointment", "Author": "outwash", "ReviewID": "R2IIIBOBF9B9IE", "Overall": "1.0", "Content": "I bought this camera becasue it was the cheapest ruggedized GPS camera on the market.  I needed to georectify pictures for my job - but they did not have to exact - just within 100-200 feet.First the pros -1) takes pretty good pictures for a ruggedized camera.2) it seems like it will be very ruggedized.3) It creates a file that can be added to ARCGIS and and then linked to the photos.  It took me awhile to figure out how to do this (tech support was not help at all) but it can be done.Now the cons: -1) the GPS is awful - I've been using GPS since 1992 and I have never come into contact with anything near this bad.  some of my points were two miles off.  I don't know how they found a GPS this bad - they must have looked really hard.  The idea that you could use the camera to navigate back to a photo (as they advertise) is a joke.  I didnot expect 1 meter at this price but I thought at least the pictures would be within a 200 feet of so.2) sometimes it takes 10 minutes or more to lock in on a point - and this in Colorado grasslands - not the amazon rainforest3) the battery is awful - if you use the GPS as all the battery will drain after about 30 minutes of use.  Even if you set the camera to only use GPS when the camera is on, it appears to have a defect where it keeps the GPS running all the time.If it was just a ruggedized camera I would give it 3 or 4 star, but because the GPS was such incredibly false advertising I am giving it a 1 star.", "Date": "April 24, 2011"}, {"Title": "Great for Surfing", "Author": "Sickpup94", "ReviewID": "R22QLEQJ2SJX07", "Overall": "4.0", "Content": "I took this camera to the beach, more specifically, surfing. It did a great job of catching my friends riding waves and wiping out. Easy to operate the functions even through my 3mm surfing gloves.I love the one touch video function. You can zoom in & out while in video mode. It also allows for \"scene' modes. I didn't really need those on this trek so I kept everything on \"Auto\". The pics and vids came out really good.I couldn't find the max zoom on it (digital), but I was in the ocean, so I wasn't going to screw around with settings too much.Very durable display screen. I kept it tucked in my wetsuit and it didn't get a single scratch. I highly recommend the Olympus Float Strap for around $13 so you don't end up camera-less with it acting as a new fish home at the bottom of the ocean floor. Get a bright color so you don't lose it in all the white water.Overall, it's a good waterproof camera.", "Date": "February 27, 2012"}, {"Title": "Decent Camera, But Water Got In", "Author": "R. Toro \"Tech Junkie\"", "ReviewID": "R2LJXJ981FLSTC", "Overall": "3.0", "Content": "I purchased this camera for a recent cruise to the Caribbean. I wanted something I could use to take pictures at the beach and while snorkeling - and not have to worry about it getting wet or sandy. In that sense, it was a pretty good camera. The quality of pictures it takes is not great, but it is pretty good (though at 14 Megapixels you would expect it to take good photos). However, after a week of use, water got into my camera.It is important to note that the battery door has a double-clicking lock mechanism, which is an improvement over the previous version of this camera. The new lock mechanism displays a visual indication of whether or not the battery door has been closed and sealed properly. This is important because if the door is not closed all the way, then water gets in. With that said, I made sure that the door was always closed properly, but I still got water in the camera, eventually ruining the unit.Knowing that I would be snorkeling, I was very happy to see that the description of this camera states that it is waterproof up to 5 meters (16.5 feet). Most of the other waterproof cameras were only waterproof to 3 meters (about 10 feet), so I was hopeful that this camera would work well for snorkeling, as I often hover around the 10 ft. deep mark while snorkeling.  I may have gone too deep with it, but I would be surprised if I actually made it down to 16 feet, as I tend to have a difficult time diving down that deep while snorkeling, but regardless, the camera got water in it in less than a week of use.So just a warning, if you use this camera in the water, try to avoid diving down too deep (I would definitely stay above 10 feet), in order to prolong the life of your camera.Camera Function:I was not pleased with the actual function of the camera and the layout of the menus and buttons.  This may be due to the fact that I am used to using Kodak cameras and not Fuji Film cameras, so if you have used a Fuji Film camera in the past, this may not apply to you. But I found it difficult to quickly change between shooting modes (i.e. underwater mode, to beach mode, to panorama, to close up, to back-light mode, etc). With other cameras I have used, all it takes is a twist of a dial or pressing one button to pull up a screen of all available modes, but with this camera, you have to go to settings and scroll through the options (I found it cumbersome).The only good thing about the buttons that I really liked was the REC button for videos. With one button press you could quickly switch to video mode and begin recording - that is definitely a plus if you are in situations were you might want to quickly record something (although I think most newer cameras now have this feature).In summary, the picture quality was acceptable, the battery life was good (I could go the whole day on one charge while on vacation), the underwater photos and videos came out well, BUT the menu functions were not very user friendly and most importantly, the \"waterproof\" camera got water in it - therefore it failed to meet my needs. If you were to use this camera strictly on the surface of the water, or at the very least, not take it too deep, then this may fulfill your needs. However, for a snorkeler, this camera will probably not last very long.", "Date": "February 21, 2012"}, {"Title": "Amazing camera for the active.", "Author": "JLJanda", "ReviewID": "RHY8YD10MGJCQ", "Overall": "5.0", "Content": "I purchased the XP30 to replace the last model after I ended up breaking it. The FinePix XP series is a fantastic camera. For the price range of the camera, this one feels superior. The buttoms and shell of the cameral feel very solid. It takes amazing underwater pictures and I never have to worry about water damage! The zoom function is great for a point and shoot style camera. All the menus and features are very intuitive and the battery life is respectable in real life usage... I haven't had to worry about missing anything due to battery life. The only con that I have noticed with the new XP30 model is that occasionally I get \"fuzzy\" pictures. The older versions couldn't take a bad photo, and this can be frustrating. Overall, I think the Fujifilm FinePix XP30 makes for a great deal and do recommend it to family and friends.", "Date": "February 13, 2012"}, {"Title": "Not for Water!", "Author": "Heidi", "ReviewID": "R3SSLYX4FQOGSD", "Overall": "1.0", "Content": "First time taking this camera out was great. Worked out to expectations and took decent pictures and videos first time underwater. The second time was the same. Third time, not a charm! Water leaked in and ruined the camera. Made sure to follow the manual's instructions for care prior to and after use. Not happy with this purchase and not sure I want to buy another Fugi! Giving a one star rating for dissapointment.", "Date": "June 11, 2012"}, {"Title": "fuji xp30", "Author": "Marcelo Arruda", "ReviewID": "R32V29B8I2L9TC", "Overall": "4.0", "Content": "I already know and Fuji products are of good quality.This camera is very easy to use and many other advantages such as being water proof and fall.Within the water makes great pictures.But remember, it's a machine and has no amateur photos like proficional camera.Very good product.", "Date": "March 14, 2012"}, {"Title": "LOVE LOVE LOVE", "Author": "DW", "ReviewID": "R3MAV0HXPXXAAE", "Overall": "5.0", "Content": "A friend had received this as a gift, while we were vacationing together I was able to try it out.  It was love at first try! I ordered before we got home! Pictures were great, the under water photos are fantastic!  Took movies while diving in Hawaii, could see every detail!! Had just as much fun in the pool with the kids. Everyone wanted their picture underwater! Could not be happier for the price!", "Date": "July 18, 2011"}, {"Title": "gps slow", "Author": "Mr.Ed", "ReviewID": "R1J93B0KEUM6JN", "Overall": "4.0", "Content": "I got this camera in March one of the first to get it. Then went on a cruise to central america the GPS takes about 2 minutes to get a fix on the top of the ship, went into the mountains of Costa Rica could not get a fix plain sight of sky large clearing no fix. Went swimming with it \"I'm brave \" it takes wonderful pictures underwater skin diving to about 10 feet under, going thought the panama canal the GPS fix gave the name of a local town,  in the San Blas islands the gps says mexico I would have like the lat-long not mexico but I'm not that picky. The camera takes great pictures in Lima,Peru I took a 15 minute video which came out crystal clear. This is a great camera but the GPS is really slow.  Ed", "Date": "June 6, 2011"}, {"Title": "Very Good Camera", "Author": "Charles E. O. Connor \"Chuck\"", "ReviewID": "R3I58I7THZZLXM", "Overall": "4.0", "Content": "I looked at some of the other reviews and was wondering if they got the same camera.First, things first-I haven't tried it in water yetSecond--Camera is not what you expect when looking at something as a Canon Powershot but what i noticed is when you install the fuji software and upload and print pictures they are in high def w/fine pixels.  It doesn't show the picture like you want when you initially take it but put it on the computer and print it our and it will look amazing.  The GPS feature is useful and I do not really care for a facebook tagger on there.  Thats what these new camera phones are for.Camera has lot of options and if it fits your budget buy it.  Most importantly if your too lazy to write down or remember where you took your picture then this is the camera for you.  You should pay for the technology not the convienence added in. the world is getting lazy enough with all these high tech gadgets.  The camera is worth it and will last you a few years.", "Date": "August 8, 2011"}, {"Title": "worst waterproof camera ever", "Author": "sedcunha", "ReviewID": "RE58RVJSOU6C6", "Overall": "1.0", "Content": "First time under water, two of the buttons broke. Second time under water, the camera broke completely. And I don't mean scuba diving - This was in about 1-2 feet of water. So disappointed, because the last version was much better.", "Date": "June 9, 2013"}, {"Title": "lag time make you lose the shot", "Author": "amh \":)\"", "ReviewID": "R3ARNJ6U8NBRTM", "Overall": "1.0", "Content": "My boyfriend and I were looking for a new camera that would hold up against the elements and 2 children under 3 years old. I do have to admit that I have dropped it and all is well.The problem, however, is the response time of the shutter. I don't think I am a picky person but when you are trying to shoot pictures of little ones, they don't really wait for the camera to actually take the  picture. I usually get a crazy face or the back of a head rather than the shot I was looking for. Another problem I have is the lighting has to be as if the sun was on my shoulder at all times. The flash feature is ok but if it is on, it stays on. This also drains the battery very fast. The video option works only if there is a lot of light as well. If it is at night and you are using a lamp or \"indoor\" lighting, your video will look grainy and orange/red in color with difficulty seeing the video it's self. I wish I would have gotten the other camera I was looking at that was less expensive. Don't get me wrong, the under water photos are a cool idea but I think that the disposable cameras that are used for underwater photo capture work just as well. I would not recommend this camera unless you don't mind losing the shot you were working for. If you didn't plan on taking pictures and just want something you can fling around,then this is the one for you. All of that said, if the camera actually took good pictures and took them when the button was pushed, I think it would be a great camera. Unfortunately, mine does not.", "Date": "September 26, 2012"}, {"Title": "Don't do it", "Author": "sbadgio", "ReviewID": "R1PK2BPVDSQJDN", "Overall": "1.0", "Content": "I read the reviews on this camera prior to purchasing it, but I didn't want to spend a ton of money.  I took this camera on a two-week sailing trip to the Bahamas.  I read the instructions carefully to make sure that I was doing everything correctly (I didn't want any issues due to operator error).  It worked fine -- above water.  When I finally had an opportunity to go snorkeling, I was very excited to see how this camera would perform.  It did fairly well...for about 45 minutes.  Then the display stopped working.  I learned afterward that the camera would still continue to take photos, you just couldn't tell what the subject was.When I got back on the boat, I carefully rinsed the camera in fresh water, as instructed.  After it had time to thoroughly dry, I opened it and noticed a small amount of moisture inside the battery compartment and cable connector compartment.  I left those two doors open for the rest of the day, and gradually the display began to work again.I successfully used the camera again -- above water.  Two days later, when I took it snorkeling for the second time, the display screen filled with water.  Thorougly disgusted, I brought the camera home and returned it.  Before my next trip, I will buy a better camera.  And this time, I will REALLY pay close attention to the reviews.  I took a chance and lost.", "Date": "June 6, 2012"}, {"Title": "Rugud but poor battery", "Author": "Brice", "ReviewID": "R3UBD377LRP42P", "Overall": "3.0", "Content": "I liked that camera, it held up to sand, fresh and salt water, and bouncing around.  The main problem I have with this camera is the battery.  GPS drains the battery like no other meaning that if you are going to use one battery for a week of backpacking dont turn on the GPS.  Furthermore it seems that you have to turn off the GPS completely instead of putting the camera on the GPS only when on option to stop the technology from draining your camera. I've gone asleep a few nights with a full battery only to wake to a dead battery the next morning.If you want a rugud camera, this works great.  If you want to use the GPS I would recommend buying a second battery so that you can still take non geo-tagged photos after the GPS drains your first one.", "Date": "April 9, 2011"}, {"Title": "Good camera but not worth extra $100 for GPS", "Author": "HSG \"THXFORTHETIP!\"", "ReviewID": "R2OE0UNNBODVBI", "Overall": "3.0", "Content": "Brought this camera for an upcoming Disney cruise & manatee snorkling trip in crystal river florida.  Excited about the GPS feature but agree with other reviewers  that it does drain the battery.  THe pictures are flat and do not compare to my \"old\" (4 years!) canon powershot is850 8mp.  If you are looking at this and the xp without the gps feature get the one without for a cheaper version of this camera.  My mac has a feature to add location by map pinpoint anyway....will add pics after our trip...", "Date": "April 12, 2011"}, {"Title": "Not improved over the XP10", "Author": "SAvery", "ReviewID": "RUPVQU3KVUVHG", "Overall": "2.0", "Content": "I've basically unpacked the camera and done about 10 shots inside but so far it's a disappointment.  Indoors in relatively low light (CFL) the XP30 performs significantly worse than the XP10, the previous model.  In full (SR Auto) mode, it appears to be selecting a very poor mode for the light conditions and the picture has an orange hue.  By selecting a specific mode (Party, which is for shooting indoors) it improves things significantly but the photo is still less crisp than the XP10 running in full Auto (SR-Auto) mode.More after doing some outdoor, Underwater, and GPS performance.I did some outdoor shooting but again was really disappointed.  Unless you have the specific mode selected and you are in very bright light conditions, the quality is just not as good as the xp10.  If you are looking for a budget camera, find an XP10 on a clearance deal.  If you are looing for a good rugged camera, the Panasonic Lumix DMC-TS3 12.1 MP Rugged/Waterproof Digital Camera with 4.6x Wide Angle Optical Image Stabilized Zoom and 2.7-Inch LCD (Orange) is much better.", "Date": "April 13, 2011"}, {"Title": "Fujifilm FinePix XP30", "Author": "Geoffroy P. Hilaire", "ReviewID": "R37X4Y6NB06KME", "Overall": "5.0", "Content": "This camera is full of great features! The GPS tagging, (5x for the XP30 compared with the usual 3x of others in this price range) optical zoom, and panorama option are what sold me on this model. The 14mp gives great detail for a reasonable amount of money. I highly recommend this camera for its price range", "Date": "March 11, 2012"}, {"Title": "actually takes better video than my dedicated video camera", "Author": "Cudgel", "ReviewID": "R2PWZH9WVB6F2U", "Overall": "4.0", "Content": "There may be better cameras in this price range, but this one works very well. It actually takes better video than my dedicated video camera that had cost more than this. And yes, it does work underwater. Great one for travel snapshots. I take off a star because it needs to be less expensive, i.e. 100 bucks.", "Date": "November 23, 2013"}, {"Title": "Good camera", "Author": "Thomas A. Wood \"WV student\"", "ReviewID": "R21RAFNLR1ATX5", "Overall": "5.0", "Content": "I do a lot of fishing, hiking, hunting, and canoeing.  I have had this camera for a couple of years now.  It has taken a beating, it has been in sand, mud, and water many times.  The fact that there are no external moving parts is very nice.  It has been dropped many times with no problems.  I would recommend buying extra batteries with it.  The picture quality is good but not great.  It can take great pictures when lighting is good, but during low light it struggles. The GPS is good in very open areas, but when there is anything over top of it, even when other GPSs will work, it does not.", "Date": "August 27, 2013"}, {"Title": "shutter button", "Author": "Gabriel", "ReviewID": "R11OHJFZLPKO60", "Overall": "2.0", "Content": "the shutter button doesnt work properly after a few splash on the ocean. I properly use it but anyway it is not working properly", "Date": "July 28, 2013"}, {"Title": "Family friendly.", "Author": "J.Marie", "ReviewID": "R10NFWOEZ5G78T", "Overall": "5.0", "Content": "This camera is the perfect product to take on vacations or outings with the family. You don't have to worry about it getting wet, which is a plus It is very easy to operate. We purchased A tripod so That We could take group photos on our own. We liked it so much that we bought the new version because it has a feature where you can select the photo to be black and white but choose one specific color to still show. If you're willing to put out a little more money, the newer version may be better. However, if you will not use the color selecting feature, you might as well purchase this one and save the money Over all, very good camera!", "Date": "July 3, 2013"}, {"Title": "Too bad I don't live underwater", "Author": "GB", "ReviewID": "R5HHPIHD3SIML", "Overall": "2.0", "Content": "I bought this for the beach to take fun underwater pics, but thought I could use it for every day life too. I know my way around SLRs, point-and-clicks, cell phone cams etc., and I've never used a camera with more trouble focusing. Very slow menu response, and cheap feel. GPS option is annoying, rather than cool. Unless you own pool (or live at a water park?), I don't see why you'd want to buy this.", "Date": "June 7, 2013"}, {"Title": "EN ZONAS OSCURAS MALA LA IMAGEN", "Author": "roberto andres gonzalez gutierrez", "ReviewID": "R13RXGCD3QXXKS", "Overall": "2.0", "Content": "ES UNA CAMARA RECONTRUIDA Y ELLOS NO SEÑALAN ESO EN LA DESCRIPCION. VENIA CON MARCAS DE GOTAS SECAS DENTRO DE LA PANTALLA. Y NI SIQUIERA LA HABIAMOS USADO.", "Date": "March 29, 2013"}, {"Title": "EXCELLENT PRODUCT IS A VERY GOOD QUALITY", "Author": "Lol", "ReviewID": "R3VOYOIQSKK5I3", "Overall": "5.0", "Content": "EXCELLENT PRODUCT IS A VERY GOOD QUALITY AND A VERY GOOD CARE WARRANTY AND SERVICE WITH A VERY GOOD PART OF THE STORE. THANKS FOR YOUR GOOD CUSTOMER.", "Date": "March 21, 2013"}, {"Title": "Just Yes", "Author": "ritz", "ReviewID": "R2AK4VKVLV7UQ8", "Overall": "4.0", "Content": "This camera has been everywhere with me. Easy to use. Takes great pictures as far as point-and-shoot cameras go. Love the Geo-Tagging feature. I've taken this snorkeling in several countries and it is fine underwater as well. Sand hasn't been a problem either (just rinse it off). I also like that this camera is a bit more rugged than many small cameras, I would not suggest throwing it at a wall or anything, but my camera has put up with a few tumbles like a trooper. I would recommend this for anyone that travels or has kids and wants a simple camera.", "Date": "February 20, 2013"}, {"Title": "....", "Author": "Kristen Marie Morgan \"Krissy Morgan\"", "ReviewID": "R18FPGTRC1HG9P", "Overall": "3.0", "Content": "Its picky!! I live in Hawaii. So I take it into the water. I have to take a bunch of pictures in hopes that at least 1 was not blurry. You cannot see the screen underwater even if you are wearing goggles. So here's hoping you got the shot!!", "Date": "December 28, 2012"}, {"Title": "Say Cheese", "Author": "Stephanie", "ReviewID": "R1N3TUUW0GOKBM", "Overall": "5.0", "Content": "Bought it as a gift for my Best Friend. It works under water, down water slides, etc. GREAT CAMERA! Takes good pictures", "Date": "December 7, 2012"}, {"Title": "Good While It Lasted", "Author": "tko", "ReviewID": "RYW6GWAS7ODQ7", "Overall": "3.0", "Content": "My bf bought this camera for me for my bday, loved it because it could go underwater and take videos also. Lady at the store advised strongly to rinse the camera under fresh water after exposure to salt water, saying it would rust or corrode the pieces. I had the camera for over a year, took it to the beach with me and camping, was very sturdy. Always make sure the latch to the battery chamber is locked, if there is yellow showing, that means it's still open! Takes lousy pictures indoors, so if you want to capture those memories, must put on flash. Underwater features were nice, but you have to test out all the scene selections to figure out which does best. The day it broke, I took it out to the beach with me, (latch was definitely closed, mind you, I double check every time) and after the third picture I took, screen turned purple. I hurriedly brought it to shore and dried it off and opened the hatch, a drop of water had seeped in and had gone in where the battery was. Dried off battery and sd card and left it for a day, then reinserted the battery and sd card. Worked fine for a while, then the screen kept freezing and wouldn't unfreeze til you removed the battery. Camera is totally ruined, screen doesn't function, so you can't view any of pictures, or use it to take any anyway. Camera latch has a little bit of corrosion on it when I inspected it, so that might have been what caused the water to leak through. All in all, if it doesn't come on sale for lower than $150 bucks, don't buy it. Get a gopro.", "Date": "August 6, 2012"}, {"Title": "Awesome camera!!", "Author": "JessicaFord", "ReviewID": "R1MD29Q2LUV7EC", "Overall": "5.0", "Content": "This camera is awesome I don't know what ppl are talking about with the problems there having as long as its on the right setting for what kind of pic your taking it working amazing!! Clear sharp pics grwat color and awesome under water pics as well no complaints what so ever.", "Date": "July 20, 2012"}, {"Title": "great product, thanks", "Author": "Doris Linares \"darwin\"", "ReviewID": "R1OM255NRUDY0V", "Overall": "5.0", "Content": "thanks, very good. this a great product, my friend had one, and i want this camera, because is great in water, at the beach or river you can get a lot of fun.", "Date": "June 20, 2012"}, {"Title": "Perfect! Waterproof and great pictures!", "Author": "homesweethome57", "ReviewID": "R2MUFHSYLTY6NG", "Overall": "5.0", "Content": "Perfect! Waterproof and great pictures!  Cool color and would definitely purchase again!  Also - shockproof which is always great since Im a bit clumsy", "Date": "June 4, 2012"}, {"Title": "Not waterproof", "Author": "tfinn141", "ReviewID": "R1QM6JK8741LBX", "Overall": "1.0", "Content": "Fooled me twice Fuji... not again. I bought this camera prior to going on a kayak trip. The pictures from the kayak, especially in low light, were terrible. But the video worked pretty well. After a month, I used the camera in the water to take pictures of waves crashing. During the second session, water leaked into the battery compartment, destroying the camera. I thought it was my fault, and, since it was cheap and took decent video, I bought another. The second time, I used it twice to take pictures of my gf learning to surf. In tiny waves, with little to no jostling, the camera completely filled up with water, ruining my memory card. Complete waste of money.", "Date": "June 3, 2012"}, {"Title": "Almost waterproof", "Author": "John D", "ReviewID": "R2WF5GAW45NZBH", "Overall": "1.0", "Content": "I bought this camera to use mainly on fishing trips.  The viewfinder screen on the back is nearly impossible to discern on even a cloudy day, making it very clumsy to ask another person to take your picture.  Picture quality underwater is barely acceptable - barely means you can sorta determine the subject in greenish-gray lack-of-color, unless you're very close in gin-clear water.  The proprietary battery is another, expensive, unnecessary hassle; AA or AAA batteries are standard for virtually all other digital cameras.  I lost the camera to water intrusion via the button area on top after 18 months of sporadic use.  I discovered there is no \"o\" ring-type sealer there, just a tight fit and \"good-luck, sucker\".  When the camera gasped it's death rattles, I was on a long-awaited tarpon fishing trip to the Florida Keys.  Timing is everything, but I won't be the proud owner of another Fuji product.  The camera had too many cheesy short comings to believe that, in the future, Fuji can produce a camera worthy of my scarce money.", "Date": "May 16, 2012"}, {"Title": "Warning!  DO NOT BUY THIS CAMERA", "Author": "Kimo Kahili", "ReviewID": "R1L5AHWHZ9GHHO", "Overall": "1.0", "Content": "I bought this camera after my Olympus \"waterproof\" camera failed following my fifth use under water.  On sale, so why not give it a try, and even bought an extended warranty?  My caution to only use the camera top-water snorkeling after the Olympus experience extended to a break-in, above water time so that I could get used to the camera.  That period was about nine months (no water exposure).  Finally a dream trip to French Polynesia gave me the perfect time to finally test out the camera under water.  First time, no problem.  Since it was in salt water, and according to the owners manual, I soaked the camera in fresh water.  Next day, prepared for more great shooting, I again took the camera snorkeling.  Yes it dangled from my floating wrist strap, but no more than two feet.  First picture, the screen went white and the camera died.  I called Fuji upon my return.  Their reply was, \"You do know that you need to have all seals replaced after one year or the warranty is void.\"  No, I didn't know and replied after learning the price of a seals replacement, \"You mean to say that every year the camera will cost me an additional $50 for seals and cleaning + shipping costs?\" \"Yes, and because I did not have it cleaned and seals replaced, even though the camera failed the second time in the water, that voided both warranties.\"  Fuji suggested I read the manual more carefully next time.  There won't be a next time for Fuji!", "Date": "May 4, 2012"}, {"Title": "Terrible, terrible, TERRIBLE.", "Author": "K_Turner217", "ReviewID": "R2QB2HIX7QSK8V", "Overall": "1.0", "Content": "I had very high expectations for this camera, I was beyond excited to have a waterproof digital camera and not a disposable. I went to Fort Lauderdale, Florida with a friend, her and I LOVE taking pictures of everything an anything. When we first got there we stayed a friends house I used it in their swimming pool worked great, picture quality was decent. Rinsed the camera off and soaked it. Then we went to our hotel, I used it in the ocean for a few hours, again, worked great, picture quality was good. Again went back up to the room and rinsed the camera and soaked it. The next day we went on a snorkel trip, we were required to wear life vests which I thought was idiotic but anyways..I got my flippers and goggles on, and hopped on into the water. Not even 10 minutes later the camera started making this very high pitched noise and then it shut off, refused to turn back on. As i said before we were required to wear life vests so I wasn't able to go more than 5 feet deep before being yanked back up to the top. Got back to the hotel rinsed it off, soaked it, waited for it to dry. I opened it up and low and behold there were signs of rust I hurried up and took my memory card  out I was afraid it was ruined (thank goodness it wasn't). I'm so happy I bought this camera right before I left for my trip as I was able to return it to the store. Horrible waste of money, next time I won't buy a cheap camera with such high expectations.", "Date": "December 6, 2011"}, {"Title": "Overpriced POS with Horrible FUJI Customer Service", "Author": "SoCalHeather", "ReviewID": "R1JNL1ZZVSC6TL", "Overall": "1.0", "Content": "My daughter wanted a new camera for Christmas since her Sony Cybershot took a dump after one year of use. I researched cameras and thought this one, in the $150-$200 offered a lot of the features she'd like - as a teenager. The tagging and easy Facebook uploads were a bonus, being waterproof an even bigger bonus.When she opened it, she was disappointed. She had been looking forward to a Canon or Nikon (if only in hindsight I'd listened). But got used to the waterproof idea and liked the easy upload features. The clasp for the memory card seemed a little loose and occasionally it would snap open. When I called about it, I was told to pay $30 and they'd SEE if it was a defect. Really? After JUST purchasing it less than 90 days ago? We took it to an authorized shop, paid and waited two months before we got it back.In May, she went on a trip to Catalina Island with her 8th grade class. The first day she took it underwater, the clasp snapped open again and flooded the camera. We sent it in per FUJI guidelines AGAIN. This time they said it was user error and would not cover it.So I paid $150 for a camera, $30 for shipping TWO Times ($210 total) and have a broken POS that FUJI refuses to replace. NEVER WILL I BUY FUJI PRODUCTS AGAIN!", "Date": "September 13, 2012"}, {"Title": "Terrible Product, Even worse Customer Service", "Author": "C. Babic \"Life is Fab ..\"", "ReviewID": "RGS3SHB3QY6VH", "Overall": "1.0", "Content": "We purchased the first version of this camera and after using it for the first time underwater.. we quickly discovered how unwaterproof it really was...  the customer service we received was even worse.  After several threats and complaints they replaced that camera with this camera... and we have now discovered that it is NOT shockproof.  The camera stopped working (the zoom no longer works).  When we returned it to get it fixed under warranty, we once again quickly discovered how unhelpful Fuji's customer service is...We would never recommend this product nor will we buy another Fuji product.", "Date": "March 7, 2012"}, {"Title": "Don't buy this camera.", "Author": "S. Masih", "ReviewID": "R19PD7NYGRZ73V", "Overall": "1.0", "Content": "This camera does not take good pictures.  Photos are usually out of focus or very yellowish.  Sometimes I had to take like 5 photos with few different settings in order to have 1 good photo.  Always had to take 2 or 3 in order to get one right.  I have a Konica Minolta Dimage X1 8MP Digital Camera that I bought in 2005 and it still takes better pictures than this Fujifilm.  I have a Minolta Maxxum that is about 15-20 years old and it's the best only drawback is I have to use a 35mm film.  I would not recommend this to anyone.  Fujifilm needs to do some major work on their cameras.  This was my first Fujifil camera and I am never buying another one of their products. I bought this before I went on a vacation and I took about 800 photos and approximately 150 of them were worth looking at.", "Date": "December 7, 2011"}, {"Title": "Do NOT buy this camera for water use", "Author": "DlandJen82", "ReviewID": "R2T17IZGFLNKK4", "Overall": "1.0", "Content": "A few months ago, I purchased a water camera for an upcoming cruise.Needless to say, I am VERY upset with this camera. The quality of the casing is unacceptable and useless for water.I took it in the pool as soon as we boarded the ship. I attached it to my wrist and within 10 minutes, the shoddy \"clip\" that keeps it closed, popped open. The camera filled with water and would not turn on. Later, when it would turn on, it was useless because water was trapped inside the lens.Our ship hadn't even set sail yet! We were forced to purchase another water camera on the cruise for a few hundred dollars because this piece of garbage didn't last 10 minutes in the water.Do NOT buy this camera.", "Date": "October 9, 2011"}, {"Title": "Audio is out-of-sync", "Author": "H. Wang \"jwangamazon\"", "ReviewID": "R2K88JMB86M4M5", "Overall": "2.0", "Content": "I got the Fuji XP20 mainly for taking videos in conditions that my Canon HD camcorder can not. On my first usage in a river rafting event, I already see the problems with this camera:1) I am experienced with Camera and camcorders, I know how to hold them properly. But the lens head is placed in a very awkward place, your fingers will easily cover part of the lens head. So, don't be surprised to see your fingers in the final photos and video clips. It's almost for sure that you will not get photos or videos of yourself. Because other people may not be able to hold this camera properly to take yours.2) Hard to fine tune the zoom speed. Not convenient, but I can live with that.3) The camera won't focus while zooming (it will focus after zooming stops). This is a typical issue with non-DSLR camera in video mode. I saw the same thing in Panasonic camera also. Not a big issue to me.4) This is the biggest flaw, the audio is not in sync with the video. I have to turn off the audio from the video clips, and add background music when producing the final movie for the rafting trip. Even my simple Flip video camera handle this better than this Fuji camera.5) The video quality is no way to compare with regular HD camcorder. The image is kind of grainy, even at 1pm strong sunshine with good light. Again, I can accept this since I am in a condition (around water) where normal camcorder can not be used.6) Indoor photo quality is no way to compare with my 5-year-old 5MP Panasonic camera.But this is OK to me since I am in a condition (around water) where my normal camera can not be used.If this is the only camera you want to have, I won't recommend this. However, if your intend is \"ONLY\" to take photos, videos in conditions where your normal gears can not, then I think this Fuju XP20 is acceptable....if you don't mind the out-of-sync audio problem.", "Date": "July 5, 2011"}, {"Title": "Very poor picture quality", "Author": "D. Comai", "ReviewID": "R1J1Q1L2UAB1GP", "Overall": "1.0", "Content": "You are better off spending the extra money for a better waterproof camera, or to just buy a Canon point and shoot, and keep it out of the water!  I returned this P.O.S. to costco, and bought the Canon ELPH 300 HS.  I'm much much happier with this purchase :)", "Date": "July 18, 2011"}, {"Title": "Submersed to test, and water leaked in", "Author": "MCA", "ReviewID": "R89FHZZGQWQZJ", "Overall": "1.0", "Content": "Played with it for a week until tried taking pics underwater (less than 1,5m deep) and BAD NEWS, water leaked in, LCD stopped working and camera stopped responding. First thing was to check that battery latch was properly closed, and since it can only close once you manually lock it in, yep, not a problem there. So I guess bad luck on a defective item. Anyway, will return it for another product.", "Date": "April 24, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.0 Megapixel\n5X Wide Zoom (28-140Mm)\n2.7\" LCD Screen\n4-Way Protection\nGps Technology With Geo-Tagging\n14-megapixel CCD sensor; 5x wide-angle optical zoom\nRugged design is waterproof, shockproof, freezeproof, and dustproof\nGPS Geo-tagging function; easy Web upload to Facebook and YouTube\nHD video capture; 720p with sound at 30 frames per second with one-touch ease\nCapture images and video to SD/SDHC memory cards (not included)", "Name": "Fujifilm FinePix XP30 14 MP Waterproof Digital Camera with Fujinon 5x Optical Zoom Lens and GPS Geo-Tagging Function (Green)", "ImgURL": "http://ecx.images-amazon.com/images/I/51eTyYLlxNL._SX300_.jpg", "ProductID": "B004HO58N4"}}