{"Reviews": [{"Title": "Horrible Camera-going back today!", "Author": "Jamar", "ReviewID": "R3F1T37F3LBM0M", "Overall": "1.0", "Content": "I picked up this camera today. I did not buy it online I got it at a store. Well let me tell ya, it is going right back where it came from. I take hundreds of pictures a day for one of my jobs. I do not need a fancy camera with all the bells and wistles. I just needed something with zoom, SD card compatible and quick and easy to use. I had a kodak easy share and loved it. Well it just died and I need a cam by monday so I have no time to order online. I wish I had looked around more. Paid $50 for this thing, it was in the budget section so it was in plastic, not on display so i did not get a good look at it. Big mistake! It is like a toy. I had to check the package again cause when I took it out I thought it was fisher price or something! The screen is tiny, it is very cheap plastic case/shell. Not easy to navigate in menu. The pictures are so horrible words can not describe. Grainy, dull, blurry, and they had a red tint. I tried normal, fine, and super fine settings and all were bad. Self portrate mode was a bit better color but still sucked. I am sooo angry now I guess I have to shell out another hundred bucks on another kodak easy share. BTW the pics just as bad on the computer as they did on the screen. Oh how can I forget, the one other feature I needed which was the biggest need was the anti-blurr. Ok this claims to have anti-shake. What a joke, every pic I took was blurry no matter how still i held the camera. And is that not the point, to not have to hold it still? I will be calling the  manufacture a.s.a.pa to tell them how bad this thing is. It is not even worth buying for a little kid. It's so hard to make out what the picture even is it looks like a kid's drawing. I think I could make better pictures with an etch a sketch! You failed hard on this vivitar. Shame on you for putting this on store shelves.", "Date": "August 20, 2011"}, {"Title": "worst camera ever", "Author": "annoyed", "ReviewID": "R172VW9WTVVQWK", "Overall": "1.0", "Content": "Neither i nor any of my friends can take a non-blurry picture with this camera.  I tried every setting change - contrast, sharpness, resolution etc.  Nothing works.  Placing the camera on a table with the auto timer the pictures are still blurry and grainy - so much for 10MP.  Absolutely worthless piece of garbage.", "Date": "July 10, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Vivitar 10.1MP 1.8 Flip-Straw", "Name": "Vivitar X014 Black Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41bwTcQduiL._SY300_.jpg", "ProductID": "B0044Z1FHY"}}