{"Reviews": [{"Title": "If you simply want more of your memories caught on film...", "Author": "Valeri", "ReviewID": "R3CINLT8N6UC0V", "Overall": "5.0", "Content": "this camera is for you. This camera does have some great features, some of which I have not even had time to use yet. The main draw, however, (other than the size) is that it is simple and easy to use. There are tons of point and shoot cameras out there, and there is no use being snobby over which one you buy, because they all do pretty much the same thing. This one is great for the price. You could get a nicer camera, but for 90% of the people in the market for a digital camera, this will do what you need and want it to, and more.I use mine mainly for snapshots and spontaneous pictures with friends and the like. However, I do enjoy photography, and I have experience with SLR cameras as well (and I own one). Therefore, I also sometimes take artistic shots. This camera does it all unless you are a professional photographer, in which case, you already know you need a different camera.The size is perfect. This will even fit in small pockets on skinny jeans or whatever. The case I bought with the camera adds some bulk, but the camera is so slim, even the case fits in my pockets comfortably.I use Amazon Student Prime, so shipping is never a hassle. I can't really comment on other shipping speeds. The package was simple, but the camera box protects the camera with styrofoam and cardboard, and the shipping box used inflated plastic bags to keep the camera box safe. Someone would really have to try to damage the camera to manage it.Amazon lists plenty of features of this camera, but here is my list:RECHARGEABLE!Records HD movies with one buttonBig LCD screen on back to help compose pictures in a size you can actually see19 scenes to choose from to assist in getting a better picturePet Focus will find your pet's face and once focused, will shoot the pictureThere are several cool filters like selective coloring, a miniature effect and a fisheye effectIs tiny and lightweightComes in cool colorsThis camera will even warn you if it thinks someone blinked.Bottom line: This camera is what you want. I search for weeks or longer before deciding to buy something, and I chose this camera. For a point and shoot, it has everything you need, and so many things you didn't even know you wanted. Unless you don't actually know what you're looking for, you won't regret buying this camera.", "Date": "May 3, 2011"}, {"Title": "Overall a great camera", "Author": "Westoncito", "ReviewID": "R1K42J9S8S2FEO", "Overall": "4.0", "Content": "This camera pretty much rocks for its price.  I bought this camera because I was in need of a camera update and the cell phone camera on my G2 wasn't cutting it.When I took this think out of the box for the first time I was glad to notice that it's small and thin and fits nicely in my pocket. My old camera was much bulkier and I couldn't carry it in my pocket without a strange looking bulge in my pants that made me look like an idiot.I am not a digital photographer so I bought this camera as more of a point-and-shoot camera.  I wanted a camera that I could snap a quick picture that would have lots of details and look pretty nice without too much photo editing. Normally when I take a picture I am wanting a picture of my friends or myself at a certain event or next to a landmark etc...  So I wanted a camera that would be simple but still take a sweet picture.  I can't tell you how many times I've had people trying to snap a picture for me only to not be able to get my old camera to work right and the picture(s) turn out horribly.  Like I want to load a fuzzy blur up onto my Facebook page.That being said, this camera can also cause difficulties with the technologically retarded.  This camera has to achieve a \"focus\" before it will snap a picture.  Sometimes you can push down the button trying to take a picture and the \"focus\" will be off and it won't even snap a photo at all.  For those special individuals, who for some reason are always snapping my photos, this can cause extreme problems with their abilities to be able get the camera to function.Now you may be asking yourself why I would have rated the camera so high and said that it rocks and then ripping it a new one, but I just wanted to let you know the only problem that I have had with it so far.  This camera perhaps is not the easiest camera to use, but if you spend 5 minutes to learn how it works then you will be able to get excellent pictures from it.The camera's picture taking mode basically has 4 different options, Auto mode, Scene mode, Smart portrait, and Subject tracking. In my experience so far with this camera I have noticed that the Auto-mode isn't always perfect.  I may have to take a bunch of pictures, before I can get the picture looking like I want it to look.  To be honest I am a bit picky with my pictures though. Many times when I am having somebody else snap a picture for me that can be quite an annoyance. The Auto-mode definitely works better on landscapes than it does for people (in my opinion).The scene-selector mode is sweet when I am the one taking the picture there are 15+ differing options that optimize the camera for different types of pictures such as: sunset, portrait, pet, beach, party/indoor, etc.  I gave up even trying to teach the technologically handicapped this mode after the 2nd attempt.The mode that has been the most useful for me has been the Smart-portrait mode.  This mode basically finds a couple of people's faces and then focuses the picture on them.  Since the majority of the time I am taking pictures of people I have found this to be an amazing option.  I use this mode for 90% of my pictures.  I get pictures that look amazing and I usually give the camera to other people in this mode although sometimes it won't take a picture and they will have to \"refocus\" the camera by re-pressing the button.The smart tracking picture mode has honestly not been something that I have needed yet but I suppose it takes pictures of moving objects or something like that.I could ramble on more but I figure that this should be sufficient for now. Overall this camera takes great pictures, they look sweet in print and they are very photoshopable (is that actually a word?)  and look great in print form and also on the web.", "Date": "May 13, 2011"}, {"Title": "When In Doubt, Read The Manual...", "Author": "Kricket", "ReviewID": "R1X2CTZOP1F1DD", "Overall": "4.0", "Content": "I received my camera from Amazon this afternoon.  The first shots that I took with it were blurry, just as some of the previous reviews that I read stated they would be.  But then I told myself that Nikon has been making great cameras for many years, so if there was a problem here, it most likely was me, not the camera.  The camera does not come with an owner's manual - just the quick start guide, and that does not give you any details about the various settings.  The complete owner's manual is available on the Nikon site.  Once I read the manual, and found out how to set up the camera so that image stabilization and auto focus worked as they should and other settings did not conflict, everything was great!  If you purchase this camera thinking that it is a simple point and shoot camera, it isn't.  But that does not mean that you cannot take great pictures once you understand the settings.  Also, I should add that I am not a professional photographer - not even close - but I was able to set up this camera so that it takes great pictures.  So if you too are an amateur photographer, don't be afraid to purchase this camera. I am giving this camera four stars instead of five only because I have not had it long enough to explore all the features.", "Date": "October 20, 2011"}, {"Title": "Not an acceptable camera", "Author": "Real Raleigh Reviewer", "ReviewID": "R4BYG0IJCZW63", "Overall": "1.0", "Content": "To put this in context, we purchased this camera as one of a handful of point-and-shoots; we bought a Nikon D90 shortly before having our first child, which is a stellar DSLR, to add to an old Panasonic Lumix point-and-shoot that did take pretty good pictures, despite an excessively bright flash. After a couple of years, we wanted to 'downgrade' back to to point-and-shoot cameras, given that ours is about 5 years old, and newer ones are both more high-tech and relatively inexpensive for the given level of technology. We bought 'a few' to serve a couple of more or less specific roles, all shy of the DSLR's \"big heavy super-high-quality photograph field cannon\" role. The purpose of this one was to be... well, the cheap one. The everyday, easy-to-use, no-brainer, compact and lightweight and easy for my wife to put in the diaper bag and take to the museum or the park with the kids. Cheap enough that if you lost it or it got scratched by car keys, no big deal, nice enough to take good basic photos but otherwise no particularly fancy features.Now, put in that context, time for the inevitable 'pros' and 'cons'.Pros:- Extremely compact, lightweight, 'sexy' design with chrome details around silver metal body- Fast start-up, about 2.5 seconds to power up- Continuous shooting can get maybe a hair more than 1 picture per second. Specs list as 0.7s intervals.- Battery life seems to be good so far, about 200 pictures and several videos over the course of 3 days with all varieties of flash and zoom and the battery still indicates fully charged- Zoom is pretty powerful for such a compact cameraCons:- Skittish. It's hard to get a clear picture from the thing even with a steady hand. Image stabilization does nothing as far as I can tell.- Because of the former, producing sharp pictures with continuous shooting is pretty much hopeless- Focus is hopeless in ISO3200. No, with any automatic or manual setting, with or without the flash, focus is hopeless. About 1 out of every 4 pictures came out well-focused. Even focused pictures seem to have blurry points in the same range as other objects that are at the same distance, even near the center of the scene. This is even for things like city scenes in full daylight.- Abandon all hope, ye who shoot photos indoors... focus is abysmal. Did I already make this point?- Because the focus is so poor, zooming in on anything, even a little, is absolutely and totally hopeless. Taking pictures of animals at the museum came out occasionally reasonably focused; zooming in as little as 2x produced worthless blurry shot after worthless blurry shot- As with pretty much every point-and-shoot, the flash creates a scene completely washed out with white light - needs to be diffused.- Very slow to become responsive after a photo; with or without a photo review, the camera takes about 5s to become responsive and available for another photo. This appears to be the case with 3mp the same as 14mp. Just very, very, very slow.- Very slow to delete a picture; deleting a picture you don't like takes 3 clicks, then about 3 seconds to complete the operation. It's a little surprising how any device (phone, camera, gps, tablet, anything) could take that long to complete a simple operation...- The shutter speed is too slow or simply wrong; if you have kids, who are naturally always in motion, they'll be a blur even if they're standing still to pose for a photo.- Slow to actually fire a shot after zooming and pushing the button - sometimes 1 to 2 second delay, which means, the subject (kids!) is often simply gone by the time it actually shoots.- Grainy. Even in broad daylight, color fields on high-res pics, like buildings and peoples' faces, is grainy and pixellated with blotchy color tones.- Video. Can't record smoothly, even at lower resolution, with a high-quality Class 6 SDHC card. Don't bother with video.To be perfectly fair and objective, I took this camera and our Samsung ST-95 outside and took two shots per camera, of each of five subjects, in the same resolution, at the same time. I chose the sharper of the two photos from each camera and renamed the file generically. I then brought up the photos on our 1080p 55\" TV - the largest-format, highest-resolution screen in the house. I showed them to my wife and asked her to choose \"before\" and \"after\", letting her know that I had swapped the order of the pictures randomly (so that A wasn't always the Nikon, B wasn't always the Samsung). In 5 out of 5 cases, she picked (and I agreed) the Samsung's pictures, simply on the focus. The Nikon just can't focus correctly. For example, on the back patio, the kids' tricycle is relatively focused, but the grill right beside it - both near the center of the shot - is entirely blurred out. All of my subjects were stationary out of necessity; I could not get a single clear picture of the kids or dogs with the Nikon, so there was no relevant comparison to be made. Using \"scenes\" to balance the settings made absolutely no difference on focus, only color balance.Overall, this camera is a fine solution if you don't expect much and you won't do much with it. You could shoot some video or take pictures of inert objects at medium range in full daylight and maybe one out of every two or three photos will be focused enough to pass a cursory inspection (don't look too close), but beyond that I'm afraid this camera just can't perform acceptably. It'll capture images, but they won't be GOOD. Despite the aforementioned purpose for which we bought this camera, we'll probably take around one of the better / other ones instead. It's really just about as well not to take a picture of those 'precious moments', as to attempt to do so with this camera. Other folks who have claimed that they are satisfied with this camera just can't be looking very closely at their pictures; after three outings and a few hundred pictures I am just amazed at how poor the quality of the shots are, in every environment, every light, every kind of subject. It's not for lack of use or lack of knowledge/experience with digital cameras; this really just has an extremely poor-quality sensor and processor and, I would assume, sub-standard firmware.I suggest looking at other entry-level offerings such as Samsung ST-65. Or, go for a mid-range camera. You really should only consider this camera if the looks of the camera itself matter a whole lot more than the quality of the pictures it can take - and, if the quality of the pictures it takes don't matter much at all to you. If you do care about the ability to capture images, this camera will not be satisfactory.I do not recommend this camera.", "Date": "July 16, 2011"}, {"Title": "An easy camera to use for the average picture taker", "Author": "NCBuckeye", "ReviewID": "R3K1UY2RYAR2LU", "Overall": "5.0", "Content": "I consider myself an average picture taker: trips, vacations, special events...I have been using this camera for about two months now and am very happy with it.  It replaces an earlier Coolpix model that I was also happy with, but did not survive a drop on a concrete floor.  It is simple to use, my pictures come out great and transfer easily to my computer for storage/sharing. My old camera required two AA batteries and they had to be changed frequently.  This camera plugs in to charge the same as you would a cell phone. I charge it before a trip and it keeps the charge the entire time, a big savings for me.  The zoom on this camera is greater than my old one which is a very noticeable bonus.  It is also slim enough to slide into a pocket, another bonus, and hopefully a way to avoid another drop to a hard floor!  I would definitely recommend this camera.", "Date": "May 26, 2011"}, {"Title": "Nikon is Finally getting the compact camera right.  Like the S3100!", "Author": "D. Brinkley", "ReviewID": "RD1GLRWPSVTDH", "Overall": "5.0", "Content": "I just got the camera, obviously...just came out this month.  I like the Nikon Coolpix S3100. It feels good in my hand and I love the quick button for the video capture.  A great thing Nikon added are the awesome filters.  You can add cross screen (stars), selective color/s and quick retouch. I've been wanting a camera with the selective color filter and now, my fave brand of camera, came out with it in the S3100!!! This camera is not a touch LCD type camera. I think the S4100 and S6100 are. More money..you don't need that opiton.  There are a few more features, but I like the ones I mentioned, the most.  It's fun,compact and quick start up.  14 meag pixels is a lot for a little point and shoot. This has more megapix's than my Nikon D90!  Love the HD MOVIES....I love small gadgets so I am real excited about this.  The S3000 I own too...that one is fun but not so many filters.I bought the black one! so,I would reccomend this to folks who want a small, fun and good picture and video quality toteing camera!", "Date": "April 21, 2011"}, {"Title": "Replacement for my 6yr old Nikon Coolpix...", "Author": "Happy", "ReviewID": "R1BYG8V0OQYRIZ", "Overall": "5.0", "Content": "The Nikon Coolpix S3100 is great FOR THE PRICE! Perfect size to tote around; functions are extremely user friendly to toggle thru; just point and shoot; love the fact that you don't need to remove the battery to recharge; and it takes a great PICTURE!", "Date": "March 24, 2011"}, {"Title": "This camera is the best point and shoot-out of three I've had", "Author": "racer_41", "ReviewID": "R1I3HQUQJFAKZP", "Overall": "5.0", "Content": "Wow! Just an incredible little camera. This is one that the scene settings actually work! Took very acceptable pix in low light, 720 video is great. So far I've owned a Panasonic Lumix, a Fuji S70 and a Casio. This is by far the best.", "Date": "May 2, 2011"}, {"Title": "Piece of junk", "Author": "Yo \"Yo\"", "ReviewID": "R8FB16BUR8NFZ", "Overall": "1.0", "Content": "The camera frequently takes blurry pictures.  Moreover, overall impression of cheap, cheap construction was confirmed when the lens cover stopped opening and closing completely within two months.  Highly unrecommended.", "Date": "June 27, 2011"}, {"Title": "Not so great", "Author": "Soyala27", "ReviewID": "R2GADXBQ2Q6RR5", "Overall": "2.0", "Content": "I ought this camera in hopes that it would be as nice if not better than my old Nikon Coolpix L4. Yes, this Camera is thinnier, lighter, and more stylish but all of that's useless. The pictures would be beautiful if it wasn't for the horrible/complete lack of image stabilization. Most of my pictures came out blurry even with VF on. My Coolpix L4 takes better pictures and I got it back in 2005. Needless to say this camera is going back and I'll be in the market again for a new camera.And for those of you asking, I took pictures of still objects, people moving around on stage, people standing on stage (little to no movement), and my pets. Out of the 50 pictures I took with the camera I think maybe 6 or 7 were worth keeping. The camera did not do well either with the stage lights. (I am a theatre person and I NEED a camera that can handle the intense lights) Truthfully, I can't see how this camera could be useful for anyone but I see reviews that it works fine for other people. I ended up going out and buying an SLR type of camera and am quite pleased with it.", "Date": "April 1, 2011"}, {"Title": "Blurry Photos", "Author": "Keverne", "ReviewID": "R79QC22TXTJK7", "Overall": "1.0", "Content": "If you like blurry photos, this is the camera for you.  Every 3rd picture came out good.  Image stabilization - no, not really. I know how to operate a camera and this one is so poorly made it just doesn't work. What is even worse, is that on the screen, your picture looks perfect - until you download it.  Another item for the landfill, Nikon should be ashamed.", "Date": "June 30, 2011"}, {"Title": "Nikon S3100 review from a mostly SLR user", "Author": "Robert Cullers \"RCullers\"", "ReviewID": "RZKGPFX9ATRS8", "Overall": "4.0", "Content": "There are a number of reviews here on the Nikon S3100 compact camera, but I decided to give my perspective on this camera as someone who has used mostly the much more expensive Nikon SLR (single lens reflex) cameras.  The SLR cameras are much larger than the compact cameras so they will not fit into my pocket.  This compact camera has solved that problem since it easily fits into any pocket so I can carry it all the time.The JPEG pictures are usually quite nice although some range to being underexposed.  There is an exposure compensation setting to that problem can quickly be solved.There appears to be no way to change the aperture on the camera to change the size of the lens opening as with a SLR so different shutter speeds are used to get what the camera interprets as the best exposure.  This means that shutter speeds can get quite slow in lower light settings so that pictures can be blurred if the camera is moved during exposure.  This problem can be solved by bracing the camera on a hard surface like a table or wall or by putting it on a tripod.Also to get the best quality picture images the biggest JPEG size should be used even though this increases the total amount of storage needed.  Graininess is an ever-present problem with these economical cameras with small sensors so the lowest ISO settings (sensitivity settings) should be used (around ISO less than 400).  Any higher settings than 400 will give grainy or pixelated pictures.A potential picture can only be viewed as a so-called live view on the screen as there is no viewing eyepiece as in SLR cameras.  This may not be a problem for some people, but it tends to encourage camera movement since the camera must be held out in front of you as you take the picture.Also there is no option to record the picture as a RAW file instead of a JPEG file.  RAW files allow one to adjust the picture in many ways in Photoshop or Photoshop Elements.  For example, the color temperature can quickly be adjusted from the RAW file, whereas, it is much more difficult or impossible to adjust in a JPEG file.Some compact cameras (e.g., Nikon Coolpix P7000 or Panasonic Lumix DMC-LX5) solve some of the above problems, but they are much more expensive (around $370 to $500). If these problems with the Nikon S3100 camera are not important to you, then you should be able to get many decent pictures as snapshots without messing much with the settings.  The picture quality should certainly be better than those obtained with most cell phone cameras.  I rate this camera relative to SLR cameras as a group as three stars out of five although the rating would be four or five stars compared to other compact cameras in its price range (I paid $110 for it).", "Date": "October 16, 2011"}, {"Title": "Don't believe the bad reviews", "Author": "Cliff Addy", "ReviewID": "RZ6UDYNE9KZI0", "Overall": "5.0", "Content": "I bought this camera with a little trepidation, because the bad reviews talk so much about poor focus, poor quality, slow transfer, etc.  But hey, I thought, it's for my 8-year-old daughter and if it's really that bad, I can easily return it to Amazon (a big reason we bought every gift at Amazon this year).A little background:  I'm a professional wedding photographer, so I know a bit about cameras and I'm picky about my images.  My primary cameras are a pair of $5000 Nikon D3s with $1800 Nikkor lenses, so I know what a good camera is and how it works.I didn't want to hand my little girl a dud on Christmas morning, so I just spent an hour or so shooting with this little gizmo, indoors, outdoors, moving subjects, all sorts of stuff and I'm quite pleased with it.  Is this the equivalent of a $7000 pro rig?  Of course not.  But I experienced none of the focus or other issues some people have had.  My only explanation is they had defective cameras or they're completely incompetent.  Overall, it's a perfectly acceptable compact camera.  In fact, I'm thinking of buying one for myself, it's way better than my phone in every way and I hate lugging my pro cameras to family outings (they're huge and heavy).My only \"complaint\" is that when I hook the camera up to my Mac via USB, it doesn't show up as a storage device in Finder.  I know some devices can be reconfigured, so I'll check into that later.  It's really not an issue, because we all use Adobe Lightroom for photo management and LR recognized the camera and can quickly import off it with no problem.", "Date": "December 17, 2011"}, {"Title": "Not as good as I'd hoped.", "Author": "Amazon Customer", "ReviewID": "R3AE4773C0G1VV", "Overall": "1.0", "Content": "I've had this camera for 20 days.  If not for the fact that the store at which I purchased this camera limits me to 14 days for the return period, I'd have returned it already.  At this point I just plan to sell it on the secondary market.I purchased this camera based on the recommendations I found online, and also from a family member. I expected a relatively simple point and shoot camera with great picture quality. I planned to take it with us on vacation.  No special shooting situations (wet, bright, dark, etc...).  Just general picture taking and day to day activities.On the plus side, it's definitely compact and a relatively simple to use point and shoot camera.  It's quick to turn on and shut off, and seems to be pretty responsive.  The battery life seems good, the flash works appropriately, and the controls/settings seem pretty straightforward.On the negative side, I've got to say I'm pretty unhappy with the quality of the photos that I got from this camera.  I have an old Kodak C433 (4MP, I believe) that seems to take better pictures!Frankly, I'm astonished.  I've owned several cameras and never quite had this problem.  The pictures are either too dark or too light, and often blurry (both daytime and nighttime).  The colors are often \"off\", though that's hard to describe in writing.  I've tweaked the various settings without success.  I've used both \"Auto\" and \"scene\" mode, and also tried various flash settings.For the price, I did *not* expect perfection or incredible results, but these results were so poor that I believe even cheaper cameras would produce a better result.I'm the first person to blame the user (me) when I get poor performance out of a device like this.  However, I definitely have experience in this arena, read the instructions, and practiced heavily with the camera for several days.For the first time in a long history using multiple brands of digital cameras, I think I'd have to truthfully recommend that buyers look elsewhere for a simple point and shoot camera.", "Date": "July 22, 2011"}, {"Title": "Love Nikon, Hate this camera", "Author": "Avid Reader", "ReviewID": "R3LPMI8TJ6ND79", "Overall": "1.0", "Content": "I received this as a wedding gift and took it on my honeymoon as my only camera. As a result, many of my memories of my honeymoon will only be in my mind, not printed in pictures. The shutter speed is ridiculous, taking 2-4 seconds to snap the picture after pressing the button. Often it wouldn't even take the picture when the button was pressed (took 2-3 tries with several seconds in between to be able to get a picture). No matter what setting I used, the majority of the indoor pictures are terrible. I couldn't get any action shots, again no matter what setting I tried. It would also sometimes freeze after taking a picture, taking up to 10 seconds to save a photo to the card (we think that may have possibly been the card, not the camera, but we can't be sure). Even some of the outdoor pictures didn't turn out- especially those that were under some time of awning or something and pointed outward into the sun.  I am taking this camera back and hopefully upgrading to a better one. Trust me- if you want your memories captured, spend a little extra for a nicer camera.", "Date": "August 9, 2011"}, {"Title": "One great camera.", "Author": "William Broschat", "ReviewID": "RXSAJFXHNCUTL", "Overall": "5.0", "Content": "After reading several of the reviews that indicate that this camera is sub par such as \"The picture quality is poor\", and \"The VR is useless\". I was hesitant to buy this camera, but also saw some reviews that indicated otherwise. So I decided to make the purchase. I couldn't be happier. I normally use my Nikon DSLR most of the time, but wanted a small camera to carry while riding my road bike on Century, and other long distant road bike rides. The camera has been great from the start, and is very easy to use. The first time I used it after recieving the camera was on a Metric Century bike ride where I took about 30 photo's of other cyclist as well of myself with other cyclist behind me while riding down the road. In this situation it was diffacult to hold the camera still as I was pedaling and had to also pay attention to my riding. I was amazed at the quality and sharpness of all the photo's. I have since used the camera on several other bike rides and am just amazed. Of 100 plus photo's that I have taken thus far all of which were taken while riding my bike, there were only one or two that had some slight blur, and were deleated. This is the second Nikon digital point and shot camera that I have owned, the previous was a S220, and I think that this one is by far a better camera. Not much more to say other than this camera fits my needs very well. I think it is a great camera.", "Date": "October 4, 2011"}, {"Title": "Worst Point & Shoot I've Owned", "Author": "M. Leotta", "ReviewID": "RKN82LQJJB9WY", "Overall": "1.0", "Content": "Got the S3100 as an anniversary gift at work.  I also own a Sony Cybershot point & shoot.  Both are poor for indoor shooting, but the Nikon Coolpix S3100 is horific !  Pictures & video on the highest settings with fully lit room are incredibly grainy.  The 720p video resolution is a joke.  Looks worse than old VHS quality.  Outdoors in full sunlight, I'm sure it's fine.  Overall, the worst point & shoot I've ever owned.", "Date": "August 1, 2011"}, {"Title": "Issues with Nikon S3000 & 3100 original batteries.", "Author": "Phillip Villaruel", "ReviewID": "RPQU72QTADZNN", "Overall": "3.0", "Content": "Hi,I have had problems with 5 of the Camera batteries (including a previous purchase - original Nikon batteries). They charged fully a few times (no more than 4), then went dead and refuse to re-charge. The spare batteries I bought also had the same problem.The camera is good, but the batteries suck.", "Date": "December 27, 2011"}, {"Title": "Very disappointed!", "Author": "e221322", "ReviewID": "R216GJHHYJY7PK", "Overall": "1.0", "Content": "I bought this to replace my older Panasonic Lumix. I am not a novice- just a mom who likes to capture pictures of her children on a daily basis. This camera was horrible. The pictures came out blurry and the lighting was horrible. This occured in the auto setting, which is supposed to do all of the adjustments for you. I returned it right away and ordered the newer Panasonic Lumix. I should have stuck with the Panasonic as it was always a good camera.", "Date": "September 18, 2011"}, {"Title": "Love it!", "Author": "Maria", "ReviewID": "R270LD4OY0XBW9", "Overall": "5.0", "Content": "I bought this camera to replace my old Sony. The Nikon shoots great pictures and it's very easy to use. I love how slim it is and that I don't have to remove the battery to charge it. Overall a great value for the price.", "Date": "April 19, 2011"}, {"Title": "Just purchased today and tested", "Author": "Frank Milton \"Frank\"", "ReviewID": "RO824ZRMDTZ6A", "Overall": "4.0", "Content": "I have to say up front - I was ready to go online to Amazon and purchase the Panasonic Lumix DMC-FH25A. But I was in Wal Mart today where I saw some fairly cheaper cameras displayed. After 30 minutes of choosing between the Nikon S3100 and a beautiful blue Sony Cybershot cam, I chose the Nikon because it seemed to have the best quality at the lowest price.While driving home with the camera, I still had a little bit of guilt from not purchasing the Panasonic from Amazon. Then, before I unboxed it, I felt bad at some negative reviews about this camera making me feel a bit uncomfortable. But I said, I will learn and make the most of this Nikon cam and then go from there.Unboxing it turned up the smallest camera I ever held! It's like an iPod touch from 2 generations ago or like a fat credit card! The quick start guide showed me everything to get started (of course) and I will have to give more time to read the owners manual at the Nikon Website as soon as possible.Then the moment of truth came when I snapped some pictures. I was in the basement of my house where the lights are dim and I was only expecting grainy image shots. To my surprise the camera set on Auto Mode snapped pictures as bright as day thanks to the glorious built in flash! I even turned the camera on myself in a fairly poor lit area and not only did it get me, but also everything around me as if it was a halogen bulb in the room. I didn't even have red-eye. I could show the pics if Amazon made it possible, but please know I wouldn't type this much if it was any different.In closing, I still think about the Panasonic and all the wonderful reviews here on Amazon, but the Nikon S3100 has so much to be admired. The thin small size will be some getting used to. I only gave this 4 stars because, let's face it, I don't know everything about this yet, and at work, nobody gets perfect scores. It would appear like their manager overlooked something if they did. I'm glad I got this camera and can't wait to test it outside in the snow tomorrow.", "Date": "October 27, 2011"}, {"Title": "Hundreds of photos and so happy with it!", "Author": "Amazon Customer \"indigoheirlooms\"", "ReviewID": "R3G1QM1LOJKHMB", "Overall": "4.0", "Content": "As an artist I snap hundreds of pictures a week for inspiration, fun, memories etc. I am documenting my year and my cell phone camera won't do, my canon is too big to take everywhere. So this camera was perfect. I bought it in red and it is BEAUTIFUL! That's not why you buy a camera though, pictures and lots of them, is what a camera is all about.One reason I choose this is the macro lens my work is small and the macro lens was important. It works well. (included in images is a micro model of a ship). I also used the museum mode which makes pictures have a beige hue but it is not unpleasant.Food? well food mode works well when the lighting is off such as in a semi lit room or in fluorescents (included image)Clubs? perfect! The night and party mode really works well.(included images).Color options of photos? well the black and white lacks depth of film cameras but is ok. Vivid color is amazing.Zoom - Love it and use it often. (included image) It keeps the detail as long as the focus is rightFocus - always an issue with a point and shot and a digital makes it worse. This camera has pretty good focus. It works well for still shots, poses, miniatures. The challenge? if part of the picture is still and the other part is in motion. Like someone sitting but people moving around them. The camera will focus on on part. If you have it pointed slightly differently either the background or the foreground will be in focus, not both. Or if the background is really busy the focus will be blurred on what you don't center.Movement...ahh I haven't used the sports mode but I have taken a lot of action shots. There is some doppelganging if a person moves too quickly which is an interesting effect but may ruin a shot because sometime the picture is just a blur. Other times the effect is great. This is the same if you are moving (included image)Skin hues are good even on prints. Prints 4X6 come out well, however 8X10 prints loose resolution and come out pixelated. Horrible? no but not great. I would like the option of bigger prints.Timing...yours and the cameras. Digital, especially point and shoots require holding the shot for a moment. Not letting the subject or the camera move too quickly. This camera has better timing than my phone but not as well as my canon. there is a lag time after pressing shoot and when it actually captures the shot making it necessary to hold the camera in place longer than you think you need to.Battery life - Amazing! I shot 250 pictures in 2 weeks before the battery needed to be recharged. Pet peeve and huge CON - the battery showed full charge until right before it shut off. It went from full charge icon to half charge to shutting off in 10 minutes. The next day I turned the camera on and it showed fully charged icon right before it shut off because of a dead battery. So I have no idea when the thing is going to shut off. That is the reason I gave it 4 stars I have to charge it whether the icon says full or not.This camera is excellent for what it is. An inexpensive point and shoot. Yes you will lose shots, every camera does that. Yes the blow up isn't great a more expensive professional camera is perfect for that. This is better than the average camera in the $80 - $250 range. Use it for what it is made for and you will be perfectly happy.note: a famous photographer once told me the secret of great shots. Take hundreds and thousands of photos and don't be afraid of throwing out what doesn't work. The more photos taken the more you understand the camera and the more shots that be amazing.", "Date": "January 20, 2012"}, {"Title": "Take it from me- DO NOT BUY THIS!!!", "Author": "BB", "ReviewID": "R3UDKFZQ45A8NF", "Overall": "1.0", "Content": "I did my research last summer when wanting to buy a new camera.  This one had gotten good reviews back then, now it does not!  I have had nonstop problems, from the camera freezing inbetween pictures to it not being recognized when connected through the USB, and it has only gotten worse over time.  Nikon has HORRIBLE customer service, and is of no help, they fail to offer any type of real solution.  Also- this camera does NOT come with a memory card!!!  Save yourself the trouble and don't buy this camera!", "Date": "January 9, 2012"}, {"Title": "Use your cell phone", "Author": "kludge", "ReviewID": "RMNZYYEJ826RT", "Overall": "1.0", "Content": "My wife is a returning college student and we bought this camera so my wife could take pitures on her field trips.  I am utterly dissapointed.  My old Fujifilm 8MP point-and-shoot camera takes MUCH better pictures.  Most cell phones take better pictures.All pictures are grainy, noisy, color balance is generally way off indoors and out, and the flash only make things worse.  The zoom is slow and hard to get adjusted right... you always overshoot and have to pull it back, even just a quick tap overshoots.  The battery can't make it through a 6 hour field trip (less than 50 photos) even without the flash and even turning it off between pictures.I can't even recommend it for snapshots (which is all it was intended for).  We spent $130 and it was a total waste of money.Plusses?  It fits in your pocket nicely, you can zoom in and out while taking video (my old fujiFilm can't).Update:  I should have updated this review a few months ago, but I just remembered to post this.  It gets worse.  I now have the symptom that many other reviewers have had.  The battery is totally dead.  It won't take a charge.", "Date": "December 11, 2011"}, {"Title": "Great Camera", "Author": "Jenn P", "ReviewID": "R107SPLL55CNW3", "Overall": "5.0", "Content": "This is a great camera with great features. I'm very pleased with it. My only complaint is that on occasion the button must be held down for a while before it will take the picture.", "Date": "April 30, 2011"}, {"Title": "Blur, blur, blur.", "Author": "Amazon Customer", "ReviewID": "R315P7B29PJJOZ", "Overall": "1.0", "Content": "I bought this camera to replace one that was broken. The price was great, 14 megapixels, and it was a Nikon--figured I couldn't go wrong. Except... all my pictures are a BLUR! The camera has a very hard time focusing, so even if I'm taking a picture of a stationary object (i.e., my son when he's not moving), his face is blurry. If I want to capture a picture of him running around, FORGET IT! The pictures invariably come out a big blurry mess. The shutter speed is just atrocious. I've had other cameras before and never encountered this problem. It seems like a cheaply made camera with good marketing. I won't buy another Nikon point and shoot. It's gotten so bad that I've literally quit using the camera out of frustration.", "Date": "December 30, 2012"}, {"Title": "Not a recommended camera", "Author": "E. Brown", "ReviewID": "R33E09I1UC95KO", "Overall": "1.0", "Content": "I purchased this camera less than a year ago.  I loved it.  It was very easy to use and took great pictures.  Then one day a \"battery exhausted\" message came on when I turned it on.  I plugged it into the charger and nothing happened. Then as I was searching for a solution I saw that many, many people had gotten the same message and even purchased new batteries without solving the problem.  The company says the problem is in the charger, but you have to send it in at your expense and why would the camera still show that message?I am bummed.", "Date": "December 8, 2011"}, {"Title": "I loved it until NOW.", "Author": "Tara", "ReviewID": "R23AGBGHWT4Z85", "Overall": "3.0", "Content": "My husband bought this camera for me last Christmas shortly after we had our first born. I wanted to make sure I captured all of our special moments. It was great! The battery lasts FOREVER. I think I had to charge my camera three times since I have had it and I have had it for over 8 months! It's really easy to upload pictures onto the computer. It's great for somebody who isn't all that great with electronics. HOWEVER, it used to zoom very good and have good quality pictures. Now if I use the zoom feature at all it comes out so blurry. I tried to take a pciture of my wedding ring and it just looks like a big whitegold blob! So, I'm pretty dissapointed. Also, it has been making a weird clicking noise? I have never dropped the camera or anything, so I don't know what is wrong with it. Oh and another thing when you press the button to take a picture, there's like a 2-3 second delay. It seems like whe nI don;t use the flash it's an even longer delay fro some reason and that causes all the pictures to come out blurry.", "Date": "August 1, 2011"}, {"Title": "Poor image stabilization and color reproduction.", "Author": "Crystal Ann Crown \"Crystal\"", "ReviewID": "R2EF7GR2GL6U7D", "Overall": "2.0", "Content": "For the price, this isn't a bad camera- but overall, within the genre of point-and-shoot cameras, it's definitely lacking. I bought this camera to take to work with me-- I work at a marsh restoration site-- to take pictures of the wildlife. It didn't really work out, so I returned it. This might be a good beginner camera. Maybe good for someone who isn't looking for much detail, wants something tiny and just wants to snap some shots of friends and the like. My two major complaints are:1. Poor color reproduction. I had to increase or decrease the saturation in every picture I took. Some colors would show up disproportionately bright and wash out all the detail (such as red or yellow flowers), and other's would be incredibly dull. The latter especially with colors that aren't bright naturally- it would dull them even more than they really were. Anything a pastel color lost all its vibrance. The only color I noticed that was pretty spot on was green. The greens were great, but the other colors not so much.2. Poor image stabilization. I got lots of blurry and soft images from this camera. If you were to use a tripod you'd get incredibly crisp shots. But, being that this is a super portable camera, that sort of defeats the purpose-- that being, NOT having to carry around something bulky. I took some daytime landscape shots that came out much too blurry, considering that I was standing still and it was daylight. On the other hand, when I held my breath and propped the camera against something to take some macro shots of shells, they actually came out pretty good. Expect that about 50% of your photos will be blurry or lacking detail, and the other 50% will be very clear. But even in the clear shots the color killed it for me. The end product is really hit or miss with this camera.The bottom line is, as mentioned above, if you're not looking for much detail and want something small enough to slip into your pocket, then this might be a good camera for you. Though I am sure one could find something for the same price that would give consistently clearer shots.", "Date": "June 24, 2011"}, {"Title": "Great Little Camera", "Author": "Cliff \"Cliff\"", "ReviewID": "R2L8NIJWJT5WPG", "Overall": "4.0", "Content": "Pros:This camera is small and easy to tote around. It takes great pictures in all lighting conditions. The video it takes is great too. You can easily start taking video with a press of a button no matter what shooting mode your in. The battery life is pretty good, it charges from outlet or when you plug the USB into your computer. It also uses the standard SD card. I suggest a SDHC card with a class rating of at least 6 for taking video.Cons:Very little zoom, in video mode. Specialized battery, not a standard AAA or AA battery. Macro mode is not close up.", "Date": "October 17, 2011"}, {"Title": "Cannot give it more than 3 stars now.", "Author": "Bighugeg", "ReviewID": "RVFS6G9RIRBTQ", "Overall": "3.0", "Content": "I will keep this as simple as possible.  Bought that with the Transcend 16 GB class six SDHC .  I finally understood that Megapixel doesn't tell  the  full story.  Set up for the maximum resolution, the pictures aren't far away from my old Samsung  which only had 3.1 MP.  The camera is very portable, but it doesn't perform as good as it looks , 5 X is great for an entry level camera.1)The camera is pretty slow with the class 6, I just ordered the Sandisk class 10  30 M/s  ; I was told by Nikon that using a non-approved memory card is the reason my videos are limited to 8 minutes, the approved ones are Panasonic, Toshiba, Sandisk and Lexar . I will find out on monday . After I received the new card , I'll see if the speed(time between taking each pictures ) improves  and then I will  update my rating.2)You can digitally zoom while recording video , but honestly, the quality get very distorted . Quite frankly, the videos don't look at all like 720P. My iPhone 4 shoots better.My conclusion is many cameras are much faster with a class 6  20M/s card  than this one .  My biggest issue is the speed issue, you might miss some beautiful shots just because of that and it can get you frustrated . If you need a fast shooting compact camera, well this is not for you , you might as well try something else. My dad used to tell  me that you get what you paid for, well he was right.  I am very afraid that I might just have to pay a little more . I hope this helps , shoot me a question if you need any informations.(update)I ended up returning it for a Canon ELPH 300 S and it blows the Nikon out of the water . The Nikon did do better  with the class 10 Sandisk than the class 6  Transcend I originally purchased  ,  but it didn't change  the fact that it cannot record videos over 8 minutes like the Nikon customer service told me.  I was lied to, so I ended up buying that expensive Sandisk. One thing I have noticed is the Canon is much faster out of the box to Focus  (keep in mind it cost about 85 to 90  bucks more than the Nikon ).  My conclusion stays the same, the Nikon s3100 is a slow camera, to make it decent you must go with a class 10 30mb/s SDHC. I wont talk about the HD video, that wouldn't be fair to the Nikon.", "Date": "May 14, 2011"}, {"Title": "Very Economical and User Friendly", "Author": "Mountain Preacher", "ReviewID": "R2FTF77KM2W3FC", "Overall": "5.0", "Content": "This Nikon CoolPix S3100 was a gift for my adult daughter. We were very pleased with its ease of use and many user friendly features. One great thing is that it is rechargeable. No more changing batteries! It has sleek design and is packed with features. I especially like the wide angle zoom lens and the large LCD screen. A Great Buy!!!!!!!", "Date": "December 27, 2011"}, {"Title": "Durable little camera", "Author": "Chris Clare", "ReviewID": "R2YUDTOTAO9NXX", "Overall": "5.0", "Content": "I got this for my girlfriend for her birthday, and when you're a rowdy 20-something girl, things need to be durable, and they need to be worth the expense.Durability:  She hasn't managed to snap any bits of plastic off, and she's had it for about a month now.  For most other things she own, that isn't the case.The image resolution is excellent.  While most of her photos never see anywhere other than facebook or online albums, the image quality is excellent.  It's not the best for fast moving environments or really dark places, so keep that in mind when making your decision.All in all it's a good value for dollar, and I'd buy another one.  Nikon hit the sweet spot between quality and price on this one", "Date": "December 17, 2011"}, {"Title": "Get a Tripod", "Author": "Candice", "ReviewID": "R2U0FJX60TU2CT", "Overall": "4.0", "Content": "It's a great camera for a simple point and shoot. The quality of the pictures are amazing but I have two warnings about the camera.1.) It has quite a few settings and options to play with. Might not be the most user friendly thing to people that expect it to work straight out of the box. If you don't mind a learning curve everything should be fine.2.) It's very sensitive to even the slightest hand shake and therefore has a high blur potential. I had to lower the MP quality to 5 so that I could take pictures in focus. Even then the pictures have a tendency to blur if I'm not careful. Buy a tripod if you plan on getting this camera. (This is why I gave it 4/5 stars...it's worth noting and at times it is a pain)Despite the bugs it's a very nice camera for someone on a budget that wants quality photos. I see myself upgrading in the future (and I'll probably stick with Nikon) but for now this will do.", "Date": "December 10, 2011"}, {"Title": "Nikon continues its tradition of providing high quality cameras!", "Author": "Avid Reader", "ReviewID": "R91HQLOXO69P9", "Overall": "5.0", "Content": "This is an awesome camera that provides 'slr like' photos that I can use in my photography class. I've tested all the features (macro, portrait, red-eye removal, etc...) and they work as well as the features I have on my Nikon D100. SLR like camera in a PDA sized package.", "Date": "September 16, 2011"}, {"Title": "SLOWSLOWSLOW!!!", "Author": "Jennifer", "ReviewID": "RE94DUL6NNAL0", "Overall": "2.0", "Content": "I want to say that I like this camera soooo badly!  It's very slick looking, nice and small, and a good price.  The specs sound great...  I bought it because I wanted the 5x optical zoom that seemed at the time to be one of the better ones you can get.  I don't care so much for the 14 megapixels because, honestly, I probably won't use more than 5 anyway.  The files are just too large if you do.  I like that it has the dedicated video button.  I like that during the video, you can zoom in and out.  I couldn't do that on my previous camera.  That's about all I like.The camera is SO SLOW!  I can't take more than one picture at a time without having to wait for the flash to recharge itself before even showing me the display again.  Then I have to wait for the autofocus to work.  Then I can finally take the picture... if my kid is even still in the frame!  I have missed soooo many shots while waiting for this camera to perform.  Then the shots I do get are out of focus because I'm trying to chase a moving target that got sick of sitting still for the slow camera.I wanted to return the camera, but I decided to try using a faster memory card to see if maybe that was the problem.  It was not.  The faster card (30mb/s) made no difference at all.  Still super slow, blurry, etc... Now, still, I would like to return the camera, but of course Amazon has a one month return policy on electronics.  Not to mention that I'd probably get charged a restocking fee, if what I read was correct.  Maybe I can auction it off to another unsuspecting soul!", "Date": "August 30, 2011"}, {"Title": "small but not snappy", "Author": "brandeeno", "ReviewID": "R3KCF1BJBESTP9", "Overall": "3.0", "Content": "i got this for my sis in-law. she says it takes way too long for the flash to charge, and even without flash, it takes way to long to be able to make the next picture (and it does have a fast SD card).", "Date": "June 24, 2011"}, {"Title": "some good, too much bad", "Author": "Keith", "ReviewID": "RICF5SJ66GV1O", "Overall": "2.0", "Content": "Pics are good when the lens focuses. But I was shooting a lot of images in closeup and it keep changing the focus. Had to take 4-5 pics in exactly the same position to try to get one in focus. This is true of longer shots as well.Also, the tiny battery is very light weight, but it'll be out of juice long before you're done shooting in an afternoon at the zoo or whatever.", "Date": "June 14, 2011"}, {"Title": "Love this little camera", "Author": "C. Schneidt", "ReviewID": "R39OS0RJOMPQBV", "Overall": "5.0", "Content": "This camera is cute, compact, quick and easy. Great camera for the price! It immediately recognizes faces and focuses on them. My  only complaint is that the camera took FOREVER to get here - over a month! This is ridiculous! I would have gone to Best Buy and bought it off the shelf if I'd known I was going to have to wait this long. Once it shipped, it took about 5 days. It was in a town 20 mins away for about 2-3 days! Not sure if this is because everyone is cutting back on personnel but things that I've ordered by mail seem to be taking a lot longer.", "Date": "May 5, 2011"}, {"Title": "Very nice camera!!", "Author": "Cyn15790", "ReviewID": "R1RJQQX77F2O3T", "Overall": "5.0", "Content": "I bought this camera for my son who is in Spain.  I have not printed any pictures with it yet but so far its very easy to work, nice and compact.  Very nice for the cost!~", "Date": "April 5, 2011"}, {"Title": "It died!", "Author": "willK", "ReviewID": "R1DAWD0D37GTZ7", "Overall": "1.0", "Content": "It was less than a year old and it died.  I would not buy a nikon product again.  The camera would not work after a lengthy layover.", "Date": "February 16, 2014"}, {"Title": "great very small camera", "Author": "kelpy reader writer artist chef \"kelper\"", "ReviewID": "R1NDKT99BJE462", "Overall": "5.0", "Content": "I have now used this camera to take about thirty pictures, in about four or five separate sessions, that I have downloaded and worked on, mostly just to crop. Except for the cases in which the camera warned me (twice) that it did not have a firm grip on a focusable-on surface, the results have been clear -- clearer than I would have expected and brighter, too -- given the relatively low indoor-light they were taken in, and this on \"automatic.\" Well, it is a Nikon, after all.Having had wide angle lenses that tended to \"fish-eye\" I was really glad that this camera had a wide angle zoom starting at its widest without any noticeable fish-eye effect at all, creating very correct rectilinear images.As other reviewers have said, and I would say this about any good camera from any company: \"Read the manual!\"When I first got the camera, having earlier read the one- and two-star reviews, I was hopeful that I would not run into those kind of problems, though I do see that this camera is sophisticated and complex, and I did read the manual included on CD (and available at the Nikon site for free), and have found it a joy to use. Just as logical and easy as you would expect of a major brand camera.It is a small, almost tiny camera, and you do have to be careful with the USB-cable/charger flap, as it is small and might be delicate. But that aside, the camera operates really well, and I look forward to using it for years to come.I love its color, I somehow got a tan one, unlike any I have ever seen. Sublime.", "Date": "July 9, 2013"}, {"Title": "perfect", "Author": "michele", "ReviewID": "R1C5QV2EJBAIA0", "Overall": "5.0", "Content": "I got this as a replacement for my daughters camera she had lost on a trip to new york, it is perfect we have had no problems and she is back to taking pictures daily.", "Date": "January 28, 2013"}, {"Title": "Be VERY Cautious", "Author": "Kelly", "ReviewID": "RTO63GDEZOYJH", "Overall": "1.0", "Content": "I needed a small camera and did reasearch on the cameras. I felt like Nikon was a trusted name but the thing siezed up on me after 15 pictures. I didn't drop it or do anything that would damage it. I did some more extensive research online and asked a few people I knew and found 3 friends that had bought the same camera and had the SAME thing  happen. Lots of problems with this camera for some reason. I returned it and bought a Lumix...sooo glad I did. THat is a great camera!!", "Date": "January 16, 2013"}, {"Title": "DO NOT BUY THIS CAMERA!!!!!!!", "Author": "curlygirl", "ReviewID": "R3HO0R8PIL04NN", "Overall": "1.0", "Content": "I bought this camera a while ago because I love taking pictures and was going to Hawaii the next month with my high school competition choir. I have had many canon cameras and loved them. They seemed to live forever. I thought this one would be fine though. I ordered it and it seemed to do what I wanted. I have had enough cameras that i am a fairly good photographer and I know how to take care of a camera.I had it probably 2-3 months before we left for Hawaii. I got there and before the day was over my lens broke. It wouldn't open or close. I never dropped it and it didn't get wet or get sand in it. I Had read other reviews where this had happened but thought it could never happen to me. I was in luck and one of the friends i was with is a professional photographer so I didnt miss the beauty. I still had warranty so I sent it in and they \"fixed it\". I got it back a week later and not even a month later the same thing happened. It still works a little but the shutter will not close all the way. I was really disappointed. I am never buying Nikon again. DO NOT WASTE YOUR MONEY ON THIS CAMERA!", "Date": "January 4, 2013"}, {"Title": "hate", "Author": "Deoranie Beer", "ReviewID": "R3V4XIEAVHALP4", "Overall": "1.0", "Content": "I got this last christmas, im so regretting my choice, i dont have a clear and clean picture, comes out dark and blurr, wish i gotten one of those with more pixels, my 7yr old son is now enjoying it since i refuse to capture my special moments with it.", "Date": "December 16, 2012"}, {"Title": "after owning for a year the battery has repeatedly caused problems", "Author": "fanofstr8", "ReviewID": "RLZ09EX0N05RQ", "Overall": "3.0", "Content": "The functionality of this camera is fine.  The pictures are nice.  It has some great features, but having owned a Sony,a Cannon, an Olympus and this Nikon this would be my least favorite.  My Sony is a larger camera but the batteries are easily charged and exchangeable.  My Nikon battery is always dead.  Now after less than a year, the battery won't recharge and when I try the camera gets extremely hot very quickly.  I tried a second Nikon battery, and I'm having the same problem.  Batteries won't charge and phone heats up in a matter of minutes to where I don't feel comfortable leaving it plugged in.  Have a call into Nikon......disappointed.", "Date": "December 13, 2012"}, {"Title": "Run don't walk away from this camera", "Author": "Bobsyouruncle", "ReviewID": "R3VBBWA2LWULUZ", "Overall": "1.0", "Content": "Terrible.  Simply terrible.  Bought it for my wife and has not worked right from day one.  If you want a camera that has a battery life for five shots that take up 100 metabytes each, this is for you.  Everyone else, buy anything else and you will be happier.", "Date": "December 4, 2012"}, {"Title": "Worse camera ever", "Author": "jeramy81", "ReviewID": "R3BDJW2C8C96R9", "Overall": "1.0", "Content": "Nikon should be ashamed of producing such an inferior product. Blurry fotos, hard to catch moving objects, takes a long time to recover between shots. Just plain awful, do not recommend at all.", "Date": "November 26, 2012"}, {"Title": "Great Secondary Camera", "Author": "Amazon Customer", "ReviewID": "R15J57K3WYOI3Z", "Overall": "4.0", "Content": "So for full disclosure, I am normally a Canon guy. I have had a few Canon point and shoot cameras and currently use a Canon DSLR as my main camera. I ended up winning this Nikon in a raffle at work and thought \"heck, might as well try it out since it's free.\" I like it for the most part - especially as a secondary camera.My first impression was that it felt a little cheap. The shutter and zoom combo button is a little wobbly and the body is really really light. I have been playing with it the last few days and have been able to get some decent photos. Sometimes it doesn't focus very well, but I always use the method of holding the shutter halfway down until it is in focus and then press it the rest of the way to take the shot. In doing this, I can always tell before ever even taking the photo that the camera is out of focus. This allows me to release the shutter and try again.To be honest, I wouldn't use this camera as my primary camera. For the cost, I feel that there are other point and shoot camera that feel less cheap and take more consistently focused photos. However if you can get a good deal on this camera (or are lucky enough to get it free like me), I would say it is a good secondary camera to have. I like how pocketable it is (especially compared to my SLR) and will be taking it with me on those occasions where a SLR isn't so convenient.", "Date": "April 7, 2012"}, {"Title": "Not impressed", "Author": "Cassie", "ReviewID": "R4ZJYLUO647O7", "Overall": "1.0", "Content": "While the price is right for this camera, I am not impressed with its performance.  I have yet to take a picture that is not blurry.  It has lots of settings, but none that just take a simple, focused picture.  I am back to using my old camera....", "Date": "April 2, 2012"}, {"Title": "Poor Choice, S3100 has poor image focus.", "Author": "Pinot Noir", "ReviewID": "R19XMTEIQC76JK", "Overall": "2.0", "Content": "I agree with the detailed review by A. Whalen also posted on Amazon.I owned this camera for a month and really tried to like it. It has a nice small size,looks good, a well thought out menu system and 14MP. And a 5x zoom range packed intothat small size with the Nikon name. Fabulous, right? Well not so fabulous after allthe testing I did.Who would think Nikon would have trouble with image focus??. They do with this model.I took about 150 images and used several focus patterns and then degraded the image to 8MPand the S3100 will only focus well about 40-50% of the time. I was confused for a whiledue to the difficulty of getting sharp clear images. A. Whalen's review helped sort itout, the problem is the focus system.I have a 4MP Kodak, 5 years old that takes clear sharp images 95% of the time. The3MP Kodak before that was just as good.So I returned the S3100 to the store and continue the search. This model is a black eyefor Nikon's 50 year reputation for excellence.", "Date": "March 25, 2012"}, {"Title": "Great camera for the money", "Author": "Dwight", "ReviewID": "R8Z25WYE0OQZE", "Overall": "4.0", "Content": "Zoom (macro-tele) control is integrated into the shutter release button on front upper corner.  Makes it awkward to use this feature without jamming your hand over the lens.Also, too bad Nikon didn't use a standard mini or mico USB connector for the camera cable.  Instead they sue a proprietary cord.The camera is fast and takes good quality pictures.", "Date": "February 15, 2012"}, {"Title": "1st one was bad, but the replacement experience was great!", "Author": "fonz_sXe", "ReviewID": "R2VII6KKB6H96Q", "Overall": "5.0", "Content": "So I camera for my wife on Christmas. It work fantastic that evening, taking great video and pictures. I unfortunately found out over the next couple of day that it wasn't charging. Contacted Amazon and within a couple of days had sent me a new replacement camera with labels to send the defective one out. I appreciated the fact that they allowed me a few weeks to get the camera back to them. I sent it back and a few days later got confirmation that we were all good.Great experience with amazon.", "Date": "February 14, 2012"}, {"Title": "Nikon Coolpix", "Author": "Char", "ReviewID": "R348XVWUPVEHRW", "Overall": "5.0", "Content": "I purchased this camera from Amazon about a month ago. It is easy to use, and takes great pictures.  It also has a large screen for viewing before taking the picture.  It's a very small camera and fits nicely in my purse, I just love it!", "Date": "February 3, 2012"}, {"Title": "coolpix camera S3100", "Author": "chooch", "ReviewID": "RSNER12OA39LZ", "Overall": "5.0", "Content": "This is the second camera I tried.  The first one, I will not mention the name) was not easy to operate nor did it take good pictures.  I returned it and bought the Coolpix and am delighted with it.  Takes wonderful, clear pictures, easy to operate and I LOVE IT!!!", "Date": "February 1, 2012"}, {"Title": "Good everyday camera// UPDATE", "Author": "P.R.", "ReviewID": "R3CIM2PT8U06AV", "Overall": "2.0", "Content": "This takes good pictures, it's very small so you can easily take it with you, has the convenient button for hd video. It's a basic camera for those who like to take hassle-free pics.Update: It took good pictures, until a \"lens error\" came up, and now it doesn't work anymore. This camera didn't even last a year, and it got little use, and was super taken care of.", "Date": "February 1, 2012"}, {"Title": "Takes GREAT pictures!", "Author": "Java Jams", "ReviewID": "R2A9WJNIXPLW2Y", "Overall": "5.0", "Content": "Camera was very easy to get started with - hardly needed the info on how to work it. Played around with the buttons in the back - easily able to do what I wanted to take pictures.  Has a zoom in lens - awesome for close ups that are CLEAR - even printing is clear when using the zoom lens.  Thumb drive included - only need to plug into the computer along with the computer cables (also included) and download the pictures to your computer and then can send to your cell phone.  HIGHLY RECOMMEND THIS CAMERA!", "Date": "January 31, 2012"}, {"Title": "love it!!!", "Author": "pamela alewine", "ReviewID": "R14XAKNZN4K2FE", "Overall": "5.0", "Content": "i love this little camera!Works great and has great video and fits in my pocket so i can take pictures when I am riding my horses!", "Date": "January 21, 2012"}, {"Title": "excellent little camera!", "Author": "R. Monteclar \"musicmaniac\"", "ReviewID": "RQKBV2QNXT6B0", "Overall": "5.0", "Content": "I have owned just a few cameras and the best so far is this cute looking camera, very easy to use and smart (gives me ample time to focus)and inexpensive, unlike some other small cameras that have confusing features. I'm no professional photographer and bought this one for my simple, personal use. If you're like me who wants less gadget hassles and pretty pictures, this camera is highly recommended.", "Date": "January 20, 2012"}, {"Title": "Broke down after 6 month of rare use", "Author": "Maria Chaderina", "ReviewID": "R2SPIIGIVOYSAP", "Overall": "1.0", "Content": "So disappointed. It looks good but apparently crappy on the inside - it broke down 6 months after I have bought it. I have never dropped it, no other physical damage. The battery would not charge. Now I have to ship it to Nikon (at my expense!) to get it repaired. And I am left without camera for a while...", "Date": "January 17, 2012"}, {"Title": "Nikon COOLPIX S3100", "Author": "John Hinton", "ReviewID": "R3DYE4XU1C2OQ2", "Overall": "5.0", "Content": "Well This is now my Third Nikon Digital Camera I have a D3100 and I had a S3000 COOLPIX which I lost at work. And now the S3100 which is an upgraded S3000 Which I liked very well but this one is even better it's yet to be seen how well it does as compared to my other digital cameras I really really like the size and weight of this camera it really surprised me when I first saw the s3000 and this one is the same size it's really small it's smaller than my cell phone and about the same width and weighs about the same so it's very easy to carry around in you shirt pocket. This model has a video button for quick access right on the back of the camera about the same place as my D3100's video lever is, quick and easy to use I opted of this model over the S4100 which has the touch screen. very easy to use and the Nikon ViewNX2 software which I already had on my computers is great with the Nikon transfer which I set to come up when I plug the Camera into the USB port and it's very fast I am using a 16G SD card and it works great this is what I use on my D3100 DLSR and I have about 3000 pictures on it and it's only about 1/4 full I take a lot of pictures of Graveyards for FindAGrave.com and this little camera is my almost constant companion I use it at work a lot and it's my backup and a quick cam to use at Church also very small. I had ordered a Panasonic Model about a week ago to replace my lost Nikon because the reviews were great and it was a top seller on Amazon, but when I got it and for some reason I really hadn't checked it's size and I said this is a mistake I picked the wrong camera this one is way bigger than the Nikon but in it's defense it did have a 16x Lens But I boxed it right back up and sent it back. Then ordered this Nikon S3100 Three Days Ago fast shipping indeed!", "Date": "January 13, 2012"}, {"Title": "camera", "Author": "brian", "ReviewID": "R1XFV5BA0N15LD", "Overall": "5.0", "Content": "Best camera for its price ! It takes great night pictures, good sports pictures and just over all amazing with light. It even includes a basic photo editor on the camera settings ! The only thing that I don't like is the sound quality, but its hard to find a camera that's good with sound. Other than that this is a great camera.", "Date": "December 31, 2011"}, {"Title": "It's just OK", "Author": "danielle barnes", "ReviewID": "R3IFMZDCTC411M", "Overall": "3.0", "Content": "I returned this camera due to blurry images that it captured.  It wasn't worth the money or frustration.  I played with it for hours to see if I could improve it, but nothing seemed to work.  I replaced it with a Canon Powershot and love that one much more than this.It's not a BAD camera.  Has a lot of nice features, but it's frustrating to get the right lighting.  If you have a dark room, this camera is NOT the one to use to take pictures.", "Date": "December 27, 2011"}, {"Title": "Nikon coolpix camera", "Author": "reid", "ReviewID": "R20ANR1CV5XWY7", "Overall": "5.0", "Content": "Great little camera!  Takes great pics, and is tiny enough to slip into your pocket or into a purse.  Bought as a starter camera for my 10 year old, but will use it as a family camera whenever we don't want to lug around my big one. I'm a Nikon fan!", "Date": "December 27, 2011"}, {"Title": "useless", "Author": "B. Closson", "ReviewID": "R3C748O3HMQR9", "Overall": "1.0", "Content": "I to am a pro. (WOW we must be a dime a dozen)I took a pic of my wife 10 feet away in a room lit by 2 lamps.I would call this a fairly typical shot.On auto ISO it defaulted to 1600.On a D3 no problem. on a s3100 it has more noise than anything I've ever seen.Same scenario on a s6100.Again defaulted to 1600. Noise not as bad. Could get a decent 4x6.I tried setting it to 800.Picture was very dark.Outside may be great. Inside at night.......useless", "Date": "December 24, 2011"}, {"Title": "First time I've returned a camera", "Author": "Kitty Kura", "ReviewID": "R2SBMHPEE3PJGJ", "Overall": "1.0", "Content": "I was very excited about this camera - it sounded like it had good features and on sale it was in my price range. When I got it home however, I found it difficult to get a decent picture out of it. Without the flash, photos indoors were very yellow - my white walls looked like smoker's walls. To be fair, I don't expect great indoor photos especially since the lighting in my house isn't that great. However, this was just too discolored. My old Kodak Easyshare C713 took better indoor pictures! (Which I only wanted to replace because after years of use, it will no longer turn on.) My other problem with the camera was its lack of focus. Close-ups were grainy or blurry. Even pictures taken at a distance didn't seem as clear as they could be.  I tried to take pictures of one of my cats in the pet mode and I saw no difference between that mode and the regular. On my Kodak, by putting the camera on the action scene I could get decent pictures of my pets. Not so with this camera. I paid $100 (which is more than I paid for my old camera) and I definitely expected more out of it for that price. I won't say stay away from Nikon (this is the first time I've heard anything negative about their cameras), but this particular model is not worth your time. I wish I had paid more attention to the negative reviews.", "Date": "December 9, 2011"}, {"Title": "Not good for the money", "Author": "S. Matteson \"LvrOmusic\"", "ReviewID": "R1NFJH9B1F5U44", "Overall": "1.0", "Content": "Bought this hoping to have a good camera that is packable.  The small lens makes for so-so pictures.  The big topper is that I have had this for less than six months and the camera says \"battery exhausted\" and won't charge now.  I have tried different cables to no avail.  I read on the Nikon site that this is an issue with this camera and you will have to send it back, your expense, even under warranty, to get it fixed.  I recommend saving yourself, or gift recipient, the headache and look for something better.  I have an older Lumix DMC-ZS10 that has a larger lens and does a great job.  Not quite as packable but at least it is still working!", "Date": "December 1, 2011"}, {"Title": "Great camera", "Author": "walkeverywhere", "ReviewID": "R3SMY99ARP0AXX", "Overall": "5.0", "Content": "This is a great camera, it is compact, easily fits into a pocket and I love the \"scene\" feature that lets me get the best picture for the light.", "Date": "October 22, 2011"}, {"Title": "Great Camera!", "Author": "AWG", "ReviewID": "ROQS1B1QT1VBK", "Overall": "5.0", "Content": "We have enjoyed this camera. It is light weight and very thin, I bought for a vacation instead of bringing the much larger one from home, Very Nice.", "Date": "September 20, 2011"}, {"Title": "It's OK", "Author": "QUIteSmrt", "ReviewID": "R1K0NIMJ3KQWGQ", "Overall": "3.0", "Content": "The screen is a little small, making it hard to review photos from the camera.  It also takes a few seconds for the camera to reset itself after taking a picture, which is bad if you want to retake a picture.", "Date": "September 17, 2011"}, {"Title": "Too Fragile", "Author": "TRAJANO LIMA", "ReviewID": "RUY37Z5I293D6", "Overall": "1.0", "Content": "Bought this camera, took nice pictures. Not outstanding ones, some blurry, other dark, slow to reset flash. Dropped the camera from less than 1ft high. It instantly died. I don't recommend this product; it is so fragile. Before that, I had a Casio Exilim (I still have it) and it has been lasting for more than 6 years, surviving tear, wear and drops. Now, I'm back to my Casio.", "Date": "September 7, 2011"}, {"Title": "Not happy at all", "Author": "Maria P. Johnson \"Candy Sweet-XBOX360\"", "ReviewID": "R1LRBNBWO2TD2V", "Overall": "1.0", "Content": "I purchased this item in hopes of having a cute little camera to carry at all times in purse.  Well, the camera was cute, but the picture quality is sub-par.  My biggest complaint is that the camera doesn't have image stabilization.", "Date": "August 25, 2011"}, {"Title": "Broke on the first day", "Author": "Olivia", "ReviewID": "R1VMWNZML0A316", "Overall": "1.0", "Content": "After carefully selecting this Nikon Coolpix, I was very excited to use it. I took several pictures and found no problem with it. It was easy to set up and use. A few hours later, a \"lens error\" occurred and it no longer worked. I kept trying to turn the camera on and off and nothing would work. It simply got stuck. Even before a whole day had passed, this piece of trash broke. This is the same problem that I had with my old Canon camera, but that lasted for 2 years.I am very disappointed with this camera and have already returned it. Thank goodness that Amazon makes it so easy to return faulty items. I do NOT recommend this camera to anyone. Spend a little bit more money and get a better and more reliable one.", "Date": "August 24, 2011"}, {"Title": "Review of Nikon S3100", "Author": "Norm G", "ReviewID": "R2TPKHDTJXZ30Y", "Overall": "4.0", "Content": "I have a Nikon P90 with a longer lens, but I wanted a camera that I could carry in my pocket. The S3100 was just right. The focusing mechanism is very accurate and the camera is easy to use. The camera does not come with a memory card. Be sure to buy a Scan Disc card that has a fast speed rating. I bought a slower card and the video was very jumpy. The video was OK when I exchanged the slower card for a faster one. I was disappointed that it did not have a viewfinder. The monitor screen works fine, but a viewfinder works better outside in bright light. None of the new small pocket cameras come with a viewfinder. I am enjoying the S3100 and carry it all the time.", "Date": "July 17, 2011"}, {"Title": "Definitely not worth the price...", "Author": "L. Grassman", "ReviewID": "R2OZJ6OL9R5JZX", "Overall": "2.0", "Content": "It looks cute and is advertised as being wonderful, but this camera isn't worth how much it costs. It's very hard to take pictures indoors or in any kind of even slightly dim light without them coming out blurry/almost indiscernible. Changing camera settings doesn't seem to help at all, either. I was quite disappointed by the film quality, too, something which was heavily advertised as being a wonderful feature: it doesn't look like HD and can only film a few minutes at a time. I do have something nice to say about this camera, though: it's great for taking outdoor pictures during the day. I've caught some marvelous shots of flowers, water, birds, and even the sun. But no, I do not recommend this camera to anybody.", "Date": "July 12, 2011"}, {"Title": "Very happy with this purchase!!!", "Author": "Cara Widaman \"Carebear\"", "ReviewID": "R16XSWGLHHD3FK", "Overall": "4.0", "Content": "What drew me to this camera in the first place was its sleek/compact design as well as its fun color, but after receiving the product I was impressed with how well the pictures that I took turned out. The only issue I have found is that when I zoom in on an object, it takes a few seconds for the camera to focus in on the object because it hesitates a bit; other than this one issue, it is a great camera that will fit perfectly in almost any size purse or pocket! Very happy:)", "Date": "July 8, 2011"}, {"Title": "Nikon coolpix s3100", "Author": "Ajinkya", "ReviewID": "R93TIHPOY3Z8N", "Overall": "3.0", "Content": "Nice compact camera with almost all the features and works satisfactory but sometimes has problems in focusing. The pictures tend to come out blurry unless and until proper scene has been selected. Also it gives you an option of taking panoramic pics but it can not stitch the images within the camera itself/ You have to use an external software which comes with the package.My 4 yrs old Kodak camera could do that.", "Date": "June 26, 2011"}, {"Title": "COOL COOLPIX...", "Author": "Tarot Teacher", "ReviewID": "R2TEWJNKN2HM9P", "Overall": "4.0", "Content": "From the moment I opened the box and saw the brilliant purple of this camera I was in love.  I'm not a techno of any kind so how the camera looked was kind of important to me.  But it is a CAMERA, after all.So, I took some pictures.  And then, I took the camera to England.  What can I say?  Three weeks of absolutely gorgeous pictures.  Driving 50 miles an hour down the highway, in the rain, past Stonehenge and got fabulous shots.  No blurring, could even see the crows wheeling in the air.Love the zoom feature and the edit and save feature right in the camera.  Filled up two memory cards with pictures and loved that I could charge the battery from my laptop.  Still, the picture is the most important thing about a camera and this one takes beautiful shots, close ups, panoramas and short videos.  Even chugging along the coastline in a boat, the camera somehow stabilized the shots so no blurry, \"what the heck is that?\" kind of shots.So, why not five stars?  Well, my only quibble is that the delay time when using the flash could get a little annoying, especially when I wanted to capture a lot of indoor/nighttime pictures really quickly.  But that's the only complaint I have.  Great little camera.  I'm so glad I got it!", "Date": "June 23, 2011"}, {"Title": "Nice camera but won't recharge", "Author": "Cascade book lover", "ReviewID": "R21YE8KVKD8WUY", "Overall": "2.0", "Content": "I was happy with this camera when it was first purchased ... until we tried to recharge it.  It would not recharge.  I thought maybe it was the battery so I bought a new one.  The new battery worked fine until it, too, ran out and would not recharge.  (This was not user error.  This is not my first digital device and I know how to plug in a charger.)After doing a lot of research online, I found I was not the only person who has had this problem with this camera.  Had to buy a third battery since I didn't have time to send it in to be repaired before leaving for a trip and the Amazon return window had passed. At that time, I found that the battery would recharge, but only if it wasn't totally drained.  Sent back to Nikon for repairs, but I had to pay the postage even though the problem was theirs.On another note, I also found that the battery seemed to drain more quickly the lower it got.  The battery would show  \"full\" for what seemed forever, then all of the sudden quickly be down to nothing.", "Date": "November 21, 2011"}, {"Title": "Terrible Camera", "Author": "Ryan", "ReviewID": "R1P9ZQRSFKP8Q8", "Overall": "1.0", "Content": "Just bought one tonight at Costco and will be taking it back in the morning. Image quality is unbelievably poor. I took a standard and simple photo in my kitchen with the flash and it was grainy and blurry. Seriously, I've taken better photos with my blackberry. Don't waste your money!", "Date": "June 17, 2011"}, {"Title": "All around Awesome camera!", "Author": "Maria \"Mariaa\"", "ReviewID": "RZL3IMNFLJX25", "Overall": "5.0", "Content": "I have been looking for a camera for quite some time now. Not some cheap thing that will just break, but not one too expensive that I can't afford it. This camera was just in the right range and has all the extra features I love.-Lithium Ion battery (rechargeable) A must for all digital cameras I buy.-scene selection- to automatically change the light and darkness and iso settings.-Filters- for fun pictures (black & white, fisheye, blur)-hd video (although I haven't tried it out yet, I bet it has to be good)All around it is a good camera and VERY light. I am actually almost afraid to hold it, that it might slip right through my fingers. I love it and I can't wait until I use it some more.", "Date": "May 11, 2011"}, {"Title": "Gresat camera", "Author": "Catang", "ReviewID": "R232UHYQXB69J2", "Overall": "5.0", "Content": "The camera is super clear. I would definitely recomend this product to anyone out there who needs a easy great using camera.", "Date": "May 24, 2014"}, {"Title": "Good out of the box", "Author": "R. Raiz", "ReviewID": "RHW06UGOGUAF7", "Overall": "5.0", "Content": "I am not sure why there are so many negative reviews here. These are my thoughts -It has a small foot path.  And by that I mean that you can easily hold it in one hand, although for my purposes I always use two.You need to leave the battery in the camera in order to charge it.  No problem, although I would have preferred a separate charger base like on other cameras.  There is an indicator light on the camera that will blink green when it is finished charging.Picture quality is quite good.  The flash is very powerful, so it would not make the best camera for shooting in doors any object that reflects light, such as an album cover or LP.  Since I sell stuff on eBay this is  a slight drawback, but you can use a picture editor such as Nikon's Picture Project to minimize this effect.There is not a very long lag time as other have mentioned.  At least in my opinion, it is very fast, although not instantaneous.All all I am more than happy with my purchase, and am giving it to my wife to replace her Sony DSC-T200. I bought a like new one for $25.00.  Hope she is happy!", "Date": "May 22, 2014"}, {"Title": "Great pocket camera", "Author": "Hurrel", "ReviewID": "RWIXXKHBTW566", "Overall": "5.0", "Content": "I have other full size Nikons but this is one that I usually have with me on a regular basis.  It handles a lot of lighting situations very well.  It's a Nikon; you will not go wrong buying this.", "Date": "April 8, 2014"}, {"Title": "For the money it should work better", "Author": "Kevin J. Pollack", "ReviewID": "R16BRPJADYZXQ4", "Overall": "3.0", "Content": "90 some days after getting this the power shutter broke. The only why to use the camera now is to pry it open with my finger", "Date": "March 31, 2014"}, {"Title": "great", "Author": "laura wilson", "ReviewID": "RQL3PUFC5Z77Y", "Overall": "5.0", "Content": "great little camera. with some playing around and learning which settings look better for which things, it's great. great quality photos. very pleased", "Date": "March 4, 2014"}, {"Title": "Great Video Quality", "Author": "Ethan Bartlett", "ReviewID": "R3UVI7ICZX45QP", "Overall": "5.0", "Content": "I have had this camera for over a year and have used it for concert band video taping.  I upload them to youtube.  The product is very nice for a device that isn't a camcorder.  The audio is superb!  I highly recommend this! The pictures are also good too :p", "Date": "March 4, 2014"}, {"Title": "Decent camera for the price.", "Author": "Annie Smith", "ReviewID": "R2XC5I0E9L6KDI", "Overall": "3.0", "Content": "Purchased this camera to take on a backpacking trip through Europe.PROs: lightweight, portable, easy to fit into a small purse or pocketCONs: compared to a DSLR or larger lens compact camera - picture quality is not the best, lens got a tiny amount of sand in it towards the middle of the trip causing the camera to consistently malfunction until it eventually stopped working altogether", "Date": "February 22, 2014"}, {"Title": "Nikon COOLPIX camera", "Author": "bevandalan", "ReviewID": "R1IPRW027P70I8", "Overall": "5.0", "Content": "I love this camera, this is actually my second one.  It takes great pictures and fits easily in my small purse.  The video's are also very good.  Highly recommend this camera.", "Date": "December 31, 2013"}, {"Title": "Great Camera!", "Author": "JD", "ReviewID": "R25FNVFE5M2CH5", "Overall": "5.0", "Content": "It's been 2 and half years since i purchased this camera and i must say it's almost as the first day, beside a couple of scratches, it works perfectly. I use it almost everyday, its compact size lets me carry it in my bag or my pocket! Very comfortable to carry and use and gives a great image quality, i can't complain.As the owner of a DSLR camera that i usually can't take with me thanks to its size, this little coolpix covers my everyday need to capture the beautiful moments of life.I recommend it to everybody that wants a compact camera but at the same time demands high quality images, better than the average over the counter compact cameras.The only negative side is the absence of a manual mode, but its range of auto modes resolve most of the photographic situations  we all have to deal with.", "Date": "December 22, 2013"}, {"Title": "Do not buy this camera. Cannon is far better.", "Author": "eposner", "ReviewID": "R3DGYV7ZV79XO6", "Overall": "1.0", "Content": "Cheaply Made. Plastic. Terrible Lens. I think Nikon should stick to making Lenses.I do not recommend this camera to anyone.", "Date": "December 11, 2013"}, {"Title": "the gears of the lens, \"jump some toohts\", bad desing factory!", "Author": "Miguel", "ReviewID": "R3T1IABZMVMVE5", "Overall": "4.0", "Content": "after arrouns 3000 pic, the gears of the lens, \"jump some tooht\", and then i can not open it! bad desing factory!", "Date": "December 8, 2013"}, {"Title": "Definately do not recommend.", "Author": "Danielle Rice", "ReviewID": "R3199AJTF5T3PY", "Overall": "1.0", "Content": "We've had problems with our Nikon s3100 since owning it not 8 months. It basically will not do anything, now. When it worked, it was WAY too slow at focusing. My children were too fast for this camera.", "Date": "November 30, 2013"}, {"Title": "You Can Rely on Nikon for Quality it and Canon are the best !", "Author": "Paul R Skelton", "ReviewID": "R3J0WGYB1ZP9UU", "Overall": "5.0", "Content": "You can't beat Nikon !  The camera I got used looks and works like a new one it does not show any wear at all. I usually use a digital SLR with interchangeable lenses but wanted a smaller camera I could always carry with me and this camera fits the bill perfectly.", "Date": "November 17, 2013"}, {"Title": "Not so good.", "Author": "Sebas", "ReviewID": "R2LOENJ0RV04L5", "Overall": "2.0", "Content": "unfortunately it was not as expected. too much wearing signs and no charging cable included, it is expensive. Delivery took so long and no tracking info.", "Date": "November 14, 2013"}, {"Title": "Disappointed in this purchase", "Author": "Faith T. Miller", "ReviewID": "R4OICTZNGK1ZL", "Overall": "2.0", "Content": "not what I expected from Nikon. Too slow in actually taking the picture. Too many settings that aren't really helpful. Less settings that actually worked would make it much nicer to use.", "Date": "November 9, 2013"}, {"Title": "As expected", "Author": "Anup", "ReviewID": "RXPV0YBU2DKWO", "Overall": "3.0", "Content": "Works as expected. Is quite slim and sleek. Easy to grip and take pictures with. Worth a buy and can be an ideal gift", "Date": "November 2, 2013"}, {"Title": "Nikon Rocks", "Author": "JKMA", "ReviewID": "R3K49VSNP5CS5J", "Overall": "5.0", "Content": "Nikon Rocks...All my cameras are Nikon. They never let me down. Takes awesome pictures and the quality is great! Very slim to put in your pocket.", "Date": "October 17, 2013"}, {"Title": "Frequently fails", "Author": "Lori", "ReviewID": "R2NKB8W8QBDLLP", "Overall": "2.0", "Content": "I received this camera as a gift. Comments that this is not a point-and-shoot are accurate. Go to the Nikon website and read the instructions before you buy. I often have problems with blurry photos,off colors that look yellow or orange, too dark, etc. It seems to do fine on autofocus in daylight. Yes, these problems can be compensated for by adjusting several settings before shooting, but who wants to adjust the exposure and white balance every time they pull out the camera to shoot a kid's birthday party or pose in front of a landmark on a once-in-a-lifetime vacation? I go to events and see my friends shooting photos with their phones that come out better than this camera. Going to look for something else.", "Date": "October 14, 2013"}, {"Title": "won't hold a charge", "Author": "Judy Ingram", "ReviewID": "R3O4EIVQTOAJTS", "Overall": "2.0", "Content": "great pictures when I can get them. Batteries are Always going Dead. Replaced and Replaced again still no luck. I do buy the correct brand name batteries for this camera. Worst camera I have ever had", "Date": "October 1, 2013"}, {"Title": "Made a perfect gift!", "Author": "Michele Elliott", "ReviewID": "ROVHMDDVAI27G", "Overall": "5.0", "Content": "Bought this as a gift to replace COOLPIX S3100 that was ruined by being dropped in the sand. My stepmom was devastated as this was the only digital camera she understood how to use : (.  Nikon offered to fix at higher cost than purchase price?!?  Found the exact camera from Amazon used for $29.94 from seller Laredo CW.  This camera arrived on time and in great condition.  Can't beat the price...was totally amazed! Stepmom is one snap-happy lady and making up for lost photo ops : )", "Date": "July 1, 2013"}, {"Title": "Junk", "Author": "Rochelle D. Adkins \"Froggy Bottoms\"", "ReviewID": "R1TBT4AEKC2AJN", "Overall": "1.0", "Content": "I bought this camera after having a Cannon PowerShot A530 for 5 years.  After I lost it, I could not find another one just like it so since I was happy with my big Nikon SLR, I went with this camera.  I realized that while Nikon is a great SLR, their point and shoots leave a lot to be desired.I bought the camera before a beach vacation and I loved that it fit in my back pocket.  It was sleek and slim.  But the pictures were always blurry.  I could not just whip it out and start shooting.  I had to stop, steady the camera and zoom in and out until I was sure it was ready to shoot and it was still blurry.  The colors were noisy and bland.  This was a while just standing still.  So I knew that taking this camera to a concert would be a mistake.  It does horribly in low lighting and heaven help you if there was any backlighting.  The zoom only made the pictures look more grainy.  My pictures all came out like a drunk had shot them.After two years, I began to think about replacing this piece of garbage.  This camera ultimately made the decision for me because now, it won't charge at all.  I only use my camera in the summer, usually on vacation or outdoor events so I did not get a lot of use out of it before it died.I will recommend Nikon as an SLR but I highly recommend you think about a Cannon if you're looking for a small point and shoot.  I also recommend you get a point and shoot that takes AA batteries!", "Date": "June 29, 2013"}, {"Title": "Does the job", "Author": "Lnd Svyr", "ReviewID": "R18YRNS9OK31IU", "Overall": "5.0", "Content": "Would buy again. No complaints. Pretty good pics. Haven't printed too many but think at this 14 MP would look great.", "Date": "May 19, 2013"}, {"Title": "software issues....", "Author": "Alex Ghafouri", "ReviewID": "R26HG0SVYVT4FQ", "Overall": "2.0", "Content": "I like Nikon...however this is my second s3100...and after a couple month of use...you get a error message saying software error. I would stay away from this model.", "Date": "April 16, 2013"}, {"Title": "MARIBEL", "Author": "MARIBEL", "ReviewID": "RPGIT7CVGH7W1", "Overall": "5.0", "Content": "SI BUENÍSIMO ME ENCANTO,ERA LO QUE ESPERABA, SE LAS RECOMIENDO A TODO AQUEL QUE LE GUSTE LA MARCA NIKON, GRACIAS", "Date": "April 8, 2013"}, {"Title": "Broken when I got it.", "Author": "Gagagaga", "ReviewID": "R1DHX0KFOXZWKV", "Overall": "2.0", "Content": "This camera was already broken when I got it. I attribute this to it's poor quality. It was very, VERY lightweight which I don't think is a good trait in a compant digital camera because it just felt so cheap! And obviously it was. I promptly sent it back for a FujiFilm camera which I have had before and loved! FujiFilm cameras are great cameras and great deals!", "Date": "March 14, 2013"}, {"Title": "Good camera", "Author": "jorge perdomo", "ReviewID": "R2T5EQ3ZNJDCJZ", "Overall": "3.0", "Content": "I know it's not a expensive camera but i was hoping it would work better than it does. I think you can buy another one at the same price and could work better, doesn't take outstanding pictures.", "Date": "February 23, 2013"}, {"Title": "Perfect Camera", "Author": "Angie", "ReviewID": "R1JDQG6V95U7FS", "Overall": "5.0", "Content": "Arrived intact and in it's original package - nothing was missing.  Camera works WONDERFUL and my daughter really liked it - not heavy at all", "Date": "February 19, 2013"}, {"Title": "Very Disappointed", "Author": "tess0720", "ReviewID": "R12E5OPLYPMNVW", "Overall": "1.0", "Content": "Just a few months after purchasing this camera, we began to have difficulty getting the camera to open.  The battery was fully charged, and when the power button was pressed, the light would come on and make a noise like it was trying to open, but would not.  We have tried removing the battery and re-inserting it, but this does not help.  This has occurred numerous times, and we are now in the market for a different camera a little over a year later.", "Date": "February 11, 2013"}, {"Title": "Trash, junk, garbage", "Author": "John P", "ReviewID": "R2QX8O0577HAFF", "Overall": "1.0", "Content": "Bought one brand new for my wife.  Took it out of the box, turned it on, the lens opened, then closed and the LED display said LENS ERROR.  Put it back in the box, returned it to the store and was told \"We don't accept returns or exchanges on defective Nikon products, you have to contact Nikon directly\".  So I went home and called the customer support number in the manual.  They said \"This is a very common problem.  Just send it back to us, ALONG WITH $40.00 FOR SHIPPING AND HANDLING, and we will fix it. Throw in a box and a roll of bubble wrap at the UPS store and I've now spent $165.00 on a $115.00 camera and still haven't been able to take a picture.  I finally got it back from Nikon and it worked pretty good.  For about 2 weeks.  After that it refused to focus, and I threw it in the trash.", "Date": "January 21, 2013"}, {"Title": "Nikon Coolpix s3100", "Author": "Gary Telleck", "ReviewID": "R2RXN3UHDY8NF4", "Overall": "4.0", "Content": "Great quality and functions as expected from Nikon products. Purchased at a great price and picture and movie quality is very good in a small lightweight point n shot camera", "Date": "January 7, 2013"}, {"Title": "Great camera...for a while.", "Author": "Deebeaux \"Dave\"", "ReviewID": "R1W1Z5B1DCSD2M", "Overall": "2.0", "Content": "I bought a handful of these for our business. They are used in the field by personnel to take pictures of job site progress. We do not operate in harsh environments. The cameras work well for this purpose and we actually need to turn the quality down on them to make the photos a little smaller for our purposes. As far as a point and shoot camera they have all been good performers. It's obviously no match for my Canon DSLR, but for the money spent they are good value. I think we have 4 or 5 of these S3100s in our fleet and one of the newer S3300s. It seems at about the 4500-5000 picture range the lens motor ends up failing. It sounds like there is a stripped gear in it. Nikon has repaired 3 of mine under warranty so far, and the 4th one is sitting here on my desk waiting to be sent to repair. This one has a lens motor failure AND the LCD screen is completely white. I'm not sure if it's a defect of the S3100, but these were purchased over a period of time in 2011 (September, October, November, April 2012) from Amazon.com and as of this week every one of them has failed with the same failure method (lens motor clicking/jammed/stripped gear). Nikon has been excellent with the repair process. It doesn't even require a phone call. Just fill out a form on the web site and send the camera off with a copy of the receipt and you're good to go. The repair process has been a little slow, but I keep an extra camera around for just this reason. At the price, it's cheap enough to do. The S3300 (newer model) that we have has not yet exhibited this problem, but it is a good bit newer than the others (purchased in August 2012). Only time well tell I suppose. I definitely would steer clear of this older model if you're just trying to save a few bucks. The newer S3300 can be had for less money on Amazon.com, but then again, I can't promise that one doesn't have these issues as well. As I said, only time will tell.", "Date": "January 3, 2013"}, {"Title": "Quality camera", "Author": "C. Rodriguez \"chrrodriguez\"", "ReviewID": "R2ORQ9PZ6HTM5I", "Overall": "4.0", "Content": "I bought this one refurbished for about 30 dollars and I an quite happy with my purchase.I would recommend", "Date": "December 17, 2012"}, {"Title": "Great point and shoot", "Author": "Haruko", "ReviewID": "R3PL7BFP58S4QC", "Overall": "5.0", "Content": "This is a great point and shoot.  Exactly what I expect from a coolpix camera.  I love that it comes in different colors.", "Date": "December 15, 2012"}, {"Title": "Good product", "Author": "AB Commercial", "ReviewID": "R2DI00IWN8O2XL", "Overall": "4.0", "Content": "Simple and easy to use. A no brainer. Many new products (electronic) don't make it simple. Nikon in this case does.", "Date": "December 4, 2012"}, {"Title": "It's alright..", "Author": "Gazala Buksh", "ReviewID": "R370539R7O4RM4", "Overall": "3.0", "Content": "for an entry level point n shoot.  video quality is decent.It does not capture macro shots very well, so spend more money if macro shooting is your desire.", "Date": "December 3, 2012"}, {"Title": "Great camera!", "Author": "Shauna Siino", "ReviewID": "R3FXPPKBTHOCYI", "Overall": "5.0", "Content": "Bought this  as a Christmas gift and my mother loved it! It's a great size and very easy to use!", "Date": "December 2, 2012"}, {"Title": "Gift for my daughter", "Author": "Rodney Castro", "ReviewID": "R3E7FPTMSD2FEH", "Overall": "5.0", "Content": "I bought it for her JROTC camping trip. She loves it and continues to use it every day. One of the best purchases for her.", "Date": "December 1, 2012"}, {"Title": "Love it!!", "Author": "Mary Ann McLeod", "ReviewID": "RVM00OYVB42ZH", "Overall": "5.0", "Content": "I am a little technologically challenged and this camera is perfect for me.  Simple to use and even I can take great pictures!", "Date": "November 27, 2012"}, {"Title": "Nikon", "Author": "bernadette ombayo", "ReviewID": "R17XWYIHO4YS8K", "Overall": "2.0", "Content": "I thought i had what i wanted unfortunately not, after using it for only a month i realized that any SD-card can't work in it unfortunately i had left the country for summer vacations. I am either unlucky with Amazon or i don't know what am doing.", "Date": "November 24, 2012"}, {"Title": "product works great", "Author": "Roger", "ReviewID": "RMELY0Y1MKZDV", "Overall": "5.0", "Content": "very happy with product so far. works great. came when it was suppose to, in good shape.  happy, happy, happy", "Date": "November 17, 2012"}, {"Title": "For the Nikon Camera", "Author": "Shunkecia", "ReviewID": "RU7XN4C52YIZJ", "Overall": "5.0", "Content": "This product met my expectations to the fullest. It came in perfect condition and I do not regret buying this.", "Date": "November 16, 2012"}, {"Title": "Excellent", "Author": "Marielita", "ReviewID": "R26JUKS37MIAE0", "Overall": "5.0", "Content": "Camera repaired but in perfect condition. He brought all its accessories. Responsible seller and recommended. The camera is a beauty, very soft and has good image.Camera repaired but in perfect condition. He brought all its accessories. Responsible seller and recommended. The camera is a beauty, very soft and has good image", "Date": "November 16, 2012"}, {"Title": "Sad", "Author": "Thinking", "ReviewID": "R25PK9LKIO97M1", "Overall": "1.0", "Content": "Got this camera and thought it would be a reliable, decent camera for taking everyday pictures.First, it often takes pictures that are not focused properly, making them look like they are taken with an older, lower resolution camera.Second, the lens mechanism that extends the lens out when the camera is powered up began having problems working properly, the lens would extend only part of the way and then stop.Third, on sending it in for warranty service for this problem, they tried to claim that it was dusty, (it wasn't) and wouldn't even address the mechanical lens problem.  This makes a sham of the warranty, basically, their view is that if it is broken, it must be your fault, not a problem with their design.This will be the last Nikon for me.", "Date": "November 6, 2012"}, {"Title": "Useless Camera - Blurry pictures", "Author": "Sanjay Singh \"Sanjay Singh\"", "ReviewID": "R2F1CMYDSTFMJ1", "Overall": "1.0", "Content": "I would not recommend this camera. This is waste of money. I returned the camera after taking 7 pictures. They all came blurry.", "Date": "November 3, 2012"}, {"Title": "Great camera", "Author": "Jeninslc", "ReviewID": "R191IMP2G33Y3I", "Overall": "4.0", "Content": "I have had this camera for over a year. I use it to take pictures like everyone else. I recently started making YouTube videos (today) and I used the video for this (duh). It has great focus and everything was great. The only complaint I have is after 10 minutes it automatically stopped recording and I didn't know that it stopped. I'll have to keep an eye on the time and go through my videos faster. Love this camera though.", "Date": "November 2, 2012"}, {"Title": "Terrible Customer Service", "Author": "crystal", "ReviewID": "R3S6ULQ6E9KBLU", "Overall": "1.0", "Content": "The camera that was sold me is crap. Ive had it since Feb 2012 and am now having several issues with it. it wont charge/upload, i purchased a replacement usb cord then it said battery exhausted. purchased replacement battery. again it will not charge/upload pix. i am pretty ticked off. i was sold a camera that was listed as new and just recently found that it was USED. it had pix on the internal memory of people that i do not know. i am pissed, to say the least. i contacted 17th Street Photo before to ask about a replacement cord and was told \"contact nikon\" lousy customer service. DO Not BUY from 17th Street Photo [...]", "Date": "October 29, 2012"}, {"Title": "Camera broke twice in a year and  nikon refuses to fix it", "Author": "Cecile20010", "ReviewID": "R3ETSRO34S7VTZ", "Overall": "1.0", "Content": "First the battery would not charge, which technical support repaired for free (but we had to pay shipping). When I got the camera back, it only worked for a few weeks until a lens error message appeared. technical support claims camera has sand damage, which is ridiculous cuz i have not been able to use the camera since i bought it, let alone take it to the beach. They want to charge pretty much the same price i paid for the camera to fix it. the customer service has been very unresponsive. I am getting the camera back without repairing it. I am never buying nikon again.", "Date": "October 27, 2012"}, {"Title": "awful camera", "Author": "Katie", "ReviewID": "R26G9AQXNK24QQ", "Overall": "1.0", "Content": "The camera takes decent pictures, but it very fickle. It takes 15+ seconds between photos to recharge the flash, etc. Don't expect to take pictures quickly with this camera. It was a great price, but an awful product. I wouldn't recommend this camera to anyone.", "Date": "October 17, 2012"}, {"Title": "preschool camera", "Author": "Erin", "ReviewID": "R1RNAHCF5Z0P8B", "Overall": "3.0", "Content": "We purchased this camera for our preschool based on the info Amazon had listed about the product. It had an entire section about how it was good to use with children as it can capture movement and has a relatively fast shutter speed. We have unfortunately been disappointed with the long LAG time in between photos. We are either loosing the children's interest or the \"moment\" has totally disappeared by the time the camera can catch up. The pictures it takes are good quality and print well but it is a bit frustrating to wait for what seems like an eternity between each shot.", "Date": "September 11, 2012"}, {"Title": "It won't play video", "Author": "Sally J. Riggs", "ReviewID": "R2MV8ULFOJV0US", "Overall": "3.0", "Content": "I got this camera last Christmas and I really like the detail it captures. However, when I try to watch recorded videos on the camera, it lags, and then makes a buzzing sound. I have to remove the battery in order to start up the camera again. It plays video fine once downloaded onto a computer. And sometimes, the flash will blind out the object when I am trying to get a close up of something, but it's blurry if I don't use flash. Definitely better cameras out there.", "Date": "August 24, 2012"}, {"Title": "Great until you read,\"battery exhausted\", on the display.", "Author": "California Lift-Op", "ReviewID": "RMOG6ASRXRN40", "Overall": "1.0", "Content": "I bought this camera replacing a Kodak that had lasted over 4 years of snow skiing and riding wave runners. I received this camera and was happy at first. The still shots were crisp and the video was great. One morning I went to charge the battery and after about 1 hour I read,\"battery exhausted\", in the view screen. When I returned it, Nicon said it was from \"Customer Misuse\". It would have cost more than the original purchase price of the camera to have it repaired. Thankfully I had purchased an extended warranty through \"Square Trade\". They took the camera and refunded my original purchase price. I then purchased the Kodak EasyShare 14mgp 8X. Time will tell but the Kodak has already lasted longer than the Nikon Coolpix.There is a weak link in the charging system. Don't waste your money on this camera.", "Date": "August 14, 2012"}, {"Title": "Waste of Money + Memories", "Author": "ErikaRae", "ReviewID": "R2MWX45CHMIQJG", "Overall": "1.0", "Content": "It was time for a new camera, and this one was my type: compact, point and shoot. Well, it's compact, but it's not quite point and shoot. The camera does not respond well to taking a picture unless it wants to take a picture. Seriously, it is not just me. I've had friends use my camera and they always remark at how crazy it is.Not only does the camera not want to take when I say to, but at least half the pics I take come out blurry.I just want a simple-to-use camera to take simple shots and not have to worry about them coming out bad, but this camera did not do it for me. The only thing it has going for it is its looks and size. What a waste of money.", "Date": "August 11, 2012"}, {"Title": "Broken one", "Author": "lifegoster", "ReviewID": "R2PT1SZHAHKKHV", "Overall": "1.0", "Content": "The camera was broken after about 3 months. Sent it back to Nikon for repair. After 2 months, it did not work again. Do not bother to repair again for this piece of junk.", "Date": "August 1, 2012"}, {"Title": "Reliable camera", "Author": "Pramod", "ReviewID": "R3K3GGY9VK9O5B", "Overall": "5.0", "Content": "I highly recommend to buy if you are looking something in cheap. This is really very good camera and give you very clear pictures and lot more features.", "Date": "July 24, 2012"}, {"Title": "FORMAL COMPLAIN", "Author": "Yamila", "ReviewID": "R76A9451OCG4F", "Overall": "1.0", "Content": "To whom it may concern,I would like to express my disappointment towards such a remarkable company.  I bought this Nikon Coolpix the one I am sending the feedback for, and it has been really frustrating to notice two things after purchasing it:1) The item has no world wide guarantee, which is unacceptable.2) Just a month ago, I tried to turn on the camera and it did not work. A message on the screen showing \"Low Battery\" remains on the screen until now. I did follow the instructions of the first charge, and did let the battery fully uncharge a couple of times. Therefore, the problem was not developed here, but it was sold defective.My disappointment and frustration came when I tried to contact your guarantee help desk. I started searching for a local store here in Argentina and all of them refused to provide service since the guarantee does not cover other countries than the few listed on the brochure inside the box. Today, I see myself compromised to send this camera to an outside service store, for which I not only have to take care of paying all taxes and taking it to the post office, but also trust on your word that it will be returned to me as new and the money I spent for shipping it for service will be also refunded.How can I trust on your company, if you do business like this. How come you not provide world wide guarantee and do provide such terrible defective items. I do not understand. At the same time I bought this Nikon, I took a Canon camera, and guess what, they do have world wide guarantee and most important it is still working.I hope you have a good answer for this, and encourage you to pay more attention on what you sell because this ain't customer satisfaction at all.Look forward to your answer,Regards.", "Date": "July 24, 2012"}, {"Title": "Pathetic customer service from Nikon", "Author": "Graybiker", "ReviewID": "R2VSYLB0JYPL77", "Overall": "1.0", "Content": "We've had this camera about 6 months.  No issues with photo quality, but the 3-5 second wait between shots is just unacceptable. A couple of weeks ago the lens stopped opening when the camera was turned on.  We sent the camera to Nikon service and even though it was under warranty, they claimed the camera had \"impact damage\" (it's never been dropped) and refused to warranty the repair.  They offered to fix the camera for $102 which we rejected since we had only paid $99 for the camera in the first place.  You would think Nikon might offer an at cost replacement or some other accommodation to their customer.  But no.  Customer service is not their strong suit.", "Date": "July 21, 2012"}, {"Title": "Absolute Junk", "Author": "Tres Gooch \"Tres\"", "ReviewID": "R2XWOF3KLNWNLF", "Overall": "1.0", "Content": "I purchased the Nikon Coolpix as a small camera to carry around in my backpack.  When it arrived I was mildly disappointed in the quality, it just felt \"cheap\", but I guess you get what you pay for, I expected something a bit more rugged. The camera takes decent pictures, but is painfully slow.Furthermore after 6 months the lens jammed and after returning the camera to Nikon warranty for repair, they claimed that it was impact damage and thus not covered.  Which was completely untrue, the camera was stored in a hard shell case at all times and never dropped.  I was holding the camera when the lens jammed while turning it off.Unless you want to waste your money I would steer way clear of Nikon and their Coolpix cameras. And do not ever trust their warranty.", "Date": "July 10, 2012"}, {"Title": "Stay away!", "Author": "Malyssa", "ReviewID": "R17KQW534KB7ZF", "Overall": "1.0", "Content": "I bought this camera after reading some of the reviews. I will say that I do love the size. This camera has never taken good pictures. I've done some research, changed the settings, pictures still come out blurry. God forbid you have to take pictures in anything but bright light. Even with the low-light modes they turn out blurry. I haven't even had this camera for a year and it no longer works. I will never, EVER buy another Nikon camera. Spend a little more and get something with better quality.", "Date": "July 7, 2012"}, {"Title": "What happened to Nikon?", "Author": "Oren M. Powell", "ReviewID": "R1SCV65W6T9ADI", "Overall": "1.0", "Content": "After loving two previous Nikon digital cameras, I turned to Nikon again when I wanted a small, convenient-to-carry-in-my-purse camera. I am so disappointed; I doubt if I will buy Nikon again; after reading the reviews for their current offerings, I think Nikon has just dumped its market/customers for this type of camera.Every picture is blurred; some are only partially blurred, which does not make sense. Even after adjusting the settings, all indoor shots have a yellow to red cast which is not relieved by using the incandescent setting. Most pictures are grainy. The zoom is ineffective and doesn't always work at all.I have taken many award-winning pictures with my other Nikons and the older film cameras, so I really don't think it's the fault of the photographer. When I read the reviews for this prior to purchase I assumed the bad reviews were just people who couldn't take a good picture no matter what, and I apologize to them, because they were right! I doubt if this particular camera is just a lemon, since there are so many negative comments from others.Bottom line: Don't buy this camera! And believe the reviews...ADDED: Outside photos are a little better, but since both the supplied battery and the extra Nikon battery I purchased for backup died after about 50 shots each, it's hard to get an overall idea---except that this camera is beyond disappointing, it's just a total loss.", "Date": "May 24, 2012"}, {"Title": "unreliable camera", "Author": "Scott Stoltzfus", "ReviewID": "R3BX6XD7IPC42Z", "Overall": "1.0", "Content": "Failed with lens error when needed. Repaired under warranty. Two months later also failed with lens error when needed. No longer under warranty. Absolutely astonished with the unreliability of this camera. Sticking with Canon. Never had a problem with a couple of them.", "Date": "May 20, 2012"}, {"Title": "Sweet little camera!", "Author": "Greg C. \"Greg\"", "ReviewID": "RDO9NXBGOJZ33", "Overall": "5.0", "Content": "I saw this little camera with a really good price so I thought I'd try it and return it if I didn't like it. Well, this little gem won me over right away!For point and shoot it works better than the Sony I got for my wife at 3 times the price. In addition, its smaller, lighter, and the battery lasts forever. I charged it 2 months ago and it's still full bars.the macro function is spectacular. you can get really great close ups.The menus are easy to navigate and are very intuitive. I like the preset options and find them useful for special shots like nighttime long exposures.I can't think of anything missing on this simple, easy to use camera.", "Date": "May 12, 2012"}, {"Title": "Overall pretty good camera", "Author": "Canes5", "ReviewID": "R3AMX4R1WRE0AI", "Overall": "4.0", "Content": "This camera has a lot of good features...light, decent photos, good battery life, good video, nice screen. The only issue I have is you have to hold it completely still or you pics blur..no image stabilization unfortunately. Not quiet as good quality photos as my previous Canon point and shoots but I could not take dealing with regular batteries anymore as every Canon point and shoot I ever had eats them at a ridiculous speed. I would give this a b+.", "Date": "May 8, 2012"}, {"Title": "Can I give it -1 stars?", "Author": "S. Ozev \"Sule\"", "ReviewID": "RUD4X4UFBGE9Z", "Overall": "1.0", "Content": "I have been using digital cameras, all sorts of it for the past 20 years. I have never come across such a piece of junk...Where do I start?First of all, the camera itself does not work really well. It has a ton of modes (scene, portrait, face detection and focus, etc.). None of them really works well. 90% of the picture come out unfocused. Second, its response time is terrible. I have small kids. By the time the camera decides to take the picture, they have moved on. The only time it takes OK pictures is outside in the sun. Even then 50% of pictures come out of focus. I have tried all sorts of tricks to make it focus right, to no avail...As soon as it came, it started having problems. Two months into it, the camera would not charge. I sent it to Nikon for customer service. You have to pay shipping yourself even during the warranty period. Well, it came back with a note that they fixed it. Not really, I went out of charge again, and would not charge. I sent it again, they sent it back saying they could not find any problems. Really? I finally diagnosed one problem to be incorrect battery level indicator. It shows full until it completely drains and if you leave it be, it would not charge again (evidently completely draining battery is a bad thing).Lastly, the lens gets stuck. It is at a point where the lens isn't coming out 90% of the time. I am sending it one last time for repairs. I have already spent an additional $30 for shipping. I thought I was getting a good price on it. Well, not anymore...I would never ever buy another Nikon product. No matter the Amazon reviews. I understand that there can be sometimes defective products. But when there is one, you repair it right, or replace it. This is unacceptable.", "Date": "April 29, 2012"}, {"Title": "great camera for the price", "Author": "enforcer", "ReviewID": "R1XBR3A29Q0FDE", "Overall": "5.0", "Content": "This camera can not be beat for the price.  My kids have more expensive Kodak, Samsung and HP's with nothing but problems.  Will be replacing with Nikon Coolpix in the near future.  This is small enough to carry in my pocket on vacations without feeling like I'm dragging around a camera.  The cost on this model is also low enough that if by some chance it gets ruined I'm not going to be to upset.  Picture quality is great also with lots of scene settings to pick.", "Date": "April 23, 2012"}, {"Title": "great camera for the price", "Author": "smittypantz", "ReviewID": "RJ6LNNOUY4KNB", "Overall": "4.0", "Content": "I am very happy with the Nikon s3100. My favorite feature so far is the 720 video. Takes good pictures in any light. Very compact easy to take with you any where.", "Date": "April 23, 2012"}, {"Title": "terrible", "Author": "deedah", "ReviewID": "R1WI2YT8TXQL6M", "Overall": "1.0", "Content": "Blurry photos .... bought this to take on vacation and have very few pics to remember that week because almost all of the pics were blurry. We thought you can't go wrong with Nikon but this one is junk!", "Date": "April 21, 2012"}, {"Title": "Good for some events not all", "Author": "Camille", "ReviewID": "R1DHV0KAVYOM31", "Overall": "3.0", "Content": "Bought for a super good price and everything but it lacks some good qualities unlike some other cameras but like I said for a cheap price I'm not surprised. I bought it to help take pick of my daughters arrival so far it's good for up close subjects comes out super clear and really good quality but in other events( roller derby for example) it lagged getting good shots of the girls especially since we didn't have front row seats and they were moving alot but yea other than that it's a good camera just don't expect too much from it but can't wait to see how it turns out wen my daughters finally born :)", "Date": "April 18, 2012"}, {"Title": "Good bang for the buck", "Author": "Ryan Berry", "ReviewID": "R2DYZKXZSWS07F", "Overall": "5.0", "Content": "I bought this for just grab and go, idiot proof, point and shoot photography. I have to say I have been pleasantly surprised at the image quality and ease of use, especially for the price of the camera. The buttons, menus, and navigation are self explanatory if you have minimal experience using a camera. The only downside I would say is that the video quality, although 720p is not really anything to write home about. Although it can get the job done if you need to shoot a quick video. Overall if you want a cheap point and shoot for mainly shooting photos, and you are on a budget, I highly recommend this.", "Date": "April 17, 2012"}, {"Title": "Its just ok", "Author": "reddyinfosys", "ReviewID": "R2NUNCY8LLFPQD", "Overall": "3.0", "Content": "This camera is good in terms of looks and but not in terms of qualityOne main drawback is that it takes 3 to 4 seconds to capture the image after you click, this is annoying ..user does not even know what is going onbasically poor response time", "Date": "April 16, 2012"}, {"Title": "Huge disappointment!", "Author": "GP", "ReviewID": "RHIW105R5CEI3", "Overall": "1.0", "Content": "Nikon, are you listening?  I bought this camera as I've had a generally good history with Nikon products.  We bought a very similar Coolpix model for my wife.First, both have had their lithium batteries run down and we were forced to buy new ones at $20 a pop.  This is the SECOND battery in one year.  Nikon reluctantly sent me a free replacement when I complained that it was dead in one month.  We don't use the camera very often so for it to use up TWO batteries in a year is ridiculous.  It's like buying a printer and the company makes money selling replacement cartridges for the life of the product.  After 5 batteries, you've just paid double for this lousy product.Also, my wife hates the touch screen on her Nikon Coolpix compact.  We'll most likely dump both cameras in the trash and look at Canon or other models.So here we are, ready to go to a soccer match tonight and the camera won't even take a new charge as it's dead.  Don't buy these cameras!!", "Date": "March 31, 2012"}, {"Title": "BLURRY PHOTOS except for bright sunshine.  Don't buy this camera!", "Author": "DW in Astoria, NY", "ReviewID": "R1OVPSBPENL3CB", "Overall": "2.0", "Content": "The only halfway acceptable photos you can get are in bright sunshine.  Forget cloudy days and anything indoors including with the worthless flash.  Nikon should be ashamed of this product.I miss my Panasonic which took amazingly clear photos until it got fuzzy squiggles on 75% of the images.  This started after about 6 months so that more expensive camera was worthless too.I've bought two cameras in less than a year and I can't trust any purchase now.  Most cameras are are made by a couple factories in China so we all get the same lousy product.DON'T BUY THIS CAMERA!  And good luck...", "Date": "March 30, 2012"}, {"Title": "Complicated to Use", "Author": "Steven Yerow", "ReviewID": "R3KU1ESXKQJSZX", "Overall": "3.0", "Content": "I bought this because it had the widest angle for a mini camera and a large LCD screen.  I have found it to be very complicated and always have trouble getting to the correct menu to change various settings or pre-sets.  Often get blurry pictures, but not always and am not sure why.Maybe more practice will help, but I use it only a few times a month.  The wide angle is very nice to have, tho.", "Date": "March 29, 2012"}, {"Title": "Perfect, Simple Point-and-Shoot", "Author": "Jaime", "ReviewID": "R1OMQFHNJPG2OW", "Overall": "5.0", "Content": "Preface: I don't write reviews. I'm the person who searches model numbers to READ reviews before deciding on my purchase (which I did before settling on this model)...That being said, I love this camera so much, I HAD to write a review for the next me who comes along doing product research...boy am I glad I didn't let the negative reviews sway me. It helps that I got this camera and a 4 GB memory card for a smokin' deal (found it on clearance and redeemed reward certificates at a local retailer; paying next to nothing), but I would have paid full price for this bad boy knowing what I know now. It is ready to use right out of the box (after inserting the battery of course), has a blazing fast shutter speed in \"auto\" mode (which is exactly what I was looking for), takes clear pictures without any fuss or blurriness (first picture snapped was of my Jack Russell jumping from the ottoman to the couch, captured him mid-air and picture was sharp as a tack) , and is smaller and lighter than my iPhone. I'm no Ansel Adams, bought this camera to take on road trips, to ball games, and for general random picture taking (and mainly because I'm a little paranoid handing my iPhone off to strangers in public when my husband and I want a picture together). Bottom line: great little camera for the price.", "Date": "March 20, 2012"}, {"Title": "Great camera for the price", "Author": "Nancym8758", "ReviewID": "R2FQE9177YX6Z", "Overall": "5.0", "Content": "I bought this for my grandson's birthday and it is a great camera.  Picture quality is great and it is easy enough for an 8 year old!  Its small size makes it convenient to carry.  Overall, I love this camera!", "Date": "March 17, 2012"}, {"Title": "Great Product", "Author": "CINDY EPIFANIO \"guerrooska\"", "ReviewID": "RVV5NSK1X2A1E", "Overall": "5.0", "Content": "This camera came very quickly. It is of a very good quality and I am very pleased I was able to get this color.  It was impossible to purchase it at any other stores.", "Date": "March 13, 2012"}, {"Title": "Nice little camera", "Author": "Elaine \"Red Sox Fan\"", "ReviewID": "RKH2KMBZTS4IG", "Overall": "5.0", "Content": "I replaced my old Nikon CoolPix when the cost to repair the broken lens exceeded the cost of a new camera.  I really like this one.  It's much smaller that the previous model.  It took a while to get used to taking pictures without moving the camera and getting blurry shots.  But as I developed my technique it was much better.  The camera sits in my purse at all times ready for photo opportunities.  I love it.", "Date": "March 13, 2012"}, {"Title": "excellent", "Author": "angel", "ReviewID": "R1C8EPOXP7XAVA", "Overall": "4.0", "Content": "excellent camera, nice pictures. good  video, very  comfortable, good quality. la recomiendo. excelente camara, lindas fotos. buen video, muy confortable. buena calidad. I recommend", "Date": "March 12, 2012"}, {"Title": "NOT satisfied!!", "Author": "Dona", "ReviewID": "R114PVALBBWCZQ", "Overall": "2.0", "Content": "Beautiful camera and remarkably slim, but this product is not worth having. Pictures are blurry, especially when using zoom or flash indoors. I returned mine.", "Date": "March 2, 2012"}, {"Title": "Battery doesn't charge", "Author": "patriciamma", "ReviewID": "R1C3GNEUXHW7P9", "Overall": "1.0", "Content": "This camera is a piece of junk. I bought it for my daughter for Christmas. It worked for about an hour, and then the battery died. I followed the instructions to recharge the battery, but the camera had no power and wouldn't take a charge. I bought a new battery, new cable, and new power charger for the thing. When I plugged it in, the green light appeared on the back of the camera, and it charged up long enough for me to download the pictures my daughter had taken. Then it died again, and would not charge back up. A search online revealed that this is a common problem with this camera. I am sending the camera back to Nikon, but based on the experiences of other customers, I don't have much hope of solving the problem. What a disappointment. This was a total waste of money and time, plus my daughter doesn't have the camera she wanted so much. Nikon should stop selling this pricy, camera-shaped paperweight!!! Buyer beware!", "Date": "February 25, 2012"}, {"Title": "Nikon COOLPIX S3100 14 MP Digital Camera with 5x NIKKOR Wide-Angle Optical Zoom Lens and 2.7-Inch LCD (Purple)", "Author": "wearethesame890", "ReviewID": "R2P0MXEQ213FZ4", "Overall": "5.0", "Content": "I ordered this camera to use for taking pictures of my jewelery to post for sale on Etsy.com. I ordered it 11-28-11 and received it on 12-7-11. It worked fine for my first use on a hike around my local park. the secound time I used it was on new year's eve. half way through the night the camera shut itself off. I thought it was simply the battery being spent but soon realized that was not the case. The shutter was half open/closed and the ligths on the camera were blinking. I tried everything to trouble shoot the camera but eventually it jsut completely shut down with the apature still stuck.I contacted Amazon customer service the next day and within 10 minuets on the phone with a very nice represtative they had a order in for my replacement. I was informed that I should return the broken one with the box form the new camera once it arrived.  So I waited...and waited. After a while of it being in the \"has not shipped\" status i contacted Amazon customer support, this time via live chat. once again a spoke to a very nice representative who advised me the delay was due to in being out of stock (I had ordered a specific color so I believed that to be the reason). I was okay with waiting further due to that explaination.The trouble came later after it had been close to 2 months of waiting and I again contacted Amazon for a status update. Again a very pleasant representative was there to answer my questions. My main concern was that the replacement order had disappeared off of my orders page and I inquired as to the reason for this. It was determined that the order had been canceled...the reason behind this? It was that they were totally out of stock with these cameras completely. Apparently the third party seller ADORAMA Camera was not able to provide Amazon with these cameras any further. I would normally not hav had a probelm with this had I been notified of this in any way, shape or form...but I wasn't. Not by Amazon nor the seller. Also after the extensive wait and the many times I was told that they were working on getting the replacement out to me, I feel that I was just being moved throught the system.I thanked the representative for his ground work and kiindness in the matter, as he did send out a email for me to print out a pre-paided return label and offer a $10 promotion towards my account, and proceeded to ask if I may speak to a manager.  My conern in talking to the manager was a few things:  1)To place a formal compaint against this third party sller and that Amazon not work with them further  2)The camera that I ordered was still for sale on Amazon, if so why was it that I couldn't get a replacement in another color.  3) A smple return for my money was not acceptable to me after nearly 3 months of toil and still not hving the product I wished, promotion or not.So I spoke to a lovely woman for a while about my concerns and after some time we came to a conclusion of my devising. Since Amazon couldn't provide my with a replacement from the camera I ordered, nor providing it in a different color, due to the seller not being able to get the product to Amazon (I WOULD STRONGLY RECOMEND NEVER BUYING FROM ADORAMA!!), I suggested that they provide me with a different model of the same camera that was stocked, sold and shipped directly through Amazon (Nikon COOLPIX S6100 16 MP Digital Camera with 7x NIKKOR Wide-Angle Optical Zoom Lens and 3-Inch Touch-Panel LCD (Silver)(http://www.amazon.com/gp/product/B004M8SVEI). The manager agreed that she would go ahead and do a one time replacement for this product for my defective camera and also place the $10 promotion offered to me on the price as well.In conclusion, this whole matter has been a wretch, but after everything Amazon was able to come throught for me and satisfy my order by providing me with a product and not just a return and a rebate, which I am very greatful for. The seller ADORAMA is the worst I have ever dealt with and I would warn anyone against them. My faith is still with Amazon, even if there was a slight waiver, and I will continue to shop and buy from them, while being more careful of third party sellers.", "Date": "February 24, 2012"}, {"Title": "Broken in 34 days.", "Author": "Gina L. Campanella", "ReviewID": "R25EXNE7PI2CU8", "Overall": "1.0", "Content": "This camera took very poor quality photos (subjects looked like they were in a shadow or blurry) and on top of that the camera broke for no reason after 34 days.  I can't even return it because I am 4 days over the 30 day return policy.  I had a Fuji camera before this one that lasted for years but I thought I would try Nikon since they have such a good reputation.  I'll be replacing this piece of garbage with a new Fuji.", "Date": "February 14, 2012"}, {"Title": "just not good quality and takes poor pics", "Author": "GlowStarGI", "ReviewID": "R1V0GSQJEQ4NIT", "Overall": "1.0", "Content": "This camera just didn't take good pictures.  The lighting was always a weird color and usually too dark.  Also most pictures came out blurry so we had to take multiple of each photo just to get a clear one.  The camera itself feels very cheaply made, which it is based on the low low price.  I feel like I will break it just by pushing the buttons.  Thought I could save $70 but it just didn't work out.  This will be going back.", "Date": "February 12, 2012"}, {"Title": "I love this!!", "Author": "pinkgirl5", "ReviewID": "R2WDS0POV76D33", "Overall": "5.0", "Content": "I broke my previous Nikon and did not want to buy another (expensive, yet extremely nice) camera, so I settled for this one and I LOVE IT! It was the perfect price and takes fabulous pictures! It's small so it fits perfectly in my purse and not to mention bright so I could never lose it (except when my teenagers take it!). I would definitely recommend this camera for the average photographer (family outings, vacations, etc)", "Date": "January 21, 2012"}, {"Title": "Great camera with a great price", "Author": "Cheryl P. Williams \"Cheryl Williams\"", "ReviewID": "RHW0KPS14T5B3", "Overall": "5.0", "Content": "This is a great little camera with a vivid screen. It is easy to use, and super easy to transport.", "Date": "January 19, 2012"}, {"Title": "just what I needed", "Author": "Rachel", "ReviewID": "R1MOHJRMEWP8V5", "Overall": "4.0", "Content": "I bought the camera after I had lost mine because it was the best price and had the best reviews. I like it so far, it gets the job done. Especially since I use it for travel, going out and whatever else I'm doing. Nothing fancy.", "Date": "January 15, 2012"}, {"Title": "Great camera", "Author": "Douglas A Ingram", "ReviewID": "R1MTKGVWQDJYQS", "Overall": "5.0", "Content": "This camera is still a nikon.  High resolution and easy to use.  Bonus is that it also takes great video.", "Date": "January 13, 2012"}, {"Title": "Poor Design", "Author": "Walter Robert Stamper", "ReviewID": "R124GZUAL5EWKL", "Overall": "1.0", "Content": "The shutter button gets stuck so that the lens will not retract after taking a picture. When the battery is removed, the lens retracts, but immediately extends again when the battery is reinstalled. Eventually, the lens will not open or close completely and the camera becomes a throwaway.", "Date": "January 11, 2012"}, {"Title": "Lens Error", "Author": "Martha Drake", "ReviewID": "R19R3JEL5BBX9N", "Overall": "1.0", "Content": "I will never buy another Nikon product again because of poor customer service. This camera had a lens problem from the start.  When I used the zoom, a \"lens error\" meassage appeared and the camera shut down. I sent the camera to Nikon three times for a repair and the problem was not fixed.  The third time, Nikon said there was sand in the lens and could repair it for the cost of a new camera.  I filed a complaint and never received a response from the company.", "Date": "January 9, 2012"}, {"Title": "Nikon Coolpix s3100", "Author": "Susan B. Holt \"lib aide\"", "ReviewID": "R2JOD9VQMVWOLD", "Overall": "5.0", "Content": "We got this for our daughter for Christmas.  She is absolutely loving it.  It came quickly and in great condition.  I would buy from this seller again.", "Date": "January 9, 2012"}, {"Title": "I like this camera a bunch.", "Author": "Razornoodle \"Razornoodle\"", "ReviewID": "R2FUXAUGQGAN6P", "Overall": "4.0", "Content": "This camera is very easy to use because most of the functions in the menus are so well laid out you can figure them out without using the manual or dvd instructions. One of the best features is ease of movie making. The camera has a built in mic and I didn't even know it was there until I played back a recording of a local band that was playing. That tiny little mic records some very big sound. Great camera!", "Date": "January 8, 2012"}, {"Title": "INTERESANTE", "Author": "tomas mejia", "ReviewID": "R2GS4BS77TRX8V", "Overall": "5.0", "Content": "TODOS ME LLEGO jente SERIA A TIEMPO BIEN SIN NINGUN PROBLEMA empacado Lo recomiendo CIEN POR CIENTOS ESPERO LA OPORTUNIDAD receptor Experimentado SIENTO DE VOLVER A COMPRARLE", "Date": "January 8, 2012"}, {"Title": "Do not buy this", "Author": "Mike Lynch", "ReviewID": "R11SICM6D85PSW", "Overall": "1.0", "Content": "I bought two of these cameras - one for my daughter and one for myself as a carry around camera.Both cameras quickly developed \"Len error\" and stopped working after only a few months of light use.The lens will not extend from the camera body - likely due to broken internal gears.These cameras were not handled roughly.They are just poorly designed & built.Additionally, the photos we DID get from from the cameras before they broke are lousy.16mp is a joke.Jpgs are of extremely low image quality and appear to be made of \"Fuzzy pixels\"Poor low light images.No raw available.I actually came across this opportunity to write this review while looking for the online invoice.Cheap is cheap.No getting around it.", "Date": "January 7, 2012"}, {"Title": "Great gift", "Author": "Teapot Momma", "ReviewID": "R25QE2QBASWLK8", "Overall": "4.0", "Content": "I got this camera for my daughter as a Christmas gift. She is a young professional photographer just starting out and she wanted to have a 'point and shoot' camera to carry in her purse. This one is perfect! The color is an added bonus. The pixel rate is amazing for such a small camera. I know she's going to love using it and taking lots of pictures with it. Nikon is an excellent brand of camera and this one does not disappoint.", "Date": "January 7, 2012"}, {"Title": "Nikon coolpix", "Author": "David", "ReviewID": "R1UH6MV6OJT10Y", "Overall": "4.0", "Content": "Great product and excellent delivery time, good performance and pricing, photo quality its enough and size really helps to fit any pocket to transport it and be ready to use it.", "Date": "January 3, 2012"}, {"Title": "Always love Nikon", "Author": "twinstar523", "ReviewID": "R2NF7WCPK54EDP", "Overall": "5.0", "Content": "This camera is my favorite.  I have 2 of them and it takes great pictures and very easy to use.  Small, lightweight, handy and I carry it with me always.", "Date": "January 3, 2012"}, {"Title": "Cute fun camera", "Author": "J. Spencer \"movie lover\"", "ReviewID": "RHFFXUPVFHEFB", "Overall": "4.0", "Content": "This is my first digital camera and I like it.I studied the reviews before I chosethis one. It comes with a handbook and an online owners manual.The directionsare decent and the quality of the shots are very good.Another reviewer had issues withthe battery compartment latch,but I have no issues with that.My only issue is the littletiny latch that covers the place where the USB cable goes.That could be a little better.There is a CD with a photo program too.I haven't used it because they recommend at least 2GB of ram. I have taken photo's and uploaded them with the USB cable.I tried sticking the memory cardin the PC but my PC said it wasn't formatted.The camera instructions said not to formatmemory cards on the PC,so I used the USB cable and that worked great.", "Date": "January 2, 2012"}, {"Title": "Nikon COOLPIX S3100 14MP", "Author": "Thomas F. Bock \"roadduster\"", "ReviewID": "R2RM8KPHATYTBR", "Overall": "5.0", "Content": "This is my second Nikon COOLPIX S3100.  This camera is so easy to use, and functions perfectly for point and shoot situations.  Very small and easy to carry, and downloading is simple.  Easy to understand how to take the picture you want.  Would recommend to anyone who wants to push the EASY button when it comes to picture taking.", "Date": "January 1, 2012"}, {"Title": "Blurry and dark", "Author": "Camera Chic", "ReviewID": "R1YKMHXRT9TVDJ", "Overall": "2.0", "Content": "I got this camera just to have a basic point and shoot for a trip I was taking and I didn't want to haul my D-SLR around. This was quite a disappointing purchase, and I had to return it. I did an involved test shoot as soon as I got the camera, and I'm not sure if it was just this particular camera, but it did really poorly. I did a test shoot of a single stationary subject, took a few dozen shots, and each one turned out differently and disappointing.  The flash was inconsistent and failed to light the subject properly in the majority of the photos. The rest of the pictures were blown out because the flash was too bright. It was almost impossible to get the camera to focus... it would appear focused in the view screen, but the picture was blurry. I loaded the pictures on my computer to verify that they were, indeed, blurry. I'm not really sure what this camera's problem is, but it was a waste of time and money to buy it. I love Nikon, but this camera is not good.", "Date": "December 30, 2011"}, {"Title": "Nice", "Author": "Factfinder \"Factfinder\"", "ReviewID": "R1HT4559GJKSAZ", "Overall": "4.0", "Content": "This is a great camera, easy to operate and has nice features for the price. This version is updated from the older S3100 since the megapixel count is higher. I was forced to add more words by Amazon even though I said all I wanted or needed to say in one sentence.", "Date": "December 27, 2011"}, {"Title": "Color is Off/Returned Camera", "Author": "Texan Cowboy", "ReviewID": "R2UQGAOZQNV6EL", "Overall": "1.0", "Content": "This camera takes awful pictures at night or in low light. The picture looks overall orange and the quality of the photo is cheap. I returned it within two weeks back to the store.", "Date": "December 26, 2011"}, {"Title": "Better features for the price", "Author": "Keviv", "ReviewID": "R2732ZCDL9AAK7", "Overall": "5.0", "Content": "I just got this recently and i'm happy with the picture clarity with so many modes for taking a pic and quick.Its better deal for the money..", "Date": "December 21, 2011"}, {"Title": "It is great!", "Author": "K. Hopkins \"K Hopkins\"", "ReviewID": "R3B841T631Y3HM", "Overall": "5.0", "Content": "This little camera is perfect for me and my amateur photo shots.  I had an earlier version of the Coolpix and lost it :(  I had loved it so I wanted another one.  Someday I'd like to upgrade to a more expensive model but this one is great for now.", "Date": "December 20, 2011"}, {"Title": "GGKATZ'S Review of Nikon Coolpix S3100", "Author": "GGKATZ", "ReviewID": "R2XENI9EQD8R9W", "Overall": "4.0", "Content": "This is my second Coolpix - dropped the first one while lens was open and jammed it.  This is a newer model than last one and I still like Coolpix a LOT!", "Date": "December 17, 2011"}, {"Title": "Don't waste your time", "Author": "H. Lakin", "ReviewID": "R29TUZ3DGNBG8O", "Overall": "1.0", "Content": "I bought this camera during Black Friday sale at Target this year. It was on sale for $99. I didn't really read up on the camera or check out reviews but decided to give it a try. I've had it for almost a month, and  I'm returning it today. I'm not a professional by any means, I just wanted a nicer point and shoot camera. Forget about taking pictures in low light, forget about taking a good picture with out trying over 5-6 times, the LCD screen is very blurry and looks and feels cheap. While it is small and easy to take along, that is about the only good thing I can say about it. The only decent shot I got out of it was in direct light out side of still objects, so if that's all you're going to be using it for, then I'd say go for this camera. However, I know I can get a better point and shoot for around the same price.", "Date": "December 16, 2011"}, {"Title": "Intolerable lack of focus", "Author": "xi'an", "ReviewID": "R2PDALZ77BRVC7", "Overall": "1.0", "Content": "I bought this camera in New York after forgetting my old (10 years old) Canon first digital camera in a New York taxi... This was an unfortunate choice as the quality of the pictures provided by this camera is very poor. Unless there is a lot of natural light, the pictures come out dull and flat. Furthermore, as soon as one uses the zoom, the camera looses its focus abilities and most pictures come out fuzzy and unusable. The ridiculous number of scene options (landscape, sports, dusk, kids, pets, ...) is useless given the poor quality of the autofocus. In addition, it is unbearably slow, both in taking pictures and in transferring them to my computer. I do not see any reason to recommend this camera.", "Date": "December 11, 2011"}, {"Title": "Nikon COOLPIX S3100", "Author": "RavenzFthr \"Joanne\"", "ReviewID": "RVSEAYL0ZPWWE", "Overall": "5.0", "Content": "This camera is great. A little slippery for my fingers, but easy to manage. The web page for downloading is still confusing to me. Trying to send it elsewhere for retrieval and saving. Not user-friendly at all. The camera fixes the pic when you look at them after taking so they are not blurry. I like it a lot!", "Date": "December 11, 2011"}, {"Title": "ATROCIOUS!", "Author": "eJud2001", "ReviewID": "R22D764Q1YVCS2", "Overall": "1.0", "Content": "Wow! Absolutely atrocious video! I did not know it could be this bad! The HD (720) looks like bad 320 blown up to fit a 720 screen!I will post my test vid on Youtube ejud2001 because unless you see it, you would not believe vid can be this bad!Still images are okay- but nothing to stand out from any cheap camera. Totally surprised what a disappointment this is! Wow.", "Date": "December 9, 2011"}, {"Title": "Meh", "Author": "Jen", "ReviewID": "R2QGV4XBWGQ26E", "Overall": "2.0", "Content": "I needed something small and easy that I could use on days that I couldn't haul around my big DSLR as I had recently broken my older Point & Shoot. So when I saw this on sale for less than $100 I went for it. For the price I paid, it's probably okay but I give it 2 stars because I wouldn't recommend this to a friend and given the chance again, I wouldn't buy another one. Assuming that you're in the right light already, and that your subject isn't moving much, the pictures this takes are great. Outside of these conditions, this camera is pretty useless. The image stabilization on this is pretty much non-existent and it's horrible with lighting. It's terrible at correcting the white balance for indoor lighting and it picks up yellowish light where there isn't any. The flash is horrible too. Its too bright and has a tendency to completely wash everything out and there's always red-eye. Plus if you leave it on auto, the flash will pretty much always go off. It takes good pictures in the daytime and in natural light but beyond that not so much. Focusing is also very minimal. If your subject moves at all while taking the picture, it doesn't adjust the focus resulting in fuzzy pics. So now I have a bunch of pictures where I made my nephew stop and pose so I could get a clean shot of him, and his face is focused but his hands are all a blur since he is a bit fidgety with his fingers.It's okay as a backup and I don't mind letting the kids play with it but I miss my old powershot. Also, it bugs me that I have to plug the whole camera in to charge the battery. What's the point of a removable battery if it doesn't have it's own charger? I hate leaving my cameras out where they could be knocked off the table by the dog and then subsequently stepped on by the kid chasing the dog. I prefer it when I only have to risk the battery by leaving it out to charge but maybe I should be glad for it this time because then I'd have an excuse to replace it.I wouldn't rely on this camera to take care of all the important moments in life but if you're looking for something purse-sized for non-essential events this will work. I wasn't expecting it to take pics as great as my DSLR but my old P&S; from 4 years ago would still have outperformed this one. For the price, this would be good for a child or someone who only very seldom takes pictures but if you're going to buy this as your main camera I would skip it. Shell out an extra $40-50 for a better model.", "Date": "December 8, 2011"}, {"Title": "Cool Pictures", "Author": "Aw3som3Mom", "ReviewID": "R1TWF2KRXM1MK2", "Overall": "5.0", "Content": "Great little camera with 2 problems.  1) Did not come with Sim card; 2)Doesn't save to card I insalled.  Difficult to plug in computer cord as well.  Takes good pics, tho.", "Date": "December 8, 2011"}, {"Title": "Coolpix Camera", "Author": "Bet", "ReviewID": "R3JMTSH68K87V1", "Overall": "5.0", "Content": "I like the coolpix series of cameras.  I have had a few of them and given them to my grandchildren. They are easy to operate and take great pictures.  I would recommend this camera to anyone.", "Date": "December 7, 2011"}, {"Title": "Great Camera for Great Price (even beat black friday sells price of item)", "Author": "Picture Perfect", "ReviewID": "R13BWGFN5SLCP9", "Overall": "4.0", "Content": "Purchased camera for Father's xmas present! He is going to be so excited! This is just what I was looking for. Thanks Amazon for again delivering a great item!", "Date": "November 28, 2011"}, {"Title": "LOVE IT", "Author": "misschynna2010", "ReviewID": "R1M2H7W60QP5YC", "Overall": "5.0", "Content": "Im soo happy i orderd this! its soo amazing. its a good camera, battery is long lasting & rechargable so i dont have to go out and buy any.", "Date": "November 28, 2011"}, {"Title": "great camera!", "Author": "lili", "ReviewID": "R1VRUVQ8731JKX", "Overall": "5.0", "Content": "This camera ended up being a really great choice for me.  (The secret to it's general great functioning was that I put a Class 10 Card in it.  I did not have the lag in functioning that is mentioned in many poor reviews.)  Some of the other  negatives that I read in other reviews were very true (1.  it's slippery -- but I have little hands and once I got used to it I learned to grip it well (and I forced myself to use the strap); 2. it is hard to get a really good photo close up -- but I could live with that;  3. I do wish it had a zoom that goes closer up...oh well;  4) it is sometimes hard to get a clear photo, but with practice and trying different settings, and taking multiple photos --film is cheap nowadays-- I was able to get tons of really nice photos anyway; I also found that many times the flash washed things out too much).For a small, very light-weight, easy-to-use, reliable, inexpensive camera, this was a really great buy (in spite of it's drawbacks).  And I wasn't walking around guarding it all the time.  I used it and took about 7,000 photos on my trip! and it still looks/acts new.Also, I was able to easily video a swim meet in Italy that came out perfectly beautiful!!  (I attribute that to the Class 10 card.)PS:  I did not want the new touchscreen (just another thing that can break, plus I wear sunscreen on my hands, etc).", "Date": "November 27, 2011"}, {"Title": "Love this camera!", "Author": "Lindz", "ReviewID": "R2F796BI5L6F24", "Overall": "5.0", "Content": "This is my third Nikon Coolpix camera and I love them!  This camera is lightweight and easy to use.  The different filter effects are fun to play around with and the placement of the video record button is so convenient!  The picture quality is great and I love that they also incorporated a \"delete all\" feature.  Definitely a great camera and the price is also great.", "Date": "November 23, 2011"}, {"Title": "Russell", "Author": "Russell", "ReviewID": "R3K0N6194V7ZKN", "Overall": "4.0", "Content": "Camera showed up on time and was as advertised.  The ease of use and the clear pictures makes this a good product for the uninitiated user.  We've down loaded pictures to our computer with little to no troubles.", "Date": "November 17, 2011"}, {"Title": "Best Camera Ever", "Author": "Maddie White", "ReviewID": "R26VFFKJ9EZ3JO", "Overall": "4.0", "Content": "This is the best point and shoot camera that I have ever owned.  It is easy to use, the pictures are clear, it's all-around very user friendly and very compact.  This was a very good Amazon purchase and arrived right on time to catch the fall colors.", "Date": "November 2, 2011"}, {"Title": "Easy to use", "Author": "Sharon Koleski", "ReviewID": "R2CG8910ZPTAKM", "Overall": "4.0", "Content": "Great price, easy to use.  you will still need a sun shade for this camera.  Has taken great pictures for the price on two recent vacations.", "Date": "October 13, 2011"}, {"Title": "Works great, takes great pictures", "Author": "mdpadresfan", "ReviewID": "R35Y651YWKFWOE", "Overall": "5.0", "Content": "Used it on our trip to New Zealand. Took amazing pictures from standing still to moving in the tour bus. All round great product. Easy to use. Takes great pictures.", "Date": "October 13, 2011"}, {"Title": "seems like never give me any issues", "Author": "Six Pack \"Young Six Pack\"", "ReviewID": "RJGZYY4W7TNLD", "Overall": "5.0", "Content": "All my previous cameras have two commond issues. Battery runs out, I lost the camera and couldnt find it again.For this new one. I purchase their shiney red just to prevent the lost. They have so many color available. I can the color I like without worry about it looks girly. Since the color is so eye catching, I never forget to take it with me and its easy to find it in my house or car, you can never miss an red item when look for it. I purchased a red case on top of that.I had it for a few months so far, I did not use it as often, but I still did not charge the battery yet. Verus to the old one I had, it needs charging just like my cell phone. I am very please with what I got now. The slick look of it. I am beyond happy of what I paid for.", "Date": "October 2, 2011"}, {"Title": "Love it!!", "Author": "Jordan P. Kaiser \"J man\"", "ReviewID": "R1OC79KWQQKVJ2", "Overall": "5.0", "Content": "I've always loved the user friendliness of Nikon cameras. The interface is what I expect to work with. I'm pretty happy with the product.", "Date": "September 28, 2011"}, {"Title": "Great pics and features!", "Author": "Isis", "ReviewID": "R1PLYPXLXWEB6I", "Overall": "5.0", "Content": "I was looking for a small camera to take with me wherever I go in the City. Nothing too expensive and nothing too hard to use. My Nikon is great! I love the quality of the pictures and the ease of all of the cool features. Very affordable for the quality of the pictures! The larger more expensive Nikon cameras are of exceptional quality. The Coolpix S3100 does not disappoint!", "Date": "September 17, 2011"}, {"Title": "great little camera.", "Author": "John D Wilson", "ReviewID": "R38J33L9P3IOXJ", "Overall": "4.0", "Content": "Only have had the camera for a few weeks,but I think it's great . It's easy to use small enouth to carry in your pocket. I am 73 and find that I can use this camera without any trouble. One thing to keep in mind is that it is small. Big hands and little cameras dont get along well. Even so I realy like it.  john", "Date": "August 12, 2011"}, {"Title": "my review", "Author": "brianthenum1", "ReviewID": "R7XE5NPHGAZ0S", "Overall": "5.0", "Content": "Great camera. Good battery life, great night pictures in the right hands, day pics are pretty good. Definitely a camera I would recommend but not at NIKON.com price.", "Date": "August 12, 2011"}, {"Title": "great little camera", "Author": "lverb", "ReviewID": "R2R636W1ORX3X7", "Overall": "5.0", "Content": "Exactly the camera I was looking for--great, little size (fits in a pocket) and takes wonderful pix. We were going on an Alaskan cruise and wanted something that would take great pix close-up and distance. This camera has many, easy to use, settings and took beautiful pix. Also, easy to use with no learning curve!", "Date": "August 6, 2011"}, {"Title": "NIKON COOLPIX S3100", "Author": "mamatoson", "ReviewID": "R2WBI9BI472IGC", "Overall": "5.0", "Content": "I didnt get to use this camera for a long time since we broke it :) but what ever pics I could get out of it, were excellent quality the response time for the camera is good between previews and the camera mode, honestly I only used to buy olympus cameras but now I nikon will be the way to go, and amazon's return policy is excellent if you are not satisfied ofcourse, so yes I would recommend it to my friends.", "Date": "July 29, 2011"}, {"Title": "Great little pocket camera for the money", "Author": "Gaea", "ReviewID": "R1RXDIEFKLXY9O", "Overall": "4.0", "Content": "This is an excellent little point and shoot camera.  In addition to this little pocket cam, I also have a Cannon Rebel XTi.  As that camera is too big to carry around all the time, I often use this camera for friends' birthday parties, quick hikes, etc.  I have been surprised at the quality of photos this camera produces.  Occassionally, they are even better than the Rebel photos.  The touch screen is a great feature, and I like being able to scroll with the screen.  The memory card holds A TON of pictures.  I can go months without deleting.  The size is super convenient and fits in my pocket.  A few issues:  1 - You have to use your fingernail to scroll when using the touchscreen, it doesn't like finger tips.  Not sure that it would be of much use to someone with very short nails. 2 - I have not been able to figure out how to format the memory card from the camera.  I load all the photos to my computer, then delete the camera pics while I'm in the folder (on the comp).  3 - You have to charge using your computer or a USB port to wall converter.  There is no removable battery pack to charge (biggest drawback).  Overall, the value for the money can not be beat.", "Date": "July 22, 2011"}, {"Title": "New point & shoot.", "Author": "Juan el Americano \"neverneverrand\"", "ReviewID": "R2988OKJEHQ718", "Overall": "4.0", "Content": "I used this camera to replace an older Nikon Coolpix 3100. More pixels, less bulk, decent features for the price. I had only a few days to get used to the camera before a trip to Mexico. It was easy to figure out and I got some very acceptable pictures to remember the trip.For the money and its intended purpose (easy, quality point and shoot fotos) I am very satisfied with the camera. The internally rechargeable battery is a nice feature and so far has done well holding a charge and taking plenty of pictures on a charge.", "Date": "July 22, 2011"}, {"Title": "Nikon let me down with this one", "Author": "Nicole", "ReviewID": "R354MNP2Y837R9", "Overall": "2.0", "Content": "I received this camera in hopes for a new camera to take to concerts. I love going to concerts and taking pictures, and my old camera, an Olympus Stylus 1010, has seen better days. Thankfully I brought both cameras with me otherwise I would have been infuriated. I honestly have never seen a worse powershot camera. No matter what setting or ISO I put it on, every single picture was blurry. I even put it on the sports setting and yet the shutter was so incredibly slow and nothing would even come out. The zoom is just horrendous, and on auto mode, the flash makes a person's face nothing but white wash.The only reason I gave this camera 2 stars was because the video is pretty decent, though I still had to mess with settings to get it to be that way. Do not have wind reducer on, then you just can't hear the video period. I had to adjust the brightness otherwise you couldn't see a think, and if you use the HD setting, make sure you have a HUGE memory card because my 2GB card only held about 6 minutes of video on the HD setting.I thought maybe it was just a bad concert camera. Nope, it's not so great otherwise either. I tried to take a macro picture of a lightning bug the other day. Wouldn't even focus on the bug whereas my Olympus focused instantly.I do enjoy the photo filters though, that's really the only thing about this camera that I do enjoy, that and that it doesn't take very long to charge this camera.I suppose you get what you pay for, but I honestly wouldn't even bother with this camera.", "Date": "July 13, 2011"}, {"Title": "Purple Passion for Pix", "Author": "CynthiaLuRN", "ReviewID": "RWNFGU904K73X", "Overall": "5.0", "Content": "Purple Passion for Pix~ so easy to use... so small it fits in my pocket, purse, hangs from my wrist... nice zoom! less intrusive... fun to play with & great pix!!!", "Date": "July 10, 2011"}, {"Title": "Great Gift", "Author": "GinPat", "ReviewID": "R21NK9M2BZFXB2", "Overall": "5.0", "Content": "Birthday gift for my 19 year old grandaughter -- she loves it.  Fits in her purse so she's able to take it everywhere --", "Date": "June 30, 2011"}, {"Title": "Cute and perfect camera for on the go", "Author": "Mrose", "ReviewID": "R3239OCCS983CM", "Overall": "5.0", "Content": "I got this camera as a replacement for a camera of mine that was stolen. I did a lot of research and couldn't be happier. It's small enough to put in your pocket if you don't use a case. The battery charges in camera, but you can take it out in case that battery dies if you have a second battery. I absolutely love it.", "Date": "June 25, 2011"}, {"Title": "Excellent", "Author": "aragua11", "ReviewID": "R2D8Q2RV0UP8HL", "Overall": "5.0", "Content": "Great, the best undoubtedly brought everything indicated by the publication, is great quality, has exceeded my expectations. Great buy. From Venezuela recommend", "Date": "May 7, 2011"}, {"Title": "Avoid this version of CoolPix", "Author": "Heidi C. Crockett \"kttopmom\"", "ReviewID": "R1CN04F7UFGVVM", "Overall": "1.0", "Content": "I had problems with the focusing mechanism of the camera from the moment I purchased it, resulting in consistently blurry photos. Those problems got worse and the optical zoom started malfunctioning.  The lens started sticking when I turned the camera on and off and worsened to the point I couldn't turn the camera on. The camera was still under warranty, so I sent it in to Nikon for repair. Almost 2 months later, I got the repaired camera back. The optical zoom works, but the focusing mechanism still doesn't work correctly. No matter what settings I choose, the camera has a hard time auto-focusing and many times simply can't focus on ANYTHING. The photos that I do manage to get are a little blurry and now they consistently have orange splotches on them, so now there's something wrong with the white balance or color management.I've owned other versions of Nikon's CoolPix in the past and really like some of the features, so I'm doubly disappointed with this camera. Given the other poor reviews, it seems like I'm not the only one.", "Date": "January 22, 2012"}, {"Title": "Hilda, Colorado, smart camera", "Author": "hilda", "ReviewID": "RN37C0GQINIW2", "Overall": "5.0", "Content": "Hi! I just received this coolpix camera, I was so excited but had doubts that this camera won't not be as good because of others feedback but, i want to see for myself. Now I have the coolpix camera I took a lot of pictures inside and outside the house, it turned to be the best camera I ever have. why because this camera is clear and antimotion protection. there are so many scene of this camera, I like the subject tracking mode this mode, will stablized your taking the picture even if the objects move. Like I let my son jumped, and it turned it was not blurry, even if I moved my camera while taking pictures. And when you use this mode try to use the flash. So I think people say about the feedback of this camera doesn't know how to operate. You have to experiment it to get where you desire.  This is my first Nikon camera, so the quality and clarity is the best.", "Date": "December 22, 2011"}, {"Title": "Nikon Coolpix s3100 review", "Author": "TylerRoseberry", "ReviewID": "RBPXZGATVOB7A", "Overall": "5.0", "Content": "This camera is great. I was a little worried that i was gonna end up disappointed but it came in less then 48 hours with standard shipping. The picture quality was stunning and i was very impressed. If your looking for a nice digital camera, the Nikon Coolpix s3100 is the way to go!", "Date": "November 13, 2011"}, {"Title": "Cute and perfect!!!!!", "Author": "amyk", "ReviewID": "ROJSVFIGA8YFH", "Overall": "5.0", "Content": "I am a non digital camera person.  TOO technical for me!This camera is a very user friendly and takes great pictures, plus it is very lightweight!!!!And with a company of Nikon, many years of great camera experience, you can't go wrong!!!!!", "Date": "November 8, 2011"}, {"Title": "charger didn't work", "Author": "Carlos A. Cotes Maya", "ReviewID": "R2L0ZY92LT36N9", "Overall": "1.0", "Content": "So I got my camera, everything was fine .. Until I tried to charge it and surprise! The charger didn't work, I was so disappointed because I couldn't used it anymore since I don't live in USA and Where I live is not easy to find spare parts.. What is the point to have a great camera if you can't used when you need it?", "Date": "October 9, 2011"}, {"Title": "excellent compact camera", "Author": "Mark Butler", "ReviewID": "R1C0SPSJTP8A06", "Overall": "5.0", "Content": "This is the third one of these I have bought, all for family members. I especially like the fact that the camera is rechargeable so no more batteries.", "Date": "September 21, 2011"}, {"Title": "Takes good pics but some drawbacks", "Author": "Joshua Hilsee", "ReviewID": "R1M1VO60GQU7D2", "Overall": "4.0", "Content": "I took less than 75 pics on this camera before the battery failed.A week in, the camera gave me some weird error message that wouldn't go away unless I plugged in the charger. It also randomly switched languages and DIDN'T HAVE ENGLISH in the settings to switch back to.Nikon's warranty states that it doesn't cover battery replacements. However, I sent it in along with the camera and they replaced it free of charge.Pictures are good - about what you would expect from a point and shoot at this price range. I shot one photo while walking out of a hotel into sunlight and it bleached the photo, but it was actually a cool effect.Not really much else to say. Good for the price.", "Date": "September 19, 2011"}, {"Title": "Nikon Customer Support", "Author": "James E. McKinney", "ReviewID": "RVOPEVNCOAIYZ", "Overall": "1.0", "Content": "I have tried in vain to download a printable Users Manual for the S3100. I made 7 phone calls today to Nikon customer support, all 7 sending me to Nikon USA website. There is no way to print the manual. It seems to me they want me to pay for a users manual, printed version. This may be a nice camera but I am returning it for a refund. Should'a bought American.", "Date": "September 13, 2011"}, {"Title": "great camera", "Author": "Daniel Batts", "ReviewID": "R1UHS7FPPX1UR4", "Overall": "5.0", "Content": "I have been needing a new camera for a long time and had been considering a larger nikon, but after seeing a friends smaller camera I started looking at those. The nikon s3100 has a great deal to offer in such a small package including a pretty decent zoom. There are too many features to mention here but the ease of use,excellent 14 mega pixel photos,make this camera a very good choice. I got a bundle price on a camera case that attaches to a belt and a 4gb memory card along with the camera. I paid less for all three including the shipping than if I had bought the camera alone in a department store. I would definitely suggest the s3100 to anyone who needs a pocket camera without a big budget.", "Date": "August 23, 2011"}, {"Title": "Don't Buy a Nikon Camera", "Author": "VMeister", "ReviewID": "R3B6CD7VQP59YJ", "Overall": "1.0", "Content": "I had purchased the S3100 camera in June 2011 and it failed completely less than one month later in July.  I sent to Nikon for repair and am still waiting for it - over three weeks later!  I have been told by an independent repair center that average time for Nikon is 3, 4 or more weeks.I had purchased this camera for my daughter and is the first Nikon camera in the family(thought I'd give it a whirl).  Traditionally I have purchased only Canon and have been very satisfied.  After this Nikon experience I would highly recommend buying a Canon instead.  I once experience a flash problem with a Canon P&S; cameras.  I sent it off to Canon for repair and got it back in working order within 5 days (includes shipping time from NY to Illinois)!", "Date": "August 15, 2011"}, {"Title": "An amazing camera!", "Author": "stoil", "ReviewID": "R168SX7M9RH8PX", "Overall": "5.0", "Content": "I bought this camera recently and I am 150% satisfied with it. It makes amazing pictures and it also has a HD 720p video. This is perfect value of the money.", "Date": "August 13, 2011"}, {"Title": "Impressive new technology", "Author": "G. Quigley", "ReviewID": "R18MPQ4YCRTGWQ", "Overall": "5.0", "Content": "Great little camera.  Takes pictures as well as any sophisticated, pricey camera.  We love the size...small, can be conveniently tucked away.  We like that there are color choices. Produces quality photos and operates with ease.  Can recommend this purchase without reservation.  We're not disappointed with the price or the quality.", "Date": "May 27, 2011"}, {"Title": "Don't buy this camera!!", "Author": "sparko", "ReviewID": "R170DXB40MS4UD", "Overall": "1.0", "Content": "I bought this camera in May and by the first of September it was broken....photos were blurry and the lens wouldn't open. I took it to a service center for repair and it has been almost 3 weeks now. They said it is on \"parts hold\" and no one can tell me when it will be fixed. I asked for a new camera and they won't give me on. Their customer service is HORRIBLE. I have done some research and it appears that the lens error problem is quite common with this camera. So I have no camera at the moment and will never, ever again buy a Nikon product. Never, ever.", "Date": "September 19, 2011"}, {"Title": "Died in 13 months, Nikon Coolpix S3100", "Author": "D. Seymour", "ReviewID": "RZDL46MBJALUP", "Overall": "1.0", "Content": "I had the Nikon Coolpix S3100 as a second camera and used it only 6 times and took very good care of it. During the sixth use it just died as I was using it. The lens would not come out and after recharging and trying everything I still cannot get it to work. It was past the warrantee by a month so I would have to pay a minimum of a third of the price, if not more than the full purchase price, to get it fixed ($29-$117).Incidentally, it is also a bit small for the normal woman's hands and can be difficult to hold steady as a result. I would not under any circumstance suggest this model. A friend who was with me that day has one as well and his camera was also reporting lens issues, although his still works. Stay away from the Nikon Coolpix S3100.", "Date": "January 26, 2013"}, {"Title": "I Like It", "Author": "97", "ReviewID": "R1165UD7I1L43", "Overall": "4.0", "Content": "Surprisingly very simple to use, and the picture quality is awesome any better and I'd be 3D. Lol! Only its curvature and front appearance slightly suggest it for a female, but that trivial in comparison with the upside.", "Date": "January 17, 2013"}, {"Title": "Excellent price", "Author": "julian", "ReviewID": "R1S5Q5GUJMSM9J", "Overall": "5.0", "Content": "The camera is not the best, but it takes great pictures and 720p HD videos. I was surprised by the price and we have been using it during this month and I feel satisfied with the results", "Date": "March 12, 2012"}, {"Title": "HORRIBLE PRODUCT", "Author": "Amazon Customer", "ReviewID": "R2NKHY2SVE57Q8", "Overall": "1.0", "Content": "This camera started having issues 6 months after I bought it. Lenses wouldn't open properly. A few months after that, it opened just a quarter of an inch, and refused to go any furhter. I figured out that if I pressed it in, it would extend fully. Eventually, even that stopped working. Yes, it had fallen on the ground on a few occasions, but that problem was independent of the falls. I sent it to Nikon, since it was still under warranty, and they claim warranty was voided because it had some very minor dents, and the a fall caused the problem. They charged me $100 to get it fixed, when a new one costs much less than that! Never again will I purchase a Nikon product.", "Date": "February 27, 2012"}, {"Title": "Not a fan.", "Author": "Amber", "ReviewID": "R30M99HNJUIJHR", "Overall": "2.0", "Content": "Don't get me wrong, the camera is super cute. My iphone 4s takes way better pictures though. Don't buy this, its not worth the money.", "Date": "February 23, 2012"}, {"Title": "Good camera - Bad compatibility!", "Author": "MrBankz", "ReviewID": "R3OBQFYPV8ELPN", "Overall": "3.0", "Content": "This camera does NOT work with the AutoPlay feature of my computer.  When connecting this camera to my Toshiba Laptop PC (running Windows 7) using a USB cable, the PC AutoPlay function does not recognize it.  I have spoken to Tech Support at both Toshiba and Nikon and no one can correct this problem.  It appears that this model Nikon camera is not compatible with some Toshiba laptops.  This is one of the few models of Nikon cameras that have never had a firmware upgrade, plus the driver is dated 2006, which is older than my Toshiba PC.  Since I can still download photos to my PC manually using the Nikon photo application, I decided to keep the camera.", "Date": "February 23, 2012"}, {"Title": "Pésima calidad de la cámara; excelente respuesta de Amazon", "Author": "Francisco Marquez", "ReviewID": "R3RB7KBV0G4GKG", "Overall": "1.0", "Content": "Compré esta cámara en noviembre del 2011, tres días después de recibida el lente se trabo, la apagué pensando que al encenderla funcionaría nuevamente, y nada. Solicité la devolución de mi dinero y Amazon tuvo una respuesta excelente. Mal por Nikon que ahora con tal de ahorrar dinero en producción de productos realiza trabajos defectuosos. Me decepciona la marca porque yo era un consumidor al tanto de sus productos, ahora lo pensaré dos veces.", "Date": "January 17, 2012"}, {"Title": "Camera review", "Author": "Alison", "ReviewID": "RDISLFX55MTUO", "Overall": "5.0", "Content": "When it came, it wasn't broken or harmed in any way. It works perfectly and the color is perfect. Nothing is wrong with this camera", "Date": "January 9, 2012"}, {"Title": "good bang for the buck.", "Author": "G.Nalezynski Jr.", "ReviewID": "R1OPHXWVWO0TJD", "Overall": "4.0", "Content": "good product for the price. battery last longer then expected before needing a charge.no more batteries to buy.easy features for kids to use.", "Date": "January 6, 2012"}, {"Title": "Returning it.", "Author": "KM", "ReviewID": "R1JY6FVJZURW7B", "Overall": "1.0", "Content": "I broke our Canon a few months ago when I dropped it on our tile floor.  So, we are in the market for a new camera and we've been agonizing over all the choices out there.  We want something durable, reliable, easy to use, without paying a lot, to take pictures of our 4 young kids.  I heard that Nikon made good cameras, which I am sure they do.  Just wasn't impressed with this one.  You get what you pay for, I guess.  I tried over and over to get pictures in focus.  None of the pics of my kids were in focus - of course, they are always moving.  So, I tried different settings and took pics of non-moving objects.  Still, most pictures were out of focus.  Frustrating.  Returning it asap.  I think we're going to have to spend a little more for the features we want.", "Date": "November 26, 2011"}, {"Title": "good camera", "Author": "breddymusic", "ReviewID": "R93C3UGJQE7WD", "Overall": "4.0", "Content": "this camera is very versatile, very good image is one of the best cameras I've seen in the market, quality and cost make it easy to reach very good camera ... I recommend them", "Date": "November 9, 2011"}, {"Title": "Good for what you spend", "Author": "CRiley10", "ReviewID": "R3FN0VCATRBUF3", "Overall": "3.0", "Content": "Ivory is because my iPhone and iPad pictures did not have the pixels I wanted. But I wanted to find something with good ratings and small and simple. My complaints are the same has most others, a lot of the pictures come out blurry, even on sports settings. However when I do get it not blurry pictures are good. I would suggest, if you can do spend a little more on a different camera. This will work good for us for now though.Conclusion. Good for simple still pictures. Not great for action and professional pictures.", "Date": "November 5, 2011"}, {"Title": "A PIECE OF JUNK", "Author": "T. L. Stickle", "ReviewID": "R3MRW2QG32NQMC", "Overall": "1.0", "Content": "BLURRY-BLURRY-BLURRY!!!WARNING: BELIEVE ALL THE OTHER NEGATIVE REVIEWS about the Nikon Coolpix S3100! After six years of hard use, my Canon Powershot finally died and -like a fool - I decided to go with something cheap and BOY! did I ever learn the truth behind that expression, \"You get what you pay for.\" Like other reviews mention, MAYBE one or twoshots out of every seven to ten taken are actually in FOCUS. I've never come across a digital still camera so completely useless in terms of its \"point-and-shoot\" (lack of)functionality. After having tried to use this camera for the last five months I realize that getting clear sharp images with it is an exercise in futility. This camera is a piece of junk and sadly lacks any quality whatsoever. Time to buy another Canon!", "Date": "October 3, 2011"}, {"Title": "Light and Nice", "Author": "Marco", "ReviewID": "R30LN7RBC2X5I7", "Overall": "5.0", "Content": "The best point and shoot alternative.It's affordable, nice zoom, nice colors.Fits in any pocket... you'll love it.Of course it's not the best Nikon I have, but for this price you can not get any better.", "Date": "September 28, 2011"}, {"Title": "disappointed", "Author": "Walter", "ReviewID": "R3RGOVGJHXGB4T", "Overall": "1.0", "Content": "when it came time to use the camera it wouldn't come on no life at all very disapointed am returning the camera", "Date": "September 27, 2011"}, {"Title": "Great price nice little camera", "Author": "Joshua Foote", "ReviewID": "R1O9RPAR0DQNYT", "Overall": "4.0", "Content": "The camera isnt perfect so I cannot give five stars but for the price the camera does a good job.  It is fairly grainy in low light settings but that is to be expected without a tripod and a iso setting for low light.  Other than that its very small and easy to carry around.", "Date": "September 21, 2011"}, {"Title": "waste", "Author": "Myrna Rodriguez", "ReviewID": "R387WMU4BB7438", "Overall": "2.0", "Content": "I'm really disappointed by the picture quality. Took me forever to get a good night shot. Pictures came out blurry...I wish I would've done some more research before purchasing this camera. A few extra bucks and a lil more time would've got me the camera of my dreams. I don't highly recommend this camera, focus is awful and its so hard to take night shots! takes good pics during the day other than that noo good.....", "Date": "September 16, 2011"}, {"Title": "Not as good as I expect it", "Author": "Jeff", "ReviewID": "RT4MSYQ51JWQV", "Overall": "4.0", "Content": "The design is very sexy and fuctions are all there and great. But the picture quality is not what I expect from Nikon. Maybe I expect a little too much.However, I would recommend it.", "Date": "September 11, 2011"}, {"Title": "Awesome Little camera", "Author": "ndallguy \"Blake\"", "ReviewID": "R3NB4XD1Y4FQ2X", "Overall": "5.0", "Content": "This will fit in your pocket and has more recording time and you really don't have to adjust anything. It knows if it's dark it's just a great point and shoot. Worth every penny for a 14 mp. I fot it for a little over a $100 bucks!", "Date": "August 28, 2011"}, {"Title": "Great Camera", "Author": "TPD", "ReviewID": "R2V9769TAVYO1Y", "Overall": "5.0", "Content": "Great Camera, works awesome, and easy to use and carry with you! very easy features to use! definitely recommend to buy!", "Date": "August 25, 2011"}, {"Title": "I LOVE MY CAMERA", "Author": "PEPI", "ReviewID": "R1I7VJC5E8I3XA", "Overall": "5.0", "Content": "I'M SO HAPPY WITH MY NEW CAMERA, ITS SO BEAUTIFUL, TAKE THE PHOTOS SO AMAZING, CLARITY, NITIDO... I RECOMMENDED FOR EVERYONE", "Date": "August 15, 2011"}, {"Title": "Lens Error?", "Author": "Kamlesh Desai \"Kamlesh\"", "ReviewID": "R1NS02SH8VKH6G", "Overall": "1.0", "Content": "I purchased this from a prominent retailer Croma, on 14th, and today- 21st, I have had to return it to the store for 'repairs.' The lens would open half way, and the motor then kept 'jumping' and refused to fully extend the lens to start up the picture taking.Its so frustrating that in India, the store gave me a '4 day ' return, but on Day 7,  it has reached Nikon Service Center.In the first week, I must say the camera has taken amazing pictures for its size, and its a very very good daylight performer. Clear and Crisp.But whats the point. Other web sites say its the cheap gear drive that engages and 'pushes' out the lens when the camera starts up that slips.The one star is for now having ZERO confidence in the camera.I love Amazon sitting in India for this very reason. I would have sent it back, and probably gone in for a Canon A 3200.", "Date": "April 21, 2011"}, {"Title": "Even for a cheap camera - performance is miserable", "Author": "Abekin", "ReviewID": "R3F3ORAPI85P9P", "Overall": "2.0", "Content": "I bought this camera looking for a portable point and shoot to take to family get togethers, camping and canoe trips and other places where my DSLR would be too bulky. I wasn't expecting amazing photos, but I was expecting passable quality. My girlfriend had just recently purchased a Canon point and shoot for the same purpose and her camera performed admirably, focusing quite quickly and even performing somewhat decently indoors.We'll start with the few good points. For such a cheap camera it seems reasonably well built and looks quite stylish. The bright blue case makes it hard to forget. The LCD screen in back is bright and works quite well. Controls are reasonably simple (but don't expect much in the way of manual control.)Now for the cons. This camera just doesn't perform well at all. Almost all photos with this camera come out blurry, it doesn't matter if it's a landscape, a person posing, or an inanimate object. Even high shutter speeds (1/200 or more), no zoom and low ISO will not alleviate this. It's just a fact of life with this camera that your photos will look grainy, fuzzy and you will never get sharp focus.The camera is also slow. It takes a long time to find \"focus\" but as mentioned above it's still blurry. There's a delay between depressing the shutter button and camera taking a photo. There's a long lag between taking photos. Deleting photos also takes a long time. Changing scenes can be a bit of pain since it requires using digital menus and doesn't seem to have any meaningful affect on pictures to boot. The macro mode is utter crap and I can't even take pictures of yarn with a tripod and excellent lighting without image blur.I vastly prefer my 5 year old Powershot A95 to this camera. I'd say stay away from it unless you enjoy blurry, softly focused images. For only $30-40 more you can easily get yourself a much, much better camera.", "Date": "October 27, 2011"}, {"Title": "THIS CAMERA IS GREAT U SHOULD BUY IT RIGHT NOW!!!!!!!!!", "Author": "R0Y F", "ReviewID": "RQJ0NE7N0D3NZ", "Overall": "5.0", "Content": "THIS CAMERA IS SOOOOOOO COOL IT TAKES GREAT PICS AND IF U HAVE SHAKEY HANDS LIKE I DO IT DONT MATTER CUZ THIS CAMERA IS SOO BA LOVE THIS THING HOPE TO HAVE IT FOR A LONG TIME.", "Date": "January 16, 2012"}, {"Title": "Horrible focus", "Author": "hcrm", "ReviewID": "R1LMC8JILX4702", "Overall": "1.0", "Content": "I bought this camera and I am completely shocked by how poor the focus is.  Barely any of the photos I take are in focus and nothing I do seems to correct the problem.  Completely unacceptable.  I wish I had paid more attention to the negative reviews on here because they are correct.", "Date": "November 24, 2011"}, {"Title": "Flimsy.", "Author": "Lilly Chase", "ReviewID": "R38GF3UV2J2K8T", "Overall": "2.0", "Content": "The camera was small, as expected, but felt flimsy and with the amount of pictures I expected to take with it, I felt it wasn't worth keeping.", "Date": "November 22, 2011"}, {"Title": "Far to slow between pictures", "Author": "Philip E. Scherry", "ReviewID": "R28G891VN21X2F", "Overall": "2.0", "Content": "It took 5 seconds between pictures.  Totally unacceptable when taking pictures of kids.  I am immediately returning this, and looking for something that has onboard memory.The 2year old Kodak we are replacing was able to take 3 pictures before having to sit and process.", "Date": "November 5, 2011"}, {"Title": "Not worth it...", "Author": "EKEA", "ReviewID": "R1QZOGU2CSAQ4L", "Overall": "1.0", "Content": "I really wish that I would have paid closer attention to the other reviews. I took this camera on my vacation to celebrate my graduation from college. I waited all year long for this trip to Central America with my family. While the picture quality is average, it moved way too slow between pictures and it froze very often. During our vacation, I was trying to take quick action shots of my daughter or mom, but the camera just wouldn't allow it. Because it moved slowly, I was not able to take good shots of concerts and plays that we saw. Even when you turned the camera on it takes a very long time to warm up to take a picture. After a frustrating week with the camera, I get home only to have problems uploading the pictures to my computer. I'm still not able to upload them. I thought maybe it was the memory card so I tried another one and it didn't work either. When I took the memory card to Target to print them out, many of them didn't save correctly and you can see the picture. I'm not very picky when it comes to a simple point and shoot camera. I just want something reliable and simple. But this camera is not worth it. Of course I got it from Walmart, and I can't find the recipe.", "Date": "September 9, 2011"}, {"Title": "Great Product as promised", "Author": "Kevin Short \"Kevin J Short\"", "ReviewID": "RNWIUKDDFNJVN", "Overall": "5.0", "Content": "This camera came as promised, shipped well packaged, performed as promised and has taken many pictures already posted on my Facebook page.  I highly recommend this product from this shipper!", "Date": "August 15, 2011"}, {"Title": "Coolpix Camera was a big disappointment", "Author": "Laura", "ReviewID": "R2HZ6JJJUGMBUA", "Overall": "1.0", "Content": "I purchased a Coopix Camera for my daughter for Christmas. She took one picture to try it out and turned it off.When she went to use it again the camera lens was stuck and wouldn't open.Now the camera is useless and I cannot return or exchange it, and now have to send it back to nikkon and pay for shipping and wait.We are very disappointed with this product and also with nikkons customer service. This is the first item I purchased on Amazon and I don't know how to even contact the seller", "Date": "February 10, 2012"}, {"Title": "It's the clarity, stupid!", "Author": "J. Hill", "ReviewID": "R19QOKQPTR8CQC", "Overall": "1.0", "Content": "This camera has a lot going for it.  It fails only at what it was intended to do: take clear digital images.  I took this lightweight, pocket-size camera on a trip out West and left my big old Canon back home.  I'm really sorry I did!  No matter how I programmed the camera, all of the images are blurry.  Also, the main menu software failed, so I couldn't change the date and time settings.  This has taught me to read the negative reviews first - I would never have bought this camera if I had.", "Date": "October 27, 2011"}, {"Title": "Great little camera ~ BUT ...", "Author": "Margaret Larmore", "ReviewID": "R3AUVK5K78XX4Y", "Overall": "4.0", "Content": "My 7 year old Coolpix 4200 is much easier to use. I like the new one but wish it had a viewfinder for bright light outside. The old one had one, so I didn't realize this one didn't until I received it. Bought it for a big trip to Europe this summer, so I hope I won't be disappointed when I start using it big time for once in a lifetime photos.", "Date": "May 3, 2011"}, {"Title": "Coolpix S3100 (Blue)", "Author": "South District \"DelDOT S/D\"", "ReviewID": "RF7HCBDOJWXS", "Overall": "5.0", "Content": "All of the employees are very satisfied with this camera; some have even gone out and bought one for their personal use.", "Date": "May 3, 2011"}, {"Title": "Nikon COOLPIX without memory card", "Author": "Mrs. Christine W. Roby", "ReviewID": "R3VL9O7E6IGSDC", "Overall": "3.0", "Content": "This camera has features we wanted at a good price and was delivered promptly.  The problem was THAT THE SITE DID NOT MAKE CLEAR THAT THE CAMERA WOULD ARRIVE WITHOUT ANY MEMORY CARD.  This was annoying because we did not realize it until we went to use the camera.", "Date": "March 13, 2012"}, {"Title": "This camera is terrible!!!", "Author": "Paul Isao Ferris", "ReviewID": "RLNZA1RBB9TOY", "Overall": "1.0", "Content": "I have used this camera exclusively for 3 different occasions.This camera is terrible. I was taking pictures at a concert last nightwith every different variation of the autofocus/no autofocus, zoom/no autozoom, etcto find the perfect combo. Took about 30 pictures and got them developed today..EXACTLY 3 came out that were NOT blurry. This camera is a complete wasteif you're not a statue taking pics in perfect conditions without the subject moving!Save your money and get a $30 camera instead of this thing. Complete waste of $$$", "Date": "December 18, 2011"}, {"Title": "xmas 11", "Author": "swnvb", "ReviewID": "RXDCYPOLG4GVU", "Overall": "5.0", "Content": "Shipped UPS which left it at front door. Arrived  complete and well packaged. Not sure of function as it is a gift.", "Date": "December 9, 2011"}, {"Title": "Excelent Camera", "Author": "Anderson", "ReviewID": "R2APN5G4G1CWYN", "Overall": "5.0", "Content": "Excelente cámara. Muy buena relación precio valor! Obviamente existen versiones superiores pero es una perfecta cámara de bolsillo! Extremadamente pequeña y manejable y con muy buen performance. La mejor disponible en un precio tan accesible.", "Date": "November 24, 2011"}, {"Title": "COOLPIX is indeed cool!", "Author": "Raj", "ReviewID": "R34RD5I7O0Q7I5", "Overall": "5.0", "Content": "After lot of web searches, I decided to go for this model. It turned out to be a good deal for the money.", "Date": "July 3, 2011"}, {"Title": "Great camera!", "Author": "Cathy Fowler", "ReviewID": "R1O75WCUEDOW3V", "Overall": "4.0", "Content": "I just got this camera today and so far I love it! I rated it as a 4 because I thought that the color (pink) would be a lighter shade. This is a great little camera for the price!", "Date": "May 11, 2011"}, {"Title": "Nice Camera", "Author": "A.Mills", "ReviewID": "R2Q6TDZFM1Z15V", "Overall": "4.0", "Content": "Very nice and stylish camera just thought it would be a little more durable maybe metal, not thin aluminum, but i do recommend it", "Date": "April 21, 2011"}, {"Title": "JW KREIDER", "Author": "JW KREIDER", "ReviewID": "ROKMWISAG62A8", "Overall": "1.0", "Content": "I BOUGHT THIS CAMERA A WEEK AGO.  THE CAMERA DID NOT HAVE A MEMORY CARD IN IT.  I HAD TO GO TO BEST BUY TO SEE WHAT TYPE MEMORY CARD IT HELD.  I WILL NEVER BUY ANY ELECTRONICS FROM AMAZON AGAIN, IF THE PRODUCT IS NOT COMPLETE YOU HAVE TO TO A BRICK AND MORTAR PLACE SO IT CAN BE USED.  I CALLED NIKON TO COMPLAIN, BUT THE \"TECH\" THOUGHT I WAS TALKING ABOUT GIGABYTES, BUT I WANTED TO KNOW WHICH TYPE OF MEMORY CARD IT TOOK.  BEST BUY SHOWED ME IT WAS THE SD/MMC CARD AND WENT FROM 2 GIGS UP TO 64 GIGS.  SHOP WHERE YOU YOU CAN DEAL WITH A PERSON AND GET THE EQUIPMENT FOR YOUR CAMERAS.  THE GUY AT BEST BUY GAVE ME A DISCOUN ON THE SUNDISC MEMORY CARD, AND TOLD ME HE WOULD CALL NIKON AND TELL THE \"TECHS\" TO ASK THE TYPE OF MEMORY CARD NOT THE SIZE.", "Date": "June 27, 2011"}], "ProductInfo": {"Price": "$139.73", "Features": "14.0-megapixel CCD sensor for superb image quality\n5x Wide-Angle Optical Zoom-NIKKOR Glass Lens\n4-way VR Image Stabilization System\n2.7-inch (230,000-dot) display\nEXPEED C2 for enhanced image quality and processing speed", "Name": "Nikon COOLPIX S3100 14 MP Digital Camera with 5x NIKKOR Wide-Angle Optical Zoom Lens and 2.7-Inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Xj2%2BxsL-L._SX300_.jpg", "ProductID": "B004M8SVBQ"}}