{"Reviews": [{"Title": "Careful: can't configure event logging using IE 9 or 64-bit machines!", "Author": "Amy V. Snyder", "ReviewID": "R1LZJ9I2EJVVC", "Overall": "2.0", "Content": "I like picture quality and tech support is very good, but I am returning the camera because I can't get event logging to work on my machine. I encountered two problems installing the camera, and problem #2 was the fatal one.Problem #1: Getting the camera up on my home network that is supported by an Apple AirPort Extreme router. I spent a few hours with a very responsive, dogged, tech support rep. After trying a number of different network configuration settings, he was unable to get the camera to join my network. Finally, I was instructed to re-install the same version of the firmware that came with the camera (v12). This did the trick, and the camera came up on my network.Problem #2: Getting ActiveX controls installed so I could configure event logging (ActiveX is required for configuring events, so you can't use Firefox, only Internet Explorer.) I was told to downgrade from IE 9 to IE 6, 7, or 8. But I have a 64-bit machine, and these older versions are incompatible with 64-bit. At this point, tech support threw up their hands, and informed me that TrendNet is \"working on this problem,\" and that an ActiveX fix is in the works. No timetable was provided, so I'm returning my camera.", "Date": "April 21, 2011"}, {"Title": "Easy to set up but poor colors", "Author": "AMC", "ReviewID": "R2E9L6V8FFY7LY", "Overall": "3.0", "Content": "Quite easy to set up using web browser (connect to your router using an ethernet cable, then look for its IP in your router admin). I'm running a trial with Evocam software for Mac OSX and the camera is supported by Evocam even though it isn't explicitly listed.Note that the camera does not support dual band wireless N on 5GHz frequency band, only 2.4GHz.My major complaint is the colors are very purple/grey/washed-out even in bright sunshine. So it's fine for motion detection, but may not be useful as a security camera if you can't get accurate descriptions from it.", "Date": "October 16, 2011"}, {"Title": "Great customer support", "Author": "RichCastillo", "ReviewID": "R3UZ56HHE2T3JG", "Overall": "4.0", "Content": "I have 5 Trendnet IP cameras throughout my home. For me, Trendnet REPRESENTS A GOOD COMPROMISE BETWEEN QUALITY AND PRICE. Not stellar image quality but good enough considering the very reasonable cost.While I would never have expected Trendnet to be a stellar performer in technical support, they have turned out to be just that. Setting up an IP camera is frankly no easy task even for a computer geek such as myself. Compounding that, I am a Mac user and such devices always seem to be Windows oriented. I got though to telephone tech support a couple of times with little to no wait time. Although it seems to be offshore (based on accents) the staff was very knowledgeable and helpful. They were able to answer all of my questions and took all the time necessary to walk me through firmware upgrades and the process of getting my cameras online.If you are new to security cameras the best way to go is with a wireless IP (Internet) camera. Frankly, it is the ONLY way to go. However, it is not completely wireless because you will still need to supply an electrical outlet to power the camera but that is a lot easier than running coaxial camera cable throughout the home. You don't need to purchase an expensive camera controller/recorder if you have a spare PC or Mac around the house that has been replaced by a new computer. You can dedicate the old computer to the cameras with the proper software. The computer needs to run around the clock and be connected to your home network. Actually, the Trendnet IP cameras come with built in software and built in web server but I prefer to have all of the cameras integrated into one software application running on a dedicated Mac.", "Date": "November 9, 2012"}, {"Title": "Good value and works great", "Author": "Mike", "ReviewID": "R3SRTJ1SBFGZ17", "Overall": "4.0", "Content": "Simple to set up - reiable - good quality picture - I have had a whole bunch of these cameras and they all work fine - the only small issue is the web interface sometimes is a little different from one camera to the next dependant upon the model year - this is abit strange as its allk sofwateware driven.  Also, sometimes the ActiveX live display doesnt work resulting in a required reset of the camera losing all your setting.", "Date": "October 2, 2012"}, {"Title": "Really good for the price", "Author": "JAB", "ReviewID": "R2B0JTSFN8JGWP", "Overall": "4.0", "Content": "Trendnet cameras are easy to setup and easy to add on.  I have 4 cameras now and each one has worked with no issues.  If I had it to do all over again I probably would have bought an all inclusive system with cameras and DVR bundled but was able to purchase one trendnet camera at a time.", "Date": "June 19, 2012"}, {"Title": "Best product ever....", "Author": "M. Pereira \"magon\"", "ReviewID": "R1XAT3YBZ1L5W3", "Overall": "5.0", "Content": "The TrendNet configuration is a little tricky but since I have 4 of them, I just copy the settings from other of my cameras and done !  It is a great, stable and reliable wireless camera. I am extremely happy", "Date": "February 10, 2013"}], "ProductInfo": {"Price": "$210.00", "Features": "Up to 4x greater coverage as compared to wireless g IP cameras\nNight vision of up to 5 m (16 ft.) and one-way audio\nProgram motion detection recording, email* alerts and more with complimentary software\nOne touch Wi-Fi Protected Setup (WPS) wireless connection\nSupport up to 640 x 480 pixels resolution at up to 30 frames per second", "Name": "TRENDnet TV-IP121WN SecurView Wireless Day/Night Internet Surveillance Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41sZSXvlS3L._SY300_.jpg", "ProductID": "B004UBPIRA"}}