{"Reviews": [{"Title": "Use Caution", "Author": "Livestrong1003", "ReviewID": "RDVPKRPO0P307", "Overall": "2.0", "Content": "It is a beautiful camera, small and lightweight.  It makes a nice sound when taking pictures.  I shot a series of pictures and compared them to a 5 year old 5 mp camera.  With no exceptions, this camera took poorer quality pictures.  All were grainy and darker.  Indoor pictures were especially poor.  I believe that the very small lens and poor optics do not allow for good quality pictures to be taken.  Zoom pictures were very poor.  I returned the camera.  Sorry.", "Date": "February 11, 2012"}, {"Title": "My wife loves it", "Author": "James E. Scott", "ReviewID": "R3OATQH8W0SQRN", "Overall": "5.0", "Content": "I bought this camera for my wife's birthday and she loves it.  She uses it all the time and says it take great quality photos.", "Date": "August 9, 2013"}, {"Title": "finepix 12.2", "Author": "murphy", "ReviewID": "R1K5D46P2UUZQ4", "Overall": "4.0", "Content": "This camera was purchased as an extra version of a camera we already own and like. The pixel level is higher than the previous model, but is the same otherwise.  We have been very happy with it so far.", "Date": "November 9, 2011"}, {"Title": "Worst product i have ever bought in my life", "Author": "505 doggie", "ReviewID": "REJVPIQQTO3X6", "Overall": "1.0", "Content": "I bought this product for $200.00 from best buy i was happy with the res and the zoom on the camera for the price. after about 6 months and 150-200 pics later it started to say card error to the point the camera simply wouldnt work any more just a orange screen tryed differt cards ate 3 SD cards . I did not do any thing to it, infact i worked in a camera shop for a year and a half. Maybe it was just mine that was crap camera. i will not ever buy a fuji film camera again but i will say that while it worked i was happy with the photo quilty but to think a spent over $1 per photo and i only have about 10 photos that are keepers that sucks.", "Date": "November 4, 2011"}], "ProductInfo": {"Price": "$362.99", "Features": "12.2-megapixel, 1/2.3\" CCD\n18x optical/6.3x digital/113.4x total zoom\n3\" color LCD monitor\nFace detection technology\nHigh ISO sensitivity (up to 6400)", "Name": "Fujifilm FinePix S2700 18x Wide Angle Zoom 12 MP Digital Camera(S2550 Retail Edition)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Z1-XUgnlL._SX300_.jpg", "ProductID": "B004H1RTMK"}}