{"Reviews": [{"Title": "Worth every penny", "Author": "TERESA", "ReviewID": "R2P7SQA6VKV2MK", "Overall": "5.0", "Content": "This is by far a great buy. After setting up the camera I was totally amazed at the resolution and clarity of the cameras! The lens in this camera is adjustable, from a wide range of view to cover a wide area, to a long zoom in for details.The camera does excellent in dark. It gives me bright, clear images of the faces, I can definitely tell who's coming. I recommend this camera because of the lines of resolution and it has more leds.", "Date": "January 8, 2013"}, {"Title": "Best Camera", "Author": "JJReview", "ReviewID": "RGC5E7L1N490X", "Overall": "3.0", "Content": "This is the first of 4 cameras I have purchased to replace older security cameras.  I decided to replace my older cameras after some one broke into my wifes car and we could not even tell if he was wearing a hat or a hoodie sweat jacket much less what his face really looked like.  I found this 700TVL Sony CCD II and love it.  The camera is 5 stars compared to the other 700TVL Sony CCD II I've purched.  My grass is green and my truck is bright red.  The other cameras the grass is more brown and my truck more burgandy colored without adjusting anything on the camera.  I did not pay much attention to the 9-22mm which I should have, I've found that I needed a 2.8mm which is the widest angle camera I could find to put over the garage to monitor 1 car and it is going to take 3 cameras to cover the driveway since I own a truck.  The microphone is a home made looking job plastic heat shrink no hard cover and no instructions on how to connect it which took me an hour to figure out to plug it in line like a christmas tree lights with the DC cable.  There is a blury spot in the top center of the camera that I cant seem to find any smug or scratch to clean.  I ordered a 2nd camera 2.8mm because the color and night brightness which is your \"LUX\" value is so good.  the new camera was missing the power supply.  So to wrap up the camera is the best one I could find for the price but they need to work on there quality control. Like no spots on the image,  Power supply with camera.  I never tried to contact the company to fix these issues I just moved the camera so the blury part was in the sky and had a old power supply.  I've found that all these company have issues of getting the orders correct,  whats the saying they always get you in the drive thru.  Good Luck!!!", "Date": "January 5, 2012"}, {"Title": "Huge improvement over the cheap IR package cameras", "Author": "DDS \"Lee\"", "ReviewID": "R1GW2I26GR28W6", "Overall": "4.0", "Content": "Used this camera indoors to replace a cheap ZMODO IR camera. Much better video quality and much better IR illumination. Not the highest mechanical qualities but a great camera for the price.", "Date": "February 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004R7Q4HK"}}