{"Reviews": [{"Title": "Pan Lumix DMC-fp7", "Author": "Luke", "ReviewID": "R1EWCKTPMGL8U0", "Overall": "4.0", "Content": "Compact, slick design, large 3.5\" touch screen.  I like the on-camera touch up features and the optical image stabilizer.  Small disadvantage is this camera records mono-sound.", "Date": "August 29, 2011"}, {"Title": "Very good camera", "Author": "christie5683", "ReviewID": "R135OHGC65M826", "Overall": "4.0", "Content": "This camera takes excellent pics.  However; it is a bit confusing with the settings and the instructions that come with it do not explain the camera very well. I have made 8X10 photos and they came out beautiful.", "Date": "November 13, 2011"}, {"Title": "Love this Camera", "Author": "Queenie", "ReviewID": "R30OBY6IRNSHA5", "Overall": "5.0", "Content": "I just want to say if anyone is looking for a Fabulous camera it would be this one. Easy to use great pictures ,Love the color and just all around awesome !", "Date": "June 12, 2011"}, {"Title": "Camera", "Author": "Fisher", "ReviewID": "R2KXDN1AEK6YV9", "Overall": "4.0", "Content": "I like the size and the touch screen function. I think for the price it should have a case. The photo software was only for Microsoft PC's and not for Apple products.", "Date": "August 11, 2011"}, {"Title": "not as advertised", "Author": "donnagreen", "ReviewID": "R2X2HX87KJBUBW", "Overall": "2.0", "Content": "I was intrigued by the cosmetic feature for retouching faces, but more than half the time when I try to use it, I get a message that there is no face to retouch.  This happens both with group photos, and single portraits.  Viewing photos on the screen forces you to use your finger on the screen to drag them, and there is no option to press a button to scroll through photos.  The ikons are not intuitive.  The color of the photos is not accurate.  All faces come out red and flushed looking, and the retouch feature does not remedy this.", "Date": "September 22, 2011"}, {"Title": "why this is a big disappointer", "Author": "Erstwhile", "ReviewID": "R241AQB9M9X2YM", "Overall": "1.0", "Content": "If you've read the description, you know about all the great features. I grant them. Also, the industry's new standard number for megapixels is now 16. Hurrah. The quality of the output - the clarity of the pictures taken - is the bone of contention here. Why not give us - say, 3 megapixels, but include a good lens?My old Kodak Easyshare is four years old, 8mp, about $79.00, but takes about 150% sharper pictures with more realistic color. The pictures of this Lumix model (it appears to be the top in its class; I doubt the less expensive models are better able to give us the reality we all seek) viewed full size on a monitor are chalky at best, but usually smeary, and nothing among its automated settings intelligence can cover for a camera lens that's just there to make the camera function, but can never make your pictures look good, but only gigantic in size and memory.If you want lots of features and toys among your microchip's talents, and a pretty high price, but don't care about the quality of the pictures you take, this is the camera for you!Speaking of price, I was proud of shopping around for the best price, having found it here on Amazon. Wal-mart would have been $212.00 without tax. However, now I need to send this back to 6ave through Amazon, and I'll get stuck with a %15 restocking fee, and all the trouble of repackaging everything, and shipping it back to them at my own cost. Then I'll have to keep an eye on my CC bill to be sure I see the refund in a timely manner.Bottom line, I should have paid extra at Wal-mart. I would have received a full refund without questions, and sometimes without all the package's materials. Nothing against Amazon or 6ave, but I hope I will learn my lesson here, and never buy another item online that amounts to over $25 or so unless I know all the dark secrets beforehand about a return policy.", "Date": "August 29, 2011"}, {"Title": "Great Camera, Great Price", "Author": "J. Fino \"J. Fino\"", "ReviewID": "R1PX1R6E0GG478", "Overall": "5.0", "Content": "This is a great camera and a great price, the best part is the lens cover in front, for an everyday camera it can be so easy to get stuff in the lens and this is really the key.", "Date": "January 6, 2013"}, {"Title": "Nice camera and fun to use", "Author": "Reid", "ReviewID": "RAZKO2R6AHLS4", "Overall": "4.0", "Content": "My daughter uses this camera and really likes it.  She would give it 5 stars.  The camera is easy to use and takes great photos.  It's easy to carry around everywhere.", "Date": "January 1, 2013"}, {"Title": "great camera", "Author": "Melody Jackson", "ReviewID": "R1F6G17IDAO3TE", "Overall": "5.0", "Content": "This is a great camera for the price. The pictures are very clear. The battery stays charged for a long time.The only thing is it states it is red, but it looks more pink to me. I am going to purchase another one for a gift.", "Date": "October 30, 2012"}, {"Title": "Post Purchase Review", "Author": "Vinnier777", "ReviewID": "R1ZL0VA1MV1EHH", "Overall": "5.0", "Content": "The camera is great. It's compact, easy to use and has a wide screen. Many of the feautures such as zoom, flash, focus, etc. are readily identified and easily used. The flip open/close is a great feature.", "Date": "September 17, 2012"}, {"Title": "Good little camera.", "Author": "Jo AnneTitchen \"Jo A\"", "ReviewID": "RUUIGOEUIQHJY", "Overall": "5.0", "Content": "Camera takes excellent pictures.  Shutter button is responsive.  Large screen makes it easy to see.  I haven't used all the features yet, just learning how to use the basics. I would definitely buy this camera again.", "Date": "April 23, 2012"}, {"Title": "Really nice camera for non-tech-savvy parents", "Author": "Pablo Osés", "ReviewID": "R1U20RPZMHCMDD", "Overall": "4.0", "Content": "The missing star in my rating is because the OSD interface is pixelated... Should have been nicer, with more resolution.That aside; really nice and compact camera !!", "Date": "August 14, 2011"}, {"Title": "great gift item", "Author": "gadgetcollector \"gadgetcollector\"", "ReviewID": "R11QQ42QRJQ5SQ", "Overall": "5.0", "Content": "Bought this refurbished it was a gift for someone and it worked like new as if it were fresh off the self! Quality was great and it made great gift.", "Date": "April 20, 2013"}, {"Title": "Panasonic Lumix DMC-FP7", "Author": "Sergey Andry", "ReviewID": "R13FBWOSKY20WG", "Overall": "3.0", "Content": "Camera looks good, but not met my expectations.  ISO just 100-400. Pictures are dark in low light.  MY PREVIOUS CAMERA NIKON P-1OO HAS ISO 6400.  Lens has no moving parts, because of its small zoom-4x. It's good-less lens' errors, but it's easy to make lens dirty by fingers, that effects quality of pictures.", "Date": "March 7, 2013"}, {"Title": "great little compact...", "Author": "Rockwell", "ReviewID": "R1EMWIMITNK7Z2", "Overall": "5.0", "Content": "Good quality pocket camera especially for use with close-in, low light situations.The flash & lens in this little unit are very well matched, and make quite niceimages from such a small camera. The 'slide' front lens cover also works welland adds to the quickness and speed of this pocket Lumix.Would very much recommend as a second camera when not wanting tocarry something large and bulky.", "Date": "January 24, 2013"}, {"Title": "Panasonic Lumix DMC-FP7 16.1 MP Digital", "Author": "Yoslen A. Bolivar A \"yoslenb\"", "ReviewID": "R1UYHAM98Z54KX", "Overall": "5.0", "Content": "MUY BUENA CAMARA EXCELENTE IMAGEN Y VIDEO LA COMPRE HACE 6 MESES Y NO HA TENIDO NINGUN PROBLEMAEXCELLENT VERY GOOD PICTURE AND VIDEO CAMERA SHOP MAKES THE 6 MONTHS AND HAS NOT HAD ANY PROBLEM", "Date": "June 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.1-megapixel resolution\n4x optical image-stabilized zoom; iA mode\n3.5-inch, 16:9 touch-screen LCD\n720 HD video capture; LUMIX Image Uploader makes it simple to share pictures on Facebook and video on YouTube\nCapture images and video to  SD/SDHC memory cards (not included)", "Name": "Panasonic Lumix DMC-FP7 16.1 MP Digital Camera with 4x Optical Image Stabilized Zoom with 3.5-Inch Touch-Screen LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/31FjoWDgrFL._SX300_.jpg", "ProductID": "B004HW7KAA"}}