{"Reviews": [{"Title": "A Great DSLR - Pentax keeps getting better and better", "Author": "C. Martin", "ReviewID": "R2LDSJ3DDX05WX", "Overall": "5.0", "Content": "I have been using the KR now for almost a week so these are my initial impressions.  The best way to describe this camera is a KR with several new improvements, though more evolutionary than revolutionary.My favorite new features are the improved LCD (higher resolution), visible AF point, faster live view focusing, faster shooting at 6 FPS and faster focusing in all environments, especially in low light though with the new AF assist lamp.  I cannot emphasize the AF capability in low light.  The KR focuses fast, even in almost total darkness.Another new feature is the capability to use AA batteries as well as Lithium ion.  It comes with a Lithium ion battery and charger to start.The image stabilization is still in body as Pentax has been doing for years.  This allows the use of many Pentax lens and still have stabilization.The high ISO capability with the KR is great as it is with the KX.  I had a T2i and find the high ISO capability better with the KR.  Plus the white balance requires less adjustment with the Pentax.  It seems like I was always modifying the white balance settings with the T2i.  This came as a shock to me knowing some of the white balance issues I have seen with Pentax cameras in the past.One of the coolest new features that I really like is the capability to convert the last JPG picture taken to RAW.  So let's say you take a picture and you cannot take it again (one time opportunity!) and the JPG was not up to par...You can save it as RAW and then convert in camera or in software later.  This is only possible for the last JPG taken however.The video will work in a pinch but is not the strength of this camera.  It is 720P and 25 FPS with no auto focus.  The T2i is better in this arena but I honestly never used it much.  Despite DSLR improvements in this area (especially with the T2i), I still prefer using a camcorder.However, the KR is a photographic tool and has lots of options once you start wanting to experiment a little more.  Get it with the 55-300 lens (great lens!) if you can swing it.  It is a great deal with the 2 lens kit and truly a savings versus buying it later.Pentax is often overlooked in the DSLR arena.  The KX has been a great seller for Pentax.  If you have one, I would not necessarily upgrade to the KR, though some of the new features are nice.  If you are looking for your first DSLR or possibly switching from another brand, I highly recommend the KR.", "Date": "October 31, 2010"}, {"Title": "Pentax K-r 12.4 MP Digital Camera", "Author": "Smeckatella", "ReviewID": "R3IEH0JQ0NM85Z", "Overall": "5.0", "Content": "This is my 5th Pentax Digital Camera. I currently own and use the Pentax K-r, K-x and K200. They are all exceptional cameras that produce stunning results with nominal effort. By far, the K-r has shown it superiority in rapid focus in low light conditions. The cameras are small, sturdy and perform as expected. The price for these entry level and serious amateur cameras is a bargain considering the superior results. Add a quality 2.8 prime lens and turn out photos to rival Cannon and Nikon at one-third the price.", "Date": "March 6, 2011"}, {"Title": "love my new camera", "Author": "Red", "ReviewID": "R31EDJ9EOUINYL", "Overall": "5.0", "Content": "I chose Pentax because I already have 2 Pentax SLR bodies and wanted to be able to use my lenses.  I chose the K-R over the K-X based on a lot of reading and what I thought was a good fit for me (and cost, too).I love my new camera!  I got it less than a week before a trip to Europe and am extremely satisfied with the photos I took without a chance to really learn the camera.  I am a total amateur and new to digital cameras, so when I say it is easy to use - it really is.My favorite features so far:exceptional low-light results - I can only say WOW!capability to use AA batteries as well as Lithium ion - I bought the AA adapter and had to use it in an emergency - so glad I had this as a back up to the lithium batteryCouple of reasons I picked this camera:said capability to use AA batteriesstabilization in the body not in the lensesI've taken a couple of thousand photos with it and am really pleased with the results.  I'm looking forward to really learning what it can do.", "Date": "June 26, 2011"}, {"Title": "Ultimately Frustrating", "Author": "Pub. Def. \"Pub. Def.\"", "ReviewID": "R1JL330U76JUSM", "Overall": "3.0", "Content": "Please see update at end. My initial enthusiasm has been replaced with frustration.First some comments on other reviews on some other sites. One reviewer claims there is a lack of visible AF points. That is simply wrong. Not only are the AF points visible in the viewfinder but you can set the AF point as well. Next, a reviewer claims the AA battery adapter is expensive. That may be true as the ability to use Lithium or AA (a great plus)is relative but you can buy a cheap one for less than $10. This reviewer also claims that the exposure bracketing is limited to 1/3 stops. Not correct. You can set the feature for up to a 3 stop range! Finally a reviewer states that high end cameras use a CCD sensor rather than a CMOS sensor. I just checked the Nikon $7,000 job and it uses CMOS (albeit full frame size)and their mid-level camera does too but their low end job uses CCD.You should also know that this camera is just a bit of a power hog. It will get the shots claimed but with all the electronica on the camera your experience may vary. I would suggest a back up battery. They can be had cheap for less than $10.Now my experience for the last month. This is my first DSLR. I have been happily using Pentax cameras since the early seventies. This summer I went to Europe and I shot over 20 rolls of film with my beloved and unbreakable SF1. After spending hundreds of dollars on processing it was obvious a change to digital was necessary. After months of research I decided on the K-R. You just trust this company. Also, and this is what snagged me, ALL of the old lenses work with this camera and the shake reduction is in-body rather than in the lens. My glass on my SF is superb and I wanted to use these lenses. The K-R \"reads\" these lenses almost like the new lenses. I think the only thing the DA lenses bring to the table is automatic aberration correction. You can correct the older lenses manually however if you can even notice any aberrationThis is a really terrific digital still camera, although I still think I like film better (Luddite!). Fit and finish are superb. The burst exposure mode rate is as advertised. I just bought a 32 gig class 10 card (over 3000 shots in full rez RAW!) and was able to blow off over 30+ shots at full rez before it slowed down at all. My photos so far are pretty darn good.My gripe with this camera though is it is too darn flexible (read complicated). You can reset almost everything and the defaults are not necessarily the most desirable. While the menus are pretty easy to navigate, it has taken a while to finally have all the menus and options where I want. There are so many options that it is imposable to remember how to access them or that they even exist. Constant reference to the user manual is a necessity. I tried to buy a second one from Pentax to use in the field but they tell you to download the PDF version. Of course you can just set the camera to auto picture mode right out of the box and fire away but then why buy a camera that can do so much? On the other hand this is a camera that you can grow with and not worry that next year's model will be significantly better.My next gripe is about the video capabilities. The K-R is only 720p not 1080p as is common now and has no auto focusing in movie mode. It also does not have an HDMI output to directly connect to a HDTV. You have to load the movie onto a thumb drive before you can play on TV for example. It records mono rather than stereo as is standard elsewhere. It is obvious that Pentax did not catch the wave of DSLR video capability. My two year old $100 Flip type video camera has more flexible video capability if not video quality. They lose a star over this issue.My final gripe is that the \"Live View\" on the LCD screen has a bit of a lag when moving the camera around. I rarely use anything but the viewfinder though.All in all though if you take your still photography semi-seriously, want great lenses that are backwards compatible (front compatible too as my SF uses the new DA lens with no problem) and want a camera that is really a mid-user DSLR camera that is a really good value at an affordable entry level user price, this is for you.UPDATE: Pentax discontinued the camera and I've grown displeased with it on a general level. I find that the sharpness has to be adjusted in editing software for most shots. Additionally the accuracy of the metering system can be hit and miss. Two identical shots taken in sequence will come out where one is OK and the other underexposed. The shadows and highlights do not balance out properly. The movie mode just sucks and is surpassed by even $200 point and shoots. Not to have proper video capability (no HDMI output? Come on!) in this day and age is absurd. After so long with one great Pentax camera (SF1) it seems stupid to have a camera that now seems obsolete so quickly. I have lots of Pentax lenses however so I'll probably get sucked into buying another Pentax once they get video right.", "Date": "October 10, 2011"}, {"Title": "I like it a lot!", "Author": "ScottTunes", "ReviewID": "R29KR17MT0BJQY", "Overall": "4.0", "Content": "I used a Pentax K1000 for many years, and loved it! So thought I'd try a \"newer\" version, and wanted to be able to use all my lenses. My only complaints are that I didn't get the 55-300 tele-photo lens with it, to take advantage of the auto-focus feature, which provides excellent photos with minimal fuss. The \"digital age\" brings SO many options to \"learn\" that it can be overwhelming at times... Translating little pictographs into the proper capture mode takes some getting used to, like anything else new... However, the more I use this camera, the better I like it. Still reading the book and trying things... Lots to learn... But with the \"auto\" features and basic settings (and my very basic understanding of the thing), it starts well ahead of the typical \"point-n-shoot\" cameras.", "Date": "July 18, 2011"}, {"Title": "Get this camera while you still can", "Author": "Psycho535", "ReviewID": "R1M72XJIH2CERL", "Overall": "5.0", "Content": "After getting back into photography I got a Nikon D3100 and Cannon T2i.  What upset me about both was their lack of compelling in-camera digital filters.  I happened across some photos on the web demonstrating Pentax in-camera filters and was intrigued. Also, my first camera being a Pentax K1000, I thought I might look into the Pentax brand.  Unimpressed with the K-7 and K-5, and after doing some research on the K-r, I decided to take a gamble and order the K-r.  Let me first say that I love the shape and styling of the camera.  I'm 6 feet tall and about 185, and this camera fits just so perfectly into my hands,,,,,not too big, not too small.  All the controls just feel right, and the in-camera filters are a joy to work with.  There must be at least 10 different filters, and the best part is you can layer filter upon filter,,,seemingly without end.  On the D3100 you only got a few filters (such as soft or color enhancement) and once you applied the filter that was it, one filter change per pic.  I also bought a Pentax DA 35mm F2.4 lens, and it produces some beautiful photos.  I highly recommend an E-book you can get on the Pentax K-x (essentially the same controls as the K-r) by a guy named Yvon Bouque.  It's like $10 bucks and is much easier to read and utilize than the booklet that comes with the K-r.  I bought my camera from 'Big Value'.  The camera was shipped quickly and was well packaged.  And I must say, the K-r comes in the coolest retro box ever,,,,I'm going to keep it.", "Date": "July 2, 2012"}, {"Title": "Best startup camera....", "Author": "swap \"swap\"", "ReviewID": "R2X1ZKZV5ZQ22N", "Overall": "5.0", "Content": "I am using this camera over 8 months now..THis camera is simply awesome..It has all features any beginner will ever needs You will learn photography (read the cons section :) ). Just buy the comboPentax K-r + Tamron 28-75 F/2.8 and i am sure it is enough for a beginner.Pros:-Cheaper-more features ( 7fps ... you will hardly use it ..still)-you can buy china made battery adaperts to make best use of AA (flash and camera)-I love the menu ( it is personal but it has very quick navigation)-in camera stabilizationCons-less number of lenses available... (but more than what you ever buy ... and you will have to spend time on one lens to master it anyways.. :) )-limited number of flashes are available with p-TTL ...( i would say use YN-560  in manual mode ... get wireless trigger of extra money.)This one is BEST bank for buck...!  If you are buying camera to learn photography rather than wasting your money on things you will hardly use..... THIS IS CAMERA FOR YOU.-Cheers", "Date": "January 22, 2012"}, {"Title": "Merry Christmas to me", "Author": "jpenpix", "ReviewID": "R30SXGO120KNEY", "Overall": "5.0", "Content": "This is my first dSLR purchase and I am thrilled with it so far. I purchased a Pentax ZX-L during the early stage of digital photography and, needless to say it has been sitting on the shelf for the past 7 years. I have a 28-300 mm zoom that went with it - Tamron - which was also not being utilized ... until now. The photos I've taken so far with the K-r 12.4 mp camera have been great - low-light, fast action, close-ups and auto-everything modes have provided exceptional quality prints. My first Pentax was a K-1000 and it took great photos. I use Nikon and Cannon cameras daily where I work (their cameras, not mine), and the images captured by my Pentax K-r are equally as good.", "Date": "December 31, 2011"}, {"Title": "More tha I expected", "Author": "Marisa's Dad", "ReviewID": "R32QBKQK14X6K7", "Overall": "5.0", "Content": "WOW - Loved Pentax since my First Pentac K SLR when I was a teen.  It was rugged, easy to use and took great film pics ( Yea I am old! ).  The features on this DSLR are amazing.  The auto functions work great.  set it on manual, mount on old lense from the film camera and work just fine.  Great vacation pics from Hawaii.  Highly recommend.", "Date": "December 17, 2011"}, {"Title": "Great Camera and Great Cost/Benefit", "Author": "luizpaulo", "ReviewID": "R35XI8JK1KGQJ6", "Overall": "5.0", "Content": "The Pentax K-r is a great camera. It's our first DSLR and we picked it after comparing it with Nikon and Canon (I'll admit I didn't compare it much with Sony, since I'm not a huge fan of it's products, and also I think the optical viewfinder is better than the electronic viewfinder). Anyways it's got a big ISO range (great in low light situations), it's fast, it's well build, very configurable and most important of all: it's producing great images. I highly recommend it.Just be aware that after getting one, you are probably gonna want to learn more about photography to take better pictures and to better use the camera's resources. A great site for that is this one: [...] Friendly folks and great tips to help out. This other site is very good as well: [...]", "Date": "September 29, 2011"}, {"Title": "Pentax", "Author": "Katherine M Karns", "ReviewID": "R3RWIA2DKJYSCU", "Overall": "4.0", "Content": "My previous camera was a Panasonic Lumix with 10x zoom and excellent feature design.  It was a great little camera which unfortunately I ruined when I dropped it in the surf.My decision to buy the Pentax was inspired partly by my frustration with outdoor photography without a viewfinder.  I chose the Pentax based on having had one many years ago and really liking it, and from the reviews of this particular model.  Wow, after using it a couple of times, I find it is great to again be able to focus in on and follow the object of my photo while I am shooting (rather than shooting blind and finding out what I captured later).  This is a real camera. The photos are beautiful, focused, and clear.  Unfortunately, it is also relatively large and heavy, which will discourage some of the spontaneous photography that I enjoyed with my smaller camera.  While beautifully built for the most part, some of the features and settings are not as intuitive as they could be, the flash seems to pop up more than I want it to, there seems to be a lot of navigation required to get to simple display, and the charger is two piece with a cord rather than a simple one-piece charger that it could be.  No doubt I will learn how to deal with these minor inconveniences, as I look forward to getting outdoors and doing a lot more creative photography.", "Date": "June 11, 2012"}, {"Title": "My Pentax K r Camera from Amazon", "Author": "WeekEndWino", "ReviewID": "RR7SIJLZKJAH5", "Overall": "5.0", "Content": "I have been amazed at what this camera can do and I haven't finished the manual.  A friend, who just purchased a new Cannon D7000 told me that he was jealous because my camera shake reduction feature was built in to the camera and not the lenses. The photo quality is unmatched.  This camera will do more than I will probably use but I have set a goal of trying everything at least once.  By the way, this is my second Pentax.  I also own a ZX50 AF that has been with me to South Africa, Zimbabwe, Canada and South Dakota  --  I can't complain about the Pentax quality.", "Date": "July 17, 2011"}, {"Title": "Great camera", "Author": "Davrpoh", "ReviewID": "R28HRC7FBU513O", "Overall": "5.0", "Content": "This is a great camera! The fact that I can use my old manual lenses is most likely my favorite feature. The shipping was quick and everything was in 100% condition.", "Date": "January 18, 2011"}, {"Title": "Camera Geek", "Author": "Richard Karlin", "ReviewID": "RGH8Q4TW38W0C", "Overall": "5.0", "Content": "Just returned from a mountain vacation where I took over 1000 photos.  Boy does this camera take wonderful pics; I had very few discards and they were due to the camera operator!", "Date": "July 27, 2011"}, {"Title": "No Regrets!!", "Author": "Kaintuck", "ReviewID": "R371RC0H497054", "Overall": "5.0", "Content": "Have had the camera a few weeks and think it's the greatest. Previously, I had a Pentax K-1000 35mm slide camera which served me without a hiccup for many, many years.  Too, I had several lenses which would fit the K-r.  After a great deal of research, I made the right decision and at a fair price.  Just set the camera on Auto, and have a ball!!  You won't make a mistake purchasing this gem...It's s-m-o-o-t-h....", "Date": "July 13, 2011"}, {"Title": "Major problems but good pictures when works right", "Author": "Justin L", "ReviewID": "R3UFVQKAZATIEN", "Overall": "2.0", "Content": "I've had this camera for two years now and taken a lot of photos between a trip to Europe, family trips, museums and a new baby which is a wide range of subjects and lighting. The camera does take nice pictures, when it works right. The light meter is consistently off by 2/3's to 1 full stop either direction, very noticible depending on subject matter (full disclosure I worked for 4 years at a higher end photo developer so I have worked with proper exposure a lot). The focus also has issues, it will act like it is focused and it will be close but it is not actually in focus - noticible especially if you enlarge the photo at all. The rear adjustment dial also decided it would only work in one direction, regardless of which way I try to go. I sent the camera off to Pentax for a warranty repair and they claimed they fixed it but the light meter is still off as is focus, the rear wheel worked for several months and then crapped out again. My father also bought this camera and had the same issues with the light meter and focus, he noticed it right away and sent it back - which I would have done except I bought it right before a month long trip and noticed the problems during the trip. I have shot Pentax cameras for years and have owned many 35mm Pentaxs which worked great for years, this was my first Pentax DSLR and has really soured me on the brand. The only saving grace for Pentax is their other cameras work much better. Bottom line is that if you get use to adjusting the light meter for the different subjects and learn to work around the focus issue you can get really nice photos, but it's a real pain.", "Date": "November 23, 2012"}, {"Title": "Pentax K-r", "Author": "antiochguy", "ReviewID": "R111FWKAEA09GW", "Overall": "5.0", "Content": "My first SLR was a Pentax. I like Pentax cameras and find this camera satisfactory for the family photographs which I take now. It is very good in available light situations and has a great range of aperature and lens speed choices. Battery life is good.  If you own other Pentax lenses, they will most likely work on this camera on manual settings. I recommend this camera for general use.", "Date": "October 26, 2013"}, {"Title": "awesome", "Author": "D. R. Patrick", "ReviewID": "R2VTCDN9LLY2AD", "Overall": "5.0", "Content": "This was my well researched purchase. I've traveled internationally into hard and dusty climates with this and it is a trooper. I have gotten compliments on the vivid color of the photos and have gotten jobs I didn't expect because I can take some really nice shots with this machine. I pretty much have to buy accessories (lenses, etc) on line because the city I live in isn't big on Pentax, but it still was a great choice. I'd buy it again.", "Date": "October 20, 2013"}, {"Title": "Solid DSLR", "Author": "CHARLES", "ReviewID": "R3EZJMDJ0HGCLZ", "Overall": "5.0", "Content": "Nice step up from Kx. This feels as solid as DSLRs from Canon and Nikonin the $1000 range.  Next step is a K30 or 50. Pentax is a small co.. withgr8 products. For the $$$ you cant beat em.", "Date": "October 18, 2013"}, {"Title": "Love it", "Author": "Wayne & Casey", "ReviewID": "R2WMI1P0LJKI7R", "Overall": "5.0", "Content": "I bout this camera after doing extensive comparisions to the competition.  The main reason I settled on it was that it was very favorably reviewed but it had the main advanage that it is compatble with older Pentax lenses.  I have a very goo 70-210 zoom lens from the 80s with auto exposure but not autofocus and a powerful synced flashe that I wanted to be able to use.  The old lens works perfectly getting long reach action kids soccer and basketball shots and the autofocus lens it came with is also great.  The photo quality, exposure balance, autofocus and everything else about this camera is more than I even hoped for.  I would definitely recommend it to anybody even if you do not have any Pentax equipment you want to reuse.", "Date": "January 1, 2013"}, {"Title": "love it", "Author": "Corinna", "ReviewID": "R2LOE56NOZ18PA", "Overall": "4.0", "Content": "Since I have only had my camera for about 3 weeks I can only review what I have done.  I have pretty much stayed onthe auto focus which I love.  We used my christmas present from my husband for the first time at my parents50th wedding anniversary on November 18th.  Most of the pictures came out so clear (not like my point andshoot) except for the group shot(about 40 people) that didn't take in the low lighting but we also didn't usethe flash and I am sure that would have taken a great picture.Oh the continuous shooting is so cool.  We played with it.  My 12 and 11 yr old did some fun movements so itlooks like slow motion on the camera.  This is a great feature!!!Also, I really wanted the white one but the price did not come down and the black was less expensive.This was the only reason why I didn't give it a five star.  I wanted something other than black and Amazonwas not budging on their price.I can't wait to play with the other settings.I am very happy that my husband and I made a great decision on the Pentax K-R", "Date": "December 16, 2011"}, {"Title": "Wonderful camera", "Author": "Arnold L. Rheingold \"happycamper\"", "ReviewID": "R2Q0S6DZSJM7VS", "Overall": "4.0", "Content": "I bought this camera based on some nice features and a \"best buy\" rating from Consumer Reports.  My first use was to record in both stills and video my father's 100th birthday party.  I effortlessly created a wondrous collection of photographs of four generations of family that I probably could not have done without the range of capabilities of a good SLR.  The Pentax in every way meet my expectations.  It is a very user friendly camera, but also has a fantastic array of customizable features.  I am still learning some of the features, but the camera is intuitive and the manual helpful.  It also saved me hundreds of dollars compared to equivalent Canons and Nikons.", "Date": "November 9, 2011"}, {"Title": "Fantastic DSLR", "Author": "Jim K", "ReviewID": "RLD6CXRR14NCV", "Overall": "5.0", "Content": "This DSLR is just amazing. It takes fantastic pictures and it has so many top end features for a camera in its price range. It's very easy for a novice photographer to learn to take great pictures with this camera using the automatic settings yet it has a lot of custom features and scene modes that a professional photographer could appreciate as well. It is really going to be fun learning to work all of the \"bells and whistles\" and rediscovering photography all over again with this DSLR. I really like the fact that I can use any of my old Pentax K mount lenses on it too, manual focus only of course. That was the main reason I chose a Pentax over some of the other great cameras out there, and I'm glad I did.Battery life is very good if you are shooting through the viewfinder. If you are using the using the \"live view\" mode and shooting using the excellent LCD display a lot, battery is reduced considerably so you may want to get a spare Lion battery or two. I got two extra high capacity batteries on Amazon for about 20 bucks.I just can't say enough good things about DSLR ! I highly recommend it.", "Date": "November 4, 2011"}, {"Title": "I'm a 40 + fan of Pentax including new K-R", "Author": "Gerald W. Beckendorf \"Jerry\"", "ReviewID": "RJNJMN44N094N", "Overall": "5.0", "Content": "I got the new Pentax K-R just in time for Christmas and am excited about all the features.  The remote works from my previous Pentax digital and of course, all the lenses are interchangeable.  I frankly am still learning but find that it will be probably the last Digital SLR that I need to own.", "Date": "January 18, 2012"}, {"Title": "Happy with new camera", "Author": "Peter Reque \"Pete\"", "ReviewID": "R7SPYC1D7MYYW", "Overall": "4.0", "Content": "I'm quite pleased with the K-r. It may be smarter than I am and I wish it had a full size (35mm) sensor), but it works fine and takes my old lenses. It's my third Pentax, so I may be biased;)", "Date": "March 19, 2012"}, {"Title": "Wonderful Camera", "Author": "M. Hallock", "ReviewID": "R2FJJ6ACODE60G", "Overall": "5.0", "Content": "I am still learning ho to use this camera. But it is a wonderful piee of equipment. Much faster than my previous and gets the job done nicely.", "Date": "August 25, 2011"}, {"Title": "A Broken Camera from a Broken Company", "Author": "Truthteller", "ReviewID": "RD8F2A9R5Z47I", "Overall": "1.0", "Content": "After reading numerous reviews about this camera from assorted sources, I finally acquired one. I was drawn to it based upon its innovative internal image stabilization, making any lens put on it IS.  I also liked the idea that almost all Pentax lenses would work with it, even quite old ones, and that it was rated positively for low light performance.The problem with most reviews is they are based upon early usage of a few days or weeks, and they rarely discuss durability, or quality control at the factory, because most reviews are based upon either hand selected samples provided by the manufacturer or are based upon one unit's use over a short period of time.Although this was my first Pentax DSLR, I have owned numerous film and digital cameras from other major brands, most of which have been quite reliable. I assumed the early problems I experienced with my K-r were \"operator error\", but the more I got to know the camera, the more I recognized it was just bad design or bad manufacturing, or both. I bought numerous lenses for it during the first several months. I have now owned the camera for two years, and it was repaired under warranty twice during that period.  Each time they fixed some of the problems, but not all of them.  Then, the warranty ran out and they claimed my camera was working \"normally\". Well, if normally is intermittent exposure, random focus, unreliable white balance correction, electronics that intermittently don't turn on when they should, poor battery indicator information, intermittent warnings of the sensor overheating in movie mode after a couple of minutes, lost images, camera lock ups and a lot more, than yes, I suppose my camera is working \"normally\". The first repair involved shimming the sensor position, replacing a PC board for the main interface dial, several factory readjustments and more. It still came back with problems, and a major new one, probably introduced by the repair.  The second warranty repair was classified as \"goodwill\" and the camera was sent back to me basically unrepaired.In my opinion, the problem is, yes, the camera, but also Pentax as a company.  Pentax collaborated with Samsung to make their DSLRs in the beginning.  Then, they were sold to Hoya a few years ago, who bought the company because they wanted their scientific instruments division.  However, to keep the camera division viable, they came out with several cameras, including the K-r during their ownership.  Not long after that, they sold off the camera division to Ricoh, and the company became Pentax/Ricoh.  Now, Ricoh has dropped the Pentax name from theirs.  I believe Ricoh is washing their hands of the Hoya Pentax cameras recognizing them as a liability. But further, as often is the case of a company sold several times during a few years, Ricoh doesn't really seem to know how to handle the acquisition, and has come out with several cameras which were poorly received by the public. Hardly any retailers in my area, including many big box stores, carry Pentax DSLRs or Pentax brand at all these days. I believe Pentax will be yet another \"great brand\" which soon will be history.  I will never buy another Pentax product based upon both their product and their service. I do not trust the company. I would strongly recommend people consider other major brands like Canon, Nikon or Sony, who seem to be able to get a product to market that works, admit it when they have made an error, with recalls and free replacements, and support their products with reasonable warranty service.", "Date": "September 5, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "12.4-megapixel CMOS sensor; compact, lightweight body\nKit includes 18-55mm f/3.5-5.6 lens\nWidescreen 720p HD video at 25fps; powerful automatic shooting modes including Pentax Auto Picture\n3-inch LCD with 921,000 dots of resolution; wide range of in-camera image processing and special effects filters\nCapture images and video to SD/SDHC/SDXC memory cards (not included)", "Name": "Pentax K-r 12.4 MP Digital SLR Camera with 3.0-Inch LCD and 18-55mm f/3.5-5.6 Lens (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41TsitdGoAL._SX300_.jpg", "ProductID": "B00427Z7N2"}}