{"Reviews": [{"Title": "A \"decent-enough\" camera", "Author": "Yarii", "ReviewID": "R12B45KGMQF55E", "Overall": "4.0", "Content": "I was afraid to order this, though I've owned several Fuji cameras and I've been very pleased with them. I still have my first digital camera, a 2 MP Model A205 I got in 2004 - it works fine as old as it is.  So why the hesitation to order this T200?  The 3 reviews I read which don't think highly of this camera. I'm here to tell you don't be put off by the other reviews. Sometimes you also have to take into account when you read a 1 star to 3 star review that the person writing it has no idea how to use a camera, not accusing anyone here, but always keep that in mind. I'm not a professional by any means, but I've been buying/using digital cameras for almost 8 years.This camera was intended as a gift for a young relative of mine. I took it on a test run beforehand, and here are my thoughts.One reviewer complained about this having no focus assist lamp. That's a plus for anyone photographing pets, I own many cameras with this and most you cannot turn it off, so a blinding red lamp lights up right before you press the shutter on these types of cameras causing the cat's or dog's eyes to shut. This T200 does not have this lamp, and I've been able to obtain good pictures of my pets with the \"Natural\" mode choice on the dial. There is also a \"Natural and Flash\" choice too, which is working out well - 2 shots are taken in rapid succession, one with no flash and one with, so you can compare which one is best.Essentially, this camera is EXACTLY the same as the Fuji T300 Fujifilm FinePix T300 14 MP Digital Camera with Fujinon 10x Wide Angle Optical Zoom Lens (Black) - and look at the reviews for it compared to this camera. The only difference is the T300 has a 3\" LCD screen and the T200 is 2.7\" LCD screen.  Not a big deal, and I preferred the gunmetal gray to black.  It's a beautiful gray, great build quality (mostly metal), the fit and finish is fine, and it even has a textured surface on the right front to help with gripping such a small camera. This camera IS tiny though.Photos taken with this camera are true to color. Outdoor shots are better than indoor, but it's this way with any cheaper P&S; camera. Shutter response time is OK, although I have seen faster in the Sony camera I recently returned. When you are taking Natural & Flash, there is extra storing time, the same with the Panorama Feature, even using a Class 10 SD card.Battery life is good. The optical image stabilization is good. Some people think there's something wrong with the camera when the dial is turned to SR Auto and you can hear the zoom motor - but that's what it is supposed to be doing - when you have the dial turned to SR Auto (SR stands for Scene Recognition) and you aren't holding the camera still, it can't decide what you want it to focus on.Oh, and this camera DOES have optical zoom during videos. But I have a complaint and I don't know why Fuji does it this way when other camera manufacturers like Panasonic do it right.  With this Fuji, while you are optically zooming out during a video, the audio goes away, then it resumes when you are finished zooming. I assume they do this so you don't hear the motor sound in your video, but it's just plain stupid to do it this way. The 720p videos are very good quality.If you choose this camera, also pick up an SDHC card, preferably Class 10 for videos. They normally say Class 4 or 6 for videos is adequate but a Class 10 card would be even better and they don't cost much more.This camera is thicker than other ultra-compact cameras due to the 10X zoom. The lens area isn't flush with the rest of the camera body, making the camera approximately 1-1/8\" thick. So take that into account when choosing a case for it.Here's a good fairly inexpensive SDHC card:Transcend 8 GB Class SDHC 10 Flash Memory Card TS8GSDHC10E", "Date": "December 17, 2011"}, {"Title": "Everything about my T200 is excellent in every way.", "Author": "Upshifter", "ReviewID": "R2TIF6S7U0D8W0", "Overall": "5.0", "Content": "After reading the reviews, I thought that I made a mistake buying this T200, but I changed my mind.  The lens is exceptionally sharp, and on par with my Canon G11, and my Sony H20, both of which cost more than twice as much.I used the camera indoors, and out.  I took it to the beach to take some sunsets in low light, the pictures are beautiful.  I used it indoors with the flash, and without the flash; again, the pictures are marvelous.  I shot some movies with it at the beach with the waves breaking over the rocks; they are dramatic and very high definition.  Every feature on that camera works; and it is no larger than my cell phone.  That is amazing to say the least.The build quality is solid, and the camera seems to be mostly metal.  The 10 X zoom is sharp throughout it's range; and the auto-focus worked even in the low light at the beach during sundown.  I have the pictures to prove it.Yet one might say, that with those other excellent cameras why would I get the T200.  The answer is that camera has more features than many larger cameras, but it is unbelievably small in physical size, but enormously powerful with it's 14 mp, 10 x zoom, and really good image stabilization, even when zoomed.  I'm extremely pleased with this remarkable camera.", "Date": "March 1, 2012"}, {"Title": "Good little camera", "Author": "Mr. Andrew E Hayes", "ReviewID": "R2JBTYTBF43EQX", "Overall": "3.0", "Content": "This camera has been very dependable and works as described.  what it needs is better software for editing and picture removal from camera; it seems outdated and doesn't update to much better software.  the other problem is you need very stable hands, as some pictures come out blurry.", "Date": "January 8, 2013"}, {"Title": "Awful, with one saving grace", "Author": "James Lyford", "ReviewID": "R3VTH4H4J0NG9U", "Overall": "2.0", "Content": "God, where do I start?  It's slow, auto-focus is inept and the light-meter is arbitrary, even between 2 shots shot concurrently in the same setting.  The shooting selections are retarded and the smile-detector won't allow me to take pictures of some buildings.  When you switch between modes, the title of the mode covers the entire screen for several seconds with no shutter access, so shooting quickly is just not possible with this camera.  It's even slower than my first digital camera, which saved to a \"superdisk\" (120Mb floppy).  This camera sucks. When you press the shutter, you have about a 50% chance that it will take a picture.  It does fit into my pocket, so I suppose that is good.However, it has one nice feature, which saved it from a one-star review.  It has a \"panoramic\" setting (conveniently titled \"SP1\" for no reason) that actually usually does a decent job of patching 3 pix together in-camera.  Didn't work well in a hot-air balloon, but on stable ground, it does a decent job, usually.  Much easier to make panoramics than spending hours in Photoshop matching sky levels and horizon line, meshing foreground objects.  Not great, but decent, most of the time.  Assuming light-levels match; if you're shooting varying levels, like in a sunset situation, it doesn't match them well.I bought this as a backup for my DLSR, and for a camera to carry on my longer hikes and jogs, as my DLSR is heavy and floppity when jogging.  It isn't a good backup camera, my old 5 megapixel Canon Crapola 6000 is a better camera overall.  But I do carry it in my glovebox for it's panoramic strengths, which is it's only strength.  If you want an OK panoramic camera for the price, it's not terrible, but for a point&shoot;, forget it.", "Date": "October 31, 2012"}, {"Title": "Was ok for a while", "Author": "Full Box of Cookies", "ReviewID": "R1Z7Q4V8617A3M", "Overall": "2.0", "Content": "I bought this as my third Fuji camera.  It came and I liked.  It does have some problems in low light but other then that I was pleased until month 10 when it started turning itself on and off repeatedly.  I have to keep the battery out of it now, causing us to have to go thru date programing to use it.Then it started refusing to let me review pictures.Finally at 11 months it now switches to picture review when I want to take a picture.  So a quick review...not great in low light, switches on and off repeatedly,picture review button doesn't work,won't let me take a picture but instead automatically switches to picture review.  I have always like Fuji since the film days of old. I probably have the lemon out of the bunch.  However I felt the need to share my experience.  There are many good things about this camera including many features, simple to use, takes good point and shoot pics, lines up your pamorama photos, its small and appealing to the eye.  I guess its really up to you.", "Date": "August 19, 2012"}, {"Title": "Complete Rubbish", "Author": "Curly G", "ReviewID": "R2SCDNENBCM5O9", "Overall": "1.0", "Content": "I've used this camera for about 1.5 years and can safely say it, and it's Walmart cousin T190, are total and complete rubbish.  Low light performance is bad.  Indoor performance is bad.  Macro function is bad.  Florescent, metal halide, sodium & mercury vapor lighting confuse the camera's light sensor and auto focus such that photos are always bad and blurry.  Macro function is bad.  Zoom is good, if you are outdoors in 100% cloud-free daylight, otherwise...out of focus and all fuzzy.  This camera reminds me of a 10-year old camera phone with a crappy zoom lens duct-taped to it.  Fuji should refund persons that bought this wretched camera. I replaced the T200 with a Canon SX150 (now on closeout sale), which is 10x the camera the Fuji T200 was.", "Date": "October 19, 2011"}, {"Title": "The Fuji T200", "Author": "The Abuser", "ReviewID": "RP4NR72JZ1OB3", "Overall": "5.0", "Content": "I purchased the Fuji T200 after I lost my Fuji T300. I needed a cheap replacement camera to take e-pictures that I could upload. I did not want to learn another camera menu so I went with the Fuji T200. I actually learned more about the menu and have gained more usability from the camera. I have never bothered with reading the manual, who has time, its a camera for heavens sake! It's picture quality and video quality is good enough for my purposes, which I am actually impressed with. Prior to the first snow storm I sued this camera in, it performed flawlessly.I am impressed with the durability of the camera. It has displayed most of the symptoms of problems that have plagued other users in the other reviews.The lenses has retracted and extended and I noticed some rubber flecks form between the segments. To address that issue I grasped the tiny flecks and ripped them off.I have noticed the shutters not opening as fast as they did or they did not open or close. This problem exhibited after I used the camera in a snow storm and put it in my pocket and probably got sticky stuff on it or I sneezed on it and maybe even tweaked the shutters, who knows. To address that issue I swabbed the shutters with alcohol pads to clean of the sticky spots. After a period of time the shutters operate normally albeit exhibiting some scratch marks.Another problem is that camera instructing me to turn off the camera after the lens extends and also it made a thudding clunky noise while extending the lens. To address that issue I got angry with the camera and grasped the extended lens and gave it a few rotational torque applications to the extended lens out of frustration. I also installed another fully charged battery and on and offed the camera in the attempts to do it in.The noise went away and the camera works much better now. It extends most of the time with out causing the camera to be turned back off and it takes decent pictures as well. It may take a warm up zoom to wake it up but it will zoom as well without telling me to shut off the camera as well.I use this camera as my beater camera. It seems to work in spite of the rough abusive environment I subject it to. The cold, the heat and damp environments seem not to affect it much. I do keep it in a protective zipped protective case but it still gets jostled and bounced about. I am currently considering purchasing another T200 as they have really come down in price and I do like the camera. This particular camera will continue to get the rough treatment and abuse as well. I will save future cameras for much less abusive use and subject them to care and much more care in handling. I have purchased a new Fuji T300 at a third of the price I paid for the original lost T300. I may purchase anther T200 due to the fact that I can find a new one for less than half of what I paid for the present T200 I have now. When this present camera finally succumbs to its environment I may take my miniature screw drivers to it to see what makes it mechanically tick and see if there is anything I can do to clean its the mechanism before I chuck it and use the replacementsI think Fuji cameras are reliable and quality units.", "Date": "September 17, 2013"}, {"Title": "so so", "Author": "Silverone", "ReviewID": "R2OIX8UMLIHC6H", "Overall": "1.0", "Content": "Lots of bells and whistles for an inexpensive point and shoot. However, I couldn't get the camera to give me a really sharp picture. I was trying to shoot a painting that I had done. I tried every setting possible and wound up with okay pictures but all of them too soft for my taste. I did not like the camera and returned it.", "Date": "October 7, 2011"}, {"Title": "Pretty dissapointed..", "Author": "JB", "ReviewID": "RB3QPPO0ZH7KF", "Overall": "1.0", "Content": "This camera takes great pictures WHEN it is working. The zoom button sticks so would always zoom all the way in, even when I only accidently bumped it, and the only way to make it zoom back out was to turn the camera off completely. Next, the built in lens covers quit opening all the way and the camera wouldnt focus. It would tell me to turn it off & back on again but would do the same thing all over again....dont waste your money on this thing..", "Date": "November 17, 2012"}, {"Title": "Awful little piece of garbage", "Author": "Nadja Robot \"robot\"", "ReviewID": "R1GGVRIDI8ZE9A", "Overall": "1.0", "Content": "We bought this camera to take pictures of speaking events at my work. Under fluorescent light it took blurry, terrible photos. It took \"okay\" photos outdoors in bright sunlight but anything less than that and you're going to get serious blur.", "Date": "February 14, 2012"}, {"Title": "VERY VERY DISAPPOINTED with the FujiFilm FinePix T200 camera", "Author": "J. Peltier", "ReviewID": "R1GR30D0FD0WJD", "Overall": "1.0", "Content": "I am most disappointed with the FujiFilm FinePix T200 camera. This camera is NOT able to do as promised.  I want a camera that will point and shoot. However, the FujiFilm FinePix T200 pictures are all blurry.  I have tried to adjust the camera settings in many different ways and have spent hours trying to figure out how to clean up my blurry images, but alas the FujiFilm FinePix T200 camera is not worth the money I spent.  I have adjusted the ISO, image quality, image size, the room lighting, and many other settings, yet when I view my pictures on my computer screen, they are blurry.  The pictures lack color of the real thing despite adjustments to the FujiFilm FinePix T200 camera settings. I would not recommend the FujiFilm FinePix T200 camera. I previously owned the FujiFilm FinePix F440 and is was a great little camera with very clear pictures full of color, but it is at the end of its life.  I thought the FujiFilm FinePix T200 camera would be a great replacement. However, I am very very disappointed with the lack of quality images produced by the FujiFilm FinePix T200 camera.I even tried to get help from Fuji support, but got no response.  It is such a shame I am past the 30 day mark with Amazon or I would be pushing for a refund.", "Date": "December 2, 2011"}, {"Title": "Puzzled", "Author": "Alexintenn", "ReviewID": "R2IF6NYYYHS7Z7", "Overall": "1.0", "Content": "Brought the camera home, took it out of the box, charged the battery just enough to try it.Tried indoor and outdoor pics.  Tried SR and Normal modes.  I could not at any distance or in any kind of lighting, get an \"in focus\" picture.  The pics weren't even close to being useable.I know the camera must be capable of better results than what I got.  The thing is, I like the look and feel and the settings, really wanted to like the camera.  Apparently the one I got was just a bad one.", "Date": "February 15, 2012"}], "ProductInfo": {"Price": "$159.95", "Features": "14 million effective pixels; 1/2.3 inch CCD with primary color filter; 10x optical zoom lens plus approx 6.7x digital zoom\n2.7 inch TFT color LCD monitor; HD movie 720p with sound\n6 scene SR auto; Motion Panorama mode with auto stitch\nDual image stabilization; Face, Blink detection; Smile and Shoot mode; Auto red-eye removal; Tracking auto focux\nUSB 2.0 High-speed; Video output NTSC / PAL selectable; SD/SDHC card compatible (card NOT included)", "Name": "Fujifilm FinePix T200 14 MP Digital Camera with 10x Optical Zoom (Gunmetal)", "ImgURL": "http://ecx.images-amazon.com/images/I/41PgIIXIiJL._SX300_.jpg", "ProductID": "B004SBK7TQ"}}