{"Reviews": [{"Title": "A great deal!", "Author": "S. Clark", "ReviewID": "R1CP8Y9Q64CAV8", "Overall": "4.0", "Content": "Let me start by saying that the only reason I didn't rate this as 5 stars is because the LCD display is a little dim and very hard to see in bright sunlight. But the photos come out great, even if you have to guess a bit at what you're aiming at. Indoors is fine, though.I bought this camera specifically to mount on my mountain bike to make high-def videos. It's small, lightweight and has the tripod mount in the center so the camera will be balanced when I bounce over rocky trails. The video (720p) is very good, but the image stabilization doesn't help on my bike. In fact I think it's better without it and then I just rely on post-processing to stabilize it. But I don't hold that against the camera - it's a pretty shaky ride on a the trails, whether it's mounted on the frame or my helmet. When the video is too shaky to view, I can still grab individual frames (using my video editing software, not included with the camera) and use them as photos - the resolution is high enough to put on the web, but not for printing.The camera doesn't come with a printed manual. You have to get the manual from the included CD. You can pick one of several dozen languages. It does have a printed quick-start guide to get you going.The camera records video up to a max of 2GB. The manual says that is about 9 minutes, but I've found it's more like 11-12 minutes. When you reach the limit, it just stops recording and saves what it has.As for memory cards, the manual says up to 8 GB micro SDHC is guaranteed; I've used a 16 GB card with no problems. In video mode, the total record time left (based on space on the memory card) is displayed at the top. An 8 GB card holds almost 45 mintues of 720p video. The 16 GB card holds double, but the battery is only good for about an hour of video, so you'll need a spare to fill 16 GB.The battery can be removed from the camera, but only way to charge it is in the camera using the included USB cable. It's not a standard USB cable, so don't lose it!I have taken many dozen photos with it, exclusively outdoors, and they came out very well. At least I didn't notice any problems with them. The color, contrast and focus were all good.In summary, I think this camera is a great bargain! It's small and easy to carry, attractive and takes good pictures and video. The only issue I have is that the display isn't bright enough to see well when outside in the sun.", "Date": "July 26, 2011"}, {"Title": "Perfect for a compact travel camera", "Author": "Greg", "ReviewID": "RY1G58UMOTBHY", "Overall": "5.0", "Content": "I have a Nikon SLR and a Canon HD camera for movies, but both are a pain to lug around.  I wanted a small, lightweight camera I could keep in my pocket, use mostly for shots of people, but wanted a decent optical zoom and video option.  Lastly, I didn't want to invest more than $100.  I just got this today and I'm impressed.  It looks and feels like a high quality camera, and has an easy interface.  It's small, and light weight.  The Nikon, Sony, Canon, and Panasonic models were all either heavier or cost much more for the features.  The only thing is it requires a micro memory card so I could not use the ones I already have.  An 8 gb is only $12, so, no big deal.  I'd recommend this camera.  It takes good pictures, too.  But, the flash is not ideal for dark settings.", "Date": "September 2, 2011"}, {"Title": "Not What I Expected", "Author": "AmazonUser10051975", "ReviewID": "R1RT345CJUTOPF", "Overall": "3.0", "Content": "I purchased this camera as a gift for my roommate's birthday back in June 2011.  Being a photo-hobbyist, she really liked the camera...so I figure I'd take a stab at it and bought one for myself (October 2011, at a local Fry's Electronics for $79.99 +tax...Best Buy has this right now at $105.99 +tax).  It's a nice upgrade from my Canon Powershot SD1100IS, which was an 8.0 megapixel camera.  This is a 13.4 megapixel camera, so it takes pretty clear pictures.  I say 13.4 because the dimensions of the pictures taken at the maximum resolution are 4320x3240 (do the math).  It is pretty high quality but definitely not 14.2 MP as advertised.  Also, the pictures are 96 dpi.  I wish it could've been higher.There are a lot of pre-defined modes for taking pictures, which is great; however, I have not yet discovered a way to manually adjust any of these settings, such as white-balance or apeture.  Further, most cameras I've used had buttons or a circular knob on the camera to switch between picture and video (and other features).  This camera's change of mode is in the menu, which I find very inconvenient.  It does have a pretty cool feature that snaps a picture whenever it detects a smile.The videos recorded at HD-resolution is okay.  Most of my videos so far have a line through them and artifacts throughout.  I'm not sure if that's because the ST65 uses mJPG for videos instead of H.264.  In any case, the video files I've created are nothing to brag about.  If anyone is interested, the video bitrate is between 17k to 23k.The camera comes with a USB connector that is used for charging the battery.  You can charge it while connected to a computer or you can use a wall-outlet adapter that is included.  While the camera is plugged into your computer, you can transfer pictures to your computer, but you cannot use it to take pictures or record a movie.  I have not tested that functionality while charging with the outlet adapter.Overall, I'm disappointed in this camera.  I usually do a lot of research before purchasing an electronic product.  This time, I went by word of mouth.  I hope my roommate truly enjoys this camera.  It is a lot lower quality than her SLR and the only advantage that I can see is that it's not as clunky as an SLR.  I give it THREE stars as it is, at best, an average camera.", "Date": "October 11, 2011"}, {"Title": "FANTASTIC", "Author": "ScottyM", "ReviewID": "R2UGDADDGKE28W", "Overall": "5.0", "Content": "We actually got this camera as a replacement from Samsung for the SL605 model that had power issues, so they sent us this one and let me just say it's awesome, the pictures are very clear and life like and the 720p HD video is great as well, when we shot the first video and then watched it back, we couldn't believe the detail it had. This camera has more features than some of the other brands in it's price range, it is also lightweight which makes it easy to travel with. There's still some features we haven't tried yet but eventually we will. I would definately reccommend it to anyone who want's a great camera with a lot of features for a great price.", "Date": "July 25, 2011"}, {"Title": "Great Camera for the price", "Author": "Forrest Covin", "ReviewID": "R3R721Z7PTI07P", "Overall": "4.0", "Content": "A good camera...does everything that I need.  Picture quality is very good.  Simple to use....battery life is excellent.  Would buy again.", "Date": "September 22, 2011"}, {"Title": "Good value, but grainy LCD screen, no viewfinder, takes MICROSD not SD", "Author": "Timmercuz", "ReviewID": "R1POQBDNIL1OUV", "Overall": "3.0", "Content": "The LCD screen on this camera is very poor quality, and actually made me worried that the pictures would appear as grainy as the subjects appear on the LCD.  After transferring the pictures to a PC, the pictures look much sharper (surprisingly so) than they appeared on the LCD.  Colors are not picked up as vibrantly as a higher quality camera, and the contrast is slightly off, but it seems to get the job done at this price point.For a standalone camera with 5x optical zoom you really can't beat the price point, but I would recommend a Canon Digital Elph if you're looking to take quality photos.", "Date": "December 21, 2011"}, {"Title": "Take fantastic pictures......great deal..", "Author": "roaeja \"Hey you!\"", "ReviewID": "R1552VJ6TTEDGK", "Overall": "5.0", "Content": "For $88 bucks this baby takes great pictures, no blurry shots, but sharp andin focus.  Put it in 'Auto'.  The exposure is right on, not to dark or tolight, just right.  Easy to hold and not heavy.  A good pocket camera.  I'mvery impressed.  I'm not into video, so 720 is ok with me.  If you want asteal, this is it.I would get the long lasting battery...1000mAh vs 740mAh  longer is better.This Wasabi Power Battery and Charger Kit includes:1) Two (2) Wasabi Power batteries for BP70A made with Japanese cells, each with 3.7V, 1000mAh2) One (1) Wasabi Power Mini Rapid A/C Charger for BP70A3) European plug and car adapter4) 3-year manufacturer warranty", "Date": "April 14, 2012"}, {"Title": "Good", "Author": "Dave R", "ReviewID": "R1J6ORRRCM9DEW", "Overall": "5.0", "Content": "hey Nice camera with Good reasonable pricing ! also came with everything as if i bought it in store. thanks", "Date": "September 16, 2011"}, {"Title": "Samsung Camera", "Author": "Camille", "ReviewID": "RA89FHTBYH9R5", "Overall": "4.0", "Content": "Love this camera, easy to use, small and lightweight, fits into the smallest of cluthes. The picture quality isnt the greatest but good enough for the price.", "Date": "March 5, 2012"}, {"Title": "Great little camera", "Author": "Herbie", "ReviewID": "R1VZL4IZ1PTS3J", "Overall": "5.0", "Content": "Much better than anticipated, a great many hidden features that make the camera near professional in some respects.  Well worth the price.", "Date": "December 26, 2011"}, {"Title": "great camera", "Author": "katielynn", "ReviewID": "R2A4VXYWQ66YOE", "Overall": "5.0", "Content": "I love this camera the only thing i dont like is that i dont think there are enough flash options", "Date": "November 11, 2011"}, {"Title": "Nice point and shoot", "Author": "Kc", "ReviewID": "R4BU29KU0FU8U", "Overall": "4.0", "Content": "Just as good as the rest and the price is competitive. Battery doesn't seem to hold as much charge as my older cannon", "Date": "October 21, 2011"}, {"Title": "Samsung", "Author": "Angela Petty", "ReviewID": "R24XZMH8RVAOOE", "Overall": "5.0", "Content": "The service was outstanding.  The seller was concerned and very courteous. He took the time to explain certain aspects, I had over looked. I would purchase from him again.  As a matter of fact, I plan on doing that today.", "Date": "June 11, 2013"}, {"Title": "Great Camera", "Author": "TayLewis#52", "ReviewID": "R2M98A3NIYR8LJ", "Overall": "5.0", "Content": "I bought this for my Father-in-Law and I think I use it more often than he does.  The camera takes wonderfully clear pictures and clears everything up.", "Date": "January 3, 2013"}, {"Title": "i like", "Author": "Cesyairis Segovia", "ReviewID": "R3O4SKEABJEG3N", "Overall": "4.0", "Content": "is fit and small. is very easy and practic for use, the battery is durable, but the night shots not is very good", "Date": "December 28, 2012"}, {"Title": "very good for the price", "Author": "Cantabela \"cantabela\"", "ReviewID": "R29HRWDXNHCJMP", "Overall": "5.0", "Content": "I was not expecting such a good product for such a low price.We are very happy with the picture quality.", "Date": "November 24, 2012"}, {"Title": "Works well", "Author": "Cindy", "ReviewID": "R7DR4PWXGTV1L", "Overall": "4.0", "Content": "This camera was exactly what I was looking for, a simple point and shoot digital. I haven't had it too long but so far it's working great. I got it secondhand, and it was in very good condition, just as the listing said.", "Date": "May 22, 2012"}, {"Title": "so far so gooood =D", "Author": "awwifey", "ReviewID": "R8X8UNVKL1S68", "Overall": "4.0", "Content": "There is a setting for kids and I am more then pleased with the way the pictures I have taken of kids while in motion turned out. I took pictures of them while swinging and the pictures are clear enough to tell that their hair was blowing in the wind and the smiles on their face. I did not give this full stars because I wish it would zoom in more, the inside pictures turn out a bit dark (I am sure that the setting just need to be changed from indoor to out) and of course there is a bit of delay between pushing the button and taking of the pic (I am sure its for focusing). for the price and when compared to others this is great camera for our family.", "Date": "May 7, 2012"}, {"Title": "Perfect little camera", "Author": "Katherine<3", "ReviewID": "R3QCEVXF9GGFHK", "Overall": "5.0", "Content": "Just got this camera after losing my Canon and couldn't be happier! I wanted something cheap but good just in case I ended up finding my Canon and this camera ended up being quite a nice surprise! I noticed it had 4 stars on Amazon as well as other websites, so I went ahead and got it! It's easy to use, small and takes really good pictures! It's definitely not a $300 camera so I wasn't expecting the world's greatest photography to come from it but it really did surprise me in a good way. I usually use my camera when I go out for the evening with friends, or on a day trip or small vacations and this camera does the job PERFECTLY! And for the price, you can't beat it! Love it!", "Date": "April 24, 2012"}, {"Title": "Great Camera", "Author": "Jesus", "ReviewID": "R296L4XLEN19BL", "Overall": "5.0", "Content": "i buy this camera to take personal photos and i'm very happy with it, the quality of the photos and the colors are amazing, the video are in HD and it's very easy to drive, compact and good for travels", "Date": "April 23, 2012"}, {"Title": "great camera", "Author": "JMAN", "ReviewID": "R3TW00C55X8EK0", "Overall": "5.0", "Content": "great little travel camera. got it for my mom and she loves it. easy to use and highly recommended to a traveler!!", "Date": "April 6, 2012"}, {"Title": "Samsung EC-ST65 is great inexpensive high feature camera", "Author": "Sultan of Swing", "ReviewID": "R1JOR2ONQJ40L5", "Overall": "5.0", "Content": "My wife is loving it, is a great value for the price...! Small easy to hold and use, long lasting gives her the pictures she wants without the hassle.", "Date": "January 30, 2012"}, {"Title": "TERRIBLE. Only outside shots/close-ups are good.", "Author": "Amazon Customer \"AmyMomofFive\"", "ReviewID": "RUY08DD0Y6M88", "Overall": "1.0", "Content": "I have never written a bad review on any website before but this is the WORST camera ever! Had it for a few hours when I knew it was a mistake. The only shots that were good were outside or close up. Indoor shots of kids sports were horrible. Never a clear shot. Everything blurry and grainy. Video was terrible. Wouldn't focus on stuff. If you zoomed in or out during videoing the sound would stop. Missed many good moments while using this camera. After 2 1/2 months I finally upgraded to the Nikon Koolpix s8200. Much better. I don't recommend the Samsung st65 to anyone. You WILL BE DISAPPOINTED. It may be a great price and have lots of MP but it's not a good camera. Sorry.", "Date": "March 13, 2012"}, {"Title": "Wonderful Camera for Amature Wanna-Be Professionals", "Author": "Samsung Camera Lover", "ReviewID": "R10EZU51MKCTZM", "Overall": "5.0", "Content": "As the title states, this is a wonderful camera, convenient for an amateur photographer who wants to become a professional.  It is simple and easy to use, so simple in fact, you don't really have to read the manual! The greatest features of this phone are that you can take videos, as well as transfer pictures to your computer/drive, via either an adapter that fits the tiny video card into a larger one that fits into the lap top slot or by using its cord that attaches to camera and has a USB port on the other end.", "Date": "March 20, 2012"}, {"Title": "not as good as i thought", "Author": "Heike", "ReviewID": "R9RRMVAGC88T9", "Overall": "2.0", "Content": "Unfortunatly point and shoot is not what you can do with this camera.More than  50% of the time the pictures are blurry, even if nobody in the pic is moving.  its frustrating! a lot of times the lighting is off as well and it looks yellowish... not a good buy, i was hoping for better", "Date": "January 11, 2012"}, {"Title": "Unreliable", "Author": "mertyman \"merty31\"", "ReviewID": "R27WGXIJK6FQFZ", "Overall": "1.0", "Content": "Bought this camera in May 2011 and the playback button is no longer working just four months later. Samsung's \"warranty\" process is extremely opaque.My feeling is just that its a junky camera.", "Date": "October 4, 2011"}, {"Title": "Nice Camera", "Author": "Mommy", "ReviewID": "R3J0VUBM9QR5DF", "Overall": "3.0", "Content": "The camera is nice, I haven't had it long enough to review but want to be sure your aware that the memory card that Amazon shows as \"what other customers have purchased along with this Camera,\" doesn't work for this camera. Its the wrong size. This camera takes a micro SD or SDHC memory card. The camera bag they also showed as additional customers purchased along with the camera, works fine. Samsung EC-ST65 Digital Camera with 14 MP and 5x Optical Zoom (Silver.)", "Date": "July 15, 2011"}, {"Title": "Good little camera for the price", "Author": "C. Hobson", "ReviewID": "RXRM4KOCWW41F", "Overall": "4.0", "Content": "For the Price it's not bad.... I take in on vacation for snapshots.... it fits in a pocket so it's easy to carry... Be careful about the rear screen it cracks easily, If it cracks it doesn't effect the images and it you can buy a replacement screen from EBAY.", "Date": "December 20, 2012"}, {"Title": "EXCELENTE", "Author": "maria nuñez", "ReviewID": "R2VUBMUQHI07V", "Overall": "5.0", "Content": "QUEDE MUY A GUSTO CON EL EQUIPO LLEGO EN BUENAS CONDICIONES EXCELENTE Y MUY BONITA ME ENCANTO EL PRODUCTO Y  LO RECOMIENDO", "Date": "December 8, 2012"}, {"Title": "Cute in size, powerful in functionality", "Author": "W. Napoles", "ReviewID": "R6V5GH8PBTSF9", "Overall": "4.0", "Content": "I've had this camera for less than a week now, so this review is quite premature and, hence, the 4-star rating.  I can at least comment on its storage card functionality.  When I inserted a Kingston, 4-GB microSDHC card into this camera and powered it up, I got the \"Card error\" as stated on p. 83 of the user manual.  And no matter which button I pressed next, the camera would not navigate away from the screen showing the suggested remedies for the card error.  So, I surely believed that it would not allow me to properly format the card. The Kingston, 4-GB microSDHC card was readable and writable on my laptop running Windows 7 Enterprise.  I even tried the suggested remedies with no luck before submitting a support e-mail at Samsung.com.  They gave to me the same remedies.The Kingston, 4-GB microSDHC card was formatted in the XFAT, FAT, FAT32 & NTFS formats on my laptop.  For each format, the camera still yielded the \"Card error\" message.Next, I decided to experiment.  I took the Samsung 8-GB microSDHC card out of my HTC smartphone and used it in the camera; the camera properly operated.  Based on this, I formatted the Kingston, 4-GB microSDHC card in my smartphone and used it in the camera; the camera now properly operates.  I submitted a follow-up support e-mail to Samsung reporting my resolution in hopes that it might help someone else.Anyway, I have not played with a majority of the features.  Navigating the menus was quite simple because of my experience with my Canon Powershot A75.  I have taken only a few shots (at the 5 MP resolution) with it so far.  I did record a brief, indoor video; it turned out well.  I will play with it more and take shots at the higher resolutions and upload them to a PC to post a better-educated review.", "Date": "September 18, 2011"}, {"Title": "No me ha llegado el producto", "Author": "Yessica Sayago", "ReviewID": "R2HLUYB60JC6YQ", "Overall": "1.0", "Content": "Muy Buenos Dias Esta Compra he contactado donde deberia a ver llegado para que me la envian a Caracas- Venezuela, y no me ha llegado a la direccion de alla de Miami", "Date": "July 6, 2012"}, {"Title": "great", "Author": "DORIS", "ReviewID": "RX928JXXHYH9Q", "Overall": "5.0", "Content": "this camera was to give in a lot of staff of the company where I work. was won by a girl and was fascinated.", "Date": "February 2, 2012"}, {"Title": "color confusion", "Author": "blushingbride", "ReviewID": "R3AK80KAK7NUN4", "Overall": "4.0", "Content": "The quality of the camera and the functions it performs are just as promised.  I have a similar samsung camera I use everyday and have been equally happy with both purchases.  I actually purchased this camera as a gift for my mother, specifically because the indigo blue matches her car (seriously:).  I was disappointed to find out that the camera is only colored on one side, and boring black on the other.  She is very happy with her gift, but I only wish it was blue all the way around like my other samsung.  The two tone makes it look a little cheap, although the overall quality is good.  The look of the camera is not as expected.", "Date": "May 7, 2011"}, {"Title": "Long wait times, no bait times!", "Author": "googlymoogly", "ReviewID": "R2MDM0ELPXAA3E", "Overall": "5.0", "Content": "Today I would the chance to explain to you the many various benefits of obtaining and owning a sleek new ST65. First of all It has many great features such as fish eyes that you most definitely can't live without.  Fish eyes has to do with the way a fish sees in the world down under. Their view is different due to the way the water bends the light as it's passing through. This is great for anyone wanting to reenact jaws or someone creating a promotional fishing video. However, this seriously limits the photographers experience as not only will they no longer want to take normal photos, they even may because sick of taking photos all together! This is due to the fact that fish eyes is a rather experimental program which causes the camera to crash frequently whenever fish eyes isn't activated. In my own personal experience, I can say I've exchanged my ST65 4.5 times already and to no avail, I've encountered the same exact problem. So while fish eyes is grat for you water enthusiasts, for any serious photo enthusiast this is not worth their time.Regards, Ryan,", "Date": "March 20, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Power Optical : 27mm Wide Angle 5X zoom\nEasy of Use : Smart Auto & HD Movie\n720 HD Movie 14 Megapixel 2.7 LCD", "Name": "Samsung EC-ST65 Digital Camera with 14 MP and 5x Optical Zoom (Indigo Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/414ZqZ2kmRL._SX300_.jpg", "ProductID": "B004NWC31U"}}