{"Reviews": [{"Title": "Great Camera, Okay Equipment", "Author": "TygerTy", "ReviewID": "R19A54L5R40NKY", "Overall": "4.0", "Content": "CAMERA AND LENSES:The Camera and lenses (obviously) are the key points in this package; They are brand new, genuine (I've registered them with Canon), and covered by a limited warranty.The camera (and kit lens) is definitely something I don't regret as it takes great pictures (in my opinion) better than the Rebel Xs AND it takes HD video.  These qualities make it a great starter camera for me (before I decide to go pro).The 75-300mm lens is also a great addition, as it helps you get closer to wildlife and to those \"Out of Reach\" objects.THE EQUIPMENT:The Equipment set is great for a beginner as it includes items that are essential (such as the Extra Battery, SD Card, tripod, UV filters, and case).  You'd be buying them elsewhere, but on the flip side...The case isn't recommended, as it has buckles and not a zipper for the main compartment. It is frustratingly inconvenient to try and get your camera out in a hurry when you have 4 buckles to undo.  Buckles also mean that there are open gaps in between each buckle that make you worry that something (like a lens) would fall out.The tripod is okay if you need one, as it works and that is about it (it does have a level on it, for what that's worth).  If you are looking for a great tripod, I'd say go and buy one elsewhere for $100-200; you are just getting your money's worth in this package deal tripod.The 16GB SD card I received was a Transcend, so a decent name-brand.  It's size makes it ideal for video; your still pictures will not fill this up if you are emptying them after a shoot.The Memory Card wallet is only needed if you have more than 1 SD card.  The card reader is useful if your computer doesn't have a built in card reader.Screen Protector and UV filters are very, very, very advised to have.  They protect the camera from yourself (finger smudges, facial oils, etc) and scratches and the actual lens from scratches, finger prints, dust, etc. also...IN SUMMARY:If you just want to get started and have a budget, this is for you.If you have a bigger budget, buy the camera individually and buy some quality equipment using this set as a reference for what you should put on your checklist.Credibility: myself (visit [...])", "Date": "June 18, 2011"}, {"Title": "Awesome Camera!!!", "Author": "FJCruiser44", "ReviewID": "R2K40ZKH4PSFHJ", "Overall": "5.0", "Content": "Overall the T-3 is a great camera to begin digital SLR photography with.  It is very easy to pick up and shoot with.  As you get more familiar with how all the settings affect your photos it makes the transition from auto mode to full manual an easy one.  The start up time is fast which helps when you're in a hurry to get a great shot and the auto focus seems pretty quick.  I was really impressed with how great all of the pictures turned out after the first day of shooting with it.  The only slight downside I found was that it feels a little light and doesn't have much heft to it.  While this makes it great to lug around all day it does feel a little unbalanced with a longer lens on it.  I bought the full package with case, tri-pod, card, filters and lens cleaning kit.  I didn't expect to get top of line accessories but was really un-happy with the quality of the case and lens cleaning kit.  They were of very poor quality.  My advice would be to get the T-3 with body and lens and skip on the kit with accessories and buy your own.", "Date": "July 18, 2011"}, {"Title": "Great package", "Author": "Al", "ReviewID": "RQVYPB0IP8PSH", "Overall": "5.0", "Content": "Has everything needed to start shooting right away. the lens combination provides a wide range for shooting, and the extra battery, UV filters, memory card and case provide what most users will need. The camera is a good starter digital SLR, easy to use, affordable yet sophisticated enough to get some very high quality shots. I like the included tripod: it's stable, with a quick release mount & bubble levels for ease of use, and a built-in handle & case w/strap for easy portability. I'm not as impressed with the case. It's a decent size, but leaves little room for additional accessories. Also, I'm finding that small bits of lint attract themselves from the interior to the lenses, so they need to be checked & blown/brushed clean when swapping lenses. Overall I'm extremely happy with this kit. It replaces an old 35mm SLR & accessories that were stolen and the insurance settlement paid for nearly the entire kit: not bad considering the vast difference between a 25+ year old manual focus film camera and a modern fully automatic digital camera.", "Date": "March 11, 2012"}, {"Title": "Canon T3 camera and accessories from Cameta Camera", "Author": "El JayO \"El JayO\"", "ReviewID": "R1KS31A99FXEHD", "Overall": "5.0", "Content": "There are a number of T3 camera accessory kits available from Cameta Camera.  The Canon T3 is a great camera.  Tripod is good but not the best.  It is light-weight, has multi-segmented legs that allow you to set the camera at variable heights.  It comes with a zippered case and shoulder strap.  The extra battery is top quality.  The camera carry case is fully padded with adjustable panels to customize the internal pockets to your requirements.  There is an external, front, zippered pocket as well as another zippered pocket built into the underside of the case cover.  Memory card is a class10. There are 2 Vivitar UV filters, one for each Canon lens.  Battery charger is compact and light-weight.  Both camera lens are Canon original products with full warranty coverage.  You register the camera and lens at the Canon website.  This camera and accessory kit from Cameta was perfect for me.  Delivery was on time.  Everything came in a large box with the camera, lens, and each accessory individually packed in the original manufacturer's packaging.  Cameta Camera did a follow-up email to ensure I was pleased with their offering.  They seem to be genuinely interested in your satisfaction.  Great package and a great value.", "Date": "April 8, 2012"}, {"Title": "Easy to Use & Great Quality", "Author": "Amazon Customer", "ReviewID": "R3QP7ZO71JFY6I", "Overall": "5.0", "Content": "This is my first \"real\" camera and its ease of use is great.  The quality of the pictures is great, the kit that included the camera with lens, the big lens, two filters, 16GB card, a card reader, card holder, carrying case, camera strap, tri-pod, cleaning kit, spare battery, battery charger and lens protectors was the most complete kit I have seen for the best price.  I was at another large discount/warehouse store the other day and saw the same camera and lens, a 4GB card and a cleaning kit for $75 more than this one.I would recommend this to anyone!", "Date": "January 16, 2013"}, {"Title": "Easy Breezy", "Author": "Isbelis Maltby", "ReviewID": "R1DE9YGZNJ9DKT", "Overall": "5.0", "Content": "Great Camera, easy to use especially if you have owned a Canon. I have only used point and shoot in the past and I received the camera 2 days before our vacation in Punta Cana. Without any major reading of the instructions I was able to take phenomenal pictures. LOVE the extra zoom lens I recieved with this package! I took some great shots of my boys para-sailing with it. Something I would have never achieved without that lens. The battery life is long! I took hundreds of pictures and only charged it once during our 10 day vacation! Still learning but taking great pictures as I go. BEST PART was that I was able to get close up pictures of the boys at there Christmas concert even though I arrived late and was all the way in the back of the auditorium! I also took some awesome action shots of the boys at their basketball games. Extremely happy with my puchase!", "Date": "January 13, 2013"}, {"Title": "Great camera, Great deal", "Author": "Warren Spencer", "ReviewID": "R26TAJ7VQTIKBE", "Overall": "4.0", "Content": "Love this camera. Yes it might not be the best on the market but i recommend this to anyone who wants to start photography and dont have a lot of money to spend up front, to purchase this combo. This camera takes beautiful pics once you get the hang of it and the added accessories is a must have to fully utilize this camera. I have no complaints. Delivery was also prompt and recieved as promised.", "Date": "May 26, 2012"}, {"Title": "Canon EOS Rebel T3", "Author": "Jaybre007", "ReviewID": "R1P3GAN771LSFH", "Overall": "5.0", "Content": "This is a great camera at an outstanding price bundled with a lot of incredible things. I love the ease of use and the wonderful pictures it takes. I highly recommend this camera to a person who wants SLR quality pictures but on a budget.  Some of the other fancier cameras have more options.  Options that I know I will never use.  This camera replaces my iPhone camera that just wasn't cutting it anymore. I wanted a camera that could zoom optically and give me great resolution when I enlarge on my computer.  This camera does that. This camera is easy to use and use all the functions that come with it.  Thanks!  Very Happy Customer.", "Date": "April 24, 2012"}, {"Title": "Lots of camera for the money", "Author": "otdave", "ReviewID": "R2HPC3VR2670QM", "Overall": "5.0", "Content": "My wife and I have been contemplating purchasing a digital SLR for a while.  We are by no means professional photographers, so this camera is pretty much all we need.  Haven't gotten into all the \"professional\" features yet, but have had the camera for a few weeks now, and are quite happy.  Got a good deal with this camera and all of the accessories.  Had we bought it in the stores in our area, we would have paid $20 less....for the camera only.  The accessory bundle makes this a great value for your dollar.", "Date": "January 2, 2012"}, {"Title": "canon t3 with 75-300mm lens", "Author": "Edwin", "ReviewID": "RL8CKCSN6UB1A", "Overall": "5.0", "Content": "more then reasonable price for bundle.wasn't expecting a shoulder strap to come with the bundle, it does!parents loved it as a Christmas present.", "Date": "January 17, 2014"}, {"Title": "Canon camera", "Author": "Tom", "ReviewID": "R16GW3QT7QMJ5V", "Overall": "4.0", "Content": "Found this online and the package was a much greater value than if I bought all the items separately.  Fairy easy to use but need to watch several youtube videos on all the features.  Very happy with the Canon...2 months of data so far.", "Date": "January 13, 2014"}, {"Title": "Great entry level camera", "Author": "Edward Herbster", "ReviewID": "R28O6LKM5Y8QGP", "Overall": "5.0", "Content": "Bought this camera for my wife for Christmas. The only experiance she has ever had was a point and shoot type. With this camera on the full auto setting, she is taking outstanding pictures of our son playing basketball. This camera is VERY easy to use. I would recomend this Cannon Rebel to any enty level photographer. Great bundle package that has everything you'll need. Thanks Canon for putting an affordable bundle together that works great!", "Date": "January 8, 2014"}, {"Title": "Great Set", "Author": "Joemanchu \"Joemanchu\"", "ReviewID": "R1BPOV6BC1GFOO", "Overall": "5.0", "Content": "I ordered this for my Canon Rebel for doing a variety of sports related shooting. The package was generous and provided all that I needed and then some. It came as advertised and within a few days. I would recommend the seller.", "Date": "June 17, 2013"}, {"Title": "Great Camera", "Author": "no", "ReviewID": "R2EU0CYOMTZQL1", "Overall": "5.0", "Content": "I have had this camera about two months and it was very easy to get started taking great pictures.  Still have a lot to learn, but very happy with the whole package.  love the zoom lense.", "Date": "April 5, 2013"}, {"Title": "Best Camera!", "Author": "Mary Krason Wiker \"Mary\"", "ReviewID": "R2IF2C3UQC8VHA", "Overall": "5.0", "Content": "I'm not a professional, but this camera is great for an amateur like myself. Takes lovely, high-quality photos. I bought it to take pictures of my newborn. Very good \"family\" camera.", "Date": "March 18, 2013"}, {"Title": "Love it", "Author": "Jodi C. Smith", "ReviewID": "R353NHFTY9A2VA", "Overall": "5.0", "Content": "This product came with everything shown.  This is my first digital camera and being no expert (on anything, but especially technology) I found it easy to use and put together.", "Date": "February 6, 2013"}, {"Title": "Cannon EOS Rebel T3 12.2 MP Digital Camera and Kit", "Author": "James O. Perkins", "ReviewID": "R23XBHN7QVIGN1", "Overall": "5.0", "Content": "This Canon EOS Rebel T3 12.2 MP Digital SLR Camera Body & EF-S 18-55mm IS II Lens with 75-300mm III Lens + 16GB Card + Battery + Case + (2) Filters + Tripod + Cleaning & Accessory Kit is a great product as you would expect from Cannon.  For all except for a professional this Kit with all that is included is more than adequate for all others camera needs.  It was a great purchase!", "Date": "January 29, 2013"}, {"Title": "Awesome Package!", "Author": "A. Harbin", "ReviewID": "R2N1ZHDHFKA4C5", "Overall": "5.0", "Content": "Love this camera!! And all of the extras that come in this set!  Can't go wrong for the casual photographer or beginner!", "Date": "January 11, 2013"}, {"Title": "Excellent Product", "Author": "Partha", "ReviewID": "R2VWJ9CJELZEB9", "Overall": "5.0", "Content": "This is a total combo pack for Canon T3 ...contains everything you need.total pack is really in this price range.", "Date": "January 6, 2013"}, {"Title": "very nice deal", "Author": "adil", "ReviewID": "R9QLPR2ZPPTBR", "Overall": "5.0", "Content": "i loved the product and comes with everything you need to start. highly recomended for bigenners and for fun stuff.", "Date": "December 12, 2012"}, {"Title": "cannon t3", "Author": "G. Fuller", "ReviewID": "R2QCCU13YUAWYM", "Overall": "5.0", "Content": "Very simply a great camera. If you are like me and just want to capture all of your photos with out image blur. Then this is the camera 4u. Very easy to use, cameras on screen directions tell u what settings to use. Just point and shoot. The camera makes u feel like a professional. All the gadgets that come with r a plus. buy this bundle u wont b disappointed. So get it play around with it, start talking beautiful pic's that will last a lifetime.....smile", "Date": "October 15, 2012"}], "ProductInfo": {"Price": "$534.95", "Features": "KIT INCLUDES 12 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon EOS Rebel T3 Digital SLR Camera Body & EF-S 18-55mm IS II Lens + <2> Canon EF 75-300mm III Lens + <3> Spare LP-E10 Battery for Canon +\n<4> Transcend 16GB Class10 SD Card + <5> Vivitar 58mm UV Glass Filter + <6> Additional Vivitar 58mm UV Glass Filter +\n<7> PD Digital SLR Camera Case + <8> Precision Design 57-In. Tripod + <9> LCD Monitor Screen Protectors +\n<10> PD SDHC Memory Card Reader + <11> PD Memory Card Storage Wallet + <12> PD 6pc Complete Cleaning Kit", "Name": "Canon EOS Rebel T3 12.2 MP Digital SLR Camera Body & EF-S 18-55mm IS II Lens with 75-300mm III Lens + 16GB Card + Battery + Case + (2) Filters + Tripod + Cleaning & Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51qFWl-gE6L._SY300_.jpg", "ProductID": "B004OSTUSC"}}