{"Reviews": [{"Title": "Your mileage may vary.", "Author": "Michael Poole", "ReviewID": "R1Z6OIF0ZDM5S2", "Overall": "3.0", "Content": "This package was going for around $760-780 range at the the time of purchase. The items pictured are not brand specific, so I wasn't expecting top of the line stuff, but what I got was substantially less than what I was expecting.The camera, of course, is a good product currently available around $649 anywhere. The package I received contains everything shown, but they are extremely cheap versions. For example, the bag is a $7 one looking nothing like the one pictured and with little padding of any consequence. The tripod is an $8 item and feels very flimsy. It'll do as a starter, but I don't expect it to last long. All of the other items are similar in generic cheapness.Looking up the average price of each of the items in my particular package, I actually paid more than if I had bought the camera separately and all the items individually. Pretty disappointing and I was tempted to return it.I'm considering it a lesson learned: unless the items in a package are clearly specified so you can verify your savings before hand, skip it.Love the camera, though.", "Date": "July 2, 2011"}, {"Title": "Awesome camera; decent package for the price", "Author": "Edge14", "ReviewID": "R2BGNRMJYFQST7", "Overall": "4.0", "Content": "Camera is awesome. I've had a few issues with the memory card, but I was using my camera for about an hour outside in 30-40 degree weather. Other than that, no problems with anything. The tripod is okay, nothing special - it gets the job done. The bag is decent as well containing enough room for an extra lens, extra battery, the camera itself; it also has many zippered compartments. Overall it's a great packaged deal for the price.", "Date": "April 18, 2011"}, {"Title": "good camera, questionable accessories", "Author": "Bob Lane", "ReviewID": "RSPWMBT0K6P83", "Overall": "3.0", "Content": "The camera and accessories seem like  quite a bargain until you discover that the tripod stand is too small to use because it won't support the weight of the camera with the accessory lens included and isn't tall enough for a person of shorter stature to use.  Secondly the camera bag won't hold all of the equipment purchased.  You might as well buy the camera for less and buy your own accessories that work together.  This bundle rates poorly.", "Date": "December 13, 2011"}, {"Title": "Seller does not do as promised", "Author": "tashcov", "ReviewID": "R3S11HMOH7YHBL", "Overall": "3.0", "Content": "Very happy with camera, but the seller did not include battery.  Ordered last May and have had communication with seller on many occasions.  They have promised to send the battery and still have not done so.  I have made Amazon aware of this problem and am very disappointed.Nikon D3100 14.2MP Digital SLR Camera with 18-55mm f/3.5-5.6 AF-S DX VR Nikkor Zoom Lens + EN-EL14 Battery + 16GB Deluxe Accessory KitSold by: HCcost", "Date": "January 11, 2012"}, {"Title": "great bundle", "Author": "Jennie Ray Masterson", "ReviewID": "RB9MMX7BUAQHY", "Overall": "4.0", "Content": "I've had this bundle for 4 months now. I feel like I got a great deal on it. I use the camera all the time and it was so nice that it came with an extra battery! The reason I did not give it a 5 star is because something is wrong with the tripod that came in the bundle. It doesn't support my camera's weight. It just flips to the side. I've tried adjusting every knob and nothing helps. I contacted the seller to see if they would do anything about it and they said there was nothing they could do. I was pretty bummed because the tripod was half the reason I got this bundle. Overall satisfied, just bummed they would't help.", "Date": "January 17, 2014"}, {"Title": "Great value!", "Author": "regjott", "ReviewID": "R1B64UAD2RYAAO", "Overall": "5.0", "Content": "This was purchased as a gift for my daughter. She is trying to improve herself as a photographer. It works.", "Date": "January 16, 2014"}, {"Title": "Amazing Bundle Deal", "Author": "Tracy Anderson", "ReviewID": "R3CCCEE9PZ3CQI", "Overall": "4.0", "Content": "This is a review for the bundle rather than the camera. I was on the fence about whether to get the D3100 from Target or Amazon. I am so glad I got it from Amazon. This bundle saved me so much money in the long run. The bundle included a tri pod (in a carrying case!), the camera, a 16 gb memory card, a memory card wallet, camera case, screen protectors, and camera charger. The case looks great! Cases comparable are around $30 so I already saved money there. I did not like the screen protectors. You had to cut them to the size you want. Once I cut them there were air bubbles! If you are going to get the D3100 you should get this bundle! Just the memory card, tri-pod, and camera bag are worth it alone! The camera bag had many pockets and fit all my goodies. The case was well padded, and very sturdy.", "Date": "December 28, 2013"}, {"Title": "good", "Author": "Clairmonte", "ReviewID": "R49409VLRUD03", "Overall": "4.0", "Content": "this product was a good bargain, every item was reasonable and i am satisfied. it four stars because the are not the best in the business, but the best for the money paid.", "Date": "November 1, 2013"}, {"Title": "Great products for a great price", "Author": "Juan Garibaldi", "ReviewID": "R1MFEQNN8GQ5F2", "Overall": "4.0", "Content": "One of the bag's zippers was broken, and after a few uses the replacement battery stopped being recognized by the camera as a valid battery.Except for those two inconvenients, everything worked as expected.", "Date": "September 7, 2013"}, {"Title": "Awesome!", "Author": "Jeffery Patterson", "ReviewID": "R3R5LHDLQJYERJ", "Overall": "5.0", "Content": "I bought this package for my wife and she is super happy with it. The only complaint I have is that she just hasn't found the time to read up on it and use it to it's full potential.", "Date": "August 31, 2013"}, {"Title": "Great beginners bundle.", "Author": "Peezr", "ReviewID": "R3123M43MD04ET", "Overall": "5.0", "Content": "My wife wanted a decent camera for amateur photography and this deal has turned out great. The camera itself is wonderful and I would give 5 stars on its own. The carry bag looks small but it can easily store everything that comes in this combo (except tripod) with no problem. In the few weeks I've had it I have used everything except the extra SD card holder since the one card can hold thousands on it. The SD card reader is very slow though, I have a USB cable I plug into the camera directly which uploads much faster without removing card. The little cleaning kit seems decent enough, the HDMI cord is great for looking at your photos on a big screen TV at full resolution. The screen protector is ok, it has to be cut to size but you have three chances to get it right. I don't use the LCD screen anyway as it eats battery life and reduces performance. UV filter is nice quality I just leave it on. The tripod is light and simple to use, it might be cheap but unless you abuse it then it works fine at holding a camera still. Extra battery is great it holds almost double of the stock battery. Overall We are very happy with the purchase.", "Date": "August 8, 2013"}, {"Title": "Great purchase!!", "Author": "Bridget Diehl", "ReviewID": "RS9SUB9MZJVK8", "Overall": "5.0", "Content": "Purchased for daughter's birthday and she loves it!!  Camera takes awesome pics and all of the products that are listed in the kit are top quality, except the tri-pod-a little on the flimsy side and too light weight for the heaviness of the camera.  After pricing each piece in kit individually, the overall price doesnt compare to what I would have spent separately.  Would recommend this purchase to anyone looking for a nice camera and accessories.", "Date": "August 6, 2013"}, {"Title": "Very good product", "Author": "william", "ReviewID": "R1USE8WQ248LDI", "Overall": "4.0", "Content": "The kit came with everything you described in your post.Easy installation and configuration manuals.I recommend this computer to start in the world of SLR cameras", "Date": "July 24, 2013"}, {"Title": "The perfect gift!", "Author": "Julie M. Reil \"KREIL\"", "ReviewID": "RPPOJV6UURYKI", "Overall": "5.0", "Content": "This was a graduation gift for my daughter who had taken photography classes using this camera. This packaged set contains everything a photographer needs when starting out on there own photographic journey. The resolution is wonderful and the prints are flawless. I highly recommend this set for its' quality and great value. Arrived promptly, packaged very well and would purchase as a gift again.", "Date": "June 20, 2013"}, {"Title": "Re:Purchase and prompt delivery of Nikon Camera D3100  and support accessories", "Author": "Henriette M. Schwab", "ReviewID": "R3B4C4IYWBIIJK", "Overall": "5.0", "Content": "All camera items purchased were delivered promptly and included all support components indicated (2 batteries, camera tripod etc.)  I appreciate your quick response and shipment.  We use Nikon gear for weddings, foot races, family photos etc. and very much appreciate being able to purchase and use additional photo gear in so quick and effective a way.  We had checked local stores and all cost more to buy locally a camera without support components than buying on line the camera and a well thought out group of support components.ThanksDennis & Henriette Schwab7018 Lake StreetLoudon, NH 03307", "Date": "June 9, 2013"}, {"Title": "Happy Wife, Happy Life", "Author": "Kerfeld", "ReviewID": "RNZXPMOCRJ4DN", "Overall": "5.0", "Content": "Purchased this package as a birthday present for my wife.  It is a great camera for amateur photographers with experience beyond just point-and-click.  The package (as opposed to just the camera) has lots of good extras that amateur photographers would find valuable.", "Date": "May 29, 2013"}, {"Title": "In love", "Author": "infinitey", "ReviewID": "RXEBG2XF3A1HE", "Overall": "5.0", "Content": "I've always wanted a camera and this pack made it all perfect for me. Plus cheap. So reliable. Just the best purchase I ever decided to make on Amazon.", "Date": "May 24, 2013"}, {"Title": "Camera is nice, the bag is cheap.", "Author": "Sunshine", "ReviewID": "R1FGBDSI1VUZN0", "Overall": "4.0", "Content": "The bag strap broke the first time putting the camera in the case.  The camera is very nice, and seems to work well, still getting used to it.", "Date": "May 21, 2013"}, {"Title": "Great for first timers!", "Author": "Jeffrey", "ReviewID": "R3IYZL67JXALWR", "Overall": "5.0", "Content": "I purchased this for my wife for Mothers Day. She absolutely loves it! She was able to just pick it up and start using it right away. There are many features she needs to learn about, but she will improve with practice and maybe some classes. For now, the point-and-click auto focus mode works really well, and the pictures look great!  The accessories were a good deal, and she has not had any issues with anything thus far. All-in-all I think it was an excellent purchase, and there are plenty of upgrade options for the future.", "Date": "May 18, 2013"}, {"Title": "just what I want.", "Author": "Lourdes Esteves Sierra", "ReviewID": "R208HLF4YLL1SA", "Overall": "4.0", "Content": "It has all items I needed to start in this special world. I just must choose another bundle, with a extra lens, but I'm still happy with this.", "Date": "May 10, 2013"}, {"Title": "Great deal", "Author": "Chris Betchie", "ReviewID": "R1QK5LCSPQUOP8", "Overall": "5.0", "Content": "I got this entire bundle for a steal!  My partner absolutely loves her camera and all the accompanying accessories.  Great buy!", "Date": "April 16, 2013"}, {"Title": "Does it All", "Author": "Stephen Hart", "ReviewID": "R2R4AVGIFHRNEW", "Overall": "4.0", "Content": "This is my first foray into digital photography.  The D3100 is fascinating in its ability to go from point and shoot photography into the world of professional photo shooting.  Even with the limited use I've had so far I've learned a lot about photography in general and how to use the more sophisticated capabilities of this camera.  I would definintely recommend purchasing a 55 - 200m zoom lense for the camera for taking long shots.", "Date": "April 5, 2013"}, {"Title": "Awesome product.", "Author": "iOS Developer from hell \"Dario ALT\"", "ReviewID": "R1TRLKFJ57FYPZ", "Overall": "5.0", "Content": "I really like this product, is a great way to get started with SLR. I would definitely buy another Nikon camera.", "Date": "March 25, 2013"}, {"Title": "All around great camera", "Author": "tommy king", "ReviewID": "R3ABKWN2UHIQOB", "Overall": "5.0", "Content": "I'm not a professional photographer, nor is my wife, but we decided to get a decent camera just for family use. This camera far exceeded our expectations. The manual settings are the most useful, and what make it feel like the biggest upgrade from our old point-and-shoot. Since we were planning to get it around Valentine's Day, I picked up a new Epson printer, and the printed photos from this camera are amazing.", "Date": "March 21, 2013"}, {"Title": "Everytihng is 0k", "Author": "Ciro A. Acosta Q.", "ReviewID": "R320VEH2BLWQN7", "Overall": "5.0", "Content": "This produt is all what I want, I am reading the manual, and so far, everything is good. . Thanks a lot. I am taking advantage of my Nikon.", "Date": "February 18, 2013"}, {"Title": "great package deal", "Author": "Lenore Dayon", "ReviewID": "R243185V9X1X7R", "Overall": "5.0", "Content": "accessory package was perfect!! It arrived before Christmas, which was not guaranteed due to my late order. Works perfectly and my child loved it", "Date": "January 21, 2013"}, {"Title": "very good", "Author": "DJ from K-ville", "ReviewID": "R1G6VTAKW9D9QG", "Overall": "4.0", "Content": "I am reviewing for my daughter as this was a gift for her.  She loves the camera and all the items that came with it.  If she goes on to school for photography, she will already have at least one of the cameras that are required.", "Date": "January 16, 2012"}, {"Title": "A GREAT BUY!", "Author": "PERFECT", "ReviewID": "R292A4POXYLVZD", "Overall": "5.0", "Content": "THIS WAS DEFINITELY A GREAT BUY.. CAMERA IS BRAND NEW AND THE CASE FITS ALL OF THE GOODIES THAT COME WITH THE CAMERA.. LENS, LENS CLEANING SUPPLIES, ETC.", "Date": "December 13, 2011"}, {"Title": "Love itI", "Author": "Travis Moody \"moodysmurff\"", "ReviewID": "ROVS3CFASPXVX", "Overall": "5.0", "Content": "For the price of the bundle you cannot beat it. The camera is just awesome, the bag holds everything with ease.", "Date": "November 5, 2011"}, {"Title": "Love this camera.", "Author": "Sudhakar", "ReviewID": "R24E8DFLJJK95L", "Overall": "5.0", "Content": "Excellent camera. But camera bag no good. The zip has broken. But the rest all is fine. Prompt delivery. Other accessories are all fine.", "Date": "October 3, 2011"}, {"Title": "Great starter kit!", "Author": "Stanhope", "ReviewID": "RAOR2LUQ5H9CF", "Overall": "5.0", "Content": "What great kit for a gift! This has everything at a fraction of the price you'll pay in the store. Really worthwhile and it all arrives on your doorstep. This works as a great starter package for the photography novice, including even DVDs with videos introducing the camera and good photography techniques.", "Date": "December 1, 2013"}, {"Title": "muy buen producto", "Author": "Eduardo Rodriguez", "ReviewID": "R25GQIWR6AIGO7", "Overall": "4.0", "Content": "me llegaron los productos anunciados, todo esta correcto, el bolso no es de muy calidad, pero sirve, me parecio muy bueno que la bateria extra fuera de marca nikon, no queria una bateria generica.", "Date": "October 8, 2011"}, {"Title": "Awesome camera", "Author": "Valerie Adkins \"book lady\"", "ReviewID": "R3QQ69OVN09JSZ", "Overall": "5.0", "Content": "I love this camera!!This camera is easy to use and makes great pictures.  I recently used it to take pictures at a cookout honoring my in-laws for their 63rd anniversary.  I took several group pictures as well as active shots of grandkids being kids. All pictures were awesome.", "Date": "June 16, 2011"}, {"Title": "awesome camera and a decent deal for the package", "Author": "yathindra", "ReviewID": "R2QBT1WO9VL9UI", "Overall": "5.0", "Content": "it basically came with everything they have mentioned and pretty fast shipping also. Nikon d3100 is anyway awesome. and the kit is reasonably priced. and yes it's a good deal", "Date": "May 22, 2011"}, {"Title": "Best Camera Deal Ever!!!", "Author": "Cynthia Hayward", "ReviewID": "RHTIW6X29Q85S", "Overall": "5.0", "Content": "Why buy just a camera when you can get this sweet deal with a wonderful camera case, and other accessories, all at once!  Everything you need is in this bundle and it was delivered FAST!  I LOVE IT!!!", "Date": "October 1, 2013"}, {"Title": "Amazing Kit", "Author": "Evan Davies", "ReviewID": "R3PP9QLCKCYKD0", "Overall": "5.0", "Content": "This package deal is incredible. With everything it comes with plus the amazing Camera itself, whats not to love? The memory card is a huge plus too! Also, being eligible for Prime Shipping made me even more excited to receive the package! Great purchase!", "Date": "August 7, 2013"}, {"Title": "Excellent product", "Author": "David", "ReviewID": "R34V5XAVD6QYUT", "Overall": "5.0", "Content": "This is a excellent product because take very good pictures and the complete packet is very comfortable.I love it", "Date": "May 2, 2013"}, {"Title": "immensly pleased", "Author": "mamatomany", "ReviewID": "R3F6Z6Y605B96H", "Overall": "5.0", "Content": "my daughter was very pleased with her \"early Christmas present\" - it arrived very quickly, with everything exceeding our expectations.", "Date": "November 13, 2012"}, {"Title": "great but...", "Author": "Fercho", "ReviewID": "RLQG3Y5PTLFGV", "Overall": "4.0", "Content": "Estoy muy feliz con la compra del paquete pero el maletin que recibi no es el mismo que esta en la oferta. graciasI am very happy with the purchase of the package but the briefcase that I received is not the same as this in the offer. thanks", "Date": "February 24, 2012"}, {"Title": "Nikon camera dslr 3100", "Author": "Bllabong18299", "ReviewID": "R3TZ8761KIDQSP", "Overall": "4.0", "Content": "I have been in contact with this company trying to get my camera on time for my vacation and they have been so helpful to me. I cannot wait to finally get this package in the mail", "Date": "October 27, 2011"}, {"Title": "Extremely pleased", "Author": "Steve in Louisiana", "ReviewID": "RRXMOYMBF3UW5", "Overall": "5.0", "Content": "I received the shipment of camera and accessories days in advance of the due date.  The package had even more pieces than I originally thought.  Everything was brand new in original packages.  This package was a great deal and was only 30$ more than just the camera and the lens would have cost me at Best Buy.  Excellent service, and shipment.", "Date": "August 25, 2011"}], "ProductInfo": {"Price": "$669.99", "Features": "Nikon D3100 14.2MP Digital SLR Camera - Body (Includes manufacturer's supplied accessories)\nNikon 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens - 52mm UV Protection Filter - 5pc Deluxe Lens Care & Cleaning Kit\n16 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nWell Padded Multi Compartment Gadget Bag with Pockets & Strap - Additional EN-EL14 Reachargeable Lithium ion Replacement Battery\nFull Size 59\" Tripod W/Case - Jumpstart Guide to Digital SLR Cameras - BONUS!! Mini HDMI to standard HDMI cable - Free 25 Quality Prints (Promo code # on invoice)", "Name": "Nikon D3100 14.2MP Digital SLR Camera with 18-55mm f/3.5-5.6 AF-S DX VR Nikkor Zoom Lens + EN-EL14 Battery + 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51bW2kSfEEL._SY300_.jpg", "ProductID": "B00420LJMC"}}