{"Reviews": [{"Title": "Nice Inexpensive Camera to carry with you.", "Author": "J. Kelly \"Quako\"", "ReviewID": "R2MC397YDNCBRK", "Overall": "4.0", "Content": "The camera is a nice backup or extra camera you can carry and not worry about if something happens to it.I have taken at least a couple hundred photos with the camera and the quality is very acceptable. It operates on regular batteries which is a real plus especially at the price of the more expensive type batteries today.The controls are a little bit confusing but the bottom line is the camera is somewhat rugged and takes good pictures.  You have that \"lag\" in what you see and what will be in the picture, so it's not a great action shot type camera.  If you want that quality you really need to buy an SLR.", "Date": "July 1, 2012"}, {"Title": "Very short battery life", "Author": "tacljones", "ReviewID": "R1H1SONXCV6D47", "Overall": "3.0", "Content": "This is a pretty good little camera, except that it works on 2 AA batteries.  My son put new batteries in, and less than 3 hours later they need to be replaced.  I tried to go to their website to see if you could buy a better rechargealbe battery, but didn't find anything.  I would recommend a camera that uses a rechargeable battery that has a longer usage time.", "Date": "July 24, 2011"}, {"Title": "great little cam", "Author": "curtis plowman", "ReviewID": "RJ6BDDF448ECS", "Overall": "5.0", "Content": "We bought a matching pair of these cameras. We wanted a camera that had common replaceable batteries that didn't need time to charge.  The camera has great optical zoom and fits nicely into their hands. The controls are great so we would recommend it to anyone.", "Date": "October 2, 2013"}, {"Title": "Kids' Cameras", "Author": "Sonya Salasky", "ReviewID": "RJQ0XRRDM8DH8", "Overall": "4.0", "Content": "Excited to put this camera to good use!  Ordered one for each of my kids (ages 13 & 10) for Christmas.  We travel quite often (day trips, weekend getaways, family vacations) and are prepping for a big family cruise in the middle of April.  In the past we have bought lesser quality cameras for the kids (even using left over disposable cameras from our wedding) but found that at least halfway through the trip I was being begged for use of my old point & shoot, my expensive DSLR, or my smart phone.  Trouble being I have only one point & shoot (arguments ensue), I am always behind my DSLR taking shots of them, and I need my phone (in case of emergency).  In one disastrous outing to Baltimore with lesser quality cameras, the kids found the camera only held maybe 30 pictures and would delete any previous shots if the camera was turned off!  Needless to say, a change was needed.  After searching, I found this camera and for the price the seller was asking, it couldn't be beat.  I am so pleased with the quality of the cameras and the features they offer.  I hope after some wear and tear that I still feel the same way!", "Date": "December 8, 2013"}, {"Title": "nice camera", "Author": "Debbie Coyne", "ReviewID": "R2JDTH91Y7VLY9", "Overall": "5.0", "Content": "Bought this as a gift for a friend and was amazed at the Quality of the photos, she is very happy with it.", "Date": "January 10, 2014"}, {"Title": "good little camera", "Author": "Lamscan \"lamscan\"", "ReviewID": "R199P1B56YJAJL", "Overall": "5.0", "Content": "TaKES  great pics and is easy to use. My friend loved it. This was a good choice for a Christmas present.", "Date": "January 10, 2014"}, {"Title": "camera", "Author": "dan medwed", "ReviewID": "R15A5NDUPOSYHR", "Overall": "4.0", "Content": "bought for Christmas gift person who got it is very happy with the pictures and the ease of use of this camera--this is 2nd GE basic digital camera and have been very happy with both. good quality cameras for the money...", "Date": "January 8, 2014"}, {"Title": "Great camera!", "Author": "jessica taylor", "ReviewID": "RRLAKD8M473DU", "Overall": "4.0", "Content": "Great camera! Bought it as a Christmas gift for my 6 year old. He loves it! Easy to use, durable and takes great pics!! The batteries that came in the package only lasted about 8 hours, with heavy use. I put in new batteries and they have lasted 1 week with lots of use.", "Date": "January 3, 2014"}, {"Title": "Very good camera!", "Author": "krystal", "ReviewID": "R34HN4J1MMOH83", "Overall": "5.0", "Content": "It takes good pictures and there are different settings on it that will fit what u need in order to take good pictures and it's awesome w/ taking videos as well! I went to a concert out of town last month and they turned out REALLY good!!!! I would recommend this camera to anyone!", "Date": "January 1, 2014"}, {"Title": "If you need and want a camera,  this is yours", "Author": "ROBERT SALOMON KIONGO BANKOUSSOU", "ReviewID": "R2KIBTM773TSCL", "Overall": "5.0", "Content": "This camera is great! amazing pictures! Easy to use. This was a gift I gave my uncle. He likes and loves it. He asked me if he needed another camera to buy him the same.", "Date": "December 31, 2013"}, {"Title": "Taking pictures is a snap.", "Author": "Joseph Foulke \"help wife\"", "ReviewID": "R3EC20BHY9VQ0A", "Overall": "5.0", "Content": "Great little camera for the money. Has more features than I can use. At 14 MP the pictures can take up a lot of memory to set some 16 GB Sd cards.", "Date": "November 29, 2013"}], "ProductInfo": {"Price": "$49.99", "Features": "GE A1455 14MP 5x Zoom Digital Camera", "Name": "GE A1455 14MP 5x Zoom Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31Sb%2Bw14sIL.jpg", "ProductID": "B00418W3I4"}}