{"Reviews": [{"Title": "Get this camera if you are serious about your photos!", "Author": "Silverkoup", "ReviewID": "R1DJI3OS9G2709", "Overall": "5.0", "Content": "First off I have 3 Sony alpha cameras now. I own an a230, an a33, and now the a580. Each one was a huge step from the last, however to my suprise, the a33 to a580 jump is quite a bit in terms of build quality, focusing, and just pure photography usage. The a33 is a great camera and I have gotten some amazing shots with it, but if you ever plan to use strobes, then forget  the a33/a55 combo they aren't compatible without a work around. Now I was at a cross roads with my photography now that I am earning little bits of money from it, was I to invest further into Sony, or jump ship cut losses and head to Nikon. I was looking into the Nikon d7000 (same sensor of the a580 FYI) and spoke with a few camera store \"experts\" which suggested just that camera. When asked what made the d7000 better than the a580, other than the metal body and faster shutter, I was told oh uh well it's a uh well it's nikon and they make good cameras. Don't listen to this garbage spewd by Sony haters. Camera companies are heavily swayed by the big 2. The a580 produces stunning photos, very crisp, beautiful color rendition, ergonomics are great nice and beefy, sure it is plastic but personally I don't shoot jagged rocks while rolling around and flapping my arms like a crazed bird so poly plastics are just fine plus get an accident plan and bang no worries roll as you please. Look all in all if you want a superb camera at a fraction of the cost of Nikon or Canon, look at this and at least consider because Sony's coming up in the ranks and Zeiss glass, come on Zeiss glass. You won't be dissapointed plus when folks see me shooting Sony and say oh you shoulda bought a Nikon, my photos shut them up real quick. Give Sony a break they make awsom cameras and the a580 is great.", "Date": "August 13, 2011"}, {"Title": "Better than Transllucent Mirrors", "Author": "WWJDwithCA", "ReviewID": "RQ181DMWYT2SM", "Overall": "5.0", "Content": "The Sony a580 is an excellent camera that has really been lost in all of the excitement with the new translucent mirror products, particularly the a55 and the new a77.  Just surveying the number of reviews, the a77 had four reviews before the product was even released and the a55 with 88!  The a580 has seven total reviews and its not only a better camera than the a55, it's a better camera than the a77!The translucent mirror products have the excitement because they are the first real innovation in single lens reflex cameras since the first digital SLR become affordable some 6-7 years ago.  The translucent mirror offers two trick innovations: 1. Fast continuos shooting (a77 can do 12 fps) with no interruption of your subject from a mirror moving back and forth and 2. Continuous AF during this fast shooting and during video recording.  However, they have two major drawbacks: 1.  Poor ISO performance 2. Electronic view finder.The a77 will cost you $1400 while the a55 is nominally the same cost as the a580.  Very interesting figures when you consider that the a580 is a significantly better camera than an a55 and still better than an a77.  With all the fancy features of the translucent mirror technology, it's still an inferior mechanism for taking quality digital images.Take the 12 fps continuos mode shooting of the a77; the a580 still manages 7 fps with fixed focus and aperture demonstrated with the 5 images I posted which is extremely functional, all while not having to suffer a 30% drop in ISO performance.  Sure, 12 fps is tremendous for sports photography, but ISO capability is usually just as important, so what did you yield in this case?  Well, \"What about daytime sports shooting?\"  Yes, ISO capability is not as important, but now you have too sight through a digital viewfinder that works poorly in bright conditions and can suffer delays where an optical viewfinder is the technology of choice.As you can see, the translucent mirror offers advantages, but like Newtons 3rd, an equal and opposite reaction which yields the advantage nearly moot.  The live view on the a580 is as slick as they come on true SLR's.  Check out the photo I posted of the Siamese cat; taken and ground level with ease using the a580's live view, which holds a backup sensor in the view finder so the mirror doesn't have to lift to see what's happening.  Shooting macro photography and need to make fine adjustments to the focus? Hit the Live View Check and the mirror lifts so you can do a final adjustment on the actual 16.2 mp sensor.  Very slick and very professional.All of the controls are well laid out and again, very professional.  The menus are very intuitive and have help for nearly every function, just wait a few seconds and the help system pops-up.  15 point autofocus works very well, maybe not to pro standards at low light level, but very good and accurate at the price level.My family loves the high definition videos.  The mp4 feature allows for easy use just about anywhere with excellent picture quality.  Again, the a77 can shoot video with continuous AF.  Seems like a great feature, but do you really want focusing noises during your filming and do you want to include false AF seeks?  Probably not, so your likely going to disable that function a great deal of the time and manual focus anyway.So while I do believe translucent mirror technology is the future of photography, and that someday Sony will own the prosumer SLR market niche.  There is still one component of the technology missing; a mirror with more than 90% of the light transferring to the sensor, and until then this photographer will be using moving mirror technology.  And uh-uhm, save myself a cool $650!", "Date": "October 9, 2011"}, {"Title": "Amazing Camera!!!", "Author": "tadingle", "ReviewID": "R1N0PZZAV56HGF", "Overall": "5.0", "Content": "After previously owning a Sony A550, which was an excellent piece of equipment, the A580 completely raises the bar!!!  With its large 16.2MP CMOS Sensor, 1080p video, and great picture quality, what more could anyone ask for.  I also love its ability to shoot at 7fps up to anywhere between 20-40 shots without slowing or stopping depending on the picture quality chosen.  I currently have it coupled with the 18-55mm Sony kit lens (from the 550)and a 70-300mm, of which both create a wonderful combination.  I have a 50mm F1.7 prime on the way as we speak (I can't wait!!!!).  If you are on the fence about this camera, just buy it.  You will not be disappointed.", "Date": "August 17, 2011"}, {"Title": "Sony's best DSLR", "Author": "Fabius", "ReviewID": "R2LEIM61H22IMV", "Overall": "5.0", "Content": "I have a Sony a300 and upgraded to the a580 recently - for the record, I really like the a300 and am keeping it. The a580 has some great improvements - mirror lock-up is great for those 500mm telephoto shots, depth of field preview is nice, focus check live-view magnification really makes it great for macros. Handling, size and feel is about like the a300, which was just right. I have a Maxxum 9 film camera and have tried the a900, which are both big, heavy and built like tanks. I also tried the a55, which is a bit small for my taste with the substantial Zeiss 16-80 lens. The a580 seems just right for everyday weight and handling.The image quality is just superb. If I pixel-peep I notice better resolution than the a300, and the dynamic range means less risk of blown highlights. Color is great. Hard to find any fault. I really did like the dedicated steady-shot button on the a300, now in the a580's menu - but everything else is better.If you are in the Minolta-Sony system, this is the best bet of the DSLR's and DSLT's. The a77 will be very impressive, but do you really need 24 mp?  If I need weather-sealed, I use the Maxxum 9 as a bad weather option and shoot / digitize film.I don't shoot much video, but the video quality looks very good to me. In short, the a580 is a real winner.", "Date": "September 25, 2011"}, {"Title": "Great camera", "Author": "M. Truong", "ReviewID": "R2PSOXIKTSKNOJ", "Overall": "5.0", "Content": "This is an amazing camera. I decided to pull the trigger after reading countless reviews and comparing versus other cameras. The menu system is extremely easy to learn and follow. The LCD is bright and beautiful which demanded that I buy a screen protector to protect its beauty. The image quality is phenomenal even up to ISO 3200! It's very durable and easy to take care of even though its made of plastic. The grip fits my hands perfectly as well as my girlfriend's. Compared to the Nikon D5100 (which I thought was a little small), the menu system seemed easier to learn and go through. I fumbled to find all of the menu buttons on the Nikon but I probably needed to take more time to learn it. With the Canon Rebel T3i, I thought it felt like just a piece of brick that took pictures. Yeah the images are nice but it just didn't feel right in my hands. The A580 is VERY easy for a beginner to pick up and use; you can set it on iAuto like a p&s; if you aren't familiar with the basics or you can just go through the easy menu and buttons and set it on PASM mode. If you need some help, Gary Friedman's book is extremely pleasing and you'll definitely learn a lot from it. I can go on and on about this camera but someone's already done that!I highly recommend this and you won't regret buying it if you do!", "Date": "November 2, 2011"}, {"Title": "great camera", "Author": "Sonja", "ReviewID": "R3RHN5RHNUSKV5", "Overall": "5.0", "Content": "Love this camera! Love the Pictures this camera produces! Great for the advancing Photographer!! Easy to use! Like any camera you get, it is so important to read the manual. The seller was fast to getting it to us! :) We are thrilled by this Camera!", "Date": "July 25, 2011"}, {"Title": "Excellent build quality, a top contender", "Author": "Sinore Espresso", "ReviewID": "R31N1RZ6B8KNMI", "Overall": "5.0", "Content": "I've had my 580 for about 3 months now, having captured thousands of images in a variety of lighting and other situations.  I shoot mostly macro,landscape and general nature photography.  This camera has been endowed with virtually every feature that a professional and most certainly non-professional would need.  There are a number of 'auto' modes that are easily employed to 'figure out for you' the proper aperture, shutter speed, flash, etc., to capture images from a variety of shooting situations.  Macro-photography, when done correctly, must make use of a depth of field preview.  I shot professionally many years ago with Minolta XKs and I am very happy to see that a lot of the ideas, as well as Rokkor lenses, were brought up to date but retained.  This camera retains the features of that great XK professional body and adds on to it with incredible technology.  Put it this way, the sensor that Sony has built for this camera is purchased by Nikon and Canon (at a minimum), so software is the only variable, obviously not including lenses.  That said, Sony has a lot of top Zeiss lenses, specifically made for their cameras and nobody but Leica (Leitz) can argue top quality there.I have cranked up the iso to the roof to look at noise issues and have found them so minimal as to not justify those talking negatively about it.  The LCD screen is large, clear, sharp and downright creepy for someone who has always used an eye level viewfinder.  It is really 'real-time', with absolutely no shaking or anything.  It has allowed me to advance in my own technique when it comes to macro-photography.  Regardless of where you find your interests, this camera is excellent and I am left without regret.", "Date": "October 9, 2011"}, {"Title": "Low-Light High-ISO All-Star Digital Cameras", "Author": "Tatiana Nicholas", "ReviewID": "R149TWVESVRJWX", "Overall": "5.0", "Content": "Sony Alpha 580The $900, 16.2MP  Sony Alpha 580's test results are virtually identical to the Pentax K-5 and Nikon D7000, although its ISO range tops out at 12,800 its signal-to-noise performance is identical to the D7000's right up to it stop ISO. The slight difference in quality at ISO 1200 is made up for by the fact that the Sony costs some $400 less than its competitors.", "Date": "September 21, 2011"}, {"Title": "Sony A580 camera kit", "Author": "matania ginosar", "ReviewID": "R1MHWWUT8364Y4", "Overall": "3.0", "Content": "Sony Alpha DSLR-A580 16.2 MP Digital SLR Camera & 18-55mm Lens with 16GB Card + Battery + Case + UV Filter + Cleaning & Accessory KitI have been a serious armature photographer for decades, using SLR and Kodachrome almost all the time with good results, so as I started to upgrade my digital cameras to an SLR type. I spent considerable time to find the right combination of light sensitivity, features, weight, camera feel and price. Serious reviews by several credible sources pointed me to the new Sony A580. I already had two digital cameras by Canon, and wanted to stay with it, but the reviews pointed to its unique high light sensitivity and few extra features and I bought a full kit three months ago via Amazon just before a 5 weeks overseas trip.I used two cameras during this trip, the Sony A580 and the compact Canon G12. In 95% of the time the Canon G12 was superior to the Sony because it was easier to use, lighter, easier to carry and had a very good quality 5 to 1 lens. And it cost only half as much as the Sony, but that was not an important consideration here.The Sony A580 camera performed well, especially in low light situation, but lacks in three important areas: lens quality, battery power, and service. The standard Sony 18 to 55 lens that came in the kit has only a ratio of three to one, much too limited, and the battery delivered about 200 pictures instead of the 560 range advertised on the case.The body of the Sony 18 to 55 standard kit lens is made from plastic and is poorly made: it is hard to set it to the right range. The rotating operation is not smooth in comparison to ALL CAMERAS I ever had and all the other SLR digital cameras I tried before and since. When I sent it to repair Sony told me nothing is wrong with it, it is simply how much force I want to use to adjust it. A serious company would not have sold this lens with a serious, high quality camera. I tried another identical model in the store, and it had the same deficiency, erratic movement.I checked the battery power without using any flash, and no movies, and still got only about 200 standard JPEG pictures. I asked Sony about it and they said they will mail me a new battery. That was 2 months ago. I called twice to find the status and they said they are out of stock. The third time they put me on hold for a long time and finally the line dropped.One more item, the battery charger has a long and heavy cord which takes a lot of space on trips. Most other chargers, such as the Canon, have just 2 prongs at the top to plug into a socket, saving space and weight too.I am disappointed. This is not the type of quality and service I would expect from a solid company that wants to stay in the photography business.", "Date": "September 7, 2011"}, {"Title": "HUNDREDS of hot white pixels at certain sensitivities and exposures", "Author": "Dr. Horrible's Sing-Along Review", "ReviewID": "R38U2UC0MT5VJ4", "Overall": "1.0", "Content": "WARNING*** Cons:ISO 800, 1600, etc. are filled with OVER A THOUSAND hot white pixels. Hot pixels on image sensors are, unfortunately, fairly common. What is intolerable is that Sony does nothing to ignore them, while the fix is fairly trivial.Thus, this camera body FAILS at one of the main purposes of a camera body: being able to take faster and clearer pictures in low-light with less noise. Zooming in even *slightly* into your image on a computer monitor will show hundreds and hundreds of white dots everywhere if you don't use the slowest possible ISO settings. Sometimes the bad pixels are so bright or numerous that they even show up on the camera LCD in an unzoomed preview. This seems quite ridiculous, as one of the main reasons to upgrade a camera body is to get better sensitivity with less noise, so you can photograph those dusk/dawn shots, or evening shots, or dim-light shots without using disgusting flash.You should note that Sony is manufacturing the image sensors for many DSLRs on the market these days, including some models of Nikon and Canon and Pentax and others. NEVERTHELESS, the Sony alpha DSLRs have terrible firmware which is unable to ignore (\"remap\") these hot pixels, while their competitors have smart firmware which is able to mask these pixels by \"filling them in\" with data from their neighbors.*** Replication of firmware bug:It is very easy to prove this, especially if buying this camera from a store or looking at demo models. Just set the camera to high ISO, set to time-priority mode, KEEP THE LENS CAP ON so the image is entirely black, and take a 0.8-second exposure (no longer). Then zoom in a tiny bit if you can't see them yet. At 1600 ISO you will see hundreds of white dots! (If you care about Boost ISO, they will appear as pure white, as opposed to half-white-half-grey, and you will see about 5x more.) I replicated this issue on two new Sony a580s before returning them, but could not do so on a similar Nikon and Canon, whose firmware seems to ignore these hot pixels.The reason that a 0.8-second exposure does the trick is that Long-Exposure Noise-Reduction kicks in at 1 second and longer. What this means is that if you take a 2-second exposure, the camera will lock you out and take another 2-second exposure immediately afterward (to see where all the hot pixels are), and subtract those out. It is a tragedy the camera does not do this for short exposures, since that would get rid of the entire problem.Thus, exposures above ISO 400 between 0.1-0.99sec are ruined by thousands of white pixels, which are very visible at scenes of any exposure level except overexposed.*** Anticipated FAQ going through your head:\"there's a pixel remapping function in the Menu! just look under...\"No, that's a pixel-remapping function for the LCD display, not the sensor.\"I don't believe you\"You can also ask the internet; other people have noticed the same thing, and there are specific forum threads about Sony DSLRs having this issue.\"Just upgrade the firmware\"I do not think that Sony is aware of this issue. Also as of writing this review, Sony has not posted any firmware upgrade\"I hear that Sony cameras remap hot pixels after every month, just set the time to a bit before the new month, over a month/year from now, and keep the camera on/off, or turn it on/off, then reset the date\"Doesn't work. Tried all possible things people have suggested. Perhaps some dots went away, but the blank exposures it is taking (if any at all) must be at extremely low ISO.\"Maybe it was a bad sensor\"Replicated with two cameras\"You got light leakage\"I tested this in a dark room, and the dots are 1-pixel in size\"It's dust. Clean the sensor\"These were new cameras that were tested, and the dots are 1-pixel in size. I did not have the proper blower for a sensor cleaning, but I doubt a sensor cleaning is required straight from the factory. Also, dust not show up as hot white with the lens cap on in a dark room (unless it's contributing to current leakage on the silicon somehow).*** Other cons:- Automatic panorama mode: It's a lie. The algorithm used to piece together stripes will result in terrible misaligned straight lines.- Multiple-exposure noise reduction was innovative, but added a decent amount of blur if held by hand. It was also rendered useless by the above hot-pixel issue, often resulting in many hot pixels in the final image.- Taking a 20-second exposure requires waiting for 20 extra seconds while the camera takes a 20-second blank exposure to subtract noise and hot pixels out. Smart, but not smart enough, since it's trivial to cache the noise data in memory (or on disk).*** Pros:If for some reason you have to use Sony, this camera does have some wonderful advantages, especially over outdated Canon cameras which rely on 1980s style LCD displays. Pros include:- Absolutely wonderful auto-HDR mode under the \"D. Range\" button. This is basically automatic tone-mapping at the touch of the button, and it's MAGIC. You can take a picture of a dark indoor scene against a bright noon sky, and you will get rich color in BOTH the sky and the inside, with NO overexposure. Magic! (It actually takes multiple shots at different exposures, and automatically overlays them using a tone-mapping algorithm.) This feature alone nearly made me want to keep my a580 despite the terrible problems above.- Accelerometric shake-reduction (with a shake indication light!) is built-in to camera body. This means that ALL your lenses benefit from anti-shake, so you don't need to pay anew for that feature with each new lens you buy, and can use anti-shake with specialty lenses where anti-shake is not available. Contrast with Canon and Nikon. Consequently, the camera and lens are relatively much lighter. This technology was basically acquired when Sony bought Konica-Minolta (The alpha mounts are basically Kanica-Minolta cameras.)- Ability to take movies- In my humble opinion, qualitatively better focusing that Canon Mark ii! (see EOS 5D Mark ii autofocus issues), and thus crisper images, even if slightly lower resolution- Many options to set preview duration, ability to zoom into preview***Of course, these Pros only matters if you can deal with A THOUSAND hot pixels.Thus basically, you *have* to either:- shoot in time-priority or manual-priority mode in low-light conditions- set ISO to always be manually set to 100-400 (not Auto-ISO)- post-process away hundreds of hot pixels in each imageIf you are a professional photographer and *always* do tedious post-processing, it is fairly trivial to mask these pixels in many pieces of post-processing software. You could even use Photoshop, by taking a high-ISO exposure, converting the greyscale, turning alpha into selection, and performing overhyped content-aware fill or similar.*** Untested:- 3D picture-taking*** ConclusionI cannot recommend any Sony DSLR alphas due to this hot-pixel issue. It would be a trivial fix to make it so that 1) the menu has a manual \"remap sensor hot pixels\" option, 2) the automatic sensor-pixel-remap done every month was documented and actually used high ISO, and 3) this was done out-of-the-factory. Or alternatively, the camera could just perform Long-Exposure NR on short-time exposures. Until these trivial fixes are implemented, be aware that you may have over a thousand burning white pixels on exposure times between ~0.1-0.99 seconds on anything but the weakest ISO settings, making this a very poor choice for indoor or twilight or nighttime photography.", "Date": "July 29, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.2 megapixels with Sony's Exmor HD APS sensor\n1080/60i Full HD movies2-the same as many networks\nImage layering: Multi-Frame NR & Hand-held Twilight\nAuto HDR captures more contrast than one exposure can\nIncludes Battery Charger (BC-VM10), Rechargable Battery (NP-FM500H), Shoulder Strap, Body Cap, USB Cable, CD-ROM", "Name": "Sony DSLRA580 DSLR Camera Body Only (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51ToGDye%2BdL._SX300_.jpg", "ProductID": "B004H7TC6U"}}