{"Reviews": [{"Title": "Finally!", "Author": "Robert Petkus", "ReviewID": "R3V3IKCEJF5M9Q", "Overall": "4.0", "Content": "When the Kx arrived, K7 owners who were more than content with their current bodies coveted the superior high-ISO (low light performance) capability of the Kx.  At least I did.  And while the K7 was a capable tool, I often found myself compensating for its weaknesses (which were limited to high ISO and autofocus continuous (AF.C) performance).  Not so with the K5.I won't go into the specifications since those can be found elsewhere but I'll give my overall impression - what I like and what could be better:+ Great ergonomics.  Love the compact, solid body which is identical to the K7 save for a heightened knob and elongated AF lever.  I was even able to use the same split prism focus screen I had purchased for the K7.+ Fantastic high-ISO performance - clean and offering far more flexibility than the K7.  I'd try never to breach ISO 800 on the K7 whereas the K5 is routinely pushed past ISO 3200.  While I wouldn't give it equal footing to a full frame camera, it's arguably the best APS-C out there in this application.+ Outstanding dynamic range -- shoot in RAW and leave your graduated ND filters at home.-+ Improved auto-focus, especially AF-C compared to the K7, but not quite on par with either the D300s or 7D in AF-C.+ User-friendly, easy to navigate menu system - white balance adjustments are a breeze.+ Good WB and JPEGs \"out of the box\"-+ Yes, 1080p video but at 25FPS vs. 24 -- surely a firmware update in the future- Audio records at 32KHz sample rate- Only has a single SD/SDHC slot - would prefer dual with Compact Flash- Limited to 1/180 X-Sync speed - but this is ample in most scenarios- Images shot in portrait don't autorotate on playback - but did on the K7(?) - again, a likely firmware update+ Blissful near-silent shutter+ Compatibility with all those great manual K-mount lenses of yore.Although I'm a long time Pentax user, I considered and evaluated both the Canon 7D and Nikon D300s without bias.  While both are outstanding DSLRs, I preferred the Pentax K5.An all-around excellent camera and a joy to use.  A noteworthy upgrade.", "Date": "December 9, 2010"}, {"Title": "K-5 Flawed but Fabulous", "Author": "Barbara Chambers \"Tekgirl\"", "ReviewID": "R3NFWOXJT5V1M3", "Overall": "5.0", "Content": "I've shot with the K-5 for a month now, and I'd like to share my viewpoints on it.  First, the noise level in the high-ISO images really is as excellent as the technical reviews say it is.  This means that you can use a higher ISO number and get results equivalent to other cameras at lower ISO numbers.  You can take your shot with either a faster shutter time (better motion freezing) or smaller aperture (better sharpness, etc) or just enjoy the reduced noise.  This puts the camera at an advantage over all other APS-C cameras and a few of the full frame cameras.  Next, the movie mode is a mixed bag.  It has the 1920x1080 at 25fps setting, as well as 1280x720 at 30fps settings, and lower settings too.  The 25fps setting is often quoted as a major problem, with videographers wanting to shoot 23.976fps as a \"cinema\" mode, but it takes only a bit of video conversion to change the frame rate to 23.976 and resample the 32k s/s stereo signal to match.  So, if you're desperate you can manage, but even then it is clear that this is not a camera for someone who wants video as a major use.  The biggest problem is the inability to autofocus while shooting.  The worst-case test of this is shooting a 2-year old running around in a house.  Being indoors with available light, the aperture is open and depth of field is short; as soon as the child runs towards you the focus is way out.  The camera is simply not usable in this kind of situation.  On the other hand, with available light and a subject which is not in wild motion, the results are acceptable, but even then, a much less expensive camcorder often gives superior results.  The only place where the K-5 shines in video is if you are outdoors, and you have a 500mm telephoto mounted, and you want video of distant wildlife - then, you have a system giving nice results.  However, again, if you want a camera with great video capability and very good but not quite great still capability, go for the Panasonic-DMC-GH2.  Next, color gradient linearity.  A partly subjective criteria, not an easy item to quantify, but not too hard for a professional photographer to see.  This is the quality of a color image which makes it as lifelike and genuine-looking in the shadows and highlights as in the midranges.  A face is a good choice, especially a baby's face - a fair skinned baby should have subtle colorations in the midranges perceivable because their skin is so thin it is nearly transparent.  The shadows should look like skin in shadow, not various types of dirty brown, and the highlights should look like brightly illuminated skin not just brightly-colored areas.  Being able to set the K-5 with 14-bit linearity may be the key to its terrific color gradient linearity.  The K-5 has a wonderfully realistic treatment of living things, and subtle colors which extend from bright to dark look authentic in a way which the eye can see but which are hard to describe - to put a phrase on it, the beauty of the image is deep.  The genuineness of the color gradients give a realistic sense of depth which stay in the image even after you have blown it up and put it on your wall.  Again, this is hard to quantify, but you won't see this much in the Panasonic GH-2.  Or even the Canon Rebel 550D.  Pentax has gotten this just so right.  I've seen Nikon D7000 shots with similar qualities, but I'd have to still give the K-5 the advantage here.  To me, this is one of the deciding features of the K-5, and it has nothing to do with all the technical tests at which it has excelled.  Let me say a few words about the image stabilization, which unlike most cameras is in the camera body.  You can put any lens on the camera, including old classics, and get modern image stabilization.  If you try this with Canon, you will end up stuck on your tripod.  Why don't other manufacturers do this?  And yes, it works extremely well. Even for long lenses.  Now, auto-focus.  I have to say, when shooting a still subject the K-5 is near perfection.  It is fast and positive in bright light, slower but certain in fairly dim light.  If it fails to find a focus in autofocus mode, it will not acknowledge the shutter press.  The focus-assist LED is excellent and works well for darkened rooms, but only for distances less than about 5 feet, above that it gets a little less reliable.  I sometimes take flash shots in absolute darkness of subjects over 5 feet away, and I've gotten good results using a small hand held flashlight to get a temporary focus, then hold it and turn off the flashlight, and take the shot.  This gives you the ability to get dramatic shots like an animal in water at night, splashing, with every drop suspended in air.  On the other hand - the situation with a baby running around in circles in front of you, the test I gave for the video mode focus problem, remains a worst case.  Moving to continuous focus mode, you get excellent sharp shots, but the timing may be awkward - for instance, with the child running in circles, I got many shots at the point the child turned to run away, when I wanted to get the shot a half second earlier. But enough shots were sharp and well-timed to make it a good experience.  Doing the same test with the Canon 550D gave an advantage to the Canon's AI-Servo mode focus, which seemed to follow the child much better - but in many cases, the shot, when taken, was not as well focused as the K-5.  So summing up the results for the Canon 550D, I got better autofocus speed, but inferior accuracy.  Both cameras can give good results, but the photographer needs to know each camera's weaknesses.  I ordered my K-5 from Amazon Warehouse Deals a month ago, and quickly noticed that the front setting wheel was defective.  You could turn it and it would sometimes ignore you, other times skip values, so that in manual mode, where you need both the forward and rear wheels, it was difficult to use.  As days passed the problem got worse, so I sent the camera back to Amazon (thanks to their excellent return policy). Being an engineer myself, I recognized it as an optoelectronic component failure, not a design issue, so I felt confident that a replacement would not have the problem again, and this did not bias me against the K-5. While waiting for my refund, I spent the time carefully looking at my photos and thinking whether any other camera would better fit my needs.  The cameras which came the closest were the Panasonic Lumix GH-2 and the Nikon D7000.  But I couldn't avoid coming to the same conclusion. I reordered the K-5 because of its low noise level, wonderful color linearity, unique in-camera image stabilization, rugged weather sealing, and compatibility with the excellent Pentax Limited lenses.  To me it was well worth the extra money, because no other camera has these same features.", "Date": "April 19, 2011"}, {"Title": "K-5: the best APS-C DSLR camera", "Author": "y1985s", "ReviewID": "R2ZRWJQS962244", "Overall": "5.0", "Content": "I upgraded from the K-7. K-5 keeps the excellent design, unparralleled build quality, super quiet shutter sound and outstanding ergonomics of K-7, has the best APS-C sensor. High ISO performance is stunning. What worth mentioning is that the Low ISO performance is also outstanding, noticably better than the K-7. Also, the super high Dynamic Range is very helpful. AF speed is not much improved, but much more decisive. For DA* SDM lenses, the speed is not improved at all. All my lenses are SDM, but I find the speeds are fast enough. The AF-C mode is much improved, but can be improved further. The camera is fun to use, I bet everybody who has a K-5 loves it.I'd like to comment on the following two problems:1. stained sensor problem was solved already, all cameras having serial number larger than 3973*** are fine. Basically this problem is now worry free.2. The bad Auto Focus under artificial light condition. I believe this is a relatively unusual problem that happens on a few bodies. Don't be afraid about this, just buy one and try it at home. If it does happen (very little chance), then exchange for a new one.I have hand-on experience of Canon 7D and Nikon D7000, I would say the D7000's image quality (from ISO100 to ISO3200) is on par with K-5, both of which are better than the 7D. 7D's build quality is on par with the K-5 but K-5 is much smaller, D7000 falls behind in this regard.I highly recommend the K-5.", "Date": "January 13, 2011"}, {"Title": "K-5, the camera I have been waiting for", "Author": "Nate R.", "ReviewID": "R6RI1N0V0HLYE", "Overall": "5.0", "Content": "I just got my k-5, and it is pretty much exactly what I was looking for.  I upgraded from the k20d, in the k-5 surpasses that excellent camera in every respect.The AF is so much faster than previous pentax models.  It can still struggle sometimes in very low light when pointed at low contrast area, but so does pretty much any camera ever made. Liveview AF if very fast as well, even faster with the new 1.02 firmware.The dynamic range is astounding, and equals or beats pretty much any digital camera up to this point (and probably equals the exposure latitude of negative film).  I can pretty much dispense with multiple exposures for HDR, because i can now just expose for the highlights and then bring the shadows up in photoshop with almost no added noise. This is probably the most revolutionary feature.High ISO is fantastic, getting pretty close to the performance of the best FF cameras of the current generation.  It is at least 2 stops better than my k20d, and probably closer to 3 when you factor in that you pretty much cant make it produce banding noise at any iso, which makes the files much easier to clean up.  I can use iso 6400 at A3 size and it looks great, just a quick pass with noise ninja or topaz.  The ISO performance of this camera was unimaginable a few years ago when talking about aps-c sensors.The build quality is awesome, and it just feels great in the hand (i have average sized hands).  Its very compact for a camera in this class (compared to nikon d300s. canon 7d, etc..), but is very solid feeling due to the magnesium alloy shell and steel frame.  It is fully weather sealed and very rugged.  Try doing this with any other camera besides the olympus e-5 [...] .  It somehow manages to squeeze a remarkable number of manual controls in without feeling cramped.Ergonomics is a particular strong point for Pentax in general, and specifically the k-5 is probably the best pentax yet camera in this regard.  All the major controls fall easily under your fingers, with no need to take your eye away to change aperture, shutter speed, iso, metering pattern, af mode, etc..  The great high iso performance makes the pentax TAV mode truly useful finally (lets you set aperture and shutter speed, and changes the iso to get proper exposure within your set auto iso range).  More than any other company it seems like the pentax engineers are also photographers, and everything is laid out in a way that is logical and well conceived.  Also there is the pentax unique hyper program and hyper manual modes.  Hyper program lets you easily switch from your set program mode to AV or SV mode by just turning the control wheel of each.  Turn the back wheel and you are in aperture priority, turn the front and you are in shutter priority, hit the  green button and you are back to your program mode.  In manual mode you can make your adjustments to shutter and aperture, and the green button will take a meter reading and make an exposure suggestion for you, which quickly gets you in the ballpark.  Its great.The shutter/mirror sound is whisper quite, a very nice change from the loud thwack of my k20d.  When i shoot with my flash, the flashbulb pop is the loudest sound coming from the camera.  Its very refined and unobtrusive.  The max continuous speed is an impressive 7 frames per second, and mine can go for an equally impressive 25 frames before the buffer fills.  This is all pretty much class leading.This camera pairs exceptionally well with the tiny Limited primes, making it possible to have exceptional IQ with very small size, yet retaining all the control of a pro camera.  Street photographers should seriously consider this combo.I can recommend this camera to anyone without reservation.  It is the best camera I have ever used, and it makes the other cameras in its class feel gigantic and clunky.Pros:Fast AF14 stops of DRClean High ISO, usable ISO 6400Compact, rugged buildErgonomicsGreat color, tonal gradationsVery customizableCons:AF tracking not that great, but pretty good for all but the most demanding circumstances.Needs high quality lenses to shine, but why put crap glass on a camera like this anyway?", "Date": "January 9, 2011"}, {"Title": "A brilliant camera", "Author": "Michael McKee \"mystic cowboy\"", "ReviewID": "R2ELTXIV91M6NB", "Overall": "5.0", "Content": "This is quite simple the best camera I've ever owned. It takes great photos and is very well built. I wasn't going to upgrade yet. I'm the type to wait until a new electronics product has been out for a while and dropped in price, but the reports I've seen about this camera triggered my choice to take a chance.The first thing I noticed is how petite the K-5 looks, though looks are deceiving. This baby is dense and weighs much more than you'd expect from the size. I'm sure that the magnesium body and extensive weather seals have a lot to do with that. This is one solid piece of kit. The camera has plenty of external controls, about what you'd expect from a body in this price range. I've shot with my sealed K20D in the Pacific Northwest rain a lot with no problems. My two shoots with the K-5 in the wet show it to be as least as good. Though Pentax has dropped the multiple exposure button. You can program the custom program button to duplicate that feature. As far a programming, the K-5 has the extensive customizability I came to love with my K20D. The feature list is extensive and way too long to go over in a short review.And the photos! This camera has a huge dynamic range, over 14 stops! Even at ISO 800 it has the same exposure range of my K20D at 100 ISO. The tonality you can get from a print is beautiful. Another nice feature is the ability to choose 14 bit as opposed to 12 bit RAW files. It's a small thing but brings the camera in line with Nikon's offerings. I can't comment on the many shooting modes and effects available. They only apply to JPEG images. I don't understand why anyone would buy a camera this costly and capable and throw away so much potential image quality by shooting JPEG. That's not to say that the JPEGs from the K-5 aren't perfectly fine. They are. It's just that RAW files from this camera hold so much more information than a JPEG can. And that information translates into a very real difference in what you can print if you take the time and care to. My experience seems to mirror the incredible sensor abilities that DXO Labs has published for the K-5.One other huge advance is the focus speed. This is the fastest and most accurately focusing camera Pentax has ever built, easily in line with Canon and Nikon's offerings in the price range. One small disappointment is that the fast focus and 7 fps capture rate makes the camera suitable for sports and wildlife photography, but the camera has a somewhat limited buffer. The 40 frames of JPEG is reasonable but the 15 image RAW buffer is a bit cramped. But then Pentax doesn't make the long lenses for that kind of photography anyway. Though Sigma does make some with Pentax mounts. With the few ballgame or bird photos I take, I haven't found the buffer limit to be a problem.Looking at my histograms shows that the K-5 has a tendency to underexpose about a third of a stop. That's really no problem as I've pulled usable photos out of totally black portions of the initial image, great reason to shoot RAW. Another is the great low ISO capability of the K-5. the quality of my 6400 ISO photos is slightly better than what I get with the K20D at 1600 ISO, easily 2 1/2-3 stops improvement depending on situation. And the camera focuses much faster in low light, too.If I were a video shooter I might find a problem with the lack of autofocus in video mode. The newest Canon and Nikon cameras have that ability, though the autofocus is slow on both during video capture. That's the nature of phase detection focusing that true DSLRs use in Live View or Video. The couple of videos I've shot look great. It's enough for me. And the camera does allow for an external microphone.P.S.It was commented that this review is to impersonal and that I use terms that people don't understand. To make this more clear:14 stops of DR means in the real world is that my photos look better than any I've ever taken. Color gradations are smoother and more subtle. It means that I'm able to pull usable details out of parts of the image that I would have given up on before because they were too dark. It means that I can take single shots in situations where before I would have used HDR or exposure blending to pull in detail in both bright and dark areas of a scene. It means that I can the same tonal range at ISO 800 that I get with a K20D at ISO 100. It means that this is a terrific camera. I guess I'm a bit excited that a Pentax camera finally gets great press. I'm a bit tired of having equipment that I very much like ignored by most photographers.", "Date": "November 13, 2010"}, {"Title": "Wonderful Camera", "Author": "Michael A. Shoemaker", "ReviewID": "R3L2ZM2Y1H4FT8", "Overall": "5.0", "Content": "I had to replace my Pentax K20d, which I liked a lot, because of a thief who broke into my car.  I really wouldn't have considered spending the money to upgrade to the K5 without this prodding, but although I would gladly consign the thief to jail, I admit to feeling like I wound up winning with the new K5!  This camera is so much more of an upgrade to the K20d than I expected.First, the CCD sensor is getting a lot of praise for its high ISO capabilities, which was one of the K20d weaknesses.  I would do everything that I could to avoid going beyond ISO 800 on the K20, but I have taken shots at 6400 on the K5 that easily rival 800 on the K20d!  Why is this important?  Because I can shoot in low light conditions that I couldn't have even imagined trying with the K20d.  A lens that was marginal in low light now becomes remarkably useful, so a wider range of lenses can be considered, including some lower priced lenses that I might have skipped over because they were not fast enough.  A definite win!Then there is the output quality. I really liked the K20d, but the color saturation seemed a bit dull at times and needed to be pushed either in camera or via software later.  Not so with the K5 and using the same lens.  Colors are crisper and more vibrant, which means less tweaking needed later.On the K20d, I found the 'Live View' function to be of very limited use.  But with the resolution of the 3\" screen on the camera and the ease of switching into Live View with just a push of a button, I use Live View routinely.  Want to shoot with the camera held above your head? Touch the live view button and do it!Others have commented on the focusing improvement and I can confirm that with the same lens, the focus seems a bit faster but more importantly, hunts far less and locks onto targets the first time almost all of the time.  Focusing in low light is remarkably improved.  So shots that I may have missed before are more likely to be captured.I really loved how the K20d felt in my hand so I was a bit worried that the K5 would be a letdown since it is smaller, but the K5 feels solid and yet comfortable because of the grip ergonomics and the textured finish.  I recently picked up a used Pentax 60-250mm lens that is over 6\"long and 2 1/2 lbs, but while it is a heavy combo, it feels balanced and is remarkably comfortable for such a big lens.  It is easy to hold the K5 in one hand and reach all of the important functions. With the 60-250mm lens you would definitely want to use two hands after a while - the lens is great but it definitely adds a lot of weight - but taking one handed shots is possible because of the ergonomics of the K5, especially with the in-camera stabilization function.Speaking of the anti-shake function, there are pros and cons to in-camera vs. in-lens stabilization, but I have to say that I prefer the in-camera version for three key reasons:  First, every lens you mount on the camera becomes a stabilized lens; second, non-stabilized lenses are less expensive to purchase than stabilized lenses, and third, a stabilized lens more rapidly uses the battery charge than the in-camera stabilization because you are moving glass lens elements instead of a light CCD sensor.  So while you cannot see the stabilization working via the viewfinder, I will sacrifice this slight advantage for better battery life, cheaper lens cost and always-available stabilization regardless of the lens you are using!There is so much more I love about the K5, but I will highlight just one more thing.  The menu system on the K20d was kludgy and a bit hard to work with.  The menu on the k5 is much cleaner and easier to use.  I can find what I am looking for more easily (and there is a ton of stuff you can do in the menus!)and making adjustments is fast and sure.  More importantly, the things I use the most are directly accessed by the wealth of buttons on the camera, but for those occasions where I need to use a menu the K5 is a definite step up.  And just for the fun of it, here are a few things in the menus that you can do, many of which you cannot do with the 'big name' brands:*  Fine tune focus adjustment for each lens you own.  I checked and my 60-250 front focused just a little bit, but with about 20 minutes of work (using Live View), I was able to adjust this myself and lock in that adjustment for that particular lens.  Mount another lens and this adjustment does not apply because the setting is saved as lens specific!*  In camera HDR capability, even hand held, lens correction (based upon the specific lens you are using!), dynamic range enhancement, etc.!  (I haven't played with much of this yet, but there are some good comments on this on Pentax forums.  And just the ability to have this at your fingertips gives you a lot more creativity to play with.)*  Shooting sports today and landscapes tomorrow?  You can set up the camera to 'favor' speed or depth of field. Or you can set the camera to use the MTF scores of the specific lens mounted to the camera to keep the lens in its sweet spot for best performance (assuming you are using a Pentax DA lens). And you can set the range you allow the Auto ISO function to use AND how rapidly it adjusts to higher ISOs.The K5 seems a bit pricy to some, but considering all of the above plus the weatherized body (and complete system when you use either the kit lens or another lens like the 60-250mm) and you would have to spend a ton more to get a truly competitive camera.  The real decision, in my mind, is whether you are stuck on buying another brand because of their name or you already own a lot of their lenses.  I can understand buying a 'Canikon' if you have an investment in lenses already, but if you are buying a 'Canikon' just because of the name on the camera strap, DON'T!  Give the K5 a try and you will not be disappointed!", "Date": "May 4, 2011"}, {"Title": "What the K-7 should have been", "Author": "E. J Tastad \"ejt\"", "ReviewID": "R2T522ATG48PLJ", "Overall": "4.0", "Content": "Pros:Image quality is amazing.FeaturesCons:Price.AF system still lacking, albeit improved *UPDATE: Download the 1.03 Firmware and reset your camera to fix low light front focus *Purple fringingBottom line:This camera is what the K-7 should have been 1.5 years ago.  This is a superb Pentax, definitely the best APS-C Pentax to date.  However, I can't help feel that the camera is overpriced, even though the image quality does make it almost worth the asking price alone.  Again, if this camera were released 1.5 years ago instead of the K-7, I would have given it 5 stars.  The market has changed since then.Review:The first thing I did with the camera was shoot a fund raising gala in a moderately lit banquet hall.  The first thing I noticed is how little improvement there was in focus for this situation.  The lenses were still slow to lock on and had trouble with the differing light (Sigma 30mm f/1.4, SMCP FA 77 f/1.8, and SMCP 60-250mm f/4).  The flash exposure was about the same as the K-7 (P-TTL doesn't work well for bounce flash at any sort of distance), so the first thing I did was change the flash to \"A\" mode (auto thyristor where the flash sets exposure) and got much better results.When I reviewed the pictures I was shocked at how noise free they were.  Even the ISO 6400 shot from the 60-250mm was relatively clean, probably about like ISO 1600 on my K-7.  I could even recover underexposed ISO 1600 shots, something I would never dream of doing on the K-7.The shutter is like the K-7, and it might even be quieter.  Definitely the quietest APS-C sensor camera I have used (quieter than a D300s or 7d), and also refined feeling.  Not the squeaky sounding shutter in some of the older Pentax's.The next thing I noticed when shooting in bright high contrast situations was how much purple fringing it shows.  Doing side by side comparisons between it and my K-7, I noticed the K-7 was relatively purple fringe free, where this camera fringed quite noticeably.  Think the difference between the K10d and K20d (K20d had almost no purple fringing where K10d had a lot).  This shouldn't be a deal breaker for most, but be aware of it.  Proper RAW developing can take care of much of it.Recommendation:This is certainly the best Pentax to date.  The image quality is amazing, the feature set of the K-5 is excellent, and the camera is certainly a step up.  If it is worth the asking price is a decision each individual has to make.  I think with a better AF system it would easily be worth the asking price.", "Date": "December 9, 2010"}, {"Title": "rugged high performance DSLR = the Pentax k5", "Author": "vagrant10 \"mh\"", "ReviewID": "R2BSZNMXCL8XZ0", "Overall": "5.0", "Content": "This is the third weather sealed Pentax I've owned and I'm happy to say that I have full confidence in Pentax's ability to make a camera that I can take anywhere.  Rain storms, freezing rain, snow and blowing sand will not slow me down.  Other camera owners dive for cover while I get the shots.And it's not just about how rugged the k5 is built - it's comfortable, very customizable, responsive and takes great images, even at iso 25600!The grip is awesome... it feels attached to my hand and it makes it easier to hold over long periods.  Plus, it actually feels lighter than what it is - I think it's how the weight is distributed, but it's what ergonomics is about.I love how I can reassign what a button does, or what a control wheel controls.  For example, if I'm in AV mode (aperture priority), I can assign the the front wheel or rear wheel to change the aperture while the other wheel can control exposure compensation, iso, or nothing at all.It focuses quickly, does well at tracking and shoots quickly and quietly.  This last point is interesting... the k5 is a small camera and Pentax lenses tend to be smaller and lighter than their competition, especially when you look at their prime lenses.  I've noticed when using my larger lenses, the people I'm taking a picture of react much differently than when I use smaller lenses.  When a smaller lens is on the camera, they are more relaxed and are less likely to know that I'm taking pictures of them.  Plus with the camera shutter being very quiet, I can keep taking photos and they are likely not even aware that I'm taking pictures.  I love taking candid pictures since peoples reactions are much more natural.  The Pentax K5 helps me get these shots.Taking pictures indoors can be such a challenge - lighting in most areas is very low which presents photographers with many challenges.  Often times it means shooting at a large aperture which means the depth of field will be very shallow - one person may be in focus, but the person next to them won't be.  Or shutter speed needs to be dropped which means if your subject moves, you'll get motion blur or even if your subject is still, it makes keeping the camera still enough difficult.  And another compromise that can be used is to raise the ISO (sensitivity) higher that often induces static or noise to the image.  Pentax has addressed these issues head on.  First, the Pentax K5 has image stabilization built in, so if you are shooting at low shutter speeds, you are much more likely to get a sharp image.  The rule of thumb has been the shutter speed should equal or greater than the focal length (in 35mm equivalence).  So if you're shooting with a 50mm lens and since the Pentax has a crop factor of 1.5, it has a 75mm focal length so I should shoot at 1/75th or higher to get a sharp image.  But with the k5 I regularly shoot at 1/20th with a 50mm lens without issue.  That means I can decrease the aperture for more depth of field and or reduce the iso to decrease noise.But the amazing thing is how little of a penalty there is for increasing the ISO on the Pentax K5.  I found myself shooting in a very dimly lit Tango Dance Studio where I was needing to keep the shutter speeds at 1/100th or more since people were dancing while keeping the aperture set to f2.8 or higher.  This meant I had to shoot at iso 25600 and a lot of those shots were absolutely useable!  My previous cameras, I was hesitant to shoot at even iso 3200 because the noise became such a problem.  But the K5 has such low chroma noise, the noise reduction feature in Lightroom 3 makes images at this high ISO useable.  That's one thing I noticed on my uncles Nikon D7000 - at h4 (iso 25600), the Nikon had much more chroma noise than my pictures with the Pentax k5.  And chroma noise is much harder to get rid of and makes images much less appealing.All in all, I'm so excited about having the k5.  Indoor or night shooting will be much easier.  Macro shooting will be easier since I can raise the ISO so I can either increase the shutter speed or increase the aperture without penalty.  When I'm people shooting, I can be stealthier with a smaller camera that is very quiet.  My back will be happier when I go hiking because my gear is smaller and lighter.  And I don't have to cower away from nature since I know my gear is up to taking most of what mother nature has waiting for me.  Pentax has made an amazing camera that is worthy of all the awards its getting.  And I know I'm so lucky to own one!", "Date": "November 27, 2011"}, {"Title": "Nothing more to ask for in a dSLR! The best in its class and now best value too!", "Author": "Ivan Gordeli", "ReviewID": "RS2HHECCMRUCP", "Overall": "5.0", "Content": "This won't be a technical review. You can read technical reviews elsewhere, for instance on dpreview. Just 1 comment on these reviews. Most of them praise the K-5 and rank it higher than the very popular and close to the K-5 Nikon D7000 (they share the same sensor). Except for 2 things: high introductory price and lenses availability. Now the price has dropped and K-5 is now cheaper than any of its equivalent competitors. Lenses selection is not an issue in case you know that the lens you need is available (most of us do not need all 100 or 200 available lenses, right?).It is so common nowadays to ask a lot (more) of a product. I remember when I was choosing my first digital camera and it always seemed like there is no ideal solution - every option was lacking in 1 or more ways. Either the zoom was not enough or the size was too big or the price was too high or the quality was not good enough ... And this theme reappeared every time I was involved in helping my friends choosing a digital camera (including dSLRs)This is the first time ever I was so satisfied with a product I was not able to find anything extra to wish for for quite a while and even now after owning it for 5 months I can only think of a few very minor extras which could imho be added through a firmware update).I was shooting film recently and thus \"spoiled\" by Full Frame (35mm) format. digital FF was out of my price range though. After getting the K-5 I feel I don't need/want FF anymore.PROS:- according to reviews it is better and now also cheaper than any competitor = a win-win situation (closest and imho almost even competitor is Nikon D7000)- backwards compatibility with all Pentax-made lenses- the best body for adapting 3-rd party M-42 and M-39 lenses. Infinity focus = yes, focus confirmation = yes unlike Nikon or Canon which are either impossible to adapt or require tricky adapters which do affect image quality as far as I know.- a unique range of very compact \"limited\" primes.- great and tight Pentaxians communityCONS:- Pentax is not doing well as a company. It has been bought twice in the last few years and nobody knows if it will recover (personally I'm optimistic)- Pentax is not very common in the US, which means you will have fewer opportunities to swap lenses with your friends or get first-hand advice from another Pentax shooter you know in person (in my case the closest Pentax shooter I know lives thousands of miles away). This might be a big issue for some.- consequences of the above is that used lenses for rental are hard to find and Pentax availability in BM stores is very limited.- biggest issue is maybe lesser selection of lenses than Canon or Nikon. An alarming fact is that 3rd party manufacturers (Tamron, Sigma etc) are disregarding Pentax mount more and more often. Hopefully this will change with newly instituted policies by Pentax-Ricoh. To me personally this issue is balanced by 2 factors: M-42 lenses which work best on Pentax and I have a bunch of them and the fact that the lens I needed was present in the Pentax mount line up (Tamron 17-50 f2.8) at the same price as other mounts.Note: the new owner of Pentax (Ricoh) seams to be doing a lot to rebuild the Pentax brand in the US so maybe soon the above will not be an issue anymore. It looks to me Pentax is on the right track now. Only time will tell if that's really the case though.How did I personally arrive to buying the Pentax K-5:I have no brand loyality what's so ever, however my search was driven by what are the most popular models nevertheless.When I was picking my dSLR in November 2011 I started with looking at FF options first. The by far best value at that time was Canon 5D MarkII, you could get body-only at ~$2000 (now even cheaper). This was definitely out of my price range though, so I started looking at higher end APS-C dSLRs.I started with Canon and Nikon offerings (Canon 7D and 60D and Nikon D7000). Not only was the Nikon newer than either Canon option, it was also ranked higher by most reviewers and was a better value. 7D looked way overpriced, a bit outdated (it is 1 year older model than 60D or D7000) and seemed to have less features on-paper. It is supposed to be a  higher end camera and I'm sure those who know what it offers that the lower-end models do not have can benefit from it. 60D with its plastic body was a noticeably more lower-end than the Nikon. Anyway my conclusion was that unlike with Full Frame Canon doesn't really offer a good option in the $1k-2k price range, unlike the Nikon with its D7000. So I was set to get the Nikon.While reading Nikon D7000 reviews I've learned of the almost equivalent due to the same sensor Pentax K-5. Reviews were ranking it (slightly) higher than the D7000 (both were the same price at that moment ~$1200 for the body). I was still inclined towards the Nikon, as it was a much more popular and widespread camera. But then there was a $230 discount on the Pentax and I have jumped on it. Lens selection was not an issue, I've glanced at lens options and noticed that you can build your system with either brand at similar cost especially if you consider 3rd party offerings.I have never regretted the decision to go with Pentax K-5. In addition to being the best in its class and being the best value I got compatibility with my M42 and M39 lenses I have not been fully aware of at the time of purchase.I will only mention 2 of the presumed technical issues with K-5:- AF front-focusing in some conditions (tungsten low light) - I have experienced this myself, though it's not a big issue to me and can be easily avoided. There is an extensive analysis on this issue by a German Pentaxian who also holds a PhD in theoretical physics :) Falk Lumo.- Pentax TTL flash mode is overexposing sometimes. Many reports on it are user error though. I'm not 100% sure that what I have experienced isn't consequence of my errors either. Not a big issue for me as I tend to use manual flash mode more often to achieve the desired flash effect anyway. Flash own exposure mode (the A-mode) works fine.It seems to be commonly accepted that Nikon offers better AF and better flash system. I don't know how true is that. (Nikon D7000 btw also had some AF issues like the Pentax K-5).Both issues are easy to go around though unless your needs are very specific and happen to rely a lot on these 2. Note: as far as I know Nikon is not issue free either, so do your research carefully.Bottom line:At current prices you can't go wrong with Pentax K-5 provided the lens you need is available and its price is competitive with other brands.Note: Pentax K-5 is not issue free as any other camera.I give it 5 stars for being exactly what I want. The issues I have mentioned proved not to be limiting to me in any way and thus do not affect my rating.", "Date": "April 28, 2012"}, {"Title": "Best APS-C DSLR Camera", "Author": "Amazon Customer", "ReviewID": "R21GSPIUIZGJFJ", "Overall": "5.0", "Content": "This is the camera that DxO Labs gave the following rating for:\"No need for suspense: this new 16.3 MP sensor is simply the best APS-C we have tested so far, sometimes able to compete even with very high-end full-frame cameras.The overall score of the K5 puts it in the lead with 82 points -- more than 9 points better than the D90 or the Alpha 55, and 16 points ahead of the Canon 7D or 60D. The K5 is literally the best APS-C performer for each segment, even in low ISO\".See their website at[...]I am no professional. I had used a basic DSLR prior to this the k2000. So this review is based on someone upgrading from a beginner SLR to a more sophisticated one.Pros:Low light: This is a camera that takes great low light pictures, you can push the ISO up pretty high and still get great pictures. This was the biggest reason for me to upgrade. I had a hard time taking pictures of my kids in various performances with terrible lighting conditions. Obviously one needs a good lens. But with my old camera I had to throw too many away. This camera combined with the DA 50-135mm lens is one terrific package for such situations.Weight/Size: this is the most compact camera at such a level that you will find.Weather resistant: This is a weather resistant camera! Combine this with a weather resistant lens and you are all set.Electronic Level: I thought this was a gimmick but after using it for a few days, I find it indispensable to take level photos.User Selectable Focus points: these are standard in expensive cameras, nothing special if you have used such cameras before but for somone upgrading I quickly found out how convenient this was.Shake reduction: Pentax unlike Nikon/Canon has shake reduction built into the camera, so any lens you put on it has shake reduction function.Lenses: Pentax has small pancake lenses called limited lenses. Try these if you are new to Pentax. They are superb and great to walk around with without looking like a dork.Cons: Expensive...", "Date": "November 6, 2010"}, {"Title": "Better off without kit lens? K5 = my choice over others", "Author": "P. Seth", "ReviewID": "R1ASGHG31FZLIC", "Overall": "5.0", "Content": "I bought this camera with the kit lens... after having used the DA* 50-135, I know the kit 18-55 will be redundant soon as i save $ for the DA* 16-50... You're probably on the right track here looking at the body only version...As for the K5... its excellent. The k7 was (still is for most practical purposes) an awesome camera. Great features, customizability, built like a tank... perfect size, weather sealed, 100% viewfinder... k5 is all this with a significantly better sensor, arguably the only lacking aspect of the k7. Apparently there's a new autofocus system too... so far so good.This one ended up as my choice over the Canon 7D after a fair amount of research for my first DSLR. Reason being the high ISO performance it claimed... Happy with the choice after using it for a few days. I'm thrilled with the kind of shots I'm able to take handheld in a dimly lit indoors (1600-6400 ISO, 1/15 -1/60th shutter, f3.5 on the kit lens or 2.8 on the DA*)... in-body image stabilization comes in handy here as well.... and a good lens, i.e. all the more reason to go 'body only'.About me... a photography enthusiast, architect by profession and travel at every chance I get... learnt to shoot pictures on a Pentax spotmatic... switched to a Nikon n85 a few years before the film era begun fading. Have used and or . Highly recommend the K5... wish it was a little cheaper. 5 stars none the less... Have to add, I was initially concerned about the choice of pentax lenses but after some looking, they seem to have decent options with the DA* and Limited series. Definitely give this camera a serious look (save the $ and go for k7 if not too concerned about low light).PS - Don't like the pentax software at all! I use aperture instead, which has its own set of flaws including having to upgrade to version 3 to read pentax RAW...", "Date": "November 22, 2010"}, {"Title": "An all around Excellent DSLR", "Author": "Faxanadu", "ReviewID": "R3KGBRVMUY6NLK", "Overall": "5.0", "Content": "The K-5 is really something special. I tried our Nikon, Cannon, and Sony before landing on a K-5. Now granted, Nikon, Cannon and Sony all make great cameras - so I am not going to go into a fanboy war between all the brands - I'll just focus on why I chose the K-5, even though it is about 2 year old technology at the moment (May 2012)Feel - The K-5 is solid, rock solid. It feels like it could survive the Zombie Apocalypse, and we'll need someone taking photos - right? In all seriousness, this is a tight, weather sealed camera that is built like a tank. It is also much smaller than most DSLRs out there - almost compact (well for a DSLR) It just feels good in the hand and is an absolute pleasure to take photos with. Some have compared it to Leica Ms - but I won't go that far - however, this is a great DSLR for street photography - you wont' be scaring your subject away, especially if you use one of the Pentax wonderful limited primes (the 40mm looks like there is not even a lens in the camera)Image quality - this baby just takes great pictures. The 16.3 MP sensor is a Sony and it produces great results. Low light performance is very good. Frankly, I don't blow up my shots to life size, so I don't need 24 or 36 MP - more megapixels does not always equate to better photos - that is really up to the photographer. When paired up with a quality lens - the images a stunning. When paired up with an ok lens (kit lenses) - the images are pretty darn good.Lens selection - some will argue that Nikon and Cannon just offer more lenses - and that is correct. They offer A LOT of lenses, most of which, honestly, you will never use. Pentax offers a great number of lenses and have these absolutely amazing limited primes that exude quality. They are awesome and make the experience just all that much better while giving you wonderful image quality.But it's Pentax! - Pentax is a quirky company and they have been going through a lot of issues. With the recent acquisition of Pentax by Ricoh, I think the future is bright. And Pentax really focuses (no pun intended) on the photographic experience. Yeah - they may be the underdog, but I can tell you I get just as good, if not better, images with the K-5 and some of the prime lenses than my colleagues with their expensive and heavy Canikon gear.All in all - this is a great value DSLR. There are better out there - but I have yet to find one that has the feel of the K-5. Cameras are very subjective - so your opinion may vary.", "Date": "June 3, 2012"}, {"Title": "5-star Average For A Good Reason", "Author": "Matthew Wachowski \"mattwach\"", "ReviewID": "RKLFHV6MEYA4U", "Overall": "5.0", "Content": "The short:This is an excellent camera that, like all quality tools, steps completely out of my way and lets me experience pure photography with quality results and minimal hassle.Longer:I've been shooting with the K-5 for a little over 6 months now and have taken over 10,000 photos with it.  I think I'm in now a good position to share my impressions of the camera.Like:  - Very responsive with excellent ergonomics.  Every mode is well thought out and it's easy to quickly change settings in a given mode with only my right hand and no visual cues.  - The sensor is amazing.  Excellent high ISO performance, excellent low ISO performance, excellent dynamic range.  Very low noise.  - Large collection of older, optically-excellent lenses available second-hand.  The build quality of many of these lenses is much higher than you will find today (outside of the pro market). You often lose auto-focus or other features, but a competent shooter can get amazing output and they are fun to shoot with! - In-body stabilization gives these older lenses image stabilization! - Excellent prime and zooms available for fair prices.  I recommend checking out the Pentax 50mm 1.4 prime, and the Tamron 17-50mm 2.8 zoom as a start. - The compact, magnesium alloy body gives an immediate (and lasting) impression of quality. - Weather sealed body, which can be combined with a WR lens for a great outdoor kit. - Has a full compliment of high-end modes and featuresCould Be Better:  - The video mode is high-quality, but basic.  Only Motion JPEG is offered, the camera will not refocus automatically, no dedicated video button.  - The availability of high-quality lenses that support quiet SDM focusing is limited.  - Some excellent 300m lenses are available, such as the Pentax 300mm f/4 prime, but not as many as Nikon or Canon  - No current Pentax offerings over 300m, you'll have to go third party or used and this is not the ideal system for those extreme focal lengths.For my particular situation, nothing in the \"could be better\" category is relevant to my needs.  There is no camera currently available for under $2,500 that I would trade my K-5 for.", "Date": "March 19, 2012"}, {"Title": "Love it!", "Author": "Billy Jackson", "ReviewID": "RA6FXD7008ZZ6", "Overall": "5.0", "Content": "I'm really enjoying my K-5.  As much as I loved my K-7, I felt it lacked a bit in low light shooting.  Still, I contemplated not upgrading as I liked just about everything from the K-7 except for a few things.  Well, after buying the K-5, I'm really glad I went ahead and did so.I've noticed several people reviewing the K-5 mention it's a K-7 with different guts, but I somewhat disagree.  It feels different.  I mean, being familiar with the 7 makes handling the 5 a snap, but ergonomically, the body feels even more compact (if that's even possible), which I really like.  My pinky hangs over the grip thanks to the neat and tidy handle design, but I quickly got used to it.The new Sony sensor really shows off its capabilities in this camera.  DP Review said the K-5 is one of the best APS-C cameras currently on the market, and I have no reason to dispute that remark.  While the K-7's picture making was good, the K-5 is great.  Not only is the low light performance an improvement, but there are subtleties in nearly every phase that add up into making the K-5 a significant upgrade over the K-7.  And please don't misunderstand me.  I still think the K-7 is a very good camera.  It's just the K-5 is better.  Much better.Now, after reading a few reviews from folks with defective cameras, I will be honest and write I nearly switched camera systems completely.  From the problematic DA* 16-50 2.8 to the rampant reports of sensor spots, mirror freeze, auto-focusing issues, and a partridge in a pear tree, I wondered if my allegiance to Pentax was coming to an end.  However, I noticed most of the issues were very early on, and while it's very frustrating to get a brand new camera (especially after paying the premium Pentax was originally selling this guy for), it's not surprising for me to see a company release a new product before they really should.Thankfully, the troubles seem to be far and few, and it's great we live in a world of firmware updates.  Now that the bugs are worked out, the overwhelming reviews do not lie, and the K-5's impressive functionality and performance has long since outweighed any initial quality control issues.So, to make a long story longer, I'll conclude with what I like and what I dislike about the K-5:What I like:  EverythingWhat I dislike:  NothingOkay, maybe I would enjoy having more lenses available for my Pentax other than the usual suspects, but I knew this prior to investing in a Pentax system, so what can you do?  This is a bit nitpicky, but in both my K-7 and K-5, the focusing screens aren't perfectly set, which makes looking through them remind me of the 60's Batman series where the floors were all sideways....It's not that bad, but like the game of Operation, I guess it takes a steady hand.Lastly, I purchased my K-5 through Amazon via Emmy Photo.  I'm mentioning this so you'll know I actually own the K-5, and I'm not some dork trying to make the company I own or work for look good.  I've seen obviously fake reviews going the other way too, so I think it's nice when I'm reading remarks from actual owners of the products being represented.  I don't think fondling it for a month or reading a spec sheet is good enough to warrant a review, but since I'm not J.P. Amazon, all I can do is say what I think after having owned the product long enough to make an honest review.In long, I've dug into my K-5 much more than I did with my K-7.  The 7 was very nice, but the 5 is hard for me to put down, and has actually improved my photographic skills thanks to the sheer joy of taking pictures with it.  It's light, compact, easy to use, and most importantly, it takes excellent pictures.There are so many great dslr's out there, it's really hard to make a poor choice when buying a new one.  However, I'm very happy with my K-5 and would highly recommend one to anybody wanting to get serious about photography, or even someone simply wanting a sophisticated looking camera that even takes great photos set on auto.", "Date": "March 9, 2012"}, {"Title": "PENTAX K5 vs the D7000 had both...", "Author": "Radio Man \"yarns13\"", "ReviewID": "RHZZV7YZ5A1PP", "Overall": "4.0", "Content": "I saw all the rave reviews from both buyers and camera review sites on the K5 so I just had to have it. I recently sold my Nikon D90 and was in need of an upgrade.The ergonomics of the K5 are JUST great. It makes you want to pick it up and use it. The weight, the solid build, LCD, and all the buttons seem to be in the right place REALLY great. A sort of non issue, out of the box I had two hot pixels. Thanks though to the in camera pixel mapping a BIG advantage over the Nikon D7000, I had a perfect camera in seconds after just clicking pixel remap.My problems with the K5 are I had way too many pictures where it focused behind what I wanted IT to focus on, OR focused REALLY on nothing. Despite the fact it LOOKED focused in either the viewfinder and or live view. I set it to one point certainly not multi. (I shot a lot of People shots) Unless I was very close to the subject(s) OR \"if the subject didn't have a lot of things close by behind\" like trees etc.,over and over the K5 had really focused behind my target.I tend to shoot a lot in places of nature like Arboretums etc..so it's then when I noticed the most out of focus shots, when the background was sort of busy. If I was shooting a portrait shot, say by the Ocean, I always had PERFECT sharp focus as there was nothing CLOSE behind my subject like a tree obviously.Another thing that bothered me on the K5 was it's OVERALL rendition of skin tones. I know certain settings are out of the box too saturated with too much contrast but most pictures no matter what I did, had unrealistic skin tones.In raw I was usually able to get VERY good skin tone but I hated to ALWAYS have to manipulate nearly every picture I took in order to get realistic looking skin tones.Fast Forward, I was getting frustrated with the focus and COLOR accuracy. I picked up a Nikon D7000 and without doing a whole review, without question the D7000 had way better accurate auto focus in most situations, and much better looking ACCURATE color, especially skin tones. (This was MY experience don't shoot the messenger :))Long story short without a doubt I enjoyed the overall feel and customization level much more on the K5 vs the Nikon. Also high ISO goes to the K5. As to grain or Chroma noise my tests showed the K5 was the winner over the D7000 which was close.However due to the focus and skin tone issues I sadly returned my K5 and will be keeping the D7000. There is no doubt the Pentax is a SUPER great camera. I suppose if you enjoy a ton of post processing it will reward you big time. The auto focus issue? I don't know..I missed far too many shots that should have been in focus..and that's probably the main reason I chose the D7000 over the Pentax.This is just my opinion, and from what I've read the K5 usually comes up the winner. However due to the issues I listed at least in my case, the D7000 was the better camera for ME though not ergonomically. Also as far as the initial kit lenses go, if you buy these cameras with the kit lens..the K5'S lens will show MUCH more purple fringing, The D7000 wins again on the kit lens. Not an issue if you plan to buy some good glass as they say with your camera. All said though, the K5 is a great camera, but you may want to try a D7000 and see if it may not be the better camera in the REAL WORLD..Not dxo charts, shooting manikins in a studio, and all that sort of thing.I know there are some die hard Pentax people out there I can see why, as Pentax seems riddled with QUALITY and is a bit DIFFERENT than the same old boring? Nikon/ Canons. I am actually the type who PREFERS to be different, (I have an X100 LOVE IT!! I won't even go there now). I WANTED to choose the K5 over the D7000 but my pictures wouldn't let me do that..JUST my eyes and opinion.", "Date": "October 12, 2011"}, {"Title": "OUTSTANDING CAMERA!", "Author": "Alexander Heie", "ReviewID": "R4WD5BYOLSH59", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo271X5HEB46NIFembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo271X5HEB46NIFrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo271X5HEB46NIFchiDiv\").innerHTML = document.getElementById(\"cv_mo271X5HEB46NIFhiddenPre\").innerHTML;\n};\ncv_mo271X5HEB46NIFrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo271X5HEB46NIFso;\t   \n\n\nfunction cv_mo271X5HEB46NIFloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo271X5HEB46NIFso = new SWFObject(swfLocation, \"cv_mo271X5HEB46NIFAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo271X5HEB46NIFso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo271X5HEB46NIFso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo271X5HEB46NIFso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo271X5HEB46NIFso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo271X5HEB46NIFso.setAttribute(\"height\", swfHeight);\n          cv_mo271X5HEB46NIFso.setAttribute(\"width\", swfWidth);\n          cv_mo271X5HEB46NIFso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo271X5HEB46NIFso.write(\"cv_mo271X5HEB46NIFflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo271X5HEB46NIF', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo271X5HEB46NIF';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo271X5HEB46NIF', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo271X5HEB46NIFloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo271X5HEB46NIF\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2YLVKLTJ4NCJ0\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2YLVKLTJ4NCJ0\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R4WD5BYOLSH59\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2YLVKLTJ4NCJ0/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo271X5HEB46NIFduration')) {\n      document.getElementById('cv_mo271X5HEB46NIFduration').style.display='none';\n    }\n    cv_mo271X5HEB46NIFloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo271X5HEB46NIFloadSwf(movieID, playerVersion) {\n   return _cv_mo271X5HEB46NIFloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo271X5HEB46NIFnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo271X5HEB46NIF', 0, h);\n}\n\nfunction cv_mo271X5HEB46NIFresetPlayer(w,h,bw,cc) {\n  cv_mo271X5HEB46NIFnewHeight(h);\n\n  cv_mo271X5HEB46NIFso.addVariable(\"resetBandwidth\", bw);\n  cv_mo271X5HEB46NIFso.addVariable(\"cacheCode\", cc);\n  cv_mo271X5HEB46NIFso.setAttribute(\"height\", h);\n  cv_mo271X5HEB46NIFso.setAttribute(\"width\", w);\n  cv_mo271X5HEB46NIFso.write(\"cv_mo271X5HEB46NIFflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo271X5HEB46NIFRollOverImg = new Image();\ncv_mo271X5HEB46NIFRollOverImg.src = \"http://ecx.images-amazon.com/images/I/91LfQfewTKS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo271X5HEB46NIFpreplay = document.getElementById('cv_mo271X5HEB46NIFpreplayImageId');\nif (cv_mo271X5HEB46NIFpreplay) {\n  cv_mo271X5HEB46NIFpreplay.onmouseover = function() {\n    cv_mo271X5HEB46NIFpreplay.src = \"http://ecx.images-amazon.com/images/I/91LfQfewTKS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo271X5HEB46NIFpreplay.onmouseout = function() {\n    cv_mo271X5HEB46NIFpreplay.src = \"http://ecx.images-amazon.com/images/I/91LfQfewTKS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo271X5HEB46NIFpreplay.parentNode;\n\n  var cv_mo271X5HEB46NIFcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo271X5HEB46NIFcurrentClick) {\n      return cv_mo271X5HEB46NIFcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:26 MinsPentax K-5 and Pentax K-7 with DA* lenses face sand/mud/water durability test.", "Date": "July 18, 2012"}, {"Title": "Pentax K-5 a True Photographer's Tool.", "Author": "Joy L. Phelps", "ReviewID": "RWN4WQ2X0JQCS", "Overall": "5.0", "Content": "Well, there doesn't seem to be a whole lot that I can add to all the reviews already submitted.  This is a great tool, no wait, maybe a better word would be to describe the Pentax K-5 is that it is a WEAPON.  Why do I say that?  Mainly because you can take it in the toughest environments, and it can tackle any of them, and have you looking like the hero in whatever photo assignment you find yourself in.I have been shooting professionally since the days of film when film was king.  I have used what are considered top of the line cameras in my career in both the film and digital age.  After a period of semi-retirement from the photography business, I decided to give this Pentax K-5 a try.  Wow, what a camera.  It is packed with several ways to customize it for your shooting taste and tendencies.  It is as solid as they get, very easy to handle (I do use the battery grip that you can get for it) and have used it in the rain with a weather resistant lens, and it just keeps going; producing great results.  You can buy a Canon or a Nikon and pay more but not gain any real huge advantage over the Pentax K-5.  Sure you can get one that will shoot at a higher frame rate, but for most, the ability to shoot a seven frames per second is more than adequate.  You can also, maybe, choose a Nikon or Canon for higher ISO capability, but honestly, the noise level at higher ISO's is very good and on par with the competition.I currently use four lenses with the Pentax K-5:  Pentax DA 18-135mm WR f3.5-5.6 lens (a nice sharp, all around lens), Pentax FA 50mm f/1.4 lens (I use this lens quite a bit, beautiful bokeh, great portrait lens), Pentax DA 35mm f2.4 lens (Very inexpensive, but surprisingly sharp with good contrast and color rendition), and finally, the Pentax DA 14mm f/2.8 lens (it amazing how close up you can focus on something with this lens.  It helps you get some real neat perspectives on the subject your shooting).  What is great about Pentax is that you can use any k-mount lens with this camera, so the possibilities seem endless.Do I recommend this camera, you betcha.  What is even better is that it is affordable.  So if you want to spend a lot dough so you can be in the status quo, go ahead, but it won't make you a better photographer.  But if you think of the camera as a tool, or as I call the Pentax K-5, a weapon, then when you learn how to use it for what it was intended for (a camera for taking great moments in time), the Pentax K-5 then becomes a mighty weapon in the hand indeed.", "Date": "January 20, 2012"}, {"Title": "The k-5 brings Pentax up to a new level of quality imaging", "Author": "bisjack", "ReviewID": "R35BWPKA5M3QBK", "Overall": "5.0", "Content": "Over the past 5 years I've migrated from the Pentax k-100d up to the latest k-5.  I now own the k-20d, the k-x, the k-7 and now the k-5.  Along the way the k-7 disappointed me the most.  But this k-5 makes up for it.  This is an incredible camera. The resolution and the low noise level (even at high ISO's) have impressed me the most.  This camera coupled with an average lens such as the Pentax 18-250 is very good.  Coupled with the D-star lenses or the Limited lenses and it's outstanding.  It's as good as any APS-C sensor camera on the market today.  I shoot landscapes a lot and this is one of the few cameras I've used where the leaf definition comes through even hand held.  I don't shoot video so I cannot comment on that function.I've been reading about the infamous sensor stain issue that has arisen over the early k-5's.  I'm still trying to evaluate whether or not my camera has that problem although Pentax has acknowledged the problem and has taken responsibility.  I'll revisit this issue in this review if necessary.", "Date": "February 19, 2011"}, {"Title": "Pentax has a winner", "Author": "the blind hog", "ReviewID": "RTLTTX1O7L014", "Overall": "5.0", "Content": "With the K5 Pentax has finally joined Nikon and Canon in the top ranks of the Pro-Am field.  I became a Pentaxian with the K110 and have also owned the K20D, the K7, and now the K5. I could not be more pleased with the performance of this amazing camera.  The expanded dynamic range and ISO noise reduction are all that's advertised and more.  I took more than 100,000 photos with the predecessors to this camera and the difference in tonal range, color fidelity, and noise is beyond incredible.  Here is a sample shot taken at 12,800 ISO, lit only by a bonfire and spillover from a security light over 100 meters away.  [...]", "Date": "December 8, 2010"}, {"Title": "The K5 is excellent", "Author": "thefarb", "ReviewID": "R2V8RSUPHQIBYI", "Overall": "5.0", "Content": "I had been put off by the large size DSLR's and matching huge lenses. I looked around and had (for the added image quality and enhanced low light ability) decided to get a full frame (FF) Canon or Nikon, but the entry price and enormous files didn't appeal; this is no joke, huge files take a fast processor and a LOT of hard drive, something you may want to consider.  I took a look at the Pentax K5 and found a relatively compact camera with some large advantages. It's constructed with a magnesium and stainless steel frame and feels it. It feels solid and the switches have a positive and solid feel; it fits the hand well. It is weatherproofed, something important with electronic gear -a light rain can be an expensive one without this feature; weatherproofed lenses are also available. It has a nearly 100% viewfinder which is a rarity, what you see is what you get with no guessing at the edges. Using a viewfinder for composing is advantageous, since the camera is held to the eye it also is anchored by the head, arms and body, something the two arms outstretched stance to view with an LCD screen will not do. It also closes off extraneous elements that might otherwise distract. It has a built in shake reduction system, so any lens, regardless of manufacturer, has this benefit. It allows the lenses to be smaller, a welcome feature. It does not have the vast number of lenses available that Nikon/Canon have, so if you need or want that many lenses, it might be best to look elsewhere. Having said that, the lenses available are extremely well regarded for sharpness and contrast, for example a macro that actually goes 1:1 instead of the common 1:2 magnification, and the limited series of lenses that are not only sharp, but exquisitely made of metal. It's entirely possible to carry a camera and keep 2 other prime lenses comfortably in your pockets. Last, it is backwards compatible with all Pentax lenses, which is a considerable number.  Using a viewfinder to compose makes the battery last an impressively long time; using the Live View will proportionately decrease battery life.  The K5 is an excellent low light performer with little noise, in fact it continues to surprise using a relatively high ISO rating(ISO is the relative sensitivity to light). The camera uses DNG format for its RAW files, which is a good thing since it gets away from the proprietary files some others use.  It can be shot in JPEG, RAW, or JPEG and RAW. A RAW file enables you to adjust for lighting and other parameters when you process it; a JPEG is considered a lossy file since bits of information are not kept to keep the files smaller. The JPEGs from the K5 look very good and many will not find the need to use RAW, but the DNG files are very good indeed and worth the extra effort for the micro-details. It comes with a program to use DNG, or they can be processed in the camera. Other programs, such as DXO, are also available for this. Pentaxforums dot com is a superb place to gather information about this, and other Pentax cameras and the marketplace is a great place to pick up a lens, or camera at substantial savings.  I suggest that you upgrade the firmware as soon as you receive the camera. I am very pleased with the performance of both the camera and lenses; I prefer the 50macro and the 43 ltd.  The kit lens, BTW, is very good. The disadvantage of this camera is that your local camera store is probably not going to have them, something that is very surprising considering the solid value for money.  The K5 is a photographer's camera with a great deal of control. This camera and system will not fit all needs, but if it meets yours I feel you will be pleased. I hope this will be useful to those looking.If you use an LCD screen protector, one you might consider is the GGS DSLR optical glass screen protector. The pros are: it's glass so no bubbles and it's easy to clean, no distortion. The con is that it is glass and while it will protect your delicate LCD screen, if broken it will have sharp glass shards. I am pleased with mine and it's well priced. Oddly enough, the one that will fit the K5 is for the Nikon DSLR 3000. There are other excellent screen protectors that will do an excellent job, such as Giottos, but cost more and some are still glass, a choice you will have to make.There is a great deal of confusion regarding the APS-C sensor size vs Full Frame. What appears in the viewfinder for a given focal length, say 50mm, will seem to be approximately 50% larger in the APS-C (Pentax); in this example the 50mm acting as a 75mm. This is misleading, it is actually a change in the field of view (FOV)which is a cropped image from the smaller sensor size. I would refer anyone interested in a full explanation to pentaxforums dot com and use the search function to look for: APS-C does not increase focal length over FF, it decreases field of viewThis is an excellent discussion that makes this confusing subject understandable.", "Date": "June 7, 2012"}, {"Title": "Love both K-7 & K-5", "Author": "A. KIM \"Hestia\"", "ReviewID": "R18YLYJ52ZLR6", "Overall": "5.0", "Content": "I've only used Canon DSLRs for jobs but I wanted to have one that's small and compact yet built with professional quality(mainly for travel). I was totally new to Pentax DSLR cameras and lenses...but geez...they are just amazing!!! I was totally impressed with Pentax DSLRs and lenses after using K-7 with many other lenses. High noise on K-7 was not that a big of an issue personally as I enjoyed using BW photo at high ISO. However for indoor/low light condition, better ISO was somewhat became necessary especially for color images. So I decide to get K-5 that looks exactly like K-7. The result was amazing and satisfactory! K-5 has unbelievable Dynamic Rang, better ISO, improved AF. It's a joy to work in low light conditions and photoshop retouching became much effective. K-7 and K-5 is rather a different camera as they use complete different sensors. I don't want to really call K-5 is an upgrade version of K-7 since I feel they are just very different camera and that is the reason why I'm keeping both K-7 and K-5. Love them both!", "Date": "April 17, 2011"}, {"Title": "Perfect DSLR... my choice over Canon 7d", "Author": "P. Seth", "ReviewID": "R5RNP9NQQ4SH5", "Overall": "5.0", "Content": "The k7 is awesome. Great features, customizability, build... perfect size, weather sealed, 100% viewfinder... k5 is all this with a significantly better sensor, arguably the only lacking aspect of the k7. Apparently there's a new autofocus system too... so far so good.After a great deal of research for my first DSLR, this was my choice over Canon/Nikon with Canon 7d as top contender... k5 won in most part for better a better ISO range. Very happy with my choice after using it for a few days, especially in low light. I'm able to get very good hand held shots in dimly lit indoors (1600-6400 ISO, 1/30-1/60th shutter, f3.5 on the kit lens or 2 on the 50mm FA)... in-body image stabilization comes in handy as well.About me... a photography enthusiast, architect by profession and travel at every chance I get... learnt to shoot pictures on a Pentax spotmatic... switched to a Nikon n85 a few years before the film era begun fading. Thrilled with the k5... wish it was a little cheaper. 5 stars none the less... Have to add that I was initially concerned about the choice of pentax lenses but the more I looked, they have some decent options with the DA* and Limited lenses. Definitely give this camera a serious look (if not very concerned about low light, save the $ and get a k7)...", "Date": "November 22, 2010"}, {"Title": "Pentax has really done well.", "Author": "Sifu", "ReviewID": "R29PLQLCE605DH", "Overall": "5.0", "Content": "I have been shooting with a Pentax K20D for a couple of years and love the camera, the only problems that I had with it have been eliminated in the K5. I have had a K5 for just over a month and have been putting it though its paces. The ISO is amazing shooting as 6400 looks like 800 or less in their older cameras. They have moved the controls around which bothered me a bit at first but they truly are far more intuitive and much easier to use, another improvement.  I the auto focus problems have been taken care of especially if you us a DA* lens. I am using the 50-135 DA* as well as a few non star lenses. The star lens is amazing, great image quality, good speed, wonderful bokah, and the auto focus is very good and virtually silent. It was easy to focus on the trees outside my windows then on the pains cross members without the auto focus getting confused. I havent done much with the video yet but what I have done looks great. I definately would recommend this camera, it performs wonderfully.", "Date": "January 9, 2011"}, {"Title": "Expected Good.  Got better.", "Author": "Sandu", "ReviewID": "RVT88FSQS4YI8", "Overall": "5.0", "Content": "I have been shooting a KX for the past two years, (by far the best digital camera I have owned 'til now).  It was time to move up in features, image quality etc.  After reading a lot of reviews - including hereon Amazon.  I decided on the K5.  I could write a one word summary - Wow!  It was delivered in one week, (I live at the end of a very long pipeline).  Good, solid feel in the hands.  All commonly used controls are exactly where they need to be.  I've had it three weeks at this point.  Have used it in conditions from sunny spring afternoons to snow and freezing fog.  Great image quality and no mechanical issues.I also shoot a lot of parties, shows, etc.  I much prefer ambient light to flash during these events, (this is  where the KX \"Stage Light\" program really excelled).  Obviously no pre-set on the K5.  However the low light capability is outstanding.  Fixing the aperture and shutter speed and letting the camera decide on ISO works well. AS an aside - the auto white balance seems to be much better than it was on the KX.  No more orange glow to tune out in post.So, yes I like it and would recommend it to anyone looking for an upper end DSLR.  No way you will get this quality at this price level from Canon and Nikon.  (And no way you can still use the lenses you bought in the 70s - 90s on your new Nikon/Canon.)", "Date": "May 21, 2012"}, {"Title": "Switched from a Canon 7D to the Pentax K5", "Author": "Elie Hobeika", "ReviewID": "R3B54A5I68RQ61", "Overall": "5.0", "Content": "Hi I switched 2 months ago from a Canon 7D with a 24-105mm L lens and I have to say that I have no regrets, I wanted a lighter camera that was rugged and at the same time took great pictures and had semi-pro features, at the beginning being a Canon user and before it a Nikon one I was a bit skeptical but after using the camera for a bit I started loving it, I mistook it's simplicity to it being inferior but I was wrong it only makes it more user friendly, such a nice camera to use, the 7D is a great camera but besides it being heavy and almost giving me hernia it also feels like a computer with the K5 I can now concentrate on photography. I use it with 40 and 70mm limiteds, it was as well a learning curve using primes but no regrets whatsoever, good job Pentax, maybe a full frame in the future!", "Date": "October 29, 2011"}, {"Title": "An amazing camera", "Author": "Drew Alexander", "ReviewID": "RFKX15HP4M7FO", "Overall": "5.0", "Content": "I would consider myself an enthusiast photographer.  Really started getting into photography in the past couple of years and slowly climbed the ladder to where I was comfortable buying a dSLR.  After many, many, many hours of research I kept coming back to the K-5 for my first serious camera.  I also researched the Nikon D7000, the Canon 60d, the Nikon D90, Nikon D3100, and Canon T2i.  I wasn't invested in Canon or Nikon yet, so it wasn't going to be too brash of a move to go with the underdog - Pentax.I received my first K-5 and it had \"the stain\" on the sensor, so it went back.  The replacement was an even older serial number and also suffered from the stain.  I was still committed to the camera, so I tried for a third time.  The third body did not have the dreaded stain, but did have a couple of dust motes on the sensor that could not be removed.  As I write this, the body is on it's way to Pentax Repair to try and clean the sensor.  This may not sound great for Pentax quality control (QC), but the camera itself is great enough to warrant putting up with these frustrations.Before sending in for repair, I was able to spend a few days with it during the holidays, mostly taking portraits and such.  The first thing that will jump out at you about the K-5 is its intuitiveness. It is incredibly easy to set up the menus and adjust settings.  I previously owned two Canon's, including the S90, and separating myself from the Canon menu style was no problem at all.  The button layout is very simple and easily accessible, even when shooting.The other immediately apparent perk of the K-5 is the way it feels in your hands.  You can tell right away that this thing was constructed for toughness.  No squeaks, no rattles, no loose hinges.  There is a \"clunk\" when you rotate it, but that just the image stabilization system (I believe).  It's just built very well.  I have very large hands (usually wear an XL in gloves or XXL) so the \"compact\" size of the K-5 was an initial concern.  This isn't a problem because the ergonomics are so well done.  The grip is almost like a pistol grip and just fits like a glove.Pros:- Great ergonomics- Very good high ISO performance.  Noise is noticeable at 3200, but not bad- Very fast autofocus.  Rode as a passenger around the city snapping pictures and the system was incredibly fast locking on and getting a true focus.- Metering system is very true.  Haven't tweaked this much, but haven't had to.  Light looks very natural- Solid Build- Quiet.  The shutter is exceptionally quiet.- Image quality.  Really looking forward to getting the body back to try out more.Cons:- Autofocus can be a little slow in poor light- The digital preview button is slightly confusing- Does not come with a screen protector (surprising for a camera intending for brutal conditions)- Kit lens is okay, but not the best.- The shooting mode wheel lock is a little annoyingIn conclusion, the fact that I'm still praising this camera after two returns and a repair pretty much says it all.  This is a very capable camera, that I'm dying to delve into and explore.  I would recommend this to anyone, but especially those you haven't invested in Canon or Nikon yet.Also, I can't say enough about Amazon's customer service.  My hat is off to them.", "Date": "December 30, 2010"}, {"Title": "K5 vs D7000", "Author": "Robert B. Gillies", "ReviewID": "RSFX03DFWU68H", "Overall": "5.0", "Content": "Since I own both cameras I thought I'd do little comparison between the two. Both are very excellent cameras and neither one would be a bad choice. The K5 has image stabilization built into the camera body which means it will work with any lens. Supposedly VR built into Nikon's zooms and longer lenses is a little better than in camera image stabilization but older lenses and most primes don't have any VR so I suppose the advantage depends on what lens you are using. The way both cameras work with older lenses is quite different. With the D7000 when you use an older manual focus AIS lens, you set the widest aperture and assign a number to the lens. As you change the f stop on the lens there is a mechanical connection to the aperture of the lens so the camera knows the f stop and you can use aperture priority mode. The camera sets the shutter speed which will change as you manually move the aperture on the lens. Pre AI lenses can't be used unless they have been modified. Nikon's AF lenses have electrical contacts that communicate with the camera body so all modes are available. The K5 has what they call a crippled mount which means that there is no mechanical connection which allows the camera to know when you manually change the aperture on an older lens. However you can press a button that momentarily stops down the lens (obviously this is done mechanically) and during this moment the camera meters and sets the shutter speed after which you press the shutter and take the picture. What I really like about Pentax though is that long before AF lenses came out they produced their A series of lenses which have electrical contacts to convey exposure information to the camera and also to enable the camera to electrically set the f stop of the lens. These lenses were being produced while Nikon was still making the AIS lenses which had no electrical contacts. Third party lenses also came in the A series with electrical contacts. These lenses are sometimes quite reasonable on the used market and allow you to use program mode on the K5 which means you have basically everything except AF.To sum it up you have three kinds of mounts for Nikon, pre AIS which need modified, AIS where you manually set the aperture and AF. On Pentax you actually have four. The older screw mount which requires an adapter, the PK M mount which has to be stopped down to meter, the PK A which has automatic metering features and the full AF mount. With both Nikon and Pentax you have AF lenses that use a screw drive from the camera and some with built in focus motors. Supposedly Nikon's in lens focus motors are better???The disadvantage of the K5 is that there are a lot more lenses for Nikon including both new, discontinued and third party so there is more competition in the Nikon lens market both new and used. Also it is harder to find extension tubes, teleconverters, etc.  for Pentax. Two very nice lenses available for Nikon and not Pentax is the Tokina 11-16mm wide angle and the Tokina 100mm macro.  One very nice lens for Pentax is the DA 300mm f4 which is the lightest most hand holdable lens in it's class.The K 5 is presently $200 cheaper than the D7000. The K5 is slightly lighter weight, smaller and fits nicer in your hand especially when combined with some of the smaller primes. The K5 has a sensitivity mode (ISO priority) which the D7000 doesn't have.  I have two very nice Vivitar series one macro zoom lenses by Komine 70-210  f2.8-4. that don't extend when zooming like many other zooms. They are identical except that one has a Nikon AIS mount and the other a Pentax A (PK A) mount. With the Pentax version I get full programing mode plus image stabilization which I don't get with the Nikon version. One thing with Pentax A lenses is the focal length information is not sent to the camera so with a zoom the camera doesn't know the focal length as you zoom in and out. Of course the AF lenses do send focal length information to the camera. My conclusion is that they are both really great cameras. When I was in high school my first camera was a Contaflex one. It was a single lens reflex but didn't have interchangeable lenses nor a light meter and was expensive considering what a dollar would buy in 1957. By comparison these two cameras (in combination with my Mac mini) are absolutely amazing.", "Date": "August 13, 2012"}, {"Title": "Pentax K5 reveiw", "Author": "TC Photo", "ReviewID": "R14PZIZRNQ4R1T", "Overall": "5.0", "Content": "So I've had the Pentax K-5 nearly 2 years now. I've done a ton of art shows displaying work across the Midwest and after people spend time in my booth, the question seems to always come up...Nikon or Canon... When I tell them these images where taken with a Pentax K-5, the response is always the same.. Pentax?? I just smile and say ya it's a Pentax:) The sensor brings light to the image that Canon or Nikon misses. Granted, the auto focus is slow, and maybe the lens selection lacks some, but the images are really good. I've gone as big as 24X36 with no problem and the images are tack sharp. Shooting DA* glass may help. I think for the photographer that wants the most features for the $, Pentax is the brand to look at!", "Date": "November 6, 2012"}, {"Title": "Great Alternative to Mainstream Cameras", "Author": "Andrey Kirillov", "ReviewID": "R3QLYF6T2WHH0B", "Overall": "4.0", "Content": "Pentax K-5 is a great camera and should be definitely considered as a good alternative to mainstream brands. If you consider buying a DSLR give this camera a chance. Do not listen to those who say that you'll be stuck with limited choice of lenses or worse shooting range. With quite a few Pentax lenses and an array of Sigma/Tokina ones every possible range is covered. With new specs you'll be fine shooting in various conditions. With weather sealing and strong build you don't have to worry much about your camera and just keep on pressing that button - the guaranteed number of shutter releases is said to be about 100,000.Still, there are some flaws, but on the design side. I also own Samsung GX-10 and no camera has been better from the point of view of back panel design. GX-10 has better buttons, better placed. Besides, GX-10 feels great in big hands like mine and I always feel like it's born with my hands. Pentax lacks this, but since Samsung left the DSLR market and Pentax doesn't suspect about their design errors we are stuck with no choice. If you're ready to throw 200 dollars on top of it, get a battery grip that helps for bigger hands.Anyway, I guess all modern prosumer cameras have some design flaws. This does not shade the fact that Pentax K-5 produces great results. Its LCD-screen is magic - I love my pictures in it even more than on a big screen. The number of effects is impressive - HDR, extended dynamic range, cross-processing. The video is very good too.I would definitely recommend Pentax K-5 both for those who want to try the world of big cameras, and for those who consider changing the camera system. You'll be pleasantly surprised. Be sure to buy high-capacity memory cards though, as files are big: typical JPEG (good quality setting, not the top one) is 5-7MB, while typical DNG RAW is 16-20MB. If you shoot a lot, add an additional battery. I recommend buying the body with weather-sealed Pentax 18-135mm lens - you would rarely want to change it as it covers most needs of a casual photographer, of those on vacation or travelling, and is good in most other situations.", "Date": "August 12, 2011"}, {"Title": "Pentax K-5 An Awesome Camera", "Author": "Diego", "ReviewID": "RURSE8M4JI8D7", "Overall": "5.0", "Content": "The Pentax K-5 is by far the best dslr I have ever owned.  I recently upgraded to the K5 from the K7 and have noticed some big improvements.  For one the autofocus on the K5 is much better than the K7. I like to do \"action photography\" such as sports, dance, birds in flight, etc and the Pentax K-5 has really made things easier for me.  It also has better dynamic range. I really like the TAv exposure mode which is unique to Pentax. In TAv exposure mode the photographer sets shutter speed and aperture, and the camera sets a matching ISO so that correct exposure is obtained.I'm not much of a review writer but I just know I love this camera. Here is a summary of the Pentax K-5 by Pentax Forums \"It is a fantastic DSLR with exceptional image quality, fast autofocus, high sensitivity, a compact and lightweight design, weather-sealing, and shake reduction backwards-compatible with old lenses even from the screw-mount era. We highly recommend it for three groups of photographers: serious amateurs who have sufficient experience with DSLRs to be able to take advantage of all the K-5's features, outdoor photograhpers who frequently travel and are looking for a complete weather-resistant DSLR system, and professionals who are looking for a camera with high image quality but are on a budget. If you fall into any one of these groups, we feel the K-5 will be the perfect match for you!\"Read more at: [...]", "Date": "November 21, 2010"}, {"Title": "No-brainer upgrade for any k10D owners out there", "Author": "David \"deskjockey\"", "ReviewID": "R3CKBEN9OF1UV3", "Overall": "5.0", "Content": "I owned a Pentax k10d for a couple of years prior to buying a k-5. I saw other Pentax  models come out (k-r, k-7, etc.) and held out for a \"worthy upgrade.\"  The dynamic range, video options, and in-camera digital filters make this upgrade a \"no-brainer\" for me.  I was an early adopter of the k-5, got the camera in December and have been blown away by the improved ISO performance.For me, as well as other users, the increased ISO  alone (to 51,200, but I think 6400 ISO will be the max most people will shoot), is worth the upgrade.  I can shoot w/ the kit lens in low light conditions, and the images look MUCH better than when shooting with primes in ISO 800 or 1600 on the k10d.  Amazing.It's a no-brainer upgrade for k10d users... can't speak to other cameras since I don't own them, and you'll be asking yourself why didn't you buy this sooner when you finally get your hands on it (I know I did, and I got the camera only a few weeks after initial rollout).", "Date": "March 31, 2011"}, {"Title": "I'm in love with my Pentax K5", "Author": "Kayb64", "ReviewID": "R745IVC1YRUCT", "Overall": "5.0", "Content": "I love my Pentax K5. Sure, it does have a few quirks like no autofocus in video, but other than that, this is my baby and I carry it around with me everywhere. So far, I've shot super sharp video with this, using an external microphone, I've done time lapse photography using an external interval timer (though there's a built-in timer already in the K5), and I've photographed an outdoor concert venue for 6 hours in the rain with my 70-300 lens, though my lens was not water resistant. My K5 did come with a WR 18-55 lens, which I was pleased with, because that's how they are supposed to be shipped. I've seen some sellers, particularly on Ebay, who don't ship the WR lens with the K5, and that 'cheap' price that seemed like a great bargain ends up being anything but a bargain when you have to pay and extre $160-$200 on a basic lens that is considered a \"kit\" lens.I'm very happy with my purchase and I'm a loyal Pentaxian.", "Date": "October 1, 2012"}, {"Title": "Thankful for the green mode", "Author": "Darmith", "ReviewID": "R2ADYTGR5TKFJE", "Overall": "5.0", "Content": "As this was my first camera upgrade since a 1974 Petri 35mm slr, to say I was overwhelmed when I pulled this camera from the packaging would be an understatement.  As I gazed upon the myriad of buttons, levers, and thumbwheels I was fairly sure I was in over my head.  Pulling out the hefty owners manual I flipped through it to find the point where the language changed from english, not in this book, 386 pages of instructions all in my native tounge.  I began reading and read until the battery fully charged then as any kid with a new toy it was playtime. I had read far enough to know the button, lever, and thumbwheel functions, not how to use them correctly, but what their purpose was.  More importantly I read that you could set it to \"green mode\" fully automatic, all I had to worry about was composition and pushing the release.  I bought this brand and model based on reviews of how well it performed in low light with no flash and the reviews are spot on, it is amazing.  Still learning to shoot in manual, and the priority settings but with the ability to take over 1200 pictures in the highest quality jpegs it is much easier to take several shots of the same subject to compare the results of the different settings than when it was limited to 36 exposures, a single ISO and scribbled notes to match with the negatives.  To shorten an already long story, if as I you are stunned by all the adjustments on this camera, set it to green mode and start taking pictures they will be beautiful.  After a month of experimenting the green mode still comes out with a better picture than my manual settings about half the time.", "Date": "July 4, 2012"}, {"Title": "Impressive pro-caliber camera", "Author": "Carl Christensen", "ReviewID": "RWVPJ8W9VQG7N", "Overall": "5.0", "Content": "I am coming over from a Sony NEX-7 which is the \"latest & greatest\" but I didn't like it.  The Pentax K5 is a big improvement - both in the camera and in the far better lens selection.  The K5 has a great sensor (16mp APS-C - same as the Nikon D7000) and has a high 82 DXOmark benchmark score and a \"Gold Award\" from dpreview.com.  Also I find the sensor dust shaking & other utilities to be much better than the Sony which was a \"dust magnet\" in my opinion  (and I am careful with switching lenses).  I'm looking forward to the new Pentax K-01 mirrorless which I can use the Pentax K/KAF lenses as well.  I've previously owned the Canon 7D and the ruggedness and build quality seem up to par with that camera (although the K5 is quite a bit smaller & lighter, which I like, very ergonomic).", "Date": "February 23, 2012"}, {"Title": "A superior camera", "Author": "Sifu", "ReviewID": "R2S3KURMGBO2JQ", "Overall": "4.0", "Content": "I am going to write a short and sweet review. I will also keep it not technical that has been done well above. I started digital with the K100D the moved up to the K20D which is a very good camera. I was a pro for many years during the film days and once I got shooting again I love digital. My daughter wants to become a photographer so I am back at it. Here is the only place where the Pentax falls down. They just do not make some of the things a pro would like to have. The K5 cannot tether which in many conditions would be a huge help and even required for others in a pro shoot.  You cannot buy a remote flash trigger that allows you to use PTTL.  There are just many accessories for Canon and Nikon that I wish I could get for the K5.  That said I do love the camera, they really thought out the ergonomics on this one, a vast improvement over the K20D, which by the way was fine, I would never have thought anything about them if I had not got the K5.  It is just very intuitive to use, everything is right where it ought to be, I hardly have to bring the camera from my to change settings.  The photos are fantastic. I was a bit put off by the auto focus but as it turns out it was the lenses I was using. Okay they were not bad at all I am just being very picky. But when I stepped up to the star lenses the auto focus performs wonderfully.  I took a shot of a raft going down a river that I shot through tree branches in the winter, the AF found the raft, ignored the branches and gave me a perfectly focused shot.  I rate this camera very high a nine or ten on its use and quality. If the lack of some things that would only really bother a pro doesn't bother you then this is the camera for you, it does out perform many cameras in its price range and even of some vastly more expensice.  Shooting at high ISO is great it took me a while to do it as I am old school but I have taken shots at 3200 and 6400 that are great even 12K us usable, 1600 looks like the 400 of other cameras I have used. If you have light room you can easily clean up the noise at the highest ISO as well and get some great photos.  Well I guess it was not that short, but I had to say what a joy it is to use this camera. Even if I have to go to a D3s for some studio things and for the accessories, I will continue to shoot with the K5 for a great many things.....of course if Pentax decides to create firm ware to aid tethering hint, hint, I can do without remote PTTL as I shoot off camera flash on manual anyway.  Oh yeah the video is great and as for the auto focus, all the pro videographers I know never shoot with auto focus anyway.Okay, now that I have used the camera for a good amount of time I would like to revise the review a bit. I still love the K5, there is something about it that just makes me enjoy having it in my hands. Picture quality is wonderful, as good as cameras costing many times as much but here are the problems that I have had. First I ordered a star lens it came with the autofocus motor not working, it was replaced but still a hassel. Second since I got back into shooting professinaly the K5 has not held up. It is in the shop getting repaired right now. I know that electronic devices break and it did right in the middle of a shoot. I was able to pull out my K20D and finish fine though. I am not going to get into what happened just that it made shooting with it impossible for that day.  Where I am really not happy is with Pentax customer service. I have about two months left on warrenty and that seems to make them not so interested in being prompt. They have had my K5 for a month now, they said it would be fifteen to twenty days. I called at twenty days and they said they had just got the camera ten days before. I mentioned that I had a signed receipt for the day it was delivered. They said wait ten days and call back so I did. Then they said the they had just got the camera five days later than before.  When I questioned the guy about that he said oh wait there is a hold on your camera because it is on warenty. I asked him if that made a difference on their turnaround time and he just said call back when it has been twenty days, which of course it had been over that. It is hard because I do really like the camera but with this kind of customer service I am going to fork out for the Nikon D3s I guess when you put the camera through pro work you really need a pro camera. I will still use the K5 especially for travel and landscape work. I really dont think that if someone uses the camera like an amature would and not shooting thousands of photos in a day there would be no problems, and maybe not anyway I may have just been unlucky but thanks to their customer service I am going elsewhere before I have so much invested I cant do so.", "Date": "September 22, 2011"}, {"Title": "Fantastic camera!", "Author": "Ramesh M. Thadani \"Ramesh\"", "ReviewID": "R2JC41VT34VKSI", "Overall": "5.0", "Content": "I have gone through various SLR and DSLR in my life, and just upgraded from my Pentax K10D (DSLR) to this model, and do not regret it at all.... I am wondering, what took me so long! It has all the great functions and characteristics I have come to learn and get used to on my old DSLR (Pentax K10D), such as the weather seals, which have got me through some dire straits and breath-holding moments when it fell into a metro deep snow in the Alps, operated over 4 thousand metres altitude and dewy fog in the Andes, and water spray from boating in the Amazon - all without a second of functionality loss or memory/capture loss. Just wipe it clean, and back to business. This new model has the same concept, but some great new features: much faster AF, with precise and crispy clear images, allied to a much higher ISO operating band: the camera boasts ISO 51200, however, if you use 1600 and have perfect pictures, that is already positive point very difficult to beat. The shutter is much quieter, allowing you to make pictures inside a museum or church, or during a classical performance, without making yourself unduly noticed, unlike my previous camera. The additional grip also allows you to use standard AA batteries, which you can find from the Amazon to India without worries, especially when \"on the move\". It also allows you to register movies in HD, and use \"live view\" when making your pictures, with on-line histogram readout, helping you with focus and lighting before you even click. All in all: if you are adventurous and a traveler, and need a resistant, all-rounder, that will be ready at your fingertips for any situation, this is the camera! It is like a Land Rover, or Swiss Army knife: not the fastest, not the most luxurious, but will get the job done in any condition! I highly recommend it, unless you are into studio, or any very specific field of photography! With the robustness of the Pentax K family, and the brains of the digital medium format (drivers, engines and electronic perks), it might look expensive at first, but when you pick it out of the snow or brush off the water spray and dust, and it is business as usual, the price becomes a bargain!Pentax K-5 16.3 MP Digital SLR with 3-Inch LCD (Black Body Only)", "Date": "August 20, 2011"}, {"Title": "Pentax K-5  An Awesome Camera", "Author": "Diego", "ReviewID": "R1SY78YLMYPONL", "Overall": "5.0", "Content": "The Pentax K-5 is by far the best dslr I have ever owned.  I recently upgraded to the K5 from the K7 and have noticed some big improvements.  For one the autofocus on the K5 is much better than the K7. I like to do \"action photography\" such as sports, dance, birds in flight, etc and the Pentax K-5 has really made things easier for me.  It also has better dynamic range. I really like the TAv exposure mode which is unique to Pentax. In TAv exposure mode the photographer sets shutter speed and aperture, and the camera sets a matching ISO so that correct exposure is obtained.I'm not much of a review writer but I just know I love this camera. Here is a summary of the Pentax K-5 by Pentax Forums \"It is a fantastic DSLR with exceptional image quality, fast autofocus, high sensitivity, a compact and lightweight design, weather-sealing, and shake reduction backwards-compatible with old lenses even from the screw-mount era. We highly recommend it for three groups of photographers: serious amateurs who have sufficient experience with DSLRs to be able to take advantage of all the K-5's features, outdoor photograhpers who frequently travel and are looking for a complete weather-resistant DSLR system, and professionals who are looking for a camera with high image quality but are on a budget. If you fall into any one of these groups, we feel the K-5 will be the perfect match for you!\"Read more at: [...]", "Date": "November 21, 2010"}, {"Title": "Pentax finally got it right!!", "Author": "April Mendoza", "ReviewID": "R1NMWN20GYZ4YZ", "Overall": "5.0", "Content": "I have had my K-5 for about 2 months now, and I love it. This is my fifth DSLR. I used to hang around in the beginner type DSLR cameras, but finally decided I need a semi-pro to achieve the type of pictures I wanted. I had a Pentax K-X prior to this one, and it doesn't even compare with the quality of pictures I get from the K-5. I take some of the best low light shots with this camera with literally no noise at ISOs of 1200 and 1600. The pictures of my son playing football and my daughter cheering come out looking great with the fast shutter speed. I highly recommend this camera!!! I have since purchased 5 lens and the image quality I get is beyond amazing. I am no where near pro, but I get a lot of compliments on my sports pictures since getting this camera. It is totally worth the money. Way to go Pentax!", "Date": "September 15, 2012"}, {"Title": "Pentax K5", "Author": "M. Malagon", "ReviewID": "R1C5LG6ZENZ6Q5", "Overall": "5.0", "Content": "Very good camera, very solid build and weather proof. Good ergonomics fit my hand nicely, good button layout easy to reach when shooting. Image quality is excellent, I've had it for about a month, shot a wedding last week with it. Was very pleased with the quality and color of the images. Very good in low light situations with out flash. Did some test shots at ISO 3200, they look like shot I them at ISO 400 very little noise.Great camera, upgraded from K10, well worth the money.", "Date": "February 27, 2012"}, {"Title": "wow", "Author": "pentaxtic", "ReviewID": "RO2D7D47JJVZ9", "Overall": "5.0", "Content": "wow!!!! what a camera (well i said the same thing when i first held my k-7) but then again its the same body. images taken were excellent. when ppl say \"get a k-5 and feed your photography obsession\" its true. more obsessed now than ever. i have a k-x & a k-7. k-x was alreay very good in low light. i was very confident using it in low light situations k-7 very good in daylight but the k-5 just blows those 2 away. so far have only tested ISO1600 -> ISO6400. its like NOTHING! the body is solid. the shutter is butter!!!! but the menu's should have been changed in my opinion. this shouldve been changed to a more pro-look. too simple, lets complicate it a lil bit so we can use the manual. this is gona be good for street photography although a bit heavier but smaller than my d300 (excellent camera too by the way). now will save up for THE LIMITEDS.", "Date": "February 15, 2012"}, {"Title": "Stunning camera", "Author": "Standingtree", "ReviewID": "R48FQRSWXJ50H", "Overall": "5.0", "Content": "I bought this camera mainly because I want to shoot in the rain.It turned out to be one of my top 3 fav cameras. I put it at the same level as the incredible canon 5d mark II in many aspects.  (the focusing is better than 5d2 for sure)Here are my fav features of the camera:1 Low shutter sound  (really low)2 Good high ISO performance.  (I think about 1/2 step away from 5d2)3 Great feel in holding it in my hand4 Amazing control!!!!  This is really cool as once you get to know the control, it flows super wellI highly recommend this camera.", "Date": "December 7, 2011"}, {"Title": "Prosumer DSLR that beats the \"big names\"", "Author": "J. R. Pittman", "ReviewID": "ROM3TKCBYO37C", "Overall": "5.0", "Content": "I've only had it for a day but I am already in love. Sturdy construction, weather sealed, gorgeous photos and a wide range of Pentax lens compatibility. Seach professional reviews for yourself and you will find that the K-5 simply out performs Canon and Nikon offerings in it's class. If you are moving up but haven't already invested in a lot of glass for your Canon or Nikon you need to take a serious look at this camera. Don't be a Canikoner... be a Pentaxian!", "Date": "December 2, 2011"}, {"Title": "Best camera for the price hands down", "Author": "bizzazz", "ReviewID": "RBLHNU76AA4QI", "Overall": "5.0", "Content": "Bought this camera back in May of 2011.  It is by far the best camera I have ever own or used (within the price range of course).  Other reviews have more technical details, but trust me when I say that the majority of pictures taken with the K5 have never failed to impress my family.", "Date": "November 30, 2011"}, {"Title": "The greatest camera body out there", "Author": "Sarweswara Rao Vemula", "ReviewID": "R37SI0VMNUBZIW", "Overall": "5.0", "Content": "Their are 3 reasons I say this:1) The image quality is surpassed by none! The dynamic range is unbelievable at iso 80. Plus the high iso is astonashing: I can shoot up to iso 3200 no problem and even use iso 12800 when needed!!!2) The build quality is amazing. Built like a brick, incredibly small, and can survive a monsoon! I took this thing into the alaska rain and survived wthout a sweat3) The ergonomics make this the easiest camera to use if you know what you are doing. If you like to constantly change the EV, ISO, shutter speed, aperture, continuous shoting, or manual focus then this is the camera for you! I remember being able to do all of this in like 10 min.LOVE MY CAMERA!!!", "Date": "November 12, 2011"}, {"Title": "Photo quality is absolutely superb", "Author": "S. Vogt", "ReviewID": "R1A7B043XGW2IP", "Overall": "5.0", "Content": "While there are some areas that I think the Pentax K-5 could use some improvement... it is absolutely top-notch in the area that matters above everything else, and that is photo quality.I really think that if you are not really interested in video, don't have any particular allegiance to Canon or Nikon and simply want a tough, rugged, sub-$1,500 DSLR which will stand up to all the elements and take absolutely top-notch photos (even with the kit lens), then the K-5 is for you.The camera itself is very well-made and surprisingly compact next to its competitors in its price range. It is basically like a little tank. The hand-grip is nice but only accomodates three fingers with your index finger resting on the dial wheel above the hand-grip. In practice, it doesn't feel uncomfortable but I do think this is one area where the Canon 60d and Nikon D7000 do a bit of a better job (but of course they are also larger). But overall it's not too bad.As expected for a camera in this price range, there are many direct access controls for adjusting setting such as the ISO and other nice things like a RAW button for switching to raw from jpeg. Your thumb is positioned very comfortably on the back of the DSLR, making access to most buttons a breeze.The menu system is the same as most Pentax's of late. It's main menu system is pretty similar to Canon's with respect to how you navigate through it and how everything is laid out. I like Canon's menu system a lot, so this is a good thing. As would be expected, this DSLR is jam packed with features, so a read-through of the manual is highly encouraged.Photo quality, as I said before, is top notch. What strikes me is the level of detail that is captured in my shots with the K-5, even with the lowly kit lens. Even high-sun shots look pretty decent (well, about as good as you could expect given the conditions). I have experienced excellent noise performance up to ISO1600 but even ISO3200 is pretty respectable. One trademark Pentax trait is very vibrant and saturated colors. In most instances, this works out quite well. Although there maybe some shooting conditions where you might want to dial back the saturation just a little.If you order it with the 18-55 WR kit lens, you will find that its a pretty decent performer. As well as the 50-200 WR kit lens. There is also the 18-135 WR lens as well, which is alright too. Pentax deserves tons of credit for offering a line of a very reasonably-priced, decent-performing weather-sealed kit lenses. The 18-55 WR (weather-resistant) kit lens is around $150 and the 50-200 WR kit lens is about $210. However, as with a lot of DSLRs, it takes some top-notch glass to bring out the K-5's full potential. So it's worthwhile to invest in at least one lens from Pentax's DA* line.Now, onto to some annoyances. I think the autofocus system is good but not as decent as it could/should be. It is just a hair slower than the 60d and the D7000 in most instances. But certainly not subpar though. However, I think this is an area where some improvement should be made. Another major irritant is how much time it takes for the camera to display a picture you just took on screen. It is noticeably slower than some other DSLRs and this is also something Pentax needs to work on. Also, the viewfinder is 100% coverage, which is nice. And while it's perfectly decent, it is not as good of a magnification as the 60d's (although the 60d has only 96% coverage) and while it is good, it could be better. I was also non-plussed by the LCD quality. I think its ok, and certainly the resolution number is competitive, but it doesn't hold a candle to the ones found on the Canons.The video mode is not really great on this DSLR. Still-shooting performance is my top priority so I honestly could care less about the video mode, as I only will need it on rare occaisions. But this is one area where both Canon and Nikon have an advtange.But, overall, I still give this camera 5 stars due to its photo quality and its ability to take superb photos in just about any condition you throw at it. Something that can't really be said about any of the other DSLRs in this price range. Despite my criticisms, the camera's performance is overall good, but needs improvement in some areas. But if you are shopping in the $1,500 range, this deserves as much consideration (or perhaps even more depending on what you're shooting in) as Canon's and Nikon's competing DSLRs.", "Date": "August 6, 2011"}, {"Title": "No second thoughts", "Author": "now what", "ReviewID": "R1VXVVCN4L2PNL", "Overall": "5.0", "Content": "My K-5 experience has been a real adventure: first I was sent a broken, used camera (palmed off as new) by an Amazon seller (Essex Technology Group); then Amazon sent me one that was either damaged or defective.  Whatever the reason, the images from this second camera were uniformly terrible--muddy and ugly, with no definition.  Amazon was terrific: they sent me a replacement K-5, which arrived today.  The third time's the charm!  What a difference!  This camera is great, I am I very glad I got it.  I already have a K-r, so I have something to compare with.  I like the K-r very much, but the K-5 is a significant upgrade in all respects.What's good about the K-5:--16+MP (up from 12+ in the K-r), increased DR, 14-bit color (up from 12-bit in the K-r).--You can shoot remote (IR) from behind or from in front of the camera.  Great improvement over K-r (you had to be beside or in front of the camera).--You can shoot remote (IR) burst and remote timer.  Another improvement over the K-r.--You can shoot with cable shutter release, which can be more convenient than IR in some situations.  (K-r is IR only.)--With the v1.11 firmware upgrade, you can capture over two dozen RAW images in burst mode at 7fps before the shooting speed begins to slow down.  A huge improvement over the K-r, and one of the main reasons I upgraded to the K-5.  Very few cameras at this level can do this.--You can set WB to Kelvin temperature numbers.  Very useful; for me it's easier than remembering a list of terms (\"shade\" \"fluorescent light\" etc.) which may or may not be entirely applicable.  (Althought these in-camera numbers don't correspond to what Adobe thinks they are in PhotoShop, the differences aren't too great.)--At any given WB setting, the color seems to be a tiny bit better than K-r.  But this is highly subjective and could be due to inevitable slight differences in environment, due to time required to remove lens from one camera and put in on the other.--Even in flat light, it appears to generate better images (more contrast and more detail) than the K-r, which was already a very good camera in any light.--The increased resolution is very noticeable in enlargements, which is going to mean better large prints and crops.--Even JPEG images are very good--I just gave it a quick test for some images to view on the computer, so I haven't yet shot and looked at RAW.*NOTE: for some reason, the camera comes with JPEG quality set to less than maximum.  With all this firepower, I don't know why Pentax assumes that the user wants to generate anything but the best possible images.  But this is quickly changed through the Info Menu.--You can shoot DNG (Adobe's version of RAW) which means instant compatiblity with Photoshop's earlier versions.--You can make countless modifications to programs and settings, to customize everything in a way that works best for your shooting style and image preferences.  For example, it feels more natural for me to have the front e-dial for aperture and the rear e-dial for shutter speed.  Pentax has it set up the opposite, but it was a matter of moments to go into the menu and switch the dials' function to suit my preference.--Redundancy: there is more than one way to access most key functions to change them.  In many cases, you can go through a button, through Info, or through Menu.  This makes it much quicker and easier to find what you are looking for.--User friendly!  Many settings can be accessed at the touch of a button.  The choices are generally very good and take very little getting used to.--Like the K-r, other key settings can be accessed and changed by simply pressing the Info button once or twice, then changing from the matrix of a dozen items.In short, what's not to like?  The price has come down, the kit lenses work great, the camera is compact and easy to use, IQ is terrific.  Can't wait to take some surf shots with the zoom.  (Of course, some waves would help, and sunshine would be good, too.)In my original review I had some comments about the physical features of the K-5; they are very minor and with use I have gotten used to them, but they are real and I am including them here...................From my original, \"First thoughts\" review:At this point I can only comment on the handling of the K-5, since I haven't had a chance to use it much.  I have a K-r, which I like a lot.  I realize that anything new takes some getting used to, but I feel that the K-r was a little better in terms of handling.  Examples:1. The Mode dial (PASM)on the K-5 is a lot stiffer, and it's awkward and unneccessary to have to push down the button atop the dial in order to make the dial turn.LATER NOTE: I always shoot Manual mode, so at this point this is a very minor issue.2. The AF selector dial is also too stiff--very hard to turn. [Still irritating.]3. I also find the battery cover opening mechanism to be needlessly complicated.  A simple push-to-open (like the memory card cover) or a simple latch (like the K-r) would be sufficient. [Still seems like overkill, and it's inconvenient.]4. The memory card slot is tight and the card sticks a bit, especially when trying to make it pop out for removal.  (I tried this with two different cards, including the one from my K-r, so it's not the fault of the card.) [The replacement camera is better on this score.  I've seen complaints from a few other K-5 users, so this may vary camera-to-camera.]5. The flash cover will pop up when the button is pushed, even if the camera is turned off.  This could cause problems when taking the camera in and out of a case; if the cover pops up due to an accidental touch of the button, the cover could get snagged on something and be damaged.  The K-r cover won't pop up unless the camera is on; this seems like common sense. [This still looks like a design flaw.]Now, the reason why this review is so abbreviated.  I ordered my K-5 through Amazon, from Essex Technology Group.  I've been burned before by Amazon sellers, so I contacted Essex in advance, to verify that this was indeed a brand-new camera.  I was assured via e-mail that it was a new camera.  Based on this, I ordered it.The camera arrived this A.M.  I put the battery in the charger so that I could start using the K-5 as soon as possible.  We all know the feeling--like a kid on Christmas morning!  I could hardly wait!  While the battery charged, I got out the manual and the camera to familiarize myself with the differences.  I checked out a couple of controls, then when  I went to put on a lens, I noticed that the lens release button (the one that allows you to remove the lens) was missing!  Not a good sign.  By now, the batter was partially charged, so I took one photo so I could check the shutter count.  This \"new\" camera had already taken 1,284 pictures!I've contacted Essex and demanded a free-of-all-charges return.  But they obviously won't compensate me for wasted time and effort, nor for the frustration.  I would advise anyone to stay away from this dealer.", "Date": "July 27, 2011"}, {"Title": "Playafied", "Author": "Palm Desert Mermaid", "ReviewID": "RV92OIIJI4X9B", "Overall": "5.0", "Content": "So,I will not reinvent the wheel. Read the glowing reviews of this camera and take everyone's word for it. This camera rocks. I bought this camera for three reasons. 1) It's a Pentax and I have been happy with Pentax since I bought a Spotmatic in the early seventies. 2) Some of the forum reviews thought the K-5ii feature set wasn't worth the higher price vs. this camera, 3) I was going to the Burning Man festival and I wanted a weather-sealed high end camera to use in one of the harshest environments on the planet. All I can say is that I have not been disappointed. The camera worked like a dream. I am totally happy with my photos and despite heat and ferocious dust that thoroughly coated the outside of the camera (aka Playafied) it never quit. Indeed I have not been able to detect any dust getting inside the camera at all (don't take off the WR lens though). BTW: I bought mine from Beach Camera and was totally satisfied unlike another recent reviewer.", "Date": "September 22, 2013"}, {"Title": "All the features and buttons that high end SLRs have at an affordable price!", "Author": "W. D. Howell", "ReviewID": "R3MG604WN7EI5O", "Overall": "5.0", "Content": "I switched from Nikon D40 to the Pentax system, because I now consider myself an enthusiast up from an amateur. Alas in these difficult economic time I can't afford $2000.00 for a weather resistant Nikon with a better sensor, but I can afford the Pentax which has the aforementioned qualities I'm looking for. Pentax is such an easy to operate camera, it has all the switches and dials on the camera, no more diving into the menu to adjust ISO or to get continuous focus or metering. And the lenses are affordable, even for the fast primes as compared to Nikon fast lenses. Backwards compatibility you got it, K mount is a popular mount, this allows for purchasing high quality glass affordably, ebay has thousands of quality lenses. Also it seems that Pentax has enthusiastic fan base with helpful forums, which comes in handy from time to time. For such a powerful camera it's tiny, as small as my D40, and the lenes are small, which is cool for carrying around all day. The down side of being small is my pinky finger drops off the camera, so I ordered a battery grip, and I bet it's still going to be compact. Speaking of ergonomics the camera is easy to hold, due to its deep grip, and the switches and dials have a quality feel. The fit and finish is superb. I'm glad I made the switch, I like being a \"rebel\", in the world of cameras anyway!", "Date": "June 30, 2013"}, {"Title": "Great Product and Great Amazon Service", "Author": "S. Huang", "ReviewID": "R2B6UFTDA5E1FW", "Overall": "5.0", "Content": "Pentax K-5 is among the top semi-professional DCs, from my personal use.The quality and design of the camera body is just perfect. But the lens quality (FA 50mm and 18-135mm) is on average compared with Canon and Nikon, I would say. The good thing is that you can use the lens correction function in the K-5 to make the photos better for some of its recently developed lenses (such as 18-135mm).I also like the weather sealed body and its most lens series.As a reminder, once you get the new camera, go to their website to update the firmware. The new firmware can increase the camera performance tremendously.By the way, Amazon's service is just great (except for the tax now they collect)!", "Date": "October 22, 2012"}, {"Title": "Excellent Performance, Satisfying Upgrade", "Author": "Casey G. Jones \"Casey\"", "ReviewID": "R2BK96VQ5XGDGQ", "Overall": "5.0", "Content": "I had a K20D prior to buying the K5 as an upgrade.  The K5 is really a high performance camera.  The higher ISO with minimal image noise is exceptional and is a very valuable part of this camera.  The image quality is excellent, including great color and sharpness.  This camera is very well constructed, user friendly, and renders excellent results.  Significant quality for the price.  Pentax has made an excellent tool by producing this camera.  I am very satisfied.  As an addition to my review I just wanted to make this comment about unloading SD cards from the camera.  When you go to get your SD card out of the slot, hold down on the card with your finger, then sort of let it go quick to allow it to spring out more than it would otherwise.  It pops up enough for you to grab it.", "Date": "September 25, 2012"}, {"Title": "Outstanding semi-pro camera", "Author": "David J. Thomas", "ReviewID": "R3JZPXGX91N9R", "Overall": "5.0", "Content": "I've had my K-5 for over a year, and have shot more than 20,000 images.  This is an outstanding camera!  Many of the previous reviews give more details, and the few drawbacks mentioned have been mostly fixed with firmware updates.  When I bought this camera, I compared it against similar price-range cameras from Canon, Nikon and Olympus.  In the stats, this was easily the best camera, and my experience has confirmed it.", "Date": "June 5, 2012"}, {"Title": "Great Camera!", "Author": "Kyle", "ReviewID": "R1PEM4LKZ9F7F8", "Overall": "5.0", "Content": "It took me a while to decided between the the Canon 60D, Nikon D7000, and Pentax K-5.Having used all 3 cameras, I'm glad I chose to go with the K-5. The image quality is comparable to that of the D7000. In fact, even in program mode, pictures come out great, without being too hot, or to dark. The colors are vivid, and the low noise at high ISO is better than what I expected. The focusing is really fast, but not always accurate. I'll give the AF 4 stars. Overall a really great camera. Satisfied customer.", "Date": "February 4, 2012"}, {"Title": "Glad I am a Pentaxian", "Author": "W. Hoover", "ReviewID": "RB584WFUCWMZF", "Overall": "5.0", "Content": "Almost went to Nikon, with the purchase of Nikon D5100.  It was an excellent camera, but after looking at my photos taken with it and my Pentax Kx, I still liked the Pentax BEST!  Now I own the Pentax K5 and am very excited about this feature and weather proofed camera.  Great feel with this camera and all the features to do what I want in photography.  This is a pro camera at a reasonable price and only the photographers limitations will hold me back.  I would highly recommend this camera to any serious photographer.", "Date": "December 22, 2011"}, {"Title": "The latest and greatest from Pentax", "Author": "LynnJr", "ReviewID": "R1EXUGXJDZ7E0B", "Overall": "5.0", "Content": "I bought the K5 after using my K20 for a couple of years. The K20 is very very good, the K5 is an order of magnitude better. Low light performance of the K20 was just OK, the K5 is a real standout. It's taken a few days to get used to the menu and control differences in the K5 but Pentax has done a very good job of keeping the user interface friendly and close to previous models. I shoot predominately with Pentax prime lenses but find the new WR 18-55 zoom a very capable kit lens, sharp, quick focusing, and with the weather sealing a nice addition to my kit. Videos are very good although I don.t use the feature often. My only very slight complaint is the lack of continuous focus in video mode. Although, with Pentax lenses with quick shift focus this if not too much of an issue. All-in-all I am very happy with this camera and would recommend it to friends and family without reservation.", "Date": "December 4, 2011"}, {"Title": "One word AWESOME!", "Author": "joyarddog", "ReviewID": "R1X2SCT1ZAMV0F", "Overall": "5.0", "Content": "There is not enough words or stars to describe this camera.  I've used both the k10/ 20d cameras and the k5 shines sweet!  The kit lens alone could be in a category all it's own.  The camera with the kit lens focuses quick and the quality of the photos is superb!  I'm a big guy with huge basketball hands and the camera fits nicely in my hands, which was a concern when I was thinking of purchasing this camera and I must say I'm not disappointed!  The 7fps is awesome, I love taking pics of my 4yr old playing tennis and with the increased fps the camera has already paid for its self!  The down side is you will need to get plenty of memory cards because if your like me you will be holding down the shutter button often because it's so much fun!  I absolutely love taking pics with this camera!  If you are looking for an awesome camera to take around with you without worrying about getting it wet and taking superb pictures then look no further!  HIGHLY RECOMMEND!", "Date": "November 13, 2011"}, {"Title": "Pentax K-5 What \"Pros\" don't know", "Author": "John Berglund \"Burley, Teach\"", "ReviewID": "R2FM3W7WX46QL6", "Overall": "5.0", "Content": "My first SLR some 50+ years ago was a Pentax and we owe a lot to those cameras today. I've owned or shot with every brand that you can name and I'll take the K-5 over all the others. The N & C brands have more lenses but not necessarily better lenses, I like the Pentax glass. I have a 40 year old (?) 55mm f1.8 mf lens and it's really sharp. The K-5 has good HDR builtin and IR. Rain proof, built like a tank, every lens I put on it is stabilized and Did I mention the built in level or the sensor shift. Try that with other brands. Buy it if you want the best.", "Date": "October 10, 2011"}, {"Title": "Awesome camera!", "Author": "Vinny", "ReviewID": "R3JL0Y9Z91W90J", "Overall": "5.0", "Content": "When you can freeze motion in ambient indoor light (day or night), without a flash (yes - you read that right!), and hardly any noise (except at 12800+ ISO), you are simply left awestruck at the capabilities of this instrument!Add the unique, nifty feature of the TAv mode and most everything you need a button away in a package that is solid and compact, you know, you have a keeper. Shutter, Aperture, EV Compensation and ISO all at your convenient finger tip in a weather sealed wonderfully ergonomic package that feels comfortable in your hand - truly a still photographer's camera.I tried the competition (sony slt55 - too small, nikon d7000/ canon 7d - too large and heavy. Only nikon d5100 came close in handling however it is not weather sealed and nor does it have a mg alloy body). Not to mention the rave reviews on independent sites - dpreview(very high recommendation) and dxo marks(the best aps-c camera there is for image quality, period). If there was one thing I truly wished for, it would be an articulated screen. I don't care much for one button video - if you are going to miss two seconds, I would rather capture 14 stills! In fairness, don't buy it for mainly video shooting.You will definitely need good glass for this camera. I got the reasonable 35mm DA f/2.4 which according to DxO marks is the only lens you probably need for this camera! If you are not used to SLRs, it may be a while before you will snap eye-popping pics as there is a learning curve. If you are, this could well be the last DSLR you may have to buy! Yes, it is that good.", "Date": "July 11, 2011"}, {"Title": "K5 best of breed", "Author": "Amicus Curia \"pinbalwyz\"", "ReviewID": "RKKYTWFAUJGJA", "Overall": "5.0", "Content": "The features, ease of use, quality of build, and results from this camera put it at the top of its class.  It does tend to overheat (warning) with intense use of the LV screen.  This can be avoided by switching to the DSLR viewer.  The battery life is more than adequate.  It works very well with the Metz 58 AF-1 flash.  It has a built in valometer in its firmware.  Firmware updates are easy.  It lacks autofocus in video mode.  With quality glass, this camera can't be beat in the APS-C category.  It has an lcd mounted on top in addition to the LV screen (which is not articulated), a rarity in cameras today.  It also has a genuine prism for the view finder, not a mirror.All in all, this camera body is weatherproofed and very satisfying. It is comfortable for those with large hands (like mine).  This might be the last camera most amateurs would ever need/want.  Too few brick and mortar retail stores carry it, however. Tamaron makes some quality lenses for Pentax that have excellent optics, though aren't weatherproofed.  There are a number of prime lenses that can be used to 'pull focus' while using the video feature.", "Date": "February 24, 2011"}, {"Title": "Get the K-5 IIs instead, but the K-5 is still better than a K-7 or before.", "Author": "E. Ongerth", "ReviewID": "RTBEFWEJC5BX3", "Overall": "4.0", "Content": "If you're considering a K-5, it's an improvement over the previous K-7, K-10, K-20, K100D, etc.  And it's cheaper than the newer K-5 II and K-5 IIs.  But spending the extra for the II, or (especially) the IIs is worth it.  At this point in the product cycle it's not worth limiting yourself with the inferior focusing ability (especially in low light) of the original K-5.  The K-5 II fixes that problem, and the K-5 IIs is even better with the removal of the anti-aliasing filter.  That built-in filter adds a tiny bit of softness to all images, all the time, in exchange for avoiding unnatural jagged lines in cases where you are photographing fabric or other regularly patterned material that may line up almost-but-not-perfectly with the vertical and horizontal lines of pixels in the camera sensor.  For most nature and people photography you just don't need that built-in AA filter so you might as well have sharper images without it.Anyway, there are still good reasons to buy a K-5 now:* If you don't use autofocus anyway* If you need a second camera body for some special purpose or just as your extra side shooter* If you want to black-and-white or infrared modify a very high quality SLR... things like that.  Otherwise it's well worth it to get the more recent version.Most of the excellence of this camera can be left out of reviews written this late, because you might as well read the K-5 II and IIs reviews instead.  But in short, the K-5 has marvelous balance and hand feel; it manages to be significantly more compact and maneuverable than almost all of the Canons and Nikons that it can match in image quality.  Its weight and durability are just right.  The quick dials allow you to set aperture, exposure, and ISO without a menu and without taking your hand off the grip.", "Date": "August 17, 2013"}, {"Title": "Beats most Canon and Nikon in Performance and IQ", "Author": "Vicky Mahodaya", "ReviewID": "R4TXA8HA13RDT", "Overall": "5.0", "Content": "Flagship of Pentax, this camera has almost everything that a photographer would need.Best things about this camera includes:Excellent low light performance6 fps RAWWater Resistant BodySingle mold metal body construction (not some cheap plastic)Feels and looks well built and sturdyAll sort of in camera features: HDR, Exposure bracketing, Timelapse, In camera photo editor.Still small and comfortable to hold.Goes excellent with Tamron, Pentax and Rokinon lenses, no personal exp with Sigma lenses.If you are a amateur or novice this could be your startup  camera given the low price of it.If you are a professional this could make a good addition to your kit due to the above mentioned reasons.Enjoy clicking!", "Date": "July 8, 2013"}, {"Title": "Worth Every Penny!", "Author": "Sean O.", "ReviewID": "R33G4P7B5GMWTE", "Overall": "5.0", "Content": "I did a lot of research before purchasing this DSLR. I was very tempted by the Nikon D7000 but was ultimately swayed by the robust weather-sealing on this model. I have taken my camera out for shoots in very heavy rain with zero issues and it has even taken a couple heart-stopping tumbles down hiking paths and came up with only a minor scratch on the hot shoe. The image quality and dynamic range are amazing for outdoor scenes. I also like that it uses k-mount lenses which can be found for great prices for older manual lenses, so you get a lot of options for lenses on a budget. It also has a built-in intervalometer that I have used many time with great results for time-lapse videos. I would definitely recommend this camera for anyone looking in this price range.", "Date": "August 14, 2012"}, {"Title": "Exceeds the competition by far", "Author": "J. Hix", "ReviewID": "R2WJ3Q8LL7AYHY", "Overall": "5.0", "Content": "You can get the two bigger names and pay a lot more.  Is having those names more important than the excellent results produced by the K5.  Audio is exceptional as is the video.  Can't say enough good things that haven't already been said.  I agree with the best of statements.", "Date": "June 5, 2012"}, {"Title": "Love it, what else can I say...", "Author": "Stephanie", "ReviewID": "R21EQA3NN2ZLY0", "Overall": "5.0", "Content": "I am not writing a long review. So I simply just have to say is, I love this K-5 camera and I am glade I got it. I waited till it went down in price..I will say though, she is fabulous matched with the right lens for low light photography....", "Date": "February 27, 2012"}, {"Title": "great size for a pro package camera", "Author": "G Barnhill \"traveler\"", "ReviewID": "R3D44BJ5O6AZ0U", "Overall": "5.0", "Content": "The Pentax K-5 is slightly more compact than similar Nikon and Canon cameras while offering more options and features. It is a well thought out, digital photography tool.  There is something special about using a high quality camera, the feel in your hand, a solid mechanical sound, the way it comes to your eye.  This camera has all of it.  And hey, you get to use Pentax lenses, the best glass in the world.", "Date": "February 13, 2012"}, {"Title": "High Quality Traditional Enthusiast SLR", "Author": "Ale Man", "ReviewID": "R1PSTMXF2801AQ", "Overall": "5.0", "Content": "Here's what I like about my new K-5:- Big, bright viewfinder shows 100% of the frame and is easy to use in dim light.- The grip is nice and deep, allowing me to carry it around comfortably even with a heavy lens.- Most settings are a knob twist or one or two button presses away - you don't have to go menu diving very much.- Many controls are just under your right thumb so you don't have to take the camera down from your eye to change them.- When you do need the menu, it's very simple and accessible.- The rear screen is so clear it's actually useful in reviewing DOF.- It's built to last like the old K-1000, while actually being lighter than the K10D it's replacing.- Works with all sorts of lenses, screw drive and supersonic.- Fourteen stops of dynamic range.Here's what I don't like:- The mode selector dial has a locking button that's hard for me to get used to.- The autofocus doesn't operate while shooting video.  You must focus before shooting and fine-tune by hand.This SLR camera design was originally built to give the photographer precise control over the camera and the K-5 holds to this tradition.  There is very little automation: no scene modes or guide mode.  The photographer can adjust aperture or shutter speed just by flicking a dial.  A press of the green button re-sets exposure to the program settings.It takes a while to learn everything about this camera, so it's not for beginners.  If you're ready to step up from the entry level DSLR, you can't go wrong with this one.  If you don't believe me, check out dpreview.com to see what the experts say.", "Date": "January 27, 2012"}, {"Title": "Fantastic camera!", "Author": "J. Creitz \"TV Addict\"", "ReviewID": "R1CNWDDGVKUE9O", "Overall": "5.0", "Content": "I had a K10D, from which I upgraded to a K20D, and then to this one.  Wow! The K10-to-K20 upgrade felt pretty incremental, but the K20-to-K5 upgrade is just a gigantic one.The first thing you notice is how much smaller and lighter the K5 is (K7 users already knew this, I suppose).  But the real amazing thing about this camera is that it takes stunningly crisp clear (not grainy) photos even at absurd ISOs (32000 anybody?).The auto white balance is much better than that on the K10 and K20.  On both of those, I usually set the white balance manually because the auto setting was so often wrong.  On the K5 I have yet to need to set the white balance manually, regardless of the lighting conditions (I've shot under flourescent, warm flourescent, incandescent, direct sunlight, shade, and setting sun), all looked perfect.The on screen mid-shot user interface is an improvement.  It's always easy to know what mode you're shooting in, what your settings are, and what controls will alter what.  With use, it wasn't ever that hard to know on the older models either, but the new on-screen UI is pretty idiot proof.But back to where I started - the photos!  They're amazing!  So clear, so sharp, color-perfect, and you can almost shoot in the dark with this thing!  It's amazing.", "Date": "January 18, 2012"}, {"Title": "To hold it is to love it!", "Author": "Jordan Bunch \"Jordan\"", "ReviewID": "R3AK4MPQ3BE2Z", "Overall": "5.0", "Content": "This is the best APS-C camera on the market.  Its built like a tank.  Weather seal is awesome.  Feels amazing in your hands.  Has way more features available in the buttons on the body than most cameras which rocks because you don't have to go through the menu for everything.  Handles high ISO amazingly.  Beautiful images.  Great contrast.  I couldn't be more happy with this camera.  Look no more!", "Date": "March 29, 2012"}, {"Title": "Pentax really got it right", "Author": "JB123", "ReviewID": "R355VERBND9TGT", "Overall": "5.0", "Content": "The first thing that strikes my each time I pick up the K-5 is how solid it feels.  Yet, it is small and lighter weight than all other DSLR's I have owned.  Knowing the body (and some lenses) are weather sealed makes it easy to carry in any weather without giving a second thought to sheltering it from the elements.  This is how a camera should be built.Shooting is fluid and the K-5 is instantly on and ready with either the power switch from fully off or with the shutter button from its power saving sleep state.  Shutter lag is zero to my perception and the camera is clearly faster than me.Having shake reduction built into the body rather than the system's lenses was a great selling point for me.  It means I can put on a twenty year old manual focus Pentax-M lens and it has the same vibration reduction as a brand new lens.  I have mounted the K-5 to a telescope and also made great use of the \"SR\" (shake reduction) feature.Image quality is relative to the quality of the lens you mount on any camera.  Coupled with good lenses the sensor in the K-5 renders colors accurately and the wide dynamic range provides alot of detail to work with in post processing.  I always shoot RAW and find the results consistent and pleasing even straight from the camera.I primarily went to the Pentax system because I liked their small prime DA Limited series lenses.  Coupled with the K-5 the 21mm makes a super small package for easy carrying under arm.  The 18-55mm kit lens is amazing and my normal choice for carrying while hiking.There are more custom menu and in camera editing features than I would prefer.  Some of the Pentax menus are not full intuitive.  I think Nikon still wins in that category.  So in some ways this may be a Mac vs PC kind of comparison.  I guess I am a PC guy.  I prefer making exposure and setup decisions myself and am willing to live with some mild idiosyncrasies of menus and button placement.Battery life has exceeded my expectations and while I carry a spare I have never run out of juice and needed to swap while carrying the K-5.", "Date": "October 30, 2013"}, {"Title": "Recommended for newbies", "Author": "Pete Valentine", "ReviewID": "R2J3MR868W644K", "Overall": "5.0", "Content": "This is the first DSLR that I have owned so I don't really have any experiences with other cameras but the features and settings are easy to access and use. I've had this camera for about 3-4 weeks now and I'm still Learning about the capabilities of this camera.", "Date": "September 23, 2013"}, {"Title": "Better than the big boys", "Author": "NCHammer", "ReviewID": "R3KLW9X9L7IOVE", "Overall": "5.0", "Content": "The K-5 packs a great deal into the price and size. Built around the same Sony sensor as the Nikon D7000, it nearly destroys the Nikon in the following ways:1) smaller (about the size of a Nikon D40 or D3100)2) lighter (less than D90)3) better built (weather proof)4) built-in VR in the body (this makes all your lenses perform much better handheld, priceless)5) auto WB is much more accurate indoors and in artificial lighting (crucial because what good is high ISO if the WB is crap)6) has the ability to retrieve RAW even if you shoot in jpg from the latest internal buffer7) high FPS8) better high ISO performance than D7000 (not sure how Nikon managed to degrade it)Weakness:1) jpg size is rather large at the *** level (6 MB) and no quick shortcut to change file sizes2) movie size is huge per minute recorded3) lens selection is limitedOverall this product is the king of crop sensor bodies (except for the K5II at double the price right now).", "Date": "February 7, 2013"}, {"Title": "My new Pentax K5", "Author": "Dave Shutterbug", "ReviewID": "R3HAAOEXJ829EC", "Overall": "5.0", "Content": "This camera is very light yet sturdy and weatherproof.  Its fast as lightning, accurate auto-focus, very quiet shutter, and tons of advanced features.  I love the feel of it, and so far all my pictures have been sharp and well-metered. Now the price has dropped, its a great value for a semi-pro camera", "Date": "February 11, 2012"}, {"Title": "Great Upgrade", "Author": "StefanL", "ReviewID": "RY3P9DBQKA5CI", "Overall": "5.0", "Content": "If you own one of the previous models (mine was the K-10), you are going to enjoy this camera. It has many great updates to the previous models (better low light ability, bigger rear display) without sacrificing the ease of use of previous models. Be warned though, this camera comes with the biggest operations manual todate; ie. the features built into this model have been dramatically increased over previous models.", "Date": "December 8, 2011"}, {"Title": "Stunning Results", "Author": "S. N. Reddy", "ReviewID": "RU3F0WRNX2UZ", "Overall": "5.0", "Content": "The K5 will serve me for ages.. If you have an old Pentax DSLR, just upgrade to a K5 and don't bother with an upgrade for another 5 years.The detail you can extract from the raw images shot by this camera is mind blowing!", "Date": "November 21, 2011"}, {"Title": "A Good Upgrade for the Pentax Enthusiast", "Author": "Erik J. Malvick \"Erik Malvick\"", "ReviewID": "R19FWQWP5GW92J", "Overall": "5.0", "Content": "This camera was an upgrade for me from the K10d, and I feel like it was a worthy upgrade.  The specifications are out there, but the ones that enticed me to upgrade from the k10d were the+low light handling (high ISO) capabilities+The high dynamic range (better than the 12-bits in the K10d+The improved focal handling+The continued support for older K-Mount lenses.There are other positives including the ability to customize buttons and the sequences they go through when selected and custom user functions, but they weren't the strong factors.I've had the camera for about 6 months now, and I love it.  It works extremely well and doesn't change much from the K10d.  I've adjusted to many of the differences and feel that if you are considering the K5 as an upgrade from a previous Pentax dSLR, you won't be sorry.  The upgrade will probably be most worthwhile for those coming from the K20d and lower.  The High-Iso performance is fairly impressive.  I feel very confident taking photos up to ISO 6400 with this camera although I prefer sticking at 1600 and below.The 16MP images make it easy to pixel-peep and be too critical of your images.  These large resolution images always appear worse on your monitor at 100% and should not be criticized too much for noise and sharpness at these levels.  I've found that my images come out extremely sharp once printed and looked at in a more \"normal\" sized setting than if you zoom in and look at it at a 100% (pixel for pixel) size.  My initial feeling was my photos were lacking, but once I had a few 4 x 6 to 8 x 10 prints made (not sure on larger), I was blown away.  The resolution also changes how one should approach editing with respect to sharpness and noise, but that is a discussion left for photoshop forums and enthusiasts.The Pentax brand dSLR's are worthwhile for those who may already own Pentax cameras (as I did) including film cameras.  All the K mount and even older lenses can be used with the K5.  I love it.  I actually started with my previous K10d because as a student it was nice to be able to pick up used lenses, including older 1970's vintage lenses, at an affordable price.  You don't necessarily get all the nice automatic features, but the lenses have great quality, and I learned more about photography with those older lenses than I ever did before.  The on-body anti-shake makes all your lenses anti-shake, and the weather sealing gives me confident that being out on a wet or drizzly day isn't going to ruin the camera.  Just remember that full weather sealing (not water-proofing) requires a weather sealed lens to be 100%.  I only have one or two lenses that meet that standard, but I still feel confident that moisture isn't going to seep through buttons, the SD card slot, or battery.My only complaints about this camera are more nit-picking than anything.  The battery is to be complained about because it would have been nice to have kept the size compatible across the Pentax dSLR models.  I suppose there is a good electronic reason for not doing that, but it would have been nice to keep taking advantage of my K10d batteries, even if it meant less photos on a full charge (due to a likely lower voltage).The mode selection dial seems awkward as I used to quickly roll through modes (aperture priority to full manual) quite easily but a button must now be engaged to change modes.  I think the purpose was to keep people from accidentally changing modes, but I'm not a huge fan.  The camera is a bit smaller than my K10d, and I am a bit big handed.  This isn't a huge problem, but I do feel things are a bit awkward.Last, I feel that the access compartments for the battery and SD cards are a little lower in quality than the K10d.  I don't that is a \"real\" problem, but just something that feels different on this camera.Pentax does have good customer support, and it is worth looking at the \"PentaxForums\" website if you are seriously considering this camera without much knowledge of the Pentax brand and this model.  Early runs of the K5 had problems that Pentax replaced very nicely for its users.The K5 is a good camera from a good company.  It may not match up to Nikon or Canon but it does perhaps provide the most value for your money.UPDATE:  I also want to add that one other \"flaw\" comes in the PK2 mount and its interaction with older attachments.  With my K10d, I was able to attach items, such as manual extension tubes, that didn't have full contacts and the camera could still adjust the aperture lever as it should (not talking A-Mode here but selecting the aperture on the lens itself).  On the K5, that is not possible unless all 7 pins on the body are in contact with the attached lens setup.  This causes issues with extension tubes that have no contacts or even a bellows type setup.  It isn't the end of the world, mind you.  The work around is to short the pins on the body via aluminum foil or removing anodized paint off of the objects making contact.  Once this is done, the camera works just as the older cameras do.  The camera really isn't meant for such manual devices, but when you are a hobbyist like me, I'm not going out to buy the top of the line of everything.  The old manual lenses and extension tubes are fantastic.  This development doesn't lower my rating as it is such a minor issue that few people will come upon.", "Date": "October 7, 2011"}, {"Title": "Way better than K20D", "Author": "sunnydavid", "ReviewID": "R5BOG28SO9UXM", "Overall": "5.0", "Content": "I have both K20D and K5. K5 is way better than 20D in all auto focus and high ISO performance.", "Date": "August 15, 2011"}, {"Title": "Amazing dSLR for a fraction of the cost you'd expect!", "Author": "Cynthia Farr-weinfeld \"Cynthia\"", "ReviewID": "R1UH4A2BLQ80O3", "Overall": "5.0", "Content": "Pros: I waited through the Pentax K-7 for the K-5 because I felt the K-7 was too similar to my K20D.  Well, it was worth the two year wait for me--I love the K-5 in virtually every way.  The AF is SO much better than either the K20 or the K7, it's unbelievable.  It of course, like most other cameras, does a little hunting in VERY low lighting conditions, but that is to be expected.  The high ISO ability is incredible to me, after shooting with the K20D, which wasn't anywhere close to the noise quality of the K-5.  In fact, with the K-5, I can do ultra long exposures and capture star trails now, with such low noise that I almost don't need to de-noise, and yet it doesn't reduce the quality of the image.  In trying star trails with both the K10 and K20, what I received for an output image after a 30 minute to an hour exposure was a picture FILLED with mostly noise of the most foul, ugly, wormy-looking type--impossible to de-noise at all.  The K-5 does star trails and ultra long exposures effortlessly.I am also amazed by the wonderful resolution of the K-5's sensor--it provides razor sharp images, beautiful saturation and a lovely rendering of anything I photograph.I love the new system of having only enough items on each menu in-camera that fit on one \"page\" of the screen, allowing one not to have to endlessly scroll through up to 20 items before finding what one is looking for--way to go, Pentax!Video capability is GREAT!  I am very impressed with the quality, and despite the fact that it only has a mono sound unless you attach a stereo microphone, which is very easy to do, it has very good sound and rendering.  The videos are beautiful.  The one thing you have to be careful of is the setting you record on--I made the mistake of recording in vivid mode, and it is basically like taking a jpeg in whatever color mode you are shooting in: you are stuck with whatever color mode you film in.  Don't make this mistake--I had brilliantly emerald green trees, and unrealistically blue ocean water--my bad here, truly.  From then on, I have filmed in landscape mode outdoors, and whatever mode is indicated for interior filming. . .  I have also handheld many times while filming, which many magazines indicate one should never do because one will experience blurring.  In daylight, I have had no trouble with blurring and even in lower light (not nighttime certainly).Cons:  I am not a big fan of the new dynamic range feature that is within one of the menus.  It seems to slow the camera down and it looks a bit more like an HDR image when all is said and done.  Although I have been told that some people just use one or two points of high dynamic range adjustment, instead of all, as I tried, so I may go back and experiment.  There is nothing wrong with this feature, but for some reason, just not my favorite of all the new features.Final thoughts:  Thinking about the price of the K-5 as compared with other cameras of its kind and what it can do/provide for a photographer, I am amazed by the amount of quality, weather-sealing, lightness of the body, ease of use in camera and in the menus.  I think Pentax did a fabulous job designing and marketing the Pentax K-5!", "Date": "July 17, 2011"}, {"Title": "Glad I bought one before you couldn't", "Author": "wimmer \"photographer & website designer\"", "ReviewID": "R2XDOO0MUVXESN", "Overall": "5.0", "Content": "I upgraded my Pentax body from K20D to K5. What an improvement from the K20D design and performance. I did my research on Amazon, DxOMark, DPReviews and this piece of fine craftsmanship has more bang for your buck than any other camera I've seen.For those looking to buy an entry or mid-level DSLR, you simply cannot get this performance with Canon or Nikon without spending twice as much. The K-5 body makes the other brand cameras feel like they're made by Fisher Price. No offense FP. Fantastic performance in low light ISO!!!", "Date": "December 6, 2012"}, {"Title": "PENTAX finally did it right ^_^ K-5 is WOW...(drooling)", "Author": "TOKUSHI \"TOKUSHI\"", "ReviewID": "RZMG5F6UTEEDU", "Overall": "5.0", "Content": "I started with K10D,K20D,K-7 then K-5.K10D is really good at LOW ISO and COLOR is great but bad HIGH ISO, bad AWB and SLOW FOCUSK20D is really good at resolution and texture but focus is still oofK-7 better body design and menus but worse high iso than K20DK-5 put all the good things together and fixed the bad.SLOW Focus, Inaccurate AWB/Metering, and BAD HIGH ISO NOISE are the things in the past.Now with K-5, you can take pictures without worrying those things. It is such a big relief to know that I can take high contrast shots without worrying about exposures.Now, I can concentrate on framing with a peace of mind.Good Job Pentax. I always knew you had the potential to make such a wonderful tool. For that, I will give you my loyalty.", "Date": "September 27, 2011"}, {"Title": "Best camera Ive ever owned", "Author": "JasonBB", "ReviewID": "RAP8FFU1VXVMI", "Overall": "5.0", "Content": "Best camera I've ever owned.  Not too long after purchasing, I caught the full-frame bug and moved to Canon 5dmkII.  NOT a better camera.  L series lenses not better than DA* or Limited glass.  Best image quality you'll get for under $2,000.  Best ergonomics, period.  Best weather resistant camera, period.  Lowest overall system cost, period.  Cons:  AF system needs some improvement.  Sourcing lenses, peripherals in person is nearly impossible unless you live in NY, LA or Chicago.  If you're worried about impressing people by the name brand of your gear, this isn't for you either.A last thought to ponder:  Pentax is the manufacturer of the bestselling SLR of ALL TIME, The K-1000.  For good reason--simple design, reliable and inexpensive.", "Date": "February 3, 2014"}, {"Title": "Get One!", "Author": "Jordan", "ReviewID": "R1WJ5H22UTLO65", "Overall": "5.0", "Content": "This camera is the best pro-sumer camera out there. It is full of features that are relatively easy to use. It takes stunning low light photos.", "Date": "October 23, 2013"}, {"Title": "Highly recommended!", "Author": "Jon Taylor", "ReviewID": "R1IDRAIC05JEF8", "Overall": "5.0", "Content": "Love it. I did my homework studying reviews. I'm on a very tight budget and wanted the best I could get for the money. This Pentax does even more than I anticipated. Quality of photos is very good. I'd highly recommend this camera.", "Date": "October 7, 2013"}, {"Title": "Great camera!", "Author": "G. Vaughn", "ReviewID": "R20JXF0Y1BJJO6", "Overall": "5.0", "Content": "As a former Pentax user, this has kept my work going seamlessly! It has been six years since I upgraded and this was a wonderful leap and easy to transition.", "Date": "October 2, 2013"}, {"Title": "Great camera to continue using a great lens collection", "Author": "Luigi", "ReviewID": "R2L34VSKV94TKJ", "Overall": "5.0", "Content": "Whether you’re a pro who lives from photography with a Canon or Nikon system or an enthusiast photographer, this camera won’t let you down on color and image quality for an APS-C size sensor,  if you already own a collection of good lenses for pentax cameras, taking in consideration the current price  of $642 as of September  2013, it's a steal, almost the cost of the Pentax 15mm F4 limited. I've wished the K-5 IIs with a full frame sensor, so we can take advantage of the real focal length of the full frame lenses. Other than that, you will enjoy this camera ergonomics and functions as well.", "Date": "September 24, 2013"}, {"Title": "Solid Camera", "Author": "Wayne S.", "ReviewID": "R24DEHNT0BS6GU", "Overall": "5.0", "Content": "I wanted to try out a D SLR camera did some research and liked the fact that this camera has some weather resistance and where i am at that is plus. I only messed with the camera a few times now ( just got it) and I love it still messing around with all the features that I can do and still finding new ones. The kit lens may not be the best but for starting out it is great. Good to learn on and pratice till you find what you really want to use the camera for.", "Date": "September 18, 2013"}, {"Title": "SO WONDERFUL SO POWERFUL", "Author": "Oscar Cespedes R \"ocero14\"", "ReviewID": "R2AV03FD5INAYF", "Overall": "5.0", "Content": "I started in photography 1 year ago with a Sony Alpha a57 and I thought that it was a very good product because it has good characterist to take good pictures and also has other extra features like 12 fps, HD Video, Panoramic, 3D photos, etc.Then... I found Pentax and I love it since the first time I hold it on my hand. You will loose the extra features I mentioned but will have and incredible quality upgrade of the picture you will take. Also it has some bottons that make you to adjust things like, light measure, etc. (in Sony for example, you should access the menu and it takes time)", "Date": "September 12, 2013"}, {"Title": "This camera is amazing", "Author": "Geraine D. Blackford", "ReviewID": "R1X9P568VAS4BK", "Overall": "5.0", "Content": "This is my 3rd Pentax DSLR, I started out on a Pentax k1000 in 1973, boy has technology changed.  This camera takes amazing images and the burst mode takes awesome stop action shots if you have your shutter speed set to 250 or higher.  I would definitely recommend this to someone upgrading from an older DSLR or as a first time camera.  The wonderful thing about Pentax is that the image stabilization is built into the body, as apposed to the lens, as it is in many other brands.  Therefore, any Pentax lens you put on this body will have image stabilization.  It will use any K mount lens.", "Date": "July 29, 2013"}, {"Title": "It's a beast", "Author": "keidi", "ReviewID": "R1CT6RL9G924KM", "Overall": "5.0", "Content": "K-5 is rugged, weatherproof on one hand and highly  technologically sophisticated machine on the other.  All functions are very ergonomically designed. User interface is just a dream.  Make sure you don't skimp on high quality lenses so  this beast  will show it's claws.  I own whole spectrum of prime Rokinons with K-mount ( amazing value for top notch glass)  and IQ is breathtaking. I do not believe APS-C sensor based  camera can be even more improved. I think Pentax K-5 hit the ceiling in that department - 16.3 mpix is  a  \"sweet spot\"  for pixel count/density and onboard  signal-processing chip K-5 has gets100% out of the Sony sensor ( which is stellar by the way, too).", "Date": "July 26, 2013"}, {"Title": "Great Product but never buy from Beach Camera", "Author": "Charles in Montreal", "ReviewID": "R3FB36850731SE", "Overall": "5.0", "Content": "The K-5 is super-solid, weatherproof, quality that takes great pictures.  Also works with older Pentax lenses which is very cool.  Very satisfied overall.  The only thing is NEVER order from Beach Camera.  They showed the waterproof lens on Amazon but shipped a cheaper version.  Trying to get them to correct the problem was a nightmare.  Had to wait forever to speak to someone and then they were insulting, rude and downright dishonest.  Buy the camera, you won't be disappointed but never buy from Beach.", "Date": "July 25, 2013"}, {"Title": "I've owned Pentax film cameras in the past.", "Author": "jim stenson", "ReviewID": "R29XW1XQA1NOTW", "Overall": "5.0", "Content": "First DSLR from sunset electronics.  Very pleased with sunset and very pleased with the professional quality of this camera.  Now I have purchased a tamron 2.8 70-200mm zoom lens w/ macro.  And again this has been working quite nicely with this camera.  Make sure you read about the auto focus with this lens though.  The camera itself has a lot of features that novice/professional photographers will love.  I bought it specifically for the photography part of it and it has not failed to delight.  I have not as of yet used it for the movie part, not sure if I am too concerned about that after all there are a lot of cheap video cameras.  It seems this is one point where this camera lacks in especially when it comes to downloading large file sizes.  Overall an excellent camera.", "Date": "June 5, 2013"}, {"Title": "Get This Camera!", "Author": "C. Johnson \"C. Johnson\"", "ReviewID": "RXQJPL94JR614", "Overall": "5.0", "Content": "Beautiful photos! Lots of options!Love the TAv button!Intuitively designed to change settings easily and logically.Ruggedly built, solid, weathered sealed!  Took photos on a snowy day and it performed easily in cold weather!Lenses for this camera have a nice feel, are beautiful, anything but flimsy.Performs well in low light!I have not been disappointed!You would pay nearly twice the amount for a dslr of this caliber!", "Date": "April 5, 2013"}, {"Title": "Pentax K(ing)-5", "Author": "Ankit", "ReviewID": "R2QXD8U6R5GHAZ", "Overall": "5.0", "Content": "I have always wondered why Pentax isn't considered as seriously as it deserves. Most of my peers don't even know about the brand! Yes, they have a zero market visibility in India, and that's another thing I wonder about :PMy father being a photographer, I am glad I was exposed to Pentax from an early age. Very glad!K-5 is one classic camera that brought to people's notice yet again that Pentax is not a bridesmaid to other brands, it can produce quality cameras like no other. I have been using this camera for a year now and my love for it only grows stronger by the day!I am one happy man! :D", "Date": "March 21, 2013"}, {"Title": "Why I can't give it a 5 star review", "Author": "John A. Byrne", "ReviewID": "R4H9JY6BMNYTL", "Overall": "4.0", "Content": "I love everything about this camera and, having switched from Olympus, find the low-light capabilities to be extraordinarily. The real technical details may be found in other reviews and consider using [...] to see how it compares to other DSLR choices.BUT...and this is a very big but, there is a problem with the mirror locking up that is pervasive and Pentax refuses to acknowledge and remedy this fatal flaw either with firmware or fix/replacement options. You will be right in the middle of a shoot and the camera locks up, forcing you to pull the battery, replace it and sometimes, give it a little hit on the side. Search the web and you will see the magnitude of this concern. I even bought a battery grip, hoping it would fix the problem but to no avail. It seems most frequent in the Tv mode but can occur in any mode of shooting, including manual.So if you are shooting a wedding or happen on the Loch Ness monster you may be be very frustrated. Even during casual shooting, this is a major pain for a flagship camera.So caveat emptor and save all your receipts and warranty cards. Mine started doing this about 14 months after I bought it through Amazon and I thought it was a fluke until I read up on the problem, now widely reported on the net.This issue aside, it is a great camera and for the current price (about half of what I paid shortly after release) it is a lot of bang for the buck. I would just get the body and consider the Pentax 16-45mm and the 55-300 WR lenses for starters. I've added several in addition to these but find I use these lenses most with the 16-45 clearly a cut above the very decent 18-55 kit lens. You can get very good lenses at reasonable prices. I scored a 50mm 1.7f manual lens on Ebay for $55 and it is the sharpest lens in my kit.And besides...it is pretty cool to not have what everyone else has dangling from your neck and produce images that often blow Canon and Nikon shots out of the water. Just try the in-camera HDR function when you are out with some friends on a shoot and listen to the ooohs, ahhhs and \"what are your settings?\" Heh, heh, heh.", "Date": "February 10, 2013"}, {"Title": "Camera that will blow your mind", "Author": "S. Gadhiarju", "ReviewID": "R16RGQ50HUBH6J", "Overall": "5.0", "Content": "I bought this camera after reading a lot of reviews. The brand it self is reputed for its awesome products but will little or no advertising. I'm very pleased with the performance of the camera.", "Date": "December 15, 2012"}, {"Title": "I Love K5!", "Author": "Flyer", "ReviewID": "R2GGT4KVCIVWI0", "Overall": "5.0", "Content": "It has been nearly four months since I bought K5. I find K5 have fantastic IQ and performs great at high ISO. I mainly use K5 for my little son, where the lights are really dark but K5 has very good IQ and little noise at high ISO!! I have no issues with the mirror and oil spot sensor. I hope the mirror problem won't happen!!!As others said, K5 is the best APS-C camera by now!", "Date": "July 24, 2012"}, {"Title": "Excellent Camera.  All-around a great deal!", "Author": "KinoChelovek", "ReviewID": "RLXVBHCF5WPU2", "Overall": "5.0", "Content": "I don't have much to add to the other great reviews. I've always been a Pentax fan (my first was a KX 35mm, and I loved it).  I love this camera and the vast amount of functions it has.  It's a great buy!  I also bought a zoom lens for it.  It takes remarkable photos!  A+++++!", "Date": "January 17, 2012"}, {"Title": "Good Camera", "Author": "Richard K. Kishore", "ReviewID": "R29D8OEX54GEW5", "Overall": "5.0", "Content": "Quiet operation.  Built good.  Much smaller than I had expected.  About the size of a Canon Rebel.  Also doesn't weight as much as cameras with similar sensor. Works well.  Very affordable compared to it's competition.", "Date": "November 7, 2011"}, {"Title": "Love it but a small problem to be aware of", "Author": "K. Greene", "ReviewID": "R3P30080Q5FUJS", "Overall": "5.0", "Content": "I absolutely love this camera. I had the K10D and loved that too, but this is a much finer piece of craftsmanship. I won't bother reviewing the details of the camera because others have done it much better.There is just one thing to be aware of.. the LCD screen seems to have a poor seal and lets in dust and/or sand. I returned my first body due to this problem and they gave me a new one, but it seems this body also has that problem. I have been careful and always have it around my neck, don't leave it on the ground or anything like that. I thought that maybe the first time it was because I was at some sand dunes, however I have not been to one with the new camera. I do live in New Mexico which is more dusty than most places so that may explain it.I put a piece of static plastic over it to see if that helps keep out the dust. It's still usable of course but the sand does make it a bit hard to see the screen in the sun.I hope you don't have this problem too but I'd be curious if anyone does. I am still giving it 5 stars because it deserves it. It's so much nicer to me than a big old fancy Canon.", "Date": "October 26, 2011"}, {"Title": "Very Good Shipment and Item", "Author": "Ana", "ReviewID": "R2T0PUJ3WKCX9Z", "Overall": "5.0", "Content": "I am very happy with this camera, as a photographer i already have nikon and canon but pentax K5 is just one of the best camera that has image stabilization it self and HDR, this has big sensor that gives me a outstanding Dept of field. I will suggest to you all especially for those who wants to buy a camera, Pentax K5 will not let you down.", "Date": "September 1, 2012"}, {"Title": "Wow- Great camera", "Author": "D. Bishop", "ReviewID": "R34G08PZZP45XJ", "Overall": "5.0", "Content": "I recently purchased the K-5 to replace my K-10. I won't repeat what other reviewers say about this camera except that it is a great DSLR.  I do a lot of macrophotography of insects and now I am not afraid to use the TAV setting. On my K-10 I tried not to shoot much above 400 ISO.  Now I can set my F-stop and speed, allowing the camera to adjust the ISO to fit the settings, even going up to 3200 ISO.  The noise is minimal and the pictures are certainly usable at that ISO.  I also like the new menu layout, I find it much easier to navigate than the scrolling menu of the K-10. The menu is a little different though, and some of the button settings are a little different, but I am getting used to them.I have tried the video a little and wish there was a dedicated button for it instead of the dial. The pictures are good though- mostly of insects on flowers. I find focusing a little hard in sun light when looking at the screen.I highly recommend this camera, especially if you have a K-10, K-20, or similar model.  An excellent upgrade and camera.", "Date": "September 6, 2011"}, {"Title": "GREAT CAMERA", "Author": "mars198 \"photomars\"", "ReviewID": "R34NJ9ZBR6IMXH", "Overall": "5.0", "Content": "If the old saying \"you get what you pay for,\" is true then the Pentax K5 is worth every penny.  It is not an inexpensive camera.  It is an excellent camera with the highest resolution in it's class.  It also takes excellent hd video.What blows me away is the high iso quality.  Usable pictures through iso 6400.  You can take quality pictures that you never could before.  I really can't say enough about how good this camera is at higher iso settings.  It is amazing.I debated between the K5, the nikon d7000, and several other cameras.  I have owned quite a few dslr's in the past few years.  The K5 is the best at taking quality pictures.The video does not have autofocus.  Which to a photographer is not an issue.  Don't buy a dslr to take video.  You should buy a dedicated video camera for that.  That being said it is nice to take some short videos when needed.  The K5 has awesome video quality.  I previously used the Sony a55.  It took good pictures and great video - because of it's autofocus ability.  I sold the a55 because the photos lacked the depth I needed.I bought a dslr to take photographs.  The K5 is the best non full frame dslr on the market.  If you are serious about photography and are willing to make the investment, the Pentax K5 is a great choice.  This is a pro grade camera with pro quality image quality.  You would have to pay more than double the cost to get a full frame camera that beats it (not counting the lenses).", "Date": "June 17, 2011"}, {"Title": "Wonderful camera!", "Author": "Eileen", "ReviewID": "R2YK7F24F9ES9J", "Overall": "5.0", "Content": "I purchased a Pentax K-5 for Christmas and it is all and more the reviews said it is. It is a replacement for my 35 mm Pentax for which I have many lenses and accessories. It takes wonderful low light, natural light and group pictures. The detail is amazing. On automatic it has been no challenge to operate. I will be working with this great camera and my non-digital Pentax lenses and expect to get the same great results.Pentax K-5 16.3 MP Digital SLR with 18-55mm Lens and 3-Inch LCD (Black)This camera is well worth the money and will give me any years of retirement enjoyment.", "Date": "January 12, 2011"}, {"Title": "Pentax at its best!", "Author": "Stilettodude", "ReviewID": "R3H3IYNLN5XBG6", "Overall": "5.0", "Content": "Man, am I ever happy with this purchase!  My K10D was smacked to the floor by a careless person at an event in Canada and it was rendered useless (but repairable).  I ordered the K5 body the same day, and when I got home to Ohio, there it was.  Impeccable service as expected.", "Date": "July 31, 2012"}, {"Title": "The switch from film to digital", "Author": "Jay", "ReviewID": "RV94ORLLXKV42", "Overall": "4.0", "Content": "Just purchased the Pentax K5 body to replace my Pentax SF10.I am able to use all of my lenses from the SF10 and theauto focus works.  Camera is easy to use.  I like the greenmode feature.  In manual mode everything I learned with theSF10 still holds true with the K5.  If you like Pentax youwill love the Pentax K5.", "Date": "July 20, 2011"}, {"Title": "A Solid Classic with Even-Handed Performance", "Author": "Kentucky Colonel", "ReviewID": "R3FBRQ837CEFJW", "Overall": "5.0", "Content": "14-bit color depth? Check.  Weather sealing? Check.  Cast metal body? Check.  Long-life Li-Ion battery?  Check.  Compact size? Check.  Huge lens selection - only if you're willing to use film era lenses - but they all still fit.Pentax has all the \"common\" focal lengths available, and some are stunning performers, but third party lens makers are focusing more on Nikon and Canon mounts - and OEM lens selections are much broader (and more expensive) with the Big Two.  Even Sony (who makes the sensor for this) has better third-party lens support - and an articulated LED screen.  But after I dropped my first Pentax dSLR with a 400mm telephoto mounted - and the thing still worked even though I had ripped the lens mount from the body (had to screw it back on) - well, that counts for more useful field live than anything else available.", "Date": "April 28, 2014"}, {"Title": "pentax k5", "Author": "michele nelson", "ReviewID": "R3CAFKZ3POS4ES", "Overall": "4.0", "Content": "great camera only thing I would change is having to start at beginning each time you look a pictures otherwise wonderful price of equipment", "Date": "April 12, 2014"}, {"Title": "Great camera", "Author": "Steven Niewoehner", "ReviewID": "R26WFVPX4OOPCM", "Overall": "5.0", "Content": "This is a great camera very user friendly and location of controls makes perfect sense. very similar to the K-7 but with more functions nice improvements. takes great pictures and has plenty of functions for creativity .", "Date": "March 13, 2014"}, {"Title": "Amazing purchase!", "Author": "On faith", "ReviewID": "R2NQ8DXWR7T8VG", "Overall": "5.0", "Content": "The camera itself, I don't have to tell you is amazing.  The K-5 is exactly what I needed!  This was new with all things in tact, hard to find and super quick shipping.  Top notch!  So happy!  Thanks!", "Date": "March 7, 2014"}, {"Title": "Very Happy to find at this price", "Author": "Craig-o", "ReviewID": "R2874Z4M729SOZ", "Overall": "5.0", "Content": "Been a Pentax user since my high school days, so I had done my homework before buying this camera to replace my K-20D Pentax.What's not to like? Great  pricing, good lenses at reasonable price-point, excellent image quality, weather sealing is better than most and I can use all of my old K-mount lenses on this body.", "Date": "January 31, 2014"}, {"Title": "Just Ordered My K-5", "Author": "Justin", "ReviewID": "R2GZEPE5ABMRHE", "Overall": "5.0", "Content": "I ordered this camera only a few days ago. I am so excited to start playing with my first Pentax. I previously owned a Canon Digital Rebel and then bought the Canon 60D. I decided to switch systems after seeing the cost of moving to weather sealed lenses and camera bodies in the Canon and Nikon systems. Canon and Nikon do not cater to the crop sensor systems. In-fact, it seems they are pushing you to their full frame systems constantly with lens selection/performance. I was expecting my system to take me years to build and afford until I learned of Pentax.I had heard of Pentax before, but largely ignored them (Cannon Snob). After looking for weather sealed and affordable systems, I came across a few publications about Pentax. I fell in love. I was wowed by the lens selection and price/value of the system. I could easily own a full system of lenses without breaking the bank. I stopped by my local camera shop to test this beauty out and decided I had to have one. I sold my Canon gear within a week and ordered this beauty.I know the K-5II and K-5IIs are available now, but I decided to save a little money and purchase the K-5. It didn't seem there was much of a upgrade from the K-5 to the K-5II, however the K-5IIs does seem to produce very sharp images with the AA filter gone. Still, the K-5IIs was not a camera for me, so really my comparison was between the K-5 and K-5II. Again, the price to performance largely convinced me to buy the K-5. Not enough features / upgrades to justify the additional cash.I will update this review after I have had some time to play with the camera and my new lenses. I suspect after reading all the positive reviews that I will greatly enjoy this camera.UPDATE+++++++I had to buy the K-5 II. Amazon would not fulfill my order for the K-5 :(  something about issues with other people ordering them. I understand there may have been a bad shipment and several customers received pour copies. Found my K-5 II for 850 new!!! Loving it!!!", "Date": "July 23, 2013"}, {"Title": "A great  upgrade!", "Author": "Randy J. Baumgartner \"RB\"", "ReviewID": "R3OUYSC97QL5U2", "Overall": "5.0", "Content": "My first DSLR was a Pentax Kx which is a great camera, but the K5...wow. This  camera is amazing! If you are looking at Canon or Nikon DSLR's you owe it to yourself to look at this camera before you buy. In my opinion there is no better camera value!", "Date": "April 17, 2013"}, {"Title": "Pentax delivers... AGAIN", "Author": "Bcrary3", "ReviewID": "R234GUPQG1FEDM", "Overall": "5.0", "Content": "I bought this camera on the 10th, and got it today (the 12th) so this review may be a bit premature. In short. I am in love with this camera. I haven't seen the images on my computer yet, but from the on camera display, this thing takes really stunning images. As an upgrade from my Pentax K10D (which is also a fantastic camera) this camera truly is the best DSLR I have ever used, many of my friends own Canon and Nikon's, and they spend literally thousands of dollars on a single camera body, but so far, they do not even compare. I really like the high ISO range, and very low noise, on my K10d I am afraid to go above 400, with the K5 I have been shooting at 3200+ and still getting crisp, clear images. But much like any camera, this one has it's pros and cons. A few things I really like about this, is the fast (or what is fast compared to other cameras I have used) auto focus system, it's fast, but slow compared to Canon or Nikon, but as a bonus with Pentax's AF system, is that the trade off of ultra high speed is ultra accuracy. However one thing I am finding really hard to get use to is the ever so slightly smaller size. This may not be a problem for everyone, but I am use to being able to fit all four of my fingers on the camera body, and having one hang off the K5 to me is just uncomfortable, this can also be corrected by using the battery grip for it. I also really like some of the features they have packed into this little guy, such as the built in level, which I think is very useful if you are shooting from a tripod on uneven ground, and you are unable to perfectly level your tripod. Another thing I am finding odd to adjust to is button placement. While convenient, it's just simply different to what I have been using for the past four years. Over all though, this is an amazing camera, with stunning image capture, that is true to life, this thing is built like a tank (much like all other Pentax cameras) it isn't too heavy, if anything compared to what I am use to it is a bit too light, but that will just take some adjustment. This is a really, really great camera if you are just a beginner, or if you are a pro, it's not only inexpensive, but the quality is all there. Compared to Nikon or Canon, the price to product ratio is much higher, and frankly I am not too impressed with Nikon, Canon, or really any other camera maker out there. If only Pentax made a full frame format camera (other than the 640d) In other words, if you are looking for a new DSLR, buy this, you will not be disappointed. I only highlighted a new nice things about this camera, order it, and you too will find out all the amazing features this camera holds!", "Date": "February 12, 2013"}, {"Title": "This thing is great.", "Author": "Harry Cantrell", "ReviewID": "RSZX453E5P16P", "Overall": "5.0", "Content": "I have another Pentax camera and this K-5 beats the other one hands down. Pictures are great camera is easy to use even for someone like me who is just learning how to do photography. This camera lets me do the work that I really want to do. For me this is a great product.", "Date": "February 7, 2013"}, {"Title": "Huge upgrade!", "Author": "Nikkie", "ReviewID": "R6IOA8ZLVRU6P", "Overall": "5.0", "Content": "I upgraded from a K-X and boy this is a HUGE upgrade! I never use my k-x anymore and love everything I can tweak with this camera. The only thing I am not too fond of would be the auto-focusing system. It really doesn't focus all that well in lower light. For this reason.. if you are upgrading or just thinking about purchasing into the Pentax system.. go for the K-5 II. I heard they fixed the auto-focusing system and would LOVE to have that fix. If you are just thinking about Pentax.. DO IT. It is a great system and lenses are so much cheaper. I find myself with plenty of older manual lenses where the quality is amazing! I have personally bought 6 manual primes for under $100. They are some of my go-to lenses even though they are manual focus lenses.", "Date": "January 23, 2013"}, {"Title": "Love it!", "Author": "Kim S. Hite", "ReviewID": "R2FS9XF5FE2IBP", "Overall": "5.0", "Content": "I upgraded from my Pentax K100D and Pentax ist DS.  I am very happy with my new camera.  Love it.", "Date": "January 20, 2013"}, {"Title": "Great camera for general use in dirty and wet conditions.", "Author": "Fasterthan I. Look", "ReviewID": "R215ZK75HPMWJA", "Overall": "5.0", "Content": "I bought this camera for the following features: weather/dust seals, quality of sensor for price, interoperability with my old lenses. I was a K1000 shooter for years, and after reading many reviews, decided to give this camera a shot as my main digital. I have used it extensively for shooting car races in heat, dust and rain, usually with a 50-200 zoom. The image stabilization (in the camera, not the lenses!) has meant I could also use my old glass and get decent results. I have also shot from the bow of a sailboat in a small squall, and was pleased that the weather seals did their job (warning, your results may vary! Water resistant is NOT waterproof!).This camera is light, and fairly small compared to it's competitors, but it feels solid. Battery life is good, speed is also good for the price point. Auto focus takes some adjusting to, but it generally competent. The 18-55mm lens that came with it is very useful for general shooting, especially with 18mm being basically a wide angle substitute. Low light capability with this lens is good, and low light with some of my older manual glass is great.There are about one billion settings you can fool around with on this camera if that's your thing, but the \"green\" mode (point and shoot), and a couple of pre-programmed settings hold me pretty well.My only real knock is that Pentax doesn't make enough lenses, and lenses from third party suppliers range from great to really not worth the money. I would like to see a wider range of weather-resistent lenses, but am otherwise very happy.", "Date": "January 2, 2013"}, {"Title": "It's very enjoyable and easy to take photographs with Pentax K5", "Author": "TANSEL ERTAN", "ReviewID": "RNGCBY4LI2D3I", "Overall": "5.0", "Content": "My friend recommended to buy this product instead of Canon or Nikon. The photographs which were taken with K5 are very smooth and clear even though with 18-55 standard Pentax lens. I liked them. K5 is very ergonomic and user friendly. Its software also so easy to use.", "Date": "December 24, 2012"}, {"Title": "Best Pentax DSLR yet!", "Author": "J. Riskin", "ReviewID": "R31MICR3QF5LB9", "Overall": "5.0", "Content": "There is very little I can't say positive about this camera. That says a LOT about a product as I'm usually pretty critical. The low noise levels even at very high ISO's are a huge plus compared to my K10D and *istD. The *istD (besides being the worst named product ever) was probably my second favorite of the three and the K10D was a decent camera and an upgrade in many respects, but its larger body size and mediocre low light capabilities didn't outweigh the increased pixel count and feature set.Back to the K-5, it does everything well. It's blindingly fast. The build quality is excellent. I love being able to shoot in the rain with its weather-proof casing. The image quality with a decent lens is stunning even at higher ISO levels (especially if you shoot RAW).The only minor quibbles I have are once in awhile the selective autofocus mode stops being controlled by the 4 way toggle and you have to deselect it and go back or it thinks you want to use the arrows to be in menu mode. The movie mode isn't quite up to snuff compared to some of the other DSLR's. No autofocus or autoaperture during movie mode. I'd love to see a full frame sensor and the price is a touch high compared to some of its competitors. But, for that price you really do get a lot of camera.If you're looking for a semi-pro DSLR, you can't go wrong here. If you have an existing investment in Pentax lenses, it's also difficult to go wrong.", "Date": "March 20, 2012"}, {"Title": "Pentax k5 rocks", "Author": "sly", "ReviewID": "R6CJMZ0VIC9EM", "Overall": "5.0", "Content": "Bought this DSLR used - like new.  The camera is in new condition with about 2500 actuations, only the box was slightly damaged. I have a k10.  The k5 is a total upgrade.  Fantastic body, smaller than other DSLR's (I also have a Nikon D200), feels great, body image stabilization, great low light shooting due to high ISO capabilities, great image quality.  Shoot with Pentax 50-200, no problems with AF.  Tried it with a Pentax 35mm f2.4.  Fantastic IQ, fast and sharpness.  This is a fantastic camera and a keeper for years to come.", "Date": "May 16, 2011"}, {"Title": ",Great upgrade from my K10", "Author": "Chris W. Mortensen \"cwmort\"", "ReviewID": "R1ODGOS2W6VHFD", "Overall": "5.0", "Content": "The K5 is a great upgrade from my K10. Smaller, lighter, quieter, faster burst, faster autofocus, great results at high ISO, built in HDR, etc. Lots of bang for the buck, and built like a tank", "Date": "June 2, 2013"}, {"Title": "Larrys pentax K-5", "Author": "Larry Bearss", "ReviewID": "R5UWCL9OH4KK", "Overall": "5.0", "Content": "I was very happy with the fast service. There are no complaints, thank you. I will be ordering more as you make it so convenient and have a fantastic selection. L Bearss", "Date": "April 25, 2014"}, {"Title": "Heads up about buying used from amazon:", "Author": "Ben", "ReviewID": "R3MEGS4UQM48VC", "Overall": "1.0", "Content": "I've purchased two used K-5's on Amazon both with descriptions saying the camera was in \"like new\" condition. BOTH cameras were defective. The first one a button didn't work and the second does this violent shake thing when in live view mode (not every time it's turned on but enough to prove it's defective). I have to pay for the return shipping for both of them adding 60$ to a camera I could barely afford in the first place.", "Date": "March 25, 2014"}, {"Title": "Great camera for the money and no serious complaints.", "Author": "RAB", "ReviewID": "RSQKTYPTORTV3", "Overall": "4.0", "Content": "I bought this for the reportedly low noise at high ISO's and have not been disappointed. So far have taken about 17000 pictures with no problems, often at temperatures in the 10-20 degree range at night. It would be great if you could control it from a labtop like the later models.", "Date": "November 30, 2013"}, {"Title": "gooood", "Author": "zhuo en mai", "ReviewID": "R3C6U90SV99UCC", "Overall": "5.0", "Content": "This product is very good, and it is what I like to buy it,  and it is a very good deal!", "Date": "January 26, 2013"}, {"Title": "Low-Light High-ISO All-Star Digital Cameras", "Author": "Tatiana Nicholas", "ReviewID": "RA9TVQMEDUR1E", "Overall": "5.0", "Content": "Pentax K-5 and Nikon D7000 (Tie)16 MegapixelsThe 16MP, $1,500 Pentax K-5 has the best overall image quality of any APS sensor camera, regardless of price, according to DxOMark. But just barely. As far as its DxO test results go, it's in a virtual dead heat with the Nikon D7000. While its ISO range \"only\" reaches 51,200, its signal to noise ratios virtually matches the Canon EOS 1D Mark IV at all speeds, and will deliver acceptable noise at ISO 1600. All this plus Pentax's ruggedized body makes this camera well suited for a wide variety of indoor and outdoor shooting conditions.", "Date": "September 21, 2011"}, {"Title": "K7 - Better than the price indicates", "Author": "Ludek Cerny Mth \"techie\"", "ReviewID": "R37FRQCZKX1F00", "Overall": "5.0", "Content": "While not a perfect camera, it competes and very well with Pro priced models by the big two, at well over 3K costs. Used it with legacy K bayonet mounts as well as high end Pentax and Takumar lenses, great adjustments for lens set, only thing is lacking is a little more speed in continuous shooting mode. Wish the movie mode had automatic variable focus, but that is perhaps the only real downside. Since I really do not use a SLR for movies, it it a very small issue for me, but could be for others.Great low light focusing in automatic mode, do not let the resolution fool you; compared to my Nikon at 18MP, I do not see any difference.", "Date": "January 3, 2011"}, {"Title": "K-5", "Author": "Anthony B. Cook", "ReviewID": "R1FZEOPE9Z34BP", "Overall": "5.0", "Content": "For anyone waiting for Pentax to release a digital version of the LX the K-5 covers the void very well, and then some![...]", "Date": "August 28, 2012"}, {"Title": "Lovin' it!", "Author": "Byron Taylor \"BTSculptor\"", "ReviewID": "RS6CK4F4E3F57", "Overall": "4.0", "Content": "I've been buying Pentax DSLRs practically since they started making them, having been a Pentax ME-Super owner, and enjoying the legacy of attachments and lenses.The K-5 was pretty much a no-brainer upgrade from the K-7. The form factor is the same so there's no getting used to a different feel. I wouldn't mind a few less bells and whistles, and a smaller, lighter frame, but there are always trade-offs.I primarily got this new model for the larger ISO range - I take a lot of photos in a theatre of plays and musicals and lighting is rarely enough to use normal ISOs. I was not disappointed in the images coming from this camera, even at the highest ISO settings, and settings that used to give me badly grainy images on older models come out clear and crisp.I'm only giving 4 stars because it's an incremental upgrade, not a real new model. Like I said, I'd like to see a smaller, lighter body. I don't have to have what seems like a beginner's version of Photoshop inside the camera - let me just take pictures and I'll do the image altering later.", "Date": "May 8, 2012"}, {"Title": "K5 DISSAPPOINTMENT", "Author": "Pentax Buff", "ReviewID": "RH3GJ7VFZXM5D", "Overall": "5.0", "Content": "Pentax K-5 16.3 MP Digital SLR with 3-Inch LCD (Black Body Only)I ENJOYED K5... until today. While I am overseas trying to enjoy shooting experience it stopped being able to release the shutter bottom. I have 18-135mm lens attached and I have not even replace the lens, or anything unusual. It focuses, then it hums and does not release the shutter. It is a useless heavy object in my luggage now. I am very disappointed.March 12, 2012. An update.My camera was taken to the service center and was repaired in only 3 days and was returned to me while I was still in the country!They discovered that it was a battery issue that moves the mirror. They replaced the circuit board, battery and some other elementsrelated to the mirror function, I think. All in All, I was impressed. I also learned that similar thing did happened to a few other people..but it is rare...March 30Someone on the thread reminded me that I should change my rating, and he/she is right.It brought me down hard when the breakdown occurred and was initially told that the without thewarranty, the international warranty would not be effective etc,,,,,,however,once in functioning order, it is an excellent camera and now I must say, the customer service is also excellent.", "Date": "February 18, 2012"}, {"Title": "Great camera, reserved on the price.", "Author": "petecyz55", "ReviewID": "RY2DG1DTZNII4", "Overall": "4.0", "Content": "Great camera but I wish the price was just a little lower. If this was under $1k, I'd be completely satisfied with the purchase. Otherwise, great camera body with a lot of good options. Recommended for one of the sturdiest camera bodies around.", "Date": "November 11, 2011"}, {"Title": "Pentax K-5", "Author": "John Rhodes", "ReviewID": "R20114GVXXIX66", "Overall": "5.0", "Content": "I wish it had a couple of features that the Nikon 7000 has and a few more focus points (the nikon has 39. But compared to my tired, old, PZ-20 this thing is a dream. So, to sum up: If you love pentax, as I do, you will love this camera.", "Date": "March 8, 2011"}, {"Title": "Defective used camera", "Author": "ALEXANDRE G.", "ReviewID": "R37DX34V5CJSGE", "Overall": "3.0", "Content": "Camera it self is great but it came with some defects ands don't reflects the description from K&H.I; don't think K&H; is a serious and reliable seller. I am far way from USA and couldn't replace it . I sent the camera to a shop repair and spent U$180 to have my camera in good shape. I gave 3stars because of the defects.", "Date": "November 19, 2013"}, {"Title": "very disapointed", "Author": "john falzone", "ReviewID": "R1971PF3Z5P8D9", "Overall": "2.0", "Content": "the pentax k5 is a good camera  the one i purchase is a lemon...its past 90 days can i get a exchange....??", "Date": "October 16, 2013"}, {"Title": "Pentax K5 for candid street photography", "Author": "candidstreetphoto", "ReviewID": "R3DU9Y7MR64YP2", "Overall": "5.0", "Content": "I bought K-5 just before my vacation trip to Morocco on these Holidays. This camera is excellent upgrade of my D20K. I do candid photography. Small size, quiet operation and improved sensor make this camera great tool for my shooting style. If you like to know more how I used K-5 in Morocco go to [....]The only slight problem I have that it is somewhat awkward to change memory card and too many control buttons for my taste. You have to have another battery. Battery life is OK but to charge it takes very long time.", "Date": "January 23, 2011"}, {"Title": "tricky, tricky, don't order this one with lens", "Author": "terri", "ReviewID": "R1O9ESNH8E9G3Q", "Overall": "1.0", "Content": "I ordered this camera with lens.However, when package came, I opened the box, there was only the body, no lens.Now I have to return it, and worry about that if seller insisted they originally put the lens in the box, I could not prove that they did not put it in.can somebody help me? or any of you have same experience?", "Date": "July 18, 2013"}, {"Title": "Great camera, but currently too expensive", "Author": "AndreaB", "ReviewID": "R3UR8K1RKEZIZ6", "Overall": "4.0", "Content": "I like this camera and it produces decent images and footage. I had my hands on it for two days. It has great bright 100% viewfinder, the grip is nice. I was using Pentax 7 before and wasn't trilled with its perfomance. This 5 apparently uses Sony's sensor, which is the same like in Sony and Nikon cameras. I gave it 4 stars because for the features, quality and PRICE, the latter in MHO is too high.", "Date": "February 28, 2011"}, {"Title": "The thing is alright . . .", "Author": "Nubi", "ReviewID": "R1XVYBT66VA2A8", "Overall": "3.0", "Content": "K-5 is not a bad camera.  In fact, Pentax has come a long way in catching up with the big two.  I am sure that many of the Pentax users will say that in some aspects they have surpassed that of Nikon and Canon.  What would be most mentioned in this regard is the improved quality of the new sensor.  While I do agree about the improvement and so on, at the end of the day this is an aspect of the camera that Pentax has essentially had no control, as the new sensors were being manufactured by Sony.  Therefore, I feel that this is something that ought to be dealt with separately from the discussion of its true worth, (or lack there of).  But I do agree; the sensor is a good one.  Very good dynamic range, if you are into that sort of thing.  Pictures are very sharp and clear, and JPEG outputs made me wonder very much about what kind AA filter this thing has.  I know that 645D went without it (good choice), and here look as though they almost went exactly opposite.  This is an easy way to please the majority, which translate to sales.  But, aesthetically, I am not that fond of this sensor very much.  Rather, I found K-7's sensor much more tasteful and sensual, especially with FA limiteds, especially for the kind of work I do.AF felt much more decisive, as it seemed to wonder less.  I am in no mood to conduct any types of testing to compare to previous model such as K-7.  It is just that AF is not something I use that frequently.  I do think that when one mounts a FA limited lens with a screw drive, the difference between K-7 and 5 becomes to me even less of a big deal.  To me they are both fast enough, and perhaps one slightly faster than the other.There have been many reports of K-5 AF not performing correctly in various lighting conditions, most notably tungsten of all things.  It has been rumored that the latest version of the firmware had attempted to solve this problem, but at it appears that this has not been resolved.High ISO quality is another one of those things Sony improved on, not Pentax.  Having said that, there is one important aspect of High ISO that not many talk about.  Great high ISO on LCD monitors do not necessarily mean great output in prints.  While noise may well be dramatically reduced, I still don't like how they look printed.  I would rather that I shoot in as low of an ISO as I can, maximizing lighting and using a tripod.  When pics are taken in low ISO (100-400), I really don't see a whole lot of improvement there.  I think that this is to me a very significant factor considering its MSRP.I think that this camera at near $1,600 is too expensive.  By the time of this review, the price has come down to near $1,300 mark.  In hindsight, this was the price range that Pentax should have set in the beginning.  Then, this would have been a sensational buy, even for those who have invested in K-7.  But, Pentax chose to go the other way, and priced themselves just a bit out of the comfort zone of many consumers.  I believe this was an opportunity to lure even more users of other brands.Handling is unchanged from K-7, which was a significant leap from K20D.  If one had not upgraded from K20D, handling alone is a good enough reason to upgrade.  Compared to other brands, what Pentax set them apart is not the arrangement of buttons, but the size of the camera.  It is somewhat smaller than its counterparts, but not significant enough leap to contribute to superior handling.  Some may not even like its small size if one had big set of hands.  For me it is almost too small.  I do think that the viewfinder is very generous, but a bit too dark for my taste.Imaging stabilization is in the camera, not in the lens, allowing nearly all previously issued lenses to be compatible - something that Pentax is known for.  You have got to give them that though.  At least they don't screw their customers in that department like Canon does.  The mechanism itself seems to work ok.Stains - There were stains on the sensors, and something like 60% of them in the early part of production.  Sony really screwed them, or that Pentax screwed themselves when installing them.  It is maybe the latter, because if the sensors were defective, I would sue Sony.  No??  I also do not understand why Nikon sensors which are also made by Sony, do not have stains . . . .So Conclusion:The thing is alright.  I give it a 6.5 out of 10.Very expensive at $1,600.  At $1,300, much more reasonable.K-7 owners who shoot in low ISO - Do not bother.  Not worth it.K20D and earlier model owners - at $1,300 this is a good buy, except that you will now have to deal with the hoopla of the next model, which is probably not that far away.  Mirrorless, perhaps.Other brand owners - I don't know about you guys.  Probably not worth it.  Pentax lenses, especially ones worth buying, are not inexpensive any more.  Their lens selection is a bit odd to say the least.  This brand Pentax very much own its existence on what is perceived by some to be a \"cult\" following who repeatedly by their products every time they are renewed.  I am not entirely sure where this comes from, as pictures taken by Pentax equipments are visually not that different from other brands, not in the way Leica for example can distinguish themselves from the rest.", "Date": "May 15, 2011"}, {"Title": "Picture quality", "Author": "LAMYL H. HAMMOUDI", "ReviewID": "R1W8QESSSUE8K7", "Overall": "2.0", "Content": "I just received my camera and I'm not sure about the quality of the pictures, they mostly noisy blurry, The lens would probably be the problem since it is just a basic cheap 55mm lens. Not sure if I need to return it or not , Though I've read good reviews about this camera", "Date": "April 12, 2013"}, {"Title": "May not come with weather resistant lens - check before buying.", "Author": "hlmaz", "ReviewID": "R1BD9FL1I7OUS8", "Overall": "3.0", "Content": "I'm sure all the reviews about the actual K-5 which say it is excellent are true but I purchased this from marketplace seller Big Value and I want to point out that the body is weather resistant but the included lens is the standard version - not weather resistant. It's a good price and shipping was quick but they should make that clear in the listing as what's the point of a weatherproof camera without a weather proof lens! I would email any Amazon seller first and have them verify which lens you are getting. Also check around because there is another well known vendor that is selling this camera WITH the weatherproof lens for just a few dollars more and free shipping.Edit: Big Value did allow a return of the camera.", "Date": "March 22, 2012"}, {"Title": "LCD display had bad flicker issue, had to return", "Author": "PJReddie", "ReviewID": "R3RP0GXX01SU5L", "Overall": "1.0", "Content": "Had to return the first camera because the LCD display started flickering, making the camera really annoying to use. This wasn't like an occasional flicker either, more like a strobe light, on/off cycles very rapidly. Have already ordered replacement, hopefully it will function correctly, probably just bad luck with this one. However, Amazon also did not pay for shipping for the return, which I think they should since the product was defective. I'll change this review if the replacement turns out ok, so here's hoping!", "Date": "July 30, 2012"}], "ProductInfo": {"Price": "$1,249.00", "Features": "16.3-megapixel CMOS sensor; 80-12800 ISO range with improved noise performance\nKit includes 18-55mm lens\nWidescreen 1080p HD video at 25 FPS, with sound via built-in or external 3.5mm stereo microphone jack\n6-7fps captures fast action shots; 11-point SAFOX IX+ autofocus system with dedicated AF assist lamp and light wavelength sensor\nLarge 3-inch LCD with 921,000 dots of resolution; fully weather-sealed and coldproof design\nSDXC memory card compatibility (via firmware update)", "Name": "Pentax K-5 16.3 MP Digital SLR with 18-55mm Lens and 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51BoG0EG90L._SX300_.jpg", "ProductID": "B0043M6F1E"}}