{"Reviews": [{"Title": "Great little system", "Author": "Robert Hogan", "ReviewID": "RXC67CF6A9A02", "Overall": "4.0", "Content": "I bought this system about a month ago and I'm really happy with it.  It does (almost) everything.  Easy to set up the network streaming so I can listen to all my music library on my PC, as well as listen to thousands of internet radio stations.  The only drawback as far as I'm concerned is the lack of a headphone output.  It's really weird that Sony actually _removed_ the headphone output from the earlier version of this product.  I was kind of shocked when I opened the box and found there was no headphone jack.  Particularly since Sony's own specs says it has one.  My guess is they didn't want to make it too easy to hook up wireless/remote speakers in order to try to sell you their network speaker products.  It's not that big a deal.  Most people probably won't care about it.  And given all the other things this system does, I really can't complain that much.", "Date": "September 14, 2011"}, {"Title": "Excellent Micro System", "Author": "Jose Salas \"josefrancisco64\"", "ReviewID": "R2HUKZPIYKU93J", "Overall": "5.0", "Content": "It uses a very long life LCD display that`s convince me over the other systems with OLED or FL displays that degrades with time.Sound quality is very good for it`s size.Loaded with all the funtions one will need:  CD,  FM,  VTUNER FREE INTERNET RADIO,  AUX IN,  USB PLAYBACK, HOME NETWORK MUSIC PLAYER, IPOD DOCK BUILD IN.Elegant,  ease of use, can not ask for more with this micro sized system.Recomended.", "Date": "July 10, 2011"}, {"Title": "great system... but...", "Author": "Cricket", "ReviewID": "R3KSG2KM7NHNH1", "Overall": "3.0", "Content": "I like it very much, but get frustrated as it seems to loose connections a lot. Also the support team wasn't helpful to me much when trying to set up the system.IL", "Date": "February 14, 2012"}, {"Title": "Good sound quality, but it could have more EQ options.", "Author": "Riviery", "ReviewID": "R3QFD30CW9SIMY", "Overall": "4.0", "Content": "Once I received the Micro-System, I could notice a lack of voltage selector like shown on manual. My house's tension are 220v, and the equipment works on 120v, so I had to buy a transformer (and no one likes such things). The manual also shows an inexistent DAB antenna conexion.Besides that, the equipment has a very good sound quality, and works as expected. The wi-fi streaming is DLNA certified, and iPod connection accepted my iPhone 4 (iOS 4.3.3) as well.My only complaint are the extremely limitated EQ options (simple basic treble and bass adjusts). My wife is very picky about sound equipments, and she likes to adjust every single aspect of music.", "Date": "June 12, 2011"}, {"Title": "Sleek little system", "Author": "A. Goldsmith \"Media Hound\"", "ReviewID": "R9TJZZBSCUJH4", "Overall": "4.0", "Content": "I got this for my office area and so far has been working out well, the whole network streaming seems like a big chore to set up and involves a lot of additional hardware, looking into usb/bluetooth connectivity options - but of course you'd be hard pressed to find a sleeker system for the money.....but yeah definitely loses 1 star for no bluetooth, otherwise lovely!", "Date": "September 13, 2011"}, {"Title": "Excellent Stereo System", "Author": "Lincoln Brown", "ReviewID": "R150HPMJ2LC9ZL", "Overall": "5.0", "Content": "Ordered this Hi-Fi Unit for the Bedroom. The Unit came pretty fast; The speakers were larger than expected, but of medium size in relative terms. The Stereo Stations  was easy enough to set up and the CD Drive it straight forward.The Cd's play great and has A Giant Sound Super and Tone. The Radio gives A deep Clear Bass tone and is great for listening; it is as good as that Bose sound I have seen bandied about on the Tv stations but A bit Larger. The Two Speakers fit perfectly atop the body of the CD Player/Radio which is about 14 inches wide. A Super Buy and price.", "Date": "August 29, 2013"}, {"Title": "Sony CMTMX700NI Music System & Internet Radio", "Author": "jim ranti", "ReviewID": "R21SNMDQA3RY3H", "Overall": "5.0", "Content": "The system works very well & the sound is excellent. The internet function with wi fi connecting to your computer is an endless variety of radio stations from around the world. We listen to classical music & there are so many classical music stations to choose from. For example, I was listening to classical music from Brisbane Australia & the sound was as clear as a bell.", "Date": "July 4, 2012"}, {"Title": "good stuff", "Author": "jdelgado", "ReviewID": "R196F7MSQ567KM", "Overall": "4.0", "Content": "Just what is meed.  Good shape and the wireless option works greath.The internet radio have some issues.. but the problem is the provider.", "Date": "March 1, 2012"}, {"Title": "Really cool device", "Author": "vincent himpe", "ReviewID": "RII5ESN9F3FP8", "Overall": "5.0", "Content": "This thing is really nice. Easy to setup. Plug it in the network and it self-configures. I use it mainly through vTuner , FM radio  or iPod playback.Wish it had an adapter for iphone4 or optical input to hook it up to the computer.", "Date": "July 6, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004QUN6EM"}}