{"Reviews": [{"Title": "Stepped up from my mega zoom to a great camera.", "Author": "J. Donaldson \"Cal-diver\"", "ReviewID": "R3MS3WLPSJU1UZ", "Overall": "5.0", "Content": "I've had a Panasonic FZ30 \"bridge\" camera for five years. It is the type of camera without interchangeable lenses and a small sensor. I've really enjoyed that camera as it had good ergonomics, a great 35mm to 420mm 12x zoom lens, shot video, a good set of features, and pretty good stills. However I found it limited me in three areas (there's always something right?):  1) I wanted better image quality.  2) I wanted better low light capability.  3) I wanted better video performance.Not wanting to carry and change lenses I searched for another bridge mega-zoom type of camera but they all suffered from the same small sensors and limited low light capability. So I decided I had to make the leap to an interchangeable lens camera. I would search for one that had a sort of mega-zoom lens available so I could just have one lens.I looked at DSLRs but they are so big, so expensive, and so heavy that I shyed away from them.Recently several micro four-thirds size sensor cameras came on the market, all using a new set of lenses, but I wasn't impressed with them. I thought if the sensor had been the biggest problem in my FZ30 I didn't want just a step up, I wanted a large leap up in sensor size.Then I saw Sony introduce the A33 and A55. Reading through the specification I was so excited to see it would likely meet all of my wants and then some.I've had the A55 for just over a week and I am very happy with it. I have the one lens I wanted (sort of) which is the Sony SAL18250 with a 33mm equivalent of 27mm to 375mm, almost as much zoom as my FZ30. I do appreciate the wider 27mm and can crop on the PC to extend the zoom range. Photo quality with this camera/lens combination is a huge improvement, just what I was looking for.This camera is small compared to most other DSLRs on the market, but it is competitive in photo quality, ahead in video quality, and has some great features not found on even much more expensive cameras.The sensor used in the A55 is an ASP-C size used in many prosumer DSLR cameras. Sony has done a great job combining advanced features into a small and light body.As for low light the FZ30 was limited to 400 ISO while the A55 goes up to a somewhat grainy 12,800 and can mimic 25,000 in one mode. So it far exceeds my needs for low light capability. There is little noise up to about 6,400.The video quality is astounding at 1080i/60fps (captured at 30fps, recorded at 60fps). It is smooth, sharp, and the color is good even in low light. Check it out on youtube.comThere are lots of detailed professional reviews online so I won't go much deeper - and I'm not the one to do that anyway. I'm just an amateur photographer who wants to take good photos of my seven month old grand son, some videos of wake boarders behind our boat, and photos of family gatherings. This camera will do that and much more.There are many complaints of low battery life but it is better than my FZ30 so I am happy. I have three batteries which should solve any low battery issues anyway. It depends a lot on your shooting conditions. Yesterday I took 700 photos with very little auto focus required; the battery level showed 75% after those 700 shots. This was just a test and the total duration was less than 15 minutes. I just offer it to say that your shooting conditions will dramatically alter battery life.Pros:- Light weight, small and easy to handle.- Great photo quality- Even better video quality than most.- Very fast, continuous Auto Focus even during video.- Level indicator on screen (I can't tell you how many images I've had to adjust photos on the PC for a crooked horizon)- Fully articulated 2.9\" LCD (I won't buy a camera without one of these)- Very nice Electronic View Finder. Some see this as a \"Con\" if they've come from an OVF. I've only used EVF for 10 years so this is no big deal for me.- Nice, sharp, 18-250 lens (an option I purchased separately.- Panorama mode - take an auto-stitched sequence of photos in one quick motion. Awesome feature.- High Dynamic Range - Take, for example, a photo indoors with a bright window in the background. HDR will properly expose both the inside of the room and the image outside the window - automatically in the camera.- Hand Held Twilight mode - take a photo in very dark conditions. The camera will take 6 photos and combine them to achieve amazing 25,000 ISO equivalent photos.- Night portrait - uses the flash for the person in the foreground but properly exposes the background too.- Amazing Night View scene mode - take great city skyline photos at night.- Built in pop-up flash- Built in GPS records where you are in the photo data. Display on Google Earth- Face detection- Smile shutter- 10 Frames Per Second - yes 10fps. You can't find that in any other camera in this price range. And it will focus during the burst!- Sensor switches from LCD to EVF when you put your eye up to the EVF. Neat!- I can have one lens and just leave it there. No carrying two or three lenses and having the frustration of having the wrong lens attached for a given situation. I did the three lens dance many years ago and don't ever want to do it again. With one lens there is no issue with cleaning the sensor if it gets dust on it because I'll never have the sensor exposed to the air.Cons:- With the 18-250 lens the camera and lens weight about 2 lbs. That is about 1/2 lb. heavier than my FZ30 and I notice it.- Lots of shooting, especially long video with the image stabilizer on, can result in an over heat shutdown. I've only had this happen once. Most of my videos are 1-3 minutes, well inside the overheat warning.- To me the grip is uncomfortable and too small. I have average size hands for a man. After doing some research though I've learned I've been spoiled by my Panasonic FZ30 which had a very nice grip. I've tried a number of DSLRs and it seems many of them have grips that are not as comfortable for me as the FZ30.If you are the owner of a larger, more expensive, DSLR you may find some things of this camera to fall a little short for your needs. One big issue is the lack of an OVF, another might be battery life. You may find, though, that the Sony A55 is a good addition to your camera inventory that is much smaller and lighter as a carry-around but still has great image quality and features. For you there are a lot of great Alpha lenses available for this camera.If you are the owner of anything less than a DSLR I suspect you'll find this to be a gem of a camera. It has a lot of features that you can take your time to learn, but it also has several auto modes so you can treat it as a point-n-shoot. My wife picked it up this morning and took several photos without ever having touched it before. She took the lens cap off, turned it on, popped up the flash and took several great photos of me with my grand son.Don't be scared away by those that tell you Canon and Nikon are the only good digital camera manufacturers. Sony makes sensors for Nikon.June 2012I use this camera almost every day and I'm still very happy with it. I purchased a third party manual on Amazon.com which taught me a few things about the camera that I didn't know. The camera is still teaching me how to be a better photographer.I also added an expensive, heavy, large second lens (the Sigma f/2.8 70-200) which I will use occasionally but the 18-250 is still my primary lens. The Sigma takes sharper photos, and allows for better low light photos without a flash (like a wedding reception for example). The good news is if you don't mind changing lenses this camera is still a good choice because there are some great lenses available for the Sony Alpha line.I still don't change lenses. When I leave the house I have a target photo shoot in mind and attach either one or the other lens for the day.I'm going to attach a photo of my 28 month old grandson in the pool with my wife that I took with the A55 and the Sigma lens so you can see how sharp it is. That photo is right out of the camera, unedited in any way on my computer.", "Date": "October 19, 2010"}, {"Title": "Excellent compact DSLR!", "Author": "P. Baek", "ReviewID": "RFKXFTWVQCGUZ", "Overall": "5.0", "Content": "This camera is probably the best compact DSLR in its segment right now. Here's my summary:Pros:1. Extremely fast and accurate AF. It's as good and sometimes better than my Nikon D90!2. Image quality from ISO 100-800 is good as my Nikon D90 and is as good or superior to anything near or in its segment! Images above ISO 800 are still very decent and competitive with anything with its class.3. Images from the kit lens are sharp and vibrant.4. EVF is accurate, detailed, and provides all the info. you need5. Excellent quality HD (1080i) video.....better than most DSLR's in its class. Low light capability is excellent.6. Best Live View of any DSLR around....w/very fast AF.7. Excellent tilting LCD screen....vibrant and hi-res.8. Light and compact body.....easy to travel with.9. Tremendous value.....beats anything in its class (best bang-for-buck)10. Received dpreview.com's coveted Gold Star award!Cons:1. Relatively short battery life2. HD video limited to 9 min. with Steady Shot on (but 29 min. with it off). 3rd-party lenses with lens OIS may be a work-around.3. Limited manual controls with video.4. Camera might be too small for users with big hands (be sure to handle it in person if possible)", "Date": "October 9, 2010"}, {"Title": "Handles difficult photo conditions with ease", "Author": "letsdesign", "ReviewID": "R1HURZLB8R0O0Z", "Overall": "5.0", "Content": "The a55 makes it easy to shoot great photos in very challenging lighting conditions. The Auto-HDR (digh dynamic range) takes 3 photos and combines them perfectly into one photo, so that very bright sky and darker landscape both are exposed properly in the final photo. The camera also uses a similar process for doing low light situations (where subject movement would cause a blur if no flash was used). These are in-camera processing features that only Sony is offering at this point.The continuous auto-focus during video is also a first for inter-changeable lens cameras. Overall, it's a great photographic tool.By the way, one reviewer compared the a55 to his Canon 7D. That's a $1,600 camera, body only, while this is $750 body only. In a way, it's a compliment that a camera costing so little has to be compared not to others in its price class, but to a camera double the price.William", "Date": "October 17, 2010"}, {"Title": "Very affordable, FAST-FOCUS DSLR w/ very good 10 FPS feature.", "Author": "Ynotw84me2day", "ReviewID": "RO13STATP1HA0", "Overall": "4.0", "Content": "I'm the first to admit that I never liked any of the Sony cameras.  I never cared for their Steadyshot P & S, and I still don't care for it today.  I considered their DSLR line to be waaaaay too bulky & ISO too noisy, compared to the Canon & Nikon DSLR line (of similar feature models).  So I had to re-read all these GREAT reviews about the A55 thinking that it was too good to be true:  An improved technology (invented years ago) that ACTUALLY makes good on its promise of faster focus & more light being absorbed by the camera.I've been playing with my a55 for two days now & I am terribly impressed by its accomplishments & innovative features (gps, image stabilization, lightweight & small footprint, PLUS CONTINUOUS AUTO-FOCUS DURING HD VIDEO RECORDING).  Another set of features that I am terribly surprised to see being ACTUALLY USEFUL:  Panorama & 10fps shooting mode.  I couldn't be more thankful to realize that I can save myself HOURS of pc-processing, by simply panning the A55 left to right (or top to bottom) while pressing the shutter button (continuously taking shots) & processsing (stitching) the pictures internally to give me the final shot practically on-the-fly (literally done in under 15 seconds).  Yes, the panorama pictures are very decent (except when people are moving around, then u get blurry subjects) and very useful.  The 10fps mode works ONLY if you have very good lighting outside (you can forget indoor shots, even if you have a f/1.4 lens).  Granted the focus is fixed, but the feature actually works.  I took some shots of my son playing basketball while keeping up with the focus spot, pointed at his face.  What sucks is the post-processing & writing of your shots to the memory card.  My class 6 sdhc was a TURTLE.  I'm hoping that my soon-to-be-shipped 8gb SDXC will make a difference.Another plus regarding the Sony DSLR's (which is not a secret):  Because of in-camera stabilization, Sony offers CHEAPER LENS prices (of similar to the models compared to Canon & Nikon).  I'm assuming the lack of image stabilization offered on the Sony lenses help lower the price.  Unfortunately I've read in some forums & lens reviews that... although Sony's line of dslr lenses (as a whole) create exceptional pictures, the construction (plastic) is not as reliable.  I've yet to experience that flaw... to be continued.UPDATE:  I just got done testing the a55 w/ my tokina 11-16mm lens (plus sony's f/1.4 50mm wonder) & I couldn't be MORE SATISFIED with its results. I even tested it with my co-worker's old minolta lens & the image stabilization works like a champ. In manual mode, it's a GODSEND to adjust the settings & see the upcoming result on the lcd screen, instead of relying on numbers & graphs (but it's also on the lcd screen to accommodate the technical savvy's unlike myself), before I take a shot.Prior to this, I tried (and failed) many times (in my previously owned dslr's) to tackle manual mode, on getting my desired picture.  I adjusted, took the shot, then viewed the picture... TOO DARK.  I adjusted again, took the shot, then viewed the picture... TOO LIGHT!  And so on... and so forth.  The a55 (at least in my experience) eliminated my trial-n-error in manual mode.  The drawback to this:  I'm still a dope w/ a dunce cap if someone asks me the adjustment specs ona specific picture that I took in manual mode.I've come to appreciate the PANORAMA-ON-THE-FLY feature more so now than ever.  Perfect for still shots outdoors.  That includes the 10fps burst modes for active kids.  I took some great shots of the little monsters as they try to murder a piñata.As for the video issue that everyone was talking about.  I never encountered the 'overheating' defect.  Then again, I used the fastest memory stick pro duo that sony has released to date.  So far, so good.  I've yet to use my 8gb sdhc class 10, in video mode - past 3 minutes.On the Nikon D7000 comparison:  American Photo just compared the photo output of both cameras.  The Nikon D7000 only faired slightly better.  It's interesting that the CMOS on both cameras are made by Sony (I didn't know this).  In my opinion, the a55 is a better buy (given the competing features & results) against the D7000, while saving over $500 to boot.  Video focus is also far superior on the a55 than the D7000, as reviewed by the magazine.For $849, I couldn't be any happier for what this little baby can do.  Although I still hate the fact that I have to buy a hotshoe adapter just to accomodate the a55's proprietary slot!  You and your BETAMAX mentality, Sony...  Quit it.", "Date": "October 25, 2010"}, {"Title": "Little Speedgun", "Author": "DML", "ReviewID": "R13T8XSC4W09KH", "Overall": "5.0", "Content": "I like this camera! For $750 I can't find another camera with these specs. It is well made and is now my do everything, go everywhere, second camera to my big gear.Pros: Clean high ISO  6 fps with full functionality, 10 fps with limits  FAST autofocus, especially in video mode!  LCD screen swivels into the body for protection, great for hikes  In body stabilization, great for the vast selection of old \"Minolta\" lenses  Menus are very helpful and easy to navigate  Button layout is very efficient  Small body great for travel  Mirror does not move lessening camera shake during shooting  In camera GPS  $750!Cons: None that match this price range, this camera beats everything else in my opinionYes, this is a small body, semi-limited function camera designed to be a step-up camera or second body to pros. Many of the complaints are pros who are trying to use this little speedgun inside a studio with a full flash set-up. That is not the function of this camera, buy a Canon 5d mkII, Nikon D700, or Sony a900 if that is what you are looking for. For $750 I can't find anything similar in functionality. I bought this camera with a full complement of lenses for under the price of the new Nikon D7000.", "Date": "October 17, 2010"}, {"Title": "Everything is right, and then some", "Author": "Mark Thiel \"Mark Thiel\"", "ReviewID": "R1GCRQI32PO6K4", "Overall": "5.0", "Content": "This camera has every little thing right, and every big thing right. Light, compact, quiet, wrap-around rubber grip on entire right side of camera, review photos right in the electronic viewfinder, or on the LCD. Shoots 10 fps, great in low light, gorgeous colors, articulated screen. I had originally bought the A500, but returned it because of a tiny scratch. Meanwhile, the A55 came out for pre-orders. God, I am so glad that I waited another month for the A55 to come out. It just feels right in your hands. The speed and smooth response are really nice. I think I've made the best possible choice for a camera costing under $1000 dollars. Full HD video, stereo recording, sweep panorama shots, 3-D sweep panorama. Couldn't be happier with the camera. Battery life could be a little longer, but it's not a crisis.The more I use it, the more I love it.", "Date": "October 16, 2010"}, {"Title": "Great upgrade from a bridge camera", "Author": "J. Donaldson \"Cal-diver\"", "ReviewID": "R3PAQD3RX1QMOS", "Overall": "5.0", "Content": "I first bought the A33 camera but returned it to upgrade to this Sony Alpha SLTA55.Some background will help others understand my comments: I had a Panasonic FZ30 for five years. I liked everything about that camera except it had its limits and that was what I was looking for - something that would be at least an equivalent but remove the limits. For your reference the FZ30 is an 8mp camera with a 35-420mm fixed lens, swivel 2\" LCD, built in flash. It is considered a \"bridge\" camera that falls between mega-zooms and DSLRs. So I'm not coming from a position of having a DSLR with many more features or a full frame sensor. I enjoy photography but just for casual and family use, no publishing for me. Just snapshots.The three things I was looking for specifically were better image quality, better video, and better low light capability. The Sony Alpha A33/A55 definitely addressed those issues, and there are a bunch of very interesting features I wasn't looking for but am glad to have.First this camera has an ASP-C sized sensor, the same size used in many larger DSLR cameras. It isn't \"Full Frame\" but it is way larger than my Panasonic FZ30 sensor. That larger sensor made all the difference in the world when it comes to photo quality. At 14 megapixels in the A33 and 16 megapixels in the A55 I find the image quality is so good I haven't felt the need to sharpen any of my photos on the PC. Also I can now crop (zoom) on the PC and still have a high quality image.The low light capability of this camera is superb. I now can take good photos in low light where my FZ30 couldn't even perform. It goes all the way to ISO 12,800 (the FZ30 went to 400), and can mimic 25,600 in a hand held twilight mode that I find works quite well.As far as video this camera is also superb.So it solved the three issues I had with the older camera.I really don't like changing lenses. I had that experience 30 years ago with a Canon A1 film camera and don't want to do that again. So I purchased the Sony 18-250mm (27-375 equivalent) zoom lens and that I just leave on all the time. This means I can go wide angle to zoom over a 14X range, never change lenses, and don't have to worry about the pesky sensor dust problem of interchangeable lenses.This camera is about 1/2 pound heavier than my FZ30 but after a while I didn't notice that. With the Alpha 18-250 zoom lens it is just about 2 pounds. It isn't without its faults though. First Sony simply made the grip too small. It is annoying but I'll live with it. Second, as with a lot of digital cameras in this genre, the sensor can overheat and shut the camera down. This might happen on hot days when you are trying to shoot long videos. Videos of 2-3 minutes are no problem. I don't take videos longer than that so this isn't an issue for me.There are lots of comments about battery life being short but it is longer than my FZ30 so I'm happy. I found on a two week vacation in France that I never had to use the spare battery in my pocket once. I took over 1,200 photos over 10 days, sometimes 300 in one day, and never ran the battery down below 50%.Pros:- Very fast auto focus.- Translucent mirror technology allows focus during video.- Awesome low light performance- Awesome video- Very useful \"handheld twilight mode\" to take handheld photos in very low light. Takes 6 shots and combines them.- Awesome High Dynamic Range (HDR) feature that brackets three shots and assembles them. This was great in France when the sky had clouds with bright sunlight on the edges that blew out the highlights. The HDR mode took three shots and combined them, lessoning the sky highlights and improving the detail of the darker sections of the scene. I used it a lot.- 6/10 frames per second, great for moving objects like kids or sports.- Panorama mode (but I don't use this much)- Too many other features to mention (see review on dpreview.com)- Very sharp and clear 3\" LCD- Much better EVF than my FZ30Cons:- Small grip - and there is no good reason it couldn't have been larger without compromising the compact nature of the camera.- Not good if you intend to take long videos.Should you buy the A33 or the A55? In my opinion, and for my use, I think the A33 would have been fine. I did the upgrade for one reason only and that was some charts that showed the low light noise was less on the A55. You get 2 more mega pixels but I just don't think that is important.The A55 has a GPS feature that marks the images with the location coordinates but I found this feature didn't work well. As with any GPS it takes time to sync up with satellites. However if I turn the camera on, take three or four quick shots and turn it off the GPS never syncs and it records the wrong location.The A55 goes up to 10 frames per second while the A33 goes to six. I suppose there are a few instances when that might make a difference.January 29, 2012I am still very happy with this camera and I use it almost every day. I still have just the one lens. The difference today is I've learned a lot more about the camera and can use it in ways that extract the best performance. There are times when I wish I had a longer zoom but I'm also learning most of the very long zoom shots aren't the best because there is always some kind of haze in the air so it is more wishful thinking to have those shots turn out in superb quality.I think it is great to be able to take close up macro shots of flowers and a few seconds later take a medium zoom shot and both turn out very nice.It's always interesting to read about the new rash of cameras coming onto the market, especially the inclusion of translucent mirror cameras from Sony's competitors. However I see nothing yet in these new cameras that will draw me away from this sweet little A55.", "Date": "November 24, 2010"}, {"Title": "Impressive piece of tech", "Author": "Klaus", "ReviewID": "R2GPME2TZD6BL8", "Overall": "5.0", "Content": "The pros: * Very impressed with the speed, noise level and resolution. It's also very easy to use (works exactly like a point and shoot in AUTO mode). * It's SMALL! * The AUTO+ mode is really awesome when you want to take good pictures without worrying about manually setting the camera, or when you're in a hurry, or even when someone not experienced in your family wants to take a portrait of you or shoot landscapes. * The \"Handheld twilight\" scene mode is pure gold. It takes several exposures in sequence and combines them. * The camera is more than worth the money.Now for some cons because nothing is perfect: * Full-HD video mode is in practice limited to about 3 minutes because of overheating, with is frustating. Per Sony's website, you can get up to 29 minutes if you turn Super Steady Shot off, but image stabilization is very welcome for handheld video. * Bracketed exposures appears to be limited to +- 0.7 EV. I wish there was no such limit. * The EVF can be a nuisanse in rare occasions, but I think it's worth the beneffits. * When review is turned on, both the EVF and live-view blacks out in between shots, adding some delay between focus + exposures (single drive). I think this could be corrected by a firmware upgrade (hear me, Sony?), where the EVF continually shows the live subject, where the live view displays the review *if* my eye is out of the viewfinder range. This would allow the SLT to work in a more similar way to other reflex/optical viewfinder cameras. * Not many shortcuts to turn on and off features like metering mode, focus mode, drive mode etc, but again, it's a camera that won't intimidate much the not-initiated * You have to leave Power saving in an agressive setting, or else battery will be an issue. * In practice, GPS won't lock indoors, and will take 1-2 mins to lock even with clear sky. * I didn't find Auto-HDR to be much useful since it shoots only on JPEG, and also couldn't quite get appealing pictures with it (yet), but I definitely need more practice with it. * Sony software (like PMB) is not the most flexible and open around. The RAW format (ARW) is not the most popular, but Adobe supports it fine.All those things are minimal in the light of", "Date": "November 11, 2010"}, {"Title": "SONY a55", "Author": "Bear 57", "ReviewID": "R2OXB9PGA394NB", "Overall": "5.0", "Content": "I own this camera. I'm a Nikon owner from way back and own a Nikon d90, but researched this camera and it's technology, and after using it I rate it 5 stars because it does everything but butter your bread! Unbelievable images!!!!!! I'll not review the attributes of this Sony because it's already been done previously, but honestly, it's probably the most awesome buy on the market now! No, I'm SURE it is!!!!!! Be aware though that this camera is substantially smaller than your average DSLR, and may take some getting used to, but I like it as a quick shooting alternative. I'll let you know more when I receive my new Nikon D7000, for a comparison. But in summary if you're contemplating purchasing this Sony, GO FOR IT! UPDATE: November 12, 2010- Just returned from Italy with this camera and My Nikon d90, and I will have to say this camera is AMAZING! Yes, the d90 takes amazing shots and deserves praise, but this new Sony also deserves alot of praise. The Sony is lighter, easier to handle (for me, I have average-size hands), is FAST, SUPER EASY TO NAVIGATE AND OPERATE, and most importantly, takes awesome shots!!! After going over 1000 shots and interpreting the quality, the Sony performed with 5 stars, plus it's just so damn easy to shoot, and the added features were really very useful. I still rate it 5 stars, but will update when I receive my new d7000.", "Date": "October 15, 2010"}, {"Title": "Fast AF, GPS tagging, level indicator, and more...", "Author": "Ray Kim \"The contractor\"", "ReviewID": "R2JLU5JWE50AHI", "Overall": "5.0", "Content": "I bought this from SONY directly when they just released. I set it up with 18 - 250mm lens. I've started with Nikon D40 and I was debating beetween Canon 7D and Nikon D90 for upgrade. Then I saw this camera's ad on internet that it's coming soon.Based on the A550 and A800's customers' review, I've decided to give it Alpha55 a try. The biggest merit this camera has is the speed.From off to setup, continuous shooting(10fps), AF speed, so forth. 1080i HD movie with continuous AF is amazing binding with steady shot. 3inch swiveling LCD screen is par or better than iPhone4. I like the level indicator when I shoot landscapes. GPS geo tagging is also cool. A+ mode selects automatic scene detection even at night time. I also like the  video quality, but I'd use external mic for audio. The built-in mics are not quite good enough.  The sweeping method of taking panorama picture is so easy, anyone can make pan pics both horizontaly or verticaly. Only thing is the body grip is small for my hand. I think I'd need a verical grip to expand the size of the grip. I'd recommend if you're looking for all the latest tech with $1000 range dslr, you will like this.", "Date": "October 17, 2010"}, {"Title": "Starting my first DSLR system ... this is a keeper", "Author": "A. Venkitaraman \"Oilman\"", "ReviewID": "R1DEX13GWI1SWL", "Overall": "5.0", "Content": "Finally got the A55 couple of days ago. There are a lot of features in this camera (I am a slow learner). Just some quick feedback from a newbie. This is my first DSLR - my last SLR was a Canon AE1 - which I really enjoyed (talk about ancient!). I have had a couple of digital P&S; (Canon G2 and sd860). I bought this to build a system around the alpha mount, if I didn't like it I figured I could just sell this and move on to another system.1. Size/weight: Quite a difference in \"heft\". It is even lighter than the Canon G2. I don't think it is a bad thing though. It is easier to carry around.2. Feel: It does feel somewhat cheap (with the kit lens). Not sure if it this is an indication of build quality. So long as it withstands the inevitable \"bumps\" I am okay. Only time will tell. I guess if one is careful, it should be okay.3. Pictures/IQ: I have not had a lot of chances to explore the different modes yet. Like I said above, there are way too many choices for me. My only experience so far has been at the Saturday soccer game, mid-afternoon, outdoors, sunny. Really liked the 10 fps, I felt that the camera did not track the subject as I had wanted it to (I may be doing something wrong here). Unfortunately, I only had a class 4 SDHC with me (not the limit though, as I never held the shutter down long enough to get more than 8 shots. jpeg/fine mode). The kit lens (18-55mm) is not the best choice here (for sports/action). I do not pixel peep, but like to view it on my 23\" full screen and found the images to be quite nice. Never ran into any overheat issues during the shooting.4. Video: This seems to be the overarching concern with this camera with the sensor overheat issues. Did a simple test, shot video inside the home (about 69 deg F/21 deg C), and the overheat warning came on at ~7:45min and camera shut down at ~8:45min. The SSS was on and I handheld the camera (let it AF on various objects). I don't think this to be a limitation. The video quality was good, but the mic did pick up some noise from the SAM motor (in the lens).5. Battery: The battery runs out fairly quickly. It is somewhat weak to support this camera/features. I would like a new battery, but am waiting to see if I can find some good batteries from the third party manufacturers (reviews found here show them to have some size issues). Sony battery is too expensive.6. LCD/EVF: It will take me a while to get used to the EVF. For whatever reason keeping my eye on the EVF, then defocusing, makes me feel dizzy. I had become very reliant on the LCD (from my digital P&S;), I guess. The LCD smudges very easily, but is really nice.Final thoughts: I have nothing more to add than what has already been said. I am being guarded in my comments till I have had a chance to play/explore with all options on this camera, and will update this review. This is a keeper for me. My experience so far has prompted me to buy the following (haven't got them yet):a) Panasonic 8 GB High Speed 22MB/s SDHC Class 10 Memory Card RP-SDW08GU1Kb) Digital Camera Anti-Fingerprint Display Protection Film (Pro Guard AF) for Sony Alpha NEX-5 / NEX-3 and Alpha 55 / 33c) Sony 55-200mm f/4-5.6 SAM DT Telephoto Zoom Lens for Sony Alpha Digital SLR CamerasI would like to add more lenses. I am concerned about the size of camera - will the mount be stressed by the heavier lenses? I am interested in getting the Tamron/Sigma 70-200mm/f2.8 (more appropriate for sports/action), then a few primes (CZ 135, Sony 50/1.4) to start with. I will update after I get these lenses/try them with this camera.", "Date": "October 31, 2010"}, {"Title": "Video recording problems", "Author": "wrowlands", "ReviewID": "R3DRYQWP1E7216", "Overall": "3.0", "Content": "I like everything about the camera when taking still pictures. The video overheating matter is a problem. I found an alert on the Sony website [...] I have since attempted to record videos with the SteadyShot setting in the off position. I am able to record a video for 4 minutes before I get the error code telling me the camera is overheating and then it shuts down.I have paid a great deal of money for this camera and do not believe that this overheating in such a short time is normal for a camera of this caliber. I contacted Sony for technical support. I got an RMA to send the camera to a repair location in Texas (I am in California). When I went to the FedEx drop off center I found that the package was being sent ground. I found this to be poor customer service as I had JUST purchased the camera. I let it go. It has been one month and Sony still has the camera and is claiming that this issue has been well documented and they are sending it back to me without a fix.", "Date": "November 11, 2010"}, {"Title": "All Around Winner", "Author": "petee \"pfr\"", "ReviewID": "R3MI1YGJ51HTTY", "Overall": "5.0", "Content": "Great Image Quality with kit lens. Fast Auto Focus in all modes. Compact & Light Weight. One reviewer has compared to Canon 7D,that is at least twice the price for camera & lenses. Good Ergonomic bridge between point & shoot & larger DSLR. Live View & EVF are superb. A FUN camera for working settings. Sony has a real winner.UPDATEI purchased this camera when it was introduced six months ago, and have read a number of different reviews. Here is my take. One reviewer said this camera is not for everyone. {AGREE} Here are +&- from my use.Cons-1. This is not a studio camera.2. Movie Mode is for 4-5 min. clips.3. Does not have all features of Canon or Nikon.4. Small size.Positives.1. Great out door action. I have taken some great pics of dogs & kids. Fast Focus is unbelievable.  Also some great landscape photos with a Tokina 11-16. Image quality is Excellent.2.Movie Clips are fine for me. Great Quality.3. I also use Canon 5D Mark 2 for features.4.I stated in my initial review, camera is great bridge in size between point & shoot and full size DSLR. I like this. You will not get similar Image Quality with any Point & Shoot.Camera has won D Preview Gold & Pop Photo Camera of the year. If the positives are important, this camera is for you & 5 STARS.", "Date": "October 16, 2010"}, {"Title": "Great camera. Get it, when it's in stock.", "Author": "Georgio", "ReviewID": "R2JMOCZAJ1G601", "Overall": "4.0", "Content": "Interesting technology and features. Compact size. I was waiting for camera like this for very long time. And Sony finally made one for me. 2 in 1 - real DSLR and Ful HD \"camcorder\"! I will be using it ~ 90% for HD Video and 10% creative still pics. To compliment camera I got body only and Sony SAL-DT18-250/3.5-6. Turns out to be great match! Now I need a 50mm/1.4 to cover low light conditions. I set it up to 16x9 size for stills and to highest HD quality /AVCHD. I watch my pics/video on my 50\" 1080 HDTV (16x9). Or, on the computer... I'm not printing 4x6 or even bigger pictures - this will be ridiculous anachronism. When I put together nice HD movie (report from my Hawaiian vacation), I make AVCH HD video and burn it on regular DVD. This disk is playable on Blue Ray player (standalone, or BR Drive in computer's). This is cheap way to share HD video in best quality. For stills, I just making data disk. Some complaining about camera overheating after 3-9 min of continuous use - of course! Sensor is huge - almost full frame. My 1/4\" CX100 HD camcorder gets hot after 5 min of continuous use. And A55 is not a webcam and not a fully dedicated HD camcorder. You must understand what you are buying (or talking about). Maybe in the future, Sony and others will develop faster and more efficient image handling/firmware. Maybe use dual processors... Or, Quad - that's would be cool, huh?  :bSpeaking about the video techniques, I think, that any person in right mind, who is buying this type of camera is perfectly understanding all advantages and getting it for creating home made HD video one level up. QUALITY here is higher than an average $500 HD camcorder... And anyone who at least read something about how good video should be done - should never make video clips 3 min long. Golden rule of video, is to keep clips short, 3-5 sec expositions and up to 1 min in cases when you need to follow something. Searching vimeo and youtube before buying this camera I saw horrible samples of Canon T2i, Sony A33/A55, some people can't even hold or point camera... Sad. But, also I saw (only) one sample which is simply exemplary - see [16007274 - add this to the end of the vimeoURL][or, search for Miss Daisy]. Now, THAT's how you should use A55! Also, you can learn by observation of great camera work while watching good movie.PRO's:- Great sensor (same size as in A33, Sony just squeezed more pixels in it and surprisingly seemingly without increasing the pixel noise)- Compact size.- Great AUTO+ mode- Finally, unlike as Canon T2i - this camera CAN focus, and even better - it can HOLD focus! And focusing is super quick and precise. Yay!- Great A/S/P modes and D-Range feature.- In body Image Stabilization (basic, but works well)- Lens AF/Manual button on body. TIP for video: if you have static 'subject' and bunch people constantly walking in your scene(stupid tourists always do that:) - use Auto mode to focus on subject, then turn it off - to Manual and start your video. Those zombies passing in front of camera will never mess-up your clip.- Huge 3\" AND 16x9 display - FINALLY!!! I'm already sick of seeing these puny 4x3 displays.- 10 FPS shooting is great. I will use it some day. To capture drama of someone falling his face down right in front of me (given that my camera is on). Yeah, something like that. See, I'm not really into sports :]CON's:- LOUD CLICK recorded on video clip after you stopped filming video. This was directly inherited from NEX5 which was and is one of the weirdest Sony creations. It was a defect then and was NOT fixed here!!!! What you are thinking Sony dudes?- Microphones are sooo basic quality, pointing sideways instead of forward, and totally NOT insulated! Super sloppy job, Sony. I will have to get external anyway - to get decent sound... but still!- \"Fn\" button should be moved somewhere else, preferably to the top, next to the D-Range button - there is plenty space for it. And create a decent thumb rest.- LCD is folding ... down. This is not being creative, this is ridiculous, Sony. I do not care much about it, but many Facebook, My Face, My Space other social networks will be not happy with this design. Because it will be quite difficult for them to take picture or video of themselves... :) I find it useful, only when LCD is not in the use, I can flip it backwards to protect screen. Strange, but looks like nothing is preventing to have LCD hinge on the left side. It even can be made more heavy duty.- GPS? Really? I don't know why this feature is so suddenly popular in cameras? I'm not an employee of Miami CSI, it is crucial to them to have an exact coordinates of pics of evident's. Well, I DO know where are my video's where taken, and where they are now. I sorted them in the folders by topic... Oh, I see, this feature is for totally clueless. :) Ha-aha.I'm still VERY happy with the rest of the camera, just have to live with these \"birthdefects\". But because of them - 4 stars, Sony, for otherwise great camera. Recently I compared image color calibration and image quality A55 vs newest Canon 60D - they basically identical! Interesting, looks like both companies found most appealing settings. Well, I like them too.Good day.MORE INFO:- after playing with different settings I've discovered that I can do MANUAL adjustments in HD video mode!!!!!!!!!! Awesome! Try it for yourself. Set camera to \"A\" (Aperture mode). Start movie recording and hit \"AV\" button (or AEL) and using wheel under the still shots button you will BE ABLE TO adjust these setting on the fly!!!!! yes, while recording video! So, after all, it is not all full Auto, like a Canon or others. I love it! NOTE: it may depend on the lens. I used elChipo Sony 35mm/1.8...(?) What I do not like it fact that wheel, is not perfect and is making very loud clicks when it turned. Darn, what's now - my external mic is too sensitive?... Anyway, I'm still exploring this camera. And more I use it, more I like it. It is very cute and far more user friendly than other DSLR's. The way it built, does \"make sense\" to me. And - NO - I do not work for Sony, far form that, I more like a Canon fan. Just trying to be reasonable  :) and get the most of all those retarded cameras currently available. If you recently looked around for a good DSLR, you'll know what I mean.", "Date": "November 18, 2010"}, {"Title": "Best in its class", "Author": "Phidippus7", "ReviewID": "R3NXN8CSCLMYMD", "Overall": "5.0", "Content": "I spent six months pouring over camera reviews, and cameras for a small DSLR(quality) camera under $1000. I had a list of desire features in mind, and thought that there was no way I would find a camera that meet all my expectations. That is, until I discovered an article discussing a new forthcoming camera. I was excited to see this new camera had everything I wanted (even though I knew most of the things I wanted are not standard for small DSLRs. GPS, tilting screen, high-resolution movie capture, enough mega-pixels for fine tuning in photo editing software, and even more. Obviously the camera in questions is the Sony Alpha SLTA55VL!This camera is great. The quality for the price is everything I wanted. I do a lot of hiking, and nature macro shots, so I don't want a lot of bulk if I can help it. This camera is fast, and responsive. The burst mode priority setting can be reached by a few clicks of the dial. While the panoramic mode has a little trouble in low light settings (indoors with low lighting) it does an amazing job with scenic daytime shots. The smile detector is fun (though perhaps not useful for nature shots). The camera's in-menu explanations of different settings make it easy to learn what each function does. Lastly the GPS stamp does wonders to recording locations data of my shots, but it tends to be off by something like 10-50 feet. It does depend on how long the camera has been on before you start taking shots, since I keep mine off anytime I am not actively shooting it tends to be inaccurate. For my purposes that degree of deviation does not matter.All in all it is a great camera for its class. However, your application while determine whether it is the BEST camera for YOU.", "Date": "November 3, 2010"}, {"Title": "Excellent compact DSLR", "Author": "Kalyan Vissa", "ReviewID": "RPMVKVT8W1JH8", "Overall": "4.0", "Content": "I've owned this camera for about a month now, so my review is based on early impressions. I own a Pentax K200D DSLR as well and the Sony A55V blows it out of the water in terms of AF speed, low light capability and IQ. There are numerous reviews out there that extol precisely these virtues of this camera and now I know why. The A55V is a very light camera (compared to my K200D) which is both good and bad, in my opinion. I keep getting the feeling that it might not survive a tumble, though, the overall build quality of the camera seems rock solid. It does feels solid in the hand. The camera grip is indeed small, so those with large hands, take note. I bought this camera mainly for the AF speed, and low light capability. The K200D is an excellent camera (the 'weather sealed' feature is a killer one in my opinion) but I found it lacking in low light. I've paired the Sony A55V with a Tamron 17-50mm f2.8 lens, which is a fantastic lens. I'd highly recommend this pairing for anyone considering this camera. There are about 150+ lens choices for this camera, which is not bad, though not quite as good as Nikon/Canon. This camera can hold its own when it comes to IQ compared to Canon/Nikon cameras in the same price range. The in-camera image stabilization was another reason I bought this camera over the Canon T2i or the Nikon D7000. The biggest complaint that I have about this camera is its battery life. Other reviewers have complained about this as well. Hopefully, Sony will come out with a more powerful camera and couple it with a firmware update to improve overall battery life. The EVF in this camera will take some getting used to initially, though the clarity of the scene under capture is excellent. The 10 fps burst speed is awesome, though, one can only use it in the Auto mode. I've only the camera for indoor test shots so far and have been extremely impressed with the IQ (I'd rate it 11/10 if I could!). Of course, the lens plays a big part in IQ as well. Also, Sony hasn't come out with a Battery Grip for this camera yet, for those that find it an important accessory to have. I haven't tried the movie capture feature yet as I am not a big fan of shooting movies using a DSLR. I will try this feature out in the near term, as this has been a very highly rated and extensively covered feature.", "Date": "November 20, 2010"}, {"Title": "Great Hybrid Solution Photo/Video", "Author": "James M. Darter \"JM Darter\"", "ReviewID": "R3U11AOP95MDZ9", "Overall": "4.0", "Content": "I have had several cameras over the past few years, including Nikon (D90), Canon (D40 and currently 7D), and Panasonic (GH1 and GF1).  I actually bought this camera while waiting for the new GH2.  The GH1 was one of my favorite cameras, but because of the low fps speed, I upgraded to the 7D.  I missed the ease of the autofocus for some shooting, so I was waiting for the GH2 when I saw this, and decided to try it.  So far, I am VERY impressed. One of the major features that I was pleasantly surprised with was the 10fps shooting.  I didn't have high hopes for this, but it is actually very good.  If you have good light, almost all of the action shots are crystal clear.  I initially bought the body only, with a Tamron lens, but noticed that the AF was pretty slow in video compared to Sony lens examples I have seen online, so I have exchanged the Tamron for a Sony 16-105mm lens, which is in the mail as we speak (a great advantage of buying here).  I am still waiting so I will update this review later.  I also hope to try a f1.8 lens soon and will test the 10fps in lower light.The video mode seems to be very clear and crisp, reminds me more of the Panasonic.  There is only one HD mode, which is 1080 60i, nothing available at 720, but as good as the video is at this rate, that is ok with me.  The AF seems to be very good, and I hope it will be a little faster with the Sony lens.  Low light video seems to be pretty good too, still pretty clear. Editing on a Mac is easy, no problems.Low light shooting is a little different too.  I saw one review where the reviewer talked about comparing it to a Nikon 2.8 lens, which I found hard to believe.  But, this seems to take a couple or more shots when in low light, then puts together a great photo.  Almost like the HDR option.  So, if you have a tripod in low light, you should get some pretty amazing photos, even on a f3.5.  Speaking of the HDR option, it works very well.  This weekend while in Phoenix, I took some sample shots and it seemed to really remove some of the dark shadow spots on some of the pics, making them much better photos.  Haven't been able to test it fully, but happy with what I saw.Other nice features are built in GPS, mic and remote input, rotating screen, and panoramic sweep mode (which works very well also).  A couple downers were the proprietary hotshoe, and the screen rotates from the bottom, rather than the side, which I can see being not being as strong as the Panasonic.  I will try to update this review when I get the Sony lens and try a f1.8 with the 10 fps on inside sports, but very happy with this selection so far!", "Date": "November 15, 2010"}, {"Title": "Sony Alpha a55, What's Not to Like!", "Author": "Macondray J. Steiger", "ReviewID": "R1IXRJJX0L7HQ9", "Overall": "5.0", "Content": "I've had my a55 only three days and am already in love with this camera!  What's not to like?  I like everything about this new translucent-mirror design.  Yes, it's extremely fast.  Exposure and image quality are top-notch.  Compared with the a700 I have been using, this camera is lighter, with a very comfortable and somewhat smaller body design.  Buttons and menus are very intuitive to me.  The HD movie mode is well implemented and easy to use.  \"Live View\" is truly live view, through the same 16.4 mp image sensor which shoots your actual photos.  Construction quality is first rate.  Beautiful, really WIDE, fully-articulating LCD screen.  My only wish is that this weather would improve so I can go out and shoot some more pictures!  You will love this camera!", "Date": "October 23, 2010"}, {"Title": "Yikes, I like it better than my Canon 5D MKII in many ways", "Author": "Chris MacAskill", "ReviewID": "R2O0UM6GQJQZX", "Overall": "5.0", "Content": "I'm a pro photographer who shoots with a Canon 5D MKII, 1D MKIV (expensive!) and Panasonic independent filmmaker's camera, the AF100.  I like all three, but I needed to spend a week at Disneyland chasing grandkids.  I'm expected to produce really great videos and stills because of my background and gear, but getting that stuff into Disneyland and lugging it around and still being able to run and play with the kids is not easy.So I rented one of these for a week, thinking, \"Hey, it's home video and snapshots after all...  Sacrificing some quality is understandable.\"I got two lenses: the 18-250 and Zeiss 16-35.  I couldn't imagine the 18-250 being very good...There were three advantages to this camera that really won me over, but for one disadvantage:1.  With the 18-250, it's amazing how light and compact it is.  It seemed like half the weight of my 5D MKII with a 24-105 lens.  It was such a joy to have something that light slung over my shoulder that I hardly noticed.2.  The articulating display on the back makes all the difference when you're shooting video.  Instead of holding the camera way out with straight arms, you get to prop your elbows on your hips, so you're so much steadier.  You can lower the camera to the height of children and shoot.3.  The autofocus while shooting video is amazing, something the Canons don't do well at all.  It's fast and accurate and does decent face detection.And I was stunned at how good the video and stills are.  Full 1080p that looked amazing for the price, good auto white balance, which I used when I had to move from sun to shade or indoors during a clip.The one disadvantage is a real bummer: it overheats and shuts down if you shoot more than 5ish minutes of video with image stabilization and autofocus on.  That caught me out a few times and I had to reach for my iPhone to shoot additional footage, and it looked bad by comparison to what you get out of this Sony.The built-in microphone isn't great for sound, but I didn't expect it to be.Would I buy one?  Absolutely, if I didn't depend on shooting more than 5 minutes of video at a time.", "Date": "May 31, 2011"}, {"Title": "Superb!  Much more than I expected in this class!", "Author": "Bisquitlips", "ReviewID": "R7VGVMWH4HW1F", "Overall": "4.0", "Content": "I cannot add anything truly unique to the many positive reviews on the A55V that have already been written here on Amazon, but having owned this camera for almost a month I can say that it does everything it advertises and then some!Not to mention that it has won the coveted 2010 Camera of the Year from Popular Photography.  Unanimous at that!  [...]The 17 page Sony A55V indepth review on DPReview is well worth the time to read. After going through every aspect of this camera they gave it a Gold award rating, and coming from that group that in itself is a rarity. I must have read that review at least 5 times and each time I got the feeling that they were looking for something that would be a major drawback, but could never find it.  Each time they came up with something that was a con to the camera it was always minor.  Like they knew they had to find something negative for the review to be balanced, but had a hard time doing so!  :0)  Again, a rarity for this group.After purchasing the A55 with the kit 18-55mm lens, I was so impressed with what it could do with a kit lens that I immediately purchased the Sony SAL 18-250 as I wanted a good walking around lens for it and something of a better quality without spending a minor fortune.The kit lens is good, but really doesn't give you the quality needed to see the capabilities of this camera.  The SAL 18-250 is much better in my opinion, but I am still left with the feeling that a nice Carl Zeiss lens would be the perfect companion to the A55 body and really bring out what this camera is capable of doing. Therefore I am on the hunt for a nice Zeiss wide angle and will have no problem spending twice as much on that lens as I did on the A55V body. The A55V is just THAT good!  This camera is most definitely worth the inve$tment in great gla$$ and that is probably the best compliment I could give it!For Christmas shooting this year I purchased the Tamron 11-24mm f3.5 and again the A55 performed very nicely with this lens. Can't wait to get this pair out in the open for some landscape and architecture photography. And also picked up the Sony 30mm Macro lens just because it was very reasonable in price for what it does.  Again a great pair.One thing I would like to mention is the very useful and fun Panoramic feature where the camera actually stitches together the frames to create a flawless panoramic shot. It really does work very well both vertically and horizontally. Great for landscapes.The only con I could come up with is that I would like to see the body of the camera made from magnesium (thus 4 stars instead of 5 in this review), but that would probably raise the price to an extent that it would contend with some of Sony's other pro and simi-pro cameras. That said, the body still feels very solid and extremely well built.Sony has truly come out with some innovative guns this last year and in my opinion the A55V is their creme de la creme.  I genuinely cannot wait to see what they have for NEXt year in this line.You can't go wrong here!", "Date": "November 10, 2010"}, {"Title": "Great AF", "Author": "F. Doepke", "ReviewID": "RFYKAD4S17QCX", "Overall": "5.0", "Content": "I love the fast auto focus on continuous shooting (burst mode). Taking picture of our kids running around has never been easier. Video is of great quality - I only wish that the audio would filter out the sound of the auto focus motor.If your wife talks about having kids - make it a condition to get this camera first for the baby photos :)", "Date": "October 29, 2010"}, {"Title": "A Little Powerhouse", "Author": "L. Rothman", "ReviewID": "R15AUBD01SINHZ", "Overall": "5.0", "Content": "Coming from a series of professional DSLR bodies I had high expectations. I had previously used a Micro 4/3rd system for my travel use as it was excellent quality but still had some shortcomings. I handled the A55 in the store with the kit lens first, and fell in love with it over the period of 2 hours of playing around. I did not expect to like it so much. The size was a perfect fit for my medium hands. all controls and button layout are sensible and well thought out. The LCD screen is like a mini Bravia screen providing superb sharpness, contrast and color rendition. The Electronic Viewfinder took just a little to get used to after an optical viewfinder, but honestly it has one serious advantage. In low light you can actually manually focus with it where as the Optical variety is nearly dark. The special features the A55 brings to the table are NOT gimmicks but very effective photographic tools such as the DRO (dynamic range optimizer) the near instant Panorama feature as well as HDR (High Dynamic Range). All worked flawlessly for me without much effort at all. Image quality of the A55 is very high indeed, about equal to my Nikon D7000 in all but the higher ISO's, which I rarely shoot anyway. One thing you can't help but be impressed with is it's shear operational speed. There is NO waiting and the focusing on this camera is as good as it get's. Leagues beyond the Micro 4/3rd or most similar DSLR competition.I've seen reviews and comments about the kit lens being cheap and ineffective. NOT so. It is plastic, not metal, but is sturdy enough to take the day to day use it will see. Better yet it is actually sharper than the Nikon and Canon equivalent lenses I've used. Stopped down renders a sharp image corner to corner, and you can't ask more than that. I really feel in it's price range especially the A55 is in a league all it's own. What else shoots 10fps under a couple of grand or more? NOTHING. It's hard to imagine anyone using this camera wouldn't love it. Oh and not to mention HD video with instant focus while filming. Not gonna get that with any other company except the GH2 Panasonic, and the A55 has too many advantages over that camera for stills to even consider it. I tried one. It's a great design and well executed. Highly recommended.", "Date": "March 2, 2011"}, {"Title": "Very nice but a couple minor flaws - suggest newer model (a57, a65, etc)", "Author": "rtrski \"Who, me?\"", "ReviewID": "R549LNQW05U6S", "Overall": "4.0", "Content": "I've had this camera a bit over a year now.  Did not buy from Amazon but hanging out here more often as a Prime member so finally adding a review.  A bit about me: been using DSLR's about 3-4 years, first started out using Olympus 4:3rds system with the underappreciated E330 (the first and for quite some time only \"true\" live view DSLR that maintained phase detect autofocus while using live view).  So in that sense the Sony SLR and SLT offerings were interesting to me when I decided to leave my newer E-30 and the 4:3rds system entirely for greener pastures.I did look at Nikon and Canon, as of course the '900 lb gorillas' of the imaging world.  But I guess I'm a natural contrarian.  I am neither 'good enough' nor prolific enough (nor $$$ enough) to even look at full frame, so I only considered slightly larger crops than 4:3rds but still, crops.  For the price, and coming into a new system with no legacy glass to worry about, the Sony a55's good reviews and feature set appealed to me.  I actually bought it without even being able to see through the EVF as the store I went to didn't have a charged battery for the sample unit (d'oh!).At this point I've used it about a year and realized that in terms of image quality it provides about everything I could hope for.  Colors are rich, detail is superb (16MP is more than plenty for just about anything, although a few of the newer Sony and competitor offerings are starting to beat that), etc.  Functionally the camera is very nice as well.  I'm not a super-hi-ISO shooter so rarely go above 800, and with proper RAW processing 800 is quite noise free, which is good enough for me.  The EVF is a bit of an adjustment - it can look a little 'gritty' even though it's quite high resolution because it is sequencing thru the colors, so if you move your eye really fast you may see a bit of rainbowing effect.  If the EVF is 'gained up' (shooting in dimmer light) you will see a bit slower updates and sometimes a little tearing through the EVF.  I suspect it might be droppin the frame rate to 'stack' sensor snapshots so to speak.  But that occurs in lighting where a typical crop SLR's optical viewfinder would be dimmer, if more 'optically pure', so that's a trade I was willing to make.Ergonomically the design is great, but a bit small for my hands.  (I'm a fairly tall guy, 6' 1.5\", 230#ish, long fingers)  Compared to my Olympus E-30 (my second DSLR) this seems like a lightweight toy.So, to specifics:Likes:1.  EVF data overlay.  Digital level gauge, Exposure/Aperture metering, live histogram options, and (sometimes, see Dislikes #1 as well) the \"what you see is what you get\" nature of the EVF since it gains the image to try and show you your current exposure settings.2.  Review in EVF.  Can't do this with an optical viewfinder.  Without removing your eye from the viewfinder either autoreview or if you manually hit the review button, you see the image you just shot.  Great for shooting in dark environments or semi-private ones (say at a graduation ceremony) where you don't want to light up the rear screen to see.3.  SETTINGS in EVF.  The \"Function\" button lets you tap, use the cursors to move up/down/left/right, roll the front wheel to pick a given setting within a group, tap function again to exit back to shooting mode (or just half-press shutter).  All without removing eye from viewfinder.4.  Continuous phase-detect autofocus no matter whether you are shooting fast or slow, from the rear screen or viewfinder, \"live\" view or \"traditional\"...the SLT makes it all completely the same.  Yes, the transparent film \"costs\" a tiny bit of light which will affect extreme high ISO shooting.  I bet most people's UV filter costs the same amount....its immaterial.[Overall, you see the top 4 \"likes\" are all related to the entire EVF vs. OVF tradeoff of the SLT design.]5.  The EVF tunnel sticks 'out' a bit which is nice for not mashing your nose against the back.  I suffered a lot of that with my older E-30.6.  There is user-accessible fine tuning of the AF module (do a google search).  You're just adjusting the position and angle of the module - not doing any per-lens calibration - but it's better than nothing.7.  Lightweight8.  Good set of AF points and fast AF response.  Nothing groundbreaking I'm sure, but quite sufficient.  Any focus I've \"missed\" has been clearly personal limiitations and skill, not because \"there wasn't a point there\"9.  A lot of the so-called gimmicky features are pretty nice.  In-camera panos (I especially like that you can do this panning the camera body 'up' or 'down' with the orientation in portrait mode for a better shaped pano).  Twilight portrait and night multi-fire stacking modes.10.  Articulated screen is good, personally I'd say a 'requirement' of any camera that claims to offer live-view like features.  I especially like locking it turned in toward the camera to avoid nose grease prints when shooting a lot, or to protect from extreme sun and minor rain.  (I would not recommend the Sony a35 only for this reason: no screen articulation)Dislikes:1.  This is the only feature that's kind of limited my compositional or shooting ability, and is strongly related to \"like\" #1.  The EVF does a 'what you see is what you get' autogaining of the image to help you see the shot as it will be taken.  While normally this is great - for studio photographers using radio poppers or others using 'manual' flashes, it has a strong flaw.  (In my case, I shoot underwater, with the camera in a housing and external, non-TTL strobes.)  In short: if you are shooting with manual settings because you know you have a flash, but the *camera* does not know a flash is attached (manual sync, not communicating with the camera although it may be mounted on the hotshoe), the EVF 'helpfully' gains the image down to below visibility to warn you the image will be vastly underexposed.  Unfortunately it's wrong, but the camera doesn't know that.  AF points still work and will light up with a half-shutter press...but you're framing sort of blindly.  That kind of sucks.  BUT - while I'm taking a star off of this camera for that reason - Sony has realized this flaw and fixed it in their newer cameras (a65, a77, presumably a57 that just got announced).  They now have the option to disable the EVF brightness link to settings and just reproduce at about the current conditions.  This one feature has caused me some problems, so for those of you looking now (March2012 timeframe) for a used or end of stock a55, be aware of this one difference.2.  Articulated screen hinges from the bottom.  Sometimes gets in the way on tripod plates.  Side articulation might be a tad better.  The a77's \"wishbone\" articulation is better still.3.  As I said body is a tad small for me.  Others might really like it a lot.4.  Does occasionally overheat (after taking >250 pics on a single battery in +100 deg weather and blinding sun at a wildlife park...but still, I'm not sure my Olympus would have done that).  Those taking video have also noted this in other reviews but I don't do much by way of video so haven't experienced that myself.5.  Wish the AF points could be \"grouped\" e.g. not just \"all\" or \"pick any one\" but also \"all\", \"left, middle, or right grouping\", or \"pick any one\".6.  Wish there was a dedicated (or even programmable) button for turning on/off the inbody stabilization.  I do have a hard time remembering to disable it for tripod shots and re-enable it after, or forget to re-enable it after using a long Sigma lens with in-lens stab (150-500mm for example).7.  The video button is kind of easy to hit accidentally sometimes.  I think it should require a longer press or maybe hit video then hit shutter.  I'm sure those who do video all the time might totally disagree with this one though. :DFinal summary: Note that this review is being written in March 2012, with newer SLT offerings out there.  Would I buy this camera again if I had it to do over again a year ago: yes.  I do like it.  Would I buy it *today*?  Perhaps no...but only because I'd be buying a newer model a65 or a77 because of \"dislike #1\" above.  NOT because of anything else wrong with the a55.  So for those of you curious about EVF who don't think that one issue would influence your shooting, I'd say an a55 would be a good purchase.  The 16MPIX is plenty, the AF is still quite functional, ergo and feature set is fine, and you'll save a few bucks vs. the newest bodies.  4-stars, no regrets, and although I'd like to upgrade myself for that one feature I probably won't soon (underwater housings are body-specific and upgrading a body means I also need to convince the wife I need a new $1400ish housing...going to have to wait a little while for that ;D )", "Date": "March 21, 2012"}, {"Title": "Amazing value", "Author": "Theodore C. Kutzer Jr.", "ReviewID": "RK8Y0UOAHHC9P", "Overall": "5.0", "Content": "I bought mine about two months ago and have not regretted anything. I read everything before buying and read the lousy reviews before the raves. I learn whether the naysayers have valid points or are whiners. With this product they are whiners. I say this as I will list their complaints and whether they have validity or not and then tell you why this is worth every penny.The first complaint is the recording time. Read the video reviews for nikon,canon etcetera and you will find that they have the identical complaint about recording time. It is a nice feature and the recording image is the best due to the continuous af and no mirror. As every DSLR overheats in video mode that leaves how it compares to other DSLR with camcorder function. I like the continuous autofocus. This is a personal preference issue. I find that sometimes watching hd sets the soft focus in and out of scenes to be bothersome at times as the image is so clear. If you do not want it to constantly be in focus you can switch to manual focus and pan in and out if you like. The other manufacturers do not continuously auto focus due to the mirror. Their is one manufacturer that makes 50 or 60 fps instead of 30 which I think is Pentax. It is more expensive and has no continuous af. If you need to record 20 minutes mount it to a tripod and turn off the steady shot. If you need pro video you buy a camcorder.They are built to do that. I could address more but space limits me.Flash and portraiture work. If you are a professional portrait shooter shooting fashion models you will not like thiscamera. If you make your living doing this you spend 5000 dollars on a body. This is the annoying fact about flash. The screen blacks out for about 2 seconds between flashes. If you shoot portrait work you are using strobes with a huge battery pack that recycles instantly. You shoot continuously and throw out hundreds of shots for that one perfect shot. If you do that this is not the camera for you. I use my 350 for that work and I have both Norman and Photogenic stobes (7000 dollars worth of lighting).I bought this because it shoots 10fps continuous and every picture autofocuses. The mirror movement even on the most expensive dslr other than the a33 or 55 focuses on the first shot of the burst and that keeps mostly in focus as movement is limited. The advantage of the sony is you can narrow the depth of field and shoot a faster aperature than with any other camera. This makes the player razor sharp and the background like fans a blur and gives you pro shots. You will never miss a good shot. I am assumming that you use a fast enough lens to avoid flash.With the 350 and the a55 I can do anything. Each camera does the extreme shooting the other one does not. Either can be used in tandem on a shoot and you do not need to have 10k in bodies tied up.If you are an enthusiast shooter this does everything that you would ever want and only has minor annoyances. My d1 Nikon was a 6000 dollar body in 2000. The megapixels were so low it was obsolete by 2005. They were so nice they put image stabilization in the lens and not the body ruining all of my lenses. That is something to be upset about.In five years I will be able to buy 100k iso useable in a prosumer body. I don't mind another 1000 dollar investment for that. It beats another 5000. It also beats not having to buy all new glass and the body.This is a great camera for anyone. Casual users can use it for everything. Pros can use it with a second body to cover what it lacks", "Date": "May 11, 2011"}, {"Title": "Intriguing technology in an impressive camera", "Author": "Christopher Nowlan \"I am an amateur photograp...", "ReviewID": "R2J66UY163YW7", "Overall": "5.0", "Content": "I've had this camera for a little over two months now and have little but high praise for it.  While I was looking for my first DSLR, I was drawn to the A55 by its unique mirror design, strong features, and price.  It's hard to tell from product images, but this rascal is small.  As a matter of fact, this body is almost dwarfed by my SAL-18250 even when collapsed.  I'm an average size guy and in reality, the A55 is rather uncomfortable to try and hold with just the right hand because the body is simply that small.  Fortunately, this isn't much of a problem since you aren't going to be holding a camera like this with just one hand for long anyway - you're going to be wanting to take pictures.On that note, I can find no true complaint in the image quality.  In fact, these past two months have given me some of my best images yet.  The GPS receiver works as expected, and is surprisingly accurate.  If you don't give it time to update its location after moving some distance between shots though, you may find yourself having to correct a few locations later.So far, aside from being a bit of a battery hog, the only cons I can really find are in the video capture capabilities.  While the image quality is great, by its nature the sensor will overheat and force a power-down to cool; about as long as I have been able to record video is a little under 6 minutes.  I didn't buy this camera to record much video though, so this limitation is among the least of my worries.All in all, a great camera that is pushing some technology with true potential.UPDATE: Upon a little research, I learned that by turning off the SteadyShot image stabilization, you should be able to get about 30 minutes of video at once. I haven't personally tested this. The camera is still doing great things and I have no regrets!", "Date": "January 24, 2011"}, {"Title": "Best Mid-Range digital SLR Camera (which isn't even an SLR!)", "Author": "D. F. Watt \"dfwatt\"", "ReviewID": "R2BNSD2NVF7MIF", "Overall": "5.0", "Content": "After spending endless time reviewing articles and talking with several camera and photography professionals, I took the plunge, and finally moved up from a point and shoot super zoom (one of the small Nikon P80s) (with the very generous aid of my lovely wife as a birthday present).  It has been truly a revelation, in terms of both video and photo quality.  Like everything else, it's all about tradeoffs.  The larger APS-C sensor (in most digital SLRS and larger format point and shoots) means a bigger body, more weight, larger lenses, and of course more money, but also means much better low light performance, higher detail, and faster performance.But what Sony has done with their APS-C sensor (and by the way they make the sensor that Nikon uses in the 5100 and several other Nikon SLRs) is nothing short of brilliant.  First of all, the idea of a translucent mirror that doesn't have to move, and that therefore provides constant live view and constant phase detection autofocus in movie mode (and also provides 10 frames per second high speed shooting to boot) was a stroke of genius - you do have give up the through the lens view (but get a bright electronic viewfinder that is bigger and brighter than all but the very best SLR prisms and is 'through the lens' too but derived from the sensor).The whole design is well executed, rich with useful (as opposed to gimmicky) features, and provides a rich operating system for those upgrading from small digital cameras, while offering most of the traditional virtues of SLRs.  Software provided by Sony is also quite good, offering many useful editing and other features.Bottom Line -- you get better movie ability and the same photo capability of most of the best mid-range dSLRs, and with a richer feature set.Pros:1) Has won numerous awards (a rare Gold Award from Digital Photography Review, 2010 Camera of the Year from Popular Photography, rave review from Imaging Resources) due to its great feature set, performance, and value for the money2) Great movie capability (excepting one major and one minor issue)3) Great photo capability with many useful modes and special features (including a super panorama mode and a 10 fps high speed mode)4) Easy to use for someone with modest technical ability5) Flexible and powerful for someone with more technical ability willing to master the multiple modes and functions6) Best LCD panel in the price range, fully articulated7) Sony's lenses are relatively cheap and fairly light weight with decent optics and performance (compared with Canon & Nikon)8) Good (and fast) autofocus9) Neatest feature (among many) - automatic activation of electronic viewfinder and deactivation of LCD by proximity to the eyepiece -- EVF turns on as you get near it)Cons:1) When using IS (image stabilization) in movie mode, camera sensor heats up quickly, limiting movie length to a few minutes (29 minutes max without IS)2) Modest battery life, esp. if you use the great LCD a lot (can be turned off)3) Limited control in movie mode, and only two file formats (AVCHD AND MP4) and three file resolutions4) Limited playback options for movie files from within the camera5) Mild tendency towards overexposure in bright conditions (easily corrected)6) Movies can get lens noise introduced, requiring external mic for best sound", "Date": "May 14, 2011"}, {"Title": "Great for video but has its shortcomings", "Author": "Matt Roseboom \"Editor/Publisher/Photographer\"", "ReviewID": "RP352U2O0CPAT", "Overall": "4.0", "Content": "I just got this camera a couple of weeks ago. It's great for video with a couple of things to watch out for. This camera's auto-focus during video is the best I've ever seen. I had the Panasonic GH1 and this one is better. But the focusing can be heard during video if it's shot in a quiet area, and the camera overheats and video stops after about 20 minutes if steady shot is turned off and even sooner if steadyshot is on. So for short videos in a not too quiet area, it's great.The photos have been great so far. I'd like to use the autoreview function after taking a photo but it takes too long to be able to take the next photo with it on. The panoramic sweep function works great.", "Date": "December 26, 2010"}, {"Title": "Excellent camera", "Author": "Thomas B. Cass", "ReviewID": "RWJFWUJ8868CN", "Overall": "4.0", "Content": "I've been using SLR/DSLR type cameras for over 40 years. I have to say this camera is as good as any I've ever used. It focuses lightning fast and very accurate for both stills and video. It's IQ is excellent to iso1600, very good at iso3200 and good at iso6400. Video quality is also excellent. The EVF is bright and sharp in all but dim lighting where it gets a little grainy. Overall I would say it EVF is better than other under $1000 OVF DSLR's. Features like auto HDR and auto panorama work very well. The menu system is well laid out and easy to navigate through. Most settings are visible in the EVF as well as the LCD. When you change exposure the results of the change is visible in the viewfinder, something not true with traditional DSLRs. The only real fault I can find with the camera is a very slight but noticeable shutter lag when using the built in flash. Because of that I rated it a 4 but if I could I would rate it a 4 1/2.", "Date": "December 15, 2010"}, {"Title": "Ultimate Photo Shooting Machine", "Author": "S. M. Yasin Rahim \"Yasmagic\"", "ReviewID": "RZYLCNW523QIP", "Overall": "5.0", "Content": "Wow, what can I say about this camera. After reading all the possible reviews out there for Nikon, Canon, and Sony cameras, I ended up buying this camera. In a nutshell, SLR camera's are like LCD TVs (old technology) and SLT cameras are like LED TVs. :)This camera is little smaller when compared to Nikon 5000 camera. To compliment this camera, I bought Sony SAL18250 Alpha DT 18-250mm f/3.5-6.3 High Magnification Zoom Lens w/Lens Hood, which produces accurate and ultra super photos.I also bought Sony Alpha Soft Carrying Case for DSLR, Tiffen 62mm UV Protection Filter and Sony 16 GB PRO-HG Duo HX Memory Stick MSHX16A (Black) along with this camera.Pros:1) Fantastic Translucent Mirror Technology2) 10fps shooting for this price (compare at $5000 cameras)3) Phase Detection, SteadyShot optical image stabilization, and 3D Sweep Panorama4) Electronic view finder for shooting and viewing the photos5) Full-time autofocus, face detection, and smile detection6) Continuous shooting as well as allowing full-time AF during live view and movie capture7) Records AVCHD video at 1920 x 1080 (1080i, 60ps) with stereo microphone and also supports MPEG movies8) New Auto+ mode makes multi-shot exposure modes possible automatically without owner intervention9) Good body-based image stabilization system further extends low-light capabilities10) Built-in flash can wirelessly control remote slave flashes11) An integrated GPS allows for automatic geo-tagging of stills and videos.12) Face Recognition Technology, can detect up to 8 faces13) Li-ion power source (330 images with viewfinder, 380 images with LCD monitor)14) Memory Stick PRO Duo, Pro-HG Duo, PRO-HG HX Duo media as well as SD, SDHC and SDXC memory card slotsCons:1) Grip might be too small for some2) Plan to go broke buying better lensesThis will be THE one camera, that you won't upgrade for a long time for sure. Have Fun!", "Date": "November 15, 2010"}, {"Title": "Best Sony camera yet!", "Author": "David Gerrold \"David\"", "ReviewID": "RIHG060GY9NXH", "Overall": "5.0", "Content": "My first Sony was a DSC F505, then an F717, and after that an F828 which still serves me well after all these years.  Last year I decided to upgrade and I was about to purchase a Canon EOS-7D, which turns out professional quality HD-video.  (We used it successfully on a project last year.)  But then I started looking at the Sony A55 and after doing some serious research into its specs, I realized that it would probably be a much better camera for my needs.  Smaller, lighter, faster burst mode, and with faster auto-focusing.  Plus, the translucent mirror makes that autofocus available during video-shoots.  The translucent mirror seems to me to be a much better engineering solution than a moving mirror.  (Others may feel differently.)Price was also a consideration here.  Based on the reviews, based on the various spec-sheets, based on everything I could find out about this camera, it would serve me even better than the EOS-7D for about half the price.I bought the Sony A55 the day before Christmas and without more than a cursory glance at the manual, I was snapping photos that night at a family Christmas party.  Usually, my family complains about the flash, so I turned off the flash, pushed the ISO, adjusted the white balance, and got some of the best holiday photos ever.  The A55 gave me sharp pictures every time and a lot of fun video too.  Christmas day, even more great pictures.I've since used the camera for a lot more family photos, for a bunch of experiments with its different features, and taken it on several trips.  I took over 200 pictures at Graceland (all without flash) and got great exposures every time.  (My son loved all the pictures of Elvis' cars.)  I've also begun using the A55 for some professional work and I've been very happy with the high resolution, the clarity, and color balance.  It's fun to put these pictures up on a 30-inch monitor and see how good they are.Others have written in great detail about the specs of this camera, and I appreciate all that detail and research.  Ultimately, though, after studying all the spec sheets, the value of any camera is in what happens when you finally get it into your hands, how you use it and the results it produces.  I've gone through a lot of cameras in the last six decades, each one better than the last.  I expected the A55 to be good, I was surprised at how good -- not just in the quality of its pictures, but with all its various featurs and functions.  I'm still discovering what I can do with it, but I particularly like being able to take great indoor pictures without a flash because I love to snap candids.The only quirk I might mention is a personal one.  I was so used to the tilting body format of the F717 and the F828 that it has taken me a while to get used to the view-panel arrangement on this camera.  But I already knew I was going to give that up when the DSLR format became the standard for high-end cameras.  This is a five-star camera and anyone who cares about taking good photos is likely to find the A55 useful and versatile.  Like all good cameras it takes some learning but I cannot see anyone being disappointed in it.  This would be a great camera at twice the price.", "Date": "March 7, 2011"}, {"Title": "Great camera - revolutionary concept", "Author": "Tim J. Mueller", "ReviewID": "R2F33Y3XQ5LLHK", "Overall": "5.0", "Content": "This camara intrigued me enough to switch from Canon. I have only used it for 500 exposures, so I'm still getting use to this camara, but here are my first impressions:1. I love the Geo tagging (gps info added to the images) As far as I know this is the first DSLR/SLT camara that has this build in - Canon requires a very expensive grip and you still need an external GPS receiver.  Nikon has a slightly better solution, but it is still external.2. The view finder is cool, but I come from a full frame camera which also had a good view finder.3. The image quality is on par or better with this price range camera. I'm using \"EX\" sigma lenses not Sony (Also very happy with the lenses)4. Love the rotating rear display. I shoot some glammour this weekend and all the Canon and Nikon guys where laying on the floor to get low angles, then there where all looking at me when I  just fliped the screen to see it from top, held the camara low and started firing away, it was a subject of conversation.5. Build in image Stabilazation is another great feature to this and other Alpha cameras. I had to spend so much extra money when I had my Canon to get IS featueres, not here.6. The video was probalbly one of the other things that made me switch. My Canon took outstanding full HD1080p video, but focusing was a big issue as well as video transfere to my Mac, to do it right you had to import it with the Canon software and the export it from there - what a pain. I can work stright with the AVCHD video in Imovie or Final Cut Express (it is only 1080I or 760p) The 760p can be directly imported into aprature (AVCHD is not recognized?)7. Panorama and HDR fetures are outstanding and blow my Canon awayThings that I do not like:1. Video has very limited time before you have to take a breake or it overheats (9min +/-) - they do not advertise that ;) . So do not think that you can through away your camcorder just yet. There are lot's of discussions about the lack of manual control, it is not a big deal to me.2. It is not a good studio camara. When I put the camera into manual control and set the settings to work with my studio strobes, I hardly see my model in the viewfinder or display. I have to use low aptreture settings or high ISO to be able to see anything, missing out on details. Now this camera is not advertised as a pro camera and it is a great alaround and travel camera, but I thing this is just a limitation of the SLT technology, since the viewfinder is a mini display and not a glass prism. (I will edit this review, should I find a work around for this) - Edit:  Listed in the comments are some discussions in reguards of this point.3. Tha lack of a grip - I have big hands and this is a compact camera and I love grips even for bigger cameras.All around I thing this is a lot of bang for the buck and has unique features theat easily off set the down sides. I can't wait to see how Sony is going to further develop this and their other Alhpa cameras.", "Date": "January 17, 2011"}, {"Title": "Great Camera...", "Author": "ilker", "ReviewID": "R1BMJYLM2XZR18", "Overall": "5.0", "Content": "Lots of features..Panaroma, Hdr, GPS, multiframe noise reduction, impressive iso performance etc...and also small body and excellent build quaility. I compare it with Canon 550D and now with Sony A55, I am definitly happy.", "Date": "November 19, 2010"}, {"Title": "Lots of Features for the Price", "Author": "M. Kuhl", "ReviewID": "R16RNVMRNHQ5KT", "Overall": "3.0", "Content": "Pros: Small and Light weight, Lots of features such as movie, HDR, Panorama,10fps, horizontal/vertical leveler etc. Good display of menu info.Cons: Based on using JPEG & RAW and #6 high speed card. You get about 300+ shots on a battery. Transfer from buffer to card is slower than A700 using cf card. Panorama mode really sucks battery as well as movie. Panorama mode should be on a tri-pod for best results. The panorama has to be moved at a fairly constant speed and not very fast or else it shuts down and you have to start over.The layout of controls can be a little difficult to manipulate unless you have small long fingers. It seems every time I take a photo I wind up changing things as my thumb always hits the control button and when I want to change f stops or shutter speed I wind up turning the camera off with the off/on lever just above the thumb wheel. It is not water/dust resistant as there are holes on the top of the camera for microphone etc. You cannot use an external flash such as studio. The hot shoe is your only choice for flash and all other flashes that work with previous Sony cameras will not work on this one. You have to buy a dedicated flash specifically for this camera! You can buy a pc hot shoe adapter from Sony for about half the price of the camera.The electronic viewfinder will blow out on high contrast scenes. The brights will completely wash out and the darks will be black making it very difficult to compose the photo. Adjusting the exposure comp will also change the viewfinder. If you go down 2 stops the viewfinder becomes very dark.It is a good camera but I think it was rushed into production without real world testing. They should've left the controls like the A700.", "Date": "June 24, 2011"}, {"Title": "Fast...very, very fast!", "Author": "Amazon Customer", "ReviewID": "R2ZSLQFZ9WTQEP", "Overall": "5.0", "Content": "Two year olds move fast...this camera is faster!!  Just what I needed to catch really great shots of my grandchildren.  Not cheap but a lot of fun.", "Date": "October 29, 2010"}, {"Title": "impressive little camera", "Author": "J. Bailey", "ReviewID": "R1HX4B9KYSSCNX", "Overall": "4.0", "Content": "I recently bought my A55 at local retailer, as a replacement for my aging Minolta Maxxum 7D.  In the past I have owned the Sony DSC-R1, A100, and A700 but had sold them to pursue other interests, keeping the 7D and the Sony DSC-R1.  Recently I had been frustrated with focus issues on both cameras in low light, along with unusable photos at anything more that ISO800.  (the R1 is better than the 7D in this regard)  I fondly remembered my A700 and wished for it back.So I thought I'd step up and buy another Sony to improve my chances of getting decent low light shots.  Nikon and Canon were out of the question because I have several beautiful examples of Minolta's A-mount lenses that I refuse to part with.  Reviews looked very good for the A55 so I bought one.Here's what I really like about it.1.  Focus magnification - when I use my manual focus lenses I can confirm focus very accurately.  I can't count how many shots were slightly out of focus when using my 7D2.  image quality is miles ahead of my other cameras at iso1600, and 3200 is usable, better than 1600 on the 7D and R1.3.  exposure control is very good, even in difficult light, and even with my manual lenses which have no electronic connection to the camera.  The 7D always drastically underexposed with manual lenses.4.  the electronic viewfinder is excellent.  the R1 has an electronic viewfinder which isn't as good, so I was a little worried about this.  But no need, its great.5.  the size of the camera is great, very light weight, especially compared to the 7D!!6.  i love the tilt / turn screen for low angle shots close to the ground.Some stuff I don't like, or wish was different.1.  bracketing is only 3 steps, only up to +/- .7ev.  Sometimes I want more for good HDR shots.  The camera is so fast, taking 5 bracketed shots should be a no-brainer.2.  the 7D has buttons for everything, very easy to change settings on the fly very quickly.  The A55 requires use of the admittedly simple function button and menu for a lot of these changes.  It is the biggest change for me.  Even changing the focus area on the 7D was almost instant and intuitive, the A55 requires a bunch of button presses.  The DSC-R1 has a dedicated exposure compensation wheel under your thumb, on the A55 you press a button then turn a wheel.  Of course the small size of the A55 makes external buttons for everything difficult.I tried one brief video clip, it seems almost as good as my little point-and-shoot Canon sx130 for video.  I won't use video much so I really don't care.  I haven't tried the continuous shooting mode yet.  I did try the Pano thing, and in-camera HDR, and they seem to work as advertised, although I can't see myself using them much.I would go for 5-stars except for the control button / menu thing.  I am sure I will get used to it, but at the moment it frustrates me trying to change settings quickly while photographing, especially when there is a time limit.  (high-school show choir as an example, gotta be quick or they move again!)That being said, I can get images from the A55 that just aren't possible with the 7D and the R1.  If somehow the workings of the A55 could be installed in the body of my 7D, I'd be in heaven!!", "Date": "March 25, 2012"}, {"Title": "So very pleased with our new A55", "Author": "Bruce J. Prestidge \"RC Flyer\"", "ReviewID": "R24OSLPJZCZF", "Overall": "5.0", "Content": "My wife is a small business owner and she takes photos, prints them and mounts them on quality greeting cards. She couldn't be more pleased with the new A55. We upgraded from the A100 and A200 to get this camera. The features are easy to use and the results are wonderful. We have a great variety of Sony and Minolta prime lenses and the sky is the limit on what she can do with the A55. Priced right and superb results from this camera.", "Date": "November 25, 2011"}, {"Title": "Great camera, even for an amateur", "Author": "jaypath", "ReviewID": "R1YRUA1S4DSEOF", "Overall": "5.0", "Content": "To put this review in perspective I should start by saying I'm a complete noob with cameras/photography. This review is for other noobs who are looking into their first \"fancy\" camera (that's noob for dSLR). We had a nice/easy point and shoot that got the job done. Then we had a baby, and the point and shoot was just too slow to be useful (I've been told that dSLR cameras aren't really faster if you prefocus, but see below).I bought this camera as part of a kit (with a camera bag, kit lens, additional zoom lens) - which saved 100-200 dollars. Probably worth it, though I never really switch the 18-55 kit lens...As for the camera, from my research the A55 was the best camera for us (small, great pictures, a lot of options if we learn how to use them - but an \"idiot mode\" if we dont). Again, I have no idea if that was appropriate, but as a noob, let me say this camera is easy to get up and running. It's a little hefty/awkward coming from a point and shoot, but then again this is one of the smallest dSLR cameras we saw. The picture quality out of the box is great, and in minutes I had learned about depth of field (just from the crappy manual) and got some great, crisp pictures of the baby with a nicely blurred background. On top of that, there are some \"gimicky\" features that I love... smile detection to trigger the shutter... in-camera panorama shooting... a GPS... Yeah you probably don't need them, but they're surprisingly cool/useful.Then on to the camera speed, the reason for this purchase. Before buying this camera, I was told that a point and shoot can be just as fast as a dSLR in the right hands. That may be true, but in my (admittedly novice) hands, this thing is blazing. This camera can take 10 frames per second for about 2 seconds... and if you have a high speed rugrat, you know that's the difference between a bright smile and a finger up the nose. Auto focus time is also notably faster than my (dated) Lumix point and shoot, though still a bit too slow to capture the \"quick, get the camera\" moments. But then again, it's a breeze to manually focus and completely eliminate focus time altogether.If you, like me, don't know what you're doing with cameras, here's my 2 cents:Pros:- the camera is really small/light for its class- The LCD screen rotates in any direction (so you can take GOOD pictures of yourself!)- the kit lens (which will be mocked by your snobby photography friends) still takes better pictures than your point and shoot- has fancy features (like gps) that will make your snobby photography friends jealous - though you may never use them- some of the fancy features are surprisingly within your understanding, right out of the box- makes taking pictures more fun!- you can partially justify this purchase because you won't need fancy mall portraits of the family (this camera has a timer and even remote control - sold separately but cheap)Cons:- If you're reading this, then can you really justify this purchase? Seriously, most of the features are wasted on you.- You may need to take a photography class to understand everything- Its made of plastic. One slip of your grip and your wife will realy be mad about this unwarranted purchase. Then again, it seems to be just as durable as other cameras in this price range.- the viewfinder is not optical, meaning it's just another version of the LCD screen. That's inherent in the way this camera works (the translucent mirror). I won't (can't) go into any more detail, but what this means is that you can't frame a picture when the camera is off.- let's face it... as fancy and great as this camera is, it's not going to be in your pocket when the kid decides to take his first step at the grocery store... If you can only have one camera, get a pocket size point and shoot.nitpicky stuff...- the lens cap doesn't come with a string to keep it near the camera. highly recommend spending the extra $2...", "Date": "July 22, 2011"}, {"Title": "I'm more than pleased...", "Author": "Luis Fernando Gomez Morin Duarte", "ReviewID": "R2FF1AQGZ6O36J", "Overall": "5.0", "Content": "Actually there is no much to say about it. I've had it for almost 2 months and is my first DSLR. Despite some friends' recommendations to buy a Nikon or a Canon, somehow I'm \"married\" with Sony considering it a great and innovative brand. The camera fits perfectly my needs and though the lenses are quite expensive and limited, I don't complain. However, I should warn buyers to consider buying it with some other kind of lens instead of this 18-55mm. It seems to have a mechanic flaw when trying to adjust the range. It doesn't slips smoothly and will take you a little more time to fit the picture at your range need.", "Date": "July 1, 2011"}, {"Title": "Top quality at reasonable price", "Author": "Paul Trehin \"PauldeNice\"", "ReviewID": "R2AC8FJB9SDRFQ", "Overall": "5.0", "Content": "This camera body is even superior to the already excellent Sony Alpha 550. Higher picture definition, faster autofocus, has a video function that was not there on the Alpha 550. In addition that video functions provides a smooth continuous autofocus while shooting video.Only problem if one can call that a problem... The body function's qualities demand top quality lenses1/ to take advantage of the sensor's high definitionAnd2/ lenses with great capacity to follow the super high speed Sony Alpha 55's autofocus.Some low cost lenses can't match either of these two conditions.I use the Sony 16-105 transtandard zoom which is an almosr do all lens from a very good wide angle 16mm(24mm equivalent) and a medium telephoto lens: 105mm (157mm equivalent) (the Sony Alpha 55 as well as many other expert DSLR uses an APSC sensor which multiplies the focal length by a 1.5 factor.As second lens I use a Tamron 10-24(equivalent to 15-36mm)I have a \"low cost 70-300mm(equivalent to 105-450mm)but its quality is quite inferior to the Sony Alpha 55 body capabilities (or for what matters the Sony Alpha 550 body) Anyone interested in this type of zoom would be better off buying the Sony 70-300mm G series zoom. For Nature and animal photography the Sony 70-400mm G series zoom is super excellent and vastly justifies its high price. But only for photographers who need such long telephoto lenses; indeed 70-400mm isequivalent to 105-600mm... Thanks to the top quality internal body image stabilisation and the ultra high speed autofocus, this lens enables shooting distant animals very well, although such animal shooting requires some experience of the domain.", "Date": "February 16, 2011"}, {"Title": "Great Camera, Can do Better on Price", "Author": "Snow Queen \"Loonatic\"", "ReviewID": "R3H3UXSOJRJZX3", "Overall": "5.0", "Content": "It's a great camera but get the extra battery.  And you can get it for about $200 less from B & H.", "Date": "October 26, 2010"}, {"Title": "Just what i was looking. Could've came with a better lens.", "Author": "Marie", "ReviewID": "R2HFH7PH2M1YXG", "Overall": "5.0", "Content": "Well I was looking for a compact interchangeable lens camera that had fast shutter, image stabilization, (low noise in high iso), good quality images, and easy to use/learn. Sony NEX menus were complicated, Panasonic not good enough (LNIHO), Olympus not good enough-but they are more creative with their effects. (In the future I'll get one for that.) Samsung slow processing. Nikon too damn high and barely any lenses. I wasn't trying to spend 600. Just under and I had not much of a choice but to go with a small dslr and this one overall seemed small but great. Could've went for higher sony alpha models but weighed more, got more bigger. So I settled for this and I'm glad I did. I really like the 3d effect on every picture. You can see it when your just using the viewfinder. It's damn near awesome. Videos are good, fast AF, easy menus, good enough in iso, and very fast camera. The seller I bought this from didn't have a CD or manual in the box, but it's easy to learn if you spend some time learning the basics of photography and using it like you know what you're doing. Like that the iso is a button and not that annoying turn dial with the numbers on it. I have small hands. And its a perfect fit. So I love this camera. May upgrade if I get more experienced one day, but i'm a beginner and this is my first dslr and i love it!", "Date": "June 2, 2012"}, {"Title": "Awesome Camera.. making it all so easy.", "Author": "tuspan \"tuspan\"", "ReviewID": "R1SO9Y188ZRUU0", "Overall": "5.0", "Content": "I bought the Sony A55 with the dual lens kit after testing out the following:- Nikon d5100- Canon 550d or T2i in the US.I know the A55 is a 2010 model but still being sold in late 2011, but the technology this camera offers is amazing.  It is definitely faster then both the other competitors in Auto focusing and continuous shooting, this is largely due to the translucent mirror technology they use.  Looks like Nikon too, is looking into this technology.I have a 6 and an 8yr old therefore wanted something that I can use at birthday parties and on the fast paced sports field shooting and video with auto focus.  After reading all the reviews and testing it out for myself, the A55 was the obvious winner. Not to mention the easy menu system that this camera has.  It makes everything just so easy to understand.The Nikon and the Canon are both very good camera's too, but in my opinion they are better for slower moving objects and taking shots of still things like buildings/scenery.  Therefore the the Nikon and Canon were not for me.  If I did not have kids, then I would definitely have gone for the Nikon d5100.BTW. The sweep Panorama is so easy to use, better then doing photo stitching on PC photo editor... you can get the whole playing field in one shot.. totally amazing.", "Date": "December 29, 2011"}, {"Title": "Great camera for the money", "Author": "Paul", "ReviewID": "R2BLT3WQC416Z4", "Overall": "5.0", "Content": "This one is really compact and easy to operate. I own Nikon D70s and I am going to sell it now - too heavy, too big, to many buttons to deal with, no video.Video and stills are astonishingly good on this Sony, I tried Canon D60 with 18-200mm lens for video - it's a disaster - lots of noise, no real auto-focus, frankly speaking stills are no better with Canon either, because the kit lens is very poor - slow, dark, heavy.My only complain with this camera is battery life - could be better, but taking into account its size and technical advancements in this camera - fixed mirror, 100% view EVF, DHR, panorama, GPS etc. - it's understandable.", "Date": "August 20, 2011"}, {"Title": "Great camera", "Author": "Fr Matthew Green", "ReviewID": "RH9H1M8BK6U9X", "Overall": "5.0", "Content": "I purchased this camera half a year ago, and have made fairly frequent use of it at home and abroad.  I chose it for several reasons.  I had been using a Sony a300 for a couple of years (until it was broken in an accident), and had used several Sony cameras in succession before as well, so I was familiar with the way Sony cameras work, had lenses that would fit this body, and had good experiences with the quality of the manufacturing. Also, I was impressed with the range of innovative features the camera offers, which seems unmatched in this price range. After reading several very positive reviews, I had high expectations.Fortunately, those expectations have been met. I am very happy with the photos this camera takes.  I often utilize the built-in HDR function, and although the resulting photos need a bit of post-production to satisfy me, they are a great starting point for striking photos. The special low-light handheld mode produces surprisingly good results, sometimes yielding usable photos even in very dark environments (not usable for professional purposes, perhaps, but good enough for personal use).  Thanks to the HDR and low-light mode, I should have left my tripod at home during my recent trip to Ireland - I never needed to use it.  I also really appreciate the on-screen digital level, which helps me keep the horizon truly horizontal when I want it to be (and the cool overlay makes me feel like I'm flying an expensive aircraft at the same time).  I have not had big issues with the battery life (which is one of the most common complaints I'd seen when I bought it), but that is probably due in part to the fact that I usually shoot using the small EVF and not the large LCD screen on the back of the camera. I only use the big screen for changing settings or reviewing photos, or for very specific photo setups where it is inconvenient or uncomfortable to use the small EVF. However, the fact that the LCD screen swings out and turns around is priceless when you need it.My one complaint would be that I don't like the placement of some of the buttons and dials. I think the setup of the a300 was somewhat better in this regard. One of the dials is a little uncomfortable for me to reach while shooting without shifting my grip back and forth, and some of the buttons are easy to bump accidentally while shooting in the profile orientation.  However, these are minor complaints. If I were purchasing again today, I'd still buy this camera.", "Date": "August 6, 2011"}, {"Title": "A really slick little camera.", "Author": "G. Werntz", "ReviewID": "RXK9UU7X3MZBF", "Overall": "5.0", "Content": "I've had my SLT A55V for about a month now, and I really enjoy using it. I primarily shoot my kid's ballgames (8 & 10 year olds), and the features in a camera I need the most are fast autofocus and the ability to shoot frames rapidly. This camera is very good for both of these features. The camera also produces very little noise on high ISO equivalent settings, so taking shots even in low light produces very good usable images. I was also surprised at how good pictures look with the built in flash. In many cases, an external flash could be dispensed with. If I have any criticism of the camera so far, it is that it is a battery hog. So if you decide to get the camera, you should buy an extra battery or two.", "Date": "April 25, 2011"}, {"Title": "GREAT VIDEO AND A GOOD DSLR", "Author": "mars198 \"photomars\"", "ReviewID": "R2SPRB2SEK0VLW", "Overall": "4.0", "Content": "After owning this camera for a couple of months, I sold it.  The camera is speedy and takes decent photos.  It excells at taking video.  If you want a video camera that doubles as a decent dslr then the a55 is a great choice.The camera is very fast,  It is excellent in handling and in it's features.  There are tons of lens choices for this camera.  My issue simply became image quality.  I previously had a Sony a500 and didn't like it because of the image quality.  After a couple of months with this camera, I would look at my pictures and realize that something was missing.  They seem to have a lack of depth and quality.  I shot with several lenses and the same was true in them all.I have since upgraded to a Pentax K5 and I have the depth and image quality I was looking for.  And amazing high iso shooting - through iso 6400.  Amazing.The a55 is good through iso 800 to 1600.  It is crippled because of the translucent mirror.  Check out the Sony a580.  Same chip I believe but higher image quality.The strength of the a55 is the video.  If you are an average shooter than this is a great camera for you.  I really would recommend the a33 because of it's lower price and the fact that the image quality rates only 1 or 2% lower.", "Date": "April 7, 2011"}, {"Title": "incredibly awesome", "Author": "humblgumbl", "ReviewID": "R3QJ2IJAQJKF2U", "Overall": "5.0", "Content": "im not gonna make a long review i'll just give you a little taste of the videofunction (insert /watch?v=5ELWb6wVupQ on youtube) which is, in my eyes, mind blowing if you have a good lens: at least f2.8 or better.i am using tamron 17-50 f2.8 in this clip and it is great!this camera is a dream to all creative minds because compared to canon 550 D or even canon 5d mkII the focus is done by the camera, which leaves room for much more interesting camera movement, and as you can see in the video it is superfast and accurate! sony has really outdone themselves by making this camera!!also the avchd is a good compromise of size and quality and the 50i images are calculated back to 25p (30p in america) by imovie, which is very convenient and abolishes any ghosting in the shots!also for photos the camera is excellent! all in all this camera is one of the best things i bought and i recommend it to all of you, but make sure you get a good lens as well. this camera is wasted if used with the kit lens!insert /watch?v=5ELWb6wVupQon youtube to see a video i made for a friendgreetshumblgumbl", "Date": "January 23, 2011"}, {"Title": "Not quite as wonderful as I expected.", "Author": "Bruce Bevitz", "ReviewID": "R2WC2PCBKU40YG", "Overall": "4.0", "Content": "I bought this camera because I was tired of lugging a video camera along with the still DSLR camera. In doing my research I saw that the SLTA55V maintained focus during the filming of videos while it's conventional DSLR counterpart did not, and that there is no mirror slap because the mirror was fixed. However, I had a few issues  with this admittedly good camera.The battery life is Atrocious with a capital A! I have had several DSLR cameras starting with Konica-Minoltas through the Sony alpha 700. Their batteries lasted for much longer than this camera's battery.I had to upgrade the firmware on purchase. This should not have happened in a camera so recent, although I recently found out that this camera has a successor unbeknownst to me until this week. To me,firmware upgrades instill fear and uncertainty. I am afraid if I do it wrong, I 'll brick it.There is a lag between putting the camera to your eye and seeing a view through the viewfinder. Until you push down slightly on the shutter release you see the previous picture- a bit confusing and disconcerting.  There is no picture in the viewfinder when the camera is off. I guess that's what you get when you don't have an optical viewfinder.Some of the software included does not support 64bit Windows 7. Duh! You can't export the video to your computer unless you use the Sony software. If you transfer the files by any other program, or drag and drop, the video files are not seen. I had to download all of the files to a folder, then move the video files to another folder so that I can be edited by Nero or Pinnacle. Another Duh!I used a few of the novelty settings. The Panorama is good, but I really did not explore many of the others. They seem to be modifications more appropriate to be utilized by an editing program. When you want to take pictures of wild animals, you can't ask for a re-take if you don't like sepia toned whales or pictures of grizzlies using the old fashioned photo mode!Complaints aside, I enjoyed taking pictures with this camera under difficult conditions. It is light and agile, it was easy to learn the controls The picture quality was fantastic. I am glad I purchased it.", "Date": "September 10, 2011"}, {"Title": "Finally satisfied! but...", "Author": "Bhoomireddy", "ReviewID": "R1SW41MEFQXHMV", "Overall": "4.0", "Content": "I bougtht a 60D and D7000 before i tried this. That says I am actually just looking for a mid level Slr which can take good pictures and HD video.Returned 60D because..Lack of auto focus in video is actually more cumbersome than i thought. I am not a pro, just wanted to take some good videos without having to carry extra camcorder (I have a Sony SR11)And Canon released t3i with most of the 60d features. But barring that, lack of autofocus was big in my decision.When it comes to images, this is a rockstar. But...Returned D7000 because..Kit lens (18-105) is bad, light falls off at edgesAutofocus in video is a jokeNormal focus had issuesWant to keep Slt A55 because..Brilliant fast auto focusImages are right up there with above 2Build is not that great, but hey for what i paid, i dont expect muchI bought a Sony 16-105, an amazing lens, quiet focusStill didnt try the panaroma/ GPS.. thats a bonusAnd who should buy this:SLR like imagesEasy operationAuto focus video - a good one, not like D7000Looking for new technologyLight weightNot for: Professionals who want to make a living out of itI know traditional diehard Canon/Nikon users want this to fail. But after trying all of these 3, this definitely has a market of its own. And should apprecitae the innovation to make lightweight SLR/SLT.Edited: Sorry, after a month of usage, gave it 4 stars, realized there is shutter lag issue which will be major with moving objects. The battery is bad, flash is not powerful enough. Video is amazing to put it simple.", "Date": "March 10, 2011"}, {"Title": "It's a great camera", "Author": "Scott D. Kilbride", "ReviewID": "R3CY028GA8J2YI", "Overall": "5.0", "Content": "It's a great camera for the money i have a55 a65 a77 i use tamron lens, don't like sony lens. I shoot a lot of high school fast action sport , my next camera going to be the sony a99 it's a full frame sensor.", "Date": "April 10, 2013"}, {"Title": "Sony SLT-A55V", "Author": "G. Olson", "ReviewID": "RQSKMMX43FQOA", "Overall": "5.0", "Content": "I bought this from Amazon Warehouse Deals...used. I have owned several DSLR's and a multitude of slr 35mm cameras. I have shot both digital and film astrophotography. I shot mainly \"available light\". I developed my own film, b/w and color. Simply put, I was blown away with the results with this camera. Having spent many hours behind a computer 'stacking and registering' shots. The A55 does this internally, incredible time saver and great results. Very satisfied with my purchase. I have read the negative reviews for the A55 and wonder if they thought they bought a 'point and shoot' instead of a real camera. Sometimes you have to read the manual. Bravo Sony.", "Date": "March 29, 2013"}, {"Title": "Very good camera for the money.", "Author": "Robert Kennedy", "ReviewID": "R33I42MKD5ZBY6", "Overall": "4.0", "Content": "I have a Nikon D60  and I have tried the Nikon D7000 and others ,the Sony a55 is a great camera for the money,I had some minolta lens that work great on the sony I do alot of Bird Pics and the sony is very fast and easy to handle.I don't really care for the EVF but it works for me .I bought a reconditioned  camera with 18-55 lens for less then $400. that I consider a good buy.It came with a very good charger.Iam over 80 years old and I like things easy to use and this works for me.Keep in mind todays cameras all take great pictures.", "Date": "February 13, 2013"}, {"Title": "Great DSLR camera", "Author": "jbooks", "ReviewID": "R1PDCR0OOOD740", "Overall": "5.0", "Content": "I am a professional portrait photographer and use this camera both professionally and personally. It takes great low light images and I also love the tilting LCD frame. I would recommend picking up an extra battery if you are going to be out and about shooting for more than a few hours, but other than that I have no complaints with this camera. For the price, I think this is one of the best DSLR cameras around.", "Date": "January 18, 2013"}, {"Title": "Great Mid Range.. semi Pro Cam", "Author": "Videocat", "ReviewID": "R3TP2SMBMI34CZ", "Overall": "4.0", "Content": "I purchased this Sony Cam on Amazon about two months ago. I had wondered if in almost ten years, my trusted Canon 300D, could be improved upon. The answer is both yes and no. The Alpha 55 is great in low light, has excellent reproductive fidelity and does some extraordinary things, including GPS registration.On down side and its only because I also am a beginning film maker, the video does only allow about five minutes of filming before the camera over heats. I am told this is fairly common in cameras that are DLSRs and do HD video.The other issue, sadly, the audio sounds like its inside a barrel. Even my small Canon R20 has better audio. So the engineers just didn't figure this camera would be used as a serious video production unit, I guess.I also own more expensive Sony NEX VG 10 and it outside of some erognomic issues, is a pro Camera, with broadcast quality audio and video.My next camera when and if I can ever let my Canon 300D retire, will be the Canon 7D.", "Date": "July 10, 2012"}, {"Title": "Great much-needed upgrade!", "Author": "Sadie Talbot", "ReviewID": "R28ET9FUX6BHB1", "Overall": "5.0", "Content": "I've been using a Sony A230 (my first DSLR) and have been wanting to upgrade.  I found this item and have been wanting it because it seemed like a good step up.  I was so right!  I'm a stay at home mom who does some photography on the side, I'm pretty new to it, I shoot families and individual portraits.  I also do some nature shots in my free time, but don't really do much other than share them on Facebook and such.  I haven't taken it on a shoot yet, but have taken plenty of pictures of my kids and nature near to home (birds in the trees, sky, etc) and LOVE IT!!  I also wanted a camera that could do video so that I could use it on my kids.  I love having some home videos and am glad the quality seems very good.  I took a 2 minute video of my husband playing guitar and it did just fine, no overheating or anything.  I saw some reviews of this camera overheating when taking \"long videos\".  I for one would like to know how long a \"long video\" is...but for the most part, my videos won't be very long since my kids are in elementary school and anything that I would record would be short.Anyway, for what I need and the money I had available, this is perfect for me!  No problems with it and I love the quality!", "Date": "July 9, 2012"}, {"Title": "Incredible Technology- Great Camera", "Author": "Ryan", "ReviewID": "R1HHOHFBKY1L11", "Overall": "5.0", "Content": "I have had this camera for over a year now, and I have really come to love it. The new technology in it impresses me every time and the pictures come out stunning. This camera doesn't really seem like a true SLR. Everything about it is digital- including the viewfinder (which takes a little getting used to) and gives you a very different experience if you were to use a competing Canon camera. At the time, you could not find a camera for this price that had full HD video, built in HDR, a pop out rotating lens, and its one of the lightest SLR's I've ever known.The worst part about this camera is the maintenance. Every 8 months or so I begin to get dust build up on the actual mirror and I have to take it in. It costs me $55 to get it cleaned and even after what seems paranoid protection against the dust, its beginning to show up again. This shows as small dark or discolored dots on the picture and takes careful photoshopping to make them disappear.Besides these minor problems, for the price it is an amazing camera and I would definitely recommend it.", "Date": "March 13, 2012"}, {"Title": "DESIGN FLAW WHEN USING AN EXTERNAL FLASH", "Author": "Crystal C..", "ReviewID": "R2SVUADGKZIMX3", "Overall": "4.0", "Content": "I rented an external flash (HVL-F42) to try out with my A55.  I shoot in manual and I found that I had to turn the flash off before I could change the aperture.  I just checked with Sony and it is \"a design feature of the camera\".  I bought a Sony camera because the light weight was easier for me to handle. In photography classes I find that I often cannot do the things that people with Canon and Nikon cameras can do because of Sony design features.  Bracket shooting with the remote commander is one of them.  I wish I had known this before buying the camera.", "Date": "January 14, 2012"}, {"Title": "Great camera for the price", "Author": "heynow", "ReviewID": "R3OR3DOHV16WVY", "Overall": "5.0", "Content": "I have used point-and-shoot digital cameras for a long time and I am glad to finally get something more powerful. Some of the features of this camera that I love include the built-in HDR feature; since the camera captures photos at a rate of 10 snaps per second and the HDR feature can align the 3 shots when it makes its composite, it is very useful even when the camera is handheld (usually HDR requires using a tripod). I use the HDR regularly when taking photos indoors where there are windows and when photographing objects that are very dark colored where I still want to see the detail. It is not an obvious HDR \"effect\" but simply shows more detail in the light and dark areas of the photo. I also love that I can put different great lenses on the camera. I know all SLRs allow that, but it sure is nice coming from something like a Canon G12 prosumer all-in-one which doesn't support good quality interchangeable lenses. One lens I particularly like for the price is the 18-250 mm zoom lens from Sigma with ultrasonic motor focusing. I love the way this camera focuses. It is much quicker and sharper than an all-in-one camera because of the SLR-style phase detect sensor. I love the built-in \"STEADYSHOT\" camera shake compensation which works with all lenses you buy. Canon SLR cameras typically don't include this feature so you have to purchase vibration cancellation again with each new lens you buy. One thing I do not like about this camera is the built-in limitations. This is something that you will find in every consumer/enthusiast level camera- In this camera, you cannot program exposure bracketing except over a tiny small range. I would not have purchased it if it didn't have some sort of built-in HDR because HDR would not be possible otherwise with this camera. I understand that the video functionality also has some limitations but I don't do video so those don't bother me. I look forward to possibly upgrading to the A77 or something else someday and being able to keep using my collection of lenses :-) And finally, the battery could be a bit bigger. One argument you will always hear if you consider buying a Sony SLR is that Canon has been making them longer so there are many more lenses and other products available. That is TRUE... but there are still many many lenses available from Sony, Tamron, Sigma, Tokina and others. Also it shoots at 10 shots per second, which is really fast. It is easy to catch pets in mid-yawn and other parlor tricks that don't work out with slower cameras.", "Date": "January 3, 2012"}, {"Title": "A Great Camera", "Author": "Army Vet", "ReviewID": "R3KJWX3XUJ2FEW", "Overall": "5.0", "Content": "I have not owned an SLR camera since my old Canon fixed mirror went south many years ago.  I have owned several point and shoot cameras and the Sony A55 was my choice for a DSLR after considering Canon (EOS RebelT3i) and Nikon (D5100) counterpart products.  I like the speed (up to 10 images per second) in continuous advance priority AE shooting mode of the Sony A55 due to its fixed mirror system.  I wish I had the lens choices that Nikon camera owners have available.  Although the stock 18-55mm lens that came with my camera is an excellent starting lens, I will purchase the 55-200mm lens next because I want the additional focal length at an affordable cost.  I recommend the Sony A55 to anyone who is loooking for a quality DSLR that is more compact than its Nikon and Canon counterparts, wants the higher speed the A55 offers in continuous shooting mode and excellent color rendition.  After  narrowing down my choices to the Sony A55 and the counterpart Nikon D5100, I purchased the Sony A55 primarily because the A55 was faster.  I also purchased an additional rechargeable battery and David Busch's book on the Sony A55/A33 and both of these should be included in your purchase.", "Date": "January 1, 2012"}, {"Title": "Sony A55 is a great camera for me", "Author": "Jcheesy", "ReviewID": "R1SD65P983L91B", "Overall": "5.0", "Content": "I used to use an SLR film camera then went to using point and shoots.  Now I am back on a dSLT like the Sony A55 and I am really loving the control, quality of pictures, and possibilities for expression.  It is easy to use and the technology isn't very apparent but as you dig deeper into the various features of this camera, you start to realize just how creative you can be.I love it.Makes composing photography fun", "Date": "November 30, 2011"}, {"Title": "Wonderful camera!", "Author": "Dana", "ReviewID": "R1PQ48WXR6M071", "Overall": "5.0", "Content": "I just got my camera so I'm still learning all that it can do but I love it.  I did a lot of research on all the SLRs.  I picked this one because I take a lot of action shots of surfing.  It's very fast!  This is my first camera upgrade and I couldn't be happier.", "Date": "November 14, 2011"}, {"Title": "OW - Became a brick 1/20/14 - R.I.P.", "Author": "A. R. Jonez \"Why not!\"", "ReviewID": "R8PVFN3N9WGYW", "Overall": "4.0", "Content": "I am back to removeable lenses again. That's not a bad thing.I had ventured away when I traded in my Nikon film camera for a Nikon Coolpix 5700 - all 5 megapixels! I shot weddings and family pictures for years. I replaced that with a Panasonic ZS3 - which was a great camera for what it did, small, great zoom, 10.1 meg sensor. When the ZS10 came out, I treated myself to the upgrade, and passed the ZS3 on - and quickly wished I hadn't - the ZS10 had a 14.1 CMOS sensor that just set Panasonic back years!I was ready for a really great camera and churned thru reviews for weeks - I decided on the Sony a55 with a Sigma 18-250 zoom - and I am never looking back! I will return to complete the review, but just have to say - right now - what a great combination! For the money, this camera is the best in class... Crisp, clear, beautiful shots every time - the camera has a wonderful help feature that just begs to be used. I did get the fastest memory card I could find! SanDisk Extreme Pro 32 GB SDHC - UHS Class 1 Flash Memory Card SDSDXP1-032GEdit - 10/18/2011 - Very happy with the a55/Sigma 18-250 combination. I have not been tempted to purchase a strobe, the camera is amazing. The software inside has enough tricks up its sleeve to pull good photos from dark places, Sony's Hand-Held Nightshot feature is worth the price on it's own! There are times when the camera will not take the picture, but it is always when it tells me to turn off auto-focus and twist the lens by hand. The picture could be sharper - if I coughed up 2K for a prime lens. The camera satisfies, and my wallet still has $$$ in it!Edit - 2/22/12 - This camera is so good that I now have purchased two prime lenses. The Sony/Carl Zeiss partnership has impressed me, and now I have the 24mm (actual: 36mm) and the 85mm (actual: 127.5mm). Sony SAL-24F20Z 24mm f/2.0 A-mount Wide Angle Lens Sony SAL-85F14Z 85mm f1.4 Carl Zeiss Planar T Coated Telephoto Lens for Sony Alpha Digital SLR Camera I also now own the Sony HVL-F58AM High-Power Digital Camera Flash Sony HVL-F58AM High-Power Digital Camera Flash with Wireless Ratio Control and Quick Shift Bounce for Sony Alpha Digital SLR - what a combo! My collection will keep me busy for years, these items are heirloom material - that good!update 6/26/12  -  My purchase of the prime lenses has revealed a slight problem with the Sony a55... all outside landscapes have a slightly out-of-focus horizon, as if all my lenses cannot quite focus at infinity. In some internet research, I have found others with the same observation - which has me slightly puzzled. It seems the Sony autofocus program might be a little off, choosing to use a nearer focus to average the entire focal plane - I found a great set of user-adjustments which can easily be done with a 1.5mm mini-wrench and will try doing this soon. I will get back here to review how this affects focus. Shooting close-ups and mid-range the camera is rock-solid in providing crisp clear images, only the landscapes show the softness, with all my lenses. I admit to pixel-peeping, you will not see the problem under normal use...update 1/10/13 - I did adjust the sensor distance-to-lens, and am happy with the auto-focus. I would leave this to the pros, but if you send the body in for tis service, they use a boot when a tickle will suffice... I downloaded some focus targets especially made for the task, and had them professionally printed, kind of a large job...Update 1/20/14 - :( It appears the shutter broke while shooting yesterday. If this is true, I scold Sony on their design on the a55, as there are other disappointed internet-savvy customers complaining about this particular problem. I cannot financially justify sending the body in for repair, as a replacement body - used - is around $250. I just ordered a used a77 on Amazon for what the repair may have cost... onwards...", "Date": "October 4, 2011"}, {"Title": "I love my camera!", "Author": "Kurt Parker", "ReviewID": "RSPXD9QCBSU75", "Overall": "5.0", "Content": "I was looking to step up from an Olympus SuperZoom-like camera. With the combined gifts from family on my birthday, I was able to get my hands on this camera with both the kit lens as well as the sony basic 55-200mm lens. Still learning the ins and outs, but getting many comments from family and friends on the number of great pictures that I am getting.My daughter dances, and so I needed good low light performance. Keep in mind, I had a budget, so no $3k+ cameras for me (not yet :)) I was very happy with the clarity and color that I was able to achieve. I also brought it down to the park on a recent trip to see family, and took some gorgeous action and portraits. With a large memory card, you can make the best use of the camera's ability to take a lot of pictures in a very short amount of time, and then sort through them for the \"keepers\" later at home.If you are looking to upgrade your camera equipment, but are just getting started with high(er) resolution, faster burst rate, or interchangeable lens features, this is a great place to start.", "Date": "June 28, 2011"}, {"Title": "For people who just like to take pictures", "Author": "Druuge", "ReviewID": "RVMBB49U21KYA", "Overall": "4.0", "Content": "This camera is best suited for people who want to take a picture and use it as it is.It has those features that up until today I knew were possible in photoshop, but even when I took the matching shots - I never bothered to complete them in photoshop.I'll explain:HDR: taking bracketed pictures and merging for HDR image - I have tons of similar pictures on my harddrive, but never did anything with them.Panorama: same thing.I really hate having to bother with post-processing.This camera does it all on the fly!It also have high-iso multiple exposure option, very effective live view, GPS tagging and many other things to like.I am truly in love with it - took it to a 10 day vacation, came back with 2200 pictures.It does have its minuses:The electronic view-finder: while it is bright, clear, 100% coverage and lets you see whatever you want on it (from a simulator like \"horizon level\" gauge and electronic zoom for focusing down to the entire camera menu - YES on the viewfinder) it has in fact low dynamic range (high contrast) and it is sometimes difficult to take a picture because it is so different than reality. But today, overall I think I prefer this over the optic.Many times after you take a series of pictures (or one HDR/high-iso/panorama picture) the camera will halt while it is \"processing\" and you will miss your next shoot...It is too small and light - when I connect my 70-200 F2.8 lens to it, the whole thing looks and feels absurd. But the grip is good.Video has two main problems: time limited (even when you turn off the steady-shot) - especially where I live which gets hot, and the microphone picks up the lens zoom pretty loud (I usually focus then move to manual)", "Date": "June 20, 2011"}, {"Title": "Awesome Camera for the Money", "Author": "Juice", "ReviewID": "R1AERYOJGYJQ9H", "Overall": "5.0", "Content": "The A55 is my first DSLR camera and I'm glad I picked it. the images are great. I was on the fence between this, a T2i or a D3100. I know this was more in price but at the time I was also looking to buy the A33. But I went for the A55 after there was a price drop and felt the added buffer, and the GPS would be nice to have. And boy is it. I like how I can now see where a picture was taken. The camera focuses quickly and accurately. I'm still learning how to use a lot of the features. U have played with the sweep panorama. I like it's a bit of a gimmick, but its quick and easy. I especially enjoy the Multi Frame Noise Reduction and the Hand-Held Twilight functions. it allows me to take good pictures in low light with minimal noise. Most pictures are clean up to ISO 6400 doing that. Speaking of ISO, this camera is really quick to go to ISO 1600, but the pictures are still pretty noise free.My only big disappointments are the electronic viewfinder and the battery life. Going in I knew the EVF is a taste thing and I also knew about the battery life. So the battery I accepted and picked up a second battery on a popular auction site for cheap. Now I've used EVF's before in my old Sony DSC-H2, but the EVF in the A55 leaves a lot to be desired. It functional even in bright light and it pops out quiet a bit from the back which is good, but the view through the eyecup is a little soft on the outer edges. All in all I'm glad I went with the camera.", "Date": "June 14, 2011"}, {"Title": "compatible with old Minolta lens.", "Author": "Matta T. Reddy \"mattr\"", "ReviewID": "R6EVE9E5UUR7X", "Overall": "5.0", "Content": "this camera is very nice.I don't understand what these people mean by heavy.. so you want it to weigh like your point and shoot or cellphone??? i can hold it with my one hand and start snapping without any problem. I even use 70-300lens since you have image stabilization you don't need to hold it very steady.I bought this thinking that I would use view finder but I never use it.great camera for great price.the camera is compatible with older lens of Minolta they are fraction of the cost of new lens so just go to ebay and buy what ever you want...", "Date": "June 12, 2011"}, {"Title": "Pretty Solid Camera", "Author": "Agent 007", "ReviewID": "R3B2BZ0KALL8KF", "Overall": "5.0", "Content": "I'm enjoying this camera. I'm a semi-professional photographer that doesn't believe that you must have a big name camera to produce a great picture. After all, what you do in the post production is what counts. The best camera can't help your editing skills. The A55 proves that it has what it takes to be competitive with Nikon and Canon. The speed of this camera is extremely fast. It's lightweight body is refreshing when I have those long wedding event days. The two cons I have with this camera is that the battery life is horrible. I need at least six batteries to make it through 9 hours of wedding photo shooting. Sony really needs to look into making a battery grip for this product. The other con is after about 5 minutes of HD video, the camera overheats and turns off automatically for at least 5 to 10 minutes. The HD video part is not the reason why I purchased this camera so its not a big deal to me, thats why I own a Sony HD camcorder. Other than those small things, this camera has great value. This is a highly recommended product.", "Date": "June 8, 2011"}, {"Title": "GREAT DSLR!", "Author": "Liz", "ReviewID": "R2NLL46EEYMAXL", "Overall": "5.0", "Content": "This camera was out of stock after Christmas at Amazon.com as well as many other retailers. Cameta Camera had one in stock...it came 2 days after placing the order...amazing customer service and amazing camera! All camera features were as advertised...bonus feature is that the camera automatically shifts from LCD to view finder view when you place it up to your eye!", "Date": "February 14, 2011"}, {"Title": "Nothing Like It", "Author": "GHammer", "ReviewID": "R3TGQO1OLZ7XTO", "Overall": "5.0", "Content": "This camera has been in use for 2 months and I feel its time for a review.The camera is FAST, focus, shutter, display(s). Very nice.Except the GPS feature which needs the GPS update data from the included software.If you do that once a month, all will be well with it.Image quality is excellent no matter the conditions or subject. I've done some informal portraits, scenery, architecture, general travel shots. All were better than my previous Panasonic FZ-50, which was a great camera in its own right.I'd recommend buying an extra battery, this camera with the GPS on loves it some battery.In all a great camera with features not yet seen on other brands.", "Date": "May 28, 2011"}, {"Title": "Video problems", "Author": "I.M.Skeptic", "ReviewID": "R3OILLZFYRWTGO", "Overall": "3.0", "Content": "Nowdays convergence seems to be occuring with all kinds of electronicsThe A55 is a very innovative product with one glaring issue.The  A55 overheats really quickly when filming videos.You can take like 5min. video the first, then onward it will yell \"overheated\" in less than a minute.When it overheats it shuts down the camera.", "Date": "January 16, 2011"}, {"Title": "Fast enough to keep up with fast moving grandkids.", "Author": "Shelly Merry", "ReviewID": "R3ALJH62XMLPE", "Overall": "5.0", "Content": "I have a Sony dslr and I do love my camera however, this camera shoots fast enough to keep up with my grandkids.  I took pictures of the of the kids playing ball and jumping on the trampoline, hardly a blur in sight.  I've only had it a few days and so far I love it.", "Date": "October 18, 2010"}, {"Title": "Excellent Camera for those who use \"Live View\" Regularly", "Author": "Ken", "ReviewID": "R2PNVQ9AJEAXTD", "Overall": "5.0", "Content": "The Sony A55 is rather unique camera.  Although it looks and handles like a (small) Digital SLR camera, it does not have the traditional Reflective Mirror and consequently, no optical viewfinder.  Instead the camera relies on a very good Live View (LCD Framing) system and a very good electronic viewfinder.  The technology is called Translucent Mirror Technology and I believe it is  propietary and only found in some SONY manufactured digital cameras.Although Live View is a feature found on most, if not all, recently released DSLR cameras, focusing and shooting performace is sluggish on all non-Sony cameras.  The Sony A330 series was actually somewhat revolutionary as it featured a traditional single lens reflex (SLR) mirror system with an optical viewfinder and a very responsive Live LCD view system on the same camera by employing secondary-sensor Live View.Translucent Mirror Technology takes this technology to a new level.  The optical viewfinder has been replaced with a fully electronic viewfinder.Although I personally prefer an optical viewfinder to frame photographs,  I was very impressed with the A55.  Both the LCD and the electronic viewfinder are very bright and sharp.  The LCD fully articulates but inexplicably, pivots on the bottom  (not on the side) making it less useful than it could be. The camera knows when to switch from the LCD to the viewfinder (and visa versa) based upon a sensor for that purpose.  I learned that an electronic viewfinder has one convenient and practical advantage over its optical counterpart. With an electronic viewfinder it is no longer necessary to review the photo just shot on the LCD; the viewfinder may be used for both shooting and reviewing.  This is especially helpful when shooting multiple photographs in rapid succession.The camera uses an excellent 16mp sensor found in other quality DSLRs including the Nikon D5100.  Default settings generally renders natural color and fine details.  ISO performance is fine through ISO 1600. ISO 3200 does show some grainy noise and loss of detail upon close inspection (but still very pleasing color and generally very usable photographs).  There are no ISO settings between 1600 and 3200, an issue definitely not unique to the A55.  Automatic white balance and metering are excellent indoors and outdoors except that there is some overexposure in bright sunshine (easily fixed by adjusting the exposure compensation a bit or by switching to spot metering).  I highly recommend using a small external flash with bounce capabilities for indooor shooting(ie the HVLF20AM) for more accurate and more even exposure.The A55 is a bit smaller and lighter than almost all traditional DSLRs (but a bit larger and heavier than most compact series cameras).  Image stabilization (steadyshot) is built in to the camera body; consequently all lenses are automatically stabilized and a bit lighter than the Canon & Nikon equivalents. A really versatile lens that is very inexpensive, very light and reasonably sharp is the Sigma 18-200mm (27-300mm equiv).  This lens is branded under other names such as Quantaray and can be found for not much more than the price of a kit lens. I believe that all Sony Alpha & many Minolta Lenses are fully compatible with the A55 (some high quality/fast aperture Minolta lenses are available rather inexpensively).  The Sony 18-55mm (27-84mm equiv) kit lens is pretty good as far as kit lenses go.  The older 18-70mm kit lens is not very good and should be avoided.For those who like the shooting experience of a DSLR and prefer live view and/or an electronic viewfinder, the A55 is a great camera and a terrific value.", "Date": "June 21, 2013"}, {"Title": "Meh", "Author": "spookycrayon", "ReviewID": "R231U1N88UJNIC", "Overall": "2.0", "Content": "So, I first had the sony a55 for two years, and wasn't thrilled with it in the least bit. I don't know how many people reviewing these sony cameras print their pictures, but I do and the pictures always had a lot of noise in dark areas, weren't sharp, the colors were never vibrant, and I normally had to edit the crap outta them to make them look like they weren't taken with my iphone. They looked slightly better on a screen, but once printed- I would have about one good picture out of 100. And that was the a55. I thought I had just got a lemon or something, since it has so many raving reviews on camera websites and is frequently compared to other mid range dlsrs. Also, the battery life is terrible.  I think it's a well known thing with this camera, but just leaving it sitting unused would kill the battery life kind of quick. I can't say it didn't do me good some times, it took some nice pictures once in a blue moon, but not as often as it should have; and I would have to add like 5 shades of saturation and sharpness to get it looking halfway decent, but then it's terrible ISO noise would be more noticeable after editing it. I would say that the time I had with the sony a55 vs the sony a65 wasn't even close in A Time frame point of view, but [reading further] looking at my a65 pictures, I found myself wishing I had my a55.So! I had a bestbuy warranty and broke the a55 after two and a half years, and because I had a sony zoom lens I could do nothing with, i decided to be upgraded to the a65. Even with a poor experience with the a55, I was so thrilled to get the a65, thinking It would be a better dslt, and I have to say it was worst as far as picture quality goes. Edges not sharp whatsoever [which is the main thing I look for in a photo], colors are faded, when I print the pictures it looks like an iPhone took them. I know how to use a camera, I tried different times of day and different settings. Also, I'm printing the pictures at an actual photo lab. I could get better pictures with a canon sx260.I was very very unhappy with the picture quality, and I showed about 6 other people the pictures and literally all of they agreed. Same terrible noise and grain in dark areas like the a55,, blurry, faded colors. The dark areas don't even have to be that dark to get noise. The pictures look beautiful on the bright LCD screen, but it's a big difference than what your actually getting.However! Some things I did like about it was how easy it is to use, it explains everything as you go through the settings [great for beginners]; how friggin fast it is (which is the first thing I noticed when I took my first picture), and the body IMO feels very sturdy.  Also, the viewfinder to lcd screen with just your eye is a nice feature. Or was that the a55? i dont remember. Besides those things, i was extremely dissapointed, and I returned it and stood at bestbuy  for half an hour debating between the nikon d5100, d5200, and d7000. I want the d7000, but it was out of my price range, so I got the d5100 to just try out a nikon; and mannn, what a difference. Huge huge huge difference. It's cheaper then the a65, and so much better as far as picture quality goes. I was flipping through some pictures last night, and they are so so vibrant and crisp without editing them. On my computer, I was flipping backwards through my pictures and all the sudden the pictures got ugly and I was like, \"what happened with that one in all these beautiful ones?\" And I realized it got into pictures from the a65.Im really feeling the nikon, but I will be returning it as well, this time I'm gonna get the d7000 and take the price hit, because the body of the nikon feels very cheap. I've had it a week and the battery cover won't open. Also, you have to turn a nob on the top of the camera to switch from viewfinder to LCD every time the camera turns on, and I don't use the viewfinder and that's inconvenient for me and made me miss a picture yesterday. The camera is 4fps i believe, and it is a tid bit slow if your thinking about using it for sports. Maybe you can buy a lens. Idk.And one last thing negative about the nikon is I personally don't like the Double shutter noise it makes every picture you take. Besides those, though, the picture quality is so far impressive. ive only printed a few, but they werent too shabby either. I buy a camera for the pictures, really, and if you do too, you will notice a difference in a sony vs. a nikon. I didn't think it would be a big difference when I originally bought the a55, but I regret that choice three years ago. I've wasted hundreds of pictures IMO not using a nikon.These are all my personal experiences and opinions. I don't do anything professional with photography, I just like taking pretty pictures :) and am kind of particular I guess. I'm planning on posting this on the other cameras reviews, too, in hope of helping someone else. I have done hours, days, MONTHS of reviewing a whole lot of cameras; and ended up more confused then helped. Even now, I'm typing into google \"d5200 vs d7000\" :)  good luck camera buyers- your probably torn between two cameras right now, and I hope this review helped.", "Date": "June 9, 2013"}, {"Title": "Repair issues", "Author": "Wendy Waldron", "ReviewID": "R1ZGEIJY5TG9RL", "Overall": "2.0", "Content": "I have had two Sony A55V cameras.  The first body lasted about a year and then I got an error message.  I sent it for repair but needed to shoot that weekend so purchased another body.  The first body came back fixed and I had two.  The next body went bad about six months after I started using it and I sent it for repair.  It came back.  The first one is now dead again.  I do not expect the second to last more than another few months.  Basically, it has an electronic error that makes it just stop shooting.  This isn't because of the way I handle the cameras and it isn't a lemon problem; other photographers have reported the same issues.  Sony will fix it for a year and then you're out $250 if you want it fixed again.  I will switch to Canon.  I loved the color profile and loved the camera but it's just too expensive to replace every year.", "Date": "January 23, 2013"}, {"Title": "Excellent leap forward for Sony", "Author": "JFCI", "ReviewID": "RM2SDCGCQU3T", "Overall": "4.0", "Content": "I bought this camera about a year ago.This is a lightweight, easy to use camera with all the features that I need to really work with the conditions I find myself in.  It does well in bright light and dark situations.  Images are nice and sharp and the 10 frame per second burst speed shooting is wonderful!The panoramic setting is fantastic!  I use it a lot more than I thought I would, and the images come out spectacularly clear and it's really fun to play with.With the right flash, this camera is so versatile and easy to use.  I LOVE having the histogram real-time in my view finder. The firmware updates added a bit of functionality to the D-Range button, allowing the user to white balance a little easier.Sony's built up a great collection of lenses including some very impressive Zeiss glass.  You can find the right lens for just about every application.The only complaints I have:1. the view finder goes black when you shoot! Who the heck thought up that idea?!  A photographer likes to see what they are capturing when they release the shutter!! FIX THIS SONY!!!2. TETHERING TETHERING TETHERING!! Sony needs to expand their ability to tether to devices and software PS, PSE, Lightbox and Lightroom. (WIRELESS WOULD BE NICE!)There's no reason to hold tethering up on the shelf with the A900's!3. When working with a tripod it becomes cumbersome to remove the battery and card.  Battery should be on the side of the camera.Other than the view finder / shutter issue, all of these are really pretty minor things.  I have had this camera for about a year now and I've shot nine weddings and dozens of portraits (in studio and on site) and I've been very happy with it.If you're looking for a good entry level DSLR go with this.  It's a very good starter!", "Date": "March 5, 2012"}, {"Title": "Superb camera.", "Author": "LP.", "ReviewID": "R1GDQEC7B2T159", "Overall": "5.0", "Content": "This review is motivated by a 1 star given to this product by another costumer. We bought this fabulous camera along with three lenses. This is the newest technology out there, full of features, very nicely built and user friendly. High MP count, flexible and consistent ISO capability, super fast 10 fps, AF, 3D Sweep photos, HD video and you name it. A handfull of options to play with for a while. Be confident when buying this. Just don't buy it if you plan on becoming a film director with this camera (HD Video is extraordinary, but time limited).", "Date": "March 6, 2011"}, {"Title": "Great for photography.", "Author": "Lynn", "ReviewID": "R2DM6D0O569GA5", "Overall": "4.0", "Content": "Not the best for video...the battery overheats when video is longer than 5 minutes and shuts down, but great for photos.", "Date": "April 26, 2014"}, {"Title": "Great camera", "Author": "SJIndy", "ReviewID": "R1799FR8OTX0SJ", "Overall": "5.0", "Content": "I researched many cameras before decoding on this Sony. It has more than met my expectations for every day use.", "Date": "March 23, 2014"}, {"Title": "Powerhouse!", "Author": "A. Kunetka", "ReviewID": "RZX8IQKIQ3I6G", "Overall": "5.0", "Content": "I love this camera! It takes gorgeous photos. Even in low light compared to my old Sony A330.It packs a ton of useful features in as well! I love the panoramic mode and have used it quite frequently!My first test using it was @ Jigokudani Snow Monkey Park in Japan. It performed flawlessly in terms of photo quality. The only downfall I had was the limited range of the included kit lens. I will definitely be investing a general travel lens, I sold my A330 along with my travel lens before I decided to stick with the Sony brand. Now I'm wishing I had kept the old lens.If you are looking for a great entry level camera look no further, but definitely invest in a longer zoom lens! 18-55mm is just not enough..", "Date": "March 12, 2014"}, {"Title": "nice camera", "Author": "Robert Larocca \"book reader\"", "ReviewID": "R4VVGH2L4YYQW", "Overall": "5.0", "Content": "used this for some freelance photo journalism. it worked great. not an excellent low light camera but took great video and made a good impression when the subject would hear those 10 shots go off per second. sounded really pro. :)", "Date": "February 5, 2014"}, {"Title": "Video Overheating MAJOR problem", "Author": "Tyler McCulloch", "ReviewID": "R3COWNDZ4SRXR4", "Overall": "2.0", "Content": "It's a nice camera. Takes very high quality still pictures. But I purchased this to be a starter level 1080p video recording camera. If you've come to this product looking for a video camera let me put it plain and simple. Canon. Canon video recording is light-years ahead of Sony and Nikon as far as DSLR's go. A T3i is comparable in price to this A55 but takes way better video and for way longer. This a55 kicks it's trash in still pictures, so if all you're looking for is a great still photography camera, look no further. This is it.But the video over-heating a few people have mentioned is a gigantic problem. If you record video with image stabilizer on it will overheat in a matter of 3 minutes. And it's not just like, hey let's turn it off and turn it back on, you have to wait at least 10 minutes for it to FULLY cool down before it is ready to record again. Of course you can start recording again, but then the overheating times go from 4 minutes to 45 seconds, then 15, then 0. This is a huge problem if you're on a shoot and trying to record things while it's happening.Do not, I repeat, DO NOT use this camera for video.However, again, I'll touch on the fact that it takes crystal clear still photographs and is great bang for your buck in that category. For my own personal use as a videographer, this was absolutely worthless.", "Date": "January 31, 2014"}, {"Title": "Great tech but OK photos.", "Author": "Daniel Coley", "ReviewID": "R3E5KRL8TJZCES", "Overall": "3.0", "Content": "As a photographer I was looking for a camera to take along on vacation. I shoot with Nikon D300's. Buying the Sony was a hard choice to make seeing that all the glass I have is for Nikon. I got it because of the video performance and the very small size. I was not disappointed shoots in very low light at high quality. It is very tiny and light compared to my D300's. It is built well and fits my hands well.Update: Sold it, Great specs but just could not get quality photos. Replaced it with an Olympus E-M5 and have not looked back.", "Date": "January 23, 2014"}, {"Title": "Great camera.", "Author": "J. Mullins \"CaerRaven\"", "ReviewID": "R11BBMPMEIHBPF", "Overall": "4.0", "Content": "I'm terrible at writing reviews, so I hope this will serve some purpose to someone. I've only had this camera for about a month so I haven't had much chance to go in depth with everything.I bought this camera as a replacement for my old Sony A230 that has served me well but I needed an upgrade. I'm a parent and a photography student on a very tight budget and so I needed all the bang for my buck I could get. My advice? If you can afford a better camera, go for it. If you can't this will serve its purpose just fine and if you're a beginner to intermediate photographer this camera will work very well.  --------------Pros----------- The swivel back screen is amazing. It was one of the reasons I bought the thing. It's just really handy that I can turn it in most directions and not have to crane my neck into weird positions to look at something.The pixels are clean and clear, no major pixelation and the ISO range is phenomenal for what I use my camera for.A-mount lenses meant that I didn't have to go through and repurchase all my lenses. (that's just a personal pro for me)Easy to use and understand. Even the most basic photographer could use this camera and I can even have others who know nothing about cameras at all use it.Settings. There are a ton of settings on this that are so standard today that I didn't have before. The Auto plus feature is nice for when you want to program some of the other settings but want automatic adjustments.Viewfinder and the back screen communicate. I can look through my viewfinder and the back screen shuts off and vice versa.  --------Cons-------Over and under exposure problems. For me at least, I noticed that what I see through the view finder doesn't necessarily produce the same in Lightroom. I have to bracket frequently to make sure I get the type of image that I want.Battery life. The battery life on this is not one of the better ones. My previous camera could let me shoot for days on one battery depending on what I was doing. The A55 tends to suck the life right out of the battery like a vampire at a blood bank.View finder sensor. The sensor that lets the camera know if you're looking through the view finder or not tends to fog up easily in various weather conditions and that can cause the back screen not to function at all for some time. It can be rather frustrating.Overall I think I need a lot more time with this camera to adjust to all the bells and whistles. It's a good camera, it really is. I love what it can do and I love that it's so much faster than my previous camera. I do recommend giving it a shot if you're on a budget and looking for a DSLR to get into photographry.", "Date": "September 24, 2013"}, {"Title": "A nice stepping stone into DSLRs", "Author": "B. Fong \"shinboy\"", "ReviewID": "R27536N4EC96RV", "Overall": "4.0", "Content": "I was blown away by my Sony a200 a long time ago and I thought I never stop using it but I met the a55.  The negatives first: Poor battery life (doesn't last whole day on  heavy use), shutter noise is fairly loud, and the GPS doesn't work at all.  These can be resolved by carry extra batteries, not caring what other say about the shutter noise (a200 had a much louder shutter), and you should know where you are when you take a pictures anyways.  The camera was a great handy side arm for me because it was smaller and lighter than the fuller DSLRs like the a77 and a99.  I am still amazed that this little guy packs so many features that even the bigger more expensive DSLR don't have.  Like 10 FPS burst shooting and great speedy autofocus during video.  The picture quality is amazing and the autofocus for is quick and accurate.  Video recording is outstanding.  There are no video adjustment features to this camera besides quality and EXP. Comp.  Just remember if you shoot a video use a lens with SSM, HSM, or some silent motor system because it will pick up noise easily.  All in all great smaller DSLR that a great starter camera but don't expect it to better its bigger brothers.", "Date": "September 8, 2013"}, {"Title": "Better than my DSLR", "Author": "Micheal Saisi", "ReviewID": "R29NLO9OZX1OQX", "Overall": "5.0", "Content": "Perfect for a semi-pro or pro photographer, or even newcomer.  Lighter than a DSLR, and much more vivid colors.The only downfalls would be the lack of accessories that can be purchased for it, and (as with more sony cameras) the avaliabilty of lenses.", "Date": "August 28, 2013"}, {"Title": "Love it", "Author": "Joshua Miesner", "ReviewID": "RNLHGEMTTUZZU", "Overall": "5.0", "Content": "I love this product. It is a great little camera. So many features. It does everything. And it does most of it well.", "Date": "August 22, 2013"}, {"Title": "Buying a second one", "Author": "Odd Duck", "ReviewID": "RAL41T2SO7F85", "Overall": "5.0", "Content": "I purchased my first SLT-A55V two years ago and with an up coming photo shoot at a wedding decided to get a second body to avoid lens changes and to have a back up.  The first camera was purchase new and the current purchase will be a used body from Amazon/Adorama.  The camera is full of features that are lots of fun to use.  This was my transitional choice from film to digital SLR or in this case SLT.  I have been pleased with the choice.  The camera has exceeded my expectations.Just a note about the less than positive reviews, read the manual and or David Bush's book on the camera.", "Date": "June 21, 2013"}, {"Title": "This camera is incredible!", "Author": "Keith", "ReviewID": "RMNOKENQ9X838", "Overall": "5.0", "Content": "I Ordered the Sony a55  DSLR camera from Amazon and I was able to use it immediately with very little learning curve. It takes great pictures. I have no complaints so far.The battery life is not very long but it will last long enough to take about a hundred pictures before needing a recharge.Overall this is an incredible camera!", "Date": "June 5, 2013"}, {"Title": "love it", "Author": "germano", "ReviewID": "R3PDWQP9BSAGER", "Overall": "5.0", "Content": "I had some serious doubts at the time on buying an Alpha or a Canon. In my opinion, Sony has more interesting features for amateurs while Canon has a greater variety of accessories at a cheaper price. I have no regrets; despite having to pay a bit higher price on accessories such as lens and batteries, I really like it mainly because I can use it on manual for full control, or enjoy the great automatic features such as panoramic, 3D, HDR, colorize when I'm in the mood just for fun. High speed is also great for taking photos of children. GPS had not inspired me at first but now I find it great to see the photos on a map. The only downside on my opinion is the lack of an optical viewfinder, which I find drains the battery a bit. Limited video recording time due to heating is also not so great, especially where I live, but I can live with it since my videos are usually short duration.", "Date": "February 6, 2013"}, {"Title": "Love, love, love!", "Author": "Book Lover", "ReviewID": "RSYGFP7HP9RER", "Overall": "5.0", "Content": "I owned another Sony alpha but needed to upgrade. I love this camera and the pictures are sharp with very little noise. I have not had any problems with overheating.It is also very easy to use for those who are new to DSLR or SLT products.I highly recommend this camera as well as the retailer.", "Date": "August 7, 2012"}, {"Title": "Great DSLR Sony a55", "Author": "Cuppycakes808", "ReviewID": "RMU7Q8O5ISALN", "Overall": "5.0", "Content": "This is my first DSLR camera and I have no regrets on buying it. I am an amateur at using a DSLR, but this camera did not make me feel like it. I love all the different features. One of the qualities that sold me on this particular camera as opposed to others was the built in GPS. It is extremely useful when you are traveling and can't remember exactly where you were. My husband is in the Marines and we travel often and that feature works well formus. One of my friends (also and amateur) used this camera to take pictures at my wedding and the battery life was excellent. She shot over 700 pictures just on the wedding and did not need to recharge it. The picture color is breath taking and so is the clarity. The 10 fps is also a good quality feature. I now mostly use it to take pictures of my daughters at various events  or family functions and this camera is perfect.", "Date": "August 6, 2012"}, {"Title": "Good Product", "Author": "jide  adewuya", "ReviewID": "R1U4BUCXEWK5SC", "Overall": "4.0", "Content": "This camera is a good one. Used it several times and the result is whatI really expected.I will recommend it for my friends.", "Date": "July 6, 2012"}, {"Title": "Excellent Camera!", "Author": "JeffWald", "ReviewID": "R24KZLHZPBS2ME", "Overall": "5.0", "Content": "Chose this over comparable Nikon and Canon -- and have been very happy with it.  Very impressed with its responsiveness and sharp images.", "Date": "June 17, 2012"}, {"Title": "Fantastic", "Author": "Fulani", "ReviewID": "R3OZ4T13XRD891", "Overall": "5.0", "Content": "The Sony Alpha 55 DSLR is simply a delight to have. Pictures and videos are  of high quality and stutter speed is amazing. A good buy any day.", "Date": "October 5, 2011"}, {"Title": "Just a great camera", "Author": "shopper", "ReviewID": "R2NFF5NGQ64L8E", "Overall": "5.0", "Content": "After reading many reviews for this camera and other SLR types I decided to purchase the Sony A55V appoximately 2 months ago.  Even thou I am an amateur photographer I have been reading the manual for the A55V alone with other books written about this camera.  I have shot over 1500 pictures of different situation.  Just as I read in other reviews this camera is light and produces a great quality picture that sometimes make me think I am a professional. Untortunately this camera is not really designed for long video shooting and you would definitely want to get a external microphone.  I gave this camera 5 stars only because there were no 4.5 availible and I bought it for photo's and I'm just loving it. I would recommend investing in a cam recorder for long video requirements. I would definitely recommend this camera to my friends for other types of photography requirements because is a great camera overall.Pro's: Great quality pictures. Great quality short videos in HD mode. Easy to learn and very light for a SLR type.Con's: Poor battery life.  Definitely purchase a spare and keep fully charged when out shooting. Poor sound quality. The grip creates a minor problem if you have large hands and have not figured out your most comforable grip for this camera just because the grip is a little small for large hands.  I did have to learn to adjust on how I hold mines becasue I too have large hands, but it does not pose a problem for me.", "Date": "July 5, 2011"}, {"Title": "Fast and Accurate!", "Author": "Birke4", "ReviewID": "R2Z4FARP6ON7G5", "Overall": "4.0", "Content": "I love everything about this camera from the image quality and sharpness, to the endless features that it comes packed with. My only concern has to deal with taking rapid shots (10 pictures per second) where after about a second or two the camera gets bogged down and has to wait about a minute to process the pictures. I am pretty sure I have done everything I can to get rid of this issue but it still persists. The Memory Stick I have is supposed to be one of the fast with processing photos but I am not seeing it here. Maybe I just have to play around with the features and look online on how to minimize/completely rid this problem from this great camera. I recommend this to anyone looking to purchase a new dslr!", "Date": "June 26, 2011"}, {"Title": "Great travel SLR", "Author": "N. Goranov \"toothdr\"", "ReviewID": "R2Y2DGUVSJY499", "Overall": "5.0", "Content": "I got mine 6 months ago and have been using it every once in a while. Keep it on the counter in my kitchen so whenever something happens I have it ready. I am Nikon system user and have 3 bodies and few lenses. Nikons are better photographer's cameras. No question about it. The Sony however is a lightweight do-everything SLR which combined with a good universal lens like the 18-250 makes for the perfect travel package. Great pictures, Impeccable Video + Auto focus, Panorama mode, GPS, 10 FPS mode, good swivel screen, very light weight, HDR, Great high ISO quality.... no other camera comes close to all that. I have a couple of 1.4 and 1.8 apreture Minolta primes so no picture is going to be missed. Everything packs in a small travel photo bag - THE BEST CAMERA IS THE ONE YOU HAVE HANDY SO YOU WONT MISS THAT ONE IN A LIFETIME PICTURE. Ant the Sony is one of those. Buy it, you won't regret it!", "Date": "June 25, 2011"}, {"Title": "Best deal for the class", "Author": "Amazon Customer \"Rick\"", "ReviewID": "RLFXH6E9MQN6V", "Overall": "4.0", "Content": "After finally deciding to get my first DSLR and owning this one for several weeks, I do have to say I'm  highly satisfied with the performance.  While I'm still getting used to the various settings available, the pictures and video I have taken have been very satisfactory.People who actually are experienced with this type of camera have been impressed by the features for the price and acknowledged that this was a great deal.The various reviews on the net that complain about the battery life are somewhat justified.  However, if you're just going to have the camera out for casual shoots, it does last for several days and is perfectly fine, but on those occasions where a considerable amount of shots are made, I did notice the battery drain considerably and would highly recommend an additional one AND a portable charger for long trips.One overall thing that persuaded me against buying one of the Rebel line is that I had a friend mention that, during our hot Texas summers, is when the camera is left in the car, the plastic body will NOT hold well.", "Date": "June 19, 2011"}, {"Title": "Sony Alpha A55 - Great Camera....", "Author": "greenpeoplerock", "ReviewID": "R68EKS1JS55V6", "Overall": "5.0", "Content": "I have used Minolta Cameras all my life and had a good size investment in lens and attachments. I looked at several different Sony Alpha products before purchasing the A55. The main reason I purchased it was the Translucent mirror and video capability.After receiving the camera, its incredible, the automatic and manual features work great. This camera replaces a Minolta Maxxum 9Xi witch still works flawlessly.", "Date": "June 9, 2011"}, {"Title": "Sony a55 Camera with 18-55mm Lens", "Author": "Moviesrswell", "ReviewID": "R1E95H3QM3WBJX", "Overall": "5.0", "Content": "What can I say... Its a super fast high quality digital camera and video recorder in one. The 18-55mm lens is good to start with. I also picked up a Tamron 75-300mm and a fish eye attachment. The HD video is amazing however the software out there is not common for viewing and editing the .MTS files format. The audio on the video is crisp and clear, just don't you [the photographer] say anything because it will be very loud in comparison. The menu is different from the out dated Sony menu I was used to, but easy enough to use. For those who need a quick camera and video to match, this is the camera for you.", "Date": "May 19, 2011"}, {"Title": "worthy upgrade in digital cameras", "Author": "awesome dentist", "ReviewID": "R29E08WJ6SWM2", "Overall": "5.0", "Content": "features prompting the purchase were 16+ mega pixels, video option but mostly the D Range Optimizer to reduce shadow and highlight editing", "Date": "February 19, 2011"}, {"Title": "insanely awesome", "Author": "humblgumbl", "ReviewID": "R1RXXO6S137KP", "Overall": "5.0", "Content": "im not gonna make a long review i'll just give you a little taste of the videofunction (insert /watch?v=5ELWb6wVupQ on youtube) which is, in my eyes, mind blowing if you have a good lens: at least f2.8 or better.i am using tamron 17-50 f2.8 in this clip and it is great!this camera is a dream to all creative minds because compared to canon 550 D or even canon 5d mkII the focus is done by the camera, which leaves room for much more interesting camera movement, and as you can see in the video it is superfast and accurate! sony has really outdone themselves by making this camera!!also the avchd is a good compromise of size and quality and the 50i images are calculated back to 25p (30p in america) by imovie, which is very convenient and abolishes any ghosting in the shots!also for photos the camera is excellent! all in all this camera is one of the best things i bought and i recommend it to all of you, but make sure you get a good lens as well. this camera is wasted if used with the kit lens!insert /watch?v=5ELWb6wVupQon youtube to see a video i made for a friendgreetshumblgumbl", "Date": "January 22, 2011"}, {"Title": "Leaves a little something to be desired...", "Author": "Marktwain10 \"Marktwain10\"", "ReviewID": "RKU6SUV5T38D4", "Overall": "4.0", "Content": "I expected this camera to be so much better than my previous camera (a Sony a330) but over time I felt the improvements weren't significant enough and I never enjoyed the electronic viewfinder as opposed to a pentaprism viewfinder. For some reason it seems I can get almost as good pictures with my lesser Sony a330 camera at lower iso settings (iso 100-400).  At higher iso ratings, however, there was an advantage of having the a55, which is good up to 800 iso. After that some noise starts creeping in, but still iso 1600 is rather usable especially if you have photoshop or noise reducing software. I've even been able to pull off iso 3200 with noise reduction, but any higher than that and I wouldn't recommend it unless you are desperate. The 10 shots per second is kind of too much, I find that even 7fps has been more than enough.I had a hard time deciding between this and the a580, but ended up with this because the video mode can autofocus and is of good quality, plus this one was available to me for a few hundred dollars less. The 16 megapixel sensor of the a55 actually shows a difference between the sharpness of the 18-55mm kit lens and the Sony 50mm f1.8 lenses which I own. The 50mm f1.8 is sharper than the kit lens, but there was no real noticable difference between the 2 when using my a330's 10mp sensor. On the a55, I could tell there indeed was a difference in sharpness between the 2 lenses!The a55 is quite a battery hog so I got two batteries (a must). But I do like how the electronic viewfinder will show you in manual mode what your pic will look like before you even have to take a picture. I've heard of overheating problems with this camera; mine does not have chronic problems with this although sometimes it shuts off and I have to turn it back on so I'm not sure if it overheats when this happens? Some may not notice this but when using the pop up flash or an external flash, there is a small delay before the flash fires, which my Sony a330 doesn't have. It's definitely noticeable to me and other people on internet forums have talked about this. For me, this is the camera I grab when I do not want to use a flash since it can handle having it's iso turned up. But this lag has caused me to miss action shots in the past when a flashgun was needed. Without flash though, this camera has one of the quickest shutter reaction times on the market.There are a lot of cool gadgets put into this thing, but the auto hdr mode only works with jpeg, as well as other functions. My Minolta lenses also work on this camera, and since the a580 is being phased out this is probably the best camera for the money Sony makes, (except for it's now being replaced by the larger a57!) I find this camera is easy to hold and comfortable yet being smaller than just about any other dslr (which to me is a plus). I don't understand why some people can complain about how this dslr is too hard to hold when it's easy to curl your pinky under the camera like you have to on just about any point and shoot or film slr. This camera is worth a try, It's pretty hard not to like and will get most jobs done well, though keep in mind the newer a57 is probably more refined and most likely has any problems the a55 may have had all worked out.", "Date": "March 31, 2012"}, {"Title": "Excellent image quality", "Author": "R. Mcclymond", "ReviewID": "R26XMTLOCI9OYW", "Overall": "5.0", "Content": "This camera is flawless for portraits and stills. I'm not much of an action photographer so I can't speak to that.But for my type of photography it is unbeatable for the price.I'd recommend it to anyone.", "Date": "March 10, 2011"}, {"Title": "Sony a55", "Author": "rickyhensley", "ReviewID": "R1QW3UZYGI1OQ3", "Overall": "5.0", "Content": "This is my 2ND Sony DSLR or should I say 1 DSLR and one Translucent Tech DSLR.  One word, brilliant!  2010 Camera of the Year!  Is not for everyone, but if you like the thought of something out of the ordinary, then this piece of technological wonder is up your ally.  I am well pleased and even though the price is up-there with Mid-Level, I was still pleased with the quality and workmanship of the tool.  And as a tool, that is why you would buy, not a Photo Shop camera for portraits, but for taking out into the real world and having fun again with a piece of Camera history.  Highly recommend.", "Date": "January 5, 2011"}, {"Title": "Lots more to explore, but works as advertised", "Author": "John Harvey", "ReviewID": "R1WMGSD0WJJMC", "Overall": "5.0", "Content": "I bought this as a gift for my wife after reading reviews in the NY Times and on the B&H; web site.  She's been using it for about three weeks, and so far, it is living up to the hype.  The pictures are gorgeous, the interface is relatively intuitive (to do the basics).She hasn't dug into the rapid-fire photographs (i.e. the 10 photos/second), and has only begun to use the video.  One feature that works flawlessly is the panoramic photo.  You simply hold down the button and pan across the scene, and the camera does the rest.  She's tried this in low-light and daylight indoor settings.I haven't given it five stars across the board for the following reasons:- This is our first experience with an SLR camera, so I can't say that it's clearly better than other SLRs- My wife hasn't exercised all the key features of the cameraRegardless, she has loved the experience so far.", "Date": "November 24, 2010"}, {"Title": "A Smart Camera", "Author": "J. Tallman \"Mistah\"", "ReviewID": "RP2YQ5C5IMO4J", "Overall": "4.0", "Content": "I've found that this camera does what many claim to do: It helps to make taking good pictures easy.  Somehow the camera's automatic adjustments seem to sense just what you're going for, and the quickness of the translucent lens system helps, too.  I'm happy with this purchase.", "Date": "January 4, 2011"}, {"Title": "SLT-55 very satisfied...", "Author": "Jose Ramiro Adan Charles", "ReviewID": "R1QWQ186SFVMDV", "Overall": "5.0", "Content": "Very responsive and accurate, with the tamron 17-50 I'm have not missed a shot of my two year old son.", "Date": "November 16, 2010"}, {"Title": "Died", "Author": "Ricky Mensch", "ReviewID": "R2560QYQSRGC3F", "Overall": "2.0", "Content": "This camera died and will cost too much to replace. Will not power on at all. Only had 20,000 images on it. Other than that it was a good camera. Since replaced it with the Sony a77.", "Date": "January 12, 2014"}, {"Title": "Video recording problems", "Author": "GreenT \"GreenT\"", "ReviewID": "RSBRNHSV3NP5P", "Overall": "3.0", "Content": "I used this camera 2 days ago to record our son's basketball game and take some photos. Most of it was used for recording and it kept overheating and shutting down. However, I was impressed with the quick shots the coach showed me it took and it looks like it has pretty good shooting ability. He said it captures indoor shots with the F.5 lens pretty good.", "Date": "December 17, 2012"}, {"Title": "The best of everything!", "Author": "SueB-AlwaysBusy", "ReviewID": "R1J8Z641YN9OC2", "Overall": "5.0", "Content": "I have had SLRs for most of my life.  When I finally made the jump (I dragged my feet) to a digital SLR, I still really, really missed my film SLR (the range of what I could do was so limited with the digital).  Then I got the Sony A55 -- it ROCKS!  I'm in Germany and even in the huge cathedrals on dark winter days, I'm getting awesome shots without a flash! Its so quiet that I make more noise walking in bulky winter clothes than the camera does as it takes pictures.  I'm finally breaking away from using eye piece viewfinder (the images look really grainy through the viewfinder even though they come out great); but the images on the digital back are good and takes less camera battery.  Even with a telephoto in a dark church, I'm still getting great shots.  This camera is amazing -- I recommend it to everyone!!", "Date": "February 6, 2011"}, {"Title": "It's still over-heating in video mode - NOT GOOD!", "Author": "Jeffroar", "ReviewID": "R32BYAJEBGBAE0", "Overall": "2.0", "Content": "I bought this \"great\" camera a week ago after calling Sony about the over-heating problem and hearing from the rep. that this problem had been resolved. That is absolutely not true. Either he was mistaken or he lied. I tested the video feature inside my home at 66 degrees and it overheated after just a few minutes. It shut down completely. So I again called Sony and I was told there is only one way to get around this problem: turn off the \"steady shot\" feature. The steady shot feature, of course, is to reduce the hand shake effect. I explained that this will simply lead me to have shaky video, especially when zoomed in, so the suggestion was to use a tripod. How many of us want to use a tripod every time we video? I don't think chasing after my little grandchildren and using a tripod is a good match. But I tried it repeatedly without the steady shot on, and it STILL overheated. Instead of taking about 4 minutes to shut down right in the middle of video, it took anywhere from five to 19 minutes before shutting down, and my home was still very cool at 66 degrees! This otherwise apparently very good, if not excellent, camera gets downgraded seriously because of this problem. The second Sony rep. had no idea if this problem is even being addressed by Sony technicians. It was never mentioned to me in the Sony store I visited. Hey Sony, this is how you treat loyal customers? You sell them defective products? Take this off the market! Fix the problem already. Recall the cameras and fix them. What are you waiting for? I'll tell you what I'm waiting for: An official response from Sony as I filed an official complaint (weeks later, still no response). I will update this review if and when I hear back from Sony. I'd like to suggest you NOT buy this camera until further notice unless you don't plan on using the video feature, in which case I don't think it makes sense to buy this camera anyway!One other point: The lens kit that came with the camera (18-55mm zoom) does not zoom smoothly. In a Sony store I must have tested a half-dozen of these lenses and not one was smooth. The staff members were bewildered.I must add that this camera has wonderful features, is very fast, and takes great shots. It's really a superior camera! I hated to give up the panorama mode, for example, and I really hated to give up the camera, but I returned it because the video feature it just too important to me.", "Date": "May 19, 2011"}, {"Title": "bad camcorder", "Author": "devon", "ReviewID": "R1CEVRL1XU8V3G", "Overall": "1.0", "Content": "The camcorder made a horrible squealing sound while recording I don't know if this was just my camera or all the cameras like this one but I will not buy another one.", "Date": "September 9, 2013"}, {"Title": "Not good in low light", "Author": "Book Lover", "ReviewID": "R24QUPMVJWC5PA", "Overall": "3.0", "Content": "The concept of the Sony A55 is outstanding, 10 frames per second, excellent shots and versatility.  I really enjoyed the size and speed of the camera, but was not pleased with the quality of low-light shots.  In these settings the focus is not good and the shot speed is very slow at times - even affecting the quality of the shots.  In a perfect world it may be helpful to upgrade to a more advanced lens that has greater functionality in low-light settings.  Even outside taking some sports shots of our kid's the camera was not as crisp as expected.", "Date": "February 11, 2012"}, {"Title": "In some ways, this camera does fall short...", "Author": "Michael Tounian", "ReviewID": "R36SBPC48V7JID", "Overall": "3.0", "Content": "I wanted to give the camera a single star, due to my annoyance with the worst feature of it, the HD video and it's complete automation. However that would not be fair to the product, and I will complain about the HD issues soon. I bought the A55, spent considerable time testing it (or playing with it, depending on how you look at it), and overall was disappointed with what I found. But that's not to say some of it wasn't great.First, to what I liked about it:The new EVF system is pretty cool. The ocular part is nice, but it lacks any clear idea of the image's latitude. How black are the blacks? You won't know unless you use the flip screen. I have done some tests to determine the accuracy of the screen, and have found it to be a damned fine representation of color and latitude on the final photo. There is usually a huge delineation from viewer to final image, but Sony seems to have nailed this one down good.The phase AF detection or whatever the hell they call it, does work pretty well. I would almost never use it, but when I tested it on some children playing outside it did a remarkably good job tracking them with only a few hiccups. A good feature for parents, I would imagine, but not so much for serious photographers.And now, to what I hated about it:The HD video is touted as a huge part of this camera, but is completely useless to anyone who knows a thing about photography. The entire process is automated, which is just unforgivably stupid on Sony's part. If you take video during the day it looks fine (to a point), but if you want to, you know, actually LIGHT a shot, or shoot at night, you are completely SOL. You can slightly adjust your exposure index by no more than .7, which does you absolutely no good when the camera automatically turns the ISO up so high that your resulting piece of footage is thoroughly mired in pixelation.Come on Sony, don't toss a piece of crap video function you aren't finished developing properly on the A55 just to help the advertising team clock out early. DSLR (or in this case, DSLT) cameras, even the baseline models, are made with the intention of allowing a user to set their stops, shutter, etc. so why is this video function built so archaically? It is so useless that I am almost embarrassed to admit I'm a Sony user. If Sony EVER wants to be taken as seriously as Canon or Nikon, they need to quit making half-assed products that the professionals laugh at.Also, the fact that the only way you can get 16.2 megapixels is in standard 3:2 photo size is really annoying, and frankly, a bit dishonest. If you want to switch to a 16:9 photo size, you are downgraded to a 14.2 megapixels. I just don't understand why they would do this, when so 16:9 is such a prevalent aspect ratio today. Just plain stupid.And you've seen all the other reviews, I don't need to go into detail about the battery life. It sucks. Even in stills mode it drains at least ten times faster than my A200. Yes yes, different cameras entirely, I get it, but still, it just depletes too fast to be practical.In summation, the A55 is not a terrible camera, in fact some parts of it are an interesting leap forward in photo technology. But for me and those who shoot like I do, it comes at too high a cost to its other important features. I feel like Sony as a company gets their products about 80% of the way there and then somehow they take a wrong turn that is so unforgivably stupid it makes them look like fools next to Canon and Nikon. The A33/55 line was rushed out for sales, so I rushed mine back to Amazon before the deadline. I'll hedge my bets, keep all my Zeiss glass and hope Sony actually gets it right with the A77 that should be out soon.", "Date": "March 9, 2011"}, {"Title": "Broken after 1-year of ownership", "Author": "Marlo", "ReviewID": "R1G3NIK2YX5X1D", "Overall": "1.0", "Content": "A month after the manufacturer's warranty expired, my camera is a worthless piece of junk. I ejected the SD card and tried to re-insert it one night, nothing. The SD card slot is broken and will not allow a new card to be inserted. This makes the camera worthless and since it is out of the warranty, an $800+ paperweight.Bottom line: Don't waste your money or your time.", "Date": "January 7, 2013"}, {"Title": "Sony SLT-A55VL", "Author": "Marshall M. Midden \"marshallmidden\"", "ReviewID": "RQP36YIH9EKC6", "Overall": "5.0", "Content": "Sony a55 DSLR Camera with 18-55mm zoom lensThe lens is interesting. Not really good for macro, not good for distances, just a general purpose lens. It is really light, making it appear to be made of a lot of plastic. A year of use will tell.Remote works with minolta remote. Diaptor adjustment works. Auto viewfinder verses display switching is nice. Electric viewfinder in dark situations automatically brighting the image is like the A2 -- nice!Menus are OK. Having to wait a couple seconds for the detailed messages to appear takes a while to get used to.The 1:1 pixels are a tad confusing. I believe the quality of the pixels of the A2 8mb was better. Total picture image is better on the A55 -- due to higher resolution.In standard mode, the greens appear cropped. Easily fixed in GIMP. Blues are always crammed.The trashcan button used to magnify the image to verify focusing -- WOW.The AUTO+ and D-RANGE do not seem to be necessary in normal use. (GREAT!)Camera is extremely light.Complaints:a) Can't remove the battery or SD card when on manfrotto quick release tripod -- door won't open. A2 and 7D were fine.b) I tend to use A mode. I keep turning the camera off due to the position of the on/off switch right near the rolling switch.c) Manual focus is not easy to find on the left front. (Almost have to look to be able to switch it.)This replaces my A2. Yes, a perfect replacement. Is it an upgrade? Only in that replaceable lenses are available. Still don't have a lens that does macro as well as the A2. (And six thousand dollars is not acceptable)", "Date": "April 9, 2011"}, {"Title": "Camera !!WAS!! good while it lasted...", "Author": "alasania", "ReviewID": "R3L1Q655KXFC73", "Overall": "1.0", "Content": "I bought mine in May 2011 and it worked fine for about a year. In it's 13th month, just after the warranty had expired, it conked! It wouldn't turn on no matter what I tried. The authorized service center in India wouldn't consider it as under warranty and insisted on charging me around $200 to replace the electric circuit board inside. After keeping it for more than one month, they said that the spare part required was unavailable and they had sent queries everywhere. Now i'm stuck with a dead camera body, two SONY lens, two SONY memory cards, two SONY batteries, and one SONY bag apart from some lens filters, some lens cleaners, and a David Busch book. $1800 down the drain with SONY unwilling to do anything and disowning their product.", "Date": "September 26, 2012"}, {"Title": "good", "Author": "sheungmanlau", "ReviewID": "R17VV2PZSX9G8U", "Overall": "4.0", "Content": "i brought this 6 monut ago.it work.take pictre or moive.boot good.later may be i will buy again.i like it to take mt picter", "Date": "January 8, 2014"}, {"Title": "Hoping this Upgrade will Be Good for a While ...", "Author": "Amazon Customer", "ReviewID": "RF5MG3DAL5G92", "Overall": "4.0", "Content": "I started with an a100 (and stupidly) upgraded to the a550; ended up buying an a55 body (using it with a 17-50 Tamron f2.8).As anyone else would have done, I've read all the reviews out there before deciding on getting this body.Considering all the [much] nicer upgrades for the a77 or the NEX7, I am in no position to step up for anything above 1k (especially after already investing on a prime lens and an external flash), AND the cumbersome process of having an adapter for the NEX series to use A-mount lenses (which then dissolves the \"portability\" portion of the body) really annoyed me.I've also read that you can only use the HVL-F type external flashes on a NEX7 and not on a NEX5(n). Considering these cameras are already good (or so they claim) on low light ISO shots, I still trust my HVL-F58AM external flash until it dies on me. I do not shoot anything above ISO 1600 anyways (with or without flash), as it gets too tiring to [choose the right pics and then] perform yet another noise reduction process using Lightroom.NOTE: There were claims that the flash on the NEX7 can be \"tilted up\" to use as a bounce flash (interesting) ...The 9-minute/2GB limitation should be good enough for my occasional use of the video functionality (blow one's birthday cake, panoramic sweep of a place we're visiting, etc.)", "Date": "April 13, 2012"}, {"Title": "Wonderful camera", "Author": "Daniel Miller", "ReviewID": "R16VD48T2RWVA3", "Overall": "5.0", "Content": "Wonderful camera does everything and more that you could want. Image quality is par none. Just now trying to decide which zoom lens to go with.", "Date": "September 6, 2011"}, {"Title": "Don't get this if you want a traditional SLR.", "Author": "Pan", "ReviewID": "R4XVXFI9ZMB6H", "Overall": "3.0", "Content": "I know I'm going to get a lot of flack for this review, but as a long time user of traditional SLR's, I just couldn't get used to how plasticky and gimmicky this item felt. The EVF is great and all, but because it's electronic and not optical, it becomes unusable in low-light conditions as it lags behind what you actually see. Optical Viewfinders have never let me down and will continue to suit my purposes. The build of the body tries to imitate a magnesuim alloy bodies, but is actually just cheap polycarbonate. Overall, it feels more like an advanced point-and-shoot (Micro 4/3rds) camera instead of an SLR. Some people will enjoy its compact size, but people who have been using regular SLR's will feel uncomfortable. I returned it after 2 weeks, got my full refund and bought a Canon 60D instead (and I'm much happier with that purchase).Tech and gimmick junkies will love this item as it makes things like panoramas and HDR much more convenient. I personally enjoy manually working on projects myself instead of relying on the camera's processing ability, but that's just me.", "Date": "August 3, 2011"}, {"Title": "Tethered Shooting", "Author": "AK", "ReviewID": "R3RFQTZWOF0GKF", "Overall": "5.0", "Content": "I like the picture quality, design etc of this camera.I mostly do close-up photography in a controlled environment/room.  Tethered Shooting is a better option in such a situation which is missing in this camera.", "Date": "March 30, 2011"}, {"Title": "Just like McDonalds...Im Lovin' It!!", "Author": "Dispatcher", "ReviewID": "R16KMGCZSJFR6T", "Overall": "5.0", "Content": "I am enjoying this new camera so much!  It goes everywhere with me.  I have already ordered another battery.  Not because I have had any trouble with the other one, I just don't want to be without it!!  It is the best camera I have ever owned and everywhere I take it, people are like WOW!!  That is so awesome!!  The pictures are beautiful and the speed & capabilities of this camera...Just FANtastic!!  I am definitely a fan & am anxious to continue to learn and play with all the different features.Thanks Sony!!", "Date": "July 31, 2011"}, {"Title": "Surprising issues", "Author": "KB", "ReviewID": "RAHV04EQO1P5B", "Overall": "4.0", "Content": "This SLR is a delight but there are two very surprising issues that Sony missed the mark by a long way.In order to select flash, one has to push buttons 4 or 5 times (depending on where you start).  Incredible...\" let's see, need to freeze this motion with flash..Hey, you subject...just hold still while I fumble with 5 button pushes and having to look at the screen...OK, now continue\"  Previous products had a single, dedicated readily available button to access the flash.Next issue.  The viewing screen is hinged at the bottom.  If you want to compose yourself in the image, I don't know how to do that.  A tripod won't work, the tripod is attached in front of the screen, no can use....You could turn the camera upside down, and find some way to brace it since the top, now bottom, has no flat spots.  If you want to take a low shot...again, have to turn the camera upside down,and potentially bang the top of the camera on the ground.  Two MAJOR design flaws....so well thought out, and such a poor design detail.At least they fixed the movie issue.  Their early still cameras had one button for instant video.  then they buried that into a menu, and now, thankfully, a one button solution to video!  YEAH.", "Date": "March 28, 2011"}, {"Title": "yes, yes, yes!!", "Author": "Joshua Williams \"Joshua Williams\"", "ReviewID": "R2GA0K3KTZBZVJ", "Overall": "5.0", "Content": "I cannot wait to get my hands on this camera! I bought an a33 and took it back to get this one! The A33 is awesome as well but wanted the faster one! I am a loyal Sony camera fan, and upgrading from an A350 which is an awesome camera and has been put through its rigors for 3 years now! I highly recommend this product! And the price...... untouchable, only thing is you may have to wait for it due to high demand!", "Date": "January 19, 2011"}, {"Title": "Should I keep it or return it", "Author": "@shish", "ReviewID": "RWC1H8FGWZVG1", "Overall": "4.0", "Content": "Hi, I am confused at this point though I purchased this camera and thinking to return it.I had recently purchased Sony a55 and had played with it for 3 weeks now. No doubt after reading the articles on internet, even I got impressed with the features loaded to this camera. B'cos of which I got it. BUT..1. I am not that much impressed with picture quality when I compared it with my friend Canon T1i.2. More than that - the electronic view finder is killing me. You are NOT getting the clear view of what you have in front of you. Lot of noise when you are in low light area (even in house). My point is - when you can't clearly see the object how can you get ready to shoot it? (Even I have observed the noise on LCD as compare with that Canon T1i).Is it only me having this issue or someone else also experienced it?3. One more Q: AF feature is awesome in this camera but what I have noticed: After the shoot you want to hang that camera for short break without turning it off. Now that camera is hanging through your neck on your tummy; pointing to random objects, which come in front of it. Now u r on small beak and not not shooting it, because of continuous AF - camera lens keeps on rotating for Auto Focus (till you don't switch off the camera OR put it on manual focus).This keeps on annoying me (that lens noise) and I guess it is also consuming the battery (no wonder why we see lots of user complaining abt battery life).Any simple solution or setting change for this?PLEASE reply and let me know either to keep it or return it?", "Date": "December 15, 2010"}, {"Title": "Disappointing, Step back for Minolta/Sony", "Author": "Uwudndno \"Uwudndno\"", "ReviewID": "R1NIBFLJ3MNZRQ", "Overall": "3.0", "Content": "I bought this camera after it got generally great reviews from trusted sources. However, I found it to be a snap shot camera and not at a pro-sumer.I was dissapointed because Minolta and then Sony has done great work in ergonomics, but here they went back on allot of this for the  a55. I thought the NEX 5 was for the point and shoot crowd and the a55 would be for those of us who know want fast, immediate access to manual controls, so that our decisions regarding the image can be implemented, in situation where split seconds do count.I have used the DSC r1 for years now, and even-though its not exchangeable lens, it is that important step up in ergonomics, or rather it was so good, it makes the a55 a step down.The A55 cuts back in key places;No second selector wheel, resulting in loss of immediate exposure control. you have to press a botton and then set it. can not instantly go into aperture or shutter priority modes (as you the 9xi allowed you to do).Has a flash button, that does not bring up the Flashmode menu, seems to activate flash but not deactivate.Generally in most of the cool newer modes most of the manual controls are taken away.Camera is too short, normal hands can not get a good grip on this camera. This is problem even with the not so heavy Tamron 17 to 55 on it.When using the additive Autosweep Panorama function, the camera will not focus once you start the panorama. This means indoors, where this function is great, you have something close to you at the beginning of your sweep in focus, then the middle of the room totally out of focus. More important: it often simply does not work. 80% of the shots i took in an empty apartment have jagged edges all over the images, where the camera did not manage to photo-stitch right. Full control, and a normal photostitch method, manually lining up the shots, would be better. This makes the AF/MF switch important and its a slider, normal I'd say. Except that the minolta 9xi had a really great one, again, Sony not using the ergonomic achievements they already hat.Sony/Minolta has sensor that autom. switches btw. screen and viewfinder (this goes back to the aformentioned 9xi, where it was used to activate AF, and not anoying). The problem is that it does not know if its your face or your body, that is close to the camera. So when you use the monitor while the camera is close to you, as one often does, kind of Rolleiflex style, I guess, then it will switch off the monitor (it'll run the image in viewfinder, but that doesn't help in that moment), before they had 3 setting switch, finder, auto, LCD. now there is a button (so sony knows the problem) but the button only works for to switch no to set. the camera goes right back to blacking out the LCD, and you have to re-press the dedicated button. Sounds like a small issue, but if you do allot shots from a high or low position this gets very annoying.AF speed. Again compared to the damn near two decade old 9xi, it does not seem that much faster (granted the 9xi was the fastest of its time). I had expected development of near instant focus by now, but pershaps unfairly.Overall handling really is worse than on previous lower priced pro-sumer fixed lens models, and that is a shame. However, I do not know the competition from other makers, so i can not say if the a55 is worse relative to its peers.", "Date": "March 25, 2011"}, {"Title": "Fragile...not for adventurers!", "Author": "travhill22", "ReviewID": "R11BWPTWV66L4Y", "Overall": "2.0", "Content": "I bought this camera specifically for my trip to Central America. My hope was that the camera would be durable enough to bring it to the beach...I was wrong. I literally was able to bring it to the beach once (trying my best to not expose it to ocean mist or sand) and the next day the camera wouldnt take pictures, only video. Now Sony is telling me that the repairs will cost $450!!!! More than half the cost of the camera!  I guess if you are taking pictures of flowers in your garden or in controlled environments where nothing can go wrong, this is a good camera. If your plan is to bring it on an adventure, I would stay away from this camera...it is way to fragile.", "Date": "May 12, 2011"}, {"Title": "Please Read This - Very Recent Sept 2011 (Sony A55)", "Author": "D. M. Crowder \"Busy Dad\"", "ReviewID": "R2BIGTEYNARCD2", "Overall": "1.0", "Content": "I purchased a Sony A55 (with lens) whilst in the USA (i reside in the UK) as i travel there frequently. After around 2 months i had noticed that this model (I had previously purchased a Sony A300 btw) didnt take shots at night correctly - very frequently blurring (i have 6 lenses which i tried against it - all started to do the same eventually)... Being a long term Sony user and supporter i thought that maybe it was myself (as i'm not a pro camera user) and i needed to understand the settings , etc... exactly 32 days later - the Sony A55 decided to stop working... i couldnt anymore attach a lense of any kind - because once i did - the camera body started going into a continous loop as if it was autofaocusing (to which i turned off all auto focus features and lenses)... howeer this didnt help... with a lense attached - very stranegly the camera would not let me go into any menu option... almost like the software was working oddly... anyway - to cut a long story short - i contact amazon as i purchased it from here and they sold this directly to me - to which they would no longer exchange it - despite the fact it was a few days after i purchased it and it went out of the 30 days warranty .. As i travel frequently and havent been able to get back to the states (been in far east for a while) - i now sit with a camera which costs $799.00 and cannot be used under any circumstances.... Sony a55 DSLR Camera with 18-55mm zoom lens", "Date": "September 30, 2011"}, {"Title": "Viewfinder kills the deal for me", "Author": "Josh", "ReviewID": "R15LDIFJZ5Q79I", "Overall": "1.0", "Content": "I really wanted to like this camera as it comes with a ton of great features that are normally only found in cameras costing much more. However the lack of an optical viewfinder killed the deal for me. The LCD viewfinder was just not something I could get accustomed to. It may just be my eyes or something but I had a hard time looking through the viewfinder and not seeing strange LCD color effects. If possible try this camera out in person before ordering to make sure you are comfortable with the LCD viewfinder.", "Date": "August 13, 2011"}, {"Title": "Amazon 2 Sony 4 - Used Camera In place of a new one???", "Author": "L. Wilson \"Lou W\"", "ReviewID": "R86IYLZZYXPU9", "Overall": "3.0", "Content": "I suspect the camera would of been good if I was the first one to have it shipped to.I did take a few photos and leaded the card into my SD slot when I tried to download them and my computer screen went gray then black - crashI TRIED GAIN AFTER BOOTING UP THE COMPUTER AND THE SAME THING HAPPENED.Then I realized at that point that there were no labels or tags on this camera. I have an A33 so I know how it should look new.Then after talking to some people who know more than me said it sounded like a virus was in the camera and tried to enter my computer thankfully I have a mac so it failed if that is what actually happened.So I know the a55 is descent not the greatest - but not this one I give a 4 but rating towards Amazon will be lower.They apologized and said it should not of happened and refunded all monies including shipping back but I cannot give more than a 2 to Amazon so I will average it off at a 3 rating", "Date": "May 12, 2011"}, {"Title": "Useless piece of junk", "Author": "Poul A. Costinsky \"pashka\"", "ReviewID": "RRS6O17K99IJ9", "Overall": "1.0", "Content": "This camera overheats. Sony knows about it, and suggests to turn the image stabilization off.This is outrageous by itself - I paid big money for this camera to be able to shoot handheld - but also does not help much. Worth even, I discovered this after 14 days return period, so now I have to put it on ebay.Not only does it overheat with the image stabilization on - that happens after 5 minutes - but also with it off, after 20 minutes or so. Imagine yourself in the middle of an important shoot, when this thing decides to shut itself off. The opportunity is gone. Moreover, it is nerve-wracking to operate because of that - instead of thinking about the shooting, you think about how much of the shoot you can skip so it won't overheat at the more important part.Without the ability to shoot the video with continuous autofocus, this camera becomes much worse value for money then SLRs from Canon, Nikon, and pretty much everyone else.Irritating, and absolutely useless for the purposes it is advertised. I will never buy anything made by Sony, ever again.Update: I finally managed to sell this piece of junk, with full disclosure, to some Sony fanboy, and bought Canon 60D. Didn't overheat even once, and I use it a lot for shooting both video and stills. Definitely Sony's fault.", "Date": "March 4, 2011"}, {"Title": "Sonylover", "Author": "L. Tran", "ReviewID": "RW8BGETM58W9H", "Overall": "1.0", "Content": "Everything electronics in my home is made by Sony, 6-computer desktops, 7-laptops, 4-tv...lots of cameras...dsc f707,f828, f717, t90,t70,dcr-x1000, sr12, hdr-vx 100v, dcr 11......I can list forever, but this Sony A55 is a big disappointment...It feels so plastic, so cheap that I thought it was a toy. So, I don't really care, let's try some low light shots...terrible...too grainy.......Ok, let's try some video in door and outside at night....terrible, I can't even adjust anything,.no manual control...video looks too dark.,Eventually, I repacked it, called Sony to set up the return. Piece of junk.", "Date": "November 21, 2011"}, {"Title": "Sony A55V The important CONS thet destroy this product", "Author": "Dariusz", "ReviewID": "RP97F5SOGZJJ2", "Overall": "1.0", "Content": "HeyaIts not going to be an essay review, most of the info you can get from above reviews. This is the facts and what takes a lot of good stuff from camera.BasicallyLack of tethreating - Cant shoot to pc - work around buy 100£ wireless class 6 cars to wi-fi data to pc - eat more battery - long transfer not as efficient but not too bad after all.Lack of manual control over brightness of LCD/Finder with studio work - If I shot at 1/200 -iso 100 - F30 I cant see anything in my studio, even at F 4 I cant see anything - Useless camera for studio work black lcd - camera ended up in bin.Lack of force shutter shot when we cant focusFocus sometimes cant do its job when looking at slightly darker areas...This camera is good for a lot of out door/amateur work/partially sport (the auto focus is random... some time it'll focus some time it will not)For any pro-amateur and professional work in studio/outdoor studio/ with clients - DO NOT BUY IT.Until firmware update this camera is only a 1/3 of what Cannon and Nikon is offering in similar prices.", "Date": "March 17, 2011"}], "ProductInfo": {"Price": "$798.00", "Features": "DIGITAL SLR with Translucent Mirror Technology accelerates AF performance\nContinuous 10 fps shooting with continuous Phase Detect AF\nWorlds1st consumer HD video camera w/ cont. Phase Detect AF\n16.2 megapixels with Sony?s Exmor HD APS sensor\n1080/60i Full AVCHD or 1080/30p movies", "Name": "Sony a55 DSLR Camera with 18-55mm zoom lens", "ImgURL": "http://ecx.images-amazon.com/images/I/51FzdbHTt4L._SY300_.jpg", "ProductID": "B0043DKBTK"}}