{"Reviews": [{"Title": "Great for what it costs!  Everything for $100", "Author": "R. Jensen", "ReviewID": "R1ZW5BESJL37SX", "Overall": "5.0", "Content": "I have had the unit for about 6 months. Uses SD cards and Internal (70MB).It does a great job. I use it to shoot soccer games. I do find that in-doors can get grainy unless you set it for in-door use (They call it Digital Light), but then it works great. The built in light is kind of cool, but it only works out to about 6 ft. but what do you expect for an LED light.It has many movie resolution settings (5) VGA, WVGA, QVGA(60fps, all other 30) 720P and can you believe 1080P!!). The steady shot is must for shooting action because the unit is so small you just can't hold it still enough. The movies look great, but you can't zoom in 1080P HD. It also has a motion triggered setting so you can use it to monitor for activity.It downloads directly via USB or you can watch via TV, (composite and HDMI) movies are AVI, pics. are JPEG. And... by the way to does PAL and NTSC. The still camera function works well and the images and movies a piece of cake to transfer via USB since it treats the camera as a USB drive.The camera and video allow for white balance and ISO 800,1600) changes, 3 still resolutions (high-12MPixel, med-5MPixel, low-3MPixel) and does MACRO and has a timer. The microphone pretty much only picks up close subjects (20Ft).also has a slideshow function for showing pictures. It also loads directly to YouTube.The camera has special effects..You can select the mode according to the scene condition.* Auto: Shoot without any special effect on the image.* Skin: Shoot with an effect that makea skin tones more natural* Night: Use Night mode for night scenes or low light conditions.* Backlight: You can take shots when bright light is behind the subject.* B/W: The image is converted to black-and-white.* Classic: The image is converted to sepia look is applied to the image.* Negative: The image is converted as the negative of the normalHaven't used these......COMPLETE SPECS.......Image Sensor 5 Mega Pixel CMOS SensorOperation Modes Movie Record, Picture RecordLens F3.2 (f = 7.2mm)Focus Range 200cm~infinite (Normal Mode)Center: 20 cm (Macro Mode)Digital Zoom 1080p:1XOther video resolution:4XShutter ElectronicLCD monitor 2.5\"LCDStorage Media 128MB Nand Flash Memory (Usable storage : around 70 MB);SD/SDHC Card Slot supportImage Resolution High 4000x3000 (12M Pixels)Std 2592x1944 (5M Pixels)Low 2048x1536 (3M Pixels)Movie Resolution HD(1080p) 1920X1080(30fps)HD(720p) 1280X720(30fps)WVGA 848X480(60fps)VGA 640X480(30fps)QVGA 320X240(30fps)Light Digital light On/Light On/OffWhite Balance Auto/Manual (Daylight, Fluorescent, Tungsten)ISO Auto/800/1600Self timer 10 second delayFile Format Picture: JPGMovie: AVIImage play Single Image/SlideshowPC Interface Mini USB 2.0 PortTV out NTSC/PAL Selectable, HDMIBattery Lithium-ion Rechargeable BatteryDimension 100(H) * 57(W) * 17.9(T) mmWeight 87g (without battery)The battery lasts for just short of 2 hours on 1080P HD. One of the best features is it tells you how much recording time is left as you change resolutions. It also comes with movie making software (decent). I really couldn't be much happier for the money! What do you expect for this kind of change...", "Date": "January 11, 2012"}, {"Title": "Not a Good HD Camcorder", "Author": "D. Melendez", "ReviewID": "RZ7X089Y262WO", "Overall": "1.0", "Content": "I bought this to use with my students but after trying it out for a few days, I knew it would not be good enough for what I planned using it for.The camera shoots horrible pictures!  Unless the people or scene is absolutely still, you will get a blurry image.  The HD recording is good but nothing to rave about.  The light does help out a bit in low light situations, but if there is not enough light in general the video looks very grainy.My other big con against this camcorder is that the video it shoots in HD is a file that unless you install the codec on the cd-rom disc, you will be unable to view the video and/or hear the audio...stupid proprietary file format or something.  I lost my disc and now I am having to try to find the codec online.  WMP, VLC, Nero and PowerDVD cannot play the audio on the HD videos I have shot with this camcorder now that I need to reinstall the codec. :(If you don't expect much from this camcorder you wont be disappointed but I was so I wish I had saved more money for a better camcorder/camera.", "Date": "December 23, 2011"}, {"Title": "Best product for the dollar", "Author": "bevoo", "ReviewID": "R1SATT8BO0JX9B", "Overall": "5.0", "Content": "The sale from office depot was $99 for camera $20 service plan $20 16GB card. Awesome deal.Big 3\" inch screen, 4hr video, flip view so you can take \"myspace pose\" pic of yourself or a serious movie.Audio for the video is loud and picture is so clear. 16x zoom is handy and actually true to its promise just depends on the scape. Touch screen should come with a stylus though. I love this camera. Such a good purchase.I do not regret buying this at all.", "Date": "February 7, 2012"}, {"Title": "Great for the money!", "Author": "Phil", "ReviewID": "RN2JL0AYGUX8I", "Overall": "4.0", "Content": "This a a great little camcorder! It has many of the features of the more expensive camcorders. Color and sound I thought was very good! I carry this little camcorder on a strap around my neck. It's so light you forget it's there after a while. Just remember, this is a small hand held camera and takes a little time to master it's use. A couple of days practice and you will be fine! I have other camcorders,but this is the one I use most. I think the 1080p color was great! When you order this Ativa, you might notice a simularity to the Toshiba Camelio.", "Date": "June 2, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Ativa Mini HD Digital Video Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/516zOyJEuJL._SY300_.jpg", "ProductID": "B004E79J1G"}}