{"Reviews": [{"Title": "Best GPS point-and-shoot", "Author": "Kevin", "ReviewID": "R2NMN6GL8JXJT3", "Overall": "5.0", "Content": "Picture quality is excellent, both in sunlight and very low light situations.  This camera was compared to similar Panasonic, Sony, and Canon cameras.  The Panasonic was awful, but the Sony and Canon were good.  But after picture quality, those don't even compare to the features and ease-of-use of this camera.The 24mm wide angle is great.  It allows pictures to be taken in small rooms, fitting much more real estate into the picture.  It's also great for group shots.I've had no trouble getting a lock on GPS, even indoors, and it usually only takes 5-10 seconds after turning the camera on. It does not drain the battery any significant amount to keep the GPS on.I love the panorama function.  Just push the shutter button and rotate the camera, and it stitches a nice panaorama together.10x zoom is great, but it utilizes the imager to pull in even higher zoom if you're using less than the 14MP.  At 3MP you get 31.6x before digital zoom kicks in.If you do the firmware update to Version 1.01 you can save all the GPS log data to a .kml file, which can then be opened in Google Earth to see exactly where you've been.  It even logs when the power is off, maybe every minute or so.  Unfortunately there are not photo links in the path though.  At this point it appears the only way to view and select your pictures from a map is to upload to Panoramio, Flickr, or another photo site. I was hoping there would be a function to do this with Google Earth but there isn't.There is a separate video button which is nice.  HD video does take a lot of space though, approximately 80MB/min.The menu is very quick and easy to navigate for changing things like flash, resolution, shot mode, etc.It has a built-in primitave map that you can scroll in, and pressing a button centers the map on your position.  There are many built-in pictures too. For example you can scroll to the Grand Canyon and see pictures from all the view points.The camera is considerably larger than the other Exilim models I've had although it still is reasonably small and portable.It has mini-HDMI out, but does not come with a cable.  I bought one on Amazon for less than three bucks.", "Date": "December 10, 2010"}, {"Title": "Casio GPS Camera", "Author": "George Young", "ReviewID": "R2CZ5OMCLG41P9", "Overall": "4.0", "Content": "Loving this camera. The GPS is fast and accurate. The battery life is impressive. The optics are so so. Easy to use.Had a Nikon Coolpix P6000 GPS camera and the GPS was absolutely not usable. It would take 15 minutes to get a fix, then lose the fix and the battery life was just a few hours, and the battery would die even with the camera off. The Casio has been is use for 2 weeks now, taken over a hundred pictures and still has half a battery left.Sold the Nikon P6000 on eBay.The Casio EX-H20G powers on in 10 seconds, point and shoot and you have accurately geotagged photo. This is such an easy camera to use. The optics are not that impressive but I am very happy to have bought the EX-H20GThe GPS is suppose retain accuracy even if it can't receive satellite signal, will be going in some abandon railroad tunnels soon and will test this out.", "Date": "December 10, 2010"}, {"Title": "Unique GPS Hybrid Camera", "Author": "MetTech", "ReviewID": "R3LG1RBO0DUCMX", "Overall": "3.0", "Content": "It shares many functions with other high end point-and-shoot cameras.  The panoramic function is very good.The negatives are (1) buttons too close together, (2) \"On\" button at the back, too easily activated when the camera is in the pocket, (3) location, Latitude and Longitude are reversed (on my Exlim), placing Los Angeles, California at the opposite side of the world, some where southeast of Perth, Western Australia, and (4) no printed \"User Manual\".  It is a PDF file on a CD in the same box.  It is very exhaustive and long.All other GPS function, such as place names, distance transversed, map, etc. work perfectly.  The NORTH/SOUTH and EAST/WEST reversal is a big frustration.I called Tech Support.  It did not resolve the problem.  It seemed this issue was not in their canned answer list.  I was advised to find a local authorized repair shop.", "Date": "January 13, 2011"}, {"Title": "Cool little GPS camera", "Author": "J. J. Roper \"Eclectic Reader\"", "ReviewID": "R1TD8CAJBLC15A", "Overall": "4.0", "Content": "When I bought this camera, I didn't anticipate that it would be so cool. But, I went on a trip to the desert southwest (Grand Canyon, Bryce Canyon, Zion) and enjoyed it very much. It does a great job of panorama fotos (only one had a bad fault right through my wife's face), both side-to-side and up-down. The 10x zoom is great for this sized camera and the macro surprised me. I use macro a lot, and this camera has a setting where it automatically decides to use macro. I have other cameras that do that, but none does it as well as this Casio. And, when I used the configuration for super macro, again, I was very pleased. Along with that, the GPS deal is great - even from an even from an airplane window I got some good GPS readings, which is more than I can say for my old Garmin GPS II! I do research where I like to know the locations of subjects and so a quick photo does the trick!I highly recommend this camera and just make sure you have an extra battery because you may take so many pictures that you will need one!", "Date": "January 18, 2011"}, {"Title": "Great Family Camera", "Author": "Happy Lady \"Book Lover\"", "ReviewID": "R1Y8A4DMJDU888", "Overall": "5.0", "Content": "I want to start by saying that I am in no way a professional photographer. Although, I do enjoy taking pictures of my family. Our very old previous camera finally died and we realized we needed to get a new one. We did not want to spend a lot of money, but we wanted a nice camera that worked well for a family to capture memories. I shopped for a long time and did a lot of research on line. (There are SO many cameras out there to choose from.) It is quite intimidating to me to read some of the reviews for most of the cameras.  I am not familiar with most of the specific technical aspects that most people include.  I am sure that there are several cameras that are really great, but I ultimately chose this one.I purchased this at a military store for a little less than it is sold here on Amazon. I was looking at a Sony and a Nikon, but they we a little more expensive and we really didn't need all the extra bells and whistles that most of those come with. When we talked to one of the representatives at the store about this camera, he was very helpful and informative. This camera has a few features that we didn't even know we wanted. It also has a few bells and whistles that we will probably never use, but most cameras now a days do. I will list the pros that I, as a non-photographer and just someone who wants to capture memories, really love about this camera.1. This camera is very fast to turn on and off. I know my old camera was almost an antique, but I hated hitting the on button and having to wait for it to \"warm-up\" forever before it decided that it wanted to take pictures. As a mom of young kids, this is very relevant because my kids never want to stay still very long.2. There is a 2.7in viewing screen on it. My last digital camera had a 1in screen on it. This screen is huge and very easy to see both the pictures you are taking and the videos.3. It connects to the TV. It comes with a cord (I don't know the specific name of it) that connects the camera directly to the TV and you can view the pictures as a slide show on it. You can view the videos as well and they come though crystal clear even on my 52in TV. (This is my favorite feature!)4. It connects to the computer. It comes with a USB cord that connects it to the computer. You can view and save the pictures and videos on it.5. It comes with a rechargeable battery and a charging unit for said battery. Again, as a mom of small kids who seem to have a never ending stream of toys that eat batteries for snacks, this it a huge help. (This is my 2nd favorite feature!)6. It has a flash feature that is easy to turn off and on or set to Auto. I love this because I am not very tech savy and I hated fighting with my last camera to 1st, find the flash and 2nd, make any changes or adjustments to it at all.It also has a lot of the extra's that someone better versed in \"camera language\" will surely love. It also can connect to a tripod, which must be purchased separately.This is a fantastically easy camera to use and it is a perfect family camera. I would highly recommend this camera and in my opinion, it is very much worth the money.", "Date": "December 6, 2010"}, {"Title": "No regret for the price", "Author": "Amazon Customer", "ReviewID": "R1GK3F3G89VZ94", "Overall": "5.0", "Content": "The positive features have all been described in earlier reviews.  It is a very good camera for even a semi-serious amateur.Any one with geotagging needs will find it a good buy.  All features work well both in camera mode and once files are shifted to computer.  Use Picassa App on Mac and the Places feature works, the pics are placed on the map in the Places window.  Upload to Picasa Albums online and there they are nicely mapped for you.  Choose option to view in Google Earth from Picasa Albums online and something odd happens on a Mac.  A file is downloaded that has a file name something like 3245487664322, all numbers, no extension.  It will not load in Google Earth.  Rename it Julypics.kml and voila, it will now load into GE.I have found the macro (two types) to work well in both manual and auto modes (two types, still deciding which is best, probably the less powerful one for flower close ups when there are more than one in the view finder).  Using a bit of zoom while taking a smallish flower works quite well, background goes nicely out of focus and flower looks sharp.  The green or red boxes on the screen let you know if your target is or is not in focus.  Now have plenty of really sharp close ups of wild flowers.I downloaded the manual from their web site, it is a huge pdf, so stuck it in my wife's iPad and am reading it bit by bit.  Yes it is long as others have complained about, but better to have the detail if you need it.  My attention span can handle it, even though it is a big read.I agree with the comment about the flimsy trap door to access the battery/SD card.  I doubt it's ephemeral plastic 'lock' will last the life of the camera.  Duct tape may be needed at some point.  The alternate trap door to gain access to the mini USB and HDMI slots is equally dodgy, using a tiny rubbery plastic bit of 'string' to stop it from falling on the ground when you open it up.  Hard to decide whether to pop out the SD card and stick in a reader, or use the USB cable to transfer pics.  One of the other trap doors is going to suffer from over use.I also agree with issues over the on/off button.  It works fine, but it is small, it is next to others (in-camera map features) that 'act' instantly if you touch them with camera on or off, and you WILL do that from time time.  Minor annoyance.The zoom lever is around the \"take the pic' button, and I find it a bit too responsive, zooming too fast beyond where you would like to settle, resulting in a back and forth game to get it right.  I am getting better with practice, all about touch.These critical comments should not detract you too much.  They are all relatively minor.  I am a strong advocate of this geotagging camera with excellent zoom, good macro, top notch viewing screen, great battery life, strong auto features all in a point and shoot camera for less than $300.  I am three weeks in but already know it is going to get a lot of use.", "Date": "June 30, 2011"}, {"Title": "Great camera and GPS function works fantastically!", "Author": "M. Hunt", "ReviewID": "R2LCI5X0LFXB3F", "Overall": "5.0", "Content": "I just got this camera a couple of days ago and have been spent a couple of days reading the manual (yeah, I'm like that) and playing with it.  So far, it's GREAT!  I have had good experiences with Casio cameras before and this one is also very good.  Picture quality is great and it has a lot of built-in 'Best Scene' automatic settings that really make taking good pictures easy.  But the main reason I got this camera is because of the GPS function -- I use iPhoto and I love the feature where the location info for the picture is stored in the picture metadata.  This camera's GPS antenna picks up the GPS satellite signals VERY quickly -- much more quickly than my Garmin GPS watch and my Magellan in-car GPS.  Plus it holds the signal even when you turn it off or go inside a building -- which I thought was AMAZING!I was worried about battery life because of the GPS function, but I've taken about 50 photos so far in various locations and have seen no diminishment in the battery's charge, so maybe that won't be as big an issue as I thought (just in case, I did purchase another battery).  My husband and I are going on vacation next week, so I'll be able to test that theory out more thoroughly then and I'll report back.The picture quality is very good and I love the 10X optical zoom.  I imported the pictures into iPhoto and the location data on each of the pictures was very accurate, down to feet.  The quality is very good -- if I can figure out how to upload some example snapshots to this review, I will.Another feature that it has that I like -- though I know a lot of people might find it not that important -- is that you can put date and timestamps on the pictures themselves.  My much more expensive Sony camera didn't do this.  I have a bad memory and also I share prints of pictures with people who don't like the digital images, so it's really nice to be able to have the date stamped on it.The camera is not super-thin, but it's not that big either, considering it has the zoom lens and the GPS antenna.  I'd say it's a medium-sized pocket camera.  I'd say this camera is well worth the money.  If you need GPS info for your pictures, or just like geotagging them, get this camera.UPDATE:  I took the camera on vacation to DC and the camera performed wonderfully.  It got the location right on every single picture, even the ones I took inside!  And the GPS did NOT screw up the battery life.  The battery lasted way past a day -- over 200 pictures in one day, and it was still going strong, only about 2/3 of the way used.", "Date": "October 5, 2011"}, {"Title": "Indispensible travel companion!", "Author": "Thomas", "ReviewID": "R1E1SQXT4I0LE9", "Overall": "5.0", "Content": "I have taken the camera on my trips to Manchester and Edinburgh. I like wondering away from the hotel. The problem is then to find the hotel after wondering for a few hours. I usually brought a GPS device with me. But this makes me carrying an extra device. This time I camera solves the problem! The GPS is even better then normal GPS devices. It not only shows your location, but also shows your path, so that you know what parts of city you have already visited. In addition, the camera shows locations of all photos that you have made overlaid on the city map. And finally the camera quality is excellent!", "Date": "September 27, 2011"}, {"Title": "Pretty good compact", "Author": "Sarge", "ReviewID": "R1796E1071W1TW", "Overall": "4.0", "Content": "I got this for some location scouting so the GPS was important. I have used it all over Utah and SoCal and the GPS locks in fast on first start-up and is ussually just a few seconds to get a position when you turn it on for photos. The GPS works seemlessly and is the best feature. All locations are stored in the meta tags and it makes it easy to upload and map online using something like smugmug.com (which is awesome!). I never did figure out how to locate the direction the camera is pointing in metatags. The still shots are good quality for a point and shoot with lots of pixels to work with. The flash is pretty powerful as well. The panaorama feature worked really well! The video is good for non-zoomed, simple shots in good light. So overall, some solid performance in the plus department. The menu system was also very useable and easy to understand.Now for the bad. The buttons are hard to press, and to find in the dark. As you would expect, the video function is pretty limited, especially when zooming or there is a lot of action in the frame, or it is dark. The video will just drop frames wehn it gets overwhelmed....a high end San Disc may help, mine is only a 4 (15 Mb/s). But for a point and shoot it's not too bad. Now for the worst of it, the tab that holds the battery in, and the battery door are pretty weak. I dropped mine in a Lowe Pro case from about two feet and the battery popped both from the inside (there was no other damage to the camera). This was a pretty small drop in a well padded case, it was the weight of the battery alone that popped the retainer tab and the door. Unfortunately I had to send it back. The other downside was the built in map. Unless you live in the heart of a major city like New York or Tokyo, it has poor resolution. This means that the blue dots for your photos will just be stacked on top of each other on your map. Unless you are traveling long distances between shots, this makes the map feature very ineffective.So overall it is a good camera that takes quality stills and has a very fast and acurate GPS system. For the price it's worth it if GPS is important to you; except I recommend getting an extended warranty as I don't see how that battery tab won't keep breaking off with even the slightest stress. Maybe one day the camera manufactures will get serious about GPS in cameras, it is a great way to keep track of your photos.", "Date": "December 14, 2010"}, {"Title": "Great camera with all the capabilities of other models", "Author": "holamobile", "ReviewID": "R1BCZK07KFH3M9", "Overall": "5.0", "Content": "This camera functions great. Wonderful photos and the GPC Hybrid is an awesome capability which works faster than most GPS units I know. The panoramic and zoom are amazing. This one camera consolidated many functions I could not find in a single camera into one, easy to use, high resolution, camera.", "Date": "February 25, 2011"}, {"Title": "Impressive, but with a few issues", "Author": "Rene Bonvanie", "ReviewID": "R2ZCX7YOLLGURE", "Overall": "4.0", "Content": "I bought this camera as a Christmas gift for my wife for 2 reasons: compactness and GPS.  Compactness is important since she likes to take lots of pictures or shoot movies all the time and lugging around a DSLR and a video camera isn't fun.  GPS is cool because she makes lots of pictures and can't always remember where and when.  The good news is that it is compact and the GPS works pretty well.  But there are some oddities with this camera that you should know about.  First, it's near impossible to take pictures or shoot video while driving, unless you disable the GPS function. Maybe not a biggie for many, but still one for us because as I said, we like to take pictures everywhere...  Second, the video function requires a super steady hand.  Sure, in post you can stabilize some more, but if you shoot you should really make sure you're on a stable surface or mono/tripod.  All shots 'from the hip' make you sea sick when you watch them.  Finally, the price is pretty high and the fact it only comes in black was a bit of a negative.", "Date": "January 12, 2011"}, {"Title": "GPS Works Great With Google Earth!", "Author": "S. Jennings \"sbjenni\"", "ReviewID": "R3KCJNM4NJZ7U7", "Overall": "4.0", "Content": "Other reviewers have commented on many of the high points of the Casio EX-H20G.  I'll simply add some additional observations about the unit's GPS functionality:The KLM files that the EX-H20G generates when GPS Tracking is \"ON\" provide accurate tracking data that can be easily viewed on a computer using Google Earth. Once enabled, GPS continues to gather accurate tracking data, even with the camera powered down and tucked in a shirt pocket.Here's how to view tracks in Google Earth:If Google Earth is installed on your computer, you can simply copy the KLM files from the camera to your hard drive after a day or more of wandering about with GPS Tracking enabled. Then double-click on any KLM file to open Google Earth and see the track.  Once in Google Earth, the track can be easily and precisely measured using Google Earth's spot-click measurement tool to determine distance covered.The Casio EX-H20G is now available for under $200 which I find to be an exceptional value! I have compared it to the recently released, GPS-equipped Canon Powershot S100 and, while the Canon offers superior video and is far more feature-rich, the GPS functionality of the Casio, which includes on-board mapping, is clearly superior.  Image quality, including resolution and white balance, actually seems quite comparable between these two, very differently priced, cameras.", "Date": "December 4, 2011"}, {"Title": "Excellent Camera", "Author": "Bob", "ReviewID": "RBSNY31754SPP", "Overall": "5.0", "Content": "Photos come out sharp and the gps mode is a cert.I use an eye-fi card which it is fully compatible with and will let you know when at a \"Wi-Fi Hot Spot\" when uploading is complete instead of \"guessing\" with other compatible cameras that dont. Another thing, forget the purchase of or use of the eye-fi \"geo-tagging\" mode  i recently got refunded because of its poor performance) This camera never fails every time giving a precise location of the photo.", "Date": "November 1, 2011"}, {"Title": "highly recommend the casio EX-H20GBK hybrid GPS", "Author": "Lisa Schott", "ReviewID": "RY5ESA9MN0DI2", "Overall": "5.0", "Content": "I needed a gps enabled point and click for my land trust work and couldn't be more pleased with this camera.  High quality photos and easy to learn and use.  No complaints.", "Date": "September 11, 2011"}, {"Title": "Great camera", "Author": "Harold J. Mclaughlin", "ReviewID": "R2XZ3Y3ZIAZZYI", "Overall": "5.0", "Content": "Only disappointment - GPS Coordinates can not be printed on the pictue.  Must be sure to press the capture (shoot) button half way down for a few moments to ensure that the picture's focus has been capturee.  Supplier performed as advertised.", "Date": "August 12, 2011"}, {"Title": "Works well.", "Author": "Pres", "ReviewID": "R1WKT8P0H9VVWY", "Overall": "5.0", "Content": "Got this used.  Work's like new.  It's a little larger than my compact SONY camera.  I use this for work and the GPS feature is the real selling feature.  Not a feature most need so other cameras would be better.", "Date": "December 31, 2011"}, {"Title": "Would not shoot through or open window of bus when moving while on vacation in Ecuador.", "Author": "Sig", "ReviewID": "R3BHMUSM7XFHUL", "Overall": "2.0", "Content": "All Pics blurry !  Always took a VERY long time to recover for next shot.  \"Best Shoot\" never seeded to function.  Now, virtual never actually 'takes' a picture, even though it indicates it is sloooowly processing what you think you shot.  Second one I have owned.  First one crapped out in less than a year.  This one in under two months.  No, never wet, dropped, etc.  Anti-shake is minimal.", "Date": "July 21, 2013"}, {"Title": "My photos with Casio EX-H20G", "Author": "Luis O. Boettner", "ReviewID": "R3RBDMLS5UJYB7", "Overall": "5.0", "Content": "Very nice camera, handly. I like it. It takes very nice pictures. I have it for around a 1.5 years.Things to improve:* Flash almost under my right finger when shooting. Quite easy to cover the flash with the finger.* Zooming the map: some places you can't go \"closer\" to the ground level.* When my 16Gb is quite loaded, time between successive pictures takes quite long.* Some time it takes quite a long time to resolve the GPS location when in areas with a lot of buildings around.Photos taken with Casio EX-H20G:  [...]%20EX-H20G", "Date": "May 2, 2013"}, {"Title": "NIce. One of the best Pocket cameras I have.", "Author": "Bernardo Anderson", "ReviewID": "RZFJUCEJA7WN1", "Overall": "5.0", "Content": "Excellent pictures, contrast, colours, fast start up, fast  autofocus. Pocket size. It is perfect for Geolocating pictures in Google Eartth and Panoramio. Ilove it", "Date": "April 27, 2013"}, {"Title": "Great product for good pictures & easy use.", "Author": "Wendy Finger", "ReviewID": "R14LVBIQ4NVN1B", "Overall": "3.0", "Content": "I absolutely love this camera which I bought as a replacement for its predecessor EX-H10, which broke on my last trip after 3 years of wonderful pictures.  The company has stopped making and supporting their cameras  but I decided to buy a new one online even if it doesn't have any support as the pictures were so much better than the three I tried as a replacement (equal types of Nikon Cool Piks, Fuji, Sony) and the price was so much lower than the original price.  I love the zoom and higher resolution which lets me take distant photos and then crop to bring in good detail (ie. a large alligator's head across the lake from us a nest full of baby Osprey).  Close ups make me appreciate the detail of the bubbles within glass platters and the cast shadows on photos for my website of the glass I make.My first camera broke because of my negligence (it was in my pocket and I must have leaned against something to make it turn on and have the lense pop out and get hit against a railing).  Inspite of this I was very impressed with the supplier as well as with this camera which takes the photos I see, in the colors I see and requires little photo-correction (except maybe cropping of my choice, and some minor color correction).When the button for taking the pictures became \"spongy\" after only three weeks I followed Amazon's procedures for return or replacement and the supplier \"Bargain Shack\" contacted me directly.  Since they had several of these they offered to replace it with no problems and were very kind and helpful in the process.", "Date": "February 27, 2013"}, {"Title": "Good photos but....", "Author": "Dean", "ReviewID": "R2WVNV5LDHGSO3", "Overall": "4.0", "Content": "The camera takes good photos for sure.  I have had a couple of other Casio compact cameras and always found them to be great value with excellent photo quality (lets face it thats why you buy one of these).  The feature that I was most excited about was the GPS tagging.  I have tried in the past to tag photos afterwards, but lets face it that does not work.  In use I did start getting a bit annoyed that every time you turn it on it can take those few extra seconds to start because of the GPS.  Thats ok for the majority of your photos, but if its something you have to take fast you will miss it.", "Date": "November 19, 2012"}, {"Title": "Discontinued Item", "Author": "Darl C. Clites", "ReviewID": "R21P3TYHVP0ADY", "Overall": "1.0", "Content": "I spoke with Casio Customer Service and was told that the H20G Hybrid-GPS enabled camera has been discontinued and no replacement model is available.I do not understand why Casio is still featuring this item on their web site.  If it is so outstanding, why would it be discontinued.  They would not give a reason.", "Date": "April 4, 2012"}, {"Title": "Excellent product, excellent price, excellent delivery", "Author": "Maria M. Romero Nuñez \"Ernesto Araque\"", "ReviewID": "R144ZAL2JIBX2U", "Overall": "5.0", "Content": "Very good deal!! This camera has excellent function, an small size perfectly for mobility. The amazon price is the best in the market. I'm really happy with this purchase.", "Date": "June 15, 2011"}, {"Title": "Poor optics and bad GPS accuracy in logs", "Author": "Peter Bree", "ReviewID": "R18NEGB35ASIWA", "Overall": "2.0", "Content": "I was very excited to get this camera to have both pictures with a GPS position and GPS logs viewable in Google Earth of where I'd been so I don't have to carry my old GPS data logger.Unfortunately the optical quality is poor and the GPS tracks can be very inaccurate. I came across a review on the GPSPassion website (http :[..]) that I have to agree with for the most part, they have examples showing the poor optics and \"crazy\" GPS tracks [...]", "Date": "January 10, 2011"}, {"Title": "POS CAMERA", "Author": "Marc E.", "ReviewID": "RMNJRUNBQ0EH9", "Overall": "1.0", "Content": "This is a POS camera.. falls apart in less than 6 months.. $300 down the drain.. DO NOT BUY A CASIO H20GBK OR ANY CASIO CAMERA...", "Date": "December 1, 2013"}, {"Title": "Good GPS", "Author": "biologist", "ReviewID": "R27AK0O375CFNF", "Overall": "4.0", "Content": "I work in the field taking photos for reports this camera is very helpful for me to drop teh exact location where i took the phot.  GPS seems very acurate and the camera came fast.", "Date": "May 21, 2012"}, {"Title": "No GPS navigation :(", "Author": "L. Acosta", "ReviewID": "RYJ4G9BMSUBY1", "Overall": "3.0", "Content": "I've had a Casio Exilim camera already, I liked this thinking it had a real GPS navigator but I was disappointed. I also think the face recognition feature is not very good on this camera. Anyway it is a really good camera and definitelly above average.", "Date": "February 23, 2012"}, {"Title": "I hate this camera.", "Author": "wild animals", "ReviewID": "R1PUBFC4TV7RCF", "Overall": "2.0", "Content": "UPDATE:There are apps for Android that allow you to use your phone as a GPS unit for tagging photos on any digital camera, even without data service (so the GPS still works even on a mountaintop or whatever), so you can use a gorgeous-wonderful camera like the Panasonic DMC-FZ150K 12.1 MP Digital Camera with CMOS Sensor and 24x Optical Zoom (Black) without giving up geotags or buying expensive equipment! There are a few different methods, but basically you synchronize the time on your camera with the time on your phone, leave GPS on, and hit the road. Once you get home, attach the tags to the photos. I'm so glad I don't have to use a cruddy camera just to access that one feature. I haven't picked an app yet, but I'll update when I have.Everything about this camera sounds so good.  I was so excited. I ordered two extra batteries for it at an extremely low price, so I wasn't even worried that the camera doesn't take AA batteries. The camera uses SD and SDHC cards, which are everywhere, and you can even use cellphone cards if you have an adapter. I mean, it sounds brilliant, right? The GPS is hybrid, so it doesn't run the battery down and tagging works even when there isn't a reliable GPS signal. SO GOOD! Right?NO!Every SINGLE photo I have taken with it looks like absolute crap.  It's 14 megapixels of ABSOLUTE CRAP. My damaged five-plus-year-old Canon takes photos 800 times better than this. If you display these photos at 100%, they look like cellphone photos. I got this camera to take photos of wildlife and nature, and have tags to remind me where I was at the time. I thought I could compromise if the image quality weren't quite as good as that of a Canon, but this is unacceptable. Birds look like pixelly smears, even when they're only 15 feet away.Also, the camera is constantly adjusting, loudly, and it sounds like it's about to explode. Furthermore also, the camera stores all of the files in one folder, with its own naming conventions, so you have to download thumbnails for every single photo, even if you just want to look at the last few. Maybe you can change this in settings, but I haven't seen an option for it on the camera or software, or in the manual.I am giving it two stars instead of one because the battery life and low cost allow you to spend hours taking low-quality photos without having to recharge.  Also the GPS is really cool even though it is not useful if the photos are so awful that you don't use the camera. It is more like hypothetically cool. Because I hate it.If you do get a GPS camera, don't forget that it will track your location at home as well, if you forget to turn it off. The GPS data is stored in \"Exif data\" attached to the image file. Many websites (like Amazon) do not strip the Exif data from the image files.  So if you take a photo in your living room and upload it someplace, people will have the exact global position of your couch.  You can download Exif stripper software, or search for \"online Exif stripper\" to find a website that will delete that info for you, and let you save a new copy of the image. Firefox also has a browser extension that will display Exif data, so you can check if your images are giving away private information.Oh, PS: I forgot to say that the flash is right in front of where your hand will be when you hold the camera and press the shutter button. It is difficult to hold the camera without covering the right-hand side of the flash. All I can say is that I am sad. I'm so sad about the camera.UPDATE: Because I can't afford to buy a different new one, I took this camera on a trip to visit bears and other giant animals, and the camera was so frustrating! For some reason, I'd start recording a video but it would turn off again without me noticing. Later I watched the videos and discovered that some of them only had one second of something really cool, and then the video stopped. I think maybe the \"record\" button is too sensitive. Make sure the video is recording before you look away from the camera!The biggest issue on the trip was that the animals moved quickly, and every #$*(&@$ time I took a picture (without flash), it would stop and think about life for maybe 15 seconds afterward. An animal would be doing something awesome, and I'd be frantically pushing the shutter button, but the camera wouldn't take a photo until it was too late. By then I'd have the camera pointed someplace else, the camera would take a picture of my leg or whatever, and I wouldn't be able to take another photo for 15 seconds. This happens when the camera turns on, as well. I think it is dealing with GPS data. But I don't care--it is a huge problem.It also is difficult to get the camera to focus on what you actually want to see. I have a lot of photos of a lot of blurry stuff, but you wouldn't know it from the preview screen, because it usually looks fine there. They don't look blurry until you get home and upload them to your computer.  I took a video of a bear playing in a pond, but...it's just a bunch of blurry stuff moving around the screen.  I couldn't get the camera to refocus. (Although, to be fair, that video was so blurry that I could see the blurriness on the LCD screen, so I had a chance to try to fix it. Although I failed.)We did see a dead cow with a bald eagle on it, and while we didn't get a meaningful photo (guess why), we did go back that way again and we used the GPS to tell us where we'd taken the photo.  It shows the photos on a map with a route highlighted, so you can see where you've been. Really cool. \"Hey, that blurry thing was the varied thrush at the northwesternmost point of the contiguous United States! I remember that! In my head! Who needs photographs?!\"  Er... so yeah also the camera has an auto-date and -time function, because of the GPS, so the photos all have the correct date in their data. That is good, too. Really wish they hadn't missed the boat on this. It could have been so cool.", "Date": "February 4, 2012"}, {"Title": "Nice little pocket camera but not impressed with the GPS", "Author": "Donald R. Poteet \"Rockdweller\"", "ReviewID": "R36B08V6OGNKDT", "Overall": "3.0", "Content": "All it does is tell you where you are at and where you have been.  Why not call it geo tagging like the rest of them do.  I'm just not impressed at all with this camera.", "Date": "January 30, 2012"}, {"Title": "PRINTED INFORMATION", "Author": "BILL", "ReviewID": "RCVXGWHGHHUI2", "Overall": "5.0", "Content": "A SMALL PRINTED MANUAL HOW TO USE THE DIFFERENT CAMERA FUNCTIONS.THE PROVIDED CD WAS NOTMUSEABLE..  REQUIRED CAMERAQ SERIAL #.  I ENTERED THE CAMERA SERIAL #.....DID NOT WORK.ALSO, HOW CAN YOU ALWAYS TRAVEL WITH A COMPUTER TO USE THE CAMERA AWAY FROM HOME?RECCOMEMEND SMALL PRINTED MAMUAL.....CASIO PROVIDES NICELY WIRH THEIR CASIO WATCHES.", "Date": "February 16, 2011"}, {"Title": "Anthony Bottini", "Author": "chs1955", "ReviewID": "R30B4JNTTQ5MFN", "Overall": "5.0", "Content": "As promised the camera arrived on time.  I am very pleased.  Beautiful Photo's and the geotaging is awesome.  I recommend this camera to anyone interested in good design and function at a great price.", "Date": "June 30, 2011"}, {"Title": "Good Item", "Author": "Shane D. Newsom", "ReviewID": "RGPODNE3TACEO", "Overall": "4.0", "Content": "I love this camera.  Now would I buy it again... umm there is a good chance I would.  I love the easy of switching between video and photo's.  Easy to switch to diff. styles sports, night, action etc...  I believe the image is good, but will put to the test when i make prints.  I can already tell when i do a super zoom the image is not as good as a normal zoom.  :-(My issue's with it was it took forever to get the GPS set up, and turning the camera off is slow.  Other things that really bothered me was not SD card was included.  Not even a POS small one. I just drop a lot of money (for me a lot of money) and no SD card.  So, i had to wait until compusa open to get a new sd card.", "Date": "September 7, 2011"}, {"Title": "Awkward to hold and over-hyped GPS", "Author": "K. K. Fung", "ReviewID": "R2C7ZC2JRLTI7V", "Overall": "2.0", "Content": "I have not tested this camera in the field except the slide panorama feature and the GPS feature. The slide panorama function does not produce a seamless panorama if the camera is panned while hand-held. I thought the GPS function would help me remember where I took certain pictures. It does register the longitude and latitude of the location. But unless you are taking pictures of famous sites, there is no way to enter the location name. And if one leaves the GPS tracking function on, I think the battery life would be greatly shortened making it impractical to generate a trip map.The camera is also awkward to hold for people with average-sized hands making it difficult to take a quick shot.", "Date": "February 12, 2012"}, {"Title": "Disappointing", "Author": "Darth Gio", "ReviewID": "R35BNOZ7UY6KZ", "Overall": "1.0", "Content": "The description says the positioning functionality of the camera gives you the Latitude, Longitude and the Direction to where the camera is pointing when a picture was taken.I can see the Latitude and Longitude but not the Direction.  Called Casio Customer service and after troubleshooting told me to return the camera.The Place stamping is not helpful to me because you cannot put in your own name for the place.  You can choose only to what is stored in the camera.I love the built because the body does not look cheap plastic like most canon camera within the same price range.Any owner who have seen the Direction info please comment.", "Date": "July 30, 2011"}], "ProductInfo": {"Price": "$299.99", "Features": "World's First Camera with Hybrid-GPS lets you geotag your images where you go\n14.1 Megapixels with 720p HD Video\n10x Wide-Angle Zoom Lens (24-240mm) with CCD-Shift Image Stabilizer\n3\" High-Resolution 460k Super Clear LCD\nLong-Life Rechargeable Battery takes up to 600 shots", "Name": "Casio EX-H20GBK Hybrid-GPS Enabled 14 MP Digital Camera with 10x Zoom and 3-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41tokJ-bXJL._SX300_.jpg", "ProductID": "B004BR3Q6S"}}