{"Reviews": [{"Title": "Very good for the money", "Author": "Pedro A M Vazquez", "ReviewID": "R39T4A53N9ODFL", "Overall": "5.0", "Content": "I have been using film SLR Nikons for the last 40 years and DSLRs for the last five years. However, in 2009 I needed a small camera that was able to share resources with my other devices, I mean: memory chips and bateries and took reasonable pictures. The answer at that time was the Coolpix L18, an 8 Mp P&S; using SD memory and AA bateries as my Garmin GPS and with a reasonable 35-105 mm equiv. zoom. The L18 also did video very well. Its low features brother was the L19, a Nikon convenction for this low end cameras: the odd numbered are cheap, have low res than the even numbered.Now, my L18 is aged and I moved to a L23 and I am very satisfied with its 28-140 equiv. zoom (something I missed) and the same AA and SD compatibility with my mobile devices. It has \"only\" 10Mp, that I reduced to 8Mp, and shows a noisy behaviour under low light conditions than the L18, but I am very satisfied with it, anyway.", "Date": "January 15, 2012"}, {"Title": "Just what I expected...", "Author": "JAS32 \"jas32\"", "ReviewID": "R3RSCP3TE9TM6G", "Overall": "3.0", "Content": "I bought the Nikon Cool Pix L23 in Manila, Philippines as I needed a P&S; camera after my Nikon P300 was stolen at a local shopping mall.  I wanted a camera that was the least expensive name brand model to tide me over for a few more days of my holiday.  I chose this over the Canon A800 (about the same price point) mainly because of the 5X optical zoom and 28mm wide angle lens.  I knew that it will never match the low light capability of the P300 considering that the P300 is over 3.5X more expensive than the L23.With lots of light and a steady hand, this camera does it job.  However, when moving about or in low light conditions, I would make sure I take about 5-6 shots of the same pose to make sure I get at least one good one.  As expected there is no manual control to speak of, but there are scene choices for most conditions which worked fairly well.  Picture quality was just OK, good enough for normal snap shots. When faced with difficult conditions the results will be iffy.Considering that this is the bottom of the Nikon digital camera line, I was not surprised at what I got. Spending a few more dollars for a camera with better features will undoubtedly improve the picture taking experience and reduce frustration levels.  Sure missed my P300, already ordered a replacement and got it even before I returned to the US.", "Date": "January 2, 2012"}, {"Title": "Choose an other camera", "Author": "jbtibor", "ReviewID": "R1BGE2PYPC89DE", "Overall": "1.0", "Content": "When light conditions are not perfect the image may get blurred and even with vibration reduction the image gets blurred often. Sometimes it happens in bright sunlight too, autofocus is also slow.I couldn't find how to set to autorotate images (framework 1.1, the latest at time of writing). It's 2011 Nikon, other cameras have this feature for ages (even the cheaper ones).The usability of settings is below zero, very bad. When settings button is pressed it always displays image size selection. It takes lots of clicks to modify settings, and navigation is unintuitive.Same applies for changing between picture and video mode. Why isn't there one button what toggles between picture and video mode? I bet 99% of mode changing is between these two.Most of the people who buy this camera are buying it because they need an easy to use automatic camera (or they will be very disappointed).To Nikon: maybe more expensive cameras are better, but if I find that other cameras are this bad I'd never risk my money buying an expensive Nikon camera. I guess others do the same so by trying to save on cheaper models you are actually loosing customers who will upgrade to something else than Nikon.", "Date": "December 8, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004MPR3W2"}}