{"Reviews": [{"Title": "Watch out for non-supported cameras", "Author": "o27cowboy", "ReviewID": "R2ILVEO23O7YZ0", "Overall": "3.0", "Content": "Very easy to setup: installed two 500GB drives (purchased separately), took less than 10 minutes to setup and config.  Be sure that your camera manufacturer AND model are QNAP supportted.  I have three IP cameras made by supported manufacturers. However, none of the models were able to install/config.  Downloaded and updated the latest QNAP firmware, but two of the three were still unsupported for recording.  Using the \"generic model\" for these two cameras enabled viewing, but not recording.  I was advised by QNAP that if it wasn't on their list of supported cameras, it probably will not work. In trying to work through the camera issues,  I found and tried different ways to interface with the unit: you can directly attach monitor, keyboard and mouse to the QNAP; also can use IE/web interface.", "Date": "December 30, 2011"}, {"Title": "Make sure you check for compatible hard drive too", "Author": "ChapinCinci", "ReviewID": "RZLS5AS4Y7QC7", "Overall": "4.0", "Content": "Not a customer yet, but I thought I'd suggest that anyone looking at this go to the QNAP site and look at the compatability list for hard drives. I view this as a benefit as QNAP actually will help you choose which components will work together.In fact, the reason I posted this as the \"Often purchased together\" suggestion was a drive specifically listed as \"Not Recommended Hard Drives\" on QNAP's site. Seagate ST2000DL003.", "Date": "August 11, 2012"}, {"Title": "I wish this newer IP hardware was as friendly as the old analog stuff", "Author": "Ruben Miranda", "ReviewID": "R3RH2OOI9MV9ZY", "Overall": "3.0", "Content": "As other reviewers stated, check all hardware for compatibility before purchasing it. This product works but if you've ever used the older analog video surveillance stuff you'll see how much it lacks in intuitiveness and ease of use.  When you hand this stuff off to a client to use it has to be easy for them to operate. This really isn't.  I also had a lot of trouble getting this to work over the Internet. It worked a few times and just stopped even though all the right ports were open. The analog equipment just works, no fuss.  Still, we must move forward but unless you realyl need an IP system with hi-res cameras, just get an everfocus or some other analog system. It's cheaper and it works well.", "Date": "August 19, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Exclusive Linux-embedded system, Intel Atom Dual-Core 1.8GHz CPU & 1GB DDRII memory. HD Local Display via VGA Connector\nReal-time monitoring and recording (video/ audio) from versatile network cameras (up to 4 channels)\nHigh quality recordings in H.264, MPEG-4 and M-JPEG (depends on camera)\nMulti-server monitoring: Highly expandable for monitoring up to 120 channels from multiple QNAP NVR servers over LAN or WAN\nComplete recording features: schedule recording, alarm recording, alarm recording schedule, pre-alarm, and post-alarm recordings, etc.", "Name": "QNAP VS-2004-PRO-US 2-Bay NVR 4-Channel Surveillance System", "ImgURL": "http://ecx.images-amazon.com/images/I/41tmwnnt3EL._SY300_.jpg", "ProductID": "B0046TXBZW"}}