{"Reviews": [{"Title": "COMPACT/PORTABLE", "Author": "Todd Begin", "ReviewID": "R1J5K7HTVYLN6L", "Overall": "5.0", "Content": "I had a 7 year old Olympus and loved it...then I got a Fujifilm 18x zoom..I liked that/but it was too bulky to carry EVERYWHERE......came across this at Wal-you know....and loved the size and feel.So I ordered on Amazon/because price was better....received the camera/loved the \"effects\" loved the feel/and the zoom is awesome! if you see my posted picture....I zoomed in on a sailboat 3 miles across the lake and it looks pretty good for what is does! I was amazed at how the camera didn't need 4,5,6 or 7 tries to get a focused zoom! I also like the fact you can take several pictures in a row with no special set up/even though the \"preview screen\" still shows previous shot/you can continue with 6,7 more shoots in a row!easy to use \"navigation\" button....just wished it took AA batteries..I ended up buying another battery with a wall charger...the \"down side\"? only charges via usb when connected to computer/unless you get another type of charger as I did...ALSO the \"usb\" is special type.....not any common usb will connect to camera/the manufacturer supplies the \"special\" usb cable.....also...the usb doesn't fit \"snuggly\" when connected and the slightest bump knocks it out of the camera :( but for the price/the zoom/the effects/the portability/it fits into my cargo pant pocket easily as small as a point and shoot/this camera is great!!takes great pictures/but I mostly bought it for the zoom!", "Date": "October 9, 2011"}, {"Title": "Great camera, lousy software", "Author": "retiredinmaine", "ReviewID": "R2LGUBVYSG0Y23", "Overall": "5.0", "Content": "I got the SZ-10 because I wanted a pocket-size camera with a lot of zoom and one where I wouldn't have to wait forever between flash shots. After spending way too much time researching cameras on the Internet, I decided on the SZ-10. I've been almost 100% satisfied with the camera and completely dissatisfied with the accompanying software. The camera gets 5 stars. The software would drag my overall rating down if it was needed.Here are some features that I am especially happy with:* The 18x optical zoom. This will be great for outdoor shots of wildlife. At 18x, I can get by without a tripod, but if I turn on digital zoom on top of that I will definitely need a stable platform.* Panorama mode. This is nicely done. In the past, I have used computer software to stitch images together. The SZ-10 does that for you for 2 or 3 shots and it works great. It will take more shots, but stitching then has to be done on a computer.* I love the flash. It's out of sight unless you want it. Flip the flash up, set the flash mode that you normally use then snap it closed again. When you want to use the flash, pop it up and the mode you set will be remembered. While closed, the flash is automatically set to OFF. When open, the mode is easily changed if you have to.* Super Macro mode is great for close-ups* I'm having fun with Burst Mode, especially after I set the sound effects to chirp after each shot.* The on-screen Help is a nice reminder of what major functions do. It is not a complete user guide, however. For the obscure functions that I will use only seldom, I copied/pasted portions of the PDF user guide onto a single page that I keep with the camera.* You can turn the camera on with buttons other than the Power button, But when I pull the camera out of its case I tend to hit one of them. That can make the lens pop out as the camera is being extracted and could be a problem. Fortunately, the menu system lets you turn this feature off. I don't know why anyone would need more than one way to turn it on anyway.Here are some things I'm not so thrilled with:* The camera zooms very quickly. You do not have fine control. To get the zoom you want, you have to poke the zoom lever, making the camera zoom in short bursts. If you hold the zoom lever over, you probably won't be able to stop it exactly where you want it.* Some features, like Digital Zoom, automatically get disabled under certain shooting modes. The menu system gives you no clue as to why they are disabled and sometimes it's hard to determine what settings you have to change so you can regain access to the disabled functions so you can change them.* But the real issue with this camera (and probably all similar Olympus cameras) it the software that comes with it. The user interface is so badly designed that I can't figure out what its purpose is. And it is so badly  implemented that I took it off my computer. Their \"ib\" program (what the heck does 'ib' mean, anyway?) opens automatically when you insert an SD card (I haven't found a way to disable this) and fills your monitor with a black-background screen (ever see that on a company's web site? it's awful to read). If you drag an edge of the window to make it smaller, you will permanently loose the window's Close box. Since there is no other way to close this window (it doesn't respond to the Task bar), you have to use CTRL+Alt+Del to kill it. Yikes! How crappy is that? Fortunately, your computer probably already has better ways to do what the Olympus ib and Viewing software does.Here are some things that bother other reviewers but don't bother me:* You can't have optical zoom with a movie if the microphone is turned on. I don't plan to shoot a lot of movies, so this is not a biggie to me, but I can see where it could be annoying. It's not so much that you need 18x zoom for movies as it is that you have to plan your movies in advance. Do I want zoom? How much? Do I want sound? And is my menu system set up for what I want? If you normally have sound ON and digital zoom OFF as I do, then before shooting an 18x zoom movie you have to go into the menu system and turn sound OFF and separately turn Digital Zoom ON (which may be difficult if it has been disabled because of some other setting). This problem isn't unique to this camera; others that I investigated have their own unique (and sometimes more annoying) ways of handling sound, movies and zoom. If you forget to check these settings, you might get home to find the movie you thought you shot with sound doesn't have it.* Zooming is noisy. Not enough to bother your ears or to make you think the camera is breaking, but enough to be picked up by the mike. Maybe this is why they turn optical zoom off for movies with sound.* The plastic tab that attaches the HDMI/USB cover is cheap and breaks. Yes, you do have to be careful with it, but I have a Sony with the same arrangement and it is still intact after 8 years.* The controls are difficult to understand. That's true initially and the PDF User Guide is not presented in the most logical fashion. But if you read the whole thing and play with the camera, you'll get the hang of it. I now actually find the controls rather easy to use.* It does not come with a printed User Manual. That's true, but it has a CD with the guide on it or you can download it. But the guide is 84 pages long and you're not going to want to carry that around with you. Read through it, learn what you can and then use the built-in help when you are in the field.* Sound isn't recorded in stereo. True, but the cameras that claim to record stereo sound have their mikes separated by less than an inch. Just because you have two channels of sound doesn't mean you get stereo.In the end, what's most important is that this camera takes great pictures, has lots of features and zooms more than almost every similarly sized and priced camera. I recommend it.", "Date": "January 11, 2012"}, {"Title": "Awesome Camera", "Author": "C. Lee", "ReviewID": "RTN4XGHAULAMD", "Overall": "5.0", "Content": "This Olympus is ultra compact with excellent zoom of 18x which you would normally find in bridge cameras but is compact like the point and shoot.  Loaded with features and video was crisp and sound was better than expected with no additional mic attached. I was well pleased to have purchased an everyday point and shoot yet performs like a bridge camera with tons of shooting options.  This is a great camera to go anywhere with. Will recommend highly.", "Date": "June 28, 2011"}, {"Title": "Pictures ok, but NO zoom in video mode", "Author": "Brian F", "ReviewID": "R1XUCIVUTOPEX0", "Overall": "2.0", "Content": "Will be returning/exchanging.Pictures looked good (especially with the nice LCD) but the image stabilization was hit or miss when using the zoom. The Magic Filters worked well but, in the end, I didn't see myself using them much in the future. The deal breaker for me was that video mode did not allow zoom (SZ-30 does). Don't get me wrong, the videos were clear and sound was great (720p is really good enough for me). I'm looking for a camera that takes good quality pictures AND takes decent videos with things that should come standard (i.e. zooming in video mode).Also, it seemed that the whole camera was heating up (more than normal I guess). User Interface was not very user friendly with the lack of a dedicated, physical mode dial. It took quite a bit of time when focusing on objects near or far (approx 3 - 5 seconds).Overall, good picture quality without zoom, and sometimes WITH zoom. The lacking areas as mentioned above were enough for me to decide that I did not want to keep this camera.Hope this helps!", "Date": "June 23, 2011"}, {"Title": "Awesome!", "Author": "Brandy", "ReviewID": "R1Q33KIUEDFS7Q", "Overall": "5.0", "Content": "I am so enjoying this camera. It takes quick clear pictures, has lots of cool functions, and I think it is pretty easy to use. The zoom is amazing, and when zoomed in on something, it still takes a great photo. I am very pleased that I purchased this item.", "Date": "November 9, 2011"}, {"Title": "Suprised just How good this is", "Author": "bmae1988", "ReviewID": "R1E9EHD2L3DBNJ", "Overall": "4.0", "Content": "First of all, because of the zoom, this camera looks much more bulky in the pictures then it actually is. When it is off, it resembles just a normal digital camera in it's width, which threw me off, cause I like bigger cameras. Anyways, it amazed me at the quality of every picture, I would zoom all the way in on certain things, and you could see all the individual dust that had settled on something,and it wasn't blurry in the slightest, that's how good this camera is. Love love love it. The only con I have is that I wish it had actual batteries instead of the rechargeable one it has. That's all :)", "Date": "November 27, 2011"}, {"Title": "Olympus SZ-10", "Author": "John N. Vassiliadis \"John V\"", "ReviewID": "R2HWBO4HDI3D9J", "Overall": "4.0", "Content": "Good camera with tons of features. Love the zoom lens. HD video is great with smooth playback. The software it comes with is easy and very useful for editing and organizing your pictures. That said, with all the features, one really has to go through the manual step by step. Also one problem is that the flash does not pop up automatically in low light, you have to activate it manually. All in all great value for the price!", "Date": "August 30, 2011"}, {"Title": "Hard to focus in zoom, and 18x zoom?", "Author": "SummerJoy", "ReviewID": "RBQJHMZ4XXTZ0", "Overall": "2.0", "Content": "This is a beautiful little camera that is capable of doing a lot, that is, if you can run it. It states 18x zoom, but it was in actuality much less than that except for when in digital zoom. This camera is small and because that is hard to hold still and get non-blurry pictures. I couldn't figure out if I should be focusing it before taking the picture, or if I should press the button and let it focus and take when it was ready. The instruction manual is on a CD that is nasty and hard to read on the computer.  It functions by menu and it is hard to find your way around, especially if you are in a hurry to get a shot. I had trouble finding things, but that could just be my problem. I had no end of trouble trying to use the macro; just couldn't get a clear picture.Pros: Pleasing design, small, lots of options.Cons: Nearly impossible to get clear shots in any mode but iAuto. No instruction manual. Needs to have a book printed.I played with this camera for 13 days. I wanted to like it. I loved the size and it was a pretty little camera. But in the end I had to take it back because a camera I cannot get clear pictures on is of no value to me. I was wishing for a small camera to tuck in my purse but this definitely isn't the one for me.", "Date": "January 21, 2012"}, {"Title": "AMAZING CAMERA!!!", "Author": "CJKen", "ReviewID": "R232EMGXFOMHOH", "Overall": "5.0", "Content": "So, I found this camera about three weeks ago, and asked for it for Christmas.  Sure enough, my awesome parents purchased it for me.  As of right now, I have only had it for one day, but I couldn't be happier!  This camera meets above and beyond my expectations.  It has many language options, (including Russian!) The zoom is awesome.  One of my favorite views is the panoramic view.  I didn't even realize this was on the camera! Amazing surprise! It also shoots in 3D, but I think you need a 3D reading device to actual see it.  But there are so many other views too, including but not limited to a view that automatically snaps a picture of your animal (select cat or dog in the menu) when it reads its face.  Also, you can manual snap the photo to.  (I'm a fan of this feature because I love taking pictures of my dog!) This camera is light weight and awesome looking.  What really caught me on the camera in the first place was the look.  I love how it looks from the top when it is all the way zoomed in.Now, I am no expert in cameras. In fact, this is my first camera that is not only a video camera (however, this one also shoots videos!) But, the features looked amazing, and I know that the must have been good because my dad would not have purchased this item if it did not look like a high quality device.I am SO looking forward to using this camera! I have had a hard time putting it down today!Also, if you decide to purchase the camera, I would recommend also purchasing this kit:(2) CTA LI-50B Rechargeable Li-ion Batteries + Mini Battery Charger + Tripod + Accessory Kit for Olympus SP-800, SZ-10, SZ-20, SZ-30MR, TG-610, TG-810, XZ-1, Stylus TOUGH 6020 & 8010 Digital CamerasIt is a great starter kit.  It also exceeds my expectations!!  It is currently only 34.95, and well worth the money.  Comes with two extra batteries, extra charger, table tripod, regular tripod, and MORE!! All name brand and good quality!", "Date": "December 25, 2011"}, {"Title": "NO OPTICAL ZOOM for movies", "Author": "Michael J. Weaver \"Melbourne, Mike\"", "ReviewID": "RCG0TRLKC2LHN", "Overall": "2.0", "Content": "I can't beleive this camera does not allow you to zoom in while in Movie mode.  This is definitely a minus for this camera.  The picture quality is good however the image stabilization is also very bad.  I tried to take a picture of a small sign accross the street from me about 40 ft away using full optical zoom.  I viewed the picture before taking it and it looked great prior to taking the shot.  After taking the shot, the final picture looked HORRIBLE as if someone was shaking the camera wildly.I am returning the camera due to these issues.", "Date": "November 19, 2011"}, {"Title": "Out of focus", "Author": "NWM", "ReviewID": "R6VYQA4X6XGZE", "Overall": "2.0", "Content": "I purchased this specifically for concerts where I can't bring my Canon DSLR into.  For the price and specs I thought it would perform much better.  Making adjustments to iso and exposure which are the only adjustments you can make since there is not a manual mode. These did not do anything to help the photos, even though it has low light modes and sports modes neither is able to focus and programming yourself is not that great.  I think the lack of focus comes from the size, I find this to happen alot because of the size of the camera.For concerts I'll switch back to my other camera which is bigger and has manual mode.  Even though its probably over 5 years old with just ok specs.For someone looking for a good camera in daylight or using flash with little to no zoom then this will work fine.  Shooting in any other conditions than perfect conditions this struggles to perform.  Still hoping to discover a magical trick to make this camera work better.", "Date": "April 16, 2012"}, {"Title": "Nice Camera, But.....", "Author": "tiger77 \"tiger77\"", "ReviewID": "R1Y29V11QIOX9K", "Overall": "4.0", "Content": "Bought this camera and took it on a two-week trip to China for its first big outing.  Like it very much and was quite pleased with the photos....with a couple exceptions.  One is that I would be much happier if it had a viewfinder as this (and other) LCD screens are impossible to see in bright sunlight.  Also the placement of the \"Info\" button is where it is very easy to hit by mistake - which takes the camera to the review mode and you have to change it back before you can take a picture.  A pain when you have a great shot to get quickly - and it turned on often enough just carting the camera around that I was quite annoyed most days.", "Date": "September 14, 2012"}, {"Title": "Great camera for non-professionals", "Author": "Paul Sarkisian \"Paul S\"", "ReviewID": "R2QR9N8RE6GUX3", "Overall": "4.0", "Content": "camera has many features, requires some time to get used to and is little bit more complicated then my previoues SONY DSC Cybershot. After spending couple of hours I went thru most of the features. Help button is a great addition, it gives you all the shortcuts and learns how to shoot. You can search by keyword or by purpose of shooting and right from help screen it allows to jump into shooting mode, the only thing you need to do is press the button. Quality is pretty good with great optical zoom. However, getting too close to object is giving you a blurry picture, auto-focus does not work. I was looking for size/quality/zoom options of camera. I think I got them. Price was really low compared to other brands on market.", "Date": "December 3, 2011"}, {"Title": "PIECE OF CRAP! - WARNING!  DO NOT BUY!", "Author": "Aprilfool", "ReviewID": "R37QTRY2K0NVC7", "Overall": "1.0", "Content": "My first digital camera was an Olympus purchased in 2000.  When I decided it was time to get a new camera, another Olympus seemed like a good option.  I was wrong.  Horribly wrong.This camera has not worked properly since purchased.  It has always taken grainy / blurry pictures.  No settings can fix the issue.  Then it wouldn't turn on.  Upon taking out the battery, I discovered the camera had melted the battery.  It took far too many phone calls dealing with Olympus representatives with an I-don't-give-a-crap attitude to get it repaired.  When they returned it, they didn't send a battery.  That led to more phone calls and more runaround.  The photos are still grainy and blurry.  Even though it was \"repaired\" previously and still isn't right - they won't fix it again.I'm stuck with a $200+ piece of crap that won't take a picture that isn't blurry.This camera is absolutely useless.  Save your money and avoid an Olympus.", "Date": "July 9, 2013"}, {"Title": "It's OK, but the photos are grainy and pixelated", "Author": "Juya", "ReviewID": "R1FUPCACSTQAA8", "Overall": "2.0", "Content": "I bought this because I wanted the Zoom feature.  I didn't like the other zoom cameras because they were so bulky and you have the lens cap to deal with. You really need to use the extreme zooms with a tripod though - the slightest movement makes it blurry.I find that the photos are poor because the colors are weird or dull and that the quality really pixely and grainy.  If I zoom up on a subject with Photshop - it's not clear.  It may be 14mp, but that doesn't make the photos great.", "Date": "April 17, 2013"}, {"Title": "Somewhat pleased?", "Author": "bballplayer", "ReviewID": "R1X6R11AMMFSZQ", "Overall": "3.0", "Content": "I bought this camera hoping it would allow me to go light,not having to carry my dslr, when taking family photos and vacations. However, I am dissappointed in the quality of the pics and the flash is at best \"bad\". I also feel navigating the menu is not nearly as easy as other cameras we own. Namely Pentax and Cannon. I would not be attracted to the price as I was, and I would pay more and hopefully have the quality of photos I was looking for. I would not purchase this camera again. Back to the dslr...disappointed.", "Date": "September 13, 2012"}, {"Title": "Good Camera", "Author": "Cyrual", "ReviewID": "R3J967FL4B0X0Y", "Overall": "4.0", "Content": "I ordered this camera mainly for its zoom, while in Afghanistan.  I've taken many great pics with it.  The only thing I dislike is the menu wheel on the back is awkward to use.  It'll collect dust now that I'm home and have a cell phone with an 8mp camera, but it holds a charge well and it's ready just in case.", "Date": "September 2, 2012"}, {"Title": "good product", "Author": "jamerson", "ReviewID": "R2V2UG5FB85NHC", "Overall": "4.0", "Content": "This Olympus is ultra compact with excellent zoom of 18x which you would normally find in bridge cameras but is compact like the point and shoot. Loaded with features and video was crisp and sound was better than expected with no additional mic attached. I was well pleased to have purchased an everyday point and shoot yet performs like a bridge camera with tons of shooting options. This is a great camera to go anywhere with. Will recommend highly.", "Date": "August 28, 2012"}, {"Title": "Very good camera for the money", "Author": "yellow", "ReviewID": "R3IQVRCJBAGJR5", "Overall": "5.0", "Content": "The camera is very easy to operate.  It has a handle to keep it stable and it is light weight.  I just wish it came with an instruction book instead of having the instructions on line.  The automatic settings works great and there really is no need to go into the special feature settings.  The landscape setting makes the pictures too yellow.  I find the i-auto setting the best where the camera selects the best setting for the picture.  The software is good and it is very easy to use.  I would highly recommend this camera for anyone looking for an easy to operate camera that takes good pictures.  Amazon has the best price for this camera.  It costs a lot more in other places.", "Date": "August 27, 2012"}, {"Title": "Lot's in this little package", "Author": "John Shaeffer", "ReviewID": "R2IZM3JESFOFF4", "Overall": "5.0", "Content": "I've used many film and digital P&S; cameras over the years--this may be the best for all around results.  The zoom range is awesome giving adequate wide angle and remarkable zoom capability.  Lens quality is the best I've seen in a digital P&S; (from someone used to using Canons and Nikons).  Bought mine refurbished--feel like I have capability of a much more expensive camera in a package that allows sharp easy one handed shots, as the camera is so small.", "Date": "July 16, 2012"}, {"Title": "olympus", "Author": "Sharon", "ReviewID": "RK2LS6F7DH1MV", "Overall": "5.0", "Content": "This is a really cool camera. It does all kinds of cool pictures. Took a picture of the moon with it and it was perfect. could even see the craters in the moon", "Date": "May 6, 2012"}, {"Title": "Disapointed with this Olympus Camera SZ-10", "Author": "E. Simonson", "ReviewID": "R5QAMSXO4U9AC", "Overall": "2.0", "Content": "Got this camera for a fair price and now I wish I wouldn't have gotten it at all.First; Getting sharp photos seems to be a hap-hazzard effort with this camera, if you don't give this camera plenty of time to focus you will not get good photos. It will take many out of focus photos without you realizing this until you load the photos on a PC or anything with a larger screen. So don't risk getting a vacation full of out of focus photos with this camera like I did.Second; The battery eject mechanism seems to be really a cheap peice of wire at the bottom of the battery compartment and will bend or get misaligned sometimes on this camera and won't eject the battery at all, so you have to pry the battery out (not recommended as I did ruin one battery). This problem cropped up after only using the camera for about 3 months and going through a battery change maybe 20 times since I've had it. My advice is don't buy extra batteries, just recharge the battery in the camera without removing it using the Olympus supplied recharge cord that comes with this Olympus SZ-10.  Good Luck", "Date": "September 14, 2012"}, {"Title": "olympus sz 14", "Author": "E Taylor \"amazongirl\"", "ReviewID": "RJ1S52M9A84J", "Overall": "2.0", "Content": "This camera was bought as a gift for me last october, it was easy to use and i have taken some great pics on it, however..... to begin with my camera wouldnt focus properly but it was only on very rare occasions do i dissmissed it as maybe i had accidently pressed the zoom button without realising it, now a year on, it happens all the ime even in auto focus, i can maybe take about five pictures before it goes blurry, and nothing i do seems to sort it out.... reading other reviews, i can see this is a common problem, and just for that, i dont reccommend buying this camera......", "Date": "December 22, 2013"}, {"Title": "Love this Camera.", "Author": "JANIS ROCK", "ReviewID": "R3IGQXMWOLON95", "Overall": "5.0", "Content": "This is the last camera I will need to buy, small, but easy to hold, I will never run out or fill the memory card..", "Date": "October 15, 2013"}, {"Title": "Great product for great price", "Author": "Nadia Abdul", "ReviewID": "R316AXQW9O4NBO", "Overall": "5.0", "Content": "I ordered this really cheap and loved it! The price was really nice and the product was really good so it was a great buy!", "Date": "July 19, 2013"}, {"Title": "fabulous", "Author": "joha.rodriguez", "ReviewID": "R1YCADQM07KBR7", "Overall": "5.0", "Content": "The camera can take pictures very sharp depending on the type of picture you ask, the zoom takes sharp photos up close like that impressed me. No anti-vibration making it difficult to take pictures in motion sometimes come and sometimes not, as I am no expert photographer. The video is good and gives option of adding photos in voice comments. I still do not see how to use the Wii Fi? because it gives me the option in the menu.", "Date": "April 3, 2013"}, {"Title": "Olympus SZ-10", "Author": "Donald A. Hong", "ReviewID": "R9CF9W7XI4BP4", "Overall": "5.0", "Content": "I am very happy with my new Olympus SZ-10 camera. It is very portable and easy to slip into a shirt pocket. I use a lanyard to hang it around my neck when I do carry in a shirt pocket. I like the small size and the big zoom!", "Date": "February 20, 2013"}, {"Title": "Full HD", "Author": "Antonny Rincones", "ReviewID": "R3RO8EPG9AGH5V", "Overall": "4.0", "Content": "Cámara con buenas tomas en cualquier tipo de ambiente (con o sin luz). Potente flash y un zoom excelente.Contra: un poco lento el disparo.", "Date": "January 24, 2013"}, {"Title": "Great companion!", "Author": "Doodlebug", "ReviewID": "RN6DFM0TGWDZY", "Overall": "5.0", "Content": "This is a great all-purpose camera, good size/weight, etc. The controls on the \"wheel\" on the back can be hard to navigate with the average finger. I love the 18x zoom, though.", "Date": "January 6, 2013"}, {"Title": "Olympus SZ-10 14 MP Digital Camera with 28mm Wide-Angle 18x Optical...", "Author": "K9sRule", "ReviewID": "R2NMPBEV0I1LTW", "Overall": "5.0", "Content": "Awesome Camera for the Price! Has allot of features built in! I Love the picture quality & ended up buyin another same camera for a family member!", "Date": "January 3, 2013"}, {"Title": "Decent camera", "Author": "Jia Liu", "ReviewID": "R3VD4HPPT1OILS", "Overall": "4.0", "Content": "Good camera, easy to use and good image quality.  Only complaint is battery life is too short. Does not last for a long day.", "Date": "December 22, 2012"}, {"Title": "Love it", "Author": "Karen Stewart", "ReviewID": "R1QRXRT1S0XJ99", "Overall": "5.0", "Content": "Best thing I have bought in years...Love the picture quality it has.. Great for videos. Would recommend this for any one.", "Date": "December 16, 2012"}, {"Title": "Product quality is good", "Author": "sokabaru", "ReviewID": "R1NY743ZQ2U8J5", "Overall": "5.0", "Content": "Product quality is good .. is according to the price paid .. recommend this product is just what I needed", "Date": "December 10, 2012"}, {"Title": "Awesome", "Author": "baller550", "ReviewID": "R2KI421POZWRKR", "Overall": "5.0", "Content": "This camera has a lot of very good features. One reason i bought this camera was its zoom. It has an 18x optical zoom.  The zoom is absolutely really stunning. I zoomed up to the top of a water tower and i could see the top perfectly. It also has amazing burst mode. If you dont know what burst mode is, it takes pictures rapidly. It is really fast.", "Date": "October 20, 2012"}, {"Title": "Olympus Camera", "Author": "Sharon", "ReviewID": "R2CO0W899UFM61", "Overall": "5.0", "Content": "I had an Olympus before and loved it until it died. I love my new Olympus it gives me great pictures. It is just what I wanted.", "Date": "October 15, 2012"}, {"Title": "el zoom de esta cámara es impresionante!", "Author": "wilmer ramos", "ReviewID": "R1OWHVKG4VKS2P", "Overall": "5.0", "Content": "después de un año de haber comprado esta cámara, no deseo cambiarla aun.. puedo actualizarle el software cuando este disponible. recomendada para tomar fotos a larga distancia, incluso en movimiento-para esta función recomiendo usar trípode!disculpen la tardanza del comentario, a mis compañeros de Venezuela, amantes de las fotos y vídeos. aquí tienen excelente opción. saludos desde Caracas-Venezuela!", "Date": "June 28, 2012"}, {"Title": "Good for the money", "Author": "Melissa ps", "ReviewID": "R3QX5LRAHJTVS3", "Overall": "4.0", "Content": "The camera takes crystal clear pictures when you are on the right setting. It takes some time and you will need to play around with it but great camera for the money.", "Date": "April 14, 2012"}, {"Title": "Loved my Olympus SP550UZ!!", "Author": "R. Miller \"charl8sweb\"", "ReviewID": "RE7S36L4TPIAX", "Overall": "2.0", "Content": "Clarification:  I DON'T like the 810!  Loved my SP550 which led to get another Olympus.  But this 810 - is frustrating.  The auto focus is wacked.  I have tried everything!!!! Wishing I had fixed my 550 :(A few years ago I purchased the Olympus SP550UZ for myself.  I have had many different digital cameras and have found this one to be the BEST.  I am sad to say I am looking to replace it because dummy me, I dropped it on the lens.  The camera shop wants $130 just to ship it out and more than likely will exceed $200. Might as well upgrade from my 7.1MP to the 14MP of the SZ-10 (costs more to fix mine!) The 18x optical zoom is awesome!  The pictures are fantastic and the camera is easy to use. I highly recommend.  Over the years I've owned Kodak, several FujiFilm cameras and Vivitar.  My Olympus is my favorite by far.", "Date": "September 14, 2011"}, {"Title": "Easy to use", "Author": "Alssau", "ReviewID": "R1CZM8FJV3AQBW", "Overall": "5.0", "Content": "I bought this camera for my dad who is not very into technology and he has been able to handle it pretty well. Even when my uncle saw it, who is more of a radioshack kind of guy, was impressed with the zoom this camera provides, as well as the 3D feature.I do believe it was the best investment I could have made.", "Date": "January 2, 2012"}, {"Title": "Best Buy", "Author": "Maria Pedro", "ReviewID": "R1GHGQ9ZREDJ65", "Overall": "5.0", "Content": "I am so happy that i bought this camera - at least it has the rechargerable batteries - i luv it", "Date": "April 23, 2012"}, {"Title": "Olmpus sz-10", "Author": "noyan er", "ReviewID": "R2F8WIHR003743", "Overall": "5.0", "Content": "The product arrived as advertised. This is a quite nice camera, with impressive picture quality.The price, when I bought it, was reasonable.", "Date": "February 23, 2012"}, {"Title": "exelent service", "Author": "gerald de baker", "ReviewID": "R1DGQCADL6XSHP", "Overall": "5.0", "Content": "exelent quality recieved faster than predicted great company to deal with bla bla bla bla and so on so forth", "Date": "January 17, 2013"}, {"Title": "wonderful zoom", "Author": "Cesar", "ReviewID": "R3QB28XMSEEIMA", "Overall": "4.0", "Content": "I had a olympus sp-310 7.1mp, I love it. I ordered an Olympus sz-10 for more mp, and I love the zoom. but no zoom in video mode, no RAW and no manual mode.", "Date": "January 3, 2012"}, {"Title": "Too dificult to use", "Author": "Tiffany Perkins", "ReviewID": "RWZNYAL4AYQSV", "Overall": "1.0", "Content": "Camera wouldnt focus well at all. We missed so many great moments with our infant bc the pics came out blurry. Had to keep flash on at all times which caused her to make strange looks. Terrible camera. Do not buy.", "Date": "March 21, 2012"}, {"Title": "Nice Camera", "Author": "Oscar Lopez \"oscar\"", "ReviewID": "R3NXN7V6GFWPH2", "Overall": "4.0", "Content": "HelloI bought this camera for the price and Optical zoom...I believe is the best in the market for this price and its functionalities.For improving...the Zoom Process on video HDRegards", "Date": "November 2, 2011"}, {"Title": "DON'T!", "Author": "World-Wide Adventurer", "ReviewID": "R1ZW2HWDYETNMY", "Overall": "1.0", "Content": "The Olympus SZ-10 camera makes unacceptable images and the accompanying software is very \"buggy\". The software slowed my entire O.S. to a crawl, so I have now sold the Olympus and all accessories to someone else. Replaced the camera with a nice and reliable used Nikon D50 with a 55-200mm Nikkor lens, which was only $255.00 (including packing & shipping)  from KEH. Now I own a REAL DSLR camera and it makes pin sharp poster size prints, too! (If Olympus could not \"get it right\" with the SZ-10 the first time, why should consumers spend hours of frustration attempting to make it right? From now on, I'll be purchasing Nikon products!)", "Date": "February 1, 2012"}, {"Title": "Really Crappy Camera", "Author": "Travisman", "ReviewID": "R32QAFYFHCMLI8", "Overall": "1.0", "Content": "I've owned a lot of digital cameras over the years and this is by far the biggest disappointment.  Its the worst camera I have ever owned and the amazon purchase I have ever made.  The zoom is good, but the pictures are blurry.  Even the slightest movement on Sports Mode comes out blurry.  I'm seriously wondering if I got a defective camera.Its not user friendly at all.It has all the disadvantages of a manual camera and a point and shoot camera combined...plus blurry pictures.  I think I'll go back to Cannon or Nikon....hell...my cell phone has a better camera on it!", "Date": "November 12, 2012"}, {"Title": "Olympus SZ-10 228725", "Author": "Dan", "ReviewID": "R1BGLYKPJ4000A", "Overall": "5.0", "Content": "Olympus SZ-10 228725 14 MP Digital Camera with Super-Slim 28mm Wide-Angle 18x Optical Zoom and 3.0-Inch LCD (Silver)Love this camera easy to use and learn", "Date": "September 3, 2011"}, {"Title": "Bummer", "Author": "M. Leedahl \"Rattler\"", "ReviewID": "R2NLAG2YGJ0E65", "Overall": "4.0", "Content": "I bought this camera, I had it o.e week, mu wife droppedit about 2ft. Ooff the ground sa nd now the camera is worthless. This camera os not durable. Junk.", "Date": "March 11, 2012"}, {"Title": "good", "Author": "Rina_sanandres", "ReviewID": "R1EV2T448UQ87Y", "Overall": "4.0", "Content": "es una excelente camara pequeña, con muy buen zoom, le doy 4 estrellas solo por que mientas se esta filmando no se puede hacer zoom, pero de ahi la calidad de las fotos muy buenas...", "Date": "October 12, 2011"}, {"Title": "Excelente Camara", "Author": "Walter", "ReviewID": "R3NO7ZAJQHFCEE", "Overall": "5.0", "Content": "Esta camara es excelente, las fotos son muy nitidas y su alcance es muy bueno , valio la pena haberla comprado,las fotos panoramicas son increibles.", "Date": "August 15, 2011"}, {"Title": "Camera", "Author": "Jim Herndon", "ReviewID": "R2MVFW3OGC1JFH", "Overall": "5.0", "Content": "I bought this for my daughter for Christmas. I cannot review it as it was a gift. She seems to like it.", "Date": "January 3, 2012"}, {"Title": "camera", "Author": "just a mom", "ReviewID": "R1T76022V8ANZZ", "Overall": "5.0", "Content": "love this camera easy to use and learn** the diff options and the size is perfert **did not print out any pics yet but so far love it  ** only gave 4 stars cuss i didnt print the pics but i am sure they would be great", "Date": "August 22, 2011"}, {"Title": "best one", "Author": "Ernest", "ReviewID": "R1DOQ721J1AIN9", "Overall": "5.0", "Content": "this is a very good camer picture are nice zoom so nice  you can use it for in thing", "Date": "June 14, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "14 MP Camera\nSuper-Slim 28mm Wide-Angle Zoom\n3.0 460K LCD\nSDXC Compatible\n720p HD Movie with HDMI Control", "Name": "Olympus SZ-10 228730 14 MP Digital Camera with Super-Slim 28mm Wide-Angle 18x Optical Zoom and 3.0-Inch LCD (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51pD8phNNbL._SY300_.jpg", "ProductID": "B004L2L6LA"}}