{"Reviews": [{"Title": "GREAT CAMERA!", "Author": "Pinderella", "ReviewID": "R1EHADTQQY70DM", "Overall": "5.0", "Content": "I am very picky about my point and shoot cameras. They have to be easy to use and have a long battery life. This camera is AMAZING. The pictures come out beautiful. The buttons are easy to figure out and there are two separate buttons for snapping pictures or taking video. No more messing around trying to figure out what setting to use for a video and having to go back and change it to take a picture. The camera is small too so it doesn't take up alot of room in a purse and easily fits in a pocket. I love this camera! Oh, the panorama shots are so easy to do and come out very impressive! I bought it at Sam's Club for $108 and it came with the case, a 4G SD card, strap and charger. Great deal.", "Date": "May 8, 2011"}, {"Title": "Very disappointing.", "Author": "MaryBT", "ReviewID": "R12CY79MQTYCZ0", "Overall": "2.0", "Content": "I have a higher-end Kodak Easy Share which I love.  I bought this one because it's small and easy to carry in my pocket when I'm just going to be taking snapshots.  I realize that this is a point and shoot and won't give SLR results.  However, well over half my pictures are turning out blurry - even when I double check to make sure I have the green \"in focus\" box.  The colors are very washed out.I chose this one because of the film options; I could have saved myself the frustration.  They rarely are in focus.The only time the pictures come out decent that I have found is when you are standing 6-10 feet from the subject and are outside on a bright sunny day with the auto picture setting.  Forget overcast conditions, indoor pictures, or any picture within the optical zoom range.", "Date": "June 1, 2011"}, {"Title": "Kodak misses the mark...a downgrade from previous models", "Author": "CameraUser2011", "ReviewID": "R3SH3ACB0G1BCO", "Overall": "1.0", "Content": "This is a definite downgrade from previous Kodak models. I have been buying Kodak cameras for five years and thought that I would remain loyal to the brand in perpetuity, but buying this camera has changed my mind. On average I buy a new Kodak once per year, and I have never been disappointed. Each new model seems to build on the previous one, although in some cases some obvious errors in design and function are made. The most obvious one was when Kodak switched from being able to control settings immediately on the camera without having to turn on the device to having to do things when the camera was on that took up precious time. This camera at least does not have that issue. You can easily use video or take pictures witout having to mess with settings. However, if you want to switch between different modes, there are several screens you have to go through to do so. It's not a big deal and definitely not complicated, but good picture situations can turn into mediocre picture situations in fractions of a second. Even looking at your pictures reguires that you hit the review button and then again hit okay to go into a subfolder. The quality of pictures is definitely a huge downgrade. I have never had a Kodak camera take such blurry pictures in EVERY mode. If the subject is moving even a little bit, you can expect a lot of blurring, even if you manually set the shutter speed to it's maximum. Also, I have never had a Kodak camera malfunction like this one. There seems to be a severe problem with the video. Many times when taking video it will simply freeze and delete whatever footage was shot to that point. This is not an isolated problem, it is an intrinsic issue with this model. The great colors and white balance adjustments from previous models are also gone from this camera. It usually takes pictures that are either too dark or too bright. Overall, it is a very lackluster point and shoot. It is no wonder that the initial retail price was below older models, even older models that are still on the shelf with similar specs (14MP, 5x zoom, etc).", "Date": "September 21, 2011"}, {"Title": "Easy Does It", "Author": "walderworld", "ReviewID": "R2AYKD721BZYAI", "Overall": "5.0", "Content": "When they say \"Easy Share\", they are not kidding.  We took 235 pics on vacation, and had them organized, labeled and sent in 35 minutes.  Any we are not the techies of the world.  Love this camera.", "Date": "July 6, 2011"}, {"Title": "Not the greatest camera", "Author": "vt'er", "ReviewID": "R3N5I3XMP86MYM", "Overall": "1.0", "Content": "We've had this camera a little over a month and have found a few things we don't like about it.  First, the pictures tend to come out blurry -- even when we're sure we have the green box in focus.  Second, the on-off/camera shutter/video record buttons are all within an inch-and-a-half of each other on the top of the camera. If you accidently push the wrong button, you either shut the camera off or start recording a video instead of taking a picture. Third, we miss the \"dock\" option of this Easyshare product. In the past, the camera has always sat in the dock to recharge with one-touch button transfer to the computer. This one needs to be plugged in (and the flap to get to the USB plug is hard to open and looks like it could break off at any time). I should add that when we purchased the camera, it did not come with a hand strap. We had to contact Kodak and have them send one. We had to go through a bunch of hoops to prove we recently purchased the camera and e-mail a copy of the receipt to them (all for a simple strap that probably cost them pennies). I thought we'd be able to use it without the strap, but found it was just to small to handle without it slipping out of our hands. Bottom line: We will probably keep this camera as a back-up, but I think we'll be looking at something else. If I were you, I'd shop around for something else.", "Date": "June 12, 2011"}, {"Title": "Blurry", "Author": "G. Tutmac", "ReviewID": "R183RB78MHNNHJ", "Overall": "1.0", "Content": "I purchased this camera to replace one I dropped at a wedding. Pictures are blurry not at all like my old one, Went overseas and the pictures are so disappointing. A shear waste of 100+ dollars, not to mention pictures of a trip of a lifetime. If I could I would take it back. I'll just have to settle for the garbage can.", "Date": "November 6, 2011"}, {"Title": "A dandy Camera for the price.", "Author": "Kenny Menno", "ReviewID": "RT7HBZRE7UR34", "Overall": "4.0", "Content": "I recently purchased the Kodak Easy Share Camera just to have a camera for those special times.  It fits into my pocket so I can carry it with me anywhere.  Just point and shoot is so easy.  One nice feature is you are able to create a variety of styles of photos from sepia to Kodacolor.  It also has a button to put your photos on a variety of places including Facebook.", "Date": "August 20, 2011"}, {"Title": "good", "Author": "Amanda", "ReviewID": "R353FBIEP7V77E", "Overall": "4.0", "Content": "this camera is adorable, just like i wanted. it is more simple than i expected, but it works great and has good quality. takes great pictures", "Date": "August 31, 2011"}, {"Title": "Good camera, easy to use", "Author": "leecottrell", "ReviewID": "RADSF94V7F1KY", "Overall": "4.0", "Content": "The camera is very easy to use. Pictures are of high quality. Transferring to the computer is easy and painless.", "Date": "June 13, 2011"}, {"Title": "Good product", "Author": "sparkplug11611", "ReviewID": "R307LCBFGYBN4D", "Overall": "4.0", "Content": "Takes nice pictures in most settings, though occasionally the photos come out blurry. Smart Capture mode is effective, other preset modes sometimes dont turn out as well. Very compact, stylish, and easy to use. Share button makes uploading pictures to computer and posting or emailing extremely easy. Great zoom capabilities and various flash and timing modes available. Overall a great product!", "Date": "August 12, 2011"}, {"Title": "Love it!", "Author": "Amy W", "ReviewID": "R2BKEIVHU63O3U", "Overall": "5.0", "Content": "First off, I'm not sure why people are giving this a bad rating saying they expected more, blah blah.  This is obviously not a \"high end\" camera, its 100 dollars (about).  If you want something fancier, then pay more money. You can't spend 100 and expect it to have every bell and whistle you want.That being said, I LOVE this camera!  I actually got it from HSN.  THey had this awesome combo deal:  Kodak Printer (4 in 1 - print, scan, copy and fax), nice viewing screen, SD card slot, ect.  AND this camera - both products, plus 6 programs/software (for making cards, calendars, ect.) and a $50 dollar off coupon to kodak's website.  All that for 200 dollars.I got this in the dark pink color as it was the closest I could get to purple.  I bought a 16MG SD card from amazon here, the amazon basics brand actually (16 GB, class ten), and it works perfectly with this camera.  The camera takes very very good pictures.  It offers a lot of settings, effect, ect. and overall I am absolutely thrilled with it.  It takes great video too. have only had it for a few days, so still have not tried everything I can with it, but am very happy.The easy share feature is so easy to use!  When you plug the camera into your computer the needed software downloads/installs automatically with just a few prompts from you.  Now that it is set up all I have to do is select where I want each picture to go, and then this software sends the pics to my computer's picture folder, to facebook, to my email, and whereever else I want all at once!  Before I had to take the SD card, plug it into my computer and copy/paste the pics to my computer, then go to facebook and upload them there, then go to my email and send them out, and well..you get the picture.  The easy share feature saves me a TON of time and effort. I have 3 young boys and send a lot of pics to family and friends and this makes the task so easy!It came with a wrist/hand strap which is nice.  The only thing I needed to purchase separately was a case, which I found one here on amazon, black for 3 dollars. Can't beat that! =)If you do not need a \"fancy\" camera, but still want a good camera that takes very very nice pictures, I highly recommend this one.", "Date": "October 15, 2011"}, {"Title": "Disappointed!", "Author": "David Myers", "ReviewID": "RCXZZX5ZS948Z", "Overall": "2.0", "Content": "Found this camera on a smokin' sale at a local warehouse club, and decided to try it since I had just broken my M530 over the weekend on vacation.  I thought that surely, this one would be just as good as my old one...and that was not the case!  Since it's still X-Mas time at my house, I figured that some of the holiday decorations would be perfect to take some shots of, and then compare those photos with an older Canon SD1100 to see which ones were better.  NO contest...the older Canon was far superior in every way.  I just could not get the Kodak to get a clear picture of the little Annalee dolls that I was using as my test subjects.  Pretty much every photo was fuzzy...not what you want in a point-and-shoot camera.  While each shot (taken in the same place just seconds apart) with the Canon was spot-on.  I guess that what I got out of all of this, is that the Optical Image Stabilization is a big deal; the Canon has it, the Kodak does not.  The little M552 has already found its way back to the warehouse club, and I have cash in my pocket.  I REALLY wanted to like this camera, but it just didn't work out!", "Date": "December 28, 2011"}, {"Title": "Disappointed", "Author": "Frugal Shopper", "ReviewID": "R1OILZ31F8T3SI", "Overall": "1.0", "Content": "I had a Kodak M763, which took great photos in bright light, not so great in dim light, but still a good value.When it died, I needed a camera in a hurry for an event, so I bought the M552, which was what was available locally.The M552 takes lousy pictures.  90% of them are out of focus.  Every now and then you get one in perfect focus, but it is rare.  I have read the manual, I hold the button down half way to make it focus, wait until I get the little frame, but the photo still is blurry.Don't buy this camera.", "Date": "December 25, 2011"}, {"Title": "Also Disappointed", "Author": "Kimberly Strow", "ReviewID": "R222TWEZQMYPIX", "Overall": "2.0", "Content": "My previous camera is two years old and it turns off when I try to zoom in, so I thought it was time for a new one, get up to speed with the new technology. This camera had a good price and seemed to have some nice features. Just got this and am really disappointed so far, thinking I'm going to return it and stick to old-reliable.First off, the camera itself and the buttons do NOT feel well made. It feels like I could break it very easily with one drop onto cement. It took me a few minutes to find out where to plug in the charger to, and realized it's under a flap on the side.I guess I didn't read properly, but I was under the impression that this was a touch screen camera, and it's not. You have to scroll through every option even to get to \"cancel\" or \"done\" because there is only a button for \"OK\" and \"delete\". I still cannot figure out how to share pictures. You open the share option and pick where you want to send the picture and after that I am lost (By the way, I am in my early 20s, part of the generation who can figure out any technology in 2 seconds without a manual, so I don't know how anyone older can get this).Since I was having trouble with the zoom feature on my older camera I made sure to test the zoom right away on this one, and it's WORTHLESS. I zoom in a picture and it comes out completely blurry with the object beyond recognition. I kind of miss the option my other camera has for action shots or close-ups, this one doesn't have the little knob you scroll around like that one so I don't know how to get to any of these option IF this camera even has them. To test the action shot I waved my hand around and took a picture and it came out decently enough.I'm gonna say that if you need a camera and aren't used to anything special and just want to take some pictures then for the price this is okay to have. But if you really don't need it, don't get it! Stick with your old reliable camera like I should have done because now I'm gonna get stuck sending this thing back to Amazon! I will try it out more this weekend on a trip and edit this review if I see fit, but I am not too hopeful.", "Date": "June 2, 2011"}, {"Title": "Great little purse camera", "Author": "Sun lover 1527", "ReviewID": "R267G8ZI96Q4LQ", "Overall": "4.0", "Content": "Bought it as a purse camera for when I didn't want to take my Nikon D500. Takes clear pictures, has enough modes that I can usually get the snapshot I want. Takes nice close-ups. In bright outdoor settings the LED screen is useless. Took some adjusting to holding it still when I took the shot but quickly adjusted. If I had it to do over I would have spent a few more dollars and bought one with more zoom ability.", "Date": "March 7, 2014"}, {"Title": "Much better than your cell-phone pictures", "Author": "Agnes E. Conway", "ReviewID": "R1MRW9U325ZNOT", "Overall": "5.0", "Content": "Great product for the price.  This camera is a much better option than using your mobile phone as a camera.  It's small, and light-weight, and the picture quality is great.", "Date": "November 22, 2013"}, {"Title": "Kodak camera", "Author": "Jan S. House", "ReviewID": "R1XQNOAKL3FVNJ", "Overall": "5.0", "Content": "Perfect camera for my classroom blog.  Easy to use, kids can use.  Work great easy to charge, exactly what I wanted.", "Date": "September 23, 2013"}, {"Title": "Click shoot print", "Author": "Loree L. Rozanski", "ReviewID": "R1DC7IKL7JG4D1", "Overall": "5.0", "Content": "Camera is great but I did have a little trouble learning how to upload the pics on my computer because the program isn't downloadable anymore. So I just have to take out the picture card so it works out. Takes great pics", "Date": "September 13, 2013"}, {"Title": "I give it 4 stars", "Author": "Pennie M.", "ReviewID": "R2ACTJ9TAHDF4A", "Overall": "4.0", "Content": "I like the camera so far although it isn't as easy to use as my previous Kodak. The reason for only 4 stars is because I had to go out and buy the adapter to hook up the camera to  my computer which was $20. This usually is included with the cameras - so I didn't really get any bargain through Amazon.", "Date": "May 13, 2013"}, {"Title": "LOVE IT", "Author": "melissa m.", "ReviewID": "RJJCA01XM3NUO", "Overall": "5.0", "Content": "I love this camera! I have a 2 month old and it takes wonderful pictures Plus you can take pictures from a video which is awesome!", "Date": "May 2, 2013"}, {"Title": "EASY? Share...", "Author": "Lauren Cohen", "ReviewID": "R1OGUCJAGRY3GR", "Overall": "2.0", "Content": "It worked okay, at first. Now, when I want to get my pictures in my computer, I have to re-install the software; & that doesn't include uploading them on to Facebook! I've had EasyShare before, so I don't think it's Kodak's problem; I just think I got a lemon from this particular seller.", "Date": "April 9, 2013"}, {"Title": "Kodak EasyShare 552", "Author": "Lizzie S.", "ReviewID": "R1DJRLFD0Q8RHZ", "Overall": "1.0", "Content": "Camera came without USB cable to charge it. Went to Radio Shack to purchase a cable and had to pay $25 for it. Got the camera charged, turned it on and the lens came out at an angle and would not go back in. Returned via Amazon and got great customer service-pickup of defective camera in one day and a credit to my account in a day.Defective camera but great Amazon customer service.", "Date": "March 7, 2013"}, {"Title": "Kodak Camera", "Author": "Carolyn King", "ReviewID": "RVMK6B09DAO9V", "Overall": "3.0", "Content": "I had a similar one that I dropped in the water so I got this. I had to send it in for repair for lens obstruction then two months later I had to send it in to have the lens assembly replaced. Other than that, it's an okay camera.", "Date": "February 10, 2013"}, {"Title": "San Francisco Trip", "Author": "Denita", "ReviewID": "R26ODG7RZRNY20", "Overall": "5.0", "Content": "My bestfriend went to San Francisco for her 40th birthday. She didn't have a digital camera and I told her an old school camera is unacceptable for this amazing trip. I gave her this camera before her trip, so she could learn how to use it. She loves it. She says this is the best camera she has ever used. Needless to say, the camera was a huge hit!!", "Date": "February 2, 2013"}, {"Title": "Great Camera Easy to Use", "Author": "kbdbull50", "ReviewID": "R2HCDQYAIPMQCT", "Overall": "5.0", "Content": "This Easy Share Camera works great for my granddaughter.  Easy to operate and great pictures!The Hot Pink Color \"yeah\" she says", "Date": "January 16, 2013"}, {"Title": "Worth it!", "Author": "Susanna Juarez", "ReviewID": "R3MSLEB55YCIUB", "Overall": "4.0", "Content": "I bought this for myself and liked it so much that I bought it for  a \"technically\" challenged friend's birthday . . ...... Who loved it so much she bought it for her son's. birthday  Reasonable price, quality pictures, fun and easy to use.", "Date": "December 29, 2012"}, {"Title": "Love it!", "Author": "jenn", "ReviewID": "R2A2EE4IDU0O2I", "Overall": "5.0", "Content": "I just received camera about month ago love it! I was worried at first no disk to download pics to laptop but went online downloaded share version now I upload without no problem to my social networks and via email to family. I have had no problem with blurry pics and found the camera easy to use. I always have bought small Kodak size cameras to the higher end of their selection and this is one of the best.", "Date": "December 18, 2012"}, {"Title": "GREAT CAMERA", "Author": "Thomas Dorschel \"Tom\"", "ReviewID": "R31AYFGK7XIZOX", "Overall": "5.0", "Content": "perfect clarity pictures and videos. easy transfer button for ease of sharing to computer or online !! the video quality is stu8nning, the pictures as well!", "Date": "December 17, 2012"}, {"Title": "worked fine.", "Author": "cyanglady", "ReviewID": "R1BT2UII9B5F19", "Overall": "3.0", "Content": "it was just fine ...it was a gift.i would recommend it since my friend likes it so much.", "Date": "November 19, 2012"}, {"Title": "Great camera!!", "Author": "Paola", "ReviewID": "RS3P3AMFSDHYK", "Overall": "5.0", "Content": "Definitely this is a great purchase!!! It met my expectations totally and its very fair for the price. I really recomend this product.", "Date": "October 14, 2012"}, {"Title": "Camera", "Author": "sandra", "ReviewID": "R2TMWD3GIZW3MP", "Overall": "5.0", "Content": "Camera was sent on time and it came with everything it was supposed to have. I had it for nine months and its still going strong. The camera is good for people who want a basic camera. Easy manual and the buttons are easy to push as well. great purchase I will buy another Kodak in the future.", "Date": "August 24, 2012"}, {"Title": "Kodak", "Author": "orlibe", "ReviewID": "R2OVCXZ9L2C7AY", "Overall": "5.0", "Content": "Very good product. It arrived on time and It was I hope. I recomend it for a gift in a special ocation, for a girlfriend, mom or dad.", "Date": "August 10, 2012"}, {"Title": "Very Disappointed", "Author": "Socialwkr", "ReviewID": "RXBCE3IZX9GA9", "Overall": "2.0", "Content": "I also own a larger Easy Share and wanted one that was more portable.  The only reason I gave this 2 stars is because it is more portable than my old camera and the menu and selections are easy to navigate.  That being said, it takes AWFUL pictures.  I ended up taking most everything in \"sports\" mode to try and decrease the likelihood of blurry pictures.  Waste of money.  I just dug out my old Easy Share Z710, and even with half the megapixels it takes much nicer pictures.  Am going to ditch this one.  I would not recommend buying it.  My daughter has a Sony Cyber-shot that she got as a gift and while not perfect works much better than this one.  Just checked and around the same price point.  Sorry Kodak.  Don't buy this camera!", "Date": "July 26, 2012"}, {"Title": "Kodak", "Author": "Gayleen Vogel", "ReviewID": "R1FEUGXQENJ106", "Overall": "5.0", "Content": "Perfect condition...packaging great...product works fantastic! Beautiful!! Very easy to use and all needed accessories were included. I would recommend this product yo anyone", "Date": "June 8, 2012"}, {"Title": "Perfect", "Author": "Pen Name", "ReviewID": "REFDA4J28SHXW", "Overall": "5.0", "Content": "Even better than I expected, the service was amazing and it shipped fast. The camera is good, I wished it had a date stamp feature but all else it great.", "Date": "May 20, 2012"}, {"Title": "Kodak EasyShare M552", "Author": "GrooveMan", "ReviewID": "R3IFOK75IXXO8A", "Overall": "1.0", "Content": "One of the worst cameras I have ever purchased, I bought this camera for a friend and I'm truly embarrassed to send it.It shoots at 14MP, which is great, to bad all you get is a super high quality blurry distorted images.  Even after setting it to the highest shutter speed and using the built in \"Sport\" mode for action shots the images are terrible.  The only way to get anything to come out that doesn't look like it was shot while strapped to a paint shaker, is to completely brace the camera while holding your breath and hoping your subject is not moving at all.  Walking and shooting is completely out of the question.This camera is extremely slow between follow up pictures.  Depending on the size of the photo taken it can take up to 12 seconds to take a second follow up photo.  I have tested several brands of memory cards including Kodak's x100 speed ones, it made no difference, the bottle neck is the camera write speed not the cards.  There is nothing more frustrating than taking a picture, seeing that its blurry (again) and trying to take a follow up only to stand there and wait.  If you think 12 seconds is not too bad, try counting out loud 12 Mississippi's; its ridiculous.  I even went as far as to look for a firmware update thinking these issues must have been fixed and I just have an old version.  Nope, I have the latest and greatest, my blurry and slow Kodak M552 is working as intended, simply an appalling product and a very disappointing purchase.", "Date": "April 23, 2012"}, {"Title": "Great product", "Author": "KSLaRosh", "ReviewID": "R2UCKGNIXC317R", "Overall": "5.0", "Content": "I bought this camera to take on a vacation. It came fairly quickly and works great. It opperates just like it is supposed to. I have not had any troubles with it \"processing\" although it did it once when I was first setting it up. Not sure why. I have not had it over a month so I may have a different opinion later but for now I am very satisfied!", "Date": "November 25, 2011"}, {"Title": "Stopped working for no reason", "Author": "SAS", "ReviewID": "RC77WV8WB0PAL", "Overall": "1.0", "Content": "Iv had this camera for a few weeks and just used it twice taking only a couple pics. It stopped working for NO reason, hasnt turned on since. I now have a useless camera that I cant use, NOR can return and get my money back...ONLY a partial refund. So Im out 50.00 for the \"partial\" refund. :(RESEARCH the return policies at AMAZON.COM for each item you buy!!!!", "Date": "June 26, 2012"}, {"Title": "It's okay", "Author": "Tiffany richter", "ReviewID": "R2XCO295P639HK", "Overall": "3.0", "Content": "It's takes better pictures than expected, but it is difficult trying to find the self timer! Nice color and easy to fit In a pocket.", "Date": "December 3, 2012"}, {"Title": "KODAK CAMERA", "Author": "PIPPI", "ReviewID": "R3S37R9BPNCKBN", "Overall": "2.0", "Content": "ITEM RECEIVED WAS NOT AS PICTURED.  CAMERA KIT DID NOT INCLUDE A CAMERA CASE AS SHOWN IN AD.  I SENT THIS CAMERA AS A GIFT FOR MY GRANDAUGHTER.  I WILL NOW HAVE TO ORDER A CAMERA CASE AND SHIP ANOTHER PACKAGE.\\", "Date": "June 5, 2012"}, {"Title": "great product", "Author": "lucky", "ReviewID": "RC2E8ZN7B4OVW", "Overall": "5.0", "Content": "I LIKE THE CAMERA A LOT BUT WHEN I RECEIVED IT ,THE BATTERY WAS MISSING AND I had toGO AND PURCHASE ANOTHER ONE WHICH I HAVE THE RECITE FOR. I DID NOT NOTIFY YOU BECAUSEI THOUGHT THAT MAYBE THE BATTERY WAS NOT SUPPOSE TO COME WITH IT, BUT WHEN MY DAUGHTER COME TO VISIT NE SHE READ ON THE BOX THAT THE BATTERY WAS SUPPOSE TO BE INTHERE, BUT I thought that it had been over 30 days and it had been too long.I SPENTTHIRTY EIGHT DOLLARS FOR THE BATTERY AND IT HAS TAUGHT ME TO ALWAYS LOOK AT WHAT I ORDER AND MAKE SURE THAT EVERYTHING THAT GOES WITH THE PRODUCT IS THERE.I LOVE MYCAMERA BUT I HATE THAT I HAD TO SPEND SO MUCH FOR A BATTERY.THANKS johnnieellington@ gmail,com", "Date": "February 19, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004FLL55Y"}}