{"Reviews": [{"Title": "A simple unpretentious camera that does what is meant for, and nothing more", "Author": "cincosauces", "ReviewID": "R10B4QYHXOOQFH", "Overall": "3.0", "Content": "I bought this camera because I wanted a simple little one to carry around all the time instead of my big DSLR. I wasn't expecting much for this price and, effectively, the camera is plain and simple with only the standard tools: adjustable ISO 100-1600, autofocus, red-eye reduction and decent video capabilities. It has a simple 3.3x optical zoom and a digital zoom up to 13x. The menus are simple and fairly intuitive. The camera is a bit sluggish even with a class 10 card. The pictures are just OK, do not expect glorious definition or colour response. The fact that the camera uses two AA batteries is advantageous, both if you want to use rechargeable ones or you find yourself somewhere in the world where you would otherwise not find the particular replacement for special batteries.Having said this you may wonder if it is worth. For this price, in my opinion, yes. Do not ask this little camera for things it was not designed to achieve. If you want a humble little camera to carry with you all the time or to give your children/grandparents as a present, take it. Do you want gorgeous pictures and advanced menus? Then this camera is not for you.", "Date": "May 12, 2011"}, {"Title": "Nice camera", "Author": "Littlerabbit", "ReviewID": "R3B4AX7MLZQZFD", "Overall": "4.0", "Content": "I like this camera... It is compact and has easy to use features...  The resolution blows my old Kodak Easy Share away...  The camera focuses and adjusts the flash automatically and you can take nice clear videos with good sound.If you are looking for a basic point and shoot camera, this is a good choice.  It also has a zoom lens which is nice.", "Date": "October 22, 2011"}, {"Title": "Oan okay kid camera, but unreliable focus -", "Author": "Matty Matriak", "ReviewID": "R1LJMMRAR6MTCI", "Overall": "2.0", "Content": "I looked forward to using this simple camera while out walking and cycling along the beach.  I was looking for something that was simple to use with decent quality.  I own several pro Canon DSLR's and never expected this camera to come close.  I did, however,  expect it to take at least decent pictures...and I was disappointed.The white balance was often off when shooting stills and after a hundred or so low quality shots, I figured the camera was either defective or of dubious quality.  Between the white balance issue and the camera never focusing correctly during video mode, it is going back to Amazon.I am not sure if this copy of the A800 is indicative of the product Canon released, but I will not be trying another one.  Up till this camera, every Canon camera I have owned has been top notch.I am giving camera two stars as the feature set is easy to work with and the menus navigate well.  If you have a copy that delivers image quality to your liking, then you have a decent camera.", "Date": "November 13, 2011"}, {"Title": "Great gift", "Author": "ann", "ReviewID": "R1IEQH7389XM41", "Overall": "4.0", "Content": "This is a great gift or for anyone that just wants to point and shoot. I strongly recommend it. Good Quality", "Date": "December 10, 2012"}, {"Title": "Good camera, good price, not perfect", "Author": "AngieBookWorm", "ReviewID": "R1Y4VR1Z04W1LP", "Overall": "3.0", "Content": "I generally liked the camera and found it easy to use.  However, I was surprised to learn that you absolutely needed a memory card.  Most cameras will have enough space to put a handful of pictures on, like 6 or 12, before needing to put in a memory card.  I bought my card separately and couldn't use the camera as soon as I wanted to.  I don't recall it being very clear that this was not a feature like it had been with every other digital camera I've ever operated.  I also found that pictures took a long time to process, meaning that once you took it, you had to wait almost 10 seconds before it would display on the screen and you could see whether you'd gotten the shot or not.  It also means that if lots of things are happening, you won't be able to capture them all because it takes so long to load between pictures.  I'd say about 80-85% of my pictures were clear, but a few of them came out fuzzy for no good reason.  I also don't think the zoom takes very clear pictures at all.  The flash also takes a long time to warm up after turning the camera on.  I know this is a lot of negativity and yet I gave it a generally high rating.  That is because I still think it is a decent camera, especially for the $50 price tag.  I'd give it a 3.5 if I could, because it's still an okay camera, but it would have to have one or two fewer annoying features for it to be a solid 4.", "Date": "October 24, 2012"}, {"Title": "Decent camera for everyday use, nothing fancy", "Author": "Tuck", "ReviewID": "R14LWK0OE33TMD", "Overall": "4.0", "Content": "This is your basic digital camera. Very easy to use and lightweight. Pictures are very average, but for a camera under $100, it is just right. Not many options that come along. I bought this camera because I had many upcoming vacations. I also bought a small carrying case that could also be attached to a belt(kind of dorky though can come in handy). This camera would be good for anyone who just wants to keep it basic. Uploading pictures to a computer or laptop is relatively easy as well. The camera is also durable and seems well built. Runs on regular old AA batteries. Some would prefer a rechargeable. If you manage battery usage well and carry extra in a camera case, there should be no issue. Otherwise, look for a rechargeable camera. Among other cameras of this price range this is definitely one of the better ones.", "Date": "September 3, 2012"}, {"Title": "Canon Powershot A800", "Author": "Corvette 828", "ReviewID": "R1G8MQWIX8G2Z0", "Overall": "5.0", "Content": "This is just what I was looking for. An inexpensive replacement camera that is automatic and does a great job. The zoom works real good and it takes good photo's.", "Date": "July 3, 2012"}, {"Title": "Great camera for the price", "Author": "George Nenadovich", "ReviewID": "RHUKCO4S2JTWE", "Overall": "5.0", "Content": "Great camera and easy to carry....takes good pictures andhas plenty of features for the price.  I never had a problemwith camera.", "Date": "August 22, 2011"}, {"Title": "Good product", "Author": "H. I. S. Alshehabi", "ReviewID": "R2SCZHPGJVHYFN", "Overall": "5.0", "Content": "It is a good product as mentionedwith relivant price and good size, so you can hold it in your pocket anywhereI hope it last for long time.", "Date": "August 26, 2011"}, {"Title": "Great low cost camera", "Author": "jciv", "ReviewID": "R1I3TQCTCIJHN1", "Overall": "5.0", "Content": "I got this camera for my dad.  He is able to take some really good photos with it.  It is a little bulky compared to the Canon Elph line, but still can fit in a pocket.  I chose it for the low price and was impressed by the image quality.", "Date": "May 20, 2013"}, {"Title": "Good camera", "Author": "Clarinetman", "ReviewID": "R2RHU1377PCVRW", "Overall": "5.0", "Content": "This camera takes very good pictures. It doesn't have a ton of special features. It takes a little while for the flash to charge. But for the price I am quite satisfied.", "Date": "May 14, 2013"}, {"Title": "good camera", "Author": "A. Salge \"ASalge\"", "ReviewID": "R1KXJJ5HKTFJID", "Overall": "5.0", "Content": "I got the camera for my grandparents, who are forever using disposable cameras with of course less than quality outcomes. I was looking for something with ease of use, a real point-and-shoot type camera but good quality. So far, my grandparents love it and have even expanded past point and shoot and are now using zoom and video. They love it, I love it.", "Date": "February 12, 2013"}, {"Title": "Birthday Present", "Author": "M. Bailey \"mom of 5\"", "ReviewID": "R52SQW937W3UU", "Overall": "5.0", "Content": "I am not the one using this camera but gave it as a gift to my daughter. She loves it. Works really well for a point and shoot. She likes that it takes AA batteries. Photos are clear and the screen on the back of the camera lets you see the photo very well after the photo is taken or when looking at all photos on the card. No cons found so far.", "Date": "February 6, 2013"}, {"Title": "Get this guy!", "Author": "Shawn", "ReviewID": "R317DUML0RC0RK", "Overall": "5.0", "Content": "Love this item! It's a great value for the money! Can't wait to start snapping family, bar and general pics!", "Date": "December 12, 2012"}, {"Title": "An excellent camera for the price point", "Author": "Eli Lilly", "ReviewID": "R3CYEECKH80CZJ", "Overall": "5.0", "Content": "I bought my wife one of these for her birthday.  We just got back from a trip to the mountains and reviewed the pictures she took with this camera.  They came out fantastic, way better than what I expected at this price point.  Some of the shots were downright jaw-dropping, the camera was able to get a fast enough shutter speed in somewhat low lighting to show almost every individual water droplet on one of the falls at Brasstown Falls in South Carolina.  Unlike my Samsung TL205, which took absolutely atrocious photos of the same scenes.The camera is very easy to use.  It's not a slim camera and it fits nice in the hands when using it, you can actually hold it without having to worry about your fingers smudging the screen.I'd absolutely recommend this camera.", "Date": "December 29, 2011"}, {"Title": "Great little camera", "Author": "Mar", "ReviewID": "R126GOLGT2JOIJ", "Overall": "5.0", "Content": "For the amazing price this is an amazing camera worth every penny and more. Easy to use, with great little features it is a great pocket quick shoot camera.", "Date": "April 18, 2012"}, {"Title": "Great Camera", "Author": "Sarcastic Nerd", "ReviewID": "R4WPRU13O6QF4", "Overall": "5.0", "Content": "This camera is great for the price. the screen is average, but the zoom is fantastic!Storage is a little low but that's what SD cards are for! would definitely recommend this camera!", "Date": "April 12, 2012"}, {"Title": "Great camera", "Author": "Mila A.", "ReviewID": "R38HMW9COX5Q13", "Overall": "5.0", "Content": "Great camera for the price!  We were looking for something very inexpensive since we have an almost professionalone already which is a little bit heavy especially with the lenses. And this one is just what we needed tocarry everywhere we go.", "Date": "February 5, 2012"}, {"Title": "LCD screen is not bright enough for outdoor use.", "Author": "Grampa Dan \"Always helpful, never late. :-)\"", "ReviewID": "R2U4OKKWM3LLH7", "Overall": "1.0", "Content": "I purchased this unit on special from Amazon.  The LCD screen is clear and visible indoors but I couldn't see anything clearly on the LCD screen when trying to use the camera outside, even on a cloudy day!I am very disappointed with this camera and wouldn't recommend it to others.Dan", "Date": "May 9, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "10 effective megapixels, 1/2.3-inch CCD image sensor; 3.3x optical zoom and 4x digital zoom\n2.5 in. TFT LCD display; Built-in flash; 640 x 480p video recording\nDIGIC III Image Processor; Scene Modes such as Super Vivid, Poster Effect and Blur Reduction\nSmart AUTO (19 scenes); Face Detection; Red-eye Correction\nUSB 2.0 Hi-Speed; SD card slot (card not included)\n10.0 megapixels and 3.3x optical zoom\nSmart Auto intelligently selects settings from 19 predefined shooting situations\nAA battery power enables you to easily power up on the go\nBright, clear 2.5-inch LCD\nScene modes such as Super Vivid, Poster Effect and Blur Reduction", "Name": "Canon Powershot A800 10 MP Digital Camera with 3.3x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51SYhlY8DdL._SY300_.jpg", "ProductID": "B004HW73T8"}}