{"Reviews": [{"Title": "...at least the stand works....", "Author": "P. Miller \"I'll take two!\"", "ReviewID": "R2CYVPIFS52KKW", "Overall": "1.0", "Content": "I came to review the 3003 model which I purchased 2 of.  I'm not sure if this is really different (3003i) or not, but wanted to outline my experience.I'd been interested in getting some home surveillance cameras.  Initially I tried an inexpensive wired Hawking camera.  An old model with poor image quality, but it did what it was supposed to do.  I read a lot of reviews, and decided I needed to spend more money to get a decent camera.  I went with the Lorex 3003 model.I tend to be pretty forgiving with products.  I guess most consumers are, which is why quality is often very low.  I'm not sure if a firmware upgrade would have helped me, but I never went that route with these cameras - too many issues.  The web interface was slow and intermittent.  I tried using it on IE, Chrome, and Firefox ...and could never even get the default password changed.  I'd hit the update button, and nothing would happen.  On both cameras most of the LEDs burned out within 18 months (very bright and I'm sure were run with > 30mA ...I plan to dissect and find out).  That certainly didn't help the 'night' vision.  Like many cams, they would frequently freeze and need to be unplugged.  To view them online, you need to use a 3rd party yoics service, which isn't very user friendly (awful iPhone interface), and of course if the cams freeze it's useless.Since then I tried a couple DLink cameras (DCS-920) and was very pleasantly surprised.  I got them on sale and wish they'd go on sale again.  Better picture, no freezing, and smoother interface.  I can use the mjpg stream with iCam software/app to view them from anywhere.  I also purchased some very cheap wired Rosewill cameras ...also better than the Lorex (not picture quality, but at least they keep running).  More recently I tried one of the budget pan/tilt Foscams ...and was again impressed.  I also tried out the Loftek outdoor IP cam.  It seemed very good ...but was incorrectly advertised as having 2-way audio so I returned it.IP camera reviews are a difficult thing to sift through.  Many cameras get bad marks because they often require a good deal of understanding to use ...and the average consumer will struggle with camera and router setup.  Bottom line, I've tried a decent number of cams and nothing has been so poorly engineered and underwhelming as the Lorex.  I wasted a lot of money on this product and regret it.Lorex, if you read this, please feel free to respond.  I'd love to get some feedback.  Admittedly I didn't try to contact you ...but given my past luck with customer 'service' I don't generally waste my time contacting a company after the (1yr) warranty expires.", "Date": "June 29, 2011"}, {"Title": "Peace of mind!", "Author": "Michael R. Lopez", "ReviewID": "R12CH9NQ9J5SNN", "Overall": "5.0", "Content": "I bought one of these cameras to remotely monitor my business and I liked the results so much I just ordered two more!  I didn't think it was too hard to install (on my PC - not sure about the Mac tho), I just followed the directions.  Word of caution though:  if the name of your wireless network has spaces or special characters (\"&\" e.g.) in it, you will need to change it to something else that's all one word for the camera to be recognized.  Luckily, I found this out through the support on their website.  Once that was taken care of, I couldn't believe the images I was seeing!  Then I got it hooked up through my iPhone and I was just floored.  To the naysayers, no, it's not thirty frames per second over the internet and no, you can't hear the sound over the internet, BUT I still get crystal clear images at about once a second on my iPhone (or any other computer) from anywhere I am.  And that's just fine by me - peace of mind I tell you!  I feel SO connected to my business when I'm not there now.  And the yoics website is perfect for me - they take care of all of the other stuff and I just get to view the video.  For $117 bucks this is a steal of a deal, plus the shipping was free and it arrived on my doorstep in 2 days.  One other thing - don't use the lorex iPhone app (I couldn't get it to work), use the yoics app.", "Date": "March 11, 2012"}, {"Title": "Good camera.", "Author": "Robby Robinson \"Globetrotter\"", "ReviewID": "RNJ2XX499RS04", "Overall": "5.0", "Content": "This replaced a yoics camera.  The night vision mode is not as good as expected, but daylight is good.  It was supposed to work with the yoics interface, but has its own viewer when using windows, but works well with our iPad application.", "Date": "June 16, 2013"}, {"Title": "Great camera !!", "Author": "rlim", "ReviewID": "R182MUZ761TV2A", "Overall": "4.0", "Content": "I purchased 4 Lorex LNE3003i which were installed in areas I can monitor my twin girls (2 nurseries, playroom, and kitchen).  They gave both my wife and I the sense of comfort being able to monitor them when we're at work or on vacation.  We were monitoring our nanny to ensure their feeding schedules were met as well as watching them play and sleep remotely wherever we are.  When on vacation, I enabled the surveillance software installed on my computer to capture videos of all the cameras; engaged through their motion sensors.  I would replay the video upon my return ... as required.  I also have the apps installed on my laptop as well as iPhone to view live feeds when we vacationed.The clarity of video images on the cameras are excellent.  I showed my relatives the live feed off my iPhone of the kids playing in the playroom and they were amazed by the quality of the video ...  we were on a cruise about to disembark Miami port. We would check up on the kids again whenever we arrive at the various portsThe only dislike I have of the cameras are the \"ultra bright\" light which I have disabled.  I ended up buying a separate infrared LED in the nurseries.I guess it is all dependent on the overall setup of the cameras and leveraging the smartphone apps and surveillance software.  I'm very satisfied with the cameras.", "Date": "February 2, 2012"}, {"Title": "Not good, but does work with Mac", "Author": "E. Grass", "ReviewID": "R3VNUZ28I03LPX", "Overall": "2.0", "Content": "I did not have too much trouble setting this up on a Mac.  First off, if you know how to use bonjour, you can set this up on a mac the same as (and easier than) a Windows computer.  The box and some online info and an insert in the box all say you can't do the initial set up on a mac, but that was not true in my experience.  (I did both ways, starting with the Mac).HOWEVER, I was unable to set this up to connect to an ad-hoc network with my MacBookAir.  In fact, the wireless system ONLY lets you click to connect to SSIDs that it sees.  Since for some reason my ad-hoc computer to computer network was not seen, I could not type in the SSID, etc.I WAS able to do this with the DLINK 923L.  That now has a Mac native and very easy to use connection program, which worked well.  And I was then able to get in to do advanced changes, type in my MacBookAir ad-hoc network and have the DLINK connect wirelessly to my MacBookAir directly.  (Long story why I wanted to do this, but it works well).When attached to my network, the Lorex did work ok, though I like the picture quality and refresh of the (cheaper) DLINK much better.", "Date": "December 9, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0042RSCGQ"}}