{"Reviews": [{"Title": "GREAT Camera (From an actual user's point of view)", "Author": "Mike Sweeney", "ReviewID": "R2GV5N58S6XN8", "Overall": "4.0", "Content": "I'm surprised this product hasn't been reviewed yet. Anyway, I got this camera on Black Friday from Radio Shack like the other person who wrote the review said they were going to do. I was a bit skeptical about this camera especially because even though it's 14.2 megapixels, the price makes it feel like it isn't a lovely camera.First I'll talk about the photos. The pictures are very good quality. 14.2 megapixels goes a long way when taking photos, and it definitely pays off here. One small thing I found kind of annoying though is that if you take the memory card out while the camera is on, the camera shuts off right after you take it out. Not a big deal, just wanted to point that out. Not much internal memory to be honest, you can take around 20 photos, or about a minute in a half of video if you don't have a memory card in this camera.One thing I absolutely LOVE is the video quality. 720p HD video is great, though the sound is quite loud if you ask me, at least compared to my Kodak Zi8 HD camera. (I wouldn't recommend taking this camera to a loud DJ party) Also, people have asked about zooming the video affecting the sound. I don't really think it makes any difference, though you have to change the default setting of the camera to make sure it records sound while taking video. The BIGGEST key feature though is being able to pause video while recording. That feature is simply AMAZING. It not only saves me time by not having to edit the video on my computer, but it stays as one file the whole way through without any problems in playback. That feature alone makes me love this camera for taking video. Also, since this is HD quality footage, expect BIG file sizes for videos. a 6 minute video that I took is almost 400 MB, so it may take awhile to upload these videos to youtube.Battery life isn't the best, but it's definitely better than a lot of cameras, in terms of taking video anyway. I was able to get about 50+ minutes with a single charge, shooting at least 9 different movie files. Can't really rate the battery life in terms of taking pictures though, since I haven't taken too many.The zoom is VERY good on this camera. 7x zoom for a camera this size, are you kidding me? Quality is great when zoomed in all the way as well. It can be noisy if you are zooming in while taking video, but a lot of cameras have that anyway.The ONLY real reason I'm giving this 4 stars instead of 5 is mainly because of the accessories they give you out of the box. While the camera strap is nice, the charger is another story. It's WAY too short!! It's only about maybe a foot in a half long, which is quite a disappointment if you ask me. It was definitely a challenge to charge this thing from an outlet without almost being forced to lay the camera on the ground, or even HANGING from my outlet since I have an outlet higher off the ground where I charge everything. What's worse is that it's a specific cable for the camera too, so it's not like you can use your own USB cable expecting this to charge, cause it's not compatible. (The cable kinda looks like an HDMI cable to plug into the camera except it's thinner) Unless you have a separate battery charger like sony does for its cybershot cameras, you'll have to rely on charging with very little cord room. At least I had no problems charging the camera when it was connected to my pc, and it's a simple plug and play camera too when you hook it up, as I was quickly able to access my files when I plugged it in.Overall though, I'm VERY happy with this camera. Besides the flaws in being able to charge this thing, I was VERY happy with the video quality, the photo quality, and especially the ability to zoom up to 7x. I'd look into seeing if Samsung makes a longer cable to charge this camera, cause I know people will be complaining about that. Either way, I'm definitely going to recommend this camera cause you are getting a LOT of bang for your buck with this device.", "Date": "December 2, 2010"}, {"Title": "Great Camera", "Author": "samsungfan", "ReviewID": "R2Q5IIG2NX2YKO", "Overall": "5.0", "Content": "This Camera takes excellent pictures! I had a samsung before and love it. This one is even better than the last samsung I owned. The pictures are always clear. The smart default works GREAT, I have just left it on this and the results have been great every time! The only picture I have taken that didn't turn out perfect was when there was a bright window behind the subject, but most people know that you shouldn't take pictures with a bright light behind their subject anyway. So the result of that picture was expected. I had a sony cypershot before this camera and the results were always different, every other picture I took was blurry and the people in the pictures had a waxy/shinny look to them. I was nervous buying another camera, but was pleasantly surprised with this camera. I plan on sticking with samsung cameras from now on, since I have had two good experiences now. I highly recommend this camera!", "Date": "January 25, 2011"}, {"Title": "Great Camera for the Price!!!", "Author": "L. Tyrrell", "ReviewID": "R2UFW9FO6VZ8IE", "Overall": "5.0", "Content": "This camera is great at zooming in.  And the pictures are crystal clear.  I uploaded some pictures I took with it at the Raiders/Jags game.  It did not disappoint.  I decided to go with this camera because I've never been disappointed with Samsung products.  I would definitely recommend this camera for every day use.  This was my first time using the camera.  I hadn't even read the manual yet, so it's very easy to use if you're familiar with digital cameras.", "Date": "December 12, 2010"}, {"Title": "what a gem!", "Author": "Dan S. Higgins", "ReviewID": "R2EL12IMSZCHOZ", "Overall": "5.0", "Content": "The Samsung pl200 is a compact little beauty with amazing zoom ability, great picture quality, is well constructed feeling very solid in my hand, takes great pictures and is very affordable, and best of all is compatible with both mac and pc.  I do wonder how Samsung can sell a camera without a case though as I am currently using the padded plastic in which the camera comes wrapped in its box.  This of course does not affect the camera's quality so I still give this gem five stars.", "Date": "January 30, 2011"}, {"Title": "Great Camera", "Author": "JDR", "ReviewID": "R1WGM7EL5DE28E", "Overall": "5.0", "Content": "This is an excellent camera at an excellent price.  The pictures are sharp at all distances of zoom.  It starts up very quickly and is ready for shot after shot with almost no delay. This is the best point and shoot camera I have ever owned.", "Date": "December 31, 2010"}, {"Title": "Not so great", "Author": "X", "ReviewID": "R30B9UWARAV1ZY", "Overall": "3.0", "Content": "I saw this camera on sale at a store, for eighty bucks.  I've been waiting for a camera to fall into my lap, so I bought it.First, I shoot film for my serious stuff, and once you have scanned a slide into your computer, and seen the results, NO digital camera is ever going to be great.  :)Software is excellent, white balance is great!  Video is EXCELLENT.  Colors are great.However, the lens is soft.  Text is mushy, lacks contrast.  My 4MP Toshiba blows it away in that regard.Overall, I like it for the price.  If, however, I wanted something sharper, I would look elsewhere.  Next time, I will take a text photo in the store.  Still, this is my goto party cam!", "Date": "November 30, 2011"}, {"Title": "Nice Point and Shoot Camera", "Author": "B. Kamau \"Rumbero909\"", "ReviewID": "R3OOF5YSO54I42", "Overall": "5.0", "Content": "I just purchased this camera this past Sunday and I'm enamored by the quality of images it is taking. The price was right $99+tax at my neighborhood Costco and it came witha 2GB memory card and a carrying case. Like most other reviews here, I strongly recommend this camera.", "Date": "March 8, 2011"}, {"Title": "WONDERFUL", "Author": "Andrew Rocha \"roachdizzawg64\"", "ReviewID": "RPJEZDNK7MNKD", "Overall": "5.0", "Content": "As far as the camera goes..the picture quality is amazing.I was at a concert cough ..(lady gaga)cough..and we were sittin pretty high up. zooming onto the stage for a decent pic? it was no problem with this camera..the pictures came out better than i thought.now video....thats a COMPLETELY DIFFERNT STORY...as i was recording a song..i was zooming in and out. not knowing that the sound was cutting out while zooming in and out..comeon now..you would think that would be a standard default setting.but nope..now all the videos are ruined from me zooming in and out..its hard to be mad at the camera because it makes up for it with video and picture quality..better could be better.", "Date": "March 1, 2011"}, {"Title": "HD video but visible vertical line on your video", "Author": "Fara", "ReviewID": "R1X55Y7WGJ4RDD", "Overall": "4.0", "Content": "I gererally like this camera, but I can see lines on my video. If you just want a camera, it does shoot nice pictures but not in low light.", "Date": "December 30, 2010"}, {"Title": "Good for the money...", "Author": "R. Phillips", "ReviewID": "R1N93NSHLI9B8O", "Overall": "4.0", "Content": "I bought this as a possible replacement / upgrade for my rather bulky Canon A630. It does seem to outperform my old Canon in almost every way, with the one exception of videos in very low light.Under most conditions, it performs better than I expected for the price. The focus generally seems a little sharper than I was getting from my Canon. Color is nice. Light metering seems good. No washed out looking photos or tendencies towards flash burn. Indoor flash pics look nice. The dual image stabilization mode is pretty cool. It allows getting reasonably clear indoor no-flash shots and night shots without a tripod my old Canon could never get. Although, there is some noise due to the higher ISO. The kids and pets mode seems to result in very sharp photos with little additional noise I can see.The only negatives are occasional lines caused by lighting sources in no flash pics or videos, videos require very good lighting (In near darkness where my Canon recorded noisy but viewable video, this camera records only blackness.), compact fluorescent lighting results in very yellow no flash photos or videos unless you set the white balance manually and you can only get in so close using the macro mode until the camera refuses to focus.For the price, I have no complaints at all. I may eventually pop for the similar Canon that has a little less zoom and costs more than twice as much. But, with all the megapixels they're packing onto small point-and-shoot image sensors these days, it may not perform any better than this in low light which is about the only improvement I'd hope for.The Wasabi Power Battery and Charger Kit is a nice accessory for this camera. It comes with 2 spare 1000mAh batteries and a charger that may be plugged into a wall outlet or a car's cigerette lighter. This allows charging a battery while using the camera or charging two batteries at once at the end of the day.http://www.amazon.com/Wasabi-Power-Battery-Charger-Samsung/dp/B004ANHC6S/ref=sr_1_1?ie=UTF8&s;=electronics&qid;=1302059836&sr;=8-1", "Date": "March 2, 2011"}, {"Title": "Good if you want to spend a 110 $ for every trip.", "Author": "Ammo", "ReviewID": "R1QSV58E7L0WK6", "Overall": "1.0", "Content": "I bought this camera on thanksgiving's day, I liked the MP and zoom, and to be honest I loved the high quality pics it does, instant shooting, and the vivid colors, oh it feels so real.any how I used it for the first time on a trip to miami and kee west unfortunately it stoped working in the middle of the second day and I swear we did not drop it or wet it.we felt so sad and that ubset us for a while and ruined our day because we had to drive to best buy and purchase a new one.any how because we loved the great pictures we convinced our selves this is just our bad luck and we bought a second one, the other one also lasted for half a trip but this time the LCD had huge dark spots on it and overall so dim that you  can not see what you are shooting, Ah also broke in Miami \" I guess samsung and Miami don not get along\".", "Date": "February 17, 2013"}, {"Title": "perfect for the price", "Author": "Ide", "ReviewID": "R2LGWSS69N58FI", "Overall": "5.0", "Content": "I was choosing between several cameras. After days of comparing all the specs and prices, I chose Samsung PL200.All in all, it's very user friendly, nice bright 3\" screen, compact and thin enough, and all the bells and whistles (5cm macro, adequate wide angle, wide focal range, 14MP, etc.) for the price. I didn't want to spend 20% or more to get similar or better camera, or buy something within the price range which almost always have the specs lacking. It was just at the right price for what I wanted: Simple point-and-shoot but enough features to not regret later if I ever need them.", "Date": "February 24, 2011"}, {"Title": "had it less than a year", "Author": "K. Lynch \"Wiseshopper\"", "ReviewID": "R3R8QY0W6YSLO0", "Overall": "5.0", "Content": "I have had this camera less than a  year and have used it very little and it is not working now. I usually trust and buy Samsung products--2 TVs, washer/dryer, fridge, but this makes me very unhappy. This camera took really good pictures but won't do me much good if it isn't working. Everytime I turn on the power the screen says the \"the zoom did not operate normally. Insert the battery again and turn the camera on.  If the cameras does not operate normally, do not put excessive pressure on it and contact the service center.\"  I did all of the above to no avail. I am sending it in to service center because it is just about 2 weeks before warranty runs out. Hopefully they won't give me any problems. I will update the review after I get the camera back. If they give me any problems I will be sure to let everyone know. I did give it 2 stars because the quality of the pictures is very good--it would be an ideal camera if it worked!Update since having it fixed. Customer service was great. Sent the camera in (they sent a shipping label so I did not have to pay shipping) and they had it fixed in about a week. Camera works fine now so I have upgraded the stars to a full 5 based on what I would expect for a camera of this type, size and price. Samsung has never disappointed.", "Date": "December 28, 2011"}, {"Title": "Samsung PL200", "Author": "Darrell Templeton", "ReviewID": "R2RQIHCUW90G9C", "Overall": "4.0", "Content": "This is an excellent camera at an excellent price. The pictures are sharp at all distances of zoom. It starts up very quickly and is ready for shot after shot with almost no delay. This is the best point and shoot camera I have ever owned. Extremely easy to use and very responsive. Another excellant product from Samsung Corp.", "Date": "April 7, 2011"}, {"Title": "Good Camera and Easy to Use", "Author": "David", "ReviewID": "RLSK7E5XEOUN8", "Overall": "4.0", "Content": "The camera arrived on time and was ready to go right out of the box. I have had this camera for 2 months and it has been one of the easiest cameras to use. I like all of the features and it takes great pictures. There really is not anything that I do not dislike about this camera it has a good battery life, good zoom, and a ton of setting to get the ideal picture. I would recomend this product to anyone who is looking for a good camera.", "Date": "January 23, 2013"}, {"Title": "Very pleased with this camera :)", "Author": "jocelyn_92", "ReviewID": "R3NRPPND597CI5", "Overall": "5.0", "Content": "My old point-and-shoot pooped out on me quite awhile ago, so I've been without a camera for at least several months now. I finally decided it was time to buy a new camera, and I read several reviews before finally settling on this one.I love this camera.It's very compact, user-friendly, and has lots of great features and settings. I haven't really had time to mess with all of them yet, but it's pretty intuitive and I have been VERY satisfied so far with the quality of the photos taken with this camera so far. I also love that this camera uses a rechargeable battery and not AA's. As someone who is prone to losing things, I thought it would be much easier to just keep charging this battery than to try to keep track of AA's all the time.The only thing that I don't really like about this camera (so far, anyway) is that it's a little slow sometimes in capturing photos. Like if you want to capture it right in the moment, it takes a second or two for it to actually snap the photo. However, this might depend on the setting that you have it on... because I changed the setting later and didn't have much of a problem with it.Overall, I would definitely recommend this camera to anyone who's looking for a really good point and shoot for a decent price. :)", "Date": "October 23, 2011"}, {"Title": "Better than expected", "Author": "Amanda Alwyn", "ReviewID": "RRQ9HL4ET9TNX", "Overall": "5.0", "Content": "I ordered this camera as a replacement for one I lost. I was very impressed by the little extras in the box (a case and a card, which the one I purchased in store didn't come with), at a very reasonable price.", "Date": "April 4, 2011"}, {"Title": "Love it, but with one problem", "Author": "JG2323", "ReviewID": "R2SWROGSTZBYNW", "Overall": "4.0", "Content": "Just got this little jewel, and am very happy with the photos I've taken.  I've had a number of digital cameras, and they have all been too simple or too complicated.  This is a very easy camera to use, and that was what I was looking for.My only problem is that so far I have been unable to upload videos I've taken with this camera.  Never had that problem with any of my other cameras, I'm hoping that it is some type of simple compatibility problem.  If anyone has had this problem and reads this, please leave me a comment if you found a solution.", "Date": "March 4, 2011"}, {"Title": "Disappointed", "Author": "DEW", "ReviewID": "R30E55EKV7W6EW", "Overall": "2.0", "Content": "My old Kodak DX4900 went out, so in Feb 2011,I thought I would try this Samsung PL200. I rarely am able to get a decent in focus picture with this camera, even with the \"smart\" button. The only decent in focus picture is in noontime bright outdoor sunlight. My DX4900 decided to start working again. The pictures are always sharply focused on it, whether indoors or out. I compared the pictures: the Kodak always has true colors in its photos, but taking the same picture the Samsung has a yellowish greenish hue, and indoor pictures have reddish purpleish faces.I am disappointed. I thought Samsung put out better stuff than that.", "Date": "June 8, 2011"}, {"Title": "Great camera", "Author": "Javier", "ReviewID": "R33VHLJ7AIUO3Q", "Overall": "5.0", "Content": "Ive had this camera nearly two years. Late in rating it. It's been to my wedding, Moorea, and all over wine country in Ca. If its still made grab it!", "Date": "January 24, 2014"}, {"Title": "Mild sign of wear and a bit of a Jam", "Author": "travis cover", "ReviewID": "R3CQC6BAQCIQCN", "Overall": "3.0", "Content": "Couple of scuffs on the front around the lens. Major issue is that the Zoom mechanism sticks. I'm sure i'll be able to fix this issue, but it still wasn't mentioned during the buying process. Other than those issues I don't think i can really complain about much else. It will do its job, and if i was to expect a perfect product that's brand new i would have ordered brand new.", "Date": "August 31, 2013"}, {"Title": "Great Camera", "Author": "fell", "ReviewID": "R3AI8BOI1OERQO", "Overall": "5.0", "Content": "Easy to use, great pictures and good price. There are so many more features than my old camera and it charges quickly.", "Date": "January 6, 2013"}, {"Title": "Great Camera", "Author": "Amazon Customer", "ReviewID": "R38FPKVK1PCO72", "Overall": "4.0", "Content": "I purchased this camera beause or old camera broke...The price was right and Samsung is a good name...I read the reviews and agree that this camera takes great pictures.  The only problem I have is that because I have had surgery on my hands and have little feeling in my fingers, this camera is very slim and difficult to hold onto.  I  put the strap around my wrist when I use it because several times it has almost fallen,Other than that, I would definitely recommend this camera to a friend.", "Date": "January 3, 2013"}, {"Title": "Great camera", "Author": "chaskins", "ReviewID": "RSXYEBC4G26KT", "Overall": "5.0", "Content": "I bought this camera to take pictures of the Grand Canyon. The pictures are awesome. The camera takes great pictures. I like this camera a lot. Good buy.", "Date": "December 20, 2012"}, {"Title": "great devise", "Author": "theresa l shoemaker", "ReviewID": "R25PSUQ2F6QJ4I", "Overall": "5.0", "Content": "this little camera takes great pictures and it is so small it is easy to carry. I am so happy I got this after looking for a few months.", "Date": "February 3, 2012"}, {"Title": "okay camera", "Author": "Naturelle_beauty1", "ReviewID": "RT5NXV098G3K5", "Overall": "3.0", "Content": "I love the many options and if you study and learn how to use this camera you get some nice pic from it HOWEVER the movie make has a gray line across the screen and I can do without that. Despite of that I am still giving this 3 stars b/c i use it mainly for pic but for the price i would have like the movie to work just as well ..", "Date": "November 9, 2011"}, {"Title": "I L-O-V-E this camera!", "Author": "A. Girl", "ReviewID": "R1MJZV5F6JA6P1", "Overall": "5.0", "Content": "I bought my original Samsung PL200 camera specifically for the 7x zoom.  Which is really good for a compact digital camera.  I have a Samsung Plasma TV that is great so I figured their camera would be great too..and the price was under $110 with tax.  I was not disappointed.  The camera takes great pictures, especially in daylight.  Indoor pictures only come out well if the flash works - sometimes you have to set it to work manually.  The zoom works really well, too.  Additionally it takes 720P (30 fps)  movies...fantastic!  It takes full-size SDHC cards of up to 8GB...that is a lot of pictures and movies.  The camera's little extras are a plus (and a surprise b/c I don't usually read manuals).  For example, you can zoom & crop the images on  your camera and it will save the zoomed image as a new picture, you can save stills from movies as pictures too, and you can set the camera to take pictures automatically when it detects someone smiling!  I love this camera so much that when my original one broke...I dropped it on it's open lens on a rocky surface (d'oh!)...I bought a new one right away.  I was tempted to buy a newer model Samsung camera, until I discovered (thank you Amazon reviewer) that it used mini-SD cards.  I have too many good full size SD cards to switch media.  The camera I purchased cost me slightly more than the original one, but it included a nice Samsung carrying case and 2GB SD card.  It's a great camera, just don't drop it on it's lens on a rocky surface.", "Date": "August 13, 2011"}, {"Title": "An Excellent Digital Camera at an amazing price", "Author": "Ronald in Hawaii", "ReviewID": "R2SHPVTGOKZ20C", "Overall": "5.0", "Content": "Of course, in the ever improving world of consumer electronics, to say that this is the best digital camera that I have ever owned and that I have owned maybe a dozen doesn't say much because each generation of cameras SHOULD be getting better and better.And I approached this camera with the expectation that it would be better than my 10 megapixel camera and all the ones before.But what was amazing was HOW MUCH BETTER.  I am perfectly satisfied in all respects: price, ease of use, ease of learning; zoom, depth of field, downloading, and of course MOST IMPORTANT: picture quality.I have exactly zero reservations about this camera. It is simply wonderful.", "Date": "July 16, 2011"}, {"Title": "Horrible picture quality, STAY AWAY!", "Author": "missroxxi", "ReviewID": "R8MGZUILYLDRM", "Overall": "1.0", "Content": "I had high hopes for this camera, I really did, it was small had good reviews and a decent price.  However I was very disappointed when I actually started taking pictures.  The pictures came out blurry about 80% of the time and forget night time pictures those were a complete waste.  It's slow to take pictures and when you think you've taken a picture, trust me you haven't.  Stay away from this camera don't waste your time.", "Date": "March 28, 2011"}, {"Title": "Good camera", "Author": "Linda MC", "ReviewID": "R1FIZWNELP2OBH", "Overall": "4.0", "Content": "The problem I have with this is it is not usable with Macintosh computer. My sister bought this for me for my birthday and I put in the Cd and it spit it out time and time again. Then I called Samsung support and now they tell me it doesn't work with Macintosh. Why don't you tell people this to begin with? This is very aggravating to have to go through the trouble of having to send this back through a 2nd party person because my sister bought it for me and she is 80 years old. I am very mad over this. You need to post this on every single camera you have that it does not work with Macintosh!!!!!", "Date": "September 3, 2011"}, {"Title": "Good Camera...but buy the TL210 instead.", "Author": "J. Luff \"campnut\"", "ReviewID": "R381ER7ZH6W806", "Overall": "4.0", "Content": "Look..I own this camera, and though it is good.. who the helll needs a 14.2 meg camera.  It uses too much memory on your card, you need to reduce the size of pics to upload, and in all honestly no one needs over a 10MEG unless you are a professional photographer developing 20x20 pics. First thing I did was turn it down to 10-12 Megapixels. I suggest buying the Samsung TL210 instead.  It has a wider angle lens so you get more in the pic, and it's maxed at 12.2 megapixels.  That's what I would do if I were to buy again.  I have seen it at only $10 more than this one on sale. Otherwise, I will say that the PL200 is pretty good. You won't be dissapointed, except for the overkill on megapixels. Again, I would personally have the wide lens instead.", "Date": "April 1, 2011"}, {"Title": "Disappointed with digital zoom", "Author": "Go-Hawkeyes", "ReviewID": "R1N8TUU0ZKAJKY", "Overall": "4.0", "Content": "March 9, 2011 - Final update:  Upgraded to four stars after chatting with Samsung support.  The camera HAS 7x optical, verified by more optical-only pictures taken with Canon A710 and the Samsung.  It does NOT have Intelli zoom, whatever that is.  (Intelli zoom is available in the successor - PL210.)  Total zoom, optical + digital is 35x.  That explains the reduction in quality at maximum digital zoom.  Canon 6x zoom versus Samsung 7x zoom shows I was incorrect - the Samsung has 1x more optical zoom, AND the pictures are more detailed.  Also, I believe the colors are more accurate with the Samsung.Sorry to readers of my first post, which reflected my frustration, although that frustration would not have occurred if the camera and its manual agreed.  Note there will NOT be any updates to the PL200 - none will have Intelli zoom.If you want an inexpensive, pocket-size camera that takes great pictures so long as digital zoom is not used, THIS IS A VERY GOOD CAMERA.  The successor, PL210, has 10x optical and its list price per Samsung is only $20 more.  Since it is a new model, it may be difficult to find a PL210 retail priced only that much more than the PL200.March 9, 2011 - Downgraded overall to two stars because I went on the Samsung website and was directed to put in a repair request.  That requires me to ship the camera back at my expense whereas I just want to confirm How to activate Intelli Zoom.I suspect my camera is an early edition of the model and this is a problem that has been corrected on later cameras.  Nonetheless, I will decide whether to keep it as it's handy for carry along, or to return it to the Seller (TigerDirect) for a refund.  When I explain to them the product is not as advertised, there should not be an issue.=============================Original post followsEarly report - I bought this camera for my lady primarily based on the reviews followed by the price.I will be exploring the camera's options and update this when I have more knowledge.Posting today because of possible disagreement with existing reviews.Overall, I believe this is a good to very good camera for the price.  However, the design engineers did not keep the technical writers up-to-date.  I.E., the manual differs from the camera in places.  E.G., the manual shows the zoom control on the back of the camera when it is actually on top.I am not posting this just to complain - If someone has used there PL200 long enough to understand its zoom characteristics, please post a reply for the benefit of all consumers.I was seeking to replace a Canon Powershot A710 which has served admirably for several years.In order I wanted:  More compact, equal or better zoom, longer battery life, and of course picture quality.Canon specs = 7.1 megapixels, 6x optical, 4x digital, AA batteries.Samsung stated specs = 14 megapixels, 7x optical, no stated digital, proprietary battery.Just becoming familiar with the Samsung and was impressed, so far.Today spotted a large, colorful woodpecker across the street.Took pix with both cameras, full optical zoom and optical plus digital zoom.Full optical pictures very similar, but using optical plus digital zoom, the Canon is significantly better - with half the pixels!I didn't notice in the other reviews, but the Samsung has three zoom factors:Optical, Intelli zoom, and Digital.  It's unclear to me what Intellizoom is, but I used optical and optical + digital.What is also confusing is the Canon specs say its total zoom is 24x, whereas the Samsung says its total zoom is 15x.BUT, the Samsung enlarges the view more than the Canon - with the before-stated quality reduction.Elaborating on the Samsung, it is sold as having 7x optical zoom.  However, when you download the full user manual, not provided with the camera, you find the optical zoom is 5x and intellizoom adds 2x.You can find the manual's download link near the bottom of the page at:  [...]The manual further states that adding digital zoom takes you to a maximum of 15x.Using optical zoom only, the Canon picture is slightly closer, so the optical part is likely true.I believe the Canon information is accurate, which implies the Samsung manual is incorrect - the total optical plus digital zoom has be more than 24x.Note:  The manual advises \"The Intelli zoom is available only in Smart Auto, Program, and Scene (some) modes.It further states it is only available when you set a 4:3 resolution ratio.I CANNOT FIND ANY WAY TO TURN ON INTELLI ZOOM OR SET A 4:3 RESOLUTION RATIO.Possible I have an early edition of the camera, but this is clearly frustrating for me!The reduction in quality is obvious on LCD - much more noticeable than with the Canon.My recommendation:  If compact size and 5x optical are what you need with a low price, this MAY be a good choice.However, if you can wait a bit, the same model may have updates added.", "Date": "March 8, 2011"}, {"Title": "Not as described.", "Author": "Cathe", "ReviewID": "R398QY5G1H567S", "Overall": "2.0", "Content": "Here is a copy of the e-mail that you sent to Gadgets Galore UL:I don't believe this is a new item.I was replacing my camera that was the model as this one, which got damaged.  My damaged one looks newer than this one.There are no stickers on this one and are still on my previous one.On this one, the screen has a huge scratch on it.It has corrupted several of the pictures when I was viewing them.", "Date": "July 5, 2012"}, {"Title": "Currently testing this camera", "Author": "Simit Y. Desai", "ReviewID": "R29VPPGI1I64CX", "Overall": "3.0", "Content": "I just bought this camera from Bestbuy as they are on sale 109$ as of 8/13 so make sure you check it there 1st. I like the camera so far & bought this to replace my wife's Olympus as the LCD screen had damaged as was getting annoyed by not being able to see the pic I had taken. Anyway, this camera right away felt heavier than any other PAS (point and shoot) camera I have ever gotten my hands on. Samsung chargers in general are little awkward incase you forget yours on a trip or something. This usually is only issue for those who like me loose things :) but I still gave this camera a shot. The pics are sorta kinda OK, nothing bad but nothing that awesome or great either based on the review I had read or images seen on some websites. I do have 13 days to return it & because weight is my major issue, I am still shopping but if wont find anything then will keep the Samsung as I had said, its not bad either. One more thing, the buttons are kinda little too hard to press @ times & being a guy & no nails its hard for guys with thick fingers. This is not a bad feature but just wanted to share. :) Lets hope this camera really delivers as I have already taken 20-30 pics but still havent had that WOW pics with intese quality & color & clarity. Hope this helps :) ENJOY folks !", "Date": "August 14, 2011"}, {"Title": "good camera for the price", "Author": "Thanya Ozuna", "ReviewID": "R3CZY2A65KM6XR", "Overall": "4.0", "Content": "I love Samsung products, this is a very good camera for the price.  If you're professional or looking for a lot of features and tecnique just keep looking.", "Date": "February 27, 2011"}, {"Title": "Not a fan", "Author": "Moken", "ReviewID": "ROVVQHRS9ZA5G", "Overall": "2.0", "Content": "Been using this camera since Christmas eve and we're already looking for something else.  The picture quality is crap.  We love the size and ease of use, zoom is great, but it's all moot if it doesn't take good pictures.  It's terrible in low light, the flash is underpowered, all pictures come out red and blurry.  Pictures taken in sunlight turn out ok, but so do ones I take with our cell phones.  It has a real annoying \"feature\" that my wife just cannot overcome.  It makes the shutter sound, but doesn't actually take the picture until after the sound, so my wife thinks it's done and moves and all her pictures come out blurry, even in sunlight.  It's Macro feature is a joke, it cannot focus on close up items. We needed to take close ups of flowers for a science fair project, so we set it to Macro and it just sits there focusing and refocusing then decides a total blurry image is what you want to take a picture of.  Maybe we got a defective one?  We sure are not satisfied as others who have reviewed it.", "Date": "March 20, 2011"}, {"Title": "Amazing!", "Author": "A. Schneider \"Adam\"", "ReviewID": "R21IFU51OQ8675", "Overall": "5.0", "Content": "Usually, I don't write reviews until I buy the item, that's the whole point right? Well I'm getting impatient so I'm going to do it anyway. Samsung has been making a good name for themselves for years now, any TV you buy from Samsung is guaranteed to be amazing, there other products for the most part are impressive. I'm planing on buying a Samsung PL200 tomorrow at RadioShack because they are offering a $20 gift card to anyone who buys there products in store. This camera is awesome because it has 14 MP and 7x optical zoom. This is what I wanted in a camera and it's only $120. To me, this is unbeatable, I have been putting off getting a camera, and I wasn't going to get one this year, but the deal is too good to pass up. I have to have it. Take a look on Amazon here and look at how much this camera usually costs, it's $180 normally but since it's Black Friday, it's been cut on Amazon and everywhere else. This is a good buy. I recommend it to anyone who isn't sure what to get, this camera will do what you want it too, trust me.", "Date": "November 25, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Shake, rattle or stroll - Even the tiniest shake can ruin your shot. Dual Image Stabilization solves that. Samsung has combined the revolutionary technology of their ultimate Optical Image Stabilization (OIS) mechanism with the advanced algorithms of Digital Image Stabilization (DIS). Giving you sharp images no matter the condition. Whether it's low light, zooming or just a case of plain old shaky hands, your photos come out sharp and clear. So let your Samsung camera shake things up. In a good\nWhen it comes to brightness, it's brilliant - When we engineered the Samsung PL200 to be bright, we meant it in both senses of the word. It's intelligent and luminous, both. It has a 3.0' LCD for improved contrast and color reproduction, which allows you to enjoy a wider and clearer image. And its Intelligent LCD brightness automatically detects environmental illumination and adjusts the LCD brightness for optimal image viewing. It does the thinking for you, which makes the PL200 a smart choic\nRecord movies in the palm of your hand - The PL200 is like having a compact HD video camera that also takes professional-grade photos. It records HD video in 1280x720p resolution at 30 frames per second. Its H.264 format also allows you to record twice as much as an MP4 and four times more than an MJPEG the format used in many other digital cameras' and delivers much higher video and sound quality. Specifications\nImage Sensor - 1/2.3 (Approx. 7.76mm) CCD\nEffective Pixel - Approx. 14.2 Megapixel", "Name": "Samsung PL200 - Digital camera - compact - 14.2 Mpix - optical zoom: 7 x - supported memory: SD, SDHC - black", "ImgURL": "http://ecx.images-amazon.com/images/I/51Yv-F4bA4L._SY300_.jpg", "ProductID": "B0041Q1XE6"}}