{"Reviews": [{"Title": "Fabulous Baby Monitor!", "Author": "Mom Mart", "ReviewID": "R17S5OGMDCDH6M", "Overall": "5.0", "Content": "Recently I was given the opportunity to review the MobiCam Digital DL Wireless Audio/Video Monitoring System from Mobi Technologies for my blog (Mom Mart) and I have to say that this monitor is fabulous! We are constantly on the move visiting family and friends whenever possible and need baby gear that can keep up with us and our highly mobile family. The MobiCam Digital DL can keep up with our family and then some. The bells and whistles offered with this device are outstanding.The screen is not too little and not too big; it's just the right size without compromising on portability and the quality of video display.There is no static or signal interruption and thanks to the new DigiLock Wireless with FHSS technology, I don't worry about neighbors or truck drivers picking up my monitor's signal and listening in on or watching my family.There are multiple ways to monitor using this system. There is the picture/audio mode, the audio only mode, and the VOX (voice activation) mode. My favorite mode is the VOX mode because it saves battery power.There is an extra wide angle on the camera! I can see what is going on in the room, not just a small section of the bed where my child may or may not be sleeping.There is a sound bar located at the top of the display that allows me to see the noise level, so I don't have to listen to screaming or crying but I can still see what is going on. This is fabulous for time-outs and temper tantrums.It works day or night. I love that I do not have to leave a light on in the nursery in order to see what is going on at night. The infrared night vision is crisp and clear and allows me to see my baby no matter what time it is. The infrared light is not bright at all, so it doesn't wake my baby once it is triggered to come on.There is room to grow with this video/audio monitor. Although it only comes with one camera, the MobiCam is built to work with up to four cameras. After reading the directions and re-linking my original camera I think adding additional cameras would be quite easy to do. There is even an automatic scanning option you can use to alternate between cameras.This monitoring system is incredibly easy to use. There is no installation required, it is ready to use as soon as you take it out of the box.I love that the camera and monitor both operate on AC or AA Alkaline Batteries (not included). I have options! If my batteries die and I don't have any replacements I can simply plug in the camera and/or monitor without missing a beat.There is a USB output for you to connect to your computer for Internet viewing via another PC or cell phone with the optional MobiCam Anywhere software. This monitoring system has the capability to work with video chat outlets such as Skype®, Messenger®, GoogleTalk®, and Yahoo®. I love this feature, especially since I have a tendency to take my boys on mini-vacations to visit family, leaving my husband at home to fend for himself. I have not had the opportunity yet to test out this fabulous feature, but I am looking forward to giving it a go the next trip I take!I was not paid to write this review, I just LOVE this product. I was supplied with a MobiCam Digital DL Monitoring System for the purposes of a blog review. I was such a fan of this product that I wanted to share my experiences on Amazon as well, since this is where I do a majority of my online shopping.", "Date": "August 10, 2011"}, {"Title": "Honestly, this monitor just sucks.", "Author": "MamaK", "ReviewID": "R2ERR0ZFVBS7XB", "Overall": "1.0", "Content": "We had a great video monitor for our son who is now 2.  We recently had another baby so wanted to buy a video monitor that would let us add additional cameras and monitor them both at once.The features we liked:  the VOX option of only coming on when the child makes a noise and the picture was good.The issues:1.  repeatedly, one of the cameras would just turn off randomly and in the middle of the night, I'd wake up to hearing screaming from across the house.  Or I'd realize ahead of time that one of the cameras had turned off but wouldn't want to risk waking a sleeping baby to go into the room and link the camera back again or whatever they call it.  Then, even if it was synched, sometimes it would just stop switching between the two monitors, so it would be telling you that it was on for both, but only one child was really being monitored.2.  a loud buzzing noise.  Even when on vox with volume turned pretty low, there was a buzzing/feedback-y noise that came from the speaker.  I am a light sleeper and this drove me nuts.  I'd have to put the monitor on the other side of the room to sleep.  My husband is a heavy sleeper and even he was noticing this problem, which sort of defeats the purpose of having a video monitor.3.  it's confusing to work.  I am by no means a technology expert, but I can normally work every gadget we get after my husband gives me the run-down.  I could not figure out this darn thing and things that you would think would be easy to do (like switch from viewing one child to viewing the other) are actually lengthy and complicated.4.  wall-mount is inflexible.  once mounted, it cannot really be adjusted left or right and all around.  you can only mount it inline with the child and just make it go up and down a bit.basically, just a cheap monitor.  we had no problem with that--our last monitor was a cheapee, as well.  but the thing's gotta work!  come on, mobicam!", "Date": "November 5, 2011"}, {"Title": "Never worked!", "Author": "Dhuliz", "ReviewID": "R3KFTVA5MV3AZO", "Overall": "1.0", "Content": "I purchased this video monitor for a friend- we opened it up at the party, and it never worked!  I was so embarrassed. The monitor did not recognize the video feed at all.  If you're spending this much on a video monitor, I would recommend any of the Summer monitors.  They may be pricier, but at least they work.", "Date": "April 1, 2012"}, {"Title": "Pros and Cons", "Author": "Mike", "ReviewID": "R1K0R49AQSTE0Q", "Overall": "3.0", "Content": "Pro:- In our home, the image is sharp and the sound is crystal clear.  I assume this is because it's digital, while our old video monitor was analog- Small and portable, and can be powered by batteriesCon:- The screen is smaller than I expected- The plugs are big, such that when they are plugged in, a baby-proof outlet cover doesn't fit over it (our old video camera fit easily)- The camera does not tilt very far in the up/down direction, and there is NO side to side tilting.  (While the side to side titling isn't important if the video camera is placed on a counter top or crib-edge, it is a huge factor when mounting the monitor on a wall.  Our old video camera titled up/down, and left/right almost 90 degrees in each direction.  I had it mounted in an inconspicuous place.  Now with this video camera, it had to be mounted such that it lined up with the crib in its direct line of site, and it is an obvious eye-sore.- Complicated menu systemNot yet sure if we will keep it.  I am waiting for the extra monitors to arrive so that I can see if any interference develops.", "Date": "July 8, 2011"}, {"Title": "Cheap quality and terrible mobility in camera", "Author": "workingmom", "ReviewID": "R300XH3QNOQS82", "Overall": "1.0", "Content": "I have an older model Mobi monitor and camera for my toddler and had a new baby.  I purchased this one for our new baby and it was the cheapest quality I have seen in a baby monitor.  Also, per some other reviews, the camera does not allow enough mobility to even position it to see the baby.  We returned this one right after we tested it out.  I am pretty surprised at the poor quality as our other Mobi monitor has been wonderful.", "Date": "January 17, 2013"}, {"Title": "It works", "Author": "Shelly C \"Shelly C\"", "ReviewID": "R31JKZ7QEKYH4P", "Overall": "3.0", "Content": "I'm giving this monitor 3 stars becuase it works, but I can't do any better than that becuase I don't really like it. The camera movement is extremely limited - we've moved it all over the room and cannot get it in good position. For now we have it sitting on the edge of the crib and we can see about half of the bed. We can't put it any higher becuase the camera won't angle down, and we can't put it any farther away or we won't be able to see him (the screen is tiny!). Other (nicer) moniters have two way communication, cameras that you can move with buttons on the reciever and large clear screens. This monitor costs less than monitors with all of those features, but I for one wish I had spent the extra money.  Also hate the little melody it plays everytime it comes on, I can see the screen and/or hear the baby, why do I need that? The only thing I like about the camera is the voice activation. I don't understand how other reviewers can say that they 'love' this monitor, there is absolutely nothing special about it.", "Date": "November 23, 2012"}, {"Title": "Great Video Monitor", "Author": "Shannon", "ReviewID": "R33SWV25Q4G5NJ", "Overall": "4.0", "Content": "When my first child was born I was a huge worry wort and used my monitor all the time. The MobiCam Digital DL Video Monitoring System is a wireless video monitor with 20 ft night vision. I was very excited to try out the MobiCam Digital DL Video Monitoring System as the one thing I longed for most about my old audio only monitor was video. There has been many moments where I could have let my son or daughter play nicely in their bed before going in to check on them. It seems the minute I open the door to peak on them they are crying for me and ready to get down to go play, where if I had a video monitor I could come in when they need me. Did I mention its also a great way to keep an eye on my 2 year old who loves to play in his room.The MobiCam Digital DL Video Monitoring System has a 2.4 inch high-resolution LCD screen making the images clear and not grainy. You can easily hook the video monitor up to the TV or DVR for viewing/recording with the DL's A/V output. Since MobiCam is wireless it can easily moved from room to room without having to find an outlet to plug it in. I personally loved how easy the MobiCam Digital DL Video Monitoring System was to set up, all I need to do was add battery's it was ready to go. You do not have to worry about seeing at night as the MobiCam has automatic night vision allowing you to see 20 feet into total darkness. The MobiCam has voice-activated operation or audio-only mode to save battery life. You can easily add up to 3 more cameras to expand to view multiple areas or use the MobiCam as a wireless webcam, compatible with Skype, Windows Messenger & Google making this more then just a baby video monitor.Since using the MobiCam Digital DL Video Monitoring System I've fallen in love and could never go back to an audio only monitor. I was able to set it up and turn it on less then a few minutes (the part that took the longest was putting in the battery's). One down fall I noticed right away was it takes 9 AA battery's, and I hate buying battery's as that can be pricey. I save on battery's by having it plugged in 25% of the time and turning the MobiCam off as soon as I am done with it. The only other downfall I noticed was the camera only goes up and down, where I can see that limiting the view depending on where you place your camera. Overall I think the MobiCam Digital DL Video Monitoring System is great video monitor and I would definitely recommend it to family and friends!", "Date": "November 7, 2011"}, {"Title": "Almost great", "Author": "Kristi Smith", "ReviewID": "R2I56SD7IG5XV2", "Overall": "3.0", "Content": "The main issue I have with this product is the limited ability of the camera... the camera angle is very very very limiting, to the point where to view my child in her crib the correct way-- as in able to see her unobstructed-- we have to hang the camera from the ceiling... absolutely ridiculous.  We were spoiled with a previous camera/monitor combo where the camera head could be angled from any direction and you could put it virtually anywhere close to the crib, and have a great view... this camera is far from that.  And has been very frustrating to say the least.  It works, it functions, is easy to use outside... BUT  it sure wold be nice to view my daughter easily without having to hang the camera from the ceiling... even on the wall  would be nice.  Even when camera is on the wall, you have to have the crib so close to be able to see everything... which causes the problem of her playing with the chord... obviously a bad situation, so it's not an option.  Just wanted you to be aware of how limiting the camera is for viewing.", "Date": "December 25, 2011"}, {"Title": "Great Monitor", "Author": "Ida McElwain", "ReviewID": "R3RUH9DNEPM7BR", "Overall": "4.0", "Content": "We purchased this monitor for the birth of my second child. After just \"getting by\" with a cheapy monitor for my first born, I wanted something that gave me a little more piece of mind. Especially if I was playing with my oldest while the baby was sleeping.So far this monitor has been great. Clear picture, and crisp sound.Anyone who purchases this monitor should note that the default setting is the power save mode, which means when no noise is detected, the monitor video shuts off until a sound is heard, you have to go in the menu and turn that off if you want a constant picture. Once I figured that out, I was good, b/c I was scared it was faulty out of the box!The only other thing really worth mentioning is the power cord in the camera part (the piece that watches the baby) where it inserts to the device must not be a tight fit, b/c it constantly falls out. Using Batteries would help this, but it is annoying enough to mention. It is extremely sensitive to how you have it placed.In all it's a great monitor for the money.", "Date": "November 17, 2011"}, {"Title": "bad battery life", "Author": "baby watch", "ReviewID": "R5I77R4IZ4YKT", "Overall": "2.0", "Content": "battery life sucks and the monitor turn off if you don't play with it. To turn it back on you need to turn it completely off and back on", "Date": "October 29, 2011"}, {"Title": "USB cable not included, mine not working", "Author": "N. St-pierre", "ReviewID": "R5OP46IW5YUBK", "Overall": "1.0", "Content": "Box and item description reads:Connect the Digital DL to your PC via USB (cable included)Manual reads:Use a standard Mini USB cable available at retail stores (not included) to connect your monitor to PC.Even when connected to a PC, windows report a USB error and the remote device is dead.Futhermore, the USB port and power adapter port on the side of the monitor are spaced so closely together that you can't plug USB (standard mini USB cable) and power at the same time without bending one of the connector out of the way.", "Date": "January 17, 2014"}, {"Title": "Great buy!!", "Author": "Sarah G.", "ReviewID": "R2JIMA15LLQZ4C", "Overall": "4.0", "Content": "It had more features than I had realized at the time of purchase. Exceeded my expectations for a well priced video monitor.", "Date": "January 14, 2014"}, {"Title": "not a good monitor", "Author": "cym", "ReviewID": "R1MWZ9NTFX87JS", "Overall": "1.0", "Content": "This monitor is terrible.  I have a previous mobi monitor for my daughter who is now almost 3 years.  (We still use it since she's in a bed and we like to keep an eye on her-that one is great and they have stopped making that version).  This Mobican DL monitor I'm using for my newborn.  It has frozen twice, which is 2 times too many.  When it freezes the screen shows her image (sleeping in the crib) but I can hear her screaming hysterically in the house.  This monitor is worthless.  It is not helpful at all if it freezes.  Besides freezing it makes very loud \"feedback\" noise.  In addition, it's very easy to \"de-synch\" the monitor by pushing the buttons on the side-that's not a fun thing to happen in the middle of the night.  I'm sorry.  I love my previous mobi video monitor this one is just no good.", "Date": "November 22, 2013"}, {"Title": "1 week of use so far", "Author": "jujubes1", "ReviewID": "R1IO5KINCMWJ5N", "Overall": "5.0", "Content": "I love this monitor! I've used 3 other monitors and this is by far my favorite. I've used Summer monitor at similar price range and I got really bad interference. With the Mobicam I can barely hear any fuzz. It's very clear and the picture is great.I've read that the picture has froze for some customers but that has yet to happen to me.I like the VOX option. I have VOX on for the majority of the time when I'm using the monitor. It helps with battery life.I didn't purchase the optional rechargeable battery pack. I have rechargeable AA's and that works just fine.I did fine the green led on the baby camera to be bothersome so I put some painters tape over it and colored the tape with black sharpie.If anyone is having bad luck with some of the other well known brands I would definitely give this monitor a try.", "Date": "September 9, 2013"}, {"Title": "Great!", "Author": "Casey Harris", "ReviewID": "R373I2EKL739MF", "Overall": "5.0", "Content": "This is our second Mobi brand baby monitor and we loved both of them!  The reception is great even from a distance.  This is a great product for the price. I have friends who bought $200 to $300 monitors that do not work as well as this one.  Well worth the money.", "Date": "September 4, 2013"}, {"Title": "it does a good job within its range", "Author": "Mr. Do it All", "ReviewID": "RLXSVCIX4TRZL", "Overall": "5.0", "Content": "so long as you stay within the range its advertized to handle it does a good job. We had this for a while but gave it away when we upgraded to another model and the folks we gave it to are still using it.", "Date": "August 20, 2013"}, {"Title": "moniter", "Author": "yitty kahan", "ReviewID": "RKRFAI1SHSI1M", "Overall": "5.0", "Content": "this is the best thing I ordered this summer I use it all the time and it works very well", "Date": "June 30, 2013"}, {"Title": "Sound cuts out often", "Author": "Ronnie", "ReviewID": "R1SD0KPRSHRE36", "Overall": "1.0", "Content": "Waste of money and dangerous if you are relying on this product. More than once the sound has cut out (and once the video froze). We have woken up to find our son had been screaming for a long time and sometimes had gotten sick.", "Date": "May 20, 2013"}, {"Title": "Good when it works.", "Author": "Christy McCain \"Momma\"", "ReviewID": "RMQ1Q7DK9ZZZL", "Overall": "2.0", "Content": "I bought this because my other monitor broke after using it for several months. I had hoped to get the same one since I already had 2 other cameras so that would have helped me not to have to buy an entire new set. Unfortunately, the monitor turns on and off constantly. The monitor seems to get to hot which may be why it turns on and off. It's a shame because I did like this when it worked properly. The new monitor I only had 1 day before deciding to return it.. I even called Mobi's customer service team and they told me this model is discontinued and they can't replace it. On to better things I guess. :(", "Date": "April 3, 2013"}, {"Title": "Does the job, but too many issues", "Author": "B Richardson", "ReviewID": "REF3FVL5X42C2", "Overall": "3.0", "Content": "Honestly, we bought this based on price. There are some things that are great. The picture is great. The sound is great. The VOX is great. But there are so many issues that frustrate me daily:--In the beginning, the monitor was ultra-sensitive... if my baby wiggled a toe, it came on and the slight hum and bright screen woke us up. For a few months, we had to sleep with a pillow blocking the monitor. Eventually, it became less sensitive.--We also had to put black electrical tape over the deadly-green light that shows you whether it's on or off. Even through the tape, there's enough glow that I can tell if it's on. There's no need for lights that could land an airplane. Baby slept much better once the light was gone!--Sometimes the camera and monitor lose sync without warning, and we'll wake up to hear crying but the monitor hasn't kicked on. Sometimes it was random, and sometimes it was because it is so easy to accidentally hit the wrong button when you're groggy at 2 am. There was also one occasion when we woke to hear crying, checked the monitor, and saw a frozen image of a sleeping baby. When this happens, the camera has to be unplugged and reset, which means disturbing baby.-- After about ten months of use, during which we kept it plugged in, but had to move the monitor (the screen unit) from room to room throughout the day, the power cord stopped working. We tried new cords, but there is something loose inside the monitor so it wasn't getting power. We had to start using batteries, and we found out quickly that this thing could eat through 5 new AA batteries in one 12-hour night. We have been using rechargables, and they have to be charged daily. Still, there are nights when we wake up and the batteries are dead.--Now we've been using it about 14 months and there are times when the sound will come on, but the screen stays black. If I give it a good shake, the image will come back for  alittle while.Granted, the screen part of the monitor has been dropped a few times. But what baby item doesn't get dropped from time to time?As far as the limited positions for the camera, we always just strapped it to a camera tripod so we could move it as we wanted. There isn't an easy way to strap it, but we managed.", "Date": "March 6, 2013"}, {"Title": "Not a very good quality Monitor", "Author": "C. Mayfield", "ReviewID": "R33VVXBZXGC84N", "Overall": "2.0", "Content": "We received this video monitor system along with an extra camera as a gift before our twins were born about a year ago. Since we started using these cameras both of them have become inoperable in some way or another.First thing, right out of the box when you hold this thing, it just feels cheap. It feels as if the units are completely hollow inside, no weight to them whatsoever. The cameras tilting doesn't really have a useful range. You can't set it on the rail of your crib because it will have huge blind spots (something that it seemed as if our daughters knew were there and preferred to sleep in them), and you can't really set it at a distance because you won't be able to see clearly (especially at night, the picture quality of the cameras are lower than cellphones these days).Upon first using them, syncing was pretty straight forward. The navigation menu can be a bit confusing and I kept accidently \"un-syncing\" the cameras while trying to get them to scan between camera to camera.After about 7 months of use (and a couple of times being knocked over), one of the cameras became really blurry to where you couldn't tell what was happening in the room at all.  Four months later the other camera's microphone went out and no longer works rendering the system nearly useless.Based on the quality of this product, I would not recommend it to anyone. If you really must have a video monitoring system, spend a little extra money and get one that will last.", "Date": "February 10, 2013"}, {"Title": "Nice monitoring system.", "Author": "T. Pruitt", "ReviewID": "RJ8Q0BUW69OGO", "Overall": "4.0", "Content": "This is a good little monitor for the money. You can see pretty clearly in daytime or nighttime. It would freeze up on occasion, but that was before we found the voice activated switch. Just turn that on and the monitor won't kick on unless the baby makes noise.", "Date": "February 3, 2013"}, {"Title": "nice product", "Author": "Kirk Pyle", "ReviewID": "R305TB7K2WE51S", "Overall": "5.0", "Content": "This is a very good product.  I have had it now for a month or two and have zero issues.  The picture is clear and the sound is good.  I just wish the screen were a little larger, but this size does the job.", "Date": "January 23, 2013"}, {"Title": "ABOUT ALL I CAN SAY", "Author": "Streator1040", "ReviewID": "R1DX1TCDPJOS5O", "Overall": "3.0", "Content": "IT'S OKAY, DUE TO THE WAY THE CAMERA IS BUILT IT IS DIFFICULT TO ADJUST THE ANGLE OF THE CAMERA.  I HAD THE LAST CAMERA ON TOP OF A HIGHBOY, AND POINTED DOWN, BUT THIS ONE WOULD NOT WORK FROM THE SAME ANGLE, SO I HAD TO SIT THE CAMERA ON A LOWER TABLE AND ADJUST THE ANGLE.  ALSO THE FOCUS IS NOT AS CLEAR.  IT DOES NOT ALLOW YOU TO SEE DETAIL.  I USE IT TO WATCH AN ELDERLY PARENT DURING THE NIGHT AND IT NOT A CLEAR PICTURE TO WHERE YOU CAN MAKE OUT THE DETAILS OF THEIR FACE, OR IF THEY HAVE THE COVERS OVER THEM OR NOT, SO I FIND MYSELF HAVING TO GO INTO THEIR ROOM TO CHECK ON THEM JUST TO BE SURE THEY ARE WARM ENOUGH, ETC.  IT IS BETTER THAN HAVING NOTHING, BUT I HAVE HAD BETTER SYSTEMS IN THE PAST.  I DO HOPE THEY DO SOMETHING TO IMPROVE THE ABOVE ISSUES OR I AM AFRAID THAT I WOULD NOT CONSIDER THIS PRODUCT AGAIN.", "Date": "January 22, 2013"}, {"Title": "Totally Cheap", "Author": "Rellyroo", "ReviewID": "R1SONDQ8FQ9Y5N", "Overall": "1.0", "Content": "I dislike it because it is thin cheap plastic. There is barely any screen on the monitor. It prett much sucks all around. I am sending back, and it just came today.", "Date": "January 8, 2013"}, {"Title": "bottomline: Great product", "Author": "adele", "ReviewID": "RPQH1EWAJ56AN", "Overall": "4.0", "Content": "has worked very well. gives us very clear picture even when no lights in baby's room. screen is large enough. i put the monitor not far from my bed and i can see the screen clearly when lights are out.strongly built.the only complaint is that it is not easy to install the camera, since the camera head can only move in a very narrow angle. But still at the price i got (around 80) i would recommend it.As a mom, i'd suggest to buy a video monitoring system over an audio only. It is much easier for us to see what is happening in baby's room.", "Date": "October 10, 2012"}, {"Title": "quality item", "Author": "Dr.", "ReviewID": "R3RZH0R6VQ3RFP", "Overall": "4.0", "Content": "Easy to install, has a quality picture and the wire;ess connection worked flawlessly. The infra red operation is entirely adequate. I found this monitor an excellent buy for the price and would purchase it again.", "Date": "June 18, 2012"}, {"Title": "love it", "Author": "famof5", "ReviewID": "R3BNY6JTY76028", "Overall": "5.0", "Content": "Bought this product for two reasons. One being I have a 7 month old I like to be able to look in on while he is sleeping and him not seeing me, and second was we used a second camera to be able to check in on my father who wanted his indendence but had problems with walking. The guest house my father stayed in was 150 feet from main house and the camera had no problems. In fact because the monitior runs also on batteries I was able to roam the property and get outside chores done while baby slept. The picture on monitoir is amazing be night or day. Plus the added fact the monitoir can run up to 4 cameras at once. Love this product!", "Date": "February 5, 2012"}, {"Title": "MobiCam DL is Handy for Sandy", "Author": "Sandy", "ReviewID": "RA8Z826BYOIJQ", "Overall": "5.0", "Content": "As a single mother, I really need to have eyes in the back of my head and the MobiCam DL gives me that. I bought it from a friend's recommendation and she's right. It's a easy to use camera and monitor and I like the price. --- Sandy", "Date": "January 9, 2012"}, {"Title": "Does not meet expectations", "Author": "Louisville 28", "ReviewID": "R1G7IMF3J3EBB1", "Overall": "2.0", "Content": "We bought this monitor after our first monitor died a year and a half into use.  I was attracted by the price and the affordable option to add additional cameras.PROS: The VOX option is great because the picture on the monitor only kicks in with sound. The camera doesn't have the annoying bright lights at night that my last camera displayed - though, maybe this would help the picture.  You can adjust the sound on your monitor silently.CONS: Unfortunately, the monitor picture is extremely poor.  When placed 6 feet from my son's crib, the picture is extremely blurry at night and does not come out in color during the day.  I tried different lighting and different positions within the room to no avail.  You also have limited flexibility moving the camera up or down.  This makes it a bit more difficult to find a good spot in the room to see the entire crib.If you just need an idea of where your child is in the crib or room, the monitor will work fine for you.  However, if you're looking for a crisp picture, this is not the monitor for you.  I called the company to see if there was anything that I could do to remedy the situation and was told the only option was to return the product to Amazon or pay to return it to them.", "Date": "September 20, 2011"}, {"Title": "Great Monitor", "Author": "C. Kavarnos \"Momofmany\"", "ReviewID": "RA8RD4MAD8ZEC", "Overall": "5.0", "Content": "This monitor was a snap to set up and all that was needed was to open the box and insert the batteries or you could use the AC adapters.  I loaded the batteries in and turned it on, that was it. When we were testing it out the kids got such a kick of seeing themselves, Daddy and Mommy on TV!!!  The picture quality and sound was great.  I really like that we can just put it anywhere we want when using the batteries.  I can move the camera anywhere I want to keep an eye on the kids and I  have peace of mind.  It is great to use as a baby monitor as well.", "Date": "September 25, 2011"}, {"Title": "night vision and audio monitoring as well...", "Author": "amzn hunter", "ReviewID": "R3KV56W3T8GDUE", "Overall": "4.0", "Content": "I'm very impressed with its night vision capability.  And the voice activated function (VoX) is also very nice.  For the price/value I'm very happy with it so far.  Maybe if it comes with the right batteries it would be more convenient.  But the ability to use AC power and/or batteries is great.", "Date": "December 21, 2011"}, {"Title": "Very nice", "Author": "LAE", "ReviewID": "R26XP89C6WRFO1", "Overall": "4.0", "Content": "The set up was very easy. The picture quality both day and night is very good although I would like a bigger screen( personal preference). Day is a little better than night but that is to be expected with most monitors. The sound works very well. we have no problem hearing what is going on. I love that has the option to power by AC or batteries. In case the power goes out I know we can still see what is going on which gives huge piece of mind. My only wish is that they offered the smart device viewing without the extra charge.", "Date": "November 2, 2011"}, {"Title": "Worthless!", "Author": "William Hale", "ReviewID": "R2OV0XY6EWQYSQ", "Overall": "1.0", "Content": "This product is worthless! Do not waste your money. I have already sent it back and purchased a new product.", "Date": "January 25, 2013"}], "ProductInfo": {"Price": "$149.95", "Features": "High-resolution, color LCD display for crisp picture\nPortable with a range of up to 300 feet\nOptional cameras let you monitor four rooms simultaneously", "Name": "Mobicam DL Digital Monitoring System", "ImgURL": "http://ecx.images-amazon.com/images/I/412i1agoSrL._SX300_.jpg", "ProductID": "B0043E6B7K"}}