{"Reviews": [{"Title": "Great Stereo Camera", "Author": "John Toeppen", "ReviewID": "R13G8LUUNWP9V9", "Overall": "5.0", "Content": "The W3 is great for stereo point and shoot and also allows manual control over aperture and shutter.  Focus is automatic, fast, and accurate.  Some fun features allow the use of the camera to accomplish macros and hyper cha-cha images that are remarkable.  The Fuji W3 satisfies the needs of a \"serious\" stereo photographer as well as the point and shoot enthusiast.  The results from this camera look so spectacular on 3D HDTVs that it has captured the support of many skilled photographers seeking to push the envelope of the medium itself.  Some knowledge of computers and image processing is helpful, but there are Yahoo Groups dedicated to the Fuji as well as 3D photography, 3d video, and displays.  This camera is a great deal of fun for photographers seeking activities of substance.While the Fuji's 720p 3D video is wonderful,and the microphones are suitable for music, 3D 1080p would be a better yet.  That is the only fault that I find with this robust and easy to use camera.  There can be flare issues of the lenses are not shaded in sunward shots. The slight \"faults\" in this camera are insignificant compared to other stereo cameras, there are no other cameras that come even close, especially in this price range.  The Fuji W3 is a modern digital replacement for our 60 year old vintage Realist format film cameras that have been difficult to feed in recent years.  3DHDTV is a great new format for 3D photography.JToeppen", "Date": "July 23, 2012"}], "ProductInfo": {"Price": "$499.00", "Features": "Capture high-resolution images in 2D and 3D\nRecord HD 3D movies (720p resolution); dual 10-megapixel CCD and lens system\n3.5-inch widescreen autostereoscopic LCD displays images and movies in 3D instantly, with no glasses required\nmini-HDMI output jack offers easy connection to a compatible 3D HDTV; view images and movies instantly in 3D\nCapture images and movies to SD/SDHC memory cards", "Name": "Fujifilm FinePix Real 3D W3 Digital Camera with 3.5-Inch LCD Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/41oLGRsSvEL.jpg", "ProductID": "B004AWEWSU"}}