{"Reviews": [{"Title": "The best non-pro DSLR just got better!", "Author": "Tim Naff \"Tim\"", "ReviewID": "R1EB0CFEQYA3XF", "Overall": "5.0", "Content": "Short version:  this is easily the most sophisticated pro-sumer dslr on the planet.  (*Amendment:  The A77 now assumes that title, with the caveat that the A77 isn't really a DSLR.)  It has a set of features that make it easier to take great pictures in the most challenging circumstances.  This review is for the camera with the kit lens.  The lens is a compromise:  the body and moving parts are essentially all lightweight plastic.  I even noticed some plastic-on-plastic chatter when zooming in and out.  But Sony knew that their (pre-A77) flagship pro-sumer camera (the A700 was getting long in the tooth) had better perform well, so they put the money in the optics.  I tested this lens against five others using eye-charts at 20 feet, and guess what?  It was in the upper third of the heap in center sharpness in its zoom range, and it was in company that costs roughly 5X the extra money you pay for it over the camera body price.  It is exactly what Sony intended it to be:  a great place to start, and a good-enough place to stay.  Now for the longer version of the review.Long version:When Sony bought the Mind of Minolta, melded it with the minds of one of the world's leading multi-media companies, and backed it with Sony financial muscle, good things started happening for digital photography.  Sony corporate revenue is 10 times that of Nikon and Canon put together, and when Sony shows up, they come to play.  I have had an A550 for over a year, but on careful reading of specs and the A580 owner's manual, I decided to upgrade.  The DSLR innovations from Sony are beginning to snowball.  This camera, prior to the A77, was ahead of every other camera on the planet in three areas that are critical to non-professionals:  1. low light performance - it is excellent out to ISO 6400 (Pros care about this too and it beats the A77 in my own tests.)  *Amendment: The word on the street is that Sony is now selling this camera's sensor to Nikon for use in the D5100.  2. fast-focusing live view with tilt screen, which is slightly better than several other Sony offerings and beats all other brands like a drum (the A77 has a more degrees of tilting freedom and focuses just as fast)  3. high dynamic range (HDR) feature, which, for stationary subjects, will bring images out of the shadows with full detail, grain-free, like you won't believe (the A77 also has this)The A580 has multi-frame noise reduction (MFNR), which will REALLY help out in low light as long as the scene is stationary.  Of course, using a long exposure on a tripod also requires that the scene is stationary.  MFNR is a selection on the ISO menu, so the camera will optimize the ISO according to the scene.  I've become very dependent on this feature when working in a hurry in low light.  I set it as a memory preset so I can get in and out of the mode with just a twist of the knob.The A580/560 has added the video capability that the A550/500 lacked.  It shoots 1080/60i, which deinterlaces in a 1080p TV to become 1080/30p and is technically better than what you get from the high-def movie standard of 1080/24p, but is not up to the 1080p/60p of the most recent video cams.  It can be very, very sharp according to your optics and your success at focusing.  The A580/560 does not focus during video shooting like the A77/65/55/35 SLTs, but it does something that they do not:  it allows you to choose the lens aperture f-number.  (Higher f-number means a more closed down aperture, means more of your scene in focus, and means you may need more light when you take advantage of it.)  The A580 allows manual focus while shooting, but that's awkward without a tripod.  On the A580/560, you can zoom while you shoot, but you can't change the aperture while shooting.  (The manual is extremely confusing on that point.)  With the A580/560, you set up your focus and your f-number before you start shooting.  (Use aperture priority and press your still-photography shutter halfway to set the focus.)  Then you press the video button, and focus stays fixed until you stop shooting video and change it (unless you adjust manually).  Given that this is an APS-C sensor, you should be able to get enough depth of focus to cover most - but not all - circumstances.  If you need a lot of your scene in focus at once, the A580/560 is preferable; if you need to follow a objects as they move a lot closer or a lot further away, the SLTs are your best bet.  Both designs, unlike the A77, will have a heating problem if you shoot video continuously for more than a few minutes, which most of us rarely do.  What I've done with video has looked very sharp.  When shooting video, you can't use the optical viewfinder.The A580/560 has done away with two of the three most-significant negatives that I had identified for the A550/500.  The only one left is lack of program shift, although there is a very useful manual-mode shift, which is often overlooked by professional reviewers.The rest of this review will explain the still-camera features and their associated benefits and liabilities, point out some other key discriminators, provide recommendations for sources of additional information, and offer suggestions for accessory purchases.  I'll discuss the kit lens, and I'll look at the A55/35, which I've been able to work with briefly.  I'll point out differences relative to the A550/500, just in case you're considering upgrading.  Finally, and you may want to skip ahead to this, I'll cover the differences between the A580 and the A560, from a real-world user's perspective.There are three kinds of potential buyers for this camera:  those who already own a Sony SLR or a Minolta SLR, those who own another brand of digital SLR, and those who would be newcomers to digital SLRs but typically already have compact digital cameras.  Most of the first group is pretty much already in Sony's pocket, because they have sunk cost in lenses and accessories that they can use on the A580.  The second group will be a hard sell because they're fully vested in another brand.  The third group is wide open, and the obvious opportunity for Sony's DSLR brand growth.  This is exactly why Sony has put so much emphasis on the live view capability.  The owners of compact point-and-shoots are accustomed to framing their shots in a video display on the backs of their cameras (live view), and may be reluctant to buy a big, clunky, expensive camera that won't do live view as well as what they already have.  This group is also likely not to know that they should care about program shift, even though it can be handy.I've said that Sony is targeting the DSLR newcomer here.  I'm not implying that this is an entry-level DSLR. And speaking as one who spent 30 years with Nikon-professional and Hasselblad film cameras, I have to say that the SLR snobs should wake up and smell the live-view coffee.  There are many, many situations in which live view is a vastly superior way to set up a shot.  I predict that in five to seven years, all DSLRs - even the pro models - will have live view capability like the A580.  It is just ahead of its time.Several of this camera's innovations fall under the heading of compositing:  the generation of a composite image through the combining of multiple, automatically shot, preliminary images.  Professionals have always done this on their computers after-the-fact, using software like Photoshop.  Now it can be done for three different purposes, very effectively - instantly - in your camera.So what's the significance of the three superlatives that I cited first?The capability out to ISO 6400 means you can shoot in lower light.  It affords a faster shutter speed that will facilitate the use of longer (i.e., telephoto) lenses, without a tripod, and deliver fast-action shots with less blurring.  Alternatively, you can get greater depth of focus and/or get by with a smaller, lighter, and cheaper lens (i.e., with larger f-number).  The terrific built-in stabilization, coupled with the low-light-capable sensor, delivers this capability.  The fact that the stabilization is built in to the camera body instead of the lens means you can buy excellent, cheap, vintage Minolta lenses and get the full benefit of stabilization.  Sony makes their own sensors and even sells sensors to competitors.  Given Sony's obvious priority for DSLR market share, they can be expected to hold some things back from their DSLR competition.  The combined sensor and stabilization capability will allow you to sit in the den and shoot Fido without a flash.  No more pet red-eye!  It also means you can sit in your den with the manual (or better yet, with the soon-to-be-released books that I recommend here) and learn the camera pretty much inside-out, working in available light.  There is a new compositing feature that adds even more low-light capability for near-stationary scenes:  the hand-held twilight mode.  This mode, market-tested earlier this year on Sony's higher-end point-and-shoot models, fires a burst of 6 frames, aligns them, and then uses them to reduce both random and detector-specific noise in a composite image with no attendant loss of detail.  This really matters.In addition to near instantaneous focusing (in decent light), the live view screen is bright and has extraordinarily high resolution.  You can set up the shot better, you get a better review of what you've shot, and you have a better idea of whether you need to reshoot.  The tilting screen allows you to shoot over crowds, shoot over fences, shoot from waist level, and shoot from floor/ground level without having to lay down to do it.  It's extremely handy for macro work.  You'll also find yourself using the tilting screen in ordinary circumstances.  (Some have complained that this camera does not have an LCD readout on top.  The flip-up screen does help compensate.)  Other DSLR brands, with the exception of Olympus, have totally pathetic live-view focusing capability.  That's an understatement.  And even Olympus does not have the tilt screen.  (Nikon actually has a better tilt screen, similar to the A55/35, but they don't have the fast-focus live view.)  BTW, any DSLR will focus fast and allow you to squeeze off a shot in a split second when you use the optical viewfinder.  With this camera, the difference is that you can have it both ways, and both ways will yield way faster focusing than a compact point-and-shoot.  These first two features alone, on an otherwise good camera, should be sufficient to persuade the DSLR newcomer to get onboard the A580/560 bandwagon.HDR is another compositing mode.  When you shoot with HDR, the camera shoots three frames in succession at differing exposure levels (you can set the difference to be up to 6 stops total across the three frames).  It then superimposes the pictures, replacing dark areas in the middle exposure with corresponding areas from the higher exposure, and replacing \"whited-out\" areas in the middle exposure with corresponding areas from the lower exposure.  This camera, like others, has a mode called dynamic range optimization (DRO) that selectively adjusts contrast to improve shadow detail.  DRO exploits the fact that the camera's RAW images have 4-stops more dynamic range than jpeg, so there is room for adjustment.  HDR beats DRO by matching the actual exposure to the available light in different parts of the same picture, producing shadow detail that is sharper with less grain than DRO.  You might wonder if you would have a problem holding the camera steady enough to capture three frames for overlay.  With the built in stabilization and the image correlation algorithm, the camera will take care of it, just as it does in the twilight mode.  The only catch is that moving objects will produce a triple image, so you will only turn on HDR when you are shooting near-static scenes.  Also, since HDR lightens the dark areas of the photo, you won't want to use HDR on static scenes when you need strong contrast between light and dark areas.  (The A550/500 shoots two frames instead of three and spans from 1 to 3 stops as compared to the A580/560's 1 to 6.)  HDR saves the composite image and also saves the medium-exposure image (which the A550 couldn't do, because it had no medium image).  This can be a God-send if you forget to turn off HDR and shoot something moving (as I did in Harry Potter's King's Cross station this summer).  It also gives you something to compare.  I used HDR heavily on the A550 and got terrific results.  The best just got better with the A580/560.  My only recommendation to Sony for improvement would be to have an option to do the HDR process in RAW and output the image in RAW to preserve the full dynamic range of the sensor. As it is, Sony giveth, and Sony taketh away.What are some other significant features?Early mirror lockup on self-timer.  This allows you to absolutely remove mirror-induced vibrations that may cause some blurring.  Mirror-slap vibrations are a much worse problem on full-frame cameras than on APS-C, because the mirrors are bigger.  Also, the vibrations were much worse in the bad old days before engineers built in damping that essentially has the mirror hit a pillow instead of a hard stop.  Even so, I will be comforted to know, when I'm setting up that once-in-a-lifetime shot, that I don't have any possible degradation due to the mirror.  Mirror lockup, which is on all pro cameras, was missing on the A550/500, and was one of those problems that the A580/560 fixed.  The only thing better would be if the A580/560 would let you keep the mirror locked up to avoid the self-timer-mode delay when you're ready to shoot.The other of my two major problems with the A550/500 that the A580/560 has fixed is the lack of depth of field preview.  This allows you to see how much of a scene is in focus at your current f-number.  When you do the preview, the camera stops down the lens so that you can see its effect through the viewfinder.  Of course the view becomes darker as this happens, but you can usually get a better idea of your depth of focus.  This feature is all the more important now that the camera has video that can't change focus while shooting.Another compositing function is the panoramic mode.  Using it is very intuitive:  you hold down the shutter button and pan the camera.  The camera wildly fires at what must be 7fps until you stop.  (The camera gives you an indication of the speed at which you should pan the camera.)  At that point, it knits the frames together into a continuous photo.  I've only played with it a little, but my first impression is \"WoW.\"  I'm looking forward to using it in the future.The A580 will take an SD card and a Memory Stick simultaneously.  You have to throw a mechanical switch to go from one to another.  SD cards will give you about the same speed and storage as memory sticks for about half the price, so having the SD option is valuable.  I keep my A580 loaded with both.  It just means I have a deeper built-in magazine and something to fall back on in case of a problem with one of the cards.Some will think that it's a big deal that the A580 has an ISO 100 setting while the lowest on the A550/500 and A560 is ISO 200.  The A550/500 has a native resolution of ISO 200 (the A560 does as well), and would derive no benefit from operating with double the light, which it would get at ISO 100.  Some will like the idea that they can use slower shutter speeds or wider apertures when they need to.The A580/560 has essentially the same viewfinder as the A550/500, providing 95 percent coverage.  The phase detection autofocus system, however, has been upgraded from 9 to 15 points.  While the A550/500 had one, center-located, cross-hair sensor, the A580/560 has three.  This has the effect of adding another two line-array of focus points.  This all improves focusing performance, but I saw little need for improvement in my A550.The A580 and the A560 will both shoot up to 7 frames per second, which is world class but is exceeded by the SLTs.  The A580/560 can't auto-adjust focus while firing at 7 fps, the same as while shooting video.  If you're shooting something moving toward or away from you, you'll need to slow down to 5fps, which you can do.  As the A580 is firing and filling your buffer, it is dumping from the buffer to your memory stick or SD card.  The A580 has a buffer that will allow you to shoot three times as many RAW shots or twice as many maximum-size jpegs as the A560 at that rate before it slows down.  (The A560 is just as fast, but has a much smaller buffer, so it slows down sooner.)  A faster stick/card will give you more shots before the buffer tops out.  The A550 had no further increase in shots-before-slowdown when I went to cards faster than class 6.  I hope to do the necessary tests to determine where the point of diminishing returns is on this camera.  When I do, I'll add it to this review.  I'd like to make one more point about speed:  many bloggers have made a big deal about \"how fast\" a camera is.  Ask yourself whether you really want to go around shooting 7 or 10 fps on a regular basis.  If you do, you're going to spend a lot of time reviewing images and deleting.  The faster the frame rate, the more sifting you have to do.  I doubt that fps beyond 3 to 5 will turn out to be important to most of the people, most of the time.What about the negative I mentioned at the start?Program shift would allow you to take the camera's program-mode choice of aperture and shutter-speed setting and quickly and smoothly shift to other aperture-shutter combinations of equivalent exposure.  (For the technology-savvy, it's like an instantaneous shift from Program mode to Aperture Priority or Shutter priority, while starting at the initial Program mode settings.)  With the A560/A580, you can't do that.  You can, however, do a \"manual shift.\"  This accomplishes a similar purpose but only in manual mode and not with the camera's programmed exposure as a starting point.  Program shift is a nice feature, and I wish the A580/560 had it, but it's no show-stopper.Stuff you should consider buying:Books on the A580/560 by Gary L. Friedman and David D. Busch.  Gary teamed with Tony Phillips to get his book out first.  He specializes in in-depth books on Sony cameras.  Busch writes good, comprehensive camera guides in general.My favorite author on Sony cameras is Friedman.  He is a pro photographer who uses -- lives with -- Sony cameras both in studio and in outdoor shooting worldwide.  Does that mean he's out of touch with the needs and concerns of users like us?  No, because he's constantly teaching seminars.  If you're not sure about the A580, get the Pdf version of Gary's book.  Once you get past the somewhat Dick-and-Jane stuff at the beginning, you'll find around 460 pages of the most thorough treatment of this camera available (now or in the future), with a pretty decent course in digital photography woven in.  Even if you don't buy an A580, you'll be a smarter buyer after Gary's book if you're less than a seasoned DSLR user.You will need something to use to clean the sensor when it gets dust on it.  Unless you install just one lens and never take it off, the sensor will get dust on it, and it may get dust on it anyway.  At a minimum, get a Giottos Rocket Blaster Air Blower - Red (Large) 7.5\" - AA1903.  Friedman doesn't agree with me, but get one anyway.  Then consider a VisibleDust Brite Vue Sensor Loupe - VisibleDust 3468822, an Arctic Butterfly SL 700 Sensor Brush, a LensPen SensorKlear Loupe Kit w/SensorKlear II, and/or a Digital Survival KIT - Sensor Swab Type 2 (w/Eclipse).  (Extensive tests have shown that the Eclipse fluid is okay on Sony senors - you don't need the E2 fluid as was once thought.)  Don't get all these accessories!  Just get the blower and check the others out.  I especially like the VisibleDust Sensor Loupe, and I'd by the cheaper version of the two available on Amazon.  Because of their built-in lighting, these loupes will even expose dust that is too small to cause a problem.  If the sensor looks clean under your loupe, it's clean.As an aside, I think I'd better tell you what I've learned about cleaning the sensor.  First turn the camera body face down and switch it on and off a few times, which shakes the sensor.  If that doesn't work, insert a well-charged battery, turn the body face down, and switch the sensor clean mode on and off a few times.  It isn't documented, but that gives the sensor a better shake (like an ultrasonic cleaner) than the on-off shake - I only know because I can feel it.  If that doesn't work, be sure you have a well-charged battery (or put it on an external power supply), turn on the clean mode, remove the lens or body cap, hold it up with its face down, and use the blower brush.  By holding it face down, you have better odds of causing debris to fall out of the camera.  If the blower doesn't work, consider the other options I listed previously.  The blower has worked for me about 80 percent of the time.  If you are klutzy with delicate instruments, and the blower brush doesn't work, take it to a camera shop.  You have to be very careful about poking around the sensor.  Don't use a sensor brush on anything but the sensor so you don't pick up any contamination on the brush.  The A580's wall around the recessed sensor may have grease on it; don't touch any sensor brush against anything around the sensor.  I will sometimes test a brush on a squeaky clean filter to make sure the brush is clean before using it on the sensor.  Also, if your Arctic Butterfly brush seems loose or falls apart when you turn it on, just push it back together, which will permanently fix it.  Some were shipped without being properly assembled.  (Hard to forgive, considering the price.)A lot of people buy a vertical grip.  The VGB50AM grip, which was made for the A550/500, will fit and operate on the A580/560.  Vertical grips allow you to hold the camera and control it comfortably for portrait format.  They replace your camera's internal battery with two batteries located in the grip.  The A580/560 will display the charge status of both batteries and let you know which one is currently in use.  These things are all good, but the grips aren't free, and they add both bulk and weight.  They are the kind of thing you want with you when you are going out specifically to shoot pictures.  They can be overkill if you are slinging a camera over your shoulder just in case you need it.  Also, they can cause you to be mistaken for a pro - they aren't stealthy.  Note that most cases designed for DSLRs won't fit a camera with a vertical grip.  I use Zing pouches to hold my camera bodies with a grip attached.If you get a separate flash, get lithium (non-rechargeable) batteries for it or either NiMH or NiZn rechargeables.  I have the HLV-F20AM and the HLV-F58AM flashes and I love them.  I advise, however, that the A560/A580 built-in flash is quite capable, providing good, even illumination.  Of course, it can't do bounce; it's more prone to produce red-eye because it sits low; it can't operate off the camera; and it has less power.There are some very well-done reviews on the 18-55 kit lens on Amazon. It is very compact and lightweight.  You'll be able to use its zoom range effectively for landscape, indoor and outdoor architecture, and portraiture.  This lens reaches 82.5mm full-frame equivalent, which can mean you'll need to do a little cropping if you want head-and-shoulder portraits.  If you want to sit on the couch and fill the frame with your toddler sitting halfway across the room, expect to have to get up.  The lens is a terrific buy at $100 when bought with a camera body package.  It is so good at macro (close-up) photography, it is arguably worth the price just for that.I strongly recommend the Sony DT 16-105 as a rock-solid performer at a reasonable price.  This lens is compact and practical and is my walk-around lens.  Of course, it, like all DT lenses, will not support my full-frame camera.  Search Amazon for DT 16-105mm f/3.5-5.6.  Others to consider are the kit lens and the Sony DT 18-250mm f/3.5-6.3 Zoom, which is among the first \"super zooms\" to have strong resolution across the full zoom range.  The ultimate walk-around DT lens is supposed to be the Zeiss DT 16-80mm f/3.5-4.5, but it's pricey, especially given its zoom range and some reviewers have questioned its build quality (but not its optics).  Zeiss and Leica make the best camera optics in the world, bar none, and I speak from experience.  The Sony G-series represents the (non-Zeiss) Sony premium line, inherited from the Minolta premium line.Consider some of the used Minolta AF lenses.  Some very, very cheap ones are also very, very good. The fact that Sony builds its stabilization into the camera means you get full functionality:  stabilization as well as autofocus.  The downside is that their focal lengths were chosen for full-frame use, and they are less than ideal when multiplied by 1.5 as you must do for this camera to get to the 35mm full-frame equivalent.  Three in my collection are the Maxxum AF 50mm F1.7, the Maxxum AF 35-70mm F4, and the Minolta AF 70-210 F4.  This last lens must not be confused with the 70-210 F4.5-5.6, which is smaller, much cheaper on the used market, and does not have the reputation for sharpness of the F4, which is called the \"beer can\".  The much-cheaper lens, however, is a more-than-adequate performer, and it makes a great first step into telephoto range from the kit lens.  Look for it on eBaY as one of the best lens buys in the present market.  The \"beer can\" is a better, but much pricier, option.  The lack of a built-in motor makes these Minolta lenses, like the kit lens, smaller and lighter than the higher-end of the newer lenses, yet I've had no problem with focus lag on the cheaper lenses.  I bought three of my Minolta lenses based on Freidman's recommendations in his A550 and A900 books.  Also don't forget that the Minolta/Maxxum lenses are full-frame, so they should hold value or appreciate in value and can help you transition to full-frame later.  I use the purple, blue, and black, cheap-but-high-quality, Zing pouches for storing these lenses.Get a UV filter for your lens to protect it, but take it off when you want the absolute best lens performance.  (You should try shooting with and without the UV filter when shooting long-range in hazy atmosphere.  It may actually improve performance in haze by blocking the UV light scattered by the haze.  This really mattered with UV-sensitive film, but is not such a big deal for digital detector arrays.)  Also consider a circular polarizer at some point for increased color saturation and reduction in surface reflections.  The better coated the filters are, the less they tend to degrade other aspects of performance.  The best, IMHO, are Heliopan SH-PMC, B+W Pro lines, and Hoya's top lines.  B+W are easy to clean and my personal choice.  BTW, polarizers from these companies can be so expensive you may feel like putting a cheaper UV filter in front of it to protect it!Don't let the cost of these extras scare you.  All you really have to have are a kit lens and the Giottos blower.  The rest are just things to be aware of.  You can start with these basics and then build as you discover where you want to go next.I promised at the beginning that I'd cover the differences between the A580 and A560 from a real-world perspective.  The differences are (1) the A580 has 16.2 megapixels in an image, while the A560 has 14.2; (2) the A580 has the larger buffer allowing longer 7fps bursts as explained above; (3) auto ISO starts at 100 (A580) vs 200 (A560); and (4) the A580 is slightly more sensitive (EV 17 vs 16).  Note that the A560's pixel count, ISO lower-limit, and sensor dimensions are identical to the A550.  If the sensor is the same, it's not bad news, because the A550 is a wonderful camera.  Also remember that the improved HDR mode and the new twilight mode help the sensor, so in those applications, (not to mention other features including video) the A560 can beat the A550.I've already discussed the significance of the ISO difference and burst mode duration differences between the A580 and A560.  As far as pixel count goes, it's technically a mixed bag, because the sensor plane is practically the same size on both cameras (they're the same height, and the A580's is less than one half percent wider).  Technically, that means that while you get higher resolution with the A580, your image could be commensurately noisier.  The A580 will give you only a 6.8 percent increase in pixels per inch.  You won't be able to see a difference in resolution, and you won't see a difference in noise because of the detector size difference.  Are there differences in the focal plane array technology?  It would seem unlikely, since they are both \"Exmor\" CMOS sensors.  I think the choice between the A560 and A580 should depend in part on the size of your total investment.  If you are planning to invest a whole lot more on lenses, the $200 (or so) difference in the bodies won't be significant.  On the other hand, if you're only buying one or two lenses in the sub-$500 range, you will probably do better to put the $200 into lenses.I wish you luck in your decision.  I could keep going, but let's leave the heavy duty reporting to Friedman.  I'll close by saying that the A550 made me an advocate of the Sony DSLR.  The A580 is a step up in still camera features, not to mention the video capability.  If I didn't love the camera, I wouldn't have taken the time to write this review.Good shooting,Tim Naff", "Date": "December 21, 2010"}, {"Title": "Very happy with this camera", "Author": "Amazon Customer \"Niko B\"", "ReviewID": "R1P8HURVHA5ZID", "Overall": "5.0", "Content": "I previously was using a Pentax K20d body and owned a Nikon D70 and still own a Lumix G1. If you are not familiar with the K20d, it's an excellent enthusiast level camera with pretty much every feature and control you could want. But it is a 2008 model so I wanted to upgrade into the ever changing new technology. The Pentax, like other older cameras is not quite as good at high ISO, low light shots as I would like so I took the chance and made the switch.The Sony arrived quickly with pretty much what I expected in the box. In looking it over and initial testing, the first thing I noticed was the things that were missing as compared to the K20. I won't try to list the physical differences other than to say the A580 vs the Pentax K20d differences are fairly typical of the differences between many enthusiast cameras when compared to mid-level models (Canon d50 vs T3i, Nikon D7000 vs D5100, etc). The Sony A580 has some of the frequently used functions tucked into the menu rather than having physical controls such as white balance, drive mode, raw, etc. as the Pentax has. At first I was horrified. I told myself, relax, it's Amazon, you can send it back. I then decided to give the Sony a chance and took a look at the manual. I found that Sony has at least put a quick menu button on the back which brings up pretty much all the things you need to the top level of that menu. I thought, ok, it's better than my pocket cam. Another thing I noticed is that some features that the Pentax has buried in menus are brought to the surface with buttons ... ie..a Normal/DRO/HDR button, and a movie record button. It was starting to get interesting.The final straw came when I took the camera outside for a night shot test (it was late night now). It just happens that there was an opportunity for a shot that I've been trying unsuccessfully to get for months with the K20. Its my cat walking on the landing rail in low light. The poor Pentax K20 just isn't fast enough .. even with my f1.8 50mm lens at ISO 1600 .. the moving cat was blurred and the level of noise was unacceptable. Well here I had that same shot in front of me. The A580 was set to the \"Night View\" scene mode. I aimed using live view and shot .. I was shocked! The result was exactly what I wanted. I exhaled and told myself, there is no way I am sending this baby back to Amazon. I uploaded the photo to the item description area.Here I am a month later having dedicated some time to learning the camera. I am extremely pleased with it. It is certainly a different animal than your standard XSi, D80, K7 camera .. you have to learn to take advantage of the mind blowing features like the super DRO mode, HDR, and scene modes but this camera will take photos that are very difficult to get with previous cameras. It is especially good with low light photos with high tech features only Sony offers. The image quality is excellent even at high ISOs. (it's the same 16MP sensor that the Nikon D7000 uses). I am not really big on movies but the HD movie quality is excellent in my view. Even the PMB software that comes with it is very nice.I give this camera my full recommendation for a camera under $1000 ... and actually I had been considering the Nikon D7000 but now I am glad I bought the Sony A580 instead for half the price. I'll spend the savings on a nice lens.", "Date": "June 26, 2011"}, {"Title": "Sony A580 - Best Camera I Have Ever Had", "Author": "Jerry K. \"Jerry\"", "ReviewID": "R1MEOEN7MCKOBW", "Overall": "5.0", "Content": "It would be easier to write this review by stating that I agree 100% with the review above this. I have had the camera about a week and still learning all of the settings - which for a novice takes quite awhile. If you do get this camera - and you should - also get Gary Friedman's Book on the A580.  It's packed with almost 500 pages (the online book) of everything you need to know about this camera and photography in general.", "Date": "January 6, 2011"}, {"Title": "Excellent camera, just 1 feature missing", "Author": "Debora P. G. Saliby", "ReviewID": "R3MJIU9L8NZRF7", "Overall": "4.0", "Content": "I can tell a lot of wonderful things about this camera (image quality, quick autofocus even in live view, low-light performance, in-body stabilization etc) and have only 1 complain: it's the only DSLR that I know in this price range that does not automatically correct lens geometrical distortion, I can't really understand why. I had to buy a software to do that and added 1 step more (wasted time) to my flow every time I transfer photos to the computer, since not even the provided software does that.On the top of it, its kit lens presents a lot of geometric distortion.Sony, please consider that for future firmware revisions!!!", "Date": "May 19, 2011"}, {"Title": "No small step forward", "Author": "Alan M. Greene \"annapoal\"", "ReviewID": "R35BM4BOZ47UFL", "Overall": "5.0", "Content": "This is a great camera for the money.  The new sensor has great low light performance and is a significant step forward.  Combine this with a wide dynamic range and the week link is the photographer not the camera.  How well it meets your needs you must decide.  Great live view.  So so ovf.  Fast shooting with 7 fps.  In body stabilization.  My 100 -300 APO is image stabilized along with all my lens.  HD movies.  The camera is the wireless flash controller, no addition flash required other than the remotes.  When friends compare their images with this new sensor, the results are pretty impressive.  A good place to compare is at image-resource.com.  You can compare differnt cameras with the same scene and lighting.  Speaks for itself.  Perfect no, but a giant step forward compared to even 2 year old sensors at any price.  Enjoy.", "Date": "February 17, 2011"}, {"Title": "A sleeper of a \"gem\" - fantastic DSLR with great lens options", "Author": "Amazon Customer", "ReviewID": "R1ZFRSWZBRFAKO", "Overall": "5.0", "Content": "Fantastic camera! I compared three different cameras: Nikon D5000, Sony A700 and the Sony A580. One of my main considerations was taking photographs of my daughters playing sports, which narrowed down my choices for a sub $1k camera with a high FPS to two camera lines, Nikon and Sony.The Nikon had very realistic pictures, good coloring but not oversaturated. The issue with the Nikon is the cost of good quality lenses. The Sony A700 felt very solid in the hands which I really liked and took great pictures as well. The issue with it was I need a higher ISO to photograph my daughter playing indoor volleyball (thought I plan to buy the Sony A700 later down the road as a second camera).The Sony A580 ended up being for me the perfect camera for many reasons. It has a high ISO, a great high-quality sensor (it won Dpreview's Silver Award), a range of great quality lenses, many at very affordable prices and the latest technology . See the Dpreview website for an in-depth review of the camera and its sensor. The range of lenses includes Sony, Carl-Zeiss, Minolta Maxxum lenses as well as third party. Minolta Maxxum is a great source of high quality lenses at a steal. They were built solidly with high-quality glass and metal mounts. Many can be found on used on the web in great condition and there are quite a few articles on which are the better lenses. (Also take a look at the Minolta Maxxum Flashes).In addition, the camera takes HD video, does HDR and Panorama. Pair the camera with the Maxxum lenses and flashes, buy a good caselogic case and you've quite a great setup at an unbelievable price. If you want to take it up another notch, get a high quality photo printer like the Epson R2000 or R3000 with the money you saved buying a Sony/Maxxum setup. If you take a lot of photographs, look into Adobe Lightroom.If you want to see what this camera is capable of producing, search Flickr for \"A580\".What takes great photographs is the photographer, not the camera. This camera is more than capable of turning out great photographs.", "Date": "July 31, 2011"}, {"Title": "Sony finally gets it..a580 shines", "Author": "Dennis Atwell", "ReviewID": "R3LTKE5V5ABJMU", "Overall": "5.0", "Content": "For far too long Sony has released a series of watered down DSLR's in the midrange until now. The Sony a580 is the camera many Sony/Minolta users have been waiting for, an APS-C camera that can compete with Nikon and Canon. Not since the release of the a700 has Sony put so many features and image quality together in an APS-C camera. Great fast AF, great high ISO performance and stunning image quality. Grab one before they are gone because this may be the last optical viewfinder APS-C DSLR that Sony makes (they seem to be smitten with the SLT design).", "Date": "March 17, 2011"}, {"Title": "Very nice camera", "Author": "Al Fisher", "ReviewID": "R1N5JQ6MXMAX6Q", "Overall": "4.0", "Content": "The camera now a few years old and discontinued. Very impressed with the camera, but was not pleased at all with the kit lens that came with it. Color and exposure not correct. I bought a Tamron 24-50mm to replace the kit lens. Night and day difference. Highly recomend the camera but buy the Tamron lens. Nice thing about all the Sony dslr cameras is the stabilization is built into the cameras. They own the patent from Minolta (Sony cameras actually Minolta cameras). No other camera maker can do this so they have to build into the lens which makes them heavier and bulkier. A huge advantage if you want a little less weight to carry around.", "Date": "December 24, 2012"}, {"Title": "Camera is great", "Author": "Camera Girl", "ReviewID": "R12UHOECT11KAD", "Overall": "5.0", "Content": "Great camera I have had four Sony cameras now and all have been very user friendly and produce wonderful photos.  The company provided the camera in the time stated and all parts were present and working.  This product is a 580 not a 580L.", "Date": "August 10, 2012"}, {"Title": "Great Camera", "Author": "Vaibhav Tiwari", "ReviewID": "RNOVPBH4Q7AFO", "Overall": "5.0", "Content": "This camera has visibly better photographs then its contemporaries in the same range. The different is apparent at low light and high ISO conditions. I like many of its features HDR, Panaroma, in camera stabilization and its well laid menu. One thing that also impresses me is its personality, its certainly more beautiful than d5100. I compared its photographs with rebel xt(old but great camer) and d3100 after 30sec exposure. The photographs for sony were far better.Things that dont like its not straightforward to delete photograph, there is auto focus for movie(which is absent because it can shoot 7fps, it shoots like some one is firing machine gun).Overall I am extremely happy with this camera. When I am tired from my studies, I just pick it up and play with it for a while.", "Date": "June 28, 2011"}, {"Title": "Excelente camara", "Author": "Claudio Villagra", "ReviewID": "R8ZNI48WYPCP9", "Overall": "5.0", "Content": "Enfoque rapido y preciso, el manejo de rangos dinamicos muy mejorado, la funcion de auto HDR y Panoramica es una belleza, adios Photoshop con estas opciones, lo he probado con el lente Kit y es  muy bueno (SAM lens) tambien con un Minolta-maxxum 50mm F/1.7 y el 75-300 F/4.5-5.6 y he notado que con los lentes sin motor (SAL lens) tienden a tener un poco de backfocus, despues la imagen, la rapidez de su rafaga de 7fps, ISO plenamente usable hasta 1600 (para mi gusto)todo esto hacen de ella una de las camaras mas economicas y versatiles para fotografia, su video no me gusta, no tiene muchas variantes y el formato AVCHD no puedo ver con mi linux, en video la canon le pasea lejos.Conclusion, para fotos tenes una posibilidad ilimitada dependiendo de tu capacidad y los lentes que tengas, en video solo para cuestiones casuales o familiares.Saludos desde Paraguay.", "Date": "May 3, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0048CE3VS"}}