{"Reviews": [{"Title": "Sunset Electronics", "Author": "AKAT", "ReviewID": "R10JVQBBAR8MHF", "Overall": "1.0", "Content": "Canon T3i is a great camera. Don't buy it from Sunset Electronics though. After two days of waiting they cancelled the order without providing any reason.", "Date": "April 21, 2011"}, {"Title": "Fast Service and nice Camera", "Author": "Raymond", "ReviewID": "R306NQINGHZFKO", "Overall": "5.0", "Content": "I ordered this camera on 29 June and received it 5 of July this was also a holiday week so there was 2 days post office here was closed I am stationed on a military base overseas in South Korea and the estimate was 25 July -15 Aug this was 3 weeks faster then projected I will use sunset electronics for all my camera needs. I also took the camera out of the box and charged the battery it was so user friendly and the pictures were nice and clear compared to my point and shoot.  Do not know why the customer before me gave it 1 star because Sunset answered my emails and shipped fast. I got hours to play with this new camera and learn what it can do. I researched between Sony, Nikon and Canon 95% of the reviewers chose Canon even on the Youtube site when doing comparrassions .", "Date": "July 4, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "* 18.0 Megapixel CMOS (APS-C) sensor and DIGIC 4 Image Processor for high image quality and speed.\n* Vari-angle 3.0-inch Clear View LCD monitor (3:2) for shooting at high or low angles\n* 3.7 fps continuous shooting up to approximately 34 JPEGs or approximately 6 RAW.\n* Compatibility with SD/SDHC/SDXC memory cards.\n* Compatible with the full line of Canon EF and EF-S lenses.\n* 1,040,000-dot VGA with reflection reduction using multi coating and high-transparency materials for bright and clear viewing.", "Name": "Canon EOS Rebel T3i SLR Digital Camera Kit with Canon 18-55mm Lens + Canon EF-S 55-250mm IS Autofocus Lens + SSE Premium Camera Lens Starter Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61pVXGk9NTL._SY300_.jpg", "ProductID": "B004QDSMFM"}}