{"Reviews": [{"Title": "Don't Buy The SanDisk SD or SDHC Card!", "Author": "Michael Chambers", "ReviewID": "R1Y1WMEDVWMZDN", "Overall": "4.0", "Content": "The Amazon page on this camera advertises that customers who bought this camera also bought a SanDisk SD or SDHC flash memory card.  In doing research prior to ordering one of these cameras, I found mention in an archerytalk forum that in contacting Primos about a problem with the camera, the person leaving the post said that he was told by Primos that SanDisk cards won't work [reliably] in the camera.  The camera was tested by Primos using cards by both Patriot and Lexar, and they worked fine.  SanDisk is no doubt a fine product, but not in this camera, and the impression I got was that the problem is with the camera, and not the SanDisk cards.  Needless to say, I ordered a Patriot SDHC card with my camera.", "Date": "August 21, 2011"}, {"Title": "Works better than expected", "Author": "fig man", "ReviewID": "R2JZXOG8ZDJJY1", "Overall": "4.0", "Content": "In general I just have not had a lot of luck with a couple of other sensor activated cameras.  I bought this one a few weeks back because of the price point - and figuring what the heck to try something different.I have been pleasantly surprised with this one.  The batteries are lasting a long time.  It has been compatible with a couple of different SD cards I have used.  It is taking pictures.  The software works decently enough.  It is a very compact size.  It has a format card option which is great for me to clear the card when I install it.Additional Specs:1.3MP, 1280x1024, 5, 10, 20, and 30 second modes, with 2 (5, 10 sec) mid day modes. In 5 second mode 4AA batteries to last 7 days, or 8AA for 14 days. 16GB SD card in 5 second mode to last 8 days and take 8,640 pics per day estimate.Files saved with JPX extension but Windows 7 will display them. Probably just standard JPG files. Why they chose that extension is beyond me. Windows Movie Maker complains. The software is really a Java app that downloads the most recent version from the Primos website and probably keeps itself updated. It was easy enough to use, seemed a little off performance-wise but nothing to balk about.Overall I like it. It is small and runs off AA batteries. One thing is the resolution though, it really needs a 3MP shot for you to do much zooming. Where I had a little fox move from about 50 yards to 25 yards from the camera, I really could not zoom in enough to say for sure it was a fox. I believe closely inspecting game at a distance is not going to work out too well and I might get frustrated with it. Keeping in mind you might be missing any nocturnal feeding activity - you have to make that call as this one is only daytime. The file extensions kept me from trying to drop the pictures into Windows Movie Maker, but hey, the At A Glance software probably works out better anyways and works with pics from other sources as well.Primos makes a quality product though, and I expect that this guy will be out scouting for me for some time to come.", "Date": "July 22, 2011"}, {"Title": "So far works fine", "Author": "Francisco", "ReviewID": "R2KCG1ZC8E1H8U", "Overall": "4.0", "Content": "I have been using this product for 2 weeks in the field, and I am satisfied.It took +20K pictures, filling a 16 GB card, without problems, and the pictures quality was OK.The software to review and scan the pictures works fine too.I would recommend a 32GB card for extended use in the field, as in the 10 seconds interval with mid day skip in 14 days a 16 GB card was almost full, so a 32 GB should allow for a month in the field. I believe the batteries would allow for it too.So far so good, and at that price I am fully satisfied.One final thing. There is no safety box specific for this camer,a but I have tried it with a safety box for the Spypoint FLA and it works, so If you plan to put it in a crowded area maybe a safety box made for another trail camera will, work, as you only need that the objective is not covered, as this camera has no infrared sensors and no flash.", "Date": "September 22, 2011"}, {"Title": "Turns on very late in the morning", "Author": "MEstickbow", "ReviewID": "R3DLH3W4OCTWKJ", "Overall": "3.0", "Content": "According to the FAQ sheet on Primo's website, the DPS is designed to operate between 1/2 hr before sunrise and 1/2 hour after sunset.  However, the camera will turn itself on well after first light in the morning, usually 1 hour after legal hunting hours here in Maine, which means the camera misses one of the peak periods for game movement in the areas I hunt. The Primos customer service staff had no advice for me.  In the evening the camera operates fine.  The \"At A Glance\" software works okay  and the battery life is average in warm weather.  Unfortunately I can't recommend a time lapse camera that turns on as late as this one does.", "Date": "September 28, 2011"}, {"Title": "Works as advertised", "Author": "Stephen R. Poland", "ReviewID": "R1BV1756WLZZHD", "Overall": "5.0", "Content": "I just viewed my first 4 days of pictures and it works as advertised.  Pretty decent picture quality and it easily covered a food plot out to the 80 yards that I needed.  The software works well and was easy to use.  The only downside I see to this type of camera vs. a trail camera is that you have to spend a little time watching the movie/pictures to identify when/if the deer come in.  However, I am seeing a lot of deer that would have never triggered a trail camera.  Is is neat how it basically makes a movie of the day so you can see the deer's patterns.", "Date": "August 17, 2011"}, {"Title": "good value", "Author": "K. Jones", "ReviewID": "RHXUBMIYD4TAP", "Overall": "3.0", "Content": "Compared to the price of similar cameras, this one is a great value. I used the savings to purchase a second camera. On the plus side, it was easy to set up. it has enough options to handle most situations. The included viewing software is easy to use (with a couple exceptions) and watching the captured photos is really cool.On the negateve side. Camera resolution could be better. Focal length could be a little longer. It is hard to identify deer out past 70 yards. The buckles rusted the first week and the door gasket comes out sometimes when you open the camera.Overall it is a good addition to my scouting effort and can be used for other surveilance tasks as well.", "Date": "October 24, 2011"}, {"Title": "Good alternative", "Author": "J.R.", "ReviewID": "RVUHBM4QUIM7Z", "Overall": "4.0", "Content": "I have been using various trail cams for the past few years. I bought this one because it was on sale at a very good price.  I set up this camera on a tree about 18 feet high in a brushy, swampy area where I hunt.  I placed another standard sensor operated game cam about 50 yards away. Both cameras faced each other. Ten days later the standard game cam had captured -0- images. This camera had shot thousands of images at the 10 second/photo setting. I viewed the photos using the special program that comes with the camera and lo and behold I see deer all over the place bedding down, frolicking, and going through the area!  The most amazing thing was that the deer were most active during 12:00 to 2:00 P.M.!  All this was taking place within 40 feet of the standard game camera that camera was not picking up anything. So, I'm sold on this type of camera. I bought an external 6v rechargeable battery for it and it works great. I only wish they had a 100 GB memory card so that I could leave it out longer because it is very remote where I hunt.  With a 32GB card, at the 10 second full day setting, you can get about 20 days of shots before the card is full. The program to view the thousands of photos works very good. At full speed you can view thousands of photos in minutes. All you have to do is look at the screen while the photos flash by and don't worry, you eyes will pick out any movement even if it is only a flying bird in one photo frame. Then, you slow it down and go back in single frame increments until you  get to the photo where the movement took place.  My only suggestions would be that they upgrade the camera so that you could get better detail when you zoom in on an image. Also, a more sensitive light sensor because if the camera is in a shadow, it won't turn on until the sun is higher up.  But, like I said, in my case there were no deer in the early or late hours of the day. The deer were most active during 12 to 2 PM!", "Date": "July 7, 2013"}, {"Title": "These are Great, although I've had to send one in for repair", "Author": "Ryan Leafgreen", "ReviewID": "R1HF6UGJJWKEWG", "Overall": "5.0", "Content": "These work out very well. I'm able to place on a field or in not so dense wooded areas and watch everything that goes on during the day. I recently used to track some turkeys and knew exactly where to set up.I use these cameras along with a program called scouting assistant. (Just google). It will scan all the images which I have set to take every 5 seconds and pull out just the motion pics. This makes for a great quick way to check a days worth of still images.I did have to send one in for repair, however the other one has been a champ. Rain, snow, sleet. They work through it all. The one that was sent it never stayed on for more than a day - so it was broke from the get go.I use the evneloop AA rechargeable batteries with these, and get about a weeks worth of footage st at 5 sec time lapse.", "Date": "May 14, 2013"}, {"Title": "camera", "Author": "Elizabeth C", "ReviewID": "R2YY09D23LEI64", "Overall": "3.0", "Content": "great product, just not as good as others. Good pics at close range, but not so good far away. Good product for the money.", "Date": "October 24, 2011"}, {"Title": "Research carefully - software provided does not work", "Author": "hot3rabbit8spoon", "ReviewID": "R2EVBXWENFXKJE", "Overall": "1.0", "Content": "Product looks well made, the photographing works well.HOWEVER - the software provided called At A Glance - which is required to view all the photographs in a fast forward mode relies on a Java install.  New versions of Java 7 will not download or run the At A Glance program.  I am using Windows Vista.This is not just me - google \"Primos At A Glance Java\"If you have the software working, don't allow your computer to upgrade from earlier Java versions to Java 7.  I was able to get the software working on a Mac Os X 10.8.2 using Java 7 at work but even then the Mac gave error messages that it could not create shortcuts.  I will say that when it was working the fast checking of images was useful.", "Date": "September 4, 2013"}, {"Title": "Primos DPS Unit", "Author": "sadonetoo", "ReviewID": "R38LR1NQT83JAV", "Overall": "4.0", "Content": "Very pleased with this unit. Takes good photos and with their download you can look at thousands of pics in just a few minutes.  The only down side is that the light sensor does not cause the camera to come on early enough in the a.m. (This would be an outstanding camera if it scanned in Infrared at night also.)Well worth the money!", "Date": "September 20, 2012"}, {"Title": "Primus Truth DPS", "Author": "Chico", "ReviewID": "RVLO4ELPDTUK6", "Overall": "2.0", "Content": "Service was great.  Got here quick as a flash.  One has been working OK.  The other only will shoot one day.  And then doesn't turn on again the next day.  The one that's O.K. usually turns off after about three days although battery level is OK and there's plenty of room left on the disk.  Just checking more frequently and trying to see if they start working better before sending back.  Software is OK. Would be better if you could erase the frames with nothing on it and just store the shots where there are deer present.  Takes up a lot of space on the computer hard drive if you're on the 10 sec mode and have several cameras.", "Date": "September 19, 2012"}, {"Title": "Primos DPS", "Author": "paul", "ReviewID": "R2S2T0ED0WX7SD", "Overall": "4.0", "Content": "The camera works as advertised.  The only big problem is that it starts too late in the morning.  It starts by sensing light.  I believe it would be better if it started by a time setting.  I have a Primos 35 ultra which is supposed to do the same thing as this camera but have not tried it to see if is any better.  This camera is just another tool for scouting game.  I use is in conjunction with trail cameras.", "Date": "September 18, 2012"}, {"Title": "Neat Camera", "Author": "davey1", "ReviewID": "R2FSWJ817IXQG8", "Overall": "4.0", "Content": "Camera works perfectly as described, software took a little getting used to. Works perfectly to watch fields to see where the wildlife is coming and going. Your not going to get high detail from this cam especially if the target is very far away. Battery life seems ok so far.", "Date": "July 19, 2012"}, {"Title": "Great scout tool", "Author": "MD", "ReviewID": "R1HWENCUK6PKBO", "Overall": "5.0", "Content": "The PRIMOS DPS does exactly what it says it will do.  Pics are clear and sharp.  Only problem is with the software portion.  Having to teach and learn myself because I can't get the instructions to download.  Other than that, I love it.", "Date": "October 10, 2011"}, {"Title": "Bad Purchase", "Author": "Sharon Crowley", "ReviewID": "R165ZYCURQVMUJ", "Overall": "1.0", "Content": "I bought this for a Christmas gift and the disc  that came with it *Primos Hunting at a Glance* was corrupt, crashed the computer and it was expensive to clean out of the PC . NO I will not recommend any Primos product that has a PC disc as the files may be corrupt as found with Mine!!!", "Date": "January 28, 2014"}, {"Title": "cam ok but software makes it not worth having", "Author": "TXSTEVENSGIRL", "ReviewID": "R2UBX9YRORO0E5", "Overall": "2.0", "Content": "Cam ok does what it says but software is so bad it doubles the amount of time it takes to review the pictures.... improve software then maybe", "Date": "December 25, 2013"}, {"Title": "Perfect solution for scouting the field that my treestand overlooks", "Author": "T. Walton \"Allright Appraiser\"", "ReviewID": "R1N1SIDGA02EEW", "Overall": "5.0", "Content": "You have to understand that these are time lapse photo cameras that take pictures of a given area on a scheduled basis - not motion acitvated trail cams.  Perfect solution for scouting the field that my treestand overlooks or monitoring activity in any particular area.  You can definately pick up on activity and movement, but is not high def so forget zooming for detail and camera does not shoot at night.  Tons of valuable info from the cameras I bought.  Very happy with cameras - especially for the price ($50)The downside is battery life.  However, these cameras have a portal for plugging in an external 6v battery.  Primos sells a 'steroid pack\" which amounts to what appears to be a canvas type bag, cord and battery for about $25.  I was able to locate the batteries on line for less than $5, the cable for $7 and I'm sure I can come up with a way of securing the battery to the tree for very cheap.  Including shipping I was able to outfit all 4 of my cameras with a rechargeable 6v battery for less than the cost of 2 steroid packs.  I love the cameras and the external battery design, but steroid pack needs more thought and/or better price.", "Date": "November 28, 2013"}, {"Title": "nice for the price", "Author": "Vince", "ReviewID": "R1MTJ7BG7FTZK0", "Overall": "4.0", "Content": "not bad at all, I set mine up on a field about 200 yards long and can see everything crossing to the end, mind you i cant see it clearly just know something crossed it.can see what things are under i would say 70 or so, but for me i just want to know what kind of activity is going on and when in a given area not so much what it is as i know its either deer or other hunters. for that this is perfect.BEWARE setting it up to the east or west unless you have good cover or the sun will ruin the picks.mine starts taking picks from about 630 am to about 6pm, shooting light to shooting light no problem. i don't worry about night activity so much as i don't hunt at night, cant understand the fixation with it really, i mean they can be dancing in the field at night throwing parties, if it ends and they move it along before the shooting light whats the point.", "Date": "November 11, 2013"}, {"Title": "POS", "Author": "matthew p redrow", "ReviewID": "R19FJHRSTXCGYU", "Overall": "1.0", "Content": "What kind of tree cam doesn't work at night? DONT BUY THIS PIECE OF CRAP. Hard to use and doesn't record anything when its dark out side", "Date": "November 3, 2013"}, {"Title": "Does a good job for what I bought it for", "Author": "J. Bailey \"Still Can't Whistle\"", "ReviewID": "R39PHEPESI55C7", "Overall": "4.0", "Content": "Cons:- You *must* use their software to see the images.- Images are low-res.Pros:- Battery life is good.- Gets shots EVERY programmed time-period. Doesn't rely on motion immediately in front of camera. So, it will catch deer that are 20 yards away, and smaller animals like quail.- Software does good scrolling and time-lapse review- Good light sensitivity - captures during daylight hours.Very happy with this guy and the price is reasonable. I'd buy it again.", "Date": "October 3, 2013"}, {"Title": "Worst product software ever, almost unusable.", "Author": "Annoyed Dad \"Annoyed Dad\"", "ReviewID": "R3PILB3H9HZYWQ", "Overall": "1.0", "Content": "The camera would be great if they hadn't designed it to save pictures in the .jpx format, a unsupported windows format. The included software is so buggy and slow it takes me multiple tries to load the pictures and view.  And insultingly enough they make you agree to accept the craptastic software \"vulnerabilities\" each time you start it up, just to remind you how bad a product they have stuck you with.  And best of all the software you need to see the pictures downloads banner adds from Primos constantly, further slowing down and jeopardizing your computer security.I only paid forty bucks for this thing and I still feel  like I have been scammed.", "Date": "September 30, 2013"}, {"Title": "Beware of this product", "Author": "Mari Posa", "ReviewID": "RTCRGRTC8U4E1", "Overall": "1.0", "Content": "Every time I set this camera up in the field, it takes about 1/2 day to one day worth of pictures and then fails. When I go out to collect the pictures several days later, the camera is not taking pictures even though the SD card is nowhere near full and the batteries are showing fully charged. After reading several other reviews, it appears primos didn't bother to test the product with enough SD cards. SanSisk is Amazon's most popular selling SD card brand and primos claims that SanDisk cards are not supported? What kind of company releases a camera that uses SD cards, but will only support 2 obscure brands of card? Don't waste your money.", "Date": "September 25, 2013"}, {"Title": "software", "Author": "edward shirley", "ReviewID": "R22LMKSQWMEHLQ", "Overall": "2.0", "Content": "The software as all kinds of attachments included & still dosn't down load corectly. Takes up way to much space on your hard drive, waiting for someone from Primo to get back to me, I'm about ready to just return it & get my mony back. VERY DISAPOINTED !!", "Date": "September 13, 2013"}, {"Title": "Excellent Product", "Author": "Maryland Bowhunter", "ReviewID": "R21I42FZK9H3DJ", "Overall": "5.0", "Content": "As advertised, it is a deer positioning system.  You do not have to worry about motion sensors not being triggered, it snaps pictures every so many seconds (determined easily by a setting).  You also do not have to worry about the deer being too far to trigger the sensor.  The 1.3 MP camera is fine for the job.  I know the deer move into my area morning and evening, so I have it set from dawn to 10:00 AM ... turn off ... then turn back on at 2:00PM until dusk.  A 4GB SD card lasts for 6 days.  Awesome. I was able to determine where the deer entered...bedded...and left the area...", "Date": "September 4, 2013"}, {"Title": "Not bad at all, especially for the price", "Author": "J. Monteforte", "ReviewID": "R1V3OJLUBVF2LH", "Overall": "4.0", "Content": "I found one of these recently at a local retailer for $40 bucks so I thought I would give it a shot.  My areas to hunt are mostly game lands and state parks so I was not interested in spending too much on something that might not be there when I went back to check on it.So I hung this camera with some cable locks for two weeks and checked on it last night.  First, I had no issues with 32g SD card or batteries (thanks to some of the warnings about card brands).Camera was easy to set-up and takes about 3500 pictures a day on the setting I chose (1 every 10sec with a break between 10am and 2pm).  Pictures were clear although get blurry quickly when zooming.I must echo some of the other reviews about the light sensor turning the camera on and off.  It does come on later than I would have liked and turn off earlier than I would like (average of 7am & 7:30pm, not great for late august)That said, I spent 40 bucks plus some batteries and a SD card. I got a ton of pictures of deer feeding where I intend to hunt.  The time lapse tells me not only when they come, but from where and how they leave.  Great for hanging a stand or placement of a ground blind.It has its flaws, but for the price, I really can't complain about much.", "Date": "August 27, 2013"}, {"Title": "Only had 1 problem but it is minor", "Author": "William W. Witherspoon \"William\"", "ReviewID": "R2NQFZHMBZ90GH", "Overall": "4.0", "Content": "It works great but I recommend NOT putting it in direct sunlight since it APPEARS to shut itself down if it gets too hot. I moved it to a more shaded area and no more problems.", "Date": "August 7, 2013"}, {"Title": "Pictures are very clear!", "Author": "Debbie Abel", "ReviewID": "R74SV3ZUP64J8", "Overall": "5.0", "Content": "I love the DPS Game camera.. It's very easy to set up and the pictures are very clear!  Great product - it exceeds the value of what I paid for it!", "Date": "June 4, 2013"}, {"Title": "Great Game camera", "Author": "Karl M Hamilton", "ReviewID": "RVI9M6MFGDEIQ", "Overall": "5.0", "Content": "I used this camera a lot to find out when the game was coming in and to even keep track of wildlife coming into my yard.  I like how it can be set to take pictures every 5 seconds.  You do not miss game like the motion detector ones.  It does not have night vision but I knew that when I bought it.Very satisfied.", "Date": "April 8, 2013"}, {"Title": "Great procuct", "Author": "Carol Farley", "ReviewID": "RJ3HFTZI3ISQL", "Overall": "5.0", "Content": "We bought this to moniter activity at a remote location and it works very well.Would recommend this product. Works well.", "Date": "March 4, 2013"}, {"Title": "Not overwhelmed", "Author": "Michael L. Sanford \"Bluesman\"", "ReviewID": "R29FYMW7EHC0T0", "Overall": "2.0", "Content": "This probably does what is claimed but it takes me 10 minutes to go though one day's worth of pictures. That's 70 minutes to watch the whole week.  I can't sit still for 70 minutes watching anything.  I may be doing something wrong but to me, it just takes too long to review.", "Date": "January 24, 2013"}, {"Title": "This is a great camera", "Author": "Tracey Mack", "ReviewID": "RUSGLA72IH2H6", "Overall": "4.0", "Content": "Love the concept. Great time lapse images. I would give it a 5 but it does not record night images.", "Date": "December 17, 2012"}, {"Title": "Primos software sucks!!!", "Author": "Sergii Alekseyev", "ReviewID": "R2DREDC6KNHYKP", "Overall": "2.0", "Content": "The camera itself is nice and feels solid. But their software is BAD. Not working properly, takes forever to import images from the card into the program. So far I am downloading pictures from one day of surveillance and it took more than hour (not even half way done). Read this carefully BEFORE you buy this product  https://primos.zendesk.com/entries/21535885-Problems-with-at-a-glance-software-java-7-Build-21", "Date": "August 26, 2013"}, {"Title": "Worst game camera on earth!", "Author": "The Healthy Beaver", "ReviewID": "RMLVROYL9HKV6", "Overall": "1.0", "Content": "I bought the first one because I liked the idea of a picture every 30 seconds regardless of motion detection. Unfortunately, the units display was weird and unreadable.  I returned it for a replacement which actually worked for almost a week.  It fails to power up and the brand new batteries test perfect.  Failure 100% of the time for both units I tried.  Obviously, there is zero quality control as nobody test the units to make sure they work because nobody cares if they work.  I have a dozen or so game cameras that work and will never spend another penny on this junk brand again as long as I live.  Total waste of money! Piece of junk!  Stay away from them and you will be much happier.", "Date": "May 26, 2013"}, {"Title": "Awsome  great deal", "Author": "Mike Rypczynski", "ReviewID": "R3SHRJ7XWWC56U", "Overall": "5.0", "Content": "I bought them for $ 53.00 each  retail is $ 99 to $119.00  each  I put them on my food plot I can see a faint image of a deer or person 250 yards away but can see my blind  with no problem up close with in 50 yards  very clear quality pic for a low pixel cam.  battery life so far 4 weeks and have 35 % battery life left .  over  30,000 frames", "Date": "December 14, 2012"}, {"Title": "Primos DPS", "Author": "Roger", "ReviewID": "RDA1XBW2X1KPR", "Overall": "4.0", "Content": "I am using scan disk cards and it works well, I will try a Lexar card and see if the picture quality is any better but overall the camera is doing what I expected it to. I use this camera to see when deer and turkey are using my greenfields. It has been a useful tools in hunting for me. I wished it had a zoom lens of maybe 2X for better pictures down range.", "Date": "November 2, 2012"}, {"Title": "Primos DPS", "Author": "johnripples", "ReviewID": "R3W4I514USQWOX", "Overall": "1.0", "Content": "Purchased this camera knowing it was not the highest quality product out there, I was very suprised though at just how underperforming this camera as turned out to be. If the camera faces east, there are no viewable picutes until a few hours after sunrise because of the sun, if the camera is faced South, no viewable pictures much of the day because of the sun, if the camera is faced west, no viewable pictures for the last couple of hours of daylight because of the sun setting.When faced north, pictures are better, but if there is any shade, the pictures are very hard to see. I have had the camera out for a couple weeks and have had deer with in 50 yards, but can only make out shapes due to glare from the sun or because of shade, all well after sunrise or before sunset. The zoom is also very poor, when trying to increase the zoom to see people walking about 75 yards away, you can enlarge once and get a blurry picture, the remaining amount the program lets you zoom in is wasted because the picture is so blurry. There may be certain uses for this camera at specific times of the day, but it is not an all day camera.  When the camera is faced away from the sun and the viewing area has no shade, the pictures are decent, however, having neither of those conditions, especially when deer will be moving, leaves very little time to actually take good pictures. This camera is being returned. I hope the Day 6 cameras are better.", "Date": "September 12, 2012"}, {"Title": "be sure to get the right sd card", "Author": "Ken", "ReviewID": "R2VJU3CVQXONC7", "Overall": "3.0", "Content": "For the money the camera is not bad. The picture quality is not to good past 40 yards. Do not buy sandisk sd cards for this camera they will not work. I bought 32gb patriot sd card for my camera and it didn't work either. so now I'm going to try adata 16 gb card.", "Date": "April 12, 2013"}, {"Title": "Primos DPS Review", "Author": "Larry S.", "ReviewID": "R1GND1W4F9SYFG", "Overall": "4.0", "Content": "I would have given the unit a 5 star except that the battery life is not to good if you have it set to 5 second setting. Also, the claim of identifying game out to 200yds is a real stretch! you can't tell much about a deer beyond 30yds actually.That said, you can't do any better with other units really and the price is great on this thing. It also has pretty good picture quality. It is constructed well and does not leak.One of the best aspects of the time lapse is that you can see the direction that game came from and left to as well as when and how long they were there. Most of this you would never get with a motion activated camera. It is a great scouting tool especially for a turkey hunter that is hunting field turkeys, roads or r/w's.For more info you can see the review on my site at guidedturkeyhunting.comI have photo's posted there from the DPS as well as some DPS videos of turkeys.I would definitely recommend the DPS camera.", "Date": "April 3, 2013"}, {"Title": "Love these cameras", "Author": "aluck", "ReviewID": "ROUM54UMOGEFL", "Overall": "5.0", "Content": "First, I only use them for turkey, not deer. Seem useless for deer where I am since most are out between 10 pm and 4 am. For turkey hunting they are great. I know where they are coming from and going to.  I have 5 of these and have not had problems. One note is they seem to like certain cards. I have had no problems whe using sandisk 16gor Kingston cards. Software can be a bit temperamental but works flawless 95% of the time. Please note they only take photos during the day. Turn on at sunrise, or close thereto, and turn off at sunset. Face them east if you want them to turn on early, west if you want them to turn off late.", "Date": "February 18, 2013"}, {"Title": "No Batterys Needed", "Author": "Hermie", "ReviewID": "R2ETZ9R31AT6G", "Overall": "1.0", "Content": "Well When I Was Shopping For A Camera I Saw This One , It Said No Batterys Needed ... While The Others Needed 8 To 10..So When I Recieved This One It Takes 8 aa Batterys & I Can't Seem To Get The Software To Load After Trying Several Times , This Was A Waste Of Money,Im 100% Unhappy With This Product & Would Not Recommend Any One Buy This JUNK", "Date": "August 23, 2012"}, {"Title": "False advertising", "Author": "Bdogjj", "ReviewID": "R24TJQFICBPXEZ", "Overall": "1.0", "Content": "The box for this camara clearly says \"all day\" but it's not. In any weather besides warm and sunny it doesn't activate night vision it even has two pictures that are night vision on the box. Instead of night vision it shows up gray with nothing until late morning I would like suggestions to fix this problem because the little manual only has basic stuff. And getting another camara with night vision is way to expensive. So what I'm saying is don't get this camara try motion sensing ones even if some things don't trigger it it's better than sitting at a tabble for 5 mins looking at gray or the same screen until one deer might show up then it's gone. Plus it says it takes 3 mins top to view everything also false that is when the speed is on high and if its on high you will miss at least half of the animals you did get that is if you do get some (probably not).To sum this up DO NOT GET THIS PRODUCT!!!!! And please reply with suggestions to get night vision free and legally. Thank you", "Date": "April 5, 2012"}, {"Title": "POOR MARKETING MAKES ME CRAZY", "Author": "MARKUS", "ReviewID": "RF2VHG5R0WD0U", "Overall": "1.0", "Content": "I WOULD LIKE TO ORDER AT LEAST ONE FOR MY PARKING LOT, BUT THERE IS NO MENTION OF MAX CARD CAPACITY, NUMBER AND SIZE OF BATTERIES, OR WHETHER IT SUPPORTS AN EXTERNAL POWER SOURCE.  WHY??  HOW DOES THIS HAPPEN?  HOW MUCH OF IT IS INTENTIONAL?  I CAN'T BUY A PRODUCT FROM SUCH A COMPANY. DISGUSTING.", "Date": "April 26, 2012"}], "ProductInfo": {"Price": "$119.99", "Features": "Deer Positioning System (DPS) camera for capturing deer locations\nRecords an entire day's activity in 5- to 10-second intervals\nConstant daylight surveillance; displays entire day's photos in 3 minutes\nBuilt-in LCD screen for adjusting settings; rugged carrying case\nImage software for saving individual photos or emailing clips to friends", "Name": "Primos Truth DPS 'Deer Positioning System Trail and Game Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41lS2v1KpKL._SY300_.jpg", "ProductID": "B004VFQK3Q"}}