{"Reviews": [{"Title": "Good Product, Bad Documentation/Support", "Author": "scrognoid", "ReviewID": "RM7MDMBZQ2UWF", "Overall": "4.0", "Content": "This little item works great.  I hooked it up to a surveillance camera so I could see out the garage end of my house where there are no windows.  It's the perfect size to blend in with the framed pictures on my kitchen wall.When I first hooked it up, the image was washed out and could only really be seen looking up at the screen from below.  I called Night Owl tech support and they offered to repair/replace with a 3 week turnaround.  I went with Amazon instead and they sent me a replacement.  Same issue.  Then I accidentally bumped the power button and up pops a color settings menu.  I dialed down the brightness and everything is fine.I am knocking one star off the rating because tech support should have known this and because the feature is undocumented.  Well, almost undocumented.  After discovering color settings on my I went back to the worthless-piece-of-crap-user-manual that is pretty much the norm these days.  The manual is mostly pictures showing what the RCA and power plugs look like when inserted - seriously, several full color photos of just that.  Sure enough, buried in the PARAGRAPH explaining the function of the power button is a PHRASE mentioning color settings.  No explanation of what the color setting are or how to adjust them (use the audio volume controls), just \"there be color settings.\"", "Date": "June 21, 2012"}, {"Title": "Very nice LCD to monitor security cameras", "Author": "Aveesh Kumar", "ReviewID": "R1LKN4GEVWU6SS", "Overall": "5.0", "Content": "Dual video which you can switch between - single audio. I wish it would show both video feeds at the same time but I couldnt figure out how. But if I hook it uo to a DVR it shows the video as 1 feed or 4 so not that much of an issue.The connectors are not at right angle to the back but face downwards which is like a big LCD but makes it less usable IMHO.", "Date": "May 15, 2012"}, {"Title": "Night Owl Security NO-8LCD 8-Inch Color LCD Security Monitor with Audio", "Author": "Geego David \"GR\"", "ReviewID": "R18BPXGVZOU56K", "Overall": "4.0", "Content": "A little overpriced in my opinion, but works great, it can only accommodate two cameras only, which is a \"con\" as far as I'm concerned, just because it cost so much for a little tiny LCD screen, almost the cost of a full-size LCD television or monitor. But other than that, I keep it \"on\"  24 seven,  the picture is extremely clear, and it is compact enough to put anywhere you may choose to. I am happy with the purchase apart from paying too much for it.", "Date": "April 28, 2012"}, {"Title": "Night Owl Security is a great little security monitor.", "Author": "Kathy M. Roepke", "ReviewID": "R1C9L7LLA2AYHI", "Overall": "5.0", "Content": "Night Owl Security is a great little security monitor.  I mounted this inside of my 90 year old mother's front door.  This is paired with  the GE 45231 Delux Micro Cam video camera mounted on the outside.  The combo works great together.  Now my mother is safe inside and can see who is at her front door so that she can only open the door to known individuals.  This set up gives her peace of mind and she can easily see the monitor while sitting in her easy chair about 10 feet away.  It was easy to install and the screen give a nice view - not the highest quality - but very, very good.", "Date": "December 2, 2013"}, {"Title": "steve shoemaker", "Author": "steve shoemaker", "ReviewID": "R3PZS9TL8WR3JE", "Overall": "5.0", "Content": "works good. But the sound on the night owl is very very poor!! nonexistence..Had to unplug audio cable and put on a separate speaker. this should made aware to the consumer. Im a ham radio nut HA HA. I WORK WITH AUDIO ALL THE TIME PAST 50 YEARS, THANK, STEVESHOEMAKER@TWC.COM", "Date": "October 2, 2013"}, {"Title": "night owl", "Author": "smurf", "ReviewID": "R4EILVL5V817X", "Overall": "5.0", "Content": "nice monitor. real compact with good resolution. The price might have been a little steep but the unit works well", "Date": "September 23, 2013"}, {"Title": "nice", "Author": "awilda mendez", "ReviewID": "R15PPTMTSVVHS4", "Overall": "4.0", "Content": "its a great basic and mobile display for CCTV. not recommended for more than 4 cameras. could have more adapter capabilities", "Date": "September 14, 2013"}, {"Title": "nice to have for a paranormal investigator", "Author": "K-DAWG", "ReviewID": "R15177Q5YRTCY6", "Overall": "5.0", "Content": "I use this product so I can set up my cameras for an investigation. it is small and portable to use", "Date": "September 10, 2013"}, {"Title": "JOHNMOOD", "Author": "JOHNMOOD", "ReviewID": "R18977PUZT7DUO", "Overall": "5.0", "Content": "THE PICTURE QUALITY IS EXCELLENT. I WISH IT HAD THE CAPABILITY TO SWITCH BETWEEN CAMERAS AT A PREDERMINED TIME. I CALLED NIGHTOWL,AND THEY SAID I WOULD HAVE  TO BUY A UNIT TO ALLOW SWITCHING..OVERALL I HAPPY WITH IT.", "Date": "January 15, 2012"}, {"Title": "Great for security boxes", "Author": "Ricky", "ReviewID": "R1L1GLX00JQCWG", "Overall": "5.0", "Content": "Gret product . Fits perfectly in the security box with DVR and other supplies.  A must buy for security where space small to install", "Date": "January 3, 2014"}, {"Title": "SMILE!", "Author": "Texasmomof2", "ReviewID": "R1BKI38F36KGTV", "Overall": "5.0", "Content": "Perfect!  Clear picture!  We do not have a peephole in our door, so we have a camera and are able to look at the screen and see who exactly is at our door!", "Date": "December 12, 2013"}, {"Title": "Owl Security Monitor has synchronization issues", "Author": "Alan", "ReviewID": "RVWDO3KU0X1OQ", "Overall": "2.0", "Content": "This is a poorly engineered unit.  When I connected it to the security system DVR and asked the DVR to switch between the 4 cameras, the monitor lost sync very quickly.  When the is monitoring a single camera, it produced an acceptable picture with good brightness.  Unfortunately, I was unable to find any other small monitors on the market at this price point.", "Date": "August 12, 2013"}, {"Title": "Waste of money", "Author": "Paul G. Ziegler \"Aquaskiier\"", "ReviewID": "R2RJ3VMADU0FBJ", "Overall": "1.0", "Content": "Purchased this monitor and it lasted 1 day before it would periodically become scrambled with no image.  it would stay blanked out for 1 hour before resetting.  I returned it and received a new one which lasted 2 days before same problem occurred.  It's definitely a problem with monitor quality because when picture is scrambled, we can not display the \"AV1\" notice in corner.  We also hooked up another monitor and had no problems.  Very frustrating.", "Date": "June 29, 2013"}, {"Title": "Great little monitor", "Author": "Robert payne", "ReviewID": "R2O8GAZTZ67DH7", "Overall": "4.0", "Content": "Works great, I would of gave it 5 out of 5 but the first one I got went out in two weeks. I then had to get a replacement.", "Date": "June 29, 2013"}, {"Title": "Good but", "Author": "Arlene J.", "ReviewID": "R2A95Z47NXGHCG", "Overall": "3.0", "Content": "A good, simple to set up monitor BUT the channel selection button on my unit started to stick within a couple weeks of use making it difficult to switch between the 2 video inputs.", "Date": "June 11, 2013"}, {"Title": "OK for me, but probably not for other people..............", "Author": "Rl Shuey", "ReviewID": "R4EIA5XPVHSJ1", "Overall": "4.0", "Content": "I need another display for my security system and I had limited space available, otherwise I would not have bought this display, I could have got a 19\" for just about the same price as this 8\" cost, but I needed to fit a hole and this was the perfect size. As it is, this display has a poor stand, poor operating instructions, poor button operation, limited picture controls, a very wide bezel for the display size and etc. All in all I think its old technology at yesterday's prices, but as I said it works for what I need, but most people will find a better bargain buying something else!", "Date": "April 25, 2013"}, {"Title": "Excelent", "Author": "protasio guerra", "ReviewID": "R8ZY5QTV64MLI", "Overall": "5.0", "Content": "Very good. It met my expectation. It looks great on my wall. I do recomend it ! Nice qualite and the screen is big.", "Date": "February 16, 2013"}, {"Title": "My problem...", "Author": "Robert J. Casaletto", "ReviewID": "R16FAC13NEEAW0", "Overall": "4.0", "Content": "It was a 2 camera monitor and that's all I needed. But the Q see DVR was for 4 cameras and I had to either go with one camera for the whole screen or to 2 with 2 empty boxes below plus the size was small. I thought I could get it to flip between camera one and two. Sometimes this old brain bites off more than it can comprehend. Nice screen though. I'll keep it and find some use for it. I always do.", "Date": "December 26, 2012"}, {"Title": "inexpensive monitor", "Author": "B. Lloyd", "ReviewID": "R3QM7STLDWHXK5", "Overall": "5.0", "Content": "All I needed for my security system was an inexpensive monitor for local programming. The picture is sharp and colorful. Doesn't  take much room.", "Date": "November 10, 2012"}, {"Title": "video screen", "Author": "Ray Evans \"Mail Bag Plus\"", "ReviewID": "RW55C7C61LCFB", "Overall": "4.0", "Content": "Quick turnaround product as described. Not much else i can say about a video screen that hooks up to a dvr.", "Date": "June 23, 2012"}, {"Title": "Worst Video I ever saw", "Author": "Jerry R \"Jerry R\"", "ReviewID": "RRLA2HC0AVAH9", "Overall": "1.0", "Content": "I can't believe how poor the video quality was. Returned it after 1 hour of tryng the levels with no decent results.", "Date": "February 24, 2012"}, {"Title": "Does what it is supposed to do", "Author": "Bill Jaffe", "ReviewID": "RQPLHF61GOU5V", "Overall": "4.0", "Content": "Works well, price is high for what it is. Should be like $50 In my opinion.  Tap power button for brightness control. Hold power button to turn on and off.", "Date": "June 23, 2013"}, {"Title": "No brightness contrast control and defaults to a very washed out settings", "Author": "Ali", "ReviewID": "R3AX8NU5BCG46Z", "Overall": "1.0", "Content": "We got one of these displays for a closed circuit monitoring application , basically it is useless, it has no means to change the contrast or brightness (I imagine it meant to do it automatically) and it defaults to a very very washed out settings that basically could not be used, maybe if your camera is seeing a daylight scene or you have a good light source on the scene it may give a better result.", "Date": "September 13, 2012"}], "ProductInfo": {"Price": "$99.99", "Features": "8\" color LCD screen\nCompatible with all Night Owl 4 and 8-channel DVRs and cameras\n2-channel Video Inputs with 1 Audio input\nWall-mountable with retractable stand\nIncludes: 8\" color LCD with mounting screws, BNC to RCA connector, RCA to RCA connector and UL power adapter", "Name": "Night Owl Security NO-8LCD 8-Inch Color LCD Security Monitor with Audio", "ImgURL": "http://ecx.images-amazon.com/images/I/51bQAP7tdbL._SY300_.jpg", "ProductID": "B004MUCOBW"}}