{"Reviews": [{"Title": "Great surveillance system! Easy to installed A++", "Author": "T3nstaller", "ReviewID": "R1O47FFMNJVVNY", "Overall": "5.0", "Content": "I was looking for a device that is able to monitor more than one location at once. So I read through this unit's overview and found it is capable of what I was planning to do. I bought four sets of DIY kits with the same DVR, one comes with 8 cameras, the other with 5  & 16 cameras. I did spent a good few hours installing these units for my customer on each locations. I love the quality, and the flexibility what i can do on this DVR. Now, my customer  is able to view both 4 office locations on a single remote screen.As far as the video quality, those CCD cameras are giving me way better and clearer images than the old CMOS ones. Now my customer, can view all the locations, and be able to monitor their offices and stores.  Customer Services is beyond my expectation, great service and support. all the technician is very knowledgable and resolve the issues quick.  This system can be access over the 3G mobile phone device, which is a PLUS for my customers.", "Date": "June 15, 2011"}], "ProductInfo": {"Price": "$499.99", "Features": "D1 Real-time Recording and Playback. Recording 720x480 resolution at 30 Frame Per Second on 4 channels or 18 FPS on 8 channels. Recording 720x240 at 30 FPS on each channel\nSupport UPnP, No port-forwarding is needed\nDVR Motion detection triggered events can be promptly notified by loud audible alert and / or Email notifications to PCs or smart phones\nConfigurable per channel, Surveillance Signal Loss, Motion Trigger, Audible Alarm, Alert Durations, Recording Log Management\nLive view and access control through Internet Explorer, Firefox, Chrome, and Mac OSX/safari. Streaming live video on mobile smart phone via free app", "Name": "Aposonic A-BR18B8-C500 8-Channel H.264 Professional CCTV Surveillance Security Camera System with 500GB HDD / HDMI Output, Mac Ready", "ImgURL": "http://ecx.images-amazon.com/images/I/41i9PAkNO1L._SX300_.jpg", "ProductID": "B004PYD8ZG"}}