{"Reviews": [{"Title": "CASIO  EXILIM EX-ZS10", "Author": "A. Solano", "ReviewID": "R385T0YIAY0HRU", "Overall": "2.0", "Content": "Very poor quality images, both still and video.  Cheaper cameras give you better quality, Kodak, Canon, Sony, Olympus, Pentax, Samsung, Panasonic, GE, Fuji.This Casio gave me the worst quality images and video among the brands I mentioned.No more Casio cameras for me, I'll just purchase watches or calculators from Casio.", "Date": "July 29, 2011"}, {"Title": "Sample of the video recording quality and quick impressions", "Author": "W. Taylor", "ReviewID": "RN3Q7RCZ0YRBH", "Overall": "4.0", "Content": "Here is an example of the video recording in various situations.  The only other digital video recorder I've used was an older generation Exilim (7 MP model) and a really crappy cell phone from like 6 years ago so I'm not really sure how it stacks up compared to other products like digital cameras and Flip-type camcorders.Sample footage - [...].  Information about transcoding and the camera settings are inside the link.The photography aspects seem on par with what I'd expect out of a camera, although the manual focus leaves much to be desired.  The still image quality is really good when you resize 14.1MP images to something in the area of 720p or lower.  At it's normal 14.1 MP resolution the images are grainy with a lot of noise and speckles.  To be fair though, this camera is pretty cheap in price so maybe that's to be expected.  Plus, if you really need huge images (like 4000x3000) to look great, you're probably going to go for a better camera.", "Date": "March 28, 2011"}, {"Title": "ligh nice easy to use camera, BAD pictures quality too bad", "Author": "HHetze", "ReviewID": "R2M4GY79MPVUHF", "Overall": "2.0", "Content": "it is a NICE easy to use camera the battery lasts forever, too bad that Casio did not put more efforts into the pictures quality, they are BAD. I bought it as a gift and now not sure if I should return it or what.", "Date": "August 20, 2011"}, {"Title": "excelente", "Author": "GABRIELA", "ReviewID": "R26UG9JZXC501O", "Overall": "5.0", "Content": "excelente producto lo recomiendo es muy bueno cumplió con todas mis expectativas y el envio fue rapido seguro y confiable", "Date": "November 23, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.1 Megapixels with 720p HD Video\n5x Optical zoom with 26mm wide angle lens\n2.7 inch 230K LCD monitor\nFace detection\nEasy mode with 23 Best Shot Modes", "Name": "Casio Exilim EX-ZS10 Silver 14 MP Stylish and Slim Digital Camera with 5x Wide-Angle Zoom and 720p HD Video Capture", "ImgURL": "http://ecx.images-amazon.com/images/I/41G4ce-K1cL._SX300_.jpg", "ProductID": "B004HYGDJ2"}}