{"Reviews": [{"Title": "Very decent camera for the money", "Author": "brownie", "ReviewID": "R3B1Y6C9YULQAK", "Overall": "4.0", "Content": "I currently own an Olympus DSLR (E-410), along with a Olympus SP-550UZ super-zoom camera.  I decided to buy this camera because I wanted a pocket camera with a nice zoom lens that can take decent quality photos and I received an email from Olympus saying I could get $50 off at select retailers.  Disclaimer: I have only had this camera for a couple days thus this review is only based off of a small amount of time of hands on time with this camera.First -- Image quality.  If I compare this to my DSLR; the DSLR will beat this camera and my SP-550UZ hands down.  There really is no comparison.  But if I compare the image quality to other camera within the VR-320's class my opinion would be that this camera easily succeeds the other cameras in terms of image quality.  The color is outstanding; oranges are ORANGE, blacks are BLACK, blues are BLUE, reds are RED, etc...  Detail in the photos is also great.  I don't really know how to describe detail but I will try.  Ex) Took a photo of a person holding a Cheeto.  The person's face, clothes, Cheeto bag, and Cheeto were all extremely crisp and well defined. The photos I took that achieved this image quality was on a moderately cloudy day with plenty of light.  ISO was set at 80 and white balance was on Auto resulting in the camera using an exposure time of 1/1600th of a second and an F-stop of f/3.  Jacked the ISO up and took some pictures at ISO of 400, 800.  Well, I'll just say that you should never use an ISO of 800 or more on this camera unless you have a program to remove all of the noise.  Even at an ISO of 400 there will be plenty of noise to be concerned about.  Also, even if you have a program to remove the noise you will lose most if not all of the sharpness/crispness of the photo.  (Neat Image works pretty well to remove the noise)Second -- Ease of use.  Well, this is purely opinion so I won't elaborate.  Since I own two other Olympus cameras I found the menus to be well thought out and easy to navigate.  Much better than my 4 year old SP-550UZ and my 4 year old E-410.  I really like how when given the option to change the Exposure Compensation and the White Balance it has a real time view of the current setting along with a real time view of the other settings right next to the current setting.  That's just pretty sweet!  Body is very nice and small.  Great pocket camera.Third -- Video quality.  Wow, just wow.  In a bad way.  720p HD video at 30fps.  Sounds pretty cool.  But no, it really isn't on this camera.  As a previous reviewer mentioned; yes, the colors were there.  The quality was atrocious though.  I'm on a college track and field team and we videotape each other usually using my SP-550UZ.  Decided to try this camera due to the 'HD'.  Just downloaded the videos, so much \"noise\" within the video itself.  Not sound noise but just artifacts within the video.  My blues are blue and so on but the quality of the \"video picture\" makes the video basically unusable.  This was on a bright sunny day.  Looks like it was a lower resolution video just unconverted by the camera itself to 720p.  Not good.  But, I bought this camera to take pictures, not video so I will only knock a single star off for this inconvenience.Fourth -- Performance.  Right around 1 second from power button to ready to take a picture.  Nice.  Focus was much better than I expected; thus it was very fast for a point and shoot camera.  Once you start zooming in focus will start to take a little longer but this is understandable.  Zooming is pretty fast.  Really like how you can change the Auto Focus Mode to AF Tracking.  Position it on the subject, press OK, and the camera will do it's best to continually keep the object in focus.  Pretty neat.  Position of the flash = horrible.  That is right where your finger goes so be careful.  Outside in bright sunlight the screen works remarkably well.  Still pretty crisp and vibrant and not too washed out.  Very easy to use outside and achieve great photos, inside will be difficult due to keeping the ISO down.  This is where you would use the flash, which seems to work pretty good resulting in decent pictures.  Image stabilization works, not much to elaborate on here.  Works pretty good taking action shots, wouldn't buy it just to take action shots but it works.And lastly just my 2 cents.  Even knowing these faults I believe that I would buy this camera again, there would be a slight hesitation but I would buy it.  I was looking forward to the HD video but all's that I wanted was a point and shoot pocket camera with a nice zoom lens.  Which the VR-320 fulfills very nicely.  I am a very experienced photographer and always shoot in full manual.  Going from being able to adjust everything to only being able to adjust the ISO, White Balance, and Exposure is not fun but this is a point and shoot camera - period.  Truthfully, it's kind of fun just taking this out and taking a picture that you know will be good!  Hopefully this will help you make a decision as to whether or not you will purchase this camera.  We all have different needs and wants and this camera fit what I needed and mostly of what I wanted.If you have any questions just comment on this review and I will try my best to answer the question completely.", "Date": "May 7, 2011"}, {"Title": "Great No Frills - Compact Megazoom Camera", "Author": "Reeljuals", "ReviewID": "R2HA9GASO324LJ", "Overall": "5.0", "Content": "I currently have a 5 year old Canon Digital Elph and have been looking for a compact megazoom.  My knowledge of camera features and operation is very basic.  I don't know how to use manual controls and am not interested in learning.  My needs are simple - compact, easy to use, at least 12x optical zoom and no frills with decent picture quality that I can point and shoot.  Set up was a breeze and I didn't need the manual.  I've been playing around with it out in the yard and indoors.  The pics look very good to my amateurish eyes. Price is also right.  I wasn't able to find a comparable camera with similar features in this price range. All in all, I'm quite pleased.I finally had a chance to use the video mode.  Using 720P, the colors were very sharp and true in color.  Using video is very simple.  There is a red button on the back of the camera and just pressing it will activate video and pressing a second time will end the video.  If you need to use zoom, it must be enabled prior to depressing the video button.  Once video is activated, zoom is disabled.  Although, not in stereo, sound is very good - and not \"tinny\".  It picked up the chirping birds, my footsteps in the grass, a neighbors dog barking, etc.  I can't comment on action videos as I've not had a chance to use it for that purpose.For the price, this camera is a real deal.9 May edit/clarification:  Optical zoom can be enabled during video recording without sound, i.e., microphone must be turned off.", "Date": "May 5, 2011"}, {"Title": "The Wide Angle Is The Buying Point", "Author": "PatRM \"PatRM\"", "ReviewID": "R3AH8TBHL9X7YH", "Overall": "5.0", "Content": "This camera is very basic, and does not cost a great deal.  The selling point is the 24mm equivalent lens.  For those of us that have been shooting pictures for 4 or 5 decades, the wide angle lens is one of the most forgotten items in new cameras, and maybe it is because, as one reviewer said, it is basic and I'm not interested in learning anything beyond that (I paraphrase).  A 24mm equivalent which is about 86 degree angle of view will give the user one more option for creativity.  At the price, I would buy this camera if it only had that lens and nothing else.  As far as the review stating that the higher ISO rating (800, I think) is bad, it usually is for most digital cameras, and when that rating was applied to film, it didn't produce great results either.  I'm rating this camera at 5 stars because I believe the rating should be tempered to the product.  One cannot expect miracles at that price.  When this camera is used as a camera, and used with a low ISO rating, which I do most all the time, it produces excellent results.  Olympus does not put out, as one reviewer stated, pardon my language, CRAP.  They also stand behind their products, and always have.", "Date": "July 13, 2011"}, {"Title": "Surprisingly good camera for the money", "Author": "Barry Brown", "ReviewID": "R25P1UUFBFSA0Y", "Overall": "5.0", "Content": "I just bought one of the Olympus VR-320 silver cameras to try it out at my niece's Upward Football game today, and I am more than pleased with the results. It is very easy to use (which is great for a point and shoot camera - I don't really want to have to take a lot of time fooling with one when I just want to take a quick shot) and the menu is laid out nicely. The time it takes to turn on and to be able to use is very fast, too, as well as when I want to take a shot of anybody in motion - the camera is very responsive and takes shots quickly (another reason I wanted a camera to keep up with my niece running and moving!).The pictures come out sharp and with great color, and the 720p video is a bonus with nice sound. I can highly recommend this camera, and I'm glad I bought it!", "Date": "May 7, 2011"}, {"Title": "An Impressive little Machine Indeed!!!", "Author": "Jeff", "ReviewID": "R94R51B7CONMN", "Overall": "5.0", "Content": "I was drawn to this Camera initially by the File Size it was capable of. Also, the extreme zoom range....WOW! I am not a fan of video. I owned a Handycam once.Yawn. Too complicated. This Bad boy has HI DEF VIDEO in the camera. Push the red button to begin filming...push it again to stop. Creates awesome/tack sharp/true color .AVIs. I'm a convert! Did I mention the zoom range. I'm a retired Architectural Photographer from the 4X5-Medium Format-Generation. So, I'm WIDE ANGLE. This Bad Boy sports what feels like a 20 mm wide angle (on 35mm Camera). Then, reaches out to 400 35mm equivalent  SHARP AS A TACK-NO BIFRINGING and this is HANDHELD-imagine if I had used a tripod. It's got whats called dual image stabilization I think . It works. The filters are pretty cool (I like the Fisheye at Car Shows) Like all Point and Shoots, there is no viewfinder so composing in bright light kinda sucks. I just might make myself a viewfinder shade for about One penny (a paper Coffee Cup with the bottom cut out) because this is one sweet/powerful/COMPACT super zoom with HD Video for basically Chump Change. Swoop on it!!!", "Date": "September 1, 2011"}, {"Title": "Very good camera for this price!", "Author": "Richard", "ReviewID": "R3NFB0TC1YONTE", "Overall": "4.0", "Content": "I purchased an Olympus VR-320 several weeks ago. As an owner of several Olympus products, I was drawn to it by brand name, and also the feature set (primarily the 12.5x zoom lens, with an equivalent to 24mm in 35mm camera lens at the widest).  The price was very reasonable, and the camera seems well made.  This Olympus uses SD memory cards, which is a big plus from the xD cards of not so long ago.  Writing and buffering images, and also deleting bloopers is much faster with the SD format.  My computer can download the images from an SD card much more quickly than the xD also.  Start-up times, lag between zooming, etc. in performance terms to my mind seems no worse than my other models, and to some of them the -320 is faster.  Image quality; at first my images appeared somewhat dull using applications already on my system, so I was adjusting contrast primarily.  Today (slightly embarrased..)I finally used the software which came with the camera; downloading and viewing the card with this program the previously mentioned images now appear much sharper and vibrant.  Little to complain about now.  I'm pleased with this camera now, and would recommend that people give it a try.  Helpful hints for most folks; leave the camera on the default settings and use the iAuto mode.  For most uses, this is fine.  I've not tried the Panoramic feature, but the art filters and scene modes as in the Olympus models are interesting (I enjoy the pin hole camera effect most).  There is very little manual control with this model, so if you want features such as Manual, Shutter and Aperture Priority settings you will need to shop for an advanced model.  For a handy walkabout camera, this is a very good choice.  I had no problems adjusting to the menu layout and feature selections (using the thumb toggle and menu buttons).Slight quibble; you must charge the battery via USB cable to a computer if you do not have the correct charger for the battery (which I fortunately did).  Battery life unless you review and playback a lot, or use a lot of flash is okay for an outing though.I gave this camera a 3 star rating on Dpreview, but am bumping that upwards here thanks to the better performance with the Olympus software.", "Date": "December 10, 2011"}, {"Title": "Inconsistent results with my VR-320", "Author": "mandopickr \"mandopickr\"", "ReviewID": "R3TRMX45W817DJ", "Overall": "2.0", "Content": "I bought this VR-320 to replace a Nikon Coopix L24. The L24 gave me some great shots, but I was looking for a travel camera with a longer telephoto lense. Somehow I envisioned this camera as a longer lensed L24. I was wrong.First, it is a nice compact size. It seems to be well made, and fairly light. It will fit easily in my front pocket.Start up is quick, and it writes fast to the memory card as well (I use a Class 10 card).The menu is easy to follow, and the lcd screen does reasonably well in daylight.I don't use, nor do I plan to use the video function.As for photo quality, the best thing I can say is its disappointing. I have had this camera for over 60 days, and have worked to find a way to correct some of the photo issues, without success. I should have returned it in the first 30 days, but I kept thinking it was some issue I was missing in the operation of the camera. Often the images are blurry. You can take two or three shots that all blur, then you'll get a couple that are fine.As for flash, it is very inconsistent. I have taken three photos all of the same fixed subject, and had three different exposures. All were bad, with the flash highlighting different areas each time, but never an even exposure.(This was from about 6').Low light photos are not very good, and one would normally use the flash to improve the exposure, except the flash doesn't help.The best shots I have gotten have been outside with plenty of sunlight at iso 100.I have taken this camera to several events where I didn't get one acceptable shot. This last week I have taken test shots in various scene modes, iAuto, and manual mode. I haven't been pleased with any.The best shots I have gotten have been with plenty of sunlight at iso 100.Maybe I got a bad camera, but I cannot figure what area would be bad, the sensor, the vr, just don't know. This I do know though,I am tired of taking this camera with me and having nothing to show for it. With the holidays upon us, I plan to purchase a new point and shoot tomorrow, and later sell this camera for whatever I can get on ebay.My background: Art major which included photography, including several prize winning photos. I currently use both slrs and dslrs, but like having a point and shoot with me for those unexpected photos (and while traveling).", "Date": "December 19, 2011"}, {"Title": "Inexpensive Versatile Digital Camera", "Author": "raybot1", "ReviewID": "R38FP9YI7907OC", "Overall": "5.0", "Content": "I purchased this camera after looking at it in a store. I had recently dropped my Canon Powershot ELPH 300 and totaled it due to the lens being extended, so I needed another camera. I initially saw it for the same price as the Canon but after looking around found it here much less expensive. I considered it and decided to go with the Olympus VR-320 due to the high zoom features and image stabilization. After experimenting with the settings which are very varied for a point and shoot, I found my colors sharp and clear. You choose the correct setting with the help of image review and can shoot all your scenes perfectly. To be honest you have to change the settings for each type of environment. Whether it's the ISO, type of light or exposure compensation your pictures will come out right. The camera is able to shoot very clearly even at high zoom. Something I have not seen with other point and shoots. The Canon had one feature that I particularly liked and that is you could zoom in and out while you shoot video. But the Olympus has greater range, settings and impressive zoom. This camera has a solid feel to it as it is constructed of a all metal body, very professional looking and a lens equal to some SLR cameras. The battery life is great and you can shoot all day on one charge. As with most cameras in this range you can shoot on auto and let the camera select each variable or once you get used to it select your own for your particular tastes. At this price you are getting a professional point and shoot rivaling more expensive cameras. Great camera.", "Date": "March 6, 2012"}, {"Title": "Camera for me!!", "Author": "Kezi", "ReviewID": "RIFOZH8IB0ZLV", "Overall": "5.0", "Content": "I recently bought this camera and it takes great pictures. I previously had an olympus fe280 and when i used all the zoom to take a pic, it would come out a bit grainy. This camera though takes wonderful pictures using all the zoom. Videos are good as well as close up pics. This is a great camera for me :)", "Date": "August 5, 2011"}, {"Title": "Great little camera... lots of potential.", "Author": "Amy Brown", "ReviewID": "R2C40QT0A452KI", "Overall": "4.0", "Content": "I bought this for the zoom, and it doesn't disappoint. I recently took it to a concert and was super surprised at how great the pix were. I just used the auto setting so the quality could've been a wee bit better, but Bono looked like I was like in the front row and I was so not! For video, well...meh...sound was awful, but it was a loud concert. Image quality was pretty good though. There's a a lot of manual potential if you know what you're doing with that, I'm more of point and shoot. But for the money, this really is a great little go-to camera for your everyday needs. It's small and easy to use, I will say that in review mode, you have to be a little careful not to push the menu button and delete your photos.", "Date": "July 21, 2011"}, {"Title": "Less than a year old and no longer useable", "Author": "Tom Newby", "ReviewID": "R31SLYP2FONPA2", "Overall": "1.0", "Content": "This camera has great specs.  I bought it for the very-wide to high telephoto lens and because I had good luck with an Olympus camera before.  It has never worked at full zoom -- it either un-zoomed itself or was out of focus.  When used at other zoom lengths, the pictures were OK but not nearly the equal of those taken by a Panasonic camera I foolishly replaced with the VR-320.  Low light performance is very poor.  Macro shots were uniformly excellent, though.After a few months of use, it now will no longer focus dependably at any length in any light, so it is basically unusable.  Sometimes the pictures are great, sometimes an unfocused worthless mess.  That is really unacceptable for a product less than a year old.  I am going to ditch it for a Nikon.", "Date": "December 26, 2011"}, {"Title": "Great for the daytime with lots of sunshine, not so for night time", "Author": "Lucis Ferre \"Lucis Ferre\"", "ReviewID": "R295P4YMLWR648", "Overall": "1.0", "Content": "The sensor on this camera is not that good. It takes great pics during the day and the zoom is good too but the night time pics is a little disappointing.UPDATED 6/10/12Again disappointment. I took pics of an event that was kept indoors. They came out so dark. I tried both the manual and auto settings. Bottom line, don't get this camera if you plan to take pics of anytime when there is no sun. Get a Canon & avoid my mistake.", "Date": "October 7, 2011"}, {"Title": "Not bad.", "Author": "RicknATL \"RicknATL\"", "ReviewID": "RZBWKYALJHSF5", "Overall": "3.0", "Content": "I had initally bought the VR-310 from costco (10x zoom), but when I saw the VR-320 (12.5 zoom) on sale at staples, I took back the 310 and got the 320. Thus far, I have been pleasantly suprised with this camera. The pictures are fairly decent as is the video. I want a basic high zoom pocketable camera and that is exactly what this is. I do tend to shoot with lower megapixels setting than the 14 (who needs 14mp?), and locking in the ISO at 100, thus my pictures might be benefiting from those settings versus what others have noted. Add in the availability of an underwater housing for scuba diving, and I can't complain at all.", "Date": "July 25, 2011"}, {"Title": "Happy!", "Author": "Robyn Demeuse", "ReviewID": "R3H2SVK5L0YKL0", "Overall": "5.0", "Content": "Good camera. Takes nice sharp pictures. Computer programs for it are a little overwhelming and will take some time to figure out how to get the max use from it. Not as userfriendly as the one that came with my previous Kodak camera. Camera itself is easy to use. Love the scene selection for pets. You don't get the green eye in the picture.", "Date": "January 18, 2012"}, {"Title": "Funny how it all depends...", "Author": "Lance Kozlowski \"Lance\"", "ReviewID": "R1JQOITKDI4XM7", "Overall": "3.0", "Content": "I've owned two Oly point and shoots before, that offered great images albeit with some camera-performance quirks. I bought this camera for my wife this year and I must agree with some of the other reviewers who find it makes messy images sometimes. It seems to need a lot of light and several tries to deliver the sharpest images it can deliver, which can be good, but other times it makes pictures with grainy darks and almost a \"paint-filter effect\" on other surfaces and edges. I was considering returning the camera, but it turns out my wife loves it. The lack of critical sharpness that most of us search for is not apparent on the screen unless you really zoom in, which she doesn't do, and she rarely prints an image, so the pictures look fine for her purposes. The color is great and the exposure is fine. Using the camera is a joy, quick startup, large viewscreen, and easy controls that are large enough to use without reading glasses. As an added bonus, the creative effects mode offers a filter that makes a line drawing of scenes you shoot. It had us both fascinated and laughing the first night we used the camera, she loves it!", "Date": "December 18, 2011"}, {"Title": "So so product behind its time", "Author": "Kevin \"The traveler\"", "ReviewID": "R53MJTSNDHRK5", "Overall": "3.0", "Content": "Just bought this one on Amazon a few days ago (seems like Amazon has the best price so far) and tried it out several time. I don't know what Olympus is doing on the crowed point-and-shot long zoom camera market, this stuff is basically other makers' 2009 model, just a little higher pixels. It's re-cooking the left over dishes. It does work for those who really are tech-challenged since it is very simple to use and there is not much adjustment buttons or menus to be fooled around with. You just turn the power on and start shooting, and when power is lower, you don't take the battery out but you connect the power cable to the bottom of the camera for charging.I have owned five pocket sized cameras now. The reason of getting this is I want a very light weight and small long zoom camera and some newer models are getting heavier and bigger. But this one I don't think I will keep since it does not stand out on any ground. I don't like to return stuff if not for quality issue itself so I may give this one as a gift to some family member. For this price, or if you want to add about 20 ~ 30 bucks more, you can get Sony HX5v, last years' model but with the same size with a lot more features, better HD video, and GPS. I think in the past 3 years the best small point-and-shot pocket size camera is Fuji Finepix F-70EXR which is a 2009 model. For these cameras newer model don't necessarily get better. I really don't feel more than 10 MP on the point-and-shot camera is that useful since the photo quality from these cameras really don't improve with more pixels, it just takes up more memory cards' space. Better pictures will have to be taken by SLR cameras, if you want to carry those heavy bags with you. I have one but hate to carry it around so I do like a good pocket sized long zoom.Pros:Long zoom, wide angel (24), small size, light weight, simple to use (not for those who wants more menus), date can be printed on the photos taken.Cons:Just an old model be remade in order to sell with a higher price; so-so photo quality, no real HD video, no zooming with video on.", "Date": "July 5, 2011"}, {"Title": "Bad Quality", "Author": "Gabrielle", "ReviewID": "R6B0WKPI25SD1", "Overall": "1.0", "Content": "This camera is terrible. It's a good size and feel and the menus are very easy to use, but the quality of the photos is poor. My pictures came out VERY grainy. I didn't think that would happen because of the higher megapixels, but I guess not. The colors came out exaggerated when the flash was on. They didn't come out on the camera as I actually saw them with my eye, but much darker and more saturated at the edge of the photo and too whitened in the middle. When I turned the flash off, the colors came out right, but the slightest instability in my hand blurred the picture and it wouldn't focus well. In no way can this camera take action shots. The panorama is confusing to use. I found the instruction manual difficult to understand or make sense of. I tried swithcing through all of the options to take a picture and no matter what I did, all of the pictures appeared the same to me. It's slow to take pictures and takes time to refresh before taking another. I am a teenager who is looking to take pictures of my friends and nature. But people come out with shiny faces with the flash or blurry without it. It's performs terribly in low-light. Yes, there is crazy zoom on it, but it's bad quality. I'm not well-versed in cameras, but I understand basics. I'm willing to learn more in-depth, but the instructions weren't helpful. I'd just like to take a clear and crisp picture easily with minimal effort. Looks like I'll have to invest more money to get that quality.", "Date": "December 29, 2011"}, {"Title": "Such an AWESOME Camera", "Author": "Jacquie Grinley", "ReviewID": "RCDBEXSG78WTC", "Overall": "5.0", "Content": "I purchased this camera because I was looking for a camera that had more than 3x optical zoom. This camera has 12.5x optical zoom and it takes AMAZING pictures. I love it. I went hiking today and not only did it take spectacular pictures, but there is also special effects that I wasn't aware of until I was fiddling around with the settings and the special effects are FANTASTIC! My favorite one is the sparkly one, and it makes all your pictures look magical! I cannot wait to go other places and use this camera. I am just so excited.Totally worth the money you are spending. I would recommend this camera to anyone. It's a simple camera, nothing too complicated.", "Date": "August 8, 2012"}, {"Title": "Not a bad little camera", "Author": "Norm", "ReviewID": "R1F8LF70SPDJ4X", "Overall": "3.0", "Content": "If you plan to buy this camera make sure that you also buy an anti glare screen protector. You simply cannot see the screen in a sunny condition. We put a screen protector on and it works great. You also need to be VERY STEADY when at full zoom. Picture quality is good and the included software is fairly easy ti use.We bought this because we wanted a small easy to cary camera for every day use and this fits the bill.This camera is hard on batteries. You only get to take about 45 to 50 pictures before the battery goes dead. Be sure to buy an extra battery to take along if you plan to take a lot of pictures.Overall I would recommend this if you are looking for a small, multi functional camera.", "Date": "May 26, 2012"}, {"Title": "Great Camera.", "Author": "Fred Pisa", "ReviewID": "R22G4H41PMBJM7", "Overall": "5.0", "Content": "This camera is very small and easy to keep in a shirt pocket which I don't do because it is not the safest place to keep a camera.I keep the camera in a belt case it is very convenient place to kleep a small camera.I am very pleased with this Olympus camera which I purchesd from Amazon.", "Date": "May 10, 2012"}, {"Title": "hard to get use to", "Author": "DJ Jazzy Rich", "ReviewID": "R3BKVCRRJAAVNP", "Overall": "3.0", "Content": "I purchased this to replace my 8-year old digital camera.  This might be a great camera but I'm still learning.  Over 600 pictures taken in the first two months and I'm still trying to get a clear picture.  I've tried every setting numerious times.  With so many settings, I have lost a lot of great moments because of blur or odd coloring.The program for loading your pictures on to computer is really slow and far too complicated.  My old Kodak digital downloads were far easier.I purchased this because of the better sounding reviews.  I wish I had gone with another brand.", "Date": "January 6, 2012"}, {"Title": "Nice zoom, poor sensor", "Author": "stevencandy", "ReviewID": "R1CNK84ZXJK1RT", "Overall": "2.0", "Content": "I have a DSLR but wanted something smaller for backpacking, and this looked like it fit the bill.  The zoom was great, but it would usually only focus on the closest object, so for landscape shots with things in the foreground, only the object in the foreground would be in focus, and trying to make it focus elsewhere usually didn't work.  Also, if there were areas of shade and sun, the picture was washed out.  Any motion at all of the subject resulted in blurring of the entire picture.  The net result was that nearly half of all shots were out of focus and/or overexposed.", "Date": "September 6, 2011"}, {"Title": "olympus", "Author": "Eric Wilson", "ReviewID": "RUIQVF0XJ8JF7", "Overall": "5.0", "Content": "Words cant describe the value I think i got on this camera.  The zoom on it is huge for a pocket camera I mean huge.  Takes awsome pictures. it is a good value just buy it.", "Date": "July 2, 2013"}, {"Title": "Excellent pictures and zoom for the price", "Author": "cb@northernvirginia \"cb@northernvirginia\"", "ReviewID": "R29K1TAHPIIYKN", "Overall": "4.0", "Content": "This is my second one of these.  Unfortunately, the first one was dropped from about 2 feet onto a concrete walk on the corner where the zoom & shutter buttons are located.  Bent the corner in so the controls no longer work.  End of that story.  Cost far more to repair than to replace.  I love this camera.  The optical zoom and simple controls are great for point and shoot style photography.  It would have gotten 5 stars if (a) it truly fit in my pockets and (b) it was built to have a bit more strength.", "Date": "December 5, 2012"}, {"Title": "Excellent value!", "Author": "Rebbratt", "ReviewID": "R1H2CXPW3N8II7", "Overall": "4.0", "Content": "For the price, this is the best digital pocket camera I've seen.  Its features and quality are outstanding and it works better than advertized!", "Date": "October 30, 2012"}, {"Title": "Great little camera!", "Author": "skgerber", "ReviewID": "R1UAC6WOQUWOOX", "Overall": "5.0", "Content": "This is a very handy camera, with a decent optical zoom for photos and video.  It's easy to use, and the pictures look great! I wanted a zoom camera that fit in a pocket so it is easy to bring along to festivals and events.  I am very happy with this camera!", "Date": "May 25, 2012"}, {"Title": "Love this camera!", "Author": "LW \"LW\"", "ReviewID": "R1VPLCCJAFLVB7", "Overall": "5.0", "Content": "This camera is an incredible value... It is extremely compact, the screen is a good size, and the zoom is INCREDIBLE for such a small camera. My only complaint is the video feature. The audio is pretty fuzzy and there isn't much stabilization no matter how still you keep it. But if your main objective in buying this camera is taking pictures, you can't go wrong... Great value!", "Date": "May 24, 2012"}, {"Title": "GREAT CAMERA!", "Author": "Lissette", "ReviewID": "RW41RU47EZ2S8", "Overall": "4.0", "Content": "Great price for a great little camera! Easy to use, quick snap shots and decent zoom. Would recommned to anyone.", "Date": "May 11, 2012"}, {"Title": "Grand little Camera!", "Author": "Judie's OOAk Dolls", "ReviewID": "R20RM0BWRA8CNZ", "Overall": "4.0", "Content": "My objextive was to find a reasonably priced camera that would allow closeup photos. I make small scale dolls and without the closeup photos I couldn't show the online buyer any important details. This one does it all, including very good close up focus. Results are good. Recommend it to all.Judie St. Onge, Port Orange, FL", "Date": "April 26, 2012"}, {"Title": "This camera is AWFUL!! PLEASE READ before you buy!!", "Author": "Its Not Important \"Private\"", "ReviewID": "RZDU421EQ27H7", "Overall": "1.0", "Content": "I will start by saying that I am an amateur photog who often gets a lot of compliments on my photos on Flickr and other sites because of the angles, shot selections, etc. For many years, I used a Minolta DiMage, which captured AMAZING scenic shots that required little editing. I don't know if the standards are just very low these days or what, but it was very frustrating when I tried to find another camera to match the quality of photos of the Minolta earlier this year. I tried them all in the $150-250 range - Canon, Nikon, Sony, and yes, Olympus. But they all required significant editing and time in Photoshop and Picasa in order to make the pictures even baseline decent for anything more than sharing on Facebook or your phone. Eventually, I will upgrade to a D-SLR but I guess Minolta spoiled me into believing that you CAN get a quality picture without dropping a mortgage payment.PRO'S: I did not find this camera too hard to set up, though it has some quirks with confirming settings. I HATE the 'magic' scenes because it's very difficult to figure out how to turn that nonsense off for folks who like semi-raw shots. Also, I do like the separate video button, and the zoom has its appeal (though not for long). The video is decent, though I didn't buy this camera to shoot movies, I bought it to take decent PICTURES.CON'S: I don't have the time to go into all the CON'S of this camera - I will just say that I now understand why Staples sold it to me on sale and strictly enforced the 14-day final sale policy (with a disposable product like this, who can blame them!!) First, the picture quality is TERRIBLE. I haven't taken a single shot with this camera that did not require extensive editing in Photoshop and/or Picasa. It's almost like shooting a sketch!! While there isn't a lot of graininess, the pictures are almost water-color in nature. I'm not a nervous person so mind you, I'm not confusing picture sharpness with operator movement. No, this is something inherent in the design. Next, while this camera has an impressive zoom on the surface, it takes FOREVER to stabilize. No matter how steady your hands are, it shakes when trying to zoom in, requiring me at this point to literally shoot SEVERAL shots of the same picture so that I can select one when I view them at the end (I've learned from painful experience that this is NOT a camera that you can rely on for single-picture quality shots). Whether you use the pre-set modes or use their semi-raw modes, it's very difficult to get true colors or exposure, again, without extensive editing. I've played with the pre-sets and set the ISO levels on my own from previous photog experience, but nothing seems to work with this thing. The panoramic mode is \"interesting\", and that's NOT a good thing. I STILL haven't figured out how to use it (though it was straightforward on other brands like Sony).Best use: work-related pictures (e.g. shooting real estate, cars, etc - anything that doesn't have a lot of personal value to you!)All in all, there's no way I'd recommend this thing to anyone, in fact, I'm looking for a way to now sell it on ebay and buy another. Live and learn...", "Date": "July 21, 2011"}, {"Title": "Excellent Everyday Compact Camera", "Author": "Lew L", "ReviewID": "R26YQKXD75D767", "Overall": "5.0", "Content": "As I have reported elsewhere in the Amazon feedback, this is an excellent, everyday, easy to use, very versatile, compact camera.  It can be adjusted to about every shooting condition that me wife has encountered and for the price you can't beat it.  As a matter of fact, this is the third one I have bought over the last few years.  You ask, why three - No, they are very durable and they don't break - my dear wife continually loses them or leaves them someplace.  The only real issue I have with the camera is, I wish they would make them in a \"Dayglow\" Orange, pink or green along with a locking strap I could attach to her wrist.  Highly recommended unit and I recommend using the larger 16 GB flash cards in it, which gives you thousands of pictures at excellent resolution.  Periodically back up your cards, for when you wife (or you) loses the camera.", "Date": "September 21, 2013"}, {"Title": "Love it", "Author": "Deanna Mckeehan", "ReviewID": "R1UL3WILSHLLTE", "Overall": "5.0", "Content": "Camera is easy to use. Takes great pictures. I love the zoom.  I would recommend to anyone.  Camera has easy to follow instructions", "Date": "September 13, 2013"}, {"Title": "Incredible value", "Author": "L. Lubin", "ReviewID": "R1DHM7EDPJ81CJ", "Overall": "5.0", "Content": "I've been having a great time with this little camera. Since I don't always want to carry my DSLR (also an Olympus, E-620) I can now keep a hi-resolution camera, with HD video in my pocket at all times.The lens is excellent, with very little distortion at the wide-angle end. Being a long-time Oly owner (this is my seventh, and fourth digital) I already know how the exposure system thinks. Color accuracy is excellent, and there are plenty of options in Program mode to change white balance, metering mode, and focus. I love that the shutter speed and F/stop is shown on the monitor so I can make adjustments to ISO or exposure compensation before I shoot. It isn't manual mode, but it is the next best thing. At 14 MP there is plenty of latitude for cropping.Among the scene modes and art-photo settings is one I find very useful, and it isn't on my DSLR: this camera can generate a black on white line drawing and save the original photo at he same time! The panorama mode offers a feature that makes panorama stitching with the Olympus software exceptionally smooth. A narrow box appears on the scree, which you can place on any of the four edges to determine shooting direction. After exposure, the image from that box appears on the opposite edge as a transparent overlay, allowing precise alignment for the next shot.At less than $90, I am delighted, and the blue color, with a purple ring around the lens is very snappy. (Pun intended.)", "Date": "September 5, 2013"}, {"Title": "Olympus VR-320 14 MP Digital Camera with 12.5x Optical Zoom and 3\" LCD...", "Author": "david peffley", "ReviewID": "R2825H9GBPM37S", "Overall": "1.0", "Content": "Second time I ordered this camera.  In May I bought one, the on/off button would not function.  I returned that camera and on June 10 ordered another one just like it, seemed like it could have been a super small camera....the first day the camera functioned great, when the battery went dead and was recharged and reinserted the zoom nose when in and out two times, the red button flashed four time and it beeped four time and shut off.  I tried other batteries to no avail, thus I returned that camera also.  Now I am shopping for a point and shoot that works.", "Date": "June 15, 2013"}, {"Title": "nice camera", "Author": "Yoly García", "ReviewID": "R252S3UYBUY8DI", "Overall": "5.0", "Content": "It is a good camera, It takes beautiful picture and the videos are HD.  I highly recommend this product ! good", "Date": "June 7, 2013"}, {"Title": "Thank you!", "Author": "Emefa Dekonor", "ReviewID": "R21W7PSGSUKXR3", "Overall": "5.0", "Content": "My daughter loves her Olympus digital camera and its features.  We still need the memory card but her photos that she takes and downloads are superb and vibrant.  I would recommend this to others!", "Date": "June 7, 2013"}, {"Title": "Excelente Camara", "Author": "servanda", "ReviewID": "R31IT4DXJX4R4I", "Overall": "5.0", "Content": "He tomado fotografias y me gusta esta camara, el precio es bastante bueno al igual que la calidad, una camara muy buena fue una buena compra.", "Date": "February 14, 2013"}, {"Title": "A defective camera", "Author": "David Samuel", "ReviewID": "R22BLRMYN419M5", "Overall": "2.0", "Content": "I purchased this camera on the 4th of July. However right now it's not working. When I turn on the camera the lens is just going out and coming back in, it's as though the zoom is operating on it's own. After about 5 to 10 seconds the camera cuts off completly and I cannot use it at all. This was during normal operations and use and it was not dropped nor did it dounce into anything. What is my position now?", "Date": "October 24, 2012"}, {"Title": "Great Camera on the go", "Author": "donsie", "ReviewID": "R3C7LAGR1KMUCM", "Overall": "5.0", "Content": "We bought this camera as a gift and then liked it so much we bought onefor ourselves.  Good pocket camera when we're out and about.", "Date": "October 20, 2012"}, {"Title": "Great value with exceptional zoom quality.", "Author": "Steven R. Mansen \"SRM\"", "ReviewID": "RI3IZ6M6S3JJG", "Overall": "4.0", "Content": "Olympus has some of the best optical zoom capabilities and lense quality for the money. The flash settings are easy to change on this model and recording video is a simple one button push.  I would give it five stars except that the zoom cannot be operated in the video recording mode.", "Date": "March 4, 2012"}, {"Title": "The worst possible camera", "Author": "E. Rabinovich", "ReviewID": "R3QH3BISSF0QL7", "Overall": "1.0", "Content": "I bought the next generation which is VR-330.  I am a rather experienced amateur,  have had many cameras, and I may say it is an unbelievably bad camera even though it boasts x12.5 optical zoom.  First, its autofocus is very bad, and you need to take 2-4 shots before you get a decently focused picture.  Second, its movie mode gives video that is impossible to edit using a program as sophisticated as Adobe Pro CS4 - I've never had this problem before.", "Date": "December 11, 2011"}, {"Title": "Great Camera", "Author": "Amy Lindemann", "ReviewID": "R36INJYBNEAFTQ", "Overall": "5.0", "Content": "This is a nice, lightweight camera.  I have a big, expensive camera but don't like to lug it around everywhere and this camera works out perfect for those events because I can still get really nice pictures.  The zoom is good & the LCD view is awesome.  *This camera has several options that are good but if you just want to point & shoot it's great for that too.  Definitely would recommend.", "Date": "March 29, 2013"}, {"Title": "defective", "Author": "Kim", "ReviewID": "RZFD77868KUQY", "Overall": "1.0", "Content": "the camera looked cool but it wouldn't charge or turn on for me to use it so i had to return it", "Date": "March 10, 2013"}, {"Title": "Just What I expected..GREAT CAMERA!!", "Author": "N. Doles", "ReviewID": "R2OT4M3RXJWN9L", "Overall": "5.0", "Content": "Easy to use, great pictures...What more could you ask for???Olympus is the only brand I buy!!Get it for yourself, you won't be disappointed!", "Date": "January 24, 2014"}, {"Title": "Great camera", "Author": "ladybug", "ReviewID": "RFO46U4EA0B3G", "Overall": "5.0", "Content": "I still don't know how to use all of the features, but I love the digital zoom.  I wish I had it on my trip to Brazil, when we were viewing wildlife that was far away.  The only drawback is the fact that it doesn't have an eye viewer.  When you zoom it is really hard to see what you are taking pictures of, because it get's blurry on the display.", "Date": "January 18, 2014"}, {"Title": "Good Camera for the price", "Author": "Walter", "ReviewID": "R1V5ATD6Z7TRXH", "Overall": "4.0", "Content": "I used this camera with excellent results with a 32Gb. Class 10 SD Card.Pros:- Awesome zoom for its size- Excellent image quality- Good menu options - easy to understand- Size and weight as expected. This camera is little with a tremendous zoom- Video sound quality goodCons:- Low quality of video with zoom during scenes at night.- LCD display with maximum brightness is not enough during sunny days. You need additional effort for capturing the details in the display.", "Date": "November 19, 2013"}, {"Title": "Takes great picutes!  Great price!!", "Author": "Serialmom \"serialmom\"", "ReviewID": "R20OZDWLVXOACJ", "Overall": "4.0", "Content": "This camera is cheap and easy to use.  I'm horrible at taking pictures and these pictures look great!  I've had this camera for over a year now and I have never had a problem with it.", "Date": "November 15, 2013"}, {"Title": "Great Camera", "Author": "Alex McCallum", "ReviewID": "R888KE3NPTEOJ", "Overall": "4.0", "Content": "This Camera works great! Clear picture quality and wonderful zoom. I'm still figuring out all the features it has to offer. The only reason I gave it 4 of 5 is because the battery life doesn't last as I thought it might. Nothing really that harsh to complain about and it's to be expected in modern devices. I'd recommend this to anyone.", "Date": "August 7, 2013"}, {"Title": "Great zoom and valuefor the price!", "Author": "mowsmom", "ReviewID": "R2931XG0N8Z0MS", "Overall": "4.0", "Content": "I currently own the SP550UZ and wanted to upgrade my \"pocket\" camera to one with a longer zoom.  I haven't used it much, but  so far it does very well.  The only thing that I would improve would be the ability to manually select a flash.  There may be a way to do it and I just haven't found it yet.  I'm a loyal Olympus consumer and have yet to be disappointed with any of their products.", "Date": "July 30, 2013"}, {"Title": "Great camera for the price.", "Author": "Tom", "ReviewID": "R1EVXWNVXXOMKZ", "Overall": "4.0", "Content": "This camera is a very high quality camera, especially for the price.ProsGreat price14 megapixels12.5x zoomGood micConsMust keep camera very still to take a picture without blurCannot zoom in and out while recording a video.I bought this for 200 dollars, and it was a steal. Now it is a lot cheaper. I highly recommend this camera for unprofessional photographers.", "Date": "July 21, 2013"}, {"Title": "My Olympus is great!", "Author": "Ivonne Vega", "ReviewID": "R1UQREA3H40T3O", "Overall": "4.0", "Content": "I simply love this camera. Haven't given it a five star rating because I haven't had the time to really play around with it. I bought it because I wanted a camera with more zoom but couldn't afford the other ones, which are in my wish list. The camera works great. I'm just aiming and shooting. I really like it. It's pretty quick to take the pic. I have a Sanyo  which gives me headaches. So if you are looking for a camera that takes great pics, fairly easy to handle, give this one a try. Remember it's an at ease camera. Go out and enjoy.", "Date": "June 30, 2013"}, {"Title": "great little camera", "Author": "Pen Name", "ReviewID": "R2JPZBED5Y4H5W", "Overall": "4.0", "Content": "Great easy to use camera. Good value for the money.  I already owned one so this new one was Wwhat Ihad expected.", "Date": "June 7, 2013"}, {"Title": "Great camera for the price", "Author": "Cory Purcell", "ReviewID": "R1BIAQN9QQL2U0", "Overall": "4.0", "Content": "I've wanted an olympus for sometime and this one has all of the features that I will ever need in a point and shoot camera", "Date": "March 25, 2013"}, {"Title": "Defective", "Author": "Andrea Lawson", "ReviewID": "R2Q24C01BVRYFM", "Overall": "2.0", "Content": "It became defective 2 months after I bought it.  When I turned it on, it zooms in and out and then shuts off.  Once in awhile, it works properly.  It does take great pictures.  If it wasn't defective, it would be a great product.", "Date": "March 16, 2013"}, {"Title": "great camera", "Author": "ralex", "ReviewID": "R5N0L0FZUYI0S", "Overall": "4.0", "Content": "i would recommend this product to everyone because it is a great camera. the only thing is that when taking photos sometimes come out blurry. other than that its great.", "Date": "March 11, 2013"}, {"Title": "Olympus VR-320", "Author": "Paul", "ReviewID": "R2UK3NVJKXXWJX", "Overall": "4.0", "Content": "Bought this for the Ex-wife, claimed she needed a decent camera and this came in the Kit. Had it shipped directly to her, so I never seen it.  She tells me it works pretty good.", "Date": "March 3, 2013"}, {"Title": "yurne", "Author": "yurne colmenares", "ReviewID": "R3TOOLSD9YQVWK", "Overall": "4.0", "Content": "me gusto mucho la camara llego de forma rapida y segura ademas es muy lindo confortable y de buenos materiales gracia", "Date": "January 31, 2013"}, {"Title": "Gift", "Author": "Terri", "ReviewID": "R1VTLURJQZOIFL", "Overall": "4.0", "Content": "I bought this camera as a gift for a friend. It was not as user friendly as hoped for. Written instructions for set-up and operation were minimal.....expected user to use CD that was included. Once the basic set up was achieved and how to operate understood to some extent, he is very happy with the camera. Great picture quality.", "Date": "January 15, 2013"}, {"Title": "love it", "Author": "louise koningferander", "ReviewID": "R22KJ0AE0DPWQO", "Overall": "5.0", "Content": "because it makes nice pics and  the prize.i like the features, i would like a better menu\"how to use it\"my daughter", "Date": "January 9, 2013"}, {"Title": "Bummed out.", "Author": "FR", "ReviewID": "R234X9L8EZ4OTZ", "Overall": "2.0", "Content": "Auto focus did not work right out of the box. Had to send it to get fixed.Received it for Christmas.", "Date": "January 7, 2013"}, {"Title": "Great camera!", "Author": "Jennifer Kiernan", "ReviewID": "R2C38SBIPIGDZR", "Overall": "5.0", "Content": "Perfect camera for point/shoot and small enough to fit in your pocket or purse!  Very easy to use even if you are an amateur!  Love Olympus cameras (they are a sister of the Nikon products!)", "Date": "January 4, 2013"}, {"Title": "Olympus VR-320 14 MP Digital Camera with 12.5x Optical Zoom and...", "Author": "K9sRule", "ReviewID": "R3EY8XBNRGO1SV", "Overall": "5.0", "Content": "Awesome Camera for the Price! Has allot of features built in! I Love the picture quality & ended up buyin another same camera for a family member!", "Date": "January 3, 2013"}, {"Title": "Great Camera for the Price", "Author": "Penny Warner", "ReviewID": "R1VMUZRV9FX7X0", "Overall": "5.0", "Content": "The Olympus VR-320 lives up to every recommendation for it. Small, fits into your pocket, easy to handle, lightweight, sharp, clear, pictures, great zoom that doesn't sacrifice picture quality.", "Date": "December 30, 2012"}, {"Title": "Good product for great price", "Author": "M. Tillman \"Mtillman\"", "ReviewID": "R1S85S9YTJ8S9N", "Overall": "4.0", "Content": "Although I have only had this camera for a few days, I feel like it is a great purchase.  It has lots of options for a point a shoot.  Great for an \"on the go\" family!", "Date": "December 28, 2012"}, {"Title": "SOLID DIGITAL CAMERA", "Author": "Dan", "ReviewID": "R1KI7AJ8BKGHU7", "Overall": "4.0", "Content": "Bought this camera for concert goings etc... 12.5x zoom is crucial and not common from a pocket camera.  A little intense to comprehend at first but a great users manual and online guides to walk you through!", "Date": "November 27, 2012"}, {"Title": "camera", "Author": "jewels", "ReviewID": "R23Z4U1FYY2G51", "Overall": "3.0", "Content": "this camera takes great pictures but the video is not good at all, video is very poor quality I always buy olympus camera's but would not buy this one again.", "Date": "November 6, 2012"}, {"Title": "Great little camera", "Author": "dollfacedbaby1", "ReviewID": "R1BP4BRXZM90R3", "Overall": "5.0", "Content": "I bought this camera to replace my older digital camera. It's a great product and super easy to use. I would recommend it for anyone who just likes to have a camera to take pictures for special occasions.", "Date": "November 6, 2012"}, {"Title": "Perfect camera for my son", "Author": "M. Raymond \"Megan.\"", "ReviewID": "R1TRQ8WX8EYYNP", "Overall": "4.0", "Content": "I wanted a quick easy point and shoot for my 8 year old. He uses my DSLR and is really good with it but it's a bit heavy for him and too expensive to let him keep using.  This camera is perfect. It doesn't sit there and wait for a smile forever so that you miss the shot lke a lot of the new point and shoots do.  We both like it.", "Date": "October 30, 2012"}, {"Title": "Great Camera", "Author": "Harold Mays", "ReviewID": "R15G1C8X4P1ILR", "Overall": "5.0", "Content": "I bought this camera and received it in about three days in perfect condition. It was easy to prepare it for use for a novice as myself. The pictures are absolutely perfect. I recommend this camera also because it fits a shirt pocket. Great buy. Thanks Amazon.", "Date": "October 27, 2012"}, {"Title": "great camera", "Author": "sdpugh", "ReviewID": "RE071SROYXR69", "Overall": "5.0", "Content": "This camera is great! it takes clear pictures, is easy to use and light weight and small enough to put in your purse or on your hip with a carrying case. Good gift for a starter camera or experienced person.", "Date": "October 25, 2012"}, {"Title": "Small Camera, Big Results", "Author": "frittercritter", "ReviewID": "R1S354DSAG6OS4", "Overall": "4.0", "Content": "Really enjoy this camera it fits my needs such as small size fits in pocket.Battery life is very limited suggest owning a second battery. lasted about 5 hrs.Battery is included. SD card is not. most don't have media cards included.You won't be disappointed with this camera. Olympus VR-320  14 MP Digital Camera with 12.5x Optical Zoom and 3\" LCD (Black)", "Date": "October 20, 2012"}, {"Title": "Good point & shoot camera", "Author": "C. J. Myers \"NGinEar32\"", "ReviewID": "RSCWT47ERXW4L", "Overall": "5.0", "Content": "Before purchasing, I read all the \"1 star\" reviews. I purchased it in April. I have used it on a vacation to Jamaica, at the beach in Outer Banks, at weddings, and around the house. I don't know hardly anything about photography, but all my pictures look good. It takes good, clear pictures outside in daylight & when using the flash. However, sometimes it has problems focusing when using high zoom (10x to 12.5x) and when taking very close pictures, such as bugs or flowers. Also, when you set it to timer mode and let it take a picture, it doesn't stay in timer mode. You must reset it to take another picture with the timer. It is fairly small, very easy to use, has many features (many I don't even use), and the battery holds a good charge. If you want a simple point and shoot camera for vacations and around the house, this camera is an excellent choice.", "Date": "October 14, 2012"}, {"Title": "Great point and shoot", "Author": "OneLove", "ReviewID": "R2372K8ZXXOIWG", "Overall": "4.0", "Content": "So far, good.  I changed a few settings to suit me, and now I like the camera a lot.  I did not give 5 stars simply because I have not really explored all the features the camera offers.  But, I am a huge Olympus fan so I think I will love it!", "Date": "September 11, 2012"}, {"Title": "Olympus compact camera", "Author": "O", "ReviewID": "R1K97IKQ03CBWR", "Overall": "4.0", "Content": "This camera have great zoom 12.5 X for price, only on video mode can't change zoom. In general is good.", "Date": "July 21, 2012"}, {"Title": "good deal for the price", "Author": "Amazon Customer \"Oscar\"", "ReviewID": "R3AK53G63DYA8V", "Overall": "5.0", "Content": "I like the camera,it has a good size, takes good pictures. Unfortunately doesnt do what my older cannon did. To take a photo from a taken photo in the memory. But for the price it is an excellent product and good quality of photos. I am satisfied with it.", "Date": "July 15, 2012"}, {"Title": "Olympus Camera", "Author": "Julian", "ReviewID": "R1JG5G9HU34T6O", "Overall": "5.0", "Content": "This is a really easy to use camera. It takes great pictures, and the zoom is awesome. You can't get a better camera for the price.", "Date": "July 2, 2012"}, {"Title": "nice  little  camara", "Author": "emery yurasits", "ReviewID": "R35NQH9I7RPJAM", "Overall": "5.0", "Content": "camara  is  fairly  easy  to  operate. I  liked  the  price  which  was  less  then  $100.00. I  like  the  fact  that  you  can  change  the  settings,  similar  to  a  manual  camara.", "Date": "June 30, 2012"}, {"Title": "Olympus VR-320", "Author": "Chips & Chips", "ReviewID": "R1QOJ6Y7X3W5WS", "Overall": "5.0", "Content": "This is my second digital camera and it is an excellent product. I began taking pictures within an hour or two of receiving it, even before the battery was completely charged. I wanted a camera that could take extreme close-ups and it does fit the bill. It has two macro ranges, one standard and one fixed focus one that will allow me to take very detailed photos of small parts. The specs could have been a bit more detailed about this feature. The 12.5:1 zoom range is great for going from wide angle to a really good telephoto view. It did not come with any memory card and one is really needed as the built in memory is only good for about 7 (from the specs) to 10 (my observation) full resolution photos at a time.  Again, the specs could have been more specific. But I knew I needed a card anyway so I was not disappointed. The viewfinder is a full 3\" diagonal and is readily visible outside.  This is a really great buy for the money.", "Date": "April 26, 2012"}, {"Title": "Great Price and Great quality results", "Author": "MommaSB", "ReviewID": "R1WSZPNH9LHDMI", "Overall": "5.0", "Content": "It'll take a moment to learn how to flip through all of the features but it is worth the money you spend for a point and shoot.", "Date": "April 10, 2012"}, {"Title": "great camera", "Author": "hendo", "ReviewID": "R1RDQDVB8UPL95", "Overall": "5.0", "Content": "best little camera i ever had ,its quick ,has lots of features ,large screen on the back,you can be creative with iti want to buy another one for my daughter", "Date": "March 17, 2012"}, {"Title": "Olympus VR-320 14 - Love this camera..", "Author": "Shirley Ann", "ReviewID": "R1AI98MU5GZMLR", "Overall": "5.0", "Content": "The camera is easy to use, takes great pictures, expecially of fast moving grandkids and have recommended this to many others who also thought it worked easily and took great pictures. Zoom is quick, pictures clear, instructions great.", "Date": "March 6, 2012"}, {"Title": "A disappointing camera", "Author": "Amazon Customer", "ReviewID": "R1T5365RE8B6SM", "Overall": "2.0", "Content": "For it's price this camera is not what you would expect from an Olympus camera. I can't  recommend it, My phone cam is better", "Date": "August 13, 2013"}, {"Title": "Disappointing camera", "Author": "hunter", "ReviewID": "R1IVXDY2AMN6FK", "Overall": "1.0", "Content": "I have a Sony DSC s700 and deceided that I would buy a VR-320 for its great zoom and wide angle.  I found that the camera would not focus properly.  I took over 20 pictures on a cloudy day and every picture was out of focus. I also took an indoor picture with the flash and found the center of the picture was in focus but the edges were blurry.  After reading some of the other reviews it appears that this is a common problem with this camera.  I returned the camera.", "Date": "March 19, 2013"}, {"Title": "Bargains are not always bargains", "Author": "D. Welch", "ReviewID": "R24ZIXLEFAOI9H", "Overall": "1.0", "Content": "Worked great at first, but after a month will not focus correctly and takes terrible photos. We bought 2 at a good price and one is still working well.  A Nikon is next.", "Date": "January 25, 2013"}, {"Title": "Reviewing the Opympus VR320", "Author": "Greem", "ReviewID": "R23G5OT1TBD8VJ", "Overall": "1.0", "Content": "I received my camera  the latter part of September, loved it and did not have time to use it until the first of October, because of my schdule.Well I begain using the camera and it proformed excellently, however after taking pictures for a while the camera could not be turned on again.I waiting a day after this had happened and tried to turn the camera on again, well this time it worked. I am at the point of not knowing whatto expect of the camera, it may turn on one day and the next it may not.  I am now in the process of waiting until the seller contact me. Of courseI have been waiting for about two weeks as of this date for that to happen. I am not happy with this produce!", "Date": "November 24, 2012"}, {"Title": "Olympus VR-320 Review", "Author": "spk2000", "ReviewID": "R1OCSG231R16ZZ", "Overall": "4.0", "Content": "Camera takes excellent pictures overall.  There are some situations where I have been unsuccessful taking a good pictures.  Usually when something is behind glass I cannot get a good photo.  Not sure why and have tried a few of the setting but it usually comes out very blurry.  I can use my phone and it comes out fine under same exact circumstances.  Overall very pleased with camera though.", "Date": "June 14, 2012"}, {"Title": "Gift", "Author": "Jim Herndon", "ReviewID": "R3PYHJSUIHZ7V3", "Overall": "5.0", "Content": "This was a gift to my wife for Christmas. I can't comment on it but she seems to like it. It works", "Date": "January 3, 2012"}, {"Title": "Olympus VR-320", "Author": "hank", "ReviewID": "R2J40MSGWENS1O", "Overall": "4.0", "Content": "Great camera. East for my wife to use. I put a 32G card in it and it will store more the 7000 pics. My only complaint is the flash is located on the wrong side of the lens, Your finger covers it up. Definitley worth $100.", "Date": "December 27, 2011"}, {"Title": "extra weight and slimness did not justify the extra cost", "Author": "rahlen Murphy", "ReviewID": "R3SXS1PHWE9H7H", "Overall": "2.0", "Content": "I have been a long time Olympus user and I was going to upgrade from VG-140.  Both Olympus cameras had 14 megapixels but my oldest had 5xWide and this newest had 15xWide.  The zoom feature was harder to change the control located on top of the camera.  The weight was heaver and not as slim as the older one.  The extra weight and slimness did not justify the extra cost.  I lost my shipping charges going both ways and that (savings) still did not justify keeping this camera.", "Date": "December 8, 2013"}, {"Title": "I should have bought something else", "Author": "Edith Murillo", "ReviewID": "RSBWOM77KO8FO", "Overall": "2.0", "Content": "Not sure about this camara. I took several pictures that I was happy with but then it started getting blury and the pictures are not the same quality as before. I've only had it for a month now so I need to take more and see.", "Date": "July 2, 2013"}, {"Title": "For 80 bucks, How Can it Be Beat?", "Author": "Saltek", "ReviewID": "R1FAUOUYY6KIZN", "Overall": "5.0", "Content": "Reasonably quick, great features, (any smaller and i would wonder what was wrong with me,) excellent physical quality, VERY decent pix-sometimes great, pretty ok battery life, nice, stable zoom, and so on...IMO, hard to beat for the money. Just be careful not to block the flash. You don't realize you're doing so, until you become familiar with the camera.Feature for feature, an excellent value!", "Date": "June 22, 2013"}, {"Title": "Great Little Camera Purchase Through Amazon", "Author": "Steve S", "ReviewID": "RQRGGCDP28027", "Overall": "5.0", "Content": "This is a great camera for the money. I was missing to many good photos because my other camera is just a little to cumbersome to carry all the time. The Olympus VR-320 fits in your pocket or on your belt in a small holster. Even though this isn't TTL, I can live with using the large screen. The quality of the photos is great, the menu is user friendly, and even using the flash and screen, the battery holds up quite well. Purchase an extra battery and charger when you buy this. All in all, this is a great value.", "Date": "October 31, 2012"}, {"Title": "Excelente camara, imagenes muy nitidas. Excelente lente.", "Author": "David T.", "ReviewID": "R3VA9LL75EGLPP", "Overall": "5.0", "Content": "Articulo de excelente calidad. muy rapida para tomar las fotos, buen lente. Muy buenas funciones. Buen tamaño de pantalla, se ven muy nitidas las fotos, sencilla de manipular.", "Date": "August 5, 2012"}, {"Title": "fair value", "Author": "Sundown", "ReviewID": "R2JRW9E4M5U4QB", "Overall": "4.0", "Content": "the product: olympus vr-320. packaging is very good. received the item in excellent condition. camera looks nice, features are easy to learn and use. image quality is good (3.5 stars). exposure is a bit unforgiving.delivery: received the item on the date stated (5 stars). no problem, whatsoever. thanks very much.", "Date": "July 29, 2012"}, {"Title": "Costco Shoppers Don't Even Think About It.", "Author": "Joe", "ReviewID": "R29N722WL4E1SQ", "Overall": "1.0", "Content": "I got this camera from Costco because the price was great and I figured the specs were great for the price. Boy was I wrong.  This is by far the worst camera of any price I ever encountered.  I have an old Canon Elph that is 6 years old and that camera blows this Olympus out of the water.VR 310 takes awful low light pictures. The picture quality is equal to 1 megapixel quality picture from 1996.  I was so angry at Olympus for putting out this product. They are better than this.  The camera feels cheap, but the picture quality is below cheap. It's unacceptable for a product that is put out in 2011.If you decide to purchase this camera, consider yourself warned.  I wished I had a honest review to go by before purchasing this piece of crap.", "Date": "June 26, 2011"}, {"Title": "Not worth $90. Not even worth $9.", "Author": "Sarah", "ReviewID": "R233YKQYHQ2RWZ", "Overall": "1.0", "Content": "I got this camera as a \"deal\" on woot.com about a month ago. I thought it'd be a good choice because I normally like Olympus cameras. I spent about $80 on this thing [what a \"deal\" when it's $90 on Amazon and $80 \"half off\" on Woot...]DON'T WASTE YOUR MONEY.It takes GREAT photos, if you have mastered the art of holding your hand[s] PERFECTLY STILL for the two whole seconds it takes for this thing's shutter to go off. If you can't keep your hand[s] perfectly still, you ARE NOT going to get ANY clear photos. The only [VERY FEW] clear photos I got with this camera were when I had it sitting on a flat surface and very carefully hit the shutter button. You shouldn't have to do that!!!!! How is ANYONE supposed to get consistently clear shots with something like this??Also, I brought it to a concert with me last night to take videos, because my iphone was out of space.The videos LOOKED great. They LOOKED perfect. BUT: this camera apparently has the world's worst microphone. Over a dozen videos of Five Finger Death Punch, Trivium, and Pop Evil, all COMPLETELY unwatchable, because the audio is THAT bad.I'm going to demand my money back from Woot and then I'm going to sell this thing to anyone dumb enough to take it off my hands. My 5-megapixel sony camera from like 2003 had better audio than this piece of garbage.", "Date": "August 20, 2012"}, {"Title": "Broke Within A Year", "Author": "Daren D. Dahl", "ReviewID": "R2OZ5UPR5TOWX6", "Overall": "1.0", "Content": "We bought 3 of these cameras.  One for each of our 3 kids ages 10, 12, and 14.  We bought them right before we left to hike the Inca Trail in Peru.  One camera broke during the trip.  The other 2 broke within 6 months.  I did not keep the warranty card so Olympus would not honor the warranty.The problem was the same for all three.  The automatic lens cover, which automatically opens when you power on the camera, would no longer open all the way.", "Date": "June 24, 2013"}, {"Title": "very dissatisfied with this camera and have no idea how to resolve it", "Author": "David T. Ladabouche", "ReviewID": "RVVU76F9RBNW1", "Overall": "1.0", "Content": "The camera screen is white and cannot see pics or subject to take pictures. I bought this item to take on vacation and it wouldn't work after taking a few pics.", "Date": "October 30, 2012"}, {"Title": "Bad quality images and videos", "Author": "Naime CELIK", "ReviewID": "R18LZVM06VY9S", "Overall": "2.0", "Content": "This item seems very reasonable with the price but as many people mentioned the picture quality is very bad. The flash light is coming little bit early that in picture boders of frame became darker and in the middle there is bright part .When you turn off the flash the photo is really blur and it is not clear at all. I really dont like th'is camera.In the movie I took,there is white noise is occuring, if you look the video in very tiny frame you can see it little bit clear. if anyone know how to reduce the flash but not turn off, please let me know or if anyone find any solution these problems I have mentioned above.", "Date": "July 16, 2012"}, {"Title": "Very Disappointed!!!", "Author": "D. Reynolds", "ReviewID": "RELVDPVX8HRZH", "Overall": "1.0", "Content": "I bought this for a very close friend for Christmas and it worked good for about 2 months.  All of a sudden it would not hold a charge.  The friend tried another battery and it would not work either, so the problem had to be in the camera.  Contacted Olympus and they said he had to send it back.  He sent it back and just now received it and it still does not work.  This camera only worked for about 2 months.  That is alot of money to spend for something to only work 2 monhts.  I am extremely disappointed.  I have only ever owned Olympus digital camera (I have had 5 of them so far) and was always satisfied, but now I have a bad taste because of this.  Not even sure what was wrong with it!", "Date": "May 22, 2012"}, {"Title": "Colorful Camera", "Author": "Buffy", "ReviewID": "R3F7AZ1DDIMC5C", "Overall": "4.0", "Content": "Love my new blue camera that can zoom in since I love traveling.  It's easy to use that even my 9yr old daughter enjoys taking pictures with it.", "Date": "September 16, 2011"}, {"Title": "my Olympus VR-320", "Author": "Cheryl A. Solomos", "ReviewID": "R3N47RGGE8OAYO", "Overall": "4.0", "Content": "This camera is very good if you need a camera you can put in your pocket. But the zoom is just ok.", "Date": "June 15, 2011"}, {"Title": "Confused", "Author": "Bob", "ReviewID": "R3PBDQHHHT87PC", "Overall": "1.0", "Content": "I purchased a Olympus VR-320 Digital camera thinking it was a simple point and shoot model. The information that came with the Olympus 350 was printed in such small print that I had difficulty reading it. Actually, I haven't gotten through it yet. I have not even taken any pics yet. While the Olympus 320 appears well made it is NOT a simple point and shoot camera. I will point out that I am a senior citizen and not up to all the changes that the camera industry has gone through, so I am stuck with what might be a great camera that is really not useable for my needs unless maybe my kids can rescue me with more easy to understand instructions.", "Date": "July 5, 2012"}, {"Title": "David", "Author": "Davey \"Davey\"", "ReviewID": "R85AUJK9NP2JR", "Overall": "1.0", "Content": "I gave this camera a 1 star because the instruction manual which has to be downloaded is terrible. I like to make movies and the sound is awful as well as instructions on sound settings -the setting are therebut no instruction to set them. The only instruction which if I knew I would not have purchased this camera is turn off zoom if you want to zoom in movie mode What! this is stupid no sound when zooming. What I discovered on my own was and some of you owners may not know is--- you can zoom in picture taking mode and then push red button for movie mode and you can make movie with sound while zoomed in. They don't tell you that in the manual. The fact that the recording of esp music sound is so bad I am going to buy another Cannon Elph.", "Date": "February 4, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004L2L6JC"}}