{"Reviews": [{"Title": "XZ-1 Wins Out", "Author": "Z. Wagner", "ReviewID": "RTHLHYIL3P41M", "Overall": "5.0", "Content": "This is my preliminary review for the Olympus XZ-1, which arrived at my house this afternoon.  I will update as necessary.Over the last two weeks, I have ordered, and returned, two other cameras: the Fujifilm HS20EXR, and the Panasonic LX5. Neither one of them really satisfied me in terms of a total package.  The build quality (at least on my copy) of the HS20 was suspect, and worried me a bit.  The RAW processing time was quite slow, and I guess I just didn't like the overall feel of it.  The Panasonic, despite all the rave reviews, did not satisfy in terms of IQ.  Color blotching crept in far too early (even as early as ISO 200) for my taste, and by ISO 400 it was unbearable.  The Jpeg processing on the LX5 wasn't great, either.  So I finally decided to order the Olympus after much reading and staring at sample images on the internet, though I was becoming skeptical it would be able to satisfy me.  At least so far, I was wrong.The Olympus XZ-1 is a marvel of technology.  From the blazing fast Zuiko lens to the quick and slick menu interface, to the conservative beauty of the design, this camera means business.  Shooting with the XZ-1 is an effortless joy, and it works so well and so intuitively at times that you almost forget you're using a camera at all.  I've read in other reviews that the rear control ring is finicky and annoying, but that is not my experience.  I find it to work quite well, with the right amount of tactile feedback.  The same is true of the front ring around the lens, used to control various settings based on the mode you are in.  Sure, there's not a dedicated button for ISO, but it's so easy to set the ISO from the menu that I'm not quite sure what the issue is.  The lack of an AFL/AEL button is a bit of a letdown, but I don't find it to be a dealbreaker by any means.The art filters range from quaint novelty effects that I will rarely use to things like the Dynamic Tone filter, which (though the effect is a bit hit or miss) can be incredibly striking.As far as all the other modes go, it's pretty much your standard fare, with the addition of the 'low light' mode.  But I wouldn't go too crazy with that mode, as the noise at higher ISOs from the XZ-1 is pretty pronounced.  And that leads me to image quality.For some reason, though the XZ-1 possesses quite a large sensor for a point-and-shoot, it produces quite a lot of noise.  What this creates is the necessity to find the right balance with your RAW processing between noise reduction and image clarity and sharpness.  Or, you can just use the Jpegs, which I must say, are very well processed, but when put up against the RAW files, can't compare to the detail, due to the noise reduction applied to the Jpegs.  This is the one bit of a bummer about the image quality of this camera.  You will see a decent amount of noise as low as ISO 400, though nothing that can't be dealt with in post until you pass 800.  1600 might be salvageable, but it's questionable.  The nice thing is that the noise is more luminance than color oriented, because I find it's more difficult (as with the LX5) to deal with large blotches of inappropriate color.  So, bad news dealt with.  And it's really not that bad, because guess what?  You've got one of the fastest lenses in a compact camera at your command.  This means that you will rarely need to jump above ISO 800 to shoot just about anything.  The speed of this lens is simply a marvel to behold, and a joy to employ.  Not only does it allow you much, much more freedom in ALL your shooting (aperture only hits 2.5 at telephoto, which is still faster than most dslr lenses are at wide!), but the size of the sensor in relation to the aperture capability of the lens also allows for some of the nicest bokeh you'll find in a compact.  Olympus also smartly employs an in-camera ND filter to help you keep those aperture numbers low whilst shooting in bright daylight, which is a godsend.And despite what I've said about the noise issue, the images from this camera are, in general, pretty spectacular.  This is no dslr, but the images are about as close as you'll get without buying one at this point.  While the noise reduction applied to the jpegs definitely reduces fine details, they still look spectacular.  The colors from this camera absolutely scream, and even if you're not fond of the detail loss in jpeg, just go for RAW shooting, which is still really, really fast.  Shot to shot times are very fast, seemingly regardless of the file type (though I am using a very fast Sandisk card as well).The continuous shooting speed of this camera isn't wonderful, but honestly, it's not bad when you consider that you can fire off quite a few pics (even with the images set at Fine Jpeg + RAW) before it gets stumped.  You can also reduce the quality of the Jpegs to 5MP to grab some more fps, and even down to 2MP to grab even more fps, but I certainly wouldn't go that low.Autofocus is generally good, though I did encounter some questionable choices when in macro mode that did annoy me a bit.  However, you can choose between 11 different focus points to get the pic you want, or hold the shutter button down halfway and recompose.  In general though, I found the autofocus to be reasonably fast and accurate thus far.One other caveat is that for some reason the Auto WB seems to have trouble with incandescent lighting, creating overly warm tones and forcing you to manual select the incandescent setting for accurate colors.  This is not a huge deal, but it's a bit of an annoyance.The LCD screen is gorgeous, and while I wish the camera came with an EVF, Olympus has given us the ability to add the VF-2 viewfinder, which is both a great and, unfortunately, incredibly expensive option.  I will be ordering the viewfinder, though I don't relish spending half the price of the camera on a tiny little accessory.I look forward to many glorious outings with the XZ-1, and can honestly say that I highly recommend it to anyone looking to move up from a simple point and shoot, but not yet ready to go full on with a dslr and a bunch of lenses.(UPDATE 1) Received my VF2 viewfinder today, and was able to try it out for a few hours before work.  WOW.  Talk about a quality product.  I was concerned about the cost (and really I still am), but you definitely get a great little add-on.  The picture is ultra clear and makes all other EVFs tremble before it.  Obviously using it in daylight is great, but for me, coming from a dslr background, just having it was a no-brainer.  And if I decide at some point to upgrade to the EPL2, I don't have to buy it again.  So that made it worth it to me.  Still loving the camera (even more with the viewfinder)!(UPDATE 2)  Man, I LOVE this camera.  The VF2 viewfinder has increased my enjoyment of it by quite a lot, and I honestly didn't think that was possible.  I could sit and nit-pick the image quality compared to dslr cameras, but it's just not worth it.  Upping the sharpness and contrast applied to the jpegs makes them usable straight out of the camera, as long as you keep the ISO reasonable (800 or lower).  Flipping the 'gradation' feature to auto can garner you better dynamic range in shadows as well as better detail, though you will experience more shadow noise, so use it wisely.I certainly didn't buy this camera for the art filters, just thought they'd be a fun little addition... but they really do help me with my creative picture taking, and get me thinking about things from a different perspective.  Highlights are the Grainy B&W; (allows for some interesting videos as well), Diorama!(I've come to LOVE this one), and of course the popular Dramatic Tone.  Soft Focus is useful as well for portraiture or weddings.  The super fast lens allows me to shoot at ISO100-200 most of the time, occasionally venturing to 400 and, much more rarely, to 800.  Also, make yourself take pics using the Monochrome setting.  Turn up the sharpness to +1 and the contrast to +2, and behold the beautiful B&W; photos this camera spits out.  Pretty awesome.Also great is the Macro and Super Macro.  I'm not the biggest fan of the tracking AF though, a sports camera this is not, though the continuous shot is pretty decent in the right situations.  Good for kids and such, but really fast movers like dogs can sometimes be problematic.  Pretty much forget birds, but the range of this lens doesn't really allow for that anyway.The bundled software is actually not bad either.  I'm used to using PSE, so I use that for most everything, but I do a simple distortion correction in the Viewer 2 software first, which works quite well (the lens has some decent barrel at wide, and a little pincushion at tele, nothing really problematic).All in all I can't say enough about this camera.  If you're on the fence, just buy it.  You can return it if you don't like it, but why would you do that?  Kudos, Olympus!", "Date": "April 5, 2011"}, {"Title": "A point & shoot that can be both serious and fun!", "Author": "D. Turkmen", "ReviewID": "RQJLZRF3AWKBI", "Overall": "5.0", "Content": "My girlfriend and I were tired of carrying all the DSLR gear with us whenever we go somewhere, so we started looking for  a lighter alternative. After reading some reviews and comparisons online (dpreview.com is a great source for that) we decided to buy Olympus XZ-1.Pros:- It has a bright f/1.8 lens which is pretty good at low-light situations (or just taking shallow pictures)- The screen has live view where you can see the depth of field in Aperture mode before taking the photo- OLED screen is bright enough to see in day light. It also isn't that power-hungry.- The big sensor can capture the subject in great details.- Anti-shake mechanism works pretty well. I tested 1/40, 1/25, even 1 second exposures which turned out better than I expected. With my DLSR's anti-shake off, those pics would be more blurry.- Charges through USB (this may be a con for you if you use card readers) simply keep your camera plugged in to your computer after transferring the images, and you don't have to take out the battery for charging anymore.- The dial around the lens is easy to use. Depending on the mode it changes aperture, shutter, scene mode; or rotates images.- 6 Art filters which applies digital effect to your photo/movie in realtime.- 18 Scene modes which will make taking any occasion easy. For example, \"pet\" will track the moving animal in the frame. Or \"panorama\" scene mode will help you take 3 consecutive images and stitch them together auto-magically.- Macro mode can focus even at the closest distance possible (be careful, your lens may be easily touching that flower!)- It fits in a pocket (maybe not jeans or shirt pockets)- (ADDED) Built-in ND filter lets you have longer exposures (1/10 seconds, for example) during day time. See the waterfall picture as an example.- (ADDED) Splash-proof. Used under heavy rain where water drops were all over the place (lens, dials, screen) with no problems.Cons:- Art and Scene modes are on the top dial along with P/A/S/M modes, so you cannot combine those (e.g. cannot apply an art filter while in Aperture Priority. But I guess some of those filters are meant to overwrite aperture/shutter)- Shutter lag is definitely noticeable if you are a DSLR user. If the timing is important, try sequential mode. Luckily there is even a hi-speed burst shooting mode.- The lens is too bright sometimes. Shutter speed cannot go faster than 1/2000s. In a bright day light at f/1.8, you'll start seeing overexposure and fringing. EDIT: With the built-in Natural Density Filter on, this is not the case anymore!- Some of the art filters need more processing power than others, which makes the screen (live view) refresh slower. For taking photos this is not a big deal. But if you record a movie that way, you will get lower frame rates. But again, this camera is not meant to replace your camcorder or your post processing software.- No viewfinder.- (ADDED) Lens cap is pretty lose. We ended up buying an after-market cap that fits  around the lens (you can see the threads if you look carefully) with spring-powered blades that will automatically open/close when lens is in/out. Edit: Looks like they have an official lens cap now Olympus LC-63A Lens Cap for XZ-1 Digital Camera- (ADDED) RAW version of the photo looks pretty dull comparing to JPEG. We had hard time editing the RAW to match the colors to the JPEG. It would have been nice if some color profile was provided with the camera.11/12/2012----------Camera is still working great. Bought a Sony RX-100, but it cannot just replace the XZ-1 yet. XZ-1 has great support (Olympus has released firmware v1.5 as of May 2012), and its low-light performance is among the best in P&S; class. Recent price drop ($199) brings this camera to a greater price/performance point.Couple months ago purchased an LCD remote, which works perfect in test environment but I couldn't test its durability in real world yet LCD Timer Remote TC-UC1 For Olympus XZ-1, E series. This is one of the 3 necessary accessories, other 2 being LC-63A Lens Cap, and a Gorillapod.  Olympus LC-63A Lens Cap for XZ-1 Digital Camera ---- Joby GP1-A1EN GorillaPod Flexible Tripod (Grey and Black)", "Date": "April 10, 2011"}, {"Title": "Very good camera.. Best in class, with one exception...", "Author": "Radio Man \"yarns13\"", "ReviewID": "R7CQXAMK44NB6", "Overall": "5.0", "Content": "I was very much looking forward to this XZ-1 for a long time. Seemed to have the BEST of all the similar cameras in this category, put into ONE camera. I have owned the Canon S90, Samsung TL-500, and STILL own the LX5. All of these cameras are rather good and certainly way better than an average point and shoot, especially if you want a lot of control over the camera.The XZ-1 does have a rather amazing lens..in that it is very fast(bright) throughout it's entire range..impressive. It is true I found that being able to shoot with the 1.8 aperture in doors..I did not have to use a very high iso, yet the shutter speed was indeed faster than my LX5 with same settings for example.Faster shutter speed did result in mostly really good indoor pictures without the usual slow shutter blurriness, THOUGH all pics indoors in even rather good light tended to be a bit dark oddly enough until I cranked up exposure compensation.The image stabilization on the XZ-1 seems really WAY above average as well.HOWEVER doing a ton of side by side pics vs my LX5 or even JUST looking at the output of the XZ-1, jpeg pictures at default setting look \"somewhat\" soft, if you use the default Natural setting(With no adjustments as to sharpness, contrast etc.)! I mean even at iso100 my pictures look..too soft, airbrushed looking SLIGHTLY. In camera somewhat aggressive Noise reduction is that one exception I listed in the title.Living with his camera for a while it is obvious Olympus chose to use too much noise reduction at ALL isos!.But,the overall output in most cases is almost amazing for a camera in this class. There is just a bit of slight softness especially on skin especially now and then it seems. If I shoot raw..then take off, or lower the noise reduction, finally the pictures become MUCH more sharp. As you raise the iso..Olympus uses more and more noise reduction to it's jpegs as all manufacturers will do. Not uncommon, but now I find I'm almost always shooting in jpeg PLUS raw just to have the option to do away with so much UNNEEDED noise reduction which will cause smudging/smearing as iso rises above 200iso..some even at iso100. One may not notice this as much or AT all if you are shooting general scenery out doors. It's more noticeable I find on portrait work.You can check out the Comparometer at Imaging resource. Instead of just my OPINION,I replaced the . with a DOT so hopefully the link does not get deleted..[...]Put the XZ-1 on one side..put an S95/ TL500, LX5 or a G12 etc on the other. Check different ISOS and see if you don't agree the XZ-1 starts losing too much detail vs the other cameras 200iso and above. You will notice it most easily on the clothing, the threads become blurred vs most of the competition. Even the wall paint becomes much more blurred vs most of the other cameras DUE to noise reduction..However overall the jpegs from the XZ-1 are generally REALLY good with great looking color and the detail is not that bad, actually GOOD..but COULD be so much better with lower aggressive noise reduction..that's all I'm saying.Using raw..there is a ton of GOOD detail and not much noise in fairly good light till you get to about 400/500iso...if you want the VERY best out of this XZ-1Vs my LX5 the LX5 almost always has more detail AND noise, but most of the LX5's jpegs look sharper at same iso. HOWEVER OVERALL, the pics from the XZ-1 just LOOK WAY WAY better as to the WHOLE picture, dynamic range, IQ, almost no lens distortion, GREAT corner to corner sharpness, lack of purple fringing...nice rather accurate color overall..it beats the LX5 and my S90 that I owned.Bokeh (Blurred background) is amazing on this camera if that's important to you. I never knew a camera with a small sensor (compared to a full sized or micro four's sensor) could give you so much depth of field with that great blurred background.The battery life is above average.Video: I didn't do much video recording but what I did record looked VERY good.In summary in my opinion, At default picture JPEG setting vs an LX5, S95, or even the TL-500, I am finding the XZ-1 to be best in class (Except again..stronger overall noise reduction than all the others.)Each camera though in this category seems to have some strong points, some weaknesses.Use raw on the XZ-1 this camera looks REALLY really good and on balance, JUST may really be the best of the crop here.  Jpegs DO look VERY good too..just you will see night and day sharpness if you chose to shoot raw and take OFF the noise reduction, when you want that extra detail. Noise reduction can not be changed IN camera.Since owning and using this camera A LOT now..I feel confident in saying it's probably the best camera in this 10meg smallish pocketable category. I like this camera so much now I bumped it up to 5 stars from it's initial 4 star rating I gave it. If Olympus can include IN camera noise reduction adjustment, perhaps in a future firmware update this camera has no competition in this category in my opinion!", "Date": "February 16, 2011"}, {"Title": "Video killed the Photograph Star - XZ-1 vs. LX5", "Author": "Stillness", "ReviewID": "R1R8C09NSX0IFC", "Overall": "3.0", "Content": "My review of the XZ-1 is from the perspective of being proud father and the family member in charge of capturing memories (and a major geek).  Through the years, I have tried just about every type of camera from the Fujifilm F30 to the Canon ti2, the Lumix GF1, GH1 and so on.  My ideal camera is small enough to carry in a pocket (or in my case, a belt holster), has great low light capability, great video capability and some zoom capability.Many enthusiast compacts and all Micro 4/3 cameras like the GF1, PL2 and so forth, don't fit in a belt holster.  That leaves the S95, the LX5 and the XZ-1.  The S95 is out due to no video autofocus and slow min. aperture at telephoto.The XZ-1 fits in my hand better than the LX5 (more room for the fingers of my right hand w/o rubbing the lens barrel), and has a faster lens than the LX5 in a very meaningful and practical way.  At the same shutter speed the XZ-1 will be ISO 320 where the LX5 will be ISO 640.  At high and low ISO, the Olympus jpeg processing is much more pleasing to my eye than the LX5 (I don't have time to deal with RAW.)  I also prefer the XZ-1 28mm over the wider LX5 24mmBut I'm returning the XZ-1 and keeping the LX5 because the XZ-1 video quality is unacceptably poor.  The quality is so bad as to be distracting and useless for capturing family memories.  Not just the wild focus hunting which would be enough, the compression codec makes everything look soft, digital and just awful.  Anyone with a few years shooting AVCHD lite on these Lumix cameras like the old ZS3 will be heartbroken.  That's why I have to give 3 stars.If I didn't need video, the XZ-1 would be perfect.BTW if you're looking for a killer belt holster for your XZ-1 or LX5 the Lowepro Napoli 30 is a perfectly snug fit and you won't need the lens cover anymore.", "Date": "March 14, 2011"}, {"Title": "Olympus XZ-1", "Author": "Tariq A Khasawinah", "ReviewID": "RFE0GIAKKYIOO", "Overall": "5.0", "Content": "I have used this camera extensively on a recent trip overseas.  My previous cameras include a Nikon D40 (using a nikkor 50mm 1.4g and sigma 150mm 2.8 prime lenses) and a canon P&S.;  This camera is a pleasure to use, the pics r usually sharp (depending on the ambient light and being able to squeeze the trigger without shaking), the macro is awesome, and the bokeh (with the wide lens aperture u actually get decent bokeh which is totally cutting edge for a P&S;) is great.  Your subjects will also love the soft focus mode which gives them perfectly smooth skin (just like the model shots).  I prefer this camera over my DSLR, especially for travelling as it is obviously easier to carry this around everywhere rather than lugging around a DSLR with multiple lenses. The video, however, is mediocre.  Overall, I highly recommend this camera and believe that this currently is the best P&S; camera for pictures only. For those into video, you will still need a dedicated camcorder if you also want top notch home videos.", "Date": "April 12, 2011"}, {"Title": "One of the best P&S; cameras", "Author": "mister_t42", "ReviewID": "REONU0N76I0PO", "Overall": "5.0", "Content": "I've owened a series of P&S; (point & shoot) cameras since selling my digital SLR a few years ago.  I just didnt like dragging around a large camera with multiple lenses when I could have a small pocket camera that took decent photos.  But I was never quite satisfied with any of the small cameras I tried (a combination of Canons and Panasonics).  Until I bought my 5th one, the Olympus XZ-1.Quite simply, the lense in the XZ-1 is spectacular.  It lets in a lot of light, and combined with a larger than typical sensor (compared to other P&S;) you really can get terrific photos in a wide variety of settings.  This combination of lense and sensor is key, as it really ups the end result in a way that matters -- better quality photos.I took photos of an ice skating show recently and was shocked by how many great photos I got under very poor lighting, all without using flash.  The XZ-1 focuses rapidly, and it does a great job of automatically setting aperature and shutter speed.  Of course it does offer the user a fair amount control with its various modes, including shutter priority, aperature priority, and several more artistic modes.My only disappintment is that I wish it had a longer lens, say extending to 200mm (equivalent 35mm).  Now that is likely not possible given how open the lens aperature is, but if I could change one thing, that would be it.  I know, kind of greedy.Overall, a great point and shoot camera.", "Date": "March 7, 2011"}, {"Title": "This camera is a joy to use.", "Author": "J. H. Smith", "ReviewID": "R1IHC8N2LEFN7", "Overall": "5.0", "Content": "The XZ-1 is a terrific camera, one tat meets my expectations since the mockup of the camera was shown last fall at Photokina.  I have previously owned a Panasonic LX3 (since upgraded to the LX5) and also own a Canon S90 (since upgraded to the S95), so I feel qualified that I can objectively compare the Olympus XZ-1 to those two cameras in the same premium fixed-lens genre.  I have had the XZ-1 for over a week and have taken dozens of photos with it so far.  The photo quality of the XZ-1 is excellent!  Photos have nice color and most camera controls are very intuitive.  I especially like the built-in neutral density filter that is easy to toggle on and off.  The menu system is more simplified that both the Panasonic and Canon, which while lacking some in-depth customization functions is very easy to navigate - another nice feature is that the camera remembers what function you last used, a very handy time saver.  The panoramic picture mode is simple to use and works far better than the Canon's stitch assist mode.  The front control ring around the lens is taken from the S90 but both it and the rear control dial operate far better than on the S90.  I have yet to use video so cannot comment on that though the dedicated video start/stop button seems convenient.  The size of the camera is more in line with the LX3/LX5 than the S90/S95; this is not a bad thing as the S90 is very compact yet also more difficult to hold (even with an aftermarket grip added to the S90 I am always fearful of dropping it due to its size and my fingers are usually in the way of its motorized flash).  As for quibbles: manual focus on the XZ-1 is via an enlarged screen box that would benefit greatly by the addition of a distance scale; also it would be nice if the camera shipped with an AC battery charger in addition to the USB charger (I have already ordered the Olympus AC charger and a spare battery).  Overall I am very pleased with the XZ-1's image quality and ease of use.Update:  I have had this camera for two months now and have taken hundreds of photos with it so thought I should update my review based on usage experience.The Good: Camera is well built and shows no wear, macro shots are terrific, lens is very good, JPEG colors are good and pleasing to the eye, outdoor daylight shots are generally quite acceptable, controls are fairly straight forward, like the built-in ND filter a lot.The Bad: As many others have stated the noise, especially in low light shots, is noticeable and sometimes downright unacceptable.  I hope Olympus addresses the noise issue in a firmware update soon; manual focus mode is not that useful because there is no distance scale and trying to focus with the scroll wheel and an enlarged box on the screen is not very easy - especially in bright outdoor lighting.Other: Have yet to find a decent case for it that is not too large or too snug a fit.  I tried a Tamrac Digital II case but it was a good deal larger than the camera which kind of defeats the point of carrying a premium compact camera, also tried a Lowepro Dublin 30, but that case is thin and not rigid enough to easily slide the camera into.  Ended up ordering a leather case off eBay from Hong Kong - at $11 bucks including shipping its not a bad deal, however the case is still about a half inch wider than it needs to be, but it is much better than the other two cases I tried.  Based on some reviews of other users I think I will try some shots saved in RAW and JPEG to see if it is worth the hassle of adjusting the RAW photos to reduce noise in low light shots.Based on the noise issue in low light and not terribly useful manual focus I think 4.5 stars in more appropriate for this camera.  My dream camera is something like the XZ-1 in terms of size and lens specification with an APS-C sized sensor.  Olympus please make one for me.  In the interim how about a firmware update for less noise in low light and a manual focus scale.", "Date": "February 25, 2011"}, {"Title": "Finally a pocketable companion to a DSLR", "Author": "Jay A. Frogel", "ReviewID": "R24IO73NUCBAD1", "Overall": "4.0", "Content": "When I used film cameras an Olympus XA always went with me for many years as a near perfect complement to Nikon F2s, F4s, and F100s.  The XA used the same film, produced images that were almost as sharp as the larger cameras even when printed on Cibachrome 11 x 14 inch paper, and with its clamshell design was perfectly pocketable.  Since I switched to the D300 two years ago I have been at sea.  I tried an earlier Olympus clamshell digital P and S but it only did jpgs.  Then a switched to a Canon Power shot (or something like that) whcih was certainly compact - fitting in my shirt pocket, but again only jpgs.  Great for 4x6 and even 7 x 11 'tho not with the sharpness of D300 prints of the same size.  And not a clamshell design.  I borrowed a friends Panasonic (predecessor to the LX5).  It was ok but didn't \"feel\" the same as an XA.  Sharpness seemed ok.  Last week or so I read the review of the Olympus XZ-1 on dpreview.  It sounded very appealing.  More than that the comparisons (technical with the two competing models by Canon and Panasonic) showed that the Olympus bested them in terms of image quality for RAW (I will not use jpgs on this camera).  The G12 was a consideration but too clunky - not a reborn XA.  Ditto for the Nikon equivalent (coolpix 7000?).  My local Penn Camera shop had 1 (ONE) so I went down to there to handle it.  It felt great, was compact, fast, bright, etc.  So I bought it.I have taken only a few dozen images with it just to get used to it before going on a trip, so rather than expounding on issues much better dealt with in the dpreview coverage, I'll just give my impressions pros and cons.1. Very fast lens and all focal lenghts.  EAsily beats competition.2. A real wheel that you turn for f/stop in Aperture priority mode.  ditto for shutter priority.3. Amazingly bright screen - comparable to the D3004. Pocketable (but see below)5.  Intuitive arragement of controls and options - at least for people who've used small cameras before.6.  Big RAW images.7.  dpreview complains about small video frames.  For me this is irrelevant so readers of this review need to weigh this.8.  Very acceptable zoom range (the XA was fixed focal length).9.  Not concerned overly with burst rate since I'll use my D300 if I need to (ditto for the XA vs. F100 comparison).10.  A 4 star and not 5 star for a couple of reasons:  A.  The lens cap is easy to dislodge so cannot just stick it in my pocket.  Must be a way to make it more secure - clips, screw on ??  B.  On-off switch to easy to activate accidentally if in pocket  C.  Movie switch ditto, esp since I rarely take movies.Conclusion - NO REGRETS even though I have used it only a little bit.  I can report more when I return from my trip in a few weeks.", "Date": "February 17, 2011"}, {"Title": "my \"perfect\" camera", "Author": "doraemon", "ReviewID": "RL5JEIFG4XHJ6", "Overall": "5.0", "Content": "i have always been a fan of Canon and have had these models over the past 8 years:  Canon G1, G2, G6, Canon S2 IS, Canon EOS 350D, Canon S90... my favorite had been the G6 for the longest time with its F2.0-3.0 lens, but as times goes by, it started to wear out with a slight problem with the zooming control.  it is a shame how newer models of the Canon G line do not have the fast lens anymore.  less then a year ago, i got the canon S90.  it is really compact, but the lens is not as fast.  moreover, when i did a side by side comparion between a picture taken by my G6 versus S90, the G6 actually still takes better pictures.  my Canon EOS 350D takes good portrait, though i find it hard to focus correctly for closeup with the tiny red dot, and it is hard to tell the mis-focus problem while taking the pictures via the optical viewfinder. as a result, half the pictures turn out good, half is out of focus.  it is also too bulky to carry and take it in and out from the camera bag.  therefore, my quest for a compact DSLR camera begin...several months ago, i decided to purchase something other than a Canon and got a Panasonic Lumix GF1 with the pancake lens and a zoom lens.  the camera is much smaller and the pancake lens is very fast, which is great.  however, my initial fear of perspective distortion for portrait shots turns out to be true. even though 40mm should be a \"perfect normal\" lens, it is not.  portrait shots taken from head to above waistline suffers perspective distortion.  of course, i can change to the 45-200mm zoom lens for portrait, but first of all, it is not convenient, second of all, i lose the fast F1.7 lens and falls back to F/4.0-5.6, and lastly, it becomes bulky again.well, my quest continues for a \"perfect\" camera with these simple basic key features:1. fast lens2. at least 4X built-in zoom3. zoom-able video mode4. pocket sizedwith a fast lens, i can take natural low-light pictures without having to use a flash.  i truly dislike using flash and avoid it whenever possible.  in addition, i need a camera with a decent built in zoom for portrait shots, at least 4X.  usually zooming suffers a smaller aperture resulting in slower speed.  even with my very steady hand, i find very often that my objectives, usually children, cannot stay truly still.  thirdly, being able to take zoom-able HD video.  i find it hard to believe even Canon G12 is not zoom-able in video mode.  with zoom-able HD video, i will not need to carry a camcorder anymore.  given i am much more demanding in the quality of pictures and much less demanding in the quality of video, i still do need zooming when taking video.  simply put, i just want a compact, pocket-able camera that does it all.i was quite excited to read about this Olympus XZ-1 last month which answers to all my demands for a compact size camera.  i used to own an Olympus when i was a teenager, back in the film days of course, and i had always been very happy with it.  so i am very glad to be back using an Olympus again.  3 days ago, to my surprise, i received my XZ-1.  it is everything it claims to be and fulfills my quest for the \"perfect\" camera.  it is compact, light, with a super fast lens even at 4X zoom.  with such a fast lens, i am foreseeing the ability to taking beautiful pictures.  though these are some of the minor drawbacks i noticed for now:1. it does not come with a charger.  it only comes with a USB charger which means i cannot use the camera while i am charging.  i have to purchase a charger separately.  it is not a big deal, of course, but simply caught by surprise that such a \"perfect\" camera does not come with something so basic.  the battery is very small, i will buy two more as backup.2. some of the control settings, i.e. focus frame setting & spot metering are not intuitively layout that i have to review the user manual for instruction, which is only available from a CD, not an actual tangible book.3. with AUTO ISO setting, it doesn't display the actual ISO setting when taking the picture :(other than that, i am overall very pleased with the XZ-1.  i was going to give it a 4 star for not having a battery charger, but to be fair, it really doesn't have anything to do with the camera itself other than a packaging issue, so i give it a 5 star for the genius who discovered the beauty of building a truly fast lens into a compact size camera.i can now put all my other cameras aside :)3.3.2011 update:having played around with the camera a bit more, i noticed that the flash does not come on automatically even in iAuto mode.  you need to \"turn-on\" the flash before that flash can do its thing.  it is not a big deal, but just unexpected. anyone out there experience this?  or i may have defective flash?as far as picture quality goes, i compared a picture i took with this vs. my good old canon G6, all with default settings and A mode.  it was a shot of my son in the dining room during the day.  the picture from my G6 is slightly more \"blue-ish\" as supposed to the XZ-1's being slightly more \"red-ish\".  individually, they looked perfectly okay, though in contrast, the difference is apparent. i would say the true color falls somewhere in between the two.  more comparisons are to be done...", "Date": "February 22, 2011"}, {"Title": "Magnificent camera", "Author": "14carbonman", "ReviewID": "RFSBQU9S76EBE", "Overall": "5.0", "Content": "This camera certainly lives up to its excellent reviews, being responsive, flexible yet easy to use, and taking great pictures.  It is not too big to haul around, and the f1.8 lens is sharp. The Olympus jpegs are as usual, brilliant, and can be used straight out of the box, but there is a raw mode as well. It is an ideal camera for the times when the DSLR is just too much to take around, and it is head and shoulders above other point and shoot cameras in the picture quality and low-light situations. It is an alternative to be considered to micro 4/3rds and copycats.  Kudos to Olympus.", "Date": "March 19, 2011"}, {"Title": "Sweet spot for portability and picture quality", "Author": "W. Park", "ReviewID": "RIPMFTAPZLB89", "Overall": "5.0", "Content": "My photographic interests and needs span work and play.Portability -jacket pocket or laptop case (man purse) portable.Fast lens for flash-free photosExcellent depth of field and great sensor, which gives me all the advantages of a dSLR -the foreground focus with background blur -bokeh!Battery life and affordable extra batteriesUsable, intuitive interface and menus -I do not read manualsPrice point -I don't want to spend close to a 1000 for a micro 4/3rds camera that I'll keep with just the 20mm f1.7 pancake lensVideo -just cream on the cupcake. Better than my iPhone and I'm happy.Versatile macro -for taking pictures in clinic and in the operating room.I feel I got all of the above in this camera in spades. I recently took a trip after just receiving this camera and the pictures were a level beyond my prior Canon G8 in a more portable package. While not as portable as the Samsung NV10 I had been carrying to work, it fits well in my laptop case. Am very happy with this. I chose this camera over the S95 and the new Fuji retromatic that is way overpriced.Here is a link to my blog review which I will update as I get to know the camera better.[...]", "Date": "March 19, 2011"}, {"Title": "Almost-perfect pocketable camera", "Author": "N. Cormier", "ReviewID": "R2SS9T8WQ4G3R8", "Overall": "4.0", "Content": "I've been searching for a compact alternative to my DSLR for a long time now, and this is the first camera that meets my needs.There will always be compromises between sensor size and camera size, and this camera takes very sharp pictures for its size, with a very useful zoom range.  I considered getting a Sony NEX for a while, but a lack of small lenses other than the 16mm really limits its portability.  At max zoom and f/2.5, this camera produces best in class out-of-focus blur.My biggest concern when ordering this was... is it really portable?  I was happy to learn that it does fit fairly comfortably in my jeans pockets, and even better in a jacket pocket.  I would say that I wear \"normal fitting\" pants, but skinny-jeans wearers would not find this pocketable.The only feature this really lacks is an AEL/AFL button.  Olympus: it would be great if you could configure the video record button to perform this function.", "Date": "April 10, 2011"}, {"Title": "Currently the value/performance champion", "Author": "PhotoGraphics", "ReviewID": "R1D89GPEXQJ58S", "Overall": "4.0", "Content": "As a pro photographer, I face a quandary.  When I am on my own downtime, traveling or with family, I loathe dragging a DSLR with multiple lenses and accessories.  But yet I feel restricted with most pocketable point-and-shoot compact cameras.  They are just too limiting for things my creative urge wants me to do.  Fortunately in the past couple of years there has emerged a relatively new class of pocketable camera that is small enough to take anywhere but offers decent manual controls and respectable quality.  Nikon, Canon, Panasonic, Sony and others all have great bridge cameras between $500 - $700.So let's get this out of the way immediately ... at the current retail price of $499 ($399 street price) for the Olympus XZ-1 it is a serious contender.  At Amazon's Black Friday price of $199 it is an absolute no-brainer.  While at twice the price I may have had a couple of \"if only's\", at the Black Friday selling price it is without any doubt THE best overall camera in its price range ... bar none.  And no this is not an ad, I have never worked for Olympus in any way, and this is the first of their cameras I have ever owned.Because I bought this as my personal fun camera I will stay away from any techie talk and tell you what can help you make an informed buying decision.  There are several excellent technical reviews online, including the dpreview link at the top of this page.  I also won't compare it with other cameras that I don't own or brands that I think are \"better or worse\".  I'm reviewing something that I own and use.- I don't think it's possible to find a camera with more of a solid, quality build for anywhere near the price.  Be aware this is NOT as ultra-slim as some other cameras in its class.  Personally I would never put it in any pocket, more like a belt case.- Best-in-class features include a superb Zuiko lens with a largest aperture in its zoom range of F:1.8 - 2.5.  A couple of new cameras are being introduced with a largest  aperture of F:1.8 but to top off at maximum zoom at F:2.5 is unheard of anywhere near this price range.  The camera's smallest aperture is a useful F:8.0- For the millionth time in my career, more megapixels does NOT necessarily make a better picture.  Olympus is making a huge statement for that by matching their larger than average sensor to a respectable 10 MP to result in a camera with simply amazing low-light performance and superb resolution, without resorting to excess unnatural electronic processing.  If you haven't already done so, you would be well served to do some research about the topic of megapixels.  There is consensus that 6 MP was the necessary sweet-spot and anything above that for 95% of users has little impact on \"making a better picture\" only an extreme enlargement (like 24 x 36) which a fraction of one percent of people actually do.- The lens ring, which several other brands now have, is in my estimation the best of class.  It defaults to the most appropriate usage for each dial-mode setting.  For example, in the program mode (where you let the camera make most of the decisions, the dial defaults to ISO setting, which is at that point the most important decision I want to make myself).  If you prefer using the fully automatic setting, Olympus thoughtfully gives you a very decent range of simplistic personal override settings to tweak what the camera chooses to do.  The logical use of the lens ring for every other mode always ends up being the perfect choice.  I tried other cameras that let you assign what function the lens ring performs and it is a pain to have to remember what you assigned.  The lens ring also has the best \"feel\" to it of any camera that has one.- The mode dial is much more like a DSLR than a compact camera.  All of the right functions are there and nothing more.  Trust me, when you actually own this camera you will find yourself using manual controls much more than you do with most other point & shoot cameras.- The lens cap is controversial.  I have my opinion.  The leaf cover most other brands use is the #1 most vulnerable component of a compact camera.  Once it breaks you are hosed.  While the old-school plastic lens cap seems like an anachronism, it really is a better solution.  It is held on to the lens barrel by simple friction and the motion of the lens extending pops it off automatically. If \"losing it\" is one of your major fears, buy a dozen of them, they are extremely cheap.  I use the included tether to keep it from getting lost, so problem solved.- The 3\" OLED viewfinder screen is awesome.- The owner's manual is not.  It is an embarrassment to a camera that was meant to sell for $500. There are menu options that defy logic and they deserve a better manual to explain them.-  Like the camera's manual, the software documentation is virtually non-existent.  On the topic of software, I don't recall ever using software that took so long to install.  And then before letting me use it, it forced me through about 6 software/firmware updates.  The total time to install the software was about 2.5 hours.- The iB software, however, is superb.  For the first time ever with a Point & Shoot I am shooting everything as jpg+raw.  The image out-of-camera requires very little post-processing, but the option of \"going back and doing it again\" with the raw image using iB means I will probably rarely if ever drag my DSLR equipment along again on a fun/family outing.- The accessory shoe is unheard of at Amazon's current selling price, making the XZ-1 one of the most ideal bridge cameras out there.- I happen to like the dedicated movie button, although I will rarely use the camera for movies.  Just one more thing to get off the mode dial but \"be there\" if that priceless moment comes along that you need to capture on video.  Video quality is usable, but this is a still camera.  I fail to see why a few users downgraded a camera they say they love because the video quality isn't perfect.  If video quality is so important it's probably best to get a dedicated video camera for your needs.- The menu system is an important part of any digital camera.  Unlike old school film cameras which had a few dedicated controls to handle basic photography adjustments, almost all digital cameras have a plethora of controls.  Having control over your camera is useful when you have the opportunity to take the time to compose and adjust for the perfect shot, and that tends to describe the function of a DSLR.  Point & Shoots on the other hand are designed to capture the rare candid moment in which you only have a split second to frame and press the shutter button.  So many of the current P&S; camera tend to lean toward \"the camera does it all\" or the other extreme in which the photographer has dozens of setting options, often buried deep within menus upon menus.  The initial reaction to the XZ-1 is actually a little frustrating in that so many settings I was familiar with on \"lesser\" P&S; cameras simply were not there.  My first impression was that I felt too limited.  It really takes a while to get used to Olympus' menus, so much so that in the first week I did a full reset several times because I felt like I was backed into a corner and couldn't set the camera the way I wanted.  That's when I discovered the brilliance of the \"custom\" position on the mode dial and of setting most of the other mode settings at their default setting.  As I alluded to earlier, the mode dial will probably be used by me (and maybe you) far more often than you are used to on most digital cameras.- Nitpicks: I don't care much for the shape of the shutter release button.  Olympus went for style over function here and its flat shape makes slightly difficult to locate your finger on it without searching.  The detents on the mode dial could be just a little stronger.  No handgrip but I wrap the neckstrap around my hand anyway.  I'm not crazy about zoom levers around the shutter release but they seem to be popular.- Little niceties:  The supplied strap is soft and has nice non-slip texture.  Possible to program playback button as on/off switch.  All buttons except shutter have exact same tactile feel to them.  Metal door over inputs/outputs.  Metal tripod screw.  Positive detent at halfway point on shutter button.  Ridge around video button so not easy to press accidentally.  Positive lock for battery/SD card door.  Hangs level from your neck/shoulder (yes this is something positive).- Hint:  If you own/buy one of these, the best way to turn the rear control dial is by using the fingernail on your forefinger.  If you instinctively use your fingertip or thumb it is hard not to press the directional button.  I like this control but it is way small and after I discovered the fingernail trick it was much happier with it.So, what about the bottom line, what kind of pictures does it take?  I've always preached that cameras take pictures, photographers take photographs, and that the hardware is a minor part of the creative process.  This is especially true in a point & shoot. But on the other hand, a well-designed camera does allow you to best express your creativity.  As a pro, my conclusion is that I doubt if any current compact camera will give you more capability to take better photos than the XZ-1.  Its design simply has no significant limitations to your capabilities to take the most basic of snapshots and have them look good, or to have a pocketable compact camera give you the flexibility to not feel bad you left your DSLR at home.I take a lot of photos indoors or at night.  The larger sensor coupled with a low light CCD and fast lens is the #1 reason I chose this model (the Black Friday deal being a close second).  While it doesn't perform magic, I am blown away by what it can do in challenging low-light situations without resorting to an unusable high ISO or too low of a shutter speed.  My first test shot was taken after sunset of the entrance to a restaurant.  Using the low-light setting on the mode dial the camera auto-selected F:2.3, ISO 400 with a shutter speed of 1/40, certainly a usable handheld speed.  My eye told me at that aperture and ISO I should not have been able to take the shot handheld.Good compact camera prices are not coming down; in fact many of the good ones now cost as much as an entry-level DSLR.  I think it will be a very long time before we see a significantly more capable camera than the XZ-1, and after this deal is over I'm not sure if we will ever see one for under $200.So, should you consider it?  Consider this, the replacement has already been announced, the XZ-2.  The \"differences\" are extremely subtle ... a little screw-on handgrip, a lever that makes the lens ring clickable or smooth-turning, a CMOS instead of CCD sensor (both have pros and cons), and a tiltable LCD (although apparently it is no longer an OLED).  Otherwise the camera is identical, including the exact same lens.  The announced retail price is $600.  Once the price deal is over and the XZ-1's are gone, if you want this camera it will cost $400 more for the same thing with some minor tweaks.  Remember I am reviewing the XZ-1 for its value/performance at the current price ... if we were talking about $600 cameras it would be a whole new ball game.[EDIT] The day after I wrote this the Black Friday deal ended and the XZ-1 price has been unstable but seems to continue to go up. Also, there are several additional comments attached to this review about the camera and accessories.  I hope they are helpful to you.", "Date": "November 17, 2012"}, {"Title": "Probably the best high-end compact camera on the market cheaper than $1200", "Author": "Oliver! \"Tea house warrior\"", "ReviewID": "R1I4WS7XMQNYMR", "Overall": "5.0", "Content": "If you are on the market for a small camera that you can carry around with you all the time, that would also produce high quality images if not all than most of the time, and unwilling to spend £1500 on Leica X1 you know your choices are very limited.So far there were only tree cameras that I narrowed down - Canon PowerShot G12, Panasonic Lumix LX5, and Nikon Coolpix P7000 but none of them appealed to me, for different reason.Canon has the lowest image quality of these three (still very decent compared to other compacts), Nikon is too large and looks errr, odd, and Panasonic produces very strange, sometimes unnatural colours.I was awaiting for the forthcoming Fujifilm FinePix X100, but it looks like it will be difficult to get for a while due to low production after the quake and very high demand (yes, it's that good), so no price reductions quite for some time, and £900 is still a lot for a regular person who just wants to make good pictures of his kids and some views from the trips.Olympus XZ-1 comes as a very good and reasonable choice. It has larger image sensor and very wide and bright lens that lets lots of light through. As a result all images are of a very high quality, both on screen and in print. It is easy to operate, especially if you shoot in automatic settings like me. Good speed and decent battery life. Very light to carry around. Have only been using it for a few days but very positive results so far. Will update this review once (if) I hit some major drawback.Some people note that it has not-so-good video recording, but I am not using as as I have a dedicated, and very good Sanyo camera for that (which does poor still images, which only proves the point that every product can only excel at one thing).PS. I've updated the firmware straight away as it seems there were some focus problems with earlier models.", "Date": "April 9, 2011"}, {"Title": "From a Pro Photog's perspective, this is a great pocket camera.", "Author": "Tzar", "ReviewID": "R2FH4CO1VGD2CX", "Overall": "5.0", "Content": "I've always been a big fan of Olympus esp. their optics. When I got to know that Olympus released a Compact camera with the Zuiko lens, I was so excited. Bought this just before our holiday to UK. I was very confused whether to take my 5DMKII or this and honestly I'm very glad I took this camera along instead of a DSLR.Some of the brilliant things about this camera:1. F1.8 - f2.5 helps in getting some decent Depth-of-field and clean bokeh and not messy bokeh.2. Image Stabilisation is brilliant.3. The LCD screen's visibility and angle of view is fantastic.4. ND filter for that extra slow shutter.5. Hot shoe for external flash.6. RAW images (.orf)7. Super fast focusing. The time between clicking a picture being ready for the next one is really short compared to other compacts in the market8. Pop-up flash is pretty good. You can actually use slow-sync (1st or 2nd curtain)9. Super Macro is just brilliant.10. The build quality is very sturdy.11. The dials and it's usability.12. Very silent clicking.13. Friction lens capThings that could've been better:1. A little slow at zooming2. Battery doesn't last longer than 200-250 snaps.3. Video is ok, focus is the issue4. Mic is not great5. Shows some sort of vertical lines when pointed at the sun while taking backlit videos, doesn't appear in pictures.6. Proprietary sockets for USB and HDMINow, if you look at the price it's an amazing camera. Now they've released a new CMOS version, I guess it allows you to shoot at higher ISOs. Otherwise this is an awesome camera.Hope this helps.", "Date": "October 12, 2012"}, {"Title": "Best Compact Camera (with a small sensor) on the market", "Author": "Ken", "ReviewID": "R226T7Y0UP5C8J", "Overall": "5.0", "Content": "Camera Phones have had a huge impact on the compact camera market. Potential Customers need a compelling reason to spend hundreds of dollars to buy something they may already have built into their phone.A genre of cameras commonly called \"premium compact cameras\" has emerged.  These cameras traditionally were priced in the $300-$500 range, have sensors a little larger than the usual compact camera sensor, have full manual controls and a bright maximum aperture.  They vary a bit in size from the smallest (Canon S90/95/100 series) to a little larger (LX3/LX5 series; Olympus XZ-1) to pretty big and chunky (Canon G Series).  As 1\"+ sensors are now finding their way into smallish cameras (Olympus PEN series especially the E-PM1; Nikon J series, Sony NEX series, etc) this category is becoming blurred.  Most recently, Sony has redefined the entire concept of a premium compact camera by somehow squeezing a 1\" sensor inside a really small camera (see my Amazon review of the Sony RX-100).The Olympus XZ-1 is the best of the premium compact cameras in its price range.  It does almost everything right.  It has a maximum aperture of f/1.8 at the wide end and still a very bright f/2.5 at the telephoto end.  It has a very usable 28mm-112mm equivalent zoom range with a big/bright LCD screen.  Most importantly, photographs taken under almost all lighting conditions are excellent (as long as you don't stray above ISO 400).  10MP is a sensible choice for a small sensor camera.  Automatic White Balance, metering, color saturation all are spot on accurate.  There is a hot shoe for an external flash (The FL-300 is a great/small external flash with bounce capability) and full manual controls.High ISO performance is not very good (there is still a small sensor after all) but the fast apertures go a long way to avoid going into that territory.Although the specifications of this camera are similar to the Panasonic LX5, the Olympus simply takes much better photographs.  The Canon G Series is more solidly built (although the XZ-1 is no slouch in the build department) and has an optical viewfinder and more controls. However, one can not compare the G Series Image quality (I am not including the $700 G-1X here) to the Olympus XZ-1 either in good or dim lighting.  The XZ-1 is just that much better.How can Olympus make this camera even better?  Perhaps a larger sensor to boost high ISO performance like the Sony RX-100; also an optical viewfinder like the Canon G series (and the classic Olympus C series of yesteryear) would be great; also including a built in lens cap like the Canon offerings (or even a snap on cap that actually fits like the LX5); adding some kind of rubber grip; improving the macro shooting quality as it is now \"hit or miss\" and including an external battery charger (the battery must be charged while inside the camera; after market external chargers are available for a few dollars).If you are looking for an affordable, smallish camera that takes great photographs in most lighting conditions with full manual controls and a hot shoe for an external flash, this camera is the best available.  Better picture quality begins at 50% more in cost.  I do not use the video and so obviously I can not comment on that feature.", "Date": "July 29, 2012"}, {"Title": "Exceptional Camera", "Author": "petander", "ReviewID": "R2LWVXUZBQGPKF", "Overall": "5.0", "Content": "After extensive research of \"enthusiast\" point and shoot cameras, I selected this one.  My criteria were simple - a compact unit, that takes excellent pictures and video.  This camera delivers that and more.  Just holding it in your hands, you can feel the quality craftsmanship and materials.  The user interface is intuitive and logical, with not too many options, but enough to capture the typical shooting environment. Very easy to toggle between manual and automatic settings. The screen is very bright and clear, the system starts up quickly and focuses quickly too.  And of greatest importance, the pictures are sharp and the colors true.  I have tried indoor and outdoor shots, still and action shots, all with beautiful results.  I have not done much video yet, but a few short clips worked seamlessly. For a comprehensive technical review, check out the analysis at [...].", "Date": "March 22, 2011"}, {"Title": "A great little camera for its class", "Author": "Uncle Ruddy", "ReviewID": "R1QYSZ7825YU15", "Overall": "5.0", "Content": "I have had this camera from the first day it came out. A very intuitive design and operation.  I compared my indoor family pictures with those taken by my son on his Nikon D700, both with no flash.  Happy to report that even the Nikon could not capture pictures of kids running inside without blurring. But for everything else I have been more than satisfied with the results - frequently the results are frame-worthy.  Sure there is higher noise with higher ISO's, but with all the intuitive options - shutter speed and aperture, scene options if you want -  it is easy to compensate and keep the ISO usably low.  About the lens cap many have problems with: where's the beef?  It protects the lens perfectly; it automatically pops off when I turn on the camera; I followed directions and have the lens cap tethered to the body so it does not fall away. And the camera fits in the Olympus case with the lens cover on. Olympus has done a great job with this camera.", "Date": "March 8, 2012"}, {"Title": "Terrific Little P&S;", "Author": "James M. Bailey", "ReviewID": "R1PW4PLWAWT9RI", "Overall": "5.0", "Content": "Received this as an Xmas present, along with the VF-2 EVF, and I am impressed.  As a former pro, and a P/T pro now, I can attest to the top-notch quality of Zuiko glass.  I have a whole gaggle of old yet fast OM system glass that I still use on my 25-year-old OM4t, as well as adapters that allow me to use this glass on my E-3s and m4/3 cameras.  In addition I have many of the high and mid-level dust and weather-sealed pro-grade digital Zuikos like the 7-14, 12-60 SWD, 50 F2 macro, and 50-200 SWD.Well, the i.Zuiko glass in the XZ-1 is right up there with its pro-level siblings.  Clear, precise, nice contrast, tack-sharpness, at all focal lengths, and only stops down to F2.5 at full reach of 112mm for silky bokeh.  Zoom works quietly and efficiently.  RAWs are easy to work with, and the jpegs are near-perfect in WB and snappy GORGEOUS color reproduction (something Olympus excels at, are you taking note Panasonic?)  Very good IQ and dynamic range for a small-sensor P&S.;  Very little shutter lag, quick to respond.  Macro focusing works like it should.  And with the VF-2 EVF, it's even more fun, because that is one sweet high-res viewfinder!My only concern was that in very bright light (for example sun reflecting on snow) there is sensor bloom at focus lock across the entire OLED and in the EVF, where it'll turn pink-purple at focus lock.  But Olympus said this is normal, and my camera sales guy confirmed that with bright aperture glass like this, you can expect some bloom in bright light, esp. with the ND filter activated (BTW, another big plus).  As long as the pink and purple don't make it to the final product, you're fine.Menu system took a little getting used to, because there are only a couple pages in the main camera menu for each function.  Most of the day-to-day functions are accomplished using the two dials, the one in front around the lens and the other in back.  You'll get used to them, as I did.  Normally I can take pics with a camera and understand its functions in 1/2 hour, with this one it took 45 minutes and a quick visit to the manual (on disk).Build quality seems good, and the OLED monitor is a joy to look at.  All in all, a decent little camera with a bright and sharp lens and outstanding jpeg processing that makes the grade.  Without the EVF, it is DEF pocketable....Don't let the fact that it's only 10.1 MP scare you off.  That seems to be just right for this sensor, which is the same one used in the Panny Lumix LX5 (and both share the same Venus Processor.)  Shots above ISO 800, however, do show some noise; if U go above 800, shoot raw and that will help some.  But the cool thing about this baby is the bright lens allows you to shoot at lower ISOs when possible, so there is a trade-off that works.And one more bonus, especially for those of you with Olympus FL-50R and 36R flashes: the XZ-1's flash will fire them remotely as a slave trigger, similar to what the $1500 E-5 (and older E-3s) do.  Olympus strobists rejoice!Cons are very few: no dedicated battery charger (USB only), flimsy USB/AV door, no grip on the left side.  However, it is so diminutive, you get used to holding it under the front ring and on the side.  And the video is terrible, so don't buy this camera for its video.  There are others out there, like the LX5, that do MUCH better at video.All in all, a nice little compact camera with outstanding fast and bright Zuiko glass that takes great raw and stunningly beautiful jpegs--just don't get it for video, and understand that extremely high ISO (1600+) is not a good idea.  Well done Olympus!", "Date": "December 27, 2011"}, {"Title": "Best compact available?", "Author": "James P. Kniffen", "ReviewID": "R3UTFZR33900HZ", "Overall": "5.0", "Content": "Not to use hyperbole, but I would submit that this is one of the best small-body cameras currently on the market. But first... a bit of background.I upgraded from a Nikon point-n-shoot to a Sony NEX-3 with the 18-55mm F3.5-5.6 kit lens in January 2011... the NEX-3 was my first experience with an APS-C (i.e.; SLR-sized) sensor, and the image quality was absolutely astounding. I absolutely cannot fault Sony at all for the build quality on the body and lens--I've held \"normal\" dSLR kits that didn't feel nearly as sturdy and well-made. HOWEVER (and this was a deal-breaker), it didn't have enough buttons. If I wasn't making many adjustments to exposure compensation, ISO, aperture, etc. then it was a breeze to use... but once I started to get more comfortable with the camera and playing with more settings the lack of buttons really slowed down its operation. I sadly parted with the NEX-3 (thank goodness for Amazon's great return policy) and started my search for a replacement.In case you didn't figure this out, I love buttons and dials on a camera--the more the better. The XZ-1 is fairly unique in the camera market because of the aperture ring around the lens. This is probably the single-best feature on this camera, aside from the crazy-fast lens. Obviously it fits in the barely pocketable size category, but it is still pocketable in a good-sized cargo pocket. Once you go menu diving to increase the JPEG sharpness the image quality is almost indistinguishable in good lighting conditions from the NEX-3. Sadly it's a compact camera, which means any ISO above 800 is effectively unusable. As long as you can keep your shutter speed to within reason without jacking up ISO, it's a phenominal camera. I took it on a 3-day trip to Washington D.C. for 4th of July and got great pictures in museums, Arlington cemetery, and even excellent hand-held fireworks shots. Obviously it's no SLR, but once you learn how to use it this camera cannot be beaten in the compact sector. Highly recommended.", "Date": "July 9, 2011"}, {"Title": "Olympus XZ-1 camea", "Author": "Jack A. Taylor", "ReviewID": "RK0F91S5YG7KR", "Overall": "5.0", "Content": "Excellent camera; almost a replacement for my Panasonic GF-1. I find that the automatic settings are excellent, and it just about seems unnecessary to use manual settings - except in rare occasions when you're faced with unusual situations and/or want special effects. I like the size - it's big enough to control in my hands yet small enough to carry in my pocket (although larger and heavier than the Canon S95).The video is not the best, however. Compared to my Canon S95 it's not as sharp.", "Date": "March 19, 2011"}, {"Title": "Excellent camera for the money - fantastic in low light", "Author": "Michael Appel", "ReviewID": "R12JLPSM79M04R", "Overall": "4.0", "Content": "This is an awesome camera for the money.  Takes sharp, clear photographs and really works great in low light.  It does have some serious problems though that prevent me from giving it five stars.  First, the lens cap is useless.  A camera like this, which boasts an Olympus Zuiko 1.8 lens, should have a threaded lens so you can attach a protective filter.  It does not.  In addition to that, the lens cap provided with the camera is worthless.  The second problem is that the camera has no grip at all.  It is very hard to hold.  Also, the mode dial should have deep, positive click stops to it.  As it is, when placed in your pocket, the mode dial can easily be moved accidentally.  While the battery provides power for plenty of photos, more battery power would be nice as well.  Aside from those flaws, this is an outstanding camera.  I use a 32 GB class 10 SDHC card and this camera is blazing fast.  The sequence mode is amazing, zoom is fast, focus is great, exposure comp, metering modes, and all the other settings work very well, allowing you to take the photo you want in virtually any condition.  Focus is fast, sharp, and accurate.  The occasional blurry image is due to me and not the camera.  I am used to taking photos with my Olympus OM-2N's, OM-4's, and OM-4T's, all with attached power bounce grips and winders.  Maybe that is why this camera is hard for me to get a grip on.  I solved the problem by ordering the Olympus FLBK01 flash bracket, the Olympus FLCB02 cord, and the Olympus FL-50R flash all from Amazon.  Now I get a great grip on this camera and the FL-50R flash syncs perfectly with the XZ-1 and produces amazing photos, far better than with the built in flash.  The built in flash is fine, but doesn't provide the range I'm used to.  Also, by using the flash attached to the grip I eliminated the red eye problem.  Now, I'm comparing a small point and shoot camera to my professional film SLR's and I know that's not fair.  But this is an amazing combination.  I posted some photos of this set up here at Amazon.  I solved the lens cap problem by purchasing the JJC auto lens cap here on Amazon and that works great on this camera.  The viewing screen on the back is beautiful, but in the bright sun you can't see much of anything.  The build quality of this camera is very good.  For the money you can not beat this camera.  It takes great sharp, clear photos and fits right in your pocket.  It is amazing in low light without a flash.  A great little camera.", "Date": "November 5, 2011"}, {"Title": "GREAT CAMERA", "Author": "cherel", "ReviewID": "R8T5F2LL8RSG", "Overall": "5.0", "Content": "I am a very amateur photographer, but I love great pictures. This camera is awesome! I have tried for years to find a camera that takes really greatpictures and this one does. I have bought other cameras that have had really great ratings but I never really gotthe quality that I wanted. I have only had this camera for about a week but so far I have not had a bad picture yet.The only thing that would make it better is if it had a bigger zoom. Other than that It is the very best camera!!!", "Date": "May 25, 2011"}, {"Title": "Very nice for $300", "Author": "Coronet Blue", "ReviewID": "R3VZEDPNTWNY0Q", "Overall": "4.0", "Content": "I've owned a lot of these small sensor compacts, always looking for a pocket camera that gives SLR results.  (The Sigma DP cameras meet this requirement but are a pain to use and lack zoom lenses).  The Sony RX-100 isn't bad but my expectations were so high, I ended up returning it because it was good, not great.  So that's where I am coming from.  However, if you are looking to replace a compact camera with a better one, the XZ-1 is an excellent choice now that the price is down following the introduction of the XZ-2.  The area where the XZ-1 excels is the lens, but not for the reason that is constantly mentioned.  Yes, it is a fast lens and that's good.  But what almost goes unmentioned is that it is a sharp lens, even in the corners. even at wide angle.  This not the case with the LX5 or the S95/100 and there is no software that will correct for mushy corners.Of course, everyone's needs are different.  For example, the XZ-1 won't fit in a pocket the way the Canons will so that might be the deciding factor.  The LX-5 has a beautiful metal body whereas the XZ-1 is plastic.  Some people obsess over the lens cap, and so on.XZ-1 Plusses:  Faster and sharper lens than LX5 or S95, great default colors, simple yet versatile controls.  Minuses:  Lots of noise above ISO 200 (same as other cameras with this size sensor, actually slightly worse), clips (blows out) highlights terribly (same with other cameras with this size sensor), plastic construction, made in China, no viewfinder unless you go for the electronic which makes the camera too expensive, in my opinion.To sum up, at $300 it's simply superior to the Canon or the Lumix, at least in terms of output for still photos.  No idea about video.  For the $600 they're supposedly getting for the XZ-2, either the Fuji X10 or the Sony RX100 is a better choice.  The Sony has a much larger sensor and captures more detail with much less noise; the Fuji can handle highlights without blowing them out (the only compact camera to do so) so it's a good choice for high contrast applications like night photography.I really enjoyed using the XZ-1 and in the center, it beat my X10 for sharpness (although it wasn't quite as good in the corners).  But I had forgotten what a great job the Fuji cameras do with holding detail in the highlights so I guess I'll stick with the X10.  Since none of these cameras is really that spectacular, if I was starting over, I'd get the XZ-1 and save the extra cost of the X10.", "Date": "September 22, 2012"}, {"Title": "If you can't take good picture with this, then it's you", "Author": "steveclay52", "ReviewID": "RLQKARMVWAFT2", "Overall": "5.0", "Content": "I have lived with this camera for a month now--I did a LOT of research before deciding to buy this camera.  In short, it exceeds my expectations and my abilities.  If you can't take a good picture with this camera, you need to spend the time and read the volume of instructions ( and it IS a volume).  The camera is superb, the versatility is beyond what I would have expected possible in such a small package.  The results have been truly remarkable.  I could not be more pleased.  If it holds up to daily use and carry, I anticipate using it for a long time.  The detail possible is incredible if you follow the directions in the instructions.  It takes hours to read through the instruction manual, but the time is well spent.  This little unit is truly an engineering marvel and I give it my highest possible recommendation.", "Date": "August 13, 2012"}, {"Title": "Simply amazing little camera", "Author": "North Wolf Photography", "ReviewID": "R2NEIUCOYPSX1F", "Overall": "5.0", "Content": "I'm a high-end hobby photographer that normally shoots a Canon 60D or an Olympus PEN EPL-2.  I enjoy shooting with the PEN but its still not quite small enough to pocket in most cases.I've been struggling to find a pocket sized digital camera I \"liked\" and was happy with the image quality.  A dozen pocket cameras over ten years and I've never been happy with the consistency or controls on any of them.I've finally found one that is both a lot of fun to shoot with and for outdoor photography it's hard to tell what was shot on my 60D and what was shot on this camera.First off the lens and image quality.  The only disappointment for me is that the minimum aperture of the lens is only F8.  Granted, the lens is so sharp F8 looks about the same as F13 on my PEN which is saying something... Plus with the built in software based ND Filter.The lens goes down to F 1.8-2.5 which is as fast as any glass I own for the SLR.  Granted, a pocket camera DOES handle light a lot differently then an SLR or even Mirrorless system camera; but it lets in a lot more light even stopped down then any other pocket camera I've ever owned.From F4-F8 the lens is tact sharp with very little distortion that I can see. I don't see any real \"blurring\" or artifacting on the edges in this range at all.  It also handles Chromatic Aberation better then a number of my lenses for my Canon SLR.It handles ISO about equivalent to my old Rebel XTi.  Which means, yes the 60D blows it out of the water.  That said, that its on par with ANY SLR as a pocket camera is impressive.  The camera has no noticeable noise from ISO 100-160 and is easily correctable from 200-800.  Anything past ISO 1600 is pushing it.Compared to most pocket cameras, where I flinch at anything over ISO 200; even then the sharpness just isn't there.Build quality its solid.  Metal casing but much lighter then the PEN.  Comfortably fits into one hand between shooting where the PEN is heavy enough it needs the neck strap to be comfortable.Control wheel on the front is a joy to have and use, and while its only fully customizable what it does in the Custom mode; the context sensitive makes sense.  I actually don't mind shooting in P since its easy to change the ISO with the wheel.  I'm used to changing the ISO through the menus otherwise, which is nearly identical in operation to the EPL-2.Bought this Refurbished because I couldn't justify its original price tag of $499 for a pocket camera.  Hands down the best digital pocket camera Olympus has ever made.  Wish it were still in production and almost tempted to buy a spare just in case it breaks or I wear it out...I'm not impressed by its successor as its a much bigger camera in all aspects, especially width.  With the fold out screen you might as well just get a PEN, the body is just about the same weight and width; there really is no difference.It has its limitations.  Its still a pocket camera.  It doesn't have the zoom or versatility of an interchangeable lens system camera for sure. It doesn't handle noise as well either but it blows every other pocket camera I've touched out of the water for it. It's not as fast as an SLR for focusing but its still plenty snappy.I won't be selling my 60D nor Olympus PEN but the XZ-1 makes a respectable addition to the family. It's got a home for as long as it lasts. I'm not ashamed to post photos taken on this camera with the rest of my gallery; and its spot on consistent.  Once you learn this camera you'll fall in love.", "Date": "July 10, 2013"}, {"Title": "Compact camera with DSLR image quality", "Author": "Alfred Rohling \"Gadget Guy\"", "ReviewID": "R2A1YC108QAFSX", "Overall": "5.0", "Content": "I bought this camera because of the very fast f1.8 lens and the fact that it was on sale for a very reasonable price ($249). I suspected the price reduction was because a newer version was coming out and I was correct. Olympus is introducing an XZ-2 model that will have a 12 MP image size and more features. However the newer model will also cost substantially more. So if you are the sort of person interested in the latest and greatest, buy the XZ-2. If you are more concerned with getting a great camera for a great price, buy the XZ-1 (while it is still available).I am very impressed overall with this camera. I am especially fond of the macro images you can take. With the built in ND filter, you can open the aperture to f1.8 in daylight which results in a very pleasing bokeh. With the ability to shoot RAW, jpeg or both you can select what mode works best for you. The built-in art filters affect the jpeg images, but not the RAW images so you are losing nothing.Looking at the images at 100% view in Photoshop, I was impressed with the quality of the resolution. It may be only 10 MP, but you should still be able to make fairly large prints with no loss of image quality.All in all, you would have to buy a semi-pro grade DSLR to get better image quality. Not many compact cameras can come close to the features in the XZ-1 and virtually none come with an f1.8 lens", "Date": "October 20, 2012"}, {"Title": "Pretty close to perfect", "Author": "Amazon Customer", "ReviewID": "R348IML68UXCK5", "Overall": "5.0", "Content": "We just received this camera so I will leave a very short review and follow up with an edit in the future.First I will give some back ground as to my skill set.  I'm a pretty fair amateur photographer.  By far my favorite subject is people so I typically have a 50mm lense on one of my 8 film slr bodies (Minolta and Pentax both auto and manual focus).  But I do also carry a Nikon D70 and Nikon D50 which are both great cameras.  But As far as carrying any of these to a casual outing they are all too heavy and cumbersome (except for the MF and those don't do well at catching kids playing).  I was looking for an alternative to carrying around an SLR for everyday shooting of kids and vacations and what not, but I had three reservations about this camera; focus speed, video quality, and most importantly image/color quality.As for the first issue, this camera is pretty dang fast for a \"compact\" camera.  I was able to focus and shoot 8 to 10 single images of my daughter running around in the park in just a couple of seconds and only one of them was out of focus and that could just as easily been me and not the camera.  As for the video quality I will say up front we do not carry a video camera on a normal basis so I don't have much to compare with, but for the occasional video of my kids playing at the park or a quick birthday candle blow out this will definitely do the trick.  The nice thing is that even though it only records in 720p, it will upscale on the output to 1080i so I can still play it on my HD TV and it looks pretty good as long as I use the mini HD connection.Note:  output from the AV connector in the box is pretty horrible so don't judge by that.  If you use a mini HD the jpegs look almost film quality even on a 50 in TV.The third point I would really like to make is that I use professional quality film (Kodak 400UC that is no longer sold ... of course) and the color replication of that film is unparalleled.  Unless you want to spend hours post process (which I don't).  This camera comes as close as I have seen to replicating the same colors straight out of the camera.  In addition the images are sharp and the clarity is outstanding.My only con is the telephoto reach ... which is honestly a minor nit considering that F1.8 lens is still at F2.5 even at the 112mm lenght.  That's pretty impressive.If you are a person who normally carries a DSLR/SLR but don't want to lug one around all the time.  This camera is about as close as you are going to get to a perfect, much more compact, dslr replacement.", "Date": "March 26, 2012"}, {"Title": "I'm impressed!", "Author": "Me reads \"M.A.D.\"", "ReviewID": "R201MDWUV9CQJW", "Overall": "5.0", "Content": "I was looking for a camera that had the ability to shoot low light and action photos.  It has a very low aperture and bright wide lens to handle these kinds of photos.  The image stabilizer does a great job in preventing blurriness in low light photos.  I was particularly impressed with the heavy duty metal body of this camera. Too many cameras today are so lightweight and have plastic bodies.  Call me old school, but I appreciate the heaviness and durability of a metal case. I can't review the video on the camera, because I've never used it and I doubt I ever will.  My only \"Beef\" with the camera, like others, is the shoddy lens cap that pops off with a slight breeze. I purchased one of those self opening lens covers, problem solved.Overall, I'm tickled with this camera and would definitely recommend it.", "Date": "February 8, 2012"}, {"Title": "Great choice for travel camera; super for low light pictures", "Author": "smarmer \"smarmer\"", "ReviewID": "R1UR2DBN20ZBX9", "Overall": "5.0", "Content": "Over the years I have taken many cameras on trips.  My Nikon D-90 with the 18-200 VR lens was the perfect choice for an Alaska cruise.  The Canon elph-300-hs was the perfect shirt pocket camera to take to conferences in New York, Chicago, and at home in Los Angeles.  My early experience with the Canon Power Shot A620 was perfect for a cruise in the Mediterranean.  And my Fujifilm F-30 and later my F-40fd taught me the advantages of a faster camera that can take indoor photographs without flash.  I also have the Panasonic GF-1 with the 20mm pancake lens.  That particular combination -- especially that superb lens -- takes superb pictures and is my favorite \"walk around\" camera.However, on the premise that the best camera is the one with you, and with the knowledge that I don't like lugging around a heavy body and a lot of lenses, but also want something that feels steady in my hands, I turned to the Olympus xz-1.  Along with my GF-1 it has become my favorite camera, and the one I now take on all trips (except perhaps those that demand a really long lens).I thought long and hard considering the Olympus xz-1 versus the Panasonic Lumix DMC-LXS-5.  Each one is worthy.  The Panasonic has a wider lens -- something I value greatly.  But the Olympus has the faster lens, and I really do not like using flash.  The Panasonic is about $120 or so cheaper, and that was very tempting.  The other contender -- the Canon S95 is even less than the Panasonic by about another $30 or so and is smaller, but I didn't think the image quality was as good.Why did I end up with the Olympus xz-1?  The lens is great.  The lens is very fast.  The movie function is excellent.  Image quality is superb.  It is just the right size -- if I want I can use a strap and carry it around my neck with very little weight, but I chose to use one that went around my wrist.  It easily fit in a belt pouch and I like to have my hands free when not shooting.My photographs were superior to those taken by my 30 year old daughter who used an Olympus 5010 on a recent 16 day trip to the Middle East (Jordan and Israel) and equal or better to those taken with the Nikon D-90 and the Canon EOS 60-D carried by our friends.  Of course the 5010 is no match for the xz-1, but my camera more than held its own with the big boy DSLR's.The combination of reasonable weight, easy handling, appropriate belt pouch size, outstanding image quality, a superb lcd screen, and most importantly, a wonderful fast lens that allowed me to take indoor and evening pictures without flash, made this the perfect travel camera for my needs.  If these features matter to you, I can highly recommend the Olympus xz-1.", "Date": "October 22, 2011"}, {"Title": "Great Little Camera", "Author": "DruMax", "ReviewID": "R3HNRER2E610UV", "Overall": "4.0", "Content": "I have been frustrated trying to find a good, smaller, low cost camera to shoot real close up \"Macro\". Read many reviews that said this was a good all around camera and that it takes good macro. I was not disappointed. This camera takes great, crystal clear macro shots and for standard day to day photos it is worry free with good, worry free, auto point and shoot. For macro it requires a bit of manual adjustment but with the programability you can set your macro shot and with a quick turn go to auto or another preset. Quite easy to use.The problem with the JPG that I read in alot of reviews is a mystery to me. I started shooting in JPG/RAW (because of these warnings) and soon just used JPG only because the clarity of the macro shots in JPG is outstanding and crystal clear in JPG so I found no need for the RAW so far.I have not needed the flash for anything I am doing as most of my shooting is in macro but I can tell that the rinky flash may end up being a weak point but I cant say that for sure because I have only used it a few times in test shots in good light. I have a feeling the great lens and the ability to adjust pretty much every setting on the fly can compensate. I have read the video is not so hot, havent tried that and it wasnt a factor for me as I have a video camera and dont need this for video. It does shoot in HD though and the test video I took did not exhibit the sporatic behaviour some reviews have mentioned.All in all...for the price...its a great little camera. I could not find a single XZ-1 camera in stock at any store in this city and its a big city (good sign people like it) so I had to order online, got it quickly and was shooting in 2 days and I am happy with the purchace so far (this is after about 4 days shooting).", "Date": "October 10, 2012"}, {"Title": "Precision light capture with flexibility", "Author": "CI", "ReviewID": "R1V7F5RN07L978", "Overall": "5.0", "Content": "From point-shoot Olympus to top-of-the line Canon SLR's, I was after something even more portable than the Olympus PEN cameras. I wanted a decent zoom range, a view screen good enough to show if the picture focus AND exposure were right following the shot, ability to shoot full manual when needed, macro lens ability and a decently low-lag shutter release. This XZ-1 does all that. Beyond that, there is super macro - so close that the lens is nearly touching the subject and a very good anti shake correction. I've shot model railroads with available light, showing all the subjects in a wide depth-of-field and adding a hint of blur on moving trains, handheld! It's fast enough for grandkids most of the time. Faster zooming would require a manual zoom, not the little power zoom. Turning the camera on pokes the lens cover off, so be sure to secure it with something so you don't lose it. It's important. XZ-1 easily fits into a coat pocket but keep the change and keys away from it as those will mar the view screen.  Learning to use the art filters, finding the procedure for special set-ups like macro, navigating the menus in general is tricky and requires the manual for a week or so. It would be better with a graphical diagram on modes - how to get from here to there - or a situation - 'go to this setting' to proceed. An example would be taking a picture of transmitted light from a stained glass window, exposing both the window and the lit area on stone beyond. The camera will do this well but it will test you to run it in manual for the shot, adjusting both the shutter speed and aperture.  I still haven't determined how to save some custom setting I like. In short, the menu is complex. Do not be afraid of shooting in full auto or program mode but you will mist a lot of capability if that is only what you want - in that case consider a simpler camera. For a serious amateur or pro who knows how to move and live with one lens, this is a fine small product. I wish there were indicators for zoom position so I could reset to those for critical framing on apparent 'normal' views. Here, it is somewhere between wide and tele... Battery life is ok for several dozen shots with a flash or who knows how many without. Charging using only a USB cable is Ok but slower than having an external charger/battery. Consider these if you are out traveling and shooting for a day. Movie shooting is OK but there is a big difference between movie cameras that can focus track a target, like chasing a golf ball or a car on a race track and what this camera does. However, considering movie mode is here for 'free' they look great on TV or computer. Shutter is fast enough to use from a small airplane. If you are going to add filters or add-on lenses, choose a PEN camera or another 4/3 type for size. For extreme closeups and portability, this is ideal.", "Date": "March 21, 2012"}, {"Title": "Perfect (for landscapes and outdoor shooting)", "Author": "BfloBen", "ReviewID": "RYWVTX4XUAM9M", "Overall": "5.0", "Content": "I don't use video or the onboard flash... If you want a flash, try something else. Even with the Olympus FL-36R it can be a challenge to adjust the flash correctly. Video I never use so no comment. Outdoor photos... are great. I love the flexibility and easy management of the settings (once you learn the menus of course-- hey, if you want simple point and shoot controls-- don't buy this camera). It is a fine backup and walkaround camera for the DSLR user who didn't want to lug the big camera around that day. I'm happy with it.", "Date": "December 29, 2011"}, {"Title": "What you see - you get!", "Author": "Middle age tech freak", "ReviewID": "R19SANAOKTGAJH", "Overall": "5.0", "Content": "I love this camera. What I like most about the XZ-1 is that the images match what I see (or, it's very easy to make a few exposure adjustments to make that happen). I also believe the f1.8 lens is what brings the SLR-like photos from this very small package. The images are just superb for its class.I have Olympus DSLRs but wanted a smaller camera for travel and just taking along. Image quality is everything to me and it came down to this, the Canon S95 and the Panasonic Lumix DMC-LX5. They are all excellent cameras and I cannot tell you which one you would like better. Without being too critical of the others, the reasons I chose the Oly over the two others is that I felt that the Canon has some possible issues with the lens that could require repair in or out of the warranty period and the Panasonic has some slight issues with jpeg processing (but you can shoot RAW with all of these) and I came down on the side of Oly. In terms of how I view Olympus though, none of their recent (since 2005, anyway) point and shoots have impressed me and I really was almost prejudiced against this one even though I like Oly's DSLRs. After reading many reviews and looking at many images I decided on the XZ-1.One negative is the shape of the camera and the resulting difficulty holding it. The problem is solved with aftermarket grips, the nicest of which is the machined aluminum version by Richard Franiec. There are others available too. With the grip, the problem is eliminated.The only other negative for me is the slightly larger size than being able to call this a \"point and shoot\". But I'll take the beautiful image quality over the size any day of the week.It's a worthy replacement for DSLRs when you don't want to lug them along. I'm constantly amazed by how it captures what I see so very well.", "Date": "September 11, 2011"}, {"Title": "More than just a point and shoot", "Author": "Marvin C. Latimer \"Mel'sbells\"", "ReviewID": "RVPOCEQQ0NZM9", "Overall": "5.0", "Content": "I've had a Canon G11 and also Canon Rebels and decided that a big hunk of camera is not for me.  I like the xz-1 because I can stick it in a pocket if I want to and I have a nice leather hip case for it that carries an extra battery.  I did get a Flipbac grip for it that makes handling the camera easier and I use it on a leather lanyard to prevent dropping since I have manos flojas. (slippery fingers) This is one of the most useful cameras I have ever had.  I'm not a pixel peeper, but even at higher ISOs I find the results well within my standards.  I don't believe I have had a picture blown up to 8 x 10 in a long time and for the most part I just download the pictures to my computer an maybe send some to friends and relatives.  I have published several photo books through Blurb and I have been pleased with the results.  I think I represent the average camera user and I am not out to impress anyone with my writing skills by being a critical reviewer.  I think a lot of reviewers want to dazzle you with their knowledge and need to find something wrong with anything just to show their own skills. Anyway, this is just a very nice little camera that I love to use.You can use it in Auto mode and get very nice shots or if you want a little more control use the Program mode.  If the situation warrants it you can control the aperture or shutter speed or even use it in Manual mode. I'm not really into video, but the results are ok for my needs even though the video seems to be something the the reviewers like to blast. The sensor is not as large as my 4/3s Olympus, but I find I am very happy with the quality of the shots.One thing I have noticed is that you seem to have watch the settings in menu.  For some reason a couple of times the ISO got set to 1600 without my input and while taking pictures of the moon in the early evening I noticed that there was a lot of noise.  I checked and found that the ISO had somehow changed from auto to 1600 -- not acceptable.I usually carry my Olympus E-PL1 around my neck and use it with a Panasonic 20mm f1.7 lens.  This is an excellent setup for most things, but occasionally I find I want a little telephoto or a wider angle and the xz-1 is an excellent backup.  In bright light it even has a filter to cut down the light and it is also great in low light situations (not dark, but normal interior shots with at least some decent lighting)  I shot pictures at my grand daughters wedding andgot great shots in the church without a flash.I'd say for the average casual photographer, there is no other camera to just stick in your pocket and get such good shots.", "Date": "July 19, 2011"}, {"Title": "A solid performer !!", "Author": "Jamin Redwood", "ReviewID": "R2UW8SHWIVUTZV", "Overall": "5.0", "Content": "So, my first digital camera was a Olympus E-20, the big ol DSLR. It was beautiful, but big, heavy, slow processing speeds and went through batteries like crazy. The pictures were great for its time though.  Then,  I used a Nikon P5100 for the last 2 years or so an really loved it. It was compact, it had a lot of functionality, and I thought it had beautiful pictures.So, I saw the Olympus XZ-1 and had to get one.  I bought it for the lens, an amazing lens that picks up all kinds of detail, and color. It is the best camera for the price, I would say. And, it fits in your pocket, its a little on the heavy side, but at least you know its still there and hasn't fallen out.The only downside of the camera:the processor could be a little faster, switching between picturesthe video quality could be improved.Other than that, its great.", "Date": "July 4, 2011"}, {"Title": "Great camera with major negatives", "Author": "Shaer", "ReviewID": "R1HKG7OTFFLMF0", "Overall": "4.0", "Content": "This is a great camera that can take fantastic pictures.I have it for a very short time and mostly will use it to picture my kids..It took some nice pictures...I will not comment on the great features that this camera has since these are many and well posted...But it has many negatives that I will list some:1.very fast lens with wide aparture that gives you very shallow depth of field...The problem is that you can not control the focus point size,as in the LX5 or TL500,and in this camera it's large,so in many shots the focus point point is not accurate.2.Related to the first point:If the subject is moving it's likely not to be in focus...To be specific,for kids who will never stand still,most of their pictures will be out of focus...Unless your subject is not moving then most of the photos will be blurry,and even with a shutter speed of 1/1000s.3.No AEL button...Is this Important or not4.No didicated Fn button.5.Most important controls has no dictated buttons,like the WB and ISO,though in certain S modes you can control the ISO from the front ring.And on top of that when you press the shutter button it does not show you the ISO on the LCD...So the only way to know the ISO is to play back  your photo and see the ISO .6.No way to set the upper ISO limit.7.Lens cap is cheap,and I mean it.8.Low light photos are eighther soft or noisy with high ISO..9.I used the highest in camera sharpening(+2)and still most pics are soft...Not that bad but no comparison to the LX5 or TL500.And the list can go long.Again it's a great camera,but depends on what you will use it for...And in 2011,and for a five hundreds D camera,I don't think olympus has an excuse for these points.....", "Date": "March 26, 2011"}, {"Title": "Best P&S; for the money hands down...", "Author": "Matthias Lambert \"Renaisance Dad\"", "ReviewID": "R9M9RESYL14ZM", "Overall": "5.0", "Content": "There have been lots of reviews written and most are very good.  The real story is if you won't pick it up or enjoy using it who cares about the camera?  My wife hates my full side system camera unless it has a zoom on it and only then in iA mode.  I tried no less than 3 cameras for her from Panasonic LX and Canon S series, she didn't,t like menu diving for features like macro or low light scene modes etc.  on a whim I bought the XZ-1 from Amazon warehouse and she loves it.  First the functions are very intuitive, and the scroll wheel that surrounds the lens for selection makes life a dream for simple adjustments like going from inside to outside for her, or when she sees a flower or plant she wants to capture in detail up close as in 1cm away.From my standpoint the image quality is remarkable, I hadn't owned or used a point and shoot in 5 years that I appreciated the images OOC until this one.  The panorama feature in camera is also clever and usable as well.The down and dirty:Pros for me- easy use, fast shutter lag( no hesitation when you pull the trigger), bright lens minimizes flash needed, quick start up time 1-2 seconds, dedicated movie button, very reputable images and accurate color if not a little punchy for a modern look.Cons-Lens cap, over come with a rainbow imaging automatic cap for $9 on Amazon, limited zoom compared to some compacts, battery life while good is still not a full day 350+ images.Bottom line I have bought 2 now for my wife and mother in law, the rainbow imaging lens cap and an extra battery for $20, this is a great little camera and at the current discounts because of the new XZ-2 and 10 models it is a steal of a deal.  And it isn't giving up any performance outside of wi-fi or tilting screens to its brethren.  This older model XZ-1 takes equally great pictures in almost the exact speed as the new ones, and does it with ease.  I wouldn't hesitate recommending or buying this again if I had to do it today.", "Date": "May 17, 2013"}, {"Title": "Great Compact Camera for RAW Shooters", "Author": "D. Warnecke", "ReviewID": "R3NU181UD2HBKA", "Overall": "4.0", "Content": "I bought this camera as a birthday gift for my mother, taking advantage of the heavily-discounted $199 price.  Sure, it's last year's model but it features the very same 28-112mm f/1.8-2.5 lens as the new $599 Olympus XZ-2.  How bad could it be?Unfortunately, if you plan on shooting JPEGs, it can be pretty bad.  Very aggressive noise reduction is used even at base ISO and chroma noise overwhelms shadowy areas above ISO 400.  The result is smeary, watercolor-looking pictures if you zoom in to 100%.  But I digress; my mom wouldn't notice, and either way it's a far better camera than the dying Canon SD1000 it's replacing.Let a pro or advanced amateur take the wheel and shoot in RAW, however, and you'll be rewarded with extremely sharp, detailed output with manageable levels of noise up to ISO 800.  The lens alone is worth the price of admission, with sharp edge-to-edge performance.  The Image Stabilization works better than the unit on my Fujifilm X10, allowing sharp handheld shots at even 1/4 of a second most of the time.  There is a lot of potential here, it's just a shame Olympus used such a terrible JPEG engine on this camera that masks much of it.Built quality is solid with the front lens ring feeling smooth and precise.  The body has an aluminum front and plastic back.  The OLED display is bright and colorful - perhaps too colorful, sacrificing some accuracy for punchy saturation.All-in-all, this is a good camera for the asking $199 price, primarily if you shoot RAW.  The fast lens allows a good deal of flexibility and the camera has some neat tricks up its sleeve (60 second exposures, ND filter, RAW) to keep more advanced users enthused.", "Date": "December 5, 2012"}, {"Title": "Great compromise between point and shoot and DSLR", "Author": "backtorockville", "ReviewID": "R1O0SWIJBNAKRC", "Overall": "4.0", "Content": "I bought the XZ-1 because I was interested in a camera with more \"serious\" options, without spending the money for a DSLR that too often might get left at home because of its size. I am a fairly casual but knowledgable hobbyist photographer, taking pictures mostly of urban excursions, my garden and my dogs. In the past I had and loved an all manual film SLR, and for years have made do with a Canon ELPH Powershot 1300SD.In general, I'm very pleased with the first month or so of shooting I've done with it. The key upgrades for me, compared to more standard point and shoots, are aperture and shutter priority shooting modes (as well as full manual), the ability to record RAW photos, and the wide open f1.8 aperture which allows for decent pictures in low light, as well as achieving beautiful soft backgrounds in portraits.Given good lighting conditions, I find that the XZ-1's image quality is not necessarily that much better than my Powershot. However, it's a big improvemnt for portraits and lower light. It has a number of control options that you might only expect in a more serious camera: a hotshoe for a flash unit or viewfinder, better flash options (including ability to drive an external flash wirelessly), sequential shooting options of 2 frames per second up to 15 frames per second, long shutter speeds including 'bulb', the aperture opening to f1.8, selective focus options, and access to primary controls via a ring around the lens.The main complaint I have about the camera is the quality of video -- it's terrible. The autofocus is constantly shifting around making images blurry, there is a lot of shake in general, and the image is not crisp. If video is a priority, get another camera.I would also say that access to some of the controls takes a few too many clicks, such as ISO setting, and the focus options are not great. For manual focus, you are given a grid with eleven hotspots, and you can select one of them. It works well, it's just a little limited and not quick to access. However, those are minor gripes for a camera that costs less than $300 and has so many other great things going for it. In general, I'm quite pleased with this as a good all purpose camera.", "Date": "October 22, 2012"}, {"Title": "Great,fun camera", "Author": "Emoya", "ReviewID": "R2JOYV6KSIRUIW", "Overall": "5.0", "Content": "I've owned a few cameras in my time -including a dslr and micro 4/3 cameras- and I have to say that the xz-1 might be the most enjoyable camera out of the bunch. It is a very versatile camera, with manual and automatic settings. Although I've always enjoyed taking pictures manually, I've had as much fun using the auto settings. Reason being that the JPEG rendering from Olympus's processor delivers crisp pictures with good contrast and \"punch\". The filters are also very practical; the filters are not overdone(instagram style)but well balanced and very useful when taking pictures of dull settings or objects. The shallow depth of field is excellent for a point and shoot, and it has macro and super macro settings.The interface is pretty straight-forward and easy to grasp. The ring around the lens which controls different elements under dial modes is brilliant -Olympus should thank Canon for that. There is a hot-shoe and an accessory port for a viewfinder that is sold separately. The camera is somewhat pocketable, but not entirely. I can't carry it in my jeans, but cargo shorts or pants and maybe khaki pants might be large enough to accommodate the xz-1.The pictures in JPEG are excellent, and RAW delivers as well, but high ISO does delivers very noisy pics. ISO at 800 is pretty noisy, and 1600 is probably where the limit is for me in terms of tolerable noise. If I shoot at 800 ISO or higher, I usually shoot in RAW and smooth out the noise in a post processing software.The bad side of the camera lies in the video. If you're looking to purchase a camera with good video, then maybe you should look elsewhere, because the xz-1 is mediocre at best.Overall, I am very happy with this camera. And although the price tage is pretty steep for a p & s, the proof is in the pictures and wide range of shots you can accomplish with this small camera. This camera might be good enough to even sway those who seek micro 4/3 cameras.", "Date": "July 12, 2012"}, {"Title": "xz-1 olympus camera", "Author": "Bill", "ReviewID": "R3EGW0N2CGDI9V", "Overall": "4.0", "Content": "Really like the XZ-1, size, wt, shooting functions, software.  The only issues I have with the camera it doesn't come with a printed manual.  I downloaded the manual and had it printed.  Make sure you read the manual so that you can set-up the camera to do what you want.  Some of the functions are not turned on and need to be for you to get good results.Other than above, great camera for the average and above average camera user.", "Date": "June 14, 2012"}, {"Title": "This is a really great point and shoot", "Author": "Individual Intersects", "ReviewID": "R3KAKP8MV357X0", "Overall": "5.0", "Content": "Bought for my ex to take pictures with a while back. She uses it all the time and it really is a lot better than the one she was using before. I'm sure it has gremlins and foibles, but she seems to be happy after using it for over a year, so...", "Date": "June 7, 2012"}, {"Title": "It's What I Wanted", "Author": "BrentM98", "ReviewID": "R331G1B4JMOWBI", "Overall": "5.0", "Content": "It's a camera that I can usually fit in a shirt pocket and takes very good pictures under most conditions.Strengths:- Impressive image quality for a compact camera (when taking RAW images).  I was able to take good night shots, and I was able to recover some otherwise blown highlights in day shots (it has some \"headroom\").- The fast lens reduces the number of high-ISO shots needed.- Fairly clean base ISO shots (no smearing and not much noise when shot in RAW).- The built-in Neutral Density filter makes it possible to use max aperture in daylight.Weaknesses:- I got it along with Adobe Lightroom.  On high ISO shots, the Olympus noise reduction seems to break down (creating blotches).  Adobe seems to handle it much better.- I replaced the neck-strap with a wrist-strap.  The camera isn't very pocketable with the neck-strap.- The mini-USB port isn't standard.  I need to go shopping for a couple of adapters.- It would be nice if the screen articulated (for off-the-hip shots).- The user interface is a bit clunky at times.  For example, it takes more clicks than I would like in order to turn on the ND Filter.Every camera in this class has some idiosyncrasies.  I was down to this, the Canon S95 or S100, or the Fuji X10.  I'm definitely glad I did not go any larger (the X10).  The Canons would have been more convenient to carry, but, for me, the XZ-1's superior handling and image quality were probably a better choice.", "Date": "December 9, 2011"}, {"Title": "Wow, what a lens... oh yeah, the camera's pretty good too.", "Author": "Anthony Pantliano \"The Photo Guy\"", "ReviewID": "RSIMW4EO46V5C", "Overall": "4.0", "Content": "The Olympus XZ-1 is a great prosumer digital point and shoot camera that has a standout lens and great photo quality.Size wise the Olympus is not a pocket sized camera, but it easy to carry around all day and will easily fit into a jacket pocket.  There is no grip on the front, but there is a small thumb grip on the back.  The camera is easy to hold and all of the buttons and dials are within easy reach.  Build quality is high, with a metal front and tripod, solid feeling buttons and dials, and even the door over the battery compartment feels sturdy.  The lens cap does not lock into place, but I did not have any issues with it falling off.  On the back of the camera is a high resolution OLED screen that is a joy to behold with sharp images and easy viewing, even on a sunny day.  A small pop-up flash hides on the right hand side of the camera.The XZ-1 has lots of great features, like full manual controls, dual control dials (one on the back and one around the lens), a hot shoe, and a built in neutral density filter.  The Olympus also has a built in image stabilizer, and a larger than average sized image sensor for better high ISO image quality (for a point and shoot camera, at least).  The camera's best feature, however, is the lens.  Not only is the maximum aperture a bright f/1.8 on the wide end, but also at telephoto it only closes down to f/2.5.  At 28mm it offers a wide angle view, and is extremely sharp from corner to corner even at maximum aperture and wide angle.  I love this lens!The Olympus turns on quickly, focuses fast (even in low light), and lets you take another picture very quickly, even when shooting RAW and JPEG.  Changing settings and using the menu system is easy and straightforward.  Battery life is good and I can take about 200 shots with some zooming and lots of reviewing of photographs before the battery get low.  The battery charges in camera with the included USB charger.Picture quality of the Olympus is very good, especially at low ISO speeds.  The lens captures great detail and the larger sensor allows for very smooth, noise free images at low ISO speeds.  Color, contrast, exposure, and white balance are all accurate, especially outdoors.  Indoors the automatic white balance setting suffers a bit, but that's not unusual, and the camera offers a custom white balance mode to combat that.  Once the ISO speed hits 400, however, the images start to look a little too mushy for my tastes as the camera tries to combat noise (I am very picky about photo quality though, and I am a \"pixel peeper\").  The camera does not give you any control over noise reduction either.  The upside is that with the f/1.8 lens I hardly ever have to go above ISO 200, even in low light.  Additionally, the wide aperture allows for great shallow depth of field shots, with dramatically blurred backgrounds or foregrounds, especially in Macro mode.  Did I mention I love this lens!  The autofocus is extremely accurate, and it's even easy to manually focus with the Olympus if need be.Video quality is good as well and is recorded in high definition.  You can zoom during a movie, however the audio is recorded in mono.  There is a direct button on the back of the camera to start recording a video.The few things I don't like about the Olympus are that 1) you cannot change the function of the front control dial, 2) you cannot zoom out in playback mode to more than a 20 image grid, 3) sometimes I think a photo is underexposed based on the camera's screen, but when I download it to the computer it's fine, 4) you cannot delete a picture immediately after taking it, 5) it takes two button presses to enter macro mode.All in all...a real joy to use, with photo quality that is a joy to behold.12/11/2011 Update: I just took some night shots and noticed that the screen shows the photos brighter than they are when you download them.  Be careful with exposure in low light and err on the side of a brighter exposure.", "Date": "November 29, 2011"}, {"Title": "Still the king of enthusiast compacts", "Author": "S. Vogt", "ReviewID": "R1NF7FRWLFPA3Y", "Overall": "5.0", "Content": "The XZ-1 is about a year and a half old at this point and a replacement is probably on its way later this year. But it still remains the best of the enthusiast compacts. Mainly due to the fact that the pictures that come out of this camera are just so darn good.While not the best choice for high ISO performance (the S100 wins that competition) and the Fuji X10 (when it's working correctly) has a slight edge in image quality, its combination of decent shooting performance and excellent image quality provide the best shooting experience of all the enthusiast compacts on the market today. The lens used on the camera is incredibly sharp at all focal lengths. Exposure is great too. ISO performance up to 400 is impeccable. While the Canon S100 can beat the XZ-1 by about a stop in terms of ISO performance, the pics from the XZ-1 are just better looking overall with better sharpness and detail capture. But the great thing also is that the lens starts at F1.8, so while the ISO performance is not the best in its class, the fast lens means you don't have to pick as high of an ISO in order to shoot in low-light conditions.The camera is not exactly small. You would have a hard time fitting it in your pocket. If pocketability is very important, I would look more at the S95 or S100. It's about the same size as the Lumix LX5. But it's still very solid to hold, and would easily fit in a jacket pocket or cargo pocket. It has a rotating ring on the front for adjusting aperture, but Olympus made a very stupid omission but not being able to customize the ring like on the Canon S95. And plus it feels a little chincy compared to the one on the S95. Another annoying thing is the lens cap. Honestly, I see no excuse (especially since this camera retails for $450-$500) for Olympus not to provide a built in automatic lens cap.Another advantage this camera has is a hot shoe. Which allows you to attach an external flash or the VF-2 accessory viewfinder.The menu system is ok. It works and it's not especially confusing but I have seen better implementations (ie. the Canon). As I say in all my reviews, this camera is jam-packed with features, so a thorough read-through of the manual is highly advisable. I found the LCD fairly servicable with decent viewing capabilities in most conditions.Performance of this camera is generally very good as well. But this is all in relative terms. None of the high-end compacts are any good for action shooting and generally are not very fast overall. But I would say it's faster in Autofocus than the S100 and LX5. Shot-to-shot time aren't too bad either. It also doesn't have the AF issues that the Fuji X10 does.I cannot speak to the movie mode because I never use it on this camera. But from what I hear, it isn't all that great.The enthusiast compact market is full of great cameras at this point. All have photo quality which represents a clear step-up from a regular point and shoot and in some cases rival that of an entry-level DSLR. But the XZ-1, when it comes to stills, still stands out as the best of the bunch.", "Date": "September 25, 2011"}, {"Title": "Truly phenomenal compact", "Author": "dj", "ReviewID": "R1A04YRERGUVZT", "Overall": "5.0", "Content": "I figure there are two types of consumers reading reviews for this camera.Type 1: All but decided to buy this camera based on specifications and exhaustive third-party reviews, but want to know if any owners have uncovered critical problems or nuisances.Type 2: Curious to know why people would pay more for a larger-bodied 10 megapixel camera when 16 megapixel cameras can be had for significantly less $.For the Type 1 crowd:I've only taken about 300 shots from this camera, but I can tell you that I'm absolutely thrilled with it. Photos are truly impressive. Controls are far more intuitive than I had imagined. I haven't taken any video, and I probably won't because I have other equipment that handles high-res video much better than this Olympus. Video is not this camera's strong suit, and I'm fine with that.I wanted something that could put out image quality rivaling (nearly) that of my old DSLR (10.1 megapixel Canon Rebel XS + Canon kit lens + f/1.8 Canon prime). In every way, I prefer the XZ-1 to my old Canon DSLR. It's considerably smaller, obviously, and I prefer the images from the XZ-1 pretty much every time. I easily take more \"keepers\" with the XZ-1 than I ever did with the DSLR. White balance seems better controlled, and I prefer the colors from the Olympus. The lens gives me the freedom of taking any type of shot without changing out lenses (no carrying a giant camera bag=bonus for me). And the price versus a DSLR doesn't hurt. FWIW, I snagged my new, black XZ-1 for two bills w/free shipping. Quite a bargain!The only other camera I think I would have really loved is the Sony RX100; price was the instant decider, in this case.For brevity, and because the Type 1 crowd probably consists of mostly enthusiasts, I'll stop there.For the Type 2 crowd:The beauty of this camera (and to great extent others like it) lies mostly in its sensor and lens. The XZ-1 has a 1/1.63\" CCD image sensor. Many (most?) other cameras near this price point offer a 1/2.3\" CMOS sensor. The numbers represent imperial fractions dating back decades to the days of Vidicon tubes. What's important to know is that the XZ-1 sensor is considerably larger than a 1/2.3\" sensor.As best I can determine, the dimensions for the XZ-1's 1/1.63\" sensor are:7.90mm horizontal5.80mm verticalThe dimensions for a 1/2.3\" sensor:6.17mm horizontal4.55mm verticalOk, so what? Well, the XZ-1's sensor has on the order of 60 percent more area than a 1/2.3\" sensor (roughly 60-63 percent larger, depending on which found-on-web dimensions I calculate).What does that mean? It means that if you took a camera equipped with a 10 megapixel 1/1.63\" sensor, and another 10 megapixel camera with a 1/2.3\" sensor, the camera with the larger 1/1.63\" sensor would, ceteris paribus, create a much higher quality photo.So a larger sensor is better...but why? Image sensors, in a nutshell, convert light into electric charges that are processed into electrical signals that later transform into what we view as photographs. In my 10 megapixel comparison, the larger sensor has larger pixels, and larger pixels benefit from additional volume for capturing more photon (light) capacity, which lets them produce higher dynamic range and less perceived image noise. So if we consider a little 1/2.3\" sensor with an even higher resolution, let's say 16 megapixels, the already small pixels are made even smaller to accommodate the additional almost 6 million pixels on the tiny sensor. So small just became smaller. There's a point of diminishing return when you add pixels but don't add pixel size (sensor size). When you take a 1/2.3\" sensor and cram in 12, 14, or 16 million pixels, you may create some perceived sharpness, but you'll almost certainly reduce overall image quality by increasing perceived noise and lowering dynamic range.The wide aperture of the sweet Zuiko lens (from f/1.8 at its widest, to f/2.5 at full zoom), coupled with the relatively large image sensor, allows you to take photos with a shallow depth of field for more artistic control. A shallow depth of field means shots with background blur, or bokeh; this is highly desirable for most photographers. Full manual controls and a front control ring make this kind of photography easy with the XZ-1. Aperture priority mode is a real treat.Most compact point-and-shoot cameras offer extremely limited manual controls, usually just ISO and/or exposure.Some image processing takes place inside all cameras before they output to a lossy JPEG. This is just fine for most casual shooters, but enthusiasts often want greater control over post-processing (tweaking photos in Lightroom, Photoshop, or the likes). The XZ-1 can shoot in Raw (large, \"unprocessed\" image data files) and/or JPEG, and camera buffs dig this flexibility in post-processing.That concludes my in-a-nutshell summary, folks. I hope this has been informative. There are plenty of excellent resources on the web that cover the science in far greater detail. As well, there are many excellent books, even textbooks, that will help you to better understand some of the things I've mentioned. Photography is every bit as much science as it is art.", "Date": "December 10, 2012"}, {"Title": "Best compact ever!!!!!", "Author": "Felipe S. Valles \"Felipe IV\"", "ReviewID": "R2Z3SKBZ7AHZMX", "Overall": "5.0", "Content": "This camera is without a doubt the best compact on the market, I bought it new about 6 months ago,the lens are super fast 1.8- to 2.5 @ max zoom about 4x optical if you know what this means you will find out that in dsrl world cameras a lens with such spec. will cost you at least $700, I mention dsrl because the pict quality of this little gem is the same or better than any entry DSRL. I'm impressed with the low noise at dim light pic. due to a very bright lenses ..I used the canon s95 & pany lx5 for awhile but I sold them & keep this olympus, I'm  so glad that this guys from olympus keep 10 MP on this sensor, this is the right formula for good pict. for people who don't know how big can you print with 10 mp, I was able to print 24\" X 36\" with good resolution I highly recommend this camera.", "Date": "March 18, 2012"}, {"Title": "I love this camera, especially in low light without flash.", "Author": "HiPo Steve", "ReviewID": "R2ETAOFA4BJ3HH", "Overall": "4.0", "Content": "After much research and self debate, I purchased the XZ-1 this summer, using the proceeds from selling my beloved 1951 Contax II-A rangefinder I've had since 1965 (without a darkroom, I knew there was no chance of my resuming 35mm film work). But I was spoiled by the Contax incredible Sonnar f1.5 lens' available light capability.  The XZ-1 has filled its shoes admirably, letting me take low light photos without flash that amaze my friends due to its incredibly fast lens. For me, even more important than its f1.8 aperture when wide open is its f2.5 aperture at full telephoto which really sets it apart from its competition. The faster shutter speeds this permits help minimize hand-held telephoto camera shake.To take full advantage of its capabilities, you actually have to read the manual and practice with different settings. Point & shoot will only take you so far. BTW, it's a good thing it shoots so well with available light since its flash is weak and best used in its \"Fill-In\" mode where it augments the XZ-1's low light shooting rather than replacing it. I love the detail, contrast & resolution of its OLED screen; I even find myself using the Art Scene on occasion to good effect.Downsides?The silly lens cap which I replaced with a Rainbow Image Self Retaining Auto lens cap. (Works great, but does add some depth making it a little less pocket friendly).The beautiful OLED screen is exposed to scratches when you pocket the camera. I tried a Lexerd screen protector which compromised screen quality too much. Still looking for an optically  better alternative.Weak flash.In a perfect world it would be shallower. It is just shallow enough to be barely pocketable, especially with the almost mandatory Rainbow Image auto lens cap. Just don't expect to carry it in skinny jeans pockets.I'd like a longer telephoto (and shallower too? I can dream, can't I?)Otherwise I find the XZ-1 a fun tool that allows me to be creative in my picture taking. I think it is at its best for the advanced amateur with the patience to learn its nuances. I recommend it to my friends and I'd buy it again. I'd give it 4-1/2 stars if I could. It's not perfect, but for my needs it comes very close.", "Date": "December 31, 2011"}, {"Title": "Best quality camera your money can buy right now. IMO", "Author": "Craig M.", "ReviewID": "R19D9U2ZZ5BEQG", "Overall": "5.0", "Content": "Great camera! I have/had a Nikon D3000, D5000 and a D300 and feel this takes far better photos than any of those. Obviously there is more you can do with a full DSLR. But just a quick auto boot and shoot. This camera is faster and better quality even in low lights. Trust me I spent weeks looking/comparing model, manufacture even looked at Leica and of the ones I could afford this was the best point-and-shoot betting out the quality of all my other cameras.My only complaint is no auto flash - you have to decide to use it. The face detection is terrible. It might focus no someone's elbow and not their face.Something to note: 20MP camera doesn't mean better quality - there is a point you're taking in more quality in than the human eye can see. And if you don't want to print 50x60 close up photos. Than remember not all sensors are created equal. 10MP can be better than a cheap 20MP camera. This camera is a little low on the mega-pixels but makes up for it in color and clarity.********************************************************************** PLEASE READ MY REVIEW OF THE SELLER ******* SELLER KNOWINGLY SHIPPED USED UNIT. ***********************************************************************", "Date": "November 19, 2013"}, {"Title": "Arrived on time as how expected.", "Author": "JesusGlezAZ", "ReviewID": "R3FKES7J48OTMT", "Overall": "5.0", "Content": "The best balance between price-quality in the market this days... as long as you know how to use an advanced compact camera cause I will not say is a \"point and shoot\" one.", "Date": "September 15, 2013"}, {"Title": "Really love this camera", "Author": "and-E", "ReviewID": "R2RAG7URIR9S8D", "Overall": "5.0", "Content": "There's plenty of detailed reviews from enthusiasts and experts, so I won't bore you with details like that, as I'm just a casual, novice user. The camera is easy to use and fun to take pictures with. Really really does well in low light, love it.", "Date": "June 29, 2013"}, {"Title": "I love this camera!", "Author": "Tyann98", "ReviewID": "R22E35TR5XGIMT", "Overall": "5.0", "Content": "First a little about me-Really I'm just an average person who just likes to take nice pictures of my flowers and pets and whatnot. I've never had a digital camera that had cost me more $80. I decided it was time for a change to have a camera that at least could take pictures inside! I read lots of reviews and recommendations. It had to be a cheaper option. Anything over $300 was out of the question. I know very little about the specific of photography. I don't understand what all the numbers mean, still not sure what everything on my camera does, but I'm learning.Due to some really good reviews, I decided to get the Olympus XZ-1, which I snagged at slightly used at $225 to save some money. I waited a couple months of full use before reviewing. I took it on vacation with me, everything.And this camera never ceases to amaze me! I'm still learning everyday.What I love:Its simple to operate, even for someone as inexperienced as me.I love to make use of the Art and Scene modes, but the iAuto never fails to take a decent picture.I can take pictures indoors without the pesky flash (which although an ugly, manual pop-up flash, I rarely use).The display is beautiful. My pictures look better on it than they do on my computer.The selection dial on the lens is handy.Picture quality.Pet mode is especially handy to catch your jittery animal friends.What I don't love, but gladly deal with:A little bulkier and heavier than I'm used to.Popping the lens cap on and off.Ugly flash pop-up.My main issue is the only 4x zoom. I feel like trying to take a shot of anything at a distance is pointless. At least a digital zoom would have maybe been nice.A lot of people say the video is low quality. I hardly ever take videos, so this doesn't really apply to me. However, from what I've tried, it seems average anyway.I love this camera more and more every time I use it. What a great value for the price I paid. All I wanted a camera that had the ability to take some beautiful pictures. And I got so much more. Highly recommended for those like me.", "Date": "March 26, 2013"}, {"Title": "Fantastic small camera", "Author": "A. Hibbs \"supersteve2004\"", "ReviewID": "RI7NODJLUTGZ1", "Overall": "5.0", "Content": "I love this point and shoot. I got it for hiking and climbing, where weight and size are serious issues, but where there are beautiful summits and priceless photo opportunities, and this camera has never failed me. The full manual control is fantastic and easy to use, and the richness of the photos is unparalleled in any point and shoot I've ever used. It's also very solid, and has an external trigger port, which makes it great for timelapses as well.", "Date": "December 24, 2012"}, {"Title": "Excellent pictures, but very complicated...", "Author": "Chris Sheppard", "ReviewID": "RLGL0C0E8LIDP", "Overall": "4.0", "Content": "This camera takes excellent pictures - like really WOW on the photo quality. The lens is outstanding for the money.  That said, it is an extremely complicated camera even when using the Auto mode - and I say that as somebody who is both technically-inclined and who has worked with studio-grade photography equipment on a professional basis.  You will need some time to learn how to use it, so don't buy it the week before a vacation!", "Date": "December 17, 2012"}, {"Title": "Excellent Camera", "Author": "Abuencam", "ReviewID": "R1I9B5GSFQ6H3I", "Overall": "5.0", "Content": "The camera is incredible.  When I first recieved it, it felt light and cheap and I was a little annoyed about the lens cap being removeable (I don't do well with those).  After turning it on, my opinion changed immediately.  The lens is extremely bright and fast and the OLED screen makes the photos pop.  I had been eyeing this camera since it's release a year and a half ago and have hesitated because of the price but at $200, I could not pass it up.  After a few outings, I decided to leave my bigger E-Pl3 at home during my vacation to Italy.  I was worried that I had made a bad decision considering that I would be taking so many pictures but I must say, I was not disappointed with the results.This camera is a perfect travel companion (though it's zoom could be better).  I was able to get every kind of shot I would with my E-Pl3 without the hassle of changing lenses or even carrying numerous lenses.  Even better, during the whole trip, I did not lose the lens cap.  One of the reasons I have stuck with Olympus is that I find that their image processing is to my liking moreso than those of Panasonic or Canon.  The processor is so good that if you know somewhat what you're doing, you will come out with excellent JPEGs that do not require any processing at all.  As much as I once loved the post processing aspect, I'm finding that I have less time to do it and by the time I've processed a shoot, it has been a month since the event.  This makes it that much better for me at least.The hotshoe proved very useful with my speedlight (the metering is off a bit but you can always compensate through the flash) and it's beginning to bother me that I'm starting to wonder why I keep the E-PL3 around.  Though the price has gone up for this camera (I should have bought an extra), I think it is still a bargain.", "Date": "December 13, 2012"}, {"Title": "Great Lens!!", "Author": "RustyBill \"Sunday Rocker\"", "ReviewID": "R2VN7UYGATLTZ6", "Overall": "5.0", "Content": "Impossibly great f1.8 lens in a camera at this price point. Crystal clear photos in near darkness.  Very intuitive to operate.  Fabulous!!!", "Date": "November 30, 2012"}, {"Title": "There's magic here", "Author": "Science Boy", "ReviewID": "R1PXWM6YLBMM5Z", "Overall": "5.0", "Content": "At the recent Amazon sale price, I couldn't stop myself from ordering one of these, and I'm glad I did.I have a bit of a history with Olympus film cameras (OM, XA) but never had one of their digitals. This is a phenomenal little camera. I've already taken some shots I really like without even trying. In fact when I haven't been wandering around near my home like a tourist, I've been acutely aware that I'm wasting daylight! The large display and good handling make it just too much fun to leave it at home. But there's something else, too. The light really loves this camera, or vice versa perhaps. I don't know what it is exactly (the edge-to edge crispness of the lens, even at wide apertures, certainly doesn't hurt) but images seem to capture a lot of the ambience of the original scene. It doesn't seem to matter too much that the sensor isn't big enough to make noise a total non-issue (I plan to pretty much leave it set to ISO 100 anyway, as you can hand-hold even night shots at f/1.8 thanks to the I.S.). Have a look at the XZ-1 group on flickr and you will see what I mean; this camera really does take beautiful pictures. The balance of sensor size and pixels is perfect for my needs, and after doing a bit of pixel-peeping and comparing them to RAW, the jpegs seem perfectly fine to me. In a nutshell: I'm excited about photography again, perhaps even more so than when I got my OM-10 a long time ago in a galaxy far, far away.", "Date": "November 28, 2012"}, {"Title": "Excelente camara! I love it!", "Author": "J.E. Matos", "ReviewID": "R1X57REMLVVPDV", "Overall": "5.0", "Content": "Tengo que decir que no soy un experto / I have to tell you that I am not an expert / pero esta camara me facina por la calidad y claridad de sus fotos / but this camera fascinates me by the quality and clarity of the pictures / estoy encantado con este producto y lo recomiendo / I am delighted with this product and I recommend it.", "Date": "November 26, 2012"}, {"Title": "XZ-1", "Author": "jbogie", "ReviewID": "R3357SCJPN92JN", "Overall": "5.0", "Content": "I wanted a small camera to take with me all the time, and because I also have an Epl-3 the XZ-1 looked the best choice. I was surprised at the quality of the images and the great colors. I find my self taking the XZ-1 more often then my Epl-3. This is a great choice at a great pice.", "Date": "October 20, 2012"}, {"Title": "Lovely Camera!", "Author": "Sasha B \"banditqueen44\"", "ReviewID": "R2J33W5QTS7551", "Overall": "5.0", "Content": "I bought this as an upgrade to my old Cannon Powershot A20 that finally died after a good 10 years of use. I looked at competing products before buying this one, namely by Panasonic and Sony, but was turned off by poor customer service feedback and decided to take a chance on this camera because in comparison it had such high praise. I can say for the cost, size and market, this little camera is far from disappointing. The images are sharp and beautiful, focus is fast and sensitive and I love that it comes with a rechargeable battery. My last camera needed 4 AA batteries which added weight and cost. My only quibble with the Olympus is that I have to get use to the lens cap popping off when I turn the camera on. This is purely me having to re-calibrate my own habits since my last camera didn't require a lens cap.I think it's unfortunate that the ratings for this camera have been brought down by people who don't quite know what their talking about in regard to sensor size, etc. For my needs and purposes (product photos, reference shots, vacation pictures) this camera does the job nicely and I hope to have it for some time.", "Date": "July 22, 2012"}, {"Title": "A truely excellent camera", "Author": "J. Sherwood", "ReviewID": "R15X6TV6MT1AA", "Overall": "5.0", "Content": "This camera is a great mix of point and shoot and advanced features.  I can shoot in RAW like my DSLR, I can switch to manual or various priority modes.  At the same time my wife can ignore all that and use the standard modes as well as the special custom effect modes that she loves.  All this being said the greatest thing about the camera is it takes great pictures.  They're so good that I don't take my DSLR along all the time these days, and it often takes as good or better pictures.", "Date": "May 4, 2012"}, {"Title": "amazing machine", "Author": "David C. Nutter \"handelway\"", "ReviewID": "R1YFQKI6X00DK1", "Overall": "5.0", "Content": "Have been using pannies for years but the fast lens on this caught my eye.I continue to be astonished. I don't use it for video so that's not an issue. Available light pictures are incredible coming from such a small device. I keep finding new features and I love the panorama and art filters for fun. Got a good deal via Amazon plus an extra battery and charger (I hate charging in the camera for some reason) Bottom line is that this is the best yet and I never leave home without it in my pocket.David Nutter", "Date": "April 3, 2012"}, {"Title": "Excellent camera", "Author": "Alycia", "ReviewID": "R2AB3TKSQG1UII", "Overall": "5.0", "Content": "Takes beautifull pictures in very low light. It has numerous settings that will appeal to the more advanced user but also is very intuitive for the person looking for an excellent quality point and shoot. We love this camera", "Date": "November 23, 2011"}, {"Title": "Stunner", "Author": "pouncetrifle", "ReviewID": "RYLS3GX091WGV", "Overall": "5.0", "Content": "I use a Pentax K-5 with \"pancake\" primes so I like a high quality and very compact kit.  The XZ-1 is one of two relatively pocketable cameras (under $1K) that I'd bother to carry in lieu of my DSLR and not be disappointed by cellphone-like results.  The other is the Ricoh GX200 which I've also owned.  You'll be very happy with either unless your thing is video--apparently the XZ-1 isn't too strong in that category, but I use it only for stills.", "Date": "October 22, 2011"}, {"Title": "Really Nice Camera", "Author": "Amazon Shopper", "ReviewID": "R26K2F4PKZV5CH", "Overall": "5.0", "Content": "It's now 4AM, I got this camera yesterday. It's very hard for me to put down and this is my very first camera that I bought, I've never used a non-cheap camera. I'm really liking the photos it takes, I'm still learning how to use it of course. There is a lot of options on this camera, I found myself referring to the manual multiple times on what to do (the manual is on the manufacturers site). I've also had problems figuring out how to put the strap on this new camera, I found myself going to my neighbors for help on that since he has experience on cameras. Even he had trouble getting it on though! But we eventually got it. I have to say the strap was the most time consuming out of the whole thing.If you're new to cameras this may be where you want to start for taking great looking pictures. BUT, if you're only looking for a simple point and shoot then you should look for something cheaper.Anyway, I've uploaded some examples such as a night shot in complete darkness.Remember, check out the manual before making a bad review. You could be overlooking something such as the easy to miss color saturation option.", "Date": "November 6, 2012"}, {"Title": "Olympus XV1", "Author": "John W. Collins", "ReviewID": "R27JGEEA7RSDPU", "Overall": "4.0", "Content": "In addition to being a very good camera, it is very easy to carry around the neck.I haven't had the camera long enough to be thoroughly familiar with it, but, maybeI should have bought the XV1 before I bought another Olympus.  I also like beingable to attach an electronic viewfinder to the camera, because depending on thescreen does not allow for an increase in stability when taking a picture.", "Date": "January 24, 2012"}, {"Title": "Mostly great camera", "Author": "Tim Argo", "ReviewID": "R2YXLDIMXG93LL", "Overall": "4.0", "Content": "First, I LOVE this camera... mostly.I bought this camera to replace a Panasonic that I was very fond of and my wife accidentally dropped into a bucket of water.  While the XZ-1 is a little larger and less pocketable than my last camera, it has a much better lens and sensor. This camera really excels at lower light levels where my last camera would have been all but useless.The controls on this camera are not quite as intuitive as I would like.  My biggest gripe is the lack of ability to add fill flash in the intelligent auto mode.  Yes, it is there in the program mode but really? no fill flash in what should be the smartest settings on the camera?There is a panoramic mode where you can (theoretically) take several separate photos and let the camera stitch them together into one panorama.  I had high hopes on a recent trip as the camera actually gives you a target to help aim your second shot. Don't waste your time.  This feature simply does not work. I could do a better job with scissors and tape.All in all I am happy with the XZ-1. It is not an entry level camera and you need a little basic photo experience to get what you want out of the camera.  But this will get results in much tougher lighting situations than most other small cameras.", "Date": "June 14, 2011"}, {"Title": "Amazon is shipping used cameras. Buyer Beware", "Author": "M. Lee", "ReviewID": "R3GGQZLVN1IIPU", "Overall": "2.0", "Content": "I just ordered this camera and received it yesterday. After I charged the camera, I discovered that I received a used (maybe refurbished) camera because there was a photo in the cameras internal storage dated August 21, 2012. I'm very disappointed because Amazon repackaged the camera and tried to resell at as new in box!I'm sure the camera is great, but just be wary that you may not be getting a new camera from Amazon.Edited***I just called Amazon and upgraded my feedback to two stars because the service was good. They will expedite a new camera to me and include a box to return the camera I received. I just hope that someone buys the camera I'm returning as a refurbished item as opposed to new...As a side note, if anyone purchase this camera and sees the picture of a girl sitting on the sofa look at her phone, send me a message and we can start some sort of weird chain...", "Date": "November 15, 2012"}, {"Title": "best compact camera ever", "Author": "huan", "ReviewID": "R317T4VG9EBBH3", "Overall": "5.0", "Content": "pro-best lens for a point and shootlarge sensoreasy dial functionexcelent manual operationcon-high ISO is not too goodvideo mode is averagefocus is slow in videoI have the Sony nex 3 also, but the Olympus  zx-1 is a better camera in term of focus and color. Picture quality is almost as good as the Sony, when I got the Sony to focus right. Conclusion, best overall camera I've ever owned, and this is my sixth digital camera.", "Date": "October 31, 2012"}, {"Title": "Great pictures, sub-par video.", "Author": "nr2134", "ReviewID": "R2C4XP5CUBXTWD", "Overall": "3.0", "Content": "Im far from a camera aficionado, but I ran into the same issues that were reported here before.Still using my older LX3 I decided to look for something new. Seeing that the wife would be using this camera, I needed an easy to use shooter that offered a bit more when in my hands. Initial impressions were really good, but then we started running into metering/scene issues when in iAuto mode. Although I can use Program and set it up properly for what Im shooting, this is impossible for my wife to do since you dont have time when taking pictures of a 16 month old on the go.Comparing this camera to my old LX3, the Panasonic rarely gives my wife trouble when in full Auto mode. The metering is usually spot on, picks the right scene majority of the time and the face tracking seems to be much better.The XZ1 delivers some really impressive jpeg pictures even in close ups unlike the LX3 which could get noisy and I have to run it through a filter. I rarely have the time to touch up photos so this is a big plus for me. One thing that I cannot deal with, is the video quality, or lack thereof. I knew it only did 720p with mpeg compression, but the LX3 is really similar and I found the video coming out of the Panasonic acceptable for our needs. Little did I know that the XZ1 spends more time hunting for focus than shooting a video.I dont need 1080p with Stereo sound, but I expected the XZ1 to shoot better video than my cell phone and this camera really falls short in that regard. Spent a whole day on the web looking for a solution and although it got better, it still liked to focus in and out even when not moving around.We dont want to drag 2 cameras around and just need one that works, hence the XZ1 is going back. Might try the XZ2 when it comes down in price a bit since Im hooked on this lens now.", "Date": "October 22, 2012"}, {"Title": "Lots of features, Oympus support is GREAT, but a couple of suggestions", "Author": "S. Jamal \"Mr. Erudite\"", "ReviewID": "RVTFOI7984D2K", "Overall": "4.0", "Content": "Others have detailed the PROs of this camera, so I won't go into too much of that, except to say that the product support is excellent - a very nice lady kindly took the time to figure out the answers to all my questions on the phone. It is a great camera with lots of features, excellent specifications etc. There are, however, a couple of things I would like to see different about this camera:Suggestions for further improvement:1. The lens cap is entirely inadequate. I bought the \"RainbowImaging Self-Retaining Auto Lens Cap for Olympus XZ-1 XZ1 DC\" RainbowImaging Self-Retaining Auto Lens Cap for Olympus XZ-1 XZ1 DC. This ended up making the camera bigger, too big to fit in the camera case that I bought for it, which is: \"Case Logic QPB-202 EVA Molded Flash Camcorder or Medium Zoom Camera Case (Black)\" Case Logic QPB-202 EVA Molded Flash Camcorder or Medium Zoom Camera Case (Black). Olympus really should have been more mindful of this; there is no excuse for not doing so.2. The video format that it records in is .avi. Why can't it record to .mov format instead or also? Moreover, I can not transfer video files to my MacBook Pro using iPhoto (pictures transfer just fine). Only one frame of the video file is transferred. I never had this problem with my canon 1100IS compact digital camera. I allowed iPhoto to delete the files from the camera, thinking that the transfer went OK (it did NOT indicate otherwise!). To transfer video files, drag and drop using Finder instead.3. It seems that renaming the memory card in the finder causes a \"Card Error.\" You might want to avoid doing this.4. The dial to control the shooting mode (Auto, Aperature, etc) is too easy to access, and many times I change the setting accidentally when taking pictures in a chaotic environment.5. They include a neck strap, which is nice, but a wrist strap would have been better. Wrist straps are pretty cheap, so it wouldn't have cost much more to include it.6. Memory also is pretty cheap these days, so they should have included more internal memory too. But most cameras have small internal memory, so I can't really judge Olympus too hard for this.This is not a camera that you can operate easily with one hand and use quickly at parties, etc. It is a serious camera. But it is great, and I think it is a good purchase, if you know what you're getting and can accept all of the above. Enjoy!", "Date": "August 1, 2011"}, {"Title": "Little size, huge performance...", "Author": "Marcelo Desotti", "ReviewID": "R3TY88J5UQAQ0Y", "Overall": "5.0", "Content": "When I purchased the ZX-1 it's successor ZX-2 was already in the market, but it has lost one of the most important aspects of it's predecessor: great pocketability. I still waiting to see another compact enthusiast camera with a better image quality/versatility/pocketability ratio than the ZX-1.", "Date": "May 14, 2014"}, {"Title": "Good optics but the ring is flimsy", "Author": "OptiMystic", "ReviewID": "R2I48X8RSY3JVG", "Overall": "2.0", "Content": "I read a review that this camera has an awesome external ring around the lens that gives you access to a lot of quick adjusting in the field.  In practice I feel it's a bit awkward and flimsy.  The optics are great though.  Take a look at the Pentax MX-1 if your looking at this.", "Date": "March 10, 2014"}, {"Title": "Fast and Easy to use", "Author": "Lynn", "ReviewID": "R1103J8PCW90KP", "Overall": "5.0", "Content": "I have really enjoyed my camera. It is fast and easy to use. It is probably too heavy for people who want a pocket camera. But it suits what I want to do.", "Date": "March 9, 2014"}, {"Title": "One the Best Point and Shoots available", "Author": "E.R. Pulliam \"worldwide hunter\"", "ReviewID": "RXF0FA0EWESQW", "Overall": "5.0", "Content": "I bought this camera because of the reviews for sharpness and resolution when used for enlargements.  The largest I have done is 20x30 inches and the sharpness is great .  12 x18  at so terrific , I did not  think a 10 megapixel camera could produce the results it produces.  Its very user friendly, small, and not expensive.  I wanted enlargements with SLR qualitiy in a point and shoot camera and I found it.  Battery life is good.  I do not know yet its performance in freezing temperatures.", "Date": "February 27, 2014"}, {"Title": "I love this Camera", "Author": "Machone", "ReviewID": "R13OHYZZUVP5KR", "Overall": "5.0", "Content": "Excellent product, has many features that I was not expecting, that are not listed in the description.  Good for the beginner or the pro.", "Date": "February 11, 2014"}, {"Title": "Excellent camera", "Author": "Marta Erlich", "ReviewID": "R3KI3S5OPSPMVP", "Overall": "5.0", "Content": "Excellent first digital camera...in every way. Particularly in low light. Easy to operate... easy to learn even for base beginners.", "Date": "January 28, 2014"}, {"Title": "Very nice camera", "Author": "Roger Baer", "ReviewID": "R212ZNBIG0OGAX", "Overall": "4.0", "Content": "Although I really liked this camera, I ended up sending it back due to the lack of any kind of grip. I find cameras with no grip very hard to hold onto and never took the camera out much because I was so worried about dropping it.", "Date": "January 12, 2014"}, {"Title": "This Olympus is a good role player", "Author": "ABC", "ReviewID": "R17E9O8IPKRE9M", "Overall": "5.0", "Content": "I have had this Olympus camera for a couple of years.  I own different cameras--each has a different role.  The role of the Olympus is that I can take it almost everywhere.  It is relatively unobtrusive and always fun.  I chose the camera primarily because of the fast and sharp 1.8 (2.5 at the longest focal length) lens that can zoom out to adequate portrait focal length for quick, interesting portraits at family gatherings.  Spend some bucks and buy the electronic viewfinder accessory, which is much more useful in most cases than the camera's built-in LCD screen.I never intended for this Olympus to replace my other camera, a DSLR with various lenses and lighting equipment.  The DSLR is for when I need more control and don't so much mind lugging around more clumsy extra weight.", "Date": "January 1, 2014"}, {"Title": "Very fine camera", "Author": "Ronald K. Goodenow", "ReviewID": "R2VWO8265XIHW4", "Overall": "5.0", "Content": "I purchased this for travel, my dslr's and lenses are getting a bit more than I want to carry around on many trips. The lens and exposure system are brilliant and the manual controls a snap. The camera is very well built and the menus easy to learn. I particularly like the filters, especially the dramatic one in the arts menu. I have also found the digital zoom to be very fine; certainly as good as an Olympus teleconverter I own. The one area where one needs to practice is focusing in very low light, where one can often forego the flash. That is a matter of practice. Happily, the camera works with my Oly TTL flashes. All in all I am very satisfied so far.", "Date": "August 22, 2013"}, {"Title": "Little pocket camera that rocks", "Author": "Peter", "ReviewID": "R1Y36ZPQSH4A5Q", "Overall": "5.0", "Content": "Little p&s; camera, with excellent IQ. You can just carry it in your shirt pocket and shoot around. Many useful modes. Excellent choice for amateurs or not so amateurs. I bought this one as a \"like new\" with a ridiculously low price from Amazon Warehouse and found everything is still in plastics! Strongly recommended.", "Date": "August 14, 2013"}, {"Title": "Nice, compact camera with a good lens", "Author": "Photorave", "ReviewID": "R14COHD9EAKZAM", "Overall": "4.0", "Content": "A nice compact camera with a good lens. There is a nice punch to the JPEG photos that I have so far shot. I am particularly impressed by the camera's extensive features that enables me to indulge in more than \"point and shoot\" photography. I have yet to try the RAW mode. I would recommend this camera for amateur photographers who wish to experiment with PASM modes besides shooting photos in full auto mode.", "Date": "July 14, 2013"}, {"Title": "A lot of camera in a small package", "Author": "Amazon Customer \"IRC162\"", "ReviewID": "R169DJGEPCLKRA", "Overall": "5.0", "Content": "I take a lot of pictures. My main camera is an E-620. It's a great camera, but is really heavy. I wanted something to carry around but I wasn't willing to give up manual controls. The XZ-1 is perfect for me. It takes great shots, is easy to use, and comes with manual controls. It has a low light setting that is not to be believed. If you are a point and shot user looking to move up a bit, this is the camera for you. It is very intuitive. You won't need to spend a whole lot of time pouring through the manual to get beautiful pictures. If you are a more advanced user, this camera will give you the options you need. The only downside to this camera is that it leans toward the heavy side. It probably won't fit in your pocket. If you need that, go with the XZ 10. But if you are willing to take a bit more weight in a camera, go with this one. You won't be disappointed.", "Date": "July 11, 2013"}, {"Title": "almost perfect", "Author": "Dneo", "ReviewID": "R2QXFOW8IRRW9F", "Overall": "4.0", "Content": "Under most conditions this little camera produces the most beautiful images.  Like most compacts operation slows way down in dim light.  While I miss a viewfinder, it doesn't have one, so that is that.I'm very very pleased.Mike", "Date": "June 4, 2013"}, {"Title": "Crazy bright customizable point-and-shoot", "Author": "Ben", "ReviewID": "R2VWYE9KKLNLMT", "Overall": "5.0", "Content": "I looked long and hard at a Canon S95 and S100 as a pocketable P&S; that had a lot of manual controls. While the S95 arguably has a better sensor, The XZ-1 has a much stronger battery and is far brighter on the long end. These were big selling points to me as a good P&S; to take on business trips where I might have a little time to do some sightseeing, but don't have the space or need to bring my mirrorless camera. Using a lens cap isn't the most convenient but it was clever of them to at least include the leash string. Being able to use the same hotshoe accessories from the 4/3 or m4/3 systems is great as well.", "Date": "May 12, 2013"}, {"Title": "Beautiful Camera", "Author": "Dinh Hai Ha", "ReviewID": "R5JWQIVFUFKXK", "Overall": "5.0", "Content": "This camera produces beautiful photos. I have very nice shots with it. This camera lens is very bright in night.", "Date": "May 9, 2013"}, {"Title": "Fantastic Camera", "Author": "Sean S", "ReviewID": "RXGN7VMDB8EVH", "Overall": "5.0", "Content": "It's a little bit on bigger side, but worked excellent for our trip to NYC and took great images. Wife loves the different shooting modes and instagram-like filters.As a photographer though, not a fan of the automatic noise reduction and inability to turn that off (in jpg mode only - RAW you can.)", "Date": "May 1, 2013"}, {"Title": "Excellent IQ, small enough for my (big) pocket", "Author": "Geoff K. Hart", "ReviewID": "R173USXM10YI9P", "Overall": "5.0", "Content": "First off, what I didn't like:1) slightly larger than my trusty DMC-ZS32) stupid lens cap3) video mode AF is very poor (old ZS3 *much* better)what I love:1) still small enough to fit in my pocket, even with  http://www.amazon.com/gp/product/B004WKI0K6/ref=oh_details_o00_s01_i01?ie=UTF8&psc;=1  which also resolves #2 above2) image quality is amazing, when I pixel peep comparing my old ZS3 (which always looked good to me before), it's an amazing improvement.  The larger sensor really pays off3) the hot shoe gives me a lot of options, like:  http://www.amazon.com/gp/product/B005IQRMN4/ref=ox_sc_act_title_7?ie=UTF8&psc;=1&smid;=ATVPDKIKX0DER  which lets me play around with more advanced thingsI was almost committed to an entry level DSLR (now that you can find them for $400 or under), but after seeing the dpreview sample pics for the XZ-1, and the under $200 price here on amazon, I decided to try it (I figured small gamble - and DSLRs will only get cheaper).  Now I'm *very* happy with my decision.  This camera is more than I need already - plus I haven't even experimented with RAW and Photoshop/Lightroom (someday).  The extra bulk of a DSLR just isn't justifiable.  I will still use the ZS3 for video, and long zoom shots, but now I can't wait to use my XZ-1 whenever I can.", "Date": "April 28, 2013"}, {"Title": "Small Wonder", "Author": "H. Huang", "ReviewID": "R18NBWAWL0S5ZR", "Overall": "5.0", "Content": "I am quite into this type of cameras (such as the Lumix LX series) since they take very high image quality photos while having very compact sizes. After reviewing the initial set of picture taken by it, I was completely happy with this purchase. I have not tested the low light situation yet but I think it should meet my expectations per reviews I have read. I just wish it has some kind of grip for better handling comfort.", "Date": "April 21, 2013"}, {"Title": "Olympus XZ-1 Camera", "Author": "Howard E. Tyree \"Htree11\"", "ReviewID": "R3ON3KOSKWO2BM", "Overall": "4.0", "Content": "This is a very nice camera and easy to use for some familiar to the Olympus Pen systems and menus .  It is a  small sensor point and shoot camera with both auto & manual controls.  In the right hands it can give  some excellent photos.  The printed picture quality is very good at low to moderate ISO.  I use it to take party pictures and quick snaps at the clubs.  I 've shot low/no light photos, handheld, and got fair results.  The flash is adequate for indoor lowlight shots.  White balance is okay. If you have used other Olympus PEN cameras you will be at home with this camera.  If not, you should expect a frustrating learning curve with this camera.I will say it again this camera will give a good photographer great results and an newcomer to this system some small aggravations.Personally I enjoy using it.  I also use Fuji film X cameras for my serious work.", "Date": "March 4, 2013"}, {"Title": "aswome", "Author": "Ed", "ReviewID": "R3DM48SXKQRJWL", "Overall": "5.0", "Content": "I'm not a camera expert but this camera makes taking picture very easy. quilty is good and easy of use is great.", "Date": "March 2, 2013"}, {"Title": "Good but not perfect", "Author": "N. Bartley", "ReviewID": "R1IRU8MEWPURLF", "Overall": "4.0", "Content": "First lets start with the good features: Macro mode is wonderful and like ease of use in regards to choosing the mode or video vs. picture.  Quality if focused and lighting is correct is wonderful.  I like that you can plug into usb port to charge an battery life is great.  Lots of options for different modes.  I really wanted this to be the perfect camera for me, however there are a few issues: Camera has difficulty focusing in video mode, there is no \"flash on\" ability and there have been several times where I needed to have the flash on, but I couldn't select for it to go off.  When you customize a setting it doesn't save those selections between turning the camera off and on again.  On the fence on if I am going to return or try to work with these limitations.", "Date": "February 5, 2013"}, {"Title": "Olypmus XZ", "Author": "Alexander Ortiga \"alexa\"", "ReviewID": "R27B4NEHOD9UH3", "Overall": "5.0", "Content": "Price is perfect! my niece is very happy with this camera, she uses the camera on every outing she has. i would recommend this camera as an upgrade from the point and shoot model if you are willing to learn its uses. A", "Date": "February 1, 2013"}, {"Title": "Excellent", "Author": "jlofredd", "ReviewID": "R2D0160CXIAWJR", "Overall": "5.0", "Content": "This camera is everything all of the professional reviewers say it is and more. It is thoughtfully designed, well made and feels substantial in your hand. The image quality is professional quality with excellent automatic results, yet has options for complete operational control. Take a little time to get to know and understand this camera thoroughly and you will not be disappointed.", "Date": "February 1, 2013"}, {"Title": "I like it a lot.", "Author": "Michael Deolloz", "ReviewID": "R2QUE1YISKXLG3", "Overall": "4.0", "Content": "You don't need photoshop with this camera. I've taken some great pics, especially with the different \"Art\" filters. Highly recommend!", "Date": "January 21, 2013"}, {"Title": "Alternate for my DSLR", "Author": "Danielle", "ReviewID": "R1T4QV94UWYIYT", "Overall": "4.0", "Content": "Normally I shoot with a D7000, but wanted something more compact for the trips I have planned this year. I am a bit disappointed with the lack of depth of field that the low aperture provides and it's capability of shooting in darker situations, but overall it produces a very crisp detailed photo.", "Date": "January 18, 2013"}, {"Title": "Low Light", "Author": "Big D", "ReviewID": "RMZZKB0AMX0NG", "Overall": "5.0", "Content": "ok I own a Canon 50D and the Nikon P7100 my daughter wanted a camera for Christmas so i started reading reviews about point and shoots and the XZ-1 keep popping up...I have never owned any Olympus cameras before but the price was right and I ordered it...she used it that night and I couldn't believe the shots she had in very low light with no flash...if you need a P&S; that can take pictures in low light please look at the XZ-1", "Date": "January 16, 2013"}, {"Title": "Great camera", "Author": "T. Stanbury \"Thecookrman\"", "ReviewID": "R2OH5SVR6WFNS6", "Overall": "5.0", "Content": "I chose this camera based on the specifications as well as the quality of the Olympus name. The camera is heavier than other small camera, which makes it feel very substantial - a quality build. The quality of the photographs is phenomenal, especially at the size and price. The plethora of options is more than I expected for the price.  Overall, this is an excellent camera.", "Date": "January 13, 2013"}, {"Title": "Awesome", "Author": "Matthew Dimella", "ReviewID": "R19WD23TMLFTP2", "Overall": "5.0", "Content": "I loved it so much I gave it to my cousin's wife because I was sick of seeing bad pictures of my goddaughter.  She now takes pictures so well she thinks she is a pro :)  The low light is incredible and the camera handles very well.  I am big and have big hands and prefer large DSLRs but this one feels very good in the hands.  I still may get a case for it for aesthetics.", "Date": "January 12, 2013"}, {"Title": "one of the best..", "Author": "Amarjot Singh Bedi", "ReviewID": "R1BUCF8X22XDZJ", "Overall": "5.0", "Content": "greatttt camera, replaced it from the s95, no comparrison, some of the pictures are way better...but...... its huge if comparred to the s95 , so have sold it to a friend and replaced with the s100. if you looking for a point and shoot and not too concerned about the size, smaller than most other larger p&s; and great pictures, as for me its my second camera , dslr being my main, so didnt realise how big it wud be AS comparred TO canon S series...so have bought the s100, but i do miss the xz1 wish it was more compact.", "Date": "January 6, 2013"}, {"Title": "A nice and inexpensive camera some obvious flaws.", "Author": "George T. Somogyi", "ReviewID": "RIBJ1FL2V5R4J", "Overall": "4.0", "Content": "It is a fantastic piece of machinery. I like that it is mirrorless, small like a pint and shoot but it has most of  the advanced  features  which elevates it to the level of more expensive DSLR.  The price ($200)  was the final bait that influenced my purchasing decision. However, the fact  that  it does not have built  in electronic viewfinder makes it less usable for more serious amateur photographer. It is true that you can buy  the viewfinder separately but it is an additional $250,thus it costs more than  the camera itself. All in all I like the camera, I will learn to live  with its deficiency and if I will not be able to than I will  invest the money for the viewfinder.I would recommend this product  to my friends.", "Date": "January 6, 2013"}, {"Title": "Hidden Gem", "Author": "fair review", "ReviewID": "R161BY2QF61VG8", "Overall": "4.0", "Content": "Competing against Canon and Nikon in the point-and-shoot niche can't be easy, but Olympus' XZ-1 may be considered a bit of a hidden gem. The f1.8 lens lets in a lot of light, which in conjunction with shooting modes like Aperture, Shutter, Manual, and available Scenes, enables a shooting dynamic that may be different from the majority of point-and-shoots.It shares a number of features with other premium cameras in this segment, but the f1.8 lens stands out.While there are those who believe Olympus does a good job with their jpg algorithm, shooting in raw with this camera offers enhanced control in Photoshop and Lightroom. Buy it used on Amazon and this camera can be had for a little more than $200. As a potential bonus for Olympus ILC shooters who want a walk-around pocket-cam, there also appears to be significant similarities between the XZ-1's menu system and handling compared to Olympus' ILCs.", "Date": "January 2, 2013"}, {"Title": "I had owned a couple others....", "Author": "G. Powell", "ReviewID": "R3AF05YN5FTEEE", "Overall": "5.0", "Content": "I shoot with Nikon DSLR's but wanted a point and shoot for weather that may be a little iffy, or the short trip to the store and after reading all the specs, reviews, and features, along with a great price I went with the XZ-1.  Let me just say that for price and features, I am very happy that I did.  great little camera, and I love the \"Art\" selection!Update to initial review.  I've been carrying the XZ-1 around in my Jeep every day since buying it, so as to not miss \"the shot\"....  This past week, during the heat wave, I took a beach towel, a cold drink, and the Olympus poolside, thinking there would be a picture possibility with my two Yorkies.  Imagine the panic when one of them ran by as I was bending over to place everything on the pool deck and the lanyard became entangled in a leg and was jerked out of my hand.  it hit the concrete and then flipped onto the towel where it came loose. My immediate thought was, \"it was fun while it lasted\".  I picked it up, pushed the power button, the lens popped out and I started taking pictures of the two crazy Yorkies.  What a cool camera!", "Date": "December 28, 2012"}, {"Title": "My first high quality point and shoot", "Author": "K. Granholm \"Artisan baker\"", "ReviewID": "RH1PK90Y2MQGS", "Overall": "5.0", "Content": "I've owned a couple cheap point and shoot cameras (Polaroid) but I wanted a camera that had quality plus the features of more expensive units. This one does not disappoint.I just happened to have a resurgence in an interest in photography (having watched Tamayura ~hitotose~) and was looking for a point and shoot in the $400-500 range. Imagine my surprise when I saw this camera for less than $200!The camera is feature rich to say the least. Almost too much. Expect a fairly steep learning curve even with reading the manual. I'm slowly getting there and the more I use the camera the more I'm impressed with the features.So far the low light has been fairly impressive. It used to be that I would have to turn on every light downstairs to get a decent picture. But no more, provided I've selected the correct white balance low light pictures are quite nice. Far better than my previous attempts. The camera also excels at macro shots. There are two macro settings for close and insanely close shots. The panorama function is kind of neat. Take a picture and swing left or right  and a target appears. Line up the target and it captures the next shot automatically. You can capture three shots to make a panorama. Its good for large exterior shots and even indoor shots to an extent.I could go on and on but I'll say this, there is no better camera at $200. Get it while its available.As an aside buy the Olympus LC-63A Lens Cap (http://www.amazon.com/gp/product/B0087DIEGE/ref=cm_cr_ryp_prd_ttl_hst_4). Its like night and day over the included lens crap... err cap.", "Date": "December 28, 2012"}, {"Title": "great for price", "Author": "Monovohue \"monovohue\"", "ReviewID": "R25QR344SBHYYG", "Overall": "4.0", "Content": "The on this camera are great, very friendly controls and software and very good video quality!I only miss a viewfinder on this camera, when there's too much light the screen can be tricky... the price for the under water housing is too much.", "Date": "December 28, 2012"}, {"Title": "Good camera", "Author": "Andrew M. Sanderson", "ReviewID": "R2LU93U7T9A5I7", "Overall": "5.0", "Content": "Recently took the camera to British virgin islands and it did a remarkable job with outdoor shots, portraits and panorama. Highly recommend the camera, although it is imperative you purchase the Olympus lens cover since you will lose the one that comes with it.", "Date": "December 28, 2012"}, {"Title": "AMAZING CAMERA! OUTSTANDING PRICE!!", "Author": "ken a", "ReviewID": "RRT8XP0MZA9GK", "Overall": "5.0", "Content": "I am SO in love with this camera! I've had it almost a month now and shot almost 1000 pictures! of course I've been shooting multiples, and keeping only the best shots, the problem is, they're all good!! it's really hard to mess it up with this AWESOME CAMERA! easy to use, easy to download to my laptop, intuitive, fast zoom and auto focus, SULER BRIGHT LENS! no wonder it received the gold award from dpreview.com!!! (and those folks are serious gear-heads) it was actually because of their review that I bought this camera in the first place. . . <3<3<3!!!", "Date": "December 22, 2012"}, {"Title": "This is the best camera I have ever had", "Author": "Yury Katsman", "ReviewID": "R1K5EW5BFQCTT3", "Overall": "5.0", "Content": "This camera is absolutely assume,  Takes assume photos and they sell under water case for it that is perfect.  Buy it...", "Date": "December 21, 2012"}, {"Title": "Classic camera!", "Author": "Simon", "ReviewID": "R351CP4FH2JFPD", "Overall": "5.0", "Content": "Classic camera. Too many functions to average user. Under its factory settings, the colors maybe a little too heavier. But I think it can be adjusted.", "Date": "December 21, 2012"}, {"Title": "Quality camera", "Author": "lotech", "ReviewID": "R1Q4G955ELR9NQ", "Overall": "4.0", "Content": "Well made camera with a aperature that should be more than adequate for low light photography. The camera is small without feeling like an inexepensive point and shoot.", "Date": "December 19, 2012"}, {"Title": "Rookie", "Author": "Udayakumar", "ReviewID": "R5PA2P6R2SQUG", "Overall": "4.0", "Content": "I'm a no brainer  to Photography.  Still now holds good has lot of options, lowlight sesitivity is very good.. Still looking for a good case.", "Date": "December 19, 2012"}, {"Title": "Item as described. Thanks", "Author": "Artur Krezel \"Artur Krezel\"", "ReviewID": "R2NJ1WMWXZG9D", "Overall": "5.0", "Content": "I'm not an expert in photography but it is very good compact to me. HD movie (inside) could be better.", "Date": "December 17, 2012"}, {"Title": "Super little camera--", "Author": "Michael Strehlow", "ReviewID": "R1GHBIVSVTVP6C", "Overall": "5.0", "Content": "The newer XZ2 is larger, uses the same lens, and is no better at still photography.  This camera is fast and good, has every control any photographer could want, and at low ISOs is as good a 10 megapixel image as you can get.  A splendid carry camera for those who want good photos but don't want to be burdened by a DLSR day-in, day- out.", "Date": "December 16, 2012"}, {"Title": "good camera", "Author": "Brooklyn Motor Works, Inc,", "ReviewID": "R3VWI9RT4435TZ", "Overall": "5.0", "Content": "a friend recommended the camera to as being real nice, so I bought it.  And I must say, I really like it.", "Date": "December 15, 2012"}, {"Title": "Good camera to carry everyday", "Author": "YANLAI HUANG", "ReviewID": "R37LAJ2LPQQRN2", "Overall": "4.0", "Content": "I have many cameras before xz-1: Canon 350D, 5D mark II, G11, Panasonic GF1+20mm, Panasonic TS3 and iPhone4. I were looking for a camera a) smaller and lighter than GF1, b) better image quality than TS3 and iPhone4 c) zoom lens. There are several candidates in the market like LX5, S100/S110 etc. The reasons I picked up xz-1 were because of its bright lens and the price (I got it at $200!).I carried this camera with me every day, and compared it with other cameras I have.Pros:- Good image quality in this level. Slight better than G11.- Fun to use: multiple-exposure, panorama are useful.- Small and light-weight enough.- Anti-shake works. I combined this with continuous shoot, and could get one sharp image from a group of photos in 1/15s with the longest zoom.There are enough reviews in web sites such as dpreview.com, so I'll focus on the cons.Cons:- Image quality is worse than GF1 (because of smaller size). This is as expected.- The slowest shutter speed is very limited in aperture priority mode, most are 1/15s. Very change. I used the manual mode to set a slower shutter speed. This design is very strange. I did NOT encounter this issue on my other cameras.- The mode dial is easy to change without your notice. Whenever picking up it from my bag, I have to check whether its still in aperture mode.- The custom mode is very limited. It does not remember the focal length, aperture and so on. This is not like G11 and GF1. This makes the custom mode not much useful.- The time lag from power on to shoot the first photo is significant. Not a quick camera.- The macro mode is not really macro. The super macro mode is the truly macro, but limited in two ways: fixed focal length; very closed distance for macro shooting (easy to put the shadow of your camera on the subject, and not easy for insects etc.)This camera is VERY good for people who already have DSLR and want to find a small buddy to carry everyday. It's NOT good for serious portrait shooting (more noise and deeper DOF than GF1 and DSRL) and sports shooting (a little slow in startup and continuous shoot).I'm very satisfied with this camera. The most important benefit of this camera is that I can keep it in my bag everyday (DSLR is a burden due to the size and weight), keep my eyes open to things around me, and have fun to digitalize them by this camera.", "Date": "December 11, 2012"}, {"Title": "Bang for the buck!!", "Author": "lwfoto", "ReviewID": "R2FOMVL0EMTTOD", "Overall": "5.0", "Content": "I bought this camera on sale @ $199 and can tell you I am amazed at the quality.  The issue I see with many people is their expectations far out weigh the capabilities of the product.  I use it mostly as a street camera.  I also own the Lumix lx-5 and find this one out performs the Lumix.  Not sure I would spend the extra money on the xz-2.", "Date": "December 10, 2012"}, {"Title": "Great camera!", "Author": "Arisha", "ReviewID": "R341O12JXO1EVZ", "Overall": "5.0", "Content": "This camera has lots of professional features, but I use it as \"point and shoot\".  Most time I use iAvto mode, and camera does really good job. Olympus xz-1 makes the best pictures I`ve ever had. What is important to me, camera makes great pictures at night. Compare with my friend`s Canon EOS-M, Olympus makes better pictures.", "Date": "December 10, 2012"}, {"Title": "A super digital camera", "Author": "Jeff Jordan", "ReviewID": "R3GHCWDJ10PHU7", "Overall": "5.0", "Content": "I wanted to upgrade from a point and shoot to high function camera, similar to some of my old, retired film cameras.  This camera fully lives up to the Olympus name, providing an excellent high function camers, giving the user extensive control over images.  It can point and shoot when you want but also lets you adjust almost every function when you really want to take control of the image.  The view screen is great, giving you an excellent preview.  The controls and indications of the various functions are very good, and fairly easy to remember once you work through them.  Also it is fairly easy to browse if you forget where a specific control is.", "Date": "December 8, 2012"}, {"Title": "Pretty good!", "Author": "Fu Wayne", "ReviewID": "RXQ7WD8PP3J35", "Overall": "4.0", "Content": "This is my first digital camera, I compared with other product and saw lots of comments. Finally, I choose this product.  $ 200 is pretty cheap price and amazing functions for me for now.", "Date": "December 7, 2012"}, {"Title": "So far so good..", "Author": "DanW", "ReviewID": "R2N0OL9E9UV0CA", "Overall": "4.0", "Content": "Once i get it under water i'll know for sure.. I'm not a camera buff, so can't get much more elaborate than that ;).", "Date": "December 6, 2012"}, {"Title": "Excellent camera", "Author": "gerald j reese", "ReviewID": "RY4CO69HDO4YS", "Overall": "4.0", "Content": "I have had the camera a few weeks but only used it twice to take 15 pix. On auto setting it takes excellent pictures, great color, very fine definition, low light level pix are outstanding, the quality of the lens is apparent by the picture quality. I guess the best description of the quality of the pix is that they look just like the subject, was surprised by the color very accurate.  The only problem I have had is seeing the display in bright sunlight---I am use to cameras with an eye viewfinder, I do miss  that. I am happy with the camera but not with the owners manual which is on the CD, so, I had to print 40 some pages and it is not up to the standard I would expect for such a good camera. The camera is packed with features I have yet to try.", "Date": "December 4, 2012"}, {"Title": "Good camera & lens....video not so much", "Author": "K. Singh", "ReviewID": "R1D55H9IU0V2HN", "Overall": "4.0", "Content": "Great lens producing extremely sharp images very comparable to DSLR in good light with ISO < 400.f/1.8 allows low light shots without flash & narrower depth of field than on a standard compact camera (still not equivalent to DSLR with a good lens).WB presets not great - VERY yellow looking results w/o flash in artificial light - can be resolved with custom WB setting.It's really quite fast / responsive, however I found AF didn't work particularly well (haven't figured out how to make camera focus in middle of shot consistently).....not good for a point and shoot & what's the point of a fast camera if it can't focus on the subject first time around?Manual focus available & works well, but takes a while to set up for a picture this way.Video is definitely sub standard compared to competitive products.Overall a very solid camera for people want a portable \"substitute\" DSLR. I keep forgetting this is a \"compact\" camera and tend to review it too harshly as a result. That is a testament to how good it is. Not great for beginners and not great video either.At ~$200 it's very good value.", "Date": "December 4, 2012"}, {"Title": "Great intro camera for advanced photography", "Author": "Anthony Shaheen", "ReviewID": "R25EQAUWCA2NVG", "Overall": "5.0", "Content": "The camera functions amazingly! It takes GREAT pics. The options to manipulate shutter speed aperture and exposure make it very easy to use the camera. Great intro camera for more advanced photography. battery lasts two or three full days of taking pictures", "Date": "December 3, 2012"}, {"Title": "A great little raw shooter", "Author": "aethelraed", "ReviewID": "R2TPOQ3V0VYZ8S", "Overall": "4.0", "Content": "The recent Amazon sale price of $199 for this camera had me pick up my second one. I traded in the first one I got for a larger sensor camera to take as a backup on a trip, but I've missed having a pocketable take-anywhere shooter.The title of my review gives my fundamental thoughts about the camera. I shoot raw and don't mind using Adobe Lightroom to develop files to my liking, but if I only shot jpeg I would not be happy with the XZ-1, which applies aggressive noise reduction and sharpening at all iso speeds, getting more aggressive as they go higher. Having said that, I should acknowledge that I'm generally unhappy with jpegs from small sensor cameras. The Leica D-lux 4 was about the only exception I can think of, and jpegs from the pansonic version of the same camera left me cold.If you shoot raw, though, this camera produces great files with lots of information to work. The lens is superb -- sharp, fast, and resolving lots of detail; the image stabilization is very good; and the controls are easy to access and use. I love having the control ring around the lens, as that is where the shutter speed ring was on the old Olympus OM film cameras. I find the files up to iso 800 usable with no problem if they are properly exposed. You're not going to print them at the 100% on screen size, so don't expect them to have printable quality at that magnification. 8x10 or 11x14 at 800 iso is perfectly reasonable -- 16x20 at iso 100 should be no problem --- IF you shoot raw files. With a zoom that is still quite fast at its telephoto limit, there will be very few occasions where you will need to shoot higher than iso 800.For the best results, software other than Olympus's own Studio or Viewer 2 should be used, something that allows some control of color noise seperate from luminance. The Olympus raw development software is rather crude. It will do the job, but with many fewer fine tuning controls than Lightroom or Capture One have.", "Date": "December 1, 2012"}, {"Title": "Olympus XZ-1 review", "Author": "W. Stein", "ReviewID": "R10U5W74QMQ6DW", "Overall": "4.0", "Content": "I read the reviews  on this camera since it was released and it appealed to me as good back-up camera, when my heavier SLR was getting a bit bothersome on occasions.For the longest time I hesitated to purchase this camera ,for my wife thought that I had too many cameras already but, recently the XZ-1 went on sale and I couldn't resist and bought it . I'm glad I did because, for a compact camera, the picture quality is excellent. The auto focus is fast and the other manual controls are what I need in a camera.I was so pleased,that I ordered the new XZ-2, which one has to wait for,since it is not in the stores yet.", "Date": "November 27, 2012"}, {"Title": "YuriyG", "Author": "BoA \"paganelle\"", "ReviewID": "R1LND5W3LWUSK9", "Overall": "5.0", "Content": "Nice camera. It works perfect in dusk and can take good pictures inside of buildings without flash.Up to now I found only 2 \"bugs\":- the geometrical distortion of lens is relatively high, so- you can't make good panoramas in the city.", "Date": "November 27, 2012"}, {"Title": "By far the best compact camera that I have owned!!", "Author": "S. Guu", "ReviewID": "R84374MFUYQKP", "Overall": "5.0", "Content": "This is my first review ever and this just to show how strongly I fell in love with this little marvelous camera!  I have used this camera for about two weeks now and have taken over hundreds of pictures with it, from random scenery shots, macro shots to family gatherings.  And XZ-1 has not disappointed me when it comes to picture quality!  It rivals some of the entry/mid level DSLR... and with practice and adjusting the setting, the picture is clean, sharp and its low light performance is just simply amazing, especially without flash.  The ambient light from the buildings and light poles is sufficient for taking some natural looking, clean and shape images.  Of course, you will need to play with a setting a bit, and once in a while, take a multiple shots.  But the pictures are stunning clear with very little noise.  I am not a trained photographer, but I have quite a bit of experience working with computer graphics and I enjoy artistic work.  And XZ-1 is more than just satisfying... like other reviewers, it's a lot of fun to use!  However, I do have to caution that XZ-1 is no magic camera and it probably won't take a perfect picture every single time (and I believe no camera can)... yet with a bit of practice, its true potential for creating amazing pictures can be realized.  I am glad that I buy this camera and looking forward to preserving some memories and beautiful pictures for years to come!  One last note, if video recording will be a big part of your routine, you might want to look elsewhere, as the video recording ability of XZ-1 is minimal (mostly due to its inability to have a good focus)!  You better off record it on your smartphone or other devices.  However, when it comes to pictures, XZ-1 is born to be a champ!", "Date": "November 26, 2012"}, {"Title": "Nice camera for the price", "Author": "Joe", "ReviewID": "RMDTVDV0Q2UZG", "Overall": "5.0", "Content": "I wanted a smaller camera for traveling and this is just right and takes great pictures. Price was also great!", "Date": "November 26, 2012"}, {"Title": "this is great camera", "Author": "Young", "ReviewID": "R2OXTUZV09OSNS", "Overall": "5.0", "Content": "a good deal on it, F1.8 is a great choice for taking pictures. the color of picture is good, but the battery won't last long when recording vedios", "Date": "November 25, 2012"}, {"Title": "Very nice camera.", "Author": "ergün özdemir", "ReviewID": "R1JI5JXGDXIT50", "Overall": "5.0", "Content": "Very nice camera. Simple to use -- very intuitive. Solid construction. Takes great pictures. Art modes are fun to use. Scene selections are also great. Camera is nice size: compact yet not too small.", "Date": "November 24, 2012"}, {"Title": "Can't beat the price ($200).", "Author": "nonstopjoe", "ReviewID": "R2EBVILB3C1FFV", "Overall": "5.0", "Content": "I bought this because of the f1.8 lens and am glad I did.  Will take many indoor pics without using the flash.  And the versatilityof settings is endless.", "Date": "November 24, 2012"}, {"Title": "This is good camera for me.", "Author": "shield \"Bowen\"", "ReviewID": "R3OI8OVVYOUMAY", "Overall": "4.0", "Content": "Why I bought this camera?1. I was using Canon IXUS 40 which was bought at 2004, so I would like deprecate it and replace it with a newer compact camera.2. I have Canon hard disk camcorder which I bought in 2008, but it is too heavy so that I don't like to bring it with me during travelling. Since the technology of camera improves quickly, I would like to have a compact camera with good video recording feature.3. I read reviews from [...] and found XZ-1 is marked as Golden Award. Comparing with other Gloden Award cameras, XZ-1 has relatively low price.4. I don't have any professional knowledge of photography and don't have experience using any type of SLR camera, so I ignored some negative reviews published by DSLR users complaining the image quality by comparing with DSLR camera.Based on above background,  I bought this camera 2 two months ago. After using it several times, I am satisfied very much for the features of this camera. In almost all aspects, this camera is much more better than my old canon IXUS 40.But in video recording area. it is below my expectation. it totally cannot compete with my old Canon hard disk camcorder in multiple ares: definition is bad. video looks blur. speed of focusing is low so that when you move the lens towards items in different distance, this camera will spend 3-5 seconds to focus, which ends up with the recorded video is always very blur.One another minor issue is that only photo/video preview feature is available once plugging in USB cable for charging. I have a external USB battery for my cell phone,  so I thought this camera could also take benefit once out of battery during photographing . But currently once I plug in the USB cable, all other features will be shut down until I remove the cable. So, if encountering out of battery during visiting specific tourism attraction, External USB battery doesn't help much.Above all,  I rated four stars for this camera.", "Date": "November 23, 2012"}, {"Title": "Best value for price", "Author": "Darren", "ReviewID": "R1I47BLAUMW9RW", "Overall": "5.0", "Content": "As described in many reviews, it is a \"prosumer\" compact digi cam.  Does more than point and shoot but also not as good as lens kit cameras.", "Date": "November 22, 2012"}, {"Title": "The best compact camera I've owned so far", "Author": "H. Nguyen", "ReviewID": "REJGUN80L3M1Y", "Overall": "5.0", "Content": "I've owned many, many point and shoot cameras including LX-5, canon 300HS, Panasonic GF2.This camera/lens is fast at night which is my main concern.  It's very easy and fun to use especially the wheel.", "Date": "November 19, 2012"}, {"Title": "Love it so far", "Author": "A.L.", "ReviewID": "RY2WC6DBBXRDX", "Overall": "5.0", "Content": "Love the camera so far, great deal! I've always been a Canon user, so still trying to get used to all the functions. Still a lot to learn! Overall, the image quality is excellent. The only thing I don't like is the lens cap.", "Date": "November 17, 2012"}, {"Title": "Great camera. Great deal from Amazon", "Author": "W. Williams", "ReviewID": "R2T38AYOEH9LQX", "Overall": "5.0", "Content": "For the price, it is hard to beat this camera. LIke the other reviews say, the lens and sensor on this camera approach DSLR quality, in a compact pocketable camera. Olympus hit a home run with this camera. It may just be good enough for me to sell my DSLR, which rarely sees use these days. For the best quality, shoot in RAW and convert later.", "Date": "November 17, 2012"}, {"Title": "F 1.8 and nice Macros", "Author": "Amazon Customer \"Milo\"", "ReviewID": "R10AL6PXC4JSKX", "Overall": "5.0", "Content": "I've only had the camera for a couple weeks.  I might be easy to please because my last camera was 11 years old.  Very happy with the F1.8 and super macro.  Maybe I will use this for a decade too.", "Date": "November 16, 2012"}, {"Title": "Olympus XZ-1 Digital Camera", "Author": "Vallen", "ReviewID": "R2TW65DBWITIRM", "Overall": "5.0", "Content": "Really good choice to buy it, $199.99 is an unbelievable price. F1.8 Lens can be used easily in low light circumstances, also very portable.", "Date": "November 7, 2012"}, {"Title": "Impressive Deal (October 2012)", "Author": "Aaron A. Davis", "ReviewID": "RGUL79BW73T02", "Overall": "5.0", "Content": "I can't believe this camera is 200 dollars.Ignore nitpicking reviews.  I think that goes for any camera review, actually.If you can't make good pictures with it, read The Art Of Photography by Barnbaum.There are very good professional reviews for this camera on the web (Luminous Landscape, Steve Huff, etc.).You may want a viewfinder (VF-2 or VF-3) if that is what you need to compose.They are giving this camera away.", "Date": "November 5, 2012"}, {"Title": "Perfect little camera", "Author": "rad", "ReviewID": "R2J3WH7YNK8D8J", "Overall": "5.0", "Content": "In my view at this price point this is the perfect little camera. Easy controls that give a range from fully automatic to manual, creative options, decent zoom, and great quality pictures. If you want a point and shoot but wish for better quality, or have a dslr but dream of portability this is the perfect mid-point: better quality than a point and shot, fits in your back pocket, and if you lose it or it breaks it will hurt, but not as much!", "Date": "October 3, 2012"}, {"Title": "Best point and shoot camera currently", "Author": "ViolentMetaphor", "ReviewID": "RDUFLS258MSXB", "Overall": "5.0", "Content": "This is the best point and shoot camera that I have used.  I read through a lot of reviews and this is a top rated camera on dpreview.  I don't pretend to be a photographer and I'm not going to take the time to learn all of the intricacies of proper DSLR use.Most of my gripes are with the software.  I think they did an excellent job on the hardware and camera itself.* Take note that the software on the CD is not available online.  It's very annoying that Olympus chose to do this.  I don't want to keep CDs around when I can download it online.  I rarely use the installation CDs because they are usually out of date anyway.* At the time when I installed this, the Olympus website was out of date.  It claimed that firmware 1.4 was the latest when in fact 1.5 was.  The software will update the firmware for you.* The included USB cable is too short.* The manual is only in PDF format.  This may be an issue for some people.  I believe they have an offer to send you a manual for a minimal cost.All of my problems with the camera are minor nits.  I would buy it again unless there was a newer camera that had the top spot in dpreview.", "Date": "September 3, 2012"}, {"Title": "XZ-1 Review", "Author": "USA159 \"AmazonFan\"", "ReviewID": "R2TZMSSSOFNQY5", "Overall": "5.0", "Content": "Amazingly good camera for being so small.  Its well balanced in weight and the LCD screen is very clear.  It takes great pictures in low light conditions, which is a huge plus for me.  I haven't really had to use the flash very much.  There is also a lot of adaptability that aids you in getting that perfect shot.  Enjoy!", "Date": "July 13, 2012"}, {"Title": "Outstanding capabilities for a small camera", "Author": "D. Murphy", "ReviewID": "R26CFPLLESW2HG", "Overall": "5.0", "Content": "I wanted to upgrade from my Canon SD800is but still needed tne portablilty of a very small camera.  After researching a number of cameras extensively I went with the XZ-1 - I needed a fast lens for low light shooting and also wanted the bokeh capability that this lens offers.  The availability of full manual control of virtually every aspect of shooting was a big plus as well.  The XZ-1 has exceeded my expectations - photo quality is superb and the flexibility of having total control of all functions is wonderful.  I am finding that the controls and menu interface are very intuitive and quickly learned, and access to the controls and settings I use most frequently is fast and simple.  The shallow depth of field bokeh effect is amazing for such a small camera and is a reflection of the superb quality of this lens.I bought an aftermarket automatic lens cap and it's OK but adds quite a bit of bulk to the lens and makes the camera a poor fit in a slimmer case.  I've found that I don't mind the Olympus lens cap with its lanyard, it pops off when the camera is turned on and hasn't turned out to be the annoyance I expected - and is a small price to pay for having this wonderful lens.  I prefer a small wrist strap to the neck strap that came with the camera - the wrist strap fits more easily in the small belt pouch I use to carry the camera and makes it much quicker to grab it and shoot.There's no one best camera - but certainly the wide spectrum of choices make it possible to find the perfect camera for whatever you need.  For me, that camera is the XZ-1, I couldn't be happier with it.", "Date": "July 12, 2012"}, {"Title": "Almost perfect...", "Author": "Robert Pawlak \"rjpawlak\"", "ReviewID": "R6BSB2UIWLLMA", "Overall": "4.0", "Content": "The f/1.8 lens is one of this camera's best assets. It has allowed me to get shots in low light or of moving subjects that were impossible with my previous point and shoot. Ergonomics are pretty good, with the exception of the macro function. Bettery life is sufficient for my use and comparable to my previous lumix. The camera generally does a good job picking exposure and white balance. The only things I do not really care for are the in-camera battery charging, and the use of a lens cap. Both are addressable with accessories, but portability suffers a little. Colors are a little too saturated on the OLED display, but the latter is fairly bright and usable in almost any lighting conditions.", "Date": "July 3, 2012"}, {"Title": "A good go-to camera with advanced features too", "Author": "Suz", "ReviewID": "R2AVPXKN1P6G0S", "Overall": "5.0", "Content": "I've had this camera for nearly a year. It was a splurge purchase on my part, but I don't regret it. I'm finding that I grab this camera when leaving the house most of the time, for general photography. It's not tiny and pocketable, but certainly more compact than my DSLR or my superzoom point-and-shoot digital camera.I know it's not relevant to how the camera works, but I really like the classic, almost retro, look and feel of the thing in my hands.I use a wrist strap with it - OP/TECH USA 1801021 Cam Strap (Black) - and a custom case for protection: Olympus Fitted Camera Case for XZ-1 - Black. This is not a camera you can safely drop unprotected into a larger bag, because the lens cap is very easy to dislodge, leaving the lens surface vulnerable to scratches. Whatever you do, carry and keep it in some kind of protective case to avoid damaging either the lens surface or the lens extension mechanism.This camera shines, as expected, in low-light performance. I've taken no-flash photos of choral performances, building interiors, and people, all with very satisfactory results. I've experimented with some of the \"artistic\" modes, with fun results. If I'm going to a party, this is my camera of choice. I can get pictures of my friends without blinding them.That said, I know I'm just scratching the surface of what this camera can do. I've printed out the user manual and intend to work my way through some of the advanced features so that I'll be confident to move off the auto or scene settings in appropriate circumstances.I only wish that the Olympus VF-2 Electronic ViewFinder (Black) cost less, because being able to have a viewfinder in bright light would make this camera even better.", "Date": "June 30, 2012"}, {"Title": "XZ-1 Fell short of expectations", "Author": "Milton A. Parker \"doctorpee\"", "ReviewID": "R2XWM6T5XRYO40", "Overall": "3.0", "Content": "I have not done many reviews and was initially reluctant to submit this one. But after reading so many good and excellent ratings and reviews thought I would offer my opinion of this point and shoot. I had the camera for three days and returned it to Ritz camera for the following reasons: 1) onboard flash severely under powered requiring large boost in ISO or exposure compensation: 2)not a well thoughtout lens cap design, cap pops off if not removed when turning the camera on-extremely aggreviating; 3)strange reddish hue noticed in most exposures which may not be eliminated even with white balance fine tuning; and 4)Auto Jpeg images usually soft and not well defined. The XZ-1 performance in auto was compared to the Nikon P7000 and S8100 and each of the Nikon's image quality was dramatically better than the Olympus(cameras were set with comparable resolutions).I really expected much better results from this $500.00 point and shoot and could not phantom the idea of spending another $200.00 for a Olympus flash to take up the slack of the anemic on-board flash. If you are a potential buyer of the XZ-1 you may want to take a close look at the above issues and decide if this camera fits your needs and expectations.", "Date": "March 24, 2011"}, {"Title": "Overall awesome, but with some flaws", "Author": "Maria M. Hardesty", "ReviewID": "R1BHJQAODPXY5", "Overall": "3.0", "Content": "Awesome compact camera with bright lens. Bad video though and no exposure lock. Make sure yours doesn't have a constant clicking noise during video recording when AF is turned on. I've experienced this on three different xz-1s!", "Date": "December 18, 2012"}, {"Title": "Best camera for close face shots and low light.", "Author": "PrincessOfTarts", "ReviewID": "RNP8AURYYHQX5", "Overall": "5.0", "Content": "This  is the best camera I have ever worked with. I find this camera more suited for low-light and close-ups than the more popular and expensive DSLRs. Remember good photos are dependent on the photographer not the camera, just the same as paint on canvas. For a quick fix to soften light on the go, take a piece of paper about 3\"x3\" roll it into a cone and hold it around the flash to diffuse; that helps tremendously when you have no other lighting options.", "Date": "December 1, 2012"}, {"Title": "Good!", "Author": "Colin", "ReviewID": "R8E5LSZOQ5WA9", "Overall": "4.0", "Content": "I like this camera a lot. Although i am pretty disappointed in Olympus for not having any noise adjustments in camera, thus resulting in pretty bad jpegs. Hopefully Oly will do firmware 1.6 and fix the harsh processing. For the web sharing, blogs, the jpegs are decent enough. Now RAW images are a lot better in my eyes and i'm just using Olympus Viewer 2 to convert them and maybe tweak them a little. This is my first time experimenting with RAW format. But when i take pictures that i just want to share fast and not worry about editing, this camera is alright, like i said i wish it produced better OOC shots. I got this camera from Amazon for $200 and am overall very pleased. Another downside though is that it's not really that compact. I think if the Canon s95 would have been cheaper than i'd probably would have gone  with that despite the slower lens.", "Date": "November 26, 2012"}, {"Title": "Great camera for my needs!", "Author": "S. Lobos \"slobos\"", "ReviewID": "RVY14PRJ1OEED", "Overall": "5.0", "Content": "I'm not a camera person by any means but I can without a doubt say that this camera takes some quality pictures.  I'm not sure what the best settings or features a good camera should have but the Olypus XZ-1 is very user friendly in that it has preset settings with options for certain situations that you're planning to take pictures in.  For example, took the camera to my son's soccer game.  There was a setting that was specifically for snaps of moving objects.  The shots I took came out great and without any motion blur.  Can't say enough how happy I am with this camera.  I would absolutely recommend it.", "Date": "November 5, 2012"}, {"Title": "For the enthusiasts, not a straight point and clicker....", "Author": "The Boss", "ReviewID": "R1RNMZQDR69FJ5", "Overall": "4.0", "Content": "Wow, I have been watching this camera for quite some time. Amazon placed an amazing sale price on this item, and honestly, for the reduced price, it can not be beat. So I went and grabbed one. Sure there are the Lumix's DMC LX5 with 20x optical lenses, and then there are the Canon s95 and the Nikon p7000; but they will not be reduced in price anytime soon. This camera comes in black and white. The white still sells for over $300. Still not bad, but when going to that price, the Canon's and Nikon are a better bargain. Now at $200, the Olympus XZ-1 can't be beat. It has a RAW picture setting which, in my opinion, is very good. Now, take to heart, this is not a point and shoot. This is more of an amateur photographer's camera. Not a quick point and shoot. The camera does has a quick 1.8 lens. The shudder speed and snap taking is maybe the quickest I have seen on most cameras. The menus are fairly simple, but take some time to learn. I was very used to Canon's button mapping, and it seems many newer Nikon's are following Canon's lead. Olympus is a bit of a departure. You will need some time to learn the features, where they are at, and how you use the camera. That being said, its not a hindrance. What Olympus did do, is take the ring feature from Canon. On the lens, there is an adjusting ring, and depending on which mode you are in, this ring sets aperture or your ISO settings. Its really great when you have the time to play with the settings. I also like the scroll wheel on the back; just wish it was bigger. The camera is larger than most in this category, but also compact enough for a jacket pocket. There is a large 3\" OLED screen on the back, but no optical viewfinder. You can attach a mini optical view finder to this camera with the port on the back (sold separately). There is also a hot-shoe socket. The pop-up flash has been more than adequate. In most cases with fixed lens cameras, daytime shooting is great, and night time shooting takes time and practice. It also includes Olympus's Viewer software to view RAW images and edit them, and then save them to use with your other photo programs. For $200, its a great step to going towards an SLR, without breaking the bank, and want some better looking vacation photos to print 8\" by 10\". But if you want that quick vacation camera, and share images online, hmmm.. maybe pass on this one.", "Date": "November 4, 2012"}, {"Title": "Great Little Camera", "Author": "S. Goodall", "ReviewID": "R2RK77A46RU74I", "Overall": "4.0", "Content": "I love the camera. I wanted a small camera to take when I do not want to take my DSLR, and this is perfect. I would give it 5 stars, except the manual is online, the print is small and the PDF is not structured so you can easily jump to the topic you want. I tried putting it on my Nook and the print is very difficult to read even with my glasses - I tried enlarging the font on the Nook and it had no impact on the PDF.The camera's menue structure is not intuitive so when you start using it, the manual is necessary to unlock the features.I am an experienced photographer, worked as staff photog for the local newspaper for many years, and am used to figuring out the quirks of cameras. This is my third Olympus so I was surprised at the difficulity I had learning it.But the pictures are excellent and I would not trade it for another camers of this size.", "Date": "July 14, 2011"}, {"Title": "Overhyped Speed, Poor Video, Fun to Use...OK maybe at $199 .", "Author": "Bears Fan Jim \"qm2-703\"", "ReviewID": "R2ZFAGQO8OI92U", "Overall": "3.0", "Content": "UPDATE 12-21-2012 :Wow ! The XZ1 has gone back up to $349 as I am looking today...Can't see it.At this level. seriously consider the Panasonic LX5, or a Samsung NX100 or NEX-C3 if you have large coat pockets.Yes the LX5 and the others are slightly more, but if you are tempted by the $349 XZ1, you must be serious enough about photos to spend more than a P&S; budget. (And with the NEX, you will get better high-Iso and much better video as kickers...)I tried two different XZ1's, because I thought perhaps I got a poor first one, since so many reviewers rated the XZ1 quite high.As mentioned by others, the video is quite poor , mostly due to slow focusing. But that's all I will say about video for now, since some Amazon reviewers claim not to be really interested in video on a camera anyway.  That puzzles me, because I don't carry a separate videocam - it defeats the purpose of preferring a \"small\" camera in the first place if you are carrying a separate video unit, no ?Before I start on Pros and Cons, let me refer you to a site called DxOMark.com which tests and rates the pure performance of a camera sensor alone, ignoring lens and firmware. The XZ1 scores 34, whereas most of the direct competion is higher (e.g. LX5 is 41). This may be a major crippling factor that explain the first of my Cons you will read in this review.PROS : - XZ1 has pretty good color balance outdoors and even indoors. though indoors does have a slight red hue a lot of times, but not disagreeable. And the color balance does have a lot of adjustment ability, my favorite being the ability to directly snap a pic of something white where you are, and the XZ1 will use that as Auto WB until the camera is turnd off or reset. It does this quite accurately, whereas some cams I've tried do not custom set WB well.  - has a really nice interface/menu system once you learn it. Not very complex to be able to do a LOT of things. And this camera does have a LOT of ability to control situations - more than the rather short menu appears to have at first. Fun to find new ability every time you pick up the camera for the first month or so.  - some of the things not found on all the competitors (esp at $199 !!) are Flash exposure adjustment, Color Balance even in Auto mode, Live View, many in-between ISO ratings (e.g. 160,320,640, 2000 etc) and more.  - all in all, I really liked the operation and feel.  - The camera can take clear stills at 400 and 800, so why have the Auto mode prefer iso 200 so many times in low-light indoo situations ??  - build quality appears very high, even tho I was a little taken aback by the heavy opening and closing thud of the camera entending its lens.CONS:  - both cams I tried seemed to \"lock onto\" iso 200 and 1.8 aperture to shoot almost all indoor pics, which often then were at 1/13 or 1/15 shutter speed. Why have a fast lens, if all you can do is 1/13 shutter speed...????  - P mode lets you put iso above 200 okay, but you lose some speed again if the XZ1 selects 4.0 or 4.5 aperture, so you are left with shooting Aperture or Manual modes to be able to control ISO and Aperture at the same time. Now for me Aperture mode is near normal, but for those who think the XZ1 is a \"superfast low-light Auto-mode sensation\", they are going to be surprised.And, sorry, but the Lummix LX5 and even the Lumix ZS15 (a real deal !) have much better video. Can't totally ignore that.", "Date": "November 3, 2012"}, {"Title": "Misleading low light", "Author": "ioch \"ioch\"", "ReviewID": "R887PIIJ24AC0", "Overall": "3.0", "Content": "Overall nice camera. I returned it and got the LX5 instead because of one major flaw - when taking low light pictures the OLED screen made them look excellent until I got home and transferred to computer. I rather have the OLED screen not overcompensate the brightness and sharpness of the actual photos which did not look as good. This way I could have retaken the bad ones with different settings.", "Date": "March 29, 2013"}, {"Title": "Great pictures, usability issues", "Author": "Craig Finley \"Groenlo\"", "ReviewID": "RQMB92G532T9U", "Overall": "3.0", "Content": "I love the pictures from this camera. My big complaint is how long it takes to close when I hit the power switch after taking a panorama or \"hi-speed\" pictures. I use this camera snow-skiing, and panorama is great for some of he high mountain scenery. I use hi-speed to take action shots, which turn out great. But the camera takes a long time to process these photos, and will not retract the lens until processing is complete. I have been stuck out in the open in subzero weather gripping this camera with a bare hand waiting for approx 1 minute for it to processs a panorama. I can't put the camera away in its case because the lens won't retract.This should be a relatively straightforward firmware fix. If Olympus fixes this, I'll rate this camera 5 stars. It does take great pictures.", "Date": "February 22, 2013"}, {"Title": "Clarification on the sensor size of the XZ-1 and other compacts", "Author": "Thomas", "ReviewID": "R2F5KR56QTCSF", "Overall": "5.0", "Content": "After reading a lot of these reviews, here is some sensor info and why the XZ-1 is a great choice compact and the best compromise to not having a DSLR camera with you.  This camera is a compliment to your existing DSLR out there, but is no substitute to any DSLR (DX or FX):...a DSLR DX format sensor is more than 8 times larger in area than this sensor in the XZ-1. However, this sensor is high quality for the size it is. It is actually easier to manufacture a higher quality sensor in this size with FEWER mega pixels than it is the same size sensor with more mega pixels. So the believe that higher pixel number (over the same sensor area) results in a better sensor is incorrect. A lower pixel density will make for a more solid and robust sensor and is less prone to failure. With a good design one can make a much more stable and responsive sensor. This XZ-1 sensor is of great quality. And in my opinion is actually of better quality than the XZ-2 sensor. The reason why is that the XZ-2 sensor is physically slightly smaller and the pixel density is higher. That makes it (very likely) less robust. That is a simplified statement not taking smaller design rules into consideration (the base design rule of making a semiconductor chip). We will see more interesting changes in the future as process technologies will approach the single digit scale in the nanometer range.Camera manufacturers love this compact camera market. They use smaller sensors and charge as much money as for a DX sensor based DSLR camera.  Manufacturing a DX format sensor, not to mention a FX sensor, is exponentially more difficult and higher in cost due to particle contamination challenges in semiconductor processing and in the resulting lower yield for these sensors during manufacturing as a result of particles and other defects during manufacturing.So, as an enduser, one is much smarter to buy a full DX type DSLR camera than a $600 to $1300 compact camera (especially with interchangeable lenses). You get more camera when buying a DSLR DX format camera than buying a fashionable compact camera. The lenses for these compact cameras can be of much less quality (the lenses for these cameras have to cover a much smaller sensor area, so the optics necessary is much lower in production cost) and the enduser pays many times more than they do for DX and FX lenses. It's a huge profit margin for camera manufacturers.That's why it doesn't make economic sense (and from the picture quality) to buy a compact type camera with interchangeable lenses.  Not to mention that a compact camera with interchangeable lenses is not compact at all and much more unhandy to handle.Therefore, the XZ-1 is a great compact camera: It's got high quality lens fully attached with it, and the sensor is small but of great quality (but larger than the low end consumer cameras). And if you can get it under $300, you got a deal.If you are not satisfied at any edge of the XZ-1 performance, buy a full fledged DX DSLR camera (huge jump in what's possible based on the sensor)  instead of looking at a Leica compact, Sony Rx-100, or whatever camera. Buy a real DSLR with a DX type sensor or better (FX).  Because all of the compacts have their limits in their sensors.If you are buying an XZ-1 compact, then you made a great choice for buying a compact!  It's the best one you can buy unless you need video.", "Date": "November 20, 2012"}, {"Title": "One heck of a camera, picture quality that rivals a DSLR  in a small package.", "Author": "Bob Stolz", "ReviewID": "R1DC97C9MQJFAV", "Overall": "5.0", "Content": "After reading the reviews on this camera I decided to give it a go. The picture quality is sharp and vibrant, and the control it offers to take pictures the way you want is outstanding. I all ready have a larger Canon DSLR but wanted a camera to carry around for quick shots while driving or walking places. I love the 1.8 to 2.5 lens, great for low light. This camera is simply awesome.", "Date": "June 19, 2013"}, {"Title": "good", "Author": "liu.xiaolan", "ReviewID": "R31SBIG2ATBPUD", "Overall": "5.0", "Content": "The camera is very good, take photos are very beautiful.Is very favourable price,I'm very very very like it,ha ha ha", "Date": "January 20, 2013"}, {"Title": "Pretty Good For a Small Sensor Compact", "Author": "VB", "ReviewID": "R38KA4INV1RKC4", "Overall": "4.0", "Content": "I bought this kind of on a whim when it dropped to $199.  I have had a Canon S95 as my RAW shooting compact for a while, and the F2 lens was nice, but only at 28mm.  It quickly dropped to F5.9 by 105mm, which made it pretty unusable at the tele end unless you were in bright sunlight.  Plus the low light performance started falling apart at ISO800.I was really intrigued by the fast lens, F2.5 @112mm and of course the big F1.8 at 28mm.  In good light this little camera is amazing.  The lens is razor sharp, and its colors are fantastic.  However, since I use it mostly as a point and shoot, I leave it in AutoISO almost all the time.  I started to realize why the Auto ISO would only go up to ISO200 even when the shutter speed dropped to questionable levels (i.e., 1/13-1/8s)  Turns out its low light, high ISO performance is not very good despite that fact that is has a larger 1/1.63\" sensor than the S95 (1/1.7\").  Overall, the AF is fast (much faster than the S95 and G12), the body handles well with the front control ring and rear dial.  The rear OLED screen is so crisp and clear, but is pretty dim outdoors...the same problem that all OLED screens have.But there are big ergonomic issues that keep it from being a 5 star rating.  The biggest one is that the exposure compensation requires a press of the 4-way D-pad then moving the rear dial.  Not as convenient as just turning the rear like like the S95.  The lens cap is utterly useless and its bound to get lost within the first use.  Luckily, there is a solution, the LC-63A auto cap, which you have to pay an extra $20-$25 more for.  The biggest complaint is that you can only charge the battery while in the camera through the proprietary USB port.  It does come with a AC wall wart USB charger, but it outputs the same 500ma as any USB port on your computer.  Since the battery is only 925mAh, you'll need a spare if you take a lot of photos on vacation. I ended up buying a spare battery and an external charger so I could always have a spare charging/charged without having to swap in and out of the camera.Overall its a bit chunkier than the S95, but has a much more usable lens for low light.  There are some drawbacks, but it has a hotshoe (and works well for taming bright sunlight as it syncs flash at any shutterspeed, up to your slowest flash duration). Its a great camera in moderate light levels, but you'll need something with the new M4/3 16mp sensor if you want a compact camera with good ISO performance up to 3200.", "Date": "December 29, 2012"}, {"Title": "Nice camera", "Author": "Fei He", "ReviewID": "R12XTLSAP2ITKU", "Overall": "5.0", "Content": "I bought this for my parents. They really love it. The camera with compact body, large display and quite good lens is really value for the money.", "Date": "December 18, 2012"}, {"Title": "Great for pictures bad for video", "Author": "Burhan Sabini", "ReviewID": "R2BXW8OQ38F467", "Overall": "4.0", "Content": "Great camera except for video recording where the tracking focus is buggy.The Noise Reduction is too aggresive and cannot be adjusted", "Date": "December 7, 2012"}, {"Title": "Good camera for $199, but a shame it was a used one", "Author": "Zixian Chen", "ReviewID": "R2LKRTY3HSB67K", "Overall": "4.0", "Content": "I am perfectly happy with the camera. Bright lens and excellent macro mode makes it worth it, if even only for the latter feature.However, I was not too impressed with the fact that my package arrived non-brand new. Probably a refurbished set, as my set seemed second hand. Screen film looked like it was hastily put on, shutter count in the mid 100s, and just a sense that it wasn't brand new despite being advertised as such. But kudos to Amazon for rectifying the issue, although being overseas after discovering it made it too expensive to ship it back for a replacement.", "Date": "December 1, 2012"}, {"Title": "Did I get a lemon?", "Author": "ian_alexander", "ReviewID": "RUI0HJKD2N2G6", "Overall": "3.0", "Content": "I just got the camera today. Took some testing photos. The iAuto seems fine. but if I put the camera at P the AF does not seem to work: the camera just does not focus! Do I position the camera too close to the object? It's about 10'', but if I use TR (AF tracking) instead of AF, I can get a focused image at the same distance. I wonder if I did something wrong or if there is something wrong with the camera.", "Date": "November 14, 2012"}, {"Title": "[...]", "Author": "Roger W. Alswager \"Alswager\"", "ReviewID": "R12USIUVD4YGAX", "Overall": "3.0", "Content": "I this will register as a web site tor review:[...][...]Otherwise type flicker .com /groups/xz1/discuss/72157628111703878/and remove the spaces for a discussion on XZ-1 metering", "Date": "October 25, 2012"}, {"Title": "Great photos - terrible video :(", "Author": "Online Shopper", "ReviewID": "R2XOY5AH7IA7H1", "Overall": "3.0", "Content": "I've owned a ton of different cameras, big & small, and have been looking for a high quality + fast pocket shooter.  This one takes fantastic pictures and has a fast lens, but the videos are just AWFUL (almost like it's a bug/defect).  Very blurry and in and out of focus. My Canon 300HS takes much better videos.  Sticking with the Canon until I can find something that works well all around.  Still searching for the perfect camera!  If they'd fix the video, this one would be close.", "Date": "May 8, 2011"}, {"Title": "Bad covers great camera", "Author": "Joe", "ReviewID": "R38M2YJBOR1YPJ", "Overall": "4.0", "Content": "Love the xz-1.  Using p&s; for years this camera has allowed me to use manual modes to get affects like a dslr.  The pict quality is amazing and I hardly use the flash, first p&s; I can take low light picture with, in aperture priority mode.  I can get great DOF with this camera I can actually get blurred backgrounds.But I write to complain about the lens and shoe covers which don't snap on.  They fall off.  The lens cover can be attached to a string but it falls off in a back pack and the lens is unprotected. I already, 2 weeks lost the shoe cover as it too barely stays on.  The lens is about to get scratched I can feel it, it's already gotten real dirty.I wrote to Olympus who not reading my email gave me a stock response about all their services.I am too annoyed at this time to brag about how great the camera is, at 500 us, this usual olympus quality issue should not happen and they need to provide customer service.  If not I will ensure all reviews on the camera on the web bad.  How much as electronic comms ruined our lives already.Too bad they blew it with stupid little things.Joe", "Date": "May 27, 2011"}, {"Title": "Good outdoors poor indoors with a subject that is moving", "Author": "stadavid", "ReviewID": "R1OKHQV9CV90J5", "Overall": "2.0", "Content": "I bought this camera as a point and shoot pocketable little carry everywhere snapshooter. The problem is the higher ISO performance falls apart above 400 ISO. Thus if you want to use a shutter speed indoors such as  80 the camera can't handle pushing it's ISO higher to handle the speed without having very poor results. It is a small sensor camera after all. I am going to give the Sony RX-100 a try.The XZ-1 is a great little camera in good light however and even lower light if you subject is still.P.S. I have a Nikon system and have been into photography since 1976. The Nikon entrys into this segment are no better and in fact worse.", "Date": "December 9, 2012"}, {"Title": "Good camera, but don't buy this for size", "Author": "Jeffry Johnston", "ReviewID": "R24081QQI2HI2E", "Overall": "4.0", "Content": "To give an idea of my background and what I expect from a camera: I am very new to digital photography (well, outside my cellphone camera), so my review might be slightly naive, and there will be a lot of comparisons to my cell phone camera (Samsung Galaxy S). I mostly use cameras to take pictures of my kids and family (playing, events, visiting family etc), along with a few pictures of merchandise. It is rare for me to use a camera for things like nature photography, portraits, on a tripod, etc. I had a Nikon film SLR which was great, but film is hard to use now, and I wanted my photos in a digital form to share with my family, without spending all day scanning them (never bought a negative scanner). I chose the XZ-1 because I was looking for a small camera that approached an SLR in features and quality.I got this camera because I wanted something I could fit in the pocket of my blue jeans. The idea was that I could take it wherever I went, similar to a cell phone, but with much better quality. It turns out this camera will fit in a front pocket, albeit a little snugly. However, I quickly realized that I needed to attach the camera strap after the camera slipped and I dropped it (fortunately I made a miraculous mid-drop catch). There is just not a good enough grip on this camera. With the strap, it was no longer pocketable, and I had to get a fanny pack for it. It's still a small-end fanny pack, but it means I just don't end up taking this with me everywhere, which is disappointing. If I knew I was going to end up carrying it in a pack, I would have gone larger.One of the things my cell phone camera fails badly at is low light (indoors photography). This camera is definitely a step up, but compromises have to be made, at least if you don't want to (or can't) use the flash (I don't). At first I used the higher ISO levels, but those make the images grainy and that looks bad to me (ISO 200 might be okay, but anything above that is useless). I stick to ISO 100 now. When I am indoors I check the shutter speed on \"P\" mode. If it is below 1/15\" I switch to shutter priority mode, and force 1/15\" or 1/20\" (ISO 100). For typical shots of people this is enough to minimize the blur. I suspect part of the reason this speed works is because any slower and the anti-shake is less effective. My hands aren't shaking like caffeine, but I'm no pro either. Not being able to steady the camera against my face makes things harder to keep still. If people move at this speed, they can still blur.Of course, setting the speed like that will make the images come out dark, so using white balance on Google+ or GIMP is needed to brighten up the image. Since I use ISO 100, post-processing seems to work. One other thing I discovered for low light shooting is not to zoom in if I can help it. When the camera is zoomed, the camera doesn't allow f/1.8 (zooming one step drops it to f/1.9, and it's f/2.5 fully zoomed) it'll drop to 2.0, 2.2 or even 2.4), so that means less light is being gathered. What I do instead is try to get closer and then crop the image (basically a form of digital zoom).At first, I was shooting RAW + JPG, but I found that unless I wanted to spent all day tweaking pics, the JPG output was pretty much always good enough, and in many cases, I couldn't even match it, so I switched to JPG exclusively (L-F mode).When trying to take a bunch of pics quickly, the automatic image review becomes annoying long. However, I found a trick: if the shutter button is pressed halfway (for focus) it seems to come out of review mode immediately.The lens cap is clumsy, I'm thinking about getting the automatic cap. Oftentimes I need to take a shot in a hurry and I forget to remove it. Fortunately, the camera seems to be able to push off the cap without a problem. I have no idea if doing that is bad for the camera. Sometimes the lens cap comes off when I didn't intend it to, but not too often.It is extremely easy to switch shooting modes without realizing it; I wish the dial had more friction to it. When the camera is first turned on (or modes changed, etc) it tells the shooting mode on the screen, but after 10 seconds, that all turns off, and there is no indication anymore, so I changed the setting so it displays the info all the time.Another thing my cell phone camera couldn't handle was macro photography (there was a macro setting, but it just didn't work). This camera has two macro modes. In order to focus closer than a few feet or so, macro mode is required. Then, there is a super macro for shooting within inches (no zoom in that mode). Super macro is the mode I end up using most of the time, but I haven't figured out how to get a good depth of field yet, so part of the object will look great and the rest blurry. I've had to discipline myself to always remove macro mode immediately when I am done with it, because it's a pain to change the setting and might cause me to miss a shot while fooling around with it.When I had a film SLR, the lens could be grabbed and turned to zoom, and another ring for focusing. This camera uses a ring around the shutter button. There is also a ring around the lens, but it is not used for zoom (used for setting shutter speed or ISO (just weird), depending on the mode). In my opinion, the two should have been swapped. Maybe they did it that way for one handed shooting? But this camera doesn't have a good enough grip for that. Or maybe it's just the norm these days and I'm out of date.Some of the button presses required to access common features I felt were a bit cumbersome. For example, to change the autofocus mode, 3 different buttons have to be pushed. Yet, exposure setting, which I never use, is a single button (it changes my exposure length, which I don't like). Setting the timer requires three presses, plus the shutter. A button is dedicated to video recording, but that probably would have made more sense on the dial. Other buttons could have been more useful there, for example more settings for manual mode, or manual focus. I suppose they were trying to de-clutter, but the choices seem geared toward someone who likes to tweak settings. But IMO, if a person has enough time to set all that stuff, they can push a few more buttons to do it. I'd rather have quickest access to the essential stuff.I wish the autofocus sound could be disabled. I stuck a piece of black tape over the holes on the bottom of the camera, but it only helps slightly.The full manual is only available as a PDF, which is disappointing, but that's the norm these days.Video recording works well (much better than my cellphone could pull off, especially due to zoom), but it's limited to around 3 minutes in 720p (due to the 2GB FAT32 limit), so don't expect to use it like a camcorder. It is unfortunate that they did not allow it span files, then they could be spliced together on the computer. The video codec is substandard, so that's why 3 minutes takes up 2 GB. This length limit basically ruins the video feature for me, but I still use it for short clips, like when my kids are playing.This isn't really related to the camera itself, but one area where my cellphone won, was that it would auto-upload my photos to Google+. That was extremely convenient, because often I just plugged it in overnight and had it upload.. then when I had time I could batch them to share. I wrote myself a Linux shell script that handles copying the photos to my hard drive, uploading now (by way of an Android virtual machine), and then deleting from the camera. It's not as convenient, but still that problem is mostly solved.I feel like I've done a lot of criticizing, but overall this camera is definitely better than my cellphone, at least when I have it with me, I just think *I* made a bad buying decision. So that's why I rate this 4 stars instead of 3. Obviously it's best in daylight, but my cellphone was fine then too. It's a win indoors, where I can actually take photos that aren't just a big blur. The anti-shake helps me. And, it's nice to be able to have a bit of optical zoom when outdoors, when I can't get closer. Still, I can't help but wonder if I wouldn't have been better off with a full DSLR with larger lenses, where I could do better in low light, have a more familiar interface for zooming, and have a viewfinder (well, one that isn't an expensive add-on).", "Date": "April 22, 2013"}, {"Title": "Buy something else if you are okay with being a classless chump.", "Author": "F. Jones", "ReviewID": "R14D7GZZBO0BB9", "Overall": "5.0", "Content": "Listen, pictures are a big deal.  You don't want to go back in your collection of memories and realize that you took a lot of important pictures with a crap camera.  This is like my mini e-30, I've never had a point and shot that gave me all (okay....most of) the great features of my slr in a compact package. The panorama function is pretty cool, the art filters are good as well. But my favorite toy feature art filter is diorama, buy the camera and try it out from your hotel and building. Bad points are the lens cap and the grip.  Picture quality is great go to flickr and search for xz-1 and research for yourself.", "Date": "April 10, 2011"}, {"Title": "Not quite what I was looking for.", "Author": "Greg", "ReviewID": "R31GF0L7YFJH3E", "Overall": "3.0", "Content": "Need to deal with lens cap or buy the auto lens cap which increases the depth and makes it not pocketable.  I was looking for something good in low light but compact.  It's low light mode is better than the Auto, but at times colors felt exaggerated to me.  I did some video capture at low light and it drifted in and out of focus which seemed odd.  I ultimately went with the Sony RX100.", "Date": "December 25, 2012"}, {"Title": "amazing", "Author": "marcoascencio", "ReviewID": "R4P0HHYONJYH6", "Overall": "5.0", "Content": "Incredible, small, easy to use.Photo quality is very good, both in raw and in jpg format.There is a camera for video, even when they are in HD, but is meant for photography.Lens Ring assistance using.", "Date": "November 5, 2012"}, {"Title": "Not User Friendly", "Author": "Bob P \"Bob\"", "ReviewID": "R3HZ54TYFXT5U6", "Overall": "2.0", "Content": "Not satisfied with this camera. Neither the computer software to upload pictures or without an eyesight it's pure guess work taking outdoor pictures.Wanted a quality point & shoot, got something that's neither good for low end pictures or high end snaps.", "Date": "March 18, 2013"}, {"Title": "Quirky camera...", "Author": "Gladius", "ReviewID": "R24UQ2DK3P1YJ8", "Overall": "3.0", "Content": "Nabbed it for $199 on amazon when it's successor came out.  Opened and cap flew off --- bad start.Is well built.  Quick lens (1.8 - 2 5).  Biggish sensor for compact (G12-sized or so).  So far, disappointed.  Tried Auto indoors (had hurricane  :-)  )  and pics seemed dark and not always sharp.  One issue seems to be tendancy to low ISO (200 or so) in darkish, ill lit rooms when using Auto.G12 pics look better so far --- Auto and otherwise.  P300 pics at wide (1.8) without flash look better --- so easy to use and similarly a \"non-flash\" camera for me (usually P300 wide open indoors and G12 outdoors).  (Using flash on XZ-1 results in even darker pics --- not a strong flash either.)  Will try on higher ISO for indoor use (although afraid of noise).  (There are reports written on setting changes to get good pics --- ergo quirky camera taking time to master.)  Using Program or Manual or Shutter (I like rapid shutter as no viewfinder and only moderately steady hands) probably the ticket for those who like it.  (Unfortunately, ISO is to be changed on screen, not with a dial such as on the G12.)Outdoor pics surprised me by looking good with excellent IQ and color.  Why surprised?  Well, viewed as indoor camera with that lens.  Moreover, AMOLED LCD cannot be seen in winter sun.  Real bad.  Does not tilt.  Will not pay for bulky, expensive viewfinder.  Maybe I can increase the LCD brightness sufficiently but I doubt it --- all I see is me in the LCD outdoors!  Point & hope !!!Suspect OK (or better) for indoor use with much use and setting changes.  Maybe more of a pro's compact.  (I'm advanced amateur probably.)  (The G12 suits me much better despite slower lens ---  pics, especially outdoors, are great.)  I use the viewfinder (not a great one but better than none) plus the articulating LCD is better for me if I want to use that).Prepare to play with it and change many settings --- hopefully doable on hard to see screen when outdoors.Forget video.  It is poor.  No excuse.Once again, probably a good camera is you're willing to study it and try many combinations of settings (from pics I've seen by others.)  Still, one probably needs that VR-2 viewfinder for an arm and a leg for a high % of keepers.  Suspect camera is not for me.  I'd rather learn the \"ins and outs\" of a DSLR when I want good pics (or the G12 which I'm still \"practicing with\" --- but with good results!)Of course, I would love an RX100 if cheaper and take the time to learn to use that with its 1 inch sensor.  :-)", "Date": "November 19, 2012"}, {"Title": "Focus ability killed the rockstar Olympus XZ-1 vs Canon S95", "Author": "Elizabeth A. Mink \"Isabel\"", "ReviewID": "R1DFQCUOYP3OJ2", "Overall": "3.0", "Content": "After using the XZ-1 for 1-1/2 weeks I brought it back.. Too many bad focus pics!!I'm suprised about the rave reviews with very little mention of this.The camera looks beautiful, has all the specs and potential, but sadly.Once I tried the Canon S95 it was immediate in better focus and clarity of the pics.I'm suprised that noone has indicated the differences in actually using the camera.", "Date": "March 14, 2011"}, {"Title": "Not happy with camera, returning it today.", "Author": "Mike McK", "ReviewID": "R2WSM2MTVCEUMD", "Overall": "2.0", "Content": "I purchased this camera from Amazon at a very good price. I used it yesterday for the first time for about three hours. The pictures are very good for a point and shoot. I was very happy with the picture quality.The video quality is HORRENDOUS! I get better video quality out of an old Canon G7 that shoots 640x480 video vs. the Olympus XZ-1. If you plan on using your camera to take video in addition to pictures DO NOT PURCHASE IT. I repeat, the video quality is horrible! After doing some research on the constant auto focus that happens while shooting video I discovered it is a wide spread problem and there is no fix available.Going back to purchasing a Canon in the G series. I will be ordering the G15 from Amazon later this week. It's going to cost me more but at least I know the video quality will be on par with the image quality.", "Date": "November 12, 2012"}, {"Title": "Olympus XZ-1", "Author": "Geo. G.", "ReviewID": "RC2ATIAO1F6TM", "Overall": "3.0", "Content": "An OK camera but too small for my big hands.  Seems the picture quality was inconsistent. Some were great but many came out on the blurry side.  Probably operator error! I returned it.", "Date": "June 13, 2013"}, {"Title": "We sent it back", "Author": "Robyn Simpson", "ReviewID": "R2V7VHEURKAC0U", "Overall": "2.0", "Content": "I love the look of this camera but I hadnt done my homework and the zoom wasnt enough for what I wanted. Also it displays alot of lines when taking a picture in artifical light and although these dont appear on the picture it isnt a great way to take a great picture. Apparrently this is comman with cameras that have new technologies so it isnt Olympus that is at fault but I dont like it.We continue to look for a camera that has all the features we want for the right price!", "Date": "December 1, 2012"}, {"Title": "Sadly, I returned this camera", "Author": "Roger", "ReviewID": "R3A22TFD1H2SYQ", "Overall": "2.0", "Content": "Let me preface this by saying I'm a hobbyist photographer and know my way around cameras.  Normally all my shots are taken with a high-end DSLR camera, but there are times I want to have the convenience of a small PnS in my pocket for those quick family shots or a funny pet picture.  I opted for the Olympus XZ1 Digital mainly because of the f/1.8 lens, meaning it would be good for indoor shots w/out a flash (I hate flash on a PnS because it points right at the subject, versus a DSLR shoe-mount flash that can be pointed to bounce of the ceiling or wall or whatever).  Anyhow, I got this camera and quickly started taking test shots.  Indoor, low light was good...I was pleasantly surprised, however, outdoor doors were a HUGE disappointment.  Color was too dark and shady areas were just pure black.  I took several photos of my bushes and trees in the yard as test shots on a nice sunny day and that was enough for me...I knew then and there the camera was going back for a refund.  My old Canon Powershot SD780 IS PnS takes MUCH better pictures, and that camera was half the price (but it doesn't take good low-light shots).  I guess I'll just stick to my DSLR with my fixie f/1.4 lens to insure I get the good shots.Sadly, I can't recommend this camera.", "Date": "September 25, 2012"}, {"Title": "Olympus XZ-1 smearing", "Author": "Amazon Customer", "ReviewID": "RMXBJ8TBL3NHN", "Overall": "3.0", "Content": "Bought and returned after a few days. Noticed random smearing of details even in brightly lit pictures when zooming the picture. Purchased to replace my sub-compact Sony DSC-W300 which I purchased before I new about the importance of sensor sizes. Found out that the sub-compact Sony actually has a 1/1.7 size sensor which is very close in size to the Olympus with its 1/1.63 sensor. In most situations the Sony clearly outperformed the Olympus. With its brighter lens the Olympus took better night shots without flash. Too bad. I really wanted to like this camera. Thought it would be a good compromise for most situations to avoid carrying around my Panasonic GH1K 4 3 camera. Obviously the Panasonic takes better pics due to its larger sensor but I thought the Olympus could be a good compromise. I should point out that I only took pics in JPEG mode. I assume that the smearing issue may not exist in RAW mode.", "Date": "June 29, 2011"}, {"Title": "Some good and some bad", "Author": "M. Ray", "ReviewID": "R2LJ6CGIBUOH6I", "Overall": "3.0", "Content": "Lots of potential, lots of great features and a great lens but....I have had this camera for about 3 months. I wanted it for a Wedding, Big Family thanksgiving and Christmas. So far I have been disappointed and have been using my old Cannon SD790IS again. The problem is almost always focus. I would say 20%-30% of the indoor photos I take have focus trouble. I tried to take a photo of our Christmas tree with only the tree lights (big tree with 8-100 light strings). The camera could not focus using iAuto or other modes. I had to Manually focus to get a clear shot...the cannon took a clear (but noisy with a cheaper lens) focused picture the first shot. I submitted some photos to a web page to have some pros look at them and the conclusion is to return the camera to Olympus and get it fixed.(yes I tried 'single point' focus and 100 other settings)Also:Video hunts continually for focus. I knew this would happen to some extent from reviews however I can not use video at all.I have started the return process and will update after Olympus looks at it and responds. At this point I just hope I got a 'defective' one that can be fixed or exchanged for a good working one.", "Date": "January 8, 2013"}, {"Title": "good and cheap", "Author": "Jing", "ReviewID": "R1COPT6BB2XUKM", "Overall": "5.0", "Content": "Good for low light condition.  We buy this to take pictures for my daughter.  Really good product with cheap price.", "Date": "November 12, 2012"}, {"Title": "Disappointing", "Author": "cscstudent", "ReviewID": "R2JKPX8AGX3MUI", "Overall": "2.0", "Content": "Popup flash broke after only a few days use.Noisy images starting at ISO 400.Autofocus doesn't work well in video mode, lousy video quality overall.Often got poor results, perhaps not focusing correctly. I didn't have time to work it out.", "Date": "September 7, 2012"}, {"Title": "Nice camera,but with 300 Shutter number", "Author": "Rice", "ReviewID": "R2U8OU6454QYTV", "Overall": "4.0", "Content": "This is my first camera, and it's really a great deal, but with 296 Shutter number. I don't know whether it's normal for a new camera.", "Date": "November 14, 2012"}, {"Title": "better lens and sensor then regular point-and-shoot??", "Author": "arecht", "ReviewID": "ROLDW7SUQQRM9", "Overall": "2.0", "Content": "I'm an amateur photographer that would like to get more knowledgeable about digital photography. I was looking for a small, easy portable camera that would give me the option to take snap shots but also grow as a photographer. I was tempted by the apparently great lens and larger sensor of the XZ-1 compared to regular point-and-shoot cameras. The price went way down lately and I wanted to give this camera a try.The camera seems nicely built and is professional looking. I compared the pics of this camera to 2 point and shoot cameras, the Canon SX260 and the Panasonic XZ20. Most pics were done outside. I was not impressed by the Olympus. The colors (using auto mode) seemed over-saturated and unnatural compared to the other 2 cameras. Surprisingly the \"better\" lens and larger sensor did not provide more detail when cropping pictures and zooming in on an object of interest.The video capability is way more limited then with the other two cameras.More professional photographers might be able to get around the color saturation issue. The better lens might still be helpful in low light situations. But the other two cameras seemed way more useful for somebody like me, looking for mostly travel and nature photography.", "Date": "November 5, 2012"}, {"Title": "Lemon", "Author": "A. Cuneyt Tas \"A. Cuneyt Tas\"", "ReviewID": "R29A5JS3T22FAS", "Overall": "2.0", "Content": "Purchased this camera from Amazon when they were liquidating their stocks with a price tag of $199.90.It arrived nicely, it looked nice from the outside.However, either the lens or the sensor+electronics (or perhaps both) of this camera is seriously flawed;this camera cannot take any sharp photos. It can now only be a nice x-mas gift item for a grade-school kid or a senior citizen. Therefore, I summarize my review with one word: \"lemon.\" Olympus was surely able to make better cameras at the times of 35 mm film.", "Date": "November 24, 2012"}, {"Title": "Auto ISO doesn't work", "Author": "Sergey Kiselev \"skiselev\"", "ReviewID": "ROG7IM3HYJT10", "Overall": "3.0", "Content": "The auto ISO setting doesn't work. It seems to be stuck on ISO 200 even in the darkest conditions. The camera will decrease shutter speed to as low as 1/10 (some observed even 1/2), and as the result pictures will be blurry. Clearly a firmware bug...Now for the \"smart\" guys:Yes I know I can use shutter priority mode and set shutter speed to 1/60 or less, or any other mode that allows setting ISO and set higher ISO. BUT if I would play with settings I would rather do that on my DSLR camera. The entire idea of point and shoot camera is, well... point and shoot.I am still discussing this issue with Olympus tech support and I will update this review if anything changes with this issue.Update:Auto ISO issue is not resolved yet, and it seems that Olympus has no plans to resolve it.", "Date": "July 20, 2011"}, {"Title": "Terrible jpeg processing, slow focusing", "Author": "Digitalcat66", "ReviewID": "R3VQRIJOAHAGGY", "Overall": "2.0", "Content": "Being one of the first to purchase this model I had high expectations for this camera based on reviews and specs. Boy was I disappointed!Pros: great battery lifeFast startup and write time to cardSuper Amoled viewer is top notch and real time focusing.Great flash unitNice construction with aluminum and good quality materials.Cons: onboard photo processing too aggressive, with JPEG pixels merged and overprocessed leaving image too soft and loosing crisp details.Controls on back are too small and flat... requires two or more menus to change settings like macros and self timer. Lens barrel control is redundant and confusing.Video function is worthless, videos are jerky and overprocessed leaving whole frames blurred as focus changes.Macro shots have pin point focus and huge depth of field on barreled out of focus with narrow objects like a flower or small animal.1.8 is worthless with this lens! All that great glass and the camera cannot handle its own capabilities.Camera does not come with a memory card! You would think for $425.00 they could sell it ready to use out of the box.Overall this little super pocket shooter does not live up to the reputation of Olympus's history of great lenses and conservative picture processing. You literally have to leave this in full auto mode to take mediocre shots. Any combination of manual modes or program mode finds you taking multiple shots tweaking the settings to get a focused shot as you intended.The worst thing is the onboard processing smudging up the details of every picture!Wish I could sell this for $400 and get the Nikon or Fuji.", "Date": "November 27, 2011"}, {"Title": "Excellent portable shooter with serious and basic flaw", "Author": "Sanjiv Gupta", "ReviewID": "R3APVHJRQ13F0J", "Overall": "3.0", "Content": "Camera performs well for target use, namely as a portable yet powerful, adjustable tool for taking pictures that can rival SLRs'. The handling quirks mentioned in some reviews become much less of an issue with practice, even the lack of a dedicated ISO button. However there's a rather serious problem affecting its real world usefulness as an easy to carry camera: You can't install the customary UV filter (or any other) to protect this lens, which is after all the main reason to get this camera and likely the component most expensive to repair or replace. When contacted, Olympus says the \"the lens is proprietary and does not accept standard filters.\" But this is hardly an explanation--why be \"proprietary\" about allowing the user to protect your own product, and if you must be, why not offer a filter yourself? This problem is all the more serious because the camera also lacks the customary built in flaps that cover the lens when you turn it off. This lack of protection seriously compromises the camera precisely in its intended function as an easy to carry and therefore frequently used tool; the more often you use it, the more likely you are to unwittingly damage that lovely lens and rue your investment.", "Date": "June 30, 2011"}, {"Title": "Best of class, video recording time could be better", "Author": "ErikW", "ReviewID": "R2J0ICR62AFG0C", "Overall": "4.0", "Content": "I have a decent DSLR from Pentax and have been looking to replace my compact camera (Canon A620) that I can have with me at all times. It needs to produce very good image quality, but since the DSLR doesn't do video, it needs to excel at that.I heard from others about the Canon S95 and the Panasonic Lumix DMC-LX5, and research led me also to the Nikon P7000. One thing they all have in common is max HD video of 720p. While this is good enough with my present tv, my new tv will be 1080p. I don't want to buy another camera for at least 4-5 years.So I am glad to have heard about this model from Olympus, because in addition to the relatively large sensor and fast lens, it does 1080p HD videos. But for whatever reasons Olympus choose to use the avi format which limits you to 2GB (7 minutes).I could live with this, and do like the external mic option. But,  I'm glad there is another option I just found out on the Olympus website. In April they are coming out with a $399(street) SZ-30MR compact that does 1080p mp4.In addition, I'm being swayed by its DUAL TruePic(tm) III+ technology. No other compact camera captures HD movies and 16MP still images at the same time! Also they say you can shoot simultaneous wide-angle and telephoto movies, and full 1080p HD video and VGA movie files. RADICAL!It also has other latest technology like SMART PANORAMA, 3D stills, continuous auto tracking with brightness correction- even pet face detection. I would have to trade-off the larger sensor in the XZ-1, but do gain a larger zoom- 25-600 (F3-6.9).", "Date": "March 13, 2011"}, {"Title": "Literally Ruined my Honeymoon", "Author": "Christie", "ReviewID": "R21TR8PKQYVH1F", "Overall": "1.0", "Content": "I bought this specifically because I had an Olympus before, the lens in this point and shoot couldn't have had better specs, and the item itself had great reviews... too bad it STOPPED WORKING PROPERLY about FIFTY pictures in on my honeymoon... in St. John... where (get this) AMAZON can't overnight a replacement nor could I order a different camera because of \"where we were\". Long story short, I ultimately missed out on quite a few photo ops and the better half a day trying to get a replacement or another camera from Amazon, and when that wouldn't work we spent another part of the morning calling Olympus tech support to see if we could fix the issue; which by the way was a complete JOKE. Considering they wanted me to hook it up to my computer and send them files to see what i was seeing and to tell me essentially that i would have to send it in to be fixed regardless... because after resetting all the settings on the camera it shouldn't have been taking photos where the white was showing up FUSCHIA... so anything in the photo that was white or light colored (like clouds, white t-shirts, teeth, etc.) was showing up HOT PINK.a ONCE IN A LIFETIME trip (you can't get a do-over on your HONEYMOON... it's not like it's just some vacation) and it was ruined thanks to this camera, and even more frustrating, no compensation for the inconvenience, or issues or frustration etc. from Amazon or Olympus. And of course I sent this back the minute we got home. I would NEVER buy another. NOT impressed. AT ALL.", "Date": "January 2, 2013"}, {"Title": "Quick price drop, Seems opened item, Too sensitive,", "Author": "sunny", "ReviewID": "R18BZ0JHICSDN3", "Overall": "4.0", "Content": "After a lot of research, I bought this camera.Cons.1. Flash is on the left side, difficult to hold the camera2. Controls are too sensitive, changes quickly w/o knowing3. I tried about 500 pics, I am not quite happy4. Colors doesn't seem to be natural5. $60 Price drop in 2 weeks6. Menu/options are difficult. Sometimes I do see some options and sometimes not, No idea how to get them back. Too much to remember to manipulate options7. Last and important, I don't see real difference/advantage of f1.8 in the pictures which I have taken8. Lens cap.. it is painful to hold/handle", "Date": "July 8, 2011"}, {"Title": "Poor camera", "Author": "Thomas M Fink", "ReviewID": "R1YD0A3Z9ABWY7", "Overall": "2.0", "Content": "I purchased this as a supplement for my Olympus EP-2, I was expecting the same high quality image as the EP-2, what a disappointment. The image was smeared and color didn't match Olympus legendary color and image. Not worth the high price.", "Date": "April 16, 2011"}, {"Title": "may be great", "Author": "J. Gonzalez", "ReviewID": "RQAARH7DSSNTP", "Overall": "1.0", "Content": "I have been an Olympus admirer for years, and reading comment on this model I decided erroneously to order it used like new from butterfly store trough amazon, what a big mishap , camera does not work at all, only turns on and off, bad seller, should check items before offering them on amazon", "Date": "September 22, 2012"}, {"Title": "Fantastic camera", "Author": "mgauss \"mgauss\"", "ReviewID": "RR1NXW4A1I5J8", "Overall": "5.0", "Content": "Feels like quality in one's hands.  Great dual dial action.  Great Oly jpeg colours.  This is the new winner for flash free photography.  Crisp screen!  Love it.", "Date": "January 7, 2011"}, {"Title": "The best of both worlds!!!", "Author": "A. Moroschan \"lasvegasindian\"", "ReviewID": "R1WU4U95MFUHW8", "Overall": "5.0", "Content": "With the festures and great name behind this new Olympus XZ-1, this is sure to be a great compact camera for both the beginner and the professional wanting all the features of a DSLR with the convience of a compact camera at their sides.  With features combining the best of both the Canon s95 and the Lumix DMC-L95, photographers will have the best of both world's.  Although the price is a little on the expensive side, one has to remember you get what you pay for.  This camera is sure to prove itself as a true winner among the continuing contest and every growing world of compact camera out there on the market today.", "Date": "January 14, 2011"}], "ProductInfo": {"Price": "$399.99", "Features": "spec sheet on CD to follow\nspec sheet on CD to follow", "Name": "Olympus XZ-1 10 MP Digital Camera with f1.8 Lens and 3-Inch OLED Monitor (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/417cFvpRNqL._SX300_.jpg", "ProductID": "B004G8QSTO"}}