{"Reviews": [{"Title": "Fabulous camera.", "Author": "Les's top 20", "ReviewID": "R1P8IJAVRK405D", "Overall": "5.0", "Content": "Love this camera. It is very light and feels good in the hand.Results are really very good and on a par with far more expensive and heavier cameras. I love the electronic viewfinder. I in fact have the GF2 as well. I keep my fixed lens on the GF2 and my zooms on the G2. Perfect for every occasion.", "Date": "April 28, 2011"}, {"Title": "Great versatile camera", "Author": "Rick \"lensman\"", "ReviewID": "R37Q8D2SSPNOJS", "Overall": "4.0", "Content": "I use the G2 for general still photography and almost never for video. I also own the G1 and GF1.The G2 addresses the major ergonomic problem I have with the G1 -- the placement of the horizontal dial on the front of the camera, near the shutter. During my natural hold of the camera, I apply pressure in that area. On the G1 I am constantly clicking or moving that dial when I don't want to be, resulting in the change of settings when it's not intended. It is a major headache. The G2 moves it onto the back on the camera, and to me it's worth the price of the G2 for that reason alone.The addition of the touch control screen is nice and well implemented. It's great that Panasonic doesn't force you to use the touch, as all original button and dial motions remain.I notice the LCD is much less reflective than the one on the G1 or GF1. Of all my cameras, the G2 is most visible in daylight.On the down side, the SD card slot moved from the side on the G1 to the bottom of the G2, in the battery compartment. I often shoot from a tripod, and in order to change the SD card I have to dismount the camera from the tripod head.I see little if any IQ difference between G1 and G2 images, despite the G2 having the Venus Engine HD II. ISO noise remains a Panasonic G family weakness. AF performance in low light is also a problem, still.A great little camera, and I recommend it.", "Date": "April 17, 2011"}, {"Title": "I really like this camera", "Author": "Michael J. Edelman", "ReviewID": "R2FTT7U6D6RJIB", "Overall": "5.0", "Content": "This is the third micro four-thirds camera I've purchased since switching over from Nikon DX-sensor DSLRs, and I think it's the best I've used yet. Both of my previous camera (A Lumix DMC-GF1 and an Olympus E-PL1) were finderless, like most modern point-and-shoots. All composition was done through the back panel display. That's fine for indoor use and outdoors in the shade, but impossible in sunlight- everything gets washed out. After missing some great wildlife shots I thought about adding an electronic viewfinder to the GF1, but after reading reviews, this seemed like a better choice- higher resolution, and more flexibility.The electronic viewfinder in this camera isn't quite as sharp as an optical viewfinder, of course, but it's more than adequate for manual focusing, and has just about all the information you need that you'd normally find on the rear screen. It's bright enough to shoot in direct sunlight, and has a diopter adjustment with plenty of range.The rear display screen can pivot out, which can be useful in setting up some difficult shots, or reversed for protection. It's also a touch screen, which makes some functions that have to be accessed in menus on other Lumix camera immediately accessible- a nice touch. The power switch is located where I'm used to finding it on film and digital Nikons, which is another helpful bit of ergonomics. The body is covered with a soft non-slip coating that makes it easier to hold and cuts reflection, too. And it uses the same battery as my GF1, which simplifies things.The G2 is now almost three years old, but it's still delivers all the resolution needed for most uses. (GIven that a friend used to shoot for magazines with a 1.3Mpixel Nikon D1, it's more than sufficient!). For those of us who don't shoot for a living, buying a slightly older camera like the G2 means we can buy a complete camera outfit with a flash and a couple of extra lenses for the cost of one new state-of-the-art micro four-thirds body. Not a bad tradeoff at all.", "Date": "November 30, 2012"}], "ProductInfo": {"Price": "$599.99", "Features": "No matter which way you shoot, you see before you shoot how adjusting the exposure compensation,\nWhite balance, aperture and even the shutter speed will affect the image\nDouble Live View Full-time Live View works with both the LCD and the Live View Finder\nYou see before you shoot how adjusting the exposure compensation, white balance, aperture and even the shutter speed will affect the image\nThis means that, no matter which way you shoot, you see before you shoot how adjusting the exposure compensation, white balance, aperture\nAnd even the shutter speed will affect the image", "Name": "Panasonic LUMIX DMCG2K 12.1MP Digital Camera (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/31No5AzXpVL.jpg", "ProductID": "B004ACBYIQ"}}