{"Reviews": [{"Title": "Nice & very easy to use inexpensive all-in-one security system", "Author": "J. C. Miller \"John\"", "ReviewID": "RVCBVUU4LVF2C", "Overall": "5.0", "Content": "I purchased this unit on Amazon in the beginning of Oct 2010.  I ordered it on a Monday and had it the next day (didn't even pay for 1 day shipping).  We've been having a lot of problems with teenage punks in the neighborhood breaking into cars, kicking doors, stealing lawn ornaments and they destroyed some of my property.  I liked that this was a security monitor with a built in 1 TB security system DVR.  Set up was super easy.  Just plug in the power and it starts right up.  No programing or installation of programs required.  I just had to set the date and time.  I believe this is a Chinese built system with an office in the US.  The manual is a lot better written than most of the Chinese made items I've purchased through the years.  I have 4 different Q-See cameras hooked up, also a Zmodo camera and a Swann camera to this unit.  All six work without problems on this machine.  You can view one camera at a time or four or all eight, or set the system to rotate through the cameras.  It comes with a mouse and it is easy to use it to point and click on the monitor.  The included remote control also functions well, but it is much easier to use the mouse to navigate through the menus.  You can easily adjust camera settings (brightness/contrast/Hue/Saturation) from the monitor.  You can also program the cameras and system to only record when motion is detected.  I don't have any audio on the cameras so I can't tell you about sound quality.  The playback search of recorded video took a little getting used to, but it is very easy once you get the hang of it.  It only fast forwards/reverses in 16x speed, so a one hour recorded block can take several minutes to get through so it would take you a while to go through several cameras worth of recordings.  You can backup video you want to save on a USB thumb drive.  The format is .264 so you have to convert it to .avi (or some other format) to view it on a regular computer or burn it to a CD/DVD.  The system comes with a CD that has a converter program.  It is easy and quick and does a good job converting the video to .avi format.  I'm trying to find a program that I can edit (cut) .avi video, but for some reason they don't recognize the converted .avi video from the included program.  If you are looking for an all-in-one security DVR system for a decent price ($505 in 10/10, which was the cheapest I could find it).  I'd give this a shot.  I have not played with the remote internet viewing or mobile phone viewing yet, but will at a later date.  I probably should have gone for the system that included 8 cameras for an extra $225, but I wanted better 6mm cameras with more infrared LEDs than the ones (3.6mm) included in the complete package.  Again overall a nice system that is very easy to set up and use.**UPDATE 6/26/13.  I never got the remote internet view working.  I had local control on my home network working for about a day, but could never connect over the internet.  This has been on non-stop since installed in Oct 2010, so over 2 and 1/2 years later it is still working great.  I've been able to catch many a wayward teen up to no good in my neighborhood (led to several arrests).  I've had 8 cameras hooked up at any given point.  I stick by my original 5 star rating.  Not getting the internet remote control working isn't that big of a deal to me.", "Date": "October 25, 2010"}, {"Title": "Hard to review without power adapter...", "Author": "zschwa", "ReviewID": "R3LUPAAAAKFIX2", "Overall": "3.0", "Content": "Product arrived without a power adapter.  Only option available was to return entire package and have them ship a new one.  Ordered the adapter elsewhere to avoid the hassle.  Not really much of a review, just a forum to vent.", "Date": "October 4, 2012"}], "ProductInfo": {"Price": "$579.00", "Features": null, "Name": "Zmodo DVR-H9008UL-1TB 19-Inch Monitor with Built-In 8-Channel Pentaplex Real Time Network DVR with 1TB Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/51sprlL2h2L._SY300_.jpg", "ProductID": "B004071UQC"}}