{"Reviews": [{"Title": "Cool Concept, Poor Functionality", "Author": "JDR", "ReviewID": "R2GQT6IG1XMPYX", "Overall": "2.0", "Content": "The camera is a simple no frills photo-snapper. The built-in slide-out USB is great. No need to carry around a USB cord to upload your photos. The internal 2GB memory is also nice. The problems lie in the quality of the product. For one, it has trouble registering when you turn it to switch between photo landscape view and portrait view. That is just a minor nuisance and not a deal-breaker. It's real pitfall is it's lack of durability. A camera will be dropped just as a remote control or laptop will. A camera's design must incorporate proper protection against a few drops over it's lifetime. This camera was dropped once. This resulted in a visually distorted LCD screen. This should not deter you from purchasing the item. It is just an acknowledgement of how the camera lacks a certain quality or value that might keep it around for a few years.", "Date": "April 18, 2011"}, {"Title": "Don't buy this at any price", "Author": "lovelynymph", "ReviewID": "R3JQEBDEVGRN8K", "Overall": "2.0", "Content": "This camera has about three good characteristics and the rest is a jumble of design flaws. Firstly, the flash has to be shut off. It's always on unless you shut it off, the opposite of every other camera ever made. Just an annoying task to deal with all the time. Nearly every single picture is blurred (with or without the flash) because the camera takes forever to process an image. So, this is about the worst camera anyone could buy for the purpose of taking pictures of anything while in motion. How on earth they could have sold this at any point for anywhere near $200 is thievery.", "Date": "December 28, 2011"}, {"Title": "Great camera!", "Author": "wonton", "ReviewID": "R39X883C7YJAR0", "Overall": "5.0", "Content": "This camera is as easy as 1-2-3. It's so simple to use and it takes really nice pictures. I've had other digital cameras in the past that can be so complicated to figure out that you practically need to take a course in how to use all the functions. Furthermore, I don't have the patience to read manuals. This camera is perfect for someone who wants simplicity without sacrificing quality. It even has a recording button for short video clips. No need to mess with batteries or memory cards either. Just charge and go, point and shoot, keep or delete, and load to your computer with or without wires (it has a convenient slide-out USB plug). I got mine in the snazzy metallic red and bought my Mom one too. She's techno-phobic like me and needs to have a no-fuss camera to bring her into the 21st century (she still uses an old, dated film camera that while easy to use,, takes low quality pix). The GE Create camera is so easy, a caveman could use it and look great in the photos too! :)", "Date": "January 22, 2011"}, {"Title": "DOA and junk", "Author": "cowboy \"wskay\"", "ReviewID": "R21YYYREUW4P0I", "Overall": "1.0", "Content": "arrived and refused to power up after charging, just cycles on/off every few seconds.  Got a 2nd unit that cant auto focus in bright daylight half the time. Returned it and got a third unit that has the same problem - autofocus in telephoto modes is next to impossible.", "Date": "July 13, 2011"}, {"Title": "Great Camera", "Author": "Garbardeen", "ReviewID": "RIO0R6QS691HC", "Overall": "5.0", "Content": "'Very pleased with the ease of use of this camera. Putting the pictures on the computer couldn't be easier! I like the size,too-it is small and fits nicely in the hand while using and carrying.It is a GE CREOO-BK -12 MP digital with 3x optical zoom and 2.7-inch LCD (Black Metal) Created by Jason Wu.(love the PC port!)Amazon is always dependable!", "Date": "September 14, 2011"}, {"Title": "Decent idiot-proof camera!", "Author": "practical guy", "ReviewID": "R1J5C878MXBZ8H", "Overall": "4.0", "Content": "I bought this camera refurbished about a year ago from a major online retailer (either Tiger Direct or New Egg, don't remember).  I was intrigued by the price (approx $35) for a no-frills 12 mpxl camera. The slide-out USB port is by far the best idea ever.  No need to constantly buy or recharge AA cells; just slide the port out and plug it into your laptop (or a wall outlet adapter). Charges internal battery in minutes.  Also uses same USB port to upload pics to your laptop.  What could be easier? Full disclosure: the slide out USB port in the first unit didn't extend/detract smoothly; within days it self-destructed.  Sent it back and haven't had a problem yet with the replacement.  Some naysayers here bemoan the lack of manual controls; I admit there are times it is useful to have manual control. But it's been a non-issue for me.  I'm not much of a shutterbug so if I need to take a pic I'll reach for my iPhone or Galaxy S II. I saw this camera as an inexpensive upgrade from my woefully obsolete 3 mpxl and couldn't be happier. It suits me perfectly--for vacation shots and sightseeing while traveling on business.  It's also useful for shooting pics for Ebay listings.  This is the ultimate idiot-proof point-and-shoot camera.  If you can depress the power button and the shutter button, you're ready to go.  Of course, you can manually focus the lens and replay shots through the decent-sized LCD on back. If you're expecting a camera with enough bells and whistles to handle a fashion shoot you'll probably be disappointed with this--everyone else (amateur photographers and especially occasional users) will likely be satisfied.", "Date": "October 19, 2012"}, {"Title": "Jason Wu made a Boo Boo", "Author": "A. Fierman", "ReviewID": "R1W0U5CV8AT2MF", "Overall": "1.0", "Content": "I recently acquired a CRE11 \"Create by Jason Wu\".  I would be ashamed to put my name on it.  I own several digital cameras at the current time and am a semi professional photographer.  The camera looks nice but as is described, it is not durable at all.  Finding any kind of support data from the manufacturer is nearly impossible.  There is a quick start fold out that comes with the CRE11 but for any kind of deep tech info, almost non existant.  I, unfortuneatly, bought one and I should have taken the money and thrown it away.  Oh wait, I did.  This camera is designed to carry around.  Pictures are not very clear unless mounted on a tripod.  If you are looking for a small thin digital camera, this is not the one you want.", "Date": "April 4, 2012"}, {"Title": "Lasted a little beyond warranty", "Author": "M D KOPPANG", "ReviewID": "R2FZ57Q6XS2I3L", "Overall": "1.0", "Content": "Wow.....bought the camera in Nov. 2011.........quite working in April 2013.  Out of warranty time.  It was a nice looking camera for a decent price but the main problem.......the battery is most likely bad.  Would not recharge.  Tried the hard reset as company rep suggested. GE rep was fine....but the design focused more on appearance than quality.  Realized that it would be too expensive to send back for repair.  In the process of disassembling to try and get the battery out.....it is buried in the camera.  Has a lithium battery never gone bad?  Why would they have a camera design where the battery can not be replaced.Don't waste your time with this item.", "Date": "May 2, 2013"}, {"Title": "Inexpensive but at 50 bucks you almost get what you pay for", "Author": "Raybo", "ReviewID": "R3V0825KT8VCMI", "Overall": "1.0", "Content": "pictures were not bad. Camera quality is poor I've never dropped or abused the one I have it locks up and you have to reset it now that has stopped working...less than a year old. If you need something that works all the time this would not be my choice.", "Date": "April 3, 2013"}, {"Title": "Love this camera..", "Author": "Sheryl", "ReviewID": "R3K6J7GNPN36F1", "Overall": "4.0", "Content": "Great camera. I've taken pictures for several occasions and the quality of the photos you would think I was using my professional camera that I paid so much more for.", "Date": "November 30, 2012"}, {"Title": "DOES NOT WORK!!!", "Author": "Manuel", "ReviewID": "R1F3QXY84CL15C", "Overall": "1.0", "Content": "just opened the box and connect to the pc on and then off again and again and never ends, does not work", "Date": "September 18, 2012"}, {"Title": "Broke after just a few months", "Author": "Jen", "ReviewID": "RHLS0936DM3EG", "Overall": "1.0", "Content": "Besides all the inconveniences of the camera itself (takes blurry photos, flash is always on), the darn thing is so cheaply made that it fell apart after only having it 9 months.  What a cheap piece of crap, am very disappointed!", "Date": "September 8, 2012"}, {"Title": "CREOO", "Author": "Kathy", "ReviewID": "R1ELXS7JTHAN7Q", "Overall": "2.0", "Content": "I recieved this camera for a Christmas gift, Let me just say I have no Christmas pictures, worth keeping, blurry pictures,no matter what we tried, can't focus, only way to charge battery is to stick in your computer, what happens when your on vacation, no computer, sorry not worth it", "Date": "March 6, 2012"}, {"Title": "I cant rate this less then one, but should have the option", "Author": "Preferred Customer \"mousepadmayhem\"", "ReviewID": "R2NUNJ3MS1NISQ", "Overall": "1.0", "Content": "I didnt use the camera for about a year. There is no removeable battery. Now when i try and charge the camera it just flashes on and off, I let it set like that for hours and unplugged it and still wont turn on. :/  GE CRE00-BK Create by Jason Wushame GE, complete fail", "Date": "July 8, 2012"}], "ProductInfo": {"Price": "$129.99", "Features": "12.2 MP Digital Camera with 3X Optical Zoom\n2.7 Inch auto LCD screen\nBuilt-in 2GB internal memory\nBuilt in slide-out USB plug for easy connectivity\nFrom fashion designer Jason Wu", "Name": "GE CRE00-RD Create by Jason Wu 12MP Digital Camera with 3x Optical Zoom and 2.7-Inch LCD (Red Metal)", "ImgURL": "http://ecx.images-amazon.com/images/I/41hFG6hgtpL._SX300_.jpg", "ProductID": "B0044DEDH0"}}