{"Reviews": [{"Title": "Very nice camera, with some important shortcomings", "Author": "Charles", "ReviewID": "RTV23J4KZF5GJ", "Overall": "3.0", "Content": "I purchased this camera directly from Fujifilm rather than from Amazon due to a large price difference, although I would have much preferred to go with Amazon due to excellent customer service. I waited a few months to get this camera after it was first announced since it had the set of features that were essential for me, and I took a big risk buying it before any professional reviews or even user comments on it were available.This camera is extremely attractive from the outside. It's nicely sculpted and has a sleek, modern appearance. I got the blue version. I think it's the only camera that actually looks nice; the other cameras I've seen don't really look like anything. The outer design of this camera is a work of art. The camera is also extremely compact and very easily slips into my shirt pocket. It feels weighty and substantial despite its small size. I like handling it very much.I am using the HDMI interface to play back images and videos from this camera on a very large television -- an excellent 60 inch Sharp Aquos HD-TV, which spreads the images apart very widely, exposing any defects. My comments are geared toward that mode of display. Others who view their photos and videos only on a computer monitor or a smaller TV might be more comfortable with what they are seeing.The first camera I received had several major problems. In movie mode, the focus was extremely unstable, and you could see the camera continuously struggling to focus, even at long ranges from motionless subjects or just very distant, static scenes like landscapes. The other major problem was that when I used the zoom while shooting a movie, the image went completely out of focus and became a total blur, making it useless during that time. I called tech support at Fujifilm, and spoke to someone who didn't mumble impatiently in a thick foreign accent, most refreshingly, but he hadn't actually put his hands on this camera, and was puzzled about the problems I described. This is poor management by Fujifilm -- they should have fully trained their tech support people before releasing the product for sale, making them experts. The support person advised me to return the camera, since he was clueless about how to fix the problems.Since no other camera in its class or price range has the collection of features that this one does, particularly 1080p video at 30 frames per second (not what other brands misleadingly call \"Full HD\" when it's only 1080i or only 24 frames per second), plus optical image stabilization and optical zoom, I was very reluctant to return it and start all over again with some other product. So I exchanged it thru Fujifilm for another identical camera, hoping the problems I was experiencing were caused by defects in my particular unit rather than a design fault affecting all units.The camera I received in exchange performed much better focusing while shooting video, although there is still some minor focusing difficulty. However, it still turns the image into a total blur if I use the zoom while shooting video, indicating a design fault rather than a defect with this individual item. This is an inexcusable, ridiculous weakness of the Z900. What it means is that you can't use zoom as a dynamic feature while shooting video, but only to help you frame shots before starting to shoot. I have disabled digital zoom so I can't comment on its performence.It's nice to have stereo sound, an absolute requirement in my decision on which camera to buy. At least one competing brand has only mono sound, crazily turning back the clock to the 1950s, and I would refuse to buy that camera on that basis alone. The Z900's microphones are surprisingly sensitive, picking up lots of faint sounds and replaying them with good fidelity. However, for some reason the microphone holes are in the top of the camera instead of on the front. I can't understand how it makes sense to pick up audio from an orthogonal direction from the lens -- the lens points forward and the microphones point upward. It should have been easy for the designers of this camera to put the microphones in front rather than on top. I am also missing a microphone jack. I understand that almost all video-capable cameras in this class also do not have microphone jacks, but Fujifilm missed an opportunity to set this camera apart from its competitors by including this most useful feature. I would have gladly paid a little more for this capability.The Fujifilm Finepix Z900 takes truly excellent photos. The detail is extremely sharp, even on my very large TV, the the colors are rich and vibrant, even to my color-impaired vision (see below). This is when you set the camera settings to maximize detail and produce the largest size photos. I suppose with lesser settings, to conserve memory, they won't look as good. I think it makes more sense to get a larger capacity SD card than reduce the quality of the photos. I haven't challenged the auto-scene-select feature yet with a wide variety of scenes so I can't comment on it. So far it's worked very nicely for me. You can tap on an object on the screen for the camera to follow and focus on, and this feature works well except for small, distant objects in complex scenes, not a significant drawback.The video looks pretty nice, with good colors and reasonable sharpness (recall again I'm viewing it on a very large HD-TV). Thanks to the 30 frame per second frame rate it captures moving subjects nicely instead of blockily like 24 frame per second cameras can do. One of the reviews I saw for another product cautioned that you should not expect excellent quality high definition video from any modestly-priced camera, comparable to what you see on DirecTV, and this is very true and applies to the Z900. I would rate the video performance as good-very good. One issue is that when you're panning across a clear, uniform background like the sky you can see slight imperfections across the field of view that stay in the same position as you pan, like dust or filminess on a window pane. I don't think it's dust or dirt over the lens glass. It's probably imperfections within the optics or the video sensor. This is not a severe problem or a deal breaker, but it is a noticeable video defect. Also when shooting lots of trees in the distance you can't see individual leaves; it gets blurry out there. I think it would be unrealistic to expect much more from a product in this class and price range; its just the practical limits of this kind of device. If the movies are destined for Youtube or display only on your computer monitor, these issues would be total non-problems though. I'd be happy using this camera's movie capabilities on vacations, family events, or even amateur film making that's not intended for theatrical presentation.The 16 x 9 touch sensitive screen covers almost the entire back of the camera and works very nicely, although it picks up smudges very nicely too. Its degree of touch sensitivity is well tuned. The image on the screen looks real good, sharp and bright with minimal lag, and the placement of on-screen controls is thoughtful.Low-light performance is very good for both photos and videos, much better than other products I have seen in this class. The image stabilization function seems to work nicely, although I have not located any indicator on the display that tells you it's actually on.The HDMI output socket on the camera is terribly tight, and you have to press really hard to insert the mini-HDMI plug into it. I'm always afraid I'll damage the camera while pushing the thing in, and wondering if I even have the plug positioned correctly.The tripod mount appears to be made of plastic rather than metal, and I haven't tried using it yet.The battery is charged by removing it from the camera and putting into a charger. This is not only inconvenient, as compared with plugging a charging cord into the camera while the battery remains inside, but it hastens the day when the eject mechanism or the outside cover plate breaks due to constant use. A fully charged battery lasts a reasonable period of time during significant use of this camera in taking photos and videos and playing them back, before running out of charge. I wouldn't consider the charge life span to be short, but moderate. We would all like the charge in our camera batteries to last longer, but I think given the nature of contemporary digital camera technology, they really can't get much more life out of available batteries.This camera makes liberal use of color coding, especially red and green. As someone who is red-green color blind I wish they had been more sensitive to the needs of customers like myself. Granted, no other products do this, but I always feel discriminated against and this product doesn't help. There are some features that I just can't see at all, like the color of a pilot light changing to indicate a shot is ready to be snapped, or the color of the light on the battery charger changing to indicate a full charge (I have to ask a family member to tell me whether it's green yet). The camera also uses the typically non-intuitive iconography, forcing you to keep referring to the user's manual until you learn its idiosyncrasies. The user's manual is large but not especially well written and in a number of cases it doesn't correspond accurately to the functions of the camera itself.The software that comes with this camera is very rudimentary and not very good quality; I'd give it a C at most.Overall I am happy with this product considering the price and will keep it. It has an almost unique combination of features in this price range, and it performs reasonably well for my own needs. Most important, it takes really excellent still pictures, and good movies. The blurring of the image while using the zoom during movie shooting, and several other significant shortcomings, mar what would otherwise be a breakthrough product.", "Date": "July 3, 2011"}, {"Title": "Fantastic!!!", "Author": "pomondn", "ReviewID": "R39WL0628IVMKM", "Overall": "5.0", "Content": "Purchased a few weeks ago from a shopping network.  Have been looking for a quality camera w/decent pricing for awhile.  Once I received, I immediately charged it up to use.  I can't say enough on the quality of picture results and the amazing extra 'bells & whistles' this comes with.  I would highly recommend this to anyone looking for a quality aim and shoot digital camera.  Well worth the purchase.", "Date": "December 17, 2011"}, {"Title": "Great camera, except...", "Author": "Big Max", "ReviewID": "R1TAD58X9AG4G6", "Overall": "4.0", "Content": "The Fuji Z900exr is a very nice camera in most respects. I returned a Sony TX55, which was wonderful and tiny. The reason for the return was that there was no simple way to get the icons and data off when viewing--to show pics to friends etc. Each swipe brought them back for 4 or 5 seconds, cluttering the view.In this respect, the z900 was perfect. There was an icon to simply turn off all icons and data (except a small icon in the lower right to bring them back.) The screen was also much more responsive, at least for me. The TX55 was too sensitive--many times it would trigger just hovering over an icon. The z900 is also a small camera, though a fair degree bigger than the TX55. My current search is for an ultracompact with a non-extending lens. It doesn't have to be a touch-screen, but it seems most of them are, with my other parameters. I might have kept the z900 if not for what I consider a design flaw. It's possible mine was defective this way, but more likely it's a really bad design. That's the fact that when zooming during shooting a movie, the camera would invariably defocus until the zooming stopped. No other camera I've used does this. It's downright nasty. Who wants to see a blurry image every time the zoom is used? Plus, the low-light movie sensitivity was not good--far worse than my 3 year old Casio S12.The look and feel of the z900 is excellent. It feels well-made, although a bit on the heavy side. It's a few mm bigger in all directions than my S12, and I was hoping to go smaller or the same size. IQ (Image quality) of the z was quite good, although surprisingly not much better than the older s12. The TX had better IQ than either of these in most cases, though the actual resolution (instead of general color and appearance) wasn't really better than either the z or the s (when taking into account the difference in megapixels).So I'm still searching. I've tried a Sony Tx5 and that seems to meet all my requirements. Small, non-protruding lens, waterproof(!), and it has a feature that turns the icons off. However, it's 2 years old and only 10mp (my s12 is 12mp). IQ of the Tx5 is outstanding. The Sony TX10 is similar, but doesn't allow turning the data and icons off! So I'm waiting for the newly announced TX20 and crossing my fingers.", "Date": "March 4, 2012"}, {"Title": "Great Camera", "Author": "alexhl97", "ReviewID": "R3EVKAUV2CE8UW", "Overall": "5.0", "Content": "Great camera, the picture is fantastic with its 16 mp, the videos are really good to, the touch screen works perfectly and so does the motion. The battery lasts about a day if you use it very-very much.", "Date": "November 17, 2012"}, {"Title": "Disappointing in the extreme", "Author": "TJS", "ReviewID": "R8OQBVGYFNC2Y", "Overall": "2.0", "Content": "The Z900 was the 5th or 6th digital camera in this class I've had over the last 10 years and 14,000 pictures (that were good enough to keep). It turned out to be among the most disappointing of cameras.I carry a camera with me at all times, and my experience over the years has refined my requirements for this type of camera. It needs to be (1) small, fitting easily into a pocket, (2) fast, ready to shoot in a second or so, (3) sporting at least a 5x optical zoom that can be used during video recording (without noise artifacts), (4) with a non-protruding lens (to avoid the damage I experienced with my first Canon), (5) offering decent low-light and flash performance, (6) with a slide-down lens cover for ruggedness and to prevent the camera from turning itself on when slipped into a pocket, and (7) having separate buttons for taking still or video shots because one typically doesn't have the time to fool with a touch screen to capture elusive moments.On paper the Z900 met all of these criteria. In practice, not so much.After 6 months my experiences with the Z900 were mostly of the frustrating variety: many blurred photos (typically courtesy of the \"advanced\" EXR auto modes), lots of missed indoor shots (because the flash takes so long to charge and is too weak anyway), a touch screen that can't be seen in bright outdoor light and is therefore useless (touchscreens on cameras are a solution looking for a problem, IMHO), and after a few months the camera periodically wouldn't turn on. That problem gradually degenerated until the camera wouldn't activate at all, and that's when I got to experience Fuji's excuse for product support and repair services (btw, just try finding either \"warranty\" or \"repair\" on either the FujiFilm website or manual). It turns out that in Fuji's judgement the problem isn't covered under the warranty and can be repaired for a mere $170 in labor (no parts required). I don't think so (a refurbished Z900 can be had here on Amazon for as little as $102).What really annoyed me, though, was that my wife's iPhone more often than not took better pictures than the Z900, indoors or out! I haven't yet figured what my next camera will be, but I do know it won't be from FujiFilm.", "Date": "August 11, 2012"}, {"Title": "Yes it is.", "Author": "Tedrick Stone", "ReviewID": "ROU3S5CACO8PT", "Overall": "5.0", "Content": "Is this a good camera? Refer title! Outstanding item. Plenty of features, great quality, compact, sharp photos and simple enough for an old guy to figure out (62). Highly recommend.", "Date": "May 3, 2013"}, {"Title": "SO frustrated with this camera! HORRIBLE PICTURES!", "Author": "Kay", "ReviewID": "R2LQKRGIH50YOB", "Overall": "1.0", "Content": "I did considerable research before buying this camera. I though it would be good for taking pictures of my kids while they're moving. It takes blurry pictures when they are still! I've tried all their fancy settings and nothing works. I thought I just had to get used to it and figure it out, but after a few months with it I have not had any \"great\" pictures. Just blurry. I know my way around digital cameras and this one is a waste of money.I previously had a Nikon. I am going to buy another Nikon even though I can no longer return this one. I feel like it's better not to take pictures at all then come out with these horrible blurry ones. My Kodak from 2007 took better pictures.", "Date": "December 17, 2012"}, {"Title": "Good buy", "Author": "Ed", "ReviewID": "RTZ1WQ5APWVZ7", "Overall": "5.0", "Content": "Though I haven't used this product for long, I'm happy with its features and quality of pictures. It's a good product!", "Date": "December 9, 2011"}, {"Title": "Completely Unacceptable", "Author": "nhoude", "ReviewID": "R1WX829SFI2M5Z", "Overall": "1.0", "Content": "I have ordered the Fujifilm FinePix Z900EXR Ditigal camera Big Value through Amazon. They set up the delivery instructions so that no delivery can be made without a signature. For those of us who work during the day, this type of delivery is obviously innapropriate.When contacting the company, they have advised me that if the item is not delivered it would then be sent to Big Value and I would get a total refund. They could NOT resend it to me within different delivery instructions. They blamed this as being an Amazon policy which I know is false as I have ordered from amazon several times without this being a problem.So even if I still wanted to buy the camera from them they could not send it to me with instructions which meet my needs. How do they stay in business with this type of customer service? Amazon should be embarred by this situation.http://www.amazon.com/gp/product/B004V9ID2S/ref=cm_cr_rev_prod_title", "Date": "July 23, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "16MP EXR BSI CMOS Sensor\nFujinon 5x Wide Angle Optical Zoom (28 - 140mm)\nFull HD H.264 1080p movies w/ Sound @ 30fps\nMotion Panorama 360° mode\nSD / SDHC / SDXC", "Name": "Fujifilm FinePix Z900EXR Black 16 MP CMOS Sensor with 5 x Optical Zoom Touchscreen Digital Camera Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41gRj9DhPNL._SX300_.jpg", "ProductID": "B004V9ID2S"}}