{"Reviews": [{"Title": "Didn't work for me", "Author": "RV4ME", "ReviewID": "R2EOO77SKT9ME3", "Overall": "1.0", "Content": "Installed on 5th wheel camper trailer for backup camera transmission into pickup truck monitor. Couldn't get it to transmit more than 5 feet between transmitter and receiver.  I also had to use power from the transmitter to power the receiver in order for it to transmit camera image which makes wireless useless. Didn't work for my application. Returned to supplier.", "Date": "September 26, 2011"}, {"Title": "Not RF (Radio Frequency)", "Author": "Firewire", "ReviewID": "RY0AXRRVBEWXM", "Overall": "2.0", "Content": "I feel this product is mis-represented.  I purchased a Crimestopper license plate camera, Crimestopper Visor Monitor, & this Crimestopper wireless transmitter (all Crimestopper products supposedly compatible with each other).  I couldn't get a video picture to work and contacted Crimestopper customer support only to be told the TX/RX (Transmitter and receiver) needed to be powered by the SAME 12v reverse signal circuit because they use the power line to transmit the video signal.  Huh?  So the TX/RX are used for???  Maybe to signal the monitor \"incoming transmission\"?  I don't get it.So I forged ahead, and did as instructed.  I had no issue getting to the positive reverse signal both under the dash and in the tail light (via a web search).  Both the TX and RX led lights lit up fine, but the monitor was just a black image mixed with white snow - No clear picture of anything.  Literally, I do not know if it was receiving the signal properly or not due to the lack of any picture quality.  Turn off the transmitter and the monitor goes to solid blue.  This tells me it is receiving a signal, just not a clear one.  I was installing in a pickup truck from the license plate to the cab.  So out of frustration, I finally took a really long piece of wire all the way from the rear of the pickup to the exact same positive reverse signal under the dash and still same results.  I did all my checking with the equipment out in the open for best signal prior to permanmently mounting it.Manufacture Website description:\"If you have ever installed a camera on a bigger truck, bus or motor home, then you know how much work it is. With the SecurView(tm) SV-1000.PLW, your work will be cut in half. The SV-1000.PLW is a wireless signal generator that converts a hardwired RCA video connection into a wireless signal. The system includes a transmitter and receiver end to complete the signal. The transmitter is connected to the reverse camera, and the receiver is connected to the monitor and that's all it takes. You will be able to get a clear image without have to run any wires, and the wireless signal will work at a distance up to 200ft. With this system, you will be able to put in a full camera system in half the time.The SV-1000.PLW can be used with any of the SecurView(tm) or PlateCam(tm) cameras or any other camera that uses an RCA cable video connection.Video transmission by frequency modulation over DC power linesEliminates installing long lengths of RCA cablesTransmits wireless signal through power lines eliminating interferenceSimple power and ground hook-upPerfect for longer trucks, motor homes, buses and limousinesWaterproof design (IP68)The SV-1000.PLW offers a perfect solution for longer vehicles such as trucks, buses, limousines or motor homes that need a reverse camera system. This system will take any camera and monitor and turn the video output into a wireless signal so that no video cables need to be ran from the front to the back of the vehicle eliminating hours of installation time\"", "Date": "May 4, 2012"}], "ProductInfo": {"Price": "$89.95", "Features": "Power Line Wireless Video Transmitter & Receiver\nConverts Any Standard Rca Video System Into A Wireless Signal\nEliminates Installing Long Lengths Of Rca Cable\nTransmits Wireless Signal Through The Power Lines\nEliminating Interference", "Name": "Crimestopper SV-1000.PLW Universal Wireless Transmitter", "ImgURL": "http://ecx.images-amazon.com/images/I/41u4RET0ElL._SY300_.jpg", "ProductID": "B004T3JGWC"}}