{"Reviews": [{"Title": "Not a bad lens.", "Author": "The Reviewer Formerly Known As...", "ReviewID": "R3H94IAWZDXO3Q", "Overall": "4.0", "Content": "The Pentax 135mm F/2.5 was one of my more recent MF lenses - I had stayed away for some time after poor experiences with a Minolta 135mm, but after one came up for a reasonable price online I decided to give it a try.SPECIFICATIONSElements: 6 elements, 6 groupsAperture: Min F/2.5, Max F/32, 8 bladesFilter thread: 58mmPROS- Excellent image quality- Handles VERY well- Bokeh at this focal length is very nice- F/2.5 is reasonably fast for most uses- Sharp even wide openCONS- Plenty of chromatic aberration (purple and green) in bad lighting wide open- 135mm can be an annoying focal length on prime- F/32 is almost unusableYou know, a lot of people claim this lens isn't as good as its SMC Super-Takumar counterpart (which I now also own) but I really can't see a huge amount of difference overall. The 135mm focal length can be a little tricky as a walk-around prime lens, but for portraits I find it very non-intrusive  leaving your subject able to feel at ease with you taking pictures. I am of course talking about using this on a full frame digital/film camera - on a crop camera the focal length sits at around 200mm which is almost too long for portraits...perhaps the perfect focal range for some mild wildlife photography?OVERALLMany people swear by this lens - I'm glad I bought it but rarely use it. It's a good lens with very decent IQ, but overall it just doesn't shine like some of the other Takumars out there. If you can get it for less than $100 I would definitely suggest giving it a try - historically it goes for $150-200 so you can always sell it an not have lost anything!", "Date": "June 9, 2012"}, {"Title": "Works Great as a 202.5mm on a DSLR", "Author": "Alan Hembra", "ReviewID": "R2HE2Z4T1PLF46", "Overall": "5.0", "Content": "I've been looking for a good tele prime lens but can't drop the big bucks on the new lenses right now.  So when I saw this lens which was manufactured between 1980-88 I decided to give it a shot.  Since this is an old film lens it converts to a 202.5mm on a modern DSLR like my K-r.  It has a built in lens hood that slides out of the body when you want it.  I totally lovin it!Only one issue.  The lens is old enough that the camera can't get some of the readings off of it.  The camera will prompt you to set the focal length when you turn it on with this lens.  That's no big deal.  You will have to work a little setting your F stop and focus manually.  But if you don't know how to do that then you should stick to your camera phone.  For this price your saving at least $500.", "Date": "October 30, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004UD8JY2"}}