{"Reviews": [{"Title": "Great Canon products at a great price.  Nice starter kit.", "Author": "Laser Dude", "ReviewID": "R3D8OHA0O263OM", "Overall": "5.0", "Content": "This reviewer is new to DSLR camera technology. This camera came highly recommended by several hobbyists and professionals to whom I spoke and this is a great price for everything that is included in this kit. The product arrived on time in suitable shipment packaging.  All components in the kit were as stated in the product description.  The Canon products: the Rebel T3i body, 18-55 IS II lens, and 55-250mm IS lens, are the highest quality components in the kit.  The shutter remote, lens cleaning kit, 16GB class10 mem card, card reader, mem card storage wallet, spare battery, and LCD screen protectors came in handy for someone who is new to the field. I have not tried the external flash yet but the head can be articulated for bounce flashing to offer the user more overall versatility than the built-in flash on the T3i (a diffuser is not included however).  It's a nice accessory to be included in the bundle.  Similar Canon Speedlite flashes, albeit with more bells and whistles, are priced in the $450-$500 range.  I got additional reflections from the sunlight when using the Vivitar UV filter and didn't see much improvement in color saturation so I haven't made much use of these.  A camera lens hood, unfortunately not included, may have helped to reduce the reflections off the additional surfaces from the filter.  I didn't have much luck with the 0.45 wide angle macro nor the 2x telephoto Zeikos lenses and found my photos came out better with just the Canon lenses included in this kit.  Also, if you are new to the field then I highly recommend purchasing \"Canon EOS Rebel T3i/600D For Dummies\" by Julie Adair King along with this camera.  You will get much more out of your camera in a shorter amount of time than by simply reading the manual and learning from trial and error.", "Date": "December 13, 2011"}, {"Title": "UNBELIEVABLE", "Author": "Kimberly Vipperman", "ReviewID": "R8Y3H48GOHTZI", "Overall": "5.0", "Content": "I had recently purchased a Canon T3 bundle from Best Buy, after shopping these camera's and reading reviews for over a year.  Then I started shopping on Amazon and saw this deal, I took the T3 back and purchased this T3i Bundle.  I will admit I was extremely skeptical, as I do not usually purchase items on the internet, especially from unknown sellers.  However, I took the leap and am so glad I did.  Not only did I get an upgraded Camera, the Canon lenses, and the additional accessories that came with this bundle, but everything was brand new and better then described.  Love the camera bag, perfect size, and having the additional battery is also great!  Not to mention, it came sooner then expected!! I am so happy with this purchase, and would highly recommend this seller! Thanks Cameta, very excited using this package while making great family memories!!", "Date": "May 24, 2013"}, {"Title": "Happy with purchase", "Author": "E. Queen", "ReviewID": "R2FE05VF04GPHY", "Overall": "5.0", "Content": "After looking at this model camera for months, I finally found this great bundle for a really good price. Camera and accessories all arrived really fast and I was able to take amazing pictures at a cookout during Memorial Day weekend. The box was a little beat up when it arrived, but the items were packaged pretty good, so everything inside was protected.  Haven't used all of the accessories yet, but so far so good. Very happy customer.", "Date": "June 9, 2013"}, {"Title": "Great Service", "Author": "Mark R. Sandberg", "ReviewID": "R2K3QAPB58H42R", "Overall": "5.0", "Content": "Product arrived on time and as advertised. Purchased was packed well with adequate protection. Purchase of a collection of equipment such as provided here allows one to get going with photographing with a variety of lenses and other equipment with little effort.", "Date": "February 19, 2013"}, {"Title": "Excellent Buy!", "Author": "K9 Rick", "ReviewID": "R2SY6FVGMDLBO0", "Overall": "5.0", "Content": "This is a quality camera system at an excellent price! The Canon Rebel T3i camera is an excellent DSLR and these accessories provide the amateur photographer with a full gadget bag with which to enjoy photography!", "Date": "January 31, 2013"}, {"Title": "Great camera - good package", "Author": "A. Freedman", "ReviewID": "R3RDW9EPRDOHWD", "Overall": "5.0", "Content": "Camera is very very good.  Lenses are very good as well. The supporting stuff is okay to mediocre.  The flash does not go well with the camera versus the auto flashes designed to complement the Canon system.  The bag is good and decent for keeping the camera at home but I would not travel with it.  Overall it's a good starter package but with the new T4i I expect this to drop in price quickly.", "Date": "December 22, 2012"}, {"Title": "Great package!", "Author": "Earle L. Trimble", "ReviewID": "R22F8OSELOYO3", "Overall": "4.0", "Content": "I bought this camera bundle for my daughter's graduation gift, and she loves it!  It has most everything needed to get started without having to purchase more gadgets.  The flash could be a better quality unit, but it will make due.", "Date": "July 1, 2012"}, {"Title": "Very good.", "Author": "David McGhee", "ReviewID": "R3I4RNM1861T06", "Overall": "5.0", "Content": "Item shipped on time in great shape. Suits our need perfectly and is ideal for the purposes we have in mind.", "Date": "April 6, 2013"}, {"Title": "Very happy about this purchase", "Author": "Jakey D", "ReviewID": "R2MGDTVTDZA1W9", "Overall": "5.0", "Content": "I just got my camera and the package that came with it. Very happy about the purchase. Everything is shipped brand new and as advertised. No surprises which is always great when you get exactly what you wanted. The best part about this is that I ordered standard 5 - 7 day shipping and the camera came less than 2 days later. Extremely happy about that, since it was my wife's gift for me, for my birthday.About the products themselves, I haven't yet fully tried everything, but I got exactly what I wanted, so the rest is up to me and can't wait to take some amazing pictures with this new camera.", "Date": "January 31, 2014"}, {"Title": "LOVE LOVE LOVE", "Author": "Emily", "ReviewID": "RE8TBPDUPZEDI", "Overall": "5.0", "Content": "Words can't even express how much I love this camera!  All of the accessories are very useful, although some of them I haven't quite figured out how to use!  My only complaint is that the wireless remote doesn't work - not sure if I have to find a battery to replace, but I can't even get the battery door open to check it.", "Date": "November 10, 2012"}, {"Title": "Best Deal!!! Love my new Canon Rebel T3i", "Author": "Comi08", "ReviewID": "R2EGIFUTMA1KLC", "Overall": "5.0", "Content": "I had looked around at many cameras for months trying to decide which DSLR I wanted. This is my first DSLR camera, and I could not be more excited about it! It takes the best professional looking pictures without even trying! All the components are great, I haven't used all of them yet but so far so good. The wireless shutter remote has a decent range on it, you must be in front of the camera not behind it for it to work. The extra battery has already come in handy, the lenses are amazing. The only items I will be upgrading are the screen protectors ( the ones that come with it are alright, I just want some better ones) and the bag (it's a good bag, but it has four snaps to open and close it, I prefer a zipper style.). For the price this is an amazing deal!!! With this purchase I also bought Canon EOS Rebel T3i / 600D For Dummies (For Dummies (Computer/Tech)) and it really has helped me learn all the features that this camera is capable of! Totally worth the extra $17!!!", "Date": "November 2, 2012"}, {"Title": "Amazing!", "Author": "Jacqui_Star", "ReviewID": "R31E31UUOX7M9O", "Overall": "5.0", "Content": "I recently bought this bundle and I couldn't be more excited.  I've had it for less than a week and I've been trying to get to know everything.  A few of the things weren't exactly want I wouldn't have liked but for the price I can't really complain.  I would definitely buy more items from this seller as well.", "Date": "October 2, 2012"}, {"Title": "Camera & Lens bundle", "Author": "Fairorchids", "ReviewID": "R39S3DTFZILJ2W", "Overall": "5.0", "Content": "This was the most cost-efficient package for the TR3i with lenses, filters & flash.  It works well for my close-up work with orchids and other flowers.  I have subsequently added a 200-500 mm zoom lens for use in nature photography.The camera bag is light-weight, but adequate when I travel by car; for upcoming international travel I will have to upgrade the bag.", "Date": "August 14, 2012"}, {"Title": "awesome deal!", "Author": "coastiewife", "ReviewID": "R3LA2EUKJN7NKO", "Overall": "5.0", "Content": "I looove this camera! I have been wanting to get out out my film SLR for a long time. My husband surprised me with this set as my first mothers day gift. It benefits him too bc he its getting deployed this summer and now I will be able to do lots of pictures and videos of our baby girl. For videos I highly recommend getting the microphone to get beautiful sound quality. This package is a steal! I use the UV filters and I know the difference but I have been an active hobbyist for 12 years. I have used everything in this kit and have zero complaints, except the bag is cheap. Get a low pro bag. I got the backpack one for our hiking trips. I would rate this 10 stars if I could", "Date": "May 30, 2012"}, {"Title": "A dream come true", "Author": "Colette", "ReviewID": "R1XJIBAUXWHVCV", "Overall": "5.0", "Content": "I had been dreaming about a Canon EOS for so long. The package I found was beyond expectations. it had everything I needed. in a few weeks, I have already taken so many pictures! So much enjoyment...", "Date": "April 29, 2012"}, {"Title": "Love This Camera! And Company!", "Author": "by Heather D.", "ReviewID": "R2F5AHKZI0XMYB", "Overall": "5.0", "Content": "I have a soft spot for the Canon brand of camera but this camera sealed it as the #1 camera for me forever! With the quick shutter release and easy to understand features it's easily the best purchase I've ever made. The Canon Rebel series is super user friendly and with all of the extras in this bundle it was impossible to pass up. If all of the items were purchased separately the cost could have easily been double what I paid. I got a regular lens as well as a telephoto lens, four different filters, a remote control, a wonderful cleaning kit, a memory card, and more. It was a great bundle on top of the camera which shoots 18 mega pixel shots. The pictures are extremely clear and crisp. I have only taken pictures as a hobby before, but I'm thinking about going pro. That's what this camera has done for me - and my pictures. It's a fantastic buy and a wonderful camera. I love Canon.", "Date": "January 21, 2013"}, {"Title": "A pretty good camera and a nice kit!", "Author": "Alberto Guerra Valadares", "ReviewID": "R3EANHQE7H87SK", "Overall": "4.0", "Content": "A pretty good camera and a nice kitI'm very happy with this camera, for a beginner I would not expect more. The kit lens is very versatile, and the total amount believe that the kit had already been paid. Accessories resolve well and you could not demand more, the package tends to be self explanatory and puts photography lovers, but still in beginner status with various tools to grow!", "Date": "February 27, 2013"}, {"Title": "cesar marcano", "Author": "cesar marcano", "ReviewID": "R1FRHUI2LNTBAV", "Overall": "5.0", "Content": "exelente vendedor y muy buen articulo con todos sus accesorios, todo lo necesario para la fotografia , todo llego rapidamente muy complacido", "Date": "December 31, 2012"}, {"Title": "Cannon EOS Rebel T3i---love it!", "Author": "Jana Masters", "ReviewID": "R6FS351YW0HGU", "Overall": "5.0", "Content": "I absolutely love this product.  My scandisc didn't work when I got it, it was corrupt, but I replaced that and everything is working great now!  I couldn't be happier!", "Date": "December 17, 2012"}, {"Title": "Great Value!", "Author": "Angel", "ReviewID": "R2REZ1ALXQRK14", "Overall": "5.0", "Content": "I am very pleased with my purchase. Love the Camera and everything in the bundle!  The bag is not bad either.  I'm not sure why people have complained.", "Date": "December 3, 2012"}, {"Title": "product review", "Author": "sherry", "ReviewID": "R19J0BWURMJIW3", "Overall": "3.0", "Content": "first off, i love the camera.  both len's are good also.  the macro lens is aweful.  every picture i've taken with it is blurry.  the remote sucks.  i have to be within an inch of the sensor for it to work.  the flash only fires about once every 20 shots. the case is cheap.  going to get a new one ASAP.", "Date": "August 14, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005HIROHM"}}