{"Reviews": [{"Title": "Good dash camera mount.", "Author": "D. Li", "ReviewID": "R24AG9356K4V1D", "Overall": "5.0", "Content": "I bought a dash camera from DealExtreme some time ago, and the rubber suction on the dash mount melted on a hot day. So I bought this one to take a chance and see if it will melt during hot (90F-100F) Southern California days. We've been having 90F+ weather for 2 weeks now, and with that the windshield and inside of the car gets even hotter under the sun. This mount is still going very strong under the heat punishment. Seems like the rubber suction is made of higher quality material. I suction the mount onto the windshield directly so I'm not sure if the included adhesive pad will withstand the same heat.Pro:- Suction doesn't melt under the hot sun (90F+ weather).- Sturdy mount. No abnormal vibration from camera footage.- The tightening knobs have not come loose after extensive use.Con:- Doesn't give you as much flexibility on height and angle as some other dash mounts. You just have to 'settle' with a configuration that works best.", "Date": "July 21, 2012"}, {"Title": "Arkon CMP214 Dash Mount - works great", "Author": "twowings19", "ReviewID": "R26YAJJBGT47MH", "Overall": "5.0", "Content": "I really like this product. I am a horrid photographer but I often need photos to accompany my articles. This car mount for my camera has improved my photos 100%. It works on either the dash or on the window. It adheres very strongly, has incredible tilting abilities, both the hinged arm and the head itself where the camera goes. Holds the camera securely. I am impressed with the product and pleased with the price. I highly recommend this for anyone who has to take photos on the fly or just wants to take a video of a car trip.", "Date": "December 11, 2011"}, {"Title": "Great price and perfect for my use", "Author": "Michael Chung", "ReviewID": "R1T40TQSFDUA8L", "Overall": "5.0", "Content": "Our family was planning a road trip, and I wanted a suction mount for my camera that I could attach to the exterior of my car to take family pictures wherever we went.  (see my picture in the gallery) I didn't need anything fancy, and I didn't want to spend too much money.  This suction mount was exactly what I was looking for.The suction cup is strong and held my little point-and-shoot camera with no problem.  If necessary, it could probably hold my DSLR too, but I didn't need to do this.  The adjustable arm locked just fine and was easy to use.  The part that attaches to the camera adjusted by friction and was handy in helping to point the camera in the right direction.I did not mount the camera on the interior windshield, but if I did the camera would be upside down because the adjustable arm is not long enough.I'd buy it again and would recommend this suction mount to anyone who needs a simple one.....and the price is reasonable.", "Date": "July 2, 2012"}, {"Title": "Double duty mount", "Author": "Roger M", "ReviewID": "R2F1R79E3B1GSK", "Overall": "5.0", "Content": "This mount can be used also for Garmin nuvi. The camera screw adapter can be removed to expose the ball which works with the Garmin swivel mount.", "Date": "November 3, 2012"}, {"Title": "EXCELLENT QUALITY!", "Author": "ragosvc", "ReviewID": "RXOQ7MR27FF6J", "Overall": "5.0", "Content": "I paid a little over 6 dollars for this product so I expected something that was pretty cheap. I only wanted it so I would be able to film in my car without having to hold my camera. (something I figured I wouldn't need to be excellent quality) When it arrived I found it to be VERY sturdy and the suction cup is VERY strong. All of the hinges tighten really well and stay in the position you put it. The price and quality are excellent! Def. recommend this one!", "Date": "October 12, 2012"}, {"Title": "Great for smaller cameras, wouldn't trust it with anything heavier than a Handi Cam.", "Author": "TheManTheLegend", "ReviewID": "R34XVH0N5OI2RM", "Overall": "5.0", "Content": "Great little window mount for lighter cameras. It will stick to anything that is flat and smooth.I would not trust this to hold a DSLR or anything in comparable weight. It does hold my Handi Cam just fine however.Worth buying for lighter cameras.", "Date": "August 17, 2012"}, {"Title": "A Review", "Author": "Radoslav Asenov", "ReviewID": "R1LLS7SJVSQ78D", "Overall": "3.0", "Content": "This item is not so bad for the money, but it's not not very good as well... It's not so steady and it's vibrating all the time. I tried it once in a car and I was using Sony DSC-H20. It's not bad, I like it, but next time I would definitely spend more money for something better", "Date": "February 24, 2012"}, {"Title": "Used on a Motorcycle windhsield", "Author": "Denton Pilot", "ReviewID": "R2RPA025AC788A", "Overall": "5.0", "Content": "I attached a GoPro type camera to this mount, with a cable in case it fell. Mounted on the front of the bike on shield, in the brunt of the wind, it stays on at 80 mph no issue. This was in temps that started at 69 in the morning and hitting 91 by afternoon. I was surprised how well it holds. Camera fits tight, sucker cup worked great - it exceeded my expectations. I thought with all the vibration, wind, etc. it would eventually fall off - but it held (rode just over 200 miles that day).", "Date": "May 7, 2014"}, {"Title": "Great Mount", "Author": "Brannan Idle", "ReviewID": "R2ZT73QVEMLM1P", "Overall": "5.0", "Content": "This is a fantastic mount. It holds to the glass very well. It was able to hold a 4 pound DSLR for a creative shot. I wish the arm was a little longer. The locks work well and hold firm.I would definitely recommend this to a friend.", "Date": "April 9, 2014"}, {"Title": "Nice for a camera mount", "Author": "James Beyer", "ReviewID": "R6OF72ZJDASDT", "Overall": "5.0", "Content": "I initially used this for a mount for a small camera in my car.  Turned my small point and shoot camera into a dash cam.  It worked well and did not drop the camera.  I later used the mount it for my web cam and stuck it to the bottom of my cup board in the kitchen.  I now have a web cam in my kitchen!  the mount has been stuck there form a few months and has not fallen off.  Simple and works great.", "Date": "March 23, 2014"}, {"Title": "PERFECT!", "Author": "AaronCDC", "ReviewID": "RUVFIZP8HILYD", "Overall": "5.0", "Content": "I use this to hold my digi cam on the dash for when I am racing or general driving purposes if I need a witness to something. It doesn't move, it's rock solid, not one issue to note with this. You'd be stupid to spend lots more for less quality.", "Date": "March 21, 2014"}, {"Title": "It works just fine", "Author": "jason cooley", "ReviewID": "R3137OL55W55BO", "Overall": "5.0", "Content": "I gave this product a 5 because it works. It's not complicated. It sticks to the windshield very very well and holds the camera firmly. The hard plastic nature of the device prevents too much wiggle and vibration, keeping the camera fairly planted and  in focus.", "Date": "March 12, 2014"}, {"Title": "Not cheap plastic", "Author": "Lobo Dagaz", "ReviewID": "R2KRH75BIMR42U", "Overall": "5.0", "Content": "Made of some thick plastic. Item exceeded my expectations. Sucking cup works well and does not fall off like other do.", "Date": "February 27, 2014"}, {"Title": "Very durable", "Author": "Captain EMO", "ReviewID": "R3JG5LFYIU4V4J", "Overall": "5.0", "Content": "Put the disc on the dash and I was able to adjust it to handle my JVC video camera. It was very stable and never lost it's grip.", "Date": "January 15, 2014"}, {"Title": "Excellent mount", "Author": "Insectophile", "ReviewID": "R120J4VSBJ1VL5", "Overall": "5.0", "Content": "This is a solidly constructed mount that I've used on my rear car window to record traffic behind me with an iPhone using the ARKON Smartphone Grip Tripod Adapter (MG1420). The mount remained suctioned onto the vertical window for several days until it was no longer needed and I removed it.I'm currently using this mount to hold a Nexus 7 on my treadmill using an Arkon tablet attachment. (It's worth noting that I used industrial double-sided tape on the suction cup to make sure the tablet doesn't take a fatal dive to the floor. No way I'm trusting a suction cup under the weight of a tablet.)After a year's worth of use I'm still happy with it.", "Date": "August 24, 2013"}, {"Title": "Does A great Job", "Author": "M Liv", "ReviewID": "R3TZ43PNJ44R36", "Overall": "5.0", "Content": "It does a great job. I use it for my Sony Bloggie as a dashboard cam for local traveling. This does a fantastic job staying steady, & holding the camera up. I would defiantly recommend!", "Date": "August 24, 2013"}, {"Title": "Not for outside use.", "Author": "M7", "ReviewID": "R3B78N9YFPW7X", "Overall": "3.0", "Content": "This mount works OK for mounting my GoPro on clean interior glass but was not able to withstand a good old 'Merican shaking when stuck to the back glass of my hotrod.  (camera went for a 60 MPH tumble)", "Date": "May 8, 2013"}, {"Title": "Very good product!", "Author": "Pete", "ReviewID": "RLMQGEQNNEPU8", "Overall": "4.0", "Content": "The video camera mount is very well designed and very sturdy.  There is a little vibration when used on the mounting disk, due too the foam tape used mount it, as well as it being attached to the dashboard of my vehicle.  If attached to the windshield, there is very, very little vibration detected on the video.  Overall, very good product.  Due to the angle of some windshields (like mine), the camera must hang upside down to avoid it hitting the glass or being blocked by the mount itself.", "Date": "July 15, 2012"}, {"Title": "Works as it should", "Author": "Dave", "ReviewID": "R1E6WZUNX9VPE0", "Overall": "5.0", "Content": "It works great, and keeps suction well.  I use it for a dash camera and I have no problems at all.  One note of warning though, the boom that extends from the suction cup mount is not super large.", "Date": "February 10, 2012"}, {"Title": "Quick to disappoint.  Arm is FAR too small.", "Author": "Michael Maryland", "ReviewID": "R96JACFB8H2AG", "Overall": "2.0", "Content": "I ordered this product hoping to be able to mount my compact digital camera on the inside of my windshield.  Unfortunately, as I had feared, the arm is not long enough to allow for this, unless you are willing to accept mounting your camera upside down.  From the beginning, I did not want to use the adhesive dash mount, but upon realizing it may be the only way to mount the camera in an acceptable manner I decided to stick it to my dash.  The glue was not strong enough to hold the mount to my dash and immediately separated.I COULD glue the dash mount on, but from the beginning i wanted to avoid glue.  If the dash mount stuck to my dash properly, I would have given this product a usable 3 stars although it did not suit my intended purpose.  Spend more money on something with a longer arm.", "Date": "June 28, 2012"}, {"Title": "Broke the first day", "Author": "Dena Moon", "ReviewID": "R25EEF3FV2XG5N", "Overall": "1.0", "Content": "This mount seems very cheaply made.  I was worried I'd have problems with the suction cup when using this in the car because of temperature here.  That wasn't an issue at all.  The suction cup is great.First use, I was excited to get this up and working for us, I attached a camera (very lightweight) to the mount and adjusted the arm where I wanted it and tightened it up.  It worked fine and held for about 20 minutes then the arm started \"falling\" and kept needing tightened.  I thought maybe the camera was just too heavy (like I said, NOT heavy it is a tiny fugi point and shoot).  So I decided to attach the Zumi+++ instead.  But when I went to take off the first camera,  the screw tightening the ball and camera to the arm wouldn't loosen, wouldn't come off, finally it came off WITH the arm. Then even after taking the camera off the attachment it was impossible to unscrew the 2 pieces and like this it is impossible to put the ball back on the arm and impossible to use this mount at all.Finally after using hot water, pliers, anything we could think of, we got them separated but it broke 3 teeth off.  Now if we use it with something much lighter than a deck of cards we could probably carefully use it.Very disappointing.  There are many better mounts out there, for more money.  The others are worth spending more on for sure as this one had to be replaced after one use.", "Date": "March 15, 2013"}, {"Title": "Good mount....while it lasted", "Author": "BigEddie", "ReviewID": "R3T27IMHHPN193", "Overall": "3.0", "Content": "I used this mount for my Contour camera in the car as a dash cam. I mounted it to the windshield (upsidedown). Very sturdy for the Contour camera.The mount lasted about a year and then the rubber that attaches to the window started tearing at the back of the plastic mount. You can't replace the rubber mount so I bought a new one. If this one doesn't last (I will update), then its time to downgrade this review to one star and find a new mount.", "Date": "April 17, 2014"}, {"Title": "DASH CAM Black Box.", "Author": "B. Long \"Coach\"", "ReviewID": "R2NOO2VWAL9FEI", "Overall": "4.0", "Content": "It enabled my z-Tronix Dash Cam to be located on the dash rather than on the windshield where CA AB 1979 restricts location. Now I have full front clear view and camera has better front and rear view. I still had to fabricate a case to attach to the arm.", "Date": "March 15, 2014"}, {"Title": "nut cracks", "Author": "Pantucci", "ReviewID": "R28C0I4P9C7EMC", "Overall": "2.0", "Content": "This item, in theory, is excellent. I use it every day with a Contour Roam2. The suction cup works great. It has fallen off... but that is due to poor preparation. Making sure the suction cup is clean, and the area of the window where it will mount is clean, a little breath on the cup will keep it on there very well. It serves the purpose very well, and I would give it 5 stars.... accept the tightening nut cracked without any provocation. I don't remove the camera from this mount very often, and I am very careful when I do. One day the camera fell off the mount. I inspected it, and sure enough the nut just spontaneously cracked, rendering the whole thing useless.", "Date": "March 6, 2014"}, {"Title": "Sticks to the windshield, has a good hold", "Author": "IrvinQuick", "ReviewID": "RCDCIVH6LZ9Q0", "Overall": "4.0", "Content": "Sticks to the windshield to make a dash cam my contour camera. Holds well, I can't even pull it off! It only fell off once during the winter when I got really cold.", "Date": "February 21, 2014"}, {"Title": "Not flexible enough", "Author": "D. C Smith", "ReviewID": "RCWP8P4YMT7XU", "Overall": "2.0", "Content": "Had to return this model as I could not find a suitable position/angle to put my Sony point-and-shoot camera while in the car.  I bought a model that has a longer more flexible neck rather that the fix neck on this one.  My windshield is raked back pretty far (sports car) so maybe that's why.", "Date": "December 27, 2013"}, {"Title": "Great!!", "Author": "Unknown", "ReviewID": "R319LX0YBBZKKC", "Overall": "4.0", "Content": "Works great with one of my cameras! So I say get it if you camera the size as a Go Pro but if not then no!", "Date": "October 15, 2013"}, {"Title": "4 a small small camera", "Author": "jean", "ReviewID": "R2JGHVFXNABNNX", "Overall": "2.0", "Content": "right out of the package parts started flying . . .  the item was haphazardly thrown into a package bag and when it came out the mount was coming apart in my hands . . . . . so other buyers beware ..", "Date": "September 5, 2013"}, {"Title": "Great dash cam mount", "Author": "Evan Light \"bork\"", "ReviewID": "R12NN15PQEDCI2", "Overall": "5.0", "Content": "I use this with my contour for dashboard mounting while I am on the road. Great for the price! Highly recommended", "Date": "August 14, 2013"}, {"Title": "rock solid stable mount for dash cam", "Author": "BuyItOnce \"Just_Slightly_Geeky\"", "ReviewID": "R1HFR81NJQE93Y", "Overall": "5.0", "Content": "Dependable Arkon suction cup, the swing arm and ball head offers flexibility for the perfect angle and position in my car. Beats the original included mount by miles.", "Date": "August 8, 2013"}, {"Title": "Very good product", "Author": "C. Jack Swinden \"W5JCK\"", "ReviewID": "R11WH7G14LLAZU", "Overall": "5.0", "Content": "I highly recommend this product for use with smaller point and shoot cameras or camcorders. It does a very good job.", "Date": "July 12, 2013"}, {"Title": "It is ideal", "Author": "Kalman Torocsik", "ReviewID": "R1JZ2EZGXAWOAL", "Overall": "5.0", "Content": "I use it with a CamOne Infinity and fits perfectly. It fixes the camera inside the car stable and I could use during car caring safe.", "Date": "July 5, 2013"}, {"Title": "Great replacement for Smartcam 2 mount", "Author": "Daniel Dance", "ReviewID": "R1NA1F1FIL5F6L", "Overall": "5.0", "Content": "So far, this mount has been a great replacement for the one that came with my Smartcam 2. That one had a plastic disc inside the suction cup, which broke all the way around after just a few months. As far as I can tell there is a metal plate inside the suction cup of this mount, which will prevent a similar scenario from occurring.I also like how the attachment point is connected to the rest of the mount. The ball joint allows me to easily adjust my dash cam to get the right view.Update 3/2014:I have now found that it has trouble attaching during the cold in winter. This appears to be because the plastic becomes less flexible while cold. It will either not stay on at all, or fall off later. I was able to fix this by placing it down in the floor by the vent and waiting for it to warm up. It would then stay attached. For when I'm at home I simply keep it in the house until I leave so that it is already warm enough.Other than that it has continued to perform quite well.", "Date": "July 4, 2013"}, {"Title": "Strong, heat resistant plastic, with one flaw.", "Author": "Daniel P. Royer", "ReviewID": "R3HWRG40W7V4H1", "Overall": "4.0", "Content": "After using this mount for a few weeks now, I can personally attest that it withstands extreme heat when permanently mounted inside a car. The only defect in the product is a very thin rubber seal around the ring where the screw is that has already melted in the sun, but the screw has stayed secure. If anything, the melting made the seal even tighter, and took some effort to remove it with a wrench in order to upload my dash cam footage to my computer. Other than that seal, the plastic that makes up the rest of the product hasn't melted at all, and is very strong.", "Date": "June 4, 2013"}, {"Title": "ARKON CMP214 Windshield and Dash Mount for Cameras with 1/4 20 Screw Thread..", "Author": "Fernando A. Pinto", "ReviewID": "RN107ORBMNMXL", "Overall": "5.0", "Content": "Very good product. this can be use for differents king of cameras and video recorders. Can be attached to the windshield or outside the car in any flat part.", "Date": "May 28, 2013"}, {"Title": "Good suction...Works very well", "Author": "Aj Thomas \"Aj Thomas\"", "ReviewID": "RJF124DQGSY34", "Overall": "5.0", "Content": "This mount has a very good suction...I didnt mount any heavy cameras...I use this to mount ContourROAM Hands-free HD Camcorder and this mount holds the camera without any shake.[http://www.amazon.com/Contour-1600-ContourROAM-Hands-free-Camcorder/dp/B005GLFSYQ/ref=sr_1_2?s=electronics&ie;=UTF8&qid;=1367854793&sr;=1-2&keywords;=ContourROAM+Waterproof+HD+1080P+Hands-free+HD+Camcorder]", "Date": "May 6, 2013"}, {"Title": "Excellent product at a great price.", "Author": "Tin Man", "ReviewID": "R1DYFJDU4I9P6C", "Overall": "5.0", "Content": "This dash mount is small (tucks away behind mirror) and well built.  The suction mount works well and the unit does not fall off once mounted to window.  At a price one third that of other brands it's an incredable buy.  Would strongly reccommend it to anyone looking for a camera mounting system.", "Date": "May 3, 2013"}, {"Title": "Reasonably sturdy,  easy to use", "Author": "UpstateSC", "ReviewID": "R1OCWYGM6SMUSP", "Overall": "3.0", "Content": "This seems OK for use with my Contour Roam as an inside windshield mount.  There is a modest range of angle adjustment, but the pivot screw at the base of the stalk is easily removed, and the curved stalk can be flipped, giving you some options.", "Date": "April 18, 2013"}, {"Title": "Good Mount for Contour ROAM", "Author": "Fareed Jameer", "ReviewID": "R1SXVMG4GQFV6E", "Overall": "5.0", "Content": "The Suction Cup works great and all the parts hold together nicely.It simple to use and easy to mount and release.I would recomend this product", "Date": "April 10, 2013"}, {"Title": "Good camera mount, could be better", "Author": "FES", "ReviewID": "R1G8S7HY9V1WYJ", "Overall": "4.0", "Content": "I havr this unit mounted on the dash of my motor home.  We travel a lot and like to get images of the road/scenery.This mount works well with the exception for where the camera mounts to the camera.  It is not as solid as I would like, the camera rocks a bit side to side,  The videos are OK, due the camera having image stabilization.", "Date": "April 6, 2013"}, {"Title": "Excellent product", "Author": "John Martinez", "ReviewID": "R3FU4C2HDNKSNP", "Overall": "5.0", "Content": "I bought this for my dash cam and have got to say it works and looks great. The mount firmly holds my camera steady and makes it simple to remove the camera when not in use. This was a great value and I'm glad to own it.", "Date": "April 2, 2013"}, {"Title": "Not for curved glass", "Author": "G. Adams", "ReviewID": "R3TLKB7YBSGEGE", "Overall": "3.0", "Content": "I purchased this hoping to use it on the inside of an aircraft canopy.  It doesn't stick very well on places where the glass is more than just slightly curved.  My camera fell off a few times before I gave up on it.  I have, however had nothing but success attaching it to the inside of car windows.", "Date": "March 20, 2013"}, {"Title": "thanks", "Author": "Thomas Allen", "ReviewID": "REHRUQG4V3GXP", "Overall": "5.0", "Content": "works great, thanks, I'd tell friends about it .. . . . . . . . . . ..  . .", "Date": "March 18, 2013"}, {"Title": "easy", "Author": "gabalot", "ReviewID": "R2STIQORKO8SPD", "Overall": "5.0", "Content": "This is easy to use on the windshield and the swivel adjustments are not difficult.  I'm not sure what the round plate thing is; but seems it is intended to stick onto the dash to have a secure place for the suction cup mount to adhere.  I haven't had to use that yet.", "Date": "February 21, 2013"}, {"Title": "Sturdy, bargain price", "Author": "Lieven Leroy", "ReviewID": "RDFRNVXCA3TKO", "Overall": "5.0", "Content": "Simple and easy to adjust, a good deal for the price. I used it to mount a small video camera on the inside of my windshield, recording the road ahead of me. Held in place well.", "Date": "February 18, 2013"}, {"Title": "good product", "Author": "eurorom", "ReviewID": "R1W8UHTYOFD87U", "Overall": "3.0", "Content": "did not work on my digital camera, good product I need an angle that only works outside of my windshield", "Date": "January 19, 2013"}, {"Title": "great value on a flexible mount", "Author": "GG", "ReviewID": "R3VGD6KPU3LWO7", "Overall": "4.0", "Content": "sticks to prety much what ever I try to stick it to, has beem on my motorcycle as well as the hood of my car and stayed without a hint of giving way.", "Date": "January 10, 2013"}, {"Title": "Great for vlogging", "Author": "Brandon C. Diamond \"BDiamond\"", "ReviewID": "R1T1VLVFD9HKY4", "Overall": "5.0", "Content": "I use this as part of my YouTube channel to film vlogs in my car. Suction cup is strong and mount works well.", "Date": "January 9, 2013"}, {"Title": "works well", "Author": "Russell C. Lawrence", "ReviewID": "R1ILP07G4IX4HA", "Overall": "5.0", "Content": "hold the camera,,,  does as advertized  they require 14 more words to post...  dumb rule words words words words words", "Date": "December 10, 2012"}, {"Title": "Video mount CMP214", "Author": "Tom", "ReviewID": "R1SLVW22CWS232", "Overall": "2.0", "Content": "I was unable to use this product as a camcorder mount on my motorcycle. Too much flex. However for use in a car it might work, and on a table or window in you house I think it would be great. So it depends on your need and the price is great.ARKON CMP214 Windshield and Dash Mount for Cameras with 1/4 20 Screw Thread", "Date": "September 26, 2012"}, {"Title": "Works well with small modification", "Author": "Sandika Peiris", "ReviewID": "RLWZ12QTMSPKX", "Overall": "5.0", "Content": "It works great, and keeps suction well. I use it for a video camera. as says on review comments the boom is very small and you will not able to mount a camera in the windscreen to record out side video. with a small modification (check the pictures for the modified unit), thanks to home deport (spending $2) you can extend the arm. Vibration is minimum.", "Date": "July 21, 2012"}, {"Title": "DO NOT PURCHASE", "Author": "Etzio", "ReviewID": "R3MVHJXYS0ZOPT", "Overall": "1.0", "Content": "I bought this product and upon inspection realized that the nut which completes the ball joint where the camera sits was missing. I returned product thinking someone made an error while packing and had amazon send a new one. New one is also missing nut, which is clearly shown in the product picture, so it seems like it was more than a simple mistake. Amazon should stop selling these until they inspect their stock. I am going on honeymoon next week and running out of time.", "Date": "September 5, 2012"}, {"Title": "DONT BUY", "Author": "Phillip Edwards", "ReviewID": "R7JRK2Y5OK0A6", "Overall": "1.0", "Content": "Fell Apart, screw falls off an wont go back on, angle wont work with most cameras, waste of money. its what cheap will get you", "Date": "August 27, 2013"}, {"Title": "Doesn't work!", "Author": "Carl A. Mcneece", "ReviewID": "RA8Y7H15CJ1GQ", "Overall": "1.0", "Content": "Great idea, but it just doesn't work.  I attached a small camera (about the size of a cell phone) to this tripod and attached it to my windshield.  It would only stay for a few seconds, then it fell off the windshield. I tried it several times in several locations, and the same thing happened.  If you use this product, be sure to position it so that your camera won't be damaged when it falls.", "Date": "May 16, 2013"}, {"Title": "this unit does not work", "Author": "Phuong Nguyen", "ReviewID": "R20EJ4677GPOWF", "Overall": "1.0", "Content": "I couldn't use this unit, the dash mount did not stick on the dash and the suction cup did not suck on the windshield firmly", "Date": "March 2, 2013"}, {"Title": "Angle Limitation", "Author": "NCA Prime", "ReviewID": "RIAAIUAD050JO", "Overall": "2.0", "Content": "As mentioned by others, there is limitation on how far this arm can swing.This mean, it is not really designed to be mounted on the inside windshield & pointing outside.  I experimented by mounting the camera outside, but then the camera became more sensitive to wind and vibration.", "Date": "February 5, 2013"}, {"Title": "cheap stuff on amazon", "Author": "Cuzzin It", "ReviewID": "R1K9RYK1LMVTZG", "Overall": "3.0", "Content": "not high quality material. if i had known i would have gotten it from walmart and spared the hope of getting something that might last awhile", "Date": "July 29, 2013"}, {"Title": "Hmmm!", "Author": "Robert L. Thomas Jr", "ReviewID": "R2YFF2QQFDOG27", "Overall": "2.0", "Content": "Never opened the package, I am sure it works fine but, it does not fit what I am looking for", "Date": "May 28, 2013"}], "ProductInfo": {"Price": "$19.95", "Features": "Compatible with smaller digital cameras with 1/4\"-20 mounting pattern\nWindshield suction performs well in hot climates and attaches easily with one-touch lever\nSupported by Arkon's 2-year limited warranty", "Name": "Arkon Windshield or Dashboard Camera Suction Mount for Sony Action Cam JVC ADIXXION and 1/4\"-20 Compatible Digital Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/41EF5V1J1kL._SY300_.jpg", "ProductID": "B00585CLY0"}}