{"Reviews": [{"Title": "?????", "Author": "B. Bond", "ReviewID": "R2028W81UN8EIL", "Overall": "1.0", "Content": "Does not work well at all. Sometimes it takes a video and most of the time it doesn't, even if it's the same person standing in the same place. Videos are too short to see anyone do anything anyway. We're trying to catch people stealing and this camera is useless.", "Date": "September 25, 2011"}, {"Title": "This is a joke; it just does not work!", "Author": "Viva Cuba Libre \"Libertad\"", "ReviewID": "R2S78Q321NAZPH", "Overall": "1.0", "Content": "First of all, it triggers randomly: lots of pictures have nothing in them. When testing it further, it clearly did not trigger most of the time.In addition, the batteries (4xAA) are discharged in about 24 hours.I do not know who designed this piece of junk; it is the worst of china-made jumk I have ever seen!Avoid this like the pest! If not you will be frustrated!", "Date": "December 25, 2011"}, {"Title": "Works off and on", "Author": "George A Jones", "ReviewID": "R1ZRNLP1KCV8KU", "Overall": "2.0", "Content": "I am not pleased with this camera.  My wife purchased it as a gift for me.  The camera leaks, takes video sometimes but a lot of blank spots.  The camera totally stopped working for a while I thought it was the batteries so put new ones in it and still nothing.  I let it sit on the table for about three weeks (was going to return it but got too busy), and put fresh batteries in it and it worked again for a few months.  It has now stopped again, even with fresh batteries.", "Date": "January 14, 2014"}, {"Title": "GREAT IMAGE QUALITY", "Author": "ROBERT", "ReviewID": "R3MDBVR634KC30", "Overall": "5.0", "Content": "I USED IT FOR HUNTING AND I WAS ABLE TO ATTACH THIS CAMERA IN THE WOOD AND I WAS ABLE TO GET A IMAGE FOR WILD ANIMALS", "Date": "October 6, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Covert Day/Night Surveillance Camera With Dvr Ideal For Remote Locations\nRecords Multiple 2.0 Megapixel Images Or 30 Fps Videos Onto Included 2 Gb Secure Digital Card(TM)\n32-Ft Night Vision\n55° Viewing Angle\nLong-Lasting Battery & Motion-Activated Recording", "Name": "Swann Outbackcam Camera & DVR SW361-OBC", "ImgURL": "http://ecx.images-amazon.com/images/I/51-XOOArPKL._SY300_.jpg", "ProductID": "B00546E7AY"}}