{"Reviews": [{"Title": "Inaccurate Picture, these are not audio/video baluns, they are only video baluns", "Author": "Twain", "ReviewID": "R21TOYVBFDPGN3", "Overall": "1.0", "Content": "Picture clearly shows audio/video baluns, but alas, they are not. These baluns only have a power connector and a coax connector and I REPEAT THEY HAVE NO CONNECTION  FOR AUDIO. THESE ARE VIDEO BALUNS ONLY. Amazon please change the picture!", "Date": "August 15, 2013"}, {"Title": "Very nice in general", "Author": "C. Arnold \"Multimedia shtick\"", "ReviewID": "RK8LJ8MI421LU", "Overall": "4.0", "Content": "These are very nice but the design for the camera end will not slip through a hole smaller than 1\". Even then with everything connected getting it through a 1\" hole is very difficult making mounting a bit of a challenge in some hard ceilings/eves where crawling can be difficult. The small bullet cams I was installing could only have about a 3/4\" hole before their would be nothing to mount too so I had to crawl to connect rather than connect and mount.This also worked to connect a Samsung analog CCTV PoE camera [built in data wire with RJ45 end] to my swann d-1 DVR and have a separate power supply for it and run the swann cams on a Samsung PoE DVR. The wiring in the units should work for any EIA/TIA 568B configured CCTV PoE device [power on the blue pairs].", "Date": "July 18, 2013"}, {"Title": "good product", "Author": "Mike", "ReviewID": "R2UQYGSJ2Z1ZVM", "Overall": "5.0", "Content": "I used these outdoors and they are great.  Simple and easy to connect CCTV cameras with UTP cable.  good product.", "Date": "June 18, 2013"}, {"Title": "Perfect for our Q-See system", "Author": "Brian", "ReviewID": "R1J7IO7UPTQ07K", "Overall": "5.0", "Content": "I used these balun transceivers so that I could use the more \"future-proof\" cat-5 cabling for my cameras (for running HD IP cameras when I upgrade next time), rather than the coax cable that the Q-See system I was installing came with.  These work perfectly.  Picture quality is the great, and the being able to run both video and power over one cat-5 cable is very convenient.", "Date": "June 17, 2013"}, {"Title": "Work Perfectly", "Author": "Diver", "ReviewID": "R2HCMH4H4BXCDX", "Overall": "5.0", "Content": "Not sure these are available any more however they worked perfectly.  Couldng find them so ordered the ones with audio and they are terrible!!", "Date": "February 19, 2013"}], "ProductInfo": {"Price": "$8.04", "Features": "Product Name : Video Balun;Material(External) : Plastic, Metal;Color : Silver Tone, Black, Gray\nVideo Input/Output : BNC Male;Power Input/Output : 2.1x5.5mm Male/ Female;Transfer Distance : Up to 100m\nPower : DC 12V;Impedance : BNC: 75ohm, UTP RJ45: 100ohm\nFit Cable : UTP RJ45 Cat5(not include);Adapter Size : 4.3 x 2.2 x 2.2cm/ 1.7\" x 0.87\" x 0.87\" (L*W*H)\nWeight : 62g;Package Content : 2 x Video Balun", "Name": "Gino 2 x CCTV Camera UTP BNC Male to RJ45 5.5x2.1MM Power Video Balun Transceiver", "ImgURL": "http://ecx.images-amazon.com/images/I/41dim9pR24L._SX300_.jpg", "ProductID": "B005FOS8XM"}}