{"Reviews": [{"Title": "DVR is Great but the Cameras Suck", "Author": "bs143091", "ReviewID": "RC27GX220OVT9", "Overall": "3.0", "Content": "As the title says the DVR is great but the cameras suck.  This would be a five star review if, after having the thing set up for only two months, one of the cameras hadn't burned out.  They say these cameras are indoor/outdoor, but I had a professional install the system and he said that they were very iffy for outdoor use.  He set the camera way back under an eave and it has been fine for two months, and then I go to check it last night and all there is is a blank screen with the occasional flicker of light.  Again, the DVR was installed by a professional, but it didn't take him long.  He said the connections were quality and the DVR looked quality, but the cameras were not.  I found it very easy to network the DVR and had it up and running over the web in a couple of days.  All of this was going to lead to a five star review but then the camera led to three.  I didn't expect the best in the world out of an under $500 system, but I expected the components to last more than two months.  Bottom line, get it for the DVR, get it for indoor cameras, but if you're going to put it outdoors I would order another system or plan to upgrade the cameras quickly.", "Date": "January 26, 2012"}, {"Title": "Peace of mind", "Author": "Bernadette Mitchell \"Lady Di\"", "ReviewID": "R1AM1JPKB0KOTW", "Overall": "5.0", "Content": "This is the best investment I have made for my home.  It is perfect protection of knowing who is at the front door before opening the door.  I don't even use the peek hole anymore. It has already paid for itself. Unfortunately, my neighbors got robbed instead of me. The police said my cameras deterred them from my home. I am able to feel at ease and able to see what is going on outside without looking out the windows or endangering myself by going outside. It is great for single people, elderly, sick individuals.  This will give the family peace of mind.", "Date": "April 24, 2012"}, {"Title": "Outstanding Security System", "Author": "John Kranick", "ReviewID": "R2SG62I546KTH2", "Overall": "5.0", "Content": "This system was easy to install and even easier to operate.  So far (4 weeks) the system offers excellent picture quality at a very fair price.  We recently purchased another to help expand our coverage.", "Date": "September 16, 2013"}, {"Title": "Good value, exactly what we needed", "Author": "Liz Wilson", "ReviewID": "R1QBSCDKCUQ4DF", "Overall": "5.0", "Content": "I have Night Owl security systems in all of my locations.  They are easy to set up and install, and I was able to quickly configure them for remote access.  We use the 3g function for our iPhones and Androids all the time.  These systems were definitely worth the investment.", "Date": "August 13, 2013"}, {"Title": "Thumbs up!", "Author": "TR", "ReviewID": "R2F0C86RPC4SGR", "Overall": "4.0", "Content": "This is a wonderful camera, the set up was very simple. My would not recommend using this behind glass at night because the night vision lights causes the view to be horrible.", "Date": "May 23, 2013"}, {"Title": "Expense vs Effectiveness", "Author": "Chad", "ReviewID": "RLSHKK4JX1KC", "Overall": "3.0", "Content": "Still tinkering with but the home surveillance DIY market needs to mature a lot yet.  I bought this knowing that the cameras were inferior so I'm not expecting much from them (they are doing good though - minus interference patterns).  I bought the package for the base unit and will upgrade the cameras over time.  The base unit makes a lot of claims on what it can do but be realistic that low price in this market will translate to lower quality.  I applaud their efforts because it is good with features in bringing together camera lines but I do have common rants to address that really tend to be similar to any DIY device you get in this market yet.> Only works with IE and you have to tinker with your security settings since it's not signed software.> Cannot try the mobile piece (I don't buy things with Ithis and Ithat in the name)> Motion detection only works in very still areas.  Don't even try in an outdoor situation.  Something will always trigger it falsely.> The web browser functionality is limited vs the functions at controller itself.  Ever try to type letters with an on-screen keyboard you have to click on letters with only a mouse?> I was thinking on buying this solution for another location but I think I'm going to hold out for another year to see what else comes along.So it's OK but I'm still looking for a better DIY product that I don't have to spend a fortune on and not have to go to subscription plans either.", "Date": "May 18, 2013"}, {"Title": "Excellent Product", "Author": "Patsy Johnson", "ReviewID": "R3T1Z9V0BOO5LM", "Overall": "5.0", "Content": "I have had this product for one year - It was very easy to install. It came with enough cables to reach everywhere I wanted the cameras. I purchased 4 other cameras to add to the 4 that came with it. I am going to replace this system with a 16 channel (camera) one - I will keep with the Night Owl. I really like being able to view my cameras anytime and anywhere using my cell phone. This is a free service when you buy Night Owl. The last thing and one that is very important is their customer service..nice, knowledgable helped me everytime. I highly recommend this system.", "Date": "April 14, 2013"}, {"Title": "NO HDMI output nor HDMI cable. Camers power supply cheesy, caused horizontal fuzz lines.", "Author": "tuned", "ReviewID": "R14SKQWYW7VFL8", "Overall": "2.0", "Content": "1/2/2013: UPS delivery speedy.  Immediately noticed NO HDMI output nor HDMI cable! Used BNC-RCA, but had to unplug dvd from tv  :(HDMI extension cable I bought also is useless for it. Did get partial refund or I WOULD HAVE SENT IT BACK.1/11/13: Swapped camera power supply, picture is clear. Used N-O ps for IR illuminator.Bought an Evertech 3.6mm (slightly 'fisheye') lens camera, an improvement in field of view over original 6mm.  I would never buy 6mm lens (they come with orig. systems). Day and night vision a little  better in clarity and color than original 400tvl cmos.  IRs light up well at least 40 to 50 feet. 2x big as original 400tvl cmos with sturdier mount.  If this is using Sony Super HAD II chip it's not doing it right!, it was $56. Good enough to keep until I get a full Sony and move this one to the back. Then bought CIB cameras 3.6 mm with 'Sony HAD' (not Super HAD II) chip 460 TVL $29 which are even better (go figure)!NOTE!!!  Getting a better camera(s) is useless if you cannot record at the 30 fps (images per second) setting on the DVR or NVR. The image resolution is degraded at less than that, but it is crucial to good facial recognition. This is is big problem with most DVRs that they do not tell you (some will not do 30 fps on all 4 even then). This one will do D1 on only 1 channel (the software shows 240 frames available, but that's only at CIF). If it claims at least 120 fps total then you can be fairly sure it can allow up to 30 fps per camera at CIF (lowest resolution). Do the research on the DVR  FIRST!!  Look for FPS claims do be at full D1 or you will probably be disappointed for the price. System survived days of 'monsoon'. Cameras are under the overhangs. I would make overhangs out of cheap plastic shoeboxes or whatever for any not rated waterproof if I had to.Camera mounts seem to be missing plastic bushings in mount swivels, I had to improvise . Night Owl offered to exchange cameras but does not mess with parts. I made do since I already had them mounted. I would not have known this unless I tried to test mount them somewhere easy before installation, oh well.Lesson (relearned): ALWAYS TEST AND EVEN TEST-MOUNT EVERYTHING BEFORE INSTALLATION!Camera cables are very thin and delicate. Wiggle them wrong and picture goes out (Defender units are same included cables), I  found ways to reinforce and secure them when mounting. Painter tape (blue) holds until caulk or construction adhesive (liquid nails, etc.) dries, then comes off easy without damaging finishes. Camera video quality is not great. I have also had Defender 480 TVL cmos no better than these 420 TVL cmos. I tried swapping a 2.1mm fisheye lens into the little ('disposable' at $100 for 4)N-O camera on back porch. The lens cannot sit far enough out in the holder body to focus and still have the camera front cover fit down over it nearly enough to twistlock closed. I sealed it on but do not expect it to last. The wires inside are a few hair widths wide, so naturally the IR red power wire came off its' solder. The gasket is the same thinness for the glass outer cover. The 2.1 lens barely fits inside the IR ring anyway, the lens must be held while turning the cmos body from the back. Before the old lens is removed the tiny set screw must be loosened a lot. Focusing the 2.1 lens by threading it in and out should be done at the 'bench' unless you want an hour a day walking like I do every day. Overall a good learning experience, and now I know I prefer the 2.1 to 2.8 mm over 'bigger' ones for the broad 'somebody is there' coverage. Other lenses are better for the doors cameras. No worrys, I have a separate IR illuminator for the porches anyways.The camera power supply splitter is short, it has to be very close to the unit. I will update as I go through installation and longevity. I would NOT buy this again, look for D1 recording on all channels. Better to buy two 4channel DVRs (and another monitor) that can do all four at D1 than this!", "Date": "January 2, 2013"}, {"Title": "DVR is OK Cameras have a narrow field of view", "Author": "Clyde G.", "ReviewID": "R3D7R7NDJ807XC", "Overall": "4.0", "Content": "Good basic starter system for the price. Camera quality is ok for 400 TVL.  Lenses are 6mm- approximatly 40 degrees FOV.  I had to upgrade a few cameras for better coverage.", "Date": "December 21, 2012"}, {"Title": "Good system", "Author": "Caddyroyalty", "ReviewID": "R3QWP4O1105WCT", "Overall": "5.0", "Content": "I've been using this for a year now and its great. I've got mine recording at D1 resolution, emailing snap shots on motion, and is viewable on my phone. Setup was a little tricky but if you read the instructions its doable. The stock outside camera's do slightly glow red at night so you can see them. My camera's are installed under eves to they are out of direct snow/rain and haven't failed me yet.", "Date": "December 10, 2012"}, {"Title": "FOUR STARS", "Author": "Nancy Anderson", "ReviewID": "R1L7BJPCYOEJXP", "Overall": "4.0", "Content": "For the price it was an excellent value, easy to install, etc.  The only thing I don't like is the cameras don't PZT, so they get a larger view than I need for inside.  But otherwise, excellent value.", "Date": "December 8, 2012"}, {"Title": "Night Owl", "Author": "Terry Strednak", "ReviewID": "RPT94O1LB1L9F", "Overall": "5.0", "Content": "Extremely easy to install and difficult to see until after images are on hard drive.  Infra red camera takes great night shots but makes camera more visible in dark due to LED's that provide lighting.  Resolution is lacking slightly in that things such as license plates are extremely difficult to read even under best conditions.  For the price the quality is more than fair.  I plan on buying more myself.", "Date": "November 28, 2012"}, {"Title": "Poseidon 45", "Author": "Raiff", "ReviewID": "R1YOVG6AWO1RZ3", "Overall": "3.0", "Content": "good cost benefitRecording in real timebut the cameras work best outdoorslose amplitude in small spacesgood for home use", "Date": "August 17, 2012"}], "ProductInfo": {"Price": "$499.99", "Features": "Pre-installed 500GB or 1 TB SATA HD\nMotion activated email alerts\nViewable over Smartphones, PC's and Tablet PC's. Connects directly to your TV or monitor (HDMI/VGA/RCA)\n4 color indoor/outdoor night vision 30' cameras\nIncludes: UL power adapter for DVR, HDMI cable for connection to your TV, Ethernet cable, mouse, remote control, security stickers and support material", "Name": "Night Owl Security POSEIDON-45 8-Channel H.264 500 GB DVR Surveillance Kit with 4 Indoor/Outdoor Night Vision Cameras and D1 Recording", "ImgURL": "http://ecx.images-amazon.com/images/I/41nRAugwJhL._SY300_.jpg", "ProductID": "B00507BDF4"}}