{"Reviews": [{"Title": "Best outdoor camera for the bucks. Pretty easy to setup too!", "Author": "D. Leonardo", "ReviewID": "R2IR94H4OSM2IK", "Overall": "5.0", "Content": "I usually don't write review on Amazon but I specifically want to spend some time to review this product. So, I was looking into an outdoor camera for my house, after much research, I decided to get Foscam for their quality and value. I saw in this review, there are a lot of people having problem setting up their camera which includes an IT guy. I'm myself an IT guy so I was kinda worry when I saw that kind of feedback from other IT guy.So after I order and received this camera, I got it working right away and set wireless, virtual server (port forwarding), giving dynamic DNS, etc. in about 30 mins. I don't even install the included software. Seems pretty straight forward to me. So here's the step I did.1. Plug the camera using the power supply to an outlet and the CAT5 cable to the back of your router.2. Go to your router backend (usually 192.168.0.1), login and see from status if there's a new device attached to it (the camera name itself as \"UNKNOWN\" or simply no name), you should see some IP like 192.168.0.101, etc.3. To test it, go to the IP you see on the browser ex. [...] - if it loads up then you are good!4. Then you login to the camera backend interface as \"admin\" with no password, from there I setup my WiFi5. You need to click scan twice in order to saw the access point list, once it show up, choose your connection and put in your WEP or WPA key if you have your WiFi secured then hit submit6. To test your WiFi, just disconnect the CAT5 cable and then the power supply then reconnect it again. Wait for a little while and go back to your router management website and see if there's any new Wireless device connected.7. Once you see the new wireless device, write down the IP and try to connect using your browser.8. After that you can use DHCP reservation to make sure your camera have static private IP. Remember: Wireless and Wired connection have different MAC address so make sure you reserve the correct one (you should be able to see the MAC address for wireless and wired at the back of your camera, top right is for wireless)9. Setup a virtual server / port forwarding so anytime you want to access the camera from the Internet anywhere in the world, you could do that. For example, forward any port 7000 to your camera IP ex. 192.168.0.101 and port 80. Then setup a dynamic DNS from your router so it will be easier to remember (most router should support it, I know my DIR-601 does). If not, then you can setup up the dynamic DNS within that camera itself.10. Setup your mail settings / FTP settings from the camera backend, remember you have to hit submit first after you enter the information BEFORE you can hit the test button.11. I have tried using motion detection and it send out to my email just fine.I guess that's it. I think it took me longer to write this review than setting up the camera but I hope you guys can learn more from this.Some people may deduct 1 start because the manual is almost useless and written with poor English. But any IT guy should be able to do it without even reading the manual. The product itself is great and the night vision is awesome (I just wish there's a switch to turn off the night vision so it doesn't show glowing red at night when I don't want to use it).", "Date": "August 12, 2011"}, {"Title": "Avoid this Camera", "Author": "AVSJ \"FlyingBlind\"", "ReviewID": "RPAUI86109S8B", "Overall": "1.0", "Content": "I must say I've read all of the other reviews before purchasing this, so I was warned.  Unfortunately, I still had questions after reading the reviews and the only way to answer them was to have a camera in hand.THe FOSCAM camera brand is not all bad; the indoor cameras are quite worth the money and function superbly.  This OUTDOOR camera, however, is one to avoid.It wasn't particularly difficult to install.  All the other reviewers focus on the network setup.  I'll say only you have to know your way around your router to be able to make this work wirelessly.  No step-by-step procedures from me: they're avialable elsewhere.My complaint is twofold:  the design of the camera and the quality.As the camera is supposed to be an outdoor camera, I give it an \"F\" for design.  It has a huge tri-purpose cable leaving the back of the camera that cannot be disconnected from the camera.  On top of that, it has a massive ethernet jack at the end to plug in to the computer, a jack to connect the decidely INDOOR power supply and a reset button (all connected to the cable).  The idea is that you run this all-weather cable INTO your house and if you need to connect to it later you can do it.  My question is, How?I would rather have an easy way to DISCONNECT the cable from the camera and BRING IT INSIDE than have to haul a computer up to my attic to plug it in.  Also, I had to drill a 1.25 inch HOLE in the facia to get this monster connector through. Poor poor poor design.The second complaint is quality.  The camera is only 30 feet from the router yet it updates maybe every 3-5 seconds.  Not really video as much as a lot of stills.  It also has a very narrow field of view that, when mounted under the eaves of my two story house (all the way to the side of the house) it barely allows visibility to the front door stoop centered on the front of the house.  To cover my front door and the approach, I actually need 2 or 3 cameras.  Very disappointing.After having it only 2 weeks it also appears to be failing now - not connecting on the network despite many trip up to the attic to press the conveniently located \"reset\" button.The fact is, I ordered the two-pack of the camera and one is working like a champ (but 50% is still an 'F' in my book) - although it has inaccessible cable connection because of the difficulty in running the wire into the house (I actually have it connected to a LONG extension cord that hangs down the side of the house into a backyard socket - but I had to DUCT TAPE the indoor power supply to make it all weather.)I don't know the answer to your question of \"What kind of outdoor security camera should I buy\", because I'm still looking.  The FOSCAM Outdoor Camera didn't meet my expectations and unless you have VERY unique and convenient mounting requirements, you'll be disappointed too.", "Date": "February 9, 2012"}, {"Title": "nice cameras for the price", "Author": "G. Jeronowitz", "ReviewID": "RCHZ6P9DKUR4L", "Overall": "4.0", "Content": "Setup requires you to connect via ethernet, and find the IP address of the camera (If you run windows, they provide a utility for this step). I had to access my router to get the IP address of the camera.The UI is fairly straightforward for setup, and is very responsive. It would be nice if the documentation described the APIs that are used on the camera to make settings changes so one could script them, but this isn't difficult to figure out if you know what you're doing (I needed to change the brightness settings from daytime to nighttime automatically).The mounts supplied with the cameras get the job done, but are a little flimsy, relying on friction from drawing two opposing plates together against a ball joint to prevent movement. I had to use a small pliers to get the mount to a point where it was not moving.While the housing itself seems quite weatherproof, there are several connectors that hang off the unit, ethernet, reset, sound, power, and I am unclear as to the suitability of those connectors to weather exposure.  In my application, however, I can get those connectors to a dry place.The antennas on these units are fixed at a right angle. They can only be adjusted by rotating the mounting nut. There are other brands of this type of camera that allow the mounting nut to be fully tightened but still allow the antenna to rotate on two axis for best signal strength.The IR emitters are quite bright, but are narrowly focused.  With the 6mm lens that shipped with my cameras (I was expecting the 3.6mm lenses) the field of view would be completely illuminated by the emitters.  With the 2.8mm lenses I have since installed in the units, there is a very distinct illuminated circle in the center  of my image at night. This is no fault of the camera, as the 2.8mm lens is well outside the design parameters of the camera.For me, the cameras shipped with outdated firmware. Foscam's website has an update available but to get it you must enter your email address and sign up for their newsletter via email; they then email you the links to the firmware update.  Seems kind of scummy to me, firmware updates should be freely downloadable from the website without having to agree to get newsletter spam.Cameras that do what these do, from brand name sources, cost upwards of $300 and don't have much better image quality from what I've seen.", "Date": "December 24, 2011"}, {"Title": "this camera is good", "Author": "E. Rafei \"enr001\"", "ReviewID": "R8HR45UZXYYU3", "Overall": "4.0", "Content": "I have set up 5 foscam cameras over the last year, the first time it took me forever, now it takes about 15 minutes to get the cameras to do the minimum: send me emails when motion is detected and allow live monitoring.The camera works well for security purposes i.e I don't expect HD imagery, but I get enough clarity to tell if it is my wife, my kid or a stranger.  Actually this outdoor model decent resolution and accurate colors, the picture on the package does reflect what to expect, assuming adequate ambient light.  Every now and then, the camera will flicker and the colors will go crazy for 1-5 minutes, it happens once or twice a week, not sure whyBottom light: Buy WIFI  I have experimented with several different brands and models of security cameras in the past few years, most of them are now in my junk drawer, WIFI this is by far the best design ..within my +/- $100 budget. The best as far as picture quality and ease of setupPros: reliable, looks sturdy, meets my basic needs, the first camera I configured over a year ago, and it has been pretty reliable. Another pro: phone APPS: IPHONE, IPAD and drone apps, tried several, they do work wellCons:  this fat pig tail with reset button, internet and power connection is awkward, I will use a junction box to hide it and to protect it from the elements.  The software is antiquated and needs updating", "Date": "August 9, 2012"}, {"Title": "Foscam pro and con", "Author": "mistysue", "ReviewID": "R39XKI4SJC9LXV", "Overall": "4.0", "Content": "This camera has outstanding long range views - however, if you need it to cover just your front of the house or garage it is much too powerful - would work really well for large parking lots and mounted very high - or, you could use it to survey the entire neighborhood - the 30 degree lense gives you a very narrow close up range - again, as you look down the block you get great views - put it across the street and point back to your house and you would have a good view - just need power there!", "Date": "November 25, 2011"}, {"Title": "Fantastic for long range, but has narrow viewing angle as a result", "Author": "A. Pinner", "ReviewID": "R1NSU92XR96XIU", "Overall": "4.0", "Content": "I have set up the 905, 904, and the indoor 918.I am not an employee of foscam.  I am not a computer savy person.  I am a scientist.  I have never set up a wireless IP camera before...and just got a smartphone last month.  So, you could say a am truly a newb in the wifi world.That said... each of those models have been great.  I struggled with getting the cameras to go wireless, and did contact customer service at foscam (several were purchased through foscam, several through amazon).  They were helpful, but couldn't get them to work either.  I finally found the silly error we were making (my fault) and now they are working perfectly.  Now I can get a new camera to go wireless and recording out of the box within 5min.  It takes longer to find a spot to mount than it does to set up.  The Blue Iris software is a great additional purchase from foscam and helps with all the quirks in recording, etc... and think that is a must with these cameras.In order to set these up, you will need to know your router's username/password...your SSID, your shared key, and your security settings.  You will need to port forward (and/or set up as a virtual server).  Foscam will help if you purchase directly from them, but the instructions are outlined very clearly in the manuals.The 905 has a much longer range of sensitivity (than the 904)...which is longer than even the mega bright IR lights will reach at night.  But as a result it has a much narrower angle of coverage...even when I pull back the protective rain shield.  I would definitely recommend this camera for long range purposes.See also my other reviews for the other models I mentioned.", "Date": "December 10, 2011"}, {"Title": "Review", "Author": "Stephen Campbell \"Author\"", "ReviewID": "R2EDQ6BJ7VQFZ9", "Overall": "4.0", "Content": "The good:It is well made for the price. The external housing is either cheap metal or very good plastic.  It does come with the mounting gimbals and they are adequate.  I bought the add-on and it wasn't really necessary.Assembly? Go to the website. The documentation is a lot easier to read there and far more detailed.  Especially if you want to set up the advanced features. The software that it ships with is easy to use and you can get the wired version working quickly.The daytime picture is *** good. Within 15 feet you could easily do a facial recognition.  At 400 feet you can tell its a person and a dog walking by.The Bad:You must have an older router or one that can be rolled back to 801g/h. I have an N series and it can't be rolled back so now I need to figure how I want to do wireless.  Check your router first!  You'll need to assign static IP's too.Also the power cord is too short as are the network cables.  Maybe 5 ft. on the cable and 3 ft for the power.  Night time picture is not so great.For the price I am pleased and would buy it again.", "Date": "January 2, 2012"}, {"Title": "great for the price if you are lucky", "Author": "Nael", "ReviewID": "R49QTVDERAYD5", "Overall": "3.0", "Content": "They are great cameras they are outside cameras. They are night and day cameras. They produce great pictures. But they have large infant mortality. They die in the sun. They stop working or the picture is fuzzy or they stop working night time. The company keep shipping the returned cameras which you end up doing with the same issue over and over as the you keep getting bad cameras. It is hard to use them in commercial interests or at home as you have to keep shipping them back. Amazon is great. If they improve the product quality and stop shipping the returns then you would have great cameras.I finally found the issue with these cameras. it will not work as a certain angle or tilt. if you have one that will not be found or disconnects, then change the angle. if it stops working then internal harness or board is loose or disconnected.", "Date": "July 16, 2013"}, {"Title": "Terrible", "Author": "Gordon", "ReviewID": "R1PCW9FPVKSNDQ", "Overall": "1.0", "Content": "These hooked up but spent hours trying to configure them to work with my wireless router, then to get the port forwarding to work.  Bottom line, never got it going.  I acknowledge some technological deficiency perhaps, but my friend who was an engineer at microsoft also couldn't fix the issue....", "Date": "March 13, 2013"}, {"Title": "Issues", "Author": "Tom W", "ReviewID": "R3PEQNNK0DIXB6", "Overall": "2.0", "Content": "Wifi drops off unless you set up an FTP ping to keep the Wifi alive (I know this is a Wifi issue not so much with the unit but still a software update would cure this). The field of view is very narrow and the image quality doesn’t allow for face recognition unless the subject is very close. Night mode ROCKS for the most part very bright.", "Date": "January 10, 2013"}, {"Title": "Love the Camera Hate the Power Supplies", "Author": "Farmer Tom", "ReviewID": "R1JV2ZVIUYN9MQ", "Overall": "4.0", "Content": "I have purchased 4 Foscam FI8095W camera and they are all in production recording events around my farm.  I really like them and have them configured to view on my Iphone as well as send email alerts as needed.  The biggest problem I have with these cameras is that the power supplies last less then a couple of months.  I can't seem to figure out how to get the vendor to replace them so I've had to buy my own replacements...cost about $8 each.  The camera is durable and works well outside or inside.  Rain, snow, dust, heat, don't seem to impact the camera and they are easy to configure.  Just wish the power supply would last longer.", "Date": "July 2, 2012"}, {"Title": "Outstanding Camera", "Author": "IT Gadget Guy", "ReviewID": "R28M1IHGLL9TM3", "Overall": "4.0", "Content": "Deployed 2 of these to overlook our delivery truck parking lot. Great resolution and easy setup. Would have given a 5th star, but the wall mount could be more robust.I suggest using \"Thread Lock - Loctite\" on the mount threads to maintain seasonal tension if used outdoors.", "Date": "April 30, 2012"}, {"Title": "Great value, not too bad to set up", "Author": "Mike Thomas", "ReviewID": "R1BPYDS4JUNML0", "Overall": "5.0", "Content": "Good bang for your buck on these cams.  Comes w 6mm lens so it is not wide angle.  IR LEDs area very bright (take into account on placement of cameras). Setup was a bit tricky (reboot a couple times when setting up wireless). I've only had then set up for a couple days outside but so far so good...UPDATE - about a year later and this are still running strong on wireless, had to reboot them maybe once in that time, very impressed at this price point", "Date": "November 7, 2011"}, {"Title": "Foscam F18905W difficult set up", "Author": "David E. Hartzell", "ReviewID": "R1CH93576E0SNC", "Overall": "2.0", "Content": "I bought three of these and my comment is \"you get what you pay for\" they are cheap and work just ok.  Their set up instructions are a joke which makes set up very difficult and time consuming.  I finally gave up trying to get the motion alarm to work on one camera and spent an hour on the phone with a rep that I could hardly understand and obviously knew nothing about the camera and was reading from a script.  Her help was useless and a month later the alarm function still does not work on that one camera.  In addition, the motion alarm works sporadically on the other two.  If your not very familiar with configuring DSL/Cable modems and wireless routers you are going to have an impossible time getting these to work especially if your using a Mac.", "Date": "December 21, 2011"}, {"Title": "not a real crowd pleaser", "Author": "larry reiher", "ReviewID": "R304UNCIYWOFHQ", "Overall": "3.0", "Content": "first, one of the 2 units only worked hard wired.  wirelsee was DOA. i am returning the ONE unit to the supplier.  amazon was only going to allow me to return both for a refund. next, the unit takes GREAT pix in daylight and sends them to my email addr.  at night, i have it 60' from the street and when cars go by i get a BLURRRRR of a passing vehicle and a swath of car lights.  nothing you could use to ID the vehicle. when people walk by, they are more visible but still HARD to identify.  the manual is DIFFICULT to understand.  i phoned tech support and the nice Chinese man tried to explain things to me; the language barrier was a problem. when it rains at night, the camera sends pix every minute of a streak of raindrops.  a real pain to wade thru!  i dont know if there is a better solution since this is my first try @ wireless video surveillance.  but this leaves a LOT to be desired if you are looking for nighttime pix.", "Date": "November 29, 2011"}, {"Title": "Wireless connection?", "Author": "Timothy J Treinen", "ReviewID": "R29Y3MN4T8MYJS", "Overall": "2.0", "Content": "It works on hard wire but I could not make it work in wireless network.  Still trying to find where I can get help", "Date": "January 14, 2013"}, {"Title": "Disconnect from wired network.", "Author": "Ryan Weekly", "ReviewID": "RO4ZJJVT2PTTC", "Overall": "1.0", "Content": "They keep disconnecting on my wired network that are dedicated for these cameras. They are important and they just dont work.", "Date": "January 18, 2014"}, {"Title": "HELP!!", "Author": "Max", "ReviewID": "R3IF2EDK3LXRCR", "Overall": "1.0", "Content": "I can not get them to work wireless. I am in need of an IT person to help me set them up for my wireless router", "Date": "January 15, 2014"}, {"Title": "After 2 days of use and new router with antennas! Frustrated", "Author": "John Leitch", "ReviewID": "R1UTCAHEWJR4PX", "Overall": "1.0", "Content": "Constantly losing connection and I have a freaking router 10 foot away and still it just constantly loses reception and throughout the night even when my network has no traffic these cams still struggle to even stay on wifi. You also will need antennas, extension cords and blue iris to make these things even slightly useful and you better be close to that router! lmao", "Date": "January 12, 2014"}, {"Title": "Bought it for survveillance purpose, has good quality", "Author": "Gonzalo E Garcia O", "ReviewID": "RX66TMGP9XQDF", "Overall": "4.0", "Content": "I bought this cameras to be able to monitor my parking space, I configured it in about 3 hours using Ispy software combined with the start guide that it had in the box. I'm using it in the WiFi configuration and it is working just fine.", "Date": "January 8, 2014"}, {"Title": "Good price - questionable support", "Author": "GeminiCricket", "ReviewID": "R1NSM3X6VUQOOL", "Overall": "4.0", "Content": "These provide a good quality picture, good night vision, and a pretty good interface at what seems to be a pretty good price to me. You have to make sure you keep up on the firmware updates to fix issues though. They are constructed of generic components that I am pretty sure used by many other camera manufacturers, so the only thing that differentiates them is their price and firmware. There have been firmware issues since the beginning, and in many instances I had to troubleshoot my own issues, and then posted the solution on their forums for others to read. At this point, I am on firmware revision .53 and the only remaining issue is an issue of how it detects light changes. There is a setting that is supposed to compensate for differences in light (clouds going overhead, etc) so that it doesn't detect light changes as motion, but it doesn't work. Apparently though, there is a component update available that requires some DIY electronic work that will fix it (also, supposedly the ones being sold now already have the fix in place). You can also use some window tint as a make shift shade on the lens to help. I use these in a remote location and have utilized both the email and ftp alerting options. Both work equally well. Just make sure you clear any spiderwebs that may be spun on them, or you will be getting thousands of alerts a day.", "Date": "January 7, 2014"}, {"Title": "Difficult/Impossible to get on Network", "Author": "Stuart Greenstein", "ReviewID": "R2I2F4RVIWW72A", "Overall": "2.0", "Content": "I've yet to achieve wireless access to this camera.  It's a replacement for one that leaked and the power supply died.  That one was accessible on iPads, etc. Since then I upgraded to OSX Maverick - that may be why this camera isn't accessible.  I'm gone to all the Google links that explain how to do it and still unsuccessful.  I've bult computer from components and done some programming so I'm not a novice.  I'm grateful Foscam replaced the leaky \"outdoor\" camera.  But I wouldn't recommend this for wireless use voia mobile devices; and certainly not for offsite access.", "Date": "December 29, 2013"}, {"Title": "FI8906W", "Author": "Jack L. Graham \"Unexpanded\"", "ReviewID": "R12TS909PPAI39", "Overall": "1.0", "Content": "First off I orderd 2 tof the FI8905w but received 2 of the FI8906W instead. After installing the cameras the first issue was the wireless range is very limited.  Second issue was the cameras video will become washed out where reds become pinks and most other colors are just some shades of grey.  The first day everything seemed fine but the next morning the video color was washed out. I took the cameras down from where they were mounted and did a hard reset then did a setup on them and then remounted. The color was back to normal.  The next morning the same issue which I took them down again and did anohter reset and setup.  The next day the same thing with the video color washed out. I've been using them with the washed out color but just bought the Avacom M1080W and plan on installing them this weekend. I'll followup with a review on the Avacom to see if they work any better.", "Date": "December 20, 2013"}, {"Title": "Nice Cameras, Great Technical Support!", "Author": "D. Vashio", "ReviewID": "R3IP9EIVY2HOR1", "Overall": "4.0", "Content": "I've had the cameras for about three weeks and the product seems to work well so far.  Setup can be a bit difficult, especially port forwarding, but Foscam support has been very helpful in getting my cameras up and running.  When using  the program --IP Cam Viewer Basic, having a static ddns (free available on internet) is necessary to enable remote access. Once you get through the layers of setup, you should have a nice experience viewing and managing your camera(s).", "Date": "December 6, 2013"}, {"Title": "Great Camera - Great Support", "Author": "Matthew Cook", "ReviewID": "R1KI1PZ5FFDASV", "Overall": "5.0", "Content": "great support, camera is of good quality.  Irish from Foscam Customer Support was of great assistance with getting the camera set up on my local network and accessible remotely from outside my network.", "Date": "December 3, 2013"}, {"Title": "Great experience with Foscam Customer Service", "Author": "marilyn luciano", "ReviewID": "RR2QAY9HVQZYI", "Overall": "5.0", "Content": "Calvin was wonderful help when I called for help. He did everything remotely and it was a walk in the park the connection to my wi-fi. I will try in a few the remote access and will let you know about it.Thanks so much Calvin!", "Date": "November 22, 2013"}, {"Title": "great camera great support!!!", "Author": "john locklear", "ReviewID": "R17JZBI8CMLW2A", "Overall": "5.0", "Content": "works fantastic most important the tech support from fred Jacobs was and his crew walks you though the parts you don't quite understand", "Date": "November 11, 2013"}, {"Title": "Service is great!", "Author": "William Johnson", "ReviewID": "R1EKQMC2WWS5GO", "Overall": "5.0", "Content": "We have just bought an outdoor wireless camera. Setup is quite complicated. But the tech, Calvin is very nice and made it productive. It's worth buying.", "Date": "November 3, 2013"}, {"Title": "A lot for your money", "Author": "Brewzer", "ReviewID": "R1G838O292L8IQ", "Overall": "4.0", "Content": "I wanted to set up camera's at my front door and garage. Did not want spend a lot a time running wires an tearing up walls. I did a lot of research and shopped around. I decided on this camera for it wireless capability and the features included. I also read some horror stories. I do not put much weight on the bad reviews when most of the reviews I read are good ones. I received these in the mail and read the directions carefully and several times prior to setting up. Pretty straight forward. I am an IT guy so I knew I would figure it out if I ran into any issues. I had each camera set up in 15 minutes. Don't know what others had problems with. It was all cut and dry. I spent more time mounting the camera's. I wanted to place them in the right location and did not want them to be belatedly visible. These are large camera's, but when you consider the wireless and the software inside, not a bad size. I have been adjusting the settings and I am satisfied with this camera. I was able to set up monitoring via the website on my cell phone and iPAD. I even splurged and got the foscam app for them both after I played with it for a while. I get clear pictures when motion is detected. That is what I was looking for. I will need to get the additional software to save video feeds. That is something I will worry about in the future. I would recommend this camera to others. Great price and great features included.", "Date": "October 23, 2013"}, {"Title": "So you're interested in security cameras", "Author": "Spoony", "ReviewID": "R1L216JLTMZGM3", "Overall": "5.0", "Content": "i like these cams be cause the price is reasonable for the quality of the cameras. i had originally bought one fi8910w and used it to capture the apartments exterminator rummaging through our pill cabinet. so i pony'd up the cash and purchased these two and have yet to have a problem with the cameras. well that was after i set them all up. first off, one of the two here had a faulty antenna that separated from it connector so i sent \"them\" back (yes, if something is wrong with one of the cameras you have to send both back since they come as a package deal). no biggie. i did just that and installed one on the corner of my house. everything worked out fine. since the camera has a narrow field of view the distance. it covers a 10'x12' deck and its walk way fine but it's from a distance, that up close detail isn't available. although it's detail is good enough to recognize familiar people and things (e.g. ups guy, neighbors, friends, which dog has been pooping in my yard). but to get a wide shot you have to place camera pretty far away and thus loose detail. for example if you place camera above the driveway to capture vehicles park there, the eave of a second story house would be ideal for viewing both sides of a two car driveway (just don't think your gonna cover the the whole driveway with one camera from the eave of a single story house, you would need a second cam) you need about 35-40ft for ideal placement. as for the ir night vision.... this thing is a ir spotlight! the 35-40ft placement is perfect for this cause anything closer is too bright at night causing the background to be too dark to recognize anything. i have seen video and photos online from one of these cams and i can tell you placement is everything! if you're gonna place it any closer than 30 ft than i would seriously think about placing a scrim/defuser over led ring. (simply cutting a exact sized donut shape ring from wax paper and taping it will do.) one problem i came a cross is a wiring issue the size of the ethernet plug on the cord is 1/2in diagonal meaning you will probably need to drill/cut a decent size hole just to wirer it through a wall or ceiling. i didn't cut the zip tie that came around the cord and i bundled it in a plastic bag then secured it under the eave so the only hole i needed was just big enough for the power cord. which it is substantially smaller. another problem i came across is the adapter went out on that camera. i ordered a cheaper after-market adapter (cos the foscam one is too expensive) and am back up and running. overall, i like foscam cameras they are reasonably priced and thus-far worth every penny.as for the HD models i would wait... i've seen where some apps don't support them. (too much bandwidth needed)oh, and update the firmware first then the user interface before you install cam. both are easy to do and free of charge once you get emailed the download links.", "Date": "October 11, 2013"}, {"Title": "Tech Help - A+++", "Author": "LeAnn", "ReviewID": "R2I1NCBWA41L61", "Overall": "5.0", "Content": "Could not of done it with Andrew and his technical help ~ MANY thanks!!! Worked on setting up the cameras for over 5 hours -- he set them up for me in an hour. They work great!", "Date": "September 25, 2013"}, {"Title": "Work perfectly.", "Author": "Peter Dobol", "ReviewID": "RGHGQ8UCVKZD1", "Overall": "5.0", "Content": "I had a lot of trouble at first because I read reviews about how bad the directions were.  When I finally read the directions on the set up disc, setup was quite easy even for a first timer.  The only trouble I had was with port forwarding.  I finally called foscam tech support and they were extremely helpful.  I'm a happy user.  Actually bought a third unit.  The strength of your wifi signal is the only critical thing.", "Date": "September 19, 2013"}, {"Title": "Wireless is worthless", "Author": "Robert J. Watson \"BobW\"", "ReviewID": "R3L6HSAL3X48VE", "Overall": "3.0", "Content": "The camera's came from Amazon (Foscam was the supplier).  Supposed to be 6mm but came with 4m lens.  Glad it did as the angle is still to narrow for my purpose.Unless you are only a few feet from the camera the wireless is useless.  Connected the camera to a Trendnet TEW-638APB set up as an AP Client and the the connection has been rock solid at about 50 feet from the router.  The same camera cannot maintain a wireless connection on its own over 15 feet from the router.So, if you want to wire the device or use an add on wireless agent ($60), I would recommend (4 stars).  If you expect the wireless to work, I would give it less than one star.", "Date": "August 13, 2013"}, {"Title": "fi8905w", "Author": "ron", "ReviewID": "RZCD8Y0NHWKD9", "Overall": "5.0", "Content": "Great camers for wireless ipGreat featureswould recomend these camers to anyonethe support is the best e the online assistance", "Date": "June 5, 2013"}, {"Title": "Foscam camera", "Author": "richard christoopher", "ReviewID": "R2NOE89C49GVNI", "Overall": "4.0", "Content": "Good night vision, having problems with them kicking out at night. Not very easy to set up. Have five cameras one always kicks out during the night, blame it on being wireless?", "Date": "May 2, 2013"}, {"Title": "Hard to set up", "Author": "Frank Greene", "ReviewID": "R3C6XTIVOVE66V", "Overall": "3.0", "Content": "Difficult to set up, still can not access them via smart phone. One did not work and had to return, three weeks and still waiting for replacement.", "Date": "March 22, 2013"}, {"Title": "Fits the Bill", "Author": "Aaron", "ReviewID": "R22MMYWIMKZCCF", "Overall": "4.0", "Content": "I like how they turned out. I was mostly worried that the video quality would be terrible but it's not that bad if you just need something to watch your house while you're gone. The fact that it can be accessed from a phone or tablet is one of the really impressive things about this product. I could almost say I got it for that sole reason.", "Date": "March 11, 2013"}, {"Title": "Excellent Product at great price!", "Author": "Alexander S. Kish \"Alex\"", "ReviewID": "R3UUOKZ9E6F3KE", "Overall": "5.0", "Content": "I ran into trouble getting the wireless connection up and running (on windows machine) but a quick call to Albert at tech support resolved the issue in a matter of minute - literally! He set up the remote wireless features. What made this setup even more involved was that we set up multiple cameras. He knew how to get the router, modem, and cameras all to work in concert very quikly and very professionally. Great product and great tech support!", "Date": "February 14, 2013"}, {"Title": "best technical support", "Author": "Laurel S. Brown", "ReviewID": "R1F4ML4WKVVE56", "Overall": "5.0", "Content": "UPDATE:  my dad moved the cameras, and BOOM they were not functioning correctly again.  I called foscam and although I waited on hold for quite a long time (prepare to be on hold for atleast 30 min), I received wonderful help from a tech named Leo.  He remote entered into my computer and fixed the issue at hand (both cams had the same IP address).  I am no tech wizard, but their helpful computer gurus can help you through any problem.I bought these cameras for my father for christmas.  I did a ton of research about wireless security cameras before purchasing and decided that these seemed like the best quality for the money.  I was apprehensive about the installation of these units because of the reviews.  I am relatively computer savvy, but I don't know much about port forwarding and static IP addresses.  The directions are not the best.  They are super universal, and if you don't have a linksys router, you may find yourself lost very easily.  I set up these two cameras on a ATT Uverse router.  I got about 3/4 of the way through the installation on my own, following the directions included in the package and various googled forum posts on the topic.  I went to set up the second foscam cam on my system and it caused the first camera to go black.  I couldn't figure out what I did wrong, so I admitted defeat and called FOSCAM US tech support.I waited on hold for about 20 minutes, but I was eventually connected with a nice guy by the name of Felix.  I told Felix what I had done (and hadn't done), and he told me he would help me.  Rather than simply answer my questions about what I had done wrong and needed to change, he remotely connected into my computer and fixed the issues and finished the entire setup for me while I watched on the screen.  He was extremely helpful and professional.  Felix could have simply answered my question and sent me on my way since I did not buy any installation help from FOSCAM, but he went above and beyond to help me understand how to connect these up so I can now confidently add on more cameras to this system in the future.I did not realize the level of technical knowledge needed to set these up, but foscam tech support was very thorough and helped me complete the setup.  I would recommend this camera to anyone who wants to be able to watch their business or home from away. It is a well built camera and my experience with their tech is nothing like some of the problematic reviews I've seen below.A few words of advice for those having issues remotely connecting into their cameras:  I initially tried to use port 80 and 85 for my two cameras, but Foscam tech ended up using ports 8088 and 8089, which allowed me to easily set up the foscam pro app on my cell phone as well.Please do not be afraid of these cameras if you have any sense of IP addresses, port forwarding, and firewalls.  You can figure it out with limited frustration.", "Date": "January 11, 2013"}, {"Title": "Expected more", "Author": "Basilio", "ReviewID": "RMJSNG7EWGCUS", "Overall": "3.0", "Content": "I was expecting more from an original Foscam compare to a clone one.They works exactly on the same way, no big differences.The FI8905W is good for real time surveillance with human control, for automated and recorded surveillance, the image quality is very poor and not good.The night vision is clear enough to use it during night time but additional illumination is strongly recommended.", "Date": "December 15, 2012"}, {"Title": "Foscam Review:  Excellant Customer Support", "Author": "Gene", "ReviewID": "R32CG11SRXKFP7", "Overall": "5.0", "Content": "I had a wonderful experience with Calvin.  He quickly was able to get my cameras up and running quickly for me.  I am extremely pleased with the customer technical support service at Foscam.", "Date": "December 4, 2012"}, {"Title": "Foscam help", "Author": "Brendon", "ReviewID": "R3AMDS1S45U3OF", "Overall": "5.0", "Content": "Excellent, knowledgeable help. Courteous and friendly. Foscam has good resolution and colour display. I would recommend this product and will be buying more of these for my security needs.", "Date": "November 28, 2012"}, {"Title": "camera setup", "Author": "Happy listener", "ReviewID": "RD6V67I44ENJ0", "Overall": "5.0", "Content": "Just received help from Calvin Harris to set up two more cameras for the outside of house, the cameras are working really well and very clear. Calvin does a great job with setting them up and making sure they are working before he is done. Thank you Calvin for taking care of me", "Date": "October 29, 2012"}, {"Title": "Recommended", "Author": "kilmozavi", "ReviewID": "R3RVUV8ODZMNCN", "Overall": "5.0", "Content": "Nothing is hidden.These cameras meet their goals of excellent and low cost manner. Recommended for use in external conditions", "Date": "October 23, 2012"}, {"Title": "Great Product, works on the first try!!", "Author": "Ryan P. Williams", "ReviewID": "R3X6DX7XKKGRA", "Overall": "5.0", "Content": "I have 2 of these Outdoor models and 4 of the indoor models. I guess my only complaint would be they don't have the PAN option, but I knew that before I purchased them. I am an IT Professional and I realize that non-IT oriented folks may not be very familiar with the setup at first as it seems confusing. Foscam includes a video tutorial on each step of configuring any of their camera's. If you use this video, anyone can install and configure these camera's in 10-20 minutes. Follow the video and don't skip steps!! The mounting was easy and the picture is acceptable for my needs. The units were a little larger than I expected... maybe they make smaller versions of this item?? Anyway, the IP viewing from a browser or IPAD/IPHONE works great, no complaints there. Since I have routing experience and work with remote security at my job, it was a little easier for me to setup this feature, but again, watch the video and these features will be explained in detail.The APP is $6, but well worth it as it has many options/features available. Other than that, they don't have the 2 way audio or panning capability, but if you need those features you can purchase the indoor wireless units which also works fantastic. That's all I have to say right now, but again, great product!", "Date": "August 16, 2012"}, {"Title": "tech support", "Author": "scotty", "ReviewID": "R7W1AY13VUZXW", "Overall": "4.0", "Content": "Anzen was great he help me set up all my foscam great tech help. All my foscams work great very nice products", "Date": "August 15, 2012"}, {"Title": "Foscam and More", "Author": "Sam 1948", "ReviewID": "R3U1LKG6CQOQTK", "Overall": "4.0", "Content": "The FOSCAM looked just as it did on line when it arrived. No issues with shipping, the package and the way it was packed, no damage. The instructions were a little hard to read so I called tech support. WOW what a job. He and I loaded, tested and re-tested it agin. No issues what so ever, the product is well made and the tech knew what he was doing, thank's again Mr. Ralph Mendez for all your help. Good job and a job well done.", "Date": "June 29, 2012"}, {"Title": "Good image, OK Software, Huge camera", "Author": "Eric D. Brown \"Technology Consultant\"", "ReviewID": "R3RWTQP3R6EX3U", "Overall": "2.0", "Content": "I bought these Foscam 8905's for use outside to monitor my front and back doors. I've got 2 Foscam indoor cameras and have been happy with the image quality (although the build quality has been so-so).When I received these cameras, I was really surprised by how large they are. They are big. Much too big to mount under an eave on a house and have them go unnoticed.Another complaint is the field of view. In order to use these to keep an eye on my front/back foors, I'd have to mount them very high and/or quite a long ways distance from both doors since the field of view is quite narrow. While testing, I had the camera set up 20 feet away from my desk pointed at my desk. The image was quite clear (even in low-light) but I barely fit my desk and myself into the field of view.I liked the image quality but not really much else about these cameras. They are large and bulky. The mounts that were shipped with the cameras were a joke and wouldn't even hold the weight of the cameras.  The field of view might be OK if you are using it to watch a specific area a good distance from mount point but they aren't useful for close-up monitoring of a wide area.Overall, 2 stars out of 5.", "Date": "June 17, 2012"}, {"Title": "The two cameras I bought from Amazon are great camera.  They are both very sensitive.  Anything that moves it captures it.", "Author": "Paul", "ReviewID": "R3OCBPVOGDIVYA", "Overall": "4.0", "Content": "The two camera [F18905 Outdoor camera) are very good cameras.  They are both verysensitive.  I had to turn the sensitivity down.  The software that comes with the camera is not very good.  I had to buy the program called Blue Iris.  This software is the best for the camera.  And of course dealing with Amazon for the first time is being a pleasure.  Thank u Amazon.Paul", "Date": "June 5, 2012"}, {"Title": "Great Camera", "Author": "L. Giacomin", "ReviewID": "R15NLV7NDJOUJP", "Overall": "5.0", "Content": "Easy to set up, actually the easiest I've seen. Quality is great and the best part is the night vision it's incredible! I really recommend this camera.", "Date": "May 17, 2012"}, {"Title": "Good Value for price w/ Caveat: Narrow Angle of View", "Author": "Jay Gahtege", "ReviewID": "R2PDWFTATLU0GM", "Overall": "4.0", "Content": "Pros: Well constructed product.  Lots of IR LEDs for night-vision illumination.  It was very easy to setup on my network (The instructions are very thorough.)Cons: My only complaint is that I need a wider angle of view for my application. (I know, my own fault for not paying attention to this detail before purchasing.)So, I've sold one of the IPcams to a friend and I will figure out something to do with the other.  I plan to buy a wider-angle view IPcam from same mfr.  I also bought a 3-pack of indoor PTZ cams... to be reviewed later.  (Wish there were some PTZ outdoor cams in this price range.)", "Date": "May 7, 2012"}, {"Title": "Like the camera but the service sucks.", "Author": "buenhec", "ReviewID": "R3KZ63TU70CVX7", "Overall": "4.0", "Content": "The camera is well made. A bracket is included in the box, something I was not sure would be included. Its pretty bulky and obvious. I set one up with a PC, the other with my Macbook. The mac was the way to go, it was a pretty simple installation. The image during the day is really bright, I think they are working on a firmware update for this. During the night it works better than I expected. Its placed behind the glass, the IR does not reflect or interfere like on my Airlinks at night. There is plenty of documentation included.I called customer service, after an eternal hold I got a VM saying I would get a call back. Im still waiting for the call. Also I tried to download the newest firmware from a link CS sent me, I open the link and everything is in Chinese. I have sent two emails requesting a link in English, still waiting.......", "Date": "April 6, 2012"}, {"Title": "Excellent value", "Author": "Gary J. Nix", "ReviewID": "R2GFZB0MJF4FQO", "Overall": "4.0", "Content": "I was amazed how well these work.  The only thing that keeps me from giving them a 5th star is that they needed to have a wider field of vision.  Everything looks \"zoomed\" in.", "Date": "January 24, 2012"}, {"Title": "not as advertised", "Author": "west", "ReviewID": "RJM7QGOB7K4B4", "Overall": "2.0", "Content": "I am very impressed with the camera itself. Night vision is great. Quality of camera is good. Would have rated 4 our 5 but they advertised that you can view from the internet or any computer at no additional charge. This is false you have to purchase additional service with an annual fee to accomplish viewing over the internet. This service used to be free but is not any longer. Very disappointed", "Date": "March 6, 2012"}, {"Title": "WARNING! WORKED FOR ONLY 8 MONTHS.", "Author": "dim3m", "ReviewID": "R30ORHVY0L7IC6", "Overall": "1.0", "Content": "I purchased this item since February. And just last week it died. No power no nothing. Reset doesn't work, and it wasn't even installed outside. I had it inside my home. Its useless now. Just a waste of money. BUYERS BEWARE! I can no longer return the item coz the policy return period ended in March, and now its October.BUYERS BEWARE!!!BUYERS BEWARE!!!BUYERS BEWARE!!!", "Date": "October 7, 2012"}, {"Title": "Could not get cameras to work-had to return them", "Author": "Ranchhand", "ReviewID": "R3MHGG7FYMTT3M", "Overall": "1.0", "Content": "Cameras looked good when unpacked from the package.  However, the cameras could not be recognized by my desktop Windows XP computer.  The directions said to shut off anti-virus software & firewall, but to no avail.  Went to Foscam's website, and had extensive chat with Foscam tech support, but nothing worked.  Foscam's tech suggested that the firmware in the cameras may have been defective or out of date, but since the cameras could not communicate with my computer, there was no way to update the firmware.  Bottom line, the cameras were useless to me and I returned them.", "Date": "September 15, 2012"}, {"Title": "just ok", "Author": "Larry Buc", "ReviewID": "RW7CZONOMZS4", "Overall": "3.0", "Content": "the item was ok but beign wireless i believe it was to far for my computer to receive the signal", "Date": "June 25, 2012"}, {"Title": "Not recommended for wireless use", "Author": "hackerman", "ReviewID": "R1WRKOHB3IF4UR", "Overall": "2.0", "Content": "The good:Sturdy weather resistant housingSturdy mounting bracketsSupports Ethernet or WiFi*The bad:The view angle on these camera's is really pretty narrow.You cannot adjust the focus or zoom to compensate for distance.These camera's are rather bulky.The wifi connection times out between 4 and 36 hours, requiring a hard reset to come back online  - sometimes I have had to reconnect an Ethernet cable in order to regain access to the cameras.  - I tried using several different brands and models of WiFi routers/hubs/repeaters/access points but the results were always the same.If you are ok with narrow field of view, close up (zoomed in) picture of your subject, and having to use an Ethernet cable for reliable connectivity, then this may be something to consider.  Otherwise, I do not recommend it.", "Date": "June 14, 2012"}, {"Title": "Very disappointed", "Author": "Fernando", "ReviewID": "R1U2BOW4PPEZXB", "Overall": "1.0", "Content": "Purchased the package with two cameras. Deliver made on time as promissed. First camera out of the box, all cables connected and my computer was not able to recognize the camera. I lost over 30 minutes until I decided to try the second camera. All connected and the second camera worked very well. Clear image with day light and reasonable with IR and wireless worked very well.I had to return both cameras because one was not working at all. Very disappointing.", "Date": "May 16, 2012"}, {"Title": "Did not ship model stated. Model was similar but only does 640x480", "Author": "Jonathan Sailer", "ReviewID": "RK0C39RQY1YLO", "Overall": "1.0", "Content": "After painting to match the house configured camera to discover it did not have 720 resolution as stated for this model. Beware you get what you pay/order for!", "Date": "July 24, 2013"}, {"Title": "Ok", "Author": "Javo", "ReviewID": "R1R10UW1FX3TNN", "Overall": "4.0", "Content": "Muy lindas. Gigantes de tamaño. Buena definición, fácil instalación, buen embalaje, es lo que esperaba en cuanto a calidad. Buena relación precio costo", "Date": "March 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0055JFWMW"}}