{"Reviews": [{"Title": "So far so good", "Author": "Bill", "ReviewID": "R2UAI4C1HOQB4T", "Overall": "5.0", "Content": "Product is superior to the two previous 4 channel USB DVR's that I have purchased.  This works well with Windows 7 laptop and the client remote access works as well with no messing around required.  Easy to install software.  Haven't tried it with multiple cameras yet.  No problem playing AVI files it generates either.", "Date": "September 26, 2013"}, {"Title": "QQDVR video recorder", "Author": "Manuel", "ReviewID": "R2DLPD7JS60TF8", "Overall": "4.0", "Content": "I purchased this product, because the price is reasonable, but mostly because I did not want to deal with opening up the case of my computer to install a video recorder card.  I am very satisfied with the product.  I have installed 4 NTSC cameras and am using the QQDVR to monitor areas around my home for security. The only drawback that I have noticed so far is that the .avi files that the QQDVR makes are only readable by the QQDVR software.I have tried to open these files with Windows which should open the files, since .avi files are Windows format, however, Windows Media Player cannot open these files.  I tried three other media programs from the web and none can open these files.  The codec is not supported. The error message is C00D19A.  If the developers of this product, can fix that---then this product will be a huge success.", "Date": "December 21, 2012"}, {"Title": "amazing.", "Author": "kspike", "ReviewID": "R1RA8A4JNHLQJW", "Overall": "5.0", "Content": "I couldn't be happier with this product works great with my computer after some initial trouble shooting which was my fault for messing up the install. Easy to use very well built hardware and well written software. Worth every penny including expedited shipping. If you need a dvr without paying out the nose for an empty box plus also having to buy a hard drive for it. Get this. I only wish i could give ten stars!", "Date": "December 4, 2012"}, {"Title": "Dont waste your money", "Author": "Rick Louder", "ReviewID": "R3K6GMBX3IHI85", "Overall": "1.0", "Content": "this thing will maybe work with one camera, but will cut out before the end of the night, if you use more than one channel on it then you might get 5 mins of recording before the device freezes. tried the product one multiple computers, from pentium 4 with windows xp to a six core processor with a amd radeon hd7770 andgot no different results", "Date": "December 20, 2012"}], "ProductInfo": {"Price": "$42.95", "Features": "4 Channel Super USB DVR Video & Audio Real-time Network CCTV Capture Card 120FPS\nFeatures 4-channel video input and 4-channel audio input in one card, allows you to watch 4 different video displays on one screen\nCompatible with Windows 2000 / XP / Vista /7 (32 &64Bit)\n4 channel video input on one card. Maximum display/recording rate is 25 fps in PAL format; 30 fps in NTSC(US) format per channel\nRecord resolution: D1(PAL: 704 x 576 NTSC 720 x 480)", "Name": "New 4 Channel USB2.0 DVR Video Audio Capture Adapter Card CCTV Security Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/413N53iFEDL._SY300_.jpg", "ProductID": "B005K48P08"}}