{"Reviews": [{"Title": "cheep", "Author": "jeremy", "ReviewID": "R3QRK4SYUTL639", "Overall": "3.0", "Content": "very cheep and pictures arn't too good but i expected that for a camera that was that cheep. oh well. it was pretty much a disposible camera.", "Date": "October 6, 2012"}, {"Title": "a Very Expensive toy", "Author": "Peter", "ReviewID": "R2ROVQ55EZ4LW8", "Overall": "1.0", "Content": "I thought it would be a good inexpensive camera at a reasonable price. My first impression on opening the package \"It feels cheap\" then I had to hunt up some batteries (not included) and a SD card (not included) and try to make it work. I was diligent and spent quite a bit of time trying to figure it out... the end result = it feels cheezy, is difficult to use, and it takes crummy pictures.  But it was CHEAP!Hopefully I will get a refund, if not it will go in the trash.PS: It appears that Amazon is good at sending automated emails, but not good at getting refunds.  Be very careful... if Amazon redirects to a reseller (TigerDirect in this case) it seems they will do nothing to help you get a refund.", "Date": "August 9, 2012"}, {"Title": "Mama's camera", "Author": "Jo Rhea", "ReviewID": "R1RFHO8QU1RJ8U", "Overall": "1.0", "Content": "I purchased this camera for my mother.  I thought it would be easy for her to use for her first digital camera. The buttons are hard to use and the display isnt very user friendly.  The quality of the product is not what I thought it would be.  To hold it feels like a child's toy. The pictures are very grainy.  I will be sucking up this money loss and purchasing her a better one somewhere else.", "Date": "December 27, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "High Definition 4x Digital Zoom\n1.8\" Preview screen\nUpload with the Press of a Button to twitter Facebook and youtube\nAuto Flash and anti-shake", "Name": "Vivitar ViviCam 5018 Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41KsxACJWIL._SX300_.jpg", "ProductID": "B005JKYQ9C"}}