{"Reviews": [{"Title": "Sony NEX-7 kit", "Author": "M. Wieder", "ReviewID": "RQ0YUQ3ML5XFB", "Overall": "5.0", "Content": "VERY PLEASED:  I purchased the NEX-7 kit after reading the review by Damian Gadal on Amazon.com.  I test ran the camera before I purchased it online.  My purposes were: LIGHTWEIGHT and tack sharp.  Those needs were met.  I had to wait a couple of months to purchase the expensive, 3rd party, adapter by Metabones that will allow me to use my Canon system of lenses with the NEX-7 camera, saving me a lot of money.  The downside of the adapter is that manual focusing of the non-Sony lenses is required.  Small inconvenience.  Metabones was so sold out that I had to get on a waiting list for the $400 item. It became available yesterday. There is an excellent demo of the NEX-7 by Michael Reichmann on his \"Luminous Landscape\" web site that shows the relative size and weight of the body and the set of lenses, in comparison to other cameras.A bonus is all the in-camera things that the NEX-7 can do,--it does HDR in-camera, it stitches together a panorama after you have \"waved\" the camera in a semicircle, it will take a \"partial color\" picture, eg. showing the red in red roses in front of a Victorian house that it desaturates into a black/white background, it will create a sepia-toned image in-camera, and lots of other fun effects.One reviewer carped that he did not like the Menu setup and expected something more like the Canon and Nikon menus which I find to be a burden.  I love what Sony has done with their menu.  The entire camera is a hybrid between a heavy high end camera and a lightweight pocket camera.  I have both and now PREFER the lightweight camera that does all the same things, plus some neat effects.  The only niddly thing, if forced to find something negative, that I can say is that the focusing of the liveview NEX-7 is a tad slower than my Canon lenses.  I can live with that.  It is not as slow as a pocket camera which hesitates while it takes an exposure reading.Delivery of the camera from Cameta was prompt.  Well-packed (actually Sony over-designed the packaging and it's a bit like taking an origami apart)", "Date": "August 9, 2012"}, {"Title": "Great camera and package", "Author": "Big Bob", "ReviewID": "RKS5KIUH5AT38", "Overall": "5.0", "Content": "This camera is a great one and replaces my Canon AE-1 perfectly. So wonderful to have a digital camera that produces images that are as good as film. The variety of different effects is astounding. The package includes all of the accessories that are needed. The tripod is not good however, so plan on getting a good one separately.", "Date": "November 15, 2012"}, {"Title": "Must Buy!!", "Author": "GREAT DEAL.", "ReviewID": "R1T9WHP1TYJ8N6", "Overall": "5.0", "Content": "I bought this camera because I was wanting a better quality camera. And oooo boy did I get a better quality camera. This camera can do more things then a 2000 dallor camera and not to mention it comes with so many things. I love this camera!!!!!", "Date": "June 28, 2013"}, {"Title": "Great Camera", "Author": "Ehud Makov", "ReviewID": "RTIMLXEKJ2CLX", "Overall": "5.0", "Content": "light but superb in functionality and optics.  I find it a great compromise for the heavy DSLR camera in the market", "Date": "July 27, 2013"}, {"Title": "Nice photos but drawbacks to consider", "Author": "David A Palmer", "ReviewID": "R1465WYTFN7TMT", "Overall": "3.0", "Content": "I got this camera after all the rave reviews, went out, took a photos and was floored by the quality of photos. Then I went out the next evening, took a bunch of photos and was floored that not one was useable by the amount of dust pumped in on the sensor by the lens. The sensor takes constant maintenance. I have to clean it before each time I use it and many times, while I'm taking photos because it just sucks in so much dust while focusing. The tripod is worthless. It fell apart opening up the box. The telephoto and wide angle \"lenses\" don't fit onto either Sony lens. So, great photos if you can keep the sensor clean.", "Date": "October 15, 2013"}, {"Title": "Love this camera!", "Author": "Lindsey J Oswald", "ReviewID": "R1DAUMET8C4B5R", "Overall": "5.0", "Content": "Have had this camera for about 8 months now and love it! Amazing photos--I tend to use the intelligent auto function the most but plan to take a class so that I can use the camera to its full potential.", "Date": "December 29, 2012"}, {"Title": "Great deal!!!", "Author": "shahar", "ReviewID": "R1NOLNFIRFVVGK", "Overall": "5.0", "Content": "Great camera,light,high quality photos.The two lenses are very good saves a lot of money buying them separately.The bag and tripod are not so good,the bag is too small (fits only the camera), the tripod is very cheep chiness product.But still I'm very happy with the whole package :)", "Date": "January 27, 2014"}, {"Title": "Great Package", "Author": "Willing Volunteer \"Liz\"", "ReviewID": "R3O6JOLQ3TLQFZ", "Overall": "5.0", "Content": "Great Package.  Everything needed to start taking great photographs.  Lens are of superior quality. The tripod was of inferior quality.", "Date": "January 1, 2014"}], "ProductInfo": {"Price": null, "Features": "KIT INCLUDES 13 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Sony Alpha NEX-7 Digital Camera Body & E 18-55mm OSS Lens (Black) + <2> Sony NEX E 55-210mm Lens + <3> Transcend 32GB SDHC 300x Card +\n<4> Spare NP-FW50 Battery + <5> Vivitar 49mm UV Glass Filter + <6> 49mm 3pc (UV/FLD/PL) Filter +\n<7> Zeikos 50\" Compact Tripod + <8> PD 2x Tele & .45x Wide Lenses + <9> PD-C20 Camera/Camcorder Case +\n<10> PD SDHC Memory Card Reader + <11> PD Spudz Microfiber Cloth + <12> PD Memory Card Storage Wallet + <13> LCD Monitor Screen Protectors", "Name": "Sony Alpha NEX-7 Digital Camera Body and E 18-55mm OSS Lens -Black with E 55-210mm Lens , 32GB Card , Battery , Telephoto , Wide-Angle Lenses , Case , Tripod and Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51ort8lJ6sL._SY300_.jpg", "ProductID": "B005VQDRXA"}}