{"Reviews": [{"Title": "An EVIL camera to love", "Author": "Michael McKee \"mystic cowboy\"", "ReviewID": "R3EH2TPIKQ9260", "Overall": "4.0", "Content": "EVIL for electronic viewfinder interchangeable lens. Anyway, I pre-ordered this from B&H; last September. Have had it for a couple of weeks.First off, the Samsung NX 200 takes great photos. Low ISO shots are good, not quite as noise free as my Pentax K-5, but at least equal to Canon's current APS sensor images. I process photos from several theater photographers and get to see the files from many current cameras. The NX 200 has nothing to apologize for when it comes to low light performance.The kit lens is sharp, though no faster than other kit lenses. With Samsung's 30 mm pancake lens it becomes a great street photography camera. The 30 is actually a great addition. It's super sharp, very fast, (F2) has no distortion or fringing in most conditions. The bonus is that the camera becomes very compact with this lens and will fit in a jacket pocket.Second, the camera is well made. The magnesium body feels solid. Finish is excellent, and it looks classy. The camera is light but solid. There are enough external controls for an enthusiast like me. One extra is the i-Function lens, which allows for quick setting changes by turning a ring on the lens. It's sort of similar to the adjustment ring on the front of the Canon S95/100. That's on the body instead of the lens, but the lens ring makes changing settings surprisingly easy and fast. I'm becoming a fan.The AMOLED screen is brilliant: bright, crisp and has good color. It will work in bright sunlight, though it does wash out.Third, taking photos is quick. I don't know exactly how the burst rate compares to the competition. It's more than quick enough for my needs. The camera starts up quickly and shot-to-shot times are fast enough that I don't have to wait. It handles well. controls are in logical locations. Focusing isn't spectacular but well in the ballpark with the competition. I've shot the Olympus EP2 and EPL3, as well as the Sony NEX 5 and 5N for comparison.Speaking of the competition. I don't think the ideal compact interchangeable lens exists yet. There are compromises with all current camera systems. The system is the important part.Sony has released some excellent camera bodies with great sensors. The NEX 5N has the same sensor as my Pentax K-5. I don't think Sony gotten quite as much from the sensor as Pentax or Nikon (D7000), but it's close. The NEX7 is the most feature rich body and has an almost insane 24 MP sensor. Sony's shortcoming is that the company has focused much more on camera bodies than on lenses. Honestly, there isn't a single lens in Sony's lineup that would be near the top of my wish list. They make mostly slow aperture zooms, of decent but not outstanding quality. The only pancake lens in the lineup is a 16 mm, which is bit wide for everyday work. With a compact and light body, not having good and small lenses is a shame.The micro four thirds (M43) cameras from Panasonic and Olympus have a much more mature lens offering. Since both maker's lenses will work on the other brand that helps. The Panasonic 20 mm lens is excellent and the Olympus 16 mm is pretty good. Since the M43 cameras have a small sensor the effective focal length is 2 as opposed to the APS sensor of the Sony and Samsung cameras. That means the a M43 20 = a 40 mm full frame equivalent. A 16 = a 34 mm. Those are great street focal lengths.  The Sony 16 only equals a wide 24 mm equivalent. That's a big difference.Both, Panasonic (GX 1) an Olympus (EP 3) have full featured offerings in about the same price range as the Samsung. They are both fine cameras. Unfortunately, the M43 cameras don't do as well at high ISO sensitivities as do the APS sensor cameras. I shoot indoors a lot and really appreciate the low light abilities of my K-5 and wanted something with near the same ability. The NX200 has that. the M43 cameras don't. If you don't do as much available light photography, the M43 cameras are great. That doesn't fit me.Back to systems. Samsung has put out more lenses in less time than any other interchangeable lens maker. They have 3 good pancake primes that compliment the compact body beautifully. I got the 30 mm with the new camera and will pick up the 20 next. The lenses were the main factor in my choosing the NX200. Samsung's last sensor was a bit out of date. the old 14 MP sensor is similar to the one on my old Pentax K20D. It was good for its day, but not that great at low light, either. Now that Samsung has a modern sensor that is good at high ISO, the company's offerings look a lot more appealing. The NX200 is a good camera.It's not perfect. I like the i-Function lens feature but would also appreciate a touch screen on the camera. It's not like Samsung doesn't make excellent ones for their phones. Also the screen doesn't swivel or tilt. My third beef is that the camera doesn't offer the ability to add a electronic viewfinder (EVF).Holding a camera out in front like a compact isn't as stable as holding it close to the eye. As good as the screen on the back of the camera is, in bright sunlight, it would be nice to have the option of a EVF. Sony's new one is excellent. I'm assuming that it will be similar the the one on the A77, which I've tried. Olympus' one is quite good enough and reports say that Panasonic's is as good as the Oly. It's a shame the the NX200 lacks the option.The third problem is that the NX raw files aren't compressed, which makes them around 40 MB each. That's nearly twice what they should be. When Adobe releases compatibility for the new camera I'll be able to import them into Lightroom as DNG files with reasonable file sizes, so that's more a temporary annoyance than a major problem. Until then, the JPEGs are fine.Still, the camera works well and any lenses I get will work on the next generation model. With any interchangeable lens camera you're buying into a system. Samsung is getting their game up to par and has the best lens lineup for my needs, which mostly consist of street and travel photography. This is more than a good enough camera to overlook its few shortcomings. Bottom line. It handles well, looks great, has excellent lens options, and takes great photos.", "Date": "November 26, 2011"}, {"Title": "A BEAUTIFUL LITTLE CAMERA", "Author": "Robert D. Williams", "ReviewID": "RTUWO3J4BGEQG", "Overall": "5.0", "Content": "I have had this camera for about 2 weeks now and have had a chance to try it out.  I could not be happier with its performance.  The controls are well laid out and the 3 inch screen is absolutely beautiful.  The camera feels nice in my hands.  It has the 18-55 samsung lens which is wider than the one supplied with the nx100.  The photos are well exposed and the colors are bright and rich.  I am thinking about getting the 50-200 lens.  The 20.3 mp make it especially good if you need to crop any photo and provides  good digital zoom ability.  Although it doesn't have a built in flash, Samsung provides one in this kit that works well atop the unit.  And further, I don't often need to use a flash due to its high (12,500) iso ability.  The only thing I miss is an optical view finder which is needed in bright sunlight.  Sony has one in the NEX-7 camera (actually an OLED electronic viewfinder) which would be greatly appreciated.  My one and only disappointment with this camera is with its digital filters which I use a lot.  I thought this camera had the smart filter 3.0 which it does not as in the Samsung WB750 camera but instead has the smart filter 2.0.  The smart filter 3.0 has water paint and oil paint and I was interested in using those.  However, All in all, it's a terrific little camera that even a pro would love and use.  I am glad I bought it.  Also, of further mention, is the instruction manual.  Many camera makers are getting away from the paper manual.  This, I find, is unacceptable.  I don't always go around carrying my computer on photo shoots.  Samsung does provide a basic manual in the kit which covers most camera functions.  I am happy for that but wish, in the future, to have the complete paper manual.  Although the NX200 has interchangeable lenses, I do not think it's fair to compare it to DSLR cameras like my Pentax K5.  It's just not kind of camera. But one of a growing new class of cameras intermediate between a DSLR and a point and shoot.  As long as you have that firmly in mind, go ahead and buy yourself one.", "Date": "November 25, 2011"}, {"Title": "Outstanding Performer In Its Class", "Author": "Wayne M. Wilkinson", "ReviewID": "R36KOHYBLHJ727", "Overall": "4.0", "Content": "I purchased the Samsung NX100 a year ago and was very impressed with its performance. When the NX200 was announced, I knew that I wanted it but at $900 the camera was too much at the time. Thankfully, the price dropped so I could afford it. And, let me tell you, at less than $600.00 - the NX200 will compete against all comers.The APS-C size sensor gathers more light than its micro 4/3rds competition and the autofocus proved more than sufficient for me. Image quality is excellent OOC (out of camera) in Jpeg superfine. Everyone has their favorite photo editing software but there is not much need to use it if you don't want to when shooting Jpegs with the NX200. Raw shooters will likely be disappointed with the uncompressed files and write times. The latest Samsung firmware has helped me with Raw files but using a class 10 SD card a single image took 10-12 seconds to transfer from the buffer. Superfine - full resolution - Jpegs were done within two seconds!I liked the EVF on my NX100 but while shooting with the NX200, I didn't miss it. The AMOLED screen is bright enough for most outdoor photos, and indoors it is more than adequate; there is a brightness level in the menu options that you can set to bump up the clarity of the view screen.The NX200 has a magnesium alloy top and bottom plate but the wrapping is polycarbonite plastic. It feels lighter but more substantial than the NX100. It also has a slimmer profile which makes it all the more \"stealthy\" for street-shooters. Using the 16mm, 20mm or 30mm prime lenses makes the camera all the more portable than the included 18-55mm kit lens. This is not to mean that the kit lens is not portable, only that it is much longer than any of the Samsung NX primes.Summing up the positive aspects of this camera, I can say that it has a very low profile appearance - making it easy to carry and a godsend for street photography - the raised grip is comfortable but if you plan on holding it all day it does get heavy; best to have a bag or strap.Autofocus is fast and \"S\" mode at 1/500th of a second yielded superb results. Aperture priority \"A\" mode images at F4 and above were also excellent using the kit lens. However, with the focus lamp turned off, the camera did search for focus longer than would be desired.The Magic Frames and Smart Filters are kitchy, and nothing that you couldn't accomplish using your favorite photo editor. All the same, its nice to know they're available for in camera edits.Most importantly, the image quality is outstanding through ISO 800. Even better than using my Pentax K5 with a 18-135mm fully extended and shooting into backlit subjects. The kit lens on the NX200 had close to zero CA or purple fringing.Now for the negatives:Raw files are a pain. They take far too long to clear the buffer. The software provided is archaic.Videographers - buy something else. There is no mic jack, there is jello, and for as nice as 1080p is, Samsung could have made the camera more user friendly in the video dept.Ergonomics takes some getting used to using. The camera is small. Granted, it has a big sensor and lots of juicy megapixels...BUT...I found myself repeatedly bumping the 'single shot'/ 'multishot' toggle with my palm while walking around with it. I never had that problem with my NX100. Also worth noting is that the buttons on the NX200 are smaller than on its predecessor.Be prepared to get extra batteries and a different USB cable. I was able to get 155 images on a single charge; the provided USB cable is short. Unless you're using a laptop or a computer with front loading USB ports this could be a problem for you.I would highly recommend the Samsung NX200 to anyone interested in upgrading from a point and shoot, for those considering a compact camera system, and for DSLR users who desire a lighter load. If the lack of a viewfinder, slow Raw write speeds, and so-so video capabilities are not deal breakers for you, this could be the camera you've been waiting for.", "Date": "May 13, 2012"}, {"Title": "Great Camera!", "Author": "Carlos Isaac", "ReviewID": "RF708O72PIO9V", "Overall": "5.0", "Content": "Amazing product.Clear pictures with the kit lens, very low noise till ISO 3200 and THE BEST user interface I've ever used on this size of camera. For $600 it's hard to find anything better.I shoot RAW and really don't have any problems with the camera writing speed.", "Date": "June 22, 2012"}, {"Title": "NX200 review", "Author": "Sotirios KARPOUZIS", "ReviewID": "R2BLVT95LUDC40", "Overall": "5.0", "Content": "This camera delivers excellent quality photos overall.At a price below USD 400 it is a value for money item.", "Date": "February 17, 2013"}, {"Title": "Love it", "Author": "Amazon Customer", "ReviewID": "R1SRM9SP31XOER", "Overall": "5.0", "Content": "I love this camera. The size is great. Not to big, but for a compact camera it takes great photos. Can't wait to get out and take photos after photos.The options are so easy to acess.", "Date": "July 14, 2012"}, {"Title": "Update ROM", "Author": "starjw", "ReviewID": "R30TO961C65AOW", "Overall": "4.0", "Content": "I'm not professional, often i used i-function or smart, firstly bought I got very bad pictures, the focus is not clear, but after updated ROM to 1.02 the image become perfect clearly and color also perfect.", "Date": "December 21, 2011"}, {"Title": "Awesome Camera!", "Author": "Matt Wendorf", "ReviewID": "R1WVF4JJHVA9TQ", "Overall": "5.0", "Content": "This thing is great and has all the bells and whistles you need to get into photography.My only disappointment was that Samsung seemed remove this camera from their lineup and it does not support a shutter release.", "Date": "August 28, 2013"}], "ProductInfo": {"Price": "$899.00", "Features": "Expert Image Quality\nProfessional Just Got Easier\nPerfect In Any Light", "Name": "Samsung NX200 20MP Compact Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51KPzw3-nNL._SY300_.jpg", "ProductID": "B005IQGUIM"}}