{"Reviews": [], "ProductInfo": {"Price": "$1,950.00", "Features": "Professional 8 Channel H.264 DVR, iPhone, Andriod Viewing. HDMI & VGA. MAC compatible. Windows Graphical interface; embedded real-time Linux 2.6 operation system. Preview, record, playback, backup, network surveillance. USB2.0 Backup, PTZ Control\n8 Channel H.264 video compression format; support D1 resolution HDMI output for better resolution MAC compatible - Safari 5.1 web browser ADPCM audio compression format Windows Graphical interface; embedded real-time Linux 2.6 operation system PTZ Control Multiple operation modes (Preview, record, playback, backup, network surveillance and Mobile monitoring) The video package time is adjustable USB2.0 backup, upgrade and mouse operation Multiple language OSD\nGW781A: Professional 1/3\" SONY EXview HAD CCD II Camera. 700 TV lines, 9~22mm varifocal lens, 72pcs IR LED, 196 ft IR Distance. WDR(Wide Dynamic Range). OSD Menu. Great Image, Great for Entrance.\nSony Effio-E Camera With Varifocal Lens  Features:  2011 New arrival IR CCTV Camera 1/3\" SONY EXview HAD CCD II Enhanced Features and Fine Image Processor OSD/NR/BLC Zoom & focus outside adjusting Suitble for wall & celling installing Auto Gain Control Electronic Shutter Adjustment Great for outdoor security\nCamera Power Box:  Camera Power Box for Security Cameras. New Technology! PTC fuse protection for Circuit Short, High Voltage, and Over Current. Consolidate all cameras power (12V, 9 port, 10A) to one central location. Heavy duty metal case.  LED indicator for each power output.    Don't have to replace burned fuses Positive Temperature Coefficient (PTC), Auto Reset Fuse Wall Mount Metal Box", "Name": "Complete Professional 8 Channel Real Time Network HDMI DVR (500GB HD) Security Camera CCTV Surveillance System Package w/ (6) Pack of 700TVL 9~22 mm Varifocal Lens, 72 pcs IR LED, 196 feet IR Distance Outdoor Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/51do0P5fKrL._SY300_.jpg", "ProductID": "B005HRPNFS"}}