{"Reviews": [{"Title": "Good camera, poor software and support", "Author": "Mark D. Robbins", "ReviewID": "R268SF4MZU9R3E", "Overall": "2.0", "Content": "The picture quality with this camera is very good and the remote controls work reliably well. The sound quality is poor but OK if you were just going to use this as a baby monitor rather than to hear a conversation. Connects well in an internal home network or wireless network.The problem with this product is that it will not connect as an internet camera. Unlike other products that provide connections through an external website maintained by the manufacturer this camera has no such support. You cannot connect to the camera from outside your own home network. The instructions provided do not resolve this unless you can subscribe to a service assigning you a static IP address. The instructions are helpful they simply do not work if you wish to connect to this camer over the internet. Lots of other IP cameras will do so, so you should shop for those if this is important to you.", "Date": "December 7, 2012"}, {"Title": "Foscam", "Author": "cabear", "ReviewID": "RK8XSJRDNFXNC", "Overall": "2.0", "Content": "I could not get the software to install properly. The seller was a great in trying to help me, but it is hard passing emails back and forth. I did get the camera to work, had great picture. But could not utilize other features because of the installation.", "Date": "September 6, 2011"}], "ProductInfo": {"Price": "$127.99", "Features": "Allows remote Pan/Tilt control (Pan:300deg& Tilt:120deg)\nNight vision (up to 8 meters) via auto IR-LED illumination\nHigh image & video quality (Display resolution: 640 x 480 Pixels (300k Pixels)\nTwo-way audio monitoring\nAllows for remote viewing & recording over LAN or the internet through PC and mobile devices ...", "Name": "2 Pack Foscam FI8918W Wireless / Wired IP Camera - White", "ImgURL": "http://ecx.images-amazon.com/images/I/41wOJhSBY1L._SX300_.jpg", "ProductID": "B005CMN8EQ"}}