{"Reviews": [{"Title": "Camera", "Author": "Terry DiBenedetto", "ReviewID": "R27O10SOC1OIQA", "Overall": "4.0", "Content": "Good for children ....my grandchildren love this camera and it is very easy to use ..I would recommend this camera", "Date": "January 29, 2013"}, {"Title": "Cute little Camera", "Author": "Tawnya R. Gurney \"Gram G\"", "ReviewID": "R242MASAPKMEQX", "Overall": "5.0", "Content": "It was just what my Granddaughter ordered! She loves taking pictures with it and has been able to use its features.", "Date": "January 21, 2013"}, {"Title": "Great Camera For Personal Use or Gift !", "Author": "Charlie", "ReviewID": "RXXZF4W0ZBHXC", "Overall": "5.0", "Content": "This is a great camera I purchased a few of them. Most of them I gave as gifts and one we kept to take on trips. We are very pleased with it and we got nice responses from the people we gave them to. Its a great camera for under 100 bucks. definitely recommended !", "Date": "December 3, 2012"}, {"Title": "Good camera for kids - spend more money if you're looking for an adult camera.", "Author": "Todd H", "ReviewID": "RQH2YJ7UR1PJ4", "Overall": "4.0", "Content": "I gave this camera 4 stars considering the price and what it's used for ... we bought this for our 8 year old daughter to play around with, it should not be considered for an everyday primary camera.  It takes okay pictures but not good enough if you're looking for a camera to capture your family moments.  This is a good low end camera and it's held up great to the frequent drops.  The battery life is good and my daughter also likes using the video camera.  For a kids camera it's 4 stars ... if you're looking for a primary camera I would give it 1 star.", "Date": "December 9, 2013"}, {"Title": "Pink camera", "Author": "cny", "ReviewID": "RPSMRC3ZXKIEB", "Overall": "3.0", "Content": "Great for a 5 yr. old, pictures are good, the ease of use is great, but if the flash is used it does eat batteries.", "Date": "August 6, 2013"}, {"Title": "great gift", "Author": "Elle \"Lita\"", "ReviewID": "R3B9B77S8QJ8YM", "Overall": "4.0", "Content": "I bought this for my 6 year-old granddaughter for her birthday. She was delighted and took a lot of pictures and film clips.  The pictures are very nice and the film clips are great. My only complaint would be how fast it burns through batteries. It uses AA and she went through 2 sets the first day. I ended up buying a rechargable set for her so she can have batteries every day. A rechatgable unit would have made this a 5 start gift.", "Date": "March 25, 2013"}, {"Title": "Great Camera !!!", "Author": "J", "ReviewID": "R17YGF7ZBIMSZL", "Overall": "5.0", "Content": "I BOUGHT THIS CAMERA FOR MY SISTER AND HER FRIEND THEY BOTH LOVE IT ! THEY TAKE IT WHERE EVER THEY GO ! VERY PLEASED WITH IT AND VERY HAPPY WITH THE PRICE. I HAVE USED IT A FEW TIMES MYSELF. FOR A CAMERA UNDER $100 IT WORKS VERY NICELY. VERY PLEASED !", "Date": "December 3, 2012"}, {"Title": "Kodak Camera", "Author": "d Merritt", "ReviewID": "R3JW92DGPN1UR8", "Overall": "2.0", "Content": "The camera comes in a package that looks like it is for a 5 year old.  This should be displayed and not just the camera.  I would have not have purchased the camera if I saw the packaging although my daughter does like the camera.", "Date": "February 27, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005KBUU9K"}}