{"Reviews": [{"Title": "Fantasic Camera's but not without an occasional hang.", "Author": "Raymond Boettcher", "ReviewID": "RULGTJXOW9XG6", "Overall": "4.0", "Content": "I have used these camera's with Webcam XP to record videos.  The quality from them is pretty good.  The controls for the camera are pretty easy to use from the web interface and from a program I downloaded onto my Android Phone.  My only issue with these camera's is that once in a while they will \"reboot\".  When this happens, they go through a sequence of movements during startup.  I guess to test it's movement ability.  However, once its done it will be facing whatever direction it chooses and I'll have to go back into the settings to move the camera again.  This only happens once or twice a week, but annoying enough to make me want to take the motor out.", "Date": "October 15, 2013"}, {"Title": "All eyes open", "Author": "chad rhutasel", "ReviewID": "R1PLACUYEWIO25", "Overall": "5.0", "Content": "Having an extra set of eyes is remarkable. Took some time with online chat to get set up but they were very helpful. Peace of mind is priceless. Anything happens when I'm not there will be recorded at the first sense of motion. And the night vision is quite clear. Will buy more if I ever need them. The remote operation is awesome.", "Date": "February 9, 2013"}, {"Title": "Limited Product", "Author": "PJDSR", "ReviewID": "R3N9S39O10357R", "Overall": "2.0", "Content": "These were a cinch to set up, great 50' video, long range not so great, but these aren't designed for long range. The tilt pan feature is good. If you invest, spend $50 and get the Blue Iris software; it makes them so much better, plus you can add 20 more cameras! Click and zoom with it, click and pan with it; the software is worth the $. The cameras are pretty cheaply built, don't get them wet! For bottom level cams, they are OK; if you want a real system, get wired cameras.", "Date": "December 14, 2012"}, {"Title": "Good 4 Me", "Author": "Hi", "ReviewID": "RHPCI5T4AQVY1", "Overall": "4.0", "Content": "This is the second set we have. I enjoy them. They work well for what I need. the only neg I have is the 2 way audio is iffy. lately on my first set(only 6 mo old) I get a \"listen Fail\".Set up was easy. wireless and remote setup medium. I went on youtube watched some video and followed the steps.", "Date": "March 16, 2012"}, {"Title": "Great!!", "Author": "Lucy", "ReviewID": "R3H10P3I33830G", "Overall": "5.0", "Content": "DerrickThis product is awesome, Derrick was great.Helpful and easy to work with.I will re-purchase this item again if Derrick helps me.", "Date": "August 22, 2013"}], "ProductInfo": {"Price": "$192.99", "Features": "Simple setup, Friendly GUI, DIY installation.\nHigh image & video quality, Two-way audio monitoring.\nAllows remote Pan/Tilt control (Pan: 300°; Tilt: 120°).\nFreely control IR LED ON/OFF.\nAuto IR-LED illumination for night vision (up to 8 metres).", "Name": "3 Pack Foscam New Version FI8918W Pan & Tilt Wireless IP Camera - Infrared Night Vision, 2 Way Audio, Motion Detection Email Alert, White", "ImgURL": "http://ecx.images-amazon.com/images/I/51LlL%2BKvR1L._SY300_.jpg", "ProductID": "B00574MCIW"}}