{"Reviews": [{"Title": "don't do it", "Author": "erin lieb", "ReviewID": "R3GMPX96BHUKEW", "Overall": "1.0", "Content": "horrible out of focus pictures. i have tried so many setting and i cannot seem to get the pictures to be in focus.", "Date": "January 10, 2012"}, {"Title": "Fantastic pics", "Author": "C. Irving", "ReviewID": "R3LYCUCK09Y0I3", "Overall": "5.0", "Content": "Took me about an hour to 'learn' the camera.  But once I did, it takes fabulous pictures!  I was so impressed.  I previously had a Canon, and was nervous about going with Fuji, but I am really glad I did.  Packed with features, and the video feature is crisp.  Very happy!", "Date": "December 10, 2011"}, {"Title": "Not loving this,,,,,,,,,,,,,,,", "Author": "Dave", "ReviewID": "R6574NFGRP325", "Overall": "1.0", "Content": "Got this through Groupon, glad I did,,,,,,,, cause I am not loving this camera.  Glad I saved the dough.Actually, I wish I had used it right away so I could send it back.  Guess it is destined for the trash can.  More than half the pics are out of focus,,,,,,,,, set on automatic!  Most of our Thanksgiving photos are bad, very upsetting.Never seen a pocket camera do this.  (sigh)Moi", "Date": "November 29, 2011"}, {"Title": "ick!", "Author": "Phil Green", "ReviewID": "R1Z5PLP4AA3JU3", "Overall": "1.0", "Content": "i thought fuji made good cameras. i also bought this with a groupon. i sat front row at a concert and took lots of pictures. let me just say that i have at least 10 digital cameras, dslr, point and shoot etc. nikon, several canon, a lumix and i'm about to buy the sony N5. this comes in dead last. i'll probably just give it to someone or dump it.", "Date": "December 1, 2011"}, {"Title": "good camera", "Author": "Ivy", "ReviewID": "R3P52UFRAVLWMS", "Overall": "5.0", "Content": "it's a good camera. it's very light, easy to carry. It has an amazing HD recording function. I often use it as a small video camera. I would recommend to everybody who wants a portable small camera.", "Date": "July 17, 2012"}, {"Title": "4.5 out of 5 stars", "Author": "Camino", "ReviewID": "R321GTAUGG82GK", "Overall": "4.0", "Content": "I purchased a FinePix JX420 for a Christmas present for me and my wife.  Unfortunately, the camera hit the pavement during my daughter's graduation in June.  Since my wife was already used to using this camera, I had to do a hard search to find another one since it was discontinued after Christmas.  Amazon saved me this time.  As for the camera itself, if it had a separate button to go from picture mode to video mode instead of searching through the menu then I would have given it 5 stars instead of 4.5.  Other than that, the camera came in on time and in perfect condition, as expected.", "Date": "July 6, 2012"}, {"Title": "Great and easy P&S;", "Author": "Travis R. Cole \"T.Cole\"", "ReviewID": "R3Q6QX0H8HXQ3O", "Overall": "5.0", "Content": "I also got this from the groupon deal, but I haven't seen any problems with the camera.  I own a Nikon dSLR and got this for my wife to have because she doesn't like to use my camera.  It was easy to setup and very easy to use.  It has an automatic setting that will automatically select the mode it thinks is best for the situation.  When I took a picture of my wife it automatically selected the portrait setting and detected her face to focus on.  I will have to use the camera some more in difference situations and will update my review at that time, but so far I am impressed with it.  It is small and light.  It could very easily be put in your pocket or a purse/bag.  We will be taking it anywhere I don't want to lug my big camera around.The negative reviews must be from someone that really has no idea how to use a camera.  Anyone can take bad pictures with any camera and although the camera is easy to use it is probably just as easy to take a bad picture with it.  Lastly the concert person that says they had bad pictures was shooting in conditions that are hard to shoot even with the best dSLR camera and there was a reason they all had thousands of dollars worth of camera equipment.  It is a good camera for the price, but it isn't a pro camera.", "Date": "January 13, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005ZVAG1M"}}