{"Reviews": [{"Title": "Better than working through the DVR", "Author": "Ace Mcinturff", "ReviewID": "R2IT9FCV2PWQ3", "Overall": "5.0", "Content": "We're using this to control PTZ (Pan, Tilt, Zoom) cameras.  A common use is to use a DVR to record pictures from the camera, and the two DVRs we use each have an RS 485 control port to direct the aiming of the camera.  To use the DVR to control the 485 port, however, requires you to bring up the menu on the DVR (interfering with the picture) and mouse click your way through the menus to get to the controls for the camera.  This remote controller enables you to CONTROL the camera completely independently of what is going on with the DVR.  Instead of plugging the RS 485 control line from the camera into the DVR port, plug it into this controller and you can use the included remote to aim the camera completely independently of the DVR, which is then only recording the image from the camera.  The image capture from the camera and aiming it are two separate functions.  This gadget works great and solved an annoying problem.  we will be ordering at least two more.", "Date": "September 13, 2012"}, {"Title": "Works well away from the wires", "Author": "Freddy", "ReviewID": "RDY9S8KJHBE1O", "Overall": "4.0", "Content": "Nice not to be yoked to the wired controller; a little tricky getting the hang of it but worth the price.", "Date": "March 31, 2014"}, {"Title": "Nice Remote for PTZ Camera", "Author": "Amazon Customer", "ReviewID": "R1M4P4H9D7QPEX", "Overall": "5.0", "Content": "This is a nice Remote control for our PTZ camera.  Very limited instructions come with the product.  No user manual to tell you how to hook it up.  I had to call DIYSecuritycameraworld for help.  Which they where VERY helpful and told us how to hook it up.  Since we have learned from the seller how to hook it up we are buying another one to have on hand.", "Date": "July 16, 2013"}, {"Title": "Great Camera Controller for Cheep!", "Author": "Steven W. Bracy \"Tower Dog\"", "ReviewID": "R3NZCTYTE54XTU", "Overall": "5.0", "Content": "This product works exactly as described, is well built, and dirt cheap.  What's not to like?  I have several RS-485 PTZ cameras that were useless without this controller.  It's pre-programmed with the standard functions and works right out of the box.  Amongst others there's Up/Down, L/R, Zoom, Focus, and manual Iris adjustment.  If You need one, this is a good option!", "Date": "April 4, 2013"}, {"Title": "Nice .", "Author": "Tom", "ReviewID": "R1RY40JNMVEA6Y", "Overall": "5.0", "Content": "This isn't bad at all . It is wireless so it will not work like a wire but for wireless , it is great... I nee one now for my wife daycare ... Pan N Tilts 3 different cameras and that is what I was looking for.. Most don't say anything about how to run two or more but the Web. site did. Just splice the wires in the 485 connector and run the wires to each camera and enter the code you set the cameras at and then punch in the code for the camera you wound and she is up and running but remember after you  punch in the code also hit CAM ...", "Date": "December 28, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005EOV3LM"}}