{"Reviews": [{"Title": "Simply Extraordinary", "Author": "Cynthia", "ReviewID": "R3IXLQ9IK3LE3Y", "Overall": "5.0", "Content": "This is my second Leica digital rangefinder camera. I saved up to buy an M8 not too long after they were introduced only to find the camera superseded just a few months later by the M8.2 and then made entirely obsolete by the M9. More important, certainly, was that I was never overwhelmed by the picture quality from the M8.  It always seemed that I obtained better results with my Nikon D300, so the M8 never became an integral part of my shooting repertoire.After reading all the glowing reviews of the M9 I decided to try the Leica rangefinder one last time (I have three wonderful lenses that I used with the M8 and before that with an M6), so I sold both my M8 [at a considerable loss] and my entire Panasonic micro 4/3 kit (which was actually a very nice interchangeable lens digital camera system) to finance my purchase of the M9.  Although I purchase most of my camera equipment through Amazon, I purchased my M9-P from a Leica dealer because Amazon did not have the camera in stock at the time.  Obviously, there is no particular difference between the M9 and the M9-P, other than essentially cosmetics, so this review applies equally to both versions of the camera.My initial reaction on removing the camera from its box for the first time was that it is infrequent and, perhaps, rare these days to obtain such a high quality piece of equipment.  The camera feels perfect in the hand, well-balanced and fairly small, yet with a certain heft.  As odd as it sounds, is a real joy to hold and use.  Further reactions on using the camera for the first time were that the electronics are light years removed from those of the best DSLRs of today.  I am fortunate enough to have a Nikon D800 as well, and the automatic metering system in the Nikon far surpasses that of the M9.  Write speed to storage media in the Nikon is orders of magnitude faster than in the M9.  Further, where with the Nikon I just, literally, point-and-shoot to obtain [usually] a great picture, I've found that shooting with the Leica requires thought and consideration.  I cannot just point the camera in the direction of the landscape and expect a properly exposed image, as I would obtain with the the D800.  Instead I frequently have to point the camera towards the ground to avoid an underexposure caused by the M9's old-fashioned metering system.  I check the histogram frequently.  And I encountered many more out of focus shots with the Leica.  The rangefinder is great but it is no match for the Nikon's autofocus system.Where the Leica really shines, however, is in final image quality, and isn't that why one buys a camera of this type in the first place?  Although the M9's sensor has half the number of megapixels as the sensor in the D800 I've found that, when comparing identical test images of landscape scenes, shot side-by-side on a tripod, the images shot with the Leica, without exception, exhibit greater acuity, depth and, surprisingly, sharpness than those shot with the D800.  My purpose in this review is not to bash the D800, as it is an important and essential tool in my work, but rather to point out that in a comparison with this extraordinary camera, the M9, in my personal opinion, comes out on top.I love the image quality produced by the inimitable Leica lenses, the way the camera feels and its light weight and portability.  I haven't enjoyed photography this much in a long time!", "Date": "May 27, 2012"}], "ProductInfo": {"Price": "$7,995.00", "Features": "Display glass made of Sapphire Glass\nVulcanite leatherette covering for better grip and longer lasting life.\nPure Leica look without Leica logo and M9 lettering on the front side\nClassical \"Leica\" engraving on the top cover.\nAvailable in classic Black paint or Silver Chrome.", "Name": "Leica M9-P 18MP Full-Frame Digital Rangefinder Camera (Silver Chrome)", "ImgURL": "http://ecx.images-amazon.com/images/I/51-I%2BOSo9pL._SX300_.jpg", "ProductID": "B00579W0AW"}}