{"Reviews": [{"Title": "Great Purchase", "Author": "Shaw", "ReviewID": "R24TVL9PF7H5CP", "Overall": "5.0", "Content": "I was impressed with the security camera and the LCD picture monitor by Lorex.  This particular model worked great for me right out the box.  Easy set-up, just find both sources, the LCD monitor and wireless camera a power source and you are good to go.  I bought the model over the others simuliar because of its unique feature to talk to people before or after they rang the doorbell.  People were shocked----the audio alert on the LCD monitor, will alert you when the camera detect motion, and you can immediately speak to people as the get out of the car or as they are walking up to the door.  I heard some negative review about the Lorex brand, still went with them anyway....I never read the owners manual to operate, no customer service calls needed.  The cons, if any, I wish you could upload your personal pictures with the screen saver and if the pictures could change like regular photo frames.  *** And I will look into trying to see how to get another reciever for downstairs to work with the cameras---if I can make that happen with the unique intercom feature that would be awesome.  3 Days with the product so far----no complaints.", "Date": "August 20, 2012"}, {"Title": "Careful about Overpricing of this", "Author": "BOMINGO \"bomingo\"", "ReviewID": "R2MQ58O0OVYOZT", "Overall": "5.0", "Content": "This won't get posted, but this can be purchased almost anywhere for about $340-$350.00.Excellent system though.  Extra cameras are indeed expensive.  You only get two cameras for a system designed for 4 cameras.", "Date": "May 15, 2012"}, {"Title": "This is the best you can do short of spending thousands on a custom-installed security system", "Author": "jdibella", "ReviewID": "R3TAOH6C5Z65Y5", "Overall": "4.0", "Content": "This works as advertised.  It is a wireless system, so all you have to do is find somewhere to plug in the camera.  I installed one camera under the front porch roof and ran the power wire through a window to an outlet.  Not elegant, but good enough until I break down and hire an electrician to run a dedicated line.  Whatever that costs, it will be less expensive then running wires throughout the house for a traditional security system.  The video image is good both day and night.  It records as soon as there is movement and continues for 30 seconds.  When someone comes to the door, you can talk to them through the intercom.  I have not had any of the problems noted in some of the other reviews.  The signal is good, despite the fact that the camera is on the other side of a brick wall and about 30 feet away from the display screen.  The only drawback is that the camera needs to be protected from the weather, so you can only put it somewhere around your house that has an overhang.  This will be the limiting factor in deciding how many cameras (it can take up to four) you can use with this system.", "Date": "April 21, 2013"}, {"Title": "DOES NOT WORK", "Author": "John W. Watson", "ReviewID": "R3SGHOY4QFZ9DU", "Overall": "1.0", "Content": "I purchased this item last November and have been trying to get it working since then.  Technical support is useless if you can get through to them.  They create tickets which they cancel 24hours later on their initiative.  They offer callback which they never do. Sent an email to the CEO (Reuben Klien) - no response. I consider a waste of money DO NOT PURCHASE if you are concerned about your household security. My experience leads me to believe good reviews have been written by Lorex.", "Date": "February 25, 2013"}, {"Title": "disappointed in performance!!!", "Author": "Edward S.", "ReviewID": "R3PEQ51OP30L5I", "Overall": "2.0", "Content": "The picture quality is very good for both day and night vision.  However, the sound would cut in and out.  The picture would also freeze a for several seconds at a time.  I expected far better for the price paid.  I tried to contact Lorex directly to get techincal help.  I was on the phone waiting for OVER AN HOUR.  I gave up and finally hung up.  Lorex was kind enough to send me an email saying they will get back to me within a week to see about my problem.  If that is customer service with a new product under warranty, I hate to see how I will be treated when it is out of warranty.  Needless to say, I returned it.  I now purchased the uniden uwd20553.  It is also a high end unit and it performs like one.  It has a very good picture quality.  I never looses sound and the picture does not freeze.  So far I am very satisfied with uniden.", "Date": "February 22, 2013"}, {"Title": "Good resolution but some technical limits", "Author": "jmiller", "ReviewID": "R1WLVBD2PX2YNJ", "Overall": "3.0", "Content": "Can't add a second monitor or show on your computer and the monitor simutaneously. Setting up Skype to view it is complicated.", "Date": "February 13, 2013"}, {"Title": "Clumsy video reveiwing", "Author": "J. Terry", "ReviewID": "RP9ZI9FVF1QIH", "Overall": "2.0", "Content": "I have, I use it, but not as I would like.  The video replay is awkward and clumsy.  Not user friendly.  I'd suggest finding something more practical.", "Date": "January 2, 2014"}, {"Title": "Lorex LW2912 Wireless Security System", "Author": "Michael G. Busby", "ReviewID": "R35XI82B4LLR5V", "Overall": "4.0", "Content": "The wireless communications is very good (has never failed).It would be nice to be able to vary the record times rather than the two provided.  This would let one camera to time out and allow another camera in the system start recording as the target moves closer to the house.", "Date": "July 6, 2013"}, {"Title": "Quality Do-It -Your-Self System.", "Author": "mahoward75077", "ReviewID": "R1SEJL4AV98G8E", "Overall": "5.0", "Content": "Excellent picture and sound quality. System is easy to install for the do-it-your-selfer. Our system has been running for three weeks through freezing temperatures and heavy rain. I can report it is still working great!", "Date": "April 27, 2013"}, {"Title": "Best for the price!", "Author": "Elvance", "ReviewID": "RGVJV2867AWW9", "Overall": "5.0", "Content": "This is the 3rd Lorex system I bought from Amazon. Two of these and one other model over the past couple of years. For this ridulously low price, No other company that I\"m aware of makes this quality wireless system, with so many features.  The  compact remote controls everything, so learn it and you have a winnner. But remember, it's about a  quarter to a third of the cost of the high end systems, but again, for the price it can't be beat. No matter where I setup the cameras, about 40 to 60 feet away from the monitor, just plug them in and in seconds watch the color views (daytime) or black and white (infared for nightime) pop out on your 9 inch monitor. Really  a great system for this price! I've tried the rest and now I have the best!", "Date": "January 25, 2013"}, {"Title": "Awesome system", "Author": "George, Ocean NJ", "ReviewID": "R3GEXSHRRIJQOB", "Overall": "5.0", "Content": "Great video system works better then expected. I have recommended  it to friends once they seen how well it worked they also bought this system. System has been in service more then six months and it works fine. I did install a 32gig card for more room. Worked great while in Aruba. Watched the cams on my cell phone.", "Date": "January 12, 2013"}, {"Title": "George M. From Anchorage , Ak", "Author": "George M.", "ReviewID": "RBJ519MUYBG5D", "Overall": "4.0", "Content": "It works great but to review what's going on when you are at work you have to hook up you computer to the system.  Then you can log in with your Iphone if you want to.  So I sent it back for that reason only.  But it works great.", "Date": "May 12, 2013"}, {"Title": "TWO CAMERAS WENT BAD IN 8-9 MTHS AFTER INSTALLING - RETHINK THIS PURCHASE !", "Author": "POLICE MILLENIA", "ReviewID": "R39X1FKBLBSOON", "Overall": "1.0", "Content": "AFTER ABOUT 9 MTHS TWO OF MY CAMERAS ARE BAD WITHIN A WEEK PERIOD. ONE DOES NOT GO BACK TO COLOR AND NEEDS TO BE RETURNED AND A SECOND CAMERA IS FUZZY WITH LINES AT NIGHT TIME ONLY, BUT IF YOU TURN A LIGHT ON IT LOOKS PERFECT.SO I AM NOT HAPPY I HAVE TO UNINSTALL TWO CAMERAS AND MAIL THEM BACK AND THEN REINSTALL TWO CAMERAS AND WONDER HOW LONG THESE WILL LAST. MAYBE A LOT OF MONEY WASTED IF THESE CAMERAS DIE WITHIN A YEAR OR LESS SINCE I OWN SIX CAMERAS AND TWO MONITORS. I WOULD NOT RECOMMEND THIS SYSTEM ANYMORE.NOW I AM HAVING PROBLEMS WITH A THIRD CAMERA IN 2.5 WEEKS. IT IS FUZZY WITH LINES AND IS NOT ON THE SAME MONITOR SYSTEM AS MY OTHER CAMERAS. I WISH I HAD DONE MY RESEARCH AND NOT SPEND CLOSE TO A THOUSAND DOLLARS ON SIX CAMERAS AND A RECORDING SYSTEM THAT IS COMPLETELY GOING BAD AFTER ABOUT 8-9 MTHS.WHAT A PIECE OF JUNK ON A SYSTEM I DID SUCH A NICE CLEAN INSTALLATION ON.", "Date": "April 24, 2013"}, {"Title": "security", "Author": "lege \"lege\"", "ReviewID": "RHTDLWE7KZ31K", "Overall": "2.0", "Content": "The big and very strong advertisement but quality is very poor, do not use wireless, for the same price I did buy full wired security system.", "Date": "May 28, 2013"}, {"Title": "Lorex", "Author": "Tina Daugherty", "ReviewID": "R2D16WJB7UL56U", "Overall": "3.0", "Content": "These cameras may be a good product but It doesn't work for me.  I need a camera for indoors to look out and all you can see is the glare on the window bouncing back from the camera.  It isn't an outdoor camera either so that isn't really an option without having something to cover it.  I would have returned it but it is a hassle.", "Date": "April 8, 2013"}, {"Title": "Advanced wireless monitoring", "Author": "Jiang Jun", "ReviewID": "R3P3A4K5WX5JS8", "Overall": "5.0", "Content": "Buy Lorex LW2912 Wireless, Video Monitoring System is used to view his son's activities at home in the unit through the network, both installed in the room, two installed outdoors.Advantages: 1) a strong wireless capabilities, an interval of two concrete walls, you can normally receive the signal; 2) around the dimmed display black and white, surrounded by the light to show color, light sensitivity is high; 3) surveillance cameras, and LCD panel exquisite.Disadvantages: 1) Introduction outdoor camera, but not waterproof, can not be installed outdoors rain to; 2) The video can only record a camera, the defect is very rough; 3) preset memory standby picture, fine resolution is not enough; 4) had wanted to buy a 7-inch LCD, feeling the 9-inch LCD will be even greater, the content displayed will be finer, but the fact that the effect should be the same, the camera resolution is not high enough, similar to the analog camerathe first 480 lines.In short, as the monitoring and recording equipment, the Lorex LW2912 belongs to Simple, mounted on the wall, placed in the bedroom, is a very cool, very stylish device.", "Date": "May 24, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005GK7Z4S"}}