{"Reviews": [{"Title": "LOVE IT!", "Author": "KailuaGirl", "ReviewID": "RCK1TH105QERP", "Overall": "5.0", "Content": "Great Bundle for a GREAT camera. I am so happy with my purchase- Focus Camera made our Christmas this year. I've been snapping away and the pictures are great. Thank you FOCUS CAMERA- Excellent Customer Service- very pleased!!", "Date": "December 21, 2011"}, {"Title": "Taking advantage of the customer", "Author": "Filterlid", "ReviewID": "RRYSKPGLH0SDO", "Overall": "1.0", "Content": "I purchased a Sony NEX5 camera, when we received the camera the view screen was defective, I contacted Sony and they had me send the camera to there Texas repair center. I included a letter with the returned camera with all my contact info, a couple of weeks went by and I received my camera back, I was excited, until i opened the box and found they had done nothing! So I called them and they said the problem was caused by the customer and they sent it back with out letting me know because they could not find any contact info. The interesting about that is when you call them everything is automated to a point, and the first thing you have to do is put your phone number in so they can find your account.WHAT! You can't call me but you need my number so the system can find my account. (Stupid Sony). Now back to the camera, I was told the problem with the viewing screen peeling up on one corner and it was created by the customer. Let's see I or anyone is going to buy a $750 dollar camera and go to work peeling the viewing screen off as soon as I open the box, if you looked to see how hard you would have to work to do that and then why would anyone do that, it's hard to make sense of it, because it does not make any sense, that anyone would do that. Now things continue to get worse! After many calls and hours trying to resolve the issue I finally said go ahead and fix it, I want my camera. They gave me the cost of repair which was $85 dollars, In 2 weeks I get a call and they said my camera was repaired and ready to be shipped back. The problem was now that the cost of repair was now over $ 200 dollars, more than twice the amount quotedThey covered them self's by saying the first quote was not in writing and If I wanted my camera back I would have to pay the larger amount. What was I to do but pay and put up with being BLACKMAILED!! I have a Sony TV and a Sony stereo and now a Sony camera. Never again! I will never buy Sony again and will tell everyone what a lousy company Sony is. This was my first time buying through Amazon and I probably will never buy from anyone that doesn't have brick and mortar, so I can see and touch the products I buy, before paying. They may cost a little more but it is worth it. And in my case it would have been cheaper. I now have over $1,000 dollars invested in a $ 750 dollar camera and I am very bitter towards Sony. I will get over it the next time i buy a TV or other electronic device and it isn't a Sony.I am even putting a bumper sticker on my car that says (DON\"T BUY SONY)( BAD COMPANY),Please look at other reviews because I am not alone!! DON\"T BUY SONY OR (PHONY SONY)", "Date": "March 13, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Sony NEX-5NK/S 16.1MP Compact Interchangeable Lens Digital Camera in Silver w...", "ImgURL": "http://ecx.images-amazon.com/images/I/614rN8nXkCL._SY300_.jpg", "ProductID": "B005MZZD5U"}}