{"Reviews": [{"Title": "19\" w/1T HD", "Author": "CJ \"area526\"", "ReviewID": "RKOC1BAC4WCH3", "Overall": "5.0", "Content": "I purchased the 19\" w/1T HD. I can't say enough about this system.....it's GREAT! I've had surveillance systems since the 80's & without a doubt,this is the best & easiest to set up. You mount your cameras, run your cable, attach cable to camera & monitor, plug in camera power supply & then turn on the monitor......that's it. It's ready to go. You can go into the menu & set up time/date & so on. There's more in this system than I'll ever use....it is truly a professional system. The color pictures from the cameras are very clean & sharp from up close to 200yds away & I'm using a $40.00 GW dome camera. This unit comes in 2-4-8 & 16 channels  with a LCD monitor in various sizes from 10\" to 19\" that I've seen) and with/without a HD. You can get it from 500GB up to I think 3 TD. I choose the 1TD.....probably going to wish I'd got the 2 or 3TB in the years to come....but 1TB is a lot of recording time. The company GW Security who sell this unit is a top notch company with a Top Notch customer Service Dept. My 7-10 emails have always been answered in minutes. They have 24/7 tech support & that's really nice if you ever need it. I really can't say enough about this system or GW Security. If your needing a easy to use system that really doesn't take up any more space than a 19\" monitor ( mine being the 19\" model)....then this is it. One piece of equipment that doesn't take up much room at all but it does it all....remote viewing & even operates PTZ cameras without any extra hardware or controllers!!! This unit at $420.00 may not have a HD. I don't see one listed.....if your needing one with that, you might call/email Amazon/GW Security & ask & make sure. It doesnt cost much to add one. But without an HD, it'll still be a great surveillance monitoring system.", "Date": "May 3, 2013"}], "ProductInfo": {"Price": "$390.00", "Features": "Triplex functionality: Simultaneous Playback/Record/Network\nRecording mode: Continuous, Motion, Schedule\nReal time recording and video signal compression\nIndividual recording frame / video factor adjustment for each channel\nMotion detection / video loss alarm function", "Name": "Professional 8 Channel 19\" Color LCD DVR, LCD Digital Surveillance Video Recorder in One", "ImgURL": "http://ecx.images-amazon.com/images/I/51zjBi%2BgLlL._SY300_.jpg", "ProductID": "B0054LV1P8"}}