{"Reviews": [{"Title": "Can You Hear Me Now? (Yep)", "Author": "ROY WINTERS", "ReviewID": "R1UZR5H8LFYSPA", "Overall": "5.0", "Content": "Just as stated this is a sensitive audio pickup.  I have it on the front porch and that makes the audio 'bassy', but I can hear a car coming anywhere on the block.  I've run it through a CAT5e pair and there is some noise (to be expected on a 50' unbalanced cable run) but overall it is quite acceptable.", "Date": "April 27, 2013"}, {"Title": "Very sensitive", "Author": "Peter M. Plass", "ReviewID": "R18UCJI39AKKXS", "Overall": "4.0", "Content": "Love the small size, very easy to hide. Installed at a hotel front desk to monitor Employee's interactions with guest, This tiny microphone hidden behind a Card index is able to pick up all interaction at the front desk, also half way down the front hall and the office. Client was very please. Replaced the small sticker with a larger more obvious sign to make people aware of the audio monitoring.There seems to be a ground loop issue or something as there is a humm in the audio, Threw a ferrite core on the line. Helped some. Cut one of them open and found that the ground line is shared with the microphone and the power source (bridged) so wondering if that is the issue", "Date": "November 20, 2012"}, {"Title": "This Mic is amazing!!", "Author": "BSG", "ReviewID": "RAQWGWWQM1S2B", "Overall": "5.0", "Content": "I attached this mic to my ACTi camera that I use as a baby monitor and it works better than I could have ever imagined.  It works so well that I can hear my son breathing from across the room and can hear the clock ticking.  Highly recommend this mic.", "Date": "April 17, 2013"}, {"Title": "Awesome mic", "Author": "Cory T Gordon", "ReviewID": "R10T74A4VKZ98J", "Overall": "5.0", "Content": "Purchased it to place in our home. Works very well or what I needed it for. Only thing you will need to purchase a separate RCA male to male coupler to attach to your component you will be using. I picked up one from radio shack for $5.54. Works well!!", "Date": "February 21, 2014"}, {"Title": "Picks up more than ya wanna hear", "Author": "Echosyn", "ReviewID": "RH3ICEV38B5Y0", "Overall": "5.0", "Content": "Surprisingly strong and clear audio when I mounted this in a antique metal outdoor incandescent light fixture reflector dome 125 feet from the Pyle PF200 60 watt amplifier. Mic power is from a 9 VDC wall wart. Cable is a combo of 100' of XLR cable and 25' of Belden 8723 2 pair twisted and shielded 22 ga signal cable with RCA connectors at each end of the run. The two pairs are combined to make 2 conductors. In building the cable I maintained the twists, soldered the splices, taped each conductor separately, covered each splice with heavy duty aluminum foil to maintain 100% coverage and finished with Scotch 33 Electrical tape. Being a block from the freeway and its dull 24/7 roar, I gotta make it as directional as reason allows. Shotgun would be overkill so I'll work on the parabola tube angle.", "Date": "November 25, 2013"}, {"Title": "what?", "Author": "gBo", "ReviewID": "RMGW4Q8WFJBGR", "Overall": "5.0", "Content": "no more guessing what people are saying in the street. Haven't had one problem with his brand in fact I bought another one for the other side.", "Date": "January 6, 2014"}, {"Title": "Good value", "Author": "Sardonic", "ReviewID": "RWO77V8E93N9P", "Overall": "5.0", "Content": "Very sensitive and works as advertised. I have one at my front door and I can hear the neighbors talking in their driveway on both sides of my house. There is some associated noise, but nothing that affects the intended purpose.", "Date": "November 20, 2013"}, {"Title": "SEEMED OK, WORKED", "Author": "L. E. WAGNER \"ERIK\"", "ReviewID": "R3Q1JDLKZ8XNNE", "Overall": "5.0", "Content": "SEEMED OK IT WORKED WHAT MORE CAN I SAY? IT IS WHAT IT IS AND WHEN YOU NEED SOME THING YOU TRY FOR THE BEST PRICE BUT ALSO GOOD QUALITY", "Date": "November 19, 2013"}, {"Title": "Works fine, wish it came with a power splitter.", "Author": "Albie Beck", "ReviewID": "RIT69OOZR31S0", "Overall": "3.0", "Content": "After I bought it, I found other models containing a power splitter plug, which would have been far more convenient for installation.", "Date": "October 17, 2013"}, {"Title": "Excellent Device", "Author": "Shawn", "ReviewID": "RTX5S2UG8Y4MA", "Overall": "5.0", "Content": "Very powerful and easy to setup and use.  Device is only able to capture one channel  ( Mono Sound )", "Date": "October 2, 2013"}, {"Title": "VideoSecu High Sensitive Audio Pickup Device External Amplified Tiny Spy...", "Author": "Rafael", "ReviewID": "R1TXCS1JOC5TZX", "Overall": "2.0", "Content": "It did not work at all.  I am very disappointed because I expected it to enhance my surveillance capabilities on my cameras.  Although I have not returned it I would advise you consider all options when it comes to this device.  The price should have told me it was a fluke.", "Date": "February 21, 2014"}, {"Title": "good microphone but VideoSecure should be more clear on  which mic your getting.", "Author": "Michael Naughton", "ReviewID": "R3U3GV4WN1MT93", "Overall": "5.0", "Content": "i bought my first one it was sick with the power cable jumper. I bought this one thinking same product its just .75 cents cheaper today no power cable jumper so u need a power supply when the other one uses alittle bit of power from the camera....... for less then a dollar difference the one model# MIC03D its the only way to go.", "Date": "January 20, 2014"}, {"Title": "VideoSecu High Sensitive Audio Pickup Device External Amplified Tiny Spy", "Author": "J. Phillips", "ReviewID": "R1F3X0Q81CQ5BI", "Overall": "5.0", "Content": "VideoSecu High Sensitive Audio Pickup Device External Amplified Tiny SpyGot it to use with a Swann system for the one audio channel it has. It works very well so far.", "Date": "December 30, 2013"}, {"Title": "Nice and small", "Author": "James DeMichael", "ReviewID": "R2ZQTFVFA0EPZ1", "Overall": "4.0", "Content": "If you choose to add mics to your camera system these will  work just fine. You can attach and zip tie to wire for clean application. Remember to get 3 wire that accommodates mic and splitter for power. I have posted in previous reviews to PLAN your build. Know the specs and accessories needed before you start.", "Date": "October 15, 2013"}, {"Title": "Stay Away From this Device, Not Good", "Author": "Bassman", "ReviewID": "RIUYWZVKS6B5D", "Overall": "1.0", "Content": "No good sound quality, Not worth buying. The mics is bad and does not pickup things. This is true, you will be wasting you money.", "Date": "November 18, 2013"}, {"Title": "Works well.", "Author": "AntNewYork", "ReviewID": "RJ5T8JDS3VYEQ", "Overall": "4.0", "Content": "I've been using it for a couple months on my everfocus DVR security system. Its very sensitive, and picks up a lot of outdoor sounds.", "Date": "September 12, 2013"}, {"Title": "great mic.", "Author": "rargie", "ReviewID": "R1YITU8MT726SI", "Overall": "5.0", "Content": "I got this mic to use for a baby monitor, and it has been working well!  We can hear the baby really well, even when using a white noise machine.  great product, especially for the price!", "Date": "September 5, 2013"}, {"Title": "This is a GREAT product.", "Author": "bill schmitz", "ReviewID": "R7UM25WPBYM3Y", "Overall": "5.0", "Content": "This is a surprising little microphone the audio quality is impressive and it does produce a clear sharp audio over great distance.", "Date": "August 26, 2013"}, {"Title": "very poor doccumentation... oops NO doccumentation!", "Author": "Tim  Isenhour \"Timbo\"", "ReviewID": "R1K6N4L4N5YZDR", "Overall": "3.0", "Content": "For this reason, I only give it three stars.  If you are a mind reader, or have used this product before, then you know it requires a 12v DC power supply.  If you are a first time user, then you have to stumble upon this with lot's of research. No where in the description here on Amazon does it state this.  I'm sure the seller gives the descriptions to Amazon so I can't really fault Amazon for this.For this reason, I only give it one star... but, the price gives back two so it nets a three star review.", "Date": "July 5, 2013"}, {"Title": "Good", "Author": "Tvildo", "ReviewID": "R3N2JISNE08CX3", "Overall": "4.0", "Content": "Quite good microphone, only before installing make sure to fit it with normal quality device. I installed with rca to 3.5mm jack and it has some undesirable voices.", "Date": "June 7, 2013"}, {"Title": "Excellent sensitvity", "Author": "Jim B", "ReviewID": "R2IAUWCK049RUV", "Overall": "5.0", "Content": "I am very happy with this mic. I would buy it again if my system wasn't limited to only 2 of these.", "Date": "March 10, 2013"}, {"Title": "good for the price.", "Author": "R Gibbons", "ReviewID": "RK0E1HEPGHNED", "Overall": "4.0", "Content": "uses 12V DC power (such as used with many security cameras).Outputs audio signal that can go to DVR (digital video recorder for security camera system).It is nice to have sound with the security camera, it helps tell a more complete story.The sound quality is sufficient to pick up conversation, but not a high quality recording (you wouldn't enjoy listening to music recorded through this).  The audio level seemed a bit weak; I had to turn up the speaker volume twice as loud as I would for most audio devices (such as my smart phone which records sound and outputs audio to earphone jack) even when recording close by; but sound is good enough for security monitoring.The unit is small,  the build quality is sufficient but not great, (just simple heat shrink over components at end of cable).  For the price, I'm happy with this.This came with large (hand sized) red security monitoring warning stickers (nicer than shown in the picture).For a dollar more, the same company makes a version with 2 DC power connections (male and female), that allows you to share the 12V connection with the camera if you wish;  I also purchased one of these versions.I'd recommend this for security system audio recording.", "Date": "February 22, 2013"}, {"Title": "Great", "Author": "Anthony Araya", "ReviewID": "R3HZ87DB1HS692", "Overall": "5.0", "Content": "I bought 4 of this mics to add to my DVR cameras. I was pleasantly surprised with how much it  picks up, even some very faint sounds get recorded, and for the price, you cant go wrong.", "Date": "February 11, 2013"}, {"Title": "Works great", "Author": "Older \"Tom\"", "ReviewID": "R2OKZSX8FU9FTL", "Overall": "4.0", "Content": "I was surprised at the sound quality this little mike provides as I had it mounted in attic with just a small hole punched to place mike in", "Date": "December 31, 2012"}, {"Title": "Very impressed for the price.", "Author": "Michael Bass", "ReviewID": "RUS47SP1A05N7", "Overall": "5.0", "Content": "I have this microphone set up outside and connected to the 'audio in' on a 7\" LCD TV. The sensitivity is good, it can pick up a conversation clearly out to about 40ft. I've left it out in the elements, rain and lots of sunshine and it continues to work well. Remember you'll need a power source and cable for it to work. A 12v DC power supply sold in the 'security cameras' section of Amazon will work as will any of the RCA video/power cables sold in that section. I think I paid under $5.00 for this amplified mic, can't beat it.", "Date": "December 30, 2012"}, {"Title": "great little mic", "Author": "SPDKLLS \"Tim\"", "ReviewID": "R2IDYDQZL7K0SF", "Overall": "5.0", "Content": "Bought this for my Zmodo surveillence system..wasn't worried about sound from all cameras..just wanted sound from the front porch near the driveway to hear if someone pulled in...this works great..tucked it into the siding near the top of my covered porch but left a quarter inch sticking out...I can easily hear my neighbors across the road opening and closing their car doors and their kids outside playing....", "Date": "December 19, 2012"}, {"Title": "VideoSecu High Sensitive Audio Pickup Device External Amplified Tiny...", "Author": "wildroses", "ReviewID": "RPGAG51RCL5IB", "Overall": "5.0", "Content": "this pick up device is being used with my survellence camera that did not have a built in microphone now i can hear what i don't see on my monitor", "Date": "November 16, 2012"}, {"Title": "Its cheap but good", "Author": "Rl Shuey", "ReviewID": "RNEO73PGKPZMX", "Overall": "4.0", "Content": "It does a better job than I thought it would, but I still want a good shotgun Mic. I can't justify the cost of a good shotgun mic, but this will do untill I can justify spending the big bucks!", "Date": "September 3, 2012"}, {"Title": "I like it!", "Author": "yfbil", "ReviewID": "R12R4131VCJ2WP", "Overall": "4.0", "Content": "This little product far out surpassed any and alll of my expectations!!!  It is impressive at the rate of miniaturization of all products.", "Date": "July 13, 2012"}, {"Title": "Doesn't work", "Author": "Ernie Mata", "ReviewID": "RC3FHG43VA492", "Overall": "1.0", "Content": "Try using this on a pi camera to be able to here and you couldn't hear anything. don't buy it's not worth it.", "Date": "August 18, 2013"}, {"Title": "Not sure how to use this", "Author": "Priscilla Mason", "ReviewID": "R1PP5DJLKM4YAX", "Overall": "2.0", "Content": "Lost... How do you run with camera that already has mic?  And how do you plug it in?  Please help", "Date": "May 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0053V5Z9W"}}