{"Reviews": [{"Title": "Indoor- NOT Outdoor Camera", "Author": "Derf", "ReviewID": "R3O7XT7D66CX5D", "Overall": "1.0", "Content": "Indoor camera. has air vents. I REPORTED THE ERROR, BUT, IT WAS NOT CHANGED.Indoor camera. has air vents.  I REPORTED THE ERROR, BUT, IT WAS NOT CHANGED", "Date": "December 6, 2013"}, {"Title": "Decent video quality", "Author": "MacFan", "ReviewID": "R1XN0IQE6KCB08", "Overall": "5.0", "Content": "The camera arrived as described. Day and night time viewing quality are both pretty good, especially considering the camera's price. I've ordered two more.", "Date": "October 2, 2012"}, {"Title": "You get what you pay for!", "Author": "Robert", "ReviewID": "R1KRT7LOBT04C1", "Overall": "1.0", "Content": "Got this unit to cover a blind spot and didn't want to spend a ton of cash. Well, the camera arrived and was in good working order. I quickly learned that it's was no where near the quality of my other cameras, but thought that I would use it a few days to give it a chance. Well, I took it down as soon as a better replacement camera arrived and it's been sitting on the shelf in my garage ever since.", "Date": "December 17, 2013"}, {"Title": "Arrived DOA.", "Author": "David L. \"D\"", "ReviewID": "R3OXABBVASCWH2", "Overall": "1.0", "Content": "Didn't work at all. The whole thing is plastic and never got to see the quality. I would not be surprised if it's a CMOS and not an actual CCD too. Returned it and got a refund and will look for something a little better quality.", "Date": "October 14, 2013"}, {"Title": "Picture Perfect!", "Author": "L. Redman \"L.B. Redman\"", "ReviewID": "RKT2JPNA6LED5", "Overall": "5.0", "Content": "Just installed the AGPtek, and I am VERY pleased. I had a security co. install a system last year and I purchased the AG to replace one of theirs that somehow got moisture on the inside lens and actually to my surprise the AG picture is better, and at a fraction of the price of having them come back out or just purchase a similar camera. Granted theirs had a metal housing and slightly larger, but the bottom line is what the camera produces for the eyes to see, and at this point I'm seeing \"green\", in addition to a super picture. Now, It may self destruct tomorrow, but at this point, I am one happy 3.6mm camper.", "Date": "September 15, 2013"}, {"Title": "Stopped working (no picture) after 3 months", "Author": "Seera", "ReviewID": "R3NSO7INCU02EH", "Overall": "2.0", "Content": "Camera has been in use for approx 3 months.  Has stopped working.  The encoder in the camera is still generating baseband video (my CCTV recorder \"detects\" it\"), but the video is completely black.  Can but assume that the imaging element has died.  Disappointing.Mitigating factor:  Until the camera died, it worked acceptably well...both day and night video were definitely usable (and definitely better than the \"included in the CCTV recorder bundle\" CCD cameras).  If it hadn't died, I would've continued to be satisfied with the product.", "Date": "August 24, 2013"}, {"Title": "Great Deal!", "Author": "GJC", "ReviewID": "R3LUCAYS3ULPOE", "Overall": "4.0", "Content": "I wasn't expecting much for $25.00, But I'm surprised!.  It is well made and has a good picture day or night.  The only thing I did notice, It states that it's an outdoor camera, but you can tell that it's not waterproof..", "Date": "July 30, 2013"}, {"Title": "its worth its price", "Author": "josh turner", "ReviewID": "RBOTT4TKNSGHS", "Overall": "5.0", "Content": "it is pretty amazing for how cheap it is, and the night LED's on it work pretty great it is certainly worth its price", "Date": "July 1, 2013"}, {"Title": "Home security", "Author": "GILFOYLE MASON", "ReviewID": "R5I3UK2G24RX4", "Overall": "5.0", "Content": "This camera you can see clearly at night, it is good to have security around your home when you are asleep.", "Date": "December 20, 2013"}, {"Title": "Great camera", "Author": "Al Azim", "ReviewID": "R1CCGNQ6PWNUE9", "Overall": "5.0", "Content": "I recommend this camera to all, it shows larger view than the regular standard camera, this is my second and I am going to order one mre.", "Date": "October 11, 2013"}, {"Title": "keeps a watchful eye", "Author": "Shari F. Lewis", "ReviewID": "R144AHC4PEUBER", "Overall": "4.0", "Content": "You cannot beat the price and clarity of this product. It is wide to get a beautiful view just like the product says.. This is worth its weight and more.. Will definitely purchase more of these for security. :)", "Date": "April 22, 2013"}, {"Title": "Fair", "Author": "Matthew Boggs", "ReviewID": "R1SE9RB0K2R9QA", "Overall": "3.0", "Content": "Not a bad camera for the price.  It does appear to be made fairly cheap though.  (but look at the price)", "Date": "March 23, 2013"}, {"Title": "camera is ok for the price", "Author": "parakkandi bavukka", "ReviewID": "RL89IQJUVY58P", "Overall": "4.0", "Content": "Its working fine with bright image ,has too much colo and also made with good and strong outer body .", "Date": "December 4, 2012"}, {"Title": "Day/ night color camera", "Author": "Marie A. Meyer", "ReviewID": "R1FJYKERWLE66M", "Overall": "3.0", "Content": "I just wish it came with longer cables, or at least tell you what you would need to make it work. What you see is what you get. And since I can't hook it up right now I'm a little worried how much that will cost, and then does I work.", "Date": "April 18, 2013"}], "ProductInfo": {"Price": "$39.00", "Features": "Sensor CCD: 1/4\" SHARP CCD\n420 TV Lines, Horizontal\nSignal: NTSC\nPower: DC 12V\nView Angle: 90¡ã", "Name": "AGPtek Day Night Vision Outdoor CCD CCTV Security Dome Camera 3.6mm Wide View Angel Lens 420TVL", "ImgURL": "http://ecx.images-amazon.com/images/I/41HqTW62lAL._SY300_.jpg", "ProductID": "B005K7KU30"}}