{"Reviews": [{"Title": "Canon powershot SX150 PACKAGE", "Author": "ONELEGTOSTANDON", "ReviewID": "R10Z1QSLCB7XIQ", "Overall": "4.0", "Content": "I bought this package deal through Amazon recently. I wanted a Canon camera because of the great service and reputation of Canon. I haven't used the camera much as yet. I was primarily updating the technology, Previously I had a Powershot A85 which served me well (and was brought back to like new condition by a warranty repair) since 2004. The Camera: I love the new camera so far, the large LCD screen is a blessing for my old eyes. The anti shake capability helps my primary biggest weakness when handling a camera. I also find the physical size of this camera works for me better than the super tiny cameras presently on the market. The logical design of the buttons and knobs makes the camera easy to use.The SX150 has significantly better low light functionality and the pictures reflect this. My only complaint is the SX150 like my A85 is hard on battery life, but unlike my A85 the SX150 has only two AA batteries to draw upon instead of four. Additionally the battery/charger combo was defective initially from the supplier ZeeMO.The package accessories: As I said above,I bought the package to replace older technology.I immediately had to clean the outside lens as it had a smudge on it,(messing up the focusing optics). The batteries (Zeikos) even though they say they are 3100 mAh are weak compared to other Ni-MA batteries I have purchased which have lower current ratings from national manufactures such as Energiser. The charger is a international adaptable charger, which may come in handy when we goto Italy. The camera bag and memory card are sufficient.Although it took two attempts to get ZeeMO's attention on the defective battery/charger combo, I think the package deal was worth the effort to purchase for me, with a camera I highly recommend!", "Date": "April 13, 2012"}, {"Title": "Just what I wanted", "Author": "TAG", "ReviewID": "RGD8M3BR0TIJM", "Overall": "5.0", "Content": "I bought this for my son.  His family vacationed in Arizona and took the MOST amazing pictures of the Grand Canyon.  The quality of the zoom was AMAZING.  Great value.  I would highly recommend it.", "Date": "July 11, 2012"}, {"Title": "great buy", "Author": "great buy", "ReviewID": "RGOJ6YXE4ASYW", "Overall": "4.0", "Content": "Bought this camera as a small camera alternative to my canon dslr and I have been very impressed thus far. It is easy to use and contains some very intriguing features. All together a very nice compact camera.", "Date": "January 9, 2012"}, {"Title": "Great camera", "Author": "Susan", "ReviewID": "R2ZSACVA53K4AE", "Overall": "5.0", "Content": "Absolutely wonderful pictures, great clarity. Camera is easy to use and understand. The kit comes with everything one would need. Love this camera.", "Date": "November 29, 2012"}, {"Title": "Excellent Camera!", "Author": "Rudolph H. Schubert \"Ranger Rudy\"", "ReviewID": "R1W6JEND3R1W32", "Overall": "5.0", "Content": "Buy It!!!!!! It is excellent for blow-ups for the computer. Pixel count works! I have been using SLRs for 35 years, this is almost as good!", "Date": "July 29, 2012"}, {"Title": "Canon PowerShot SX150 IS 14.1 MP Digital Camera from ZeeMo Digital", "Author": "Ajay", "ReviewID": "R2IBXFA2QMXRKU", "Overall": "1.0", "Content": "I bought 'Canon PowerShot SX150 IS 14.1 MP Digital' Camera from ZeeMo Digital on Amazon. This camera is simply suck and no one is helping me on this. I wrote many mail to ZeeMo Digital but no help. I simply waste my hard earned money in this sucking camera. Picture quality is very poor. You can get better quality in any 2 MP camera.Major issues:-Worst picture quality.Faded color.Power consumption is very very very high. You need to change the battery every 30 mins.Flash does not work properly. You need to wait almost one minute to get it flush.Never buy any product from ZeeMo Digital.", "Date": "November 19, 2012"}, {"Title": "Amazing camera", "Author": "Samantha", "ReviewID": "R2O6NDKF0JVRB6", "Overall": "5.0", "Content": "If you're like me and never used anything more than a disposable camera then this is the camera for you! It did take a little getting used to, but if you read the manual that comes with it then it will be no time at all before you start taking amazing photos! It is comfortable in my hands & the picture quality is absolutely fantastic! I would recommend this camera to anyone and everyone.", "Date": "September 8, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Canon PowerShot SX150 IS 14.1 MP Digital Camera (Black) + 4 AA Batteries & Rapid Charger + 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61tGl700E2L._SY300_.jpg", "ProductID": "B005KAHN9G"}}