{"Reviews": [{"Title": "GREAT BALANCE BETWEEN PRICE AND PERFORMANCE", "Author": "steadysqueeze", "ReviewID": "R2V4ZG8WDWRTFO", "Overall": "5.0", "Content": "The T3 is in the bottom of the entry level line up, but it performs very well. In terms of picture quality when compared with higher end models all the way to the 60D, it is difficult to determine any differences between them.The biggest sacrifices are ergonomics and features like frames per second and flip screens, but I have to tell you that it is a great starting point for any enthusiast wanting to discover DSLR photography. ISO 6400 is really helpful when compared with models like the XS which Canon stop showing in their website; the XS was Canon's entry level before the T3 but it only had ISO 1600 (useless). ISO 6400 with Photoshop Lightroom 3 makes unwanted grain a thing of the past.The camera is small and convenient; I recommend buying the body only and getting and upgraded lens instead of using the 18-55 kit les that comes with it. Good quality pictures come from high quality lenses, so save the money from the kit lens, and buy an upgraded lens like the Canon 24-70L for people with money or the Tamron 17-50 2.8 for people on a budget that want a good balance between price and quality.The bottom line is the lens is more important than the camera if comparing all Canon models under $1000.00. Good luck with your choice.", "Date": "November 24, 2011"}, {"Title": "Good camera", "Author": "Yal", "ReviewID": "R16LVZWMFCGYNI", "Overall": "5.0", "Content": "Listen if you are coming from a point and shoot don't even read the negative reviews, just get this camera and enjoy. The negative or neutral reviews are mainly from whinny wanna be \"experts\", Canon haters, and some real pros who have more demands and are sometimes difficult to please. I mean seriously who scrutinizes the very edge of a photograph for flaws in 10% or less of the shots? All I want to know is, did I capture the moment I was looking for in that middle area in better detail and clarity than my trusty canon point and shot? Yes? Then good, done, i'm happy.The only thing I suggest is don't treat this like a small point and shoot, its more delicate, keep it safe, get a bag for it, don't drop it in the diaper bag, etc etc. In short just bring it out for special occasions and keep it in a safe place when you are done shooting. Use the neck strap!! Buy a cheap point and shoot for the crazy moments. For example use the cheap P&S; for the party and break out the dslr for the cake cutting and the pre-party dressup shots before the cloths go to hell, you parents know what i'm talking about! This thing takes great shots, get it.", "Date": "November 7, 2011"}, {"Title": "I Couldn't be Happier!", "Author": "Theresa Bechard", "ReviewID": "R153XVW03Q5MDA", "Overall": "5.0", "Content": "I am a reasonably experienced, amateur, 35mm SLR photographer who wanted my photography to join the 21st century and the digital age. This camera has fit the bill perfectly.  I have had it for about a month and can't think of anything else I could have wanted in an \"entry level\" camera. My 35mm SLRs (Canon and Pentax) could not record photo settings and I was lazy about recording this information so I could never tell what I did to produce a particular image. Not so with this camera.  The settings are effortlessly recorded for every photo.  Can't remember what you did?  The camera does it for you. As a result, the Canon Rebel T3 will make you a better photographer.Image quality is excellent.  Anyone who complains otherwise is expecting $1500 performance from a $500 camera.  That is unreasonable.  I have found the Canon Rebel T3's resolution to be impressive. Some photos that I thought were good showed details that, in my hyper-critical opinion, ruined the shots.  These were certainly not problems with the camera. They were all problems with the photographer.I couldn't be happier with this camera.  The software that came with it was an unexpected bonus.  The Canon Rebel T3 is billed as an entry level DSLR camera but that doesn't mean it isn't a serious camera.  I recommend the Canon Rebel T3 to anyone considering serious digital photography.  People moving up from a \"point and shoot\" digital camera will be able to use the camera on \"full auto\" mode in no time and those interested in learing more advanced digital photography will find plenty to interest them.  No one purchasing an entry level DSLR will be disappointed by the Canon Rebel T3.  I bought the \"body only\" because I already had a bunch of Canon lenses  but there is nothing wrong with the \"kit\" lens if you buy the Rebel T3 \"kit.\"", "Date": "December 16, 2011"}, {"Title": "A great beginner dSLR", "Author": "CGScammell", "ReviewID": "R1QJHFQYIGIV8N", "Overall": "5.0", "Content": "If you already own a Canon dSLR, get the body only.  Canon  kit lenses on the budget dSLRs are simply not that good.  Why pay extra for mediocre glass?I am a passionate hobbyist and a Canon user since 2006.  I bought this T3 body only to replace an ailing Canon xS with auto-focusing problems. Both are selling at the same price, but the T3 offers a few upgrades:  12MP vs 10 MP, faster burst mode, video mode and more focusing points on the sensor.  I already have a plethora of good Canon and Tamron lenses and didn't want a cheap kit lens the Rebels are notorious for, so I bought the camera body only.I take this dSLR into town, on long hikes, camping trips and backpacking adventures, so the lighter weight of a lower-end Rebel made from polycarbonates is ideal for me.  My cameras take a beating. I leave my 7D home for more indoor portraiture shots.The Canon T3 looks smart. It feels more solid than the xS and the handgrip has a slight rubberized coating for better grip that the xS does not have.  The buttons are almost all in the same place except for the SD slot; on the T3 it is with the battery slot on the bottom which may be an issue with battery packs.  The bodies look very similiar, so there was no great time wasted reading the manual.  For those new to the Rebel line-up, however, I greatly encourage to read the manual to better understand this camera, as it has many great features for an affordable price.  Most people who are dissatisfied with a camera or lens usually just don't take the time to learn the many capabilities of that piece of equipment.  There are differences between a Nikon and a Canon dSLR as there are different terms and physical layouts for everything.  It's like studying French and German simultaneously.I shoot mostly in A-DEP and Manual mode, although P and Auto are also used when doing snapshots.  When using the first two modes, however, the photographer must be aware of proper settings in white balance and ISO modes as otherwise photos will appear washed-out or over/underexposed.  This is the fun and creative part about photography that I enjoy.The T3 ia better suited for sports photography than the xS as it has a rapid-action burst mode that lets you take ten shots in a row.  This is faster than the xS.As all lower-end dSLRs, this camera is made in Taiwan.I am happy with the photo quality of my photographs.  Colors are vibrant.  I now carry it in my camera bag as a side-kick to my Canon 7D.I will update this review as times goes on.", "Date": "September 15, 2011"}, {"Title": "Film to Digital", "Author": "D. Barkley", "ReviewID": "R2UVBAJY0OC3U5", "Overall": "5.0", "Content": "Bought this Canon EOS digital camera body to replace Canon EOS film camera.  Already had 2 lenses, carry bag and tripod, this T3 can use them all. It is everything I want and care for in a nice digital camera. The Ti's are great for those deep into photography, but for the average person just wanting a clear sharp pictures with some of the bells and whistles, this Canon T3 will do the trick.  Delivery was prompt, exactly as promised.", "Date": "July 21, 2012"}, {"Title": "Canon EOS Rebel T3", "Author": "neil s.", "ReviewID": "RUIJRC08TO34I", "Overall": "4.0", "Content": "I've had this camera for exactly 2 months now. This is my first DSLR, and while I am no prosumer I know when I'm happy with something. The picture quality between this camera and point and shoot type cameras is obvious from the onset. The larger sensor results in a level of detail that is just not possible with point and shoot cameras. I've used it in conjunction with my 24- 85mm f3.5/4.5 USM lens, and I'm very happy with the results, especially portrait type shots. The in-camera help guide lets me change settings with confidence, to the point where I now shoot exclusively in Av, Tv or manual. A camera like this should never be used in full auto. I know there are many critics out there who are caught up with minute technical details, and these are probably individuals who do photography for a living or have a lot more money to spend. At this price, this camera gives you a wide range of control over most variables with ease. I can control depth of field, speed, white balance, exposure, iso rating, etc. I also have the option to shoot in RAW and then edit afterwards, which is a huge advantage over point and shoots.I've become accustomed to the layout to the point where I no longer need to look when I have to rotate the wheel or engage other controls, as the camera is very ergonomically designed. The camera almost encourages experimentation, and I deliberately shoot the same subject using different settings just to see how creative I can be. The only reason I gave it 4 instead of 5 stars is due to the fact that I have not used other brands or higher end models to which I can compare my T3.The canon manual is almost useless though, get David Busch's guide to the T3, it's an excellent manual to go along with an excellent camera.", "Date": "May 9, 2012"}, {"Title": "Shady seller", "Author": "Robin G. Allen \"Littlebirdy\"", "ReviewID": "R2XMT63WU5PYZY", "Overall": "1.0", "Content": "The camera that I received was defective from the beginning. At first, i thought that i just didn't know how to use it, but it completely stopped working after less than a month. Contacted the seller, and they told me to call Canon. Btw, Canon cust. svc. is excellent! Turns out, Canon doesn't make this camera to be sold body only. The seller is taking the kits, splitting them up and selling them separately. Fortunately, I received a warranty card, but others may not. Pretty shady seller, if you ask me. Other than all that, it's a great camera.", "Date": "July 18, 2012"}, {"Title": "One of the best entry level DSLR for the price", "Author": "Harish Ramachandran", "ReviewID": "R2MIU8EPRLSXQ6", "Overall": "5.0", "Content": "I was extremely pleased with the photo quality. It was very easy to use. I specifically went for this because of the price. I was comparing this with T3i, although are differences like resolutions, HD video quality this one suited my needs and also this year they are selling at a very good price.Best bet if you need entry level DSLR and fine with 780P videos. I did lot of research and finally ended up with this when compared to Nikon / Sony etc.", "Date": "November 21, 2011"}, {"Title": "excellent camera so far", "Author": "M. Townsley", "ReviewID": "RU9KZ3MH2QXY8", "Overall": "5.0", "Content": "Purchased this camera body to save some money as I was told the kit lens was not worth using in the long haul.  Several friends said, \"Buy a body that works and save your money for a quality lens,\" so that's what we did.  So far, the battery life has been good and the user interface has been easy to learn.", "Date": "October 7, 2011"}, {"Title": "Wonderful camera; fast delivery", "Author": "CWhiteside", "ReviewID": "R1DL6LFJ1TDHHX", "Overall": "5.0", "Content": "This is a great buy! First off, it arrived 3 days after I ordered it and that was with standard shipping-- extremely fast. So thank you for that! As for the camera itself, it is wonderful. I upgraded from a Canon Rebel XT, so this is a beauty compared to that. There were many things about this camera that were not mentioned in the product description, so to name a few perks: it has a smooth shutter sound, it tells you on the screen what every mode is used for as you flip through them, the ISO goes all the way up to 6400, it has video option, it has a live viewing option, it is very light, and altogether is very user friendly! I rate this camera a 5 because it works beautifully and I got it for $200 less than it currently sells for in store.The only problem I found with this purchase was that the included accessories were not clearly stated anywhere. The camera also comes with a strap, battery, battery charger, computer cord, manual and CD's (no product box). I was pleased with these accessories of course, but since it did not state that it came with a battery charger, I bought one separately, so now I have two. Small problem, but it would help if the seller put that in the product description.I would recommend this camera to anybody. The seller just needs to brag a little more about it and then it would probably sell even more!", "Date": "November 11, 2012"}, {"Title": "Great Price and Features--Fits My Needs, At A Savings", "Author": "umeweall \"Packrat\"", "ReviewID": "R11XVB1VNR86R7", "Overall": "5.0", "Content": "I was looking at purchasing the T2i, as it could do 18 megapixels.  Why?  Would I really need to be concerned about the megapixels at the highest level.  I am currently shooting with a Canon 300D, which goes way back in time, but still takes good pictures.  I has a whole 6 megapixels.  The Canon T3 gives me TWICE that of what I have currently.  The T2i would have given me THREE TIMES the megapixels.  I decided that it was not necessary for my standard picture shooting, and was over-kill for my needs.  As for the 1080p video, versus the 720p on the T3, that also is fine, as I really do not intend on using the camera for shooting video.  I have a camcorder, which shoots in HD, @1080p, that fits in my pocket--very portable.  As for the screen, on the T2i, which some professionals were all hyped up about, I don't care that the resolution is higher on the screen.  I review pictures on my computer, not on the camera.  I have also found that I want to see a full sized picture, on my monitor, not a shrunken midget, on a tiny screen.  I will occassionally do a quick review of a picture, just to make sure that I got what I wanted in the frame, but that is it.  The end result being that the screen on the T3 is just fine for me.  Now for the rest of the features, I compared the T3, T3i, and T2i, on the Canon site, and there is otherwise only a fraction of a difference between them.  The difference was not enough for me to fell that I would be missing something, by buying the T3.  For the extra money that the T2i costs, I bought a 50mm, f/2.5 lens for my new camera (well, I had to chip in a few more bucks!  I also had to battle other would-be buyers on Ebay to get it!).  I stuck with the Canon line, as having had my 300D for years, it has served me well (and yes, I plan on keeping it, as a back-up).  The lens will work on the T3, as they would have also worked on the T2i, or the T3i.  Basically the T3 gave me the majority of the features incorporated into the T2i, and T3i, that I actually needed.  I was not interested in spending the extra money for the 'fluff'.", "Date": "April 6, 2012"}, {"Title": "Great entry level DSLR value for learning your way around manual photography.", "Author": "akmac", "ReviewID": "R28M2X1N9NIBKF", "Overall": "4.0", "Content": "I have found these features to be most useful:Partial metering, spot selected focus, exposure compensation, bracketing, ettl 2 flash control, full manual control of shutter speed, ISO and aperture, the ability to shoot in raw format.  It still has fully automatic settings for those that just want to point and shoot.There is also a  live view function which works great for setting manual focus while using a tripod.  You can zoom all the way in and move anywhere in the frame to focus exactly where you want to.The body is very light, made from what feels like a very durable smooth plastic.  However this plastic is very slick- use the strap so you don't drop it!The LCD is very large, with good image quality.I found the menu system fairly intuitive to use.Now what it is lacking:There is no mirror lock up. This is not a problem if you have a good tripod, but is worth mentioning if this is a deal breaker for you.It also does not have spot metering, but instead uses partial metering.  I have very little experience with spot, but have had no problems getting the exposure I want with partial.This camera does not shoot video in 1080, it is limited to 720.  I personally could do without video all together, I bought it to take pictures.There is no built in remote sensor.  You will need a cable release or to buy a third party wireless solution.The cache is somewhat limited.  This is only an issue if you want to shoot continuous action in raw format.  It will bog down after 4 pictures.  If you shoot in jpeg you can shoot continuous all day long without delay so long as you have the proper sd card.Lastly there is no auto sensor clean, just a manual function that flips the mirror up so you can blow the dust away, or clean it physically.These really have not been issues for me and for $279.00, I am not complaining, just pointing it out to help you make an informed decision.If you are looking for a new hobby, want to learn your way around a dslr, or expand your subject capabilities without breaking the bank, this is the camera for you.  With a little bit of learning , experience and the proper lenses you can still get professional looking results with this body.  If you are a landscape purist, action/sports photographer, professional photographer, want to make fully detailed poster sized prints, or are looking to make 1080 videos then there are better options out there, but you will pay a lot more for them.", "Date": "February 28, 2014"}, {"Title": "Older Canon EOS film lens not compatible", "Author": "Sue DeMarco", "ReviewID": "REWM9D21DNR74", "Overall": "4.0", "Content": "I bought this to replace my EOS Rebel film camera. None  of my lens are compatible with the digital version.", "Date": "November 30, 2013"}, {"Title": "It does everything but take the picture...", "Author": "Adam", "ReviewID": "R2YDQ2FN9DEI3L", "Overall": "5.0", "Content": "I've had Canon cameras all of my life, starting with the AE-1, then the Rebel G, both film camera's obviously and now the Canon T3 DSLR. What can I say; I've never been disappointed with them. They've always been top in quality, performance and price for me.This is my first DSLR and boy it does everything. I was happy to hear that I could use all of my Rebel G len's with this, it saved me a fortune. True they don't have Image Stabilization but I've never had it before and it works just as well without it for me.I only have it a couple of weeks and I'm sure I'm only using half the stuff it comes with. It does all of the things my two previous Cannon's did and more, including video. As I say in my title \"It does everything but take the picture\".It's made well, it's light, more compact then the other two and yes it's mostly plastic, but I don't necessary see that as a negative. For casual use, vacations, family photos, general all around shooting, I don't see that as a problem, plus it's a lot lighter to carry. For a professional photographer who will use it everyday where it will get a little rougher handling I'm sure one of the upscale pricier models will be more compatible with that type of use but for my purposes it does the job.I would definitely recommend this camera for a casual shooter like myself...a lot of bang for the buck and it got a Best Buy rating in Consumer Report...", "Date": "July 14, 2012"}, {"Title": "Pleasantly surprised!", "Author": "Allen P. Frederick", "ReviewID": "R3N7MG6W558L7", "Overall": "4.0", "Content": "Having really bought into the Micro-4/3 rage, I did not purchase this camera body to replace my Lumix -- just wanted to use a few lenses from my old EOS Elan film camera, and had had little success adapting them to the Lumix because of no auto-focus capability.Well, I must admit to being pleasantly surprised.  This camera takes SHARP photos with an old Tamron 100-300, and beautiful macros with an even older full-manual Tamron lens that I used to use with a full manual Fujica.  (I jammed the f-stop pin in!)  AND all that with no image stabilization!Not everything is clouds and teddy bears, though.  I also have a \"multi-element\" Tamron zoom from the Elan days, 28-200.  Looks like fungus infestation -- lots of \"fog\".  Can still get good pictures by focusing manually, but wish I could get this thing to work so I don't have to change lenses.  What's worse, put a CP on it and NOTHING comes out, whether auto or manual focus.  That's not the camera's fault though, so no problems there...Just a couple minor complaints about the camera:1)  Toggling between f-stop and shutter speed (or exposure and f-stop/shutter balance in program mode) is difficult because you have to find a pushbutton with your thumb while spinning the wheel.  C'mon!  I'm taking pictures, here!  (EOS Elan had a wheel on the back, so you could adjust both options simultaneously...)2)  When in program mode, the camera always seems to want to open the aperture.  See item no. 1 above!3)  Seems like the sensor and mirror are dust magnets.  One of my first outings was a water-fight.  I had to crop a \"blob\" out of the sky on a great many of the photos.  Scared me and I thought I had a bad sensor until I read up on it and figured out how to photograph the sensor to see the dust.  I got one of those Giotto rocket blowers and took care of it, but now I see it's also a problem with the mirror.  (Photos are still awesome, though...)I bought this camera because it was comparatively \"cheap\", but I discovered it's not built cheaply.  I had low expectations (based on the Elan I owned previously, by the way...  Gray market?), but I'm very happy I got a T3, and would recommend it to others.Cheers!", "Date": "June 27, 2012"}, {"Title": "great starter SLR", "Author": "lee", "ReviewID": "R1HS6DPV46BT1N", "Overall": "5.0", "Content": "The quality and options provide the perfect balance for the beginner with a price tag that doesn't shock too much. While the casual point-and-shoot photographer accustomed to a good deal of optical zoom on their camera will have to adjust to switching lenses to get the right shots, the quality is unsurpassed and just some simple tricks make standard snapshots snap a bit more.", "Date": "May 20, 2012"}, {"Title": "Inexpensive DSLR with great picture quality and better auto focus than Rebel XS/ 1000D that it replaced", "Author": "CShooter", "ReviewID": "R36VQWT4T5RES0", "Overall": "5.0", "Content": "I picked my Rebel T3 / 1100D around Christmas season in 2011. Ever since then I shot a couple hundred photos with it from wedding photography (unpaid, enthusiast photos) to miscellaneous pictures at home. This experience with the camera has led me to these pro & con conclusions about this DSLR.Pros: Very good focusing system  Very good low light iso performance  Light weight  Great picture quality  Cheap way to get into DSLR's  Can take 720p video - not full HD, but better than no video  Quick enough for most photography - way faster than a typical Point & Shoot cameras  Lower noise levels at same ISO settings than my Rebel T3i  Comes with a wall charger - better for travel than the corded chargers  Most can't tell this cheap unit from a professional DSLR (as long as you get the black model) - makes you look professional using itCons: No supersonic sensor cleaning - stupid thing to remove to cut cost in my opinion  No separate SD slot compartment - it's in battery compartment next to the battery  Occasionally locks up/ freezes in continuous shooting mode displaying \"BUSY\" on the lcd  Plastic feel - cheap feeling body  No AF Assist lamp, flashes strobes from the flash instead when flash is up - could be alarming in church or during a wedding  No textured rubber grip - could slip out easier out of ones hand, but the smooth grip is rubberized - helps some  Slower Continuous shutter speed - makes it not that good for sports, very fast action shootingOverall I'm very happy with this camera, and glad that I have purchased it. Even though I now have higher up DSLR's, this one still has it's own role & purpose in my arsenal of photo equipment.", "Date": "August 24, 2013"}, {"Title": "Missing parts", "Author": "William Long", "ReviewID": "R1MJ6B1I5AR85Z", "Overall": "1.0", "Content": "I received this product without the required battery charger that was supposed to accompany the camera.  After contacting the vendor, they did not resolve the issue.  As I cannot use regular batteries, I have to order the charger separately and pay additional.  This is very inconveniencing.", "Date": "February 11, 2013"}, {"Title": "awesome camera!", "Author": "Jo Hershberger", "ReviewID": "R15CBVYLQUGRJV", "Overall": "5.0", "Content": "I have found the digital canon eos rebel to be much more convenient then its film predecessor. The shots are clear and vibrant in color. And my lenses fit perfectly. I would encourage anyone who has film cameras to step up to this digital camera. And, thanks for making it affordable!", "Date": "April 10, 2012"}, {"Title": "Never received what I ordered", "Author": "Doc", "ReviewID": "R1HDIJ6HCBDTZZ", "Overall": "1.0", "Content": "After ordering this camera, to replace my film based Canon A1, for my granddaughters wedding I was very disappointed when I did not receive what I ordered . Rather I received a USED point and shoot camera in the box for this camera. The question of settlement is still under dispute and Amazon customer service is working with me to resolve this problem. No solution as of this date. As a result I was forced to by the camera from a local brick and mortar store for $100.00 more than 6th Avenue camera advertised so I could make the wedding on time.", "Date": "December 6, 2012"}, {"Title": "Great Beginner Camera", "Author": "jenspire", "ReviewID": "R1T2QDFVO8ZKWD", "Overall": "5.0", "Content": "Bought this for my mom who is retiring and looking for a hobby to take up. It's a great inexpensive camera for someone who is just starting out with photography. Has all the basics including video. Very easy to operate. Better to buy just the body and invest in some good prime lenses. I recommend the Sigma 50mm 1.4 as a first lens. I'm going to also invest in an eye-fi card, which is perfect for someone like my mom who is not that computer literate. Will set the eye-fi card up to beam photos and videos to her iPhone.", "Date": "March 10, 2014"}, {"Title": "Nice upgrade from XT", "Author": "Desert Darlene", "ReviewID": "R3120J5TXA53X5", "Overall": "5.0", "Content": "I bought this as a replacement for a Canon EOS Rebel XT that I bought years ago and got damaged recently.  This camera has all the features of the old camera, but comes with video and other features my old camera didn't have.  It has decent image quality and speed.  All my old EF lenses fit this camera as well.  I also like that it's quieter than my old camera.", "Date": "November 29, 2013"}, {"Title": "Love it.", "Author": "ectorok", "ReviewID": "RSH4DFMYCBHSD", "Overall": "5.0", "Content": "Great camera.  I am not a professional but this camera makes me look like one.  Great feel in the hand.", "Date": "November 19, 2013"}, {"Title": "Great camera for the price.", "Author": "Nancy B", "ReviewID": "R1GATA1JK5DVK0", "Overall": "5.0", "Content": "If you are a budding photographer, this is a great camera. I purchased without a lens and bought one separately. Takes excellent shots outdoor and in. Very fine details, crisp, life like. I would highly recommend.", "Date": "March 3, 2013"}, {"Title": "canon's customer service is impecable.", "Author": "september vhay", "ReviewID": "RTD4E3S497SJ6", "Overall": "5.0", "Content": "not only is this camera fabulous, as i have had three versions of the rebel over the last 12 years... but what is equally important with the ever changing technology is the customer service/tech support that comes with a canon.  i was so impressed by their help. because of their tech support i will ALWAYS buy canon!", "Date": "March 3, 2013"}, {"Title": "Good item, great price!", "Author": "P. Druzba", "ReviewID": "R2METGLVFD2BAT", "Overall": "5.0", "Content": "I had my eye on this camera for quite a while, but I was waiting for the right price to come along. I already had an EOS camera, lenses and accessories from my film camera days, and all I needed was the body. Thanks to Amazon for the heads up on the item. It works great, I can still use all of my lenses and flash. Now if I could only sell my old EOS 630 body.", "Date": "February 3, 2013"}, {"Title": "Upgrade ya, upgrade ya", "Author": "Davey Jones \"D.R. Jones\"", "ReviewID": "R1NJ2B77IX0XUS", "Overall": "5.0", "Content": "I upgraded from one of the earliest Canon digital SLRs. I love it. I could wish for an increase in the MP count, but otherwise the functionality has been hugely improved. The settings are easily adjustable and accessible. The display is bigger. Of course, future enhancements will likely target enlarging the LCD even more.", "Date": "January 19, 2013"}, {"Title": "Lovely camera", "Author": "Sarah", "ReviewID": "R2V8TXGDDLJ9EV", "Overall": "4.0", "Content": "I upgraded from a Canon Rebel XS to the Canon Rebel T3 primarily because I wanted a video feature. I'm really into photography, and this camera fits my needs for the most part. The picture could be clearer, but this is one of the lower-end cameras. Still takes fabulous pictures though for a great price. You can also use the display screen unlike the Rebel XS which can be really nice. Overall, a good camera for someone who doesn't want to spend a lot of money, but wants a decent camera.", "Date": "December 26, 2012"}, {"Title": "Converted it to infrared.", "Author": "Beeper", "ReviewID": "R3FVJ3RH0XBXSF", "Overall": "5.0", "Content": "I aready own the 7D with several lenses. But I have wanted an (infrared) dedicated camera for some time now. Most people in this persuit would use their old DSLR, however my old XSI was busted. The T3 is SO affordable that I simply purchased it brand new and sent it away to be converted to infrared. The images are phenomenal and rival those of the true pro models.Many friends will ask my advice on \"I want to take photos like yours, what's a good quality camera to start off with\"? I always reccomend the T3. Twelve megagpixels is plenty big enough. And the 6400 ISO enables much superior low-light sensitivity compared to other cameras in this price range.", "Date": "June 1, 2012"}, {"Title": "Canon Rebel T3 Camera Body", "Author": "Amazon Customer", "ReviewID": "R2W3TSBMW733F9", "Overall": "5.0", "Content": "I replaced my original Rebel body with the Rebel T3 and am very pleased with the extra features.  It arrived in a timely manner.  Was new as stated and in the original box which included everything but the 18-55mm lens which I already have.  Have been having a great time getting to know the features of the camera.", "Date": "August 23, 2012"}, {"Title": "As a pro photographer, this is very nice, and so is the price", "Author": "Audio Junky", "ReviewID": "R2TJ3PDPOEPS1O", "Overall": "5.0", "Content": "Yes, you can get a camera with more pixels,(you don't need over 10, this has 12) and more than 4 shot bursts(never needed more in 5 years on the job), and blah blah blah. However, if you buy this camera and some really nice glass to go with it, you can out do any other camera out there. I have never needed to crop an image more than this camera allows before breaking down. This is the second t3 we have bought, and we use them for weddings, photo shoots, and all our sessions. If we use these as our tools for work, that speaks volumes for what this camera and the right lens can do. Just like the car a racer drives, it matters what we use. We rely on this camera's abilities combined with our own to provide top notch quality images to our clients, who are repeats in many cases. A 50 pancake lens looks so good in studio it's amazing. Everything from an 18-55 to a 300 looks amazing. There are also the video options, which look fantastic with a telephoto lens in HD. There is no flip out breakable display, the batteries are affordable, the flash is bright, but you will NOT use it, due to the low light abilities of this bad boy, and all ef and ef-s lenses work as well. I have put this very low level canon on my tripod and set it to take a time lapse of the stars in the dead of night, and that really cool swirl appears. Keep in mind, this is not a 1000.00 camera, but it acts like one. Like when a little dog snaps at a german shepard, this camera thinks and acts like a big dog. If you have any doubts, count your cash after you buy it, then try to take a picture of something your favorite pro has taken and compare. With the correct lens you will be amazed. The colors, light, speed, weight, accessories, cost, and ease of use make this a must have. Throw that cell phone in the car with the little tiny digital camera and use a pro grade camera for a starter camera price. Way to go Canon and THANKS for all the memories we have captured for us and our faithful clients!!!!", "Date": "May 31, 2014"}, {"Title": "A great little camera!", "Author": "Anne H.", "ReviewID": "R2VX1IPHI7E9FU", "Overall": "5.0", "Content": "This is my favorite camera. It's great for hobbyists who want a bit more options on their camera without having to sell their house to get a super fancy camera. I currently use a 50mm lens with this camera and take all sorts of great pictures with that combo.", "Date": "May 23, 2014"}, {"Title": "third one !", "Author": "Paul W.", "ReviewID": "RO56YRJXERHHZ", "Overall": "5.0", "Content": "This is the third T3 I have bought in the last 18 months and these are the best cameras for beginers I've ever seen. All have been gifts for people I love and all of them have been thrilled with how easy it is to use. You get great pictures reguardless of how much you know about them and they are so EASY TO USE right out of the box. Great gifts that just keep giving !", "Date": "May 22, 2014"}, {"Title": "Cannon Camera", "Author": "Cari Towery", "ReviewID": "R35U1YU6HE0YGD", "Overall": "5.0", "Content": "This is the best camera I have ever owned. I love it!!! I can not put it down I use it so often. very fast shipping", "Date": "May 22, 2014"}, {"Title": "great shots, great options", "Author": "Kurt Butkiewicz", "ReviewID": "RXUNTVQ6BE2IT", "Overall": "5.0", "Content": "worth much more than it coststakes awesome picturesworth playing with the settings to see just what can be done", "Date": "May 21, 2014"}, {"Title": "the best", "Author": "j rhea", "ReviewID": "R2E9FLRHTDXFPK", "Overall": "5.0", "Content": "this is the best around, fast shipping, nice packing. the body its self is so easy to use and canon really makes the best digital. cant wait to up grade (when I get rich, till then I will fake it with amazing camera)", "Date": "May 16, 2014"}, {"Title": "Great camera - great price", "Author": "bruce e shollmier", "ReviewID": "R2E4YC8TZ537QJ", "Overall": "5.0", "Content": "I love the simplicity of the t3. It takes great photos while using the fully auto mode. It performs like a point and shoot, but allows you to go manual if you choose. It has lower megapixel values than my t5, but for everyday use it is great.", "Date": "April 27, 2014"}, {"Title": "The camera was delievered i good condition", "Author": "Novice photo enhancer", "ReviewID": "R3RXQ1VEPBMX37", "Overall": "5.0", "Content": "The camera is fascinating; there are more ways to take a picture than can be ever mastered. But then it does give you the option of choosing the usual categories. I thought technology was to make our lives easier.", "Date": "April 25, 2014"}, {"Title": "Great camera!", "Author": "Mrs. S", "ReviewID": "RDS55INVRALGQ", "Overall": "5.0", "Content": "I have now owned this camera for over a year and a half and I LOVE it!  People ask me all the time what I shoot my pictures with and when I tell them that it's an entry level DSLR on AUTO, with the kit lens, they simply can't believe it!  I love photography and I'm planning on taking classes to learn how to shoot in manual, but I can tell you that the pictures turn out so well on auto that I didn't have to rush to take those classes.  I was so worried that I wouldn't be able to use my camera until I learned how to use all the manual features, but that wasn't the case.  You just turn it on and start shooting!Something I wish I had done sooner was purchase a better lens.  The 50mm 1.8 lens has been awesome for portraits.  These pictures are gorgeous, people seriously think I'm a pro photographer and I kind of laugh on the inside because I really don't know much, except I try to take pictures that I like.  That's honestly what it's all about.  Capturing moments in pictures that you like because that's really all that matters. This camera is such a good deal and if you are stepping up from a Point and Shoot, you will not be a bit disappointed in this camera.", "Date": "April 18, 2014"}, {"Title": "Longer video feature, great price.", "Author": "Boyd \"Name- Dustybones\nHome- Middle of New Je...", "ReviewID": "R309XD955DC3BZ", "Overall": "5.0", "Content": "Great deal. I choose this model because the video capacity is double the next upgrade and half the cost. Do it", "Date": "April 5, 2014"}, {"Title": "Exactly what you expect", "Author": "Donald Hyzer", "ReviewID": "R14UJKZ2HNI5BP", "Overall": "4.0", "Content": "I've used the film version of this camera for years.  This camera is its exact digital counterpart.  Reliable, great for beginners, and with a good lense professionals as well.  It is the simpler model, but I'm just fine with that.  Does more than enough with the features that it does offer.", "Date": "April 4, 2014"}, {"Title": "great if humble DSLR", "Author": "C. Scanlon \"least helpful reviewer\"", "ReviewID": "R1CXNC8QXRVUL5", "Overall": "5.0", "Content": "great entry level DSLR and a great camera for back up when you do move up to a 7D, for instance. You will always keep this workhorse in your kit. Excellent stand by to keep with you, great for street weork and candid quick shots. GEt a great set of  lenses to go with it and you cannot go wrong. Cheap, good, and gets her done", "Date": "March 31, 2014"}, {"Title": "It's a better way to buy this camera if you have lenses already from the old one", "Author": "Ciao", "ReviewID": "R139KA3NSBCD77", "Overall": "5.0", "Content": "Camera came brand new in Canon box with all the guarantee papers, book manual, etc.It's the same thing as buying camera with lenses but with lens removed from the box. Why should you pay for the lense that you already have.", "Date": "March 27, 2014"}, {"Title": "Perfect for a beginner", "Author": "Aevynne", "ReviewID": "R2T0L18ZY2WGGI", "Overall": "5.0", "Content": "I'm new to DSLR cameras (coming from a point and click), and I'm in love with this camera! It's nothing too fancy, and I like that I was able to purchase the body without having to settle with the lens it came with. It's a little daunting at first, but once you figure out the settings and what everything means, it's absolutely wonderful. Couldn't be happier!", "Date": "March 20, 2014"}, {"Title": "Great Buy", "Author": "Karthik", "ReviewID": "R183XIDOIQRU0D", "Overall": "5.0", "Content": "Very good product for a very good price !! Prompt delivery .. Will defenitely recommend it.. This came in a original box with all papers and fresh pack..", "Date": "March 4, 2014"}, {"Title": "Awesome", "Author": "John Clark", "ReviewID": "R37CPKWAT4ZOHS", "Overall": "5.0", "Content": "I bought this camera for my girlfriend for Valentines Day.  She absolutely loved it.  It has great picture quality, lightweight, simple enough to use for a beginner.", "Date": "March 3, 2014"}, {"Title": "Just what I wanted in a camera", "Author": "Love to shop", "ReviewID": "R10JFJH30B8ISZ", "Overall": "5.0", "Content": "Very happy with this camera.  It was strange getting used to the way it focuses but I've learned to adjust.  Lots to learn about this camera but so far it is doing everything I need it to- especially for the price.", "Date": "March 2, 2014"}, {"Title": "Awesome camera", "Author": "Charles B.", "ReviewID": "REZCXPIP5MLK4", "Overall": "5.0", "Content": "I upgraded from a t1 that I wore out so here's to this one may it last another 7 years of great pictures and the seller was amazing I had the camera in less than a week I will be giving them my business from now on !!!", "Date": "February 23, 2014"}, {"Title": "Good basic camera", "Author": "Cz-5", "ReviewID": "R2W592YCGX441R", "Overall": "4.0", "Content": "Bought this for the kids to learn about photography. Takes really good pictures. Easy to use and advance skills. If you can afford more, buy more. If this is a learning camera, then go for it.", "Date": "February 15, 2014"}, {"Title": "Pretty happy with it", "Author": "RROly", "ReviewID": "R8BF5O4PK6XN1", "Overall": "4.0", "Content": "The camera arrived a day early, and seems to work fine. The plastic bags holding the battery and charger had both been opened, which seemed odd, and the strap had been removed from its bag as well. The lens, as noted in the description, was removed. The upshot: A good deal, especially if you need just the camera body.", "Date": "February 11, 2014"}, {"Title": "UPGRADE OF EOS  REBEL  xT  400D", "Author": "Janice Feagle", "ReviewID": "R15PAYNND9IEYF", "Overall": "5.0", "Content": "Upgrade of EOS Rebel xT  400DVery pleased with my upgrade.  My old lenses where  all a perfect fit it.", "Date": "February 5, 2014"}, {"Title": "Love this camera", "Author": "Briana Bowen", "ReviewID": "R39JF6JJGJIDLJ", "Overall": "5.0", "Content": "First big girl camera and I absolutely love it. I ordered the body only so that I could order a larger lens with the money I saved. It is one of my favorite purchases to date.", "Date": "February 3, 2014"}, {"Title": "great cam", "Author": "michael patrick", "ReviewID": "R1EW1Z13LQVTKK", "Overall": "4.0", "Content": "This camera is the best thing smoking, it has everything you need if you are a videographer/photographer. The quality is amazing!", "Date": "January 28, 2014"}, {"Title": "Nice camera", "Author": "Inna Stolyarchuk", "ReviewID": "R3JLE3CW0EYBJV", "Overall": "5.0", "Content": "I had this camera for over then year and I love it was in brand new condition and works excellent", "Date": "January 27, 2014"}, {"Title": "a bargain", "Author": "wiltay", "ReviewID": "R1JQD7G1HB7AYG", "Overall": "5.0", "Content": "This is my third Canon camera, the others were point and shooters.  Even though it was my first digital SLR I learned how to operate it very quickly because the menu formats and operating methods are virtually the same.  I'm even a bigger fan of Canon now.", "Date": "January 27, 2014"}, {"Title": "Sub-par  --  a rare canon miss", "Author": "Mister Herbie \"Mister Herbie\"", "ReviewID": "R2WUCOASWGDZSF", "Overall": "1.0", "Content": "I got this camera because it was cheap but still has the new digic four processor.  !2mp were enough for me.  I am a professional amateur and use a nice lens and speedlite flash on the shoe.  I also used a battery grip for convenience and ease of use.  The flash went off only half of the time (definitely not in burst mode [even with new batteries]).  And it didn't focus half the time on the right object.  I am well-versed in Canon's architecture and button layout, so it wasn't new to me at all.  I tried several different settings, but was unsuccessful.  I have since returned it and have upgraded to a 60d, which is so much more worth the extra cost.  I highly recommend going with the 60d 6d 7d etc.  Also the flash memory slot is near the battery and not on the side which inconvenient.  And the battery grip required the use of a silly little external cable.  And finally, it is plastic-y and not too substantial in your hands.  A rare canon miss.", "Date": "January 13, 2014"}, {"Title": "Love my canon", "Author": "Laura Walker", "ReviewID": "R1D9FJ0QEU5I7I", "Overall": "5.0", "Content": "Love to images takes beautiful pictures an the family loves it my friends an making plans to purchase. The same camera", "Date": "December 31, 2013"}, {"Title": "Canon", "Author": "tkflint", "ReviewID": "R3ZTLD7DY0O0A", "Overall": "5.0", "Content": "Love it so far, bought it for taking pictures of my kids sports and it is doing a great job of catching great shots", "Date": "December 28, 2013"}, {"Title": "love it!", "Author": "Diane Sheets \"so cal mommy\"", "ReviewID": "RE439REN42OWW", "Overall": "5.0", "Content": "I bought this to replace my 10 year old rebel that suddenly died.  I didn't need new lenses, so it was great to have the option to buy only the body.  The only thing I didn't like was that I needed a different battery (I keep one for back up) and camera card ... both things I should have noticed while deciding on which replacement to order, but apparently neglected to remember and at no fault to the item itself.  If it lasts me as many years as my first rebel did, then it will absolutely be money well spent.", "Date": "December 18, 2013"}, {"Title": "Great Camera", "Author": "Kate Connelly", "ReviewID": "R34H6MNMVUXJV3", "Overall": "5.0", "Content": "Bought this as gift for my husband to replace his film camera.  The camera does everything he wanted and more. He can't stop raving about how much he likes it!", "Date": "December 12, 2013"}, {"Title": "Great camera!", "Author": "Brittany Baird \"brittbaird\"", "ReviewID": "RSCVZ3PL2BQJB", "Overall": "5.0", "Content": "Great price and absolutely NOTHING wrong with the camera. I bought this after my screen shattered and I found that the price to ship it to Canon to get fixed would be the exact same as just getting a new, refurbished one. ($40 shipped there, $200 (estimated) fix costs, $40 shipped back = $280+)", "Date": "December 9, 2013"}, {"Title": "Great camera and a good deal.", "Author": "DGM \"cowboy_in_me\"", "ReviewID": "R2O43I26FWKSLT", "Overall": "5.0", "Content": "Great quality for the price. I'm very much just an amateur photographer but for me it's very adequate and easy to use.", "Date": "December 8, 2013"}, {"Title": "Love My New Camera", "Author": "M. Lea", "ReviewID": "RG6CALMACN5QF", "Overall": "5.0", "Content": "I had a Canon Rebel 35mm with several lenses, but wanted to upgrade to a Digital (body only) with 3 kids, so I can delete bad pics and know what I'm getting right off the bat. BEAUTIFUL pictures, even from someone who basically points and shoots her digital pics. Very easy to use in automatic setting, and there are several excellent books to teach you how to use the other setting available, which I'm working on.", "Date": "December 5, 2013"}, {"Title": "Great camera!!", "Author": "Cathy Biermann", "ReviewID": "RJS1RPITIRU9W", "Overall": "5.0", "Content": "I love our new camera! Its exactly what we wanted. Fast, clear great pictures. Its bulky but its a big camera. Im so happy about this purchase.", "Date": "December 3, 2013"}, {"Title": "Yes", "Author": "thatguydowntheroad", "ReviewID": "R3JFMFU2YHVM3E", "Overall": "5.0", "Content": "Phenomenal Camera for a beginner! I love it so far. I have been shooting with it for about 3 months now and it has been a wonderful camera. If you have the money and can find one in your budget, Get a t4i or t5i. I wish I did. But great beginner camera.", "Date": "November 14, 2013"}, {"Title": "Nice replacement for a planned obsolescence model.", "Author": "The Nana \"the Nana\"", "ReviewID": "R1X7CVIY4NPAK", "Overall": "5.0", "Content": "This model replaced an older camera when the monitor screen died.  Canon had no fix for the problem and offered to sell me a new one at a \"loyal customer discount\", a price much higher than Amazon's.  All of my existing lenses work nicely with this camera body.", "Date": "November 8, 2013"}, {"Title": "First DSLR I have ever used,And I love it.It works Awesome for Astrophotography too!", "Author": "Mike", "ReviewID": "RUBNII52FFEVG", "Overall": "5.0", "Content": "First DSLR I have ever used,And it works Awesome!I use this Canon Rebel EOS T3 for Astrophotography with my telescopes,and the images I was able to capture were unbelievable.Great Entry level DSLR.Canon made this product Awesome.Has a huge CMOS Sensor,and the quality is Very well made.I would recomend this product for any beginner.It's easy to used,and works flawlessly.", "Date": "November 1, 2013"}, {"Title": "Great introductory camera, but full of advanced functions!", "Author": "S. Wright", "ReviewID": "R2TBCKJTXXBQPA", "Overall": "5.0", "Content": "The Rebel t3 was my first DSLR camera.  It is overwhelming at first when you see all the options and don't know what shutter speed, aperture, and ISO are.  However, with some quick internet searches and youtube videos, I was able to learn the ins and outs of DSLR cameras.The T3 is ideal for beginners, but don't let that make you think this is a cheap camera or lacks great functioning.  As once said, you can have an expensive camera but take crappy shots.  The photographer is what makes the photo look good, your camera is just the tool.The T3 is very easy to use and its menu system is simple to navigate.  It is lightweight and many of the functions are self explanatory once you understand the purpose they serve.  I recommend DSLR photography for Dummies to get you started on understanding the T3.", "Date": "October 29, 2013"}, {"Title": "Rebel T3", "Author": "Mike N.", "ReviewID": "R252TL33L59WNT", "Overall": "5.0", "Content": "I was looking for a body that would take some of my old Canon Rebel lenses.  This one did.  Pictures take with this camera are great.  I would recommend it to anyone.", "Date": "October 3, 2013"}, {"Title": "Good Camera", "Author": "Ozzwald", "ReviewID": "R1WOLYDYUNC3YP", "Overall": "5.0", "Content": "Definitely a good intro D-SLR. It takes great pictures and the controls are easy to use once you learn what everything does (it does alot).", "Date": "September 21, 2013"}, {"Title": "Great camera", "Author": "Jeff Zumbrun", "ReviewID": "RWSDPEAGHT60O", "Overall": "5.0", "Content": "Love it....worked perfect to replace my old T3. Everything I excepted it to be. Looking forward to upgrading in the near future", "Date": "September 10, 2013"}, {"Title": "A powerful and affordable digital SLR camera!", "Author": "Adrian from Argentina", "ReviewID": "R1M1EI5P80I6J", "Overall": "5.0", "Content": "Canon continues to produce powerful, yet affordable digital SLRs for the masses, and the Canon EOS Rebel T3 is no exception. If you are looking for your first dSLR, the T3 is a worthy candidate that will offer you superior performance and image quality compared to your point-n-shoot, along with a broad range of exposure options that will help you further your photography skills. With a great street price, theT3 is hard to beat in your are looking for an extremely affordable dSLR.", "Date": "August 15, 2013"}, {"Title": "Canon EOS Rebel T3", "Author": "Mike", "ReviewID": "R3F3BSIYSR7MG5", "Overall": "5.0", "Content": "This was a great buy for a this camera.  It truly does just about anything you want it to do.", "Date": "August 15, 2013"}, {"Title": "Replaced a previous Canon Rebel", "Author": "Amazon Customer", "ReviewID": "RFX0OKEER346G", "Overall": "5.0", "Content": "Started with a 35mm then went on to a digital Canon Rebel. Now I've upgraded my digital to this digital and I simply LOVE it! My wife has the SureShot and she likes that too, but I wanted MORE camera. Boy did I get MORE!", "Date": "August 10, 2013"}, {"Title": "Canon EOS", "Author": "John T Porter Jr", "ReviewID": "R16VW5WYIRFFGW", "Overall": "5.0", "Content": "Love the product. I have been shooting with Canon since 2003 - loved them then, love them now. I would recommend this camera to everyone.", "Date": "August 9, 2013"}, {"Title": "Wonderful camera!", "Author": "KDL \"KDL\"", "ReviewID": "RTLKAV11ZJIJM", "Overall": "5.0", "Content": "The Canon EOS Rebel T3 is an amazing camera for an amateur photographer.  I am operating the camera in the most simple fashion and the results are exceptional.  The owner's manual is easy to use as is the same one on line, so the learning process is not difficult.  I do look forward to an expanded repertoire as I learn more of the camera's potential.  I'm glad that the camera was available without a lens because I already had a really fine lens.  I would recommend this camera to anyone who is interested in an  excellent camera for a modest price.", "Date": "August 2, 2013"}, {"Title": "Good camera", "Author": "Lee Moquin", "ReviewID": "R2MWSOT4IGVJA9", "Overall": "4.0", "Content": "Camera was a little hard to get used to.  It is my first \"nice\" camera.  Read most of the reviews before I purchased said camera.  Got lost in all the camera jargon.  Best bet......Make friends with a photo enthusiast and have them show you all the bells and whistles, the instructions are hard to follow.", "Date": "July 18, 2013"}, {"Title": "Just what I wanted.", "Author": "M.B. Rusk", "ReviewID": "R19ERKSAUN5MN2", "Overall": "5.0", "Content": "This camera is exactly as described.  My biggest concern was that my existing lens would fit.  They did!  The other concern was that it have it before my Granddaughter arrived for her summer visit.  It did!  I love the Rebel camera.  It's super simple to use which is important for me.", "Date": "June 15, 2013"}, {"Title": "EOS Rebel T3 12.2 MP Digital SLR Camera Body", "Author": "David Burton", "ReviewID": "R180MBHX1KOW11", "Overall": "5.0", "Content": "I needed to upgrade from my \"film\" EOS Rebel to a digital Rebel. I chose the T3 because it's a Canon (no lens interchangeability issues. Going from digital to film there is an issue with the small zoom lens; the lens for the digital camera does not fit into the film camera body) and because it was extremely cost effective. I think my other digital EOS Rebel may be ONE of the first digital Canons... the new T3 has a lot of additional features that I really like. And, of course, there is the excellent quality of the Canon system to consider!", "Date": "June 13, 2013"}, {"Title": "Canon EOS Rebel T3", "Author": "Ramon A. Tejada", "ReviewID": "RY1P6SEVF545P", "Overall": "5.0", "Content": "Bought this as a gift for my 17 years old. She is a shuttle bug, and enjoy taking better pictures now. I am glad I got her it!", "Date": "May 17, 2013"}, {"Title": "Love the camera", "Author": "Kishan Vanapamala", "ReviewID": "R3B3QL7ONJNUMJ", "Overall": "5.0", "Content": "I am an ametuer and so far my experience is excellent. Photos came good, I haven't tried all the options but confident it will be good.", "Date": "May 10, 2013"}, {"Title": "Great for the person getting into digital SLR photography/ video", "Author": "Brandon Burdick", "ReviewID": "R2B97C1WXUWGI4", "Overall": "5.0", "Content": "Great first slr camera for the photo enthusiast looking to take it one step further then the ol' point and shoot.  Bought this for my brother and I am a pro photographer, lacks some feature's of my 1D and 7D cannon's but the overall processor, sharpness, and shutter release all function very well in this camera.  12 megs is sufficient for most uses in photography, so overall a great camera for a very affordable price.  This camera is also nice because you can begin to purchase canon lenses that you can use with all different levels of camera's so the lenses you buy for it, you can use down the road if you choose to upgrade your camera.  My brother is very happy with his camera, and is using it all the time, so great purchase!", "Date": "April 23, 2013"}, {"Title": "I love it", "Author": "IRISHEYES83", "ReviewID": "RIGQ1KULW7DF2", "Overall": "5.0", "Content": "The camera works great. It's the best one I have ever had. The pictures look awesome. I love this camera.", "Date": "April 19, 2013"}, {"Title": "super value", "Author": "Luke MacDonald", "ReviewID": "R1L53MM7ZTOJBG", "Overall": "5.0", "Content": "I recommend that any would-be buyers of DSLR cameras do a lot of their own research in order to feel comfortable with their choice. This model was the right price point and capabilities for my needs.  It arrived in perfect condition and is exactly as advertised.", "Date": "April 18, 2013"}, {"Title": "No complaints", "Author": "Contrejo", "ReviewID": "R2RE1H8HA5GFNQ", "Overall": "5.0", "Content": "This is a great camera. Even tho its the cheapest of the canon SLR's I'm pretty happy with it. It left me some extra cash to get nicer lenses, which i think is what really matters most", "Date": "April 15, 2013"}, {"Title": "LOVE", "Author": "H. Sell", "ReviewID": "R110A1SZYRFYYQ", "Overall": "5.0", "Content": "Love this camera!!  Easy to use and beautiful pictures! If you want to take sharp pictures, this is the camera for you.", "Date": "March 20, 2013"}, {"Title": "Rebel T3", "Author": "Whitney Frise", "ReviewID": "R1NFY4PNRB7NWJ", "Overall": "5.0", "Content": "Oh my gosh! I love this camera. I needed it for my photography class, and I am glad I chose this model and camera. The pictures it takes are amazing.", "Date": "February 26, 2013"}, {"Title": "Canon EOS Rebel T3 12.2 MP", "Author": "Larry H", "ReviewID": "RDYNBL7VVADUX", "Overall": "5.0", "Content": "Perfect starter camera.  Bought for my wife.  Now she  has her own and my camera is there when I need it.  Love it.", "Date": "February 13, 2013"}, {"Title": "Good balance", "Author": "Smerfj", "ReviewID": "R3BD1HMV098DMH", "Overall": "5.0", "Content": "This camera has a great balance of performance vs price. It has performed the job as expected, and should do so for others as well.", "Date": "February 12, 2013"}, {"Title": "Great value", "Author": "Ashley", "ReviewID": "RLZT0WVH1S38R", "Overall": "5.0", "Content": "This camera is perfect for a step into the DSLR world.  The great thing about getting just the body is that you can get a much better lens then the kit lens that usually comes with it.", "Date": "February 1, 2013"}, {"Title": "Exactly What I Expected", "Author": "Lisa", "ReviewID": "R3L6WGTZAZ09RW", "Overall": "5.0", "Content": "This item was exactly what I expected and was delivered very quickly. The camera easily fit my existing lenses and easily replaced my old 35 mm model.", "Date": "January 21, 2013"}, {"Title": "Works fine", "Author": "Horst Severini", "ReviewID": "R11309CPTY00OB", "Overall": "5.0", "Content": "From the few times I've used it, with my old EF lenses from my old Canon EOS 300 (35mm film) camera, it seems to take good pictures and handles quite well.", "Date": "January 18, 2013"}, {"Title": "Just what I needed", "Author": "Mike", "ReviewID": "R2BW4FZ2RO5R61", "Overall": "5.0", "Content": "Wanting to move from film to digital, this camera let me continue to use my canon lenses. I take photos around the Red Rock area near Las Vegas. Have not had the chance to work this camera up there, but the Christmas pictures I took around Las Vegas and at the family get together in CA were great. Learning to work the controls to gain max benefit from the technology (I'm used to film, so changing the ISO \"mid-roll\" is a new concept). The transition from my film Rebel to this was easy.", "Date": "January 12, 2013"}, {"Title": "A great camera at a GREAT PRICE!", "Author": "Amazon frequent customer", "ReviewID": "R1G38LNDWBI5Q7", "Overall": "5.0", "Content": "The Canon Rebel series of cameras have never let me down. The T3 is a great \"middle of the Road\" camera with features that any novice photographer can learn to use in no time!", "Date": "January 11, 2013"}, {"Title": "Upgraded from Film to Digital- same lenses.", "Author": "Leo G. Cirotski", "ReviewID": "R87LU850VPNEE", "Overall": "5.0", "Content": "I bought REBEL T3 EOS 1100D  case only,from Amazon.com and my three lenses from my Cannon EOS 630 (film model) were fully compatible!!I got the digital upgrade for minimal cost!  High quality.  Infinite number of free digital snapshots.", "Date": "January 6, 2013"}, {"Title": "gift - awesome", "Author": "havesomefun", "ReviewID": "R3UQN8LLALR7AY", "Overall": "5.0", "Content": "purchased this as a gift for daughter in law, she was thrilled!!  such a great camera and easy to oeratelooking to upgrade mine...would buy again from this merchant, quick, easy,", "Date": "January 4, 2013"}, {"Title": "Nice", "Author": "Cgrady", "ReviewID": "R38FE2UB7XQAB8", "Overall": "5.0", "Content": "I ordered the Canon T3 to replace and upgrade my previous camera. It hasn't disappointed. The additional features are wonderful.", "Date": "December 22, 2012"}, {"Title": "Great camera", "Author": "Florencia", "ReviewID": "R1H2J67DOZSIK5", "Overall": "5.0", "Content": "I think this camera is great for beginners - My first camera! Be aware of the fact that it comes with NO lenses, it is adviced but I did not pay attention and then had to buy them, so the overall price was higher.", "Date": "December 17, 2012"}, {"Title": "my first DSLR", "Author": "Kim", "ReviewID": "R2O8FFD878WF7Z", "Overall": "5.0", "Content": "Love this camera so far! I don't have another DSLR to compare it to, but I have no complaints about this one.", "Date": "December 12, 2012"}, {"Title": "canon for sure", "Author": "cfl", "ReviewID": "R1YBVDL5V0RLNP", "Overall": "4.0", "Content": "It is always a good bet, Canon is really good, you have all what you need for photos and video", "Date": "December 9, 2012"}, {"Title": "Great camera!", "Author": "Amazon Customer", "ReviewID": "R2WFRIRDQA5YR1", "Overall": "5.0", "Content": "I thought something was wrong with my 8MP Rebel XT camera,so I bought this one as a replacement, turned out to be  problem with the lens. Now I have a great camera, and a very good back-up camera.  It has a nice strong shutter sound that make me feel like it is probably a bit more rugged that my old camera. The photos are crystal clear in all kinds of lighting. I have been using it for almost a whole month and still haven't needed to recharge the battery.", "Date": "July 6, 2012"}, {"Title": "AMAZING!!!", "Author": "Sarah", "ReviewID": "R1EMNLA45HKLMP", "Overall": "5.0", "Content": "I am sooooo happy with my camera. This is my first SLR Camera and for it being used, not one scratch. If ya ask me it looks like new!! The seller even wrote a comment on the reciept, in pencil about the product. I can tell the seller cares about his customers and goes the extra mile for them. I am over-joyed with my camera!! And according to consumer reports, the rebel t3 is better photo quality than the 2ti and the 2ti is rated the same as the t3i.If ya ask me I got an amazing deal on this camera!! Trust this seller!!", "Date": "June 6, 2012"}, {"Title": "Purchased for someone else", "Author": "Amazon Customer", "ReviewID": "R1JCS74OSH727B", "Overall": "5.0", "Content": "I cannot comment. This unit was purchased for my daughter, not me. She appears to be happy with the unit, but I can't Rate it.", "Date": "March 8, 2013"}, {"Title": "Great camera for a novice", "Author": "Joseph Tan", "ReviewID": "REAKHFFTWK13D", "Overall": "5.0", "Content": "As of 2013, this is the most basic dSLR that canon sells, and it shows.  None of the grip areas are textured as is found in the canon line above the T3, and it lacks an articulating screen.  It does not have the latest external flash control menus as found in t3i and higher.That said, this was given as gift and the recipient was extremely happy with it.  The sensor itself is quite good, and it has a native sync speed of 1/200 or 1/250 depending on the trigger used.  While it lacks full external flash control menus,  it has full E-TTL II and HSS capability.  I would say that it has usable raw files up to iso 1600 or so with 3200 at a stretch.  This inexpensive camera is really a great pair with the canon 50mm f/1.8, which gives a field of view similar to an 85mm lens on the full frame cameras; great for portraits and a fast,  general mid length prime walk around lens.", "Date": "January 28, 2014"}, {"Title": "Horribly soft focus", "Author": "Artworks Images Photography", "ReviewID": "RVDS1KV3UOUKE", "Overall": "3.0", "Content": "'m a professional photographer so I'm a little more picky about my photos then the average person but I don't think I'm unreasonable when it comes to wanting a sharp image. Most people wouldn't ever notice their images slightly blurred but I know some do. I replaced my XTi with the T3 after it got stolen after 8 years of wonderful use. This was for my personal use, not professional so I wasn't looking for anything that delivered like a Canon 5d would. Let me say that the price is great for this camera. You can't beat that but after using this camera, it is definitely not worth any more then the $300 I paid for it.The cons:The body has a very cheap feeling to it that I have never felt in a canon camera before (I used to work at a camera store a few years back). It feels almost like one of those disposable cameras you used to be able to get. Like not $300 cheap, more like $80 cheap!I have had VERY few sharp images with this camera. I'm a professional photographer so I know what I'm doing it taking a sharp image. I used my 17-55mm and my 24-70mm lenses and neither could produce decent results. These lenses are worth $1000 and $2000 so if anything could get a great image from this camera, they should. And I'm trying not to be overly picky here but they were very soft images.Pros:Light weightpricecan shoot at much higher ISOs then my XTi. Its amazing the difference in this little camera. I can shoot at 3200 without any noticeable noise in a properly exposed photo. This is far superior to my old XTi. I had no idea the lower end cameras were advanced enough to do that. But I would assume that any camera above this (60D, T3i) would be able to deliver this as well.The camera seems to communicate better with my external flash. I've been getting much better exposure while using my external flash in low light situations. Once again, I'm sure any model above this would do likewise.As a sum up, if you don't notice the soft focus and don't mind the cheap feeling, go for it. If you're concerned with those factors, check out the T3i. Its only $200 more and has a swivel screen. I'll be checking it out myself to see if the focus is better.", "Date": "August 2, 2013"}, {"Title": "reliable", "Author": "M. Vaughn", "ReviewID": "R32M1SNL7DDO9V", "Overall": "4.0", "Content": "its a little complicated for me, as i am not a digital person, whatsoever, but from what knowledge ive garnered from basic use, its fantastic. amazing pics!", "Date": "February 17, 2013"}, {"Title": "Perfect Condition", "Author": "Kayla B", "ReviewID": "R315Y3FLE0MJUM", "Overall": "3.0", "Content": "The only trouble I had was with finding compatible lenses. I bought a fisheye lens, but it would not go on the body of the Canon.", "Date": "January 2, 2013"}, {"Title": "Good", "Author": "Jorge Mora \"jrmora71\"", "ReviewID": "R3R0X3PIEMNEFA", "Overall": "4.0", "Content": "Not really good pictures using the Canon 70-300 or 55 mm lenses. Nonetheless, it works great with our new Tamron 18-270 (although it costs more than the camera...)", "Date": "July 12, 2012"}, {"Title": "Love This Camera", "Author": "sjt", "ReviewID": "R3VO2MGAQN0CS7", "Overall": "5.0", "Content": "I bought the one of the first Rebels back around 1990 sometime.  This is the first time I upgraded the body and I love it! Invest in a good, fast (Class 10) SDHC Memory Card and you will be amazed at the speed and performance of this camera.  If you already have your EOS lenses, this deal from ZeeMoto Digital ($338 for everything except the lens) is the best deal I've seen!  It was delivered promptly and works great!", "Date": "June 11, 2012"}, {"Title": "Excelent camera!", "Author": "Gabriela", "ReviewID": "R2SKWRJN6MYQXG", "Overall": "5.0", "Content": "I highly recommend this camera, it's easy to use, excelent product!Es exactamente lo que buscaba, una cámara profesional a un costo razonable. Agregué un objetivo Tamrom 18-30, de excelentes resultados también. Sólo la encuentro algo pesada para cargar durante todo el día en el cuello.El proveedor la entregó en la fecha pactada, sin inconvenientes.", "Date": "February 27, 2012"}, {"Title": "Not the features I thought it would have", "Author": "GoPower", "ReviewID": "R2Q76FOK8PJEG5", "Overall": "4.0", "Content": "I cannot rate the camera itself because, when I opened the box, I noticed that this model doesn't have the rotating viewer screen which is what my Canon Powershot has.  I was disappointed because I thought any upgrade would have this feature.  So, I returned this model and exchanged it for a T3i.  The product description could have been a little more explicit.", "Date": "August 19, 2013"}, {"Title": "Great little camera!", "Author": "Nancy M. Bensley", "ReviewID": "R3EOPXA4V8DKFU", "Overall": "5.0", "Content": "This is a great little camera.  It is easy to use and easy to download the pictures.  I am please with the pictures that I've taken.  And to top it off, I received it earlier than promised!", "Date": "December 14, 2011"}, {"Title": "Ok for the price, but not the best inexpensive camera", "Author": "Macauley86", "ReviewID": "R25CA9158A6TQR", "Overall": "3.0", "Content": "I've shot with a lot of cameras, both from Nikon and Canon. My favorite family pictures were taken with a Canon XSi; I loved the way it rendered pictures. My Nikons (D70, D40, D200, D3100) were very good, loved their ergonomics, auto-iso, P mode, auto white balance, and spot-on fill flash, but the pictures did not have the stunning rendition of the XSi. I purchased this T3 hoping it would have the same colors and picture quality as the XSi, but no luck. Unlike the XSi, fill flash in aperture priority mode is a little harsh, auto white balance is off indoor (the D3100 is perfect, both indoor and outdoor), auto ISO is stupid (AUTO ISO defaults to 800 when flash is turned on, why?), exposure is mostly off indoor (have to set it to +0.7 or +1). The D3100 was almost always spot on. Colors are off. This camera is not even close to the XSi.On the plus side, it has a movie mode, which can be useful for the occasional funny family moments, and the buttons are all placed on the right side of the screen, very easy to reach with one hand. the LCD display is very good. But I would only choose a Canon over a Nikon's superb ergonomics if the picture quality were to my liking. In this case, it is not.", "Date": "September 2, 2011"}, {"Title": "EOS Rebel T3", "Author": "Edward", "ReviewID": "R32TJGNERNUM5U", "Overall": "5.0", "Content": "I haven't used the camera much since I bought it.  I have a Canon film camera and I can use the lenses from it on my new one. I plan to use it more when the weather gets better.  After looking at all the options I have with the camera I'm excited to start using it more.", "Date": "March 31, 2012"}, {"Title": "Not a satisfied customer", "Author": "Dilara", "ReviewID": "R2Q4PQI5HR9YTE", "Overall": "2.0", "Content": "It did not have any lens. I am taking a photography course and was not really good at judging cameras and when I got it I was aghast it was without any lens.", "Date": "April 11, 2014"}, {"Title": "Feel like I've been ripped off", "Author": "Cynthia A. Mcvay \"Siskin\"", "ReviewID": "R1J9BPPP9QPV8J", "Overall": "1.0", "Content": "I very rarely write reviews, and I generally have great experiences with products.  But, I should have been more careful with this purchase.  THIS PRODUCT DOES NOT HAVE A LENS!!!!!  Even if the reviews say it does - it does not.  Even if the box says it does - it does not!  There is a little handwritten sticker on the side that says, \"Body only!\"  Be careful with this purchase - whoever is selling them is selling them cheaper because they are taking the lens out and selling it separately.  You're better off reading the descriptions more carefully than I did.  Now I'm out another $120 to buy the lens that should have come with it.  I only blame myself - I just wish it was a little more clear in the description and the reviews.", "Date": "June 12, 2012"}], "ProductInfo": {"Price": "$449.95", "Features": "12.2MP APS-C CMOS Sensor, 18-55 EF-S Lens NOT Included (Taken out of the Box)\nSD/SDHC/SDXC Memory Card Slot, DIGIC 4 Imaging Processor\n2.7\" Clear View LCD, 720p HD Movie Mode\n100-6400 ISO, Compatible with Canon EF and EF-S Lenses\n63 Zone Dual-Layer System / 9 Point AF, 3 fps Continuous Shooting", "Name": "Canon EOS Rebel T3 12.2 MP CMOS Digital SLR Camera and DIGIC 4 Imaging (Body) - With 1-year USA Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/51YMAxQeTYL._SX300_.jpg", "ProductID": "B005LW580O"}}