{"Reviews": [{"Title": "D800E for bird photography", "Author": "E. Bowles", "ReviewID": "R16RE2TCJ4YBCI", "Overall": "5.0", "Content": "Like others, I debated on whether or not to choose the D800E or the D800.  I'm primarily a nature photographer, so my inclination was to get the D800E.  The one potential problem situation was with moire on bird feathers.  I ultimately chose the D800E based on the logic that birds have so many feathers at different angles and proportions that significant moire would be very unlikely.Well I received my D800E two days before a planned trip to the St. Augustine Alligator Farm.  After more than 2500 images under all conditions, I have to rate the camera as spectacular - a step beyond excellent.  Image quality and detail are stunning.  I was using a Nikon 200-400 f/4 VR and a Nikon 600 f/4 VR for most of my images.  The level of detail is simply stunning.  There is detail that I have never before seen from any camera.  I'm seeing resolution at 100% (1/7th the image) that is suitable for a web post or small print.  And noise is completely absent at lower ISO levels and minimal even at ISO 6400.You know going in that the D800E only has a frame rate of 4 fps.  That's enough for a quick burst at critical action.  With birds I'm shooting at 1/1000 second or faster so I am already trying to capture critical action and a catchlight in just a few frames.  At burst rates it does take a little time to write to the card, but I never came close to filling the buffer.One of the things that has been underappreciated is the new AF system.  The new AF system of the D800 is excellent - very quick and accurate.  There have been some reports of AF errors with the D800 - especially using the widest sensor and a wide angle lens.  I have not seen that issue on my copy of the D800E.The ergonomics and controls are very intuitive.  This is a camera you can immediately pick up and use - just like other Nikons.  The one adjustment I had to make was with exposure compensation.  The direction of the exposure comp has been reversed, but can be customized in the camera menu settings.While there have been reports of the need for a tripod or special technique, I shot the D800E just as I would have used earlier cameras.  If you miss focus the image is still soft, but there is no problem using the camera handheld or on a gimbal head.File sizes are large - and as expected the large files put greater demand on your computer.  Large files understandably take longer to open and to save.  But this is to be expected.Colors and dynamic range at ISO 200 are spectacular.  Even at high ISO levels, colors are very acceptable.Overall, I am very pleased with the D800E and highly recommend it for advanced amateur and pro nature photographers.  This is not a camera for a beginner or someone who is not skilled.  This is a camera for someone who is skilled, understands the tradeoffs involved, and wants the best image quality possible in a DSLR.EDIT June 16, 2012I've continued to use the D800E and my opinion has not changed.  It's a great camera.  One thing to be aware of is the depth of field.  Because the in focus area is so extremely sharp, your specific focus point and depth of field require a little more thought.  Your choice of what parts of the image should be in sharpest focus will be rewarded, but if you make the wrong choice you can really tell the difference.", "Date": "May 22, 2012"}, {"Title": "Why I sold my D800 to buy a D800E", "Author": "Larry", "ReviewID": "R2GYC4D5855EY7", "Overall": "5.0", "Content": "I bought one of the first D800 bodies Nikon sold. And, yes, I had the left-side AF issues that other folks describe in these reviews. I had been using the camera for a couple of months, and was very pleased with the quality of images I was getting. However, I decided to have the left side focus points fixed in case I ever needed to move my focus point over to the left side. I sent my D800 in to Nikon USA Repair in Melville, NY. It came back fixed and worked great.In the meantime, a D800E arrived that had been on order since February 7th. After a week of shooting both the D800 and D800E, I decided to sell the D800 and buy another D800E. I like to have two identical bodies so I always have a backup camera on treks, and one that has the same controls as my other body. I was planning to keep the D800 as my backup until I saw the images coming out of the D800E and after I did extensive testing with the FoCal software from Reikan Technology.I only shoot RAW (Nikon NEF format). While I could post process the images from the D800 and D800E using Adobe Creative Suite CS6, and make them look almost identical...they were in fact not identical. As long as I was shooting landscapes, the images from the two cameras would appear to have the same level of details in my first prints. However, when I started to do prints larger than 16 in x 24, I was convinced the D800E was the winner. You could clearly see the finer details.After I started using the FoCal software to do my AF Fine Tuning, I also found major differences in the sharpness the D800E could produce. While FoCal is not currently designed for use in comparing camera bodies, it does provide that capability if you carefully control the lighting on your target, the distance to target and the camera/lens settings. When I did this apples-to-apples comparison between the D800 and the D800E on all of my Nikon lens (14-24mm, 24-70mm, 70-200mm, 200-400mm), I found the aperture sharpness results for the D800E were substantially higher than the results from the D800 for every lens...and consistently so. When I zoomed in on the shots of the target for a visual comparison, I could also see a difference, especially in the fine details in the target.I don't yet know how much more details I will get for all types of shots, but I do know I can crop the D800E images significantly more than I can crop D800 images and end up with better details. For any kind of animal or bird shot, where I do not have the luxury of setting up for perfect composure, having more details means I can worry about composition later because I know I can crop more. I have cropped down to 10% of some D800E images, and still had enough details to make a nice 8x10 print without using special fractal software. Now that is detail I can live with!", "Date": "August 10, 2012"}, {"Title": "Amazing Clarity - Nikon D800 vs D800E", "Author": "Blake H. Freeman \"Blake H. Freeman\"", "ReviewID": "R1FTQZZB90H2VQ", "Overall": "5.0", "Content": "I originally ordered a Nikon D800E but after 4 months on a waiting list I settled for a Nikon D800.  I shot it for a week or so, but when the Nikon D800E became available I jumped at the opportunity to own the camera I had originally pre-ordered.  I shot both camera's with a Nikon 85mm 1.4G and they were both amazingly sharp with detail I've never seen from the format before.  I started shooting the Nikon D800E today and it is plainly evident that their is a fidelity that is simply beyond what is available from the Nikon D800.  The colors are also better, its hard to explain but they seem to be more true/accurate.  Overall, I am highly impressed with both cameras but simply cannot believe the fidelity and quality that I am getting from the D800E.  Well worth the wait & cost.  I hope this helps a prospective buyer!", "Date": "October 2, 2012"}, {"Title": "Hi-res super SLR", "Author": "Busy Executive", "ReviewID": "R19MOCM9LXMBR", "Overall": "5.0", "Content": "I've been a Nikon customer since my Dad gave me his old Nikon F in 1972 (and yes, I still have it). The D3/D300 generation finally convinced me to give up on film, and recently, with over 100,000 images on the D300 shot meter, I upgraded my older D3 and D300 to a D4 and D800E. Both the D3 and D300 were amazingly fine cameras, so my expectations have been high - and I'm happy to say, the new Nikons have generally lived up to my expectations. In this review, I'll stay focused on the D800E.In a nutshell, the D800E is an amazing camera that's a steal for the price. When I first bought a D300 several years ago, I was stricken by the ease I was able to get keepers having  that certain \"pop\". The D800E continues in this trend. It feels like a well-tuned machine that disappears in your hands, and when you point it at something, it just gives and gives. You never feel like the camera is holding you back...the only limits are your own technique and artistic sense. To me, this is exactly what a fine camera should be.As for the D800 vs. D800E decision, in the end I decided that the D800E is (marginally) better in ultimate image quality, with no obvious drawbacks other than the higher price. False color and moire? Yes, they're there...and when I first got my camera, I went out and took dozens of shots of subjects intentionally designed to bring out the worst. None took more than a minute to fix in Capture NX2 or Photoshop. Not an issue for me.A few other reviewers knock the idea of going from DX to the D800E, but I suppose I disagree. My rationale in going with the D800E as a replacement for my DX camera was all about preserving my investment in lenses. Put a DX lens on the D800E, and you get a 16MP D300S. In any measure of image quality, it's better than my aging D300, and I don't need to scrap the 5-6 DX lenses I've collected over the years. The D4, by comparison, is somewhat different...with a DX lens on the D4, you don't get any more resolution than the D300 - instead, you get an amazing low-light D300. I suppose each has a place, but I tend to want both options.Prior generation accessories don't work on the D800E, no matter what you're upgrading from...forget about reusing the batteries, grips, etc - about all I salvaged was my collection of CF memory cards, my Nikon speedlights, the GP-1 GPS unit and my camera strap. But if you're like me, the big investment is lenses, and I'm happy to say all of my lenses made the transition without issue, as you'd expect.Keep in mind that 36MP raw images are huge, so any 4GB CF cards you might have are getting pretty wimpy: 50 full-resolution raw images fit on a 4GB card. 32GB cards are much more convenient, and the D800E supports dual CF and SD slots, so you can carry quite a bit of memory.And to fill up all those memory cards, you're going to want the best lenses you can find. Although most any Nikon lens ever made will fit on the D800E, that pixel-packed sensor has an uncanny ability to reveal even the tiniest of lens flaws - and to amplify the merits of a top-notch lens. My 85mm 1.4 is awesome, as are my 14-24, 24-70, 60 macro and 135 DC. You can even see optical differences f/stop by f/stop. The 24-120 you see on a lot of these cameras is an okay lens, but if you look closely, you'll see its flaws without too much effort. And the same goes for any of the kit-quality DX lenses...my advice would be to invest in at least one really good prime lens.Just as all those pixels put stress on your lenses, you'll want to consider everything in your digital darkroom, from computer to printer to software. Editing large raw files (or uncompressed video) takes a lot of computer...what seemed snappy and fast with a 12MP camera might be notably sluggish with 36MP. The D800E can to 8x10 prints at over 600DPI...can your printer do anything with all that detail? If you haven't updated your imaging software in a long time, you'll probably notice most older programs can't even handle files as large as the D800E puts out.Some reviewers take the stance that the D800E is somehow \"too good\" for the typical amateur. That unless you're willing to use exotic and expensive lenses, a tripod for every shot, etc etc etc that somehow you're just not going to be happy with this camera. I tend to look at this the other way around...if I take a shot with my D300 and my D800E, no matter what level of care I put into the picture, the D800E will always give me a better looking image. Yes, if I'm hand-holding at slow shutter speeds and using a lesser quality lens, I'm not going to get the maximum quality the D800E is capable of. But I *am* going to get as good or better images than most any lesser camera. Sometimes \"good enough\" is all I can do, and the D800E, in addition to having insanely high upper limits on performance, is also going to give me better \"good enough\" images. Just because I'm only driving to my local grocery store doesn't mean I don't enjoy driving a Porsche.Construction quality is excellent, as you'd expect for a pro-grade camera at this price point. Although side-by-side next to a D300, the size difference is small, the D800E has more \"heft\" to it. The grip fits well in your hands, and most of the controls can be operated by feel, even with gloves. If you've used pretty much any Nikon DSLR, the layout and menu system will feel familiar to you, and I was able to dial in most of the settings I wanted without spending lots of time foraging through the instructions. Some folks have criticized the placement of the ISO adjustment button, since it pretty much takes two hands to operate. For myself, I tend to set the ISO where I want, then use the exposure compensation switch, as I can do this with one hand and without taking my eyes off the viewfinder.I've read about various firmware problems (focus and video problems mainly) and I'm happy to say, mine has not shown even the slightest symptoms. If it helps anyone, mine was new in Dec. 2012 and has a serial number of 3010xxx.As for individual features, yes, there's all in here...seriously, there's too much to write about in a short review, but here are a few highlights:- At ISO 100 and standard image settings, I get about 10 stops of dynamic range. This is about a stop better than the D300.- At ISO 100-800, noise and picture quality are superb. I'd rate ISO 1600-3200 as good, if you use a strong software noise reduction package. 6400 and up is hit or miss.- Video is amazing if you use the uncompressed HDMI output and record to an external device. This is about the best video you'll find short of studio-grade video cameras.- If you do a lot of video, you'll want to invest in outboard microphones, or Nikon's shoe-mount ME-1.- Autofocus is blindingly fast, except during video recording.- The CLS system works flawlessly with the built-in flash as a master.- Frame rates are somewhat slow in FX mode. The D4 is a clear winner here, and even the old D300 was notably faster.- The built-in flash seems a bit higher, meaning it's less prone to those annoying dark areas caused by large lenses obstructing the flash beam.- The GPS works well, but remains slow. I tend to leave it on whenever the camera's on (as opposed to the default which cycles it on/off with the meter).- The add-on battery pack (MD12) is outrageously expensive, but it makes the camera much easier to handle.- You get about 500 shots on the standard internal battery...the MD12 get you up to 2000 images on a set of batteries, and you can use standard AA's.- The in-camera HDR is cool, but I prefer doing HDR in software.- The eyepiece view is very bright and easy to see, even without glasses. I have a 1.2X DK-17M, and I find I don't need to use it.- Live View is much easier to use, and the artificial horizon is a blessing for architecture or landscape shots.- Yes, it is as loud as some reviews say, even in \"quiet\" mode.- The custom menus and shooting options are a terrific feature, if you learn to use them properly.Overall, in the right hands, this camera is capable of producing some stunningly fine photographs. If you know what to do with it, or are willing to learn, then this is truly a five-star product.", "Date": "December 30, 2012"}, {"Title": "Why did I receive 2 returned/restock D800E from Amazon.com in 3 months?", "Author": "GLX", "ReviewID": "R4X2A0BX05E0O", "Overall": "1.0", "Content": "I ordered the first D800E on 6/1/2012; after waiting for 2 and 1/2 months, I received the camera at mid of September. I was so excited, but, as soon as I opened the shipping package, I knew the camera was used/returned: the outer box was worn, the camera LCD protector has scratches, and there were several big pieces of dust on the mirror and in the camera. The serial number of the camera is 30049XX.After returned the first one, I waited another month until Amazon out of stock of D800E and then in stock again. I thought OK now Amazon.com should have a brand new batch of D800E, so I ordered the second one at mid of October and received it a week later. To my surprise, the second one's serial number was even smaller than the first one -- it is 30037XX. That made me very nervous and quickly ran some AF tests with my nikon lenses (60mm f2.8G, 24mm f1.4G, and 85mm f1.4G). As expected, the result was bad: very serious back-focus with all these lenses. That probably was the reason why it was returned by previous owners.It is clear that two D800E I received are returned/restock, or even refurbished, items sold as brand new. The shutter number of both cameras were reset to zero either by Amazon.com or by Nikon, so they knew.I write this review just want to warn other D800/E buyers: there are many defective D800/E from the earlier production are still in the market today, so carefully check and test what you have received.The one star is to Nikon for producing so many defective D800/E without recalling them, and to Amazon.com for sending out returned/used/restock, even refurbished, items without inform its customer about the true condition of the items.Update (November 10, 2012): ordered the third D800E from another online store this week. Called the store for the serial number of the camera before it was shipped to me. The number is 3009XXX, much bigger than those from Amazon.com -- a good sign. After received it couple days ago, I have been doing some extensive tests on the camera with all of my FX lenses. The result: finally, I think I got a brand new, trouble-free D800E. The AF is good with all my lenses, even 14-24mm f2.8G and 24mm f1.4G. No dead or stuck pixels even at iso 1000 with no NR. Image sensor is clean, no dust or oil.Based on my tests, I would say D800E is a fantastic camera -- it is so sharp, the produced images has so much detail when used it with the best nikkor/zeiss lenses. It is a unique DSLR: one and only Nikon DSLR that doesn't have anti-aliasing filter, so its image quality could challenge those from $20,000 medium format. Nikon's engineer department has done a great job developed this wonder FX high-resolution imaging system, but its quality control, management, public relation and customer service have messed up a big time. That is why it was so painful to just purchase a good quality D800/E. The camera itself deserves 4-5 stars.Good luck with your searching for a good D800E! You will like the camera. Enjoy shooting!", "Date": "November 6, 2012"}, {"Title": "Personal Photography Renaissance", "Author": "CliftonFlowers", "ReviewID": "R26URQIHWZRLE", "Overall": "5.0", "Content": "I cannot say enough about the merits of this machine!  In the late 80's and 90's I owned several Nikon bodies and kit-level lenses.  My film photos at the time were decent and frankly maybe about 1 in 3 photos I considered good, and perhaps 1 in a couple hundred (landscape pics) was truly exceptional.  What I am getting to here is that with that type of success rate, my interest in photography was bound to decline; and it did.  So aside from taking pics of family on special occasions and some vacation shots, my gear stayed on the shelf.Since I have always had an attraction to Nikon cameras and wanted to try the FX format, I sold an old Rolex watch that had been sitting in a drawer for over 15 years and used the proceeds to buy an 800E and a 24-70 2.8 lens as I wanted glass commensurate  to accompany this much acclaimed camera.I simply don't have the ability to tell you just how much I love this camera and lens combination!  From the moment I picked it up (heavy) and took the first few shots, I knew I had latched onto something special.  The camera is solid, precise, and just exudes craftsmanship, intelligence and professional capability.  I suppose it imparts the feeling that with the right lens and some basic knowledge about light and composition, you can do anything!That sense of capability and pride in just holding the damn thing was the reason I titled this review as I did.  The sensor capability and dynamic range of this camera puts to shame anything I ever took on film years ago, and it has opened my eyes again to seeing pictures in most everything I do, and once again to enjoy the magic of capturing slivers of time and vision.  This past Christmas and just after getting the camera/lens combo, my wife asked me to do some obligatory photos of family and friends around the tree.  In the past I have used either an Olympus point and shoot or my D90.  Anyway, I broke out the D800E and the 24-70 and did my best to please her.  (I am not one who usually enjoys taking photos of a bunch of staged smiles--you know what I mean.)  I framed up a shot of our daughter and 4 friends near the tree and bounced flash from an SB-700.  The playback photo looked good in terms of person capture and lighting, so I didn't think more about it.  Later, upon looking at the pic in LR4, and even when I took the shot to a silly degree of magnification, my daughter's face among that head-to-toe group shot of 5 persons, was still useable and printable at 8.5\" X 11\".  Just crazy, crazy sharp; so sharp that I framed that head shot and have received repeated compliments of its technical quality and much praise from my very picky wife.  Little do people know that that pic was only about 5% of the original frame!!So if you have ever held a love for finely crafted and capable technology, buy this camera.  Yes it eats up a battery charge faster than expected, so be sure to get at least a second battery.  For sure it will re-ignite your artistic vision and you'll find yourself watching a little less TV and more time daydreaming about what you can do rather than what you have already done.  The only downside for me is that I rarely pick up my D90--a shame.Thank You Nikon for such a great camera and this new inner smile.", "Date": "August 10, 2013"}, {"Title": "Exceeded expectations", "Author": "Jim Mcculloch", "ReviewID": "R3R5QQ8NGYMOT9", "Overall": "5.0", "Content": "I actually should write two reviews, one of the camera and one of the Nikon company.  The latter review would be very unfavorable, at least with regard to basic honesty with would-be buyers about  production and delivery problems.  This, however, is a review of the cameraThe camera replaces my D300.  I am mainly a nature photographer, and I did not expect moire problems to occur with the things I shoot, and they did not.  Moreover, I haven't found any moire problems in my street photography, or my occasional portrait and still-life shooting either.  I am sure there are circumstances where it could be important but I have not run into them in a month of intensive shooting.Image quality is superb.  Low-light capability, at least for someone upgrading from a D300, is outstanding.  What I expected was very high resolution but not much improvement, if any, on the D300 in low-light or high ISO noise.  I got my expected resolution (excellent, that's all I can say) but I am very, very pleased about the camera's ability to shoot in low light and/or at high ISOs.  I have found that I can ditch the monopod I normally use with a 180mm macro lens (which has no vibration reduction) and shoot hand-held at ISO 1600 with about the same noise as I would get at ISO 400 on the D300.  That surprised me.  It was a pleasant surprise.Hand-held is a plus if you are trying to shoot dragonflies or butterflies.  You will lose a lot of such shots with a tripod, or even a monopod, just because of the extra few seconds it takes to be ready to shoot.Image quality is as I expected. I have had none of the reported focus problems with some of the early production-run cameras.  Hopefully those have been ironed out; in any case, my camera focuses perfectly.  The only focus problem is manual focus, and the problem is my eyesight--not quite good enough, I'm afraid.  Not the fault of the camera.I bought a relatively  cheap terabyte external drive to deal with the big image files.  They do slow down post-processing, but again, that's not the fault of the camera.So all in all, after a month of use, I am pretty happy with this camera. It meets my expectations, and more.", "Date": "August 8, 2012"}, {"Title": "Great camera", "Author": "Ilya P.", "ReviewID": "R3JOYSGIPETZB9", "Overall": "5.0", "Content": "I'm an advanced amateur photog. Had a D7000 for a bit over a year before getting my pre-ordered D800e. As you can guess I waited over 4 month to receive my pre-order. I take comfort in the fact that I placed my pre-order during Amazon's 5% off lightning deal.There are a lot of reviews claiming that D800/D800e are not for beginners/amateurs but I don't see how a D7000 is good for beginners and a D800e isn't while they have almost identical pixel size and require exactly the same shooting technique in order to achieve best results. What will those reviewers say about the 24mp crop sensor in the D3200? Does one have to be a seasoned professional to shoot with such tiny pixels? I guess not because D3200 is an entry level model.I have been shooting strictly with primes since I got into photography, this helps take advantage of the high resolution/pixel-density sensors such as the ones in D800e and D7000. Even though the pixel size is almost the same as D7000 I find the images from D800e overall to be sharper than the ones from D7000 when viewed @ pixel level, probably due to the lack/cancellation of the AA filter.I do not have any problems with the left-most focus point.So far I have seen only one shot with moire among the hundreds of shots I took with the D800e. It appeared on a synthetic fabric with a rather coarse pattern, on the other had I have well over a hundred captures with all kinds of fabrics in them and no moire.I also think this might be one of the last full-frame pro bodies to employ an SLR mechanism. Because at such high resolution when combined with low shutter speeds of slower than 1/100, the mirror-slap does affect image sharpness. There are ways to avoid mirror-slap like using live-view mode, using MUP mode or shooting faster than 1/100 while using the viewfinder, etc. This makes me believe that companies are going to stop utilizing the SLR mechanism in full-frame bodies pretty soon (Sony already did) especially when EVF's and live-view displays are getting better every year, there's also SLT which solves this issue. In the D7000 mirror-slap was less significant because the mirror is smaller in a crop body.Had to upgrade to LR4 in order to process the RAW (NEF) files, which are pretty big. Raided SSD drives sure help when processing such large amounts of data.The AF is fast and accurate. Dynamic range is awesome as the dxomark's score indicates. The grip is the best I have had the pleasure of holding on a digital Nikon body which obviously is a personal preference. ISO performance is excellent at ISO 50-400, very good up to 3200 with 6400 still usable IMHO. Overall I am very happy with this camera.", "Date": "July 27, 2012"}, {"Title": "Finally Critical Sharpness!", "Author": "Puma-Concolor", "ReviewID": "R2M07DM3SDNFRO", "Overall": "5.0", "Content": "I am very happy with the d800e. I am a nature photographer & have always been bothered by the sharpness of digital cameras at the critical pixel level.  The d800e seems to be the answer to my annoyance. I have seen both MOIRE and false color in images so far, surprisingly little but you will run into it with this camera. I am very happy with the amount of cropping/zooming possible while still producing sharp images. Quiet mode does not seem to be any quieter than the normal mode. My d7000 quiet mode is considerably quieter. With such high quality images good as well as poor photos are greatly accentuated. High quality lenses are a necessity with this camera. Check my website to find photos taken with my d800e - EyeInTheWild.com", "Date": "July 6, 2012"}, {"Title": "Moire? Nope! D800E Is Fantastic! Yes, The Greatness Is Here! Nikon Delivers!", "Author": "Faymus Media", "ReviewID": "REWTWKW92JUYM", "Overall": "5.0", "Content": "First off, many people were flooding Nikon, and photography forums speculating Moire issues with the D800E.Well I have been shooting on this camera for over a month and I have filmed a wedding and taken over 4,000 pictures and guess now many pictures had moire? Zero, Zilch, Nada!Moire in video? No different than the 7D or 5D mark 2. In fact quite a bit better.I have the D800 also, the D800E is slightly sharper in most situations, images are stunning.I did direct comparisons to the 5D Mark 3 and the D800/E is built stronger and feels tougher.D800/E pulls shadows like nobody's business! I can achieve HDR images with just one shot most times! In camera HDR is pretty nice as well. 9 bracketing photos holy crap!!If you take pictures on good nikkor glass like the 24-70mm 2.8 you will be amazed! I have taken pictures @ f/11 and they are so sharp and vivid it's almost unreal!I can take a photo of somebody's face and underexpose so that I can't see their shirt or the background and I can go into Lightroom or Capture NX2 and bring it all back with almost no noise at all!For video, just wow! Tack sharp videos! Use picture control flat_10 or flat_11 and the dynamic range is great!!Video grades very well. It juts holds up so much better than any Canon I have ever used(10 years shooting canon 7D, 5D mk2, 1D mk4).File size is smaller than most which is another plus. Clean HDMI is 1080p fantastic!!Pros: Absolutely everything, amazing camera and amazing performance!Cons: Still thinking....CoreyFaymus Mediafaymusmedia.com(888)864-1370", "Date": "January 23, 2013"}, {"Title": "OMG, what a fantastic camera!!!", "Author": "Clifton Whittaker", "ReviewID": "R3THDCY03K8Z70", "Overall": "5.0", "Content": "This camera captures unbelievable detail, color and resolution.  The menu and the buttons are so easy to use.  I haven't seen anything this good since I quit shooting Lenhoff 4x5 with Schneider lenses several years ago.  My only regret is that it came along so late in my life.  Now I'm pushing myself to use it as much as possible.  Every time I take it out I discover more amazing details.  20x30 enlargements just blow me away with the color and resolution.  All this talk about moire is just bull crap.  I've shot all kinds of patterns and brick walls and the only time I've been able to induce moire was when shooting from the outside through a window with a screen cover on the outside and venetian blinds on the inside.  In that case I could see the moire with my natural eye before I took the picture.  If you want the absolutely best  image quality from a DSLR this is the one to get.  Yes, I would recommend it to a friend but I won't.  I like having the best images in our gallery and I don't want to create more competition.", "Date": "April 19, 2013"}, {"Title": "Image Quality Heaven", "Author": "Rex V. Polito", "ReviewID": "R2X3AGY0CEI89E", "Overall": "5.0", "Content": "I've been shooting with two D90's for the past years and I'm glad I finally jumped into the realm of full frame dslr with the D800E. I have also invested on several pro grade FX lenses while I was still shooting with DX bodies in preparation for this FX body purchase. Like with any other camera, using the best glass is essential to fully realize the camera's image quality potential. This is so true with the D800E with the amount of detail the sensor captures. You've read the specs, features and reviews. It's really that good. If you're still doubtful or hesitaing, rent it out for a weekend. I'm sure you would have a hard time putting this camera down. I haven't had any focussing issues or any form of functional complaints with my copy. I also bought an MB-D12 batery grip to go with this baby because I do a lot of portraits. Be aware of the media size, transfer rate, storage, softwares and computer requirements which you would need to handle 36.3 MP RAW files within your workflow. I have to mention this because there was definitely a slow down in my post-processing work flow when I first went through my first RAW file test shots. All in all the D800E is totally worth the wait and money spent. I absolutely recommend it to anyone who is serious about photography and to those who need to upgrade to a full frame body which has arguably the best image quality to date.", "Date": "July 10, 2012"}, {"Title": "Awesome resolution and built like a tank!", "Author": "Christopher R. Elwell \"Tunesdaddy\"", "ReviewID": "R3SV0312V80USN", "Overall": "5.0", "Content": "You can find the specs on this camera all over the internet, but I'm here to tell you how well it's built. While riding my bike with this guy attached to my Cotton Carrier I decided to do something stupid, which threw me over my handle bars and into the bike path pavement below! It was a hard fall. After checking to see if all my body parts were still intact I checked the camera expecting something to be broken because I landed on it hard enough to knock the wind out of me. To my surprise and delight there were only a few minor gouges, but nothing broken! Amazing! So, bottom line, great camera for high res pics, and it can take a lickin' and keep on clickin'!", "Date": "April 17, 2014"}, {"Title": "Serious camera for serious photographers", "Author": "W. Buckles", "ReviewID": "R10EDCSZ4XXNB2", "Overall": "5.0", "Content": "I purchased my D800E in August of 2012 from another vendor (my Amazon order was delayed 3-4 months and I got impatient - sorry, Amazon...).  It replaced a D700 which had replaced a D300S which had replaced a D200 which had replaced a D100 which had replaced an F5 (my last film camera).I have been shooting digital for a little over ten years now and, with the D700 and D800E have finally arrived at a point where I no longer miss anything about film cameras.  The key improvement in the most recent pair is the ability to do low light long exposure photography without significant thermal noise effects.  At one time I did a lot of night/low light work in film but had to give it up when I first moved to digital - low light exposures over a few seconds were just RGB stipples, no image apparent.  Sensor and processing improvements over ten years have brought this under control.Most of my work is outdoor; of this about 80% is landscape with the rest birds and animals.  The extreme sharpness of the D800E is especially evident in bird photography - I have done a series of hummingbird images using a tripod and a Nikkor 28-300mm f/3.5-5.6G ED VR lens along with a Nikon remote release.  The 36 MP image full-frame sensor allows me keep a good distance between the camera and the subject.  I can crop out 75% of the image and still get an 8 x 10 print where each feather shows up.  Landscapes come across razor sharp.  I do a lot of roadsides, fence lines and other 'vanishing point' work where maximum depth of field and exact focus make or break an image.  The D800E blows my older Nikons away in this category: every blade of grass and pebble on the ground is perfect from foreground to far background, giving the scenes a incredible realism.  I also do quite a bit of panoramic work and the D800E can take larger 'bites' of a scene while keeping the same overall resolution.See [...] for some of my recent (and older) work.All my images are in .NEF format.  I use the Adobe CS6 RAW processor and I have not yet had problems with moire, although some test images I did of a window screen showed how this can be a problem.If you are looking for a serious DSLR the D800E is a good choice.  The main drawback is size - it is a large, heavy piece of equipment, especially when mated to a big lens and an external grip/battery holder.  I often look longingly at the Leica rangefinder line but, besides the D800E body, I have $10,000 invested in Nikon lenses, flash units and other bits and pieces and a switch now would set me back at least that amount even considering the trade-in value of my Nikon gear.  So, for the foreseeable future it's Nikon for me - and no regrets.", "Date": "January 8, 2013"}, {"Title": "Three practical thoughts on D800e learning, 36MB & left focus issue", "Author": "consul10t", "ReviewID": "R34K1QOXK7YXCJ", "Overall": "5.0", "Content": "Background: It seems to me that the D800 & D800e have been discussed in almost every way imaginable. I'll try to avoid well-trodden ground and add a few new thoughts. I'm an advanced amateur in photography, with my work balanced pretty evenly between studio photography of people and low-light landscapes/architecture. I've had my D800e for two months now and in that time I haven't seen any moire, however I haven't shot any bridal gowns or silk kimonos. What I have seen is staggering clarity when the camera is either tripod mounted or handheld at fast shutter speeds, so having chosen the \"e\" gives me confidence that my shots are as sharp as technically possible. I also own a D700 and a D300.1) Learning: If you're not a pro with plenty of experience, before you consider buying this camera take photography classes from a pro for a year or more. Getting the best from this camera requires more than just a passing knowledge or limited experience in handling a DSLR. In my opinion, it shouldn't be anyone's first DSLR - that should likely be a D7000 (but buy only FX lenses for it, looking to the future). A rule of thumb to consider - Spend at least 20% of what your camera gear costs on classes and learning.2) 36MB: The sensor density has allowed me to chuck all my zooms over to my D700 and D300 and use my much better prime lenses exclusively. Why? Because when I can't frame things well by moving back and forth, there's still plenty of picture left for a good size print after serious cropping - just use one size wider lens for the shot. That perfect corner of a shot that I spot in post-processing is now clear enough by itself to print at 13x19. I've gotten spoiled by the D800e with all that I can do with low light and depth of field using f1.4 primes (24mm, 50mm & 85mm) and f2.8 macros (105mm & Sigma 150mm).3) Left focus issue: I drove myself nuts with this trying to get a repeatable test set up to see if my camera had the problem or not. Turns out my D800e is fine. I wasted untold hours testing until I bit the bullet and did it right (google: FoCal Pro Reikan - highly recommended). Now I'm certain of the integrity of the camera and all of my lenses are focus fine-tuned as well.", "Date": "July 24, 2012"}, {"Title": "Finally ...", "Author": "MaKNetRover", "ReviewID": "R36QFWTDEGGFI5", "Overall": "5.0", "Content": "After returning three bodies (2 D800, 1 D800E) back for AF issue, finally got a D800E from the current batch. This one (from Crutchfield though) is doing great across all AF points. Yet to get it through a complete run on Focal, still I can see it passing with flying colors :)", "Date": "October 5, 2012"}, {"Title": "In the realm of the superlative -", "Author": "Lux Occultus \"Lux\"", "ReviewID": "R1P89IBUDUB408", "Overall": "5.0", "Content": "This camera has changed the way that I see the world.  I love this camera more than I loved my dog Rex, my first wife, and possibly even my second grade teacher (possibly).The 800e is an extraordinary piece of engineering and is an image making machine.  It is ok with my film-era Nikon glass.  But it is out of control wonderful with the 85 1.4 (also purchased through Amazon).This camera has made me shoot more carefully and be less willing to spend time in trying to correct images for clients.  In fact the last few jobs I have been able to pass images over to the client for their retouchers to work on.Is this better than my old Canon gear?  Yes (But so is my iPhone).  Is the D800e better than whatever?  Possibly.  I don't really know.  I do know that until I can afford a Mamiya with an 80MP back, this is going to be a money making machine for me.  Funny thing.. just now I don't even want something that precious to work with.  My companion camera might be a D4.The 800e allows me to get exactly the results I expect to get when acquiring visual data in a way which was never possible when shooting 4x5 or 8x10.  There is no going back after using this precision machine.", "Date": "November 2, 2013"}, {"Title": "Hot Camera but don't get slapped by the mirror on the way out the door", "Author": "J. Blaha, Jr", "ReviewID": "R1EXNV0VM49BD1", "Overall": "4.0", "Content": "When used correctly, the images are breath-taking and fully-detailed at 36MP on the D800e.  When I say used correctly, that would be on a heavy tripod, with exposure delay, using mirror lock-up or using the LiveView mode to prevent the mirror from being moved.  The shots do deliver on the detail that you are expecting and can be tack sharp.  It's a very nice to see that Nikon added the menu option for Vingette Control, to add brightness back in to the edges of the frame, which naturally darken due to the lens vignetting or losing light at the edges of the frame.The mirror vibration or my lack of high MP technique is starting to bother me a little.  I was driving around as a passenger in downtown San Francisco today in hopes of trying out the on-the-move shots from an open vehicle window while on urban safari.  It quickly became apparent that a very large number of shots had some amount of vibration/blurring in them when zooming in to pixel level, even shots at 1/1000th of a second!  I really don't think it was the vehicle's movement or VR reduction, but more due to vibration created internally when the mirror slaps the roof of the pentaprism focusing screen, as it tries to squeeze out four shots per second.  The D800 body is lighter than the professional D3/D4 series and the mirror is larger and heavier than a DX mirror, so it's likely that the mirror has more mass and inertia that needs to be absorbed by the body and CMOS sensor in the form of vibration, as it quickly flicks up and down.  This is confirmed by Nikon's own rather hidden technical guide on shooting with the D800e, which can be found by doing a Google search for D800_TechnicalGuide_En.pdf(...)In this guide, they are quoted as saying \"At the high resolutions offered by the D800/D800E, even the slap of the mirror can sometimes be enough to blur the photographs.\"  They go on to say that \"Live view can be used to improve focus and prevent blur\", so in essence, if I want the best detail, I need to shoot everything with LiveView, which sort of negates having a DSLR with a beautiful and bright optical viewfinder or the ability to quickly run around at a wedding and grab high resolution candid shots.  I'm still experimenting, but my gut feeling is that if you were to compare a 16MP DX crop from the center of the D800e frame versus the 16MP D7000 DX at very slow shutter speeds, that the D7000 would have less blur from mirror slap.  This would be a fair comparison on quality as both bodies have nearly identical image size in DX with a similar number of pixels.I do love using this camera when the shots come out sharp, because it feels just great to see all of that glorious detail in something that can be printed poster-sized.  The automatic white balance in absolutely amazing in low light conditions, as I shot landscape under a full-moon with long exposure the other night, and it looked like the shot was taken during daylight, complete with the blue sky with stars visible and white clouds, which made for a nice wow factor.If you're getting this camera to do serious landscape/still life, consider checking out the free stitching software and play around with whatever camera you may currently own.  Using a tripod with the D7000 in portrait orientation, I was able to quickly whip out a 70MP seamless nature shot with more detail and at one-third the cost of a D800e. (For stitching, don't forget to use white balance preset and lock exposure for all shots to be stitched.)My last gripe is that the colors do seem a little muted in the reds, even in Vivid color mode.  My previous D300 would blow out any orange/red colors way too much when they took up most of the shot, and I'm guessing that Nikon throttled back on the reds/oranges in the D800 to prevent something similar.  This last issue is a bit hard to explain without showing you sample images as this could always be corrected in post-processing with Photoshop to get the right balance if you need more color.  Also of note is that the default contrast in Vivid mode seems higher on the D800e when set to identical modes versus other Nikon Digital bodies, where shadows look more black and dark detail seems a little lost.  This can probably be fixed with the use of Nikon D-lighting option turned on.As for the choice of D800 vs D800e, I have yet to find any moire patterns in the shots with D800e.  An ever so slight sharpening on the D800 photos will yield nearly identical shots as the D800e, so hang in there if you're still waiting more than 3 months to take delivery on your new camera and either model will be just fine, as my friend at work has the D800 and sharpness seems the same.  If you're looking for cheap megapixels to get closer to medium format photography, don't forget to look at the newly released D3200 with 24 MP at a much, much lower cost.I was surprised to find a few local shops that could get a D800 body in less than two weeks, compared with the larger online-shops that still hadn't delivered to customers who had been waiting more than three months, so support your local authorized Nikon camera shops and put your name on their waiting list, if you're in a hurry to own one.Happy Shooting.", "Date": "June 10, 2012"}, {"Title": "Perfect Nikon D800E", "Author": "P. VUONG", "ReviewID": "R7VNCHMQ2AJ18", "Overall": "5.0", "Content": "I have been paying attention to the Nikon D800x and read a lot reviews since they were released. I'm patiently waiting until now; all the bugs of the D800x have been solved. Couple weeks ago, I ordered a D800E with two hundred dollars discount promotion, after 2days tested the entire focus problem, and other... mine camera is clean.The HDR, the colors and the auto ISO can be used with flash same as my Fuji X100. After play around in a week, I decide to sell my D700. The Nikon D800E will stay with me for a long time... because the best camera that I never own before... pretty impressed.", "Date": "February 3, 2013"}, {"Title": "Focusing Issues Make This Camera a Piece of Junk!", "Author": "R. Snyder \"whatsthedeal\"", "ReviewID": "RPRSLQCRENTB3", "Overall": "1.0", "Content": "I have had this camera for some time & had to deal with a lot of “soft” images.  I purchased the D800”E” because it was supposed to produce tack-sharp images.  I nearly always use a tripod and the timer for perfectly focused images.I muddled through and used Adobe Photoshop and other programs to sharpen the images. Occasionally, I would get a nice, properly focused image right from the start.  I didn’t know what was causing the problem and just assumed that the camera wasn’t as good as described or rated.  I went through the “Auto Focus Fine-Tuning” process with each lens with little or no improvement.Last week 12/26/13, I was considering buying new lenses because I thought the problem must be with my lenses.  As I was searching the internet for answers, I came across this article: [...]  .  My camera falls in the serial number range listed (300xxxx).  These cameras have both a focusing and viewfinder alignment issues. I am simply FURIOUS that Nikon didn’t recall this product after finding out about the focusing issues.  I went through the tests outlined on the websites relating to this issue.  If focusing through the viewfinder, the images are out of focus.  If focusing through the “Live View” screen, the images are tack sharp.  Shame on you NIKON!!!I have contacted Nikon to get a repair/replacement and they are giving me the run around - acting like I don’t know how to use the diopter or something…  I have now sent sample images and are waiting for a reply.  I’m sure they will make me pay for the repair!", "Date": "December 29, 2013"}, {"Title": "Better than D800 and no issues", "Author": "Vi S.", "ReviewID": "R1NUY48FX9Q6T9", "Overall": "5.0", "Content": "I replaced my old D800 (an early production sample with left focus points issues) with this D800E. The resolution and contrast are slightly but noticeably better than D800 and there are no focus issues or any other issues so far. For bird photography moire is not a problem. The chances of moire are small to begin with and besides, a supertelephoto+teleconverter causes just enough tiny blur to reduce moire further - this is equivalent to other anti-moire measures like using AA filters, smaller aperture, etc.Also, before this purchase I had some reservations about buying an expensive camera from Amazon rather than a specialized camera store. The camera looks absolutely new. It has, as far as I know, a recent serial number - 3014xxx. It came with zero shots on it (just to make sure - I get this info from the Exif file and not from the number in the file name) and a clean sensor. I considered D4 for speed, but it lacks the reach when you need one and with practice I could shoot birds in flight with D800.There is one negative thing that I noticed in both D800 and D800E when shooting telephotos at 300mm and higher, and with VR ON. At shutter speeds below a particular speed (e.g. starting at 1/100s on 28-300mm at 300mm), the images become blurry in a rather specific way - the blur appears as a double image with about 5-pixels separation in vertical direction (you do really need to pixel-peep here to see the details of the blur). No technique can prevent this from happening, even the tripod (unless you mount the camera rather than the lens foot on the tripod head - an impossibility for super telephoto). I think that this might be due to shutter-induced shake. Nikon said that this is within specifications. By the way, with VR OFF, the blur is different and it varies with the shutter speed like what you would expect. I surely do not like the behavior in VR ON mode but I can live with this. After all no camera is ever perfect.Update: mirror mechanism broke after about 20K actuations.", "Date": "October 14, 2013"}, {"Title": "Awesome", "Author": "Al Braddock", "ReviewID": "R1JZAY924TEONQ", "Overall": "5.0", "Content": "I have a D800e that is an early production model I received the first week of the cameras release in 2012. It is the best camera I've ever owned. I've never had left focus issues. One thing I like about the camera is the auto wb setting. It usually nails the correct wb the first time. It is much better than the d700's auto wb. If I was debating between the 800 and 800e I would buy the 800e without question. The 800 is almost identical but I've never seen any problematic moire with the 800e. I shoot at least 1/250 sec if I'm handholding and haven't had a camera shake problem either. Great camera.", "Date": "September 16, 2013"}, {"Title": "Amazing Performance", "Author": "Andrew Mills", "ReviewID": "R3JMIDV9MOIJZB", "Overall": "5.0", "Content": "I have had my D800E for six months and it's nothing short of amazing.  It's everything you'd expect from a flagship professional camera designed for the detail-oriented, studio/landscape type photographer.  I got mine for macro and landscapes, though it's more than capable outside its niche when other subjects present themselves.If you're a \"get it right in the camera\" kind of shooter, you'll love it.  It's definitely a perfectionist's camera at heart.  On the other hand, the massive resolution and dynamic range give you incredible amounts of data to work with in post, so if the shot is hard to get in camera, you can often rebuild it from the data this camera delivers in RAW files.  This will make purists cringe, but you can crop to 10% of the original and fix multiple stops of exposure error and still have web-ready images or better.The only downside I've found to this camera is a result of its strength:  The amazing resolution and sharpness from the sensor means you can see every mistake you make (focus, camera shake, distracting elements), and you can really tell the difference between decent and good lenses.  Get ready to spend for the best pro-grade glass if you want to get the most out of this beast.  Presumably, if you're buying a D800E, you're already on board with this idea.I suppose there is one other downside.  I find all of my non-D800E shots disappointing now.  \"That's not *really* sharp.\"  \"Is that noise?  Why is there noise in my image?\"  \"So what if the bear was 100 yards away, you can just zoom in and see... oh... never mind ...I didn't take that with the D800E.\"  \"Where did all the detail in the sky and shadows go?  Why can't I get it back?\"When Nikon's D800 ad said \"Sorry, but you're going to want to reshoot everything you've ever shot,\" they weren't kidding.", "Date": "August 10, 2013"}, {"Title": "From a D200 to a D800e", "Author": "Brian J. Mcmahon", "ReviewID": "R2ZQPHZ4WC4W73", "Overall": "5.0", "Content": "I've been shooting with a D200 since 2007. I have three lenses I use primarily, a Sigma 10-20 super wide angle for some indoor or close quarters shots, a 18-200mm Nikon VRII as a general purpose zoom, and a 50mm (1.8) prime. I don't yet have an FX lens yet, I got this camera from my wife for Christmas.**EDIT**I ended up buying the superb Sigma 35mm 1.4: Sigma 340306 35mm Nikon BlackEverything below stills holds true, however, I have not changed the lens since I put the 35mm on the camera. The D800e is so good with this lens that I am loathe to carry anything else. I will probably buy a telephoto and a macro at some point, but the lens and camera captures so much detail that in most situations I can crop from a scene and get an effective zoom. Take a shot of an object a few feet away and you can crop out an incredible amount of detail as if you took a macro shot. This camera and lens combination is just incredible and easy to use. The only downside is the weight; it's like a dumbbell hanging from your neck.********I have been using the 50mm prime lens and I love the results so far. A couple of things I notice different from the D200:1. No hot pixels. For such a large sensor, I assume there must be some in there. I don't know what the engineers have done, but shooting jpegs in many conditions haven't produced the hot pixels that I would see and correct regularly with the D200. With RAW images on the D200, the hot pixels were far less noticable, owing to the lack of compression. All I can say is that the data processing in the D800e is superb in this regard, I'm looking forward to never having to send my camera in to have bad pixels mapped out again.2. I shot pictures of my Rhodesian Ridgebacks in a variety of lighting conditions both indoor and outdoor, in some cases, moire' is evident (mainly outdoor sun lit). I have to view at 1:1 to see it, but there is false color (both magenta and green) in some areas of their fur coats. It is not overwhelming, and I'm sure some post processing adjustments will make it nearly impossible to detect.3. The sharpness is very good. The trade off between moire' and sharpness is there. I'll take the sharpness. I look at some of the shots at 1:1 and I'm just amazed at the sharpness. In a few head shots, I zoom in on one of my dogs eyes and I can see myself and the camera. Wiskers so sharp you can almost feel them. If you don't want to deal with post processing, you probably wouldn't be buying a camera like this one in the first place. Since you're even looking at this, I'd say the trade off is worth it. That's coming from an amature used to a D200.4. There is some fluff in the funtionality. They added stuff like an HDR mode. It sounds interesting, but once you read the details, you are left wondering why they bothered. There are many other settings or options that I can't imagine ever using, many are in-camera editing/processing functions like the HDR mode. The video recording seems like fluff to me, but on a tripod with ideal conditions and an external mic, it might be useful.5. They are some great features I've never had before. I like the ability to store RAW on the CF card and jpegs on the SD card. The auto-focus system worked great for me out of the box. I've read all sort of horror stories, but I've had no trouble with extreme left or right focus point or any other focus points I selected. On the other hand, I haven't played around with continuous focus much since I got the camera. So far, focus has been very fast and accurate, though in some lighting conditions I have had the camera hunt a bit.All in all, I highly recommend this camera to amature photographers looking for an upgrade from something older. There is nothing to fear here, maybe slightly more post processing for best results, but that is all.", "Date": "January 2, 2013"}, {"Title": "Stunning pictures! (thoughts from a former D300s owner)", "Author": "Anonymous", "ReviewID": "R8S0T6I0DEVV7", "Overall": "5.0", "Content": "This camera is phenomenal! The pictures it takes are so rich and crisp!I recently upgraded from my trusty D300s, and I've been thrilled with my new toy. The controls are quite similar. (I do miss having the quick autofocus mode switch to the right of the monitor, but the dedicated bracket button is a nice addition.) The camera feels similarly-sized in your hand (perhaps slightly taller). But the pictures... oh the pictures!I know that in terms of factors that determine picture quality, the camera body ranks a distant third behind the photographer and the lens, but I'm continually amazed by the photos this camera takes (even with same old me and my same old lenses -- like the Nikon 28-300). The color looks so rich (despite the same color space, d-lighting, etc. settings), and the images are so crisp, even when viewed at computer-screen sized (which is well below image resolution). It really is unbelievable!A few other observations, in case you're considering making the same move I did:- For active shots (e.g., wildlife): The burst mode is slightly slower than the D300s (about 4-5 shots/sec vs. 7-8 shots/sec), however for me the higher resolution more than makes up for it. Why? Composition is much more forgiving! Being able to crop down to as little as a 1/3 of the original frame and still be left with a ~11 MP image gives me a lot more forgiveness in my subject-tracking than an extra 2-3 frames per second would.- Similarly, it's true that you lose the extra reach that comes from the DX's 1.5x focal length multiplier. However, because the sensor resolution is more than 1.5x the D300s's, you're not losing any information in your shots. In other words, you can still crop down to the same shot you would have taken with the DX camera. The difference is that the D800E's got your back by capturing an extra ~1/4-frame margin in each direction, just in case you weren't perfect in your composition. Neat! In fact, you can configure the function button to switch your crop factor on the fly, so you can shoot DX when you need the reach and are confident about your composition, and FX when you aren't.- At the wide end, the bad news is that your beloved DX wide angle lenses (such as the *wonderful* Tokina 11-16) can't take advantage of the full FX sensor... Yes it can auto-detect DX lenses (only Nikon brand, in my experience) and offer you a consolatory DX-sized black box in the viewfinder, but you'll find yourself lusting after a big and pricey 14-24 quickly. Sorry, man.- One other downside is the file size for D800 pictures: lossless-compressed 14-bit RAWs take up 20-45mb each (depending on the complexity of the image). Can I interest you in a couple of 64MB memory cards... and an external drive to hold your ever-growing Aperture library? Oh well...- Finally there's the cost. That's between you and your conscience, but if you take the plunge, I'd encourage you to look into some camera insurance before you put a $4k+ camera-and-lens around your neck. Make sure to find a policy that covers both theft and water damage -- such as DAN gear insurance (designed for scuba divers). It's typical to pay 2-4% of replacement cost per year.Bottom line: this is a stellar camera. If you can afford it (plus the new accessories you'll need along the side), you won't regret it!", "Date": "December 23, 2012"}, {"Title": "Technical magic in your hand", "Author": "BLeaver", "ReviewID": "R3HQ3M4QQIQDFP", "Overall": "5.0", "Content": "The camera is incredible in every way that I can imagine. Already, too many of the D800E's have been sold, too many people will be capturing images that are phenomenal. I would much prefer that I were the only one with access to such an instrument.  (Update:  :o)  )Digitally, I started with a D100, then a D2X, then a really great D700. The D700 could do nearly everything I wanted in a camera but the images lacked the resolution I desired. The D800E resolves the resolution issue and is just plain awesome to use. Aside from the resolution, the dynamic range of the images is, I believe, the most significant improvement to image quality. Shadows have more detail, but more noticeable is the increase in tonal range of the mid-range and highs.Many others have already written about the useability of the many features, so I won't repeat (with one exception), except to say that the D800E is a total pleasure to use. I would like to mention the addition of the Viewfinder Virtual Horizon that I programed to the front Fn button - it is extremely well thought out and very useful, providing both a left to right (horizontal) level as well as front to back (vertical) level, and it stays on until you press the button again or turn the camera off. The indicators for this feature are small and on the inside of the frame view, along the bottom and right sides - not obtrusive at all.If you have ever felt that your earlier equipment was a limiting factor to the images you were capturing, then get a D800 or D800E - the limiting factor will now be you.UPDATE 12/31/2012: My general opinion of the D800E remains unchanged - it is really incredible. I have not experienced any images with a moire pattern.  I hand hold more often than not and find that soft images are really easy to get (that's a joke), but if I shoot at roughly twice the speed as the focal length suggests (example: lens focal length = 300mm, speed then = 1/600 sec) - nearly every image is crystal sharp (this is relative to stationary subjects).  Moving subjects still require the same higher speeds that my other cameras needed.The only negative that I can think of is autofocus, in continuous mode, the focus will often hunt back and forth - this may be my fault due to camera movement but it is not an issue for me with my D700, so I'm still working on this problem.", "Date": "October 25, 2012"}, {"Title": "D is for Dinosaur? Not a significant improvement over D700. And maybe my last DSLR.", "Author": "Doctor.Generosity", "ReviewID": "R1TFF0GSISHCS3", "Overall": "3.0", "Content": "As a fan of Nikon SLR for almost 50 years, I am accustomed to ordering the latest and greatest without much thinking about it, and so I ordered the D800E. I had sold my D700 - which I and many others considered the best camera ever - a bit prematurely and had a long wait for its replacement. D800E is a highly developed piece of hardware with unlimited capabilities. After a few weeks with it however, I am having doubts whether I made the right choice. Or should I say, whether Nikon is making the right choices for handheld still photographers. D800E is not what I expected as an update to D700.Let's begin with 36MP. This sounds at first like an advance over the very popular 12MP D700. Unfortunately some testing shows it is not, and here's why. At shutter speeds slower than 1/500, it is impossible to capture real image detail at this resolution in the presence of the slightest mechanical vibration. At 7,360 horizontal pixels, any jitter, even mirror slap, that fluctuates the aimpoint of your camera during the exposure by the equivalent of 1/3 inch at a hundred yards (0.3 minute of arc) will smear out your finest pixel - and you might just as well be working with 18MP, or 12MP, or less. More pixels will not translate into more actual detail if the limit is mechanical stability. Nikon realized that 36MP is overkill for handheld photography and this is why, in their Technology Guide, advises that using a tripod or even locking up the mirror is necessary to achieve the full resolution - hardly in the spirit of classic 35 mm photography. Vibration Reduction is also pretty much required here, but such is available only on a handful of FX lenses. For handheld photography, 36MP is overkill. No one will ever put out a 100MP camera - it would be pointless. The full potential of 36MP is only realized as a studio or landscape camera bolted firmly to a heavy tripod. Considering that Nikon optimized for MP instead of high ISO, and since the movie capabilities are not important for me, I am not sure what I gained over the D700.OK then, if I need sensivitity more than pixels, can I at least choose to downsample to S format (about 9MP) and expect superior high ISO? I tried it, and the answer unfortunately is: no. L format and S format pix look exactly the same except for resolution. There are two ways to downsample to reduce pixel count; the first averages a group of pixels - this method will reduce the noise. But Nikon does it the second way, which requires less processing, wherein the S version simply omits certain rows and columns of the full image. This simply throws away information with no benefit in signal-to-noise.Why did Nikon change the philosophy which had attracted a wide customer base for D700, reducing the high sensitivity pixel pitch of 8.5µm down to a miserly 4.9µm for D800? It seems this was a marketing ploy and not a photographic decision; little more than one-upping their archrival Canon in advertised specs. Like many tunnel-vision corporations before them, Nikon seems obsessed by their short term death struggle with Canon while failing to recognize the bigger handwriting on the wall, the rise of mirrorless cameras such as Sony NEX and Fujifilm XPro1. These are emerging as a genuine alternative to DSLR for high image quality, even full frameLast weekend I had the opportunity to get all three in one room and compare the D800E directly for image quality. I chose an overcast day, set up an outdoor still-life, used a tripod, set all three at ISO 800 and JPEG's. Of course D800E has the highest pixel resolution (36MP vs 16MP) but if you don't magnify enough to see that, the other measures of image quality (noise, dynamic range, contrast, color) under good light were beautifully rendered in all three. D800 images may be a bit better upon close inspection. But they certainly weren't five times better photographically than cameras that may cost a fifth as much and weigh a fifth as much.I wish Nikon had made more imaginative design decisions for D800 to meet these challenges for users like me. Instead of pumping up MP and adding movies, they could have reversed priorities. I would have much preferred if the D800 had used their D4 sensor with 16MP and ISO up to 100,000, which would allow me to take more unusual pictures and have more latitude in aperture and shutter speed. They could have attempted to cut the weight of the FX package by half (there is a rumor of a D600 in the works which may be less massive). Fewer pixels would have enhanced colors and dynamic range and contrast, the non-MP ingredients of meaningful image quality. What about a wireless download to replace all the strange cables? And they could have done something about the clunky Nikon software, the endless menus, the whole unwieldy architecture of controlling a complex instrument. How about a simpified interface I could perhaps set up and save on my computer instead of only on the camera, and open the operating system to third party apps, similar to the iPhone? I am disappointed in Nikon for caving in to the megapixel race just to puff a number. Steve Jobs once said that when the marketing people with their short term incentives take over a corporation from the product engineers, it is doomed to go down.SLR is on the ropes. The advantage of SLR for the past forty years had been the superior accuracy of viewfinder, framing, and focus. For this, photographers were willing to accept tradeoffs, such as the bulk and lesser optical quality which could be obtained from wide angle lens designs fitting the long distance between glass and film. SLR is still the best viewfinder today but the electronic display, which sees what the lens sees without a mirror by using the signals from the digital sensor, is on a path to catch up. And mirrorless brings compactness and superior optics. At the moment, available electronic viewfinders (in addition to the Fuji XPro, I have also tested the NEX 7) remain far inferior to an SLR view, more like comparing the screen of a tiny flickering television to looking out the window. But this will improve and DSLR seems on a path to obselescence. DSLR is no longer the only way to get fast shutter response either. I am not the first to say this; Trey Ratliff, who has an influential blog and teaches HDR photography, has written the same thing.So far Nikon's response to mirrorless has been off the mark. F-mount lenses are not a good match to compact mirrorless layouts, due to their long flange-to-sensor distance, so Nikon put out a new design, Nikon 1 with the CX mount. But the sensor they use is 1/4 the size of the DX class found in the NEX and Fuji and new Canon. Probably they did this out of corporate shortsightedness (\"let's not cannibalize our DX DSLR\"). Wrong strategy; Nikon 1 has received lukewarm reviews, and prices have just been slashed by 33% due to weak sales. In the meantime, longtime DSLR users like myself are being seduced away, and mirrorless now accounts for 50% of the Japanese domestic market. I am considering sending back my D800E and putting my most expensive VR FX lenses on eBay, recovering a large pile of money for other equipment. Maybe this is my very last DSLR? These are thoughts I would not have entertained even two years ago and I am not alone. Whereas Amazon customer reviews of D700 were overwhelmingly positive, the early reviews of D800 are decidedly mixed.D800/D800E is a mature instrument with all the bells and whistles and robust construction quality Nikon is famous for. It has every possible setting variation at one's fingertips. There are refinements such as correction of lens distortions as part of the JPG processing. In-camera HDR. A scientific or industrial tool of equal complexity but lower sales volume might easily cost $70K instead of $3K; in that sense it is a bargain. But \"mature\" is the key word: there is no sign Nikon has any real innovations up its sleeve, and D800 in its present form is at the point of diminishing returns. Unless one is a working professional, it is too big and heavy. 36MP and movies were the wrong emphasis when there are so many other areas where DSLR could be advanced. Nikon is a conservative Japanese corporation whose DNA is scientific instruments, microscopes and industrial equipment. But here they are in a rapidly evolving market more influenced by Instagram than a few extra pixels. Unfortunately, the \"D\" in DSLR is beginning to stand for Dinosaur.Here is my wish list for a new Nikon product line which could leapfrog over anything currently out there. Put out a FULL FRAME (FX) mirrorless, with a new mount and new lenses with a short flange-sensor distance plus an adapter for F-Mount to allow use of the 70 million F lenses out there. A mirrorless FX will weigh half the D800 bulk. And while you're at it, let me the user have the ability to simplify the forest of menus - make the camera programmable, including the interface. Open it to third party apps like the iPhone; can you imagine what creative designers would come up with if they were granted total control of a top quality full frame box? And please ditch the clunky buggy software you ship with the camera - but which no one uses - and find some up to date software house which can write a brand new, clean, application. As for viewfinder, don't bother with the poor tiny EVF's we have today - perhaps just supply a nice LCD with a magnifying hood to look at it close up at eye level. The whole package will be bigger than half frame mirrorless, but it will also be far better, in fact stunning, especially if they use the D4 sensor. Dear Nikon; show some boldness and spirit, just as you did in the 1950's when you led the commercialization of single lens reflex.The other choice for Nikon is to continue on their conservative path and slowly sink with the DSLR ship, as advanced amateurs and eventually pros make other choices. Over and over we have seen big companies locked into an existing product line fall behind and find themselves unable to recover; think Polaroid, Kodak, Commodore, AOL. In any case the most significant innovators in photography today are not the 'camera-heads' of the world - Canon / Pentax / Olympus / Nikon - but Apple and Android, with their always-with-me smartphones, third party apps, and wireless connectivity.Nikon could still be the ones to apply this approach to the high end of photo quality. I hope they do but I expect they will not. Yesterday I looked in my cabinet and was reminded I own a lovely Nikon F6, the best film SLR ever made. Masterful. But now, only a few years after its introduction, a museum curiosity and collector's item. The best of the breed; and the last of the breed because it refined itself on a straight path into the history books while completely different image technologies whizzed past.Note added on May 20, 2013: In the past year the introduction of the D600 Nikon has answered some of the problems of the D800E. However, the most significant recent innovation in DSLR is the Canon SL1 which weighs only 13 oz compared to D800 32 oz. They did this by repackaging the sensor chip and shutter to allow a much smaller box. In fact the SL1 is smaller and lighter than a Fujifilm XE1 and yet retains an optical through the lens viewfinder, which is still superior to any electronic viewfinder.", "Date": "July 15, 2012"}, {"Title": "Truly a professional Camera!", "Author": "Allan F.", "ReviewID": "RXRX0N9KL9TOT", "Overall": "5.0", "Content": "I love this camera! I bought the 85mm 1.4 portrait lens at the same time!  My pictures are amazing!  Buy it!", "Date": "April 15, 2014"}, {"Title": "Very Good Product", "Author": "BIKER101", "ReviewID": "RARG5X5UWHUYK", "Overall": "5.0", "Content": "My main reason to buy this camera was the video capability. I actually own a D3 but it doesn 't do video. I really like the D800E size and weight and the pictures are also very good. Need to be careful if you select fine resolution because the picture MB could be on the large size.", "Date": "March 18, 2014"}, {"Title": "Amazing upgrade from the D700", "Author": "John W. B. \"John\"", "ReviewID": "RGRHZ3XW7TLQH", "Overall": "5.0", "Content": "I was able to sell my D700 on Craigslist for quite a lot.  This is a significant upgrade and I love it.  Still learning about its flexibility.  Barely use it for HD video.", "Date": "March 1, 2014"}, {"Title": "First one Err messaging New one works great so far", "Author": "P Sandoval", "ReviewID": "R2SM9YD2FMPMAZ", "Overall": "5.0", "Content": "So I jumped at the opportunity to buy this amazing camera with the sale that just came out. First one that was sent was amazing but after only 100 pictures the camera malfunction with an err message. Tried a new battery, taking off the lens, new memory cards, reset, everything you could image and could not get it to work. Finally I contacted amazon and had a new one in a day. (Great response time Amazon.) so now the new one works great so far no issues. The camera distributes quality like no other camera. I own the D800 as well and it truly is a better camera. You can just tell the images are that much sharper using Nikon prime lens shows the best quality especially with a 85 1.4g. I absolutely love this camera and would not rate it any different because of the one flawed one that was sent.", "Date": "November 4, 2013"}, {"Title": "Nikon D800E serial number 301xxxx. EXCELLENT", "Author": "Gabriel Espinosa \"Gabriel Espinosa\"", "ReviewID": "R16UQ772JGZFMZ", "Overall": "5.0", "Content": "Ok, so we all know of the left side autofocus problem with the 800 and the 800E. I can't speak for prior shipments from their factory, but my serial starting with 301xxxx does not have the problem. The camera produced astounding images. I don't think I need to say much more than that.", "Date": "August 9, 2013"}, {"Title": "Excellent", "Author": "Tripp Harrington", "ReviewID": "RIDK348XR6JU6", "Overall": "5.0", "Content": "Beyond expectations.  Easily produce trade show graphics with the utmost quality.  Functions very well inside a studio environment.  Love it coupled with the Nikon PC-E lenses.", "Date": "January 30, 2013"}, {"Title": "I love this camera", "Author": "Opinions are like... \"Al\"", "ReviewID": "R3VG0P4CTTGK2T", "Overall": "5.0", "Content": "This is a remarkable camera. There is much discussion in all kinds of groups on the pros and cons but the reality is that this camera exceeds the skills of the people who claim to have problems. It is capable of detail beyond any other DSLR out there currently and the \"sharpness\" problems reported are due to poor technique that was not visible in other digital images. I have used them all and this is by far the best option under $20K.", "Date": "March 19, 2014"}, {"Title": "Quite possibly the last camera I will need", "Author": "J. Rutirasiri \"goldenpiggy\"", "ReviewID": "RO0TZILCIY139", "Overall": "5.0", "Content": "Not much to praise that everyone else hasn't already:1) Sharp, sharp, sharp!  3D-like image quality (with good lens) due to micro contrast and fine details.  Subjects just pop out of the picture2) Very good low light AF -- coming from a D7000, it was night and day3) Plenty fast for me4) Fantastic build quality.Gripes?  Battery lasts half as long as the D7000.  Unless you use a fast card, there will be some delay when viewing images because the files are so darn huge.  And yes, you will see moire.  Don't let it bother you.Highly recommended", "Date": "January 20, 2014"}, {"Title": "Excellent performance but oil on sensor after 150 shots!", "Author": "EK", "ReviewID": "R3E5VBS2YSXWIE", "Overall": "2.0", "Content": "I bought this camera from another site, but I wanted to include my experience here.  Camera came on 4/4/13, had one of the latest serial numbers and was a great experience for 2 days.  Performance, and image quality were excellent.  As I was considering purchasing a series of quite expensive FX lenses to enhance my 28-300 lens experience for landscape photography, today and after about 150 shots a quite visible oil spot appeared on the upper left quadrant of the sensor.  I have the experience to do a sensor cleaning myself, and even the Nikon service facility in LA is about 15' drive from my work. However, I find it unacceptable that for a $3000 camera and especially after months and months of issues (just Google \"d800 sensor oil issue\") the quality control remains substandard.  My next choice the D600, appears to be also plagued by issues of its own.  When you buy the Mercedes of dSLRs, would it be so unreasonable not to have to take it for service after 2 days for overheating?  As a matter of principle, back the D800E goes, and my quest for the optimal dSLR continues.  Please note that from a probability point of view, your D800 is likely to be fine, but the failures of QC are far from being close to zero, an unacceptable proposition for such a high end product.", "Date": "April 7, 2013"}, {"Title": "Am one happy camper !", "Author": "G. Kroll", "ReviewID": "R136ZUAAJEQXW9", "Overall": "5.0", "Content": "I ordered this D800E on 11/11/12 and it arrived on 11/13/12.  SN 3008XXX.I immediately tested for the dreaded LF issue by taking a photo of a pack of cigarettes using center point.  Text was sharp (as expected).I then tested with the left and right focus points.  I would focus on something far away and force auto focus to reaquire the target.  Both sides were sharp and appeared to be as sharp as the center when viewed on the back of the camera.  The others were soft even viewed on the camera display.When I get a chance I may set up iso charts to test further, but from my quick test I feel confident this one does not have a problem.Just wanted to pass along the SN they shipped and the date ordered in case anyone else was wondering what SN they were shipping.  I almost did not order since I wanted a 3008xxx SN or higher and considered waiting another month.  I am happy at this point that I did.If I find out the left point is soft once I set up my focus charts and my tripod, I will update this review.  At this point it is a 5 star experience and a 5 star product.Edit:  11/17/12  I am very happy with this camera thus far.  I used it to shoot a HS football Semi-State game and am impressed with how MUCH better it is than my D90.  I shot both and the D800E blows the D90 out of the water.  Images popped even at a higher ISO.  I let the camera auto ISO up to 6400 compared to my cringing at ISO 3200 on my D90.  My shutter speed was also much higher on the D800E  1/500th vs 1/200th.  I hate to jinx myself, but this one seems to be a keeper.", "Date": "November 13, 2012"}, {"Title": "D-800E body", "Author": "lightspeed2121", "ReviewID": "RJEFBB6YI5NGQ", "Overall": "5.0", "Content": "This is a  awesome camera, I have taken some great photo's with it, I have found the camera is just as easy to use as my D-7000", "Date": "November 27, 2013"}, {"Title": "The best I have used!", "Author": "Samuel Wang", "ReviewID": "R2Q7ULZ88CXN95", "Overall": "5.0", "Content": "I have used this camera for six months now and I must say I have been more than satisfied...! Beautiful pictures one after another!", "Date": "April 29, 2013"}, {"Title": "Best camera ever!", "Author": "Hank Castello \"Hank Castello\"", "ReviewID": "R1ZUKKTCM3UUEX", "Overall": "5.0", "Content": "None of the reported dust/flecks problems.  Decent low-light performance and fantastic large photos.  I wouldn't trade this camera for any other on the market.", "Date": "February 1, 2013"}, {"Title": "Love this camera", "Author": "R. Alarcon \"VERVE\"", "ReviewID": "R1TC207QVI0WAN", "Overall": "5.0", "Content": "Awesome, nothing like it out there.You will need a good computer and plenty of disk space.Everything it was meant to be.", "Date": "May 15, 2014"}, {"Title": "The camera I was expecting", "Author": "Ricardo Meneses Calza", "ReviewID": "RN71S1I87BZV0", "Overall": "5.0", "Content": "Nikon has always been a state-of-the-art brand. There is this loyalty to Nikon from us Nikonians. The quality of a full frame processor is superb, however you have to be aware of the FX and DX lens differences to take full advantage of this model.I saved 800 usd buying the refurbished model and I am happy to have done so.", "Date": "January 18, 2014"}, {"Title": "Amazing so far.", "Author": "L. payne \"Astrotech5000\"", "ReviewID": "R27MOABLMUVJCZ", "Overall": "5.0", "Content": "I have only used the camera a few times, but each time it has amazed me. I like wildlife photography and quite often my subjects are not as close as I would like them to be and the will not hold still for a long exposure. I had a D700 before this and was not able to crop the image down much because of the loss of resolution. This is a great improvement over that. Also because of the higher resolution, I can use a higher ISO without getting as much grain in the image. I also think it give more accurate colors than the D700, but that my just be a result of better detail.So far I love the camera and have taken photo that would not have been possible without it.", "Date": "November 30, 2013"}, {"Title": "Phenomenal Camera", "Author": "TBonez", "ReviewID": "R349J0Z5PM5MIM", "Overall": "5.0", "Content": "The camera's quality is amazing, resolution is remarkable.  Make sure you get great glass to go with this awesome camera - yes it will be expensive but lenses are a great investment whereas camera bodies are not.  I bought this camera going from a D200 to this D800E and it was well worth the upgrade.  I'm going to keep the D200 and use it with my new lenses as well, everything fits great and if I go shooting with a friend I can give them my D200 to use.  Looking forward to putting the D800E through it's paces.", "Date": "January 8, 2013"}, {"Title": "Amazing", "Author": "Upstate I.", "ReviewID": "R1TSQXZ4EEUNEJ", "Overall": "5.0", "Content": "The absolute best camera I have ever owned. The detail and dynamic range in the photos this thing produces is stunning.", "Date": "June 7, 2013"}, {"Title": "Amazing camera, but needs good glass", "Author": "Dan", "ReviewID": "ROBNTOWPW2QOU", "Overall": "5.0", "Content": "I am a semi-pro photographer and own a Nikon Kit consisting of a D7000 and D5100, this is my first full frame camera with Nikon and it did not disappoint.The camera feels great in the hand and is compact, yet large enough to allow for all the buttons you need for fast adjustments.IF you shoot in Automatic, this camera does not have an AUTO selection on it's menu.... there is a Programmed Auto mode and you can effectively put the camera in Auto for focusing on subjects and it's pretty much the same as Auto, almost.BUT if you shoot in Auto, do not buy this camera... it's overkill.If you're shooting in Auto buy a D600 for much less.... or better yet buy a D7100 which is an amazing camera.Also, this camera paired with Nikon glass works wonders, I just shot all weekend using my D800E, Nikon 24-70 2.8,  14-24 2.8, and my 35mm 1.4 and the pictures are outstanding.I would recommend fast glass because the camera is so sharp you want to minimize the camera shake (i.e use a higher shutter speed).ISO performance is awesome.... I shot at 1600 with very little noticeable noise and all the way to 3200 still producing usable files.The weight of the camera is a nice counterbalance to some of the heavier lenses like a 24-70 2.8 or 14-24 2.8.I love this camera and would recommend it 100%.", "Date": "May 29, 2013"}, {"Title": "Amazing piece of engineering", "Author": "Daniel Ackerman \"tuautem\"", "ReviewID": "R1IWITDV2R9V8Y", "Overall": "5.0", "Content": "At this time i didnt buy the camera at amazon (Sry, my friends!), but i wanted to give my impressions here, like old customer.Ive been working like pro photographer last 25 years. I use all the time phase one digital back with hasselblad equipment in my studio (ackerman-photo.com). I really cant believe the quality and resolution of this camera. Is like my 39Mp digital back? Nope... but almost!,Only a very close and expert look can see the difference. And at fraction of the prize!. congrats to Nikon's people for this camera!", "Date": "May 5, 2013"}, {"Title": "A CRUSE SCANNER ON YOUR HANDS", "Author": "Artist in His Studio", "ReviewID": "R2DVTBZX4YMOT9", "Overall": "5.0", "Content": "Nikon D800E is simply great invention. It is an artist's camera; and a new rival to large digital format industries. D800E is a Cruse scanner on your hands for fine arts professionals. Thanks God, it is finally here. D800E opens a completely new market for Nikon that seems heading head-to-head with Cruse scanner and the like for large and stunning digital format. This means for a fine image of a painting can no longer require a scanner that costs more than a hundred thousand dollars, as the Pentagon, the Getty Foundation, and the Vatican's Secret Archives have.I use Nikon D800E camera with Nikon 85mm f/1.4G AF-S Nikkor primarily to photograph my paintings and drawings. The lens alone is quite expensive, but for what I do is worth it. It is a lot less investment than sending paintings to a Cruse scanner studio. I shoot my works in RAW (NEF) format to absorb all fine information available before converting into TIFF or JPG. The clarity is amazing! To see samples, I have them on my site at MK Fine Arts, studio of classical realism.D800E is designed for crossed fine details captures, therefore make sure you use it with good quality and large aperture lenses. Micro and prime lenses are well-suited with this camera. Great lenses are like great brushes for your canvas. Because D800E is about seeing different levels of textures, you may need to better view the critical focus, and get either of these accessories and they are very helpful: Nikon DK-19 Rubber Eyecup and Nikon DG-2 2x Eyepiece Magnifier.Result is more important to me. I don't focus on technical and performance issues here, because there are plenty other reviews where you can find something that can address your concerns. No piece of equipment is perfect equipment. D800E is not perfect, I am sure, and it was not designed for everybody.Nikon D800E helps me capture impressive details in dark and subtle nuances works of art. This expectation is now here within reach, without getting large format scanner or transparency photo studio involved.", "Date": "February 26, 2013"}, {"Title": "STUNNING capability!", "Author": "Roger Bells", "ReviewID": "RYYL4W4O3OF6E", "Overall": "5.0", "Content": "I'm a freelance motorsports photographer and I am always amazed at the end of the day when I review my pictures.  They're so sharp and the massive FX sensor allows me to crop far more than I'd ever imagined.  Anytime I don't have enough glass to reach what I'm shooting, I know I can always frame my shot perfectly in post production.  I'd credit this camera (paired with my 400mm f2.8) with landing me a full time gig with a major publisher.  I really need a second one of these to replace my obsolete and limited D7000.", "Date": "June 30, 2013"}, {"Title": "Excellent product.", "Author": "L. Duvall", "ReviewID": "R3JCYYPQC17CBQ", "Overall": "5.0", "Content": "The color and clarity of the shots are incredible.  The 36.3 MP allow you to zoom in and crop without losing resolution.", "Date": "April 21, 2013"}, {"Title": "Nikon D800E: You run out of superlatives!", "Author": "drdvde \"drdvde\"", "ReviewID": "RIKWQEZBR4ZDJ", "Overall": "5.0", "Content": "Received my 800E (ordered 4/21) four months and three days later. You've already seen the technical reviews from the pixel peepers (not a bad thing) and it is clear that the D800E does have slightly better resolution than the D800, which MAY have no PRACTICAL advantage. I wanted to address some of the other concerns that have come up. I am upgrading from the D7000 and have shot about 300 pictures. I could detect no \"left-hand\" focussing issues with a quick and dirty photo of a $5 bill from 15 feet away with the Nikor 50 mm f1.4 lens. Hand held, you can read all the numbers on the bill regardless of left, center, or right focal point (f8 1/160 iso 200). Coming from the D7000, the controls are a little different, but sensible per the Nikon system. A major convenience seems to be single button access to the usual adjustments (iso, bkt, AF, etc). Indeed, my impression is that there are remarkable degrees of control possibilities that I have yet to learn how to exploit. Image quality is stunning and I will try to post a sunset that was tweaked only a little in Adobe Camera Raw as an example; the dynamic range also appears remarkable. I shot a picture of our Schnoodle, Sulu, that was hand held, 1/30 sec, f8, 120 mm using the 24-120 Nikor lens, that seems to have extraordinary resolution, expecially considering that it was a crop of ~20% of the original and then exported at a jpeg quality of 1 (lowest)! From a heft standpoint, it is a lot of camera although I must say, the body doesn't FEEL all that much heavier than my D7000; the pro lens IS much heavier than a comparable DX. Understandable. I am shooting 14-bit RAW with lossless compression. With a 32 GB Extreme Pro SDHC (95 MB/s) files copied over a USB 2.0 seemed about twice as long as files from the D7000. With a USB 3.0 card reader, transfers are very zippy as they should be. Loading images for processing in ACR/Photoshop or saving does take at least 50% longer. I haven't measured this, it's just an impression. I am very pleased with my purchase and would certainly recommend the D800E for skilled amateur, semi-pro, or pro photographers. It will take some effort to fully exploit all of the capabilities of the D800E.", "Date": "August 27, 2012"}, {"Title": "The best Nikon Dslr", "Author": "David Courtenay", "ReviewID": "RAY1KCGMZNMW1", "Overall": "5.0", "Content": "No need to tell you just how good the image quality is as the web is full of reviews, I had a D3s and D800 and sold the D3s to get the D800E, No regrets, I am amazed every time i use it and so are my clients, Top camera", "Date": "December 17, 2013"}, {"Title": "Increased contrast and sharpness you can't get from post-processing.", "Author": "Wes", "ReviewID": "R30T8LYODEJ30K", "Overall": "5.0", "Content": "One of the reasons I decided to go for the D800E over the D800 is the contrasts and depth you get from not having an anti-aliasing filter on the camera, which the D800E does not have.  Sharpness is one item everyone talks about, but really what makes an image are the subtle contrasts and tonal differences you can't retrieve from post processing.UPDATE 09.07.2012Now that I've had a good amount of time to spend with my camera, I can say that the camera has exceeded my expectations.  The dynamic range and the sharp, crisp details I can achieve are just phenomenal.  I primarily shoot street and landscape.Pros:- Excellent dynamic range.  I rarely have to do any HDR or dual exposure/layer masking work.- Although the file sizes are huge, I absolutely enjoy being able to crop very deep in and still have enough resolution to print large.- The HUD during live view is awesome!- Low light performance has exceeded my expectations.- Moire rarely ever occurs.- I love the compact flash / SD card setup.  Just added flexibility, plus SD cards are so much cheaper and work fine for taking still images.However, some thing that I do not like:- Battery life is pretty short.  You definitely need a couple of spare batteries.  A grip is recommended.- During playback of images, the camera has a tendency to automatically turn off the playback.  I haven't quite figured out why this happens.  It's almost like I've hit another button which switches the playback of images off, but I haven't.- I wish there was a live histogram you can view while in live view mode.- I also wish there was a swivel for getting awkward angle shots.Note that a 64 GB card will store approx 801 RAW 14bit, lossless compressed images.  My rating still remains a 5.", "Date": "April 17, 2012"}, {"Title": "Breakthrough Camera for Certain Types of Photography", "Author": "Ramsey", "ReviewID": "R3N3ZU7DUETB5U", "Overall": "5.0", "Content": "The D800E is not all things to all photographers (nothing, of course, is).  This is a camera for studio photographers, landscape photographers, cityscapes and architectural photography, and maybe street photography.  It is not, IMO, a camera for photojournalists (Nikon fans should stick to the D4), sports photography (not enough frames per second), or wildlife photography requiring high frame rates (e.g. bird photography).  I know that there are those who will violently disagree, but there are better choices for each of those other specialties.  I say this because first, if you aren't going to make very large prints (say 20 X 30 or larger), you should question whether this camera is for you - it may still be, because there are features it has such as better focusing, certain menu options, etc. - then some cameras with lower pixel count that the D800 but still quite high (e.g. the D600).  Second, the large files require a pretty up-to-date computer that can process the larger files.  While many others say that it eats up a lot of gigabytes of storage, frankly storage is so inexpensive today, that this wouldn't dissuade me if I otherwise thought this was the camera for me.  Lastly, those needing high frame rate just aren't going to get it with the D800E.  It's OK, but not up to the standards expected today for sports and wildlife uses.That said, I mostly do landscape and cityscape photography.  And I love this camera.  The dynamic range is a step up over the prior generation of cameras (about 14 stops) and the detail is beyond reproach.  Yes, it requires greater discipline in making sure you take every precaution to to ensure sharp images. But if you take your time and make your images carefully, you won't have better files outside of $25K to $40K medium format cameras/backs to work with.As Steve Simon (a well respected professional photographer) has said, if he's leaving his house with a tripod, he takes his D800.  If not, his D600.  That's probably the simplest but most succinct description of what type of photographer the D800 is for.", "Date": "November 25, 2012"}, {"Title": "Best camera for the semipro photographer willing to work on their technique", "Author": "Dwight", "ReviewID": "R2FB0JJKN0TI4W", "Overall": "5.0", "Content": "Wow!  This is an amazing camera.  It has changed my whole workflow,  now I just shoot with abandon and crop - crop - crop.  With all those megapixels you can crop down pretty severely and still have very usable prints.  Also, it works great with all my older AF-D lenses.  In fact, I've rented a few of the newer G lenses and besides the VR some offer I prefer the older glass.  For my shooting style, portrait and landscape photography, where AF speed is not an issue these older lenses do great.D800E moire and false color issues.  Definitely overhyped.  But they appear in many of my architectural and portrait photography.  Often they are hidden until cropping down into the picture detail.  Overall, it is maybe a half-dozen out of 100 pictures effected and after a bit of practice takes about 1-2 minutes to fix in Lightroom 4 (haven't upgraded to 5 yet, but should be similar).Overall this is a camera that rewards a shooter who values good technique and wants to develop pro skills.  You'll also need good glass (nothing that doesn't do f4 or wider), and a tripod (in most cases).If you will shoot JPEG instead of RAW and usually leave the settings on \"Auto/Programmed\" then this is probably NOT the camera for you.  It will be very frustrating.  Instead, consider the Nikon D600.  A similar camera with much of the same technologies baked in, lower price and better suited to the enthusiast shooter.I find the D800E frustrating at times.  I like that.  See it as an opportunity to improve my technique.Willing to commit to proper technique and the camera rewards you with some of the best pictures you've seen since slide film, approaching 5000dpi.  Basically the D800E competes with medium format cameras, for about 1/5th the price.  And 1/2 the price of the D4 (which is where the D800 stole many of its technologies from).", "Date": "November 4, 2013"}, {"Title": "Fabulous camera", "Author": "Beachboy", "ReviewID": "R2NOJZ3J82QXGJ", "Overall": "5.0", "Content": "I've used Canons and Nikons with great lenses, and have found that the images were always just a little bit shy of the critical sharpness that I used to get with large format cameras.  This one, maybe because of the removal of the anti-alias filter, is the closest that I've ever seen to film.", "Date": "April 5, 2013"}, {"Title": "Wonderful camera, Amazon is awesome to deal with...", "Author": "Doug Stroud \"Yellow Lab Project\"", "ReviewID": "RMIK0RID7KXRU", "Overall": "5.0", "Content": "Love this camera! It is specific in use, studio portraits and landscapes. It needs to be locked down on most occasions to ensure in-focus shots. The 36mp sensor is not for the faint hearted, snap-shot type photography.", "Date": "February 25, 2013"}, {"Title": "How to replace 4 x 5 view camera", "Author": "carl geyer", "ReviewID": "R27YVSSLK3RULS", "Overall": "5.0", "Content": "Excellent sensor with little or no noise during long exposure.  Tripod is not necessary, but for 100 ASA  and wide angle landscapes is a great help.  I has replaced my 4 x 5 system.  Purchased Zeiss lenses as well.", "Date": "January 19, 2013"}, {"Title": "Above expectations", "Author": "Nvaner", "ReviewID": "R2DBMUUC9RXT85", "Overall": "5.0", "Content": "Although some reviews may intimidate some prospective buyers, there really should be little concern. The images produced are outstanding even under challenging conditions. The sensor & metering are superb. Looking forward to producing some wonderful results.", "Date": "January 13, 2013"}, {"Title": "Finest camera I have ever owned", "Author": "Roy", "ReviewID": "R13DRH3DYDPZ7A", "Overall": "5.0", "Content": "And I have owned some great Nikon cameras.  This one, contrary to many recommendations, makes a fantastic family camera for terrific portraits and action.  It is also a \"birds in flight\" camera supreme.  The AF system is faster and more accurate than the D700, which is a great, great camera in its own right.  As pointed out by several professionals, the D800E really shines using large apertures, f5.6 and larger.  With smaller apertures I will take the word of those people that there is not much difference between the two models.  So I certainly wouldn't be afraid of the standard D800 model, but I decided on this E model, and I am very happy with it.  All my lenses seem to be better than they were before.  The new AF controls have become more familiar, and that is the major difference in handling this camera and the D700.  All in all, this is the best Nikon yet for me.", "Date": "August 31, 2012"}, {"Title": "I Love the D800E for IQ, But the 5DM3.. is More Fun to Shoot .", "Author": "Gatorowl", "ReviewID": "R16RRKRDYLL56Q", "Overall": "5.0", "Content": "The D800E performs identically to the base D800. I have detected no difference in responsiveness, and the buffer fills up quickly. I have not critically tested for IQ differences between the camera. I suspect there are some, and they would be most noticeable under heavy cropping.  However, the output of either camera is so amazing that any differences will be subordinate to the photographer's skill and the quality of lens attached. The 5DM3 by contrast is a wonderfully responsive camera, that is a huge improvement over its predecessors. Really, it is a completely new camera rather than just an update.  The focusing is amazing (although I think that the NIkon method, which requires less button pushing to change AF points, is better), and the responsiveness is everything the D800E isn't.  Not only is the continuous rate faster, but I can't overwhelm the buffer.  Yes, it slows down, but it never stops taking shots. I prefer the sound of the 5D to the NIkon.  It's quieter and provides a feeling of greater agility.  As for IQ, as long as long as I'm not shooting high DR images, I don't give up much using the 5DM3. In most settings I can get images shot with comparable lenses to look very similar after post.  The Canon produces a more vibrant, \"punchy\" look (I always shoot RAW) straight out of camera, whereas, the D800E is more muted but is easily processed to match the Canon's vibrancy (often with fewer artifacts).  As stated before, the quality of the lens makes a bigger difference.Therefore, I find the 5DM3 to be an excellent complement to my D800E.  When I have to get the absolute best IQ I go with the D800E.  If I need to shoot telephoto images, I use my Canon and 70-300mm L lens, which is the perfect telephoto travel zoom.  When I want to shoot wide, I prefer the D800E with the Nikon 18-35mm zoom.  Either camera paired with the right set of lenses will rarely if ever let you down.", "Date": "September 8, 2013"}, {"Title": "Be ready for a serious upgrade!", "Author": "W. Kurth", "ReviewID": "R3I81TTN1ETV0R", "Overall": "5.0", "Content": "And I'm not just talking about the camera.  I realized my version 3 of Lightroom needed to be upgraded as well as my entire computer system.A dual core with an older Mobo just will not cut it with 60MB+ RAW images - unless you are willing to spend lots of time waiting for each slider or process to take effect after you perform it. But I often shoot 2-600 images at a clip, and I was not prepared to spend a ridiculous amount of time editing them.  In Lightroom 4.1 to go from one magnified image (with sliders adjusted, sharpened, denoised, etc) to another for comparison took me 10-15 seconds, depending on the image- and that with pre-loaded 100% previews!Now I am upgrading to an 8 core with a modern mobo, so that should move things along (just ordered from Amazon).But as far as the camera is concerned, it's fantastic. Only reason I didn't get it at Amazon is because it was not in stock at the time I \"desperately\" needed it (when the finance minister - wife- approved it).Mine has one hot pixel and a slight BF issue on most of my lenses. Far edge focus sensor is a little off, but it is tolerable. Most of the time I will just move the camera to place the main subject into the center and then return it for composition anyway (yes, I know the arguments against that). When I really need the edge points to be sharp is only in studio shooting and then I will be using live view anyway.I am shooting it for a few weeks to see if anything else rears its ugly head and then sending it to Melville for a complete once-over from Nikon.  Ordered an aftermarket battery grip that uses the D4 battery, so I've shot all day without having to recharge.  Focus is super fast no matter what lens is attached.  Just make sure you check bf/ff issues and adjust accordingly before you take it into the field. Checking full sized resolution, it is definitely an improvement over the D700. The extra dynamic range is a big plus as well, but like I said, make sure you and your system are prepared to deal with those big, gorgeous images! BTW, this review is for the D800. Just accidentally posted under the D800E.Wolfgang", "Date": "August 25, 2012"}, {"Title": "Love this camera", "Author": "Koveh Tavakkol", "ReviewID": "R21XD3BMHNZTPA", "Overall": "5.0", "Content": "Switched from Canon 5d2 to this baby after the Canon died.  The Canon is terribly water sealed and died after water damage from mist from waterfalls.  This baby is amazing.  Great noise response, fantastic laid out menu and buttons.  Easy to use, lots of MP to work with.  The only complaint I have with this camera is the crappy Nikon LCD screen.  For the money you think Nikon would put a good LCD on these things sooner than later.", "Date": "August 19, 2013"}, {"Title": "As Good As Anticipated", "Author": "Number IX", "ReviewID": "R3R110I0JBYWHL", "Overall": "5.0", "Content": "I determined that I would purchase this camera shortly after it's announcement. I'm shooting primarily in my studio and the camera seemed ideal for the work I do. I persevered during the course of the auto-focus problem and, when it seemed that this problem had been resolved, I placed my order.I certainly have not been disappointed. The files I obtain are stellar and the detail amazing. I've been shooting a D2Sx for several years now and was concerned that the learning curve might be steep. I've had no serious problems using the camera though it probably didn't hurt that I read the manual online long before I took delivery.Color me satisfied.", "Date": "November 20, 2012"}, {"Title": "Miscalibrated auto-focus", "Author": "StatGod", "ReviewID": "R2CYHGX8HG2XF0", "Overall": "3.0", "Content": "I finally received my D800E four months after placing my pre-order. I quickly realized the auto-focus was terribly mis-calibrated (it was back-focusing on ALL focus points including the CENTER). I tried to use the AF fine-tune function to correct the AF errors: 2 of my lenses used -18 (out of -20) correction, and the other needed more than the -20 correction. This is completely unacceptable in a $3300 camera. I have returned it to Amazon and will re-order after the wide-spread AF issues have been worked out.Update: Amazon's customer service has been outstanding. My refund (including expidited shipping costs) was issued very quickly.", "Date": "July 2, 2012"}, {"Title": "Possibly the best DSLR ever made for certain group of shooters", "Author": "P. SU", "ReviewID": "R2U7TFK9XIJ3RB", "Overall": "5.0", "Content": "Ok it's the same camera as a D800 with a filter that cancels out the effects of AA filter, both are simply brilliant cameras. And only for $3300? (remember D700 was $2700 new) Image quality that go beyond the D3X for 5/8 the price. Even with 36 megapixels, it still has the 1 stop advantage in high ISO performance over the D3 and D700, amazing. Higher resolution, incredible dynamic range, smaller body with pop up flash and a decent price tag makes this a no brainer camera to get. PLUS all the modern features, bigger LCD, good video capability, revised 51 pt AF system, dual memory cards, better Live View, more durable shutter longevity etc.However, this camera is not for everyone. If budget is an issue and you rather spend money on lenses, wait for the D600. If you need to shoot sports or stuff really fast, you obviously dont want to be limited by this camera's 4fps (depending on your card speed). You need to really work this camera to get the fullest out of it. True, money might not matter to some of you as much and you grab one of this, slap a kit lens or a 28-300mm VR on it and start shooting. You will be disappointed, you get images no different than a D3100 for 3~4 times the size, lags your computer up every time you process anything in RAW (if you ever process anything in RAW at all), and eats up your hard drive real fast and everything looks soft at 100%. True hard drive is dirt cheap nowadays, but you just keep buying it to fill it up with mediocre images that you will not take a 2nd look ever again. I have loads of mediocre images too, trying very hard to not have it and make every shot count. Professionals might worry about getting slowed down by the raw file size, and if that's the case they have to consider it carefully and see if this is worth the compromise. If you have a good lens and a good technique, the images will reward you with incredible detail that you dont ever think possible. And even if you have an average lens, but u know its pros and cons well and shoot it at its best, it's going to shine with this camera. The high resolution will pick up all kinds of good stuff and also crap at 100%, subject movement, atmospheric conditions, hand motion, mirror slap, front and back focuses, noise in bad light etc. It might look great on the monitor, because it shrunk so much onto your monitor like everything is in perfect focus but when u look at it in 100% you are going to go crazy and think: what happened there? how did I get this blurry image? Did I hold my breathe and exhale when I take the shot? Was the VR on? Was the VR turn off under high shutter speeds? Did I forget to AF fine tune my lenses? Was the shutter speed too low? Did I get the right exposure? Did the consecutive mirror slaps affect my sharpness? Is my lens a bad sample? Should I get a sharper lens? Do I have focus problems with the camera? BLAH BLAH BLAH. People have such high expectation of this camera, they go crazy when they see their own deficiencies reflected in the images.Yeah and some people worry about moire. The D800 has the same problem. Read up reviews, as hard as you try it's hard to ever get moire. I didnt see any moire. When moire comes up, the D800 has it too. The chance is so slim I wouldnt worry too much about it, it's not like you need to print 24x36\" color prints all the time. Basically, the chance of you getting a bad image as a photographer is 1 million times more than you ever see moire. I would worry about my skills first and foremost before anything else.I agree with everyone else, that there are some issues with this camera, whether it's the focus problems or the green LCD or bad sensors. However, it doesnt happen to every sample, and it's a great camera when it works perfectly. So I wouldnt grade this camera based on Nikon's quality control issues. I have to admit, however, that I am getting more and more disappointed by Nikon's customer service and quality control, both from all the crying on the Internet and my personal experiences with them. I don't know it's only Nikon USA or all the Nikons worldwide. Nikon produce awesome stuff: superb lenses and now this D800E. But I shouldnt have to send my lenses and camera to them more than 2 times to get something fixed, after paying over 2k for the repair of a single lens and investing lots of money into their equipment (It's like they never test their repaired lens prior to shipping it out to me, it arrived DOA!). Not a single apology or offering reimbursement for shipping costs.So yeah there you go. Nikons are great, but their customer service seems to be getting worse, at least from my own experience. So I am waiting VERY PATIENTLY, for Nikon to fire whoever is the head of customer service and quality control, and pickup their repairs on the D800s with focus problems and have a better attitude to customers facing this issue. Why do I want to wait you ask? Because I just think Nikon products rock. If they continue to be ignorant of their customer service and QC, I might eventually switch over to the dark side but right now, nothing on the Canon side interest me other than their exotic telephotos, which I dont use as often. So if you want to buy Nikon, you might have to start considering how the retailer or e-tailer perform in customer service, which is one of the reasons why I never buy 3rd party lenses because of their bad service and bad quality control. But hey, make no mistake, this D800E is a very very strong performer in the right hands. So good I am willing to not use any other focus points but the center one for now, until Nikon release a service advisory for it.", "Date": "August 13, 2012"}, {"Title": "Great resolution!  Not so great noise control.", "Author": "nmccamy", "ReviewID": "RXPPKFPHD3FWX", "Overall": "5.0", "Content": "This camera is stunning!The only con is the fact that the other Nikon full format (FX) cameras, including the D610, have better noise control.  Why?  Because the D800 packs more sensor pixels per square inch.  When sensor pixels get too close to each other, they cause interference with one another and this creates added noise.So if noise is of great concern, then look at the other FX models, otherwise enjoy all those wonderful pixels!", "Date": "November 8, 2013"}, {"Title": "Received Defective D800e from Amazon. Disgusted with lack of service", "Author": "ProPhotog1", "ReviewID": "RSVZJO81ME9UI", "Overall": "1.0", "Content": "As you can imagine I was over the moon when I finally received word from amazon that \"your D800e has shipped.\" Especially after several false shipping estimate emails. I FINALLY received the camera on Friday, prepping for my first shot I drove 60 miles, I set up my gear, framed the shot, and to my shock the photo had a pink/purple vertical line running through the image. I continued to take more photos, and as I did the pink link remained. I tried 3 memory cards, CF and SD, 4 different lenses, reset the camera, formatted the cards, checked the sensor; I was truly in disbelief: The sensor was shot and the camera defective.I called Nikon \"customer service\" they offered to service my camera. WHY would any of us want to SERVICE a camera that is 2 days old and $3200! The employee said she could not replace the unit. I called amazon, they said I could return the unit but would have to wait a few months for the replacement, as I would be on the bottom of the list. I PREORDERED THIS FEB 7th! I am completely disgusted, something that I have saved up and dreamed about is completely defective. Horrible service to a long time Nikonian from both Amazon and Nikon, makes me sick to my stomach.", "Date": "July 2, 2012"}, {"Title": "A few issues which should not exist on a camera at this level...", "Author": "Tariq Gibran Hamid", "ReviewID": "R3MABR2TPD3Q4W", "Overall": "3.0", "Content": "I received this camera from Amazon about a week ago and I have enough reservations about the D800E that I will likely be returning it.  Initial impressions were a bit lukewarm with regard to build quality.  First the positives - it feels great in the hand (I was a bit worried about the grip but it fits my hand perfectly), the viewfinder is better than expected (coming from the wonderful finder of the Sony a900, I had concerns the size and acuity would be lacking - that's not the case at all) and finally, the camera feels much lighter than I expected.  Unfortunately, that last point would seem to come at the expense of build quality - quite surprising to me having used various Nikons over the past thirty years (Nikon F2, F3, F4, FM, FM2, N90 and so on).  Right off the bat, I was shocked at the flimsy battery door and card reader door.  Both feel really cheap in comparison to any mid/high level DSLR I have used over the past five years or so (the Pentax K-5 for instance has a noticeably more rugged build in these areas by comparison and I expected the D800E would be at least at that level).  Whether or not the cheaper design will prove a long term liability, I don't know but it's not reassuring to feel the card reader door give/move/squeak when gripping the camera.  I expected better from Nikon at this price.The real issue for me though is in useability with Live View and AF.  It's been mentioned before but I had no idea just how frustrating and almost unusable Live View is in practice.  The problem is that the 100% LV image is apparently interpolated so it's nearly impossible to ascertain perfect focus via inspection, particularly at 100% view.  This becomes very frustrating when doing critical work because essentially you have to blindly trust the contrast detect LV AF (if you are using an AF lens that is!).  That really cripples one of the main advantages of having Live View in the first place imo.  The other issue I'm experiencing is with general AF accuracy and reliability.  I have spent the past week testing the camera with three different lenses, all new (Nikon 28 1.8G, 50 1.8G and Tamron 105 Di Macro).  In every instance, the AF accuracy seems to be all over the place.  With the 50, after experiencing this hit and miss phenomenon, I found after testing that the lens required an extreme +20 fine tuning calibration.  Oddly though, the outer AF points were off with that setting in the center and furthermore, that setting did not seem to be accurate at all distances so in the end, the fine tuning was found to be completely unreliable.  So, Ok, maybe the lens was bad.  Moving on to the other lenses, testing showed them to require no fine tuning adj. but the Tamron was always inconsistent when actually shooting with regard to AF accuracy (50% or less hit rate on stationary subjects!).  The 28 was found to be tack sharp most of the time in the center using the central AF point but the other AF points varied quite a bit.  After further testing, I'm inclined to believe the issue is with extreme field curvature of that lens (so the proper point of focus in the center is not at the same plane as the D800E AF points to the far right or left (and, unfortunately, the left AF point is not the same as the right AF point which leads me to believe there is an issue with the D800E outer focus point accuracy as well).All in all, with three different lenses and each one exhibiting major issues with the D800E, I have to believe the camera is at fault to some degree with regard to AF.  Combined with the poor Live View implementation and the so so build quality, I don't think this camera is going to be worth it for most users in comparison to a 24MP or so FF alternatives. For one, the jump in actual resolution will not be seen if the AF is even slightly off.  Secondly, if one were planning to use the best MF Zeiss lenses + Live View to really take advantage of those 36MP's, the Live View issues really get in the way and one is left basically bracketing focus IN LIVE VIEW!  That just seems crazy at this price level.", "Date": "November 2, 2012"}, {"Title": "First full frame camera.", "Author": "Ernest", "ReviewID": "R1CEXE7AYTKID4", "Overall": "5.0", "Content": "This is my first experience with a full frame camera, it is all and more than expected.Like the challenge but it takes time and practice.Recommend only to folks seeking a tool of perfection.", "Date": "October 20, 2013"}, {"Title": "still learning", "Author": "Kenneth E. Morrison", "ReviewID": "R262186VE7TW7O", "Overall": "4.0", "Content": "Took the camera to Istanbul for 9 days ..... it was really fun to work with upgraded from D300 (kept as a spare)... still learning how to fully utilize the capabilities of the camera ..... I haven't experienced any quality issues or focusing issues.... I haven't tried the movie capabilities, not really my thing .....bought the digital download of mastering the D800, hoping to learn more about taking advantage of D800E it was more a owners manual ....oh before I forgot the file sizes are a beast .... will need to come up with a new workflow my four year old MAC struggles and I am out of Hard disk space lol", "Date": "April 18, 2013"}, {"Title": "Incredible precision photographic tool, with one obvious fault.", "Author": "Stoka", "ReviewID": "R24O7CK53VWGXK", "Overall": "4.0", "Content": "I've only been using the D800e for a relatively short time and I'm impressed with it a great deal. I love the build quality, image quality, focusing system, and dynamic range of the images. It is just a beautiful device. I want to point out an area where I think it could be improved relatively easily:I'm sure the Canon 5dMk3 probably outsells it 3 to 1. This is puzzling, because in many ways the D800e is a superior camera. The major item is the complex and somewhat pedantic custom settings banks. Nasim Mansurov and Ken Rockwell both identify this as a primary weakness of the camera. I have used a D7000 and love the U1 and U2 settings which instantly recall a whole set of camera settings in an instant. I find these settings especially useful for night photography and long exposure work. Wake up and give us some U1 and U2 settings via firmware Nikon. You already have the code because these things are implemented on the D7000 and D600. I'm a computer programmer and that is almost a cut and paste job. The camera has no instantly accessible way to a set of complete settings for specific tasks. The Canon has three sets of unique camera settings, instantly accessible via C1,C2,C3.I would love to be able to press the mode dial, and find those settings there along with P, A, S etc. I can't see this as a major software engineering challenge, and it would make the camera a lot more user friendly.", "Date": "July 12, 2013"}, {"Title": "super camera", "Author": "Feeza", "ReviewID": "R3EP8D3US5TU2Y", "Overall": "5.0", "Content": "It's everything I knew it would be and more! Murphy Camera is a great seller to deal with.I have pictures that are professional looking and taken with such ease.  I love this camera!", "Date": "October 26, 2012"}, {"Title": "Good for Pros but not for DX Upgraders", "Author": "Robert Cozzi", "ReviewID": "R2PO8KO426PH5G", "Overall": "4.0", "Content": "Like many people this year, I too purchased my first FX Nikon. I had the D600 (returned it due to oil spots) and also co-ordered the D800E to try them both out. Our shop mostly had D7000 and D90 cameras previously, but there are one or two D300s units.So this review is for DX shooters who are thinking of moving up to FX, not for someone wondering if the D800E is a good camera, because it is.The D800e is a very good camera and if you're a professional it is a nice alternative if the D4 is too expensive albeit a different camera. It has all the Pro-level connectors which also makes it NOT viable for many pre-DX shooters. Virtually none of your consumer or pro-sumer accessories will work with the D800/e cameras, such as the ML-L3 wireless remote (doesn't work) or any 3rd party remote built for the DX family.Having said that, of the 3 cameras, the D800 is probably the best choice if you're, as I said, a Pro or a prosumer who likes to tinker with the adjustments. The D800e is really for a special set, but some say its not much different from the D800 and those are the ones who should get the D800. It is different, but subtly different.The D600 would be my recommendation if you are coming from the DX world (D90, D7000, etc.) It has all the Scene modes for \"cheating\" as well as works with all your accessories, such as the remotes.The D800/e line seems to have fewer oil spots on sensor issues than the D600 so if you want a D600 for the upcoming year-end holiday season, I'd suggestion waiting to the 11th hour to get as fresh a copy/unit as possible.Cleaning oil off a sensor isn't for the weak of heart.Bottom line: The D800E is a specialty camera that is not for many pro-sumers moving up from DX format. It is however a wonderful camera and gives the best resolution of anything out there to-date. But to be honest, unless you do 100% crop (i.e., zoom in all the way) you won't see the difference in 97% of your photos. So save the $1000, get the D600 and buy a good lens (and not the 24-85mm that comes in the D600 kit, get the 28-300mm if you need a kit lens).", "Date": "November 17, 2012"}, {"Title": "Almost perfect camera", "Author": "D. Carneiro", "ReviewID": "R38DN2WUWYMXAU", "Overall": "5.0", "Content": "Nothing to say.  After my D3, this is the best camera ever!  I also have a D3X and a D7000.  All them are good, but the D800e is my second best.", "Date": "January 19, 2013"}, {"Title": "Updated review", "Author": "Annan Chen", "ReviewID": "R1HVUCTR5QO57A", "Overall": "5.0", "Content": "This is a great camera. Photos are really really sharp. Dont hesitate between 5d3 and d800e, nikon is the best. especially when you put your photo on macbook pro with retina display, the image is so vivid and you can see every details that your eye cant detect in real life.Update: after a week of using d800e i can detect the difference between extreme left and right focus. its nuance but its occur. i will try to find some other camera to test the focus. but generally this camera is amazing for landscape and capture fast moving objects. i love it and i still give it 5 stars. i dont think focus problem is so obvious unless u shoot something really close and using left focus and u enlarge the image to check. i usually use central focus and it works pretty well. and this camera perform really really well in the low light situation. i think this is the best thing to distinguish 5dm3 and d800e. i am a late night cityscape photographer and this camera's performance out of my expectation. i clearly remember how dark the restaurant was and the pictures i took was stunning bright and sharp. 5 star recommendation still.", "Date": "November 21, 2012"}, {"Title": "the D800E has everything you would want in a camera", "Author": "Gerald Blaine \"Gerald Blaine\"", "ReviewID": "R1I96TAOJHOL3B", "Overall": "5.0", "Content": "This is probably ranked just below the top Professional camera Nikon produces, but it is $3000.00 less and has the same features. I was advised to purchase Darrell Young's book == \"Mastering the Nikon D800\"  It was an excellent primer and taught me the menu capabilities of the camera.  I have no complaints.", "Date": "November 13, 2012"}, {"Title": "Best in class", "Author": "Andrey", "ReviewID": "R1LPYB2XCRE7M", "Overall": "5.0", "Content": "When I bought back in 2008 Nikon D700 I thought this was the first camera that captures images exactly like human's eye can view. Now when I bought Nikon D800E I think this is the camera that is able to capture even more details that hide from human eyes!", "Date": "November 13, 2012"}, {"Title": "Nikon D800 is fantastic", "Author": "M. Heller", "ReviewID": "R2K3S81FDH0WU9", "Overall": "5.0", "Content": "This DSLR has the best sensor on the market at the time of this writing.  It's not perfect, the grip is too small, frame rate is rather slow, and some of the config options can be frustrating (I can't bracket +/- 2EV?).  However, all those things don't matter simply because the images this camera produces are fantastic.  I will gladly put up with all the minor issues to get the results.I posted my D800 settings along with a link to download the config here: [photokaz.com]If anyone has a Nikon D800 or D800E, especially someone who recently picked one up, this may be useful for you.", "Date": "February 10, 2013"}, {"Title": "Left auto focus defects", "Author": "Flyingtiger", "ReviewID": "R1SOWQ7NXCW7YO", "Overall": "2.0", "Content": "Just tested out and confirmed my D800e got the wide-spread left out of focus defects. I really don't know what to do, send to Nikon service center to get repaired or wait for a clear response from Nikon for explanation and instruction, obviously so far Nikon company has been in denial on this serious issue. How frustrated it is? Until they addressed this issue and acknowledged this existence this camera is NOT Recommended!!!!", "Date": "July 23, 2012"}, {"Title": "Beware of Manufacturing Defect", "Author": "mg", "ReviewID": "R2CH0SW0I17PE4", "Overall": "1.0", "Content": "Read the multitude of postings and professional publications exposing the focusing flaw in the Nikon D800E.  It is well publicized and recognized industry-wide.  However, Nikon refuses to issue a recall and continues to charge several hundred dollars to repair a $3000 camera that came from the factory in this condition.", "Date": "October 14, 2013"}, {"Title": "I want to like it but am a bit dissapointed", "Author": "Sid", "ReviewID": "R253KTEANUXZRY", "Overall": "4.0", "Content": "I am a photography enthusiast that is returning to photography after many years. As a kid, I used Nikon exclusively as my dad had a Nikon F4 and when looking for a camera, I naturally gravitated to a Nikon. I researched several models and decided since this was a long term purchase, I wanted to get something high end and of good build quality that would last a long time. I purchased this camera from a local authorized Nikon dealer and I purchased lenses from Amazon (14-24 G and 24-70 G lenses).In general, the camera has very good build quality and in most aspects is an excellent camera. With a tripod, this camera takes real good pictures. However, i have a few gripes:1) Due to the large resolution and the significant mirror slap, getting a steady image on this is a much bigger challenge than on other cameras. A month after my purchase, I returned to the store to compare this to a D4 and D700 and difference is noticeable. In addition I don't have steady hands so this compounds the issue. I could use a smaller resolution but based on what I have read, the camera down-samples at lower resolutions as opposed to averaging pixels which negates the benefit of a large sensor. However, this can be solved in post processing in software but it is a hassle.2) The left AF issue clearly exists on my camera. It's not something that affects me a lot and worst case I can flip my camera upside down and right focus in the rare circumstances I need to left focus (might not work on a tripod) or just use live view. However, my main issue is that Nikon's support response is not very customer focused. The basically asked me to file an issue and they will get back to me once they decide how to handle the situation as many people have had similar issues. If they are not willing to do a speedy fix, I wish they would maintain goodwill by providing customers with some sort of  alternative or partial refund.Based on the response of my customer service issue, I might re-rate this camera higher. Right now, I actually would rate it a 3.5 because I am somewhere between OK and liking it.==========10/7/12 Update: Nikon agreed that my unit does have the left focus issue and are sending me a prepaid box to send my unit in. Their response has been slow but considering they needed experts from Nikon Japan to verify the issue, I think that it is acceptable. Also, I was initially (incorrectly) led to believe by the customer service agent that my camera would not be fixed in a reasonable time frame but that doesn't seem like the case anymore. If the customer service comes through and my repair process turns out well, I will probably end up rating the camera higher==========11/26/12 Update: it's been three weeks since I got back the camera from Nikon. I got a receipt in the mail about a couple weeks after sending it in. They keyed in my return address incorrectly so it might good to double check with nikon a week or so after you mail it in. They had the camera in their possession for 4 weeks. I've used the camera for the last few weeks and I can confirm that all the AF issues have been fixed. I tested with the 35mm f1.4 prime and the left and right AF points are now very sharp. Overall, I am happy with now and upgrading to a 4 star review from the previous 3 stars. This camera is still more sensitive to camera shake given the pixel width so expect to have to use a tripod most of the time.", "Date": "September 15, 2012"}, {"Title": "Great for People who will use it Properly", "Author": "Rex Cadungog", "ReviewID": "R3D3TXBASX988Y", "Overall": "5.0", "Content": "I had used D700, D7000 and D4, let me tell you this, the Camera has awesome powers but you have to understand to use it to unleash the power of 36 Million pixels.Treat it like a medium format camera, use tripod, take your time, use the best lenses, then calibrate your camera/lens because only few people do that, that's why you get mix reviews, calibrate it, cameras and lenses don't get tuned perfectly together, you need to do that to achieve maximum sharpness and resolution, if you have questions, I run a blog at RockingMyFantasy(dot) com.", "Date": "November 13, 2012"}, {"Title": "Amazing!!", "Author": "lizi", "ReviewID": "R2H2BR8HK2HPBH", "Overall": "5.0", "Content": "The image turns out is amazing!!!The sensor is so nice! It is my second camera and I think I did a correct decision to buy this one----D800E, and I will recommend my friends.", "Date": "June 27, 2012"}, {"Title": "Oily sensor. In November the left autofocus problem still exists", "Author": "SZDM", "ReviewID": "R30UZZMX99ZAWL", "Overall": "1.0", "Content": "Completely disappointed in the Nikon brand. I received this camera in early November, with serial number \"30091xx\", I thought the left autofocus problem would have happened but I realize the tests and discovered that my camera has a huge problem. But not only that, it also has the sensor stained with oil droplets. I use a 85mm 1.4f lens and I've never remove it. For 3300 dollars this should not be happening. Also I thing for a camera of this price is insufficient packing, I mean both Nikon and Amazon packaging.", "Date": "November 24, 2012"}, {"Title": "Moire is definitely a problem and noticeable", "Author": "Raymond", "ReviewID": "R346055XOV4B21", "Overall": "2.0", "Content": "I own both the d700 and d800e. There is not much difference in the print quality. I have printed several landscape photos at 20x30 (with exact same settings and controlled environment) and none of my friends have been able to tell a difference in either the d800e or d700. It is only noticable with prints larger than 24x36. Unless you are printing many photos larger than that it is not worth the price if you already have a good camera. 99% of people would never see a difference in quality online or with normal prints. I also shoot Weddings and this camera is definitely not suitable for Wedding Photographers (if you really want this many pixels get the d800) because of the Moire. Other reviews say that Moire is not very noticeable with the 800e model. I strongly disagree. With Wedding dresses, veils and Bridesmaids dresses or any dress with fine fabric, Moire is definitely there and almost impossible to get rid of in post-process. If you are a landscape photographer and you have lots of money to spend or want to print Huge 30x40 prints than go ahead but also be cautious of the Mirror slap wich mayt affect the sharpness at slower shutter speeds of 1/250 or less. I have enlarged controlled prints that were taken with a tripod and it shows noticeble shake from the mirror at slower shutter even on a tripod, so beware this mirror tends to slap! I also read reviews that the iso is good on the d800e. No way... the d700 is WAY better at high iso and less expensive. The d700 is still a great camera for hand held shots. I wish Nikon would improve the d700Pros-good quality for landscapeCons-Not good for weddings (get the d800 instead or better yet the d700)-Expensive price for not much of an improvement from the d700-Noticeable Moire on clothes-Mirror slap is too strong and affects sharpness at shutter speeds at 1/250 or less.", "Date": "July 19, 2012"}, {"Title": "The spec of the product is impressive & hope it will deliver as expected.", "Author": "George Antoniou", "ReviewID": "R1XLOZYE2P447D", "Overall": "4.0", "Content": "After owning a Nikon D3 I decided to switch over from Canon, having acquired some nice Nikon lenses I was looking for a lighter camera, since the D3 is a bit on the heavy side to drag around in all situations. I have not yet tried the D800E but hope it can match the D3 qualities. This item was well packed by the seller but was delayed mainly by FedEx who advised of the delay just on the day they were supposed to deliver. Though it looks I will love the product I was put bit off because the box was opened, not as would expect delivered by the factory, Though all items were included looked new, the sealed plastic jackets containing the manuals were torn open and found no desiccant in the box that usually Nikon packages their products with. Am satisfied with the seller's performance but would communicate with before confirming an order of high value.", "Date": "December 3, 2013"}, {"Title": "Great image quality, Poor physical built", "Author": "Steven", "ReviewID": "RKTLXKZBMWPT8", "Overall": "3.0", "Content": "This product has great image resolution, and very high dynamic range.  The construction is weak, suffers from camera back focus, and has a green tint when image is displayed on LCD.", "Date": "March 8, 2013"}, {"Title": "See all the other reviews of this magnificent camera.", "Author": "B. Stone", "ReviewID": "RH9FGI2YCA5KU", "Overall": "5.0", "Content": "a review of this camera would take many pages.  There are lots of them on the web.  I am delighted with it.", "Date": "November 23, 2012"}, {"Title": "The jury is still out", "Author": "R. M. W. \"Dude\"", "ReviewID": "R33YHQVLBSXRAJ", "Overall": "3.0", "Content": "Note: I just received my D800E and I am still making my evaluation of the camera.  This is an upgrade from my D700.At this time I'm only putting this review out as a heads up those who own or are thinking of purchasing this camera.  The USB 3 cable that comes with the D800 has a plastic clamp that snaps onto the cable which is for the purpose of keeping the USB connector secured to the camera during data transfer.  The problem is that it can prevent the cable from making full contact with the camera (even if you think it is connected).  I spent the better part of 90 minutes trying to diagnose why the camera was not communicating with my computer before I realized that the problem was this plastic attachment.  So if you have problems with the connection just take the plastic adapter off.  Works just fine without it.I'll write more and upgrade the stars once I've had a chance to use the camera!", "Date": "October 19, 2012"}, {"Title": "Best I have ever used", "Author": "Charles L.Carroll", "ReviewID": "R22UJGIXS36KH2", "Overall": "5.0", "Content": "I have shot with Nikon since I switched to digital imaging. Started with a Nikon D200 and for the last 4 years I have been shooting with a D300. Loved my D300 and used it for landscapes, weddings. auto and offshore powerboat racing, motorcyckle events and many civic events. So far I find the D800E to be an incredible advancement in the quality of the images. Great Camera can not say too many nice things about the D800..", "Date": "December 3, 2012"}, {"Title": "Focusing issue", "Author": "lucsor", "ReviewID": "RGJDKX6Q57X4Q", "Overall": "2.0", "Content": "I got the D800E after months of wait! The sensor was actually dirty (very unusual for a new camera!) and non of hundreds of taken pictures were focused and sharp, hopefully I was able to return it and have my money back.", "Date": "August 16, 2012"}, {"Title": "Good professional camera but has some issues", "Author": "Brad S. Lee", "ReviewID": "RUINLBZKPR2L", "Overall": "3.0", "Content": "After more than three month waiting, I finally received my D800E from Amazon.  It is a well designed camera for people who are either professional photographers or semi-professionals. However, knowing all this camera can do requires a Ph.D. (the User's Manual is almost 500 pages long). Recently I took the camera with me (with Nikon's 28-300 mm zoom lens) on my Israeli trip. It functions fine until I encountered a stain issue that appears in photographs I took.  I do not know what caused several stain spots appearing in the photos.  It could be dust or dirt on the filter due to the environment that I was in (where land is surrounded by sand and temperature reached close to 122F). However, even after using the clean image sensor option in the camera's setup menu and further using the Lock mirror up for cleaning option by a manual cleaning using a blower, the problem of stain spots remains appearing in the photos, though to a lesser degree.  I will have to bring the camera to a Nikon authorized service to have this problem corrected, hopefully.", "Date": "July 22, 2012"}, {"Title": "Broken", "Author": "Christian A. Gutierrez \"CEO Amber Blue Films LLC\"", "ReviewID": "RFAMY97WNGBPI", "Overall": "1.0", "Content": "I thought this would be the greatest thing I've ever got on Amazon however, it broke after only a few months. I am so disappointed since its also out of the return window. Only buy this if you're prepared to be stuck with a broken item.", "Date": "October 27, 2013"}, {"Title": "Nikon D800", "Author": "Bernie Toes", "ReviewID": "R15ZSS48CDGI65", "Overall": "2.0", "Content": "I can't believe that Nikon came out with the D600 while we are stuck with the D800 AF Focus problems. It seems all the critics has left the building , I guess Nikon paid them off.", "Date": "September 20, 2012"}, {"Title": "very disappointment", "Author": "DL", "ReviewID": "R1AKS1S14JI68D", "Overall": "2.0", "Content": "Got this camera along with a $1900 lens, hoping it will deliver excellent picture,But result is only mediocre, no better than my Sony Nex 7 and other inexpensive Canon  setup.And it is very heavy.", "Date": "August 11, 2012"}], "ProductInfo": {"Price": "$3,299.95", "Features": "Extreme resolution 36.3-megapixel FX-format (35.9 x 24.0mm) CMOS sensor\nFull 1080p HD broadcast quality video and minimized rolling shutter\nView simultaneous Live View output on external monitors and record uncompressed video via HDMI terminal\nMulti-Area Full HD D-Movie Video Recording Mode\nComprehensive high fidelity audio recording and playback control", "Name": "Nikon D800E 36.3 MP CMOS FX-Format Digital SLR Camera (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Qm8wivxcL._SX300_.jpg", "ProductID": "B005OL2ID2"}}