{"Reviews": [{"Title": "Both surprises and no suprises", "Author": "oldsalt19", "ReviewID": "R2QKU0SJC5WENH", "Overall": "4.0", "Content": "It seems that the RX18 and the RZ18 are identical cameras.  The user's manual has both designations on the cover.  Mine is black and labeled rx18.  Different suppliers at Amazon are liquidating their inventories so there is some spread in prices.  I've seen prices up to $153.  I got lucky and scored pretty much the last camera from a specific store for $94+S&H.;A lot of the camera details were not surprising for an inexpensive camera. Right out of the box I got the immediate impression of CHEAP, CHEAP, CHEAP.  While many cameras have a lot of plastic in them, most are pretty good at making the finish look and feel like metal.  With the RX18, the manufacturer brooks no such dishonesty.  The shell looks and feels like thin gauge plastic.  There is no exposure or focusing bracketing.  There is no RAW mode.  The video mode is limited to HD 1280X720 instead of a full 1920X1080. The lens cannot zoom during filming.  One has to stop the filming, change the zoom, and then resume taping.  None of this is surprising for a cheap camera.  What did impress me was the huge 18X zoom range--the 35mm equivalent of 25mm wide angle to a powerful 450mm telephoto.  I checked images at both ends of the zoom range as well as near the middle and was impressed with the overall sharpness.  Autofocus was reasonably fast and very accurate.  Noise was acceptable at the base ISO of 80.  The RX-18 produces a largish 16 MP image file.  With the small sensor in the RX-18 (and every other superzoom,) the images starts to falter at about 12 MP. As may be expected, the 16 MP images produced by the RX-18 looked like, well, 12 MP images that had been blown up to 16MP.  I doesn't degrade the final picture, but its just useless resolution.Then I discovered the sound recorder.  A number of cameras offer this feature, but I can now make voice notes at a touch by coupling this feature with a provided \"green\" programmable button.  The sound was very tinny and low quality when played back through the camera but when the resulting WAV file was run on the computer, the sound was actually very good.Then I discovered a feature that really brightened my day.  The flower icon on the four-way controller brought up a menu that offered not only a macro mode but \"Super\" macro mode--and super it was.  I do a lot of science photography and it involves a great deal of close-up work.  In my test, this camera focused to less than an inch with the lens zoomed out to its widest.  A 49mm lens cap was just sufficient to fill the field of view at closest focus.The camera was manufactured in Indonesia.", "Date": "March 7, 2013"}, {"Title": "Bought it three times", "Author": "Amazon Customer", "ReviewID": "R1RVB0DJFAS3U3", "Overall": "4.0", "Content": "This is the new version of a camera we bought 9 years ago and loved. We tried other cameras but they all had problems that we couldn't get over.Our first purchase of this exact model when sour. Something happened, explainable, and the camera died. It seemed not repairable.But we still like the camera so much that we bought it again and just got a protection plan with it.Takes awesome pics and vids. allows you to zoom while taking vids, a lot of cameras don't do that. Great color. Lots of customizable settings if you want them, but you don't have to use any if you don't want.", "Date": "July 1, 2013"}, {"Title": "Wonderful camera", "Author": "Patricia T.", "ReviewID": "R1S7UL7K25GTYX", "Overall": "5.0", "Content": "Nice colour, freindly use, zoom very large, screen big enough.Very light. Come with battery and charger, cable for TV connection and USB + disc", "Date": "October 5, 2013"}, {"Title": "Very good small camera for pocket, when it works.", "Author": "Laurence Reich", "ReviewID": "R34QKQE31L66MW", "Overall": "3.0", "Content": "This is my third small Pentax Optio, and the first of the RZ=18 series.  It worked fine until the day I needed it and when pushing the \"on\" button, all I got were several beeps and the camera turned off.  Same with batteries from my other Pentaxes.  Checked online and found this is a common problem with this camera, although I'd had no problems with RZ-10's.  Annoyed, I tapped the camera twice on my knee and - lo and behold - it works again!  Heck of a way to fix a camera!", "Date": "September 18, 2013"}, {"Title": "Just got optio rz 18", "Author": "Milagros Cuellar", "ReviewID": "R1UBY2TO7RSF62", "Overall": "5.0", "Content": "I just got it So far it's really nice takes beautiful photos real easy to use  love orange color got the leather pentax case for $10.00It's a made well case will give update with my camera ventures", "Date": "October 3, 2012"}, {"Title": "Amazing", "Author": "djjaguar", "ReviewID": "RN8ZE4FFQQCE1", "Overall": "5.0", "Content": "I bought this for my dad who is 80 and he can use it with ease.  The pictures are amazingly clear.  I highly recommend it for the amazing price.", "Date": "May 18, 2013"}, {"Title": "Great little camera!", "Author": "B. Jones", "ReviewID": "R3R2YI8Y2W0RWC", "Overall": "5.0", "Content": "I wanted a camera that wouldn't break the bank that I could take on bike rides, hikes... I wanted good image quality, wide zoom range, and ease of use. This camera fit the bill perfectly. It has a wide range of automatic settings, for landscapes, motion, etc; these usually work great, but I can make adjustments if I like. I've snapped a bunch of photos with it, and I am quite impressed. The case is cheap plastic, but the guts of the camera are great. The image quality per dollar spent is off the charts. $80 for used (really, like new) and it takes photos nearly as good as a much larger camera that cost over $400.", "Date": "September 7, 2013"}, {"Title": "I love this camera!  Easy to use and nice color so I can find it!", "Author": "Jane", "ReviewID": "R25B33W9PSA7FF", "Overall": "5.0", "Content": "I love this camera!  Easy to use and nice color so I can find it!  very nice product and love Pentax!", "Date": "April 7, 2013"}, {"Title": "Tossup", "Author": "customer123", "ReviewID": "RFGIYP5CNVUJI", "Overall": "2.0", "Content": "This camera takes great photos and has wonderful options for creativity. The software is amazing. The flash though is located where your finger might go, so the flash is off, and the camera is not durable. Mine broke. Buy warrantee!", "Date": "December 8, 2012"}, {"Title": "Great Camera", "Author": "christopher ramsey", "ReviewID": "R3CIBI2K4TY1N9", "Overall": "5.0", "Content": "Battery life is only nit. Photos are gorgeous and size is perfect for travel. Definitely worth the investment. Yeah, Yeah.", "Date": "June 20, 2013"}, {"Title": "okay for the price", "Author": "Becky \"Becky\"", "ReviewID": "R27YK6E3B6AXEX", "Overall": "3.0", "Content": "I bought this camera to take on vacation rather than lugging the older larger Pentax with me. It does take nice pictures, but not the quality I expected. Also the flash is a long delay. Often my subjects have moved by the time the flash goes off!", "Date": "March 15, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "18 mega pixel sensor\n18X optical zoom ( 25-240mm equivalent) with slim foot print\nLarge 3\" LCD screen and a 4cm super macro mode\nWidescreen HD video in 720p @ 30 fps. Face detection for perfect exposure\nPentax sensor shift image stabilization", "Name": "Pentax Optio RZ-18 16 MP Digital Camera with 18x Optical Zoom - Orange", "ImgURL": "http://ecx.images-amazon.com/images/I/412BDRW%2BjKL._SY300_.jpg", "ProductID": "B005MM3X0U"}}