{"Reviews": [{"Title": "Piece of Junk -- Avoid", "Author": "phoneguy", "ReviewID": "R189FTSW1ZGX1G", "Overall": "2.0", "Content": "I was attracted to this camera since it's one of the very few IP cams with greater than VGA resolution.Setup was straightforward, typical of this sort of product.  Understanding networking basics helps a lot.  Couldn't get video using Firefox, it tried to use a Quicktime plugin, and couldn't handle the stream.  Works OK with IE though.  Web server is an enhanced version of what is supplied in the Smarteye H-series camera, very straight-forward to use.The main problem is just a profound lack of sensitivity.  It is far less sensitive than a cheap Foscam I use.  In dim room lighting, I get nothing in daylight mode.  Totally black.  Turning on IR mode, I get enough light for maybe 3-4 feet of range, with brightness cranked full up.  I do have the camera mounted upside down, it's possible the IR cut filter is always active, which would explain the lack of IR performance.  I'll experiment next time I have the chance.Performance with daytime lighting is adequate, noticeably better than VGA quality.  Motion detect seems inconsistent, but that seems to be common in cheap IP cameras from what I've seen.-----------Update after a couple more weeks of use.  I was afraid I might have been a bit harsh.  Not so.  Motion detection is terrible, I'm using a sensitivity of 40 which gives some false alarms due to cloud movement.  Camera is pointed down towards the ground from the second story, but shadows still trigger.  Unfortunately, sometimes a truck can drive right through the middle of the scene, and the camera won't trigger, or won't trigger until it's already through.  Also, the thing can crash when you're administering it, requiring a power cycle to recover it.  Real inconvenient when it's 40 miles away.", "Date": "September 20, 2011"}, {"Title": "too good to be true?", "Author": "georg", "ReviewID": "R2HBEUC32W545X", "Overall": "3.0", "Content": "This was originally a one-star review (see below - I left the original review below this update), but in the meanwhile this camera grew on me. Finally, after a few days of begging, Service has actually replied, and sent me a firmware update (without which the camera was essentially useless). I installed the new firmware V1.4.0.1.5 - and this update solved all problems I had with the camera. It works great with iSpy, and the video quality is sufficient for my purposes. It is just a pity, that the company refused to realize (despite complaints all over the web - not only here on Amazon) that their camera is essentially useless with the original firmware - or maybe there are other reasons why it is such a struggle for wansview to give out new firmware...?Anyway, for me, this camera finally was a good deal, and I already bought two more to set up my home surveillance system.I still dont want to give it more than 3 stars, because it shouldnt be necessary to go through such a struggle in order to obtain a decently working product.ORIGINAL REVIEW---------------The camera hardware itself is probably ok, but there are too absolute dealbreakers:1. The camera seems to be shipped with an outdated firmware (V1.4.0.1.3), full of bugs (brightness bug as mentioned in the above review, cannot set rtps streaming port, cannot access h.264 stream via lan, etc). I looked at the Demo NCH-536MW that the company put up on their website, and the firmware version is V1.4.0.1.4. Here, brightness bug is resolved, I dont know if the stream bugs are also resolved. Furthermore, I stumbled across their downloadable user manual, showing a firmware version V2...2. Now the crazy thing: I understand, that sometimes products are shipped out prematurely, often with (hopefully) minor bugs still lurking to be discovered. And I am also fine with doing the one or other firmware update on these products myself. But after discovering that firmware updates for this camera can not be found anywhere on the web for download, I sent a friendly request to Wansview for a firmware update. Here is the entire conversation:- Hello, I am desperately looking for a new firmware for my NCH-536MW (purchased via Amazon, but problems with brightness adjustment).Can you email it to me?Thank you so much!J.B.- Dear J.,I am glad to help you.But the firmware for NCH536MW is not allowed to be sent.- Dear Wansview TeamThe software on my camera is buggy (similar to other users that bought this camera on Amazon - just have a look on Amazon!).The software on my camera is an older version than the software on the Demo camera on your website (my camera has software V1.4.0.1.3, the camera on your Demo site has V1.4.0.1.4 - and does not have the brightness bug any more).The software on my camera is an older version than the software shown on the user manual (user manual shows a software version of V2...).And you cannot give me the newer version??? Are you serious???- No Answer", "Date": "March 7, 2012"}, {"Title": "Good value for the money", "Author": "Alan", "ReviewID": "R1TKYNWP1HZJKC", "Overall": "4.0", "Content": "The main attraction of this camera is the tradeoff between the cost and the full list of features it possesses. Comparing it to other brands it is unbeatable: for the cost you get the full featured camera: IP, Pan & tilt, WiFi, SD card, Motion detection, 2 way audio,  Infrared, etc. Similar brands with the same list will cost 2X and more.On top it has higher resolution than many other security cameras, namely HD.It took me a while to activate it, since I am not a PC wizard, but all features of the camera worked just fine. I tried to activate them all: IR, motion detection, save into the SD card, etc.. no malfunctions. Infrared view at night was great up to about 5 meters, sound quality is reasonable. Pan and tilt are great, huge range, quiet operation.Picture quality is not perfect, I expected somewhat better from HD, but for a security camera it is OK.2 minor issues:1) Infrared was turned ON all night, although I set it to AUTO. I was expecting it to be turned ON only when you access the camera or during a motion detection event.2) When I tried to access the camera from a notebook with Windows 7 Starter operating system I could not obtain the video, although I could access the camera settings and audio. Not sure what the problem was.  I guess it has to do with the ActiveX stuff (whatever that is...). Anyways: with Windows XP is works great.I did not bother to investigate it further since XP is my operating system of all my PCs.Summary: great value for the money. I consider buy few more for my business security.", "Date": "November 25, 2011"}, {"Title": "Junk do not buy!", "Author": "GT Man \"GTMAN\"", "ReviewID": "RNNGKEFD3KMEO", "Overall": "1.0", "Content": "This camera is junk. I have several ip cameras and this is by far the worst. The firmware is buggy, yes I'm running the latest 1.8. The night vision is horrid, with the ir filter failing to disengage most of the time. The wifi range is several feet, it's just non existent. I would suggest looking at fixed cameras dahua or ips if you want decent performance. Don't waste your money, these companies like foscam and wansview should not be in business. The earlier 300k cameras were ok, but these new megapixel ones are terrible. The only saving grace is that the picture in brightly lit rooms is quite good.", "Date": "November 25, 2012"}, {"Title": "RUDE company support", "Author": "J. Banko", "ReviewID": "R2319UNQWVOT0H", "Overall": "1.0", "Content": "I bought this camera and when trying to get support for it sent at least a dozen emails and got nothing but RUDE and meaningless answers. I was finally told if I didn't buy DIRECTLY from Wansview they did not offer support. If you use a Mac and want to do QuickTime FORGET this camera. Forget any meaningful support as well!", "Date": "October 5, 2012"}, {"Title": "A great product! Quality video and nice function", "Author": "wired on cool stuff", "ReviewID": "RATC78W7WF1RQ", "Overall": "5.0", "Content": "I am amazed by its clarity of video. It takes some time to set it up and get it running and I hope later on this product will be easier to configure.But so far, this a great video monitoring product especially for the price. I highly recommend it.", "Date": "May 29, 2013"}, {"Title": "Avoid - cheap camera - few features - poor quality", "Author": "james_m", "ReviewID": "R3KIJYNKJNQN54", "Overall": "1.0", "Content": "I bought 4 of these cameras and 2 were defective out of the box.  One camera just spun around and around continuously amd never loaded it's own firmware.  Could never connect to this camera.  The second defective camera allowed me to login and change all settings, but gave me a connect failure message whenever I tried to view video.  I reset the camera several times but was never able to view video.The other two cameras worked.  But the settings and fearures on this camera are very limited.  It is very cumbersome to use with the limited options.I have several Trendnet cameras and they are a joy to use because of the features.  But they are not 720p so I took a chance on this camera.  What a big mistake.  I cannot recommend this Wansview camera.And now the reseller wants to charge me 25% restocking fee to return these cameras.  I will be giving the reseller that sent me these cameras an equally poor rating.  My order was unfortunately not fullfilled by amazon.  I have never had so much trouble returning items purchased from amazon.  I am very disappointed with the entire experience.Update 5/4/2012:  a third camera is now defective within one week of receipt.  It previously worked, but when I turned it on today it just spins round and round like one of the previously defective cameras. Waiting for a-z claim resolution with seller from amazon.  All cameras received with V1.4.0.1.5 firmware.", "Date": "April 30, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005JU9TXA"}}