{"Reviews": [{"Title": "All Things Considered, an Amazing Camera", "Author": "Informed Buyer", "ReviewID": "R2I5LL5VM27FSP", "Overall": "5.0", "Content": "I've had many different digital cameras, but this one has rapidly become my favorite in most respects.Camara Body and FeelIt is very small and comfortable to hold.  It feels sturdy and well-built.  All of the buttons are solid to the touch.  Changing lenses is simple and fast, and it comes with an attachable flash.The Menus/InterfaceThe interface is mostly easy to use and understand.  It will take a little time to get used to, but it shouldn't be too much of a hindrance.  There are only a couple of buttons on the camera that specifically do one function.  Most of the buttons are assignable, so you can quickly get at the options you use most.Image QualityStunning.  Unless you're a professional who is used to cameras that cost several times as much as this, you will be impressed at the image quality.  The large sensor allows for a lot of fine detail and really helps when there's not much light.  The low-light capabilities of this camera are absolutely amazing.  I can take clear photos in situations where all of my other cameras would require a flash or tripod to prevent blur.  I'm a big fan of unique lighting, so this is very important to me.LensesI bought the one with the fixed 16mm lens, however I've also tried the 18-55mm zoom lens.  The 16mm lens is surprisingly wide for the only included lens.  Its very small, and I'll use it primarily for its portability and situations where I'll be focusing on something other than photography.  The 16mm lens doesn't have SteadyShot.I fully intend on buying the 18-55mm lens.  I borrowed one and immediately fell in love with it.  Its substantially more bulky, but its much more versatile.  Full zoom on close subjects allows for a very good macro as well.  I'm anxious to see how the upcoming macro lens will improve on this.  This lens does have SteadyShot.Improvements Over Older ModelsIf you own the NEX-3 or NEX-5 you probably won't need to get this new one.  The C3 has a small edge in several areas including resolution, low light capabilities, battery life, weight, size, color depth, and general image quality.  Yes, that's a long list, but they are all minor improvements.  The only real advantage of the older NEX-5 is that it takes 1080p video rather than 720p.This is an amazingly functional little camera which takes surprisingly high quality photographs.  Its lightning fast and extremely good at what it does.  I would recommend this camera without hesitation to anyone looking for a prosumer/mid-range camera.", "Date": "August 22, 2011"}, {"Title": "what a wonderful camera", "Author": "MS", "ReviewID": "R15PJZR0XEHA8H", "Overall": "5.0", "Content": "First let me say that I was an advanced point and shoot person just looking for better pictures, no more and no less. No, you do not need the Sony Nex 5N camera.  The C3 is wonderful.  Absolutely beautiful pictures.  You CAN NOT get the depth of field, and the proper shadows that should be in pictures when you shoot normal people in a point and shoot camera. You need a full size APS-C sensor that is in the DSLR cameras but at a fraction of the size of these big cameras. The color and flesh tones are amazing. The richness of colors of the things in the backgrounds are so accurate. This camera uses easy to understand menus on the LED screen making this camera ideal for those afraid of stepping up to a full sensor camera. You do not have to know what an F stop is, an aperture, or what shutter speed to use to get great pictures. Just set it on automatic.  This camera is so accurate in its picture taking.  In low light you will get pictures you can not believe. This camera has so many in camera filters to play with if you want. Most things in this camera work with easy sliders.  For example you can increase the brightness of the picture you see in the LED screen by just turning the round knob to the right or to the left.  This camera has LIVE VIEW which means that what you see in the LED screen is what is printed. As you increase the brightness you will seen the picture in LED get brighter. When you you actually press the shutter button you will get this exact snapshot that you see in the LED. Point and shoot people, don't be afraid to buy this camera. For me picture quality is everything.  Skin tones with depth is a must.  This camera has it all. Its a Geeks dream camera. For those that want more advanced features with manual setting you have this also.", "Date": "November 1, 2011"}, {"Title": "AMAZING CAMERA!!!", "Author": "M. Kearl", "ReviewID": "R1W0NBJTZR41O1", "Overall": "5.0", "Content": "So I bought this camera last week and took it on a 5 day trip to Arches, Bryce Canyon, & Canyonlands Nation Parks. It was great! We took video, pics, and everything. I sold my Nikon D80 and bought this and between the two, I think the photos are much nicer on the NEX C3. My only gripe is that the battery could last a little longer. I bought a big 16GB card and I have to charge the battery about 3-4 times in order to fill the card now. So it would be nice to have a little extra juice on the battery.The camera is super small. I read all kinds of reviews, watched videos, etc.... but was not ready for how small it was once I held it in my hands. I have pretty big hands and it was a little weird to hold because of it. It wasn't a deal breaker by any means, but something to be aware. It is tiny. The weight and main bulk of the camera is the 18-55mm lens that comes with it, and not the camera body.I've gone back and reviewed the video and photos I took. I can't say anymore how much I have fallen in love with the camera. There is just so much quality and value in this machine and I will recommend it to anyone in the market for something. I sold my HD camcorder and DSLR, then bought this which replaces both with shining colors. I am pretty excited to continue using it during the next few weeks to learn more and more about it. Again, excellent purchase and highly encourage those who are thinking about it do just buy it. They won't regret it.", "Date": "August 15, 2011"}, {"Title": "Excellent Camera", "Author": "Amazon Customer", "ReviewID": "R2S9NTK8T3YWL8", "Overall": "5.0", "Content": "First things first: I am not a professional photographer by any means. Photography is a hobby of mine and I love taking good pictures. I also like my camera to be fast, flexible, be small enough to carry around and easy to operate for my family members. Many cameras give up in the first two areas (fast and flexible) and the few who make this cut end up being digital SLR's that fail in the remaining areas (bulk and easy to hold/operate).When Panasonic (followed by Olympus) introduced the new micro-four third's format I jumped in only to be disappointed by the Panasonic GH1. Based on the initial reviews (and the bunch of noise) I was very optimistic about the NEX-C3 and purchased it as soon as it was available on Amazon.  I have been playing with the camera since a week and I can say perhaps Sony achieved what I think is the holy grail of camera design. This is a really small (really really small) camera with an SLR size sensor that is very fast and takes excellent pictures. The user interface is also one of the best I have seen in recent years with complexity hidden in a natural and progressive manner. The video mode has auto-focus feature which is incredibly important (and how many 1080P SLR camera's lack). On that point, the one \"feature\" this camera lacks is a 1080P recording (it does 720P). To me that is non-issue as I have yet to figure out why any non-professional would ever worry about 1080P.  Highly recommended. 5 stars.", "Date": "August 15, 2011"}, {"Title": "Sony NEX-C3 vs Sony NEX-5N", "Author": "Ali Julia", "ReviewID": "R156J4VMRJ0M82", "Overall": "4.0", "Content": "I first purchased Sony NEX-C3 and liked  many things about it, but two problems caused me to trade it in for Sony NEX-5N, which addressed those problems.My main issue with C3 was seeing the LCD screen in the sun. SONY will have an OLED high resolution view finder for NEX series in November 2011. However the mount on the OLED electronic viewfinder is only compatible with NEX-5N and is not compatible with NEX-C3.Update: I now own the OLED view finder. Love it. For more details you can see my review of it: http://www.amazon.com/review/RXNWAESUUHR49/ref=cm_srch_res_rtr_alt_8The second issue was ability to easily override the automatically chosen a focus point.  NEX-5N has a touch screen which allows one to point where the focus should be, and sometimes this allows you to compose a photo which focal point off-center (automatic focus has a strong preference for items in the center).Both cameras have identical body size, weight,and feel.  They very light and small, but not so small that I find them uncomfortable to operate. All buttons and control feel well made.Both cameras have excellent low light performance. I love the sweeping panorama feature which both camera have, I don't feel I need a very wide angle lens due this feature. It performance fantastically in low light. I have shot hand-held sweeping panorama of New York skyline that are crisp.By twicking options that are visible I was able to make the UI easy to navigate. The most helpful setting was \"Big font\" under Camera options. Not only did it make the text easy to read, it removed a larger number of least useful icons which de-clutters the display.Overall, this is a good camera.  I outlined the two things that made me switch its bigger brother, but otherwise I found them equivalent in my experience.  I found both of them to be a good substitute for my DSLR when I travel.Ali Julia review", "Date": "August 21, 2011"}, {"Title": "Perfect step up from a point-and-shoot", "Author": "Eliot Pooh", "ReviewID": "R3T4P3H0B6WZMG", "Overall": "5.0", "Content": "I have been wanting to upgrade from point-and-shoot to a more advanced camera that would turn out professional-looking photos, and so far, I have been extremely pleased with this camera. Like other reviewers have said, the photos turn out great in the auto mode, which is great for people who have just upgraded from point-and-shoots. However, if you are willing to fiddle with the various adjustments you can get very creative results.I have been extremely satisfied with the camera's low light performance; I was slightly bothered by the fact that the flash was detachable before I bought the camera, but have since found out that I practically never need it, unless I am shooting in near pitch dark conditions. This camera does not at all need flash in lighted night streets or indoors in incandescent lighting. In dark settings, the camera can usually see better than the naked eye.I am a big fan of the display and overall ergonomics of the camera too. At 921k dots, the display is the highest resolution display I have ever used on a camera and the whole body of the camera along with the lens feels truly premium.So far, I have only two gripes with the camera:1. The display seems to be easily scratched. I went on a trip to a beach with it and immediately managed to scratch it. I would advise getting a screen protector.2. I am a big fan of the Sweep Panorama feature on Sony cameras, and I like how the NEX produces much higher resolution panoramas than Cybershot point-and-shoots. However, it is significantly harder to take a relatively flaw-free panorama with the NEX than with a Cybershot. The panorama on the NEX is very sensitive to speed and requires a good amount of light to work well. It is also super noisy!Other than these two points, I love this camera.", "Date": "February 8, 2012"}, {"Title": "Love it!", "Author": "K. Dickerson", "ReviewID": "RW10WZ2XRC9J6", "Overall": "5.0", "Content": "I debated a while between this, the Sony Nex 5n, and the Canon t3.The better video on the 5n just didn't seem worth the extra $150 price tag since the main thing I want it for is pictures (never mind the clicking problem on the 5n when taking video).  From all the pictures I could find comparing the two side by side it seemed like they had just about identical picture quality.  Having a touchscreen on a camera may make navigating the menu's slightly easier, but really wasn't make or break for me.  Also, I can never remember a situation I really needed 10fps speed instead of 5fps(let alone any time I've ever really needed 5fps) so.... goodbye 5n.Ended up picking this over the t3 mainly due to the sexy form factor.  One of my buddies has a t3i, and I very much prefer this over the form of the t3i(t3i and t3=same form factor but different materials).  Especially when you consider how much more versatile the c3 can be over the t3 when you attach the 16mm wide angle lens instead of the 18-55mm lens.  It basically turns into a great P&S; size camera.  From doing side by side tests, the picture quality of the t3 beats out the c3 by a tiny bit.  So if you want the best picture quality possible from a camera for the lowest price, and are not worried about anything else, the Canon t3 cannot be beat.  But in the end, I really would prefer to have a camera that I love to carry around and attach different lenses as opposed to one where you can notice the difference in picture quality when you zoom way in on a photo to inspect tiny details.I do not regret my decision at all.  The picture quality is spectacular, I love the form factor, and the versatility of the camera is amazing!  I've had two different point and shoots in the past few years, the Sony hx5v, and the canon elph300hs.  I took a few shots when I first received this camera, then loaded them onto my computer and was blown away by the difference in quality from those to this.  I was also pleasantly surprised by the video quality, the 720p looks great and the sound is much better than I expected.So, overall, great job Sony!  Keep it up!", "Date": "January 31, 2012"}, {"Title": "Great camera for new parents!", "Author": "SunnySideUp", "ReviewID": "R9ZZ24JPFN110", "Overall": "5.0", "Content": "I have to admit that I am no photography expert and up until this camera I never bought a camera for more than $200 all point and shoot. They served me well, mainly outdoors. When my son was born, since most of our pictures were taken indoors (we live in Seattle and he was born in the winter so add gray, cloudy indoors...)we really wanted a camera that produces great pictures in low light and other important features were continues shooting (babies dont pose or stand still) and great video. We seriously considered buying a DSLR but we really didnt want to carry all that weight around and we figured that we wouldn't really use any of the manual capabilities of the DSLR (we use cameras on one mode- automatic :-))We basically wanted a camera that would fit in the diaper bag and produce great images with its automatic mode. I have to say that I am glad we found one. This camera is GREAT. The pictures are amazing, even in low light colors are great, pictures are super sharp and the continues shooting allows us to capture every smile and new movement with clear sharp images. Video is great too- speakers are great and you can zoom in and out while shooting. The flash is a little bit of a pain (since its external) but we attached it to the camera strap and it attaches to the camera with a small easy plug. I have to admit that up until now after using the camera for a month I took amazing pictures- both in and out doors, both night and day shooting and didnt have to use the flash even once. As I mentioned, we keep the camera on automatic (its calls \"smart automatic\"- and up until now it detected conditions accurately 100% of the times)but it does have a pretty wide menu with a lot of creative options (we did use the panoramic shooting a few times). The menu is not super easy or straight forward and we did read the manual that came with the camera in order to figure out where everything is, but I guess the fact that everything is inside the electronic menu is a compromise you have to live with if you are looking for a small camera with no buttons to add bulkiness. Its not super small but fits nicely in small bags and is very light.One thing I am not super happy about is the lens which is only 18-55 - its great for indoor use but outside I would have liked a little more zoom. I looked and a bigger 18-200mm lens costs $800.... I guess we are saving up for a lens.Bottom line- great camera for compact shooters looking to upgrade to a DSLR like image quality (or as close as you can get) but don't want the bulk or complication of a DSLR.", "Date": "September 12, 2011"}, {"Title": "AMAZING!", "Author": "Roswell Vixen \"}i{ Roswell Vixen }i{\"", "ReviewID": "R3O3C4KNZVIFC4", "Overall": "5.0", "Content": "Now, by no means am i a \"professional\" photographer so i dont know the technical terms for many things and i dont understand all that much how fancy DSLR cameras work. However, i wanted to get a really nice camera that took fantastic photos because i AM interested in photography, just not to the extent of having to deal with the giant DSLRs and their seeming complexities. I was almost out of hope in finding something up to par with DSLRs without actually BEING one, when i happened to stumble upon the Sony Alpha NEX series of cameras and i was intrigued to say the least. I went to Best Buy and tested them out after testing out another Nikon camera that i really disliked. The Sony Alpha NEX's were compact enough to not be bothersome lugging around and packed a big punch in quality of photos, AND they had DEPTH OF FIELD. So after contemplating on whether or not i was ready to drop that much on a camera, i gave in and bought it yesterday and all i can say is WOW. I tested it out on my 5m old daughter and the pictures are just stunning! the depth of field really makes the pictures look professional and i am now so excited to find ways to use this camera any chance i can get! itll take me some time to figure out all the functions but for what ive figured out just fiddling with it so far it is already worth the money. Im so glad that i have a good, quality camera to document my daughter as she grows and just memories throughout my life now. This camera has brought my creativity back out and it's only been a day! I cant comment on how long lasting it is obviously, i'll have to come back as time goes on and add to this review, but from what ive seen so far it seems very very well made and like itll hold up for quite a few years. it is a little noisier than im used to with digital cameras but not so much that i mind. I am now looking forward to purchasing the other lenses and accessories for the camera to further explore all that it can do. The menu of the camera is alot different than im used to as well. there are less physical buttons on the camera, alot of the usual options on standard point and shoots are taken off the camera and put in subfolders in the menu which you control by the dial/circle button. this might frustrate others but i dont find it too much of a bother so far.all in all this is a fantastic camera for those of us who are not professional photographers but would like a more simple, great quality camera thats about on par with a DSLR. It may be small but big things come in small packages as they say and this camera will definitely impress you!UPDATE!: Ive had the camera for about 2 weeks now and i LOVE IT sooo much! ive figured out alot more things on it and am getting more used to working with the lens and focusing. I took my daughters first christmas pictures with this and they were amazing. some shots were just really great regular pictures but some, when i got lucky playing with it (since im still learning :P ) looked like they were taken professionally! im going to add the best ones on here so you can check them out.Update #2: well, its now been a few months (feb 18th) and the camera is still going strong and amazing me more and more. i recently purchased a photography background kit with the muslin backdrops and lighting and am now having even more fun using this camera. still havnt bought another lens yet, kinda hoping itll go down in price for a good deal first but im hoping to get the 55-210mm lens by summertime for when i take my daughter to the zoo (she'll be able to enjoy it more this year since she was only a couple months old the last time i took her) and i cant wait to see what kind of shots i'll get there!there is one thing ive found about the camera that does bother me though... on my old canon P&S; i had the option to have a timed multi-shot of which i could chose the number up to 10 of consecutive photos taken after a certain amount of time (that i could also choose) and unfortunately on this camera i can only take 3 pictures in 10 seconds and it goes so fast all 3 pictures are practically the same. what a bummer! i LOVED that feature on my old camera. but, for how great everything else is, i can deal with that.p.s.- i noticed some people complaining about focusing on the camera, when the auto focus isnt quite getting the shot you want, lightly hold down the button just enough for it to focus before you press all the way to capture the shot. itll find the object you want focused on and either capture everything in the picture clearly or blur the background and just have the object clearly shown. ive been doing that and getting excellent results! im sure all the pros already know that but for those who are unaware i thought id share that little tip.", "Date": "December 18, 2011"}, {"Title": "Love this camera", "Author": "dnjake", "ReviewID": "R1IG3VHYYDNFVW", "Overall": "5.0", "Content": "I have had the camera less than a week.  But it is more of a step forward than I exepcted.  The 16mm lens fits my needs.  Previously I used the Sony R1 and almost always used the lens at its widest angle zoom.  Clearly this kind of lens does not meet all needs.  But for pictures that are intended to capture a scene, this lens is far better than the 18 mm zoon.  My prior experience is with the R1 and the Canon 17 40 L on a 10D.  The quality of the lens on this camera compares quite favorably.  There is some chromatic aberation in harsh lighting.  But CA does not seem to be as much of a problem as it was with my previous lenses.  Reviews of this lens have generally not mentioned flare.  It is one of the biggest problems with wide angle lenses for anyone who likes to capture backlit images.  I expected flare to be a big problem with this camera because it does not come with a hood.  But, I was surprised to find that flare is not a problem unless the sun is actually in the image.  The other impressive feature of this camera is its dynamic range.  As pointed out in the review in DPReview, even when highlights are blown out, the sensor preserves enough information to present the higlight more or less as it would normally be experienced rather than as the completely white featureless blob my prior digital cameras have produced.  Not having a view finder is a bit of a negative.  Particularly when shooting toward the sun, it is very diffcult to see anything on the LCD.  The power required for the LCD is probably the issue with the battery.  All in all this camera is easy to carry around and, for the kind of images I am interested in, it significantly outperforms equipment I paid four times the money for.", "Date": "October 25, 2011"}, {"Title": "Really great SLR alternative", "Author": "West Coast book lover", "ReviewID": "RYLJEOWZ18M9O", "Overall": "4.0", "Content": "Bought this camera as a step up from a Point & Shoot digital camera. I was a dedicated film photographer and never fully made the transition to digital. This camera works on so many levels:* superior low-light photography -- I never need a tripod or the flash (tho I sometimes use the flash for fill-in lighting).* an easy \"automatic\" mode that recognizes the conditions of the shot and compensates accordingly (e.g. landscape, bright backlight, hand-held in low light)* interchangeable lenses if you want special effects like super wide angle, fish eye, or extreme macro.* light weight* files in RAW or JPEG or both; let you edit pixels as much or as little as you want.* movies recorded in either MP4 or the Sony proprietary format.Colors were a little bright in the viewfinder (a problem with a lot of digital cameras), especially the blues and reds, but they looked fine on a computer screen.", "Date": "February 19, 2012"}, {"Title": "NEX-C3 offers professional photography for dummies", "Author": "S. Yoneda", "ReviewID": "RONGGTM447ZF1", "Overall": "5.0", "Content": "I reluctantly purchased this camera at my wife's insistence because she wanted to take high quality memories of our daughter while she was still little.I initially balked because:1) I felt my existing standard point and shoot digital camera was more than sufficient2) I wasn't confident enough in my photographic abilities to be able to fully maximize a high power cameraIn short, the NEX-C3 has shattered my initial skepticism and exceeded all expectations.The photos/videos are of such high quality and the camera is so easy (and fun) to use that we find ourselves taking more opportunities than before to use the camera. It's different shooting features also lets the most amateur of us to take very creative pictures.A few neat shooting features...Panorama shooting is ideal for siteseeing, large events and the great outdoors (let's you capture the full essence of what your photographing)...Color \"pulling\" shooting lets you take everything in gray while simultaneously capturing just the green or blue or yellow or red in a shot (we took a neat picture where we \"pulled\" just the red from our daughter who was wearing a santa hat and playing a red piano...good reviews from our friends and family as we used the picture for our christmas card)It's also pretty light which I've been told is due to the fact that the NEX C3 is a mirrorless camera (not sure what this means but same or better performance at lighter weight is a win in my book).As for some of the shortcomings, the lens is 18-55mm meaning that you're not going to get 30X zoom. That said, practically for the most part, I don't find myself needing any more zoom than it already has but this might be an issue for some (you can purchase lens with more zoom).Also, there is no view finder (peep hole) but I think this is more a personal preference issue and I'm fine using the high resolution display.Overall, I highly recommend this camera to the general masses.Camera veterans may prefer something used more by professionals but for those who want to easily take high quality, creative pictures of your families, vacations, kid's soccer games, etc. this is excellent bang for your buck.", "Date": "January 3, 2012"}, {"Title": "Best in Class", "Author": "Derrick", "ReviewID": "RI0OUMYFFXC8T", "Overall": "5.0", "Content": "I was looking for my first real good camera (non point and shoot) for an upcoming trip to Spain and France.  I looked at the NEX and the 4/3 cameras such as the GF3, EPL-3, etc.  This one seemed like the best deal and was the best reviewed because of its large DSLR sized sensor and the small body.  It seems like the 4/3rds only excel in lens quality and selection.  But you can get adapters to run on the NEX cameras to run more higher quality lenses.  I figure that it's easier to upgrade the glass on a camera than upgrade the sensor.I opted for the 16mm pancake lens since I think the 18-55mm is way too large for the body and that defeats the purpose of the small NEX to me.  I'm extremely pleased with the photos, particularly in low light.  I posted some here on Amazon but you can find more here:These are just straight jpegs from the camera using the iAuto mode for dummies.  I do also save the RAW but have yet to learn how to properly process them.  I also bought a Sandisk Extreme III 32 gig card for it, it can take about 1400 RAW+JPEG photos and several hours of 720p video with this.Another reviewer was disappointed with the battery life but I have not complaints.  On the first full charge I took almost 400 jpeg+raw pictures, a couple panoramas and a video, along with plenty of reviewing of pictures on the LCD and still had 18% battery life left.", "Date": "August 21, 2011"}, {"Title": "AWESONE CAMERA for my budget!!!", "Author": "hahn", "ReviewID": "R2O6GM8DSHJ3ZV", "Overall": "5.0", "Content": "If you like to have those great pictures with the DSLR quality in an instant click then YOU should buy the SONY ALPHA NEX Series... As for me, my budget together with this camera's features goes along together so i got a C3! Never have a doubt on SONY ALPHA NEX- C3! GO BUY IT! Get 5N if you want it with a touch screen but it really doesn't matter since the camera's buttons are so easy to use and you'll never get lost in operating it.It's very handy and every person who sees it is amazed to its miniature size and POWERFUL capabilities!", "Date": "February 24, 2012"}, {"Title": "Sony C3", "Author": "Linda Portnay", "ReviewID": "R3560ZP5TEC9J2", "Overall": "5.0", "Content": "Lovely \"little\" camera.  Not a pocket size but sure functions as a big camera. Comes with flash which is needed for low light situations.  No problems since owned past 6 weeks. Would highly recommend.", "Date": "October 26, 2011"}, {"Title": "What a great little six shooter...", "Author": "Wingdinger", "ReviewID": "R2HGE7LWPRHKN4", "Overall": "5.0", "Content": "This camera is my upgrade from a Canon point-n-shoot. I wanted an ILC, but without dealing with the learning curve of a full size DSLR.  My previous cam was actually great for it's specs, but like all point-n-shoots, it suffered in low light. This camera is phenomenal! Love the slap of the shutter, sounds like a big boy camera.  ;)  Controls have a learning curve, but they're actually very good once you get used to them. Video quality is excellent, but the built-in mics leave something to be desired. I have ordered the external array, and have yet to test it, but other reviews have stated it is a considerable upgrade. Build quality of the camera is fantastic. I wish the screen were a tad bigger, but it's a great screen the way it is. I also wish the accessories were cheaper...", "Date": "August 20, 2011"}, {"Title": "Just bought it, but I am not sure now", "Author": "goldbond", "ReviewID": "R146MWJO7BDOFY", "Overall": "3.0", "Content": "I just bought this camera and was really excited about it.  Love the feel and the light weightI only have it a few days but I found a couple of things that I am going to have a hard time getting used to.I attempted to take pictures today in bright sunlight and could not see anything on the screen, horrible.  I was actually takingpictures without knowing what was on the screen!Battery life is making me worry, after taking maybe  20 photos it  is down to 87%,  with my Canon rebel I couldjust keep on shooting and the battery charge lasted forever,Finally I decided that this camera  would be better with a view finder  for my needs,  but I found that  The price of theviewfinder is way to expensive after spending this much on the camera I would prefer to put that extra money into another lense..Right now I am beginning to feel that I am using a cheap point and shoot camera.  Seeing the settings on this camera in sunlightis also impossible, right now I am not liking this camera.", "Date": "June 28, 2013"}, {"Title": "great camera", "Author": "discofighter", "ReviewID": "RC2SPL18PQE6P", "Overall": "5.0", "Content": "I've had this camera for over a week now and use it at work to take photos of our products and just for fun.  I use the 16mm wide angle pancake lens, it works just fine.  If you want to avoid exaggerated perspective however (wide angle), I recommend using the bigger lens/zoom lens.  What I mean by exaggerated perspective, is that whatever is closer to you/your lens looks a lot bigger and the things further away look smaller than they are.  The quality is pretty awesome, and it's better than my old nikon dslr d50.In terms of everything else, photo quality, mobility, lighting, and options, I am very satisfied with the outcome... I have two gripes however, and it is that you need to download Sony's RAW imaging converter to process or even preview RAW images.  It wasn't the case before with my Nikon RAWs. This is annoying because if youre away from your primary computer, you cannot use the RAW images on another computer that doesnt have the software... which means you to download this software to all of your computers (annoying). And lastly, the battery dies like no other, especially if you didnt update your camera's OS.  Make sure you update the camera's OS so the battery doesnt die while you have it off... it does that if you didnt.  That's the worst part about this camera, is the battery (not a deal breaker tho) but i guess that's the price you pay for a new species of camera; a small compact, highly mobile high definition camera.  Oh I also forgot, my old dslr came with a memory card, but this one you have to buy separately which is also annoying (unless you buy the package i guess)", "Date": "May 3, 2012"}, {"Title": "amazing camera", "Author": "micky54", "ReviewID": "R3NG8W2L1N86PT", "Overall": "5.0", "Content": "This camera is unreal.  That being said, I'm coming from very good point and clicks and my iphone camera.I wanted to get a DSLR but was a little intimidated.  I picked up one of my friends and realized how big it was and how I couldn't figure out how to take a picture.Enter Sony.I read the review on Engadget which said this is one of the few nearly perfect products they've reviewed.  They said they were considering buying one for every member of their staff.So I bought this camera and took it on vacation.  Every picture is amazing, from sunsets over the ocean (which I took from a moving boat) to pictures of flowers, its just incredible.  Definitely get the 18/55 zoom kit, it's all about the zoom.In fact it's so incredible that I returned it for the next model up, the NEX-5N.  No particular reason, I just needed more.  I guess NEX 5N has a touch screen which I like.The only thing I could improve on is that I'd prefer a manual wheel for picture modes as opposed to going through the menu.  Whatever, I'll get used to it.This is also much better looking than the competition.Finally I have a way to be artsy and lazy at the same time.", "Date": "March 8, 2012"}, {"Title": "Fantastic Camera !", "Author": "Mashinkun", "ReviewID": "RFBE6UKRZZW7I", "Overall": "5.0", "Content": "Got this camera to replace my old Sony A200. Wanted something that offers some of the perks of a point and shoot & DSLR size sensor.  Very happy with the purchase. Getting the EA-1 adapter soon so I can use my Alpha lens on the NEX. Would recommend this camera to anyone who's looking for something that's easier to carry around, and still allows you to take excellent photos.", "Date": "February 20, 2012"}, {"Title": "Point-n-Shoot Ease with DSLR quality and options", "Author": "R. McDonald \"Wears Scrubs like a Pro\"", "ReviewID": "R113CCOT73YD5I", "Overall": "5.0", "Content": "I needed a better quality camera that could work well in the low-light conditions my last two point and shoot cameras had difficulty with. I wanted more options so I could learn more advanced photography without murdering my wallet or carrying a backpack of camera supplies everywhere. The Sony NEX-C3 definitely lived up to the task.Pros over standard P&S;:-Very high quality files with options for RAW files.-Works incredibly well in low-light conditions.-More P&S; options than the other P&S; cameras I've owned (a nice Lumix and that Samsung with the front LCD).-DSLR-style manual options available.-You can change the lense, add/upgrade flash and microphones, and it accomodates filters.Cons vs. standard P&S;:-Longer if you are using the zoom lens so you may need a bag for it.Pros over DSLR cameras:-Smaller.-Lighter.-So very much cheaper.Cons vs. DSLR cameras:-It's not a true DSLR so some of the options and many of the lenses/accessories just won't be there.This camera was way cheaper and smaller than the DSLRs I was looking at and it works for what I need it to do (personal and sub-professional photography). I've been able to buy cheap filters to fit it and improve my photos. I can carry it everywhere without it being a chore. I still have a lot to learn about some of the advanced manual functions but the camera actually has built in guides for how they work that have allowed me to play around with a lot of the options. I'd definitely recommend it to hobby photographers that can't drop cash on a DSLR or just want something that's easier to use and carry.", "Date": "February 18, 2012"}, {"Title": "So versatile and fun", "Author": "Camerabug", "ReviewID": "R2QXLK7AM5NQUH", "Overall": "5.0", "Content": "This a great camera I also own an A55 I used it  at an air show. Anyway I love the  3D  panoramic and the interchangeable lenses it's a great camera if you don't want to burden yourself with a DSLR.", "Date": "September 6, 2011"}, {"Title": "Fantastic camera for the price, good entry or upgrade.", "Author": "John Clawson", "ReviewID": "R4ZKVYODLXUYL", "Overall": "5.0", "Content": "I'd call myself a technically-minded amateur photographer. I bought the NEX-C3 when it came out because I was looking for something with good image quality and the option for full creative control (more on that later) without the size and conspicuity of a DSLR. Overall it exceeded my expectations and I have taken thousands of great pictures with it.The highlight of the camera is its APS-C sensor, which has two major benefits for any photographer. First, it allows each pixel sensor to be larger, catching more light and allowing the camera to perform much better in low light than any compact camera or similarly-priced Micro Four Thirds camera. The other major advantage is the control it offers over the depth-of-field, which is the zone in the picture that's in focus. To get that nice pleasing professional look in a picture, a shallow depth of field is often necessary. A large sensor is critical to getting a shallow depth of field at wide apertures.Many people are unhappy with Sony's NEX line for the cumbersome menus, which is a valid complaint. They're not quick to navigate. However, Sony makes it easy to set up custom shortcuts to the functions you need most, and after getting those right, I hardly ever needed to touch the menus. It will take getting used to if you're coming from a DSLR with more physical dials, but it's very workable and quick when you get it configured the way you like.If you have a collection of old manual lenses, this camera is a great affordable digital back thanks to the focus peaking and live preview! I've used it with a few Canon FD lenses with great success.The JPEG processing in the camera isn't the best, so shoot RAW and you'll be very happy with the output from the camera. Shooting RAW will also give you the ability to pull a lot of detail out of the shadows, which this sensor is great at capturing.PROS:+ Great image quality, esp. RAW+ Small and light+ Stereo mics built-in for video+ 5fps burst mode+ accurate auto white balance+ kit lens is quite good for the price, stabilization works great+ tilting screen is awesome.CONS:- not as flexible as advanced shooters will want- video quality isn't as good as the more expensive models in NEX lineup.", "Date": "November 26, 2012"}, {"Title": "Low light performer!!!", "Author": "Jaguar", "ReviewID": "RY5200P0TD2AL", "Overall": "5.0", "Content": "There is no need to talk about the specs of the camera as many have done it already. This review is all about my personal experience and thoughts.I came from point & shoot and had been thinking for years for better picture quality especially in indoor and low light but not to carry the heavy DSLR. I am glad I picked this camera, the best about it is, it takes excellent pictures on par with some DSLRs and you do not need the flash at all under any lighting conditions!! Whatever you see in dark from your naked eyes, it sees better!Before the purchase, I was debating between the C3 and 5N. 5N is slightly more expensive and it has 3 features attractive to me: the touch screen focus, better shutter lag, and the 1080P video recording. The deal breaker is, all these features I can live without, but the fact that 5N has the clicking sound in video recording is completely unacceptable.Also for 720P vs 1080P, video quality depends on many factors, please do not expect blue-ray quality here from 1080P, movies from Blockbuster DVDs (480P) have better quality than any home camera's 1080P. In this case, the difference between camera's 720P and 1080P is at most slightly noticeable, and I doubt you can tell it. Even from online forums, people have asked this question many times and there has been no clear answer yet.There is only one issue with the camera, as some mentioned, it does slowly drain battery even when it's shut. Mine loses about 2% or 3% a day, not too bad, I can live with it. Hopefully Sony will have a new firmware to fix the issue. The firmware on mine is Ver.01, and the latest is Ver.02 from almost a year ago. I didn't go for Ver.02 because I am satisfied with the current and the benifits in Ver.02 do not interest me.Update on 12/20/2012:After several rounds of recharge, it is much better on the battery which does not seem to drain any more. I am very happy!", "Date": "November 10, 2012"}, {"Title": "Fantastic Camera!", "Author": "mommy2two", "ReviewID": "R2KIHC7IV658PA", "Overall": "5.0", "Content": "I'm not a professional, just a mom who wants to get great shots of her kids. Right out of the box on Auto, this camera is just amazing! It takes crisp photos with great colors in low light, bright light, indoors, outdoors! I'm just sorry I did not get it sooner.", "Date": "August 29, 2012"}, {"Title": "Awesome camera and quick delivery", "Author": "Suzanne", "ReviewID": "RS7KSY51RI0K2", "Overall": "5.0", "Content": "This camera is great. I got the camera very quickly when ordering it. It shoots wonderfull in low light and the images are crystal clear. The picture effects mode is my favorite. It allows you to photograph in so many new ways that the average camera does not. I rate this five stars!", "Date": "June 4, 2012"}, {"Title": "Great camera, great price.", "Author": "ryan ogborn \"Ryan\"", "ReviewID": "R21OJ42EKZYR14", "Overall": "5.0", "Content": "By far the highest quality of all the low-mid range compact interchangeable lens cameras. Excellent picture quality, sensor and body. Olympus and Nikon models feel like \"cheap\" plastic toys after using the NEX-C3. Pre-ordered this model last year (June 2011) and I am very pleased with the investment for the entire year that I've had it.", "Date": "May 17, 2012"}, {"Title": "Greatest camera ever", "Author": "B. Nelson", "ReviewID": "R209IEZV5FNU7P", "Overall": "5.0", "Content": "I have been a Sony alpha user for many years. This new compact camera is just fantastic. Every feature I want and more in a much lighter and more portable size.  If anything, it's easier to use than most SLRs, smarter than I am and more flexible than most cameras.  I do miss a full function view finder in the bright sun,but other than that, this is a total hit.", "Date": "May 15, 2012"}, {"Title": "Best in its class", "Author": "the dude", "ReviewID": "RK7WDLR0B07D0", "Overall": "5.0", "Content": "I am moving up from a point and shoot, and I really love that this camera can still do that when needed. You can leave it on \"intelligent auto\" and hand it to anyone just like a point and shoot. With the small lens on it even fits in your pocket.But when you want it to, it becomes as capable as a full size SLR. The full array of manual controls are there as you learn to use them. My favorite feature is that as you scroll through the menu options, it gives short explanations of what things are and why some may be unavailable. The panorama mode is really slick, and the art filters allow for some nice effects without needing photoshop. The overall performance of this camera is excellent, it has a full size sensor and much larger lenses than comparable micro 4/3 based cameras. Its only weak point is lens availability, but more are popping up rapidly.", "Date": "April 29, 2012"}, {"Title": "Great, versatile camera!", "Author": "Rich", "ReviewID": "R2DZ3VCZSH5KV1", "Overall": "5.0", "Content": "By no means am I a professional, but I do love photography and I have taken at least 3,000 images with this since I bought it in February. I must say that I am extremely impressed with the quality of the photos that this camera puts out. The images are crisp and the although the menus may be a little cumbersome at first, it's certainly easy to get used to and much easier than most menus on any full-framed DSLR. I have loaded a few senior grad pics under the images section that I've taken and edited recently and I think that the images speak for themselves. A must-buy for camera enthusiasts and beginners who wish to have high fidelity pictures at a much lower price!", "Date": "April 27, 2012"}, {"Title": "I adore this camera.", "Author": "M. Li", "ReviewID": "R21RE6XAL9V81C", "Overall": "5.0", "Content": "I used to be a rabid P&S; upgrader - not by choice! I always hoped to find the one model that would do it for me, but would always find faults with the image quality after a few months. Perhaps my tastes kept getting more particular, or I simply didn't do my due diligence, but I became incredibly tired of cameras that take blurry pictures, fail to capture critical memories, or worst, look fine in the LCD, but are just a tad blurry on the computer screen. I've tried almost all the high end P&S; models that Panasonic and Canon offered, but had no joy. I started considering DSLRs, but didn't really want to carry around all that bulk. Then I stumbled upon this new fascinating mirrorless camera market.After exhaustive consideration of the Nikon 1 system, micro 4/3s, Samsung's NX, and Sony NEX, I went with the C3. I felt that the Nikon 1 and micro 4/3 sensors were too small, leading to poorer low light performance and detail capture when compared to the NX and NEX systems. Since I was going to haul around a non pocketable camera and external lenses, why not go for the biggest sensor? I went with NEX because it was just that much more established than NX in October 2011, and I was suckered in by the C3's pink color. I didn't consider a NEX 7 because I had no idea when it would be out thanks to supply shortages, and the price tag really threw me off. I didn't have use for the 5n's touch screen, larger grip, and 1080 p video recording, so I went with the C3 bundled with the kit lens and wide angle lens.I've taken this little beauty on family outings, friend gatherings, and a winter vacation in Europe. It's performed admirably, in terms of low light functionality and sheer richness of detail. Many times I've come home, blown the images up on an 11 inch monitor, and just gaped at the lush colors and sharpness. With its larger sensor, my picture quality blows past what I'm used to, so I'm very very happy. I can take pictures in completely dim environments, with the camera rendering detail that my eyes can't even see.This camera has turned me into a full NEX convert, and I anxiously await the arrival of more lenses. It's also turned me into an amateur photographer, as I read up on f stops and manual focusing in order to fully exploit the capabilities of this camera. I think this one will be the first to last longer than a year. '", "Date": "April 27, 2012"}, {"Title": "Sony Alpha Nex-C3", "Author": "Benjo", "ReviewID": "R26N7FVYFW0FTA", "Overall": "5.0", "Content": "To give a little background, I took a lot of photo classes when I was in college back in the early 90's with a 35mm SLR.  So I know my way around a camera and lens and how ISO, aperture, focal distance, lighting, and shutter speed all interplay.  As time went on and digital cameras got better, shooting on film got to be more and more inconvenient so I found myself shooting almost exclusively on a digital point and shoot.  From a creative aspect this obviously sucked but the convenience was just too nice.  Like pretty much everyone else in this position of being aware of how much you can do with a camera but not making your living by it, I drooled over the up and coming dSLR's but couldn't justify buying one.So.  All that said, this camera is the perfect compromise!  It is as convenient as a point and shoot when you want it to be but allows you to be creative when you feel like it also.  It uses the large format sensor that the current batch of dSLR's use so the picture quality and detail is superb.  It allows you to control as many settings manually as you want from all to none. The kit 18-55mm lens that comes with it is a really surprisingly sturdy and competent lens.  I even found an adapter that lets me use my old Pentax K mount telephoto on it (albeit strictly in manual mode.)Really the only negative thing I can say about it is that the camera body is too small.  It is somewhat uncomfortable to hold without grabbing the screen.", "Date": "April 12, 2012"}, {"Title": "Beautiful pictures", "Author": "James", "ReviewID": "R2Y6NAIR32OLEG", "Overall": "4.0", "Content": "So I am not a camera expert, and I am notorious for taking blurry photos- so I can't really comment on any of the technical aspects of this camera. What I can say is this: the clarity is absolutely amazing, especially on portraits but also on still objects. It has a good color range and can take clear photos even in slightly darker settings. I find it easy to hold, and the small flash is easy to install (although I would have preferred a built in flash, but I understand this type of camera rarely comes with one). I have only tried it with the zoom lens, but would like to try it with the fixed one too to compare clarity. I think my only complaint is that the battery sucks- even when I don't use it, it drains so fast. It may be a defect, though, so am checking with the manufacturer.", "Date": "April 5, 2012"}, {"Title": "great little camera", "Author": "Karen D", "ReviewID": "R1DOZBQUTKFN0H", "Overall": "5.0", "Content": "I bought this as a replacement for my Nikon D40.  I was tired of carrying around a bulky camera.  this little camera is great, about half the size of the d40 much easier to manage.  takes great shots too.  I am not a professional, so I can't go into details about specs, but the menu is easy to navigate and it the pictures have great color. ( I do find it sometimes over exposes, but I am still experimenting with the settings) I mostly shoot pics of my kids and the landscape.  I have yet to use the flash or video.  but overall very happy with my choice.", "Date": "April 4, 2012"}, {"Title": "Greatest Camera. take pictures professionally in a simply way.", "Author": "QS", "ReviewID": "R3J89ZVRJ16LRV", "Overall": "5.0", "Content": "Fantastic... wonderful.. but a bit use up the battery quick tho..I really enjoy it. this is a wonderful camera", "Date": "March 15, 2012"}, {"Title": "Great camera for those wanting more functions than a point and shoot", "Author": "Ross Hamilton \"Ross\"", "ReviewID": "R2G3Z5Y8BKCUF1", "Overall": "5.0", "Content": "I am writing this review because I want to help people like me make a good choice when it comes to buying a camera like the NEX-C3. Don't trust most reviews as many people will only write in to complain about a camera. I mean, not many people will write much when the camera they just bought is perfect for them and they are very happy with it. Well, I am very happy with this camera and I'll state why:Size: Yes its too big to fit in your pocket but then again I never put a point and shoot in my pocket either. It is light enough that I don't notice it in my bag and small enough to take practically anywhere.Build quality: As soon as you hold it, you know you have a well designed and manufactured camera. It looks stunning and has a good solid feel about it.Image quality: I'm no expert in cameras but I do think this camera will be an excellent gateway into the world of photography. Already I am doing things with this camera that I thought only professionals could do. Even when the auto-mode takes care of everything, the images come out great. I thought by not attaching the flash it would really hamper the image quality at night but still the images came out great.Ease of use: You can literally point and shoot if you want and the images look good. If you want to play around with the settings (its very technical but rewarding), then you will be amazing by the results. Sometimes the shire number of settings is a little overwhelming but I'm still exploring what this camera can do. Changing the settings is pretty simple but you do have to go into a library of menus to find some things...not really a big deal. Fitting the flash (an attachment included) is a bit fiddley but easy enough.I was initially tempted to buy the Nikon J1 but friends told me the sensor was way smaller than the NEX-C3 which can make a big difference. I'm glad I listened to them. So far I love my NEX-C3", "Date": "February 7, 2012"}, {"Title": "very nice camera!", "Author": "JessW", "ReviewID": "R4CMZ6NAIQ4W1", "Overall": "5.0", "Content": "it's a very nice camera. my friend recommended me this nex-c3 since she got one and she enjoys using it very much. I'm glad that I got a camera that I really like.", "Date": "February 6, 2012"}, {"Title": "DLSR Quality pictures in a small light weight package.!", "Author": "David C. Mcsloy", "ReviewID": "R1N5CED0DI7EPI", "Overall": "5.0", "Content": "This camera has a DLSR sized sensor that gives you great picture quality in a small, lightweight package. With the Sony Nex mount 2 adaptor I can use all my Sony lenses.", "Date": "December 29, 2013"}, {"Title": "great low light camera when paired up with a nice lens", "Author": "Michael Chen \"chunkychen\"", "ReviewID": "R1PXWKOUG1OWDK", "Overall": "5.0", "Content": "I love this camera- bought it earlier this year as a side camera for my Nikon D5100 that I use with a superzoom lens.  I have to say that this little camera consistently produces images that are sharper.  When paired up with the excellent 50 mm 1.8 NEX lens, this takes wonderful portraits, sharp and with beautiful bokeh (that background out of focus region) in low light.  Such a delight.  The only issues that I have with the camera is somewhat slower autofocus and a noisy shutter.  I can live with these things for the price!", "Date": "December 8, 2013"}, {"Title": "Aweome camera bought when it first came out..", "Author": "RJD \"Desroc\"", "ReviewID": "R25G7ABGSFRHX5", "Overall": "5.0", "Content": "Love this camera had it for some time now--light weight, professional photos..won't be disappointed. Only wish it had the newest tech for wifi but then how difficult is it to attach to computer e.g. I use and design shots with my iPad apps.. Easy to carry wherever you go.", "Date": "November 17, 2013"}, {"Title": "Sony", "Author": "561", "ReviewID": "RKQEU28KD1O0E", "Overall": "5.0", "Content": "Great pictures.  Need to have more lenses available.  No complaints.  Well built.  Can be used as point and shoot or total creative control.  Novice to expert.", "Date": "October 18, 2013"}, {"Title": "Little gem", "Author": "Olay E. Alvarez Ortega", "ReviewID": "R1EU3V7QCXWLOH", "Overall": "5.0", "Content": "The camera is excellent! Amazing IQ and easy to use. Low light pictures are super! I enjoy the shutter sound (don't know why!), remember me a finest camera. I would like more controls instead software adjustments but you can deal with this. 16mm lens is worthless . I use 30mm Sigma and get amazing photos (if you don't need focus speed this lens render excellent works!!)", "Date": "October 7, 2013"}, {"Title": "Great camera!", "Author": "Topaz", "ReviewID": "R259INE2G8ME50", "Overall": "5.0", "Content": "Can't fault this camera.  I bought this for amazing image quality and low light performance.  This camera definitely delivers!  However, it's the lack of affordable and good lenses that is still a problem...", "Date": "March 30, 2013"}, {"Title": "Great camera value", "Author": "DoctorJohn", "ReviewID": "R3L6Y76R3HOOV4", "Overall": "5.0", "Content": "This is a lightweight and easy to use camera. We use it with a telephoto lens and the combined weight is manageable on even the most rigorous outings. The photo quality and setting variability are great.This is a model that is now replaced by Sony.", "Date": "March 19, 2013"}, {"Title": "perfect", "Author": "Edgar Naranjo", "ReviewID": "REIC48CE2F51D", "Overall": "5.0", "Content": "is perfect. it is what i was looking for. i got it just in time so everything is fine. thanks", "Date": "March 11, 2013"}, {"Title": "LOVE", "Author": "Danni", "ReviewID": "R1FCJIX012X87C", "Overall": "5.0", "Content": "Recently my Nikon Coolpix camera broke :( It was just a regular point and shoot camera (which I loved) but I had been thinking about upgrading for a while. After asking around to friends & family & doing a lot of research online this is the camera I bought! AND I LOVE IT! I have never had anything better than a point & shoot because I was scared I wouldn't be able to figure out how to use it but this is so easy! It takes fantastic pictures & has some really fun picture effect settings you can use. I was nervous buying a Sony since I have only ever used Nikon but the cost of a nikon just wasn't in my budget this time. And I'm glad it wasn't because I love this camera! I highly reccommend this camera to a novice who loves to take home photos & wants that proffessional quality. You wont be dissappointed!", "Date": "March 11, 2013"}, {"Title": "Great little camera!", "Author": "John King", "ReviewID": "R2X9W7VA07WWDI", "Overall": "5.0", "Content": "Small, but powerfull!  A lot to like in an amazingly small package.  Great in low light, high resolution.  Easy to carry.", "Date": "March 9, 2013"}, {"Title": "not a simple point and shoot, but easy to manage", "Author": "happy shopper", "ReviewID": "R33WUXZVP99VBY", "Overall": "5.0", "Content": "There are settings to make this into an easy to use, point and shoot.  You will have to set it up properly, but the menu is fairly easy to maneuver through.  With just a click of a button, you are taking movies or clicking for pictures.  You can't take both at the same time.  The lens that comes with this package is just the standard wide angle, but if you did not purchase the zoom immediately, the picture settings that allow for a very large image size can be sized down on your computer for a more \"close up\" image.  The quality of photos is crisp, colors are perfect, and with or without a flash, lighting in a gymnasium or other indoor venue allows for some great photo opportunities.", "Date": "December 30, 2012"}, {"Title": "Excellent Camera", "Author": "Edward H", "ReviewID": "R379SMJ3QTF74C", "Overall": "5.0", "Content": "This camera performs extremely well.  Very light.  I've gotten more than one complement regarding pictures that they are of a professional level.Highly recommend.", "Date": "December 7, 2012"}, {"Title": "good", "Author": "199109090023", "ReviewID": "R22L376UPQHLMW", "Overall": "5.0", "Content": "It is so good for me ,i like it very much.It is nice, beautiful and useful.I like the colour. That's my favourite", "Date": "December 4, 2012"}, {"Title": "Great DSLR Quality Camera", "Author": "Jason", "ReviewID": "R3G96131IB17IQ", "Overall": "4.0", "Content": "My wife wanted to get a nicer camera but did not want the bulk of a DSLR.  She was settled on the Nikon 1 series from all those advertisements.  I read reviews and it seemed like everyone agreed that while advertised less, this Alpha Nex was a better camera.  In fact Engadget had a glowing review of the C3, and I think said it was a better value than the NEX-5 series.When we went into a Ritz Camera store, the associate agreed with me.  He took of the lenses and showed as the sensors.  The sensor on the NEX felt like it was double the size of the Nikon One's.  He then showed us the size of the sensors on the full sized Sony SLR's and it was pretty much the same.Having used this camera for about 9 or 10 months now, we are very happy.  The continuous shooting feature works great, and the stock 18-55 lens takes amazing pictures.  The zoom seems really weak as you are taking the photo, but afterwards, when you look on the screen or on a laptop and zoom in to the picture you cannot believe the detail it picked up and the clarity.  It takes wonderful group shots (the timer feature works great so all can be included), and amazing nature shots.  I eventually want to add a telephoto zoom lens to it to improve our ability to take photos from far away.The only reason I give it 4 stars instead of 5, is that it takes some playing around with to get used to the features, and it can be awkward to hold at times due to the compressed body (but that is the price you pay for reduced bulk...not sure how awkward it will be with a larger zoom lens).", "Date": "December 4, 2012"}, {"Title": "Unbelievable photo quality! Mind-blowingly awesome!", "Author": "appstatephotographer", "ReviewID": "RLLUTSTJSKJ8V", "Overall": "5.0", "Content": "I bought this camera used on craigslist for $280 as a step up from my point-and-shoot Lumix DMC-ZS1. Since buying it about a month ago, I have taken probably around 2,000 pictures with it. This camera really is incredible. The image detail and color depth are jaw-dropping. This camera interprets colors and lighting in a way I've never seen before in a camera of this price range. You get professional, DSLR-like quality photos in a camera that can be crammed into your pocket! (if you've got the pancake lens, of course)Its large CMOS sensor makes taking night shots so much fun! Thanks to its high ISOs (up to ~12000ISO I think), night shots are noise-free, crisp, and faithfully reproduce reality. In certain situations, you can walk down a city sidewalk at 1am with minimal lighting without a tripod and just click the shutter and you'll still get noise-free pictures with exposure times under 1 second.I really like the built-in panorama mode and picture effects. It has an anti-blur mode where it will take several successive shots and blend them together to get blur-free photos in low light as well (very useful around night time campfires). The shutter noise it makes is very satisfying, too! People have complained about it being loud but I think that the noise is one of its charms.There really isn't much that I don't like about this camera, other than the fact that I wish it had a remote shutter release. Overall, I am very happy with my purchase. The picture quality is astounding. the camera body feels very solid and I anticipate this little gadget still be around for many years to come. I would recommend this camera to anyone who wants to take a step up from point and shoots, but doesn't want to drag around a clunky DSLR.", "Date": "September 18, 2012"}, {"Title": "Best mirrorless camera.", "Author": "Yano", "ReviewID": "R1QC7L6FB11O2C", "Overall": "5.0", "Content": "This is one of the best mirror-less APS size sensor cameras ever made. The photo quality is comparable to the Sony A55 and surpasses the low light performance of Sony's A65 and A77. The contrast detection auto-focus on this camera is pretty amazing and on par with many mid-range DSLR's dedicated phase detection sensors. The 18-55mm e-mount lens focuses completely silent and extremely fast, good for high quality 720p movies. This camera ironically features one of the best 16MP APS sensors ever made, better than the ones put in Sony's other 16MP APS cameras and Nikon's 16MP cameras (All Nikon DSLR sensors are made by Sony).It does not come with some of the advance features of DSLRs and lacks hardware to easily access shutter / aperture control etc., BUT it was never meant to be used as a professional DSLR, so why bother, right?So for a photo lover that wants high DSLR quality point-and-shoot photos, this is the camera for the job. A steady hand and good choice of subjects + a bit of photoshop, your photos can look amazing enough that they look like they came from a professional DSLR.", "Date": "September 17, 2012"}, {"Title": "Good pics...but Loud", "Author": "Cory", "ReviewID": "R34WMFOCGB5PWR", "Overall": "4.0", "Content": "Camera takes great pics, and works well when you have your shortcuts set up the way you like it. The menu, like others have said, is a little confusing, but you don't have to go in there often with your shortcut buttons assigned.The reason I am writing this review is not to give high praise(though it does deserve some), but to inform of a very poorly documented issue. Despite the many reviews I had read about this camera, I did not know how loud it would be. I thought it wold be quiet like a point and shoot because it did not have a moving mirror like a DSLR. Boy was I wrong. There is a shutter that moves in front of the sensor before and after every shot. This camera is just as loud my mom's DSLR. I thought someone would have mentioned that in one of the many reviews I read. This isn't a huge deal for me, but definitely a disappointment.Overall, I really like it and am very happy with my purchase. It is a great camera, but if you need a quiet one, look elsewhere.", "Date": "April 23, 2012"}, {"Title": "Excellent photos, perfect portability", "Author": "Manx Shearwater \"Manx\"", "ReviewID": "R1G55FDQ8CSCKT", "Overall": "5.0", "Content": "Great camera, stunning photos. The high ISO range is very nice to have, and the 16mm pancake lens is quite sufficient in most situations.A useful review is here:[....]", "Date": "October 29, 2011"}, {"Title": "Battery Problems", "Author": "Timothy D. Wynn", "ReviewID": "R2G7IV415TKOAV", "Overall": "3.0", "Content": "Don't know if I received a bad battery, or there could be a camera problem, but the battery only lasts about a week, then needs recharging.  With a full charge, and no usage, the battery still loses it's power.  I will no doubt have to buy a spare battery, however, I feel the one that came with the camera is defective.  I would be willing to exchange it for a new one.I am still learning what the camera can do, but what I know so far is that it's doing a reasonable job of taking pictures.  The colors are not as accurate as I would hope, but that may be do to my inexperience.", "Date": "August 28, 2012"}, {"Title": "Great camera with well designed menu", "Author": "Sarge", "ReviewID": "R1PQS6KYCKUV2", "Overall": "5.0", "Content": "Has a full size processor similar to a DSLR in a 4/5 camera so picture quality is excellent. The menu is well designed and intuitive with useful descriptions of what each function does", "Date": "December 31, 2011"}, {"Title": "6 months later -- still delighted", "Author": "SM", "ReviewID": "R189512LYWNXAH", "Overall": "5.0", "Content": "The picture quality still delights me and the pink color is delightful!  The size is a nice bonus.  I bought the matching pink case and keep the flash permanently attached.", "Date": "December 29, 2011"}, {"Title": "Flash design a problem", "Author": "F. Perry \"global speak\"", "ReviewID": "RZ3M2MD7XR4CB", "Overall": "4.0", "Content": "Problem is with the design of the flash and the case for the flash is not seccure.  Flash snaps in but is not very secure so it can't be left in the camera at all times.  The camera comes with a flash case designed for the camera strap. A good idea, however the flash case is also not sucure.  I lost the flash within just a couple days of buying the camera.  The flash was in the case on my camera strap and I know I had it fully snapped shut.  However I was at an event and the jostling of the crowd must have caused the flash case to open and the flash to drop out.  The only solution I can think of is to buy a camera case and keep the flash there.  ALso disappointed with the distance of the telescoping lens.", "Date": "October 3, 2011"}, {"Title": "Great pictures...big cons", "Author": "MCO", "ReviewID": "RKXVQHR3U0LWP", "Overall": "1.0", "Content": "This camera takes great pictures, but has too many negatives.  It is best for low light, general purpose, candid photos.  It is extremely difficult to use outdoors in sunlight, because you cannot see the viewfinder/LCD to compose or fine tune your photos.  Beware if you want to use this for outdoor landscape photography. The biggest problem is the rapid battery drain when the camera is turned off.  I tried to download a firmware update, but they seem to have an update for all NEX 3 models, but the NEX-C3.  I talked to Sony support and they said sorry, we don't know when/if we will provide a firmware update.  THIS IS TOTALLY UNACCEPTABLE!!  Buyer beware.", "Date": "November 11, 2011"}, {"Title": "So Far, I Hate It.  :-(", "Author": "Ms_Ladi \"...just wandering the world.\"", "ReviewID": "R1EZ9615QMTH7Q", "Overall": "3.0", "Content": "I never rate an item under five stars because I can usually find something I appreciate about my purchase.  However, I had to rate this one honestly.The Nex C3 is a very nice compact, great looking camera.  Although the menu is a bit difficult to finagle, I got the hang of it and also saved various functions under the buttons.  I appreciated that I could edit the buttons to my liking.  The 16mm makes the camera handheld and I love holding it to take pictures.HOWEVER,This camera/lens UNDEREXPOSES like there is no tomorrow.  I'm so frustrated with this camera; it's definitely not what I expected.  A brightly lit room has a dark tone that requires extra processing in Lightroom.  This is unacceptable.  I let go of a Canon S95 in order to try this camera because I thought it was an \"upgrade\".  Although the images are very dynamic, there is zero sharpness and they are very dark.  I have never had to use a flash on my point and shoots, so I didn't try with this one.  Not sure why I would have to.I cannot do any close focusing...again, very weird for a handheld camera...doesn't matter about the lens; it's supposed to be made to pull out and shoot any and every time.  Perhaps I'll have better luck with the 18-55 lens, but that lens is slower.  So far, every close up photo is soft and blurry.  No sharpness!I am currently using Canon 7D, Leica M8.2, and have also used other \"higher\" end cameras.  I cannot believe this camera underexposes so much.  It basically renders it unusable.Sorry Sony, I hope the Nex 7 is not like this.  Pitiful.  I promise to provide an update if an update or more playing around with this camera produces better photos.", "Date": "January 16, 2012"}, {"Title": "BUY the nex-5n INSTEAD!!!!", "Author": "M. Luu", "ReviewID": "R3VFLVBR11SSXW", "Overall": "3.0", "Content": "save your money and get the sony nex-5n. it's only $50 more! the 5n has 1080 60p/24p recording, a touch screen, higher iso @ 25,600 vs 12,800, and 10fps vs 5fps . easily worth the increased price tag. the 5n makes me think that the c3 is overpriced. the c3 should be selling for $600 w/ 18-55mm.", "Date": "August 25, 2011"}, {"Title": "have not received", "Author": "Dennis Kuhn", "ReviewID": "R300Z2X7QJ4UGY", "Overall": "3.0", "Content": "Have nnot got it yet, Cannot comment because I have not got it yet. I guess i cannot say much more.", "Date": "November 25, 2012"}, {"Title": "Just Ordered", "Author": "R. Byerly", "ReviewID": "R26YN16T66FXCB", "Overall": "5.0", "Content": "I've gone through my share of point and shoots in the past year. I started with a Sony, then returned it because it felt like a cheap plastic toy. I then purchased the Canon S95. I read many reviews saying that this is the camera to buy if you don't want a DSLR, and that many professional photographers would choose this camera if they didn't have access to their camera. I loved the camera, the quality of the photos were great. However after several vacations the zoom was not adequate. Also, my partner owns a DSLR and the differences of night shoots showed greatly.I then purchased a Canon SX 230 IS, because of the travel zoom. The camera was nice, and it had GPS so it would take the location of photos, but it performed not so great in low light, and battery life was terrible even with GPS turned off.After reading many reviews from DPreview.com, Amazon user reviews, and user reviews on YouTube, I'm sold on the Sony NEX C3. I've just ordered and it's coming tomorrow.I'll be sure to update with images and a more extensive review of the camera.", "Date": "December 27, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.2 MP Exmor APS HD CMOS image sensor has fast response, low noise\nSweep Panorama with incredible 23 Megapixel images\nSix-shot layering with Hand-held Twilight, Anti Motion Blur modes\nPicture Effects provides 11 artistic looks for your photography\nPhoto Creativity provides easy access to image adjustments", "Name": "Sony Alpha NEX-C3 16 MP Compact Interchangeable Lens Digital Camera Kit with 18-55mm Zoom Lens (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/41W0gIARUUL._SX300_.jpg", "ProductID": "B0054I54FO"}}