{"Reviews": [{"Title": "My Dummy Camera Review", "Author": "Unhappy Popper", "ReviewID": "R17Y5PXF5W5Y9U", "Overall": "4.0", "Content": "I have purchased dummy cammeras before and placed two under the eaves of the house and two which were exposed to the sun and elements. The red LED lights had stopped working so I made this new 4-pak purchase. I guess I should not have expected them to be metal like things used to be made. They are 100% plastic. However, the LED flashing light is very bright which is good. I will update this review after learning how long the AA Lithium Batteries last. (Hint, Only use Lithium). My old cameras would keep the light blinking for about 2-1/2 ~ 3 months. Longer on those out of the weather for some reason. I would recommend these but to you reading this make sure you purchase separate solid stainless steel screws. These will round out easily as they are very soft metal. That is a pet peave of mine since it would have only cost the Chinese an extra .05 cents. Now I will have to drill them out when they go bad. Second, You must mount them to a vertical surface unless you plan to screw them into the surface of your facia board exosing them to the sun full time. This will greatly shorten the life of any plastic material making them no longer look \"real\". I did not want to drill holes into my brick and my freeze boards only drop down from the bottom of the eave 6\" before the brick starts. The clearance between the top of the camera housing and the mounting screw holes is probably 8\" or 9\". These are factors to consider for some home owners. Otherwise, these are the best buy for the money. The purpose is to make the house burglar think twice. I would highly recommend buying a \"Smile, Your On Camera\" sign and posting outside along with real or fake house alarm signs. These are steps we must take to let these scumbag burglars choose another house. But if someone does have the stupidity to break-in to my home, I have real cameras purchased on Amazon for very little cash which record to an old VCR. Anyone can hook one up - even you. The last step every responsible home owner should take is to own a scatter gun and be more than willing to use it. That is our right under the constitution, to defend ourselves, our loved one's, our property, -- and to defend ourselves from any entity attempting to impose Tyranny. Better make that a double barrel scattergun.", "Date": "January 17, 2012"}, {"Title": "Making these cameras more realistic", "Author": "Edward Teach \"Edward Teach\"", "ReviewID": "R1LM90FHSIRF71", "Overall": "4.0", "Content": "These cameras are a good value for the money and look fairly realistic to an average person from a distance.Unfortunately I had to mount one that is reachable from a raised planter,and if somebody with even low intelligence climbed up and checked it out they would know it was fake.If you tap the camera it is obviously hollow and the wire is nothing but a hollow sleeve.To make it feel more solid I took off the rear cover and filled the camera body with spray foam.I wrapped a zip tie around the body to keep the foam from pushing it apart.As to making the wiring more realistic I took a piece of co-ax cable and a piece of wire off an old keyboard and replaced the factory one.Real cameras usually have 2 wires,one for power and one for video.I used large stake-ons to keep them from being pulled out and also epoxied them in.I also went so far as to put a couple small,black zip ties visibly holding the wires neatly together.After putting the cameras back together and mounting them they look and feel more solid and real.", "Date": "October 24, 2012"}, {"Title": "Hoping to fake out the bad guys.", "Author": "Robert E. Wertz", "ReviewID": "R1V6148I4CY5WO", "Overall": "5.0", "Content": "Very convincing especially with the red blinking led light. I put batteries in over 2 months ago and still blinking. I used 1/4 inch pvc tubing to run from camera to house to look more convincing. I have my cameras placed under the house eaves so don't know how they would weather exposed outdoors. I bought 4 and all are working fine. Not sure they would fool a professional but maybe your average bad guy/thief/robber/rapist or serial killer. Also thought it may deter thieves from taking my Amazon purchases off front porch.", "Date": "May 28, 2012"}, {"Title": "Look soooo real..", "Author": "Yunus Cevik \"police dolphin\"", "ReviewID": "REUZS2UULPHVW", "Overall": "5.0", "Content": "I've just set them up and looks great and also scary for bad dudes.Even ADT guys couldn't  understand they are fake...Just take it...", "Date": "April 18, 2013"}, {"Title": "Cool cameras", "Author": "Tony G", "ReviewID": "R2PQJE6BS563IJ", "Overall": "4.0", "Content": "These cameras do what they say. However i gave 4 stars because the first rain they stopped blinking. Kinda bummed out", "Date": "January 8, 2014"}, {"Title": "Dummy Cameras", "Author": "Ridesafe", "ReviewID": "RT42M6B9L9M2Y", "Overall": "5.0", "Content": "Put these up on 9/21/13, just changed battery's; they lasted 3 months!. These things look like the real thing, excellent determent to the $500+ option! highly recommended.", "Date": "December 20, 2013"}, {"Title": "Sure look real enough", "Author": "Don V.", "ReviewID": "RFPDVHMFIXZ50", "Overall": "4.0", "Content": "Not the real thing but for those that don't know these are \"dummies\" will keep the criminal dummies away to look for easier pickings.", "Date": "October 19, 2013"}, {"Title": "Good Product", "Author": "James Jeffrey Coleman", "ReviewID": "R1MNIXDQ44C9KI", "Overall": "4.0", "Content": "Good product will do the job!!! Will work where i plan on using around the outside of my store front.", "Date": "October 13, 2013"}, {"Title": "Look is real...", "Author": "James B. Williams", "ReviewID": "R11JT67YZT9QQE", "Overall": "3.0", "Content": "Might scare some dumb thief away, but could look more real ..price is good for what you get --can't hurt but if thief is smart he will figure it out but who think most thief's  are real smart ...replace with real ones to stop smart thief's..", "Date": "September 22, 2013"}, {"Title": "Looks Real", "Author": "Mary M", "ReviewID": "R4QTRPFCONZLL", "Overall": "4.0", "Content": "GREAT product. Put them up myself it was that easy,wanted to add a little extra protection to be sure my family was safe while I was away. You can't tell for a minute they aren't the real thing. THANKS", "Date": "February 7, 2013"}, {"Title": "perfect", "Author": "switt", "ReviewID": "R5JYVL1DJFXM0", "Overall": "5.0", "Content": "These are great.  They pass for the real thing, plus the light adds that extra something.  We purchased a bunch of these and put them throughout our facility.  thanks!", "Date": "December 5, 2012"}, {"Title": "Fake Cameras", "Author": "C. T. Catron-walden \"Hawaiian Style\"", "ReviewID": "R1Z8CXTLB1BL8D", "Overall": "5.0", "Content": "Look very real, install is super simple. I love the red blinking light. I have 6 up around my house and at night you can see all the lights blinking from down the street. Would def make someone think twice before doing anything to your property. I hope the batteries last a while but for a $10/ each theft deterrer, i'd change them once a month if i had to.", "Date": "March 20, 2012"}, {"Title": "Looks real", "Author": "Terry", "ReviewID": "R1SCDUHNJ45X8F", "Overall": "5.0", "Content": "Looks like the real thing it fooled my ADT security guy. The security guy ask how I like the security camera's I told him they worked very well considering they were fake he couldn't hardly believe it. If it can fool him it can fool a thief. Very good product.", "Date": "November 6, 2012"}], "ProductInfo": {"Price": "$30.99", "Features": "Can be used Indoors or Outdoors\nThis unit does contain a flashing light\nDimensions of the camera are 5 one half inches x 3 inches x 2 and one half inches (without rain shield). With the rain shield the dimensions increase to 7 x 3 x 3 inches.\nPower source:1.5V AA size batteries (not included)\nBracket Arm Movement: Fully adjustable(0-90 downward tilt,0-360 L/R rotation)", "Name": "4 pcs Outdoor Fake Dummy Security Cameras LED Blinks Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31pErOUxdLL.jpg", "ProductID": "B005EP4MRS"}}