{"Reviews": [{"Title": "Garbage", "Author": "Charles W Riley", "ReviewID": "R3O27F722O5NJO", "Overall": "1.0", "Content": "Absolute garbage.  I can't believe I wasted money on this.  10 more words are required for me to post this.", "Date": "November 24, 2012"}, {"Title": "In sc", "Author": "T. Hankins \"austinshopper\"", "ReviewID": "R1PII2XJ5LOQOO", "Overall": "1.0", "Content": "I think I expected a better product. I gave it to my grandson as a toy. The picture quality was bad.", "Date": "August 11, 2012"}, {"Title": "Buy another product", "Author": "Liu Evers", "ReviewID": "R278660BFLE4AG", "Overall": "1.0", "Content": "This is the worst pen camera ever. Don't waste you time or money on this junk. If you want a better deal shop at Walmart for a similar product for less money. I made the mistake of thinking that these features would provide exceptional quality but I couldn't give it to my grandson as a gift because the product didn't work. Even the refills were not included. Don't waste your money.  Junk! Junk! Junk!", "Date": "May 2, 2012"}, {"Title": "Does not work", "Author": "Randall Hampton", "ReviewID": "R28POFQURQNQMW", "Overall": "1.0", "Content": "The product did not work when I received it.  I called the manufacturer and was told the product was defective and they no longer sold it.  I was told my only recourse was to return it to the seller and the seller had been told the product was defective. A total disappointment!", "Date": "January 28, 2013"}, {"Title": "Not working", "Author": "George Adams Ofosu", "ReviewID": "R2ETWPSV30YYI7", "Overall": "1.0", "Content": "This pen DVR is cute but unfortunately it does not function, it can not record videos even when instruction was well followed. It only functions as a storage device.", "Date": "January 12, 2013"}, {"Title": "There is NO audio!!!", "Author": "Kelly Fisher", "ReviewID": "R1Q2Z6ZF8V55PQ", "Overall": "2.0", "Content": "Be warned, I looked at several products before ordering this one and I did not notice at all on the product description that this does not have audio recording with video!! That really defeats its purpose as far as I'm concerned. Video looks good, but I will most likely return it! It is not what I expected and not what I need without audio recording on videos!!!", "Date": "December 11, 2012"}, {"Title": "Good Product", "Author": "Ed", "ReviewID": "R1QLBCEPTN8HG6", "Overall": "5.0", "Content": "The product was delivered as advertised and functions well.  The photographs and videos are of great quality and the product is practical for my purposes.  I use it to capture evidence to be used in a variety of proceedings.  The stealth quality is on the high end and parallels that of some more expense brands.", "Date": "April 20, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Built-in 8GB memory\nHi res video recording built into a covert pen\nStore up to 8 hours of video; Store up to up to 250, 000 photos\nEasily connects to your PC or MAC with USB for quick viewing\n3 ink refills to prolong use", "Name": "Svat PI101 Covert Pen DVR with Built-In Color Camera and 8 GB Flash Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/31H9Tb--FgL._SY300_.jpg", "ProductID": "B0058OA8QO"}}