{"Reviews": [{"Title": "Decent camera with a serious security flaw", "Author": "Terrence R. Bayne", "ReviewID": "R3KNTEAMZNKC4T", "Overall": "1.0", "Content": "Note: Updates to this review have been moved to the end.Overall this is a good camera for the price point with one glaring flaw:The camera ALWAYS attempts to make an outbound connection to a server in China (IP: 58.61.155.158). There is no way to disable this \"feature\". When I contacted Loftek support, here was the reply:-------Thanks for your message and suport on our product. Please don't worry , 58.61.155.158 is our server ip address . All of our camera ,if you ping its DDNS ,it will resolve to 58.61.155.158 . It is set up for your remote view. It is safe and have no influence to your network. If you still wanna disable it . please close the port forwarding for your camera and disable UPNP in your router. Thanks.Any question , feel free to let me know.Thanks for your time.Best Regards.-------So what they suggest is that I modify my firewall to fix a problem in their product. I have suggested that they change the firmware to make this an option that is turned off by default.Note: Given the way the firmware is designed you can't turn off this feature. It would be easy to make this an \"option\" so the customer could disable it. The camera will ALWAYS attempt to make an outbound connection to the server mentioned above every time it is turned on. Don't know about you but I am not comfortable with a server in China knowing the externally visible IP address of my camera.Update (28 November 2011): I have received numerous emails from Loftek asking me to \"Fix\" my review.  I have asked them to stop emailing me with these requests, yet they persist.  My review is not broken or inaccurate in any way.  The emails claim that they have a way to remove the \"hard coded\" DDNS server address and to prevent the camera from making an unauthorized outbound connection to their DDNS server.  Yet they have not provided me with the information as to \"how\" to accomplish this.  I will continue to update this review.  Should they actually provide a way to disable this outbound connection from within their product, I will update this review with that information.Update (30 November 2011): Last night I received another email from Loftek support.  Rather than ranting I will post the email and my response below.  At this point I feel I have given Loftek every opportunity to fix the security flaw - to no avail.  I have purchased another (non-Loftek) camera.  I will post my review once it arrives and I have a chance to test it.  Here is the email and response:------->Dear Terrence R. Bayne,>Thanks for your message. As for your problem , we can delete the DDNS compeletly from your camera. Would you mind tell me if your camera >available for remote view now ? if it is ok , please sent me a Administrator account and password, so that our tech can access your camera >to destroy the DDNS. Please advise.-- My response --Let me be sure I understand what you are asking....1.  You want me to provide admin access to a device inside my firewall.2.  You want me to do this so your technician can modify my camera toremove the DDNS information.Is this correct?If so my answer is \"No\".  You will not get access to ANYTHING insidemy firewall.  Not even temporarily.This request clearly shows that you folks really don't have any ideaabout network security, or security in general.Why is it you won't provide the information so I can disable thisfunctionality myself?  Obviously there is a way to do it, so providethe information to the public so everyone can benefit (and can vet theprocess as well).Note that I will be adding portions of this email conversation to thereview on Amazon.If you are NOT willing to provide the information on how to disablethe DDNS within the camera DO NOT CONTACT me further.-------Update (01 December 2011): Another round of emails with Loftek support.  This shows how truly clueless they are.  They seem to think it's ok to access a device inside my firewall (they assumed that I thought they wanted to access my PC and that I shouldn't be upset that they want to access the camera).  And they feel that the \"fix\" is some sort of a trade secret.  Here is their email and my reply:Dear Terrence R. Bayne'Thanks for your message. Acctually we just wanna access your camera not your PC. So sorry we can't offer the information to you to delete the DDNS because it involve our product brand. Hope you can understand. Anyway , if it is not available for us access your camera , we can sent you a replcement camera without given ddns.Thanks for your time.Best RegardsMy Reply:Good Morning,Really?  The automatic DDNS entry is some sort of \"trade secret\"?  Andthe method for removing it is also secret?  Really?  Wow, I think youfolks need a few lessons in computer security.Finally, I am fully aware that you wanted to access the camera, not myPC.  You are aware that ANY device behind a firewall that has a CPUand network access (and yes the camera has a CPU and network access)is a potential security hole?  Giving you access to ANY device insidemy firewall is an unreasonable request.  Just so we are clear, thecamera is a device inside my firewall.A few points:1.  Security through obscurity doesn't work - this means that hidingyour flaws/weaknesses doesn't make them disappear.2.  Providing customers with a way to fix a security hole in YOURproduct is just good business.3.  No customer who is concerned about network security is going togive you access to a device inside their firewall.  This is NOT areasonable request.4.  Your companies resistance to doing the right thing (in this casethe right thing is to admit to the fault, and provide existingcustomers with a way to fix it) is becoming harder and harder tounderstand.  You have read the comments to my review from othercustomers on Amazon right?It is obvious that you have no intention of really fixing the issue,or providing existing customers with a way of securing their owncameras.  This is a shame really, because other than this one seriousflaw, yours is a nice product.  I am guessing that the reason youdon't provide a fix is that you don't have anyone in the companyqualified to update the camera's firmware to remove the issue.  It isunfortunate you have taken this stance on what is a simple firmwareissue.  Your sales on Amazon for this product will likely fall, notjust because of the security issue with your camera, but because ofthe way you have tried to handle the issue:1.  Denying it is an issue2.  Telling me not to worry, that I can trust you and your server.3.  Wanting access inside my firewall to provide me with a fix.None of these inspire confidence with your company or your brand.  AndI am guessing other potential buyers will feel the same.Because sending me a \"fixed\" product doesn't fix the security issuefor potential customers, the review on Amazon will stay the way it is.If you want to send me a camera, with the automatic DDNS connectiondisabled, I am ok with that since it solves my issue.  Once the newcamera arrives I will gladly send the other one back to any US addressyou specify (note that I am unwilling to pay for shipping outside theUS).-------------------------------------------------------------------------Update (December 14 2011):On the 1st of December Loftek offered to send me a camera with the outbound hardcoded DDNSconnection disabled.  Two weeks later I have not received the replacement camera, nor have Iheard back from Loftek.I guess they didn't like the fact that I wouldn't change my review until they make the \"fix\"available for all customers.----------------------------------------------------------------------------------------------Update (Feburary 1, 2014)This is the final update that I will be posting to this review.As of this date the product still contains the security flaw.  And it is enabled by default.  The company has posted a \"patch\" that you can use to disable this \"feature\".Several commenters on this review and the company (Loftek) have tried to \"encourage\" me to change this review.That is not going to happen.  They were given ample time to rectify the problem.  Just to be clear here the problem is two-fold:1.  The default DDNS mode of the camera makes use of a Dynamic DNS server.  This is enabled by DEFAULT.  Unless you know enough to understand this and change it, installing this product leaves a hole in the security of your network.2.  Loftek's reaction upon being notified that this was an issue:A.  Denied it was a problem.B.  Wanted me to let them inside my firewall to \"fix\" the issue.C.  Offered (on December 1st , 2011) to send me a camera with the security issue fixed.  That camera never arrived (not a big surprise).D.  Has offered a patch (via their website) that knowledgeable consumers can use to update the firmware on the product to remove the security issue.  Note: I have not installed said patch, and have not in any way vetted the patch to be sure it does what they say it does.  For me the solution was to simply block the camera from ever reaching the outside world via my firewall.It's obvious to me that the company doesn't have much interest in changing the installed firmware and its inherent security flaw.Does this flaw affect other Loftek camera products?  I don't know.  Nor am I willing to purchase more of them to find out.", "Date": "November 23, 2011"}, {"Title": "Excellent Price Leader", "Author": "Jack", "ReviewID": "R2A60H0V9ROC64", "Overall": "5.0", "Content": "Let me preface my review by stating if you have never set up a wireless IP camera, get ready for a couple of long nights of Google searches and YouTube how-to videos.  However, once everything is up and running the results are amazing.  Who would have thought that you could watch what was going on inside your home from any where in the world via a phone?I have tried 3 different wireless IP security cameras; Foscam FI8918W, LTS LTCIP830MV-W, and now the Loftek CXS 3200.  For the money you cannot beat Foscam or Loftek for image quality and ability to find and hold on to a wireless signal. Either one is an outstanding buy.The Loftek CXS 3200 may in fact be the same camera as the Foscam FI8918W, but in a different body.  The software links up and the Loftek camera is visable in the Foscam software.  The image quality of the Loftek is great (day and night).  With a little help from a Diamond Multimedia Repeater and Range Extender (also sold on Amazon) I get a very usable camera signal through 2 walls.Remote view via my Android phone is outstanding using either tinyCam Monitor or IP Cam Viewer (buy the \"Pro\" version to support the devs!).  My favorite feature is the email motion alert.  Alerts come to my phone within seconds giving me ample time to look at what may have triggered the alarm (via tiny Cam or IP Cam Viewer) and letting me decide whether or not to call the police.While no security solution is perfect, I feel more secure knowing my little Loftek is on patrol.", "Date": "October 16, 2011"}, {"Title": "Impressive IP Camera", "Author": "WELIANG GUO", "ReviewID": "R2D1AFY311I1A0", "Overall": "5.0", "Content": "As anyone who owns an entry-level IP camera knows, the color quality sucks. One of the most annoying things is the fact that the colors are totally distorted - Trees look white and purple, black clothing looks blue, etc. It's not really a huge problem, but its annoying enough that I had considered dissecting a webcam, removing the IR-Filter, and gluing it onto my first camera (Foscam FI8918W). However, according to the forums, once you glue an IR filter on, you lose night vision capabilities - kind of rendering a night-vision camera useless. I was skeptical that a camera for this price could offer an IR filter as well as night-vision ability. Evidently, its a physical mechanism inside the camera that automatically filters the light during day time, rather than a software or firmware upgrade. The result? I'm very impressed with this odd-looking thing. It also has a slightly wider pan-range (340 degrees over the one I was using before, 300 degrees). Additionally, I opted to use the camera's built-in DDNS. I was previously using a free one from the  DynDns website, but using the built-in one is much faster and easier.It solved my problems of psychedelic colors, and at a very reasonable price! Aside from that, the functions are pretty standard, and almost identical to the camera I was using before.", "Date": "August 24, 2011"}, {"Title": "Very good product for the price", "Author": "SJ", "ReviewID": "R2U0E2UWU3TVAB", "Overall": "5.0", "Content": "This is my third IP Camera from loftek. First loftek CXS 2200 and second two CXS 3200. I like the shape of this camera compare to 2200. But the night vision on CXS 2200 is better. Audio CXS 3200 is better. {As other reviewers noted Loftek use DDNS server in China [58.61.155.158] whitch I am not happy. But you can block this incoming and outgoing IP address in your router, under security, IP Filter}. I do not use DDNS service anyway. Software came with this camera is ok but not great. In order to monitor this camera from ouside your home, you need to set up your router with port forwarding. Once you set up port forwarding, find your IP address using google search, Then type Http://xxx.xxx.xxx.xx(ip):10xx(your port number), that's all.  I was looking for apps to work with these cameras on my Iphone 4s. Finally I found one \" Live Cams pro\". This application will let you see all cameras at the same time with some audio fuctions.It also allow you to turn of blinking LED light on the camera, PTZ fuction is better. Both CXS 2200 and 3200 work with this app. I recomend this camera to anyone who looking for cheap IP Camera..", "Date": "January 29, 2012"}, {"Title": "Beats Foscam, Apexis. My comparison results.", "Author": "Big John", "ReviewID": "R26TBHIPO09VOX", "Overall": "5.0", "Content": "Previously I ordered a Wansview and received an Apexis. The Apexis was a Foscam FI8908 clone. Worked great wired but these clones (other brands as well) have a wireless issue (weak signal, dropped connections. Supposedly from bad internal antenna connection) so I returned it. Next up was the newer Foscam FI8918W (not a clone). Worked great wired but again with a wireless issue (the microphone picks up static when using wireless. So much so that the audio is not usable. But they will gladly send you instructions on how to disassemble it, reverse mic polarity HAHA and swap out a surface mount resistor). Another return, but hey, it was Amazon fulfilled so no biggie. So then I decided that I would look up any common wireless issues for the next candidate to become my IP camera.  After some research and no common wireless issues found I ordered this Loftek. First thing was the hardware test. Wired works great. Wireless range/signal is good and doesn't drop out. Wireless doesn't introduce hardly any static at all into the mic. The audio can pick up any sounds in the room, and any decent volume sounds in the whole house. Pan/Tilt works nicely, quietly. IR filter helps with accurate coloring, especially with certain colors or lighting conditions. I didn't test the alarm I/O or audio output connectors. One thing I noticed on this one is that the lens seems to slightly curve the picture at the edges. The others didn't do that, and it's not enough to be a bother. See if you notice it in the sample pictures, the one with the door.  Finally I had one worthy of continuing on to checking out the included/on-board software. Basic same stuff as the other low priced IP cameras. Front status LED can be disabled, allowing wireless mode to give no indication of data transfer. Emails on alarms sends the usual 6 pack of snapshots.  This camera is way better than any other in it's price range as of today. This is because the hardware actually works. The software works too, although it is way behind even the others in this price range. That being said, here are some things to consider.  Included/on-board software is lacking. While I don't expect the functionality of third party software (see ispy, ispyconnect), I do think that this IP camera could include what the others in it's price range offer with a simple firmware update. I also realize that this isn't meant to compete with more expensive IP cams that have much better included/on-board software.  Here's what should be fixed/improved on this IP camera relative to others in this price range:No ability to send videos.No motion detection zones.No ability to set intervals on email alerts.No position presets.No IR LED disable option.  And oh yeah, add a disable option to the manufacturer's DDNS. I'm not sure if the competition in this price range has this option, but I don't see their reviews bringing it up either. It seems easy to fix instead of having thousands of Amazon customers reading about how the IP cam always tries to connect to China. Most people won't have the knowledge to even detect that this is happening, and maybe the more knowledgeable customer bought one of yours.  Believe it or not, Loftek seems to have better customer support than the other guys (again, for this price range). Just responding to issues is more than others do. I give it a 5 stars relative to the other similar priced, similar featured IP cameras. I think I'll get another one of these. I will stay away from Foscam and Foscam clones. Hopefully this review can help others to make an informed decision.", "Date": "December 3, 2011"}, {"Title": "Good camera/strange company", "Author": "J. T. Sheehan", "ReviewID": "R2702W761REJ2E", "Overall": "1.0", "Content": "Edit: I changed to 4 stars since they have a patch for this product now.My review is for CXS 3200. I received this product on Monday Dec 19th. We had an early Christmas because we didn't have kids plus we could beat the return lines if needed. Also, the main reason was that I work on Christmas Eve and Christmas so it was only easier to do it on an earlier date!From the box, it shows a white camera, though I wanted a black one. Once I opened up the box, it was the black camera. All packaging material was well secured and the camera was secure in its slot.I took the camera out and the camera feels cheap. The camera rotates about 1/4 inch left and right, maybe 1/2 inch. It felt loose and I thought I would need to return it but I set it up anyhow.For me, setting it up took me 10 minutes (though my reset button was covered by a product sticker). The other 1 hour and 50 minutes was trying to get ISpy to work with it. Google search - CXS 2200 ISPY and click the first link for Slow Shutdown and no audio if you need help getting it to work. In there it explains what you need to use for the video and read further down the page for the audio portion. I do notice that when I changed the password for the admin login, I could not login with that password. So I had to reset the camera using the reset button on bottom and just created a new admin account and removed the default admin.Accessing the product from the internet with a dynamic ip address was not an issue either. It was actually fairly simple. I hate to steal Terrance's lime light (another reviewer on this product) but I do agree with him that the product does have a huge security flaw. Until they fix this, my stars remain as 1 stars. Everyone doesn't need DDNS. Some people would be ok with using their IP address to access this product. Thanks to Terrance, I did block the outgoing IP address connection in my router, but I don't feel I should have had to do this. By the way, for those that didn't read his, basically the IP Camera pings out to a China IP address. Doing this could reveal your Camera to them.  Edit: I have changed to 4 stars since they have an update for this.The other issue that irks me that seems misleading was the fact it is advertised that you can communicate 2 way with camera. If this is why you are buying it, then please understand that you have to have IE for this to work and it requires you to download a file. Downloading is easy, and once it is setup, it works, but from my work, I can't install files like this. So I would denote 1 star for this option unless they can find a way to make this work. I would even give the star if I could get audio to work on Firefox (1 way or 2 way). Just be aware of this.I would say you do need some experience with your router otherwise you might be pulling your hair a bit. You should understand port forwarding and setting up a private ip static address or at least understand how to set them up.It is really a good camera and I can check in on my dogs from work. I would give 5 stars if they could correct the audio issue with firefox. In the pros, it does send me an email everytime motion is detected. Each email is about 100-200k but be careful if you don't set a specific date and are watching dogs in a crate, it will go off on every shift but you can adjust the sensitivity level. I haven't messed with the FTP yet. The picture looks good in light or faint light. The operation is quiet when it shifts left to right or up and down.If I was to do over again, I would probably pay more for a product with a DVR. But if you want to get your hands wet with a camera product, then this is your entry level product.", "Date": "December 22, 2011"}, {"Title": "Kinda torqued off", "Author": "Paranoid", "ReviewID": "RNRQT6P9X85TF", "Overall": "1.0", "Content": "First of all, I must commend Amazon and their customer service.  I have found it to be second to none.  Now to cut to the chase on my experience with these cameras.  Every camera I have purchased out of six, including replacements, have had wifi radio failure.  One died completely and one was DOA.  Thanks to Amazon, I was able to get replacements, which I now operate in the wired mode and have no problem with those that still work, so far.  Loftek will not respond at all to any email concerning setup problems or other tech questions about their cameras,to say nothing about warranty service.  It is non existent so dont even consider them to honor any warranty.  Their site triggers my virus checker and firewall as a malicious site.  This may or may not be a problem for some purchasers, but what is a person to do?  The only positive experience that I can document here, is that when these cameras work, they are nice.  Forget wireless mode.  My Android Gingerbread phone works great on my home network to monitor these cameras.  I havent tried to connect with the \"included\" DDNS service and most likely I will not.  If my Netgear WNDR4500 (purchased from Amazon, BTW, wont handle these, I dont think there is any hope.  I have had Netgear support work with me to try to get a wireless connection, with no luck so far and my patience has worn thin.Bottom line is, I dont know what to think.  Three cameras set up wirelessly with no problem but the radios quit within a month.  One was dead out of the box and Another died that was purchased last November.  The colors during daytime are very nice and the infrared mode is great within about 15 meters at night.  Pan/tilt works great with my Android camera app, but because of the never-ending trouble with Loftek response and quality control, I have to give this IP cam one star only.", "Date": "July 9, 2012"}, {"Title": "Poor audio on wireless", "Author": "R Carlson MD", "ReviewID": "R1R09UHV45VN7", "Overall": "1.0", "Content": "Video quality is not too bad, but when using a wireless connection the audio has a very loud static sound which makes it completely unusable. When using a wired connection, the audio is OK. The company support people were no help and there was a high language barrier.", "Date": "June 13, 2012"}, {"Title": "Peace of Mind", "Author": "Omega X", "ReviewID": "R1PBVQ3AI3W5C6", "Overall": "4.0", "Content": "This camera meets my expectations and then some.  It has excellent night vision capabilities and rotates and pans very smoothly.  It can be hard to control depending on what connection you are using (local network versus internet).  The only thing I used on the software CD was the program to locate the camera on the network so I could change the settings.  It was very east to setup on my local network (LAN) but a tad more difficult setting it up to view on the internet (WAN).  The issue was due to my router and the need to do some port forwarding.  Once I had figured that out it was easy from then on and I even signed up for a dynamic DNS so I check it out more easily on the internet and I wouldn't have to worry about my internet service provider changing my ip address.  That \"security flaw\" that one guy was referring to is most likely the DDNS that the company attempted to set up for users so they wouldn't have to setup their own.  But it won't communicate unless you put that in the settings.  I have a solid firewall and have had zero problems with any unwanted inbound or outbound traffic from this camera.  I also use sensr.net to record video while I am away for added security.  I do plan on buying more of these cameras.  And like other reviewers have stated; you can't use the camera for looking out of a window at night as the infrared leds will reflect off the glass.  The camera would be pro if it had an option to turn the infra red off.  Minus a star because of that.  But overall it is a great deal for a solid pan and tilt ip camera.", "Date": "May 31, 2012"}, {"Title": "Excellent camera for its price", "Author": "dikkilona", "ReviewID": "RAXT6JF48N94N", "Overall": "4.0", "Content": "I purchased a couple of these cameras after researching a bunch of ipcams available in the $50 to $120 price range and loftek offered the best bang for the buck. At the time of purchase I was concerned about the mixed reviews the product received and the DDNS issue that a few reviewers talked about. But, those concerns melted away after I setup the device and used it for a week.The instruction manual shipped with the device is hard to read, but thankfully the manual is also available in .doc format in the CD that is shipped with the device. Setup was a breeze. If you have some basic knowledge about routers and networking, setting this up shouldn't take more than 20 to 30 minutes. Even if you have no networking experience, the setup videos posted on loftek.com is very helpful and you should be able to set this up on your own.Enabling remote view to access the camera from outside your local network requires changing your port forwarding tables in your router and the loftek.com videos help you with that too!Yes, the camera pings an ip address in China and sends your ip addres to loftek's ddns server, but that is being done to provide you a free DDNS service. If you are uncomfortable with this, you can always download and run the patch from loftek's support site to block this. Most ISPs usually provide a dynamic IP address for your home internet(you can get a static IP by paying extra) and therefore the  IP address for your home connection will often change. If you want to access your camera from anywhere outside your home,  you will have to keep track of the changing IP address of your home connection. To avoid this problem, a DDNS will give you a fixed URL to access your camera and the DDNS service will take care of mapping your current IP address to the URL. Anytime you use a DDNS, it requires you to send your current IP address to the service provider's server. If you are uncomfortable sending this to Loftek's server in china, you can use a local DDNS provider like no-ip.com or dyndns.com.Now to the camera performance. I have been using it for a week and I've had no issues with it, the picture quality is good at 640x480 resolution, the IR feature works great and I get excellent visibility even in pitch black conditions. I am able to easily tilt and pan the camera through the web interface. I've haven't yet played with some of the more advanced features such as setting up alarms etc. I'll update the review once I get to play with those features.Overall, I think this is an excellent product for the price it is offered at and I plan on buying a couple more!", "Date": "May 11, 2012"}, {"Title": "Wireless IP camera is a good value and easy to access", "Author": "D. Cristofano", "ReviewID": "R1L0Z1NBF3Y1GU", "Overall": "4.0", "Content": "I use this camera to observe an area of my home not currently served by my wired camera system.  This unit was easy to set up via a wired Ethernet connection and connected easily to my home WiFi network.  Once set up, all other management is done wirelessly.  Easy to access and I can view the scene from my PC or smartphone, including control of Pan and Tilt.", "Date": "March 17, 2012"}, {"Title": "Great day and night unit", "Author": "Jonathan Bradshaw", "ReviewID": "R2N86WGVB8K2K8", "Overall": "4.0", "Content": "I've used IP cameras for many years starting with the Axis cameras. I have an older generation Axis, a Foscam and now three of these Loftek CXS 3200 cameras. There are so many clones and variations on the base firmware and hardware it is hard to choose between them but I have been more than impressed with Loftek especially at the price point.First, the hardware IR filter is a MAJOR selling point. The daytime colors are much closer to true and when it switches to night mode the picture is great too.Second, the unit had no problems with my WiFi network unlike the other products I've tried. It holds the signal and so far all 3 units have been rock solid. I was worried I'd have to switch to using Ethernet to get reliability.Third, the picture quality. It is 640x480 but compared to the Foscam and old Axis I have the lens is far superior and the clarity of the image was above my expectation.Lastly, the unit is quiet (the pan and tilt motor noise is barely audible), the green LED can be turned off and unlike the Foscam the night time infrared LEDs do not have a strange red tint. They are completely unnoticeable.I use the cameras with Blue Iris software, they also work great with ZoneMinder.", "Date": "January 15, 2012"}, {"Title": "Cannot change the host name or backup camera settings", "Author": "C. Genovese", "ReviewID": "R2XAVTRX0O9QA7", "Overall": "2.0", "Content": "I have bought both the 2200 the 3200 and the 543 outdoor camera from Loftek.  You cannot change the host name on the cameras.  So when I have these setup for alarm when I get my text message for motion it gives me some random letters and numbers as the host name.  I can change the hostnames on my Foscam however.  Also If you want to configure a bunch of these cameras you have to setup each camera instead of being able to load a file onto the camera with all your settings.  Loftek has superior hardware to Foscam but the software in my opinion has flaws.  Also be very careful with the mounting screws where they enter the case.  If you try to change the screw out for a longer one you can puncture the IC chip on the board.  look through the hole in the bottom of the camera enclosure and you will see.", "Date": "January 5, 2012"}, {"Title": "Great Value!", "Author": "Branden \"Branden\"", "ReviewID": "R3VNRUHWJLZQOQ", "Overall": "5.0", "Content": "This is a great product for the price (I have to stress for the price)!  It is not the answer to every problem, but for the price it is a high quality product.  Relatively easy to get going.  The PTZ function can be a little slow.  The camera generally provides a blurred image when a person moves across a room at a normal pace.  If the individual is an acquaintance you will have no trouble identifying them, but the product is far short of providing id quality imagery for a moving target.  In general the motion detection works well.  Perhaps a little too well on several settings.  I initially was getting alerts when the amount of sunlight increased or decreased in my target area due to changing cloud cover.  Still, it is a useable feature if you adjust your sensitivity settings and location/position.", "Date": "November 12, 2011"}, {"Title": "Overachiever", "Author": "MDJ", "ReviewID": "RKATCIKGAQLHD", "Overall": "5.0", "Content": "This thing is unbelievably easy to configure, and has been extremely reliable so far. The picture is good for the amount of money paid. It's good for both dark and light environments. The motion detection feature exceeded my expectations. With the sensitivity set to 5/10, I get no false positives, and every time it should send me an email, it sends it.", "Date": "November 10, 2011"}, {"Title": "Save your time and money", "Author": "Daniel Epstein", "ReviewID": "R33JWCM4OS4WR", "Overall": "1.0", "Content": "All the PR descriptions sound great. Instructions poorly written; written in Chinese English. No live video upon initial set-up, just snapshot view. No direct customer support; only by email. Product appears to be defective right out of the box; returned camera for refund.", "Date": "June 28, 2013"}, {"Title": "Works okay for the price.", "Author": "Daekwan", "ReviewID": "R2TZF4T3S2P0V7", "Overall": "4.0", "Content": "Works okay for the price.  Found that using the Foscam firmware and software works better with this camera.  use the FW8910 software", "Date": "June 12, 2013"}, {"Title": "terrible customer support", "Author": "John", "ReviewID": "R2YLO1F2C4JE4", "Overall": "2.0", "Content": "this work as intended but if you have custom IP addresses this can cause a problem the company in my opinion is simply awful", "Date": "May 25, 2013"}, {"Title": "Worked as Promised But....", "Author": "C. Lam \"cnolint\"", "ReviewID": "RIRLTK15OA2EV", "Overall": "1.0", "Content": "Product worked as promised. All accessories included. Will definitely order another unit if available. Perfect packaging, bubble wrap and placed in a nice white box. A+++---Update--- July 1, 2013Infrared malfunctioned and is no longer working properly. Loftek Support is not stellar. Been following their instructions and submitted screenshots and sample images of the issues. Last response from Loftek agent was on June 14th, 2013 from info02@loftek.us. I inquired about RMA procedures on June 20th and have not heard from them since. Buyer beware!", "Date": "May 22, 2013"}, {"Title": "Never had an issue with this camera", "Author": "Jj", "ReviewID": "R12KET5AFYL0TT", "Overall": "5.0", "Content": "I've had this camera for over a year inside and have never had an issue with it, I use it to keep an eye on my dogs while I'm away from home, the alarm feature works great, also I stream the video to my Apple Iphone 4S using an app I purchased for a $1.99 called IP Cam Viewer. In total I have 4 of these cameras in use on my wireless network and they work great,", "Date": "March 22, 2013"}, {"Title": "Ok camera for price", "Author": "W. Huggins \"Wayne\"", "ReviewID": "R2YZ817JRHE5ED", "Overall": "3.0", "Content": "Automatic embedded DDNS entry,Loftek all have the hard coded DDNS entry. If concerned will need to block Ip address in the router or change ports.As for the camera it works ok and colors are ok but blury,the camera name / Alias can NOT be changed.(update) I got it to change but not sure how !As for the DDNS if you chose another service in the drop down list, IE(oray.net) and don't put in any other info and refresh it will disable the factory set DNNS. Or can use update from website.", "Date": "March 4, 2013"}, {"Title": "Wish I was a \"geek\"", "Author": "J. Suter \"artist\"", "ReviewID": "RV95DC2LN9CRR", "Overall": "4.0", "Content": "My son installed it and it worked fine for awhile.  Then we had an electrical outage in the home and it didn't come back on.When  the son comes back I'll watch and learn.", "Date": "February 27, 2013"}, {"Title": "Great wireless ip camera for the price", "Author": "Chest Rockwell", "ReviewID": "R3TDDFZVDK39G5", "Overall": "5.0", "Content": "For $70 this camera is great.  It is working well with ie6, firefox, chrome and the included software for viewing seems adequate.  I am also using it on my Android devices with a free app called IP Cam Viewer Lite.  I wish there was an option to turn off the IR LED's/photosensor but this is in no way a deal breaker.  The included instructions on set-up were descent and I supplemented the included info by watching youtube clips.  After set-up I was able to view the camera anywhere via the internet.", "Date": "January 27, 2013"}, {"Title": "Marginal night vision", "Author": "S. Robinson", "ReviewID": "R168TJ55AW1SZ5", "Overall": "3.0", "Content": "Purchased this camera to use as a security camera for both daylight and night.  The night vision of this camera is marginal since it is manufactured with only 8 IR LED.  That said, 3 of the 8 LED have failed, leaving the night vision almost worthless.", "Date": "January 24, 2013"}, {"Title": "Wireless problems", "Author": "MH", "ReviewID": "R36GSNIVEJNXWR", "Overall": "2.0", "Content": "I have both the CXS 2200 and the CXS 3200. The CXS 3200 has much better color rendering.The 3200 I have does not have the static in the sound like the 2200 does. The 3200 has significant pan backlash that the 2200 doesn't have. The 3200 I received had DHCP turned on. If you factory reset the 3200 it defaults to 192.168.0.178 like the 2200 does. Not a big deal, but annoying - they should update the default firmware settings to match how it's shipped. Like the 2200 the 3200 does not tell you the MAC address of the wireless adapter. This is quite annoying if you use wireless MAC filtering like I do. All that would be needed to make it easier would be to either label it or display it on the device info screen.The wireless on the received 3200 does not work over 5 feet from router - Returning it. My 2200 works over 100 feet.", "Date": "September 14, 2012"}, {"Title": "Very nice, easy-to-setup camera", "Author": "Hoa Nguyen", "ReviewID": "R2TSAZA0ZGWS8S", "Overall": "4.0", "Content": "I bought this camera to watch our chickens in their coop. It worked great.  Set up was easy, once I figured out that I had to use our kids' computer to run the BSearch_en.exe program that is on the CD.  My work laptop just wouldn't run it, probably due to all the built-in firewall rules that I can't control.  After that, it only took about 30 minutes to get it up and running, including downloading the program from their website (loftek.us) to turn off access to their Chinese DDNS server (thanks to the reviews here). I set it up on external port 80 (the normal http port, which I understand is blocked by some ISP but not mine), so I can just type in my IP address from anywhere and access the camera feed/control without having to enter a port number. That got me around the firewall at work also (which blocks most external ports), so that I can now watch the feed from anywhere.Both day and night modes work great, although I wish the night-mode red LED illuminators were less visible (more in the infrared) so they wouldn't bother our chickens--oh well, they did get used to it after a while.  The motor is audible through the built-in microphone when you rotate the camera, but not audible to your ears without the microphone feed unless you press your ears up to the camera. Mobile-phone mode is a little weak (no audio, no continuous pan and tilt--have to do it in steps).  I also wish there was a way for the admin to lock in the frame rate and picture size so other operators can't change them (to limit impact to your data throughput).I have not checked out the alarm and recording functions yet, so can't comment on them.All-in-all, it's a great camera.  We now have discovered that our chickens don't just settle down for the entire night.  It's quite entertaining.", "Date": "July 14, 2012"}, {"Title": "No luck so far", "Author": "Joker", "ReviewID": "R1QDM3C95D8G7H", "Overall": "2.0", "Content": "I am not that savy with forwarding the port so after I tried for five hours I called a company to come out and do it for me.  Well, the guy has 12 years of experience and has been to my house twice spending a total of five hours attempting to forward the port and has no luck so far.I have Century Link so he added an additional wireless remote to that remote.  I had a cisco wireless remote from Cox Cable but he had to upgrade that remote to one that has virtual capabilities.  I have a Samsung Stratsphere and not a Droid so I don't know if those two things are creating the issue.  I was able to download the app to my phone and I can watch my dogs from my laptop but no other laptop or my phone.I have another guy (the boss) who is a programmer coming out again next week.  I am hoping that he will be able to complete the task.  So far the bill is $80 and I am hoping that buying the Loftek at a discount is not going to create additional monies trying to get it to be wireless.If anyone has any advise I would love to hear from you.", "Date": "July 12, 2012"}, {"Title": "Pooped out after a week", "Author": "Epiphanius", "ReviewID": "RFV7P76RNJPS6", "Overall": "2.0", "Content": "We were going on vacation and I wanted to be able to check in on our pets remotely to make sure they were okay.  I did a lot of research and got this camera.  Luckily I planned ahead because before we left it failed.  I had time to order and install the previous Loftek model, which has been working great since then. BTW, the cats were okay and it gave us peace of mind to be able to check on them.", "Date": "June 15, 2012"}, {"Title": "NIce Camera, Nice Price", "Author": "MIghtyq", "ReviewID": "R14MKLI7BD9B20", "Overall": "4.0", "Content": "Camera was easy to set up. Took me about 15 minutes to get it going.The \"security issue\" has been fixed with a patch , if you don't want the free DDNS.Colors look good, works on my Iphone and Win 7 computers.The 2 way audio works too. I have not tried the ftp server, or alarm server.My only complaint, is I haven't figured out how to program the pan parameters.Overall this is a great value camera for the features and price.I would definitely recommend and purchase another one.", "Date": "June 1, 2012"}, {"Title": "Hard to configure, stopped working after a few months", "Author": "Susie Smith \"Savvy Shopper\"", "ReviewID": "REKMM3K0M389A", "Overall": "2.0", "Content": "The instructions are written in tiny print.  I don't even need or wear glasses and I had a very hard time reading them.I did finally get it configued and it was hard even though I do have technical expertise.  I never got it to work remotely through a browser though.The picture is blurred and it does not update frequently.  Poorly engineered.Now it has stopped working - Something is loose - if I jiggle the camera it might work or not.  I am replacing it with something better.", "Date": "March 26, 2012"}, {"Title": "here it cams!!!", "Author": "bertO", "ReviewID": "R1UQNJQZOJZ6DV", "Overall": "3.0", "Content": "Great size for a spinning camera, easy to install indoor/outdoor. Key features easy to configure software, works with Windows 7, alarm recording option works well, can be access remotely, etc... Only draw backs are, not working with Internet explorer 9, no zoom in option, pauses for 2 sec. using wifi. All in all still a good camera for watching my dogs and checking whose outside the house.", "Date": "January 29, 2012"}, {"Title": "Very Good Value. Quick setup - no problems. Good features.", "Author": "Brucer", "ReviewID": "R2QXSDAQ9Q3VW", "Overall": "5.0", "Content": "I've been using IP Cameras for about 10 years now and have a lot of experience with several brands. I bought this one as an indoor camera and because I wanted the night vision feature. First off, the camera works as advertised. All functions and features work as described and the picture quality is very good for a camera selling for under $80.  The night vision works well allowing a useful view in total darkness. The area I'm looking at is about 40 feet deep and the night vision covers it well. Setup is straightforward. Even if you are not familiar with router configuration it is not difficult to set this up if you follow the directions. The small startup guide included is a little hard to read but there is a better guide and some videos on the included disk to walk you through the process. As I mentioned, I'm very familiar with IP cameras so I had this up and running in under 10 minutes. Even before the camera was delivered I received an email from Loftek introducing themselves and offering to help with any questions that might come up. None did but that was nice touch. One reviewer mentioned his concern about the built in DDNS service provided by the manufacturer and I agree that a checkbox to disable that is a good idea but I disagree with the notion that this is any kind of security issue.  Anytime you send an email or visit a website you reveal your IP address and doing so to the manufacturer's DDNS site gives them no access to your network as your router provides protection through NAT translation and/or a firewall. On the other hand, for users that are unfamiliar with using a DDNS service, simply using the camera name without having to remember an IP address (which changes from time to time) takes you right to the camera from any browser or even a phone with web access. Each camera has a unique 7 character camera name and you get to it by entering it in your browser (i.e. '123abcd.nwsvr.com') Android and Blackberry users will find apps on the CD for easy access as well. Of course, if you already have a DDNS  service like Dyndns that you use that will work too and the camera will update it as well. Although I'm not using the alarm function I did try it out. You can set a schedule to detect motion and the camera will send you an email. Nice touch. If you use IP Cam Viewer on your android phone you will find that this cam is fully compatible. The CXS 3200 is an upgraded model from the 2200 and but the operation is the same. Bottom line is that this IP camera packs a lot of punch for a very reasonable price.", "Date": "January 4, 2012"}, {"Title": "Very nice IP camera", "Author": "Karakunlun", "ReviewID": "R14M7B7WPR7J6W", "Overall": "5.0", "Content": "First of all I have to say since I am working in the IT industry so I have fair amount of networking knowledge, so setting up this camera is quite straightforward to me. The instruction manual came with the camera is not that comprehensive, but since there are so many different networking gears in the market, it is not possible to get all the detailed steps needed on how to se it up in each users home network. But you do need to have some basic knowledge on home networking in order to get it working, most challenging part I guess is to get an intranet IP address assign to the camera, and how to configure your router to do port forwarding if you need to use/control it from Internet (of course you need to otherwise it beats the whole purpose).Once setup the camera works great. Picture resolution and quality are good, works with browsers on PC, Mac, iPhone, iPad, etc. Motion detection and alarm also works great, although configuring a mail server to send alarm emails is a trial and error process that needs several iterations. Anyway after everything setup this is a very reliable, nice IP camera, and I will definitely buy more products from them.", "Date": "December 18, 2011"}, {"Title": "Great Product!!", "Author": "Paul", "ReviewID": "R31ZDFR2HFU2ZH", "Overall": "5.0", "Content": "High quality video feedback. I'm not a tech savvy but it was simple,and easy to install and setup. Just follow the instructions provided. Once you done setting up your ip cam network, if done correctly, you can watch it anywhere. I tried it on Iphone, and Android tablet. Just download the ip cam viewer from the app/market store. It will work over your phone 3G network, of course wifi is better. But you don't need to watch it all the time. Since you can set it to email you when the camera detects motion. I've tried it, and I got emails with pictures withing 2 mins.This is my first ip cam, so I don't know about the other brands. But I'm very happy with the product and I recommend it to anyone.", "Date": "November 17, 2011"}, {"Title": "Good company, 50/50 troublesome hardware", "Author": "WendyKellyBudd", "ReviewID": "R1C6CHD5OCSDJ2", "Overall": "4.0", "Content": "Update 01/03/12:  I was offered a replacement camera (Loftek CXS3200).  I shipped my faulty camera, gave them the UPS tracking and the same day, they shipped out a replacement.  I received that camera and it's DC transformer (aka power cord) had weird fluctuations in the power.  Hubby put a volt meter on the cord and it went between 6.75 - 8.5 volts, never at the required 5 volts. Needless to say, the camera was lighting up like a Christmas tree and then dying at 3 second intervals.  After emailing back and forth, I was promised a replacement cord.  Got it and it works.  So far, I've had 2 Loftek CXS3200 and 2 Loftek Nexus 543.  Only 1 has worked well after it had a bad power cord.Loftek supports their products, I'll give them that.  Polite people who listen to what you have to say.  However, their hardware is lacking.  I really want the Nexus 543 to work, but how many can I send back before they or Amazon cut me off?Update: 12/04/11.  Well, exactly 34 days into using the camera, it would miss recordings at night. I normally get 8-10 videos at night, now it gets 1 or 2. I emailed them and after several emails and trial setups, it was determined that the camera is in a room that's too cold.  Their website says Operating Temp:  -20C to 50C.  It's in an unheated room at the backdoor of my California home, goes down to 43F (6.1C) at night.  This is what I received from support:Quote:\"Actually the operate temperature for our indoor camera is 0-55C, please make sure the temperature not lower then 0 centigrade.\"I responded that it only went to 6.1C.\"I think it is too cold for the camera to work properly at night.Please install it in the warmer house , or warm it.\"  \"Staying in the low temperature environment for a long time will affect the electronic component performance.\"What?  It's within the advertised Operating Temps.So what am I to do?  It's past the 30 days to return.  I like the camera.  It should work at 43F.(awaiting an answer from Support, will update when I hear from them)--------------------------------------------------------------------Oct 27, 2011:  The cxs 3200 camera is more than I expected. I have it setup approx 80 ft from my wireless N router and it keeps the signal flawlessly.  The resolution is pretty darn good for under $100. The pan/tilt is silent.On Loftek's website there is a .pdf with instructions for the install, but I found the 'Guide' area more helpful: [...].  Also, read the reviews on Amazon for the cxs 2200 for install help, and on youtube for lktown's setup video. The full-sized CD that comes with the camera has the instructions also.I'm new to ip cameras, port forwarding, ddns, etc, but I'm not afraid of a challenge. I used a netbook as my learning tool for setting up and using a webcam.  And used Yawcam free software.  After I got it up & running and felt I had learned what needed, I purchased the CXS 3200.It surpasses the netbook in so many ways. My hubby loves the pan/tilt. It's movement was so quiet that it didn't scare a raccoon that was 5 feet away from the camera. The night vision took photos of a red fox and emailed them to me. The red lights on the ir are very faint.  Didn't bother animals at all.Did I mention support?  Responses to email within the day.  I could see myself getting another camera for the fun of it.I'm going to try Blue Iris software next, but the included software is pretty good for my needs.fyi, I'm on Windows 7 64-bit desktop.  Also works on my Vista laptop.Enjoy!", "Date": "October 27, 2011"}, {"Title": "Really nice for the price", "Author": "phoneguy", "ReviewID": "R1QJ195E112I81", "Overall": "4.0", "Content": "I've been bottom fishing for a really nice IP camera in this price range.  The Loftek isn't perfect, but it does come close.  Getting a camera with the IR cut filter at this price is compelling.Installation was about as easy as any of the similar cameras I've used.  Hook it up on a wired LAN, find the camera with the included utility, and set the parameters.  It came up on Wi-Fi with WPA encription no problems.  Some cameras are limited to WEP, or even no encription on Wi-Fi.Full size CD was included, and camera has standard 1/4-20 mounting threads, and a nice swivel mount thrown in.Best feature is night vision sensitivity, it lights up objects 25 feet away easily.  They only claim 15 feet.  I'll try to post example pics to the product description.The two negatives for this thing are barrel distortion with the included lens, and you can't turn off the IR LED's at night.  The web server has buttons for controlling them (Internet Explorer only), but they just don't work.  A big drawback if you're trying to shoot through a window.  You can turn off the green indicator LED, but not the others.Overall, this camera has much better sensitivity in the dark than a Wansview megapixel camera I've used, and has much better daytime colors than the popular Foscam FI8918W due to the filter.  The Foscam has firmware bugs that make the autoexposure go haywire occasionally, forcing a reboot.  If the Loftek doesn't have that flaw, it will be head and shoulders above it.I debated between 4 and 5 stars for this one, but the lack of controls for the LED's just couldn't let me go 5.  If you're not shooting through windows, it's not a big deal.", "Date": "October 23, 2011"}, {"Title": "Awesome!!", "Author": "M. Boyett", "ReviewID": "R1K5TK6DZUOQVG", "Overall": "5.0", "Content": "I ordered this camera mostly to be able to monitor things at home while I'll be away for a 10 day vacation, but also just for general security purposes.  It came via USPS today (about 5 days for delivery) and I think I've got it completely set up now, INet remotely accessible, etc.  And I LOVE it!I didn't have any problems setting it up on my local LAN, but did have to contact LOFTEK for getting it WAN and remote access capable.  I sent them an email around 9 p.m. tonight and had a response within the hour.  I needed this help because I don't have any experience or knowledge about \"port forwarding\", etc. and also because I have an ATT U-Verse router and I had no idea how to access the router's \"virtual server\".  The LOFTEK tech sent me detailed information, then after I sent a few more questions, answered them in detail and in no time, the system was up and going and I could access the camera via the Internet from a laptop.This is the first security cam I've ever had experience with, so I can't compare it or it's features to any others, but for the money, I don't think it could be beat.  Everything seems to be working fine -- color, audio, etc.  I haven't set any \"alarms\" yet, such as motion detection or email alerts, but will likely try that out tomorrow.  I also have not tried the wireless camera out more than about 20 feet from my router, so I don't know how strong the signal will be, or even if there will be a workable one from a more isolated location, i.e. my front door.At any rate, I recommend it; it is working fine for me and just what I wanted.UPDATE (Nov 28, 2011):  Just received a 2nd camera and got it set up last night.  Took a while to get both cameras working through my firewall with a router other than a D-Link, but that's due to my lack of knowledge about how firewalls/pinholes work, not the camera's fault.  Both are now set up to view locally (LAN) and over the INet (WAN).  Second camera is set up outside, about 40 feet from my router thru several walls, and signal seems to be good.  In complete darkenss, the coloring is mostly a combo of greys and blacks, but is fairly clear.  In daylight, the color is stunning, in my opinion.  For the price, I don't think this camera could be beat.", "Date": "September 28, 2011"}, {"Title": "very messy network setup", "Author": "andrew", "ReviewID": "R2L2JYKT662VBU", "Overall": "2.0", "Content": "So first of all the picture quality is geat.The problem is with the setup.The camera has a default ip of 192.168.0.168, the problem is that most US home routers have a default network of 192.168.1.xThis means a lot of routers will not assign an ip address to this device and you will never be able to discover it to reassign the ip address to the range of your home network.The device should ship with the default set to 'obtain IP automatically' but it does not  .I sent one unit back thinking it was defective as it would not obtain an IP address before carefully checking the doc's when the second unit did not register with either of my home routers.Unless you are comfortable setting up a 192.168.0.x vlan on your home router DO NOT BUY - It probably will not work.", "Date": "November 27, 2012"}, {"Title": "crap", "Author": "Jeanette Lee \"ibme-ubu\"", "ReviewID": "R24JNYD835MNLB", "Overall": "1.0", "Content": "hard to connect.  would not ever purchase again.customer service was hard to contact as well.There are many other out there look for another brand.", "Date": "March 21, 2012"}, {"Title": "nice picture, but unusable as wireless", "Author": "Bob O.", "ReviewID": "R1UTG3XENCOVV0", "Overall": "1.0", "Content": "First, my qualifications:I'm an Electrical Engineer, working in the IT field as a network engineer designing data center networks. I know what I'm doing.Bottom line assessment:This camera is either defective or junk or both.Observations from poor documentation and emails with Loftek support:1. camera wifi does not comply with IEEE 802.11 w.r.t. passphrase characters allowed.2. device firmware is poor -- needs special undocumented procedures to try to get it working (SEE: \"please scan several times at this step, the interval between the first scan and the second scan should be longer than 15 sec.\" AND \" I think you must set several times for wireless setting , right? Please try to restore your camera to factory setting , then try to connect wireless again.\" ( below)3. Support is in east Asia, probably, judging by their hours and English fluency: \"we are available for remote access from 9pm-10am New York time.\"4. they actually expect customers to be gullible enough to open up your computer and wireless router to unnamed people from an unknown overseas location.  I think not!------------------My email chain with Loftek \"support\"Camera sees wireless signal, but fails to connect over wireless when wired ethernet is disconnected.I am WPA2 Personal/AES on both ends of link with matching keys.nice camera except for this show-stopperany ideas?-----------------Dear Robert,Thanks for your message and suport on our product. As for your problem ,Would you mind have a check the following steps:1) did you PC work well in wireless?2) Make sure wireless setting is ok , router settings parameters( wireless SSID and Encryption)should keep the same as camera wireless setting.  1-Did you broadcast the SSID of your router?  2-please don't use special characters in wireless key?  3-Disable mac address and ip filter in your router?  4-can you scan your wireless network in the camera's wireless network list? if not, please scan several times at this step, the interval between the first scan and the second scan should be longer than 15 sec.  5- As our camera just suport 802.11b/g, so please make sure you use corresponding mode 802.11b/g in your router.Please change the channel to 11(1-11 is ok), but you'd better not use 12 or 13; And ensure you connect the right router.  6-How far from the camera to your router?if your camera still can't connect wireless after try those steps above, please tell me more detail about your wireless setting in your camera and router.That will be a big help if you can show us the screenshots about the wireless setting both in the camera and router. Thank you.Any qusetion , feel free to let me know.Thanks for your time.Best Regards,-------------I have 1 laptop, 2 iPads, a Wii, and wireless printer all working wellbefore adding Loftek CXS3200. I operated Mixed mode 802.11B/G on channel11 With WPA2-PSK AES/TKIP. My passphrase was WPA2 standards-compliant at30 printable ASCII characters (upper and lower case, numbers, andspecial characters like #$%_*). SSID is broadcast. MAC filteringenabled.The CXS3200 could see my network (40 feet away) and several others muchmore distant. It would not connect. Slow flashing green LED.based on your suggestions, I tried numerous iterations of reducingsecurity on the wireless access point and camera:1. backed off to AES only (removed TKIP)2. removed special characters from pass phrase3. disable MAC filtering4. set pass phrase to abcdefghcamera is configured with a static IP address on the LAN.You can either send me a replacement black CXS3200 camera and we'll tryagain OR I'll return it to Amazon and find another manufacturer.nice camera except for this non-functional wireless-----------------Dear Robert,Thanks for your message. So sorry to hear that your problem still not solved. You mean you can find your wireless network in the camera when you scan and the LED green light is flashing , right ? That mean wireless function in camera is work. I think you must set several times for wireless setting , right? Please try to restore your camera to factory setting , then try to connect wireless again.I hope those above is help , if not , we can give your remote suport.You just need download a remote software \"Teamviewer\" , and give me id and password so that we can access your pc to help you configure the camera. You can download it here:[...]By the way , we are available for remote access from 9pm-10am New York time.Please adviseThanks for your time.Best Regards,------------------I am sorry. I thought I was buying a wireless webcam, not signing up as a beta test site. If you would like to connect to the camera, you can find it at Amazon in Lexington, KY, USA on  Monday 16 January: Tracking Number: 1Z41130490453", "Date": "January 14, 2012"}, {"Title": "EXTREMELY POOR QUALITY", "Author": "Keash Doc", "ReviewID": "R199R0SPZ5MM9D", "Overall": "1.0", "Content": "I was excited after reading all the positive reviews.  The unit came with the antenna screw loose so that there is no way to mount the antenna properly.  It seems EXTREMELY poorly made.  It is going straight back.  I suppose I should learn my lesson and stop thinking that Chinese products will actually have some basic level of quality control.  Save your money and get a quality camera.  You get what you pay for.", "Date": "December 5, 2011"}, {"Title": "Great camera, the software cut the 5th star", "Author": "geogeo", "ReviewID": "RNN8Y21GLSMXC", "Overall": "4.0", "Content": "Camera is just great. Easy to set up, easy to use. That is what I was looking for for a long time. And for that money! Just amazing!My problem is the software. I have not managed yet to view the streaming from outside my lan, Wlan. But have not given up yet. If I can make it work, it will earn the 5th star and I will post the procedure here.", "Date": "November 29, 2011"}, {"Title": "Gute Nachtkamera, aber LEDs überstrahlen gerne", "Author": "Ingo 11 \"Ingo 11\"", "ReviewID": "R1WPIQ36WJA8B6", "Overall": "4.0", "Content": "Kurz und bündig: Die Kamera ist an sich wohl eine der Besten, es gibt aus meiner Sicht an dem Gerät nichts auszusetzen.Einzig die IR-LED's überstrahlen gerne in der Nacht und bei kurzen Entfernungen.Ansonsten: top.", "Date": "October 25, 2011"}, {"Title": "Doesn't work, install buggy and camera never appeared", "Author": "Andy", "ReviewID": "RO4HMFGGIN79G", "Overall": "1.0", "Content": "Very buggy software, camera would not install to where it could be viewed (just big black screen)  No tickee no laundry", "Date": "December 10, 2011"}, {"Title": "DOA", "Author": "Joseph Rafferty", "ReviewID": "R2GBT1G82ZA5X5", "Overall": "1.0", "Content": "dose nothing from what i can tell it's stuck in some type of a power cycle loop (with the way the network light act)never shows up on network or on server asking for ipya i ordered the outdoor 3x zoom dome we will see when it gets here if it's as bad as this if so it all go's back and i never buy loftek NEVER", "Date": "December 6, 2011"}, {"Title": "Really??", "Author": "A. massena", "ReviewID": "R3KLVNM4XG7DT7", "Overall": "1.0", "Content": "I have built my last 3 computers so I have some tech skills.  I'm the av kid of my friends.  I get called when something electric breaks and I'm fixing computers more than I would like.  This \"thing\" is way beyond my pay grade.  The instructions are a joke.  I don't wear any kind of glasses and needed a magnifying glass to read what little was there. Maybe I had a defective camera.The instructions were barely tolerable until the port forwarding part.  That was a so bad. I called a buddy who is an IT guy for a fortune 500 company.  He came over and after about an hour said it had to be defective. Unless you have really good router skillz I would stay as far away from this as I can.", "Date": "December 11, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005CFSZE6"}}