{"Reviews": [{"Title": "A Splendid, Easy-to-Use, Camera", "Author": "Lawrence H. Bulk \"Lawrence H. Bulk\"", "ReviewID": "R2R0334BCFJ62T", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo23S9W88VFUNCHembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo23S9W88VFUNCHrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo23S9W88VFUNCHchiDiv\").innerHTML = document.getElementById(\"cv_mo23S9W88VFUNCHhiddenPre\").innerHTML;\n};\ncv_mo23S9W88VFUNCHrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo23S9W88VFUNCHso;\t   \n\n\nfunction cv_mo23S9W88VFUNCHloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo23S9W88VFUNCHso = new SWFObject(swfLocation, \"cv_mo23S9W88VFUNCHAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo23S9W88VFUNCHso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo23S9W88VFUNCHso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo23S9W88VFUNCHso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo23S9W88VFUNCHso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo23S9W88VFUNCHso.setAttribute(\"height\", swfHeight);\n          cv_mo23S9W88VFUNCHso.setAttribute(\"width\", swfWidth);\n          cv_mo23S9W88VFUNCHso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo23S9W88VFUNCHso.write(\"cv_mo23S9W88VFUNCHflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo23S9W88VFUNCH', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo23S9W88VFUNCH';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo23S9W88VFUNCH', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo23S9W88VFUNCHloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo23S9W88VFUNCH\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m26KOLDKEFLXGB\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m26KOLDKEFLXGB\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2R0334BCFJ62T\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m26KOLDKEFLXGB/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo23S9W88VFUNCHduration')) {\n      document.getElementById('cv_mo23S9W88VFUNCHduration').style.display='none';\n    }\n    cv_mo23S9W88VFUNCHloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo23S9W88VFUNCHloadSwf(movieID, playerVersion) {\n   return _cv_mo23S9W88VFUNCHloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo23S9W88VFUNCHnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo23S9W88VFUNCH', 0, h);\n}\n\nfunction cv_mo23S9W88VFUNCHresetPlayer(w,h,bw,cc) {\n  cv_mo23S9W88VFUNCHnewHeight(h);\n\n  cv_mo23S9W88VFUNCHso.addVariable(\"resetBandwidth\", bw);\n  cv_mo23S9W88VFUNCHso.addVariable(\"cacheCode\", cc);\n  cv_mo23S9W88VFUNCHso.setAttribute(\"height\", h);\n  cv_mo23S9W88VFUNCHso.setAttribute(\"width\", w);\n  cv_mo23S9W88VFUNCHso.write(\"cv_mo23S9W88VFUNCHflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo23S9W88VFUNCHRollOverImg = new Image();\ncv_mo23S9W88VFUNCHRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81%2BRlD5r70S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo23S9W88VFUNCHpreplay = document.getElementById('cv_mo23S9W88VFUNCHpreplayImageId');\nif (cv_mo23S9W88VFUNCHpreplay) {\n  cv_mo23S9W88VFUNCHpreplay.onmouseover = function() {\n    cv_mo23S9W88VFUNCHpreplay.src = \"http://ecx.images-amazon.com/images/I/81%2BRlD5r70S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo23S9W88VFUNCHpreplay.onmouseout = function() {\n    cv_mo23S9W88VFUNCHpreplay.src = \"http://ecx.images-amazon.com/images/I/81%2BRlD5r70S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo23S9W88VFUNCHpreplay.parentNode;\n\n  var cv_mo23S9W88VFUNCHcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo23S9W88VFUNCHcurrentClick) {\n      return cv_mo23S9W88VFUNCHcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:25 Mins==================================================================================================================================IMPORTANT UPDATE February 9, 2012: It has just been announced that Kodak is exiting the digital camera business. Please see Comment #7 for further details. Nonetheless, because it is so good, I still highly recommend buying this camera.==================================================================================================================================I am very pleased with this little Kodak Easyshare Touch M5370 Digital Camera (Blue) and I am certain than anyone buying one will be just as pleased.Ease of use is very important, in my opinion, in small cameras such as this which are meant for snapshots, both candid and posed. When taking such pictures, the user often does not have the time nor the inclination to play with camera settings. He or she just wants to turn the camera on and take the pictures (or videos) quickly - and have them turn out perfectly.That's what you will achieve with this camera 99% of the time - and that with just using the Smart Capture mode.Turning on is almost instantaneous and turning off is equally quick.You can see from my video that the camera adjusts to scenes with different light levels quickly and unobtrusively. Focus is automatic (of course) and very quick. (When taking video, sound is recorded even when zooming.)Not only do videos turn out perfectly, so do still pictures - and without any extraneous input from the photographer.Just turn it on and fire away.Of course this camera is primarily intended for stills. (I do not know of any way to add a still picture to this review; that's why I attached a video taken with the camera. At least you can see the quality of the images it produces.)(Regarding video, I might mention that, contrary to the printed instruction manual which shows an option of video at 1920 x 1080, and contrary to at least one review here which states that the camera takes 1080p video, it does NOT take video at this level. It has but two options: 720p and VGA video. With a 4 GB Micro-SDHC card, this translates to 29 minutes at 720p and 2 and a half hours at VGA level. My video was taken at 720p.)I very much like the touchscreen controls and I have to admit that I was somewhat apprehensive about them. I needn't have been. They are as easy to use as is possible and, as I indicated, you do not actually have to use them if you don't want to. Your pictures will almost always turn out just the way you want them.The colors produced are vivid and beautiful (as you can see in the video, taken on a Fall afternoon around 3:30 PM). Different color types are available and easily accessed for those who wish to modify the look of pictures; even black-and-white and sepia tone are offered.For those who are more advanced, there are options offered in-camera to crop a picture, adjust its color, and several other things besides. (I have not as yet used these options.) Videos, likewise, can be edited in-camera. These options are really nice to have and can prove very useful to many people. In other words, you can improve your photographic results without the need to buy expensive computer programs and your photographic knowledge can improve without outgrowing the camera.There are also several other settings, including a Program (programmable) setting, for those who wish to exercise more control of their pictures. This Program setting too is extremely easy to use.I REALLY like the facial-recognition feature and the ability to automatically (or manually) 'tag' pictures with the names of people. Not only does this feature allow identification of people when viewing the pictures on the camera's screen, the tags carry over when you download the pictures onto your computer. (I use a Linux viewing program called Gwenview and, when I view a picture tagged via this camera, the name(s) of the people are clearly displayed. I am sure that other image viewing programs available for Windows and Mac will do the same thing.)Now to the nitty-gritty. This camera has a Schneider-KREUZNACH lens which appears to be of good quality (this company has always had a good reputation). It features an optical zoom ratio of 5:1 (equivalent to a 28-140 mm lens on a 35 mm camera) which is adequate for most people and will not require the use of a tripod (as do lenses of large zoom ratios). By the way, if you do use a tripod, you will find that a tripod mount will not interfere with battery/Micro-SD card access.The lens is somewhat slow (f 3.9 - 5.7) which is about the norm for cameras of this class. It is unfortunate that it is not somewhat faster (allowing more light to be registered). With such a small camera and with so many mega-pixels (16) crowded into a tiny sensor, \"noise\" (\"grain\" in film image terminology) is inevitable under low-light conditions when pictures are taken without flash. While this \"noise\" is not inordinately obtrusive under normal household illumination, critical viewers will easily be able to spot it.The camera does have several flash options, all easily accessible from the main screen (even in Smart Capture mode); you can set the flash to Auto Flash, Always-on Flash (for use outdoors when you want fill-in flash), Auto-Red-Eye removal (pre-fires a small flash so the subject's pupils contract somewhat), or No Flash at all. (Even with Smart Capture, there are certain things that you yourself will have to \"tell\" the camera what you want.) Using flash will alleviate any \"noise\" problem indoors under low light.While the camera does have a small capacity built-in memory, you will definitely want to buy an optional Micro-SDHC card. I bought this Kodak micro SD 4 GB Class 2 Flash Memory Card with SD Adapter KSDMI4GBPSBNAA. This one is inexpensive and comes complete with an SD adapter, necessary to use to insert the card into most computers which have card readers. (I do not know why Kodak chose to use the Micro SD format which is much less widely used than the \"plain\" SD format; we have a Fujifilm FinePix T300 14 MP Digital Camera with Fujinon 10x Wide Angle Optical Zoom Lens (Black) which is just about the same size as this Kodak and it uses a normal SD card. The Micro-SD size is awfully small, especially for my fingers. But there it is.) 4 GB offers 749 pictures at the maximum quality (much more at lesser quality). That's a lot of pictures!I also bought this Kodak 1972736 Hard Camera Case (Black) from Amazon. (Right now it is selling for $2.99! Other colors are available but they cost $12.99. So I \"settled\" for black!) It is a very nice case offering good protection. It also has room for an extra Micro-SDHC card as well as a spare battery or two.Regarding spare batteries and external chargers: do NOT buy Kodak's offerings. They are too costly. Buy this 2Pcs Battery+Charger for Fuji NP-45 NP-45A instead. Not only do you get an external charger, you get not one but TWO spare batteries. PLEASE NOTE: The NP-45 battery is exactly the same as the Kodak Rechargeable Li-Ion Battery KLIC-7006 used in the camera. Just compare the prices for their battery and their charger.To protect the LCD screen I strongly recommend this 3x Kodak Easyshare M5370 Camera Premium Invisible Clear LCD Screen Protector Cover Guard Shield Protective Film Kit (3 Pieces). It is very inexpensive, it fits perfectly, and it is easy to apply. Plus, in the package, you get three shields; you can use the other two for any other appropriately-sized product you may have.As I use a variant of the Linux computer operating system and Kodak does not support this, I cannot comment on photo sharing. Frankly, I have no interest in that (I do not belong to Facebook, Twitter, or any other social network) but, knowing Kodak, I am sure that their sharing function works well and is easy to use. I'll refer you to other reviews here which may comment about this feature in much greater detail.To sum up, I like this little camera very much. The pictures produced by it are exemplary. No one need ever be embarrassed by their quality. The same applies to the video produced by it. I plan to carry it wherever I go; I have always wanted to do this (there have been several times when I wished I had a camera along when I saw something which would make a nice photo) but, until now, I did not have the means for doing so. (I do not have a \"smart\" cell phone and, in any case, most of the pictures I have seen produced with such cameras do not match the quality of a dedicated camera, at least in my opinion.) So this one will be with me always. It will not replace my \"main\" camera (a much more sophisticated model) but being so small and of such high quality, it may be available when my \"main\" one is not.Obviously I give it a very high recommendation. I thank you for reading this, for watching my video, and for considering my opinions.==================================================================================================================================Update: December 6, 2011Courtesy of Amazon Vine, I now own both this  Fujifilm FinePix T300 14 MP Digital Camera with Fujinon 10x Wide Angle Optical Zoom Lens (Black) and this Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD Video Capture and 3.0-Inch Capacitive Touchscreen LCD (Blue).The Fujifilm camera has many more possible adjustments than does the Kodak plus it has a 10:1 zoom lens as opposed to the Kodak's 5:1 lens but the Kodak is much the easier of the two to use.I have taken some pictures back-to-back with both and, at least in my opinion, pictures taken with both are nearly identical in quality.Since the Kodak is the easier to use, I have given it to my wife and I myself will use the Fujifilm model.But either would make a fine choice and I am very pleased with both of them.", "Date": "October 27, 2011"}, {"Title": "The Little Camera that Can!", "Author": "Phyllis Staff", "ReviewID": "R150DLRC3SZGBY", "Overall": "5.0", "Content": "The Kodak M5370 is a little gem that was built for fun and convenience.  And with 16 mega-pixels, it can also deliver quality prints.  In the hands of a skilled photographer, this camera can produce photos almost as good as those that are produced by a single lens reflex.PROS:1.  The photos you'll get with this little camera are pixel-dense, so you can enlarge your photos up to 40\" x 30\" (or the biggest size on your printer).  It offers almost double the pixels of my very expensive single lens reflex camera.2.  Colors are accurate, and, with the 5X SCHNEIDER-KREUZNACH Optical Zoom Lens, sharpness is excellent (with a single exception mentioned below).  This is especially valuable because sharpening photos in digital labs will sometimes pixelate your photo and, therefore, may not produce the results you hoped for.3.  The camera itself is tiny and weighs very little, making it perfect to slip in a pocket or purse where it can be easily retrieved for quick use.  Say you're on a shopping trip, and you wonder \"Is this the right scarf for Aunt Maisy?\"  Grab a quick shot, head for the nearest internet connection, and upload your find to you mom for an almost instant response.  Another step into the future of photography!4.  Play with your photos while they're still in the camera.  Crop them, change their color or get rid of color altogether, decorate them with frames - there's plenty of options for editing your photos before you get home. The easy-to-use touch screen provides you lots of possibilities -- instantly!5.  Share those shots with friends.  Upload your photos directly to Twitter, Facebook, and other social media sites, plus you can send them directly to photo printers like those at drugstores and pick up prints on your way home (depending on the speed of the printer, not your camera.6.  And my favorite - blue.  Now I had to wonder why I cared if my camera was blue, but that was before I actually used it.  Here's one reason you might want a camera of a different color - identification.  The size of this camera, small, will not distinguish it from any other pocket camera in your collection, but its color will.  Grab and go just got a little easier.CONS:1. I'm still attempting to find a little camera that produces a sharp image at only inches from the subject.  This one comes close, but I'm not ready to award it my seal of perfection.2.  The memory in the camera holds very few photos (only eight for me).  Since I'm using the highest number of pixels, this is not a great surprise, but to use the camera as I usually do required the purchase of a microSDHC.  The camera will now hold a reasonable number of pictures -- but be aware that the microSDHC is NOT included in the box.  You must purchase it as a separate item.OVERALL:With the exceptions I've mentioned above, I could hardly be more pleased with this little camera.  And my objections are not serious enough to deny stars, so the Kodak M5370 gets all five.Five Stars!", "Date": "October 26, 2011"}, {"Title": "Better than I expected!", "Author": "Chris Jaronsky", "ReviewID": "R2096ZI9ZVJEEW", "Overall": "5.0", "Content": "This is a great camera.  I have had a few cameras, most were point and shoot, but I had an SLR way back in the stone age when you actually had to load film in a camera.  What?  How do you upload pics to Facebook with a film camera?  I know...I am not a camera expert by any stretch of the imagination.  My wife is, and she likes this camera.  Her photos are mainly close ups of food that she uses for her blog.  Great pictures, makes me jealous.  I had her put down her DSLR and try some shots with this Kodak Easyshare.  The pictures turned out fantastic, and she gave it her stamp of approval.Here are the things I like about this camera,-You can charge it with a USB cable hooked to your PC, or use the supplied USB cable and wall plug.  I am not a fan of cameras that take regular batteries that constantly need to be changed, or cameras that need to have the included battery removed and placed on a charger.-Uploading pictures to your computer is pretty effortless and automatic.  Set the destination once and it does the rest of the work for you.-You can take a picture, edit it, tag it, add comments, then the next time you connect it to your PC the camera will upload the picture and comments to Facebook.  That is a pretty handy feature.-The touchscreen is fantastic.  It is very intuitive and easy to use.  I like the touchscreen much better than having to play with buttons and a scroll wheel.-The camera only takes about a second to take a picture when you first turn it on.  That means you are much less likely to miss a shot waiting for your camera to turn on.-There are a lot of settings built into the camera.  While I mainly use Smartcapture, which takes excellent pictures, there are a number of other settings.  Long exposure, landscape which takes amazing landscape pictures and stitches the pictures together seamlessly, sepia, etc.  You can also crop the picture right on the camera.-I also like that the camera is small and very lightweight.  It easily slides into the front pocket of my jeans and can even be carried in a shirt pocket for easy access.I am very happy with this camera and I expect it to serve me well for a long time.***Warning***  While this camera does make it very easy to take pictures and upload them to Facebook, please try to be a little discriminating in that process.  I have a number of friends, that shall remain nameless, that constantly take and upload pictures of their \"precious children\" to Facebook.  Seriously?  I do not need to see a picture every time your child smiles at a bird or dog.  That is only interesting to you.  While I would like to see pictures of things that interest you, or your children, once in a while is sufficient.  I do not need 5 new pictures of your daughter before I have even finished my first cup of coffee in the morning.  Thank you for understanding.  I will now step down off my soapbox.", "Date": "November 15, 2011"}, {"Title": "Specifications are not accurate on amazon advertisement", "Author": "TC", "ReviewID": "R2PMLFGKMXFPG0", "Overall": "4.0", "Content": "This camera is a 16 MP camera--not a 14 MP camera.  I have the camera in hand and the box says 16.  So i thought I was sent the wrong camera.  I then verified that the model i received was the model amazon was saying was 14 mp.I then went to Kodak's website--it says 16 MP.  So, I would say this is a 16 MP camera and amazon is in error.Next:  I could find vague mention in my material that the camera had an internal memory but that they recommend an 8 GB micro SDHC class 4 or higher card.  So first, I tried to determine how much internal memory it has---the kodak website has it listed as 64 MB in one place and 18 MB in another.  I have not called Kodak myself--but it is disconcerting to me that I can't find reliable information on this camera.Regardless---anyone purchasing this camera should plan on buying a micro SDHC card (class 4 or higher).  The higher the class, my understanding, the faster it writes--so don't skip on that in my opinion, especially if you are going to take multiple pictures in a row or use video.  Also, people have complained that it uses a micro card rather than regular SD--my guess is that this is because a micro card uses less battery and it saves space--allowing for more advanced camera features to be packed in and not sacrificing on memory.The way the memory works is that it will automatically write to your card, but if your card gets full, it will switch over to camera memory.  You can transfer anything that is on the microSD card by plugging it into your computer directly (using a SD converter that comes with the card) or by leaving it in the camera and plugging the camera into your computer.To me, the easy share to facebook, etc. is a little gimmicky and misleading.  There is no wifi on this camera so it only uploads to facebook, etc, once you plug it into your computer.  It does save time because you don't have to go to the picture in the computer and upload it--but i wouldn't consider paying extra for this feature or buying it just because of this feature.The touch screen is great, but in bright sun you really miss the viewfinder.  Other than bright sun, it is great though and much better than using a view finder.  And touching the screen and navigating the menu is very easy.  I resisted touch screen cameras in the past thinking it was gimmicky, that finger prints would drive me crazy, and that it needlessly added to the price.  Well, at this point, I can say I prefer touch screen and they no longer add much to the cost of the camera.  And for me, finger prints haven't been an issue.  The ease of use is great and offsets any negative such as fingerprints.Pictures on this camera are comparable to others in the same price point.  This isn't a price point where you can expect to have perfect pictures in low light.  This is a compact, point and shoot camera.  It works better than cameras on cell phones but it is no DSLR.  My children have cameras that cost about $100 each (panasonic), and the pictures on this are slightly nicer.  they are crisp and clear as long as there is plenty of light.There may be advantages to the easyshare if you have an easyshare printer.  I do not so I can not comment on this feature.The biggest disadvantage is that to charge the battery, you have to plug in the camera.  I much prefer cameras that have charges that charge the battery separately--that way you can charge a spare while still using the camera.Overall, I would recommend this camera.  The blue color is beautiful (accurate on amazon's page).  It is very compact and takes good pictures for its class.  Make sure you buy a MICRO SDHC card or the camera won't be of much use (it will hold some pictures on the camera without the card, but not many).  These cards can be purchased for less than $10.UPDATE:  After taking multiple pictures I would say that 90% of the pictures are good.  They aren't as good as a DSLR but for the average user, this takes great pictures.  Low light pictures are the poorest--but that is to be expected from a camera this size.  Overall, I would say low light pictures are good enough--slightly less in quality than the daytime pictures (they are grainier).The video does a good job in daylight.  again, with low light it is very grainy.", "Date": "November 6, 2011"}, {"Title": "Great Digital Camera", "Author": "Caitlyn", "ReviewID": "R23WWK7Z2GY99A", "Overall": "5.0", "Content": "Although the interface for this camera is a little different than what I expected, I think that it has turned out to be a really great camera. I've been using the Easyshare Touch M5370 for about two weeks now, and I have taken some pretty amazing pictures.The different modes are really helpful when trying to capture pictures in low lighting or fast motion. If you buy this camera make sure to utilize the different modes (there are many) to take full advantage of what this camera can do. Also, you have the options to edit the photos right on the camera, which is pretty cool.Pros:Great touch screen (better than I expected)Good flashNice on camera editing capabilitiesOption to tag photos on camera and sort by tags, date, ect.Facial recognition for tagging photos. (it does actually work on many of my photos, surprisingly!)Many modes for different lighting/scenariosDecent low lighting photos (as long as you chose the appropriate mode - some other reviews say it just has an \"okay\" low lighting photo, but I think it's pretty amazing as long as you are in the right mode and not just the standard \"program\" mode)The color of the blue model is stunning!Comes to camera strap!Cons:Was worried at first that the cameras appearance seemed a little cheap (however it has has been sturdy so far and was okay even after I dropped it the other day)The touch screen layout was a tad confusing at first (different from anything I have used before - was able to figure it out though)Overall I really recommend this camera. It is a great buy for this price on Amazon!I love it so far. I was skeptical at first because I looked at so many camera and been pouring through Amazon reviews to find the \"perfect camera\" and it seemed like every camera I found had its flaws. But in the end after using this one I think its amazing and great for anyone that wants to take digital pictures and doesn't have around $400 to spend!", "Date": "June 12, 2012"}, {"Title": "Fantastic Touch Camera for a Nice Price", "Author": "Michael Todd", "ReviewID": "R29R3S93OMIJZ3", "Overall": "4.0", "Content": "This little camera is one of the easiest and most intuitive digital cameras I have ever used.  Right out of the box, it is simple to start using.  There are only five control buttons that are all clearly marked.  The start-up time is minimal; so, you can quickly take a picture after turning it on. The touchscreen is vivd and using it is similar to a screen on a smartphone.  Much of the operation of the camera can be done from the screen.The camera comes with a rechargeable battery.  Unlike other cameras I have owned, you do not need to remove the battery and place it in an adapter to charge.  This one can be charged simply by plugging the mini-USB cable into a computer or the (included) plug.  It is hugely convenient to be able to charge the camera quickly and easily--similar to how you charge a smartphone or iPad.The picture quality itself is quite high for a relatively low-priced point and shoot camera.  The colors are quite vivid.  I did have some problems in low light and indoor settings.  With some setting tweaks, I was able to improve on this some.  This has been an issue with every digital camera I have ever owned--although each successive point-and-shoot I get seems to be improving.  I also had some minor problems with blur when I take picture of quickly moving kids.  However, I have not found a camera in (or near) this price range that has managed to successfully prevent this from happening.One of the coolest features of this camera is the ability to edit and add captions and tags to pictures directly from the touchscreen.  I have had other cameras that say they can do something similar but it is quite difficult; the touchscreen makes this a breeze.The share feature is quite interesting.  It allows you to automatically upload and share designated pictures (with edits, tags, captions, etc.) to facebook, flickr, and other sites once the camera is connected to a computer.  This is a useful feature who shares pictures often.  However, I found myself reluctant to use it since I like to see my pictures on a larger screen (and edit further if needed) before posting them. I will acknowledge that this feature could be a huge time-saver if used on a regular basis.The camera itself (as with most) has very little built in memory; I could fit 3-7 pictures depending on settings.  It does allow for a Micro SDHC card, which I am not sure that I like.  These cards are so tiny that it is quite easy to lose them.  I accidentally dropped one while sitting on the sofa and had to spend several minutes searching through cushions to find it.  But, this seems to be the trend with cameras.  I am not sure what was wrong with regular SD cards.  Oh well, that is a very minor concern with an otherwise fantastic little camera.The biggest plus is the cost.  This is a remarkably affordable camera considering the features that it includes.", "Date": "December 15, 2011"}, {"Title": "For a Person Needing an Easy-to-use Camera - this is GREAT!", "Author": "Happy Reader", "ReviewID": "R2A0J8TNE5C1LF", "Overall": "5.0", "Content": "I am not a camera afficianado by any stretch. I want crisp clear photos, like anyone else, but I don't want to learn F-stops and such - I need an \"idiot camera\". My previous camera is an 8.0 megapixel A835 by G.E. (G.E. Aspheric Zoom Lens, 3X 6.1-18.3mm 1:2.8 - 4.8). It was a big step up from my previous digital camera, so you can tell that I don't have to have the top of the line.This Kodak M5370 EasyShare Touch has 16 megapixels and 5X zoom (Schneider-Kreuznach,  28mm WIDE - 140mm (Equivalent)) so it is a very nice step up from my G.E. It is an idiot camera in that you don't need a lot of knowledge to operate, but it is not an inferior camera. The quality of the photos I've taken is very good, certainly meets my needs.The M5370 is better than my old camera for more reasons than its increased pixels and zoom.  On my old camera, changing the zoom was done by a toggle on the back. Press one side of the toggle to zoom in, other side for zoom out. This M5370 EasyShare has the zoom using a small lever on the top of the camera. I like it better because you do not have to move your finger from one side of a toggle to the other. It's a smoother, easier operation.The camera has limited memory for photo/video storage, but so does my old camera. You need to purchase a separate memory card. It uses a microSDHC disc (very small, for use in some phones, also). I purchased this class 2 Kodak 8 GB card, which comes with an SDHC adapter. According to the packaging on this memory card, it will hold 5000 5-megapixel photos. So, on the average, it should hold 1,562 16-megapixel photos, which still works for me.Kodak micro SD 8 GB Class 2 Flash Memory Card with SD Adapter KSDMI8GBPSBNAAThe M5370 uses a rechargable Li-ion00 battery. I give the G.E. an edge on this, as it uses AA batteries, but to me it is six of one and half dozen of another. Depending on the situation, either version has drawbacks.  That said, though, the M5370 has a great set-up. I bought myself a spare battery, the Kodak KLIC-7006:Kodak 3.7 Volt Li-Ion Rechargeable Digital Camera Battery - KLIC-7006You need only ONE cable for the M5370. You use it to connect your camera to the computer. You don't need a second cable for recharging, because the computer cable plugs into a \"switching adapter\", basically a two-prong plug, which you then plug into an electrical outlet to charge the battery. My camera before the G.E. had two cables, so I think this set-up is pretty great. I would suggest to Kodak an alteration to the switching adapter, making it so that the two prongs can fold away for easier storage of the adapter itself, but overall, it's nice to have only one cable. I've added a photo above showing how the computer cable plugs into the adapter.The first time I plugged the M5370 into the computer, to upload photos, I got the pop-up asking if I wanted to install the KODAK Share Button App. You have to install the app to use the share feature on the camera. (The share feature is pretty awesome, so I'll get to that next.) Unfortunately, the app would not install from this initial pop-up. The mini-manual which came with the camera had directions for that, though. You go to the Kodak website and install from there. That's what I did. You have to create a Kodak Gallery account (email address, 1st name & password), which takes half a minute. From there you add places to which you may want to automatically share photos or videos you take on your camera.  YouTube, Twitter and Facebook are three of the several places available.I have a facebook account. In order to add my facebook account to Autoshare, I had to add the KODAK Share Button app to facebook account. It's really easy; you just \"allow\" the KODAK Share Button account on facebook, just like any game app, etc. And it's just as easy to delete on facebook if you change your mind.Easy share is pretty amazing. While a photo or video is on your camera, you tag it with facebook (or whatever). Then, when you upload the photos/videos from your camera to the computer, the photo you tagged (and only the ones you tagged) are automatically posted on your facebook page.Just a note, in case it's pertinent to you, you do NOT have to have KODAK Share Button installed on your computer in order to copy photos from your camera to the computer. Before I installed the Share Button app, I copied photos and videos from my camera to a desktop file with no problem.The M5370 has lots of cool options for simple photo manipulation, that works right on the camera. As an intelligent plus, when you've manipulated a photo, the camera asks you if you want to override the original photo, or save the manipulated photo as a new photo. Very smart. That way, if your manipulation didn't quite work out, you can try it again on the original photo.I've added two imperfect photos above to just give you an idea of two of the options available. One is \"Background Blur\". When you select this, the whole photo is blurred, and then, using your finger, you paint which part of the photo you want to unblur. The photo above shows the photo blurred except for the man sitting on the floor, who I painted. Note, this is just a quick try, to give you an idea of how it works.I added a second photo above showing the \"Caption\" option available. You get to pick on which of the four sides of the photo has the caption. In the example I show, I added a caption to all four sides. You can't do this on one pass though. You add a caption to one side, save it as a new photo, then bring that photo with the caption up again, add a caption on another side, save it by \"replacing original\", bring the photo with two captions up again, add a caption on a third side, etc. It is easy to do, but it just takes a few steps.An 81-page Extended User Guide is available on the Kodak website (the address is given in the mini-guide included with the camera). You can view it on-line, or on PDF to view or print out.  Kodak also has several How-To videos on it's website.I purchased this case for the camera, which is nicely padded, and fits it perfectly. It has an outside zip pouch for carrying an extra memory card and battery.  Caselogic TBC-302 FFP Compact Camera Case (Black)Like any \"touch\" screen, a \"touch\" may not always work on the first try, and it is difficult to keep it smudge free.Overall, this is really a great camera.", "Date": "January 21, 2012"}, {"Title": "so far I love it", "Author": "a reader", "ReviewID": "R2BVG99JHIODO", "Overall": "5.0", "Content": "This camera takes great pictures and is very user friendly.  I have an old Kodak Easy Share and a Canon Sure Shot.  I like this much better than either of those.  The touch screen makes it easy to use and it's much more intuitive than the Canon Sure Shot as to settings etc. When it's on auto it does a very good job of compensating for back lighting, snow etc.  I'll try to upload a photo I took or our recent October blizzard on the automatic setting.You should know, however, that the internal memory will only hold about five photos and the camera does not come with a memory card.  Also, it takes a micro memory card, something I didn't even know existed, so I suggest you order one when you order the camera unless you want to be told \"memory is full\" after five shots.  As seems to be the norm now with new electronics, the user's guide is minimally informative - it doesn't even mention what kind of memory card the camera requires, for example - perhaps there is more on-line but I haven't gone there yet.I will update this review as I use the camera more and learn more of its capabilities.", "Date": "November 29, 2011"}, {"Title": "Easiest digital camera I've ever used!", "Author": "Doc Stew", "ReviewID": "R18YJ8T38Q0RW", "Overall": "5.0", "Content": "This is the perfect camera for those in your life that hate technology. If they just want a literal \"point-and-shoot\" camera, this should be on your short list.It's literally got a switch for camera or video - that's it. No other messing around with white balance, ISO, etc. It's definitely not for the photography enthusiast, as there are no real options to enhance/change your picture settings.It's an all touchscreen camera. I was hesitant, as some other touchscreen products I have (Sansa Fuze+) I despise due to a clunky interface. Luckily, Kodak got it right. The touchscreen is very responsive, easy to zoom in and out, and easy to flip through pictures like a digital picture frame. I love using it - super easy.The picture quality has been very good. It rivals my Canon Elph SD770, which takes fantastic pictures. It's far better than my Panasonic digital camera (Panasonic's take awful pictures). There is very little digital noise (fuzziness/pixelation), which is always a concern with a high megapixel camera.This camera connects to your computer seamlessly with a micro USB cable. You can take photos and upload them easily to Facebook, Flickr, etc. It'll even recognize up to 20 faces in your photo and tag them all with names! It's a very handy feature if you do a lot of uploading of photos to social networking sites.It uses a micro SDHC card, which is a slight annoyance. I'm not quite sure why cameras are moving towards micro SDHC over just regular SDHC. It's not like anyone I know has said \"man, these SDHC cards are just SO big and cumbersome!\" Micro SD cards are just SO small, and SO easy to drop and lose. Plus you need to use an SD adapter to plug in into your memory reader in your computer. To me, it's just an annoyance that isn't necessary.I had a problem with the camera freezing while taking pictures, viewing pictures, or even taking video. The only solution was to take out the battery and pop it back in. I called Kodak, and they said it's likely a bad micro SDHC memory card. Sure enough, as soon as I took the card out, the camera worked perfectly.This is a great, straightforward, nice quality camera for everyday use. Highly recommended!", "Date": "November 17, 2011"}, {"Title": "Great touch screen camera", "Author": "Gadgetman", "ReviewID": "R3BVJCWW2UEOGU", "Overall": "5.0", "Content": "I have been using my Canon powershot SD series camera for many years for point-and-shoot pictures taking. This Kodak Easyshare touch screen camera provides an unique pictures taking experience in terms of simplicity and ease of use.Below is a list of what I like about this camera :Touch screen control.- the camera has five control buttons (power on/off, shutter/zoom, video recording, play back/revew, and easy share) which greatly simplifies the operations. The touch screen display is 3\" in size. It is very sensitive and provides similar experience as your iphone (except that it is not a multi-touch screen)- The touch screen menu is quite intuitive which allows us to set various picture taking modes, flashes, timer, and date/time stamp.- The display shows the number of pictures remaining and the amount of video recording time available based on the storage capacityEase of use- The camera automatically installs the Kodak Easy share software the first time you plug it in your PC. It walks a through a list of questions to tailor our sharing preferences (eg email accounts and websites for sending and uploading the photos/videos). I tried the facebook upload feature and it worked flawless by creating a new album with the picture on my facebook account- the camera has a 26 MB built-in internal memory and a slot for micro-SD cards. We can also drag-and-drop the pictures / videos using the windows explorer if we choose to bypass using the Kodak easyshare software for uploading the pictures.- ability to charge the battery through the PC's USB port.Picture and video quality- the pictures are of great clarity with the 16 megapixels resolution- provides good quality 1080p HD video recording- 26 mm wide angle lens and 5X zoomsWhat I would like to see better for this camera  :- the micro USB connector on the camera seemed to be intentionally designed to make a tight fit. It requires some amount of force to connect the USB cable. This could also presents the risk of damaging the connector.- the camera SD card slot only takes micro (not full-sized) SD cardsOverall, I am quite pleased with this camera particularly with its touch screen controls.P.S. A full product manual is available on the Kodak support web site.", "Date": "October 25, 2011"}, {"Title": "Kodak camera", "Author": "Laurel Ellis", "ReviewID": "R2LOKD3KW5W82D", "Overall": "4.0", "Content": "It was time to replace our old digital camera and my husband decided this was the one I needed.  He loves his little camera.  He loves the ease of the touch screen and he's able to see it more clearly than the old one.  Me,  I have to wait until he leaves the camera laying around before I can even get my hands on it, but the few times I've used it it does seem to be easy to figure out and so far most pictures are clear, even a few of the ones taken in the evening that were close came out clear, the ones taken farther away were too dark.", "Date": "April 18, 2012"}, {"Title": "Kodak M5370", "Author": "Bob", "ReviewID": "R3DPKIHQBOXUXL", "Overall": "4.0", "Content": "Very pleased with this camera, it is simple to use and the price was reasonable for a camera with a touch screen, I have owned several kodak cameras and am always happy with their product.", "Date": "January 23, 2012"}, {"Title": "Get this if you can't afford a $600 camera.", "Author": "Sharbat \"Sharbat\"", "ReviewID": "RS04BMG3JOM5V", "Overall": "5.0", "Content": "I bought the Kodak Easyshare 16MP camera when it first came out with 4 monthly payments, 7 software-bundle and a $75 KODAK coupon from HSN; plus free shipping. It was also cheaper then.  With this deal, the camera is more than free.  I am not complaining about the touch screen and the fact that I accidentally take photos of anything because the touch screen is a bit sensitive. Deleting photos is a breeze. The options are also very nice; but the touch screen feature is the best.", "Date": "September 30, 2011"}, {"Title": "Terrible Camera", "Author": "Kelly", "ReviewID": "R28W6QL1SL4U4W", "Overall": "1.0", "Content": "I have had this camera for almost a year now.  I am constantly taking pictures of my kids to scrapbook.  I've always used Kodak cameras, so when my last one broke, naturally, I bought another Kodak.  This camera is awful.  It freezes after every picture, so I need to take the battery out to reset it each time.  It takes 10 minutes to zoom in or out and it takes pictures on it's own!  After a day at the zoo today, I have about 10 pictures to show for it and the rest are blurry pictures of peoples backs that the camera took on it's own.  It is very frustrating.  My kids are little (4 and 2) and I wanted something simple to point and shoot.  I don't have time to play with it and reset it while chasing after my kids, i want to be able to quickly snap a good quality picture.  This camera is a complete waste of time and money.  I've never been so dissapointed in Kodak.", "Date": "June 26, 2012"}, {"Title": "Very Happy Customer", "Author": "QuEeNmOm iii", "ReviewID": "RABS1Y3T0FDZP", "Overall": "5.0", "Content": "I received my Easyshare M5370 Last week Friday and Im very happy took a few photos and the sharpness is wonderful. I'm on now looking for a memory card which is a must get when you buy a digital camera. As i'm reading I see u can use the memory card from your Phone so i went and found my old Blackberry phone which had a 16g memory and fits perfectly I never saved anything on it when I was using it, so im happy i just saved so money. I can buy the extra battery and car charger YES.....", "Date": "March 15, 2012"}, {"Title": "Great camera for the price", "Author": "Blanko", "ReviewID": "R3ONXGWX5L88HB", "Overall": "4.0", "Content": "I bought this camera for Valentine's Day to give to my wife. I wanted to buy her a simple camera with a good amount of features, and this camera was perfect for her to use. She likes the facial recognition software that's built-in to the camera. It allows her to tag people for Facebook purposes. The HD video capability is great. We used it recently to document her sonogram and the quality was great. Photo quality is great as well, each picture came out crisp and clean.  Overall, we are more than impressed with the quality and capability of this particular camera.The only problem with this camera we've experienced is the USB cable doesn't recognize the camera when connected to any PC. Aside from that one flaw, this truly is a great camera (for the price).", "Date": "March 7, 2012"}, {"Title": "Might be a good choice for teenagers, but better cameras out there", "Author": "Mary Jo Sminkey \"15 years of Amazon Reviews!\"", "ReviewID": "R1ZYZHDUFIS73K", "Overall": "3.0", "Content": "I've used a lot of compact cameras and I do a lot of posting on Facebook so I was intrigued by a camera that would send my photos to FB automatically. However, it's not all that easy, you have to install and configure the Kodak software and mark photos on the camera to be uploaded, etc. Since you have to hook up the camera to a computer to send them, it saves a fairly minimal amount of time. The photos are decent enough in good light conditions but personally I find the touch screen interface annoying and not not particularly easy to use. Reviewing images can be slow and the screen not sharp enough to really judge them well. If you are just a point-and-shoot consumer, you may not mind this but if you want to tweak your shooting at all, this is not the camera to get. I'm not really sure the 16MP is a plus, consumers think more megapixels, the better, but you aren't going to get much benefit from that, and the photos just will take up lots of additional room on your computer. The image quality is reasonably good for a camera in this price range, and the 5x zoom also better than the more typical 3x than many cameras this size have, but I personally find I often want even more reach (not counting digital zoom which pales in comparison to real optical zoom) and you will definitely find better image quality as well in slightly more expensive cameras. The images were still a bit soft and with a bit of purple fringing and low light definitely was sub-par. Again, if you don't care about this kind of stuff, and you want something in this price range, you may be okay with this camera, I personally look for something better. I also don't like the micro-SD card at all, most cameras this size use normal SC cards which are cheaper, far more ubiquitous, and many laptops, printers, etc. have readers built right in. These micro cards are really easy to lose, and you need a converter to read them in a normal SD slot. This alone is a big reason I would not recommend this camera real highly.If you are on a really tight budget and can't spend much on a camera, this might be one to consider. For its price, it's pretty decent. I just personally would look for a camera with a few more features and shooting options, that is going to do a better job in more situations.", "Date": "March 15, 2012"}, {"Title": "Kodak Camera", "Author": "Bob W. Porter \"Movie Bug\"", "ReviewID": "RL33UJNYM0EGG", "Overall": "4.0", "Content": "Great Digital Camera.  Good touch screen operation.  Great pictures.  A little smaller than I would have liked.  Would have liked it to have a standard memory card instead of the micro which is difficult to insert and remove.", "Date": "March 11, 2012"}, {"Title": "Good for the Tech Savy or Beginners", "Author": "CPR \"xfilebuffyfan\"", "ReviewID": "R1GSYK4F9SERGB", "Overall": "4.0", "Content": "I gave this to my mother as a gift.  This was her first touch screen product & was very hesitant to use it.  She saw all of the features for video, picture editing, sharing to Facebook, etc - this was overwhelming to her.  But within 15 minutes she was taking pictures, uploading on her computer, and printing.  She now volunteers to bring her camera to family events.  She found quite quickly that where before she was confused by all the buttons, now she just pushes the button on the screen that corresponds with what she wants.  The screen menus often described the feature and how to return to the home screen easier than button based cameras.  I would've never guessed it, but my mom is now a digital camera junkie.  It was an awesome gift.", "Date": "May 6, 2013"}, {"Title": "Nice Camera!", "Author": "Shortyboy", "ReviewID": "R69JBHBFHVRTU", "Overall": "4.0", "Content": "Great camera.  The picture quality is amazing.  Does well in low light situations.  The only thing I would say negative is the amount of time it takes for the picture to disappear off of the screen before you are able take another picture.  It takes about 8 or 9 seconds which may not seem like a lot of time but if you have people posing (especially kids) and you have to wait this long before snapping another picture, it seems like forever.  Besides that I love it!", "Date": "August 17, 2012"}, {"Title": "Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD Video Capture and 3.0-Inch Capacitive Touchscreen LCD", "Author": "SAMUELS32", "ReviewID": "R2EKN5Z6V2E0NJ", "Overall": "5.0", "Content": "EXCELENTE PRODUCTO, ENTREGADO EN EL TIEMPO ACORDADO, 100% RECOMENDADO TANTO EL PRODUCTO COMO EL VENDEDOR.Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD Video Capture and 3.0-Inch Capacitive Touchscreen LCD (Silver)", "Date": "May 26, 2012"}, {"Title": "Great camer, a little small", "Author": "crocodile bobbies", "ReviewID": "R3HLWJXZOXU9W6", "Overall": "5.0", "Content": "We finally bought this kodak camera out of frustration, since we needed a camera which would shoot in MP4 video, so we could show the video on our Asus transformer E pad. The detail of the pictures of this camera are amazing. This camera captures things which you cannot see with your eyes! The color accuracy is better than two other cameras we tried. Video is so,so, but if you zoom in before starting the video the detail is very good, and the color accuracy is very good. The camera responds well to changes in lighting in the video mode. The touch screen is easy to use. The startup is very fast. The only \"con\" is that the zoom in video mode is digital and not optical.Sony HX10V colors were yellow, bad low light video, 4 sec from startup. Then we bought an Olympus SZ-10, which was a better camera then the Sony, but again the color accuracy was poor.", "Date": "May 18, 2012"}, {"Title": "Great Camera.", "Author": "kansascity", "ReviewID": "RPK2Y8O9IV0WT", "Overall": "5.0", "Content": "Love this camera. Takes great pictures, and the touch screens a nice addition. Battery life is good, everything about this camera is great. Its a nice size, and easy to use. Yay :D", "Date": "May 1, 2012"}, {"Title": "Disappointed - Don't Bother", "Author": "Disappointed - Don't Bother", "ReviewID": "R1DSNWADHNRHUG", "Overall": "1.0", "Content": "Camera was purchased for a gift.  First time used - camera froze and the battery had to be taken out for it to work again.  Second time - a lens obstruction error displayed on the screen and would not allow the camera to be used for several days (nice when you are on vacation).  However, the more disappointing issue is that Otter Creek Trading will not replace the defective camera they sold me.  Instead, they finger-point back to Kodak instead of standing by the products they sell.  I have purchased 6 Kodak cameras previously (none from Otter Creek Trading and none with issues).  Disappointing!!!", "Date": "June 1, 2012"}, {"Title": "nice kodak camera", "Author": "Lawrence J. Bierl", "ReviewID": "R3SI2XOHMGI7VH", "Overall": "5.0", "Content": "Its a nice camera I am still trying to learn allits features,  It is, selling a little cheaper in a local store but I like dealing with Amazon.I ordered it over the holidays so delivery took alittle longer seeing as the post office was closed", "Date": "January 28, 2012"}, {"Title": "Kodak easyshare touch M5370", "Author": "Laurie", "ReviewID": "R2GO8YFY8RZCH6", "Overall": "5.0", "Content": "The M5370 camera is easy to use and takes good pictures. I love using it. I like the touch screen instead of all the buttons on the last kodak that i had.", "Date": "October 20, 2011"}, {"Title": "Not great", "Author": "Lauren A.", "ReviewID": "RCGO5O4X6HEMG", "Overall": "2.0", "Content": "I've had this camera for about 6 months and I now feel that I can write an accurate review on it.  I am a point and shoot user.  I've never had a fancy camera.  In addition to this camera, I have a Canon Powershot.  I will say that I prefer the Canon.  The Kodak definitely has advantages - the touch screen is nice, the image for pictures is nice and large, it's easy to scroll through pictures and quick to download the pictures from the camera.  However, for me there are two big minuses.  First, it is VERY easy to delete all of the pictures from the camera.  My 19 month old got her hands on my camera and in less than a minute, all of my pictures were deleted.  That won't happen with the Canon (my version is the 1300 pixel, light blue - I got it in early 2010).  Second, the Kodak doesn't take great pictures.  The Canon pictures look better even though this Kodak has more pixels.  I find that the pictures often come out too blurry and dark.  I find that with the Canon most of my pictures are good. In fact, I've even had some DSLR snobs ask me what type of camera I used when I posted some newborn pictures I took on facebook.  The pictures come out nice and crisp. With the Kodak, not so.  I get a bunch of OK pictures, but nothing great.  Overall, this camera is nothing to write home about.  2 stars.", "Date": "March 15, 2012"}, {"Title": "If you don't want to spend much, this is what you want.", "Author": "J. Evans", "ReviewID": "R1VCD10JL1TC7I", "Overall": "4.0", "Content": "The Kodak Easyshare Touch is a camera meant for those who just want something to point, shoot, and get a decent photograph. Grandparents, younger kids, teenagers are what i would imagine this camera is for. People who are only going to use it every now and then to remember birthdays parties and going out. The camera gets the job done and that is all i can say that is good about it. the zoom is only 5x which is good for just zooming in on groups of people. This is not good enough if you plan on capturing pictures of things that are distant. 5x may seem high...but it really isnt. The camera i use everyday is my Canon s95 which has a digital and an optical zoom, this camera just has the one. For the price you cannot complain, its a good camera for the price point. I found the touch screen very responsive and the pictures vivid and the controls on the touch screen very simple. When you first turn on the camera it even has a demo video you can watch, which can be helpful. There are very few physical buttons to push which makes the camera look easy to use and simple. The finer tuning is done with the touch screen(deleting photographs, editing) it even has a tool that lets you tag the people in the photos. overall a cool little camera for novice photographers.", "Date": "October 26, 2011"}, {"Title": "A capable little camera", "Author": "Big Al \"Alan Rivière\"", "ReviewID": "R399IQIL95VYY8", "Overall": "5.0", "Content": "This Kodak Easyshare Touch M5370 Digital Camera measures 2-1/4 X 3-5/8 X 5/8 inch thick. It fits into my palm with room to spare, but it can do most things that an amateur photographer would want to do - taking family and vacation pictures, those of little Jennifer playing soccer, household inventory for insurance purpose, pictures of products in stores for later discussion with your spouse, etc. It is super-easy to use; you just point and shoot in the \"Smart Capture\" mode and the camera does the rest. All the pictures I have taken in this mode are sharp with vivid colors.This camera comes with 5X optical zoom and 5X digital zoom (which is not described on the Amazon web-page, but is shown in the spec-sheet), making the total zoom 25X. Optical zoom is accomplished by moving the lens while digital zoom is done by enlarging the picture digitally and filling in with additional pixels, which can sometimes degrade the resolution. There doesn't seem to be any way to turn off the digital zoom. However, my pictures at the maximum zoom are just as sharp as those at wide angle, at 16 megapixels resolution. Controls are displayed on the 1-3/4 X 2-3/8 inch touch screen, which may take a while to get used to. There are only 4 hard buttons on the camera - On-Off, Shutter/Zoom, Video Record, & Preview. In addition to still pictures, you can take HD videos (about 4 GB or 29 minutes in length) with this camera. To do that, you need to install an optional micro-SDHC card (not included) for additional storage. The built-in internal memory is very limited at 18 MB - that is enough for only five still pictures at 16 megapixels. There is a built-in programmable flash for low-light situations. The camera comes with a rechargeable Li-Ion battery, an AC charger, and a USB cable. Pictures and videos can be easily uploaded to a computer hard drive via the USB cable, which doubles as a charging cable.  You can charge the battery at the USB port of your computer or with the AC charger.In addition to the \"Smart Capture\" mode, you can take pictures with the \"Scene Mode\" in special situations - close-ups, portraits, sunset, night landscape, etc. With some practice, you may be able to take spectacular pictures with ease. Furthermore, You can send pictures to your friends and family with the optional Kodak \"Easyshare\" software, which can also be used to organize and edit pictures. You install this software in you computer from the internal memory of the camera. The spec-sheet describes the system requirements asWINDOWS XP SP2, VISTA, WINDOWS 7 or laterINTERNET EXPLORER 6.0 or higherMACINTOSH 10.4, 10.5, 10.6 or higherSAFARI 1.1 or higherIn conclusion, this Kodak Easyshare Touch M5370 Digital Camera is a capable little camera at a reasonable price.See my comment below for more info on this camera.", "Date": "November 14, 2011"}, {"Title": "Camera FREEZES UP", "Author": "T. Neou", "ReviewID": "R1BQFD3CCJ5DES", "Overall": "3.0", "Content": "Camera freezes up alot. Touch screen does not respond all the time. Video zoom resolution breaks up. Ive had this camera less than a month and already having problems with NO drops!!", "Date": "April 4, 2012"}, {"Title": "Great value! Fast shipping", "Author": "Funk", "ReviewID": "R1GFVWRM8YGYLE", "Overall": "5.0", "Content": "Fast shipping and a camera that is top of the line. I don't understand how this camera is only 89$. It seems like it's better than any camera ive seen around 130$. Easy to use with the touch screen and HD video has zoom. If your looking for a camera below 100$ this is the one you need to buy.", "Date": "April 8, 2012"}, {"Title": "Good camera", "Author": "Boris", "ReviewID": "R1B4KSVB81FOL1", "Overall": "5.0", "Content": "Good camera for travelling. Long lasting battery when taking stills but short when filming; it just lasts 30 continuous minutes. On the other hand it takes about 2 hours to fully recharge.. I'm thinkig of buying 2 other batteries because I love filming. It's remarkable that the cam records in High Definition.BE SURE YOU BUY A MEMORY CARD WHEN BUYING THE CAM NOT TO FEEL FRUSTRATED BY THE ONLY-4-PHOTO CAPACITY OF THE INTERNAL MEMORY.Amazing 16-megapixel resolution.Very sensitive touch screen and easy to set up.Good performance in high altitudes.Good election. :-)", "Date": "November 11, 2011"}, {"Title": "Do explain why you liked or disliked it.", "Author": "Parker", "ReviewID": "R2BGGEA76E2GZN", "Overall": "1.0", "Content": "the item was not good,the camera was not the camera i order, the camera could not come on at all.", "Date": "May 29, 2014"}, {"Title": "check online shopping price before you have your camera repair", "Author": "Pam_amazonrating", "ReviewID": "R7D0MZNHQ3UXS", "Overall": "5.0", "Content": "so far so good. Had to replaced my old same camera but it's worth to buy  this price than to pay the repair fee.", "Date": "May 23, 2014"}, {"Title": "Gift for my wife", "Author": "OPsDad \"New Media Consultant\"", "ReviewID": "R1FL18ADNHFIF9", "Overall": "5.0", "Content": "To my wife, everything is a photo opp.  She uses her iPhone 5 a lot, but I wanted to get her something with optical zoom and more pixels.  This made her happy... and when mama's happy, everyone is happy.", "Date": "May 15, 2014"}, {"Title": "Good 16 MP camera", "Author": "nukegvj", "ReviewID": "R16LBIJX66U4VB", "Overall": "5.0", "Content": "Does everything I want it to.  Have taken dozens of pictures and videos. Good color, high quality images.  Telescopic video is great.  The video telescoping starts where the photo telescoping ends. IE if you start video record then telescope you can bring things about 5 times closer. If you photo and telescope you can bring things about 3 times closer. If you start video with the telescope at 3 times closer you can bring it to 8 times closer.", "Date": "May 14, 2014"}, {"Title": "okay camera for the price.", "Author": "LMJ", "ReviewID": "R346EY3SOVLB8X", "Overall": "4.0", "Content": "I had this camera for over 2 years and never had any issues with it. It would sometimes show signs of slowing down, but I do think that was because it needed a larger memory card. Would really suggest this camera for anyone who is looking to take good quality pictures without costing too much money.", "Date": "May 13, 2014"}, {"Title": "Very satisfied with the product. Excellent quality", "Author": "D. Ruddock", "ReviewID": "RAPNX2CFV8COK", "Overall": "5.0", "Content": "been using this camera for a long time now, and easy to use, and very small and compact to carry, pictures are excellent, the digital information in the screen makes it simple to use", "Date": "February 7, 2014"}, {"Title": "nice camera for point and shoot", "Author": "pathfinder", "ReviewID": "R1PE4BPJ7132Y2", "Overall": "4.0", "Content": "Has some nice settings, however, it's tripod threaded hole is off center and isn't the best configuration for using a boom type tripod on a regular basis. I found the settings easy to use, and great for a basic photographer like me.", "Date": "December 13, 2013"}, {"Title": "Kodak is still #1 !", "Author": "Rose", "ReviewID": "R279L44A8M0YL1", "Overall": "5.0", "Content": "This camera is great!  Beautiful pics and effects!  It is small and compact!  You can carry it anywhere!  Great lens and zoom!", "Date": "November 26, 2013"}, {"Title": "REVIEW OF MY M5370 DIGITAL CAMERA", "Author": "Richard B. Hudson", "ReviewID": "R3NW17QP2BM85F", "Overall": "5.0", "Content": "THIS CAMERA'S CAPABILITY ALONG WITH MY TELESCOPE PROVIDES MORE DETAIL WHEN PHOTOGRAPHING STARS AND PLANETS. WHEN PHOTO GRAPHING CLOSE UPS ON OUR LOCAL WILDLIFE PROVIDE GREAT RESULTS.", "Date": "October 31, 2013"}, {"Title": "Great camera", "Author": "Sam Considine", "ReviewID": "R3EQZHMX9BNTA4", "Overall": "5.0", "Content": "I had a another camera just like this one and dropped it on a tile floor.  I liked the camera so much, that I wanted another just like it.  Camera was fine in a new box but without the setup-CD.  I am having difficulty in down loading the set up program from the camera or the Kodak web site.", "Date": "October 8, 2013"}, {"Title": "So far really like the camera.  I have not had any pictures printed yet.", "Author": "Salina Major", "ReviewID": "R2CRDM6TK7ZUM5", "Overall": "5.0", "Content": "I am still learning how to use the camera.  So far I really like it though I have not had any printed yet.", "Date": "October 7, 2013"}, {"Title": "Kodak Easyshare Touch M5370 16 MP Digital Camera", "Author": "Trina", "ReviewID": "R2A09MJ9D9LK0S", "Overall": "5.0", "Content": "Beautiful pictures...just got it today, will review it again after I come back from a cruise I'm taking with my daughter!!", "Date": "October 2, 2013"}, {"Title": "Okay point and shoot", "Author": "Nicole", "ReviewID": "R3HBPMEICHHRVC", "Overall": "3.0", "Content": "Bought this as a back-up for a family trip to Europe. The pictures came out nice and the panoramic/stitching features are easy to use. The touch screen is a bit too sensitive and will take lots of pictures of the inside of your luggage and wear out your battery. It gets glitchy in hot weather, such as the lens will stick or the screen modes will change if you breathe on it.It is a good choice for a young person who wants to use their own camera and upload pictures straight to facebook.", "Date": "August 9, 2013"}, {"Title": "my new camera", "Author": "Connie Villaverde", "ReviewID": "R1I3OFGH5F9P5W", "Overall": "4.0", "Content": "I like it very much. It has lots of features that I need to familiarize myself with. I am a slow learner,but once I get the hang of it ,I will love it. The pictures are sharp and the picture is bigger and more to capture.I will enjoy my new camera..it's also great with panoramic's!", "Date": "July 23, 2013"}, {"Title": "Had one, lost it; got another ...", "Author": "G. A. Jacobs", "ReviewID": "RDSO1YUP2EQGO", "Overall": "5.0", "Content": "... because I wanted something versatile, easy to use and durable. This wins on all counts. For serious work, the big guy comes out. For fun stuff, for things where I want a camera around for a quick document, this is the one. Many easy-to-navigate features, from serious to fun. Recommended, thumb's way up!", "Date": "July 21, 2013"}, {"Title": "This camera is no longer supported by Kodak", "Author": "mike", "ReviewID": "R3VEUKUFD1O61L", "Overall": "1.0", "Content": "After just a couple of uses the camera will not shut off and is almost brand new never been dropped And taken well care of Don't buy this camera Kodak does not support it and isn't even in there camera or video option on there web site", "Date": "July 16, 2013"}, {"Title": "Great Camera for the price.", "Author": "Teresa Savage", "ReviewID": "R1Y6PHM80ZFB45", "Overall": "5.0", "Content": "Bought this camera for my daughter and was so pleased with the picture quality that I purchased one for myself.", "Date": "June 24, 2013"}, {"Title": "A yes if your looking for a travel camera", "Author": "Corinne H Tubbs", "ReviewID": "R3FGTVQWMGJVI7", "Overall": "5.0", "Content": "A nice small compact little camera that takes great pictures. Just what I was looking for for travel!I have been using it on a regular basis since I received it!", "Date": "June 10, 2013"}, {"Title": "Great camera--performs as represented.  Easy to set up and transfer photos", "Author": "lindaforklifter", "ReviewID": "R25HRCI4VIUR6R", "Overall": "5.0", "Content": "Clear photos.  Easy to transfer to computer.  Convenient size to carry.  Have had other Kodak cameras and each one is better than the last", "Date": "June 5, 2013"}, {"Title": "is a good camera", "Author": "Job Yepes", "ReviewID": "R3V2S11KX3HWJ7", "Overall": "5.0", "Content": "yep  it is a good camera I love that I have not to buy batteries  it is very small really it is a very good camera", "Date": "May 26, 2013"}, {"Title": "It is a great camera", "Author": "Karen Clark", "ReviewID": "RYM4J6ZNHA7VD", "Overall": "5.0", "Content": "It takes great pictures, does not blur and is small and compact.  It is all I need.  If  I were a professional photographer, I would need more but it is great.", "Date": "May 14, 2013"}, {"Title": "4 star camera", "Author": "margaret metz", "ReviewID": "RMJS1ZGLQGFW", "Overall": "4.0", "Content": "4 stars due to there are a few things that still confuse me about this camera. Takes great pictures and touch screen is great.", "Date": "April 22, 2013"}, {"Title": "exactly what i need!!, meet my expectations!!", "Author": "testerboy", "ReviewID": "R1B2JTJ47R2ZRF", "Overall": "4.0", "Content": "good quality lens, easy handle, good quality pictures, intuitive menu, basic editing pictures software built in. the settings for different enviroments works pretty well. i like it. to improve: faster processor, more rugged case.conclusion: if you want a good quality camera for less than a hundred dollars thi is it.!, i recommended it", "Date": "April 3, 2013"}, {"Title": "Great Little Camera", "Author": "SGA", "ReviewID": "R13GX8B046F80J", "Overall": "5.0", "Content": "I bought this as a replacement for a 4 year old Kodak. I shoot mostly outdoors and I'm quite pleased with the results. For a general purpose, throw it in your pocket and go, I would recommend it. Can't beat the price.", "Date": "April 1, 2013"}, {"Title": "Bien...", "Author": "Yolimar Gomez Benitez", "ReviewID": "R12CCWZCTOK5LW", "Overall": "5.0", "Content": "Todo bien hasta el momento. Buen producto posee Buena calidad de imagen y la pantalla es de facil acceso .", "Date": "March 17, 2013"}, {"Title": "very nice camera for the price", "Author": "steve givens", "ReviewID": "R2PK5DJ4MPRE8N", "Overall": "5.0", "Content": "this camera takes great pictures and the battery life is good too. it has some very cool options like editing your pictures. i am very happy with my purchase.", "Date": "March 14, 2013"}, {"Title": "Great product", "Author": "Ivan Becerra", "ReviewID": "R1A3IG6I2SG39B", "Overall": "5.0", "Content": "No defects it was good purchase because was according my expectations and It arrived on time after the order was placed", "Date": "February 13, 2013"}, {"Title": "LOVE MY CAMERA", "Author": "K. Zitterkob \"krazy krafter\"", "ReviewID": "R1BXRDVNFEEBMD", "Overall": "5.0", "Content": "I have had this camera for a few months and I love it.  It is easy to use and understand.  I use the timer alot and it is easy to use. It takes great pictures too.", "Date": "February 11, 2013"}, {"Title": "Kodak Easy Share Touch 16 MP Digital Camera", "Author": "Joan Jones", "ReviewID": "R1ROKUD5JKWURZ", "Overall": "5.0", "Content": "I have an old Kodak digital camera & have always been very happy with it. I thought I would getanother Kodak Easy Share before they were on longer available as I read they were on longerin business. I'm very happy with this one as it has many new features.", "Date": "February 3, 2013"}, {"Title": "simple solid camera", "Author": "Joe B. Davis III", "ReviewID": "R1K8P7BPYQ6OXS", "Overall": "4.0", "Content": "We now have 3 or 4 of these I've bought for work, very simple to set-up and reliable.  We only use the lowest quality settings without flash for quick photos in an industrial setting, but I've been very impressed with it's ability to take good quality photos every time.  Even close-up of the odometer on vehicles with no special settings, just hold it steady about 4\" from the face & it focuses all over the place, then takes a picture and it's sharp.  We keep adding more of these cameras and haven't had one fail yet.  A little slippery to hold, so use the included wrist strap.  Also important to note is it doesn't come with a micro sdhc card so be sure to order one when you order the camera.  The internal memory is miniscule, not adequate for any use really.  Plus the cards cost next to nothing nowadays.  I always oder the class 10 cards because they read and write so quickly, haven't used one of the class 4 cards yet so I don't know how noticably they would slow down the shooting or downloading process.  They're cheaper but not much now.", "Date": "January 24, 2013"}, {"Title": "Great Kodak!", "Author": "Nikki L. Leverton \"college bound\"", "ReviewID": "R3E4A2GC35URTW", "Overall": "5.0", "Content": "It's a camera, I love it.  I have taken it everywhere with me.  Olympia Washington is the last place it went.", "Date": "January 4, 2013"}, {"Title": "Happy Hubby", "Author": "Grum", "ReviewID": "R2QMNQQILWJW95", "Overall": "5.0", "Content": "Super camera and is always in use. Recommended buy for point and shoot enthusiasts and even the more discerning photographer.", "Date": "December 27, 2012"}, {"Title": "Kodak M5370", "Author": "JudyNC \"JudyNC\"", "ReviewID": "R3FO203CJXXIYV", "Overall": "5.0", "Content": "This is the nicest Camera I have ever owned. I am an not an expert, but these pictures have brought me a lot of pleasure! It is fun, saving my memories for the future this way! It is one of the nicest cameras I have seen priced, so everyone can enjoy their pictures! I chose wisely--and I do not regret my purchase--and that is saying a lot!I have enjoyed Emailing these lovely pictures to my family and friends.I have stayed within the Kodak family for my Memory Cards--and I have never been disappointed! Batteries, Chargers, and other acessories I have used other manufacturers. I love this Camera--it is a treasure to me--and yes it does have its quirks--but I have never owned a moving/working product that hasn't had little quirks. The camera I have, is very easy to live with!!", "Date": "December 15, 2012"}, {"Title": "Great size, great pictures", "Author": "jane collins", "ReviewID": "R3RH34XXORDAD1", "Overall": "4.0", "Content": "Bought this camera for convenient size and features.  It has met all my needs.  Only negative is that to transfer pictures you have to connect via USB.  Would have been more handy if it had bluetooth feature.", "Date": "November 30, 2012"}, {"Title": "so easy and fun to use!", "Author": "lydiallc", "ReviewID": "RR85879B4I4UB", "Overall": "5.0", "Content": "I bought 1 of the first easy share cameras with the printer docking station and loved it.  When it finally wore out I searched for a new camera and bought the M5370 after reading the reviews.  I love this camera and was very disappointed when i dropped it in some water after having it for only 1 month!  It wouldn't work right after a week of drying out so I bit the bullet and just had to order another one.  Got the new one but decided to try the first one again before ditching it and it actually was working again!  I returned the 2nd one and have been using the first one ever since with no issues.  It takes awesome pics and the print quality is great.  I love playing with all the different modes and color choices and am having a blast with the videos - sound quality is good on the videos too.  2 of my friends bought this camera after checking out mine.  I would highly recommend it for it's ease of use and quality of pics.  The touch screen is awesome too.  Much better than trying to search for buttons for everything", "Date": "October 10, 2012"}, {"Title": "Bueno", "Author": "Yohanna", "ReviewID": "R3646R9AJ9CPQS", "Overall": "5.0", "Content": "Producto de Calidad, fue muy rápida la entrega aquí en Venezuela, lo recomiendo altamente. Vale la pena comprar nuevamente. muchas gracias.", "Date": "October 8, 2012"}, {"Title": "Kodak Camera", "Author": "Lorily", "ReviewID": "R33M4N2LE8X637", "Overall": "5.0", "Content": "Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD Video Capture and 3.0-Inch Capacitive Touchscreen LCD (Silver)  I had to buy a new camera because someone stole mine while I was at Wild Adventures.  It was a Kodak too but not the same model.  I bought this camera from amazon because they had the lowest price and the best selection.  I love this camera!  It does so much more than my old camera.  It has a touch screen and a whole lot of more storage and features too.  Amazon got it to me so quick I could not believe it.  I am so happy with this camera!  If I need another one I will buy one just like it.  It is so easy I have not even had to use the manual.", "Date": "August 6, 2012"}, {"Title": "great camera", "Author": "Joyce B. Hanshew", "ReviewID": "R3ALKI5CH6PG0", "Overall": "5.0", "Content": "this is a great little camera . it takes excellent pics and videoits very small , easy to take with you any where . it was on sale at walmart for 130 dollars and i paid 75 on amazon . I am thrilled with the saving", "Date": "August 6, 2012"}, {"Title": "Good pictures without complication", "Author": "DT", "ReviewID": "R3DODJHN8IIX86", "Overall": "4.0", "Content": "We took the camera on a recent family vacation and took pictures and videos in all kinds of conditions.  The quality is very good and the functionality of the camera made them easy to take.  We would definitely recommend for anyone wanting good pictures without complication.", "Date": "July 27, 2012"}, {"Title": "Weak", "Author": "KIKS", "ReviewID": "RN7M3KEMCAYHI", "Overall": "2.0", "Content": "I bought this camera for my kids, they learned how to use it in no time, but the problem is that it freezes a lot, I have to take the battery out to make it work, the screen resolution is very poor, and the touch screen doesn't respond as fast as you may expect.I dont recommend this camera for anyone who is interested in photography, this could just be a kid's toy.", "Date": "July 24, 2012"}, {"Title": "Great Camera", "Author": "jrabbitt", "ReviewID": "R2QYJ4K9R21YU7", "Overall": "5.0", "Content": "This is a great camera and is very easy to use. Just charge the battery and it is ready to use.", "Date": "July 7, 2012"}, {"Title": "Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom...", "Author": "BAYA-----VZLA \"yoslenb\"", "ReviewID": "R18T03GHKGVRT", "Overall": "5.0", "Content": "excelente producto lo recomiendo ha funcionado de maravilla lo compre desde venezuela y llego en perfecto estado excelente vendedor toda la compra y el envio fue muy rapido", "Date": "June 28, 2012"}, {"Title": "My new Kodak Easy Share Touch m5370", "Author": "BARBARA-JEAN BLOOD", "ReviewID": "R1RMPEG4P6FBVB", "Overall": "5.0", "Content": "when this camera arrived (early ) I was surprised and please.I am not very good at setting things up I usually have my daughter do these things, but I was to impatient to wait, so I gave it a shot and it was so easy and i was able to figure out the downloading of the share button and it's great. I haven't printed any pictures yet but they look very bright  and clear, I've always owned the easy share and i loved them all, this one i think will be fantastic. I don't get rid of them I do update and give the younger kids the older one's i've had and they are still going strong..i think this one will be good to me too .I Love the camera. I'm sad Kodak is doing so much discontinued items but this camera works great, just waiting on some accessories for it. Good investment , i also have to get use to the share link and not using a dock..little things  it's all in the name of change and something new.I like my new Camera !", "Date": "June 23, 2012"}, {"Title": "GREAT CAMERA", "Author": "Carl Leroy Harrold \"Weird Harold\"", "ReviewID": "R2Z0KWDR5XRL7H", "Overall": "5.0", "Content": "BEST electronic camera I have come up against. Unfortunately this is only the second electronic I have had, but it is by far the easiest to understand and a delight to operate. This camera is so simple to use a YOUNG child would be able to operate it. Never new special effects on a camera would be so easy to do. This is a much better experience for me than the first on I had. It is so simple to get the pictures to my computer by just plugging in the usb cord and it does the rest for you, my first camera was NOT so easy. I think all beginners like me should try this camera out. The pictures are of SUPER quality that I have never seen before. Thanks Kodak for making the M5370 so easy and simple to use.", "Date": "June 15, 2012"}, {"Title": "Bought this for work", "Author": "Myndibear", "ReviewID": "RXWVP3E4KG5LX", "Overall": "5.0", "Content": "Great camera for the price... rechargeable battery, easy to use, etc.  Arrived quickly and as expected.  Brand new.  I really like this camera and have bought several for work.", "Date": "May 29, 2012"}, {"Title": "A great little camera!", "Author": "Chris Swanson \"I'm just this guy, you know?\"", "ReviewID": "RSR99UXP1GRJE", "Overall": "5.0", "Content": "This is a fine little camera! It's thin, it's compact, it's easy to use, and it takes great pictures!I tested this out with a few basic pics around my house and outdoors. Everything turned out looking great! Far better than my previous camera, which is also a Kodak, but a 12 megapixel. I also tested this with video, and it works way better than my previous camera for that. I found the image was much clearer and the microphone is quite a bit better.I have two complaints: First, it doesn't come with a micro SD card. These aren't expensive, but the company should provide you with one, precisely because they aren't expensive.The other problem is the battery situation. You have to use a USB cable to charge the battery. Now it, like most these days, comes with a power adapter so you can plug it into an outlet, but the problem is this: suppose you're on a campout, far away from your tech, and you're going to be out there for a week. With normal cameras, you can just tote a sack of batteries. With this, not so much.Beyond that minor pair of complaints, this is a really good camera, and I really like it!", "Date": "November 4, 2011"}, {"Title": "Kodak EasyShare is fantastic", "Author": "Storm", "ReviewID": "R2WTMB6JKYS330", "Overall": "5.0", "Content": "I bought my first Kodak EasyShare about 5 years ago.  I loved the camera and when it started to go, I decided I wanted another Kodak EasyShare.  The ease of the touch screen, the ease of switching to another form of photography (panoramic or black/white)and not to mention the ease of downloading my pictures on to my computer or sharing with social medias if I desire.  I love the Kodak EasyShare and my daughter is considering one if she can find one.  The only problem is Kodak is not going to be making them any more which saddens me that an icon such as Kodak gave up so easily. With luck, this camera will last me a very very long time.  THANK YOU KODAK FOR A GREAT DIGITAL CAMERA.", "Date": "October 14, 2012"}, {"Title": "Very Satisfied", "Author": "Paula", "ReviewID": "R20MX67J8D0BQ", "Overall": "5.0", "Content": "I had never made any purchase through internet, and the result of these first purchases, of which the camera was one of, was great, I am very pleased with the product and with the service", "Date": "May 3, 2012"}, {"Title": "great for the price", "Author": "dom", "ReviewID": "R117C0OT24E5PG", "Overall": "5.0", "Content": "EXCELLENT PICTURES FOR AN INEXPENSIVE CAMERA. BATTERY LIFE IS ALSO VERY GOOD. TOUCH SCREEN SOMETIMESHAS TO BE TOUCHED MORE THAN ONCE,BUT NOT ALWAYS. PLENTY OF FEATURES FOR POINT AND SHOOT. WOULD HAVELIKED LITTLE STONGER ZOOM, BUT FOR $79 CAN'T BE TOO CRITICAL. OVERALL EASY TO USE AND HAS NICE PICS.THIRD KODACK CAMERA. HAVE ALL MY PICS BACKED UP ON THE KODACK SITE WHERE YOU CAN ALSO ORDER GIFTSUSING YOUR PICS.", "Date": "April 22, 2012"}, {"Title": "like this brand, for memory", "Author": "peece of kloud", "ReviewID": "R2LDLE8YJOZ3IX", "Overall": "5.0", "Content": "this kind of digital camera has almost been kept out in personal life. My friends or people around me are more likely to use mobile phone instead. When I heard the latest news about Kodak, I think that I should own a DC branded Kodak. Hmm, now this DC works well. I rarely use its \"easyshare touch\" function, so I can not give my review on this feature. But as a normal DC, it works well.", "Date": "April 17, 2012"}, {"Title": "DISAPPOINTING OUT OF THE BOX", "Author": "Bob S. \"Classical Music Fanatic\"", "ReviewID": "R24SOHIOIE2KWF", "Overall": "2.0", "Content": "This isn't about photo quality- cameras of this type all take acceptable photos.  However, there's one MAJOR disappointments with this product which I found as soon as I opened the box, and before any photos were taken- This camera uses a MICRO SD card.  Dumb.  Virtually all computers- laptops and desktops- now come with a regular-size SD card reader.  So why would Kodak fool around with a micro-SD card which requires you to keep track of a small adapter to plug the micro-SD card into a regular SD card slot.  Again I say- dumb.On top of that, Kodak's a company that has been having deep financial problems for a long time because they got into digital photography far later than they should have.  Do you really want to buy a camera from a potentially vanishing company?  Why not from somebody like Panasonic, Canon, Nikon and others who appear to be in the game for the long haul.", "Date": "June 21, 2012"}, {"Title": "Easyshare camera", "Author": "Patricia J. Franz", "ReviewID": "RZ9SA9K7N675C", "Overall": "3.0", "Content": "Its not like the first Easyshare I had.  This one is too involved and I am having a hard time  with it, but I will work it outeventually.  Haven't used the USB cable yet to review it.", "Date": "August 12, 2013"}, {"Title": "I feel I was taken advantage of", "Author": "andrew  ford", "ReviewID": "RTMYFJSFRNG2K", "Overall": "2.0", "Content": "I wanted this camera. I purchased it selecting a new camera instead of a used camera which was about 1/2 the price. When I received it the boxes seal had been broken and replaced (it was pretty obvious because the seal wasn't replaced in exactly the same place). When I tried to install software to transfer to the internet it wouldn't work (line 10 error). So far am very dissatisfied with it. Andrew W. Ford Jr.", "Date": "July 15, 2013"}, {"Title": "Always goes off", "Author": "Noble", "ReviewID": "R3ROQE81ZNXSU1", "Overall": "2.0", "Content": "it always hangs up and goes off but its manageable. Picture quality is kind of ok though. i wont purchase again", "Date": "July 7, 2013"}, {"Title": "Great Camera if You will only be taking Close-Ups", "Author": "carly", "ReviewID": "R23QQNGCNYHU38", "Overall": "3.0", "Content": "I have been a long-standing fan of the Kodak Easyshare Cameras.  This is actually the 4th one I've owned & I must say, probably the one I'm least satisfied with.  The camera has many multi-use functions for taking pictures in different environments, but it seems almost each one I've ever tried to utilize in the setting it indicates it's designed for, my pictures are totally cruddy.  I wind up so frustrated because I'm missing half of the show (I'm usually at a concert or something) because I'm messing w/the camera trying to get a clear shot.  It's awesome if you're at a small gathering taking pictures, but anything that's in motion - forget it.  Then sometimes it seems to just have a mind of its own where it will just take a picture w/out even touching the button if you have it on, or just shut off all together.  I have a feeling I'll be in the market for a new camera again soon.", "Date": "June 30, 2013"}, {"Title": "Ceased working with no customer support", "Author": "Alex", "ReviewID": "R276RPXQIZM6DI", "Overall": "1.0", "Content": "I received this as a father's day gift, and we used it to take pictures of our growing child. The camera's life did not even make it to the next fathers day. It stopped working completely about 6 1/2 months after initial use. I have tried multiple times to get a hold of Kodak support via email, phone, and chat. They are providing zero communication on the matter. Pretty disappointing.", "Date": "June 17, 2013"}, {"Title": "Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD...", "Author": "Cozette Evans", "ReviewID": "R2CRPJDWJKG53U", "Overall": "3.0", "Content": "It was a little more beaten up to my liken. But overall it is ok. Would like to seen the actual picture of the camera, so I would have a better idea on if I would have brought it or not.", "Date": "June 1, 2013"}, {"Title": "Least favorite Kodak", "Author": "Z. Oliver", "ReviewID": "RAUXHH2NKKXB6", "Overall": "1.0", "Content": "I have several Kodaks and this is my least favorite. I sent the camera back because it was so disappointing. It also appeared used previously and sent out as new. I would recommend a different Kodak model from a different seller.  Quality was not up to Kodak's standards.", "Date": "May 22, 2013"}, {"Title": "works good, not intuitive -bad owners manual", "Author": "Karyl Parks", "ReviewID": "R2O714WF9T2VCY", "Overall": "3.0", "Content": "We wanted something small, easy, intiutive.  It's small, does digital photos and movies. Good value for what it is. Does not come with  good instructions, Had to look up several youtube videos on other models to figure out how  to work it.  I would have been a lot happier with the camera if I didn't have to work so hard to learn to use it.", "Date": "May 14, 2013"}, {"Title": "i received wrong camera", "Author": "Nicole Gregory", "ReviewID": "RZ18ZB3NU483M", "Overall": "1.0", "Content": "i got the right box but wrong camera i need a return slip the camera i received is a M5323 14mp 4 x optical", "Date": "May 13, 2013"}, {"Title": "Slippery Camera", "Author": "NarrowValley", "ReviewID": "R1A9DMOOEOCRJI", "Overall": "3.0", "Content": "The daytime pictures are ok, evening pics are horrible.  The camera is so slippery in your hands I placed velcro around the camera to have a grasp on it.", "Date": "March 31, 2013"}, {"Title": "Camera Had Problems Within Weeks", "Author": "Wa Mom", "ReviewID": "R1QJWI2C5WZ0CO", "Overall": "1.0", "Content": "I recognize I was purchasing a rebuilt camera, but I expected it to last longer than a few weeks.  The camera will work good about 5% of the time.  The other 95% of the time, it has one issue or another.  I have never dropped this camera and typically use it on default settings, so it has not seen any misuse on my part.This camera will frequently take pictures that were tinted orange and have verticle or horizontal stripes through them.  There are times when these are the only pictures it will take.It also suffers from lag and frequent freezing.  When I press the power button, it takes significantly longer to start up than it used to.  Then it prompts me to set the date and time, but if I do it, it will simply prompt me again next time, so I no longer bother with this step.The most frustrating lag is the lag time while taking a photo. I can push the button to take a picture and my daughter can run laps around the living room before it will finally take the shot.  This is in the \"smart capture\" mode, the exposure has not been altered.  It's hard to capture a moving toddler as it is and is darn near impossible to do this when you never know how long the lag is going to be or when the picture will finally be taken.  It's even difficult to capture her when she is sleeping because if my hands move even the slightest when it is lagging, it makes the picture blurry. Sometimes this lag turns into it freezing completely and I have to remove the battery to reset it.  It also lags when viewing photos and freezes frequently.This camera became practically useless in just a short period of time.  If I want to get a good picture, I literally have to take 70 shots before I get one that has my intended target in the shot and isn't orange and striped or blurry.  I bought a refurbished camera because I couldn't afford a new one and feel I pretty much wasted my money.", "Date": "February 13, 2013"}, {"Title": "Great for the first couple of months.", "Author": "Heidi-Alise", "ReviewID": "R2LKJ4VGBBP4YO", "Overall": "2.0", "Content": "This camera is very easy to use, but after a couple months of use when you click the review button to look at recent pictures, you get a blue screen that says, \"Processing\" and it takes so long that sometimes the camera will freeze and you have to remove the battery and put it back in. Sometimes you have to do this a few times before you can access your pictures. My last Kodak Easyshare camera was a lot more reliable.", "Date": "January 8, 2013"}, {"Title": "Bad picture quality", "Author": "Colin", "ReviewID": "R366CI5P5CS007", "Overall": "2.0", "Content": "I needed a cheap point and shoot camera, so I bought this one when it was on sale.  I have had Canons in the past, so this was my first Kodak.Pros:Good sizeLooks niceTouchscreen is easy to useCons:Takes terrible, blurry photosSince the photos are worse than pictures taken with my phone, this camera is useless to me.  Will stick to Canon from now on.", "Date": "December 6, 2012"}, {"Title": "Doesn't focus, Slow to respond", "Author": "sara webb", "ReviewID": "R2EKKFQKXQDK0D", "Overall": "2.0", "Content": "I was really excited to ge this camera, it looks it and it' s lightweight, but when I turn the camera on it is slow to initialize causing me to miss shots, the camera freezes and I have to take the battery out to reset it.  The flash is terrible and makes pictures darker, if I turn the flash off it makes the picture blurry. I've been really disappointed in this camera.", "Date": "December 4, 2012"}, {"Title": "Don't care for it", "Author": "topche", "ReviewID": "R127TO9JGMJ56C", "Overall": "2.0", "Content": "Bought this as a replacement for my old kodak easyshare 513 which unfortunately quit after becoming soaked in olive oil.The 513 was a great inexpensive camera,straightforward,easy to set and operate and took sharp pictures.By contrast the easyshare touch seems to have a mind of it's own,changing settings and taking pictures if you breath on it.Seems it takes 4 accidental pictures for every 1 that I take on purpose.Yes I know there's a setting to avoid doing this,but it somehow switched itself back,probably because a hair brushed it.Too many features,too difficult to access.Simplicity is best.", "Date": "November 22, 2012"}, {"Title": "Camera", "Author": "George Whitesell", "ReviewID": "R32CY6ML70PDTL", "Overall": "3.0", "Content": "Although this is a refurbished camera, not all the settings work. I am deciding if I should return it or if it meets all my needs.", "Date": "November 20, 2012"}, {"Title": "Camera", "Author": "mnance", "ReviewID": "R3OWMBYTSXE4SK", "Overall": "4.0", "Content": "I did not realize that this camera uses a different type of memory card. I would not have chosen this model if I had realized it.", "Date": "January 9, 2012"}, {"Title": "Digital For Dummies", "Author": "Daniel V. Reilly", "ReviewID": "R212LAFSXURRTQ", "Overall": "5.0", "Content": "I have to say, as someone who dreads getting new tech because of the usually horrific set-up processes, this camera has been a Godsend. You literally take it out of the package, install the battery, and you're good to go. The instructions are kind of sparse, but basically it's all spelled out once you link up to your computer via the USB for the first time. follow the onscreen prompts, and you'll be golden. You'll need to buy a Memory Card, which is not included, because otherwise you can only take between 6-8 pictures, or about two seconds of video. Otherwise, it really is a snap to take great pictures and upload and share them almost instantly. I'm a happy camper.", "Date": "November 13, 2011"}, {"Title": "Terrible pictures without flash, even in bright daylight", "Author": "enginxxxx", "ReviewID": "RYUQ5OWHB4S7H", "Overall": "2.0", "Content": "When you buy a camera you expect it to be better than your phone camera. You expect it to have better sensors, better face recognition and focusing, better light adjustments... But except the focusing this camera is terrible. Even in bright daylight I cannot take clear pictures without using flash. I suggest you to buy a camera with ISO adjustments instead of this one.", "Date": "May 10, 2012"}, {"Title": "Kodak easyshare", "Author": "Vee", "ReviewID": "R9125SJPELS00", "Overall": "5.0", "Content": "I love small,easy to us takes a great pictures what can i say # 1 get it you well love it", "Date": "April 17, 2012"}, {"Title": "A bit difficult but picture quality is good", "Author": "Ward J. Lamb", "ReviewID": "R3IE0H801PLXAE", "Overall": "3.0", "Content": "I'm not sure what rating to give this camera, because it seems like it really has potential to be an ideal camera  from other ratings but it's just hard for me to work right now. This camera has a very nice sleek light look. Although I haven't used it much the manual isn't very helpful and I'm experiencing some feelings of confusion. A light touch of the screen takes a picture and delays the time I have to retake the picture after a mistake picture has been taking, which is really annoying! I don't like pictures of the floor on my memory card! Also it is quite strange the green orb that the camera shows before the flash (not a big deal though). I don't think the pictures with flash in dark lighting are very flattering of people and I don't think that the non flash in dim lighting is the best either. I'm hoping to get the hang of this camera better but right now I am not totally satisfied, the fact that other reviews seem really happy with the camera makes me think there is something I don't understand how to work on this. I'm going to look further into it and try some more things, maybe look up a better manual.On the bright side I note that the picturw quality is superior,and the touch screen is sensitive,and responsive.", "Date": "November 16, 2011"}, {"Title": "broke after dropped", "Author": "J. Moore", "ReviewID": "R3VTIZ0I0A4BEO", "Overall": "2.0", "Content": "I know I dropped this but come on I dropped other cameras and never had them break so easily. These guys stopped making cameras so what little good this review will do, I'll post anyway.", "Date": "December 22, 2012"}, {"Title": "Good little camera", "Author": "Kevin M. Jackson \"kmjackson\"", "ReviewID": "R2FG8H5VETV4G5", "Overall": "4.0", "Content": "Unfortunately we left this camera in Europe with all our photos on its maiden voyage.  On the other hand it was a nice form factor, easy to use and the latency of taking photos that has irritated me with previous digital cameras was less of a factor with this camera.", "Date": "November 20, 2012"}, {"Title": "Got defective Unit", "Author": "donny \"don130\"", "ReviewID": "R1C35GL97LAKRX", "Overall": "2.0", "Content": "I received a defective unit. The display had vertical lines on it and it would power on while charging. I contacted Kodak support and they were very helpful and the camera has to be sent in for repair they do not send out replacement units.On another note, this camera uses a micro-sd card- so be warned you will need an adapter or proper card reader if you don't connect the camera to a computer to download photos. I would prefer an SD card.", "Date": "October 27, 2011"}, {"Title": "facebook", "Author": "kathleen schirman", "ReviewID": "R1JPVIENZSPTCQ", "Overall": "1.0", "Content": "did not down;oad into facebook which is why I needed a camera. I want to be able to download pics so my family can see them.", "Date": "March 15, 2013"}, {"Title": "Shame on you!", "Author": "Letting down my grandson", "ReviewID": "R265H3SAMPQHBF", "Overall": "1.0", "Content": "Was a great càmera except that it simply gave up its ghost much too early, particularly annoying as i had made a gift of it to my grandson.", "Date": "March 6, 2013"}, {"Title": "Worst Camera I have ever had", "Author": "Sundays Rule \"SundaysBest123\"", "ReviewID": "R2VFPD4BZH4H0A", "Overall": "1.0", "Content": "I have had Kodak cameras in the past and loved the quality. This camera has been a big disappointment. I find it very user unfriendly!!! Can't get the pics download???!!!", "Date": "December 29, 2012"}, {"Title": "too confusing", "Author": "Ms Kay", "ReviewID": "R321N8DM6QA3NO", "Overall": "1.0", "Content": "It was not only confusing to me I didn't like the idea of it not using regular batteries and I had to use a different card than my other easy share.. I thought since they were the same name easy share it would have at least used the same card. I gave it away..", "Date": "June 9, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "16 megapixels; SCHNEIDER-KREUZNACH, 5X Wide Optical Zoom\n3\" Capacitive Touch Screen\nKodak's Smart Capture Technology\nRecord videos in HD\nLi-Ion rechargeable battery and MICROSD/MICROSDHC card slot", "Name": "Kodak Easyshare Touch M5370 16 MP Digital Camera with 5x Optical Zoom, HD Video Capture and 3.0-Inch Capacitive Touchscreen LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/511yLiz2BWL._SX300_.jpg", "ProductID": "B0056Z0SJM"}}