{"Reviews": [{"Title": "Simple, quick, effective", "Author": "Candace L Kludt", "ReviewID": "R270C43C5RQEW8", "Overall": "5.0", "Content": "Got this for my mom for Christmas. She has a nasty habit of breaking cameras, so I didn't want to spend a ton of money on something she wouldn't have very long.It's held up great! It's simple and easy to use, so even my technologically challenged mom has been able to get a lot of use out of it.  Defeinitly recommend it for the money.", "Date": "August 9, 2012"}, {"Title": "Very pleased...", "Author": "Amazon Customer", "ReviewID": "R1EM89TYXYZOCN", "Overall": "5.0", "Content": "I bought this camera for my Mom, who is very technically challenged.  I took it out of the box and the first thing I noticed was the compact size!  I put the batteries in and set the time and date, which was really easy.  Took a couple of test shots, and they looked great.  I think this is a great point and shoot for people who don't have a whole lot of technical know-how or photography skills.", "Date": "December 5, 2012"}, {"Title": "NO optical zoom", "Author": "Hunter mears", "ReviewID": "R2Q5FUE0EIRRJR", "Overall": "2.0", "Content": "The camera is listed as having 5x optical zoom, but it only has digital zoom.  I would not have purchased this item had I known it was only digital zoom.", "Date": "December 12, 2011"}, {"Title": "Kodak is always easy to use", "Author": "Jerry O Neil", "ReviewID": "R1L5DROKAZHVFJ", "Overall": "5.0", "Content": "on my 3rd camera, use them all the time, just keep upgrading to higher mp still have the others they just went to the kids, these are easy to use take great pictures software that comes with them are easy to use as well for a point and shoot its worth every penny", "Date": "December 29, 2012"}, {"Title": "Good Little Cameras", "Author": "Mr.Frost", "ReviewID": "R17DT8H1T758QY", "Overall": "5.0", "Content": "Good quality and they take a beating .....  We take a lot of pics and these hold up well in the field!", "Date": "November 18, 2012"}, {"Title": "Good so far!", "Author": "Cristina", "ReviewID": "RPUZN6D6Q245D", "Overall": "4.0", "Content": "It arrived on time and it has worked fine so far, the price was really good and the image quality is pretty good, simple and easy to use. I would recommend this product.", "Date": "December 19, 2011"}, {"Title": "Does the job", "Author": "Scott Bae", "ReviewID": "R2SXJ8LDNJH4PA", "Overall": "4.0", "Content": "Tough camera, just bought the cheapest one I could find so I could take it to Afghanistan on my deployment. I figured it wouldn't come back in working order, but it survived a 7 month deployment. Picture quality not bad.", "Date": "February 18, 2013"}, {"Title": "GREAT beginner cameras!!", "Author": "Melissa Brown", "ReviewID": "R2U7UQL3I58QZ", "Overall": "5.0", "Content": "I bought them for my three boys (7,9 and 11) who have been wanting their own cameras for a while. They are easy for them to operate, understand and learn on. The boys can get enough good pictures to not get discouraged about the bad ones. This has been a great family experience!!", "Date": "May 13, 2013"}, {"Title": "great camera", "Author": "Jennifer L Shaw", "ReviewID": "R2YAH6Z5AK71S5", "Overall": "5.0", "Content": "I love kodak easy share the name says it all I just cant believe their not making this 1 no more", "Date": "April 18, 2013"}, {"Title": "Say Cheese", "Author": "Cosmic Jester", "ReviewID": "R1G2OOVILTHYL", "Overall": "4.0", "Content": "excellent picture quality.  could have a brighter LED screen though.  Be that as it may this camera is excellent for the beginner to intermediate photographer.", "Date": "April 17, 2013"}, {"Title": "Nice inexpensive camera", "Author": "Nichole Colpetzer", "ReviewID": "R28W71RWBN3CKW", "Overall": "5.0", "Content": "We are using the Kodiak Easyshare Digital Camera for our delivery drivers.  It works very well.  The best part is the ease of the uploading.", "Date": "April 17, 2013"}, {"Title": "great product easy to use", "Author": "jpittore", "ReviewID": "R3AUT9PFL19B67", "Overall": "5.0", "Content": "The point and shoot aspect was very easy for our niece to quickly start taking very nice photos.  make sure you buy a storage card.", "Date": "March 22, 2013"}, {"Title": "Cool little Camera.", "Author": "G. T. C.", "ReviewID": "R37WQBSY52NS8Y", "Overall": "5.0", "Content": "No optical zoom, but with less tiny mechanical things to show wear n tear, I think it will be around for a long while.Gives great outdoor pics and the bright flash is perfect for close indoor shots.", "Date": "March 14, 2013"}, {"Title": "Easy camera", "Author": "DO", "ReviewID": "R312Z2X89MABOS", "Overall": "4.0", "Content": "I bought this camera for my technologically-challenged mother and she loves it! This camera takes great pictures and is very easy to use and is extremely user intuitive! I would suggest it to anyone looking for a great, easy camera!", "Date": "January 18, 2013"}, {"Title": "No Issue with Sand Getting In This Camera", "Author": "John '88", "ReviewID": "R1C60ZMIQHKCWH", "Overall": "4.0", "Content": "I'm overseas and have gone through three (3) cameras that were destroyed by dust and sand getting into the zooming lense/shutter.  I picked this camera for its low cost and the fact that is only has digital zoom.  The action can be a little slow and the photos can be a bit grainy but it has held up to the test of time and recording things like helicopters landing close by that destroyed the previous cameras.", "Date": "September 18, 2012"}, {"Title": "No optical zoom", "Author": "T. Lewis", "ReviewID": "R2KQ3SNFETHSIQ", "Overall": "2.0", "Content": "I ordered as a gift for a friend that needs a basic camera. The camera is easy to use and takes decent shots but is wrongly advertised. It does not have an optical zoom lens.", "Date": "January 14, 2012"}, {"Title": "Kodak Camera gets the job done!", "Author": "Evelyn Dew", "ReviewID": "R2PN6UYEIP841", "Overall": "5.0", "Content": "It is a good camera for what I need to do.  I have taken pictures already with it and I am very pleased.I do have 1 question tho.  How do you turn the flash off. I need to take some pictures without the flash.", "Date": "July 12, 2013"}, {"Title": "Love it!", "Author": "Mala Bissookram", "ReviewID": "RR1ZQ6QDIYQPP", "Overall": "5.0", "Content": "I think it is just right, light weight, small just what I was looking for. Shipping was on time and I am 100% satisfied!", "Date": "July 10, 2013"}, {"Title": "Great little camera for a small price.", "Author": "Anonymous", "ReviewID": "ROXM5ULZEWC4Z", "Overall": "5.0", "Content": "Camera arrived in good condition and was as described.  Takes beautiful photos and video and very easy to use.  This is a good value.", "Date": "July 10, 2013"}, {"Title": "Excellent", "Author": "Ruth E. Becker", "ReviewID": "R3RCEYSLLQ7I92", "Overall": "5.0", "Content": "Arrived on time and in excellent condition - all positive!This camera is simple to use and easy to carry in one's purse.", "Date": "June 29, 2013"}, {"Title": "Black camera", "Author": "Amelia johnson", "ReviewID": "R14EHDQVH86DWA", "Overall": "4.0", "Content": "I really like this camera, it was bought as a gift. I really appreciate that the fact that it was delivered on time to be taken to my cousin in Haiti.", "Date": "June 23, 2013"}, {"Title": "Great camera from Kodak", "Author": "Someone54", "ReviewID": "R1E5P2HZMOB80U", "Overall": "5.0", "Content": "This camera is easy to use and with a memory card like New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa!, it gives huge amount of space for pics. I can't think of any other reason why not to get this camera. It is a good one to have around.", "Date": "June 18, 2013"}, {"Title": "New Grandma", "Author": "Jo Jo", "ReviewID": "R2YKGG9EM8O5VN", "Overall": "4.0", "Content": "When my camera arrived I was shocked at how small it was compared to my previous cameras.  I bought it because my first grandchild was due and I knew I would want plenty of pictures.  It is easy to use and only time will tell if it is good quality.", "Date": "March 18, 2013"}, {"Title": "If you like blurry pictures this camera is for you", "Author": "Joe", "ReviewID": "R1N5OROZJ9WWLL", "Overall": "1.0", "Content": "I had the previous model of this camera and it was pretty good for a low price camera.  Upon needing a replacement I figured I couldn't go wrong with the same camera.  A minor issue is that the newer model no longer has optical zoom.  That's a minor issue that I knew before purchasing.  The major problem is that the pictures this camera takes are horrible blurry messes.  I need the camera to take pictures of equipment nameplates, which the previous model was great with.  This picture rendered the text as an amorphous blob no matter which setting it was set on.  Nearly every picture was terribly blurry or poor resolution.", "Date": "February 28, 2013"}, {"Title": "Great camera", "Author": "Charles Wegner", "ReviewID": "RUXEZVW0IIEKP", "Overall": "5.0", "Content": "Love the camera takes great photos...use it every day in my buisness easy to up load to computer  great great", "Date": "February 19, 2013"}, {"Title": "Defective", "Author": "LP", "ReviewID": "R3AB0HRA6M6E4U", "Overall": "2.0", "Content": "This item must be defective.  It came with batteries but when I put them in the camera, it was showing a low battery icon.  I went and purchased new batteries and it showed the low battery icon again.  It does NOT come with an SD card so you have to purchase that seperately.  It's not worth the trouble.", "Date": "January 12, 2013"}, {"Title": "Not so great in dark scenarios!!!! but a ok camera for evrething else", "Author": "Ramon Emilio TIo", "ReviewID": "R3SK5ZB851I2FG", "Overall": "3.0", "Content": "I take this camera to a birthday party held at night indoors and where there where no proper light (considered it was a disco), and i wasnt able to take more than 3 or 4 and a bunch of dark picture that i have to erased, this was and embarresment comparing to other picture taked by other camera  with less pixel that delivered good quality picture of the birthday. Overall, at daylight and indoors with good ilumination, this camera do a decent jobs to capture those precious moment. if you have money for other camera, you may want to pass this one, but if you want a decent camera that in good conditions do the job and if you loss it or break it  you dont going to fell  sorry, go ahead and buy it.", "Date": "September 13, 2012"}, {"Title": "BUY SD CARD FIRST", "Author": "Southernboy", "ReviewID": "R30LVOYOMG4RHT", "Overall": "5.0", "Content": "AFTER RECIEVING THIS CAMERA I TRIED THE INTERNAL MEMORY FOR VIDEO AND IT READ FULL.IMMEDIATELY I PUT A 4 GIG SD CARD IN THE CAMERA THEN EVERYTHING WAS FINE.PICTURES COME OUT AS WELL AS EXPECTED.SETUP WAS VERY EASY.VIDEO SOMETIMES HAS INTERRUPTIONS BUT STILL GOOD.THIS CAMERA IS MUCH SMALLER THAN MY OTHER 2 KODAKS.ALL IN ALL I AM SATISFIED WITH IT.", "Date": "February 23, 2013"}, {"Title": "Great little camera for the price.", "Author": "cynthia murphy", "ReviewID": "R5ATKPH7JCA3T", "Overall": "5.0", "Content": "I was glad to find this Kodak Easy Share on Amazon.  It is very easy to use.  No charger necessary since it uses AA batteries.  The picks are very clear with the 12 MP and the 5X Zoom.  Kodak is now not making cameras anymore, but I just love this camera for its size.", "Date": "May 19, 2014"}, {"Title": "love the camera", "Author": "Melinda", "ReviewID": "R2Q1JWXUNEQRQB", "Overall": "5.0", "Content": "We bought this for my son for Christmas and he has really enjoyed it. It is really easy for him to use. The only thing we don't like is that it takes video, but no sound to the video.", "Date": "May 5, 2014"}, {"Title": "Piece of junnk", "Author": "On the move momma", "ReviewID": "R72XBYRM5D6TA", "Overall": "1.0", "Content": "Horrible pictures, does not focus, flash does not help in a dim room, I wasted money on this one! We bought another camera at the same time and it was the same price and much better pictures.", "Date": "March 20, 2014"}, {"Title": "Camera", "Author": "Leslie Dickey", "ReviewID": "R13FWTWK4JSX3O", "Overall": "3.0", "Content": "I bought this camera for my son and it is easy to use but the image quality is only okay.", "Date": "March 17, 2014"}, {"Title": "good deal", "Author": "Y. Hathaway \"YvoHath\"", "ReviewID": "R3DDDM3YPM51BW", "Overall": "5.0", "Content": "bought for my mom who is tech challenged decent pictures very easy to use a good deal all around thanks", "Date": "March 4, 2014"}, {"Title": "Easy Camera to Use", "Author": "erie61", "ReviewID": "R286V3O0QSAJOV", "Overall": "4.0", "Content": "This was purchased to take pictures of items I am selling.  It is very easy to use, and the pictures are good.  Easy to load to computer.  Received in excellent condition, quickly.", "Date": "February 4, 2014"}, {"Title": "ok for preteen kids", "Author": "Leisa D. McKinley", "ReviewID": "R937GXAGGQ8N7", "Overall": "3.0", "Content": "I ordered this because i wanted Kodak and and it was the best price anywhere. Unfortunately it was a present for grandchild in another state. When he went to use it said only one picture available. He hadn't taken any yet. He wasnt' thrilled and i didn't think i'd need to buy a memory card. I've used other camera's without need memory chip right away. I would have given 5 stars if it would have allowed more than one pick to be taken without memory card.", "Date": "December 26, 2013"}, {"Title": "Bad experience!", "Author": "Orpheil D.", "ReviewID": "R32WGOW8534KHF", "Overall": "2.0", "Content": "Camera is small and neat however flash didnt work upon arrival. For a 12MP camera the price is good and Kodak is generally a good brand. I guess I'm the one with the bad luck.", "Date": "December 9, 2013"}, {"Title": "not too clear", "Author": "beatrice sanchez", "ReviewID": "RK4ST36LT5ZL6", "Overall": "1.0", "Content": "you cannot view the images clearly. it is very hard to see the images while you are trying to take a picture.", "Date": "December 8, 2013"}, {"Title": "Good camera", "Author": "Hortensia \"Sunshine\"", "ReviewID": "RMAG2QBU8JGZO", "Overall": "5.0", "Content": "I tried a couple of different cameras, after my old camera died. I like this best. It's easy to use, fits my fingers, takes good pictures and comes with a cord to attach to the computer for downloading pictures. It needs a little memory card, which also inserts into my laptop for downloading pictures. Convenient size, batteries seem to last for quite a while. What else can I say, it's a pretty good camera.", "Date": "December 7, 2013"}, {"Title": "Perfect Size", "Author": "Cindy", "ReviewID": "R1ZBGHGTZWUNMD", "Overall": "4.0", "Content": "I like this camera, works great, pictures download to my computer easily. Only thing that I didn't know is that regular batteries do not last long in this type of camera, you need rechargeable batteries. This needs to be included in the description, because its an added cost and might cause someone to purchase a rechargeable camera instead.", "Date": "December 7, 2013"}, {"Title": "camera wont down load", "Author": "dorothy feltner", "ReviewID": "R2GEF9GK98K5CF", "Overall": "5.0", "Content": "I love this camera but you cant  down load the pictures from the camera to your computer.ive tried every thng to get my pictures downloaded . but nothing works. sincereel;y ms dorthy", "Date": "November 8, 2013"}, {"Title": "Good purchase", "Author": "gary l moad", "ReviewID": "R10QVQQ5R1HRUF", "Overall": "5.0", "Content": "Great camera for the $.  This is my first digital. I am electronically challenged.  Easy to use for people like me.", "Date": "October 31, 2013"}, {"Title": "Handy Camera for Backpacking", "Author": "JimBoy", "ReviewID": "R15Q4LZQ87Z3D3", "Overall": "5.0", "Content": "This gets 5 stars because I wanted a small camera with a standard SD card that I could throw in my backpack when fishing of hunting.  This meets all my needs.  It is very easy to use and takes good pictures.  I also use it to read the SD cards from my \"Trail/Game Cameras\".  It saves me from dragging SD cards to my home computer.  I also like that I can then delete all pictures from the SD card and just put it back in my trail camera.  It does everthing that I wanted.", "Date": "October 6, 2013"}, {"Title": "Plastic Looking", "Author": "Tamara", "ReviewID": "R1STR6JCXNNLVZ", "Overall": "3.0", "Content": "It feels cheap to me but works like a charm if you are not looking for anything fancy.  Great starter camera.", "Date": "October 6, 2013"}, {"Title": "Good little camera", "Author": "Lakelady \"Lake Lady\"", "ReviewID": "R3FTOYAWZSJF5U", "Overall": "5.0", "Content": "So far I am happy with it.  I haven't tried to download and share yet.  The small compact size is convenient.", "Date": "October 2, 2013"}, {"Title": "Great camera for the technically challenged.", "Author": "Marsha W.", "ReviewID": "R3ES2FEUO6ZU01", "Overall": "4.0", "Content": "We bought this camera for my dad. He is new to computers and to digital cameras. He has been using it with much success. I just bought another one for my fiance and I know he will like it too.", "Date": "September 17, 2013"}, {"Title": "Camera is great!", "Author": "Bobbie Smith", "ReviewID": "R36RJGA13G57XR", "Overall": "5.0", "Content": "I am very happy with this camera.  It is easy to use, pictures are perfect.  Zoom and other special features are excellent.  I am a amateur camera user, cannot even call myself a photographer, and this camera makes capturing special moments easy to use and the end picture looks great.", "Date": "September 13, 2013"}, {"Title": "Very very poor quality. Not even 1- star if I could", "Author": "Crystal", "ReviewID": "R33O9OC3OVNTIL", "Overall": "1.0", "Content": "I had a 12 MP Kodak. AF 3x OAl. 32-96mm (Equivalent) before it started to have some issues when keeping the batteries inside due to age. So I went on the search for something just like it to save on costs of new memory cards and cords. Big mistake on this camera folks! It has very very poor quality almost as much as buying a disposable $2.00 camera. Its blurry and so not worth the $50.00, So if you want good close-up / clear details in your images like I do. I do NOT recommend this camera.", "Date": "August 28, 2013"}, {"Title": "very nice camera", "Author": "Jessica Strevy", "ReviewID": "R2XQHS0ATQMKSG", "Overall": "5.0", "Content": "thank you for the very nice camera and its arrival time was very fast also.my son will enjoy it for some time im sure", "Date": "August 21, 2013"}, {"Title": "Blurry pictures", "Author": "Gesualdo", "ReviewID": "RMVEH2L4Y0T47", "Overall": "2.0", "Content": "I'm disappointed in this camera. I can see the potential it has to take some nice shots, but more often, the pictures I get come out blurry. I've cleaned the lens several times and fiddled with the various settings, but I didn't see much of an improvement. Luckily, it was a cheap camera, so maybe I'll just get rid of it and find something better.", "Date": "July 8, 2013"}, {"Title": "Graduation and everything else", "Author": "lily", "ReviewID": "R2UR008Y9F9Z1O", "Overall": "5.0", "Content": "My boyfriend was going on a trip and needed a camera, so I got him these one. He was very happy n took great pics!", "Date": "June 27, 2013"}, {"Title": "Kodak Easyshare C1505 12 MP Digital Camera with 5x Digital Zoom - Black", "Author": "Betty Bayless", "ReviewID": "R38NL0KHCVJGLL", "Overall": "3.0", "Content": "I thought I was ordering Easy share CD153, which I all ready have 1 of.but it's OK I can live with this model", "Date": "June 24, 2013"}, {"Title": "For the price OK", "Author": "William A. Szabo", "ReviewID": "R4DGZGADHY3Q3", "Overall": "3.0", "Content": "Hello,For the price, this camera is OK.  But it takes marginal pictures.  I also have a DSLR and the pictures do not even come close to comparing in quality.  Also there is no flap built into the camera to protect the lens.  I had trouble loading the camera software and had to go to the Kodak site (which is explained in the instructions) to get the camera software loaded.  This camera was on sale for $39.00 dollars and for the price it is 5 stars.  I hope you get the same deal.Take care,Bill", "Date": "June 14, 2013"}, {"Title": "good camara", "Author": "VE59296jose nuñez", "ReviewID": "R39OVO2QKK3FRP", "Overall": "4.0", "Content": "good camara and easy the only problem is the battery but I buy a rechargeable baterrias and work it good", "Date": "June 9, 2013"}, {"Title": "Disappointed", "Author": "ediem", "ReviewID": "R38OBGXXIJ9R7Z", "Overall": "1.0", "Content": "Camera does not work right for me.  Says memory bank is full but it can't be.  Have trouble transferring photos onto the computer.  Don't like the way it takes photos.  Too complicated for me.  Thought I was getting a camera that was almost point and shoot.  I will admit that I am quite illiterate when it comes to electronics.", "Date": "June 5, 2013"}, {"Title": "Good first camera for a kid", "Author": "Sean U", "ReviewID": "R1L9PCJH5HS62U", "Overall": "3.0", "Content": "Takes decent pictures... but can eat through batteries. You should get some NiMh AA rechargeable batteries if you don't have any laying around. It's much better than the similarly priced children themed cameras, and takes real photos, and low-res videos.", "Date": "February 28, 2013"}, {"Title": "No sound on video", "Author": "greenacres", "ReviewID": "R2SWD67MVB1ZF4", "Overall": "2.0", "Content": "Sound doesn't work when recording videos.  Lens doesn't zoom in and out as it should.  Could just be this one but I don't know.  Didn't try to return since it was a Christmas gift and I didn't find out about it until several weeks after Christmas and the boxes were gone.  If I can exchange it, I might find that it's great and change the review.", "Date": "January 26, 2013"}, {"Title": "Returned", "Author": "Cherie", "ReviewID": "R3HE8X3PWNMIBP", "Overall": "2.0", "Content": "I ordered this camera for as a Christmas gift for a family member. When it came out the boxes it was clear that the camera had some issues. At first it wouldnt take pictures at all and then after the flash came on the camera just shut off all of a sudden. The good thing is the few pics it took were crystal clear. Im going to send it back and order the same one. Hopefully it was just a problem with that one", "Date": "January 18, 2013"}, {"Title": "NO memory included", "Author": "SRQ_Taz", "ReviewID": "R2KW0RCQYJ8DIV", "Overall": "3.0", "Content": "Camera already given as gift, so I cannot test -- but will be extremely disappointed if 5x Optical Zoom turns out to be digital zoom.  I too bought this based on the Optical zoom, because digital zoom means nothing.  Now, my issue is that NO memory is included.  Amazon's \"Technical Description\" is incredibly weak.  Buy more SD or SDHC memory with this, or camera can only take and hold ONE picture", "Date": "January 14, 2012"}, {"Title": "Don't Buy", "Author": "Beck", "ReviewID": "R2Y01UDS6XY0TE", "Overall": "1.0", "Content": "There were parts missing when I received this camera.  No wrist strap and the camera was defective.  Kept saying memory full when I had just received this!  Couldn't download to computer.  Returned it the next day.", "Date": "August 17, 2013"}, {"Title": "Junky camera!", "Author": "George Avrov", "ReviewID": "R29IAAKDYFJABN", "Overall": "1.0", "Content": "My brand new batteries last for only about 3 photos in this camera before they need to be replaced.  I'm  going to call Kodak ASAP!  This can't be right!", "Date": "July 6, 2013"}, {"Title": "Camera Did not include memory Card", "Author": "Kathy E Huntley", "ReviewID": "R3DXHR7S68JILR", "Overall": "2.0", "Content": "I guess I didn't read the fine print, the camera did not include a memory card.  I still have yet to use this camera as I need to find the correct card.  I did notice the screen resolution was pixelly and not as good as I had hoped.", "Date": "May 31, 2013"}, {"Title": "Nice Price", "Author": "Jamie", "ReviewID": "R35IQAX711WM8R", "Overall": "3.0", "Content": "Good product for the price. Would love another Kodak - they are always the best choice. My daughter is 11 and loves hers.", "Date": "February 28, 2013"}, {"Title": "nice litle camera", "Author": "Cody J. Engstrom", "ReviewID": "R2F2JLIYB5JGW8", "Overall": "4.0", "Content": "pirfect litle camer for simple fun pictures and easy to share on my pc. That being said if you want a realy fancy camer with lots of zoom this isent the camera for you.", "Date": "February 9, 2013"}, {"Title": "Don't even go there.....", "Author": "S. kersch", "ReviewID": "R6O0TPHYGOCHG", "Overall": "1.0", "Content": "If Kodak doesn't acknowledge this product, DON'T BUY IT!!!The 2 double AA Kodak batteries it came with were already dead...", "Date": "November 29, 2013"}, {"Title": "Should have believed negative reviews", "Author": "Elizabeth Baldridge", "ReviewID": "R3FR18GDJCGGJP", "Overall": "1.0", "Content": "I received this camera today.  It does not have a 5x digital zoom.  Also, I could not download the share app though I followed the directions.  I got a message on the camera screen saying it was connected, and indeed something appeared on my computer screen--a black square with KODAK in the center.  At the top it said it was the Kodak downloader, but there was nothing to press on either the camera or the computer that would get it to download. I called the support number listed on an enclosure titled STOP!, and suggesting that the camera not be returned until the buyer visited the website for help, or called the help number.  The website was no help.  I called the 800 number and got a recording saying they no longer gave live help for issues dealing with downloading the share software.  I am returning the camera.", "Date": "November 5, 2013"}, {"Title": "Fuzzy", "Author": "BooBooBear", "ReviewID": "RPGHPXPLQWRBZ", "Overall": "1.0", "Content": "Photos are very fuzzy!  Mine would only hold one photo on the hard drive.  I sent it back for a refund.  NOT worth even $20 for photos of that quality.", "Date": "May 4, 2013"}, {"Title": "regular", "Author": "MAURICIO", "ReviewID": "R1J3ENNLCL8MS8", "Overall": "3.0", "Content": "se quemo la unidad del flash, como la compra era para Colombia fue un poco dificil hacer la devolucion y debi asumir el arreglo.", "Date": "December 21, 2012"}, {"Title": "Water Safe camera??", "Author": "jclem", "ReviewID": "R1KL2BMMWOZ8Q4", "Overall": "2.0", "Content": "Camera worked great, but the first time we used it underwater it leaked and took several days to dry out.  Thankfully it worked again, but we will not use it for underwater shots anymore.", "Date": "November 2, 2012"}], "ProductInfo": {"Price": "$69.95", "Features": "Kodak's Share Button tags to FACEBOOK and more3\nAdvanced video features\nMultiple scene modes and color options\nHigh ISO (1250)\nRuns on AA batteries", "Name": "Kodak Easyshare C1505 12 MP Digital Camera with 5x Digital Zoom - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41C6uP3iFHL._SX300_.jpg", "ProductID": "B005AKRW7Y"}}