{"Reviews": [{"Title": "Best in its price range", "Author": "R. D. Hoag", "ReviewID": "RSU2A1XI905M6", "Overall": "5.0", "Content": "I've looked at and read reviews of comparable fixed zoom cameras from Olympus, Cannon, Nikon, Fuji, Sony, etc. and this Panasonic has all of them beat. Now that I have actually bought the camera and had a chance to test it out myself I am extremely satisfied with it. Comparing it against a much more expensive digital slr is sort of silly in my opinion, you can also argue for benefits of having a more compact/lighter camera with one lens that goes from wide angle to super zoom and quickly and the high quality HD video is a huge bonus. The only gripe I have is with noise at higher ISO speeds, but this is about average for cameras in this class and is better then most of the others and the lens has good f stop opening for its long range. As long as you set the ISO to not shoot above 200 for shots that you want the lowest noise, it is excellent. If you are into night shots or action shots where you might need blowups for cropping it isn't a problem, even at ISO 400 for prints up to B 13x19 it looks incredible. They did remove RAW with this model, but I don't miss it much as the camera has excellent output.  Would highly recommend this compact full featured camera over any of the others that have \"star name status\" (Olympus, Nikon, Cannon) in this price feature group.As an example DigitalCameraInfo.com said this about the FZ-47 color accuracy measurements: \"No competitive model comes close to the dead-on accuracy of the FZ47. For that matter, the FZ47 is more accurate than the Nikon D7000, more accurate than the new Nikon D5100, and even more accurate than the Canon EOS 60D, our top rated DSLR!\"  They also said that the noise levels are a huge improvement over the earlier FZ-35 and much better then either the Canon Powershot SX30 or the Fuji HS10", "Date": "October 20, 2011"}, {"Title": "Initial Review & Updates: I'm still in love with the FZ47! (Updated 3/25/2012)", "Author": "Stan", "ReviewID": "R2FV8W4J7UKY28", "Overall": "5.0", "Content": "I've had the FZ47 for about a month and a half, and, so far, I am very satisfied with it. Here are my initial impressions:Likes:24x zoom range -- going down to a 35mm - equivalent of 25mm wide angle! Lots of times I've been in a situation where I can't back up far enough to capture the entire scene -- the 25mm wide angle position will really help in such situations.Resolution and the image stabilizerThe electronic viewfinder (EVF): I wear bifocals, so in addition to LCD's sometimes being hard to see outdoors, I always have to crane my neck to have the LCD in focus -- the EVF eliminates that problem.The AVC FSH movie resolution & the \"zoom\" mikes.The \"intelligent\" dynamics option -- I have a shot I've tried to take with my 2 previous digital cameras (Nikon Coolpix 2500 & Canon A710is) -- because one side of the scene is brightly lit and the rest is in deep shadow. In the old days in a darkroom I would have dodged & burned, but I haven't found a photo editing tool that can do that. The FZ47, however, with \"intelligent\" dynamics set to high, handled the scene very well.The ISO limit set -- it works very well with photos -- you can set the ASA to \"auto\", but the camera limits itself to ASA values at or below the ISO limit.The flash range.The macro function.The options for manual focus, f stop, & shutter speed, along with the rear dial to adjust these.  Together the options work really well. Also, the Focus button really helps when using manual focus.The AF / AE lock.The quick menu (though I wish it was user configurable!)The one user-assigned button.The separate ISO button.Liked better in my previous cameras:With my Canon, if I set the camera to \"Hold\" after taking a picture, I could zoom in to check the focus, etc, and then delete it if necessary -- all in the camera's \"Record\" mode. With the FZ47 I have to go to the playback mode -- even though the camera has a \"Hold\" option. This is the biggest single complaint I have with the FZ47 -- all the rest are quite minor.While the FZ47 has a night-time scene that shoots several pictures in a row & keeps the one with the clearest focus, it will only work in that particular scene mode, and you can't set color balance or anything else in that mode. With my Nikon I could use that function anytime I wanted -- for example, in a museum that doesn't allow flash.Noise above ASA 400. Even movies are a bit noisy at ASA800 -- particularly on areas with no texture and a solid color. I'm not sure if the ISO limit set works with movies, since it's set in the photo section (that disappears when you adjust the dial to the movie position). There is an \"auto\" ASA position for movies, but without the ISO limit set function, that would really be a rather questionable selection in low light conditions.Having to use a separate shutter button for movies -- more often than not I forget & use the main shutter button!If I could give the rating 4-1/2 stars, I would.I've tried not to duplicate information in the Digital Camera Resource Page and other reviews; I've tried to give a user hands-on point of view.As I continue using the camera I intend to update this review, but, for now, I really like the camera.UPDATE 11/20/2011I shot over 50 indoor photos today at a Thanksgiving Gathering, and, as expected the 35mm camera equivalent of a 25mm lens really came in handy -- I constantly got more of the scene in the photo than I expected to. The custom color-balance also worked extremely well. I shot everything using the EVF; I played back for review using the LCD. It's really nice being able to set record for one, and playback for the other. Checking photos for blur (sometimes the shutter speed was 1/10 second; blur occurred because subjects moved -- the image stabilizer was working fine) by having to go into playback mode wasn't nearly the problem I expected it to be -- the mode switch worked instantly back & forth.I also shot 2 short AVC FSH films (about 40 seconds each). The PhotoFun software that comes with the FZ47 is really not even worth loading on my PC (an older single core 3.06ghz Pentium 4 with 4gb of RAM). Please see my review of Pinnacle's Studio 15 Ultimate software -- it works well on my older PC, though rendering a standard DVD from either AVC FSH or mp4 FHD originals takes about 5 hours for 1 hour of video. The important thing is that it works -- it doesn't freeze or fail, and the video & audio are always in sync.The short videos I shot today I intend to load on a website -- in a VERY small reduction. PhotoFun certainly couldn't make the small copy, but a free open source converter called FreeHDConverter works very well -- again, even on my older PC.Overall, I'm still extremely pleased with the FZ47. FreeHDConverter and Pinnacle's Studio 15 Ultimate are wonderful companions, at least for those whose older PC's can't keep up with the highest resolution videos produced by the FZ47. My PC CAN read MP4 HD videos with no trouble, but using the two software programs I can shoot in the highest AVC resolution available on the FZ47 -- and keep the originals for use if I upgrade my PC in the future.3/25/2012Seeing the alignment of Venus, the moon, and Jupiter this evening, I had to take a shot. I've posted two 1024x768 images to photobucket: one shot at ASA 100, the other at ASA 400. Both are shot:Image stabilizer on1/4 secondAbout a 6x optical zoomHand-held, leaning against a buildingAuto white balance\"Natural\" scene modeIntelligent resolution onThe album is at: [...]ORs1139 dot photobucket dot com forward-slash albums forward-slash n556 forward slash Stan2002These are image reductions using the Canon zb module that came with my A710is.Download the photos -- then enlarge them until the moon is quite large -- you'll see the image noise at ASA400 and the moon won't be quite as sharp an image as it is in the ASA 100 shot. Never-the-less, while the ASA100 is better, I would have been quite satisfied with the ASA400 if that's all I could get!", "Date": "November 16, 2011"}, {"Title": "Excellent bridge camera", "Author": "James T. Peeples", "ReviewID": "RHZUWODO77J2H", "Overall": "5.0", "Content": "Now that I've had this camera for a couple of weeks, here are my thoughts.The Good:  Very nice lens that will really get out there, very low distortion even on maximum zoom.  It's fast for a bridge camera, as fast as some DSLR cameras.  It has a full manual mode and it's intuitive, so if you already know how to use a manual camera, it'll only take a few minutes to come up to speed; it also has full manual focus, a welcome addition.  Takes HD video.  Quality on photos and video is very good.  This camera does better than some other bridge cameras at higher ISO settings, although its small sensor still can't compare with a DSLR or EVIL camera.  Comes with lens hood, battery pack, charger, neck strap, and lens cap and strap.  Accessories including filters, a lens protector, and an additional zoom lens (!) are available for purchase if you need them.The Bad:  not much to report here.  The initial setup instructions are omitted from the printed manual, only available with the full manual included on CD.  I prefer a camera that takes regular batteries instead of a battery pack, but as the recharge on this is fast -- about two and a half hours -- that's pretty minor.  If you are getting one of these cameras for serious use, get a spare battery pack at the same time and you're gold.The Ugly:  really nothing, with the lack of a RAW mode being the only serious complaint, and one that won't be a deal-breaker for most folks buying a bridge camera. Very nice camera with a full set of features.  It's physically large--this isn't a pocket camera by any means, and you'll likely want some sort of carrying case for it.  If you are brand new to digital cameras, expect some learning curve.  If brand new to digital cameras AND wanting to use the manual mode, expect to have to spend some time to get there.  However, if you are already familiar with digital cameras, you can be up and going with this one fairly quickly.", "Date": "December 2, 2011"}, {"Title": "A mix of improvements and steps backward from the previous generation", "Author": "Terry R. Umbenhaur \"Video Gaming Ninja\"", "ReviewID": "R3DVE75BDFHQEW", "Overall": "4.0", "Content": "My first Panasonic was the DMC-FZ35K, after owning two Canon PowerShot S-series cameras.  I chose not to upgrade to the FZ40, as the improvements were not too significant.  I was not considering purchasing the FZ47 either, but since it was so steeply discounted ($190), I decided to take the plunge.Initially, I was impressed with the continued compactness of the housing (it is still smaller and lighter than even the 2-year old SX20IS and the larger SX40IS) and mostly unchanged button placement, but I really miss the \"4-way joystick\" which has been replaced by a clickable scroll wheel.  My first instinct was to see if Panasonic had made improvements to the functionality since the FZ35 (which I reviewed several years back).  Unfortunately, the continuous shooting feature is still crippled, there is still no way to lock the exposure/aperture settings in Auto mode, and no option to hold the current shot on the LCD while the shutter button is depressed.What's changed since the DMC-FZ35:++ Screen size and resolution improved to 3.0\", 460k/480x320 (up from 2.7\", 230k/320x240) though the OSD does not appear to be clearer++ Continuous burst improved to a maximum of 7 shots at 12.1MP at 3.7fps (up from max 3 shots at 2.7fps)++ Video improved to 1920x1080/60i (up from 1280x720/30p)++ Lens improved to 24x, 25mm to 600mm (up from 18x, 27mm to 486mm)+ Up to 5 photos (3.5MP) can now be taken while recording HD video (the video does become slightly more blurry while the picture is being taken)+ 3D Photo Mode added to Scene Mode+ Venus Engine FHD (versus Venus Engine HD)+ Handheld Nite Shot added to Night Portrait Mode+ Supposedly more accurate autofocus (I noticed a slight improvement, specifically during video recording)+ 6.5Wh battery (up from 5Wh)+ Playback mode now displays each photo preview when left/right buttons are held down (before, you had to release the left/right button for a second for the image to be displayed)+ SDXC Support for > 32GB cards (versus 32GB max for SDHC)+ 70MB built-in memory (up from 40MB)= Pin Hole, Film Grain, High Dynamic moved to \"Creative Control\" mode= Video Record button moved from back to top, AF/MF button moved from top to back, Flash button changed to ISO, EVF/LCD button moved to right of viewfinder= Lens cap is smaller, and no longer interferes with the lens retracting from housing, unfortunately part of the inner lens housing is now exposed even when the camera is powered off-- Camera can no longer enter playback mode from power off state (previously, a dedicated switch selected between Recording or Playback mode, without the camera needing to be powered on initially)-- 2-way scroll wheel (replaces 4-way joystick)- Dedicated DC input was removed (FZ35 has a 8.4v DC port, FZ47 requires an additional DC coupler which goes into the battery slot)- Internal speaker relocated from right of viewfinder to left of the flash (more likely to be covered when camera is held)- No RAW supportThe picture quality remains superb, but as competing compact cameras upgrade to CMOS technology for improved low light shooting and burst modes, the advantages of a large lens and flash in a CCD-based bridge camera are diminished in many situations.  The relatively high discounts being offered so short after release are likely due to this single point, because the FZ47 is an otherwise terrific value for a quality camera.  The video is among the best I've seen, and this highlights one advantage of the CCD sensor (CCD does not suffer from the rolling shutter effect found in CMOS).At MSRP, I cannot recommend this camera, but at 40-50% off, it is well worth the price.  I rate this camera 4.5/5 stars, solely due to the lacking controls, which are worse when compared to the FZ35.", "Date": "December 15, 2011"}, {"Title": "Fast and responsive, very good photo quality.", "Author": "Evie", "ReviewID": "R11XIP12MC3RXJ", "Overall": "5.0", "Content": "I upgraded to this camera from a Canon Powershot S3IS. I've printed and seen enough digital media that I'm not a believer in the megapixel myth. My S3 yields beautiful 8 X 10 prints at 6 megapixels. I've printed a lot of photos with it. I originally purchased a Canon SX120IS as an upgrade to the S3, but I wasn't pleased with that camera at all. I used it for two months and sold it. The feel, response, and photo quality just weren't there.  The DMC-FZ47K is my new regular, and the S3 my standby now. This camera is a nice piece of equipment. For my review, rather than list \"good\" and \"bad\", I'll instead say what I like and what I think could be improved. What I like:  Construction:  The camera feels well-made and tight.  Size/weight:  Comparable to most super-zooms I've used. Not heavy, but comfy.  The grip is good and balance is good. The neckstrap is comfortable as well.  Startup:  Very fast. Ready to shoot almost instantly.  Zoom:  Fantastic! Smooth and quiet, and control feels good.  Focus:  Focuses very fast in general, even in fairly low light.  Controls:  Fairly well laid out. The buttons have a good feel, not too hard to  push.  Battery life: The included battery lasted for over 100 shots without showing  any measured usage in the battery life bar.  LCD:  Nice and large. No problems here.  EVF: I like using a viewfinder as opposed to the LCD. From the photos I've  taken with this camera, pretty much what you see in the viewfinder is what you'll get in the photo. Maybe not 100%, but very close.  Optical Image Stabilization: My S3 has it as well, but this camera definitely  improves on it. This is especially nice for photos with that long  zoom.  Picture quality:  From the photos I've taken so far, color is very good and  seems to be accurate. With very few exceptions, what I saw  was what the picture looked like. This lens has very good  professional reviews with respect to barrel distortion and  vignetting. In addition, the pictures I took facing the sun  did not show signs of lens flare, possibly because of the  special coating on the lens.  Menu layout: It didn't take long to learn to navigate the camera's menus. If  you're familiar with digital cameras in general, some playing  around in the menus will have you familiarized in no time.  What I think could be better:  Diopter adjuster:  The plastic wheel feels stiff and imprecise, even cheesy.  Adjustment thumbwheel:  This little wheel is on the upper right corner of the  back of the camera. It's used to make adjustments in  manual focus, shutter speed, and aperture in the  respective modes, and well as being connected to other  menu items. Like the diopter adjuster, it feels stiff  and \"clicky\".  No flash output adjustment:  I love this about my Canons. Being able to adjust  the amount of flash output makes better flash pics,  helping to eliminate that \"deer in the headlights\"  look.  No burst-mode button:  My S3 has a button on the top near the shutter button  that puts it in burst mode. This is handy for shooting  fast-moving subjects (I like to photograph airplanes).  Burst mode is buried in the menus.There is a function  button that can be programmed, but not for burst.  No flash control button:  Like burst mode, flash control is buried in the  menus. I set it to always flash, and then just raise  the flash if I want it.  Proprietary battery:  The camera uses a proprietary Li-Ion battery. I always  likes being able to use NiMh batteries in my canons. I  could use the same batteries for all cameras. They don't  run the camera as long, but you can buy some disposables  in a pinch. Extra Li-Ion batteries are expensive.  Proprietary data cable:  Why doesn't everyone use a mini-USB? I hate having a  different cable for every device. There's nothing  wrong with it, it's just a PITA.  Lens cap:  The provided lens cap fits OK, but I don't like the pinch buttons  on it. I feel like I'm going to bang it into the lens some day.  Overall, I'm very pleased with this camera and it's photographs. It focuses fast and allows me to capture moving subjects in daylight with a good chance of getting that perfect shot. I like to go to airshows, and fast-moving jets are not very forgiving of things like shutter lag and slow autofocus. For the price, it's got a lot going for it, despite some minor annoyances. I wouldn't hesitate to recommend this camera to anyone.", "Date": "December 18, 2011"}, {"Title": "Great Camera", "Author": "jpm", "ReviewID": "R1S13C1N9LYJGA", "Overall": "5.0", "Content": "I spent several dedicated hours researching superzoom point and shoot cameras and narrowed it down to the FZ47 and FZ150.  All of my previous cameras have been Canon.  First..don't believe the bad reviews describing the FZ47..especially those reviews written by John Q Public.  Trust more in the reviews that were done by labs that review cameras routinely, such as Cameralabs, etc.  It appears that \"most\" of the bad reviews are from people who simply do not know how to use the camera.  Just do an internet search and you will find 6 reputable labs that have done in depth reviews on most of the current superzoom cameras with comparisons, gathering all sorts of comparison data such as color rendition, sharpness, sensitivity, noise, as well as how efficiently the camera operates, among other attributes.  AS for my purchase, I believe I bought the best camera in its class for the money.  There are a couple that are better, such as the FZ150, but they are up to twice the cost of the FZ47.  Panasonic makes great cameras.  Read and follow the instructions, and you won't be disappointed.", "Date": "December 24, 2011"}, {"Title": "Will never go back to a point and shoot...", "Author": "AmazonReader", "ReviewID": "R2ME1MY4OJA53G", "Overall": "5.0", "Content": "I'll start off by saying that I'm not a professional photographer and I've been a life long point-and-shoot user (love the convenience of being able to carry my camera everywhere).  I've upgraded to the FZ 47 from the Lumix DMC ZS3 (an excellent point and shoot camera- check it out if you're looking for a more compact piece of equipment), and the difference in pictures is incredible.  The FZ 47's pictures are sharp and clear, and the quality of shots taken under low light conditions is excellent.  I have three very active little kids, and for the first time ever I'm grabbing shots I would've otherwise missed. Shutter lag is minimal (especially when you use the \"shutter priority\" setting), the camera focuses quickly, and pictures of my kids moving/running/jumping are not blurry. The image stabilizer is excellent.The camera is ready to use right out of the box, but there are plenty of settings to experiment with.Overall, I'm very happy with the FZ 47.", "Date": "December 21, 2011"}, {"Title": "Best Little Camera Ever (Panasonic Lumix)", "Author": "Ms. Ed.", "ReviewID": "R165B9LIM17GLF", "Overall": "5.0", "Content": "I have been taking 35mm photos since the early 80's and have two other \"fancy\" digital SRL cameras (a Nikon and a Canon) that are wonderful for special projects, but too expensive and HEAVY to throw in my bag and risk damaging on our travels documenting our children's busy lives, our vacation memories, and the many concerts we find ourselves enjoying these days. After buying an earlier generation model of this camera (FZ35 with 18xOptical Zoom) for my artistic daughter who hadn't used SRL units before, I fell in love with it. I bought myself a twin of hers, my dad (who, fun fact, introduced me to photography in the 70's) bought one, our school yearbook asked for my recommendation and bought this camera (FZ47 with 24xOptical Zoom for same price we bought earlier model), and I just bought another for my 15 year-old son for Christmas. Now I have friends asking me what camera we use when we share our photos with them.The default settings and the many pre-programmed modes, the stabilization technology, the quick recovery from a shot, the long-battery charge, its ability to take action shots in florescent lights, and the low price made it an easy choice to recommend to our school yearbook staff who wants professional photography results without having professional photographers. It's difficult to train students and get them up to speed in one year; then they are gone and unfortunately, sometimes, so are the cameras. True, we've \"lost\" more expensive cameras, so the price was definitely a way to get a camera in their hands again without the administration having to worry as much about the investment.If you are a professional photographer, you'll notice its manual settings are not as robust or even as easy to find. But when my eighteen year-old son asked me to take his senior pictures one weekend when school was almost over, I found myself picking up this camera instead of my others because the default settings are so quick and effective to get to while we were jumping from site to site looking for iconic backgrounds (both indoor and outdoor). The results were fantastic with people asking which photo studio took his portraits. He has fun saying, \"My mom's,\" but I know I had a lot of help from this little camera.As an added bonus, I've gotten pretty decent results in various concert venues where I would have never been allowed to take one of my SRL cameras because when security looks at it, it looks like any other point and shoot \"since the lens doesn't come off\" I was told by one security guard. I also get better results under florescent lights where most of our children's special high school events like homecoming, tournaments, and graduations occur (in the gym) than I ever did with my SRL cameras. I'm sure there are some settings and manual adjustments that would have helped on the SRLs, but as a multi-tasking (non-photography) professional trying to fit in time with our family/friends as well, I enjoy just throwing this camera in my book bag and going.Highly recommend. I tell people I originally found the Panasonic Lumix FZ35 due to a ridiculously high rating at a professional photographer site where they NEVER liked the point and shoots...until this little gem. For the price, you will not believe the quality of your photos![SIDE NOTE: I also recommend using Amazon for technology purchases because of the benefit of hearing real user reviews and FREE SHIPPING! I've only had to return a few items at Amazon due to products not meeting my expectations, and I've never had any difficulty.]", "Date": "June 2, 2012"}, {"Title": "Great for the money", "Author": "R. Fieser", "ReviewID": "R3GY09J2YAFTSV", "Overall": "4.0", "Content": "I bought this camera about three weeks ago for an incredibly low price. I had wanted to get the FZ150 for its fast, sustained burst mode and hot shoe, but when the FZ47 was offered for half the price of the FZ150, I changed my mind.The camera reminds me of my old FZ28, but has a longer reach and a slightly wider wide angle, too. The FZ28 went from 27-486mm. This one goes from 25-600mm.  It's not great in low light, but it's not horrible, either.I took a picture of my parents' house from across a lake, about 1.2 miles away. It was fairly sharp, better than I had earlier managed with a DSLR and an inexpensive 70-300mm zoom lens.Some people complain about the lack of a RAW mode, but I don't. I hardly used RAW on the FZ28. I have a Sony A55, which I will use in RAW, occasionally.In the full resolution burst mode, you can get about 7 shots in 2 seconds. You won't be analyzing golf swings at this  rate, but it is enough for the soccer mom/dad shooting an afternoon game.The flash is fairly powerful. The resolution is not bad.I have barely scratched the surface of this camera's many features. I will have to carefully read the manual in order  to better use it.If you don't mind a camera too big for your pants pocket that takes decent to very good shots in a wide variety of settings, you might consider this one.", "Date": "December 14, 2011"}, {"Title": "I adore this camera", "Author": "J. Kendall", "ReviewID": "R2AMUDVFR2S83", "Overall": "5.0", "Content": "I am a long time Panasonic Superzoom user.My first Panasonic camera was a DMC-FZ10, way back in the dark ages of 2004. In fact, I may have even purchased it in late 2003, actually -- since I purchased it, in part, to prepare for the birth of my son (who was a New Year's baby in 2004). Before that, my household was purely filmstock, and this (the FZ10) was my very first proper digital camera.I loved that camera -- mostly. The zoom, a mind boggling (at the time) 12x was great, and in bright sunlight it took truly stellar shots. Indoors? Well, those, for lack of a better term, sucked. Unless you used a flash (and for any kind of distance, you needed some vast external flash, which I purchased and used, thanks to the camera's built-in hotshoe, but it was ungainly to say the least), you simply couldn't take shots in low to moderate light environments. Just wasn't in the cards.Flash forward to 2011. My 7 year old (heck, more than that) FZ10 died a year or two ago (power switch quit working) but I'd moved on before then. My second Panasonic was one of the supercompact superzooms. A zs7, I believe. Again, I *loved* it. An amazing zoom in a tiny package, with picture quality that beat my old, hulking FZ10. Maybe not as sturdy feeling. And maybe just a bit less sharp, although that could be my imagination. (And bear in mind we're talking vastly different resolutions -- my FZ10 was 4.0 megapixels, while everything today is 12+). It did better in low light, it took high definition video (albeit at, I believe, 720p) and overall I was very pleased with it. It also logged GPS locations, something I haven't really made use of, but it's handy that those pictures are all geotagged if I ever get around to using any software that could take advantage of that fact to go and trace/track where I went when I took them. (I'm also not paranoid about such things -- if you care to stalk me, feel free. My photos will tell you where I go, when I get around to uploading them. I'm also in the phone book. So if you really want to stalk, murder, and molest me, my pictures will be happy to assist you in my location. I'm a big guy, and I don't think I look cuddly, though, so maybe when you see them you'll look elsewhere. Anyway, I loved it. But it was little. Which turned into a major liability when, first, I lost it by putting it on a shelf and then not being able to find it for three months. Then I found it. Er, my daughter did. Because she needed it/wanted it for a field trip. So after three months lost, my daughter finds it for her field trip, takes it with her.And promptly loses it on the field trip.It was found for precisely one day. Sigh.Got a replacement. A ZS10. It has a better zoom, probably better video, buuuuuut... Photo quality fell off a lot from that little FZ7. Still nice, but not perfect. So I did the impossible. I asked my wife if it'd be okay, maybe, if I blew yet more of our hard-earned money on yet *another* camera. I was hoping for the FZ150, but the FZ47 came up on an amazing sale around Black Friday at another site which shall remain nameless. Eventually the price was matched here in another sale, but I had already made my purchase.I was a little afraid that I might not love the FZ47 because it's a lower end entry in the lineup, sort of. I thought perhaps the picture quality might not be as good. Who knows. Price was amazing, though, and even without those Black Friday deals, I think the price it seems to fetch is pretty good for what you get. This thing is ten times the camera I bought for close to half a grand, way back in late 2003. Yes, that ancient FZ10 had a metal body, where the new FZ47 is plastic instead... But the optics are great, the autofocus is great, the low light is very, very good, the bright light is superb, the speed is blazing, and the zoom is friggin' awesome... I just love it. The videos it takes are great (although I haven't played them on a TV, so please don't quote me on that -- could be the videos are awful if you see them on the big screen, hehe) I'm serious, I just like everything about this camera. The only thing I find I wasn't immediately on board with was the in-screen menu navigation system. I just found it counterintuitive. But that's a small complaint, yeah? I also find that, sometimes, it's hard to convince the camera to go ahead and take a photo. Not sure what's up with that -- my ancient FZ10 did the same thing -- could be it's a power cycle issue charging the flash? Maybe not, as it also happens in low light with the flash closed. Guess no matter how cool the technology, sometimes you have to wait for it to do its thing.Yes, there are other cameras out there better at certain things. I don't want to get in trouble for mentioning other brands, but, I do remember often envying my Canon owners for their amazing powers of low-light photography. I'm sure they're still better than my FZ47 at low-light photos. But it's not like it used to be -- where they could take amazing pictures and I couldn't take *any*, unless I wanted a one second exposure of a bunch of blurry vague shapes.Every situation where I've tried this camera, it has given me good results. Period. I am practically giddy with joy. I paid little for it (compared to my initial, half-grand entry into the digital camera world, at the dawn of time). Yet for that little, I've gotten what I feel to be a whole heck of a lot.Cons:Okay, using a wifi-enabled SD card (Eye-Fi), I had the camera crud out, give me a weird error, and refuse to write to the chip for a couple of photos until I shut it down and powered it back up.If I don't pre-focus (softly depress the shutter button to get ready to take a photo) the shutter lag can sometimes vary, which can result in missing shots.As I mentioned, I wasn't totally pumped about how the camera's menu system works. That's a personal preference issue, however.I found some of the default noises a bit loud. I spent a frustrating ten minutes trying to figure out the in-camera menu system to turn off all the beeps 'n such when you used the menu system (talk about irony) as well as when you snap a photo. Once they were turned off, its natural \"click\" sound was very modest.Pros:Great zoom. Panasonic pretty much established the Superzoom segment, and while I'm no expert on all the entries, the zoom this camera packs has yet to let me down in any way.Great picture quality. Very happy with the images I've took. I will admit, I haven't done a lot of blown-up work with them, or cropping, so I don't know for sure how it will look when I start peering at pixels.Good battery life. Again, no expert, dunno how it compares to other cameras. But I've yet to go, \"Dangit, why's the battery low already? In fact, I've yet to notice the battery get low, period, except for the first time I took it to my daughter's harp recital, lost my mind, and took four hundred pictures over the course of an hour).Good built-in flash performance (which is good, as they no longer include such old-fogey things as a hot shoe, nowadays.)Good built-in screen, both through the viewfinder and on the back of the camera. (This was true even back with my FZ10, however, so perhaps I'm just not picky?)Hope some of that information helps!", "Date": "December 15, 2011"}, {"Title": "I love Panasonic cameras! No exception here.", "Author": "S. Mitchell \"samintx\"", "ReviewID": "R3AIUF8FW2ZA3W", "Overall": "5.0", "Content": "To begin with I'm no camera maven. I'm just a little ole lady that takes hundreds of pics on my travels. I do love ZOOMs and easy menus. That is why after finding Panasonic I have stuck with it. Good quality pictures, and zoom quality very good. I tried out this zoom because many time a zoom will get you close but the edges begin to blur. In my tests I was very pleased with the Zoom and no Zoom of the same scene. I remind you I'm no expert but we all want to have good clear pictures. With my Panasonics I have no learning curve because they are all the same. I like this camera also because it isn't a bulky as an ordinary SLR camera.", "Date": "July 1, 2012"}, {"Title": "Wonderful upgrade from my dead point-n-shoot", "Author": "KSed", "ReviewID": "REB2DHWZZQBER", "Overall": "5.0", "Content": "I'm a former owner of a Canon point-n-shoot, and my motivation for buying this camera (which I've had ~2 months now) was to capture family events and hiking/boating excursions in North FL. I initially discovered this camera via a glowing article on Consumer Reports, when I began searching for a replacement for our deceased p&s; with only 4x zoom. I pounced on a $240 sale after reading a few other glowing reviews, which you can easily find with Google. I won't bother repeating all of the wonderful features of this camera, but focus on why former p&s; amateurs like me will really appreciate this camera, if you can get it for less than ~$250 (i.e. a true \"sale\" price). I love it.This camera is a little heavier than most p&s; cameras I've used, but is essentially just as easy to use and has FAR more zoom and picture-quality than any p&s.; Because it's a \"bridge\" or \"superzoom\" camera, you really need to get/have a camera bag, an extra battery, a super-fast memory card, and a cheap 52mm U/V filter(s) (for lens protection and/or certain light filtering). The UHS1 memory card (for HD video) is speedy/pricey -> look for camera-shop bundling-deals e.g. in the Amazon vendor list, but don't skimp on UHS1 speed/performance.The attendant software is a little cheesy, but functional. The manual and accessories are great. Freeware video conversion tools are available to convert to smaller formats.Functionality: This camera has buttons/wheels and menu-options for fully-manual photography. It's more busy than I was used to, but easy to pick-up almost w/o instruction. The only disappointment for me is the placement of the video button (on top), which I have to fumble for at the end of a video session (a very minor issue, in my opinion). The \"auto\" modes are at least as good as my p&s;, almost w/o thinking about it, as long as you aren't interested in necessarily pixel-peeping/large prints. But if you do want to pixel-peep e.g. to produce large prints, you only need to know some basic concepts of photography because all of the options are there to take truly exceptional photos. I already knew some of the really basic concepts in that regard, and thus learning to select the options proficiently only took me a few days of tinkering. Even if you don't know any basics of photography, it really shouldn't take you long to find the options while you're reading about the concepts (maybe a week). The key is to learn how to distinguish between interior/exterior options, and how to use flash in conjunction with most of the mode options to get better low-light photos. The color rendering and video quality impress me every time.", "Date": "February 6, 2012"}, {"Title": "Best Long-zoom Camera for the Price", "Author": "Informed Opinions", "ReviewID": "R3NST7049EHTTF", "Overall": "4.0", "Content": "I have tested a few long-zoom cameras, and for the sale price that Amazon had for the Black Friday week, this was an automatic buy!There are similar, and better, long-zooms out there. I've tested SX40, FZ150, HS20 and HX100. The first two seemed to be marginally better performing, especially in low light, than FZ47. SX40 and FZ150 have more features and CMOS sensor, too. FZ150 is THE best long-zoom in the market now. But would I spend $140 more for just a little improvement in the image quality? I would not.The pros and cons have already been discussed by other reviewers here at length. I will just mention a few notes here:1. The default setting for video will result in an under-exposed video. Adjust it before taking videos.2. The camera may sometimes refuse to focus on a small object at a distance of, say, 2 to 5 meters.3. The iA mode is pretty darn good, excepting for low light conditions (such as night panorama of a city downtown etc)I will update the review as I find more things to note.", "Date": "December 19, 2011"}, {"Title": "Image Quality is Lacking with the Panasonic DMC-FZ47", "Author": "Photo_Bob \"PhotoBug\"", "ReviewID": "R1T5YB87GSHCXT", "Overall": "1.0", "Content": "As a firm believer that Panasonic has the best Ultra-zooms in the market, it pains me to write this review. I purchased the FZ47 camera in mid-November when it was on sale.  The reviews were sketchy at the time so there was little to go other than Panasonic's reputation for having fine Ultra-zooms.  Besides, I already had four of them - FZ30, FZ8, FZ18 and the FZ35 and knew they were the best ultra-zooms out there.  But when I tested the FZ47 against the FZ35, a predecessor Panasonic ultra-zoom camera that got stellar reviews,  the image quality was awful - not poor but awful.I took hundreds of comparison photos over a couple of days and was very disappointed.  The noise was simply unacceptable. Fine detail was severely lacking as the ISO went over 200.  And with a zoom of this magnitude, the ISO automatically adjusted between about 200 and 320 on the day of my photo comparisons. Maybe if I lived in Barbados I would not have experienced the poor image quality.  But I live in the northeast where we see many overcast days and the camera did not measure up under those conditions.I bought four of the 47's and sold everyone of them within days. It appears that the FZ150 has better image quality so I may look at that camera but skeptically at best given this last experience. Lastly, I'm not an expert, but I do my own developing as I have a complete wet \"Kodak\" darkroom as well as digital \"darkroom.\"  Over the years I developed an eye for clarity with my wet chemistry developing and now even more with the dry digital photo imaging.  I know a clear image when I see one and didn't see them with the FZ47 except when I kept the ISO at 100 which was very hard to do.In summary, this diehard fan of Panasonic Cameras was very disappointed in the FZ47.  I simply don't understand how Panasonic missed the boat with this model.  Image quality is the only feature I place high on my list so despite the many other features of the FZ47, I simply can't give it a higher rating.", "Date": "January 2, 2012"}, {"Title": "Fantastic", "Author": "sammy", "ReviewID": "RQJSE80SN8OUK", "Overall": "5.0", "Content": "The DMC FZ 47 is a truly great camera, It's color accuaracy is way beyond anything else in it's class and even superior to camera's costing more than 3 times the price(and this fact is backed by professional reviews not just mine). It's far better than my two DSLR's . I am amazed at the quality of the photo's this camera is capable of. The image samples from around the web do not do justice to this camera, and real life images are far, far more detailed and sharper, especially up to ISO 400.. ,although to really get the best out of it you need to really take the time to know and use the mind boggling array of different modes and features. It is extensive to say the least. I would not read into the negative comments to much because anybody who really knows how to utilize and understand all the manual controls and other settings would come to a completely different conclusion, for sure. Not only is it fast but it takes outstanding video as well (with manual control to boot).The negatives of note are, Panasonic needs to move the speaker so your fingers don't cover it up, and a printed easier manual to understand for beginners would be a big plus. The advanced operation CD is poorly done and i can see how somebody would not bother trying to really understand it thus not giving the camera a fair shake. Make no mistake though, if you take the time to truly read and understand what this camera is capable of you should be very pleased and this coming from a long time DSLR user.Go for it, it's more than worth the price at it's suggested list, if you can get it for less, like what amazon has it for it's an absolute steal.", "Date": "February 4, 2012"}, {"Title": "Love this camera! Great value.", "Author": "Life is Good", "ReviewID": "RTACITBJG28ZJ", "Overall": "5.0", "Content": "Purchased for my teenage daughter. This is the model before the FZ60 came out which added HDR, CMOS sensor, faster continuous shooting, other s/w features.Decided to get this one when the price went down.  We where looking for a super-zoom camera that was lightweight and takes great pictures.  This camera fit the bill.  This camera (and the FZ60) in my opinion is a great alternative to the Canon and Nikon super-zoom/bridge cameras.  What still amazes me is the photo quality, the 25-600mm lens, and features for the price.  We live in Montana so there are opportunities every day to zoom way in on wildlife, mountains, sunsets, etc and with it's image stabilization you don't need a tripod in most situations (only when it gets darker outside).  With wide angle at 25mm you can get everybody in your photo on group shots, don't need to step back or squeeze everybody together like you do with many point and shoots. I have my daughter just leave the camera on iA (Intelligent Auto) and let the camera figure out the best settings and it works very well.  When she's ready, the camera has excellent manual features.If you're looking for a bridge camera why spend more, unless you need a flash hot shoe, raw capture capability, take a hard look at this one (or FZ60) it's a solid camera that takes outstanding photos with a boat load of features for a better price.", "Date": "October 12, 2012"}, {"Title": "Great Camera and Great Price", "Author": "Holly J. Blake \"hingham9\"", "ReviewID": "R2AFMDKTUBJ3YD", "Overall": "5.0", "Content": "After checking out various cameras in the class, I went with this Panasonic.My reasons:  1.  I loved my old Panasonic.  2.  LEICA lenses on a camera in this price range is fantastic.  3.  On/Off SWITCH, not a button that can be accidentally hit on or off at the wrong time (like Canon!)  4.  The pictures are phenomenal without having to carry a camera case full of interchangeable lenses.  5.  Settings are on a dial, you don't have to go through digital menus to switch between often-used settings.  6.  Simple battery charger (unlike my children's Nikon that had too many pieces that ultimately got lost)  7.  24x Optical zoom.I haven't used video yet, so there is no comment on it for that reason, not because it is an issue.  Though I heard Walgreens would be able to burn DVDs from SD cards soon, so I am going to have to play with the video option soon, my old camera did not have video and I didn't want to use up space on my computer's memory to upload video onto it.Cons:  I haven't come across any.  I've taken a couple hundred photos on this camera already, in the few weeks that I have had it and I am very happy with the camera.", "Date": "June 25, 2012"}, {"Title": "Great Camera!!!  Great Price!!", "Author": "Detroit4ever", "ReviewID": "ROXKPF1QKUGPX", "Overall": "4.0", "Content": "After reading SEVERAL reviews it came down to the FZ47, FZ150 and Canon t3.  I went with this one because of the price.It simply fit my budget and the reviews were great.  I have a Canon HD Camcorder so I didn't need the FZ150's video options.I felt the FZ47 was a better deal than the Canon.  Out of the box, in auto mode, the camera is pretty good.  Noise is pronounced at higher ISO and telephoto at least in Auto.  Can't wait to mess with the settings to get better results.  For $300, it's worth it!  Color is awesome, the focus is fast and lag time is nearly DSLR fast.  One of the best point and shoots I have ever used.UPDATE:  as I have experimented more, this really is a good camera!!!!!!!!  It's fast and the quality is great.  Images can get a little noisy, but with all the setting options you can work on that...I highly recommend this camera!UPDATE:  buy this camera, only use iA sparingly.  Though iA gives nice results, the true magnificent of this cameramen can be found in PASM settings.  Experiment and explore.  Learn about ISO and f/stop...aperture and shutter speed.  Images can explode with the right settings.", "Date": "May 4, 2012"}, {"Title": "Excellent Camera!", "Author": "C. Palanisamy", "ReviewID": "RNBWIGOZ9GG9E", "Overall": "5.0", "Content": "I got this camera during the Thanksgiving shopping from Amazon. The shipping was earlier than promised. Very easy to use. The picture quality is amazing. THe flash is so bright and lights up the entire room instead of only the focusing object. iA mode works for me right now, yet to explore the other settings and features. Flower mode is awesome! The battery life is very good. So far I have charged only once and I have shot more than 70 pics and 15 minute video. Still, it shows full battery. The battery charger is compact, directly plugs into the electrical socket, no wires. Video quality is very good, performs good in low light. In essence, I am very much impressed with this camera, upgrading from a Point and shoot!.", "Date": "December 18, 2011"}, {"Title": "Even better than expected", "Author": "E. T. Hildebrand", "ReviewID": "R94UIFJPO0C9K", "Overall": "5.0", "Content": "I really didn't need another camera: I already have a Canon EOS Rebel T1i 15.1 MP CMOS Digital SLR Camera and a brand new Canon ELPH 300 that I am very happy with.I had been hearing great things about the Panasonic Lumix series for a long time and thought the current lowered price made it worth getting if only to experiment with... I'm glad I took the plunge.The new ELPH is very tiny but has proved to be a very capable performer for both still shots and 1080p movies.The Canon T1i is a full size SLR but takes very nice, clear images.Sizewise, this Panasonic is in between the two Canon cameras. Performance wise, the Panasonic easily outperforms the Elph in terms of image clarity - particularly for telephoto and Macro pictures. In fact, the Panasonic has provided much sharper imaging than even the big Canon T1i when comparing telephoto shots. The SLR would most likely outperform the Lumix if it were equipped with something other than it's inexpensive stock lens... but since we are comparing the Lumix to a far more expensive camera the results were surprising.Each camera has it's strong points: The ELPH can go anywhere and fits in a shirt pocket. The SLR can be used with telescopes and microscopes. The Lumix has the best telephoto capabilities while retaining a fairly compact size.", "Date": "January 31, 2012"}, {"Title": "The next phase.", "Author": "Bumble \"I Bounce\"", "ReviewID": "R3PQL80V2P930K", "Overall": "5.0", "Content": "I still have my Lumix DMC FZ-1. The processor got a bit twitchy after extensive use but I can't stand the thought of parting with it. And, my wife just confiscated (not really, she needed a camera that she could throw into her road-bike bag without concern of damage due to jouncing and bouncing) my four year old Lumix DMC FZ-8. It still works perfectly though the battery after more than 10,000 pics and countless trips through rough territory and who knows how many recharges, is getting tired.So, there was no doubt that Panasonic via the newer iteration of the Lumix line would be my next purchase. I paid $319 for it, what a deal. The FZ-8 was $400, four years ago. And wow! What a great camera. It's so similar to the older models and an easy dealio to adjust to. It does have improvements and tweaks that'll take me years to grow into and properly appreciate. I'm not the dude to go into the technical aspects, I don't bother much with that sort of thing anyway and others have done/will do a much better job of it anyway. I will say that this is one fancy thingamajig-hoojybobbit though. It makes take'n perrty pictures real easy-like.", "Date": "November 20, 2011"}, {"Title": "Perfect camera to grow into", "Author": "Shaiha", "ReviewID": "R2AJJ5AGXZZ7T5", "Overall": "4.0", "Content": "Before I start I want to make it clear that I am not an expert or even an experienced photographer.  In fact my only previous camera is a little point and shoot which really wasn't meeting my needs.  That is the reason that I decided to take a step up into a bridge camera.  I did a lot of research and discovered that this camera is the highest rated for its class and cost range.The two things that really drove me nuts about my older camera was the fact that it only had 3x zoom which didn't really didn't work unless I was right on top of the subject.  Also I couldn't adjust any of the settings to be able to photograph my jewelry.  Both of these issues were addressed in the camera along with so much more.  The 24x zoom is great especially when I am trying get some good animal pics and I have found that the burst mode really helps out there also.  I haven't taken any jewelry pic yet but just knowing that I can do any adjustments needed to really make them shine is a weight off my mind.There is just one thing that I have discovered that I would change about this camera and that is the owner's manual.  It comes as a pdf on the cd enclosed with the camera.  I would really have preferred it to be a printed manual.  Oh and it would be great if you were told just what comes with the camera itself for those of us taking our first steps into real photography.", "Date": "June 19, 2012"}, {"Title": "Excellent camera", "Author": "James J. Bjaloncik", "ReviewID": "R1UMDFH7KHYRF7", "Overall": "5.0", "Content": "This is the slightly less expensive model of this particular camera. My son-in-law bought the more expensive one (has a flip-out screen and several other features which I didn't really need) and I was very impressed with the photos he had taken.  This camera arrived promptly and has functioned perfectly.  I am much more pleased with the photo quality from this camera as opposed to an older Sony digital which I have become rather unhappy with.  The newer style data card in the Lumix holds many times more photos than the Sony to boot.  This was a superb purchase and I highly recommend both this camera and the higher priced model. The Lumix line is top notch as far as I'm concerned.", "Date": "April 26, 2012"}, {"Title": "Great upgrade from my FZ28", "Author": "Wong Kuan Suan", "ReviewID": "R3UZ9LM3JNXGEE", "Overall": "5.0", "Content": "Although I originally wanted the Panasonic DMC-FZ150K, I decided on the Panasonic DMC-FZ47K as it was about $200 less.Both somewhat offered the same specs expect for the following (at least to me)1. CMOS Sensor2. free-angle LCD screenFor the $200 savings, I could plow it into the Canon SX40 HS or a DSLR in the future.I've been using my Panasonic DMC-FZ28K and this is a great upgrade for me. My other P&S; is a Panasonic Lumix DMC-ZS7 and they make a great combination for overseas trips.", "Date": "January 24, 2012"}, {"Title": "Leaps and bounds above point and shoot", "Author": "Jessica 92103", "ReviewID": "R1Y6GONTHWVIQG", "Overall": "4.0", "Content": "I decided to get myself a camera as Ive been without one for a few years and wanted to be able to snap some nice shots.  I was tired of point and shoot as the focus wasn't always great and when I'd take action shots (I ballroom dance with friends for fun) they'd be blurry.  Ick.  With this camera I can do action shots, low light shots, up close shots . . . I haven't been able to find what it can't do.  I'm not a pro, but this is a GREAT consumer camera.", "Date": "February 4, 2012"}, {"Title": "Resonable Price, Amazing Camera", "Author": "Hoi Van Tran", "ReviewID": "R1LVGRFVJVSRW4", "Overall": "5.0", "Content": "It took me almost one week to figure out which brand of camera is the best in terms of reasonable price (for those in a limited budget like me), easy operation, high quality taken-photos and recorded-videos, long life battery, powered by Lithium battery or AA ones, zoom, etc. Although I am not professional, I relatively master in using and operating camera. I read a number of customer reviews on amazon, eBay and some other websites as well as compared many different camera brands with each other (of course similar function and price comparison) such as Canon, Nikon, Olympus, Sony, Fujifilm, Kodak, Samsung, and Panasonic. And ultimately, I decided to choose Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera with 24xOptical Zoom. Now I see my decision was absolutely right. With the price of a bit over $250, this camera meets all of my demands above. One more important thing, this camera was \"Made in Japan\" and was sold by Amazon.com LLC. So I have been greatly happy with this camera. It really does even more than what I expected.Via amazon.com website, I'd like to strongly recommend this camera for those who are in the situation like me. I am sure that you won't be disappointed with this purchase.Thanks Amazon.com LLC so much for selling such a great product with great customer service. That is why I always purchase valuable things sold by Amazon.com LLC", "Date": "July 13, 2012"}, {"Title": "Excellent, worth the price, 24X zoom (more possible) & takes terrific photos.", "Author": "Gary in Sun City, AZ", "ReviewID": "R1V3VFOR3O9S5", "Overall": "5.0", "Content": "I am extremely happy with this camera so far, though I've only owned it 2 weeks. It was rated the #1 bridge camera at CReports and had other excellent reviews at sites like dpreview.com. I recommend you download the users manual from the included CD. The camera packs a lot of features. You can use it fully auto or use some more of the adjustable options. Not only that, it takes excellent photos. I shopped for awhile before buying this one. Originally I bought a Fuji 4500 from Costco for a lower price. But this is a better & more sopisticated camera with Leica lens. Give this one at least your consideration. By the way I am finding this camera takes amazingly crisp pictures outdoors with accurate color.The only thing I don't care for is the tulip lens shade it comes with. Using it with the on-board flash may even cause some of the lower light being blocked. And camera may not fit into a smaller camera case with it on, an inconvenience. I choose not to use it, and instead have a Hoya Pro 1 52mm UV filter, which protects the Leica lens.I also own a Canon Xsi (dSLR) and Panasonic DMC-FH25. With this camera I have the best features of each.", "Date": "April 12, 2012"}, {"Title": "Finally a camera that does what it says it will", "Author": "Just Me", "ReviewID": "R285YGHQJXE0EN", "Overall": "5.0", "Content": "Because my daughter spilled coffee on my old camera I was searching for a new one and wanted to upgrade a little not a DSLR but better than point and shoot. I purchased and returned 3 other cameras before trying the Panasonic Lumix DMC-FX47, I am in love with this camera I know next to nothing about photograhy and I have been taking amazing photos with the FX47 I am now in search of a good photography book because this camera has inspired me to want to learn more and really find out all this camera can do. I am a very thrifty consumer and I like feeling like I got a good deal, The price on the FX-47 was great and am very pleased with the quality, very satisfying purchase.", "Date": "February 25, 2012"}, {"Title": "Great Camera", "Author": "RLM519", "ReviewID": "R351IRMP88TJWF", "Overall": "5.0", "Content": "This camera is fantastic.  I am a complete amateur who wants to learn more about photography.  I have owned several point & shoot cameras, and have never been completely satisfied with the quality of the photos.  This was a big upgrade for me and I am extremely satisfied thus far.  This camera is sturdy, easy to use, and has taken great photos so far.  It has a lot of different settings, but has been easy enough for a novice like me to use.  The zoom is amazing as well as the sports setting.  It has allowed me to take great candids of my children while they were playing in the backyard.  I've been experimenting with all the various settings and I haven't been disappointed.  If you're looking to upgrade to a new camera, the Panasonic Lumix DMC-FZ47 is a fabulous camera.", "Date": "January 22, 2012"}, {"Title": "LUMIX", "Author": "Nice guy", "ReviewID": "R139GCQW3TMM63", "Overall": "5.0", "Content": "I was hunting down a zoom camera for a while I needed a strong outdoor performer for my sons sports activities, the lumix fz47 does the job, it provides more than enough zoom and fast enough to capture moving objects. When you set the lumix on intelligent auto it lets you concentrate on youre shooting and not on the settings so it eliminates a lot confusion. Its a great camera for the price..", "Date": "January 15, 2012"}, {"Title": "A fantastic Camera", "Author": "Darren Lewis", "ReviewID": "RY33RNKI25KUY", "Overall": "5.0", "Content": "This camera does it all. I really like the ability to shoot multiple shots with the touch of a button and then go back and edit the ones that I wish to keep. The 24X optical zoom is wonderful. So many options to choose.", "Date": "January 15, 2012"}, {"Title": "good performance for the price", "Author": "J. Allen \"j allen\"", "ReviewID": "R2XZIPP4YUR1E9", "Overall": "5.0", "Content": "I moved up from an FZ35 which was a nice camera itself.This one has proprietary batteries and although you can get third party batteries, they do not allow reading of the battery level.The FZ35 was the last model that allowed after market batteries that were fully compatible.Other than that, this camera works great and the 24x zoom is nice.It takes pretty sharp pictures with good color control.I do not think any cameras do perfect color control, so I recommend learning to edit your photos for the best picture.I have had a few Panasonic Lumix cameras.  They have all been good cameras and reliable.Now I have the FZ47 and an FH25 which I carry in my car.Lots of nice features and a good lens.  Good price/performance. You can't go wrong.", "Date": "December 30, 2011"}, {"Title": "Awesome", "Author": "weirdnjfly", "ReviewID": "REA5FLECXM1SA", "Overall": "5.0", "Content": "Omg just got this camera for my self for x-mas and i cant even begin to describe how much i love this camera. The picture come out is such detail and such great quality i was really shocked. I was taking chances in buying this camera because i didnt get to play with it before my purchase. But i love it the settings and everything is almost dummie proof but you def have to play with it to find out all the options and functions. i took it on a trip to a light house the quality in pictures w full zoom are absolutly amazing.", "Date": "December 18, 2011"}, {"Title": "Great for video H.S. football games", "Author": "Duckey Wuckey \"Duckey Wuckey\"", "ReviewID": "RLJTIXS56ZBUE", "Overall": "5.0", "Content": "Just finished about 1 hour & 20minutes of videoing of the son playing football at a high school Friday night game. The zoom ability and results when played back tonight on the computer were great and quick to download the approximate 8gb of data from the sd card vs. the older 8mm conversion slow process. The panasonic avhc etc. I'm not going to look up their branded codec compression abbreviation but it works flawlessly and it was superb for my son to immediately watch his plays from a few minutes ago.I would recommend this to anyone with kids wanting to capture a sports event. I was in the stands with a track separating the field from the stands and sitting where the 50 yard line would cross. I was able to clearly video the game from both 5 yard lines zooming in to about 4-5 players on the line of scrimmage in the field of view if desired.A few people writing reviews commented that the battery did not last long so I bought 2 extra just in case....To my surprise 1 battery lasted the entire hour and 20 minutes and I never needed the others. Why? Because I only use the viewfinder window and do not display the lcd screen that sucks down the battery rapidly when recording. So, anyone wanting to video great movies and easily transfer them to computer with a class 10 sd card....this is a great choice.P.S. I'm never again going to use the slow 8mm tapes via camcorder with their slow conversion to digital for the computer....SD cards are the way to go for me.", "Date": "September 7, 2012"}, {"Title": "panasonic lumix camera is fantastic.", "Author": "Pat", "ReviewID": "R1QUAOII2O2J2Q", "Overall": "5.0", "Content": "I love this camera for the value and the features. It is the best camera in its class. I would recommend it to anybody", "Date": "February 18, 2012"}, {"Title": "Great step up from simple point and shoot", "Author": "Rusty", "ReviewID": "R2QUCSCJ4ZAW0M", "Overall": "5.0", "Content": "I bought this for my wife for Christmas just before we went on vacation. Without reading the manual, we had no problems taking great shots. The thing my wife likes is that the button for taking a picture has minimal time lag- you press and it takes a shot. Her old one did not do that and caused her to miss many good shots. The shots are very clear and the zoom works great. Nice wide angle as well. No complaints about this camera. We took about 150 pictures using the default setting and the battery still has about 2/3 of its life left. The flash was used for about 15 of the pictures.We have had this camera for about 1 1/2 weeks. Neither my wife nor myself are expert photographers. Her old camera was a Cannon from Walmart.", "Date": "January 2, 2012"}, {"Title": "Great alternative to a DSLR for a LOT less money", "Author": "Janie Wanie", "ReviewID": "R3NIF0280Q4U95", "Overall": "5.0", "Content": "I bought this camera for my husband's Christmas present. He would've really liked a DSLR, but I was not prepared to spend that much money for Christmas this year. He's very happy with this camera: it takes great pictures, is not complicated but gives you the option to be more creative than most digital cameras that aren't DSLR.  He's enjoying experimenting with it.", "Date": "December 30, 2011"}, {"Title": "How to download the motion picture file from panasonic DMC FZ 47K from sundisk to pc?", "Author": "knowledge", "ReviewID": "R2BQ1YH77X7BR5", "Overall": "4.0", "Content": "I got a panasonic dmc fz47k  Dec last year from amazon. I took motion pictures (videos) and they are very good. The problem I have is I only can play back those motion pictures  from the LCD monitor of the camera, but I cannot download those motion pictures through a sundisk reader into my pc,even cannot find the files on the pc. My pc is HP Pavilion dv6 with windows 7. Thanks for giving me some help.", "Date": "March 17, 2012"}, {"Title": "Great value for the price", "Author": "Unknown", "ReviewID": "RSB9EJIKOPLI0", "Overall": "4.0", "Content": "I've owned this camera for a little over a month now, and I am very pleased with this product.  Overall, the pictures are crisp, sharp, and color true to nature with the amazing Leica lens.  This camera has a lot of options that allows it to be a simple point and shoot under IA control, but also allows some room for creativity for the beginner hobbyist with its manual options.  The long zoom range provides a lot of flexibility and is great if you plan to use it on travel. It is a little bulky at about 1.1pound if you want to compare it to camera that fit in your pocket, but it's size is really unnoticeable with the nice hand grip it comes with. It certainly weighs less than those fancy dslr. I have also been satisfied with its video capabilities, and pleased with the camera's ability to take photo shots as well when the video is on.  The camera as a whole is very fast to start up and wait time to take pictures is minimal.Indoor pictures however can be a little yellow, but a lot of that can also be depending on the scene selection you put it on.  My only other issue with this camera at the moment is the menu can be a little confusing looking for the particular settings I am interested in.  I believe this is a learning curve, and will just be easier once I play with this camera more.This camera provides a lot and is a great little piece of equipment for the price range.  I think many will be satisfied for the beginner photography hobbyist like me.  It surely should satisfy the average consumer who is only used to a basic point and shoot.  I highly recommend this product.", "Date": "October 18, 2012"}, {"Title": "Very Happy", "Author": "Skippydoo \"sheilla_a\"", "ReviewID": "R2HM4L59SQSG5S", "Overall": "4.0", "Content": "In my search for a Megazoom I first bought a Canon and returned it the next day highly disappointed.  I then found the Panasonic Lumix and am very pleased.  The camera is much faster than anything else in its price range and some in a high range.  The zoom is very good and the features are easy to use.  It's on par with the Canon's picture quality, but the speed really enable me to capture the kids and dogs in their frenzy.", "Date": "August 24, 2012"}, {"Title": "I'm very happy so far", "Author": "Aintnorock", "ReviewID": "R3BHJL7O5X5ASG", "Overall": "5.0", "Content": "I had another cheaper brand model (Kodak ZD710 which now retails more than this Panasonic) that I started having problems with battery life. I was looking for a mid-range camera with these must haves: burst mode, view finder, panoramic assist, super-zoom. I thoroughly searched the reviews on Amazon and a couple other places including Consumers Reports.  This camera has all the features I wanted and more.  I saw many models I liked but they all had more than a few negative reviews.  This camera only had a couple, and I think the reviews were pros who wanted something more, but cheap.  For the price, I find this camera to be the best in its class.I've only had it a couple days, but I love it. I took it to an indoor football game and expiremented with it. Super zoom image stabilization worked great. Took a zoom video of a band that turned out great. Only downside that I saw was that burst shots of action plays seemed kind of slow. I tried different methods and found that the Intelligaent point and shoot mode actually worked better than the sports mode. It was probably me not knowing enough, and I'll eventually figure it out, but I have to give the camera 5 stars.As for battery life, which was the problem with my Kodak, so far, so good.  It's got a lithium ion rechargeable battery.  I had the camera on for 3 hours last night - it went into sleep mode a couple times, and I took over 300 pictures plus some video and the 3 bars on battery life only went down to 2 near the very end.I'll revisit this review after I learn more and use this camera more.  Taking it on a mission trip with 15 7th and 8th graders who are constantly on the move.  Should be intersting.", "Date": "May 27, 2012"}, {"Title": "Great Camera", "Author": "Wine Teacher", "ReviewID": "R3PFT7VFDRV27F", "Overall": "5.0", "Content": "This is an excellent camera.  The image stabilizer is great as is the super zoom capability.  The optics are good as are the features overall.  The color balance is excellent.  The feel is also excellent.  A Leica lense doesn't hurt either.", "Date": "May 25, 2012"}, {"Title": "Fabulous!", "Author": "Amber Tro", "ReviewID": "R29XNMCVMLVLJY", "Overall": "5.0", "Content": "I purchased this after reading the reviews on CNET.  (strongly recommend this site before buying ANY electronics) I love this camera!  It takes fast, clear, pictures.  It is simple to use.  I am not an expert photographer, by any means, but this camera makes me look like I could be.  Worth the money if you want a megazoom camera with some, but not too many, bells and whisles.", "Date": "May 13, 2012"}, {"Title": "A one-size-fits-all camera that pulls it off", "Author": "R. Foster", "ReviewID": "R13OX20X0RYLCY", "Overall": "5.0", "Content": "Usually when something is one-size-fits-all, it's usually average at everything, and doesn't excel at anything.  This camera may be the exception.  Still pictures are great, videos are great, sound (for the video) is very very good (not great, but very very good)(at least as good as any other consumer video camera).Battery life is great for taking photos.  It will last days if taking nothing but still pictures all day.  Video time is short, however. If you plan to take lots of videos with this, get a spare battery or two, and/or an A/C adapter.For this price point, I doubt you'll find anything better.", "Date": "May 7, 2012"}, {"Title": "Luminous Lumix", "Author": "Amazonbert", "ReviewID": "R2Q2CL0W4ZEWVY", "Overall": "5.0", "Content": "The Panasonic Lumix FZ47K is simple to use, impressively smart and possibly more than we expected in a point and shoot camera. While it is larger than our previous point and shoot and will not fit in a coat pocket it makes up for its lack of size with a preponderance of easy to use features. The HD video capture can be activated by simply pressing the video button, no knobs to turn, no touch screens to search. The resulting videos are of exceptional quality, far beyond the video obtained with our non HD palm sized video camera. The iA, intelligent auto function has corrected back light issues and subject movement giving the impression that the photographer is talented, which he is not. It replaces two cameras, our older point and shoot and palm video camera. Now only one of us can do all the camera work of two. Battery life and memory storage have been non issues up to now. In a nut shell, it has made family photography fun for everyone who has picked it up.", "Date": "January 5, 2012"}, {"Title": "Panasonic Lumix Best Camera's Hands Down", "Author": "JB", "ReviewID": "R2ZEPL3DFHEWWV", "Overall": "5.0", "Content": "I just bought the Panasonic Lumix DMC-FZ47 About 3 Mo. ago and have already taken over 5 gigs of pictures! Love this camera! I can actually shoot perfect pictures zooming down the road at 60mph! Prior to this camera I did have another lumix it was a 12x and had it for years. I am impressed with this product. For the price? U can't beat it!", "Date": "January 4, 2012"}, {"Title": "Very good for the price", "Author": "Michael", "ReviewID": "R2AJOGFXID60R3", "Overall": "5.0", "Content": "Panasonic Lumix cameras are very nice for their price.  It is not a professional grade camera, but it is close considering it is a quarter of the price.  It has lots of quick modes for photos and the HD video looks great.", "Date": "January 3, 2012"}, {"Title": "Brilliant and simple camera!", "Author": "Leslie", "ReviewID": "R31C9LRIHRSTMI", "Overall": "5.0", "Content": "This camera is absolutely amazing!  It is perfect for the person who wants a step up from a basic digital camera but does not want a multi-lense camera (i.e., anything too complicated).  You can use this camera in \"auto\" mode or be more creative and adventurous with the many advanced \"photo-taking\" options this camera offers.  A great buy for a fantastic camera!", "Date": "January 1, 2012"}, {"Title": "Great Camera for the price", "Author": "Scott Copeland", "ReviewID": "R31U15YCI2EH7C", "Overall": "5.0", "Content": "This camera is easy to use right out of the box.  I took this up to some remote parts of British Columbia and took a variety of close up to far away magnified pictures and they all came out beautifully.", "Date": "April 2, 2013"}, {"Title": "This camera makes it easy to take great photos", "Author": "Isabel Escobar", "ReviewID": "R2EL43XBQ6LNCZ", "Overall": "5.0", "Content": "I left on a trip shortly after purchasing this camera, and didn't have time to actually learn how to use it properly.  So I left it on automatic most of the time, and the \"intelligent auto\" did the work for me.  I am very happy with the photos and the camera.", "Date": "November 8, 2012"}, {"Title": "Happy with camera overall and its price", "Author": "elam", "ReviewID": "R2NYMKURF18G1N", "Overall": "4.0", "Content": "I got it used but its condition was really like new when I received it from Amazon, which exceeded my expectation!  Overall I like this camera very much.  High-speed sports and outdoor low-light photos can be a challenge.  I am still playing to try different configurations to get high-speed and outdoor low-light photos right but so far 70% of these shots were useless.  My wife tried it too and she gave up after a while.  Battery life is good, pretty much as rated.", "Date": "October 1, 2012"}, {"Title": "very  delighted", "Author": "treasure_tramp", "ReviewID": "R26KKFJHS2JE07", "Overall": "5.0", "Content": "I'm having fun with my new camera and video. I'm still learning how to use all the features, but the photos are great and the video is easy to use and looks great too.", "Date": "April 14, 2012"}, {"Title": "Good Camera", "Author": "Marilyn Mercer", "ReviewID": "RE50B8QL2FLVR", "Overall": "5.0", "Content": "Overall we are very happy with our purchase.  We still haven't delved deeply into the instructions to find out all it can do, but for the regular settings we've used the shots are really good.  The pictures are clear and the shutter speed is also fast compared to our old camera.", "Date": "March 12, 2012"}, {"Title": "For Fun and Some Serious Art!", "Author": "Ivana", "ReviewID": "R17S56MJ69II93", "Overall": "5.0", "Content": "We are so happy with this camera!Bought it before our little girl was born..and we kept all special moments so far!Can also be use with it's manual settings if you have time for some serious art work!", "Date": "March 11, 2012"}, {"Title": "Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera", "Author": "Bud", "ReviewID": "R6K68FDKW0NPD", "Overall": "5.0", "Content": "I am very pleased with the Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera that I purchased about two months on sale for $190.00.  I took about 200 pictures so far shooting both indoors and outside. I also shot some video inside without any additional lighting and the video looked great.  I am very satisfied with it, and would recommend it to anyone that is looking for a high end point and shoot camera.", "Date": "March 11, 2012"}, {"Title": "Great Camera / Gran Camara", "Author": "Amanphys", "ReviewID": "R2WPLBLG7KX6JT", "Overall": "5.0", "Content": "It is my second camera lumix, I am fascinated with this camera. Is simple for use, It has good zoom, has good capture moving objects and It has  easy to use features. Is perfect.Es mi segunda camara Lumix y estoy fascinada con ella. Es simple de usar, tiene un buen zoom,  tiene buena captura de objetos en movimiento y tiene funciones faciles de usar. Es una camara perfecta para quienes iniciamos en la fotografia.", "Date": "January 30, 2012"}, {"Title": "Very vesatile and capable camera", "Author": "Traveler 1 \"Traveler 1\"", "ReviewID": "R1H282RJ4185DU", "Overall": "5.0", "Content": "Bought the FZ47 as a replacement for my FZ 20. The FZ 47 is well ahead in all areas. The quality of the pictures out of the box in the Ai mode make it super simple to hit the ground running, while it has enough adjustments in different modes to satisfy the creative side. The video capability in a really nice feature, especially with the zoom and stabilization. I'm glad I bought it!!", "Date": "January 5, 2012"}, {"Title": "DMC-FZ35 at 18x has better glass / image quality", "Author": "MysticJaguar", "ReviewID": "RKX8VVMABH2QT", "Overall": "4.0", "Content": "The DMC-FZ47 is a really nice camera.  I also have a DMC-FZ35 and was looking for a gift for someone. I got the DMC-FZ47 one evening in August 2012 when the price dropped to $199.99 for a few hours.  I figured I'd keep the better camera.  ;-)From some testing I can say this:- Image sensor quality: Winner DMC-FZ47- Menu system: Winner DMC-FZ47- Photo features (like miniature mode, etc.) : Winner DMC-FZ47- Low light handling/image quality : Winner DMC-FZ47- Color rendition : Winner DMC-FZ35 (better color saturation)- Optical quality (sharpness) : Winner DMC-FZ35If Panasonic and other camera makers would give up this really bad idea of a zoom race, and scale things back to 18x, then the DMC-FZ47 would be a stellar camera in every regard.  But the lens on this camera, at 24x, is giving just too much lack of clarity.  It's like the DMC-FZ47 images are a bit fuzzy optically compared to the DMC-FZ35.  But most users will not notice the difference.  Either way, they are both great cameras.And yes, I am keeping the DMC-FZ35.", "Date": "September 9, 2012"}, {"Title": "Wow!", "Author": "Monkeysee", "ReviewID": "R3J9QP6GQUMBBB", "Overall": "5.0", "Content": "This is an awsome camera! Its easy to use and you can even customize some of the settings. Great camera for someone who wants more than a point and shoot but isn't ready for, or doesn't want to spend the money on a dslr. This one is perfect for me!", "Date": "January 14, 2012"}, {"Title": "Fantastic camera for my (amateur)  needs", "Author": "golfdaddy1961", "ReviewID": "R2B12OIO8RN156", "Overall": "4.0", "Content": "In November, 2011 , I bought this camera in anticipation of the two-week cruise tour we would take in Alaska in July,2012. Before leaving,I bought an extra battery to ensure I wouldn't miss a single shot, and I didn't. The first week of the trip I averaged 400 shots a day. I got good clear photos of Denali (Mt.  McKinley) from 55-60 miles away that rivaled the quality of one fellow-traveler's so-big-he-had-to-wear-a-harness-to-carry-it camera. Let me be clear on this: he was a far more experienced photographer, but I was able to get several shots that he wasn't for to the compact size and ease-of-use of the FZ47K. The 2nd week of the trip, I slowed down to 200-300 photos/day. I've missed a few shots, but they were my fault, not the camera's.  I would not hesitate to buy another FZ47K.", "Date": "December 8, 2013"}, {"Title": "Great for it's price.", "Author": "avri", "ReviewID": "R21D5ETKP6IDB2", "Overall": "5.0", "Content": "I've recorded my films and web shows as well as taken photography with this camera. It's great to have if you are like-minded and don't have loads of cash. This will at least give you great results and satisfy you for some years until you are ready to get your next big camera!!! Highly recommended!", "Date": "November 23, 2013"}, {"Title": "One tough camera", "Author": "JoeUtica", "ReviewID": "RCG39UKBIGP0D", "Overall": "4.0", "Content": "Distracted as I was getting into my car, I set the camera on the roof, then forgot it. I jammed out of the parting lot 200 yards ahead of a semi coming at 50 mph, and was horrified to see my Lumix bouncing on the concrete in my rear view mirror. The big rig slowed to a stop as my son ran back and retrieved the camera, expecting to find it in pieces. That was 16 months and thousands of shots ago, so I can say with certainty that the camera was undamaged! There are  better cameras, but maybe not for the money, and I can pretty well guarantee you there aren't any other cameras this hard to kill.", "Date": "October 24, 2013"}, {"Title": "Great Camera", "Author": "Andrew K.", "ReviewID": "R2SOBRX5PSICOI", "Overall": "5.0", "Content": "We got this camera for a digital photography class I teach. It is a great camera for what we needed. The LCD screen is clear and crisp and the camera does exactly what we needed it to do.", "Date": "October 2, 2013"}, {"Title": "Takes nice pictures, wish it had a paper instruction book.", "Author": "LabradorArt", "ReviewID": "R2TV6G6TVZA4KP", "Overall": "4.0", "Content": "I still barely know how to use mine. It takes nice photos on automatic mode and I have played a little with some others, but have not had time to sit on the computer and go through the cd manual.  Wish it had a better paper instruction book that I could keep in my camera case for on-the-spot reference like I did with my old one.  Otherwise, so far it meets all of my needs, which is mostly taking photos of my art for prints and ads, and fun photos of landscapes, flowers and dogs or reference photos for paintings.  I am glad I didn't end up with the slr I thought I wanted before I discovered this.  This camera is great with less fiddling and less expense.", "Date": "August 10, 2013"}, {"Title": "Durable, great photos", "Author": "AppalachianWino", "ReviewID": "R2FQ3091ORZRL0", "Overall": "5.0", "Content": "I've been using this camera for quite a while now and am always pleased with the features, quality of photos, and durability of it.  It's a tough machine.  Great lens, and the outcome is usually fantastic.  Lots of settings to master if you're so inclined, but the auto feature works fairly well on its own.", "Date": "June 20, 2013"}, {"Title": "Very good point & shoot with video", "Author": "Sean R. Mclean", "ReviewID": "R24UMQHESA4BCO", "Overall": "3.0", "Content": "There are positives and negatives for this camera. I'll start with the positives:* It is a good value -- you get a lot of features for the price.* The presets are usually pretty good for what you are trying to shoot, even if you are a beginner. For example there is a \"fireworks\" setting. And it's not bad.* the lens is *really good*.* the zoom is surprisingly good* the manual mode -- let me go on about the manual mode. I can do a lot of creative things with manual mode that aren't possible in automatic.* video -- and it's pretty good.* nice aperture possibilities.* built in flash works pretty well + red-eye reduction. Not bad at all.* very good battery life* hummingbird lightThe downsides:* jpeg only. Sorry, no RAW here. But for most people that's perfect, so is it a negative? For me yes. For just about everybody else, not even a little.* images suffer at ISO greater than say 400. Things get noisy fast with obvious JPEG artifacts. Best quality is going to be between 100 & 200 ISO.* the automatic settings have a lot of problems for me** images have a weird ratio** typically over exposes -- and with JPEG that's a bad, bad thing.Don't go thinking it's a pro-quality camera, it's not. But for taking good pictures of the family on your next vacation or outing -- yeah it's pretty darned good.", "Date": "May 21, 2013"}, {"Title": "Panasonic FZ47", "Author": "Henry T. Williams", "ReviewID": "R31PI8C0CGO4N3", "Overall": "5.0", "Content": "I tried a couple of smaller cameras and they fail to compare to the Panasonic FZ47. The zoom, size, speed and picture quality are terrific. There are alot of features and settings that I haven't tried yet but so far I'm very happy. I got a great deal thru Amazon from a company in Nevada, was sent PDQ and in excellent shape. WHAT EVER YOU DO, DON'T BUY FROM AJRICHIES, THEY WILL FIND SOME WAY TO ROB YOU ! Even if there's a price difference, doing business with Amazon is so reassuring, from sales, service, and a customer support that wants to take care of you. I'll be back when I move up to a larger camera and for anything else that I need, Take care.", "Date": "April 30, 2013"}, {"Title": "Bought this camera AGAIN", "Author": "Trek Alpha", "ReviewID": "RN8C4NHCJ2F6B", "Overall": "5.0", "Content": "This is the second camera we have purchased. Simply put, it has GREAT ZOOM for the price and you dont have to swap out lenses. We took this with us to Scotland, and it was compact enough, but could take EXCELLENT picutures.Bought the same camera for a family member and we hope it will outlast (as it should) all the $100 cameras she has purchased in the past. For those of you that think its expensive - you put your money towards something that is reliable and little more, but it should last you many more years. Also, this has been rated in Consumer Reports to have outstanding battery life. Another big thorn in the side on all the cheap cameras....why do you think they are so cheap. Again, buy something ONCE, put a little more money towards it, and you won't regret it. It will take SD cards, so you have unlimited space as long as you bring along a few SD cards. We were able to recharge the batteries and keep shooting - but that was after a full day of taking pictures. Great camera!", "Date": "April 4, 2013"}, {"Title": "Easy to use, great photos", "Author": "Steph in Texas", "ReviewID": "RRIOZM809DC7I", "Overall": "5.0", "Content": "I like the size of this camera because it's much easier for me to hold steady than smaller ones. It has lots of features and it's easy to upload photos to my computer.", "Date": "April 1, 2013"}, {"Title": "Good camera", "Author": "Albs", "ReviewID": "RBKV1G176AI1M", "Overall": "5.0", "Content": "We are so glad we bought this camera.  I didn't want to have to sit down and read a long manual to figure out a nice camera, and this has been fairly intuitive.  It is great to have an option for video.  I wanted a camera that was fast and could capture active kids, and this fits the bill.  I have been amazed to see the difference in picture quality when compared to our old camera.", "Date": "March 8, 2013"}, {"Title": "Nice camera", "Author": "FLYERS FAN", "ReviewID": "R2X95V03TQOPM7", "Overall": "5.0", "Content": "I bought this camera for my son as a gift. He loved it and its so easy to operate and takes fabulous pictures. Wish I would have waited and bought this for myself. Would definitely recommend this camera. Now my son researched this camera and told me what to buy, but he was happy with the results.", "Date": "February 15, 2013"}, {"Title": "Hard to Not Like this Camera", "Author": "Scooter74", "ReviewID": "R8PFE1ABWU4CM", "Overall": "4.0", "Content": "We wanted a camera simple to use but high zoom and the option for more sophisticated controls if needed or desired.  This fits the bill.Last camera was an Olympus 700 10x Optical Zoom was purchased in 2001 and it's clear that this is a great replacement for that camera.Nice to be able to reach out and snag that close up without approaching the subject too much.And nice to be able to take a video as long as I want and still zoom while taking the video.Yeah I know that these last features aren't new but when you hang on to things long enough you really enjoy the changes that take place over 10-12 years time.", "Date": "January 18, 2013"}, {"Title": "Meets all expectations.", "Author": "Busy Mom", "ReviewID": "R1NKWMXZX7G71S", "Overall": "5.0", "Content": "Bought this to replace an older model. Very happy with all the features. Works just like the old one, just wished the battery pack was the same size.", "Date": "January 15, 2013"}, {"Title": "Worth the money... nice camera if you don't want to spend 750", "Author": "N. Fernandez", "ReviewID": "R3I63NDJ2KJ103", "Overall": "5.0", "Content": "I've had this camera about a year. The zoom works fantastic and the shots are clear and rich. I don't use the more advanced settings much but the intelligent auto is quite sufficient. The sports setting takes action shots without blur. Highly recommend for the $.", "Date": "January 8, 2013"}, {"Title": "Loved it so much we bought a second one !", "Author": "Scifi Fan", "ReviewID": "R34MNC2EHQCM1C", "Overall": "4.0", "Content": "My dad used his last LUMIX constantly, and when it finally died he wanted another one. He takes it on vacation, cross country bike rides, hikes, etc and it performs beautifully!", "Date": "January 4, 2013"}, {"Title": "Love this camer", "Author": "Pccheflynn", "ReviewID": "R253898EH2FDQR", "Overall": "5.0", "Content": "This was a gift for my husband.  It is easy to use and takes awesome pictures.  He especially enjoys the great zoom!", "Date": "January 2, 2013"}, {"Title": "Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera with 24xOptical Zoom - Quite good for the price", "Author": "rhythm7a", "ReviewID": "RHZFQ67RKDCYN", "Overall": "5.0", "Content": "I've been a lifelong photographer (I've been paid and published but I don't consider myself a professional) and I'm quite happy with this camera. It's much more versatile than a point and shoot and the color quality has been very good. If anything, it has a lot of options which can be a bit daunting (188 page PDF manual), but you can also use basic settings for easier, faster use. I wanted a versatile higher quality camera with a decent zoom range that also shoots HD video but is not too bulky, fairly easy to carry around and doesn't require extra lenses. This fits my needs very well. I highly recommend getting a high quality circular polarizing filter (I got a cheap one and was disappointed) and an extra battery.", "Date": "January 2, 2013"}, {"Title": "Well worth it", "Author": "CR", "ReviewID": "R2RE2KMQXAR3EG", "Overall": "5.0", "Content": "This is one mighty impressive camera. I bought it for my wife for Christmas. She loves it and I have used it a bit and am quite pleased with it. Powerful zoom, quick auto-focus, brilliant pictures - what more could you ask for?", "Date": "December 27, 2012"}, {"Title": "Love this camera", "Author": "dana holden", "ReviewID": "R2W2THOFWDBWAL", "Overall": "5.0", "Content": "Takes clear and beautiful photosabsolutely fits my needsGreat camera for the price! I'm an amateur photographer and my photos look amazing", "Date": "December 25, 2012"}, {"Title": "Great quality for the price.", "Author": "C. Griffin \"Dougcrys\"", "ReviewID": "RDEGEJN6N6N8L", "Overall": "4.0", "Content": "Love the features with this camera (have not learned them all yet).  The only feature I don't like is that the lens cap is so chealy made and is awkard to use so I end up just leaving off.", "Date": "December 13, 2012"}, {"Title": "Camera not for an amateur", "Author": "Mo", "ReviewID": "R3F9FGK8B1T6NG", "Overall": "2.0", "Content": "I purchased this camera after looking at Consumer Reports.  I have always been a Canon user because of it's ease and simplicity and producing great shots.  Took a chance on the Lumix DMC-FZ47.  Big mistake.  The instructions are complicated and the pictures are not that great.  I don't want to have to take a class to learn how to use my camera.  Since I love to take photos and am amateur, I am going back to what I know....Canon.  Never had a problem with Canon.  Point and shoot even with the high end models.  Also, I can't seem to download to my PC movies I took with the Lumix.  Maybe it's my computer but no problem downloading Canon photos and movies.  I will be placing an ad to sell the Lumix asap and go back to the reliable Canon.  An expensive lesson!", "Date": "December 10, 2012"}, {"Title": "Very pleased!", "Author": "Elkat", "ReviewID": "R27ECSKEFMYKHJ", "Overall": "4.0", "Content": "I almost love this camera.  It is a great camera and takes beautiful pictures and videos!  I love being able to take just one camera to places and get pictures and video at the same time.  It's pretty quick to start up and snaps photos fast.  However, it does not do good in low light, even with the flash on.  Sometimes in my house, it takes several seconds to take a picture and the picture is grainy looking.  Sometimes it does better, but I never get a great picture in my house.  I know nothing about camera settings and leave it in auto, which I know doesn't help.  Outdoor or well light pictures are beautiful!  The only other thing I don't like if the software it comes with.  It won't even keep up with what pictures you've already transferred, so every time you load you have to go through clicking each picture you want.  I'm still pleased with this purchase, though, its much better and faster than my previous camera.", "Date": "December 9, 2012"}, {"Title": "Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera with 24xOptical Zoom..", "Author": "LLM \"Missouri  Lars\"", "ReviewID": "R1PL5LD3CX34PP", "Overall": "5.0", "Content": "Very satisfied with the ability of camera to function as needed. Bought this to replace older Lumix camera which had become outdated and I wanted to increase zoom and megapixels. Picture lag time was eliminated and this camera also has greater ability to capture low light situations where older camera could not. The battery life has also been improved over previous camera.I researched cameras for several weeks to compare the different models and makes and just felt most comfortable staying with the panasonic lumix line .", "Date": "December 8, 2012"}, {"Title": "Great camera at a great price", "Author": "T. Povar", "ReviewID": "R27CUFI4R97ELE", "Overall": "5.0", "Content": "While this model is now discontinued, I understand it is still available. Highly recommend it. This is my third Lumx FZ camera, and each model improves upon the last.  Auto mode, which I use most, does an outstanding job without the hassle.", "Date": "December 3, 2012"}, {"Title": "In love...", "Author": "Peretz34 \"Ginnie\"", "ReviewID": "RF4UDORQMA9HT", "Overall": "5.0", "Content": "I bought a Lumix after seeing the photos that my friend has taken with her lower-spec model - sensational. So far, I've only used it on the auto setting - I'm a busy mother with ambitions of learning to use it to its full effect over time - and the pictures and video have been of a very high standard. I wanted a bridge camera before going onto a digital SLR so I could learn the ropes while still being able to take quality photos, and I think this is absolutely it. Battery life is good and the zoom range is making me delirious with delight after point and shoots. Got it at a reduced price and so far, worth every cent.", "Date": "November 25, 2012"}, {"Title": "Birders Should Buy it.", "Author": "Randall Allen \"Sierra Biker\"", "ReviewID": "RT6X3TKG594OP", "Overall": "5.0", "Content": "This is an excellent litle camera that weighs about a pound.  Every casual birder should get one.  You can really zoom birds in from way far out there, for identification for one thing, or to print when the quality is nice.  I think the zoom power is equivalent to a 600mm lens, very powerful.  Obviously, it's not a digital SLR, but it's pretty good for the price.  And it's easier to bring along, don't need a case, no paranoia about someone stealing it.  Hey, it's $269 out the door, with a Leica lens, not bad.  It's easy to use for all the family pics too, movies, the whole works.  Almost like a cell phone.  It's the camera you have with you, a very practical bring along camera, light-weight with decent quality, unless you're a real purist.  Get some light weight binocs and you're really set, the Pentax zoom works great for me, about a $100.", "Date": "November 23, 2012"}, {"Title": "Lumix FZ47K Camera", "Author": "windridr", "ReviewID": "R287DRRSIASNC2", "Overall": "5.0", "Content": "Great camera and after I purchased it I found out it was the highest rated in its grouping in Consumer Reports.  Would buy it again.", "Date": "August 13, 2012"}, {"Title": "Should strap comes with it", "Author": "Customer", "ReviewID": "R1JUBG4QFPN2YU", "Overall": "4.0", "Content": "On the reviews I didn't see anywhere that stated the features such as a shoulder strap. This was a gift for my daughter so I wanted it to be just right. I searched amazon and bought a nice strap.  The camera arrived and there was a very nice strap inside. Great, not wanting to pay shipping to return it as it was more than the item we kept it.  AMAZON you could have saved us the purchase by writing a proper review of the item...disappointed, but it's the first time with you all. Bought a Sumac Life case, look at the measurements first before ordering to make sure it will fit. I guess now I'll double check amazon's information.", "Date": "February 27, 2013"}, {"Title": "Disappointed.  I returned the camera", "Author": "Chip O", "ReviewID": "R8QAFF11DNCAL", "Overall": "2.0", "Content": "I do not purchase anything without careful thought and I rarely return any item.  This camera deserved to be returned.  Maybe not from your perspective, but for my reasons in selecting this camera in the first place.I wanted a camera beyond a point and shoot, yet not a professional camera.  I wanted controls, a viewfinder and a quality picture.  I wanted a camera with no delay between pressing the shutter release and the instant the picture was recorded.Caution is always the word here.  The results could be user error and all my fault.  The right tool in the wrong hands is often the problem.  Yet, I know a lot about photography.  After taking dozens of test shots, here's why I returned it,Professionally processed pictures are grainy, even with control of the ISO settings and lighting.  Focus is not consistent.  Taking the exact same shot with the exact same settings within seconds of each other produces different results.  The delay of the shutter speed means losing the moment in taking any picture.  Skin tones are pasty.  Automatic white balance doesn't seem to be automatic.  There is more to say, but you get the \"picture\".This camera may be perfect for the person that is used to point and shoot quality, but then I would recommend a point and shoot.  My wife has a Panasonic Lumix DMC ZS1.  It's a point and shoot that was purchased several years ago when it first came on the market.  The new Panasonic Lumix DMC FZ47K takes a lessor quality and inconsistent picture then her point and shoot.", "Date": "December 27, 2012"}, {"Title": "fuzzy, noise.. distance and near", "Author": "LA in N.C. \"LA\"", "ReviewID": "R8SZ24G4Y0W4L", "Overall": "1.0", "Content": "I should not believe reviews, and yet I'm writing one. This is the worst camera. Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera with 24xOptical Zoom. I have owned many cameras from small pocket size to high end models. This camera was very bad image quality, macro and distance and ultra zoom especially. I tried it on flowers, a bird well..every shot I've taken before. BAD. Any print made from camera must look awful when enlarged. So back it goes and the search goes on.", "Date": "September 12, 2012"}, {"Title": "Expectations Exceeded", "Author": "cbreitigan", "ReviewID": "R1P0LKVCGGGXN9", "Overall": "5.0", "Content": "This is my first DSLR Camera, so I'm a little new to the market, but this was affordable for my budget and I have come to love it more with every picture. I've captured some really great images and have been discovering a true love for photography. Highly recommended.", "Date": "March 21, 2012"}, {"Title": "Almost what i expected. Here's why", "Author": "W. freeman", "ReviewID": "R1ZW1UIQANL283", "Overall": "3.0", "Content": "Even if Panasonic don't sell much in stores, they are still a very top reliable brand. I have products that range from the 30 years old to 10 years old, and all are still running strong. So i got it more for that than anything. The Lumix however always rates high in Consumers Report, right under Canon and Nikon for Cameras. And i also got this one because of the discounted price and the sample photo's. Which you can get if your lucky and know what your doing. Don't expect \"most\" photo's to look like the samples without a bit of tweaking. Here are the good and bad things about the camera.Pros1.Nice look, decent build quality.2.Fast shutter speed (depending on what setting your using).3.Tons of options, literally more menu features than i've ever seen.4.Good camera for beginners or pros, with the ability for lots of manual adjustments.5.Lithium Cell battery, with a small charger included. Some say you can get nearly 48 hours on one charge, we'll see.6.Great sound on video.7.Pictures thus far indoors look good, \"not great\". Haven't done outdoors yet, although i've been told this is where the camera shines.Cons1.Impossible even with image blur stability to get a good unblurred low light shot. Even if you use the self-timer.2.Inside shots don't even look that great \"with\" the flash enabled. Lots of noise, on most settings.3.Full 1080p HD Video, or 720 HD is a gimmick, looks no where near it. Even in bright light. Outside? We'll see.4.Camera feel isn't nearly as solid as i had hoped, and the way you pop open the bottom to insert the battery pops. And feels very cheap.5.Easy menu navigation, although it may look confusing. The con is the buttons are laid out a bit oddly. And they are tiny.6.Not so great view finder.7.Turn dial settings can be a bit confusing, to many on the dial itself.Other than that i'm happy to have the camera, i just need to play with it a little more to get the feel and quality pictures that i see. At least i hope i do. So far it's just your average point and shoot, not as stellar (yet) as i had hoped. Give me about a week and i'll decide. On another note ordering from Amazon, and getting it from Goodies was awesome. It shipped out (expedited) 2 day. Left on Friday the 16th, and i got it this morning Monday the 19th, so kudos to those two establishments. So after i toy with it a while i hope it's as good as i expect. If not oh well, at least it's a \"good\" camera. Even though i still think Canon has the best picture quality. (So far)", "Date": "December 19, 2011"}, {"Title": "Love the zoom, not so much the image quality", "Author": "Paul Huang", "ReviewID": "R3I3RV681KTRAH", "Overall": "4.0", "Content": "Having had 2 DSLR's (Canon 10D and 20D), I had been 'spoiled' with DSLR's image quality.  So I guess it shouldn't have come as such a big surprise that the FZ47's image quality could not measure up (even against the old old Canon 10D).  But that's not a fair comparison I suppose (point-n-shoot vs DSLR) even though it is 2011 already!  Anyway, I've only had the FZ47 for a week so not all of the jurors have come back, but overall, I'm fairly satisfied with the camera except for the image quality thingy.  Again though, to be fair, I'm comparing it to DSLR's, so against other point-n-shoots, it's probably decent.  In fact, I have a ZS-7 (Panasonic as well) and I'd say the ZS-7's image is slightly better than that of FZ47.  The FZ47's images are fine for web and probably small prints, but I would not print them any bigger than say 5x7 or 8x10.  They lack the crispness (details are a little fuzzy) that I would've expected from a camera of this class.It was the first time I had a camera with this kind of zoom, so that was definitely refreshing.  The camera started up fairly quickly and going from one shot to the next was acceptably fast (for a point-n-shoot).  Low-light pictures were not that great IMO, the sensor was too susceptible to tiny hand unsteadiness, much more so than other cameras I've had.  Perhaps this'll get better once I've gotten used to the form factor. The camera is surprisingly light but you should definitely use two hands to get better shots.  I might return it if I find that image quality isn't improvable via some settings (there's no pic quality options, just different image sizes) or best-practices.  I've only used the iAuto mode so far.Update 12/14/2011 - I returned the camera after several weeks and using other modes to try to get better quality photos. I just found the quality of the pics really unacceptable, even compared to say a ZS7.  Maybe the unit I got was defective but I'm really surprised everyone else has been giving 5 stars so far.  The huge drop in price ($399) should give a clue, however.  Even with newer models and advancing technologies, a product's price simply drop by almost a half in just a few months unless it's deemed inferior by the market.", "Date": "September 6, 2011"}, {"Title": "love it!", "Author": "Stephanie J. Flaten \"locoinOK\"", "ReviewID": "R2VVC4IC0O7EEW", "Overall": "4.0", "Content": "I Love this camera; very easy to use and the pictures are high quality! Even when subject is in motion!", "Date": "August 9, 2012"}, {"Title": "Panasonic Lumix DMA-FZ47K 12.1 MP", "Author": "carlos sanz", "ReviewID": "R1LY8DLRNX7FWP", "Overall": "5.0", "Content": "Wonderful! I received in perfect conditions!!! I think that it was the best buy that I made this year, I enjoy it a lot!!!", "Date": "August 8, 2012"}, {"Title": "predatory pop-ups", "Author": "charlie", "ReviewID": "R305JB12CASZPP", "Overall": "1.0", "Content": "I am fed up with advertising pop-ups hijacking my web page, especially with no option to x out. I tried to call the company and complain but they make that nearly impossible as well, so I decided to complain here. I wont buy Panosonic because of their predatory pop-ups.", "Date": "December 7, 2012"}, {"Title": "Avoid, there are better choices", "Author": "Michael B. Sonneberg", "ReviewID": "R3NAE1SJJPF6LT", "Overall": "1.0", "Content": "Focus is inaccurate, exposure poor. Size and weight are ok, but pictures taken in full auto are hit and miss and focus is soft. The lens may say Leica but I can assure you, this is no Leica glass.Pass on this one.", "Date": "December 30, 2011"}], "ProductInfo": {"Price": "$399.00", "Features": "3D Still Image Capture\niA (Intelligent Auto) Mode Makes Every Photo Blur-less\nFull HD Video Recording - AVCHD (MPEG-4/H.264) Format\nLEICA 24X High Quality Power O.I.S. Optics (25-600mm)\n12.1 Megapixel Hi-Speed CCD", "Name": "Panasonic Lumix DMC-FZ47K 12.1 MP Digital Camera with 24xOptical Zoom - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41uv-qNtroL._SX300_.jpg", "ProductID": "B005F25IL4"}}