{"Reviews": [{"Title": "Very good customer service", "Author": "Dakota", "ReviewID": "R3FRA12Q8SGP0H", "Overall": "5.0", "Content": "The customer service is very good with this company the first camera I received did not work then they sent me a new one for no hassle. But the camera is very good for the money it has color and sound that works better then my expensive system I Alderney had.", "Date": "October 24, 2011"}, {"Title": "Just ordinary cam", "Author": "HMH \"hmichael0330\"", "ReviewID": "R34IHH53YFFUWJ", "Overall": "3.0", "Content": "I would give this cam 4 stars if the night vision worked.  It's  so, so in broad day light.  This is not a cam to buy to watch anything important. because the resolution sucks and I told the seller that already.", "Date": "November 20, 2012"}, {"Title": "Durable", "Author": "Howie", "ReviewID": "RYBEG3ATDIB4B", "Overall": "5.0", "Content": "For such an inexpensive camera, it's very tough outdoors. I live in the desert southwest where this camera has been exposed to direct sun light and 118 degrees in summer and then was hit by monsoon thunderstorms and did not even flicker. Very sharp picture and audio even at night. More reliable than my $100 wireless camera. I bought four more.", "Date": "September 15, 2012"}, {"Title": "No Night Vision", "Author": "Block", "ReviewID": "RK0ZKO11U5WWS", "Overall": "2.0", "Content": "There are a few cameras out there like this that have the IR's in place but don't work. Make sure when your looking forone with night vision, it states it. The company was great with a return and ordered what I needed.", "Date": "October 27, 2013"}, {"Title": "Good for the price", "Author": "sean ueda", "ReviewID": "R1RS7AZIIYXFAE", "Overall": "3.0", "Content": "First product was damaged, they sent a replacement right away when I contacted them, but it took a while. Takes some knowledge to set up but picture resolution is good.", "Date": "July 25, 2013"}, {"Title": "ntsc?  no  only works in pal", "Author": "michael", "ReviewID": "R11UKZNADPVWKC", "Overall": "1.0", "Content": "these are jittery pictured and only provide color in pal when hooked up to the system causes other cameras to act in the samne manner they are made nicely but performance wise sux", "Date": "March 25, 2013"}, {"Title": "Nice Spy Camera", "Author": "Ragman", "ReviewID": "R16MAXZK488DM4", "Overall": "5.0", "Content": "I use this camera to see if any cats are in the outside shelter. It does get pretty warm when it's working and I guess that's normal but a little extra heat in the shelter is a plus.  Tiny little camera does a good job for me.", "Date": "January 31, 2013"}, {"Title": "I think it's a PAL cam, or it's just broken.", "Author": "Craig Lewis (aka barefootinbiker)", "ReviewID": "R1T4WFJOE87E7I", "Overall": "1.0", "Content": "PAL system? I didn't bother to send it back cuz it was just too cheap to spend any time trying to replace it, and there are NO useful specs with it, so this review is not a slam on the seller, Just doesn't sync up properly. It is well-made, and even though it's monochrome, it would be a nice porch viewer if it were operational, but I just got a larger color cam instead.", "Date": "December 21, 2012"}, {"Title": "very good", "Author": "rag", "ReviewID": "R3B5D04R1HH1E7", "Overall": "5.0", "Content": "for the price we cant go wrong with this.i had hard time figuring out how to start it.red cable is power cable.need adaptor.works really good.night vision is awesome.", "Date": "December 14, 2012"}, {"Title": "I Recommend This Item!!", "Author": "pablo luperon", "ReviewID": "R2DRMHDGKW624E", "Overall": "4.0", "Content": "This was a perfect choice for a camera.  This has a night vision, Infared leD. Only promblem is its not waterproof...", "Date": "November 17, 2012"}, {"Title": "don't know how it records", "Author": "ele", "ReviewID": "R3A2VB02D8L9X4", "Overall": "1.0", "Content": "Bought it with no instructions, easy to install but then what? When I turn it on it just shows the picture that's it. I want it yo record when I'm not home to see if anyone messes with my things. Please help me use it.", "Date": "July 7, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "*  Mini Wired NTSC Security Color Video Camera.  with LCD light\n*  Photographing Device: 1/4 video sensor.\n*  System: NTSC/EIA.\n*  Image Area: 4.69*3.45.\n*  Resolution: 380lines.", "Name": "Spy Mini Wired NTSC Security Color Video Camera W/ LED", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZGVhX6yhL._SY300_.jpg", "ProductID": "B0055QKBJE"}}