{"Reviews": [{"Title": "buyer beware, 300mm zoom lens is not an IS model", "Author": "Wade Lee", "ReviewID": "R3PLF2AVIR9T2I", "Overall": "2.0", "Content": "Everything as described but..... here comes the but, the 300mm zoom lens does not have IS, it's useless unless you carry a tripod at all time. buyer beware.", "Date": "December 2, 2012"}, {"Title": "great product, great company to buy from", "Author": "mister b", "ReviewID": "R3MC2A17XG27UP", "Overall": "5.0", "Content": "Just wanted to start out buy saying that the canon eos 60d is and awsome camera and has all the features that you want and need in a camera. Purchasing the kit was a great buy as well. I could not have found a better deal for the money.After reading other reviews i was actually pleased with the carry bag and the tri pod is not so bad for starters but you will want to up grade eventually.The seller was more than helpful, they replied to all e mails right away and i even got my camera in three days.`I will be ordering again from them...", "Date": "June 21, 2012"}, {"Title": "Accessories are below average", "Author": "Keff Carter", "ReviewID": "R1YJBJF3R5YJTD", "Overall": "2.0", "Content": "The packaging was horrible.  The camera arrived in the Canon box so it was fine but all the other add-on accessories were just thrown into a bigger box.  The accessories, which were not listed by brand, are very inexpensive and not really what you would want to use with a camera of this caliber.  Strongly recommend customers just by the Canon 60D and buy other items separately so you can get quality accessories to go with this GREAT camera.", "Date": "December 13, 2012"}, {"Title": "Great deal!!!", "Author": "Sourelly", "ReviewID": "RGZN2BLVDP4GB", "Overall": "5.0", "Content": "I am satisfied with my purchase. I feel it was a great deal. The seller sent me everything that was promised and advertised. The only thing I didn't like was the case. It wasn't a good quality case. But even though I didn't like the case, the whole package is a great deal.", "Date": "March 25, 2012"}, {"Title": "GOOD BUY!!!", "Author": "CMN", "ReviewID": "R2RN9L40MGFWMK", "Overall": "5.0", "Content": "Delivery was relatively fast. Items are as listed in the description. 60D is an EXCELLENT camera for pre-professional photo takings. The lens is perfect for beginners' needs. Portrait photos with the 75-300mm lens are simply beautiful. I'm happy with the overall quality of the bundle. However, the tripod is not one with good quality though. and the Starter Kit with screen protectors and a little mini tripod has shockingly annoying chemical smell that I doubt would be carcinogenic. Other than that, bundle price is very reasonable. I would recommend it!!! :)", "Date": "September 13, 2012"}, {"Title": "Great Camera", "Author": "nick rumke", "ReviewID": "R3OS7XSJLF15H4", "Overall": "5.0", "Content": "I am a teen, therefore i dont have the most money, but I figured I didnt want a point and shoot and I settled for this and could not be happier, great quality and a great package deal!", "Date": "November 1, 2013"}, {"Title": "Love it! I recommend it to everyone!", "Author": "Estefana92", "ReviewID": "R1QWX364COXB6G", "Overall": "5.0", "Content": "Great product! I recently entered the professional world of photography so I needed a good jump start on it. I'm glad I got this and the seller was fantastic! I had the whole package and I am still using everything up to this day! For the exception of the bag. It didn't last very long but it helped me safe guard my camera & equipment for a while until I could find something better. If you or someone you know is looking for a good camera, then get this package! You won't regret it!", "Date": "September 15, 2013"}, {"Title": "Great PRESENT", "Author": "19MJG63", "ReviewID": "R31J1NL17Z0163", "Overall": "5.0", "Content": "bOUGHT FOR A FRIEND AND HE ABSOLUTELY LOVES THE PACKAGE.  bOUGHT THE INSURANCE WITH IT ALSO.  iT WAS A MUST ADD IN", "Date": "September 1, 2013"}, {"Title": "What a difference a camera makes!", "Author": "Ashley Mccarren", "ReviewID": "R1TY1YJ979G6C0", "Overall": "5.0", "Content": "I can't wait until I get more familiar with this beauty! I've become complacent with my photography the last couple of years with the point & shoot digital photos. . . not so creative.Since I purchased this, I've re-awakened the creative eyeWhat a great piece of equipment! Excellent service from the seller too!", "Date": "June 11, 2013"}, {"Title": "Dont get the package.", "Author": "Paul K", "ReviewID": "R1W18UAN65RONT", "Overall": "4.0", "Content": "The camera  is the bomb...  the rest of the stuff is junk.  Bag too small to darry all your gear, tripod is weak and fell apart on the first use.", "Date": "May 31, 2013"}, {"Title": "NIce Bundle, BUT....", "Author": "c", "ReviewID": "R2MU1I5B4E9RSM", "Overall": "4.0", "Content": "I have and use a 35mm SLR.I wanted to try a DSLR. This camera is perfect because I do more semi-pro work than amatuer shots, and was looking for a very good reasonably priced camera.This is it.BUT....One thing with the bundle though, the \"DELUXE\" bag isn't!!!!.You can barely fit the camera with the 55mm lens in it, with not much room for anything else. This bundle should come with a bag large enough (about 5x larger than supplied) to fit everything you need for a day of photos.", "Date": "May 23, 2013"}, {"Title": "This is a great deal", "Author": "Hsing-Shu Yang", "ReviewID": "R3BJBGZY72EOFS", "Overall": "5.0", "Content": "Love, Love, LOVE this set.  I was going to get the same camera from Costco because it was on-sale for about the same price. However, this set includes a lot more stuff....I thought I was getting some unknown knock-off brands accessories, but I actually heard some of them are good.  I love those accessories. such a great deal.", "Date": "May 14, 2013"}, {"Title": "Perfect", "Author": "Salvador Ruiz Carranza", "ReviewID": "R11EGTAVN0DNQK", "Overall": "5.0", "Content": "Everything was excellent, thank you! Arrive time, product in perfect conditions. The SD card memory is a micro SD card but it comes with an adapter for the SD card, so you would have no problem.", "Date": "April 30, 2013"}, {"Title": "Canon EOS 60D package", "Author": "Raul Castro P", "ReviewID": "R1ODP1XJZGZ94A", "Overall": "4.0", "Content": "Really grate camera with good equipment for a very reasonable price.There where only a few things I dislike on this purchase:1: it comes with 2 batterys but they are chineese, I would like to have ONE Canon battery insted and,2: the sensor was dirty and the pictures came out with dots on it, i've had to take it right away to a CAnon services shop for cleaning.", "Date": "April 22, 2013"}, {"Title": "Great product", "Author": "Tammy", "ReviewID": "R2TRJAI7VWXJ0I", "Overall": "5.0", "Content": "I love this upgrade from my old canon 450d.  There is nothing I don't like about the camera. And would recommend to everyone.", "Date": "April 21, 2013"}, {"Title": "Satisfied", "Author": "Harish Thilliyamburkrishan \"Ghost\"", "ReviewID": "R287X2B1I814DP", "Overall": "5.0", "Content": "eXCELLENT totally in love with my new camera.. include a remote with this bundle to make it the best deal..", "Date": "January 27, 2013"}, {"Title": "Great deal!", "Author": "M. Dupre \"mosartnmusic\"", "ReviewID": "R2KT0BBQ9EX1FO", "Overall": "5.0", "Content": "I have been doing photography for a few years.  This is an upgrade from a canon powershot s3 is 6mp.  I have never owned an slr.  After taking photography classes, I saved up for a few years to get this camera.  For one, this deal is great because even a refurbished body can cost $900 and that is just the body, with no lens, no nothing.  This deal is great financially, and also, it has a variety of lenses to experiment with before spending money on anything really expensive.  The bag is quality, the stand, well it does it's job, but I have a more stable, taller one I use regularly.  The specs are great.  I suggest checking out the differences between the different models to find which is right for you.  This one has a flip screen and it can record sound without video (good for musicians recording ideas while doing other things).  The only word of advice I have is if you are upgrading from a powershot type to a dslr, be aware that the dslr's are made to be geared more towards manual use, which you can get tons of practice with the powershot if you are not relying on the built in functions.  Also, the powershots have electronic view finders.  dslr's do not have this feature.  You can only look at your flip screen, but the colors will be off doing it that way.  But other than that, it is RAW and it takes great pictures, and I am still learning how to use all of its features efficiently.", "Date": "December 26, 2012"}, {"Title": "NICE", "Author": "Michael Bratt", "ReviewID": "RPSJJYSPH74UO", "Overall": "5.0", "Content": "Very well packed and it arrived earlier than the stated ship date.  I could not find it cheaper in any store.", "Date": "December 15, 2012"}, {"Title": "I love this new Canon 60D DSLR camera", "Author": "Lawrence Waldon", "ReviewID": "R2P2B501I466D4", "Overall": "5.0", "Content": "I made the jump from my Canon S2 digital point and shoot to the Canon 60D DSLR.  This old S2 was 7 years old and had given me excellent pictures for a 5.0mpx camera, and it still does. But I wanted to higher resolution for enlarging to 11x14's without loss of image quality.  I'd read review after review on the T3i, T4i, 7D, and 5D mark II... Price was a big factor and the 60D's features are pretty impressive without stepping up another $600 for the 7D or another $1000 for the 5D mark II.  I love this camera.  It'll take a long time to learn everything that it will do but the more I use it the more impressed with its features I become.  Build quality is excellent. You know you've got quality in your hand.  The image quality is absolutely stunning.  A nice side benifit I hadn't considered was the high HD quality video the camera can shoot.  So good infact I've put my Camcorder on craigslist for sale. This was a great package but were I able to to do it over again I'd have gone with the EFS 55-250mm IS lens instead of the 75-300 this kit came with.  Without IS the lens is hard to get sharp images when shooting handheld on moving subjects.  I used both lenses on a recent vacation to the Outer Banks and got some amazing shots, especially with the 18-55mm kit lens.  It is tack sharp, far superior to the S2. The AF on the 60D is amazingly fast and accurate. The Bower tripod that came with this was broken right out of the box. It's cheap and the head is made of flimsy plastic.  Frankly I'd be scared to even think about putting a $1000 camera on it.  But it can be useful sometime if I need it to support an external flash unit I suppose. I have a new Benro tripod on the way. All in all the Canon 60D is a fabulous camera.  A lot of bang for the buck.  I am very pleased with it and am not looking to upgrade. This does everything I want it to do and then some.", "Date": "December 3, 2012"}, {"Title": "Very nice kit", "Author": "K.Ardoin", "ReviewID": "R2MNYHPF7ESBZU", "Overall": "4.0", "Content": "If you are a beginner to professional video and photography than this camera is for you. The lenses do make a noise as you zoom in, but that is such a minor problem. The quality of this camera is fantastic. I suggest getting a prime lens, also on Amazon for just $100. This was a very good deal, and if you are on the fence about buying it I suggest you do.", "Date": "November 22, 2012"}, {"Title": "Unhappy customer", "Author": "Unhappy customer", "ReviewID": "R21DX7H8S0FPTK", "Overall": "1.0", "Content": "I bought the 60D from this company and have tried to contact them to upgrade to a higher end camera. They have not responded to my phone calls or emails. I wish I would have bought from Costco. I feel stuck with this camera and the low end lens it came with instead of being happy with a new camera I paid quite a bit of money for me.", "Date": "November 13, 2012"}], "ProductInfo": {"Price": "$899.98", "Features": "18MP APS-C CMOS Sensor\n1920 x 1080 HD Video Capture\nSD/SDHC/SDXC Memory Card Slot\nVari-Angle Clear View 3.0\" Flip-Out LCD\nDIGIC 4 Image Processor", "Name": "Canon EOS 60D 18 MP CMOS Digital SLR Camera with 3.0-Inch LCD and EF-S 18-55mm f/3.5-5.6 IS Lens + EF 75-300mm f/4-5.6 III Telephoto Zoom Lens 16GB Package", "ImgURL": "http://ecx.images-amazon.com/images/I/51RepQ2dIcL._SY300_.jpg", "ProductID": "B005FXXT5A"}}