{"Reviews": [{"Title": "Nothing bad to say about it really...", "Author": "PFCnicky502", "ReviewID": "R3BOZPQ803VZMB", "Overall": "5.0", "Content": "i bought this camera because it is waterproof, and there like dust proof...because im in afghanistan. The verrrry extremely fine dust that is all over everything here ended up getting in my other camera, and ruining it within 3 weeks of my arrival. But this camera has stood up to the dust and unexpected downpour here perfectly...the photo quality is as good as any point and shoot camera, water-proof or not, and by far the best waterproof!!! the Macro pictures this thing takes are amazing!! i have taken several great pictures of the strange insects all over afghanistan!! it is also great for taking pictures of the landscape here!!it may be a little more pricey than most waterproof cameras (except the overpriced olympus line) but it is by far the best, the picture quality is unbeatable...once u pick it up you will know right away that it is a solid well built camera!! while it is a little thicker than most cameras, it is also much more durable!! trust me, i have gone through many cameras throughout my military career...most of them being nikons, because i think nikons make the best stuff [= but this is by far the best in \"all terrain cameras\"", "Date": "November 6, 2011"}, {"Title": "Great Value Against Money!", "Author": "Syed Taha Ghayas \"Syed Taha Ghayas\"", "ReviewID": "R2V3ZU27YEGQKU", "Overall": "5.0", "Content": "To begin with, I would say what a deal offered by Cameta Camera. I got it delivered in Canada, still got it cheaper than what it would have cost at amazon.ca.1. To describe the camera in word word, it's a great outdoor camera. When shooting in good lighting conditions, it'll automatically set shutter speed so fast, that picture will be shot really sharp, and you'll start comparing it with a DSLR. For that matter, it's a drawback that you cannot set shutter speed manually. Coming back to the point, on the contrary, indoor or night photographs will have some blur, and more noise too. So, if you are an adventure/landscape photographer, and often shoot in daylight, you're gonna love it. It'll prove to be much better than a DSLR.2. Unlike most point n shoots, it can shoot 360-degree panoramas, a feature you'll madly get in love with. Moreover, there are plenty of shooting modes, to help you take the most appropriate shot.3. Coming to the video, it can also shoot 1080p videos, which is a great plus point. 240 frames per second videos is another option, with which you can play around, but you should know that high speed videos are shot much darker, than normal ones.4. GPS and built in compass are very nice features, so that you can geotag your outdoor images.5. In this deal, an extra battery is provided, which you'll love when you run out of battery. Tripod is like ok, not so robust, but still for the money, it's cool. Camera case is very good, and camera along with it's stripe as well as batter and/or memory card could easily be stored. Floating strap will be useful in a swimming pool, but be careful at the beach or river (moving water). HDMI cable is simply an additional nice thing. Memory card is a must, and the card provided in this deal can store more images than you'll normally require, as well as it has transfer speed, that you can shoot 1080p videos, with ease. Card reader is another addition.With so much to say, I'll conclude that I love the deal I ordered, and will recommend if you usually do outdoor/adventure photography.P.S. This camera is not an alternative to a professional DSLR camera.", "Date": "March 14, 2012"}, {"Title": "Nikon Coolpix AW100 Shock and (not) Waterproof", "Author": "Ben", "ReviewID": "RXFIVWG459RJ1", "Overall": "1.0", "Content": "OK, so I bought the Nikon AW100 camera to use in my job where I offer get wet, so I wanted a camera that could get rained on or be used for light snorkeling activities. Well, this camera is NOT it. Using the camera for the VERY first time in the water snorkeling no more than 7' deep, the camera failed. First the screen started to \"fog up\" and within two hours after being out of the water it completely stopped working and wouldn't even power up. The camera states that it is rated for 10M or 33 feet and let me say this, it is NOT. I would not recommend this camera.Regards, Ben", "Date": "June 21, 2013"}, {"Title": "Camera", "Author": "Kw", "ReviewID": "R2K1L90QF5VK42", "Overall": "5.0", "Content": "This camera takes good quality photos and is very durable. I would recommend this camera to others. It's perfect for trips.", "Date": "March 14, 2013"}, {"Title": "Great bundle", "Author": "Mary Ann Spilman", "ReviewID": "RCLF7GYDXWJOF", "Overall": "5.0", "Content": "Completely satisfied with this Camera Bundle. The camera is a great addition to my photography equipment. I had read many reviews about this particular camera before purchasing, some were good some bad. I have not had any problems and have taken it in the water with no leak. All the accessories that came with the bundle will be useful at some point. I am also glad I found this seller and now follow their sales. I will be purchasing from them again.", "Date": "February 19, 2013"}, {"Title": "Great!", "Author": "veronica", "ReviewID": "R1UCMN6IZ5TXRA", "Overall": "5.0", "Content": "The best camera for any trip: resistent, easy to use and carry, so good quality of images, good for a snorkel diving, perfect for a pool pics, ideal for a beach (sand, sea water, sutan oil, etc)back to the hotel you can wash it with soap and returns to be a new one... The video is great, better audio and quality than the expensive cameras. I drop it 2 times in volcanic rocks and it not even scratch... the kit is very useful!! So Cool!!! oh, and it arrives on time with everything packed very safe.", "Date": "October 31, 2012"}, {"Title": "Awsome camera", "Author": "Galia Ely de Mattos", "ReviewID": "R3SUHDTZ62LH00", "Overall": "5.0", "Content": "I bought this camera based on the reviews but it is better than I thought. Very good pictures, even in low lights. Great videos quality since it records in HDMI. I use it to my family trip to Walt Disney World, Fl. The very first day was raining a lot and I used the camera everywhere (even recording our ride in Everest rollercoaster under the rain). Perfect camera, I never had a better one.", "Date": "September 17, 2012"}, {"Title": "Awsume Nikon Coolpix", "Author": "Deb S.", "ReviewID": "R3A5F0922QTP1Q", "Overall": "5.0", "Content": "I am still learning about my new Nikon Coolpix.  I took a video of a baby shower and it was so easy to operate.  I was tickled at how clear the video and pictures are.  I could not be happier!  Thank you for inventing such a wonderful camra that is water proof, and has a stabilizer.  I am looking forward to learning more about this wonderful camera.", "Date": "May 4, 2012"}, {"Title": "Great Camera", "Author": "Axl", "ReviewID": "R3R12ZP7ZSGQU5", "Overall": "4.0", "Content": "This camera has lots of good functions, great under water pictures.  Price needs to go down! . . . . . . . .. . . . .", "Date": "April 22, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "KIT INCLUDES 13 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon Coolpix AW100 Shock & Waterproof GPS Digital Camera (Orange) + <2> PD-DCM Compact Camera Case + <3> Spare EN-EL12 Battery +\n<4> Transcend 16GB Class 4 SD Card + <5> Zeikos 50\" Compact Tripod + <6> PD Memory Card Storage Wallet +\n<7> PD Flexible Table Mini Tripod + <8> PD SDHC Memory Card Reader + <9> LCD Monitor Screen Protectors +\n<10> PD 5pc Complete Cleaning Kit + <11> Image Recovery Software + <12> HDMI to Mini-HDMI Cable + <13> Floating Camera Strap (Red)", "Name": "Nikon Coolpix AW100 Shock & Waterproof GPS 16.0 MP Digital Camera (Orange) with 16GB Card + Battery + Case + Tripod + Floating Strap + HDMI Cable + Cleaning Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51FqEIp2eaL._SY300_.jpg", "ProductID": "B005NC2HFQ"}}