{"Reviews": [{"Title": "T3i Camera", "Author": "LAL", "ReviewID": "R34Q3VMTUK1K0V", "Overall": "5.0", "Content": "Great camera and kit for the beginner and moderate user. So far it has performed to my expectations and I have been able to use it for everything I wanted to use it for.  Cameta Cameras worked with me well on one issue.", "Date": "October 19, 2011"}, {"Title": "Be still my beating heart", "Author": "Keith Halonen", "ReviewID": "RJQ4GWM20NC4I", "Overall": "5.0", "Content": "I have two basic uses for a camera. I take miscellaneous photos of almost anything that might somehow be an image element in one of my oil paintings. And I take tripod photos of the paintings once they're finished. I truly appreciate all the features of this camera and having an extra zoom lens is a real plus. Out of numerous package-deal choices, this one best suited my needs. I didn't need the tripod (mine is super old but super sturdy by comparison), but other packages offered even more items that I really didn't require. The little USB gizmo that enables the camera's flash card to behave as an external drive to my computer failed after a month. The seller immediately replaced this item with an identical model that works just fine. This is the best camera I've ever had, considering the reasonable price and the several very useful accessories that came with the package.", "Date": "June 2, 2013"}, {"Title": "Nice Kit and super camera.", "Author": "Andregol", "ReviewID": "R3S3WDJTX04DAP", "Overall": "4.0", "Content": "The bundle is nice and good. All the accessories are useful. The bag is ok and the tripod is good enough if you are starting. The camera is really amazing, i love it. The T3 is perfect for people who want to jump from a semi professional camera to a professional one. Is not complicate to learn and all the functions are super nice. I have been using the camera for a month and I really love it. I totally recommend the camera.", "Date": "December 16, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005HIRPDU"}}