{"Reviews": [{"Title": "Better options available", "Author": "Jay", "ReviewID": "R2T4W1YWUQM85F", "Overall": "3.0", "Content": "The gauge of the wire is very small so if you pull on the ends with any amount of effort there is a good chance you will pull the strands of wire right out.I've used a handful of these for security camera installations. I've pulled 3 apart by accident when trying to fish them, even gently, through a concealed hole. If you're not going to hide the wire and surface mount them then you probably won't have any issues if you take care with the install.You're better off spending the little extra and using cat5 wire and baluns. Even if your not handy at crimping rj45 ends onto cat5 then buy a patch cord at the length you need. It serves the same purpose and you have a much more sturdy product in the end.", "Date": "September 25, 2012"}, {"Title": "Super Quick Service!!", "Author": "mlovell22 \"mlovell22\"", "ReviewID": "R1IE4TSKWHVIOH", "Overall": "5.0", "Content": "This was the only site that I found that had the length of cables I was looking for.  The quick turnaround was really an extra benefit I wasn't expecting.  Very fast service service and I received a quality product.", "Date": "January 12, 2014"}, {"Title": "picture quality is amazing", "Author": "Naqi", "ReviewID": "R1CECNNXTCQTS6", "Overall": "5.0", "Content": "these wires gives better picture quality than the factory made wires came with my camera system. I like the wires will order more.", "Date": "January 6, 2014"}, {"Title": "Good value", "Author": "Blake Long", "ReviewID": "R3OQGT3J7UIYVS", "Overall": "5.0", "Content": "These cables served their intended purchase and were reasonably priced, as well as quick delivery.  They were used to extend cameras with cables just short of where I wanted to place them.", "Date": "December 7, 2013"}, {"Title": "best of the best", "Author": "Joe", "ReviewID": "R1A7VIGXSJYCCK", "Overall": "5.0", "Content": "fastest del. I ever got I think it was here within two days even with the free del. product worked great as I hoped it would and I got both 25' footers for 10.00 bucks...can't buy fittings for that...great deal", "Date": "October 16, 2013"}, {"Title": "Arrived quickly and in good condition", "Author": "Michael Song", "ReviewID": "R9N1JE4RHB3BS", "Overall": "5.0", "Content": "Does what it says it does, not much more to say than that. Good value for good price. Thank you!", "Date": "September 19, 2013"}, {"Title": "It works", "Author": "Juan M. Lince", "ReviewID": "R9JEF3TGE35MP", "Overall": "5.0", "Content": "If it works, it works!The video looks the way is suppouse to look. Price is great. It is well made.", "Date": "June 14, 2013"}, {"Title": "Did the job", "Author": "Bill Schebeck", "ReviewID": "R39I855IJK12XD", "Overall": "4.0", "Content": "Good quality connectors for the price.  Sturdy construction. Fast delivery.  Check power supply if you don't get a good signal. Probably not the wire.", "Date": "May 25, 2013"}, {"Title": "OK for basic wiring", "Author": "samfromscottsdale \"Sam\"", "ReviewID": "R24FWK8PLUZU4S", "Overall": "4.0", "Content": "Needed more wire for use in security cameras. Seemed much better than the wiring that came with the camera system.", "Date": "May 11, 2013"}, {"Title": "love", "Author": "Dan", "ReviewID": "R3U5NOA7T6M89T", "Overall": "5.0", "Content": "I don't like typing so much on this .should be allowed to only type a sentence. laal  la what you want from me", "Date": "April 27, 2013"}, {"Title": "great deal what more can i say", "Author": "James Byrd", "ReviewID": "R33O1V6XE9Q5MU", "Overall": "5.0", "Content": "fast service just what i needed to complete my project that i been working on for my cctv camera setup", "Date": "January 13, 2013"}], "ProductInfo": {"Price": "$22.00", "Features": "All-in-one video and power cable\nPlug and Play ready\n2 Pack of 25 feet video/power cables in white", "Name": "2 Pack of 25ft 25 Feet All-In-One Siamese CCTV Security Camera BNC Video and Power Cable for Surveillance System", "ImgURL": "http://ecx.images-amazon.com/images/I/41YR-lXUZZL._SY300_.jpg", "ProductID": "B005712C2Q"}}