{"Reviews": [{"Title": "Perfect for my project", "Author": "Chris Kringle", "ReviewID": "R1H07R4I5IZCDE", "Overall": "4.0", "Content": "I used 4 of these power supply's to power about 100 watts of led lightsThere about the size of a laptop power supplyPut 4 stars because I wish they made this item half the sizeBut that how this size of power needed can only be available in this large sizeStill works with my custom LEDs for 5 months now", "Date": "December 22, 2013"}, {"Title": "Great for security cameras.", "Author": "Anthony A", "ReviewID": "R2Y0MD3HOTM9C", "Overall": "5.0", "Content": "Worked as described. I use these for powering security cameras. Powers up to 4 CCTV cameras with IR back light.", "Date": "December 16, 2013"}, {"Title": "Good power source.", "Author": "TJ Holston", "ReviewID": "RGF9AE17FXKJK", "Overall": "3.0", "Content": "All in all the power source is doing well.  I did have to change the output plug to make it work.  Not the power packs fault.", "Date": "November 5, 2013"}, {"Title": "it didnt work for me at alll", "Author": "Robert C. Marshall, Jr.", "ReviewID": "R3FTJK1WJ1VELO", "Overall": "2.0", "Content": "it didnt workI dont like it - never will by this again... it probably not the fault of the people who sold it to me, however, it didnt fit on to the device it said it would", "Date": "June 24, 2013"}, {"Title": "It is what it is...", "Author": "Josh Daniel S. Davis \"xaminmo\"", "ReviewID": "R1VZT270O4CMDU", "Overall": "2.0", "Content": "This is cheap, with limited quality control.Ours required trimming some excess plastic in order to attach the power cord.Also, the description says \"Pack of 2\", however, this is not a pack of two.  It is a pack with one brick, and one splitter.  There are not two of any one item, which makes it more of a kit, or a package, but not a package of two.", "Date": "January 22, 2013"}], "ProductInfo": {"Price": "$25.70", "Features": "Output: DC12V3A\n(12V 3Amp) for CCTV Surveillance Security Cameras", "Name": "GW Security 12 Volt 3 Amp AC/DC Power Adapter Power Supply for Security Camera Surveillance Video CCTV", "ImgURL": "http://ecx.images-amazon.com/images/I/514PvadO3DL._SY300_.jpg", "ProductID": "B005AW7PI8"}}