{"Reviews": [{"Title": "GREAT camera, but GREAT, depends how you will use it...", "Author": "Radio Man \"yarns13\"", "ReviewID": "R2DTKD7ETU7HB1", "Overall": "4.0", "Content": "This Panasonic GF3 is a rather impressive camera that can take VERY sharp pictures with really good IQ/Dynamic range, and color overall. Besides my love for Photography I also enjoy using the best of the best cameras in their category if I can afford them. I have owned, or own the Canon S95/Fuji X100/ Sony NEX-5, Had the original E-P1, Had the GF1 prior.I have been searching forever for a VERY SMALL camera that can take DSLR like pictures. Though the GF1 did have a little bit more manual control than the GF1 does, for instance even flash compensation..I can't seem to find that adjustment on this GF3. Even cheap point and shoots often let you change the amount of flash you will use, That's one con here.Overall though, though using the same sensor as the older GF1 and GF2 my pictures from my GF3 look BETTER overall as to color, noise, IN focus, virtually no Moire pattern problems..the GF1 had a lot of Moire pattern noise, the GF3 seems much cleaner.The GF3 has something called pinpoint focus. It works GREAT and so super fast. You choose ANY point on the lcd you want to focus on, drag the POINT where you want it. Press the shutter 1/2 way down..you can focus on just an eye or any small spot you like. The screen will first show you an enlarged view so you KNOW you have perfect focus..that's a great plus being able to have picture after picture IN focus. Also depending upon what focus mode you choose the focus speed is rocket fast on this camera and usually quite accurate. Pictures outdoors look as good as a high quality DSLR as to overall dynamic range, very little highlight clipping, color..and the 14 mm lens has virtually no purple fringing. The reason for just four stars is though the GF3 is pretty good up to 800iso ..you still see a bit too much noise and yellow splotches on jpegs indoors unless the light is rather bright or you use 400 iso and under. It's too bad there's no in camera image stabilization like Olympus does..another con if you are using the 14mm lens or the 1.7 aperture lens here. My Fuji x100 can use iso 2000 in poor light and still look amazing. BUT the x100 has a full sized sensor and is a fixed lens camera..and it's much more expensive and larger than the GF3, so not a fair comparison.Overall as to overall picture quality, SMALL FORM factor, this camera with LARGE sensor is almost the exact same size as the Pana LX5 which I also own...you just can't beat the GF3 overall,as far as the camera you CAN take with you..vs some bulky heavy camera that will drag you down.I have not used the video function as it is not important to me so I can't comment about that.I like the pictures from this GF3 overall a bit more than my NEX-5 because the NEX-5 pics to me all look all a bit too soft..it mis focuses too often..and NEX color seems a bit too saturated..(Just not right). That said, the NEX5 blows away the GF3 on high iso..hence it depends how you are going to use your camera most.Overall..I think most people will really like the GF3. Sure if you NEED a hot shoe..obviously it doesn't have one. For me if I'm going to use a hot shoe..It's going to defeat some of the SMALL factor, so why bother with a small camera like this in the first place. I applaud Panasonic for getting most things right here. The touchscreen works just fine, you just need get used to it. It's 2011..maybe this will be the way of the future, change is often painful..:)Overall..this is an excellent camera..maybe a tad overpriced I feel..but an excellent camera on most points.", "Date": "August 10, 2011"}, {"Title": "An excellent step up from a point and shoot or a great DSLR companion.", "Author": "Anthony Pantliano \"The Photo Guy\"", "ReviewID": "R1ZZ8DR04EUN74", "Overall": "4.0", "Content": "The Panasonic GF3 is a compact, easy to use camera that takes excellent photos.Design wise the Panasonic is very sleek and compact.  It's not going to fit into a jean's pocket, but will slip into a jacket pocket with ease, especially with the small 14mm pancake lens.  It's light in weight and is easy to carry around all day.  The camera is very discreet and draws little attention. There is a small rubber grip on the back and a nice sized grip on the front.  I had no trouble getting a good hold on the camera and it fits nicely in my average sized hands.  Build quality of both the lens and the camera is extremely high, with a nice metal body that feels solid and well assembled. Lastly, there is a small pop-up flash that can also be pulled back to function as a bounce flash.Using the Panasonic is simple.  For beginners, there is a button on the top of the camera to activate Intelligent Automatic mode.  In this mode the camera will do all the thinking for you.  For those who wish to have more control, the camera offers the full suite of manuals controls, including aperture and shutter priority modes.  While the exterior of the camera has very few buttons, there are just enough to give you direct access to important setting (focus mode, exposure compensation, continuous shooting, and white balance).  Additionally, the camera is very customizable and I like the fact that you can set the Quick Menu button to operate any number of features, including ISO speed.  There is a movie record button on the top by the shutter.  The 3\" touch screen on the back is bright and sharp, and responds instantly and works well.  You can even customize the features that pop-up when you use the touch screen's quick menu.  For instance I added the metering setting so I'd have quicker access to them.  I really enjoyed shooting with the camera and found the lack of external buttons to be a non-issue.In operation the Panasonic GF3 is very speedy.  It turns on and is ready to shoot in about 3 seconds.  Focus speeds are quick, especially in the 1 area autofocus mode.  Continuous shooting is fast as well and gives you a choice of three speeds; the highest however will not update the screen in real time.  When reviewing/deleting photos and navigating the menus the camera responds instantly.  Shot to shot times are instantaneous as well.  Battery life is high and I was able to take over 200 pictures with lots of reviewing and menu navigating before the battery died.The 14mm f/2.5 kit lens is compact and nicely made.  It is sharp from corner to corner, even wide open.  If you shoot JPEG and turn on the camera's shading compensation vignetting is not much of an issue, and you'll might notice it in 1% of your photos.  Additionally the combination of the GF3's large sensor and the lens' bright f/2.5 aperture allow for a shallow depth of field for nicely blurred backgrounds and foregrounds.  Without an image stabilizer the slowest shutter speed I can hand hold is 1/20\".Photo quality is terrific, and while it's not as good a high end SLR (like my Canon 7D), it is a definite step up from a point and shoot camera without much added bulk.  Colors, exposure, sharpness, and detail are all very good.  At low ISO speeds the photos are devoid of noise.  Moving up the ISO scale, I can confidently shoot up to ISO 1600 before I start to see noticeable noise in the camera's JPEGs.  ISO speeds above 1600 are decent, but I save those for emergencies only.  The camera allows you to adjust contrast, sharpness, saturation, and noise reduction for the photographs.  Movie quality is also good with smooth action and good sound, but it is recorded in mono.All in all...a great little Micro Four Thirds camera that is a joy to use, and delivers excellent photo quality.07/17/2012 Update: I recently took the camera to a wedding reception and it performed like a champ in full manual mode.  I shot at f/2.5, shutter speed 1/125\", and ISO speed 2000, and was able to get great images of couples dancing.P.S. If you have any questions please leave me a comment and I would be happy to respond.", "Date": "January 19, 2012"}, {"Title": "A decent complement to an enthusiast photography kit", "Author": "Luis E. D. Gimenez", "ReviewID": "R29ILW9TUE4OL1", "Overall": "3.0", "Content": "For some time I've been looking for a camera with better image quality than a point & shoot that I could carry whenever I didn't feel like lugging my EOS 7D or 60D around. When a competing camera business offered the 14 mm kit bundled with the 14 - 42 mm zoom, I couldn't resist and jumped in. The GF-3 feels very well built and so does the 14 mm pancake. Not so much the kit zoom, but never worse than the standard kit glass offered with the Rebel line from Canon. The camera with the 14 mm prime is very small and certainly filled the profile of what I was looking. External controls are sparse but no surprises here, as simplicity is the predominant philosophy preconized buy Panasonic. In its favor, the touchscreen interface is very intuitive and you do get full control access after some Q-menu tweaks. Therefore, in my opinion, the GF-3 gets high marks in usability but not so much in image quality. Although I wasn't expecting DSLR quality given the limitations (and advantages) of the micro four/thirds format, I do think that IQ is closer to high end point and shoot than entry-level DSLRs. Specially at above ISO 800. ISO 1600 is usable but very blotchy at regular jpeg output and requires some processing for raw images. Love the size of the pancake but unfortunately this lens is SOFT at the open 2.5 setting. And I mean soft at even regular viewing magnifications. Also, it might be a mislead impression, but it behaves slower than you might expect from a 2.5 maximum aperture prime. I guess you can't cheat physics. The kit zoom offers visibly better IQ at the wide (equivalent) end but it is painfully slow. Not sure how much the mega O.I.S. helps in low light in a camera that is more difficult to hold still than a DSLR. I final note goes to the bundled software. I haven't tried the raw converter, but Silkypix crashes every time I connect the camera through the supplied USB cable. This is the case in two separate machines although I have to mention that it coexists with other camera manufacturer software. So far, direct SD card downloads and uninstalling the software has solved the issue. To summarize, even with the lack of external controls, I like the ergonomics for what it is (compact mirrorless camera) and the handling is good but noise at high ISO settings is above my generous expectations.People interested in the m4/3 format should consider offerings from Olympus or the newer GX-1 for better low light image quality.", "Date": "December 23, 2011"}, {"Title": "Little Street/Travel Camera", "Author": "Tony D.", "ReviewID": "R31M6UAM589TJL", "Overall": "5.0", "Content": "I am very happy with every aspect of this camera. I own (and still use & enjoy very much) the Nikon D90, and for it have purchased a flash and a few extra lenses. I have invested in that system and should be able to use it for years to come. The downside for the D90 is that it is a pain to lug around town or on the trail.I purchased the GF3 with its 14mm F2.5 lens and now have a carry around camera - and I always have it with me. It's size, speed and ease of use makes it a perfect street/trail camera. I love the different focus options available, and I switch between the automatic (iA), touch focus, and manual focus quickly & often. My day job is working at a photographer for a technical college (using Canon DSLR equipment) and over the years I have come to regularly use the automatic settings available on all the camera models I use. It is pretty amazing what the presets that the engineers of Nikon, Canon & Panasonic have developed - automatic works wonders. I do use the aperture, shutter, programmable & manual settings when I need to - but auto sure is nice, and Panasonic's iA and iA plus settings really are a marvel.The GF3's lack of a hot shoe for a flash or a port for a viewfinder don't bother me at all, as I am not going to load up on accessories for another camera system. I shoot available light 95% of the time anyway. When I have used the flash, I bounce flash it (when there is a standard height white ceiling), as it is easy to tilt it up using a finger. (There is a spring that holds the flash straight forward, but it lets the head bend upwards.) Shooting at up to  iso 800 performance is great. 1600 is not as good as on my D90, but shooting RAW and processing the images gets results I am very happy with.I ordered a lens adapter to use a \"vintage\" Minolta 50mm macro lens I own. I may purchase the small profile zoom lens available or the 20mm 1.7 pancake.Ultimately, the camera's low price compared to other mirrorless models available was the clincher for me. The camera/lens was on sale for under $400. I know there are other \"better\" cameras out there, but \"bang for the buck\" the GF3 hits the sweet spot for . . . small size . . . performance . . . and ease of use in its price range. I can get digital SLR quality images from a camera close to the size of the enthusiast raw-shooting compact cameras (Panasonic LX5 & Canon G12), a category that I \"was\" looking at for my little street/travel camera.", "Date": "February 9, 2012"}, {"Title": "Best pocketable camera under $500, near-DSLR image quality", "Author": "GM", "ReviewID": "R21OPE1KIYRIX6", "Overall": "5.0", "Content": "After our 2nd kid, carrying a DSLR became extremely difficult. Bought GF3/14mm+20mm for $315+$365 on Amazon to complement my Canon 5d MkII. Perfect, pocketable size. I can bring it anywhere, and get great image quality in almost any condition. I'm very happy with the camera and lenses.* The camera doesn't give you too much latitude about under-exposure (shadows can't be lifted well even in raw). Try to expose correctly. When exposed well, the images are DSLR quality.* Be sure to shoot in high speed mode. In single-shot mode, the camera feels sluggish (blackout time is too long). Otherwise, the camera is pretty responsive.* Versatility of AF beats even 5d MkII (you can touch anywhere on the screen to make it the AF point). Coming from 5d MkII (or from any DSLR for that matter), touch-AF is a joy to use.* Auto white-balance and color in artificial light are not up to Canon's standards. That's one area of potential improvement.* With 14mm lens, I can finally take self portraits (usually, with the kids). That's next to impossible with a large DSLR.* I put on 14mm during daytime (when the light is good), and the 20mm otherwise. Kit lens is too slow and too large, hence the primes are preferable if you can afford them.* JPGs are pretty darn good. I don't process raws unless I have to (due to poor exposure or AWB).* Tiny flash on GF3 is very useful. However, a DSLR + external flash combo works much better indoors if you have it/can bring with you.* Card write times are somewhat long (in raw+jpg mode). But, you can take 5-6 shots successively while the images are written. The downside is you have to wait until the last image is written before viewing any of them.", "Date": "July 31, 2012"}, {"Title": "Great  carry around camera", "Author": "Edward Wilson \"A Lucid Ape\"", "ReviewID": "R2JMMRV4EJESKC", "Overall": "5.0", "Content": "I was looking for a small interchangeable lens camera and this worked out perfectly. At low ISOs it takes great pictures; it only begins to suffer above ISO 800.The camera is small and light, too big to fit into a regular pocket but will fit into a cargo pocket.The touchscreen interface is different, but Actually turned out to be very useful.  Focus is amazingly quick even in low light, and with touch-to-focus it couldn't be better.The 14 ml pancake lens is as small as they come and works out to a perfect wide angle lens.  It's great for situations where you need a small lens and you can't back up to fit everything into the picture.With the option to attach a variety of other lenses, this camera is far more useful than a point-and-shoot, takes better quality pictures, and is just slightly larger.  If you want a PASM camera that is small enough that you'll likely have it with you, I would say this is the one.  No complaints so far, other than the picture quality at ISO 1600 and above.NOTE: I suggest purchasing an inexpensive MULTI-COATED UV lens filter to protect the lens - I got an AGFA one that works fine.  If the lens isn't multi-coated there will be glare and reflections on the pics in bright light because of the short pancake lens.", "Date": "June 25, 2012"}, {"Title": "Great Camera for the price.", "Author": "Emoya", "ReviewID": "R2ZOJJ32P2BPUF", "Overall": "5.0", "Content": "I purchased this camera because I wanted a step up from the point and shoot cameras. The price for this camera was right and I have to say that after utilizing it for about a month that the purchase was a wise one. Since buying the camera I've learned more about photography and how to take proper pictures. The touch screen interface is unbelievably easy to use; it appears that Panasonic had the novice in mind when engineering this camera.One of my favourite features is the fast auto-focus which is said to be almost as fast as DSLR's. This is great for those fleeting moments that can pass if not for the quick auto-focus. The 14mm pancake lens also makes it very small and compact, however, novices to photography might be dissapointed in the fixed lens of the 14mm. There is the other kit that brings the 14-42mm lens, this might be a better choice for those who still want to zoom into their subjects. I was at first dissapointed in lack of zoom as well, but I've come to appreciate the small size and fast, wide angle lens that the 14mm provides.There are some who complain about the lack of hotshoe, viewfinder, and physical dials; but for my needs, none of these omissions are deal breakers. I was disappointed with the omission of the image stabilizer in the body of the camera, and also the lack of features and filters that are common with many other cameras. However, it does have the nice IA+ mode that allows you to shoot under automatice mode while being able to manually control the EV and WB.The image quality is very good, although, under some situations can render some pics that are soft compared to my wifes Canon sx40. But the GF3 shoots in raw as well, so, for those who are interested in learning how to further manipulate photos they can take advantage of this feature on the camera.I would say that this camera is not the best compact camera out there, but is rather in between the average and the best. Taking into account the price factor, you can really see the value of purchasing this well built camera.", "Date": "June 6, 2012"}, {"Title": "Niftiest little camera!", "Author": "S. Fazli", "ReviewID": "R2Y8TJRD3JXGB6", "Overall": "5.0", "Content": "Let's agree on one fact: there is no single best camera. Each one gives you unique capability handling and compromises.An interchangeable lens camera is only capable of capturing images that lenses that you mount on the camera capture.  In that regard, MFT rules. You can mount everything from Leica M, Leica R, Leica screw mount, Olympus, Nikon F/G, Canon FD, Minolta and untold others on this camera. It's the universal digital back! On top, you get noise free pictures at all the way to ISO 800.  You get a tiny  compact body, access to lots of tremendous native MFT lenses. Lumix 14mm f2.5, 20mm f1.7 and Leica 25mm f1.4 are each amazing, small and better than most primes in Nikon, Canon and Sony lines.Of course, the way to really maximize image quality is to pair this camera with Leica M or screw mount lenses via simple adapters. The camera makes it super easy to manually focus and expose right from the touchscreen.  In a very unfair comparison, this little camera (body only: $399, Leica adapter $179) is a much cheaper alternative to the $7000 Leica M9. Of course, this is only 1/2 frame not full, but it's amazing for what you get in a tiny body.When you just want a simple p&s;, just put on the 14mm 2.5 and just let it do everything in iA mode. When you are ready to go off-road with manual lenses, you can do that. What's your pleasure?", "Date": "January 14, 2012"}, {"Title": "really nice little camera", "Author": "WLSinWI \"wls\"", "ReviewID": "R3CF27DRKCS51V", "Overall": "4.0", "Content": "This is a micro four thirds system (MFT)It is designed to use a larger sensor than the typical point and shoot and so gives better pictures plus it has interchangeable lenses that work on all MFT cameras. Currently Olympus and Panasonic offer camera bodies so you can mix and match to your liking... I bought this on a closeout sale cause the price was so great and I'm glad I did!. Is it the best possible MFT camera ? - no but it's pretty darn good and it is the smallest.Starting with the 14mm pancake lens is a good idea and since MFT lenses are interchangeable you can build from there.  Panasonic has a new compact 14-42 manual zoom that will be a great addition to your kit. Since a new GF series camera is expected soon it makes sense to get this with the 14mm lens now at a closeout price (check out what the lens alone sells for on Amazon) and then decide if the new version fits your needs better and want to upgrade. I love the feel of it as it is very solid and construction is very good. This is the perfect quality compact travel camera!", "Date": "March 13, 2013"}, {"Title": "Excellent!", "Author": "Boomslang", "ReviewID": "R3EWW08DJ0ES13", "Overall": "4.0", "Content": "This is a fantastic little camera which blows the socks off most compact cameras.I bought this camera on a budget and did not want to compromise image quality for price - I was not disappointed.I like landscape and street photography and did not want to take a bulky SLR with me when traveling.The 14mm Pancake lens is fantastically sharp and compact and functions well in low light conditions, however there is no image stabilisation with the supplied lens.The camera has a  touch screen which is great, however a little sluggish when operating.", "Date": "December 7, 2012"}, {"Title": "Boom goes the dynamite/Oh so good", "Author": "Jon", "ReviewID": "RGQ70GTHYKK14", "Overall": "5.0", "Content": "This camera is the bomb.com. I've only used this a few times since I've got it, but the pictures I've got from it are more than satisfying. For the price range, this camera is just such a huge step up from a high end point and shoot I don't feel like it's comparable. I'm not a camera guy by any means, but quality of pictures from this camera vs. pictures from my Canon point and shoot easily noticeable.I used this on a trip up a fourteener and was able to take some pretty good pictures with this pancake, but I think adding a telescoping lens may be a worthwhile investment. The camera took good close-up shots, awesome mid distance shots, and some surprisingly great distance/landscape shots.As a starter, you can't go wrong with his setup. If you'd like to get better lenses, micro 4/3s come in huge varieties from a couple hundred dollar lens to a thousand dollar lens. There such versatility in this camera vs. a point & shoot that I don't think I'll go back. Also, this camera with the pancake attached is about the size of a point & shoot. Man, I could go on and on about this thing. It's simply the best...", "Date": "September 19, 2012"}, {"Title": "Almost, but not quite a DSLR", "Author": "T. Horst", "ReviewID": "R1TVX682GYDJWW", "Overall": "5.0", "Content": "Other reviewers have stated as much, but it bears repeating: this camera seems to match people at a very specific skill level and set of needs. I'm not a great photographer by any means, but I did have a bit of experience with manual 35mm cameras, and I've owned several higher end \"super zoom\" point and shoot digital cameras.This camera seems to fit a very specific niche between the advanced point and shoot user and the prosumer DSLR classes, with the advantages of being the size of a point and shoot and having much of the functionality, interchangeable lenses and manual controls of a DSLR. My girlfriend who is a DSLR user, and I might add a far more competent photographer than me, was rather impressed when I unboxed it and ran through the controls. She was amused by the big, satisfying sounding \"clunk\" of the shutter that's so familiar to 35mm and DSLR users. When I popped off the lens, I noticed a look of envy, as she uses a camera regularly as part of her job, and said that mine might be more convenient than hers.I should also state that my last two cameras have been Panasonics, so I'm a wee bit of a brand loyalist. I'm familiar with the interface, and have had good luck with them in the past, so I'm kind of sticking with what I know. My previous camera was a TZ4, and I still use it occasionally until I get more facile with the interface on this one (which, quite truthfully, I'll doubtless keep on the fully automatic mode the majority of the time). I do intend to get more lenses for it in the immediate future.All in all, I've always stuck with the old adage of \"the best camera in the world is the one you have with you\". Being as this is conveniently sized, well featured, and while not quite pocketable, it will fit in my messenger bag where I normally carry my point and shoot, so it will indeed be the camera I have available. I'd say that this is the camera for someone ready an advanced prosumer SLR type camera, but doesn't want to deal with the additional bulk. It won't make you a better photographer, but it will give you the additional tools to allow you to.", "Date": "June 27, 2012"}, {"Title": "Panasonic GF3 20mm F1.7 hands on", "Author": "beSuretoBuy", "ReviewID": "R39V0KVFZ8ME6D", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2U8GT3RZBDMB3embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2U8GT3RZBDMB3refresh_preplay() {\n\ndocument.getElementById(\"cv_mo2U8GT3RZBDMB3chiDiv\").innerHTML = document.getElementById(\"cv_mo2U8GT3RZBDMB3hiddenPre\").innerHTML;\n};\ncv_mo2U8GT3RZBDMB3refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2U8GT3RZBDMB3so;\t   \n\n\nfunction cv_mo2U8GT3RZBDMB3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2U8GT3RZBDMB3so = new SWFObject(swfLocation, \"cv_mo2U8GT3RZBDMB3AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2U8GT3RZBDMB3so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2U8GT3RZBDMB3so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2U8GT3RZBDMB3so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2U8GT3RZBDMB3so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2U8GT3RZBDMB3so.setAttribute(\"height\", swfHeight);\n          cv_mo2U8GT3RZBDMB3so.setAttribute(\"width\", swfWidth);\n          cv_mo2U8GT3RZBDMB3so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2U8GT3RZBDMB3so.write(\"cv_mo2U8GT3RZBDMB3flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2U8GT3RZBDMB3', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2U8GT3RZBDMB3';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2U8GT3RZBDMB3', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2U8GT3RZBDMB3loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2U8GT3RZBDMB3\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m3U6USPSGKTLRA\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m3U6USPSGKTLRA\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R39V0KVFZ8ME6D\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m3U6USPSGKTLRA/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2U8GT3RZBDMB3duration')) {\n      document.getElementById('cv_mo2U8GT3RZBDMB3duration').style.display='none';\n    }\n    cv_mo2U8GT3RZBDMB3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2U8GT3RZBDMB3loadSwf(movieID, playerVersion) {\n   return _cv_mo2U8GT3RZBDMB3loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2U8GT3RZBDMB3newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2U8GT3RZBDMB3', 0, h);\n}\n\nfunction cv_mo2U8GT3RZBDMB3resetPlayer(w,h,bw,cc) {\n  cv_mo2U8GT3RZBDMB3newHeight(h);\n\n  cv_mo2U8GT3RZBDMB3so.addVariable(\"resetBandwidth\", bw);\n  cv_mo2U8GT3RZBDMB3so.addVariable(\"cacheCode\", cc);\n  cv_mo2U8GT3RZBDMB3so.setAttribute(\"height\", h);\n  cv_mo2U8GT3RZBDMB3so.setAttribute(\"width\", w);\n  cv_mo2U8GT3RZBDMB3so.write(\"cv_mo2U8GT3RZBDMB3flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2U8GT3RZBDMB3RollOverImg = new Image();\ncv_mo2U8GT3RZBDMB3RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81wM-UP2MmS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2U8GT3RZBDMB3preplay = document.getElementById('cv_mo2U8GT3RZBDMB3preplayImageId');\nif (cv_mo2U8GT3RZBDMB3preplay) {\n  cv_mo2U8GT3RZBDMB3preplay.onmouseover = function() {\n    cv_mo2U8GT3RZBDMB3preplay.src = \"http://ecx.images-amazon.com/images/I/81wM-UP2MmS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2U8GT3RZBDMB3preplay.onmouseout = function() {\n    cv_mo2U8GT3RZBDMB3preplay.src = \"http://ecx.images-amazon.com/images/I/81wM-UP2MmS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2U8GT3RZBDMB3preplay.parentNode;\n\n  var cv_mo2U8GT3RZBDMB3currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2U8GT3RZBDMB3currentClick) {\n      return cv_mo2U8GT3RZBDMB3currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:24 MinsPanasonic GF3 20mm F1.7 hands on, focusing, live view, continuous shooting speed. Highlight: CMOS Four third 17.3x13mm, up to 3.8 fps, shutter speed max 1/4000s, 3.0 in 460k pixels touch screen lcd, Auto Focus 1080p @ 30fps video mode, consumer size:107.7x67.1x32.5mm, 264g. Introduced on August, 2011.Panasonic Lumix DMC-GF3 12.1 MP Micro Four Thirds Interchangeable Lens Digital Camera with 3-Inch Touchscreen and 14mm F2.5 ASPH LensPanasonic Lumix DMC-GF3 12.1 MP Micro Four Thirds Interchangeable Lens Digital Camera with 3-Inch Touchscreen and 14mm F2.5 ASPH Lens", "Date": "November 28, 2011"}, {"Title": "My favorite camera ever... (for some, but not all, situations)", "Author": "Rob R", "ReviewID": "R3E4P9SF1J2Q57", "Overall": "5.0", "Content": "I seriously have and have had lots of cameras throughout my lifetime, and the GF3 has become my all-time favorite.  Is it great for all needs? NO...  But for many, it is wonderful.  The GF3 takes very sharp pictures in a compact form.  It has good light sensitivity, low digital noise, and good speed.  The battery is more than adequate for a full day of shooting and reviewing pictures.If you are traveling with the family, there is no better camera for portability and quality scenery and family shots (or movies).  The 14mm pancake lens is very sharp and fast, and indoor pictures (without the flash) are surprisingly good.  With the flash, you have a decent range of lighting and fill for most needs.  The options for automation and more manual shooting are very good, and I'd have to say that the fully automatic settings are best to use with this camera since the changing of other settings can be annoying to find in the menus.If you want high magnification or high speed shots (such as sports action), then stick with your digital SLR.  Once you add big lenses to this type of package, the advantages seem lost to me.  I also don't see a good reason to buy the bigger and more expensive 4/3s models.  Once you lose the size and cost advantages of a camera like the GF3, you might as well be using the DSLRs.Pros:* Size and weight.  You can fit the camera (with one of the pancake lenses) in your pocket or purse (though it bulges more than most ultra-compact cameras and cell phones).* Clarity.  Very sharp 12MP pictures, and the big 4/3 sensor is much-much better than a 12MP sensor in small compact cameras.* Sensitivity.  Indoor pictures without the flash are quite decent with the faster fixed-focal-length lenses (e.g. 14mm pancake)* Flash. Easy to use built-in flash* Battery. Good life lithium-ion with decent charge time* Flexibility of shooting modes.* Lens interchangeability.  Though I have yet to buy more lenses, I like that these appear to be standard among multiple manufacturers.* Sleep mode.  The camera puts itself to sleep if you leave it on.  This is a good battery saver, and it wakes by pressing the shutter button.Cons:* Touch screen - inadvertent touching of the back screen can change your settings, and you won't know it happened until you review your pictures.  I have lost a whole day's worth of pictures due to an unintended focus change caused by the touch screen getting bumped while it was left on.  Accidentally touching a settings-change happens much more often than I'd like.* Tricky menus - it is difficult to find some of the common settings in the menus.  In time you get used to many.  I am an experienced photographer with many old and manual cameras, but I still have trouble with the settings changes in the non-auto modes of this camera.  I hope to work with it more in time for better creativity shooting.* Flash settings.  Perhaps I've not looked in the right place yet, but I'd really like a forced-flash setting for filling backlit subjects.In summary: if you travel and want a reasonably small camera that takes excellent pictures, then forget about using a cell phone or ultra-compact camera.  Use this or a similar 4/3 camera and you will be VERY pleased.  For action and high magnification photography, this is not your best choice.", "Date": "August 23, 2013"}, {"Title": "Great!", "Author": "E. Shen", "ReviewID": "RX0PT24D75T3Z", "Overall": "5.0", "Content": "I bought this on a Warehouse deal for much cheaper then it is even now.  Coupled with a 20mm pancake or Olympus 45mm it takes great picture.  I also have an Olympus EPL-2 and I have to say that the Olympus probably has better colors in good lighting.  The panasonic however is significantly smaller and easier to handle.", "Date": "December 29, 2012"}, {"Title": "Amazing Value with Sharp Lens", "Author": "PhotoMahem", "ReviewID": "R2J838N6FYLFS5", "Overall": "5.0", "Content": "This camera surprises me everytime I use it.  Small and very portable.  User friendly and yet can rival my DSLR in creative functions.  Originally bought it because it was cheaper to buy the kit than to buy 14mm pancake lens separately but ended up keeping the GF3 body.  This is the best value out there.  Lumix did a great job.", "Date": "October 9, 2012"}, {"Title": "Very well built, looks cool, fast focus.", "Author": "the hotshot \"nada\"", "ReviewID": "R1A7VFK8UHLJL5", "Overall": "5.0", "Content": "I left my Canon DSLR family for Micor4/3 because of the size and convenience.  The quality of the pics are awesome when compared with DSLR's size and quality.  I love the special effects because they make images more fun to take.  When you combine this body with Panasonic 20mm, images are superb, especially in the dark.I love that you can switch the power on for the entire day while traveling and bring the camera back out of sleep in 2 seconds, to capture that cool image you see while walking around (not all micro's have this feature).I recommend using the 14mm and 20mm with this camera (maybe other primes?). Stock lenses usually do not have the same crispiness.  After all, the beauty lies in the quality, not quantity?The only lacking feature is megapixel, I can't wait until Micro's come out with more of them for crispier images at reasonable values.", "Date": "August 31, 2012"}, {"Title": "Love this Camera!", "Author": "Bala \"indiaj0nes\"", "ReviewID": "RIO36XP0DHNK1", "Overall": "5.0", "Content": "I just love this camera! It is Fast, Produces nice Bokeh on Portraits.Only thing that i dont like is, the video is not as good as the Lumix LX5 in low light..", "Date": "August 22, 2012"}, {"Title": "This is light and work well.", "Author": "Egofinder", "ReviewID": "RGB5QUDPI9K2N", "Overall": "5.0", "Content": "This is perfect camera for day use.compact and working well.Also Panasonic has various option of lens.I love GF3.", "Date": "August 22, 2012"}, {"Title": "Great for the average consumer", "Author": "swansohappy", "ReviewID": "RMNCV5I3BKAY", "Overall": "4.0", "Content": "I am on my way to a very long europe trip and didnt want to take just any old point-and-shoot but also did not want to take my dSLR. I am picky about my photos but I also no photographer. I want to take sure that all the pictures that I take while I am over there be somewhat nicer than your average picture. After looking at all the reviews for compact systems or mirrorless cameras, I made a decision on the GF3. AND wow did I pick well! after taking some photos and uploading them on my computer, I feel that I have made the right choice with this one. I now know that I will not have to worry about photos while I am over there.COMPACT, STYLIST, AND GREAT QUALITY PICTURES.", "Date": "July 11, 2012"}, {"Title": "Good camera, great size.", "Author": "Eric Galis", "ReviewID": "R18JPY2GNT61RU", "Overall": "4.0", "Content": "I had been looking at MFT cameras for some time, and the discount made this a good purchase.  I usually shoot a Canon XSi, and this is a great companion to a camera like that.  The quality is far superior to a PaS, and the flexibility of lenses is nice.  Autofocus is very quick, and although I hadn't expected to like/use the touch screen, it is quite handy for quick menu items, zooming in on shots, and changing the focal point.  Overall very happy with this camera.", "Date": "June 4, 2012"}, {"Title": "From someone who's owned dozens of digital cameras...", "Author": "Leah A. Manning \"Leah\"", "ReviewID": "RLXPA89HWGYKX", "Overall": "5.0", "Content": "I am kind of known for going through digital cameras at a crazy pace - I will read reviews like crazy and do my research, buy one that I think I'll love and then either sell it or return it within a few months. I have high standards (I'm a photographer) but I really want a small camera I can keep in my purse. This camera fits the bill. I've owned it for over a year now (a record-by far!) and I wouldn't dream of parting with it. It takes fast sharp pictures and I love that I can bounce the little on-camera flash. You won't be disappointed!", "Date": "November 30, 2012"}, {"Title": "Really good middle camera", "Author": "Louis B. Davidson \"DrSQL\"", "ReviewID": "RN7XLMIZ9GTT2", "Overall": "4.0", "Content": "When I bought the camera, I was actually buying it more for the lens than the camera. I have an Olympus E-PL1 with the 14-42 lens that I have had for a few years now. The Panasonic is a lot faster with a lot of nifty features in the menus, but lacks motion stabilization onboard (rather it leaves it to the lenses, unlike Olympus' PEN cameras that implement it in the camera.) I am not camera savvy, and in both camera I got a lot more than I bargained for, with great automatic settings. Having a pop-up flash that you have to manually pop up is a great boon for the beginner, because the camera adjusts to the lack of flash, unlike in point and shoot model that sometimes don't have auto modes that you can turn off the flash.The lens is great, I have used it on both cameras and have gotten some great shots. I like that it doesn't have to be unlocked and extended like the zoom lenses do, so action vacation shots takes no time to take. It also helps to take high res shots and zoom at home. I took some shots in a show at Disney World and actually had to lower the sensitivity to get good shots from the stage lights. With the smallish size, the camera and lens fits nicely in my pocket when I need it to also.All in all it is massively better than a point and shoot, even without stabilization since the camera does a lot better job taking in light for the shot than a point and shoot.", "Date": "July 5, 2012"}, {"Title": "My wife loves it..!!", "Author": "W. Soh", "ReviewID": "R3HVEBZAXV1UDI", "Overall": "5.0", "Content": "My GF3 just arrived - a present for my wife to replace her S95.My other cameras are/were:Canon G10 - soldGF1 + 20mm - soldCanon S90 - soldCanon S95 - currentCanon 550D + 50mm 1.8 - currentGF2 +20mm + 14mm 2.5 - NEW :)Very beautiful camera it is.. I like the curves. It is quite a lot smaller than GF1/GF2.The GF3 user interface is fantastic. No mode dial of the GF1 but GF3 gave focus selection point which speed things back up. Contrast detect is wonderful. I also thought the GF3 UI learning curve is very intuitive.The 14mm 2.5 is not fast enough indoors, resulting in motion blur as GF cameras have no inbody stabilizer and weak ISO performance. I use bounce flash whenever I can to give nice skin tone.I think the star performer is to couple it with the 20mm 1.7 and shoot at lower ISO.My wife loves it!!4.5 stars (due to weak ISO).", "Date": "September 24, 2011"}, {"Title": "Great small camera that you always have on you", "Author": "D Man", "ReviewID": "R2M31247CMQAAV", "Overall": "5.0", "Content": "I love this camera!  With the 14mm lens I carry it everywhere I go.  I have gotten so many great pictures that I otherwise would not have had because this camera is small enough for me to carry every place I go.  I have a G5 camera too, and I much prefer to use that if I am going out to take some dedicated pictures, but when life throws random picture opportunities at me, I now always have a great high quality camera with me. BTW if you need a perfect custom made small case for this camera check out Leather Camera Case Bag for Panasonic Lumix GF3 Black", "Date": "September 13, 2013"}, {"Title": "Great intro to micro four thirds", "Author": "A. Gray", "ReviewID": "R3TJFFJG9VSHPB", "Overall": "5.0", "Content": "This is a great little camera at a great price. The included pancake lens is very wide angle, but it works great indoors where space is cramped and light may be low. The small size allows you to keep it in your pocket as well.", "Date": "May 2, 2013"}, {"Title": "great camera", "Author": "Ashley Schneider \"grad student\"", "ReviewID": "R2V79VY1SBQE7I", "Overall": "5.0", "Content": "pictures are amazing every time, so many great features. Lots of support videos and reading online to use as a reference too", "Date": "March 24, 2013"}, {"Title": "Utility Camera", "Author": "RichMan42", "ReviewID": "R32LP0U0OOHP2S", "Overall": "4.0", "Content": "My LUMIX DMC-GF3CK is light and comfortable to hold. I am still learning the various settings but the standard automatic ones are giving me excellent photos. As I learn more I believe it will get even better.", "Date": "June 20, 2012"}, {"Title": "small but SHARP", "Author": "Joyce of Sibu", "ReviewID": "R2JU2LN0EUS1A3", "Overall": "5.0", "Content": "The pancake is razor sharp.Stop down to f/4, images at corners is as sharp as that in center.A must for taking group photo.All people, from center to corner appear sharp. No CA.Canon T2i/T3i has its zoom lens (18-55), but it does not produce a 18mm prime.Group photo taken at 18mm position (Canon 18-55), even stop down to f/8, has corner problem.Corner's people's face is soft.(Same problem in Pana FZ150, corner image soft)", "Date": "June 2, 2012"}, {"Title": "fantastic little camera!", "Author": "yetiti02", "ReviewID": "R1IO7X6QN7ZGAN", "Overall": "5.0", "Content": "Even with one 14mm kit lens, this camera is definitely a great alternative for people who don't wanna carry big DSLR for travel.", "Date": "June 26, 2012"}, {"Title": "Great lens!", "Author": "ck", "ReviewID": "RIYZOTLIK41HS", "Overall": "5.0", "Content": "Amazing photo quality. The pancake lens is sharp! Lack of zoom is an issue..might need to get a zoom lens to make it more sable.", "Date": "June 21, 2012"}, {"Title": "Great Camera", "Author": "Joseph S", "ReviewID": "R1IF1T0A6ROHBO", "Overall": "5.0", "Content": "I've been using this camera as an upgrade to my Nikon D40 (6 megapixel DSLR) and I have to say I've been extremely impressed with the photo quality from this camera. Low light photos come out great, the flash (while not as powerful as my Nikon) is adequate for most situations, and response is quick. Pictures are sharp and skin tones are natural.The only drawback with the camera I feel is the flash  recycle. I'm used to my DSLR recycling flash in 1 secondf whereas this camera will take 2-3 seconds. That said, I believe for point and shoot cameras this is normal.", "Date": "December 21, 2011"}, {"Title": "Makes me feel like a pro :)", "Author": "Sherezz Grant", "ReviewID": "R2T0N74YTUN9I8", "Overall": "4.0", "Content": "This is a very nice camera. I'm very satisfied. I finally feel like I have the power of a DSLR in my hands except that it's much more compact and more like a typical point and shoot. I haven't yet fiddled with the features in the camera as yet, but I've gotten pretty great results so far with the camera in automatic. I wish I knew more about the pancake lens before I bought it; I wanted it badly because it was more compact than the 14-42 mm lens. Of course, the tradeoff was zooming ability. At least you can apply digital zoom, albeit only up to X3 magnification I believe. There also isn't a dedicated button to access the digital zoom. You'll have to go into a menu for that. All in all, I'm very satisfied and hope to start getting acquainted with the features more. And perhaps I'll eventually buy a 14-42 mm zoom lens for it :)", "Date": "May 15, 2013"}, {"Title": "Everything I needed", "Author": "Stephanie R.", "ReviewID": "R3UQHLXSW4YDJ2", "Overall": "5.0", "Content": "This camera was great. I went on a trip to Africa and used it for pictures and video. The videos produced for our ministry turned out sharp and clear. Great price!", "Date": "January 27, 2013"}, {"Title": "Lumix GF-3 with 14mm pancake - Great Little Camera!!!", "Author": "Hector C. Guadalupe", "ReviewID": "R1LFEWIZRJHVEX", "Overall": "4.0", "Content": "This is my first review. I bought the camera about 1 1/2 month ago. This is my step up from point and shoot camera and have to say that the quality of the pictures is GREAT, far better than P&S.; I am still learning how to use lots of the features it has and as of now I like all the ones I've tried. I will update my experience after a few month.", "Date": "June 20, 2012"}, {"Title": "Great Camera, fairly poor (kit) lens", "Author": "Sven Mueller \"versmuellen\"", "ReviewID": "R1IPD3B3YJFN2P", "Overall": "4.0", "Content": "I love the camera but the 14-mm kit lens produces only sub-par photos. To get the most out of the camera, get yourself the 45-150-mm zoom lens, which is very good, and the 20-mm (1.7f-stop) prime lens (and, of course, others should you want them). I use the 20-mm lens all the time, especially at night, when I carry the camera through cities for night photography.Photos taken with the 14-mm kit lens look, I'm sorry to say, as if someone had peed on them; the have a yellowish tinge (certainly not what some enthusiast who gets a Micro 4/3 camera wants or needs). The edges are blurry too. I have decided not to use the 14-mm lens it anymore. The same goes for the 14-42-mm kit lens ... get the body and two or three decent lenses. The camera body should make you happy. It is probably too small for some users (but great for me because I can slip the camera, with the 20-mm lens attached in my pants pocket).", "Date": "February 19, 2014"}, {"Title": "Great camera!", "Author": "steven cale", "ReviewID": "R1LU2G73YAO2HX", "Overall": "5.0", "Content": "very good camera, takes amazing low light pictures. My only complaint is that the manual focus using the lens tube is kind of difficult to use.", "Date": "November 18, 2013"}, {"Title": "Great camera for a first DSLR", "Author": "Sonya Mazumdar", "ReviewID": "R2I59VVP9RBBUF", "Overall": "4.0", "Content": "I was looking for something simple and light - and this camera was a great fit! I love the picture quality and although it takes some time to navigate the features, it's inevitable that there is a time to get used to the camera. Buy an extra interchangable lens if you think you'll be taking close-ups", "Date": "December 27, 2012"}, {"Title": "Great pocket camera replacement.", "Author": "Gabriel Parker", "ReviewID": "RIOAPHZDHLQ2K", "Overall": "5.0", "Content": "This camera makes for a great street shooter. The focus is super fast and accurate. The only things that I dont like are there is no image stability in the body and there isn't a shoe for accessories or flash. A better grip surface would be nice too. It fits in my cargo pocket fairly comfortably. Great camera for gaming/comic conventions.", "Date": "September 16, 2012"}, {"Title": "Cute but obsolete", "Author": "Noirist", "ReviewID": "R7QIBEFBVYRYH", "Overall": "3.0", "Content": "I'd like to purchase a compact camera with better image quality than a DMC-ZS3 in both stills and movies. Initially I thought I'd get a Canon S100, but when this compact camera package (GF3 with 14mm f2.5) with much larger sensor became available for a mere 379, I ordered it. That's 50 less than the S100 and only 76 more than the cost of the lens alone!The GF3 is small, roughly the same size as my DMC-LX3. The menus are well organized and the touch screen interface is entirely usable. It has a dedicated illuminated button for \"intelligent auto\" mode. Pushing this button ensures that the camera is returned to full auto mode with no inadvertently dysfunctional settings buried in the menus. Autofocus is quick, quicker than my LX3.The biggest two problems with this camera are its obsolete sensor and its compromised pancake lens.The GF3 has a three and a half year old sensor and it's hard not to feel cheated when every other mirrorless camera sold today has a better sensor. Even the much smaller CX sensor in the Nikon 1 system outperforms the GF3 sensor in dynamic range and color depth. The GF3 has the lowest DxO mark score of any mirrorless camera ever tested by DxO; it is half as sensitive as the identically sized sensor in my two year old GH1. Taking the same picture using the same lens, the GF3 will be at half the shutter speed or twice the ISO as the GH1. Plus the GF3 sensor is noticeably noisier than the GH1 sensor at the same ISOs. The result in low light is either blurry noisy pictures (low shutter speed and high iso) or extremely noisy pictures (moderate shutter speed and very high iso), unless you use the flash. To get decent low light pictures with the GF3, you'll have to use the flash, and then the GF3 has no advantage over any other compact camera. Outdoors in bright light, the GF3 pictures aren't noticeably better than the pictures from my LX3. What's the point of a larger sensor that doesn't outperform a smaller sensor?The 14mm f2.5 pancake lens is tiny but optically compromised. It's worst feature is vignetting, which shows up as dark edges in your pictures. Many lenses have a small amount of vignetting at their widest aperture, but the vignetting goes away as the aperture is reduced. The 14mm lens has an offensive level of vignetting all the way to f5.6 (more than three stops from its maximum f2.5 aperture).If you're looking for a compact camera that can take decent pictures, I'd recommend a Sony RX100 instead because it's more flexible (zoom lens), more convenient (smaller and no lens cap), and has superior image quality. Don't bother with the next generation GF5 - that has the same obsolete sensor as this camera. If you have your heart set on a small m43rds camera, then I'd take a look at the GX1 which has the better sensor from the G3.", "Date": "January 16, 2012"}, {"Title": "out of date sensor", "Author": "J. Roos", "ReviewID": "R3NTVJZ4497TEQ", "Overall": "4.0", "Content": "This was a good camera when it was released but if you are currently (2014) on the market for an entry into micro 4/3 don't even think about getting a 12mp camera. The most recent sensors are far superior in dynamic range, color rendition, and high oak performance. I would also recommend Olympus over Panasonic for the bodies. Look at the epm2 (or the pricier epm5) if you are looking at entry level but do yourself a favor and go right up to an OMD.", "Date": "March 10, 2014"}, {"Title": "awesome camera", "Author": "kevin", "ReviewID": "R3OWEENFW62FRO", "Overall": "5.0", "Content": "excellent camera. I have the GH1. My wife wanted a new camera.  I wanted her to take advantage of my other lens.  This was a perfect solution.  Got the item with 14mm for $299.", "Date": "January 4, 2013"}, {"Title": "mostly what i needed!", "Author": "AndrewN", "ReviewID": "R2PC7Q255R49D4", "Overall": "4.0", "Content": "The GF3 is a great product for the money. its small and light weight. i wanted more than a point and shoot and i feel the option to upgrade with different lenses will allow the camera to grow with my changing needs. i think its great for one handed shooting but if you want to have two hands on it all the time maybe its not great for you. also i use a wrist strap all the time and not a shoulder strap. the four thirds mount is great, lens options are plentiful. i have found the the fixed 14mm lens it came with, at some close ranges, it will some times fidget between focal points. could be my fault and not knowing the limits of the system. also so far i just shoot in the AF modes. and have not tinkered with most other options.", "Date": "September 4, 2012"}, {"Title": "An In-Between Camera", "Author": "R. Stevens", "ReviewID": "R23PYILLPVG9BF", "Overall": "3.0", "Content": "The Panasonic Lumix DMC-GF3 is more than a point and shoot (PAS) camera and yet not a true DSLR (IMHO).  It has qualities of both as in small size like a PAS and the lens options of a DSLR.  However, I find the GF-3 is not the perfect balance between the two types of cameras.  I own other Panasonic Lumix PAS cameras and the picture quality with them are at 90% (or better) of the picture quality of the GF-3.  I own several Nikon DSLR and find that I have to carry and protect the GF-3 almost as much as the larger cameras.  My Sony RX-100 ( oh, BTW takes better pictures than the GF-3) slides easily into my pocket or carried in the palm of my hand. The few manual options I use on the Nikon are very similar to the GF-3 at a reduced picture quality.  Bottomline is I purchase the GF-3 new at less than $250 and gave it away as a gift to a sibling (who showed up at a family reunion several months later with a cheap PAS).", "Date": "January 14, 2014"}, {"Title": "DSLR like picture quality", "Author": "Dev", "ReviewID": "R3U5X35A3RGAX0", "Overall": "5.0", "Content": "The picture quality is very good. The pictures are sharp. Colors are bright and have good contrast. Love the feature to select the focal point with touch and the type of bokehs it creates is stunning. It does take some time to get used to the menu but is not complicated. All in all a good buy.", "Date": "July 17, 2012"}, {"Title": "Interesting small camera", "Author": "fangleman", "ReviewID": "R2BP0FP7GG2FOA", "Overall": "4.0", "Content": "I have spent a little time with this GF3 & 14mm pancake lens now.  I bought this while waiting for an OM-D.  The deal price was only a few dollars more than the 14mm lens I intended to purchase anyway, so I bought the kit when the Amazon deal appeared for just over 300.Being a Canon SLR shooter the menus are foreign to me.  I am figuring them out, slowly.  The 14mm lens is decent, but not very fast.  As a walk around camera, it would be better with a zoom.  14mm is a bit wide (28mm equivalent) if it's the only lens one has.This won't replace a good SLR, or even a serious P&S; like a G1X.  But it isn't meant to.  I suspect it will be most appreciated by those that want to upgrade their lower end P&S; camera, and want the versatility provided by interchangeable lenses.  Of course, the camera is getting 'old' on the market as I write this.  There are likely better choices out there, but the price for this might be right for many.A comment on image quality:  Since this was an \"extra\" and not the camera I shopped for, I had no expectation on image quality, but I have to say I was satisfied with what I have seen so far.  A little noisy in low light, and a little limited in dynamic range, but overall nice for what it is.", "Date": "June 5, 2012"}, {"Title": "I love the price", "Author": "Cathyhwa", "ReviewID": "RHL9WL6H7ATS4", "Overall": "5.0", "Content": "I get it when it is in a very low price, sending it to my friends as his gift. He loves it very much, and taking a lot of pics of his dearest daughter.", "Date": "August 5, 2012"}, {"Title": "GF3 vs GF1", "Author": "W. Soh", "ReviewID": "RE0B0IQ2DRGLH", "Overall": "5.0", "Content": "My GF3 just arrived.My other cameras are/were:Canon G10 - soldGF1 + 20mm - soldCanon S90 - soldCanon S95 - currentCanon 550D + 50mm 1.8 - currentVery beautiful camera it is.. I like the curves. Some hate it.The GF3 user interface is fantastic. I lost the mode dial of the GF1 but GF3 gave me focus selection point which speed thing back up. Contrast detect is wonderful. I also thought the GF3 UI learning curve is very intuitive.The 14mm 2.5 is not fast enough indoors, resulting in motion blur as GF cameras have no inbody stabilizer and weak ISO performance. However my work around is to use Synchro flash which the camera has.I think the star performer is to couple it with the 20mm 1.7 and shoot at lower ISO - but will result in a narrower view.I don't need flash hot shoe and will only attach pancake lens to this.As a result,.. I'm not missing the GF1 like I used to :).4.5 stars (due to weak ISO).", "Date": "August 25, 2011"}, {"Title": "very good", "Author": "jude", "ReviewID": "R2S0V3YGDV5ZUE", "Overall": "5.0", "Content": "Very good quality. I bought it for my girl friend. She likes it. I can't say anything more. Because I did't play with it.", "Date": "August 5, 2012"}, {"Title": "Nice little camera", "Author": "N. udani \"New Tech lover\"", "ReviewID": "R3MV2IWEU331LW", "Overall": "4.0", "Content": "I am impressed with Panasonic's innovation of virtually no physical buttons and touch screen menu operation.  I personally prefer buttons but this will be some getting use to.  If you have used Panasonic camera's in the past there's should be no issues with its cumbersome menu.  I give it 4 stars for not having some important physical buttons and the same long drawnout menu schema from the past.  Overall a great camera as far as IQ is concerned.", "Date": "August 10, 2011"}, {"Title": "Panasonic customer support is a joke!", "Author": "Zachary Huynh \"Huy Huynh\"", "ReviewID": "R147PFBFKJXFWR", "Overall": "1.0", "Content": "I called and the operator transfer to sale support department, then it hangs up by itself. The only time I reach the department and the representative told me that their department doesnt support sales prior to 11/11/2011 then system auto hang up.Btw, their camera sucks too SD card fail to read after 3 weeks. I tried 3 different SD card 2 from AmazonBasic and 1 from Sandisk..none work. Stay away from Panasonic forever.Bought a TV from them before and it was a so so experience.", "Date": "November 30, 2011"}], "ProductInfo": {"Price": "$699.95", "Features": "12 Megapixel Ultra Compact System Camera\nMicro Four Thirds 14mm F2.5 ASPH Lens\n3.0\" Free Angle Touch Enabled LCD\nBuilt-in Popup Flash\nMultiple Lens Options including 3D Still Lens", "Name": "Panasonic Lumix DMC-GF3CT Kit 12.1 MP Digital Camera with 14mm Pancake Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/41aF0IWJUgL._SX300_.jpg", "ProductID": "B0054YV934"}}