{"Reviews": [{"Title": "Great 4x Balun", "Author": "CEFishingguy", "ReviewID": "R1I0IDX3986RN1", "Overall": "5.0", "Content": "Used these on my CCTV surveillance system and they work extremely well.  I get a very clean picture from the cameras; free of noise, crosstalk or interference.  I'm using a good quality Belkin Cat5E cable in runs up to 100', and the baluns provide quick and easy installation.1/2 of the baluns were screwed to a plywood board located in a central part of the attic for collection of field video feeds. The other 1/2 of the baluns attach directly to the female BNC connections on the DVR. A Cat5E cable connects to each balun pair, and all BNC and 5E connections were labeled for troubleshooting and future expansion.You will most likely need a BNC female-to-female coupler adapter to connect each field end of the coax to a balun input. Amazon carries them in a 10-pack. (You typically won't need the adapters on the DVR end of the coax because the balun has male BNC connectors that connect directly to most DVRs.)I tape over each BNC connection so there is no chance that a coax connection will contact any adjacent connections and moisture doesn't accumulate inside.  A good practice for any CCTV installation.", "Date": "July 6, 2012"}, {"Title": "Great Idea", "Author": "DonSutt", "ReviewID": "R34W5TJ8DWWIZX", "Overall": "5.0", "Content": "This product is perfect for my home surveillance system.  The camera wires run in the attic and it's difficult to get all 8 down to my DVR.  Simply using 4 of these products I was able to put my DVR in another room without having to re-cable the system or drill holes in my wall.  All my BNC cables terminate neatly in the attic and 2 cat5/6 cables drop down the wall and out to the DVR.  Making for a VERY EASY and CLEAN installation.One sidenote, I did have to acquire 8 female to female  BNC coupler adapters for the 2 units in the attic.", "Date": "August 2, 2012"}, {"Title": "Good Product", "Author": "Brad Murphy", "ReviewID": "R167O0VXI3XLYW", "Overall": "5.0", "Content": "These devices are quick and easy to use.  I have been very pleased with the ease of installation.  No wire stripping needed, just plug in a ethernet cable to one side, and the camera coax to the other side.", "Date": "December 27, 2011"}, {"Title": "Attenuation problem", "Author": "Josh L.", "ReviewID": "RZTX17YBXQGTR", "Overall": "3.0", "Content": "I'm running 4 security cameras through this balun. Well, 3 now. Whenever I tried 4 cameras I got horizontal lines running up all 4 channels. Unplug one camera and the signal is crystal clear. Not sure at this point if it's the balun or the Ethernet cable, but I'll update after retiring the wiring a bit.", "Date": "September 13, 2013"}, {"Title": "Balun does the job", "Author": "Kitty G.", "ReviewID": "R16J2XKN3ZMJ1Y", "Overall": "5.0", "Content": "These work great - picture is fine - I bought 2 of these baluns so I could run a 45-foot CAT6 cable from the DVR to the attic.  From there I'll be able to attach 4 cameras with BNC cables to each location. The baluns are perfect - one is attached to the 4 BNC inputs on the DVR (no adapter required), and the second is attached to the camera.", "Date": "April 30, 2013"}, {"Title": "Quad video over CAT5 Cable", "Author": "BobL", "ReviewID": "R1NH6Q3UNGLTBE", "Overall": "5.0", "Content": "I bought a pair of these and they work just great. I used these for carrying just the video for 4 cameras, and not to power the cameras, which are powered at their locations. Easy as pie to use. Not much to figure out, other than the tiny numbers molded into the housing for channels 1, 2, 3, and 4.", "Date": "March 13, 2013"}, {"Title": "Worked great", "Author": "pal251", "ReviewID": "R2Y54VZO50N66T", "Overall": "5.0", "Content": "Not much to say. I extended an existing install of four cameras with balun. Camera quality was as good as original camera cable run.", "Date": "January 12, 2013"}, {"Title": "Great product", "Author": "Wayne", "ReviewID": "R29YGBNDIQ79RB", "Overall": "5.0", "Content": "I install security cameras and this product is convenient when making long runs.  This allows the camera's to terminate at this junction point and continue on through CAT5/6 to a more distant device.  At that device a 2nd one of these breaks up the signal back to 4 to go into the recording device.", "Date": "November 20, 2013"}, {"Title": "This Balun Workes great.  I am going to hook up 4 more CC cameras and will buy this again to do the job.", "Author": "Big Dog", "ReviewID": "R2DQE54XEOGGLL", "Overall": "5.0", "Content": "I bought this 4 Channel Video (BNC) to UTP (RJ45) Video Balun to hook up 8 CC cameras in my shop. The distance was to long to just run the cables I was more than 300' away.  I also bought the  UTP 4 Channel Passive Video Balun Transceiver to hook up to my Zmodo systen and everything worked without a hitch.", "Date": "August 22, 2013"}, {"Title": "4 Channel Video (BNC) to UTP (RJ45) Video Balun", "Author": "Alafia Computers", "ReviewID": "R1M3DQT9EPCXEA", "Overall": "5.0", "Content": "Man I wish I had seen something like this prior.  I only had to run a single CAT5 cable down to the DVR instead of 4 RG6/9 cables to feed my four cameras.  Picture quality is same as before.  Great stuff!", "Date": "March 4, 2013"}, {"Title": "Great Product, fast shipping", "Author": "joel \"JAZZY JOEL PRODUCTIONS \"Quality eve...", "ReviewID": "RPM074R84AG24", "Overall": "3.0", "Content": "quality, fast, will order again /// pro awesome super fast shipping great price to quality ratio. Jazzy Joel Productions will use again ... I found that the wire diagram is not as easy to follow if your not using RJ-45 to RJ 45 IE rj-45 to bare wires... message me for more info...", "Date": "March 1, 2013"}, {"Title": "cat 5 video", "Author": "Gary C. Preston \"Gary\"", "ReviewID": "R3FIUX6X73K62D", "Overall": "4.0", "Content": "Works fine, would recmend for coax saving tool. This is better than runnig 4 cables.Can bring in audio chanels also. Total chanels are 4 .", "Date": "February 28, 2013"}, {"Title": "works great", "Author": "alex Dahik", "ReviewID": "R3LAKE8R2B4YTD", "Overall": "5.0", "Content": "this thing is the best it works great and lets you save sooo much money, i love this thing .", "Date": "February 25, 2013"}, {"Title": "Great solution", "Author": "txcoder \"txcoder\"", "ReviewID": "R33WJWTQJXGJRY", "Overall": "5.0", "Content": "These worked great. All I had to do was connect the BNC connectors and then plug the other into the RJ45 wall jacks. BNC connectors were easy to connect.", "Date": "May 16, 2012"}], "ProductInfo": {"Price": "$11.03", "Features": "The UPT Video Balun supports 4 video channel ( BNC )\nOne UTP Cable to carry 4 Video Signal or 4x UTP to carry 4 Video Signal with Camera Power\nAdopt different signal transmission with excellent anti-jamming ability\nPassive Device ( no power required )\nSize of the Video Balun: 17.4cm long.Approx", "Name": "4 Channel Video (BNC) to UTP (RJ45) Video Balun", "ImgURL": "http://ecx.images-amazon.com/images/I/41PpYfC3T3L._SY300_.jpg", "ProductID": "B0056KLG52"}}