{"Reviews": [{"Title": "Misdirected Expectations", "Author": "RobsFolly", "ReviewID": "R2A9JEOUSXAPCG", "Overall": "4.0", "Content": "I recently acquired both the GF3 and a FH25K point and shoot and was curious which would provide the best vacationer experience. I had damaged my  Casio EX-S5 by inadvertently turning it on while it was in a case and my wife had managed to misplace her Canon PS-A2200 so I needed a point and shoot replacement. I was torn between the Lumix FH25K and the Lumix GF3. I initially thought that since I already had a Lumix G1 and a (somewhat unfairly excessively maligned) Lumix 14-42 kit lens, I might as well give the GF3 body a try, hopefully it might provide better performance than a pure P&S; like the FH25K. Here are my impressions:The GF3 is most definitively a tweener and it's compromises are likely to rankle both P&S; shooters and more advanced enthusiast. With the kit 14-40mm mounted it is too large to slip into ones pocket and too limited in external controls and features to appeal to most enthusiast. I personally really miss having a view finder or a dedicated hot shoe, especially considering the P&S; style, red eye inducing P&S; type flash. The camera body is very small and it is difficult to find a proper grip, I find myself supporting the cameras weight more from the lens than the body, but once one gets past those limitations and learns where all the menu feature controls are, it's a pretty fun camera. It's electronics work well notably the iA setting, the point of focus tracking and the lock feature as well as the depth of field control works pretty well. The touch screen is not as sensitive as one might hope but I see that not so much as a negative because I already inadvertently set features on and off too often accidentally. The menu is pretty intuitive insofar as how the main controls are arranged although there are a few features that I'm still grappling with and others, such as manual focus on/off which appear buried too deep in the menu, the manual setting does not disable auto-focus.Several people have complained about the lack of a dedicated movie mode recording button but that feature is very easy accessed from the menu. The video recording is OK, you can zoom while recording but you pick up a lot of extraneous noise like with most other P&S; cameras. The sound is mono and there is no provision for external mics but realistically, did anyone expect there to be? The image recording quality seems pretty good although I admit that I have not spent a lot of time tweaking and fidgeting with the video features. Still, I think most casual users would be satisfied and especially getting both an interchangeable lens still camera and video camera at a bargain price. I don't however think video enthusiast would be satisfied with the compromises.Curious about several contributors assertions, I tried shooting duplicate photos using my cell phone, (a Samsung Galaxy II), the Lumix FH25K and the GF3. I tried this in several situations shooting approximately eight pictures in each setting. I got some surprising good shots with my cell phone but never did it perform up to the IQ standards of the FH25K or the GF3 although it did surprise me how good of a picture you can get from a cell phone camera. The quality between the well regarded (Leica badged lens) purely P&S; FH25K and the GF3 were not always so clear cut. I don't think there was a single shot where the GF3 did worse and in most shots it was superior although in not so obvious ways, most notably when taking pictures of my parrots, two vividly colorful conures and a radiant green, Severe Macaw, the FH25K did an excellent job with detail and color rendition but in almost every shot the birds eyes were not sharply focused and most suffered significantly from green eye.  The GF3 did an excellent job of holding focus on the birds faces and it's iA seemed to choose a smaller aperture rendering a greater depth of focus with less green eye. In this sequence of about 16 shots, both cameras were set to iA and the GF3 was clearly the winner. Outside natural light shots, general architectural type shots and friends around the table type snapshots were about nip-n-tuck.  If I enlarge the photos looking for something to quibble with there may be a bit more purple fringing (CA) and barrel distortion and a little worse red eye with the FH25K but it's fixed lens zoom has greater reach and it has a greater convenience factor. The touch screen on the GF3 works much better than I expected so I might have preferred the FH27K to the FH25K now that I see the touch screen and program really does provide a P&S; advantage.The GF3 is a fun camera that functions very well. My personal form factor preference remains the Lumix G1 and regard the efforts to make the G and GF models increasingly smaller with totally menu and electronically controlled features a regression but I understand Panasonic's goals and target market. The GF3 really is a nice camera capable of producing excellent results and most of my gripes are about what it isn't instead of what it is and I knew exactly what it was before buying it. I'm keeping it though, both it and the Lumix FH25K.", "Date": "August 23, 2012"}, {"Title": "With the right lens--almost as portable as a point and shoot", "Author": "S. Forler", "ReviewID": "R15E2UXQIK5DYI", "Overall": "5.0", "Content": "After months of reading reviews and news in dpreviews.com I finally purchased a DMC-GF3. I waited a couple of weeks for a good deal in the used-like-new category and got it for $175. I matched it with the LUMIX G 20mm f/1.7 Aspherical Pancake Lens and the Lumix G X Vario PZ 14-42mm/F3.5-5.6 Lens. My goals were the best price/performance and portability.As a former owner of a traditional SLR and I loved the quality of the pictures, but eventually got tired of lugging it around. When the digital point and shoot compacts became small enough to put in my pocket, I bought my first Canon. I ended up with a fine Panasonic Lumix DMC-ZS3 10.1 MP Digital Camera with 12x Wide Angle MEGA Optical Image Stabilized Zoom and 3 inch LCD (Black) when I started reading about mirrorless cameras and felt I could improve my photo quality and still get portability. I finally decided to try the four thirds technology.Reading reviews is a good way to learn but is not a replacement for experience and personal taste. Being unsure of the camera, I chose to focus on the best lenses; I could upgrade the camera later when there was more choice and the technology advanced if I wanted. With less pressure on the getting the perfect camera, I decided there was no better value than the GF3.Is it as compact as the point and shoots? No, definitely not, but with the incredibly small, and fast Panasonic LUMIX G 20mm f/1.7 Aspherical Pancake Lens for Micro Four Thirds Interchangeable Lens Cameras or the versatile Panasonic Lumix G X Vario PZ 14-42mm/F3.5-5.6 Lens for Panasonic Lumix G-Series Digital Cameras (Black), it comes close. The body is about 1/2 inch wider and the same depth and with the lens, about 1 inched deeper. In this configuration it is about 365 grams compared to 220 grams for the ZS3. Incredibly, the size and weight is almost the same with either lens! It will fit in a jacket pocket or very loose jeans pocket and it won't break your neck when worn with a strap.As for image quality and features, there is much written about this. Compared to the DMC-ZS3, it is higher quality, although I got some fine shots with the ZS3 when conditions were right. But with the GF3 you can tweak the settings for almost any difficult lighting situation. You can use the Intelligent Auto modes (IA or IA+) for very nice quality shots or revert to more manual modes for a particular situation. The higher resolution and fine lens quality has definitely moved my photos up a notch.For more controlled photo-taking of wild life, I recently purchased a Panasonic Lumix G X Vario PZ 45-175mm/F4.0-5.6 Lens for Panasonic Lumix G-Series Digital Cameras and am considering a macro lens, although the 20mm does a pretty good job for closeups. These special purpose lenses are much bigger and heavier than two mention above, but when compared with traditional SLR technology they are light-years ahead in size and weight.After a month with the GF3 I can see that without previous experience with an SLR, my learning curve would have been much higher in order to use all the features of the camera, however the IA modes make the transition easier. The big difference between the point and shoots and the four thirds is learning how the lens speed (F stops) and aperture affect the lighting, especially indoors. Don't scrimp on the lens. The lower the f number the better (lets in more light) as it is easier to get shots in a variety of lighting situations. I love the 20mm F1.7 lens for this reason.To get experience with the four thirds technology and discover what is important to me, the GF3 was the perfect answer. So far I have been very satisfied with the camera. But when the time comes to upgrade the camera, the low cost of this investment will make it very easy.", "Date": "October 18, 2012"}, {"Title": "Excellent beginner camera", "Author": "Wendal Weets", "ReviewID": "RC1J15N6WICHE", "Overall": "5.0", "Content": "For those who are ready to step up from a tiny sensor point and shoot, this camera is pretty awesome, considering that its current price is pretty low for a nice sized sensor.My only gripe is with the touchscreen. It's not very sensitive. What I do love about it though is that you can set it to auto mode, and tap the touchscreen on what you want to focus on, and it will focus quickly and take a picture in that one tap. Very clear photos for beginners with the standard kit lens. I use the 20mm f1.7 pancake and get WONDERFUL shots. Beware, though, the pancake lens on this camera isn't as small as it seems. The pancake with cap doubles the thickness of the camera.", "Date": "June 25, 2012"}, {"Title": "Best Digital Camera", "Author": "Brian", "ReviewID": "RS2NQAI241I7", "Overall": "5.0", "Content": "Amazing little camera, especially for the size. I have nothing but good things to say about this, especially given the quality and size. This is now my main shooting camera, having replaced my Canon T3i Rebel.", "Date": "March 16, 2012"}, {"Title": "Small Size Convenience", "Author": "C. Wehner", "ReviewID": "R1X4W1REBD1O11", "Overall": "4.0", "Content": "I already have the smallest DSLR in the Panasonic Lumix G3, but this is even smaller. Combine it with a pancake lens or as I did with the much more reasonable priced Sigma 30mm 1:2.8 lens and it easily fits inside a jacket pocket. I have been surprised at how bright the touch control LCD screen is even in daylight which has always steered me away from a camera without a viewfinder. The camera also has some nice features such as Defocus and night Scenery mode.Overall I'm very pleased with this camera, it might even replace my DSLR.", "Date": "January 19, 2014"}, {"Title": "Great Camera", "Author": "Alaskan Sprite", "ReviewID": "R2F3JU981MO81D", "Overall": "5.0", "Content": "The Panasonic Lumix DMC-GF3 12 MP Micro 4/3 Compact System Camera with 3-Inch Touch-Screen LCD Body Only (Black) has so far been great. I am not a manual camera expert so the Intelligent Auto setting has been awesome, and I can work my way up to setting it manually as I learn to use it.", "Date": "October 23, 2013"}, {"Title": "Fantastic, and huge CCD.", "Author": "Wesley Bowman", "ReviewID": "R2YPRTLVFD8FSC", "Overall": "5.0", "Content": "I am using this for scientic research, and it is exactly what I needed. No lenses to get in the way of the very large CCD. 4016x3016 pixels as well. Great product!", "Date": "September 19, 2013"}, {"Title": "Great Little Camera", "Author": "Erle Wright", "ReviewID": "R1YVWG82E5DT48", "Overall": "5.0", "Content": "This camera is compact, easy to use and takes excellent pictures. I certainly do not regret purchasing it at all.", "Date": "September 16, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "12 Megapixel Ultra Compact System Camera\nMicro Four Thirds 14mm F2.5 ASPH Lens\n3.0\" Free Angle Touch Enabled LCD\nBuilt-in Popup Flash\nMultiple Lens Options including 3D Still Lens", "Name": "Panasonic Lumix DMC-GF3 12 MP Micro 4/3 Compact System Camera with 3-Inch Touch-Screen LCD Body Only (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Y8Vid0xzL._SY300_.jpg", "ProductID": "B00554Z9G6"}}