{"Reviews": [{"Title": "Snorkelling Fun To Share", "Author": "BH", "ReviewID": "R2CU3O7VKC7TVJ", "Overall": "5.0", "Content": "I got my new camera a while back and soon after was on my cruise to the South Caribbean. I snorkeled at Aruba and Curacao. Friends and family loved the still shots and video from above and below the ocean surface. Everyone was asking, \"these pictures were taken with same camera?\". People like being able to hear the underwater sound the microphone allows. I didn't figure this out at first but if you haven't used an underwater camera before here's a warning; get the camera underwater and give it a shake to get the bubbles off the lens before taking pictures or video. I played with some of the settings and took underwater, night, flash, above and below video, and pet face recognize shots.I'm getting certified for SCUBA diving now. I will take this camera with me SCUBA diving but will have to watch how deep I go since it's depth limit is about 33ft. I loved the package I bought. It has everything and more that you will need. The only thing you might want to add is a faster SD card if you plan on taking a lot of video on it. It comes with a class 4 card but the high speed class 10 card does video better. Olympus TG-810 14 MP Digital Camera (Black) (228100) 16GB SDHC Super Accessory Saver Kit", "Date": "August 16, 2012"}, {"Title": "EXACTLY WHAT I EXPECTED", "Author": "K. Trai Masters", "ReviewID": "R2Z3SSUFB2DZ0I", "Overall": "4.0", "Content": "I bought this as a gift for my fiance and I have played with the camera in order to better answer his questions about the device.This package came with every item that is needed for a rugged camera. It is durable and definitely water resistant as long as the door is closed completely. I have read many complaints on having the charging port on the inside of the door. I have not found this to be an issue as I do not charge it out of the house or vehicle. This set also comes with an external wall/ car charger for the two batteries that come with it. The cameras batteries do run a bit quicker when the GPS feature is turned on but I would expect that out of a device that is constantly searching for active satellites. The GPS does take about 5 minutes to connect to a satellite but once connected I haven't had an issue.I am an avid \"hobbiest\" photographer and this camera offers everything I could want as far as \"point and shoot\" camera's go. It is also pretty friendly to those who are looking for a basic outdoors digital camera. One of my favorite features is the panorama. The only down side I have is that it is slow to take a photo sometimes. I do a lot of wildlife/ nature/ sports photography and it usually requires a faster shutter time to get the shot I would prefer.But, as said before, I bought it for my fiance to take to the woods with him and I would rather him take something more rugged and dependable with the terrains he ventures to. I have learned to just shrug off the two second laps in shutter time.If you are looking for a rugged camera and do not mind waiting two seconds to take a photo then this is a great buy! Ours has been wet, dropped 5ft, drug though mud by our pit bulls, slobbered on by toddlers and is still working like a charm!", "Date": "January 17, 2013"}, {"Title": "Great camera", "Author": "Sheila Posterick", "ReviewID": "R1W85L1UR8CK10", "Overall": "5.0", "Content": "I love the camera. The Olympus battery is ok. It dies quickly. The other two batteries die very quickly. I will be looking for different batteries. The camera case is cheap. I threw it away. I would just buy the camera and extra batteries. The charger and memory card is a must. It takes wonderful pictures. I just need to figure out how to take pictures at night. This is worth the money.", "Date": "December 10, 2012"}, {"Title": "Best underwater point and shoot ever!", "Author": "Kobedog84", "ReviewID": "R308MSRZDXUV5R", "Overall": "5.0", "Content": "I bought this camera for a trip to Belize. Thus thing works great everywhere!!! Great for underwater photos and photos anywhere else! Love this camera!!!", "Date": "November 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Waterproof: A revolutionary system of waterproof seals and gaskets keeps water out so you can take pictures as deep as 33 feet underwater\nShockproof: Durable metal body with an innovative shock-absorbing technology protects it from drops of up to 6.6 feet\nFreezerproof: It's Freezeproof down to 14deg. F/-10deg.C. Perfect for skiing, snowboarding, sledding and other winter fun.\nCrushproof: With its rugged body and reinforced LCD, the TG-810 is designed to withstand up to 220 pounds of pressure\nGPS: Record landmark data in your image; This camera is winterized to perform at below-freezing temperatures.", "Name": "Olympus TG-810 14 MP Digital Camera (Black) (228100) 16GB SDHC Super Accessory Saver Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51WQFTaiPWL._SY300_.jpg", "ProductID": "B005HPZUU8"}}