{"Reviews": [{"Title": "Excellent DVR and Remote Video Surveillance System", "Author": "David Wright", "ReviewID": "R3FQ1GHSRNB176", "Overall": "5.0", "Content": "I reviewed many systems online before deciding on this one and I'm very happy with the purchase.The main things I like are the following:- Remote viewing via the PC or an Android PhoneMany have this feature but not all have the ability to use an Android phone so this was important for me.  The remote viewing is quick to open and updates smooth on either device via local Wi-Fi or remote viewing via 4g on my EVO.  The image is very good as well with the ability to view four cameras at once on the phone or all on the PC.  You can also setup multiple locations to view remotely on the device and switch connections easily which is also important since I plan on getting another system at my house to view on my phone.- DVR BoxThe casing is solid and compact, the ports are well labeled and all connections fasten securely.  The software is the heart of the DVR and it has all the main features that I need  and they work well.  Multiple user support, continuous record or motion activated record to save on disc space, viewing locally via a VGA port or locally/remotely via PC/Handheld , PTZ control and camera audio support, replaceable hard drive and simultaneous viewing of all cameras at once or being able to show only one on a full screen.- CamerasThe camera resolution during the day is good quality for general viewing and monitoring.  If you want detailed images from a distance, viewing facial images or a license plate for example, you will have to purchase a camera with a higher mm lense or zooming capabilities.  I'm using these for outside monitoring up to 125' feet away so if you're using these at close range, 20-35 feet, the resolution detail should be good enough.  The night vision is good enough to see general detail as well.  I have several street lamps and lights shining nearby and I'm still able to get decent images.  Under good lighting and angle conditions at night, you could probably get good detail within 15 feet and monitoring within 65 feet as stated.- Bottom LineIf you need a reliable system with remote viewing and general monitoring of a location with a flexible DVR system and good general cameras, this is an excellent buy.", "Date": "January 24, 2012"}, {"Title": "Works Great For the Money", "Author": "Macs007 \"Watcher\"", "ReviewID": "R3QREDBO60C7IJ", "Overall": "5.0", "Content": "Set up was easy, tech support was readily available and helpful.  I was amazed at all the possible adjustments and programming options. Unit came with all cables and a 1 terabyte hard drive.  Wish camerashad better resolution  but for a low end unit, we now have the protection weneed for our business.", "Date": "March 4, 2012"}, {"Title": "john", "Author": "john", "ReviewID": "R1DG4YXZXENQ5V", "Overall": "4.0", "Content": "very good system for the money, cameras or good enough, however, if you are looking to read plates or details, than you need to spend more money", "Date": "July 1, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0054RB7HY"}}