{"Reviews": [{"Title": "Great camera. Versatile starter lens.", "Author": "A. A. Mom", "ReviewID": "RGIJS0E1BPOTH", "Overall": "5.0", "Content": "I have used and enjoyed this camera immensely. Initially purchase based on review on Amazon and elsewhere. Sports mode is great for capturing motion. I use it more for shots of animals than sports. I have gotten some great shots that way.  My daughters have envied me and I bought this package for each of them for Christmas. The price of the camera, card and lens separately is greater than the package. The case is OK for a starter but not as pictured. It is gray, the sides are not very padded and there are no side pockets. It was a bit disappointing.The extra batteries and charger are a nice bonus. Overall worth the price; you can't go wrong with this purchase.", "Date": "November 29, 2012"}, {"Title": "Exceedingly Happy", "Author": "C. E. Sawyer", "ReviewID": "R10X3EIRQ9YVN3", "Overall": "5.0", "Content": "So I researched the different packages (offered on Amazon) for a few weeks. This one was my final choice, I made it for a few reasons: It offered the 18-135MM IS lens, which by itself worth way more that the 18-55MM, offers great stability and zoom capabilities. This package also includes a second battery with a second quick charge charger (and an car charger). The memory card offered was 32GB (not the 16GB offered in other packages).I originally intended on buying just the body of the camera, but when I saw the packages did a complete about face. I spent about $300 more for the package, but got over $1,000 of accessories that came with it.For the non-professional: If you have one of the Canon Rebels, and have issues with low lighting causing blurred images; this solves that with a more inclusive auto-ISO feature. The photo's are really amazing, I started playing with the camera the moment I unpacked it (late evening, low light) and was blown away at the clarity; I took a few images of my cat sitting in front of the fire (only light source) and it came out crystal clear. I love it!!", "Date": "November 27, 2012"}], "ProductInfo": {"Price": "$1,199.95", "Features": null, "Name": "Canon EOS 60D 18 MP CMOS Digital SLR Camera with 3.0-Inch LCD and 18-135mm f/3.5-5.6 IS UD Standard Zoom Lens W/32GB SDHC Memory +2 Extra Extended Life Batteries + Ac/Dc Rapid Charger + 3 Piece Filter Kit + SDHC USB Card Reader + Shock Proof Deluxe Case w/Strap + Full Size Tripod + Memory Card Wallet + Mini Tripod + Accessory Saver Bundle! !.", "ImgURL": "http://ecx.images-amazon.com/images/I/51FymO6qlBL._SY300_.jpg", "ProductID": "B006959YF2"}}