{"Reviews": [{"Title": "Mostly satisfactory", "Author": "Water sprite", "ReviewID": "R1B0DACTC12LLD", "Overall": "4.0", "Content": "I purchased the XP100 specifically to take on a 14 day snorkel trip to Cozumel. Yes, moisture gets into the camera. I notice water around the seals of the battery/memory card compartment, and sometimes behind the view screen. I've never had water in the lens assembly though. The camera is still functioning perfectly and taking outstanding pictures and videos. Some of the videos were so breathtaking I wanted to watch them on my 42\" HDTV, so, I ordered the HDMI cables to connect the camera to the TV. At first I was so disappointed because all the camera information that you see during playback on the camera was also on the TV screen, and it was SO BIG that it obscured a lot of the picture and was extremely annoying. The instruction manual was no help, and I got no answer from Fujifilm when I sent them an email asking if there were a way to turn the useless camera data off. I finally played with all the buttons and found that after you connect the camera to the TV and turn the camera & TV on, push the Disp/Back button and it will take you to a screen on the TV where you can turn the Information feature off. Problem solved and I am a happy camper...or should I say a happy snorkeler. For now, I am storing the camera when it is not in use in a plastic bag with a couple of packets of those moisture absorbing silica beads and every so often will treat the rubber seals around the battery chamber with silicone grease (very carefully and sparingly) and hope the camera continues to record wonderful underwater experiences.", "Date": "June 5, 2012"}, {"Title": "Mixed feelings", "Author": "Min-Hong A Hsu", "ReviewID": "R3H1BLQO6GFH57", "Overall": "3.0", "Content": "I was surprised there was not much review on this model a week ago.It was right before my school fieldtrip to Catalina Island.  Between Go Pro and other waterproof cameras, I was reading reviews on several models, and decided to give this XP100 a shot.Since there was almost none reviews on this new series (XP50, XP100, XP150), I was reading reviews for previous models (XP10, XP30) and hoping Fuji would make some improvements.My major concern was the battery life. Many older reviews mentioned that the model with GPS feature would drain your batteries, and XP50 comes with a battery that allows you to take around 222 shots.  So I decided to choose XP100 which is the one does not have GPS (which I don't need it and won't kill my battery too soon) and has a longer battery life (around 333 shots per cycle, please check offical website for detail).The second concern was the waterproofing feature.  Many reviews indicate this series doesn't do very well in waterproofing.  So when I first got into the ocean, I was not sure if it is really waterproof.  The result was, it survived the first two snorkelling and one kayaking.  I was able to take photos and vedios in the water, and everything was okay after four days of use.  The only thing I notice was when I open the battery door, there was some moist inside the compartment where the seal was when it's colsed, but the top of the SD slot and battary were dry.  I did not expect that but the camera has been okay.But funny thing started to happen on my last day of the trip on the island.  It was a sunny day, and after half hour of shooting vedios on land, I found moist inside the monitor and lens.  It took me a while to let the moist dry out so they are not affecting my shooting.  I had to let it sit under the sun to speed up the evaporation.I like the quality of the HD video, maybe because this is my first camera that can take HD videos, especially when I was shooting videos outdoors under the sun most of the time.  Underwater videos are clear enough and battery seemed to last longer than I expected.  I went on a 30 - 40 minutes snorkelling and kept shooting vedios.  The battery showed low at the end but it still took videos for a while.  When switched back to camera mode, it actually could still take a lot of photos.And as other reviews mentioned, this camera does good job outdoors with good lighting.  I did have several good photos outdoors, but when it is dark such as indoors or at night, you don't expect it will do a good job.For me, this camera served the purpose because I needed it to take photos of my students doing water sports and outdoor activities. I probably won't use it too often in the water but I don't need to worry about it getting wet in the rain and get damaged if my students dropped it.  This will be my class camera in the future, but not for myself.", "Date": "April 28, 2012"}, {"Title": "Loved the Fujifil FinePix XP100", "Author": "Rene Edwards", "ReviewID": "RJ7Y1LG3OJSQ7", "Overall": "5.0", "Content": "We purchased this camera for a 7 trip to Grand Cayman.  I was a little cautious because some of the reviews indicated that water got into the camera.  Given the features and the price, we thought we'd give it a try.  We ended up absolutely loving this camera.  My Canon Powershot died mid way through the trip so this became our primary \"everyday\" camera. We used it both in the water and out.We did lots of snorkeliing and I thought the pictures under water were great.  They weren't professional grade of course but the best underwater pictures we have taken.  (We've tried an underwater film camera and a putting our digital camera in a special underwater camerat bag).  The underwater video was also great.  The camera was easy to use underwater - in all aspects - easy to turn on, easy to focus, easy to video.We also used the camera out of the water.  On several occasions we took sunset pictures with both my Canon Rebel and Fujifilm FinePix XP100.  The coloring was very similar.  It did a great job of capturing the beautiful hues of the sunset and the amazing colors of the ocean waters.We never had any trouble with getting water inside the camera.  It has a special sensor that alerts you if you don't get the battery cover closed properly.  There are 2 latches and both must be closed securely before it will let you take a picture.I highly recommend this camera for the money!!", "Date": "August 2, 2012"}, {"Title": "This camera is not reliably waterproof.", "Author": "SE Gatz", "ReviewID": "R17KWNFK4KQETW", "Overall": "1.0", "Content": "I purchased this camera despite some of the bad comments about it failing to resist water.  I took it snorkeling for a day, never exceeding 5 feet in depth and it worked fine.  A couple of days later I had it in a kayak barely in the water (sitting in the cupholder while I was moving) and while recording video I accidentally turned the unit off.  It would not turn on again.  When I got into the hotel room I opened it to find water in the batter/memory compartment.  I know, because I was cautious based on the reviews I had read, that Fuji would claim negligence on the operator that I had closed both of the latches.  As a design engineer I respected their position so was very cautious.  Note that the label for the latches comes off when wet.  Fortunately, I also purchased the warranty, I'll have to see how the return/replacement process goes.  I'm not really interested in a replacement that will not withstand getting wet though.", "Date": "April 26, 2013"}, {"Title": "Keeps the water out", "Author": "dconstructionx", "ReviewID": "R3RM0678H6IAIA", "Overall": "4.0", "Content": "This camera does what it promises, you can use it in the water! I took this to my trip to Hawaii and was pleased with the photos and videos it took while snorkeling. Just be aware that you need plenty of light and CLEAR water. Even if the water is a little bit cloudy you won't be able to capture subjects more then 1 ft away. I think this is true of most underwater photography, however. The beach mode was good at keeping photos from being washed out from bright sand in the background and the sunset mode created a cool effect for some sunset beach photos I took in Waikiki. The only thing I would improve is to have some kind of cover for the lens shield. I'm paranoid that It'll get scratched and ruin every photo. Also be sure to wipe any water/sand off the plastic in front of the lens when out of the water or it'll show up in every photo.", "Date": "September 19, 2012"}, {"Title": "Died after 3 days", "Author": "Honeymooner", "ReviewID": "R16O7081SOCAJA", "Overall": "1.0", "Content": "Researched and decided this sounded like the best choice for our needs.We were honeymooning in Jost Van Dyke BVI and planned to Snorkel every day and get great underwater shots of all the fish and coral.Unfortunately the camera DIED after only 3 days of use, due to water getting past the seals!It is rated for 30 feet, but ours did not survive 5 feet!!!What a disappointment!We were very careful to limit the time underwater, and ensure that no sand got on the seals, as well as locking BOTH latches when changing the battery. (done indoors in clean, dry environments.)While it was working the first day (above water), the pictures were great, but after two days of intermittent use in the water it DIED.We never really got more than basic shots underwater, as the serious snorkeling didn't start until later in the trip.Had to rely on a cell phone camera for land only pictures of the rest of the honeymoon.Very, Very, Very disappointed in this camera.Not what we expected for the money.", "Date": "June 6, 2012"}, {"Title": "not hate but just disappointed", "Author": "Ron Chadick", "ReviewID": "RAM5O6W5WZOHY", "Overall": "1.0", "Content": "I bought it for a week trip to the Bahamas and after 3 days filled up with water.I am positive I had it closed up properly but there is obviously no way to prove it.  I figure that they will not exchange or return.I have always admired Fuji and it did appear to be a very nice camera.Ron", "Date": "April 21, 2013"}, {"Title": "So-so picture quality (sadly)", "Author": "Charlie B", "ReviewID": "R1B1GXAS6QFNX5", "Overall": "2.0", "Content": "I got the XP100 to replace an old Olympus Stylus \"Tough 790\" that was stolen.I had high expectations of picture quality that would exceed the Olympus, which was close to five years old.  After all, the Olympus was 7.1mp while the Fuji was 14mp, sensor technology has improved, meaning lower noise, and better lenses are being designed into more modern cameras, to compliment the better sensors.The XP-100 has none of that, and the old Olympus made images with far better overall quality.My main disappointment is the heavy handed, and non-adjustable, softening from the use of noise reduction.  There is an almost \"painted\" effect.  Solid blotches of color, where fine detail ought to be.  This occurs even at ISO 100, right through ISO 3200 (which you'd expect).So, potential purchasers are reminded - its not the number of pixels, but the QUALITY of the pixels that matter.The Fuji XP-100 is lacking in that regard.But for some good points too....Even with mediocre image quality due to noise reduction softening, the lens does very well for itself.  The exposures I've made have all been well exposed.  I've used the camera in low light without flash, and with flash, and exposures are better than I expected.  There is a super-automatic mode that works amazingly well, controlling face detection (or not), macro (or not), flash (or not) and even choosing a specialized \"scene mode\" for the user, as it sees fit.  This feature does in fact work very well, but does use up the battery just a little more due to face detection hunting.  If you don't need to stretch the battery life, this is a nice feature for folks who don't really want to fiddle with things, but just get a focused, well exposed, snapshot.One feature I like too, is that the XP-100 allows you to take B&W; or Sepia shots continuously, without having to convert each one after the fact (something the Olympus didn't do).  The macro mode is very nice, but sometimes doesn't focus well - even if you're within range.  Its not a \"super macro\" but gets the job done for objects about the size of a men's wrist watch (or slightly larger).The movies are also amazingly nice.  I'm not a big fan of movie clips from small cameras, but the few clips I made as experiements were well exposed, \"ok\" in sharpness and focus, and clear and snappy looking.  I also tried shooting a test clip at a distant scene then panning to a close up object, and the camera tracked the focus perfectly.  I like that!There are reports abounding of underwater failures from the XP line of Fuji cameras.  I do not plan on taking my camera underwater.  Instead, I got it (like I got the Olympus) so I could take it motorcycling (rain use), or use it for work (wet, but not submerged conditions).  At the beach, getting wet or sandy should be no problem, except that sand IS scratchy to lenses and displays.Speaking of which - the display is nice and bright, one of the better ones.  None are great outdoors, but the Fuji XP-100 does well in that regard, when compared to any other small camera or phone I'd used, or even pro level Canon SLR cameras I've used.  There is also a display brightness booster button on top of the camera, handy!  The display is very detailed as well.There are nice features, and good build quality (it feels solid too), but cameras are all about image.  Thats why we get them.  The images produced from the Fuji XP-100 are sub-par for cameras using today's technology.  They are only a step above the images from my LG Android phone, and thats why its getting a two star rating.  Image quality of this level should be from a $59 camera.I'll be keeping the XP-100.  I'm not going to hassle with returning it.  For the use I'm going to give it, its going to do fine, but I would not urge a friend to get this camera.", "Date": "October 4, 2012"}, {"Title": "tough camera", "Author": "Hao Yan", "ReviewID": "R2W49TB1FXQEGM", "Overall": "4.0", "Content": "I bought this camera for a trip to Hawaii mostly because of its price. There aren't too many options out there for water proof cameras that take 1080p video and has large LCD viewfinders, all for under $180.The battery life is excellent. During my 7 day trip, it never ran out on me during the middle of the day and I took plenty of pictures and videos.I went snorkeling and kayaking on 3 separate occasions and took the camera down maybe 6 ft under water, banged it on corrals a few times by accident, left some scratches on both the plastic and metal exterior, but there were no leak or moisture inside the lens, LCD, or the battery compartment. At the end of the day I just soak and rinse the camera in tap water as instructed in the manual.The picture quality isn't great, some of the pictures actually look no better than pictures I took with my cellphone. But I kind was expecting it so it wasn't too big a let down.It also lacks manual adjustment to things like shutter speed, exposure time, or white balance. But it does provide quite a lot automatic moods, ranging from panorama mode where you can specify field of view and just scan the scenery on the fly (useful), to several underwater video mode (decent), to taking self portrait of 2+ people based on proximity of faces using face recognition (funny but doesn't work well).Minus 1 star for the unspectacular picture quality and lack of manual settings, 4 stars for the toughness and the price.", "Date": "August 12, 2012"}, {"Title": "Very satisfied with performance", "Author": "Barton Zweigoron", "ReviewID": "R3D625O81ESJVP", "Overall": "4.0", "Content": "I purchased this item on impulse before a week long whitewater kayaking trip that I wanted to document and have been pleasantly surprised with how well its worked for that purpose.The camera got clipped into a pocket in my life jacket and I would pull it out at the base of a rapid to take pictures of my friends as they came though. During the week it spent a significant amount of time submerged as well as taking a couple decent bumps off or rocks or boats as I scrambled around trying to get a better vantage point and was no worse for the wear from it.The camera would turn on and be ready to take pictures in just a few seconds so I did not miss many moments due to warm up time and the lens handled me hastily wiping the water off it with a finger or shirt sleeve without leaving obvious water smears on the photos.Some pictures did come out blurred, but I think that's unavoidable given the circumstances of shooting from a small boat in choppy water. The large majority of the photos turned out acceptably crisp and of acceptable quality.I am not giving it five stars as it does not take quite as high quality pictures as other (slightly more expensive) point and clicks that I have used in more traditional environments, but I think that the tradeoff in image quality for durability in extreme environments and affordable price point is well justified.As an inexpensive point-and-click that you can be rough with I think this camera works exactly as advertised.", "Date": "July 17, 2012"}, {"Title": "XP100 Camera", "Author": "Joe Cangiolosi", "ReviewID": "RTVJ61C86A2A0", "Overall": "5.0", "Content": "Very pleased with the camera, bought 3 and use them in a plant.  the guys like it a lot.  Great price.", "Date": "July 22, 2013"}, {"Title": "review", "Author": "paris1126", "ReviewID": "RSNM4KOB46CV0", "Overall": "5.0", "Content": "the price is good with very nice quality. fujifilm always gives you unfamous but excellent products, eg f31fd, s6500fd, always my first brand to see", "Date": "July 20, 2013"}, {"Title": "Mine wasn't waterproof", "Author": "jwillum", "ReviewID": "R3T1JKCY51A0IU", "Overall": "1.0", "Content": "Bought this camera for a cruise we were taking and it leaked the first time I went snorkeling.  Never went below 6 or 7 feet.  On the other hand, my brother bought the same camera and his was fine  I had to buy another camera onboard the ship.", "Date": "August 26, 2012"}, {"Title": "Broke first water trip", "Author": "Meredith Stokes", "ReviewID": "R1LCEFEC9PB86J", "Overall": "1.0", "Content": "Followed all instructions and when I got in the ocean it took 2 photos and died. Literally made choking sounds and died. Let's see if they honor my warranty.", "Date": "January 7, 2014"}, {"Title": "Awesome", "Author": "Joe McCarthy", "ReviewID": "R1SX9JUUE91DW5", "Overall": "4.0", "Content": "Its been almost a year since I purchased  this camera and its still working great after my Maui adventure from 20 ft. under the warm ocean to 10,000 up on Haleakala creator in freezing rain for hours. I will say this camera does not love salt water I have a smudge like mark that won't come off but no affect on its use.", "Date": "January 4, 2014"}, {"Title": "MAJOR FAIL", "Author": "Kristen", "ReviewID": "RJC5XAWFQN3DV", "Overall": "1.0", "Content": "I bought this camera, because I am admittedly hard on technology. I need lifeproof cases on everything. But that it why I thought this camera would be perfect. I bought it for a 2 month study abroad in Costa Rica, assuming this would be a perfect camera to take to the beach and be up for all the outdoor activities I would be doing. I was wrong. My VERY FIRST weekend, I took it the beach. I maybe got 10 photos of that day. I took it into the water and was just wading along the shoreline when it started to glitch. The battery/sd card area was soaked with water. The bummer is that it was working at home when I did test shots in my bathtub (when I was still within the dates to return it) Needless to say, it was quite a disappointment and I was left point-n-shoot cameraless for the rest of my trip. I missed out on two months of photos to remember an amazing time in my life, because this camera does not operate as advertised.", "Date": "August 14, 2013"}, {"Title": "Fujifilm XP100 - let me down", "Author": "T. Rather", "ReviewID": "RJ3129NYPOT5", "Overall": "1.0", "Content": "I purchased the XP100 for our yearly vacation to Cabo.  I was so excited to use it and share our snorkeling experiences with family and friends.  The first day I entered the Sea of Cortez and started shooting video, in no more than 10 feet of water.  Within 45 minutes I noticed condensation around the perimeter of the display, so I took it out of the water, opened the side door, which had condensation inside, and let the breeze dry it out, which it appeared to do, but that was the end of my video shoot.  The second day I entered the water and once again saw the condensation starting around the perimeter of the display within 30 minutes, and after I took it out of the water I noticed condensation on the lens also.  I aired it out the rest of the day and again lost precious video experiences.  By the 3rd day, the display kept turning off, so I basically couldn't use it any more.  There is a definite problem with the sealing system, and the 2 step lock does nothing IMO.  I would think I would get it replaced under warranty, but it will be another year before I have any reason to use it, and if it leaks again, the warranty will be expired.  This camera may work for other uses, but it appears the \"water-proof\" feature is worthless.  And that's why I only gave it one star.", "Date": "August 11, 2013"}, {"Title": "Not good at all", "Author": "Jimena Ballí", "ReviewID": "R28C26KECDVNQ", "Overall": "1.0", "Content": "I just got this camera, used it in a pool and at 3 meters and it got all soaked. It broke down and of course it's not working and never worked as announced. I'm looking forward for my guarantee", "Date": "June 29, 2013"}, {"Title": "Piece of junk. Do not buy.", "Author": "Jeff Wallace", "ReviewID": "R1P6H2FBAIBA0F", "Overall": "1.0", "Content": "We purchased two of the Finepix XP100 cameras for a trip to Hawaii. After about 30 minutes in the water at a maximum depth of about 4 feet, both cameras leaked!!One camera was completely destroyed and non operational and the second shows signs of internal damage.We were extremely careful and made sure that the battery / memory card door was closed and secure, as the directions outline, but both unites failed.It appears that Fuji knows about this design problem as their new XP waterproof models have a completely different locking / sealing mechanism.I will now try to get Fuji to fix / replace these units.I certainly hope they will be willing to stand behind an obvious defective design.I see that many others have had this same problem.If I could give a minus star rating, I would!!!Heed the warnings!!!!!DO NOT BUY!!!!", "Date": "June 22, 2013"}, {"Title": "Camera stopped working", "Author": "Shreta M Shah", "ReviewID": "RBRVIYKSOC30D", "Overall": "1.0", "Content": "We bought the XP100 for our trip to Mexico and used it while snorkeling. On the 3rd day of our trip  the display stopped working and on the very next day the camera stopped working. After we were done snorkeling we saw that there was water in the LCD and the battery and memory slot was damp as well.We returned the camera.", "Date": "June 20, 2013"}, {"Title": "Broke in the middle of vacation after 3 days", "Author": "crai6b", "ReviewID": "R2O6SEH9UF7P9X", "Overall": "1.0", "Content": "Should have listened to previous reviews.  Camera broke in the middle of our vacation after 3 days. Water seeped into the battery compartment.", "Date": "April 26, 2013"}, {"Title": "Not so waterproof", "Author": "Adam B. Coppolo \"Brett C.\"", "ReviewID": "R2RNZJ5IR6KFVS", "Overall": "1.0", "Content": "We purchased this camera for a trip to Jamaica and while the camera was out of the water, the pictures were great. The first attempt to use this camera even a few inches underwater, we got one picture and the camera was rendered completely useless. The battery door was secured properly and both latches were in place when we brought it into the water. Day one and we were already resulting to having to purchase overpriced disposable Kodak water cameras (which after seeing the pictures developed, I highly recommend against as well).I might recommend this camera for someone that may experience a slight splash of water here or there but for anyone intending on using it to take pictures underwater, avoid this camera. Do yourself a favor and find another camera but make sure to pay close attention to the other reviews for whichever camera you are looking at to ensure that water resistance is not an issue with that camera as well.", "Date": "April 23, 2013"}, {"Title": "No good", "Author": "Martha Wilcox", "ReviewID": "R838KF9JXOAIY", "Overall": "1.0", "Content": "It leaked and died while I was snorkling.  Followed all the directions to seal it correctly. Too late to return it.", "Date": "April 14, 2013"}, {"Title": "Faulty door ruined my camera.", "Author": "Mommy of one", "ReviewID": "RCE8FOBYI1Q1K", "Overall": "1.0", "Content": "I bought this camera before my wedding and honeymoon in Hawaii. We went snorkeling and the back door opened up under water and ruined the camera. The door popped open and we had to search for a new camera which took time away from our vacation. This camera was great until we got underwater, then the fun was over. I wouldn't waste your money.", "Date": "April 8, 2013"}, {"Title": "unsatisfied customer", "Author": "Harry E. Haney", "ReviewID": "R2VRY9NNNQUCXA", "Overall": "1.0", "Content": "I used it one time,on the  the second time it filled with water and died! so I sent it back!!", "Date": "February 27, 2013"}, {"Title": "Stopped working", "Author": "jeremy", "ReviewID": "R2YIKH3G0ZWWHV", "Overall": "1.0", "Content": "I bought this camera specifically for a 2 week vacation to the caribbean. After a couple trips to the beach the camera stopped working and I could see condensation inside the lens and on the screen.The seals were shut properly and I took all recommended precautions. In total this camera lasted 9 days. I should've gotten a gopro.", "Date": "February 21, 2013"}, {"Title": "This camera takes nice pictures, but don't take it into the water", "Author": "Michael Carey", "ReviewID": "RWKZWJCKM1SQE", "Overall": "1.0", "Content": "I took a couple of pictures before going on a trip.  Those pictures came out very nice, but when we went snorkeling, the camera failed almost immediately.  As I had a previous experience with \"waterproof\" cameras failing, I was very careful about making sure the access door was sealed according to the manual.  It failed when in use only two feet deep.  I was quite upset with the performance and am not looking forward to receiving the same camera as a replacement under warranty.The Nikon AW100 worked well throughout the trip.  Glad that I bought two different cameras in case one failed!", "Date": "April 4, 2013"}, {"Title": "Best Point and shoot I have ever owned", "Author": "John F. Ludwikowski", "ReviewID": "R3TML333QH5FWH", "Overall": "5.0", "Content": "I have taken this camera out fishing, in the down pouring rain, given it to my wife and all of my kids (4-11 Years).  This camera has been through more than any other point and shoot we have had and it is still working.  Before this camera I was buying a new one every 3-6 months just from it getting nocked around in my wife's purse.  I was always scared to take them out camping or fishing and never would have allowed my kids to even breath on them.  I have had no issues with battery life or picture quality.  My only issue is that, the flash is slow resetting.  **I am rating this on the fact that is a point and shoot.**", "Date": "December 3, 2012"}, {"Title": "Fuji xp stay away", "Author": "Vincent Terenzio \"vince\"", "ReviewID": "R5048LS7UK8FO", "Overall": "1.0", "Content": "I purchased this camera for a trip to Antigua.Day 1 Tried it out in pool, reviewed pictures looked great.Day 2 Went snorkling with it, upon leaving the water noticed camera was off and would not turn on.I took camera to room, and noticed that there was water in lens and dripping out of it. Opened camera took out battery and washed in clean water.When camera dried out I re-installed battery. The camera turned on by itself but would not take pictures.Even though Camera was only a month old Fuji would not fix-it.  They said I must have not closed it incorrectly.Since then I followed Fuji instructions to the letter about closing the Battery door.  I submerged it in water. Guess what it still leaks everytime.", "Date": "April 2, 2013"}, {"Title": "Don't Buy the FinePix XP100 If You Want Nice Pictures", "Author": "Scott A Wright", "ReviewID": "R384VLZDMKWXRA", "Overall": "1.0", "Content": "I purchased this camera to replace my Canon PowerShot that was more than five years old.  I liked the fact that it was rugged and shot full high-definition video.  Unfortunately it was clear from the get-go that this camera was not going to take very good photos.  The vast majority of my pictures came out blurry and / or with poor coloring.  In fact, at one point I took ten test shots and only one turned out well.  Don't even think about taking a shot in low lighting.  Keep in mind that I am not particularly snobbish about quality either, I just wanted a point and shoot camera that would take nice snapshots.  The screen on the back is also very low quality.  I returned this camera and instead bought a Canon PowerShot SX230 HS for about the same price and the difference was night and day.  One would think a manufacturer with a reputation in the field like Fuji would put out a better product, but I strongly urge everyone to steer clear of the FinePix XP100.", "Date": "March 8, 2012"}, {"Title": "great camera!", "Author": "Rob S.", "ReviewID": "R39NXIQK3TT24W", "Overall": "5.0", "Content": "I read other reviews and noticed that many people said that this camera leaked but all of the reviews that said the camera leaked was while snorkeling or diving. I wanted a camera to take hiking so I didn't have to worry about it getting wet if it rained. The day I got it my girlfriend took it into the pool and took a lot of underwater pictures then it started raining so I put it outside during the 2 hour thunderstorms we had, I then brought it inside and dried it off and opened it up to check the battery compartment and it was bone dry. Considering my purpose for the camera and the amazingly detailed pictures it took, I give it 5 stars because there is not a 10 star option. Great product!!", "Date": "July 27, 2013"}, {"Title": "bad is bad", "Author": "nelson hurtado", "ReviewID": "R2BR3ZHKHP4C9U", "Overall": "1.0", "Content": "not is waterproof, is very very bad. We were very careful to limit the time underwater, and ensure that no sand got on the seals, as well as locking BOTH latches when changing the battery. (done indoors in clean, dry environments.)While it was working the first day (above water), the pictures were great, but after two days of intermittent use in the water it DIED.We never really got more than basic shots underwater, as the serious snorkeling didn't start until later in the trip.Had to rely on a cell phone camera for land only pictures of the rest of the honeymoon.Very, Very, Very disappointed in this camera.", "Date": "March 31, 2013"}, {"Title": "DO NOT BUY FOR FOR THE WATERPROOF", "Author": "Steven L. Petersen", "ReviewID": "R3UCLWM6QB5B6N", "Overall": "2.0", "Content": "Bought this camera because I really like fuji products.  I use them all the time in my Photography business.  Well, I think Fuji messed up with this one.  First one I got, yep went through two, leaked water into the lens and the LCD screen.  Sent it back, Amazon was great, never any issues there.  Received my replacement, took it to the water park for my family's fun day. This time leaked water into the battery compartment and locked the camera.  None of the videos of my kids playing recorded, half of the pictures are only \"half there\".  As long as you don't want to use this in the water, I mean it says it is waterproof, it is not, pictures and video on dry land work great.", "Date": "August 18, 2012"}, {"Title": "Love until it leaked", "Author": "cmccull \"cmccull\"", "ReviewID": "R1Q4PCJGH2PE35", "Overall": "3.0", "Content": "It is a great size and takes good pictures until we took it under water and it leaked.  Amazon was great about sending a replacement and we are going to try it again.  Maybe it was just a fluke the first time.", "Date": "August 1, 2012"}, {"Title": "BADLY", "Author": "leonardo vargas", "ReviewID": "R1QY6HIY02MQSY", "Overall": "1.0", "Content": "iT`S WRONG BECAUSE THE WATER DAMAGE THE CAMERA, THAT CAMERA ITS NOT FUNTIONAL UNDER THE WATER.DON'T BUY  THIS CAMERA  Y LOST MY MONEY", "Date": "May 25, 2014"}, {"Title": "Not really waterproof (at least in my case)", "Author": "Ivan Sanchez", "ReviewID": "R3DT7LBLOV8C87", "Overall": "2.0", "Content": "Water goes into the memory slot and the camera does't work well. It work well again in few hours (after drying), but this is not the way it should work. Better if you buy a GoPro, or a waterproof case for another one camera", "Date": "April 18, 2014"}, {"Title": "A great camera for our teen daughter", "Author": "K. Knupp \"Kids-and-K9s\"", "ReviewID": "R26MTBNE7SK2TO", "Overall": "5.0", "Content": "Bought this for our young teen daughter. It is a great camera at a great price. Super rugged and the pictures are pretty good!", "Date": "March 27, 2014"}, {"Title": "Leaks On First Attempt at Underwater Photos", "Author": "Mikel", "ReviewID": "R3OEBQXRUWAS39", "Overall": "1.0", "Content": "I had an XP60 that I used for years and it took great pictures.  This camera worked good until I ventured into the water, then it totally shut down.  Save your money.  It's not half as rugged as the 60.", "Date": "March 18, 2014"}, {"Title": "great images, indestructible", "Author": "garandprix", "ReviewID": "R1HM0GSIR6W5UD", "Overall": "5.0", "Content": "takes great images, have had photos printed that I took with this and they look amazing.I like that it can be a \"point and shoot\", but you can also manually adjust settings if you know what your doing.Works great in the pool. better design then the Xp10 I had before!", "Date": "March 14, 2014"}, {"Title": "Piece of S***", "Author": "Rogerio", "ReviewID": "R3BUCH9WY2TVL2", "Overall": "1.0", "Content": "IS NOT WATERPROOF!!! Broke in a pool after 6 months of use.Don't buy this camera. It's just water resistant!!", "Date": "March 8, 2014"}, {"Title": "Nice camera", "Author": "2722", "ReviewID": "R38QAF8A5UTZHR", "Overall": "5.0", "Content": "I wanted a fairly inexpensive camera that I could take to the beach or pool without worrying about getting it wet.  I've taken this one out a few times now and even submersed it to photograph some fish.  It's worked great.  I bought it at the recommendation of a friend who has an older model and loves it.  The picture quality is better than I expected for this type of camera both in and out of the water.", "Date": "March 2, 2014"}, {"Title": "Not very Water proof", "Author": "Robert ....F. Rauscher", "ReviewID": "RELV8182VZ250", "Overall": "1.0", "Content": "I bought this camera to take pictures and video under water.  Took it to St. John, VI in April of 2013 and it lasted for two snorkeling trips and water evaded the seal.  I found moisture in the battery compartment and the camera ceased functioning.  Very disappointing.  Upon my return, Fuji was contacted and because the camera was within the warranty period, it was replaced... no questions asked.  All I had to do was package it up and send it back.  The new camera was fine until it was used under water again in February of 2014.  It lasted for one snorkeling trip and then functioned only intermittently... shutting off at critical times.  To me, there is a flaw in the camera and I paid over $200 for a product which I expected to work for quite some time but it failed miserably. DON'T BUY THIS PRODUCT.", "Date": "February 24, 2014"}, {"Title": "Must have for children!", "Author": "Okpun L.", "ReviewID": "RSGDE5P15A0YO", "Overall": "5.0", "Content": "It does what it promises.  It really is child proof & water proof.  We have used in the pool and took beautiful pictures and video.  Our grandchildren dropped it many times and still works great...:-)", "Date": "February 18, 2014"}, {"Title": "SOLID CAMERA", "Author": "Donald S Saxum", "ReviewID": "R2SBR5DCMH82PK", "Overall": "5.0", "Content": "Nice Clear Pics.. Have Not Tried Underwater Pics Yet.. Seems Solid So As Of Now.. Good Buy For Me.Love The Color!!", "Date": "February 7, 2014"}, {"Title": "Good news/bad news", "Author": "dancelessons", "ReviewID": "R3FSNV7RR1BE5A", "Overall": "4.0", "Content": "Before heading out to Fiji for a snorkeling vacation, I bought this camera to replace the much more expensive Canon that had died in only two uses. (Long story but the Canon customer service was horrible and I'll never buy Canon again.)  I am pleased with the photos that I got with this camera but it too died on the third week of the trip.  I was ever so careful to make sure that the locks were properly secured and I rinsed the camera after each use as directed but it still leaked and died on week three.  I contacted Fuji and not only were they apologetic, they sent me the new upgraded version for free.  What's not to love about that! The camera is easy to use and small enough to throw in a pocket while heading out for a hike or a swim.  I have higher priced cameras to take along for serious shots but a fun, zippy little inexpensive camera is great for more rugged occasions.  Thanks Fuji for a good camera and great customer service!", "Date": "February 6, 2014"}, {"Title": "Great camera for kids", "Author": "Rich L.", "ReviewID": "R2L4R1V3U97S8E", "Overall": "5.0", "Content": "I had given my daughter an old point and shoot of mine so we could take pictures together. The first time we went out to shoot she dropped and broke my old camera. THIS camera can take a few drops (and has) with no trouble. It also take great pictures that she can view on her iPad.", "Date": "January 14, 2014"}, {"Title": "Nice Camera", "Author": "Zane Pauley Sr.", "ReviewID": "R2SNDIGDWSN25U", "Overall": "5.0", "Content": "I really do like my new camera but i have yet to get it out in the water but a nice camera for the money & i'm totally satisfied with it thus far.", "Date": "January 3, 2014"}, {"Title": "Quality issues", "Author": "Michael Amendola", "ReviewID": "R36O0UMJV1LMES", "Overall": "3.0", "Content": "I have actually purchased this camera more than once. I use it for work (home inspections). I did purchase partly on price since I do through equipment frequently do to volume of use and wear. This camera does not exactly meet the durability level advertised. Both cameras I had owned stop working after being dropped off my belt holder ( approx. 3 feet) Both times landing on the side impact guard on the camera. Also unit is quirky when operate with the forced flash mode. Hoping an alternative camera is available in this price range from another manufacturer which will hold up under mild stress.", "Date": "December 28, 2013"}, {"Title": "Poor water seal", "Author": "Alan R. Bergstrom", "ReviewID": "RPWAYCI4IR7WV", "Overall": "1.0", "Content": "Only one snorkel trip and the seal leaked. It is now worthless. I would not recommend this camera to anyone.", "Date": "December 24, 2013"}, {"Title": "Perfect for the adventure!", "Author": "Amanda \"Amanda\"", "ReviewID": "RS1VPQPQQ0TSD", "Overall": "5.0", "Content": "My husband and I went to S. Africa and went cage diving with great white sharks I got AMAZING pictures! No one could believe I took them with this camera underwater!", "Date": "December 21, 2013"}, {"Title": "water seal problems", "Author": "Kara", "ReviewID": "R2S154FSE9EXUF", "Overall": "1.0", "Content": "Had this for almost a year and it just stopped working? Very odd I have a feeling the quality of the seal is poor and just gives away after some time.", "Date": "December 15, 2013"}, {"Title": "don't waste your money", "Author": "Susan Morong", "ReviewID": "R1J7RA372PZCM4", "Overall": "1.0", "Content": "I purchased this camera to take underwater pictures while on vacation in Hawaii.  The camera broke after using it one time.", "Date": "December 11, 2013"}, {"Title": "Junk Camera", "Author": "Jefferson Bagley", "ReviewID": "R1WX3NJODVO06N", "Overall": "1.0", "Content": "My camera died after 5 months and Fuji refused to honor the warranty. Polite customer service people, but a terrible product. I will never buy a Fujifilm product again.", "Date": "December 10, 2013"}, {"Title": "NOT Waterproof.", "Author": "tymo1991", "ReviewID": "R3ABJQV9M8WW69", "Overall": "1.0", "Content": "Camera broke the first time I went underwater with it, stay away from this product if you want a waterproof one!", "Date": "December 9, 2013"}, {"Title": "Great little camera", "Author": "lisa carroll", "ReviewID": "RJLWH5Q0L47CY", "Overall": "5.0", "Content": "Takes great pictures, both underwater and above, no fogging of lens, or spots. Pictures are clear, with great detail and color.", "Date": "December 4, 2013"}, {"Title": "Very Good Camera Based on What You Expect", "Author": "Lawrence Libow", "ReviewID": "R3FJ0SEKGMDPK2", "Overall": "4.0", "Content": "I notice that a lot of reviewers expect this little camera to handle all sorts of whitewater and underwater photography and become disappointed.  Perhaps that's reasonable considering how it's being marketed.  But I was simply looking for a rugged camera that could be used to take HD video during football games in the rain and freezing cold and this little camera does just that.When all the other photographers run for cover when the rain or snow starts, I can remain on top of the press box and keep shooting.  Yes, the battery will run out, but with the cost of replacement batteries so low, I use one battery per quarter and keep shooting while others with traditional video cameras must look for a place to plug in and will head inside and shoot lesser-quality footage in bad weather.The 5X zoom is not optimal for regular photography but it's good enough to cover the field from side to side.  I've seen better HD quality but it isn't bad and certainly good enough to use for the game \"film.\"It's pretty small so to make it easier to use, I place it on a monopod so I can hold it steady with my left hand and not be concerned that I'll block the lens which is off to the left side.For what I need from a camera, for the price, this was perfect.  Four stars instead of 5 due to HD quality and shorter than expected battery life.", "Date": "November 5, 2013"}, {"Title": "Great to begin with, then... Nothing! (repaired)", "Author": "Don", "ReviewID": "R5XYSMB3T6LYC", "Overall": "3.0", "Content": "This was a great camera that I bought for last Christmas and for our trip to Disney last summer. It worked marvelously until our trip to Disney - took tons of pics both in and out of the water and was always very conscious about securing the latches before going underwater but non-the less (I believe) water got in because near the end of the summer the zoom started to go and then the button to take the pictures would not work every now and then and then about a month ago it stopped taking pictures completely. So much for that - $140 bucks and one year later and no camera! I guess a year's not too bad but for the price I'd think I'd get a little more life out of it!Update... Sent camera for repair as it was still under warranty and they \"fixed\" it - only took them about a month. I now have 2 cameras and my new \"Fugi FinePix XP200\" Blows this 100 out of the water for quality of pics and auto settings. We'll see how it holds up next summer in the water!", "Date": "October 21, 2013"}, {"Title": "Easy To Use", "Author": "Isabeau", "ReviewID": "R2EA7K1A9WBQIV", "Overall": "4.0", "Content": "I bought this camera as a gift, for someone who has never had a digital camera. He haven't tested the waterproof, that was kind of a safety precaution more then a feature we planned to use. Takes great photos, but the videos skip if you move at all while taking the video, but even when it skips the picture is clear.", "Date": "October 18, 2013"}, {"Title": "Second use and... it filled with water!", "Author": "Juan.N.P.", "ReviewID": "R2D4GZ7V1ZEDGE", "Overall": "1.0", "Content": "What a disappointment when the camera began to display a \"memory error\" on the screen to submerge less than 5 meters. For security turned off the camera and let it dry. Upon opening it, I realized that had water inside, and display do not relit since.", "Date": "October 13, 2013"}, {"Title": "Great for the money!", "Author": "Amazon Customer", "ReviewID": "R2XP0DCKX64TEZ", "Overall": "4.0", "Content": "Great photos, great video! The only downside was that it overheated while underwater filming and had to be shut off. I did notice some condensation in the camera lens after the dive but I let it dry and no problems after that! Great camera for the money!", "Date": "October 11, 2013"}, {"Title": "Camera", "Author": "Mickiann", "ReviewID": "R1826I4S5QR7P9", "Overall": "5.0", "Content": "I really liked this camera. However, I realized is was so similar to what I had that I did not need it.", "Date": "October 6, 2013"}, {"Title": "camera pictures", "Author": "jesus hungerford", "ReviewID": "R10YIOIGP7MBYC", "Overall": "2.0", "Content": "some times the pictures are fuzzy or blurry why is this? its not that great of a camera for the money", "Date": "October 4, 2013"}, {"Title": "Not waterproof", "Author": "Rick Bolt \"Rick\"", "ReviewID": "RMBKCF5UNR2EH", "Overall": "1.0", "Content": "I had high hopes for this camera and took good care of it, ensuring it was properly sealed each time I used it.  Used exclusively hooked to my life jacket for stand up paddle boarding and kayaking.  No diving or depths but did get exposed to surface water and splash.  On the 5th outing the electronics of the screen  shorted and it became nonfunctional.I returned it for a refund with no problem, though apparently there is a one month window for such returns.Pictures were acceptable for a point and shoot.Have replaced it with an Olympus Tough TG-820.  Too early to see how it holds up yet.", "Date": "October 2, 2013"}, {"Title": "Great for snorkeling the BVI's", "Author": "Jay Easley", "ReviewID": "R1EHC38400TI73", "Overall": "5.0", "Content": "We used this camera for underwater and above water pictures and videos for 9 days in the British Virgin Islands.  It worked as expected and took 700 excellent quality pictures.  It was dropped some and still no problems.  I highly recommend this camera.Jay (Greensboro NC)", "Date": "September 29, 2013"}, {"Title": "Leaked", "Author": "jay shealy", "ReviewID": "R3FFKH2OEF4FSS", "Overall": "1.0", "Content": "I took this camera on an Carribean island vacation.  First day I took pictures on land, they turned out great.  Next day I took it snorkeling, again turned out great.  Next day another snorkeling trip and the camera promptly stopped working.  Looks like it leaked very slightly and been disabled it.  I was able to pull the SD card and load it into my home PC, so I did not loose any pictures taken.  I have since returned the camera.  Too bad, because it seemed like a very nice easy to use unit, just never take it in the water.", "Date": "September 27, 2013"}, {"Title": "I buy it for my friend and me.", "Author": "XINGXIA LAI", "ReviewID": "RJLTJ5SSZOYZD", "Overall": "5.0", "Content": "My friend will go to dive this month, she want to buy a diving photo. And lucky, she found this item is on sale, only use $97. So, we are exciting for the price , then I buy one for myself, another for her.", "Date": "September 20, 2013"}, {"Title": "LOVE IT", "Author": "Maria-Elise Atkinson", "ReviewID": "R2SO1SPEEE42U0", "Overall": "4.0", "Content": "This is our best new toy!!! We enjoy how it works and it is built better that the earlier modle.", "Date": "September 19, 2013"}, {"Title": "Took good pictures but stopped working after two uses", "Author": "Anj", "ReviewID": "R2NU8SLRFD8DYU", "Overall": "1.0", "Content": "I bought this camera for a cruise vacation. It worked well for the first few days and then stopped taking pictures.I really thought I was buying a good product. I am going to try the mfg warranty and see if that helps.", "Date": "September 12, 2013"}, {"Title": "My son loves it.", "Author": "area51auto", "ReviewID": "RXS7AC8BF9JAY", "Overall": "5.0", "Content": "My son is a thrill seeker who uses this Fuji XP100 to get footage of thing like jumping off cliffs into to water and so on. I only give anything a 3 month life expectancy when I give him anything, but it has been 9 plus months so far and I still see videos on the internet of him skateboarding and jumping into water, so it must still work.", "Date": "September 7, 2013"}, {"Title": "great", "Author": "michelle duddy", "ReviewID": "R1K41YVXLCKCQD", "Overall": "5.0", "Content": "Great camera. Just a little crazy getting media disc because it has to be Fuji. Otherwise, love quality of pics and ease of use.", "Date": "September 7, 2013"}, {"Title": "Very Good camera for outdoors.", "Author": "Erich E.", "ReviewID": "RUCG7P7CCQ3NR", "Overall": "4.0", "Content": "Great waterproof camera.Pictures are not as clear as a SLR but good.Like the waterproof aspect for fishing pictures.", "Date": "August 31, 2013"}, {"Title": "Not waterproof", "Author": "Christian lucas", "ReviewID": "R3EI04AD8J7KEW", "Overall": "1.0", "Content": "Camera is suppose to be waterproof. My camera ends up getting liquid damage and Fuji won't repair or replace because liquid damage isn't covered in the warranty! Camera is suppose to not get wet. I talked to a customer representative and they aren't doing anything about it.. Agh!Never buying Fuji anything again!!", "Date": "August 30, 2013"}, {"Title": "Great little camera", "Author": "mother of six", "ReviewID": "RNHMS6QWY9TAV", "Overall": "4.0", "Content": "We purchased this camera for our crusie to the southern carribean. We planned on being in the water alot and needed something to capture the memories.It worked great. The only time it failed us was while snorkling, but below the 30 feet recommended in the packaging (we were at about 40 feet when it went blank)When we resurfaced, it worked fine. also took it to the beaches. It got a litte sand in it that is making the button hard to push, but that is user error  :)Its been great and the movie funtion works well too.Since the cruise, we have been using it for many other fun times. Childrens athletic events and playing in the pool.This purchase was worth it!", "Date": "August 26, 2013"}, {"Title": "Excellent evolutionary upgrade for XP owners", "Author": "Dana Lee Ling", "ReviewID": "R1TTAM6K4LK4PA", "Overall": "5.0", "Content": "I moved from an XP30 to this and am more than pleased. Faster boot to picture time, new picture options including high dynamic range, and a much improved panorama feature. This is my carry-everywhere-all-the-time camera. My XP30 eventually cracked on the corner of the case from too many falls and a rough life. This camera appears to be tougher in that exact same place.", "Date": "August 17, 2013"}, {"Title": "takes terriable pictures", "Author": "Just Joe", "ReviewID": "R2TBY0LWW2GP5E", "Overall": "2.0", "Content": "the auto focus on this camera is the worst. If the stars aline it is capable of a good pic but for a reliable photos this is not the one for you.", "Date": "August 6, 2013"}, {"Title": "Birthday Present", "Author": "desiree", "ReviewID": "R2AONBSZAJ5N8Z", "Overall": "5.0", "Content": "I bought this camera for my boyfriend for his birthday. He LOVES it. He takes it backpacking, rock climbing, and snowboarding. He has only had it for the summer, and the waterproof feature works great. The picture/ video quality is AMAZING. I would highly recommend this camera.In case you're wondering, this camera does NOT come with a memory card, so you will have to buy one.", "Date": "August 1, 2013"}, {"Title": "Fuji Film XP100", "Author": "Salaiza", "ReviewID": "RR49J4K2UW511", "Overall": "5.0", "Content": "This little camera did the work.  During our rainy days in Orlando it was a nice camera to have.  At the water parks this camera came through.", "Date": "July 16, 2013"}, {"Title": "Great camera!", "Author": "David", "ReviewID": "R4606QCGM2ZUY", "Overall": "5.0", "Content": "Purchased this camera for a trip to the Seychelles Islands. We just got back, and all of the pictures and videos from this camera came out great. We never had any problems with it - it functioned great both under water and above water. The battery lasted a long time, and the quality of the photos and videos were excellent - better than I had expected from a camera at this price-point.The only slightly annoying thing is that you can't charge the battery in the camera, so you have to take it out and insert it into the included charger. I just happen to find it more convenient to plug a camera into a USB cable to charge it - and especially on a trip, the battery charger is one more piece of equipment to lug along. But that's really a minor issue.My only other tip is to make sure that the lens is clear of small water droplets when you are taking photos above water after it has recently been submerged. It's easy for those droplets to stick on the lens, and cause problems with the above-the-water photos.Other than that, the camera is a pleasure to use, and produces great results.", "Date": "June 26, 2013"}, {"Title": "WORKED GREAT UNTIL.......", "Author": "R. Siragusa \"hairgoddess\"", "ReviewID": "R1URCSFYW1ZAGU", "Overall": "3.0", "Content": "Iggot this camera to use out at the swimming lake I take my grand skids to.The camera did an awesome job of stills,videos. I was so excited when the weather became nice enough to go to the lake..2 weeks ago..the setting went to \"undewater\" and off we went. did great pictures .Thursday6/20 I took the kids out and we were in the water and went to turn it on and the on/foo switch jammed.Then it would no turn off. Still I got some great pictures.I took it with me to Kansas and went to take pictures and when I looked at the monitor it was as if someone was shining a light on everything . the view finder was all fogged over. I took out the battery and  memory disc ..then the monitor fogged over.I did what was instructed, how ever I am very disappointed that the camera has moisture in it.Amazon is going to do all they can for me.This is a great camera ..however,THIS ONE HAS SOME BUGS. :(", "Date": "June 23, 2013"}, {"Title": "Wasn't a new camera.", "Author": "John Colorado", "ReviewID": "R1WLZZVZHSF65I", "Overall": "2.0", "Content": "Camera was supposed to be new.  It wasn't. While it was packed in the box, it had snapshots already on it that looked like someone trying to make the camera work.", "Date": "June 21, 2013"}, {"Title": "Great product for a great price", "Author": "Craig Patterson", "ReviewID": "RU32J5WYU23B2", "Overall": "5.0", "Content": "It is a really good camera for snorkeling.  Great price compared to all local businesses. Small enough to fit into your pocket when on land.  Very good quality for quick shots, etc.", "Date": "June 18, 2013"}, {"Title": "Wonderful features!", "Author": "Michelle Ford", "ReviewID": "R3VH18MCIO52V7", "Overall": "4.0", "Content": "Love the features! I love that I can take pictures underwater.  It is also great that I can have a camera that I don't have to worry about getting wet!", "Date": "June 13, 2013"}, {"Title": "so-so", "Author": "loves2board", "ReviewID": "R397V88Z0U85NH", "Overall": "3.0", "Content": "I bought it for the burst mode to be able to take action shots while on a wakeboard but have noticed that the images are so-so. The other annoying part is that if the camera turns off instead of staying in the last mode the camera resets itself forcing me to scroll through all the menus to set it up the way I want it yet again. If only they would save settings. Others complain about leaks. I have not tested this yet so I can't say. I wish I had gone with a go pro for what I'm trying to do.", "Date": "June 12, 2013"}, {"Title": "its awesome for the price", "Author": "Christopher Newbern", "ReviewID": "RUNA648L3TNZ6", "Overall": "5.0", "Content": "have snapped amazingly clear pics under the water and even filmed my sons graduation on it, cant beat the value of this product.", "Date": "May 26, 2013"}, {"Title": "Excelent Camera", "Author": "Alejandro Alarcon Gonzalez", "ReviewID": "R2MYNXG7FT26WY", "Overall": "5.0", "Content": "This Camera is Amazing, just what i needed, for my travel to the beach. I will enjoy it a lot to have good pictures.", "Date": "May 16, 2013"}, {"Title": "Great camera, great pics", "Author": "Amazon Customer", "ReviewID": "R397IS59CL7M39", "Overall": "5.0", "Content": "well, I read the reviews (I looked at the negative ones also) and decided to buy this camera.  It worked as advertised.  I took it on a trip to Belize.  I used it for many different shots.  I used it underwater in the Caribbean Sea.  I used it as I was Zip-lining through the jungle.  I took it with me to see the Mayan ruins in 120 degree heat.  It worked great and still works 3 weeks later.  I did have some water get in the battery/SD card area but I let it dry and all it well.  It was sealed but water does get in, but the camera was in the water for almost an hour.  I have no complaints about this camera, maybe those who ware complaining got a bad one, it can happen, or maybe they just don't know how to use it.  Also while in Belize another couple had 2 of the same exact cameras, different colors, and they did not have any problems either. I am happy with my camera, hopefully you will be too.", "Date": "May 1, 2013"}, {"Title": "Amazing!", "Author": "Bryon R. Czaja", "ReviewID": "RBPRR628HSOXG", "Overall": "5.0", "Content": "My hubby bought me this as my wedding gift from him.  We took it on our honeymoon, and I took so many beautiful pictures!  In and out of water!  It works so well.  I don't know why the reviews are so sketchy for it.  It's a great camera!Battery life is great, and the pictures come out very clear.  I've had no problems.  I love it.It's great if you travel or own a pool or live near water not to have to worry about your camera.  I've taken it to water parks too!  It's great!  I love it!  It has quite a few features.  On our cruise, I liked the double shot (I forget what they call it) it takes one shot with a flash and one without.  Then you can choose the better of the two!I was skeptical because of the reviews, but I'm happy this is what we went with!", "Date": "April 30, 2013"}, {"Title": "Great idea, now if I could just get the flash to turn off quickly and conveniently", "Author": "Paul R. Kenyon \"restless\"", "ReviewID": "R3LVGW50V3OKTL", "Overall": "4.0", "Content": "So far the pictures seem great. I've not used all the functions yet. I hope the waterproof feature is robust, i.e. actually works..for snorlking, for example. This camera should float, too, but it's heavy. As we say in sea kayaking, if it doesn't float, it's not your friend. Lose control over the camera while swimming and it'll sink to the bottom and that will quickly overwhelm the seal. If it's sealed it should be sealed in such a way that the seal gets stronger the more water pressure it gets, not less strong. Going into the menu to get that darned flash turned off is a nuisance. When I want the flash off, I want it OFF! NOW! Not some remote time in the future when I've gone through the d***** menu. And i want it to stay off until the next time I want it on. I love the color. Hey! Color is important.", "Date": "April 30, 2013"}, {"Title": "Fujifilm Finepix XP100 digital camera", "Author": "KEH", "ReviewID": "R2I4M6037EXQ8V", "Overall": "3.0", "Content": "I bought this camera for my son who wanted it for taking BMX action photos.  The camera may have been built sturdy, but it didn't take great pictures at all.  I am a diehard Fujifilm Finepix camera user, and was disappointed that the pictures were so-so.  We ended up returning it for a refund.", "Date": "April 21, 2013"}, {"Title": "Good \"tween\" camera", "Author": "Polly", "ReviewID": "R2IG4AWX7VSRB1", "Overall": "5.0", "Content": "I bought this camera for my 11 year old son for his birthday.  I just wanted a durable camera that he could take photos and video with, and the fact that it's waterproof was a bonus!  Nothing too flashy, but it's been durable and he loves it!  It's been banged around in his backpack, taken on school field trips, dropped a BUNCH, and it's held up beautifully.  I'd recommend this camera for this use.", "Date": "April 11, 2013"}, {"Title": "So far, so good", "Author": "Molly May", "ReviewID": "RDE6TUHWC0XR4", "Overall": "5.0", "Content": "I got this camera for my boyfriend and he loved it! We dropped it twice in two days and it was fine. We also left if it a cup of water and took photos and it worked fine! It also takes good pictures and video. It's not an over the top camera, but you have a clumsy person, who wants a basic camera, this is a great choice and a really good price.", "Date": "April 8, 2013"}, {"Title": "Great camera", "Author": "Ryan", "ReviewID": "R2STNZTJE32TOU", "Overall": "4.0", "Content": "Bought this for a two week trip to the west coast. Used it in waterfalls, the grand canyon, ferry rides and all over seattle. Froze up one time in two weeks. I was turning it on and off every few minutes so that probably didnt help. Picture quality seems pretty good. Starts up and takes pics quick. Battery life was good. Taking 40-50 pics a day didnt seem to bother it for about a week.", "Date": "March 30, 2013"}, {"Title": "Great camera", "Author": "Ashley", "ReviewID": "R3SONHKF8G28AK", "Overall": "4.0", "Content": "I was hesitant to buy this camera due to some of the reviews I read, but I am glad I did. This camera obviously wasn't as crisp as a \"professional\" under water camera but it did a great job! As long as you read the instructions for care first, you should have no problem with water getting in at all. I bought it for snorkeling in Hawaii, and I've said many times that this was the best purchase I have ever made. I will have those photos and great memories for a lifetime!", "Date": "March 9, 2013"}, {"Title": "fujifilm xp100", "Author": "1downstream", "ReviewID": "R12L1S9GOVX345", "Overall": "5.0", "Content": "Great camera works well above and below water in both salt and fresh. Great battery life and super quality pica love it", "Date": "July 4, 2012"}, {"Title": "Outside elements its a good camera, quality of picture, poor", "Author": "brb319", "ReviewID": "R1KDHBQ304K7F6", "Overall": "3.0", "Content": "Outside elements the camera seems tough, picture quality for sport activities is a challenge to get a quality picture. Really have to work at it, but some things you just can't replay.", "Date": "November 24, 2012"}, {"Title": "Great camera", "Author": "ROBERT F DUTKA", "ReviewID": "R19WJRZ8ZRM3M5", "Overall": "5.0", "Content": "It takes great pictures.It is waterproof and takes clear digital photos I'm the rainBattery life is very good.I would recommend it to my friends.Robert Dutka", "Date": "November 9, 2012"}, {"Title": "Love It!!!!!!!!!!!!!!!", "Author": "B", "ReviewID": "R149YGPPPMAMJ7", "Overall": "5.0", "Content": "This camera is great! I was a little worried due to some of the other reviews, but we took this camera out canoe camping and it held up very well. The battery lasted about 5 days and 300 hundred or so pictures.  The photos are wonderful and we used it both in and out of the water. No complaints at all.  We especially like the panorama feature!", "Date": "September 17, 2012"}, {"Title": "Skip this camera", "Author": "S. Richards", "ReviewID": "R317A8FILM0J7A", "Overall": "1.0", "Content": "Tried with 2 cards; it took ~ 10 seconds to do sequential shots, even at lowest resolution! I could paint the scene faster!! Skip this camera.", "Date": "August 12, 2012"}, {"Title": "waterproof failed", "Author": "TJW417", "ReviewID": "R3OJQ10M0SF6NJ", "Overall": "3.0", "Content": "I didn't buy this through Amazon, but the waterproofing failed just over 90 days after purchased and Sam's wouldn't take it back, so I had to deal with Fuji. I needed the camera replaced quickly for a particular trip for which I had purchased it. Cost $13 to ship to Fuji. They would only replace with a refurbished model, did not have an orange one, and wouldn't pay the return shipping to overnight it, so that cost me $15. They offered to send me some accessories instead, but then didn't send them, probably because I complained too much. On the plus side, the pictures were pretty good, including underwater ones. They did get it back to me on short notice (at my expense, of course). I give Fuji 2 stars.", "Date": "July 28, 2012"}, {"Title": "Love it", "Author": "Edna C. Maryon \"Edna\"", "ReviewID": "R2JHTIB2O8U4EV", "Overall": "5.0", "Content": "I feel in love with this camera the after the first picture. I have used it everywhere except the water so far and every picture is as beatuiful as the reason was taking", "Date": "July 8, 2012"}, {"Title": "Good for Five minutes.", "Author": "Rick Bennette \"Rick Bennette\"", "ReviewID": "R5QC53SWE78TE", "Overall": "1.0", "Content": "This camera worked great out of the box for about five minutes. I shot two short videos and took three pictures that came out. Packed it back up at work, brought it home, and when I turned it on again, it came up with a \"Zoom Error\" message. It would not focus, and the next shot I took, the subject was completely blurred beyond recognition. A few minutes later, it stopped taking pictures altogether. I never had the opportunity to try it under water.My suspicion is the microprocessor failed, but even before this happened, the two videos I shot were not up to the quality of even the iPhone 4. The three still I shot were were overexposed and soft at the edges. Perhaps this was related to the impending failure.", "Date": "November 7, 2012"}, {"Title": "Zero stars if is possible", "Author": "Nenad Vukovic", "ReviewID": "R3NBLY2UAPJI8X", "Overall": "1.0", "Content": "Don't buy this is crap I got this camera for vacation I wish that I read reviews b 4 I made purchase. If only I could give -5.", "Date": "September 25, 2013"}, {"Title": "Gorgeous pics", "Author": "Cecily Reynolds", "ReviewID": "R11YZQCK142U0C", "Overall": "5.0", "Content": "Got this for my son to take to National Boy Scout Jamboree, & it takes amazing pictures!  The fact that it's \"scout-proof\" makes it a winner!", "Date": "June 28, 2013"}, {"Title": "Awful Purchase", "Author": "samantha gorski", "ReviewID": "R26WLE0GLD09MS", "Overall": "1.0", "Content": "When I received the camera it was already broken, it was a waste of money completely since I tried to turn it on, and it worked for about 5 minutes then the screen went black. It continues to work for about a minute then the screen goes black.", "Date": "June 14, 2013"}, {"Title": "Nice Camera", "Author": "Jmini", "ReviewID": "R32NK6OX44Y0PP", "Overall": "5.0", "Content": "I don't why there  are bad reviews .Its a good point and shoot ,nice pictures ,Great video.I use it all the time and my pictures are great.I used it under water with no issues.", "Date": "April 1, 2013"}, {"Title": "Wife loves it.", "Author": "Michael Bell", "ReviewID": "R3L3MIH4VQALR8", "Overall": "4.0", "Content": "Still needs to be field tested, but my wife is impressed with the features of this camera. The true test will be getting it under water and outside and making sure it lives up to it's reputation.", "Date": "January 1, 2013"}, {"Title": "pretty good", "Author": "Mr. DJ", "ReviewID": "R2RKMYMHEOHSXB", "Overall": "5.0", "Content": "Great camera.  This is our second Fuji like this one that stands up to the elements. Our last camera went through everything and the only reason we are buying this one is because it came down to a new battery or camera and since ours was pretty beat up (but still works) we got this one.", "Date": "December 19, 2012"}, {"Title": "Great but Not waterproof", "Author": "Pen Name", "ReviewID": "RC3W9HD4EQ45B", "Overall": "2.0", "Content": "This is a great camera! I took it in the pool and now there's fog and condensation under the screen and lens", "Date": "July 22, 2012"}, {"Title": "Junk! dont waist your money", "Author": "peggy \"parissa_sai\"", "ReviewID": "R1KLL8I0BC3OI0", "Overall": "1.0", "Content": "Bought this camera so i have a water proof camera to take pictures of our trip to the bahamas.  Within 5 mins in the water the camera stopped working it was filled with water.  Then we had no camera to take pictures of the dauphin encounters .. we ended up spending 100.00 on photos that the daulphin encounters staff took to have some memory of our trip.  Very disappointed in this product.  Not only was it a waste of money but it also cost us more $$ to buy pictures it failed to take.", "Date": "August 27, 2012"}, {"Title": "Camera is a Great Gift", "Author": "LEXMike", "ReviewID": "RZR49HZTTOV0A", "Overall": "5.0", "Content": "I purchased this as a gift for a teen.  It arrived in the advertised time and was exactly what I wanted for a traveler.", "Date": "May 13, 2012"}, {"Title": "the best for the price, but dont work", "Author": "giampietro di marco", "ReviewID": "RU5XQPS910G6G", "Overall": "1.0", "Content": "the camara dont work is dead...the camara does not work, is water resistant but not underwater ... worked only two months and always with a little water seepage but after it had dieddo not buy, nikon AW100 is better", "Date": "May 11, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "14MP CMOS\nHigh Quality Fujinon 5x Optical Zoom Lens\n4-Proof Protection: Waterproof 33', Shockproof 6.5', Freezeproof 14, Dustproof\nFull HD Movies\nExtended Life Li-Ion Battery", "Name": "Fujifilm FinePix XP100 Digital Camera (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51SeEIL1lwL._SY300_.jpg", "ProductID": "B006T7QUA2"}}