{"Reviews": [{"Title": "first time sanyo user", "Author": "Pen Name", "ReviewID": "R33Q9LCANQI2SP", "Overall": "4.0", "Content": "I am an avid fan of photography, and have always been a diehard canon fan. I received this camera as a gift, and replacement to my prior camera, which had been sold in hard times. Although my fiance was unable to afford my dream canon setup, he surprised me with this one. It provides me with some great prints, and includes many more features than my previous camera. The battery life is impressive (or I'm just lucky) as I have taken around two thousand pictures and have only replaced the batteries maybe 3 times? I use rechargables, so I don't know if that's a factor but I'm certainly not complaining. Honestly, I don't really have any complaints with it. It does its job and does it well. The only thing I disliked was the strap that was included. It truly is irritating, but easily replaced (or omitted). All in all, I would recommend this camera to anyone looking to upgrade from a basic point and shoot type camera, who desires a little bit more control.", "Date": "May 11, 2012"}, {"Title": "Love it so far", "Author": "StRon", "ReviewID": "R20O4NCPZO5KEC", "Overall": "5.0", "Content": "Just bought and set up the camera this weekend as a second digital camera for my personal use. Shoots great color prints and has some really neat features for using advanced settings to override the auto settings! i really like using an higher ISO for action shots with Kids!", "Date": "March 18, 2012"}, {"Title": "This is a fine entry level camera for the budding photographer.", "Author": "Richard A. Arndt", "ReviewID": "R38747KCPP9XJU", "Overall": "3.0", "Content": "This is a fine entry level camera for the budding photographer. The VPC-2100 has a nice optical zoom and can take photos in a wide array of lighting conditions. The f-stop ranges from 3.1 to 16.7 giving impressive results in the large aperture range.The camera offers a nice LCD viewer but does not utilize an eye piece. Despite this, the battery life is pretty good with a set of four rechargeable AA's lasting about two hours or approximately 400-500 photos. I noticed the viewfinder is also hard enough to be pretty scratch resistant.The auto focus is my biggest gripe with this camera. On any setting other than the most basic wide angle, you must p prefocus the camera for every shot. This isn't a big deal except when trying to shoot any kind of motion. All of my pan shots come out blurry and I find its more luck than timing because of the long focusing time and sensor response. In some situations where light inst optimal the camera may refuse to focus at all. This is especially true in the smaller aperture range. This can make the macro setting frustrating when trying to create limited depth of field.Landscapes turn out fairly nice if you use the proper settings. Forget using the panorama stitch mode. Only when I blow up my pictures past say 8x10\" do they start to appear granulated.ISO ranges from 100 to 1600. This is particularly useful for taking shots indoors of say a basketball game. I believe this is where this camera shines. If you are taking shots of your kids during a play or indoor sporting event this camera gives you the tools to get the job done. I have gotten some nice blurs and with some luck a few nice action freezes.Over all I think for the money you can do much worse. Sanyo came through with this one. The VPC-2100 offers enough features to keep you entertained but may leave you hungry for more after your skills develop. The cons for this camera include a slow and temperamental auto focus when dealing in extreme focal lengths. The pros are a nice set of features, good battery life, and reasonable image quality. I recommend this camera for parents taking pictures at events and still photography. Props to Sanyo.", "Date": "December 11, 2013"}, {"Title": "The camera and customer service", "Author": "Francis S Weaver", "ReviewID": "R3170RLFLNV44Q", "Overall": "5.0", "Content": "I just love the camera and use it practly every day for something or other. I chose this rating not only for how great the camera is but also for the service and support of the distributor I had. I did not get an instructional manual or the dvd that was supposed to be with the camera so I emailed in to customer support and within hours I recieved a reply saying the rep would be back in his office the following morning and let me know what is going on. He not only let me know he emailed me the manual so I can print it or save it on my computer. So the service was great also, Thank you .", "Date": "July 11, 2013"}, {"Title": "Camera to last", "Author": "Bellkyss", "ReviewID": "R25XKEI6P090SX", "Overall": "5.0", "Content": "I bought this camera for my daughter. She is enjoying taking pictures with her new gadget and she found it easy to use.", "Date": "June 25, 2013"}, {"Title": "g8", "Author": "Sujan Maharjan", "ReviewID": "R1E04A17ON5ZV1", "Overall": "5.0", "Content": "I like it great product. No problem what so ever. Samsung galaxy s III cell phone memory card is great.", "Date": "June 7, 2013"}, {"Title": "Got One HECK Of A Deal On It And Came With More Than I Thought", "Author": "Inuyasha491", "ReviewID": "RUMAOL2MNSPN8", "Overall": "5.0", "Content": "I bought this camera used and it looks brand new!  The shipping was fast and well packaged, but the best part is what came with the camera.  I paid $87+ for it, which even Ebay wasn't cheaper.  I got a case, a strap for the camera, a 8 GB SD card, an SD card adaptor, batteries, and a cord.  I was THOROUGHLY impressed and so happy I got it.  My only complaint is when I record, it's fine if the camera isn't messed with, but once you start zooming or the camera is focusing the audio goes out until it's back to normal or stops fidgeting.  But all the things I got for the price just make it amazing!", "Date": "November 10, 2012"}, {"Title": "Very happy with camera", "Author": "Dwaine", "ReviewID": "R14M8AHZQPBIDI", "Overall": "5.0", "Content": "Very happy with camera,...quick prompt delivery....was missing cable connection for computer....otherwise...very happy and looking forward to taking photos  with it..", "Date": "July 12, 2013"}, {"Title": "Smart camera", "Author": "linda j. durst", "ReviewID": "R3BLSACR4QWFA6", "Overall": "4.0", "Content": "I bought my camera because a relative had one and she liked it.  I was looking for a camera with more options and buttons.  I love it and really will be using it the first time when we go on a cruise.  The camera has a lot of different options I like the one that tells me I have low light and I click a button for brighter flash.  The one thing I wish I  had is a booklet of instructions.  I have a disk to load on the computer, but I can't take that on a cruise. What does one do that doesn't own a computer?  I gave it a four star because it's a smart camera.", "Date": "May 5, 2013"}, {"Title": "Good, Good, Good!", "Author": "M. Christian \"Mallard\"", "ReviewID": "R3MI3683T04RUR", "Overall": "5.0", "Content": "Good quality, good performance, good price.  I was hesitant to purchase a camera that was described as \"used\" over concerns for what might show up when delivered.  But the price was very attractive and I decided it was worth the chance.  And I could not be happier.  The camera was in excellent condition and has been operating as good as could be expected.", "Date": "March 6, 2013"}], "ProductInfo": {"Price": "$189.00", "Features": "14 megapixel resolutionDelivers excellent picture quality\nKonica Minolta zoom lens Features a 21x optical zoom\n3\" LCD display , Battery Type: \tAlkaline\n720p movie Record movies in HD on this compact camera\nIntelligent scene mode Easily take eye-catching photos with accurate color", "Name": "Sanyo VPC-E2100BK 14MP Digital Camera, 14MP, 21x zoom (25mm wide), 3\" (460k) LCD, CCD Sensor Shift image stabilization, 720p HD video, Intelligent Scene Mode, Uses 4-AA batteries", "ImgURL": "http://ecx.images-amazon.com/images/I/41pyrLZM4gL._SX300_.jpg", "ProductID": "B006C9VOLM"}}