{"Reviews": [{"Title": "Great camera with some minor flaws", "Author": "Stelios Touchtidis", "ReviewID": "R1LY1A78PX42GZ", "Overall": "4.0", "Content": "I bought the bundle, which is a great deal. The case is simple but nice (and can store an extra memory card) and the 4GB card saves some money.The camera itself has a tremendous amount of features, and takes very sharp pictures, even at extreme high zoom. The automatic setting is very clever, and makes smart decisions about lighting and flash--smarter than my 2-year-old Canon. Note: it's strange that a \"force-flash\" option is not allowed under full automatic mode, but hardly a deal-breaker as you can switch to partial-auto mode. The image stabilization is quite good.The main con is the pop-up flash, which is annoying because my fingers tend to want to grip the camera there. Even 5 millimeters to the right and would have been no problem, but I suppose it was a compactness issue. The flash is quite powerful for a consumer camera.Another silly issue is the included manual, which is horribly inadequate. Fortunately you can find a real manual online. The manual is needed because the camera has a lot of hidden complexity, especially if you want to use the top features.Still, all and all, I'm quite happy with the value for the money, and to get 16x zoom in such a compact form.", "Date": "May 14, 2012"}, {"Title": "Great Product with some flaws", "Author": "HMelara", "ReviewID": "RJJMXXNPPZZ1V", "Overall": "4.0", "Content": "Feb-2012I want to tell you somethings about this model:What I like the most- Resolution- Smart Mode very simple and useful for no tech people- Great movie resolution- Did I mention the amazing Zoom resolution?- All the characteristics are according to they said!What I dislike- Flash position, usually I put my left finger where the flash come out. It's a little bit annoying taking pictures using the flash. The publicity didn't mention where the flash is located, neither the specs. :S- Battery: I cannot take more than 15 flash photos. The flash run out the power very fast. (Nov. 2012: it seems that it only happens during the first discharge, after that you can take more photos using the flash, I would say 50 or 60).- Storage: Its SD Card cannot be read on a PC (Windows 7) It gives a message error, something like Couldn't read file format, and if I would like to format the SD Card. I have to use the camara to read the photos, and I need to use battery power, If the battery is discharged I cannot see the pictures.Nov-2012So far I had no problems with the camera! it has been a great investment!!!!Dic-2012No more SD Card problems. I can read it using PC. Thanks to Kenneth. He explain why windows couldn't read it at first time... check his reply below...", "Date": "July 16, 2012"}, {"Title": "Great zoom", "Author": "clubmichael", "ReviewID": "RVOMESAJ9JVWE", "Overall": "5.0", "Content": "I looked for awhile for a camera that provided me with a great zoom. This camera didn't zoom as much as my old one, but because of the high MP, it actually takes better pictures and when I crop pictures it's a much clearer picture. I love it and the color !", "Date": "July 7, 2012"}, {"Title": "Sony Cyber-shot DSC-H90", "Author": "Izzes Gram", "ReviewID": "R2ATMNB10VZUKZ", "Overall": "4.0", "Content": "I'm a hobby photographer and have tried a lot of point and shoots.  I own the DSC H20 which takes some really great shots and pretty good videos.  In fact it was the video quality that sold me on both of these cameras.  What I don't like about either and maybe all Sony's are like this or maybe I just haven't figured out how to conquer this gremlin, the face recognition has to be reset to \"off\" every time I turn the camera back on.  When I'm taking pictures constantly of my grand children I don't want to have to worry about that.  I'm always forgetting and then can't take a picture because the camera is trying to focus on a face.  I would think I could set it to \"off\" and it would stay there like everything else I set to \"off\".  Other than that, this is a really great little camera!  The Zoom is a blast to use, the 16.1 mps make for some very crisp photos and as I've said, I love the video quality.  I returned this to try out a Canon and may end up going back to it, if the Canon disappoints me.", "Date": "July 31, 2012"}, {"Title": "Outstanding Pocket Camera", "Author": "Anthony Daquin \"Things don't change, we chang...", "ReviewID": "R3J8XA859AG9SW", "Overall": "5.0", "Content": "I looked for awhile for a pocket camera that provided me with a great zoom with a very wide angle lens, very convenient for this one, I often find myself in situations where you need to have a camera and use a lot of flash, one of the thing I like about this DSC-H90 is that SONY improves his flash metering (how the camera magically decides how much light to fire out of the flash) it does his work with outstanding image (it brings the high quality 16.1 megapixel sensor) quality, performance, and low-light capability in a lightweight, compact, also the video capture is another notable improvement in this DSC-H90.In summary as a professional photographer, I'm quite happy with this DSC-H90, it takes accurately realistic photos, a plus when you don't carry on your professional Nikon D-SLR with you.", "Date": "October 28, 2012"}, {"Title": "Great features, poor autofocus", "Author": "Adam", "ReviewID": "R3H32K8SI78V2W", "Overall": "2.0", "Content": "The feature set for this camera is very good.  My wife wanted to replace her 5 year old P&S; camera to take pictures of our newborn baby and this camera was perfect.However, the low- and medium-light autofocus on this camera is very, very poor.  She took a dozen or so shots of our baby and I don't think a single one was properly focused.  I shoot with a Sony Alpha DLSR so I like to think I have down the basics for focusing an auto-focus camera, and I had a very difficult time getting anything properly in focus.  The orange AF illuminator seemingly did nothing; even with it, the camera would hunt around until it just guessed at a focus level.  The couple shots I took outside in the sunlight seemed to focus just fine.Unfortunately this camera needs to perform indoors, so I'll be returning it.", "Date": "August 29, 2012"}, {"Title": "Great Camera Great Price Worth Every Penny", "Author": "Angela C. Shumate", "ReviewID": "RDF2D34P9198L", "Overall": "5.0", "Content": "This camera is a gem and not just for the price. It takes crystal clear pictures just like I wanted. I traded up from my Finepix S700 hoping it would be better but thought hey, I will give it a shot and so glad I did!! The pictures on this are far superior to my Finepix which I paid a lot more for when it came out. This camera I would say is pretty much idiot proof if you use the auto feature.. what more could you ask for? If you want awesome pictures without having to know anything about how to focus, etc. then this is the camera for you and it is for the experienced photographer too. I don't have enough good words to come up with to describe the clarity of the pictures but trust me, it is a purchase I can't imagine anyone regretting!!", "Date": "June 18, 2012"}, {"Title": "Sony Cyber shot DSC h90 16.1mp", "Author": "gmmg", "ReviewID": "RR4P7VHTO4WRK", "Overall": "2.0", "Content": "The zoom on it does a good job for a little camera but you get a lot of blurry pictures when anyone is moving. It does not have the anti blur sports setting that my previous cyber shot had.  Over all disappointed.", "Date": "October 26, 2012"}, {"Title": "easy to use", "Author": "luis", "ReviewID": "R3O6J5VVRKA49P", "Overall": "5.0", "Content": "I really like this camera. It is extremely intelligent, the battery last forever (went to amusement park and took over 400 pictures and only a quarter of the battery was use), you just have to point and shoot and let the camera decide what is the right aperture and speed and everything else. Simply incredible pictures. I read in other reviews about the flash pooing on the left side where the index finger tends to be which can be a little weird at first but in a week you get use to move your finger 10 mm back or front. The case which came with it is a little small but sturdy. The SD card that comes with it is class 4 but when use with a class 10 the camera works smoother. Well worth money if you are clueless like me about cameras. BONUS= it has a button for help that when pressed in any moment will give you instructions and explanations for dummies.", "Date": "September 6, 2012"}, {"Title": "Worked one time and then stopped working", "Author": "Melissa Winters", "ReviewID": "R46P5VSXIQDB1", "Overall": "1.0", "Content": "I was very happy when I received the camera only two day after I ordered it. So that part was great. We used the camera one day at the Zoo and it was really easy to use and the quality of picture was great. The next time I tried to use it it wouldn't turn on. Tried to recharge the batteries thinking that was the problem. No luck. I had to send it back to Sony which cost me $22 to send. I still have not received it back Yet. So I didn't get to use it for Christmas or New Years. Not very happy", "Date": "January 7, 2013"}, {"Title": "Cyber-shot", "Author": "Gunter E. L. von der Heyde", "ReviewID": "R3KT9VV9KXWM82", "Overall": "4.0", "Content": "My wife had wanted a camera which had a longer telephoto capability than the one she had so when we returned from a trip I started to look for something that would give her the capabilities she wanted. After checking several different models from numerous manufacturers I decided on the Sony Cyber-shot DSC-H90. We have gone on a cruise since she got her new camera and she took over a thousand pictures, the camera performed flawlesly and she is very pleased with it's performance.", "Date": "October 27, 2012"}, {"Title": "Was exactly what I was expecting.", "Author": "8arrowheads", "ReviewID": "R360BG5TPRAK38", "Overall": "5.0", "Content": "I had purchased this camera specifically for taking landscape shots and it worked exceedingly well for that application. There is a long delay between pressing the \"shoot\" button and seeing the picture but my subjects were not moving so it made no difference to me. I did miss not having a view finder though.", "Date": "October 4, 2012"}, {"Title": "Sony Won't Honor 1 Year Warranty", "Author": "globetrotter", "ReviewID": "R129VATB7IWQEV", "Overall": "2.0", "Content": "First of all I'll preface this post by saying I'm a life long Sony customer. I've used their products for decades. Typically I always found them to be the highest quality, last forever and really enjoyed them. From the Walkman, to the Discman to Sony TVs, DVD players, Video cameras, and of course cameras.My last 3 Sony Cybershot cameras I've purchased have ALL had problems with them. 2 of them had the same exact problem and Sony did cover them under the 1 year warranty. Fortunately they all happened within the 1 year warranty.When I pressed a manager he admitted there were some motherboard problems at the factory in Japan and they were working on it. So I was on my 3rd camera (DSCH90/B) and I only bought it a few months ago. It too had problems. It would often times say \"reindexing\" and take forever to load every time I turned it on. Also, sometimes it would just be black and not turn on. (same type of problems with the other 2 Cybershots I sent in).I just sent it to the service center (as the previous 2 times) to the Laredo, Texas repair center and I get an email saying that I needed to pay $270 plus tax for the repair. Keep in mind I only paid $250 for the camera brand new!I immediately called in and they told me to disregard the email and someone would email me. Rather than wait, I emailed the manager that was so helpful the previous 2 times on the broken cybershots. He told me that there was \"corrosion\" and they couldn't cover it under warranty. HUH??I've never done anything at all that isn't normal. I've always used the original battery and we have always kept the camera indoors, never exposed to harsh weather conditions, temperatures, etc. I complained and the manager said the best they can do is send a new one for $125.06 plus tax. I guess I'll be forced to accept it but honestly I don't think this is fair as the camera is only a few months old. I see on Amazon it's only $137 plus tax now so it's not even like they are offering some great deal.When I go to replace these, I probably won't buy another Sony Cybershot since they won't even honor their 1 year warranty and make claims of \"corrosion damage\".", "Date": "March 5, 2013"}, {"Title": "I'm not happy with this camera.", "Author": "James C. Hendrix", "ReviewID": "R2YSC1CY86D649", "Overall": "1.0", "Content": "compaired to the Canon cameras I've used in the past, this thing makes a good brick.I got it in December, 2012 and as of February, 11th. it's been at Sony repair .The time to send it back to ran out on Jan, 31st. 2013. The few pictures I took with it were of poor quality . I could go on but I'll leave at that.", "Date": "February 16, 2013"}, {"Title": "DSC-H90", "Author": "acheung128", "ReviewID": "R260A6DMMC693R", "Overall": "3.0", "Content": "I got the camera as part of reward points.  Can't beat the price of \"Free\"Found the auto-focus to be not as sharp as Canon or Nikon.The camera focus better with center focus than multi-focus.White balancing is good for daylight but not for flourscent light.The camera has ISO setting but will not readjust the exposure meterif you can use it in the manual mode.  Thus, if you want to play withthe manual setting, you will need to do everything manually,including aperature and exposure meter.The camera has a lot more feature like facial tracking but I found thatto be useless since it's not focusing at the face but off to the otherobjects to the side.  Maybe it needs a firmware upgrade or something.Who knows?!?!", "Date": "May 16, 2012"}, {"Title": "Very nice long zoom point and shoot", "Author": "btn1100", "ReviewID": "R2EE0G5JFUPRQ8", "Overall": "4.0", "Content": "This camera is a very good camera if you are interested in picking it up and shooting without \"messing\" with the settings much.(Though there is a manual mode if you really want to) The 16x zoom lens in such a small camera is very nice and easily fits into a pocket.Pros:Small and lightLong ZoomNice sharp picturesAutomatic macro mode (no need to switch this on or off if you want to get close)Nice shutter responseHas better than expected low light performance for this size cameraCons:Small sensor camera will not perform as well as a DSLR or Micro 4/3rds in low lightBurst rate is only 1 FPSNo Aperture or Shutter priority mode(though there is a full manual mode)A good value at under $200.00", "Date": "June 22, 2013"}, {"Title": "Great pictures", "Author": "Stephanie Stephenson", "ReviewID": "R2RSUPD1KQXFKG", "Overall": "4.0", "Content": "Pros:  Great pictures.  I purchased the red.  Very attractive look...darker crimson red, not bright red.  I love the help screen feature where you can press the question mark when on a specific feature and it will give details.  Lots of features including blink detection. Rechargeable battery is also a plus.Cons:  The flash location is absolutely irritating.  It may be worse for me though because I'm left-handed.  When I take pics it pops up exactly where I am holding the camera.  I am afraid it's going to cause me to drop it.  The zoom feature is really neat but the part where you move it is on the front of the camera and not the back.  It's kind of difficult to zoom.  Verryyyy slow to save and then immediately view pictures.  I'm also concerned about the tiny lever that holds the battery in. It looks like its about to break when I try to put the battery in.  Removing the battery is unavoidable because you have to charge it.Overall:  Overall I like the picture quality better than my last cyber shot.  I would purchase again.  Maybe in time I will get used to some of the cons. Most of the functions were the same as my last cyber shot which makes it easier to maneuver around the menu of features on the screen.  I got it for an awesome price of less than $100 including shipping on Newegg.  Definitely worth the money.", "Date": "June 5, 2013"}, {"Title": "Incredible Images, Slow System", "Author": "Bruce Simmons (Brusimm)", "ReviewID": "RXECVF1YUJCMP", "Overall": "5.0", "Content": "I am very confused by this Sony Cyber-shot DSC-H90 camera.It takes the most incredible images.The optical zoom is great.The digital zoom is beyond incredible (as far as I'm concerned.)And the various modes this camera offers are pretty robust.BUT...Taking a picture, is a one-shot deal.  Meaning, if you're at a NASCAR event, you only get one shot of the cars going by.  The photo processing to the memory card is frustratingly slow. (1 image per second is what it \"cranks\" out.)You can turn off the flash, but you cannot force the flash to fire (in Automatic mode.  But you can in \"P\" mode).  I'm very dependent on fill light from the flash, so this pi**ed me off.It's pretty compact and you will need to train yourself to not have your finger sitting over the pop-up flash.It's slow to crank up, so not great for quickie pics.  (Slower than I'm accustomed to)There's no infinity setting.But wow, the zoom feature and the amount of incredible levels of detail at super zoom is breath taking!So it's a LOVE/sort of hate relationship, like dog training.You may love dogs, and trying to train one to be \"perfect\" can drive you insane with frustration.  But take the time to train with care and patience (No, not evil, brute force training), and it can be an incredibly rewarding relationship.Bruce, aka, BruSimm.I'll probably be putting up a more lengthy review on my site sometime soon, with image examples.", "Date": "March 8, 2013"}, {"Title": "A sophisticated point-and-shoot", "Author": "Dennis E. Gallus", "ReviewID": "R15GNSCG0M8I6Q", "Overall": "5.0", "Content": "My wife refuses to carry a full-size DSLR.  We bought this camera prior to a trip to Britain, and she used it exclusively.  Her photos are amazingly sharp and well-exposed.  The zoom on the camera is very long (416mm in 35mm photography terms).  At this extreme zoom range, photos lose contrast rapidly, but some of the \"snap\" can be restored through post-processing.  All-in-all, an impressive piece of technology.", "Date": "December 27, 2012"}, {"Title": "mini digital", "Author": "Ken Lum", "ReviewID": "R13PWQWIST1HBP", "Overall": "3.0", "Content": "So far the pics have not been that clear and perhaps I need to upgrade to a full feature/full size camera. The pics are about the same quality as you'd get with your cell phone. i guess I expected too much of a mini sized camera", "Date": "December 8, 2012"}, {"Title": "Great quick camera", "Author": "Dohtig", "ReviewID": "R1P16SU9RXJRBB", "Overall": "4.0", "Content": "I purchased this for my wife.  She wanted a smaller, easier to carry camera.  Her DSLR was a bit big and cumbersome for quick candids and  such.  This camera has done the trick.  The seller was quick and the product has met all our expectations.", "Date": "August 18, 2012"}, {"Title": "Took it Back", "Author": "P. McConnell", "ReviewID": "R1H7WOA7PT598N", "Overall": "2.0", "Content": "bought this for a sightseeing trip to NYC and was pretty disappointed. 90%+ of the pictureswere dull and had a washed out look. camera took a long time to process the shot beforeallowing you to take another picture. moderate and low light autofocus is pretty poor.720p videos turned out great.  very powerful flash, almost too powerful for indoors !i'll likely try the DSC-HX30 for my cruise next month.", "Date": "October 12, 2012"}, {"Title": "A Sony Of My Ownie", "Author": "JacLynWin", "ReviewID": "RE4J6HTOUUXT6", "Overall": "5.0", "Content": "I love Sony products and this little cyber-shot is perfect.  It has all the clarity and power as my larger Sony camera, yet this one fits in my purse.  So now I have a great camera with me all the time and the picture is perfect every time.  I love having a quality camera available for all those once in a lifetime wildlife photo ops.", "Date": "June 11, 2012"}, {"Title": "Hard to beat for the price and size.", "Author": "lovetodiyandmore", "ReviewID": "R29HBFF28ER1CJ", "Overall": "5.0", "Content": "I think it's perfect for the size and price. The High-dollar cameras are cool, but who wants to tote a bulky camera with a bazooka lens attached while on vacation/hiking. I think I use the video as much or more than pictures. I took a video testing the zoom on this Sony DSC-H90. [[http://youtu.be/DMbSe1hW0Ko]] , 3 items I also use with this camera. Pelican 1010 Micro-Case Black,....Joby GP1-D1EN Gorillapod Flexible Tripod (Grey) and any class 10 sd card(for faster write speed).", "Date": "September 16, 2013"}, {"Title": "Camera", "Author": "jackie", "ReviewID": "R2PFBNGLXKPP2V", "Overall": "5.0", "Content": "LOVE this camera !! Takes a great picture in low light and easy to use. I have a very expensive Nikon andthis takes close to the same quality...This is my third one. Lost the last one so got it in red...this time.", "Date": "June 11, 2013"}, {"Title": "Great camera except....", "Author": "Terry J. Kreidler", "ReviewID": "R2W60XZE7JTEJY", "Overall": "4.0", "Content": "Great little camera.  It takes excellent pictures and the 16x zoom is great.  One caveat--the flash is right where you put your left hand and interferes with the flash popping up.  I think the flash could be better located.", "Date": "May 24, 2013"}, {"Title": "This is great for the price and does a lot", "Author": "Amazon Customer", "ReviewID": "R3ANU70YNMTAE2", "Overall": "4.0", "Content": "I was really surprised by this camera I will honestly say I expected less. I took so many amazing pictures with this camera and the menu is pretty standard for a sony camera. If you have worked with them in the past you'll walk right into this like you've used it a dozen times. I would have give this a higher rating but the flash is in the worst spot in the whole world. it requires it to be held like a cell phone to take pictures I had someone drop it because they were surprised by the flash popping up right where their fingers were hold the camera. They had the strap on so it wasn't a huge deal but it could have been. All in all it's a really good camera.", "Date": "April 26, 2013"}, {"Title": "Great camera", "Author": "Jo", "ReviewID": "R3QL985XNEZXZB", "Overall": "5.0", "Content": "Freezes action extremely well.  Very clear image even after zooming in on image on the viewfinder after taking picture.  Easy to use.", "Date": "April 7, 2013"}, {"Title": "Thumbs Up for the H90 and a Comparison to the S105", "Author": "ItsMeMark", "ReviewID": "R3587Z4U98SNHL", "Overall": "4.0", "Content": "As with all my reviews I will start off with the compact version giving the quick tid-bits necessary to make a decision without needing to read the whole review. The full list of all the thought I have come up with on the primary points will be listed in the next section and wrapped up with an overview. This is from the perspective of a former Professional Photographer so it may go over some people's heads. Read it till the end if possible.Packaging:I purchased this camera used so I cannot give a review on the packaging.Positive:Price is king and this camera not only works but has features I wouldn't expect of something in this price range.Resolution is great.Lens goes to f/3.3 (remember the price).Manual modeSupport for Memory Stick Pro-Duo and SDSolid buildIt's a Sony!Negative:One Frame Per Second, probably due to cheap buffer memoryManual controls are clunkyNo RAWNeutral:Charger is white?Impressions:For a budget, current generation, camera I don't think the H90 can be beat. Simple as that. The initial introduction price at $250 was far to expensive but now that it's fallen to $150, that is more than fair for this piece of technology. I will be comparing this to the Canon S105 which is not fair to do, but I just want to put the differences between being able to buy two of these for the price of one S105. If I use terminology that is unfamiliar, please Google the term so I don't make this review too much of a study guide. The S105 has an f/2.0 lens compared to the H90 which is f/3.3, at minimum zoom, and both increase to f/5.9 at maximum zoom which is x5 for the S105 and x16 for the H90. This means the S105 is much better at low light than the H90. I don't personally use zoom but if you do like zoom, then the H90 has a the upper hand. I have not personally pixel peeped the comparison of the lenses of both cameras but I'd bet pretty good money that the S105 has much better clarity and consistency than the H90. The S105 also shoots in RAW, a file type that stores the image in a form that is more readily edited on the computer. The S105 also has 1080P while the H90 only has 720P. But the H90 shoots at 16.1MP resolution compared to the 12.1MP on the S105.I've blown up the review above with technical terms to make a clear distinction. If you as a consumer, didn't understand what I was talking about, just buy the H90 and use the extra money on a good tripod, case, and extra SD cards (always have 2 or 3, always, they do break... Or get lost... Or forgotten). If you're the inquisitive type and start to do research about what I talked about then you may choose to go with the S105. If you have oodles of money and just want the best point and shoot, get the S105. But no matter what, realize that in a camera, megapixels are not everything. Light is passing through a piece of glass and hitting \"film\" that is the same size on both these cameras and  getting a camera with more MP does not automatically mean a better picture. The H90 is meant to be a cheap camera that has some great features for people who don't want or need the best.Conclusion:I've gotten many compliments about my photos with this camera, no one knows it's a point-and-shoot, it is very good for the price. If you don't use the pictures from this camera to print 8x10s, no one will be able to tell the difference between a picture from this or the S105 or even a multiple thousand dollar camera in most cases (not including low-light, no flash). There is a National Geographic *cover* from the early 2000s that was shot are around 4-6MP. If you're on a budget, get it.", "Date": "March 8, 2013"}, {"Title": "Very good version of a digital camera", "Author": "Alfonso Bedoya", "ReviewID": "R3SBTZ126F0XLG", "Overall": "5.0", "Content": "I was following this camera in a while, I like a lot, fortunately low price. Product arrived in excellent condition. 100% recommend the product.", "Date": "February 10, 2013"}, {"Title": "Thanks!", "Author": "Lisa", "ReviewID": "R1CR2XW1TVZ5PQ", "Overall": "5.0", "Content": "Extremely timely shipping and just as advertised!  Thanks! This was a present for my daughter for Christmas...she loved it and has taken some really great pictures with it!", "Date": "February 3, 2013"}, {"Title": "Marlys", "Author": "Marlys Briceño", "ReviewID": "R2OVUAHTZLPOT9", "Overall": "5.0", "Content": "Excellent seller, I recommend it 100%, everything was done at the right time, the camera worked great, I'm pleased charm. I arrive in good condition.", "Date": "January 23, 2013"}, {"Title": "Sony Cyber-shot DSC-H90", "Author": "R1", "ReviewID": "R32GSIF670O048", "Overall": "5.0", "Content": "The Sony Cyber-shot DSC-H90 is Spot On.  It is economical, fast action, great zoom, extremely easy to use and portable.", "Date": "January 17, 2013"}, {"Title": "Very Good camera", "Author": "Dr Barakat", "ReviewID": "R1QY5J18B304H6", "Overall": "4.0", "Content": "Very Good camera. Lightweight, small and takes good pics. battery life is great. I would recommend this product to a friend", "Date": "January 13, 2013"}, {"Title": "Great camera!", "Author": "Lisa", "ReviewID": "R1F8Y02F6QDUDB", "Overall": "5.0", "Content": "It works great and meets our expectations based on what we read about it before purchasing.  The zoom and panoramic features seem to be working well and are the reason we bought this one over other cameras for a similar price.  The flash also works well but the button is sometimes held down by mistake because of the location of where it pops up.  I'm sure our daughter, who we bought the camera for, will get used to that and it won't be a problem.  She is still learning all of the features and settings but it seems to be working well and the quality of the pictures has been good.", "Date": "January 13, 2013"}, {"Title": "Good camera", "Author": "Amazon Customer", "ReviewID": "RZ0SHIBR8976W", "Overall": "4.0", "Content": "The depth of focus and shutter speed make this a good camera for pictures of wild-life.  The panorama function is less of a plus than I'd hoped, it's hard to find panoramas that are at a suitable distance since you can't zoom while using this function and the image generally gets distorted, proportions are warped because there's always one point of the view that the photographer is standing closest to with respect to the entire image.", "Date": "January 11, 2013"}, {"Title": "It is really nice", "Author": "Stephanie Reid", "ReviewID": "R2K5W1VL9ORE58", "Overall": "4.0", "Content": "I am having a ball with my new camera.It is compact and easy to use. I really enjoy using the camera", "Date": "January 10, 2013"}, {"Title": "Nice cammera", "Author": "Andres Vidal", "ReviewID": "R1Q7O7I4KQI4DZ", "Overall": "5.0", "Content": "All is good, good focus, good manual l . . . . . .. . . . . . .", "Date": "January 10, 2013"}, {"Title": "awesome", "Author": "Denny Newborn \"wewilltrain\"", "ReviewID": "R2LJYNPTU7N29H", "Overall": "5.0", "Content": "for a point n shoot camera it takes pix as nice as professional. the high mega pixal & high zoom go great when crpping pix", "Date": "January 9, 2013"}, {"Title": "It is a nice camera", "Author": "Antonio Rojas", "ReviewID": "R30NDE2J99C15D", "Overall": "5.0", "Content": "It is OK and it was shipped on time, no problem installing it and it is working fine, I love it", "Date": "December 28, 2012"}, {"Title": "30x zoom comes in handy", "Author": "4theboys", "ReviewID": "R2XPPHA3OS87NS", "Overall": "4.0", "Content": "Great camera, no problems yet.only thing is flash pops up on top left where I am used to holding camera. just some getting used to on my part.", "Date": "December 28, 2012"}, {"Title": "excellent camera", "Author": "Mauro", "ReviewID": "R2D2KN339DE3CY", "Overall": "5.0", "Content": "Excellent camera very good resolution, very good zoom, the photos are very clear and perfect functions.  I got great pictures with my family.", "Date": "December 28, 2012"}, {"Title": "Great little Camera!", "Author": "Melanie K. Elmore", "ReviewID": "R3N4BYGP543SS7", "Overall": "5.0", "Content": "I had a Canon Rebel DSLR and wanted to downgrade to a more compact camera. I sold my DSLR and accessories and searched for a camera that would give me good quality photos without the hassle of a DSLR and all of the gear that goes along with it. I purchased this one after testing it in store and liking the quality of the photos it took. I've had it for almost a week and I love it! I love the \"smart-auto\" mode as it really seems to do a good job selecting the proper setting. The video mode is great as well. Plus, the manual setting has lots of fun filters and different features. I'm still discovery more about how to get the most out of this little camera, but so far I have few complaints. My only complaint so far is the time it takes to switch over to playback mode after taking a photo. The switch over is pretty slow and can be annoying when I'm attempting to view a recently taken photo. Overall, this camera is definitely priced well and functions better that my previously owned Nikon and Canon point and shoots.", "Date": "December 26, 2012"}, {"Title": "Terrific", "Author": "Charlotte Painter", "ReviewID": "R3V7VWY2GLW8JB", "Overall": "5.0", "Content": "I am a realtor that needs wide angle and panoramic pictures. The detail and ease of this camers is great. Battery life is long which makes life easier. I highly recommend it.", "Date": "December 21, 2012"}, {"Title": "Great value", "Author": "peachpotter47", "ReviewID": "R3V01JEJ5SFZWC", "Overall": "5.0", "Content": "Large viewing screen , easy to operate, beautiful pictures, adjust to macro on it's own.Great value with the case and memory card.", "Date": "September 20, 2012"}, {"Title": "Great Camera!", "Author": "Hammie", "ReviewID": "RAGINGIQI2O0W", "Overall": "4.0", "Content": "This is my third camera, all of which have been the Sony brand.  I've had few problems with them, so each has been a slightly better model based on my needs and budget.  For this DSC-H90, I was looking for a substantial optical zoom and decent image quality, for under $150.  It may sound stupid, but I also wanted a more \"DSLR look,\" rather than just a pocket point-and-shoot.  But finding a camera, without regard to brands, with these specifications in my price range with a rechargeable battery, NOT AA's, proved difficult.  But this camera has it!  The zoom is definitely worth it for the price.  With such high megapixels, I can crop a photo down some and not have to worry about image fuzziness.My Pros:- The price!  I was able to grab this for only $134 on Amazon with free shipping, while every other site and store had it for $148+.  A good price leaves more to spend on a good memory card and other accessories.- It shipped in only 3 days (excluding New Years Day), and for free with super saver shipping.- The zoom and image quality - impressive for under $150 and still can fit into a larger pocket.The Cons:- The battery cover of the camera and especially the lens cover are made of cheap plastic.  The lens cover doesn't even fit together quite right because the pieces are set in so loosely - concerning since the glass lens is so important!- The place where the flash pops up.  Definitely not the end of the world, but as many other reviews say, oh so annoying because a place for your finger is nice.- The camera box was not well-shipped.  It is a quite small box, but came shipped inside of a box about eight times its volume with not enough air pillows, allowing the camera box to slide around inside.And in case you're wondering what all you get with this camera (I was concerned but bought it anyway...), here's what the camera box comes with:CameraHand strap to attach to cameraUSB to camera cordrechargeable  battery in plastic caseoutlet chargermanualsThe only two things missing that most people will need are a carrying bag and a memory card.  You will definitely need a memory card because the internal memory of the camera only holds three pictures.", "Date": "January 11, 2013"}, {"Title": "Excellent camera for non-professional photographers", "Author": "Edgar Hernandez", "ReviewID": "R1NG058OGIL824", "Overall": "5.0", "Content": "Good quality, excellent pictures, and easy to use.  I bought it for my wife and she loves it!Definitely a good purchase.", "Date": "February 15, 2013"}, {"Title": "Camera", "Author": "Michael Drabick", "ReviewID": "R2NWGMAQHCZLSV", "Overall": "5.0", "Content": "Got this as a gift for my parents.  Delievered on time and came with all items as described.  Works perfectly.", "Date": "January 10, 2013"}, {"Title": "Soft and Blurry Photos Indoors", "Author": "jplev", "ReviewID": "RV0SRAMRIND67", "Overall": "3.0", "Content": "While one should not expect DSLR quality images from a point-and-shoot, one should expect that they images are sharp and in-focus when using flash indoors. This camera disappoints, I wanted a point-and-shoot to take with me when visiting family for the holidays, I picked one of these cameras up, tested it out, and was deeply dissatisfied with the lack-of image quality. For any photos that matter, get a better camera.It does support the various bells and whistles the packages mentions, and takes good photos in brightly lit conditions. However, if you want to take photos of your kids ripping open Christmas presents in the dim of Christmas morning, this camera will NOT suffice.", "Date": "December 15, 2012"}, {"Title": "My fiance loves it", "Author": "Kris McIntosh", "ReviewID": "RS1EU7MTZGFKT", "Overall": "5.0", "Content": "Great for taking pictures of birds, as the zoom is just good enough to get them while their standing still in the trees. Images are not anywhere near Pro level quality, but still great for an amateur just wanted keepsakes of their vacations. Will still keep an SLR with some good optic's nearby for when I really care about the shot.", "Date": "May 14, 2014"}, {"Title": "Very dissapointed!", "Author": "Susan M. Snyder \"Papergirl\"", "ReviewID": "R3H9KY23Q84ENI", "Overall": "1.0", "Content": "Camera takes fuzzy pictures. Ive tried to return and get no response! Very dissappointed and wouldnt recommend..  Not at all what was described.", "Date": "May 3, 2014"}, {"Title": "Great Camera for the money!", "Author": "Cindy L. Batton \"lover of adventure\"", "ReviewID": "RVN1EWKUAYR8M", "Overall": "5.0", "Content": "I purchased this camera for a birthday present for my sister.  She was very surprised and loved it right away.  She's learning all the bells & whistles, so when we get some pictures printed I'm sure they will be great.  Of course, I need to get an extra battery since these hold a pretty good charge, but like an extra in reserve.  All in all, I would highly recommend purchasing this camera for anyone looking for a reasonable digital camera.", "Date": "April 28, 2014"}, {"Title": "I have no words", "Author": "Jacinto Muñoz", "ReviewID": "R2TGWND1X12A5T", "Overall": "5.0", "Content": "My wife was born with a camera in her hands, really, I'm not joking, she can spend an entire day taking pictures and she is the official photographer in any party so I was looking the perfect gift for her and I decided to purchase this camera and I couldn't be more right. She loves it and the quality of the pictures are simply amazing. The zoom works nice and the flash is great. It arrived in perfect conditions and it was as described. I recommend it. The only advice is that you must be careful while handling since the flash hides and shows so if you grab the camera in the wrong way, the flash will be forced and it can be damaged", "Date": "April 3, 2014"}, {"Title": "The pictures taken with this camera are awesome", "Author": "Mendy", "ReviewID": "R1R8ZKHD99YEIL", "Overall": "5.0", "Content": "The Sony Cyber-shot DSC-H90 16.1 MP Digital Camera with 16x Optical Zoom and 3.0-inch LCD arrived on time and in good condition.  This camera takes really great pictures, especially flash photographs.  I bought it for around 100 bucks, which made it an even better deal.  I bought it used, and it came with everything, including the original box.  Just 2 things you need to be aware of about the flash, yes there is a flash, it is hidden.  First, it doesn't have a force flash, second it is hidden on the top of the camera so make sure your fingers do not keep it from popping up.  Once you account for this, the pictures will come out breath taking.  A great point and shoot camera for just over 100 bucks, used.  I give this a 5 star rating because personally I like the hidden flash feature.", "Date": "March 26, 2014"}, {"Title": "perfect", "Author": "Amazon Customer", "ReviewID": "R37AXWNCM4EB5M", "Overall": "5.0", "Content": "This is such a great little camera.  I can take pictures of the geese without getting so close I scare them way.  I can also get close to flowers.  It seems that everything that others have complained about could be fixed buy reading the manual of the instructions on line.  Even so,  It is very easy to use and user friendly.  I am an old woman and not a big techy", "Date": "March 24, 2014"}, {"Title": "Auto focus needs improvement", "Author": "Siddharth S.", "ReviewID": "R1YQIGB6OEAHAG", "Overall": "3.0", "Content": "I purchased Sony based on my previous experience with these cameras. However, I find it's auto focus function takes too long for adjusting, particularly when you are trying to capture the moving object. The auto focus is also not that great when it comes to macro photography. Not what I expected with Sony camera.", "Date": "March 12, 2014"}, {"Title": "This camera is great!", "Author": "Gay Thrower", "ReviewID": "R2E2WDB57QZQAP", "Overall": "5.0", "Content": "When  I lost my other Sony Cyber-shot and needed a camera immediately, I couldn't find this camera so bought another.  After taking pics, I returned the other camera and finally found the one I wanted on line.  The pictures are clear and I'll stay with this until I find something that works better- and I haven't yet!", "Date": "February 26, 2014"}, {"Title": "Really good stuff", "Author": "Sunil", "ReviewID": "R1QAVJ4ZWQT6C8", "Overall": "5.0", "Content": "User friendly.Picture quality is awesomeBest stuff in this price rangeIt's a good idea to go with the complete pack-Camera, Cover.", "Date": "February 3, 2014"}, {"Title": "Blurry shots", "Author": "Jennifer R Tulley", "ReviewID": "R24DBA9YSN9TYG", "Overall": "2.0", "Content": "I'm not impressed with this camera.....I have a very hard time getting clear shots that aren't blurry.  Not impressed at all.", "Date": "December 24, 2013"}, {"Title": "its ok", "Author": "Linda Thompson", "ReviewID": "RUQV5N7F1L00H", "Overall": "3.0", "Content": "I thought i would love this camera more then i do...I find many of my photos come our blurry no matter what setting its on.(Tho i must say i do love the soft skin setting...that was one of the reasons i purchased this particular camera.) PLUS i findit a little complicated esp. when you want to change settings...takes me forever to figure it out and i have had this camera over a year.The batterylife is the worst and on top of that i misplace the charger more times then i would like to admit (at the moment, i have no idea where it is and no battery life left in battery and Christmas is in two days...hope i find it)", "Date": "December 22, 2013"}, {"Title": "Worth buying it", "Author": "Shashidhar SD", "ReviewID": "R1US18P0MHFRFX", "Overall": "4.0", "Content": "Really good camera. Has good clarity among the ranges. Really refer to buy this one if you are looking for camera in this range.", "Date": "December 21, 2013"}, {"Title": "Good camera!", "Author": "Scifi28", "ReviewID": "R37VNN9NX4YVWL", "Overall": "5.0", "Content": "This camera captures great pics, even in snow, bright light, etc. You really have to figure what settings you want for \"blink detection\" or \"smile detection\", etc...and the only drawback I've found was the flash pops up usually where your finger is on top so you end up holding it down by mistake...so you have to hold it on the sides. Other than that we truly love this camera.", "Date": "December 10, 2013"}, {"Title": "ORGANIZED AND FULFILLED", "Author": "henry garcia gomez", "ReviewID": "RVMFQDNSK2RTX", "Overall": "5.0", "Content": "EXCELLENT. THE PRODUCT OFFERED SAME AS REQUESTED. RECOMMENDED TO 100% TO MAKE YOUR SHOPPING.  DEFINITELY OTHER PRODUCTS OFFERED AGAIN BUY FOR YOU. THANK YOU", "Date": "October 20, 2013"}, {"Title": "Lots of Great Features", "Author": "janet", "ReviewID": "R2VF6U7A1Y3TSX", "Overall": "5.0", "Content": "I bought this camera to replace the one I had for two years and lost.  It works well and I take great shots with it.  Obviously I am smitten.  It was cheaper this time though.", "Date": "September 30, 2013"}, {"Title": "no much words  ....", "Author": "willian", "ReviewID": "R2GH5ZQGPBXTRI", "Overall": "5.0", "Content": "a really good  camera ...good zoon  good M.P. i recomend this Sony Cyber-shot DSC-H90 16.1 MP Digital Camera with 16x Optical Zoom  it  works exelent  for  me..", "Date": "September 5, 2013"}, {"Title": "OK but having problems after just 6 months", "Author": "Amazon Customer", "ReviewID": "R36NS3JVETOTSI", "Overall": "3.0", "Content": "Photo turn out well. Operating zoom ... It is pretty slow, so if you quickly want to zoom in and capture that special moment...you will be disappointed. After 6 months of using it, it is acting up, e.g. it will not turn on. That is not consistent though...so I have not brought it in for repair yet.It also is slow in taking pics itsrlf--by the time it is ready, it's often too late.  But once you do get a shot, the pic quality is very good.", "Date": "August 29, 2013"}, {"Title": "One of the best cameras for its price", "Author": "mattking911", "ReviewID": "R30JSBQ6CX0NU", "Overall": "5.0", "Content": "Great camera. Takes amazing pictures and has a wide variety of settings to optimize your picture. Most important thing to note is that pictures turn out great if there in no movement. Even in low light, if there in no movement and you are able to keep the camera still with a tripod you will get great 16MP pictures. If there is movement, there will be motion blur unless you are out in full sunlight. Still there are times where you will get motion blur. Another thing that is great about this camera in you can take continuous shots at the rate of about 2FPS. This is enough to get sweeping panoramas and also capture moving subjects in full sunlight. So this camera is great for landscape or portrait shots but for moving subjects and in low light this camera lacks and requires some tinkering with exposure, aperture and brightness. Video is captured at 720p at 30FPS, which for me is perfect quality for my computer and TV's resolution. Video mode in very smooth in all aspects. Optical stabilization works well and prevents shakiness of the camera. While panning the brightness adjusts quickly. When zooming the focus adjusts quickly but not quickly enough that you cant tell when watching the video. Overall I am very impressed with the video this camera is able to take especially because it is really meant for pictures. The camera's battery life is good and lasts about 3 hours of continuous use. When I was on vacation in Yosemite National Park one battery would last me the entire day and I took pictures constantly provided I power the camera off when not in use. One last all important point is that this camera is durable. Very solid with a metal face plate and zoom. I dropped this camera down a granite slope and it bounced down 15 feet in front of me to hit a stone wall. The only damage to the camera was cosmetic with a small crack in the side. Everything still works and all buttons have the same functionality. Great camera for a beginner and through my research it is the forth best cameras in its price range. Although i'm not sure these other cameras would be as durable with as great of a battery life.", "Date": "August 19, 2013"}, {"Title": "Beautiful Camara, I never tire of seeing and appreciating", "Author": "Fredys G-Venezuela", "ReviewID": "RJVDKJX113HGD", "Overall": "5.0", "Content": "definitely one of the cameras that I liked most is this. its design is very attractive city, this new, no used, spanking new. Thanks to this provider describing your article as it is.I recommendFredysGMaracaibo, Venezuela", "Date": "August 12, 2013"}, {"Title": "excellent", "Author": "Muciz Ozcan", "ReviewID": "R1M5R26IRSM7WI", "Overall": "5.0", "Content": "It is better.  Easy to use.I love it. İt is chepar than I expected. I have been used for a month No problem up to now.", "Date": "July 30, 2013"}, {"Title": "AMAZING", "Author": "syeda zahra", "ReviewID": "R2Z5LABM22M3AY", "Overall": "5.0", "Content": "I love this camera. Using it is very easy, and the resolution and pics are very clear. I know people are saying that the flash could be relocated. Maybe yea, but it isn't much of a problem. I think it is fine. I would highly recommend this product.", "Date": "July 29, 2013"}, {"Title": "Great camera", "Author": "jerry a. lay", "ReviewID": "RB7BS2V18TK6K", "Overall": "5.0", "Content": "I have used Sony cybershots pretty much exclusively since my first which was a DSC-S70 which I still have and use occasionally. This camera was to replace one that got dropped, I like having a smaller camera with me at all times. This one has a lot of features that allows you to customize your shooting experience just like my DSC-H1 which is almost as large as my Nikon 35mm film camera. The flash on a Sony is high powered and really lights up a large area for night shots unlike the canon digitals ( I have a friend who swore by canons til he saw how much better the quality of the photos were with my Sony's in multiple applications. I'm sure if anyone is looking for a mid price range small ultrazoom, you can't go wrong with this camera.", "Date": "July 26, 2013"}, {"Title": "Good but not great", "Author": "R. Mitra, mystery author \"author\"", "ReviewID": "R242CXOQRVWPEW", "Overall": "4.0", "Content": "The camera looks good. I upgraded from a Sureshot DSC W200. I had the camera for 3 years and it's still working fine. I just had a craving for a long zoom. I got this, pretty good price (no, great on Amazon: not their own but another dealer), I haven't tried everything so far but basically the pictures are sound and well balanced. I loved the zoom. I'l write more after I come back from my vacation and use the camera more. Yes, the pop up flash is an annoyance but one can grow over it. It's the lens that matters, and so far the picture quality is good.Do not buy the bundle. Right on Amazon, a SONY case and a 24 G SD card is cheaper.This complements the camera. I like black but the red looks attractive. More later.I have to add this:I used it taking pictures of family in the pool. I used IA and then SCN, beach. Oh, boy, the pictures were extremely good; the water blue just like it was to the eye.Yes the processing speed is slow but the captured pictures are crystal clear.I tried the multiple shots and it worked like a charm. Every frame captured was clear and sharp, always remembering this is not the top of the line camera.The night shots came out quite well.I haven't tried the video functions yet.So far this is turning out to be a great investment.I just have problem transferring the pictures to my computer, once I installed Play Memories. Before that it was fine, going straight to my pictures file, like the old SONY.I have to figure that one out.", "Date": "July 18, 2013"}, {"Title": "Great Little Camera", "Author": "M. Adams \"Meg\"", "ReviewID": "R28YWJ8BR7ULQ4", "Overall": "5.0", "Content": "This little camera takes wonderful pictures and the zoom is perfect for its size. It isn't as fast in frames per second as my digital SLR, but if you are looking for a compact little camera to capture friends and scenery, this is it!", "Date": "July 16, 2013"}, {"Title": "Sony camera", "Author": "Irma Payan", "ReviewID": "R2KHJPOG0PG7V7", "Overall": "3.0", "Content": "Not pleased with the pictures. I had better luck with the older model. Seems to be out of focus. Blaaaaa", "Date": "July 12, 2013"}, {"Title": "Great camera", "Author": "CowBoy \"Joshua Mark Stiltner\"", "ReviewID": "R1NMOE6NWTK0I4", "Overall": "5.0", "Content": "for a point and shoot camera at this price you cant beat it. I have always enjoyed any Cybershot product", "Date": "July 11, 2013"}, {"Title": "I am enjoying my camera!", "Author": "seek.serenity", "ReviewID": "R1NQPOOS9RWR6Z", "Overall": "5.0", "Content": "Have only had for a month, but it has taken many beautiful pics. I was able to get a spare battery as well from amazon at a great price, so no worries of ever running out of power. Did have to purchase a memory card as well, so keep that in mind if buying this camera, as it doesn't come with one. I had missed that when ordering, so had to wait another week before using while waiting for the ordered card to get here. Shipping was good (fast too). Camera is stylish and has a contoured part on right side that is nice to help with grip when taking pics and videos. Oh speaking of which.... the video stabilizing is wonderful...... I was taking a video of grandson on tractor and walking backwards while shooting, I was all over the place, but when viewing the recorded video it was as though it was taken using a tripod!!!  As I said I have only been using it a month but am very pleased.... Hope this will be a long term relationship!!!!!", "Date": "June 27, 2013"}, {"Title": "the focus is not good at all", "Author": "yanni tan", "ReviewID": "R21M4WIXV17L6U", "Overall": "2.0", "Content": "The outside is made of  very cheap plastic.  The auto focus is quite poor so the images I took are not sharp at all.", "Date": "June 26, 2013"}, {"Title": "Fantastic camera for the money!", "Author": "Alison Sheehan", "ReviewID": "R1NI7UDY15U40R", "Overall": "5.0", "Content": "Easy to use, point and click is a snap, and the zoom works amazingly well.  I am even able to shoot pictures for my jewelry web site using this camera and the photos come out better than the ones I used an SLR for!  Highly recommended for crafters who need to photo stuff for Etsy shops and such.", "Date": "June 24, 2013"}, {"Title": "Great Camera", "Author": "Jason Boozer", "ReviewID": "R2CP2VVUQFG5AM", "Overall": "5.0", "Content": "This is a great compact camera that creates a great picture! This camera fits great in your pocket and is lightweight.", "Date": "June 20, 2013"}, {"Title": "excellent camera", "Author": "Nicolas Ciarliero \"nicociar\"", "ReviewID": "R1192786KW8U0M", "Overall": "4.0", "Content": "excellent camera for families to enjoy, everything went very well and the seller was very responsible and reliable.The diarioa use and works great", "Date": "June 16, 2013"}, {"Title": "great graet great camera.", "Author": "nikhil", "ReviewID": "R3FZFBGM602PMU", "Overall": "5.0", "Content": "a great deal. 16 MP with 16 x zoom in this price is a great deal. 3 inch LCD screen is also very good display. easy to operate.", "Date": "June 13, 2013"}, {"Title": "Excellent little camera", "Author": "Lisa", "ReviewID": "R2ZILVW6VMPCSW", "Overall": "5.0", "Content": "This camera packs the same punch as my larger SLR. I was looking for a compact digital with a lot of zoom and this one suits my needs perfectly. The sweep panorama is flawless. The intelligent auto mode is fantastic for getting a high quality, quick point and shoot shot. The manual settings allow for setting up shots with just as much control and precision as my SLR without having to lug around the cumbersome bag and equipment.  Buy this camera, you won't regret it.", "Date": "June 8, 2013"}, {"Title": "love the zoom but slow to process the photos", "Author": "rambelmont", "ReviewID": "R3HMZ7U47ODQUU", "Overall": "4.0", "Content": "have had a lot of digital cameras and I LOVE the zoom on this.  The other features are fine too, but the zoom is what I really want and am very happy with.The only negative is that the photos take longer for the camera to save.  When I want to take several photos in quick succession (not together like the 3-shots-in-a-row), but different images of different items, but close together, it is really noticeable. . A pain.", "Date": "June 4, 2013"}, {"Title": "exelent", "Author": "doblea76", "ReviewID": "R3431PUUV4ODU3", "Overall": "5.0", "Content": "very very goog product, i think sony is sony, incredibel optical zoom and pixel very good. the product a good time.", "Date": "May 3, 2013"}, {"Title": "Good \"point and shoot\" to live in a handbag", "Author": "BayouBrit", "ReviewID": "RF0QXKDKBT4D5", "Overall": "4.0", "Content": "I bought this to replace an Olympus which is now devouring batteries. This was very easy to pick up and use and is taking good shots. Its low-light performance is currently not superb, but that could be me relying too heavily on auto mode. There are a *lot* of options on this camera, which means I probably just haven't found the right one for those shots. No regrets.", "Date": "May 2, 2013"}, {"Title": "Sony cyber shot H90 review", "Author": "T. Goff \"red\"", "ReviewID": "R3SS3WB7OHFGWM", "Overall": "5.0", "Content": "Great camera at a great value . Highly recommend. We used it on our cruise vacation. Great digital pictures. Also good panoramic pictures. Would recommend buying a as card with it. I did and had plenty of space. Battery last couple of days. Great price and good purchase.", "Date": "May 1, 2013"}, {"Title": "Good Camera", "Author": "Jane doe", "ReviewID": "RL0U7P28UFMBR", "Overall": "4.0", "Content": "I really like this camera - easy to use and plenty of options for taking pictures. The only thing I don't like about it is where the flash is located - top left corner right where you put your finger while holding the camera. It startled me the first time it started coming up so I jostled the camera and messed up the picture. I usually keep the flash off now because of the that. Otherwise, it's a good camera that takes good pictures.", "Date": "May 1, 2013"}, {"Title": "Nice camera", "Author": "D. Ryan", "ReviewID": "R211U06IU7JDPH", "Overall": "4.0", "Content": "It's really my husband using this, but he's had very little issue with learning all the features.  We are not professional at all, and really like that it's nearly \"point and shoot.\"  Very nice camera for the price.", "Date": "April 13, 2013"}, {"Title": "Camera with a style", "Author": "Mohan KUNTIPURAM", "ReviewID": "R3U232TDUCXRVU", "Overall": "4.0", "Content": "nice product. And must look for memory card. Without it, its trouble. better have a memory card. (4 gb) is good enough. But i like it.", "Date": "April 11, 2013"}, {"Title": "Sony is Sony", "Author": "Tiger", "ReviewID": "R1NP80KRJ3PJBV", "Overall": "5.0", "Content": "This is my third Sony camera. As previous ones this one is good to.  For this price I think you can’t buy anything better.", "Date": "April 8, 2013"}, {"Title": "Great Help", "Author": "Ricardo A. Valencia", "ReviewID": "RQ0A1MAFXLDKM", "Overall": "5.0", "Content": "I bought this camera for my trip to the Amazon. I used my discover points and there was an issue with the way amazon used my points. However, Amazon and the company that shipped me the camera helped correct the problem immediately.The camera takes great photos and videos. Especially for the price of this product. I have not used all of the features, but so far, I am impressed with the camera.", "Date": "April 8, 2013"}, {"Title": "Great small camera, Great pictures, Poor flash placement", "Author": "Priscilla Rowe", "ReviewID": "R1EHOJCCK1KHR2", "Overall": "4.0", "Content": "I love the quality of the pictures.  As with many other buyers, I agree that the flash was misplaced.  One would think that a company like Sony would consider ergonomics when designing a small camera.", "Date": "April 7, 2013"}, {"Title": "camera works fine but you are on your own about learning how to use it , manual is terrible.", "Author": "David Lancto", "ReviewID": "RHQAV83AHT0FJ", "Overall": "4.0", "Content": "Just takes a lot of practice to get good with this camera, a lot of unneccesary bells and whistles but takes good photos.  The manual is absolutely awful.", "Date": "March 30, 2013"}, {"Title": "Excelent", "Author": "Maria Belen Luna Robalino", "ReviewID": "R23TLRYMEG9H7R", "Overall": "5.0", "Content": "Excelente... Llego el producto a mis manos en el tiempo esperado en el Ecuador. Recomendable para futuras compras en latino america", "Date": "March 25, 2013"}, {"Title": "Awesome Sony Cyber Camera.", "Author": "Amazon Customer", "ReviewID": "R3O1PEZ8ACCYLM", "Overall": "5.0", "Content": "Now this is one awesome camera. It takes clear pictures and has some great fitures love that you can also take videos. I needed this camera last year when we went to the Grand Canyon. Oh Well I have it now for this year vacation!", "Date": "March 22, 2013"}, {"Title": "Muy buen producto", "Author": "Francisco Rodríguez", "ReviewID": "R22ZAVG0NHDCNN", "Overall": "5.0", "Content": "Excelente calidad!! Sony siempre tiene muy buenos productos.  La calidad de las fotos son las que yo esperaba.  Altamente recomendable", "Date": "March 21, 2013"}, {"Title": "Excellent camera", "Author": "German Dario Ramon", "ReviewID": "R1PPDBXA2J2IGL", "Overall": "5.0", "Content": "It is a very versatile camera, easy to use, and with a performance almost a professional. I'm very happy with its utility. I recommend buying it.", "Date": "March 14, 2013"}, {"Title": "Buen producto.", "Author": "Jorge Rodriguez", "ReviewID": "R2EYFEI9ZP9Z4W", "Overall": "5.0", "Content": "Excelente camara de Sony, que dispone de todos los adelantos tecnicos para obtener muy buenas fotos y grabaciones.Jorge Rodriguez", "Date": "March 10, 2013"}, {"Title": "I liked the camera except for USB instead of HDMI and pop-up flash where you hold the camera", "Author": "Ven", "ReviewID": "R2ANJT0RSGX0U6", "Overall": "4.0", "Content": "I like the camera, I had a similar camera with a different model number with HDMI, this one is USB, somewhat troubled me  Other than that, the camera is great.  I didn't like the old style pop-up flash where you hold the camera, somewhat inconvenient.", "Date": "March 7, 2013"}, {"Title": "Works well.", "Author": "Stephen Mathews", "ReviewID": "R1O4N3496VXMZ9", "Overall": "5.0", "Content": "I was looking at this camera when it first was priced at around 250 dollars, but when it dropped down to bellow 150 I had to have it.  It is quite a steal for that price.  the camera takes good photos for the price. I have a DSLR and I have to admit that the DSLR takes noticeably better photos, but it also costed over 4 times as much.  That said, I love this camera and know that it is a steal for the price.", "Date": "March 6, 2013"}, {"Title": "VERY GOOD PRODUCT!!!", "Author": "Edgar Gonzalez M", "ReviewID": "RUBHI4NDS66GJ", "Overall": "5.0", "Content": "Technology in cameras affordable and ergonomically designed. A quality brand like Sony. THE results are very good. I recommend this product widely.", "Date": "March 4, 2013"}, {"Title": "Travel", "Author": "Convinced", "ReviewID": "RLBNYJOKZKVHK", "Overall": "5.0", "Content": "Great travel camera instead of carrying a DLSR.  Multiple features make this very useful even for the Intermediate/Pro photographer.  Recommended.", "Date": "December 14, 2012"}, {"Title": "Camara digital", "Author": "Johana Bourgeot", "ReviewID": "R7BQU5VNZJOKN", "Overall": "5.0", "Content": "Muy buena opcion para la toma de fotografias es una camara que muestra diversidad de opciones la nitiddes de la toma de imagenes es muy buena", "Date": "December 11, 2012"}, {"Title": "Sony Cyber-shot", "Author": "Dianne D. Carter \"dianne\"", "ReviewID": "R1R4WM86L3RTZS", "Overall": "5.0", "Content": "Great camera!  Easy to use and takes great photo.  Zoom really brings in things from a distance.  Movie feature works great too.", "Date": "December 4, 2012"}, {"Title": "Good product", "Author": "Danny", "ReviewID": "R30EQWMDNZI3V8", "Overall": "5.0", "Content": "It is a good product,and it can take the perfect photoes.but just a little pity for me because these's no chinese languaga,so many functions i can't use", "Date": "December 3, 2012"}, {"Title": "great small camera with lots of features", "Author": "manolo", "ReviewID": "R3CIM28V2FK51U", "Overall": "5.0", "Content": "it is compact and yet a 16x optical zoom, anti-vibration feature and panorama shot, great value for the price .", "Date": "December 2, 2012"}, {"Title": "Love it!", "Author": "Shoe addict", "ReviewID": "R3A5MKNIAHNKKS", "Overall": "5.0", "Content": "This is a great camera.It has a very intuitive settings system and works really fast. The images are amazing. Brightness and colors are definitely better than most of the regular compacts. I recommend it 100%!", "Date": "November 30, 2012"}, {"Title": "Sony camera great for travel", "Author": "Seaford", "ReviewID": "R1WO9LGRKNGMP5", "Overall": "5.0", "Content": "This camera has a very wide angle lens that is super for taking pictures of landscapes or buildings when traveling. Plus it has a 16x Optical Zoom which allows for nice close-ups. Sometimes reviewing the pictures taken is a little slow, but it hasn't really been a problem.", "Date": "September 13, 2012"}, {"Title": "Sony Cyber-Shot DSCH90... black bundle", "Author": "lgvs13", "ReviewID": "RUDQETB4656EE", "Overall": "5.0", "Content": "Thank you for your prompt attention to my order.  The camera arrived as promised.  It is simple enough for my family to use.  The 16x zoom is wonderful for our zoo visits. We were so happy that you have a memory card included in the bundle so picture taking doesn't have to wait!!!!", "Date": "July 23, 2012"}, {"Title": "Good camera!", "Author": "Alex", "ReviewID": "R2C2RAJTB4YV7D", "Overall": "5.0", "Content": "It records good video. Takes good pictures. It has manual settings also. Nice interface. Metal material in front. Multy shot! only one minus, when the camera connected to computer with USB, very fast gets battery empty. I don't know why.", "Date": "March 21, 2013"}, {"Title": "Great little camera", "Author": "Alan Merrow", "ReviewID": "R2BXO38GC091VY", "Overall": "5.0", "Content": "Bought it for my wife...she needs the technology to stop the blur when she takes pictures. So far so good.", "Date": "March 1, 2013"}, {"Title": "Still testing but have a couple of problems", "Author": "Margaret Koenig", "ReviewID": "RCWWTZMTNEKPI", "Overall": "3.0", "Content": "Don't like a few items compared to our DSC-H55 :  battery release lever is difficult to use and review and magnifications seem to take much longer.  Most obvious are zoom problems including difficulty focusing at distance and a shadow caused by the lens extension on close up flash shots.  Still testing all the other functions.", "Date": "February 16, 2013"}, {"Title": "Replacement", "Author": "Barbara B. Rollins \"barbara@sharpwriters.com\"", "ReviewID": "R1MNJAG0AXJR6B", "Overall": "5.0", "Content": "Over a hectic Christmas with toddler twins in an overful house, I lost my camera. Tossed out with trash? I bought this, exactly the one I had lost, because I do think it's a very good camera.", "Date": "February 11, 2013"}, {"Title": "Love it", "Author": "jd46ski", "ReviewID": "R2R3BGINJA3YS7", "Overall": "4.0", "Content": "Camera takes great pictures, and is very user friendly.  The flash pops up automatically when required, so you don't forget. My only con is that the flash is located right where you hold the camera, so you must remeber to grasp it in the right place.", "Date": "January 19, 2013"}, {"Title": "Its like a super computer camera....", "Author": "Stofer", "ReviewID": "RTWQ5WV0FJYHA", "Overall": "5.0", "Content": "This camera is impressive, it has a lot of really cool features that are pretty state of the art and has fixed a lot of the problems of their predecessors. It pretty much likes to do everything on auto, so if you like to tweak every little detail on your camera when taking pics this is NOT the camera for you. Personally, I'm lazy, would rather let the camera do all the work. It will adjust to pretty much any scene, and also has some advanced White-balance features that are great when you need to adjust for the lighting your working in. It takes a little while to learn all the features and understand what each one does, and how to use it. There is an EASY mode for those who just want to take a picture and not deal with all fancy stuff. This thing is going to get put to its paces this year. Will update the review in a while after really taking it out to some places.", "Date": "August 17, 2012"}, {"Title": "Sony Camera", "Author": "Terry L. Baird \"Fester Man\"", "ReviewID": "R1OYC0B3YQHUSB", "Overall": "3.0", "Content": "The camera came very quickly. It worked fine at first but later it wouldn'tload the chip or when it did, it wouldn't display the contents properly. I sent it back andgot another one of the same model as liked the capabilities.", "Date": "June 23, 2012"}, {"Title": "excelent", "Author": "beto", "ReviewID": "R3RHLB2YYYZKOZ", "Overall": "5.0", "Content": "good camera,excelent price,it really worth it!all tha basics functions,good zoom,very nice quality pictures,easy to use,if you are looking for good,pretty and cheap this is your option", "Date": "March 21, 2013"}, {"Title": "excelente", "Author": "Juan", "ReviewID": "R77Q5USLJA5XU", "Overall": "5.0", "Content": "todo muy bien,perfecto ,era todo como lo esperaba muchas gracias,100% lo mejor ,DIOS le bendiga......excelente, excelente, agradecido y muy conforme con todo", "Date": "March 19, 2013"}, {"Title": "SONY", "Author": "Opeyemi Sulaiman \"halo2champ\"", "ReviewID": "R3EXGKB15CF2OI", "Overall": "5.0", "Content": "GOT THIS FOR MY SIS FOR A XMAS GIFT AND SHE LOVES IT. YES SHE DOES, YES SHE DOES. YES", "Date": "February 25, 2013"}, {"Title": "Takes good pictures", "Author": "Angel", "ReviewID": "R2IR9HCQVUGZ8Z", "Overall": "3.0", "Content": "I bought this camera to replace my Kodak easy share cx7530. The things I don't like about the camera 1. when I hold it to snap a picture my finger is always ontop of the pop up flash so I have to remember to hold it on the side. 2. The battery lift isn't that great if you are taking lots of pictures like I do. 3. Don't like the fact that you can't charge the rechargeable battery with the usb. You have to remove the battery and insert it into the wall charger. 4. The usb plug is on the bottom of the camera so you have to lay it down to plug it in. 5. does not have internal memory you have to purchase a seperate SD card..Overall for the price of $70 it is a good little camera and takes great looking pictures..It is a good first camera but compaired to my Kodak I would have to pick the Kodak.", "Date": "December 29, 2012"}, {"Title": "This camera has not good picture quality", "Author": "hari pandey", "ReviewID": "R1AFYF2T989N6J", "Overall": "2.0", "Content": "This camera is not that much good, I did not found that much good what I expected. Its picture quality is very bad. Even though it has  good thing 16Mp and 16x optical zoom but picture quality is not good. Pictures are like you washed with water.The deal was excellent but quality is worse. I don't recommend anybody to spend money on such type of camera. If you will spent your money on this camera, think that you just wasting. If somebody give you this camera @ $40 then it may be good but for$41 is not a good deal", "Date": "December 24, 2012"}, {"Title": "good", "Author": "Richard Perez", "ReviewID": "R3ALUOARSJOJAY", "Overall": "5.0", "Content": "very goodi vove itit is what i wantso nicei like itthans so muchit is great", "Date": "March 17, 2013"}, {"Title": "Disappointed", "Author": "Roy Guercio", "ReviewID": "RCUB7PHOI0C7N", "Overall": "3.0", "Content": "Bought this camera for the zoom and the name.when I took it out of the box it was heavier than I thought.I guess should have expected that with a 16x zoom.Its a big camera.Does not have a shortcut button for videoThe flash is in a terrible spot in front of the camera.I ended up returning it for a Nikon Coolpix.I'm happy with that.", "Date": "May 15, 2012"}, {"Title": "Sony H90 Digital Camera", "Author": "Rene F. De Groof \"rdegro\"", "ReviewID": "R1YVEVNQWEAH66", "Overall": "1.0", "Content": "First off I really miss the optical viewfinder, it is awkward to try to see your composition on the LCD screen due to reflections, the 16X zoom was really the selling point.  I shot some video but no more, to download it you have to install the included PlayMemories software which grabbed all of My Pictures files.  Had I not backed up regularly I would have lost all of those files,  I strongly recommend not using that software, if you need to shoot video get another brand camera.  This is my fifth Sony, I had no trouble with the other four, why they changed I'll never know but this will be my last!  The other four are still in use, W80, (2) W120 and an DSC F 828.  The processing time takes way too long and you can miss shots. This P&S; was to replace an older (but working fine) one, as carrying one of my DSLRs is out of the question.  In summary I dislike this camera and as I mentioned this is the last Sony, I will probably donate it to Goodwill and buy a Nikon or a Canon.", "Date": "May 21, 2012"}, {"Title": "Sensor CMOS?, no, is CCD", "Author": "Lis", "ReviewID": "RNUNSQGRGZGPX", "Overall": "2.0", "Content": "According to this link [...]  is CMOS not CCD sensor as shown here. why?This site is recommended to see the description of a deep chamber.", "Date": "August 14, 2012"}, {"Title": "camera", "Author": "blender", "ReviewID": "R3A968D2VYKZZB", "Overall": "5.0", "Content": "i used in bigs ands smalls word in the company, also for travels, good resolution, lite and comfortable easy to use", "Date": "April 17, 2012"}], "ProductInfo": {"Price": "$199.99", "Features": "16.1 megapixel 1/2.3\" Super HAD CCD image sensor\n16x optical zoom\n3.0-inch LCD\n720p MP4 HD movie mode\nSweep Panorama mode - up to 360°", "Name": "Sony Cyber-shot DSC-H90 16.1 MP Digital Camera with 16x Optical Zoom and 3.0-inch LCD  (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41VyK7sbcdL._SX300_.jpg", "ProductID": "B006K552CU"}}