{"Reviews": [{"Title": "Awesome camera and excellent customer service", "Author": "Pastor, Theologian", "ReviewID": "R29WKHQI7C415H", "Overall": "5.0", "Content": "This camera is excellent. It is very easy to setup - simply plug it into the wireless router, scan the code on the camera, and you're done for iphone setup. PC setup is easy too. The camera is excellent - the image is great. There are some awesome options as well - you can flip the image if you need to mount it upside down and you can take a snapshot of the video.The camera is very good. My only gripe is that the audio could be better. But, the night vision is EXCELLENT. I don't know what the other reviewer is talking about. It's military grade.I had to contact customer service with a few questions before I purchased it and they gave me an immediate response. They were very thorough and polite and I was extremely impressed with their courtesy and professionalism. They bent over backwards for me because I had to get some detailed info before the purchase and I had to get more tech specs after I purchased it (for my employer). Each time, they wrote back quickly and accurately.This is a great, compact camera for a great price. For those asking about the size, it's about 3.5 inches by 1.5 inches by 3.5 inches. I highly recommend it.", "Date": "September 11, 2013"}, {"Title": "Highly recommend", "Author": "North Texas Family \"JJ\"", "ReviewID": "R21CBQ033V9TCR", "Overall": "5.0", "Content": "These cameras for the price work great.  My only wish would be that they would rotate but they did not say they did.  These are Great cameras and very easy to setup.", "Date": "December 3, 2013"}, {"Title": "Not What I Expected Either...", "Author": "TiaBDia", "ReviewID": "R2NHMFVZJ8437C", "Overall": "3.0", "Content": "I must have over looked the dimensions of this camera, and assumed it was tiny because I thought I found it under spy/ surveillance. But maybe it's all my fault for not double checking before I clicked Pay Now. It seems like it might be a good camera with a lot of functions, but I could never get it to work with my iPad. Don't know if it was my learning differences making it challenging for me, or the shotty Internet connection at the time of attempted set up, or the device isn't as easy to set up as they make it sound. Maybe all of the above. I hope I don't have as much trouble as the other lady returning it...But I did notice the company responded to her complaint with specific contact info. Which is professional and promising.", "Date": "September 8, 2013"}, {"Title": "Not what I expected", "Author": "SimpleLife", "ReviewID": "R282FN1BL00URR", "Overall": "2.0", "Content": "Amazon as a company is fantastic.  But... some of the companies they deal with are not!  I ordered the camera and it didnt meet my expectations. So when I inquired about sending it back I recieved a email string about a week long from the company -TriVision.  It was a hassle, even though I did finally get the refund, there was too much red tape involved with a simple return. The package and components were in original packaging and the camera wasn't even used. It just wasn't what I was looking for. Amazon may want to keep an eye on this company, and maybe have a probation period for them.. I would just as soon drop them from selling through Amazon.", "Date": "August 23, 2013"}], "ProductInfo": {"Price": "$259.00", "Features": "Wireless IP Camera With Dedicated Free iPhone/iPad and Android Apps\nInfrared Night Vision to 15 metres\nBuilt-in SD card DVR expandable to 64Gb & Multi-zone Motion Sensor\nMotion Triggered Recordings and Alerts by email and FTP\nEquipped with long range wireless, infra-red night vision, built-in video recorder, motion sensor, email alerts and more, the camera is an all-in-one home monitoring system with no additional hardware or software needed.", "Name": "TriVision NC-217WF Wireless IP Network Camera home security camera, Motion Alerts, Infrared Night Vision, Built-in DVR, Quick 3 Step Install with Our Free iPhone, iPad and Android apps and more. Ideal for Home CCTV or as a Video Baby", "ImgURL": "http://ecx.images-amazon.com/images/I/41N-zoB-u9L._SY300_.jpg", "ProductID": "B006G8HSGO"}}