{"Reviews": [{"Title": "Emerson EDC240 = Waste of money", "Author": "JavaBratt", "ReviewID": "RGD5TXI0GC25Q", "Overall": "1.0", "Content": "I recently purchased this camera for $30, and upon receiving it I was extremely shocked at how cheaply made it appeared to be. The plastic seemed very lightweight and thin. I'm talking to the point that disposable cameras seem of MUCH better quality.That aside, I took a few test pictures with all the best settings (sharpness, resolution, etc.). The pictures turned out awful! They were dark, grainy and just overall BAD. I had purchased this camera to replace my old 7.1MP camera, which took MUCH better pictures than this one, which is claimed to be a 12MP. THAT IS A COMPLETE LIE! My BlackBerry camera is only 3.2MP and takes far better pictures than this Emerson digital camera does!To top it off, I had only had the camera 15 minutes at most when the brand new batteries were showing as low and the power on/off button sank inside the camera rendering it completely useless. I of course tried to get a refund from the woman who sold it to me, but she refused. In the end I'm out $30 and the camera :(Final thoughts.... Save yourself the aggravation and buy a better camera because this one is NOT 12MP as Emerson claims, and is a complete piece of JUNK! You would be better off with a disposable.", "Date": "April 18, 2012"}, {"Title": "Zero stars", "Author": "M.R.M", "ReviewID": "R1ALHJB1XETRGS", "Overall": "1.0", "Content": "This camera is a piece of junk. My son got it for a birthday present, and I noticed right away that the pictures were grainy, the flash was awful, and if the subject was moving even slightly, the pictures came out blurry. BUT, my son is only 7 and this is just a cheap camera for fun, so I didn't really care. After using it for about 20 minutes, the thing is now busted. The power button is sunken in (just like the other reviewers said) and I had to take the batteries out to turn it off. When I put the batteries back in, I couldn't turn it back on. Not sure we can even return this, since it was a gift from an out of state relative and the packaging is in the garbage. DO NOT buy this camera.", "Date": "January 18, 2012"}, {"Title": "Worst camera ever made", "Author": "Martin LaGrow", "ReviewID": "R1MU51TALKR27J", "Overall": "1.0", "Content": "Emerson should be ashamed of themselves.  Even $20 for this camera is a ripoff.  Pictures are poor quality, and the button broke like others have stated after a few uses. I will never buy an Emerson product again.", "Date": "February 5, 2012"}, {"Title": "Defective right out of the box", "Author": "Tankman2000", "ReviewID": "R1EXC1W6NILWVS", "Overall": "1.0", "Content": "This is a horrible product.  It had a defective spot on the screen right out of the box that showed up on the pictures themselves.  The button broke after about 30 pictures were taken.  We have attempted to contact the company 6 times via email and vm with no response.  Now the vm says it's full. Seems almost like a scam operation.", "Date": "February 25, 2012"}, {"Title": "Awful..", "Author": "Heather", "ReviewID": "RS6RR1UKTKCXY", "Overall": "1.0", "Content": "This camera is awful. I got if for Christmas and was so excited to get a 12mp camera, well it's not even close. The pictures are horrible and blurry, and in the instructions it shows to fix that to move a switch, and the switch doesn't exist on the camera! I took a few pics, was too frustrated and put it away, the next day it wouldn't even turn on! The power button was sunken in. My mother ended up exchanging it at the store, but I don't even want to open this one because looking at it just in the package I can see that the power button is sunken in! This should not be sold, it is a complete rip off, and is worthless. I am very upset and disappointed.", "Date": "January 5, 2012"}, {"Title": "Not worth it!", "Author": "Stephanie", "ReviewID": "R3B1H2ATNUR71A", "Overall": "1.0", "Content": "My husband and I bought 2 of these cameras for our kids for Christmas. We didn't expect much for what we paid (around 30 bucks a piece at a pre-Christmas sale), but we certainly expected more than we got!! The second camera wouldn't even power on after installing two different sets of batteries!The screen is horrible - pictures are fuzzy and grainy. I hoped it was just a bad screen, but nope. The pictures are accurately reflected on the review screen. Photos are grainy, blurry, and the majority have a reddish orange cast to them (no matter the location where they were taken).I wanted a more 'real' camera that had removable memory and a review screen for my elementary-aged daughter, but honestly, her previous 1.3 MP Disney Pix Tigger and Pooh camera took better photos than this (supposedly) 12 MP camera with flash and zoom!The only good thing about this camera is that it 'looks cool.' But looks are nothing if the camera doesn't even take a good picture!Very disappointing Christmas present! Avoid buying this camera! You're better off searching for a well-known brand, older model, at a reduced price!", "Date": "January 4, 2012"}, {"Title": "Don't buy", "Author": "Leo", "ReviewID": "R2F88CDQ59A6QL", "Overall": "1.0", "Content": "I bought 2 of these cameras at Bed-Bath and Beyond for $29.  The first one broke about 1 hour after taking out of the package and the second one broke a day later (the on/off button depresses and won't come back up).  DO NOT BUY this camera", "Date": "January 3, 2012"}, {"Title": "Worst Christmas gift ever", "Author": "saparapaaa", "ReviewID": "R2A81TSVN9QG81", "Overall": "1.0", "Content": "I got this camera as a gift from my mom on Christmas. I never had much use for a camera, so today was the first day I tried it out. First of all, 12mp is a lie. The images are weird and grainy, even in amazing lighting. Shortly after I started taking pictures, it started to tell me \"memory full\". I'm not sure if that's because of my memory card or what, but still. I probably took, let's say, ten horrible pictures of my new puppies in our backyard looking dark and grainy at ten thirty in the morning. And then, to top it off, my battery died. It was fun while it lasted! Never gonna buy an Emerson product, or accept one as a gift.", "Date": "April 1, 2012"}, {"Title": "Terrible, terrible product.", "Author": "Scott G", "ReviewID": "R2SNUCX5K43FJ1", "Overall": "1.0", "Content": "I bought this camera to replace my 2mp Samsung digital camera that I purchased around 03-04... I did not expect to be downgrading when purchasing something that is advertised as 12mp. This camera is complete garbage. Every review before this one is correct in saying this camera is cheaply made, the pictures are grainy at best on even the best settings available on the camera. I would have been happier flushing $40 down the toilet than I am with this purchase made from Dollar General. I used to trust Emerson products as being inexpensive and decent but after this I doubt I will buy anything from them ever again. Simply put: DO NOT BUY THIS PRODUCT.", "Date": "May 21, 2012"}, {"Title": "Why? Oh, why?", "Author": "Mikkel D. Frieslan", "ReviewID": "R3BA8GJOV99NAE", "Overall": "1.0", "Content": "Why is Amazon still carrying this product? Guilt by association!! This is the Yugo (very cheap cars built in Yugoslavia) of all things electronic... the \"Dollar Tree\" of cameras. Flush your $$; don't give it go crooks.", "Date": "December 5, 2012"}, {"Title": "EmersonEDC210", "Author": "handyman", "ReviewID": "R2PQ3QWWQ61BTO", "Overall": "2.0", "Content": "Bought this thing and the first time using it it broke so I put it in my desk and forgot about it Today I had some time on my hands so I look on the net and it looked like everyone was having the same problem so I took it a part 6 screws once I pulled the cover off I saw the botton pushed down looking it over I noticed the board came out and was laying on another board so I took it put a dab of glue on it put the switch back in place closed it back up and took some shots The unit powered up and the pictures came out great. So don;t throw it out fix it,it looks like they forgot to put the board in the right way THEY SHOULD RECAL ALL OF THEM easy fix hope this helps and good luck", "Date": "March 29, 2013"}, {"Title": "HORRIBLE", "Author": "Michelle N. Downing", "ReviewID": "R2HWQC55X88ZCZ", "Overall": "1.0", "Content": "If i could give this 0 stars I would. First of all, when I bought this I thought it had a flash, but I was wrong, a little LED light comes on and give you very little light. Second, it broke the day after I bought it. The power button broke so I can't even turn it on...I only took about 20 pictures with it. Third, it is plastic and flimsy. I didn't buy it here on Amazon, I bought it from Dollar General online. Thankfully it was on sale for only $12 because I know there is no way it is worth the $40 they usually charge.", "Date": "January 6, 2013"}, {"Title": "Emerson 12.0 camera", "Author": "shamrock", "ReviewID": "RJMWL74X781JO", "Overall": "1.0", "Content": "I bought this camera to take on vacation and after taking only 5 pictures I pushed the button for another and it went down in the camera and would not pop back up.  Therefor I had to spend more money and buy another camera.  Was totally disappointed with the product and of course I had thrown away the re receipt.  Had always thought That Emerson had a good product. No stars!", "Date": "August 7, 2012"}, {"Title": "Really ... ZERO stars would be generous!", "Author": "GeauxCoMom", "ReviewID": "R1OGR1DG55F7TP", "Overall": "1.0", "Content": "This camera would be a rip-off at $10 let alone the $30 that I paid for it from another discount site.  It is the cheesiest piece of junk I have ever seen!  I don't mind plastic ... but come on - flimsier than a cheap dollar store trinket. And as stated before, the pictures are of extremely poor quality - nowhere near as clear as the 5.0 mega pixel camera that it was meant to replace.  There is no way this is a 12mp camera!  Plastic \"on/off\" button sunken into body of camera after less than a 4 pictures. Save your money and avoid the aggravation - keep looking for something else!  I'm currently trying to get a refund!  Red Emerson 12 Mega Pixel Digital Camera With 2.4\" Touch Pad LCD Screen & SD Slot", "Date": "July 7, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Capture your favorite moments with this 12 megapixel digital still camera from Emerson. The camera features a 1.8\" LCD display screen and 4x digital zoom.\nIncludes an expandable SD card slot\nSoftware is includedBuilt-in flash\nUses three AAA batteries; not included\nAvailable in black only", "Name": "EMERSON CAMERA DIGITAL 12MP ARCSOFT MEDIA SOFTWARE BLACK", "ImgURL": "http://ecx.images-amazon.com/images/I/51lPdB6EXtL._SY300_.jpg", "ProductID": "B006K2CN0M"}}