{"Reviews": [{"Title": "Above average point and shoot", "Author": "Richard A. Carnes \"Photostudent\"", "ReviewID": "R12OQAH7GZ930A", "Overall": "4.0", "Content": "First of all list price has been lowered to $99 for this camera. That puts it in the same price range as 5x zoom cameras so this is a great value. I really dislike other cameras that look like fancy change purses. The Vr350 has the nice look of a traditional rangefinder. As soon as I turned it on I was really struck by how wide the lens could go. Generally I found the picture quality about average for a camera in this price range. Longer zooms are a compromise. Poor low light performance is part of that compromise. On the other hand flash exposures were excellent. The long end of the telephoto was less than I thought it would be but I realized that starting at a very wide angle meant that I would get less of a telephoto effect. Being able to crop a 16mp file should make up for this however. Some people have complained about lack of separate charger but I prefer charging battery in the camera. Typically, the LCD is hard to see in bright sunlight. I prefer an optical viewfinder but they have disappeared from cameras in this price range. I do not shoot much video so have not tested that function. The controls are a bit different than I am used to but I rather like it.Pros:PriceStyleLong zoom lens with very wide angleCons:Average picture qualityPoor low light abilityDim screen", "Date": "May 8, 2012"}, {"Title": "Great zoom, good quality", "Author": "MJ", "ReviewID": "RR08ITUZ6OW1V", "Overall": "5.0", "Content": "I bought this camera (OLYMPUS VR 350) some months ago (for only 90usd), unfortunately i was silly enough to return it and get a nikon (s2600) instead (which is terrible by the way)... now I am getting this camera AGAIN.I am gonna start by the negative points(the reasons i returned it):N1- It doesnt support really high contrast scenarios:I was using it in NYC so I got frustrated I could take \"great\" pictures of Times Square, and the billboards looked too fair in the images...N2- It doesnt have the most saturated colors: if you've had a reflex you can totally tell the difference in the way the image is processed, you can \"feel\" the lenses are darker in this cameraAnd that's it. Later on, when I had a TERRIBLE Nikon coolpix s2600, (which i bought just 4 the brand). I realize I was too severe with the olympus. About my N1, ANYcompact camera would have the same issue, the only alternative is doing HDR. and the N2 can be \"fixed\" with any program.Now the possitive:P1: It has a great 10x optical zoom, there are very few cameras that are so thin and with that capacity.P2:(unlike other compact cameras) this one records the images very quickly, I used it at its ful capacity (16MB) and shot a frame after another. -i was using a 16 GB SD card-P3: It has a build-in sort of filter, that makes your skin look pretty great when doing self portraits (or somebody else's)P4: It has  great design, aluminum-feel... it doent feel cheap at all.P5: It has 3D functions (which i never really used)P6: Records HD videoP7: the price (i regret i returned it coz now it costs almost the double than the price i paid =( )OVERALL: It's great for daylight situations, (you can adjust the exposition), taking pictures in a long distance (with daylight), indoor- parties.Not so great for: trying to take a Manhattan skyline picture from Brooklyn at night and in movement (those 2 factors are good together).A nice replacement when you dont wanna carry your reflex camera (it's less than a reflex but WAY MORE THAN A COMPACT camera)", "Date": "January 11, 2013"}, {"Title": "Olympus Camera", "Author": "Oliver Doe", "ReviewID": "RWO7PHU9UA05U", "Overall": "5.0", "Content": "This camera is a work of art. It does exactly what  the manual says and in the way the manual states it. Beautiful piece of equipment.", "Date": "January 16, 2014"}, {"Title": "Very poor at best", "Author": "SandyB", "ReviewID": "R3HBIERZAURP5R", "Overall": "1.0", "Content": "This is the first Olympus that I have been disappointed in. I gave it a good try in all conditions but it just continues to produce poor quality pictures. There are just too many important events in one's life and the last thing you want to worry about is poor results from your camera. Consistently soft images,lengthy lag time between focus and flash and did I say poor quality images in all modes and all ASAs. Geez, what a piece of junk. Oh, I forgot to say that in perfect outdoor light, in perfect conditions it will give you passable images. Forget everything else.", "Date": "October 20, 2013"}, {"Title": "Olympus Vr-350", "Author": "Shirley Tramm", "ReviewID": "R1QFFOGR1T1UX9", "Overall": "3.0", "Content": "This camera is OK. I have a baby that I try taking pics of using this camera. I'm not impressed with the shutter speed. The only thing I like is the compactness of the video feature, but these days you can get that on any smart phone.", "Date": "October 5, 2013"}, {"Title": "It died in less than 7 months", "Author": "V. Acevedo \"hungariangirl\"", "ReviewID": "RJCKSACX6VIKS", "Overall": "1.0", "Content": "I bought this camera because it seemed like a great deal for its price. However it died in about 7 months. I hardly used it and finally when I needed it during my travels, it just stopped working. What it is doing now is making several small beeps and doesn't turn on. I took the battery and memory out, I tried to connect it to my computer, I charged it and charged it again, nothing works. When I press the On/Off button, it just closes (because now its only stays open) then opens back up then beeps. The screen is off. It still looks like new, never fell, like I said, I hardly used it. Garbage!", "Date": "July 11, 2013"}], "ProductInfo": {"Price": "$159.99", "Features": "16  mp  10x", "Name": "Olympus Vr-350 16-Megapixel Digital Camera | Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41qE77Tpe9L._SY300_.jpg", "ProductID": "B006WZ8UVI"}}