{"Reviews": [{"Title": "Read the stats closely.", "Author": "Jack", "ReviewID": "R2UA3NT7S4OG0Z", "Overall": "1.0", "Content": "This displays in D1 which is a high resolution, but only records video in CIF which is pretty low resolution. So your cameras will look great live since they will display in D1, but recorded video will be of lesser quality because it was recorded at the lower resolution CIF. Not very good if you want quality recordings. I would hardly call this DVR \"Professional\"", "Date": "February 14, 2013"}, {"Title": "Adequate", "Author": "Enthusiastic", "ReviewID": "R2NXX9VP0ZLOE0", "Overall": "2.0", "Content": "The Professional 8 Channel HDMI is ok. It is anything but simple to setup and impossible (So far) to view on an android device within my home network. (I have no intent on accessing it form outside my network).  The instructions are poorly written with pictures so small I have to use a magnifying glass to read them.  One good (?) is it is a standalone DVR so you only need to connect it to some type of monitor to set it up. It took me 4 hours to get it working and another 2 hours to get access via a PC using Internet Explorer with Active X security holes open wide. (Fortunately I don't use IE on a regular basis so hopefully the holes will only impact security when I view my cameras.)  I tried the Asee app that came on a mini CD  and downloaded it again from the Google store as well as 6 or 8 others for a Toshiba tablet and have yet to get to log into the DVR at all. I have had a 4 channel DVR since 2007 that came with Video Serve E software that easily loaded on a computer (not required). The Video Serve E software would find the DVR on its own and help you connect.  I stopped using it when the hard drive died. Maybe I need to go back to it..... I would definitely not recommend this unit to a friend.", "Date": "March 10, 2013"}, {"Title": "HDMI makes a huge difference in Picture quality", "Author": "Chris Roberts", "ReviewID": "R2H8RWHJZL28AD", "Overall": "5.0", "Content": "I also bought this DVR after the first one I bought from a cheap online bid site died soon after I set it up. I wanted one that would last longer and going to 8 channels would give me the option of adding more cameras in the future.I added a 2TB drive and four still cameras with IR illumination. It is working great. I had a PZT camera and a joystick that worked great but again it was a cheap one and the camera died after 6 months of use. This is no fault of the DVR, I just wanted to point out that it did work. If you want a PTZ camera it will work just get a decent PTZ camera.The HDMI compared to a serial cable makes a huge difference in the quality of the video recorded and what you see on your screen.  I have a long 25' run and using a decent HDMI cable it works great.It is pretty small and only has room for one hard drive so if you can budget it get the max 2TB and it will provide about a months continuous recording.", "Date": "March 19, 2012"}, {"Title": "Pro 8 Ch HDMI DVR", "Author": "ztecman", "ReviewID": "RL6TT2WW2YIAC", "Overall": "5.0", "Content": "The Professional 8 Channel HDMI is a robust, simple to setup, Easy to use Network H.264 Standalone (meaning no computer needed other than some type of monitor) DVR. Work first time on iPhone with ASee app downloaded from Apple App Store there is also a ASeePro+ version Would recommend highly to a friend. Professional 8 Channel HDMI Network H.264 Standalone DVR (No Hard Drive Installed) for CCTV Security Camera System - iPhone, Andriod Viewing. HDMI & VGA. Windows Graphical Interface; Embedded Real-time Linux 2.6 Operation System. Preview, Record, Playba...", "Date": "September 19, 2012"}, {"Title": "Nice DVR", "Author": "rise", "ReviewID": "R122H3VO0PKQ2Q", "Overall": "4.0", "Content": "This was one of the better DVR's I've tried.  I used a few different models for different customers and this one was very feature rich, relatively easy set-up and good quality.  Actually, thinking of it, probably the highest build quality I have used.  I will definitely be using more of these in the future.", "Date": "January 31, 2013"}, {"Title": "Finally HDMI", "Author": "ZombiePlanet \"REC\"", "ReviewID": "R1KCUO6C1JES1W", "Overall": "5.0", "Content": "Finally a home DVR that has an HDMI output.  I have searched and called a number of private sellers around my area looking for a unit with HDMI out.  So far this is the only one that I have come across.  I highly recommend it.  Hooking it up was a breeze, although I have experience installing such devices.", "Date": "September 13, 2012"}, {"Title": "software is crappy", "Author": "Frequent Amazon Shopper", "ReviewID": "R1HZMPXZX8MVP1", "Overall": "1.0", "Content": "The DVR itself is decently built, working as described, but the Client software for PC and ASEE mobile are simply crappy. The Client software crashes all the time when you access the Remote Setup function. I learned to have the software run a couple of minutes then it may not crash but if you let it run for too long it also crashes. The ASEE for mobile access has a fixed frame for small phones. It's just too small for my Galaxy Note, and it does not allow multi-camera views. You must view one camera at a time. I have 6 cameras. Guess what a pain in the xxx that creates. I wanted to return this piece to Amazon but the seller is trying to push back.", "Date": "September 12, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006LRZPZ6"}}