{"Reviews": [{"Title": "So Far So Good", "Author": "AJ", "ReviewID": "R1OSGNAG9UNQ1N", "Overall": "3.0", "Content": "It's been a love-hate relationship between electronics and third-party batteries. Back in the day when when appliances just needed the right voltage and amperage, it didn't matter too much who made it as long as the specs matched and met the (albeit low) tolerance thresholds. But as electronics became more power hungry and picky because of the high-load/discharge nature, things started to get complicated. Add in international safety requirements, consumer reports of explosions and leakages, and it soon became a different landscape.Digital cameras in particular present a unique challenge for third-party battery makers. Camera makers know accessory sales are the only way they can make money after you buy a unit. In so doing, and compelled by new safety standards, as well as a need to provide engineering innovation, they started building in efficiency and safety circuits into the cameras, so it would only accept the right batteries (read - *their* batteries). Although expensive, these batteries would be guaranteed not to leak or explode (theoretically), as well as provide detailed feedback to the camera on how much charge remained, how many times it had been charged over a lifetime, how much theoretical life it had before it needed to be disposed and replaced, etc. In this particular purchases' case, the Nikon J1 doesn't report back any of those fancy statistics. At the most, you'll get a life-remaining four segment bar in the LCD display. That's it. With that in mind, I didn't feel too leery of purchasing third-party batteries for this unit. If you're using a J1 heavily like I am, that LCD is the only way you can visually frame your photos, so it will be on a LOT. And that activity eats through batteries like convetioneers at the free lunch buffet.So far, it's all been good news. I deliberately took my MH-27 charger to a location where I could observe it recharging the DavisMax units, in case of fire or other unexpected \"incompatibilities\" and be able to deal with it quickly. Mind you, I've been recharging batteries and building recharge, drain and recycle schedules ever since I owned a Nikon D1 with the evil NiCads back in 1999, so I've seen and felt most of the operational challenges that can happen with non-OEM batteries. Better news, it didn't blow up. Both units recharged cleanly, within 30 minutes. I don't know if that's because of a partial charge when it was shipped to me or does it mean that it won't hold as long a charge as the real deal? Time and field testing will tell.Packaging - they both came in generically branded (i.e., no DavisMax or any other distributor markings) cardboard boxes. They were wrapped in plastic bags and had a particularly noticable petroleum-product smell when I first opened and handled them. This could be due to the batterie's outer shell manufacturing. I wasn't so happy with the fact that they didn't come with protective end-caps, so I'll need to jury-rig something so I'm not wandering around in the field with the contacts exposed and potentially bouncing against each other in my bag. There was also a generically written set of instructions - one side talked about the battery, and the other about a charger - well, there is no charger in this bundle, so it must be for some other bundle kit out there. In any case, the instructions were written in that obviously-translated-from-a-foreign-language-into-English kind of stiltedness, although the grammar was much better QA'd than some instructions I've read in the past.Other than that, for the cost, it can't be beat, asssuming they hold up in field performance. I will update this review in a couple of months to give folks an idea of the sustainability of this product. For now, I will give it a cautious three stars, adequate but don't expect any frills for the price you paid.", "Date": "July 17, 2012"}, {"Title": "works as good as the nikon battery", "Author": "B. Hosters \"stickinpoo2\"", "ReviewID": "R1NMCN0D9FZPOP", "Overall": "5.0", "Content": "i have had this for about a year now and the still hold a charge as good as my nikon battery does", "Date": "March 4, 2013"}, {"Title": "Batteries", "Author": "Stephanie", "ReviewID": "R1X9NXK7BHYQUZ", "Overall": "5.0", "Content": "This product was an excellent price and provides me with the security of knowing I will always have battery backups for my camera.  They charge quickly and seem to last pretty long.  They arrived quickly in the mail.", "Date": "June 21, 2012"}], "ProductInfo": {"Price": "$17.37", "Features": "TWO EN-EL20 Rechargeable Lithium Ion Replacement Batteries\n(See Description for Compatible Models)", "Name": "Nikon 1 J1 10.1 MP HD Digital Camera System TWO EN-EL20 Replacement Lithium Ion Battery DavisMAX Accessory Kit ENEL20 Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/41qBJbqeS9L._SY300_.jpg", "ProductID": "B006IXTDTC"}}