{"Reviews": [{"Title": "What an incredible system!", "Author": "Josh Adams, \"Rock Crushes Paper\"", "ReviewID": "R3U2MMRVEEUW02", "Overall": "5.0", "Content": "Background: I have used the same 1000 watt 5.1 system from Samsung for nearly four years.  About two years ago I added the Formula F-12 subwoofer.  If you're in the market for a mid-range sub, the F-12 is a STEAL.  Long story short, the Samsung system was good for a small room, but quickly lost any punch or \"theatre experience\" once it was moved into a larger space.  I needed something to fill a larger room that is approximately 20'X30'. In replacing the system, I went with the following equipment:Sony STRDH-830 7.1 RecieverSony SS-CN5000 Center ChannelSony SS-F5000 Floor Standing Speakers (Left and Right front)Formula F-12 Subwoofer (475 watt)Sony SS-B3000 Bookshelf Speakers X 4Media Bridge HDMI'sIn the past I have had friends who have spent over twice what I have on a home theater system, but in comparison I'm getting much deeper lows, clear midrange, and crystal clear highs than I've heard out of their Yamaha, Denon, and others.I'm not an audiophile by any means, but I appreciate what I hear.  Here's a very simple pro/con look at the STRDH-830:PROS:- Only 1 HDMI connection needed to run to my display.  Any connected equipment that is displaying less than 1080P is automatically upconverted.- The included microphone autobalanced all speakers to my room in less than 10 seconds.- Everything feels quality, heavy.- The available sound fields to choose from are many, and all are distinctly different.- 3D compatibility is a plus, although I have yet to use it.- Documentation with the unit is clear and easy to understand.- Inputs are reassignable to other sources.  (For example, I assigned one of the composite video channels to the optical audio.)- The 2 Channel Simulated surround sound for smaller setups is KILLER! It works surprisingly well.CONS:- The remote is needlessly confusing and bloated.- The GUI can be be frustrating, unintuitive, and unforgiving to learn.- Although the unit has 5 HDMI ins, component inputs, composite input, you can only use 5 input types at anytime.- Can be a bit expensive when compared to the other 7.1 systems Sony has available, but new tech always is.Bottom Line:  I saved a few bucks to get this receiver over the others Sony has, and am very pleased with my purchase.  There are a few things like I mentioned above that can be frustrating, but that's when I turn my system up louder and melt into my seat!  Every system has flaws, but for the price and the result I can't give this any less than 5 stars.[Edit] After some continued usage I'm still very pleased with the STRDH830.  But I do have two important things to note.  First, the receiver is capable of pumping out 140 watts of power to each of the 7 channels.  In comparison to other units like the Yamaha RX V671 that only puts out 90 watts of power per channel (http://www.amazon.com/Yamaha-RX-V671-7-1-Channel-Network-Receiver/dp/B004QR56SE/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1336582481&sr;=1-1), you are getting a much more powerful setup for your home theater here with Sony, for much less dough.The auto-calibration that the system provides is amazing.  It detects the size of the speakers used, locations, power, etc.  The auto-calibration will NOT set certain preferences automatically, so don't expect the calibration to pick up on your personal tastes.  After the calibration I selected \"Dynamic\" in my surround settings to make up for the poor acoustics in my room and bring a more theater-like experience.  I was blown away by the difference once I found this option.  (It took me a week to discover this though)The last thing I'd like to mention is the horrendous USB interface for playing music.  If you are planning on playing music from an iPhone/Pod/Pad or any other MP3 source, do yourself a favor and just buy a 1/8\" to RCA cable and control your music through the music device and NOT the receiver.  The GUI interface for USB music is slow, clunky, and annoying if you have more than 6 artists or albums to scroll through.I can't recommend this purchase enough if you are tired of dealing with weak \"Home Theater Packages\" and want a real audial experience.", "Date": "May 4, 2012"}, {"Title": "Great clear sound", "Author": "Gadgets on a budget", "ReviewID": "R1RS2908NQ6ZB7", "Overall": "5.0", "Content": "I had a pioneer vsx-820k that failed and best buy let me choose a replacement so I got this.I wanted the newer pioneer model (vsx-822k) however I use 2 optical inputs and the new pioneer receivers all use just 1. Fortunately Sony has 2 and more power,I set every setting manually and skipped the auto-calibration. The instructions are easy and after set up the sound clarity is really impressive. I could hear greater detail at lower volume due to better power and efficient delivery.I believe sony receivers have really improved a lot over the last few years. I have a five year old str-dg510 in my bedroom home theater and when I connected my living room speakers (polk rc80i) it was very underwhelming. That's why my old pioneer was a great find. The strdh830 improves the sound even Moore than the pioneer receiver and is actually easier to navigate its features.Once I try the iPod feature I'll review that functionUpdate: 11/12/12I've tested the iPod function using my iPod touch. The reciever accesses the iPod's menus and songs faster than my old pioneer receiver did. It also skips songs in pandora if your playing it through the iPod.Having an iPod touch connected can make up for the lack of wifi and built in pandora. The sound is good and you can either directly control your iPod manually or with the included remote.I know audiophiles look down on sony receivers and I was drinking that kool aid til my pioneer started failing after 2 years of ownership. I had to choose my replacement at bestbuy without a lot of researching since I was under the impression my pioneer was repaired and coming home with me.The only thing better about the pioneer in my opinion is that all the speaker  connections were binding posts instead of the clips found in this Sony. Aside from that I'm satisfied with this receiver and look forward to plenty of music and movies to come with it!", "Date": "November 11, 2012"}, {"Title": "First Look...", "Author": "Thinker", "ReviewID": "R3OR3525G1UMBQ", "Overall": "4.0", "Content": "Good unit, not too hard to learn if you can read the little book. Does have onscreen GUI mode, but no overlay. Bidirectional HDMI works well with Sharp TV.  Turn off TV and receiver goes off too.WARNING: When working with HDMI turn off everything when you plug and unplug cables. If you don't things go black.The automated calibration and set up is easy with the included mic.Sony PS3 was easy to hook up and works well with the new Amazon Prime Instant Video.  Great HD Video.", "Date": "April 9, 2012"}, {"Title": "Turn Off \"CONTROL FOR HDMI\" and \"AUTO STANDBY\" !!!", "Author": "Kimolaoha", "ReviewID": "R2WT7MS2GKW66V", "Overall": "5.0", "Content": "This is a very nice AVR indeed, and I won't reiterate the features, advantages, and accolades . . .BUT . . . take it from me here . . . unless you absolutely KNOW that you want the default \"Control for HDMI\" and \"Automatic Standby\" functions to operate, save yourself A LOT of frustration and just go into the GUI mode (see the manual), navigate to Settings > HDMI > Ctrl for HDMI . . . and set to OFF.  And then navigate to Settings > System > Auto Standby . . . and also set that to STBY OFF.These functions may be useful if, say, you do not have a smart remote and you have all Sony Bravia or compatible hardware and want synchronized power, or if your system is designed such that power on to one of the components should indeed automatically power up the others.But for most set-ups, these settings will drive you stark raving mad during the set-up procedure, when components power on and off automatically when you do not want them to.  Just turn the features off, and the AVR will then operate like very other AVR you've set up over the years.One caveat - If you want HDMI passthrough to work, i.e. HDMI signals pass through the AVR even when it is powered down, then the documentation indicates that such passthrough is not available if \"Control for HDMI\" is OFF (but I have not verified this). Most set-ups will have the AVR powered up when HDMI passthrough is required anyway.Another IMPORTANT setting -- be sure to go into your setting as follows: Settings > HDMI > Audio Out . . . set to TV (because leaving in the default setting of TV+AMP will dumb down your audio to two channel).", "Date": "July 22, 2013"}, {"Title": "Sony STRDH830 Receiver", "Author": "Glenn Bonds", "ReviewID": "R1DJHHSY8X6VKK", "Overall": "5.0", "Content": "Great receiver for the money, and for the power requirements I have. It has all the HDMI connections I will ever want. It even has rca connectors for that \"old\" equipment you can't buy anymore plus the optical sound outputs for the same.As for output, my needs are simple, the room size is small and I do not need a huge power amp/receiver.The cons: Really missing the switched outlet on the back that my other Sony had, came in handy for the subwoofer power connections. The remote needs re-engineering and has for a long time on these Sony peripherals, just my personal tastes but they might want to include customer feed back on this item for a new design. My hands will not hold a basketball, and using these remotes with small hands can be a pain.Overall still a great receiver amplifier for the money.", "Date": "June 10, 2013"}, {"Title": "good especially in features, not special in sound", "Author": "GWUDZ \"GWUD\"", "ReviewID": "RE8MQIULYFFJK", "Overall": "3.0", "Content": "This receiver nicely integrated all my video inputs and converted them (including analog feeds) into digital video which was nice. I noticed the improvement in pictures. That said, the sound felt just 'there' with no special clarity. For a while I could not hear the sub output, but later did. I had just upgraded my sound system from a nice HTIB and it almost felt like my old system sounded better. I eventually returned it.", "Date": "May 17, 2013"}, {"Title": "Solid as a rock", "Author": "A. Hebert \"Art BOSTON\"", "ReviewID": "R3IXIYK20CZ723", "Overall": "5.0", "Content": "This was probably my ninth or tenth major Sony electronic product. It is the driving force in my home theater setup.With the volume levels set at wall-shaking and neck-hair-raising, the basic intrinsic noise is nonexistent. Very impressive.I particularly like the fact that it somehow seamlessly integrated itself with a large screen TV and Sony BluRay player. I push the Power On button on the satellite receiver remote control, and things start turning themselves on and configuring themselves like magic. (Audio Return Channel in the Sharp 70\" probably has a lot to do with it.)", "Date": "November 26, 2012"}, {"Title": "Excellent!", "Author": "R. Wood \"Beer snob and curmudgeon...\"", "ReviewID": "R3G6WVD0WASQHW", "Overall": "5.0", "Content": "This item is wonderful for running all my A/V gear. It does what I need it to and is easy to figure out and work with.", "Date": "November 26, 2012"}, {"Title": "Great Receiver. Setup Warning...", "Author": "B. Fuller", "ReviewID": "R18QJ0HFXXFZQ9", "Overall": "4.0", "Content": "I'm writing to help anyone who may have the same issue I did. If you are using the HDMI out from the receiver to connect to a projector, I had problems where the sound wouldn't play. I would see picture but have no sound. By cycling the power or unplugging the HDMI out and plugging it back in, it would come back but fail on chapter skipping or when starting up the device again.To fix this, go to the HDMI settings in the GUI. Set the Ctrl for HDMI to OFF and set the Audio Out to AMP. It appeared that TV+AMP was set by default. The projector has no speakers, and sending the audio up to it screwed with the sound sent to the amp for some reason.Other than that, this is a great receiver with plenty of power. Unlike others, I like the GUI. This receiver is way easier to configure than my old Denon with its mysterious twisting and turning of random nobs.", "Date": "December 7, 2012"}, {"Title": "Sony stero", "Author": "Lywood Lawrence \"Lyn\"", "ReviewID": "R2O63Q0L4WE66N", "Overall": "5.0", "Content": "Great item, looks great, sounds super,very easy to set up,I use my MP3 player with the system and I also use my IPod", "Date": "September 11, 2012"}, {"Title": "HDMI Power Smart?", "Author": "W. H. Niehoff", "ReviewID": "R1ZX5YNWRZQGWK", "Overall": "3.0", "Content": "Was this ever painful to install?  I had a Yamaha receiver previously installed -- 15 years old, and it died.  But things have changed; so almost all of the cabling (except speakers) had to change, mostly due to HDMI.  I'm in a wheelchair, so I directed, and my wife did all the work.  It took us three days, and we both were a nervous wreck when it was done.The documentation is abysmal, primarily because it's organized poorly.  I was having to jump all over the place to follow references.  Sony would have done better to implement the manual in HTML and put it on a CD or the web.But the real nightmare came when I tested it, and found that controlling what comes on when becomes an unnatural act.  For example, turn my not-too-old CD changer on and the A/V receiver on, and the TV comes on.  Yeah, there's a way to turn this feature off, but then TV watching becomes less convenient.  My cable company provides a reasonable remote for the cable box, etc., and it works fine with my Sony TV.  I called Sony Support to find out the remote code for the A/V Receiver.  They wouldn't give it to me.  Company policy.The receiver sounds pretty good though.  It's just that, systemswise, it's a pain where there oughtn't to be one.", "Date": "January 31, 2013"}, {"Title": "sony receiver", "Author": "GBerios", "ReviewID": "R1XZBJ1SDI6BDP", "Overall": "5.0", "Content": "I absolutely love this receiver for the price!!!! Took about 15 min to set up and works like a charm. Right now, I only have it setup to play with a five channel surround sound hooked up to my hdtv, 3d bluray player, and direct tv unit. great little docking unit for your old iphone or ipod turns this unit essentially into a juke box. Or use the usb port for your new iphone. I have been using it for about 6 months and have no complaints! That ain't bad for $200!", "Date": "April 4, 2014"}, {"Title": "Works Great", "Author": "jimf", "ReviewID": "R3TJQDB1F5IS1D", "Overall": "4.0", "Content": "Works great. No problems with it. I wish it had A/B speaker select so I could hook one up for my outdoor speakers only", "Date": "December 11, 2013"}, {"Title": "Dead input on arrival", "Author": "david g wood", "ReviewID": "R1AFCF1Q1FRUGN", "Overall": "3.0", "Content": "When the device arrived it had a dead audio unput.  Since there are quite a few other inputs to use, I was able to get everything working, but the audio from my DVD player is going thru an electrical co-ax cable instead of a fiber optic one, decreasing sound quality a bit, I believe.  Sending the darn thing back seemed like lots more trouble than it was worth.", "Date": "August 1, 2013"}, {"Title": "Good product for the money", "Author": "Patrick Lauer \"P\"", "ReviewID": "R1LJ0ZC58FDO2P", "Overall": "4.0", "Content": "For the price, this product is hard to beat. Installation is pretty straightforward. Sony really needs to upgrade their user interface though.", "Date": "June 13, 2013"}, {"Title": "Awesome Receiver!!!", "Author": "C. T. Kofford", "ReviewID": "RM425IVDL3O1J", "Overall": "5.0", "Content": "Awesome receiver, and because of amazon prime's great shipping deals, I received it in about a day. This was good since my old receiver had just died.Receiver was dead simple to setup, and actually integrated pretty well, using bidirectional HDMI, with my samsung smart tv, even though it is a sony receiver, sync'ing the volume control from my tv & also powering off.The sound is great, even using my older surround speakers, and it definitely was an inexpensive upgrade for my old sony receiver that died.", "Date": "April 12, 2013"}, {"Title": "Great sound", "Author": "jayrad562", "ReviewID": "RZ01OMV1JEF7J", "Overall": "5.0", "Content": "great sound an no problems, easy to set-up and love the 7.1 audio. Rich full sound from seven speakers and the sub woofer.", "Date": "March 19, 2013"}, {"Title": "good reciever for the price", "Author": "Pen Name", "ReviewID": "R3DZICO5H37CRT", "Overall": "4.0", "Content": "This was easy enough to set up.This was a good reciever. I have owned pioneer and after a decade it needed replacing. I wanted to get something relatively cheap before for a smaller room. This has been a good product.", "Date": "March 18, 2013"}, {"Title": "I love this receiver!", "Author": "stone artist \"abstraction\"", "ReviewID": "RDWVQNFO9UN56", "Overall": "5.0", "Content": "Does everything the description said it would do. The upscale to 1080 is great for some satellite channels that aren't. I would recommend this to anyone.", "Date": "March 11, 2013"}, {"Title": "Sony STRHD830", "Author": "Richard Nowak", "ReviewID": "R35QNEZR8VAC7G", "Overall": "5.0", "Content": "Receiver is everything one would want for a decent price.  Takes a learning curve to set up, especially since one hasn't done this in over 20 years.", "Date": "March 1, 2013"}, {"Title": "A Good buy and easy to install and setup", "Author": "Satya Venkataraman", "ReviewID": "R1H5V20TV1SQI5", "Overall": "5.0", "Content": "This arrived on time and in good and secure packaging.The setup was too easy. I had my DVD player, TV, XBox 360 and Apple TV player all hooked up and working in less than 30 minutes from the time I unpacked it. The audio setup with the included microphone was very simple and easy.", "Date": "February 13, 2013"}, {"Title": "Love It!", "Author": "Christopher Leonard", "ReviewID": "RHPOV2S4IP3YL", "Overall": "5.0", "Content": "Good price and excellent features. Setup was easy with the auto-calibration and with everything connected via HDMI I don't need 4 remotes to play a  blu-ray.", "Date": "February 12, 2013"}, {"Title": "What I expect from Sony!", "Author": "Bri-ko", "ReviewID": "R3IY8BI8H1VQJI", "Overall": "4.0", "Content": "I purchased this AV receiver to replace a Sony product I'd bought in 1992.  I've always liked the Sony audio line and after reading the features on this machine did not hesitate to orderit.  I am pleased with the innovation in this unit over the old receiver.  I especially like the automated speaker setup.  I had the ability to adjust on the old receiver but it was all manual.One thing I'd like to see on these new AV receivers is the ability to get a stereo output.  I wanted to use a wireless speaker system to get music to another location but there is no connection for output.  This is not a hit just a suggestion for a design enhancemet.Overall a great machine.  If I'm still around in another 20 years I'll probably buy another!!", "Date": "January 27, 2013"}, {"Title": "I like this receiver!", "Author": "First Class", "ReviewID": "R18QV0DRDL9QLB", "Overall": "4.0", "Content": "I read other's reviews and decided to give this AV receiver a try.  I have not been disappointed!  Audio and video quality is great, but the remote is clunky and confusing.  Bought a Logitech Harmony 650 remote which controls this and all my other components with no problem.  This Sony has on an on-screen GUI with a multitude of settings which I won't go into here.  Suffice it to say that you can spend several hours fine-tuning everything to perfection and if you're really picky you can scrap those settings and do it again!  There is an omnidirectional mic included that can be used to automatically calibrate the speakers and acoustics for your room.  It didn't work on my setup but mine are not configured or placed as a bona-fide theater would be.  Not an issue since you can manually set it up as you want.  Don't be afraid to experiment!", "Date": "January 26, 2013"}, {"Title": "good for the money", "Author": "charles walpole", "ReviewID": "R9GR5G0LPIUFB", "Overall": "4.0", "Content": "Very good for the money ,the setup was simple with the easy to read instructions . Has plenty of HDMI ports for most of your needs.", "Date": "March 10, 2013"}, {"Title": "great speakers", "Author": "b1oodstone", "ReviewID": "R54MRSWFDBQW5", "Overall": "5.0", "Content": "Forget all other audio companies. Sony will always have the highest quality products for the best prices.Sony STRDH830 Sony 3D 7.1 Channel A/V Receivers()", "Date": "February 9, 2013"}, {"Title": "excellent", "Author": "Rafael Esteves Latouche", "ReviewID": "R18SDKDZ09BK3G", "Overall": "5.0", "Content": "This item is wonderful for running all my A/V gear. It does what I need it to and is easy to figure out and work with. easy to use everything", "Date": "December 15, 2012"}, {"Title": "Easy set up and great sound worth the $$$$", "Author": "Kevin Ridsdale \"the Premier\"", "ReviewID": "R8JMQM6TGCD9B", "Overall": "5.0", "Content": "Works great as a pass thru with my sharp 3d tv and Samsung 3D playerIt detects your speakers with the auto set up and Microphone", "Date": "December 23, 2012"}, {"Title": "Great product", "Author": "Scubamax167", "ReviewID": "R2WD7U9OCOGGJY", "Overall": "5.0", "Content": "These other crybaby a with the 1 and 2 stars don't have a clue what they are talking about. Great product", "Date": "December 19, 2012"}, {"Title": "Stay away from this particular model.", "Author": "R. Le \"Big Bob\"", "ReviewID": "R2AXF3RD78F7PU", "Overall": "1.0", "Content": "Junk, sounds terrible compares to the Sony older models, quality going down hill on Sony....bad thing that I'm a Sony' fan for almost 2 decades. Im a 30 years plus musician so sounds quality is priority as always, Very disappoint when it installed, doesn't matter what I do, just could not get the sounds closing to acceptable point....don't buy.", "Date": "November 19, 2013"}, {"Title": "Now I Am 3D Ready", "Author": "H. Crawford", "ReviewID": "R2ZKRY48AFD4MI", "Overall": "5.0", "Content": "I was very happy with the Sony receiver that the STRDH830 replaced but it was not 3D ready.  Unboxed it, attached the HDMI cables and since it was so similar in design to the old one, set up was a snap.  The autocal was very much appreciated.  Great sound and now I am 3D Ready!!", "Date": "October 19, 2013"}, {"Title": "Works great", "Author": "Mthr of Pearl \"Mthr of Pearl\"", "ReviewID": "R3HS4GKOHKMXUR", "Overall": "5.0", "Content": "Does the job as promised.  Replaced a Sony system, had my son install it for me -- not in my area of expertise.", "Date": "August 16, 2013"}, {"Title": "Excellent", "Author": "Bradley West \"westrider\"", "ReviewID": "RXXM2I5VNV3MF", "Overall": "5.0", "Content": "This is a refurbished unit.  I absolutely love it.  The sound reproduction is tremendous.  The price was very fare.  Works great.", "Date": "May 24, 2013"}, {"Title": "Works well so far", "Author": "J. Derbyshire", "ReviewID": "R285KVOCNOB8U2", "Overall": "4.0", "Content": "Easy to hook up, works well so far, although I've been unable to get a laser disc player to work using the standard rca video/audio connection.  It's probably user error, but I haven't had time to check it out thoroughly", "Date": "April 19, 2013"}, {"Title": "Sony STRDH830 3D 7.1 Channel A/V Receiver", "Author": "Jane", "ReviewID": "R3KNL4WUQMU5A3", "Overall": "5.0", "Content": "I chose this Sony Receiver to replace an existing Sony 5.1 Channel receiver that I had for 16 years (it had to be replaced because my satellite box bit the dust and took out some functionality features of the receiver). I'm a strong supporter of all Sony products (A/V, PCs, Cameras, and TVs) because they are quality products that you can trust to provide years and years of usage without technical problems. I specifically chose this model because it allowed me to connect my current non-HDMI Sony TV to the receiver, but would give me the capability of HDMI in the future when I decide to replace my TV.  As a bonus it does have 3D, but I will only use that feature if I purchase a new TV sometime in the future.", "Date": "March 29, 2013"}, {"Title": "Almost perfect", "Author": "Isaac Kennell", "ReviewID": "R3KYQ22MP6C7KU", "Overall": "4.0", "Content": "I bought it today, hooked it up without a hitch, sounds great and is everything I asked for.Almost.So what's missing? Well, aside from the lack of a dedicated phono input (which I knew about going in) the iPod connectability leaves something to be desired. Namely, with the video aspect. Instead of being able to watch a widescreen mp4 in HD through the USB, the video is outputted from the iPod to the receiver by splitting it off into a separate composite video line, thereby down rezzing it to standard def. what's the point of that? It looks awful! But nevermind. Not a big deal as I can put the same file onto a thumb drive and watch it on my Sony blu ray player. But still, it's weird. A video signal should be able to be sent through a USB, shouldn't it???", "Date": "March 22, 2013"}, {"Title": "33 days after installation (41 days after receiving) the unit stopped audio output.", "Author": "David Crawford", "ReviewID": "R337OSRVT0H8MD", "Overall": "1.0", "Content": "Unit received on December 28th and installed (connected to speakers and other units) on January 5.  On February 7th the unit popped the center speaker and then stopped all audio output.  New speakers installed and still no audio output.  And of course the return date was 8 days past.  Wonderful.", "Date": "February 19, 2013"}, {"Title": "Returned it", "Author": "E. D. Saubier", "ReviewID": "RT88DR0IQ74O1", "Overall": "1.0", "Content": "When trying to watch a blue ray or DVD it changed the video to have a red tent.  I saw on forums other people had the same problem.", "Date": "March 17, 2013"}, {"Title": "Arrived quick, and worked as it should", "Author": "Roy", "ReviewID": "R2E7IPMZLAT0A8", "Overall": "4.0", "Content": "This is a nice Surround Sound unit, with plenty of HDMI ports and lots of features. The Auto Calibration was a snap to use, it was working within an hour of removing the old one.", "Date": "January 29, 2013"}, {"Title": "Where's the 7.1?", "Author": "Brutus", "ReviewID": "R23C6TI3HB29DC", "Overall": "2.0", "Content": "I run Blu Ray discs and video games from my PS3 through this, but the best I get is \"Dolby Digital 5.1\". I have done everything possible to set this up to output 7.1 but it will not do it. The sound is amazing and it fills out living room like we're at the theater but I bought it for 7.1 and I want 7.1.EDIT(2): As of today's date: November 04, 2013, I have still not gotten this system to produce 7.1 surround sound.EDIT: As of today's date: March 12, 2013, I have still not gotten this system to produce 7.1 surround sound.", "Date": "January 12, 2013"}, {"Title": "great", "Author": "Daniel H. Reese", "ReviewID": "R396VOY6TLFX03", "Overall": "4.0", "Content": "set up was easy, but the reason i knocked off a star is their was no calibratin mic in the box, so i used one from my last receiver that i replaced it with, just set it up today and so far so good.", "Date": "April 17, 2012"}, {"Title": "Great Receiver", "Author": "Tswiley23", "ReviewID": "R2YWO2CGZRO7B5", "Overall": "5.0", "Content": "I love this receiver. I've had it for a few weeks now. It integrates with my Sony Bravia TV, recognizing it immediately. I'm Looking to add the following speakers:1 Center Sony SS CN50004 Front and Side  Sony SSF 70002 Surround Sony SS B30001 Subwoofer Polk Audio PSW505", "Date": "June 27, 2012"}, {"Title": "the 3-D change over.", "Author": "roy g seaman", "ReviewID": "R1IOZKGZNSUVU2", "Overall": "5.0", "Content": "I am caught in the 3-D change over. the new display won\"t work properly without__________ The Sony Bravia system is very well thought out. we\"ll see how much we spend in the end. all the equip. works well.", "Date": "July 26, 2013"}, {"Title": "Good price good performance", "Author": "John", "ReviewID": "R3P6R0WPD1CK79", "Overall": "5.0", "Content": "좋은 제품이라고 생각합니다.여기저기 꽂혀있는 HDMI 단자를 한번에 모을수 있는 점깨끗한 고음매우 훌륭한 성능을 보여주고 있습니다.나의 귀를 매우 즐겁게 해주는 제품이다", "Date": "March 12, 2013"}, {"Title": "Very hard to set up other components", "Author": "Joan M. Grant", "ReviewID": "RRMLD2PSAKI8D", "Overall": "1.0", "Content": "This receiver is very hard to set up and the booklet that came with it is useless.  We still don't have everything \"plugged\" into this unit and I don't think we will ever be able to do that.  We have tried a lot of different configurations, but nothing works.Stay away from this unit unless you are an expert at setting these things up!", "Date": "February 7, 2013"}, {"Title": "READ before you BUY!", "Author": "johnbusby23", "ReviewID": "R1ZC9C7UIJ0JNB", "Overall": "1.0", "Content": "Hey folks!  I recently bought this receiver unpacked it, hooked it up, tested it out and was not impressed.  Not because it's an aweful product, but it's just not that great.  Especially for the price!  Read on....Don't be fooled by the glamorous description and technical specs on this particular sony receiver!  As a proud owner of the $199.99 (Best Buy) Sony DH520, the DH830 doesn't deliver!  With a $400.00 price tag, the 830 doesn't offer any bang for the buck.  Compared with the DH520, which is a whopping $200.00 cheaper, the only things you're getting out of this receiver that the 520 doen't have is one extra HDMI port, a USB port for an optional iphone/ipod playback, a Graphic User Interface (GUI) to use via your television or monitor, and an included microphone for automatically calibrating speaker setup.Please note that the 520 also has the capability of automatic speaker calibration but you have to supply your own mic (cheap addition).  Note also that the microphone Sony boxed with the 830 is about as cheap as they come!The extra HDMI port is not going to be that significant to most, but if you have a lot of equipment then the 830 just might be up your alley; however, if you have more than 4 devices that you're running audio & video out via HDMI, chances are you have an HDTV that will have up to four or more HDMI ports.  So here's the question, \"is the extra port really worth $200.00?\" especially after paying $1000 or more for a really nice HDTV.  just sayin....If you're expecting a lot out of the GUI and Iphone/Ipod playback options.....DON'T!!  Sony just flat out dropped the ball on these features!  Firstly, the GUI maintains a 4:3 aspect ratio and offers a more than poor menu design and even worse functionality.  It takes approx. 10 seconds to switch between the GUI and the source material from your device, so in short, IT'S SLOW!  The appearance is simply unappealing and attempting to use the ipod through the GUI is a nightmare to say the very least.  I don't know what Sony expected to accomplish with these features, but in my opinion, they're useless, unnecessary, and not worth the money.NOTE: Sony includes an ipod/iphone dock, but is not compatible with Iphone 5.I don't really understand why there is such a price gap between these two models, because other than the variances i listed above, the 830 doesn't offer any difference in sound quality, which to me is the most important aspect of considering a replacement or upgrade in your home theater.In conclusion, take your $400.00 buy the DH520, lots of blu-rays and games, and go have a great time!  Don't waste your money and efforts on this model!  I have been an avid Sony consumer for the past 12 years and will to continue to be, but the 830 falls way short of becoming a hot item from Sony for sure.", "Date": "December 4, 2012"}, {"Title": "Expect Better", "Author": "AZ", "ReviewID": "R2UNU6H10R4FH8", "Overall": "2.0", "Content": "As usual with other sony products there are issues switching components where the soundd and or picture is not recognized until the unit is power cycled.  Very nice unit but same thing exists with this unit as well.  And yes it is not my other equipment because where this unit went everything is brand new.", "Date": "July 26, 2012"}, {"Title": "Awesome", "Author": "Fast2Fast", "ReviewID": "R3N10A0EWHSMC1", "Overall": "5.0", "Content": "Awesome receiver. Sounds awesome! Hooked it to my Samsung led tv and Bose speakers. Works great! Go for it! Sony delivers quality again!", "Date": "June 24, 2012"}, {"Title": "Buyer beware", "Author": "John Dupuis \"molemsdad\"", "ReviewID": "R1KVY6K5UNZWAY", "Overall": "2.0", "Content": "STR-DH830.  Buyer beware ... The remote control of this unit cannot be programmed to operate other non-Sony devices.  $400 spent and I cannot turn off my Vizio TV with the receiver remote.  I chatted with Sony Support and they confirmed it is not programmable.  EVERY remote on earth can now be programed to operate other devices, but not this one.  I am sure this was some b/s corporate decision to force consumers to buy only Sony products to utilize the Bravia system.  I am returning the receiver along with the speakers and BluRay player.", "Date": "February 19, 2013"}, {"Title": "Don't do it !!!!", "Author": "vetteman18361", "ReviewID": "R35OQAIEC38CDT", "Overall": "1.0", "Content": "I bought the STRDH820 and had nothing but problems with it from the first week on. Sony's Tech Support was very helpful on how to make you think everything is your fault and stalling you for enough time that you can't receive a refund on their garbage. The unit had an issue of randomly shutting down while watching TV. You could watch TV for days without a problem, then right in the middle of a show or movie, it would shut down. I spent many weekends trying to solve this issue ,listening to Sony's phone tech's until one them decided that I should take it to one of their service dealers nearby (50 miles one way, away from my home). The shop owner insured me that this was a common issue with Sony receivers and it can be repaired when 2 weeks. 2 and a half months later, the shop calls and asks me to pick it up because nothing is wrong with it. I called Sony Tech Support and this time, they wanted me to ship it to Texas, so I did. I received an e-mail from one of their Tech's asking me to call him to describe the issue, so I did. I did not get to speak with that person, but someone else who said he could contact the Tech and pass on the information. I advised the tech that the unit shuts down randomly while watching TV. Sometimes it happens daily, some times it can last a week or more, but sooner or later, it shuts down. He said he will pass the info to the right tech to see what the issue is, then have the tech contact me. The next day, I received an e-mail from Sony advising me that the unit is on it's way back. I called again, and was told the tech checked it out and everything is fine. I reminded him that the unit can run fine for days at a time and just turning it on, checking it, and turning it off again, will not solve the problem. Since Sony and it's service shop had the unit for a total of over 3 months as compared to my several miserable and embarrassing weeks, I asked if I could have a new unit or a refund. I was told that it has been over 3 months (dah, since they had it for that long),and it can't be replaced, nor can I get a refund. Their solution was to send it back to me, have me install it again (like I haven't done that many times before), and if it happens again, send it back in. During all of this mess, I replaced the unit with an ONKYO product that works perfect with all of my equipment, and I refuse to go through all of the heartache of disconnecting a perfectly good unit, and replace it with this Sony unit. The unit is in the box it came in, sitting on one of shelves in my garage, where I MAKE BELIEVE it is not a piece of GARBAGE, and I MAKE BELIEVE I did not get ripped off by SONY and it's so called Tech Support. Good luck if have already purchased the product, but if you haven't, by any other brand name but sony, and you won't have to MAKE BELIEVE you have made the right purchase. What really seemed funny to me, was after all of that, Sony came up with this upgraded version of the 820 model. Makes you wonder since they did not upgrade any other model.", "Date": "February 24, 2013"}, {"Title": "Don't expect your Universal Remote to work with this product", "Author": "Music Lover \"Problem Solver\"", "ReviewID": "R2UJ7KGN97VKA7", "Overall": "1.0", "Content": "I bought this receiver to replace a 5 year old Pioneer unit when I upgraded to a 3D system.Setting the unit up is as difficult as most, with a lot of guesswork on just what the various sound setup schemes actually mean.  With undecipherable icons and non-specific explanations meant for the non-technical, you can never be sure just how the unit is set up.Sorry, but I like my audio pristine, and I expect to be able to set the unit up the way I want it, without DSP audio effects getting in the way.There are a number of different audio effects included which are designed to \"enhance (i.e., ruin) the audio experience,\" according to the manual.  But nowhere is the user allowed to do things my Pioneer unit allowed, such as add the subwoofer to a stereo signal for bass enhancement and specify the crossover frequency.  Seems like a simple thing in light of the heavy audio processing available in the unit.  In fact it's difficult to tell whether I've succeeded in keeping the unit from turning all the DSP FX back on from time to time by merely loading a SACD disk, or whatever (it's linked to the disk player through Bravia).  Unacceptable.At least the volume control works.I liked the sound of the Pioneer unit better.The real fly in the ointment is the lack of availability of the 3 digit device code needed to program my universal remote.  No code is listed in the manual or other product documentation.  I tried the Sony web site.  It says the code is unavailable.  I tried Sony Support.  They told me to check with the manufacturer of my universal remote.  HOW CAN SONY NOT KNOW THE 3-DIGIT CODE OF A DEVICE THEY BUILT?  It's ludicrous that they would advise me to ask a 3rd party for technical information on their products!Can you guess a number from zero to 999?  That's what I'll have to do to get it working with my remote.  It takes me about 20 seconds to enter one of the codes and test it.  That's 3 per minute, or 180 per hour.  If the code is very high on the list, it could mean several hours to find the right one.  Sony. Support. Unacceptable.", "Date": "December 3, 2012"}, {"Title": "good but you have to set it up yourself to make it loud", "Author": "crabby", "ReviewID": "RG3STPJRIHGXP", "Overall": "5.0", "Content": "I bought this and it don,t have no cd you have to download the book. I turn it up all the way and i wasn,t happy , i let the mic calbrate my system, still the sound wasn,t that loud like i like it, so i went into the setting in gui and turn it all up then it sounded better , but still not as loud as i wanted, i would think 140 watt per speaker would shake he widnow but it didn,t at all, I have had 90 watt per speaker that were louder than this , gui is hard to figure out with out book in front of you, don,t like remote at all , it not frendly at all. the setting are way diffrent then other that are out their, This is my 4 receiver in 1 month .good point the sound it clear, when it turn up all the way. hmi board is holding up good , 3 of my system all hdmi board were cutting in and out , so far i had it for 2 days and it not cutting out at all that the main thing , if you go buy another 3d watch out most hdmi board are going in and out and if you don,t return it right away you suck buying a new board for 120 , so i am leaving this running for a weeks with out turning it off, what ever you do don,t put nothing to block the vent only had this 2 days and it running hot , time will tell if it will hold up to the heat, but a few hours on all other 3d receiver was turning off and on cutting in and out, so far so good, who want to watch a movie and all of a sudden don,t have no sound, going to add 2 more speaker latter to it only running 5 speaker right now, so that should also help with it shaking the house window, I don,t like buying something that in 30 days you can,t take it back and you got to pay for shipping all that, i went threw 3 of them and was tired of all those hdmi board being bad and cutting in and out, check the net it all over saying hdmi board are bad on most modle, i went threw 3 diffrent brand, so it just not one brand, this is the only one that didn,t have any review of sound cutting in and out , for less than 350, i bought 350 dollars one and it was going in and out also bought another on for 200 and it cut out, then 300 and it went out got this one for 300 and all is good , after 6 hours of readying review this is the only one that i could find for 350 dollars and under for the price, so i hope this help you in making your choices.", "Date": "December 21, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006U1VGQU"}}