{"Reviews": [{"Title": "Lens failed after a month's use", "Author": "SB2008R2", "ReviewID": "RDFLENM6U8QLA", "Overall": "2.0", "Content": "Love the fact that I don't have to use a power cable because of POE with this camera but was VERY disappointed that the pictures started to become fuzzy. Ordered 2 of these and so far one of them is still surviving.", "Date": "August 11, 2012"}, {"Title": "Works perfectly. Great value.", "Author": "G. Sheremeta", "ReviewID": "R3Q63H96AURJXP", "Overall": "5.0", "Content": "You simply can't find a PoE PTZ camera from a different manufacturer at this price. Camera works great. No problems with PoE. It's been online over 3 weeks with no issues whatsoever. Works perfectly in multiple browsers (IE, Firefox, Chrome), camera apps (like Blue Iris, ZoneMinder), VLC, and Android apps (like IP Cam Viewer).This is my 6th Foscam camera -- the other 5 were wireless ones, and while one of the wireless died, I'd still buy more -- because you can't beat the value.", "Date": "June 22, 2012"}, {"Title": "Works Great", "Author": "La'Maze Johnson", "ReviewID": "R1B7K88BYUYOE5", "Overall": "5.0", "Content": "I've had experience with Trendnet's PTZ cameras, and for the money, these are just as good and much cheaper.  Relatively good video day and night.  I like this particular model because it can be powered with a POE switch without any additional injectors and splitters.  Just the switch and the ethernet cable.  That and I prefer wired cameras to wireless ones anyway.  I paired this with a Synology DiskStation Synology DiskStation 2-Bay (Diskless) Network Attached Storage DS212+ (Black) and I'm able to view and move the camera via their mobile app.  I'm able to view my cameras from anywhere now.  Great value camera for home or office!", "Date": "July 22, 2012"}, {"Title": "Failed to work right out of the box", "Author": "E. Schwimmer", "ReviewID": "R2UB3W0239KH6O", "Overall": "1.0", "Content": "I purchased this webcam to replace an ethernet-cabled Foscam FI8918W, which had started failing inexplicably after 6 months of use.  The FI8918W would stop responding to network traffic (HTTP,ICMP, etc) after an average of 4 hours online (although it's time before failure would vary between 10 minutes and 8 hours).I tried everything I could think of to isolate the problem: performed a hard reset, changed IP address, switched power adapters, switched cat5 cables, changed the ethernet port it was plugged in to.  I even cabled the webcam directly to my monitoring server (running Zoneminder) with a crossover cable.  Nothing changed the rate of failure experienced by the FI8918W.I went so far as to capture the network traffic travelling to and from the camera (via a mirrored switch port and wireshark).  Nothing suspicious could be seen in the traffic patterns.  One moment the camera is working, the next it was unresponsive.Trying to return the camera directly to Foscam was a joke.  They wanted me to get an RMA # via the vendor I bought it from, who wanted me to return it in the long-since-recycled original packaging.I purchased the Foscam FI8918E in the vain hope that the FI8918W was just a lemon.  However this new camera started exhibiting the EXACT SAME BEHAVIOR as soon as I had unboxed it.  Both cameras are Foscam originals (not clones) with Foscam serial numbers printed on their undersides.Foscam technical help (tech3@foscam.com) was equally unhelpful this time around.  They suggested I \"try another port on router\" and \"hard reset camera\".  Failing that, I was once again directed to \"contact reseller for a RMA#\".  Thank god the camera failed within 30 days and that Amazon has such a liberal return policy, otherwise I would have been stuck with another useless hunk of plastic.Foscam: Fool me once, shame on you.  Fool me twice, shame on me.  Never again.", "Date": "October 8, 2012"}, {"Title": "Excellent option for baby monitor with no wifi", "Author": "R. Grimshaw", "ReviewID": "R2XISAENPVMCUH", "Overall": "5.0", "Content": "We were (highly) concerned about placing a camera in our infant son's bedroom that would be blasting him with Wifi or other communications radiation.  We live in an apartment and it was a short job to by some ethernet cable, run it along the base board and up the wall with a cable cover, and mount this to the wall.  If you don't want to run a power cable too, this camera can be powered over ethernet, which is awesome frankly, but you do have to buy a PoE-capable switch or router.  They aren't expensive, but we didn't need to do it.  FWIW, we should have mounted it upside down like it is supposed to be mounted, for greater range, but its swivel range is so good even in the vertical dimension that we can use it just fine.  The IR is great for night time, and can be turned off when you don't need it (some people worry about hurting kids eyes with IR, but even if you do you can just turn it off most of the time).  The web interface is great and can be easily figured out by babysitters and nannies.  The web interface isn't so awesome on mobile devices, in that I find I often have to sign back in, but that's not a problem since on both Android and iOS (we use an original iPad), the very popular \"IP Camera\" app supports this model and comes in an ad-supported or paid version.  If you're looking to record, I can't speak to how well that would work with normal, off the shelf freeware, but I use a Synology NAS and the Surveillance Station supports this model as well so I can record how often he moves, if Grandma is putting him down like I asked, etc (after telling her I'm doing so, of course).Great, great product, great price, buy this if you want a baby or pet monitor without WiFi or other radio comms.", "Date": "May 19, 2013"}, {"Title": "Great Camera", "Author": "Craig", "ReviewID": "RY1LKS1S8U0RG", "Overall": "4.0", "Content": "Great camera and exactly what I needed. I ordered this for the POE capability, and it works very well. I used the BlueIris software from Foscam as well to monitor, alert and update me.Unfortunately I ordered in Black and received it in White...not a huge deal, but still worth a star deduction.", "Date": "May 6, 2013"}, {"Title": "Foscam FI8918E PoE Pan & Tilt IP/Network Camera with 8 Meter Night", "Author": "DJJ", "ReviewID": "R21JACZLTUOBP7", "Overall": "4.0", "Content": "Camera easy to setup work pretty well  remote access no problem this camera was a tester everying worked out pretty well thus far Just Got 3  of the Wireless looking forward to getting those going. Clarity is not bad at all. Only drawback thus far is the glare it from the IR lights if it's sitting inside a window turning this off will work but then it  messes up the night visibility.", "Date": "March 22, 2013"}, {"Title": "This does not have the IR-Cut filter that is on most other Foscam IP IR cameras", "Author": "John Hollingsworth", "ReviewID": "R11NS3X8IDELT1", "Overall": "2.0", "Content": "This model does not have the IR-cut filter option so the colors are very pink.  The model Foscam FI8910E has POE and the IR filter that corrects the color, for a few dollars more.  Other than that, the camera works well and the POE seems to be 802.3af compliant. I am glad that Foscam is starting to make POE cameras since I have many of them already on POE networks in my home, office and truck.  I already threw out the box or I would send it back and get the other one.", "Date": "March 2, 2013"}, {"Title": "Quality product", "Author": "LisaM \"tlmunn1976\"", "ReviewID": "R1JDFRIRHWUWM2", "Overall": "5.0", "Content": "Installation was easy and the product works just as it should.  I will definitely purchase more if a need arises.", "Date": "December 27, 2012"}, {"Title": "Nice camera, but wrong item in box. Reseller opens the boxes.", "Author": "J. Clark", "ReviewID": "R215UD8WXVUBIP", "Overall": "3.0", "Content": "While I ordered the FI8918E, a FI8918W came in the box. It is a nice, solid looking camera, with a decent mounting bracket and included mounting hardware. It also includes an ethernet cable and power adapter. Unfortunately, it was not what I ordered. How could this happen? Easy! The reseller opens the boxes, unpacks the cameras, and puts their gratuitous advertising sticker on the camera! They must have put the wrong camera back into the box. Make sure to avoid IP Cam Central if you want to get a box that hasnt been opened.", "Date": "August 1, 2012"}, {"Title": "Cornfused", "Author": "Gary A. Krewson \"Frustrated\"", "ReviewID": "R3U49VUO6H66RA", "Overall": "1.0", "Content": "Advertising was unclear as to exterior use; product appears to be satisfactory for interior use, although I don't like mounting method--product returned", "Date": "November 9, 2012"}, {"Title": "Video Security camera which can't record video, only records pictures", "Author": "ithelpme dot com \"ithelpme\"", "ReviewID": "R1NT4AICMXWY31", "Overall": "1.0", "Content": "I purchased this because of two things. First, I wanted a PoE camera. Secondly, people seem to like the Foscam brand so I decided to give it a try. Everything is great and working fine but after reading the manual and trying it out, this thing can only record jpg. What's the deal with that? I wanted to record video to my NAS but I can't so I'll be return this and stick with my other brand video camera.  I only gave 1 star because this is a video security camera.. the keyword here is Video.. not picture so it failed.", "Date": "August 20, 2012"}], "ProductInfo": {"Price": "$75.99", "Features": "Simple to setup, high image & video quality, two-way audio monitoring\nRemote pan/tilt control (pan:300° & tilt:120°), Freely control IR-LED on/off\nAuto IR-LED illumination for night vision (up to 8 meters)\nRemote viewing, record from anywhere anytime, motion detection alert via email or upload image to FTP\nPower Over Ethernet (PoE) IEEE 802.3af Compatible", "Name": "Foscam FI8918E PoE Pan & Tilt IP/Network Camera with 8 Meter Night Vision and 3.6mm Lens (67° Viewing Angle) - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/31oQvHThMSL._SY300_.jpg", "ProductID": "B006BF22ZY"}}