{"Reviews": [{"Title": "My 4th Casio Camera the EX-ZR200", "Author": "Febe", "ReviewID": "R1QHQ38FKWJOUL", "Overall": "5.0", "Content": "I ordered and then received this camera from Japan on May 11, 2012.  It only took a few days to receive.  I've been so busy I haven't had time to read the manual which I downloaded from Casio.com, since my manual came in Japanese.  I first read about this camera in Jan 2012 and couldn't wait for it's debut in April but was dissapointed with the Amazon asking price of $699.99.  When I read about it Casio said the asking price would be $379.99.  I was kind of scared to order from Asuka of Japan, but since I have 3 other casio cameras I was familiar with the menu and it wasn't hard to change from Japanese to English.  Plus Miki sent me instructions how to change it.  I paid $429.99 and now I see the price has dropped to $329 or $379 which is a very good buy.  Don't be afraid to order from Asuka,Inc.  Miki sent me a very nice personal letter and beautiful chopsticks.  The only issue i have is the longevity of the battery. My last casio camera the Casio EX-H10's battery was bigger and lasted so long.  This one only last a couple of days if I go on a trip and take pics all day.  But that's okay I just ordered a backup battery that I will take with me on trips.  Another issue is that the movies are in mov. file.  My computer was able to play movies from my 3 other casios which had the avi. file.  But, that's no problem I will just download apples Quicktime and I'll be able to see the movies.  I haven't done that as yet, I don't know if it will change all my movie files from avi. to mov.  And I'm kind of afraid of that since I like using my Windows Media Player.  Anyway, when I watch my movies on my camera I can tell that they are crystal clear. I was happy with the very first pic I took which I will add to the pictures as well as the two food pics I have already uploaded.  As soon as I have time to read the manuel I know I will like the pictures even more.  Right now, I'm just using the regular snapshot mode and the macro mode for my food pics and movies occasionally. I like to use natural light so I have rarely used the flash on this camera.  I've been shooting most of my pics with the flash turned off and an 800 ISO.  If it's really bright outside I change the ISO to 400.  I've always wanted a SLR camera, but I like to carry my camera in my purse or pocket to take spur of the moment pictures without carrying a bulky camera around.  I am very pleased with this camera.", "Date": "July 9, 2012"}, {"Title": "Great feature set, bad low light video", "Author": "Kyle \"cylem\"", "ReviewID": "R36Q3IRU0ZLRRK", "Overall": "3.0", "Content": "I got this camera for the speed and it is fast, believe that. The problem what gets me though is the video, I love the slow motion video that casio does. However video in low light was much darker than other cameras that i used, and especially in high fps modes it would get WAY darker and very grainy. I compared to my old casio before and my samsung wb2000 which both did high fps video and the difference was very apparent, it was darker and way noisier. You pretty much can only use this effectively outside. Normal 1080p video was decent enough quality when there's enough light, i had wind noise reduction on and it didn't seem to do anything though.Picture quality seems decent enough for a point and shoot, the precapture and high fps shooting modes are easy and great to use, preset modes are mostly useful too and easy to use and understand. Zoom works great, even the combined physical and digital zoom was done well.Overall if casio would have given better low light sensitivity i would have loved it but it really was crippled by this. I wish they would get some higher resolution slow motion modes, cameras are coming out with 120fps in 720p which is a great jump for the 640x480 with this.", "Date": "December 2, 2012"}, {"Title": "best full-feature point and shoot camera - highly recommended", "Author": "Unknown", "ReviewID": "R2MN10F8PT19XY", "Overall": "5.0", "Content": "Full disclosure first:  I'm a huge Casio digital camera fan.  I've had the EX-M20U which is a remarkable camera the size of a few credit cards, the EX-Z75 which is built like a tank, the EX-V8 which packs a 8x optical zoom into a small/protected package and takes super shots, the EX-G1 which is water/shock resistant camera you can take anywhere any time, the EX-H10 which is another tank-like camera that takes excellent photos and has a battery that lasts twice as long as any other I've seen (I've never drained it in use), and the EX-ZR100 which is a computer-like camera and with its HDR feature allows you to pull great photos out of difficult lighting.  Every single one of those cameras takes outstanding quality photos -- and in outdoor contexts sometimes truly stunning photos.And now the EX-ZR200 ...I considered the EX-ZR300 but went with the EX-ZR200 because I didn't need the additional (non photo-quality-related) features.The EX-ZR200 is an improvement of the excellent EX-ZR100.  Both take quality photographs.  The EX-ZR200 is faster to start and has USB charging; it also allows HDR-art movies (but unfortunately not HDR movies).The controls are straightforward -- and the settings are plentiful/useful. The Best Shot options cover a wide range of situations (and you can set up your own modes).  In my opinion no other camera manufacturer has better internal image processing software than Casio.  Sharp, clear and true to life.Apart from image quality, the camera is compact.  It fits well in hand.  It has superb battery life.  The build quality is excellent.  It is also attractive.I don't post-process my photos.  I crop or straighten now and then.  But with this camera you don't have to post-process to end up with excellent output.Highly recommended!ASUKA of Japan was an excellent vendor.  The camera arrived within four days -- a day earlier than expected.  Brand new; unopened box.  All I needed to do was change the language of the menu settings to English (from Japanese).", "Date": "October 6, 2012"}, {"Title": "Great High Speed Video", "Author": "K1ick2ki11", "ReviewID": "R3CK9GTUYHE6F6", "Overall": "4.0", "Content": "So the main reason I purchased this was for the high speed video recording. The price is really good since I don't have the money for a really expensive high speed camera.Pros:*Great high speed video (the quality when recording at 1000 FPS leaves a little to be desired but overall High Speed is great)*Pictures are really sharp*Quite a few options (although I'm pretty sure I won't use at least half of them since I don't really know what they do)*Very large optical zoom*Nice compact design and overall feel when holding itCons:*When taking a video and zooming, you can hear the buzzing of the motor zooming which is fairly annoying.*The location of the stereo microphone, it is located on the top left, where I put my finger so I feel like I will probably end up blocking it quite often.", "Date": "April 9, 2013"}, {"Title": "Great Camera and Video", "Author": "Kenneth Lind", "ReviewID": "R1NU66NP4FCROW", "Overall": "5.0", "Content": "Bought this to take pictures of my golf swing to send to my coach. The best thing is that it is compact (I can carry it in my golf bag) and it takes slow motion pictures over 1000 fps. The only draw back is the faster the frame rate the smaller the video picture is.", "Date": "January 2, 2014"}, {"Title": "Pretty good", "Author": "Steve Tecza", "ReviewID": "R2VSMW0B7B0LUF", "Overall": "4.0", "Content": "This does everything I wanted. The 1000 fps video works ok, you can clearly see the action.The zoom is great. When taking regular photos, the rolling shutter is pretty slow, for example I tried to take a picture of lightning using burst mode and the bolt only ever appears in a few horizontal lines.Using the self timer to take a self portrait is almost impossible unless you use manual focus. The auto focus doesn't work until you touch the shutter button, so it ends up focusing on the background and holding that focus after you step into the shot.Overall, I love it.", "Date": "September 12, 2013"}, {"Title": "Great quality pictures at this price, and the high speed video is a blast.", "Author": "Vince \"orbhot\"", "ReviewID": "R3AA95SANCRTIX", "Overall": "5.0", "Content": "The ability to do aperture and shutter priority pictures, and manual mode is almost unheard of in cameras at this price. The HDR Art mode is pretty cool too, as is the SR zoom. It also supports Eye-Fi SDHC cards to share without transferring to a computer first. The main reason I bought this model is for the high speed video, and it does disappoint a bit due to the poor quality at higher frame rates. The quality degrades with higher speed frame rates, but that's expected, and common across all cameras capable of high speed video (most point & shoot don't have this ability at all). If you're interested in the slo-mo video, you can search YouTube for slow motion ex-zr200 and see lots of examples. Finally, I bought mine through one of the sellers here that ships straight from Japan (and saved about $100). The camera came with a Japanese manual, which is no problem since the English PDF can be downloaded from Casio. It also came in Japanese language mode, which can easily be changed by following the English manual.", "Date": "June 25, 2013"}, {"Title": "Fantastic camera", "Author": "Mike", "ReviewID": "R28MWZIQ6YD9BL", "Overall": "5.0", "Content": "This is the best electronic device I have purchased for a long time. I have had the cannon powershot and Pansonic Lumix camera's which are meant to be decent point and shoot devices but they are sooooo.... slow taking the shot that have we missed most of the spontaneous fun times when our children have been playing. There is nothing more mood killing for a child than have the parent say 3, 2, 1 ........ before the camera is ready to take one shot. Even then after the shot was taken it seemed that the quality was no better than our phone camera's????So after reading many reviews it became clear that what I need it very fast shutter speed and great quality optics. The Casio Ex-Zr200we beats all the competitors by a mile for these two requirements especially when you look at the price (cost me $170 new from a Japanese seller on Amazon), I have more great shots of my kids laughing and having fun from one 2 minute session on the deck than I have over the last 3 years. I just asked them to have fun and took picture after picture (there is no delay between photos and it has a burst mode that is just insanely fast) we ended up with 20 photos, fantastic quality, with our kids smiling and laughing.The panorama mode workes very well, which I really wanted for when we travel. The zoom is much more powerful than my other cameras but the quality of the image does degrade if you use the max zoom. The camera feels very solid, and looks great. I would recommend you purchase the SanDisk Extreme 32 GB SDHC Class 10 sd card, it is very fast and does not slow down the camera at all, much faster than most of the class 10 cards and about the same price ( I purchased a refurbished card from a Hong Kong company on ebay for $ 22 and it is working great)I purchased the camera from SUNONE, in Japan. I was worried that I was going to get ripped of but they did deliver exactly what they promised a new camera in the box with all the accessories for about $ 100 less than buying locally. They did take a long time to deliver, nearly a month, and never responded to my questions but in the end I would buy from them again because the price was so good and they did give exactly what they promised. The camera was set up in Japanese but it is easy to change the language using the comands in the menue. The manual is in Japanese but you can download a english version from the web.There are a lot of other features that I am going to have fun playing with but the photos I have now of my kids have made this the best purchase I have made for a long time.", "Date": "May 13, 2013"}, {"Title": "Awesome Slow Motion, broke soon and bad repair system", "Author": "Mark King", "ReviewID": "R34ZKU17E3U3D3", "Overall": "2.0", "Content": "My camera arrived exactly on time in perfect condition. The seller is in Japan but the camera came to me from Amazon. My camera was set to Japanese language but the seller had already sent me the English version of the manual in a PDF, without too much trouble I switched the menus to English.The camera is easy to operate. The menu system is straight-forward and somewhat intuitive (much more than either of my Nikons).I only gave it four stars because the zoom control is not very sensitive, it's hard to zoom \"a little\", it wants to zooooooom. I have other cameras with a similar physical zoom control lever setup and this one is just a tad over-sensitive in my opinion.The real reason you're probably looking at this camera is the high-speed recording, that's what I bought it for. The bad news is, as you incerease the frame rate, the size of the recorded area DECREASES, if you're recording at 1000fps, it's a very small window. The other bad news is the picture quality suffers A LOT when you're recording in high speed modes.OK, the good news, you can shoot some incredible things with this camera. We're filming birds flying with it and it is such a blessing to finally be able to see what's really going on. When set to 240 fps you have a relatively large filming window and it's incredible to see the birds skidding and swimming around in mid air like beautiful dancers.We bought it as a tool for capturing Ravens in all sorts of flying moves, from our initial use we're very excited about being able to capture the complex wing motions in such detail for a price this low.If you're wanting to create real slow motion video footage, albeit with the understanding there will be artifacts and imperfections to deliver this feature, this camera delivers a unique feature set for creative artists that I could not find anywhere else for anywhere near this price.EDIT UPDATE: My camera had a quirky zoom control right from the beginning and soon developed a problem with the lens not going all the way back in, then finally about six months after I bought the camera the lens stuck halfway and refuses to retract, it shows \"lens error\" in the display. I take care of and baby my equipment so this camera dying young is an ominous sign about Casio camera quality and the strange ways their products seem to be distributed.I contacted the seller who said to contact Casio. I did and found out the camera I was sold here on Amazon was a model for Japan only and I have no USA warranty. I'm awaiting word from Amazon CS about this but I'll never buy something from Amazon that gets sent from Japan again. I like the picture quality and features but I'd never buy this camera again because of the poor build quality and horrible service.", "Date": "April 17, 2013"}, {"Title": "Nice snapshot cam", "Author": "Max Chiu", "ReviewID": "R3CM04ESKK8YX3", "Overall": "4.0", "Content": "A bit disappointed with image noise visible even at iso80. But very soon realized I was compared it with prosumers and DSLRs with much larger senor. Noise is expected for such small senor at 100% crop.The 'Premium Auto Pro' mode of this cam actually done a lot of post processing. Of course, this is far from bullet prove but does help in most of the cases. Some reviewers complained it took longer than expected between shots. This is time taken for post processing. You can always switch to other mode for faster shot.I used to do a lot of post processing. After an hour of shooting, I need to spend hours on post processing. When most post processing offloaded to the cam, I found that it is more fun for snapshots. Not to worry hours of extra work.12.5X zoom is not impressive when compare with super-zooms. Practically, it is not easy to use a 20X or even a 30X zoom. 12.5X is sufficient for most snapshots. I can even take some birds photos. Of course, don't think of to use it as a decent bird shooter.The HDR art mode is fun but not very practical. I produce HDR art photo from time to time. But I prefer to do it with computer for much more control. But for casual users, this can have fun. Also, you can save hundred dollars on HDR software investment.The cam do provide M,S and A mode. But the cam does not have a physical aperture, it only provide 2 aperture setting. This is actually implemented by use ND filter. So, the aperture do not have any effect on DOF. The limited A mode also make the manual mode not useful. For example, when I want to set a low shutter speed. With very limited choice of A value, the cam will try to adjust the ISO to get the correct exposure. Bear in mind the lowest ISO value is 80 and the cam will turn on the ND filter if it is too bright. However, this will turn to a much higher ISO as the ND is 5 to 6 stop away and result in a grainy image.After playing with the cam for a week, I start loving it. It is a good snapshot equipment. When taken with premium Auto Pro mode, most (but not all) pictures look nice right away. I will still using DSLRs and prosumers for more decent occasions. However, it is difficult to carry my D7000 every day and G11 only have a 5X zoom.I recommend the cam for snapshots. Its M,S,A mode is not very useful and may disappoint users that want total control.Pros:1. Premium Auto Pro mode do a lot of post processing. This make photos look nice right away in most (but not all) cases.2. Good optics quality3. Light and small size (for this zoom range)4. Easy operate (esp., with premium auto pro mode)5. M,S,A mode6. Interesting high speed movie modeCons:1. Small sensor size2. Noise visible even at ISO 803. 'A' mode not useful. Actually, the cam don't have physical aperture. It only offer 2 aperture setting and it is achieved by ND filter4. Lack of choice of aperture also make S and M mode limited.5. Should provide more setting for HDR mode.", "Date": "September 17, 2012"}, {"Title": "High speed video for a physics class.", "Author": "Joel Lindstrom", "ReviewID": "R18HDJHE1YE6HP", "Overall": "5.0", "Content": "This is the perfect camera for taking high speed video for my high school physics classroom. There are so many physical phenomena that happen a little bit too fast for the eye to be sure what happened: oscillations, flame propagation. and bio-mechanics to name a few. This is the only camera I found within a classroom budget that will shoot faster than the standard 30 frames per second (fps).At 120 fps and 240 fps the picture quality is fine. It is noticeably grainy at 480 fps. But even at that frame rate, I could still project the movie and my students were able to measure flame propagation rates against a calibrated background. At 1000 fps, there is only a narrow strip that is filmed. Again, though, there is useful data.My students are having a lot of fun using the camera and are posing and attempting to answer interesting scientific questions. Having this camera is something like having a microscope for time. It's well worth the $300. I suggest buying a large data card to go with it. (I got 34 gigabytes).", "Date": "March 31, 2013"}, {"Title": "Quick, light weight, affordable and powerful.", "Author": "Cisop Sixpence", "ReviewID": "R2GLO2VXXYRRKZ", "Overall": "5.0", "Content": "The interface is easy to understand and navigate... once I switched to English.  Start up time is very quick, under 2 seconds and it is ready to go.  The size of the camera is perfect for me, fits right in my hand and is not heavy.  The battery life in my opinion is excellent.  I'm still running on the initial charge.  HDR and HDR Art modes great.  Great camera for the price.", "Date": "August 3, 2013"}, {"Title": "What a great Camera", "Author": "dtex121 \"Dave T\"", "ReviewID": "R30I2DGIBJCH29", "Overall": "5.0", "Content": "I was looking for a small camera for when we go on vacation this year and this is perfect and will fit in my pocket. I had some corespondence with the seller and they were very helpful in answering all my questions. Would recommend this product and seller.", "Date": "February 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006596OUA"}}