{"Reviews": [{"Title": "Good Buy", "Author": "fredsanmateo", "ReviewID": "R3I493YUCWQ24O", "Overall": "4.0", "Content": "This camera is a good buy. 1st vendor delivered on time. On opening box I was surprised by the construction of the camera. All aluminum body. No plastic parts.Installation was easy. I have it mounted and operating in 30 minutes.My need is for for an outdoor ip camera to monitor my driveway. Image  fair both day and night.Setup as wifi device. Work with both IE and Chrome browser. IE need active X to install while Chrome need no application download installation.Except for poor packaging on delivery( box was wrapped on plastic instead of inside another box )plus I have no idea who made it, no brand and contact listed.", "Date": "February 10, 2012"}, {"Title": "Great low-cost IP camera", "Author": "Capt Rob Fauteux", "ReviewID": "R2T0NR0IO74D74", "Overall": "4.0", "Content": "I bought this camera for use as a weather cam for my Weather Underground station (search for station ID KCOEVERG26 at wunderground dot com to see the image).  For the cost vs. capability this camera is pretty decent.Pros: - Sturdy all-metal construction - Nice picture, once you adjust the contrast (640x480) - Good viewing angle - Good setup utility / included software. - Extremely easy to set up wireless access (WPA2) - WiFi range seems to be good -- no problems with signal strength - Easy to set up as a weather camera for uploading images to Weather Underground via FTP - Good stable mounting hardware includedCons: - Documentation was obviously not written by a fluent English speaker/writer, but the software is easy to figure out without it - No clear manufacturer name on the box, docs, or the cam itself. Consider this a \"generic\" Asian-manufactured webcam.The outdoor picture is good, not as colorful as some of the higher-end cams out there, but definitely better than alot of small webcams at this price.  The motion-activation feature is adjustable and works well for \"alarm\" setups, and the IP tools are actually pretty great.  If the reliability proves good in the long term, I'd say this is a GREAT product at this price as long as you don't care about a brand name.", "Date": "October 20, 2012"}, {"Title": "Product came with a European power adapter ......", "Author": "CG \"CG\"", "ReviewID": "R357P3AIJ9UMZC", "Overall": "4.0", "Content": "I had to go out and buy a converter to change the plug type to US. (and tape them together so it would hold). They offered to refund me $5.00 for the cost, but it took an extra 2 weeks before I could even try it out.  Luckily the adapter did work with US voltage.As for the camera:One of the reasons I went with this one Vs other IP cameras was the reviews indicated simple installation, which this was, and also the wide viewing angle. While as stated in other reviews, the instructions are not in proper English, they can be figured out. Also, the camera is made by Apexis, a Chinese company.I also bought this camera to monitor my driveway which I can't see from any windows in my house, and it does a good job. The feature of sounding an alarm (via the Computer speaker) when it detects motion is great, I can now get notification if someone is in the driveway.I did have an issue with signal strength over my wireless network , but found that the antenna has to be vertical to get best reception. I also found that if the picture went funny ( flashes of white), if I re-booted the camera (Via the software) the picture would clear up.I also tried viewing the camera across the internet ( which requires port forwarding to be set up on your router), but I guess my upload speed is not fast enough ( 2MB/s) so it does not show the streaming video it only worked in 160*120 resolution.The night vision is fair, but that may be what the more expensive cameras will get you.All in all, I would consider buying another one for my front door, but am concerned that again I would get a European adapter with it.", "Date": "June 5, 2013"}, {"Title": "Camera not working properly", "Author": "jose gomez", "ReviewID": "R5E4ORZXJGB5G", "Overall": "2.0", "Content": "The camera works off and on.I run a troubleshoot on computer my computer is configure correctly, the unit(camera) is not responding. I have unplug thr camera works good for a while then it stops. I then try about three  times then then I can get a signal. When it's working it works good.", "Date": "August 19, 2013"}, {"Title": "Works good", "Author": "kerry pelletier", "ReviewID": "R1DJU7Q2TGGTE7", "Overall": "4.0", "Content": "Works good for the price. The color is a little off but other then that I like it. Not a bad cam.", "Date": "June 13, 2013"}], "ProductInfo": {"Price": "$72.99", "Features": "Power ful high-speed video protocol processor, High-sensitivity 1/4\" CMOS sensor\nPicture total 300k pixels, Optimized MJPEG video compression for transmission\nMulti-level users' management and passwords definition, Emvedded Web Serverfor users to visitby IE\nSupport wireless network (WI-FI/802.11 b/g), Giving alarm in cause of motion detection\nWarranty:12 months warranty, Ship from CA US, Fast customer service!", "Name": "Night vision Waterproof Outdoor Wifi Wireless IP Camera IR 24 LED (6 mm Lens, 60° Viewing Angle)-Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/41eO7Wthv4L._SX300_.jpg", "ProductID": "B006BT8PWO"}}