{"Reviews": [{"Title": "Great pair setup for access point and bridge", "Author": "floord", "ReviewID": "R3HY3JFOTLH9V7", "Overall": "5.0", "Content": "My Setup was to broadcast wifi from my main business building to a second building 400 feet away.  I was going to use one as an access point and one as a client bridge.First I'd like to mention that I had the ENH200EXT and after 1 month had problems with the device not working with an external antenna.  Since that model didn't have an internal antenna, it was rendered useless.I then chose (reluctantly) to purchase another engenius product, so I chose this ENH500. So where I originally had the antenna mounted, I mounted the entire ENH500 with built in antenna.  I did the same on both ends, and let me tell you it was a HUGE difference in range and signal.  I thought the built in model - ENH500 -  wouldn't be as strong as the ENH200 with an external 15dbi antenna.  I was completely incorrect.  This model -enh500- far surpassed my expectations and now can connect on computers in second building with virtually no difference compared to the hardwired computers in the main building.  Speed tests consistently show 25mbps and ping very low.  Didn't expect this kind of performance.COUPLE THINGS WORTH NOTING***  This is a 5ghz only model, so you cannot interchange this unit with a 2.4 ghz unit as a client bridge or access point.  So if you're trying to achieve my same setup, you'll need two of these, one on each end.  Or something with 5ghz as the other end of this access point/client bridge combo.Also, as standard with all Engenius stuff, the admin interface is easy to use, but once you hit accept to make changes on a particular setting, you then need to go to the top of the nav menu (left side) and click on the Main button where you can APPLY those changes.  You'll sit there wondering why the settings won't take affect.  Ask me how I know.Regarding Range... I have my buildings about 400 - 600 feet apart, and I still get full signal strength.  Just for a test, I drove about half a mile away and still received signal, though the strength was dying off.  I really think someone who needed to bridge a large gap could pull it off with this item, just keep in mind the antenna is directional so try to stay within 30 degrees of the antenna both horizontally and vertically for best results.", "Date": "March 2, 2013"}, {"Title": "wireless bridge.", "Author": "nobunobu", "ReviewID": "RTUPKJWS7O08C", "Overall": "5.0", "Content": "I needed something I could use to have internet in the garage ( I have a business that I set up in the garage that requires internet service) I previously had a antenna and repeater but the signal was so weak that I had to open the garage door to receive or send.not any more!", "Date": "May 9, 2013"}, {"Title": "great building-to-building connection", "Author": "Cory Kreikemeier", "ReviewID": "RQORBWUKWA3XX", "Overall": "5.0", "Content": "We use the primarily for our building-to-building connections and have had good success with them.  They have the occasional reset back to factory defaults but then you restore it back to its configuration and everything continues to work well.  Backups save lives.", "Date": "March 3, 2014"}, {"Title": "Good buy", "Author": "Carl White", "ReviewID": "R35M3S3JVOTSBX", "Overall": "5.0", "Content": "Bought two devices to extend network between two buildings, which has worked great.  Setup in WDS mode was easy, and bandwidth is great.  Used Amazon for this purchase due to lowest price.", "Date": "January 29, 2014"}, {"Title": "Great P2P", "Author": "Abdul Khan", "ReviewID": "R22XJN4RML5Y2U", "Overall": "5.0", "Content": "Very easy to configure.  i got 4 buildings connected with enh500 and ens500ext.  5 min setup and worked in seconds.", "Date": "October 21, 2013"}, {"Title": "Fantastic Wireless Bridge", "Author": "Gabriel Billings", "ReviewID": "R2Y58M6Q5N3ESG", "Overall": "5.0", "Content": "I bought a pair of these to set up as a wireless bridge between my friends' house and mine.  It's about 600 ft. across the neighborhood.  In reading through the instructions they made it clear that having direct line of sight was very important.  Even a small tree branch in the way could have supposedly fouled things up.  I figured out where the bridges should go on the two houses.  I mounted mine securely and hooked up all the cabling.  At the other house I couldn't get the bridge into position because we didn't have a big enough ladder.  So I set things up temporarily so they'd still have internet access by putting the bridge on a camera tripod and pointing it out a window.A few days later my friends had blinds installed.  Because my tripod setup was in the way, she pulled it out of the window and put it on the floor of the closet.  I would estimate that it's currently pointed 30 degrees off of a direct line to mine, as well as being maybe 15 degrees down.  It also has a 6\" exterior wall between it and the other bridge.  And somehow it continues to work.  I'm not sure if it's because they're good for 3 miles, and at 600 ft. there's enough power to shoot through the wall.  Whatever the case, I did speed tests before and after it was moved, and it really hasn't changed.I've only had things set up for a week, but it seems to be working flawlessly.  Great product.", "Date": "September 28, 2013"}, {"Title": "Works as promised", "Author": "Michael Mach", "ReviewID": "R21U7A8A3BNGY1", "Overall": "5.0", "Content": "Needed a temporary wireless bridge solution for client who is moving store location.  Old store and new store are within 200 yards and client needed a way to inventory (bar code scan) items at new store into quickbooks point of sale at old store (server is at old store and desktop client at new store).  Because this is quickbooks and using a hand held scanner, VPN, LogMeIn, etc was not a solution.  To be able to achieve this client system at new location needed to be on same subnet as old location.  VPN could have achieved this BUT I've setup quickbooks before on VPN's and it is SLOOOOOOOOOW.Purchased two of these to create a wireless bridge.  Setup was not difficult BUT was glad that I did some reading on the forums and website about setup.  I set this up as a WDS Bridge on both, as recommended by manufacturer for this implementation.  Mounted them on tripods, pointed them at each other and the link was established.Would recommend and use again!", "Date": "August 2, 2013"}, {"Title": "Great product", "Author": "~ Kyle", "ReviewID": "R1Z8SG1VTLK1RE", "Overall": "5.0", "Content": "I ordered two of these to get internet from one building to another about 700 feet away without line of sight and it works beautifully. High speed internet wasn't available on that side of the street because it is outside of town and would cost thousands to bore under the road to get it there. Had a second internet line installed at the house, mounted one there and one on the other building and presto it worked!", "Date": "July 8, 2013"}, {"Title": "Engenius ENH 500", "Author": "Carol Pulfer", "ReviewID": "RNV7AEN0AD9IF", "Overall": "5.0", "Content": "This is the replacement for the Engenius 5611P and provides the same quality service.  The programming is a little different but if one follows the instructions, it is quite easy.  The Engenius staff are very quick to respond to questions and most helpful.", "Date": "June 18, 2013"}, {"Title": "Great WiFi setup", "Author": "Terry's Terrific Books \"Terry\"", "ReviewID": "R2YFFPLK8EG7BW", "Overall": "4.0", "Content": "I installed this in a client location to shoot the WIFI LAN between buildings.  One building is single story with antenna at approx. 17' and the other building is about 400 yards away with antenna at approx. 50' height.  Installed them on some DirecTV antenna brackets laying around.  The support from Engenuis is great and the units sync'd up pretty easily and quickly.  This is my 2nd set.  I upgraded the same client to 5Ghz to increase the bandwidth.  They have been running for about 6 months and have been bulletproof.", "Date": "June 12, 2013"}, {"Title": "Good short to mid range bridge", "Author": "Kenny", "ReviewID": "R3AXG4TOLX2K8O", "Overall": "4.0", "Content": "Connected to a EA4500 sitting behind 3 wooden internal walls, and 80 meters distance, still attaining 270Mbps wireless connect rate, adding 1ms ping to this wireless leg, can't get any better than this.  Would be better if it's conforming to the POE standards instead of using their own POE injection method, if this POE injector dies I will not be able to find a replacement POE injector off the shelf.", "Date": "October 4, 2013"}, {"Title": "Perfect match for ENH700EXT", "Author": "Charles F. Hockenbarger", "ReviewID": "R1CR5P5748OHT1", "Overall": "5.0", "Content": "Great device to behave as AP when paired with ENH700EXT as a client bridge (and operating as a 2.4GHz AP).  Very easy to setup and manage.Could provide a little more information in the management page about network speed, and having to use a proprietary PoE injector kind of stinks, but overall great tool for extending a wireless network and bridging two buildings together.", "Date": "September 16, 2013"}, {"Title": "300Mbs wireless with only 100Mbs ethernet", "Author": "Kindle Customer \"A guy and a camera\"", "ReviewID": "RPCS96O3N7PWV", "Overall": "2.0", "Content": "While the device will link up like a champ at 300Mbs.  It only includes 10/100 Ethernet ports.  So the bottleneck is the wired input to the device.  There is a second Ethernet port so if you were connecting multiple devices and sending data at the same time you could see up to 200Mbs (theoretical) but never hit the full capacity of the wireless link.", "Date": "January 8, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006M1PM22"}}