{"Reviews": [{"Title": "Solid Camera for the Informed", "Author": "kwa", "ReviewID": "R3AY1TMA4CUHS1", "Overall": "4.0", "Content": "First, you must know what you are getting into when you buy/use this camera.WHAT IT IS NOT: this is not a DSLR replacement for use at high ISO's, it will not replace a top end video capable micro-4/3 camera or similar (ex. GH2/GH3), it's AF is not as fast the Olympus OM-EM5, It's sensor is smaller than m/43 but larger than the average point & shoot and other bridge cameras. It is NOT for pixel-peepers.NOTE/CAVEAT: If you have a body with a serial number starting with the numbers 21 or 22, this is an old production unit and will most likely have the noted (in other reviews) sensor blooming and lens issues.  I have a SN 23X.... (replaced by Fuji with a new camera) and it is perfect for these two issues.WHAT THIS CAMERA EXCELS AT:1) Good ISO performance for sensor size up to ISO 800, 1600 useable.2) Excellent MANUAL zoom, silky smooth.  Note, it does have a rubber gasket you can hear (internally) if you put your ear up to it - this is a good thing.3) Optics are sharp, contrasty and the lens alone is worth the price IMO.  f/2.8-5.6 is nice for the range.4) The FPS is nice an speedy if you need it5) Shoots full HD, but does not have full manual control, but for most causal video people this isn't an issue.  If you are a video enthusiast, look elsewhere.6) Great Fuji auto-white balance7) Great Fuji colors8) Full manual control on the photographic side of the camera9) Weather sealed to a certain level - although not completely.  Ex. There ARE seals in the lens, battery door, connection port door, SD card door, ,etc.  I cannot confirm seals internally around knobs.  The Canadian Fuji site called it sealed, but the USA site does not.  Keep this in mind.10) The body, while large, is a joy to hold and use, high quality feel vs. the cheaper plastic cameras11) The EVF is great IMO - nice and large, comparable to my old Panasonic GH112) Nice built in flash that is pretty powerful for its size (good to about 20') with excellent exposureOverall, if you are a photo enthusiast who KNOWS how to get the most from a camera and is willing to learn this camera inside and out it can be very rewarding and is in a class of it's own overall.  BUT, if you are looking for a more consumer oriented fun bridge with some better video, look at the Panasonic FZ200 or step up to micro 4/3.For daylight shooting, this beast is excellent and I do not miss my DLSRs at all.  It's AF is quick to lock (with the newer serial numbers IMO) and I've successfully used it for action as well.  Overall, for what you get for you money, I don't think you can go wrong.  YES, you can get better IQ with a DSLR body.  But the tele lenses you will get are slower on the short end (f/3.5) and will put the cost higher in the end if you want to keep cost down.  Sure, you could match the DSLR to a nice 70-200mm f/2.8 lens and it would smoke the X-S1, but those lenses are $1000+.  For the PACKAGE, it's a great option.This camera is not the only camera I shoot with, for ultimate image quality, I prefer my Fuji X100 which is a stellar performer.  I've shot with many high end DSLR's and some of the best glass around and that's the background for this review.  For what it is, the X-S1 is very nice!", "Date": "December 3, 2012"}, {"Title": "This is how I SEE IT about this CAMERA", "Author": "Lobsang", "ReviewID": "R1FKKJYI7XB2U8", "Overall": "5.0", "Content": "I will say a few things.  Build quality is outstanding.  No doubt about that.I have had it a couple of weeks and used it under a good many situations to get a feel for it.  I really like it.  But let me get right to the \"negatives\".  But please understand that all cameras are trade offs of one thing for another. There are far more positives than negatives.1. Image quality..  People have a strange idea of what image quality is and they toss the term around.  I think a lot of people who have knocked the image quality and said it is no better than an average point and shoot have not explored all the settings because it is far more than point and shoot image quality.  There is a lot you can change in terms of setting and how you shoot.  So it is possible to get great images and they are far more than point and shoot images.  The images could be sharper under some circumstances but in others it is really good.  The thing is that for the most part the average person is not going to notice the difference.  The image quality issue is VERY dependent on the circumstances.  The macro is excellent.  Portrait is good and acceptable but a G 12 would do better.  Outdoor is just fine even with lower light and even at 600mm zoom I was pleasently suprised.  Also there are different modes and image quality will be effected by those.  But IF you really want to pick... the lens could be sharper BUT the sharpness will not be an issue for most people and it would not be noticed until you blow up a picture.  Funny how people that don't shoot much and cannot compose often will get hung up on stats.  For the average person looking for nice pictures with advanced possibilities sharpness in this camera is not something to get hung up on.  A person should be improving other factors in their photography and not obsessing over pixels in situations where you would forget about them anyway.2. Autofocus.  This could be better and snappier.  It works but it is not up to the standard of the camera.  It can be skittish3. Ease of use and user enjoyment..  Well it is really really a pleasure to use without a doubt.  It has many preset programs in it that could really help a person get nice picture especially if that person is looking for better than point and shoot pictures but does not want to fumble with an SLR or lenses.  It bothers me to see people with disposible income and these expensive SLRS waltzing around snapping without a clue.  They would be better with this. Hey, if you really have the skills to negotiate and manipulate an SLR in a very versitile way then that is a good thing but IF you want to drop the ego and don't care about impressing anyone when you are not a highly skilled photographer you are better with this.  Yeah this camera is a pleasure to use and so versitile.  It will accomadate most all situations on a family trip or day of taking photos of animals or whatever...The camera has lots of great features and is laid out well.  The viewfinder is electronic and really great.  The LED screen is sharp enough and great.Here is the bottom line.  On one hand you have SLRs.  We all know that their images are great.  But lets take the average person what wants better than average pictures and wants to be creative.  They may not want to take the kids to the park or the zoo with an SLR and a bunch of lenses.  They may not want to be changing lenses.  The reality is that if all they are going to do is snap then get a regular and save some money.  If the snapper is wanting sharper images and has money get a G 15 or something.  Or take an SLR with a 50mm lens.  But let's take the person that takes the family on a trip.  They go to the zoo.  Well they want to snap the kids in front of a zebra.  But then they want a close up of an animal in the distance.  Then they see a flower and want a really nice macro.  Then they want to do a portrait.  Then this and then that at different lightings and distances.  This camera will do that.  Then it gets to be the end of the day and lighting is getting lower but you see a seagul in the distance and you want a zoom at 620mm.  Well this camera will pull that off fairly well.  So it is very versitile.  Yes, you will suffer some image sharpness under many circumstances but as I have said most of the time that is a non issue and will not be perceived.  To overcome that on your trip you need an SLR or smaller version of one with all the lenses.  It is your choice.I would say that for a person that wants more than a point and shoot but does not want to go to SLR with all the hassels and benefits then this is a great thing.  A person that has become desireous to expand beyond their point and shoot and get infinately better pictures and opportunities will like it.  A kids birtday party, trip to the zoo, vacation or..  You see some kind of bird on your lawn and want a real close picture.  Well you won't get it with the average point and shoot and with an SLR the bird may be gone by the time you change lenses.So you see you get ease, versitility, high build quality and great pictures at the expense of some image sharpness.  Image sharpness that many times will not be dectected.  In fact most of the time.  And please remember that IF you wanted a 620mm lens in an SLR what it would cost.  You see balancing a superzoom lens with a macro at a cost a family can afford is not an easy thing to do.  I think people forget that.  This lens goes from super macro to superzoom and all points in between.  You are going to have to comprimise somewhere.  I mean it is like that in life.  A general surgeon may be just fine for the operation but the specialty surgeon will do the job a bit better.  But the question is that in the operation is the difference important?  Many times no.  Sometimes yes..Lastly..  Everyone has an opinion.  Many times their opinions are based on some obsessive notion or whatever.  So when people say it is no different than a point and shoot, check it out.  This is what you do.  You go on line and you look at the pictures people are producing with the camera.  You look at the good and not so good.  You look at a lot of galleries.  You don't listen to image quality reviews so much because they can have and agenda.  You will see that this machine can get excellent photos and they are far better than an limited point and shoot.  Sometimes those photos will be up to an SLR and other times they will not.  More often than not they will be in between.  A very fair comprimise for the reasonible price.  And make no mistake you are getting a lot of bang for your buck with this camera.So sharpness often will not matter and it will matter very very little IF you are not blowing things up or viewing without printing.  BUT IF..  If you have a photographic need for tack sharpness or you are obsessed over it and have the money to spend then this is not a good choice for you.  But I think that sometimes a person gets hung up on something like sharpness when it really will not come into play for their situation.  This camera is plenty sharp enough for most people and especially considering all other factors.If you are making a decision just go look at galleries and a lot of them...Have a nice day...!6/12/13**** AddendumOk it has been 6 months of a lot of almost daily shooting.  I just wanted to say that this is the camera I go for the most and I do that because it is the most versatile.  The more I use it the more I love it.  I have a number of other cameras and they all have their own respective advantages.  Leica, Panasonic ect..  BUT this is the one I go for mostly.  If you are a family I highly advise it.  You want something that you will get all the shots with and this is the best thing going in my opinion.  The more you use it the more you find that you learn to get the great shots.  It is really nice right away but as you shoot over time you really begin to appreciate it.  Just explore and gradually you will become one with the camera and get all those shots of the kids and places you go.  Oh and Fuji has a website where owners post their pics and it is really good.  Also the quality of the build is better than most as it is an x series and we work hard for our money so it feels good to get something solid and obviously superior rather than just a tinny plastic junk.  It is really built fine.  Every time I pick it up it feels like quality in my hands.  I am so so glad I dished out a little more money.  Over the long term it was not much at all to get the quality I got.  This is a camera a family will USE and won't tie you down.  If you don't have a usable camera then what good is it?", "Date": "December 26, 2012"}, {"Title": "A Great Photographic Tool", "Author": "Bill Boone", "ReviewID": "R1J2AL3I74JNDJ", "Overall": "5.0", "Content": "The X-S1I only write this review to enlighten some people about what this Camera really is, and why I bought it. Take this writing for what you believe it to be.As a Photographer for over 40yrs, and a never ending Student of the Art, the X-S1 intrigued me from the moment I first became aware of it in Feb. of 2011. In my lifetime, I have had the good fortune to own some pretty fine equipment. It does not matter what the brands of those tools were, nor does it matter how much gear I had. I just know that I was really tired of the amount of gear I had. So I decided to read all the information that I could get my hands about the Fuji X-S1. At first, like many other great cameras that have come along, the X-S1 had some early troubles. There was a sensor problem, which caused white (Or bright) Orbs to appear on some Photos. That and a few other problems have long since been corrected by Fuji. In my research of this camera I spoke with lots of owners of this camera. I did not find a single \"Knowledgeable\" owner who did not love it! Not one! I downloaded the User's Manual from Fuji in March of 2011. I read, and reread this document until I knew the camera inside and out. This is something that is a pet peeve of mine. Why do people buy nice/complex things and never read the User Manual? Why? This is something that a long time ago, my Flight Instructor made very clear to me. Now really, would you fly a plane you did not know anything about? If your answer yes...well, forget buying this camera. Actually, this is a very easy camera to become very easy to use. Of course if you want to, you can put it full auto mode and get very good photos right out of the box. But...if you are a serious shooter, or want to become one, this is the camera for you. As I said earlier, I have had some pretty nice gear in my life time, but I can't think of one that equals this one. Yes, I mean that! There are those that think that \"Bigger & Most Expensive\" is the way to go. Believe me, it isn't. If I could go back in time, and could have this camera, I would be forever happy. Ok...a few words about this beast.Build quality is solid, better than any bridge camera on the market, guaranteed.Controls: Intuitive, fast, and precise. The Manual Zoom is nothing but PURE SILK.Auto ISO'S  of 400, 800, 1600, 3200Manual ISO's  of 100 - 12,800All the standard modes; M, AP, SP, P, AUTOExcellent Manual ControlsPlus; 3 Custom Settings of C1, C2, C3. For those that don't know what that means, I will tell you in simple words. If you would like to go out and photo bids in flight, you could set the C1 Mode as this: (ISO Auto 400) ( Focus: Hard) (Burst (fps) at the frames per sec you wish.) (Exp. Spot) (Focus: Area) (Film Simulation: Velvia) and whatever others your tastes might be. Select Custom Settings on the \"Shooting Menu\", select \"C1\", and the camera will be set to this when you rotate the Mode Dial to C1. If you like to shoot Macro shots, then program C2 for all the setting you prefer for shooting Macro Shots, select Custom Settings from the \"Shooting Menu\", select C2 and click OK. If you see something when you're out shooting, and it dictates a Macro Mode, just spin the Mode Dial to C2 and your ready to shoot. You also have C3, for another type of shooting. You don't have to reset your camera constantly. A Blessing for those of us old timers let me tell you!!Several other dedicated button for things like; AE, AF, ISO, WB, Picture Playback and Delete. Dedicated Buttons, no having to go into a Menu and look for them.Two Fn Buttons. Fn1 and Fn2. These work like the C1, C2, C3, as mentioned above except they are limited to a choice of 3 options for each button. Amazing, just 3 options each! What is one to do with only 3 options? LOLVideo: Stereo HD Video, with all the bells and whistles. (320 fps)  You will be impressed! Just \"RTFB\". I'm not a Video Man, but it is impressive.Image  Quality: In my opinion, as good as it gets. This reminds me of the two guys arguing  who's Stereo has the highest  frequency response. Can you hear over 16,000 Hz? I don't think so. I could go on the \"Tech Trail\" here but I refuse to do that. Why? Because it's pointless. Most of the arguments I hear about some of the hot topics are by some people who \"Shadow Box\" real well, but have never been in a ring.  I really avoid things these days. It's just a waste of time!The Lens: For the record, the lens used in this camera is a spinoff of the same lenses that Fuji uses for their big broadcast lenses that you enjoy when you watch coverage of the big events such as The Olympic Games, Golfing Events, and \"Monday Night Football as well. And it is made by the same technicians. Even the lens coatings are the same. That's Cristal Clear to me!How fast is the recovery time on the Shutter, how fast dose the Flash Recycle, how fast is the Auto Focus ? Do you really want those numbers? They're out there, look them up. But the simple answer is this: \"They are faster than Ali\". What does that tell you?Size & Weight: Equal to most DSLR'S. I find the weight to this camera to be perfect for comfortable and rock solid shooting. End of that story!LCD & EVF: The LCD is as good as you will need, and I might add that is very good! Moveable up or down. Works great, what else can one say?EVF: Well now...that is a thing of \"Pure Beauty\"!! I will describe it this way; it's like putting your eye up to a nice size hole on the side of a crystal clear fish bowl. It really is a thing you have to experience for yourself to appreciate. Really, it's just too hard to describe.This camera is a very well thought out piece of top quality engineering, loaded with very High Tech features that are actually very easy, and intuitively fun to use.In ending this mess I will tell you this: I use this camera on a limited professional basis, as well as it has become my best friend. I would seriously put this camera up against anything in its class, including many DSLR's, and would not hang my head at the end of the day.The people I shoot for are a selective and very critical group, and they are really more than happy with my work. And as you may have guessed, yes I love this camera! If you are a pro or want to be a pro someday, go out and buy yourself the X-S1. You won't need all those other lenses, clean any sensors, or drag around a suitcase to get those OMG shots. Remember this Quote by Ansel Adams: \"The best part of any camera is the six inches behind it! (That's close enough to the original quote for me)  I hope this helps!Thanks, Bill Boone", "Date": "July 18, 2013"}, {"Title": "Totally satisfied with my Fulifilm X-S1", "Author": "Amazon Customer", "ReviewID": "R1N83KLNHYRNPK", "Overall": "5.0", "Content": "After reading some of the negative reviews, I hesitated to order this camera, but decided to give it a try. It arrived a week ago and I began extensive testing for sharpness, image quality and the \"orb\" problem others mentioned. Two cameras, a Panasonic DMC FZ 150 and the Fujifilm X-S! were set up on tripods side by side and aimed at a tiled roof house about 750 feet away. The lenses were both set a maximum telephoto. The resulting photos, shot in raw, and not processed or sharpened, were viewed on my monitor and on 8.5 x 11 prints. Both photos were acceptably sharp and difficult to distinguish. But, the quality of the picture taken by the Fuji was far superior to that taken by the Panasonic. Colors were richer, and showed a greater range of tonal separation. Detail was rich.Many more pictures were taken of distant objects with detail. All were sharp and of excellent quality. A bit of sharpening in Photoshop really perked the images up. None of them needed any further adjustment.To test the orb issue, I photographed some stainless steel railings in bright sunlight and found no issue at all. I then shot a streetlight, head on after dark. The first picture did show the light as a white, detail less circle. A second shot, spot metered on the light and given 2 stops of increased exposure gave a well exposed and detailed image that showed detail in the lens of the light.In brief, the build quality appears excellent and the digital viewfinder is as good as it gets; almost, but not quite, rivaling an optical finder. The lcd screen is very usable in bright sunlight.The camera is expensive, but for someone seeking high quality and downsizing from a DSLR with multiple lenses it is worth a look.", "Date": "May 18, 2012"}, {"Title": "An Underdog Perhaps But Well Worth Considering This Great Camera!", "Author": "Peter Suslock", "ReviewID": "R16CL7SA31D0GG", "Overall": "5.0", "Content": "Please note that to say I am an amateur photographer is an under statement. A point and shoot guy for over 40 years, half of which I never knew which side of the camera to look through.As I am being dragged into the 21st century I decided it was time to invest in a decent camera, we have a few point and shoots most notable a Nikon P100 which was at the time - four years ago a Cnet best bet with rave reviews. These days getting a decent image is a crap shoot and the odds aren't in my favor. I liked the fully articulated LCD screen and the burst mode which took 10 pics in one click and only keept the sharpest one. The camera has bitten the dust and after many weeks of research I  have finally arrived at the point where if I look at one more camera my brains arew going to pour out of my ears.I had narrowed my choices down to the following:1) An entry level DSLR the Nikon D3100 or the Canon T3i 22) Out of the Bridge cameras I had narrowed it down to the Panasonic FZ200. It's insanely popular winning Cnet's coveted best in class for 20013 award.Price points on the above are all pretty much the same between the $450 - $550 mark. Fuji cameras had never been in the running except for one Point and shoot which I dismissed quickly along with others in the same category like the Nikon P510, P520 and a myriad of others. Checking them all out at Best Buy - Amazons's showroom, I was surprised at how flimsy and toy like the build quality was. Even with many mid range to higher end DSLR they felt fragil and poorly made - at least myold Nikon had some heft.Enter the Fujifilm X-S1 it was featured on the Amazon home page so I took a peek - the price was right, but I knew zilch about the camera and the few reviews it had. Cnet had nothing to say however about the X-S1 except for their branch in the UK. They had a video review that simply raved about the X-S1 giving it their award for Best of 2012. As I kept searching around one thing struck me as odd and that's there virtually no mention of the camera's Image Stabilization. As much as write reviews and comment on others, I post questions too, I posted a question asking about the Image Stabilization for the X-S1 and never heard a single peep.Every single camera I've looked into heavily promotes their image stabilization technology some offer optical only or on board or both. Canon, Nikon, Panasonic and Sony seem to be in a race as far who has the most sophisticated anti- shake and Blur free technoligies, it's splattered everywhere from Amazon listings to their promotional videos, Advertising and consumer bound selling materials. Because it's definitely a selling point and clear as in crystal to me an aspect of buying a camera that most consumers rely on when making a buying decision. However, even in the Fujifilm promotional videos for the X -S1 there's no mention of it at all.Despite this I was still intrigued enough to give it a chance and bought one. The day it was due to arrive I decided to call Fuji Tech Support to both get a head start on having a few of my questions answered and to try and get a feel for what it would be like as a customer. I found the support superb. When I mentioned the lack of information about Image Stabilization the Tech (a retired Professional photographer working in the New Jersey headquarters) felt I must have missed something so he did some poking around and was clearly dumfounded that there was indeed no information whatsoever.When I talked about taking an online or CD based Photography course his response was \"Not Necessary right now\" and told me \"Look, you won't learn this camera in a few days period. that's just not going to happen. Instead use the manual as a reference and most of all, play around with both the  EXR and full Auto settings, take plenty of shots and see how you do\"It was great advice.Yesterday I spent hours taking pictures of our Bulldogs romping outside,over 200 photographs. The photos with exception of a just a few are spectacular. Crystal clear, wonderfully rich and sparkling, vibrant true to life colors - I was dazzled.Normally I would be in Corel's Paintshop Pro or Adobe Lightroom for hours just trying to reduce the noise and blur but these were pristine. Harley our oldest was born to play soccer. That said, because the recovery time between shots  and focusing is so lightening fast the \"action\" shots of him playing, running, moving his gargantuan orange ball around were perfect, so perfect and blur free it was hard to believe I had taken them.The camera is blazing fast.In indoor light I wasn't impressed with performance although these shots were easy enough to brighten in editing and the detail was still marvelous. It wouldn't be so \"marvelous\" if I had 50 or 100 images to correct. At first I chalked this up to my ignorance of ISO, white balance, shutter speeds and so on. But since, I've found a number of gripes  about poor low light performance. I've yet to try out the flash hopefully that'll make a difference - but good low light performance was at the top of my list.As for the feature set it seems fine to me. The camera doesn't have many of the built in filters and modes I see with others in it's price class such as Miniaturize, old movie. Sepia and so on. But I tend to think many of these are gimmicky and there's nothing you can't do in Photoshop if you're so inclined. So in fact I like that the feature set provides options you might actually use such as the three Film modes. The camera is free of what might be the equivalent of novelty bloatware.I wasn't sure how I would like the manual only Zoom but it's terrific. Smooth as silk and completely silent. The  view finder is excellent as well and surprisingly I found myself preferring this over the LCD screen. Another nice feature is when you raise the camera to look through the view finder the LCD screen automatically turns off and vice a versa.You can also set this by pressing a button on the cameras body to only use the LCD, EV or both. As for the LCD The articulation is limited to tilt which is fine. Plus there's very little wash out in direct sunlight so it's always easy to read and nice and bright.Some First Impressions:* Built like a Tank. The camera features an all metal body, covered with a rubberized coating and all metal dials - excellent build quality* Smooth operation and a great feel in the hand it's substantial and re-assuring. A far cry better then the plasticy and toy like cameras - including many of the more expensive DSLR cameras that I played around with in stores.* From what I gather the oversized cmos sensor is the largest of cameras in this price range and helps make for the stunning photographic images produced by the X-S1.* The rubber gill like surrounding on the lens barrel feels really nice in the hand and lets you get to that exact point where you want to go very quickly without having to fiddle with a powered zoom.* The Manual Focus ring which sits behind the zoom is equally responsive.* The battery compartment and the SD card slot are on opposing sides of the camera so you don't have to open the battery compartment to swap cards or vice a versa.* Lot's of ports. Including one for an external Mic, and an HDMI cable.* Full HD video at 1080 plus built in stereo mic/speakers.* Intuitive menu for easy set up - but still LOT'S to learn, especially for the novice.* At two pounds it's a heavy camera - but I like how substantial it feels and think with use I'll get used to the unexpected weight.* Pop up flash is which according to Fujifilm is more than adequate up to a range of 6-10 feet indoors and out. If you're further away say in bleachers, you'll need an external flash.* Speaking of external flashes the camera has a Hot ShoeVery nicely and well presented the glossy black box includes the camera of course, The battery (which takes a first 4 hour charge) a charger and power cord, a quality neck and shoulder strap, Spring loaded lens cap which fits good and tight, USB transfer cable, Manual which is surprisingly easy to understand and follow, a CD ROM with a PDF version of the manual and Fijifilms's editing software (my copy wouldn't install) registration card and some additional paper work mostly safety and care related.As for the lack of Image Stabilization specifications I was concerned about, I've still yet to come across any mention of it. That said and considering how shaky my hands can get and how flawless the pictures I take are coming out whatever Fuji has done in this regard is working extraordinarily well.Perhaps the X- S1 is a bit of an underdog but to me that's just one more reason to like it.It's as impressive looking as the photo's it's taking are beautiful. In hind sight a DSLR would have driven me crazy lugging around all those lenses that cost more than the camera itself the X-S1 is a nice alternative.With Super Zooms ranging up too 50X those that for whatever reason want a telescope attached to their camera this isn't the ticket. However the 26 X zoom is more than enough for most folks, myself included. Plus the shots I took with the zoom fully extended without a tripod were sharp and clear.I Couldn't be happier with the X-S1 and I plan to update this review or rather novella, as I learn more about all the camera offers.Highly Recommended***** UPDATE AS OF 11/21 FUJIFILM BLUNDER PAYS OFF FOR THE CONSUMER IN A BIG WAY*********I'll caveat this update by saying this camera continues to blow me away, the build quality, the intuitive menus and most of all the incredibly vivid photographs.When Fujifilm brought the X-S1 to the American market it had already been a huge hit at the CES (consumer electronics show) but pricing was never released until the camera was picked up by resellers. The MSRP was $800 and hence lays the rub.This put a bridge camera at the same price point as entry and mid level DSLR cameras many like the popular Nikon D3200 with kit lens and VR zoom lens for $700 and there's no shortage of other DSLR offerings at the same price point - and more often even less. The same for Bridge and Kit cameras. Highly rated cameras with similar specs and a longer zoom range like the Sony HX300 and the Panasonic FZ series, especially the FZ200 - both sell for less than $500.Is the X-S1 worth $800 in my opinion yes it is, however not when compared to other cameras both DSLR and Bridge that meet or exceed the X-S1 in performance and flexibility. Fuji priced the X-S1 out of the water and into a class of cameras where it couldn't compete - hence being rightfully seen by consumers as dramatically over priced it simply didn't sell.About the lack of Image Stabilization - it's there, it's built in Fuji just neglected to advertise it. I'm convinced this over sight added significantly to lack luster sales.If you log on to Fujifilm's web site, click from USA to Global there's an entire site dedicated to the X-S1 they cover everything in gorgeous detail from the amazing sixteen optical's, the Huge cmos sensor and the dual core EXR processor which in a nut shell work in tandem and make for blazing fast shooting and jaw dropping beautiful images.Consumer Reports (I live by CR) really compliments the Image Stabilization of the Fujifilm cameras they review and recommend - they don't have a review on the X-S1. However, the inner workings of Fuji's IS appears to be the same in most every higher end model CR reviews.I kept digging for some information on IS and was able to find the following on descriptive link to the Fujifilm Image Stabilization :**High-precision gyro sensor, which uses a unique algorithm to accurately detect camera shakes in the previously-undetectable ultra-low frequency region.The detected amount of camera shake is corrected, even in the slow shutter range, by mobilizing the corrective lens unit with sufficient coverage. he linear motor technology checks for camera shake 8000 times a second, and controls location feedback of the corrective optical system 16000 times a second to counter even the most minute of high frequency camera shakes**Add the lack of this information in all of the X-S1 marketing materials, the unrealistic price point and no wonder the camera didn't sell.But now at $400 it's a steal - it trumps anything and everything at this price point.About the low light performance - I should amend my review in this regard because by using the right settings low light is fabulous. I've starting shooting in Raw and Dog mode to photograph our Bulldogs. At first I thought the dog mode sounded gimmicky but it catches them virtually in flight as they go berserk with their soccer balls - and there's zero blur and zero noise.The X-S1 is making me a better photographer and I've just begun to scratch the surface.", "Date": "November 17, 2013"}, {"Title": "First Impressions", "Author": "D. Barry", "ReviewID": "R1KNI8TYWRZUYN", "Overall": "4.0", "Content": "I haven't had the camera long enough to give a complete review, but I can already answer some of the comments made in other reviews.Softness at Extreme Telephoto :-  Based on the test shots I have taken, this is not an issue with the sample that I have.  Even wide open, I would have no issues with the sharpness for a camera of this type.  While clearly not something that would rival the results from a Canon prime telephoto, on a 1Ds body with which I am familiar, for a camera /lens combination that is only one 20th of the price, the results are excellent.  My sample does have some back focussing, out by about six inches when focussed at infinity, so this might account for the softness experienced by another reviewer.Lens sagging :-  No sign of this with my sample.Blue lens flare :-  No sign of this with my sample.  In addition color fringing is noticeably absent.Other Comments.Image noise :-  Not surprisingly, the high ISO performance of this camera is not as good as my X-100.  The X-100 is excellent up to 800, and good at 1600.  The X-S1 is about a stop worse, very good to 400 and good at 800.Build Quality :-  As others have said, the build quality is excellent.Responsiveness :-  Something not mentioned as much as I think it should be is how responsive the camera is.  Focussing is very fast and shutter delay is short enough to not be noticeable, which is a huge plus.Conclusion.So far the camera lives up to the reviews that are enthusiast about it.  I will add more comments as I gain more experience with it.", "Date": "February 22, 2012"}, {"Title": "Almost The Perfect All-In-One Camera", "Author": "Kort \"Art, Music, Book & Movie Enthusiast\"", "ReviewID": "R2P4N9U328Z5ZQ", "Overall": "5.0", "Content": "While I've used film SLRs in the past, I've never stepped up to a DSLR. I've found P&S; digicams and bridge cameras to work well enough for 98% of what I shoot. Sure, I wouldn't mind the added speed and quality a DSLR offers, but I don't want to pay for it and have to lug around/invest in multiple lenses. There are some tempting 4:3 options out there right now, but instead I decided to go with the Fujifilm X-S1. It is less than half the list price on Amazon currently, so it really is an outstanding deal, and I've found Fuji digicams can really deliver the goods. I have a number of compact cameras, and the X-S1 will be replacing (mostly) my old Olympus C8080 and a Panasonic FZ-50. Both are still great cameras, but they are showing their age.EDIT: I've actually acquired a Sony a7K recently, so I now own a full-frame interchangeable lens camera. The two are quite different though, so I won't compare them here. Both have their strengths and weaknesses, but if you're on a budget and don't need 24MP, then the X-S1 is the better choice.This is no compact all-in-one. In fact, a casual observer might assume you are using a DSLR. That pays off though because the build quality and ergonomics are outstanding, and the fit and finish is quite good. The X-S1 is even moderately weather sealed, so you can use it in lightly rainy weather with no fear of it getting ruined. If you don't mind lugging around a slightly less than DSLR sized camera, then the Fuji should work for you. Especially considering you won't need any extra lenses. Battery life is exceptional for this type of camera. Again - it has a solid, outstanding build quality with it's sturdy frame, grippy finish, and tactile metal dials.So, who is this camera for?- A person who wants nearly DSLR performance and quality in a single lens package. The wonderful manual zoom lens is silky smooth. Many DSLRs will have better low-light performance and faster focusing and shooting for sports, but the X-S1 is no slouch when compared to other bridge cameras and often bests them. Coupled with a fast 64GB SDXC card (like the SanDisk Extreme 64 GB SDXC), it blazes. It has tons of manual options, many of which I've still yet to explore.- A person who wants a versatile zoom range. There are other (sometimes smaller) bridge cameras out there with a longer zoom range or wider angle low end, but they would be hard pressed to match the quality the X-S1 offers, and the Optical 26x zoom (24-624mm) is pretty darn good. You can get excellent macro shots and then zoom out to the long end for close-ups of a distant subject. The camera's superb optical image stabilization helps in this respect as well. Wide angle, full 26x zoom, and 1cm Super Macro - this lens has it all and the camera hardware to make it happen!- A person who wants quality images above and beyond your standard point-and-shoot. The FUJINON F2.8 Wide-Angle lens coupled with the ⅔ 12MP EXR-CMOS sensor produces images with a great tonal range and fairly sharp detail across the zoom range. The 2 EXR 6MP modes boost either dynamic range or low light performance as well. The 9-blade aperture diaphragm allows for lovely \"bokeh\" effect in shallow focus images too.- A person who wants good full HD video. While the video here won't match the quality of HD from some other P&Ss; or DSLRs/4:3s, it does produce quality full HDR video that wows me. Audio quality from the built-in microphones is pretty good, and the image quality is impressive. The user can manually zoom in and out while recording with little or no noise, but I've noticed that the autofocus has a tendency to blur out for a second or two at times while trying to find the subject near full zoom. This isn't a deal breaker, but you should be aware of it.- Macros. The lens lets me take amazing macro photos. Other fixed lens cameras can as well, but this lens coupled with the larger sensor in the X-S1 is impressive for a bridge/super-zoom camera.So who should steer clear of this camera? Anyone wanting a pocketable compact package for snapshots. This is not stealth digicam -- you'll need a camera bag for this one. Those who require the quality and versatility of a DSLR or even a 4:3 camera may also want look elsewhere, though the X-S1 comes pretty close in many areas. It has some quirks that take getting used to and the extensive menu system and myriad controls take a while to fully understand. However, it is fairly easy to use overall. You could leave it in the full auto setting and get great shots, but you'd be doing yourself a disservice.I think the X-S1 is nearly the perfect \"compromise\" camera. It does nearly everything almost as well as cameras dedicated to those functions. In a few areas results from the X-S1 may even exceed or surpass them. With its form factor, it is a joy to use and is a great all-round option for nearly every situation. The more I use it, the more I find to love. I've obtained impressive results from all of the photos and videos I've taken so far, ranging from landscapes to sports to portraits and close-ups. I also own the X-S1's younger sibling, the new S1, but aside from slightly improved weather proofing, the 50x zoom range, lighter weight, the fully articulated LCD, Wi-Fi and slightly better image stabilization, the X-S1 shines as the better quality camera for the enthusiast. The X-S1 can currently be found for less as of this writing too.I've taken the X-S1 to the beach a few times and it performed admirably. The custom settings work well, but the \"beach\" preset was good enough for 95% of the photos. This camera continues to be a joy to use and I'm very glad I purchased it. The long zoom combined with the wide angle on the other end makes it ideal for beach related photography. There were occasional focus and exposure issues, but for the most part I couldn't be happier with the quality of the photos I captured. I can unequivocally recommend it to someone looking for a quality bridge super-zoom at an amazing price.EDIT: 05/08/2014 -- This camera continues to impress. If 12MP is enough resolution for you, then this camera delivers in all of the ways that count. Short of getting a much more expensive DSLR with a the range of lenses this all-in-one offers, I don't see how you can do much better with either quality photos or amazing video.~ Kort", "Date": "December 16, 2013"}, {"Title": "Stunning camera for the price", "Author": "B. Eibisch", "ReviewID": "RVHGR9YCRDH7Q", "Overall": "5.0", "Content": "FUJIFILM X-S1I bought a Fuji X-S1 about two months ago as something of a retirement gift to myself as a go anywhere camera. I have had 4 previous  Fujifilm digital cameras S4000, S4800, S5200 and S2980.The main reason you buy a Fujifilm camera is because of the stunning colour quality. It is just amazing that for as little as $200 Fuji will sell you a, \"stack 'em high, sell 'em cheap\" camera that gives such wonderful colour representations. Scenery is great, portraits are great, ocean is great; contrast, tonality and colour gradient are great. But of course with such a \"limited\" camera you need to know what you are doing.Being an older guy, I cut my photographic teeth on 35 mm film Nikon SLRs and have a cupboard full of them with lens and all sorts of attachments.Firstly don't be sucked in by negative comparisons you read with DSLR technology because the Fujifilm X-S1 is not a DSLR; it is like comparing apples and oranges. The Fujifilm X-S1 is a single lens extreme telephoto (24 mm to 624 mm focal length(X26)) bridge camera. If you really want a \"full frame\" DSLR and all it can do then cough up the thousands of dollars and start buying a whole suite of lenses; that'll cost you a damn sight more than the $800 approximate cost of the Fujifilm X-S1.Personally I'm so electronic these days I hardly print any photos any more preferring to view them on my computer slideshow however my printed photo from this camera was just terrific.The lens on this camera is manual, \"zoomed\"  by twisting the barrel with your fingers but it is a delightful piece of kit to use and reasonably fast too being F2.8 to F5.6 at 624mm focal length.  Wow!!! ( I have some F1.4 primary lenses but they cost me about $1000 years ago ...just for the lens. Do you really want to shell out that kind of money for an extra 2 stops???). This lens also has a very nice manual focus ring with a button electronic over-ride in case time runs short.Some people whinge about the picture quality?? Just check out Tony Sturn's images on the internet and you'll be less concerned. The pictures of birds, foxes and squirrels taken by this guy with his X-S1 are just stunning. With a little care, photographic knowledge and this camera you could take pictures like that too.I bought this camera because I used to love using Velvia film and this camera emulates Provia, Velvia and Astia films for those of you old enough to know what I'm talking about.  The emulations are just fantastic!!! Once again the Fuji colours are just brilliant.The lesser Fuji cameras have dropped the lens thread and that is a real disappointment because as an ex 35 mm SLR user I have many Cokin filters and gadgets to thread onto cameras.  The Fuji X-S1 however does have a thread for filters. So should you decide to buy one get a  UV(o) filter put it on your camera and presto your pictures are going to look a whole lot better even before you press the shutter button. Also protects your lens from scratches and such so leave it on. I also use a polarising filter a lot as in Australia we can have some pretty harsh sun light so a circular polarising filter is also a good thing to have.There are several films on YOUtube about the Fuji X-S1 and a look at these is probably a good idea.Some people have mentioned that the feature set on this camera is very good; very good is an under-statement... it is just fantastic. All sorts of modifications can be done on this camera, all the programme usuals plus colour modifications, film emulation, SLR portrait emulation, various panoramas up to 360 degrees using the camera horizontal or vertical, various bracketing modes, best picture from bursts with variable before and after how many shots etc etc. White balance is a special treat in this camera and I'm not exhausting the facilities on this camera. It is a fun camera to explore for all our techno geeks.Some have commented that image stablisation is not that great. But this camera goes out to 624 mm (35mm equivalent) focal length and with intelligent digital zoom (which is really good) goes out to 1248 mm (35 mm equivalent) zoom. Anybody who knows anything about photography is not going to do that hand held!!!  You need a tripod for that kind of stuff whether you have 35 mm SLR, DSLR or a Fuji X-S1. So commentators.... let's not be idiotic, make use of your tripods.  I took a picture of the moon on X2 intelligent digital zoom and fair dinkum, craters and everything are visible in the image but of course, I used a tripod. (HINT: If you want to photograph the moon don't do it when it is full moon, the shape called, \"gibbous\" and \"quarter\" is probably the best).I believe that Fujifilm is on to a real winner with this camera concept and as time passes and the few little \"bugs\" are ironed out this camera, should it become a series (i.e. X-S2, X-S3 etc.), up-ing the pixel count (currently at 12 MP on the X-S1) and maybe even a few more \"bells and whistles\" or an up-ed \"EXR\" facility could be a real DSLR killer. (RIP Nikon, Sony and Canon)", "Date": "January 15, 2013"}, {"Title": "The more I use it, the more I like it", "Author": "kkimpressed", "ReviewID": "R2X2MJIGZDK3UI", "Overall": "5.0", "Content": "I have been using P&S; for years, and this is the first camera I own that allows me to do more.  The reason I am getting a Fuji is that I always like the pictures taken by my good old S2800 years ago.  Then along the way, I changed cameras from time to time, brand names include Panasonic, Casio, Canon, with the latest being the Nikon S8200.  All these cameras produced good pictures, but not at the point where you can feel the color jumping out of the screen, including a Canon DSLR from my sister.I also understand that this X-S1 should not be compared to P&S; and I didn't mean to.  I am a lazy person who wants to do more with a camera but without carrying a whole bunch of lenses, swapping them from situation to situation.  This all-in-one superzoom really helped this big issue out for me.  The manual zoom lens moves this camera from Bridge Camera class to another one very similar to DSLR.  Few days ago I bought a Sony SLT-A55V with a Sony 18-250mm lens for a friend.  With more adjustment, the pictures are just as good, or more detailed as the Sony DSLR.  Therefore, the more I use this camera, the more I understand it, and in turn the more I like it.  There're few settings I have changed from the default settings:- Flash is lowered to -1/3- Exposure compensation to be one notch below the middle- Metering, or AE setting to be Multi- Some people says photos are good up to ISO800, what I do for this is to lower the resolution to 6MP, which is still good for Letter Size printThe purpose for these settings is to reduce the overall exposure by the default settings. Personally, I feel the camera tend to over-exposed a bit by all default settings.  Coupling with limiting ISO, I can achieve great result from the camera.  Shooting far away objects such as birds, kayak from Golden Gate Bridge was absolute enjoyment.  Again, I just can't emphasize enough about the beautiful color reproduction from Fuji cameras, and X-S1 is no exception.", "Date": "August 19, 2012"}, {"Title": "Not a Dream Come True For Me", "Author": "S. Hock \"slhimages\"", "ReviewID": "R39JF4UYZI006E", "Overall": "3.0", "Content": "I only had this camera for a few days. Had one major use for it and it was at the long end of the zoom. I felt my example just was not sharp enough at full zoom to satisfy my needs. (Yes, I used a tripod to test.. a very solid Bogen.) I confess, I had high expectations for my 800 bucks!If you are interested in the shorter focal lengths, especially wide angle, you may like the camera. Exposures and controls were all good and really wanted to like the camera but .. I couldn't. My Panasonic FZ35 is far better at its long end. Even the Panasonic EZ mode is sharper than the Fuji at full extension.What's the point of a long zoom camera if it's not sharp at the long end? I did not see the \"orb\" problem or lens flare mentioned in other reviews in any of my 250+ images.The Fuji build quality is a step above and feature set is extensive. Maybe this is a \"teething\" problem for Fuji and will be addressed quickly and easily. I hope so. It's obvious a lot of thought and careful manufacturing went into this camera. As a \"flagship\" camera they must have high expectations too.Bottom line is that no matter how \"nice\" a camera is, if it doesn't produce the kind of images you want and expect then it has to go back. Mine did.Maybe I got one that was not quite tuned properly. I'll wait and see and see how other buyers fare. I may try another in a few months if reviewers have more positive comments.If you need a good long zoom bridge camera I would start with the Panasonic FZ150 or perhaps wait for the latest 16MP Nikon P510 with a whopping 42X zoom. Both are substantially less cost than the Fuji.You might also consider a Nikon D3100. Price is less and it is more flexible. Buy a \"body only\" and the best lens you can afford that meets your needs.", "Date": "February 20, 2012"}, {"Title": "Love it!", "Author": "Jennifer \"Mom of two baby girls\"", "ReviewID": "RCAFW2TS397BU", "Overall": "5.0", "Content": "I've been reading reviews for months to purchase a new camera. I actually read reviews until my eyeballs hurt. Originally, I planned to get my first DSLR, I had missed my old SLR film camera from college so much I thought I'd take the plunge and invest in a better digital camera with changeable lenses. The only digital camera I've ever owned was a little Canon SX100, decent little camera but terrible in low light. It was okay, for shots of the kids outside, vacation or a trip to the park or zoo.  I went back and forth for months and finally came to the conclusion, I just plain didn't want to mess with a bunch of lenses, I used to pack lenses and I didn't miss that really. I had gotten used to packing light with a point and shoot but really missed taking professional looking pictures. A little background for you. I've been into photography for about 20 years, I've used a ton of different cameras, Nikon, Canon, Vivitar but never Fuji. I've shot weddings with some of the best film cameras out there as an assistant. Oh how beautiful those shots were, the bride loved them. I laid down my love of photography for awhile and used my point and shoot for taking pictures of my kids but I was never satisfied with the image quality and really missed a good camera. Finally, my husband said, just pick out a camera, do some research and pick out a new camera. He's the spender, I'm the saver and I don't like spending money on myself, especially for a hobby. But it got to where I was asked to do so many family photo shoots I had to invest in something better than my little Canon. I nearly felt embarrassed showing up at a photo shoot with just a small Canon but was relieved when people were pleased with my work and came back for more. The Canon SX100 did really well in natural light and I always did outside shoots but at home inside it was terrible, not good at Christmas around the tree or birthdays inside. I wanted a more versatile camera but a nice camera, one I would not want to replace for a good while. One I would be proud of when I did an occasional photo shoot, especially for people I did not personally know and were recommended to me. I was pleased with my little Canon but never fully pleased and I knew I would want to replace it very soon when prices went down and technology had improved. Still I found at 8 megapixels I could print out an 8x10 and it looked pretty good and fine for the average consumer. I wasn't impressed with higher megapixels on a small sensor, to me you are just asking for more noise. This camera has 12 megapixels on a 2/3 sensor and I think that's enough, so glad Fuji didn't go higher.So the search was on for a new camera. I came across lots of DSLRs in my price range and then the thought of a bridge camera crossed my mind, only for a fleeting moment. Then I thought, well, image quality, I want image quality. I thought about a Canon T3 the price was good but I wanted a tilt screen. I thought about the Canon SX50 bridge camera but I wanted to try a different brand for some reason. Sounds picky but I hated the way Canons shot grass. Looked funny to me, but I liked their reds. Then I thought about a larger investment of a Canon 60d. But then, I didn't want to spend that much. I had an awesome Nikon SLR film camera back in the day and I really missed using it and I still own it, but who wants to mess with film these days? So I thought about a Nikon DSLR and researched them for awhile, still couldn't get settled. As you can see I went back and forth for months. Bridge or DSLR was the question. What was the answer! It was driving me crazy trying to find a camera I was sure they probably did not produce.I checked out just about every bridge camera on the market, I just could not get settled on one. They all felt so cheap and they looked cheap. Then I would go back to looking at DSLRs again. I wanted a camera I did not think existed. I wanted a camera that felt like my old film camera with a nice grip and weight but was digital but I really did not want to pack extra lenses, I wanted a nice zoom, I wanted a camera with a larger sensor than my point and shoot, I wanted an in between camera but I was not impressed with all the other bridge cameras out there. Mainly, I really wanted a camera that was awesome in low light, something my little Canon could never do. So I came across this Fuji XS1 somewhere on the internet when I googled professional bridge camera and my mouth dropped open! The camera I had dreamed up did exist but it was $800! Bummer. So I kept an eye on it, I kept reading the most recent reviews. I learned they fixed everything wrong with the thing and the price kept on dropping. The more I looked at this camera and read about it the more I wanted it. I'm an extremely picky person and I hate making mistakes, and I didn't want to waste a dollar on a camera I would not like in the end. I'm no pro photographer but I have lots of experience. I have a BFA in graphic design, so I'm more of the artsy type. I know good composition. I know lighting is everything and I also know a good picture when I see it. I do have a trained eye. So I wouldn't exactly call myself an amateur but again, I'm no pro, I'm somewhere in between, so I needed an in between camera with an in between price.  I settled for a point and shoot when I had kids and I wasn't settling anymore. The only thing bothering me was the price of the Fuji XS1. I wasn't willing to pay such a high price for a bridge camera when I could get a DSLR for the same price, that was my only dilemma. So the price kept on dropping, I was loving it! I kept a close eye on the price for a long time and it just kept on dropping. I finally decided this was the camera for me so when it finally hit $349 I was so excited, I pulled the trigger and ordered one. I was nervous hoping I'd made the right decision after all that debate and research.Well, I got the thing in the mail and it was brand new, never been out of the box. Yes, it was a little bigger and even heavier than I expected, but the grip felt so, so nice. I loved, loved the rubberized coating! I can now see why Fuji priced these things so high at first. It screams quality! It is so nice and feels really close to my old film camera but nicer really. I love it that it has a manual zoom, saves battery life and I love manually zooming. I do not miss my toggle at all. The EVF is great. The weather hasn't been great here so I have not tried it outdoors much, but wow indoors in low light, it's awesome! Love it, very impressed. I read a few reviews out there in cyber space about this camera being just an outdoor camera, I have no idea what they are talking about. I think people like that do not know what they are doing or how to set their camera properly. In a very dim room just set on the EXR setting it looked like a brightly lit room! Finally a camera that shoots well in low light! I'm having a great time just in EXR mode, it's fun, the camera thinks for you and I set it on that if I want to get a quick shot. It was so fun to watch it change to different settings while I was outside on a nicer day, it would go from landscape mode, to macro, etc. just by me pointing it here and there and zooming in and out. Then on a snowy day the camera recognized the snow and set it on snow mode. Now, you are probably wondering, pictures, what about the pictures? What about image quality? Well, I am very pleased with the pictures. My husband is relieved he won't have to hear me beat myself up over a terrible purchase. I am actually very pleased with my purchase. I love the look and feel of the camera, it's a very impressive looking camera. Was I expecting it to perform like a DSLR, not really, it's a bridge camera. But I'll tell you one thing, it performs better than any point and shoot or any other bridge camera on the market today. I dare say it might even give a DSLR a run for it's money. It's better for me because when you have kids you don't want to pack extra stuff like lenses, I have enough to pack. One thing I've also learned over the years, the general population doesn't know a good image from a bad image and isn't concerned about image quality at all. This was shocking to me. I'm very concerned over image quality and color. Did I mention, I love Fuji color and to my shock I love it way more than Canon color! If you are a pro, don't bother, this camera will never satisfy you, you are to used to a DSLR and all it can do. But coming from my background of SLR and then a digital point and shoot, this is a big step up. This camera is just plain fun and I'm pleased enough with the image quality although I know there is much better out there. But for shots of my kids, vacation and occasional photo shoots with families and kids people ask me to do, this is great. I'd say as far as bridge cameras go, this is a professional bridge camera. I've picked up other bridge cameras in the store and have a friend that has a new one. They all feel so cheap and plasticy and mostly made in China. This one does not feel cheap and it's made in Japan. All my friends thought it was a DSLR, of course I told them the truth but really, you can't tell it isn't one, it looks like the lens should come off. Then friends with DSLRs envy my zoom, making comments like it would cost them an arm and a leg for something even close to that, not to mention a lens with that reach be huge on a DSLR!I'm pleased that it comes with a paper manual, very helpful. I found the menus easy to navigate and it all made sense to me. It's really more simple than I thought it would be to figure out. If I feel like being artsy I can manually set everything on this camera. If I feel like being lazy, the EXR mode is superb. After all of my debating and reading reviews, I'm so glad I bought this camera. I'm very pleased with it. The zoom is so much fun. Yes, there are larger zooms out there on other bridge cameras, but those cameras have smaller sensors, therefore not any better in low light situations. I feel like Fuji heard my cry for a professional bridge camera and manufactured it just for me, for those of us that don't want to pack lenses and wanted a good quality camera not made in China this is for us. Photography is a passion of mine, it helps me to relax, I enjoy it and I wanted a camera I could enjoy again and I found it! The price tag is worth every penny at $349 but I would have paid more now that I own it and know it is a good quality camera. I also love it that it has a rechargeable battery pack, no more buying batteries. I invested in an extra battery pack. My charger works fine and I've played so much with this camera I've already taken nearly 1,500 clicks just playing around. No worries with rechargeable batteries. I have a lot to learn about this camera but so far I've tried it in many different settings, different lighting, outside, inside, dim rooms, well lit rooms and have to say, whew, I'm relieved this was a good choice for me. You can have your lenses and all your equipment. I'll take this any day over packing all of that. Also, I've always had a very steady hand and never needed a tripod in my life. I very rarely have blurred pictures and I'm pleased to say, with no tripod and with the zoom extended all the way out, my pictures are tack sharp. Yes, I'm a pixel peeper, I put it on my computer, blew it up to look and see and well, I'm okay with it. No not perfection but close enough for this price range. To me nothing beats film and I've had experience with very nice DSLRs that friends own, and I'll probably never be truly satisfied until I get a really nice DSLR but for now, this will do and on a tight budget, I think it's perfect for my lifestyle and it's not like I'll be opening a photography studio anytime soon. Like I said, the general population, they only want a decent shot, I find something wrong with every shot I take, something can always be improved upon and learned, people with an untrained eye get very irritated with me, because yes, I want perfection. They see perfection while I see major flaws and things I wish I had done differently. I tell you this to say, I've been told I'm picky, too picky but I think that's a good thing when you want to give people your best work, I delete a lot. This camera like any camera takes getting used to, I'm used to darker pictures because of my old point and shoot so I found this camera to be a tad over exposed in a nicely lit room. My husband says I'm crazy, they look perfect. But I see overexposed, just a tad. So I keep my hood on changed the setting, it helped. Yes, I'm used to darker pictures and knew they were underexposed and there was nothing I could do about it, so this is refreshing, but I figured it out and have shot many \"perfect\" pictures since. I'm always looking to improve and I will go to the ends of the earth to improve myself in photography, I read a lot, I watch tutorials, I've had classes in photography and I've learned some tips from pros. We are all always learning. I think this is a good learning camera. It's too much camera for some people, not enough for others. Some will complain, others will love it. So for me, a very picky person to give it 5 stars, I think that's really saying something. I think comparing this to a DSLR is like comparing apples to oranges but I see why people do. This camera I think is sort of in its own class. It's better and nicer than other bridge cameras (just my opinion) but not as good as a DSLR. The only bad thing I can really say, it's heavy, very heavy. I understand most of it is the lens and the darn thing is built like a tank! So I'm willing to tote the extra weight. I was surprised it's a little heavier than my old film camera but it's a really good camera. I'm proud to pull it out of my camera bag, it looks very expensive and impressive, no one knows it's not a DSLR unless I tell them, ha! Kind of funny. I love this camera for what it is and refuse to hate it for what it is not. It is not a DSLR so don't expect it to be, but it is a very good camera and I'm am more than pleased. I'll enjoy the heck out of it until I decide to take the leap to buy a DSLR, I know I will one day, because I won't be fully satisfied until I do. Thanks Fuji for making a camera for us in-between people, I love it!", "Date": "March 13, 2014"}, {"Title": "Great camera for our family", "Author": "seb", "ReviewID": "R1RE05RXF7KOCD", "Overall": "5.0", "Content": "The only thing I don't like about this camera is all the smoke that comes from igniting the flash powder when taking low light indoor pictures.Kidding.This is a great camera. My wife has been using her iPhone to take an increasing number of pictures of our young 3.5 year old son. We also have a small compact waterproof/ruggedized Pentax W80 that we've had fun with when canoeing, fishing, skiing, taking on hikes etc. but its image quality isn't really very good (lots of noise). We've had a couple of Canon ELPH's in the past and they're pretty good (both became used to death/damaged).Since our only cameras were the iPhone cameras and the Pentax. I decided, as a Christmas present, to get my wife a really nice camera that would be a good investment for our family as we go on our adventures (the zoo, seeing Santa, hiking, family get togethers, playing at the park, birthdays, etc).  I looked as some DSLRs (my wife always stopped to look at them at Costco) but they can get pretty expensive really quickly and as I did my research, I realized we'd likely need several lenses too. Lenses we probably won't be able to afford right away (I work, she stays home to raise him. Not as much disposable income right now).Then I came across the 'bridge' or 'SuperZoom' cameras when a friend at work got a Canon SX50HS for his Christmas trip to Kenya. He loved the idea of the 50x Zoom (turns out the lions were up close and he never needed to zoom in 50x but that's another story....).The cameras I was comparing the X-S1 too were the Canon SX50HS (less expensive), the Panasonic FZ200 (more expensive), Leica V-Lux 4 (much, much more expensive) and the Nikon P520 (same price) and the Fujifilm HS50EXR (slightly more expensive). I did not compare the image quality/features to DSLR directly. However, most reviews on the web (blogs, review sites etc.) do. There are also many reviews on Amazon by 'pro' photographers that love to compare the X-S1 to their pro DSLR gear. That's fine, but doesn't interest me as we simply didn't intend to spend that much money on various lenses (remember, we have a young son and varied priorities) plus we simply don't want the hassle of taking all those lenses with us on hikes, to the zoo, etc. It just wouldn't be realistic. We have a wagon full of stuff for the zoo already. We just don't want a backpack full of lenses we need room for snacks and water.Don't get me wrong, if it were just me, being a photographer, heading out at pre-dawn up to the mountains to get wildlife/landscape photos to sell or show off, yeah, I'd probably take a bag of glass with me. But that's not us. So...Again, this is a GREAT camera. My wife loves it (and so do I). She was shocked on Christmas morning when she opened the box and found such a well built piece of equipment. I also got her the book BetterPhoto Basics by Jim Miotke. Might get her one of the Scott Kelby books as well. This camera has all of of the high end features you'd find on a a DSLR; Program mode, Aperture and Shutter Priority, Manual Mode, AE/AF lock. etc. And the buttons are conveniently placed along the left side of the LCD. The Menu is straightforward and easy to learn.It's got several bracketing modes for ISO, Exposure Values, Film Types and Dynamic Range. It's got very very good Continuous shooting modes. There are also two Function buttons that you can customize for features you use a lot (we turned off the Focus Check for now and replaced it with AF).Oh, and the Sensor is bigger than every other camera I was comparing it to at 2/3\". Most are half that size.I feel like I'm rambling so here are a couple of quick comparisons. Keep in the mind our primary concern was good image quality, the ability to learn how to really use a camera and some fun factor in shooting. All of these cameras seemed to take pretty good pictures. None were outstandingly bad, IMO.**********************vs. Canon SX50HSPros: Larger Sensor than the Canon. More rugged feel, better feel in the hand. Less gimmicky stickers. Nicer colors, IMO (subjective). The Fuji has a manual zoom lens. Much more fun and I prefer it to zooming with the rocker switch. EVF on the Canon kinda sucks. The Fuji feels like a higher end camera than the Canon (maybe Canon was pulling a Nikonism?)Cons: The Canon has a longer zoom - might be nice to have. Costs a little less. The screen is more 'agile' on the Canon. We have a Canon printer and have had good luck with our Canons in the past. They make a nice camera and I trust their products.vs. Panasonic FZ200Pros: Larger sensor on the X-S1. X-S1 is less expensive. Manual Zoom on the Fuji is preferable (to us). In my research the Image Quality of the Fuji was slightly better. DXO reports the X-S1 having better low light performance even though the FZ200 has that nice Leica F2.8 lens.Cons: The Leica Lens on the Panasonic is nice. It's got a really nice build quality. Not quite as nice as the Fuji (to me) but still nice and much better than the Canon or Nikons (plasticky). Nice software on the FZ200.Tough choice on this one. The FZ200 is a really nice camera and was a contender, but I couldn't justify spending over a hundred dollars more for it. I considered the FZ150 but there aren't any new ones available and the FZ150 doesn't have the fast F2.8 lens that drew me to the FZ200vs. Nikon P520Pros: Larger sensor (again) on the X-S1. The Fuji X-S1 just feels like an all around better camera than this one. The fit, finish and feel in the hand is tenfold better on the Fuji. The EVF on the Fuji is 1.4 million pixels vs. the 200k in the Nikon. This one just 'feels cheaper'. Manual Zoom on the X-S1.Cons: The Nikon has a better LCD at 921k dots. A higher MP sensor (but crammed on a tiny 1/2.3 sensor) and a longer zoom at 42x. The Nikon also has newer features like GPS, Wifi and 3D shooting. These features aren't that important to me, but they might be to you.vs. Fujifilm HS50EXRPros: The X-S1 has a larger sensor. But even this sensor is 1/2\" so larger than the others. Fit and Finish is a little better on the X-S1 but the HS50 is a nice camera. It's got a good lineage with the HS-10/20/30 series preceding it. The layout of the buttons on the back of the X-S1 are better. Worth giving up the rotating LCD screen, I think.Cons:  Not many. In some regards the HS50 is a better camera. It's got a longer zoom - 42x, but it seems like shooting anything over 30x gets shaky - with any camera and you really need to think about limiting that usage to a tripod for good shots. More MP on the HS50, and it has a larger sensor than the other bridge cameras so it's a little more sensible to cram them on there.vs. Leica V-Lux 4Costs a lot, lot more. More than twice as much. Didn't really consider it.So, there's the thought process I used. Overall I think a person would probably be happy with any of the cameras above. You can probably find people (Pro Photographers and the like) comparing all of them to DSLRs and knocking them all in any of the reviews you read. I'm not sure why people keep comparing them that way. So, I tried to compare the X-S1 to other Bridge cameras in its class. Seems to make more sense.Some of our favorite features of the X-S1 so far:1. EVF, and the proximity sensor that automatically turns it on when you look through it.2. 49 Point Area focus3. Fit, finish and build quality. Makes you happy to hold it, smell it, look at it... :)4. 1CM Super Macro Focus5. EXR mode - so if you don't want to mess with P,A,S,M settings it does a really good job of figuring out the scene6. Really good continuous shooting/bracketing options7. Last but not least, excellent image quality. Wonderful, vivid colors. We took a trip to the Zoo this weekend and took over 700 pictures. Photography with a good camera is addicting! :)This is a fantastic camera for my wife and I to learn the art and science of photography and make pictures of our lives. I hope whichever camera you get brings you as much fun and joy to use (and look at pictures from) as this has for us.", "Date": "December 30, 2013"}, {"Title": "The Fujifilm X-S1 - A Superb, Well-Constructed Super-Zoom Digital Camera Which Offers Excellent Performance", "Author": "Lawrence H. Bulk \"Lawrence H. Bulk\"", "ReviewID": "R1BBMJQIN684U", "Overall": "5.0", "Content": "---> June 5, 2014: I want to mention that in the months I have owned it, this Fujifilm X-S1 has become my \"go-to\" camera. While under certain circumstances, such as very low-light situations, my Canon PowerShot G1 X can produce somewhat better photographs (lower noise), the much better versatility and ease of use that this Fujifilm offers (along with the fact that no one need apologize for the quality of its photos) make it my preferred camera. On our recent vacation it was the only still camera I took along and I am very pleased with the photos I took. The Fujifilm X-S1 is the best digital camera I have ever owned.My original review follows:This Fujifilm X-S1 12MP EXR CMOS Digital Camera with Fuijinon F2.8 to F5.6 Telephoto Lens and Ultra-Smooth 26x Manual Zoom (24-624mm) is a superb performer. It is my first advanced super-zoom camera, something I have wanted for a long time.Yes, it's heavy. Yes, it's complex. Yes, it requires an effort to learn to use it.But having owned several previous digital cameras (including a Canon PowerShot G1 X 14.3 MP CMOS Digital Camera), I found it to be quite easy to use even before I read the manual. While its menu options are many, they are relatively straightforward to configure to your taste. If you too are experienced with sophisticated digital cameras, I am sure you will find this one quite easy to master.And, believe it or not, in addition to the PDF owner's manual, Fujifilm supplies a PRINTED owner's manual! Reading this, which I did yesterday, will answer the overwhelming majority of your questions about the camera and its use. (You can download the PDF from Fujifilm's site if you wish to read it before purchasing the camera so as to see if it is suitable for you.) Of course one reading is not sufficient; I'll be spending the next few days re-reading the manual, this time with camera in hand, so I can learn the various ins-and-outs of it. (Frankly, this will be necessary for every purchaser. If you do not wish to make this effort, then I recommend that you do not buy this model, opting instead for something simpler.) I am truly looking forward to learning the capability of this camera and enjoying the pictures I am able to take with it.This camera has many individual buttons and knobs which means that changing settings via the menu is only rarely necessary. It features a manual zoom as well as a manual focus option (along with, of course, many varied auto-focus options) and also full manual aperture and shutter controls.Its sensor is 2/3-inch. This is not as large as the 1.5-inch sensor in my G1 X - but imagine the size (and weight - not even to mention the price) of the lens (26x zoom ratio) which would be necessary to accommodate that size sensor. A 2/3-inch sensor is large enough to create good pictures with minimal noise (in most cases the noise will not be visible) at ISOs from 100 to, say, 400. That range is plenty for most outdoor and many indoor shots.Even though it has a very good image stabilization [IS] circuit (it's turned on by default; you'll find its options on Page 4 of 6 in the Set-Up section of the Menu and please read below), I would not use this camera under extremely low light levels without some sort of additional lighting or, if absolutely necessary to take a picture under low light without flash, I recommend the use of a tripod and a longer exposure time - tell your subjects to be absolutely still. (Please see the paragraph below.) (In any case, you'll want to use a tripod at longer zoom settings.) The 2/3-inch sensor is larger than in some other Fujifilm Super-zoom cameras and note that a larger sensor produces less image noise (all else being equal) at higher ISO settings. However a 2/3-inch sensor is still a small one so you must keep in mind its limitations (there is no getting around the laws of physics).Its nominal ISO range is from 100 to 12,800 - but note that ISOs over 3200 are available only with reduced image file size (less than the usual 12 MP). While I have had my camera for only two days, and have not been able to put it through all the 'hoops,' I should think that, for all practical purposes, ISO 1600 would be the absolute maximum that I should ever want to use (and even that only in an 'emergency') and I shall probably restrict my use to the aforementioned ISO 100-400. This will, of necessity, restrict its use in low light situations in which you cannot or do not want to use flash; as I mentioned above, for these kind of pictures, you'll want to use a tripod and a longer exposure time. At least for me, this is no real inconvenience.But, all that aside, I have found three (ONLY three!) VERY minor points about which I have 'druthers':(1) I wish the lens stopped down to f/16. It does not; its minimum aperture is f/11. But that is something I can live with. (The Panasonic FZ200, for example, stops down to only f/8. That's an absolute deal-breaker for me even though I like its constant f/2.8 maximum across the board aperture.)(2) I wish there were some means of quickly changing the Image Stabilization settings. There are several settings, all of them useful (including 'Off'), but to change them the user must go deep into the menu. Fortunately, at least for me, I do not need to change the settings very often. (I generally leave it off or, when I want to use it, in Shooting + Motion [that uses less battery power than Continuous].)(3) I wish there were some sort of cover for the LCD screen. As it is, it will ALWAYS get smeared. I have ordered one of the screen protectors from Amazon but even that is just a partial remedy. (Does anyone make a snap-on plastic cover for the screen?)But the screen itself and its tilting mount is a model of good design. I would not buy a camera which did not have some sort of adjustable-position LCD screen and this one is one of the best I have seen. I especially like the automatic switching between the screen and the excellent electronic viewfinder when you place you eye up to it. (You can also set your LCD screen/Electronic viewfinder preferences manually.)I should mention something interesting about the lens - it has filter threads engraved in it (this is my first compact digital camera which has that feature though I know that there are some others). It takes 62mm filters directly WITHOUT the necessity of putting on a filter adapter first. I wish ALL cameras had this feature. I have ordered a Skylight filter; I always keep one of these mounted on my cameras to protect the lens. Replacing a damaged filter is cheap; replacing a damaged lens is horribly expensive if it is even possible at all. I have also ordered a few additional filters (star, polarizer, etc.) which I like to employ from time to time.Some reviewers have stated that it takes a relatively long time to 'boot up' - not my camera (with a 33Axxxxx serial number, ordered from Amazon on November 14, 2013 and received the next day - thank you Amazon!). Mine is ready to take a picture in LESS than two seconds (I clocked it).The few pictures I have taken with it so far (both manually and automatically) have all turned out fine, as would be expected. When I have truly learned how to operate this camera to maximum advantage, I am sure that my pictures will turn out even better.Of course there is no \"one-camera\" which is the best at everything. That's why many people, including myself, have more than one. But this particular model offers lots of picture-taking and operating options, splendid construction (metal), specifications and settings options too numerous to mention here but excellent-to-superb in almost every regard, excellent ergonomics, and a wonderful lens, all of which equal a superb camera. Plus, at its current price here on Amazon, it is, in my opinion, a true bargain. Furthermore, again in my opinion, it could easily be someone's only camera.Please remember that, as I stated above, you should READ THE OWNER'S MANUAL. It will contain the answers to the overwhelming majority of your questions about the camera and its use.I really like this Fujifilm camera and I think that you will too. I highly recommend it.And I thank you for reading this review. I hope that the information and opinions I have written have been of some help to you.Lawrence H. Bulk===============================================================================================================================================Update: November 19, 2013Do you enjoy taking black-and-white photos as I do? Most digital cameras, in my experience, offer a sepia as well as a black-and-white setting. But the Fujifilm X-S1 has a monochrome feature I have not seen before: the usual sepia setting of course but also FOUR (4) black-and-white settings. The first is the regular b&w; setting found on all cameras but the other three have color filter simulations: a red filter, a green filter, and a yellow filter.And they work!For those unfamiliar with the use of color filters in conjunction with black-and-white film here is a quick \"short course:\"The red filter passes red but blocks blue. Thus the sky will appear very dark and clouds will stand out in sharp relief. (But you do not want to use this filter if you have people in the picture and they are close to you. Their skin tones will be unnatural-looking.) Foliage is also darkened.Green allows foliage to be highlighted as it passes the green color; it is excellent for landscapes and seascapes. And yellow is a balance between the two other color filters and is suitable for taking pictures with people in it.You ought to see the test picture I took yesterday which included the sky which had lots of fluffy clouds. I used the b&w; red filter setting. The photo came out beautifully with deep gray sky and sharp white clouds. I was planning to order 62mm color filters (none of my previous cameras had this size filter) but now it is unnecessary. When my circular polarizer filter arrives I am planning to use that in conjunction with the color filter equivalents in the camera. Landscape and seascape pictures should be as stunning as they were back in the film days using Kodak Plus-X and occasionally Tri-X when using color filters (at least I hope they turn out that way). (A polarizer is very useful in outdoor color photography: it can make the sky appear a deep blue with white clouds highlighted and it doesn't affect any other aspect of the picture.)I had occasion to speak with someone at Fujifilm yesterday (on another subject) and I mentioned this feature. The representative stated that this was the first Fujifilm camera to have these color filter equivalents incorporated. I assume that many future Fujifilm cameras will also have them.I do not know if other brands also have these built-in filters but if you like b&w; photography, even just on rare occasions, this feature is amazing and well-worth having.I do not like to use \"post-processing\" to achieve effects, much preferring to create my pictures \"in-camera.\" In my opinion (my opinion only), much post-processing introduces artificial looks which can almost always be seen. This camera allows varied effects in b&w; which had formerly been available to me only with the use of physical color filters. This is much more convenient.I would like to have a Leica M Monochrome (Black & White Photos ONLY) but I'll have to wait until I win the lottery really, really big before I can buy one. (I believe, though I do not know for sure, that this Leica would require the use of physical color filters for b&w; effects.) Until that time, this new Fujifilm X-S1 12MP EXR CMOS Digital Camera with Fuijinon F2.8 to F5.6 Telephoto Lens and Ultra-Smooth 26x Manual Zoom (24-624mm) will MORE than suffice!===============================================================================================================================================Update: December 22, 2013I have bought a few accessories; I personally regard them as essential (but of course that's an individual choice). Fortunately they are all relatively low-priced (and are all available here on Amazon).1. SanDisk Extreme 16 GB SDHC Class 10 UHS-1 Flash Memory Card 45MB/s SDSDX-016G-AFFP (two of these)2. STK's Fuji NP-95 Battery - 2000 mAH for Fujifilm Finepix X100S, X100, F30, X-S1, F31fd, Real 3D W1, NP-95, BC-65 (two of these)3. STK's Fuji NP-95 Battery Charger - for Fujifilm Finepix X100S, X100, F30, X-S1, F31fd, Real 3D W1, NP-95, BC-65 (two of these)4. Hoya 62mm (HMC UV / Circular Polarizer / ND8) 3 Digital Filter Set with Pouch5. Hoya 62mm Star 6 Filter6. Hot Shoe Cap Cover for Panasonic , Nikon , Fuji & Canon Digital SLR Cameras7. 6 x MEXXPROTECT Ultra-Clear Screen Protector for FujiFilm FinePix X-S1, 6 Protective Films, 100% fits, Display Protection Filmand finally8. Navitech Camera Bag Case/ Cover/ Sleeve For The Fuji film X-S1, Fuji film FinePix HS30EXR, Fuji film FinePix HS25EXR, Panasonic Lumix G DMC-GH3, Panasonic Lumix G DMC-GH2, Panasonic Lumix DMC-FZ200 (perfect for this camera).All of these accessories, ordered between November 15 and December 9, 2013, have arrived. All are of excellent quality and will greatly enhance the usefulness/protection of this camera. I highly recommend all of them to you in conjunction with this Fujifilm X-S1 digital camera.", "Date": "November 17, 2013"}, {"Title": "Fuji has done it again", "Author": "Bill G", "ReviewID": "R1WM7QBIRG4P2G", "Overall": "5.0", "Content": "My first digital camera was a simple 3x zoom, 2 megapixel Fuji point and shoot.  Since that time I have had 3 or 4 more Fuji digital cameras that I have used for both personal travel photography and business.  The latest was the S100 that traveled all over the world with me.  I also used the camera for my forensic engineering work.  The flip up screen on the back was perfect for getting really close without having to get down on my hands and knees, and I made extensive use of the audio notes.  After 200,000 shots it was beginning to have a few problems.  The eye piece was scratched and the rubber on the grip was coming loose (probably due to the 120+ degree heat in the middle of the Egyptian desert), and the auto focus didn't always work as well as it once did.I have had the new X-S1 for just over a month now and couldn't be more pleased.  I am still learning some of the buttons and functions, but overall the camera is fantastic.  The zoom is much more than my S100 (26x versus 14x) and the new in-lens mechanical stabilization puts the camera in a class normally reserved for much more expensive units.  The manual focus actually works and is easy to use.  The size and brightness of the screen on the back is great as well, even though I prefer to use the eye piece.  The level line and panoramic photo features are also great additions.  The new sensor has allowed me to take excellent quality shots using much higher Iso settings than any of my previous cameras.  The only thing I miss about my old camera is the depth of the grip.  The grip on the new camera is sufficient, but a bit shallow for a larger hand.  Some of the reviews I have read complain about the price, but I think the camera is a steal.  My hat is off to Fuji as this camera will do anything a much more expensive DSLR will do without the potential of internal contamination inherently caused by changing the lens.", "Date": "May 8, 2012"}, {"Title": "Overall better than my S100fs...", "Author": "kandoro", "ReviewID": "R3PYY1OF0VEZY9", "Overall": "5.0", "Content": "From the initial reports I didn't think I would be saying that.The statements below are based on .jpg only as RAW processing for the X-S1 and most EXR sensored cams is still pretty iffy IMHO.  Granted both cameras would benefit from RAW but I just don't feel Adobe or even Silkypix have address the EXR RAW conversion well enough to properly compare to the non EXR CCD sensor of the S100fs.  So I feel the straight out of the cam .jpgs offer the most valid test at this time. Even more to the point is I don't have LR4 as I'm still existing just fine with Windows XP of which can't run LR4.  And LR3 doesn't support the X-S1 RAF files so .jpegs it is for now.I finally decided to try the X-S1 and the only area where the S100fs betters the X-S1 is in pure visible resolution at ISO 100-200.  If the S100fs rated a 10 for IQ at ISO 100-200 the X-S1 would rate a 9.  However, above ISO 200 and the superior noise reduction of the X-S1 counters the extra resolution of the S100fs.  The X-S1 also has a huge advantage in dynamic range and at ISO 400+.  Even at DR100 which is base for both cameras the X-S1 has much better shadow visability and less highlight clipping as well.  The auto focus is faster on the X-S1 but not necessarily more accurate.  Even though they both have numerous external buttons I prefer the overall ergonomic layout of the X-S1. Don't get me wrong as I love my S100fs but lets face it, it is 4 year old technology.  There is no doubt the optics on the S100fs are better and probably the IS as well.  But the X-S1 excels is so many other areas its the overall winner to me.  The obvious winning area of the X-S1 is the 1.4mp--.44 diameter EVF versus the 200K--.20 diameter EVF of the S100fs.  Its like comparing a 19\" color TV of the 1970's to a 50\" Plasma today.  The metal lens tube, the rubberized body and the 26x zoom versus the 14x of the S100fs all contribute to the X-S1 being the winner as well.But if you are only concerned about acuity and native resolution at base ISO and nothing else, then the S100fs is still the king.UPDATE...2-7-14After using my X-S1 with a 23A serial number for the last 18 months I decided to try one of newer 33A serial numbers at the ridiculously low $349.  I feel the newer 33A has no lens droop or run out, the focus seems faster and the lens somewhat sharper.  As with all zoom lenses they loosen up so we'll see how the drop and run out are affected.  Obviously Fujifilm had made even more improvements over and above the lens/sensor swap of the 23A models.  At least it sure looks that way to me.  For the current $349 the X-S1 is an absolute steal.kd", "Date": "August 13, 2012"}, {"Title": "Wonderful Bridge/Super Zoom Camera", "Author": "Elisa 20", "ReviewID": "R2P0DF69SP5T3O", "Overall": "5.0", "Content": "If you're looking for an camera that's a so-called \"bridge\" (between \"point and shoot\" and DSLR) or one that is a \"super zoom\" (meaning \"with an over-200mm zoom\"), I hope you'll think about the Fuji X-S1. I looked at all of the cameras in this category, and I really love it.  When the current supply is gone, they aren't making any more, and it seems there won't ever be an X-S2.It was by accident that I read about this camera--which originally sold for $700-$800--but due to no longer being in Fuji's current line-up, the new ones still around have been severely discounted--to around $350. Now that I've used it, I would have paid $700 for it. I think its current price is an incredibly bargain. This is a -great- camera.A few things to notice about the camera body and lens:* Battery. (Per another reviewer, who thought it was broken.) It can be inserted two ways--one works, the other doesn't. If the camera doesn't turn on, flip the battery and re-insert it.* Zoom -- Fuji's are the only bridge cameras with manual zoom (24mm-624mm equivalent). So smooth and precise, just beautiful to use.* Design. It looks like a DSLR but has a fixed zoom lens that goes from wide (24mm) to telephoto (624mm) and also gets beautiful macro and good video. It's heavy--well built with metal controls and (included) hood, and a beautiful rubberized finish to the body. Yes, it's heavy but not \"dslr+lens\" heavy.  (A \"real\" 624mm dslr lens is over a foot long!)You get a LOT in a small, relatively light-weight package.* the EVF (viewfinder) is beautiful--larger and clearer than on any other bridge camera. There is also a diopter knob to the left of it; if you wear glasses, you can adjust it for your vision.* Hot shoe. Of course it also has its own flash. Also some good low light settings in \"Advanced-Pro Light\" or \"EXR Low Light (SN)\" I was surprised how well it does in low light.* External mic jack.  This was so important to me (I use a Rode microphone with it). Otherwise, you hear the sound of the camera in your audio.* LCD Monitor/EVF-viewfinder.  It has a tilt screen which I actually like better than the fully articulated one on my previous camera (Canon SX50). The memory card loads on the side and the battery can come out without taking off the tripod plate. (I use a card reader instead of transferring from the camera). One bonus: the EVF has a sensor so it automatically changes from LCD to EVF when you put your eye up to the viewfinder. Also, you can customize the information displayed on screen--cycle through four different options, including \"no information\"--and even have a different display in the EVF and LCD.* Custom Settings. Use them! Once you get used to the camera, it's so easy (just put whatever you want, find \"Custom 1\" and push \"Okay\"). I like to use them for Macro, and Black and Whites, and some of the bracketing features. Many possibilities here, depending on the subjects you photograph most often. :)* Manual and a Recommended Book. It comes with a hard copy manual (Yay!). There's no book for this camera, but I recommend the book for the X10 since it has the same 2/3\" sensor (that's another great feature, since all the other bridge cameras use a 1/2\" sensor. Sensor size is so much more important than # of pixels). This is the book:Photographer's Guide to the Fujifilm X10SETTINGS, Some Ideas:If you're starting out totally overwhelmed by all the settings, I'd say put it in \"P\" or even EXR AUTO (not regular AUTO) and just start taking pictures. It works really well--beautiful, well exposed images. If you want to experiment with settings, here are ones I like. (I turn off the picture \"Preview\" completely, btw.)IMPORTANT: Remember to push the shutter half way down and wait to hear the \"beep\" that tells you it's in focus. Then you can either recompose (while still holding it half way) or complete pressing it all the way to take the shot.MY FAVORITE SETTING:Shutter ModeSize: M not L (not much difference and you can use DR bracketing in M and not in L)AF-C (it's set on the lever on the front of the camera, to the left side of lens if you're looking from the back)Button on top right lets you choose to bracket pictures. Experiment with film simulation, exposure (+/- 1/3), burst of shots, etc. I like DR bracketing (see below)DR: bracket so you get DR100, DR200, DR400 and can choose. If you want to set it, I'd use DR200 not AUTO DR.Film sim:  Provia  (the default). Velvia's usually too bright, imo. Astia's nice, tooISO:  AUTO (400).  AUTO (800) is okay, too. The camera will try to take pictures at ISO 100 but if that isn't possible this caps the ISO and you can use the ISO control button (left side of the camera, back) to adjust it more.Metering (left side button). So important. I like Spot, if you have the knack and time. Otherwise, I like to use Average.  \"Multi/Pattern\" metering, for me, seems overexposed.AND ... FOR FUN....\"Panoramas\" are fun (in ADV mode). To get other choices than 360 degrees, push the bottom button of the control dial.\"Pro Light\" (in ADV mode) takes four photos and combines them in low light.SP (Scene mode) for Sunsets, Fireworks, etc.JPEG/RAW - I shoot JPEGS only, but you can also do RAW only (the camera will convert it for you) or JPEG/RAW at the same time. Button on bottom right back lets you skip the menu for this.CD: Fuji also includes a software CD for processing RAW images in \"Silkypix\". The camera also not only displays RAW for you, but can also convert it.Memory Card recommendation:  Your shots will go faster with a faster memory card (I have Level 10. Works great).Filter: People are divided about whether to cover a lens with a filter for protection or not. I always protect mine, but for digital cameras you don't need a UV filter so I use clear glass which is less likely to cause distortion. I've had excellent results with Marumi 62mm filter--and I get the \"slim\" one because there is no vignetting, even at 24mm. Marumi 62mm 62 DHG MC Lens Protect Slim Filter JapanI really enjoy this camera tremendously. To think you can have the equivalent of wide angle 24mm and a long zoom of 624mm--with everything in between--in this compact camera body, without carrying around all those lenses and heavy equipment is, for me, completely amazing. This is a camera you'll want to carry on a shoulder strap (it comes with one), it won't fit in a pouch around your waist or in a pocket.If that doesn't bother you, I encourage you to check it out. I looked at so many others, and for me, none comes close to this one. So versatile and gives excellent results. It can be simple (EXR AUTO or P) or as complex as you want. (Great camera for a photographer to grow with!) After months of deliberation, I couldn't be happier!", "Date": "March 1, 2014"}, {"Title": "I love it! I love it! I love it!", "Author": "TR", "ReviewID": "R1T36876LSLSXZ", "Overall": "5.0", "Content": "This is a great camera! I have owned this now for about two weeks, and I have tried most of the settings. Each setting works, and there are enough settings to challenge a take charge kind of a photographer as well as a let the camera take control type of photographer. Before I elaborate, let me state that the IQ is startling! The colors are gorgeous. The resolution (though not stellar) is of professional quality, easily good enough for pleasing and satisfying large prints (at least to 16 x 20, which I know because my last camera was the once renown and now forgotten Canon 10D, a camera from which I have many 16 x 20's on my walls--and the Fuji bests it in color, saturation, and the fun factor--nailing the shot and bringing a smug smile when viewing later).First, low light. This camera does great in Low Light. I took this camera out the other day and shot some very nice 100 ISO shots at the local war memorial lake and water fountain. 4-6 second shots are clean and breathtaking. I did those using M mode and my light meter. Using Night/Tripod mode (defaults to 200 ISO) yielded some excellent shots too. The EXR Low Noise High ISO mode proved the third best, and lived up to its name. The Night mode boosted the ISO to 1600, and the image quality deteriorated accordingly.As an FYI, the built in ADV. Pro Low Light @ 3200 ISO gives sharper, much more noise free, and brighter shots than PASM shots at 1600 ISO. Not enough of that is brought out in reviews. Thus, hand held shots are easily attainable in that mode in very low light that will amaze you at how bright, sharp, and noiseless they look at 100%. The trade off is a reduction to 6mp, but having the 10D for as long as I have, I know that 6mp in well formatted shots print large and look great in DVD slideshows at full HD. That's all I care about!In good light the camera also excels. To begin, the macro mode is stunning! Either using regular macro with zoom or super macro within an inch of the subject wide open, I have brought home shots of bees sipping nectar in which you could count the hairs on their legs! Landscape shots in Velvia or Astia are to die for. Trees look real and not like water colors on canvas.The bokeh is breathtaking. True to Japanese form, this Fuji pro X camera with its 9 ringed aperture yields bokeh that causes one to break out into song! I tweak the camera to +1 sharpening AND +1 noise reduction; this sharpens while creating a smooth as glass bokeh (and with good lighting, twinkling ringlets in the background). Ahh! That's what great photography is about, ogling over creamy and twinkling bokeh! Oh, I have used the Pro Focus mode, and  though I do like the Gaussian effect, the camera can do \"real\" bokeh (obviously vastly superior) when properly set up rather easily (though not as easily as a prime on a DSLR--but not as hard as one might expect either). Oh, I forgot to mention earlier that there are no \"orbs\" on my camera bought from Amazon about the first part of April 2014. My serial is 33.... night lights twinkle accordingly.Panarama mode works like magic, literally. How the heck do they do that? I stare sometimes, and I can only find the seems when I have jerked the camera while panning.The scene modes work great too. The Portrait enhancer does a great job of smoothing the skin without making the subject look fake or adulterated. The Dog mode is a favorite of mine, as I hike a lot with my dog and it tracks her expertly. It also is sharpened a hair and tweaked to make the fur look lifelike and not like a water painting like seen in many reviews of other cameras. Natural Light + Flash is a very useful tool giving the photographer a flash and non flash low light photo with one click of the shutter. Speaking of Flash, this is the first camera that I have used that consistently does NOT promote red eye in flash shots. They just don't exist, in humans nor pets! I don't use Landscape much as it vignettes the corners--I one of the three Custom settings with Astia film mode for Landscapes. I also don't use Flower mode as I have a Custom set up for that too. That saves me from digging into the SP and scrolling only to miss key shots. I use it only for Dog mode and Portrait and Portrait Enhanced; the camera excels in those modes. It doesn't snow here in Los Angeles so Snow mode is out! But, I am planning a beach trip this summer, and I shall try the Beach mode (I guess it increases the already spectacular DR to avoid clipped highlights from the crisp air, shiny sand, and frothy ocean.) I already mentioned Night/Tripod mode earlier, and it too works perfectly for low ISO night shots.The camera is solid, built like a tank, easy to use, and has a great viewfinder (that makes my 10D mirror and larger sensor look dim). The zoom is sharp on my camera up to 500mm in near and medium range objects. Shooting far away in the SoCal haze causes distortions. So, I don't think it's the camera nor lens but the environment that limits far away high zoom shots. The Optical Stabilizer is a charm, allowing not only 500 mm shots (with a steady hand) but also low light shots on steady subjects down to about 1/15 or so of a second. I have done many 1/8 using Pro Low Light to my stunning surprise: not just in that the results aren't blurry but the quality and low noise of the final frame!OK, now for a few downers. It is true that at full zoom, the camera at times (25-40 percent) will fail and cause the photographer to find a contrastier spot and pan back to shoot. For 95 percent of the time, shooting, even in low light, using less than full zoom, the camera focuses fast with only a few misses (that are obvious when seen on the computer as to why the camera chose what it chose). Yet, the camera does have a movable focus points, and a focus checker in manual focus mode that greatly aids in getting proper focus in difficult or creative situations. Also, though I find the resolution sufficient, the default sharpening is too low and accentuates what is not a problem if set at +1. Don't forget to boost the NR one notch too. You don't lose details, but you do create a much smoother background. +1 sharp and -1 NR dries out the image and brings noise into the shadows and bokeh. That's just me; but to those who have this camera, try it and see if you find the same. I find that the default is good for EXR modes and low light shots.I still feel that I am just getting to know this camera, and it’s worth repeating that the colors are gorgeous. The images zing without looking fake or doctored. I like the colors much better than my 10D, which has subdued and understated color saturation. Maybe the long list of successors have changed the color scheme, but I don’t miss it with the quality colors I get from the Fuji. I also don’t miss swapping lenses and worrying about dust. I also love the feel of this Fuji; I think my framing and high zoom/low light success is not just because of the IS system; the camera is just so perfectly balanced. Lastly, I just love the low cost Amazon is providing right now. I did lots of research and hoped for the best, but I am now blown away. This camera is worth the original asking price, and at the current Amazon asking price, it’s a steal. I can see myself using this as a solid companion piece of engineering for years. But I only buy what I personally need; I don’t chase the latest just because. I buy with an eye for my current and future needs, and not being a Sports Illustrated photo editor; this camera is like manna from heaven with the expansive and dead-on accurate feature set, superb IQ, and bargain basement price.For all the reasons I have listed above, I have fallen in love with this camera. Buy one, and I guarantee you will too!", "Date": "April 21, 2014"}, {"Title": "Dee Awesome Camera", "Author": "w d pinckard", "ReviewID": "ROPPP5LR7S391", "Overall": "5.0", "Content": "This is one awesome camera. I'm and expert photographer. 35 years experienceFocus great, fast, exr great and special mode great night shots. This is the perfect camera for 98% of the people. A few people said that at 600mm the pictures are not sharp. My question is what are they compairing it to. I compared to DSLR with 450mm and at 450 mm on each the x-s1 was sharper. My friend alan shoot a F4 600mm canon cost over $7500.00, if they are comparing X-s1 camera to that lens yes the f4 600mm canon get real. I did a lot of shots at 600mm they are pretty good. to get them great you have to use a tripod just like the $7500.  lens. Bottom line this is a great camera.", "Date": "December 29, 2013"}, {"Title": "Can beat any SLR in the price range by a huge margin.", "Author": "Karen Jefferies", "ReviewID": "R1EJ0PTTXUSZWZ", "Overall": "5.0", "Content": "I have taken over 7000 pictures with this camera.  It is very tough and has a very nice grip.  It is layered with textured rubber which make it very durable.  I really like the manual focus ring and manual zoom.  It does very well in low light.  It is a very large camera so people that want a small camera would not like it.  I find no problem with the weight or the size.  It will accept lens filters, mic input, and hot shoe.  It also can take UHS-I memory cards which is a nice feature.  I use Lexar Professional 400x which works well.  It will snap pictures right after the other.  The sound quality for movie is very good.I would recommend to anyone wanting lots of zoom in and high quality pictures for a relatively low price.  Also Fujifilms Hs50exr is not as good as this especially in low light.Hope this helps.", "Date": "September 2, 2013"}, {"Title": "This Camera is GREAT", "Author": "Brian Cianfrani", "ReviewID": "R3BCQD3F1OKN73", "Overall": "5.0", "Content": "I am one to read many reviews before making a purchase no matter how little or how big.This Camera is everything the good 5 star reviews say's it is. I am in the business but was looking for an everything camera that would just point and shoot, micro to far, camping to concerts with out changing the lens or having to keep playing with all the settings.Well I finally found it. I will recommend this to my family and friends.UPDATE 2013/  So glad we made this choice for an all around camera. we use it just about everyday and we love it more every time we use it.", "Date": "October 25, 2012"}, {"Title": "One of the the best SuperZoom's on the market.", "Author": "eddiewyatt", "ReviewID": "R2CGZVDSCI7M6U", "Overall": "4.0", "Content": "I've had this camera for 3 weeks and 1200 photos.  So far I'm loving it.  I also own the Sony HX-100V superzoom (highly regarded).  I was looking for better Image Quality and more DSLR type features, along with the ability to go shooting without having to carry a camera bag with multiple lenses.  This camera delivers on all points for me.  I have not seen the Orbs issue or Lens Sag on mine. Great camera, It's no $5000.00 DSLR multiple lens setup but it's pretty good considering the price.  All the online reviews I've read agree that this is one of the best superzoom's on the market today.", "Date": "February 20, 2012"}, {"Title": "Blows away my old SLR", "Author": "Brian D. Vanmason", "ReviewID": "R1W14MAX4NPTG6", "Overall": "5.0", "Content": "I've owned an SLR for the past 14 years and have wanted to \"upgrade\" but without spending a lot of money on a new camera. Digital SLR's are just too expensive, especially when you throw in the lenses that I would have liked to use.The Bridge cameras really caught my attention about 5-6 years ago and Fuji-film has always been at the top of the list.From the first time I saw the X-S1 I fell in love with the looks and the different things it could do.I purchased the camera for a trip to Disney a few weeks ago. I am not a high-tech \"geek\" so I was a little intimated by some of the reviews on this camera. The manual is very user friendly and after spending some time reviewing the basics I took some experimental shots.All the pix came out great. Deleting the photos I did not want, was fast and easy. The zoom range on the X-S1 is absolutely amazing, as mentioned in other reviews the lens alone is worth the price.I must have taken close to 150 pix on the trip to Florida, not to mention 2 short videos. Again reviewing images is simple and easy and the video quality is great.... at least by my standards.I've since taken another 100 or so pix all of which are really clear and sharp.I couldn't be more pleased with this purchase. For the current price on Amazon this is a great value and anyone who wants to capture family memories, or anything in nature will not be disappointed.Needless to say I am very impressed, but keep in mind I've been using the same SLR (canon rebel) for a very long time. Developing film is just too expensive today and this camera just does so much more.", "Date": "April 24, 2014"}, {"Title": "Extremely nice \"bridge\" camera", "Author": "Iacobus", "ReviewID": "RIJ3H3OK84GU5", "Overall": "5.0", "Content": "I wanted to get to know this camera for a few weeks before posting my review. Being an enthusiast and a neophyte to the world of DSLR-style photography, I had a lot on my plate but I think I managed.I did not put this camera's capability of shooting video through its paces as I did not purchase this camera with that in mind.As other reviewers have noted, this is not a straight-up DSLR camera; the camera has a permanent lens that cannot be removed. But it sure operates like one otherwise.My serial number starts with 34A; Fujifilm is pretty much past the issue that seemed to plague early adopters with the light orbs, so don't worry about getting a bum camera.The camera comes with several handy items: A USB cable, a metal \"petal-style\" lens hood, a lens cap, camera strap, lens cap, CD-ROM with software (that you might not need; see below), battery charger and battery (NP-95, if you're considering this camera and want extra batteries). Best of all, it comes with a printed manual (!), explaining in full detail each function of the camera.The camera is somewhat hefty at a little over 2 pounds (with battery and SD card). The camera is very nice to hold with its rubberized-like exterior. The lens has a ribbed rubber grip and is very smooth to protract and retract.Almost every function you would want is located around the camera's rear monitor and the shutter button on the front. There are two function buttons that can be assigned to desired functions (such as image quality and digital zoom). However, I wished I could assign functions such as image stabilization to one of the function buttons since I switch between handheld and tripod use a lot. Otherwise, I have to dig (not too deep) into the camera's menu to turn it on and off.The monitor (and/or electronic viewfinder) can be customized to suit your needs. Want to put a \"rule of thirds\" grid on the monitor? You can do that. The monitor can be pulled out a little but and angled (e.g., 90 degrees facing up).While one could just start shooting pictures right away with the camera at its default \"AUTO\" mode, the power lies in the camera's manual or semi-manual modes. However, I would caution first-time users to get familiar with terminologies such as aperture and shutter speed before diving into these modes. A little work comes with its own set of rewards.The X-S1 can shoot RAW (like other manufacturers, Fujifilm employs its own RAW file format, which is RAF). A RAW image is essentially a digital negative of the image. With it, you can change things such as exposure, color balance, etc. post-shot in the appropriate software, all non-destructively. The X-S1 comes with software on CD-ROM that can work with these files but the biggest bonus is that if you already work with software such as Adobe Photoshop CC, Bridge CC or Lightroom 5, RAF support is built right in (down to being able to use the film simulation modes the X-S1 uses, like Provia or Velvia). Just bring your RAW/RAF files in and get cracking.So you're probably wondering: How is the image quality? For the price I paid ($350 USD plus tax), I would say I got my money's worth and then some. I've uploaded a couple images here (look for username \"Iacobus\" in the customer images). Supposedly, the X-S1 was discontinued, hence the bargain I got but as of this review, the camera is up to $530 USD. Would I pay that much? Probably. I don't know of any \"bridge\" camera of this type that shoots RAW of this quality. There's Fujiflm's own FinePix series but those cameras' sensors are smaller. (1/2\" versus the 2/3\" of the X-S1.)Since the camera's dimensions are big, I would suggest a nice, padded camera bag of some sort or a DSLR holster bag. Do NOT pay attention to the \"frequently bought together\" link and its suggestions. The bag they suggest is too small. You want something like Case Logic's DSLR Camera Holster TBC-406 (and even then, you won't have room for everything; it's just a holster). Also, get a big SD Card; the X-S1 does not come with one. It has internal memory but it's not very big at all, especially if you shoot in RAW.So, in summary: Great camera, even greater if you can get it at the price I paid.UPDATED EDIT (04/16/2014): The X-S1 is back down to $350 USD! An absolute bargain considering features and build quality (the camera is made in Japan).", "Date": "April 13, 2014"}, {"Title": "Fantastic camera...", "Author": "Cushaway", "ReviewID": "R3DWWU74W46RJH", "Overall": "5.0", "Content": "Bought this for my wife so she could get better photos of our 2 young boys while they are growing up.I had researched and read up a lot of several cameras and found this one. The price was basically chopped in 1/2 from the original price since the unit is discontinued, but this thing is amazing.Take the time to read the manual and learn how to properly use it, you will greatly benefit from it. But, with a lot of things we just use the Auto settings and it takes amazing photos...I would HIGHLY recommend this camera to anyone from total beginner wanting a nice camera to the the semi-pro photographer. Obviously you can spend thousands on a camera, but for the price this thing will wipe out about anything else I've seen in the same price range.", "Date": "April 5, 2014"}, {"Title": "Best Bridge Camera at the Best Price!!! Period....", "Author": "Circus Circus \"Ken\"", "ReviewID": "R1F14MCG0UHQHH", "Overall": "5.0", "Content": "This is my 2nd Fujifilm Camera I buy in less than 01 Year. I already own the Fiuji HS30-EXR which I bought from Amazon 10 months ago. I thought the HS30 was the best Bridge I will ever owned but this X-S1 is by far the Best Bridge high Performance Digital camera you can get ok?. This Camera has the largest Sensor (2/3 inch) of its class and comes with Manual Zoom and Manual Focus (Optional) because it has 03 types of Auto Focus which works pretty well. The IQ of this Camera in low light or difficult lighting conditions is unbeatable. You can shoot in RAW or RAW +JPG or just JPG for up to 3200 ISO with excellent results. The many, many settings possibilities set this Bridge Camera apart from its  Competition and at this Price point right now ($349,00) there is no Camera in the market that can beat the X-S1 in any terrain. Also if you are a beginner you have the Special EXR Auto Shooting Mode which lets the Camera shine in any lighting Condition automatically for you. You won't believe the high Quality of the Photos this camera can take when used in that Mode. All the old problems reported on this Camera at the beginning of this Camera (2002) were Fixed completely with these new batch or run of these Camera (New Lens and New Firmware 1.01). Just make sure the Serial Number on the Camera is 32A or 33A or 34A and you will get a perfect performing camera. The battery last very long (I am getting around 300 shots using the LCD intensively). If you use the EVF only you can get up to 400 shots easily. But if you plan to shoot a lot (which I think you will once you Test the camera) please buy a spare battery. I got the non Fuji brand for $9,00 and it is as good as the Original that came with the Camera from Fuji.Do yourself a favor and if you can buy this Camera ASAP. Once it is gone, itis gone. You will not be dissapointed at all. It is a joy to use this Camera with its Silky smooth zoom (barrel), its many Configurations and endless shooting possibilities and its High built Quality and performance. There is none other out  there Like this Bridge camera. I am sure of that.Aaron...", "Date": "March 3, 2014"}, {"Title": "A No-Brainer at $349", "Author": "Richard", "ReviewID": "R1BDXMYO89SSTO", "Overall": "5.0", "Content": "If you go back and read all the reviews concerning this camera upon its release, there were a couple of main concerns: 1) the price was too high at $799 putting the purchaser up in DSLR territory, and 2) the sensor had issues with spectacular highlights.Both of the these issues have been eliminated.  At the current price point , the X-S1 with a new sensor really has no competition if you are looking for a super zoom for versatility and better than average image quality.  No one who buys a bridge camera should expect image quality to compete with DSLR's that have much larger sensors.  This camera produces very good to excellent images in most situations.It's a no-brainer.", "Date": "January 10, 2014"}, {"Title": "Excellent Super zoom Camera", "Author": "Brian", "ReviewID": "R3N8CXSIC744RW", "Overall": "4.0", "Content": "The larger than normal sensor(for super zoom and bridge cameras) pays off nicely in this camera.  The image quality in good to great light is fantastic and the features, performance and build of this camera are excellent.This does give you better high iso / low light performance than your average super zoom camera but will not rival a DSLR.. it's just a matter a physics as the larger sensor in a DSLR will be more sensitive to light and thus produce less noise.  What you will get with this camera is the convenience of a 26x (24-624mm)zoom range without every having to change the lens and worry about getting dust on your sensor.Pros:Great image quality at ISO 400 and belowDecent image quality between ISO 400 and 800 in comparison to other super zoom camerasBuilt like a tank, very solidThere is a button for just about everything and you will rarely have to go into the menu systemVery fast burst rateMany, many bells and whistlesGreat battery lifeManual focus works wellAuto focus is fast in good lightVirtually no shutter lagExcellent viewfinder and LCDCons:Image quality above ISO 800 should only be used for 5x7 prints or viewing on the web in smaller sizesLCD tilts up and down but does not rotateAuto focus on the long end of the zoom in lower light sometimes hunts and is slowThe only reason this does not get a 5 is the occasionally auto focus glitches but I still highly recommend this camera.", "Date": "June 29, 2013"}, {"Title": "This camera is the bomb!", "Author": "MacadamiaMac \"Macadamia Mac Nut\"", "ReviewID": "R3HMIO9N5RU839", "Overall": "5.0", "Content": "Unfortunately at the time I purchased this camera, Amazon's price had mysteriously increased. I've been involved with photography for forty years before the birth of digital. I've used 4x5 view cameras, a 6x7, 35mm Nikons, a Leica 3 and a Olympus 1/2 frame 35mm. My first digital was a Fuji 4900z that impressed me even with its meager pixel count.Since then, I've tried a Canon S3is and a Lumix DMC-ZS19, both adequate but lack a jen sais pas picture quality that the Fuji sensor provides, not unlike the picture quality of the Leica lenses.I acquired the X-S1 about a month ago and am impressed with the build quality, its features and most of all it image quality [\"IQ\"].I recommend the addition of UV and Polarizing filters. Besides enrichening IQ, these add protection to the front element of the excellent lens from dust, fingerprints or scratches. Also, if you hand hold more often than not, an aftermarket leather strap would be a worthwhile substitution as the supplied strap isn't as supple for hand wrapping and tensioning, a tip I learned at photography school and endorse from experience.I look forward to years of enjoyment with the X-S1 and recommend it to anyone with a serious interest in photography.", "Date": "May 3, 2014"}, {"Title": "Excellent attention to detail and usability by Fujifilm.", "Author": "Amazon Customer", "ReviewID": "R2JR29LTXL4RDF", "Overall": "5.0", "Content": "A really, really good super zoom type camera!Fast accurate focus, occasional missed focus, but easy to tell in the great viewfinder, and easy to just shoot again.Lens is sharp and high quality.Zoom and manual focus rings are smooth and easy!A great electronic view finder. Unbelievable at this price point. Large and bright and easy to use with auto switching between the screen( very nice also) and the evf.The lens is amazing, sharp throughout it's 24mm to 624mm range!A nice and sharp macro lens also, with focus up to 1cm away! Really!I have a 33A serial number and it is a perfect version of Fujifilm's intent for this camera.Nice 2/3rds type CMOS sensor, very good higher ISO results in a super zoom class camera!Perfect for outdoors activity and very usable in indoor circumstances also!Best super zoom ever made by Fujifilm and one of the best, period.", "Date": "April 5, 2014"}, {"Title": "Fuji X-S1, A very Good Camera", "Author": "Doug", "ReviewID": "RUSQ4SJ0P7R0V", "Overall": "4.0", "Content": "I have been involved in Photography for over 45 years. Started with Nikon and Minolta 35 mm, Twin Lens reflex and eventually digital. I know a little bit about it. I was looking for a camera that would allow me to experience the DSLR feel and functionality but achieve this with one camera and lens. In my opinion, the Fuji X-S1 comes about as close as you are going to get. I have taken about 100 test shots and overall have been very impressed. I know there have been some reviews complaining about Image sharpness, grain, soft focus and image stabilization but if you know enough about the various aspects of photography you can achieve some very good results. I have tested enlargements to 8x10 with good results. The automatic modes on this camera are very good, giving even the novice an excellent chance of taking very pleasing images. I think one needs to be careful about when to and not to use flash. The Lens on this camera allows one to photograph at very low light levels. Since the flash is manually operated, it may not be used. This may lead to a lot of the problems stated. In my opinion, this camera is not nor was it intended to replace the DSLR. People need to think about that before they complain about issues this camera was not meant to address. I cannot tell you how many people I have encountered with elaborate DSLR cameras that don't have a glue how to use it to its fullest extent. A lot of them simply use them as a point and shoot. In my opinion, the Fujiflim X-S1 is a camera that will produce a lot of very good images for a lot of folks. It will also allow an individual to grow in photography.There is one area that I was not overly pleased with. The camera does not include an AV cable. To me this is an important accessory for transferring images from camera to DVD recorder. I soon learned that Fuji did not make one for this camera. Third party vendors also were of no help.", "Date": "February 3, 2014"}, {"Title": "Love this camera!", "Author": "Firsttimer", "ReviewID": "R1SLLO3GYET7JX", "Overall": "5.0", "Content": "Bought this camera for me, and a compact superzoom for my wife. Wondering if this camera was worth the extra cost. I took several types of pictures with both cameras, so I could compare. I couldn't believe how much better this cameras pictures are. It wasn't even close.  The viewing screen, despite being the same resolution, has a far better picture. The battery lasts way longer. Build quality is amazing compared to the wifes. Can't compare owners manuals, wifes doesn't have one.  I think most of this cameras negative reviews were do its initial problems and price. The price now has come way down and those problems were fixed. So if anyone else was like me and was hesitant to pay a little more on a camera. Give it a try, its an awsome camera.", "Date": "December 4, 2013"}, {"Title": "Awesome Camera", "Author": "Bill D", "ReviewID": "R1YOD8W9O6CONA", "Overall": "5.0", "Content": "This camera is SO impressive.  I had a Fuji S9000 before and loved it, until it dropped off the table and broke the battery compartment.  So, Fuji was the first choice for another one.  The improvements over the S9000 are unbelievable.My friends have DSLR's and spend SO MUCH on lenses.  This camera has a chip almost as good as a DSLR and can take pictures from super macro to very, very long zoom.  The low light handling is incredible, the view  finder and monitor are very bright and clear, the functions are more than I will ever master, but it's still great in full-auto, shutter priority, aperture priority and manual mode.It is everything I could need in a camera.  Just a great bridge camera.", "Date": "December 4, 2013"}, {"Title": "Awesome.", "Author": "phr0zensn0w", "ReviewID": "R3C1DDH1L1XLWF", "Overall": "5.0", "Content": "All of the reviews I have read elsewhere on the net on this were AWESOME!!  Getting it for $345 and change after tax and shipping should be even better!  :)", "Date": "December 3, 2013"}, {"Title": "Lives up to it's specification.", "Author": "bryn1", "ReviewID": "R3E3WRAKG0G6W3", "Overall": "5.0", "Content": "After worrying about adverse customer reviews I finally took the plunge and made my purchase. I have now had the camera since Monday 25th Nov. So far the camera has done everything I have asked of it and to a pleasing standard. Hand held I have taken photographs at the longest extension of boat names which I could not read with the naked eye. Sharp and clear, and even when digitally enlarged still sharp enough to satisfy me.  Indoor shots of people - no flash amazing. Well pleased with all I've tried thus far.My model has SR 33******* .My other camera is a Canon EOS450D ( UK purchase ) in combination with Canon lenses..", "Date": "November 29, 2013"}, {"Title": "Great camera for safari pictures", "Author": "J. Derby", "ReviewID": "R3L8RRONGR4TII", "Overall": "5.0", "Content": "We took the camera with us for a South African safari (Feb 2013) and had excellent results.  This fixed lens high zoom camera is the best way to go.  The picture is taken with little or no lag.  While in an 11 person safari jeep, the pictures taken zoomed in came out clear.  Great in low light, and the built-in flash works well. The camera feels good in the hands.  It has great features.  The price is high compared to its competitors, but it seems worth it.  For a more detailed review, please see [...]", "Date": "March 3, 2013"}, {"Title": "Fantastic camera that fits the bill.", "Author": "Lindsay Bennett", "ReviewID": "R7OHZR591T18U", "Overall": "5.0", "Content": "I bought the camera like many others as I didn't want to cart my DSLR body and lenses around and relished the chance to go from macro to infinity with a twist of the beautifully smooth lens ring.When I originally looked at this camera it had some bad press and its cost, although not exorbitant for what you got, was \"up there' and made me hesitate. When it came on Amazon at $349 I couldn't believe it and bought it straight away. The bonus was that the earlier complaints had been rectified and the true potential of the camera could be realised. No 'droop' (although I think this was grossly exaggerated for sensational self serving reasons) and no \"orbs\" (again exaggerated by operators who didn't come to grips with how this thing operates) and images printed at A3, as good as gold. Serial number begins with 33.I really like the colours produced by the Fuji sensor and with a fast, Class 10 SDHC 1 card it flies. My observations are that RAW is not really necessary as the Large, Fine setting jpegs are great, and files a lot smaller! Video... entirely suitable for my requirements and bit of a bonus really as I mainly shoot stills.The build quality of the camera is superb and matches or exceeds that of my Canon in my estimation. If they ever bring out an x-s2 or similar it would have to be damn good to beat this. Honestly. In comparison the Panasonic FZ200 I tried out, while better in the video department, felt like a toy, too light, too small and plasticky with blown out highlights in the images.Amazon sent the camera quickly and it was well packed. The payment went through smoothly and I'm vey pleased with the way the whole transaction was carried out.All round a very happy customer.", "Date": "January 24, 2014"}, {"Title": "A great \"one size fits all\" camera.", "Author": "binsjohn", "ReviewID": "R3CHGFPZS3U44M", "Overall": "4.0", "Content": "This Fuji is as big and heavy as a DSLR with a medium sized zoom lens. It's saving grace is its excellent image quality all the way from close macro to 624mm (35mm equivalent). I especially like it for wildlife on safari and in national parks. It's sensor is considerably larger than you get with most other super zoom cameras, but still falls short of APS-C. So, in good light it's great and noise only starts to appear when the sun is over the horizon or in darker indoor settings. Fuji has found the perfect compromise for most of my needs.", "Date": "April 22, 2014"}, {"Title": "Made The Correct Decision!", "Author": "Kyuzo", "ReviewID": "R2BG16I9QKKXSU", "Overall": "5.0", "Content": "I no longer relish the hassle of carrying several lenses with my SLR camera. After deciding to purchase a bridge camera, I agonized over the wide variety of cameras available. Finally, I vacillated between the Fujifilm HS35EXR, the Fujifilm HS50EXR, Canon SX40, the Nikon P520 and this camera, the manual zoom Fujifilm XS-1.I have always used film manual focus SLR cameras, and my favorite camera was the Canon EF (the 70's model). That (all metal) camera epitomized ruggedness, versatility and ergonomics. Considering reviews of questionable image quality of the HS cameras, and being put off by the somewhat fragile feel of the Canon and Nikon, I decided to purchase the XS-1. I believe I made the correct decision.After reading stories on photography forums about XS-1s from Amazon, I had worried about receiving a camera which had been opened and returned for whatever reason. I ordered my camera from Amazon.com, so I cannot speak to units sold by their partners. My camera came in a sealed bag, as did the USB cable, the battery and strap. Upon startup, my camera prompted for the initial language, time and menu setups. There were no signs of previous usage. I was ELATED that I didn't have to return the camera.For a person coming from the older SLR cameras, the XS-1 feels nice and substantial. The machined metal knobs, the weight of the camera, and that large piece of glass in the front give the camera an air of quality and durability. The XS-1 doesn't have that \"toy camera\" feel of some of the other point and shoot models. I have read of issues with the XS-1 like the lens drooping at full zoom. I am happy to report that my camera - a 33 serial number- has very little play at full extension. I compared it to the wobble of my well-kept EF manual Canon telephoto at full zoom and the play was similar. There is no perceptible droop. The manual zoom is very smooth and a joy to use. For my own use, I find it much easier to find my desired framing with the manual zoom rather than pulling a button back and forth in order to find the sweet spot. The electronic viewfinder is bright and startlingly clear and offers adjustment for clarity. The back screen is large, clear and details are rendered very well. There are buttons scattered everywhere for quick access to the various functions . I have read complaints that these buttons tend to feel sticky, but on my camera I must honestly say I cannot find a single fault. Every function of the camera seems to work flawlessly. The build of this camera just gives the reassurance of quality.One area of which potential users of this camera ought to be aware is in the XS-1's complexity. While the EXR mode promises to allow the user a point and shoot experience, the myriad of options the camera offers is daunting. Each mode is seemingly customizable by the user. The XS-1 is wonderfully versatile! For the photographer who wants a tool that will grow with the user, you couldn't pick a better bridge camera. The lens will astound the user with its reach and it is faster than my Canon telephoto. I believe it will take me weeks just to get the gist of this camera.I must admit that I haven't yet taken images using all the modes, so I can't speak to the full abilities of the camera. I have used the EXR mode and plan to more thoroughly explore the Auto modes in the days to come. So far, the results I've achieved are stunning! I'm truly surprised at how good are the images made by this camera. I've mostly shot in reasonably bright light, and the camera has been a solid performer. The EXR mode seems to be a good all-round choice for point and shoot (even it can be tweaked to the user's satisfaction!), but for those with an artistic bent there are customizable presets, Auto, aperture and shutter- select modes, full manual and I'm sure some other modes I've yet to find! This camera is a keeper and seems built to serve me for years to come.I was pleased to find that Fuji provided an actual PAPER user's manual with the camera. It may sound like a small detail, but having book in hand provides quick reference when you're in the deep woods and you've forgotten how to delete a picture, what that button does, or how to compensate for exposure in low light. The manual reads like \"War and Peace\", so be prepared to curl up a bit with your new buddy's how-to guide.I've tried to think of areas in which the camera is lacking. Were someone wanting to take it hiking long distances, the XS-1's weight might be a detriment. To me it's heft is not only reassuring, but actually helps steady my aim. I've read that the lens produces soft images at full zoom. Perhaps so, but honestly, I'm just a middle-aged shade tree photographer. At a 624mm equivalent zoom, the image will suffer more from my shaky hands than any lens softness! I'm certain that whatever photos the camera produces will be better than I could achieve with my old Canon. To be truthful, I'm reaching for cons here, folks!The price from Amazon was EXCELLENT and the shipping was QUICK (although in full disclosure I must say the packing of the camera was poor- the XS-1 box was sliding back and forth with negligible padding inside an oversized shipping box).You will need an SD card (I chose a Class 10, but the manual says you can use Class 4 and above) and an extra battery is advisable. The camera comes with a reasonably good strap, the charger, battery, CD ROM with the Fuji software, lens cap, a metal lens hood, and USB cable.I am absolutely delighted with the Fujifilm XS-1! The only way it could make me happier is if it provided its own swimsuit model! ;)", "Date": "March 7, 2014"}, {"Title": "A lot of camera for the money", "Author": "Michael N.", "ReviewID": "RNW1L8JUX1U7Z", "Overall": "4.0", "Content": "I wasn't even looking for a camera to replace my nearly 5 year old Panasonic FZ-18 which I still like.  Somehow I stumbled across the Fujifilm X-S1 (I think it was an email from Amazon).  When I learned it had a large (for a point and shoot) 2/3\" sensor, 26x zoom going from an extra wide 24mm equiv. efl out to 624mm, and was selling for $399, it sure got my attention.  I read all the reviews I could find, here on Amazon, B&H; Photo, and numerous professional reviews (mostly from Great Britain).  Most of the reviews were highly favorable.  The only criticisms I noted were: the size and weight, sometimes faulty autofocus, and lack of image sharpness when viewed at 100%.I agree with most of those criticisms.  It's as big as a lower end DSLR, and feels even heavier than it's listed 33 ounces.  Most of the weight seems to be in the lens, so I had to revert to holding it like an SLR, cradling it in my left hand while steadying it with my right hand.  Having said that, I did consider getting a DSLR (Canon T3i) with a wide range zoom lens (18-250mm).  But that option, besides the much higher price tag, is even heavier, plus it provides less zoom range (and the lens is slower).As for the autofocus, it occasionally misses, but no more often than my Panasonic.  The vast majority of time, it gets it right, and it's instantaneous.  The camera overall is very responsive, much more so than my Panasonic.  It is a pleasure to use.In terms of image quality,  the colors are great, the images are sharp at normal viewing sizes.  At 100%, which is poster size, yes, it does seem to be less sharp than my other cameras.  But if you compared the images of all my cameras at the same size, I bet they would be similarly sharp.  So I'm not really complaining here.  I should add that in terms of image noise, this Fuji blows away the Panasonic.  On that camera, I could see chroma noise at ISO 100 and I was reluctant to go above ISO 200.  On the Fuji, I don't hesitate to go up to ISO 400, and even at ISO 800, the image is very good (just looks grainy at full size).Using the camera is a pleasure.  The EVF is the best I've used (my 3rd camera with one).  As already mentioned, it's very responsive.  I really like having dedicated buttons for most functions, minimizing the need to use the menu.  I prefer a manual zoom to a motorized one, giving me more precise control over framing.  Incidentally, Fuji may have tweaked the zoom mechanism; mine is not all that smooth and it binds slightly at the long end.  On the other hand, it's rock solid with no hint of creep.For $299 ($349 selling price-$50 gift certificate) it's a LOT of camera for the money.  I definitely recommend it.", "Date": "February 10, 2014"}, {"Title": "Bridge Cameras STILL Matter!", "Author": "davonroe \"geoson\"", "ReviewID": "R3IE3D8K629224", "Overall": "5.0", "Content": "Once upon a time, I had a Fuji S9000 as my primary camera.  It was once advertised as a \"DSLR Killer\". Of course it wasn't, but one of my most memorable images was made with that camera.  So I've always had a soft spot for Fuji's bridges.  After the sf100, I felt that Fuji (and others) were trying to do too much with these cameras.  Zooms are inherently a compromise compared to primes, and the longer the zoom, the more the image will suffer.  To get the longer reach, today's superzooms have to use smaller sensors to keep the size down.When the XS1 was announced, I had long moved onto to DSLR's, but I always kept an eye on Fuji, since I figured I would never have a system with that kind of reach.  I loved the idea of the XS1, but I did not like the price, and the infamous orb problem in the early run all but killed the XS.  That's why there has been an HS20, 30, 35, and 50 since the XS1.  It's unfortunate because once you get past the early quality control problems, the XS1 is way ahead of the HS in build quality.  The zoom is buttery smooth compared to the HS series.  I would have liked some of the improvements made for the HS50, but I could not resist the quality of the zoom on the XS1.  You can't go wrong with either one.I'm still getting a feel for the menu and handling, and this rough winter has taken some of my opportunities.  But I have some opportunities scheduled for later this month.  Can't wait!", "Date": "February 5, 2014"}, {"Title": "X-S1 vs HS30", "Author": "NiceNative", "ReviewID": "RKYQ8DG3GFNAC", "Overall": "5.0", "Content": "When I decided to upgrade my HS20 I carefully compared the HS30 with the X-S1. Even though it was bigger and heavier I decided to give the X-S1 a try even though, at the time, the X-S1 was about $200 more. I have never regretted that choice. The much better, larger EVF view finder, the  \"Ultra-Smooth\"  zoom lens and the the larger 2/3-inch 12 MP EXR-CMOS sensor were, in my opinion, the most significant advantages of the X-S1. All the other camera's features are great (I still have many of the features to explore and become familiar with). Now, at a comparable price with the HS30, it's hard for me to imagine why anyone would not buy this model (unless the 0.7 lb and modestly larger size are of primary consideration).", "Date": "December 24, 2013"}, {"Title": "WRONG BAG RECOMMENDED BY AMAZON", "Author": "Owner", "ReviewID": "R1LEUQ51O7KE3Y", "Overall": "5.0", "Content": "I am only writing this review right now, as I JUST opened the camera, for one reason. I am sure the camera is great and will update this as a review for the camera itself soon enough, however BE CAREFUL with AMAZON'S recommendations. The case it told be to buy with it, the case logic compact design, HARDLY if at all fits this camera. BUY a larger bag!", "Date": "December 4, 2013"}, {"Title": "ONE OF THE BEST CAMERAS I HAVE OWNED.", "Author": "RSF", "ReviewID": "R191S19RGY30H3", "Overall": "5.0", "Content": "This camera is probably one of the best I have owned.  I have always enjoyed my Nikons (4) and their lenses but this Fuji with its fixed telephoto lens is outstanding and even though the lens can not be changed it is all I need to do my extreme closeups and wildlife shots.  It has all of the gadgets, settings and versitility that most beginning to professional photographers need.  The price is excellent for the outstanding high quality camera you get.", "Date": "October 10, 2013"}, {"Title": "Great Camera!", "Author": "JT", "ReviewID": "RJRUB7KEWQ7NT", "Overall": "5.0", "Content": "This camera is a real winner. Oh there are those out there bashing this camera for it's high cost, when compared with a mid range true SLR, but feature for feature, and factor in the positive advantages this camera has, and this camera shines.Yes, it is not a true SLR, but that is a good thing, ... No extra lenses to lug around, and no possibility of dust getting into the camera while changing lenses. Been shooting and using SLR cameras for over 40 years, and have lugged my share of extra lenses here and there, ..... Not with this camera. More than enough zoom for about any situation, and always ready to go. Fuji lenses are second to none and by the way, the bashing of this camera regarding lens droop or wobble is nonsense. Yes some X S1s have a little play in the lens when fully zoomed, but that is when purposely grabbed and wiggled, and if the truth be known, a little Lens droop is not uncommon on many makes and models of high quality zoom lenses. Certainly not new with this camera, and has no impact on the image quality.Bottom line, the Fuji X S-1 is an outstanding high quality camera with all the features of a high dollar big name SLR, and none of the disadvantages.", "Date": "August 11, 2013"}, {"Title": "Fuji XS-1 Orb issued used from Amazon", "Author": "Howard E. Tyree \"Htree11\"", "ReviewID": "RXIA7QYWWZ3D6", "Overall": "4.0", "Content": "I purchased thew XS-1 from Amazon.com's Warehouse deal used.  It 's a 14.....Series Serial number.  I say this because when taking a shot of the moon,  well after Amazon's return deadline, all I was able to get was a bright disc and no features.  Fuji repairs says that the camera in this series has orbs issues, specular light, and will not focus on bright subject matters.  I wish that I had known this up front because I could have returned the camera to Amazon who are usually good about these things.  Now it's going to costs me to get it fixed.  Otherwise this is a good camera for all around photography except in low light.  The camera behaves itself on a tripod except shooting bright subject matters.  It is well built like a tank and the flip screen is very useful.Be careful buying used cameras, especially Fuji, from Amazon without finding out which series you are buying.  I will be more careful in the future.  It will cost me a fortune to get it fixed.  Amazon shame, shame, shame.  Now shame on me.Update:7/3/2013The camera was sent to Fuji for repair of the specular light issue and they replaced the lens and maybe the sensor as they don't actually indicate in thier invoice.  Although the camera was out of warranty, due to the age, and the fact that I brought the camera used from Amazon warehouse, Fuji did the repairs for the costs of labor and shipping (under $120 U.S.).  However they had the camera for over one month before I got it back.  This was unusual for Fuji as I have dealt with them before.  The delay was probably due to making a decision as to whether to charge me for the costs of the parts. I will say, though, that I like Fuji, it's products and it's service.  I still use Amazon.com as they are the most trusted internet retailer, IMO.  I will continue to remind you that you must determine the serial number of any Fuji digital camera or any digital camera before you buy it used from the warehouse or anywhere else then check if the serial lot had any problems.  From my experience with Fuji camera's the serial number of their cameras are important and are connected to any problems associated with that particuliar lot of cameras.  By the way my fujifilm XS-1 now works great I was able to take a great photo of the Super Moon the other night and just used it in a wedding to  (learn to operate the controls before attempting this).  I will try to post a photo, if possible.  This a  wonderful, all around camera for the price I paid for it from Amazon's Warehouse deals.", "Date": "May 6, 2013"}, {"Title": "Best Superzoom Bridge Camera", "Author": "Amazon Customer \"sperrier\"", "ReviewID": "R36IMJT9T0XILN", "Overall": "5.0", "Content": "I own Fuji superzoom bridge cameras going back to the 5200; all outstanding.  The X-S1 is the best yet. solid build, well thought-out design and controls, superb images.  No lens droop or white orb problems others have experienced. If you are tired of the DSLR lens-switch Polka (as my girl friend is), this is the crossing point for convenience, quality and price.  Buy one and never look back.", "Date": "December 7, 2012"}, {"Title": "Camera Bag Clarification", "Author": "madhour", "ReviewID": "RGHBTU5Y5625C", "Overall": "5.0", "Content": "I wanted to state that Amazon recommended the wrong bag but I noticed this before buying it.  I ended up buying the following case:  Case Logic SLRC-200 SLR Camera Holster,  This case fits the camera perfect.  The only caveat is if you want to put all the extras in the bag (charger, plug, usb cable, and lens hood), then it's a very tight fit and you need to put everything in a certain way.  But, it will fit.  This is fine for me since I would only put the charge, usb cables, etc in for a vacation.  If you want to put extra stuff in it, then you won't have the room and may need a bigger bag.  But, I love the bag and most of all, I love the camera so far.  I am sure a DSLR is better, but for $329 on a lightening deal, we are pleased as could be and having a ton of fun taking pictures.Hope this helps with the bag selection.  Also, you have to get the memory card.  Otherwise, you can take about 5 to 20 pictures with the native memory.  I bought the Transcend 16GB Class 10 SDHC Flash Memory Card and it works great.", "Date": "December 6, 2013"}, {"Title": "Exceeds my Expectations", "Author": "Robert Taylor", "ReviewID": "R44TGQM3J7ZN8", "Overall": "5.0", "Content": "There are other reviews here that will go over more details about the camera, and I won't try to duplicate what's already been covered.I am more than satisified with this camera, happy that I got it, and have no second thoughts about it.  I got the X-S1 initially because I wanted a camera that could shoot RAW, but didn't think I could afford going up to a full DSLR.  At one time I shot a lot of 35mm film, but for a long time I've just been satisifed with point-and-shoot digital.This camera has reignited my love of photography. It's possible I may want to move up t a DSLR someday, but right now I've got enough to do learning this camera, and learning how to see photographs again.  I've had this for several months, and still haven't explored all of it's features.You could get this camera and just take photographs on full auto mode, but it seems to me that would be a waste.  This camera can let you take control of the of the process.  And even if you ruin a few (or many) shots while you're practicing, it's not like film, where bad shots cost you money.Only you can really  decide if this is the camera for you, but I would reccomend that you consider it.  If you're looking for a different kind of camera, then you're probably not even looking at these reviews.", "Date": "June 3, 2014"}, {"Title": "Great camera for the price, lots of features and images look amazing", "Author": "KReed324", "ReviewID": "R1MXT2FCK5YFB", "Overall": "4.0", "Content": "I bought this for my wife as a Christmas gift and we have both enjoyed it.  As neither of us our much of photographers, I decided to go with a \"bridge\" camera before diving into a DSR.  We have been very pleased so far and we still have a lot functions and features on the camera that we have yet to explore.  12 MP is plenty for our needs as the pictures look great.  I wish (for this and all cameras) there was an auto-stabilization feature once you get into the manual zoom, but I guess that's what a tripod is for.", "Date": "May 21, 2014"}, {"Title": "Fuji X", "Author": "Bench Rester \"Rester\"", "ReviewID": "R3K3QZBDL0XYXP", "Overall": "5.0", "Content": "The camera is a little heavy but I knew it would be with glass lenses & stronger constuction.I have taken the clearest pictures with it and think its great. I have bought fuji cameras for a long time and think they are a great value.", "Date": "May 19, 2014"}, {"Title": "Great Camera!  got it for the sale price.", "Author": "perk", "ReviewID": "R3D13IZ32OG0H6", "Overall": "5.0", "Content": "The XS1 Fuji Camera works great. Haven't found any con's yet, all positives. Has so many shooting functions and options I've just barely scratched the surface of possibilities. I like the manual zoom as that's what I used back in the day. I'm not fond of the power zooms of today although they make sense on the smaller cameras. I would highly recommend this camera. I have an expensive Nikon SLR system with many extra lenses and I love it. But I find myself reaching for the Fuji when I need some quick shots. Use my Nikon when I need more specialized lenses.", "Date": "May 17, 2014"}, {"Title": "Great camera!", "Author": "John Dowing", "ReviewID": "R2MJI9MLDJC28T", "Overall": "5.0", "Content": "I've been playing with my new X-S1 for four days now and it's a blast. So far, I've only referred to the users manual for basic stuff to get the camera operating: How to insert, format and remove the additional 8G Transcend SD card I ordered with it - and how to properly pre-charge the battery and insert it correctly.This is my first camera since the Canon AE (film) model I had in 1980. This FujiFilm X-S1 is my first digital camera and all I did was turn it on and start pushing buttons and flipping knobs.. the display screen shows all menus clearly, even in bright daylight. The camera's menus are pretty straight forward, you just have to know or look up what the terms mean (ISO, Format, Color, Highlight, Shadow, Noise.. to name a few). The manual is easy and quick - just look in the front and it leads you through each function, which is easily spotted for what you're looking for.One button takes the picture, one opens playback (of stills or video), another lets you keep or delete the shot - all right on the back of the camera and at your fingertips. Knobs on top adjust the ISO, shutter speed, ON/OFF (has Auto-Off in case you forget) and Mode (Full Auto, Auto + User Sets Shutter Speed, Auto + User Sets Aperture, Full Manual + User Sets All.. Even has a Full 360 Degree Panoramic setting.). Much more.Zoom lens is extra smooth - no burrs or hang-ups - silky smooth. The rear display is beautiful and adjusts to more than the advertised positions. This will fold out to a full 90 degrees (perpendicular to the camera body) so you can hold it low and look straight down into it.This comes with a lens cap that doesn't go over the end of the lens housing, it clips inside the lip by using two spring loaded squeeze tabs - you pinch them together, place the cap in the center of the lens and slowly release - they slide out away from each other, locking into the inner lip of the housing. You also get a hood which is a simple half-twist onto the outer lip of the lens housing.Nothing really screws onto the lens housing. No filter lenses with this package so you'll need to get a UV and CP (circular polarized) lens to cope with very bright sunlight. The 4/3 Sensor is extremely sensitive to bright light so it is recommended to never point it directly into the sun - this will damage the sensor.. just like your eyes. Don't do it.As far as transferring photos from the camera to my PC - it couldn't have been easier. The camera comes with a USB cable for this purpose and you will have to use this if your PC does not have a multi-card reader. My PC has the multi-card reader next to it's USB ports on the front, so I've transferred my photos without the cable - using the SD card only.When I had 100 photos on the card (a drop in the bucket) I just took the card out and slipped it into the multi-card reader and Windows 8.1 automatically opened the correct app and added it to the taskbar at the bottom. You have to then open the card as a drive and open the photo file containing the pics (there is more than one file - one is data) - that's it.All my photos came out extra large but that's ok, they can be resized. The X-S1 has plenty of options in it for whatever size you want AS YOU ARE TAKING THE PICTURE. Small, Medium, Large, Fine, Medium, HD..and will format them just like your LCD/LED TV aspect ratios (16 : 9 - -  4 : 3 - - 1 :  1 ,  etc..).It also records about 30 minutes of good video which plays back using the same buttons as the still pics use.This is a lightweight camera that feels solid when in hand. I spent 2 hours walking around holding this in my hand taking some 100 photos and I didn't notice any fatigue on my part. So far, I haven't used the viewfinder because I wear glasses and the 2 don't mix., but everything you see in the display screen is also seen in the viewfinder - which operates automatically. The viewfinder has sensors next to it which detect your face's distance and will switch the display off and viewfinder on when you bring it up - reverses when you move away. Pretty cool.I've only used about half the buttons on the camera and just a fraction of the software features available via the menu displayed in the rear screen, but I'm taking professional looking photos in all kinds of light and dark environments utilizing just about all the ISO settings (controls how much light gets though to the sensor) and shutter speeds. Just those 2 will get you where you want to be with most of your photos - the rest are mostly adjustments and some frills.Contents of Box:CameraBatteryCDBattery Charger (plugs into wall AC outlet - holds 1 battery - initial charge takes about 2 1/2 hours)StrapHoodLens CapUSB CableUsers Manuals (English and French)Small Cord (attaches to lens cap for looping around lens housing)All Warranty Papers and Registration Instructions (Register online 1-2-3 easy)", "Date": "April 27, 2014"}, {"Title": "Great Combination of Form & Function", "Author": "MrSteveP", "ReviewID": "R2XFH3TU972Q0Y", "Overall": "5.0", "Content": "As a an advanced hobbyist I have bought & sold numerous cameras over the years.  From 35mm, Medium format, Micro 4/3 & DSLR's. I can confidently say that the Fujifilm XS1 has all the features I desire wrapped in one. For starters I am a big fan of \"Bridge Cameras\". I like a fixed lens that can go from wide angle to telephoto without swapping glass. I like not having to worry about the sensor being exposed to dust. The DSLR style body is solid and has a great big grip to grab onto. The lens barrel is all metal. The zoom is achieved by twisting the lens barrel, no fiddly switch next to the shutter release. Lots of external controls is a must as I generally don't want to go menu diving to change settings like focus mode, ISO, white balance, exposure compensation etc. A hot shoe is a must since the built in pop up flash is underpowered for distant subjects. Now, all the bridge cameras I owned had small sensors, usually 1/3\" & some slightly bigger at 1/2\". The XS1 sensor is 2/3\" which  does a great job with many prosumer/advanced point & shoot cameras. Image quality is outstanding, it acquires focus very fast, is great in low light, and does have RAW/JPEG capability. The camera is as big as a DSLR & quite heavy. It's meant for someone who wants a serious photography tool & is built like a tank. It has a nice textured, rubberized finish to hold onto. The EVF is the best I've seen at 1.44 million pixels. The articulating rear LCD is 460K. I have not used this for shooting video although it is full HD and has a mini HDMI out. Overall this camera is a real winner & at the current price of $350 , no other vendors come near this price (I've seen it between $600-$700).Excellent job Fuji.", "Date": "April 24, 2014"}, {"Title": "Working great", "Author": "Juan P.", "ReviewID": "R3J88SORV6TAJ3", "Overall": "5.0", "Content": "I have been waiting to get this camera for so long and finally got it, feels great in your hand, has a lot of functions and image quality is great.The camera has a very fast AF, mine is a Serial number 33A and no problems with lenses or image quality, the only problem is that has so many options and I am still learning how to use properly, it is a lot better compared to the other superzooms I owned previously (Basically the top of the line Kodaks), now my old Kodaks look like a toy next to this camera.Works great in low light conditions and I am able to raise ISO all the way up to 1250 and see practically no noise on the pictures, so I am very happy with it.", "Date": "April 23, 2014"}, {"Title": "What a great bridge camera!", "Author": "patmacav", "ReviewID": "R21Y5XUYAAK4FX", "Overall": "5.0", "Content": "Plenty 'nough said in other reviews.Best bang for buck camera around.Kind of beefy.Not for someone looking for a little handheld point and shoot.NOT A POCKET camera either.Lots of bells and whistles.All good!.;^)", "Date": "April 21, 2014"}, {"Title": "Great Camera", "Author": "Patrick F. Flanigen", "ReviewID": "R31W6DVAOJW4LQ", "Overall": "4.0", "Content": "I'm a novice photographer and this Camera is much better than those small point and shoot cameras.  Since this camera has a larger CMOS sensor in it, I get better quality pictures.  I have the option to use preprogrammed options or just point and shoot.  So far, both my wife and I have taken some great pictures and we plan to learn more as we use the camera.", "Date": "March 31, 2014"}, {"Title": "Fujifilm Lover", "Author": "Duncan", "ReviewID": "R28HPTY9E5R7L4", "Overall": "5.0", "Content": "My first Fujifilm camera was a 6900Z I loved that camera since day one. It was extremely fast at navigating throughout all of the manual settings. Thus why I have had it for so long. No other camera would satisfy me the way the6900Z did. Until I decided to jump on a limb and order this. I am blown away at the build quality. It is an amazing camera to handle. Amazing grip, amazing look, and amazing quality. The Electronic Viewfinder is EXTREMELY clear. I mean like BAM!!! amazing. I hate using a screen to take pictures and the Viewfinder on this beast is simply gorgeous.Picture quality is simply stunning as well. I took it out on a hike the day after it arrived at my doorstep. I could not be happier with the quality and brilliance of the photos. Keeping in mind that I only shoot photos using the manual mode. I can not say how the auto mode picture quality is, but I'm sure it is great.The manual mode is very easy and simple to navigate through. The main reason for this purchase was the simplicity and ease to navigate while in manual mode.Battery life is very long too. I took multiple pictures and the battery is still showing full life. \"only using viewfinder to take pictures\"All in all I say this is an amazing buy. For the price, no one can beat the quality of this camera. As for the lens droop everyone talks about, I have not noticed it. Even if it did, the quality of the picture would not change or distort in any way.Fujifilm has my heart and always will. Great camera and great company!!!", "Date": "March 22, 2014"}, {"Title": "First new camera in several years", "Author": "James Buzan", "ReviewID": "R17PI5AOBPYYM4", "Overall": "5.0", "Content": "It's been several years since I last purchased a new camera, so I did most of my research on-line then came to Amazon to shop price.  The camera arrived on time which was important because we had a vacation to DC planned just after it's arrival date.  I only had a couple of days to figure it out and it was a snap.  It took great pictures and the features are awesome.  The battery life was outstanding which is very important to me.  I used it low light, indoors, at night, moving, etc. and it performed much better than expected.  The best camera I've ever used or owned and the price was amazing.", "Date": "March 16, 2014"}, {"Title": "A very wonderful camera!!", "Author": "adr44", "ReviewID": "RLWNJQE9VR23P", "Overall": "5.0", "Content": "The X-S1 is one of the best buys I have made! Great color images, best built super zoom I have owned. The viewfinder is large and bright. A large camera it is, but I like that. You can point and shoot and get nice images, or learn all the modes and have great photo's.I will keep this cam until I wear it out, that will take some time. A great great buy! Manuel zoom is a joy to use, I like almost like every thing about it.", "Date": "March 13, 2014"}, {"Title": "Fujifilm X-S1", "Author": "Kent Bristol", "ReviewID": "RM51BU69NOU86", "Overall": "5.0", "Content": "I have used Fuji superzooms in the past with mostly good results.  At first I had trouble getting all features to work.  Fuji tech support by phone was excellent.  Less than a minute spent with them resulted in \"open the menu, go to reset, click OK\" which reset all options to factory settings - problem solved.  My limited experience so far has revealed amazing competency with low light, image stabilization, and super sharp images.  I bought this as backup for my 4/3 and micro 4/3 cameras (two of each) but it may become my main camera.", "Date": "March 11, 2014"}, {"Title": "Excellent choice for those not wanting to change lenses", "Author": "S. Collins", "ReviewID": "R37XORV5IHY8AL", "Overall": "5.0", "Content": "This is essentially a DSLR with a fixed lens. It is fully automatic to fully programmable and takes excellent pictures. It does everything an SLR does without having to carry extra lenses. My only criticism is that it seems to burn through battery power. Buy an extra.", "Date": "January 1, 2014"}, {"Title": "Everything works as advertised", "Author": "Wayne Rorex", "ReviewID": "R7FLQRWZ1ALSO", "Overall": "5.0", "Content": "If you read the reviews and follow the advise given, this camera is all that you should expect. Takes good stills during video.", "Date": "December 23, 2013"}, {"Title": "Fuji X-S1 review", "Author": "Michael Gabriel \"MG\"", "ReviewID": "R2UXAF5U6Z0RO0", "Overall": "5.0", "Content": "This truly is an amazing camera and very well built, I really like the all-metal lens hood.  The camera strap is nice and battery longevity is superb.  The manual zoom is very smooth and all the controls are great.  For $350, I don't think you find a better camera.  I also purchased the Case Logic DCB-306 camera case and the X-S1 fits in there great even with the lens hood attached.  I am extremely happy with my X-S1 and case.  Oh yeah, I forgot to mention, this camera takes outstanding photos!  I have only owned the camera a short time, but at this juncture, I have not one negative to report.  The only issue some people might have is it is very solid and not a light-weight camera, but to me, that just tells me it's made well and not just a piece of plastic.  I think if you do purchase this camera, you will be very satisfied.", "Date": "December 20, 2013"}, {"Title": "Great for Average User", "Author": "Justin", "ReviewID": "R272UIATJAE54A", "Overall": "5.0", "Content": "Everything it was hyped up to be. The cae.mera produces clear non pix-elated images that will be sure to please the average ey", "Date": "November 24, 2013"}, {"Title": "Fujifilm X-S1 Companion Camera", "Author": "Eugene E. Works", "ReviewID": "RE8VABM826DFH", "Overall": "5.0", "Content": "I purchased this camera to down size from a Nikon D200 kit, and all the bulky, and heavy equipment .I am happy with my choice, as the Fujifilm X-S1 is much lighter, more compact, and it's one lens is fully capable of handling all my photography needs.The brightness , and colors are amazing, as well as the detail and clarity.", "Date": "October 13, 2013"}, {"Title": "Great super zoom!", "Author": "R. Shaffer \"shmopsi\"", "ReviewID": "RR860YV5K928D", "Overall": "5.0", "Content": "Wonderful single lens option, although it is about the same size as many DSLRs. Nice manually operated zoom is smooth and easy to operate, and saves battery over electronic zoom.", "Date": "May 10, 2013"}, {"Title": "One camera that has every accessory you need rolled into an attractive and lightweight unit.", "Author": "William T. Debnam", "ReviewID": "R2DIV5FF0URBPP", "Overall": "5.0", "Content": "This camera qualifies all an all-in-one package. Take this on your trip, along with a spare battery and memory card, and you are ready for anything. Very nice. It is beautifully constructed. well balanced, and tidy. The controls are very effective and thoughtfully arranged. It takes terrific pictures. I like it.", "Date": "March 1, 2013"}, {"Title": "Most likely the best bridge camera I've tested", "Author": "Raymond", "ReviewID": "R1V9RSZHAJHSVL", "Overall": "5.0", "Content": "Fast focus ability, picture quality are very topnotch.  No purple finching, auto white balance seems to work very well, gives crisp pictures and colors are not overly saturated like my Canon T2i's are.  X-S1 has the ability to take pictures with nice Bokeh effect with its Fuji lens, it has nice manual focus mode which helps in many low light situation either in picture mode or movie mode.  Nice movie features with true 1080p 30ftps capability.  Love the tilting LCD screen and the very useful electronic view finder, which has 1.44 million pixels, better than the one in my old Canon T2i.  I also love its ISO 400 and 800, pictures are very sharp under these ISOs.  Until ISO 1600, it shows some softness, and ISO 3200 shows some graininess.  Love the 26x manual zoom lens, the action is fast and focus is fast up to about 15x, which is very good and more than acceptable.  With tripod, I can take stunning photos of faraway objects at 20x - 23x zoom.  For 23x zoom and beyond, the focus hunts a bit, but still acceptable with a tripod.  Flashes are bright, and I don't have white balance issue with this X-S1 camera from Fujiflim.  Battery seems to last a full day of shooting (300+ pictures plus some movie clips or 400 pictures plus).  All in all, I am very satisfied with the purchase.  And, Amazon shipped it very fast in just 4 business days.  Thanks a lot and will do business with you again when I will buy the D5200 or T4i soon.", "Date": "March 1, 2013"}, {"Title": "Good camera with some flaws", "Author": "tousavelo", "ReviewID": "R1FOXTWQF4IK7G", "Overall": "4.0", "Content": "UPDATE DECEMBER 2013: 4 starsI bought a Nikon D3200 with 18-55mm in early 2013. I hardly ever use it. I usually don't bother carrying both, and I usually get the X-S1. The zoom of the X-S1 has more reach and my wife likes that. The colors of the X-S1 are better in my eyes. I could put more efforts in the Nikon and might be able to get colors I would like more. But the colors from the Fujifilm were always great in my eyes, with no need to tweak anything.I had the sensor in the X-S1 replaced (for the so-called orb-problem). The replacement also included the lens. Overall, I preferred the camera with the old sensor. In my eyes, the auto-exposure was better in my first sample and the zoom was more \"tight\".Still an intersting camera, currently at a bargain price.----------------------------------------------------------INITIAL REVIEW: May 21, 2012: 3 stars:Disclaimer: English is not my native language. If anything \"sounds\" odd, it may be a translation mistake. Sorry for that. More about me. I don't postprocess at all. I mainly wanted a camera with a good viewfinder (disappointment), a sharp 5x zoom (or higher) with no front/back focusing issues (disappointment with sharpness), great colors and exposure from Fuji (satisfied).The bottom line for the X-S1 is probably that I may chose to keep it and not return it. Yet, it is a camera that disappointed me in a lot of areas, and which is generally bellow what I expected. It is certainly capable of taking good pictures (though not very detailed ones). It is certainly fun (if you learn to live with a number of glitches). It could simply have been so much better with a better viewfinder (more details and less freeze please), a sharper lens (less range and more sharpness please) and a better user interface.Pros:* Feels just right (weight, build, size)* Silky zooming* Overall colors and dynamic range* Very versatile lens (24mm, macro, 135+ mm)* Pivoting robust external LCD (Rolleiflex like)* Face detection, AF, AE* Instant review in viewfinder (sharpness and contrast adequate, instantly available)* 1/1000s flash synchronization speed* Ability to work in complete silence (shutter and silent lens/AF)* Video and live view on external screen with decent AF* Almost cheap* Viewfinder makes framing somehow pleasurable* Somehow protected from dust on sensor (and certainly on non-existing translucent mirror)* Fast burst (though see bellow), multiexposure noise reduction, panorama* Most of the cameras/lenses I consider as alternatives will be replaced/introduced later this year, and are significantly more expensive, while the X-S1 is available now.Cons* Poor lens sharpness* Poor viewfinder (sharpness in shooting mode, freezes)* Average viewfinder (contrast in shooting mode)* No live feed in display when shooting bursts* Very deceiving interface* No real continuous AF* Slow operation (fast AF + freeze = slow operations)* Slow \"sharpening\" in PLAYBACK* White orbs, though they are rare* Zoom sag, though I don't know if it has an impact* Blue haze/flare facing strong light, though it may be only slightly worse than many other lensesOpinion about the X-S1 - Why I feel it is a lovely but very deceiving camera.Presentation following the topics in the official catalog available from fujifilm.com, at [...]  .So, let's go through the marketing brochure (see reference to page number before my comments) with some positive and some negative comments.p. 1/9. The camera feels great in my hands. I like the \"form factor\", the shape of the grip, the weight.p. 2/9. Lens. I like 24mm wide (35mm eq.). I like having a tele of at least 150-200mm (35mm eq.). I certainly don't expect 624mm but why not.p. 3/9. \"Exceptional resolution\" (p.3) ? Well, nothing to write home about in my experience. My F31fd was certainly way sharper. My Panasonic TZ7 is most probably sharper as well.p. 4/9. \"624mm 26x zoom. Telephoto shots without fear of blur\". Well, the image stabilization is probably ok, but not magic. Check the picture on that page of the marketing brochure, it has a 1/800 sec shutter speed indeed. Unlike the TZ7, in some cases, it takes a couple of seconds after you stop framing/panning before the image stops moving due to the IS.p. 5/9. \"Super macro.\" Not tested much but it gave me a very good impression.Check the pivoting external LCD on p.5. It pivots easily. It is sturdy. The camera is easy to control with the LCD oriented upwards, or downwards raised at arms length.p. 6/9. \"Feel of precision zoom control\". The zoom ring is indeed smooth and precise. As good as most zooms, even on SLRs.p. 7/9\"Super EBC\". \"Reduces ghosting and flare\". Well, when facing the sun/sky in high-contrast situations, it is not uncommon with my X-S1 to end up with some sort of blue haze. I feel that other cameras/lenses deal better with such difficult circumstances.\"EVF\" \"1.440.000-dot resolution\". The image is large but, you only get the full resolution in PLAYBACK mode, if ever. In shooting mode, you don't get the full resolution, the images are notably less detailed in the EVF (tested a.o. in bright daylight).\"The image projected by the bright LCD panel...  26° field of vision...\". Your eyes should be perfectly located or the image in the EVF will be noticeably less good.\"High-speed continuous shooting\", \"High-speed autofocus\": Don't expect speed everywhere. For instance, the display freezes for a split second even in the most basic circumstances (single AF, no panning, \"static\" object). In continuous shooting (3fps and higher), during the whole burst, the camera stops showing the action live, instead it plays back what you just shot, after the fact (According to dpr, Sony a65 or a77 don't do this at 3fps. With the X-S1, this can be tested also if \"IMAGE DISP.\" is set to OFF, which means no systematic playback.) If you shoot at 10 frames per second, the difference is probably not huge (at least 100ms in theory, probably around 200-300ms). If you shoot at 3 fps, it is very annoying; the lag would be at least 330ms in theory, probably around 0,5s in practice. Moreover, at least until you get used to it, it is confusing to be presented during min. 330ms with a static image while the subject is actually moving. I think our brain is used to having blackouts, as when you are looking at a moving subject which gets temporarily hidden behind a tree for instance; but not used to having freezes. When in burst mode (tested at 3 fps), with systematic playback, you get an annoying \"SD STORING\" message over your picture for a couple of seconds, even if it was actually a burst with only one shot. Oppositely, in single shooting mode, the shot is nicely played back almost instantly. There is also a \"BEST FRAME CAPTURE\" mode. In this mode as well, the LCD (internal and external) stop showing the action, instead they show the sequence of what has been just shot, making it yet again less desirable.p. 8/9.\"Customize operation with smooth one-touch control during shooting\". Well, you can assign e.g. \"FACE DETECTION\" to a Fn button. But you won't be able to change the FACE DETECTION setting with one-touch, not even with several touches of one button. At best, you will need 2 touches at 2 different \"buttons\"; e.g. one touch to display the \"FACE DETECTION\" \"menu\", one touch on another button to actually change the setting, and finally you can hit the shutter button, to close the menu. You should be able to _change_ the setting with just one or two touches at the Fn button.\"Assign custom settings to the Custom Modes (C1/C2/C3)\". Cn custom modes may be a fast access to your preferred settings combination of approx. 30 settings, for instance C1 for landscape, C2 for portaits and C3 for action. However, while out in the field, you may have to finetune one of those 30 settings in C3 for that specific day/location/subject. Well, if you do it the normal way, this update to C3 will get lost as soon as you will switch off the camera. (If you don't want to loose the finetuning after stop/start, you should formally redefine C3 by going in the right menu option, selecting C3 and asking to redefine it, a tedious process which has nothing to do with e convenience that you exepect from this feature.) At least, you changes in the PASM modes won't get lost after a stop/start. \"Focus Mode Selector\" - \"Continuous AF\": Well, that's not the continuous AF you are used to. Basically, that sort of Continuous AF offers, in my eyes, no benefit over single AF. Believe it or not, the AF is continuously adjusted until you half-press the shutter button, at which point, it freezes until you actually fully depress the shutter button. \"Battery\" same as my Fuji F31fd. At least they are fighting obsolescence. Thank you.The user interface and the whole EXR stuff is obscure and ill-conceived in my eyes. You can find lengthy debates on the internet of smart people trying to understand how it works. If you can live without proper explanation and detailed understanding, the final result is pretty good actually but this is frustrating at best.End of the catalog driven description.===========================================================================My experience as a user (more details). I have prefixed paragraphs with some sort of ID. I hope it doesn't hinder you reading too much.The viewfinder--------------V1. The EVF of the X-S1 is speced at 0.47-inch, approx. 1440,000 dots, just as the one in the X-Pro1 and the X100, which is reinsuring. However, at least in the X-S1, the quality in SHOOTING mode is significantly lower than in PLAYBACK mode. PLAYBACK is pretty much OK. SHOOTING is not to my liking, with a lack of resolution, e.g. to check if the subject's eyes are closed or narrowly open, when shooting a portrait with 2 persons, e.g. to enjoy a rich landscape. It's not a dealbreaker for portraits of one single person. Note that this applies also to full daylight with sunny weather (I don't expect full quality in a room lit by a candle...).V2. 1.44M dots is probably 800x600x3 colors. If I resize a picture to 800x600, it probably looks similar to what the X-S1 was showing in the viewfinder in PLAYBACK. However, the quality of the image in the EVF when SHOOTING is closer to 500x375 in my eyes. Actually, I don't see a difference in sharpness with the 460.000 dots external screen.V3. You may have read that a large EVF is better than the small optical viewfinder in entry level DSLRs. I certainly favor a large optical viewfinder versus a small optical viewfinder, for the very reason that it helps seeing smaller details in the image. In my eyes, if an EVF is large but has a suboptimal resolution, it is not necessarily better than a small optical viewfinder.V4. Set at 50fps, the EVF is pretty reactive except that it freezes for a split second when it's acquiring/confirming focus. If you are aiming at a person, the smile may be gone. If you are tracking a moving subject, you'll have a hard time ensuring that the composition didn't change. The freeze occurs with face detection on and off. And there is no live feed when shooting a burst, another big drawback e.g. when shooting a 3 images per second. Note that at the 30fps refresh rate, in my eyes, the image smears too much when panning. So, watch out for this setting if you experience strong smear when testing the camera in a shop.V5. The EVF allows reviewing pictures in the viewfinder right after shooting (it is displayed almost instantly). It's not needed but it's certainly very nice to have. I like setting it at 3 seconds review. For the cases where I don't want to wait that long, all it takes is hitting the shutter button and it directly switches back to shooting mode.V6. Although the ratio of the EVF is 4:3, as is the sensor, you cannot take full use of the bottom part of 4:3 images. Most of the time, the bottom part displays a translucent gray bar with information that hides part of your image. Don't be misled by page 6 of the manual that illustrates the \"INFORMATION OFF\" Display Mode. In that mode, the gray bar is not always displayed but as soon as you half-press the shutter, the gray bar reappears until you actually shoot the picture.V7. I have used the automatic switching between EVF and the external screen. In my experience, it is effective and fast. My glasses are not an issue for the automatic switching. There are 3 modes, EVF, external LCD and automatic switching between EVF and external LCD. It may be interesting to have a fourth value with automatic switching between EVF and no display at all. That would be handy to save batteries and/or work \"secretely\".The external screen-------------------E1. Works fine. I really like that it can be tilted upwards or downwards. I feel that the swinging design like Canon 600D etc would hinder my left arm/left hand.E2. With 3:2 images, in SHOOTING mode, the camera shows the gray information bar at the bottom of the external LCD, and the image comes above the bar; fine. However, in PLAYBACK mode, the camera centers the image vertically so that there is a useless narrow black bar at the top, and too many information overlapping with the picture at the bottom.Expected behavior:E3. Display the image in PLAYBACK at the top of the external LCD, not vertically centered. For formats as 3:2, it does matter !The lens--------L1. Starting at 24mm is great. It goes above 600mm but I wouldn't mind if it stopped at 135mm or 200mm anyway. The macro feature seems incredible.L2. The feel of the zoom is great. No \"hard\" point, no \"sticking\", it is just silky. Very lovely.L3. Some users have reported some sort of sag (at full extension, with the camera level, the end of the protruding part of the zoom goes down). There is some sag in my unit. I have read that the lens and captor may be one single assembly and that sag wouldn't hurt. I don't think it is the case. The front elements must be affected by the sag, while back elements and the sensor would be fixed in the main body. This must impact the alignment of lenses and make the quality lower, even more so considering the distance between the front and the back elements of the lens. I don't (yet) feel like trying the suggested business card fix (search dpreview for X-S1 and sag). The protruding part extends 8cm out of the fixed part. Considering the full size of the camera and guessing for the sensor position, the protruding part may be approx.. 11 cm in total. That means that, at full extension, that part is fixed by just 3cm inside the body. And it is a moving part, with weather seals. No wonder that there is some \"sag\".L4. The stabilization is OK when framing. In some cases (after panning), it takes several seconds to stand still. I never noticed that with my Panasonic TZ7 although I probably didn't use it in the same way neither.The user interface (buttons and firmware) and performance.----------------------------------------------------------U1. In my eyes, the user interface is very poorly designed. It reminds me of my frustration when I started using my F31fd (That one will let you select the slow-synch flash mode only if you selected the \"right\" exposure mode in the first place). Fuji likes to decide which settings combinations are good for you. I don't like the approach and their choices.U2. C1-C2-C3 allow you to define your own modes, typically based on other modes. However, unlike e.g. the P mode, when you work in Cn mode, every time you shutdown the camera, the Cn configuration is reset to the saved configuration. So, imagine you setup some 30 settings and save them to C1. Now, you start shooting and, on the fly, you change one setting. Stop and start the camera and you are back to the configuration that was explicitly saved earlier. Your last change is lost. This makes Cn close to useless. (This was tested with Face Detection, FD. C1 is saved as FD ON. I switch FD OFF. Stop/start the camera. The camera is back to FD ON. It works in the same unexpected way with ISO, tested with AUTO3200 and AUTO800.)U3. Expected behavior: Just as in PASM, changes made to Cn modes should be everlasting.U4. The FACE DETECTION can be assigned to a Fn button. However, it will still need at least 3 presses on 2 different buttons to switch the FACE DETECTION on or off. The same applies to the AF mode menu.U5. Expected behavior: Press once to open the FACE DETECTION menu. Press more to switch to the next values. Press OK, BACK or shutter button to close the menu.U6. The dedicated DELETE button only allows for deletion of 1 picture. If you want to delete more, you need to delve in the menus.U7. Expected behavior: Show more options as \"DELETE ALL\" after pressing \"DELETE\".U8. When AF MODE is set to \"AREA\", pressing the AF button makes it possible to select the AF area size and position. After changing the area and size, you can confirm your choice by pressing again the AF button, or by pressing DISP/BACK. Unexpectedly, you can NOT confirm with OK. OK would reset the area to the midsize center zone.U9. Expected behavior: After changing the AF area or any other setting, OK must confirm the user changes, not reset them. (If OK is pressed before any change to the area, the area could be reset. However, this \"smart behavior\" is probably too confusing for the marginal benefit.)U10. The AF button at the back is useless in most AF Settings, although I didn't find a super smart way to make it efficient in AREA mode and useful in the other modes.U11. Continuous shooting: In TOP mode of continuous shooting (the Fuji wording for shooting bursts), the camera uses a different naming convention for files, generating e.g. S0137365.JPG, instead of the usual DSCF0325.JPG. This is an annoyance for me. As a result, with my favorite image browser (XnView), I can browse pictures sorted by name, and so, due to the 2 naming conventions, in a completely hectic chronological order. Or I can browse them sorted by exif datetime but, with bursts, the datetime expressed in seconds is shared by several pictures and bursts end up being in the wrong order. (Note that in PLAYBACK for bursts, the camera itself works with 2 levels. While navigating through all pictures, it shows only one picture for the whole burst, with an animation showing all the pictures in the burst as a video. And you can press one touch to enter the burst and browse through single images of the burst. This is nice. But it shouldn't come at the expense of the dual naming convention.) Note that the second naming convention is also a bit obscure to me.U12. Expected behavior: There must be only one naming convention. It could be DSCNxxxx.jpg.AUTO EXPOSURE-------------A1. The EXR AUTO mode lets the camera choose between 3 EXR modes, supposedly one of the big benefits of this camera: HR, DR, SN. Great since I don't want to care about that stuff. I want to let the camera choose whatever is most adequate to the circumstances (lowlight, backlight etc). However, for some reason, EXR AUTO has to come with AF-C, which is continuous AF. And actually, EXR AUTO is bundled with an awful lot of other settings.A2. Request: The \"Dynamic Range\" setting in the Shooting menu (available in most modes) should be replaced by an \"EXR\" setting available in most/all modes. The list of values would include: EXR DR AUTO, EXR DR400, EXR DR200, EXR DR100, EXR SN, EXR HR and of course EXR AUTO. That \"EXR AUTO\" would only apply to the EXR sensor/imaging technology and would not be bundled with other unrelated settings (as AF etc). Just as with the current EXR AUTO, the size would be set to AUTO as well. (Note that according to some sources, the SN and HR stuff is pretty much marketing fluff and you will get the same results in regular PASM modes. I don't know but it's certainly a pitty that the user is simply left wondering how the camera really works.)A3. You can combine the M mode of PASM, with AUTO ISO. As a result, you work in an automated exposure mode where the camera selects the ISO. You should be able to set exposure compensation so that the camera makes images brighter/darker by selecting higher/lower ISOs. However, exposure compensation is not available in M mode.A4. AE/AF LOCK: As soon as you depress the shutter button, even though you keep AE/AF LOCK pressed, you loose the exposure that was locked.A5. When the AF is set to M, the FACE DETECTION is automatically turned OFF. This is a bad design. FACE DETECTION also drives the exposure metering. All exposure metering options should be available in manual _focusing_. (In MANUAL focusing, it is always possible to hit the AE/AF lock button to let the camera adjust focus. Currently, all AF options are not available, only some sort of AREA AF with a fixed large size area.)A6. Expected behavior: MF should not automatically turn FACE DETECTION off so that FACE DETECTION is still possibly used to define exposure.AF--F1. Continuous AF is not continuous for as long as you depress the shutter button, as you would expect. It is continuous from the very moment you set the option. No wonder it is listed on the \"problems\" part of the manual for the item \"The battery runs down quickly.\" Indeed, the two times (so far), I exhausted my battery were after a couple of minutes of experimenting with that mode. Wait, there is more. Actually, it is continuous until you half-press the shutter button, at which point, it locks focus. Huh?F2. Expected behavior: Whatever the setting, AF should not start before one touches the shutter button. In continuous AF and SingleAF/tracking, the AF should never be locked, at least not before the last picture in the burst is actually shot.F3. AF-C is continuous (too continuous, see above). AF-S + tracking is also continuous (it starts before you even define the target). Wonder why it's called AF-S ! AF-C is incompatible with the tracking option. AF-C seems to always focus on the cross in the center, while AF-S + tracking focuses on whatever target has been defined. AF-C and AF-S + tracking do LOCK focus when the shutter button is pressed halfway. So, you should not half-press... Instead you should fully press right away. AF-C continuously focuses, but the cross doesn't turn green until you press the shutter button.F4. The AF settings are awful, with many settings in many locations, and many incompatible settings. There is a 3 position focus mode selector at the front that can be set to AF-S, AF-C or M. In the menus, the AF MODE can be set to MULTI, AREA or TRACKING. There is a different menu for FACE DETECTION which can be ON or OFF. There is also an AF button at the back.F5. Bad suggestion that doesn't solve the exposure metering side: Instead of dealing with the 2 settings for AF in the SHOOTING MENU, namely AF MODE and FACE DETECTION, there should be only one setting with more values: MULTI, AREA, TRACKING and FACE DETECTION(MULTI) and FACE DETECTION(AREA). Note that TRACKING is not compatible with FACE DETECTION in the current firmware anyway. The 2 flavours of FACE DETECTION values for AF are required to define what happens when no face is detected.F6. In MF, when hitting AE/AF lock, the camera adjusts focus. When focus is achieved, the camera beeps (if not in silent mode) but it does not turn the zone to green as in other focusing modes.F7. Expected behavior: In MF and all other AF modes, when the camera locks focus and beeps after a press on AE/AF LOCK, the focus zone should turn green.F8. In MF, when hitting AE/AF LOCK, the camera focuses but it doesn't lock exposure. I like the ability to trigger AF in MF with the LOCK button, so I don't know what to suggest. However, this is confusing.F9. The default sound is great to me.F10. Ability to work in silence (there is no mirror and no mechanical shutter), which can be activated with one touch (a tricky one though, long press on BACK if I remember correctly).F11. You can put the camera in a sort of lock mode, where you can do almost everything but not for instance change the flash mode. This is not documented in the manual. It will drive you nuts before you find the solution (long press on OK if I remember correctly).The pictures.-------------P1. Note that I'm setting \"noise reduction\" at LOW (it's the lowest setting), quality FINE and 6 or 12MP.P2. Images are generally pretty good although sharpness is weak. Exposure is usually impressive. Colors are usually great. Dynamic range seems great. White balance is not perfectly consistent. (I like \"face detection\". Of course, it doesn't work 100%. Whether or not the camera detected a face, will largely impact the white balance/colors. )P3. The expectedly gimmicky \"PRO LOW LIGHT\" (noise reduction based on several pictures taken in a fast sequence) mode impressed me a lot the one time I tried it. It deserves further tests.P4. Many of my images are too soft so far, but AF seems OK (expect for the side effect of the freeze of the EVF and inability to deal with moving subjects). EXR HR may give nicer results but I don't really know yet. (Note that some users report that EXR HR is no different to any image taken at 12MP.)P5. The blue smudge/flare or purple haze exists  although I experienced it in \"wild\" circumstances where most camera/lenses would probably exhibit some sort of problem. I found reports of more frequent cases.P6. The orbs problem exists. Not only does it turn points into large discs but it also produces any sort of form. Nothing very relevant so far in my pictures but from what I have seen, it may just be a matter of having more sun, or more chrome, or more water... Not a great perspective. Orbs seems to exist also as black orbs.Miscellaneous-------------R1. Some shops in Europe still sell it at 819euros, but it is easy to find around  650euros. Much cheaper than a Nikon D7000 with 18-105 at 1.199, or Sony a65 with the coming 18-135. (The zoom range is much smaller indeed but I don't consider the 26x reach of the X-S1 as a necessity.)R2. Amazon rating: It is amazing that, considering amazon.com and amazon.co.uk, before the 5th of May, there were 7 reviews with an average of 3 stars, and not a single 5 star rating. From the 5th of May until the 21rd of May, 5 reviews were added, and they were all 5 stars reviews.", "Date": "May 21, 2012"}, {"Title": "Is not a pro camera, is fun to use it for a Profesional or advanced user.", "Author": "Rafael Z Flores \"TJ ACT\"", "ReviewID": "R3OZ7957I4FMSB", "Overall": "5.0", "Content": "This camera works really grate, the quality is amazing for the less than 400 dlls., Light wait, fast speed shutter, durable, grate video quality. The contras: Low speed on focus and macro modes. Is not to easy to select areas for exposure or focus out of the center.", "Date": "May 6, 2014"}, {"Title": "Excellent Fuji colors and images, but know what you are buying", "Author": "W. Moore", "ReviewID": "R1N46AJTOYCI6K", "Overall": "4.0", "Content": "Biggest issue with this camera was that it was not new.  Apparently Amazon repackages returns and sells as new.  Please note, the camera was impeccable with no cosmetic flaws and was a 33Axxxx, but the date and time had already been set.  I have no problem with this as I like Amazon's return policy, but they should post a disclaimer on the site.The camera is great, but big.  Bigger than I thought.  Bigger than some compact DSLR's from Nikon, Canon.  But it is also rugged and built like a tank.  No plastic components here.  The grip and balance are great, however so it handles well.  The manual zoom is a delight to use.  You will smile everytime you zoom in or out it is so smooth.  The internals are the same as the X10 I own and so the images look great to me color wise.  You do need to learn some settings as the camera offers many options.  I recommend the X10 book available on Amazon as the settings are the same between the two cameras.  Considering the wide zoom range this is a perfect 1 camera solution for travel.  Many people are not aware the body is partially weather sealed.Pros:Current price is an incredible bargain.Large sensor for high ISO shots without noiseWide zooom from 24mm to 634mm equivalentManual zoom for smooth zoom actionBest electronic viewfinder I have ever used and automatic switching from LCD to EVF even with eyeglassesCons:Weight and size are larger than other superzoomsLens wobbles slightly at full extension which is unnerving, but doesn't affect image quality", "Date": "February 19, 2014"}, {"Title": "A great 'bridge' camera!", "Author": "dips", "ReviewID": "R1568UJBUBUXZL", "Overall": "5.0", "Content": "A lot of people have compared this camera to DSLR cameras and given it bad ratings in the past - this was at a time when this camera was selling for over $600. But, one must not lose sight of the fact that this was and is a bridge camera. I got this camera for under $400, and for this price, it beats all other bridge cameras hands down, when it comes to image quality and features. The look and feel of the unit is purposeful and elegant, and the build quality is excellent and at par with mid-range DSLRs. It has a 40% bigger sensor than most other bridge cameras in the price range, which results in excellent image quality. With a wide aperture of f/2.8, as against f/3.5 found in most other bridge superzooms, one can get good shallow depth of field and macro shots. The lens system is decent and gives acceptable images at full-zoom, but I would not recommend going over 14x if quality is an issue. The features can be easily accessed, thanks to sensibly laid out controls. Though the camera weighs close a kilogram, it feels very good in the hand. I strongly recommend this camera to anyone looking to buy a camera with good image quality, but can't afford a DSLR (if you're okay with the bulk and lack of insane 50x-60x zoom-levels found on some newer superzooms).The newer models (SN: 23XXXXX or newer) do not seem to have issues with lens droop and orbs, like the older ones did.", "Date": "November 22, 2013"}, {"Title": "It's not bad but it does have some flaws", "Author": "S. Vogt", "ReviewID": "R1XTZ7HWX7VM25", "Overall": "3.0", "Content": "Revisited 10/16/12 - added one starThe XS-1 has significantly come down in price since this review was posted. While I still think it's photo quality is only marginally better than your typical superzoom, it offers a feature set like none of the other superzooms on the market and really is the ultimate bridge camera. I only hope that Fuji has worked out some of the bugs with the later copies of this camera. And it needs to have better RAW support as well. For $600 though, you get quite a bit of camera for your money.The bottom line on this camera is that the image quality is no better than your average point and shoot. For an $800 camera, that's rather disapponting to say the least. As a point of reference, I have also shot with the Canon SX40HS and Panasonic Lumix FZ150. Both of those turn out about the same level of IQ as the XS-1 and don't seem to have as many other operational flaws with them (and cost almost half what the XS1 does).Granted the XS1 blows the FZ150 and SX40HS out of the water with its feature set and the EVF is one of the best I ever used. But what good is any of that if this $800 camera turns out photos that look just okay?The camera is also a monster in the size department. Just slightly smaller than the 60d. I actually wouldn't have an issue with that if the overall performance was good. It's comfortable to grip and feels pretty well-made. My understanding is that there is also some degree of weather-sealing with the camera. Which is ironic because when I used the camera on a breezy day yesterday the screen would start flickering in the stronger wind gusts. I have never experienced that on a camera before.As I mentioned before, the robust feature set is one of the camera's strong points. It basically has all of the options and controls that a mid-level DSLR does and it is fun to explore all the settings that the camera has. I like the different film simulation modes it has.The camera's performance is rather good in a lot of respects. It's quick to power on, the autofocus (when it works correctly) is fast and shot-to-shot times are good. That coupled with the EVF can make it enjoyable to shoot with when the camera isn't acting up.Like I mentioned, image quality just has too many flaws considering its sensor size and price. My copy of this camera routinely overexposes, display visible aliasing, and details get smudged in a lot of instances. It's interesting that the X10, for all its flaws, seems to utilize this sensor's full potential a lot better and has significantly better photo quality than the XS1 does. While neither cameras can match the ISO performance of DSLR or ILCs, the X10 held up pretty well again the DSLRs at the lower ISOs in terms of image quality. Not the case with the XS1 though. While I can fully understand and expect softness at longer focal lengths, it just doesn't perform well at any focal length.Another major flaw is the image stabilization leaves something to be desired. When extended to its full 624mm, you either have to have a steady hand or use a tripod to get a decent shot. Granted I had these same types of issues witht the FZ150, but that is a much cheaper camera overall. I would be more inclined to forgive that on a $450 camera vs. an $800 camera.Also the autofocus refuses to lock on from time-to-time. The X10 had the same issue which leads me to believe that Fuji needs to do more work on their AF systems. The AF is fast when it works, but again, these are issues that cameras half the XS1's price don't exhibit.I know there are those that will say I'm being overly picky given its a superzoom. But charging almost double what the other guys are means that I rightfully expect something better than your average superzoom. And what you get for your money just isn't that great. It's not the worst camera you can buy and it has a couple of strengths. But the final result is just not up to par and I think there are better ways to spend your $800 than on the XS1.", "Date": "March 5, 2012"}, {"Title": "BEST HIDDEN BRIDGE", "Author": "Amazon Customer", "ReviewID": "R13Z8UABAPH3QC", "Overall": "5.0", "Content": "This camera has to be the best kept secret in the industry.  It originally retailed for $800 so at $350 it is a good price", "Date": "June 5, 2014"}, {"Title": "Good product!!", "Author": "Manfredi Carnevale", "ReviewID": "R6MECLGD0DLXT", "Overall": "5.0", "Content": "It is a great camara as I expected!!It is very close to a SLR with out the mess of changing lens", "Date": "May 1, 2014"}, {"Title": "Nice camera", "Author": "Frank", "ReviewID": "R11CELQPNSUH9O", "Overall": "5.0", "Content": "My number is 34 so its made in 2013 & in the last quarter of year. Seems the problems was fixed. This camera has it all.", "Date": "March 25, 2014"}, {"Title": "amazing Camera", "Author": "Brandon Egloff", "ReviewID": "R2EO9WL3IDRHTR", "Overall": "5.0", "Content": "got this camera for my wife, she is a beginner photographer.  she has always used point and shoot type cameras in the past. This camera is definitely more complicated to use, and has taken her some time to learn all the ins and outs, but the quality of photos are amazing ! the Zoom is incredible on this camera too!! she loves it and highly recommends it !", "Date": "March 24, 2014"}, {"Title": "Very very very nice", "Author": "Abdullah-TIP61780", "ReviewID": "R2896CXP4QRM8O", "Overall": "5.0", "Content": "This is my dream cam i love fujifilm and i love lenses for company good lock fujifilm and im wait new version from camera's professional", "Date": "March 23, 2014"}, {"Title": "Fantastic Camera", "Author": "JUST-JIM", "ReviewID": "R13OOWOUC7W7RI", "Overall": "5.0", "Content": "After being more or less satisfied with the Fuji SL300 I purchased from Amazon, I wanted something more versatile. I ran all the webs for a better Fuji Camera. Im not a pro so a dslr was not in the cards. I  am not able to purchase other lenses for a dslr so the next best thing was the Fuji X-S1. As close to pro as I wanted to be. I received it in pristine condition and with serial #33 so I know it was after 2012. The pictures this takes are fantastic. The menu is easy to use. It is a manual zoom unlike the motorized zoom on the SL300. Im getting used to it so far. It will do everything that I want a camera to do. Two things tho: Most of the other cameras that I researched from other manufacturers seem small, fragile and toy like. This Fuji is huge and solid. It wont fit in your pocket. The minute you pick it up, you can feel its quality. Worth every penny, and its MADE IN JAPAN and not friggiin China!", "Date": "March 21, 2014"}, {"Title": "Bought this for a friend", "Author": "Dennis", "ReviewID": "R7KNL3KKZLRJ2", "Overall": "5.0", "Content": "WOW!  I own an $1800 semi-professional DSLR and bought this camera for a friend who is getting started into photography.  I AM IMPRESSED!  For the money, this camera is A-1 in my book.  It is easy to operate but still allows the user to advance when the time is right.  I ran it through its paces for several days and it compares VERY favorably with my expensive camera ---and the cost of the camera was about one-third of what I paid for just the lens for my semi-professional camera.", "Date": "March 19, 2014"}, {"Title": "Very nice", "Author": "DeeAnn", "ReviewID": "RD06GP8WLK0HB", "Overall": "5.0", "Content": "I love this camera it is easy to use and takes great photos there is so much you can do with it, all you need to do is read the owners manuel if your not familiar with camera's like this. If you want better photos than the cheaper cam this is one you should check out,  Im so happy I bought this and love the results.", "Date": "February 11, 2014"}, {"Title": "Never been more pleased with any online purchase!", "Author": "William \"Will\"", "ReviewID": "R3CKQ3VS1W5MR2", "Overall": "5.0", "Content": "The X-S1 is simply a great, perhaps the greatest, of the bridge cameras.  Literally everything that a much more expensive DSLR can do. The build quality is second to none, none! I used next day delivery and it arrived the next morning! Well packaged, with everything present and in tact!", "Date": "February 8, 2014"}, {"Title": "Exciting camera!", "Author": "George Gutshall", "ReviewID": "RLSR8R4W3KORK", "Overall": "5.0", "Content": "I started my photography with Tri-X in 100 ft rolls and a Nikkormat that I thought was fantastic.  Missed the early days of digital but recently purchased the X-S1 and couldn't be happier.  Handles a wide-range of situations with no problem.  Still learning all of its capabilities but I couldn't be happier.", "Date": "February 3, 2014"}, {"Title": "Love the camera but...", "Author": "Janice Sangunitto", "ReviewID": "R27MCCO8NT73L5", "Overall": "4.0", "Content": "I'm enjoying learning how to use the camera and all it's functions but the included battery charger is a different story. I haven't seen any reviews concerning the problem I have. The camera comes with a NP-95 battery which does not fit the Fujifilm BC-65N battery charger that was also included with the camera. The charger was made for a battery that is about a 1/4\" longer and the battery does not stay in touch with the contacts to recharge without my having to wedge something into the space to keep the battery seated correctly. Has anyone else had a similar problem or did I received the wrong charger? It's very inconvenient, I have to constantly readjust the battery to charge it.", "Date": "January 31, 2014"}, {"Title": "X-S1", "Author": "Harvey M Ellis Jr", "ReviewID": "R3AVDJYMTFUEUF", "Overall": "4.0", "Content": "So far it's done a great job.  No complaints.  EXR mode is very good at scene selections. I've got some nice snow shots since we have had back to back snow,  Great camera especially for new lower price.", "Date": "January 30, 2014"}, {"Title": "Returned due to poor picture quality", "Author": "Jimmy", "ReviewID": "R137QLJO96LN84", "Overall": "2.0", "Content": "Sorry to all of the 5 star reviewers, but it doesn't make my grade. I have a Sony NEX-5N with a 55-210mm lens and wanted a superzoom camera for distant songbird shots. At any distance, this camera cannot produce anywhere near the quality of my present camera. So far, the only way to do that is a very high level DSLR with a very expensive and massive lens. I don't want to carry around that much equipment for an occasional long shot and I will not accept blurry images. When I zoom in on a picture of a bird, I want crisp, sharp feathers and a clear sparkling eyeball. If you don't care about the level of quality, this camera may be acceptable. Very disappointing, but not surprising. I'll keep looking at bridge superzooms as new models are introduced, but I'm not optimistic about any big breakthroughs in their IQ.", "Date": "January 25, 2014"}, {"Title": "Great Camera Value X-S1", "Author": "kiteflyervt \"kiteflyervt\"", "ReviewID": "RI0B9DI0V8RPH", "Overall": "5.0", "Content": "I Love This Camera. I HAVE USED IT ON A TRIPOD AND MONOPOD AND THE RESULTS HAVE BEEN STUNNING. i HAVE EXPERIENCED NO IMAGE SOFTNESS AT THE EXTREME TELEPHOTO SETTING. I HAVE ONLY TESTED IT AT ISO 100 FOR THE FINEST QUALITY AND I CAN TELL YOU IT PRODUCES VERY SHARP PHOTOS AT EVERY FOCAL LENGHT SETTING I HAVE TRIED. AT THIS PARTICULAR PRICE POINT OF $349.00 IT IS AN ABSOLUTE STEAL AND WOULD SUGGEST YOU PURCHASE IT BEFORE AMAZON MOVES THE PRICE UPWARDS. MY SERIAL NUMBER STARTS WITH 33 AND HAVE EXPERIENCED NO PROBLEMS SUCH AS LENS DROOP OR WHITE ORBS. A GREAT CAMERA AT A SUPER PRICE.The X-S1 IS SOME BABY. The more I USE IT THE MORE I can't wait to use it and Love it.", "Date": "January 24, 2014"}, {"Title": "Excellent", "Author": "Lisa Miller", "ReviewID": "RMI5ESNPQUYVL", "Overall": "5.0", "Content": "I bought this as a gift for my Husband and I looked at cameras for over a year before deciding on this one. For the money it far exceeds the capability of other cameras I was considering and a lot cheaper. I would recommend this product to anyone.", "Date": "January 23, 2014"}, {"Title": "All-in-one and fun.", "Author": "John Pantazis \"PAN360\"", "ReviewID": "R7MCV2V65UIYM", "Overall": "4.0", "Content": "Jam packed with features and build quality that is certainly enviable. Not the end all be all but a joy to own.", "Date": "January 19, 2014"}, {"Title": "Complicated Little Beast", "Author": "Mark W. Johnson \"Baron\"", "ReviewID": "RNWSQSG1KU6H4", "Overall": "4.0", "Content": "I am not a photographer, but have had a ball trying to figure this thing out.  If you like working with bells and whistles, this camera has them at a very reasonable price.  I have taken some really good pictures that I would not have known how to do prior to purchasing this camera, and have also had dozens of failures as I worked through the possibilities of the various menus.  It seems to be well-built, and looks like it could be the last camera I'll ever need.", "Date": "January 18, 2014"}, {"Title": "So far so good", "Author": "Bella Marie", "ReviewID": "R3HFHFG24JDO60", "Overall": "5.0", "Content": "I had been looking to purchase this camera for a while because I had read some very good things about it.  I am not a pro nor do I do photography as a serious hobby.  I do however like a nice camera for those times when I want to keep special memories alive.  I have only had the camera for a few days, but it seems to be great so far.  There is definitely a learning curve here, but I am confident that I will be able to learn what I need to learn to get the most out of it.  It is heavy in the hand and a little on the large size, but that's not necessarily a bad thing.Also, I got it from Amazon warehouse deals for a fabulous price!!!!! No way I could have gotten this price for this quality anywhere else (not even Ebay).  Way to go Warehouse deals!", "Date": "January 18, 2014"}, {"Title": "Quality camera", "Author": "lisa", "ReviewID": "R2XQ83HXJB3DZY", "Overall": "5.0", "Content": "This camera has a real quality feel to it. I can't believe I got such a great camera for a little over $300! I think this camera was over $800 when first released a few years ago. I haven't had a chance to take very many pictures yet but I am confident it will perform well based on the many reviews I read about it across the net. I am an amateur photographer that is moving up from a point and shoot camera. I am not expecting this camera to perform like an SLR because it is not an SLR but should be a perfect bridge camera for the price that I paid. Amazon delivered it in perfect shape and it is one of the later serial numbers that had previous firmware problems resolved. Kudos Amazon!", "Date": "January 17, 2014"}, {"Title": "This Camera Soars.....", "Author": "David Apps", "ReviewID": "R339T204G4KVTS", "Overall": "5.0", "Content": "Best of the best! For my specific type of commercial photography, this is perfect! I have waited year after year for a product like this camera to come available to the public! Wow-Wee!", "Date": "January 3, 2014"}, {"Title": "Winner winner", "Author": "ileana", "ReviewID": "R29I3OULFHT452", "Overall": "5.0", "Content": "Awesome camera! Great price. I love it. Everything I've always wanted in a camera, and it's useful for my clothing line photohoots. I recommend it", "Date": "January 3, 2014"}, {"Title": "So far so good", "Author": "Gena Parsons", "ReviewID": "RLCPVQFGG9L6V", "Overall": "4.0", "Content": "So far I'm really pleased with this camera. It has settings that are easy to use. The shots are sharp. The rechargeable battery is great. The only flaw I've found is that the sunset setting doesn't work that well. It makes the shot darker than just using one of the auto settings. For the price (and bundle with extra battery) I got, this was a great deal and I look forward to learning more about effectively using this camera for personal and professional use.", "Date": "January 2, 2014"}, {"Title": "Very happy!!!!", "Author": "Eli wooster", "ReviewID": "R3QCVEPLO5J5AO", "Overall": "5.0", "Content": "I just recieved this camera today on New Year's Eve, and just to let everybody know, so far this camera is every bit a five star deal. I'm  somewhat new to photography,so this camera has a lot of features I'm still learning on. The camera is very well built just by the feel of it. I've been buried in the manual for around 3 hours, and gaining. so far, the camera works very fluid,very smooth. A lot of nice features on it. For the price, this camera is well worth it. I know their is features on this camera I will probably never use in awhile, but they are nice to have if you are planing on advancing.", "Date": "December 31, 2013"}, {"Title": "Excellent Camera for what I needed", "Author": "Jeff Hatzfeld", "ReviewID": "R1Z6CZQ6HX5Z29", "Overall": "5.0", "Content": "I always owned one of the $100 Canon cameras.  They were great at still shots that were close, and scenic pictures.  However my kids are now in sports and I needed something more powerful because all my pictures were now fuzzy.  I did not want to pay for a DSLR as I knew I would need another lens.  This camera so far has been great and the price is perfect.  I am able to capture action shots with the continuous shooting mode and I can zoom with great ease.  If you are looking beyond the $100 cameras but not a serious photographer, this camera is well worth it.", "Date": "December 19, 2013"}, {"Title": "Super Nice Camera", "Author": "Dawn Holcombe", "ReviewID": "R1OXZACRJEFISS", "Overall": "5.0", "Content": "I really like this camera so far. I am still learning all of the settings on it but so far so good.", "Date": "December 17, 2013"}, {"Title": "Good camera", "Author": "marlee", "ReviewID": "R31Q3KI92HRFYI", "Overall": "4.0", "Content": "Easy to use and photos are great quality.This is a good camera for someone just beginning to take pictures.", "Date": "December 16, 2013"}, {"Title": "Very Satisfied", "Author": "freyerpa", "ReviewID": "R2JA5ATEJ2UQQK", "Overall": "5.0", "Content": "I am very satisfied with the camera, and with some of its preset settings which work particularly well in situations where time is short. I did have  a problem with the EVF after a few weeks, but I sent it to Fuji and they replaced the view finder and returned it to me in 5 days. Couldn't ask for more in the way of service.", "Date": "December 16, 2013"}, {"Title": "Love this camera", "Author": "J. P.", "ReviewID": "R2861MGPZXJCUD", "Overall": "5.0", "Content": "I just got my X-S1 and love it!  Really nice pics and amazing zoom.  I never had the desire for a DSLR because of the impractical zoom lenses that I'd have to carry around and I've been increasingly dissatisfied with my point and shoot cameras.  So this is the perfect bridge camera for me.  I just hope the quality of this camera is as good as it seems to be.", "Date": "December 15, 2013"}, {"Title": "Love the camera.", "Author": "ski professor", "ReviewID": "R1BIT2YP14P7UT", "Overall": "5.0", "Content": "Thrilled with this camera.  So much easier to use than my DSLR and picturesare coming out great.  Taking pictures without flash and having them come out so well is amazing.  Picture shot across a large banquet hall without flash and handheld came out terrific.  Really enjoy learning how to use the camera.  Paper manual with larger print in my only wish for improvement.  Have not used the CD that came with the camera thus far.", "Date": "December 12, 2013"}, {"Title": "Excellent camera for the price", "Author": "Paul", "ReviewID": "R3UN7VEWE8FGGN", "Overall": "4.0", "Content": "I'm enjoying this camera alot.  The telephoto lense is unbelieveable.  At times the internal software is a little glitchy and won't turn on right away...other times it works perfect.  Friends of mine experience software glitches with their expensive camera, too, so it is probably just the nature of these types of devices. I have many cameras, Canon G12, Canon D-7 and I have to say I enjoy the versatility and size of this camera.", "Date": "January 14, 2013"}, {"Title": "Great camera", "Author": "88forever", "ReviewID": "R1I9ZZDI65LEKM", "Overall": "4.0", "Content": "This camera is great and is easy to use.  I like that it is easy to hold onto.  I haven't used it all that much yet, but so far I have no complaints and it takes great pictures.", "Date": "February 20, 2014"}, {"Title": "Great all purpose Camera!", "Author": "Les Wolf", "ReviewID": "R1GCDRXR6B7Z9S", "Overall": "5.0", "Content": "I am very pleased with the overall build quality, features and image quality of this camera. The zoom lens is very smooth and easy to use, and as I predominantly photograph birds, I can now zoom in so much closer to the subject.  Macro feature allows you to take really sharp close-ups.  This camera has so many features, that it takes a while to really get to utilize and learn them. You can use the XS1 as a point and shoot or really take the camera to pro level functions. I did extensive research before I purchased the XS1, and for the price this has to be one of the best bridge cameras on the market.", "Date": "January 3, 2014"}, {"Title": "Relatively versatile, poor image quality.", "Author": "Sv", "ReviewID": "R363OQR82BOQGY", "Overall": "3.0", "Content": "I bought this camera as a replacement and upgrade for my 6-year-old 7MP Nikon CoolPix camera.  Unfortunately, it fails at both tasks.  If I had paid full price for this camera, I would be returning it, but for under $350 on black friday, I will keep it.Pros:  Versatile - There are many different shooting options, but without the hassle of multiple lenses.Battery life - HUGE upgrade from my Nikon Coolpix that uses regular AA batteries.  Not surprising but very nice.Macro - This camera takes close-up pictures just as well as my Nikon, with the advantage of easier focusing.  In this regard this camera is an excellent replacement for my Nikon.Many manual options - Obviously my CoolPix did not have any options for manually adjusting, well, anything.  It had several excellent presets that worked well for me, but this is a nice upgrade.Cons:  Picture quality - Compared with the sharp, beautiful pictures I took with my Nikon (many people have been surprised when I told them my pictures were taken with a point-and-shoot, not an SLR), this camera falls very short in all but the macro setting, so far.  I have not tried any portraits yet, and judging by other reviews those should be good as well.  However, I take a lot of landscape photos, and this is where the X-S1 really comes up short.  The color is good, but none of the edges are sharp, so cropping or enlarging the landscapes is out of the question.  So far mid range still-life photos have been underwhelming as well.  I am hoping that more practice with the manual settings on the camera will help me resolve some of these issues.Overall, I would only recommend this camera at Black Friday pricing.", "Date": "December 8, 2013"}, {"Title": "Late to the Party - a Pro reviews the fuji x-s1", "Author": "Elliot Madriss", "ReviewID": "R2Q3Z0MQ0622WT", "Overall": "3.0", "Content": "Late to the Party - a Pro reviews the Fuji X-S1I am a professional photographer living and working in Albuquerque, NM - a very difficult photo market. I use a pro Nikon rig for my business but use smaller cameras for my landscape work etc. Over the years I have owned a myriad of digital cameras from Canon, Nikon and Panasonic. The Fuji X-S1 was a failed product offering by this company - its very high price tag and various operational issues predetermined its fate in the marketplace. However, now it is quite the bargain. The photo bargain of 2012 was the Panasonic GH2 at $500.00 - in 2013 it is the X-S1 at $350.00. This review will shed some light on the camera's problems and highlights - I will also add an application section and a fun prediction section as well. Lets get started!!Why the Fuji -X1 was not worth $800.00 at the time of release - remember it was touted as a \"Made in Japan\" high-end product (I admit that I am being nick-picky in my evaluations):1. Manufacturing issues - the battery and SD card doors, while functional, are of a flimsy design - the ones on the GH3, on the other hand, are very solid and robust2. Lens - the lens has resolution/sharpness issues - Pop Photo clocked it at 1670 lines while Shutterbug found its resolution at 1800 plus lines - these test results are reflected in the field as well - images could be sharper from this lens - APS-C and MFT cameras are much higher than this3. Software/operation clitches - this camera has some very strange operational abnormalities - the EVF sometimes does not show how the real image will appear; the image will sometimes freeze in the viewfinder; images black out during high speed shooting; the camera sometimes has shutter lag - all of these issues speak of a camera that was not fully field tested, despite what the Fuji product web site says - all of these issues should have been addressed before the camera was released4. Orb problem - fixed after release - serial #23 and above5. Len droop - fixed after release - serial #23 and above6. Low contrast images - even with the Velvia mode, images are not vibrant out of the camera7. Poor sharpness - all images need sharpness adjustments and many are major8. Poor continuous auto focus - camera cannot be used effectively for high speed shooting like sports, BIF etc.9. Poor Raw files - I have not seen a raw file that could be improved upon to look better than the Jpegs out of the camera - this is unusual10. Camera strap - of poor quality11. Poor implementation of video mode - no control over audio - no headphone jack12. Noisy sensor: the images have noise even at 100 ISO - see applications section13. Metering problems - the camera has problems metering in some high contrast scenes even with exposure compensation - manual exposure is needed in these circumstances14. Poor buffer - long in-camera write times with jpeg+raw or even just jpegs$800 is a lot to pay for these problems - but for $350? - the steal of the year!Why this camera is a bargain at $350.00:1. The lens - you are getting a 624mm for this low price - the sharpness of this lens reminds me of the 100-300mm from Panasonic, which I owned for a while. An aside: using the Panasonic lens is a lesson in frustration. The zoom mechanism of the lens is not smooth and is difficult to use - it seems all examples of this lens have the problem and Panasonic has refused to address it - here is a company with a Nikonism. The Fuji's zoom mechanism, on the other hand, is smooth and a joy to use. I just photographed some beautiful and majesticSandhill cranes - these birds are a very tough subject because they are always moving (feeding) and you only can get within 30-60 feet of them because they are so wary of predators. The results I obtained during this shoot, using the X-S1, were better than the GH2/100-300mm combo or the GH3/45-200 combo.Nikonism what is a Nikonism? This may be a word I have coined and one you are free to use - here is its definition: Nikonism - Definition 1: A company whose operating strategy/behavior centers upon greed, cost cutting and unnecessary austerity measures rather than providing the products/service and value that customers want and need. Definition 2: A company like Nikon2. EVF - the EVF is a joy to use and it is better than the ones I have used on the Panasonic G1, GH2, and GH3 - I see no distortion/smearing in the viewfinder but sometimes the image you view is not the one you ultimately get, which is definitely a problem in the field. A tip on using the GH3's EVF - it has a tendency to have a distorted/smeared viewing experience. Lately, on a whim, I took off my glasses and viola - the problem disappeared. So if you own a GH3, take off your glasses, readjust the diopter and see if the image improves through the EVF3. Macro capabilities - you just might be able to replace your macro lenses with this camera - proper handling techniques and lighting are necessary to get the most out of the camera's macro abilities4. Usable image quality - it reminds me of a girl friend who was very high maintenance - you had to do a lot to get a satisfying result!! Post processing is a prerequisite to owning this camera - 2  applications I would highly recommend are Imagenomic for noise reduction and Perfectly Clear to improve upon the contrast and sharpness of the images5. Excellent battery: I have shot continuously for over 4 hours with no drop in the battery display icon - DO NOT buy Fuji batteries (a Nikonism if there every was one - Fuji batteries cost 3 times as much as what you can get from third party companies) - buy on Amazon for a fraction of the price and they work just as well.6. No vignetting - my very expensive Nikon lenses have vignetting but this lens has none7. No chromatic aberrations8. The body - excellent design and low weight - it actually reminds me of a more robust GH3 body - perfectly balanced for monopod workNow for some application tips1. ISO - you will always get the best image quality out of the camera at 100 ISO - however, the images clean up pretty well at 8002. Image size - always use Large3. Raw - I initially shot in raw but have not seen an image in raw that is better than the Jpegs out of the camera - shoot in Jpeg mode4. Noise reduction/ sharpness - this is the most important setting in the camera - the noise reduction engine seems to be always on so it is a matter of balancing the sharpness and noise reduction settings to get the best image quality out of the camera - - I use sharpness at high and noise reduction at standard5. Make use of the Custom setting mode - it really saves on time and you have the ability to save 3 settings, more than most pro cameras6. Post processing is a must on this camera to get professional results - the key is to remove the noise before increasing the contrast and applying sharpening to the image - noise reduction must be applied first so that sharpening will not intensify the noise7. The images out of this camera do not lend themselves well to pixel peeping, especially at 100%!! View in Photoshop at \"fit to print\" or at a navigator setting of 33% - many of the anomalies previously explained will not be seen printed out - this camera will make fine 8x10 or 11x14 prints - with extra care and proper techniques, you could get a good 16x20 print8. This is a camera to use and experiment with - the images out of this camera, from the web sites I have visited, are mediocre at best and show a lack of skill and understanding of what the camera can deliver. Approach as if you were exposing for slide film! That's correct!!9. Expose for the shadows - there can be some noise in the shadows that can be difficult to remove - expose for these areas without blowing out your highlights10. High contrast scenes can baffle the exposure meter of this camera - use manual mode for these types of photographs and the auto mode for run and gun photos, where you do not have time to setup the camera properlyPrediction - my crystal ball for 2014The Sony RX10 in 2014 will be that year's bargain, selling for $600-$700. The reason is that the camera is already showing issues such as poor high ISO image quality, very high asking price of $1300 (a pro level price IMHO), lower prices for Christmas, slow zoom times, problems with the movie codex, T.Hogan indicates that it is really a 12-14 mega pixel camera with regards to realistic print sizes, Nikonisms in the form of a missing battery charger and no advanced printed manual - the only pics on the internet that I have seen are very crappy snapshots - I have not seen any pro level images off this camera and I have been seriously following the camera's progress - pros may not be buying this camera .Fuji execs must be watching the sales of the RX10 very carefully. Fuji knows how to build superzoom cameras but may not try again if sales of the RX 10 are poor. I think they will be.But then again....The Future (we can dream, can't we?!!)Car companies have big mega parties to show off what their respective technologies can deliver - some of these innovations eventually find their way into real production vehicles. Camera companies should have a similar show in Las Vegas, where else? So for the first C3 (Creative Camera Construction) conference of 2015, I present:The Fuji X-S5 - also know as the DSLR Killer!Today (10/30/2015), Fuji has announced the new X-S5 super/super zoom camera that has the real potential of making all other cameras obsolete. Here is a breakdown of some of its features - some completely revolutionary:1.  The Lens: 18-500mm 2.8mm lens - the first super wide zoom lens in a camera - unmatched sharpness at all apertures and focal lengths2. The sensor: Through the use of adaptive optics, new computer algorithms and a new honey-combed, multi-tiered designed sensor array, Fuji has created the first 24 mega pixel sensor to have the same noise characteristics at ISO 6400 as at 100 ISO. Images taken are completely noise free, with no loss in resolution.3. Body construction - Fuji has scoured the Earth to find geniuses in the fields of material sciences, computer/software development, and optics to create a real revolution in the camera business. Fuji has figured out how to use extremely low weight graphite composites to make a truly low weight and low profile camera - the camera weighs less than 2 lbs.4. Extremely High Speed Continuous AF - Fuji has found a way to process light so that 15fps high speed AF is now a reality - this is the camera all pros will be using for the 2016 Superbowl! 95% auto focus accuracy is guaranteedThe camera was released in 2016 and proved to be an absolute game changer. Nikon was totally unprepared to compete and as a result has filed for Chapter 11 bankruptcy - their camera assets will be absorbed into the Sony corporation and their camera business will now be called \"Sony/Nikon\".Well there you have it. I hope this has been a helpful and enjoyable review. Now get outside and SHOOOOT!", "Date": "December 30, 2013"}, {"Title": "Fuji Wonder", "Author": "greybear57", "ReviewID": "R2TDSO6X47RQZD", "Overall": "5.0", "Content": "Beautiful piece of craftsmanship.Like the feel like the versitility.Smooth easy to get used to.Got a lot of stuff to learn,the book that came with it is not very informative.But I'll plug along and learn as i use it.It is quality so I don't mind playing with it.", "Date": "May 10, 2012"}, {"Title": "Not a camera for those who wear glasses", "Author": "R. M. Smith", "ReviewID": "R3M4ETLJ2FW7CL", "Overall": "2.0", "Content": "I was looking for a travel camera that would be more capable than a pocket camera but lighter, smaller, and less awkward than a DSLR kit.  I was intrigued by the X-S1's huge zoom ratio, the separate buttons for frequently adjusted settings, light weight and smaller size compared to a DSLR, and the rave reviews for the X-100.  I'd hoped for some or most of the X-100's claimed picture quality.Long story short, I've just sent the camera back to Amazon.  I prefer to use a viewfinder.  I tolerate using the rear screen on my pocket cameras because that's the way they are.  With the X-S1, every time I put the camera to my eye / glasses, I had to move the camera in relation to my eye two or three times to get the electronic viewfinder to turn on.  Then it had to focus, which took some more time.  All this really gets in the way of composing a picture and getting a shot.  I'd have had trouble with anything that moved faster than a tree.My initial impression of the camera was favorable.  The camera felt good in my hands, if a bit small compared to the DSLR I'm used to.  The rubberized coating made it feel like I always had a secure grip on it.  The separate adjusting buttons were as user friendly as I'd hoped.  The color renditions in random shots around the inside of the house seemed true.  It weighed only 2/3 what my D7000 and 16-85 lens weigh and is distictly smaller, not to mention what happens when I put the 70-300 lens on.  The camera cost only about a third of what the D7000 and 16-85 lens cost and maybe a fifth or less of the cost of the whole D-7000 kit.I went out to two of the more scenic overlooks in the Columbia River Gorge and did a shoot-off between the two cameras, shooting the same scenes at the same zoom setting with both cameras on P Auto.  The image stabilization of the X-S1 is about the same as the D7000.  The D7000 seems to focus better out around 200mm and had better color renditions across the board. The X-S1 pictures as viewed on my monitor looked kind of flat by comparison.  The X-S1 was noticably slower writing to the memory card too.  All in all, the D7000 did better, which was no big surprise but I expected the X-S1 to be closer than it turned out to be.All through this I struggled with the electronic viewfinder and my glasses. So, in the end, disappointed, I've sent it back.", "Date": "February 28, 2012"}, {"Title": "Good all in one bridge camera", "Author": "James Parker", "ReviewID": "R3JMXFS5REXDMW", "Overall": "4.0", "Content": "Its a good all in one solution, especially for those times you don't want to carry a DSLR and a bunch of lenses. Not great at action shots and of course not perfect, but all in all a good camera if you get it at a good price.", "Date": "May 18, 2014"}, {"Title": "BEAUTIFUL!!", "Author": "Johnna Davis", "ReviewID": "R1PU0B0W8FSFRA", "Overall": "5.0", "Content": "What a great camera! I purchased for my daughter as a bridge DSLR, it is fairly easy to use and takes amazing pictures!!", "Date": "February 23, 2014"}, {"Title": "Its just OK", "Author": "R Hogan", "ReviewID": "R2ESQZLI4YD2Y5", "Overall": "3.0", "Content": "I Really wanted to Love this camera as most of the reviews were Good,Camera has a large sensor others lack which is important for a big zoom.But after taking several hundred shots I found just about every pic to look a little plastic which is a shame,Also as a fluke one side of the stereo mike on the camera was doa..Bummer..Might try another if they go on sale.", "Date": "December 29, 2013"}, {"Title": "My husband's choice", "Author": "Silvana L. Festa", "ReviewID": "R1QOFL5QE9IYT8", "Overall": "5.0", "Content": "A photografer recommended to my husband this camera because he said it is the best and simple to use and take great pictures.", "Date": "March 3, 2013"}, {"Title": "Disappointed with the XS1 and especially Customer Support", "Author": "AB", "ReviewID": "R2ASTQBCGSLUQR", "Overall": "2.0", "Content": "Ok, I did months of research to find out which camera would give me pretty much what I wanted, and if it didn't I would learn to work with it.  I chose the X-S1.  It had to be ordered from another related store, as the NH camera store didn't have one available.  The store owner indicated that he was very happy with Fujifilm's customer service and they go out of the way to make their customers happy.  Upon paying for the purchase, I noticed the camera serial number; it started with 14.  From research on line, an unhappy customer from Amazon indicated that he had received his X-S1 and there was a sensor issue; any serial number less than serial number beginning with 22, had this issue and he was told by Fujifilm that Amazon shouldn't have sold that camera at all.  The manager said that I had a 1 year warranty so not to worry if there was a problem.  I was skeptical, but thought that maybe not all sensors were bad, and I would give it a try.Upon getting it home, I discovered a required clip to hold the battery into the battery charger, was missing and couldn't be charged (without being creative and finding a way to do it).  I called and was told that a replacement would be sent.  In sending emails to Fujifilm and calling them directly, I got more info on the sensor issue and replicated the problem indicating I had a bad sensor.  I contacted my store again, and told them of the problem.  They called customer service and was told that I should not have been sold this camera.  He then contacted the local rep for a replacement.  Week after week I called to find out when my replacement would come in.  The manager indicated that he had talked to the rep, he had left numerous messages for the rep, and he was then calling daily and leaving messages for the rep. Finally after 3 weeks of waiting (and it could have been 4), I returned the camera for refund, and will NEVER buy a Fujifilm related product again.The above being said, I have the following comments on the camera itself.  I am coming from a Canon Powershot Pro 1, and prior to that, SLRs cameras with multiple lenses,etc.  (I have 49 years of experience with cameras)  The clip for the battery charger is required because Fujifilm is using the same battery charger for two different sized batteries.  The clip is easily lost, and the charger is not a nice convenient plug into the wall unit as Canon has.  You will have have to carry around several feet of cord for the charger - again, unlike that small compact feature from Canon that will fit into a pocket or camera bag and take up little room.I do miss the fully articulating lcd screen as I really use the view finder more, and since the screen cannot be flipped around, the screen contacts one's face and needs frequently cleaning.  (would be an issue for other cameras with the tilting lcd screen)The macro feature seems to be similar to what is currently available on cameras now - must be in wide angle to get close and to focus properly, which means small items like minerals, coins, stamps, insects, etc. you are right on top of the item, casting a show, and more importantly, a small item with a wide angle of 24mm is still a small item.  My previous camera could still zoom in when in Macro or Super Macro.  (perhaps this is the unfortunate norm now)The images are supposed to have really good resolution at lower ISOs, but when I looked at photos I had taken, they didn't seem to be as sharp as the Canon which was only 8MP.Unless I overlooked settings in the software, when downloading photos, it placed them into a folder with the download date, not when the photos were taken, which was my preference.  I also had multiple applications opening for the download of photos - the true app for download, but also a direct connection to the camera would open up allowing download from there too.  Unlike other software that I had seen, I was not able to select photos to download - it was either none or all.  Also, deleting the photos from the camera was not what I was expecting - the software didn't allow me to go and view the pics on the camera and delete all or just what I wanted.  The option for download was download all images (nothing selectable) and leave the images on the camera, or download images and delete them from the camera as well.  Personally, I like to insure the photos have been downloaded prior to deleting any images.  I learned this in the past - don't delete until one insures the images were downloaded and are fine...  (perhaps the software could be tweaked to get what I wanted, but I did look and spend some time, but never found the toggles or selections for these features)One of the major issues I found with the camera, is that I do frequently point the camera straight down towards the ground, because I am standing over something that I want to photograph.  The lense has an issue, as when you are pointing it down, the lense barrel starts to move towards the ground due to gravity and therefore, it is zooming in while you are trying to take a photo.  So, one is preparing to take the photo, the zoom is where one wants it, the hand is removed from the zoom and finger is getting ready to depress the shutter button 1/2 way, and the image one sees is becoming larger because it is zooming.  Fujifilm doesn't have a mechanism to apparently only zoom when a person is rotating the barrel only, and not just pointing it downward.  All one has to do is to turn the camera so it is pointing downward, and you can watch the lense start it's downward zooming..", "Date": "July 20, 2013"}, {"Title": "Good camera, pro feeling, nice optical zoom, but there is no stabilizer make it hard to use on the 600mm.", "Author": "W. Zhao", "ReviewID": "RUOFYY4F7YM9K", "Overall": "3.0", "Content": "This is a good optical camera, and it takes time to focus because it is manual stabilizer, you can use a tripod to take a really good picture, but the handheld is very difficult to hold it steady.I like the view finder, it is very well built, when you get it close to your eyes, it turns off the LCD display and turn on the view finder, very convenience feature that you can see through it. And the viewfinder is large enough to see.The price was $649.95 yesterday, and suddenly went down to $399.95, it was Amazon Today's Deal, but the next day, it is only $20.00 different ...", "Date": "November 18, 2013"}, {"Title": "Great Camera", "Author": "Dan Reams", "ReviewID": "R17KZLNJPEMUW4", "Overall": "4.0", "Content": "This camera has a lot to like for the price. Really enjoying the lens, you can zoom right in when you need to.", "Date": "April 23, 2014"}, {"Title": "I love it", "Author": "doji", "ReviewID": "RLFPDZ1M8AOIJ", "Overall": "5.0", "Content": "ok", "Date": "April 19, 2014"}, {"Title": "Nice camera but image quality not what I expected", "Author": "Andreas Weinrich", "ReviewID": "R2QRN8J22K7OF", "Overall": "3.0", "Content": "I like this camera in many ways, the the solid build, the manual zoom, the clear LCD's, the colors, dynamic range and low noise in the pictures, especially in low light conditions.However, I found it impossible to get pictures that were sharp when enlarged to screen resolution. Especially towards the corners images are washed out (soft) and blurry and that's why I sent the camera back.I also got a Panasonic FZ200 from Amazon simultaneously and though the noise level (graininess) is higher, even at low ISO settings, the pictures are crisp and focused.If the X-S1 had better lenses with sharper images, I would have definitely preferrd it to the FZ200.", "Date": "December 28, 2013"}, {"Title": "Good", "Author": "xiaolei", "ReviewID": "R3GTYI1P6DKWZZ", "Overall": "5.0", "Content": "I love it although it's heavy. But It is not to complicated to operate as other people said.it will be better  If it had the bag.", "Date": "November 25, 2013"}, {"Title": "Average", "Author": "Mark \"It's not about guns, It's about freedom\"", "ReviewID": "R1VN4SYEXWR11P", "Overall": "3.0", "Content": "It's an okay camera but I'm not totally happy with the sharpness of the digital images. Do seem like I have to do a little bit more postprocessing than other cameras I've used.", "Date": "April 11, 2014"}, {"Title": "Waiting for performance", "Author": "John Nickelson", "ReviewID": "R3ANT3SCKRMGB", "Overall": "4.0", "Content": "I have had the camera only two months and one of the command dials broke off with a gentle touch.  I have requested help from the seller.  Waiting for a reply.  More to come.John Nickelson", "Date": "April 6, 2014"}, {"Title": "Fun camera but not sharp", "Author": "dragon with heart", "ReviewID": "R1VDNF4MJHRLVQ", "Overall": "3.0", "Content": "I really wanted to like this camera. After reading many reviews, I was concerned about the drooping lens and focus issues. The first camera I received was a later serial number but had the drooping lens at full extension. I requested a replacement, which had a tighter lens, but it was an earlier production lot. I found that the auto-focus locked in easily, but the pictures lacked punch and clarity, even when compared to my older Panasonic DMC-FZ28. The range of the lens is fantastic and the it is great having such a smooth zoom action. It is a fairly fast lens, as well, f 2.8-5.6. It worked well in all kinds of lighting, although there was visible noise at 800 ISO and higher. In the end, though, it just didn't work for me.", "Date": "March 26, 2014"}, {"Title": "Would have given it a 5 star if the manual is not all French", "Author": "W. ZHANG \"The Office Guy\"", "ReviewID": "RDYCUNCMCNVK9", "Overall": "4.0", "Content": "The camera does everything a camera supposed to do. things are all right.the only defect is that the manual prints only French, I know French stuff are elegant, but there is only one problem with that.I am not from France, and I cant read French.", "Date": "January 25, 2014"}, {"Title": "Well it depends on what you are coming from and where you wish to go....", "Author": "J. Fried \"Book Monster\"", "ReviewID": "R1HNLNN3QAUN61", "Overall": "2.0", "Content": "Well I tried. Yes lighter than my D7000 with 18-200 and the super zoom \"fun\", but the electronic viewfinder not for me. Fuzzy once you are used to a pentaprism. The speed was just OK and did not enjoy having to choose burst mode to capture moving targets. I guess if cost is an issue and DSLR's are a bit much for you, this could be a good choice vs pocketable cameras. obviously many love it... if its your first step up to \"more\" this might well be your camera. Not sure what I was hoping for, perhaps a DSLR-ish experience in a single lens camera package...", "Date": "November 21, 2013"}, {"Title": "Heavy and large.", "Author": "Amazon Customer", "ReviewID": "R3E9Y3Y966BUY8", "Overall": "3.0", "Content": "I picked this camera up twice and sold or returned it both times. I was wanting something with both great telephoto reach and a nice size sensor. But this thing is a solid chunk. It's far larger and heavier than my Nikon D5200. Plus it's been knocking around for a few years, the technology has fallen behind. Bottom line is, it stayed in the camera bag. With a 24mp camera the crop factor makes up for the lack of zoom on the longest lens I can afford for my Nikon. I sold this and got the Sony WX350 for $200 on Ebay. It goes out to 500mm and it miniscule. The sensor is smaller but the images are still great because the tech has moved it up a notch. Plus with 20.4 MP I don't loose anything on telephoto reach because of the cropping of the larger image. I wanted to like it.", "Date": "April 24, 2014"}, {"Title": "Performance Does Not Match the Probably Best of Class Build Quality", "Author": "C. Pilot", "ReviewID": "R2RW1DSPVT2O71", "Overall": "2.0", "Content": "A little background:  I'm an avid amateur photographer who spent the last five years or so alternating between DSLR systems and \"Prosumer\" point-n-shoot (usually superzoom) cameras as my go-to camera.  My equipment path (those worth mentioning) has been Olympus E-500 DSLR system, Panasonic Lumix FZ50 (prosumer point-n-shoot), Pentax KX DSLR system, and now the Panasonic Lumix FZ200 (prosumer point-n-shoot).  I really like the Panasonic FZ200, and consider it a near perfect camera, even over my two DSLR systems, but there are exactly two things that I miss from my previous three cameras that the FZ200 does not offer.  These things are what piqued my interest in the Fuji X-S1 -- specifically, the manual zoom and focus rings.I find myself shooting a lot of video these days in addition to still pics.  I realize that zooming in a video is rather amateur, but there are some times that it's necessary even in more professional videos, and with a manual zoom ring you can do it slower and make it look a lot better than the electronic toggle switch zoom of the Panasonic FZ200 (which zooms pretty fast).  Plus, like I said, I am an amateur, so I shoot plenty of videos that are just for the family, so it doesn't really matter about zooming -- I just don't want to make people dizzy with the typical fast electronic zoom.  So, wow...1080p video AND a manual zoom ring, all in a much lighter kit than a DSLR!  Just what I've been looking for and at less than 50% of the original MSRP!  So, despite my affection and 99% satisfaction with the Panasonic FZ200, I decided to give the Fuji X-S1 a try.  Unfortunately, it was mostly a disappointment for me.First, the positives:- Price!  I know this camera is basically end-of-life, but the original $800 MSRP was just crazy expensive.  The current price gives you a LOT of camera for the money.- Exceptional build quality and ergonomics!- Nice DSLR look.  Most people will assume it is a DSLR, even with relatively close inspection.- Excellent, smooth manual zoom and focus rings.  Better than any of my DSLR lenses, and I've owned some pretty pricey ones.- Nice articulating LCD (although it does not flip out to the side).- Excellent electronic view finder (EVF) -- probably the best I have ever seen.- Nice battery with decent charge life.- Large sensor (for a point-n-shoot).- Very nice rubberized finish over the entire body of the camera, and it seemed to be fairly well sealed/weather resistant.- Almost everything on the camera seems to be metal -- definitely not the usual plastic feel.- Standard 3.5mm external mic port, HDMI, analog video out, and wired remote.- TTL hotshoe.- 1080p video and the ability to shoot slow-motion high framerate video at lower resolution.Now the negatives:- Image Stabilization.  It's just not very good at all, and from mid-zoom range to full zoom it doesn't seem to work at all.  I tried the various IS settings, but none of the combinations improved it.  This is one place that my Panasonic FZ200 excels VASTLY over the Fuji X-S1.- Auto Focus.  To clarify, the auto focus seems to work well enough for still shots, but when shooting video the auto focus is horrible, rendering the video mode (something I really want/need) almost unusable (unless you manually focus).  When first starting the video, it focuses fairly reliably, but if you zoom or even just pan, the rest of your video will be blurry and unfocused because the auto focus just hunts and hunts and hunts some more.  I thought this might just occur in mid to low light, but unfortunately the exact same thing occurs even in bright sunlight outdoors.  This was a deal-killer for me, because video is an important feature for me, but if auto focus does not work well in video mode, that puts me right back in the same situation with most modern DSLR video (manual focus only).  My Panasonic FZ200 shoots really nice 1080p video and has no problems at all with auto focus.- Sensor and Lens -- I'm unimpressed.  Admittedly, I might be spoiled by my Panasonic FZ200's Leica spec f2.8 throughout the entire zoom range, but the Panasonic FZ200's sensor is much smaller and I feel that should even the two cameras out a bit in terms of image quality, but it does not.  The images from the Fuji X-S1 are noisey (and typically blurry from the poor image stabilization), and no matter how I tweaked the settings (even using recommendations from people who are happy with this camera), I could not get acceptable images out of it.  Now, I had to also tweak my Panasonic FZ200's settings to get the best images out of it, so neither camera performs perfectly straight out of the box, but I just couldn't figure out a good tweaking combination for the X-S1, even when using the recommended settings from experienced users of this camera.  I tried the EXR features, as well as other auto settings/modes to see if the camera was smarter than me about figuring out the best settings, but I actually had more success (if you can call it that) with my settings than the camera's auto modes.-----------------------------------------EDIT:  I remembered another negative that probably should be mentioned...- The X-S1's firmware doesn't seem to properly recognize (or at least prioritize the automatic settings) when the onboard flash is being used.  For example, I typically shoot in Aperture priority mode and with this camera (basically any non-DSLR) I usually set the ISO at auto with an upper limit of 800.  With a DSLR I can set the auto ISO limit much higher like 1600 or even 3200.  One of the test shots I always do when I first get a camera is evening, indoors in my living room with an overhead light on and two lamps, shooting at max zoom from across the room with the subject being the face of my grandfather clock.  I find the white face, numbers and notches, as well as the woodgrain/carving to be an excellent check for sharp focus, noise, etc.  Almost every camera that is not a DSLR performs this test mediocre at best.  My Pentax KX DSLR does it rather well, even without using a flash.  My Panasonic FZ200 does it pretty well with the IS and focus performing very well but there's significant noise in the image and mottling from the in-camera noise reduction attempting to correct it.  The X-S1 does this test shot the worst of any camera I've owned.  The X-S1 has a very difficult time focusing on the clock face (even with the focus assist light), but even once it finally focuses the shot is blurry because of the poor image stabilization, especially at the long end of the zoom.  So, then I always try the same shot with the onboard flash.  All the cameras end up with much better results, but then I noticed the X-S1 behaving very differently from the other cameras.  With all my other cameras when set as described above, when I pop up the onboard flash, the auto ISO always drops down to at least the 400 range, if not all the way down to 100.  The X-S1 remained at auto ISO limit of 800.  Even after snapping the picture, when I looked at the info of the image, it was at 800 ISO.  So I bumped up the auto ISO limit on the X-S1 to 1600 and tried the shot again using the onboard flash.  The image was recorded at 1600 ISO -- I expected it to stay at 800.  I verified that I had indeed chosen the auto ISO setting and not just manually set the ISO to 1600, and it was definitely on auto ISO with a 1600 limit.  So I bumped it up the auto ISO to a limit of 3200, and it recorded the image at 3200.  I then manually set the ISO at 100 and there was a noticeable increase in the onboard flash output.  I then manually set the ISO at 1600 and there was a noticeable decrease in the onboard flash output.  So, what's going on is that the X-S1 doesn't seem to recognize when the onboard flash is being used, or at least it does not prioritize the automatic settings to lower the ISO because the onboard flash is being used, which would result in a much higher quality image.  I did not have an external TTL flash for the X-S1 to see if it works the same way as the onboard flash, but I suspect it will.  I also did not think to try the same scenario with the camera set in full auto mode, because I never shoot a camera in full auto mode, but it would be interesting to see how the X-S1 prioritizes the automatic settings (including the onboard flash) when in full auto mode.To me this explains and further justifies my closing comments below -- that I really did not expect such basic function/feature issues with this camera.  No camera is perfect -- every camera has its own set of issues and resulting compromises, but I was surprised and disappointed that this (in every other way superior) camera had such basic issues as it did.-----------------------------------------All in all, I am very disappointed.  I really had high hopes for this camera, and never expected to encounter those specific three (Edit: now four) negatives.  I never expected it to be the perfect camera (none ever are), but I expected minor annoyances that I would have to compromise on -- not glaringly poor basic digital camera features.  The Panasonic FZ200 is VASTLY superior in image stabilization, auto focus, lens, and (I know it doesn't make sense) even sensor.  If looking for a prosumer point-n-shoot camera, I recommend going with the Panasonic FZ200 instead of the Fuji X-S1.", "Date": "May 5, 2014"}, {"Title": "Do not buy this camera from Amazon US", "Author": "Philippe Laurent", "ReviewID": "R20ZN6NQTS65VZ", "Overall": "1.0", "Content": "The one star rating is not directly for the product but for Amazon who sold me on February 21 2013 a camera with the (well known) bad sensor (serial number 21xxx). I called Fujifilm and they told me that I never should have been sold this camera at this date. I now have to send the camera to Fujifilm for a sensor replacement.My advice: do not buy this camera from Amazon unless you can be guaranteed that the serial number is 22xxx or above.", "Date": "April 12, 2013"}, {"Title": "Nice but not ready for prime time, yet!", "Author": "Frank D. Nave \"CAoh\"", "ReviewID": "RQJ1PC34YGFF4", "Overall": "4.0", "Content": "I bought this camera to upgrade my wonderful Finepix s100fs and it was. It felt great, had good imagery, color, burst etc but the controversy over \"orbs\" concerned me to the point of returning the camera and switch over to Canon 60D DSLR", "Date": "May 1, 2012"}, {"Title": "It's ok, but you NEED to know this first...", "Author": "Luke Chavers \"- Luke\"", "ReviewID": "R1SPN2APSF7B6U", "Overall": "2.0", "Content": "Quick Intro:I've had my X-S1 for several months now.  All in all, its a nice little camera for the novice (like myself) who doesn't need a camera that fits in the credit card slots of your wallet.  Its large, bulky, (but not unreasonably so) and feels like a real camera when you hold it.Pros:- Higher Res than Moms and Dads will ever need- Awesome Manual Zoom- Every feature I could possibly think of, and then 65 more- As durable as anyone could expect a camera to beInterlude:I really cannot understand why these consumer level cameras have so many settings and adjustments.  Once I figured out that it has 6 or 7 different auto modes, each for a different context, and that between those the camera can do 95% of the work for you and take flawless photos, I lost the User's Manual.Cons:Only one worth mentioning, but it turned out to be HUGE.  I wish someone would have warned me about it before I bought the camera.. but I probably would have just ignored them anyway.About a month ago its tripod tipped over and the LCD was shattered, along with the glass cover for it.  My fault, I'm dumb... totally my fault... I wouldn't expect the camera to withstand that fall without damage, so nothing against Fuji here.So, I ordered one (a LCD) off of eBay for $30 from China.  It arrived in a few weeks and I installed it, perfect fit, about as difficult as an iPhone LCD replacement, excellent everything, great.  LCD restored.  I didn't think, although I should have known, that the glass cover is not actually part of the LCD.Turns out, I cannot find that little piece of glass ANYWHERE.  So, I went to Fuji's website and found the closest \"Authorized Repair Whatever\" and emailed them:\"We do not sell parts....I would try Fuji for the part you need..their # is: (800) 659-3854.\"I thought he meant that he couldn't sell me the part because he'd need to be the one to install it.  Nope, he can't get the part AT ALL.  So, I called Fuji at the number he gave me.  According to the voice menu guy, I should press option 1, then 3, if \"You need to buy parts.\", so I complied..The not-nice lady I spoke with, after 5 or so minutes of being on hold (not too bad) let me explain the whole thing before saying:\"Yeah, we don't sell parts.. you'll have to mail that in.. let me transfer you.. <click>\"That put me on hold for about 10-15 minutes, which generally annoyed me, but whatever.So this not-nice guy took my call and let me explain what was going wrong.  He then said:\"Ok, the first step is to go to our website and find the 'Repair Request' form.  Mail that in with your camera to the NJ repair center.  You can find it on Google, just type...\"Had to cut him off on the 'How to use Google speech', sorry, \"Ok, so, I have to mail it in I guess.. what's that process look like?  How much will this cost me?\"\"Well, you mail it in and after the camera arrives we'll take a look at it and email you a price to fix it.\", he said.\"So, you can't give me a ball park?\", I asked.\"No.\", he said, singularly.\"What's the turn around on this?\", I asked.\"Well the time it waits for valuation varies sharply, it just depends on our workload, but once you get the valuation, approve the repair, and pay.. it takes about 10-15 business days, and we'll ship it back\".I said, \"You know, the little piece of glass I need is literally about a $1 problem, and I will gladly pay you 20x that, but you just described a month and a half long, expensive sounding, process.  Is there no way I can just buy that little piece?  It literally just snaps in!\"\"No, can't help you there, you have to send it in.\"--I tried to approach this with hat in hand, Fuji did not drop the camera, nor did they say it was \"droppable\".  So, I tried to remain courteous throughout the process.So here's the warning:  If you break any part, and I mean ANY part of this camera, there is ONE place in NJ that can get you the parts, and you have to get rid of your camera for a month+ and go through all sorts of nonsense if you want it fixed.Most negative reviews for products are people talking about either really rare problems or scenarios.. or received a defective product that was promptly replaced.  I usually ignore those edge cases as a personal policy.  However, in my case this appears to be standard practice at Fuji.. and I imagine that at least a significant percentage of people will eventually have something on this camera break.When that happens, you're not going to be happy about what comes next...", "Date": "March 4, 2014"}, {"Title": "Not Fuji great", "Author": "Shelly the Geek", "ReviewID": "R9XEYK8I4KMX9", "Overall": "3.0", "Content": "Has Very good video but pics are not up to par with other Fuji products. A solid build and heavy to hold", "Date": "November 17, 2012"}, {"Title": "Stay away from Fuji", "Author": "Van", "ReviewID": "R3KV4SZINP47JX", "Overall": "2.0", "Content": "Fuji has several design flaws caused by cheap manufacturing practices.  I myself and several friends have had the exact same failure on the power switch, that makes the camera useless.  When under warranty Fuji will fix it if you pay for shipping, but then you have paid over full price for a refurbished item.  A say this with disgust, because I had less than fifty photos on mine when it broke; the technician said it was a common problem and an easy fix.  They also said they would next day return the item so I would have it for a trip that weekend.  I ended up buying a new camera to replace a virtually brand new camera that should have been great.  Now I have a few hundred dollar paper weight.", "Date": "November 14, 2013"}, {"Title": "Camera Has Promise But Many Flaws", "Author": "DonD \"Retired IT Systems Specialist\"", "ReviewID": "R3HCL8BMIAB8V5", "Overall": "2.0", "Content": "The Good: Better image quality, better build, good feature setThe Bad: Specular highlight distortion (orbs - white blobs), sagging lens that is thrown out of focus, blue flare in lens.Check out [...]  for sample images and reviews.The Ugly: $800", "Date": "February 19, 2012"}, {"Title": "Nothing Worked", "Author": "Willard C. McCartney", "ReviewID": "R1T1XIJXJUFK93", "Overall": "1.0", "Content": "It would not turn on and the CD would not download-it did look great but I had hoped that it would work.  Amazon's return policy and procedure however gets 5 stars", "Date": "February 23, 2014"}, {"Title": "The XS-1 is worth every cent.", "Author": "Rafe Lavine", "ReviewID": "R20B9PY6A9KDFA", "Overall": "1.0", "Content": "More than met my expectations. A \"Beast\" of a bridge camera. And SERIOUS bang for the buck! Build quality too is fantastic.", "Date": "January 16, 2014"}, {"Title": "fuji x - s1", "Author": "Jean Pierre Serre", "ReviewID": "R2TMF276VGO7VO", "Overall": "1.0", "Content": "I don't know if I like it yet.  I've only had it for a week or so and it's been pretty freaking cold around here.  Not many photo opps.  ask me in a couple of months.", "Date": "January 4, 2014"}], "ProductInfo": {"Price": "$699.00", "Features": "2/3 inches - 12MP EXR CMOS Sensor\nHigh Quality Fujinon 26x Manual Optical Zoom Lens\nLarge High Performance EVF\n3.0 inches Tilting LCD\nAll-Metal Dials", "Name": "Fujifilm X-S1 12MP EXR CMOS Digital Camera with Fujinon F2.8 to F5.6 Telephoto Lens and Ultra-Smooth 26x Manual Zoom (24-624mm)", "ImgURL": "http://ecx.images-amazon.com/images/I/51nAvsSJtTL._SY300_.jpg", "ProductID": "B006T7QRN2"}}