{"Reviews": [{"Title": "Works fine for an inexpensive camera", "Author": "Moira French", "ReviewID": "RFM7GYFF9W1CI", "Overall": "4.0", "Content": "This camera's photos are 3 megabytes on the default setting, which means they are very clear but to post them on Facebook you have to re-size them.  My first attempts at re-sizing produced fuzzy photos but I finally figured out  how to re-size easily - open the photo with Paint, and resize down to 1200 x 800.  Once I figured that out, the photos I put on Facebook were much sharper.  I experimented a lot taking pictures in every type of light and found that using the Automatic settings seems to work best in 95% of situations.  However, for taking photos of flowers close up, I use Program, Super Macro and they are truly superb.  I have no complaints.  Now, I paid less than $80 for this camera, and I'm sure a better camera would take better photos.  BUT, I have to say that it is really perfectly adequate for my needs.  Just be sure and read the manual because there are settings you can use for the beach, snow, night time, moving objects, low light, etc. and you'll get more out of the camera if you are familiar with the different settings.", "Date": "June 20, 2012"}, {"Title": "Great Value & Easy to Use, But Very Bad Nighttime Photos", "Author": "C. Clay \"drakkar91\"", "ReviewID": "RMHFRVTEXRYZE", "Overall": "3.0", "Content": "I was replacing an old Kodak Easyshare, so at $80, this camera seemed like a steal. It's easy to setup, offers 720HD video with sound (and it's good quality), but it can't take a night picture (such as a cityscape) to save it's life. I've tried every setting in both manual and automatic modes, and you have to take 5 or 6 photo's to possibly get 1 good one that is clear. For photo's in light, no problem! The image in your nice size LCD for night photo's is the one I desire, but never the one I get. Battery life is very good, including when you use video. The video feature is easy to use, BUT, you must zoom in or out BEFORE you start the video recording. Once recording, you cannot zoom. It is a great deal, but if I had to do it all over again I would make sure the camera could take night pictures, and that the video featured zoom while recording. Again, great deal, easy to use, but 1 or 2 major flaws.  Simply because of the inability to take a good night shot, I would not recommend to a friend to get one.", "Date": "August 29, 2012"}, {"Title": "Not bad for a cheap supercompact", "Author": "varnav", "ReviewID": "R3SYFMFN5JCOTJ", "Overall": "5.0", "Content": "I lost my DSLR on vacation and needed a fast cheap replacement. Supercompacts are usually not performing well, especially those with high megapixel count. But after using $1500 DSLR I must admit that output photos from this camera are not bad at all. It's good in it's automatics and is able to produce nice looking colorful and well-lit photos with just press of a button. But pay attention - it's weakness is indoor photos and this camera works fine on daylight only.", "Date": "August 27, 2012"}, {"Title": "Very pleased w/ Olympus VG-160", "Author": "Rough Customer", "ReviewID": "RYQI7G207CO4R", "Overall": "5.0", "Content": "I am very happy with this point and shoot digital camera.  The MAIN reason I picked this camera over many other possibles was this camera's ability for Macro photography using a point and shoot.  It also has a great wide angle capable lens, a fast deployment when the power button is pushed, great colors on photos, and easty to use controls!  The rechargable battery is saving me a ton of money on the throw away lithium batteries in my old pt. and shoot camera (at $12 per 4 batts.).  This new Olympus camera uses 4gig memory chips and I typically have set the picture size lower end of the scale for most of my work.  Very much endorse this camera as a great pt. and shoot for the vacation, home, business.", "Date": "October 31, 2012"}, {"Title": "What a bargain", "Author": "Tim Dickson", "ReviewID": "RK2MTYOCVYXGC", "Overall": "4.0", "Content": "I think you definitely get more than what you pay for. Great camera.. very mobile, can just fit about anywhere. Picture and video quality are great. As far as shipping goes, got it earlier then expected. All around good camera.", "Date": "October 12, 2012"}, {"Title": "Nice Little Camera", "Author": "Leola", "ReviewID": "RDJZYS7AE5T3J", "Overall": "5.0", "Content": "I enjoy this nice little camera. The controls are easy to use and the picture quality is great. I enjoy the video quality as well. It was worth the price and I haven't came across any malfunctions.", "Date": "October 16, 2012"}, {"Title": "Great little camera", "Author": "Amazon Customer", "ReviewID": "R3D7K4F2M3BGZU", "Overall": "5.0", "Content": "I purchased this camera to replace an Olympus that I loved using and had lived a very long life.  This camera is a great little camera and takes wonderful shots.  I love it and the color is awesome.", "Date": "July 12, 2012"}, {"Title": "Lovely camera, olympus all the way!", "Author": "Lizzie", "ReviewID": "R2YMBNNAS8UYPW", "Overall": "5.0", "Content": "I always buy olympus and this new model does not disappoint! Love how user friendly it is, and it is even easier to hit record on this one. I would highly recommend. The one time I decided to try another brand it broke on me after only 2 months, so I will be sticking with Olympus and watching for the next model!", "Date": "July 2, 2012"}, {"Title": "Review or Olympus VG-160 Digital Camera", "Author": "TrueGreen", "ReviewID": "R21TEQIV1R8VUU", "Overall": "4.0", "Content": "First of all I would rate this camera probably as 4 1/2 stars at this time. I've just started to set it up and use it so can't really evaluate it fully.This camera is similar to others in it's class. It seems a bit flimsy, but that is probably because I'm used to the old type of camera. If you read the manual it will seem like this camera is complicated to use, but it really isn't. You can set it to just work automatically if you want. If you like to fiddle with settings you can do this too.What made me get this camera over another similar one is that you can charge the battery, using an AC adapter supplied) with a supplied USB cable, without having to remove the battery from the camera. With the other camera you had to remove the battery to recharge it this way. You can also recharge the battery by connecting it to your computer with the USB cable, but this takes much longer.A few suggestions:1.  Before  purchasing or receiving the camera I would download the manual from the Olympus Website. It gives you an idea of what it is like. Also, the camera comes with a \"quick start\" guide which is a bit hard to read.2.  This camera needs a media card which is not supplied. When you buy the camera from Amazon it suggests you purchase a media card at the same time and this I would urge you to do. It needs a certain type so you can check that with manual you downloaded. Amazon does show the correct card. I purchased one that is a 16GB SDHC Transcend Flash Memory Card.3.  Amazon also suggests that you buy a case and this is also listed with the camera. I bought the case that was listed. The case is good because it will protect the viewing screen on back of the camera. By buying all three at once you save the shipping charge on the less expensive items.4.  The camera comes with a CD-Rom. You don't need it for the drivers as your computer will get the drivers when you plug into it with the USB cable. It does supply two programs to manage your pictures. I did install these, but they are not needed if you have other image editing software. The camera shows as a disc on your computer and you can just drop and drag the images to your own custom folder and go from there. I did install the programs mentioned, but have not used them yet. You can always install them and remove them later.5.  The most useful feature of the CD-Rom is that you can use it to register your camera online.6.  The CD also will download a full manual which is the same as the one downloaded from the Olympus website.7.  The camera is about the size of a playing card and not very thick so it is easy to carry around. The buttons are small, but it is no problem to use them.8.  In summary I'm pretty sure I will like this camera as I get used to it. I will help if you have a dog who likes her picture taken when taking pictures of her. Mine doesn't, but the camera also works as a video camera, so you might be able to catch them that way. No problem if your dog or cat will stay still.", "Date": "January 10, 2013"}, {"Title": "Amazing!", "Author": "C. D. Olsen \"toshirodragon\"", "ReviewID": "R18DMAUP41M79Y", "Overall": "4.0", "Content": "This camera has issues up the wazoo with exposure, lighting, white balance but I'm telling you it is an amazing little compact camera. It spent some TWO hours in the bottom of my water filled swamp cooler and after a couple hours of drying and defogging of the lens with my hair dryer it STILL WORKS!", "Date": "July 18, 2013"}, {"Title": "Very happy with this camera!", "Author": "sherry", "ReviewID": "R1QVCVYJZ8YBHV", "Overall": "5.0", "Content": "I bought this camera for my daughter on her birthday. It is a beautiful shade of orange, it is compact and takes great pictures. It was also well priced. I am very happy with the camera and my daughter loves it!!", "Date": "October 17, 2012"}, {"Title": "Got it for our 3 year old daughter", "Author": "Scott Ames", "ReviewID": "R1V0DHWNGL5V0F", "Overall": "4.0", "Content": "We got this as a Christmas present for our 3 year old daughter.  I read the reviews for many \"kids\" cameras and found that all of them took horrible, blurry, low resolution pictures.  This camera takes really good pictures and really isn't that much more expensive than a \"kids\" camera.  Our daughter is really careful with her things so we haven't had any drops or scratches.  She had no problem figuring out how to turn it on, take pictures, and view her pictures.  I put it in the sports scene mode and that seems to cut down on blurry pictures when she moves the camera too quickly after pressing the shutter button.  Overall, we are happy with this purchase.", "Date": "April 11, 2013"}, {"Title": "my first digital camera", "Author": "CATHOU", "ReviewID": "R1ZLYHQU2XQFEM", "Overall": "5.0", "Content": "so compact, lightweight, attractive, easy to use. Fun little camera, very sharp . I am shy with digital camera, it's my first one and had trouble letting go of my very good 35 mm but the film is har do find any more. So this is a fantastic surprise for me and I love my purchase", "Date": "July 22, 2013"}, {"Title": "Broke fast", "Author": "Neptune5", "ReviewID": "R3HXZA4XMEFCP1", "Overall": "2.0", "Content": "This camera took great outdoor pics, but bad indoor pics that were fuzzy and dark.  Biggest downfall was that it broke the second time I took it out. It's completely useless now and past the refund date, so it's a waste of money.", "Date": "July 18, 2013"}, {"Title": "Why we purchased Olympus", "Author": "Bruce Beard", "ReviewID": "R301RMF5NSFGEH", "Overall": "5.0", "Content": "We purchased this camera because of our previous Olympus unit.  We have used that camera for a number of years and found that Olympus is easy to use, has all the features we want and gives us professional results at a reasonable price.  What more can you ask?", "Date": "June 13, 2013"}, {"Title": "Camera review", "Author": "Rythie", "ReviewID": "R1FHZZTE1FS0LA", "Overall": "4.0", "Content": "It is a nice camera, excellent features for someone who is looking to have a convinient camera without the technical setup. Nice compact and easy to use", "Date": "September 15, 2012"}, {"Title": "nice camera", "Author": "andro7793", "ReviewID": "R13Z1TZB1YXEP2", "Overall": "5.0", "Content": "this camera is very good, it takes very good quality pictures, the best choice for this price.i recommended this to everyone, who want cheap, but very good camera for taking pictures", "Date": "September 4, 2012"}, {"Title": "My own assumptions", "Author": "jeanenne doxey", "ReviewID": "R2MMPPV96WVUIT", "Overall": "3.0", "Content": "When I bought the camera I thought it would be powered by double A batteries.  However I was surprised that the camera came with its own battery, however it did not come with a charger for this battery.  I was disappointed and had to find a charger for its battery before giving the gift to my daughter. I just never thought to ask.", "Date": "January 15, 2014"}, {"Title": "Olympus digital camera", "Author": "David A. Persons \"paramagic\"", "ReviewID": "R146R8UGJ4A7RM", "Overall": "5.0", "Content": "Love my new camera. Still working on getting used to the upgrade from my old FE-340 from Olympus. I have always been an Olympus fan and had a hard time finding OLYMPUS in local retail outlets.", "Date": "June 26, 2012"}, {"Title": "Poor Picture Quality", "Author": "REVIEWER71", "ReviewID": "R2G2EDBH9YO6D4", "Overall": "1.0", "Content": "I'm not a \"professional\" by any means, but I certainly know a decent camera from a good one.  This camera doesn't take good photos in any dark setting.  Trust me, you'll be disappointed.  Additionally, the pictures it did take (in light) weren't the quality I was expecting.  I'm trying to upgrade an old camera and my old p&s; was better.This camera is SMALL--which I what I thought I wanted.  This is almost too small to use unless you have child sized fingers.  The buttons are very hard to press.Thank goodness for Amazon's return policy.", "Date": "April 15, 2013"}, {"Title": "Good deal", "Author": "LiLee", "ReviewID": "R1YCFKGPKBLXG5", "Overall": "5.0", "Content": "Camera is sophisticated but simple enough for my senior mom to use.  Buy an sd card, because the camera does not come with one. It comes with wall charger, usb cord, lithium battery, user guide.  Buy a case that will keep the cords with the camera....not good to misplace them!  Buy an audio/video cord if you want to hook up to an older TV.", "Date": "January 27, 2014"}, {"Title": "Perfect Camera", "Author": "Marilyn Kennedy", "ReviewID": "RIU6TLYV8UJB1", "Overall": "5.0", "Content": "This camera is ideal for traveling as will fit in a shirt pocket or purse which makes so easy to access.  It is small and just what I wanted to carry around while sightseeing. Haven't used it yet so can't comment on quality of photos, however, it is an Olympus so I expect the photos will be awesome!", "Date": "January 8, 2014"}, {"Title": "I love this camera!", "Author": "Bunny", "ReviewID": "R1WY4PQRJMFNEI", "Overall": "5.0", "Content": "It's thin and I love the silver!! It is a lot better then I thought it would be!!! I would definitely recommend this!!!!!!!", "Date": "January 6, 2014"}, {"Title": "good for the price", "Author": "Ryan Jackson", "ReviewID": "RRN0OFSQTT3Y1", "Overall": "3.0", "Content": "The pictures have great resolution. It's sleak and sexy. I love the chrome orange. I love the rapid fire setting. I will however say it changes settings on me when I haven't touched a single button. So a lot of times I will have lined up a perfect picture and its gets lots because it changed to a setting that blurs if its not on a tri pod or you move,,, It;s made me lose a lot of potential beautiful photos, I assure you it's not me changing the settings. I'm not digital camera innate or incompetent,,, I think maybe it adjusts on it's own the compensate for lighting or perpective/distance. I can't stand it!", "Date": "March 5, 2013"}, {"Title": "Great Camera", "Author": "Raghu", "ReviewID": "R2V277FV0UIRV7", "Overall": "5.0", "Content": "Great Camera, excellent support and service from Amazon. Handy and good clarity pics. I had used it for outdoor and indoor locations and it was fantastic.", "Date": "August 26, 2012"}, {"Title": "Great camera for the money!", "Author": "momof6", "ReviewID": "RFK3Q8B92J89K", "Overall": "5.0", "Content": "I bought this camera for my daughter's 11th birthday. It is her first camera so I didn't want anything too fancy or too expensive. Seems perfect! She has had it for approximately 3 months and had enjoyed taking numerous pictures and videos. I like it so much I am considering purchasing one for myself.", "Date": "July 20, 2013"}, {"Title": "Bought for a 10 year old", "Author": "WRW \"Wendi\"", "ReviewID": "R1U9VDUC2D0IJP", "Overall": "5.0", "Content": "... and she loves it! Easy to use, easy to hold, does what it should. Really great value for the price paid. Takes a super nice photo. Daughter is an aspiring photographer and was hesitant to buy anything over $100 as she tends to be hard on things. So far, so good.", "Date": "February 12, 2014"}, {"Title": "very good camera!", "Author": "Kim Brown", "ReviewID": "R1KTN2NB0DOCYZ", "Overall": "5.0", "Content": "daughter #3 broke our camera at disneyworld, so got daughter #2 this one as a replacement and she just loves it.  it works great and you can't beat it for the price!", "Date": "January 12, 2014"}, {"Title": "olympus VG-160", "Author": "Virginia Burgess-bronga \"vburgessbronga\"", "ReviewID": "RGUGJHVEV0JYJ", "Overall": "5.0", "Content": "Very satisfied with this camera...used it for a wedding recently and pleased.  thank you  We will be using it frequently in the future too. V Bronga", "Date": "May 21, 2013"}, {"Title": "olympus camera", "Author": "tina fields", "ReviewID": "RZWBAFYTA1JC1", "Overall": "5.0", "Content": "I bought this camera as a christmas gift for my mother, it is easy to use, and very lightweight. it is a well working camera. Extremely worth it.", "Date": "December 14, 2012"}, {"Title": "Great little camera", "Author": "Dean Lafferty", "ReviewID": "R25BPPTU237OHC", "Overall": "5.0", "Content": "Very good camera.  The size is grreat for packing in a breifcase or hanging on your belt with the case.  Picture quality is very good and the softwarre editint program is easy to use.", "Date": "November 24, 2012"}, {"Title": "Good quality and a real bargain", "Author": "A. Stanton", "ReviewID": "R1AM9I80XQ9KHI", "Overall": "4.0", "Content": "I bought this camera for my wife, who wanted a small camera to carry in her purse for shots of her friends and students.  I'd bought her a fine Canon A570 a few years ago which she may have used a half-dozen times.  She found it too bulky and too complicated.  So this time I looked for a small camera that was very easy to use.  I took a chance with the VG-160 because of the good reviews on Amazon.  I added an eye-fi card so that the photos could be transferred to her computer automatically.  Thus far the camera is meeting my wife's needs.  We like its small size, sleek appearance, quick operation and simple easy-to-use controls.  Image quality is very good, especially outdoors.  The only thing we don't care for is its flash - it's underpowered - but so is the flash of most small cameras.  To counter this I set the camera to flash off and the resulting pictures are better than when the flash was used.My wife and I recently visited our daughter and, after my wife took a several pictures, my daughter announced that she'd like one too as a Christmas present.A good camera and a great bargain at $79.", "Date": "October 22, 2012"}, {"Title": "Yes!", "Author": "Spittix", "ReviewID": "R3NC9QVH4L1EX0", "Overall": "5.0", "Content": "Awesome point and shoot camera and a good price. I think I will be getting another.Do some research on cameras before you buy this just to make sure you get what you want out of your photography. But for your basic \"night out\" picture snapper it's perfect.", "Date": "May 22, 2014"}, {"Title": "Very epic", "Author": "Kristy Villa", "ReviewID": "R3R3LTV79UIY30", "Overall": "5.0", "Content": "Very good product for something not so expensive also perfect hd shot it makes please add more in stock as soon as possible", "Date": "May 3, 2014"}, {"Title": "Great camera!!", "Author": "Sweet Angie", "ReviewID": "R12QN5IU1M23EU", "Overall": "5.0", "Content": "I got this camera for taking simple pictures at the zoo or when I go camping.  I love the picture quality and the size of the camera, fits easily anywhere like my pocket.  Love the color too.  shipping was fast and I'm very happy with my purchase.", "Date": "April 25, 2014"}, {"Title": "Bargain for the casual photographer", "Author": "JSK \"mmekline\"", "ReviewID": "R1E6ATY0R89B2Y", "Overall": "4.0", "Content": "I frankly bought this based on brand recognition and price, and I'm not disappointed. I want something I can throw in my purse on trips and have decent pictures to share with friends. The battery life is good (although I keep a spare in my purse just in case). The usb connection is not like my other gizmos (phone, Kindle), so I would have to carry a different cable, but removing the SD card to transfer pictures is easy enough. Overall, I'm very pleased with it. Even the video I've shot is good quality.", "Date": "April 13, 2014"}, {"Title": "Really nice point and shoot.", "Author": "M. Goodrich", "ReviewID": "R3HO3ZAA0PFJUT", "Overall": "5.0", "Content": "I didn't want anything fancy; just a good camera that will take good photos. I'm just your ordinary point and shoot photographer, and this is an easy to use camera that fits the bill. I paired it with a Kroo Nylon Universal Digital Camera Case and it fits perfectly, with room for extra batteries and SD cards.", "Date": "March 11, 2014"}, {"Title": "Enjoying the camera", "Author": "Brook A. Lohmeier \"ghost_kitten\"", "ReviewID": "RGFB7X4SFN7MN", "Overall": "4.0", "Content": "As a teacher I find it important to have a camera that I can use easily. I have had the worst problems with all the Nikon cameras that are this size. I figured I would give Olympus a try since my mom has had one of these for a few years and not had any problems. I have to say right now the feature I am loving most is that I can charge it on the go in my car or with my computer. I will update later if the camera has any problems. Thus far I am having fun with it.", "Date": "March 2, 2014"}, {"Title": "Takes great pictures!", "Author": "PennyForYourThoughts", "ReviewID": "R1VTR8Q353QM9A", "Overall": "4.0", "Content": "We bought this camera for our younger daughter due to her old camera taking blurry pictures.  So far, the camera seems to take great pictures and video and is easy enough for an 8 year old to manage.  The battery charge lasts a long time.  No complaints!", "Date": "February 26, 2014"}, {"Title": "Point and Shoot, Easy!", "Author": "Paul", "ReviewID": "R1C3AYG74NNN40", "Overall": "4.0", "Content": "We have had this camera for over a year now and I love the auto settings, its just point and shoot when you need it and also when you have a moment and want something speacial there are alot of settings to get the perfect shot.The camera is very tough, yes I dropped it a couple times. Olympus has been in the camera business for alot of years and this camera proves thier quailty!", "Date": "February 10, 2014"}, {"Title": "Digital Camera", "Author": "Cosmic Jester", "ReviewID": "RJAACI7SVLQGX", "Overall": "4.0", "Content": "I really like the auto focus and face detection of this camera.  You can also set the ISO to take 3 photos at a time if you like.  The zoom could be a little better but I can live with it.  I recommend downloading Olympus Viewer 3 for editing your photos.  With 14MP you won't really have to do much editing.  Just a little crop here and there.  I would highly recommend this camera to anybody looking for an excellent pocket size camera for everyday use.", "Date": "February 8, 2014"}, {"Title": "Olympus VG-160 14MP", "Author": "Daniel M. \"gadget user\"", "ReviewID": "R3NKF3NO84AUSF", "Overall": "3.0", "Content": "I returned this item because I didn't like the quality of the pictures. Sure, I should have read up on the subject but this was an impulse purchase. Now I know that more megapixels don't translate into sharper pictures. It is more to do with the size of the sensor. My current point-and-shoot camera only has 10MP but takes better shots. It is more expensive than this model so it wouldn't be fair to make a comparison. I will save my money and buy something substantially more expensive so as to get what I want. As for the design, I prefer to control the zoom via a ring around the shutter instead of through a zoom switch on the back. On the positive side, this camera was super cheap, had a big 3\" LCD screen and has a fast start-up. Also, you can stitch pictures together for a panoramic shot. I really wanted it to be my next best pocket camera but it was not to be. I found Willoughby's customer service to be superb, by the way.", "Date": "January 10, 2014"}, {"Title": "Very poor quality pictures", "Author": "Lindsey", "ReviewID": "R2XL23QFK7C8DC", "Overall": "2.0", "Content": "A nice looking camera, with great battery life and a nice array of settings. HOWEVER, no picture I've ever taken on this has come out well. Even ones that look OKAY on the screen/computer print like an overexposed instant Polaroid. I tried it in several different seasons, lightings, and environments and am finally returning it.", "Date": "January 4, 2014"}, {"Title": "We really love this little lovely camera with very good quality!", "Author": "Yin N. \"yin\"", "ReviewID": "RM4Q3WUR7TJ74", "Overall": "5.0", "Content": "We bought it last August with great price and used it during our west coast trip of more than two weeks in September. Easy to use, very light weight, and took great pictures, super value!", "Date": "January 3, 2014"}, {"Title": "Love my new camera!", "Author": "J. Deitrick", "ReviewID": "R1AYA3MN4S6TU7", "Overall": "5.0", "Content": "Beside the great deal ...this camera is a gem! the pictures are clear with a quick click! And the special effects are fun too. I purchase right after Thanksgiving and my Christmas pictures are fabulous! thanks Olympus!", "Date": "December 27, 2013"}, {"Title": "Great little camera", "Author": "Carol Ann Book", "ReviewID": "R1VRB6CF4U4XGO", "Overall": "5.0", "Content": "Clear photos at an affordable price.  May not have a detachable lens, etc., but it delivers clear and bright photos.  Enjoy!", "Date": "December 22, 2013"}, {"Title": "Nice small, easy to use camera & holds 56 3mb photos without a SD card", "Author": "csmith", "ReviewID": "RPUS922VHC8EG", "Overall": "4.0", "Content": "I prefer simple cameras and use it on Auto even though it has many technical features which are described in it's 76 page online manual which I will never use. The 3\" LCD is large enough so I don't need my glasses shooting, but do for the controls. It will easily fit in a shirt pocket. My only critique is it is smooth to the touch on old, battered hands and plugging the USB cord into it is a slight problem . The controls could use a little more tactile sensation but in my case they seem separated to avoid accidental activation as I have had on other cameras. Overall I think it was a very good purchase.", "Date": "December 19, 2013"}, {"Title": "Great Camera!", "Author": "DiscoDaze", "ReviewID": "R3OEEY0LX5YOHZ", "Overall": "5.0", "Content": "This is the best pocket camera out there. I took some awesome pictures with this camera on a trip the Southwest deserts and the Bonneville Salt flats. It did a great job. Very high quality photos and its easy to use. The plug in charging is the best. You can plug it into a 110V outlet or a computer UBS port. I've used both, it works great. Buy this camera. You will not be disappointed.", "Date": "December 18, 2013"}, {"Title": "Good Deal", "Author": "Hi Desert", "ReviewID": "R2U7SFBUIJD6EW", "Overall": "5.0", "Content": "I use this camera to record things for my job. It's everything I want in a digital camera: long battery life, easy to charge, seems rugged enough (dropped it, got it dusty and damp), and takes clear pictures in all kinds of light. I'm not enough of a photo nerd to know how this stacks up against others. I do know that I'm very pleased with being able to take a good photo in any conditions with no effort, and felt this camera was a very good deal.", "Date": "December 7, 2013"}, {"Title": "An Okay Point and Shoot Camera", "Author": "L33tminion", "ReviewID": "R26I8MAYZ594IR", "Overall": "3.0", "Content": "I thought this camera was all right for a value point-and-shoot digital camera.  It doesn't do the best in low-light settings, and for some reason digital image stabilization isn't on by default.  Enabling that really does significantly improve the quality of the photos.", "Date": "October 15, 2013"}, {"Title": "Loved it", "Author": "fleurlau", "ReviewID": "R3F9CX481BTL5Y", "Overall": "4.0", "Content": "Great camara, plenty of functions and it's great for point-and-shooting. Would buy it again. Good purchase for little money :)", "Date": "July 18, 2013"}, {"Title": "This the product that i wanted it, very usefull for gift in special ocassion", "Author": "Jorge Rondon", "ReviewID": "R22Q4IUGMO1H11", "Overall": "4.0", "Content": "This the product that i wanted it, small and practice to outdoor, very usefull for gift in special ocassion like birthdays", "Date": "July 1, 2013"}, {"Title": "Good Value", "Author": "John M. Longnecker \"Library Fan\"", "ReviewID": "RNR3NQV3ZP5I", "Overall": "3.0", "Content": "I like the camera - it's size lets me carry it in a shirt pocket.  Transferring pictures to my computer is somewhat complicated.  The on-line owners guide is hard to use but I was provided a printed copy when I requested it.", "Date": "June 1, 2013"}, {"Title": "Cute", "Author": "Valerie V Luks", "ReviewID": "R21KYH41SHHJH5", "Overall": "5.0", "Content": "What a bright ( and smart) little camera. It does everything I need for day-to-day photos. NOT a waste of money.", "Date": "May 19, 2013"}, {"Title": "No complaints", "Author": "N. Hernandez \"Good Game\"", "ReviewID": "R2PG2U684TZFMK", "Overall": "5.0", "Content": "Beautiful camera very easy user friendly lots of options for some really nice and great pics, really fast shipping good overall great price.", "Date": "May 11, 2013"}, {"Title": "Nice Camera", "Author": "BLOVE", "ReviewID": "R27UWJ4CATKG82", "Overall": "4.0", "Content": "I love that this camera has a rechargeable battery. This is not the best camera or the worst. I got for my wife as something that would be easy to whip out and take some pics of our daughter. The camera is really small and easy to stick in a pocket. It takes great pics for the price you pay. If you're looking for a low priced camera that will produce great pictures look no further.", "Date": "May 10, 2013"}, {"Title": "Great small camera!", "Author": "Seag930", "ReviewID": "R3C8BNB9Z5063B", "Overall": "4.0", "Content": "I love this camera.  It is so small and fits in my pocket.  This would have gotten 5 stars but it does not take great pictures at night.  Looking for a great small camera for daytime shots, this is the one for you...", "Date": "April 15, 2013"}, {"Title": "Very convenient!", "Author": "Ron", "ReviewID": "R1WT3JZLPOLDOO", "Overall": "4.0", "Content": "I really love this little camera. For those times I don't want to carry around my larger one, this one easily fits into my pocket, letting me capture those shots I would ordinarily miss!", "Date": "April 11, 2013"}, {"Title": "Olympus", "Author": "Deborah", "ReviewID": "R2C7Y6IWLR65KZ", "Overall": "5.0", "Content": "Very good little camera for the money . Got them for my Grandaughters. They love using the video . Would not recomend anyone getting a camera that uses batteries . Rechargable batteries only", "Date": "April 5, 2013"}, {"Title": "Fabulous camera, especially for the price.", "Author": "T. BECKER \"Tamara Layne\"", "ReviewID": "R1VIG41WWIJXM0", "Overall": "5.0", "Content": "This camera is terrific for a non-professional. Beautiful shots, excellent price, cut little design and color, easy to use-- and charges--- no batteries required (I hate having to buy batteries). An amazing buy.", "Date": "March 31, 2013"}, {"Title": "Great size, great pics", "Author": "shurl \"ceegee58\"", "ReviewID": "R3I6CQEI66F0E9", "Overall": "4.0", "Content": "I really wanted a small camera that would take great pictures, and this one fills both those requirements.  I have always liked Olympus products.  The only thing I don't like is that there's no separate battery charger, you have to hook up the camera itself, and the little \"door\" over the charger plug-in looks like it won't take a lot of use without breaking off.  I could be wrong about that, but I'll probably end up ordering a battery charger in the long run.", "Date": "March 28, 2013"}, {"Title": "Very good digital camera at a good price", "Author": "SouthernMohawk", "ReviewID": "R2CWGQFN2DO1OG", "Overall": "4.0", "Content": "Takes very good close-up pictures of my jewelry, which is what I was looking for; and very good pictures of everything else-including sunsets, which is a bonus.", "Date": "March 28, 2013"}, {"Title": "Purchased as a Christmas gift.", "Author": "Selene Schulz", "ReviewID": "R1I6C8F8JTJQ5G", "Overall": "5.0", "Content": "This camera is the perfect size to tuck away in your purse or slip into your pocket. The photos and video are great and the orange color is beautiful. No way could someone mistake this camera for theirs. The price was more than reasonable. Beware though, it does not come with a memory card, so that is a separate purchase. Couldn't have chosen a better gift for this person.", "Date": "January 19, 2013"}, {"Title": "Pictures are just okay", "Author": "amerish", "ReviewID": "R2XSBUGH3MP8QJ", "Overall": "3.0", "Content": "I personally did not like the quality of pictures taken by this camera. There were small horizontal lines in pictures taken by the camera right out of the box. So its on its way back to Amazon. i have used Sony cyber shot earlier and will again go with sony. Not a recommended buy.", "Date": "January 9, 2013"}, {"Title": "Great little pocket camera", "Author": "A. Phillips", "ReviewID": "R3JEGAMCFNOR0J", "Overall": "4.0", "Content": "I shoot with a Canon 6D, but for times when I don't feel like hauling it around or don't want to risk having it with me, I like to have a small point-n-shoot. When replacing my last one that my kids broke, my number one priority was price-point. I don't need a great secondary camera, I just need one that will capture the moments.And this camera does just that. It is compact, shoots very quickly, and produces quality images. It's no SLR, but it's not designed to be, and it certainly fills a gap for me.", "Date": "January 8, 2013"}, {"Title": "Best P&S; Camera!", "Author": "Carrie Reynolds", "ReviewID": "R1CX2SY4BWA4K8", "Overall": "4.0", "Content": "I purchased this camera because the price was right, it wasn't too bulky and it had good reviews. I absolutely love this camera now that I have used it for a week or so. It takes clear pictures, is easy to use and the perfect size!!! I highly reccommend it to anyone looking for a good quality P&S;", "Date": "December 17, 2012"}, {"Title": "Love this Model", "Author": "Terri Elzey", "ReviewID": "R3R7MHK4PV8LS6", "Overall": "5.0", "Content": "This camera takes excellent photos, clear, and quick shooting. Takes excellent night time photos.  I like it cause it's bright in color and has all the options I need for my business to taking photos of homes for mortgage companies. Excellent product. This is my second one of these models.", "Date": "December 17, 2013"}, {"Title": "excellent camera, excellent price!", "Author": "Cheryl David \"CSDinNYC\"", "ReviewID": "R39TEJ7GQTXOBS", "Overall": "5.0", "Content": "This was a Chanukah gift for my 9 year old nephew who was begging for a \"real\" camera.  Its a gorgeous camera, relatively easy to use, has terrific features and, most importantly, takes wonderful picture in every light or lack thereof.  The lcd screen is large, the buttons are well placed, and features include ability to take photos in black and white sketch mode and other fun modes.  Admittedly, this would not be appropriate for most 9 year olds, my nephew is unusually mature and responsible for his age.  But what a great gift for a teenager or adult!  I may get myself one.", "Date": "December 12, 2013"}, {"Title": "Great camera", "Author": "Anne Lane \"Nancy\"", "ReviewID": "R1BLWBPCLOP484", "Overall": "5.0", "Content": "This camera has a lot of really good features.  It is perfect for a picture taker like me.  I've only had it for a couple of months but I am very happy with the picture quality.  My prints were great.", "Date": "July 21, 2013"}, {"Title": "It's a lovely camera with a few hiccups.", "Author": "Missy", "ReviewID": "R3H2PPV4VCS9K", "Overall": "4.0", "Content": "This is my first actual digital camera so I wouldn't be able to compare it to others but I must say: It's AWESOME for the price! I do have a list of pro's and con's I can offer. I also must suggest to purchase a warranty and will explain why below.Pros:1.) High quality for the price! I expected plastic with a lens and was proven wrong.2.) Videos - I film reviews for beauty products and shots are always clean, crisp and smooth. Volume picks up great.3.) Pictures - Like the video, the images are crisp, with a vast variety of options/settings such as flash and filters.4.) Lightweight - I hate bulky things and this camera fits well in my hands. It's sturdy but not heavy.5.) It turns on and off so quickly. It's quicker than the camera on my cell phone which is useful for spur of the moment shots.6.) You can rewind and fast forward videos while they are still on the camera. I was stunned by this.7.) You can zoom in and out of images already taken while they are still on the camera.8.) It's very easy to use! The screen is large and the interface is simple to learn.9.) Customer Service/Technical Support was helpful, friendly and functioning. I had to call them for an issue, which can be found in the cons below, but it should be known that Olympus has good customer service.Cons:1.) THE CAMERA FROZE. I had the camera a week and was taking pictures. Once I was finished I hit the off button and the screen went black but did not turn off. It stayed illuminated, with the lens extended and it clicked every so often. I had to call technical support to resolve the issue, which was a simple \"remove the battery for a moment.\" While it was a simple fix, it did happen, and I think it should be known. This is why I suggest purchasing a warranty.2.) The camera gets hot while filming videos. I filmed a 22 minute video straight and the camera was significantly heated. I suggest not filming for too long without giving the little thing a break. It's a minor flaw but it is there and should be known.3.) Battery life isn't all that great. If you want to use this camera to film a day trip, don't expect much from it. I filmed about 40 minutes in low quality and it sucked the battery dry and died unexpectedly on me. For 720P filming, I get even less from the battery.4.) While you can zoom in and out, you cannot zoom in and out during videos and it diminishes the quality of the images taken. If you want a close-up shot in a video, you will have to zoom in before starting the video. This is a bummer because you will have to stop filming and start again if you want to show something up close. Also, if you zoom in to take a picture, the quality of the picture significantly worsens. It looks cloudy and doesn't focus.5.) Depending on the quality you film in, you can only get a certain amount of minutes total you can film. I don't like having a limited about of time to film but it does count down how much time you have left, so this isn't a deal breaker for me. (I have learned that the time limit might be longer if your SD card has more memory.)6.) You need to purchase an SD card (the large type, not the micro SD) for memory or you cannot use the camera. Perhaps this is obvious to other digital camera owners, but it wasn't to me as a first time buyer. You need to make a separate purchase in addition to the camera in order to store your videos/images. I have a 2GB SD card in my camera and it has been enough for me. If you want to take longer videos (my 2GB SD card can do a maximum of 47 minute low quality filming, 9 minute 720P filming) I suggest buying a larger SD card. Videos take up a great deal of memory.Overall - 4/5Is this a good camera? It's a great camera. Would I recommend this to a friend? Yes. It has its quirks, which mainly depend on what you will use the camera for. The quality you receive for the price is fantastic, but the battery life is a little scarce, the camera gets hot if used for a long period of time (20 minutes) and it froze on me (once) while trying to turn it off. If you need a low price camera, this is a great buy, just invest in the warranty in case it has any problems that can't be fixed by removing the battery.", "Date": "May 2, 2013"}, {"Title": "simply to uses", "Author": "Disciple1", "ReviewID": "R1QL68P4YIA4ZA", "Overall": "5.0", "Content": "Good camera very lite easy to carry easy to down load pic, great zoon up 5 times.  good for e-bay pic", "Date": "February 7, 2014"}, {"Title": "Excellent 'point and shoot' camera; the videos from this camera are easy to take and outstanding!", "Author": "Ruella Yates", "ReviewID": "RKNNV7OSXZC0L", "Overall": "5.0", "Content": "This Olympus digital camera does both still photos and videos with clarity and ease!  It's lightweight, easy to handle, and has taken everything from animal portraits to training videos.  5 Stars all the way!", "Date": "December 16, 2013"}, {"Title": "Amazing value, incredible camera", "Author": "gss", "ReviewID": "R1R9Q8KKGAGU3E", "Overall": "5.0", "Content": "We purchased this camera for my son's 8th birthday.  It is, of course, FAR more camera than an 8-year old needs, but he is burning through the instruction manual and another digital photography book for kids that we gave him.  He loves it.  I've tinkered around with it and love it, too.I'm an avid amateur photographer and my wife is a professional photographer...she even knows (gasp) how to work in a darkroom.  She's part of a dying breed.  Anyway, this camera has amazing features and takes great pictures.  I personally believe it has far more features than most anyone would ever use.  We spent $71 on it and it came with a free case.  I can't believe what a good deal.If you need professional quality pictures, spend $5000+ on a digital SLR with high-quality lenses.  If you just want to take great pictures with your friends and family, there is no reason to spend more than $71 on this little gem.", "Date": "September 15, 2013"}, {"Title": "Great Camera", "Author": "Freda B. Bridgeman \"Biker lady\"", "ReviewID": "RXFHQ48NZQ45A", "Overall": "5.0", "Content": "I wanted a small camera that I could carry with me in my purse.  My sister-in-law had an Olympus that she took with us on a trip recently.  Well this is a great camera.  I love the color and it is light and easy to operate.  I didn't even read the instructions.  I just played with it for a few minutes & checked out all the features.  I would certainly recommend it to anyone looking for a small, easy to use, nice looking camera.", "Date": "July 15, 2013"}, {"Title": "good camera for its price", "Author": "Lenin Carrion", "ReviewID": "RQKQF0JSM2RUM", "Overall": "5.0", "Content": "I sold my camera to my cousin, she liked and asked me to sell it to her. I like it too, but I might consider buying a more expensive version of it with better resolution and wider range of formats.", "Date": "June 4, 2014"}, {"Title": "buena calidad", "Author": "Robert T.", "ReviewID": "R3SVBMKV16FSKF", "Overall": "5.0", "Content": "good product, they arrived in excellent condition. good product, the product is very good value. excellent brand and meets the needs of the user.", "Date": "May 21, 2014"}, {"Title": "So much fun!", "Author": "ramona stevens", "ReviewID": "R3M4TM16XOVFZ2", "Overall": "5.0", "Content": "Decided I needed something more than my iphone for pics of my granddughter. This is a nice little transition BACK to cameras. Picture is crisp; and it is easy to use.", "Date": "May 20, 2014"}, {"Title": "olimpus camera", "Author": "yumn", "ReviewID": "R399LV334NPVXF", "Overall": "5.0", "Content": "Its so bpretty and eficient my daught is very happy with it. Definately would recomender does neat things for begining.", "Date": "May 16, 2014"}, {"Title": "Nice", "Author": "Vonda Smith", "ReviewID": "RFPIPNAD1UD83", "Overall": "5.0", "Content": "Takes very nice pix nice and very small and lightweight. I love this cemera I take it every where .", "Date": "May 7, 2014"}, {"Title": "Great Camera", "Author": "Tim Quinton", "ReviewID": "R2W41JFROGP7J6", "Overall": "5.0", "Content": "Got tired of my phone's fuzzy pictures. So I got this camera and it takes really great pics. Would suggest it to anyone.", "Date": "April 6, 2014"}, {"Title": "Perfect", "Author": "rosetty", "ReviewID": "R12BGXUR2KQB03", "Overall": "5.0", "Content": "I bought this cam because my old one was broken, I was looking for something good and cheap, This is just want I was looking for It works perfectly, very clear images, face detector and everything, I love it", "Date": "March 12, 2014"}, {"Title": "..", "Author": "William", "ReviewID": "R1TAGUUD129QW8", "Overall": "5.0", "Content": "I love this camera I have had no problems with it im able to upload to facebook and computer without a problem it takes very good pictures along with videos i recommend to all", "Date": "March 3, 2014"}, {"Title": "My new camera", "Author": "Prem1893 \"Jackie\"", "ReviewID": "R9500PRQQX42G", "Overall": "5.0", "Content": "I like the feel of this nice compact camera. Easy to use and the pictures are great. I highly recommend this camera.", "Date": "February 18, 2014"}, {"Title": "Bought as a gift", "Author": "Barbara Drolson", "ReviewID": "R2FKIP9LIMQ3V", "Overall": "5.0", "Content": "Bought this for my 4 year old Grandson because it did not cost mush more than some of the toy versions and it was definitely worth it. Sturdy little camera, picture quality is good....and the color of the camera is stunning", "Date": "February 15, 2014"}, {"Title": "Love the color, good camera", "Author": "AmyE", "ReviewID": "RI0GFO1ZDP4KX", "Overall": "4.0", "Content": "I wish the video was a little more user friendly but so far, so good.  The size was right, the price was right, the color as right and have been able to get muvh higher quality pics than with mt phone.", "Date": "January 11, 2014"}, {"Title": "Great pic!!", "Author": "Lindasm \"Lindasm\"", "ReviewID": "RUR72QD10VOSB", "Overall": "5.0", "Content": "AWSOME!!!!!  This camera takes really Great pictures!  Really have enjoyed having it and use it all the time.  Thank you!!", "Date": "January 4, 2014"}, {"Title": "WOW, I'm blown away by all this, for such a low price.", "Author": "flashlightnut \"sunnydaysarewonderful\"", "ReviewID": "R3426L0MRSCM8Z", "Overall": "5.0", "Content": "WOW!I'm blown away by the technology in this little camera.The rechargeable battery was a nice surprise.This camera is tiny but packed with everything you'll need.Get them while you can, I've heard Olympus may not be makingcameras next year.There is a big difference in price depending on which coloryou choose. RED is the cheapest. I got RED.", "Date": "December 11, 2013"}, {"Title": "Awesome!", "Author": "FitFlopLover", "ReviewID": "REJJ1USB8UXVH", "Overall": "5.0", "Content": "Still learning how to use it  - so far, so good.  Fairly easy to view on my computer, haven't tried the TV yet.  The price was right and LOVE the color.", "Date": "November 1, 2013"}, {"Title": "Olympus VG-160 14MP Digital Camera with 5x Optical Zoom (Black)", "Author": "work", "ReviewID": "R1P2F4AI18LIE", "Overall": "2.0", "Content": "Malfunctioned after only a few uses, had to return it.  Lost all pictures taken because it kept telling us to re-format the disk.", "Date": "October 28, 2013"}, {"Title": "People should consider on getting it.", "Author": "Wisdom Somola", "ReviewID": "RDKUKSP65WW37", "Overall": "5.0", "Content": "Exlant camera, I would like all the photographers to check it out. Amazon  got reall nice cameras, & this one is one of the best believe it.", "Date": "October 26, 2013"}, {"Title": "Camera", "Author": "grannyv", "ReviewID": "R1BDSFHVGQPCLW", "Overall": "5.0", "Content": "I love this camera.  It was exactly as described.  If you are looking for a camera that will give you crisp clear pictures, I would recommend this Olympus for you.  It's small enough to carry in your purse.  Easy download to computer.", "Date": "October 14, 2013"}, {"Title": "good", "Author": "kathryn martin", "ReviewID": "R6WUPGAKC4XB6", "Overall": "3.0", "Content": "I have had the camera a month or so and the auto lens cover broke this week. Other than that it's a good camera.", "Date": "October 9, 2013"}, {"Title": "camara", "Author": "Jackie", "ReviewID": "RB64DRAAJLTVL", "Overall": "5.0", "Content": "I bought it for my cousin as a bridal shower gift she used it at her wedding and it took excellent pictures.", "Date": "October 7, 2013"}, {"Title": "Great camera!", "Author": "Human", "ReviewID": "R3VR841H8B2N3", "Overall": "5.0", "Content": "Great camera! This caemera works great and was very affordable. I would recommend it to anyone. I always buy Olympus.", "Date": "September 19, 2013"}, {"Title": "Great Little Camera", "Author": "Jane Longchamps", "ReviewID": "RVA0OCX7TWW27", "Overall": "4.0", "Content": "Small, light weight, takes good pictures, average zoom. Easy to use. Great for traveling. Can't beat the price for an Olympus.", "Date": "August 27, 2013"}, {"Title": "A little small", "Author": "Amazon Customer", "ReviewID": "R20L53BZOMZYPR", "Overall": "4.0", "Content": "It is very small, but is great for a pocket or purse.  Takes great pictures for it's size & cost.", "Date": "August 26, 2013"}, {"Title": "Great camera!", "Author": "Nerica Miravite", "ReviewID": "R3PB69SJWQKQEX", "Overall": "5.0", "Content": "Gifted this camera to my parents, and they loved it.  It is easy to use and carry.  Very light and slim.  You wont be disappointed!", "Date": "August 3, 2013"}, {"Title": "Perfect camera for a beginner...me!", "Author": "MaggieE.", "ReviewID": "R3D66EQ065FKBY", "Overall": "5.0", "Content": "I just love it! It is easy to use and for me that is everything as it is my first camera.", "Date": "June 16, 2013"}, {"Title": "No complaints.", "Author": "David H.", "ReviewID": "R12092F33NLCB6", "Overall": "5.0", "Content": "For a lower priced camera, this one is pretty nice.  Has more features than expected . Takes good close-ups.  Haven't tried distance yet.  And you can't beat the color!!", "Date": "June 14, 2013"}, {"Title": "Nice camera for the price", "Author": "jeannie", "ReviewID": "R2OYAYF4C6ULBT", "Overall": "4.0", "Content": "This camera is wonderful for the price. It takes good pictures and videos, but nothing overly extravagant. I am traveling to Scotland this summer and I know this camera will be perfect.", "Date": "June 9, 2013"}, {"Title": "New camera.", "Author": "Lynn Stiefer", "ReviewID": "R2E5XT2LJ8U3UU", "Overall": "5.0", "Content": "Great little camera. Replaces an Olympus I lost on a cruise. Plus the new one takes SD cards. Takes great pictures.", "Date": "June 2, 2013"}, {"Title": "newer", "Author": "Blanche A Thorson", "ReviewID": "R1P7CQ4X8K9S81", "Overall": "5.0", "Content": "needed newer camera and had liked other Olympus I had.  Haven't got it all figured out yet, but what it will do is great.", "Date": "May 26, 2013"}, {"Title": "Nice camera", "Author": "Manuel D.", "ReviewID": "R21625ZXZL2ZID", "Overall": "5.0", "Content": "Everything is ok, Camera in excellent conditions.  It camer can be use by everyone poeple, it come in perfect conditions.", "Date": "May 24, 2013"}, {"Title": "Product Review", "Author": "Edwin Hernández", "ReviewID": "R3J2XJWTI4BDKP", "Overall": "5.0", "Content": "I am happy to buy your product and I am very sastifecho, I have to say that the specifications and the ease of products are 100% good. so I can say that Amazon is the leader in shopping.Thank you.", "Date": "April 5, 2013"}, {"Title": "Third times a charm!", "Author": "Amazon Customer", "ReviewID": "R94GS7AWR3Y80", "Overall": "5.0", "Content": "After buying two Olympus cameras previously (w/ less MP's; one misplaced [lost], and one dropped camera with it's zoom lense extended), I have to suck it up and by another camera. I was happy that this camera bosts twice the MP's for lower cost!! Can't do like evrybody seems to be doing with the iPad camera pass around or cell-phone. With the aforementioned options, I shyed away from taking photos! #toocumbersome - Based on the other reviews and my previous experience, I'm sure I'll be happy!!", "Date": "March 19, 2013"}, {"Title": "love my camera1", "Author": "trisha laubham", "ReviewID": "R23F6AGV6F6NB4", "Overall": "5.0", "Content": "awesome clarity in pictures!  Quick and simple to use!Love everything about my new olympus camera.  Has a terrific focus also.", "Date": "March 16, 2013"}, {"Title": "great camera", "Author": "tc007", "ReviewID": "R3PR3GIHWDSTHS", "Overall": "5.0", "Content": "Im definitely not a professional photographer, that being said, this camera is fantastic!  Small, easy to use...its exactly the perfect camera for my needs. I'm headed to Ecuador the first of next year, and will be sending pictures back to the states via E-mail ,to friends and family. Well I don't won't to get long winded so let me end by saying ....I would most definitely recommend this device to everyone.", "Date": "March 5, 2013"}, {"Title": "Big improvements from last years model!!!!", "Author": "SAHMNYC \"Just Deb It.\"", "ReviewID": "R1J5YZ7QPVHXK9", "Overall": "5.0", "Content": "I lost my camera, so naturally I looked to replace it with the same, but since there was a new model, i got it. What an improvement from last years model (Olympus VG 140 i think)! The add-on button to record videos, being able to record sound over pictures (5 seconds worth) and hear your videos from the camera, rather than having to wait to download make this camera worth losing my old one for! Also, the screen is a but larger and it makes sounds when you click through the pictures too. I am sure there is more, just haven't seen it yet. The only 'minus' is that the old plus and charger don't work with the new camera, they changed it slightly...so i thought I would at least have a replacement. But hopefully i never lose that! Would def. buy again.", "Date": "February 27, 2013"}, {"Title": "OK camera", "Author": "SARAH STEELE", "ReviewID": "RSLMLY3HY3ML9", "Overall": "2.0", "Content": "I only use my this camera lightly and have had it less then a year.  the camera is already having problems with the lens retracting and not want to turn on.  I takes OK pics but most of the pics tend to be on the dark side. So it requires a lot to fiddling with setting to get just right.  Not a point and shoot camera unless a bright sunny day.", "Date": "February 22, 2013"}, {"Title": "5 stars for sure", "Author": "aron kantor", "ReviewID": "R28TXENVOO3PBW", "Overall": "5.0", "Content": "First off I love the color. The orange is HOT! And the cam is sharp looking. Three resolutions of video including 720p. Make sure you get an sd card to go with it cause you're going to need it. The Transcend that Amazon suggests works perfectly for me. Looking at the pics for the camera I thought it looked a little chunky but it's right at 3/4 of an inch thick. Very slim and I wish I'd gotten the orange hardshell case suggested by Amazon. I've no cons to report so far.", "Date": "February 17, 2013"}, {"Title": "Very happy so far", "Author": "Tara H Snow", "ReviewID": "R2GNKQ8K1QZKR4", "Overall": "5.0", "Content": "This camera is amazing for the price. Just got it a few days ago but tried it out and really happy with the pics it has taken so far.  I would totally recommend it to friends and am considering buying it for my sister.Totally met expectations. So happy with it. Haven't tested the battery life yet. But other than that... phenomenal :)Thank you", "Date": "February 16, 2013"}, {"Title": "excellent camera", "Author": "Michael León", "ReviewID": "R2GQOF9EBQSBQ2", "Overall": "5.0", "Content": "excellent product, the camera has a super resolution, the photos are very clear night and arrived in excellent condition.I recommend", "Date": "February 13, 2013"}, {"Title": "I'm Pleased", "Author": "SuzieQ", "ReviewID": "R3GS43OYM6VLOB", "Overall": "5.0", "Content": "I haven't had this camera long enough to give an in depth review but I can say that so far I am very pleased with this purchase. This is my first ever Olympus and I have been pleased with the photos so far. Primary use is for fun but I am also an internet seller and have used this camera for shots of my products as well as close-ups of brand names, flaws, design. I have not used the video function yet but never did on any of my other cameras. I love the size and can slide it into my jeans pocket. A good buy for me.", "Date": "February 11, 2013"}, {"Title": "Great starter Camera.", "Author": "Jacob Cobler", "ReviewID": "R17SLUQ7EVPGJU", "Overall": "5.0", "Content": "After using a Kodak Advantix film camera for a long while I finally moved over to trying out a digital camera for the first time and this was my first one. Right out of the box it was easy to set up and familiarize myself with the menus and settings. What I liked about it the most was the 14 MP screen which made it easy for me to take photos outside or indoors since I did not want to have to squint to see a small MP screen. Pros: Small for portability, great indoor or outdoor shots, settings to fit the shooting situation. I am impressed with the quality of Olympus and would definitely recommend one to a friend that wants a simple point and shoot camera.", "Date": "February 8, 2013"}, {"Title": "Great camera.", "Author": "Charlie", "ReviewID": "R12JJS19E1605E", "Overall": "5.0", "Content": "The price was just right for my budget. My wife took it for our vacation and shot pictures perfectly for the first time.", "Date": "February 8, 2013"}, {"Title": "so so", "Author": "Kimberly A. Rice", "ReviewID": "R2X8GVU3F0HL8G", "Overall": "3.0", "Content": "having issues with focus and colors.  haven't had a lot of luck taking good pictures with it at all.  find myself just taking pictures with my i-phone instead of messing with this camera because i'm just not happy with the pictures it takes.  i bought it because i liked the red color.  we had a sony camera before this one that was stolen, wish i had just gone with another sony.", "Date": "February 1, 2013"}, {"Title": "great for point and shoot", "Author": "Robert J. Widman \"oitherobot\"", "ReviewID": "R3FQOVWNWKPMZW", "Overall": "5.0", "Content": "i had another Olympus and the screen cracked had batery that fit so now i have 2 working batterysvery happy easy to use came with charger for car and home", "Date": "January 30, 2013"}, {"Title": "Good and fun Pics!", "Author": "David", "ReviewID": "R3B65SHP3EO2PJ", "Overall": "4.0", "Content": "This camera has a very easy to use software, and photo editing software is very comprehensive. It also has some effects to make interesting photographs, which provide a new perspective to the photographic activity.", "Date": "January 23, 2013"}, {"Title": "Great first camera", "Author": "Trena", "ReviewID": "RAMD6J6K8JU3P", "Overall": "4.0", "Content": "Bought this for my 11 year old for Christmas.  Picture quality is good, he loves the features and it is easy to operate.  Seems to use batteries quickly - but that could be the battery.Excellent choice for a Christmas gift!", "Date": "January 22, 2013"}, {"Title": "Love IT!!!!", "Author": "D. Vaughn", "ReviewID": "R1M5W2K1YSH5PE", "Overall": "5.0", "Content": "Perfect for my needs.  Small/compact.  Easy to use.  Not too many buttons.  Big viewing screen in the back.  Great camera.", "Date": "January 15, 2013"}, {"Title": "I do not regret buying this camera!", "Author": "Valerie \"Linares\"", "ReviewID": "R32KI80EDC3KI4", "Overall": "5.0", "Content": "I love everything about this camera! I love the fact that I bought it in orange, because its my favorite color. I love the size, it is just right for me to take it wherever I might want to take a picture like vacation, zoo, etc. (except under water because its not waterproof). The megapixels are just right. The pictures come out sharp and with accurate coloring. It has many different features to apply to the pictures you take. It even has a video camera mode! The ONLY negative thing I have to say about it, is when you have it in camera mode, it does take up a lot of battery power. But that isn't a big deal because I mainly bought it to take pictures anyway. Overall very good camera! So glad I have it!", "Date": "January 14, 2013"}, {"Title": "Great bargain!!!", "Author": "Amazon Customer", "ReviewID": "R3ABBA90UM4LXU", "Overall": "5.0", "Content": "This camera is well built, loaded with features and the latest technolgy, and very reasonably priced. I'm glad I bought it and strongly recommend it.", "Date": "January 14, 2013"}, {"Title": "Nice", "Author": "AngieV", "ReviewID": "RCJQDMM5BRIGN", "Overall": "5.0", "Content": "Still trying to figure it all out but it seems to work great so far, love the color! Can't wait to experiment with it more!", "Date": "January 14, 2013"}, {"Title": "USER FRIENDLY!", "Author": "Mandy Rison", "ReviewID": "R3RI4MKM3FUX80", "Overall": "5.0", "Content": "LOVE IT!!! SO USER FRIENDLY AND GREAT PICS!!!I HAVE TWO ROWDY BOYS THAT NEVER WANNA TAKE PICS.. SO EASY TO SNAP AND GO I LOVE THIS CAMERA! AND IT CAME IN MY FAVORITE COLOR SO THAT WAS A BONUS", "Date": "January 14, 2013"}, {"Title": "Olympus VG-160 14MP DIGital Camera with 5x Optical Zoom", "Author": "Maurine B. Jones", "ReviewID": "RD7KIMKJ3M621", "Overall": "5.0", "Content": "This was a christmas present for my daughter and she loves it this camera takes great pictures she had an old olympusthat she had for many years and it still took great pictures i am thinking of getting one for myself great buy!!", "Date": "January 10, 2013"}, {"Title": "Value for money..", "Author": "Vinu", "ReviewID": "RYSODBEB8P1LY", "Overall": "4.0", "Content": "This is a good camera for beginners and causal photographers in this price range. Not so great for low light pics.. But cant complain for this price..", "Date": "January 7, 2013"}, {"Title": "Great camera", "Author": "Connor", "ReviewID": "R49OFSZQUX6X0", "Overall": "4.0", "Content": "I got this camera a few weeks ago and so far I am really impressed with it. The settings are easy to get to for the most part, and you can change quite a lot, such as picture and video formats. The pictures are good quality, except the flash always goes off even in normal light and it makes the lighting in pictures look white when it should be more of a yellow (like daylight). That is the only reason for 4 stars. Besides that everything is great, the video quality is good and audio sounds decent on actual speakers. Overall terrific camera for about $70.", "Date": "January 6, 2013"}, {"Title": "very nice", "Author": "roxy", "ReviewID": "R2WTZURA3OG1NS", "Overall": "5.0", "Content": "I gave this as a present .  But enjoying all the photos i received with it.  As a photographerI am picky.", "Date": "January 3, 2013"}, {"Title": "My son's first camera", "Author": "The Tiki \"Snail Herder\"", "ReviewID": "R2V7QNK7UM5VQ7", "Overall": "5.0", "Content": "This was purchased as a Christmas gift for my 10 year old. This is his first camera but has a small amount of experience using my older camera.I picked this camera because it lacks a view finder and using the display will be easier for him. The size is perfect for his smaller hands and the color, he loves the color. He was able to pick up the basic controls quickly but he hasn't explored the more advance settings.The art filters are nice. I played around with them a bit and they are similar to those found in photo software.Overall I found it to be a decent camera for the price and some of the features are much nicer than my own camera, which cost $50 more. I would definitely recommend this.", "Date": "December 29, 2012"}, {"Title": "}muy buen producto", "Author": "oscar guerrero cortez", "ReviewID": "R2BBAP6LEX50N4", "Overall": "5.0", "Content": "Esta camara es fantastica, en comparacion calidad precio es una oferta insuperable, y claro encima con la calidad inigualable de la marca olimpus, lo recomiendo", "Date": "December 23, 2012"}, {"Title": "Bought it as a gift", "Author": "E.T.", "ReviewID": "R39MQFFYGSZZSU", "Overall": "4.0", "Content": "Bought this for my 82 year old father-in-law. I was able to take pictures of it and make him a guide to use it. It takes very nice pictures.", "Date": "December 20, 2012"}, {"Title": "Kodak camera", "Author": "lebbo", "ReviewID": "R1KTM745LHGHCX", "Overall": "4.0", "Content": "Just recieved this camera gave it to my wife for early Christmas gift. Seems to work verywell. Am takeing sometime in getting it all figured out as this  was a refurbished camera. Still seems to me that if one is selling an item such as a camera they would send instructions for it. Fortunately I am able to figure it out but still a bit of a pain.", "Date": "December 18, 2012"}, {"Title": "I really like this camera", "Author": "nazinda", "ReviewID": "R37CQC87UZHXWN", "Overall": "5.0", "Content": "I decided I needed to upgrade my technology with the camera and someone recommed Olumpus.  I didn't know Olympus made cameras, I didn't mind taking a chance on Olympus because I have a voice recorder made by them the I am happy with.  So I confidence that I would love their camera too.", "Date": "November 27, 2012"}, {"Title": "olympus camera", "Author": "pmasta", "ReviewID": "R2KXE1DYEUM7QJ", "Overall": "4.0", "Content": "Compact and takes great pictures.Thin design easier to put in your pocket or purse.My son loves the bright orange color.", "Date": "September 20, 2012"}, {"Title": "Great camera!", "Author": "md9004", "ReviewID": "R2RA5RGJFZE5O2", "Overall": "5.0", "Content": "I bought this for my grown daughter for her birthday, and she loves it! As far as the features, etc, I don't know since I haven't personally used it, but she says it's great!", "Date": "August 19, 2012"}, {"Title": "Olympus camera", "Author": "E. G. Clemons \"ELIOT\"", "ReviewID": "R1PN0J8IKYPWXS", "Overall": "5.0", "Content": "A very nice compact. My wife loves it and I'm impessed with the features it has for such a low price. ITs Orange!", "Date": "July 19, 2012"}, {"Title": "This camera has regressed in technology", "Author": "E. Young", "ReviewID": "R2S21CUMTMUGCP", "Overall": "2.0", "Content": "I'm very surprised anyone would give this camera a good review - but maybe it's their first digital camera or they owned a really, really bad one before.  I had the previous olympus pocket digital camera, and it was so much better than this.  Every time you take a picture with this camera it has to \"think\" for a much longer time than any other digital camera I've ever used, before it will allow you to take another picture.  The zoom doesn't seem to work properly with the video feature.  And incredibly annoying - there's a two minute limit on video.  After 2 minutes, it stops videoing, and you can't just merely press the button for it to start again, because it has to think for a very long time before it is done processing.  It stinks.  My phone, which wasn't an expensive one, takes much better pictures and video without any of the excruciating processing time to wait through.  The camera was a total waste of my money and I'm pretty annoyed about it.Update: Now that I've taken pics OFF my phone, I see that it wasn't accurate to say those photos are better than the camera.  The camera's photos are better quality.  What's not good for me about the camera is the limited video and the processing time between each photo.", "Date": "September 23, 2012"}, {"Title": "Best lttle camera ever", "Author": "Cindy Carter", "ReviewID": "RQ80DGCG3NXEJ", "Overall": "5.0", "Content": "Takes excellent photos I am no pro and it makes me look good.  Would tell anyone to try it.  Sure to love", "Date": "February 13, 2014"}, {"Title": "Great little Camera!", "Author": "WlkrBee717", "ReviewID": "R23BT7ZI4LGMAW", "Overall": "5.0", "Content": "Orange is my favorite color - so I was very happy to find one. It's smaller than I thought it would be - no complaints though. Great price on this camera; about $25 cheaper on Amazon than other stores.", "Date": "January 23, 2014"}, {"Title": "Awesome camera for the money", "Author": "Dave Clute", "ReviewID": "R1UOUR7EWONJPA", "Overall": "5.0", "Content": "This camera does what I expected and with great quality. Easy to use and light weight. I recommended this to my friends", "Date": "January 13, 2014"}, {"Title": "AWESOME!!", "Author": "Merilyn Perez", "ReviewID": "R17UWG8Z9IL9YX", "Overall": "5.0", "Content": "It was very good and on time!! Highly recommended I really like this product. very good, I like it. great!!", "Date": "July 23, 2013"}, {"Title": "An orange camera with quality", "Author": "Someone54", "ReviewID": "R26V5WK80GP3HL", "Overall": "5.0", "Content": "Not a fan of the color orange. I am however a big fan of this camera. It is easy to use and several features that makes for amazing camera. Plus, if you the likes of New 32gb Micro Sd Card Sdhc Tf Flash Memory Card 32gb Class 10, New! Usa!, you can a massive amount of pictures. I recommend this for anyone looking for a great camera, even if you don't like the color orange.", "Date": "June 18, 2013"}, {"Title": "Everything I wanted", "Author": "Keri Rutkowski", "ReviewID": "R1RS3W0WST7067", "Overall": "5.0", "Content": "Everything I need.  Small enough to carry while hiking and takes great pictures.  Couldn't ask for anything more than that.", "Date": "May 30, 2013"}, {"Title": "Nice!!!!!!", "Author": "Meemaw", "ReviewID": "R1OJBLF7UF70FT", "Overall": "5.0", "Content": "It is very convenient.  I have an Iphone , but sometime the battery is low and I pull my camera out and it is handy", "Date": "April 23, 2013"}, {"Title": "A Nice Olympus Orange Camera !", "Author": "Francisco Alba \"Wizard\"", "ReviewID": "R2HXHHWOGW9KU", "Overall": "5.0", "Content": "A Smart Machine! - the Olympus VG-160 has it all . This is the camera that offers all the extras without the extra costs. The camera has creative features. Some of the features includes One-Touch HD Video, Magic Art Filters, a 26mm Wide-Angle Lens and 5x Optical Zoom. You'll capture great pictures and video.The Olympus VG-160 can do many things. This camera has a wonderful feature. The Olympus has \"Magic MAGIC ART FILTERS\".Now you can express your creativity with up to 12 special effects for your photos & HD videos. Olympus Magic Art Filters infuse familiar scenes with new and unexpected moods ranging from the exciting to the serene and from the whimsical to the mysterious. Choose from Pop Art, Pin Hole, Drawing, Fish Eye, Soft Focus, Punk, Watercolor, Miniature, Sparkle, Reflection, Dramatic and Fragmented.Another great feature for this camera is the \"INTELLIGENT AUTO + SHADOW ADJUSTMENT TECHNOLOGY\".Automatically identifies the scene you're shooting -- up to 30 different scene modes including Portrait, Landscape, Night + Portrait, Macro or Sports -- and adjusts the settings for ideal results. iAuto combines with Shadow Adjustment Technology to capture scenes exactly as you see them even in difficult lighting situations.This camera has \"HD VIDEO\". A simple, one-touch button allows you to record movies with amazing clarity in high-definition, right from your camera. This camera is easy to use.The camera dimensions are 3.8 x 2.2 x 0.8 inches.The camera weights only 10.1 ounces. It is portable. You can travel with it anywhere !Shipping Weight: 1 pounds", "Date": "April 19, 2013"}, {"Title": "The first one failed, but the second one is fine.", "Author": "Jimmy", "ReviewID": "R1JKLJ34I3N6JB", "Overall": "4.0", "Content": "After just a few days the camera had problems with lens retraction and turning on and off, as other reviewers have mentioned.  We sent it back to Amazon for replacement and the second one has worked flawlessly for three months now.  Good basic, inexpensive digital camera.  We are pleased with the one that works.", "Date": "April 11, 2013"}, {"Title": "Good price", "Author": "Victim of Vcom", "ReviewID": "R2AX0ZTK9E8W39", "Overall": "5.0", "Content": "Great pics ,easy to use, fast between shots even with flash. Olympus comes through with this camera. I would buy another one", "Date": "March 28, 2013"}, {"Title": "I know it's my camera", "Author": "Shanna Keller", "ReviewID": "R32DSGNEBFGXW0", "Overall": "5.0", "Content": "Not too many people can handle the awesome power of orange, I won't mistake it for soemone else camera at the family Christmas party again.And the quality of the pics and the ease of use is wonderful.I love Olympus.", "Date": "March 23, 2013"}, {"Title": "Save Your Money", "Author": "FLgranny", "ReviewID": "R1T79PHZ4KIQO8", "Overall": "2.0", "Content": "I bought this camera to take along on a nine-day Caribbean cruise.  It stopped working the second day, before we had even reached any of the islands.  Even the guys in the photo shop couldn't make it work right, all they could suggest was that I take it to a certified repair shop when we got back to the US (and they sold this same model camera on the ship), so I have no pictures of any of the places we visited.  Naturally, the last day it could be returned to Amazon was two days before we returned from the cruise.  Following the directions on their website, I contacted Olympus for a repair number to send the camera in.  That was three weeks ago, and they still have not responded.  They only have  two repair facilities in the US, one in CA and one in NY.  I live in FL.  My only remaining choice is to have the camera packed and returned to them by a UPS store (their requirement).  The nearest UPS store is 30 miles away.  Even though the camera is under warranty, I still have to provide them with my credit card information; I guess that is so they can charge me for shipping and handling.  At this point I just want to chalk it all up as a bad experience and forget about it.  Although I have had good Olympus cameras in the past, I doubt that I will ever have another one.", "Date": "March 9, 2013"}, {"Title": "Super easy to use, even for first timers!", "Author": "JZCheez", "ReviewID": "R2G46SR7TL1LOG", "Overall": "5.0", "Content": "This is a very easy camera to operate. It can make even novices, like myself, look like we know what we are doing with photos. The software is easy to use as well. Recommended!", "Date": "March 31, 2013"}, {"Title": "I love this camera", "Author": "mtayl75234", "ReviewID": "R3BPLBL0HCW791", "Overall": "5.0", "Content": "This camera replaces a Nikon Coolpix very low-end camera. In that case, I got what I paid for. While the price of my new Olympus VG-160 was not that much more, I can already tell that the workmanship is much better. For instance, the housing seems far superior. The door that houses the batteries kept breaking on the Nikon. I can already tell that this should not become a problem the the Olympus as it is metal vs plastic. Setup and charging the battery which was included in the Olympus; but not in the Nikon, was extremely simple. I needed on minimal assistance from my \"resident guru.\" I love the software which came with the camera. I have already organized photos and will now be able to enjoy viewing them either on my PC or TV. So far I have only taken pictures indoors. I may come back and update this review after taking pictures out of doors.", "Date": "March 24, 2013"}, {"Title": "Excellent, easy to use for novice but seems to have professional features as well.", "Author": "sixhose", "ReviewID": "R2NWM80B9JNOP8", "Overall": "5.0", "Content": "Love this camera - I have had two Olympus digitals in the past, both of which lasted a minimum of 4 years before having (admittedly correctable) issues.  So I did not do my usual exhaustive research before purchasing this Olympus. It takes a great picture out of the box, did not even have to set the time up and it let me take a picture. You probably do need an SD card, though - mine only took 14 pics before I was forced to download.  I couldn't really determine this need from the reviews I read or from the description - but fortunately i ordered the reasonably priced 4 Gb SD card from Amazon (appx $6 and free two day ship with Prime).", "Date": "November 20, 2012"}, {"Title": "Easy to use, pictures look great.", "Author": "Scott H. Simpson \"Hunter\"", "ReviewID": "R2N7YKQT8D6WDN", "Overall": "5.0", "Content": "I own an olympus DSLR so I when I needed a handheld I looked to them again.  I am glad I did.  This camera was simple to set up and was easy to learn how to use.  It has a good range of features to make picture taking easy and convenient.  I especially like the menu and how it works.  Now, when I don't want to lug my DSLR, I can pack this little camera and get quality pictures.", "Date": "November 14, 2012"}, {"Title": "Great", "Author": "Alan M. Nadaskay \"Vampire Zio\"", "ReviewID": "R2OTXP7RN0JEK", "Overall": "4.0", "Content": "So far the camera works as intended! Wish it had more built in storage for pictures.HD video looks great for a camera at this price.", "Date": "March 9, 2014"}, {"Title": "Nice camera but...", "Author": "Sea Bass", "ReviewID": "R1PWF4XYLHZGX5", "Overall": "4.0", "Content": "I purchased this to replace a low end Kodak that took photos with limited quality.  This is actually a nice little camera but the software is a little more difficult to navigate than the Kodak software. I was initially very disappointed in this item but am warming up to it...I do think this: it is nice to have all kinds of features and effects but how much of it do you really need considering what most people will photograph?", "Date": "March 3, 2014"}, {"Title": "Worked great....", "Author": "Onecooldad", "ReviewID": "R2SRNGZP5XYU2F", "Overall": "4.0", "Content": "Worked fine until I dropped it in the water while on a cruise. I enjoyed the time we spent together...", "Date": "February 9, 2014"}, {"Title": "Simple and Sturdy", "Author": "Kniffin \"Sarah Stalter\"", "ReviewID": "R2R92N1CFU9PTY", "Overall": "5.0", "Content": "I bought this camera for my little sister with special needs to replace one she dropped.  It works great for her.  It is simple enough for her to operate and it holds up really well (unless you drop it from standing on top of a stool onto a concrete floor - but what modern electronic wouldn't break from that).  Pictures aren't the top quality you'd get from a $600 camera but good for the price.", "Date": "December 3, 2013"}, {"Title": "Sim card needed right away.", "Author": "Eugene Routheaux", "ReviewID": "R1EIOZZW7APA9F", "Overall": "3.0", "Content": "The camera fills up after nine pictures. Would have been nice to be told to buy a Sim card right away or charge more and include the card with the camera as I can't clear and save the pictures without having access to my computer with the camera program I have installed.", "Date": "September 4, 2013"}, {"Title": "Love the Orange!", "Author": "The Beaver Den \"The Beaver Den\"", "ReviewID": "R2UV4IWN74VT96", "Overall": "4.0", "Content": "This camera is the perfect size for my sons' small hands.  He loves taking pictures and this camera has everything that he needs.  It has a good zoom, is good quality and user friendly.", "Date": "August 26, 2013"}, {"Title": "OK for the price", "Author": "molly", "ReviewID": "RF5215D42VN8Q", "Overall": "3.0", "Content": "Quality of the photos from this camera do not blow me away.  In fact I don't notice any difference between phone camera shots and those from this camera.  Glad I didn't spend much money on it because it's just OK.", "Date": "May 5, 2013"}, {"Title": "had to return", "Author": "liz1776", "ReviewID": "RS0LJS6Y2W6JO", "Overall": "3.0", "Content": "not what I wanted, and did not show the type ofbattery or image card, XD, SD MSDSorry, it didnt work for me.", "Date": "April 26, 2013"}, {"Title": "Olympus VG-160", "Author": "Dale Blanchard", "ReviewID": "R2W2JIJ0NEJ7B5", "Overall": "5.0", "Content": "this camera has made my girl frend very happy it takes awsom pic's and we both love it thank you very much", "Date": "March 21, 2013"}, {"Title": "Great camera", "Author": "JUliet Jacobson", "ReviewID": "RRMIXJ8DFMZIZ", "Overall": "5.0", "Content": "Excellent price, I wanted an Olympus, it came as advertised,  it was received timely,  I am happy with my purchase", "Date": "March 20, 2013"}, {"Title": "Olympus VG-160", "Author": "Daniel Abbott", "ReviewID": "RTUI9CG7A6RIN", "Overall": "5.0", "Content": "I really like the Olympus VG-160 it's a great camera and if you like taking picture or video then this camera is for you.", "Date": "March 19, 2013"}, {"Title": "Very Handy", "Author": "Charlie", "ReviewID": "RLW86E1SI6TBU", "Overall": "4.0", "Content": "I took this camera on a trip to Switzerland which gave me some time to test it out.  I sort of have mixed feelings about it.  I like the color of the camera, it's small and can easily fit in your shirt or pants pocket, the rechargable battery seems to last pretty long.  Uploading photos to my MacBook Pro with no problems.  the video is pretty good but I didn't buy the camera for that feature.  Many of the photos I've taken with the camera came out somewhat blurry, to blurry, or very clear.  Maybe with more patience I can get a clearer picture. The camera also makes some weird clicking sounds after I turn it on or when adjusting the lens back and forth.  I also tried using the panoramic feature but it never quite worked out right. The Olympus is much lighter than my Nikon D60 and fits in the palm of my hand.  I still like the camera and use it from time to time.", "Date": "March 7, 2013"}, {"Title": "Great little camera", "Author": "Paulette", "ReviewID": "R38MKV8I3A6TWS", "Overall": "5.0", "Content": "For such a compact little camera it does an awesome job!I am very pleased with this and recommend it to anyone.", "Date": "March 6, 2013"}, {"Title": "does a good job", "Author": "Clark Whitehouse", "ReviewID": "R26BAUF1OPDY3E", "Overall": "5.0", "Content": "it does the job ,its hard to say much about this it does what it should do and easy to use", "Date": "March 6, 2013"}, {"Title": "Great for travel", "Author": "Cara Martin Howard", "ReviewID": "R9T7PFPUJX3WB", "Overall": "4.0", "Content": "This is so small and compact if you just want to take fun pics for memories.  I have a fancy camera but did not want to take it with me on my trips to New York and Chicago.  This litlle camera is perfect compact and the pictures are great.  A good find for the price.  It does NOT come with a card so make sure you order one if you don't already have one on hand.", "Date": "March 4, 2013"}, {"Title": "ok", "Author": "tyler aduddell", "ReviewID": "R2PC00HBMU1Y94", "Overall": "5.0", "Content": "ok so i got this bc i never had a digital camera b4 so i got n i really like it", "Date": "February 4, 2013"}, {"Title": "Easy to use camera", "Author": "grandma B", "ReviewID": "R2KE99XE2BRDWQ", "Overall": "5.0", "Content": "I saw this on sale in a store ad in the newspaper. Looked for it on Amazon and found it for the same price. It's easy to use, and takes great pictures.", "Date": "May 23, 2012"}, {"Title": "I don't like it", "Author": "Tink", "ReviewID": "R3JENYKW7IW5ZT", "Overall": "2.0", "Content": "I bought this after reading reviews here and thought it would be just what I wanted.  I was replacing a similar ( I thought) Olympus that had worked great for me.  I'm actually on here now only because I was checking amazon's return policy.  Unfortunately I'm past 30 days before I really used it enough to discover the problems.  First, the picture quality doesn't look very good --  the flash doesn't always light up the subject, even in the same room and at the same distance.  I've had to delete so many pictures.  The operation of the camera is not intuitive to me.  At first, I was accidentally shooting video when I just wanted a photo.  Still don't really know what I was doing wrong.  And you absolutely need to add a memory card, it only holds about 10 pictures without it.  I do like the big viewing window and the orange color, but that's about it.  I don't think I'll order a camera again without first physically checking it out in a store.", "Date": "December 25, 2012"}, {"Title": "Doesn't work with Apple Macintosh computers, only PCs!", "Author": "Mary Holtman \"editor extraordinaire\"", "ReviewID": "R2U1EMKTXCUCDV", "Overall": "2.0", "Content": "I was very excited about this camera when I received it, only to discover that its software only works on PCs, not on Apple Macintosh (Mac) computers! I am all Macintosh all the time, so have been unsuccessfully attempting to return the camera to Amazon for a couple of weeks now! Apparently UPS can't find my address to pick up the package! What a complete hassle! Yes, I know I should have checked for Mac compatibility beforehand, but I've purchased five or six digital cameras in my life--Fuji Finepix, Oregon Scientific, etc.--and never experienced this problem before. Funny that they insist on putting all these bells & whistles on the camera, like video, which I'll never use, but they couldn't include Apple products!", "Date": "February 20, 2013"}, {"Title": "Orange Olympus camera", "Author": "Valerie Koy", "ReviewID": "RZVZAENW5KA21", "Overall": "5.0", "Content": "I purchased this camera primarily for two reasons.  I like the size of the camera and I like the orange color.", "Date": "March 17, 2014"}, {"Title": "Why??", "Author": "Gerald G houvener", "ReviewID": "R3AK221SZLX02C", "Overall": "2.0", "Content": "Once again my failure to do some basic research results in buying a whole slew of noncompatible accesories.  This camera uses a different style of memory card, different sized USB connector, and cables. So none of my other Olympus camera accessories work.  I have been a loyal Olympus user since the mid-1970's with my first SLR , an OM-2.", "Date": "February 4, 2014"}, {"Title": "camera color of orange was perfect.", "Author": "Cindy M. Varela", "ReviewID": "RVHMNAPWC3ROG", "Overall": "3.0", "Content": "It would have been a perfect purchase for my daughter-in-law except for the fact there was not a memory card with it. This was not mentioned in any of the pre-order advertisements.", "Date": "March 8, 2013"}, {"Title": "Constant Irritating Noise", "Author": "Amanda T.", "ReviewID": "RL37UZNGW2PK5", "Overall": "2.0", "Content": "So despite the two stars, I like this camera which I bought for a 9-year old girls who also likes it.Neither of us are camera officionads, but I've owned digital cameras before.It's really cute, takes clear pictures (I have not tried nightscape pictures as yet).The major problem I have and I'm hoping someone has a suggestion is that from the  moment we turned it on, it kept on making the noise of the lense zooming in and out, even when zoom is not being used. It never stops, not even when we're shooting video and the noise is being recorded. It is really annoying and detracts from what we'd actually like to record.I contacted Amazon who immediately sent out a replacement which is doing the very same thing right out of the box.Am I just getting cameras from a faulty batch, or is this normal for cameras today or is this a setting issue that I need to adjust?If I'm able to remedy this problem, I'll update my rating to 4 stars.", "Date": "January 27, 2013"}, {"Title": "BONITA Y FUNCIONAL", "Author": "YADIMAR", "ReviewID": "R2UKM97SF9BSJU", "Overall": "5.0", "Content": "MUY CONTENTA CON MI CAMARA ES PERFECTA PARA LO QUE LA NECESITO ES BELLA PEQUEÑA COMPACTA Y EL PRECIO MUY RAZONABLE ME LLEGO A TIEMPO LA RECOMIENDO A Y ES OLYMPUS", "Date": "July 30, 2012"}, {"Title": "Nothing worked and they wouldnt replace only refunded.", "Author": "Ruth Ann Marie Purvee", "ReviewID": "R1XKTMEI7BTNVO", "Overall": "1.0", "Content": "Ordered camera on my Prime because I was going out of town. Received the camera and after charging all night tried to use and set up the next day to learn none of the buttons worked.Wanted to replace the item but they will only refund, which means I now have to return the camera case and the camera card I also purchased to go along with the camera.So leaving tomorrow and have to leave all these items with a neighbor to send back.", "Date": "March 20, 2014"}, {"Title": "The camera is broken after 3 months.  It will not take pictures, the company said to replace memory card and it made no differen", "Author": "karen White", "ReviewID": "R3RBO7334HDBM9", "Overall": "1.0", "Content": "I bought this in March 2012.  It was working fine. I had just started a business that required pictures.  The camera stopped working and said \"stop protect\"  I called the company and the said to replace memory card.  That made no difference and the tech person  at the store had no clue but said it is locked.  I just started to sell my jewelry now I have no way to take pictures.  I am very upset..I can't afford a new camera", "Date": "June 8, 2013"}, {"Title": "La cámara funciona bien, peeeero...", "Author": "Eduardo J. Brown B \"ebrown\"", "ReviewID": "R2P2ZD10S2Z1LT", "Overall": "3.0", "Content": "La cámara llegó en buenas condiciones, sin embargo me decepciona un poco el hecho de que sea fabricada en China, no es un producto original, ¿qué debe hacer uno para obtener un producto que no sea made in China?The camera came in good conditions, however I'm a little dissappointed because it is not an original product, What do I have to do to get a product not being made in China?", "Date": "July 17, 2013"}, {"Title": "Broke in two weeks!", "Author": "Helen", "ReviewID": "RLFM9NREQLB0E", "Overall": "2.0", "Content": "To be fair, i really liked this camera when I had it, apart from the fact that it is very smudgy when there is no flash - i only got it as it was cheap for 2 holidays i was on. However, i was taking  a picture on day and it slipped out of my hands to the table which was about 10cm below and the lens broke! I should hav expected it as it was so cheap and i have sent it right back to olympus with a really long complaint! I hope theyre not going to be a challange to deal with, I have to pay for postage and the if they decide it is not within warrenty - i still have to pay £15 if i dont want them to fix it - so it really shouldnt be too much to fix it otherwise i will not be happy! It would be a good little camera if you are just very very careful with it!", "Date": "July 3, 2012"}, {"Title": "garbage", "Author": "charlie", "ReviewID": "R30M4Y9FYNTJ79", "Overall": "1.0", "Content": "did not work correctly from day 1. wouldn't open or close right and wouldn't always read the card.just over all  unhappy with the product", "Date": "November 17, 2012"}, {"Title": "dissatisfied", "Author": "Astrid", "ReviewID": "R3JWVVLL1AY8TQ", "Overall": "1.0", "Content": "the camera takes the picture, not turn on or off. not goodthiefwhere is the guarantee?answer, pleasethanks", "Date": "June 27, 2013"}, {"Title": "ok", "Author": "taffy", "ReviewID": "R366ZPHHYTUZSW", "Overall": "3.0", "Content": "I haven't used this camera much yet.  I was diappointed that it didn't come with a camera card.  I am still trying to learn how to used it.", "Date": "October 16, 2012"}, {"Title": "Olympus VG-160", "Author": "Bill Vacura", "ReviewID": "R1APUQKUO5D8HE", "Overall": "3.0", "Content": "These little cameras were very nice and worked great until they were stolen from my kids. Olympus VG-160, black, serial US3008008 and Olympus VG-160, silver, serial URW008917.", "Date": "July 21, 2012"}], "ProductInfo": {"Price": "$98.98", "Features": "3-inch LCD display\n14 Megapixel\n5x Optical Zoom\nHD Video\nArt Filters", "Name": "Olympus VG-160 14MP Digital Camera with 5x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QSbXNP0oL._SX300_.jpg", "ProductID": "B006ZAHMWI"}}