{"Reviews": [{"Title": "One cable bad - everything else great!", "Author": "RRose", "ReviewID": "R296QJSDE1F9N3", "Overall": "3.0", "Content": "These are fairly standard 12v BNC video cables for CCTV systems (Q-See, NightOwl, Lorax, etc). The cables come in a 66' length, which is 6' longer than the standard ones that come with Q-See systems.  Believe it, or not, this 6' has come in handy a time or two - especially when you only need another few feet for some camera, and the next available length is 75'... nothing like having 22' of unused cable sitting over the secretary in your client's drop ceiling... These cables are great when you need 'just a little more' length.  The cables are heavy, too - quality connectors and solid power leads.  Despite these positives, the last 2 batches of these that I ordered, both batches of 4, only 3 of them were good in each order... I didn't contact anyone, or take them back for exchanges - they were so cheap ($8/each) and I have others laying around.  At that price, no complaints - 3 stars.", "Date": "May 13, 2012"}, {"Title": "Not a new purchase", "Author": "E. Cady", "ReviewID": "RG2358Y3BIYCI", "Overall": "5.0", "Content": "I have purchased these cables before and have found them to be excellent.  Have used this set yet, I am planning to use them when I assemble the security system that i have been building from a micro-ATX computer.", "Date": "October 27, 2013"}, {"Title": "very good quality cables", "Author": "Dre2000", "ReviewID": "R2YTVIL9WR6SQ1", "Overall": "5.0", "Content": "I will buy again wished they gave a better deal on large quantity orders.  The cables are much better then the ones that come with the system.", "Date": "October 23, 2013"}, {"Title": "Good product", "Author": "michael gonzalez", "ReviewID": "R1MG08GFISCX2I", "Overall": "4.0", "Content": "Got what I ordered you can not beat the price for what you are getting helps a ton when working with camera", "Date": "August 21, 2013"}, {"Title": "Did the job", "Author": "Mary and Charles", "ReviewID": "RU2WWBSU7X6LQ", "Overall": "5.0", "Content": "Just what was needed to make it that extra distance through the attic.  Basic, low cost, effective.  Worked for me.  Recommended.", "Date": "August 18, 2012"}], "ProductInfo": {"Price": "$89.99", "Features": "Plug and Play ready; For camera with DC power only\n4 of 66 feet video/power cables in white\nRCA video & 2.1mm power connectors\nAll-in-one video and power cable\nBNC connectors and includes 8 RCA/BNC adapters", "Name": "VideoSecu 4 Pack 66ft Feet Security Camera Video & Power BNC Cable for Home Surveillance System with Free BNC RCA Connectors CBJ", "ImgURL": "http://ecx.images-amazon.com/images/I/412mMPeEUmL._SY300_.jpg", "ProductID": "B006B2JNPE"}}