{"Reviews": [{"Title": "Great price for high quality camera.", "Author": "Nick", "ReviewID": "REIQCUGK5C77J", "Overall": "5.0", "Content": "Ranked in the top 5 on consumer reports and for only $150.  Great deal and the camera takes great pics.", "Date": "March 9, 2013"}, {"Title": "Think about these things before purchasing", "Author": "T. Carson", "ReviewID": "R14TAVH62Q748I", "Overall": "3.0", "Content": "I used credit from squaretrade to get this when my other camera died. This is a nice little camera, with two flaws. If you want to take  widscreen (15:9) pictures, it will only take them at 12 megapixels and not 16. You have to take fullscreen photos at 16mp. The other thing, is the touchscreen. The touchscreen replaces stuff that really needs like a dial to quickly set like the picture mode and so on, instead of fumbling around with the touchscreen all the while what you were trying to take a picture of is gone or changed.They could have made the interface much better but, it works, and I suppose you can get used to it. As for the 3D, I took a 3D picture, plugged it up to my TV, which detected the 3D, but there was not a 3D effect at any kind. I have a vizio passive 3D TV. Anyway, it could not have been that good of 3D regardless with only one lens, must be some kind of fake 3D effect.I will be keeping this camera regardless of the shortcomings, because it feels nice, has a large screen, photo effects, and it takes good pictures.", "Date": "June 24, 2013"}, {"Title": "very large camera in a tiny package", "Author": "Richard E. Jones \"INJones\"", "ReviewID": "R1V22YT0Z7D71G", "Overall": "5.0", "Content": "I have five pocket cameras. This is the smallest and is my favorite.  I had to give up a little on the zoom but intakes great pictures and is so convenient.  It's the perfect travel and family camera", "Date": "March 14, 2013"}, {"Title": "Nice camera", "Author": "NC State Karen", "ReviewID": "R1P9K0QSU04ZK2", "Overall": "4.0", "Content": "There are a number of technical reviews of this camera that were very helpful to me in purchasing this camera.  I thought I would speak more to the use of it.I had the previous version of this camera, as did my husband.  It had a toggle switch to go from photo to panorama to video.  On both cameras, the toggle switch broke.  This camera has the movie switch on the screen.  So it is not a physical switch.  That seems like a great improvement since both of ours broke.  The only problem I have found is that I push movie and nothing happens.  It takes several times to activate the video, which means I often miss the beginning of what I want to tape.  I also have trouble turning it off (but have found if I just turn the camera off, that take care of it - which I do when taping my kids on an amusement park ride that I am riding, too).  I have bee working with it for weeks & it still doesn't seem to help.  It is faster than the toggle switch was, but still a lower than I would like.I also wanted to mention that this one uses a different size charger port than the previous version of this camera.  So your old charger/UBS port cables won't work on this one.  Luckily, my cell phone charger is the same, so I have been able to use that to charge & keep the download cord on my PC.My only other suggestion would be for it to have a force flash.  It seems to take better photos when the flash goes, regardless of the light.  It only has auto & no flash.  It was the same of the old camera.Overall, I have been very pleased with the photos & video.", "Date": "April 27, 2013"}, {"Title": "Sony Cyber-shot DSC-WX70, great buy.", "Author": "Amrita Kapoor", "ReviewID": "R1V281CQXYO3MY", "Overall": "5.0", "Content": "I bought the DSC WX70 as my Nikon Coolpix had a shutter problem, as a fill in as I was travelling but was pleasantly surprised because its really a great camera and truly VFM. It is very compact, the auto focus is great and fast, a true point and shoot. The video quality is great including the audio. The only thing which is a very minor problem is the touch screen interface which is a little slow and the night pics are ok not great, though still better than other cameras of the same genre. I so do recommend it as a \"capture that moment in a flash\" camera.", "Date": "August 14, 2013"}, {"Title": "GREAT LITTLE CAMERA", "Author": "Steve Harris", "ReviewID": "R3REEDD48DENHO", "Overall": "5.0", "Content": "This is a great camera...I highly recommend it. The zoom is wonderful, and the pictures are crisp and clear. SOMETHING EXPECIALLY GREAT ABOUT THIS CAMERA IS THE BATTERY LIFE. I shot 225 pictures over a 12 hour period and still had one bar left on the battery charged indicator. I highly recommend this as a great camera. It is very small, but has a large screen to view pictures and works even in the brightest of sunlight. There is nothing to learn, or very little. Charge it and use it.I bought this based on a Consumer Reports recommendation and they were right!", "Date": "July 30, 2013"}, {"Title": "LOVED IT", "Author": "Beatrice Knight", "ReviewID": "R2UCD05R070895", "Overall": "5.0", "Content": "I purchased this camera because I was taking a trip to Africa and wanted a camera I could trust to take good photos.  This camera met all of my expectations and more.  I have great pictures and videos.", "Date": "July 1, 2013"}, {"Title": "Love it!", "Author": "Bette", "ReviewID": "RRXO6NPCPPB4Y", "Overall": "5.0", "Content": "This is a fun camera that takes bright and clear pictured. Fast picture taking and great price. What a difference from the cool Pix- Nikon that I owned. It took awful pictures compared to this sony.", "Date": "May 2, 2013"}, {"Title": "Handy, small, great photos", "Author": "James Roach", "ReviewID": "R15YXES2LLVRPN", "Overall": "4.0", "Content": "This camera worked out to be a great vacation camera.  small enough for a front pocket.  enough pixels for great photos.  hard to see screen outdoors.", "Date": "August 15, 2013"}, {"Title": "Camera is very low quality", "Author": "Amazon customer", "ReviewID": "R10W9UQEII6E4H", "Overall": "1.0", "Content": "This camera broke after a month.  It would not charge or work, and the lens was stuck open.  I called Sony for help and they are having me send it back for repairs, but they are not paying for shipping and they are having me jump through many hoops to get it repaired.  I have no issue with the Amazon service, which was fine, but I would get a different camera.", "Date": "August 9, 2013"}, {"Title": "excellent quality", "Author": "carlos vaamonde", "ReviewID": "RQW14DDNLIMPN", "Overall": "5.0", "Content": "The camera I arrived in excellent condition, all sony cameras I have had this is the best, lightest and being fully tactile manipulation becomes more comfortable, the resolution is good quality .. I came with all accessories ....", "Date": "August 5, 2013"}, {"Title": "Couldn't be happier!", "Author": "Yvonne", "ReviewID": "R2WKQVE6VN4LJZ", "Overall": "5.0", "Content": "Love this camera! Easy to use & love the picture quality. Had a Nikon Coolpix prior that I always had problems with blurry pics. This camera takes clear, sharp photos. Highly recommend.", "Date": "July 2, 2013"}, {"Title": "Good photos, but poor construction", "Author": "FlockForman", "ReviewID": "R3HOENKMWOUC9A", "Overall": "3.0", "Content": "This camera takes good photos and is fairly easy to use. The main problem I have had is in regard to the connector that is used to charge the battery while in the camera. The connector developed a short the second time I tried to charge it. Now I have to remove the battery and put it in an external charger. You also have to remove the Scan Disc and put it in a card reader. So essentially there is no longer any direct  camera / computer connection. Poor construction.", "Date": "April 22, 2013"}, {"Title": "Shutter will not open/close properly", "Author": "Christina Gouglev", "ReviewID": "R1YJS7H9AU8UOG", "Overall": "2.0", "Content": "I've only had this product a couple months, and already having problems with the front staying open after the power is turned off. Disappointed because I love the color and touch screen, but if I can't even pack it back into a case...", "Date": "April 16, 2013"}, {"Title": "Excellent small camera with touch screen control", "Author": "Ed Hafner", "ReviewID": "R3J84VT8B6AW42", "Overall": "4.0", "Content": "This very compact camera takes great pictures either with its auto settings or with semi- manual control using the P setting. Using the latter enables you to use a fill flash, which another reviewer missed in listing the apparent lack of fill flash as a negative. On the touch screen, you can have 3 favorite controls, such as exposure compensation, iso setting, and flash on/off instantly available (instead of menu searching for them.) Looking at the LCD screen while composing a shot, you can touch where in the scene you want the focus to be. Very nice \"touch.\" The camera seems to be discounted quite a bit, probably because newer models are available. This makes it an excellent value for a nice, compact carry around camera. I am happy I bought it.", "Date": "May 12, 2013"}, {"Title": "Nice camera", "Author": "Pratyush", "ReviewID": "R1BD2RHPTS1JRJ", "Overall": "4.0", "Content": "The camera is good and solves its purpose. The only problem is its touch screen. Its screen is small and hard to navigate around it and sometime by mistake you will change the setting. It happened with me somehow the language get changed from English to Spanish.", "Date": "January 25, 2014"}, {"Title": "Camera does not work at all now.  We purchased a new battery and it still won't work.  If I could give no stars, I would.", "Author": "Barbara E. Mayo", "ReviewID": "R215LPPHR1IAFF", "Overall": "1.0", "Content": "Bad purchase which surprised me since I have always been happy with a Sony product.  Will not purchase another Sony camera again.", "Date": "January 22, 2014"}, {"Title": "Sony Cyber-shot DSC-WX70 16.2 MP", "Author": "Serena S. Major", "ReviewID": "RM74J7459Q9UY", "Overall": "4.0", "Content": "I love this camera wish I had bought the bundle insteadnow i have to buy every thing else seperatly", "Date": "January 21, 2014"}, {"Title": "Cyber Shot Sony Camera", "Author": "zoecat", "ReviewID": "RSUI3MB7S5FIJ", "Overall": "4.0", "Content": "I had lost my older Cyber Shot camera and loved it. I bought this one and love it. Easy to use and can put it in my pocket. Great for vacations!", "Date": "January 17, 2014"}, {"Title": "OK Camera", "Author": "Jen Finn \"OSUfan\"", "ReviewID": "RN9BLXW96KGG6", "Overall": "3.0", "Content": "This is an OK camera for the price ... Pictures are not as sharp as I would have expected.  Not bad in low light but had some red eye issues.", "Date": "January 7, 2014"}, {"Title": "Quality not as high as expected", "Author": "beever_cleever", "ReviewID": "R1U0RDD8JHKCEE", "Overall": "3.0", "Content": "I had an older version of this camera until my grandson dropped it. This model is very easy to use, and does take very clear pictures.  However, I feel the quality of the body of this camera is not as sturdy as the previous version.a The battery door does not shut properly, and I doubt the camera will last as long as my old one did, dropping aside.", "Date": "December 17, 2013"}, {"Title": "Great product from a die hard Nikon Pro DSLR user", "Author": "Vortex", "ReviewID": "R2EJINU625MV5", "Overall": "5.0", "Content": "I got this as a present for my 7 year old daughter and she just loved it. It has a very intuitive shooting mode that changes to macro or whatever mode is needed very easily. She doesnt have the best eyes so I am thankful such a large screen for her to view. Battery life seems to be OK, but of course no one remembers to check before we need it.", "Date": "November 27, 2013"}, {"Title": "Many useful features.", "Author": "Hahn T.", "ReviewID": "R2M5RICDEN7UC0", "Overall": "4.0", "Content": "I have the camera for a few months now, and I have taken it on trips to central Enrope and Asia. The little camera has many very useful features to create good pictures. I particularly like the intelligent mode when the camera automatically takes the picture with multiple settings to let you choose the better one. The touch screen user interface is convenient. Only drawback is that the screen is hardly useful in the glare of bright light, and there is no view finder option to work around the temporary problem.", "Date": "November 11, 2013"}, {"Title": "An essential budget camera", "Author": "Igor Foukzon", "ReviewID": "R3OI1ETE4ES1T6", "Overall": "5.0", "Content": "Handy touchscreen, lots of capturing modes with further adjustments inside, outstanding night ability. 17x zoom on 5MP mode, surprisingly tolerable in its quality (though, of course, it is not recommended to pass the border of 5-10x). I didn't notice the edge aberrations, but if you face the problem, 1.2x zoom can help. Good value for the money in all other respects. To my mind, it can cost a fourth more and still not dissapoint.", "Date": "November 4, 2013"}, {"Title": "Small but packs a whollup!", "Author": "MeanBrew \"Meanbrew\"", "ReviewID": "R3IHASR5HVZXQN", "Overall": "5.0", "Content": "First of all, purple is my wife's favorite color and secondly, this little camera fits the bill. She can easily slip it in her purse and take HD videos or pics quickly and most important easily.", "Date": "October 26, 2013"}, {"Title": "review of Sony DSC-WX70", "Author": "Samuel Famoso", "ReviewID": "R7O1QIUS8HK82", "Overall": "5.0", "Content": "great camera, my wife loves it, she takes it everywhere, as she doesn't want to miss any moments of our 4 grandkids", "Date": "October 21, 2013"}, {"Title": "Sony DSC-WX70 super pocket camera", "Author": "Rocky", "ReviewID": "R3OY27H7049GS5", "Overall": "4.0", "Content": "The performance of the camera is more than I expected. The instruction manual leaves a lot to be desired and my imagination.", "Date": "October 9, 2013"}, {"Title": "Serves the purpose", "Author": "Teresa", "ReviewID": "R1OXN3ZCWEUCKQ", "Overall": "4.0", "Content": "I sought a camera for convenience as do not use the cell phone.  Its relatively easy to use for those who are used to the tech world and gadgets.  Myself a slight learning curve.  Battery lasts quite awhile and the transfer to computer was pretty straightforward.", "Date": "October 7, 2013"}, {"Title": "Quick and Easy to Use", "Author": "Anne Kozel", "ReviewID": "R2NHO4HTAXSNPL", "Overall": "4.0", "Content": "Got this camera quickly for a trip that came up on short notice.  It was very easy to use.  The only negative was that you can't email or post photos directly from it (at least not that I've  been able to tell).  It is simple to plug in though and transfer photos to any computer.", "Date": "October 7, 2013"}, {"Title": "Not quite", "Author": "Lars", "ReviewID": "RZ5NBQI8O6EZB", "Overall": "3.0", "Content": "Got this in August.  I like the compact size for carrying around in my pocket.  However, the small size of the screen can be maddening with my male fingers.The photos are clear.  I think the delay between pushing the shutter button and the actual picture taking is too long.  The few avi's I've taken have been pixelated.  Maybe I need more practice.This week the lens would not close.  I'd power on the camera, the lens would extend, then the camera would turn off.  Since it is still under warranty, I've sent it for repair.", "Date": "October 4, 2013"}, {"Title": "Takes nice pix...very confusing.", "Author": "Ezlypist", "ReviewID": "RFS33S0KXISCX", "Overall": "4.0", "Content": "Ok, I'm severely technically challenged and many of you may think it's not fair to take off a star  because of my inadequacies...but I think it's important for anyone going into this that's not tech savvy to know, they are in for a struggle. The instructions are basic and I believe they could have put more info into them.I have emailed Sony and did get quick response, so that's helpful...but the answer was condescending enough that I'm not in a hurry to ask anymore dumb questions before struggling w/camera myself.Also, you need a storage card if you want to take more than a couple of pix and NOT have to download/empty the camera storage. That would have been nice to know before buying.It's pretty, it's got lots of features, and I'm hopeful it will last longer than my 'state of the art' Nikon w/6 pixels (Gives you an idea of how long ago I bought it).", "Date": "October 2, 2013"}, {"Title": "I cant understand why people like this camera so much", "Author": "Familyofsix", "ReviewID": "R2W4OAOZABBDYB", "Overall": "1.0", "Content": "I bought this camera wanting something small to carry around to take pictures of my kids with.  I wish I had purchased something else.  I have a great larger camera, but due to its size, its not always appropriate to bring along.  This camera was going to fill the gap.Pros:SmallInexpensivelarge displayCons:Hard to figure out settingsThe touch screen buttons are too small - I am a woman with average sized hands, I now understand why men get so frustrated.The on/off button is too small.Too long of a delay from when you hit the button to take a picture - with kids, I want instant snap.  This will make you wait and you not able to capture the moment.If you have low expectations, small hands and dont want to use this on kids or pets, you will probably like the camera.  Otherwise I suggest continuing to look.", "Date": "September 30, 2013"}, {"Title": "Done with cybershots", "Author": "Joseph P. Campana", "ReviewID": "R3DIVQYXYVHHZI", "Overall": "2.0", "Content": "I had previously owned a cybershot and was looking to upgrade. While I was never very impressed with my 6mp cybershot before, I saw that places like consumer reports recommended this one. I am gravely disappointed about everything about this camera.First, images come out blurry. Even with the little tripod stands I have for my previous cybershot (which still fit this one perfectly), bright light on your subject, anything (settings, etc) I've tried, the image comes out very unclear. There is nothing \"HD\" about it. Sure I can zoom in (to 100% mind you, not beyond that) but the image is horrible.Second, I don't know if I was sold a defective model, but when I shut my camera off, half of the time the lens doesn't retract and gets stuck in the open position. I have to remove the battery and replace it after a few seconds for the camera to cycle through and close itself.Third, (and this goes hand in hand with the first) the video quality is extremely disappointing.  Unless it's glaring light on your subject, the video goes super blurry. Now I understand the better the lighting, the better quality I'll get, but again consumer reports said that this camera rated extremely well in low light situations. This is sadly not the case.Needless to say, I will NEVER purchase a cybershot again and would never recommend anyone to do so. This was fulfilled by Amazon and sold through \"Cardinal Camera\" by the way, though I can't say that that has anything to do with my overall experience.", "Date": "September 23, 2013"}, {"Title": "Fantastic", "Author": "Carol Shipp", "ReviewID": "R23TG7D8O6282S", "Overall": "5.0", "Content": "I bought this camera to take on a cruise because it is so compact and lightweight.  It did not disappoint me at all.  I love how many different features this tiny camera has.  My pictures are wonderful, even those I used the zoom on.", "Date": "September 22, 2013"}, {"Title": "I would by this again. Fits in pocket.", "Author": "morgame", "ReviewID": "R2ZJJZLQ3PKUKR", "Overall": "4.0", "Content": "Nice Camera, Love how small it is, takes up no room yet takes quality pictures and is easy to use. Battery last so much longer than my old camera with the AA batteries. Carry spare battery though if you plan on taking a lot of pictures.Thing is it takes about 11/2 hrs to fully charge in the camera. Overall I would say I'm Pretty satisfied. I didn't give 5 Stars because in sunlight it's hard to see the screen but that's with all these cameras. I would have liked to have had a view finder. I like it though.", "Date": "September 19, 2013"}, {"Title": "Only one problem -", "Author": "Dollye", "ReviewID": "R32MKYFUTA5L77", "Overall": "4.0", "Content": "This camera produces great photos! The only problem so far,  is if you have used the zoom feature, it will take several seconds 3,4,5 seconds to focus. That can cause you to lose the shot. Very small with easy to use controls.", "Date": "September 14, 2013"}, {"Title": "Sony Cyber-shot.", "Author": "Donna W Parker", "ReviewID": "R3ULCPP080BK1", "Overall": "5.0", "Content": "Spouse loves it.  It is slim, fits into pocket and easy to use.  Very good pictures  and easy instructions.  Great.", "Date": "September 10, 2013"}, {"Title": "Good things do come in small packages.", "Author": "Jane Saunders", "ReviewID": "R3AUTZPOMUFB2H", "Overall": "5.0", "Content": "I was not expecting the camera to be so small but it does everything you want it to and it is so easy to take with you.  It is very easy to use and the photos have been great.  I read reviews and did some research before I ordered and for the price, this is tops.", "Date": "September 6, 2013"}, {"Title": "Compact size easy to carry.", "Author": "Ronald R. Burak", "ReviewID": "R348LNF4893Y0P", "Overall": "4.0", "Content": "Have only used camera for a few weeks.  Picture quality does not appear quite as sharp as the Fuji camera I had previously.  Have not produced any pictures yet  so I will have to better judge later.  Flash pictures seem to washout closest subjects.  Better evaluations to follow.  Impressed with all the features it has.  Easy to use.  Very happy with the zoom..", "Date": "August 15, 2013"}, {"Title": "Very Nice Point and Shoot Camera", "Author": "R. Bond \"Love to Read\"", "ReviewID": "RSCDUK9YF3GO6", "Overall": "5.0", "Content": "I'm not a photographer.  I wanted something that would allow me to take reasonably good pictures without having to know anything about settings.  This camera is super-easy to use and does a nice job.  The picture clarity is really great.  The color typically runs a bit yellow in lower light, so it's not perfect.  But in brighter light, that problem disappears and I can use software to adjust the yellow tint out of the lower light pictures.  The good news is that it does a good job of taking pictures in very low light, which has been a challenge with past cameras and the color in other lighting situations is very true.  The time elapse between when the button is depressed and the picture is captured is fast.  I have two dogs and have struggled to get pictures of them if they were moving at all.  With this camera, I've been able to get some great action shots.  And I haven't even played with all the features yet.  The touchscreen is nice...makes it even easier to use.  I'm very happy with it.It's not a high-end camera, but it doesn't cost that much either.  It's a great value for the money and if you're like me, aren't a photographer and don't have plans to become one, you can still get great pictures with this camera knowing absolutely nothing about photography.", "Date": "August 13, 2013"}, {"Title": "good value easy to use", "Author": "WLL", "ReviewID": "R1P7VBE0IJIBFI", "Overall": "5.0", "Content": "amazing capabilities  shoots short videos and panoramic  sequence shots the flash is phenomenal for full or fill. easy to carry", "Date": "July 20, 2013"}, {"Title": "Good Camera", "Author": "Francis Michael Breuninger", "ReviewID": "R2IOAT7ZHZYVC5", "Overall": "4.0", "Content": "We purchased the camera for our son's graduation in Boston. The camera is easy to use and it takes great pictures. We love the touchscreen function.", "Date": "June 13, 2013"}, {"Title": "I'm Loving It!", "Author": "J Moss", "ReviewID": "R3U882401TALTO", "Overall": "5.0", "Content": "This is my 1st Sony camera which i've had for only a week now. The compact size took some getting use to but nice to be able to keep in purse n use in a moments notice since my cell phone pics & videos come out crappy. My objective to trying this camera was the sensor for capturing nice pics in low lighting and this camera did not disappoint! The pics come out superb which sold me hook, line & sinker for the $99 price. The iauto feature is great for most of my surroundings but the twilight & high sensitivity settings blew me away with vivid night pics. I'm learning now to think about the surroundings, light quality and what setting i should use more before taking shots to get the best pics I can. Being lazy, in the past I wanted the \"point & shoot\" to do ALL the work lol. Now I'm also enjoying some of the fun features of the camera as well like the watercolor, miniature, 3D & partial color settings! The in-camera guide is great too. You just press the ? mark, press the feature and up comes full instructions! Nice not to strain the brain trying to remember what a paper manual said the setting was for.......the manual is built in! So cool! I'm loving the 3 inch TOUCH SCREEN so much which most tech gadgets are nowadays.All I can say is give this little guy a try & you may be hooked too. And I also bought the service agreement in case of issues later on as a couple of reviewers stated they had........$16 for more peace of mind instead bad. Bottom line for me: I'm extremely satisfied!", "Date": "May 28, 2013"}, {"Title": "Great little camera for having in the pocket!", "Author": "ASH \"ASH\"", "ReviewID": "R3CJAHQJESF1MK", "Overall": "5.0", "Content": "Bought this as a gift, so I have used it very little, but what I can say is that it is a very small camera good for everyday use. It has a very limited zoom at 5X, but then again, at this time one can't find too many better cameras at this price level. If you want something better, spend more and get something that will be more versatile.", "Date": "May 6, 2013"}, {"Title": "Good but comoplicated without ooperating manual", "Author": "edward miller", "ReviewID": "R3VQLJL1EGLSVM", "Overall": "4.0", "Content": "I am awaiting the operating manujal which I ordered for $18.95 to get more info on how to perform many of the functions, some that should be simple but aren't. I need further experience to give a proper rating.", "Date": "July 31, 2013"}, {"Title": "sony cyber-shot camera", "Author": "Carol Perry", "ReviewID": "R2EX06SBJVPQY5", "Overall": "5.0", "Content": "This is a very small handy camera that is just want I was looking for, easy to operate and carry in your purse or pocket and I love the 3\" display screen.", "Date": "July 6, 2013"}, {"Title": "Perfect!", "Author": "AJR36", "ReviewID": "R3VBP2D4LUCVAD", "Overall": "5.0", "Content": "Wow, this is so much better than I even expected! For a point-and-shoot camera it has more than a person even needs! There are lots of fun things you can do with it like take panoramic shots, black and white, balance out skin tone, etc. It is very compact and light-weight and takes excellent pictures and video. It has a touch screen and is very easy to learn to use all the features. I am very happy with this camera!", "Date": "June 22, 2013"}, {"Title": "A great camera", "Author": "Cecilia", "ReviewID": "R28W53NQA097X", "Overall": "4.0", "Content": "It's a really nice family camera, easy to use, It takes high-quality photos.It meets my expectatios. I'd recomend it.", "Date": "July 4, 2013"}, {"Title": "my initial observations", "Author": "mom many years", "ReviewID": "R3KHND54Y5JHRE", "Overall": "5.0", "Content": "First it really is a tiny phone.  It is about the size of my cellphone.  The purple is very pretty and the touch screen is a nice addition.  It really does work in low light conditions as I took a picture of my baby in my room (which is as dim as if it was lit by candlelight) and it came out as if I had taken it outside on a nice sunny day without a bright flash going off.  The battery is very tiny.  I purchased the additional batteries so I can forsee this being a great vacation camera.  It comes with software which I haven't had a chance to try which allows you to plug your camera into your computer and instantly upload your pics to your favorite sharing mechanism.  But I haven't tried it out yet.  It says it can even be used with playstation.  wild.  I will try to update in a few months my reactions to this camera.", "Date": "June 21, 2013"}, {"Title": "Great Camera", "Author": "R. Krueger", "ReviewID": "R1DIR1NJO0PCI2", "Overall": "4.0", "Content": "So far so good - no great! It's small and very powerful. Can't wait to take it on our holiday trip!", "Date": "June 20, 2013"}, {"Title": "GOOD CAMERA", "Author": "katiuska alexandra otero gonzalez", "ReviewID": "R1D3NG9NCZXP3W", "Overall": "4.0", "Content": "excellent high resolution camera 100% good price as from Venezuela, MUY BUENA ENTRE LAS BUENAS.LA RECOMIENDO PARA TODO EL MUNDO", "Date": "July 29, 2013"}, {"Title": "great camera", "Author": "mike", "ReviewID": "R1O9SR0HCZWZQ0", "Overall": "5.0", "Content": "still finding newthings this camera can do love it easy to use you wont go wrong with this one great", "Date": "June 19, 2013"}, {"Title": "Present.", "Author": "Mandrake", "ReviewID": "R3PVHXH0NOZQ6X", "Overall": "4.0", "Content": "It was for a present. Cannot say more.Trust the reviews from CR and other sources. No complaints as of yet.", "Date": "April 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "16.2 megapixels\n5X optical zoom\n3.0-inch LCD\nFull HD 1080/60i with dual record of stills and movies\nPicture Effect for more expressive photos", "Name": "Sony Cyber-shot DSC-WX70 16.2 MP Digital Camera with 5x Optical Zoom and 3.0-inch LCD  (Silver) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41k9sAbQLIL._SX300_.jpg", "ProductID": "B006K553ZQ"}}