{"Reviews": [{"Title": "Worst product I've ever had to deal with.", "Author": "Carl Burchfield", "ReviewID": "R3QX5ZB3T7NX47", "Overall": "2.0", "Content": "After updating a client's computer network to WIn7/IE10 found that webclient.ocx plugin does not work on IE9 or 10. After DAYS of searching, found the support site for it at ltsecurityinc.com and found kernel and firmware update downloads. Downloaded and installed updates with no issues. Seemed to have gone flawlessly. But nooooooooo! When I hooked it back up to my 12 video cameras, every channel now shows \"video loss\" and while it is recording to the 1TB HD, it's recording nothing!  Attempts to email support result in a bounceback message of \"relay not allowed\". HUH? I'm not relaying squat! So I checked the mailto link, and while the text reads techsupport@ltsecurity.com, clicking the link opens an email composition window with a TO address of ltcom.com.  Apparently, this company builds products the same way they build their website. This is my first experience with LTSecurity products, and it will most definitely be my last.  I will recommend my clients avoid this company's products at all costs. Product is unreliable and tech support is practically non-existant.", "Date": "December 9, 2013"}, {"Title": "Cheap DVR option", "Author": "Chris Reeves", "ReviewID": "R1DRMZ7LUBVNCZ", "Overall": "3.0", "Content": "It is functional for a localized device.  Does not support Windows Phone 7.5 or 8, also doesn't work correctly with Android 4.2 and newer, have not tried iPad/iPhone options... it tries to install cab files, I assume for older Windows Phone and fails.  I have been unable to find any web support to update firmware.  PTZ is very hit and miss, sometimes functional sometimes not very functional.  Decent enough if you need a DVR on the cheap.It comes with no links to any support website or any information, so while it has an option to 'update firmware' (which might fix some of these issues) in the web client, it is unclear how or where you'd get any update for this.", "Date": "November 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00601IE38"}}