{"Reviews": [{"Title": "Kodak EasyShare C1450", "Author": "J. Zielinski", "ReviewID": "R3AHGH61T8M9KV", "Overall": "5.0", "Content": "Great little camera. Pictures are sharp and color very good. Great thing is you can use inexpensive AA alkaline batteries or rechargeable ones. No expensive special battery to buy. Camera has nice feel and has a very large 3\" lcd screen on it. Recommended buy.", "Date": "April 21, 2012"}, {"Title": "Great Product", "Author": "Matt", "ReviewID": "RF71HKSZ9LCCK", "Overall": "5.0", "Content": "Got mine on sale during black friday for $50. It's great I use it for recording my martial arts fights. I also use it for family events and holidays to take pictures with the family.", "Date": "April 19, 2012"}, {"Title": "my son loves it", "Author": "Theresa M. Marigliano \"theresa maryann marigl...", "ReviewID": "R385D2KTFXFLEQ", "Overall": "5.0", "Content": "very nice camera and small takes good pictures  my son likes small camera its perfect not big can carry with him", "Date": "January 17, 2014"}, {"Title": "perfect camera", "Author": "pika2334", "ReviewID": "R2V5QCHCG479CC", "Overall": "5.0", "Content": "Good picture and quality. I love this camera. Very good for its price. I would set recommend. A must buy", "Date": "December 13, 2013"}, {"Title": "Perfect!", "Author": "ALew09", "ReviewID": "RMU8PUTMQR3TE", "Overall": "5.0", "Content": "We purchased this camera in effort to replace a camera that broke on us (same model) right before our trip to Mexico. Just a word about the camera.. this is the only brand of digital Camera that my mom and I purchase. The camera TAKES EXCELLENT photos ESPECIALLY outdoors! However, they are not life long cameras. But for the price and the quality i will purchase one EVERY few years iif I have to! I LOVE LOVE LOVE any Kodak Share Camera! Now, as for the seller, delivery was prompt and professional! I would def purchase from them AGAIN! Thanks!", "Date": "May 31, 2013"}, {"Title": "Not worth the money.", "Author": "MWard", "ReviewID": "R1P55TBB1RF5VN", "Overall": "2.0", "Content": "I only spent $30 to get this camera and I regret spending the money.  I have a nice DSLR and also wanted a quick point and shoot.  This guy came up for sale and I jumped at it.  This is a poor quality camera.  The lack of control is my biggest issue but I'd be fine with it if the camera took good pictures.  Unfortunately the auto focus is slow too.  Pictures regularly come out blurry.Just do yourself a favor and don't but it...or better yet, do me a favor and buy mine!", "Date": "May 30, 2012"}, {"Title": "love it", "Author": "D Sponsel", "ReviewID": "R197C7UH4FDJJM", "Overall": "5.0", "Content": "my wife use this to take pictures the other camera she had quit working so this is a replacement for it", "Date": "February 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Kodak 27-135mm zoom lens, 5X Optical Zoom\n14 megapixel resolution\n3.0\" LCD display\nVGA movie file format\n16 scene modes", "Name": "Kodak C1450 14MP Digital Camera Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41SQNL-ym7L.jpg", "ProductID": "B006GXOYXO"}}