{"Reviews": [{"Title": "Flash does not work with kit, bag is useless", "Author": "Unsatisfied Customer", "ReviewID": "R14NJ3O8QG3V4M", "Overall": "1.0", "Content": "The flash that came with the kit does not work, DavisMax is a pain in the neck to deal with, finally got the flash refunded for half the price you can buy it for on Amazon....what a rip off. A close friend bought the saem kit and it came with a different flash, much better quality and it works....so the kits are not the same.Also the bag is way too small for the kit, had to buy another bag.", "Date": "January 23, 2013"}, {"Title": "Love it", "Author": "Janet Vecchi", "ReviewID": "R340A2N103MDLG", "Overall": "5.0", "Content": "I am very happy with this product.  Takes great and detailed pictures.  Davismax is a great place to deal with.", "Date": "January 28, 2014"}, {"Title": "True 5 Star", "Author": "Ann Bugh", "ReviewID": "RKB9155SWYD9T", "Overall": "5.0", "Content": "The camera and accessories were above and beyond what was expected. I would recommend it to all my friends and family.", "Date": "January 14, 2014"}, {"Title": "I'm in love!", "Author": "Charity", "ReviewID": "RUVCB5ULUK0M3", "Overall": "5.0", "Content": "This camera came brand new as well as all the equipment being brand new. The only think I've had any problems with is the 2X telephoto zoom attachment. It produces blur on the images regardless what lens I place it on. Since I have the other zoom lens though, I don't use it much anyway so I am not put off by that. I love the macro lens attachment as it allows me to get right up on something with my regular lens and I don't have to purchase a high price macro lens at this time. I highly recommend this kit!", "Date": "July 5, 2013"}, {"Title": "love the camera", "Author": "Carol Tabakaru", "ReviewID": "R2TV9Q8C5BJSES", "Overall": "5.0", "Content": "camera and included equipment perform as expected, fabulous pictures! Very fast ship and well packaged against damage, happy customer all around", "Date": "April 12, 2013"}, {"Title": "The great bundle of my Canon Rebel T3i.", "Author": "Chico,f t bx..", "ReviewID": "R2JYEKHWGUI9HC", "Overall": "5.0", "Content": "After considering more than one camera I decided to go with the cano t3i it is my first digital SLR. Not only the camera is great but the bundle was great. And also the price was great for this bundle. Very happy over all.", "Date": "March 16, 2013"}, {"Title": "not compatible flash", "Author": "Ahmed", "ReviewID": "RXNLEV0CG9M8G", "Overall": "3.0", "Content": "it was grateful to have this item in the estimated time but i had no time to test it as i was travelling to Egypt, but when i try the flash i figured out that its not compatible with the camera, there is no way to send it back to USA so i just throw it.", "Date": "March 5, 2013"}, {"Title": "Great buy!", "Author": "Catlady", "ReviewID": "R2036MWITZ3NB6", "Overall": "5.0", "Content": "Great buy. It has everything you need for you to get started with your new camera. I haven't found a better buy yet!", "Date": "May 1, 2012"}], "ProductInfo": {"Price": "$705.09", "Features": "Canon EOS Rebel T3i 18 MP CMOS Digital SLR Camera w/ EF-S 18-55mm f/3.5-5.6 II IS Lens Brand New USA w/Manufacturer's Supplied Accessories\nCanon EF 75-300mm f/4-5.6 III Telephoto Zoom Lens Brand New USA w/Manufacturer's Supplied Accessories\nRechargeable LPE8 Lithium Ion Replacement Battery + External Rapid Quick-Charger with Car Adapater\n16GB SDHC Class 10 Secure Digital Memory Card + External Digital Slave SLR Flash\n0.45x Wide Angle Lens w/ Carry Pouch and Caps + 2X Telephoto Lens w/ Carry Pounch and Caps", "Name": "Canon EOS Rebel T3i 18 MP CMOS Digital SLR Camera with EF-S 18-55mm f/3.5-5.6 IS II Zoom Lens & Canon EF 75-300mm f/4-5.6 III Telephoto Zoom Lens + Wide Angle/Telephoto 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/516KMwKjnZL._SY300_.jpg", "ProductID": "B0060750N4"}}