{"Reviews": [{"Title": "Its a great buy for your money", "Author": "schorkb", "ReviewID": "RXP15BQI2YL1N", "Overall": "5.0", "Content": "I read the reviews for this product, and decided to try it for myself anyway...(2 and a half stars; REALLY PEOPLE???) Anyway, this is an amazing camera for a person who wants a simple point and shoot camera. I have read reviews exstensively on this product. Everyone should do their research when buying a camera that is less money. Most complaints I have read are people complaining about picture quality, light, video and handling problems. Let me start foremost by saying; picture quality. Many people complain about the quality of the pictures taken in odd lighting, or dark places such as in concerts...there is a menu on your camera that lets you choose between many different setting such as daytime and night! I have taken crisp, clear pictures in the dark, in odd lighting, and in places with flashing strobe lights! I've yet to have a grainy picture or odd light quality. Second, the video is pretty darn good for a camera that is now selling for only 100 dollars. Petty complaints like it won't zoom while filming with sound on is...well, just what I said; petty. Would someone want the sound of their zoom motors buzzing away in the middle of a video? No. Lastly, I'd like to address the complaint of the awkward handling. Yes, some buttons accidently get pushed and you need to get used to your equipment just like you get accostumed to handling a musical instrument. The lens cap is a bit iffy but it is meant for when you are not using or handling the camera (sitting on your desk, and you dont want dust on it). Also, I have read so many reviews (it makes me seriously ill), that say when they slide the compartment for batteries open, that the batteries fall out....okayyy....first of all, WHY ARE YOU HOLDING THE CAMERA UPSIDE DOWN WHEN YOU OPEN THE BATTERY COMPARTMENT?!?!? I mean, seriously??? It's called gravity, people. Olympus isnt responsible for making your batteries or battery compartment gravity-proof. My advice...before you use your camera, before you even TOUCH it, read your manual cover to cover....STUDY it. I don't care if you hate reading. Chances are, you are not going to take this camera out of the box and know every little thing about it. Also, don't make petty complaints over a $200 camera when you aren't able or willing to dish out 600-800 dollars for a top of the line model. Get real, people...", "Date": "November 24, 2012"}, {"Title": "Great Value", "Author": "Brian", "ReviewID": "R347J9JG461KXW", "Overall": "4.0", "Content": "Given that this was designed as a point and shoot with a ultra long zoom, it is great value at well under $200.00.  This is not for those that want to do professional level photography.  This camera takes very nice pictures in decent light, gives you a great telephoto reach, allows ultra close up macro photography and is easy to use.  Certainly a great deal for the target audience.  If you like to just point and shoot, get nice pictures and want a long zoom, you should consider this camera.", "Date": "November 29, 2012"}, {"Title": "Well worth it", "Author": "Cheetah", "ReviewID": "R1XDVS0FPNGBTV", "Overall": "5.0", "Content": "For quite some time I've been looking for a camera that I thought would be impossible to find. I needed a good zoom, macro capabilities, panorama stitching in camera, good low light performance and good image quality. This little camera has all of the above. It's super easy to use, very intuitive, and also has \"super macro\" setting which lets you zoom in really close. The panorama mode takes a little practice, but I've been able to take a couple of good photos the first time I used the camera.I like the fact that ISO can be adjusted in many settings which gives you more control. I think it tends to produce slightly overexposed images, so ISO adjustment is a good option here. This camera does excellent in low light. I don't like using flash, and it performs great without it, without noise. And I personally like the fact that the flash does not pop up automatically in low light situations. You have to manually lift it out of its \"nest\".It also has its own small internal memory in case you forget your SD card, but most cameras have it nowadays.Yes, it's a point-and-shoot camera, and it's not ideal. Here are some things I am not as thrilled about.It uses 4 AA batteries. Needless to say, if you love taking a lot of pictures and unless you use rechargeable batteries, you will go through them quickly. Also, the slot for your SD cards and AA batteries are in the same compartment, which makes it really awkward. You have to hold it upside down so the batteries don't fall out while you trying to slide the door open and get/insert your SD card. Meanwhile, it's really easy to accidently push \"ON\" button, and your camera turns on, the lens extends forward, the lens cover falls off, etc. And all you were trying to do is to get/insert your SD card! So, it's kind of a painful process. They should have its own separate compartment for the SD card.And a minor flaw is the lens cover. It doesn't stay on the lens when you turn your camera on. Just sits there if you are holding your camera in a perfect horizontal position or slides off. So, I have to take the cover off first and then turn it on.So, there is it. Just depends on what you need in a camera and what you can live with.To me, it has all the features I wanted for a very modest price. And all the things I find less than perfect have to do with the ergonomics/design of the exterior, not image quality or camera features. And if you combine camera capabilities with photographer's capabilities, you can produce great photos. That's why I still gave it five stars.", "Date": "February 2, 2013"}, {"Title": "great", "Author": "ang", "ReviewID": "R2YRSBQ2JN3BHK", "Overall": "5.0", "Content": "very good for the price.you cannot buy anything better then the olympus digital camera.the price that i paid was 99 dollars.", "Date": "April 13, 2013"}, {"Title": "High zoom for low budget", "Author": "Ely Shemer", "ReviewID": "R2BD0LVBVUBJL8", "Overall": "4.0", "Content": "The Olympus SP-620UZ is the kind of camera you might buy if you're looking for a model with high zoom, but you don't have the budget for one of the expensive options available out there. It's certainly a model which you should consider buying, though you should keep in mind the fact that it's not a perfect model. The performances offered by this camera are quite good and it's a model that delivers plenty in return for the money you'll spend on it.It will look a bit like a DSLR, which is always a plus. As long as you consider it a compact which has a high zoom and you don't have huge expectations from it, it will do just fine.", "Date": "May 5, 2012"}, {"Title": "Love it!", "Author": "Jeff Lauer", "ReviewID": "RVDAEWQ10JCQ4", "Overall": "5.0", "Content": "The camera does everything I would expect and more.  It is easy to use and takes excellent pictures.  Great resolution and the optical zoom allows you get in close even when you are not!", "Date": "January 13, 2013"}, {"Title": "EXCELLENT DEAL", "Author": "Puppy Chulos Placement, Inc", "ReviewID": "R3A2H6BF4AZ5YC", "Overall": "5.0", "Content": "I am very happy with this product and wish there were more deals like this. I didn't even have to read instructions. It was very easy to figure out. I bought this as a gift but decided to keep it for myself.", "Date": "December 19, 2012"}, {"Title": "Best Camera for under $200 !", "Author": "AmericanPatrick", "ReviewID": "R1T08F1URMABOF", "Overall": "5.0", "Content": "I bought this on a link through Amazon as they had just run out. The link got me to Robert's Camera in Indy, they had 2 left at only a crazy low after Christmas price($120). Some of the reviews in here are way off the mark. If you want a perfect camera then move up in the dollar amount & stop complaining ! The market has hundreds of cameras that will do a better job from $399 to well past $3000. But for the money in this price range it can't be beat ! Ultra 21X zoom with all these features Olympus has everybody beat ! This camera serves me perfect. Works great for web uploads too. Read all the features this camera has and do a side-by-side comparison.... I did for a few hours and bought this 1. THIS IS NOT A POCKET CAMERA! It is a real camera. Please understand we have pocket cameras & bigger ones too but for a nice point & shoot+++ with ultra zoom, HD, and much more this model Olympus fits perfectly in between. Fantastic clear pictures & easy to use too....", "Date": "April 13, 2013"}, {"Title": "Good camera for the money, terrible battery life", "Author": "Audio_Aficionado", "ReviewID": "R3Q8KMB5C2PBKN", "Overall": "4.0", "Content": "This camera is a great deal for the money and is a good compromise between the lower-quality point and shoots out there and an entry-level DSLR which can run several hundred dollars more.  I think it's worth mentioning that the major sticking point for me with this camera has been the abysmal battery life.  I've run through at least 10 sets (40 total) alkaline batteries in the year or so that I've owned this camera - with light to moderate usage.  I get maybe 100 pictures per set of batteries and then the camera will turn off when trying to take a picture or zoom.  And the thing is, the batteries themselves are still at maybe 75% charge - I can use them in flashlights, my work pager, or other cameras with no issue.  This camera just seems to have crazily high drain on batteries and will cause you to burn through many more fresh ones than any other device I've owned.  Still, a good value for the money.  I couldn't go below 4 stars just for the battery issue.", "Date": "August 28, 2013"}, {"Title": "Olympus SP-620UZ 16MP Digital Camera with 21x Optical Zoom (Black)", "Author": "Shady Yang", "ReviewID": "RKH6G1OC0JHM9", "Overall": "5.0", "Content": "I really love my camera. It takes great pictures for a camera that's about $150. It has 3D, Panorama, and has 21X optical zoom. I think it's veyr easy to use and it's light weight for a larger camera. I would recommend this to anyone who wants an everyday camera.", "Date": "June 24, 2013"}, {"Title": "Good value for money", "Author": "M. C. Agbara", "ReviewID": "R2CDFOWW9VJ1DL", "Overall": "5.0", "Content": "Bought thsi as a birthday preent to myself and I am very pleased with it. It was very good value for money and i've taken some amazing shots with it. Not necessarily a SLR but still very good", "Date": "April 12, 2013"}, {"Title": "Olympus SP-620UZ 16MP Digital Camera with 21x Optical Zoom (Black)", "Author": "M. Jurek", "ReviewID": "R3HJR96SUZ8TI0", "Overall": "4.0", "Content": "This camera works perfectly for my needs.  The only thing I didn't like about the camera was it would time-out very quickly and if took me a while to learn to press the picture button halfway to get the camera to be ready to take pictures.  Great quality.  Did go through a lot of batteries (thank goodness for AA batteries!) when I was using screen and video and extra display options instead of auto focus.", "Date": "April 2, 2013"}, {"Title": "LOVE TAKING PICTURES WITH THIS!!!!", "Author": "Tiffanie Veitengruber", "ReviewID": "R1DUDZ53ZB8DC", "Overall": "4.0", "Content": "I am not a professional but the way this camera takes pictures and the amazing quality of it you wouldn't know the difference!", "Date": "March 26, 2013"}, {"Title": "great camera.", "Author": "AMW", "ReviewID": "R2TGLUSR5D3UDS", "Overall": "5.0", "Content": "This is a great camera for the price. I love it. It is close enough to professional for the professional, but easy enough to operate for the nonprofessional.", "Date": "March 22, 2013"}, {"Title": "Takes great photo, Nice features, Nice zoom", "Author": "Ontwain", "ReviewID": "R1916S4YYTGW9B", "Overall": "4.0", "Content": "This camera has a great feel and look to it, for a point and shoot, its pretty good. I find the features really handy especially the 'go to' feature in the help menu of the camera - if your not sure what settings to use for a certain pic, just use that function and the camera automatically adjust the setting for you. Its overall great, the zoom is really good, and give a clean shot even without a tripod (at times). Night images are as expected from a typical point and shoot in this price range. The only draw back that I have and its nothing major - and its probably due to me not finding it yet, is that I cant take monochrome pictures. But that's pretty much nothings really. great camera. If you follow the instructions you love it just as much.", "Date": "February 9, 2013"}, {"Title": "Love this camera!", "Author": "The Buyer09", "ReviewID": "RQLBZ8WQAB0UO", "Overall": "5.0", "Content": "Did some research on this camera after it was recommended by a pro photographer. The lowest price I could find was $199. The price was $118 here. This is a great camera! I love the quality and the fact that it has sequential mode. I can take several pictures with the push of a button I love that! Im have limited knowledge about cameras, but this one is fairly easy to use. I also bought a 32GB card with it, just on the basic settings it can hold over 7,000 photos! I think this is worth the investment! I spent $300 on a Samsung and Im so much happier with this one!", "Date": "January 29, 2013"}, {"Title": "worth it", "Author": "Juan Ospina", "ReviewID": "R1I3BC9PWU88MU", "Overall": "5.0", "Content": "good experience looking for the transition to the reflex or pro cameras. Difficult to find something better for $99 bucks", "Date": "January 12, 2013"}, {"Title": "Just what she wanted!", "Author": "Kim", "ReviewID": "R3J52N0AL09A6F", "Overall": "5.0", "Content": "This camera takes great pictures and is fun to use.  There are fun settings to play around with.  Olympus lens' are the best!", "Date": "January 4, 2013"}, {"Title": "Love it", "Author": "Tahira Hamdani \"th\"", "ReviewID": "R2QI1QIBU8M5ET", "Overall": "5.0", "Content": "I love this cameraI made the right choice!I wish there was a charger too with the camera and bag", "Date": "January 4, 2013"}, {"Title": "great deal", "Author": "Helen J. Marcin \"philip\"", "ReviewID": "RKQOJPFEICFVM", "Overall": "5.0", "Content": "outstanding product with many choices to shoot a pic.  simple operation with online guide.  photos are excellent and 16 pix.", "Date": "December 28, 2012"}, {"Title": "I like it", "Author": "Klaus-Dieter Rose", "ReviewID": "R3BAOOP6FJBY66", "Overall": "4.0", "Content": "Its a nice camera, You have to learn to make Photos, if You usually dont use zoom. I bougth recargable AA bateríes, so that point its not important for me.", "Date": "December 25, 2012"}, {"Title": "beautiful", "Author": "country wife", "ReviewID": "R2U9B5CY47LMDG", "Overall": "5.0", "Content": "I was looking for a camera for my father to use who is visually impaired. I found this and could not be happier with it. The screen is large and shows an extremely clear picture that even he can appreciate. It is simple to use with relatively few buttons. Obviously bulky for a digital camera, but just what he was looking for in terms of having something larger to handle. It runs on  batteries which is more convenient than having to plug it in prior to use, and I purchased rechargeable sets for him to use. I would recommend this to anyone looking for a simple to use camera that takes fantastic photos!", "Date": "February 13, 2013"}, {"Title": "Gift", "Author": "peggiebennett", "ReviewID": "R28LMQULO18PRA", "Overall": "4.0", "Content": "Gift for my son, he picked it out.  He really likes it, uses it for pics and video.  I haven't had a chance to get my hands on it yet!  But I like the size and the optical zoom.", "Date": "January 22, 2014"}, {"Title": "Worst Camera", "Author": "Vince", "ReviewID": "RODE6Z21I8GPR", "Overall": "2.0", "Content": "Worst camera I ever bought, takes horrible pictures and very cumbersome.  I used it a total of 2x in a year.  It's sad when your phone takes a better picture than this camera.", "Date": "January 16, 2014"}, {"Title": "Good Quality", "Author": "Fabricio Vasquez", "ReviewID": "R2XLKT4QG39BYB", "Overall": "5.0", "Content": "Really good camera, is the best investment that I did. It's really important buy the bag case to protect it", "Date": "November 7, 2013"}, {"Title": "great", "Author": "Cecil O.", "ReviewID": "R33LB0XZTOKTLA", "Overall": "5.0", "Content": "great camera for the price....especially with the pixels and will recommend it to everyone. Great price for a good deal", "Date": "May 28, 2013"}, {"Title": "need it", "Author": "Carlton B Wagoner", "ReviewID": "RHR4M3MYKXPWS", "Overall": "4.0", "Content": "wish it had a rechargeable battery but still a good price for the camera and I look forward to using it", "Date": "May 9, 2013"}, {"Title": "olymus sp-620uz 16 mp digital camera with 21 x optical zoom [ black]", "Author": "tony comito", "ReviewID": "R12W63QI9LXBQD", "Overall": "4.0", "Content": "it's hard to hold the camera still when taking movies.  i like the pic. it takes . the size of it is good", "Date": "March 22, 2013"}, {"Title": "simply good", "Author": "E. J. de Cuba \"Audio, music and sound\"", "ReviewID": "R7VGNZFF5WZ24", "Overall": "5.0", "Content": "Was looking for a good buy specs, quality and cost wise. This product gave all those aspects with great ease. Olympus quality pictures and videos with a very affordable price.", "Date": "March 19, 2013"}, {"Title": "good camera", "Author": "G. Yau \"TY\"", "ReviewID": "R2ACJ85CPMVZIJ", "Overall": "4.0", "Content": "Although there are 18MP pixel or more zoom, but this camera is very good and nice,It would take more time to focus and show the picture, but the result is great", "Date": "March 6, 2013"}, {"Title": "it 's okay", "Author": "susan toole", "ReviewID": "R1DUYZVXN4XUR8", "Overall": "3.0", "Content": "For the price it takes great pictures but if your are looking for a detachable lens this is not the camera for you", "Date": "December 16, 2012"}, {"Title": "the camera not work", "Author": "Angel Blanco", "ReviewID": "R9NC1LTDYLPH3", "Overall": "1.0", "Content": "the olympus sp-620UZ generated the error-zoom camera When turnI could not make photographs.This camera came with operating problems. at the time of purchase, the seller indicated that it was a camera used in very good condition. however I have sent a camera rebuilt. Please I request the change of the camera for one that works. note: the camera generates \"Zoom Error\" when turning.", "Date": "June 11, 2013"}, {"Title": "Not bad for the price, but would agree about the finish and the lens cover issues.", "Author": "deborah a davis", "ReviewID": "R2K0FT3OY9IAJJ", "Overall": "3.0", "Content": "As others stated, the lens cover doesn't stay on well.  Also, the chrome finished areas also look a little toy like.  Overall, it takes nice pictures for the price.  I little better than a point and shoot, but not quite the same as an SLR.  For the money paid, I didn't expect it would be.  This was given to my adult daughter as a gift.  Will have to see how she feels about it as she uses it.", "Date": "December 25, 2012"}, {"Title": "Less than expected", "Author": "David Wisniewski", "ReviewID": "RN8J96ETIGPHP", "Overall": "3.0", "Content": "Takes blurry inside pictures on default settings . Had to figure out how to set up properly for inside pictures. I looked at many positive reviews of this camera , which is why I purchased it . Most places are calling this a point and click type camera but you will have to experiment with settings before you begin taking great pictures. This is the best price I could find for this camera \"post black friday\"", "Date": "January 23, 2013"}, {"Title": "Overall average buy, decent buy for the price (100$)", "Author": "Anuraag Gupta", "ReviewID": "R22JKZVTZA3NAY", "Overall": "2.0", "Content": "This looks to be a very impressive camera reading the specifications of this model. But the picture quality wasn't so good even in day light conditions.Very simple and easy to operate though. A good gift for not-so-tech savvy parents.", "Date": "December 28, 2012"}, {"Title": "Great Buy on Black Friday", "Author": "Jak", "ReviewID": "R2UDDRZZ41YMQZ", "Overall": "5.0", "Content": "Got this thing for $99 on black friday, awesome camera at an awesome price. Better than a lot of the cheap DSLR style cameras out there. And for the record, over the other reviews, you CAN zoom and record audio at the same time while recording video. Got it on time, love it to death. Recommended highly!", "Date": "December 10, 2012"}, {"Title": "Buena Camara", "Author": "Alberto", "ReviewID": "RL5YIBG9MQ8NF", "Overall": "4.0", "Content": "La camara es de muy buena calidad, esta a muy buen precio, lo único que usa pilas recargables, seria mejor que fuera una pila de litio que se cargara directamente en el toma corriente. De resto muy buen producto, 100% recomendado", "Date": "February 17, 2013"}, {"Title": "Gimmicky camera, lacking in quality, don't buy it!", "Author": "Michelangelo", "ReviewID": "R3D8YPRDK0AZL9", "Overall": "1.0", "Content": "This model of Olympus bristles with palettes of software driven image modification \"creativity\" filters,which are O.K. if you're loaded high and trying to do some psychedelic takes of your messed-up bedroom,or if you are completely devoid of any ability to create interesting shot on your own without resortingto cheap gimmickry - then this would be certainly your prime choice.To add to list of \"interesting\" features I would be remiss not to mention this moron-designed lens cap,which will not stay on the lens while not in use, exposing the lens to possible damage. It seems that meregravity is able to overpower its \"tenacious\" grip of a lens barrel and launch it straight in the dirt, ifnot tethered, which is another highly annoying cockamamie \"fix\" of initial poor engineering.The performance of a zoom lens falls little short from the expectations, sometimes the lens is capable ofproducing \"soft focus\" - read BLURRY images. OVERALL - the camera is decidedly underwhelming, DON'T BUY IT!P.S. Olympus Corp. customer support really sucks too, so, if you need more headaches - highly recommended!", "Date": "October 1, 2012"}], "ProductInfo": {"Price": "$199.99", "Features": "16 Megapixel\n21x Optical Zoom\n3\" LCD\nHD Video\nDual Image Stabilization", "Name": "Olympus SP-620UZ 16MP Digital Camera with 21x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/31ZNjrl9kPL.jpg", "ProductID": "B006ZAHO0I"}}