{"Reviews": [{"Title": "Big improvement from HX9V, but compared to Canon PowerShot SX260HS..", "Author": "E. Tam", "ReviewID": "R3N2F3IX29NJ3A", "Overall": "4.0", "Content": "First, I didn't buy this from Amazon. I was walking around my local electronics store and played with it and bought it. Overall this is a good improvement from the HX9V. Few months ago, I purchased a Canon PowerShot SX260HS for $349.00 (you can get it for $299 now) and it's one of my favorites. How does the SX260 compare to this camera?Resolution:The Sony is an 18MP camera, Canon is 12MP.. besides the bigger JPG size, can't tell the difference both look decent when printing on 11x17..Size/Weight:Both are nearly identical. The Canon weigh 8.5oz, the Sony 8.8ozZoom:Both have 20x optical zoom, but in comparing pictures, it looks like the Canon's optical \"zoom\" is closer. Canon has a combined 81x digital zoom, Sony's 40x. Canon's 81x combined digital zoom sounds nice, but there's so much noise that it may not be worth using. With the Sony, even at 40x the picture is still acceptable.Flash Control:With the Canon, you can adjust the flash power, with this, you can't....major disappointment especially for a camera that cost $399.00Menu/Navigation/Ease of use:This is more of a preference. I used Canon and I used Sony; personally I like the Canon because I think it's more logically orderedFlash position:Both are pop up flash. I know it's going to require people to change their grip but I kind of like the pop up flash.AWB (Auto White Balance)This is one area that I think Sony made a big improvement with this camera. The AWB on the HX9V was terrible and required manual tweaking. The Canon does a very good job with the AWB. I used this Sony for about a week and went through about 500 shots. The AWB has NOT missed it's mark; not even taking photos indoor with florescent lighting that can cause yellow tinting with improper AWB.Speed:One of the reasons why I got rid of the HX9V was because of the slow processing speed. This camera, the image processor performance has improved quite a bit. With the HX9V, it would take up to 6 seconds to save/process images. With this, I think the longest was 3 seconds. The speed is on par with the SX260.Picture Quality:In auto mode, the Sony does an excellent job reproducing accurate colors. The colors are more natural looking, but on occasion (especially in landscape mode) the blue and red looks amplified.Manual Controls:This camera DOES NOT have a \"Shutter Priority\" and DOES NOT have a \"Aperture Priority\" mode! The Sony's manual mode is practically useless. Sony what were you thinking!!!  Canon has the Aperture and Shutter mode, and the Canon's manual mode give you more control although it doesn't compare it with a DSLRISO Speed:This Sony goes up to 12800 AMAZING!!!... the Canon comes no where near this..3D Feature:I don't have a 3D TV so can't comment on it. I did try to take some 3D pictures (supposedly you can now view 3D pictures on the LCD screen; something the HX9V was not able to do) but I don't think it's working correctly, or maybe I just can't tell the difference. The Canon has no such feature.Video Quality:Sony's video quality hands down. This beast is fast capturing full HD. One of the thing I loved about the HX9V was the video quality. It was perfect for those quick moment. This Sony looks just as good if not better.Memory Card:The Sony has built in memory, it's not much but better than nothing. I used a Patriot SDXC and a SanDisk SDXC, performance identical. The SanDisk cost twice as much as the Patriot because it's suppose to be faster. I can't tell the difference, and neither can my cameras. Both camera recommends Class 6 of higher, but if you plan to record video, go for the Class 10. A 64GB card can capture close to 10,000 picture.Battery Life/Charge:With the Canon, I got about 250 shots before the battery indicator started flashing. The Sony was about the same based on mixed use. One thing about the Sony is that it DOES NOT come with a battery charger. But, you can charge it with a micro USB able. Call me old fashion but if you're going to charge $399 for a camera give me a battery charger! The Micro USB charge may not be a bad thing if they didn't put the port on the bottom of the camera. So when you're charging the camera has to lay on it's side. As others have commented, you can buy a decent aftermarket charger for under $5.00.Live Mode:The Canon has a dedicated \"live mode\" that allows you to adjust the color on the LCD screen before snapping a shot; kind of like a \"what you see is what you get\". Sony has this built into their auto mode. Press the down navigation wheel to activate this feature.Scene Modes:With the HX9V, the scene modes were terrible; the difference were so subtle. This Sony is a HUGE improvement. With the Sony, you can see there IS a difference now. I am especially impressed with the \"food\" scene. With this mode, when you take a picture of food, it's suppose to enhance the color to make it more appealing. With the HX9V, it's a gimmick, but with this it's a 180 degree improvement. My best description of this is when you see those professional pictures of food at restaurants, this Sony can produce that type of quality.  Canon does a good job with most of the scenes, but I prefer the Sony now. The Auto and Super Auto mode works great. For the regular outdoor or well lit environment the Super Auto won't be much difference. For those complicated lighting situation, the Super Auto does a better job. But the Super Auto mode will take about three seconds to process the image. With the scene mode, just because its designated as a \"food\" mode does not mean you just use it to take pictures of food. I used the \"food\" mode to take other beautiful indoor pictures that are not food (without flash) at fancy steak houses, and they came out beautiful. The difference with this mode (and the ISO mode) is that the food mode enhances the colors a notch making them appear more vibrant.Defcocus Mode:One of the feature I like is the defocus feature. This is one feature that distinguish this camera from other Point and Shoot. With the more expensive DSLR camera, you can take a picture where the portrait is in sharp focus but the back landscape is blurred. Sony does a decent job with this (in fact, I haven't seen this feature on any other brand camera). This feature does not work with the flash because what the camera does is take two shots and combine them to create this effect. But do note that when you use this mode, the LCD screen will tell you how far the subject should be and if you ignore it and take a picture, the Defocus will not work (you still get a decent picture though)LCD Screen:Both units have a 3-inch LCD screen, but I think the Sony camera has a sharper, clearer display.GPS:Both units have GPS, I haven't used it on either units though.Camera Body:The Canon has a more solid feel to it. The HX9V had an \"expensive\" look and feel. With this Sony, it's just all black and nothing to distinguish this camera for others. The Canon has that expensive camera look and feel, but this Sony does not. It looks plain and boring.Cost:The Sony cost $399, Canon cost $299.00, $100 difference.. Is this camera worth $100 more than the Canon SX260HS? You decide...Sony, if you want me to rate this 5-Star, please do the following:1. Put the Shutter and Aperture mode back in this camera2. Give me flash exposure control3. Give me a battery charger4. And, give it to me for no more than $349", "Date": "May 17, 2012"}, {"Title": "Wonderful Travel Zoom", "Author": "Geoffrey A. Erickson", "ReviewID": "R212PPHNMKMYQP", "Overall": "4.0", "Content": "Okay, this is going to be a multiple day review over a period of time.Day 1 - First impressions. I am upgrading from a much loved Panasonic TZ3.  I have thoroughly enjoyed this 10X travel zoom since the day I bought it and the travel zoom style definitely fit my needs. I was less interested in upgrade for the zoom than I was the low light. I had always been disappointed with the Panasonic low light which seemed to fall to pieces above ISO 800 and not look that great at 400.Enter the HX20V. Like some of you, I had read and read and read reviews and everything seemed to indicate that this Sony camera had the answer to my low light issues. When I read all the other amazing aspects of this camera, I decided to try it out.  The reviews were right. This thing takes amazing low light photos. With IA+ I have seen photos at ISO's I wouldn't have dared come out looking quite nice on my 52 inch screen. I have taken many shots in total darkness in IA+ mode and had the multi-shot process make it look almost like a normal daytime photo. Yes, if you zoom a lot you can see both softness and noise when you pixel peep, but bottom line, I don't believe there is a point and shoot this small that does better.Other first impressions. It's not as pretty as the Panasonic line.  I don't know, something about the Pana black and steel look that I just love. This Sony is pure black and a little ugly in its indistinctness.  It looks all muscle and business, but I am starting to get used to it. And it's what's on the inside I bought it for anyway. The look of the Pana was just a bonus.I will say that the build quality does not feel as solid as my old TZ3 or even the new ZS19/20/TZ30. Still it seems to be of high enough quality it will last. Just a little less solid  and more plastic feeling than the Panasonic.The pop up flash is as annoying as people have described. In fact, I thought I would have to take it back since I REALLY like the stability keeping my finger their gives me. Still, the photo quality in low light, the video, and the zoom have convinced me to recondition myself on how to hold my camera. It's totally worth it.The menu system took some getting used to, especially after the Panasonic menu I was used to. Now I am starting to love it. Things seem pretty organized and easy to see on the LCD (which is vibrant).  I have to say, some of the Panasonic quick menus were more intuitive and easy to get to than the Sony, but I can definitely see getting used to the Sony menu system and some things are placed better on the Sony.I like most the buttons on the Sony compared to the Panasonic approach. Particularly, I like the movie button on the Sony. The dial on the HX20V is bigger and less stiff than the ZS19 out of the box. The onboard help is actually, pretty helpful!In addition to being a little uglier, it's a tad heavier and larger than my old TZ3, which was a bitter pill seeing Panasonic reduce size on the ZS20. I would have liked a smaller camera, though truthfully the TZ was never a problem and this one is only a fraction bigger and heavier. It fits in the same camera case I am used to, so it really makes no difference to me.I will post more as I use this wonderful device and try to get some sample photos to you as I get used to it. I have to say, I am glad I got it so far and think I will enjoy it for many years. 4 Stars only for the popup flash positioning and the bulkier, more plastic build. Everything else is fantastic!Finally, Amazon and JR Music World got it to me in record time, well packed, in good working order, without any hitches. Thank you both for excellent service.Update 05/05/2012I have been putting this camera through its paces for a couple of weeks now and can say I absolutely love it. I am actually finding this is the first time I can treat a travel zoom as a true point and shoot.  I am coming to trust the IA+ mode pretty thoroughly.  Even on other more manual settings I let it auto select the ISO. Something I didn't dare do with my TZ3.  Part of the reason is that the higher ISO settings do SO well on this camera, the other part is the Sony firmware does a really good job at selecting the best settings for a given situation.  I have also used digital zoom for the first time on a camera...and while I still think it may be better to limit yourself to just optical zoom, for now I am enjoying trying it out and getting some decent photos.  As far as my cons, I am still getting used to the pop up flash and yes I still block it accidentally, but then I need the flash so rarely it doesn't matter. The other annoyance is the movie button because I keep hitting the shutter button to start it and it reminds you that you need the other button.  I know they had to do it in order to allow the photo capture during movie record (what a handy feature at sporting events btw.) But they could have made the shutter button the primary for starting and added a button for capture. Both of these are minor annoyances given the camera's performance. One last thought before I go. I saw a lot of Dad's with the full DSLRs at the track meet today and while I can say I did have some justified envy, I enjoyed gloating about how much performance I was getting out of such a small and convenient package without switching lenses. I had a heck of a lot more camera packed in a much smaller space that could be easily tucked away. And with the 10 FPS continuous capture, I felt almost like I had a DSLR (well not quite, but close).  Oh, if I could have a wish Sony?  Don't limit me to 10 photos.  Do it like Panasonic did and make it 10fps for the first 10 and then slower after that if you have to.", "Date": "April 27, 2012"}, {"Title": "Another Gem by Sony!", "Author": "P. Baek", "ReviewID": "RTRCDOZ26E0JE", "Overall": "4.0", "Content": "Overall, this is a terrific, feature-laden compact camera. I have a Sony HX9V also and this is a nice, although small upgrade. The still photo quality isn't that much improved from the previous HX9V even though the pixel count is now at 18.2MP(as a matter of fact, most of the time, you can hardly see any difference at all, esp. when you print the photos). The video portion (now w/AVCHD 2.0) now has 1080p at 60fps which is very nice and looks amazing on a big HDTV (24p recording is also available). One of the biggest improvements seems to be the increase in zoom range--now at 20X. You can also view 3D images on the lcd screen now (without 3D glasses) which is cool. Build quality seems to have gone down a little bit....when compared to the HX9V....it's lighter and there's no chrome or metal trim...making it look \"cheaper\" and less elegant. However, overall, I'd say this is probably one of the best compact cameras in the market right now. If you already have a HX9V, it might not be worth the money to upgrade (esp. if your priority is still photo capability). However, if you need longer zoom and better video, it should definately be worth checking it out.", "Date": "April 27, 2012"}, {"Title": "Moon Craters! This camera captured it! See my uploaded pics!", "Author": "Turiya \"O\"", "ReviewID": "RD3SCYF06LE99", "Overall": "5.0", "Content": "Check my uploads on the 'View and share related images' link below the main pic, for some reason they are not showing up on the 'See all the images' link. Just got this camera and its amazing. Casually snapped some pictures of the moon last night and was shocked to see moon craters in the image! This 18.2MP 20xZoom is ASTOUNDING! On the other end of the spectrum I did some macro photography and the level of detail is equally astounding. Check out my uploaded images of grains of sand, the end of a screwdriver and a faucet. Keep in mind I had to greatly crop these images and size to upload to Amazon, the part showing is just a small section of a huge picture. the real full pictures are the best I've ever achieved with any camera. There are so many other great features, like night time shooting, etc that I may review later. For now I will let the images speak for themselves. I LOVE THIS CAMERA!Recommendations:for only $4, I recommend this battery charger for the cameras battery, includes car charger, works great:SONY NP-BG1, NP-FG1, NPBG1 NPFG1 Battery Charger for Sony DSC-W Series Camera ModelsFor an extra Battery I recommend the NP-FG1 battery - it shows the remaining minutes on your camera display, the camera comes with an NP-BG1, the NP-FG1 is a new model of the battery.Sony NP-FG1 Rechargeable Lithium-Ion Battery Pack for Select Digital Cameras", "Date": "May 4, 2012"}, {"Title": "nice camera with many features", "Author": "Terry R. Nye", "ReviewID": "R3I0UN3TD7X2SP", "Overall": "4.0", "Content": "The Sony Cyber-shot DSC-HX20V is my first experience with a Sony digital camera.  For years I have had interest in owning a Sony digital camera but was turned off by their usage of proprietary memory sticks.  This camera, though, can be used with several standard types of flash media including SD, SDHC, SDXC, micro SD, and micro SDHC in addition to Sony's memory stick media.  All will work for still images and video except only Mark 2 Sony memory sticks or other media rated Class 4 or higher should be used for video.  You have many choices, and no flash media comes with the camera, so plan on purchasing some form of memory media along with your camera.  For testing purposes, I used a SanDisk class 10 SDHC memory card for this review.The camera arrives securely and well-packaged with a carrying strap, Lithium ion rechargeable battery, USB connecting cable, and an AC adapter for usage with the USB cable.  A detailed printed manual is provided, although an electronic manual is also installed in the camera's memory that can be viewed on its LCD screen.The camera itself feels solid.  Another reviewer commented about it feeling cheaply made, but that was not my impression at all.  To me it feels sturdy yet very compact.  I like its black color.  When it is turned on the lens telescopes outward, and when turned off the lens fully retracts into the camera and is protected by a built-in lens cover.  The LCD display screen on the back is huge and provides very vivid previews of photos or video.  Controls are well-placed and easy to operate.  Much of the camera function is quite intuitive.  The battery and memory card are easy to access, and the bottom of the camera is threaded for installation onto a standard monopod or tripod.The camera has a preloaded software program, \"Play Memories Home\", that can be downloaded and installed onto your computer from the camera.  You cannot download this software from the internet, so you must connect your camera to your computer to install it.  The manual tells you that you need to install Play Memories Home on your computer to import AVCHD movies to your computer (this is the default format for movies shot with this camera).  I found this not to be true, however.  You can import movies to your computer with freeware such as Google's Picasa (which cannot play the movie) and you can play the movie or convert it to another format with the standard Windows Media Player.  Play Memories Home is not compatible with a Mac computer, but it is not needed for Mac.  Even after downloading and installing the additional features for Play Memories Home I found it to be very basic software at best and not useful at all for photo or video editing.  Picasa is a far better choice for importing, organizing, and optimizing your photos, and Windows Live Movie Maker (also free) is an easy way to view, convert, and optimize your videos.  Of course none of these would compare with other software that you might purchase, but they can handle basic functions quite well.As for photo-taking, the Sony Cyber-shot is capable of taking some very nice photos with good color balance even in low light situations.  Its 18.2 megapixel resolution allows you to take photos that would be more than suitable for printing.  The camera can also shoot video in high-definition.  The cost for this high resolution, though, is very slow processing speed between photos.  Even using a class 10 SDHC memory card it took a few seconds after taking a photo before I could preview it on the LCD screen.  Compared with my Canon Powershot camera this seems like an eternity.  The photos and video I took, though, looked very good even in low light.  The 20x optical zoom is quite amazing, and I was impressed with the image stabilization despite using the zoom at higher levels.  There are numerous settings available to shooting photos with different effects including a watercolor effect, illustration effect, partial color, and panorama along with adjustments to ISO, color saturation, contrast, sharpness.  Since I have Adobe Photoshop I have little need for and did not test those functions, but they are available for those who want to use them.Shooting video is extremely easy.  You aim and push a button.  Video starts automatically and can be stopped or restarted with the push of the same button.  You can also take still photos while shooting video.  The video resolution is very good for such a small camera, and the video is not at all choppy.  As mentioned previously, it records in high-definition.  Sound is recorded, too, although sound from usage of the telescoping lens control will also be recorded and is very audible.  There is no way to attach a separate microphone to defeat this problem.  This camera is not going to replace a digital camcorder by any means in terms of quality or capability, but it does make recording video quick and easy.An unusual feature with this camera is a built-in GPS function.  The manual says very little about it, but it alludes to recording information about the route taken while carrying the camera.  I really don't know why anyone would want or use this feature.  According to the manual the GPS function consumes battery life but there is a way to turn it off in the camera settings to prevent this.  I leave it turned off in mine.My main complaint with this camera is the built-in flash.  It is located on the top left of the camera and pops up out of the camera when a flash is needed.  As such it completely eliminates the ability to hold the camera with a finger on the top left like one would normally hold a camera this small.  Therefore it is awkward to hold the camera steadily while taking pictures.  I would love to grab the Sony engineer who came up with this design and ask \"what were you thinking?\"  This is the primary reason I docked the rating a star.  With better flash design this camera would have been a 5-star camera.In summary, the Sony Cyber-shot DSC-HX20V digital camera is a feature-packed pocket camera with all the bells and whistles that most would ever want or need for a competitive price.  The more I use it the more I like it, even though I do have to alter how I hold the camera to contend with the pop-up flash.  With better flash design it would be a very tough camera to beat, but those willing to modify how they hold the camera will be rewarded with very good photos and video.", "Date": "June 3, 2012"}, {"Title": "Plusses and minuses", "Author": "The Engineer Critic", "ReviewID": "R3RA39DZPIAJ3Q", "Overall": "3.0", "Content": "I was looking for a small high-zoom camera that can double as an HD camcorder.  My impressions so far are as follows:Pro's*  The 20X zoom is good (but note that the minimum focal distance to your subject is about 6 feet when zoomed in all the way).*  The image stabilizer in this camera does a good job of compensating for motion.*  USB charging is convenient; I don't like carrying around a power adapter brick.*  Battery life has been good so far.*  I found the flash to be plenty bright for indoor shots, much brighter for example than the Panasonic LUMIX DMC-ZS19 Digital Camera, BlackCon's*  The small F3.2 aperture usually requires a flash when used indoors.  Low-light images otherwise turn out very grainy and have yellow or green splotches.*  Indoor video recording also requires very bright lighting conditions or the video is also grainy/splotchy.  The lighting that the camera requires for video is much higher than that required for still photos, and is about double that of the usual camcorder (plus the camera has no light as you might find on a camcorder).*  I don't like the physical location of the flash; it pops up right where I tend to hold the camera.*  I don't like the position of the micro-USB connector on the bottom of the camera which requires that I sit the camera on its lens or on its back while charging, and also makes it impossible to use external power when attached to a tripod.  Also note that the micro-USB connector does not plug in all the way.*  Severe ghosting occurred on night shots of bright objects.  For example, I counted about a dozen ghost images when I took a picture of a post lamp (see attached image).In summary, the camera can double as a camcorder in daylight conditions, but a camcorder (or camera with a wider aperture) would be better for indoor or night photography.  Unfortunately most camcorders don't have decent still photo resolution (check the gross pixel count, not the number of extrapolated artificial pixels printed on the side of the camcorder), hence I'm still looking for the perfect camera that can do both.", "Date": "July 18, 2012"}, {"Title": "Fast and easy to use; reliable, superb quality images and video", "Author": "M. Klein \"mike_in_ca\"", "ReviewID": "R1VOXZ55H4MPCS", "Overall": "5.0", "Content": "This was not purchased through Amazon (see below), and it was for my wife, not me, but we've been evaluating it closely together for the last two months.This camera is fabulous for a small unit that is very quick and easy to use, and produces phenomenally good images, both still and video, without spending hours or days researching and learning the modes.  This review is from the viewpoint of someone who wants and knows high quality images but does not have the time or desire to bury themselves in the minutia of how, why, which button or mode or the myriad of other tradeoffs the more technically oriented users might want.  The HX20V powers on quickly, frames the image quickly, and gets the shot in very high quality with no fuss.My wife had been using a 2005-era Olympus that was no longer working reliably but that she had grown to know and rely on, being able to take photos basically by touch and having most of them turn out well.  I did the research and narrowed it down to 4.  She reviewed them and I went out to the local Best Buy and bought two: this one, and the Canon SX260HS.  She spent an hour with each one doing basic configuration, taking a variety of stills and videos under varying conditions, uploading and editing the photos and videos, and evaluating the results.  It didn't take long for her to tell me to take the Canon back.Since then she has logged about 1,000 photos and a few hours of video and even I have to say (as a long-time Minolta and now Sony DSLR user), the image quality is astounding for such a small camera.  It is serious competition for even recent DSLRs in many respects, and well beyond them in others (such as video, and of course size and weight).  I would say that over 80% of all photos are well exposed and focused and framed, maybe more.  There are almost no throwaway images at all, which has never been the case for a point-and-shoot camera.The reasons for choosing the Sony:* Image quality, video quality.  They are superb.  She has tried a number of the modes and ends up staying with the \"Intelligent Auto\" mode which has produced outstanding photos under a wide range of conditions.  The Canon was more often fooled and made poor exposures on the same (contrasty) scenes in a default mode.  To avoid that, it required more mode selection or adjustment.  Either way, it means more shots are missed.* Simple menu system, very easy to get to the basic settings.  Here is where the Canon really fell down.  These cameras have so many features that it takes a very well-designed menu system and user interface to not get in the way.  The Canon system is non-intuitive and definitely got in the way.  Sony's, while equally complex and deep, made the important controls easily accessible and intuitively named.* Fast!  Everything is fast.  Power on is fast (under a second), autofocus is fast and accurate, shutter lag is short.  Something happens and in under a second from cold start you have taken the picture, and if already on it is a small fraction of a second.  Intuitively it is close to immediate.* Videos uploaded easily to iMovie and could be immediately edited in full HD resolution.  iPhoto (latest release) now supports the AVCHD format as well so importing can be done to either one.These high points have little to do with the usual detailed technical review.  The advantage of the HX20V is how fast and easy it is to use, combined with the very high quality of images and video.  This was the bottom line.  A scene unfolds: will you get the shot?  With the Sony, there's a much higher likelihood.  There's no digging around in the menu system at all.  The camera stays in Intelligent Auto mode 90+% of the time and that's not just a simplifying tradeoff -- this mode really does consistently produce outstanding quality images.One con we've found so far is that it is pretty easy to block the flash from rising while holding the camera with your left hand.  Another is that we haven't yet quite figured out when the USB cable does or does not charge the battery so a couple of times we thought it was charging but wasn't.  It appears to need more amperage over USB than some standard chargers (for other products) provide.  It would be nice to have a separate charger, but OTOH it's one fewer thing to carry around and reduces weight.Another thing that's kind of halfway between pro and con is that the Intelligent Auto mode will sometimes decide to take 4-6 quick images in succession to make an HDR, and that is sometimes surprising to hear all those clicks not knowing what is going on.  But wow, the results.... and I'm quite a skeptic that HDR can be done well without dedicated software, but this unit is proving otherwise.Most of the flashy features are just not very useful.  She doesn't use any creative modes, and few other major modes.  Face recognition appears to be useful, but smile trigger is not.This camera is just superb for taking outstanding quality photos and video, with standard settings out of the box, very short lags, and high photo yield.  It is great for a person who wants very high quality results with little effort.  For someone whose requirements are substantially different, this review is likely to be less relevant.", "Date": "August 3, 2012"}, {"Title": "Improved over HX9V but has new flaws", "Author": "RIK", "ReviewID": "RCDWV7797GMMH", "Overall": "2.0", "Content": "Compared to its predecessor - HX9V, this camera improves the following1. Takes better pictures consistently (there was no washing out of pictures I observed in the previous generation)2. Flash still pops up but there is a slight sloping area where you can train yourself to rest your fingers3. Buttons are improved (one can easily tell buttons apart in the dark and they are not too flush with the body)4. Zoom is improved (20x as opposed to 16x) as is MP (18 insted of 16)5. Has macro focusbut some old problems still persist1. Panorama mode is still not as easy as with older Casio models like EX-ZR100. Sony gives you a fixed buffer that you have to fill in, instead of making a full panoramic picture based on when you stop, so if you don't fill in the full buffer you get black bars.2. External charger is extra and charging requires resting the camera on the lens or the LCD side - a bit awkward3. Compared to competitors (ex. Panasonic DMC ZS20) its thicker and bulkierand some new bugs have been introduced1. Video's (AVCHD best quaality) have lines in the last frame when played on Windows Media Player on Windows 7 (there is no clean ending of the movie)2. The piece I got had a mysterious small black circle show up in lower left side of many pictures even when the lens was clear. I'm attributing that to a defective piece and not a model defect.3. Battery went from full charge to 0 in a week without any usage, preventing the camera from even starting. Not sure if that is a general problem or just happened with this piece.Overall the camera is nice and has fancy features like 20x optical zoom, HD video, GPS, 3D pics in a pocket size body with an InCamera guide but given its high price I'd not expect any of the above mentioned basic problems.", "Date": "September 22, 2012"}, {"Title": "Amazing camera", "Author": "Nom de Plume", "ReviewID": "R3U8O45LONH23I", "Overall": "5.0", "Content": "Another update:I was at the Sony Style store yesterday and played with the just announced new Sony RX100 point and shoot, MSRP $649. I think it's worth it. Reason:  1) a humongous 1 inch sensor with 20MP, not the usual/typical APS C size sensor. What this means is that it can take very sharp pictures in low light conditions.  2) And comes with a F1.8 lens, don't think there is another point and shoot with such a bright lens. Again, great for low light situation.  3) From what I can see, it has most of the automatic features found in the HX-20/30 (the one I bought a month ago)I still recommend the HX-20V for being very feature laden and taking very very good pictures. Especially the 20x zoom as compared to the new RX100 with 3.6x zoom. The RX100's zoom is a compromise Sony had to make considering the huge 1\" sensor that will require longer and bigger diameter lens asembly to get the high zoom.And here's the \"but\", if you are thinking about buying a DSLR,buy the RX100. The zoom is roughly equivalent to the low end DSLR kit lens but this one will most likely take a lot better pictures. Consider that most Point and shoots and even low end interchangeable lens cameras have a sensor that is approximately 1/3 to 1/2 inch sensors verses the RX100 with a 1 inch sensor. It's like comparing the old film 35mm cameras to the APS-C size film cameras.And for those that want to do a lot of post-processing, the RX100 can save the pictures in JPEG and RAW at the same time.Updated Review:Absolutely impressive point and shoot that exceeds performance and quality of lots of DSLRs.I'm a Pro-sumer with extensive photography experience with Nikon and Canon SLRs and DSLR. My crown jewel is a Nikon F2AS with MD-2 motor drive (for those that go back to the film days, still takes great pictures).Granted if you setup your camera for a specific shot, a DSLR like the new Nikon D7000 will get better results but with the HX-20V, it is very easy to take a very good picture. The HX-20 results in a better picture than you expected when you took the picture. I was actually going to buy the Nikon D7000, until I played with the HX-20V. I may still buy the Nikon D7000 when the price comes down a little (now around $1400).The HX-20 has a lot more capability and performance than my HX-5V that I've been using for travel and snap shots.It automatically adjusts for the various lighting conditions for the picture. Especially amazing is the 20x zoom (500mm telephoto), with anti-blur capability that I used to take a picture of Clayton Kershaw (Dodgers) from the last seat way above the stands on the third base side. With the 20x zoom I got a full frame stop motion picture of Clayton just as he released the ball. Just a hint of blur from his hand and ball. That's a ball going around 100mph at release.Also, the low light capability without flash is amazing with very good skin tones. Specialty shots like e.g., on the Las Vegas strip is great where it takes consecutive shots and blends the dark background shots and the bright close in shots (with flash) of people and combines the shots into a very good composite picture with clear background. I use to take shots with a Canon DSLR and had to photoshop the same type of shots to bring out the background to match the people in the foreground. A big pain and still does not produce as good a quality picture as the HX-20.There are an abundance of additional capabilities that I have not mentioned.The one last point is a complaint I hear from friends that say a point and shoot cannot select manual mode like F stop and speed (like the new Canon S100 can), but on the HX, you can do both unlike most point and shoots.If you are considering getting the HX, don't get the HX-10, which is a mild update of the HX-9 with the new sensor. The HX-20 and HX-30 are completely new cameras with a lot more capability and performance. I'd say you get a lot more camera if you compare it with a DSLR like the Canon T3i/T4i and Nikon D-5100. The kit lens from these DSLRs are only (3x, 18-55mm), which is way less than HX-20 zoom (20x, 25-500mm). If you really want a DSLR go get a Canon 60Da or a Nikon D-7000.", "Date": "July 13, 2012"}, {"Title": "Great little camera.  Better than the HX9V in many ways.", "Author": "Rolla Gravett \"Rolla Gravett\"", "ReviewID": "R1HI6Q5LLSYX3P", "Overall": "5.0", "Content": "Sony makes a great point and shoot camera.  I already have the HX9V, and just bought the HX20V.  There are a lot of differences and improvements to the new camera.  I have several Panasonic Cameras and have the new Panasonic ZS20 20X point and shoot camera as well.  I like some things about the Panasonic, such as the priority modes and the different burst rates.  The Sony is unbeatable in video and low light shooting.  When set to iAuto plus in low light the camera takes 6 pictures and combines them into one photo.  The result is hard to beat.  In daylight conditions the Sony and Panasonic take excellent pictures and it is hard to call a winner.  With the Sony you can do a burst of 10 shots, but that is it.  Then it starts downloading them.  With the Panasonic you can do a burst of 10 pictures at 10 frames per second, wait a second, do another burst of 8, wait a second do another burst of 8, and so on.  In the 5 fps Auto focus mode the camera will take 100 shots without stopping at the 5 fps rate.  Below is the main differences between the Sony HX9V and the Sony HX20V.The differences between the two cameras.  The HX20V is better in these ways.Video still image size can be set at 13mp or 3mp picture size.  The HX9V has 3mp picture size only.3 way stabilization instead of 2GPS loading much faster and it works insideBetter videoBetter picturesAperture and Shutter controls much easier to use in ManualOn/Off switch much easier to useGPS LoggingLive mode in  iA and iA plus  Can adjust Brightness, Color, and Vividness.  Also several other modes are available.  Part Y (yellow), Part B (blue), and Part G (green) and Part R (red) are available.  If set for Part G (Green) for  example, the picture will be black and white except for anything Green in the photo.  The same goes for the other colors or parts.  Soft High Key Mode, Pop Mode (enhanced colors), and Toy Mode.Clear Image Zoom  Up to an additional 20X zoomIn Shooting Settings  Mike Reference level adjustment, either Standard or Low  Eco Mode  Airplane ModeP ModePicture Effect Modes.  HDR Painting, Rich Tone Monochrome, Miniature, Toy Camera, Pop, Part, Soft High Key, Watercolor, and Illustration.ISO setting to 12,800 ISOIn the P mode the camera will take pictures as fast as you can push the shutter with no delay.Quick startup.  Just over a second from turn on to 1st pictureSelf Timer  Self timer for Auto Bracketing.  You can Auto bracket or self timer Auto Bracket.  Self timer for Continuous shooting.  The camera will take 10 shots at 10fps.  Also has self timer for 1 person or two people but HX9V has that as well.Big difference.  Once you set the self timer,  say for 2 seconds, it will remember that for each picture till you turn the timer off.  You don't have to program the self timer after each picture like you do with the HX9V.  It stays at a self timer of 2 seconds even if you shut off the camera.Manual Mode  Aperture can be set to either f/3.2 or f/8.  The Shutter can be set from 30 seconds to 1/1600 second.Aperture f/3.2 vs f/3.3 for HX9VFlash works much better in the HX20V.  It does not overexpose like the flash on the HX9V does.The focus is much faster.The time for video to start running after pushing the video button is much faster.20X zoom verses 16X for the HX9VMain Dial much easier to move.  One thumb is all you need.  To move the dial on the HX9V I needed two fingers.Features of both the Sony HX9V and HX20V  Great low light shooting in the iA + (plus) mode.  The camera takes 6 pictures and puts them together in a single shot.  The pictures in low light look well lit and with no or little noise.  SCN Mode  Great HDR mode  Panoramic Mode can't be beat.  Can set the camera for HD Panoramic picture.  Book says the file size is 46mb.  Shoot in the Portrait mode for the largest pictures.  Soft Snap to blur the background with the object in sharp focus.  A really cool feature.  Night Portrait.  Great for a picture of someone with a lit background.  Night Scene.  Great low light shots with a tripod  Hand Held Twilight.  Great for low light shots with no tripod.  The camera takes 6 shots and produces one picture from them.  The output is fantastic with low noise and excellent low light shots.Many controls in the Program Mode.  You can select Vivid and add more contrast, color and sharpness in that mode.  The ISO can be set to as high as ISO 12,800.  I normally set the ISO in Auto and let the camera decide what it needs.There may be more differences between these two cameras.  Both are great and have more controls on the picture than most point and shoot cameras have.  You can't go wrong with either one.", "Date": "June 5, 2012"}, {"Title": "20x Pocket Zoom Comparison - Sony HX20V vs. Panasonic ZS19 vs. Canon SX260", "Author": "Artemaria", "ReviewID": "R1GRU944FBHUDS", "Overall": "4.0", "Content": "I couldn't decide between these three cameras (and their variants, the Sony HX30 and the Panasonic ZX20) because many of the reviews of each made the cameras sound very similar. So, I went out and bought (from merchants who accepted returns) one of each of these three cameras (I didn't need WI-FI or GPS, so that's how I settled on these less expensive variants). And then I took photos and videos in various conditions. I am not a professional photographer, and I didn't do Imatest or any other specific tests on the images (you can read C/net for that), but this is an experience of a regular person who was taking pictures and videos with these three cameras side by side, which is a comparison that you do not often see.The bottom line is that these three cameras are very similar with a few minor differences, but those differences set them apart and may make you decide that you like one more than the other.Generally speaking, NONE of these cameras is a DSLR replacement. Whomever writes that the pictures are as good as a DSLR is not speaking accurately. Also, none of the cameras is a replacement for a high end camcorder.OUTSIDE PICTURESIf you are taking pictures outside on a sunny day all of these cameras will take very nice pictures for small to medium enlargements (no bigger than 8 x 10). The cameras all produce nice fairly sharp images that would be well suited for that purpose. And, like most people, I don't remember ever enlarging a picture more than 8 x 10, so it is not a common problem.What might be an issue is if you are zoomed in all the way and wanted to crop a photo (which sometimes happens), the differences in the way the cameras' photos look when you \"pixel peep\" might make a difference. In good light outside, the cameras were close, but the best photos were from the CANON with the SONY and the PANASONIC a close second.INSIDE PICTURES - GOOD LIGHTIf you are inside and you are taking pictures in low light, you will see a different story. Again, at smaller sized prints 4x6, 5x7, most people will see almost no difference between the pictures of the three cameras other than the PANASONIC's colors are a little less vibrant than those in the CANON and the SONY. I am not sure whether those colors are less accurate, they are just a little less vivid.If you pixel peep at these pictures, the CANON's photos are clearly the best with the PANASONIC's being second. The CANON's remain very sharp through a good amount of enlargement while the PANASONIC's, although close, get softer a little faster. The SONY's pictures inside with good light became soft rather quickly and, I'm not sure if this is because the SONY has 18MP on a small chip (as some of the tech reviewers write), but there is a \"watercolor\" effect where after you enlarge it a little bit, it looks like a Claude Manet painting.INSIDE PICTURES - LOW LIGHTIn poor light, the hierarchy between the cameras remains the same, but there is less of a gap between the CANON and the PANASONIC. It seems as if the CANON takes somewhat worse pictures in low light, and the PANASONIC just doesn't get that much worse. As a result, the gap between these two becomes somewhat closer. The SONY's pictures remain the poorest of the three in low light.VIDEO - OUTSIDE GOOD LIGHTAll three cameras take very nice video outside in good light. If you are editing or nitpicky, you will note that the SONY and the PANASONIC take 60 frames per second, which is somewhat easier to edit, than the 24 frames per second that the CANON records. While you have to look for it, the CANON's outside video does have a couple of instances where it seems to be a tad jerky compared to the SONY and PANASONIC's video. But you really have to look for it and most people won't notice if you don't have another video outside for comparison.While all the outdoor video is close, I would give the edge to the SONY in video, with the PANASONIC second and the CANON third. But they are close for outside video.VIDEO - INSIDETaking video inside is a different story. Inside, the SONY shines and clearly has the best video. The video from this camera is actually good. It is not professional level by any stretch, but it is good solid quite viewable video from a camera that takes still pictures.There is a noticeable difference on indoor video between the SONY and the PANASONIC. This difference was perhaps most noticeable to me because I had both videos from both cameras and watched them over and over again looking for differences. While the difference is noticeable, it is not a tremendous difference. The SONY video is super smooth and seems to get as much out of the light as it can. The PANASONIC video also is smooth and gets a good contrast tone and color out of the available light, but is slightly less smooth than the SONY. The PANASONIC video is still very viewable and looks good, but not as good as the SONY.The CANON will take decent indoor video in good light, but in poor light, it just seems to struggle. The CANON's video had many shadows and dark areas that simply were not present in the SONY and PANASONIC videos. I did not notice any hissing in the CANON video as some of the other reviewers have mentioned. This may be an issue that varies from camera to camera.HANDLING AND SPEEDThis was a fairly subjective comparison between the three cameras as to how they felt in the hand and how quickly the camera did what I wanted it to do because if the camera doesn't take the shot when you want to, it doesn't really matter how sharp the picture or video might be.Based on my experience, the PANASONIC had the best handling of the three. While the PANASONIC and the SONY were both quick to take a picture, for some reason the SONY that I had would take a much longer time (seconds) to record the picture onto the card. This was despite the fact that both cameras had comparable cards with comparable write speeds. Both the SONY and the PANASONIC had rather quick autofocus which also made them seem to react faster. The PANASONIC is noticeably thinner and lighter than the SONY while maintaining a similar full raised rubber grip on the front which made the camera easier to handle. While both the SONY and the PANASONIC were quick, the blazingly fast (by comparison) write speeds on the PANASONIC compared with its almost non-existent shutter lag made this the best handling camera of the three by far.Even though it consistently took the best pictures, the CANON was the worst handling camera. The autofocus often had issues focusing and there was a constant shutter lag while it was searching for its focus. We did miss some shots because the CANON was so slow to react. Also, the CANON is somewhere in weight between the SONY and the PANASONIC, but has the worst grip of the three. That little rubber strip on the front is not as effective a grip as the fuller grip that appears on the SONY and the PANASONIC.With respect to handling, I've read many reviews and each of them seems to state different things about each of the cameras. Many of these reviews seem to indicate that the SONY is a very fast camera, and that might be the case, but the write speed of the 18 MP pictures (which are 50% larger than the CANON's photos and almost the same for the PANASONIC) was so slow, it was distracting and detracted from the experience of using the camera.VERDICT AND CONCLUSIONSNone of these cameras is the best at everything. The CANON has the best pictures, but is slow to focus, somewhat awkward to handle and has the worst video of the three. The SONY handles okay but is heavy and has noticeably slow write speeds, its picture quality varies greatly with the light (and will deteriorate rapidly with any significant cropping) but the SONY has the best video, and it is noticeable.In the end I decided to go with the PANASONIC. While it only was the best in handling, to me that was a significant portion of the photographic experience. It is not DSLR fast (instantaneous), but it is a zippy camera for a superzoom, is light in weight and has a good grip which makes it easier to hold. Also, it does not have a pop-up flash which I found always seemed to come up under my fingers where I was holding the left side camera. As noted above, the PANASONIC's videos were good, perhaps not as good as the SONY, but the PANASONIC was certainly capable of capturing some nice video, even in low light. The photos also were not as good as the CANON's, but they were close and very close in low light. With respect to the vibrancy of the colors, if you set the photo vibrancy on the PANASONIC to \"happy\" (which I guess is their \"vivid\") it is less of a noticeable difference. The photos look very nice and certainly are competitive in quality for this type of camera.Hopefully this comparison and these observations will help you decide between these three similar cameras so you can choose the best one for your needs. Good luck.", "Date": "September 27, 2012"}, {"Title": "Lens trouble already", "Author": "C. Streit", "ReviewID": "RARY7077EKYU2", "Overall": "5.0", "Content": "This camera takes great photos, fits in pocket but a little heavy, great zoom and macro, excellent video, good flash, nice photo software for storage and fixing pics is loaded into camera. The auto picture fix is the best I've ever used. Battery life not bad with GPS off and screen set to medium brightness. The manual is not the best so I've developed my own simplified directions on how to use. Written for novice but some gems thrown in. If you own this camera let me know if you like it. You might want to buy the $69 3yr extended warrenty with accidental breakage or 4yr from Sony for $99. These long lens from all manufactures seem to have trouble. Get 2 mini plug HDMI cable for $3 each, get $11 battery charger with two batteries, get screen protector, get transend 16gb chip for $10. Don't get case if you plan on putting in pocket and have warranty. The screen protectors work well for protection.How to setup your camera to Auto/Easy modeOn the top wheel, select green camera(auto mode)Turn on camera, push menu button, using wheel, scroll to the \"EASY\"menu and select by pushing the center of the scrolling wheel. Select\"on\" and enter.  Push menu again to Select \"large\" file size and GPSto off.  The GPS uses a lot of battery juice. This is the easiest wayto turn the GPS on and off for all modes.How to take picture on green (easy). Turn on, zoom lens, push shutterrelease down without shaking camera. Whoa! Perfect picture. To checkpicture in viewfinder press the review (sm triangle) button on back ofcamera.Tip: to get great pictures of moving subjects (pets, kids, sports) usemovie. You can make high quality pictures from a movie using thesoftware stored in camera.How to turn the flash on or off or auto.  With camera turned on; pushthe  right side of scrolling wheel \"lighting bolt\".  Again, push theside of the scrolling wheel to highlight how you want the flash set.Select by pushing the center of the scrolling wheel. The camera willkeep this setting in all modes until you change it again. To force theflash to always on, you must be in the \"P or M\" modeTip: use flash to get nice skin tones both indoors and out.How to set the delay so you can get into the picture too. With thecamera turned on; push left side of scrolling wheel. Again push theside of the scrolling wheel and select by pushing the center.To take movie. Turn on, push red movie button on back of camera, zoomlens while recording, press red button to turn off.  Remember the redmovie button turns on and off the movie. The shutter release buttononly snaps pictures while in movie mode.To take panoramic picture. Set top wheel to i[] mode. You will need tomove the camera from left to right after pushing the shutter releaseonce.How to set Macro for close-ups. You don't. It comes on automaticallywhen you have the lens close to anything. Minimum focus is one halfinch.Photo creativity. Select by pushing the bottom of the scroll wheel. Aneedless feature that alters the original picture. All the techniquescan be done on any picture using Photoshop software.How to set camera if not using easy modeOn the back scrolling wheel set Display to off, flash  to auto, single shootingThen push menu button, scroll to tool box,Camera settings, Movie format AVCDH,AF auto, grid line on, clear imagezoom on, digital zoom on, wind noise on, mic level normal, red eyereduct auto, blink alert auto, write date off, expanded focus on,Custom bottom EV, disp resol standardHammer menu, beep off, panel brightness 3 or 5 if outside and sunny,airplane mode off, gps setting off.  Use the defalt for all the rest.Going back to the main menu select image size, I like 4;3 10M, select\"Lo\" for cont shooting, select SCN+, smile off, face detection auto,movie quality to HQ, still image to 13M, Steady shot to STDWhat mode to use. There are ten choices on the top wheel. Only 4 are necessary.1st mode For most pictures and movies use the green camera (auto) Thismode will automatically select the correct scene, focus, shutterspeed, f/stop, and ISO. You still need to set flash if you don't havethe flash on auto.2nd mode Don't use the gold camera (auto plus) mode. It is suppose togive you a better shot in low light because it take multiple picturesand blends them together. All my pictures look very grainy with lossof detail.3td mode The program mode (P) is useful if you want to manually adjustISO, white balance, focus, light meter, bracket setting for EV, colormode, picture effect. I will use this mode to get accurate colors. Setthe color mode to real\"R\" instead of standard. I also use this mode toget great sunsets. Set the light meter to \"spot\". I also like thismode in low light situations. I can fix the ISO to 400 which gives youa less grainy picture but it will lengthen the shutter speed. Mightneed a tripod here.4th modeThe manual mode (M) in addition to the program mode settingyou can adjust shutter speed and f/stop. You set these using thescroll wheel. Push the center button to highlight the shutter speed orf/stop. Spin the scroll wheel to select different settings. I likethis for night shots. To get great stars set shutter speed to 30seconds, ISO to 400, and f stop to lowest setting, set the focus tomanual and set for infinity. Use tripod. To get good shots at nightyou have to take multiple shots. After each shot you readjust theshutter speed to get brighter or less bright pictures.  This is timeconsuming if you have the shutter speed at 30 sec. It takes about oneminute to process the picture on top of the 30sec of capture.5th MR mode allows you to store camera settings. It can store 3different situations. Might be useful to store the settings forshooting stars at night. I haven't use it yet so I don't know how towork it.6th Panoramic mode i[]. Works great for panoramic7th Movie mode. Only useful to set the menus. You can access the moviemode from any mode by just pushing the red movie button.8th mode 3D mode. A gimmick mode. Might be useful if you had a 3D TV.You can get a taste of how it works if you take a picture of a subjectthat is only 10 ft away.  It works like the panoramic mode. Whenreviewing the picture push the center button on the scroll wheel andtilt the camera. You will see the objects in the picture move.9th mode Scene SCN mode. Allows you to pick one of 15 scenes.Supposedly, the green auto mode can recognize the correct scenesautomatically. This mode might work nice for fireworks.10th mode Defocus mode. Will make the background out of focus. You cando this after the picture is taken with software too.6 months after purchase and over 1000 pics dust inside lens has distorted images. Dark blotches noted in blue sky backgrounds. Will have to send in for cleaning. I've had the same issue with my Sony t-100 after 3yrs and 4000 pics. The repair fixed problem then and hopefully it will now. Took about a month last time to fix. Bad omen that it happened so soon after purchase. Bummer. I still like the camera. Awesome pictures and video.Got my Camera back in a week. They changed the lens assembly. It looks clean now but the exposure meter not working correctly. I resent it in (Sony paid shipping this time). They changed the lens assembly again. Works fine now but when zooming the lens, there is more noise than before. This is only an issue when shooting video.", "Date": "August 27, 2012"}, {"Title": "Great camera, a lot of features for your money.", "Author": "Mark Wheeler", "ReviewID": "R1XLVNUA9ASMNZ", "Overall": "4.0", "Content": "The photos generated with the camera are not for pixel-peepers.Zoomed in, most photos look a little \"painted.\" But don't let that dissuade you if you are looking to upgrade from an older camera.My previous camera was a 5-megapixel Fuji that I've had for 7 years.The features and scene settings are remarkable.The auto-stabilization is very good.The sweep panorama mode works really well.http://www.amazon.com/gp/customer-media/permalink/mo3P2RX7RZD0VRK/B006K551WQ/ref=cm_ciu_images_pl_linkMovies and audio at 1080p are gorgeous.Low-light photos are a little soft, but look excellent.I have uploaded some test shots from the DC101 Chili Cookoff from May 12th.", "Date": "May 17, 2012"}, {"Title": "Poor picture quality", "Author": "[UHL]TUSSAUD", "ReviewID": "R1YDYHSVUNZEUG", "Overall": "3.0", "Content": "I am used to shooting with a DSLR, but I wanted something light and small that I could carry around with me. I chose this camera because it had the option to manually set the aperture, shutter speed, and ISO to a certain extent. I also chose this camera because the zoom is outstanding.Pro's:1.The zoom is fantastic. You can be fully zoomed in and the picture quality is still good.2.As long as you are taking a picture outside, the pictures should turn out great.3.The camera is small and the flash is well hidden when not in use.4.You can manually, to an extent, set the aperture, shutter speed, and ISO5.They have a lot of fun auto settings for different needs (landscapes, action, portraits, food, etc)Con's:1.The picture quality is absolutely terrible indoors.2.The automatic settings are always too bright for my tastes. Ever see a sunset with lots of pretty colors and try to take a picture of it only to have the picture look bright without much color at all? Well, that's usually resolved by raising the aperture. On top of that the light sensors of the camera need work.3.The menu takes too long to load. Sometimes I just need to take a picture quickly, but I can't actually access the camera until loads. Quite annoying.4.The pictures that are taken indoors in low light, instead of looking pixelated, they look like a watercolor. It's a strange effect. I look for clarity in my pictures. This camera was definitely not right for that.5.When you zoom in and use the flash, you get a shadow in the corner of your photo. It's annoying.I had a nikon coolpix in 2005. That camera was way better than this sony. The picture quality was fantastic. I plan on getting rid of this sony and getting a nikon point and shoot next.", "Date": "January 2, 2013"}, {"Title": "Sony HX20V - Amazing piece of technology", "Author": "hiDhaval", "ReviewID": "R33LX0MDIA2FW8", "Overall": "5.0", "Content": "One of the best compact sized camera I have used.+ Amazing clarity of pictures - eg: lovely capture of colors of evening sky+ Brilliant low-light / night scene capability - used it from top of Empire State in night, used zoom, no flash - still very steady and very clear+ Good steady shot even in high zoom.+ No complaints with the battery life yet+ Beautiful LCD display screen+ Panaroma Sweep is great, no breaks / stiches visible at all.- Didnt find option to force flash-on ... theres just Auto and Off- Beginners would find difficult to know how to set the exposure length etc in Manual mode ... I am still trying to figure it out.Am yet to use all the modes - burst / soft-skin / background-defocus etc etc ...I also bought Transcend 32GB class-10 SG card .. would recommend that too.Very happy with the camera. More than worth the money.", "Date": "July 31, 2012"}, {"Title": "Pretty Good", "Author": "James Fundeburgh \"JimF\"", "ReviewID": "R35RXTCZMVL77K", "Overall": "3.0", "Content": "This camera works well and takes terrific pictures. But a camera becomes a bit of an attachment - an extension of your creative impulses and this one has not synced with me yet.  It probably will not- I think I am taking it back.  Of course it's all about comparisons.  I had a Sony alpha-NEX5 with the huge APC sensor that took amazing pictures so rich they raised your cholesterol just looking at them.  It did amazing HDR sunsets that got me dozens of likes on Flickr. But the thing was like an albatross  around my neck and to carry a long lens you need a wheelbarrow. I went hiking with my daughter where we saw sea otters, eagles, and osprey and her tiny little Canon SX230HS made glorius sharp pics showing the otter laughing at us and my Sony showed a little gray dot in the water.  Sold the Sony NEX- bought a Canon SX230.  Great telephoto. Crisp color but NO shadow detail.  I missed my HDR.  Then I read about this camera and just bought one.  In 4 days I have taken 300 pics.  Some of them beautiful.  Here is what I think:Pro-Wonderful Zoom. Amazing close ups.  You would pay $5000 for a SLR that does this.Superior Auto  as well as Intelligent Auto relieves you of ever having to make a decision.  Just shoot- they work great.Pretty good resolution for a tiny sensor.Pretty versatile scene select and manual mode if you really want to fiddle. (Food mode is excellent).Con-HDR mode really sucks- oops (sorry)-  I mean it does NOT make pretty pictures.  The iPhone does a better job.Camera is a little fat and heavy to be a true pocket camera.Slow start up and shut down.  Slow to zoom.Superior auto is really slow to save the shot- 5-7 seconds?Burst mode only takes 10 pics.  This is actually important if you take pictures of things that move like people, pets or wildlife.  Sometimes you need 50 or 200 to find the perfect one.Boy do those 18MB pics fill up your card fast.Summary:  I like my $260 Canon SX230HS as well or better than the $370 Sony HX20v.  The sony is a somewhat  better camera but the canon is smaller quicker  and more friendly.Advice- the very best camera is the one you have with you.  Find the one that you want to cary and cary it. .", "Date": "September 5, 2012"}, {"Title": "Good for video ... with a catch", "Author": "stephen", "ReviewID": "R2ZJIY2PZ6NBV8", "Overall": "4.0", "Content": "I do a lot of video and have a range of pro and prosummer camcorders that I use, so video was high on my list when I bought the camera.  One reviewer stated the following ...\"The lighting that the camera requires for video is much higher than that required for still photos, and is about double that of the usual camcorder ...\".I thought so also, but when you try fluorescent lights instead of incandescents it works very well for video (with actually less light).  The problem is not really one of not having enough light but the fact that the auto white balance does not seem to work well on the video setting.  It seems to default to a white balance setting for the fluorescent lighting.  Furthermore, you cannot change the white balance when in Movie (video) mode.  That makes skin tones and overall color tones on the indoor videos look way too reddish.  Once I used the fluorescent lights (I use studio soft boxes) instead, the high def videos looked great ... even in the 28Mbps 60P mode.  Very impressive ... now if they would add an external mic jack I could have pro sound along with the pro level video capabilities and I would not have to take a camcorder along to capture video for smaller projects.  Other than that, I am very happy with the camera, which I will use primarily for video, and am glad I tried it with the other type of lights. The still image aspects of the camera are impressive except that there is a little softness when you zoom down on the image you captured.  But unless you plan on blowing up an enlargement beyond 11x17 it will probably not be a factor.  Good color saturation, but I think the default is set to \"Standard\".  Using the \"Real\" setting (with dial mode set to \"P\") will get you a better color ... more realistic to what you actually see with your eyes.  I use the \"P\" mode for everything as then I can let the auto select the iris and shutter but I have control over other aspects.  For all up close outdoor faces in bright sunlight, for example, I always force the flash and position about 4 feet from the subjects.  This lights the face and makes a pro shot instead of faces in shadows being drowned out by the background lighting.  Another pleasant feature is that the little guy records some pretty good audio during the video recording.  Overall, it's a good buy for the money and gets video on par with some $1,000 camcorders that I have.  It would have been a five star review except for the noted white balance problem in video.Review Update August 10 2012 ... discovered I had manually set white balance wrong so only Auto worked with proper white balance.  Video now seems to be okay for white balance as long as you set the MR settings to AWB to automatically set it. I would now go with 5 stars.", "Date": "August 7, 2012"}, {"Title": "Really nice camera", "Author": "R. Hessler", "ReviewID": "R11BEEE3WLQKFE", "Overall": "4.0", "Content": "Having a child soon and wanted to have HD video capabilities.  A lot of research followed.  It seems each brand of camera has their positives, so you gain something good with one brand, but give up something with another.  I ended up with the Sony because of its hands down, review consensus that it does HD video the best for a point and shoot camera.The optical zoom this camera has is incredible.  Of course, at 20x, you may want a tripod, but it may not be necessary due to the incredible shake control the camera has, an option you can adjust.  Taking images at 20x can be difficult though.Image quality is very nice. One thing I noticed when trying to take images during dusk at a soccer game was the camera did much better when set to intelligent mode than the generic P mode.  The images were more color saturated, sharper, and better focused. I have played a little with the HDR option.  It doesn't seem to be adjustable, however, it does improve the exposure in the images nicely.  Don't expect results you may see online where people go to town with the HDR and create painting like images.  This HDR mode manages the low and high ends of light exposure within an image, where digital cameras struggle.  It balances them very nicely and you'll end up with a very nice photo.Image quality in the dark is superb.  Sometimes the camera can hit the spot perfectly on its own, or you can set the cameras ISO in lower light conditions to try and track the best exposure.  I was very happy with the low light quality, without needing a flash.  I typically try avoiding the use of the flash.The LCD screen is very good and the quality really sticks out when you switch to recording a video in HD.  The clarity on the view screen in incredible!  The zoom on HD recording is also great and sharp.  You can record movies in a number of resolutions which can help extend the recording time, as 1080p is a hog on memory.  Each of the resolutions look great.  It is also great to be able to take high quality images while recording a movie.Megapixel-wise, you may be best off reducing the size of the photo one step from 18 Megapixel, unless you plan on printing large images from them.  Otherwise, 18 MP creates needlessly large images.As to battery life, I haven't used the GPS yet, so I don't know how much of a drag that is (others report it does significantly reduce the battery life).  However, I have had little trouble getting through a day of pictures and movie taking without needing to change the battery.Speed of the camera is very good.  It takes two to three seconds to go from off to ready.  If you are using an enhancing mode for the pictures, you will need to wait a couple seconds between shots.  If you are taking regular images (P, S, M modes), you should be able to take near continuous shots.The manual mode is decent, though you only have two aperture settings to choose from, which will limit your options.My main beef with the camera is the USB access location.  It is located on the base on the camera, which means if you want to charge or transfer images, you need the camera to be laying on its back so the cable can hook into the camera.  I kept the little bag that the camera comes in and place it on that to help protect the LCD view screen when transferring images or charging the camera.Overall, I am very happy with this camera.", "Date": "August 6, 2012"}, {"Title": "DUST inside the camera once a year", "Author": "Rüdiger \"res80\"", "ReviewID": "R3T3I3IZB0JLPU", "Overall": "1.0", "Content": "Initially, I was very pleased by the image quality of the camera.However, after a few months I noticed some dust inside the camera, so I sent it to repair in Austria (where I lived at that time).Repair was within warranty so free of charge.However, the dust inside re-appeared one year later, now Sony asks for 150$ to clean this camera again (here in the US).This is insane, I am not going to pay 150$ per year for an error that seems to be a design error of the camera (as a lot of people complain about that dust inside this camera on the internet).Sorry, Sony, this was my first and last camera from your company.", "Date": "February 7, 2014"}, {"Title": "Nearly Perfect!!", "Author": "M. GRIMM \"Longtime amazon shopper\"", "ReviewID": "R3P1ZA8RQPJKUB", "Overall": "5.0", "Content": "I've only had this camera for less than 24 hours, but I love it so far.  My one quibble is the pop-up flash being located on the top left side of the camera.  I just need to train my brain not to put a finger there while the auto flash is turned on.  As far as the rest of the camera goes, I think it's really great!  This is replacing a Panasonic Lumix TZ4 that I bought about four years ago.  A fine camera, but the Lumix had a similar problem in that the recording mic was placed on the top left side.  I'm glad the stereo mics on the Sony are placed in the center where they belong.  Being a compact camera crammed with lots of features, inevitably there must be some sort of compromise as to where some items get placed on the exterior of the camera body.Photo quality of the Sony is very good.  The panorama mode couldn't be easier.  The macro mode is excellent.  I'm looking forward to trying the video and 10fps burst modes.  It didn't take very long to get familiar with the location of settings in the menus.  Having a user guide built into the camera, and on-screen descriptions of the different settings and modes is a definite plus!There are simply too many features for me to mention in a brief review.  You just want to see a positive review to help you decide if this is the right camera for you.  I've read countless reviews on cameras like this one is the past few weeks.  I take the negative reviews with a grain of salt.  Some folks either get a lemon, or they didn't  take the time to read the manual to understand how it to get good results. My main criteria was a 20x optical zoom, great photo quality, great quality 1080p video/stereo sound, relatively compact size, and ease of use.  I looked at Canon, Nikon, and Panasonic. All very similar, and each with their own merits, but the Sony has met and exceeded my requirements.  All of the other things this camera is capable of is just the icing on the cake!", "Date": "January 3, 2013"}, {"Title": "Highly recommended travel zoom", "Author": "DGaydon \"dgaydon\"", "ReviewID": "R2T5LFJZTA979F", "Overall": "5.0", "Content": "This past week I had the opportunity to tag on a visit to Kruger and do some game drives in S. Africa while doing a business trip in Johannesburg and literally got this camera the day before I left (yup, normally a big travel no-no). I needed a pocket travel zoom camera that I could easily travel with w/o dragging around a full blow DSLR & lenses.  I consider myself a relatively advanced amateur photographer, have done dive photography, etc.Just got back and checked out the pictures - they're amazing.  The quality of the 20x zoom on this camera is incredible for a camera this small.  I had the camera on \"idiot\" auto mode most of the time (hadn't had time to really learn all it's features) and it took some great shots in really challenging lighting conditions - early morning low light, afternoon w/heavy shadows, night shots, full zoom while the jeep was moving, animals moving fast, etc.  Also took some video and the 1080p quality again is incredible for a camera that fits in my pocket (actually wish I'd have taken more video).Online reviews totally push the Canon PowerShot SX260HS as by far the best in this category - but my sister had purchased it earlier this year and had big issues with it handling the correct exposure w/heavy shadows/bright light conditions and the video quality is so-so - thus I went with this camera.  Giving it 5 stars as a great value for a travel zoom in this price range.  Will be very curious to compare my pictures w/my friend who used a mid-level Canon DSLR (forget which one).", "Date": "July 30, 2012"}, {"Title": "Fast, Easy, Fabulous Photos", "Author": "L. J. Schrader", "ReviewID": "R2QT6K8C93ZIBW", "Overall": "5.0", "Content": "As you are probably doing right now, I researched many, many cameras to find out which ones I would be interested in checking out in person. I am not a pro photographer, just someone who loves to take photos of friends and family, as well as games, beautiful locations and nature.While I do know how to use a manual camera, it's just not practical for casual use anymore and I wanted something simple and quick so that anyone in my family could pick it up and enjoy. I was tired of hearing \"take the picture already\" from family waiting for my 1 fps digital to reset, so I wanted something that would have a quick processing speed  so that I could actually take shots at sporting events and moving subjects.After picking five favorites, I went to the local Best Buy and looked at each of them. This Sony was the clear winner for many reasons, and here is the rundown:EASE OF USE:The camera is extremely user friendly and this is what truly sold me on it. The in-camera menu is awesome! Imagine having a tiny computer available at all times to guide you on how to use your camera in all of its modes, with FAQs, pointers, and *gasp* a real tutorial/instruction manual right in your hands instead of in a bulky book or CD. Turn the camera on, look at the screen and find whatever you want to get started.I instantly began shooting in various modes and had a handy guide showing me step by step what the camera is capable of. I have owned cameras that have multiple functions, but never had the patience to read up on it, decipher the info and actually use it effectively.The camera top wheel for selecting modes, as well as the buttons at the side of the screen are easy to manipulate and clearly marked. The screen features are easy to read, slightly easier inside than in sunlight, but still visible outdoors.For those who choose to, there is a manual mode. I only dabbled with it since it's not my priority for this camera, but it is available if you want to have more control/experimentation.SPEED:The second biggest reason why I picked this camera was the processing speed. There are various burst settings (taking anywhere from two to six pics in succession) and even the single photos took minimal time to process and recover for another shot. I can now get live shots of people and animals without the frustration of waiting for the camera to be ready for me.PHOTO QUALITY:Obviously, no matter how easy a camera is to use, it's no good if the results are not fabulous pictures. This Sony creates great, clear pics and there are multiple settings available to customize the way you want your photos to look. I tried every setting on the same subject (my friendly local chipmunk)and every one of them came out fantastic. Again, I am not a pro photographer, so I do not break down the photos into super specifics, all I can say is that the color looks true, outlines crisp and people are smiling in my shots because I can capture quick, candid moments like never before.SIZE:This is not a tiny pocket camera, like many on the market, but it has a nice feel/weight to it and is still very comfortable to hold. Actual size is about 5\" wide/1.5\" deep. The size is actually a positive for me since many of the teeny cameras had difficult to use buttons or touch screens that I hoped to avoid.ZOOM:The 20x optical zoom is quick and has good capability even at those long distances. For example, I got a shot of a dove perched about 300 feet away using the full zoom and the result is sharp and detailed.MEMORY AND BATTERY:The Sony has built in memory, but we bought a high-speed memory card to make the most of the camera's capabilities and to have lots of room for pics without worrying about running out of space until the next download. The battery lasts forever (well not literally, of course) and we did not have to plug back in until after multiple uses and hundreds of shots.MODES:There is auto, super-auto, defocus, illustration, etc. There are so many choices of how you want your photos to appear and clear directions (in camera!) on how to use each one, so enjoy some creativity. Each one was interesting and slightly different, fun experiment with.Overall, I have just loved the ease of use and resulting great shots of this camera. Check out all of your favorites in person before purchasing and you will see the clear difference. Happy shooting!", "Date": "June 20, 2012"}, {"Title": "20x is fun", "Author": "Jim", "ReviewID": "R1HZHTHL5FXF8R", "Overall": "4.0", "Content": "Got this camera after my trusty Panasonic Lumix DMC-TZ5 LCD stopped working. Just like when I first started looking for a travel zoom camera, I was looking for one that has the highest zoom with a form factor that does not blow out of proportion. After looking at the spec of the latest Lumix 20x, I decided to try the Sony instead. Almost did not buy it as it was not available until very recently.Here are some nice things about this camera:- At 20x, of course it bets out my old 10x anytime. But more important was the image stablizer - Optical SteadyShot. I think it worked very well.- The auto balance works very well for me.- Respond, startup, zoom focus, is good. Although I read that the new Panasonic 20x is faster, I thought the Sony was fast enough for me.Not so good- Somewhat heavier- The charging point of the camera is at the bottom - which meant you have place the camera on the LCD screen rather than sitting up- Menu while ok, I think Panasonic menu is better.- More expensive (if not the most expensive when compare to all other 20x)", "Date": "May 12, 2012"}, {"Title": "Dust on sensor", "Author": "Marika M \"rubberduck\"", "ReviewID": "R3NLL8Z8XVSIMX", "Overall": "2.0", "Content": "The camera is a nice size and has nice functions, however it lacks on quality in manufacturing as it gets dust on the sensor - in my case after 10 months, and I have seen other reports even earlier. I am not yet sure what I will do, but feel very disappointed that this Sony not of higher quality.", "Date": "October 25, 2013"}, {"Title": "Great compact zoom!", "Author": "Geoff K. Hart", "ReviewID": "R2VAWVBL2W0M40", "Overall": "5.0", "Content": "For the last few years I've been using the Panasonic DMC-ZS3 (12x optical zoom) which I loved.  Great zoom, great video, fit easily in my pocket, nice auto mode and nice macro.  Many hundreds of family shots, parties, vacations, never let me down.A few months ago, I bought an Olympus XZ-1 (here at Amazon, a \"used like new\" for <$200).  I used it at a few parties, and for my daughter's prom and graduation.  When I actually compared the image quality, with my old ZS3, I was blown away.  The amount of improvement really surprised me.Except for two things: video quality (the XZ-1 focus hunts a lot during video), and of course lack of zoom (this mattered at the graduation ceremony).I expected those, so they weren't really disappointments (I had planned to keep the ZS3 for those purposes), but the amount of improvement in other areas made me start thinking about a ZS3 replacement.  I did more research, and started leaning towards the HX20V (bigger zoom and supposedly excellent video).  Then I spotted a demo unit for $150 (off e bay, sorry Amazon) and bought it.  The research didn't mislead me:FAST - it does everything fast: turn on, focus, shutter, video operation.ZOOM - there are cameras with longer zoom, but the 20x optical, plus digital (actually works pretty well) give me a big improvement over the ZS3.VIDEO - excellent, even in low light.  I would recommend this to anyone who wants a video camera.One thing that did surprise me: the camera itself is physically almost identical to my old ZS3.  Same size, same button placement, same LCD screen size, even the lens cover is the same.  It's a little heavier than my old ZS3, but hardly noticeable.  The lens is more centrally placed (which helps a little for macro shots), and the mode dial is dropped into a recess - which was my one annoyance with my old ZS3: that I would accidentally knock the dial to a different mode (did this often when I dropped it in my pocket), very nice improvement.", "Date": "July 1, 2013"}, {"Title": "AMAZING CAMERA", "Author": "Jean Carlos", "ReviewID": "R214A36IWGZP6A", "Overall": "5.0", "Content": "I saw the quality of recording on a video on youtube from Madonna's MDNA Tour in Abu DHabi and th definition and ZOOM was AMAZING the ambiental mic sounds great, with bass and lows. The most incredible definition 1920x1080p REAL!!!The size is not so small and a little heavy, buy you can have it in your hand.The photos have and incredible resolution 18mpx wow and the effect SCENCE for your skin is great like this, mi skin looks so clean and healthy [...]Im glad with this camera, u can use a pro duo memory OR a SD memory but 16 or 32GB for a hour or 2 hours of a FULL HD recording here some links of the videos that I made, this camera is a dream![...][...][...]", "Date": "June 29, 2013"}, {"Title": "Good value under $300", "Author": "Mjolk", "ReviewID": "R2FSGQ5F7J4MQB", "Overall": "5.0", "Content": "Was looking for a replacement camera for my wife. Hers, another Sony had reached end of live and was literally falling apart. We considered a SLR and also the HX200, but settled for this because of the compact design. Though the zoom is not as high as the HX200, compactness is the primary reason: one can put this in a pocket. Additionally, we could use the battery from the older camera as well as the charger.Pictures are of great quality, the panoramic is superb -though it took some tries to get it right. The video in HD is great to show in a big screen.We have the GPS off all the time, takes too much off the battery life.The 2 main complaints I would have are that turning it on is not as fast as I'd like, but again, for an under $300 camera I would be willing to compromise.The second issue is that there is no viewfinder, which sometimes is annoying; most of the time is not an issue however.Among the other pros, are the good quality of fast action pics, the picture taking while in video mode.In general, happy with the camera, but keep in mind, this is not a SLR and you can't change lenses: you are getting a good value for under $300.", "Date": "January 22, 2013"}, {"Title": "Great Pictures - Slow Processor", "Author": "Aussie Grandma", "ReviewID": "R1ERL3R8WTJJVD", "Overall": "3.0", "Content": "Sony Cyber-shot DSC-HX20V 18.2 MP Exmor R CMOS Digital Camera with 20x Optical Zoom and 3.0-inch LCD (Black) (2012 Model)Received as a gift. Wanted a camera that could catch pictures of very active grandchildren. So I was looking for a camera with minimal shutter delay and short shot to shot delay. This camera seemed a perfect fit and is one of the fastest small cameras that I have seen. However, there is a delay after every picture is taken to process the picture onto the SDHC memory card and I am using a Class 10 card. The delay seems to be around 2 plus seconds without flash and upwards of 4 plus seconds with the flash. This is the first camera that I have experienced this type of delay. During this delay, obviously all you can do is wait which is unacceptable to me. Other than this delay, it is an excellent camera. I am returning the camera due to this delay and will continue using my old Nikon S8100 camera which is very fast in its own right without the processing delay.", "Date": "January 1, 2013"}, {"Title": "Excellent video and photos!  Idiosyncrasies, though...", "Author": "Dr. Cherokee", "ReviewID": "R3606VZMWUDWTI", "Overall": "5.0", "Content": "All in all, this is a great camera.  If you're especially keen on taking great 1080 60p video without using a camcorder (and still preserve the ability to take great photos), and price is not an issue, strongly consider the HX20V.A little on terminology: 1080 means \"1920x1080\" and is the pixel resolution, and 60p means \"60 progressive\" and is the framerate or temporal resolution.  60p \"60 progressive\" essentially means 60 full frames per second, whereas 60i \"60 interlaced\" means 60 half-frames per second.  60i is not the same as 30p, but it's similar.  That goes beyond the scope of this review.Anyway, I've been a Canon camera aficionado for many years and I hesitated to buy a Sony.  The Canon PowerShot SX260 HS 12.1 MP CMOS Digital Camera with 20x Image Stabilized Zoom 25mm Wide-Angle Lens and 1080p Full-HD Video (Black) is a great looking camera and quite a bit cheaper than this camera as of December 2012.  That's a consideration.  The SX260 does not take 1080 video at 60 frames, but 1080 at only 24 frames.  That was a deal-breaker for me.  Some people may want the slower 24p movie-style framerate.  If that's not a deal-breaker for you, then you'll save a good deal of money going with the Canon.  If you want awesome 1080 60p video in a small size, this may be for you.It does have a some small idiosyncrasies, and since the instructions are woefully inadequate I'd like to discuss one.  This involves photo and video numbering on the camera and behavior via Windows 7.  I assume other versions of Windows act similarly, and I don't know about Mac.**Photo Importing**First of all, no matter how you import photos, they're numbered sequentially and NEVER reset in sequence unless you instruct the camera to do so.  DSC00001.jpg, DSC00002.jpg, etc.  You can import them through Windows or through proprietary Sony PlayMemories software (which is downloadable for free).  BOTH work fine for importing photos.  The \"Date Taken\" and EXIF metadata (the EXIF contains GPS data if you turn GPS on) is always there and correct no matter how you import.**Video Importing in Windows**(I've only used the 1080 60p, but I assume the other formats are the same.)  If you import videos through Windows, or view them directly by file browsing the camera, you'll notice that they'll ALWAYS reset in sequence at 000000.mts after erased from the memory card or the memory card is changed.  For example, if you import videos through Windows after recording 4 videos, you'll get 000000.mts, 000001.mts, 000002.mts, 000003.mts.  Erase and record 4 more.  Same exact names.  You can just import them into different folders, but with the same file names it could get confusing.  In addition, GPS data for videos won't be imported.  On the positive side, the \"Date\" metadata will be correct under Windows.  The moral of the story for me is to not import videos using the Windows importing feature!**Video Importing in PlayMemories**For the videos, when you import using the proprietary PlayMemories software, you will get two files for each video.  One is the actual video, with the name itself labeled with the date and time you took it (20121130184709.mt2s would be 2012 November 30 and military time 18:47 and 09 seconds) and another file with the exact same name but with the extension \".modd\" after it.  As far as I can tell, the \".modd\" file has all the metadata.  That includes GPS, so don't delete it.  I'm not sure if any software other than PlayMemories can directly read those \".modd\" files, but you can view them as a text file for that metadata.  On the negative side, the \"Date\" metadata and all related metadata (\"Date Created\" \"Date Taken\") in Windows will be the date you imported it, not the date you took it.  (Remember, the photos--unlike videos--NEVER start over unless you instruct the camera to reset the sequence.)**Summary**I'd rather have a unique file name (and GPS data) than the correct Windows \"Date\" metadata, but it's still aggravating--especially considering the inconsistent behaviors between video and photo importing/naming.  It's easier to import everything at once, so I import all through the PlayMemories software: videos and photos.I hope this review helps some of you figure out how to use this camera, because it's a great one.  Don't let this review dissuade you.  This camera has fantastic video, great photos, and it's nearly flawless.  Final note: the Sony Cyber-shot DSC-HX30V 18.2 MP Exmor R CMOS Digital Camera with 20x Optical Zoom and 3.0-inch LCD (Black) (2012 Model) is essentially this camera with wi-fi.  At the time of this writing, it's quite a bit more expensive.  Unless you MUST have wi-fi transmission of photos (and I personally only use \"old-school\" moving of photos via SD cards) then I'd save your hard-earned money and go with the HX20V.  But, if the cameras are very similarly priced, you might want to go with the HX30V for that wi-fi capability.", "Date": "December 25, 2012"}, {"Title": "superb video image stabilization", "Author": "Bobbo", "ReviewID": "R1C9SKAWDZLD4X", "Overall": "4.0", "Content": "I generally take video rather than stills, and I was looking to replace my broken video camera when I decided to find a camera that would do both.  Since buying the HX20V I have greatly enjoyed the still photo capabilities of this product, but for purposes of this review I want to emphasize the video.  As others have noted, the hi-def quality of the video output is absolutely beautiful.  But what perhaps is even more impressive is the image stabilization.  I didn't realize quite how great this is until today, when I took video of my dog while walking (fast) beside her on a rough trail.  The image stabilization smoothed things out so the result was totally watchable - and this from someone who gets seasick at movies shot with handheld cameras.It's true that, as compared with a dedicated video camcorder, the HX20V has very limited control availability:  the EV is about the only thing that's adjustable.  Not even manual focus is available, although it's not a big problem because the camera can do \"tracking focus\" - e.g., focus on a person even as the person moves about in the frame.  For documenting everyday events, vacations, etc., I think the HX20V will do just fine.I should point out that there are two image stabilization modes available when taking video:  the regular optical stabilization, and optical plus electronic stabilization (Sony calls it Active Mode).  I've only used Active Mode (which is the default setting), so I can't say how effective optical alone is.  I'm not aware of a downside to using Active Mode other than I think the wide angle end of the zoom is not quite as wide -- I'm guessing because part of the sensor is reserved for use by the stabilization system.", "Date": "November 25, 2012"}, {"Title": "Best Overall Camera", "Author": "MattM", "ReviewID": "R3KKH6AK6F9DRP", "Overall": "5.0", "Content": "This Camera has so many features its way to difficult to learn to use them all. However The features I wanted I figured out and left the rest to the automatic mode.  My absolute favorite feature is the GPS automatic geotagging. It took a few minutes to figure out to to set it up, but the manual is pretty straight forward and works well here. It seems to have a very accurate position, and is capable of locating multiple satellites. Sometimes it takes a few minutes to get signal and locate its position, so your not gonna whip it out of your pocket and start shooting with geotags. The other drawback is that theres no indoor positioning. Once it looses signal its over. So far I've been about 50/50 inside for keeping GPS signal. Some people have reported a low battery life, and I have experienced dead battery a few times on long tour days, after shooting about 150+ pics with the GPS on all day. I do wish it would last all day, but I realize thats unrealistic, my phone battery drains quick with the GPS left on. it has a wall charger and USB charge cable as well.The picture quality is fabulous the 20x zoom is clear and works very well. We also have a Sony NEX-3, which is suppose to have the SLR quality lens, and many of the same features, I just ordered the HX-30V for my wife to replace it. Biggest notable drawback to me on the newest Sony cameras is the display. It is plastic and very susceptible to light scratching. The NEX -3 frequently gets tossed into a purse on the fly and the screen is very scratched(but totally usable) and my HX-20V is starting to as well.  I would recommend a neoprene sac to protect it. Overall I love this camera and haven't found anything on the market that even compares.", "Date": "November 23, 2012"}, {"Title": "Update: very poor video quality?", "Author": "Almelle", "ReviewID": "RNOCCM39R8C6T", "Overall": "3.0", "Content": "Posted August 2012:I've been looking for a year for the right camera, and finally took the jump on the Sony Cybershot Hx20v. While I was impressed with the reviews on some of the Canon and Panasonic models, when I actually tried out models at a store, the Sony had the highest quality, with a zoom far clearer than I could see with the naked eye! In picture quality and heft, it stood out from other point and shoot cameras.UPDATE December 2012:The picture quality continues to be wonderful and the auto-correct (five pictures merged into one) is helpful if you're too lazy to manually adjust photos taken in low-light. An annoyance: you have to go to scene settings to get landscape or micro mode (!)And an even bigger concern: I just looked at the video for the first time and the quality is terrible - jumps and freezes and striated lines. I'm using a SanDisk 8GB SDHC card, a brand that's always worked for me before. I'd love to hear if others are having similar problems, and if it seems to be the camera or the card!", "Date": "August 27, 2012"}, {"Title": "Very stable video, intelligent auto", "Author": "Grimmy \"Grimmy\"", "ReviewID": "R2FEOMY0QQE9JU", "Overall": "4.0", "Content": "The big standout feature is the remarkably stable zoomed video. Even at max zoom, there is almost no jerkiness evident. If this is important for you, this camera won't disappoint.This camera replaces a Panasonic Lumix ZS6, where this was not the case, not to mention poor low-light performance. The Sony is a big improvement in both these areas.This is not to say it's perfect. Dim light and movement sometimes result in blur, even in Auto+ mode. But perhaps 85% of the time it works fine. The 3-4 second delay after taking a shot in Auto+ is a tad annoying, though, especially when it fails to get you a clear picture. But the Plus/Gold mode can give amazing results in dim light, although watercolored.The pictures are very good, although the reds in some of them seem a little more vivid than I would expect. Pictures in dim light have a bit of noise and a watercolor effect on close inspection due to the smoothing of several images taken at once, but better than what you'd get without this system (or lugging around a much larger camera). Actually you may notice this in regular photos as well, but nothing too disturbing unless, perhaps, you print it in a really large format. Generally, it's intelligent auto mode is much better than what we've experienced on the Panasonic, which never seemed to know what was going on at all. It's usually enough to leave it in auto mode, unless you want to fool around with the different scene modes, which we don't.The Burst Mode is fantastic - 10 shots, and mostly clear, at full 18.2 megapixels.The Defocus feature is hit and miss. Although it tells you the distance needed, it sometimes fails even though you are at the correct distance. I may be doing something wrong to cause this, but of what I am still unaware.Haven't tried the 3D yet, since we don't have a 3D TV ... although the camera lets you view it on the LCD somewhow. Will update later.The display is large, clear and bright; no complaints here.The flash pops up on the top left. Something to get used to.You can't take pictures or video while it's charging.The camera feels ... plastic. There are strategically-placed, flat areas and grips for thumb and fingers, but overall it feels like a toy, although I like most of the styling. The dial is a nice touch, although it, too, feels like light, cheap plastic.They could have included a battery charger. Charging via the USB port on the bottom just looks and feels clunky. Luckily, spare battery and charger are under $30 here.The manual is short on detail, leaving you to the camera's Help system, which is decent.Otherwise, for the casual photographer (that's us), or someone who wants a good point-and-shoot, this camera takes what you want most of the time, with the option of really stable video.", "Date": "June 21, 2012"}, {"Title": "great pictures as long as you don't look to close", "Author": "s", "ReviewID": "R1CG0T1K8HG7JS", "Overall": "3.0", "Content": "if you plan on doing a lot of cropping or big printing the picture really falls to pieces. horrible artifacts. looks like a water color painting", "Date": "February 8, 2014"}, {"Title": "Took good pictures while it lasted", "Author": "TA", "ReviewID": "R2167M6DQSC7I4", "Overall": "1.0", "Content": "Bought this for a Christmas present in 2012, died in Sept 2013..... Typical of Sony, and only say thank God it happened a couple of months before the warranty ran out.UPDATE:Sony customer service is HORRIBLE refuses to fix the camera this will be the last sony purchase I ever make....", "Date": "November 5, 2013"}, {"Title": "Perfect for my needs", "Author": "Derrick K. Lee", "ReviewID": "R32H07X9B0PK4S", "Overall": "5.0", "Content": "I wanted a good camera that I would be able to bring into concerts.  This camera is small enough to fit in my pocket, and take takes great shots. The price was very reasonable, and I am extremely happy with my purchase.", "Date": "July 19, 2013"}, {"Title": "Camera has muscle", "Author": "Cliff Eubanks JR", "ReviewID": "R1E3ACPHKR6OUS", "Overall": "5.0", "Content": "The camera's zoom is very good ... outstanding. The options are more than enough to satisfy needs. pictures appear shape", "Date": "June 27, 2013"}, {"Title": "Great little camera", "Author": "Ben Elmore", "ReviewID": "R2RJ49SFEAFPTD", "Overall": "4.0", "Content": "I specifically love the sweep panorama feature; it's fascinating how seamless it stitches it all together. The zoom is also fantastic.", "Date": "June 6, 2013"}, {"Title": "Outstanding \"Point and Shoot\" Camera", "Author": "Mikey's Review \"Michael\"", "ReviewID": "R38CFOXQ783DKL", "Overall": "5.0", "Content": "This camera is amazing! \"Point and shoot\" says it all. Compact size, quick start-up, takes great pics in low light, fast action shots of our grandkids without motion blur, reasonable shutter lag delay time, solid feel, well built. Just set it to auto mode and shoot. No view finder but the 3 inch display is high resolution and very good outdoors - although I recommend an anti-glare screen protector for better visibility in the bright sun. And the 20x zoom lens is impressive on a camera this small.", "Date": "June 6, 2013"}, {"Title": "Should be better.", "Author": "kokou h. sewodor", "ReviewID": "R3IVHADEYIYDEM", "Overall": "4.0", "Content": "I really like the quality and the outcome of my pictures. the zoom is perfect. the only thing I do not like is the fact that the flash pop up, which is not convenient for me.", "Date": "June 5, 2013"}, {"Title": "Excellent", "Author": "Davey Krause", "ReviewID": "R10NAO9M5XPE2I", "Overall": "5.0", "Content": "Great camera, upgrade from DSC-HX9V. Delivered as promised! This product has been great for family photos, outdoor photos, and vacation pictures. Eventually I'll purchase a more robust DSLR, but this is a great beginning camera as well as a camera for experienced photographers. Great on the go", "Date": "June 5, 2013"}, {"Title": "Love it!", "Author": "Corie", "ReviewID": "R29YQA7BPLBQ4B", "Overall": "5.0", "Content": "I absolutely love this camera.  I have an 8 month old baby, and this camera is fast enough to capture his every move.  I had him in a swing, and while he was swinging back and forth I took many pictures of him that all came out perfectly clear.  I have owned many Nikons and I have to say that this is a way better camera for capturing life as it is happening.", "Date": "May 24, 2013"}, {"Title": "Great for travel", "Author": "Sergio Mondragon", "ReviewID": "R2BA7RN89IP52M", "Overall": "5.0", "Content": "I bought this camera for an Europe trip, the pictures were amazingly sharp, even in moving or low light condition, quick shutter response, had a lot of amenities, like 3D or panoramic pics, the zoom is awesome. Handy and fast response. Worth every penny.", "Date": "May 11, 2013"}, {"Title": "For a compact camera it has lots of good features", "Author": "Robert Stewart", "ReviewID": "R2ZCF3Z4624DZK", "Overall": "5.0", "Content": "The zoom is fanstastic. It takes really sharp photos throughout it's photo length capability....if you don't expect to use the max end of the telephoto at large pixel size reproduction images.  The battery has a good long charge life. The GPS location feature is a good one to have for vaction photos.  It fits in your pocket. It program controls camera shake to a large extent.  And a good feature over the previous HX9v, besides the added distance reach,  is that the on/off button is recessed by the camera body so you don't turn it on by accident as often sticking it into a carry case.A really amazingly good camera for the money.", "Date": "April 29, 2013"}, {"Title": "big zoom is fantastic outdoors, video is great, still image quality is OK", "Author": "l2", "ReviewID": "RS9916LDDOUJL", "Overall": "4.0", "Content": "This camera has a 20X optical zoom. If you really need a big zoom on a pocket sized camera for under $250, the Sony HX20V may be your best deal. A big zoom is really great for sports or wildlife photos in bright sunlight. When lighting is not ideal, however, then the long telephoto photos start getting blurry and/or grainy pretty quickly.If you're going to be taking photos primarily indoors with average lighting, then this is not a great camera for you. A big zoom is not going to be much use indoors. You're better off getting a camera with a small zoom and bigger image sensor, like the Sony RX100. The RX100 will give you significantly better indoor photos (more details and more accurate colors) than the HX20V.", "Date": "April 15, 2013"}, {"Title": "Awesome camera", "Author": "YouSayTomato", "ReviewID": "R1EEY770BUON4H", "Overall": "5.0", "Content": "This camera is a little larger than a regular 'compact camera'. It is still small enough to fit in a purse & go. Takes amazing pictures right out of the box. I bought a SD card with a 'speed' (not sure the correct terminology) of 10. This camera takes pictures so fast!! My son and his cousins don't hold still long for pictures when they are together ... I have been searching for a camera that takes pictures fast one right after the other and this one is the best! 18mp and 20x zoom...I totally RECOMMEND this camera!!", "Date": "April 15, 2013"}, {"Title": "New favorite Camera", "Author": "ReyR", "ReviewID": "R2NMEMGZB47IK8", "Overall": "5.0", "Content": "I used to own 3 Canon point and shoot cameras (the last was a Canon ELPH300) as I don't want to fiddle with many adjustments while taking instant photos. I was satisfied with the quality of the Canon photos until I saw the outputs of this camera. It definitely was sharper, faster and had excellent low light results.I agree with the con written about the flash placement as one naturally holds point and shoot camera with the hand fingers on the particular spot of where the flash is placed.", "Date": "April 1, 2013"}, {"Title": "Good for a PnS", "Author": "Ryan R.", "ReviewID": "R32ZG363HTQMVD", "Overall": "3.0", "Content": "Not to happy with the DPI output being less than 300 especially in this dan and age of the digital camera. Overall take a decent photograph and works well with the wife", "Date": "April 1, 2013"}, {"Title": "I Absolutely love this camera!", "Author": "Shawn", "ReviewID": "R35BAPWFMKZ8CX", "Overall": "5.0", "Content": "We just got back from a beautiful family vaction in sunny Orlando and this was by far the best camera I have ever owned. Clear pictures, powerful zoom, and best part is the Exmor R CMOS sensor/processor. My parents had met us in Orlando and my father had model similar to this but without the Exmor processor and it was a night and day difference. I could pick up great pictures in the amusement parks at night when he was unable to shoot anything. I highly recommend this camera.", "Date": "March 9, 2013"}, {"Title": "Great little camera", "Author": "Kjeep", "ReviewID": "RQ3JM95H73OYF", "Overall": "5.0", "Content": "This camera is just wonderful.  It takes clear, crisp pictures and is easy to carry along on motorcycle rides, etc. Great little camera!!", "Date": "March 7, 2013"}, {"Title": "Great camera.", "Author": "Marlene Mondragon", "ReviewID": "R2QBDAC5AMLT2G", "Overall": "5.0", "Content": "This camera has a lot of fun features.  I bought it a week before a three week sightseeing trip overseas.  It was easy to learn how to use and co-travelers kept borrowing it to take pictures.  One quirk is the flash placement.  It is directly where you naturally hold the camera.  You have to be aware before you take a picture of your fingers.  It could potentially break the camera.  I took over 2500 pictures in 3 weeks.  A good number of them came out under exposed, just slightly.  This is an easy fix on most free programs like Picassa.  The illustrator setting and the watercolor setting got left on a couple of times and in bright light you can't tell by looking at the camera it is on so we \"lost quite a few pictures when we were playing with the camera.  The 20X lens and tracking features are great.  This camera also took great pictures in low light, and much faster than the DSLs in our group.  It is such a fun camera.  The smart feature is very reliable and tracks well.  All in all with the group of 5 people with two novices, and 2 DSL camera people and one in between all were very satisfied with this camera.", "Date": "March 7, 2013"}, {"Title": "Perfeita, a melhor.", "Author": "Fabiano Moreira Peixoto Fortuna", "ReviewID": "RTYV6PFFJBD8W", "Overall": "5.0", "Content": "Boa entrega rápida e a melhor câmera do mundo a sony finalmente acertou. Pode comprar sem medo de ser feliz.", "Date": "February 28, 2013"}, {"Title": "Great Cam!", "Author": "Brian Jarboe", "ReviewID": "R2PZ7VWNBB23MC", "Overall": "5.0", "Content": "For a point and shoot what more could you want? Its small enough to fit in your pocket but takes great pictures, and the 20x zoom really comes in handy!, i took this to a concert and get really great video, and the Mic on the cam holds up very well, i take it to my band practices and shoot video and the sound doesn't clip or come out distorted, but if you do find it too be too loud there is an option to turn the mic down on the camera. Also if you've watched video's on youtube trying to decide how you like the video quality, I can tell you when you upload the videos to youtube, it does not do the camera justice, It degrades the video. You can hook this camera strait up to your PS3 if you wanted and watch all of your videos on your hi def tv and be amazed. Takes full landscape pictures, has background de focus capabilities, shoots well in low light, does great panorama, can do burst shots..... and even has manual controls for focus options. I want to say for a point and shoot that fits in your pocket, this is amazing.", "Date": "February 23, 2013"}, {"Title": "Very good every-day-carry camera; catch it on sale and it's a tremendous value", "Author": "Erin Thompson", "ReviewID": "R2QOYQXOJHBF41", "Overall": "4.0", "Content": "I purchased the Lumix FZ-150, and that is my \"workhorse\" camera (for extended shoots, shooting RAW, high speed capture, etc.). However I wanted a more pocketable option for carrying every day. The Sony HX20V fits the bill perfectly.I am still learning the fundamentals of classic photography, and I rely on the full manual options of the FZ-150 for that purpose. My use of the HX20V is for candid, street photography and casual, opportunistic snaps.Things I like:* a scene mode for every situation* very powerful full-auto mode* 20x optical zoom* 1080p video recording (and it's buttery smooth)* solid construction* long battery life* small size (while not being TOO small, and it has a substantial rubber grip that is extremely effective)* very good image quality (again, use the scene modes- they are very well programmed)* good looking cameraDislikes:* Pop up flash is aggravating. I keep it turned off by default, and when I need the flash, activate it.* Slight tendency to skew color scheme to yellow under low light conditionsI picked one up under Amazon's Warehouse Deals (in \"Like New\" condition), for $165. In my opinion this is an outright steal.If you need a case for it, consider the Sony LCSCSQ Soft Carrying Case:http://www.amazon.com/gp/product/B000MDZKUU/ref=oh_details_o06_s00_i00?ie=UTF8&psc;=1", "Date": "February 15, 2013"}, {"Title": "Excellent Value and Pics", "Author": "Stephen F. Potts", "ReviewID": "RCIUA6LQFCH", "Overall": "5.0", "Content": "We bought this for a family vacation after extensive research and it was awesome.  The picture clarity and zoom options worked fantastic.  Also for a small non SLR digital it was pretty fast.  Battery life was good and charging is very quick and easy.  This is the best small digital camera we have owned.  Highly recommended.", "Date": "January 17, 2013"}, {"Title": "Purchased a used camera at a good price.", "Author": "Kennyart", "ReviewID": "R3RKSML6R0FYC5", "Overall": "4.0", "Content": "So far this camera has lived up to my expectations. The carry strap was damaged but was easly replaced with one I already had. No original box or manual, but who needs that stuff when the manual is availble online and the box probably would have ended up in the trash anyway.Takes great photo's and video! The steady shot works well and the zoom is amazing. Low light indoor photo and video works great! Took lots of video during our Christmas gatherings.I am happy with this camera!", "Date": "January 3, 2013"}, {"Title": "nice", "Author": "Dell", "ReviewID": "R13ZYC1IHZAA3H", "Overall": "5.0", "Content": "I love it so far. Easy to use yet can do so much. Takes awhile to learn the features but time well spent. Only thing is the flash always seems to find my finger when it pops up.", "Date": "December 12, 2012"}, {"Title": "Best camera I've owned", "Author": "Nixon Mercidieu", "ReviewID": "R3AL5I3OX1VU36", "Overall": "4.0", "Content": "Can't argue with most reviewers here, this is the best camera that I've owned. Photos look great and videos amazing. I am quite happy with my purchase.", "Date": "November 18, 2012"}, {"Title": "Amazing.  Simply Amazing,", "Author": "Student", "ReviewID": "R268ZNUWFFK6B0", "Overall": "5.0", "Content": "I've had this camera for a few weeks and I. Love. It.  I immensely enjoy photography, and I purchased this camera because of its 20X optical zoom, the 18.2 megapixels, and because I wanted a good quality point-and-shoot.  My first time using it was at my high school musical.  Even in the low lighting it performed well.  I'll be taking this camera on my trip to Europe this spring, and I am confident it will be just what I need.I especially love the macro mode.", "Date": "November 12, 2012"}, {"Title": "Beautiful shots, fantastic zoom, great features, but slightly confusing interaction.", "Author": "W. Bison", "ReviewID": "R1VA78FQAVQ87P", "Overall": "5.0", "Content": "Let me start by saying that this camera takes beautiful photos.  Got back form a trip from Ireland and we couldn't decide between a lot of the shots taken between this and our DSLR.  In landscapes, we loved shots from this camera - color was so rich and the focus was incredibly sharp even when zooming in or printing out the images.  It was even responsible for taking the poster shot of the trip - quite literally, we've blown it up and printed b/c it was our favorite shot.Additionally, there are some really handy features that you can quickly access.  The tracking focus is m favorite - you put the object you want in focus in the center, hit the tracking button, and then can pan away from the object while the camera tracks it keeping it in perfect focus while letting you really get a great depth to you shot.Using this in addition with the \"defocus\" option lets you really take some DSLResque photos.  I'm sure a true pro could tell the difference, but my wife and I thought they really enhance the depth of field in a number of shots.  If you don't want to break the bank, but do want to start a food blog, this camera would be a great starting option for you food close-ups!I like the form factor a lot.  The build feels very solid, and can be confidently used to snap photos while only holding it in one hand.Moving onto the critical feedback, the user interface is very kludgy.  I had a canon point and shoot before this and I found it much more intuitive, maybe that is b/c these cameras have become so feature rich over the past few years, but I think a lot of the manual settings are difficult to update.  Fortunately, many of the automatic settings/modes can be tweaked enough to get the shot you want without having to dive too deep into the configuration.On extraneous feature is 3D - I have no 3D enabled products at my house so I can't say how good this can be, but I do look forward looking at the random shots I take in 3D with the hopes that one day, these will look awesome.  Fingers crossed.Bottom line, this is a great point and shoot with tons of zoom, it's very capable of capturing the moment, and delivers superb results.", "Date": "November 6, 2012"}, {"Title": "Fantastic Product", "Author": "Richard H", "ReviewID": "R18V8UYLSL6UM6", "Overall": "5.0", "Content": "Gosh what can I say about this camera that hasn't already been said. The photo's are great for a point and shoot and the HD video is fantastic...even on a 55 inch screen. The software that comes with it is really good for downloading photos and video to your computer and is excellent for combining clips into one video. I'm extremly pleased with this fantastic little camera.", "Date": "October 30, 2012"}, {"Title": "sony has a winner", "Author": "Lizzy P \"Lizz\"", "ReviewID": "RA4CDOZEXDSJ8", "Overall": "5.0", "Content": "Takes great pictures of fast moving objects like pets and stills.  Lots of fun features. Fast to start and takes amazing video.", "Date": "October 10, 2012"}, {"Title": "Better than expected", "Author": "Denver", "ReviewID": "R35OZ9ZX881X97", "Overall": "5.0", "Content": "I debated between this camera and a few point and shoot 20x zoom canons, ultimately chose the 20x, instead of 30x as setting up a wireless network from my camera and then logging on via smart phone or computer seemed to cumbersome compared to uploading directly to drop-box.  Anyway, the pics have been amazing, from up close macros to portraits and landscapes.  Very happy with the purchase and price has come down significantly in the past 3-4 months since the new Sony and Canon models are out for the year.  It is a bit large to put in your pocket but doable.", "Date": "October 8, 2012"}, {"Title": "Great camera", "Author": "Me", "ReviewID": "R1UUIUJMO5ZRC0", "Overall": "5.0", "Content": "This was a gift for our daughter. From everything we've heard from her, she is well pleased with the camera. Great pictures, great video. I think we made a great pick. This is the 3rd Sony camera that we have purched over the years. All are still working and have not had any trouble with any of them.", "Date": "September 29, 2012"}, {"Title": "Nice size and Feature set", "Author": "Just the Facts", "ReviewID": "R1SIHRA6MU3SUH", "Overall": "4.0", "Content": "Recently purchased as a gift for my wife (generally a point and shoot user) to replace an older digital camera with 14x zoom.  Shortly after buying we took a vacation that included wildlife viewing, as a result we were able to put the camera through its paces. Dead simple, with great quality, to use in auto mode.  In absence of an optical view finder, she was able to adjust using the LCD just fine. LCD screen was bright enough in sunny conditions. One of the biggest advantages of the new camera is it overall size, very compact given its zoom capabilities.  As other users have commented the flash is not in a optimal spot. However, given the size and weight of the camera it is not too hard to adjust your hand position when needed. Purchased a 64GB (class 10) SD card from a local retailer, camera response time was good. Battery held up for each days shooting, though did purchase a 2nd after market battery for around $10. In general I would say that my picture's usually turn out better than my wife's. Now that she has the Soncy HX20V I would not say that is the case. Color depth in her pictures is noticeable often, but particularly when the lighting conditions are a more challenging. Very nice that they have loaded in the user manual into memory, handy when you want to look up a feature you use infrequently. When the budget allows we will most likely be buying a second one.  Held back giving five stars becase of the need to purchase 1) the HDMI cable if you want to hook to a TV (like to do at the hotel in the evening) 2) External battery charger.  Not too hard to rectify,  Found a HDMI to HDMI-mini converter for around three bucks. Already have a retractable HDMI cable that was purchased for road trips.As of 09/12 Amazon's price blows everyone else out of the water.", "Date": "September 21, 2012"}, {"Title": "Sony Cyber-shot", "Author": "Basil MacDougal", "ReviewID": "R166TXF43D1N5M", "Overall": "5.0", "Content": "I was blown-away by the quality of photos that come out of the Sony Cyber-shot!  It seems like I can't hardly take a bad picture anymore.  I've always owned the middle to lower end kind of cameras, pretty basic features, lower mp's, and fairly automatic.  So, if you compare the Sony with some of my older cameras, you notice quite a difference.  I sure have.  It is so simple to begin using that I didn't even have to look at the manual first.  You choose a setting (portrait, auto, landscape, etc) and start taking pictures.  It's that simple.I've recently got a higher-end camera and it is fantastic!  The only problem with it, is that it is too big to take with me.  It is large and has a big lense.  So, I take the Sony Cyber-shot with me if I'm going to be doing a lot of walking around such as amusement parks, zoo, and things like that.  The size is perfect so you can just wear hook it too a landyard or just stick it in your pocket.With the higher mp, I also don't have to worry anymore about zooming in or getting up close to my shot.  I can always photoshop later and get some excellent, clear photos.  I recently saw The Beach Boys in concert.  I was about 50 yards from the stage and I took about a hundred photos that night.  Later, I cropped the pictures and posted them on facebook--They looked like I was right up on stage with the band.  I was impressed and so were many of those I shared them with.This is a great camera, and I'm proud to be the owner of one.", "Date": "September 20, 2012"}, {"Title": "Great Video, Solid Camera Not Without Some Flaws", "Author": "J. Gebauer", "ReviewID": "R116JL3WYMBDGP", "Overall": "4.0", "Content": "I was looking at replacing my Canon 300HS which was less than 1 1/2 years old with something that had more zoom and better video. Looking at travel zoom cameras the 4 main choices are the Sony HX20V, Canon SX260HS, Panasonic ZS20, and Nikon S9300. Due to the mediocre reviews of the Nikon by customers and camera review sites I immediately throw that one out. Looking at sample images in spite of having lesser megapixels the Canon seemed to produce the best images of the travel zoom cameras whereas the Sony was raved about for its video quality. The Panasonic seemed somewhere between the two.IMAGE QUALITY & CANON COMPARISON:The CCD in the Canon SX260HS is basically the same as the one in my 300HS. The SX260HS has a slightly newer processor than the 300HS. I felt pretty confident in what to expect image quality wise from the SX260HS. I was a bit nervous about purchasing the Sony because in spite of having the most megapixels it seemed to produce the worst images of the three cameras. I read many reviews where people used the words \"watercolor effect\" and \"artifacts\" when viewing an image from the HX20V at 100%. Looking at sample images it was clear to me that the CCD/lens from the Sony absolutely could produce quality images at 18MP. This 18MP chip is a new chip from Sony and I'm sure they were aware of the issue. Too often manufacturers use high MP's instead of actual image quality to sell cameras. Managing a camera shop for years I've been very aware of this.Seeing images from the HX20V another thing was clear to me. To compensate for the poor image quality, the processer in the Sony is sharpening the images way beyond what it should in order to try and give the poor resolution the effect of sharpness. This is actually creating a large amount of the artifacts in the images and heightens the watercolor effect. Before purchasing the camera I made sure it had a sharpness adjustment. I tested my theory with the camera by adjusting the sharpening in the camera. When you go from low to standard to high sharpening, you can see the artifacts and watercolor effect get worse and worse. This is even visible in camera when zooming in all the way to an image in playback. To be clear, no sharp resolution is gained by increasing the sharpness in camera, the lines actually look more jagged and the images look splotchier. I would advise anyone using this camera to turn the turn the sharpening to low when photographing. This option is available in the P and M modes.Because video quality was important to me I decided to go with the Sony HX20V. I have been very happy with my decision. Knowing that the Sony couldn't produce sharp images at 18MP, I did image test comparisons between the 12MP Canon 300HS and the Sony HX20V just to see how much sharp resolution the Sony could produce compared to the Canon. At 12MP the images from the Canon are starting to get soft. The HX20V at 100% as I stated earlier look very poor: \"watercolor effect\". Downsizing the resolution of the Sony's images to 12MP (4000x3000) they look on par to the Canon's. Some areas of the frame look better on the Sony while others better on the Canon. Because of this I really feel that Sony should have made the camera 12MP instead of 18MP. Increasing the resolution of the HX20V's images from 12MP does nothing but create larger files, no sharp resolution is actually gained. I wish there was a 12MP option in the HX20V. If there was I'd only shoot only in it. There is a 10MP option and from the shots I've taken there is only a minimal amount sharp resolution gained from shooting at 18MP vs 10MP. I'm primarily a DSLR shooter so for me a decent 12MP image is all I need from a P&S; so the Sony's image quality is good enough. I will mention that the colors from the Canon in the standard shooting mode looked better than those from the Sony which look muted in the standard shooting mode. From that standpoint I do feel that the Canon's images are better.VIDEO QUALITY & CANON COMPARISON:As I mentioned before video quality was important to me. The 1080p 60fps videos from the Sony look nothing short of spectacular. When comparing them to the 1080p 24fps videos from the Canon 300HS, which would be comparable to the Canon SX260HS 1080p videos at 24fps, it completely blows them away. The video resolution from the Sony HX20V looks crisper. Panning movements and action in the Sony's video look very smooth unlike the choppy look of the Canon because it captures videos at 24fps. Additionally, the video quality from the Sony in lower light blows away the Canon. My guess is that SX260HS performs better in low light than the 300HS but I'd be surprised if it was able to match the Sony. I've read some people complaining about the video quality from the Sony in low light when comparing the HX20V videos to camcorder videos in low light. This really isn't a fair comparison. It's like comparing the image quality to DSLR cameras. In P&S; cameras the video from Sony is as good as I've seen.STABILIZATION:The stabilization in the Sony is top notch. I've shot images zoomed in all the way, 500mm equivalent, indoors at 100 ISO and had usable images in the end which blew me away. The HX20V has a very snappy autofocus also. The focus speed is as quick as I've seen in a P&S.; It's extremely impressive for a travel zoom camera. The focus speed leaves the Panasonic ZS20, which I've played with, in the dust and is much faster than the Canon 300HS. The speed difference is most notable at the extreme telephoto. Switching focus on something from 70 feet away to 20 feet away at the extreme telephoto is as quick as a prosumer DSLR. To me the snappy focus speed outweighs whatever sharp resolution and color difference there is between the Sony and Canon or Panasonic. Neither resolution or color matter if the picture taken isn't what you wanted to take because the camera is so slow to respond.OPTICAL ZOOM:The 20x optical zoom is great to have. Having the zoom is a big improvement over the 5x optical zoom with the Canon 300HS. When you get to 15x-20x zoom with the Sony (the extreme telephoto of the lens) the image quality falls off even further. From what I've shot I'd say you only have sharp resolution equivalent to 7MP when shooting at 20x zoom. It is a far cry from the 18MP the camera shoots. It is something definitely to be aware of before purchase the camera. Image quality fall off is pretty typical of travel zoom P&S; and even travel zoom DSLR lenses but I was surprised at how far the image quality fell off with the HX20V.OTHER THOUGHTS:Besides the resolution my only other gripe with the camera is that it doesn't come with an external battery charger; you have to plug the camera in to a wall or computer to charge the removable battery in the camera. I found it a poor selling point that a camera like this forces you purchase an external battery charger; that you can't be out shooting and charging a battery at the same time. To make it worse the adapter cable for charging plugs in to the bottom of the camera. Overall, poorly thought through.SUMMARY:All and all the Sony was the best choice for me and didn't disappoint with its video quality. Again I feel that it should have made 12MP instead of 18MP. No sharp resolution quality is gained by it being 18MP. If image quality out of the camera is the #1 and only concern the Canon SX260HS may be a better choice. For a better balanced camera that has great stabilization, very fast autofocus, and amazing videos with a good amount of zoom, this is the one to get.", "Date": "August 28, 2012"}, {"Title": "The best Cybershot (small sensor) yet...", "Author": "Yogi Moore \"YogiM\"", "ReviewID": "R2223D162DKB25", "Overall": "5.0", "Content": "I must have owned nearly Cybershot so far, replaced the HX9 with the HX20V (didn't need the wifi in the 30v's...). Bought the HX20v together with the same-size RX100.Two very different beasts. Bottom line, loved the 20v handling more than the (much more) expensive RX100. The RX100 had its share of faults, although low-light sensitivity was not one of them!In good light, the 20X zoom wins every time for fun and utility (cropping, etc). Even the HHT (low-light image averaging) was good enough to appear as good as the RX100 except in very low light.Wish I could bounce the HX20v flash, however...d'oh, and wish the battery was better (and for once, maybe Sony could use similar batteries for similar cameras....???)As things said, I love most aspects of the HX20v, it just feels right.", "Date": "August 20, 2012"}, {"Title": "Digital Camera", "Author": "Russell J. Pendred", "ReviewID": "R2JU6EU0I9LUMU", "Overall": "5.0", "Content": "This camera is by far the best Sony small size camera I have ever used.  I am a very serious photographer but I use this more than my expensive equipment.  The lens is excellent and the performance is outstanding.", "Date": "March 24, 2013"}, {"Title": "Amazing little camera", "Author": "Ms. T", "ReviewID": "RE3ZNK1GX27OT", "Overall": "5.0", "Content": "I confess, I'm one of those that quit using stand alone cameras, saying to myself that my smartphone took adequate pictures and was always with me so why drag another camera along.  This little Sony changed my mind, it's small enought to just drop it in my purse and I love the 20x zoom capability in a small little point and shoot camera.  This can even take pictures that mimic a DSLR (focusing on the foreground and blurring the background, I've tried it and it works awesome) by choosing the scene Soft Snap.  On full auto, it's practically impossible to take a bad picture - even at higher zoom levels where my Kodak would have problems focusing and stabilizing.  Image stabilization is superb as well as the autofocus.  I've taken over 200 pictures and not one of them was a bad shot - I think it'd be pretty hard to take a bad picture (or even a mediocre picture) with this little camera.  The only thing that takes a little getting used to is that the flash pops up right where you would normally be holding it with your left hand, but after a few times I learned to move my finger slightly so as not to block the pop up flash.  Video recording is also flawless and great quality.  I also really like that it plugs in via micro usb so I can use the same cable/charger as my smartphone, tablets, etc. and it also charges it's battery via usb.  I really can't say enough good things about this little camera.", "Date": "September 6, 2012"}, {"Title": "good product", "Author": "JoK", "ReviewID": "R80PWDTFFBP9J", "Overall": "5.0", "Content": "Just got this a day ago and it took some great pics at the ball game. Fireworks pictures came out awesome just using the fireworks setting, didn't have to change to manual. Pictures are nice & clear, even the action shots.Was able to charge it up and use it the same night in about 2-hours. User friendly...didn't have to read the whole book. If you're familiar with cameras at all, you will be able to use this one easily.Grip is good, you can hold it with one hand. Only thing I had to adjust to (and they all seem to have this now) is that the flash pops up right where you tend to hold the camera.", "Date": "May 22, 2012"}, {"Title": "Sony Cyber-shot DSC-HX20V 18.2 MP", "Author": "M. Kelly \"Life is a Cabernet\"", "ReviewID": "R3A3OR3L9TV9U1", "Overall": "4.0", "Content": "Received the Sony Cybershot as part of the Vine program. I guess I am slightly disappointed with appearance of the camera as compared with the listed price (close to $400). I guess for a camera of this price I would have expected a body casing which does not appear as a cheap lightweight plastic and I also would have preferred a view finder (so difficult to take quality shots when in strong sunlight using the LEC display). That being said, the camera does take wonderful quality HD pictures and video (and I absolutely love the way I can take still pictures while using the video feature). The 20x optical zoom and stability features allow me to take wonderfully focused clear pictures. As I mentioned previously, the camera is very lightweight and compact for carrying (although I still feel the casing appears very cheaply made). Features for uploading and editing pictures on line are included and are easy to follow. I feel the features and quality of this camera are exceptional, however, I am not sure if it is worth the cost (I had a $200 Cybershot last year that seems to take pictures almost of the same quality however, not with the same zoom capabilities).", "Date": "June 6, 2012"}, {"Title": "Uses only Sony Brand Batteries", "Author": "mrhst", "ReviewID": "R2SUIWNFO8K3AS", "Overall": "3.0", "Content": "Lots of features....takes some time to navigate the features but not difficult. They should warn anyone considering an upgrade to this camera who has non Sony G batteries. They will not work on this camera. The camera may start and allow you to shoot a few photos, but the camera shuts off with a warning on the screen informing you only to use SONY batteries. I would not have made this purchase if I knew in advance.", "Date": "December 4, 2012"}, {"Title": "I really wanted to like this camera but...", "Author": "F.T.S.", "ReviewID": "R17R1LBLTEHLKA", "Overall": "2.0", "Content": "After a week of playing with this camera, I'm sending it back.  I've had tons of experiences with cameras of all kinds, both digital and film, but I hardly got any decent pictures out of this camera.  The pictures always came out dull, grainy or dark, even with playing with all kinds of settings. Perhaps I got a defective one, but I have decided to go with another camera so I won't be exchanging it.", "Date": "April 28, 2013"}, {"Title": "Sony Cyber shot", "Author": "N Peter", "ReviewID": "RT6Z9QU42YO6W", "Overall": "3.0", "Content": "I got this camera to replace and older Sony Cyber shot I had. I knew about the flash pop up but did not realize it would be such an issue when using the camera. I find myself holding it one handed with my right hand and that in turn has my palm hitting the button to turn on/off the flash. Also puts a display up on the screen I don't want. The pictures are good. Night pictures were terrible. Found myself trying to switch settings constantly to get a better picture. I am used to a view finder and found it very difficult to take pictures in the bright light. Took pictures hoping it was focusing! This camera was used for a trip to Hawaii. My daughter also got Sony Cyber shot DSC-WX150. Not near the functions but her pictures were much better than this camera! I have passed the point of returning it, so hopefully with practice MAYBE I will figure out bright light and nighttime pictures. Forget about the Fireworks function. May go back to my old Cyber shot.", "Date": "February 1, 2013"}, {"Title": "Great small camera", "Author": "G. Thompson", "ReviewID": "R36QK6ZBGYNBFD", "Overall": "5.0", "Content": "It took a while to find a camera that I can use in place of my DSLR (Nikon D300S) so I could still get great shots but without the backpack full of gear.Now, this is not a DSLR, and, dspite what the commercials show, there's not a point & shoot that can completely equal or replace one. Yet. For now, this one's close enough for me.I shoot for the local paper and one thing this camera needed to do was to give me good enough shots in a lot of different conditions that would work for the paper. I like to have a camera with me at all times, but have gotten tired of carrying my full backpack everywhere.I am also a \"serious amatuer,\" in that I enjoy bringing back great photos of places I've been and things I've seen.So - check on both of those counts.The camera itself:It's small, but solid. I can fit it in a back pocket or jacket easily. Controls are straight forward enough that I haven't needed to consult a manual. After the first few uses, I did turn off the on screen guide, which got a little bothersome. And, overall, it's easy to find items on the menu.The photos:The real reason to buy a camera...I continue to be impressed with the photos I'm getting out of the Sony. I've shot inside, outside, action, etc. Just about every type of situation I would normally do with the Nikon.Picture quality is great. And the 20x zoom has been excellent to use in a few situations. The zoom isn't very fast (which is good) and it's not as precise as a manual zoom (no surprise), but that 20x optical is great to have. The \"Clear Image\" zoom seems to do just fine, though I haven't really pushed that one.The 10 frames/second mode is just that, and has been great to have ina couple of situations, like getting a full series of shots of a fire breather at a festival. One caveat, though, is the camera takes several seconds to process those 10 shots, rendering it useless for more shots until it's done. So plan ahead on when to push the shutter release.Surprises:All good, I assure you.I didnt' buy the Sony because of any of the various \"modes.\" The panoramic sweep mode sounded interesting, and I thought I might use that once or twice. Wrong. The panoramic sweep has been a great addition to how I shoot. I've used it to get great indoor shots that would have been too wide otherwise. And shots at a festival done with the panoramic sweep look great. I'm actually looking for reasons to shoot more panoramics.The other modes are also useful. I especially like the \"Toy\" mode, that gives a nice vignetting around the edges and richer colors.The \"Paint\" or HDR mode gives that cool HDR effect, but even on the light setting, I thought it was a little heavy handed. (Another caveat - the camera again takes several seconds to process any of the mode shots.)Tip:I have found the best results, and easiest way to control the camera settings, by setting it to \"P,\" which leaves the most menu options open with the touch of a few buttons. But if you leave the camera on one of the automatic settings, it works well, too.For the size, and for the 20x zoom, the Sony HX20V is exactly what I want with me now whenever I don't want to lug around 30-pounds of gear, but still want the great shots I'm used to.A gallery of shots done with the Sony (most with little or no post editing):[...]Check out more photos on Flickr to get a good indication of what this camera can do. Then buy one.Update:Just took both my DSLR and the Sony HX20V to a concert and shot with both. I'm actually happier with the shots from the Sony. Better, more consistent focus. Better exposure (I set it to P and center weight on the Auto Exposure). I put it in 10 fps mode and can pick out the best shot from each group.I'm happier and happier with this camera the more I use it.", "Date": "August 27, 2012"}, {"Title": "EXCELLENT IMAGE QUALITY. READ ABOUT ZOOM:", "Author": "Stephen", "ReviewID": "R2PU0W1025DPVP", "Overall": "5.0", "Content": "I am very impressed with this camera. The results I have seen so far on the computer are stunning. When previewing the images on windows photo view, the image is so large that you actually have to slightly zoom in to see and appreciate the sharpness of the lens. When I first downloaded and looked at sample images I wasnt seeing the sharpness of this lens. Then I realized that the file size was huge, and zoomed in just a little on windows image viewer. It made a world of difference, the sharpness instantly came forward. 18 mp is huge size for a compact point and shoot with a small sensor. But technology is improving. The watercolor mode is a lot of fun as well, and the video quality is the best Ive seen on a point and shoot. To be honest, Ive never really been a big fan of Sony cameras. Canon has and continues to produce some amazing point and shoots. There were two cameras I was looking at after more than a week of searching: The Canon sx260, and this Sony. I bought them both figuring id give them both a good three day test run. I was imressed with the canon, but not nearly as impressed as I was with this Sony. I found the sx260 to be overexposed, in many shots. I used the same setting on program mode, and manuel mode of the same framed shots on both a tripod, and handheld. The sky was often washed out and took on a white look with the canon, (something that can happen pariticulary more often with any point and shoot if your not careful)..but this camera it happened a lot less than any of the canons Ive used in the past...which is indicative that Sony is getting it more right when it comes to exposure.20x optical zoom: Theres something that Im not sure if a lot of people realize yet about the zoom on this camera. Its 20x zoom in the 18mp mode. But, if you turn the size of your image down to 10 megapixles, you are able to get 26x zoom range without distortion (it says this on sonys website even though I couldnt find this in the manuel).Regarding the zoom:  After having used the camera for a while now, I will say one thing about the zoom, (And in light of the nature of point and shoots, I dont see this as a con): On a mid day with plenty of sun at 20x, the camera can't capture the same hand held sharp image you would see at 15x or under. The reason I dont see this as a con because this is a compact digital camera. Your dealing with a smaller lens than what you would see on a digital SLR.  So because of that, the camera (and any other camera with this size with a 20x (560mm eqivilant zoom),  cannot let in as much light on the longer focal lengths. If you look at the front of any of these cameras, and zoom to 20x while looking at the lens, you will notice the that the iris of lens widens.  This is to allow more light in at your longer focal lengths.  Yet the reality remains for any of these compact point and shoots, the amount of light that they can let in in comparison to a digital SLR with a larger lens, is small in comparison.  But that said, this camera faired well, particularly on a sunny day whehre I could successfull zoom in and still maintiain good sharpness up to 15x.  After that, I would want a tripod. While I was initially tempted to state that 20x on any point and shoot is simply marketing, I cant say this because if you do have a tripod, you will still be able to capture some good shots at 20x. Basically, your covering 560mm on something which allows in much less light than any digital SLR lens.  Thats great under 15x. 20x is great too, and you will still be able to capture great images, you'll just want a tripod, because this isnt a $700.00+ lens (which is what you would pay for a digital SLR lens that can reach 560mm). I simply cant mark the camera down for this though, because having the option of being able to go 20x is nice, and image stabalization does work very well. But even with image stabalization, your lens itself simply cant let in as much light.  This goes for any of these +16x point and shoots.  If you really need zoom beyond 15x and want consistant results, consider one of the crossover cameras (the non SLR which have the same body as an SLR.  Those will get you better zoom, but to be honest its really hard to complain about something that fits in your pocket can be handheld, and take good pictures at 360mm eqivlant without a tripod.  A 300mm lens on any DSLR will cost you at least 300 dollars for brand name lenses like nikon or canon. So this is a great camera for zoom.Resolution: 18 mp.... You can print 16x20 sized pictures with something that fits in the palm of your hand. Its hard to complain about that especially when the photo results are quite impressive for a point and shoot camera.The colors: The colors are great in every shot I've taken. The CMOS senor really helps out a lot in terms of speed.In conclusion, I would rate this an excellent camera. I spent the last week going over camera after camera, review after review, picture sample after picture sample. In the end it came down to a choice between Sony's HX1, this Sony HX30v (or 20v without the gps), and canon's sx260. Every shot I took with the canon in the exact same environments turned out overexposed pictures in comparison to this Sony. This Sony was faster, did better with video, did just as well with color, and had an amazing screen. So it then came down to a choice between the Sony HX1 and this camera. The HX1 was in its day a 500+ dollar mega-zoom. It body looks quite similar to a DSLR. That camera has a sharp lens...but there are two principle things which made this Sony stand out. 1. SIZE of camera body. 2. PRINT SIZE... Having something that takes great photos with a 16 mp setting that allows you to zoom to 20x distortion free, and a 10mp setting which lets you have a 26x distortion free provides versatility. You can print a great 8x10 or 11x17 on a 10 mp setting. Ive done it, and the printed photo looked outstanding on my canon 9000 mark ii pro printer. My one last comment is to not judge the sample images for this camera by what opens in windows viewer. Its a large image file, so zooming in slightly will bring forward the sharpness of this lens, which is quite impressive.", "Date": "August 27, 2012"}, {"Title": "The best compact I've used (updated).", "Author": "e6bwhiz \"e6bwhiz\"", "ReviewID": "R275QSITG5EL9X", "Overall": "5.0", "Content": "For the past 15 years I have only used compact cameras.  Some a little smaller or bigger, but I haven't used a full size SLR in a while.  I've seen a lot of photos from DSLRs from friends though.  I've purchased and used models from Olympus, Canon, Samsung and Sony.  I have to say this camera takes the most impressive photos from a compact camera I've seen.  Maybe some of the most impressive of any camera.  The video is why I bought it and I am not disappointed.  Others have gone into details, but if you are interested in a compact camera that can do great video, I would have a hard time imagining something better.  I love the video.  Especially during outside daylight recording, it is like I'm looking into a window of reality.  The only thing I can see really improving on is the blurring effect when you pan the camera quickly.  It's not anything you wouldn't get in any other camera, but it is something that could be improved.  I record at the highest quality settings with all the stabilization activated.  Still, for what it is (compact camera), it is worthy of 5 stars.  My wife is using the Sony WX150 and it is not much different.  I would say if small size is paramount, get the WX150.  Otherwise get this camera.  This is only the second time I've ever given something 5 stars.  One footnote:  Be careful with it as it is delicate and I feel if any dirt gets in it or if it is handled without care, it may malfunction.*Update:  I had to send in the first one for a replacement.  The lens stopped retracting when turning it off sometimes.  The new one is working fine though.  Still love it.  Three other things I wish Sony would have different:  1.  I don't remove the photos off the card every day.  I wait a while and transfer to my computer every so often.  But when you go to delete the photos from the memory card there is no option to delete everything.  The best it has is to delete all photos on a single day.  Really annoying.  2.  The wrist strap doesn't have a movable clasp so you are unable to tighten it around your wrist.  Really makes the strap pointless.  I'm using an Olympus wrist strap I ordered online.  Sony, you don't want me advertising other brands?  Stop using stupid wrist straps.  3.  The highest quality video is saved with Sony AVC format.  Sony, why do you always have to be different?  I want a nice, high-quality, universally loved compressed file format.  How about a nice h264 mp4 or mkv file, hmm??  I'm not burning blue-ray discs.  I don't want to dig through tons of menus to get to this file on the memory card.  You finally caved on the memory stick issue.  I would have never bought this camera if I couldn't use my extreme SD cards.  At the end of the day I still love the camera.  I guess my complaints warrant a half star deduction.", "Date": "July 10, 2012"}, {"Title": "Sony has solved the telephoto, resolution problem", "Author": "Carl23", "ReviewID": "R3VE33BDTUJ23A", "Overall": "5.0", "Content": "All my life, I have had to buy 2 separate cameras.... One for video, one for stills. I bought my last video camera about 5 years ago...a Sony DCR HC36. The last camera I bought was a 16MP, 5X zoom, but it came up short in the telephoto range, especially at theaters. This new camera with 20X zoom finally has gotten me out of the video camera arena. I especially like the carry-in-your-pocket feature which allows for a quick-draw point and shoot. . I was looking at the 30X, 18.2MP camera, but sorry to say, it doesnt fit in my shirt pocket. Now, if Sony provided an accessory X2 snap-on lense to this camers, I would be in hog-heaven.Bt the way, where does Amazon get its dimensions from???The sony spec sheet shows 4 1/4 X 2 1/2 X 1Amazon shows 6.1 X 5 X 2 . <<<<must be the size of the box it comes in?", "Date": "July 9, 2012"}, {"Title": "Fantastic", "Author": "Charles R. Carey \"Chaz C\"", "ReviewID": "R2HORHTKD0SWIN", "Overall": "5.0", "Content": "This is absolutely a fantastic camera.  I studied reviews for several days and decided on this camera.  I've had it for a couple of months and have yet to take a poor picture with it.  My grand daughter, who is a amateur photographer, used it, and liked it better than her more expensive camera.I've only scratched the surface in learning the features but, don't know how I could be more satisfied.  I hope it will last for a long time.Pops in Aurora MOSince my original Review I like the camera even better.  You just can't take a bad picture.  Took it to a Cardinal minor league game and froze a pitched ball in mid flight every time.  Takes good pictures in low light without flash.Truly a fantastic cameraPOPs", "Date": "July 2, 2012"}, {"Title": "Not Bad for the Price but Canon Powershot SX700 HS Better", "Author": "MC", "ReviewID": "R2E1THQK71USIC", "Overall": "4.0", "Content": "I dropped my Canon Powershot S80 & got this to replace it.  I was looking for the widest (24-25 mm) with good zoom in a compact camera.  However, I'm not a \"true' camera person & don't want to do my own settings mostly.  (The Canon Powershot SX50 hs got the best reviews but at 19.4 oz, I just can't live with that big/heavy a camera.)Note:  I first tried the Panasonic LUMIX DMC-ZS19.  Although it has a lot of neat features, it didn't deliver on true color quality, especially indoors, moving or fairly still pets, or outdoors in my rose garden (which was surprising, since it did much better on closeups of the roses).  Also the exposure looks fine on the screen but when seen on viewer/computer, it's a bit too dark.  Then my sister, who happened to buy the same camera without my knowing started having problems with the zoom & the camera'd stop working.  Which after reading later reviews, happened to many people, so I do NOT recommend this camera.Then I tried a \"like-new\" Sony Cyber-shot DSC-HX20V,  The colors indoors are much better than the Lumix, but the same outdoor garden rose's color still did NOT look true to life, rats!  Also the control dial especially & other parts of the camera seemed cheap/flimsy for an otherwise good camera.  For the price, it wasn't a bad camera & it had some neat options/effects & panorama, but I wasn't totally satisfied with the color/pics, so I went back to Canon.(Note:  Canon Powershot SX700 HS color is slight-moderately better than Sony Cybershot.  Low light is still a bit of a problem (on all the cameras), but there's one fairly simple fix, \"Live\" option on the dial, where you can make adjustments for 3 things - light/vividness of color/cool vs warm color.  (The \"low light\" option on the SCN/Scene mode only is helpful in seriously low light.)  I do miss having a panoramic option, but I find I tend to do a movie in that case anyway.  The camera body is solid/well constructed.  You do have to use a button to pop up the flash when prompted, but it does save on battery life.  Overall, has the best pictures so far.  Canon take note:  I'd love a camera with Less options for those of us who just want to stick mostly to Auto but better low light photos & a panorama option.)(Last Note:  I also considered its major competitor, Nikon Coolpix S9700, supposedly got better reviews on picture quality esp low light, but too many negative reviews on the flash breaking & other glitches/problems made me shy away.)", "Date": "May 26, 2014"}, {"Title": "Sony does it again", "Author": "jskim", "ReviewID": "RNIXO7ZWSNOQK", "Overall": "4.0", "Content": "Great picture with all the bells and whistles for control. Actually too much for a novice. But if you know what you need, you definitely can tweak it for a fantastic picture. Great pictures straight out of the camera. Video is not too bad. Only thing I am not fan of the the placement of the flash. Little awkward and not ergonomically designed, Otherwise, I recommend it especially if you can get a deal.", "Date": "May 25, 2014"}, {"Title": "I love love love lovemy camera ! I use it all the time. I tote it in my handbag everywhere I go.", "Author": "Darla J Pair", "ReviewID": "R1S2S4UGWU47J0", "Overall": "5.0", "Content": "I love love love lovemy camera ! I use it all the time. I tote it in my handbag everywhere I go.", "Date": "May 22, 2014"}, {"Title": "LOVE this camera", "Author": "C.Snow \"usmcjsnow\"", "ReviewID": "R2VVWDN0IJA0VP", "Overall": "5.0", "Content": "I have had this camera for about two years now, and it is wonderful. It's small and lightweight, so it doesn't look intimidatingly huge like the cameras with foot-long lenses, but it takes amazing photos with great zoom. One of my favorite features is the ability to take photos while videoing a scene. Perfect for recitals, sporting events, graduations. I have tried out all of the modes available, and it is truly one of the best buys I have ever made. It's held up well, with only a couple of minor scratches on the LCD screen to show it's not brand new (my fault for not protecting it better from sand at the beach!). If you buy this camera, you won't be sorry.", "Date": "May 16, 2014"}, {"Title": "OK Product", "Author": "TSA-ORD", "ReviewID": "R2TGTUGNYS2NG9", "Overall": "3.0", "Content": "I upgraded to the HX20V from the HX9V.  Many other reviewers have written plenty on the model so I would only say one thing:  The biggest issue I have is that this one is also slow in processing and the wait is frustrating when good shots have been missed time and again. Not to mention under strong sunlight you could not see anything with the 3\" screen. This is a common issue with all the point-n-shoot cameras without a good old view finder.", "Date": "April 25, 2014"}, {"Title": "Great Sony Camera for the back packer", "Author": "Gafradu", "ReviewID": "R97XIXS1P9E1Y", "Overall": "4.0", "Content": "An excellent pocket camera. A viewfinder would be 5+ stars for sure. Bought used so I could save money toward purchase of RX1.", "Date": "April 21, 2014"}, {"Title": "Nice point and shoot with high resolution images", "Author": "David Argent", "ReviewID": "R3RRIR8CJK2ONQ", "Overall": "4.0", "Content": "This is our first Sony camera.  I read other reviews and thought given the features this one offeres we would give it a try.  Thus far we are very happy with the camera.  It offers a lot of idiot-proof options.  The one thing I wish all cameras came with was a cheat sheet to find the features though.  The tech manual that came with the camera stinks.  I had to go to Sony's page to find the real one.  Also, if you are like me, you tend hold the camera with both hands.  Watch your left index finger....you may inadvertenly hold the auto flash down.  Not sure why this isnt just on the front of the camera like it is on Nikons and Canons.", "Date": "April 20, 2014"}, {"Title": "Love this camera", "Author": "LAM-8", "ReviewID": "R3RLJ9NIKZL1KH", "Overall": "5.0", "Content": "I absolutely love this camera. I had a older version of this camera and loved it too, but when video taping I could not zoom in or out, which was disappointing. This version is sleeker, zooms better and you can change the zoom while video taping.I have had big nicer cameras and videos in the past ,yes the expensive ones are much more capable than a small camera but who has the room to fit that in a purse or even juggling with all that bulky equipment. In real life you are on the go with your children and having both a camera and video in one light sleek camera is so much easier to carry around and access. For the size you really would be surprised on how well the zoom works and how beautiful the pictures are. You can also take pictures while video taping too. We went to Disney World and I just loved how easy it was to fit into a pocket or waist pouch, I didn't have to worry about where to store the camera when we were on rides. Not to mention the beautiful pictures and video it left for us.Go on youtube and watch some videos of this camera you will understand what I mean. Very strong camera. From experience when you are on the go, having a big camera and a video separately or even just a big camera, half of the time I opted not to take it because it was just to heavy and bulky to lug around resulting in using my phone camera which you know isn't that great.You will be surprised after you see the pictures and video's you get from this camera. You would never think it came from such a small device.", "Date": "April 15, 2014"}, {"Title": "The resolution is amazing!", "Author": "Mamushka", "ReviewID": "R2YTD80X22IKL6", "Overall": "5.0", "Content": "I love the 'Super Auto' feature of this camera, too.  The resolution is amazing!  I think I've finally found the perfect camera for me.", "Date": "April 6, 2014"}, {"Title": "Love it!", "Author": "jc", "ReviewID": "R2FKM2GGS2UIVU", "Overall": "5.0", "Content": "I was looking for a smaller backup camera to my larger DSLR which is much heavier and bulkier. Although the smaller compact digital cameras are not as versatile as a good DSLR they nonetheless offer a lot of flexibility and convenience as well as pretty good quality images so long as you dont want to enlarge them to large.My HX20v at the time had the specs that I wanted and liked and the reviews were very favorable. I especially liked the longer lens (20x) over the 10x on my wife's 9v.It has GPs and movie features as wel as nine different modes such as Program, Manual, Intelligent auto, Scene selection, Background de-selection  etc. and different settings within the modes. It also has a built in flash. All of this is fairly standard for many digital compact cameras these days, It was just that I liked the features and capability of this make and model for what I wanted when I purchased it. Once you get used to the Menu and all of the settings, or at least the ones you intend to use most, the camera is fun to use.Although there are a variety of setting to use there is no Raw setting. It uses JPEG. For the purist and one who loves to use post image processing such as with Photoshop or lightroom, this is either an annoyance or is unacceptable. Since most digital compacts are like this, it is something you are aware of before purchasing the camera. Many professional phorographers have resigned themselves to this limitation and shifted to compact digitals like this, largely due to its convenience fully knowing that the post photo editing capability will have limitations.Overall this is a great little camera, that is small, light weight, convenient, easy to use and wil;l get the job done for most users. The price of this model is likely to be dropping further from around the $350 level since there are also the newer models of their 30v (w/ Wifi) and 50v (30x lens) available, but it is still a good little camera for the money.Movies can be a problem downloading in general however. Not for the camera however, but depending on the software used to download movies. Sony makes its own proprietary software (Play Memories) that can be downloaded to your computer from their site. PICASA (Google) software, which is superb for downloading individual photos, doesn't do movies. VLC software can work, but I find not anywhere near as well as the Sony software. The Sony software will download both movies and still photos but it is not as user friendly as Google's Picasa as it is difficult to find the file the photos and movies were downloaded to. If you have the free Picasa software also loaded onto your computer and have the seting properly set to scan all of your files, it will automatically pick up the photos you downloaded with your Sony Play Memories software and easily and automatically copy them into Picasa, where that file is easily recognozed.The movie feature works well. It takes good quality movie images. The length of the movies taken is only limited by the battery life on a full charge and the size of the memory card used.Overall this is a great little camera, that is small, light weight, convenient, easy to use and wil;l get the job done for most users. The price of this model is likely to be dropping further from around the $350 level since there are also the newer models of their 30v (w/ Wifi) and 50v (30x lens) available, but it is still a good little camera for the money.The camera has been very reliable and has taken some very good quality images. When I get lazy I use it exclusively as it is so much easier than my larger and much more costly DSLR..", "Date": "March 19, 2014"}, {"Title": "Sony camera", "Author": "Larry W. St. John", "ReviewID": "R1XB9BMMQKNZ7B", "Overall": "5.0", "Content": "What a wonderful camera! Used it on our cruise and it made beautiful pictures. So many options, so easy to use.", "Date": "March 13, 2014"}, {"Title": "Provides excellent images", "Author": "Duotonex", "ReviewID": "R2CHTS7T2JY3Z9", "Overall": "5.0", "Content": "This camera is the perfect blend of size and quality.  I have used it both for its photographic and video capabilities, and it has impressed me in both respects.  Its a bit bulky to have in your pocket, however I use a small case strapped on a belt loop and you could easily forget its even there... but ready to use if you want to snatch it out for a quick pic.  Look for test video on Youtube, especially how it performs in low light...you won't be disappointed.", "Date": "March 6, 2014"}, {"Title": "Charging the Battery", "Author": "lorraine johnston", "ReviewID": "R3HR9NYF3H4YFB", "Overall": "1.0", "Content": "I have only had this camera LESS than a year and had constant problems charging the batteries...I even purchased an extra battery and a separate battery charger for traveling thinking since I have NEVER had problems with cameras before; I would not encounter problems with this camera...boy was I mistaken!  At first I didn't think too much about it, but then I noticed I was using my other cameras more and more because the batteries would not charge...this was around 3 months of owning this camera.  I have had this camera for ONLY 9 months now and have sent it along with the acessories to their repair depot on their recommendation.  Apparently there is only a 30 day warranty, so now I will be charged HALF of what the camera cost in the first place to check it out.  THIS WAS NOT TO BE A DISPOSABLE CAMERA!!!  As you can read, I am VERY MAD and will NEVER purchase anything on Amazon again!", "Date": "February 26, 2014"}, {"Title": "Dust is a problem", "Author": "N. Jamison", "ReviewID": "R23OGVK3BANHEW", "Overall": "4.0", "Content": "I've own this for a couple years now. This camera takes amazing pictures and has some great settings for someone that doesn't know much about cameras. I bought this for a trip I was making out west in Utah. Unfortantly there is a lot of dust in Utah and hence a lot got in my camera lens. When I zoom in the dust is very visable but normal pictures seem to be ok. I haven't yet been able to get the dust out. If anyone else has had the same issues I'd appreciate help. Other then the dust the camera is great!", "Date": "February 22, 2014"}, {"Title": "An excellent overall camera.", "Author": "Borocay", "ReviewID": "R3TJ13C82YY8BK", "Overall": "5.0", "Content": "I loved this camera.  It took great pictures and videos.  I sold it to upgrade to an RX100, but I have no complaints about the HX20V.  It was a good, solid camera.", "Date": "February 7, 2014"}, {"Title": "Amazing even one and half year old.", "Author": "Carlos Lobo", "ReviewID": "R2C7EHLL6BCEWV", "Overall": "5.0", "Content": "\"Old\" but gold. Amazing pics and video, though it can be called old, in this ever changing world, it won't die so easily.", "Date": "January 26, 2014"}, {"Title": "Fantastic camera! ...for 1 year", "Author": "Amazon Purchaser", "ReviewID": "R19M6XC6ZLUPFD", "Overall": "3.0", "Content": "I'm giving this 3 stars, simply because it didn't last longer than a year before dust spots appeared on the sensor.The reality is that this is a wonderful camera, but just keep in mind that it may only last about 1 year before you need to service it (which will cost about $150).  I'm taking mine in to have it cleaned, after only 14 months (problem with dust spots started after 11 months).  I've read about others online having similar issues.Overall, absolutely love this camera... Great picture clarity and quality!!!  Excellent zoom.  Decent photos with flash.The downsides are:- not fast picture taking (each shot is digitally analyzed as the camera takes it, so they turn out beautifully, but that takes time away from ability to take pictures quickly)- after 1 year, spots appeared within the frame and on all my photos.  best guess from reading same issue others mention online is that these are specs of dust on the sensor.  tried cleaning lens, and tried \"vacuum trick\" which others say has worked for them (using a vacuum to suck the dust out), but didn't work for me!On the plus side, I'm so impressed with the quality of the photos and videos from this camera, that I'm going to buy another newer Sony model!  So, you can see that these \"downsides\" don't out-weigh my negatives for it.However, it is sad that Sony has the dust spots problem, as otherwise it's almost a perfect camera (particularly if it were a little faster it would be ideal).  I'm willing to trade the speed for better pictures, so that's why I'm looking at a new Sony.You can search for my review of a Panasonic camera, which I purchased and then returned for this camera.  I was so glad that I did - simply because the picture quality is far superior with the Sony.  Panasonic point-and-shoot cameras tend to last 2-3 years in my experience, but I was sad to see the life of this Sony was so short!I am a convert regarding their picture quality... for the price, it beats the others I've looked at.  I did get a lot of use of it for the year that I used it.  Because of that, I'm still happy despite giving it a medium score.", "Date": "January 25, 2014"}, {"Title": "love this camera", "Author": "D. Mikan \"dcminatl\"", "ReviewID": "R1D87NOFF208FC", "Overall": "5.0", "Content": "we have had the sony for over two years now.  Have had cannon's and nikons and we just love this camera.  Great picks, awesome technology and decent zoom.  We have a Nikon DSLR, but end up taking this camera with us on most vacations, etc. because of its excellent results and portability.", "Date": "January 23, 2014"}, {"Title": "Have used 16 months and seems to be breaking.", "Author": "Malcolm", "ReviewID": "R9MPAQJGKHCBK", "Overall": "3.0", "Content": "We were looking for a compact camera that would give us nice quality pictures for everyday use. This camera did a fairly good job but is now breaking at only 16 months. The camera is starting to make horrible mechanical grinding noises when it's on. I expected a longer lasting product for a camera with this price point. Camera was well taken care of. Very disappointed.", "Date": "January 8, 2014"}, {"Title": "best camera EVER", "Author": "MsLuann", "ReviewID": "RK7PII5SKH22P", "Overall": "5.0", "Content": "This camera takes AWESOME pictures!  Many of my friends have bought it after seeing my photos.Sony did a fine job with this camera!", "Date": "December 17, 2013"}, {"Title": "Nice camera, but wrong place for the flash", "Author": "SANJAY A MATHEW", "ReviewID": "RCZM3KAOT4JUY", "Overall": "4.0", "Content": "You can shoot very good pictures with this camera. Only thing I don't like is the positioning of the flash. It is at a spot where most people would hold a camera - it would try to pop up automatically and due to the pressure of the fingers, it would go back in. Don't know after how many times like that it would just stop working.", "Date": "December 11, 2013"}, {"Title": "Awesome camera, but don't get lost in the sea of features (unless that's your thing)", "Author": "Joe", "ReviewID": "R15EAMW45Z1E49", "Overall": "4.0", "Content": "We bought this camera, primarily because we just had a baby and knew we were in for a lot of picture taking of all the firsts and cute things that were to come.There are a TON of features on this thing, and the picture quality is fantastic!  More impressive is the beautiful 1080p HD video.  Why would anyone spend any more for a high-end camcorder?  I couldn't hope for a better picture, and it even includes image stabilization.My one complaint would be that us, being laymen to photography and not prone to reading through manuals, find that the settings easily get changed when the little knob on the top gets moved, and we tend to forget the one we had it on before.  So we find that when we are in the midst of some awesome or cute event and run for the camera, we have to spend time trying to find the setting it was on previously.  With all the different modes, we inevitably pick the wrong one the first few times and sometimes by the time we figure it out, the moment has passed.I realize that it is probably due, in part to our lack of detailed knowledge of the camera, but it has my wife and I more often than not reaching for our iPhone's to make sure we capture the image first, and then seeking out the camera and setting to get a better quality version, out of fear of missing the moment.", "Date": "December 5, 2013"}, {"Title": "Nice camera", "Author": "S. A. Krueger \"World citizen\"", "ReviewID": "R26KFV1J394F1F", "Overall": "5.0", "Content": "Outstanding point and shoot camera. Bought as a gift, recipient loves it and is getting a tremendous amount of use out of it for family photos and trips. Very easy to use.", "Date": "November 13, 2013"}, {"Title": "Great Camera.", "Author": "kelis john", "ReviewID": "R2BJWFYH0OBRQ7", "Overall": "5.0", "Content": "I purchased this camera and I am extremely happy with it. The quality of the pictures are awesome. Must buy!", "Date": "October 31, 2013"}, {"Title": "Super Camera", "Author": "Ellen", "ReviewID": "R2DAJENI9NL2LY", "Overall": "5.0", "Content": "This camera was a replacement for an identical model that I had broke.  I liked the original camera so much that I only wanted the same camera as a replacement and was pleased to be able to get it through Amazon.", "Date": "October 30, 2013"}, {"Title": "Great professional grade camera", "Author": "Cecilio", "ReviewID": "R3HYS24U5OQHHJ", "Overall": "5.0", "Content": "This may be more camera than you may need to take pictures of the kids, but you won't regret having these many features in a compact package. You can take amazing photos if you learn how to use the camera manually or use intelligent auto to shoot away. A little pricey but this camera will be useful years from now for the manual/auto features. Great buy!", "Date": "October 25, 2013"}, {"Title": "Fantasic Camera but poor pop up flash location", "Author": "Golfrichv", "ReviewID": "R18ZL5BTHFK4AS", "Overall": "4.0", "Content": "I can't say enough good things about this fine camera. Everything on it works great. The Zoom and the Macro are fantastic. The overall picture quality is perfect. Only one negative that's why 4 stars. The pop up flash is in a terrible location on the camera. Gets in the way of your fingers each and every time you use it, They put it right where you instinctively hold the camera to take pictures. Drives me crazy because I think the thing is going to break. Other than that this camera is a 10 stars in my book.", "Date": "October 7, 2013"}, {"Title": "great camera", "Author": "Y. Fung", "ReviewID": "RF3ECBDOTV7TD", "Overall": "5.0", "Content": "good picture quality even with the 20x zoom, good size not too big not too small, works well with its flash don't see much of red eye problem like the Panasonic zs I tried earlier,  also better than those new Canon touch screen cameras in control.the only thing I wish it has is the a bigger sensor like 2.0, 1.8, but the size will be at least double.", "Date": "September 16, 2013"}, {"Title": "Takes great pictures", "Author": "J. R. Little \"Spur 21\"", "ReviewID": "R3LAO46ZVYR4YF", "Overall": "4.0", "Content": "But the menu and features are as difficult to use as Chinese Arithmetic.I hate not having an operators manual - using the built in one is a royal pain.Still no product specific carrying case that I can find. How  difficult would it be for Sony to include one?", "Date": "September 7, 2013"}, {"Title": "The best camera ever", "Author": "Freddy", "ReviewID": "R3R4LH1DS5BER4", "Overall": "5.0", "Content": "It takes excellent  easy shoot photos,,,use it every where.  Great smaller size and still works after all this time.  Highly recommend this model.  Color is really natural and great res.", "Date": "August 30, 2013"}, {"Title": "Excellent Pictures", "Author": "ALBINO VALLES", "ReviewID": "R33W80WGZS2IZG", "Overall": "5.0", "Content": "I review many programs included on this camara, and set them up as well,  It is amazing what you can do. By using the proper printer and ink I cut and paste in my album great quality pictures. Yes I recommend this product.", "Date": "August 21, 2013"}, {"Title": "excellent", "Author": "Arciso", "ReviewID": "RV2ZVR1U7FNY5", "Overall": "5.0", "Content": "CompactbeautifulGreat buy!!You can make greats pictures with this cam without leave with you a lot of lenses!", "Date": "August 12, 2013"}, {"Title": "Sony DSC-HX20V", "Author": "karabill", "ReviewID": "R7NNQ19RS7O4M", "Overall": "5.0", "Content": "My main camera is a Nikon D300 which I've thought about upgrading to a D800E.  For backup, I bought this Sony as a replacement for my Casio little camera and have found that the Sony is so versatile I take it on vacations now in place of my Nikon due to it's compact size.  I love some of the special features this camera has like black and white with either red, blue, green or yellow the only color.  The Illustrated and Watercolor and HDR modes are interesting for a shot or two as well.  Overall, this is a great camera to have either as a main camera, or for the serious photographer, as a backup.  The 20x zoom is a big plus as well.", "Date": "August 6, 2013"}, {"Title": "Great for the mobile photographer", "Author": "Bilko", "ReviewID": "R3ST9OBFKDEGNA", "Overall": "5.0", "Content": "Superb resolution for enlargements.  Fits into my shirt pocket.  Ready to go within seconds.  Zoom is easy to use and powerful for scenery and animal pics.  Easy to use.  Best thing to do is go thru the manual and concentrate on the functions that you will use because it can do everything.  Even can pic out certain colors and isolate them in a black and white background.  Spent several hours around Ithaca, NY waterfalls experimenting with shutter speeds.  Did fine.  Excellent indoors and out.  Would rec.", "Date": "July 25, 2013"}, {"Title": "Exceptional", "Author": "Barbara Miller", "ReviewID": "R2UF42NAB0FEUR", "Overall": "5.0", "Content": "The zoom is amazing!  I took photos at Fort Bragg this weekend that were fabulous!  They were very sharp and clear!", "Date": "July 18, 2013"}, {"Title": "Great choice", "Author": "zaki", "ReviewID": "R1BVFAI7G2MNDH", "Overall": "5.0", "Content": "I'm using it for 1 month so far and it's working greatit takes great pictures even in low light conditions, the zoom is simply fantastic, and i like picture effects and the manual mode where we can control the iso and the exposure which could get it up to 30 secondsthe only cons about it is the lake of manual, but i ended up by finding a complete online help on the sony website here: http://www.sony-asia.com/microsite/cybershot_userguides/DSC-HX20V/eng/index.html", "Date": "July 18, 2013"}, {"Title": "Great (almost pocket almost mega zoom) camera", "Author": "B W", "ReviewID": "RONMD0BHJ6CNJ", "Overall": "5.0", "Content": "I have only had it a month but the picture quality continues to amaze me.  The movie mode is some of the best I have seem - including camcorders.  get fancy with the settings or just leave it on Intelligent Auto + and let it figure everything out. I love it.", "Date": "July 14, 2013"}, {"Title": "Yes", "Author": "William Imhoff", "ReviewID": "R2SUB14A996WR0", "Overall": "5.0", "Content": "I love it! Sony rock!!!!!!!!!!!!!! Works great, flawlessly, fun, fast to record. Eight more words required, four more words required. Done.", "Date": "July 9, 2013"}, {"Title": "Top notch supper zoom with 60fps video!", "Author": "webtraverser \"kevjenn\"", "ReviewID": "RGUQYIIOIUTB6", "Overall": "5.0", "Content": "I'm mostly a DSLR shooter using the Nikon D7000 for the past 2 years. The video on the camera is surprisingly good and got me thinking more about video in general. That D7000 video is lacking in one area: fps. Since it could only go up to 30 fps it meant that when I wanted to slow something down I had to depend on software. I could have traded in the Nikon and bought a better DSLR for video but I wanted some flexibility. I thought a dedicated video camera might be the way to go. However, they were more than I had wanted to spend and since I didn't know how serious I would be with the video it didn't seem like a good idea.I zeroed in on this Sony because it was highly rated and had the 60fps. I bought it last September and it has worked out very well. I created a video for a friend's Indiegogo campaign, and this camera allowed for some really interesting effects; I used it to swoop over a map, with the 60 fps it made seem more sweeping. Very cool.I also discovered that pictures it took were also very good. It has a manual mode that other camera's in this category do not; took some moon shots with it. The panoramic mode is fantastic.  The size also was created because it allowed me to bring it a long to places I normally wouldn't have with my DSLR. It proved to be a great supplement to my D7000.So I had been using it pretty regularly up until a few months ago when the \"piece of dust\" showed up. Not sure how it got into the camera, but it was messing up all of my zoomed in pictures. I wasn't sure what too do about. I am a bit of tinkerer but the camera is sealed up pretty tight and didn't offer an easy way in. I never like the idea of sending something in for repairs (I feel they take to long), but I didn't know what else to do with this one. Luckily, this kind of thing is covered on the first year warranty. So I packed up and sent it off, not knowing how long it would take to get it back. I was amazed that it took less than two weeks.They cleaned out the dust and put in a new optic. Pictures look created and I am out taking video's again.Knowing that you their service is that good, I am much more likely to be getting more things from Sony in the future and have no problem recommending. This camera would also be great as a primary camera if you not that interested in getting into DSLR.", "Date": "June 26, 2013"}, {"Title": "Great camera", "Author": "Alan Bean", "ReviewID": "R3IL48FMS6B8LD", "Overall": "5.0", "Content": "Great point and shoot camera. Recently used it on a trip to Alaska and got great shots.  Very flexible in many different lighting and photographic situations.", "Date": "June 2, 2013"}, {"Title": "Awesome... check around for prices...", "Author": "Scott C Anderson", "ReviewID": "R1RSVNV970YL0F", "Overall": "4.0", "Content": "Originally bought a Fuji camera for about $300 and was not happy with it. I got it from Walmart, so I was able to return it without hassle. I needed a camera for a summer vacation trip, so I ended up going to see what they had in-store; and sure enough they had a Cyber-Shot on sale! It was on sale for $258. It was much less than the Fuji in price, so I was worried it wasn't going to be that good. However, it turns out I got a heck of a deal from Walmart and it was normally much more expensive. Guess there was a price shift and it favored me... Long story short this camera rocks! I've taken over 400 pics (and printed over 50) and can confirm this camera is great! I hear there is a version that has a wifi feature (for a few more bucks); I think it is the 30V version... Anyway, if you can do without that, and look around for better prices, this camera can be the deal of year. I got it for about a $100 less than Amazon is offering it by looking around... It has some neat features (my fav is the panoramic) and takes wonderful pics! Great camera, but.... Shop around!!!", "Date": "May 31, 2013"}, {"Title": "Good one. Less so the price.", "Author": "Nicolas Chevalier", "ReviewID": "R2LZW4GJ97KOKS", "Overall": "4.0", "Content": "That's one good camera with great quality. It gets a bit blurry sometimes when the 20x optical zoom is used, but it's usely no big deal. We could also wonder why there are 18.2MP, but, quite surprisely for me, the photos aren't that big (between 4 and 8 Mo). With a 16GB memory card, you can take up to 2000 photos, so that's enough.The battery is a bit weird ; don't expect using this camera a whole weekend without charging it once. I read on the Internet that it had a 200-300 picture battery-life (I mean, before re-charging it) but it appeared, to me, as the battery is new, that it's more like 400-500 photos.The price is too damn high for a camera. Of course, you get the quality and, I think, no disappointment. But, to me, it's not worth more than 250$. So should be all compact cameras.", "Date": "May 30, 2013"}, {"Title": "Sony HX20V", "Author": "Steve Larson", "ReviewID": "R10F8F16V2P624", "Overall": "5.0", "Content": "We bought this camera as an addition to a Sony point & shoot we really like.  This one has proven to take great pictures in a variety of settings.  We recently went to a music festival.  The crowd was pretty large and we didn't feel like fighting our way to the front to take pictures.  We stood well back and zoomed in on the stage, at night, and took pictures of the performers that make it look like we were in the 10th row...very cool.  Nice camera, lots of features, light weight, great pictures, fair price...very good combination.", "Date": "May 29, 2013"}, {"Title": "Wonderful Camera", "Author": "Marianne Dwan", "ReviewID": "R2V1HAB2YM1YUH", "Overall": "5.0", "Content": "Very nice camera, easy to use. It travels well and takes great photos. It's slender but has the power of a larger camera.", "Date": "May 27, 2013"}, {"Title": "Good quality camera.", "Author": "King", "ReviewID": "R2J64Y88TDK8GB", "Overall": "5.0", "Content": "Im just a normal person that used to use my iphone 5 to take pictures and i always thought they looked good. With that being said, right from the bat you can notice a HUGE difference in the quality of the pictures. The zoom in the camera is AMAZING and the best thing is that quality doesn't drop while using said function like it does on the iphone. Noise is no longer a problem with this camera, Im 100% pleased with this purchase.", "Date": "May 25, 2013"}, {"Title": "Best camera ever!", "Author": "Gwendoline Mungure", "ReviewID": "R3I6J6QSX6E0IE", "Overall": "5.0", "Content": "Even though I'm still new to figuring it out, I'm very impressed. The picture quality and zoom capability make it an essential travel accessory.. The only down fall is that it is a tad bit heavy but the case allows foe better handling. Also the location of the flash is a little tricky when handling. If not careful it can cause blurry pictures if its pressed down on. Still working on getting more pictures as I travel.", "Date": "May 25, 2013"}, {"Title": "Nice camera", "Author": "Candace Koehn", "ReviewID": "R3SB2WMRT9AT0R", "Overall": "4.0", "Content": "All of the features on the camera are terrific, and the quality of the photos is excellent.  It was a great value.", "Date": "May 24, 2013"}, {"Title": "A great camera!", "Author": "Maegan Moon", "ReviewID": "RPIHSN3CX1LDM", "Overall": "5.0", "Content": "I got this camera for my fiance for his birthday and he loves it! The pictures are great quality and all of the different shooting modes make it easy to capture anything!", "Date": "May 24, 2013"}, {"Title": "Love my purchase and this camera!", "Author": "Jalyne Lessig", "ReviewID": "R2GBTUOAWE1J1T", "Overall": "5.0", "Content": "I looked at many online stores and found this at the Best Price! I was a bit scared that it wasn't going to be new, but was so pleased with my purchase!", "Date": "May 16, 2013"}, {"Title": "I like it", "Author": "ark", "ReviewID": "R2KM99W1VQFHO4", "Overall": "4.0", "Content": "The package came in time. I like the quality of pictures and full hd movies (that' the main reason I bought the camera, to have a pocket camera I can make quick quality movies and to have a pocket camera for quick shots. Even I have DSL camera that pocket camera is the additional for a traveler when you don't want to bear a big camera on you). The only main issue and why I gave it 4* is that I don't understand the purpose of GPS. I didn't buy the camera because of the GPS (it was just a feature why I gave it preference to other similar cameras). I expected the location of the point of shot would be indicated on the picture (which is interesting feature to have and I saw on the camera of my friend). But that camera doesn't have that feature. Which is surprised me. The picture's metadata has the  physical coordinates of the picture taken but it didn't show the name and the country of the place where the picture was taken (or at least I couldn't find it in the manual or in the settings, which I doubt). I guess you need some special software to transfer physical coordinates of the picture to the name of the city, country but it doesn't make any sense for the amateur photographer and as I have mentioned I saw the old camera that indicates the location on the picture. But that feature isn't important for me. But we pay for something that doesn't make sense and battery life. It's a strange feature and I don't understand why Sony made that useless GPS feature.Beside that I don't have any issues with the camera so far. I live the quality of pictures and movies (that's what it was bought for)", "Date": "May 16, 2013"}, {"Title": "I have taken a number of excellent photos with it.", "Author": "Rbendele", "ReviewID": "R1J7OJT078HXT3", "Overall": "4.0", "Content": "This is close to being  the perfect camera for me. But, it's now quiet there.  My requirements are : fits in my pocket, has GPS , and quality images. This camera does theses. It reads that it has manual controls. It really doesn't. Some of the settings are difficult to use including the manual mode and the 2 custom settings.This camera has been Discontinued, the replacement is the same camera with the GPS removed and wifi added. For most people taking family photos this may be to complicated of a camera to use. There are others that are more logical in operations.", "Date": "May 9, 2013"}, {"Title": "Excellent Camera", "Author": "Boopathy", "ReviewID": "R2XZZP75U4WON3", "Overall": "5.0", "Content": "This is a great camera, I really loved it. It is new unpacked camera came with 1 year manufacture warranty.  I got package in the second day. I would recommend this seller for any product.", "Date": "May 7, 2013"}, {"Title": "Sony Cyber", "Author": "ken berger", "ReviewID": "R25C4RBRJMDYKQ", "Overall": "5.0", "Content": "We took this camera on our trip to Dubai and took a lot of pictures and when we got back they turned out great. We couldn't believe the clairity of the pictures or the vidieo itself. I am glad I bought it.", "Date": "May 1, 2013"}, {"Title": "Great little camera with a lot going for it !", "Author": "P. J. Nicholls", "ReviewID": "R2LUN4JGUOOVUN", "Overall": "5.0", "Content": "I would highly recommend this camera for it's many features & compact light weight. I great grab & shoot camera while on the go !", "Date": "April 16, 2013"}, {"Title": "Wonderfull", "Author": "cristiano martins de oliveira", "ReviewID": "R2XEXN909KNZDH", "Overall": "5.0", "Content": "Uma excelente câmera. Ótima em tudo que faz e eu recomendo à todos para todos os momentos. I like that!!!!", "Date": "April 12, 2013"}, {"Title": "Okay", "Author": "a reader \"maxona\"", "ReviewID": "R2EVYEAB9QRZHI", "Overall": "3.0", "Content": "I was using a kodak camera before and I was always surprised how well the photos turned out. I decided I needed to upgrade and the Sony Cyber shot kept coming up as a #1 choice in digital camera. I have to admit, I have not been overly pleased with the pictures so far. They are very sharp. And I will say I am pleased with the video that comes back. But the color varies. I feel like this camera picks up a lot of shadow making many pictures have a more dark look, in comparison to my kodak which was never a problem. The camera is a little complicated with a lot of choices of how to shoot your photo best. The booklet that comes with it is only a general explanation. So not very good if you need a more in depth explanation. I tried to sign up for a digital camera class, but it got cancelled. So perhaps when I get a chance to take a class to better understand all my camera's gadgets, I might find this camera phenomenal. But a point and shoot digital camera, I do not find it is as easy as you would hope. You hook up the camera to your computer to download the Sony program so you can edit and store your photos. I have 2 different  (new) computers. The program would not work on either. So now I have to take out the memory card and place it in the computer to download the photos. I will be buying a separate photoshop program in the near future so I can edit the photos. Disappointed that the Sony program is not compatible with more computersWould I recommend this? At this point I am not sure that I would. And if I hadn't already paid for this, I think I would go for another brand.", "Date": "April 12, 2013"}, {"Title": "Best backup camera!", "Author": "Altavista785", "ReviewID": "R5ZUD0Q4EFLHL", "Overall": "5.0", "Content": "I'm amazed at the functions of this camera.  The panorama option is fantastic!  I originally played with a friend's camera, and had to have one of my own.  If you just need a camera for road trips and those outtings with friends, this is an excellent camera,  I have a Nikon D90 which is great, but travel size wise this is a nice backup camera.", "Date": "April 11, 2013"}, {"Title": "Fabulous camera!!!", "Author": "Avril Y Thompson", "ReviewID": "R24XVOVOF3BRVT", "Overall": "5.0", "Content": "This s one of the best point and shoot camera's ever, I am extreme happy with my purchase! I highly recommend.", "Date": "April 8, 2013"}, {"Title": "The Best", "Author": "Charles", "ReviewID": "RF97RH93KK5EK", "Overall": "5.0", "Content": "It is fast. Pictures are crispy. Thhe 3D, panorama and low light features work beautifully. I would recommend to everyone who is looking for high end but non SLR camera.", "Date": "February 18, 2013"}, {"Title": "Great camera, great deal", "Author": "J Novel", "ReviewID": "R26UG7KN8RA66M", "Overall": "4.0", "Content": "I looked all over at various different cameras before settling on this one.  I've had Sony for my last 3 point and shoots, and was considering upgrading to switchable lenses until i saw that there are now 20x zoom point-and-shoots available.  I researched and compared reviews for this and other brand cameras.  As a whale watch enthusiast, zoom is very important, as is response time.  I'm still getting the hang of this camera, more zoom= more shake and harder to catch the whales. but i love all the adjustable settings and modes.  The review may go to 5 stars, once I've gotten the camera controls down better.", "Date": "February 17, 2013"}, {"Title": "a great camera", "Author": "tms1075", "ReviewID": "R25PSUGZM84CU", "Overall": "5.0", "Content": "one of the very best purchases i have ever made. purchased this after seeing the quality of the pictures and video. a very well built item. a great product from sony!", "Date": "February 17, 2013"}, {"Title": "Sony Cybershot DSC-HX20V", "Author": "??", "ReviewID": "R8DPUOBUR0YI", "Overall": "5.0", "Content": "I love this camera, it's by far the fastest point and shoot I have ever had. The camera body is made of metal and feels solid unlike some digital cameras. Additionally, it has a 20X zoom lens that is great for a camera this size.Only thing I don't like about it is the location of the flash. This is a small camera so sometimes my fingers cover the popup flash.I would recommend this to anyone that wants a quality point and shoot.", "Date": "February 15, 2013"}, {"Title": "Fantastic Camera!", "Author": "Kathy D. Vandeventer \"kdvande\"", "ReviewID": "RXQXM0BF0WB97", "Overall": "5.0", "Content": "This camera is the BEST! I took this camera to Hawaii and was able to take a picture of the moon on top of a dead volcanoes in Hawaii! The moon looks awesome and you can see large craters and other geographic irregularities. My pictures are beyond amazing. You can't really go wrong on Hawaii, but the camera helps others understand your infatuation with it's beauty!", "Date": "February 14, 2013"}, {"Title": "buen producto", "Author": "Marco", "ReviewID": "R2ALCY8GJ89HFD", "Overall": "5.0", "Content": "el producto entregado cumple con todas las especificaciones descritas, el empaque es muy bueno y entregado en optimas condiciones, vendedor recomendado", "Date": "February 13, 2013"}, {"Title": "Love this camera", "Author": "Nzoft \"nzoft\"", "ReviewID": "R3TJ167TBOED0P", "Overall": "5.0", "Content": "the zoom is amazing and it works great in concerts, that was what I wanted for, that's why I am completly satisfied with this camera, and it has a perfect size also.", "Date": "February 12, 2013"}, {"Title": "I love this camera so far..", "Author": "Chrissy \"cnb\"", "ReviewID": "R3MMBDTPQ6QG0I", "Overall": "5.0", "Content": "I have a MUCH older sony cyber-shot from back in 2010, 8 mp. I had to update since the camera has been destroyed by my toddler and time, but I am so glad I chose this camera! I am NOT a camera expert, so I cannot give why its so great super detailed- just that it is great! Excellent pictures, and same menu layout as my old cyber-shot. Very pleased with this purchase!", "Date": "February 8, 2013"}, {"Title": "Sony Cyber-shot DSC-HX20V 18.2 MP", "Author": "Jim Chancy", "ReviewID": "R3RXBY1GCQ4UD1", "Overall": "5.0", "Content": "Awesome camera with very good point and shoot capabilities. Takes fast pictures, so I can actually get shots of my kids. Not a DSLR replacement but a very good travel companion. I have actually retired my older Sony video camera since purchasing this camera. Highly recommend...", "Date": "February 6, 2013"}, {"Title": "awesome", "Author": "ken", "ReviewID": "R2NJJGSMFF5G21", "Overall": "5.0", "Content": "it was great i like the features, and settings and how the features explain what they do.i would recommend this product to anyone who enjoys taking photos for any occasion.", "Date": "February 4, 2013"}, {"Title": "Excellent for price", "Author": "florence guerra", "ReviewID": "RJCS3FOMHMYS7", "Overall": "5.0", "Content": "I was very happy with this new camera, I used many different one before, this one allow me to take (with no flash) few pitures very fast and get excellent picures of the children, it takes more time if flash is required, before, they would have already gone by the time I was ready to focus and take a new picture.", "Date": "February 3, 2013"}, {"Title": "Great Camera", "Author": "Robert D. Stapelberg \"bob1of1\"", "ReviewID": "RVC1GK6P6J7W4", "Overall": "5.0", "Content": "So far this camera has really impressed me.  Great video, excellent zoom lens, vibrant color, great in low light.  The only disappointment is that I thought at 18.2 MP the pictures would have been a bit sharper than they are.  I'm very happy with this camera.", "Date": "January 31, 2013"}, {"Title": "Great Camera", "Author": "Kenneth Cowie", "ReviewID": "RU68KLGZ4OY19", "Overall": "5.0", "Content": "Great Camera for the price, we looked at the HX30 but we did not need the additional features that we would not use  and the price for HX20 was great.", "Date": "January 30, 2013"}, {"Title": "Awesome camera!!!!", "Author": "JTplayer", "ReviewID": "R2KTCKQMPAG5AC", "Overall": "5.0", "Content": "I love this camera and I'm never letting it go!!It's like my baby!!! Thank you Sony i love the lens, I love the zooming power and I love the built quality!!Love you Sony !!This camera is highly recommended !!!!:)", "Date": "January 24, 2013"}, {"Title": "Best Camera on Amazon", "Author": "Trash_Man", "ReviewID": "R2MVZAA50DTEP3", "Overall": "5.0", "Content": "This is actually the best camera on Amazon.I've purchased many cameras through this site and I've never came across one as nice as the HX20V.The only thing I don't like about this camera is that the charging port is on the bottom. Forcing you to always lay the camera on something soft when you need to charge it and to transfer pictures.This is very annoying feature that I don't like.P.S make sure you get the special jacket case that was made especially for this camera!", "Date": "January 23, 2013"}, {"Title": "Just out of the box body flaw", "Author": "ina leonte", "ReviewID": "RXY39J2BJ7564", "Overall": "4.0", "Content": "Hello,I was very disappointed to find a flaw in the plastic body of the camera. Right above the lens, there was something like a small slit showing a metallic band behind it. It doesn't affect the camera performance, but the flaw is noticeable, especially because it reflects light, when it's hit by it at the right angle.Otherwise the camera is great for a compact. A lot of features, good picture quality, great movies and neat panorama options & others. It's worth the money and then some. I am very pleased with its performance. Had it not been for the build problem I would have rated it a nice 5 stars.", "Date": "January 21, 2013"}, {"Title": "Sony Cyber-shot DSC-HX20V", "Author": "Stephen Smith", "ReviewID": "R3OWKPQNOPF7LO", "Overall": "5.0", "Content": "I brought this as a critmas present for my wife and she just loves it. Still trying to figure out all the special settings that it has but she will get tere. Takes the greatest pics that I have ever seen.", "Date": "January 20, 2013"}, {"Title": "Pretty Good Camera", "Author": "Roy Hovey", "ReviewID": "R2YKL13O1LT9TB", "Overall": "4.0", "Content": "The currently highest priced long-zoom pocket camera for a reason - far more features and capabilities than others I tested or read about extensively.  Build, speed, image quality, features are very good.  Multiple settings use HDR (combining multiple shots into one good one on-camera) - pretty cool, though many shots are overly-softened or smeared when viewed up close.  Outdoor shots much better than indoor in low light (High-Sensitivity/high ISO scene mode works well there though).  Indoor flash shots tend to blow-out up close subjects, though fixable in simple software.  Good high-def video, great long zoom, and the extended zoom (digital, not optical) is surprisingly good - hand held, and especially on a tripod.  Hey, it's a pocket camera with typical small image sensor, so considering that, it's a darn fine camera for the money.  Short of moving up to Sony's $600 plus RX100 pocket cam (who wants to pay that for a pocket camera?!) or a less-than-DSLR-bulky Interchangeable Lens Camera, this is a fine choice for beginners, intermediates, and/or one looking for a decent backup, carry around anywhere camera.  Having tried bulkier long-zooms and the Canon G-series cameras, I'd opt for this one after my DSLR or ILC anytime!", "Date": "January 1, 2013"}, {"Title": "Great buy", "Author": "Tatiane Barauna", "ReviewID": "RIDCQ847C7S2H", "Overall": "5.0", "Content": "So far im loving the features of this camera. I got it to replace my old canon Powershot,which stupidly i forgot to take it to best buy to be serviced so my protection plan expired and they wouldnt give me new one.This looks very nice so far,i like the video with instant scene recognition and being able to shoot stills at the same time. Great ISO for shots in dark places without flash! Great overall but wish the aperture would go down further than 3.4.", "Date": "December 31, 2012"}, {"Title": "This Sony Cyber-shot DSC-HX20V 18.2 MP Exmor R CMOS Digital Camera with 20X is the best!", "Author": "melody antonini", "ReviewID": "R3RZL8OEGMP1H5", "Overall": "5.0", "Content": "This is the best camera to fit in your purse and get the best results with it.  There is so much you can do with it and so many different settings.  The picture is so clear and if using for sports, you can get repetitive sequence shots that are incredible!  It is easy to use and if you'll just take the time to read about the camera, you'll be surprised at it's capabilities.  I have a big camera and I really think this can equal it especially with portability. The zoom is terrific and clear. In my opinion, and I did research it, I don't think you can do better than this little one.", "Date": "December 31, 2012"}, {"Title": "Good Camera", "Author": "gurr", "ReviewID": "R3QSD6TMNLI8G5", "Overall": "4.0", "Content": "I gave this item 4 stars solely because the flash pops up where your hand should be holding the camera. Nice move Sony. Duh! How can you hold a camera where the flash pops up? Makes no sense. But, I do like the camera, takes great pics, but of course, hard to maneuver around in the menu to find different settings, etc. Of course the instructions suck as most do and aren't clear and clarify things---thank goodness for youtube. I do like the camera though. Small and compact. I also do not like the screen of the camera to be scratched if I'd just throw it in my purse. I'll have to get a screen protector for it I guess.", "Date": "December 31, 2012"}, {"Title": "High quality resolution and editing capabiltites", "Author": "nashman", "ReviewID": "R2148XSPG274J9", "Overall": "5.0", "Content": "Bought for wife's Christmas present and she loves it.  Has a much better resolution than previous camera and enables her to edit photos.", "Date": "December 28, 2012"}, {"Title": "Very nice small camera.", "Author": "Tom S.", "ReviewID": "RX2NXZ2BLQYHI", "Overall": "4.0", "Content": "Like this camera.Meet our expectation we're very happy with it especially for for family, travel and low light shot.Recommend to anyone who looking for small camera.Tom S.", "Date": "December 27, 2012"}, {"Title": "excelent producto", "Author": "Fernando", "ReviewID": "RHW2MUEIWKVNW", "Overall": "5.0", "Content": "Excelent productcumplio con lo esperado en calidad y tiempo en la entrega.contento con el servicio entregado por el proveedormuchas gracias", "Date": "December 26, 2012"}, {"Title": "Christmas Present", "Author": "Kaitlin", "ReviewID": "RD56SB2YPPK59", "Overall": "5.0", "Content": "I just got this camera specifically for the shutter speed and the soft snap. It takes beautiful pictures, especially portraits. My friends and family are in love with how soft snap improves their appearance without compromising the quality of the background (like other cameras trying to do soft snap do). Also, this camera is AMAZING in low lights without flash. Great for those romantic restaurants with the dim lighting!", "Date": "December 25, 2012"}, {"Title": "MUCH faster than the hx9v.", "Author": "S. Krishna \"Sam\"", "ReviewID": "R1YLMJQYR7KZ82", "Overall": "4.0", "Content": "I don't own it yet, but I have been using a hx9v for the past 8 months now.  As such I am pretty familiar with this series. Like everyone, me and my wife are totally frustrated at how slow the hx9v camera reacts.  You press the video record button and literally have to wait for several seconds before it shows the timer.  And if you change the menu wheel, another couple of seconds before it brings you to the shooting menu.This camera, the hx20v, took about 3 seconds from the time I pressed the on/off button to getting a picture.  That's much much faster than the hx9v.  And when I press the video record button, it immediately starts recording.  When I turn the mode dial to the SCN mode, it immediately showed me the menu.  Well, I still wish there was a way to turn off the 'Advanced shooting menu' and such notifications before it shows the actual menu, but hey, I'll take it.Also, on the hx9v, the digital zoom makes the picture very grainy and flubby, but on this camera, I took a picture at 40x zoom and even though it was not sharp, it was totally usable.  This was inside the store under bright light, but in darker conditions, you should turn off the digital zoom.overall, I am happy to see great progress in the hx series.  I love the pictures and the form-factor of the hx9v and this is going to be my next camera.BTW, the hx9v's backlight correction HDR mode is one to kill for.  Try taking pictures of clouds or landscape with that mode and you'll see what I meant.  I hope this is unchanged in the hx20v.  I'll post an update once I buy mine.", "Date": "December 24, 2012"}, {"Title": "LOVE", "Author": "Alex Gauthier", "ReviewID": "RQKP5P5WCB2ZZ", "Overall": "5.0", "Content": "We just started using this camera and are still learning about all the settings. We are not even amateur photographers, but we wanted to get a good point and shoot camera that also shot full HD video. We may have overbought compared to other cameras with specs nearly the same, but we wanted a camera that we know we can use for a very long time. All in all, we are thrilled with our purchase, and even happier with the price we were able to find at Amazon as opposed to Best Buy.", "Date": "December 15, 2012"}, {"Title": "excellent but someone stole it", "Author": "margo", "ReviewID": "R359GELDR9F6O4", "Overall": "5.0", "Content": "Excellent camera.  Used it one day in Africa, put it down for one minute, turned away and it got stolen.  This is the 2nd time someone stole this particular camera from me, both times in Africa.  So thieves in Livingstone, Africa must know this is a high quality camera.  My only regret is that I don't have it anymore.  I am a missionary/aid worker.  If you know of any freebies or give aways on this model let me know!  Thanks.", "Date": "October 28, 2012"}, {"Title": "Good but not sure it will last long", "Author": "Gianluca", "ReviewID": "R2W6WG58JVM33K", "Overall": "4.0", "Content": "It is a very good camera with many features and high quality pictures. The material is not super-solid so I don't know how many years it can last. One has to pay attention not to damage it as it is somehow fragile.", "Date": "September 21, 2012"}, {"Title": "Great Everyday Camera", "Author": "Jimmy H.", "ReviewID": "R33U11FW59OCER", "Overall": "4.0", "Content": "I love this camera.  It does deserve all the high praises shared by the other customers, but the pictures it takes do have that waterpainting look when viewed at 100%.  Had that not been the case, I would have given the camera 5 stars.  Still, compared to the 7-year-old camera I had before, which is bulky and only 7-MP, it is a tremendous upgrade.", "Date": "September 8, 2012"}, {"Title": "Great camera, although filming my saltwater aquarium was too bluish.", "Author": "Happy r/c", "ReviewID": "R1AFJSLT71JTKE", "Overall": "4.0", "Content": "After 3 Panasonic Cameras (LC-33 lasted 5 years, ZS3 lasted under 9 months, ZS7 lasted 1.5 years) and tiring of their reliability issues, as well as poor indoor ISO when used without a flash, I decided to get a SONY.The SONY HX20V review:PROS:- Awesome videos and photos in daylight.- Awesome videos and photos indoors without flash.- Awesome photos with the powerful flash which seems to brighten the entire room instead of just the subjects.- A photo can be pulled from a video footage... how cool is that?- Optical ZOOM is up to 40x if you reduce image down to 5 Megapixels.- Optical ZOOM is up to 27x if you reduce image down to 10 Megapixels.- Can use less expensive SD memory cards- 10fps burst/continuous photo shooting so I can choose the best photo and delete the others.- It's fast, from the time I turn the camera on to filming/photographing, so I don't miss the shots like I used to with my old Panasonic ZS7 camera.CONS:- I have a saltwater aquarium which is lit by a blue actinic bulb and a white bulb and in real life, the aquarium appears mostly white BUT the camera picks up too much blue.  I talked to SONY Tech Support and we tried every setting like SCENE or P but the SONY did not have an option like my old Panasonic ZS7 that removed the bluish in the video footage.", "Date": "August 28, 2012"}, {"Title": "Great Camera", "Author": "Josh Johnson", "ReviewID": "R21BA45DKEL0LE", "Overall": "4.0", "Content": "Picked this up to replace a rather old Cannon Powershot. Read tons of reviews and decided that this was the best high zoom point and shoot for me. Was headed on a Trip to Sonoma County for a long weekend and decided it was time to pull the trigger. Was pleased with this camera from the time it came out of the box. The \"intelligent\" features make it a breeze to take quality photos without a lot of thought. Have started playing around with the Manual setting and the camera only gets better. Only drawbacks are the pop up flash placement is not in the best position and the base settings do not take the best low light photos. Would definitely recommend this camera who wants a companion for their digital SLR.", "Date": "August 22, 2012"}, {"Title": "Very nice compact camera", "Author": "Javier Rodriguez Jimenez \"Javier RJ\"", "ReviewID": "R3AX59VATO87JZ", "Overall": "4.0", "Content": "This is a great camera, it feels very solid not as cheap as other cameras. One bad thing is that while you record a video and you zoom in/out, the zoom mechanism will generate some noise. But it's very great and I'm happy with this purchase.", "Date": "August 15, 2012"}, {"Title": "Awesome camera but auto-focus is *too* fast", "Author": "zaphodbeeblebrox", "ReviewID": "R1ZA5J7K70YSVD", "Overall": "4.0", "Content": "I'm not going to give a full review of this camera because many others have done a fine job of that.  I will however point out just one issue which, in all my research reading all the other reviews, I did not find mentioned even one time...The auto-focus is *so* fast that it will often not focus correctly.  I think Sony wanted to have the fastest auto-focus time of any camera, but it seems to be they sacrificed accuracy for speed.I have adapted to this quirk by either snapping multiple shots, or when I have the time, doing several half-presses before shooting.  The auto-focus seems to work better the second or third time on the same shot.When the auto-focus does work correctly and the shot is in focus, it sure is beautiful.  The resolution, color, and quality of the image is absolutely stunning.Overall I would still recommend this camera despite the quirky auto-focus.", "Date": "August 7, 2012"}, {"Title": "Almost perfect but huge flaw", "Author": "Mrsresearch", "ReviewID": "R18WKJV45SUOMJ", "Overall": "3.0", "Content": "I loved everything about this camera. Except the shadow in the bottom right of the image. Anytime I did not zoom but did use flash. I called support. We troubleshooted. They agreed it was a \"serviceable issue\" and wanted me to ship it to them. No thanks. Still within return period. I can't imagine this is a design flaw. Maybe mine was defective. Not going to try again.UPDATE:  I guess this can be a typical issue with point and shoots.  However, my old Olympus, my in-laws Canon, my parents Fuji, and my new Nikon do not do this.", "Date": "November 28, 2012"}, {"Title": "Exceptional camera for concert video!!!", "Author": "B. Desaulnier \"bonnied\"", "ReviewID": "RT9DXR993WUJW", "Overall": "5.0", "Content": "For recording concert footage, I needed a camera with a high zoom, HD capability, stability of image, ability to zoom in and out while recording, and ability to take pictures in low light (for indoor concerts). After much review, I chose the Sony Cyber-shot DSC-HX20v. It has exceeded my every expectation. I feel that my videos are comparable to ones taken by more experienced videographers with far more expensive equipment (like TALC and Suz526 at other Adam Lambert concerts). Any shakiness in my vids is just because of the excitement of the moment, and I highly recommend this camera to anyone needing something similar. Chokehold is the most complete video [...], but I have more to be viewed on my channel that are partials.Sony Cyber-shot DSC-HX20V 18.2 MP Exmor R CMOS Digital Camera with 20x Optical Zoom and 3.0-inch LCD (Black) (2012 Model)", "Date": "July 26, 2012"}, {"Title": "Great Pictures", "Author": "T. Seltzer \"tsraintree\"", "ReviewID": "RXB49YRL3YPEJ", "Overall": "5.0", "Content": "I bought this camera after extensive research. I was looking for the best quality pictures of my active kids and their friends in a compact camera that I could keep in my pocket for spontaneous shots. This camera does not disappoint. The one issue, which I was made aware of through my research, is the placement of the flash. It is right where you naturally keep your left forefinger. As of now, I have still not learned to keep my finger elsewhere, and the flash comes up automatically to remind me. Thanks flash.The pictures are crisp and clean and are so much better than the Cannon Power Shot I replaced with this. I also like the fact that the shot I just took shows up on the screen, so I can delete it immediately if it's not perfect. Although, I'm not fond of that same feature when I'm trying to take more continuous shots, but that may be my shortfall in not knowing if or how to turn the feature off.Finally, the instructions are built into the camera itself, so the instruction book is pretty useless. I would prefer to have a booklet that explains everything the camera can do, but many others may like it in the camera on the fly. The bottom line is that for picture quality that is easy to use and keep with you at all times, with great auto features, I highly recommend this camera.", "Date": "June 20, 2013"}, {"Title": "Lasted only 40 pictures", "Author": "Michael", "ReviewID": "R2F1P9EL4ZESJ5", "Overall": "1.0", "Content": "The Sony Cybershot came highly recommended but after 40 pictures the display stopped working.  Extremely difficult to operate the camera without being able to see anything.  To make matters worse, I have to pay to ship it back just to get my refund.  The only other option I was offered was to send it to Sony for repair.  I only had it 3 days, like that's reasonable.  My advice, really think hard about on line retailers if they don't pay the return shipping.UPDATE: After contacting Amazon, the seller covered the return shipping for the defective camera.  They didn't have any more available so I bought a replacement through another on line source, for less money including a 3 year warranty that included accidents.  I'm now awaiting a refund to my credit card for the purchase through Amazon.", "Date": "May 6, 2013"}, {"Title": "Crappy inside, developed a black hole in the pictures", "Author": "Darrin Pratt", "ReviewID": "R1VET37H42S6ER", "Overall": "2.0", "Content": "So this camera does fine outside.  It takes nice pictures.  But inside, everything is blurry most of the time, despite trying to adjust the camera to take optimum pics inside.  Also, on my trip to Hawaii (which is why I bought it) the camera developed a dark spot in the bottom left quadrant of the picture.  I cleaned the lens, it isn't the lens.  I'm not sure what it is, but I can't get rid of it and I can't return the camera to Amazon at this point.  So I will try to contact Sony, but I'm not feeling optimistic.  I will go back to a canon or nikon, I had just wanted to give Sony a shot. Not so great.", "Date": "April 23, 2013"}, {"Title": "Long term test = sticky lens cover, internal dust issues", "Author": "P. Falcioni \"Ducatisti\"", "ReviewID": "R2Q3W3RCJGU7P5", "Overall": "3.0", "Content": "I want to state first off that I LOVE the photos I can get with this camera! I love that I can roll the dial to Auto and hand it to my tech-averse husband, and he can take good photos by just pointing and clicking. I love that there's also the option to control most aspects of photography with this camera if I choose to do so. I have a Panasonic DMC-ZS3 which also takes good shots, but doesn't have much to offer besides automatic settings, and I really miss being able to adjust white balance!If I had reviewed this camera last year when I received it, I would have definitely given it 5 stars. It was near perfect.Unfortunately, in the past 3 months I have started to have issues, mainly the lens cover sticks, touching it will open it usually, but sometimes it stays partially closed in the lower right corner, which is tough to notice until you view photos on a larger screen. This problem makes it nearly impossible to trust the camera for quick shots since I never know if the lens will be completely uncovered when I turn the camera on.I have carefully cleaned this camera using every trick in my camera-cleaning arsenal (including, as a last resort, my mini-vacuum), but the lens cover still sticks.Secondarily, are the dust specs which have appeared in between the outer glass lens protector and the lens itself. They are visible at moderate-to-full zoom, particularly with landscape photos if the dust specs are located in the area where flat blue sky is pictured.Although I do take my camera into moderately rugged locations, I also am careful to keep it clean. I have a case that seals well against dust, and when we're riding motorcycles the camera is inside the case. When we're hiking, the camera is around my neck, but if we get into situations where it might get knocked around, I put it inside the case in by backpack. I don't just use a camera just at home, but I also am not dragging it out to the Bonneville Salt Flats or photographing sandstorms in the desert.I have other cameras which have not had these issues, although I did need to disassemble my Panasonic DMC-ZS3 after a couple of years of use and clean the sensor. Fortunately, they make that camera very easy to access the internal components, so it was an easy job. Not so much for this DSC-HX20V. Even if I wanted to try and access the sensor, it's darned near impossible.So, is it worth sending in for a professional cleaning, and hopefully a permanent fix for the sticky lens cover? I don't know. It does take very good pictures.", "Date": "March 29, 2013"}, {"Title": "Fantastic picture quality!", "Author": "phoongdan", "ReviewID": "RN4VY31JPAI60", "Overall": "5.0", "Content": "I bought this camera for my wife back at Christmas time and have used it on a vacation, around the house, and some weekend hiking excursions. The picture quality is absolutely fantastic. My predecessor was a 10.1 megapixel Sony Cybershot which I was pleased with at that price range, but this camera is a whole nuther level! The zoom feature is really fantastic - it's really great for taking photos of birds, animals, flowers, and of course distant objects. The menu system is the familiar Cybershot format, so if you've owned a Cybershot previously, that should be familiar to you. If you haven't owned one previously, it doesn't take too long to figure out how to delete photos, view photos, etc.My only real complaints are the time it takes for the zoom to come into focus and the location of the USB port being on the bottom of the camera, which doesn't allow you to set the camera \"upright\" when sitting it on a desk/table for purposes of offloading your photos onto a computer, for example. While the zoom feature is great, if you are trying to snap a photo of a bird or animal, there's a good chance it will get away before the zoom comes into focus enough to snap the photo. That's the major drawback of the camera I think and why I prefer snapping photos of plants and flowers - they can't get away so easily!", "Date": "March 27, 2013"}, {"Title": "Does It All, Nicely!", "Author": "Franklin \"snowblood902\"", "ReviewID": "RHS7TX1ANDI93", "Overall": "5.0", "Content": "Although fairly spendy by about 50 bucks more than others it excels at what it does.This case will work. It will allow a either 1 battery or a couple of cards, but not both.Tight and small fit. Cheap too.Sony LCSCSQ Soft Carrying Case for Sony T, W, and N Series Digital Cameras (Black)These batteries are great and inexpensive. Gives actual time remaining (unlike Sony)!Wasabi Power Battery and Charger Kit for Sony NP-BG1, NP-FG1 and Cyber-shot DSC-H3, DSC-H7, DSC-H9, DSC-H10, DSC-H20, DSC-H50, DSC-H55, DSC-H70, DSC-H90, DSC-HX5V, DSC-HX7V, DSC-HX9V, DSC-HX10V, DSC-HX20V, DSC-HX30V, DSC-N1, DSC-N2, DSC-T20, DSC-T100, D...This is a nice 2.0 3.0 reader.Kingston's USB 3.0 Media Reader Computer Memory FCR-HS3Tried to sneak a cut and paste link to great pics bur was denied. Search Fmanta at yahoo Flickr. I am NOT Manta. I just posted a small macro pict on product images.Look to Youtube at SONY DSC-HX20V footage (part 2) by  CloseLineProjects for handheld video.Just say \"Ahhhh...\"", "Date": "January 9, 2013"}, {"Title": "Sony DSC-HX20V", "Author": "Paul Tucker", "ReviewID": "R2SA22V1C6NIA1", "Overall": "3.0", "Content": "Camera meets most of my expectations, but not all. I own a Sony DSC-T100 camera & like it's \"Bracket\" feature better than that of the HX20V. The delay between the bracket shots is too short on the HX20 (i.e. even the longest delay option is much too short). A longer delay allows capture of a sequence of \"action shots\" providing the opportunity to choose the \"best\" shot, or shots of the sequence. The HX20 delay between bracket shots is so short that there is virtually no difference in the \"action\" between the sequence shots. Also, the camera is not as \"quick on\" as the T100 camera. There is a definite setup delay when the camera starts up.", "Date": "December 20, 2012"}, {"Title": "Great pocket camera", "Author": "Rachel DuBose", "ReviewID": "R2GQQY28JVBMZN", "Overall": "5.0", "Content": "I know quite a bit about photography, but there are times where you need something that rests in between the smartphone camera and the DSLR. For this use, I've fallen in love with this Sony. Auto-focus is quick and accurate. The stability is great -- I've been able to zoom to the limits and take photos without a tripod without getting any blur. Unlike point-and-shoots I've had in the past, the screen is bright and colour-accurate. Best of all, the battery seems (to my unscientific observations) to last longer than most. Panorama mode, which I didn't think I'd use much, has ended up being something fun and used more often than I expected. Video capabilities are right about where you expect a point-and-shoot to be at.Everything about this camera can be summed up thusly: for a point-and-shoot, it's extremely good for how compact it is. But it's not going to replace a DSLR for serious photographers.", "Date": "December 10, 2012"}, {"Title": "Perfect Little Camera", "Author": "smarksman \"smarksman\"", "ReviewID": "R1MO2PRVXQ7RGH", "Overall": "5.0", "Content": "I love this camera. Before I got this I had a cheap digital camera and a $300 HD Camcorder. I wanted to find a camera that would do both take good pictures and shoot good HD video as well as be portable. This is exactly what I was looking for.Pictures - The pictures look great on this camera. The only downfall is that you can't shoot pictures in the RAW format (just jpeg). There are lots of options you can use under manual to make the pictures look great. I personally like the \"toy\" (makes pictures look more artsy) and \"pop\" (really brings out the colors in your pictures). With in those options you  can pick which color hue you want as well. I havent had any issues taking pictures with this camera at all.3D pictures - the 3d pictures are nice. I downloaded a free software that will convert the 3d images on my sd card into a format where i can see them with the red and cyan glasses. The \"sweep multi angle\" is the best option for shooting 3d pictures. I will take multiple pictures of the same image because it can be blurry.Video - The video on this camera is full HD. What is great is you can shoot in acvhd which I have a hard time editing with (a problem I had with my camcorder) or you can shoot with the mp4 format. I havent had any issues editing with the mp4's so I love that this camera lets me pick between two different formats. You can also pick whether you want to shoot in 1080, 720, or VGA. The bad part about the video function is you dont have a lot of control over how you want shots to look. There is no white balance in video mode. You can adjust the brightness but you cant adjust contrast or saturation. One nice thing about this camera though is that you can use some of the manual picture modes and record video with those features. For instance if I am outside and I am in video mode and the grass and trees just don't look as green as they should I can switch over to manaul mode for pictures and set \"toy\" or \"pop\" and then hit record and the colors will look a lot better. The negative side of that is that you can't adjust brightness when you do that.Also, the video is decent with landscape shots outside. I found my camcorder does a better job with that. But with the sensor on this camera the inside shots look so much better than the camcorder. My shots with this are never grainy indoors. And close-ups both in and out doors look fantastic with this. I was blown away by how much it out preformed my camcorder and basically everything except the landscape shots.Space - I use a 32gb card. I can take a lot of videos and pictures before this the card gets full. The mp4 files are highly compressed so they dont take up much space video wise but still look great. And since the pictures are just jpegs they dont take up that much space either. When I first got this i was taking lots of pictures and videos, it took a couple of days of doing that before the card got full. So this is great for people taking trips who want to take lots of pictures and videos.Battery - I love the battery life on this. My camcorder would last like 20 to 30 minutes. This Sony camera will last like 40 minutes to an hour, depending on what I am doing. If i am doing just video it is more like 40 minutes or so, if I am taking pictures it will last a long time. If I am doing both equally then it will be around an hour. I bought some cheap backup batteries on here so I never have an issue of running out of batteries.Overall I would recommend this camera if you are looking for portable camera that can shoot great pictures and HD video. It is by no means a DSLR quality camera but that is why it is a lot cheaper than one. I feel like this camera does it all, it is reasonably priced, and it is small enough to fit into your pocket.", "Date": "November 4, 2012"}, {"Title": "Unsure when I ordered it...now it's beyond anything I expected!", "Author": "CedarburgSue", "ReviewID": "R14LLC6AFZCTDO", "Overall": "5.0", "Content": "I researched multiple sites and reviews for days before deciding to purchase another Sony camera. I had loved the one that was stolen but thought that after six years, I should give another brand a try. I am a simple point and shoot beginner so I have a lot to learn but after comparing sample photos and videos it was very clear to me that Sony makes cameras that give true colors and excellent quality for the money. I had narrowed it down to the HX20V and the HX200V (a much larger and heavier camera) but opted for the smaller HX20V and I couldn't be happier!!! Every day I discover a new feature and most of all for beginners and those who want a quick answer, the manual is built right into the camera so I can look up questions, troubleshoot shots and get expert help right in my hands without a booklet to lose. That feature alone is worth the money.But beyond that, the panorama shots are extraordinarily flawless in their stitching and perspective. You simply hold down the shutter button and scan across or up and down to capture your scene and the color and quality of the shots is breathtaking. The burst mode is another unbelievable feature that captures ten shots in less than a second and each shot was as good as a normal single photo. I have a lot more to learn but I couldn't be happier with what I've discovered so far.", "Date": "August 27, 2012"}, {"Title": "Great little all-purpose camera for on the go use.", "Author": "Gen of North Coast Gardening", "ReviewID": "R2O25VZD2SEVRD", "Overall": "5.0", "Content": "I loved how easy it was to use this camera. Right from the get-go, I was able to figure out how to adjust the settings (it has full manual, adjustable automatic, and two full automatic settings which each have some easy-to-understand ways of adjusting the final result of the photo). There is also a setting that lets you take sharp photos with a blurry background - great for taking portraits of people.I loved the video capability. I know it's standard nowadays, but it comes in handy, and the SD expansion slot means that I'm not feeling limited on how much video I can take on the average day. The video quality is excellent for a point-n-shoot - better than my Flip recorder.What's really fun about this are the 3-D picture settings and the settings to take a panorama photo. You can even take a 3-D panorama, which is super! With so many computers offering a 3-D display nowadays, this is actually pretty cool for reliving vacations, and the panorama gets you that realtor-like width in your photos. I'm a landscaper, so plan to get a lot of use out of that feature.Overall, an excellent point and shoot camera. While I'm used to my bigger Canon with fancy lenses, this gave me shockingly good photos and fits right in my pocket, so I'm excited about having a camera that I can carry with me on hikes without a lot of fuss.", "Date": "June 28, 2012"}, {"Title": "Love it, but...", "Author": "E. White \"E&L.White;\"", "ReviewID": "R3MT93C77DTSHX", "Overall": "5.0", "Content": "I love this camera. It takes beautiful pictures, but sometimes it doesn't want to turn on and takes hitting the button a few times. I've not used it that much, so that was slightly disappointing, but other than that I've been very satisfied. Perfect for concerts and everything else. Handy little camera.", "Date": "February 9, 2014"}, {"Title": "Great Camera until it stopped working.", "Author": "Brother of The Pen \"BOTP\"", "ReviewID": "R9PXM2ABSICVO", "Overall": "2.0", "Content": "I purchased this camera at a discount through Amazon Warehouse in order to save myself around $200. The camera came from China in what looked like the original packaging, so I'm assuming it was a refurb. It was a very easy to use camera, and I really liked it a lot, until the day the lens opened only halfway, and would never shut completely - plus, the LCD display would only flash \"Cybershot\" and then go dark. This happened some two weeks after I received the camera, and despite trying everything I could to try to convince it to cooperate to no avail, I'm having to return it now. That being said, if you purchase one brand new, you may not have this issue, and if that's the case, you'll enjoy it tremendously, I think. Perhaps I should have given it no stars, but since it worked quite well before it failed, I'm giving it two stars.", "Date": "August 4, 2013"}, {"Title": "NEW PURCHASE", "Author": "Phillip S. Gant", "ReviewID": "R1EV86SWZN41LY", "Overall": "4.0", "Content": "JUST BOUGHT THIS AT THE STORE WITH A DOT WITH A CIRCLE AROUND IT FOR $83.00,NEVER BEEN ON,BATTERY NEVER BEEN CHARGED,EVERYTHING IN THE BOX,FOR UPCOMING TRIP,WAS GETTING SX280 UNTIL I SAW THI DEAL!!!!!!!", "Date": "May 10, 2013"}, {"Title": "Took great pictures in Ireland!", "Author": "Becky Ollar", "ReviewID": "R39HQK25I898ML", "Overall": "4.0", "Content": "Bought this camera 3 weeks before going on a once-in-a-lifetime trip to Ireland. Didn't have time to learn much about it, but didn't have any serious difficulties and pictures turned-out good. As with other reviewers, I thought the flash was in an inconvenient place. Also, didn't like the on/off button being so small. Overall, glad I bought it.", "Date": "May 10, 2013"}, {"Title": "Great camera", "Author": "Tami Emory", "ReviewID": "R32XVV3OK939JQ", "Overall": "5.0", "Content": "I am very happy with my purchase.  This camera takes great pictures at night, and has a much faster shutter response than my previous camera which was a Cannon.  I have always been a Cannon fan, but this Sony has changed my opinion.  The only thing I don't like about the camera is the placement of the pop up flash.  It comes out right where you would normally hold the camera.  But I am getting used to it and this is a very minor complaint.  The camera takes amazing pictures for a camera in this price range.  It has several cool easy to figure out settings, and holds a charge for a long time.  I highly reccomend this camera.", "Date": "May 7, 2013"}, {"Title": "Great litle camera - (update - not so great..)", "Author": "Barbara Hood \"latrevisana\"", "ReviewID": "R3MFAYPE7R1YYY", "Overall": "4.0", "Content": "I bought the Sony after a long string of Canon Powershots.  I still own my Canon 5D Mark II, which comes out only on special occasions...The small cameras are always with me on the other hand.  I switched to Sony because I wanted the HDR capability (in -camera), and the Canons still don't have that in their Powershots (!!!wake up Canon!!!).  Over all i like the Sony, easy to use (I didn't have to read the manual), the photos and videos are really nice.  I haven't printed from it yet, so I don't know how that will turn out.My biggest complaints are:1.  Lack of shutter or aperture priority.  (but the auto does a pretty good job)2.  Flash always in the way.  You are not supposed to push it back in, but it happens a lot by mistake...3.  Every time you change a mode with the dial, particularly the SCN mode, all the different option icons come up on the screen every time, so it takes a few seconds to select and set the options you want ...Since I do this quite frequently, it becomes a slow down problem for me.  It should be set by default to the last setting i had chosen and only if I need to change it then I would bring up all the options on the screen, like Canon does with its Function button.  I use HDR only on high contrast situations, so I keep switching back and forth from HDR mode to P, and every time it's several seconds between shots.  On a partially cloudy day, this happens every time the sun comes out (SCN - HDR) and goes back under the clouds (P or Auto)4.  Don't like the movie format, I wish it was recording in a more compatible format.  But the movies are really nice and smooth.5.  I cannot figure out how to disable the digital zoom, I wish they didn't put that in any camera!!!Overall it was a good change from Canon, it took me out of that rut...Update:1.  I figured out how to disable digital zoom.  Still wish they didn't put it in, it's worthless.2.  After using this camera for a while now, i must say that although some of the features seem cool in the beginning, such as the burst photography, the hdr excetera, in reality the amount of smudging in the JPEGs is annoying.  This happens in low light photos too. Also, the software that comes bundled with the camera is most inept!!!  I cannot even figure out how to erase files from it.  The \"help\" is worthless, there is no \"search\" for a term you want to look for.  On its index, I couldn't even find something elementary such as \"delete files\". It's basic but not very functional for me.  I started just opening up the camera from windows explorer and using Photoshop to edit, delete, move, etc.  Why can't they give us something better?I should have stuck with Canon.  Come on, Canon, put HDR in your Powershots.", "Date": "April 24, 2013"}, {"Title": "Pass this camera if you like to use tripods", "Author": "Rodney A Hauck", "ReviewID": "R8AZ78SNEXQXZ", "Overall": "2.0", "Content": "One of the big selling features that I liked about the camera is the zoom factor (20X) and this performs very well.  I choose this camera because it was newer and it was highly rated (my old Nikon after years of use finally stopped working).  My big complaint about this camera is the location of the connection on the bottom of the camera for down loading photos.  My Nikon connection port is on the side, easy to use, and convenient.  This camera has the port located next to the spot where the mounting bracket for a tripod.  In order to download the photos, I must either pull the memory card, or remove the mounting bracket.  It is a poor design to locate it so close that you have to remove something in order to use it.  However, if you will never use a tripod to mount the camera, then the above is all moot and the camera works well and takes good photos.  As a family, we camp allot and it is great to use a flexible tripod to get family photos.  My last outing, I forgot to put the mounting bracket back on and most of the photos taken, one of the family members was missing.  I will be buying another Nikon Lumix DMC-ZS7 before to long as it takes great photos and has just as good features.", "Date": "April 23, 2013"}, {"Title": "Not compatible with IMovie on 1080P videos.", "Author": "Sad but true", "ReviewID": "R3G4QE7OV4ETP4", "Overall": "3.0", "Content": "This camera is not among the cameras that Apple lists as being compatible with IMovie.  Although Sony has some conversion patches available to play  their AVCHD 1080P video format on a Mac computer, I wouldn't bother with this on a point and shoot camera at this price range.  The whole purpose of having 1080P video alongside good still camera optics is that you could use this camera as a still shot and movie camera all in one, bundled together by IPhoto and IMovie on the production end in a Mac environment.  If I have to buy additional editing software for my Mac to play these movies, then it simply is not worth it.  This is mainly a Windows camera, and it should be clearly described as such by Sony and Amazon on their product description.  The Canon SX260HS is the closest completely compatible camera (with both IPhoto and and IMovie), and it is about $60.00 less than the Sony.  But for this glitch, I would have opted for the Sony camera, as it is a superior product.", "Date": "April 15, 2013"}, {"Title": "super camera with a few issues", "Author": "Viktoria", "ReviewID": "R3QRMWCPAUANV0", "Overall": "4.0", "Content": "its a great product, considering the size of it you expect way less. its always in my purse and perfect for every kind of situation.. but still i have a few problems with it:- sometimes when use manual flash, theres a delay of up to 5 seconds from pushing the button to actually reacting and taking the pic. does enybody have the same problem or know a solution for that?????- when using \"continuous shooting\" mode, shooting 10 pics in a incredible short amount of time while pressing shutter button, i cant see the pics when i transfer them to my PC. the files are displayed as one image and this one image cannot be displayed at all.- neither can i watch the hd videos on the computer.please help!!!!Thanks, Viktoria", "Date": "February 19, 2013"}, {"Title": "Awesome", "Author": "Diego Rovayo", "ReviewID": "RHOOP9LQSBIOD", "Overall": "5.0", "Content": "Excellent camera works great day or nigth. Low light conditions. Shots with adequate speed flash charges quickly. We are very happy with the camera.", "Date": "August 25, 2012"}, {"Title": "Takes a while to get used to", "Author": "Green", "ReviewID": "R1RK3VCF2IEQ2A", "Overall": "4.0", "Content": "This camera's packed with features, and they're taking me a long time to get used to. I love Love LOVE that I can take pictures in low light without flash! That's something I have never seen before! Just hold your hands as still as you can and you get a perfect picture. I love that you can just set the wheel to SCN and trust the camera to pick the right choice. And in 1/30 second?! The intelligent Auto modes are super awesome. I love that it takes... what is it, SIX? Pictures all at the same time, and it takes the best of each picture to make one great picture.I have yet to get the background defocus feature to work. I've tried in low light, I've tried in bright light, close to subject, far from subject, but every single time I take a picture I always get the \"Could not defocus\" error. I tried looking at the on-camera manual but it doesn't really help.That sweeping 3D feature thing? I hate that. So much. I thought it would take a moveable 3D image of a scene... that's what it's supposed to do, right? But when I use it, it just makes a choppy... heck, I'll call it a flip-book. It's like you see the whole image at once and only certain parts move. It looks stupid. Maybe I'm an idiot.Also I'm a bit peeved that the HDMI port on it to let you see your 3D pics on the TV, is a mini-HDMI port. So I had to order a new cord. We'll see how that goes.As for the main function (take great pictures) works sexily, the bells and whistles are making me sad. Oh, well. That's my fault for buying a camera for the bells and whistles.", "Date": "February 26, 2013"}, {"Title": "Great Travel and Everyday Camera!", "Author": "Jay", "ReviewID": "R34V6G1LEBKI3C", "Overall": "5.0", "Content": "Looked at the TZ30 and SX260, but the HX20V offers the best IQ, design, and features.Turn on the camera and set it in Auto and it produces great pictures; what more could you ask for?", "Date": "July 30, 2012"}, {"Title": "Second Time Around", "Author": "Shutterbug", "ReviewID": "RARN1VGYUF2GA", "Overall": "5.0", "Content": "I first bought this camera a few months ago but sent it back because GPS would not come in, it was a bit bigger than I wanted and it is not Mac friendly. I reverted back to Canon  since I have gone through several Canons in years prior. Te Canons ranged from Decent to unsatisfactory and each camera developed a problem with the lens cover ( 3 different models ) I tested a 260 and went to Best buy to purchase it. While being there I had the opportunity to compare it in hand with the Sony and there was no comparison Sony won hands down on all levels. With both cameras sporting a 20x zoom, it looked like Sony's 20x was double as close as the 260, the colors were better and it had more options. For the $50 more it is a no brainer. This camera takes amazing shots. It is a bit more difficult to get use to the settings but you wont be disappointed in the photos.", "Date": "July 12, 2012"}, {"Title": "Amazing photo quality and great battery life.", "Author": "jake", "ReviewID": "R49OTP5F5E1CD", "Overall": "5.0", "Content": "This is probably one of the best small point and shoots on the market. It is very fast in taking photos. The colors turn out very vibrant and alive! In fact many times I take a photo of something and it looks better on the little screen than in real life. The camera has 18 megapixels, which is probably enough to make movie posters. I dont think it needs so many pixels but maybe that contributes to the fine quality of its pictures. Im impressed with the battery life. Even when the camera sits around for long periods, Its noticeable that the battery does not drain. The menu is the modern standard with various scene modes. It is actually one of the better menu systems for a point and shoot. Easy to navigate. The buttons feel a little flimsy but they are still very responsive and accurate. I do not like the flash on this camera. It pops out in the exact spot where its comfortable to hold it. But its not enough of a complaint considering how well everything works. I tried the movie mode and was actually impressed with the video and sound quality. I didnt really test the aperture, s/p and other settings because I think these point and shoots are only good for Auto mode. But for any recreational user or a person looking to simplify their shooting experience this is a great option that will astound you as to the beautiful outcome of its photos.", "Date": "February 27, 2013"}, {"Title": "Great\"Enthusiast\" Camera, Insane Menu", "Author": "John S. Socha", "ReviewID": "R1W7D8SVDVK06H", "Overall": "4.0", "Content": "UPDATE: Camera is only a few weeks old and there seems to be a separation between the cover glass and the actual electronic screen.  I am putting up a photo of it...anyone else have this problem or am I just unlucky?####I like this camera, a lot. So this is more a rant about the current state of \"featuritis\" and lack of printed manuals.Considering that I wrote a BOOK on using digital cameras*, teach about them, and am considered an \"expert\" in some media circles, this is just nuts.  I actually had to spend quite a bit of time figuring out which mode (intelligent auto, really even more intelligent auto, program auto or easy auto) was the right mode to locate a menu of special artistic effects.  Darn you, Sony!Why not read the manual, you say?  THERE IS NO MANUAL!  Not in print, not on disk!  Just a puny getting started booklet, half of which is in Spanish. [Comments indicate there is a manual available online, but I deal with a lot of people who either are technically challenged or simply don't have time or patience to deal with such things.  Sometimes I get the feeling that digital camera manufacturers sometimes forget what I call the \"prime directive:\" remember your audience. They seem to make cameras to impress each other and forget that their customer -and not an enthusiast- is nowhere near as excited about all the bells and whistles as they are.]All of the \"help\" is in the camera as a series of on-screen guides. So if I locate the \"key word\" for a certain feature, (high dynamic range black and white, for example) it can take me to it, but does not do a good job of helping me find it on my own!  Most of the special effects were found in the program auto mode, which in retrospect makes a certain amount of sense. Generally the program or \"P\" mode offers full auto operation with significant overrides. But that's a lot of 2020 hindsight preceded by a lot of head scratching.Any camera that has \"Intelligent Auto\" and then \"Super Intelligent Auto\" and then \"Easy Mode\" that hides all the cool new stuff is trying too hard to be all things to all people. \u2028But if you take the time to learn to use the camera, you will find it quite enjoyable. There are significant post-processing effects that may allow you to take pictures you were unable to successfully take before, and many of them are done behind the scenes so you don't have to worry how it happened.If you are one of these folks who only wants to sometime set the ISO and check to make sure the resolution is correct, this camera will cause brain freeze.But if you only lock it into \"easy\" mode, you are spending a lot of money for technology you may never even find.I did get some excellent video results of an important local event, and was able to strip off the audio (stereo!) and use it in a radio report.This is also a somewhat delicate camera, as in a 20X zoom in a fragile extending lens system. So buy a good case and read up on all the places you should not use it. It ain't no rugged 35mm point and shoot, but then again, most digital cameras aren't either.*\"How To Use The Digital Camera You Just Bought\" is SOLD OUT! It is undergoing minor updating and will be reprinted very soon.PS: I downloaded the \"firmware upgrade\" (Version 1.0 to 1.01) to fix some things and I swear there was a 3,000 word legal agreement you have click \"yes\" on before you can proceed. Sony is waaaay too \"lawyered up.\"", "Date": "February 23, 2013"}, {"Title": "hard to use", "Author": "Verne Brown", "ReviewID": "RKSB5D8F39T8N", "Overall": "2.0", "Content": "Changing setting is not easy,  if wish to changes sence to many steps to get it done..flash is right where one would hold camara, With no view finder have to use display..hard to use to find what you wish to take a picture of in low light .also no view finder hard on battery. battey life way to short....update softwere say go to menu and set to \" \"  can't ..once usb pluged in camara will not turn on to set..have to back out , set then try again..plus the setting to set to is on page 3 of 5...manual no tell you that..infact very weak on info. slow on saving picture to card. Tryed on some sunsets colors not life like..weak on the reds.", "Date": "May 2, 2013"}, {"Title": "Great Camera, Best Case But No Manual!!!", "Author": "Lawrence R. Decker \"lrdecker1\"", "ReviewID": "R3TH3JAS83ASEM", "Overall": "4.0", "Content": "CAMERA - I bought the HX20V camera a couple of weeks ago and my first impression is that the camera will meet my needs for many years to come.CASE - I also spent lots of time shopping online then in local Walmart and Best Buys stores to find a good case. I ended up buying a Lowepro (not a brand I considered when first shopping online) Newport 10. Its made of some kind of tough nylon-type fabric and has some internal stiffening in the face of the case to protect the camera. It has one zipper across the top to access the camera compartment and a small zipper into a accessory slip-pocket on the front that can hold a battery and memory card. The camera fits just right - not too tight nor too loose. And it has a sewn-in belt loop that won't be easily removed by a thief.COMPLAINT - My only MAJOR complaint thus far it that SONY DOES NOT IN ANY REASONABLE WAY PROVIDE A DETAILED USER'S MANUAL FOR THIS PRETTY COMPLICATED AND EXPENSIVE CAMERA!!!HERE IS WHAT SONY PROVIDES:1.  A \"Digital Still Camera Instruction Manual\" is in the box with the camera and can be downloaded at sony.com as a PDF file. But, after subtracting Spanish language pages, blank pages, front and back covers and other pages having nothing to do with how to use this camera (including notes to users in Norway) THERE ARE ONLY 24 PAGES ADDRESSING ACTUAL USE OF THIS CAMERA - AND THAT IS COMPLETELY INADEQUATE!!2.  At Sony's website there are two aditional documents. One is called a \"2012 Cyber-shot® Digital Still Cameras Product Guide.\" It's appears to be a sales brochure!3.  The second additional document available at Sony's website is a \"Cyber-Shot User's Guide\". This ia a lengthy document that goes into some detail about using the camera. But, Sony only provides this as an html file which can't be downloaded (or at least not easily downloaded)! You can only view this manual online or print each section one at a time (and many sections are but a single page long). I've already spent about 8 hours printing this manual and am perhaps half done!!DPREVIEW indicates that in this regard, Sony has reached a new low among camera manufacturers. I agree completely. I had a run-in with Sony some years ago over a CD player warranty and they screwed me!! Well, they've now screwed me twice!! There won't be a third time because I'll not buy another Sony product - I don't care to do business with any manufacturer who has so little care/concern about their customers.", "Date": "September 20, 2012"}, {"Title": "Perfect camera for non perfect user", "Author": "Werner R. Fagerer", "ReviewID": "R2NV9ALYMA034S", "Overall": "5.0", "Content": "It's the perfect camera for the non perfect user. It knows much more then me so some day I might even try to do more then taking great pix under good and bad light conditions.", "Date": "July 14, 2012"}, {"Title": "Great for Shooting HD Daytime Video  but Watercolor Effect on Photos", "Author": "Angel_Pen \"angel_rising\"", "ReviewID": "R3FFCR0I89IXY1", "Overall": "3.0", "Content": "I only write this review because the price of this camera is so high it places it on par with some much nicer but larger mirror DSLRs, its only advantage been smaller, a lot smaller. If you are a professional photographer I can save you a lot of time, the choice is simple, do you want to shoot video or do you plan to use this camera as a backup?If you are a still photographer this HX20V model is by far the worse possible choice, stay away from this model and take a look at the Sony NEX series instead. The high-end NEX is the best camera in the market right now, in some way better than Canon and Nikon DSLRs . However, if you are looking for a pocket camera with a super telephoto (20x) to shoot 1080p VIDEO then you will love it. This camera has the best video stabilizer in the industry. Specially recommended for videotaping action and sports.Sadly, all stills taken with this camera suffer from a STRONG watercolor effect (I call it a defect for obvious reasons), pictures look like paintings made out of color blotches, specially if taken at full telephoto,  there is no \"mode\" to cancel out this awful effect and it is not to be confused with the included \"watercolor\" mode. It gets much worse if you use the Night TIme modes. It is quite apparent even at 100% and there is no way to get rid of it in Photoshop. This watercolor effect is how Sony decided to hide the noise from the tiny sensor. For that reason, I do not recommend this camera for serious photographers.The good news is: the battery life is far above all other cameras in this class. The focusing speed is also far above any camera including the most professional DSLRs (one of the advantages of having a tiny lens)Update: I mentioned this camera takes excellent HD video because the stabilizer works perfectly even at 20x zoom, this is still true but only in bright daylight. It is best to use another camera to shoot video in darker environments, i.e. churches, indoor concerts or any other indoor or night-time activity. Surprisingly the HX20V is not sensitive enough to record video in low light at all.Another annoying aspect of this camera is that it takes too long to save each photo to the memory card so you tend to loose a lot of great opportunities. Again reinforcing my statement that this camera is terrible for still photographers. It is perfect for video recording on a sunny beach, not much else.", "Date": "June 4, 2012"}, {"Title": "Takes beautiful pictures", "Author": "D \"D\"", "ReviewID": "RGBLNXA5TDKE5", "Overall": "4.0", "Content": "UPDATE- I have been using it a few days now and the pictures are lovely in any light, I mainly use the auto setting and the pictures are terrific like that. Whatever glitch or problem I had accessing the picture finally resolved and I am able to access both from the camera memory and the sd card so I am happy. The missing star is for the placement of the flash, very annoying to me, I find it somewhat awkward to hold so that I am not pressing on the flash, great camera otherwise.This little camera will fit in your pocket and has a nice telephoto lens. So easy to travel with and take true to color photos, takes wonderful photos in a darkened room. I took pictures of my cat and she was in a darker area of the room and normally the picture would have turned out dark but this camera automatically lightened the picture just right so that I could see her face clearly.One problem I am having since I don't have an extra SD card right now I was just using the cameras memory to take pictures and apparently you can't transfer the pictures to the computer if it doesn't have a SD card in it, I am told that there are no pictures or movies available? I can see the pictures on the camera but I can't get them transferred? Maybe I am doing something wrong but so far I haven't figured it out. I will have to get a SD card and then update this as to how it works then.The flash is annoying, it is right where I place my finger to stabilize the camera so I have to remember to hold it differently so that the flash is able to emerge from the camera when it is needed. The zoom feature optical and digital are great, you can zero in on almost anything. I love the Auto setting it manages the picture for you and makes really great pictures, they are clear high definition.The manual that comes with it really doesn't tell you much about the different setting and controls, sure would have been nice to have some explanations on these features.I wish it would have come with a sd card since the pictures can't be easily transferred unless you have a sd card in the camera, I just don't have an extra one right now so that is something I will have to get to finish testing it.The battery does charge pretty quickly using the USB charger)it works by plugging in the camera USB itself, it is not a separate charger but that is OK, I don't have to remove the battery from the camera to charge it)The LCD screen is very sharp and clear but outside in the bright sunlight it is difficult to see but most LCD screens are difficult to see in sunlight.I will post back after I try out with a sd card.If someone knows how to transfer the photos from the camera memory to the computer let me know, I have win7 and windows and the program that comes with the camera can't find any pictures?BTW the install of the program is very easy and seems to work fine on win7, it is included on the camera and will semi auto install once you plug the camera into the computer.", "Date": "May 26, 2012"}, {"Title": "Sony HX20V..", "Author": "Christopher Binns", "ReviewID": "R2PXBLBMH03WGT", "Overall": "4.0", "Content": "Excellent,near-instantaneous, reliable auto-focusing, rock solid image stability, especially during video, virtually instantaneous start-up, sublime ergonomics, a killer 20X zoom and an absolutely stunning as-good-as-any-camcorder 1080p/60fps video, marred by sub-standard picture quality. I can't recommend this camera without listing the caveats. An aggressive, un-defeatable noise reduction incentive has been added, perhaps to offset the inherent and unavoidable noise that results from too many pixels crammed onto a tiny sensor. Photos are reasonably sharp but upon normal view but they're definitely not recommended to for pixel-peepers. The defocus effect is sensational, as is the HDR. No other camera in this price range offers this much! A 20X optical/40X digital zoom pocket camera with WiFi, 3D, a host of picture effects, exceptional tactility and build quality and HD video!", "Date": "December 7, 2012"}, {"Title": "not happy", "Author": "M. Linda Allen", "ReviewID": "R3JPPIJOS9JTU8", "Overall": "3.0", "Content": "I am somewhat disappointed in this camera..  First of all the camera feels rather cheap. , plastic.  Secondly the pop-up flash is in an awkward place.  Right where you hold the camera .  I'd say, having owned a Panasonic, the Sony lens isn't as good ..  If I hadn't already returned one camera i would have returned this one also.Linda Allen", "Date": "March 1, 2013"}, {"Title": "Best Camera I Ever Owned", "Author": "E-Myer", "ReviewID": "R2117URGYEPROE", "Overall": "5.0", "Content": "when i first got this camera the first thing i did is change the battery i been toldalways charge new fresh battery all times. i did just that..when i used this camerai was empress how the picture looked.. is the best camera i ever Owned i wouldrecommend this camera to everyone the zoom is freakin awsum i have 0 problem with this camerathis is my 2nd Sony CyberShot Camera i Owned because the 1st one i owned it got old i hadto replace it with this one trust me when you get this camera you wont be disappointedi cant complain 1 thing about this camera the only thing i said was this is the best camera iever used", "Date": "June 1, 2012"}, {"Title": "Christmas Gift", "Author": "Bookster", "ReviewID": "R3E73U4Z422QC", "Overall": "5.0", "Content": "The camera is a Christmas gift for my husband - he did a lot of research because he loves taking pictures and chose the Sony Cyber-shot.  At present, and it is a present, it is sitting under our Christmas tree waiting for Christmas morning.", "Date": "December 20, 2012"}, {"Title": "Do not buy from ---- DAHMART/ KNOCKOUT DEALS ---- Refurbished especially used items!", "Author": "Roma", "ReviewID": "R3TZSIPR2JF25A", "Overall": "1.0", "Content": "Information about DAHMART seller. USED or REFURBISHED products!!!!!Item does not correspond to the item that was described(the camera has a defective part on the top of the screen).They offered me a partial refund for bad camera.( i bought good item, they sent me bad one, and offering me some money for it,  i not understand how it is possible?!.)I asked to get a good replacement!.After when they received item it took some time after that, so i started worried about time(time is priority for me), and ask them a tracking number of my replacement. after couple days i received message from Amazon about refund. Basically they ignore me after that! They don't want to work with me... they just made me a refund... rather than make a replacement as i asked them!(they still selling this item)Most important thing is that refund amount is different than that i was paid for the item!!!!Now need to wait for refund and buy one from the other seller.(my estimate of time on this moment...probably it can take hell of time to get correct refund... then buy another product from other seller... )I'm really disappointed about this and wherein seller has lots of good Feedbacks.Update 10.27.2013Beware they changed the company name from  DAHMART to KNOCKOUT DEALS!!!", "Date": "August 27, 2013"}, {"Title": "Great images, but NOT if you never want to view them on an ipad or your computer.", "Author": "Goriano", "ReviewID": "R316CWCFJW0ES9", "Overall": "2.0", "Content": "First of all the camera and its images/video are great. The housing is a little flimsy and the buttons are kind of cheap. The camera is easy to use. However, that's as far as it goes. It all stops when it's time to view your images or video on another devise. I have an apple camera connecting kit that worked well with my older Canon camera, but would not recognize the images from this camera on my ipad. After trying many times I looked on Google and found numerous complaints about the same isse. I forgave that one flaw and thought I'll just copy images and video to my laptop... no such luck! The Sony Software \"Play Memories\" downloaded well, but would not recognize the camera. I even bought the Amazon suggested \"Transcend\" 64 GB memory stick and no luck what so ever! Sadly, today I returned the camera to Amazon.", "Date": "October 7, 2012"}, {"Title": "Battery Info", "Author": "bulbrich", "ReviewID": "R344GGSD3SCDOE", "Overall": "3.0", "Content": "Camera came with a standard Lithium battery, which did not impress me at all. I did order a second InfolLitiuhm battery for 26 bucks, which shows how many mins of battery life are left. Disappointed with Sony on this. They should include the best instead of the cheapest.", "Date": "June 21, 2012"}, {"Title": "Dont buy - close up pics have a shadow on the bottom right", "Author": "ekta", "ReviewID": "RMYAWS8SJAEE1", "Overall": "1.0", "Content": "We ordered this camera to take pics of our new born baby but all close up pics show a shadow on the bottom right of the pic even when using the flash. I returned the camera and had amazon ship me a replacement. However, the problem persisted in the replacement camera as well. I cant believe Sony built a camera with such an obvious manufacturing defect! DO NOT BUY.", "Date": "September 15, 2012"}], "ProductInfo": {"Price": "$409.88", "Features": "18.2 megapixels \"Exmor R\" CMOS sensor for superior low-light performance\n20X optical zoom,3.0-inch LCD\nRechargeable Lithium-Ion Battery Pack\nGPS and Compass record shot location & direction\nOptical SteadyShot image stabilization with 3-way Active Mode,1-Year Limited Parts & 90-Day Labor Warranty", "Name": "Sony Cyber-shot DSC-HX20V 18.2 MP Exmor R CMOS Digital Camera with 20x Optical Zoom and 3.0-inch LCD (Black) (2012 Model)", "ImgURL": "http://ecx.images-amazon.com/images/I/41232SLY2hL._SX300_.jpg", "ProductID": "B006K551WQ"}}