{"Reviews": [{"Title": "Everything I hoped it would be", "Author": "Brian", "ReviewID": "R143WZK3GGKFN5", "Overall": "5.0", "Content": "I have been an amateur photographer since I got a Asahi Pentax spotmatic II while I was in the army in 1971. I eventually had many lenses and accessories for it. When it was damaged beyond repair I got a Nikon autofocus 35mm. I was happy with that too. This is my 3rd Fuji digital camera, I loved the first one which I eventually gave to my son and replaced with an S1800 which I did not like. I did a lot of research before I settled on the HS25. The reviews were very good on the HS20 except for noise. The HS25 features a redesigned CMOS to improve that. I was not interested in RAW shooting and I like using AA batteries. Those were the main differences between the HS25 and the HS30 which is $100.00 more. I just unboxed mine last night and spent a lot of time with the owners manual starting to learn all the features available. First, I love the feel of the camera, the quality is first rate. I looked at the Canon SX40 and while the reviews were good, it felt and looked cheap.This camera looks expensive. I really like the manual zoom lens. It brings me back to the 35mm days and I feel like I have better control.It seems very smooth and natural. The autofocus is very fast which was important to me. I have only taken about 10 photos so far in my house at night without a flash and I am pleased with them. I can't wait to take some pictures of the hummingbirds in my back yard. I will come back and update this report. So far I am extremely pleased with my purchase. As always, Amazon had the best price and got it to me quickly.UPDATE: I have taken a variety of pictures with my new camera and I couldn't be happier! Pictures of my grandkids that would have been blurred with my old camera are very good. I took some macros of flowers and a couple closeups of my dogs. All perfect. The manual zoom is now just intuitive, memories of my old 35mm days I guess. I recommend it completely.NEW UPDATE: It's been a week now and as I learn more it just keeps getting better. There is a website: dpreview.com that has camera tests etc, but also has forums where camera owners share tips, advice and photos. It is very helpful.", "Date": "April 14, 2012"}, {"Title": "Decent for the price... pros and cons...", "Author": "Gregory A. Henry \"atlantagreg\"", "ReviewID": "R3143FDOIV9YTB", "Overall": "3.0", "Content": "Much has already been written about this model already, so I'll just give my pro and con list for the most part, based on my experience.  While I do stock photography and use a DSLR for that, I wanted a more casual camera for around the house, and I'm not lofty in my expectations.  I know what you should (and should not) expect for a price (and from Fuji, based on past Fuji camera experience).Pro List:1)  Manual Zoom ring gives the \"feel\" of a DSLR w/manual focusing available.2)  Ability to use filters on lens.3)  Good hand grip and handling overall.  Can use in full auto or lots of manual controls.4)  Non-proprietary AA batteries make it handy when traveling.  I suggest \"eneloop\" rechargeable brand.5)  Overall good image quality (for a non-pro camera level) once you learn how to leave the full auto and adjust settings.6)  Tilt LCD.7)  Hot shoe for external flash (if you feel the need for it).8)  Very fast focusing under most conditions.Con List:1)  Electronic eye viewfinder is very low res and very small.2)  Battery compartment door shifts when gripping camera a bit (irritating).3)  Image stabilization is sensor shift type - not lens type, so not as effective (and nearly worthless at 700mm full zoom).4)  Image quality is only best when you use the priority modes (7 megapixel resolution give or take) as opposed to full resolution mode.5)  Blows highlights easily unless you use the highlight priority mode.6)  No printed instruction book - can be hard to learn to use all manual items for those who might not be tech heads.I would recommend this camera if you get it under $300 via Amazon or Costco who is also offering it for this price, and as long as you realize that while it LOOKS like a digital SLR, it is NOT a digital SLR.  If you completely rely on the camera's full auto mode, then the image quality is \"ok\".  If you take the time to read the CD manual and make some more manual adjustments to the settings outside of auto mode, then I bump up the image quality to \"good\".  Using the camera at it's full 16mp resolution produces the poorest results.  Once you get a couple of priority mode settings down and reduce the photos to a smaller size in-camera at around 7 megapixels, then images improve a good deal; of course, this means in order to get the best from this camera, you're sacrificing pixels - and you're paying essentially for a 7 megapixel camera instead of a 16 megapixel camera. Being able to use AA batteries is a plus for travelers.My largest complaint is the type of image stabilization (IS) that is used in this camera, where the sensor itself is \"shifted\" instead of the lens having a stabilizing mechanism inside of it.  Sensor shift IS is not as effective, and as a result, I found that when using this camera at full 30X zoom, I rarely get usable photos - even in bright sunny conditions and even when allowing the camera to up the sensitivity automatically to up to 400iso.  Backing it off to around 500mm (per the guide that's printed on the lens barrel) fixes this for the most part, and the images are once again sharp, though this means it's not truly a 30X camera if you can't really use the zoom fully without a tripod.  Not a great choice for bird and wildlife watchers if you expect the full zoom out of it to work perfectly, then.Overall grade based on the level of camera it is, who it's aimed at, and price = B-", "Date": "August 26, 2012"}, {"Title": "A PLEASED CONSUMER", "Author": "Billy D.", "ReviewID": "R1CF9HZQGT9BXJ", "Overall": "5.0", "Content": "Greetings,  I am very pleased with my HS25EXR.  I am aware that it is not a Nikon D4.  However, this Fuji entry is remarkable in its ability to capture sharp, clean (not a lot of noise) images.  I slide many of them over to Lightroom 3.6 for further quality adjustment. I was a catalogue/portrait photographer in the 80's. I'm used to shooting with Bronica 6x6, Nikon F3, Mamiya 6x4.5, and 4x5's, etc. I do suggest purchasing this camera, unless you have $5999.99 for a Nikon D4, body only (no lens). I have put my HS25EXR thru the paces and found it to be a useful addition.David Messinger, Sr.", "Date": "May 8, 2012"}, {"Title": "About Fujifilm cameras Finepix HS25EXR and Finepix HS30EXR", "Author": "ilir hashorva", "ReviewID": "R3T3LGLFX309E8", "Overall": "5.0", "Content": "About Fujifilm cameras Finepix HS25EXR and Finepix HS30EXRFinally i have received a Fujifilm camera from Amazon. The delivery was super fast. Although both cameras Fujifilm Finepix HS25 EXR and Fujifil Finepix HS30 EXR are almost similar, I purchased the first one not because I wanted to spare $100, but because I liked its batteries: standard 2AA rechargeable Ni-Mh.I chose between Fujifilm Finepix and Canon Power Shot SX40HS or Nikon Coolpix P510, Fujifilm even the other two cameras have a longer optical zoom: Canon 40, Nikon 41,7 and Fuji 30, because:- Fuji has external flesh, and Nikon hasn't.- Fuji works with standard batteries and Canon and Nikon do not.- Fuji has a wider diapason of shutter speed and aperture.- Fuji has a larger sensor which gives a better dynamic range, and against Canon, has more pixels.- Fuji camera is a more versatile than Canon or Nikon. It has a lot of features, more than you will need.- Fuji uses a new sensor called EXR which is said to work better than other sensors, although I cannot confirm this.- Fuji has manual zoom ring, instead of electric zoom, which is more convenient, more professional like and gives longer battery life.- Fuji has a 58 mm thread so you can add filters or a teleconverter, the others do not have.- Fuji gives you the possibility to shoot in 3D. I made a test and received a perfect 3D picture. No other camera does this. I was amazed.I can not compare image quality of cameras because I do not have Canon and Nikon cameras, but I do not expect any conspicuous difference.For all these, I think that the Fujifilm Finepix HS25EXR, or HS30EXR are today the best bridge SRL-like cameras in the market. Their prices are reasonable.What I do not like to these Fuji cameras:- Awful instruction booklet, HS25EXR dos not have at all. Its booklet is in the CD.- Fujifilm does not have an exposure live view.  So you can not see on the LCD what the final picture will look like (how light or dark it will be) before you actually take the shot.- The image stabilization is not too good, although I do not know how good is in Canon or Nikon cameras especially at lower speeds or in high zooms when it is needed more.", "Date": "July 10, 2012"}, {"Title": "A camera that's beyond intelligent", "Author": "Renfor", "ReviewID": "R2T6T5LF9XPRKU", "Overall": "5.0", "Content": "Ignore those who gave this camera a bad review. They have to be (a) Pros accustomed to $5000 cameras (b) Employees of competing makes (c) Complete idiots who can't be bothered to read the manual or (d) Just happened to get a lemon. My guess is: (b).As for me, I can't claim a lot of experience with other makes and their features, this is just my 4th digital camera. But I can't imagine how a camera could be smarter than the Fujifilm HS25EXR. In fact - call me naïve - there are features on it that I couldn't imagine ANY camera at ANY price could EVER have.Take night shots. Other cameras naturally extend the exposure time. But unless you're using a tripod, you can't avoid a bit of tremor, which makes the image look like scribblings instead of dots. But it seems that the HS25 takes a number of separate shots, all with a fast shutter time, then internally repositions each frame to neutralize any camera movement, and then superimposes all to get a sharp and steady final image. Whoa! That is *major-league* engineering.The HS25 uses the same shot-matching ability to produce silky-smooth, professional-grade panoramas. You can even do a 360-degree pan, which is impossible to shoot hand-held without jumps and jerks unless you're sitting on a piano stool - but the HS25 totally removes them if you do it right (just don't scan too fast or too slow - it takes a bit of practice - but the camera will tell you what, if anything, you're doing wrong!). It can also take high definition video AND snap still pictures at the same time, without interrupting the video.As in all other cameras, the auto-focus mode is far from perfect but this one lets you fine-tune it manually. And when it senses that you touch the focusing ring, it magnifies temporarily the center of the screen or viewfinder to make it easier for you, then goes back to your original framing. Double whoa! There's even an eye sensor that switches automatically from the LCD screen to the viewfinder when you move the viewfinder to eye level. I could go on, there's a dozen other smart and useful features.I figured that with all those goodies the lens must be mediocre, but up to its 30X, it's pretty good. Not pro quality but fine for an amateur photographer. The only downsides I have found are: (1) Unless you're happy with the auto modes - and you could very well be - the HS25 is hugely complex, with a 142-page user manual on a CD, and a lot of things to get used to. I've had it for about a month and with a lot of practice and trial & error, I still can't claim to master it thoroughly. (2) It's a little slow processing the shots especially when shooting video or using auto bracketing (but keep in mind it's a 12 Mpix image) Then (3) The darker parts of my images are often grainy even at ISO 400 - never mind at 12800! (but there's ways to work around that post facto).In conclusion: if I had seen the manual on this thing but not its price, I would have guessed about $1500. Bargain alert!", "Date": "July 25, 2012"}, {"Title": "Fujifilm FinePix HS25EXR Digital Camera", "Author": "azinheira", "ReviewID": "R2SNLA5S30WFPD", "Overall": "5.0", "Content": "Pros:Easy to useEXR mode excellentManual controlsExternal Flash or use remote for any flash brand.Better and fast focus than my coolpix P500Manual zoom (will save battery).30X Zoom great but use a tripod.Battery AA are great so you don't have to buy extra.Memory card slot located inside the grip so you don't have to open the battery compartment anymore to replace the memory card.Solid construction.Great colors and super macro photos, not very lucky with weather for the pass 2 weekends to go out and try outdoors.This camera is away better than all the previous I had from NIKON,5700,P5100,P500.Cons: the cover so far on the battery compartment moves a bit but after batteries installed not so much.will be great for Fuji to add RAW files.Construction with a lot off pastic but with this price Ok.See a lot off cameras for over 400.00 with solid construction and image quality very poor like my coolpix 5100 very hard to have an image in focus on any movement, this one i have way better images.", "Date": "September 22, 2012"}, {"Title": "Very Nice Camera", "Author": "MALaakso", "ReviewID": "R1163K4UK8Z0EO", "Overall": "5.0", "Content": "I am attracted by the greater \"latitude\" of Fujiflm cameras. The hs20exr had major issues so I delayed buying. Reviews were excellent by professional or near pro photographers on the hs25exr, so in mid June I took the plunge and purchased a used one.So far I am thrilled with this camera. My training is in scientific and medical photography. I am accustomed to shooting everything manual, particularly because I like natural lighting situations that tend to befuddle a camera's auto function. Digital is nice for the instant feedback and exposure adjustment if necessary. The hs25exr does great in manual mode, bringing up well-saturated colors.I have been experimenting with EXR mode, however, the \"auto everything\" function of this camera. So far so good. I'd call these photos largely passable. My only quibble is that the camera errs on overexposing, particularly faces. They print out OK, only less saturated colors than I like. Possibly there is a way to adjust this that I have not yet discovered.Yes, the camera takes some time to process some images, particularly night shots. However, they do look like night shots. The multiple shots combined into one image works very well; just hold the camera as steady as possible while it shoots. I haven't yet tried the multiple exposure mode for fast action shots, but then that isn't my typical type of photography.I took the camera with me from the Northwest to Houston for a visit with one of my sons and his family. EXR mode performed well under many varied conditions from full sun to a night time parade, indoors and outdoors, backlit scenes and sidelit, even from the jet's window. When I wanted total say in the photograph, I switched to manual mode.I even experimented with the tiltable back screen for hip-level kid shots or overhead crowd shots. Very convenient, though I remain an SLR fan and prefer the camera up to my face. I mostly use the viewfinder.I like the 24mm to 700mm zoom lens 135 equivalent. These are pretty much the extremes that I prefer. Autofocus failed at times. I know to focus on a high contrast area to help out the machinery in the camera, so a retry brought the scene accurately into focus. I tend to be a deliberate shooter, so this wasn't a problem for me. Could be frustrating if one shoots hard and fast.This camera has met my needs so far. Having shied away from Auto mode, I have been won over for all but the most important photographs. I was asked to shoot some business portraits for a home page. In manual mode with a strong flash on the hotshoe, aimed at the ceiling with a white card taped to the back of the flash, a couple of exposure checks and we did the deed. Quick and easy and the folks liked the photos.I don't need a very high end camera at this point, but I do need good quality. I recommend this camera for both point-and-shoot and more exacting work.", "Date": "July 13, 2012"}, {"Title": "Solid Bridge Camera", "Author": "Jeffrey Meyers \"Jeff\"", "ReviewID": "R3V1H2TYP63SRJ", "Overall": "4.0", "Content": "I just started using the HS25EXR and find that it will suit me very well. I did a lot of research before deciding which camera to buy. I wanted something more than what I had, but I could not afford to get into the DSLR that I wanted, so I picked this. It's not likely to work for everyone. I was looking for something that offered manual options, great images and solid video performance. If you want a huge auto zoom and detachable lenses, you won't be happy with this. My initial tests show that it's easy to use with a lot of advanced features, including some I will likely never use. I like the heft of the camera and the way it fits in my hand. I don't feel like it will slip away from me during use. I feel like I have good control over it and the buttons are fairly easy to access. I still have more testing to do, and I'm one who likes to decipher the use manuals so on first blush:Pros:- Solid Camera- Great images- HD video- Easy to use- Very nice, clear digital display- Fairly intuitive if you just want to start using it out of the box- Huge zoomPossible cons:- The manual focus ring doesn't seem as responsive as the auto focus, but there are ways to work with that.- Manual is not clear whether you can connect this and use it from an optional (not included) power source beyond the batteries.I plan on looking into the power source question and I am thrilled to be able to add a protective (or other) 58 mm lens filter to the camera.Some people might complain that there is no full printed manual, but that is easy to over come. It comes on a CD and the PDF file is easy to copy and transfer as needed to use on any device or print as you like.", "Date": "December 26, 2012"}, {"Title": "Everything You Could Want in a Camera", "Author": "laini greenstein", "ReviewID": "R3FPYCSJHP28MK", "Overall": "5.0", "Content": "I recently purchased this camera both for myself, and for the public library I work at.  The camera feels like a $650 DSR.  I cannot believe how little it cost.Best features if you are just looking to point and shoot and do HD video, why you should get THIS and not a camera for $100 less:There is NO lag time from when you press the button to take a photo until the photo is taken.  You see it, you press the button, the photo appears on your display exactly as you saw itAmazing performance in low light.  I rarely need the flash!The Flash is AMAZING.  You know how sometimes the flash overexposes everyone?  Not here.  With my old camera, also a $250 product, I used to have to stand a bit away from the object or person I was photographing, and then, zoom in so I could use the flash.  Otherwise, there was overexposure.  Here, I can stand one foot from the person I am photographing, and they will be perfectly exposed.  You would not even know I used a flash!Zoom--oh my goodness, this is amazing! Pictures are still super sharp even after getting way up close.Video--seemless.  Push a button to start recording.  Press the same button to stop, and you can immediately start shooting photos again.  The video is HD.  Wonderful.Batteries--uses 4 AA.  Just get yourself a set of rechargeables and you are good.  You do not need to find a fancy kind or plug in the entire camera.  That said, I keep back up batteries with me.  The camera does NOT use up batteries quickly at all.  That was a problem with my old camera.  The batteries have a long life here, but recharagable seems best to me.Connection to devices.  The camera comes with cables to connect it to all of our devices for easy download of pictures and video.This is just about one percent of the reasons to buy this camera.I will throw in that you can do real manual photography, like in the old days, artistic stuff, with this item.  I was a black and white darkroom girl, and if I want to adjust shutter and F stop, I can do it all the way!  Just like with my old Nikkon.Enjoy this one!", "Date": "February 10, 2013"}, {"Title": "So far so good!", "Author": "Ainsley", "ReviewID": "R2VX9US1WVEMYU", "Overall": "5.0", "Content": "I wanted to upgrade my point and shoot camera, but I'm an intermediate photographer and frequently use a DSLR. I wanted something that gave me the options of a DSLR but the quickness and ease of a point and shoot. The main reason I wanted this camera (actually the HS30EXR) is because of the manual zoom. Sony has one that I played around with in the store that has a manual zoom and it seemed pretty awesome but with a price tag of $400+ dollars, that was a no go.My husband and I went back and forth on getting it, and at first we got the Finepix S4500 for a steal at Target. Took it for a test drive, and I didn't like it much (it's a good camera for a beginner, though). Finally my husband said I could get this camera so I took it out the next day for a test drive and even though it was overcast all day, it still took amazing pictures. The picture quality goes up even more in optimal weather conditions.The manual zoom makes it a snap to get in (or out) on the subject instead of waiting....waiting, for the zoom to go aaalllll the way out or in, which is something I do frequently and it usually eats up the battery quick. I took at least 200 (more) photos and didn't have to change the batteries until I started testing out the macro (another battery eater).I can't tell you much about the flash. I don't use it often. I mostly judge a camera by how well it does in low light situations since 95% of the time I only use natural lighting. This one rates about 8/10 for me. I deleted the picture but the first night I had it I turned off all the lights in the room except the tv, which was behind the object I was shooting and facing the same direction as me. I took a couple of shots in manual and the pictures were grainy mostly due to user laziness, but not horrible. Then I took a couple of shots using the camera's low lighting settings (there's a couple of them)and I was pretty surprised at how clear they were. There was still some grain, but for me it was something I could deal with (and easily fix in photoshop). But the object (a clear water jug) was very much in focus, lines were crisp.Macro is amazing. Even more so when you add the digital zoom. I think the HS30EXR flash adjusts for the macro. I don't know if this one does or not, the one time I popped the flash it didn't look like it moved. I don't usually use it anyway but sometimes in macro you just need it. But it's super sharp. I took a picture of some kind of berry something on a tree and didn't even have to edit the picture. (I'll post it here)The tilt screen on this comes in handy too.All in all, this camera is pretty amazing so far. I'll keep adding to this as I go along since I've only really used it twice. Supposedly you can use filters with it. I see the threads on the lens, so I'll give it a try and post about that as well.Oh and for those who care about things like this; it's really comfortable to hold. Feels really natural in the hand and has a good weight to it while still feeling pretty light. I will say though that the battery cover on mine does shift once in a while. I don't know if it's just me though. But it's not like a \"it's about to come loose\" shift. Just more of a \"settling\" shift. Like a house I guess. It only did it a few times when I held it a certain way and had to place my finger on it. But it doesn't bother me.", "Date": "January 12, 2013"}, {"Title": "Great Camera", "Author": "taak", "ReviewID": "R1MYLAZ4MIZ58J", "Overall": "5.0", "Content": "I've owened several other Fujifilm FinePix cameras and this one is by far the best.  I like that you can manually zoom in on your subject.  It's very easy to use.  I took my daughter's Senior pictures with it and had people asking where I had her pictures taken.  They were surprised to hear that I took them myself on the HS25EXR.  I also take a lot of soccer and basketball pictures.  They turn out great even when the subject is moving quickly.  I would recommend this camera to anyone who would like a more professional type camera but doesn't want to spend $700.  This camera takes just as good of pictures and I spent around $300 on it.", "Date": "August 19, 2012"}, {"Title": "Great Camera if you like learning to use its features", "Author": "edm", "ReviewID": "R2GZUT3GZ1QAX", "Overall": "5.0", "Content": "I have owned the Hs25 for several months now and love it.  Its a great camera that can take great pictures, see some of those posted.  Love the manual zoom much easier and quicker to use than the auto zooms on most of the bridge cameras.  Love the feature set.  I have not run into a single situation so far that I could not get excellent pictures in as long as I was willing to learn to use the camera settings available.  You can take almost any picture in any situation without having to add anything additional to the camera, I've shot everything from extreme macro shots (a raindrop with reflections on a leaf) to sunsets, sunrises, pictures indoors, at the New England Aquarium, I even took pictures for someone's wedding (unpaid) for a friend and they came out great.  So if you don't mind a bit of a learning curve and enjoying being able to get excellent pictures the HS25 is a great camera its not a DSLR but it can give you many times near DSLR results as you learn to use the feature set of the camera.  Awesome Camera can't say enough good things about it.", "Date": "March 1, 2013"}, {"Title": "Almost excellant", "Author": "Louis Sabo", "ReviewID": "R2NRKVA51KL264", "Overall": "5.0", "Content": "There are three criticisms I have of the Fujifilm HS25EXR.  One is cosmetic and the other two are technical.  The display of information has a little less than professional appearance - not a big issue.Try connecting the camera to your computer before installing the software.  If it shows up on the file menu then the software is not needed.  If you install the software it will make the Photo Album appear each and every time a device is inserted into a USB.  Then it will have to be disabled in msconfig.exe.  This is very annoying.The shutter speed in Aperture Priority, aperture in Shutter Priority and both in Program Mode are only displayed if the Dynamic Range is not set to Auto.  I prefer they are always displayed and find this disappointing.What I do like about the camera is a feature in the Program Mode.  Once the camera is held steady the aperture can be adjusted smaller if desired.  I am very satisfied with this.The number of selections for Panorama impressed me (120, 180 and 360).  I can see a lot of potential here for great pictures and special purpose photography.  I chose the HS25 because I have hopes of hiking a national trail and do not want to be waiting in lines to recharge batteries.  The absence of zoom motor noise is essential for wildlife photography.At no time have I ever been disappointed with the resolution of photos from my 5MP Kodak P850.  But I can see room for improvement of detail on grand landscapes and at 16MP I expect the HS25 will deliver.", "Date": "February 12, 2013"}, {"Title": "Very Good Start for Digital", "Author": "F. McLemore \"4tun81\"", "ReviewID": "R1P4U42IWO5SL8", "Overall": "4.0", "Content": "This is my first digital camera. I quit my photography business for five years, and then resumed it, so I didn't buy any digital equipment during that time. I would give this five stars, because it's a great camera. But I don't have anything else to compare it with because it's my first digital camera, and I just started using it. Hence, the four stars. But I wouldn't be surprised to update this later and make it five.However - BIG however - you should definitely buy this as a starter camera. I have been VERY pleased with this. I did my first shoot with it last weekend, and the pictures blew me away. The sixteen megapixels (can you believe a camera in this price range has 16mp? Neither can I) meant super-high-quality pictures - certainly up to my standards, which are astronomical. The color in those pictures was bold, bright, and clear, the way I like it. Fuji lenses are used in scientific applications, and it shows. The sharpness of the lenses could cut your finger. And I love the looooong zoom range - 24-720 is PRETTTTYYYY impressive. I wanted a bridge/hybrid camera because I don't want to buy, carry, and change a bunch of lenses. Carrying this thing is a piece of cake. Very lightweight, and convenient.The settings will blow you away. It has settings I've never seen on any other camera, even on my Canons (which I still love): a party setting, a beach setting, even settings for dogs and cats - I kid you not. You can adjust the sharpness, and the color, which I like. Overall, I've had almost too much fun experimenting with this camera. By the time I did that shoot last weekend, I knew the camera well enough to figure out what settings I wanted to use - and it didn't disappoint. I didn't have to change anything during the shoot, and I got the results I wanted.I like that it uses 4 AA batteries. I don't have to order a specific battery for it, which might mean waiting for it when I need it most, and I don't have to charge it, either. The only thing is, the batteries that come it with are some cheap kind that doesn't last. Get some Duracells instead.I've heard that some monitors aren't really accurate in terms of color, sharpness, and especially exposure, so I wasn't sure I'd trust this one. Well, I do now. Everything was spot-on accurate.I do have to be careful about highlights on some settings, but this camera has so many settings that I can change them easily if I don't like how the highlights look. Not a problem, actually.I started considering Fujifilm cameras when Amazon sent me a notice of a sale on them. Thank you, Amazon! The Fujifilm line fits all my needs. In fact, now I'm planning to buy the hs50exr, one of the higher-end cameras.If you're looking for a digital camera that has a VERY high MP range, good sharpness, great settings that are fun to use, a long zoom range, and is lightweight, and convenient, at an unbelievably low price, check this out. I'm still planning to use Canons, which are always terrific, but now Fujifilm will probably be my main brand from now on.Update, 4/20/13; I'm so pleased with this camera, I've put another one in my Amazon.com cart. I need another camera for my business, and I think it speaks volumes that a professional photographer would trust her business to THIS camera. I'm still planning to buy the hs50exr, but I want another hs25exr! (I think my plans to still use Canons are...kaput.)", "Date": "April 5, 2013"}, {"Title": "Great camera for my purpose!", "Author": "Marlene M. Desquitado \"Ellen\"", "ReviewID": "R2VGSS1GI1JAM5", "Overall": "5.0", "Content": "Bought this camera for a Hawaiian cruise. I was able to take many awesome pictures and videos including panoramic shots!Couldn't be happier with my purchase!", "Date": "March 20, 2013"}, {"Title": "Fine Pix HS25EXR....My take", "Author": "M H", "ReviewID": "R2QFRZAFPM8CZD", "Overall": "5.0", "Content": "Worth every penny...easy to use...produces stunning shots...lots of features...extra set of rechargable batteries and hand strap recommended.... no regrets so far...", "Date": "December 12, 2012"}, {"Title": "Great camera", "Author": "Shelby", "ReviewID": "R3754G42YW03KL", "Overall": "5.0", "Content": "Does a wonderful job. Great pictures under any light conditions. For the price a giant among its peers. Recommend this camera to anyone needing a good all around camera.", "Date": "October 19, 2012"}, {"Title": "Great camera, great price", "Author": "G.C.", "ReviewID": "R2OYA3WE1OYSO1", "Overall": "5.0", "Content": "This is a great camera for less than $300. Manual zoom and manual focus with manual shutter speed, manual aperture and manual ISO. Manual everything. This gives you detailed control over your picture. Automatic modes are also great. Also has a custom mode in which you can save your settings before hand for a particular event. I shoot low light theater presentations and can do test shots before they start and save settings. High iso's are pretty noisy, but overall its good. Has good grip and rubbery feel.** Lens hood gets in the way below 35mm zoom. Also gets in the way of built-in flash.", "Date": "November 5, 2012"}, {"Title": "I have to really try to screw up a shot.", "Author": "whomever", "ReviewID": "R1LZZ5RZ4KRGXD", "Overall": "5.0", "Content": "This is the best camera I've ever owned.  Whether or not it's \"professional grade,\" it performs very, very well, is easy to use, and delivers a very good image under impromptu circumstances and in the hands of an amateur.  It's the quickest camera that I've ever used, in terms of focusing and making quick consecutive shots.  You'll need to steady your arms with something or use a tripod if you're extending the zoom all the way to 30x, but that's the case with any zoom like that.  The controls are pretty easy to figure out, and you'll get great shots in auto settings, but have the option to tinker with fully manual controls.  It seems to have more auto-scene settings than most cameras.  I practically have to try to screw up a shot.  I've only had it for a month or two but use it quite a bit.  I'm only beginning to explore all of the other options, but for now, the image quality and performance are great and it does everything as advertised.  I've even gotten used to the manual zoom and kind of like it.", "Date": "October 10, 2012"}, {"Title": "Save money, be happier!", "Author": "ZeroWorries", "ReviewID": "R1X1FEMMITEUPJ", "Overall": "1.0", "Content": "I'm a long time fan of Fuji, but I suggest stepping down in cost to the \"S4500\", and getting a better product. I found the manual lens on the HS25EXR to be rough and loose. It could even be pushed in with slight pressure on the end. If there are any technical advantages to \"exr\", as suggested in advertising, I couldn't find any positive defferences in practice. On the other hand, I love the S4500.", "Date": "March 29, 2013"}, {"Title": "Could be better", "Author": "kyle", "ReviewID": "R27HJX26NTH1OO", "Overall": "3.0", "Content": "Great Camera.Except the focus went out on me. i get very grainy shots even with IOS 400.16MP3.0\" LCDIntellegent Digital ZoomAuto or Manual focus.Manual Zoom.Motion Panorama 360 (you can pick how long the panorama is)11 frames/s high speed contiuous shooting.Full HD Video & Photo.Can slow the shutter speed to 1sec.Many features and options to choose from.Preset features for:-Beach-Snow-Sunset-Fireworks-Night(2 settings)-Sports-Landscape-Cat-Dog-Portrait Enhancer-Portrait-Natural Light-Text-Flower-PartyVery close to an SLR. if i did not know any better i would not know the difference.", "Date": "March 16, 2013"}, {"Title": "Nice Camera", "Author": "DEMPZ", "ReviewID": "R3PX1MNMWEW2LG", "Overall": "5.0", "Content": "I just purchased this not long ago but have had the chance to take it out several times.  I have to say right out of the box and turned it on it was ready to perform without any setting changes. The ability to zoom in on objects and family from a distance was the real reason for getting this camera.  It's easy to use for a beginner like me and has additional features that once I become more efficient with it, can really fine tune the photo settings.  We love this camera!", "Date": "March 4, 2013"}, {"Title": "Love it", "Author": "Andrew B. Balas", "ReviewID": "R2QWWQ8ZHH0EM1", "Overall": "5.0", "Content": "Pics and video super sharp, nice and bright, way better then my wife's little digital camera that cost way more", "Date": "February 13, 2013"}, {"Title": "My second one!", "Author": "L. Tiu", "ReviewID": "R1NGEF10AV9ZVU", "Overall": "5.0", "Content": "I bought this camera somewhere else. Loved it. Buying a second one from here (Amazon) as a spare. Good cameras like these for the price and features are hard to come by. Low cost, AA batteries, great quality pictures, easy to use, fast focus, fast shot to shot cycle times, zoom, 16 megapixels, large SD card compatibility (32+ GB), high iso, fast shutter speeds. Hot external flash shoe too ... works well with my generic external flash units.", "Date": "January 17, 2013"}, {"Title": "Fuji got it right with this one", "Author": "Ancient Coin", "ReviewID": "R15HMWVSPJUC6D", "Overall": "5.0", "Content": "I've owned this camera for several months, and really like it. It does everything that it is supposed to do, and does it as it is supposed to. Sanyo Eneloop batteries are really great for this camera. The Eneloops keep their charge for several years. This makes your camera ready for instant use, anywhere and anytime. Another big plus is the fact that the Eneloops have lower internal resistance and higher current output; this speeds the camera up, and you have a really nice usable camera that operates at a higher speed than none eneloop cameras. The only thing that might have been better is if the HS30EXR would have used AA batts instead of the type of battery that it does use. All in all, an excellent camera!", "Date": "December 5, 2012"}, {"Title": "artie", "Author": "art in illinois", "ReviewID": "R3GYX6FQUB2T1W", "Overall": "5.0", "Content": "So far I really like the Fuji HS25EXR.I am still in the learning phase but enjoy all the features. Ireally like the manual zoom and the picture quality.", "Date": "October 2, 2012"}, {"Title": "INCREDIBLE CAMERA!", "Author": "HR BRACK", "ReviewID": "R3LQISSWWMHBJ2", "Overall": "5.0", "Content": "I have been amazed and astounded at what this camera can do and there's no way you can beat it for the price.  The computer in it must be 100X what my first desktop computer was.  The videos, at 1080 dpi, are remarkable and SO EASY to take.  You can take 29 minutes of video at a time (much longer than any other still camera)and it takes less than half a second to store the 29 min. and start recording again.  Add a 32G SanDisc card and you can record up to 5.5 hours of video before needing to download.  Although it is a fixed-lens, there is NO NEED for additional lenses as its lens is from 24 to 720 mm.  You can shoot stills with B&W; or sepia and results are crystal clear.  It will do most anything you want and more -- I'm sure that I'll probably never figure out 90% of what it's capable of.  You will NOT BE sorry!", "Date": "June 3, 2013"}, {"Title": "Sunset Electronics is a Plus", "Author": "William Hunter", "ReviewID": "RA86Y9COIGXE3", "Overall": "5.0", "Content": "I bought the HS25EXR as a gift for my wife, but now I find I'm using it more the she is.  After reviewing a number of cameras in this price range I found the HS25EXR had all the components I desired. Sunset Electronics packaged and delivered the camera on time with no problems.  Great camera and service!", "Date": "June 1, 2013"}, {"Title": "Better than the more expensive ones", "Author": "Tarikh Jumeer \"Photography\"", "ReviewID": "R1OZYKY26SIOCF", "Overall": "5.0", "Content": "I have used many DSLRs in my life. From the light D80 to the heavy 7D with an L lens attached. But setting my hands on the HS25 was a pleasant surprise. I love the ergonomics. It feels good in your hands with all the commands you need at the touch of buttons. For ex, the ISO can be set by a direct button. Very customisable. All necessary info are in the viewfinder/lcd screen. The manual zoom ring makes this bridge feel just like an SLR. Plus the zoom range is phenomenal. Someone said it was like having a mini telescope. Mind you, at longer focal length you do need higher shutter speed. But in sunlight I can safely say at ISO 400 you get crisp images.If you are used to DSLRs then you will love the HS25. It is simply one of a kind. I have put 4 Sanyo Alkaline batteries in it and I took so many pictures in India (hundreds) and they are still okay. I am truly impressed. Needless to say that the thing is also filled with numerous programs and modes which make picture taking easy. But as a semi-pro I content myself with the good old Aperture Priority mode.The only con that I find in this camera is the noise you get as soon as you push the ISO above 100. But unless you are doing commercial photography where your client are strict about noise levels, this shouldn't be an issue. Be aware of the presence of a slight distortion at open aperture. No big issue. The job is done at 99 percent.", "Date": "May 17, 2013"}, {"Title": "For the price, it's right.", "Author": "Discover888", "ReviewID": "R1BUD2DJ6HA10N", "Overall": "4.0", "Content": "I have used this camera for a trip across the Rocky Mountain from LA to Chicago. The result is, I like this camera. Being nearsighted and impatient, this camera gave me everything I needed. The only thing is, maybe I haven't get to the part in the instruction yet, when shooting with video function, the focus adjusted in and out when the subject moved within a short distance so it became blurred. But I am very pleased with portrait and landscape result. Would definitely recommend it for the like person as I am and don't need to worry about the name brand of the camera yet wanted taking excellent pictures to show.", "Date": "April 21, 2013"}, {"Title": "High Praise forFujifilm FinePix HS25EXR Digital", "Author": "Marlon", "ReviewID": "R2D6P88HXB8DX9", "Overall": "5.0", "Content": "I moved up from a point and shoot to this camera two weeks ago.  I am simply amazed by the ease of use and quality of images and videos.  For a couple hundred bucks this has opened up my eyes to the world of photography.  If you are looking for a great entry level camera that gives you unbelievable images and more features than a newbie will ever use, this is the one.  The low light feature was better than I thought it would be and the weight of the camera is manageable.  I am very happy with this choice.", "Date": "April 2, 2013"}, {"Title": "HS25EXR", "Author": "Douglas B. Petty \"dbp\"", "ReviewID": "R2L6EM0H6HZRUR", "Overall": "5.0", "Content": "Nice digital camera for the price. Has a great zoom ( manual zoom). This is not a point and shoot with auto focusing and zooming. Takes great pictures.", "Date": "March 25, 2013"}, {"Title": "very good camera", "Author": "emizael", "ReviewID": "R2JM865BSY0WK", "Overall": "5.0", "Content": "before buying the Fujifilm HS25 EXR had a nikon L810 and indeed the images are of very good quality and easy handling their stuff is very practical, pictures of hs 25 exr are excellent but a camera is a little more difficult to manage its complexity and number of functions is a matter yet to read well the instructions I give 5 stars because it has nothing to envy to a camera with removable goals as their ability to manage the focus manually gives the feeling of having the power in your hands, they recommend.", "Date": "March 25, 2013"}, {"Title": "fast shipping,good conditions and nice product", "Author": "hanchir emmanuel", "ReviewID": "R2UGSY5WPACJ3S", "Overall": "5.0", "Content": "this is the first revieuw i do because i need the time for nkow this camera,i love her,she do a good sceen,my old was a lumis fs28 et the fuji do beter pictures,the zoom is good.Thz noise of the batery when you moove is grrrrrrrrr............i hope fuju do an effort for next modelBut for 229$ stay a good deal", "Date": "March 25, 2013"}, {"Title": "GREAT CAMERA", "Author": "SONNY", "ReviewID": "R20C7S5HOBMTKN", "Overall": "5.0", "Content": "GREAT CAMERA FOR THE PRICE. SO FAR WE HAVE HAD NO PROBLEMS WITH ITS USE INDOORS AND OUT. WOULD RECOMMEND IT HIGHLY", "Date": "March 3, 2013"}, {"Title": "FinePix HS25EXR", "Author": "susan deaton", "ReviewID": "R1WHIFOR5CZLOO", "Overall": "4.0", "Content": "I have used this camera for a month and I put it through it's paces. I haven't used the video yet, but the other features work just fine. Great pictures. I am currently taking pictures of birds in shutter priority with manual focus.  I have gotten some very good feather detail and while it is not a dslr it does pretty good.", "Date": "February 26, 2013"}, {"Title": "Fantastic.", "Author": "Tulio Grego", "ReviewID": "R30X6M151STK6N", "Overall": "5.0", "Content": "Excellent camera. It was exactly what my wife and I we needed. Far exceeded our expectation. Easy to operate with my wife and a lot of resources to me.", "Date": "February 22, 2013"}, {"Title": "Better than most reviews claim", "Author": "George A. Hughes", "ReviewID": "R2176GKO1E0N70", "Overall": "4.0", "Content": "What it came down to was the \"AA\" batteries.  I hoped some of the \"cons\" I read in several reviews would not be a problem.  They are not.  I don't do video.  That solves that problem.  It is plastic but so is most everything else in this world and, not being a \"Pro\", I'm not likely to find myself in situations where this camera will get banged about. It will take me some time to learn what all the shooting modes are capable of and I do miss being able to stop down to F22 at a 60th if I want to but I did get a good all around camera for a most reasonable price.  Sometime I'll do a sisd by side compairison with my other digital camera, a Sony W7 which I've had for a number of years and almost fits in my pocket.", "Date": "December 19, 2012"}, {"Title": "Fuji HS25EXR", "Author": "Rlara", "ReviewID": "R19HB1ZVLJVC2Q", "Overall": "5.0", "Content": "Great Camera, easy to use.Image quality is excellent. Panoramic pictures are easy to shoot, a lot of options for scenes.", "Date": "August 11, 2012"}, {"Title": "I love this camera!", "Author": "Dancerpeg", "ReviewID": "R10BXDV9WNQ8ZJ", "Overall": "5.0", "Content": "I got this camera on Thursday and I have taken over 300 photos. I am really love it. This is my second fuji film camera.", "Date": "September 30, 2012"}, {"Title": "Would highly recommend this camera", "Author": "K. Thompson", "ReviewID": "R1JRUC7HPG7I08", "Overall": "5.0", "Content": "I love this camera. I am a complete novice so I wanted a very user friendly camera that would choose settings for me and give me great quality photos but I also wanted it to \"grow\" with me as I was learning to become a better photographer and this camera offers both. It will choose the settings and give me great photos and I'm sure as I learn it will provide me years of good service. They call it a bridge camera and it does just that, it bridges the gap between point and shoot and a higher more professional level. I also am one who likes to read the customer reviews of others using the product before I make a final decision and the reviews of this camera were very favorable and after buying it has not failed my expectations.", "Date": "November 23, 2013"}, {"Title": "Fuji camera", "Author": "Monica Southall", "ReviewID": "R1KN8JDRFIRFGF", "Overall": "3.0", "Content": "So far I like it..........I haven't had it long enough to really give any info on the product.  I will say when I received the item it did not have a lens cover for the camera and it was suppose to have ALL the parts with it!  Upset about that had to buy a generic lens cover for it.  When shipping items out need to make sure everything is there.", "Date": "November 18, 2013"}, {"Title": "Good camera, but", "Author": "doug", "ReviewID": "R3PAQSLCMU6B0Z", "Overall": "3.0", "Content": "I was considering an alternative to Nikon D3100, their entry level DSLR.  This Fuji represents about a 30% savings.  After using it, its ok, but not great.  One has to get used to the electronic viewfinder.  Photo quality, mainly exposure under widely varying conditions, is not up to the Nikon quality.  Of course, the very telephoto lens is of little use, but ok.  Wide angle specs are more important.  In summary, this is a good camera, but if you are demanding, go for a Canon or Nikon DLSR.", "Date": "October 11, 2013"}, {"Title": "Ok camera", "Author": "Andrew K.", "ReviewID": "R2ED5L25M37YHX", "Overall": "3.0", "Content": "I got it for a digital photography class I teach at a small high school. The lens is good for is cost. Do not like the on/off switch and the internal menu is hard to get through.", "Date": "October 2, 2013"}, {"Title": "This is an excellent camera", "Author": "Frankie Jo Douglas", "ReviewID": "RNQ1UY3PMPTVV", "Overall": "4.0", "Content": "The camera works very well and takes great pictures.  The only reason I did not give it five stars was that it does so much more than my previous Fuji E550 (a very simple and intuitive camera) that it is taking me a while to learn how to use all the new buzzers and whistles.", "Date": "September 10, 2013"}, {"Title": "Great Step up from S5000", "Author": "C.W.Howell", "ReviewID": "R3AJUYQDEP5NK8", "Overall": "5.0", "Content": "I've had a Fuji S5000 for more than 10 years. Loved that camera, but have been looking for a step-up, better technology, longer zoom and more shooting options, and the HS25EXR is it. I'm amateur photographer so in my shopping I eliminated the need for RAW mode. I wanted the EXR line because of the technology and the all-around rubber grip which DOES make holding this camera easier. I also like that it runs on 4-AAs rather than a battery pack. I can use my rechargeable AAs from my S5000.The functionality of the camera is similar to the S5000 so getting started was easy. The HS25EXR takes much better shots in low light and at long ranges better than my old S5000 (just better technology). You can shoot fully-automatic or change to manual settings. Thought I wouldn't care about the tilt screen, but it's actually quite nice having it. Enjoy the manual zoom, I think it saves battery power and you can adjust zoom while shooting moves. The face recognition technology is much improved from my former camera. I'm really enjoying taking pictures and experimenting with all the different shooting modes.I did look at other brands when shopping for this camera. Familiarity with the brand and camera functionality, manual zoom, all-around rubber grip, and price were my big deciding factors. The Nikon was the runner-up, but the Fuji was more than $100 less which saved me money for a lens hood, SDHC cards and a new bag. Very happy with this purchase.", "Date": "September 8, 2013"}, {"Title": "Everything I expected plus more, for an amatuer like me", "Author": "Norberto Perez", "ReviewID": "R35AMDQT0BHU8R", "Overall": "5.0", "Content": "Well first off I wanted to shoot some nice photos for a wedding...my own wedding. I didn't want to just hire another photographer for $500+...when I would just get is still photos photoshopped, etc. I wanted to be able to take great pictures AFTER that fact of the wedding. I looked and looked...for the price, I was looking at another FujiFilm..I forgot the model...but what attracted me to this wasPROS:MANUAL Zoom AND Focus - Great for getting those nice shots PLUS great for film making!!! - On other models they have an electronic zoom...which you can hear the gears moving when you zoom in video..plus in manual it's more creative!BRIGHT LCD screen, and it tilts out!Electronic Viewfinder - some models don't have them...and it's annoying to shoot without one if you are turely serious about photographyManual settings! - ISO, EXPOSURE, SHUTTER ...once you learn how they all work, you get the pics YOU want...not some random Kodak camera shotsHot Shoe - A PLUS!,  especially when you use wireless remote flash, or a dedicated flash (I bought the Youngnan 560 II = Awesome! )CONS - No Bulb mode, so you can't take long shutter speeds of 30 seconds+  -1080p is only at 30 fps, not 60fps like others...which could help make dramatic shotsOverall I'm VERY happy with the camera! The pictures with a dedicated flash look great! One is so used to Point and Shoot cameras like Kodaks..that simply are not \"smart\" enough like the human brain/user to how to take the shot how one wants. I LOVE this has full manual mode! I DO NOT regret buying this..and that is a hard statement for me...I bought mine used, and it was fabulous!", "Date": "August 12, 2013"}, {"Title": "finepix HS25exr camera", "Author": "abudarwazeh", "ReviewID": "R434NZEEFA2F7", "Overall": "4.0", "Content": "let me start by saying that I'm not a pro. I just bought this camera to shoot some home/family videos, as well as taking some memorable pics that i can print out and save.i never really had a camera before, but I was using my sony phone camera which was good HD camera. but this one here, DAMN what a good job it did, it shoots full HD movies which are great. and the 16pixells are great for taking a picture anywhere, and anytime. the flash is good, the tilting screen is so useful and sturdy. it has manual zoom, and manual or auto focus which is also a great feature, and saves battery too. i use the sanyo eneloop batteries which really are god and last long. i gave 4 stars not five only because the sound quality when taking a video, it is good but sounds from the camera itself might show. VERY happy with it, and i advise everybody who wants a great camera for less than 300$$$ to buy it, you will not regret. and please read the manual first so you know how to use it.", "Date": "August 12, 2013"}, {"Title": "this is a cool camera", "Author": "emon", "ReviewID": "R2D34PN8CKBNID", "Overall": "4.0", "Content": "This Camera is like a SLR camera but its also a point and shot camera all thought I got a refurbish the battery case cover is loss but the camera has all feature and I can shot picture at dark place too", "Date": "June 28, 2013"}, {"Title": "Easy to use and versatile", "Author": "Richard Benton", "ReviewID": "R55T3E3U2GHIK", "Overall": "5.0", "Content": "Love the manual zoom and the movable display screen..Camera is packed with features. The camera feels solid, heavy but comfortable with a good strap. Battery life is also outstanding, and I like a camera that doesn't require a specialized battery. Got it for an amazing price, too.", "Date": "June 28, 2013"}, {"Title": "Results R Rubish", "Author": "Michael", "ReviewID": "RSRYCR4BFGIZB", "Overall": "1.0", "Content": "Major exposure and saturation problems... particularly when shooting close up and in the middle distance. Everything looks washed out. The color saturation is terrible. Shoot a densely saturated scene at dusk, and what you get in the LCD and in the image is something that's been adjusted for normal daylight. A really cheap CMO image sensor is the only explanation. Way too many confusing settings... tried them all without getting better results. Also, Fuji could spring for a UG.", "Date": "June 21, 2013"}, {"Title": "Exceeded Expectations", "Author": "steve", "ReviewID": "REHZ3QOBZZ4NO", "Overall": "5.0", "Content": "Was hoping to get a camera somewhat better than the basic point and shoots, but this one perform much better than expected.  Really like it's long zoom and it also performed very well under low light (this is the main reason for the purchase).  Bought it on sale for under $250 and my professional friend says it's more than worth it.", "Date": "June 21, 2013"}, {"Title": "So far so good.", "Author": "I'm a User 52", "ReviewID": "R15A3BQZKBWPJ3", "Overall": "5.0", "Content": "I found it easy to learn and it seems to be taking good pictures so far. Not hard on batteries and comfortable in the hand.", "Date": "June 15, 2013"}, {"Title": "I love it!!!!", "Author": "C. Russell", "ReviewID": "R3JI958Z5G3IYN", "Overall": "5.0", "Content": "Great features, good handling, very convenient that it has a lens with contraction and extension just by turning the dial. I am starting out in photography, and this camera was the best choice out of all the ones i researched.The seller shipped on time, and my item was received earlier than the ETA.", "Date": "May 28, 2013"}, {"Title": "No lens hood made by Fuji. Unfortunate loss of saturation. No way to order a bayonet mount model.", "Author": "James J. Butler \"J. Butler\"", "ReviewID": "R2HJPBBESQN058", "Overall": "2.0", "Content": "{See update below reducing the rating to a 2]I bought the HS 25 EXR last summer and have taken thousands of pictures and videos with it. I agree with most of the PROs on the rest of the reviews, and with some of the CONs.My last digital camera was a Fuji S 6000 that I wore out over years of heavy travel and consistent use. Loved it. It came with a standard bayonet mount lens hood. Any shortcomings were vastly outweighed by advantages and ease of use over the others out there, feature for feature.When it began to show signs of aging, I noticed that the HS 25 EXR looked like a good replacement. AA batteries are a must for me. Unfortunately the 256 EX came with no lens hood, unlike the S 6000 that had one standard. It didn't seem like a big deal at the time, but many of the shots show color washouts and flare when light comes from the front. This is simply NOT acceptable.I went online a few months ago and ordered a lens hood that looked correct. But it was a screw-in that lopped off the corners of the picture on wide angle. That was time and money wasted.In the last few days I have spent over an hour searching through the online stores including the FUJI factory site for the proper lens hood. All that's out there are screw-in hoods that lop the corners off the pictures at wide angle. I emailed Fuji for a source for a proper bayonet mount lens hood. Fuji replied with a number that was useless, their third party online sales company. So far have also spent over an hour calling the supposed Fujifilm direct customer support line at 1-800-659-3854 and going through the circular prompts that keep sending you back to the third party servicer that has no such filters. The latest nice lady at the number I was told to call said she got into the same endless runaround. I told her precisely what I was looking for. She took my name and number and promised to have someone call me. Eventually a couple days later someone did. The message told me to call ShopFujifilm, a third party supplier that handles some Fuji accessories: the same place I had already been told to call four times. They have no such item.Without the lens bayonet mount lens hood, there is a loss of color saturation and there are unfortunate flare problems when strong light hits the camera lens directly at any angle even with a very clean lens. The sun or bright lights do not need to be in the field of view to impair the image. Fuji should charge an extra couple bucks for the lens hood and put in in the box, and have PROPER bayonet replacements easily available online without having to waste hours and hours. These issues are based on almost 100 GB of photos and videos in the past 9 months including 64 GB of photos and videos taken in the last month in various countries.With the PROPER lens hood in place,for which there IS a mounting groove on the outside of the front of the lens and for which the lense itself was designed, the saturation and flare problems should be fully solved and the camera should get 5 stars. Till then, no. Not even close.However, just the process of trying to get the proper hood is a trip through Fuji Hell. [See UPDATE at bottom]The manual with any detail is ONLY online. Get ready to spend a lot of time with the manual on screen and printing out the pages you might want to refer to. You should do this no matter whether it is online or in booklet form. The power of the camera can only be learned through going through the manual and practicing. I was happy to spend the time going through the manual, but the larger print-outs of the ten or so pages I wanted to have available are bulky for travel compared to the detailed factory manual that was included with the S 6000.Why Fuji would decide to take such unnecessary steps BACKWARDS is impossible to tell.The S 6000 rated a full 5 in my view being wonderful considering current technology. It never had any problems until age and new technology told me to replace it.The HS 25 EXR would have had a better rating if it came with a standard bayonet lens hood similar to the S 6000 even with the online manual inconvenience. There is no excuse for a camera that invites color wash out and flare due to a lack of a simple lens hood. At this point I have to be certain that the only pictures I take are with the light from the rear; otherwise I need to use another camera with a lens hood.I plan to look elsewhere for a replacement for my next trip if no bayonet mount lens hood is available.UPDATE: 5/22/2013After 5 more ping-pongs through the Fuji hell maze over another wasted hour, I was told expressly by a Fuji technician that Fuji makes no bayonet mount lens hood for this camera, has no plans to do so, and that if it's not made by a third party, tough luck.Phoning ShopFujiFilm at 866-289-3854 as directed by Fujifilm America provided express confirmation that there are no third party bayonet mount lens hoods for this camera.Unfortunately the lack of lens hood leads to washed out colors and flare, two things that are easily avoided with a proper lens hood. My lens is regularly cleaned with proper lens spray and lens cloth and is kept dust and smudge-free at all times.Fuji's cavalier attitude, terrible phone support, and failure to provide the simplest of parts even at extra cost compels me to reduce the rating to a 2. My gut tells me it should be a 1, but the pictures taken with all light from the rear are acceptable and it's fairly easy to use.I can't imagine Canon or Nikon (or any reputable camera company for that matter) not offering a proper lens hood even as an option. But Fuji doesn't give a damn. Since that's their attitude about this issue, it probably extends to their other areas of camera functions now as well. I have lost faith in Fuji and will not buy another Fuji product.Perhaps there's a good reason the Fuji products are not rated well by the camera magazines other than that Fuji doesn't spend as much ad money. Perhaps there are MANY good reasons.Maybe someday someone from Fuji will call and help me get a lens hood. I'm not holding my breath.", "Date": "May 20, 2013"}, {"Title": "Amazing", "Author": "Devon", "ReviewID": "R3OSOPJPMHJ73Z", "Overall": "5.0", "Content": "This camera is absolutely amazing. It's PERFECT for beginning photographers! This is my first camera and I love it! It's very user friendly! You can take pictures of the moon and get very detailed pictures. It also has a macro/super macro mode so you can take very close up pictures! The zoom is incredible! It has a few flaws:  Sometimes the color in the picture fades. There are some modes not available that are useful. The lighting can be odd and bright. Sometimes the pictures turn out VERY blurry. Overall for the price, this camera is GREAT! I love it so much and I hope you decide to get one! I learn more and more things about this camera everyday as I use different modes. It's awesome!", "Date": "May 19, 2013"}, {"Title": "Fujifilm FinePIX HS25EXR Digital Camera", "Author": "David L. Chase", "ReviewID": "R2NKLD57M7HTDJ", "Overall": "5.0", "Content": "The camare was purchased a gift for my niece and she fell in love with it immediately, so I am waiting for her feedback as she begins to us it.", "Date": "May 18, 2013"}, {"Title": "Camera", "Author": "ashley89", "ReviewID": "RR6DWGCOJ1YB7", "Overall": "5.0", "Content": "It was everything I wanted and was what I was looking for! Easy to use and operate after a little bit of reading.", "Date": "May 13, 2013"}, {"Title": "Great Camera", "Author": "dancefreak21", "ReviewID": "R1YK69MR6IC5T4", "Overall": "5.0", "Content": "It's a great camera to use. This is a good camera for people just getting into taking photos and want to get more professional. It's easy to figure out how to use it and has good quality and has a good zoom to it. I recommend it to beginners or people who are really artsy and want to get into photography but don't know it they want to do it. I really enjoy it plus the price is great because cameras of this quality are probably 100's of dollars more.", "Date": "April 22, 2013"}, {"Title": "Nice camera, very good price/ quality ratio.", "Author": "Rafael Puyol", "ReviewID": "R3NDIOET9AQUFB", "Overall": "4.0", "Content": "Pictures are a little noisy and pixels dont have a good definition. The EXR mode is not such a big deal, the noise reduction works well.", "Date": "April 13, 2013"}, {"Title": "camera review", "Author": "Linda M Warner", "ReviewID": "R28OP80NNP2LOZ", "Overall": "5.0", "Content": "I bought two as gifts and both recipients are thrilled with their cameras.  One is an amateur and the other is a  very advanced photographer and both are equally impressed.", "Date": "January 9, 2013"}, {"Title": "Great beginner camera with quality options", "Author": "S. Porcher \"seannslo\"", "ReviewID": "R26THSGG6ZOHNX", "Overall": "5.0", "Content": "This camera is amazing for the price.  Much better than a simple point and shoot without the hefty price tag of a DSLR!  Probably one of the greatest things is the availability of a bunch of add on lenses, filters and other accessories.  Takes great pictures.", "Date": "January 2, 2013"}, {"Title": "Interesting, but poor quality.", "Author": "Monyet", "ReviewID": "R1XQT6HEHYT5K5", "Overall": "3.0", "Content": "I have had a similar experience to Pinon Pete's on this page:[...]Basically, the On/Off switch did not work from the moment I opened the box.The camera would turn on by pressing the shutter button.  However, the on/off switch did nothing.A work around to this was to insert a memory card, then take it out.  That turns the camera off without erasing your settings.However, I believe a $300 camera should be off when the switch is set to \"off\" and on when set to \"on\" so I returned it.Nonetheless, I would have ordered a replacement had I not been so dissappointed.Before returning it I managed to play with it a bit.  Image quality was ok, and the layout was similar to most other fuji models.  In the end, If you really want this camera, I would recommend going to a store to buy one in person, just to make sure you can turn it on / off, and to make the returns process a bit easier.Pros:-Manual Zoom-Convenient menu navigation and  settings customization-Good quality LCD-Plenty of capabilities-30x zoom is fine, and will auto focus in about 2 secondsCons:-Lots of cheap plastic in the construction-Feels a bit loosely build when handling; you feel it when using the zoom", "Date": "July 20, 2012"}, {"Title": "This model is perfect - but arrived to me in Kuwait defected.", "Author": "Khaled Hadi", "ReviewID": "R2U5RIM5WEPMP2", "Overall": "3.0", "Content": "I bought it used - it was a stupid decision. It arrived mulfunction and worked for 10 minutes only after that died for ever only I see white screen. I will never buy used item again.The photos I captured during this 10 minutes was excellent and far better than my daughter cam Fujifilm S3400that is why I gave it 3 stars", "Date": "April 21, 2013"}, {"Title": "Excellent sub-DSLR camera, but menus, etc, somewhat complicated", "Author": "Captain Silver", "ReviewID": "R25CFU4IHCK26F", "Overall": "5.0", "Content": "I have been a life-long Canon user, in large part because of the quality, but also because many Canon models use AA batteries available world-wide, rather than a proprietary battery / charger unique to each camera.  However, with my last several Canon Powershots, I have been less than impressed with the latest iterations of the DIGIC image stabilization chip - the last really good Canon I've owned was a Powershot A710IS (MIJ, and I still use it!).  I decided to try a different make, but was limited in choice of cameras that used AA batteries.  I happened across the FinePix HS25EXR, and bought it from Amazon at a reasonably good price.I have been very impressed with the camera in the short time I've owned it.  Nice heft, but not too heavy.  Amazing telephoto lens (30x), but manual, which takes a bit of getting used to.  Adjustable LCD viewfinder, as well as an optical viewfinder.  Response time is excellent for a camera that uses AA batteries, even regular alkalines - quite an improvement over other cameras I've owned where there is a full second of lag between pressing the shutter button and taking the picture.  There are quite a few presets among the camera's menus to choose from, but they aren't necessarily all that intuitive, and it may take some experimentation to get a better sense of what each one does.  The flash must be released manually, but produces good indoor pictures.  Without the flash, the camera is capable of operating at extremely high ISO (3200?), so you can take pictures in extremely low light, but they tend to be fairly grainy.  Battery life so far is good, with regular alkalines and a 16GB SD card, I'm getting a couple of hundred shots per set of four batteries.  Overall I'm very pleased with the camera.", "Date": "April 15, 2013"}, {"Title": "Great Camera!", "Author": "Juan Pablo Franco", "ReviewID": "R3F7LQ2K0LATS9", "Overall": "5.0", "Content": "I am very happy with this camera. Great Pictures. A lot of features. I really enjoy using it. Great zoom.", "Date": "December 30, 2012"}, {"Title": "I love this camera", "Author": "A. bush", "ReviewID": "R34KRU8AME4PA", "Overall": "5.0", "Content": "I love this camera I liked more than my Nikon D300. It has every thing I need went I go hiking and climbing in Hawaii.  I have noting else to say", "Date": "September 21, 2012"}, {"Title": "Second Fuji, great for money", "Author": "Robert B Hayes", "ReviewID": "R25JMRLX5CDUK8", "Overall": "4.0", "Content": "Couple of issues, might be user error. Very awesome for the money. I was a pro photographer for 20 years, o like this camera because It lets me quickly change settings, like purposely under exposing a sunset behind a sailboat.Last Fuji lasted a long time til I broke the battery door. Yes I said I.", "Date": "January 13, 2013"}, {"Title": "excelente", "Author": "jairo rosales", "ReviewID": "R3F36QP3H1EWL8", "Overall": "5.0", "Content": "excelente muy buena camara muy buena se las recomiendo  a todos ,,,, es muy facil de usar .... excelente todo", "Date": "March 19, 2013"}, {"Title": "Good, but", "Author": "Nancy B", "ReviewID": "R3LDER56NKO0L9", "Overall": "3.0", "Content": "Takes good pix, nice clarity & quick focus. But, when using video you can hear the hum of the recorder.", "Date": "January 13, 2013"}, {"Title": "Muy buena cámara.", "Author": "Carlos", "ReviewID": "R17HU4XL0LMO7A", "Overall": "5.0", "Content": "La cámara llego según lo acordado con el vendedor. El envío fue rápido y venia bien embalado, sin  ningún detalle.", "Date": "October 29, 2012"}, {"Title": "Blurred image warning always showing.", "Author": "Debra L Moon", "ReviewID": "RCAY6YDI20I0P", "Overall": "2.0", "Content": "Returned item, defective item it always displayed blurred image warning on screen.  I also was unable to take video without it being blurred.", "Date": "November 26, 2012"}, {"Title": "HEADS UP--ADD FREE MEMORY CARD TO CART!!", "Author": "D. A.", "ReviewID": "R2KJB53JDCFN5Q", "Overall": "3.0", "Content": "If you order this camera while the the FREE MEMORY CARD is being offered, be sure to read the \"Learn more\" section at the end of the \"Buy This Camera, Get a Free Memory Card from AmazonBasics:\"  I assumed buying the camera automatically would include the free SHDC class 10 4 GB memory card.  NOT SO.  Clicking the \"Learn more\" section opens another small window that is titled \"Buy Select Digital Camera, Get a 4 GB Memory Card\" and explains that to take advantage of the offer you must add the qualifying memory card to your Shopping Cart and Amazon will automatically apply the discount at checkout.  In my excitement about the camera I didn't do this and didn't get the free memory card.  So this is just a Heads Up so you don't make the same mistake I did.  I just got the camera today (that's why 3 stars, so far it looks good) and have yet to read the manual much less use it...will write a review after I have taken some pictures.  (Hope this was helpful)QUICK UPDATE:  Only beginning to learn this camera, but wanted to let you know that if the zoom factor is important to you, it works great!  The zoom capability was one of my must haves for a camera.  As luck would have it,  yesterday I got some fine deer photos some with the 30x zoom and some with the EXR Intelligent Digital 60x zoom and they turned out great (for a first time try)!  On the digital zoom I did have to \"lean\" against my door jamb to keep the camera steady, but I was really very pleased with the results.  Because I have a long way to go in learning this camera I am keeping the 3-star rating for now.  Will update later.", "Date": "July 12, 2012"}, {"Title": "Very bad .....", "Author": "ilker", "ReviewID": "R2A5JNBHA76Y65", "Overall": "1.0", "Content": "A camera with a very very bad..........I do not recommend.insufficient to meet the expectations of.complete the work of an amateur.", "Date": "April 19, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "16MP EXR CMOS\nHigh Quality Fujinon 30x Manual Optical Zoom Lens\n3.0 inches Tilting LCD\nFull HD Movies\n4 - AA Batteries", "Name": "Fujifilm FinePix HS25EXR Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51w0uQs3ufL._SY300_.jpg", "ProductID": "B006T7QZ02"}}