{"Reviews": [{"Title": "Pentax Q", "Author": "Alvin K. Trace \"Tracer\"", "ReviewID": "R19J1KECBF89SP", "Overall": "5.0", "Content": "Love the camera!  A great little in a small package.  I also have a Pentax K-01 and the Q has a lot of the same specs in a smaller.  It's features are pretty amazing considering the size.  Great build quality.  Also, love the HDR settings. It was shipped quickly and the price was right.", "Date": "October 4, 2013"}, {"Title": "it is cheap and very small", "Author": "Zhengxiu Jin", "ReviewID": "R3VM6JNO2BADLA", "Overall": "4.0", "Content": "this camera is very small, so it is convenient to take it and it looks beautiful. but the pictures taken by the camera is not better than windows phone", "Date": "August 26, 2013"}, {"Title": "im in love!", "Author": "andrea", "ReviewID": "R2E1XAK488S7F5", "Overall": "5.0", "Content": "I'm really in love with this camera!!its beautifull, i use it all time, i can carry it in my bag.lovely photos, perfect Size Camera!!", "Date": "April 15, 2013"}, {"Title": "It's so cute!!", "Author": "Max", "ReviewID": "RUV42JJZPM7AU", "Overall": "4.0", "Content": "I've been dying for this camera for the longest. The only thing keeping it from receiving a 5-star rating is the fact that it sometimes, not always but sometimes, lags when a take pictures. I think I just have to keep messing with it consistently to keep it from doing that.", "Date": "August 20, 2013"}], "ProductInfo": {"Price": "$499.95", "Features": "12.4 megapixel backlit CMOS sensor producing very low noise images @ high levels of sensitivity for both 12 bit DNG RAW and JPG files.\nNew Pentax Q mount lens system supporting 5 different lenses\nFull HD video capture @ 30 FPS with h.264 compression\nSensor shift shake reduction with DRII dust reduction for stabilized blur and dust free images\n3X 27.5 -83mm equivalent zoom lens", "Name": "Pentax Q White kit w/02 Standard Zoom Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/415pZTMwyML._SX300_.jpg", "ProductID": "B007SQB04E"}}