{"Reviews": [{"Title": "Big features, small package", "Author": "Tyler Yasaka", "ReviewID": "R30O8RPGGFGAGX", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo35JP7X80EPAH3embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo35JP7X80EPAH3refresh_preplay() {\n\ndocument.getElementById(\"cv_mo35JP7X80EPAH3chiDiv\").innerHTML = document.getElementById(\"cv_mo35JP7X80EPAH3hiddenPre\").innerHTML;\n};\ncv_mo35JP7X80EPAH3refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo35JP7X80EPAH3so;\t   \n\n\nfunction cv_mo35JP7X80EPAH3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo35JP7X80EPAH3so = new SWFObject(swfLocation, \"cv_mo35JP7X80EPAH3AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo35JP7X80EPAH3so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo35JP7X80EPAH3so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo35JP7X80EPAH3so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo35JP7X80EPAH3so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo35JP7X80EPAH3so.setAttribute(\"height\", swfHeight);\n          cv_mo35JP7X80EPAH3so.setAttribute(\"width\", swfWidth);\n          cv_mo35JP7X80EPAH3so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo35JP7X80EPAH3so.write(\"cv_mo35JP7X80EPAH3flashcontent\")) {\n          fp_resizePlayerSpace('cv_mo35JP7X80EPAH3', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo35JP7X80EPAH3';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo35JP7X80EPAH3', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo35JP7X80EPAH3loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo35JP7X80EPAH3\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m6ADCC5CGY5M0\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m6ADCC5CGY5M0\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R30O8RPGGFGAGX\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m6ADCC5CGY5M0/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo35JP7X80EPAH3duration')) {\n      document.getElementById('cv_mo35JP7X80EPAH3duration').style.display='none';\n    }\n    cv_mo35JP7X80EPAH3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo35JP7X80EPAH3loadSwf(movieID, playerVersion) {\n   return _cv_mo35JP7X80EPAH3loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo35JP7X80EPAH3newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo35JP7X80EPAH3', 0, h);\n}\n\nfunction cv_mo35JP7X80EPAH3resetPlayer(w,h,bw,cc) {\n  cv_mo35JP7X80EPAH3newHeight(h);\n\n  cv_mo35JP7X80EPAH3so.addVariable(\"resetBandwidth\", bw);\n  cv_mo35JP7X80EPAH3so.addVariable(\"cacheCode\", cc);\n  cv_mo35JP7X80EPAH3so.setAttribute(\"height\", h);\n  cv_mo35JP7X80EPAH3so.setAttribute(\"width\", w);\n  cv_mo35JP7X80EPAH3so.write(\"cv_mo35JP7X80EPAH3flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo35JP7X80EPAH3RollOverImg = new Image();\ncv_mo35JP7X80EPAH3RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81bNa44P0kS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo35JP7X80EPAH3preplay = document.getElementById('cv_mo35JP7X80EPAH3preplayImageId');\nif (cv_mo35JP7X80EPAH3preplay) {\n  cv_mo35JP7X80EPAH3preplay.onmouseover = function() {\n    cv_mo35JP7X80EPAH3preplay.src = \"http://ecx.images-amazon.com/images/I/81bNa44P0kS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo35JP7X80EPAH3preplay.onmouseout = function() {\n    cv_mo35JP7X80EPAH3preplay.src = \"http://ecx.images-amazon.com/images/I/81bNa44P0kS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo35JP7X80EPAH3preplay.parentNode;\n\n  var cv_mo35JP7X80EPAH3currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo35JP7X80EPAH3currentClick) {\n      return cv_mo35JP7X80EPAH3currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 4:25 MinsI've been a photographer for several years now and am very familiar with cameras and doing manual photography. This is my 4th high-end camera, and my previous cameras were Panasonic, Canon, and Fujifilm. This is my first high-end compact camera, however.I like this camera for pretty much the very reasons that drew me to it. I wanted a quality camera that I could carry around as an alternative to my bulky canon, since I found myself not taking pictures often just because I never had a camera on me. I did a lot of research and I liked this one because of its wide-angle, 5x zoom lens, optical image stabilizer (which is featured on all Lumix's), Panasonic brand name (I had a good experience with my first Panasonic, until I lost it), and incredibly small size. This camera does essentially everything my big cameras did, except without as much zoom and the ability to manually set aperture and shutter speed. It may even do some things better.Additional features are its HD video recording, 16 megapixel resolution (which in my opinion is more than necessary), and intelligent auto which really is quite intelligent. Now it apparently has two modes of capturing videos, one in HD and another in motion J-peg or something like that... I don't know. I honestly don't care, but I have taken some videos and they turned out fantastic.Pros:-Wide angle lens (hard to find on compact cameras) which can create more depth of field-optical image stabilizer-plenty, but not too many, scene modes to give me a sense of control in taking the picture (not nearly as good as manual, but sufficient for a compact)-5x zoom, not bad for a small camera-trademark Panasonic picture quality, with good exposure and balanced colors (see my customer pics)-amazingly small! I can't believe all of this is in such a tiny device.-intelligent auto mode which will take great pictures for those who don't know what I'm talking about in this review-reasonably pricedCons:-No manual shutter speed/aperture control. I won't complain since virtually no small cameras have this, but it would have been nice if Panasonic had added this feature.-No mode dial that some cameras have. I list this as a con because some people might consider it one. I personally like it the way it is, although sometimes it takes me a while to get it set the way I want it. The controls are simple enough so I'll just have to get used to it.", "Date": "April 16, 2012"}, {"Title": "I like it MUCH better than the Canon Powershot", "Author": "L. Doong \"ugarugger\"", "ReviewID": "R1EYVBQQBEWX82", "Overall": "5.0", "Content": "This review will not focus on the quality of the photos - I am NOT a photography expert, and I'm okay with that.  I'm just an average guy who wants a small camera that fits in my pocket and takes decent photos wherever I may be.  The main reason I was looking for a new camera is because my previous camera (Canon PowerShot SD1300IS) stopped working consistently, and it had some usability issues that really got on my nerves.Again, I am NOT an expert, just trying to offer my opinion as an average everyday user.  As far as I'm concerned, most compact point & shoot cameras take decent photos, or at least I can't tell a huge difference between them.OVERALL:  I've only had it a week, but I really like this camera so far.  The main reasons are some HUGE design/usability differences between the Panasonic Lumix and the Canon ELPH camera families, which are detailed below.- power switch - I really like that this camera has a SWITCH instead of a button.  Here's what I wrote in the review for the Canon SD1300IS - \"as some people have already mentioned, the on/off button is WAY too easy to accidentally push.  For anybody like me who wants a subcompact camera specifically for the ease of carrying it around (in their hip or jacket pocket), this is a HUGE annoyance - almost reason enough to look for a different camera.  I am constantly afraid that I will continue to accidentally push the ON button while it's in my pocket and damage the lens motor.  I purchased this as a replacement for a broken SD1200, and I never had this problem with that model.\"- battery release door - I like that the battery release door has a locking switch.  To open the battery release door on the Canon SD1300IS, you slide the entire door laterally.  I didn't realize this was a problem until recently, when I had problems turning the camera on.  Apparently, the wear and tear has messed up the sensor that indicates the door is closed - so now I have to firmly squeeze the door inward while holding it, otherwise the camera won't turn on.- separate picture/video button - I really like that these are SEPARATE buttons.  Everybody knows that sometimes speed is of the essence when trying to capture a moment.  With my Canon, I can't tell you how many times I forgot to switch the slide from video to photo, tried to take a photo, then realized it was still in video mode, and before I was able to switch it back to photo mode, the moment had passed.  VERY FRUSTRATING!  But the Panasonic's separate buttons prevents this from ever being a problem again.- panoramic setting - apparently this is a feature in most other cameras, but not with the Canon - but I really like the automatic panorama photo feature!  great for beach and scenery pics.So for anybody with the same complaints about the Canon Powershot ELPH models that I detailed above, this camera definitely addresses those.  I have no idea which camera takes better quality photos but I am not able to tell the difference.", "Date": "July 24, 2012"}, {"Title": "Wonderful Camera", "Author": "Daniel Friedlander \"Old movie buff\"", "ReviewID": "R2IOKG57PNDD7V", "Overall": "5.0", "Content": "I never liked cameras until I bought this little gem from Amazon.. I love this camera..  I felt comfortable with it from the word go.. If I have any questions beyond the manual and helpful tutorial CD I simply call Panasonic at the phone number printed in the manual with any further questions.. I did that once and I received top notch tech support immediately by a professional who knew every angle of the camera... I am enjoying this camera immensely. Great Product at an amazingly low price.  Keep up the good work Panasonic and Amazon!!", "Date": "June 22, 2012"}, {"Title": "Wonderful Compact Digital Camera :)", "Author": "Melanie Faith", "ReviewID": "R3LCMLCFH1E0MY", "Overall": "5.0", "Content": "I purchased this camera (in the purple/violet shade, as shown) this spring, when my trusty six-year-old digital Samsung tired out and the lens kept sticking.  At the same time, I purchased a DSLR.  I've been quite pleased with both my DSLR AND this camera-- but as far as value for the money, this Panasonic Lumic DMC FH-8 really goes the distance.I love all of the modes (especially the sunset mode, the food mode, the baby1 and baby 2 modes), and the video is pretty great quality and easy to use.  I also love that the on/off button and the switch for switching between shooting mode and viewing photos already taken are so easy to operate.The main advantage of this camera is its lightweight body.  The main reason I purchased this camera (after researching for months, reading reviews both online and off, and surveying many friends and students about cameras) is that it combined a compact body with a higher MP count.  The photos from this camera are excellent, especially for a compact camera.  It's also great for travel-- which was my second requirement for a new camera, as I was making a trip across the country to visit and to take pictures of my new niece. :)An extra perk is that the flash on this camera works well but doesn't tend to make my loved ones blink, as (unfortunately) the more powerful DSLR flash tends to do.This digital camera also does well in low-light situations.One of the very few drawbacks of this camera is that it tends to need recharged quite often-- although I must admit that my old compact digital camera was only 8.1 MP, so \"quite often\" might be a relative statement.  It's easy to recharge, but if you travel quite a bit, I'd say to either pack the charger with you or to take an extra, charged battery.Overall, this camera is a solid five and a great value for the money.  I'll continue to use this camera (as well as my DSLR) to capture photos of my darling niece as well as travels for years to come, as it packs well (into a purse or a carry-on bag) and so easily records those impromptu moments I'd hate to forget. :)", "Date": "August 1, 2012"}, {"Title": "Very Competent Camera for the Money", "Author": "Ken", "ReviewID": "RVJ6DDJPWJNNG", "Overall": "5.0", "Content": "I just received the FH8 yesterday (8/14/12 & purchased from Amazon) and have operated it in all setting modes, downloading photos onto my MacBook (OS 10.4) computer.  At my point in life (67) I realize that engineering a product is all about compromise.  With that said, the FH8 is not a replacement for a worn-out high-end Cannon SLR.  It is; however, a very competent camera for the price of $120 or less.  The manner in which settings are derived is simple yet effective.  You don't need a series of menu levels to scroll through as is the procedure for most all other cameras (Cannon & Nikon).  Kudos to Panasonic for making setting the camera simple.  The iA setting is where I'll leave my camera because it does an excellent job of adjusting film speed, shutter speed, lens opening and image stabilization whether I want the flash on or off.  The FH8 does give the user the ability to adjust the megapixels from 16.1 down to .3 (for posting on the internet).  The quality of the \"Leica\" lense is adequate and the digital zoom is good (amazing for a camera at this price point!).  On 8/20/12 I tried the movie mode and was pleased to note it downloaded properly to my MacBook (OX 10.4) in the MP4 format.  It downloaded to iPhoto, then was played on QuickTime software.  The only negative is the quality of either the \"Leica\" lens or CCD Image Sensor or both.  Sharpness in low light without flash is acceptable but not outstanding.  In addition, the FH8 Manual & PhotofunStudio 8.0 SE (both contained on a CD supplied with the FH8) is not compatible with the Mac computers.  This is a serious shortfall!  All in all; though, for the price it's a good choice for anyone wanting or needing a very small, quality camera that is simple to operate.  I have just re-evaluated the FH-8 and because I could download the video I am upgrading the rating to 5-Stars!  Since I have just received this unit, I cannot testify as to its durability or the quality of manufacturing.  Time will be the judge on that.", "Date": "August 15, 2012"}, {"Title": "Wow!", "Author": "KingofQueenz817", "ReviewID": "R2HYHY2ILZVM34", "Overall": "5.0", "Content": "This camera is amazing for its size. I am a independent filmmaker and a dedicated panasonic customer. I purchased this camera for the sole purpose of doing behind the scenes photos and videos. It takes super clear images similar to that of my panasonic gh2 and the video is decent enough for the purpose for which it was purchased. Defiantly recommend.", "Date": "May 18, 2012"}, {"Title": "Review of Panasonic Lumix DMC FH-8", "Author": "C. Nauman", "ReviewID": "R24DER33OXT97F", "Overall": "5.0", "Content": "I am very pleased with this camera. I previously owned two other Lumix cameras. They were larger cameras and more expensive. I took many great pictures with them. I bought the DMC FH-8 because I wanted a small camera I could just stick in my pocket. The two other cameras I gave to my twin granddaughters. They are now enjoying them. The Leica lens is a very good lens and this camera just like its bigger siblings takes very good pictures in low level lighting. I have taken pictures along side other people with different make cameras and their pictures barely turned out under low light, but mine were good. The only negative thing I noticed was it takes a little time to get its breath between pictures, especially using the flash. But this is not an issue for me. I did just read the three reviews that were uhappy with this model camera. I'm thinking they may have faulty cameras. Sometimes happens. I would not hesitate to buy another Lumix camera and the price, $102, was right. I see as of this writing it's now $129.", "Date": "October 2, 2012"}, {"Title": "I love this camera!", "Author": "Lisa R.", "ReviewID": "R1WNW6LQM65K8V", "Overall": "5.0", "Content": "I was looking for an inexpensive small camera and the reviews on this are great. I love it! It's the perfect size and even has tilt shift focus. One thing that is annoying is that the cd-rom with the owner's manual is only formatted for PCs and I have a MacBook. Panasonic should offer a way to download the owner's manual online. I ended up using my work PC so it wasn't a huge deal. Amazon also has a $6 Lumix FH series case which comes in handy. So far I am really happy with the camera and the picture quality.", "Date": "August 3, 2012"}, {"Title": "Surprisingly good camera features, but two design flaws", "Author": "Pezman419", "ReviewID": "RR6SM6Z2I671O", "Overall": "4.0", "Content": "My old digital camera finally kicked off, so I decided to get a \"pocket size\" digital camera to fill in the gaps until I save up for a big lens digital camera. I happened to catch this model on sale on Amazon for $99, so I bit. I was expecting it to be an el-cheapo camera for simple family photos, etc. I have been pleasantly surprised by the number of features and high quality photos the little thing (about the size of a small wallet) can produce.This camera can do panorama shots both horizontally and vertically that are quite impressive. It can also do very good quality black and white and sepia photography. Neither of these features I was expecting, and again have been pleasantly surprised by. There is also a fast lens sports photography setting for pictures you need to take in quick sequence, which is particularly good if you have toddlers on the move.It also has a descent power battery life but not spectacular, but the cute thing is that it comes with a USB electrical outlet converter. In other words, if you are taking it on vacation and are not going to be around to plug it into a computer with a USB power port, you can just bring the USB cord and the regular electric outlet converter and just plug it into a regular electrical outlet in any wall to charge.As noted in other reviews, this model does not have the settings \"wheel\" on the top of the camera. By that, I mean the rotating nob that many digital cameras have that allows you to physically change the photo settings by just rotating the nob around. You have to physically go into a camera operating system interface to change the photo settings, but that is really easy to do. There is also an \"intelligent\" setting that pretty much lets the camera pick the perfect photo setting itself, so you really don't have to fool with changing the settings if you don't want to. That lack of a setting wheel really does not bother me at all, but I could see how some people might be intimated by having to push a few buttons to change camera settings.I was also surprised at the video feature on this camera. You can record up to 30 minutes of good quality video footage with sound. The sound mic is fairly clear but not fabulous. You can even replay the video on the camera screen. This is a good feature for families that like to take short video clips of kids. You can even film a video in black and white if you have the camera set to black and white. What I particularly like is that recording video is super easy. There is a little red, recessed button next to the button you press for taking pictures. All you have to do to record video is to press that button once and it will start recording the video, and you press the button a second time to stop the video recording. You don't have to click through several screens to turn on the video record setting like in many other digital camera. You just click the red button and go.In total, the range of settings on this camera for an entry model \"pocket\" camera are really quite impressive, though there are a few design flaws you might want to think about as follows:I do have two gripes though about this camera, one of which is relatively serious. The first is really more of an inconvenience in that the plug in for USB/power cord is covered by this little rubber cap that is attached to the camera. The rubber cap is attached so close to the plug in on the camera that it is a real pain to hold the little cap back and get the USB male cord plug in get into the socket on the camera. You sort of have to wrestle with it. Again, that is cosmetic, but irritating every time you have to plug the thing it to recharge it or upload pictures via USB cord.The other complaint I have is typical of the types of cameras like this one that has a lens that physically opens up about an inch from a flat, dormant setting when you turn on the camera. In the opening up of that lens, it can create a minor suction of air which can suck in particles of dust into the inner camera lens itself. Once those dust particles get into the inner lens, you get pictures will annoying little blobs on them. You can either photoshop out the blobs, or you have to either have a professional photography guy take it apart to clean off the lens which takes time and money, or you can do it yourself if you know how. (Youtube search 'Panasonic Lumix cleaning CCD Sensor' for several videos on how to open up the camera and clean the lens yourself with a higher end jeweler's screw driver set...just beware that if you do it yourself you will likely void your warranty).All things considered though, this is nice little \"on the go\" digital camera with high quality pictures and a lot of higher end digital camera features for the money.  I quite like mine and use it frequently, but do beware of those two irritating design flaws.", "Date": "October 27, 2012"}, {"Title": "Easy to use, but poor picture quality.", "Author": "Amazon Customer", "ReviewID": "ROD3LTMIMZDQ0", "Overall": "2.0", "Content": "I picked up one of these cameras for my wife to use.  I owned a Panasonic Lumix camera in years past and was quite happy with it.  This camera is easy to use, even with all the features in it.  But the lens quality really isn't very good.  Just because you get a lot of pixels doesn't mean you get a good photo.  It all starts with the lens and what we got in our camera really isn't very good.", "Date": "September 10, 2012"}, {"Title": "Really Awesome Camera", "Author": "Jimmy", "ReviewID": "R31QWMBEVVZR4U", "Overall": "5.0", "Content": "Received this camera today, and I gotta say, I am impressed, it takes photos equal tomy Nikon D80, plus the video's are great.  Also I tried the panorama setting and WOWthe camera does all the work, you don't need any software to attain a great looking panorama.There are a whole bunch of settings built into this camera and it's easy to scroll through the menu's.", "Date": "August 16, 2012"}, {"Title": "best point and shoot", "Author": "J. Gonzalez", "ReviewID": "R3FAJTQCC4FPRR", "Overall": "5.0", "Content": "Fast shutter, crisp pictures, clear due  to  the  quality of lens,  flat,  light,  beautiful camera  , great in dark ,or low light, moving objects  focusing is  excellent always go for  Panasonic", "Date": "September 9, 2012"}, {"Title": "Value for money", "Author": "Aniket", "ReviewID": "R30S8AZTBFX44P", "Overall": "4.0", "Content": "I always love Panasonic Lumix cameras for their value. Although cheaper than the likes of Nikon & Canon, Lumix has always given me great results with my previous camera DMC-FZ28. So I decided to buy this one for my dad. I used it for a bit during my visit and was impressed by the HD video, which btw, you can zoom in/out only before you start recording. But this seems to be the standard in all the point-n-shoot cameras in this range. The photo quality indoors was good but not mind blowing. Seeing the results of this camera justified my trust in Panasonic.", "Date": "July 13, 2012"}, {"Title": "Camera is sweet; manual is not.", "Author": "Jill V. Svoboda", "ReviewID": "R384BDMIMOES10", "Overall": "4.0", "Content": "I like the camera in many ways--it will serve well for the purpose I wanted it--to keep it in purse or pocket and have it handy so the shot won't get away (carrying around my larger Sony SLR gets to be a bit clunky, even though I get great photos from it.) What I don't like is the manual--first, I had to download and print out over 100 8-1/2 x 11 pages. I had to punch holes in them all and stow them in a 3-ring binder. This is impossible to have it ready in the field when I'm most likely to need it. The type is small and the symbols are smaller yet. It also would be helpful if it showed all the possible screen symbols in one place--it doesn't, and to find what a particular one means requires close page-by-page study. I would be willing to pay a little more for a professionally printed pocket size manual.", "Date": "December 24, 2012"}, {"Title": "A huge disappointment", "Author": "Alison J. Prindiville", "ReviewID": "RLJAFMPN4DBV2", "Overall": "2.0", "Content": "This camera is such a disappointment to me after reading the reviews praising it.  The pictures are heavily pixilated.  Everyone who has seen my pictures both downloaded on my computer and on Shutterfly mention their poor quality compared to those I took with my old Canon and my old Olympus cameras.  I wanted to try Panasonic for a change and I am so sorry that I did.  On the plus side, the camera is very easy to use but that nowhere near makes up for the poor picture quality.  It also will not take pictures in motion or in dim light.", "Date": "November 4, 2012"}, {"Title": "Good camera for the price", "Author": "Electrical Engineer", "ReviewID": "R3IONK0BOLXTPH", "Overall": "5.0", "Content": "Bought this camera just before our family vacation. Once it arrived, didn't have time to read manual and was still able to take great pictures. Small size works great for carrying and is very user-friendly. Have always been happy with Panasonic products and this one does not dissapoint.", "Date": "June 23, 2012"}, {"Title": "Impressed at first, but.........", "Author": "Terrageezer \"Terrageezer\"", "ReviewID": "R2CTV1179XJRQ3", "Overall": "3.0", "Content": "When I first saw the Amazon listing for this product, I was immediately captivated by the idea of small pocket point & shoot that had the capability of a 16.1 MP picture.  After ordering it, when I opened the package I was again impressed by the size of the camera but just a bit concerned about the sturdiness of the camera.  Within two weeks of receiving the camera, my wife and I went on a vacation trip to Aspen, Breckenridge, and Keystone, Colorado.  We hit the countryside at the peak of color change with the Aspens.  The photo's taken with this camera outside were superb! The panorama setting was outstanding!  The only thing that I did not care for with the camera was indoor pictures - they all seemed to be overexposed and when the flash was used it tended to be a bit too strong/harsh for indoor shots.  The camera held up well during the vacation trip and seemed to use very little battery power.  Within two days of getting home the camera started having problems.  The motorized lens cover did not want to open.  The lens (which when the camera was turned on) would protrude beyond the camera's body quit extending and there was a grinding sound which would only stop when you turned the camera switch to off.  Again, the photo quality was fantastic - several of our pictures will be blown up for wall size hanging - but the durability issue was a real deal killer for me.  I think the camera would be fine for somebody who just picks it up every now and then to take a photo but not for someone who will use it most every day.Amazon's customer service was fantastic!  They helped me thru the return process from start to finish and credited my account back for the purchase minus a restocking fee (which I thought was a bit odd since the camera stopped working).  Overall, I am totally satisfied with their customer service and will absolutely no doubt buy again - just not this camera.", "Date": "October 20, 2012"}, {"Title": "Great camera if you have kids", "Author": "epeterson22", "ReviewID": "R1B5ONX3TNE911", "Overall": "4.0", "Content": "This camera doesn't necessarily take the highest quality photos, but not bad photos either.  The reason I love it though is because of how quickly you can shoot pictures.  There is so little downtown between shots, which is a huge deal if you have little ones!  My old camera took better photos, but took so long between shots that I usually ended up deleting them because it didn't end up capturing what I intended.  GREAT video quality!", "Date": "January 4, 2013"}, {"Title": "This is the best point & shoot camera I have owned.", "Author": "John E Herzog", "ReviewID": "R1QA8PBWLNYC2Y", "Overall": "5.0", "Content": "This camera has exceeded my expectations for this kind of camera. It is easy to use and the pictures are sharp. Very few blured pictures.", "Date": "November 17, 2012"}, {"Title": "Very poor image quality", "Author": "shortmatt", "ReviewID": "R112RNM4NB1AB", "Overall": "2.0", "Content": "After reading so many positive reviews, I chose this camera for my wife. I regularly use an Olympus E-300 DSLR, but my wife wanted something small, compact and point-and-shoot. This camera meets those expectations; the size is great and it weighs nothing. I thought the wide angle feature would be great for capturing life in action with three kids, but the images are grainy and blurred. At first I thought this was more user error because of so many positive reviews on great images. After reading through their manual, adjusting just about every setting that I can find, the images are just poor quality, making me think that the optics are subpar. My 11-year-old has an inexpensive Polaroid i735, 7MP camera. To test the Panasonic after seeing the image quality, I took multiple photos with both cameras in my daughter’s room using both natural light and lamps in the room. The Polaroid image quality is far superior, despite being a much cheaper, older digital camera that has been abused by a preteen for several years. Very disappointed!", "Date": "January 5, 2013"}, {"Title": "Nice Camera", "Author": "Mike in Ohio \"Mike in Ohio\"", "ReviewID": "R1ZCJRZ90O1M8L", "Overall": "5.0", "Content": "Replaced a Nikon Coolpix S600.  Loved the Nikon, but the power switch on the Nikon is a button, and when I slipped the camera in my pocket between taking pictures, the camera got inadvertently turned on, the lens opened and got jammed.  Now the lens body hangs and won't retract.  The Panasonic uses a sliding power switch which I believe is a much better design, because you can't accidentally turn on the camera.The Panasonic takes beautiful pictures and the battery life is good.  The Panasonic doesn't come with a separate charger, so you have to charge the battery in the camera.  I bought an aftermarket battery and charger so I can charge the batteries without plugging a cord into the camera.The LCD screen is very bright and clear, and viewable outside on a bright sunny day.  The shutter response is excellent.  I notice no shutter delay in reasonable day lighting.  I was in London on vacation, and I was able to take pictures of Big Ben, at night, by leaning my camera hand against a street sign.  The shutter open time was greater than a second, but the built in shake control worked very well.This is a very good camera for the price.  It is nice to have a camera for traveling that isn't bulky and doesn't make you stand out as a tourist.", "Date": "August 29, 2012"}, {"Title": "Sharp images", "Author": "Emilia", "ReviewID": "R17MQHOCAKPYC7", "Overall": "5.0", "Content": "Gives digital photos with sharp images and well defined borders and colors. Camera is the perfect size: not too big and bulky and small enough to fit in pockets and small purses.  One of the best buys for the buck!", "Date": "August 30, 2013"}, {"Title": "Software Difficult to Understand", "Author": "Linda from Lugoff \"Linda from Lugoff\"", "ReviewID": "RT7KORND1IFQF", "Overall": "3.0", "Content": "I feel like the camera is fine but the Panasonic software that came with it to edit, file and share the photos has a 161 page manual.  I have yet to figure out how to do anything other than take the picture off the camera and put them on my computer screen.  Not user friendly.", "Date": "July 29, 2013"}, {"Title": "Nice point and shoot camera", "Author": "Retiredat60", "ReviewID": "RXLZ8HRHTSX2A", "Overall": "4.0", "Content": "I purchased this camera after reading about it in Shop Smart (Consumer Reports) magazine.  So far, it has worked quite well.  I couldn't figure out how to shoot the \"Supermoon\" the other night, but perhaps I could do so if I did additional research.  It did a great job on photographing people, and my flowers.  Downloading the photos to the computer was no problem.", "Date": "June 25, 2013"}, {"Title": "Elegant", "Author": "Walker Fischer \"J.W.F.\"", "ReviewID": "R34KY94EQA7TPI", "Overall": "4.0", "Content": "Simple, rugged, easy to handle despite small,thin size. Shutter button a bit too sensitive for my tastes. Would prefer a separate battery charger instead of charging through camera.", "Date": "June 2, 2013"}, {"Title": "great camera", "Author": "JC", "ReviewID": "R3LGL5J67ZERVK", "Overall": "5.0", "Content": "This is a small compact camera with a lot of features.  It takes great pictures through glass.  It also takes great pictures from a moving vehicle.  I highly recommend this camera.", "Date": "May 11, 2013"}, {"Title": "Compact and easy to use", "Author": "Dee Sums", "ReviewID": "R2NS03T5BWWCF7", "Overall": "4.0", "Content": "I purchased this model as it was rated well and was reasonably priced.  I don't like having the user's manual in pdf form instead of hard copy and it's too large to print.  There are a lot of features including video, burst mode etc but I'll probably use it in the intelligent mode mostly.  I prefer using a card to the built in memory so I purchased that separately.  The usb port is a bit small so a little cumbersome to attach.  I prefer using a card reader but found mine doesn't support the newer technology so I'll be looking to purchase one of those.  I also purchased the extra batteries and battery charger as that was easier to use than charging the whole camera.  In addition I bought the soft case and that is working out well.  Eventually I hope to try out the other modes but for now this is a throw in the purse model for me as I have a larger Digital SLR camera I use for most picture taking.", "Date": "December 29, 2012"}, {"Title": "Nice Camera", "Author": "Warren", "ReviewID": "R1Z4XU4AWVDNQ", "Overall": "4.0", "Content": "This is a nice little camera that functions well.  My only complaint is that it came with no instructions which then required downloading them from the Internet.  Even then, the instructions were not the best.", "Date": "December 23, 2012"}, {"Title": "Very good camera", "Author": "Nurse exercisor", "ReviewID": "R2Z8RG9B71DUJG", "Overall": "5.0", "Content": "I chose this camera because it was highly rated by Consumer Reports.  I find it easy to use and easy to download to my computer.", "Date": "November 27, 2012"}, {"Title": "Great basic camera", "Author": "K. Wills", "ReviewID": "R2RWP8VCRCZDY7", "Overall": "5.0", "Content": "Bought this for an elderly relative who was still using disposable film cameras.  She figured it out right away and is very happy with it.  It was highly rated by the Consumer magazine.  Remember to buy a separate SD card -- it doesn't come with one.", "Date": "November 1, 2012"}, {"Title": "Amazing little camera", "Author": "Luis Alberto \"Luis\"", "ReviewID": "R1VMN5VJQ7KWTH", "Overall": "5.0", "Content": "I have received this camera a month ago and I have to say I am quite satisfied with it. I bought it because I needed a very small quality camera to complement my DSRL, one that could be taken anywhere with no pain. I selected the FH8 because of these factors:1.- Very small size.2.- Leica lens.3.- Good zoom range, starting with a very wide 24 mm equivalent.4.- Luminous f2.5 maximum aperture.5.- Easy use of the movie capabilities.6.- Excellent price.I must say, after using it for several hundred shots that the camera excels in its picture quality. The lens is simply fantastic, amazingly sharp. Noise is not a problem if you restrain the use up to ISO 400. The rear screen is very good, big and sharp with excellent luminosity. And the most important fact is that you can carry it anywhere because of its size. For me it is the perfect complement to a DSRL and just by the fact of its size you are never going to miss a photo opportunity because you are not always carrying a bulky piece (or pieces) of equipment with you. Of course you sacrifice the possibility of shooting RAW or having a manual mode. But I have found that is a small price to pay for the convenience of portability as the jpegs produced by this little jewel are of very satisfying quality.", "Date": "September 26, 2012"}, {"Title": "Amazing!", "Author": "Bartender X", "ReviewID": "RFCAC9RRYHACS", "Overall": "5.0", "Content": "I love the photos it took, and I love the size. Still learning to use it to it's full potential, but extremely satisfied and pleased with my purchase. A perfect pocket cam.", "Date": "September 18, 2012"}, {"Title": "Panasonic Lumix DMC FH-8", "Author": "T. Smith \"Out o Tune\"", "ReviewID": "R2DLAR14QRC6OO", "Overall": "5.0", "Content": "Purchased to replace worn out Kodak. Only wanted to spend between $100-200. After using camera for a couple of months, I would have paid $300 for this one. Crisp, clear pictures. Large screen. Quick and easy video transition from photo mode. Extra thin.  Wished it zoomed in a little more than 5x but one of the best smaller cameras I have ever owned. Great job, Panasonic.", "Date": "August 16, 2012"}, {"Title": "Not Fully Tested When Shipped", "Author": "noJohn Ramsey", "ReviewID": "R2986SXSR542RN", "Overall": "1.0", "Content": "had to send it in for repair immediately after I got it because it did not recognize the SD card when it was inserted.", "Date": "December 18, 2012"}, {"Title": "Panasonic Lumix camera", "Author": "Mrs. Judie", "ReviewID": "RT9YQ59TEYL4T", "Overall": "5.0", "Content": "Camera is easy to use and takes great pictures. Does not include a memory card. Instructions have to be downloaded and saved or printed.", "Date": "July 29, 2012"}, {"Title": "Great camera.", "Author": "art college professor", "ReviewID": "R1TPMJF456CB3U", "Overall": "5.0", "Content": "I love the new panoramic video/photo option! Lots of other good surprises, too. Taking this to France this fall. I give it a work-out, so I need to purchase a second battery and a battery charger.", "Date": "July 23, 2012"}, {"Title": "Nice for the money", "Author": "Vicki Anderson", "ReviewID": "R20P5H4SEZ9R4G", "Overall": "4.0", "Content": "I have not used the camera a lot yet but have down loaded the manual so that I can look at what I need to when  I need it! We are going on a trip to the southwest this winter and I am hoping for good luck with the Lumix. I  Hope to use the panorama feature at the Grand Canyon! I purchased this model because Consumer Reports gave it a good rating. It seems simple to use and from what I have seen, the photos look great.", "Date": "January 28, 2014"}, {"Title": "Great Camera", "Author": "Chris Kujellis", "ReviewID": "RJ91Z61ALZSEJ", "Overall": "4.0", "Content": "Very lightweight and compact. Simple to use.  Takes great pictures. Worked very will in my travels trhoughout Europe. Highly recommended.", "Date": "January 25, 2014"}, {"Title": "Great photos at a low price", "Author": "Micki Suzanne \"Author\"", "ReviewID": "R2Q7GWN3JLX02J", "Overall": "5.0", "Content": "I bought this pretty little camera to take photos of estate jewelry for eBay. I'm VERY pleased with the quality because my sales are only as good as my photos.And no, I didn't read the manual; it's pretty intuitive.", "Date": "November 25, 2013"}, {"Title": "Easy and very high quality optics", "Author": "Geniiii", "ReviewID": "R2UJOC48LNXHG7", "Overall": "5.0", "Content": "I love this camera.  Originally I wanted one with greater magnification, but this one has allowed me to \"film\"  Hummingbirds at a feeder, Belly dancers in a dark theater, and to take the best portrait photos of family members ever.  If you have a nice big heavy SLR that you keep leaving at the hotel because it takes over your life on vacations, buy this.  It won't replace the SLR, interchangeable lense for those professional photo shoots, but it will, for just about everything else.  The flash settings work well, it is easy to use Auto settings, and OMG it is tiny.  I especially like the analog zoom feature near the shutter button, fast response, and will use the digital settings to make your photo the best it can be.", "Date": "October 26, 2013"}, {"Title": "Light easy to use camera.", "Author": "James O. Eickhorst", "ReviewID": "R3FCOHRZ4H7VEA", "Overall": "5.0", "Content": "Light weight and excellent photos and easy to use. Excellent wide angle lens and very compact and fast speed and pocket use.  Should have come with a case, used previous Samsung case and memory card.", "Date": "September 24, 2013"}, {"Title": "Panasonic Lumix DMC FH-8", "Author": "corrientes", "ReviewID": "RTY5BZLDXYJOY", "Overall": "5.0", "Content": "After giving away my old camera, this is My new acquisition:it is really an intelligent camera..great!It is also very easy to handle", "Date": "September 17, 2013"}, {"Title": "Excellent P&S; (not POS) camera", "Author": "Donald P. Ridgway \"Delta f\"", "ReviewID": "RVKPUFAZSPJ07", "Overall": "5.0", "Content": "For about $160, this is a terrific very small camera. The wide angle is about 24mm (35mm camera equivalent), very nice. I dropped mine and broke it, but immediately ordered another, because I found myself using it at least as much as my $$$ Nikon. Great 2nd camera.", "Date": "August 28, 2013"}, {"Title": "Great Camera", "Author": "pamD", "ReviewID": "R2U9Q3DFYGVN4C", "Overall": "5.0", "Content": "This camera is my third digital camera and it is very similar to my Nikon Coolpix, so it is very easy to learn.", "Date": "August 26, 2013"}, {"Title": "Verry happy with this small camera", "Author": "ButterflyGuy", "ReviewID": "R373V78OCXWFLG", "Overall": "4.0", "Content": "I always like to carry a small camera around with me and this camera is almost perfect. I carry this camera in my pocket, but do put in in a case. Case Logic DCB-302 Compact  Case for Camera - Black Since I'm a gardener I don't want to get it dirty. The reason I bought this particular camera are #1 - it's rated as a Best Buy by CC and #2 - it's lens is large enough that I can actually clean it with a lens pen. LensPen NLP-1I have even take macro pictures of butterfly eggs and they came out great. I have great confidence that if I'm in the garden and need a quick picture, this camera will do a great job.Here's the only negative - it has a proprietary charging cable. Why they couldn't use a standard micro/mini usb cable I have no idea. I just have to label the cable and make sure I put it back in one particular place.I would also recommend the case and lens pen to keep the camera clean.", "Date": "August 21, 2013"}, {"Title": "Panasonic Lumix", "Author": "weeza", "ReviewID": "RI1R3XDUKMM4D", "Overall": "4.0", "Content": "I really like the fact that it actually explains what the diff. functions do.  It gets a little tricky when you aren't used to the camera and push the wrong buttons.  The manual on line is 128 pages long.  Has a lot it can do but also can be set on Auto and be very easy to use.  Love the size.", "Date": "August 12, 2013"}, {"Title": "It's wonderful!", "Author": "Laurie Weiss \"relationship coach, author\"", "ReviewID": "R28M0L5Q2U1DZC", "Overall": "5.0", "Content": "This is wonderfully small, exceptionally easy to use and takes great pictures. It also has a fast recovery time so I can take the second picture quite soon after the first. I love it for grabbing quick pictures of my grandchildren.", "Date": "August 9, 2013"}, {"Title": "Great pictures and easy to use", "Author": "Carol Calabresi", "ReviewID": "R2FEN3WCP1RHRG", "Overall": "4.0", "Content": "Most pictues I take are not complicated, they are taken to remember that point in time, this camera does that and more.  One of the special effects I do use is the panaramic feature.  It allows me to capture a scene that a simple focus shot can not do.  It, electronically, patches 3, 4, or 5 shots together into one picture and it works great.  It is a good camera for the money.", "Date": "August 9, 2013"}, {"Title": "It fulfilled my expectations", "Author": "ACalman \"ACAlman\"", "ReviewID": "R23SAEOJ3P02CI", "Overall": "5.0", "Content": "Lightweight, easy to use.Intuitive buttons, but if not there are easy to understand icons on the camera screen.Good thing since it comes without a manual.", "Date": "July 24, 2013"}, {"Title": "Got what I expected", "Author": "Joe Giambra", "ReviewID": "R2GFM3K5I7YQEQ", "Overall": "4.0", "Content": "We needed a simple point and shoot camera, and this camera met all of our needs.  We used it as a backup for our cruise to Alaska, and we were not disappointed with the cameras performance.  It took great pictures, and the few videos that we took with it were actually of quite good quality.I would recommend this camera for anyone looking for an inexpensive good quality point and shoot camera.", "Date": "July 14, 2013"}, {"Title": "Needs a manual", "Author": "Lois R Drachenberg", "ReviewID": "RQL75LFK7MIXB", "Overall": "4.0", "Content": "I wish it had a written manual.  One that I could take with me to refer to when learning all of the features and just basic usage.  The manual is downloaded into your computer.  Not too handy for new users.", "Date": "July 7, 2013"}, {"Title": "Very pleased", "Author": "M. Meulen", "ReviewID": "R15QL2DFEN8Q8Q", "Overall": "5.0", "Content": "Very nice camera.Pros:- Winner of consumer report test- fast startup (now I don't miss those cute baby moments any more)- high quality- ease of useCons:- noneNote: Does not come with sd Cart. I purchased a Sandisk Class 4 32GB and i'm very pleased.", "Date": "May 27, 2013"}, {"Title": "Panasonic Lumix DMC FH-8 camera", "Author": "Cheryl A. Wilcox", "ReviewID": "R1OFMXPGZU87MQ", "Overall": "5.0", "Content": "This camera does everything I wanted it to do!  It is smallenough for a pocket for purse.  I liked the clip to keep thebattery in place while removing the sd card.  Simpleenough to just pick up and use AND it takes greatphotos!", "Date": "May 10, 2013"}, {"Title": "Good basic camera", "Author": "Janet", "ReviewID": "R3A21TR8KJI33P", "Overall": "5.0", "Content": "This camera takes good pictures, is fairly straightforward to use, and is very small and lightweight for carrying.  I recommend it.", "Date": "May 7, 2013"}, {"Title": "Wonderful camera!", "Author": "Amber Mort", "ReviewID": "RXQS1VNSCYD72", "Overall": "5.0", "Content": "I love it!  It's very user friendly and takes great pictures.  It also does good with the video.  It was a great buy.", "Date": "April 19, 2013"}, {"Title": "Great little camera", "Author": "goodshoemom", "ReviewID": "RLJ3HGHK2O171", "Overall": "4.0", "Content": "We've had this camera for a couple weeks now and have been very happy with it. We bought it to replace our Canon PowerShot and that didn't have much power left in it's shot. The time in between pictures is much shorter than it was with our Canon which is a huge plus with two little kids that never stay still for long. It's also caught some great in-motion shots. I love how small it is! I can easy throw it in the small pocket of my purse or the back pocket of my jeans. The buttons are easy to find to quickly turn it on and take a quick shot. Overall, very happy.", "Date": "April 17, 2013"}, {"Title": "Great for the Price", "Author": "Ed Brink", "ReviewID": "R3L6PV8RZQ0EZ2", "Overall": "4.0", "Content": "I wish it had a viewfinder, but I knew it didn't, going in, and my wife loves it for the small size, fitting easily in her purse and thus always with her.  The lens and resolution are great, but you have to be sure, as with all autofocus cameras, to wait for the focusing to happen before you press the shutter button the rest of the way down.", "Date": "January 31, 2013"}, {"Title": "Panasonic Lumix DMC FH-8  16.1 MP Digital Camera with 5x Wide Angle", "Author": "Rich", "ReviewID": "REGQWS9QHIDKT", "Overall": "5.0", "Content": "consumer reports.com gave this camera a recomended and best buy rating. They said panasonic in general had the lowest repair records also.", "Date": "January 8, 2013"}, {"Title": "Nice little camera!", "Author": "karen belt", "ReviewID": "R2GF87XSJAEKYA", "Overall": "5.0", "Content": "I bought this camera for my son and he really liked it.  I tried his and I decided to buy one for myself.  My old Kodak was slow and out of date so this Panasonic was a treat.  We had fun with the panoramic photo option. (If you do it right you can have one person appear twice in a photo)  I like the larger viewing screen and there are many options.  I'm mostly interested in taking photos of my grand children and this is great for that. We actually have photos of my granddaughter in mid flight while jumping towards her dad.  The video seems fine.  All in all a good buy...especially for the price!", "Date": "January 1, 2013"}, {"Title": "great value", "Author": "M. Schneider", "ReviewID": "RV9Q3R9F1CDMP", "Overall": "5.0", "Content": "Great price and takes wonderful photos..easy use, looking for a good little camera, this is it. make sure to get a sdhc card card with camera", "Date": "December 28, 2012"}, {"Title": "I love my new camera!", "Author": "Susan Zepko", "ReviewID": "R1W5LQ5JBDWT7P", "Overall": "5.0", "Content": "Wonderful, very easy to use.  Very compact, fits easily into any small pocket or purse. Photos are truly amazing, buy it!", "Date": "December 16, 2012"}, {"Title": "Convenient camera, takes great pictures at the right price!", "Author": "wingate w. sikes", "ReviewID": "R1M4GSHU0BRI5F", "Overall": "5.0", "Content": "I bought this camera because I wanted one I could carry in my pocket all the time. Turns out it takes great pictures and video and is very easy to use. Plus it has advanced features (wide angle, panning, self timing, etc.) that I have found useful. The price was excellent.", "Date": "December 15, 2012"}, {"Title": "Solid, easy to use, basic digital camera", "Author": "Kenneth J Ferrell", "ReviewID": "R2441P5K0KQK2R", "Overall": "4.0", "Content": "Easy to use, buttons are well placed and don't turn on/off in case or in pocket. Large display screen for camera size.", "Date": "December 8, 2012"}, {"Title": "Still learning..", "Author": "quietlibrarian \"librarianperson\"", "ReviewID": "R2U1ZDKWEQME4S", "Overall": "4.0", "Content": "I like the size of this camera and the ease of using it.  The pictures come out clear. Easy to download pictures onto my computer which is a big item for me as I do scrapbooking.  I like the idea of being able to charge the battery and not worrying about replacing them.  Depending on what size picture you want to take, you can take as few as 16 or smaller pictures will allow you to take more pictures.  I would recommend this to anyone who wants a camera to take pictures without the hassle of making sure you aimed it okay. The viewing window is larger to see the picture too..", "Date": "November 27, 2012"}, {"Title": "Excellent camera", "Author": "Ryan", "ReviewID": "R3DYIVJSVDT5SD", "Overall": "5.0", "Content": "The only thing that's weird is that with the wide angle, anything that's a little closer looks a lot bigger. Few manual features.  The dynamic range is the biggest thing holding it back from being a truly excellent camera, but absolutely impressive that something this good can get to the consumer for this price.", "Date": "November 25, 2012"}, {"Title": "great little camera", "Author": "kathleen krasity", "ReviewID": "R131SWQUNVOMGK", "Overall": "5.0", "Content": "This is my first digital camera.I bought it to take pictures of my family, garden and travels and for my church website.I found it very easy to use, even the little extras.I used a panoramic photo of my garden as my Facebook banner.The photos are high resolution so you can crop a small part and still have high quality image.Only problem, the battery could last longer between charges.", "Date": "October 25, 2012"}, {"Title": "Pix Snapper", "Author": "Joya", "ReviewID": "R19AV95YZYW1RC", "Overall": "5.0", "Content": "Panasonic has made another wonderful and easy to use product. I went to Consumer Reports to find the one that had the features I wanted @ the price I needed.Image quality, video quality, lightweight, but above all ease of use.Of course AMAZON had the best price and because I have a Prime Membership, the free shipping and ease of RETURN was an issue too.Love my Pix Snapper !!", "Date": "October 23, 2012"}, {"Title": "Easy Peasy & GREAT pics!", "Author": "Luvzhorses", "ReviewID": "R2WWN0GYY171SQ", "Overall": "5.0", "Content": "This camera is all and more of what I was looking for.  I have a nice digital that takes wonderful still shots for my jewelry business BUT it won't take a picture of anything that moves <G>.  I needed a small digital (inexpensive) to take photos of the kittens I foster.  Needless to say they are NEVER still.  I did quite a bit of research before ordering this one.  I've owned Panasonic products before but never a camera. I've had it a month now and it not only takes beautiful photos and STOPS the motion (and mine) but it also takes perfect shots of my jewelry including closeups with the macro.  I never read documentation unless I have to and this camera is so intuitive I only had to check the purposes of the buttons and was on the road!  The settings are simple and easy and some even have a little scrolling marquee banner with additional info that displays with it.I was afraid at first that the small size would be a problem for me because I'm used to using a larger one with a grip.  No problem! I put the strap on as a precaution against dropping it, but it's size is just fine, in fact I can put it in my pocket for those unplanned photo ops if I wish.  The little case I got for it is perfect and has a caribiner style hook for your belt BUT if I went on a long trip I'd want more space for the back-up batteries and charger I also purchased.  This will definately be my travel camera!Don't be afraid to buy this baby.  It's a great camera even at twice the price I paid, which was terriffic!Happy \"shooting\"!", "Date": "October 21, 2012"}, {"Title": "Great value!", "Author": "The Blind Tiger", "ReviewID": "R34TR74P6C3V9X", "Overall": "5.0", "Content": "I've had a few low and mid-range point-and-shoots.  Usually I'm disappointed, but I read the reviews for this model and decided to give it a shot.  Camera is small, sleek, sturdy, and takes great pictures.  Incredible value, very happy.", "Date": "October 19, 2012"}, {"Title": "great camera", "Author": "C. A. Sobeski", "ReviewID": "R1G87A0F1802N8", "Overall": "5.0", "Content": "Just bought the camera and then went on a 3 weeks trip it was fabulous especially the wide angle lens and the zoom", "Date": "August 5, 2012"}, {"Title": "***Perfect Camera For a Novice***", "Author": "J. Ceralde \"SavnOne\"", "ReviewID": "R3MV6UF0X692KZ", "Overall": "5.0", "Content": "I've had some great digital cameras in my life and this ranks up with the best.  My last 2 cameras have been the Canon A570IS and the Lumix DMC-FS7.  First, the Canon was a great camera but due to having the camera fall one too many times it died after 2 years.  Having spent over $300 dollars on the Canon and having added more children to the mix, my wife and I decided to buy an inexpensive (NOT CHEAP) camera that had great Amazon reviews.  That's when I found the Lumix line of cameras.  I spent $150 for the DMC-FS7 and thought I hit jackpot because it was absolutely awesome!!!  Unfortunately, it got submerged accidentally while on a fishing trip (my fault this time) and never worked after then.  Since I was sooo impressed with the Lumix line, I chose to go that route a second time.  I wasn't let down.  This camera, even though $50 cheaper than the FS7, is equally impressive.  I love that I can quickly take pictures and not waste my time zooming in for the close up (possibly missing the perfect shot all together).  I can just crop it or resize it exactly how I like it later.  Not only will I be able to zoom in real close, I won't have to fix any pictures while at the store, wasting the time of others.  Additionally, with the O.I.S., I can take pictures on the go without worrying about blurry pictures because of my hand shaking.  It's amazing what technology can do.  I'm definitely no professional photographer but the quality of my pictures are just perfect.  Although I've read some poor reviews, I suggest you consider the ratio of good to bad reviews.  EVERY brand of camera will have their fair share of problems; there's no way to avoid them.  I strongly recommend the Lumix line, if not this specific camera.  It's definitely worth more than I paid.", "Date": "October 24, 2012"}, {"Title": "Great Camera for the price", "Author": "Mel", "ReviewID": "R1TP32SAJFWN10", "Overall": "4.0", "Content": "I reviewed alot of cameras before buying this one. I have bought Canon Powershots over and again in the past but i wanted something with more features.Pros:Quick shutter speedAlot of scene options (panoramic, through glass, sunset lighting)Easy to navigate toolsGreat Zoom & Great Picture QualityCons:The cord to connect to the computer is not a standard USB cord. Hope i dont lose this one....The only way to charge the battery is to plug into an adaptor that plugs into the camera via the cord. Or plug the camera into acomputer. A standard battery wall charger would make this much easier. As well as a standard USB. I know have to carry the plug adaptor as well the the 'special' cordBattery dies quickly and it was difficult to purchase an exact replacement", "Date": "October 11, 2012"}, {"Title": "Awesome pocket camera!", "Author": "RF", "ReviewID": "R1M5YI1R5U5ENX", "Overall": "5.0", "Content": "This camera is really easy to use and takes great pictures.Not alot of bells and whistles but it's not suppose to have many.I needed something to use quickly that takes great pics and this one has proven to work very well.I'm very satisfied.", "Date": "July 27, 2012"}, {"Title": "unbeatable price", "Author": "Heinz Simon Klump", "ReviewID": "R1MPZWE3GSO5PL", "Overall": "5.0", "Content": "This cam is amazing for the price. Small with everything and more you need to be ready anytime for a beautifull shot. Good job panasonic:-)", "Date": "July 16, 2012"}, {"Title": "no memory card", "Author": "cayucos", "ReviewID": "R35P22ZMDXLBHK", "Overall": "4.0", "Content": "Lovely little camera - no disappointment there. But, the purchase didn't include a memory card, so not knowing that, I took it on a trip.  Could only take 10 photos without erasing those I had just taken.Upon arriving back from trip, ordered the card. And I DO love the camera.", "Date": "October 3, 2012"}, {"Title": "Sad I spent my money on this", "Author": "A. Olson", "ReviewID": "R27LOCKLNQO30M", "Overall": "2.0", "Content": "After reading the reviews, I expected a great camera for the price, but I am really disappointed. The quality of pictures are poor and the videos are poorer. The videos look blurry because they are such low quality. Not being a camera person, I did not know cameras were still sold with quality like that.Update: I was able to return it without problems or charges.", "Date": "September 19, 2012"}, {"Title": "Hope you know Spanish", "Author": "Bobbie367", "ReviewID": "R1NGSFD70Y8Z35", "Overall": "1.0", "Content": "I ordered a Panasonic Lumix DMC-FH8 based on Consumer Reports recommendation.  It was sent by Worldwide Distributors from Las Vegas.  It came with a warranty only good in Latin America and an instructional CD in Spanish.  I don't know Spanish so need to return it.  Wish I knew that FBA products were a problem. When trying to do a review on this situation, the Amazon website encouraged me to talk with someone to solve the problem.  The Amazon rep said the product was from Worldwide so to call them.  I did and WorldWide said the product was Fulfilled by Amazon (FBA), so they were not responsible.  So I called Amazon again and they connected me with Tech Support.  Answer, send it back. Guess there is no manual in English.", "Date": "July 15, 2013"}, {"Title": "Insructions", "Author": "John Skelton", "ReviewID": "RB5891O7UVT71", "Overall": "4.0", "Content": "Camera works well as advertised but instructions are difficult unless you download and print the detailed full set of instructions, 70 pages.", "Date": "April 29, 2014"}, {"Title": "Works Great so far", "Author": "Brian C. Starzman \"bstar\"", "ReviewID": "R2889GCEP2RQHH", "Overall": "5.0", "Content": "Purchased the camera recently and used it only on a 3 day trip to Vegas so far. Works great and very convenient with its compact size so I was able to just keep it in my pocket. I would never bring a camera on trips cause it was too much trouble to carry it around. Also its able to zoom in 5x, picture quality is good and the battery lasts a very long time. The battery lasted for 4 days until almost dead. I took over 120 pics and would always switch off when not using it. It was exactly what I was looking for. Will update if I encounter any problems.", "Date": "March 22, 2014"}, {"Title": "Great little pocket camera", "Author": "Lee B. Oneal \"Instrumentation engineer\"", "ReviewID": "R32R6WGRHCMEHH", "Overall": "5.0", "Content": "Bought this for my adult son as Christmas gift.  He has two kids and has made good use of it.  He has commented positively several times on its features.", "Date": "March 16, 2014"}, {"Title": "OK....not great", "Author": "Stonebroke Kennels", "ReviewID": "R2250JHBLBR8EN", "Overall": "3.0", "Content": "If you're looking for a backup camera to carry in your pocket that takes acceptable, but not great photos, this camera is ok.  It eats up batteries very quickly, especially if you are outside and it is cold.  Indoor photos are rather poor....I'm guessing because of a weak flash.  Outdoor photos are decent, but you get what you pay for.  I bought this camera as a backup to my digital SLR...If I'm on vacation and have a problem with my digital SLR, this camera will be ok or if I want something to stick in my pocket and don't want to carry a larger camera around.  Photo quality is about what I expected from a low cost camera.  Again, the photos are not terrible but they are not what you'd get from a higher end camera by any means.", "Date": "March 9, 2014"}, {"Title": "Just The Camera I Needed", "Author": "Fran", "ReviewID": "R28MAIUXNCOK1P", "Overall": "5.0", "Content": "I am 65 years old and not tech-savy regarding more recent advances.  I have never owned/used a digital camera before this, and I just wanted a small camera that I could use for family pictures, and this camera fit the bill.  The software included was easy to install, making it easy to download pictures for saving on my computer and e-mailing to others (I don't facebook). Now I can electronically submit selected pictures to my corner drugstore and have prints made in an hour.  The camera also has a video feature, which I haven't used yet, but understand how to use, and a built-in microphone.  This camera is all this old girl needs.", "Date": "February 11, 2014"}, {"Title": "Great Pocket Camera", "Author": "Yurnik", "ReviewID": "R1IGY6OSD95N06", "Overall": "5.0", "Content": "The very wide angle lens is a bonus in cramped spaces and for groups of people.  Great pocket camera for the beginner", "Date": "January 21, 2014"}, {"Title": "Very easy to use and takes great pictures", "Author": "rejiii", "ReviewID": "R40CNZKMU80YA", "Overall": "5.0", "Content": "This is a very compact camera that takes great pictures.  Interfacing to the Mac via IPhoto was very straight forward.", "Date": "January 17, 2014"}, {"Title": "Great gift.", "Author": "Mozi", "ReviewID": "R1IWSRUEL6UI7W", "Overall": "5.0", "Content": "I got this for my wife last year and we love it the Intelligent Auto setting makes the all the difference for us great photos with no actual knowledge needed from us.", "Date": "January 13, 2014"}, {"Title": "Great little camera", "Author": "R. Dayton", "ReviewID": "R19EWSLAIG53W8", "Overall": "5.0", "Content": "My wife uses this camera and has had a great experience with it. The photos are very clear and the camera takes good video. Very pleased. Quality product.", "Date": "January 1, 2014"}, {"Title": "nice camera, would recommend it to my friends", "Author": "Roman Valdez", "ReviewID": "R36LZ1BF301QC6", "Overall": "4.0", "Content": "it is lightweight and compact, excellent resolution and easy to use.  I would like to see an easier zoom control.", "Date": "December 10, 2013"}, {"Title": "Love it", "Author": "Michelle Custer", "ReviewID": "R3SN5ENMD13WBB", "Overall": "5.0", "Content": "Love this camera, not great for action shots or it could be the photographer issue.  Not super techy when it comes to cameras so this one is perfect for me.  Not real great at using the video on it but have been able to finagle a few of them.  You will definitely want to get a memory card of 4GB+, awesome camera for the $$.", "Date": "December 2, 2013"}, {"Title": "A good point and shoot", "Author": "D. Menning \"English instructor\"", "ReviewID": "R2J7M19G64LH3Q", "Overall": "5.0", "Content": "I bought this camera to take to Europe.  I don't like lugging my Canon Rebel when I'm sightseeing but do want decent pictures.  This camera was easy to carry and easy to keep away from pickpockets in Paris.  I was happy with my photos when I returned home, too.", "Date": "November 26, 2013"}, {"Title": "Nice camera", "Author": "JET lady \"JET Lady\"", "ReviewID": "R3FA87SPIKGM17", "Overall": "5.0", "Content": "Meets my needs nicely as a plain vanilla person.  Only want to take family pics.  Appreciated reading all the reviews prior to my purchase.  Thank you.", "Date": "October 19, 2013"}, {"Title": "Lumix DMC FR8", "Author": "bumperhead_1951", "ReviewID": "R3UMWSSOM8OR2L", "Overall": "5.0", "Content": "good value for the money,  easy to use.  easy to transfer pictures.  as ususal a larger sd card is a necessity.", "Date": "August 22, 2013"}, {"Title": "GOOD TRAVEL  CAMERA, ALL AROUND SHOOTER", "Author": "george  Vance", "ReviewID": "R3QEHNUHC0LVNY", "Overall": "4.0", "Content": "IT HAS A COMPLEXITY THAT GIVES YOU MANY OPTIONS FOR STILL OR MOVING PICSVERY COMPACT, A GOOD CAMERA AT A GOOD PRICE", "Date": "August 18, 2013"}, {"Title": "Great Camera", "Author": "Loven Laundry Day", "ReviewID": "R35O4Z7TB9FK5S", "Overall": "5.0", "Content": "Love this camera. Very easy to operate and down load pics to my computer. For a small light weight camera it takes great pictures.", "Date": "August 5, 2013"}, {"Title": "Small and handy to carry along. Good photos. Easy to learn and use.", "Author": "M. Wells \"readsalot\"", "ReviewID": "R2YX83BOQ0UKM7", "Overall": "4.0", "Content": "When my old Sony with its heavy telephoto lens is too cumbersome to take along, this Panasonic camera is useful. Goes almost anywhere.", "Date": "August 2, 2013"}, {"Title": "Not very substantial", "Author": "Melvin Holmes", "ReviewID": "R33CLI0F3EHHNB", "Overall": "2.0", "Content": "Always afraid I am going to break it when I change batteries or pull the memory stick.  Ok for a small, inexpensive camera.  Would not recommend to others.", "Date": "July 31, 2013"}, {"Title": "Panasonic Lumix DMC FH-8 16.1 MP Digital Camera with 5x Wide Angle", "Author": "Vera Dye", "ReviewID": "RFF6PJGRI0ATL", "Overall": "3.0", "Content": "I like that you charge the battery while it's in the camera. No need to ever remove.I don't like that it doesn't came with a paper manual. So, I read some than try to find it on the camera. If I forget something, I have to go back to the disk and try to locate the information. I guess I'm old school (but, I'm not that old)I've taken about 20 picture and the quality is fine. Looking for info on how to take 5 rapid pictures.", "Date": "July 29, 2013"}, {"Title": "Keeping it simple.", "Author": "PaddleBikeHike", "ReviewID": "R1GJAN63EGXRR9", "Overall": "5.0", "Content": "This camera has become an all time favorite because its so easy to use and takes awesome photos. I don't see how, for the money, you can beat it. The FH8 is small and can easily slide into your pocket or be brought along anytime, every where. I just keep it with me when I leave the house. A particular feature I like is the information displayed which describe the various setting. No reading a manual needed!", "Date": "July 27, 2013"}, {"Title": "Nice camera and recorder.", "Author": "Elizabeth M Sprinz", "ReviewID": "RV5AZUUY7UJZ7", "Overall": "5.0", "Content": "All I can say is this is a nice camera and easy to record movies of my grandchild.  Easy to charge and get close ups or expand the shot.  Downloads are easy too.", "Date": "July 19, 2013"}, {"Title": "Nice Camera", "Author": "B.B", "ReviewID": "RQ1N774C8OKJ8", "Overall": "5.0", "Content": "Used it for hiking during a vacation.  Worked well, enjoyed having the ability to use variety of widths.  Easy to grab and shoot.", "Date": "July 13, 2013"}, {"Title": "does the job", "Author": "diane hogberg", "ReviewID": "R2OHREDIIDB4M2", "Overall": "5.0", "Content": "I love the tiny size.  also, I didn't want a high tech camera, this one does more than I need.", "Date": "July 6, 2013"}, {"Title": "Good camera!", "Author": "Retiree \"engineer\"", "ReviewID": "RKV1CSBL7T38E", "Overall": "4.0", "Content": "Overall picture quality could be a little better.  Easy to use, good battery life.  Excellent video.  Image stabilization is very good.", "Date": "July 6, 2013"}, {"Title": "Panasonic Lumix DMC FH-8 camera", "Author": "purple lady", "ReviewID": "RQDVHUNBKWQR", "Overall": "5.0", "Content": "Love the camera.  It so small it fits in my purse.  Takes great pictures.  I wish panasonic made a case that fit it, most are too big.", "Date": "June 27, 2013"}, {"Title": "Fantastic camera for travel", "Author": "P. G.", "ReviewID": "RO7XSSDOZHAGZ", "Overall": "5.0", "Content": "We have just used our new camera on a couple trips where I took pictures indoors, outdoors, in caves, visiting a large aquarium, etc. It was so light and compact to carry in a pocket or side compartment in my purse. The pictures came out fantastic using the autofocus. I couldn't use the flash  in the aquarium and even all the pix of fish, jellyfish, stingrays, etc. in the water were great!  Color and clarity were supurb. I'd been a Canon user for years but am definitely now sold on this  Panasonic.", "Date": "June 20, 2013"}, {"Title": "great small camera", "Author": "happy nites", "ReviewID": "R1JRABLG0HD4UC", "Overall": "5.0", "Content": "this is a tiny camera that gives excellent photos, that look like a professional took them with a larger camera.  The other main feature i like is it does not need aa bateries, but has a rechargeable battery.", "Date": "June 13, 2013"}, {"Title": "Tiny!", "Author": "J. Dawson", "ReviewID": "R1HVFI4HHC9BDO", "Overall": "5.0", "Content": "I just got this to replace my water damaged Panasonic Lumix.  My old one took great pics and was easy to use.  This one is easy, also.  I was surprised when I got it how tiny it is! It is smaller than my iphone 5 by about 3 cm in length, and is about the same thickness (with phone case on).  It will be so easy to keep in my purse or my pocket.  I figure if you don't have your camera handy you just won't take pictures, so this will be easy and available.  I really like it!  LOVE the zoom and ease of use.  Haven't taken a lot of pics yet, but so far they look clear.", "Date": "June 12, 2013"}, {"Title": "Love the camera", "Author": "Marietta Willman", "ReviewID": "R7TCW586TQKTA", "Overall": "5.0", "Content": "I got the camera one week and went to Europe the next.  It took very clear pictures and I loved my photo book!", "Date": "June 3, 2013"}, {"Title": "not so good pocket camera any more", "Author": "Linda C Young", "ReviewID": "RUJZVDXFGZEPB", "Overall": "5.0", "Content": "It takes beautiful pictures, is easy enough to use, and, best yet, I can put it in my pocket and take it with me wherever I go.  Only thing I don't like is, It doesn't have a great big zoom, but it's so small, I might be able to find a camera with a nice long zoom and take that one along with me too.Three months later:  Sad, but the camera stopped communicating with the computer and I've bought cords, a new sd card; I may have to send it back to the factory in hopes of getting it to work again.  It would have been 10 times cheaper and 100 times less frustrating if I'd just bought a new camera, and it's too late to send it back.  Oh well, I'll never buy anything like that used again.  It was a big waste of $$.  As of today, I'm sorry I bought it.", "Date": "June 1, 2013"}, {"Title": "Panasonic Lumix DMC FH-8 16.1 MP Digital Camera", "Author": "KC", "ReviewID": "R3KUFEU1B1WIVL", "Overall": "5.0", "Content": "My sister had one, so I knew what to expect.  I came home after visiting her and ordered one myself.", "Date": "May 25, 2013"}, {"Title": "Great Camera", "Author": "renacat3", "ReviewID": "R3KUJBOBD96C04", "Overall": "5.0", "Content": "This is a great little camera for traveling. It fits into pockets and travel bags and the power button is a switch so you can't accidentally turn it on. I downloaded the manual but haven't tried to use how to play with the photos I took yet. I chose this camera because it was highly rated in Consumer Reports.", "Date": "May 15, 2013"}, {"Title": "Amazing photos for a small camera!!", "Author": "megan fiedler", "ReviewID": "R2QDSXCLW990IX", "Overall": "5.0", "Content": "This is a great camera if your looking for a small one to bring around. You can't beat the price and the photos come out great! I would  buy this again in a second!!", "Date": "May 9, 2013"}, {"Title": "Lens froze after exactly one year", "Author": "A. Dahl", "ReviewID": "R1V96W21GG8XTX", "Overall": "2.0", "Content": "Overall I love this camera. However almost to the day that the warranty expired while on vacation I was using the camera with a low battery when suddenly the lens froze in the extended position and now I get either a \"Zoom error\" or \"please turn camera off and back on again\" message whenever I power it on. Recharging the battery has not helped it is still frozen. Will have to wait and see if Panasonic warrants the damage or not but I am definitely not happy, especially because my previous Lumix camera (DMC-FX12) worked flawlessly. Perhaps it's just a fluke or perhaps Panasonic quality is slipping, hard to say. I would recommend to one and all however that you not use this camera if you have less then two bars showing on the power meter to prevent your lens from becoming stuck too.", "Date": "May 4, 2013"}, {"Title": "Not dissapointed", "Author": "Wild bird lover", "ReviewID": "R33K5FOKDCDDU3", "Overall": "5.0", "Content": "Nice quality and feel (metal not plastic) good pictures and the zoom pictures are fantastic and soooo easy to use mentally and physically.", "Date": "April 30, 2013"}, {"Title": "Digital Camera", "Author": "maria a millan j", "ReviewID": "R19TZKS47ZOZJO", "Overall": "5.0", "Content": "As the name \"Bloggie\" suggests, this camera is all about social networking. It's a breeze to make your video, plug it into your computer, trim the length, and then with the click of a button you can upload it to sites like Facebook or YouTube.Nevertheless, this camera has some real shortcomings. It has no optical zoom and takes very poor still shots. Even in good outdoor lighting, I was disappointed. It does not have a flash, though it does come with a mediocre LED light. You will definitely want to buy a separate digital camera if you plan to take a lot of still shots.The design of the back of the camera also makes it difficult to hold with one hand. When taking a video, my thumb keeps wanting to bump into the directional key, which causes the lens to zoom in or out. Another big drawback is that the Bloggie does not have RCA jacks to plug into a traditional TV, nor does it have an AC Adapter (you have to charge it using the USB cable, which means you'd better have your computer with you if you plan to do very much recording).", "Date": "April 29, 2013"}, {"Title": "Great camera.", "Author": "sklaw5 \"sklaw5\"", "ReviewID": "R1RDLJG6RZTPZ9", "Overall": "5.0", "Content": "Great pictures, easy to use, small and great for traveling.  Not having to change batteries is one of the best features.", "Date": "April 29, 2013"}, {"Title": "Great Camera, Great Price", "Author": "Deus Malleos", "ReviewID": "R3KK3KAYY1WKGG", "Overall": "5.0", "Content": "I am loving this camera.  It is easy to use, takes great pics and fits in my pocket.  What more could one want?  And the price?  I got the camera, a case and a 16GB SDHC Flash Memory Card for $179.00.  Great value!!!", "Date": "April 25, 2013"}, {"Title": "Great compact camera!", "Author": "indianaj222", "ReviewID": "R2X1LEGCC2VLBM", "Overall": "5.0", "Content": "This camera was highly recommended and rated by Consumer Reports. CR delivers again! This camera has been wonderful! We just took a Disney Cruise, and we took this little dude along. It was easy to transport and took great pictures in all lights. It is hard to find since this model is no longer produced, but grab it if you find it.", "Date": "April 22, 2013"}, {"Title": "Lumix", "Author": "Jason Hicks", "ReviewID": "R3T5NU5CEFE1V", "Overall": "5.0", "Content": "Tell you what, after a lot of reasearch this was the winner!  Wife and I needed a small slim camera to take to an awards show in Vegas and this little Panasonic is fantastic.  I but a 16gb memory card in it, charged it and started taking photos.  The easy mode is great, very little lag time between photos, battery life is fine.  We took 278 pictures in 3 days without a charge and thats including 3 videos.  Used it in all lighting conditions, decent zoom, it captured every moment we were hoping it would.  Its just a great camera all around!!", "Date": "April 19, 2013"}, {"Title": "Best Point and Shoot Camera!", "Author": "Amy Smith", "ReviewID": "R1KVVGVY3CAKUQ", "Overall": "5.0", "Content": "Best camera I've found. Very small. Super fast response. Clear, detailed images. Battery life lasts for a long time. I am very, very pleased and will recommend it to others.", "Date": "April 18, 2013"}, {"Title": "I Love this camera", "Author": "jack savage", "ReviewID": "R1BUZRQ9PTRISZ", "Overall": "5.0", "Content": "Very good pictures and easy to use. It stores images without a storage card! I would recommend it tto anyone who needs a great small camera for traveling.od", "Date": "April 11, 2013"}, {"Title": "Nice compact camera", "Author": "airborne", "ReviewID": "R2FJVI2Z3S40KT", "Overall": "5.0", "Content": "Does many of the things that my much larger SLR camera does, including a very good macro. Overall a great camera that is easy to carry.", "Date": "April 9, 2013"}, {"Title": "5 Stars!!", "Author": "Dan Shields", "ReviewID": "R2UHJRYYW9ILQA", "Overall": "5.0", "Content": "Looking for a good quality camera that won't drain your bank account? This is for you!After hassling with Sony cameras [3] that just gave me grief after owning them for 6 months, I had to find another company that could come through with a decent camera. I took a gamble on Panasonic not knowing much about their stuff, other than they make radios for General Motors and Toyota and seem to work and function with great ease. I bought it in June 2012 right before my trip to Niagara Falls and Toronto for a weekend, it gave me no hassle and did what I commanded it to do. With 16.1 megapixel capabilities the pictures look much more high quality in my opinion, and that may be because I was so disappointed in the Sony products before hand. I would recommend this to you, because the pictures look more than great, battery life is exceptional, it's easy to carry around and it looks damn good!", "Date": "April 2, 2013"}, {"Title": "Great Camera", "Author": "Cinda Daniel", "ReviewID": "R34HCCQ9G81EQ6", "Overall": "5.0", "Content": "Small and easy to use.  Read other reviews or I would not have even considered Panasonic for a camera.  Love it.", "Date": "March 25, 2013"}, {"Title": "great little camera", "Author": "Irma R. Frazier \"rosiefraz\"", "ReviewID": "R3T3XXOJPVIW2F", "Overall": "5.0", "Content": "So far I have really enjoyed this camera.  Haven't used it a lot yet, but going on a trip soon, so I will know more then", "Date": "March 18, 2013"}, {"Title": "Smaller than I expected", "Author": "Amazon Customer", "ReviewID": "R27JE0GGQU3WDZ", "Overall": "5.0", "Content": "So far great little camera. Wasn't expecting so small. So I need to be careful where my hands are so I don't get fingers in the photo or smudges on the led viewer-which is kinda hard to see on a sunny day. But it's easy and I haven't read about everything it can do yet. I like that it tells you what the aperture and speed is of each photo you take. I don't know if it keeps it anywhere once you download your photos?? So far very easy to use basics.", "Date": "March 10, 2013"}, {"Title": "Excellent camera", "Author": "Joanne Morlote \"jmorlote\"", "ReviewID": "R6E86J47XQXR0", "Overall": "5.0", "Content": "I purchased this camera for my grandson.  He is studying in Mannheim Germany this semester.  He has posted many pictures on his facebook page.", "Date": "March 6, 2013"}, {"Title": "Sweet camera", "Author": "Jon & Jackie", "ReviewID": "R2DB3HYKFKEZJ2", "Overall": "5.0", "Content": "Rated a best buy on Consumer Reports. Bought this for my wife. She loves it. It takes great pictures in regular and low light situations and it fits in her purse. She also has a big Cannon SLR camera but now that one stays at home and she uses this little compact camera for most of her picture taking.", "Date": "March 2, 2013"}, {"Title": "This a very nice little camera", "Author": "Never Give UP", "ReviewID": "R2RJXXQ83PGISE", "Overall": "5.0", "Content": "This was exactly what I wanted, The only thing I can think to say negative is that it didn't come with a removable storage disk. But they aren't too expensive and easy to find. The irony about this is that the day it arrived a whole family of deer showed up in my yard and got their pictures taken many, many times. How's that for timing.", "Date": "February 7, 2013"}, {"Title": "Great Point and Shoot", "Author": "JB", "ReviewID": "R2TFRQQ4HCY37U", "Overall": "5.0", "Content": "Great camera for quick point and shoot jobs. I'm no photography expert but for this camera serves my needs spectacularly.", "Date": "February 3, 2013"}, {"Title": "Very versatile, easy to use.", "Author": "Yeoman Johnson", "ReviewID": "R1NXQAPF6ATE94", "Overall": "5.0", "Content": "The camera works very well. Battery life is very good, and it's easy to figure out without needing to refer to the manual. Highly recommend.", "Date": "January 29, 2013"}, {"Title": "Best pocket camera I've owned", "Author": "newbie2", "ReviewID": "R134NZ94WIPJWC", "Overall": "5.0", "Content": "This is the 6th pocket-sized digital camera I've owned, and it's definitely the best.  It's super small and light-weight, and yet it has an awesome zoom.  It also takes great pictures, and I love the \"record button\" feature.  Great buy!!!", "Date": "January 21, 2013"}, {"Title": "This is really great for the price.", "Author": "F. Purcell \"Hoyt Purcell\"", "ReviewID": "RKVTT1H61XJNU", "Overall": "5.0", "Content": "I thought this camera would be hard to operate because of its small size, but it takes very steady pictures and videos. Took it to my 60th high-school reunion and made a video of a presentation to put on Shutterfly. This came to my attention by being recommended by Consumer Reports. Just a great and handy camera.", "Date": "January 21, 2013"}, {"Title": "Panasonic Lumix DMC FH8", "Author": "James", "ReviewID": "R2680V35BAXOWA", "Overall": "5.0", "Content": "Great camera, easy to use and great price. Arrived fast and works great no problems so far, ahppy with purchase.", "Date": "January 18, 2013"}, {"Title": "Great camera!", "Author": "HCSader1973", "ReviewID": "R2X5SSN0ZJ8I53", "Overall": "5.0", "Content": "The product arrived as advertized, on time, and in tact. This little camera is a functional giant. It is easy to use, both for still shots and movies.  Its zoom function is convenient and simple. It is stylish and fits easily in a pocket. So you are more likely to bring it along and use it. Great camera!", "Date": "January 14, 2013"}, {"Title": "great little camera", "Author": "gp", "ReviewID": "R18Y06G2MCBGO8", "Overall": "5.0", "Content": "very compact. Sharp lens. Wonderful HD video. Would be nice to have a short version user guide enclosed rather than a cd or internet lookup.", "Date": "January 8, 2013"}, {"Title": "Ideal companion", "Author": "TILII", "ReviewID": "R30DVOADMK0SJM", "Overall": "5.0", "Content": "It's a Panasonic - it works very well. Bought as a gift, it has fulfilled all expectations. Used in 'intelligent' mode, it puts out excellent pictures. Bundled software looks very, very old. Manual on a CD is just about OK, but contains approx. 120 little pages.", "Date": "January 8, 2013"}, {"Title": "not bad for the price", "Author": "David Larson \"traveling birder\"", "ReviewID": "R1M5Z3G8220OLA", "Overall": "3.0", "Content": "I have had several Lumixes. This one is not as good as some, but not bad. Smaller size makes it harder to handle for large hands. Switch between photo and playback is kludgy. Macro function does not work as well as on the last one,", "Date": "December 11, 2012"}, {"Title": "Panasonic Lumix DMC FH-8 16.1 MP Digital Camera with 5x Wide Angle...", "Author": "John N Danojk4744", "ReviewID": "R2CBGE1U42WGJR", "Overall": "5.0", "Content": "Excellent.  Very happy with performance.  Only missing feature is abilty to take multiple self timer exposures with single click of shutter.", "Date": "November 30, 2012"}, {"Title": "Great picture and quality for price !", "Author": "Chris Stanford", "ReviewID": "R963QHL7PZMQP", "Overall": "4.0", "Content": "ALSO CAN INSERT SD CARD INTO TV FOR HD PICTURE VIEWER OR USE SPECIFIC HDIMI CABLE TO VIEW AS WELL , THIS WAS ASKED , SO YES IS THE ANSWER THIS IS EQUAL TO A 500$ CAMERA WITH REPLACABLE SIZE LENSES AND HAS TONS OF FEATURES !!!This is a good camera but its very light and brittle feeling !!!!  , The camera does take great quality pic,s and video , the only thing that sucks is you have to constantly switch a crappy little easily breakable tab to go from taking pictures and then to viewing them and for the 2 separate menus !!!! also another loose junky button on top to turn it on instead of the normal digital press down !!benefits , many features ,yea it will take time to get use to as much as this little camera packs in but its a great hd lcd camera !!!I took a picture of my Bengal cat and you could see each individual hair it was amazing like the first time you switched from a 480ptv to a 120hz refresh rate 1080 p led tv and o[on the mg the difference it makes well that's how this camera was compared to my 14 mp cyber shot that was a p.o.s and I hate having {on the cyber shot} to charge the battery out of the phone ? what idiot though that was a good idea .Well this one you charge internally but you get jewed on the 5\" of usb cord and adapter I mean come on give a foot or 2 to reach the top of the night stand , well that the review its worth 80 bucks I got it in all black for like 120 so iAM CONTENT . Its great for a under 150$ camera in that class by far the best pic ive seen and the only one you can still use a internal charge and up to a 64 gig sd card class 10 sdhc I am using a 16 gig and it works perfect .", "Date": "April 30, 2013"}, {"Title": "Love it!", "Author": "snreed98", "ReviewID": "R3VA8DM58T3BV6", "Overall": "4.0", "Content": "Great little camera that takes big pictures! Easy to carry and fits in any pocket,  in any purse, and comes out ready to shoot.", "Date": "January 18, 2013"}, {"Title": "I am not impressed...so far", "Author": "DCM \"Dave - World traveler\"", "ReviewID": "R6BOTA1BIQHSR", "Overall": "2.0", "Content": "I bought this hoping i would be able to switch this camera on and take a quality picture. That just has not been the case. Hence the two star rating.In fairness, I have almost never taken quality pictures- with any camera, but this one was supposed to change that dynamic.I have a job where I travel to exotic places. I got tired of cell phone pix for fotos of these exotic places and wanted a camera that could take high resolution, clear pix.I have been dissatisfied for sometime, but today I decided to put it to the test. I am in St. Petersburg Russia today. Every time I took a picture with the LUmix camera, I took one with my ratty old Blackberry camera.Without exception the one's I took with the BB are superior to the Lumix pix. One particular gripe, and maybe this is just my camera stupidity, is that when the background is brighter than the subject, the background just becomes a blur. Not so with my BB camera.Some people are using this camera and are happy. I am not and if I could get my money back I would.I do not recommend this camera if you are looking for a simple point and shoot picture taking solution,it hasnt been for me.", "Date": "September 22, 2012"}, {"Title": "not so great", "Author": "Roza", "ReviewID": "R3UNSKMDJ1FH1I", "Overall": "2.0", "Content": "Picture does fine ..but very bad videos. Just terrible ...cant make any good videos. pictures is ok but also not so great", "Date": "October 26, 2013"}, {"Title": "Highly portable and great for stills and video", "Author": "Shonnie Lavender \"Leadership Coach\"", "ReviewID": "R1XR03WUXHDVZI", "Overall": "5.0", "Content": "We bought this camera to have a very portable, lightweight camera to use on a family vacation. I brought the big SLR camera too but only took it out once in 2 weeks. The Panasonic Lumix perfectly met our needs for taking both still photos and videos. It was so nice to have a camera always at the ready for capturing memories of our adventures on \"film.\" I really appreciate the one button video start/stop option so there's no working through screens or options to switch from still to video. See what you want to start recording; push the red button and you're on your way!", "Date": "August 21, 2013"}, {"Title": "Missing parts", "Author": "Diana Spencer", "ReviewID": "R1K5RLDJIDZT7B", "Overall": "2.0", "Content": "This Panasonic camera was shipped to me without the CD-ROM VFF0940; all of the other accessories were also missing - the DMW-BCK7PP, the VSK0768, the cord DMC-SZ1, DMC-SZ02, K1HY08YY0025, DMC-FH8, K1HY08YY0015; the DMC-SZ1 K1HY08YY0026, the cord VFC4297.The only item I received was the camera itself and a little paper booklet.", "Date": "August 9, 2013"}, {"Title": "Luv this camera!!", "Author": "S. Gardner", "ReviewID": "R27UTD96SA262H", "Overall": "5.0", "Content": "Enjoyed using this camera. Colour's great and gained attention from friends who admired the colour. :DEasy to use. Happy with it.", "Date": "May 12, 2013"}, {"Title": "Poor quality pictures", "Author": "CR JH", "ReviewID": "R2C8HNADAQJKVA", "Overall": "2.0", "Content": "The good: This camera is cheap, easy-to-use and lightweight.The bad: The quality of pictures is terrible, not mediocre but really terrible. Do not ever plan on cropping a photo or enlarging it. It will be grainy and the colors will be misrepresented, particularly in low light conditions. Additionally, you need the camera to charge the battery (there is not a separate charger), so make sure to buy an extra.Overall: It is a very compact, easy-to-use camera that takes bad photos.", "Date": "April 6, 2013"}, {"Title": "Writing review based on incorrect packaging", "Author": "Eric Marnell", "ReviewID": "R2DEKR5VUA7U3U", "Overall": "2.0", "Content": "Bought this as a Christmas present.  Was unpleasantly surprised when setting it up to find out that the only included instructions were written in Spanish.  Usually, the included manual is written in two versions: one in English and the other in a different language.  All you have to do is flip it over and go with the language you want.  Well, in this case, the entire instructions booklet was Spanish only.  It's not that difficult to figure out the basics of setting it up (where to put battery, SD card, etc.) from the pictures, but it's the subtle details of using it that I won't get with the instructions only in Spanish.  Perhaps Panasonic wants me to take up Spanish????  I may write a follow-up based on actual usage, but when the packaging is incorrect from the get go, it kind of leaves a bad taste in your mouth.", "Date": "December 30, 2012"}, {"Title": "wrong color", "Author": "Bernard Riley \"halfpint\"", "ReviewID": "R3T4OAMXNCNWSC", "Overall": "5.0", "Content": "I ordered the red one and you shipped the black one,a bit disappointed,it was a christmas gift so the person cant get what they wanted.", "Date": "December 14, 2012"}, {"Title": "Excelente", "Author": "clio", "ReviewID": "R3AJVGWAAGG0KD", "Overall": "5.0", "Content": "como no estoy en Estados Unidos, aun no he recibido mi paquete en mi pais de origen. Estoy esperando a ver que tal la camara.", "Date": "December 14, 2012"}, {"Title": "good camera", "Author": "jeremy", "ReviewID": "R35WMZ1UN1C0LO", "Overall": "4.0", "Content": "good wide angle camera battery lasts long time. very good camera. german lenzzzz  seven more words required for this review", "Date": "December 3, 2012"}, {"Title": "Like the camera - \"Accessory\" no good", "Author": "A. Lamas", "ReviewID": "R25IDUGHDG42LQ", "Overall": "1.0", "Content": "Really, the camera is fine and I like it well enough.  However, the \"accessory\" which one plugs into the wall to charge the battery, conked out after 5 months.  (3 month old warranty.)  I'm sure there are other fine cameras out there, however, I will not purchase another Panasonic because of this.  P.S.  Keep pressing \"0\" if you call customer service.  You will ultimately get a human being.  You will have to ask them to speak up, but eventually communication will ensue and they will have no idea how much the inconvenience of a broken \"accessory\" costs and will talk very much about the expired warranty.", "Date": "January 23, 2013"}, {"Title": "Only worked for four months", "Author": "Gary Nowlin \"revbgary\"", "ReviewID": "R1OMOQB0SKQEHM", "Overall": "1.0", "Content": "The USB port on the camera broke and now it is a useless piece of junk after only four months.  We bought this camera from As Good As New Electronics from Amazon.  This was a scam.  This was a used camera that broke after only four months.  The price of this camera new was around $130.00 and we paid about $100.00.  This was a used camera, not a refurbished camera.  This piece of junk should not have sold at almost the cost of a new camera.  As Good As New Electronics and Panasonic have been contacted and they refuse to service the camera.  DO NOT BUY.", "Date": "April 30, 2013"}, {"Title": "Audible and videos are off and ruined all my memories", "Author": "CARLA HERNANDEZ", "ReviewID": "R3CRRC0APEYQSF", "Overall": "1.0", "Content": "I think the photos are ok, but not good for videos - you see lips move and seconds later hear the words", "Date": "March 21, 2013"}, {"Title": "its okay", "Author": "Huy Nguyen", "ReviewID": "R39GRPC001LXS9", "Overall": "3.0", "Content": "i think i like the canon n sony better cuz its easier to use.  i hardly use it cuz it takes a lot of time to switch between mode", "Date": "August 21, 2013"}, {"Title": "Inadequate information", "Author": "Marc A. Kaplan", "ReviewID": "R3O1UI4PRGXVZN", "Overall": "2.0", "Content": "I just received delivery of the camera today, and I can't write a full review yet.  I won't even be able to find out if the thing works until I wait 180 minutes for the battery to charge.  What I can do is complain bitterly about yet another technology product that is delivered with only the most basic of instructions in writing.  The actual manual comes on a CD.  To really learn how to use the camera, one must either read the 128 page manual on a computer screen or print it at one's own expense.  Only after doing so, does one learn that one really should have purchased a memory card at the same time and that the camera is just too complicated for a point-and-shoot guy.  Sorry -- this is my first digital camera, and I'm not a mind reader or willing to spend the next week figuring out how it works.  And I find no evidence anywhere that there's a warranty of any kind.  I bought a camera now because I lost my old one that used film (remember film?), I needed something to take pictures on an up-coming vacation, and Consumer Reports check rated it last year.  I am not a happy camper.", "Date": "July 8, 2013"}, {"Title": "Panasonic Lumix DMC FH-8 Digital Damera", "Author": "puzzlefan42", "ReviewID": "R2YTFJMH87JDKM", "Overall": "1.0", "Content": "I received the Panasonic Lumix camera as a Christmas present.  The instruction booklet that came with it was in Spanish on one side and Portugese on the other...nothing in English.  I had to go on the internet and download 125 pages to get the instructions for using the camera. I have had difficulty downloading pictures to my PC and the zoom doesn't take clear pictures.  On the whole, I am very disappointed with the camera.", "Date": "January 17, 2013"}, {"Title": "Trying 5 stars as Amazon is censoring 1", "Author": "Paul Ludlow", "ReviewID": "R26RSHAAGGWPFQ", "Overall": "5.0", "Content": "I have just been e-mailed that the camera part of the order cannot be fulfilled 4 days after placing when when the delivery was 2 days Prime. The email was a 'cancelled, tough luck' email. My daughter is leaving for Florida without a camera, Great service! Please refund my annual Prime subscription in full as you messed up the first order I placed so I have no confidence in ever getting what I ordered in 2 days. No need for Prime as this is my last order. You add insult to injury, I followed one of the links in the email and I can now have it for $30 more!Murari:Hello, I'm Murari from Amazon.I am sorry that you didn't receive the package yet.Case Logic TBC-302 FFP Compact Camera Case (Black)Me:Sorry Murai, not interested in the case, you have cancelled the camera.Murari:I checked your order and see that the order was shipped on February 26 and is out for delivery. Please wait a little longer to receive the package. I can confirm that you will receive the package by the end of March 1.Me:You do not get it do you? I ordered a camera and the order has been wiped by you.Please read my first comments and understand they were not about a case for $6.99. I ordered a camera as well.Murari:I am sorry for the misunderstanding.Since the item is not available, we are unable to ship the item Panasonic Lumix DMC FH-8 16.1 MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom and we have canceled the order. I am really sorry for that.Me:So please refund my Prime subscription as you cannot be trusted to deliver something in 2 days that was accepted as an order 4 days ago. You have spoiled the beginning of a holiday.Murari:Paul, if you prefer, please place the new order for the item Panasonic Lumix DMC FH-8 16.1 MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom for $179.99 and place the order with One Day Delivery, I will waive the shipping charges now. Since the item is sold by the seller, I don't have an option to adjust the price, however, I will personally follow up with this and issue $30 refund once the order is shipped. Is that OK with you?Me:My daughter leaves for Florida in hours, not a day. Can you please refund my Prime subscription. Amazon has let us down.Murari:", "Date": "March 1, 2013"}, {"Title": "Help", "Author": "ELIEZER", "ReviewID": "RNC4YTU3UEC8K", "Overall": "3.0", "Content": "The camera was mailed with a manual in Spanish and Portugese, and I am still trying to get a manual in English.", "Date": "December 25, 2012"}, {"Title": "Needs memory card", "Author": "Allen C Dunstan", "ReviewID": "R1QHQBUPKWE3MQ", "Overall": "3.0", "Content": "Camera is fine, but they don't tell you that the camera can only take about 10 pictures. You have to buy a memory card if you want more pictures. I was very disappointed when on vacation, I could only take about 9 pictures. It was of little use. I have ordered a memory card, but I would have ordered it with the camera had I known.", "Date": "October 2, 2013"}, {"Title": "Never got it and nobody really cares.", "Author": "Ed Hale", "ReviewID": "R9RPKQZD3TDM2", "Overall": "1.0", "Content": "Order never received.  Lasership provided conflicting delivery dates.  Ordered 3 items but received none, and while customer service was polite, it was a bit demeaning.  Was told Amazon only stocked the camera case, not the camera or battery.  Amazon then offered to re-ship the case, but could do nothing about the rest.  Why not just offer a full refund - I had to ask for it.  Used a gift card and was told amount would be credited back, but have not been able to confirm that yet.  Very reluctant to do any more business with Amazon and would immediately cancel any order if Lasership was used.  Currently have $200 in gift cards and am considering re-gifting them, and any others I might receive in the future, but not to a close friend.  Camera was ordered to be used at a special occasion, had to scramble to find a replacement quickly.  Very disappointed.", "Date": "July 3, 2013"}, {"Title": "Not as expected", "Author": "Pat", "ReviewID": "R19Z7UIH8TZ11X", "Overall": "3.0", "Content": "Bought this for my son's wedding, but the camera is not as easy to use as my old one, price is good but the photos did not match my cheaper camera!", "Date": "February 8, 2013"}, {"Title": "fine", "Author": "creekriot", "ReviewID": "R1BNMYN7QW2C7O", "Overall": "3.0", "Content": "We are happy with this purchase, but pretty low quality item.  Ten words are a minimum requirement to submit this form and I have nothing more to say.", "Date": "December 31, 2012"}], "ProductInfo": {"Price": "$149.95", "Features": "Powerful 5x z OIS zoom\n3\" LCD\n720p HD Video", "Name": "Panasonic Lumix DMC FH-8 16.1 MP Digital Camera with 5x Wide Angle Optical Image Stabilized Zoom (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/416f7XXp7zL._SX300_.jpg", "ProductID": "B00728Z8UU"}}