{"Reviews": [{"Title": "Best deal ever!! This is the best birthday present I ever bought myself!", "Author": "J. A. Shelver", "ReviewID": "R12ILRWVSFD3WK", "Overall": "5.0", "Content": "This camera package is well worth the money! The quality of everything is great and the shipping time was less than expected. I am so happy with this purchase! Thank you Cameta Camera!", "Date": "December 13, 2012"}, {"Title": "My first SLR camera! Awesome bunddle to get you started!", "Author": "Melissa Lewis", "ReviewID": "R2K25I7NF1ZVAY", "Overall": "5.0", "Content": "I have always wanted a nice camera and I finally picked this one.  The bundle is great and supplies you with everything you need.  I was surprised at how user friendly the camera was, love the guide mode that teaches you everything.  I love to take picture but have never taken a class.  I read the manual and it all clicked for me.  Not as scary as I thought to own a SLR camera!!", "Date": "May 20, 2013"}, {"Title": "Great Product for a Great Price!", "Author": "PhotoMom", "ReviewID": "R1UGTVF3UBDQDP", "Overall": "5.0", "Content": "I purchased the D3200 camera just so I could take pictures of my family and friends. It is definitely a great buy! For half the price of many other SLR cameras, this Nikon takes great pictures and is so easy to use! The camera itself has a guide menu that teaches you how to change f/stop and take action shots. I love it! The flash was a little \"cheaper\" than what I was hoping but the camera is what I was really paying for. So all in all it is a great buy!", "Date": "July 8, 2013"}, {"Title": "Great camera!", "Author": "Shep", "ReviewID": "R2YTTMHBF1N706", "Overall": "4.0", "Content": "I bought this bundle for my daughter's Sweet 16 present and she loves it! Thanks Amazon for making it easy to get it right!", "Date": "July 4, 2013"}, {"Title": "Camera", "Author": "Kim Anderson", "ReviewID": "R208A7KQYS25DL", "Overall": "5.0", "Content": "I really love my camera! I am hoping to become a lot better at taking pictures and this camera has helped me. Great purchase! Great company to order from!", "Date": "March 4, 2013"}, {"Title": "love it", "Author": "anita", "ReviewID": "R3FBNA20YGFP5V", "Overall": "5.0", "Content": "I love love love love love this camera and everything that came with it. it was an awesome deal for evething that came with it. I priced everything individually and its a deal of the life time. thats for sure.", "Date": "February 1, 2013"}, {"Title": "NIkon D3200", "Author": "Stinkerbell", "ReviewID": "R3TN6VJDUROPUP", "Overall": "5.0", "Content": "As always, I'm tickled with the Nikon D3200 camera.  Still learning all it's bells and whistles!  It feels quite a lot lighter than my D100.  Hopefully weight doesn't reflet quality. Wasn't impressed with the package they put together.  The tripod felt flimsy; the flash is an aftermarket flash...both I resold to individuals.  I have a Slik tripod that I love and intend on buying a TTL flash.  All was delivered as stated and in good condition.  I", "Date": "January 17, 2013"}, {"Title": "Wonderful camera.", "Author": "Adam L. Myatt", "ReviewID": "RQZFV3QKZS2LV", "Overall": "5.0", "Content": "Great starter package. Camera is excellent, lenses are great, Exactly as advertised. Very easy to use and picture quality is fantastic.", "Date": "January 8, 2013"}, {"Title": "Great stuff!!!", "Author": "Sylvain Labelle", "ReviewID": "RJLZDNADYHDV3", "Overall": "5.0", "Content": "Love the camera and the accessories! The only thing I was disappointed in was the tripod cause its kinda flimsy. Other then that, its all good. Delivery was fast and everything was well packed. Great job and definitely would buy from them again. I recommend this to everyone!", "Date": "December 29, 2012"}], "ProductInfo": {"Price": "$699.95", "Features": "KIT INCLUDES 12 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D3200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) + <2> Nikon 55-200mm VR DX AF-S Lens + <3> Transcend 16GB Class10 SD Card +\n<4> Nikon Digital SLR Camera Case + <5> Vivitar 52mm UV Glass Filter + <6> Additional Vivitar 52mm UV Glass Filter +\n<7> ML-L3 Shutter Remote Control + <8> Precision Design DSLR300 Flash + <9> Precision Design 57\" Tripod +\n<10> PD 6pc Complete Cleaning Kit + <11> Transcend SD Memory Card Case + <12> LCD Monitor Screen Protectors", "Name": "Nikon D3200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) + 55-200mm VR Lens + 16GB Card + Flash + Case + Filters + Remote + Tripod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51nwGaNUl8L._SY300_.jpg", "ProductID": "B007X48KL2"}}