{"Reviews": [{"Title": "Improvement over WG-1 GPS", "Author": "Andrew Mcgovern", "ReviewID": "R29850SZ9B71LK", "Overall": "5.0", "Content": "I own one of the earlier Pentax waterproof cameras (Optio W10) and it still works.We decided to upgrade to the WG-2 GPS before our trip to Costa Rica.  Prior to buying ours, my company purchased two of the WG-1 GPS cameras and I was able to use them a couple times in the field.  I found that it took a really long time for the GPS to locate and was a little disappointed.  Once we got the WG-2 GPS I was kind of shocked to see how fast the GPS would locate both in the US and in Costa Rica vs. my experience with the WG-1 GPS.  I did not have a stop watch out but I can't remember waiting more than 15 seconds for the GPS to acquire.We purchased the car charger that came with two extra batteries for around $20.  One day we heavily used the Camera and took six 2 minute long videos and ended up going through two batteries.  We took probably 20 pictures before our trip, over 1200 on our trip, and about 10 short videos.  On our trip we used it snorkeling, ocean fishing, hiking, in the resort pools, zip lines, and whitewater rafting.  Having the GPS for the whitewater rafting was pretty cool, using Picasa it placed all our photos on a Google map with little red location pins.The underwater photos seems significantly better than any we shot with the old W10 but it might have just been clearer water or having more megapixels in this one vs. the 6 mp in the W10.  The WG-2 also has the anti shake so that might have been why the pictures are better as well.We found that the strap for the carabineer liked to slowly loosen I would recommend taking something like a small safety pin and pinning the excess strap to the main strap so it won't slide out.  Ours never slid out but I had to shorten it multiple times on our vacation.One thing I wish they would have designed differently is the metal loop that the camera strap attaches too; it is only wide enough for the strap.  On the W10 I would use one of those yellow boat key floatation devices to keep it from sinking to the bottom.  Those yellow floaties come on a little metal chain, the ones with the balls/links that snap together.  Unfortunately the space for the camera strap is just a little too small for the balls to fit though.  I had to strap it though the carabineer strap and if that would slide out while wet then my camera would be at the bottom and the floatie would have only saved the carabineer strap.  I ended up using a key chain loop to temporarily attach it as a back up when we went whitewater rafting, the rest of the time it was just hooked through the carabineer loop.  I know they make a floatation device for it as part of those bundle kits, out company purchased that and I think the floatation device is too large and cumbersome.  One little yellow boat key floatie keep this camera floating in both fresh and salt water.I found the carabineer very useful on the zip lines and whitewater rafting.  Other people had waterproof camera but had them stored away, they were only able to take them out when there were breaks.  On the zip line I attached it to the harness loops and during the whitewater rafting I hooked it to the life jacket.  I easily took twice as many photos and wasn't holding anyone up waiting for me to put it away.We used our Joby tripod and set up the camera to take a photo every 5 minutes while we were near the beach.  We were there long enough to see high tide and low tide.  When it is in this mode the camera appears to be off and then you will see a quick image for a couple seconds just after it took another photo.  I was cool to see how much the tide changed especially since large rocks appeared at low tide.The Macro mode was cool for taking really close shots of flowers and bugs.Another feature that was new to me from the original W10 camera was they added a nighttime mode that can be used while holding the camera.  The old camera only had night time and the shutter was open for so long that any movement caused really blurry pictures.  It still has this mode but they added one that allows you to hold the camera and still take great images in the evening.I am not sure how helpful this rambling review is, but if you are deciding between the WG-1 GPS and WG-2 GPS I would suggest paying extra for the WG-2 if you want GPS.  If you don't want GPS then save your money and get the WG-1 without GPS.", "Date": "July 3, 2012"}, {"Title": "Love this camera", "Author": "Gerald Jacobs", "ReviewID": "R1ZEU498IYUV6K", "Overall": "5.0", "Content": "Great for backpacking and hiking.  The design is perfect for what i'm using it for.  I'm planning on taking it with me while hiking the AT.  I've bought two more for my two sons who are going with me.", "Date": "February 28, 2013"}, {"Title": "All You need in a camera", "Author": "Dave S.", "ReviewID": "R37NW9YKYWD7RQ", "Overall": "5.0", "Content": "This is one of the best compact digital cameras I have ever owned. It has a ton of features (many I haven't even tried yet).  The WG II is simple to use and takes clean, crisp pictures and video. It will continue to impress me as I use more of the types of photos I take. Great value!", "Date": "October 17, 2012"}, {"Title": "Rugged camera for the outdoors", "Author": "art_ist85", "ReviewID": "RHLYUL60OF0BR", "Overall": "5.0", "Content": "While I haven't tested out all the options available on the camera, and I'm not sure I'll be intentionally testing its shock proof capabilities, but it's definitely a good fit for anyone who goes camping, hunting, or fishing often. Couple of things I noticed on this camera compared to my D80 is that the battery dies pretty fast (with gps enabled) and the images are not as sharp as I would like them to be when viewed on computer screen at 100% zoom.", "Date": "June 7, 2012"}, {"Title": "Love it", "Author": "snazzymullen", "ReviewID": "R2GA1BTLHY079V", "Overall": "5.0", "Content": "Currently in Afghanistan, camera got to me quick and easy, its rugged, waterproof, and shock proof tested them all! take great pictures, the microscope setting, is so awesome for up close images. You can also do a few editing things one the camera too. I totally love it, get one you won't be disappointed!", "Date": "September 26, 2012"}, {"Title": "Simply amazing", "Author": "Koda", "ReviewID": "R1J8IR2VXN04K3", "Overall": "5.0", "Content": "Simply amazing camera. Easy to use. Great pictures. Macro is awesome. Well made, worth the price. Would recommend this camera to a friend.", "Date": "August 27, 2012"}, {"Title": "Great camera!!", "Author": "Orlando Cardenas", "ReviewID": "R1APOQ4MZFY8MY", "Overall": "4.0", "Content": "Main reason I purchased was for microscope mode...White LEDs up front help illuminate target effectively...Have not tried other modes....but basics are good...", "Date": "November 30, 2012"}, {"Title": "Favorite Camera", "Author": "Kurt Westerman", "ReviewID": "R20FIK53ELPAP1", "Overall": "5.0", "Content": "I was looking for a camera to take out kayaking with me on the weekends. This was a perfect choice. I now take it when I go hiking, fishing, kayaking/canoeing, swimming, and traveling. I love how it has a clip so you can clip it to your jeans loop so you can take it everywhere. I love the rugged look and the GPS comes in handy for when I go hiking and discover a Indian camp ground I snap a picture then have the coordinates for my maps. This is my all time favorite camera", "Date": "December 21, 2013"}, {"Title": "A reliable water camera", "Author": "JMZ", "ReviewID": "R39NXOVEAF8YQA", "Overall": "4.0", "Content": "super camera and easy to use and takes good pics. Got the flotation device in case I dropped it in the ocean.", "Date": "November 19, 2013"}, {"Title": "Great Camera", "Author": "Sam Johnson", "ReviewID": "R193OLUQYMFSTQ", "Overall": "5.0", "Content": "A lot of great features, good quality video and pictures (15 MP). I was hoping to be able to buy the WG-3 that had the faster lens but didn't have the time to wait. I had no issues with this lens and camera except trying to see the underwater subject while I was getting a reflection on the view screen while snorkeling. The same was true while trying to line up panoramic shots in strong sunlight. At times there was too much reflection on the flat view screen, something inherent to all view screen cameras.", "Date": "July 17, 2013"}, {"Title": "Still to be tested at 12M under water", "Author": "G. Kwon Hoo \"Gavin KH\"", "ReviewID": "R1EUHZVZ9IBWJR", "Overall": "4.0", "Content": "Brilliant camera.  I love the look and feel.  The interface is not as easy to use as my old camera.  I think that there are just too many options / modes to select making it difficult to scroll through them all when you are in a hurry.  However, there is one feature that is brilliant.  It has a microscope feature which is like a macro on steroids.  Brilliant!!!  Not sure what I will use it for but it is fun to play with.However, the reason it did not get 5 starts is the battery life is poor.  You need to have a few batteries with this camera.24 June 2013 - Camera finally tested under water.  I can confirm that it works all the way to 15 meters.  Between 15 - 20 meters some of the buttons on the face stop working but the shoot button still works.  Then between 20 - 25 meters the shoot button becomes a bit temperamental and all the face buttons stop working...  The perspex screen looks as bent as a banana but after 5 dives below 20m, I can still confirm that everything is working!", "Date": "April 10, 2013"}, {"Title": "Pentax Optio WG-2 GPS Orange Adventure Series 16 MP Waterproof Digital...", "Author": "C. Dow", "ReviewID": "RZROIERBYRZ74", "Overall": "3.0", "Content": "Posnice looking cameratakes nice pic'sCon'sno owners manual included (can down load manual off of Pentax web sight)no len capshort range zoom", "Date": "March 1, 2013"}], "ProductInfo": {"Price": "$299.95", "Features": "Pentax's 13th generation rugged, adventure proof camera with backlit 16MP CMOS sensor for superior quality and high res imaging\nWaterproof to a depth of 40 feet, shock proof to 5 feet, cold proof to 14 degrees F, dustproof\nWide angle internal optical zoom (28-140mm equivalent)\nLarge 3\" LCD w/HVGA resolution\nFull HD 1080p video at 30FPS with high quality h.264 compression", "Name": "Pentax Optio WG-2 GPS Orange Adventure Series 16 MP Waterproof Digital Camera with 5 X Optical Zoom and GPS", "ImgURL": "http://ecx.images-amazon.com/images/I/41zyMa3zVsL._SX300_.jpg", "ProductID": "B0078KP2UI"}}