{"Reviews": [{"Title": "Tiny, rugged, good lookin' & takes great pictures!", "Author": "P. K. Frary \"Gochugogi\"", "ReviewID": "R3Q6N2I7BM40A4", "Overall": "5.0", "Content": "The GX1 is tiny. Not skinny jean pocket wee but, with 14mm F2.5 pancake mounted, it easily slides in a coat pocket or purse. It's at its best with small lenses but handles telezooms if you support the lens barrel. The metal body shell (magnesium?) feels solid. A contoured and rubberized grip makes holding secure, but wish it had room for two more fingers. The textured matte black finish is impeccable. The design is not vintage inspired like a Pen, but is more modern and reminiscent of Contax. I was pleased to see \"Made in Japan\" on the bottom.CONTROLS: The GX1 is packed with advanced features but DSLR users should find controls intuitive. Major functions (ISO, WB, AF, etc.) have a dedicated button or dial and are labeled. Point 'n shoot converts will need to study the manual, but can start straightaway in auto mode. The buttons are small but I adjusted quickly. The single input dial/wheel, albeit tiny, falls naturally under the thumb. It's stiff and not likely to suffer inadvertent turning. The mode dial is knurled metal with firm click stops. There's a sturdy on-off flip lever on the top deck.If you're used to a tabbed interface with options visible on a single screen, e.g., like Canon, these menus will feel disorganized. There is rough subject organization via 5 icons, but requires scrolling through as many as seven screens of illogically grouped options. Fortunately, after set up, most people will rarely visit the menus as important features have physical controls.DISPLAY: The LCD is okay but falls short compared to current technology: resolution, refresh rate and brightness are lower than the LCDs on my E-P3, 7D and 5D MKII. The OLED of the E-P3 whips it silly. The slow refresh rate is bothersome: pans are smeared and jerky in low light. In fairness, nobody buys this camera for sports but a faster refresh rate would be welcome for panning rug rats 'n house critters.You have a choice of touchscreen or buttons/dial for most features. Touchscreen implementation is clumsy compared to an iPhone or Olympus E-P3. I prefer buttons and dials so I can operate by feel, so no biggie. If your first camera was an iPhone, the responsive touchscreen of a recent Olympus M4/3 model will suit you better. Finally, the LCD can't be turned off for time-lapse photography or use with optical viewfinders. You must buy the DMW-LVF2 to gain a LCD off switch.VIEWFINDER: The GX1 lacks a viewfinder but I purchased the optional Panasonic DMW-LVF2 External Live View Finder at Amazon for $160. It's pricey but you get a tilting EVF with LCD graphics. Using the DMW-LVF2 is the only way to shoot with the main LCD off. No eye-detect but is has a toggle button to deactivate the LCD. Viewfinders are essential for shooting in bright sunlight, for stealth in dark venues and the 90 degree tilt makes ground level shooting a snap. It also allows steadying the camera against the face, resulting in sharper images.SHOOTING: This is my point 'n shoot so portability--coat pocket & messenger bag--is paramount. I mounted a Panasonic 14mm f/2.5 pancake lens and never took it off. This combo works great: AF is fast and surefooted, even in dim light, and the package is so petite I barely notice it has a lens.Exposures were accurate most of the time but dim scenes tend to be overexposed, but it is easy to dial down night scenes with exposure compensation.Images are sharp and richly nuanced when viewed on my 27\" Cinema Display. I shoot RAW and \"develop\" in Apple Aperture. Image quality trails my 7D but is nipping at its coattails. The GX1 bests my E-P3 with 23% more resolution but noise levels are similar up to ISO 3200. I wouldn't hesitate using ISO 800 and ISO 1600 is surprising clean if you don't underexpose and apply noise reduction for skies and shadows. The GX1 yields 3 more stops of high ISO, extending to 12800, but beyond ISO 1600 is too noisy save for \"emergencies.\"Battery performance is weak and trails far behind my E-P3, 5D MK II and 7D, so carry a spare for a day of heavy shooting. Two hundred pics and your'e done. Using the DMW-LVF2, instead of the main LCD, doesn't save much battery power.FLASH: I mainly shoot with natural light and use the popup for fill-in flash. Slow sync mode does an impressive job of blending flash and background light for a natural look. Unlike my other cameras, I rarely need to use flash exposure compensation. However, flash compensation was the only feature lacking obvious controls and I had to look it up in the manual: press a function button and turn the input dial.TRIPOD MOUNT: The tripod socket is centered under the lens but most quick release plates block the battery door. A small Arca plate with offset screw should clear the door. The Kirk PZ-130 fits fine and has an anti-twist lip. If you're hardcore, slap on a Really Right Stuff BGX1 Arca L-plate. Besides ease of tripod use, the L-plate makes makes it easier to hang on to this camera (more grip area).MIA: Lumix cameras--save for the GX7--lack in-body stabilization. Instead, stabilization is built into lenses. Well, some lenses: Lumix prime lenses lack stabilization but zooms have it. Panasonic should put stabilization into all their lenses, including primes, or add it to the body. I knew the GX1 lacked in-body stabilization and I bought it anyway. So I use a table top tripod or brace against walls and fences in dim light.LAST BLURB: Despite some grumbling, I really like this camera. The positives of confident AF, near-DSLR image quality, stylish design, excellent fit and finish, petite size and useful features out weigh nitpicks. If this camera cost $600 I'd subtract a star or two for the zits. But for the closeout price of $225, this is a wonderful little camera.", "Date": "July 17, 2013"}, {"Title": "Fantastic camera", "Author": "M. Gold", "ReviewID": "R1F7SWZLOG3TMK", "Overall": "4.0", "Content": "upgraded to this from a GF1 and well worth it.  The GF1 was my first manual camera and I've been learning photography little by little.  This camera takes excellent, crisp photos (shoot in RAW and develop in lightroom) and higher ISO is much better than GF1 though I liked the way the GF1 felt a little better.  I use this mostly with the 12-35 lens and it's a lot of fun.  My only two complaints are the loud shutter sound (hard to take candid shots of my family) and the low light capabilities compared to other m4/3 cameras.  But for the price, you can't go wrong.  Also search for this camera by other vendors on Amazon.  They have much more and more extensive reviews.", "Date": "March 15, 2013"}, {"Title": "gf1 to gx1 : what a update !", "Author": "LENOIR", "ReviewID": "R201CGO3JP7VMV", "Overall": "5.0", "Content": "I bought this unit to replace the GF1 was already great ... and the GX1 is even better! It is very fast, high ISO are clean and the touch screen is really good.", "Date": "March 19, 2013"}, {"Title": "Extraordinary value at current prices (<$250)", "Author": "Bron \"Bron\"", "ReviewID": "R35TQPY4TGGM20", "Overall": "5.0", "Content": "I picked up a body for less than $200 and they're selling here routinely now for less than $250.  At these prices, this is a superb value in a vary capable, small, solid camera.  Especially if you already have the lenses you want on hand as many will (if not, prices are pretty good on some of those, currently, as well).  I have the Panny 14-45mm f/3.5-5.6 (Panasonic Lumix G Vario 14-45mm f/3.5-5.6 ASPH/MEGA O.I.S. Micro Four Thirds Lens OIS on mine currently.The GX1 has very clean images and great Full HD MP4 video and offers AVCHD format as well if you prefer.  MP4 is much easier to work with, so I use that usually.  Might prefer AVCHD for certain things (e.g. making Blu-ray or DVD's).  The style and handling are good.  Lots of nice features.  Great quality build. 16 mp, raw, full manual, many customization options, plenty of controls, nice display, touch screen, though I don't use it much (so far, anyway), flash, hot shoe, stereo microphones, and so on.  And it looks nice.  A bit retro.This is a fine camera at a very good price and well worth considering if you are looking for another body or a good first camera with DSLR quality output.", "Date": "July 3, 2013"}, {"Title": "Finally... A real successor to the GF1", "Author": "Travis Hatcher", "ReviewID": "R2ZZJ4HKXVC5QN", "Overall": "5.0", "Content": "I really wanted the GF1 when it came out being tired of lugging around my DSLR.  Many years later I was disappointed that there had not been a real replacement for the camera, but behold the GX1!  This camera does almost everything I would ask of a DSLR in a smaller package.  If you are someone who loves the feel of a rangefinder and needs the control of a DSLR this is the digital baby of the two. Highly recommended Leica quality for a fraction of the price.", "Date": "May 17, 2013"}, {"Title": "Great upgrade from GF1!", "Author": "Yamabiko", "ReviewID": "R3RTONTWTV48LQ", "Overall": "5.0", "Content": "I love this little camera. It has so many refinements. I got the external viewfinder, now about the Leica lens…", "Date": "April 29, 2013"}, {"Title": "The camera was a winner to begin with, but now at these low, low prices....it's a steal!", "Author": "Bernd W. Herrmann \"Restore the Republic!\"", "ReviewID": "R2IDEFUYOTC8EF", "Overall": "5.0", "Content": "I originally had the Panasonic GF-1 (a wonderful camera), but this GX1 ups the ante by a wide margin - specifically in the megapixel count (16 over 12) and far superior high ISO (read \"clean\") capabilities.  The camera is a delight to use and I love this camera so much, that I purchased a second one (again, at these low give-a-way prices currently going on, it's a crime not to get one).  I keep the Panny 14-140 zoom on one of the bodies and the Panny 14-45 on the other.Yes, I'm very happy with this model - get them while you still can.-", "Date": "April 12, 2013"}, {"Title": "High end camera great price", "Author": "Harvey Morgan", "ReviewID": "R23SDIHJCAQJEX", "Overall": "5.0", "Content": "High end Panasonic camera  Love this body also own a g3 much lighter but gx1 feels much better in the hands.", "Date": "March 15, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "3-inch LCD display\n16MP DSLR-Like Image Quality, Features, and Lens Options\nBuilt-in Flash, Hotshoe, and Traditional Mode Dial\nLumix LightSpeed Focusing and PinPoint Focusing Control\nFull HD Vide1080/60i - AVCHD/MP8", "Name": "Panasonic Lumix DMC-GX1 16 MP Micro 4/3 Compact System Camera with 3-Inch LCD Touch Screen Body Only (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31OPR9krvnL._SY300_.jpg", "ProductID": "B007EUO2F8"}}