{"Reviews": [{"Title": "Save your money.", "Author": "Leo S.", "ReviewID": "R51Y8B1LJMU9R", "Overall": "2.0", "Content": "The filters and memory stick were fine, and the bag is usable, however the rest was pretty much junk. The other included lens were a joke as was the tripod. Save your money and buy the camera, which is wonderful, and get your filters elsewhere if you need them. After extensive use of this camera, I haven't found the filters particularly necessary. Definitely buy the camera though.", "Date": "March 8, 2013"}, {"Title": "GOOD BUY FOR SOMEONE WANTING TO TAKE LOTS PIC,S", "Author": "JIM", "ReviewID": "R2IE7F0LG2TWYK", "Overall": "5.0", "Content": "SAME AS BATTERIES AND CHARGER WORK GREAT AND TKES GOOD PHOTOS.  A GREAT KIT FOR THE NEW PERSON TKING PIC,S.JIM TULAROSA, NM", "Date": "August 2, 2013"}, {"Title": "Great camera for me", "Author": "Lee", "ReviewID": "R1QP28TFYD5B82", "Overall": "5.0", "Content": "The camera is nice , I feel fancy twisting the zoom. Down side is the lack of me being able to take quick unexspected snap shoots . Quality  is awesome for me. Bundle pack is rather cheap and hte camera bag barely holds the camera let alone all the stuff you see in the photo", "Date": "May 17, 2013"}, {"Title": "Great Product", "Author": "Adrienne Carey Frie", "ReviewID": "R22AA5RH6XCKCN", "Overall": "5.0", "Content": "Everything was as exactly as described online and came at an unbeatable price. It even shipped quickly. Very highly recommend.", "Date": "February 27, 2013"}, {"Title": "Not what it seems!!!", "Author": "fox4kids", "ReviewID": "R1JTO2KKETMBOU", "Overall": "1.0", "Content": "The camera came with 2 additional lenses that cannot be used with the camera. It also was to come with a full size tripod but it did not come with one. Good camera though.", "Date": "February 3, 2013"}, {"Title": "Muy buen producto", "Author": "Diego Morocho Araujo", "ReviewID": "R1YFTQFI9SIU1Y", "Overall": "5.0", "Content": "Realicé la compra y superó totalmente mis expectativas, estoy muy contento y satisfecho con la camara y todos sus accesorios.", "Date": "January 25, 2013"}, {"Title": "Bad Bargain", "Author": "oldskipro", "ReviewID": "RWTUKXH5B2M67", "Overall": "1.0", "Content": "This package contains two lenses that CANNOT be used with this camera. The Finepix HS 30 EXR is a FIXED lens camera and cannot accept any other lenses than  the one attached to the camera. This is not a \"saver\" as advertised", "Date": "December 1, 2012"}, {"Title": "Great camera, but just another point and shoot.", "Author": "compughter", "ReviewID": "R1XCQOF806G7L1", "Overall": "5.0", "Content": "This is a great  little camera. I say great because that's what it is. You can get the same quality from a smaller camera. I bought it thinking that bigger is better. In my opinion the smaller Fuji is just as good.", "Date": "September 30, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007OWOKQW"}}