{"Reviews": [{"Title": "Disappointed, but should have known better", "Author": "jcooper5150", "ReviewID": "R170AGSOFSY58L", "Overall": "2.0", "Content": "I bought this mainly for the price, I was planning a dive trip to Cozumel and wanted a camera that I could take pictures with. When I first opened the package and handled the camera I knew that the quality was very low, it felt like something you would win out of a vending machine. Regardless, I thought I would give it a try and maybe be surprised, nope. 60ft down and the camera froze and stopped working, so of course I have no photos of my recent dive trip, next time I will know better and spend a little more. You get what you pay for, lesson learned.", "Date": "June 25, 2012"}, {"Title": "Did not work", "Author": "K Word \"K Word\"", "ReviewID": "R3UTQIVR3U7E99", "Overall": "1.0", "Content": "Bought it for a cruise on which we had scuba and snorkling tours but it would not turn on, went got new batteries checked SD card nothing worked and had to buy a camera on the boat so we could take pictures. Very disappointed.", "Date": "December 9, 2012"}, {"Title": "Waterproof Video Camera", "Author": "dspsurr", "ReviewID": "R1XQ28S83DV55G", "Overall": "4.0", "Content": "Wanted this camera for my daughter so she can take pictures outside when it is raining.  She loves the rain and wanted to be able to take pictures of the rain.  She is 6 years old and she has no problem working this camera.  She LOVES it!", "Date": "January 17, 2014"}, {"Title": "Small and compact good for snorkeling in warm areas or on the spot rain events.", "Author": "peter savage", "ReviewID": "R33KWOH7OCGJP8", "Overall": "5.0", "Content": "The camera is small even with it's 16mb internal memory you can add a 16GB micro card to it,  so you can fill it a lot, without  making a stop for downloading.  But don't use heavy 6mm dive gloves(cold water).  Because the buttons are to small.  You might have to use rubberized gardening gloves instead or bare hands to control camera functions.", "Date": "August 15, 2013"}, {"Title": "Hard to use.", "Author": "cschemen", "ReviewID": "RM9V3CKSJQPSA", "Overall": "1.0", "Content": "Very disappointed in the item. Buttons hard to push. Awkward to use. Bought for a 9 year old, but she could not push the buttons. Very happy with the seller. Prompt shipping. Packing was superb. Item arrived quickly. No problems with the return. Please do not hold this against the seller. Seller was awesome. Item left a lot to be desired.", "Date": "January 28, 2013"}, {"Title": "Ok camera for scuba diving", "Author": "Matt H.", "ReviewID": "R1IHQU7O677W1A", "Overall": "4.0", "Content": "This camera is great for scuba, snorkeling, swimming, or outdoor activities where a waterproof camera may be needed. An underwater digital camera at this price is unheard of so I was happy to buy it and try it out. It takes great above water pictures and has several different settings. Underwater quality leaves a little to be desired though. It blurs pictures if you move very much so it's kind of hard to get a sharp picture due to currents and breathing. The buttons are kinda hard to press but are large so you can press them even with gloves. Great for a beginners or knock around camera that you won't cry about if you lose or break.", "Date": "January 25, 2013"}, {"Title": "Great Underwater Digital Camera", "Author": "Mazie Smith", "ReviewID": "R2X7CHCM71LP0F", "Overall": "5.0", "Content": "My husband and I used this camera every day of our 2 week honeymoon stay in St. John USVI. This is a great inexpensive camera to take with you snorkeling! The camera never leaked and we ended up with over 200 great pictures from our snorkeling adventures. Over half of the pictures we took turned out great just make sure to hold the camera as still as possible when taking a picture! We only used the video camera once to film a sea turtle swimming in the water. The video turned out surprisingly good! Make sure to bring extra batteries for your trip!!! Great product for the price!", "Date": "December 26, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Lightweight waterproof digital camera for use while snorkeling, swimming, kayaking, and more\n3-megapixel sensor with up to a 5-megapixel resolution through internal hardware interpolation\nCaptures videos up to VGA resolution (640 x 480) at 20 frames per second\nWaterproof to 100 feet (30 meters); 16 MB internal memory; expansion via microSD cards up to 2 GB\nPowered by 2 AAA batteries; includes hand strap", "Name": "Intova Waterproof Video Camera with Flash - 100 Feet / 30 Meters", "ImgURL": "http://ecx.images-amazon.com/images/I/51cC4Bs9cIL._SY300_.jpg", "ProductID": "B007HOPBPQ"}}