{"Reviews": [{"Title": "This is an excellent all around 3D camera!", "Author": "roaeja \"Hey you!\"", "ReviewID": "R1W13RGRKN4R9Y", "Overall": "5.0", "Content": "This is a very good camera at a very good price.  Sears want almosta thousand for it!  The 3D pictures on a 3D tv is outstanding.  But,be aware that everything is in Japanese, all the literature andon board camera instructions.  It's really rather simple, with iconpointing the way.  They include a disc, but with nothing on it.It's totally blank.  Just take 3D shot or movies and plug the SDcard into a slot on your tv, if you have an SD >USB adapter.  Minecame up with no problem.  The pictures are never out of focus andreally outstanding.", "Date": "March 24, 2013"}, {"Title": "Great if you know how to use it!", "Author": "Neil H Nathanson", "ReviewID": "RRW5VCGD38K5D", "Overall": "5.0", "Content": "The close distance of the lenses is a benefit if you know what to do with it, but can be considered a weakness if you don't. This camera let's you shoot closer to your subject than the Fuji W3. Having both is a best case scenario.", "Date": "September 18, 2013"}, {"Title": "Lumix 3D1", "Author": "Ingo G.", "ReviewID": "R3JXMFM2V3FXQQ", "Overall": "5.0", "Content": "A fantastic camera for 2D and 3D Images. I recommend it to all lovers of photography. The Japanese version is easy to use.", "Date": "July 28, 2013"}, {"Title": "A great little camera", "Author": "Malcolm McCormick", "ReviewID": "R106O35MTMMIV9", "Overall": "5.0", "Content": "Ideal for close up stereo photography and great value for money. The menus in Japanese are no problem because there's an English manual available.", "Date": "July 14, 2013"}, {"Title": "Nice for the price", "Author": "Daniel Powell", "ReviewID": "R21UE6EN3RHRWP", "Overall": "4.0", "Content": "Overall, this is a very nice camera.  Although it is Japanese only, it is fairly easy to follow if you have the online English manual available.  A lot of the icons are familiar and straight forward.  Some features, such as text annotation are not usable unless you are fluent in Japanese, but all the important ones are available and not too hard to use.  I orginally used red/cyan glasses and the free StereoPhotoMaker application to view my photos.  Acceptable, but not ideal.  I've since purchased a Viewsonic 3D monitor.  The pictures and movies are fantastic.  Love the effect.  The 2D images are also very nice with great color, just what you'd expect from a camera in the Lumix line.  Overall, very happy.  It would be nice if Panasonic would make the English firmware available for update...if that's possible. It would make it alot more usable. No one at Panasonic seems to be motivated though.  The PHOTOfunStudio application supplied with the camera is also Japanese only, but the english version can be purchased from Panasonic Global.  Unfortunately, the 3D images are only shown in 2D.", "Date": "July 15, 2013"}, {"Title": "Nice Camera", "Author": "Sasan", "ReviewID": "R36QGAVJ7TJNK0", "Overall": "4.0", "Content": "The only problem is that the menu is in Japanese but I try my best to learn by try and error. It would be nice if I could change the firmware to english.", "Date": "April 21, 2013"}, {"Title": "good camera. a bit japanies there but most of it in ENGlish. easy to use", "Author": "SHARON_SD", "ReviewID": "R3P4K7O6NQYL8Q", "Overall": "4.0", "Content": "do what is says. good thing. cheap cam, doing the job. i cant see a reason to pay more for another one", "Date": "November 17, 2013"}, {"Title": "Panasonic 3D1 - Great Little 3D Camera", "Author": "Mr. R. S. Moxom", "ReviewID": "R3I2P5MBSSWUH2", "Overall": "5.0", "Content": "This is a great little 3D Camera for photographing close subjects such as people.The Japanese Language Menus were not a problem for 3D photography as important settings use symbolsHighly recommended at the sell out price of the Japanese Language versionsPanasonic digital cameras Lumix 3D shooting black DMC-3D1-K", "Date": "May 29, 2013"}, {"Title": "Best pocket size 3-D camera for the Japan price but the JVC Everio Gs-td1 is the best!", "Author": "James P. Ltaestro \"Pat Maestro\"", "ReviewID": "R1PPGWOJ0ABGNJ", "Overall": "5.0", "Content": "This is a great pocket size 3-D camera and the price is about $180.00 brand new from Japan.Menu is not available in English.This Panasonic model is listed in two different locations on Amazon and that's where I have a more in depth review but don't bother buying this camera because the JVC Everio Gs-td1 is the best.If you want the best overall 3-D camcorder/camera you can buy it now brand new from Japan on ebay in the $500.00 price range and the menu has the option of English.What a deal!Please see my review on the JVC Everio Gs-td1.", "Date": "December 15, 2013"}, {"Title": "good for close-up 3D", "Author": "William Moll", "ReviewID": "R1ALJP4895I0SP", "Overall": "4.0", "Content": "With an interocular of about 30 mm, the camera is good for 3D photos of objects in the 3-12 foot range, such as in a room.  It isn't appropriate for landscapes.  It gets a 4 star since it is basically only point-and-shoot in 3D mode and this particular camera is the japanese language version (these two offset each other a bit, since there isn't a lot to read about in 3D mode).", "Date": "August 14, 2013"}, {"Title": "Panasonic, REALLY?  Poor 3D quality!", "Author": "B. Brent", "ReviewID": "RXT4VH4CZALZA", "Overall": "2.0", "Content": "As a photographer/videographer for many years, I can easily see the quality difference between this camera and Fujifilm's W3 3D camera.  I've owned the W3 3D camera for over three years, but recently I must have either mishandled it, maybe a slight drop to the floor or a bump.  The right lens is out of sync and cannot be fixed w/o a costly (more $ than a new one) repair.  So, even though others here have given the Panny 3D camera mixed reviews, I took a chance.  Wow, I cannot believe the reviewers here giving this camera five stars.  The Panny's resolution is not as good as the Fujifilm's camera, in 3D mode.  I'll give the Panny 4 for 2D resolution. The interocular (distance between the two lens') distance on the Panny is just plain pathetic, whereas the Fujifilm's is perfect, just like our eyes.  Ghosting in the Panny is quite visible, whereas Fujifilm does not produce ghosting.  As far as a closeup with the Fujifilm's 3D effect, yes, it may be too close and hurt the eyes, BUT, you can close-up the distance with FREE SOFTWAREDo an Internet search, type in this exactly (without quotes) \"StereoPhoto Maker Ver4.52\"  No installation needed, it's just an executable (.exe) file.The above free software is very versatile, with distance adjustments, color correction, saving to different formats and creating stereo/3D images from non-3D images.I've returned the Panny and ordered another Fujifilm W3 camera.  But, this time, with Square Trade's insurance.  A great deal!", "Date": "February 3, 2014"}, {"Title": "Buy the Fuji 3D W3 instead!", "Author": "Joseph B. Mayshark \"sheep107\"", "ReviewID": "R2JRVLIQCWL354", "Overall": "2.0", "Content": "As just a camera, this can't compare favorably in any way with most hundred-dollar point and shoots.  It's okay, but just barely.  But as a 3D camera it has two serious shortcomings: 1.Whereas when in 2D mode it's a reasonably adjustable camera: it has various modes, and manual overrides, which allow a reasonable amount of control. But when in 3D mode, it becomes a totally auto camera with no manual adjustments possible. 2. Much more significant: the lenses are only one and a quarter inches apart.  Average adult human eyes are two and a half inches apart, which is where stereo cameras have traditionally placed the lenses. The result of this in the pictures taken by this camera is Stereo Lite: the 3D effect is very diminished.  It's hard to imagine why anyone would make a 3D camera with the lenses so close together.  Get the Fuji 3D W3 - it has some shortcomings too, but it's MUCH better than this Panasonic, and is also currently being remaindered at very low prices - Amazon has it for under $190, and Newegg is (at this moment anyway) selling refurbished ones for $125. (I wouldn't be concerned about buying a refurbished one from Newegg - I bought a refurbished PC from them a year ago and it's been fine.)", "Date": "November 10, 2013"}, {"Title": "Good 3D-camera for short to medium distance", "Author": "Georg Klein", "ReviewID": "RHS90OQ7KQYGI", "Overall": "4.0", "Content": "It is no use to write a long review, as the camera is not produced any more. The japanese version is usable for other languages, as most functions are indicated by icons.The base of the lenses is 30mms,that means it is good for photos in the range from 80 cms on. Everything that is more than 5m away looks flat. If you don't have distant background: very good 3D in the range 40 - 80 cms. Alas no 3D display and no manual setup for 3D. But still a high value for the actually low price!", "Date": "July 1, 2013"}, {"Title": "Great Camera / Video", "Author": "E.Israel", "ReviewID": "R328HSQDLGWS3A", "Overall": "4.0", "Content": "One thing there is no possibility to zoom in or out while takenig a video to bad..........hopfully the next generation.", "Date": "May 30, 2014"}, {"Title": "3D photos", "Author": "Harri Hietala", "ReviewID": "R2TJ742TNB0YY1", "Overall": "4.0", "Content": "This is very good camera. You can take 2D or 3D photos, and videos as well. My specimen has only japanesemenus ( I do not understand japan language), but I find the camera still easy to use. The stereo images are easyto handle using free software available from internet.", "Date": "March 1, 2014"}, {"Title": "Great", "Author": "Big Guy", "ReviewID": "R3HXC31ZRIIW1", "Overall": "5.0", "Content": "Good medium range 3d camera. Extremely sharp optics. Nice size, tons of settings. Small compact pocketable camera. Good high def movies and 2d results.", "Date": "February 15, 2014"}, {"Title": "Japanese Speaking Camera", "Author": "Dominique Gerbaud", "ReviewID": "R1LKDSD6L2ZE67", "Overall": "3.0", "Content": "Most probably a very excellent camera (I already own and use an old Lumix compact camera, nearly perfect).But … even though I bought it from an american company, Amazon.com, it was not customized for the american market; I mean the user's manual (which was english and Pdf) speaks about the language set icon, which would allow the choice of the language on the camera display, but as the camera is meant for the japanese market, the display is japanese, and I was unable to find the language set icon.So … I sent it back and got my money back very fast.", "Date": "February 10, 2014"}, {"Title": "Great 3D video", "Author": "Kai Kvade", "ReviewID": "R4Q4C161N7OJW", "Overall": "5.0", "Content": "Just tested it, and video and pictures are very good for the price paied! Hard to find similar products in european market.", "Date": "January 27, 2014"}, {"Title": "Crisp and well balanced photos - but get the UK online manual in English.", "Author": "Amazon Customer \"Likes electronics.\"", "ReviewID": "R3S57MAELN294K", "Overall": "4.0", "Content": "Excellent photos and intuitive to use.  Sparkling on the Panasonic 3D TV... even the TV remote runs it.  Only downside: no English instructions.  But look around for UK instructions... they are very similar.", "Date": "December 2, 2013"}, {"Title": "Very good", "Author": "Manuel", "ReviewID": "R2R9KUCPIJ8YYV", "Overall": "5.0", "Content": "Camera is easy to use even though is in Japanese. IT makes excellent pictures.I experience problems with PC software in Japanese but for time beeing I transfer pictures with sdhc card.", "Date": "September 18, 2013"}, {"Title": "Great little 3D camera!", "Author": "The Martian", "ReviewID": "R276GWHBO45L7H", "Overall": "5.0", "Content": "I am so happy I bought this 3D camera, especially since the price has dropped drastically since it first came out.  Even though the text is in Japanese, icons make it fairly easy to figure out.  Photo and video quality are excellent for a point-and-shoot...no, it's not a DSLR.  Bear in mind it's best for closer shots because of the 30mm lens separation, but that is perfect for video display on a large-screen 3D TV.  Some advantages over the Fujifilm W3, it's smaller, has more natural-looking close-ups of people, vastly superior video quality, and some neat 2D features, as well.  I say, get one while you can!", "Date": "August 20, 2013"}, {"Title": "Lumix 3D Camera", "Author": "Robert brandsen", "ReviewID": "R1ZMX2YLSKQUFS", "Overall": "5.0", "Content": "The communication, transaction and delivery via Amazon went flawless. The camera is fantastic and reachesbeyond my expectations. Filming in 3D and viewing it back on a 3D screen is fantastic. I had the Fujifilm 3D W3 but this camera has a much better performance in speed, colour and 3D filming.However, Panasonic, gets negative points as far as I am concerned, for this Japanese company does not even bother to answer my questions per mail. So the Camera is super, the aftersales of Panasonic Japan far from customer friendly.Robert Nieuw Vennep Holland", "Date": "September 18, 2013"}, {"Title": "Using NSTC model in PAL region (Malaysia Sarawak)", "Author": "Joyce of Sibu", "ReviewID": "R3DMU1TKJU89M6", "Overall": "3.0", "Content": "I give it 3 stars because it does not have 1/50 manual override. Need to wait some time for it to adjust auto shutter from 1/60 to 1/50, to be usable in Malaysia's 50Hz lighting.By default, it will flicker in 50Hz lighting,This 3D1 responses slower than others model to adjust the default auto shutter from 1/60 to 1/50.It should update firmware to have 1/50 manual override.These Cameras adjusts themselves to suit 50Hz lighting fast:Kodak ZE1 (Lighting fast to detect 50Hz lighting), (auto shutter, no manual setting)These camera perform magic 1/60 shutter in 50Hz lighting, flicker-removal.Panasonic V700, V720 even usable in 60p 1/60 shutter. (manual adjust)These NTSC models has manual setting 1/50, 1/100 shutter setting to perform well in 50Hz lighting under 30pGF3_ _ _For tis Panasonic 3D1,Pic Quality = 4 star.3D Video Quality = * * * * * (5 star)Convergence point adjust = * * *  (3 star in photo, 5 star in video mode, because has +2 to -2 convergence point adjust)NTSC in 50Hz lighting  = * * (Sturborn in detecting 1/50 lighting, head ache to get it tuned to 1/50 auto)Price = * * * * * (Great product below $200 / MYR 600)Can't find this 3D1 camera in any outlets in Sarawak, they only sell non-3D compacts, and sometime lelong them.", "Date": "August 20, 2013"}, {"Title": "Picture quality does not meet my expectation.", "Author": "wing wong", "ReviewID": "R2QCTZY7EA8XKS", "Overall": "3.0", "Content": "The picture quality is not what I expected.If I go to view at  4x, the detail picture quality is not good.I hope Panasonic can improve it in future", "Date": "December 27, 2013"}, {"Title": "Excellent product. I hope to find this one in English.", "Author": "Ignacio", "ReviewID": "R29IRX1I720066", "Overall": "3.0", "Content": "I looked up for an english version all around the web....but I ended up buying the Japanese-only version (no english menus) Is an excellent pocket camera for 2D and 3D pictures.", "Date": "October 17, 2013"}, {"Title": "Knowing Japanese Helps", "Author": "Dan Strombom", "ReviewID": "R24FM3KTIXYHNX", "Overall": "3.0", "Content": "The camera's instructions - the manual and camera's digital navigators and menus are in Japanese.  I had to go to a Panasonic site to download instructions in English. Until I become familiar with the camera, it is frustrating to work with.", "Date": "October 10, 2013"}], "ProductInfo": {"Price": "$267.00", "Features": "Maker part number  :   DMC-3D1-K\nweight : about 193g\nEffective pixels:   12,100,000 pixels", "Name": "Panasonic digital cameras Lumix 3D shooting black DMC-3D1-K", "ImgURL": "http://ecx.images-amazon.com/images/I/41Atan%2B7A%2BL._SX300_.jpg", "ProductID": "B0073N2CTO"}}