{"Reviews": [{"Title": "Some goods and Bads", "Author": "Jessy", "ReviewID": "R1UWF60TDZ62EK", "Overall": "3.0", "Content": "Overall build quality is nice. It is sturdy and lightweight. Has lots of holes to attach accessories to it.Follow focus is smooth and good.It is a good buy considering the price you pay for it.I bought this unit for my 5D.Cons :Wish it had camera quick plate. It only had screw on bottom and you need screwdriver to access the screw through the rod supports.If you thinking of attaching your own quick change plate, it will not have enough space on top and you will have to take off the top part off.Rod support tightening screws are kindaa hard to tighten but not a dealbreaker.Included follow focus lens gear ring is flimsy, made of rubber. You can buy your own plastic made rings.Wish the size would have been little bigger as it gets hard to get to camera buttons.", "Date": "March 15, 2012"}, {"Title": "DSLR Video Cage Rock Solid", "Author": "Snowman", "ReviewID": "R1KUBSA0UIRTHP", "Overall": "4.0", "Content": "This DSLR cage with follow focus was a great buy.  I would recommend this to any new DSLR videographer.  It has plenty of holes for mounting accessories and the articulating arm was a bonus and works flawlessly. The only thing I had an issue with is that I would like to use my battery grip with my canon 7d.  The cage is made to be able to replace the battery and change the CF card but having the extra battery in the grip would be helpful as well as being able to load and unload the batteries from the back instead of underneath.", "Date": "August 12, 2012"}, {"Title": "DSLR Cage", "Author": "John Lamar", "ReviewID": "R20PDR5CZESLFS", "Overall": "2.0", "Content": "I think this my fault and I didn't read the small print. I have a T2i and this kind of cage isn't  made for T2i's.leaving me stuck with it. I'm going to try to sell it on ebay or amazon.", "Date": "December 15, 2012"}], "ProductInfo": {"Price": "$399.99", "Features": "Accommodate all sizes DSLR Camera with 1/4\" thread\nAluminum plates to cover top, bottom, left, and right\ndurable, and hand held convenient design for your Camera\nHeavy Duty all aluminum/metal construction\nSize: 7 3/4\" x 5 1/2\" x 2 1/2\" Brand New", "Name": "ePhoto DIGITAL DSLR Video Camera Cage Bracket Stabilizer Bundle, Follow Focus, Friction Arm CAGEFOCUS", "ImgURL": "http://ecx.images-amazon.com/images/I/41nlYvFKh1L._SY300_.jpg", "ProductID": "B007503WE4"}}