{"Reviews": [{"Title": "Nice camera for the money", "Author": "P. Elosser", "ReviewID": "R343JTF2WN6Q66", "Overall": "5.0", "Content": "This is my fourth or fifth Canon digital P&S;, over the years I've worn all the others out. This one has lived up to my expectations of Canon quality. All the controls do take a bit of experimentation to figure out, but you can leave it on AUTO and let the camera do all the work. The only disadvantage for me, there is no manual control of shutter speed and F-stop. However, in P mode you can index the exposure (+/-) and set the ISO speed for some creativity. The pre-programed modes have a good variety and they all basically work giving you the desired effects. Image quality is excellent IMHO for any P&S; camera in this price range. There is almost no difference in image quality between ISO 100 and 200. ISO 400 begins to show a tiny bit of noise or artifacts. ISO 800 and 1600 do show some noise but it looks to me like the camera automatically despeckles the picture, which eliminates most of the noise but noticeably softens the focus. Close focus mode works accurately. A couple of hints: First, set the camera to ISO 100 (rather than AUTO ISO) and you will get great pictures in most lighting conditions. Second, learn to use the white balance for the appriate lighting conditions (sunlight, cloudy, tungsten, etc.) Although the auto white balance works, it often won't work as well as setting it for the proper balance. Also, learn to set the flash functions. You often don't need flash to get a great picture and with the flash off you'll save battery charge. You can certainly preview your pictures to get the best results. Need to get that quick picture with no time to set the adjustments? Just hit the AUTO button!Strengths:Very small and compact, fits in shirt pocket when turned off.Excellent image quality with very adequate zoom range.Large easy to see LCD screen.Easy to use AUTO-mode with plenty of pre-defined creative modes.Rechargeable Lithium Ion battery.Camera can be set for personal preferences, like sound volume and LCD brightness.Rapid downloading of pictures to your computer.Weaknesses:No optical view finder.Controls are small and a bit cramped.Zoom control is in an awkward position.No case or SD card included.", "Date": "October 20, 2012"}, {"Title": "Great features. Image quality is lacking.", "Author": "Leon", "ReviewID": "R1GGSIUHGUUKTA", "Overall": "4.0", "Content": "I purchased this camera to replace a PowerShot SD780 IS ELPH that I have had for 3 years. The A4000 has decent reviews on other sites, so I bit. I wish I would have paid more and bought another Canon SD/ELPH.One thing the A4000 only takes 720p video at 25fps. My old SD780 did at 30fps.For my review, I am almost directly comparing the A4000 to my old SD780 which is 3 years old.A4000 Pros:1) Taking video with the steadyshot works very well.2) Miniature effect and other modes are fun3) Takes fast photos4) Zoom is phenomenal. 8x optical + 4x digital.5) View screen is large and sharp6) Construction feels really solidA4000 Cons:1) Video seems choppy and heavily compressed (blocky) compared to the SD7802) 720p is only at 25fps when most other models are 30fps3) Photos don't seem as sharp as the SD7804) Sound recording quality isn't as clear as the SD780", "Date": "May 8, 2012"}, {"Title": "Wonderful Camera", "Author": "Tom G", "ReviewID": "RLJBDNOZ78CUR", "Overall": "5.0", "Content": "The little camera is a charmer. The picture quality is color perfect. Has a big LCD display. The response time of the controls and zoom are very snappy. It has 8x optical zoom and if you keep your finger on the zoom it continues after a slight warning pause onto digital zoom for 32x. Yeah, the pic will get a bit grainy at that level but you've got lots of pixels to work with. What I really like is the light weight and it fits into my shirt pocket. Or, get the Case Logic case and snug it into your pants pocket or a purse. It's so light, you will actually take this one with you and use it. The price is great for the quality and I love the blue color. Yes, the purist will say there are compromises with a super small camera like this but it's not a concern for the average person taking snapshots and the occasional movie. I've had larger Canons but I like this one the best because it's usable and has plenty of features. Macro photography (closeups) is automatic and really easy. Canon did a great job on this camera.", "Date": "November 7, 2012"}, {"Title": "Little Camera with Big Features", "Author": "K. Duncan", "ReviewID": "R3BGK9QHOZFK6F", "Overall": "4.0", "Content": "When my pocket Sony camera died, I thought I wanted a little bigger camera with more features, but friends with bigger, \"real\" cameras convinced me to look for another pocket-sized camera for ease of carrying.  I compared at a lot of cameras in this \"class\" and am very happy with my decision to go with this Canon PowerShot.First, for such a little camera, it has so many cool features that I've had a hard time remembering they are all available, including many features that before now were only available in photo editing software such as fisheye and monochrome.  I will be honest that it's unlikely that I'll be able to use features like this \"on the fly\" for quick shots of the kids.  But if you are setting up a nice shot, it's fun to run through these features to see what you can get.  Probably the nicest thing is that even with a whole slew of manual modes available, it has a very nice and effective fully automatic mode which pretty much fixes any shot so it's good.  The automatic mode does create a bit of a lag in the time to take the photo, but the results are worth it.Second, the zoom quality is awesome. It has 8x optical zoom, then up to 30x digital zoom.  While playing with it around my house, I was amazed at the clear, close up shots I was able to get of small items on a dresser 18 feet away and even further shots of items BEHIND ME taken in the mirror of the dresser!The controls are easy use and fairly intuitive.  Getting to some of the features has taken a little getting used to since some of them are layered and I could not remember how to find them again, but after a while it all makes sense.  My old Sony had a touch screen, but I don't miss it at all.  Having actual buttons has been a nice change with being able to feel the buttons as well as see them.  Also, seeing the photos that have been taken is MUCH eaiser than on the touch screen which required moving from photo taking mode to viewing mode, then back to photo taking mode to continue.  THis Canon has a simple button that takes you right to viewing mode and back.  No multiple steps necessary.I've given it 4 stars rather than 5 only because I had a hard time finding features.  The manual could be more complete with regard to exactly how to USE some of these cool features and how to get to them, rather than just listing that they are there.Over all, I've been very happy with this camera and would recommend it whole heartedly.", "Date": "November 21, 2012"}, {"Title": "Takes good pics but NO optical zoom in movie mode", "Author": "guy", "ReviewID": "R3CDMFPO626NH0", "Overall": "3.0", "Content": "Good solid camera, high quality built and looks, nice LCD screen and easy user-friendly functions.  Takes good pics and records HD movies.....only one problem, HD movie mode DOES NOT HAVE Optical Zoom.  Which means, if you do zoom (digital zoom) while making HD movies, it'll start blurring.  So that's the only big downside, other than than...it's a great camera, just not a good camcorder.", "Date": "June 2, 2012"}, {"Title": "Great little camera!", "Author": "3ddraft", "ReviewID": "R7E3TF4DX8P46", "Overall": "4.0", "Content": "I purchased this camera actually for work so that we would have a camera to keep in the job truck.  The boss used it first time out and he's not one to pick up technology easily so when he had no complaints on the camera, I knew it was a good buy.  The pictures turned out great even in the shade under the roof.  There is some noticeable camera shake in shady pictures but nothing that couldn't be overcome with some more use and practice.The only major thing I have against this is that in pictures lit by full sun, there is noticeable vignetting.  I notice it since my other camera is a DSLR but for the typical user of this camera, it's not a big deal.  Just be sure to leave some space around your subject so that it doesn't detract when you're processing the pictures.", "Date": "June 25, 2012"}, {"Title": "Wonderful, until it wasn't", "Author": "Second Wind", "ReviewID": "R2LXIBXJ9UVR0F", "Overall": "3.0", "Content": "I was very happy with this camera, it was exactly what I expected, exactly as advertised and I have taken well over 1000 photos with it.  Of a sudden, for no apparent reason, it developed a fine line that runs vertically through every image, dividing the image exactly in half.  This is clearly not a lens scratch or other bump or drop type of damage, this is some electronic gremlin that decided to pay a visit and won't go away.Unfortunately, my return window is closed and I am sending it off to Canon today in the hopes of getting the camera back functioning as it was 3 months ago.Keep you posted.Update:  Contacted Canon and within a week I had a replacement.  It was refurbished but looks new to me.  Canon could not have been more accomodating and polite. They did not want the accessories returned and so as an added bonus I now have an extra charger and battery. Add another star to this review.", "Date": "September 5, 2012"}, {"Title": "A gift for my wife for Mother's Day and she loves it!", "Author": "jjceo", "ReviewID": "R2UJHXBIGI60PY", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moE8VJW6A8QLHEembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moE8VJW6A8QLHErefresh_preplay() {\n\ndocument.getElementById(\"cv_moE8VJW6A8QLHEchiDiv\").innerHTML = document.getElementById(\"cv_moE8VJW6A8QLHEhiddenPre\").innerHTML;\n};\ncv_moE8VJW6A8QLHErefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moE8VJW6A8QLHEso;\t   \n\n\nfunction cv_moE8VJW6A8QLHEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moE8VJW6A8QLHEso = new SWFObject(swfLocation, \"cv_moE8VJW6A8QLHEAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moE8VJW6A8QLHEso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moE8VJW6A8QLHEso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moE8VJW6A8QLHEso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moE8VJW6A8QLHEso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moE8VJW6A8QLHEso.setAttribute(\"height\", swfHeight);\n          cv_moE8VJW6A8QLHEso.setAttribute(\"width\", swfWidth);\n          cv_moE8VJW6A8QLHEso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moE8VJW6A8QLHEso.write(\"cv_moE8VJW6A8QLHEflashcontent\")) {\n          fp_resizePlayerSpace('cv_moE8VJW6A8QLHE', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moE8VJW6A8QLHE';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moE8VJW6A8QLHE', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moE8VJW6A8QLHEloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moE8VJW6A8QLHE\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2NQHDA3VIH7A6\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2NQHDA3VIH7A6\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2UJHXBIGI60PY\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2NQHDA3VIH7A6/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moE8VJW6A8QLHEduration')) {\n      document.getElementById('cv_moE8VJW6A8QLHEduration').style.display='none';\n    }\n    cv_moE8VJW6A8QLHEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moE8VJW6A8QLHEloadSwf(movieID, playerVersion) {\n   return _cv_moE8VJW6A8QLHEloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moE8VJW6A8QLHEnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moE8VJW6A8QLHE', 0, h);\n}\n\nfunction cv_moE8VJW6A8QLHEresetPlayer(w,h,bw,cc) {\n  cv_moE8VJW6A8QLHEnewHeight(h);\n\n  cv_moE8VJW6A8QLHEso.addVariable(\"resetBandwidth\", bw);\n  cv_moE8VJW6A8QLHEso.addVariable(\"cacheCode\", cc);\n  cv_moE8VJW6A8QLHEso.setAttribute(\"height\", h);\n  cv_moE8VJW6A8QLHEso.setAttribute(\"width\", w);\n  cv_moE8VJW6A8QLHEso.write(\"cv_moE8VJW6A8QLHEflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moE8VJW6A8QLHERollOverImg = new Image();\ncv_moE8VJW6A8QLHERollOverImg.src = \"http://ecx.images-amazon.com/images/I/81EiaDoJi5S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moE8VJW6A8QLHEpreplay = document.getElementById('cv_moE8VJW6A8QLHEpreplayImageId');\nif (cv_moE8VJW6A8QLHEpreplay) {\n  cv_moE8VJW6A8QLHEpreplay.onmouseover = function() {\n    cv_moE8VJW6A8QLHEpreplay.src = \"http://ecx.images-amazon.com/images/I/81EiaDoJi5S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moE8VJW6A8QLHEpreplay.onmouseout = function() {\n    cv_moE8VJW6A8QLHEpreplay.src = \"http://ecx.images-amazon.com/images/I/81EiaDoJi5S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moE8VJW6A8QLHEpreplay.parentNode;\n\n  var cv_moE8VJW6A8QLHEcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moE8VJW6A8QLHEcurrentClick) {\n      return cv_moE8VJW6A8QLHEcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 9:47 MinsMy wife loves to shoot photos and sometimes the iPhone just isn't good enough.  She likes taking photos of family gatherings and holidays and also of nature and animals.  I use a Canon 7D and she will not take the time to learn how to use it.  I purchased her this camera for Mother's Day and she just loves it.  It is a great point and shoot camera and it does everything she needs it to do.  This camera is extremely powerful and has many features in it.  I put together a video (I am sorry that it is so long) that covers only a few of the key features, such as:* 16 Megapixel camera* Shoots photos and videos* Simple one button access to take a video.* Able to zoom in on a subject in a video* Takes fast and easy photos* 8 times optical zoom and 32 times digital/optical zoom when combined* Small and light weight construction but solidly build* Image stabilization build in to eliminate hand and body motions and allow you to take better photos and videos* Nice 3 inch LCD color display with great resolution and clarity* Records movies in MOV format so my wife can automatically put them into iMovies* Good sound on the movies and very good resolution and video quality* Smart Auto AI that selects one of 32 preset shooting settings to take the right photos based on the conditions the camera sees.  My wife loves this feature.* Very nice AC wall battery charger that has foldable plugs and operates on 100 to 240 VAC and 50/60 Hz for international use.  Don't forget to take your wall plug adapters.Some weaknesses are:* No optical view finder and you have to use the LCD display in all conditions.* For my big hands the controls are a bit close together* I would have preferred a rocker switch for the zoom control* We had to buy a camera caseWhat my wife liked was the ease of use without having to do a dozen settings to get a reasonable photo.  She was shooting Macro shots of flowers and zooming in on nature shots and animals instantly and having fun doing it.  She wants to take good photos and not have to learn to be a camera expert.  For her she also loved the dark blue color as it reminded her of her beloved Indianapolis Colts.  She finds the autofocus easy to use and she has taken some great photos already.I installed a WIFI SD card and she can transfer the photos and videos to her iPhone and iPad without removing the SD card and she loves that.  I loved that it came with a lanyard as with my huge hands I was afraid that I would drop it all the time.This is good solid camera and we got it at a GREAT price at well under $100 and for that reason alone my wife loved it as she loves a bargain.  She rates it as a 5 star item and she is fascinated with it.  I glad I got it for her.", "Date": "May 7, 2013"}, {"Title": "Never met a Canon I didn't like... until now.", "Author": "CTN \"frosty\"", "ReviewID": "R3JS45I90DF4TY", "Overall": "3.0", "Content": "I bought this camera last night.  I'll be returning it tonight or tomorrow.  The picture quality is great and the zoom worked very well. The buttons were slightly hard to use because they were so small, but that's not a major issue for me.My first concern was the ridges on the cover for the lens.  My current powershot is smooth and I carry it in my purse everywhere.  (I have an 8mp camera on my phone but they have nothing on a canon!)  I am afraid to carry this one in my purse because the ridges will catch and open and possibly scratch my lens.My second concern, the main reason I'm returning it, is because it takes so long to take a picture.  I have two kids, 6 & 7, and they don't want to wait 5 seconds while the camera \"thinks\" about it!  It took considerably longer to take multiple shots, also.  My current p&s; is a SD1100IS Elph.  I've carried it around in my purse and my back pocket for a couple years and was planning on passing it on to my mother-in-law when I got this new one.  However, I will keep my 1100 for a while longer until I find something that seems as durable as this one is!If you're using this camera for non-time sensitive shots, I'm sure this is a wonderful camera (I currently have a Rebel T3i, a 5D, the 1100 Elph and my husband has 2 p&s; canons).  I zoomed all the way in and took a photo of an olive oil bottle.  The words were clear, the IS technology worked very well.  It's simply not a camera that will work for what I need.", "Date": "January 31, 2013"}, {"Title": "Great camera!", "Author": "Judy White", "ReviewID": "R1SDAX5RUJ9V7", "Overall": "5.0", "Content": "Best camera I've owned -- simple to use, Canon quality, lots of features. I like the larger screen with sharper image, as well as the compact size.  Only thing I miss is a viewfinder lens for bright days.", "Date": "July 4, 2012"}, {"Title": "Returned this camera shortly after purchase", "Author": "wesotevoli", "ReviewID": "R3R9GH2PFW22KJ", "Overall": "1.0", "Content": "I was extremely disappointed in this camera. I own a Canon DSLR but wanted a smaller, more compact camera to be able to take pictures with. It is capable of taking great pictures but all of the conditions have to be just right. The shutter speed was unbelievably slow. While trying to take a picture of my child playing, by the time the camera actually took the picture they were long out of the shot. If you hold the button down to \"force\" the camera to take the picture, it was horribly blurred and defeated the purpose of taking the picture in the first place. Even when waiting for the camera to focus, the pictures were not of the quality I have come to expect from Canon.  I tried using different features, settings and everything I could think of but nothing changed the fact that this camera is not worth buying. I knew that it was not capable of operating at the same level as my DSLR but I still expected it to operate at a basic level of \"point and shoot\" and take good pictures.", "Date": "March 22, 2013"}, {"Title": "Great size for a \"purse camera.\"", "Author": "M. Schoenfeld", "ReviewID": "R3EBF88XEEKEO8", "Overall": "4.0", "Content": "I am replacing a c. 2005 Olympus point-and-shoot digital camera. Anything newer would be vastly superior.I was considering the Canon PowerShot G15 12.1 MP Digital Camera with 5x Wide-Angle Optical Image Stabilized Zoom as a do-it-all camera, but I take a lot of action photos. I need a *fast* camera--a DSLR. So I went all the way up to a Canon EOS Rebel T4i 18.0 MP CMOS Digital Camera with 18-135mm EF-S IS STM Lens, but I am not going to keep that in my purse!Why miss a great shot simply because I don't have my camera with me? This little cutie will always be with me wherever I go.I could hardly wait for the battery to charge! Being familiar with digital cameras, I figured out the interface within minutes. I ran the camera through all its combinations. Fun! An 8x zoom and all the cool auto settings--including \"toy camera\" and fisheye--are fun to play with.Image stabilization means that I can do hand-held shots in less-than-perfect lighting and get a good image on the first try most of the time. Saves a lot of time when processing images.If you don't plan to read the user manual on CD, you'll be missing out on a lot of great information about the features. IT IS WORTH THE TIME TO LEARN HOW YOUR CAMERA WORKS. Look at the CD. More than once. Until you learn what all the controls do.The battery charger is small -- no cord! :-) The prongs flip out and then back in again. The charger lies flat against the wall when it is in use. There is an indentation so you can use the second electrical socket at the same time.The automatic lens cover is very delicate. Do not quickly lay the camera lens-side down as it is still closing. I got something caught in there, but the camera seemed OK after I opened and closed it a few times to check.I am very pleased with this choice for a \"purse camera.\" When I need a better image, or ability to shoot rapid fire, I'll have the \"big girl\" DSLR.When I use the cable to connect the A4000IS to my Win 7 PC, I get the option of deleting the images off the camera right after they're downloaded to the PC. Saves me a step later. You can also mark certain images as \"protected,\" so that they will not be deleted except when you format the camera's memory card. Maybe take a photo of your contact information, and protect that?The cable also works with my Canon Rebel, so right after I empty one camera, I stick the cable into the other and download off that one as well.UPDATE - JUNE 2, 2013: Within two months, this camera started to lose its ability to focus on something close in bright sunlight. It progressively got worse. The lens cannot focus and the shutter does not fire. The shutter will fire for long-range subjects, but the image is blurry. I did some online research. I'm not the only one who has experienced this.I CAN SEE DUST BEHIND THE FRONT LENS ELEMENT when I go out into natural sunlight and move the camera back and forth to give me some 3D perspective.I contacted Canon via e-mail. The recommended solution is to send in the camera for cleaning. Will this be a permanent fix? Am I better off just returning this camera, and starting all over? I'll be back for an update.UPDATE - JULY 5, 2013: I sent the camera to Canon. As soon as it arrived at their repair shop, they sent me a message by e-mail. Within 24 hours, they wrote back again to tell me that the camera could not be repaired for lack of parts. Really? It's relatively new. They sent me a reconditioned replacement. By FedEx. Faster than I was expecting. So I'm back in business, with only about a week of downtime. I'll watch this new camera for the same problem, but I'm happy to have my little purse camera back again!I appreciated Canon's fast response and their willingness to do what it takes to make me love this camera again. Canon sent a follow-up e-mail to ask how I liked their repair service. I think they are trying hard to make their customers happy.UPDATE - NOVEMBER 20, 2013: I am now on the THIRD camera. And I think that the auto focus is starting to go. Again. I assume that if the problem is a one-time fix, the reconditioned cameras that Canon has been sending me should stay fixed. But they haven't. I probably have time to return it two more times for replacements before the warranty is up. But will I bother? What's the point? I need a purse camera that will last for more than the one-year warranty period. So I have to downgrade my rating from 4 stars to ... two? One? Maybe one is all I can rate this camera. Pitiful. I wanted so badly to love it.UPDATE - JANUARY 14, 2014: I am approaching the end of the one-year warranty. I will return the camera one last time for a replacement. But I will not be able to let it rattle around loose in my purse. The dust eventually kills it. A local Canon dealer recommended I go with a sealed-lens camera such as the Canon D20. I'm not all that excited about giving up some of the image clarity for the durability. So I'm really on the fence. And the tops of the fence slats are poking me in the butt. I guess I'll keep the A4000 in my purse, but also put it inside a camera case to reduce the amount of dust it encounters while it's in there waiting for me to whip it out for a quick snapshot.I LOVE THIS CAMERA! It feels so wonderful in my hand. It takes decent photos for a camera of its size. I only wish it didn't succumb so easily to dust in the lens.", "Date": "February 5, 2013"}, {"Title": "Awesome camera!", "Author": "Yasmeen", "ReviewID": "R1Q5HORI4CW20T", "Overall": "4.0", "Content": "The only reason I'm rating this camera 4 stars is because I don't really like the design of it. HOWEVER, this camera is REALLY good. Especially for the price! The pink color is a very nice salmon color too, I would recommend that one. It has a lot of nice features and special effects. One of my favorite effects is the black & white. Not many cameras have that! Which I thought was awesome. It also has a whole bunch of other nice effects already in the camera, which is pretty cool so you don't have to transfer them then edit them on your laptop.Overall this is a very nice camera. AND it's super cheap! If you're thinking of buying a nice everyday point & shoot that takes clear photos for a low price, this is a good choice. :)", "Date": "November 27, 2012"}, {"Title": "Nice camera with ease of use with good picture quality and Zoom", "Author": "Abhi", "ReviewID": "R36PFJGZ9NX3XZ", "Overall": "5.0", "Content": "I had a Sony DSC H9 and was looking for something small and easy to carry, but at the same time did not wanted to compromise on the quality of pictures. This camera works good in sunlight and the pictures are really awesome. During night or indoors with less light the camera focuses on the subject in the Auto mode and the background is completely black. this was something I didnt like about this camera, but apart from this a very nice camera with good picture quality.", "Date": "August 1, 2012"}, {"Title": "Takes great pictures, but not for the elderly", "Author": "Craig R Layne", "ReviewID": "ROHG6RC0N6B79", "Overall": "4.0", "Content": "I purchased this camera with intentions of giving it to my 70 year old grandmother. I unboxed the camera to try it out first and was EXTREMELY pleased with the pictures it took. They were very clear, and exactly what I expected from a camera in this price range.However, the one thing I hadn't considered (even during my testing) was that my grandmother has rather weak fingers. Upon presenting the camera to her I noticed that she had a lot of trouble pressing the shutter button. She was able to do it, but it took some effort.I've decided to keep the camera (I like it that much) but I will be looking for one with slightly less resistance in the shutter button.", "Date": "November 26, 2012"}, {"Title": "Happy with camera", "Author": "tieman", "ReviewID": "R1ZTCYN83DY4A9", "Overall": "4.0", "Content": "I bought this to replace another small canon camera (PowerShot SD1100 IS) that died from the dreaded lens error problem. It works pretty much the same as my earlier camera and that is one of the reasons for choosing this one. I miss the view finder but the lcd screen seems to be brighter than the previous camera. After using it for a couple weeks I have to say I am very satisfied with it and would recommend it.", "Date": "November 5, 2012"}, {"Title": "GREAT PRODUCT", "Author": "canon rep", "ReviewID": "R2Q7143PAM6X2", "Overall": "5.0", "Content": "This is a really low price for such a great product.  This camera is awesome i paid $180 for it wish i would've known about this deal.... Well the camera is well worth every penny and yours comes with a 8GB SD card mine didn't come with anything.", "Date": "April 6, 2012"}, {"Title": "Great camera for the money", "Author": "M. Savini", "ReviewID": "RY5AXZW4MP790", "Overall": "5.0", "Content": "I normally don't write reviews but felt compelled after reading Sarahs giving it a 1 star review after it stopped working because she broke it.  Its a good camera for the money.  There are some limitations as detailed in other reviews but are easy to look past given. The price.", "Date": "July 8, 2012"}, {"Title": "canon camera", "Author": "Joanne Winrow", "ReviewID": "R2CH9OO3TFP768", "Overall": "1.0", "Content": "lens keeps jamming and is unable to reset itself!! it is a nice camera lots of issues with the zoom. do not recommend this model . I have another canon that does not have these issues!", "Date": "October 5, 2013"}, {"Title": "BAD", "Author": "Jessie Biggins", "ReviewID": "RJONJBJGM17XG", "Overall": "1.0", "Content": "the lens would not close. called customer service at Canon. Had to send it in. Next day get an email \" they do not repair this camera\".  Why did I waste my money to send it in? Located my receipt and it is still in warranty but now i am told I have to SNAIL MIAL THE RECEIPT; they do not accept email to see if they WILL warranty it. It has a 1 year warranty. DO NOT BUY CANONHORRID CUSTOMER SERVICE!", "Date": "August 12, 2013"}, {"Title": "Canon does it again :", "Author": "Larry  P. Whitfill", "ReviewID": "RM0MG7LGXMJ2B", "Overall": "5.0", "Content": "Worth every cent it cost!!!!  For its size it does a good job-no need to carry larger camera to capture the monment----", "Date": "January 28, 2013"}, {"Title": "Canon A400IS Great, Easy Camera", "Author": "wcpbkeyes", "ReviewID": "R8OR4XA67BNBM", "Overall": "5.0", "Content": "The camera arrived early!! and in pristine condition. It has a beautiful display, takes great pictures in a wide range of conditions and is very easy and intuitive to use. The cycle time between photos is very acceptable. All in all a good purchase at a great price.", "Date": "September 8, 2012"}, {"Title": "Disappointed", "Author": "Colibri", "ReviewID": "RS4O5HDMIJ4AP", "Overall": "3.0", "Content": "This camera was to replace an old Elph, but instead it's my backup camera. The camera has problems focusing. I take a lot of pictures, and 99% are not crisp and in focus--especially faces. Colors are dull and washed out, and sometimes the color balance is off. The video part works when the subject is not moving and the sound quality is fine.", "Date": "August 9, 2013"}, {"Title": "Disappointment", "Author": "Anh A. Nguyen-huu \"FifiEwok\"", "ReviewID": "R1W3P63BEJU232", "Overall": "2.0", "Content": "We bought this camera and received it on March 29, 2013. Four days later, on April 2, 2013 we took it with us on our overseas trip. Four days into our trip, the camera's focusing mechanism stopped working and the telescopic lens made cracking noise when powered on or off. Not being able to use it, we put it away in a corner of our cabin. Luckily, we had an old Sony CyberShot with us and we managed to record all the events of our voyage.We were in the Indian Ocean at that time and the satellite reception was down to zero, hence could not call Canon to report the troubles. When we got back to the US on April 22, 2013, we immediately contacted Canon Sales Office for an exchange or refund. Were however told that we had exceeded the grace period of 14 days by 9 days and nothing could be done except to send the camera to the Service Department for repair. Once they received the unit, it was immediately confirmed that repair could not be done on it. So they sent us a refurbished one.We bought a new camera, had it in our possession just for less than 8 days but now got a refurbished one instead. Is it fair?The colors of the pictures, when the camera worked, were very good and it is easy to use. But the quality was completely missing and the manufacturer did not live up to its reputation or its commitments.", "Date": "May 18, 2013"}, {"Title": "Disappointed", "Author": "David A. Castellano", "ReviewID": "RIERQ37R7XRQ7", "Overall": "1.0", "Content": "I have purchased a few Canon camera's in the past and have been very happy. This lens on this model broke during our vacation in Italy after 3 months, we called Canon and it was out of warranty. The lens is stucked can't be fixed after only using it a few times of careful use. I feel like Canon did nothing to help and wasted my money on a poorly built product. This will be the last Canon camera I purchase.", "Date": "February 1, 2014"}, {"Title": "Takes awful pictures", "Author": "Me", "ReviewID": "R3VR620LQ3RRR7", "Overall": "1.0", "Content": "I buy cameras that are less than $150 because with 2 toddlers they always get dropped or destroyed somehow. This is by far the worst one I have had (3 in the last 3 years). The picture quality is awful. The colors are off. A lot of pictures come out blurry. I am hoping one of my kids will drop it in a large pool of water so that it can forever be gone from my life. Okay, that's a little dramatic...but it's so useless that I just end up taking photos on my iphone. It's so much better.", "Date": "December 15, 2013"}, {"Title": "I returned it", "Author": "dean", "ReviewID": "R3D09IRWJ7ODWV", "Overall": "1.0", "Content": "The  lens stop working in the middle of vacation luckily I took two cameras with us. Or it would have been terrible", "Date": "November 10, 2013"}, {"Title": "Hate this camera", "Author": "Kindle Customer", "ReviewID": "RRASH5843I3IU", "Overall": "1.0", "Content": "I bought this camera when my beloved digital ELPH came down with the fatal lens error. This camera is the one that came up as the newest version of that ELPH. There is no comparison between the two cameras. This version doesn't have a \"kids and pets\" setting, so it's darn near impossible to get a decent action shot. A while back I discovered I couldn't get the flash to fire, even when you attempt to \"force\" it. It just doesn't flash anymore. Even in decent light conditions indoors, the shots come out extremely dark. I can't believe how much I dislike this camera. I get better pictures with my phone.", "Date": "October 22, 2013"}, {"Title": "Impressed with Cannon!", "Author": "purchaser", "ReviewID": "R175GCV6ETBX7B", "Overall": "4.0", "Content": "Sooo this little camera was great...for about 6 month and then out of no where it was giving me screen error and then would shut off automatically.  Yes I was annoyed.  We were in the middle of a 2 week road trip when this happened...so no documentation of the trips second half.  Anyway, I called Cannon and they told me to send it back for a repair/replacement.  I could not have been more impressed with Cannon's customer service, the guy I spoke with was great, and the processing was very speedy.  I sent the camera to them on a Thursday and had a brand new camera at my house the following tuesday.  All in all best service experience I've received ever and the new camera works great.", "Date": "August 14, 2013"}, {"Title": "For the most part, I love it.", "Author": "Hang Marquez", "ReviewID": "R3IMGBKGNWKW52", "Overall": "4.0", "Content": "It's a great little camera.  I love that it has a \"Program\" mode so I can customize the shooting settings to my liking.  In order to take full advantage of this camera (or any camera), YOU HAVE TO REALLY READ THE MANUAL!!!  I scanned through the manual when I first bought this camera and only shoot with \"Auto\".  Those pictures look good but not great.  After I read through the manual and set my \"Program\" mode.  Those pictures look so much better.  I gave this camera 4/5 stars because I feel the the focus are not focusing well.  Every time I took picture of human, their faces don't look focus (not blurry, just not as clear as I want it to be), but inanimate objects came out super clear.  So, there you go.", "Date": "January 19, 2013"}, {"Title": "I hate this camera", "Author": "Deena T.", "ReviewID": "RJ2IUYCK5HCA8", "Overall": "1.0", "Content": "Why isn't zero stars an option?  I hate this camera, it takes beautiful pictures, but it takes forever to get it to take the picture, then recharge the flash, and take the next picture.  I have a 7 month old son and by the time it takes the picture he's out of the frame and onto something else.  You literally have to hold the button down for 10 seconds, than it takes the picture, 20-30 seconds later the flash is ready for the next pic.  I've lost out on too many amazing photo moments because of this stupid camera.I had a previous Canon PowerShot, a model they don't make any long, this is the next version.  It too took forever to take a photo, but at the time I didn't have a child that I was trying to capture precious moments of.", "Date": "February 12, 2013"}, {"Title": "So far so good", "Author": "Luis Gonzalez \"luisgonzalez\"", "ReviewID": "R4KE0SVZXHCDK", "Overall": "4.0", "Content": "After some reading people roeviews II decided to buy this camera that was ok for my budget. I've always used Canon cameras and I'm not disappointed with this model so far. I received the camera just in time for a family trip to Disney World in Florida and i got good pictures with daylight, and decent pictures with night light. Response time to save is slow sometimes, not sure if this is because of the SD memory card or the camera itself, sometimes it's frustrating if you want to take more than one quick pictures. Options menu is hard to navigate sometimes if you want to change picture settings.In general I recommend this point and shot camera for casual photography  you'll get a good product for the money.", "Date": "September 2, 2012"}, {"Title": "What Happened???", "Author": "Renee Taylor", "ReviewID": "RGOH8FMALRC1", "Overall": "1.0", "Content": "We bought this cameral and a large memory card to take with us on a cruise. At first, it seemed to work great, except for 4-5 second delays in between pics.  We have a larger Nikon, but we needed a smaller camera to take on excursions. On our second excursion day, the battery started to die, and then the camera did a weird sonic-type flash and shut down. After charging up the battery later on the ship, the camera opened, but the screen was black. The message received was, \"no images available.\" This was the first cruise for our teenagers, so we were just sick that we possbily lost 300+ pictures from a day we could not replicate because we were hundreds of miles out to sea by then. Only after we returned home and opened the memory card in a different format on our laptop did we find that we hadn't lost the pics, BUT, the camera is shot. It was not dropped in water or onto any other surface. It just died. We'll be returning this camera for either a replacement or a full refund!", "Date": "January 7, 2013"}, {"Title": "Hope my experience is an exception..", "Author": "karthik chandran", "ReviewID": "ROMZ6Y72ZX9EJ", "Overall": "1.0", "Content": "Bought the camera for my daughter based on reviews I saw of the product on Amazon. She must have used the camera on 3 occasions and then gave it back to me saying it did not work. The battery would not recharge and we were prompted to replace the battery pack. I spent additional $$ replacing the battery pack. Now the shutter does not close and I am being told the battery pack is bad and I need to get another one. I am now tossing this one as $$ poorly spent and am looking for a better camera.", "Date": "January 15, 2014"}, {"Title": "No good", "Author": "Ms.Healthnut", "ReviewID": "R1KEBA39PEIKBV", "Overall": "1.0", "Content": "I thought Canon is a reputable brand! However this is just a cheap one. I am returning it because all the pictures I have taken are blurry and the color of the pictures are so pale. My daughter has a Canon elph 100hs and it's awesome take really great pictures and the colors are vibrant. I am so disappointed.", "Date": "January 15, 2014"}, {"Title": "Can't open battery door", "Author": "Stuart", "ReviewID": "R3242LE8U471OS", "Overall": "1.0", "Content": "The battery door was extremely hard to open and since you need to remove the battery every time to recharge, this was an awefule design.  Not sure if it was meant to be more water tight or a design defect but bad product.", "Date": "December 21, 2013"}, {"Title": "Very disappointed; flash stopped working", "Author": "Glenn Richter", "ReviewID": "RDN13ICMSVDEZ", "Overall": "1.0", "Content": "I had good expectations when I bought the Canon A4000 six months ago.  There were nice features, such as an 8X optical zoom, and a small size, for a decent price.  I've shot perhaps 300 images since purchase, a number of them with flash.  And now -- on a vacation abroad -- the flash stopped working, ruining several important shots and preventing me from taking others.  No, my camera wasn't knocked around or misused.  The battery is charged.  I had a family member who's quite conversant with Canon digital cameras try to troubleshoot as well. No luck.  I'm deeply disappointed with Canon's product failure, just as I wanted to enjoy my camera the most.  Buyer beware!", "Date": "October 20, 2013"}, {"Title": "Nice camera but fatally flawed lens design", "Author": "frankenstein", "ReviewID": "R1FIZGWTSUUWJ", "Overall": "1.0", "Content": "We bought these cameras for warehouse employees, however they only last a month or less because any slight knock while the lens is out and it damages the flawed zoom mechanism.Once the lens error happens the camera is worthless.Avoid like the plague.", "Date": "October 17, 2013"}, {"Title": "Lens is stuck and wont open after 9 months", "Author": "RA \"RA\"", "ReviewID": "R2LF3CYA53891Q", "Overall": "2.0", "Content": "I have been pleased with this camera--good pictures, easy to use--but it has broken after 9 months of use. The lens is stuck in the \"closed\" position, so when you turn on the camera, it tries to open the lens and then says \"error\" and shuts down.We haven't dropped it or anything. I have put it in my purse and maybe it got jostled, but you would expect it to tolerate that.", "Date": "September 15, 2013"}, {"Title": "This camera had Error 32 message from the start", "Author": "gary c gibson", "ReviewID": "RIHEZERG35KBM", "Overall": "2.0", "Content": "Error 32 messages are common. They mean something is wrong with the camera's lens housing I believe. It turns off the camera automatically after about 60 seconds. So one can take 3 or 4 quick photos or a brief video and then it shuts down.There was something wrong with the lens protection system when the camera is off from the start. There is a little piece or two that I believe is supposed to open on starting and close when going off.When the camera's lens extension and closing motor starting making noises I took off the lens cover to look at it and that's as far as one can go at making a repair. I took out the one non-functioning lens protection arm-the other was missing.If one has a notebook computer the software with the camera may not install. Photos downloaded directly to the web book from the camera are in quicktime mode-not too useful for a pc.", "Date": "September 10, 2013"}, {"Title": "Pretty good camera", "Author": "Art-KR", "ReviewID": "RRIIWFJLORI4D", "Overall": "3.0", "Content": "I bought the camera this spring. I wanted a small camera with wide angle lens and it was discounted at Office depot. I already had the Canon Digital Elph 780 and really liked it. Anyway I used the camera a few times and then it would not sync with the computer any more. Emailed Canon and ended up sending it in. I was annoyed because I had to pay for shipping, having just bought the camera, but they sent me back a refurbished one, quickly. I was also annoyed that it was a refurbished one, but it looked brand new and it works.I took both my cameras out west with me on a trip. I was disappointed in the macro setting. I took pictures of flowers with it and they were blurry. They actually turned out clearer on the auto setting. I took some landscape pictures of mountains that turned out beautiful and had high quality of detail and beautiful color. I think the wide angle works and helps the landscape pictures turn out better. I'm just an very! amateur photographer so I still have a lot to learn. I've noticed that most interior pictures do not require the flash so most of the time I keep it turned off.The A4000IS is heavier and a little bit thicker than the 780 Elph but it still is very portable. I like the rounded corners.One thing I was very disappointed about was that Canon has discontinued including a Manual with it. The manual is on the computer disc. With the 780 Elph I carried my little manual around with me in the case and it was very helpful. Having to look on the computer every time I want to know how to do something is unhandy and impractical on the road.I really don't care for the software and as far as I can tell you have to use it to upload your pictures. My 780 Elph does not require that. I like to use Photoshop Elements to edit my photos so I don't like the extra steps. After downloading the pictures they go to files in the Pictures Section of the Libraries on Windows 8 so I exit the Canon Browser and go straight to Photoshop for editing.Both cameras take regular size SD cards for memory and their batteries come with the camera and are rechargeable and come with a charger that plugs in a wall socket so these features make them a lot cheaper to use.All in all I like the camera okay but I think there are other ones out there in the same price range I might have liked better.", "Date": "September 6, 2013"}, {"Title": "Shutter problem", "Author": "JW", "ReviewID": "R4KUB6SD3P8RU", "Overall": "2.0", "Content": "Although this may be a one-off issue, thought I should mention it. For the one I got, the shutter does not close properly. When you press \"off\", you can tell it tries to close but is stuck. You have to manually push it back in.Also a minor issue. The battery cabin is very difficult to open. You have to press and slip very hard to open it. When I showed to my father, he cannot even open it.Again, not sure if this is a one-off thing. Just want to let you know what I got.It was supposed to be a gift for my father who is in another country. So this is very disappointing.", "Date": "September 4, 2013"}, {"Title": "good amateur camera", "Author": "Carrie Befort", "ReviewID": "RPE0XGZ45ZQ2T", "Overall": "5.0", "Content": "This camera is perfect for someone who just wants pictures for memories or fun. The main problem is that if it is on auto it can take a few seconds to determine circumstances so it takes longer to take a picture. After, however, it determines circumstances, if you take another picture in the same place it is much faster. The quality of video for a  hand held camera is excellent and the pictures are good as well. For my uses, it is perfect.", "Date": "August 20, 2013"}, {"Title": "GREAT LITTLE CAMERA FOR US SNAPSHOT TAKERS", "Author": "WRR \"mailcat8\"", "ReviewID": "R1EWFH5M9ZG30I", "Overall": "5.0", "Content": "Works perfectly.  For a case that is a good fit (not too tight) and has a small compartment that can hold an extra battery, try Caselogic TBC-302 Ultra Compact Camera Case with Storage that I got w/ this camera.", "Date": "August 10, 2013"}, {"Title": "Pleasantly surprised", "Author": "Quiet D", "ReviewID": "R3HOVJXW125QVX", "Overall": "5.0", "Content": "I wasn't expecting much and already have a big fancy SLR with different lenses, etc., but I ordered the PowerShot to throw in my purse on vacation and ended up using it almost the entire time.  It takes great pictures without being bulky, is easy to use and the zoom feature is great.", "Date": "August 8, 2013"}, {"Title": "Great Camera, Great Company", "Author": "KerouacBean", "ReviewID": "R2UR1FFBMVQWLC", "Overall": "5.0", "Content": "My boyfriend bought me this camera in March and it worked great. It's easy to use, the color is so pretty (I got blue), and it's so easy to upload the pictures to my computer. Plus the program that comes with the camera automatically sorts the pictures in my folder into separate folders by date which is so convenient and makes the photos easy to sift through and find. A few months after having the camera, I pulled it out of the case and every picture had a line across the image, even when I uploaded the pictures to my computer. I emailed Canon and they told me to send it in. I had to pay for shipping to get it to Canon, but once I sent it in, Canon had returned to me a refurbished camera in less than a week with a brand new battery and charger, all the accessories, so now I have two of each of those. The camera works great and I didn't have to pay a cent for the repair because I believe it was soon enough after I bought it. I had ended up sending it in almost six months after purchasing it. I am very pleased with Canon's service. They emailed me back in a timely fashion with all the details I needed and then my camera was returned to me completely fixed so quickly and with new accessories. I don't usually write product reviews, but I wanted to give Canon the shout out they deserved for this. I will have no problem buying a Canon again.", "Date": "August 5, 2013"}, {"Title": "You can't go wrong for the price..", "Author": "Jake", "ReviewID": "RPF805FHA7T12", "Overall": "4.0", "Content": "I was looking for something to replace my old Fuji 3800 FinePix which has 3 megapixels and 6X optical zoom.  The Fuji actually takes very sharp pictures (primary reason is its low, non-adjustable ISO setting of 100), but it's a bit bulky.  I wanted something compact that I could put in my shirt pocket and didn't cost much, yet had reasonable zoom and took pics at least equal to the Fuji's quality.  I think I found it in the Canon A4000.I've used it only for about a week, but I'm very pleased.  First off, forget about using it in Auto mode because it decides on the ISO setting (what used to be called the ASA number with film).  The higher the ISO, the grainier and less sharp the picture.  For general picture taking you want to set the ISO at the lowest setting (for this camera, 100).  You do that by selecting the P mode (Programmed Auto Exposure).  Photos in Auto mode will be less sharp if the camera automatically sets the ISO higher than 100.  Even though you can't set ISO in Auto mode, you know what the camera is selecting by pressing and holding the shutter button half-way and you see it indicated in the lower right corner of the screen.  Very often, despite what appears to be a well-lit situation, in Auto mode the photo is taken at an ISO higher than 100 which explains a less sharp image than if it were taken in P mode at ISO 100.  Of course, in lower light situations you want to select higher ISOs in order to get proper exposure even though the result won't be as sharp.  A disadvantage for selecting the lowest ISO in P mode is that the shutter speed will often be slower than in Auto mode which risks image blur.  But that should be compensated by the automatic image stabilization feature.Interestingly enough, even though the camera has 16 megapixels its image quality at ISO 100 is no better then my old Fuji with 3 megapixels.  So, I can't say I'm not satisfied although you'd expect that with more than 5 times the pixel resolution, the photos with the A4000 would be somewhat crisper than the old Fuji.... which tells me that the number of megapixels being touted is overblown -- I'm sure a lot depends on the camera's image processor (CMOS vs. CCD) and its other technical characteristics.  At any rate, for a little over a hundred bucks I have no complaints and the photos are good to excellent in sharpness and outstanding in color rendition...plus it fits neatly and lightly in my shirt pocket.  I recommend it.Incidentally, the Canon Image Browser EX software that comes with the camera is OK, for a freebie.  It's not Adobe Photoshop by any means and has some nice features such as image sharpening, but it's ease of use is only fair.", "Date": "July 28, 2013"}, {"Title": "lens error after 3 months", "Author": "toto \"toto\"", "ReviewID": "R22AU1I7PREU70", "Overall": "1.0", "Content": "I am very disappointed with this product. the lens cannot shut down after I used it for 3 months, I have to push them back manually every time. Now, after 4 months, the lens cannot come out!", "Date": "November 5, 2013"}, {"Title": "Amazing", "Author": "Amazon Customer", "ReviewID": "R22HA66YK233JG", "Overall": "5.0", "Content": "I'm a camera buff and semi-pro photographer.  I've been in galleries and all that.  Fine art.  I've had over 40 digital cameras, as well a a bunch of film ones.  This is my go-everywhere camera, believe it or not.  Small, fairly light, and takes great pictures AND video!  Bring the pics into Photoshop and with a couple clicks you end up with REALLY stunning shots.  But even straight out of the camera I'm amazed.  Especially for the money.  Now, if you want to drop some serious money, the best bigger, but not as big as a DSLR, digital camera out right now is the Olympus OM-D E-M1.  Mind-blowing.  But $1,400.", "Date": "May 21, 2014"}, {"Title": "This was  a replacement for a camera that I dropped - quick & easy to use", "Author": "Carlotta Christensen", "ReviewID": "R19RITFBTBXUU9", "Overall": "4.0", "Content": "I had a camera just like this before, but I dropped it.  This camera takes good pictures for a small, inexpensive camera.  I really like that I can carry it in my purse or pocket.  It is quick & easy to use!  I've happy with my purchase!  :)  This time I bought the 2 yr. insurance for approx. $10, in case I drop my new camera.", "Date": "May 12, 2014"}, {"Title": "Good little camera", "Author": "Laura Motoyoshi", "ReviewID": "RU1TKG6RJEUDO", "Overall": "4.0", "Content": "Needed an easy to use with good quality camera.  This fit my requirements. A very good buy for someone who is technically challenged.", "Date": "March 16, 2014"}, {"Title": "Lens error rendered the camera worthless just out of warranty", "Author": "TSMayberry", "ReviewID": "R1LYFU78YJP38U", "Overall": "1.0", "Content": "I loved the camera for the year that it worked.  I usually took it with me to work functions off site when I didn't want to be bothered hauling around my Nikon digital SLR. Loved the video feature, even indoors.I was plagued by the automatic lens cap that would not close properly.  Then the camera zoom lens stopped working completely, When I try to turn the camera on the screens says \"Lens error Will shut down automatically  Restart camera.\" The problem is that when I restart the camera I get the same message, and of course it powers off completely.", "Date": "February 23, 2014"}, {"Title": "It only lasted a year", "Author": "Mazz", "ReviewID": "R2PV6Z93XC4C08", "Overall": "2.0", "Content": "Bought this camera for Christmas 2012.  1 year and 1 month later the lens would not close and the digital screen read \"lens error, restart camera\"  after several attempts  turning the camera on and off the lens would not retract and the camera wouldn't allow me to take any pictures.  I sent it to Canon repair and they replied  that the camera is non repairable, but for $89 they would send me a refurbished one.  I cannot believe that after only 1 year the camera is no longer operable.  This speaks poorly for Canon products.  I was in the market for a high end 35mm SLR and no way will I buy a Canon now, I'm going with Nikon.  If they can't get a basic point and shoot right I'm not taking a chance with another Canon product.  UPDATE**  Called Canon today and they are replacing my camera for free. I was very surprised so I have to reconsider them due to their excellent customer service.", "Date": "February 6, 2014"}, {"Title": "not bad.. but fairly slow.", "Author": "Hoang Tran", "ReviewID": "R100HCLLTX7Z36", "Overall": "3.0", "Content": "I got this for my parents since the buttons and screen were bigger than most small digital cameras. I thought it would be easy for them, turn on, point, auto focus, shoot. That wasn't the case. The build quality is a bit disappointing.. but given the price, i should've lowered my expectations. When turning the camera on, it is fairly slow...almost \"cell phone camera\" slow. I set everything on automatic so my parents just need to turn it on and shoot. However, the shots come out fairly blurry. I attribute this to being my parents fault as they don't really understand how to hold half down to focus then full press to get the shot. But also I had issues getting clear shots. I messed around with some settings and was finally able to get clearer images. But when i transferred them to my pc, the image quality was not on par with my canon elph 150.", "Date": "December 26, 2013"}, {"Title": "Image Quality and Shutter Speed is lacking", "Author": "T. Weber", "ReviewID": "R49SB5D0JAK00", "Overall": "2.0", "Content": "I have owned this camera for a year now.  While I have been very impressed with the image quality in full sun, the image quality in low-light settings is not very good.  The images are often grainy, or the camera does not focus well and images do not have sharp clear edges.  We have children, and have been very disappointed in the images we take of them.  Though kids do move a lot, our previous canon took great pictures even though the time between pictures lagged.  We find that this camera lags between each picture, and that the images are often blurry.  I do not recommend this camera unless you plan to take all pictures outside and in full sun.", "Date": "December 25, 2013"}, {"Title": "Poor quality", "Author": "DAnie118", "ReviewID": "RVAXQ5Q9CJYER", "Overall": "2.0", "Content": "The quality is inconsistent-I should have returned it.  In the beginning I thought I just needed to become more familiar with the camera but the quality never improved.  I have friends with the same camera and whenever they looked at my camera they weren't sure why mine didn't work.", "Date": "December 15, 2013"}, {"Title": "Little workhorse", "Author": "R. Arnold", "ReviewID": "R37Y8Q3F22CWV2", "Overall": "5.0", "Content": "This little baby really delivers.  Has more features than I'll ever use and the AUTO mode gets some great shots for a change.LCD display could be brighter:  Hard to see sometimes under bright sunlight.  Have dropped it, got it wet, basically beat it up in my jersey pocket on bike rides and it just takes a lickin' and keeps on tickin'.  Does GREAT HD video too.", "Date": "December 3, 2013"}, {"Title": "Disappointed with Image Quality :-(", "Author": "ivang3 \"ivan\"", "ReviewID": "R219J2IMUEP85R", "Overall": "2.0", "Content": "I'm always picky about image quality.  This camera is nice and small, but I'm disappointed with it's image quality so I'm now selling and trying to get some money back.  I had to revive colors quite a bit with Photoshop.  Also, the images were not very sharp.  I would go to dpreview.com and find some better cameras for slightly more $.  It would be worth it.  I originally paid $120 at the beginning of the year.", "Date": "November 19, 2013"}, {"Title": "Nothing special, but solid nonetheless", "Author": "Andy A", "ReviewID": "RRG7ZDSUK2ZN", "Overall": "4.0", "Content": "This is an asbolutely nothing special but very solid point and shoot camera. The power on time is excellent but the time between shots can take several seconds- not great for fast moving objects/animals/people. Quality is great in the daytime, but nighttime or low light shots suffer without a stabilizer like a tripod- noise and blurriness creep on fast as light diminishes.Overall this a great camera for families taking well lit pictures at parties, and decent as a vacation camera. If you want fast picture-to-picture time or better low light performance, you will most likely have to spend more than you will spend on this camera.+ fast power on+ decent battery+ can record HD video- suffers in low light (blurry, noise)- can take a noticeable amount of time to write picture to SD card", "Date": "November 4, 2013"}, {"Title": "Low-light photos very grainy", "Author": "M. Edwards \"fpmdsc\"", "ReviewID": "R2HYL2TNDW6O1N", "Overall": "3.0", "Content": "I had hoped to get away with getting a quality pocket point-and-shoot camera for about $100.  Big mistake.  I have great appreciation for most Canon imaging products, but this one misses the mark (although I don't blame Canon at this price).  With relatively favorable reviews I was hoping for a CCD sensor that had the quality of a CMOS sensor.  But such point-and-shoots apparently don't exist.  Low-light images (e.g. In a museum that does not allow flash photography) were very grainy.  Outdoor images were good but not great.  I very well may return this and look for a Canon point-and-shoot with a CMOS sensor.  That will probably cost at least $100 more than this one.  But when you are taking photos of once-in-a-lifetime experiences, do you really want to take the chance on sub-par image quality of your photos?  I sure don't.", "Date": "October 27, 2013"}, {"Title": "The most digital camera you can buy at this price point", "Author": "William Marling", "ReviewID": "RTGA1ZUMAC1RF", "Overall": "5.0", "Content": "I've been an amateur and professional photographer for 50 years.This is my favorite pocket camera. It does not cost a fortune, so if  I lose it -- and you do lose these things -- I am not out a fortune.  This is the third one I have ownedIt takes decent video with sound, and good still shots. It has a good variety of pre-programmed 'modes,' and I particularly like the silent or stealth mode.It is durable. Survives minor falls.  Relatively moisture-proof, unlike the Casio.  Not fazed by very hot or very cold weather.Battery life is excellent, and it can be re-charged on the same charger in Europe or the USA.How can you beat it?", "Date": "October 26, 2013"}, {"Title": "Love this camera!", "Author": "Janet Pski \"Janetpski\"", "ReviewID": "R3DLCI20D74U2T", "Overall": "5.0", "Content": "This summer I had the awful experience of losing my old Canon PowerShot while on vacation.  I was heart broken because I loved that camera and had taken many wonderful pictures with it.  After a week of researching for a replacement I settled on this one and I have not been disappointed.  It is easy to use and, like my old camera, it takes great pictures without a lot of fuss.  If that is what you are looking for this camera is for you.", "Date": "October 5, 2013"}, {"Title": "just so so", "Author": "Kane0409", "ReviewID": "RGOYFO7M0WSIA", "Overall": "3.0", "Content": "just 8x, i think it should be 16x or 20x. but it's cheap, so i think it's ok. maybe i should pay more money to buy a better one.", "Date": "September 3, 2013"}, {"Title": "Not satisfied", "Author": "Ryene", "ReviewID": "ROIC1N2F5Q5VB", "Overall": "3.0", "Content": "I read a bunch of reviews before purchasing this camera and they were mostly positive but I wish I would have picked a different camera.  It is a decent simple camera for regular picture taking.  But the zoom is awful.  U get a blurred, unrecognizable picture when you zoom in.  I was looking for a camera that was better than my 6 year old Kodak but honestly,  they seem to be exactly the same.", "Date": "August 18, 2013"}, {"Title": "Excellent, attractive camera.", "Author": "jama555us", "ReviewID": "R3E0QMMYBMHZIZ", "Overall": "5.0", "Content": "I love this camera. It is very user friendly, and very solid built. The pictures turn out great and it is very easy to transfer the pictures from camera to computer.The only drawback to the camera is the there is a longer than user lag between pictures and the images on the LCD screen appear grainy.However, the bottom line is that I have taken some of the best pictures ever with this camera.", "Date": "July 14, 2013"}, {"Title": "Great camera", "Author": "Deborah N.", "ReviewID": "R3SX88Y6WN40NT", "Overall": "5.0", "Content": "really easy to use  takes  great pictures. Good for on the go people. I have problems taking pictures, however this camera is great  no more problems", "Date": "June 17, 2013"}, {"Title": "small and great resolution", "Author": "BZman", "ReviewID": "R3ND45U6M12YT4", "Overall": "4.0", "Content": "This small Camera has many great features with incredible zoom for it size. I like the automatic scene select feature. With about $100 you got all you need.", "Date": "April 9, 2013"}, {"Title": "Great camera", "Author": "jason", "ReviewID": "R287ZOUUTGRTCJ", "Overall": "4.0", "Content": "Easy to use camera right out of the box. would recomend to any one looking for an inexpensive camera around the 100 mark.", "Date": "February 1, 2013"}, {"Title": "Point & Shoot", "Author": "Shar", "ReviewID": "R2PVB7P3U1L709", "Overall": "4.0", "Content": "Excellent picture quality.  My previous Cannon was similar size with a view finder.  Newer small digital cameras don't have view finders.  I missed the view finder feature originally but I'm adjusting.  Video quality is excellent for such a small camera.  Owned this for 2 months,  easy to slip in a pocket or purse - ready for that quick shot!  Several features I have yet to use but should enjoy.", "Date": "January 31, 2013"}, {"Title": "As always: Perfect.", "Author": "Jim Transue", "ReviewID": "R1G4MBSTYW8SVF", "Overall": "5.0", "Content": "I got this to replace a ELPH that lasted for 6 years and captured many memories on my motorcycle at many monuments and parks. This did not let me down. It's pictures are crisp and the video sharp. No more others for me.", "Date": "January 27, 2013"}, {"Title": "Great quality", "Author": "Bill", "ReviewID": "R3O2KCHZ4BM0PF", "Overall": "5.0", "Content": "I bought this for someone who is far from being a pro with a camera. The pictures she has taken so far are of great quality, and the camera is simple to use. She likes it very much, and so do I.", "Date": "January 26, 2013"}, {"Title": "one great little camera", "Author": "David Hanthorn", "ReviewID": "R17W0I4X16137B", "Overall": "5.0", "Content": "I bought this camera for my wife to take along on our latest trip to Thailand.  We both ended up using it a lot, cause it is just so darn handy, and it takes great pictures.", "Date": "January 24, 2013"}, {"Title": "Canon never disappoints!", "Author": "Gail M. Clifford", "ReviewID": "R1KKP7RKRZ49E0", "Overall": "5.0", "Content": "We live in Montana and never leave the house without a camera!  We might miss a herd of elk that needs a zoom lens or a sunset that needs to be shared.  This camera fits in my shirt pocket and it there when I need it.", "Date": "January 23, 2013"}, {"Title": "Good value", "Author": "Tennille M. Anderson", "ReviewID": "R36279I3B5PNPA", "Overall": "4.0", "Content": "Easy to use,so user friendly my 5 year old has no problems navugating the buttons.takes good pictures.Very happy with my purchaseCameras isn't really pink, looks more metallic.", "Date": "January 22, 2013"}, {"Title": "Good, little camera", "Author": "Big Wally", "ReviewID": "R31ENQBYEE3CC7", "Overall": "3.0", "Content": "I bought this for my wife. I have had 2 other pocket-sized Canons and have been very happy with them. This is a good, little overall camera for family pics, vacation and email. Nothing fancy but just enough to keep most anyone satisfied for casual use.  I bought the camera, case and 16GB memory card as a bundle for around $115. Good value.", "Date": "January 20, 2013"}, {"Title": "Canon PowerShot A4000 - a very nice camera", "Author": "Pat Whitcomb", "ReviewID": "R1CJJGV9SFRQYU", "Overall": "4.0", "Content": "I like a point and shoot camera and this one fits the bill nicely. It is very compact to take along in my purse and very easy to use. I like the one door that holds both the SD card and the battery. I also like the compact convience of the battery charger. It is very easy to take the wall charger with me when I travel. I have used this camera for 4 months.The door is stronger than the SD door on my Nikon Coolpix that broke.", "Date": "January 18, 2013"}, {"Title": "Slow to focus", "Author": "Renee B.Kharboush", "ReviewID": "R3K07GO7DN56D8", "Overall": "3.0", "Content": "This is an OK camera but is slow to focus even when set on auto. The pictures come out OK thou. It says that you can continue to take pictures even when the previous is still on the screen, but I don't dare because of the long focus time.", "Date": "January 15, 2013"}, {"Title": "Awesome", "Author": "Hoosier girl", "ReviewID": "R1VN443XEK66HB", "Overall": "4.0", "Content": "I purchased this item as a gift, they were pleased. I based my decision on other reviews that were posted.", "Date": "January 15, 2013"}, {"Title": "perfect", "Author": "Kristin", "ReviewID": "R2W6SSE0ASH7ZG", "Overall": "5.0", "Content": "Camera came quickly and was a great purchase for the price. I would recommend this to anyone who needs/wants a good camera for a low price.", "Date": "January 14, 2013"}, {"Title": "Very happy with my camera.", "Author": "R. Crawford", "ReviewID": "R1UAZFPCBXLO4J", "Overall": "5.0", "Content": "I wanted a camera small enough to fit in my pocket, yet have the ability to let me change the settings for different situations, and easy to use. This little red camera has all of that and more. The reason for the 5 stars:  the battery, which is included, is rechargeable", "Date": "January 13, 2013"}, {"Title": "Christmas Gift", "Author": "MDR", "ReviewID": "R2PQJZBERQ3F5I", "Overall": "5.0", "Content": "Got this for my daughter for Christmas. She loves it! Fast shipping and nice camera. Small in size but big with feartures. Screen is nice size!", "Date": "January 12, 2013"}, {"Title": "The Best", "Author": "Pierina Pflucker", "ReviewID": "R1TU8RHRQ4RRK", "Overall": "5.0", "Content": "This product is 100% recommended, excellent camera at a good price, takes incredible pictures, is a good investment. I like all of the product", "Date": "January 10, 2013"}, {"Title": "View grainy", "Author": "Bernadette", "ReviewID": "R3IFQ830M386RK", "Overall": "3.0", "Content": "when you focus, the view is a little grainy, even though the picture comes out clear, like the color and its small enough to fit in your pocket", "Date": "January 8, 2013"}, {"Title": "Great Bargain!", "Author": "Kare Hornschuch", "ReviewID": "RG6HUZSF9DQO4", "Overall": "5.0", "Content": "I purchased this camera for $99 and find it well worth it's full price of $200. So far I have only used it in the Auto setting but caught a stunning nighttime closeup of a yellow rose with raindrops clinging to the petals. The photo was crisp and clear and the color accurate. Also like the sturdy feeling of the body, nothing cheap in the construction, and yet it is reasonably small and light enough to slip into my pocket. Looking forward to many more adventures with this Canon!", "Date": "January 2, 2013"}, {"Title": "Nice Product", "Author": "Elot Luna Vasquez", "ReviewID": "R17MHKE5MQGW8L", "Overall": "4.0", "Content": "good productgood qualityAs to the descriptionmeets expectationsI will recommend to my friendsbuy it againthanks", "Date": "January 2, 2013"}, {"Title": "Just what my dughter wanted.", "Author": "Beth Phelps", "ReviewID": "R1NJGQRJ35W24L", "Overall": "5.0", "Content": "This arrived very quickly and perfect. It takes great pictures, they are so clear. My daughter is very pleased with this and I can not complain on the price and the quickness.", "Date": "December 27, 2012"}, {"Title": "Pictures are Sharp indoors", "Author": "Salena Galloway", "ReviewID": "R197JFLP9E221H", "Overall": "5.0", "Content": "The camera takes really sharp and clear pictures, even in low-light.  Changing the ISO was a must, but this camera performed great in low lighting situations.  Also, the menu navigation was very user-friendly, and easy-to-use.", "Date": "December 26, 2012"}, {"Title": "you will love this camera", "Author": "Sally Reinke", "ReviewID": "R23T5RDPMRFZ1O", "Overall": "5.0", "Content": "I had been dealing with a camera that took horrible, grainy photos, for the past few years, and really was a bit afraid to get another modestly priced, point and shoot camera.  Never fear!  It takes beautiful, clear photos... I'm so glad I got this camera. I look forward to using it for a long time.", "Date": "December 24, 2012"}, {"Title": "Good camera overall", "Author": "VTpug", "ReviewID": "R1QTBSEKFR5DR9", "Overall": "4.0", "Content": "I'm not a professional photographer, not do I use all of the options available on the camera (at least not yet), but this is a pretty good overall camera.  The only thing I take issue with is that there is often a delay in the camera taking a picture after pressing the button and I've missed quite a few good shots of my children because of this - it seems to get stuck focusing or something.  It seems pretty sturdy so far and well made, but we've only  had it for a couple of months.  The picture quality is good as well.  For a camera in this price range (~$100) it is a good option.", "Date": "December 20, 2012"}, {"Title": "Good Camera", "Author": "Arnaldo Cedeño", "ReviewID": "R1A0W47Y2PYXE4", "Overall": "5.0", "Content": "Very Good camera, It is ease,fast,get HD picture, new and all fine with this product. by one and enjoy this.", "Date": "December 4, 2012"}, {"Title": "great camera", "Author": "Tallahassee", "ReviewID": "R8ACLX9SB6SJ1", "Overall": "5.0", "Content": "We have a larger DSL camera but it is difficult to use. This camera is small, lightweight, and feels solid. Its easy to use and fits in your pocket. The buttons are small but surprisingly function well and the back screen looks great and is a perfect size. I plan to buy one for my parents for Christmas because they are using an old cheap Kodak that takes crap pictures. I got this for $129 and I think its a great deal for this camera!", "Date": "November 12, 2012"}, {"Title": "Great product", "Author": "Spike", "ReviewID": "R3DFIM1PKKF2H6", "Overall": "5.0", "Content": "I have been looking for a camera for a long time.  This camera is exactly what I wanted i.e. small, simple, quick, with a great zoom, at a good price.  I highly recommend it.", "Date": "October 30, 2012"}, {"Title": "First time with Cannon and loving it!", "Author": "Robert Maxim", "ReviewID": "RUHKW23QRG3Z6", "Overall": "5.0", "Content": "I love the camera, takes excellent pictures, and highly recommend. Also, love that I can now do videos although have a video cam, never did learn how to use and this is so simple with the camera. Very pleased. I just wish I could understand more as so many settings. One problem I'm having is finding out how to lighten at night when shooting video outside in dark.", "Date": "September 14, 2012"}, {"Title": "Great Little Camera", "Author": "Thomas Murphy", "ReviewID": "R2K1GAHYIS9FRA", "Overall": "5.0", "Content": "I needed a new camera for just taking pictures of my family. This camera was a great price and after using it I think a great buy. It takes very clear, crisp photos and it very easy to use. Once and a while it does have a shutter delay, but I've tried many other more expensive's cameras that have the same issue. The video on it also works well but you have to make sure that you hold the camera horizontal or the video comes out sideways and I have not figured out how to rotate the video as I do with a still photo. I think for anyone who just wants to enjoy taking photos this camera would be great.", "Date": "July 22, 2013"}, {"Title": "Sharp pictures", "Author": "Karen M. Beeze", "ReviewID": "R1ZAU96TLPFD11", "Overall": "5.0", "Content": "I love this camera.  I love the rechargeable battery.  I spent a lot of $ on batteries with my old camera and had to remove the batteries when not in use or it would use the battery.  This camera's battery has never run down while I have been using it.  My son recommended it because he has one.", "Date": "June 21, 2013"}, {"Title": "Good, but...", "Author": "RB", "ReviewID": "R2Y7ZU3AK7517H", "Overall": "4.0", "Content": "The Pro's:1) Easy to use, right out of the box.  Literally unpacked it (battery was mostly charged) and ran out the door with no manual to do an outdoor photo shoot.  Not bad for user-friendliness, however...Maybe too much function and options were sacrificed to bring the simplicity that makes it user-friendly...Only two complaints:1) Sorry, I like a viewfinder for bright sunny days when screens are difficult to see.  I don't care what direction technology trends have taken- if they don't work, they need to try something that does.  Even a disposable camera from 20 years ago has a viewfinder!  I gave it a chance, knowing it didn't have one, thinking technology had improved over earlier model, but no - I almost sent it back for this one issue.  Come on - It's a CAMERA - It's primary function is to TAKE PICTURES of what you can SEE.  If you can't see your picture, what's the point?  There aren't any excuses to not feature one.2) Navigation buttons are too small and hard to use.  I don't even have fat fingers, and this is another area I feel has let me down, as my earlier model was just fine in this area. (It was a PowerShot SD890IS)But, the zoom is Great!  I would like to see some fun features/options on my future camera like B&W;, Sepia, or something (at least to make it as good as my OLD Sony)  - It's just lacking a lot of options that make a digital camera desirable over something else that lasts for 20 years.----Bottom line, if you are taking pictures only indoors, this is it.  If you are taking pictures anywhere else, like on a bright sunny day, go for something that is at least as good as a much older model.  Sorry Canon, I liked you, but now you've lost me because no \"fun settings\" like other point-and-shoot models on the market, no viewfinder like even a disposable camera has (I'm pro-choice in this area), and no adjustable proportions or photo resolution like a camera from 10-years ago.", "Date": "June 16, 2013"}, {"Title": "Slight delay", "Author": "P. Sponsler", "ReviewID": "R2OT7RR89K0T11", "Overall": "4.0", "Content": "Dont like the delay when taking a picture. Very happy with the quality of the pics. Nice size and convenient to carry.", "Date": "December 25, 2012"}, {"Title": "Not that great", "Author": "Nicole \"Mommy of Twins\"", "ReviewID": "R2KWK35WZW58P2", "Overall": "2.0", "Content": "My old Canon camera, a Power Shot SD1100, died after about 5 years so I needed a new camera. I loved my old camera and since it is no longer made, had to look for something else. I obviously wanted something similar, so I came across this one and read the reviews and they seemed pretty good, I assumed it would be comparable to my old camera. Not so. Now I'm not a professional, but I do take a lot of pictures and expect them to be good quality. When I got this camera, I only used it for a few days because it was much cheaper quality than my old camera. It did not seem to have as many options. When I took photos in various situations, the lighting was bad and the flash would either come on when it shouldn't or not come on when it should resulting in very dark or overly bright photos. Also, a vast majority of the photos were blurry, a problem I never had with my old camera. When I loaded the pics onto my computer and saw just how low quality they were I was very disappointed. The colors were not crisp, they were dull and overall it just was cheap. I ended up returning this camera because it wasn't worth the $130 or so that I paid.", "Date": "December 20, 2012"}, {"Title": "Canon PowerShot Digital Camera A4000IS", "Author": "casey", "ReviewID": "R18RHN0E82EZ78", "Overall": "5.0", "Content": "The Canon brand of cameras has been reliable since I first purchased cameras many years ago.  The latest one I have now own is the PowerShot A4000IS.  It meets my needs for a lightweight camera that is used in differing conditions indoors and outdoors.", "Date": "November 25, 2012"}, {"Title": "Canon PowerShot A4000IS", "Author": "Mary", "ReviewID": "RS01T6S5FRXOX", "Overall": "5.0", "Content": "Great little, pocket sized camera.  Amazing macro pics achieved with this little beauty!  This is my second PowerShot camera. My first PowerShot was such a dependable image maker.  I just managed to get sand or something on the inside lens and it was road weary.Highly recommend.", "Date": "September 1, 2012"}, {"Title": "Terrible \"Out of the box\" Experience", "Author": "Jeff", "ReviewID": "R3IKPQZU2WPW7A", "Overall": "1.0", "Content": "I have owned Nikons and Panasonic Lumix cameras that have been so simple to use.  This camera has been nothing but frustration.  The biggest issue is that the camera often does not take the picture even though it appears that it did.  Secondly the flash often refuses to go off also resulting in no picture being taken.  I have missed so many pictures.  This camera is also very slow but that is not all that surprising given the price.  Making changes to settings is anything but user intuitive as other reviews have stated.  Our Nikon Coolpix and Panasonic Lumix did not require going to the manual for every little change that one wants or needs to make.  I cannot comment on image quality because we have not been able to take enough pictures to assess it.  Unfortunately we are now just a few days out of the return window so cannot return it otherwise I would.  This is our fist experience with Canon and it has been very bad.  I do not recommend this camera for anyone.", "Date": "July 20, 2013"}, {"Title": "Very disappointing", "Author": "HarryW", "ReviewID": "RZT339OXJHE6S", "Overall": "1.0", "Content": "During the first 2 weeks that I used the camera, the pictures turned out to be flat, dull, with washed-out colors. Then in the next 2 weeks, bright lights, a bright sky, a bright surface of for instance a table top caused a glare over much of the picture, like I had taken it in a fog. I contacted the supplier, sent them 2 pictures, 1 taken with this camera, the other 1 with a Samsung smartphone, of the same subject, where you could clearly see how bad the picture was. They agreed for me to return it, I have received the refund already.", "Date": "May 9, 2013"}, {"Title": "Not so hot", "Author": "upnorthgirl", "ReviewID": "R1BSDNT9CL957", "Overall": "2.0", "Content": "Not my favorite canon, but you get what you pay for. I have always been a loyal canon customer, but this model may change my mind.It takes decent pictures, but nothing extraordinary. After about a month the speaker began to malfunction. Whenever I made videos the playback had a weird growling noise in the background. I changed out sd cards thinking that was the problem. No change. I purchased it on December 20th 2012 and was out of luck when it came to returns with amazon on February 9th, 2013. My extended warrranty that I purchased from Square trade was of no value either! I ended up having to send it back to cannon at my expense and now I have a refurbished product to show for it. I would have expected a new camera for that! I would think that a camera that malfunctions within 60 days would warrant a new camera as a replacement, but apparently not. Not recommended!Think twice!", "Date": "February 26, 2013"}, {"Title": "canon power shot a4000is", "Author": "maria dibella", "ReviewID": "R10Z3I1TUBXY7X", "Overall": "5.0", "Content": "the camera takes great pictures and easy to use and also the price is great for what you get with it. I used it for my grandchilds christning .The feature on this camera compared to other brands was great for the price.", "Date": "January 26, 2013"}, {"Title": "Great Quality and Clear Images", "Author": "Jocelyn Ueng", "ReviewID": "R2ZZ14T7TAB1VI", "Overall": "5.0", "Content": "This is an ideal digital camera for people of all ages. It is simple to use and gives the highest quality and clearest images.", "Date": "January 4, 2013"}, {"Title": "Canon Digital Camera", "Author": "Daniel Medrano", "ReviewID": "R254VH72GJLNC0", "Overall": "5.0", "Content": "This camera is very good has excellent resolution and the videos are very good also recommended for people who want to buy this product.", "Date": "January 4, 2013"}, {"Title": "Swear by Canon every time", "Author": "Lou", "ReviewID": "R2D3Y7HAW0FIEJ", "Overall": "5.0", "Content": "After years of sticking with Canon Powershot cameras I mistakenly tried another brand that was on sale, lasted 5 months so I came right back and tried this A4000IS, realy great camera, great value, easy to use, really great zoom for a small camera, defaintely a good buy", "Date": "January 3, 2013"}, {"Title": "Canon digital camera", "Author": "Mónica", "ReviewID": "R1L3U00M283YNI", "Overall": "5.0", "Content": "This camera is easy to use and takes beautiful photos. I used it on my recent trip to the Grand Cayman and took about 400 photos. The memory card wasn't even close to being full... I had no problems with it at all.", "Date": "December 15, 2012"}, {"Title": "Great Canon camera for the price.", "Author": "Amazon User", "ReviewID": "R1SLIA44JI9NBO", "Overall": "5.0", "Content": "Just bought one to upgrade my 4 year old PowerShot. Great camera, had to get one after using my friends recently. I really feel that you can't beat it for the price. I will only buy Canon cameras. May buy another for a Christmas present.", "Date": "December 1, 2012"}, {"Title": "it is better than some", "Author": "Richard Mcclure", "ReviewID": "R15WWYCD3LMND7", "Overall": "4.0", "Content": "Camera surface is too slick, risk of dropping it is way highLarger than average screen is why I chose it, but do not like the on-screen featuresWould prefer an optical viewfinder1o Megapixels is enough for almost every person", "Date": "November 29, 2012"}, {"Title": "Eh, it's OK", "Author": "Melissa Auvil", "ReviewID": "R3FO4FEP7KJ4UC", "Overall": "3.0", "Content": "Much slower than I would have liked.  And I have trouble adjusting the \"theme\" for taking photos (ex- portrait to beach).  But otherwise photos are clear and camera holds up well.", "Date": "May 7, 2014"}, {"Title": "Camara", "Author": "Elizabeth", "ReviewID": "RCTJPMV5O0TWQ", "Overall": "5.0", "Content": "At the begining i couldn't find all the options that it has, but with the use i found all that i needed in a very simple way, I always carry it with me and the quality of the photos is very good, not a pro but very good for amateur ;-)", "Date": "April 24, 2014"}, {"Title": "Canon Power Shot", "Author": "Deborah A Graves", "ReviewID": "RMKQ9WYHELTZW", "Overall": "5.0", "Content": "I chose this camera because I had a previous power shot camera that I loved.  It was easy to learn and use.  I snap pictures whenever I go someplace new and certainly when I get together with friends and this camera is convenient to carry and store in a purse or tote bag or pocket.  You can't go wrong with this one.", "Date": "April 19, 2014"}, {"Title": "Canon Powershot - Best Camera EVER!", "Author": "Kathleen Sixx", "ReviewID": "RTILRXM4PJRKF", "Overall": "5.0", "Content": "Love this camera  - wonderful pictures with a simple point and shoot - excellent features for different lighting and the zoom is super.", "Date": "April 8, 2014"}, {"Title": "BEAUTIFUL USED CAMERA", "Author": "William C.", "ReviewID": "R2VVEU0V25YEWX", "Overall": "5.0", "Content": "The camera camein good condition and works perfectly.  Now if I could find the flash that I bought for my other Canon Power Shot I would be hjappy.", "Date": "April 5, 2014"}, {"Title": "Love this camera!", "Author": "MaryJ_RN", "ReviewID": "R29M96GRWSH03S", "Overall": "5.0", "Content": "I love this camera. Easy to use, great photos, and a nice photo edit software.I can't wait to take more pics with it!", "Date": "March 27, 2014"}, {"Title": "Don't buy this model from Canon. it is bad.", "Author": "S. Escobar \"saco\"", "ReviewID": "R26592VQDIXABD", "Overall": "1.0", "Content": "I have had to ask Canon to replace this model (A4000) IS  two times in less than a year. The first camera stopped turn on after 4 months; it was replaced by canon, and the second want was good for another few months , then it started to show a \"lens error\" and didn't start it. There is something wrong with this model, but the Canon's representatives don't know it or don't want to accept it. So good luck if you decide to but it.", "Date": "March 17, 2014"}, {"Title": "Don't buy!! Not worth the money.", "Author": "amber", "ReviewID": "R2U1JKOYF8DT8G", "Overall": "1.0", "Content": "I purchased my FIRST one of these cameras in fall(November or October) of 2012 to replace a Nikon I had.  MISTAKE!!!  In September of 2013, I had to contact customer service due to a lens cover error message I was receiving.  The customer service was GREAT!  It was only about 10 days from my first email to getting a replacement camera from canon.  However, the replacement was a refurbished one, and it has been six months, and I am now receiving the same error message AGAIN!!  The warranty lasts longer than the camera, but they don't extend the warranty with the \"replacement\" they send.  I have owned 5 cameras in my life, 4 of them Canon and one Nikon.  Of the Canon, only ONE has had no problems, every other one has had to go back for warranty work.  I am VERY disappointed with this camera and will start shopping other brands now. Sad.", "Date": "March 13, 2014"}, {"Title": "Super camera", "Author": "cat614", "ReviewID": "R3BOFTTGNOP67V", "Overall": "5.0", "Content": "Love this camera.  I gave it to myself and I use it all the time.  Easy to use and takes great photos.", "Date": "March 6, 2014"}, {"Title": "Disappointed", "Author": "Simple Gardener \"Carol'\"", "ReviewID": "R1FNWEAM0CPHZC", "Overall": "3.0", "Content": "Comparing this to my Pentax Optio which died, this is not as easy to use. The quality of the pictures isn't any better. I chose it because it was supposed to be easy. I don;t find it so. Full  Manual is not paper--but a PDF, which is a real pain to try to find out how to do something. Also got this because it was supposed to have great low light sensitivity---well either it doesn't or I haven't figured it out yet. The on - camera help button --- hasn't helped when I've needed it. Picture quality so so. Thought the color a bit washed out on some of the pictures.Also find it very hard to unlatch the 'door' to access battery and SD card.", "Date": "March 4, 2014"}, {"Title": "I'm glad I purchased this item.", "Author": "John Martin", "ReviewID": "R1WB2FV9S45IY7", "Overall": "5.0", "Content": "nice product, price was good. Easy to use. fits right in your pocket and easy to carry anywhere. You can always be ready to take photos with this one.", "Date": "February 26, 2014"}, {"Title": "camera", "Author": "JO-ANN D.", "ReviewID": "R5Y1Z71ZE72JL", "Overall": "5.0", "Content": "very light weight camera, very easy to use and it takes very awesome pictures. Hooks up well with my computer.", "Date": "February 23, 2014"}, {"Title": "Great little Camera", "Author": "Terry Owen", "ReviewID": "R1NYD1K1GLLLCX", "Overall": "5.0", "Content": "Other than the shutter speed is to slow sometimes it takes great pictures.Takes pictures from the back of the bike and easy to use.", "Date": "February 19, 2014"}, {"Title": "Love, but a bit of a learning curve.", "Author": "La Na", "ReviewID": "R1JM48CU8UT481", "Overall": "5.0", "Content": "My last 3 cameras have all been a point and shoot Canon, similar to this style. (my favorite is two back. It still takes the best photos, but the side fell off.) Anyway, this one is simpler, I think, but I need to learn the new system.For instance, to customize settings for a photo quickly, you hit the function button, have 3 sliders to adjust light-dark, vivid-dull, warm-cool.  I think that's going to be quicker, once I get used to it.", "Date": "February 18, 2014"}, {"Title": "great camera", "Author": "steven drewek", "ReviewID": "R39TCN400PRSH4", "Overall": "5.0", "Content": "My wife really like the way the camera works and she does not need to go thru a lot for great pictures", "Date": "February 18, 2014"}, {"Title": "Great Camera", "Author": "Jo-Anne M. Potter", "ReviewID": "RA233UTLMAX97", "Overall": "5.0", "Content": "Very nice camera, takes great pictures.  I Love my Canon D50 but if I don't want to tote or carry my big camera, this one takes pictures just as good and is so compact.", "Date": "February 16, 2014"}, {"Title": "It's easy to use and the price was right", "Author": "Janice Koons", "ReviewID": "RJ9GER48TXYHC", "Overall": "4.0", "Content": "It's easy to use, small will fit in small purse/bag, takes great pictures with great color. I replaced one like it that I broke.", "Date": "February 16, 2014"}, {"Title": "Good.", "Author": "Albert Herring \"opera singer/fan\"", "ReviewID": "R27ON96L5EUIFD", "Overall": "5.0", "Content": "Camera features are easy to understand making the camera easy to operate and the picture quality very good. Have not yet used the video feature.", "Date": "February 13, 2014"}, {"Title": "good for a pocket camera.", "Author": "Katie Black", "ReviewID": "R1F38OC4TY9D5A", "Overall": "4.0", "Content": "Nice and small. But you can't zoom and focus while taking a video and sometimes there is a long delay when you are snapping photos and you must wait between each photo while the camera processes or something. Good camera for the price.", "Date": "February 7, 2014"}, {"Title": "Perfect for my main use; useless as a plain-old camera", "Author": "Elenor", "ReviewID": "R65YWXH5H6R1C", "Overall": "5.0", "Content": "I needed a good camera to take still pictures for my business (of products and manufacturing steps).  Because none of these pix requires quick response, this SLOOOOOW camera is great.  Excellent sharp pixs.  Focuses very well.  The telephoto operation is a bit finicky -- the ring to push is very very small -- but it works well. The flash is excellent; doesn't overpower and wash out the object.However, it IS very SLOOOOOOW  writing the picture to the chip.  I would not try to use ti on friends (well I DID try to use it on friends, and many pixs were too late to catch the intended picture, or fuzzy).Fantastic camera for my specific purpose; not at all good for 'normal' use. I'm very very happy with it for my business!", "Date": "February 5, 2014"}, {"Title": "Good", "Author": "celine Omolo", "ReviewID": "R3U5PMT4UQJ1WM", "Overall": "5.0", "Content": "Just a perfect brand of cannon in the market. Prompt deliver. I was mostly satisfied. I think you are doing a perfect job.", "Date": "February 4, 2014"}, {"Title": "decent pocket camera", "Author": "M. Bones", "ReviewID": "RB0AA8ME1UNL1", "Overall": "4.0", "Content": "It's pretty good for a $100 point and shoot with optical stabilization and 8x zoom, but pictures in anything but ideal lighting tend to be noisy.", "Date": "January 31, 2014"}, {"Title": "I've loved every Canon I've ever owned, and this is no exception", "Author": "Ken", "ReviewID": "R1KC72PBO7S592", "Overall": "5.0", "Content": "I've had this camera for a while now, and it does a great job.  Although I miss the smaller size of my Elph, this one isn't too terribly bulky, it still fits in my pocket.  I've taken it on road trips, days at Disney World, all kinds of places and I end up with great pictures.  It also does really well in low light situations.", "Date": "January 27, 2014"}, {"Title": "Good camera for the price", "Author": "Gina Crawford", "ReviewID": "R328014B4KNIXQ", "Overall": "4.0", "Content": "Our warehouse uses these camera's to take pictures of our product before shipping. They take a lot of abuse but so far we have been happy with them.", "Date": "January 27, 2014"}, {"Title": "Great pictures!", "Author": "Shawnl", "ReviewID": "R1L6066TWF6039", "Overall": "5.0", "Content": "Great pictures, great size, fits in my purse or pocket easily! Easy to use doesn't take a genius to use it! Long battery life too!", "Date": "January 20, 2014"}, {"Title": "Compact easy to use", "Author": "Francis Robert Spaulding", "ReviewID": "R1AWC8MLZ615KY", "Overall": "5.0", "Content": "Quality pictures, connects to computer for easy download and viewing, I use Photoshop to edit the pictures for lighting and contrast. very happy", "Date": "January 15, 2014"}, {"Title": "great photos, but easily killed by sand or water", "Author": "a reader", "ReviewID": "RL4ZMYOJVOGWJ", "Overall": "4.0", "Content": "The camera takes sharp pictures for a camera that fits in your pocket.It's easy to use and the battery lasts a long time.I've had about 4-6 of these cameras. From the very beginning, they were easily killed by the slightest amount of water or sand.But now I've gone through 4 of them in about two years. The two most recent 'deaths' of these cameras came with only slight contact with dusty soil. One of them was dropped in the dust. But the other was 'killed' by just minor contact with very little sand.", "Date": "January 9, 2014"}, {"Title": "Great point and shoot", "Author": "Dr. Jon Brown", "ReviewID": "R31TMPIP3LJH2", "Overall": "5.0", "Content": "This camera is nice and small yet at 16 megapixels provides a nice powerful platform for any shooting experience! Very small to take everywhere with you to grab that once-in-a-lifetime picture! Very simple to operate very quickly and provides a great shot every time! PHD Jon Brown", "Date": "January 8, 2014"}, {"Title": "Great little camera for the price!", "Author": "His princess", "ReviewID": "RSTGNSQ9RHV3H", "Overall": "5.0", "Content": "I love this little camera and it was at a great price when I got it. My favorite function is the vivid setting, where colors in sunsets and nature pop out with the click of a button. Easy to use, compact, and cute bubble-gum color. Highly recommend!", "Date": "January 7, 2014"}, {"Title": "My wife loves it.", "Author": "James Metz", "ReviewID": "RB1GDN1M29EYN", "Overall": "5.0", "Content": "Easy to use, large display makes for excellent photo composition, light, and movie plays.  Great price and CanonPowerShots have been our choice for years.  Control buttons are a bit small for me, but my wife loves them.", "Date": "January 7, 2014"}, {"Title": "Great little camera!", "Author": "Kashmere", "ReviewID": "R2O78RC4LHXFY9", "Overall": "5.0", "Content": "I had this exact camera before. It's a great bargain for the price and takes really excellent pictures. I love the widescreen setting as it let's you get more image in the picture. It really does best on bright, sunny days but I've taken some great night shots, action shots, and closeups.  All in all, a great point and shoot for a great price!", "Date": "January 7, 2014"}, {"Title": "Great!", "Author": "Ashley S.", "ReviewID": "RTZ5AZMG03HKT", "Overall": "5.0", "Content": "These is a great basic camera. It is perfect for anyone looking for a decent, easy to operate digital camera.", "Date": "January 6, 2014"}, {"Title": "Great camera", "Author": "A&A'sMommy", "ReviewID": "R2F4MGM32PRDDA", "Overall": "5.0", "Content": "This is a really nice camera for the price. I lost my previous camera and needed a fast replacement without spending too much. This camera is perfect. Does so much more than I expected.", "Date": "January 4, 2014"}, {"Title": "Battery stopped charging", "Author": "Jessica Frazee", "ReviewID": "RSRY7KQ9EBN7I", "Overall": "3.0", "Content": "This is a great camera that takes great pictures.  Unfortunately the battery has a malfunction & no longer charges.  When placed in the camera it gives an error.  It shouldn't do this after normal use, so I'm really disappointed since I can't find a replacement battery locally.  Sure wish I could find a battery replacement.", "Date": "January 1, 2014"}, {"Title": "good camera, good price", "Author": "LC", "ReviewID": "RBRRQSTWSO5JC", "Overall": "5.0", "Content": "a good camera for taking everyday pictures, good quality, reliable product.  But handle with care.  We accidentally clunked it while the lens is out (dropped it from a small desktop tripod to the table) and that was the end of the last camera.  We loved it so much we got another one.  THis time, we'll be very careful..", "Date": "December 31, 2013"}, {"Title": "Practical", "Author": "A. Smith \"NW\"", "ReviewID": "R14IKI1I4SJ2L8", "Overall": "5.0", "Content": "Good Pictures - simple; gift to my 84 year old mother to take pictures of her paintings. Perfect pictures forever.", "Date": "December 31, 2013"}, {"Title": "Wonderful camera", "Author": "Racer X \"Brian\"", "ReviewID": "RFZITABRT6KWX", "Overall": "5.0", "Content": "I purchased this camera on the recommendations of my teammates. It is one that photographs artwork very well and already I see the difference from the Panasonic camera.", "Date": "December 29, 2013"}, {"Title": "Mini-camera", "Author": "James G. Murphy", "ReviewID": "R3DZCZ6EP8VZLL", "Overall": "5.0", "Content": "Needed a small, pocket sized camera for travel.  This Cannon PowerShot takes very sharp pictures with good motion dampening.  Also very good in low light.  An excellent value.", "Date": "December 22, 2013"}, {"Title": "very good . I like it very much .  a nice one.  i will buy one more next time , good", "Author": "Dongmei Xu", "ReviewID": "R2IE7BF8VCN571", "Overall": "5.0", "Content": "very good . I like it very much .  a nice one.  i will buy one more next time , good", "Date": "December 13, 2013"}, {"Title": "nice camera", "Author": "Julia", "ReviewID": "R2KIPPPCEBZD8L", "Overall": "5.0", "Content": "Nice camera! Sharp pictures, easy to carry around, does not take up much space. My kids would take pictures with ease. I could buy another one any time.", "Date": "December 8, 2013"}, {"Title": "good little workhorse", "Author": "Amazon Customer \"Mr Persnickety\"", "ReviewID": "R2OSRTXMN9K3YQ", "Overall": "4.0", "Content": "a good little workhorse of a camera. not great at any one thing, but it is good at most things and very easy to carry with you. With the quality of smart phone cameras getting very nearly this good, it is almost obsolete, but offers more functions and a slight edge on picture quality.", "Date": "December 6, 2013"}, {"Title": "nice optical zoom", "Author": "Mike D", "ReviewID": "R3J5ZCM2EU3OE6", "Overall": "4.0", "Content": "camera isn't perfect, but I just needed something to take decent quality pix during my recent Caribbean vacation.  As you'd expect night/dark pictures leave little to be desired but everything else came out just great.  Really you buy this camera for taking pix on the go and archiving memories, with the auto setting it pretty much does all the hard work for you and the pix come out pretty good in my opinion", "Date": "December 5, 2013"}, {"Title": "Not worth the money", "Author": "Calimamjam \"Hip Auntie\"", "ReviewID": "R2V31QU89YHI8S", "Overall": "2.0", "Content": "I'm so sad because this item has not held up well.  The shutters stick and it doesn't focus well any longer.  I've had it for less that a full year and was told not to bother getting it fixed.  It makes more sense to get a new one. I'm looking into Cannon's recycling program for this.", "Date": "December 3, 2013"}, {"Title": "Quality and price are good", "Author": "tharangage", "ReviewID": "R16PY8KVYZND8D", "Overall": "4.0", "Content": "The Canon A4000IS camera is very worth for the price and quality is good. It is fit for normal usage.", "Date": "December 2, 2013"}, {"Title": "Canon PowerShot A4000IS - easy as it gets.", "Author": "Salsa Kid", "ReviewID": "R3M9MEFKE1V2FP", "Overall": "5.0", "Content": "Outstanding camera for its price range. It does everything you want and it doesn't take an expert to do it. I am very happy with it.", "Date": "November 30, 2013"}, {"Title": "Fast and easy!", "Author": "chels_21", "ReviewID": "R3KN21BV87K7OQ", "Overall": "5.0", "Content": "I have owned Canon cameras before and they seem to be the best bang for my buck! Two months ago I replaced my Kodak with a Nikon, and I can say I will never, ever be buying a Nikon again. This camera is everything the Nikon wasn't, and an upgrade from my Kodak. It's easy to use, very fast, and I think the thing I'm most excited about is how clear pictures without the flash on turn out. A camera that takes non-blurry photos with the flash off is a feature I had yet to have found in a camera, and this one did the trick. I'm excited to use it more :)!", "Date": "November 29, 2013"}, {"Title": "Very good camera", "Author": "Rev", "ReviewID": "R1LZELIKPBFW7H", "Overall": "5.0", "Content": "I bought to mainly take pictures of family and events. I had it for a year now and works very well. The pictures have great pixelation although sometimes it a takes 2 or 3 secs to focus while I am zooming. The battery lasts around 1.5 to 2 hrs with constant use. The video is also very good. It has plenty of features including the \"all silent\" in one option, very handy.", "Date": "November 28, 2013"}, {"Title": "Good Buy", "Author": "Juliet Ophelia", "ReviewID": "R1HAT6E4NN7A6Y", "Overall": "5.0", "Content": "Great camera. Good picture resolution. I got it on Cyber Monday, so it was a GREAT deal. Overall I am really happy with it. And it's easy to use.", "Date": "November 21, 2013"}, {"Title": "LOVE THIS ITEM!", "Author": "PandaKhaos", "ReviewID": "R2JWVPUZOVQOSH", "Overall": "5.0", "Content": "I absolutely LOVE this camera! And I got it for a fantastic deal. DEFINITELY worth more than I gave for it.", "Date": "November 19, 2013"}, {"Title": "super", "Author": "LAURA AIELLO", "ReviewID": "R5LSVJPGUH0MJ", "Overall": "5.0", "Content": "camera is very good for the moneytakes awesome picturessuper super cameravery satisfied with way camera operatesthank you", "Date": "November 11, 2013"}, {"Title": "great camera", "Author": "sally duncan", "ReviewID": "RNM2V6YURM739", "Overall": "5.0", "Content": "This camera is so easy to use.  The photos have been more than I had expected them to be.  I would recommend this camera to any beginner are even more accomplished photographer.", "Date": "November 10, 2013"}, {"Title": "Slow shutter", "Author": "Andree Garner", "ReviewID": "R3A9O6KIKZRYEK", "Overall": "4.0", "Content": "The pictures are fine, but the shutter is very slow. Sometimes I end up taking pictures of my feet or the ground because of the slowness.", "Date": "November 7, 2013"}, {"Title": "Inexpensive and functional", "Author": "MaryT \"kittykitty\"", "ReviewID": "R1J32J6Z2JXWV", "Overall": "4.0", "Content": "Nice camera, but slow to respond to shutter pressure.  It takes a couple of seconds for the camera to allow you to take another picture, which is rather annoying!  Photos are good quality, but setting the various modes is difficult.  The manual is also on a disk, so you have to be at a computer to check out the various functions.  This is silly, and how expensive can a little manual be to include in the package?  I have had easier cameras to explore and use...but this is a very nice photo when you figure it out! Auto focus has several options, and seems accurate.", "Date": "November 5, 2013"}, {"Title": "Love,Love this camera", "Author": "Mary Lundrigan", "ReviewID": "R2G1FJCN946I3H", "Overall": "5.0", "Content": "Takes great pictures ,and sooooo easy to use great price, fun to use ....and i think you will be so happy if you get this little powershot....I had a great time useing it...", "Date": "November 1, 2013"}, {"Title": "Very good product", "Author": "Amazon Customer", "ReviewID": "R1IXH4N73XWXEC", "Overall": "5.0", "Content": "Nice product! Easy to use. My daughter is having fun learning how to use all of its functions. Timely shipment. Very satisfied.", "Date": "October 24, 2013"}, {"Title": "great pics", "Author": "Corinna Burkhardt", "ReviewID": "R3N2TTA3HPOMNA", "Overall": "4.0", "Content": "It takes better pics than the camera  that I had lost. Is easy to handle and use. Even better price.", "Date": "October 23, 2013"}, {"Title": "Works great, not super stellar", "Author": "crhg", "ReviewID": "R11GA7HBEQNCUS", "Overall": "4.0", "Content": "Shutter speed not super fast, but gets the job done. Picture quality seems to be pretty good though sometimes doesn't fully autofocus.  I'm a point and shoot sort of basic mom photographer, so real skills, so this serves me well enough to capture activities and still shots well enough at a low price.", "Date": "October 22, 2013"}, {"Title": "PowerShot A400IS", "Author": "Lucinda Wheaten", "ReviewID": "R10Z53HDQKLTYR", "Overall": "5.0", "Content": "I bought the camera for my Mom and she loved the camera. I showed her how to use it and she caught on very quickly.", "Date": "October 21, 2013"}, {"Title": "it's nice", "Author": "ning zhao", "ReviewID": "R38J09FRFHYZXU", "Overall": "4.0", "Content": "it's nice and I feel comfortable when using it.But pictures not that clear as I expect. Maybe it's also because of the light .", "Date": "October 13, 2013"}, {"Title": "Great camera for price", "Author": "yoda", "ReviewID": "R2JITZKGSLQY28", "Overall": "5.0", "Content": "This is great camera for price. It is small and has nice optical zoom. We have been using it now for several months and have not found any issue.", "Date": "October 13, 2013"}, {"Title": "Might be defective - not sure yet", "Author": "Jodi Walkonen", "ReviewID": "R9Z01FCQ6HMS9", "Overall": "4.0", "Content": "I chose this camera specifically because I was going hiking and didn't want to carry my pro camera up a mountain. This is lightweight and easy to use, and some of the photos are perfect - however, there is a line in half my photos that I cannot explain. there is nothing on the lens that I can see, and some of the photos are clear, so I have to assume it's a problem within. If I cannot figure out the problem soon, I will be returning the camera. Hopefully this is just a glitch with this particular one, because I DO like this camera. As long as this is just a one time deal, I would recommend this - nice clear quality.", "Date": "October 12, 2013"}, {"Title": "Solid Camera", "Author": "Nathan", "ReviewID": "R3BA7T97896XA8", "Overall": "4.0", "Content": "Good camera, not great. Takes good pictures it's worth the money, nothing better nothing worse. It's recovery time is a bit slow but I used a class 10 memory card which seems to help.", "Date": "October 10, 2013"}, {"Title": "review", "Author": "Kelly Belo", "ReviewID": "R1Y5SRMQRD04K6", "Overall": "4.0", "Content": "This is my 3rd Canon camera and  I swear by them.. first camera fell to ground several times screen still in great shape  and still works but you have to tape battery compartment closed  I purchased this one cuz I wanted a smaller camera I've used it twice and am real happy with it..", "Date": "October 8, 2013"}, {"Title": "Very good cam for its price.", "Author": "Isabel Plaza", "ReviewID": "RBPRZHJTDSCUS", "Overall": "4.0", "Content": "I love it, is a very good cam for its price. A bad thing, it doesn't have panoramic. I recommend to take a big SD card, 'cause pictures are around 4 mb each.", "Date": "October 2, 2013"}, {"Title": "Lots of features for the price.", "Author": "mowsmom", "ReviewID": "R8RZLGN8TC3PM", "Overall": "4.0", "Content": "So far, so good.  Lots of features for the price.  Compares closely with the Olympus.  Nice zoom, able to shut off sound.  A viewfinder would be nice, but most of these types of models do not have one.", "Date": "October 2, 2013"}, {"Title": "Great Compact Camera", "Author": "mario J.", "ReviewID": "R35UCWX273G7D9", "Overall": "4.0", "Content": "I bought two of these in different colors as gifts, and they are a hit. I'd definitely buy it for myself if I didn't already have a compact camera I'm happy with.", "Date": "September 24, 2013"}, {"Title": "Great Camera", "Author": "Chirag Purohit", "ReviewID": "R1KUOU6RQDOT2U", "Overall": "5.0", "Content": "I am a great fan of Samsung cameras when it comes to point and shoot, but was surprised when i opened this one and used it. wife actually brought this as a gift for in-laws and was mad when it came to handing it. they love it and have become a professional photographers now (would use them sometime). overall a great product for point and shoot camera for novice users and easy to carry around in pocket than in a bulky case", "Date": "September 18, 2013"}, {"Title": "Great purchase for my teen daughters", "Author": "Since you've been gone", "ReviewID": "R226IORP0OCMJQ", "Overall": "5.0", "Content": "I bought two of these hoping i wouldn't be sorry.  they were gifts for my two young teen daughters. I love these little cameras.  Definately worth the money.  this camera takes clear and crisp still pictures.  Action pictures not so much, but they take pictures of them and their friends and they are great pictures.", "Date": "September 15, 2013"}, {"Title": "Canon PowerShot A4000IS 16.0 MP Digital Camera with 8x Optical Image", "Author": "Jeremiah Kenney", "ReviewID": "R3HQVRRARESZ0L", "Overall": "3.0", "Content": "the stylus to operate the touch screen was missing from the package.  great camera.  considering searching for an underwater housing to fit.  one housing online amazon fit dozens of cameras; therefore I doubt it will work well with all to operate each external control adequately.", "Date": "September 15, 2013"}, {"Title": "I Love My New Canon PowerShot A4000IS", "Author": "Janell Appleby", "ReviewID": "RCJAA7WE9MNTW", "Overall": "5.0", "Content": "So far I've been able to take some great photos - sunny weather, rainy weather, and indoors. And most importantly for me, it's easy to use!", "Date": "September 14, 2013"}, {"Title": "Pretty good", "Author": "Leif I. Solberg", "ReviewID": "R1F61WAO8I475Y", "Overall": "4.0", "Content": "We bought this for our 9 year old grandson prior to a trip and he loved it and found it easy to use, so easy that he discovered for himself that the battery was running out after only about 100 pictures (during the trip) and he had not brought the charger along. Otherwise it seems very good.", "Date": "September 13, 2013"}, {"Title": "Canon PowerShot A4000IS Digital Camera", "Author": "George Mosby", "ReviewID": "R3KSFQ69CHBZZG", "Overall": "5.0", "Content": "This is a well-designed small camera with many more features than I'll ever use. However, learning to use its basic features is fairly straightforward with the aid of the instruction booklet included with the camera. I recently took it on the road to Colorado for a relative's wedding and took around 60 photos which turned out quite nicely. The photos also proved easy to download to Picasa and upload to the internet for viewing by family members in different areas. Quite pleased with the Canon PowerShot.", "Date": "September 11, 2013"}, {"Title": "Camera", "Author": "Brittany Vomberg \"Brittany V\"", "ReviewID": "R4IXZKMZ2QYOS", "Overall": "5.0", "Content": "Bought this for my father-in-law last Christmas and he loves it! Takes very nice pictures and he hasn't had any problems with it.", "Date": "September 4, 2013"}, {"Title": "Great camera!", "Author": "Lou", "ReviewID": "R3OB88HPTDPCCU", "Overall": "5.0", "Content": "If you are a lunk head when it comes to running digital things then this camera is for you!It was simple to use and took great pictures and the video was great also!", "Date": "September 2, 2013"}, {"Title": "I'm not happy with this product", "Author": "Sudhir KD", "ReviewID": "R3CTIG80C4CCRE", "Overall": "2.0", "Content": "I bought this camera last month looking at several other cameras, but what I think is now I'm cheated by HERE2SAVE because they have mentioned different features of camera than it has. for example, It does't have the cmos sensor and Increased IR sensitivity for astrophotography also it does noise while clicking shot and sometimes after clicking images shows message that there are no images stored, then I need to switch it back again.I will not buy product from HERE2SAVE.Canon PowerShot A4000IS 16.0 MP Digital Camera with 8x Optical Image Stabilized Zoom 28mm Wide-Angle Lens with 720p HD Video Recording and 3.0-Inch LCD (silver)B0075T7NW2", "Date": "September 1, 2013"}, {"Title": "Simple but great camera", "Author": "Thomas", "ReviewID": "R9TNXO34PHUJQ", "Overall": "5.0", "Content": "The picture quality on this camera is a lot better than I expected it to be. The full zoom keeps a really clear picture, too.", "Date": "September 1, 2013"}, {"Title": "Camera", "Author": "Joanne", "ReviewID": "R2D9B7QV8E5BU", "Overall": "5.0", "Content": "What's not to like, small to fit in your purse and take great pictures. Simple to use just aim point and shoot. I love my new Camera, I'm not a very technical person and I don't need a light meter and special equipment to operate this Camera. I Love Love it!!! Recommend to anyone, plus it comes in a lot a cool colors too.", "Date": "August 27, 2013"}, {"Title": "Great Product", "Author": "Amazon Customer", "ReviewID": "R36ML84X4MYFAP", "Overall": "5.0", "Content": "Great Product - good value; works great found it to be as advertised:  Highly recommend this to anyone looking for high value and economical price", "Date": "August 25, 2013"}, {"Title": "Great little camera", "Author": "J. J. van Vuuren", "ReviewID": "RTWEVN02HB95F", "Overall": "5.0", "Content": "My daughter fell on the last camera, breaking it.. We liked it so well we decided to just buy the same model again.", "Date": "August 21, 2013"}, {"Title": "Like it", "Author": "JerryLenz", "ReviewID": "R208RKP6ZL3XZQ", "Overall": "5.0", "Content": "A very nice camera. Perfect for baby's first steps,family gatherings, drive by shootings etc. It is small enough to keep in pocket and be readily available.The included software leaves a lot to be desired. Where do the down loaded pictures go? There is no obvious menu for setting a destination folder. I have not found those pictures so far. Am going to delete the software from the computer.", "Date": "August 18, 2013"}, {"Title": "Great Camera", "Author": "Donald", "ReviewID": "R1D27EZQA64QSQ", "Overall": "5.0", "Content": "I really like the camera size and functions. I would recommend this camera to my friends. Thanks again for this product.", "Date": "August 13, 2013"}, {"Title": "Canon Camera", "Author": "HANH NGUYEN", "ReviewID": "R1TANF04D28R95", "Overall": "4.0", "Content": "Just exactly what I needed in a digital camera.  I trust Canon, a well-known brand.  I'm satisfiled with my purchase.", "Date": "August 11, 2013"}, {"Title": "real good product", "Author": "Chillerz", "ReviewID": "R205QHVVIQ62UV", "Overall": "5.0", "Content": "this is one of the best camera i have seen ....so clean and bright ,no faults at all, also the zoom is out of this world", "Date": "August 9, 2013"}, {"Title": "nice camera", "Author": "Roy L Lloyd Jr", "ReviewID": "RTEX6T1V6365A", "Overall": "5.0", "Content": "I really liked the cd that was included to download image browser ex. It made it much easier to download and edit pictures.", "Date": "August 8, 2013"}, {"Title": "Camera not fonctionnal", "Author": "Louise Pascale TOYO", "ReviewID": "R1H2O1GF8XTIYX", "Overall": "2.0", "Content": "the camera does not work well. After less than 10 shots image, others are unknown or it is occupied rating.", "Date": "August 8, 2013"}, {"Title": "Nothing like a Canon", "Author": "Luzy J. Tribble \"catz1953\"", "ReviewID": "R2BIHEXZ6T4TII", "Overall": "5.0", "Content": "I bought this Canon camera for my daughter for her birthday.  She loved it!  It is handy to keep in your purse so you're always ready for that great shot...and not a bad one off a cell phone!", "Date": "August 5, 2013"}, {"Title": "Good", "Author": "tejal sanover", "ReviewID": "R3DPZT71BEGU5G", "Overall": "4.0", "Content": "Amazing product. I had got this for my mom. It's easy to operate and has a good resolution. Perfect compact camera.", "Date": "August 5, 2013"}, {"Title": "Must have item", "Author": "Jeonghoon Y.", "ReviewID": "RMH55WKCHLXT5", "Overall": "5.0", "Content": "After having this item, I can travel anywhere without worrying. I uaually use digital camera, but my camera is too big. So I should buy extra digital camera. Canon is really good product and reasonable price. I love this item.", "Date": "August 4, 2013"}, {"Title": "It is great!", "Author": "Brigid Dunn", "ReviewID": "R19KPV8522N50T", "Overall": "5.0", "Content": "I love this camera and i use it a lot as a mother of a 5 month old.  I highly recommend this because it is easy to use and has a large screen to see the picture.", "Date": "August 3, 2013"}, {"Title": "Love this Camera", "Author": "John R Melton", "ReviewID": "RGIIFAOU9PL2A", "Overall": "5.0", "Content": "I Give this Camera  5 star Rating because it does every thing its suppose to do and with great ease.will do Business with the company again in the Future.", "Date": "August 1, 2013"}, {"Title": "GOOD", "Author": "DRC", "ReviewID": "R3KWR8119HBYQP", "Overall": "4.0", "Content": "GOOD. WOULD GIVE 5 STARS IF IT WASN'T SO SMALL, DIFFICULT TO HANDLE.GOOD. WOULD GIVE 5 STARS IF IT WASN'T SO SMALL, DIFFICULT TO HANDLE.", "Date": "July 31, 2013"}, {"Title": "love", "Author": "Sadia", "ReviewID": "RGRHDLU5QEVV0", "Overall": "5.0", "Content": "love my camera! takes beautiful pictures.. i am no professional but it gets my job done. really do recommend this camera.", "Date": "July 30, 2013"}, {"Title": "very nice", "Author": "raja", "ReviewID": "RLGEGXXO4IHTZ", "Overall": "4.0", "Content": "Canon PowerShot A4000IS 16.0 MP Digital Camera with 8x Optical Image good more funcation nice working but i am not receive charager i buy another new", "Date": "July 29, 2013"}, {"Title": "Great camera", "Author": "David Kaiser", "ReviewID": "R1DEVLP6IK3J76", "Overall": "5.0", "Content": "While I'm not a digital camera expert, I found that for the price, this camera met our every need on our recent Caribbean cruise vacation.  All of the auto-settings were sufficient for our purposes.  As an added surprise, I found the video feature to be very high quality as well as easy to use as well!", "Date": "July 29, 2013"}, {"Title": "Great Camera", "Author": "Morbius858", "ReviewID": "R3N7GXANEFNDXV", "Overall": "5.0", "Content": "A really strong camera.  It shoots great video, great pictures, it has an incredibly durable feel to it, good solid weight as well.", "Date": "July 28, 2013"}, {"Title": "camera", "Author": "robert w scott", "ReviewID": "R2G1NUYLTDT8HG", "Overall": "5.0", "Content": "not only good looks, but vary crisp pictures and enjoying the vedio feature. the zoom has a wide range and good field", "Date": "July 26, 2013"}, {"Title": "Love the camera", "Author": "John Zanini", "ReviewID": "R25F8WXTGOWXLD", "Overall": "5.0", "Content": "Had to buy a second one as the first one was stolen by a National Rental Car employee..... but loved it so much, I bought a second one.", "Date": "July 26, 2013"}, {"Title": "Good replacement!", "Author": "Jerri Beasley", "ReviewID": "R17HG132TR24HK", "Overall": "5.0", "Content": "This camera is replacing my old point and shoot camera after it's untimely drowning.  So far, so good.  Pictures are clear, functions are sufficient, it's easy to operate and the perfect size for carrying in my purse daily.", "Date": "July 25, 2013"}, {"Title": "Future Photographer", "Author": "Rach", "ReviewID": "R1DPI3350WNE4L", "Overall": "5.0", "Content": "I used this camera in my Photography class, and I loved this model so much that I just had to buy my own. This camera takes great shots. Make sure you buy a case for it though, because the one that comes with the camera is a cheap almost paper almost fabric \"pouch\".", "Date": "July 23, 2013"}, {"Title": "Good little Camara for the Price", "Author": "Michael Ward", "ReviewID": "R306TI30T7LJF4", "Overall": "5.0", "Content": "I can actually take good photos with this Camera, battery life is pretty amazing.  I had other cameras that every time I pulled them from my case to take a picture the battery was flat, just went flat not even being used.  This Canon has a full battery even after months of non use.", "Date": "July 21, 2013"}, {"Title": "Great camera for everyday use", "Author": "Dana W. Baker", "ReviewID": "R2IX5BMMNXQOKR", "Overall": "4.0", "Content": "i have a Canon XSI and wanted a smaller camera with video capabilities for my wife to shhot the grandkids with, this camera is perfect for her and I would recomnend it to anyone.", "Date": "July 16, 2013"}, {"Title": "new one for me", "Author": "Lisa \"SunMoonStar\"", "ReviewID": "R2O7BL05DZV64O", "Overall": "5.0", "Content": "I went from the old 5mp kodak to this.  What a change!  Fun and easy to use with great picture quality.  I am not running through the double AA bateries like I was.  I have only had to charge it once since I got it (that is 1 time in 2 months!).", "Date": "July 13, 2013"}, {"Title": "Canon PowerShot A4000IS 16.0 MP Digital Camera", "Author": "B. A. COOPER \"bev\"", "ReviewID": "R2YL333UKDXFUW", "Overall": "5.0", "Content": "This product works so good i have one take photos well as said love it i recommend it any day!! i wish i could add pics to show", "Date": "July 9, 2013"}, {"Title": "Great little camera!", "Author": "Ms. Lynn C. Schluns", "ReviewID": "R38RAGSL0MJUSY", "Overall": "5.0", "Content": "This is our 3rd Canon PowerShot. I would highly recommend it. I lost my last one so was pleasantly surprised by this updated version. The larger view screen is nice and the ease of transferring images is great. I love the color too!", "Date": "July 6, 2013"}, {"Title": "VERY HAPPY", "Author": "CHRISTINE MORRIS", "ReviewID": "R2JMXX159BFTJI", "Overall": "5.0", "Content": "THE SCREEN IS LARGE. EASY TO HANDLE.  TAKES CLEAR PICTUES. VIDEO IS EASY TO USE.  TELEPHOTO ISWONDERFUL. TOTALY HPPY", "Date": "July 6, 2013"}, {"Title": "Gat Cannon Camers", "Author": "Max L. Hatfield \"Max L. Hatfield\"", "ReviewID": "R2AZR1SVY5ZOBQ", "Overall": "5.0", "Content": "I have a larger more professional type camera, but needed a smaller one for use in in collecting rocks and taking pictures of my desert adventures. I like the camera it works well and I am mostly satisfied with the quality pictures it produces. A good performing Camera even in dusty dirty conditions, so far.", "Date": "July 5, 2013"}, {"Title": "Good product", "Author": "S. Gillingham", "ReviewID": "R2FTZOPNDVW35O", "Overall": "4.0", "Content": "It's a good camera for the price. The video works really well. However, I don't like how most people look in the photos - really heavy. My daughters I-pod takes more flattering pictures.", "Date": "June 30, 2013"}, {"Title": "Great item!", "Author": "S", "ReviewID": "R1E75FY8KIFEHW", "Overall": "5.0", "Content": "This was a gift and he loved it!  Was all he was looking for and then some.  Highly recommended to buy.", "Date": "June 29, 2013"}, {"Title": "Very easy to use", "Author": "StanleyM", "ReviewID": "R31TFSZ3NGY3QT", "Overall": "4.0", "Content": "Camera has a lot of useful features, but one has to read the online manual in order to fully utilize it's features", "Date": "June 27, 2013"}, {"Title": "Great little camera", "Author": "Robert Dubber", "ReviewID": "R2661GP5UYMVLU", "Overall": "5.0", "Content": "Camera is very easy to use with a big viewing window. Very fast picture processing and ready for next picture. It also was a great price and free shipping. It came when promised and was new in box with all the accessories. Would recommend it to a friend.Very easy camera for my wife to use also, just point and click when in AUTO for great pictures and long battery life.", "Date": "June 9, 2013"}, {"Title": "Good Pictures", "Author": "Joan L. Ganotis", "ReviewID": "R3BFP6AJ48FEQK", "Overall": "4.0", "Content": "Overall, I like the camera very much but I don't like the smaller size of cameras in general. I take pictures while riding my horse and I am always afraid of dropping a small camera. I find the instructions for downloading of pictures from camera to computer confusing. I have limited computer skills and perhaps someone more knowledgeable would not have a problem. I did manage to download the pics. The image stabilizing feature is important for me as my \"quadripod\" is not always still while taking pics! So far, no blurry pics. I have used both the zoom and the macro with success. I have only owned the camera for about a month so I am still discovering features.", "Date": "June 6, 2013"}, {"Title": "Got it sooner than expected", "Author": "VJ", "ReviewID": "R3HH2NJT4BFT29", "Overall": "4.0", "Content": "I got it at cheaper price..checked & found to be working fine.. Only issue i found is I have to press the button very hard while taking picture.. i don't know whether its a really new piece..or is it the issue with this model?", "Date": "June 3, 2013"}, {"Title": "Cannon Power shot", "Author": "Henry W. Yerke", "ReviewID": "R2XUG798YPB1BB", "Overall": "4.0", "Content": "I haven't used this camera to much yet. What little I used it seems pretty nice. It' really to soon to tell.", "Date": "June 3, 2013"}, {"Title": "small, lightweight, great zoom", "Author": "kathy", "ReviewID": "R2UBRA77SQYPJ8", "Overall": "5.0", "Content": "this camera was just what I needed for a trip to the ocean. its small, lightweight, battery lasts a long time and the MP is high so I can create large printable images.", "Date": "May 29, 2013"}, {"Title": "Take it everywhere!", "Author": "Dranas", "ReviewID": "R1RDIZVIHNSEN5", "Overall": "5.0", "Content": "I bought it for the size - and was not disappointed!  If fits in even a small purse, so I'm ready anytime for a great pic!  And the pics are great!  Wonderful quality!  The zoom is great!  I love the little \"boxes\" that show I've got the subject lined up.  I such an amateur!  This camera makes my shots look wonderful!", "Date": "May 25, 2013"}, {"Title": "Excellent and brand new", "Author": "Moon Pies", "ReviewID": "R1NKKZ1I2PZJBO", "Overall": "5.0", "Content": "This little camera was an xcellent replacement for one I broke, better quality and better pictures. Simple to use for the beginner.", "Date": "May 24, 2013"}, {"Title": "Good picture for the price", "Author": "Connie", "ReviewID": "RXYKPFVNP1IAJ", "Overall": "4.0", "Content": "The camera takes good pictures and videos. It is probably better to leave it on Auto. I had a a Nikon Coolpix S4300 which cost a little more.(I left it on the roof of my car and found it in the street) So I bought a Canon. The Nikon menu is a lot easier though than the Canon, it has more Scenic choices. Bought the Canon at Best Buy total $106. with tax. No extras a USB and electric battery charger, DVD included. You need to buy a SDHC card. The SanDisk I had with my Nokia fits this camera.Pros-Good pictures and videos. Colors come out just like the scene. Really good zoom. I am still learning how to use it. Light weight, nice blue color.Cons-I just got it but it appears battery has to be removed from camera to be charged. It connects to PC to transfer photos but I don't know if the battery charges like the Nikon does when it attached to the PC. This is a nuisance taking the battery out to recharge. The Nikon battery last longer. The menus are confusing too. When I enlarged a picture and pressed the Set Function to save the picture in the larger form it did not stay larger. I bought an extra battery on Amazon, it was cheap. I hope I will learn how to use this camera better.", "Date": "May 21, 2013"}, {"Title": "Canon PowerShot A4000IS", "Author": "KC", "ReviewID": "R2ICYB8QQ9QA3G", "Overall": "3.0", "Content": "I like the size and the easy use of the camera.  The pictures are clear.  The shutter speed is terrible!", "Date": "May 19, 2013"}, {"Title": "Works pretty well as a pocket camera supplement to my DLSR", "Author": "J. Ligon \"JimL\"", "ReviewID": "R2KOQAXDO0AGN1", "Overall": "4.0", "Content": "I took it to a butterfly show as a supplement to my Canon 5D II which had an extension tube on a 70-200 L lens for close-ups. It worked a charm and I got some good images without having to change the lens on my big camera.One caveat The manual says it will focus at .4 inch. I have been unable to focus closer that 1.5 feet reliably even using a tripod.Read the manual even though it may b difficult because Canon wrote it like the were saving paper instead of the PDF format they delivered and it still makes you jump back and forth across the manual to get a complete explanation of a function instead of having the info in one place.", "Date": "May 15, 2013"}, {"Title": "Easy", "Author": "Midge", "ReviewID": "R3R9YF25ZJK6MO", "Overall": "5.0", "Content": "The camera is very easy to use and takes good quality pictures. I liked the samll size.  It is easy to travel with.  Excellent for the price.", "Date": "May 15, 2013"}, {"Title": "Great camera!", "Author": "Nancy Liz", "ReviewID": "RISYY97HY1Z86", "Overall": "5.0", "Content": "This camera exceeded my expectations.  Excellent quality at a very reasonable price.  I'm certainly not a skilled photographer, but I don't have to be with this camera.  It does the work for me!  So easy to use.  I highly recommend it.  In fact, I liked mine so much that I encouraged my employer to buy one for use at the office.", "Date": "May 14, 2013"}, {"Title": "Camera-Canon powershot", "Author": "lindy lou", "ReviewID": "R1HKKSZ1THXSPM", "Overall": "5.0", "Content": "Love it fits right in purse can take pictures anytime. As I have grandkids. I like the zoom.Also the camera takes great pictures!", "Date": "May 12, 2013"}, {"Title": "Canon Power Shot", "Author": "LOU", "ReviewID": "RS7PHKOAH8U97", "Overall": "5.0", "Content": "It is cute, compact, easy to use and makes great pictures. It is a great deal for the money. So if you have to watch your budget, you might want to try this little Cannon.", "Date": "May 9, 2013"}, {"Title": "GOOD", "Author": "pingguojuan", "ReviewID": "R3J22QZX2P9II", "Overall": "4.0", "Content": "Bought this for my friend a month ago. He is satisfied with it. Not expensive. Easy to use. Good quality.", "Date": "May 7, 2013"}, {"Title": "Great little camera.", "Author": "S. J. Mills \"artist, multi-media\"", "ReviewID": "R2EI27NSKJHYBQ", "Overall": "5.0", "Content": "I had an old power shot, which I also loved, But this one is so much lighter and the viewing screen is so big. Well I guess I just love it more.", "Date": "May 4, 2013"}, {"Title": "Reliable Compact Camera", "Author": "sambrose", "ReviewID": "R3JO1YI2L1R2E0", "Overall": "4.0", "Content": "For the price I think this camera is great quality. The reason i gave it 4 stars instead of 5 is that it takes a little longer than i like for it to focus. Other than that I like the picture quality. Overall I wanted a compact camera with good quality pictures for a reasonable price. This camera was just what I needed.", "Date": "May 2, 2013"}, {"Title": "My new baby!", "Author": "Chaunece M. Saunders", "ReviewID": "R30CU6OJA352XO", "Overall": "5.0", "Content": "Photos are high quality and crystal clear! I love the zoom, love the color, love that its lightweight! Awesome camera!", "Date": "April 24, 2013"}, {"Title": "Great, Compact, Lightweight Camera", "Author": "L. M. Heath-pilotte \"simply-golden\"", "ReviewID": "RI8KKZSYX2O2J", "Overall": "5.0", "Content": "I purchased this camera to stay in my purse for those times I am out and about without my full-size camera. It is great and produces beautiful pictures.", "Date": "April 24, 2013"}, {"Title": "good camera", "Author": "Anna A.P. \"Anna\"", "ReviewID": "R2K7VRWCB5OWDG", "Overall": "4.0", "Content": "read the specs on this, it doesn't have the action setting so no pictures of kids moving or anything like that available. kept it because there wasn't anything wrong with it and it is a good camera.", "Date": "April 23, 2013"}, {"Title": "Very good affordable camera!!!", "Author": "steven w kornfeld", "ReviewID": "R1WWOMAY5DQIMH", "Overall": "5.0", "Content": "I was looking for a decent affordable camera with an ok zoom. I AM pleasantly surprised about THIS selection. I would recommend to anyone looking for a good compact camera", "Date": "April 22, 2013"}, {"Title": "Not bad for price", "Author": "Caligirl03", "ReviewID": "RF9LK7R3EWT1H", "Overall": "4.0", "Content": "Not as good of quality as I hoped for. Good on auto setting but any other setting or no flash it gets blurry", "Date": "April 21, 2013"}, {"Title": "It takes nice pictures", "Author": "Sharon Wiegele", "ReviewID": "R2LR4J5JJOSZWK", "Overall": "3.0", "Content": "I think the camera is great except for one thing, it's hard to zoom in or out. I think it should have a seperate slide or button.", "Date": "April 17, 2013"}, {"Title": "Good Camera Great Price", "Author": "Albert J Coccagna III", "ReviewID": "R3RN1RNUBSRJKO", "Overall": "4.0", "Content": "This is a full featured point and shoot camera at a decent price. Cannon has put together a solid package. There are more features here than most people will use. I would not bother paying more for a higher Cannon model unless you really need something that this does not have. After taking our first set of pictures I plugged it into my Mac with the supplied USB cable and iPhoto imported the pictures without hassle.Note: This did not come with a SD memory card which you will need.", "Date": "April 16, 2013"}, {"Title": "works great", "Author": "Mark C. Kite", "ReviewID": "R98PA0XC042CQ", "Overall": "4.0", "Content": "Very happy with it. Does a great job and is easy to use. Nice product for a reasonable price for sure", "Date": "April 15, 2013"}, {"Title": "a good start on a digital camera", "Author": "Nancy Norton", "ReviewID": "R1RACNAE3RQQFF", "Overall": "5.0", "Content": "Never used a digital camera, but want to learn.  I'm learning to download, etc.  This camera is perfect for a beginner.", "Date": "April 13, 2013"}, {"Title": "Awesome Little Camera !!", "Author": "Richee", "ReviewID": "R158QUGBQ3QRUQ", "Overall": "5.0", "Content": "This camera is perfect for what I do. I take a lot of pictures around San Francisco. Great zoom, nice clear pics. You can not beat the price either. I like it so much that I also bought one for my son. He loves it.", "Date": "April 13, 2013"}, {"Title": "A bargain price", "Author": "M. Tindell \"Retiree\"", "ReviewID": "R3RON44RDDPVZI", "Overall": "4.0", "Content": "Fantastic array of features at a bargain price.  This is the second of these cameras I have recently purchased.  Not having a view finder takes a little getting used to, especially for OLD camera bugs.", "Date": "April 12, 2013"}, {"Title": "My New Camera", "Author": "Richard Farber", "ReviewID": "R3SFK2KNBGFSTL", "Overall": "5.0", "Content": "It is a very useful  camera. It replaces a similar, but much earlier product that was stolen from me. I am looking forward to using it at a wedding in June.", "Date": "April 11, 2013"}, {"Title": "Best camera we ever owned so far.", "Author": "Suzanna H. Keats \"Zanventions\"", "ReviewID": "R2JE5DMZE3311", "Overall": "5.0", "Content": "It's easy to operate and takes good clear shots of our outdoor lights and creations during twilight hours (semi darkness).Our last camera caused our lights to streak, whereas Canon A4000IS 16.0 MP Digital Camera with 8x optical image, doesn't... unless, of course, you are pretty unsteady.  Plus it's compact and easy to carry.", "Date": "April 10, 2013"}, {"Title": "Super Camera!", "Author": "Kathy L Hill", "ReviewID": "R1EFFZW2MJI9XI", "Overall": "5.0", "Content": "I have the Canon A3400IS and the Canon A630 and this one fits the bill for fast zoom!  Great pictures and quality!", "Date": "April 9, 2013"}, {"Title": "You can't beat Canon", "Author": "fusy buyer", "ReviewID": "R3C05L3YJBXVBH", "Overall": "4.0", "Content": "I have a Rebel, but thought it would be nice to have something smaller.  For the most part I like it, except for a delay when pressing the button to take a picture.  Easy to operate, i like the rechargable battery.  The seller was very responsive - i received it 3-4 days after i purchased it.  Good price w/free shipping.", "Date": "April 4, 2013"}, {"Title": "Great camera", "Author": "Denise Hicks", "ReviewID": "R2Q2XSJLSSSA7", "Overall": "5.0", "Content": "I dropped my Canon and broke it...I looked a long time before I purchased this PowerShot camera. It is an upgrade from mine and I like the upgrades on it. I especially like the clearness of the video.", "Date": "April 3, 2013"}, {"Title": "Great Point and Shoot", "Author": "Tynan", "ReviewID": "R1PIFRUKVQS8AC", "Overall": "5.0", "Content": "Easy to use.  The 8x Optical Zoom makes for better distance shots.  Great for short videos.  Can't beat the price.", "Date": "April 1, 2013"}, {"Title": "Quality and delivery", "Author": "Hugh T. Dacus", "ReviewID": "RR6ZMKMS4W3PY", "Overall": "5.0", "Content": "The camera came exactly on time and was exactly as described. It is very easy to use and the pictures are coming out great.", "Date": "March 31, 2013"}, {"Title": "Does not focus well", "Author": "charles", "ReviewID": "R38WK1PELIPD7U", "Overall": "2.0", "Content": "Even though I focussed using the technique of half depressing the button before pushing it all the way I end up with not so crisp pictures on occasion.Othewise the camera is light and well built, size is great for transport", "Date": "March 25, 2013"}, {"Title": "Canon PowerShot A4000IS 16.0", "Author": "Hendle", "ReviewID": "R3KI25TA5Y0JWH", "Overall": "5.0", "Content": "My husband got this for his first digital camera, and loved it. It's easy to use, small, has a large screen, does good videos. So we got a second one for my grandson and he loves it too!", "Date": "March 24, 2013"}, {"Title": "Great Little Camera", "Author": "Kenneth \"Ken Burgess\"", "ReviewID": "R2XHWI9XY2VDZO", "Overall": "5.0", "Content": "This little Canon camera is wonderful!  Small in size butr BIG on quality photo delivery.  Plus, the color assortment available makes it easy to match the camera to the user's personality and color preferences.", "Date": "March 24, 2013"}, {"Title": "canon powershot camera", "Author": "Ellie Shannon", "ReviewID": "R3NE0382HLSWSO", "Overall": "4.0", "Content": "This is my second little camera not disappointed at all. Does just what we need pretty easy to use and pretty simple for either of us to use", "Date": "March 20, 2013"}, {"Title": "Fun Camera", "Author": "Lady Bug", "ReviewID": "R371EISUXUQ9PG", "Overall": "4.0", "Content": "Easy to use and shoot.  Wish it was a bit faster when shooting, so I wouldn't miss the changes on our grandson's face.  Otherwise, it is a very nice camera.", "Date": "March 18, 2013"}, {"Title": "Good Camera", "Author": "Andrés V", "ReviewID": "R20ZGWXBDEDC8A", "Overall": "5.0", "Content": "Me gustó la camara,  tiene buen zoom aunque algunas veces el enfoque no es tan rapido co mo deberiía ser.", "Date": "March 18, 2013"}, {"Title": "Great product", "Author": "Miguel L", "ReviewID": "R2DX24O1ADHSMA", "Overall": "4.0", "Content": "Ease to use, the automatic option offer a good adjustable scene to take nice picture, the screen size is appropriate to see more details of the environment.", "Date": "March 17, 2013"}, {"Title": "it is good one", "Author": "Ahmed Reda", "ReviewID": "R3797F9QEBIK8L", "Overall": "4.0", "Content": "i like the camera..but it didnt come as a gift as i signed to be..but totally i like it..thanks amazon", "Date": "March 17, 2013"}, {"Title": "Great camera for a beginner", "Author": "Gail", "ReviewID": "R260RA1CDBMVJI", "Overall": "5.0", "Content": "I would recommend this to anyone who wants a small, easy to use camera. The window in the back is large so you can see the images easily. The DVD that comes with the camera is easy to install on your computer, and easy to use.", "Date": "March 15, 2013"}, {"Title": "Better than what I had.", "Author": "John Fortman", "ReviewID": "R1OCXRVD0NRHCM", "Overall": "4.0", "Content": "This camera delivers clearer pictures than my old camera (10 MP) and I can appreciate the details that would have been lost otherwise.  Sometimes, buttons are too small or hard to push and can make it cumbersome if you are trying to take a picture in a hurry.", "Date": "March 14, 2013"}, {"Title": "CANON POWER SHOT A4000IS", "Author": "homer", "ReviewID": "RLKBNZTSG0AVC", "Overall": "4.0", "Content": "Canon PowerShot A4000IS  I base the review on photo quality - photo taken in dark areas - video- nice [ its not a camcorder ]  zooming @ sound works when in video mode some cameras dont do this.  1 not a bad camera photos are nice they could be better yet for the price photos a Good.  2 if you will, i will compare to panasonic dmc tz3 [ was a 325 dollar camera ] to  A4000IS  they are almost equil over all - photos-.  3 draw backs from the push of the button to the time of photo taken is slow. [ example trying to  get instant photo of a humming bird your going to mis the shot or at least that perfect instant ]  my thoughts i am not big on features just a simple camera fast processor realy great  photos. video zooming @ sound at the same time is great. its hard to figure out what kind  of camera to get due to the reason reviews are based on features and not photo quality.  i picked canon due to the name - phone support center is based in U.S.A an they anserw  quick. i checked out other brands in person canon seemed to have an edge.  as i said its  hard to find the best camera unless you can take all home test them for your self  NICE POCKET CAMERA  SLOW TO TAKE PHOTOSrw", "Date": "March 14, 2013"}, {"Title": "Great little camera for the price.", "Author": "Tsigeyu", "ReviewID": "REZ66J5G1D0EW", "Overall": "5.0", "Content": "Many functions, beautiful pictures, rechargeable battery, SD card, tiny and lightweight.  I love this little camera.  After my Nikon coolpix died, I got this as a replacement, and although it is taking me a little while to learn all the differences I am happy with my choice.  Great camera for the money.", "Date": "March 11, 2013"}, {"Title": "Cool Camera", "Author": "YugiohCardLover", "ReviewID": "RVJ7KFZYI87AR", "Overall": "5.0", "Content": "This camera can zoom in so close and still gets a decent resolution. You can see almost every detail from the picture. It has a lot of functions that you can perform with. Really great camera! Recommended item!", "Date": "March 8, 2013"}, {"Title": "Pink Canon PowerShot", "Author": "Tim", "ReviewID": "R118JXD3CTKQBH", "Overall": "5.0", "Content": "My daughter loves the pink Canon PowerShot she got for Christmas.  The camera takes very nice pictures and is easy to upload pictures with her computer.", "Date": "March 7, 2013"}, {"Title": "nice product", "Author": "K. O'Connor", "ReviewID": "R11ZE7A0FUZ2H2", "Overall": "5.0", "Content": "We already have a Canon so when we got this we weren't surprised by the ease of use and were impressed by the size of the screen. Even though we measured it prior to ordering it was still a surprise to see how big the screen is in relation the size of the whole camera..And I love the color!", "Date": "March 7, 2013"}, {"Title": "I was a happy owner of a older model which is no longer sold!!", "Author": "Alexandra Castaner", "ReviewID": "R2D1RKHTD20OSP", "Overall": "3.0", "Content": "I had a a PowerShort UR960IS ( I think?!, can't remember exactly the number...I can check it tomorrow is being used as a pretend camera at my job ).  I loved my camera because it was smaller, lighter, faster, etc.  I'm Ok with the new one & I'll learn to love it too, I just feel awful  because I dropped my old camera & broke it.  I really didn't want to change.", "Date": "March 6, 2013"}, {"Title": "Great camera, small footprint, takes good photos", "Author": "Alice Hofstad", "ReviewID": "R20D8C53685ZVX", "Overall": "4.0", "Content": "Bought these cameras to use with high school students.  They were able to take good photos, clear, sharp with little hassle. The battery lasts longer than using AA rechargeables so that was a pleasant surprise for me. Great product", "Date": "March 5, 2013"}, {"Title": "Pretty good", "Author": "Sandy McPheron", "ReviewID": "R13QLVBX2GX9I6", "Overall": "4.0", "Content": "Like most digital camers the shutter has a delay that makes it hard to capture a shot of my young grand  children, but I love the sleek design that allows me to slip it in a pocket.", "Date": "March 4, 2013"}, {"Title": "Nice Quality", "Author": "marquis", "ReviewID": "R35XMQAPYPDQVT", "Overall": "5.0", "Content": "I bought two of these cameras to give as gifts at Christmas.  The recipients are very pleased at the pictures and videos the cameras take, and looking at them myself, I can see why.  This is a nice quality camera for the money.", "Date": "March 4, 2013"}, {"Title": "Great Little Pink Camera", "Author": "Dorothy E. Green", "ReviewID": "R1VJALAEKAQ80", "Overall": "5.0", "Content": "We purchased this camera for our front gate Security Bldg. We take photos of employees, contractors, and visitors to our site. The picture quality is excellent and the camera is easy to use. We purchased the camera in pink in order to make it less likely to walk. Who wants to be seen with a pink camera?", "Date": "March 4, 2013"}, {"Title": "A Gift for our daughter", "Author": "Carla Garr", "ReviewID": "RRH3ERMGMAW3I", "Overall": "4.0", "Content": "We purchased this camera for our daughter whose other camera was lost.  She didn't want anything extraordinary, but she is very pleased with the easy handling of this camera and the pics it takes.", "Date": "March 2, 2013"}, {"Title": "great", "Author": "Santiago \"Salvarez\"", "ReviewID": "ROAOKS5NLQ0H", "Overall": "5.0", "Content": "This is a great camera whith a fabolous zoom,  specially the price for the product for me is the better", "Date": "March 1, 2013"}, {"Title": "great pictures", "Author": "djmarka", "ReviewID": "R3LPDWON9S2Z02", "Overall": "5.0", "Content": "takes great pictures and is easy to use. i like how compact it is and how clear the pictures i take are", "Date": "February 27, 2013"}, {"Title": "Great camera for the money!!!", "Author": "N. Kelly", "ReviewID": "R2Q62U92XYDGMN", "Overall": "5.0", "Content": "It is a very good camera. Easy to use, easy to figure out. Love the 5x zoom and 16 pixels.", "Date": "February 26, 2013"}, {"Title": "Love Love Love Love!", "Author": "Fulla03", "ReviewID": "RTYAFD1KM8BTD", "Overall": "5.0", "Content": "My dream is to own a DSLR, but until massive amounts of money fall into my hang - point and shoots will have to suffice. I purchased a FujiPix camera last Christmas and less than a year later, it stopped charging so I really wanted to make sure that I did my research before I got another one. So far, this has been great! It takes AMAZING close up pictures if you don't use the zoom feature. I mean, I'm impressed with it in that aspect. When the lighting is great, all the pictures turn out amazing and the photo features are awesome too! You can take a variety of style of photos with just a few clicks. I've been satisfied thus far, two months into the purchase.", "Date": "February 24, 2013"}, {"Title": "Good Gift for the Electronically Impaired", "Author": "The Baffled Bride", "ReviewID": "R2ISU42Q4MN76C", "Overall": "4.0", "Content": "I gave this camera as a gift to a 65 year old who is not an electronically savvy lady, she can't figure out how to work a digital alarm clock....Anyway she became a grandma this year and wanted to take photos but she didn't own a digital camera.After doing some research I decided on this camera would be able to take nice quality photos and also seemed to be user friendly. I still had to sit down with her and go over how to use it for a long while. But at least she knows how to turn it ON, zoom, take the photo, review photos taken, delete images and turn the flash on & off.The camera actually offers many different shooting modes and I found it to be very basic and easy to use.", "Date": "February 22, 2013"}, {"Title": "Great for the price", "Author": "Bearcat fan0609", "ReviewID": "R748HT9G3WMQ", "Overall": "5.0", "Content": "After my last camera took a fatal tumble, it was time to make a new purchase. This camera is great for the price, and came in a bundle with a memory card and camera case (don't know if this was a one-time promotion or not). Easy to use and nice picture quality, this camera was a great purchase.", "Date": "February 22, 2013"}, {"Title": "Canon Brand", "Author": "Leo of San Francisco. \"O Cordova\"", "ReviewID": "RNW8S970N8X8W", "Overall": "5.0", "Content": "For the price, size, and for my travel here and there needs, this camera works just fine.I own several cameras and another larger Canon camera, but I needed something small easy to carry in a jacket or clip on to my belt, via the case I bought for it.  I am extremely happy with this camera and what it can provide me.", "Date": "February 21, 2013"}, {"Title": "Operation instruction in owner's manual can be improved.", "Author": "Mian-Chang Wang", "ReviewID": "R1QI94BYH54A73", "Overall": "4.0", "Content": "The instruction of how to use the camera is not clear.  It is poorly written compared with that of Sony's camera.", "Date": "February 20, 2013"}, {"Title": "excelent", "Author": "Robinet Castillo-Zarate", "ReviewID": "R399DN60ZC5HCN", "Overall": "5.0", "Content": "easy to use. It is small so I can put it in any small place, it is easy to transport, easy to follow instructions.", "Date": "February 19, 2013"}, {"Title": "Excellent", "Author": "Ruben Alcalde/Priscila Salazar", "ReviewID": "R2J24QXDYO8KN", "Overall": "5.0", "Content": "This product is excellent, I'm very satisfied with this product that's why I recomended to all of you, many thanks,with king regards,", "Date": "February 19, 2013"}, {"Title": "Great gift", "Author": "R. C. Stape", "ReviewID": "R3FKOJ7LDM4UN6", "Overall": "5.0", "Content": "I don't have anything to say except that I can't rate it without being long winded.  I probably won't rate any more stuff.", "Date": "February 16, 2013"}, {"Title": "Canon powershot", "Author": "Munir Metwally", "ReviewID": "R3QYOOE9T6RDKG", "Overall": "4.0", "Content": "The camera is handy and fast which is what I was looking for. It takes good pictures, but I would have like a little more elaborate users guide. n", "Date": "February 11, 2013"}, {"Title": "Great compact digital camera", "Author": "S. Vainio \"avid reader\"", "ReviewID": "R2QDVQ97HBMT2P", "Overall": "5.0", "Content": "I love this Canon!  It is very versatile, easy to use, lightweight, and compact enough to carry anywhere.  I love the choice of color that is available for this model.  It fits beautifully in the case that I purchased for it.  I also have a DSLR by Canon for more serious photography, so I knew this smaller camera would have the Canon quality I'm used to.", "Date": "February 11, 2013"}, {"Title": "Excellent product!", "Author": "Pam Johnson", "ReviewID": "R3GWPKCCUMGW5D", "Overall": "5.0", "Content": "Excellent camera for the price - nice, large view screen and I love the motion control - works well in darker settings as well. The battery lasts quite awhile longer than any other similar camera I've owned, too, which I appreciate!! Great product!", "Date": "February 10, 2013"}, {"Title": "Point and Shoot camera", "Author": "Theresa", "ReviewID": "R2AB90E5AJ8V0A", "Overall": "4.0", "Content": "This little camera is nothing special as far as point and shoot goes.  Does pause between shots so it's worthless for action shots. It is very handy to carry around and will slip from your hand.", "Date": "February 10, 2013"}, {"Title": "Great camera for a Great price.", "Author": "Deborah Nicholson", "ReviewID": "R1VMWI16K87NBZ", "Overall": "5.0", "Content": "Just received this camera yesterday and so far I LOVE IT . First time ive bought a big item like this over the internet and it was a great experience all the way around.", "Date": "February 8, 2013"}, {"Title": "Long battery life", "Author": "Tiffany \"Tiffany\"", "ReviewID": "R37OIO74XPWO31", "Overall": "5.0", "Content": "wonderful product for the price. More battery life than expected. Nice color also, i recommend it to everyone. Good clarity for the price.", "Date": "February 4, 2013"}, {"Title": "Fantastic Camera!", "Author": "Michele", "ReviewID": "R37IAGLHDKH7ON", "Overall": "5.0", "Content": "This is a fantastic camera and it takes GREAT pictures!  I have had a canon camera in the past & this is the best yet!", "Date": "February 2, 2013"}, {"Title": "Really nice product with excellent price", "Author": "Leri", "ReviewID": "R1AHOOQTL5T5RP", "Overall": "5.0", "Content": "Love this camera because it's really perfect compare to its price.I advice you to buy it, you are gonna love it too! ;)Good luck with your choice! ;)", "Date": "February 2, 2013"}, {"Title": "merly bastidas", "Author": "merly bastidas", "ReviewID": "R1MEP80E2OY3T1", "Overall": "5.0", "Content": "esta camara me encanta porque es muy liviana tiene muy buena capacidad el video es bueno  y de inmejorable calidad", "Date": "January 31, 2013"}, {"Title": "Canon Power Shot A4000is 16.0 Mp", "Author": "Shelly A. Feidt \"teddie\"", "ReviewID": "R287808OB1U0ND", "Overall": "5.0", "Content": "Love the camera,my sis got hers first an she loves it.So I went an got one an love the color.Still figuring it out but love it", "Date": "January 30, 2013"}, {"Title": "Camera", "Author": "Alton Ray Miller", "ReviewID": "RDWD47WQBF4W3", "Overall": "4.0", "Content": "It does a good job for the price, as good as I expected.I would purchase another like this if I needed a camera.", "Date": "January 28, 2013"}, {"Title": "GREAT CAMERA", "Author": "M. McFadyen", "ReviewID": "R1NYAF9JXYB6PH", "Overall": "5.0", "Content": "great pics and very easy to use and no problems at all. pictures can be taken near or far quickly and easy", "Date": "January 28, 2013"}, {"Title": "Very good buy!", "Author": "Richard", "ReviewID": "RK8S1E47PIQZA", "Overall": "5.0", "Content": "Canon Powershot A4000TS Camera : Would recommend to anyone needing nice compact camera at a good price.Excellent camera with many good features.", "Date": "January 28, 2013"}, {"Title": "Canon PowerShot A4000IS 16.0 MP", "Author": "homme mantel", "ReviewID": "R1NFYTAWOUEQ54", "Overall": "5.0", "Content": "All round camera-easy to handle-bright pictures-Good battery life-Transfer the pictures to computer just plud the camera to the USB port and pictures are on the screenAquality CameraHomme mantel", "Date": "January 27, 2013"}, {"Title": "perfect", "Author": "Amazon Customer", "ReviewID": "R2F2TZ5UQ4XQQY", "Overall": "5.0", "Content": "I am so glad it has a rechargeable battery, so my daughter can charge it at night.  I hope it doesn't run out camping though, so wish I could find another for a backup.", "Date": "January 21, 2013"}, {"Title": "Great budget camera.", "Author": "Ckobayasi", "ReviewID": "R1VF01T0UT020T", "Overall": "5.0", "Content": "I always wanted a slim camera but didn't want to spend more than $100. I don't intend to take pictures like a pro.I chose it because of the great ratings, the pink (I love it!), light weight and slim. It takes better pics and movies than my camera phone.Just make sure to get a cover, since the preview screen is unprotected.", "Date": "January 21, 2013"}, {"Title": "Canon PowerShot A4000IS 16.0 MP Digital Camera with 8x Optical Image", "Author": "Walter E. Griffin", "ReviewID": "R31H461M30GPOH", "Overall": "5.0", "Content": "The camera is exactly as described and is simple and easy to operate.  The buttons and controls are easy to manipulate.", "Date": "January 18, 2013"}, {"Title": "PERFECT", "Author": "THE VIRGINIAN", "ReviewID": "R1DZ0JU89WDLWM", "Overall": "5.0", "Content": "CLEAR,CRISP PHOTO'S.EXCELENT FOR FAMILY GATHERINGS, NO ONE GETS LOST IN THE FOG.MICRO SHOTS ARE TRUELY AMAZINGGREAT BUY.", "Date": "January 16, 2013"}, {"Title": "Meets the need", "Author": "Keith W. Warren", "ReviewID": "R3FLNEP2X1ZRE2", "Overall": "3.0", "Content": "I replaced a Lumix point and shoot. I had my picks narrowed down to 3 and the Canon won. Dollar for dollar the Lumix was a much better camera. Pretty all the pictures seem over exposed and the software for my computer is VERY Slow and hard to work with. Wish I still had the Lumix.", "Date": "January 13, 2013"}, {"Title": "Great Value", "Author": "R. Taylor", "ReviewID": "REI9J74UK50EF", "Overall": "5.0", "Content": "This camera takes great quality pictures. I have been very happy with the ease of use from this inexpensive camera", "Date": "January 11, 2013"}, {"Title": "Excellent condition", "Author": "Heather Aldridge", "ReviewID": "R15OXP2VBOXE9J", "Overall": "5.0", "Content": "Really fast shipping and the item is in excellent condition- I brought this camera for my mom for Christmas and it's easy for her to pick up the technology from this camera- my mom is happy with it so I'm happy as well. :-D Thanks!", "Date": "January 11, 2013"}, {"Title": "Happy Grand-daughter!", "Author": "sscvillemom \"sscvillemom\"", "ReviewID": "RFPSDCOEGAPKW", "Overall": "5.0", "Content": "I purchased this camera as a Christmas gift for our grand-daughter. She was thrilled and so was I. The Amazon price was lower than our local stores PLUS I was able to avoid the crowds :) A win-win!!", "Date": "January 10, 2013"}, {"Title": "Thank you", "Author": "Sezinho", "ReviewID": "R2LQSG5R84YGNV", "Overall": "5.0", "Content": "I gave 5 stars because of the delivery and the product itself was fantastic. I really liked it, please keep up the good work.", "Date": "January 10, 2013"}, {"Title": "Canon is always great.", "Author": "Dana Adams", "ReviewID": "R4XWC6MHMGYDT", "Overall": "5.0", "Content": "I'm completely satisfied and have no complaints. Just be aware that the video function of the camera is silent. At least I couldn't figure out how to get sound to my video.", "Date": "January 8, 2013"}, {"Title": "Great Camera", "Author": "Alex", "ReviewID": "R1SV42P0IR3YH8", "Overall": "5.0", "Content": "This is a wonderfull product, very easy to use and the pics are great.I recommend this item any time, plus the PRICE!!", "Date": "January 7, 2013"}, {"Title": "Do it.", "Author": "Heather", "ReviewID": "R2U5MTDJPDPWPL", "Overall": "5.0", "Content": "I researched and researched and settled upon this little beauty. It's compact, it takes clear photos, and it's simple to use for a great price! what more can I ask for? I wanted this camera so I can actually print photos instead of having a million camera photos online and so far it is working perfectly.", "Date": "January 7, 2013"}, {"Title": "VERY NICE", "Author": "BEARCLAW48", "ReviewID": "R13DVC933965P2", "Overall": "4.0", "Content": "GOT THIS FORMY W IFE F OR  CHRIST MAS SHE HA S TRIED IT SEVER AL T IMES AND REALLY ENJOYS IT", "Date": "January 6, 2013"}, {"Title": "Easy to use", "Author": "cosmo", "ReviewID": "RVXROV0R35C5D", "Overall": "5.0", "Content": "Right out of the box it was easy to use and takes very good pictures. Good camera fo a novice like myself.", "Date": "January 6, 2013"}, {"Title": "Awesome Christmas present!", "Author": "Julie", "ReviewID": "R1PXMWXXZMR5K2", "Overall": "5.0", "Content": "I got this as a Christmas present. I LOVE it. High Quality photos and videos. I don't really have any cons about it. I'm not all about bells and whistles. Canon is the BEST though.", "Date": "January 5, 2013"}, {"Title": "Great gift", "Author": "AmazonTurkey", "ReviewID": "R1QJ4GJ48Y9B3B", "Overall": "4.0", "Content": "it was a great gift from my mother who is not very good with electronics...at all. It was easy for her to figure out how to use it and the pictures are of good quality", "Date": "January 5, 2013"}, {"Title": "Canon Powershot A4000 16.0 MP Digital Camera with 8x Optical Image", "Author": "Rose", "ReviewID": "RHJ0OAUT788Q1", "Overall": "5.0", "Content": "It takes a very clear picture, and is extremely easy to use.  I bought one for my husband, and one for my son, & they are very satisfied.", "Date": "January 5, 2013"}, {"Title": "Christmas gift...she loved it!", "Author": "Al Sanchez", "ReviewID": "RX7SJ321GPWRH", "Overall": "5.0", "Content": "Looking for a Christmas gift.  Canon produces a great camera AND IT WAS A GOOD DEAL!  She loved it and the case and extra card I bought!", "Date": "January 2, 2013"}, {"Title": "very slow", "Author": "samantha", "ReviewID": "R30PD9VETRXQ5J", "Overall": "3.0", "Content": "This camera is very pritty and it takes good pictures once you figure it out but it is very very slow and very stubborn about it. Its good for things that hold still but if it moves your in trouble with this one and if it dont think its ready its not gonna take the picture knowmatter what you say or do. It would be a nice camera for just taking portraits but i have 12grandkids and they never hold still. Im very disapointed.", "Date": "December 30, 2012"}, {"Title": "Awesome", "Author": "Jennifer L. France", "ReviewID": "R2K5PMYGX2PZV", "Overall": "5.0", "Content": "This camera is very reasonable priced and is a good starter camera for pre-teen. I recommend this to all looking for value.", "Date": "December 30, 2012"}, {"Title": "Expected more from Canon", "Author": "malibumar", "ReviewID": "RPCOXKBY0TAIZ", "Overall": "3.0", "Content": "I own 3 other Canon cameras and I shoot with one for work (price range $250-$3,000). I bought this for my 9 year old as a starter camera. I like the simplicity of its functions which is great for people who just want to point and shoot and have no use for or patience to learn how to use the many features and benefits of more expensive cameras. However, the picture quality and camera responsiveness is not what I have come to expect from Canon.", "Date": "December 28, 2012"}, {"Title": "Such a simple, sweet camera", "Author": "Auntie Chula", "ReviewID": "R3FFCIN1CKMHY3", "Overall": "5.0", "Content": "I love this little camera--so easy to use, so light.  Nice pictures.  It is a very good value for the price.", "Date": "December 28, 2012"}, {"Title": "Canon Powershot A4000IS camera", "Author": "DEM", "ReviewID": "R194EXGD1VA502", "Overall": "4.0", "Content": "Christmas present to college daughter. She really likes the camera. HOWEVER, the description should state that it does not come with a memory card, so she couldn't use it until I purchased the card. Otherwise, very pleased!", "Date": "December 27, 2012"}, {"Title": "Great camera", "Author": "Cam", "ReviewID": "R2OVCQE892W9S1", "Overall": "5.0", "Content": "This is a great camera for point and shoot and has some nice features and effects to spice up your pictures. Great at taking pictures of objects in motion with little to no blur. The zoom on it is a real nice feature as well. Overall great camera. I would definitely recommend this camera.", "Date": "December 27, 2012"}, {"Title": "Gift for Mom", "Author": "Ashton Piechota", "ReviewID": "RJ6QRFUAE2UXW", "Overall": "5.0", "Content": "love the price for this type of camera ($100)enough features for the average camera person.love all the options of colors as well. very satisfied.", "Date": "December 27, 2012"}, {"Title": "missing bolt", "Author": "ERIC CLIFF", "ReviewID": "RAUQ8J276GZWX", "Overall": "3.0", "Content": "found bolt in box which was missing from side cover, tryed to reinstall but would not hold, returned item for exchange", "Date": "December 27, 2012"}, {"Title": "Good Point and Shoot for the Money", "Author": "Charles Capko", "ReviewID": "R21COER4XWCLDE", "Overall": "3.0", "Content": "This camera is several times better than the camera in my phone. That's basically what I was expecting. It's awful for taking pictures of moving people inside though. Even with the flash on interior pictures will be blurred if your subject is not holding still. Exterior under daylight or even overcast is OK though. The camera is pretty quick to focus and zoom and take pictures... assuming that you have enough light. Again, interior pictures are going to take a little longer. Overall it's a fair camera for the money. I'm, sure that there are a ton of other cameras in the same price range that are not as good though. For me, I'll be using my GE camera, it's larger and bulkier but that's a tradeoff for a better picture.", "Date": "December 25, 2012"}, {"Title": "good product", "Author": "Arlene Rodriguez", "ReviewID": "R2QTZ270XXH0MB", "Overall": "4.0", "Content": "this is a good product...the reason for only four stars?? nothing is ever 100%....but overall good...takes pretty good pictures...yes I would recommend...", "Date": "December 24, 2012"}, {"Title": "Great for price", "Author": "Tammy Foseid \"tlfsunshine\"", "ReviewID": "R2G0APFI211FV1", "Overall": "5.0", "Content": "The camera is easy to use and takes good pictures for the size and cost. I also like that it is pink:)", "Date": "December 23, 2012"}, {"Title": "A great little point and shoot", "Author": "coachcarol", "ReviewID": "R1YAQL9TWTUSQ", "Overall": "4.0", "Content": "I am very pleased with my new camera.  Many have said they are surprised by the quality of the pictures I'm getting.  Definately a great buy especially for a novice photographer.", "Date": "December 13, 2012"}, {"Title": "2nd Cannon PowerShot", "Author": "Mrs. Sweeney", "ReviewID": "R3KVFR69DW9LMZ", "Overall": "5.0", "Content": "Cannon is always a sure thing! This is my 2nd Cannon Power Shot, and I did not buy it because the old one did not work (cause it still does) I had the SD10000 7.1 mega pixels (6 yrs old maybe) and wanted a newer version w/higher mega pixels for our upcoming trip to Mexico. This camera is awesome! It takes super clear pics, its fast, and doesn't force my dog to look like she's sleeping or squinting in every photo because of the flash!! Bonus!! GREAT PRICE, EXCELLENT PRODUCT!!  This seller was perfect, item received in the box, with man. warranty info/books ect. Thank you!One thing that was of disappointment the UPS guy left it out back in the rain because no one was home. (why I have storm door it would have fit behind.. UGH, he's lucky the camera didn't get wrecked.. Maybe the seller should ask that gets signature, or something to this effect.", "Date": "December 13, 2012"}, {"Title": "Love it", "Author": "Susan Newton", "ReviewID": "R5BQOG3GCBUH1", "Overall": "5.0", "Content": "Great camera at a great price.  Canon makes a great camera. Does everything a non professional could possibly want to do.", "Date": "December 10, 2012"}, {"Title": "Not Bad for a Budget Priced Camera", "Author": "perrymasonary \"perrymasonary\"", "ReviewID": "R2TIYWVLLP373A", "Overall": "4.0", "Content": "This camera was purchased for my 11 year old daughter who enjoys taking photos, as the price point was right and it was purchased for $169 less the $50 rebate plus a Square Trade Warranty for 3 years.The camera is nice and slim making it easy to slip in a pocket or purse.As to the photo quality, well not as good as the higher priced Canon, but not terrible.  Although I was disappointed with the P mode as the white areas were washed out on an overcast day, on a clear blue day the results were very nice.  Although the LIVE mode allows for adjustments, those adjustments if not careful can affect the color balance.The intitial test pictures were good but not fantastic.  Comparing this camera's photos to our older model Canon Power Shot SD800 IS with a lower pixel count, the SD800 fared a better, which is probably due to the sensor.  That said, you get what you pay for as the A4000 is a budget camera.Still for the price this camera has several different shooting features such as fisheye, minature, vivid, monochrome, etc...  These features allow the photographer to create an effect while taking the picture instead of editing through a program such as Adobe Elements.The Square Trade Warranty purchased direct from Square Trade was less than Amazon and a necessity after our prior experience with the Canon Power Shot SD800 IS breaking mechanically twice.  Fortunately with the Canon Power Shot SD800 IS we had the Square Trade Warranty and it was fixed both times without question.", "Date": "June 19, 2012"}, {"Title": "The Camera Came Broken", "Author": "Casey Krupka", "ReviewID": "R8NUS0EMZ4Q5U", "Overall": "1.0", "Content": "I bought this camera for my mom for Christmas. She was so excited to get it. After she charged it she went to use it and the picture won't show on the screen. It's just a black screen.", "Date": "January 2, 2013"}, {"Title": "Cannon PowerShot Canera", "Author": "Buford Blankenship", "ReviewID": "R1GFVXK5NXOLCB", "Overall": "2.0", "Content": "the camera will not take very clear pictures as i thought it wouldthey seem to be a bit fuzzy looking back i probably should bought a better camera.", "Date": "December 6, 2012"}, {"Title": "Fun camera, lots of colors", "Author": "Andi C Bair", "ReviewID": "RMZGY2CD344H6", "Overall": "4.0", "Content": "Canon A4000 is a fun camera available in many colors. Let me use my usual disclaimer, in the interest of fairness, and admit that I think many cameras by reputable makers (and there are many) deliver what they promise. It is more about what camera traits you are looking for. So, I would suggest to anyone looking to buy one to google 'camera trait search' and get the whole picture.The A4000 is a fixed lens camera (point and shoot, some would say), with 16 resolution (megapixels), and a x8 zoom. The sensor size is 1/2.3 inch CCD-type, which is standard for cameras of its class.If you were to, say, take pictures of friends and family at an outdoor gathering, this camera is what you need. If you get ambitious, there will be stumbling blocks. Here is the camera's trait mix: It does not have a viewfinder, which, again, many in its class don't. The ISO rating, which is the gauge for how well it does in low light, is 1600. That rating is lower than many others, but it is sufficient for most purposes. The video is a Full HD- that is 1980x1080 resolution. It does not have a hot shoe for an external flash option. That is not unexpected for its size and category. The LCD screen is a 230,000 resolution. The camera does not do RAW processing but you would need only if you did not want to be limited by JPEG type storage. It comes with WiFi- very convenient for easy upload. The weight of the camera is a convenient 145 grams.Overall, nice, fun camera. Having been into photography for a while, I do stress though that you do a camera trait search. That will also tell you more about what you want.", "Date": "March 11, 2014"}, {"Title": "thumbs down - out of over a dozen cameras I have owned Canons make up the bottom of the list and this is the worst one of all!", "Author": "Erich Korman", "ReviewID": "R1LZLQT7MVHY7T", "Overall": "1.0", "Content": "way too complicated to use, pathetic manual, short battery life, dozens of settings that don't change anything - absolute bullhookey, this is my last Canon - their film cameras were never as good as the competition and the digital ones are not either. I will be putting mine on ebay as soon as I get something else!", "Date": "December 5, 2013"}, {"Title": "Hard to open to get battery out", "Author": "Barbara Webster", "ReviewID": "R1GGMBEFM7N4B3", "Overall": "2.0", "Content": "Pictures aren't sharp, screen is hard to see, especially in bright sun, backgrounds are fuzzy. Needs a much better lens.", "Date": "July 31, 2013"}, {"Title": "Great Value", "Author": "Paul", "ReviewID": "R3U6311GE5J141", "Overall": "5.0", "Content": "Got it on sale at Bestbuy for $95 (including tax & shipping). It came with a free case as well. Pictures are very sharp. Zoom works great. There is a slight shutter delay/lag between taking pictures. May be that's because I am using an old class 4 memory card. I will buy a Class 10 and see if it makes any difference.", "Date": "July 19, 2013"}, {"Title": "Excellent camera especially for the price", "Author": "ab", "ReviewID": "RFGRFI2G9RH4I", "Overall": "5.0", "Content": "Having had a PowerShot for many years, I replaced it with this newer model.  Without question, the picture quality is higher.  I would still prefer a few more options for control (which my older model had), but all in all this camera will give you excellent picture quality with tremendous ease of use.", "Date": "April 4, 2013"}, {"Title": "Horrible picture quality", "Author": "AcornMan", "ReviewID": "RR8MQKVP05UP9", "Overall": "2.0", "Content": "I shot several pictures with this camera on a nice sunny day today and was extremely disappointed with their quality. I've never seen such horribly grainy pictures, even from phone cameras. Canon should be ashamed to have its name on this piece of junk.", "Date": "March 15, 2013"}, {"Title": "Difficult to use.", "Author": "Sheila J. McMahon", "ReviewID": "R1MD7OQOJ16JUI", "Overall": "2.0", "Content": "No written instructions even after being promised by a Canon Rep.Camera takes too much time to reset itself between shots.Pictures are not clear.Covering of lens has sharp edges.  These catch on my fingers.Sound on movies not as good as on the Canon A470.Really wish the A470 had not failed.", "Date": "February 8, 2013"}, {"Title": "A Little Clunky But Does The Job", "Author": "Baja Diver 770", "ReviewID": "R1BCZ6KT00IPOA", "Overall": "4.0", "Content": "Doesn't feel quite as solid as the other Canons I've had and the box-like shape with a thinner right-hand grip area is just a little clunky but it still does the job. Takes nice pics and it is very easy to put way in a shirt or pants pocket.", "Date": "January 20, 2013"}, {"Title": "Great camera, good value", "Author": "gweshead", "ReviewID": "R19R0624Y5SG32", "Overall": "5.0", "Content": "This camera is the right combination of great pictures, great size, ease of use and price.  We had it for a few months now and are very happy with it.", "Date": "January 20, 2013"}, {"Title": "Good camera", "Author": "Fremont", "ReviewID": "RDXCZTD4Y4LUU", "Overall": "4.0", "Content": "The Canon A4000 takes absolutely awesome pictures!  The only drawback is that there is not an HD port so as to view the HD video (OR the photos) on an HD TV.  It comes with a USB cord, and I guess I'll have to get some sort of an adapter.  But the picture quality for a camera this small, to me, is quite good.", "Date": "January 15, 2013"}, {"Title": "Excellent small camera", "Author": "Bob Lawes", "ReviewID": "R2DI28VCNEMCSG", "Overall": "5.0", "Content": "The PowerShot A4000 IS is a small, compact, point and shoot that provides most of the atributes demanded in our modern digital cameras at a price that defies logic.  I don't know how Canon can produce this much camera for this small a price.  The LCD is huge, the camera is miniature and the resulting photographs are just excellent.  Ordered on the 22nd and delivered on the 24th, Amazon came through for that last minute Christmas gift.  This is a one day review, time will tell if the A4000 will stand up to the demands of time but things sure look good at the present time.", "Date": "December 25, 2012"}, {"Title": "Cant go wrong with Cannon", "Author": "Zach Kohlhoff", "ReviewID": "R246BHTJDS4H92", "Overall": "5.0", "Content": "Cannon has always been good so shouldnt be any different this time around. It's a present so havent got it out yet, but should be a good one!", "Date": "December 24, 2012"}, {"Title": "great camera but no memory card?", "Author": "Rachel Lodin", "ReviewID": "R28Q7GNLYDTBA8", "Overall": "3.0", "Content": "this camera is a great travel camera, its small and easy to transport but i was really disappointed upon finding that it did not come with a memory card.", "Date": "December 19, 2012"}, {"Title": "Okay camera in a beat up box", "Author": "Amandan86", "ReviewID": "R2OJF3VD9J8DR3", "Overall": "3.0", "Content": "This camera was bought as a gift for someone who does not take many pictures but needed a new camera. For this purpose the camera was great but I was disappointed when I had it delivered and the box of the camera was all beat up and we had to wrap it in a different box. I expected better packing from Amazon.", "Date": "December 10, 2012"}, {"Title": "Its what we wanted", "Author": "Rooksroost", "ReviewID": "R44T24V6RLD5C", "Overall": "5.0", "Content": "Its a Cannon! It works well, easy to use, doesn't have a bunch of features we'll never use and it fits in your pocket!Have had Cannons for years and have never been dissatisfied.", "Date": "December 7, 2012"}, {"Title": "Canon Powershot 400", "Author": "K. Anderson", "ReviewID": "R1I1CIV3CTDTGN", "Overall": "4.0", "Content": "Good photos.  Functions are similar to past models8x zoom helps a lot at stadium events.A little bigger than my former SD750, but fits in jacket pocket.Image transfer is easier than older software.", "Date": "October 27, 2012"}, {"Title": "The WORST camera ever!", "Author": "Uchilka \"uchilka\"", "ReviewID": "R12X0RJWCWOIDL", "Overall": "1.0", "Content": "Bought it on October 2012. It's March 2013 now. Already broken! Cannot put the battery inside. The worst camera ever!!!", "Date": "January 11, 2013"}, {"Title": "Great camera", "Author": "Larry A. Berg", "ReviewID": "R3JZC2OGVPYZCR", "Overall": "5.0", "Content": "My wife carries it in her purse so we can take pictures any time. She is an artist and when you see an opportunity there is no time to go back to the house and get the camera. The shot will be gone.", "Date": "April 11, 2014"}, {"Title": "Very Nice Point & Shoot Camera", "Author": "Bill A. Belt", "ReviewID": "R1Y4UFZPRD90H8", "Overall": "5.0", "Content": "My Sony  DSC-W150 encountered an issue as the slot holding the memory card apparently lost a  pin or clip as the card would not longer stay in the camera. Everything else worked great. I shopped around and based upon lots of reviews opted for the Canon PowerShot A4000 as being the closest comparable.There are some features on the A4000 that are better than the Sony. The Canon has 16 megapixels while the Sony 8.1 megapixels. The Sony has a 5 X zoom while the Canon has 8 X zoom. I will keep the rest of the review to the Canon.The body of the Canon is aluminum, however the  door holding the memory card and the battery appears to be plastic which at times does not always open or close that freely. The metal tri pod bush is metal and that is good. The screen is a large 3 inch LCD and thus far has worked great both inside and outside. There is no viewfinder and this seems to be common on today’s lower priced point and shoot cameras. The camera comes in four different colors thus get the one that suits you. Mine is red. There is 720p HD for movie shooting and the quality on just the one I have taken is good.The off/on button is on the top of the camera and if you have big fingers you may find at  times the button is a little hard to turn on and off. It is rectangular and less than ½ inch long and imbedded directly into the case at almost case level. Canon advises this button is sunken into the body to prevent accidental depressing when you’re trying to take a picture. The telephoto feature is triggered by the rotating button that surrounds the shutter button. It works fine.The back of the camera is dominated by the 3 inch screen which is not all that bad. The buttons for changes is located on the right and consist of five buttons plus the center ring which has control over four functions. One of the buttons is the top one which is dedicated to the video which I found was easy to operate.The shutter button seems to have a small delay, thus after pushing the button it takes a moment for the shutter to click. I am getting used to it. After power up the shutter button takes a little over two seconds for it to be activated. The memory card is an SD card which is good as it is common and readily obtainable even when traveling.I guess the last question is does it take pictures? I find the quality very acceptable for a point and shoot camera. I use this camera primarily for taking quick photos while traveling and in places that a large digital camera might not be acceptable. Food review pictures are easy to take and after three of four, just drop the small camera in your pocket and this disturbs no one. I have not attempted to make any enlargements for printing as I use a large digital camera for that. This is a nice traveling companion and easily fits into your pocket so you can be ready for that unusual shot.", "Date": "March 8, 2014"}, {"Title": "Arrived in acceptable condition.", "Author": "James A. Baker", "ReviewID": "R2MW5DYSDTAOKE", "Overall": "3.0", "Content": "It worked, and arrived on time. Canon makes excellent cameras that should be taken care of. When spending money on a used item  never pay a  high percentage of the item's cost new unless you can see and test the item yourself.", "Date": "November 18, 2013"}, {"Title": "perfect", "Author": "Amazon Customer", "ReviewID": "R1SCKL4RVZIWCA", "Overall": "5.0", "Content": "So far I love this camera. I've had it a couple of months and no issues. I have a larger Canon but it was hard to take it everywhere. This one is the perfect size. I can fit in my pocket when needed. Love it!", "Date": "August 9, 2013"}, {"Title": "Excellent!!!", "Author": "Camilo Marcelo Zeledón Lorío", "ReviewID": "R301650GADDVM8", "Overall": "5.0", "Content": "A camera that takes excellent tremendous panoramic photos. This itself was a good buy. I love the color and resolution of the images is excellent.", "Date": "July 17, 2013"}, {"Title": "the best!", "Author": "Nicole", "ReviewID": "REB528U05JMSV", "Overall": "5.0", "Content": "I am so glad I made this purchase. There are so many settings and options on this little thing, that you have to go out of your way to take a bad photo, really. I also love that it comes with its own rechargeable battery, instead of having to worry about wasting batteries.", "Date": "May 27, 2013"}, {"Title": "Quality Control & Customer Service Lacking", "Author": "One who devours books \"Big Dan\"", "ReviewID": "R18KUV8WWJFYWL", "Overall": "1.0", "Content": "I note that everyone is now lowering their price on this camera...seems it has some issues and I am not the only one having trouble with it.This will likely be the last Canon product I ever deal with in my lifetime.  The camera was given to me as a gift and could not be returned.  It came out of the box defective just like the last one I obtained several years back.  I tried all sorts of things to make it work with no luck.  After some time I finally figured the only way to get it replaced was to send it to Canon directly along with a nice letter explaining how I could not return the item.  It had been a gift from a company (client) and letting the gift giver know it was defective was not an option.  Shortly thereafter I received a proposed repair bill via email for $150.  After several lengthy emails and telephone conversations I still do not have a working camera.  Since I have no specific purchase date and no receipt it would seem I might just be out of luck on this $199 gift.  Yes, you read correctly, $150 to repair a $199 camera which is now valued at $109 here on Amazon.  The best part?  What do I do when I am out on a jobsite with this client and they expect me to use the camera they gave me?  Canon claims to have top notch customer service and quotes endless surveys to prove this is the case.  Apparently they forgot to survey folks like me who think their customer service ranks pretty low.My advice; feel free to buy their products but keep your receipt and note your purchase date so you have a method to return any defective products.  Should you give one of their products as a gift, attached the gift receipt.", "Date": "April 24, 2013"}, {"Title": "Great Camera", "Author": "stacy guzman", "ReviewID": "R2BFS12N7YSVZ5", "Overall": "5.0", "Content": "This is my second time buying this exact camera. It's really great for the price. My first one drowned during a boating accident.. I purchased the cheap Sony digital to replace it (since it was a little cheaper then this one). That camera was a joke... So, I'm bad to this camera. Great camera for the money.", "Date": "April 19, 2013"}, {"Title": "Canon PowerShot A4000 IS Review", "Author": "Joseph P. Klemstine \"NikonD80\"", "ReviewID": "R1L9UNRTAD04U1", "Overall": "5.0", "Content": "There are many reasons I purchased this camera: True Optical Image Stabilizer, 28mm wide-angle to 224mm telephoto, 16.0 Megapixels, Intelligent built-in flash and Canon provides a quick start-up manual and complete CD-R with expanded features of this Digital Camera. Canon deserves an A+ for this camera design. I really love this compact camera and carry it with me all the time. I would highly recommend this beautiful Cannon PowerShot A4000 IS !!", "Date": "March 30, 2013"}, {"Title": "Camera", "Author": "Carol Diffenderfer", "ReviewID": "R28OEX5TJV57U8", "Overall": "2.0", "Content": "The camera itself works great but it didn't come with a charger that I could use because it needs an adaptor plug for the camera to be charged.  The charger that came with the camera wasn't for USA outlets.  I had also ordered a 2 pack battery and charger kit which DID come with a USA plug so I am using that charger.  Not happy with the charger that came with the camera.", "Date": "March 29, 2013"}, {"Title": "Camera", "Author": "gustav", "ReviewID": "R6UKU0LV58K7X", "Overall": "5.0", "Content": "Camera works great altho a bit more complicated than I at first thought.  Simple, short, easily understood instruction book included but a comprehensive (over 100 pages) book car be perused once installed in computer.  Of course pictures may be viewed by camera and may be transferred to computer for printing storage and printingOnly disappointment was fact that memory card was not included in original package.  Perhaps understandable as memory cards come in different MB capacities.", "Date": "March 5, 2013"}, {"Title": "So far so good", "Author": "KATHRYN GLOTFELTY", "ReviewID": "R3RL3D2SQTOSQZ", "Overall": "3.0", "Content": "So far so good. I was looking for a simple \"point and shoot\" digital camera.  So far THis fills the bill", "Date": "February 22, 2013"}, {"Title": "Returned :(", "Author": "Richard W. Hager", "ReviewID": "R3KWHIUNOBPIZ", "Overall": "3.0", "Content": "I sent it back  a couple weeks ago. I thought it was a touch screen but the 4000 model wasn't. Beautiful camera though!", "Date": "February 19, 2013"}, {"Title": "So so", "Author": "Greg A. Wurst", "ReviewID": "ROZN8DRPA8DP6", "Overall": "3.0", "Content": "The previous Kodak we had in this price range beat it hands down. My 5 year old Sony kills this thing without even trying. The camera is slow and the options are so so. The image quality is ok. You get what you pay for. Don't expect much from it when you are only paying $100. I guess this will be our beater camera.", "Date": "January 16, 2013"}, {"Title": "i love it", "Author": "kakha", "ReviewID": "R29Y2QXQP0YMIP", "Overall": "3.0", "Content": "Birthday Present for my mom~ her very first personal camera. she love it very much.I love how compact it is and the fun colors it comes in.", "Date": "January 8, 2013"}, {"Title": "NICE CAMERA!", "Author": "JEN", "ReviewID": "R1UZV3TOPEKP2N", "Overall": "5.0", "Content": "I BOUGHT IT AS A GIFT. HE LOVES IT! HE'S HAPPY WITH IT. I DEFINITELY GOING TO RECOMMEND THIS TO ALL.", "Date": "December 26, 2012"}, {"Title": "Great camera for the $$", "Author": "Bri", "ReviewID": "R1RHO7SJP3OGZ5", "Overall": "5.0", "Content": "Bought this for my wife for Christmas and it has proved to be a great little camera for the price. I've owned Canon SLRs most of my life and put my trust in the name.  Works well for someone who doesn't want to do anything but turn it on and start shooting.", "Date": "December 26, 2012"}, {"Title": "Low cost, easy for kids to use BUT no SD card", "Author": "Ken Slaton", "ReviewID": "R2SHGMT9OUOATQ", "Overall": "4.0", "Content": "Like the product and ease of use. It wasn't clear that the SD card was missing or needed to be purchased separately. The Amazon ad shows what people buy with the product. Guess I was to know that the SD card was necessary item", "Date": "December 25, 2012"}, {"Title": "main factors why I brought this item", "Author": "Suss Smith", "ReviewID": "R2DI18GQDCHURO", "Overall": "4.0", "Content": "Price was main factor and it goes very well with my other canon products, is easy to use on the fly.", "Date": "December 23, 2012"}, {"Title": "Had a very good deal for a decent product", "Author": "bumsoo", "ReviewID": "R2KOJ7XS4D1RKP", "Overall": "4.0", "Content": "Nothing spectacularly good, but this point-and-shoot camera does what it is supposed to do.Great optical zoom makes it easy to shoot at my children's school events(can't always get a good seat),very Canon but still nice UI to manage photos.", "Date": "December 23, 2012"}, {"Title": "My Cannon Camera", "Author": "Ruth Watts", "ReviewID": "R2WPETMVWVH1T9", "Overall": "5.0", "Content": "Takes excellent pictures, easy to shoot even with shaky hands.  Easy to upload on computer to Facebook. I would recommend this camera to anyone.", "Date": "December 23, 2012"}, {"Title": "A very nice surprise.......", "Author": "Tai Pan", "ReviewID": "R5424YDUYWQ47", "Overall": "5.0", "Content": "The canon A4000 arrived yesterday 21 DEC ..... Opened box and started to read the basics of the camera .I started shooting and  what I found was pictures that were much clearer and sharper then I imagined....The colors were spot on , the clarity excellent... I shot indoors and outdoors ..Outdoors cloudy and grey..... So far very happy with the A4000 IS ..........I currently use a Nikon D70 SLR 6mp 1.8 50mm lens. and 18-70 zoom.... Lumix TZ-4 8 mp 10x zoom  Leica lens and now added the Canon A4000.....This should round our my Digital cameras......", "Date": "December 22, 2012"}, {"Title": "As what i expected", "Author": "B. Alexis", "ReviewID": "RPQDVDI6306NE", "Overall": "4.0", "Content": "Small, Compact, comfortable and able to fit in my pocket! Just what i wanted and expected. most of the controls are automatic which makes it the perfect point and shoot camera", "Date": "December 20, 2012"}, {"Title": "Love it!", "Author": "Trudy", "ReviewID": "R29JUZV146EC2L", "Overall": "5.0", "Content": "I love this camera. The best camera I've bought in all my life. Exactly what I was looking for. Has all the capabilities mentioned in the description bar.", "Date": "December 20, 2012"}, {"Title": "NO SD card included", "Author": "Kathleen Hudson", "ReviewID": "R1XUIGT9OEVJ89", "Overall": "4.0", "Content": "Well I bought this camera as a gift and thought I'd charge it for the big day, (Christmas).  That's when I discovered that it has no SD cards included and since there is no place to buy one nearby, I've got to make a special trip to find one.  I assumed I'd just missed that little fact when I read the description, but I just re-read it and couldn't find anything about it. So beware...", "Date": "December 19, 2012"}, {"Title": "Came as I directed.", "Author": "Craig E. Cain", "ReviewID": "R1BTPBRV59TSB0", "Overall": "5.0", "Content": "I gave this to my mother for Christmas.  She loved it.  A simple, easy to use camera for an 83-year-old \"techie novice\".", "Date": "December 17, 2012"}, {"Title": "Canon PowerShot A4000IS", "Author": "Steve G", "ReviewID": "R2476MP73YF3BQ", "Overall": "5.0", "Content": "Product was received in a timely fashion and performs as specified.  Picture quality is clear and the IS capability increases the quantity of clear pix even when the camera is not held complete still.", "Date": "December 17, 2012"}, {"Title": "Christmas gift", "Author": "Gran", "ReviewID": "R3O5SIRUJ2KOAJ", "Overall": "4.0", "Content": "Great value and grand daughter loves the pink color.  Gran dson also happy with the silver version.  Canon is very reliable", "Date": "December 17, 2012"}, {"Title": "I had a Nikon that gave golden cast to pictures", "Author": "cynthia walker", "ReviewID": "R1C2T6UUIOX29C", "Overall": "5.0", "Content": "I have tried this out and it seems to make much more color perfect pictures. I use it for a living and its important that it work properly. I hate my Nikon I purchased last year for my wedding.. its slow as christmas and it overcasts the pictures with a golden tone not good for legal photos and online photos... and a snazzy color to boot", "Date": "December 12, 2012"}, {"Title": "Functions weel enough", "Author": "Dennis 48", "ReviewID": "R1JEXB0MCK3S81", "Overall": "4.0", "Content": "This Cannon Power Shot functions well enough. A little small to hold real steady but the pictures have turned out well. I have found it difficult to get used to not having a view finder but I purchased to throw in a computer backpack and the camera seems to be durable enough for this function. I would buy again.", "Date": "August 31, 2012"}, {"Title": "Endlessly Confusing.......", "Author": "Stephen", "ReviewID": "R30XUHPX23GSBQ", "Overall": "1.0", "Content": "I cannot figure this camera out to save my life.  It seems to be stuck in auto mode and I cannot get it back into program mode.  It won't even give me the option.  The timer menu is incredibly frustrating and half the time it won't allow me to set the number of shots.", "Date": "January 19, 2013"}, {"Title": "Buy it now, on Amazon!", "Author": "Brooke", "ReviewID": "R2KM299ZXL5MAB", "Overall": "5.0", "Content": "Fantastic camera. Typically, although I enjoy owning a newer, nicer camera, there is a part of me that kind of dreads it. Because any time I buy a new camera, I have to take the time to figure out how to operate it. In my opinion, Canon, ( at least with this model ) made it easier. ( Not Apple easy ). The LCD screen is large, easy to see, everything seems to work right. Although some may be stuck on the fact that it is a little larger, and heavier than a lot of digital cameras, keep in mind, that extra size and weight equates to better quality. Similar to buying a smart phone. If an electronic device feels 'plasticy' and fragile, or is an off brand (you know, the brands that you can't seem to find on CNET), it may be cheap, but, you really do get what you pay for. Pay the extra 10 - 70 dollars, and get something that works, and lasts for a long time. If you really get lucky, it will last until it is out dated.", "Date": "June 13, 2013"}, {"Title": "mediocre pics", "Author": "Michele Gauthier \"meeshdawg45\"", "ReviewID": "R3UADWWKJ506B8", "Overall": "3.0", "Content": "The quality of the pictures from the camera really isn't great.  I also don't like that you can't just plug in to charge (wall outlet) but have to remove the battery and place it in it's charger.  We've brought the camera out multiple times and realized we forgot to put the battery back in after charging. The transition between taking pictures is kind of slow, too. I miss my Kodak!", "Date": "May 13, 2013"}, {"Title": "excelent camera", "Author": "Cesar", "ReviewID": "R1VFB4O4MKK62P", "Overall": "5.0", "Content": "its size, and the quality of the pictures are wonderful, and the price is really good to anyone who need a good cybershot.", "Date": "May 4, 2013"}, {"Title": "Feels cheap", "Author": "Eilene S. Cross", "ReviewID": "R19QD6WP9Z6PLE", "Overall": "1.0", "Content": "When I received this camera I was expecting a great CANON camera.  This camera felt cheap and flimsy and it didn't take good clear pictures.", "Date": "April 1, 2013"}, {"Title": "Very disappointed.....", "Author": "Jody Finnimore", "ReviewID": "RENRZJ00BMGX8", "Overall": "1.0", "Content": "My review has nothing to do with the camera itself....I've bought other Canon cameras in the past and have relied on their quality over the years and I'm sure this one will be no different.  My disappointment is with the condition of the camera I received.  When I opened the box, it appeared that the camera may have been one that was returned and someone, obviously, didn't check the box when they put it back in stock for resale.  There were items missing; however, the little plastic sleeves were in the box (empty) that I'm sure were supposed to contain those items.  The battery was already installed in the camera, with the battery protector just laying in the box.  When I took the camera out of the sleeve it was in, there was no covering on the screen on the back, to peel off....in fact, the screen appeared scratched and smudged.  I paid for a \"new\" camera and I was very disappointed to open the box and find, what appeared to be, a restocked item.  Yes, I know that stores put items back on the shelf when they're returned; however, I certainly would have expected a quality check before doing so.  This is my first bad review that I've ever given a product and I feel bad in doing so; however, there needs to be better checks put into practice before sending out an order when someone orders a new product.  I should add that  I don't believe this was the fault of Amazon, but the secondary store that they used to fulfill the order.  I am returning the item and have purchased the same item on Amazon, through a different seller.", "Date": "April 6, 2014"}, {"Title": "I HAVE BEEN CHEATED. SOLD A USED ITEM IN PRICE OF NEW ITEM.", "Author": "Aneesh Kumar Dhuwalia", "ReviewID": "RK2FUCAUOM3VS", "Overall": "1.0", "Content": "I have been cheated here. The seller has charged me a new camera price, but has sent me a old or used camera. i want to return camera. its totally cheating.  No once should buy any product from this sellar.", "Date": "November 8, 2013"}, {"Title": "Worst Camera Ever Made", "Author": "hwd", "ReviewID": "R3EQU50AG7N6HO", "Overall": "1.0", "Content": "I am obsessed with my cameras. I can go somewhere for a day and come home with 700 shots and I love it. I had a Canon camera prior to buying this one and loved it so this is not a diss on Canon. This camera is the worst camera I've ever held in my hand and that includes the old Polaroid instant camera I used to have as a kid. The flash turns itself off regularly. The auto flash simply cannot read when it's suppose to work IF it decides to stay on. It can't focus is completely incapable of taking pictures in low light settings and while shooting a video holding the camera in the same position it blacked out half the video I had taken and no amount of editing could ever get it back. I will buy another Canon but I will stay far away from this line. I promise you'd be better off just using your phone or a disposable camera or saving a little longer for one of the better Canon's don't waste your money on this one.", "Date": "August 30, 2013"}, {"Title": "Canon PowerShot", "Author": "R", "ReviewID": "R19454Z8WEVI2J", "Overall": "5.0", "Content": "I love the Canon products, this is our third PowerShot in our family.  A great pocket size camera, great picture quality.", "Date": "May 5, 2013"}, {"Title": "no good item", "Author": "Minhang Zou \"Roy3344\"", "ReviewID": "RNNWVIEKZ2I0M", "Overall": "2.0", "Content": "I buy many canon camera, but the Canon PowerShot A4000IS 16.0 MP Digital Camera is not good, it made in china, worse than made in japan", "Date": "April 4, 2013"}, {"Title": "flott vél", "Author": "Sædís Magnúsdóttir", "ReviewID": "R3IL6C5NF04FEZ", "Overall": "5.0", "Content": "erum bara rétt byrjuð að nota hana en líst vel á gripinn :o)Hún á örugglega eftir að reynast okkur vel", "Date": "February 5, 2013"}, {"Title": "Very basic camera", "Author": "deep123", "ReviewID": "R15HB1XZLWN7ID", "Overall": "2.0", "Content": "It is good for the kids not for the adults. Very basic camera having almost no controls. Check the specifications before purchase.", "Date": "December 25, 2012"}, {"Title": "Seller won't take back DEFECTIVE merchandise", "Author": "Amazon Customer", "ReviewID": "R3K03ZHS4PVE1A", "Overall": "1.0", "Content": "Just a warning to be sure that the return policy for an item is more than 15 days.  My seller would not take back a defective camera.  I have used Canon products for years and this is the only one that i have problems with.  The lens does not retract.", "Date": "December 12, 2012"}, {"Title": "Canon Camera", "Author": "Sandra L. Pattok \"Sandi Pattok\"", "ReviewID": "RSR8JEWXP7XQP", "Overall": "3.0", "Content": "I bought this for my 11 year old. I was unaware that she needed a card to use it. So we were both disappointed.", "Date": "February 20, 2014"}, {"Title": "Very nice features for a very reasonable price", "Author": "Stacy M. Schmidt", "ReviewID": "R2JPCY9XYJVMPY", "Overall": "5.0", "Content": "I purchased this camera to replace a Canon Powershot A460 that I had purchased in 2007. I liked my old camera, but was looking for more megapixels and more optical zoom (my old one had 5.0 MP and 4x optical zoom, whereas the A4000IS has 16.0 MP and 8x optical zoom). The A4000IS seems to have all the features I liked about my old camera, plus several new features. The A4000IS has a much bigger screen (3.0\"), which is great. My old camera used AA batteries, so I was always able to keep a few rechargeable batteries on hand in my camera case. I was worried that the special battery for the A4000IS (NB-11L) would prevent me from keeping a spare on hand. But, I found a generic battery on eBay for $4 and that seems to work just fine as a spare. The nice thing about these batteries (versus AA batteries) is that they seem to charge very quickly (in 30-60 minutes). I would definitely recommend this camera for anyone who is looking for a very reasonably priced point-and-shoot camera.", "Date": "May 3, 2013"}, {"Title": "Too soon to rate", "Author": "Jim James \"Jimmy\"", "ReviewID": "R3K0G8W478OW0X", "Overall": "4.0", "Content": "Christmas present so too soon to rate it. I will have to give it time to see results of pictures taken", "Date": "December 27, 2012"}, {"Title": "It broke straight away", "Author": "Todd", "ReviewID": "R242GZC6TF31KF", "Overall": "1.0", "Content": "The camera seemed fine at first, but then it won't even turn on now.  Battery shows full charge on the charger, but the camera is dead.  Less than a month.", "Date": "January 21, 2013"}, {"Title": "canon powershot A4000IS", "Author": "eugene  w. parker", "ReviewID": "R15JX9BMOSKWLE", "Overall": "2.0", "Content": "Very difficult to access the battery and chip. Also unable to use regular batteries. Indoor quality with flash very poor.", "Date": "February 6, 2013"}, {"Title": "Doesn't work like I expected", "Author": "John W. Figuerado Jr.", "ReviewID": "R1AVBXD9YHP0NS", "Overall": "1.0", "Content": "It was suppose to be easy to get good pictures in all light conditions. We are still getting blurry pictures. Also Beach Camera.com sent us the wrong order.", "Date": "December 26, 2012"}, {"Title": "Missing parts", "Author": "Winnie", "ReviewID": "R3MLBXIWHKIOB7", "Overall": "2.0", "Content": "I cannot understand why you would sell a camera with no memory  card. It was to be a gift and the recipient was not abloe to use it because it had no card. Poor, poor. poor!", "Date": "May 31, 2013"}, {"Title": "Ok camera, did not find pre set modes", "Author": "Sandhya Kaimal", "ReviewID": "R2CUJOO07HS6NG", "Overall": "1.0", "Content": "I don't know if i missed something but do canon cameras in general have a lot of preset scenes? this one comes with 2 modes- auto and manual.i looked and looked in the menus but did not find the usual list of preset scenes that are there in most point and shoot cameras..i mean that's what makes a point and shoot camera convenient, right?i returned this camera for a very different reason. bought it from amazon fulfilled seller - BPAV / Nirav corporation and the box came without any seal whatsoever. the camera was loosely packed and so were all the attachments- in simple unmarked plastic bags..it looked like a used item to me. if not used, certainly opened. i bought another camera from amazonSamsung WB750 12.5 Megapixel Digital Camera but even that one had the seal opened.so i dont know if it is an amazon thing. i decided to keep the other one anyway because i atleast like the cam.Overall, ok cam. decent pics, i have seen better image stabilization in other cams, and no clue about the pre set scenes.", "Date": "July 25, 2012"}, {"Title": "Not so great!", "Author": "Jennifer \"Too busy for bad products\"", "ReviewID": "R3DCMN7N1OLJZP", "Overall": "2.0", "Content": "I have had this camera for about a month.  I just reviewed the pictures I have taken and I think they are terrible.  I totally realize I am not a smart camera person so I really need a much butter point and shoot option.  This is not the answer for me.  I tried to play around with the settings but I can't get anything close as good as camera's I have had in the past.  Going to Best Buy to return today and really bummed.  I had a 35mm powershot from a million years ago that took great pictures.  I just need something easier.", "Date": "August 4, 2012"}, {"Title": "not good", "Author": "sheri", "ReviewID": "R87V2YWU94Y70", "Overall": "1.0", "Content": "I had an older powershot that was great, this one is horrible, the touch screen didn't work and the pics were blurry.", "Date": "June 19, 2012"}, {"Title": "Can't handle being outdoors", "Author": "Sarah", "ReviewID": "R3RI6WNZYLLXR", "Overall": "1.0", "Content": "I have only had this camera a month, dropped it in the dirt on accident, and now the lens is jammed and it is completely unusable. I hate customer service, regardless of the company, so I tried taking it apart myself but broke two belts in it on accident. I spent money on this camera which was desperately needed for other things, so it feels like a complete waste and let down. I am very disappointed that this camera is not as durable as other cameras I have owned in the past and currently own.Update: I dropped the camera while it was OFF in a round pen which you work horses in, which means the ground was sand. It is soft on the hooves and was soft on the camera, the camera just couldn't handle the dirt. The lens is hardly sealed at all so a lot of the sand went into it, and this in turn completely jammed it, this is what I mean by poor manufacturing, even though the camera was, again, OFF, a ton of sand went into the lens. I still have the first camera I ever used which is a, what I like to call \"crappy\" due to the noise and dead pixels it has, HP. It does not have a retractable lens, is not the size of a cell phone, and because of both of these features, it is incredibly durable, my mother had it since 2003 and bought it used from someone whom I don't know how many years they used it for, and gave it to me in 2007 when I was 12. The image quality was probably superb in its days, but now it is really bad and nothing compared to modern cameras, but it would be fantastic if they could combine durability and image quality, I would buy that camera for sure. I am extremely disappointed that they have sacrificed durability for image quality. I guess I'll have to use my crappy HP until I find a higher quality and durable alternative. I really hope Canon sees my review and puts it to good use, until then, I would not recommend this camera for outdoorsy people or people who just get down and dirty, as this camera can't handle it.For durability, I recommend these two cameras:Fujifilm FinePix Z30 10MP Digital Camera with 3x Optical Zoom (Black)Hewlett Packard PhotoSmart 315 2MP Digital CameraIf you have any other durable camera suggestions, let me know. Might start collecting them since they are such a rarity. :)", "Date": "June 20, 2012"}], "ProductInfo": {"Price": "$199.00", "Features": "3-inch LCD display\n16.0 MP Image Sensor, DIGIC 4 Image Processor, 8x Optical Zoom, 28mm Wide-Angle lens\n720p HD video recording with a dedicated movie button\nSmart AUTO with 32 predefined shooting situations, Intelligent IS with six modes to optimize image stabilization\nHelp Button provides simple explanations and easy controls of your settings\n8x Optical Zoom with 28mm Wide-Angle lens and Optical Image Stabilizer deliver stunning images.\n16.0 MP Image Sensor, DIGIC 4 Image Processor, 8x Optical Zoom, 28mm Wide-Angle lens\n720p HD video recording with a dedicated movie button\nSmart AUTO with 32 predefined shooting situations, Intelligent IS with six modes to optimize image stabilization\n3.0-inch LCD\nHelp Button provides simple explanations and easy controls of your settings", "Name": "Canon PowerShot A4000IS 16.0 MP Digital Camera with 8x Optical Image Stabilized Zoom 28mm Wide-Angle Lens with 720p HD Video Recording and 3.0-Inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51vFgiu-tBL._SY300_.jpg", "ProductID": "B0075SUFSC"}}