{"Reviews": [{"Title": "Novice who didn't spring for the DSLR", "Author": "vandagal", "ReviewID": "RCNUY6V98SGJH", "Overall": "5.0", "Content": "I am enjoying the camera very much.  I am a mother of 3 and a teacher. I contemplated getting a DSLR Nikon or Canon as that is what most of my friends use.  However, I have limited \"learning time\" and came aross this camera as it was a lightning deal on Amazon.  I ordered it after reading the reviews, thinking I could return it if it was a lemon.  I am so glad I took the chance.  I see that this camera has many of the same features as a DSLR just in a smaller and easier to handle package.  I am just getting acquainted with the basics but I am also learning how to adjust things manually by getting on Pinterest and looking up things like \"white balance\" and \"ISO\".  I think I'm going to get a lot of use out of this little camera.  The pics. I have taken so far of my kids and pets are above and beyond my expectations.  I had a little compact digital camera from Panaaonic before and this one blows it out of the water!  If you are looking to move forward in technology but don't want to lug around a larger DSLR (or spend massive amounts of time learning how to use it), this camera just might be for you.", "Date": "November 13, 2012"}, {"Title": "Just great!", "Author": "Stefano De Andrade", "ReviewID": "R3BN25WUOJ5MSI", "Overall": "5.0", "Content": "This camera takes outstanding pictures and videos. I also have a Canon T3i but I wanted a compact camera that I could always take with me. The decision was difficult.. I was thinking of a lumix since I used to have one and it was great too but the specs of this one caught my attention. It takes sharper pictures than most other compact cameras, super-macro and 24x zoom work perfectly. It also works great at low light situations even do you cannot manually change the shutter speed. It's ridiculously light and it feels real nice on your hands. The magic filters are fun if you're into that. Compared to my T3i this camera is right up there. It's very easy to use. Burst mode feels like firing a machine gun.. I'm really satisfied with this camera.. Now I'll give my T3i a rest.. If your looking into photography this should be a great way to start.", "Date": "June 20, 2013"}, {"Title": "Great Product!", "Author": "Minzy", "ReviewID": "R30C8XNQSA0JK8", "Overall": "5.0", "Content": "This is one of a kind camera.  You can take video and pictures simultaneously and with so many features and functionality that you cannot find in other camera and yet it is easy to use.  The quality of the combined pictures (16M) and videos (1080p) resolutions can be achieve clearly in single shooting.  Very handy as no need to have a separate camera and videocam to take in any occasion.  Wow, I'm amazed of this product.  I believe Olympus set a standards for all camera with multiple recording features and functionality.", "Date": "January 4, 2013"}, {"Title": "Great Value-- A Lot of Camera for the Money", "Author": "Kindle Customer", "ReviewID": "R2ENV865CVPKDH", "Overall": "5.0", "Content": "Takes great pictures. This camera has everything I was looking for--  long zoom, good for close shots, not too heavy/bulky, HD video capability and much more.  I also like that it uses lithium battery.  I've had negative experiences with rechargeable AA type batteries, even the pricey ones.  The li battery on this camera lasts and lasts.  Feels good in my hands; just the right combination of functionality and carry-ability.  This is my 3rd Olympus camera and I've been more than satisfied with all of them.", "Date": "May 12, 2013"}, {"Title": "Really love this camera", "Author": "Zen Dinh \"Zen337\"", "ReviewID": "R1ZYXO888CGCPF", "Overall": "5.0", "Content": "I really love this camera, it did an excellent job in taking pictures and recording video in HD. The video recording came out even better than my other sony hdr-cx210 camcorder.Colors produce much better, i got a $50 rebate when it just came out.", "Date": "August 15, 2012"}, {"Title": "My most awesome camera ever", "Author": "Brian-STL", "ReviewID": "RAUK1VAZTU8YF", "Overall": "5.0", "Content": "I bought this right before a trip to the UK and Ireland. The most awesome camera ever, and I am still getting used to the settings and modes.  Beautiful pictures, full 1080p HD video, easy to use.  Granted, I am a longtime Olympus fan, but I just love it. AND the guys I bought it from (Beauty of RevaleSkin) came through to get it delivered in a very short time so I could take it on the trip.", "Date": "October 23, 2013"}, {"Title": "Great little Point and Shoot.", "Author": "Brian Bear", "ReviewID": "R3U8WM200GJYKF", "Overall": "5.0", "Content": "I am very pleased with the quality of the photos I have taken with this little camera. It is easy to use, easy to hold, small and light enough to fit in my pocket. I bought this one for my summer vacation.", "Date": "June 1, 2013"}, {"Title": "Superb.", "Author": "R. C. Moore", "ReviewID": "RGITR25V7UL6I", "Overall": "5.0", "Content": "Awesome optics. Easy to navigate menus. If you're an Olympus user, there's very little learning curve.  A dream come true.", "Date": "June 6, 2013"}, {"Title": "Great Camera!", "Author": "El Gallinazo", "ReviewID": "R3EOGIMGDD5AA5", "Overall": "5.0", "Content": "First, I must admit that I am not the world's best photographer - only a little more advanced than point and shoot.  I finally decided to replace my 10 year old Cannon PS 2S IS with a new camera.  The Cannon takes 4 AA metal hydride batteries but has limited power life, is rather large and bulky, has a 12X optical zoom, a very small monitor, and 5 MP max res.  I wanted to replace it with a very compact camera which I could carry all the time, which had higher resolution. a more powerful telephoto, a large, clear monitor, and which took a single lithium replaceable battery with a long power life.  I bought this Olympus as a factory refurb through ebay for $129 and am ecstatic with it in every respect.  Last week I took a handheld head portrait of a friend at about 60 feet distance at the maximum 24x optical zoom in normal daylight and loaded it onto my iPad which has the super high res retina screen.  When I expanded it to the max on the iPad, I could actually see individual hairs in perfect focus!  I was amazed.  One disappointment with the Cannon which I haven't tried with the Olympus is telephoto in dark conditions, so I can't comment on that.  My only two negatives is that it doesn't have a viewfinder to use under super bright sunlight which can drowned out the monitor, and if this is what I can buy for $129, it's scary to think of what the NSA can do.", "Date": "February 18, 2014"}, {"Title": "Awesome!!!!", "Author": "Derek Mendez", "ReviewID": "R3UCIEVSPSTVK8", "Overall": "5.0", "Content": "Love my camera, great quality, very easy to use, gives a lot of features to use, etc. N/A N/A N/A.", "Date": "December 31, 2013"}, {"Title": "Olympus sz-31MR.", "Author": "Fidencia", "ReviewID": "R37FUSC3WJ864W", "Overall": "5.0", "Content": "I gave this camera 5 stars because the performance is over and above for such a small camera. Has lots of features from taking a photo to edit a pic.", "Date": "July 8, 2013"}, {"Title": "Works wonderfully.", "Author": "Duane", "ReviewID": "RD52KK1SW2JHE", "Overall": "4.0", "Content": "I only hold off on giving it 5 stars because I have only had it a few months, but it is taking great pictures.", "Date": "May 22, 2014"}, {"Title": "olympus sz-31mr camera", "Author": "Diane Kitzmiller", "ReviewID": "R2LSBE18HXHYBS", "Overall": "5.0", "Content": "small enough to carry in the woods while hunting. zoom is quiet and great for nature shots. camera works great and pics are clear. glad i bought it.", "Date": "May 18, 2014"}, {"Title": "Compact , fast, clear sharp pictures", "Author": "Dano", "ReviewID": "RG4UVDGK7KE8L", "Overall": "5.0", "Content": "I love this little camera, and it did not require the long learning curve of a full body digital SLR.  Great telephoto shots od my house projects, and really convenient to pull out to get sudden nature shots too", "Date": "April 12, 2013"}, {"Title": "SO HAPPY!", "Author": "Brandie", "ReviewID": "RY6EF1FRF1G7A", "Overall": "5.0", "Content": "This is the best Camera from Olypus that I have purchased yet!  I absolutely love the stabilzer on it.  No matter what I get a clear shot every time.  The zoom is amazingly clear. Easy to use, small and light weight and actually easier to keep a hold of it with this design.  I HIGHLY recomend this camera to everyone and especailly those that might not have as steady a hand as they would like.", "Date": "December 9, 2013"}, {"Title": "Doesn't quite do what it claims!", "Author": "magnetman", "ReviewID": "R119N2IXHRHI07", "Overall": "2.0", "Content": "Very Disappointed with product.  Can't shoot still photos with video in Hi-res (1080P 60). When using Hi-Res (IAuto Setting) the flash does not engage!  Too many querks with this camera. Don't believe what Olympus video shows!  Left several emails and received no responses to my questions. Gave it 2 stars because it does take nice pictures but could have been much better if the features shown in their video were obtained in an easier manner (if they really work at all)!  Still don't understand how the auto flash does not go off in an auto setting within a totally dark room!  Owner's Manual is not printed and does not provide enough info online.  Save your money!Update.....Flash would not fire in Iauto setting even though the camera set to automatic flash. Went into a totally darken room where I could not see my hand in front of my face and the flash would still not fire!  Spoke to technical support and they told me the camera was defected and it would take up to two months to get it back!!!  Amazon was nice enough to take the camera back and offer a full refund!", "Date": "May 30, 2012"}, {"Title": "Going back to my canon", "Author": "Anna H", "ReviewID": "R3JV0NS9S7550G", "Overall": "1.0", "Content": "I was hoping that the zoom and the video would work well.  However, when I tested it out the anytime you had to zoom you can clearly hear it.  When I tested to video it had a weird clicking sound.  Overall, the quality and make was not worth it to me.  I returned the camera and the additional battery I had bought.  It was a good thing I bought it through amazon.  I'm going back to my Canon.", "Date": "July 8, 2013"}, {"Title": "Great camera", "Author": "Kimberly", "ReviewID": "R2EWS6WFQI4LQV", "Overall": "5.0", "Content": "I bought this for my husband and he absolutely loved it.  He did reluctantly return it because it didn't have the HDR features he was needing, but otherwise an awesome camera.", "Date": "December 19, 2012"}, {"Title": "Sold a gray market camera.", "Author": "Dan - Managed Property Services", "ReviewID": "R90BUK4AWB0PB", "Overall": "2.0", "Content": "I was sold a gray market camera. The charger cord was the 240 volt European style and Olympus USA was not able to match the S/N for a USA warranty. I contacted Amazon and Preetham said \"While we shipped your order, the inventory was provided to us by a seller, and I'm not able to send you a replacement.\"I would probably like the camera more if I could charge the battery to use it!", "Date": "May 3, 2013"}, {"Title": "ok", "Author": "Adilson Carlini de Araujo", "ReviewID": "R23TDW2R1ZGWK6", "Overall": "5.0", "Content": "I like Olympus SZ-31MR 16MP CMOS Camera with 24x Wide-Angle Zoom and 3-inch... arrived in time correct and I am very happy!", "Date": "January 9, 2013"}, {"Title": "Don't recommend this camera", "Author": "Patty Terry", "ReviewID": "R4A961J3WMFCA", "Overall": "2.0", "Content": "The SZ-31MR is noticably heavy.  In addition, when this camera arrived, it was missing the USB cable for downloading pictures.  I'm still trying to resolve the issue.", "Date": "February 23, 2013"}, {"Title": "Great specs..hard to hold", "Author": "sance", "ReviewID": "RCD2ARBSHD8A0", "Overall": "3.0", "Content": "Love the specs and features, but the big negative is the size.  I have medium size hands and the camera is a hard to hold.I would not buy this camera if I had been able to hold it.  I would opt for a larger dlr.  I have a full size dslr but it's too heavy.I need to find a happy medium.", "Date": "October 22, 2012"}], "ProductInfo": {"Price": "$399.99", "Features": "16 MP Cmos\n24x wide-angle zoom\nMulti-Recording Function\n3.0\" 920k Hi-Res LCD Touch Panel\n7 fps (16MP) High Speed Sequential Shooting", "Name": "Olympus SZ-31MR 16MP CMOS Camera with 24x Wide-Angle Zoom and 3-inch 920k Hi-Res LCD Touch Panel (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41sXMJis4UL._SX300_.jpg", "ProductID": "B00763EUWI"}}