{"Reviews": [{"Title": "Silver is the way to go.", "Author": "Len", "ReviewID": "R2VKBUA3ZVVE6V", "Overall": "5.0", "Content": "If you have the money, then get the silver Limited Edition. There are several reasons why I made this choice and am very happy I did.  First if you're not sold on the Pentax K-5, let me state that this is as of this date (7/25/2012) the K-5 has the highest rated APS-C sensor of any camera. It has a low ISO of 80 and a high ISO of 51200. Pictures taken at ISO 12800 still make good 8x10 photos and possibly larger if touched up with software. The camera itself is the smallest weather sealed magnesium alloy bodied DSLR out there. And being small doesn't mean feeling small either. The ergonomics of this body are second to none. The hand grips groove is spectacularly comfortable and the grip is designed so it can fit even larger hands. If you're still wanting larger bulk you can get the battery grip to increase the feel and size. The menu has a very easy access lay out as do the positioning of the buttons. Since before getting this camera my experience with DSLRs were with Nikons it took me some getting used to having the front dial adjust shutter speed and the back one doing aperture but this is fine. And unlike Canon it has a front dial instead of one on top which to me is just uncomfortable.  Now if you're skeptical about Pentax as a brand let me tell you this. Pentax was the first company to bring the 35mm SLR. They've been around forever. They like to do things a tad bit different than the two bigwigs and when you look at it, it makes sense. The K-mount has a long lineage so you have 60 years of lenses at your disposal. Pentax uses SR (shake reduction, which with canon/nikon is IS or VR) in the body rather than the lens so you don't have to pay extra for a lens to get this feature. It also means even lenses from the 70's can have SR. Where other brands all went the no mechanical contact between lens and body route, Pentax has the screw drive motor which is a little noisy but makes focusing much faster than the basic lenses of other brands. If you're not sure about pentax making quality lenses then think again. The Pentax Limited primes are about the highest build quality you can find in any lens out there made from aluminum, and the DA* lenses and the WR line are weather sealed to face all conditions. On top of that Pentax just won J.D. Power's highest customer satisfaction award for a camera company, which means the people who buy Pentax are more pleased with their product than the people who buy elsewhere.  Now for things that make the silver edition the edge over just the regular black one. As far as this kit vs. the black kit, this one takes the cake. I think having the 40mm 2.8 xs is far better than having the 18-55 lens. The 18-55mm however is WR so if you're planning to get in the rain or go through dust storms then you might reconcider, but having a large aperture and the EXTREMELY thin build of this lens is an absolute winner. Color wise there are several reasons to have the silver. First it just looks nice. It looks retro and a salute to all the Pentax (and other brands) cameras of the past. Second Pentax has made a lot of silver accented lenses in the past so those would match this perfectly, where they would look awkward on the black one. Finally if you thought the color was all just aesthetics think again. It really makes me wonder how we got to the point of having nothing but black cameras. I live in Phoenix AZ and it gets hot here. The silver body deflects heat to a considerable degree which helps keep your camera from overheating.  In the end if you can afford this particular version of the K-5, get it! it's worth every penny. Plus there are worse ways to spend $1600 (Canon 7D body). If you're on a budget then the black one is at a very good value these days.", "Date": "July 25, 2012"}, {"Title": "Pentax has moved up.", "Author": "Eric", "ReviewID": "R2D69TBVFC8PE0", "Overall": "5.0", "Content": "Low noise at high ISO, 7 fps, multisegment metering are top features. Versatility for various styles of photography. The silver brings a classic appearance leaving people wondering whether it is film or digital.  Excellent purchase.", "Date": "December 29, 2012"}], "ProductInfo": {"Price": "$1,599.95", "Features": "Limited Edition Silver Body\nHigh Resolution 16.3MP CMOS Sensor\nSpeedy 7 FPS Captures Fast Action Shots\nHigh Sensitivity 80-51200 ISO Range\n1080p HD Video at 25 FPS", "Name": "Pentax K-5 Limited Edition Digital SLR Camera with SMC DA 40mm f/2.8 XS Lens (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51-QHrAM2cL._SY300_.jpg", "ProductID": "B007QG5LR8"}}