{"Reviews": [{"Title": "Review: Panasonic Lumix ZS15 12.1 MP 16x Digital Camera Vs. Canon SX230 HS", "Author": "Randy Wakeman \"Randy Wakeman\"", "ReviewID": "R3CL3FPSUM4YFF", "Overall": "5.0", "Content": "Review: Panasonic Lumix ZS15 12.1 MP 16x Digital Camera Vs. Canon SX230 HS(Please note: embedded images are not possible, so I've uploaded a few of the referenced images here on Amazon separately, along with several other representative images.)From left, the Panasonic ZS-15, Canon SX230, Sony HX5V, and a Panasonic ZR-3. There isn't a huge difference in envelope dimensions. Only the older ZR-3 is significantly slimmer.From the back, the thin profile of the ZR-3 is easily discernible. Between the two primary subject cameras discussed here, the new ZS-15 and the SX230, there isn't enough difference to worry about.Recently, I reviewed a battery of compact point and shoot genre digital cameras suitable for hunting and the outdoors. The losers were the Nikon S9100 for poor build quality, very poor video, and sounding like a tractor when you operate the zoom. Not a healthy tractor at that. The Sony HX7V exhibited truly sea-slug slow shooting performance. The middle of the road was taken up by a previous Sony model, the Sony HX5V, while connecting to a PC with a truly wacky proprietary Sony adapter, often took very good pictures, is well-built, but is still noticeably slow compared to several Canon and Panasonic models. The winners were the Canon SX230 overall (easily) with an honorable mention to the older Panasonic DMC-ZR3 for its slimness, responsiveness, very low price, and excellent battery life . . . noting that the more current, but similarly performing Panasonic DMC-FH25K model was quite a bargain at its $140 street price or even a tad less.The Canon Powershot SX230, with its 14x optical zoom range, has produced some very good images for me. There are situations where the 14x zoom just isn't enough, like the above image of turkeys shot from the far side of a clover field. For extended zoom range without additional bulk or great cost, the new Panasonic ZS-15 has the potential to fill the bill.In this genre of camera, it only makes sense to compare it to similarly configured cameras with similar envelope dimensions at similar price points. It makes very little sense to try to compare it to a camera with only 3, 4, 5, or 6x zoom. Nor does it make any sense to compare it with a bulky camera that isn't fitting into a pocket.Most of the 2012 \"travel zoom\" models are out and as usual, there is a mix of hits and disappointments in what is called the travel zoom category, generally compact point and shoot cameras with 10x or better zoom ranges, often including a GPS. Already, a few of the newer models can be safely deemed a step backward. Inexplicably, the Nikon 9300 adds a GPS to last year's 9100 and along with that dubious feature adds an even more dubious 16 megapixel sensor. Currently, it is way overpriced at its $345 street price and wouldn't be competitive even if it was a hundred dollars or so less as far as I'm concerned. As a sad bonus, the image quality from the Nikon 9300 has taken a nosedive, even at base ISO.Last year's Sony DSC-HX9V has been replaced by the DSC-HX10V, cramming 18 megapixels onto its tiny sensor resulting in a loss in image quality along the way. Still selling near its retail price of $329.99, it doesn't compare favorably to Canon and Panasonic product. The new Canon SX260 stretches the optical zoom of the SX230 from 14x out to 20x, it runs $300 as of this writing, and it also adds a plethora of new scene modes. It is easy to generally recommend the SX260 as it yields essentially the same performance as the SX230 with the same sensor. It is an incremental improvement, though, and if the 14x zoom of the SX230 is enough for you the remaining SX230's are a bargain at about $199 street price. 100% crops give a slight image quality benefit to the SX230 as well: something subtle enough to go unnoticed in a full image.You might be wondering when I'm going to get to the Panasonic ZS15, so am I, but I'll get there. Though Panasonic has generally been credited with pioneering this branch of digital camera, their 2011 offerings fell flat. The DMC-ZS10 was described as 'doing everything right except take good pictures' by one reviewer, Jeff Keller, which about sums it up. The 2012 flagship Panasonic super-zoom, the DMC-ZS20, gets Panasonic back in the game with a 20x zoom, a comparatively full-featured GPS, currently offered at the equally full-featured price of $325 or so. While I debated, I decided it wasn't worth reviewing the ZS-20 compared to this Lumix ZS15, a comparative screaming deal at $230 street, or less.What you give up in saving a hundred dollars is what I find of little value: the GPS, the longer zoom (16x is generous enough), and stereo video recording. If anything, the ZS15 nets you slightly better image quality, better battery life (no GPS or touch screen) and you lose little else. There is no particular reason to avoid the 20x ZS20, I've tested one example, but the more fiscally conservative folks will say that the so-called \"downgraded\" ZS15 is no downgrade at all for hunting and outdoor use-- and general use for that matter.The ZS15 uses the new sensor from the Panasonic FZ-150 (a very, *very* good thing) coupled with the lens and body from the ZS-10 (not a bad thing). The sensor obviously boosts image quality, the precise area where the ZS-10 stumbled so badly.It has been often said that Panasonic has the best artificial intelligence algorithms in the point and shoot camera segment. Their iA (intelligent auto) mode is industry leading, in my opinion. It is as close to \"set it and forget it\" as can be found. The Lumix ZS15 uses a higher resolution LCD screen (460,000 pixels) compared to its earlier and cheaper models, keeping pace with the Canon in pixels, and foregoes the sometimes annoying pop-up flash in favor of an integral camera body flash, an approach I prefer for general outdoor work particularly.Sony has long had the \"sweep panorama\" mode, still ignored by Canon, but finally added here by Panasonic. The battery life of 260 pictures (CIPA Standard) is not shockingly good, but is above average and no GPS or touch screen drain is present. Markedly better than the Nikon 9300 (200 shots) a bit better than the Canon SX230 / SX260 (230 shots), but not close to the Sony HSX-10V (340 shots). Note, however, that the Canon / Nikon / Sony numbers are all estimated with their GPS units turned off. One other useful mode, the High Dynamic Range mode, is added and it is surprisingly effective in difficult lighting conditions.According to Panasonic, \"the Intelligent Zoom is an extensive zoom function using digital zoom, however, you can even draw the subject 2x closer than the original optical zoom with minimum deterioration of image quality thanks to the Intelligent Resolution technology. This means the 16x optical can virtually extend to 32x equivalent.\" 16x zoom is a goodly amount of zoom as is, a notch better than the 14x Canon SX230. I'm very hesitant to call it as good as true optical zoom, it isn't, but it appears surprising close and in the rare instances where you really need 32x for a still, you've got the shot. It does extend the versatility of the camera.At 4.13 x 2.27 x 1.31 inch, the envelope dimensions of this camera are slightly more compact than many and the .46 lb. weight with battery and memory card is also appealing. On the negative side, ostensibly to save money, Panasonic has gone to in-camera battery charging which not only puts the camera out of commission but is unbearably slow compared to wall chargers. Consider the addition of an optional wall charger an absolute must, along with an extra battery. Those planning extensive video capture should consider an extra battery or two mandatory. As the temperature outside drops, so does battery life along with it.I am hesitant to put prices into a digital camera review, as they can change drastically overnight. By the time the holiday shopping season rolls around, you'll likely see some impressive deals based not on camera quality or performance, but just what is left in inventory that needs to be moved to make way for the next year's wonderments. It can be worth waiting for, if you are on a budget. The bad news is that the most popular models may well get sold out and don't make it over to the price cutting stage. If the 20x zoom and GPS holds great appeal for you, you may well want the ZS-20 for the extra c-note. Same situation with Canon, the extra zoom, extra scene modes, and handling features might be worth the hundred dollar upcharge for the SX260 vs. the SX230. It isn't for me, but that is why they call them choices. So, I'll compare last year's winner, the Canon SX230, directly to this Panasonic ZS-15 which should help make the differences a bit more clear.Battery life: Panasonic wins.Battery charging: Canon wins, as supplied, with an included speedy external charger.Zoom Range: Panasonic wins on both ends.Size / Weight: Advantage to slightly shorter Panasonic, but by the very smallest of margins. No practical advantage either way.LCD screen: The Canon's 16:9 screen is better for video than 4:3 stills, the reverse is true in the case of the Panasonic. The Canon screen has substantially better viewing angles; apparently the ZS-15 screen is of the \"twisted nematic\" variety.Video features: Canon has high speed video modes for lower-resolution slow-motion video. Canon also has stereo sound, but the stereo separation on pocket mega-zooms is not distinct. Panasonic lacks these features, but does have better 30 fps HD video vs. the 24 fps HD of the Canon.Sensor: Sensor size is the same, the dinky 1/2.3 inch common to many compacts. Both are about 12MP effective resolution, both are of the latest BSI / CMOS type. The \"backside illuminated\" genre of sensors is no gimmick; while still tiny they are a noticeable jump ahead of CCD sensors. Note that the $600 FZ-200 uses the same mini-sized 1/2.33 sensor as the ZS-15.To test the intelligent zoom, I shot representative pictures of my utility box on a windy, rainy day from a laser-verified 43 yards. The pictures were taken at the 5M mode (2560 x 1920) and resized with no cropping to 640 x 480 for web use. First, the Panasonic ZS-15 that yields an indicated, astounding, 37.9x zoom.The same was done with closest Canon mode (2816 x 2112) also resized with no cropping to 640 x 480.Both shots were made hand-held in the wind. The more I experimented with the ZS-15 the more it became apparent that the intelligent zoom is no gimmick, but an immensely useable feature. For close images with perfect lighting conditions, many compact digital cameras do a perfectly fine job for snapshots. For typical portraits and family events, speed isn't always important, and you can often get as close as you need to be. Slow focus, slow shot to shot times and overall sluggish performance has been the stopper for several otherwise enjoyable cameras, particularly several Sony models. Last year's Canon SX230 was a substantial improvement. This year's ZS-15 from Panasonic addresses the weak link of previous Panasonic compact long-zooms, that being poor image quality. In doing so, it has not just closed the gap with Canon and Sony travel zoom cameras, it has leaped ahead by a good margin.Again handheld at 37.9x \"intelligent zoom,\" this unsuspecting robin was snapped from across my front lawn with the ZS-15. The image, despite being handheld, is surprising sharp considering the aggressive \"intelligent\" zoom. Without any cropping or retouching, it was resized to 800 x 600 for this web page.One of the promised technologies incorporated in the Lumix ZS-15 is the \"shoots through glass\" mode. Here, shot through my front window, a squirrel comes out to enjoy an after rain-shower snack.As you might be guessing by now, the just-released Panasonic Lumix ZS-15 exceeded the shooting performance of the already excellent SX230 handily, with far greater capabilities and noticeably faster operation. There isn't much to find fault with, but I'll try. The turtle-slow USB charging is a step backward and \"genuine\" Panasonic branded batteries are overpriced. You can solve both issues by picking up a Wasabi Power charger and twin pack of batteries that are rated at 1200 milliamps, compared to the OEM 895mAh for 27 dollars, which is exactly what I did. The supplied Panasonic software is both \"wizard-crazy\" and forgettable. The full manual is on CD, and like most I'd prefer a bound copy. These issues are only niggles at best. Yes, the Panasonic 460K could be better in the viewing angle department, there are much better 921K LCDs out there as on this $335 Sony Sony Cyber-shot DSC-HX20V 18.2 MP Exmor R CMOS Digital Camera with 20x Optical Zoom and 3.0-inch LCD (Black) (2012 Model)though Panasonic at least partially combats this with \"Power LCD\" (bright) and \"High Angle\" modes.The ZS-15 captures essentially noise free images not just at base ISO, but also at ISO 200 and ISO 400. It produces far better images at ISO 400 than some older, larger sensor cameras, like the Nikon Coolpix P7000. Concert enthusiasts will consider the ZS-15 a dream come true, as it isn't much more than set the ISO to 400 or 800 in Program mode, and you're there. ISO 800 images print as dazzling 8 x 10s, although at the 100% crop level ISO 400 captures are cleaner. To give you an idea, at ISO 800 a picture of my computer monitor, in a dimly lit room, at 3x zoom hits 1/160 second shutter speed: more than sufficient for most any concert use. In very dark conditions, the \"Handheld Night Scene\" mode blazes away, cracking off four images then forming a composite that is pleasing at ISO 1250, though like any composite it often isn't the best for moving subjects.For a fast-operating, long zoom camera that is easy to slip into a pocket and has the ability to take shots you never thought you'd get, effortlessly, with a wondrous artificial intelligence mode, the ZS-15 can only be described as a screaming deal at $230 or less. By comparison, most other travel cams feel underpowered, non-responsive, and sluggish as in the \"processing\" screen of doom when you would really like to take another shot. It is truly rare to have a pocketable long-zoom digital camera that just gets it all right, but this new Lumix ZS-15 is as close as I've ever experienced.As a footnote, I took care of the extra battery and external charger needs with this: Wasabi Power Battery (2-Pack) and Charger for Panasonic DMW-BCG10, DMW-BCG10E, DMW-BCG10PP and Lumix DMC-3D1, DMC-TZ6, DMC-TZ7, DMC-TZ8, DMC-TZ10, DMC-TZ18, DMC-TZ19, DMC-TZ20, DMC-TZ25, DMC-TZ30, DMC-ZR1, DMC-ZR3, DMC-ZS1, DMC-ZS3, DMC-ZS5, DMC-ZS6, DM...Memory cards get faster and cheaper with regularity. At the current pricing, it is hard not to use 16GB cards (ideal if you pan on capturing some video) but 8GB cards are fine for most if still images are mostly what you are after.I'm personally amazed that you can get a camera this darn good for $150 (12/2012 pricing). I was quite satisfied with my first unit @ $230, no one could possibly disappointed at the current $150 threshold. As far as \"better\" cameras, sure . . . there will always be better if you can tolerate larger and more expensive units. If larger, a bit heavier, and more expensive (but still compact / fixed lens) is no barrier, the Panasonic LUMIX DMC-LX7K 10.1 MP Digital Camera with 7.5x Intelligent zoom and 3.0-inch LCD -  Black is worthy of your consideration. I've reviewed it on the linked page.Copyright May, 2012 by Randy Wakeman and Randy Wakeman Outdoors. All Rights Reserved. Images referred to in the text in their entirety can be viewed at the Randy Wakeman Outdoors website. Additional images have been uploaded here at Amazon, with no post capture enhancement, just as they came out of the camera, for your consideration.", "Date": "May 2, 2012"}, {"Title": "Best of the Lumix Series", "Author": "ImageMD", "ReviewID": "RV6FJRG7UVVSG", "Overall": "5.0", "Content": "The Lumix series of Panasonic pocket cameras have a loyal following. This is my fourth Lumix, preceded by the TZ3, TZ5 and ZS5. The ZS15 is by far the best of the series. Although the hardware of the ZS15 sports several improvements, I find the greatest improvements are with the software.Let me describe six of the features which I really like:a. Custom Function Switch: This allows for 4 user selected settings. I set the C1 to a burst of 3 images at different exposures for HDR processing. These 3 images shoot rapidly, at a much improved rate. (I find the in-camera HDR almost useless). I set C2-1 to the night image mode which allows for in-camera processing of four images to reduce the noise of the high gain on the sensor. You will be amazed at the images you can take with this feature.  I set C2-2 to the horizontal panorama from left to right. I set the C2-3 to the vertical panorama from bottom to top. As with the night images, you will quickly fall in love with these features.b. The Time-Lapse Video:  By shooting video in the miniature mode of the Creative Control menu, you can record time lapse images at 2 second intervals.  The camera saves the time-lapse video in .MTS format. A convenient red button turns the video recording on and off.I did not buy the more expensive ZS20 because I do not need the 20x zoom, the GPS, the 16MP sensor or the touch screen.  I'm indifferent to some of the other new features. The 12MP images have more pixels but I find that the processing requires more sharpening. The smaller size of the ZS20 would have been convenient but I've gotten used to the original size. The charging via the USB port means I will not need to carry the charger with me when I travel, but I did like the possibility of having a spare battery in the charger. You cannot operate the ZS15 while it is charging. The camera has a built-in demo program and Panasonic includes a comprehensive digital manual on a CD. A new feature has the description of most menu selections scrolling across the bottom of the screen.In summary: I am very happy with my ZS15 and would recommend it to nearly everyone, professional, semi-pro or amateur. There are many good reviews if you want to make a side by side comparison of features with other cameras or with the ZS20.", "Date": "June 3, 2012"}, {"Title": "An absolute winner and quality product!", "Author": "Spicerpro", "ReviewID": "RKHDXVYMRTABS", "Overall": "5.0", "Content": "I loved this camera right out of the box! I own mid-size digital SLR's and previous Panasonic pocket cameras. For my purposes, the Lumix DMC-ZS15 is the best of both worlds.This P&S; sports a distortion-free 24mm wide angle with an amazingly sharp 383mm zoom. The auto-focus is very responsive and works as one would hope. Image stabilization is accomplished through the lens and works well when shooting video, especially at long focal lengths. The Intelligent Auto Mode is a wonderful feature when you just want to shoot and move on. And yet, the manual controls offer excellent control when you need it. Low-light shooting is terrific.Like with any new camera, you get use to the menu layout as you gain experience using it. Of course, reading the manual front-to-back serves as a necessary overview, plus there are neat features you would not otherwise know exist.The video performance is excellent. As a professional filmmaker, I particularly appreciate the true 29.97 frame rate. Previous Panasonic models were 30 fps, which played havoc with DVD's and BRD's. The dynamic range of the MOS sensor is much better than previous CCD's I have owned. Also, the audio is clean and quiet at 48,000 kHz.I could go on and on about my sheer delight with this camera. My only suggestion is that they include an external battery charger rather than requiring users to charge in the camera. For that reason, I bought a Panasonic DE-A65BA Battery Charger and Panasonic DMW-BCG10PP ID Secured Battery. Charging time is much faster and the extra battery is a must if you plan on doing a lot of shooting.The Lumix DMC-ZS15 is highly recommended!", "Date": "May 4, 2012"}, {"Title": "Upgraded from the FH-5, very pleased!", "Author": "Nicodimus", "ReviewID": "R3HX36IL8OUOGQ", "Overall": "5.0", "Content": "Disclaimer: I am a complete novice and am approaching the review from the perspective of someone who will be using the camera for very basic things, with the Intelligent Auto mode on the vast majority of the time. Last year, I purchased the Panasonic Lumix FH-5. I wanted a very compact camera that could take good, quick pictures while I was out hiking. In general, while I was pleased with the FH-5, two glaring weaknesses became apparent: poor battery life and an underpowered 4X optical zoom. For an upgrade, I wanted to stick with a Panasonic Lumix, so I examined both the ZS-20 and the ZS-15. Ultimately, I went with the ZS-15 for a few reasons: I hate touch screens, I had no use for the GPS feature of the ZS-20, it was using a great sensor (the same one found in the FZ-150) and it was $80 cheaper.I am happy to report that I got pretty much exactly what I wanted with the ZS-15. It has a 24mm-equivalent lens, allowing you to get great widescreen pics for a point-and-shoot. While it is noticeably bulkier than the FH-5, it's still JUST small enough to slip into my pocket as I go hiking. The battery life is *much* improved over the FH-5...I swear it seems to last twice as long. I also like the fact that you can just plug the camera in to recharge it now, rather than removing the battery and messing with an external battery charger. The most impressive thing about this camera to me is the zoom. The 16X optical zoom really knocked my socks off, coming from the 4X of the FH-5. Even better, the iZoom feature allows you to get up to 32X zoom (according to the camera, anyway...I see another review here that mentions it is actually more.) This does not seem to be just another useless digital zoom gimmick, but a really useful feature. Now that I don't have to get very close to wildlife to get a picture, the animals don't get scared away as quickly and I wind up with much better photos of them. I took and labelled sample pictures of a distant house at no zoom, 4X, 8X, 16X, and 32X to show you the difference, so please review them up top. They were all taken handheld, with the camera in intelligent auto mode.Although it initially sounds like a downgrade in image quality (16MP for the FH-5 vs 12MP for the ZS-15) I cannot see any dropoff, even looking at the pictures on a 61\" HDTV. I guess the better sensor makes up for the lower MP photos. In fact, the ZS-15 allows you to get 40% closer on macro shots than the FH-5, and they look fantastic. I still take my photos in the 16:9 aspect ratio, and with the quality setting on 'fine' I can get 1834 photos on my 8gb card, compared to 1485 on the FH-5. Since I can't see any difference, it seems like I just got another 349 photos worth of capacity. There are not a ton of bells and whistles on the ZS-15, and the interface is simple, but that's exactly what I wanted. I played with the video recording a little bit, and although I will rarely use it, it seems quite nice. You can zoom in and out while recording, but it does so slowly (I think this is intentional, so that the lens motor noise isn't as noticeable in the sound of your video.) The only really obvious weakness of this camera that I see is that it struggles in low-light situations and produces noisy, yellowish images in darkened areas. (This may correctable by manually adjusting things, but I'm only using IA mode since I don't know what I'm doing.) The FH-5 was even worse in this regard, and I knew about this issue before buying and just accepted it. Overall, I am delighted with the ZS-15 and it does what I need it to do very well.Update: If you are looking for a semi-hard case to protect your camera while it's not in use, I found a good one. It's a universal case by Kodak that fits this camera perfectly. The UPC is 041771753283 (Google it to preview.) It's just plain black without any logos, and has a zipper. I found mine in wal*mart next to the digital cameras, but places like best buy also sell it. It runs about $15.", "Date": "May 3, 2012"}, {"Title": "A fabulous automatic point & shoot that rivals more expensive \"bridge\" cameras.", "Author": "OldPhotoGuy", "ReviewID": "R2LJFPUMTS309Z", "Overall": "4.0", "Content": "After years of being a Canon guy, Panasonic won me over last year with their Lumix FZ35 \"bridge\" camera, a top of the line, compact zoom that looks like a DSLR but has no interchangeable lenses and lets you shoot totally automatic or go manual. Without making this a FZ review, those cameras take fabulous still and  HD videos automatically that will please the most fussy photographer. That Lumix line is still going strong with plenty of budget point choices for the serious amateur. I should note that I entered the digital world six or seven years ago with my prized all-metal body Canon SD450 Powershot Elph, a 5 mp little wonder that is a tiny terror that continues to take great stills and videos. So why am I buying another with two pleasers in my collection? Like a DSLR, my FZ35 is a bit too bulky to tote around daily for spontaneous shots, it's best reserved for the birthday, holiday, special event shots I take at home. So being a camera junkie, I thought it was time to treat myself to one of the hundreds, perhaps thousands, of new, updated pocket-size cams that have come out since I purchased my Canon SD450 about 7 years ago. Specifcally, I was looking for a bigger LCD, longer optical zoom, better low-light sensitivity, preferably with one of the new CMOS sensors vs CCD, more megapixels to handle enlargements, and HD video (at least 720p which computers like) with zoom and continuous autofocus capability. These features are easy to find today, and frankly are on almost every point and shoot camera you might be considering over $100.  The one thing I will likely lose from the old Canon SD450 is the viewfinder, as most manufacturers have discontinued giving you one on the point and shoots. But that's OK, my other cams have them if I encounter a serious outdoor bright light problem, or I could throw on one of those nifty folding combo light hoods and screen protectors for about $10.So how did I find the Panasonic SZ15 out of the way-too-many choices? At first, the challenge seems daunting. Every manufacturer makes so many variations of the same camera, that it's a project in itself to figure which feature was dropped or added between model A and B. Therefore, I take a 3 step process to narrow down my choices. First of all, I go to the Amazon Best Sellers list for the category to see what is ranked #1, you can't argue with the marketplace, it's generally pretty accurate. The number one seller was the Panasonic ZS20, the model above the one I bought. The ZS15 is one step below and anywhere from $30 to $65 cheaper depending on the price you catch it at. I got mine for $165, currently it's $199. But the ZS15 was ranked #38 on that list, so why did I buy it? I probably wouldn't have if I had only used that best seller list. However, my next step was to Google up some professional reviews on the ZS20. A good reviewer will usually mention nearby models and steer you in the right direction. In this case, the reviewer loved the ZS20 and stated if you didn't need the GPS function, which tells you forever exactly where that pics was taken on the map, buy the ZS15 because it will save you money and essentially you have the same camera as the number one seller. I wasn't interested in GPS, so I followed his advice, and he was absolutely right! As a final check before I ordered it, I looked up the consumer reviews. Both the ZS20 and ZS15 had 4.5 stars and glowing reviews, so I purchased it. Had I only used the best seller list, I would have never considered the ZS15 as it was way too far down on the list. But I believe this kind of thing constantly happens when camera manufacturers make so many similar models, many get lost in the shuffle, or buyers simply buy the \"loaded\" one to make sure they have everything they need as they learn to use the camera. Forgive me for spending so much time on the choosing process, but I hope this may help others from overlooking better,wiser, less expensive choices by doing just a little more research prior to purchase.Now for the camera itself. I've owned it about 5 days now and so far I am very pleased. It's a little thicker than many pocket cameras, but I love the metal body and controls, it speaks quality out of the box. Mine was made in Japan and they still build good cameras there. The controls set-up and software is similar to that of my upscale Panasonic FZ35 so the learning curve to use and understand all was short for me. I figured the best test was to shoot the same pics and videos using the FZ35 (which is about twice the price of the ZS15) then download the results on my computer and do side-by-side comparisons. And that's exactly what I did. All shots were done set on IA or P or Macro, both with and without flash on.  I have to say the ZS15 shots were amazingly close to ZS35 shots, whether I was doing stills or videos. In fact, most people probably couldn't tell the difference and would be totally delighted. If the FZ35 is a 10, I'd rate the ZS15 a 9. The autofocus system worked perfectly both on close-up and on video, as well. The ZS's sound is mono vs stereo on the FZ's, but it too is not detectable on the computer view. I shot in 720p mode on both which is MPEG-4 on ZS15 whereas the FZ35 is MOV.com. Both formats looked great on my computer screen, though you may have to download a viewer like KMP or VLC instead of using your built-in Windows movie viewer. The ZS has a neat auto-retouch and creative retouch feature. With the push of a button it will show you an alternative look, and if you like it you can save it without losing the orgininal shot. Both have dedicated movie buttons to start and stop, and yes, you can zoom during video shoots.  The Leica lenses do their cameras proud in both cases. The macro shots with the ZS15 were quite amazing, fabulous detail, even when it settled on that mode itself using the IA setting, which I believe stands for Intelligent Automatic mode. One quick negative side note, instead of the traditional battery charger, the ZS15 comes with a cord that charges the battery in the camera using either AC or your computer's USB port. This is a bit inconvenient, especially for charging back-up batteries for special events, so I'm going to buy a charger for it on Amazon along with a back-up battery and that problem will be solved for very little money.That's all I have to say for now, so if you're looking for very well built, mostly metal, pocket-sized point and shoot camera that will automatically give you pictures that will rival some of the best bridge and entry level DSLR's, I'd recommend this one.  If you need GPS, then spend a little more and get the ZS20, otherwise this Panasonic ZS15 is a great buy and a real performer.", "Date": "September 25, 2012"}, {"Title": "Pretty d@mn good camera!", "Author": "E. McDougall \"Hoser lost in america\"", "ReviewID": "R1X05L03DR72ZY", "Overall": "4.0", "Content": "I bought the Fuji F505/F550 EXR - nice camera to use, but soft in the corners and a lot of noise and noise reduction. Replaced it with a Nikon S9100 - POS as far as I'm concerned; couldn't focus at 18X no matter what the light, couldn't get anything other than a blurred, un-printable photos even at wide angle - likely the camera was not working right; I'm not sure. I don't think anyone would accept it's output; I sure hope it was defective.So, I took a risk and ordered the ZS15 - no-one had even seen it at the time; it was an \"unknown\" - all I knew was that it had Panasonic's incredible Power OIS, which beats the cr@p out of any other IS system; and it had the same sensor as the FZ150 - which again, beat the cr@p out of any other current 12 mp sensor.Well,... I am not disappointed. The pics are sharp, well exposed, and overall, infinitely better than the shite I was getting from the Nikon. Noise reduction is there, don't think you'll avoid it, but it's not an issue at normal print sizes; OIS is a marvel and even 1/4 second photos are sharp. Videos are quite good; no problems with the \"jello\", and the OIS works well. The user interface takes a bit of getting used to but it does everything I want it to.I have found my jewel in the rough - it's going to be the companion to my dSLR from now on.....", "Date": "March 12, 2012"}, {"Title": "Amazing for its size and price!", "Author": "RangerDog", "ReviewID": "RINKA810IWY16", "Overall": "5.0", "Content": "After a mishap took my last pocket camera, I found a deal on Nikon's S6300. It had great features, was small and looked nice. But the photos and video were just so disappointing, an unwelcome surprise after having enjoyed other Nikons over the years. After two weeks of studying the manual and trying different settings, it was returned.I've had a Lumix DMC-TZ4 before and remember the Leica lens was pretty impressive. Well, combine that with a fast sensor and some incredible features and the ZS-15 has me enthralled. The iA setting works for the overwhelming majority of shots. The HDR feature does a better job with high contrast situations than some pretty expensive competitors. The lens is impressive and not only is the 16X optical great, but the optical image stabilizer and Intelligent Zoom make this the first digital camera where I've ever used the digital zoom, at least more than once!The object tracking feature does a remarkable job of getting moving objects like pets, kid and cars in focus. (This was the biggest downfall of the S6300. Anything that moved became blurry even in bright sunlight.)Video quality is also amazing. Here again, the image stabilizer makes most hand-held shots look like they were shot on a tripod. Although AVCHD looks great on my TV, it's too difficult to deal with on the computer, so I'm going to stick with the MP4 setting. It's great to have a choice, though.For viewing photos or video on a flat screen TV, I ordered a 10' HDMI-Mini HDMI cable. This was less than $5 on Amazon and works great with the ZS-15: Premium Canon Mini HDMI cable (10 ft)Also, I get no hissing or buzzing in the video whether or not I'm using zoom. The microphone picks up sounds quite nicely and yet doesn't completely boom when I do something like try to narrate. And, unlike other cameras I've used, doesn't seem to make those rumbling noises when you change your grip on the camera.Technology has certainly improved in the few years since I bought my last digital camera. But after that first discouraging purchase, Panasonic has me enthralled again. It's got more features than I can remember how to use. The most important thing though is, it takes a nice, sharp photograph or some pretty fine HD video. At this price point, this seems like a real winner.", "Date": "May 13, 2012"}, {"Title": "A really SUPER P&S; Zoom", "Author": "Recorder \"eclectic ear\"", "ReviewID": "R34SDPR7N14YC5", "Overall": "5.0", "Content": "I really can't add too much more in the way of technical details to some of the great reviews already posted here, but I wanted to insure that my 5 stars would be counted.Actually, Randy Wakeman was one of the deal sealers, thanks Randy!I purchased my 1st Digicam in 2004, after years of being a Nikon 35mm slr fanboy.I loved my Panasonic DMC FZ3, and till recently, still used it from time to time.I relaced the FZ3 with a Canon Powershot \"A\" series digicam that was more pocketable, but never fully embraced it due to limited zoom, and really poor low light performance, not to mention, it sucked AA batteries dry in no time.A few months ago, while strolling around BB, I spotted a Nikon S8200, and was quite impressed with the size & zoom.I was infected, I had the bug, I craved a new \"Travel Zoom\".Started comparison shopping the Nikons, Canons, and Panasonics on Digital Resources, and Steves, as well as dpreview.After downloading sample images, and comparing them on my home pc, I went to Fry's & BB to get some hands-on time.I've got to say, the ZS15 was a wize choice, and it fits my needs almost perfectly.It fits really well in my jersey pocket when I'm out biking, and with it's fast power up, and shot to shot performance, it is a great little camera.I primarily use it in P mode, and keep the exposure at -1/3 ev, to minimize blown highlights.With some experience, and practice one can achieve very good low light indoor exposures without flash.So what is the only real drawback?Well, as with all the present day P&S; cams, there is no viewfinder, and it is a real challenge to compose a shot in direct sunlight, while straddling my bike, with wraparound sunglasses!Problem solved!! I read many positive reviews on dpreview regarding a device called  the \"Clearviewer\". It screws on to the tripod mount, and unfolds to the back of the camera actually giving all the benefits of an Electronic Viewfinder, and it lets you see the LCD display in the sun.I'd suggest anyone reading this to google clearviewer, and check out the product. I have no affiliation with Clearviewer, but I just received mine last week, and it just plain works!So, that concludes my review of the  DMC ZS15. As with any product, I recommend you go to a brick & morter store, to get a feel for the actual camera, but trust me, you won't regret buying this sweet little zoomer!", "Date": "August 13, 2012"}, {"Title": "High quality \"pocket camera.\"", "Author": "L. Gregory \"Linda\"", "ReviewID": "ROK67KEXZP00C", "Overall": "5.0", "Content": "I have owned Panasonic superzoom cameras for about eight years--the FZ50, the FZ 28 and the FZ 100, so I am a big Panasonic fan.  I usually shoot in RAW in the superzooms, but decided to forego that capability for the convenience of having a camera I can carry with me at all times.  After researching many of the Panasonic compacts, I decided on this camera.  It has enough megapixels (12.1)to make 11x14 or 11x17 prints, the size I usually print, as well as a long enough telephoto, 16x zoom.  I don't really need the GPS and 3D capabilities of the ZS20.  I like to take portraits of my friends' dogs on our walk in the morning.  The prints I've given them have turned out beautifully--excellent color and very sharp.  I would recommend this camera to anyone.", "Date": "May 16, 2012"}, {"Title": "the best X2, Pan ZS15.", "Author": "wichita lawyer \"wichita lawyer\"", "ReviewID": "R925DXGWJEPKG", "Overall": "5.0", "Content": "Got rid of my Nikon 9100 2 weeks after buying the ZS15. Nikon screen better but the ZS15 does everything else better. ZS15 has best menu setup in business. Preset ISO at 400, great pictures, no noise. Set IR very sharp pictures. Set C1 for flash, you're good to go. Video is very smooth. Camera is very fast,fast. After market batteries work great. Buy a couple & a wall charger at Amazon for $20 & a screen protector & go take great pictures.Note, don't buy this camera if: you want more zoom that you can't keep steady;need more pixels that slow write time;really need a second microphone 1\" from other mike; want to play with a pop-up flash that doesn't work at 10';or if you have an extra $70-100 burning your pocket. DO buy the ZS15 at a great Amazon price, take lots of pictures/video & buy a second ZS15 for your spouse who will say, better than her treasured TZ3, & my this digi-cam is f, fast. Read the camera mags, the ZS15 is Camera of the year (you will not miss waiting for a stupid GPS program to eat your battery & tell you your hienie is not on first base).", "Date": "April 18, 2012"}, {"Title": "ZS20 and ZS15 comparison", "Author": "Ashlea Beers", "ReviewID": "R2O4YEVWR5GQ70", "Overall": "4.0", "Content": "I purchased both the ZS20 and ZS15 to compare the two cameras and decide which one I like better. Since the ZS15 was significantly less expensive than the ZS20, I decided it was worth trying both. As far as I can tell, the technical differences between the two are A) 20x optical zoom vs 15x optical zoom, B) 14.1 MP vs 12.1 MP, and C) the ZS20 has GPS but the ZS15 does not.As most casual, yet technically savvy, photographers already know, the 2 MP is not going to make a huge difference at this level for day-to-day picture taking. As for me, this camera is to take pictures of family (usually kids) and of nature/wildlife. We live in Colorado and spend a lot of time in the mountains taking pictures of the scenery and wildlife, so a good optical zoom was very important for me. I've never blown up a non-professional picture bigger than 11x14, so the megapixel difference was a wash for me. Another big requirement I have is decent picture taking in low light. It's not like I'm trying to take pictures inside, at night, with the lights off - but it would be nice to take pictures in a room with dim lighting without the flash making everything look funky or getting picture after picture with people's eyes closed.Out of the box, I started taking pictures with both the iA mode and various different \"scene\" modes. Honestly, on both cameras, I found most scenarios to have the same experience and quality. However, with taking pictures in EXTREMELY low light (with a light on behind me but no lighting in the room of the subject I was taking a picture of) were quite different between the two cameras. It seems that the less light in the room, the longer it would be for the camera to take the picture after pressing down on the button. There was a much longer delay on the ZS20 in this circumstance, and it was extremely frustrating. At first, I even thought I wasn't pressing the button down, but I was. The ZS15 still had a delay, but not quite as long as the ZS20. I tried this in both iA and multiple scene modes and had the same result. Again, this was extreme, as I was doing it in a room with almost no light - I could not even see what I was looking at through the LCD screen because it was so dark. I'm sure this can be corrected with manual settings, but I am not going to kid myself into thinking I'm going to learn the finer technical points of photography overnight. I couldn't tell any difference between the two cameras when it came to nighttime scenery with light (a dark street with streetlights) or natural daylight pictures.Sometimes I was very disappointed with the picture quality, but it was not the camera's fault. I know this because if I changed the settings, the same exact picture would look EXTREMELY different. If I didn't know any better, I would have thought the pictures were taken with two separate cameras. The reason I mention this is that I think this camera has fantastic potential. If you are willing to take the time to learn about cameras and the different settings to use in particular conditions, this will be an amazing camera. This is something I want to do, but I also wanted something that will take very good pictures out of the box using the default modes that are built in. If you are unable or unwilling to fiddle with changing to different presets and figuring out when to use those at the very least, I do not think this camera will be good for you. I am very excited to learn how to do the manual settings as I think this will take this camera to an even higher level. Again, the potential seems very high.As far as the zoom goes, the 16x vs 20x was something I was very curious about. Can I zoom in more on the 20x? Well, duh, of course I can! Enough to justify the cost difference? Eh, not so much. Optical zoom is very important to me, but 16x was more than enough to fulfill my needs. I just didn't think the extra zoom was worth it for me. The intelligent zoom is very good on both cameras to go beyond the optical zoom, which surprised me. I was able to take hand-held pictures at full zoom on both cameras without blur. Even taking pictures of a full moon on full zoom were quite impressive.The touch screen I didn't find particularly good. It's one of those that you kinda need to depress a little, which to me is not a sign of a very good or responsive touch screen. However, a touch screen on this camera that is similarly responsive as a high-end smartphone I think would cause a lot of accidental touches. So in this case, the touch screen is neither a plus nor a minus. I could go without it but it does not detract from it either.THE BOTTOM LINE:* Decent camera out of the box. It is definitely not a good choice for the older crowd or people who are not very technically inclined. If you can't program your DVR or set up a home wireless network (which to me are incredibly easy and basic things), then this is not for you. Stick with a Kodak EasyShare or a Canon PowerShot, which are more user-friendly from my experience.* Lots of potential with manual settings if you are willing to learn more than the average camera user to get the most out of your camera.* Optical zoom is fantastic for the camera size and price point.* Manual settings give this camera a significant advantage over similar cameras in this price range.Should you get the ZS20 or ZS15?I ultimately decided to keep the ZS15. I do not care about the GPS on the ZS20. For optical zoom, 16x already met my needs and I do not think the 4x extra zoom was worth the money. The 2 MP difference between the two cameras shouldn't matter for anyone that is specifically looking for this class of camera (an affordable, compact, point-and-shoot). If you really want the GPS or 4x more zoom, by all means get the more expensive camera - it just wasn't worth it for me. With the money I saved by sticking with the ZS15, I can get a new video game and a 12 pack of my favorite microbrew :)", "Date": "November 30, 2012"}, {"Title": "Is it better than a Canon?", "Author": "C. Self", "ReviewID": "R2UOXA1WTYTAQW", "Overall": "4.0", "Content": "My intention of this review is to help previous Canon users looking to branch out:While I come from a family of photographers and camera lovers, I am in every way an amateur.  I typically have a camera in my hand (especially with an almost 2 year old daughter), but I always stick with the point and shoot variety; I just want to quickly capture a memory, and I want the camera to do the work for me.  My entire life I have loved and purchased Canon.  In fact when my latest camera broke (the powershot A3000 IS), I planned on buying the Canon elph 110 hs.  Just before I ordered though, I happened across a good deal on the Panasonic Lumix dmc zs8 which led me to start investigating the brand further. But I was desperate to make a decision quickly as my daughters 2nd birthday is days away.I compared the Canon elph 300 hs, canon elph 110 hs, panasonic lumix dmc zs8, zs15, & zs20.  Beware though, the prices on these seem to change frequently.  Already Amazon has this one $25 cheaper than what I just paid.After deciding which canon I wanted, I compared the panasonics amongst themselves:zs8 vs zs15The zs8 seemed liked it was a little outdated, but has great reviews!  I was able to play around with it in Best Buy, and really liked the dedicated fast zoom button (meaning it jumps to extreme zoom in a split second), but that was replaced by a dedicated video record button on the zs15 (so the zs15 lost this feature entirely.)  Both cameras feel exactly the same, and minus the zoom/record button, they have the same functional layout. The zs15 includes new options like 3D photos (which I doubt I'll ever use.) The zs8 has more mega pixels at 14.1 versus the 12.1 of the zs15.  But please remember I am a TOTAL ameteur who just happens to love photography, so this wasn't a big deal for me.  Most of these terms are beyond me, and while I try to research how each makes one camera better than another, I still get confused.  So in the end, I'm simple; I compare reviews on amazon and good old google search, user posted pictures, cost, and overall funtionality.  I decided the quick zoom wasn't important, and at a currently cheaper price and equally good reviews, I decided for the zs15.zs15 vs zs20Again these 2 cameras seemed similar whereas the zs20 was about $20 more expensive.  It includes feature like GPS which will link your pictures to the location they were taken, stereo sound recording versus the mono of the zs15, greater zoom at 20x versus the zs15 16x, 14.1 mega pixel, touch screen functionality and lots more...but all of that is beyond my real need and usage, so again I decided for the cheaper side of things.  I also worried that the more gagets like touch screen, the more things that could malfuntion eventually.  But for those who are more in the know and would actually use those features, $20 could be a real deal and the zs20 might be a better purchase.Now why I chose the lumix dmc zs15 instead of the elph 110 hs?1. I wanted to give something else a chance bc I wasn't in love with my last canon2. I loved the bulkier feel of cameras a few years ago that made it easy to take pictures one handed.  The panasonic while still easily a pocket camera, has a fantastic grip hold that current point and shoot canon's just don't have.  No it is not as small as the elph, but this was not a negative for me.3. I've read mixed reviews of the canon's flash placement.  Panasonic seems to have fixed this entirely by putting the flash on the other side.4. Canon has taken their mode choices off the top of the camera and put it into the menu.  This seems tedious.  Panasonic has left their's on top.5. I take a lot of motion/action shots of kids/pets.  I knew for sure the Panasonic would keep these shots blur free.6. the zoom - 110 hs's 5x vs zs15's 16x...there was no question7. Canon's have been getting slower in their point and shoot digital cameras.  Missing the next shot because you're waiting for the first to load became increasingly annoying.  I was pleasently surprised to discover the zs15 shoots quickly with VERY little lag between shots.8. the zs15 on/off switch vs the 110 hs on/off button.  A simple thing, but the switch actually seems better aka faster and easier.9. panasonics have some internal memory, so you don't HAVE to have an SD card every second.  None of the canon's in my experience work like that.Now to the actual product usage versus a typical canon:We're just starting out, but so far I am a happy camper.  Right off the bat, the zs15 in iA mode takes crisp, clear, bright pictures.  There's not much to say here since it's so new, but it does exactly what I'd like it to, it's simple, and it holds very easily.  I'm looking forward to playing with it more to discover all it's capabilites.There are a couple things I find annoying simply bc I'm not used to them:1. this camera charges the battery IN the camera by plugging into the wall.  I'm used to a seperate charger and multiple batteries so you can charge one while still using the camera.  I was worried this would be the case, but couldn't/didn't find out for sure until I received the camera in the mail.  It's a hassle, but I'll make it work.2. as far as I can tell, you cannot delete a picture in camera mode.  I'm used to being able to delete a picture immediately if it was a crap shot. This will eventually lead to more work later as I tend to take a TON of pictures to get that one good shot of a moving kid.  If that function exists in the zs15, I haven't discovered it yet.There is so much more to compare amongst these cameras, and I just didn't have the time and the knowledge to understand it all, so I'm afraid I can't do it true justice for all you camera/photography buffs.  But for the casual user and someone looking to branch out from canon, I hope I gave you a useful comparison.**UPDATE 10/11/12**After a weekend with a zoo trip and a 2nd birthday celebration with lots of picture taking, I have a couple more observations:1. using the \"scene - baby\" setting on the zs15, some of the pictures appear more washed out than I'm used to when using my old canon with a similar setting.  I suspect this isn't really a camera problem though; I'm thinking it's probably more user error, and the more I get used to the setting, I hope to fix this issue.2. deleting pictures & SD card class - at the zoo I discovered how much I miss being able to delete a picture right away. After a bad shot I would try to switch over to \"picture/viewing\" mode to delete right after and would frequently get a symbol that looked like pictures downloading and a message that I could NOT delete/edit pictures yet.  This became really annoying when I reached the max of my SD card; I just wanted to delete some pictures to make space and move on.  Unfortunately, I got this message multiple times taking several minutes each to actually complete the download.  In the world of kids and animals, those minutes are precious, so I ultimately relied on a family member's camera, and knew to better prepare next time.  Afterwards I remember reading a review about these cameras doing better with a higher class SD card.  I didn't (and still don't) know much about that, but when I discovered a class 10, 8 GB SD card at Walmart for about $15 I went for it.  The class card I had previously was a 4.  So far, I haven't received that \"download\" message at all with this new card.  So you may find a higher class makes a difference for you too.  This was not an issue I had at all with any of my canons, but something I can easily prepare for and get used to working around.", "Date": "September 29, 2012"}, {"Title": "Wonderful point and shoot for under $200 US", "Author": "PoetDoc", "ReviewID": "R1HCE2EQZ9WZA4", "Overall": "5.0", "Content": "I am really enjoying this camera. I read a lot of reviews before making my purchase, on Amazon and several other sites. While it usually came in behind the Canon S100 (which looks like a mighty fine camera), I was looking for something under $200 US. The Canon is a lot more expensive and while it shoots in raw, I'm not ready for that. Also, I chose the ZS15 over the ZS20 because I didn't care about GPS and it seemed that the reviews indicated the picture clarity was a smidgen better on the 15. I read a review that complained about this camera in low light situations and I have found with the right settings I have gotten off some amazing shots in low light - but then, I don't have SLR expectations of a limited aperture point and shoot. I have never had a camera with a 16x optical zoom and that has been amazing. The auto focus is very responsive and I have gotten some good zoom shots of insects on flowers that I never could have gotten without the zoom. You can look around, but I don't know if you can come up with a better point and shoot (with the extras it comes with) for under $200 US.", "Date": "July 21, 2012"}, {"Title": "Good as far as it goes", "Author": "now what", "ReviewID": "R34YAI9GVXAJYO", "Overall": "4.0", "Content": "I got my ZS15 today, charged the battery, and took test pictures, both indoors and outdoors.  I only shoot video about once every two years, so I didn't test that feature.NOTE: I have now had the ZS15 for a couple of weeks and have shot several hundred pictures.  Nothing has happened to change my original comments, except for one observation on full zoom under \"The OK\" below.The good:--Very clean design, functional layout, full controls, well built.--Smooth operation, seems to power up quickly.--Surprisingly good IQ.  Very low noise at low ISO, both indoors and outdoors.  I had good natural light; I don't expect low noise from a P&S; in bad light, so I didn't go there to any extent.  Did take a few shots indoors with flash in fairly low light; flash pictures were good and noise was acceptable.--Very good IS.  Even at slow shutter speeds (1/30) you could get a good clean image.--Beautiful natural colors on WB auto (shooting indoors or outdoors, good natural light).--Nice and compact.  This will make it easy to use with an underwater case.--The Macro is very good.  If you want to be a spy, use this camera to photograph documents.The OK:--Burst at 5fps wasn't 5fps.  It was a bit over 4fps for 4+ frames, then settled in at a steady 2+fps (with some variations and hiccups).  I only continued for 20 seconds, but it appeared capable of continuing until the card fills up.  Not outstanding, but it will do.--Like many P&S; cameras, seriously overexposes in bright natural light.  The solution is simple: set EV at -2/3, ISO 100.  This resulted in perfect exposures and really brought out the excellent natural colors.--In-camera charging is glacially slow and of course you can't charge the battery and use the camera at the same time.  Simple solution: a charger and a spare battery or two.  I always use non-OEM chargers and batteries and never have had a problem.--Can't see the screen in bright sunlight.  Just like any other P&S; LCD--although I think this LCD is a bit easier to see than my old Canon SX100is (which I have sold, mainly for that reason).  I may invest in a hood/magnifier, or Clearviewer.--At full zoom, images are very clean and detailed at 100% or more out to about 150 yards; beyond that distance the small sensor may or may not deliver good detail, depending on the subject, lighting, heat waves, areas of extreme contrast, etc.The bad:--Burst at 10fps wasn't noticeably quicker than 5fps.  I won't bother with this feature.  And at only a few frames at the alleged 10fps, it's not very practical in any case.--AF isn't totally reliable.  At 10fps, it was totally UNreliable.--Really weird smearing of detail at long distances using full zoom.  (Full zoom at shorter distances didn't exhibit this defect.)--No RAW.  This makes it harder to fix any defects in the image.--The flash casts a huge shadow, caused by the lens, on any Macro or closeup.  This is a real design defect, and will definitely limit what you can do with this camera creatively.  Not a problem over a couple of feet away, but it shouldn't exist at all.--When zooming or panning with video, the AF can get confused and take some time to find the right focal length.Many reviewers mention the ZS15's sensor, which is allegedly the same as the sensor in the very good FZ150.  This may be true.  But compared to the FZ150, the JPEGs are smaller (4+mb instead of 5-6mb).  This means less information has been retained, which may be the explanation for some of the problems with smearing.  Also, images taken at the same setting and distance/zoom, weren't as clear with the ZS15.  Some of this could be the lens, some could be in-camera processing.  But the fact is that same sensor or not, the IQ of the ZS15 in most comparable situations is not as good as the FZ150.  Nevertheless, I did get a few shots with IQ indistinguishable from the FZ150 (mainly medium-distance, medium- to full-zoom).  I mention all this for the benefit of people who may have been led to believe that they're getting a mini-FZ150, minus some bells and whistles, at a bargain price.  This camera is pretty good, and a bargain, I think, but it's not a mini-FZ150.Bottom line: I paid $165 new for this camera, and it's definitely worth it.  At full retail ($279) I might well send it back because it has too many issues.  But for what it is, at this price, I'm happy.", "Date": "August 27, 2012"}, {"Title": "Great Except When Wide .......", "Author": "Frank Saragnese", "ReviewID": "R2ESOTW603MBLU", "Overall": "3.0", "Content": "After a lot of research I bought this camera. I think it is a great camera except for the main and most important reason that I bought it. Image quality at extreme wide angle(24mm on 35mm equivalent)is poor on the sides. At this setting only center portion was sharp and both sides(aprox. 25% in)were quite noticeably softer then center. At other settings of lens(slight wide, normal, telephoto)it was fine. I have returned it.", "Date": "June 29, 2012"}, {"Title": "Most reviews miss a key feature of this camera", "Author": "David of Lombard", "ReviewID": "R3GAO9GNCZ3H1X", "Overall": "5.0", "Content": "IMO, there are two pocketable megazoom cameras on the market with the highest image quality.  They are the Canon SX260 and this Panasonic ZS15.  In addition to high image quality (the most important feature IMO), both cameras are about the same size (large end of pocketable) and both have about the same optical zoom.  However, there are still reasons to choose the Panasonic ZS15.  The main reason for me (and the one most reviewers never mention) is the extra optical zoom up to 25x if you limit the image size to 5 MPix which is large enough for a quality 8x10 inch print.  Then there is an extra 2x zoom for a total of 50x which is apparently an interpolated digital zoom involving a little image quality degradation.  (The camera has a digital zoom in addition to the 50x which I never use.  I can use digital zoom on a computer after the fact.)  So, with 25x true optical zoom and the ability to get a shot at 50x if necessary, this is an amazing camera.  It has aperture and shutter priority settings as well as manual. These features are also important although the intelligent automatic mode (iA) does well in many conditions.  There is also an intelligent resolution feature which adds beautiful sharpness to many photos.  That feature is always present in iA and may be included in the other settings as well.There are three other features that made me choose the Panasonic ZS15.  1. It does not have a GPS which is a power draining option that I never use in a camera.  (I tend to know where my photos were taken - close enough.)  2. It does not shoot RAW which I never do.  3. By omitting features 1 & 2, the price of the Panasonic is significantly below the Canon (typically $70 although prices change frequently.)", "Date": "December 12, 2012"}, {"Title": "The best compact camera I have owned", "Author": "alex", "ReviewID": "R1T9BZD7KL9HOE", "Overall": "5.0", "Content": "Pros:- absolutely fantastic auto mode, it is truly that great to be called \"Intelligent Auto!- superb image quality, photos come out sharp and with great natural colors- super fast operation, unlike other small cameras which feel sluggish, this one is very, very fast in taking photos and navigating the menus- great zoom range- lots of advanced features - hdr, panorama, 3d photos, face recognitionCons:- flash feels too strong at times and close subjects get overexposed- cannot instantly delete taken photo - you have to go to Playback mode first- Playback mode switch instead of a button- non-standard proprietary usb cable!! why, panasonic, why??!?!", "Date": "November 21, 2012"}, {"Title": "Wow, I think I'm in love", "Author": "True Lucy Maud Montgomery Fan", "ReviewID": "R9N7YCTF0JLZV", "Overall": "5.0", "Content": "I just recently purchased this camera and I love it!  After nearly a month of research looking for a new point and shoot camera, I settled on the ZS15.  I'm so happy I did!  It is ridiculously easy to use.  The buttons are well placed and the weight of the camera is awesome (not too light and not too heavy).  The zoom capabilities are great!  And I have to say that the image clarity is stellar.  Sharp detail and quick shutter reaction are a perfect combination in my book.  I took many pictures of my daughter and the natural light and colors were gorgeous!  My last camera was a Pentax k-x and I actually love this Panasonic ZS15 more.  The menus were easy to use as well, very self explanatory and I didn't have to spend forever searching for things.  There are some manual controls too which is nice if you want to fiddle with settings yourself, like I do!  As I said, I was looking for a simple point and shoot with clear images and zoom capability.  This camera exceeded that for me.  I'd buy another one in a heartbeat.", "Date": "September 5, 2012"}, {"Title": "Finally, a camera that does what I need it to", "Author": "azsheepster", "ReviewID": "RLUASQZBCUEU8", "Overall": "5.0", "Content": "I need a camera that fits in a purse or day pack.  One that holds up to wind and some dust plus general bumping around.  This is that camera.We have had several Canons, some of the best point and shoot cameras, but the more recent models are not the same quality.  I still have a couple of older Nikons, but again, newer models just don't hold up. The problem is consumer expectation for a camera that also takes motion pictures and lenses designed to extend so far that they are vulnerable to environmental elements.  That's not me.  I want a sturdy, easy to operate camera that takes consistent quality photos and this one does.I mostly take still photos of my kids, grandkids, scenery, our pets and livestock. Recent photos in marginal light, from the outdoor stadium seating at a high school graduation were amazing.  Almost as if I were right on the field.The only drawback is the proprietary battery, but I purchased two more and a charger to take when traveling.I have not tried the video function or programmed options.  I have not needed them.", "Date": "June 2, 2012"}, {"Title": "Much improved over ZS3", "Author": "David Devine", "ReviewID": "RQW3ESET25LQ5", "Overall": "4.0", "Content": "Just got this out of the box a couple days ago, results are promising.The video is far above and beyond what my ZS3 was capable of.  I was shooting in the AVCHD mode and MP4 mode, both are very good video modes.  They suffer from the somewhat limited dynamic range that most pocket digicams will suffer from, but the best thing is that it is at the more useful 30p, for general usage anyway.  Most of the competition will only record 1080p at 24fps (ahem, C@non S100), but this baby will give you 1080p at 30fps(technically 60i, but the sensor delivers images at 30p) to match my camcorder.Some things are better about the C@non, for instance, the C@non supports stereo sound and has a better sensor. But come on, at this price point, these things are almost disposable after a couple years. Also, if I drop this thing at the beach I won't fret too much seeing as the price (I payed one hundred ninety nine dollars) is so low.Update:Been using for the past week or two, and a couple updates:As for photo quality, incrementally better than the ZS3 that I bought a couple years ago.  Nothing spectacular.  Still has an underpowered flash, and somewhat heavy noise reduction.  Doesn't have the control over jpeg output that some competition has.  For instance, there are only a few selections for color control (standard, vivid, etc.).  I would like to be able to control some of that myself, as the default output is not as punchy as I like.iA setting is much improved now, and that's the mode I usually use, very nice.I've tried the HDR scene mode and it is quite nice.iResolution is very nice, works as advertised (sharpens things that need sharpening, leaves other stuff alone).The video focusing gets a little jumpy at times if your subject is moving.  I haven't found a way to make it more gradual. THe focus seems to jump around a bit, especially on subjects closer than about 5 feet that are moving (kids).There is a feature called iAF which I cannot find a good description of, but I'll try turning that off to see if the focusing is aided at all by this.", "Date": "May 10, 2012"}, {"Title": "Great travel camera!", "Author": "UT", "ReviewID": "RL0PLQQZWO7ZY", "Overall": "5.0", "Content": "On a recent class reunion, we snapped off 550+ photos without a hitch.  The quality was crisp and clear, and the ZS15 was exceedingly responsive in outdoor or indoor environments.  Did not use the video functions, however, in a short test, the video worked just fine.  The Leica lens gives little curvature / aberration in the wide angle 24mm equivalent, and one can get huge areas into the frame.  Telephoto is superb.Great camera, certainly if you don't need another add-on, such as, a GPS - it takes excellent photos.  Buy a Garmin if you need to find your way.", "Date": "May 3, 2012"}, {"Title": "Three Panasonic cameras - all got dust on the sensor!", "Author": "Mary Dietrick", "ReviewID": "RHC7CAL010QIA", "Overall": "1.0", "Content": "There is a lot I like about this camera - very nice video; zoom lens is amazing for the price.  But it has taken me 3 Panasonic Lumixes to realize that they ALL get dust on the sensor, which totally ruins a lot of pictures.  I can cover the spots sometimes with Corel Paint Shop, but videos are ruined.  Fortunately I purchased the warranty with my last one so I hope I can get it fixed - as soon as my new Canon camera arrives.", "Date": "April 16, 2013"}, {"Title": "An Improved DMC-ZS3", "Author": "J. Watts \"JLW\"", "ReviewID": "R3U15I8JFWSUME", "Overall": "5.0", "Content": "I have used the Lumix DMC-ZS3 for a few years. I have been fairly happy with the camera. After taking some wedding(3) videos this past summer, I decided it was time to upgrade.I developed a feature list:-Higher resolution movies-More zoom-Better low light performance-Faster recovery between shots-SDXC Memory Card compatible-Produces mp4 formatI checked reviews of comparable cameras, especially Canon and Sony. It seemed to be a pretty obvious choice. The ZS15 met or exceeded all my criteria, plus it used the same batteries and charger.After using the camera for a few weeks, I am very pleased.", "Date": "October 7, 2012"}, {"Title": "Pleasantly surprised", "Author": "Ade the DBA", "ReviewID": "R2KZBV1XK3VVT0", "Overall": "5.0", "Content": "I bought this camera as a replacement for our previous Panasonic camera; I wanted something that would take better video, and in all other respects at least not be a downgrade: take good pictures, have good long zoom (I have had too many occasions of not being able to zoom in close enough on eg a son or daughter at the other end of a soccer field!), deal well with low light (birthday cakes with candles for example), and so on.I thought about the ZS20 but, having read the professional reviews, the general feel was that, unless you needed the extra zoom (20x instead of 16x) then it wasn't worth the extra money; and since the 16x can be expanded up to 32x (not digital zoom but some sort of intelligent zoom) I figured that was plenty for me. I was a little reluctant to go with another Panasonic, due to the problems we'd had with the lens covers not working very well after a while, but it seemed the best deal so in the end I went for it.Not only has this camera met all the above criteria, it also did something I didn't expect: it takes fabulous pictures. With our previous camera you often had to try a few different shots or settings to try to get a good picture, and it was particularly difficult to get a good shot with flash; this one I found myself just pointing and shooting and getting a wonderful picture. When you are trying to get pictures of kids who are doing something cute, that's what you want to be able to do! As such I highly recommend this camera.The one time I've found it struggling so far was at a weekend away, where I was trying to zoom in at night to take a picture of (a) a scorpion on the floor in a dimly lit area, and (b) a tarantula on the ceiling, again in a dimly lit area. For obvious reasons, I didn't want to get physically too close in either case! It took a couple of shots to get a good picture of the scorpion, and I only got a semi-decent one of the tarantula - in both cases the camera had trouble with focusing on the long zoom. It's not a situation I plan on repeating too often though!", "Date": "September 13, 2012"}, {"Title": "Worthy replacement for DMC-TZ5", "Author": "ToolReview", "ReviewID": "R1Z0SXYQB43W88", "Overall": "5.0", "Content": "Other reviews cover the capabilities of this model. I will focus on why I like Panasonic's Travel Zooms.I admire Panasonic's Travel Zooms. In 2006 bought a TZ1 the first day they were sold in the US. It is still in use as my ranch pocket camera, withstanding bumps, dust, diesel fumes, crushing in my pocket as I carry heavy lumber at my waist, etc. With 23,000+ photos now it still works like it did when new. I have many excellent wildlife photos from the TZ1.In 2009 I bought a Panasonic TZ5. Unfortunately I recently dropped it. Everything still worked, it strains bravely, but the lens surround ring got a dent that prevents the lens from extending far enough before it retracts again. After 18,000+ photos that TZ5 earned honorable retirement due to user error.My new DMC-ZS15 is a direct descendant, a perfect successor, in Panasonic's Travel Zoom series. Slightly smaller than the TZ5, a little more zoom range, better low light capability. (And noticeably smaller/lighter than TZ1). Image quality remains excellent. I love my new ZS15. I think it is the best pocket zoom camera available at any price and at the present price, a steal. Highly recommended.", "Date": "November 11, 2012"}, {"Title": "zs-15 camera", "Author": "jJOHN", "ReviewID": "R3B1MSKIWTVCIV", "Overall": "5.0", "Content": "This is my third Panasonic camera with the longest optical zoom. I have been happy with all of them but this now is a gem. I am not interested in having the camera tell me where I am and the 16x optical is more than adequate. A perfect camera for travel and home and family also'", "Date": "May 25, 2012"}, {"Title": "Decent Panasonic model, great photos", "Author": "Pamela K. Apfelbeck", "ReviewID": "R3OEQSVV4HWCEU", "Overall": "5.0", "Content": "This model has a nice lens and chooses decent settings much of the time on iA. When it doesn't, there are many scenes and manual controls to create more what you want. I used it the day after buying it pre-dawn to try and photograph a lowboy truck when it was almost dark. At first I didn't like its choice but tried \"hand held night shot.\" Even though it chose ISO 1600, the photo is quite charming and what I was hoping to capture (a pre-dawn work scene). Incidentally, \"hand held night shot\" IS an aI option, but it was turned off, so next time it may work automatically.  I also shot outside out office where some cameras make the trees blurry or the sky white. This makes nice blue-green trees with a blue sky. It created similarly pleasant colors on a pond with scenery around and captured the moon for me.  I don't have indoor samples yet but will keep working with it, but I like this camera a lot and have owned many Panasonic zooms.  I can't say that this is better than the ZS 19/20, though it may be a bit better, and I didn't need or want GPS. The zoom is more than adequate--see photos of the pond with trees and notice the ducks on the pond.  I zoomed to 16x to capture those ducks and it turned out well. (Can't get photos to upload but will keep trying.)", "Date": "August 5, 2012"}, {"Title": "Absolutely NO hissing or buzzing sound during video playback", "Author": "Sam", "ReviewID": "R38T11FN4C8AL9", "Overall": "5.0", "Content": "I got this item from Amazon.com today. For the price of $199 and the fact that this camera has a small sensor, its performance is much better than I thought - you got to actually play with this thing to verify all the reviews posted on the internet. It's definitely a keeper and I have to agree to all the good reviews which I don't intend to repeat here.I heard that a few users have some issues with the video playback - buzzing sound. I took some videos and I did NOT notice any slight buzzing or hissing sound during playback on my TV. What surprised me is that despite the fact that this camera has only one microphone (instead of left & right channel microphone in the DMC-ZS20)it picked up the sound from my TV set(at moderate volume) very clearly during playback. To me that's amazing.Lastly as much as I like the DMC-ZS8 I have to return it and got the DMC-ZS15 which I think is a better camera.", "Date": "May 11, 2012"}, {"Title": "Great All Round Camera -- Literally and Figuratively", "Author": "Barry S. Wilder", "ReviewID": "R3VI87RH4MJF61", "Overall": "5.0", "Content": "First, all the gadgets on a camera don't mean anything if the pictures aren't clear and crisp -- even blown up to 100% -- which this Lumix does nicely.  (Yes, I can make 20\" X 30\" posters with these photos.)I had the Lumix ZS 5, which was a big disappointment.  The photos were blurry even at 25%.  This camera is a BIG improvement.I just returned from Rome where I took 360 degree-panoramic photos of the Piazza Navona, in which, due to the HDR, even details in the shadows are revealed nicely.As a professor of architecture, the ability to discuss every building in a piazza (square) in a single photo is very important to me.  And because I lead tours, too, I don't have the time to switch lenses.  The Lumix ZS 15 allows me to luxury to take quick photos of my pizza and the time to eat it, too.It has just enough MPs not to overwhelm the CMOS sensor. As for video, so far, so good.  I don't miss the stereo, since the microphones are so small and close, the difference is not even audible.I'd definitely recommend it.", "Date": "July 4, 2012"}, {"Title": "Good and bad", "Author": "Harry Clews", "ReviewID": "R23ZYN9E0OTQ3H", "Overall": "4.0", "Content": "I bought this camera because I was going to a concert and I needed the 16X zoom.  They didn't allow \"professional\" cameras in the venue but point-and-shoots were OK.We were about 40 to 50 yards from the stage.  Using the automatic settings produced horrible results -- highlights were completely blown out and the camera had trouble focusing in the stage lighting.  Though this is not unusual for a point-and-shoot I was rethinking my purchase at this point.  I changed the settings to MANUAL and I was stunned by the difference.  Even though the meter was saying I was under-exposing, the images were amazing -- perfectly exposed and sharp.  I've got shots that look as though I was standing onstage with the group.  Even at the full 16X zoom I can see individual hairs on their heads.  Amazing!  The noise level was up a bit, but I love the quality of the shots.  I also used the auto-bracketing feature with great success.I switched to video and the results were equally stunning.  Sound was well recorded and using the zoom feature while recording made the videos look much more professional.  I was also amazed at the stabilization used during the video recording.  The videos look as though they were shot with a tripod (I can hold a camera steady, but not THAT steady).So, bottom line, I'm keeping the camera.  I'd rate it 5 stars, but the auto processing needs some tweaking, perhaps a firmware update.", "Date": "June 23, 2013"}, {"Title": "Read R. Wakeman's review, and  BUY THIS !! I fully agree...", "Author": "Bears Fan Jim \"qm2-703\"", "ReviewID": "R31L2G73689P3T", "Overall": "4.0", "Content": "With manual controls that work well, a really nice interface, nice feel, and fast shot procesing, this is a REAL BARGAIN !!Feels great, like the quality it is: Panasonics have relatively very, very few of the lens errors and flash pop-up jams that seem to plague Canon, Nikon, and Fuji. I've owned the ZS3, ZS5, FZ35, and FZ47 with no problems whatsoever.I've had my ZS15 since June, and it's never let me down, except maybe the flash - it is pretty weak. But I hate flash anyhow, and avoid it if at all possible. I would lean against a door or a post before using flash.I love to visit aerospace museums, aquariums, trade shows, and in every indoor venue, the ZS15 has performed very well. But it is with outside scenes and in video performance that the ZS15 shines !! Indoor stills and indoor video are still well above average for a P&S; under $250.In my own head-to-head testing using other P&S; cams I had from friends and retail stores, it bettered the Elph300hs, the SX260, Nikon 6300, Samsung TL210, and Sony W50. I liked the SX260 for three days, until its pop-up flash get stuck and I returned it. When you spend this much money for a point-and-shoot, you don't want jams and malfunctions.Randy Wakeman's review here is 5 stars and very thorough. My rating for the ZS15 might be 4 to 4.5, but his is more fun to read - he's a professional outdoor mag writer. Read his, and see what you think. The ZS15 will be back to near $200 soon, I believe, and still a bargain at that price.PS: I now own a Lumix FZ-150 as well as the NEX-5N I mentioned in my review, but only because a friend of mine bought a new FZ-200 and sold me his FZ-150 for half price. Really nice guy, my friend Eddie Watts.Still, the ZS15 is so small that I wonder if I will use either the FZ-150 or the NEX-5N as often as I used this easily-pocketable ZS15.", "Date": "December 13, 2012"}, {"Title": "Makes up for all of Panasonic's previous pocket super-zoom evils, but will it continue?", "Author": "Anjana Mohan \"SIG\"", "ReviewID": "RJRJILAQIBCFC", "Overall": "5.0", "Content": "There's no shortage of reviews on this product, including a very useful professional one on DP Review, so I'll use this space to focus on the the differences between the Lumix sz-3, which was our previous pocket super-zoom, and this one.Our previous Panasonic was a zs-3, which barely earned a 3 star review from me for it's horrible low-light performance, proprietary connectors, poor flash performance, and a disaster of a firmware update.  Its firmware was a little buggy, and although it seemed like they could have improved things with a firmware update, the only thing that was done with the one firmware update they released for it was disabling the use of third party batteries.  That confined anyone who had updated their firmware to Panasonic's own batteries, and they were extremely expensive at the time.  That was enough to make me swear I would never buy another Panasonic product again.After our sz-3 wore out due to abuse, we needed a new pocket camera with a zoom and good video capabilities.  I had determined that the Canon SX-230 was the ideal choice, but after trouble finding one in anything but hot pink or turquoise, I gave this one a look.  Compared to the Canon, it had a better lens and a significantly lower price.  Reviews showed image quality to be significantly better than cameras in the zs line that preceded, and interestingly, even significantly better than the few that had come after it (such as the zs-20).I'm happy to say that the reviews were right.  This camera's image quality hasn't disappointed one bit, and it's low-light performance is (sorry, here it comes)... a night-and-day improvement over the sz-3 (couldn't resist).  The 16x lens, although it has a longer reach, has about the same maximum aperture as the previous 12x one.  So, no real gain there.  The sensor is a different story.  Panasonic usually sabotages the low-light quality of their cameras, negating gains in photo receptor sensitivity by upping the pixel count to levels that no one needs.  Their hope is that uninformed consumers just assume that more pixels = better photo.  The zs-15, however, benefits from a relatively recent advance in sensor technology known as \"backside illumination\", which effectively allows larger photo receptors by eliminating the space between them, and Panasonic applied it to their sensor BEFORE upping the pixel count.  So, the zs-15 has the same 12 megapixels as the previous few cameras in the zs line, but higher sensitivity, and the result is that image quality at 800 ISO is better than our old Panasonic was at 400 ISO.  In fact, 1600 ISO on our new camera is even comparable to 400 on the old one.  Additionally, the manual control offered on the zs-15 is as good as anyone can expect from a pocket camera these days, which is another giant leap beyond the zs-3.  Aside from allowing more control over aperture and shutter speed, this also allows the zs-15 to be pretty effective for night time photography as well, which is something the zs-3 simply couldn't handle.With the improved image quality and low-light sensitivity, the zs-15 is a highly rewarding pocket-zoom, and at the current price, an incredible value.Regarding the zoom capability, the zs line has been pretty good for that.  The lens has a very useful wide-angle to telephoto range, and although it's on the slow side (F3.3 max aperture), I've compared it side-by-side with a current super star in the mega zoom catagory, the Nikon D-510, and found that the zs-15 offered only slightly worse image quality at the long end of the zoom range.  Quite a forgivable difference, considering the zs-15 actually fits in a pocket and is half the price.Low points of the zs-15 include continued use of proprietary connectors Worse still, they DON'T EVEN GIVE YOU ONE OF THEIR PROPRIETARY HDMI CABLES WITH IT!  Or even a battery charger!  They expect you to charge the battery in the camera using the included USB cable (proprietary, of course -- don't lose it!) or wall adapter.  Two pieces of good news, though: extra batteries and chargers can now be bought by themselves very cheaply (just search Amazon, there are tons of options), and, if like me you are upgrading from a zs-3, then you already have a compatible battery and dedicated charger.  We would have even had the compatible HDMI cable from the zs-3 too if we hadn't lost it.  Grrrr...  The flash is also still quite mediocre, but thankfully, now far less necessary due to the ability to use higher ISOs without turning the image into an oil painting.So... regarding value and sensor technology, here's why you should buy this camera right away.  Don't wait for the price to go down.  It won't.  It has already gone up by $35 in the couple of months since I bought it.  And, that's not surprising.  A good pocket camera with respectable low-light performance is very difficult to find.  The uninformed pocket-camera-buying public does not generally reward manufacturers for creating a good sensor rather than just joining the mega-pixel rat-race.  So, cameras like these are often niche products, and they often get replaced by products with worse sensors (but a higher pixel count) and become quite difficult to come by.  This has already happened.  The more recent products in the zs line have been upped to 16MP, as have most of its competitors.  Visit DP Review, compare the zs-15 to the zs-20 at 1600 ISO, and see how much better the zs-15 does.  And, remember lessons learned by the Fuji F31.  The F31 had spectacular light sensitivity for its time, but didn't sell well despite its low $200 price due to its 6MP sensor.  Many competitors were offering more pixels.  A year later, however, new F31s could no longer be found and used ones were fetching $400+ on Amazon.  I'm not saying you should think of the zs-15 as an investment, I'm just saying that if you're considering it, get it now while you can.", "Date": "October 20, 2012"}, {"Title": "Panasonic LUMIX DMC-ZS15 review", "Author": "g9000K", "ReviewID": "R2EHF89I504ULY", "Overall": "5.0", "Content": "I still use ZS7, but bought this one for my diving trips, after extensive research, because of the video quality along with original Panasonic underwater housing. For that price you can't find anything close to this set on a market right now. The video quality is outstanding, both AVCHD and MP4 recording, the pictures quality is about the same as ZS7 in a day light, but the camera processes images much faster and it gets better at low light conditions bkz of new sensor. This camera actually has the same 12.1Mp CMOS sensor as the DMC-FZ150K model, but price tag is so low, which makes it one of the best bargains in price/quality category. I compared both ZS7 and FZ150K against this camera in different light conditions and I posted some side-by-side videos clips on youtube, search for g9000K, if you wish to see them...Overall, I am very satisfied with this camera.Sep 19, 2012 update: I did over 20 dives with this camera and the original Panasonic housing, very happy with it, see offshore dives and Reef and Fish underwater videos on my youtube channel.", "Date": "August 17, 2012"}, {"Title": "Rapid response, best zoom ever", "Author": "Robert Trudeau", "ReviewID": "R3M8ZVYNUIOZMF", "Overall": "5.0", "Content": "My wife loves it as much as I after the first week of shooting with the Lumix. Rapid response, best zoom we've seen by far. We like its colors, its low-light ability and the basic controls.She inadvertently switched to sepia at one point in the confusion of a birthday party. No big whoop.Later I found that the fact that I can shoot in b/w saved time on an animation project. Yes, I've replaced my Nikon DLSR as the camera used for capturing stop-motion animations. A minor complaint: could not seem to control the AWB, or white balance.I also shot pro-style portraits by using a moderate telephoto via the zoom.Bought the after-market battery recharger and batteries from Wasabi and they are working righteously.Smart package at a good price!We are actually looking forward to learning more about this camera's special features.", "Date": "August 5, 2012"}, {"Title": "We have a Winner!", "Author": "Brian S", "ReviewID": "R3N88MD8BAIN01", "Overall": "5.0", "Content": "Bought this camera about two months ago.  So far I have been very impressed.  Pictures look great.  I was a little worried about how it would perform in dark settings, but it does a decent job given this is a point and shoot camera.  I read on different websites that this particular camera has the same processor as the FZ150.  Also liked the 32X intelligent zoom feature.  So this camera won out over the Canon SX230 and even the Panasonic ZS20 due to price and the better processor.  GPS and stereo were not important to me.  Picture quality was #1 on my list.  Also wanted quality video so I could just use one device for all my needs.I am not an expert when it comes to cameras but I do enjoy the different features on this camera.  The minature mode is a lot of fun.  I took a picture of my sister at her wedding and blew it up to 8X10 and it looked great.  Video is impressive as well.  When recording my sister's wedding it did a great job.  Only complaint was that during the recording (about 20min long) it had a little trouble with the focus, but this was very infrequent.  It will take pictures while recording, however it seems to limit it to 2 pictures.  Not sure if there is a way around this limitation.  When taking pictures while recording, pics will be 3.5MP.  When taking pictures of video playback, pics will be 2MP.  FYI, I have Windows Vista and needed to download the VLC Media player to play the videos on my PC.  You can download for free from CNET.You cannot crop pictures using the camera, but this can be done with PC software.  However would have been nice to just do it with the camera.  When searching for pictures in the camera, there is a thumbnail view which makes searching go a lot faster.  Downloading to PC is very easy using the included USB cable.  Also like that the flash is not a pop up verion which just gets in the way.As of this review, prices on Amazon ranged from $225 down to $180.  I got it for $199.  For under $200 this is an excellent point and shoot camera you can put in your pocket.  I would highly recommend this camera.  I do a lot of research when buying electronics and this camera came out on top for point and shoot versions.", "Date": "July 4, 2012"}, {"Title": "Broke down in a few days, Panasonic wouldn't fix.", "Author": "IOANNIS SAKELLARIDIS", "ReviewID": "R14QRMCQ033UH8", "Overall": "1.0", "Content": "I took a couple of photos with this camera and then placed it in a safe camera case. A few days later, I open it and the lcd screen is not working. I send it to Panasonic to be repaired under the warranty, they make a few useless \"courtesy calls\" back to tell me that \"it will be sent to the technician\" or \"it has been sent to a technician\", and next thing I know they ask me for $180 (more than what I paid for the camera!) to fix it. They claim \"the screen was leaking and that only happens with physical abuse, not with manufacturing defects\". Needless to say, I had barely used the camera and had stored it in a safe place. Here's my $$ down the drain...", "Date": "February 8, 2013"}, {"Title": "Truly Intelligent Point and shoot camera", "Author": "Dane O", "ReviewID": "R18XYIMZNXZOZG", "Overall": "5.0", "Content": "Keep in mind, this IS NOT any where near an SLR camera or even a D-SLR camera. It is solely sold as a \"point and shoot\" camera, in which it blows me away for a camera in that category. I'm not an expert, but I am around electronics and technology a lot (mostly gaming and computers) and some of the features this camera has for the price is outstanding.A word about economy. I wouldn't say it is hard to find a good camera. It is just the fact that many retailers offer more \"cheap\" cameras because the cheaper prices attract more foot traffic and more purchases for customers either looking for cameras or passing by them and thinking \"what a good deal\" (not). It is increasingly difficult to find a quality, well made Japanese camera. Many camera manufacturers make their cameras now in China. That is not always bad because many manufacturers sometimes still enforce higher standards of build quality, but you can't beat Japanese made quality in any electronics (cars too).This camera is MADE IN JAPAN. Fantastic!!!! It feels great, has a solid feel while not quite being heavy. The megapixel rating isn't terribly high, however that doesn't matter much unless you are blowing up your picture and making a poster to put up on a wall. I don't do that, i view pictures on my computer and print up 4x6's, 5x7's, and occasionally a 8x10 to frame. What is more important is the image sensor and the size of said sensor.I was amazed when I was taking video how it changes scenes automatically. If i go up close to something it will change to macro mode automatically. It will adjust to outdoor (mountain) setting and also adjust for lower light all automatically. It is also difficult to find a camera in this range that has such fluid zooming capabilities while taking video as this camera graces you with. I was amazed and I took some great outdoor videos by the water and they came out crystal clear in 1080p. Try finding a camera this size, price, and quality that does 1080p video. Most this size only do 720p.Same with taking still pictures. When you put it in IAuto mode which is basically your average auto mode with Panasonic's intelligence system. It works really well. IT switches to macro automatically for you as well.I've had 2 Sonys one Canon and now a Panasonic camera. I have always loved their TV's too. Now I love their (well this) camera(s).", "Date": "August 25, 2012"}, {"Title": "The ZS15 is an excellent camera", "Author": "Traveler", "ReviewID": "R672CBMX5SVW9", "Overall": "5.0", "Content": "I originally bought the ZS10. I was very pleased with the quality of photos the ZS10 took. They were clear and well exposed. The problem was, it took photos on its own. The last time I used it, it recorded 27 photos but only 10 were shots I took. The other 17 were random shots of the sky, ground, my feet, whatever it felt like shooting. It was very strange.The ZS10 also had features I didn't use, like GPS. Since I don't shoot for the AP, I didn't see the need for this battery draining feature. The touch screen never worked either.So, I returned it and bought the newer ZS15 which works superbly. The photos are crisp and well exposed and it doesn't have the not needed GPS or touch screen. I highly recommend the ZS15.", "Date": "June 4, 2012"}, {"Title": "don't do it", "Author": "notnecessary", "ReviewID": "R2ZMEMUV4HOOA1", "Overall": "1.0", "Content": "Had this camera for almost two years, which shows I have a flat learning curve.  Overall I think it took great pictures and has many useful features.  BUT!  What good are the pics if they are marred by blobs/specs on the pictures caused by dust/lint on the inside of the lens.  It seems Panasonic has a long-standing issue with dirt entering the camera body as the long lens retracts.  There is even a YouTube video on how to clean the lens by opening the body.  I liked the camera so much I put up with this obvious design failure and cleaned the inside lens twice.  Finally, the last time I tried to clean it I broke one of the inside clips so it's toast.  There are more reliable cameras out there at this price point, buy one of those.", "Date": "February 24, 2014"}, {"Title": "Great Camera!", "Author": "Mary \"m.a.\"", "ReviewID": "R2J6THN3AMZ9RL", "Overall": "5.0", "Content": "My son recommended this camera because I was getting blurry pictures with my CoolPix. He said it had something to do with the optical lens?! All I know is that it has improved my pictures dramatically.  Very sharp, crisp photos.  My brother in law who is an IT person also approved of it after trying it out.  Since I am not an expert on cameras, their approvals reassured me that it is a winner.", "Date": "December 5, 2012"}, {"Title": "Good for the Price - You Can Get Excellent But Non-Professional Results If You Experiment With Settings", "Author": "L.Gildart", "ReviewID": "RQ45G1166QQ3", "Overall": "4.0", "Content": "My first real camera was a Pentax K-1000 with manual everything, and my preference is always to try to get the best looking picture I can have before any image processing happens.  Digital point and shoot is a much different animal from old film photography, but I still want an excellent lens, because without one, I feel like I might as well just stick with my iPhone or Bloggie and not have an actual camera at all.I bought the Lumix for the Leica lens, and I was a little disappointed that it does not render accurately close up. In the automatic setting, there's a noticeable amount of fisheye distortion that is clearly visible in any close up photo involving lines that should be straight or in portraits, which end up looking like funhouse shots. It took some experimenting, but it turns out that the portrait setting completely corrects this (and you can use it for still life shots, too).  Once I gave up my notion of how I thought things ought to be and started to work with the camera to get the results I wanted, I sort of fell a little in love with the thing.It's got a very large LCD.  I have lupus and am losing my eyesight.  Tiny lcds just don't work for me.  Setting navigation is easy and very very intuitive.  The buttons aren't too tiny.  I did not install the included software or read the instructions, and I am having a very easy time finding my way around and loading up the pictures.  Once you figure out what setting you need to depict accurately the person, place, or thing you are trying to photograph, you get sharp, accurate pictures, even in low light or under other difficult shooting conditions.", "Date": "December 5, 2012"}, {"Title": "aim for the moon", "Author": "Lorraine in Taos", "ReviewID": "RTYO5UONHTS0C", "Overall": "4.0", "Content": "Received my DMC ZS15 a few days ago. I carry a compact camera with me at all times and want lots of lens quality and setting choices in a small package for a reasonable price. I don't need or want GPS or touch screen so I chose the ZS15 over the ZS20. Panasonic hit the target with this compact. Nice size that feels secure but not bulky in the hand, an attractive design (love that Leica name on the lens). Among my beloved Canon P&S; cameras, none has the zoom capability of this Lumix. I live in the southwest where the landscapes are vast and use a zoom lens often. In recent days I've photographed hot air balloons in the morning in direct sun and the full moon rising over the mountains at dusk. Note: over the years I've photographed the moon with many different P&S; cameras and they all came out wonky and Dali-like, never crisp. These pics came out extremely well considering this is not a DSLR. I switched to macro and tested it with closeups of rings, vitamin pills, flower heads and the words on a prescription bottle. Although the macro feature isn't great, if you hold the lens at just the right distance for sharpness (about 3-4\") the result can be zoomed further and cropped satisfactorily. I've rated the camera with 4 stars due to a flaw that Panasonic has not corrected: the LCD monitor becomes a mirror in bright sunlight. Very disconcerting to aim at something and see only oneself staring back. Other manufacturers have dealt with this problem, why not Panasonic? Overall, though, I think I'm going to be toting this camera around more than any other.", "Date": "October 30, 2012"}, {"Title": "Great little camera", "Author": "Pericombobulation53", "ReviewID": "R2KNH5KODE7P9X", "Overall": "5.0", "Content": "I'm a DSLR user, but even I'd have to admit that there is value in having a small camera to bring along for everyday use.  I got this for my wife for her birthday and it's a really great little camera.  My dad bought an older Lumix DMC about 4 years ago and I was impressed at how well made it was.  He has taken it moose hunting in New Brunswick, elk hunting in Montana, whale watching, hiking, etc. etc. protected by nothing more than his pocket and his camera is still going strong.  The DMC-ZS15 I bought for my wife basically looks the same as his older model (minus the dirt and scratches), but with updated electronics.  Still very well built, still a very portable size.Pictures from this little champ are about the best I've seen among P&S; cameras.  If you want better image quality, buy a DSLR.  The intelligent auto mode is very, well... intelligent, usually picking the best exposure for pretty much any situation.  The HDR mode is pretty useful and a nice option on a P&S.;  Panorama mode is excellent, producing spectacular results.  The various scene modes seem to be fine too, though she pretty much leaves the camera on intelligent auto mode most of the time.That's about all I have to say, really.  It's a solid unit that takes great pictures and can fit in a pocket or pocketbook.  I wish more P&S; cameras were up to this level of quality.", "Date": "October 26, 2012"}, {"Title": "Excellent camera, great price on Amazon", "Author": "Roberta S.", "ReviewID": "R2JHRXZJD4YGGY", "Overall": "5.0", "Content": "I did a lot of research into my next point-and-shoot camera, I was stepping up from a beloved Canon Powershot A1200IS that suited my purposes, but wanted more wide angle, a few more pixels for printing some pics, and some more shooting modes. I am essentially a \"set it and forget it\" shooter, but have enjoyed experimenting with the other modes.  This camera takes dynamite shots on Intelligent Auto.  I have been more than happy.  It is heavier than the small point-and-shoot I came from, but it feels substantial and well made.  Highly recommend.", "Date": "September 28, 2012"}, {"Title": "Great Camera, leave the DSLR at home", "Author": "Wesley C. Honeycutt \"Wes\"", "ReviewID": "RLL7WL1Y8A59X", "Overall": "5.0", "Content": "I upgraded from panasonic TZ3....that camera never quite did it all for me but great to throw in my pocket on a bike ride. This camera, I can happily say, let's me forget about lugging along 40D with lenses except for when highest quality is needed. And I have been amazed at how good the zoom shots can be! Macro is awesome and colors are great. Yes, if you open a photo at 200% or more you can see the artifacts from the compression and in-camera filtering, but who cares? Far away backgrounds of trees and flora can get a bit smudgy but accetable to me. The pics look great full screen on my 27 inch monitor and print out great. I think Panasonic did a great job of balancing all factors to create great photos for a reasonable price. The HDR can be very helpful. I have not had good luck with a getting a good 3d pic but will keep trying. I switched to the MPG4 video and I think that's great even at 720p. Love all the scene modes and the creative modes are cool. I've had it for about a month. Great camera!", "Date": "September 4, 2012"}, {"Title": "Good travel camera", "Author": "Dennis", "ReviewID": "R22GLBVC9FYTSY", "Overall": "4.0", "Content": "Purchased to replace a still working Fuji F30.  Good picture quality, but I too have some problems with white-balance that my old F30 handled with ease.  The wide angle is very nice, and the camera is responsive.  Indoor photo's are good, and the camera's screen is sharp.  The Intelligent Auto setting works well, and the zoom is available in movie mode.  However, there is highlight clipping, which can be very noticeable at times.  Despite the short-comings, I'd replace it if lost.", "Date": "August 11, 2012"}, {"Title": "Love Lumix!", "Author": "Essig", "ReviewID": "R155YQA1GNVUS4", "Overall": "5.0", "Content": "I had an older Panasonic Lumix that we lost, and purchased this one to take its place.  I am actually glad we have this one now because it is that much better.  We loved our old one but the pictures, the zoom, the video capabilities and even the rear screen are all better.  The zoom on this camera is great.  I know the next model up has a better zoom, but it was significantly more when I purchased this one and I was trying to save some money...but this zoom is still great.  This doesn't have the best video out there but I bought this for pictures, not for video.  If you want great video, a great video camera is what you should be looking at IMO.  Great all around camera at a price I thought was good.  You won't be disappointed.", "Date": "August 2, 2012"}, {"Title": "Very HAPPY & Absolutely NO video problems", "Author": "Amazon Customer", "ReviewID": "R3N7JF0JG4JN0Q", "Overall": "5.0", "Content": "This is an exceptional camera and I'm very happy about my purchase. Images are of good quality and this camera made me look like a pro with shooting pictures! Whether you're a novice or a pro, I don't think anyone will be disappointed with the purchase once you understand how it operates, as a point & shoot camera.I was concerned about another reviewer's experience with the video creating a hissing sound. Here's what I discovered using the video on 3 occasions.1st Time - I noted a hissing sound, but I attributed it to blowing wind. (Later, I discovered that there is a 'Wind' feature in the camera where you can turn this on.)2nd Time -  I shot a little more footage in the same location, but this time I wasn't under trees with rustling leaves. Although there was less hissing, I still wasn't 100% sure what to make of it because there were cars driving by, and I decided that this could be the issue, which makes sense to me. The microphone is very sensitive with picking up sound from birds in the distance that I couldn't see.THIRD Time - There was no wind or cars driving by -- ABSOLUTELY PERFECT -- no hissing sound or wind noise.I have kept this camera because it is a wonderful product. In my opinion, the other reviewer has missed out on a great product and was too quick in returning it. Based on my experience, I have recommended this camera to others. :)", "Date": "May 28, 2012"}, {"Title": "Poor construction quality - barely lasted a year", "Author": "Ashe", "ReviewID": "R3TJPI8VKV2E95", "Overall": "1.0", "Content": "I was a long-time fan of the Lumix line, having purchased an excellent one in 2007ish.  Favorite camera I ever owned.  Metal body, wide angle Leica lens, great software and presets... simply effortless picture quality.And then I made the mistake of replacing it with this piece of junk.  The lens, software, and picture quality are still top-of-the-line for a point-and-shoot, but the construction quality and durabilty have gone down the tubes.  The body may still be metal but it seems to be about the thickness of an aluminum pop can, with a flimsy metal reinforcement screwed into the side.  It physically broke after a year of ordinary use.  The camera body actually warped and twisted while subjected to the rather ordinary forces of being packed, in a protective case, in my carry-on bag during my last vacation.  Still turns on, but the lens housing is out of plane so it won't focus anymore.  Of course, it's out of warranty, so I'm out of pocket for a new camera now unless I want to blindly ship it to the Panasonic service department, which is impossible to get a hold of and has not returned any of my messages.Long story short, unless they fix the construction quality, I will not buy another Lumix and I can't recommend it to others.", "Date": "October 4, 2013"}, {"Title": "Another great Panasonic camera", "Author": "David A. Ayotte \"Dedicated American\"", "ReviewID": "R2GHETQ34D5B5N", "Overall": "5.0", "Content": "This is my 2nd Panasonic camera.  My old one still works and it is probably 6 years old.  This camera is just a little thicker than my old one, but this one also has a much longer zoom.  I took this on vacation and shot several hundred pictures and they all came out good.  The panorama picture option is pretty fun too.", "Date": "July 24, 2013"}, {"Title": "Dreaded looking for a replacement to my LUMIX DMC-ZS5 Camera", "Author": "Terryl lee Allen", "ReviewID": "R1HB913WWWT5SY", "Overall": "5.0", "Content": "LOVED my DMC-ZS5 camera but I dropped it off the upper level bleachers on to concrete and had some pixel deaths.  I started researching a new camera and was dismayed to find the one I dropped had the best reviews for image quality.  After much searching I purchased the DMC-ZS15.  LOVE this camera too!  The only issue I have is focus when using the wide angle with close in shots.  This has proved to be a very small problem and the \"upgrades\" are overriding this minor issue.  Great point and shoot camera with very good image quality!", "Date": "June 28, 2013"}, {"Title": "Gem of a Camera", "Author": "Pardner Gardner", "ReviewID": "R6N2G6LTJLVHB", "Overall": "5.0", "Content": "I've owned prior Panasonic DMC models and all have been great performers. This is the best so far. I chose it because I had no need for a GPS or super-super zoom. 16X is quite zoomy enough. Video at highest quality is fabulous. Solid design. A winner.", "Date": "January 16, 2013"}, {"Title": "2nd digital", "Author": "William A. Rice III", "ReviewID": "R3KH9GSF9VEUQU", "Overall": "5.0", "Content": "Works great, so many setting I will never use, just like the auto point and shoot.I was really surprised with the quality of the movie I made.Easy to use, takes great pictures.", "Date": "January 16, 2013"}, {"Title": "Panasonic ZS-15", "Author": "RD", "ReviewID": "RUVB1DOKM0II", "Overall": "5.0", "Content": "This camera has very good picture quality and the movie mode is excellent as well. I have several long zoom camera's ( Panasonic zs5, Panasonic zs8, Sony DSCH90, Samsung WB750, Samsung WB150 ) but the quality from this camera is sharper than all of them. The Samsung WB750 is close but this camera is the sharpest. It's not the best looking or the smallest but I know I will be using this one the most. Movie mode is on par with the Samsung WB750 which is excellent. Great Camera", "Date": "January 12, 2013"}, {"Title": "versatile camera in a small package, sometimes a good price", "Author": "J. Klugman", "ReviewID": "R10B3J3TNXHC0N", "Overall": "5.0", "Content": "i recommend you read dpreview for their detailed evaluation of the image quality, the image stabilized leica ultrazoom lens, and controls.  it will make you appreciate what a great little camera this is, better than the bigger, more expensive zs20.overall, a great camera with strong zoom and very good image quality, in a very convenient, small package.  remember, the best camera is the one you have with you, and it's very easy to carry this camera.the price here at amazon varies widely over time. i'd recommend watching the price if you want a bargain.", "Date": "January 3, 2013"}, {"Title": "Panasonic LUMIX DMC-ZS15 12.1 MP High Sensitivity MOS Digital Camera...", "Author": "Hermine Stover \"Hermine  Stover\"", "ReviewID": "RVPV1AU8F5NUQ", "Overall": "5.0", "Content": "This camera does more than I can do. It was recommended to me by a very gifted botanical photographer for detailed closeups, and it does this and MUCH MUCH MORE. I have not scratched the surface of its capabilities and back in the days of film cameras, I was VERY PICKY. this is well worth the price and has those great LEICA lenses too.", "Date": "December 9, 2012"}, {"Title": "Fantastic Camera", "Author": "Trance Dancer", "ReviewID": "R7N7GJ8LGBEKG", "Overall": "5.0", "Content": "I have a Lumix DMC FZ28, which is great, but I was not carrying it around with me because it was a larger camera.  I bought a Nikon Coolpix 7500, which is nice and compact and has a separate viewfinder (not just the LCD display).  It takes nice photo's, but it did not have enough digital zoom.I then came across this camera.  For the price, it is the best darn camera I have ever had.  Photo's are crisp, easy to use, zoom is great, flash works great, and lots of options.  Just does not have a separate viewfinder, but the LCD is very clear in light or dark scenarios.If you are looking for a smaller camera (not as small as the Coolpix), that you will carry around with you wherever you go, then this is a very nice choice!  I have taken hundreds of pics and the battery has barely used any power.  Love this camera!", "Date": "November 30, 2012"}, {"Title": "Lumix DMC-ZS15 Camera", "Author": "JOHN HESS", "ReviewID": "R1ZAEYEJ3X9DD7", "Overall": "4.0", "Content": "I bought this to replace the Lumix DMC-ZS1 that I loved but is now somewhere at the bottom of the Mississippi River.I was in a Canoe roll-over with some friends in July.  I missed it and finally popped for the DMC-ZS15. It has new featuresand the fine picture quality I like from the Leica lens.and the movie quality was improved to High-Def.I would recomend this for anyone that takes a variety of pictures, from people to landscape to Marco of flowers or insects.Picture quality is miles ahead of any camera-phone.", "Date": "November 27, 2012"}, {"Title": "Awesome camera!", "Author": "Amazon Customer", "ReviewID": "R2WW98Z93EN613", "Overall": "5.0", "Content": "I really wanted something with good zoom but not too bulky.  This camera was everything I wanted and produces pretty awesome pictures.  I have only had it for a month but I really like it so far.  I will probably buy another battery though as a backup since I did take it out this weekend with 2 bars left on the battery symbol and then the battery died within a few pictures.  I just wasn't expecting it to die that fast, but I had used it a lot before that without recharging - so just know that you may have to buy another battery to have as a backup.", "Date": "November 6, 2012"}, {"Title": "Point and shoot maximum benefit small BL CMOS sensor camera", "Author": "climbmountainway", "ReviewID": "RVEH569D65OGM", "Overall": "5.0", "Content": "We have 6 and 12MP Canon superzoom cameras now in considerable use for many years, a 16MP BL CMOS APS-C Pentax K-5, with a lens arsenal, and a four year old 12MP Canon A650 whose photos are fantastic.  This small package LUMIX ZS15 16X point and shoot size sensor zoom camera is great on its own merits.  Just took it three weekends ago to the top of the Colorado Great Divide in Boulder, County, where it soared rendering Aspen and other vegetation subtle fall color changes (used the onboard image enhancement menu to saturate all color tone nuances after the image was shot with two camera menu button pushes).  Not quite a DSLR, but very close to those results in a strictly JPEG imaging motif pocketable camera. A little image sharpening post shooting, and 16X20 standard prints are adjusted in ratio to the format chosen, as very printable.  All the trade offs of sticking with this MP count sensor are apparent in this camera's wise selection of such sensor capacity.Read the specs on Panasonic's site, and know that all claims advertised are true.  The ultimate trail and travel camera for some it is certain.  Not really available with all this feature set until on board processor capacity and memory card structuring aligned with the notion of such a tool's speedy results as on track imaging use advances for 2012.  A better lens than the claimed 20X next model up, with better and more predictable outcomes, and offering considerable override control.Read the other reviews here, and excepting those with virtual ignorance of applying this versatile tool to planned and presenting subject challenges, one will understand the consistent report of its fruitful and faithful imaging consistency.  What I like is carrying it in a pocket all the time, just in case the session for capture includes a newsworthy happenstance coming my way.And here we have it, all is approachable for the potential of future imaging by an experienced eye carried with this imaging unit becoming an extension of one's photographic abilities.  Maximal pocket quality Leica zoom, a great burst capacity, accurate exposure and color, and the best detail possible for such a sized sensor.  This happens where what a photographer loves joins the multicore PC processor computer age for imaging storage, manipulation, and considered post shooting updating for best results sought.The quality of this unit cannot be claimed to be anything but the best, where the manufacturing build is at the top of what is possible for mass marketing and a wide user base in a price range now under $200.00! Panasonic's quality control is not easily matched by other makers. Even professionals can benefit from its adjustablity and handling ease. Enthusiasts too have intelligent automatic settings that can boost their deliverable results according to use location needs.Since the Canon A650 (a G series priced without the beefy body, but with the same lens, adjustment ability, and sensor)--which lacks the ability to control noise and flare after ISO 400 with its now vintage CCD chip (but gives great photos)--these small sized zoom cameras have acquired 1080p or i HD video capacity (this one with the available zoom fully functional while shooting video, as follows focus well too, and with accurate results for HD viewing and/or editing), greater low light capacity, wider dynamic range, all kinds of auto or manual settings to achieve predicable results, plug in considerations for most photo software, full imaging recording data encoding, ability to use HC and HXC SD cards (one of which can now shoot thousands of stills and up to or over 1/2 hour of HD video), with accurate on demand fps rates which work, greater flash and WA coverage, sharp, sharp zoom lenses, color cooking, etc.  Viewfinders too now are like watching a small HDTV all in real time and present on location.The purchase choice and use question becomes then subjective.  Does the camera work for your hands, for your style of shooting, and meet your imaging goals and objectives without further bells and whistles (like ability for add on flash, normally expensive additional greater long reach or wider capacity lens coverage, fine detail only once achieved with a larger sensor interchangeable lens camera, and so on)? As it is this camera should remain a trustworthy companion until pocket cameras in general become even more refined, with greater attributes we can only imagine.The vendor here offered the camera with an inexpensive class 10 16MP SDHC card which has performed flawlessly, with the Case Logic cigarette package sized case with one pocket which has been there when needed to carry extra generic batteries ordered elsewhere, and with the listed Lumix battery (also included was the in camera charger, software, and cables).  As being their suggestions all were essential additions as reasonably priced, and came quickly through the mail along with the camera in a well packaged bundle.  Their packaging and fulfilling gear use suggestions have proven second to none.  This was a vendor who obviously has had hands on experience with all kinds of imaging formats.", "Date": "October 8, 2012"}, {"Title": "So easy to use", "Author": "B. Webster", "ReviewID": "R4KOWCTUKV619", "Overall": "5.0", "Content": "I am highly impressed with this little camera.  I am the first to admit that I am a lousy picture taker; however, this camera even makes me look pretty good.  It has Intelligent Auto (thank goodness) and it works like a charm.  It will adjust the camera/lighting, etc. depending on the conditions of the shot.I recently took this camera to Walt Disney World and my pictures were amazing.  I am still trying to learn how to use the video recorder properly as I video taped my feet and the sky several times because I thought I had stopped recording when, in fact, I had not, lol.Most of the features on the camera are self-explanatory.  The battery is rechargeable and it held a charge for me while shooting over 100 pictures and videos as well as reviewing playback.The image stabilizer is a real plus.  I was able to take action shots and they were not blurred.  I used the panorama feature and that, too, worked great. I am obviously not a camera expert, but I hope this review helps you make a decision to buy this camera.  I am so pleased with this purchase that I expect to be taking many more photos.>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Update - July 2013Using my camera more than I ever thought possible.  Does a great job at video taping (does, however, use more battery power so be prepared to recharge), but picture taking is getting better and better. I have received so many compliments on my photos, that I am even surprised at the range of this little camera.  Love it.", "Date": "September 22, 2012"}, {"Title": "Excellent Picture Quality Camera", "Author": "David Savage", "ReviewID": "RVBSTNUL2F9YF", "Overall": "5.0", "Content": "The optical zoom plus the quality of picture make this an excellent alternative to standard phone camera.This camera is great value - taking excellent pictures with ease", "Date": "September 9, 2012"}, {"Title": "Great camera", "Author": "Ed", "ReviewID": "R21X9Z1GZDYR8X", "Overall": "5.0", "Content": "Replaced the older ZR1 with this camera for a trip to the Middle East.  Most of my shots were shot in the IA mode or the Scene mode.  It has a great 16x zoom and sensor for shooting in dark locations or at night.I took 800 shots and felt it was the perfect travel camera in size, weight and performance.  I bought the Clearview to help me see the  LCD screen in sunshine and it worked great.  A great product!  Ed", "Date": "June 8, 2012"}, {"Title": "The Best Travel-Zoom Camera on the Market", "Author": "Robert \"Living in Paradise\"", "ReviewID": "R95757O0YK3B0", "Overall": "5.0", "Content": "A couple of months ago, I narrowed down my choices for a new camera to either a Canon SX230 or a Panasonic ZS15.  The SX230 went on sale for $139 + shipping, so I snapped it up.  Well, the SX230 didn't quite suit me.  While chocked full of features and capable of taking excellent pictures, I have been struggling to like it.Last week, I noticed the ZS15 was on sale on another website for $135.  I bought it and I'm a much happier camper now.- While they are both about the same size and weight, the ZS15 just feels better.  Maybe it's the built-in handgrip.  Maybe it's the not-having-to-pay-attention-to-the-popup-flash.  Maybe it's the way the controls are laid out.  Maybe it's the color (my SX230 was red with hot-pink overtones).  Whatever the reason, it feels more comfortable to me.- The user interface is much more intuitive in the ZS15 than on the SX230.  Simple things like escaping from menus is a breeze with the ZS15, whereas I had to figure out by trial-and-error which control button to hit with the SX230.- The ZS15 is much more responsive than the SX230.  It almost feels like the ZS15 is 3X faster than the SX230.  (Probably not true.  It's probably closer to 1.5X faster cycle times.  It just SEEMS that it's three times faster because the moments to take photographs are fleeting.  Or maybe it's that I can take 3 good snapshots with the ZS15, in the time that it would have taken for 1 good shot plus one rushed badly framed snapshop with the SX230.)- The wide angle is such a breath of fresh air.  I missed it so much (my previous camera, a Fujifilm F505, had a 24mm wide angle lens).  Now, I have it back. :-)- Ditto for the in-camera panoramic photostitching (my Fujifilm F505 had that, too).  Not as perfect as doing post-camera stitching, but if I was a perfectionist, I would buy a DSLR.- The intelligent zoom is a plus.  (Note:  The 16x optical zoom of the ZS15 yields about the same picture as the 14x optical zoom of the SX230, because it starts off with a smaller object at the 24mm wide angle setting when compared with the larger starting object at the SX230's 28mm setting).- Video is much nicer, scenes are better rendered.  And I can HEAR the audio on playback in the camera!  (The SX230's volume was nearly inaudible.)- The ZS15's 4:3 LCD display is much easier on my eyes than the SX230's 16:9 LCD display.While the SX230 arguably produces better photographs, the ZS15 is easier and more fun for me to use.  5 stars.", "Date": "August 8, 2012"}, {"Title": "Great camera with a lot of issues", "Author": "okaugust \"okaugust\"", "ReviewID": "R3D1UCN24OPTFK", "Overall": "2.0", "Content": "I'm not professional photographer, but I must be doing something right, people keep asking me what kind of camera I use. I tell them a Panasonic Lumix, but it's my fourth or fifth because it is continually having issues. I keep thinking it must be me, though I try to be careful with how I handle it, but reading other reviews with my exact issues I just had to conclude it is not me, it is the camera design.The lenses are always getting scratched by particles that get trapped by the auto closing lens door, and scratching the lens.Each one also works okay for a few months but in the end, there are particles that get trapped inside the lens, creating a blob on pictures. This time I was so frustrated that I gave it a few thwacks with my fingers until it moved out of the range of view.Don't even think about getting it anywhere remotely damp.You have to know how to change the video setting because one way won't download right. The tech people won't know either, no matter how many times you say, \"it has just got to be switched on the wrong setting\" they will tell you to reformat your computer or send it in.Oh, and every time I've called for warranty help, it's $180-$225 to fix, the price of a new camera. (That's what happens when someone buys it in November for you for Christmas, and when it goes out the next December it's over the year warranty.) Only I don't put up with that. I tell them it's a product flaw, and I'm sending it back. They can fix it and send it back to me for free or keep it, and every time they've fixed it and sent it back for free. However, the warranty process and people are so confusing and hard to work with, you never know if they will just keep it, or if you will get a bill for $180, or what's going to happen.Other people are right, it doesn't take that great of shots in really bright light, or really low light on the automatic setting.Getting something in movement is impossible.It has less settings than the previous versions I had.It's a $200 camera met for average morons like me who want to carry it around, point and shoot, and come home with a pretty good picture, and 80% of the time it does that, it just doesn't last or lend itself to making the other 20% of the time happen.", "Date": "March 23, 2014"}, {"Title": "Phenomenal camera i'm on my third one", "Author": "Brad Hutchinson", "ReviewID": "R387NU68OYMWE6", "Overall": "5.0", "Content": "I have been a user of the Panasonic superzoom models for years now an all of them have been excellent.  Currently I am on my third ZS15 due to breaking the previous two because I do not treat them nicely.  The image quality is second to none in this product category.  My main uses for the camera are wildlife/nature photography and landscape photography while hiking.  I carry this camera typically in a small Pearstone bag and use the chest strap on a Camelbak to hold the camera bag via the belt clip.  I will never own a DSLR because I hike as light as possible and do not have the patience or room to haul around multiple lenses anywhere.  Why bother when I can have this camera hanging by my chest and take excellent pictures?  As a tip use the \"Vivid\" color mode for any of the Panasonic superzoom cameras it produces the highest quality images and sharp colors while the normal mode is somewhat bland.If you own a Panasonic superzoom camera sooner or later you are going to get dust/dirt behind the lens on the CCD sensor.  My recommendation to you is to search on Youtube and you will find a very well done instructional video on how to clean that sensor.  Prior to going on a trip or somewhere important make sure to clean the sensor in advance so that all your pictures are not ruined by that tiny piece of dirt. On a previous Panasonic model I sent the camera back to Panasonic repairs to clean the sensor for me and it took them over 2 months both times, while it takes me less than 5 minutes after learning how do not waste your time with their warranty service for the CCD sensor cleaning.", "Date": "February 19, 2014"}, {"Title": "Excellent camera for the snap shooter", "Author": "Feathermcht", "ReviewID": "R3KYHXNBRJY5KT", "Overall": "5.0", "Content": "we use it constantly.  the computer software is a little cumbersome, but it's learnable with a little experimentation.  Picture quality is more than adeqyate for my needs.", "Date": "February 7, 2014"}, {"Title": "ZS15 greatness", "Author": "menapheno", "ReviewID": "R1TFI8MGSCCVZ2", "Overall": "5.0", "Content": "This camera amazed me! I am still trying to find out all of the features it has. One feature that I found that was very convenient was the photo save on a video that was recorded. I can pause a part of a video and save it as a separate picture. Some pictures can look DSLR like. If you like to mess around with different settings to get the best picture then this camera can be good for you. There is the AUTO feature of course if you are a quick point and shoot photographer. This is one of my favorite cameras.", "Date": "November 4, 2013"}, {"Title": "Panasonic Lumix ZS15", "Author": "GUNDEALER1940", "ReviewID": "R10HHCDZ9UII18", "Overall": "5.0", "Content": "Darn, but this camera is great. I own a Nikon for professional work but this camera is super for my wife who could never work any camera. Simple controls and takes great photos.", "Date": "October 6, 2013"}, {"Title": "Perfect pocket camera", "Author": "Karma", "ReviewID": "R8YUVEVF256ZF", "Overall": "5.0", "Content": "The perfect carry around camera.  Easy to use with features matching much more expensive cameras.  Menu easy to use  Recommend over the newer versions of this camera.", "Date": "August 6, 2013"}, {"Title": "Can't go wrong", "Author": "Jonathan C Beaty II", "ReviewID": "R1YXQT9IC2CDLN", "Overall": "4.0", "Content": "This is a top level big zoom travel camera for a moderate price.  It has the best artificial intelligence available, meaning you get pretty sophisticated pictures from a point and shoot.  Very wide Licia lens combined with a 16 X optical zoom and manual controls if you want them.  First point and shoot I've owned with real clarity of focus.  The only downside is it doesn't have a viewfinder, but at this price point it can't be expected.", "Date": "August 5, 2013"}, {"Title": "Great camera, great price", "Author": "Richard Hoover", "ReviewID": "R3O5IF2A4AIVDC", "Overall": "5.0", "Content": "I have been EXTREMELY pleased with this camera since I ordered and received it about a year ago. Using it for personal family pix and also in my work at church documenting ministry events for publication and web pages. Best in daylight, takes a bit of special care for indoor/nighttime work but that's not a criticism. This is an impressive bit of technology.", "Date": "August 2, 2013"}, {"Title": "wonderful size and quality", "Author": "M. A. Matthews \"for Monkey Boy\"", "ReviewID": "R3DQE70SYJM2DL", "Overall": "5.0", "Content": "wonderful size, great price, great quality... almost has too many features ... once we dialed in the best settings for indoor, outdoor and action shots we just \"saved\" those and use those three settings only", "Date": "July 24, 2013"}, {"Title": "Takes very beautiful pictures", "Author": "Amazon Customer \"tros2112\"", "ReviewID": "R399SADU65TE6Y", "Overall": "5.0", "Content": "We bought this camera for our son for Christmas 2012.I haven't had a lot of hands-on experience with it, but I can vouch for the quality of the pics.He just returned from a trip, and I was struck by the quality of the pictures. They look like pics from an SLR.Hope this helps.", "Date": "July 1, 2013"}, {"Title": "Phenomenal lens", "Author": "Michael R. Kandle", "ReviewID": "R3KI84P9YSFGWV", "Overall": "5.0", "Content": "I've been swearing by Canon digital cameras for years.  This is the first Panasonic I've tried, and the picture quality that I've gotten from the Leica lens on this camera is very impressive.  I also bought a used Canon Rebel EOS SLR (used) with a 200 mm zoom lens for better photos at greater distances.  To my amazement, this little Panasonic takes better pictures with its 16X optical zoom than the SLR does with its 200 zoom.  Not only that, but the 30X digital zoom on the Panasonic also delivers very clear photos.  I have only one frustration with this camera.  The format of the HD video is not compatible with my iPhoto ap, and the videos have to be converted in order to be uploaded to youtube.  So be prepared for that inconvenience.  Still, the camera is a terrific buy.", "Date": "May 21, 2013"}, {"Title": "One of the best cameras", "Author": "David Boardman", "ReviewID": "R2MG4LCCN2OE7Q", "Overall": "5.0", "Content": "After painfully reviewing every camera in this category, I went with this one. It was an excellent choice and performed beautifully. Picture quality and movie quality are excellent and the camera is pretty robust.", "Date": "April 23, 2013"}, {"Title": "A great camera", "Author": "Jim", "ReviewID": "R2EN7ZNHAUDD7R", "Overall": "5.0", "Content": "After looking at many reviews, I decided on this camera.  It has come in above expectations.  On a trip I was able to take photos through a bus window while it was moving and the pictures came out focused.  I was amazed, as I had expected to see nothing bur blurs.  It takes a little time to learn all the functions but it is well worth it.  The long zoom on this camera worked great to get pictures from our ship of the shore line.  I would buy again.", "Date": "April 22, 2013"}, {"Title": "Takes great pictures", "Author": "card maker \"pooh\"", "ReviewID": "RHIP8NW2K9GXP", "Overall": "5.0", "Content": "Great value for the money.  My family has several professional photographers in it (not me), and I think my pictures with this camera rival their Nikon cameras with a similar feature range.  I had another Lumix before this one and loved it, and purchased the second Lumix which I am even more pleased with.", "Date": "April 22, 2013"}, {"Title": "Easy to use, small and lightweight", "Author": "N. Feakes", "ReviewID": "R3NH4UX9IFZ1NB", "Overall": "5.0", "Content": "I wanted to replace an old digital camera so I started to look around what was on offer.  I was very disappointed to read the number of reports of cameras that malfunctioned where the quality control was clearly to blame and the manufacturer did not want to know, charging as much to repair a camera that was less than one year old as the cost of a new one.Then I discovered this camera.  No recommendations of it being essential to buy an extended warranty here.  The camera is small enough to ensure I take it with me, takes fantastic pictures and is easy to use.  I took my first 50 pictures without reading the instructions (I always think you should be able to do this).  I like the separate slide switch for on-off, how many times I switched off my other camera instead of taking a picture - two buttons close to one another!  There is another slide switch that changes the camera from taking to viewing pictures - simple and foolproof.  There is virtually no time delay between taking one picture and being able to take the next.  The flash is small so you can't expect to illuminate the front of a building with it, but it is adequate for fill in as the low light abilities of this camera are excellent.  I am looking forward to taking this on holiday with me.", "Date": "April 19, 2013"}, {"Title": "Fast camera!", "Author": "Jennifer H. Cunningham", "ReviewID": "R28MQW1L378FL1", "Overall": "5.0", "Content": "I LOVE this camera.  I wanted a small camera that took fast shots.  I bought a 16 mp Canon for this reason and was very disappointed in the shot delays.  It took 6 seconds to get ready for the next shot.  This little panasonic is super-responsive, and takes the photo when the button is pressed.  It is almost immediately ready for the next shot.  I am very happy with it and my husband, who uses a fancy camera, says it is a very impressive point and shoot with tons of extra features.  This is a great buy.", "Date": "April 13, 2013"}, {"Title": "Perfect", "Author": "Richard Etzler", "ReviewID": "R37YUC8P6HRT9G", "Overall": "5.0", "Content": "I like the ZS 15, it does more than my ZS 7 and does it easier. All the features work well. I was surprised that the charging system is different. The 15 uses USB type charging with the battery staying in the camera. I like the 7 charger set up, where you take the battery out and charge it, so you can put a spare in the camera and keep shooting", "Date": "March 26, 2013"}, {"Title": "You can't beat the picture quality for this price!", "Author": "Howard W. Tennyson", "ReviewID": "R2SM4868H2EBOX", "Overall": "5.0", "Content": "This is probably my 5th or 6th LUMIX camera. I am a home inspector and take 50-100 pictures a day. The ease of operation and compact size make it ideal for my line of work. The 20x optical zoom allows me see roof anomalies without actually having to walk many roofs. The Leica lens is the heart and soul of this camera and never fails to disappoint. Word of warning though, DO NOT get it dirty or bump it around too much. There is a reason this one of many I have owned, they break easily. I keep coming back to this camera because I cannot get as good of pictures with other cameras. I bought a $400+ Olympus camera that is \"hardened\" but it takes poor quality pictures (I use that camera when I go into a crawlspace). The Lumix is a great camera and I highly recommend it.", "Date": "March 23, 2013"}, {"Title": "Love this camera!", "Author": "R. Brost \"mercerguy323\"", "ReviewID": "R3LHD8L2ALNQQ4", "Overall": "5.0", "Content": "Bought this camera a while ago and have had a chance to use it a bit before commenting here. First, let me say that the camera is replacing an older Canon SX 150IS. There are things I miss on the Canon but, think the picture quality from this camera is better. The camera powers up faster and is smaller than my Canon. I used the Panoramic setting for the first time and it came out great! I cannot comment on battery life as I use the Manual setting to take my photos and rarely use the flash. Not using the flash saves my battery life and using Manual allows me to set my exposure. Unfortunately, this is where my biggest gripe and possibly only one comes into play.This camera has an exposure meter on it that you view on the LED and it is helpful for getting what the camera says is the accurate exposure for your photo before you snap the picture. It's in the form of a sliding scale that when the setting is centered, indicates that you have the perfect exposure. The problem is, you have to go through the additional step of pressing the exposure button before adjusting your settings to the perfect exposure. This not only takes time, valuable time you may need to get the shot but, if you happen to forget to push the exposure button it takes you to either the auto bracket or timer setting choices. Not what you wanted and more wasted time. You then have to back out of the mistaken choice and then remember to hit the exposure button and then adjust accordingly.There is another way to \"engage\" the exposure settings and I find myself doing this more often rather than hitting the exposure button first. By depressing the shutter half way the exposure is hilighted and engaged, ready for you to make your adjustments to the shutter speed or aperture. BTW, the adjustments are made using the round disc on the camera with pressing up or down adjusting the shutter speed and the left and right adjusting the aperture setting. I find that if I am at all close on my settings then their usually isn't much adjusting needed. My Canon didn't require this extra step and thus I was ready to snap the picture sooner with it.Other than that small frustrating glitch, I would buy this camera again and again. It takes great photos, is fast to start, focuses fast and is medium in size. It fits in your pocket, just not like the really slim ones. Low light photos have been just average.", "Date": "March 16, 2013"}, {"Title": "Excellent camera for the price", "Author": "Fenton Hardy", "ReviewID": "R3L5I6BWN1838X", "Overall": "5.0", "Content": "After extensive comparison shopping, I bought this camera for my wife as a Christmas present. I am surprised at how good and inexpensive it is. It suits our basic needs. It is easy to use. The Image quality is quite good and there is little lag time in taking a picture. We really like the zoom feature.", "Date": "February 26, 2013"}, {"Title": "Great family photos & video for home amateur", "Author": "Michael Goldman \"Nerd Guy\"", "ReviewID": "R3UW4H97LDZFBE", "Overall": "5.0", "Content": "I have a great Nikon SLR but an older model with no video.  In addition it is a bit bulky to be toting around to family events.  My video camera is of the old tape type and it was always uncomfortable having to carry a video camera and a still camera.  The Lumix DMC-ZS15 does both really well and easily fits in my coat pocket.  It will not get all the low-light photos my SLR will get but it will get great photos in daylight and wonderful videos even indoors.  It is a fine point and shoot camera which is much easier to carry while visiting friends or out in the park with family.For video I mainly use it for my two son's wrestling and judo meets which are always indoors in large gyms.  Even in a large gym when I was on the opposite end, the 16X was all (or more than) I needed.  Most of the time I was happy with 10X-12X.  It shakes enough at 16X I cant imagine using a larger magnification.  The \"SH\" video is superb.  I didn't try the AVCHD because the SH is so good for my purposes - viewing on a 19\" monitor.I use Window's \"Movie Maker\" to edit which suits my basic needs fully.  For still photos you need more light than for video which is understandable since there are more pixels in the still photo.Get a spare set of batteries since video and some flash stills will drain your battery pretty fast.  I got about 30 minutes of video on a battery and was very glad to have the spare.  I changed batteries very quickly in mid-match one time losing only about 10 seconds.", "Date": "February 22, 2013"}, {"Title": "The most camera for the money", "Author": "S. Hallgring \"Guapote\"", "ReviewID": "RYTO07U3JJNVO", "Overall": "5.0", "Content": "I read reviews on many of the comparable models from Canon, Sony, Nikon etc.Every one that used this camera was impressed. I was a little put off by the special rechargeable  batteries but that was also addressed by one of the reviewers who recommended a Wasabi charger with a 2-pack of batteries for 26.00. which we bought and like very much also. This model has a \"shoot through the glass\" mode to focus beyond a window or a fish tank which is a very cool option for a serious aquarist. Two thumbs and a big toe up !!!", "Date": "February 19, 2013"}, {"Title": "Awsome", "Author": "Megahertz", "ReviewID": "R1AZV7R7FQT487", "Overall": "5.0", "Content": "Awesome camera! Did a lot of research before buying this camera and it really paid off.  The speed of this camera is great, no more waiting for the picture to actually take when u push the button. This thing will snap instantly and pictures look beautiful. It has a pretty good zoom too. This thing has to be about as good as it gets when it comes to a smaller camera with a long zoom. Good bang for your buck.", "Date": "February 17, 2013"}, {"Title": "Panasonic Lumix ZS15 12.1 MP High Sensitivity MOS Digital Camera", "Author": "Frank B.", "ReviewID": "R33HUBRZZN7GL3", "Overall": "5.0", "Content": "Great camera in a small package. 16X optical zoom. Rapid recycle time not to mention outstanding image quality.Nuff said.", "Date": "January 26, 2013"}, {"Title": "Great little camera.", "Author": "David \"StormChef\"", "ReviewID": "RJ68Y9Z5LMNVL", "Overall": "5.0", "Content": "Although not as compact as some other cameras, it is still easy to carry.  My wife fits it in her purse with no trouble.  The wide angle is wider than many so you don't have to cram yourself into a corner to fit everyone in the picture.", "Date": "January 23, 2013"}, {"Title": "Gotta Have a Digital Camera - might as well have the best", "Author": "Frank", "ReviewID": "R3DT1G079GU86Q", "Overall": "5.0", "Content": "Previously owned a Panasonic Lumix 10.  This ZS15 is just as good, if not better.  Easy to changer setup modes.  Photos at high resolution are amazing.  I'm sticking with Panasonic with future cameras, too.", "Date": "January 23, 2013"}, {"Title": "For a creative person", "Author": "MohaMAD", "ReviewID": "R9WMGOL0N5721", "Overall": "5.0", "Content": "Purchased as gift for friend and is now used everyday for work, play and family. Very good image and controls. Set up to download wifi now but using the included computer connection cables to store and print pictures/video is simple. Great price and the package was delivered out of reach of my UPS package eating canine.", "Date": "January 13, 2013"}, {"Title": "Very Happy with Camera", "Author": "MongooseMcGrath", "ReviewID": "R1KN3KYQS5B7IC", "Overall": "5.0", "Content": "I have had this camera for about 4 months now and I am very happy with it. For $200 this camera is an incredible value. The camera has a lot of features at a $200 price point. My favorite feature is the 16x zoom, which performs very well especially on a \"point and shoot\" camera. The night modes on this camera work better than I expected them to. The overall picture quality is very good, especially at this price point. Every Panasonic product I have purchased has performed well and this camera is no exception. I would highly recommend this camera to anyone.", "Date": "January 11, 2013"}, {"Title": "panasonic lumix zs15 vs. canon sx260", "Author": "kzar949", "ReviewID": "R143EL7UJBJS2M", "Overall": "5.0", "Content": "I will make my review very shortthe sx260 has 2 major cons and if these cons don't bother you then go ahead and buy it1)you probably wanna buy this camera because of the zoom range so with my experience taking a picture with the zoom anything more then 10x is extremely difficult and almost impossible unless you use a tripod (what u will not) but the zoom on the zs15 is great and powerful2)HANDLING. the sx260 is terrible in handling it has no grip the pop up flash is just were u put your finger it feels terrible in your hands vs the zs15 feels really comfortable in your hands i simply love it.so just to finish my review i had both cameras in my opinion the sx260 is not to compere to the zs15 the zs15 is much much better. ENJOY YOUR NEW CAMERA", "Date": "January 9, 2013"}, {"Title": "EXCELLENT VALUE CAMERA", "Author": "C. William Lakso", "ReviewID": "R11VHSUO9ZXH0F", "Overall": "5.0", "Content": "I have owned a digital camera for a good number of years.  It was at the time an \"advanced\" camera with more features than simply \"Point and shoot.\"  As with other early digitals, the LCD screen was very small, and the most significant shortcoming.My Lumix DMC-ZS15 has all of the features of my former camera, and more!  Fast starting, easy selections for overriding automatic for specific photos, the large, clear LCD display are all pluses!  Dim lighting is also no longer a problem, as this camera seems to find light where it does not exist!A superb value camera!", "Date": "January 5, 2013"}, {"Title": "Panasonic Lumix DMC-ZS15", "Author": "Keith H. Wooten", "ReviewID": "R2OFXXO828SFB2", "Overall": "5.0", "Content": "Excellent performance for the money. Take sharp and clear pics even in low light conditions. Did quiet a bit of studying reviews of many other cameras and very glad we purchased the Lumix ZS15.", "Date": "December 30, 2012"}, {"Title": "Great for the money", "Author": "Christina", "ReviewID": "R1ICRQAVRTE4AH", "Overall": "4.0", "Content": "Picture quality of Panasonic is wonderful. Camera functions were easy to learn. I love the panoramic option and low light night shots are impressive.", "Date": "December 29, 2012"}, {"Title": "Great camera.", "Author": "Cono", "ReviewID": "R16QFBWKNLP1WL", "Overall": "5.0", "Content": "i own the TZ1 and the TZ4, it was time to upgrade again. after a LOT of research (all brands) i decided on the zs15. couldnt be happier, i love this camera. and the price i got it for was incredible.", "Date": "December 29, 2012"}, {"Title": "a gift for my daughter", "Author": "MK", "ReviewID": "R2M390211W7FMT", "Overall": "5.0", "Content": "I have a Lumix FH20, which I really like so when shopping for a camera for my daughter I looked first to Panasonic Lumix, read the reviews on it, and decided it was what I wanted for her.when it came I charged it up and tried it out, using my camera to compare it to. I decided that I  want one too, and may soon order one for myself. The zoom is fantastic, compared to my Fh20 the sharpness of the picture was amazing.  So far my daughter loves it, after only 3 days of use.I would recommend it to a friend", "Date": "December 28, 2012"}, {"Title": "Great little camera - significatnly better than the Samsung we have", "Author": "David in Lansing MI", "ReviewID": "R2ZLUUT9L4H92C", "Overall": "5.0", "Content": "Bought a Samsung last year and hated it.  Blurry pictures, bad low-light pictures, etc.  This Panasonic rocks!  Our kids are competitive swimmers so we like to take a lot of action shots.  The zoom works great and the blurry pictures are few and far between.  By far, the best digital camera I have owned.", "Date": "December 27, 2012"}, {"Title": "Best snap and shoot camera I've seen", "Author": "Paul G.", "ReviewID": "R30U4OZ9ZZ2GL", "Overall": "5.0", "Content": "I've owned this for a few months now and it is wonderful. It has the best auto settings I've used. I almost always just leave it on auto unless I am trying to get a specific shot. It lets you adjust the shutter speed, aperture, iso and pretty much anything else you would expect from a more professional camera. Not that this a professional camera, but it does come close on a lot of shots. Everyone I've shown pictures to has been impressed. This is the best bang for your buck (at least when I bought it - I'm sure something new has already come out by now). I've always been disappointed by point and shoot cameras in the past, but never wanted to lug around a \"real\" camera since they are such a pain on vacations. This is the best of both worlds and for a reasonable price considering it's features!", "Date": "December 27, 2012"}, {"Title": "Excellent. A keeper. !!", "Author": "Mafalda Quinn", "ReviewID": "R2XZ4A5CBYFGMY", "Overall": "5.0", "Content": "I am not a techie person, therefore i was looking for a camera who would do a good job on its own, without fussing with too many instructions. This camera fits the bill perfectly. I set it on iA, cancelled the flash and off I went.  The night pictures without flash, the close up details, the wide angle, the super easy panorama, the very good and sharp video makes this camera a joy to use for people like me. Now I am looking forward to traveling with just 1 camera for all purposes of video and photos. A keeper.I have a Mac and do the editing on iPhoto.  The companion software CD seems to be for Windows only.", "Date": "December 18, 2012"}, {"Title": "Upgrading my digital camera gear", "Author": "timhief", "ReviewID": "R2Z73R243RAU8C", "Overall": "4.0", "Content": "After my NIkon digital camera was damaged I decided the replacement camera should be considerably better.  My daughter has the ZS-8 she received as a gift a year ago for Christmas and I thought the photos were better than the Nikon produced.  I read reviews of all the more current models in the class of 2012 for this level camera and found the Panasonic to be highly regarded. I chose this one over the ZS-20 because a number of professional reviewers concluded the image quality was better even thought the pixel count was lower for the ZS-15.The battery life is particularly good for my needs.  I rarely use flash so I can last nearly two weeks of picture taking without a need to recharge.  In fact, I never bring the charging cable with me on one week trips for that reason.I haven't been disappointed in my purchase. It takes great pictures and the video quality is superior too. I've owned my camera now for over three months and have been fully satisfied with it in all aspects.  I think you will too.  I also found the price to be much lower on Amazon than any I found in the stores.  (Not many places still carry this on their shelves at this point)", "Date": "December 11, 2012"}, {"Title": "great compact camera", "Author": "Bruce Wolf", "ReviewID": "R1F5QLKKLTWU4C", "Overall": "5.0", "Content": "I am an advanced amateur photographer and wanted a pocket size camera when carrying my larger one would be awkward. I have had 3 Panasonic cameras and have loved every one. The quality of the pictures is excellent, reflecting the great Leica lens. There is plenty of flexibility in settings to give me the range of photography that I want. The flash, while not as strong as an external one, is certainly adequate for most shots. I can recommend this camera without reservation.", "Date": "December 11, 2012"}, {"Title": "Great little camera", "Author": "Clive Daniells", "ReviewID": "R7FUIRXN0NRIF", "Overall": "5.0", "Content": "i bought one of the very first ZS series some years ago and I was always very happy with it.This new camera is a very big improvement on the older version and I can thoroughly recomend it to anyone who wants a compact camera with a large zoom and a good wide angl lens capeability.", "Date": "December 4, 2012"}, {"Title": "Great for everything it's designed to do", "Author": "judicious buyer", "ReviewID": "R1P5NNRCUDIW9T", "Overall": "5.0", "Content": "This is a newer version of the same model we repurchased after losing our camera on a trip. We are pleased, were pleased with the prior one as well. Amazing pics from such a small camera, comparable to my old high-quality SLR 35mm Ricoh.", "Date": "December 1, 2012"}, {"Title": "AWESOME", "Author": "R. Winget", "ReviewID": "RTFCZWCH9SJVK", "Overall": "5.0", "Content": "Previously only owned Canon digitals and thought them to be the best.  I was pleasantly surprised and astonished at the quality this produces and the many features of the LUMIX for the price.  I highly recommend!", "Date": "November 30, 2012"}, {"Title": "Great camera with nice zoom and good iso", "Author": "Alexander Kammermeier", "ReviewID": "R3DSNYGEMI9F1C", "Overall": "5.0", "Content": "I am not a camera expert and use mine more or less solely for point and shoot actions.But the pictures it produces in more or less any light conditions are to my full satisfaction.For that price - the best I was able to find.", "Date": "November 26, 2012"}, {"Title": "Does the Job", "Author": "W. Terry", "ReviewID": "R2RZV357M8100", "Overall": "5.0", "Content": "Had a basic LUMIX before that was a very good camera except had a limited zoom.  This model's zoom is so much better and no lenses to have to carry.  So far very pleased.", "Date": "November 5, 2012"}, {"Title": "Great travel camera", "Author": "Sauceboyz", "ReviewID": "R2KFCENB5TPBM1", "Overall": "5.0", "Content": "This camera is fast, takes good pictures and is versatile enough to be the only camera you need while travelling. The zoom is excellent and the menus are relatively easy to navigate. Takes reasonable movies too. I leave the SLR at home now when I travel.", "Date": "October 20, 2012"}, {"Title": "I tried to hate it...but I can't.", "Author": "Jimmy A.", "ReviewID": "R49N6RUDP7B9C", "Overall": "5.0", "Content": "Bought this cam on a whim since I needed something small. I have a d90 and an LX5 ( that my wife uses) and did some comparing with these.  Now the low light capability is the only thing I am not happy with the zs15 after testing several shots upon opening the box.. Anyway, I wanted to return the zs15 but somehow, I continued to use it, exploring its capabilities and pixel peeping as I went along. The copy I had gave me really sharp and brilliant pics during the day and outdoors. At night and in low light, it's no that bad as long as you keep it steady ( to compensate for the slow lens, hence slow shutter speed).  Finally, I begin to see that for the cost of $165., this was an amazing buy! This is a very versatile camera with lots of reach and fun to use with all those art filters. In the end, I'm gonna keep it! This camera has a slow lens so if you want low light optimum shooting, look elsewhere but other than that, this camera produces very good and sharp pictures!", "Date": "October 13, 2012"}, {"Title": "Makes a lovely gift", "Author": "Joseph Spiegel \"Joe\"", "ReviewID": "R1A9QGYGJDFYWY", "Overall": "5.0", "Content": "I can't give a full in depth review because I gave this camera as a gift. Still I did check it out and was very impressed with the build quality. It has a Leica lens but also has an air of Leica quality. The fit and finish the small screws the switches on the camera all scream high quality. I was very impressed.I took some quick pictures and was also impressed with the ease of use. I wanted the gift to be a camera that could take high quality pictures yet not be too difficult to use. This fits the bill very well. The only neg I can muster is the lack of an external battery charger. I bought a kit here on Amazon with extra batteries to solve that problem. Still, why do cheaper cameras come with a charger but not this one. I would deduct 1/2 of a star for that omission. Still overall a wonderful camera that in my short time with it, is making me very jealous of my brother, who's getting this for his birthday.In my quick summation, a very nice point and shoot camera that's small enough to pocket. I did notice the price rose $35 sice I bought it last month. This makes the ZS20 a more reasonable upgrade now. Hmmmmmm.", "Date": "September 24, 2012"}, {"Title": "good size, very good photos", "Author": "tree19510", "ReviewID": "ROKF3N3ZXR53G", "Overall": "4.0", "Content": "This past July, I purchased a DMC zs15 to replace a 6-year old Canon point & shoot. This was done after some extensive research between Canon, Nikon, Sony, Fujifilm, and Panasonic. I was looking for a good travel zoom. I particularly looked at the Nikon Coolpix S9100, Canon Powershot SX230HS & SX260HS, and the Sony equivalent. My daughter purchased a Canon Powershot SX120is about two years ago, but she has not been too happy with it. It's very \"slow\" she says. After the research, it appeared that the ZS15 met the requirements I had in mind; a good, shot to shot time, and optical stabilization a good telephoto but not excessively long and good to very good sharpness, and a reasonable price.My wife insisted that I set it aside for my birthday. Well that was about 2 weeks ago. Since then I have really enjoyed the camera.I really wish thought that they would include a paper manual instead of having it on the DVD. I followed the advice of many reviewers and ordered the Wasabi Battery Charger with 2 batteries, and I am glad I did. It seems as though the camera goes through batteries much more quickly than advertized.I really like the intelligent auto mode and HDR. They do what's expected and the pictures are very good.. I'm still familiarizing myself with all the other modes. The Thru-Glass mode looks interesting. My wife and I like to travel and this may be very convenient to take pictures while in a vehicle.The only reason I am giving this four stars is that I haven't figured out all the possibilities of what the camera can do. And I am somewhat concerned about how quickly the battery runs down.", "Date": "August 28, 2012"}, {"Title": "Amazing Zoom... Perfect for the Novice", "Author": "Christopher Smith", "ReviewID": "R1NCVM46I0C5CC", "Overall": "5.0", "Content": "I took the plunge on this without doing much research, so I wanted to add another 5 star review to help others... I really like this camera and its super ability to zoom in past the optical range and still take some awesome pictures.  It has a quick shutter speed, and the rest of the features are great.  I haven't found anything I don't like about it.  Great camera for the price, especially when on sale!", "Date": "May 17, 2012"}, {"Title": "Waste of a lot of money", "Author": "Rebekkah L. Inman", "ReviewID": "R3MD1II4NTPPNV", "Overall": "1.0", "Content": "I did enjoy the camera for its 11 months.  We bought this camera because I read so many good things about it.  I researched good, basic, point and shoot cameras for weeks and came to a decision that this was the one to get.  Being a person who doesn't know much about photography I generally use the iA mode or the camcorder mode.  I noticed at 11 months that the pictures we grainy looking. So now, a few months later I take it to Best Buy to have this problem diagnosed and it turns out the sensor is going already.  The girl asked me if I take a lot of pictures and that sometimes you need to replace sensors every 6  months if you do.  I take pictures of my baby, but not over the top.  Who would buy a camera that will need to be repaired costing half the value of the camera in only 6 months? If I had known about this being an issue with Panasonic brand I would not have purchased it.  That $250 could have gone to a more reliable camera.", "Date": "June 27, 2013"}, {"Title": "My favorite compact camera ever!", "Author": "Susan Obrien \"Shutterbug\"", "ReviewID": "R16GPY52DR259L", "Overall": "5.0", "Content": "I love most everything about this camera. The image quality is excellent and the zoom amazing. I had a copy of the Advanced Features manual printed and bound and it's amazing how they squeezed everything into this nice small and lightweight product.  I live in the deep south and the sun is very strong. There is some difficulty viewing the screen in direct sun light. I'm still reading the manual and there is a power boost to try in that situation and I'll give that a try. It's still better than most. I've owned a lot of cameras over the years including many DSLRs and I'm very impressed with this unit. I did buy a battery charger that came with two extra batteries, car charger, and European adapter. Also, the image stabilization is fantastic. I have very shaky hands and I don't think that I've had a soft picture yet.", "Date": "August 26, 2012"}, {"Title": "Panasonic Lumix zs-15", "Author": "Delhi Bob", "ReviewID": "R21Z49MQDISGRK", "Overall": "5.0", "Content": "The camera takes very good pictures. Easy to operate after reading operations manual.  Takes excellent videos.The only minus is that the operations manual is on  DISC.", "Date": "August 28, 2012"}, {"Title": "Love this camera", "Author": "Chris B.", "ReviewID": "RVCGC9EHBZ73", "Overall": "5.0", "Content": "I bought this camera for my teenage daughter back in June.  She was so happy with the speed that it snaps photos, that I started using it to try it out.  I bought myself one in August, right before I left for a 10 day trip to Japan so my learning curve was on the trip.  I am very happy with this camera and the picture quality and the speed that it snaps photos.  I took group shots indoors and outdoors, lots of landscape shots and even took pictures and video of lanterns floating down a river at night at a local festival.  Happy with everything!  The bundle I bought included a 16g sd card so I never had to worry about running our of space. I only had to charge the battery half way through my trip and that was after taking lots of video shots. Would buy this one again.", "Date": "August 16, 2012"}, {"Title": "Very nice Camera so Far", "Author": "Edward W. Vidra", "ReviewID": "R35QOYZR8KL72D", "Overall": "4.0", "Content": "Been using the camera for a good month now and feedback from my family so far is that takes crisp and very vivid color pictures and nice short video's.  It takes photo's very quickly (focus and shoot time) so always getting a good action shot for my son's sporting events (hockey player).  Seems to be a winner so far :>", "Date": "August 13, 2012"}, {"Title": "Great camera", "Author": "OrangeFan", "ReviewID": "RLZ0ADZKUUHXW", "Overall": "5.0", "Content": "This compact camera has a lot of features considering it's size. Takes nice shots and battery life is good. Recommended!", "Date": "May 23, 2014"}, {"Title": "Excellent camera", "Author": "Dixie Jones", "ReviewID": "R3D1BRJ6TBZ0RE", "Overall": "5.0", "Content": "I love this camera; I have never used a camera so much.  It takes wonderful pictures and you do not need a tri-pod to make sure the camera stays still.  It is nice looking and fits nicely in my smallish purse.", "Date": "April 7, 2014"}, {"Title": "Great for Video", "Author": "D. Coe", "ReviewID": "R2DNEYR15NTYZE", "Overall": "5.0", "Content": "I bought this for use as a video camera and so far it's been great and the sound and video are good quality.", "Date": "January 17, 2014"}, {"Title": "Pretty impressed", "Author": "Graybear \"Graybear\"", "ReviewID": "R2HDST8U83CXHC", "Overall": "5.0", "Content": "I took a long time getting a new camera - I did a lot of looking around and reading reviews.  On a recent trip I saw other people's photos and noted how beautiful some of them were, and I noticed my phone was taking better pictures than my camera and realized digital photography had gotten a lot better.  This camera does a lot more than I'm ever going to use, but the basic functions I was looking for were 1) a great lens and 2) a camera that would be smart enough to take in all aspects of my surroundings and take a great shot.  I know photography and I travel a lot.  I find most times when I take photos, events are happening and I want to point and shoot immediately without a lot of setup.  This camera does that and does it well.  I took a while and read the book and set up the auto features, and now leave the camera on \"intelligent auto\" all the time.  The lens and autofocus do a great job both indoors and out, and I've gotten lots of excellent photos in fairly low light situations too where I wasn't expecting to get much of a shot.  I have used a couple of the special modes, e.g. the panorama mode works very well and the burst mode takes a nice series of shots, but mostly it's just point and shoot.  When I'm traveling, I don't want to live my life through the lens of a camera - I want to experience it and snap a picture or two to take along for memories.  Battery life is fair.  If you do a lot of shooting, get an extra battery or two, and you might consider getting a charger as well so you don't have to use the camera for charging.  I got the Wasabi Power Battery (2-Pack) and Charger and they worked well.  I keep the camera in a case in my pocket or on my belt.  I just returned from a trip overseas for 2 months and took over 2500 pictures.  I am more than satisfied with the results.  Not all were terrific, but with my method of shooting you cannot expect more.  Where I took a little extra time in odd lighting conditions, I got some pretty spectacular shots.  This camera is slightly larger and heavier than my last camera, but the pictures it takes are far superior.Overall, I like the camera and would recommend it.", "Date": "January 13, 2014"}, {"Title": "Great Camera", "Author": "Frances from Beaufort", "ReviewID": "R33HJ3XAEXCZ12", "Overall": "5.0", "Content": "It is small enough to put in my purse so I can carry it with me everywhere.The quality is fantastic, ease of use.", "Date": "January 2, 2014"}, {"Title": "Simple to use", "Author": "Cheryl Barnett", "ReviewID": "R1J2K09KZ5R5Q6", "Overall": "5.0", "Content": "Simple to use and takes super clear pictures.  Love the rechargeable battery which has a long life instead of other cameras which use regular batteries that require replacing every 20-40 pictures.  Have had a previous Lumix camera as well as other brands such as Canon and I can't get the quality of pictures that I get with the Lumix from the other brands.  Will keep buying Lumix cameras.", "Date": "December 29, 2013"}, {"Title": "Great little camera", "Author": "James M Hahn", "ReviewID": "R2GBLY8E7TMJGY", "Overall": "5.0", "Content": "This is a lot of camera for the money. It takes great pictures and has lot of features other camera of this price don't have.", "Date": "December 20, 2013"}, {"Title": "Excellent camera!", "Author": "G. A. Langenwalter", "ReviewID": "R3TSWNZI9ES7FO", "Overall": "5.0", "Content": "I used its predecessor until it died.  I liked it so well I bought this as a replacement.  The long zoom is really worth it.", "Date": "December 15, 2013"}, {"Title": "Best long zoom pocket camera on the market", "Author": "John R. Williamson", "ReviewID": "R3MB2A5FAFICE5", "Overall": "5.0", "Content": "My old camera got dirt in the lens and it was out of warranty and would have cost a lot to get fixed.  This is my 3rd Panasonic Lumix camera.  I think it is the best long zoom on the market.", "Date": "December 13, 2013"}, {"Title": "Great Pictures - Easy to use", "Author": "Riderchap", "ReviewID": "R2N0NW7AY3HRN2", "Overall": "5.0", "Content": "I have this camera for more than a year now. I wanted a pocket sized camera that takes good pictures for any scenery / lighting without doing any settings adjustments, just take it out of pocket and click. I use this camera in the \"iA\" mode and this camera just does that, I wanted good pictures but this gives me great pictures and amazing videos! Simple to use, comparatively cheap (when I bought it I paid around $180) when considering the image quality.", "Date": "December 10, 2013"}, {"Title": "Fine camera --  not ideal for Mac OS/ IOS / Ipad", "Author": "Prof Wilson", "ReviewID": "R23N818YPZJNM0", "Overall": "3.0", "Content": "Handsome.Battery life seems okay, not terrifically long but normal.The camera is fine at taking pictures, recording video.The digital menu interface isn't all that great. It's not always clear what goes where -- e.g, \"upload\" - but that may have to do with the Mac compatibility issue.The scene menu could be better, it has \"party\" rather than what that might mean visually. Not clear what one would use for shallow depth of field, profile.Main issue is uploading to Mac. Photos can be uploaded by i-photo to a mac computer or to an IOS device, but control of that is not great. Bigger problem is uploading movies. The movies are stored in a particular file and structure that mac doesn't recognize, whether from the camera as usb or from the disk/drive/memory stick. I did not see clear instructions about this on Panasonic's site or on the boards. There seem to be some work arounds if you have your desktop version of itunes. Ipad particularly makes transfering images difficult since it doesn't have a usb port -- the adapter did not work on the memory stick for me. Probably best to skip if you want to take video and work with mac/apple products.This may be more of a problem on the Apple side, but it seems a camera maker would want their equipment to work more easily with those systems and if it's a file structure question, at least give a set up option for mac users. Also, Panasonic should offer better help /guidance for Mac users.", "Date": "December 10, 2013"}, {"Title": "Recommend for amateur photographer. Good value for the money.", "Author": "Edward F. Foley \"Zappa fan\"", "ReviewID": "R3UNRAWZKDH1ZW", "Overall": "5.0", "Content": "Very good camera. Compact size, ease of use, impressive zoom feature and quality pictures make for a great combination for the amateur photographer. No view finder. Would highly recommend the additional purchase of a camera case(Case Logic) to protect the camera when taken outdoors. We upgraded to a 64GB extended memory card.", "Date": "December 4, 2013"}, {"Title": "Dusts on sensor", "Author": "Alan T.", "ReviewID": "RACNIU9K2UW8N", "Overall": "3.0", "Content": "After 1 month use in my trip in South America, I noticed there was one grey spot (3mm in diamter) on the LCD. Soon another spot appeared. Sent it to a camera repair shop and was told these were dusts on the sensor which could enter the inside of the camera through the zooming in and out of the lens. Never had this kind of problem before. Shocked and disappointed, because it is a limited North America warranty, and was told even it is a global warranty, local service centre willl still charge a hefty service charge for cleaning the sensor.", "Date": "December 2, 2013"}, {"Title": "OK camera, TERRIBLE customer service with Panasonic", "Author": "Kms", "ReviewID": "R30GZ2K71RXCL4", "Overall": "1.0", "Content": "Camera might be OK, but customer service was TERRIBLE. I've never experienced anything like this. Over 5 months, going on 6, to receive a refund check for a camera that crapped out under warranty.While the camera worked (read on) it took OK pictures. In low light, it was very difficult to take decent pictures, even with the appropriate settings. I had a much better experience with this using a Fujifilm finepix camera which was easy to set up manually, had a useful \"nighttime\" setting, and it took beautiful low-light pictures. Also, the battery life on this camera is NOT impressive. Also, my old Fujifilm was much faster.All of that I could live with since I just wanted a decent point-and-shoot with good zoom, but the real trouble began when the LCD screen developed problems while under warranty. A day or two before an overseas trip, the camera simply stopped responding, and all I could see on the screen were vertical colored lines. Terrible timing, and a big surprise because it had worked perfectly the day before. It's a good thing I had my old Fujifilm to fall back on. I sent it in for repairs (it was under warranty!) and it has taken OVER 5 MONTHS to receive the promised refund.I have called and called to find out from the customer service rep with an attitude about the status of my refund only to be told that it takes 4-6 weeks to send a check! (This is in September, sent it in in June) And when I waited that amount of time, I called and found that my refund was reprocessed due to some sort of computer system switchover on their end (??? Dropping the ball here, Panasonic, get it together). (This is October) Wait another 4-6 weeks. And then I call again - only to find that they messed up the shipping address and didn't tell me. (It's now November, I sent the camera in in June) So finally I get that cleared up and I have to wait another... how many weeks? By the time I get my $200, it will be 6 months!!!!!!!This is an extremely disappointing experience and as  a customer, I was not treated with respect. It should NOT take months and months to simply send a refund check. I'm a patient woman and would have been OK with waiting if Panasonic addressed the fact that they offered awful service and offered to compensate me in some way (fruit basket, maybe?), but that just didn't happen. In fact, I have emailed several times to have someone at Panasonic's customer service and have been completely ignored. I've asked for someone to make this situation right, and have received NO reply. Nothing? Come on Panasonic, shame on you.", "Date": "November 25, 2013"}, {"Title": "Great Panasonic camera", "Author": "Karl E. Nordberg \"karl\"", "ReviewID": "R3LOV98OI07DBL", "Overall": "5.0", "Content": "I really like this Panasonic camera.  The photographic results are excellent for this amateur. The camera has a good solid feel to it, the long zoom is quite smooth, and the controls somewhat intuitive. I printed out the instruction manual from the web and that has helped. I have had no trouble with the battery holding a proper charge.  Panasonic cameras are always highly rated.", "Date": "November 25, 2013"}, {"Title": "great camera for the price", "Author": "Matrixunloaded", "ReviewID": "RGRWUR15K7DTG", "Overall": "5.0", "Content": "This was an excellent camera – I say \"was\" simply because somewhere it got lost. I have replaced it with a DMC-S20, which seems to be performing admirably. at the time of purchase I had surveyed the competition and found the Panasonic to be the best value for price and quality. When I had to replace it, I found the same thing.", "Date": "November 19, 2013"}, {"Title": "Comments about Panasonic Lumix ZS15", "Author": "Garlon \"Garlon\"", "ReviewID": "R3UIXL7VWP9XEJ", "Overall": "5.0", "Content": "This camera has performed as advertised. It has a relatively fast shutter speed which I was looking for. Along with fast shutter speed, it is the ability to shoot panoramic shots that made this the one for me. For me the picture quality is equal to Canon's quality, and I have always been a fan of Canon's picture quality.", "Date": "November 11, 2013"}, {"Title": "Dust on sensor after only one year of use marring all photos", "Author": "Bob Allen \"fastduke\"", "ReviewID": "R2BDSLW67OGZ0F", "Overall": "1.0", "Content": "After only one year of use our Lumix ZS15 got a particle of dust or hair inside the camera, either on the sensor or on the back of the lens, meaning all pictures showed the foreign article. Panasonic offered to clean the camera for $180 plus shipping. Do a Google search on this, and you'll find that these cameras are subject to this type of dust. I did not want to pay the $180, so we bought a Canon SX510 HS.We'll never buy another Panasonic Lumix point and shoot.", "Date": "November 8, 2013"}, {"Title": "Fantastic Pocket Travel Zoom!", "Author": "Amazon Customer \"Dave-in-Denver\"", "ReviewID": "RFQT28I59KQ57", "Overall": "5.0", "Content": "Worked fantastic for me!  I took nearly 5,000 pics on a 30-day trip to England to visit museums, castles, cathedrals, country estates, etc.  A vast majority of my pics were interior shots without flash and using the zoom to reach my subject.  I have one great pic after another.  Very impressed.Spent weeks reading lots of review on lots of different pocket travel zoom, some newer than than the ZS15 and some even older.  The ZS15 is the one I picked and got it from Amazon late summer 2013 ... so glad I did.  I had high expectations and worked even better than I had hoped.  Leica lens and Panasonic software resulted in excellent sharp good color pics.I tested the camera inside my house prior to approximate all the indoor low light and long reach pics I expected to on our trip.  Very happy to have found that using the automatic settings were excellent.This is how I set the camera for fast sharp point and shoot pics.1. Set the camera to \"IA\" for Intelligent Automatic; auto focus, auto exposure.2. Set it to auto stability.3. Set the quality to \"Happy\"... silly name but bumps the sharpness/brightness up a notch... perfect for low available light pics.4. Set flash to off.FYI: If you use the P-mode to set your own auto settings instead of IA mode you can set the WB setting to \"AWB = auto white balance\" which I found to have good color balancing in low light shots.I just hooked the camera to a lanyard, looped it over my neck and kept the camera in my shirt picket.  Perfect for the 100-200 shots a day I took.  Because of all the automatic settings I could really just point and shoot (other than frame and zoom).  Spent no time on camera settings.  I could enjoy our vacation without it becoming a continuous series  technical photo events.  Pics are smashing.I sometimes had to swap in a fresh battery late in the day when I went reached the 150 shot mark.  That's a lot of pics with all the automatic settings running and constantly using the zoom to frame the shot.Would I buy it again and recommend to a friend?  Absolutely.", "Date": "October 24, 2013"}, {"Title": "Great Camera", "Author": "CR \"wondraone\"", "ReviewID": "R1HUVK1YWPBU91", "Overall": "5.0", "Content": "This camera has tons of features that you might expect on a much more expensive unit. The quality if great. Easy to use. It is difficult to keep up with the new features that keep coming out but this camera has enough for the point and shoot enthusiast. My advice is to get a backup battery that is specifically for this camera. Imitations can be damaging.", "Date": "October 2, 2013"}, {"Title": "Pocketable, wide range, does almost everything", "Author": "Richard C. Palson", "ReviewID": "R177NQ5262U4R2", "Overall": "5.0", "Content": "If you want a nice little camera to carry almost anywhere, this may be it. It suits me. The picture quality will satisfy most people who are looking for the shot that that comes when an SLR is not possible.", "Date": "September 21, 2013"}, {"Title": "very good pocket camera", "Author": "Patrick J. Murphy \"project_starter\"", "ReviewID": "RH9GIXKYP3VG7", "Overall": "5.0", "Content": "This camera works so well I find myself using it more often than my Pentax SLR. This is my second Panasonic camera. I will buy Panasonic again. Easy to use camera with long battery life. Great pictures, It even has optical image stabilization that works great. Love it!", "Date": "September 10, 2013"}, {"Title": "Flimsy", "Author": "mcquilr", "ReviewID": "R1Q6J1WLV6P6HP", "Overall": "3.0", "Content": "The zoom button on my camera broke in about six months of purchase. The repair centre noted it was in \"very good condition\" ie I had not dropped it or caused the damage. Unfortunately as I bought in the US my warranty was not valid in Ireland and I had to pay to have the camera fixed.Apart from that pictures are reasonable but have to admit my previous lumix wa much better", "Date": "September 2, 2013"}, {"Title": "So far so good...", "Author": "Antonio Giusti", "ReviewID": "R3INQIMVHAYJ5N", "Overall": "4.0", "Content": "Camera works fine, though it has lots of options, and it's taking me a while to get used to them.  Still haven't figured it out entirely, but the automatic setting works okay.  I wish the night shots were clearer and more defined -- white lights tend to blow out a bit -- but that may be something I've got to do myself, using manual settings.  Otherwise, very small, light; I'm pleased.", "Date": "July 28, 2013"}, {"Title": "Great camera", "Author": "Retired Olde Farte", "ReviewID": "R3V1L4P3Q3JK95", "Overall": "5.0", "Content": "I had an older version of this camera, which got dropped on a sidewalk and the cost of replacement or repair exceeded the value.  So it was replaced with this updated product, which works pretty much the same way.  I have loved my Panasonic point and shoot cameras - easy to use, high quality pictures, and this one is even better.", "Date": "May 27, 2013"}, {"Title": "Panasonic LUMIX DMC-ZS15", "Author": "DR. CARSON TODD", "ReviewID": "R15SNXU2NLTUVC", "Overall": "5.0", "Content": "Truly astonishing performance!Easy to use with excellent results. Downloaded images are first quality.Would recommend to anyone on vacation, cruise or family reunion.", "Date": "May 27, 2013"}, {"Title": "Very Good Travel Camera", "Author": "wonkywill \"789\"", "ReviewID": "R2Y1LFD9ZML4JY", "Overall": "5.0", "Content": "This camera is very easy to use and produces excellent results.  It's quite light weight-wise, but much bulkier in size than the Canon 300HS which I also own.  The images are comparable between these two cameras, except in low light, where the 300HS' wider aperture captures cleaner images and videos.  Found these selling at around a buck fifty each around Christmas time, so I snatched three.  At that price, these are great cameras.  My wife uses hers to take pics of birds in the back yard.  The 16x zoom is handy in that regard, and the 300HS just doesn't work well for that purpose, even with digital zoom.  People complain about the lack of external charger, but you can get one for cheap.  I actually find the USB charging very convenient.Now that I've upgraded to a Nikon P7700, I'm considering donating the ZS15 to my daughter.  But maybe I'll hold on to it while I'm still learning to use the P7700.  :)", "Date": "May 16, 2013"}, {"Title": "Good camera", "Author": "MsKat", "ReviewID": "R2O2QNWU36XTRD", "Overall": "4.0", "Content": "This is a very good camera; I really like the features.  After a few months of being put in a pocket on an almost daily basis, lint got on the lens and now a black spot appears on the image that must be edited out.", "Date": "April 20, 2013"}, {"Title": "No Surprises.", "Author": "Clifton Pierce", "ReviewID": "R25I1QTNMLI8D5", "Overall": "5.0", "Content": "This is the second Panasonic Camera I have had and both were excellent cameras with great features for the money.  Shipping was prompt and product was as described.", "Date": "April 20, 2013"}, {"Title": "Takes great pictures!", "Author": "Neil G.", "ReviewID": "R1I241YZVKDS62", "Overall": "4.0", "Content": "Although the programs this camera offers are a bit difficult to master, it does a good job with 'automatic'setting for 'Push Here Dummy'  amateurs like me!", "Date": "March 25, 2013"}, {"Title": "Excellent Product", "Author": "seminole wind \"seminole wind\"", "ReviewID": "R3FDTRUYER04UI", "Overall": "5.0", "Content": "Bought the cameria for my wife.  She loves it.  Easy to use.  Allows her to take some quality photo's.  Could not be happier with it.  Customer service was excellent.", "Date": "March 4, 2013"}, {"Title": "Excellent little camera!", "Author": "Jeannette S", "ReviewID": "R3O8IVSMPV4XBR", "Overall": "5.0", "Content": "My first digital camera was a Kodak Z740. My next 2 were Canons: first the S2 IS, then the S5 IS. I have grandchildren, and while the Canons are my favorites for outdoor supermacro shots, this panasonic is perfect for everything else.The Lumix DMC-ZS15 is great for both experienced and inexperienced users. It features manual settings for tweaking as well as a very well implemented iAuto setting for those who literally just want to \"point & shoot\". The pictures turn out very well using iAuto whether I am capturing my granddaughter's antics indoors, my dog racing about in the snow outside, sunsets, snowstorms, or full sunlight shots. I am very pleased to own this camera.The only things I had trouble with at first were the menu setup (macro setting is difficult to find), and the small size of the camera itself. The size was an issue only because I was used to handling larger cameras.I wish the camera had lens attachment capability as I like to use ND & other filters, but due to physical configuration, it would not be realistic to expect lens attachhments to work.I purchased the ZS15 Panasonic for my son & his wife, and I recieved a ZS15 myself as a gift. I would recommend this camera without reservation!", "Date": "February 14, 2013"}, {"Title": "Wonderful Pictures", "Author": "L. Lang", "ReviewID": "R22F4DQ3AH130M", "Overall": "5.0", "Content": "I received this camera as a Christmas present from my daughter, and I am in love with it.  I recently took it with me on a vacation to Las Vegas and the pictures that I got of the mountains and buildings on the Strip are fantastic.  I also took it on a trip to the Grand Canyon and Hoover Dam and the zoom is so amazing that I got clear close-up pictures even though I was in an airplane flying above them.", "Date": "January 10, 2013"}, {"Title": "Great Pocket Camera", "Author": "E. Flaga", "ReviewID": "RD2L5BPGZ6UKJ", "Overall": "5.0", "Content": "I bought this camera to replace a Panasonic DMC-TZ4 that I had accidentally destroyed. This camera is an amazing value for its size. The additional features and more compact size make this camera a great. I even paid $40 less for than the TZ4.", "Date": "January 10, 2013"}, {"Title": "Very happy with camera", "Author": "D. Davis", "ReviewID": "RHMBXJA6RZIHU", "Overall": "4.0", "Content": "only found 1 problem with this camera, that being, around the edges the picture is distorted.  Other than that the camera is great.  The screen on the back is large and clear.  The operation is easy and instructions are easy to understand.", "Date": "December 26, 2012"}, {"Title": "best point and shoot", "Author": "M. Canniff", "ReviewID": "R12LX4A97B0VW4", "Overall": "5.0", "Content": "this is the best camera i have had.easy to use,set up.takes great movies,very crisp, clear.same with pictures,just point and shoot,imagine that.really its that simple.put camera in auto mode and it does the rest,really well too.i tried canon a3400 before this one and what a big disapointment that was,could not focus movies or pictures,that got sent back after a week.you will love this camera,i do.", "Date": "December 21, 2012"}, {"Title": "good to shoot ,easy to use!", "Author": "kensou chris", "ReviewID": "R287IGBF4ORTHT", "Overall": "5.0", "Content": "good shoot in auto mode, i can just use it with the auto mode,but it's fine. the other question,the CD disk was broken when it delivery.", "Date": "December 17, 2012"}, {"Title": "Very happy", "Author": "Rachel Hall", "ReviewID": "R123EYJ6GH5OUN", "Overall": "5.0", "Content": "I've had this camera about a month now and am really enjoying it.  Simple point and shoot features, but the ability to choose more advanced options if desired.  Loving the quality of the pictures and videos.", "Date": "December 14, 2012"}, {"Title": "Excellent pocket-size camera", "Author": "AHL", "ReviewID": "R1OM3IZ0WZWAS4", "Overall": "4.0", "Content": "I bought this camera for my wife wanted a point-and-shoot camera. Both my father and daughter have used similar Panasonic Lumix (the older) models with excellent success in quality pictures.For the novice, it takes a little bit of getting used to to get all the settings right. But once achieved, the results are very very good. Would highly recommend this camera to a novice or as a second camera to carry along for those unexpected moments.", "Date": "December 14, 2012"}, {"Title": "Great Camera", "Author": "anysgirl", "ReviewID": "R3QINGYPKC419D", "Overall": "5.0", "Content": "I love this camera.  Bought it just before a trip to Costa Rica.  I love the fact that you don't need to fuss with the settings unless you want to. Just point and shoot.  Also really happy with the zoom.  Was able to take some great pictures from a distance.", "Date": "December 10, 2012"}, {"Title": "Panasonic LUMIX DMC-ZS15 12.1 MP High Sensitivity MOS Digital Camera...", "Author": "networker", "ReviewID": "R28FQMEQJITH9X", "Overall": "5.0", "Content": "Excellent product, it is the perfect camera for my needs. I needed a camera that would take good video with good audio at concerts.", "Date": "December 8, 2012"}, {"Title": "Great Camera Clear clear great definition", "Author": "Gord", "ReviewID": "R3T2A2A36F0CXL", "Overall": "5.0", "Content": "Like everything about it so far.Haven't taken that many pics with it yet.Let you know after we've taken a few thou.", "Date": "November 24, 2012"}, {"Title": "Panasonic Lumix ZS15", "Author": "D. Ives \"Dave_I_WI\"", "ReviewID": "R1TJ5BWNV2B45A", "Overall": "5.0", "Content": "Bought this camera for my wife to replace one she left in a resturant. She LOVES it! Seems to take excellent photos, easy to use. She hasn't tried the movie feature yet. Price was less than the Canon ELPH it replaced.", "Date": "October 17, 2012"}, {"Title": "Excelent camera", "Author": "Andrés V", "ReviewID": "R33J8WDIPF38VY", "Overall": "5.0", "Content": "Alot a functions,  very good zoom in a small camera. I bought two extra batteries http://www.amazon.com/gp/product/B0049V0ZX8/ref=oh_details_o00_s00_i00  Everything is ok until now.Me gustó muchisimo la camara.  Mas económica que la zs20  y con muy buena calidad de imagen. Excelente relación costo beneficio, la camara se consigue en mi pais por 400 USD y la compré en 160 USD aquí en amazon.", "Date": "October 5, 2012"}, {"Title": "Panasonic Lumix DMC ZS 15 Camera", "Author": "Retired flyboy", "ReviewID": "R3CUAKGD7PT3CU", "Overall": "4.0", "Content": "I did a lot of research on these cameras before I ordered this one.  It works  very well, and has many features I like.  The wide angle lens is very helpful, along with the 16X zoom.  I do wish that the camera had a viewing window you could look through when the sun or a bright day made it difficult to see the screen.  That is just one of the things I gave up going from a Canon Z7 to this camera. Overall, I do like the camera and would recommend it to my friends.", "Date": "September 22, 2012"}, {"Title": "Great Camera for this price!", "Author": "Javi", "ReviewID": "RVILYSWRZ1N9B", "Overall": "5.0", "Content": "Very nice more than a point and shoot if you want,the zoom is what i wanted and it works great,very happy. Amazing pictures!", "Date": "August 8, 2012"}, {"Title": "Broke after less than 2 months of use", "Author": "Karen", "ReviewID": "R1N1DPP27Q3V8R", "Overall": "1.0", "Content": "Camera is totally useless.  Was working then on last start up it says \"System Error (Focus)\"  yet 5 min before it worked fine.  Put it in pouch and walked a bit, then took it out and turned it on and all I get is this error.Even prior to this failure,  it was a substandard camera.  would not focus correctly and is cheaply made.  The holes cut out for the buttons do not line up correctly.  lens casing is very cheap plastic.DO NOT BUY.", "Date": "July 18, 2013"}, {"Title": "Great pictures, poor materials and construction quality", "Author": "summit seeker", "ReviewID": "R111Y6X31GDRLO", "Overall": "3.0", "Content": "Others have gone into detail about the amazing quality pictures this little camera can produce, and I agree with them. I would caution you, though, that build quality is lacking with this camera.  To wit, after less than 2 weeks of ownership I have a very noticeable dark spot in all my pics from dust on the sensor.  Buttons, dials and covers for battery/memory card also feel very cheap and not durable.  My dark spot problem started happening in the middle of a 2 week trip- luckily I had a backup 4 year old Canon point->shoot that still works like the day I bought it. Just past the 30 day return window, so I have a nice new expensive paper weight.", "Date": "August 30, 2012"}, {"Title": "A basic snappycam equipped with a good zoom", "Author": "Bob Clark \"Frustrated gadgeteer\"", "ReviewID": "R335K6DLX11CC0", "Overall": "4.0", "Content": "This is a good, basic camera that won't make you cry if you forget it on a bus, plane, or train.Others who are far more accomplished photographers have reviewed this camera, so I'll just say that I agree with their assessment on the technical merits of the camera.To my mind, the camera is a good, sturdy unit that takes good but not great photos. Provided you plan ahead you won't mind having this camera with you on a once-in-a-lifetime trip.  For example, if you buy this camera I'd recommend that you also buy the Panasonic DE-A65BA Battery Charger.  Panasonic's default method of charging the camera is to use a laptop and their proprietary USB cable.  Well, that's great if you are planning to lug your laptop around the world but not so good if the addition of a laptop complicates your travel.To really use the maximum zoom of the camera you'll want to set it to about 5 megapixels. The image will be grainy but you can a least see what the heck is out there.  And I mean out there. If you are thinking I'm suggesting using the camera as a sort of ersatz monocular, you are right.The camera does not include a decent in-camera editing solution. This is a basic model so take your snaps and manipulate the images with your smartphone, tablet, notebook, or tablet. Anything but this camera.So here's the deal: if your audience will view your work on a social network like Facebook this is more than enough camera.  If you need a camera that captures the Carolina blue of a summer sky (without artifacts) you'll need something else.", "Date": "November 22, 2012"}, {"Title": "Good Camera but Not for Me", "Author": "Donga \"ten miles out to sea\"", "ReviewID": "R378YFE8P0DD5L", "Overall": "3.0", "Content": "Pros - Awesome crisp photos. Amazing zoom for a compact camera. Battery lasts a good long time. I was worried because reviews said battery wasn't long lasting, but I took 20-30 photos a day and the battery was good for a full week.Cons - Turned on a lot when putting in case because of sliding on/off switch. I had to train myself to slide it in a certain way to avoid this. View screen really hard to see in daylight, I had to cup my hand to shade it and it was still hard, and to compare I've used several Canons and a Pentax with no complaint on view screen in sun. I could not get videos to upload. They were on the card reader but would not upload to my Mac. And I've used this card reader in Canon Cameras no problem. I never figured it out. Compact but felt a bit clunky in case hanging on my belt.I ended up selling this camera to a friend (since I missed the month deadline for returns by 3 days), and ordered a Canon PowerShot SX260.", "Date": "August 3, 2013"}, {"Title": "Still learning how to use", "Author": "Elizabeth V. Farrar", "ReviewID": "R2KX35M3DKTNH3", "Overall": "4.0", "Content": "Nice camera.  I've only used it a few times but thus far, I like it.  I like the preset \"scenes\" to choose from.  There are many other features that I unfortunately will probably never learn to use.  I am going on a trip soon, and I look forward to using it then.", "Date": "July 13, 2013"}, {"Title": "Vacation DREAM", "Author": "welltus", "ReviewID": "R1MP5FG0WVOS5A", "Overall": "5.0", "Content": "I read about the Lumix on a travel forum, and WOW, I cannot over-praise this little beauty! The wide angle allowed me to shoot from narrow streets without backing into a Venice canal a la Katherine Hepburn! Clarity and resolution are great, battery capacity is generous, and my traveling companions with huge, expensive, HEAVY cameras were a little green when they saw what this little workhorse could do! Unless you are a pro, this is the way to go!", "Date": "June 11, 2013"}, {"Title": "Very good pocketable zoom camera", "Author": "R. Thomas", "ReviewID": "R1D2YOADAO6140", "Overall": "4.0", "Content": "I would choose this camera over the Canon SX230 or the Sony HX9V. I like the color rendition better, it will autofocus in a flash, has all the modes you could ever want, does great video, and has a great zoom range. But for me the best thing about it is the fill flash capability. It has extremely subtle control over the flash. And any time you want or need fill flash it will do a near perfect job. No taking 3 or 4 shots to get it right (like the Canon S95 or S100), it will be right the first time.This is my choice for a great zoom. But when I do not need the 16 times zoom I use the camera I really love, the Fujifilm F100fd. The sensor is bigger, the colors more saturated and the fill flash is perfect each time and every time, it also has a greater dynamic range and sharper images across the board.", "Date": "May 5, 2013"}, {"Title": "Exceptional point-and-shoot camera for the money", "Author": "J-Man", "ReviewID": "RO7EBAB00KYLU", "Overall": "5.0", "Content": "In the last couple of years, Panasonic has been kicking butt in the point-and-shoot plus higher-end DSLR markets with cameras that are reasonably priced yet have fantastic quality. And the DMC-ZS15 is no exception.I have a GH2 (hacked -- still one of the absolute best DSLRs for video at this point, period), and when I thought my mother needed a new digital camera, I immediately went to Panasonic. After thorough research across a variety of digital photography and shopping sites, I settled on the DMC-ZS15 as the best mix of quality, ease of use, and price.This thing is light, compact, intuitive, and endowed with surprisingly good optics. Excellent bang for the buck. Mom loves it. What more could you ask for?", "Date": "April 29, 2013"}, {"Title": "Very good camera", "Author": "Peter \"My Name is Mudd\"", "ReviewID": "R3OYBFDJZYB9NX", "Overall": "4.0", "Content": "I have had this camera for about 3 months and have been very pleased with the operation and output of this camera. I like Panasonic cameras very much but had problems on 3 of them after a year and a 1/2 where spots showed up on the lens. They sent me a new camera once, fixed??? it once and the tird time told me it would cost the price of the camera to get it fixed the third time. SO from now on I buy the 3-4 year insurance guarantee that is sold here for a resosnable price and the caveat that they will send you a brand new one in 5 days. Couldn't beat that cuz I got a greta psice on it. 3 years for under $30 with that kind of guarantee was an easy decision. Panasonic service is NOT good and this insurance thingy has been given top billing by a bunch of companies so it was the insurance for me cuz when working properly Panasonic lenses are A-1 for clarity on P&S; cameras", "Date": "December 21, 2012"}, {"Title": "Not-so-hot pictures in auto mode, but manual mode too complicated", "Author": "A. Benenson", "ReviewID": "RZXM98TCLRPNY", "Overall": "3.0", "Content": "I was looking for a simple to use camera with lots of zoom that took great pictures in auto mode. Well, I got 2 out of three... the problem is the auto mode didn't do such a great job in two areas - selecting the correct white balance (photos often looked too cool/blue), and selecting macro mode (it often didn't kick in when I expected it to). There are lots of manual controls for those who have the patience to use them, but I found them not quite as simple to use as those on my older Canon Elph (that may be my fault, not the camera's - but still I can say that the menus in this camera are pretty easy to use and understand).My only other gripe about this camera is that the battery charger is a USB wall-wart with a non-standard USB cable, so the battery has to be charged inside the camera (but you can buy an external battery charger separately).", "Date": "July 29, 2012"}, {"Title": "made in japan <-- that speaks for itself.", "Author": "fred", "ReviewID": "R2GP885YCCLF7W", "Overall": "5.0", "Content": "I immediately love the cam the moment I opened right out of the box. The HDR function fascinated me the most since I wont have to do a post processing task in order to achieve this effect. Neat point and shoot cam that'll satisfy even the most demanding shooter --given its price.Finally, I was surprised to see this piece is made in Japan and not China. I had very good experience with Japanese manufactured point and shoot, one being a canon ixus that lasted me 5 years. I'm crossing fingers with this one.", "Date": "August 8, 2012"}, {"Title": "Panasonic DMC-ZS15 Camera", "Author": "rrinla", "ReviewID": "R9B5O2IILWKQL", "Overall": "5.0", "Content": "Great travel camera with many features or simply use the iA mode (Intelligent Auto).Extra wide angle plus the 16x optical zoom make for great travel/landscape pictures.", "Date": "July 13, 2012"}, {"Title": "Excellent Camera especially for those who want to shoot quickly", "Author": "Carol P", "ReviewID": "R36PDVSG65BM20", "Overall": "5.0", "Content": "My husband reviewed many cameras and found this excellent product for me to purchase.  It has quick focus and many easy to find features that make it perfect for my use.  It has a built in handle and strap to make it easy to manage and takes great photos with little help from me!", "Date": "July 6, 2012"}, {"Title": "best camera", "Author": "pili", "ReviewID": "R2N7VB45PKUNJB", "Overall": "5.0", "Content": "This is the best camera I've ever had because I bought a General Electrics, Canon, Kodak, and Nikon and none of them have performed as well as this camera has. I had to spent so much money  to get the right camera at last  I am so 100% happy.", "Date": "June 9, 2012"}, {"Title": "perfect shots but a big problem", "Author": "Mauricio Bianchi", "ReviewID": "R3RS88SBEPDZT5", "Overall": "3.0", "Content": "videos and photographs are great but there's a big problem, when you are recording a video, you instinctively put your finger in the microphone, and of course you cant hear anything .", "Date": "March 27, 2014"}, {"Title": "camera", "Author": "taunya", "ReviewID": "R1UZ4QZIB3XN0I", "Overall": "5.0", "Content": "The price is fair and arrived on time. This is a great little camera and we have enjoyed many hours of use already.", "Date": "March 1, 2014"}, {"Title": "Ugly distortions", "Author": "midbar", "ReviewID": "RH1KKOM64AX6C", "Overall": "1.0", "Content": "Distortions are really incredible. People's short legs, perhaps, can be controlled by careful grid aligning with some verticals if available, but you can do nothing about ugly horizontal stretching of anything off the picture's center.", "Date": "December 6, 2013"}, {"Title": "DIRT IN LENS RUINS CAMERA", "Author": "Maryann Gastaldo", "ReviewID": "R1ZVZGN9ULFM2D", "Overall": "2.0", "Content": "I would have liked this camera if it had lasted longer than one year. Everything about it seemed fine until SOMEHOW a particle of dust or dirt got in the lens. I asked Panasonic to fix it and they said that they would charge $180. For $180, I can buy a NEW CAMERA! So, I told them that I was done buying products from them.My suggestion: buy a CANON. I have been very happy with all of my Canon cameras, and never once has something mysteriously gotten stuck in the lens and thus ruined every photo.", "Date": "November 7, 2013"}, {"Title": "Nice camera with a couple of major issues", "Author": "ABC", "ReviewID": "R141YNDGZZ71VJ", "Overall": "2.0", "Content": "Purchased this camera July 2012.  It takes wonderful outdoor photos when the light is good.  The zoom is exceptional, and photos taken in high light with the zoom are beautiful.  However, it does have some issues.  First of all, it is only OK in medium light, and pathetic in low light situations.  My phone camera does a better job indoors under medium to low light.  Secondly, the camera suddenly stopped focusing recently \"System Error (Focus)\" and not only wouldn't take photos, but would not even retract the lens.  Panasonic is fixing the problem since the camera is still under warranty.  However, I had to pay the shipping and insurance costs to ship it to them for repair.  In the meantime (and I have no idea how long this will take) I am without a camera.  I'll update this post when it is fixed and returned to me.Update: Repaired under warranty (I paid shipping & insurance to return to them); returned to me within about a month; doing well.", "Date": "May 7, 2013"}, {"Title": "Could be a lot better quality pictures!", "Author": "Glenn Hardy", "ReviewID": "RYMDV3AV4PZJK", "Overall": "2.0", "Content": "Not as expected.  Poor quality pics compared to other cameras........cannon & nikonRather pay less and get better quality and ability to take photos shots more quickly!", "Date": "March 28, 2013"}, {"Title": "love this camera", "Author": "Seiko Psycho \"Seiko\"", "ReviewID": "R7OB8ZR1K1INU", "Overall": "5.0", "Content": "I have had other compact cameras including the lumix zs3 but this baby rocks!  The pic quality is fantastic, works awesome in low light...I mean, for a small camera at its price range (got mine for just under $200) it is a no brainer!!  I scoured the internet for the BEST compact camera and this one kept coming up.  Just look at the other reviews, especially the first one. I am just throwing some extra reassurance your way...you will not be disappointed.  I also bought the extra batteries and charger from wasabi and again for the money, worth every penny.", "Date": "March 16, 2013"}, {"Title": "Love it", "Author": "Holly", "ReviewID": "R14DXO2IHMJROJ", "Overall": "5.0", "Content": "I really enjoy this camera. I bought it for my trip to France and it worked perfectly for me. There are a lot of settings on it and I am sure there are many things I can do with the camera, but it isn't intuitive. I will need to sit down with the user manual and play for a bit.", "Date": "March 16, 2013"}, {"Title": "Great camera", "Author": "mole", "ReviewID": "R1CI8B1GQU873R", "Overall": "5.0", "Content": "Bought this for a trip to Asia.  It takes photos very quickly which was important to us to not have to wait between photos.  The colors aren't awesome but not bad either.  I haven't had the time to mess with the settings for better color yet.  But nothing a little enhancing online doesn't fix.  Great if you are looking for a cam that takes clear pictures FAST.", "Date": "March 4, 2013"}, {"Title": "Nice Camera", "Author": "millertime", "ReviewID": "R444QCFLRIVBX", "Overall": "5.0", "Content": "I bought this for my wife for Christmas to replace her small Nikon that was getting old. The camera is loaded with lots of featuresand has a great telephoto capabilities. However, having all of that zoom comes with a price. The camera is much thicker than I thought.It is going to take some serious getting use to. The camera takes good pictures, but don't over shoot the flash. It is very small andis meant for night or low lit rooms. Don't expect this flash to reach out 50-60 feet, it's more like 10-15 tops. If you stand near the limitof the camera flash and zoom in then take your picture, the peoples picture you are taking won't be washed out.Lastly, if you get this camera make sure to check out:", "Date": "February 12, 2013"}, {"Title": "Nice camera", "Author": "oldguy2012", "ReviewID": "R2TJ0NLIODSKDO", "Overall": "4.0", "Content": "I like the camera it does everything it said and gives a nice clear picture.  It is a little hard to learn all it is capable of, but I am sure I will get it once I have time.", "Date": "February 12, 2013"}, {"Title": "takes great pics", "Author": "R. Valle", "ReviewID": "R1XU8G7COQMM5O", "Overall": "5.0", "Content": "I really dig this camera.  Pictures come out clear and then snap quickly which is nice.  All the settings are easy to get to on the camera with just a rotation of the dial.", "Date": "February 10, 2013"}, {"Title": "Great compact camera", "Author": "M DeLuca", "ReviewID": "R2R8IV38BF81HH", "Overall": "5.0", "Content": "Very happy with this camera.  It it a nice size so it can fit in my bag, takes beautiful pictures.  Large display lets you see the pictures easily.", "Date": "February 5, 2013"}, {"Title": "Bought as a gift", "Author": "Dan Johanson", "ReviewID": "R2626SSDW0QTRX", "Overall": "5.0", "Content": "Sister is loving it. really like the cameras ability to edit the photos. Although she does have to recall to change back to auto after taking that special effect picture.", "Date": "January 25, 2013"}, {"Title": "Great camera.", "Author": "Thomas H. Morgan", "ReviewID": "R2OOMG08UG4LQJ", "Overall": "5.0", "Content": "so far I love it.  Does everything as advertised.  Need more time to learn all the options.  Great pics as well as in camera memory.", "Date": "January 22, 2013"}, {"Title": "Lumix ZS15 camera for wife", "Author": "Amazon Customer \"ttterk\"", "ReviewID": "RSKX81MR91C0J", "Overall": "5.0", "Content": "She loves it and is learning more every day about how to use it. It is a really complete kit.", "Date": "January 19, 2013"}, {"Title": "Love, love, love it!  Perfect travel camera for mountains and animals", "Author": "P. J. Soricone", "ReviewID": "RDTVWJB4MBEHC", "Overall": "5.0", "Content": "Big fan of previous models. I upgarded for longer zoom and wider lens for trip to climb Mt Kili and visit the national parks. Extremely happy w/ quality of my photos and the versatility of the camera.", "Date": "January 19, 2013"}, {"Title": "Great 'point & click'", "Author": "Virginia Battaglia", "ReviewID": "R3QN23C83Z5F09", "Overall": "5.0", "Content": "Quite happy with this camera! Lots of options if you like control of settings or has a really good 'intelligent' setting for those of us who like to 'point and click'.", "Date": "January 18, 2013"}, {"Title": "Panasonic Lumix dmc z 515 12.1", "Author": "Michele Dichiara", "ReviewID": "R1B4JCW5DU45XQ", "Overall": "5.0", "Content": "fantastic!  This is the best camera I have ever owned. The photos are precise and so real;  everyone should consider this.", "Date": "January 18, 2013"}, {"Title": "Sweet!", "Author": "Jogoholic", "ReviewID": "R2YIMDJJ7BAO82", "Overall": "5.0", "Content": "First I want to thank Amazon and the delivery service for getting this to me the day before Christmas. I was totally shocked to find this delivered when I came home from work, wasn';t expecting it til near the new year. (Ordered it 3 days before Christmas). A hearty thank you to all that pulled this miracle off. Now..... I had recieved a digital photo frame about a week before Christmas. I downloaded my photos from my camera phone, but was quite dissappointed in the replication, they were fuzzy, blurred, drained of color... I looked intomgetting a camera again, (using consumer reports as a guide), and settled on this LUMIX. I couldn't find it anywhere in town, (or at least for the price), so I ordered one from Amazon. Took numerous pics Christmas day and since, and WOW....what a real difference a REAL camera makes. Crisp, sharp pics, no blur, no fuzz, colors bright and vibrant.... I forgot what I was missing! And how simple it all was, just point and shoot, (just as the name implies). I can't wait to get into the details of how I can adjust and play with the different settings. I just found my new to! Thanks Panasonic, Amazon, and all involved.", "Date": "January 17, 2013"}, {"Title": "Best reasonably-priced digital point and shoot camera!", "Author": "Robert Middleton", "ReviewID": "RP35CWFZP1PVQ", "Overall": "5.0", "Content": "For the price, the combination of image quality, ease of use and reliability make this the best choice for a relatively inexpensive digital camera.  I am very pleased with it in every way.", "Date": "January 17, 2013"}, {"Title": "Very satisfied", "Author": "epm", "ReviewID": "R1RWOKCV5BEWQS", "Overall": "5.0", "Content": "This is a versatile camera and takes great photos relative to it's modest price and small size.  Looking forward to taking it on travels.", "Date": "January 11, 2013"}, {"Title": "Performed well", "Author": "D. Fairchilds", "ReviewID": "R2J997DM4XY8UQ", "Overall": "4.0", "Content": "For point and shoot, this is quite comfortable to use.  Compared to a similar K***K camera????  No comparison.  This one is intuitive, easy to use and operate.  Battery life seems very good so far.", "Date": "January 8, 2013"}, {"Title": "Great little compact", "Author": "Scooty2112", "ReviewID": "R2HIQM17DF4YMO", "Overall": "5.0", "Content": "Got this as a gift for my GF to replace an aging Canon Powershot A-series. My, how technology has changed in 6 years. Has enough manual control if need be, and the Intelligent Auto mode does a surprisingly good job for most situations. Good optics and well built. Nice little truly pocketable camera!", "Date": "January 8, 2013"}, {"Title": "Nice Camera", "Author": "Doug \"Doug\"", "ReviewID": "R3ARVRJ9RK1TE2", "Overall": "4.0", "Content": "Has a lot of picture taking options.  Too many picture taking options but it'll work.  The only other downside is the picture options slider is on the top of the camera and it can easily be accidentally switched when getting the camera ready to use.  Then you feel like the great aunt trying to figure out how to turn the damn thing while the people you are trying to take a picture of are smiling forever.  Takes great pictures and would recommend it.", "Date": "January 2, 2013"}, {"Title": "great little camera", "Author": "D. Campbell", "ReviewID": "R2F6RWRXLTZN65", "Overall": "5.0", "Content": "bought this just before leaving on a tour of Peru. Found the myriad features a bit overwhelming to learn and take advantage of, but was still able to get a lot of good photos using the automatic settings. The long zoom and image stabilization were great for photographing wildlife, and the wide angle superb for landscapes. This camera starts up quickly and the autofocus worked very well so I didn't miss many shots while on the move. It also zooms really fast, which takes some getting used to but allows you to quickly switch from closeups to wide views. Would prefer to have an optical viewfinder, but the LCD screen was useable even in full daylight. Low light performance is definitely inferior to that of SLR models, but otherwise this little gem can give them a run for the money.", "Date": "December 30, 2012"}, {"Title": "It's a nice travel zoom compact camera", "Author": "Jonathan", "ReviewID": "R1IA5X33NIOPSV", "Overall": "4.0", "Content": "The camera is small, and has a good zoom range. But the start up is a bit slow. Low light performance could be better.Otherwise a good point and shoot camera for traveling.", "Date": "December 29, 2012"}, {"Title": "great gift to me", "Author": "mary7755", "ReviewID": "R2FIDPMMKL6MDQ", "Overall": "4.0", "Content": "Bought this for myself - haven't played with it much yet - did see in trying to zoom out that stablization was hard to hold though- will see  with more practic", "Date": "December 28, 2012"}, {"Title": "Love the ZS15", "Author": "CLEM D. BURCH", "ReviewID": "R11WQEMP4CWD7H", "Overall": "5.0", "Content": "Good looking and it actually takes good photos. The controls are typical LUMIX and easy to use. Nice size and good lash location.", "Date": "December 27, 2012"}, {"Title": "Great Camera", "Author": "Ind mart", "ReviewID": "R69SIAJPBZHLJ", "Overall": "5.0", "Content": "My last SLR Pansonic camera finally gave up so I chose to replace it with this one.  It is much clearer in the view finder. I find the settings on it a little harder to use--more screens to go thru to get what you want, but in time I should have them mastered. Takes excellent pictures. I needed something to keep in my purse and this is very compact and love the zoom. clear prints. I am an artist so need clear pictures with great detail..This fits the bill.", "Date": "December 27, 2012"}, {"Title": "Great camera", "Author": "djj", "ReviewID": "R2H9236QC76AYY", "Overall": "5.0", "Content": "I bought this camera for my 10 year old daughter for Christmas and she absolutely loves it! It has been easy for her to pick up and use. She loves some of the picture frame and settings where she can alter the pictures she takes.", "Date": "December 27, 2012"}, {"Title": "Great so far", "Author": "Anthony Goegebeur", "ReviewID": "R45RCIIA5ZFDK", "Overall": "5.0", "Content": "Makes great pictures, very nice quality images. Took this camera instead of the newer model based on many reviews that show this camera's performance compared to the newer ones that have many more features that are useless for picture quality.Autofocus is incredibly fast, which is great for a quick unplanned picture.Bought some cheap third party battery + charger. It is not the exact same type as the battery that comes with it, however it works just fine.Would recommend this camera to anyone so far.", "Date": "December 26, 2012"}, {"Title": "So happy!", "Author": "Stephanie P.", "ReviewID": "RIBKWN12FVJ7M", "Overall": "5.0", "Content": "I haven't used all the features of this camera, but I am thrilled with the low light feature and how quickly I can take the next picture. Great quality and it's user friendly. I charged the battery up overnight and didn't even have to read the instructions to start snapping away.", "Date": "December 26, 2012"}, {"Title": "Great item and value for a quality long zoom camera", "Author": "Charles L. Bordelon", "ReviewID": "RGUMA76KFZO7W", "Overall": "5.0", "Content": "My need was a quality point and shoot with long zoom.  GPS was not needed.  This camera was the best fit.I have owned a couple of Lumix cameras and they all performed well.  Panasonic digital cameras are quality items.The price was well within my budget.  I purchased it thru Amazon and it arrived 3 days later with standard ship.Performance has exceeded my expectations.  I put it through it paces about 10 days after delivery.  I took a 7 day Caribbean cruise and shot about 500 images.  The zoom  and intelligent zoom are amazing.  At full zoom I was able to take clear images without a tripod on a moving ship.  Colors are true and vivid.  Low light shots  inside the ship with the flash turned off produced good images with good detail.  Majority of shots were in iA mode.  This will be my main travel camera for many years.In camera battery charging  is the only drawback.  However, I can live with it and I will purchase and extra battery and charger in the future.  Overall, excellent purchase and I recommend if you are needing long zoom in a point & shoot camera.", "Date": "December 26, 2012"}, {"Title": "Great point and shoot camera", "Author": "P. OKavage \"NJTravelGal\"", "ReviewID": "R38ZHF0KJOCPBJ", "Overall": "5.0", "Content": "I have a DSLR but wanted a camera that I could carry in my pocket or purse that took pictures as well as my DSLR.  This camera takes almost as good pictures that my DSLR takes!  It is quick and convenient and has a lot of choices when you want to take a picture.  I like that it has the wheel on top of the camera so that I can quickly change how I shoot the picture. I love the 3D pictures as well as the panoramic.  The long distance pictures aren't real sharp but when I can stand on one side of the Delaware River and take a picture of a house on the other side of the river, I think that is amazing.  I am very happy with this camera and would highly recommend it! It certainly is a great camera for when you are on the go and can't stop to get the picture set up, as you have to with a DLSR.  Just grab it, adjust it and snap...", "Date": "December 26, 2012"}, {"Title": "So far so good", "Author": "VHB", "ReviewID": "R1UGJSETV5JNJ4", "Overall": "5.0", "Content": "I am no good with cameras, I usually take terrible snapshots, so I bought this camera which seemed to be dummy-adapted, and it is!! So far I was able to take great photos at night with intense light only in one spot (theater), during the day, indoors, etc. I recommend it.", "Date": "December 26, 2012"}, {"Title": "Panasonic LUMIX DMC-ZS15 12.1 MP High Sensitivity MOS Digital Camera...", "Author": "Tom McNeely", "ReviewID": "R1KZ2IWO7RHSDB", "Overall": "5.0", "Content": "An excellent small camera to take on trips or just carry around for a spontanious shot. My wife and I like the one button video feature.", "Date": "December 25, 2012"}, {"Title": "Great", "Author": "Fran", "ReviewID": "R2TGG21TB39LRJ", "Overall": "5.0", "Content": "This camera is great.  I haven't got to all the features yet.  Automatic works really well.I have had 2 Lumix camera's and they have not let me down.I would recommend to anyone.", "Date": "December 25, 2012"}, {"Title": "My New Panasonic Camera", "Author": "Ann Custer", "ReviewID": "R30P2J2B5WFS7I", "Overall": "5.0", "Content": "I love my new Panasonic!  It is easy to use and takes great shots!  I really enjoy being able to zoom in on a distant object and get a good clear picture.", "Date": "December 23, 2012"}, {"Title": "This is a very good camera", "Author": "Rocky", "ReviewID": "R2KTOVQHR6CQDM", "Overall": "4.0", "Content": "This camera has enough capabilities to satisfy most needs for everyday use. The zoom at higher levels needs a tripod or at least a monopod. However the capability is there when you want or need it. Sure is easy to carry.", "Date": "December 23, 2012"}, {"Title": "great camera!", "Author": "Deb", "ReviewID": "RZ1BEIUD6LWL0", "Overall": "5.0", "Content": "I read the other reviews before I bought this. J wanted a simple to use but good camera. This one is perfect. The pictures are very clear. I love it.", "Date": "December 23, 2012"}, {"Title": "Cannot be beat for the price", "Author": "Ray P.", "ReviewID": "RAPW2ZGLAUS0E", "Overall": "5.0", "Content": "Got this on a lightning deal. Very happy with it so far. Still trying to learn all the differant settings.", "Date": "December 23, 2012"}, {"Title": "Awesome camera!", "Author": "Ladonna Thrush-Green", "ReviewID": "R28S1FE0U5ZAYN", "Overall": "5.0", "Content": "I bought this camera for my trip to NYC. I wanted good pictures in low light. This camera takes \"great\" pictures in low light. The Christmas trees, the store window displays ... fantastic pictures.", "Date": "December 22, 2012"}, {"Title": "Lumix ZS15 point & shoot", "Author": "Richard Guerra", "ReviewID": "RFPY1SQBLG2DZ", "Overall": "4.0", "Content": "This camera does eveything I need and came at a great price.I would recommend it to anyone, especially as a travel camera", "Date": "December 21, 2012"}, {"Title": "Great company for your trip", "Author": "Paulo", "ReviewID": "R12X06FNBUGYWZ", "Overall": "4.0", "Content": "Easy to use, light to carry, amazing pictures in any weather conditions (panoramic and 3D included)... highly recommended as part of your trip essencial materials.", "Date": "December 5, 2012"}, {"Title": "Very good travel camera", "Author": "Steve Bragg", "ReviewID": "R2NTWU63IGY5S4", "Overall": "4.0", "Content": "Bought this for a trip to New Zealand and Australia. Wanted a good zoom, but one that would fit in travel bag and easy to operate quickly. Been practicing in the neighborhood and the quality of the photos is quite good. operation is easy. Still learning more advanced features and will comment on them later.", "Date": "January 29, 2013"}, {"Title": "Great hardware, lousy menus and controls.", "Author": "Steve in Japan \"Islander\"", "ReviewID": "R14X5A8111AIYS", "Overall": "3.0", "Content": "My wife bought a DMC-TZ20 recently so I thought it would be easy to have 2 similar cameras. Overall I am happy with this camera's performance, both for stills and especially for excellent low-light videos. My gripe is that Panasonic has managed to make the menus totally unintuitive. There is a rather different set of available options in every shooting mode, which means that if I want to do something special that I once did, I need to figure out which dial setting to start from. I suppose eventually I will be able to remember my favorites, but....  Also, it is much too easy to inadvertently change critical settings such as picture quality and movie format while fat-fingering the cursor controls. Unfortunately the .pdf manual is not a model of clarity either, causing much head-scratching.On the plus side, I'm extremely impressed with the video performance, both in .mp4 and AVCHD/Lite modes. It seems a good substitute for an average digital videocam. And when I do happen to hit the right settings, still pictures are superb quality.If you tend to have trouble mastering menus, avoid this camera.", "Date": "January 17, 2013"}, {"Title": "good pocket camera", "Author": "Gary E. Pummill", "ReviewID": "R2B2PNMFFGHUUS", "Overall": "5.0", "Content": "For a pocket camera, takes very good pictures with excellent color.  Easily met my expectations.  Very easy to use.  Good value.", "Date": "November 13, 2012"}, {"Title": "No PAL option for movies", "Author": "Canonicus \"Canonicus\"", "ReviewID": "R3TCAWJN3H0OB4", "Overall": "4.0", "Content": "This is the first digital camera I have bought that does not offer the PAL option.  This must be Panasonic's way of preventing people buying equivalent models in the US where they are often 50% less expensive.  Well, it didn't work Panasonic as I had to return the item for a refund and buy a Canon that does offer both NTSC and PAL.  Apart from that, a nice camera with a great zoom, clear LCD screen and reasonable focusing if the light is not too dim. Menus are reasonably easy to find your way around and there are plenty of options. Build quality is very good but it is very hard to see the icons on the dial as they are silver on silver.  Pictures were a little too grainy in less than brightly lit rooms and it does not seem to be as good on this score as my Canon Elph 300HS (5 Stars--most reviewers love this camera)which is the best camera I have ever bought for the money. But for the current Amazon price at less than one hundred and ninety dollars the ZS15 represents very good value if you do not need PAL.  4 Stars.", "Date": "November 3, 2012"}, {"Title": "Nice Camera", "Author": "car78412", "ReviewID": "RHJL7H0WZVDNV", "Overall": "4.0", "Content": "Takes nice pictures with minimal effort.  Very easy to use.  I would recommend this camera to people that want great pictures without all the bother.  Point and shoot.", "Date": "August 23, 2012"}, {"Title": "DMC-ZS15 Pocket Camera", "Author": "froth45", "ReviewID": "R2NO31D87EJLDN", "Overall": "4.0", "Content": "The iA automatic setting functioned very well even in night low light situations for photos and movies.  Also used it to copy old super 8 movie film by simply using the camera's movie mode to take movie of the super 8 movie.  The result was actually better than the original.  (The super 8 movie quality is pretty poor to begin with.) Sound reproduction was just OK not great.  Like the resize (0.3 MB) feature for E-mailing.", "Date": "August 8, 2012"}, {"Title": "used camera insttead a new one", "Author": "Nicolae Calinescu", "ReviewID": "R125CLI1MP6QHA", "Overall": "1.0", "Content": "I ordered a new sealed lumix zs15 at Amazon. I received today, an old,used,refurbished camera in a used box.Amazon refused to accept the return of this item.This is an act of robbery.Amazon is responsible to return my money back.On the invoice of my order it is written new Panasonic S15.I paid  for a new  sealed camera,not for as garbage used one..I am ready to sue Amazon.", "Date": "August 5, 2013"}, {"Title": "excelent camera", "Author": "Carlos R. Barni", "ReviewID": "R1I8TJ2O7ZJXUW", "Overall": "5.0", "Content": "I will describe my impression as fond of fotography- I have traveled around the world always with camera for traveller- I have a Panasonic Lumix zs3- I had very good pictures- here exceeds my understanting everything that I wish", "Date": "July 14, 2012"}, {"Title": "what - no charger", "Author": "Diane Brophy", "ReviewID": "R3PMWUZRCSCS51", "Overall": "4.0", "Content": "I was very surprised this camera  did not come with a charger.  I thought all these cameras from Amazon had a charger with it.", "Date": "June 16, 2012"}, {"Title": "Awful - don't waste your money", "Author": "ABB SD", "ReviewID": "R22CLMIQL6IZFT", "Overall": "1.0", "Content": "We bought this for a holiday to Costa Rica. It took great pictures and the zoom was perfect for wildlife shots, but the zoom mechanism is so sensitive it soon jams and then you can't use the camera at all (it stalls trying to auto focus and stops working). A bit of googling revealed that many people seem to have this exact issue and the recommended fix was giving the camera a good bang on a table (!). When the camera is working it is awesome, but I've taken it to events before only to find the zoom jammed and so no camera. Also, note if you have a Mac that movies upload to iMovies not to iTunes, which for me was a bit inconvenient. There are other options at this price point that are better quality for your money.", "Date": "August 15, 2013"}, {"Title": "really good pics", "Author": "seena", "ReviewID": "R3D5J1CVC2USZK", "Overall": "5.0", "Content": "took it to africa.  got amazing pics.  very good zoom and you can auto correct your pics before dowloading on the computer or making prints.  does not come with a camera case", "Date": "July 13, 2013"}, {"Title": "Works as advertised", "Author": "S. Cole", "ReviewID": "R1L0KRBV562XT", "Overall": "5.0", "Content": "This camera met my expectations based on the product info and other positive reviews. It is a very versatile point and shoot and fun to play with.", "Date": "January 2, 2013"}, {"Title": "Very good camera", "Author": "Joe", "ReviewID": "R1P0UMVUUK1D4U", "Overall": "4.0", "Content": "I returned the <Canon PowerShot ELPH 110 HS> that I bought just because is was recoding video with terrible zoom noise.The Panasonic is good, is has also larger optic zoom.It is very sophisticate and I don't really need all that, but if you need it, there it is,It has not noticeable zooming noise in video recording.I don't like the fact that it is so large camera compering the canon.It has no manual red eye correction.I really liked the Canon, so sorry they built it with this Zoom noise,", "Date": "December 12, 2012"}, {"Title": "Panasolin LUMIX DMC-ZS15", "Author": "M. P. Samayoa \"curly girl\"", "ReviewID": "RLRQUBZ7SPDTS", "Overall": "5.0", "Content": "I just love this point & shoot camera. I had a previous Panasonic Lumix camera, but I decided to buy another recent model and I just love how easy it is to take quality pictures. I am happy with this purchase.", "Date": "August 20, 2012"}, {"Title": "Nice pic quality, horrible camera quality, be aware", "Author": "Anna G", "ReviewID": "RZRN8S3OG1O1G", "Overall": "1.0", "Content": "I loved the picture quality that camera produced, zoom quality is awesome, but I noticed first problems on a second day of use - lens cover didn't shut down properly.On my second trip in 3 month the lens on/off stopped working.I sent this camera to Panasonic repair center because it was under warranty (had to pay for it of course) and they said they found some sand which means it's not covered under warranty.Sand in SouthWest?! What a surprise! I've been to multiple trips to SouthWest with many different cameras, and none of them stop working because of sand encounter. They offered me to repair it for $180 which is the same price I bought it for.I have upcoming trips to Hawaii and more SouthWest, hence more sand exposure, and it didn't make any sense for me to spend money on fixing something that probably going to stop working again on the next trip - so I got my camera back - lens is still in retracted state, so they didn't make any attempt to fix it.Very disappointing experience, but pictures were very nice, really loved the quality. Too bad that camera is so sencetive to outdoor factors.", "Date": "November 14, 2012"}, {"Title": "Forgetaboutit!", "Author": "Jeff Davis", "ReviewID": "RGB4CL75G4A5I", "Overall": "1.0", "Content": "Only buy this camera if you live in a dull low-light location.  This camera is essentially useless in BRIGHT SUNSHINE!You need know nothing more about the camera.  Ignore all the reviews.  It may be a marvel of technology - but all to no avail if you cannot use it.I assumed there would be a brightness control for the viewing screen - but I can find nothing about such a feature hidden in all the details of the full user manual.About 95% of the time when using this camera, the only thing I can see in the viewing screen is my own reflection.If you live in a region with bright light - or if you are going to take vacations in tropical or desert areas - you will have to learn how to point the camera based on any high-lights available in the scene, because that's all you will see to assist in composing your photos.  And forget about all the information that is provided on the screen - you will not be able to see this. So you can only use the iA mode and hope for the best.If anyone knows a way of using this camera in bright light - I hope they will publish a review to help those of us stuck with cameras like this.For use indoors, or in dull conditions, this camera may well rate the 5 stars indicated in so many reviews.", "Date": "January 7, 2013"}, {"Title": "Not for low light...", "Author": "Victoria \"Vikki K.\"", "ReviewID": "R1LAYM54XKB33T", "Overall": "3.0", "Content": "Either our copy is defective (not so bad from 1x - 5x zoom, then progressively worse) or we view the camera differently than many here.  We tested the SX40 and it is a good camera if a bit big and pricy for a P&S; superzoom (35x).  The ZS15 came down to a very low $179 and seemed to offer much for the price.  Out of the box and away we went on a test.  Photos in sunlight were good.  16x pictures were not as good as the others as we had to step back to get it to focus (as much as 6.6 feet per the camera!) and, more importantly, a few pictures had blur (more than with the SX40 at 25x --- probably because we used the viewfinder).But the biggest problem --- low light photography/video.  Pics were primarily dark.  And blur at 16x in low light a real issue even for those with steady hands.  Slow shutter = blurry pics and fast shutter = dark pics.  Surprising and unless there is a magic button (yes, the IS is on and digital zoom off), this will probably go back.  The Panny seems to like yellow and red colors, too.Video is nothing special on this Panny, especially at night.  Maybe on the FZ150 or ZS20 with their 60p; this has 30p or so.  Insult to injury --- the battery lost power quickly and we had to recharge it in camera (Not so with the SX40 or cheap Canons such as the Elph 300).Not all is bad is this possibly bad copy.  As mentioned the low price.  The shutter speed is exceptional.  Much faster than the SX40.  Perhaps even faster than our G12.  10x continuous at full resolution.  Very impressive.  iAuto not bad but often defaults to a noisy 3200 ISO (change the setting to max at 800).  White balance is not great.  HDR good concept but may need tripod (or very steady hands).We're bummed as we could have saved almost $200.  I don't think we'll try another small superzoom (maybe the SX260 but that seems overpriced for what it is) and Panasonic confuses things with it's more expensive ZS20.Try the SX40 before buying just to get an idea of the differences --- including 35x optical zoom vs. 16x.If it were cheaper we would probably own the Panasonic FX150.  We want good pictures (IQ), not small size or daylight only use.  $179 is a great price but we'd rather spend another $50 and get good pics most of the time and be able to take good pics at night.UPDATE:  To be fair, I tested this camera at 5x zoom vs. a Canon Elph at 5x zoom (its max).  The Elph is smaller, cheaper, more elegant (I think), and has a charger.  Image quality --- I took indoor pics of the same things.  The Elph's pics were sharper/less blurry (e.g., reading the contents on a vitamin bottle) and had nicer colors (less dark, more vibrant pics).  Also, more noise in the ZS15 pics (e.g., iAuto was at ISO 3200 often vs. Elph's typical indoor ISO 400).  I was disappointed.  I want to like this camera.  I suppose it's a good buy for 16x with its limitations but it's not for us.  We'll do without a superzoom (cropping works well as a substitute) or get a good, more expensive superzoom.  In the interim, I would recommend the Elph 310 --- it has 8x zoom --- and does everything well enough --- including  low light pics/video.  (About the same price.)Good luck!Update:  Update of a sort.  The ZS8 which is at least somewhat similar to this camera (looks, same body?), 16x lens, same price for a day at least, probably a different sensor has sold well and has many one-star reviews --- many mention broken cameras (OK, that happens) and, worse, Panasonic refusing to fix when under warranty.  The latter floored me.  I've never had a defect on a Panasonic product.  read the one star reviews (and some of the rest) and then make up your mind.", "Date": "June 16, 2012"}, {"Title": "Panasonic camera", "Author": "me", "ReviewID": "RREOX5VW2UJ2L", "Overall": "5.0", "Content": "Although I didn't keep this camera I had another one and it is a great camera, just looking for a stronger Zoom.", "Date": "February 15, 2013"}, {"Title": "Used, just like new", "Author": "micko", "ReviewID": "R2KS6CCAOVTL5U", "Overall": "5.0", "Content": "I love the camera, my third Panasonic, love the price even more. Everything is like new, not a single dot on camera. Everything works, all functions as I expected. I will keep buying used like new cause I cannot see the difference except in price :)", "Date": "September 24, 2012"}, {"Title": "great camera", "Author": "Mary", "ReviewID": "ROUHVM4Z548IC", "Overall": "5.0", "Content": "The camera is easy to use and has a great zoom for focusing in on distant objects. It downloads the photos into my computer easily.", "Date": "July 4, 2012"}, {"Title": "point and shoot", "Author": "DH", "ReviewID": "R2TZQULD0Y7R5G", "Overall": "5.0", "Content": "Very nice more than a point and shoot if you want,the zoom is what i wanted and it works great,very happy.", "Date": "July 13, 2012"}, {"Title": "Excelent", "Author": "Alex", "ReviewID": "R1Y22U072J54U2", "Overall": "5.0", "Content": "Is a excellent camera.Not get blurry in complete zoom or moving object  {always Sharp.) My wife is happy. She not found anything wrong with it. ( An That Is Wear...) Lol.", "Date": "April 3, 2012"}, {"Title": "Panasonic Lumix", "Author": "Helene Hoffman", "ReviewID": "R3QKGJSE40MYCJ", "Overall": "5.0", "Content": "I love the new camera, but it'll take me a year to become familiar with all the features that will help me enjoy it even more.", "Date": "July 9, 2012"}, {"Title": "gift", "Author": "Jeannie", "ReviewID": "R25TPRHB3LJ8U0", "Overall": "5.0", "Content": "We purchased this camera for my husband for Christmas.  After careful reviews of other point and shoot cameras my daughters decided for the price that this camera would be exactly what their father would want.  It arrived earlier then it was supposed  to arrive, a nice surprise.", "Date": "December 8, 2012"}, {"Title": "very happy", "Author": "sheri", "ReviewID": "R2KVHQRBIS6LCO", "Overall": "5.0", "Content": "I just got this today, I had to return the canon PowerShot A4000 IS 16.0 MP Digital Camera I bought on amazon b/c it was horrible...this camera blows that one away!  I am excited to take it on our trip to the beach and to the woods.", "Date": "June 19, 2012"}, {"Title": "Dissapointing", "Author": "Frank X Factor \"Frank P\"", "ReviewID": "R1JOPEOGQR3JL9", "Overall": "3.0", "Content": "This is my third Lumix. Formerly owned a TZ3 (lost) and a TZ5 (broken during cat attack). I liked both of them. They felt strong and solid. People talk up the software of this model. That's nice, software. But the build quality is lame. The metal is so thin, I'm afraid it will warp like a cheap pair of glasses if I place it in a pocket and move a bit. For sure the cat will finish this thing off with a single swipe. And I'm not sold on the software either. It seems to have the same still photo functions as the earlier models, but in with a more confusing process. Call me a miserable crank of a man if you wish, but its going to be returned.", "Date": "December 28, 2012"}, {"Title": "Pictures multiply like rabbits in downloads", "Author": "Jillian D. Meyer", "ReviewID": "RQD9QMFWWMLEP", "Overall": "3.0", "Content": "I need a study course on this camera. Depending on the 'Scene' mode one pictures results in up to four pictures when downloaded. You need to delete 3 from you computer and it is difficult to select which ones to delete. I could not find a way to stitch all of those pics from the Panorama Shot. In the movie mode, the camera lags behind so when you press the red start button and start talking right away, the first part of what you said will be lost. When downloading to a Windows computer, the multiple pics from one take result in folders called Burst NN and you have to access the folder to see what's in it. On a Mac, this does not happen. In the movie record mode, don't select AVCHD. My VISTA computer could not recognize the file type. Stay away from the portrait modes, most of my pics resulted in blurry images when there is any kind of a movement of the subjects. If you fail to set the display screen to econo mode, the battery will be dead in a short time.A nice feature is the on screen explanation of each function and setting. I still prefer my good old Canon SD1100 IS which has a voice recording mode that I could not find on this camera.I selected this camera because of the 16x zoom which is much better than the 3x zoom on the Canon whose digital zoom is worthless.", "Date": "October 11, 2012"}, {"Title": "POOR quality Digital Screen", "Author": "Llama Mama", "ReviewID": "R14UJYF1OGYSPP", "Overall": "2.0", "Content": "I have always LOVED my Lumix cameras...  the photos are awesome.  A couple months ago,  I accidentally left my 4 year old Lumix camera on the hood of the car.  It didn't bounce well on the gravel drive, and I wiped out the digital screen.  That said,  I KNOW they are fragile.  So when I ordered this replacement camera,  I was especially careful with it.  I babied it in padded pockets and protected it inside a rigid purse.  So on vacation last month, imagine my horror when I took my two week old Lumix out of it's protective purse and found the screen totally damaged beyond any recognition! There was nothing else in the purse to cause damage-  I can only assume pressure from the side of the purse caused the problem.  I still used it (LOVE the zoom)  but it was almost like shooting with my eyes closed.  I was glad I had brought along my water proof/shock proof Lumix for a back up.I don't know what else to say.  I'm angry that a compact, pocket sized camera can't endure a pocket or purse without severe damage. I wish I had been forewarned... I could have applied a protective film (like I have on my cell phone).  I can't justify $150 expense to replace the screen...  the whole camera was just a little more than that!  I'm afraid Lumix just lost a life-long customer...  I can't justify the risk of any more fragile cameras.", "Date": "October 4, 2012"}, {"Title": "How I wanted to like this camera!!!", "Author": "Gladius", "ReviewID": "R3N63UW1PYC3M4", "Overall": "1.0", "Content": "I rated this 1 star because it cannot take good indoor pics in most cirumstances (unacceptable no matter how cheap the camera) and because the 5 star ratings are misleading  (At best, this is an average camera --- that is, 3 stars).  Good compacts include the Panny LX5, new Panny LX7, Nikon P7100, Oly XZ-1, Canon G-series, S90, S95, and a few others.  Other good cameras with small sensors include the Panny FZ150 (24x zoom) and Canon SX40 (35x zoom).  A few Sony P&Ss; are decent (HX200, HX20).  I'm sure I've missed some.ZS15:  Well priced, good company, 16x zoom in a small size (compact).ProOutdoor pics in sun are usually good (sharp, good colors) --- although cheap LCD hard to see in outdoor sunFast shutter speed (1/4000)Fast camera (usually)PASM controlsDecent build qualityOnly 16x zoom  Digital zoom is, of course, useless (just blows pics up)Good priceGood OISConIndoor pics usually too dark or blurry (unusable in both cases)  ---  ruins the camera at any price  this occurred in iA or when being more sophisticated (such as using a slow shutter speed to let more light in);  used flash to no avail; tripod made little differenceiA sometimes does weird things --- 1600 ISO or 3200 ISO in sun outdoors on occasion (of course resulting in too much noise and ruining shot)No RAWSoft corners, especially when zoom used6.6 feet closest one can get when using macroLCD screen is 460,000 but poor quality (one can see one's face in the sun making it impossible to take a shot)Colors under artificial lighting suffer form a Panny malady, only more than typically (whites turn into yellows and so on) --- serious weaknessPoor white balanceSo-so user interfacePanny is known for good video (as is Sony); this is 30fps (30p); one wants 60p (not 30p or 60i) --- video is average at bestI tried everything with this camera due to price and a few nice features (speed, although AutoFocus can be slow at zoom).  But a camera that has a high % of losers except under perfect conditions (strong sun) is of modest use.  A camera that cannot take good pics (or video) in low light is just about useless.  Often, a difference between a good camera and a bad camera is in inability to take good shots under challenging lighting conditions.  This is worse.  Moderate lighting conditions and artificial lighting (such as always encountered indoors) show this camera's inadequacies such that it should not be purchased --- at any price.I know it has 16x zoom.  But even as one's only camera it fails.  For a bit more money, I recommend the Canon 300HS or Canon 310HS (8x).  If size is key the just mentioned cameras are very small, too (indeed smaller).  The Canon 300HS, in particular is terrific for its price and size.  If you have more money and want superzoom, the Canon SX260 (20x) is better in low light and small.  Elegant, full metal body.  But it costs more.  The Sony HX20 is a pricy compact but very nice and has full 60p audio/visual (that is, excellent video).If one really wants a superzoom, the small sensors limit what they can do.  (Big sensors are in DSLRs --- 400% the size of a P&S; sensor!).  It makes a dramatic difference, contrary to what some reviewers on here say.  (I know, I've had and used many cameras and am friends with pros.)  Back to superzooms --- the FZ150 (24x) and SX40 (35x) take very good shots.  Both are good in low light, have good IQ unlike the ZS15, and the FZ150 has excellent video.  (Note:  The FZ150 is being discontinued so don't wait and prices have come down --- not cheap but maybe the only camera you'll ever need.)If you have the money and desire, right now one can get a Nikon D3100 (DSLR) with two lenses (15-55 and 55-200) for $649.  Not cheap but you'll be set for a very long time and almost all photos will come out looking great.  Put it on Auto and shoot away or use PASM controls and learn how to take truly great pictures.  DSLRs have large sensors (low noise, etc...), are well built, last long, can take a different lens, are very fast (action photos will be great), have great viewfinders, have excellent LCDs, hold their value (especially the glass), and have other advantages over P&Ss.;  Two disadvantages --- initial price and size (the D3100 is not that big or heavy).  Many have one DSLR and one compact (usually an S95 or something like that).I'm giving you the real deal info.  And, remember, after an initial purchase price, there is no film to develop and no film to buy.  The price difference is less than it seems.P.S.  A used/refurbished DSLR or good superzoom like the FZ150 (wait a month or so as it is being replaced) or SX40 or D3100 or T3 or T2i can be a steal!Good luck to you!!!", "Date": "August 3, 2012"}, {"Title": "Camera great, service terrible", "Author": "James Smith", "ReviewID": "RW2X9ADQ0A90G", "Overall": "1.0", "Content": "The camera is great.  Unfortunately the CD containing the user manuel and several other files was broken.  I contacted both Amazon and Panasonic and neither has responded to my request for a replacement CD.  Maybe you should buy a Canon from Adorama!", "Date": "December 16, 2012"}, {"Title": "Hissing Sound in video", "Author": "Navin \"always want new stuff\"", "ReviewID": "R1B8GYQDOSD14W", "Overall": "2.0", "Content": "Just got the camera yesterday. Took some videos in both AVICHD format and MP4 format and there is a noticeable hissing sound throughout the clip. I haven't read the manual yet, but went through settings and do not see any option to indicate this has to be with the sensitivity of the microphone. Not very happy. My 6 year old Canon takes better audio in videos. Will have to explore more and will update with a detailed review, but wanted to put this out.Also, since I brought the camera a week back at $235, I see the price drop to $224 today and unfortunately, Amazon does not do price guarantee after purchase on cameras.The video files are not visible either on the my new Samsung SmartTV. I can see the files on the computer and play, then, but don't even see the files on the TV. Will try to copy them over to another SD Card using the computer and see if I can see them.Update 3-May-2012 : Found the Wind cut menu option for video when the dial is set to P mode, but that did not help either. I will most likely return it and not even exchange it as there is no guarantee this is a defect. It might be how this camera is, which is why I see the price drop from what I paid.", "Date": "May 2, 2012"}, {"Title": "Not what I had hoped for", "Author": "Joanne Hendrikx", "ReviewID": "R2EL3ZH2ZPNZYU", "Overall": "2.0", "Content": "I chose this product as the LumixI wanted was no longer available and Amazon referenced this camera as the upgrade to the one I wanted.  I should have done more research, as this camera is pretty basic and doesn't have a lot of the features my old camera had.  It has been disappointing, but the camera is still fine for a point and shoot.", "Date": "December 31, 2012"}, {"Title": "Nice little camera", "Author": "Richard Sallee", "ReviewID": "RJ7A2F6YQLOF5", "Overall": "3.0", "Content": "The Lumix seems to be a nice little camera although, I must confess, I haven't stressed it very much.  I wanted a carry-around camera and it suits that purpose.The camera is easy to use and to adjust.  I would have liked RAW capability but that seems to be in another price range.Quick delivery from Amazon and good price.", "Date": "August 12, 2012"}, {"Title": "Lumix", "Author": "Allan Hawkins V", "ReviewID": "R11CN1XWAEUD2U", "Overall": "1.0", "Content": "Well, finally and after six months, the camera got the \"spot\" inside, so all the pictures was damage with this spot. What happend with Panasonic???????????????????????????????", "Date": "November 15, 2012"}, {"Title": "Unqualified to review", "Author": "Lurlene", "ReviewID": "RVT4ZWPWOQEU6", "Overall": "2.0", "Content": "After reading all there was to read..I ordered this camera.  I was very excited...and then disappointed...then I felt remorse...and then I sent it back.  I believe that camera's are best held in ones hand prior to ordering.  That a local camera shop with a very good employee is more of a resource than online reviews.  Sometimes a camera and a person just don't \"click\" and so it was with this one.  I was grateful for the easy return and I learned a lesson.", "Date": "September 17, 2012"}, {"Title": "This is a terrible camera, period", "Author": "couldntputitdown", "ReviewID": "R35S1GPS8AK23", "Overall": "1.0", "Content": "This Panasonic Lumix camera is the worst camera i have ever owned. It is impossibly hard to use, complicated to the point of pointless. My pictures are fuzzy at best and dull. It will not load onto my programs without jumping through a zillion steps. It flashes, beeps, glows, shows ridiculous symbols and marks and then takes a crummy picture. Rating: terrible", "Date": "September 9, 2012"}], "ProductInfo": {"Price": "$341.49", "Features": "High Sensitivity MOS Sensor\nFull 1920x1080p HD video\n3\" LCD\nZS15 does have macro mode.\nLumix line does not carry standard AA or AAA battery options. It is all Li-Ion battery powered.", "Name": "Panasonic Lumix ZS15 12.1 MP High Sensitivity MOS Digital Camera with 16x Optical Zoom (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/3124joVTAqL._SX300_.jpg", "ProductID": "B00728ZAEY"}}