{"Reviews": [{"Title": "Big Features In A Compact Camera!", "Author": "J. Lowe \"Graphic Designer\"", "ReviewID": "RRQXC9Z0CI54I", "Overall": "5.0", "Content": "First I have to say i bought this camera from my camera store - not Amazon. But I have to say why I love this camera.I have a Canon 7D that I love too, but I was in the woods taking photos of a Scarlet Tanager along with another couple in front of me. When I clicked my shutter, the bird took off from the sound! Unbelievable.So I went to my camera store and thought maybe a Canon Rebel T4i might be quieter (my sister-in-law has the Rebel XTi and it is noticeably quieter than my 7D) but the sales rep showed me the latest model was just as loud. Then he pulled out an NX1000 and clicked the shutter. Holy Crap! It was almost silent!I was half sold but didn't like the idea that the lens was bigger than the body and with the telephoto lens, it looked like a roll of paper towels with a pack of cigarettes on the back! Plus it had no viewfinder. I felt silly holding this thing out in front of me while looking at the LCD display.When I told the rep I'd think about it, he pulled out the NX20. It was just as quiet and it had a viewfinder as well as a flip out LCD screen! And the body looked like a camera, not a pack of cigs. I was sold. I pulled out my Visa card and picked up the NX20 and the 50-200mm Lens. A perfect kit.One reviewer said the battery drains quickly. It does right out of the box. But you quickly learn to set a smaller picture size and quality, turn off Quick View, Set Image Stabilizer to only function when you press the shutter half way instead of continuous and turn it off when using a tripod. Minimize bursts of fast frames per second and all of these will save battery power. I also bought an extra battery. (Which I did buy from Amazon!)With the Wi-Fi App you can operate the shutter wirelessly with a smart phone. You can mount the camera, turn on the app and watch the screen on a smart phone in another location - then snap a picture! Another app lets you upload your photos to your phone, or the web, say on Facebook. Both apps are free.So here's what I like about the NX20:Pros:Quiet shutter.Mirror-less TechnologyFast shutter. 1/8000th second.Can shoot up to 30fpsLight weight (Easy to carry in and out of the woods) 2 pounds with 50-200 lens compared to almost 5 pounds 7D with 70-300 lens.Viewfinder plus flip out LCD screen (Great for angled tripod shots)20 MegapixelsEasy to learn menuMany Pro featuresInterchangeable lensesWi-Fi wireless shutter release via smart phonesPriceCons:Image Stabilizer has to be off for moving objects. It will blur the photo.Buttons on camera back are very close together. Thumb might accidentally turn buttons on and off.Shooting 30fps can lock up the camera while it processes each frame.Image editing software is only for Windows PC's. (You can download to a Mac but you need another Image editor like Canon's Digital Professional or Photoshop)", "Date": "September 30, 2012"}, {"Title": "Good camera", "Author": "shredlock", "ReviewID": "RV68WZADG2TVL", "Overall": "4.0", "Content": "In the land of highly competitive EVILs, this one stands out quite well, but at the price point, i am going to be more critical (UPDATE: price has dropped significantly, to the point excellent, at this price, it deserves a one-star update). I won't repeat what people discussed about what they like with this little camera, but i will chime in the followings:Good:- I bought this for the NX lens pancake series. I think Samsung hits the nail dead on with \"lenses first, camera follows\" : These pancakes: 16mm f2.4; 20mm f2.8; and 30mm f2.0 designs have no equals, extremely compact,feels and look great on the NX20, and are very well priced. They also have the 50-200 zoom that complements well with the kit zoom, but both are inadequate for low-light situations even with the helping of OIS. The 18-200 seems silly overpriced, and the 85mm f1.4 is very competitive but perhaps oversized and unbalanced mounted on the NX series. The up-coming 45mm f1.8 appears very promising.  I hope the pancake lens line-up is durable enough to withstand the test of time and not be obsoleted with future camera updates, and I hope Samsung will extend their pancake lines (how about 12mm and 70mm pancakes?)- Built in pop-up flash is very convenient.- Faster than my previous NX-100 by a long shot, and better image too.So-so:- JPEG engine in this camera is still a little.... over processed yet inferior somehow. Shadow details tend to get clobbered. in-camera B&W; output is inferior to comparables. It lacks the straight-out-of-camera smoothness and crispness i have come to expect from comparable D-SLR of the same price, such as the Pentax K-5. Best used in RAW.- The EVF is useful, allowing more steady holding in compare to holding it out arm-length from your body, and it helps composing during daytime shooting. That said, since the camera has to process what it sees into a moving image for the EVF, whatever displayed is NOT real time. Translation: if you think EVF is an equal subtitute for D-SLR viewfinder, it is not. I can't catch a moment fast enough even when the camera response fairly fast. So the D-SLR still is the tool for critical photography (sports action, critical moment shots). So, i still don't expect this camera to replace D-SLR big kit.Bad:- Fancy wifi features are neat, somewhat buggy. The camera freezes on me a couple of times while i'm moving through various setup mode and passing through this 'wifi' thing. I have to remove the battery for a hard reset.Overall, i am more critical of the camera due to its pricing and have a higher expectations for that price bracket. I still think it is a very nice bit of toy that I will keep and use quite often: very compact but easily hand-held, great for travel. Still, I expect more improvement in the camera, most critically the JPEG engine (i'm just lazy that way: i don't want to have to process RAW files often)", "Date": "March 3, 2013"}, {"Title": "Best mirrorless camera at this price", "Author": "Jose", "ReviewID": "R2C06P7B29ORX4", "Overall": "5.0", "Content": "The only camera that has the same sensor size and similar features is SONY NEX-7, so the comparisons are mostly referring to SONY NEX-7. I assume that people reading this have already gotten over the debate of \"DLSR vs Mirrorless\"Good:1. Much better value, $300 less than NEX-7.2. Body size is perfect, fits comfortably in hands. Some mirrorless camera are too small;3. The buttons make it a lot easier to operate and switch between scences4. Operation is fast, definitely at the same performance level as the entry DSLR; I had a Canon T3i didnt notice any slow-down.5. Display screen is very good, it has an EVF but I never needed to use it even under sun light.6. Image quality is very good, I dont think there is any real difference between cameras of same sensor size.Bad:1. Battery drains a bit faster than I expected, may be because it is a new camera and there were lots of playing around to get familiar with it.2. Locked up once, had to pull batter out. There is a new firmware, dont know if it fixes it.3. You can't show off your new toy to your friends, because they may ask \"you paid $1000 for this?\"; NEX-7 is a beauty and looks expensive, NX20 looks plain and boring.Buy the NX20, save $300 and use it on a lens.", "Date": "July 27, 2012"}, {"Title": "Great Price for a great camera", "Author": "R. Cronin", "ReviewID": "R2RDZ6DGR5WH0D", "Overall": "5.0", "Content": "I have had 2 point & shoot digital cameras over the last 8 years.  My first (Olympus) died after about 4 years. My second - which I adored - will no longer focus.  It was a Kodak easyshare 900 (?) with a phenomenal zoom and lots of manual choices so I could do some night photography with a tripod and some macro with the Little BigShot ([littlebigshot.blogspot.com]).Fed up with \"cheap\" cameras, I decided it was past time I got myself a DSLR and was determined to hunt down a good Pentax so I could use all of my old 35MM SLR lenses.  Then I heard about CSCs.  So, I went to a camera store and tried and compared between them.The difference in weight between this Samsung NX20 and a Pentax (without a lens) was amazing.  The difference in photo quality was negilable and although the mounts are different, two lenses came with it and I figured I'd get a converter after I was comfortable with the camera.I play with it a lot and it's GREAT.  I got a converter here that works like a charm.  I've done some night photography, blizzard pics (with a filter) and generic dog photos and the smart mode is really smart.  The manual modes are fun and although I haven't used them very much, I will.  I got another Little BigShot (can't beat the price [littlebigshot.blogspot.com] ) and saved the price of a macro lens.I'm taking a trip to NZ and AUS and am very much looking forward to taking tons of photos.As for the battery, if you charge it for 12 hours the first time (like the directions say) it lasts for a very LONG time.  I did pick up a spare 'cause of the upcoming trip, but I have no complaints at all.For the money, this is the best camera available (IMHO).", "Date": "March 1, 2013"}, {"Title": "Ergonomic and Versatile Camera", "Author": "David L. Oliver \"Desert Denizen\"", "ReviewID": "R206KXUTJQHHVW", "Overall": "5.0", "Content": "I bought this camera after doing extensive research. I decided that the APS-C format was an excellent compromise between a full-frame SLR and the micro-4/3 format. I felt there were advantages to the mirrorless style of SLR, that an APS-C would not be too big and heavy to carry all day nor too small to have an adequate set of controls or fit well in the hand. I have been involved in photography almost all my life (a long time). While I want all the latest features, I also feel the need to go fully manual when the situation calls for it. Being able to turn a ring on the lens to focus is just about the best feature a camera can have. The NX20 has the best of manual and automatic features, allowing the user to easily pick and choose whatever combination they prefer, even presetting custom combinations.There are many professional reviews available online as well as sample images and many videos on Youtube. Some of the videos look like they were taken with a pro-level video camera. Generally the reviews are very positive, pointing out that both the AMOLED viewscreen and LCD viewfinder are the best available as well as many other features. The viewscreen is usable in bright sunlight. The viewfinder creates a good illusion of looking through the lens, but is much better than a mirror in low-light situations. An occasional review is way off the mark though. One criticizes the wi-fi capability of the camera, suggesting taking out the SD card and plugging it into the computer for transferring pictures. I guess they would have us shut down our networks and carry floppy disks from one computer to another. Sorry, wi-fi is a necessity in a modern camera. Not only is automatic photo file updating extremely convenient, the only way to shoot shy wildlife is to put the camera on a tripod, then hide and watch the viewfinder on a phone or tablet. I do have to mention that the wi-fi remote viewfinder works only for still pictures. There is no way to even start and stop a video. Hope this will be addressed in a future firmware update. I will leave you to peruse the reviews, but definitely watch some of the 1080p videos on a big screen.The ergonomics of the camera are nearly perfect. Controls are all easy to find and operate. Both the  toothed wheel on top of the camera, which has multiple functions, and the dioptric adjustment for the viewfinder are a bit small, but those are minor issues. The dioptric range is +4 to -4, by the way. It would have been a deal-breaker for me if I couldn't dial in my rather extreme -3.0 prescription. Using the viewfinder wearing glasses would not be very practical.Nearly all the automatic lenses for the NX series are made by Samsung. This is not a problem because they offer a good variety of top-quality optics at reasonable prices. If you want a fisheye or a long telephoto, there are a number of other brands available. More third party lenses seem to be appearing. The 18-55mm that comes with the camera is quite adequate. It is well complemented by the 50-200 and 12-24. The latter is a superb lens that fits my style of landscape shooting perfectly. The 60-mm macro is a great lens too. Those are all the lenses I have. Most of the primes available are considered to be very good to excellent, especially the 85-mm portrait lens.I have covered mostly the features that are important to me. No doubt your set of requirements is different. I am very happy I bought this camera, but that is no surprise given all the comparisons I made in selecting it.", "Date": "October 13, 2013"}, {"Title": "Great quality pictures and videos", "Author": "Haseeb", "ReviewID": "R3C9W6E8FXZ3BV", "Overall": "4.0", "Content": "I wouldn't get this camera at its normal price point, but for the price I got it for, which was around $500, this was a phenomenal camera. It isn't perfect because it has very few focusing points and takes time to adjust the focus, but I have it on manual at all times so it doesn't matter for me. If you know how to use a camera manually, then this camera will be good investment, but if you're just starting out, then I would recommend getting something more simple.", "Date": "June 30, 2013"}, {"Title": "Samsung NX20", "Author": "Julius Glickstein", "ReviewID": "R19ZOD20WNWZLI", "Overall": "4.0", "Content": "I was happy with NX10 as my travel camera bundled with 18-200 lens. Samsung NX20 was a promising choice. EWF is in color and better than the previous black & white EWF.  Articulated screen is a plus, however I don't use it. Addition of WI-FI increased the cost of the camera and not to many people whom I know use this option. I guess it is a questionable option. This camera was designed towards DSLR users, however mostly reporters are required to upload images instantly to the main servers. I have the camera for two weeks now and still didn't read how to use WI-FI.  Quality of the image is definitely better.What I don't like is that the AF in the low light conditions didn't improve at all in comparison with the previous model. For the travel camera it isn't a big of an issue. However, it would be much better if Samsing would pay attention to it. I have as the second travel camera Canon Elph 300 HS with very fast focus in low light conditions and it costs me only $149. So Samsung could improve this area instead of adding WI-FI.", "Date": "July 15, 2012"}, {"Title": "easy to use", "Author": "A.kalkman jr", "ReviewID": "R38NFRJX5SBO87", "Overall": "5.0", "Content": "easy to use, very nice performance.I am just a starter in photografy but i could work with this camera after a few minutes.the size is just what i wanted and the possibilities seems endless", "Date": "October 17, 2013"}, {"Title": "As Good As I Had Hoped", "Author": "davonroe \"geoson\"", "ReviewID": "R3JFCH2ZY9FLI7", "Overall": "5.0", "Content": "I try to maintain a 4 year rule when buying cameras.  It creates far less stress than lusting after the latest thing.  I had 4 good years with my Olympus E-620, so I did not have to get the latest to have an upgrade.  Samsung is still not on most people's radar when it comes to buying a camera, and some of this is their own fault.  Sometimes it seems that they don't talk to photographers and can't get their gadget roots out of the way.  Their \"flagship\" flash is barely a mid level in my old Olympus system.  But that's another review.At the current price, it's hard to beat the NX-20. 1/8000 shutter, maximum 8 fps are two things I've never had before on my camera.  Some people may scoff, but I like the filters, especially the selective color filters.  The more tools I have to get the image I want in the camera, the less time I spend on my computer.  The camera is also very light.  They say that the camera adds 10 pounds, and I think that also applies to photos of cameras!  Don't let the D-SLR shape fool you.Like most mirrorless systems, Samsung needs to grow its lens catalog, but there are some good ones in the lineup.  I hope there's a faster standard zoom in the near future.  There is supposedly an NX-30 on the way, but who knows when?  I needed to upgrade now, and this was a great buy.", "Date": "May 14, 2013"}, {"Title": "Great camera with surprise features and great quality photo results", "Author": "Raymond", "ReviewID": "R6QY5CP8PC9GO", "Overall": "5.0", "Content": "Here is my initial impression of the great NX20 mirrorless camera.  I will most likely update the review in about a month after having more experience using it.  Here is my initial impression:I have the NX20 with me﻿ for two weeks now. Bought it for $553 with the kit lens at Amazon. Absolutely love the camera. It also lets you take the photo and record a message for about 8 seconds right after the shutter is fired off. Great for yourself leaving a voice message for each of the photos you take, or what your subjects say at the time of the photos being taken. Very nice. And its image quality is simply amazing. The 20 megapixel really means that cropped photos retain much details.  I will post review after another four to six weeks just to have enough time to cover most of the camera's functions and its ability.", "Date": "April 10, 2013"}, {"Title": "N20 Samsung", "Author": "Bml", "ReviewID": "RO9D6Y6YCVON7", "Overall": "5.0", "Content": "First off let me say that I've had this camera for about 3 weeks and no complain. So much features I still have so much to learn. Photos are amazing and clear. WiFi is a huge plus I love taking pictures and being able to send it to loved ones who can't be here for birthdays and etc. Everyone who has seen this camera has fallen in love. On another note I accidentally hit the camera twice and no damage thank god. I was so terrified that after smack the camera and lens on a metal desk there would be damage but nope nothing not a scratch. Battery is great after playing with the camera a whole week did I finally have to charge it. I won't lie I did use it frequently even slept with the camera on some days so I can jump up and take some photos early in the morning. Connecting it with my phone was so easy my little brothers could do it. Its sturdy and feels great when handling it, panorama photos are perfect when taking night photos come out perfect as well.", "Date": "December 18, 2012"}, {"Title": "Awesome camera", "Author": "Jaimie Holewinski", "ReviewID": "R2OTFUOONGAO4Q", "Overall": "5.0", "Content": "This is the first time that I have spent overt $100 on a camera.  When I started shopping around I found this one.  I wasn't very familiar with Samsung and didn't know they made digital cameras.  I read the reviews on here from others who bought it.  The description contained everything I was looking for in a new camera.  The screen on the back is huge and the picture on it is amazing.  I found I can buy old Canon lenses and buy an adaptor to make it fit this camera.  As you can tell,  I am not a camera nut.  I don't know a lot about them but I can tell you this camera is everything I was looking for and a great price.  All my pictures look amazing.  The wifi option is awesome.  I can email pictures from my camera or even share on social media.  I look forward to a summer filled with sports with my son because I will be ready to capture every photo I can.", "Date": "May 23, 2013"}, {"Title": "great camera", "Author": "Doneta Moore", "ReviewID": "RF6IB0UZB2MPQ", "Overall": "5.0", "Content": "I am not a professional by any means, but I love this camera. I bought it for my 14 year old son who has shown interest in photography. I wanted to encourage this by getting him a good camera. I was surprised what all this one can do. My son loves it and that is what matters.", "Date": "February 19, 2013"}, {"Title": "Good Camera", "Author": "Dareshiranu", "ReviewID": "R2PJGEJAQZN6FC", "Overall": "4.0", "Content": "Many cool features. I like articulated LCDs (Yes, I know this is AMOLED). The EVIL works fine. The quality of the APS-C sensor is good. I like the remote viewfinder option, though I wish it worked with video and not just stills. I do wish the shutter was quieter. For not having to move a mirror around it still manages to make a fair amount of noise, but then I won't be happy until I have a camera that is completely silent. I really hate noise (especially shutter noise.) when I use a camera. Otherwise Pretty much what I've been looking for, better than my Pentax K-x.Did I mention I like articulated LCD's? I can't emphasize that enough, plus mirrorless magnifies the effective magnification of lenses, with a smaller body while still looking like a dslr. How cool is that? Not a perfect camera, true... but excellent for the price.", "Date": "May 11, 2013"}, {"Title": "The Smart mode is very good", "Author": "Learner", "ReviewID": "REMXX8YKOZA86", "Overall": "5.0", "Content": "I'm new to a more sophisticated camera than a regular point and shoot. So I can say much about this product yet. On my initial test use under low light scenes indoor or outdoor, it seems that the Smart mode setting handle all situations well.", "Date": "January 30, 2013"}, {"Title": "Bad camera", "Author": "Andres", "ReviewID": "R1MSMJXHM018TV", "Overall": "1.0", "Content": "Within a month of receiving the camera, it stopped working. The camera went off alone. The LED screen showed colored stripes. Out of nowhere the camera stopped taking pictures.Return was attempted but there was no refund after 30 days .  I  contacted the customer service department and no solution was offered. It was a waste of money", "Date": "July 31, 2013"}, {"Title": "Disappointing , and fustrating.", "Author": "cliff wolfe", "ReviewID": "R2ZFP7KI90W8US", "Overall": "1.0", "Content": "We ordered this camera twice, the first one had packareing issues the second  would not allow us to remove the cap that covered the lense receiving hole in the body ov the camera.  We spoke to a Samsung representative and they we un able to comprehend the difference between the cap that goes over the hole and the lense cap. His question to me was after five minutes was \"Have you tried to remove the lense cap?\" At that point my twelve year old who was listening in got up and left the room shaking his head and said to me \"Send it back it must be junk.\" You can't argue with that.", "Date": "October 25, 2013"}, {"Title": "Seal Box Was Open", "Author": "Hosen", "ReviewID": "R2Y9EYPMVOUJVB", "Overall": "4.0", "Content": "I just got this camera today and it was from Huppins and i paid for it $555.00. it was said the cam was \"new\", but i soon as i opend the packaging box, i noticed the Samsung Seal unglued, as if it was open...anyone noticed this issue of  it just me?P.S.  i gave it 4 stars for now so i can write this review...I'm still testing it and might return it if i dont get explanation from Huppins.", "Date": "May 16, 2013"}], "ProductInfo": {"Price": "$1,099.99", "Features": "Lens: Type - Samsung Lens\nFocusing: Modes - Single AF, Continuous AF, MF\nOptical Image Stabilization: OIS Mode1/Mode2/OFF\nDust Reduction: Type - Supersonic drive", "Name": "Samsung NX20 20.3 MP SLR with 3.0-Inch LCD Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41n6mxugbDL._SY300_.jpg", "ProductID": "B007XJGZ7S"}}