{"Reviews": [{"Title": "This is the Japanese version !!", "Author": "Baja Alan", "ReviewID": "R1WXQ2EYKRWK0B", "Overall": "1.0", "Content": "I ordered this camera without any information that on Amazon that this is the Japanese version of the TS-20. The TZ30 has only Japanese language. I have asked to return it to Amazon and am waiting on a RMA number. I do not think that Amazon should have listed this camera for sale without stating that  it comes only from Japan and the language can't be changed. I called Panasonic support and they said to return the camera due to the language barrier. I did ask if they could download software or firmware to change the language but that is impossible.I love Amazon but this is a colossal mistake on their part. The description should have said that this model is the Japanese model. As for the camera, it has all the bells and whistles one could ask for. The 40X zoom is incredible. picture quality is fantastic and it comes with GPS.I live in Mexico so I had to ship to Mexico and now have to ship back to US at my cost.I give the camera 5 stars and I give Amazon on this purchase 1 star. I buy from Amazon all the time and get outstanding service and products. This one just slipped under the radar.The US Model is the Lumix TS-20.", "Date": "January 29, 2013"}, {"Title": "great camera!", "Author": "Patrick", "ReviewID": "R12FWYMZXC43XQ", "Overall": "5.0", "Content": "I love this camera. The colours are vibrant, it focusses quickley, the zoom is impressive. It is small but (just) big enough to operate.It is the ideal camera!", "Date": "October 20, 2013"}, {"Title": "Only in Japanese!!", "Author": "rosa", "ReviewID": "R2UZYJ4X9T76TY", "Overall": "1.0", "Content": "I ordered this camera without any information that this is the Japanese version of TZ30. In your description of the camera you did NOT mention so.After trying to find out more information online I discovered that I am not the only person who has had this same problem. After having looked online I realized that the camera not only has not a language display option that neither software or firmware can be downloaded to solve this. Now I am forced to return it due to the language barrier.My question is: Can I change the camera for another one of the same model but with English language options? And if not, how do I return product for full refund? I really feel that Amazon should shoulder some responsibility for lack of information on website.", "Date": "February 24, 2013"}, {"Title": "NO ENGLISH MENU", "Author": "Abdulaziz A Al Angari", "ReviewID": "R2YIKL6MYZFDQ4", "Overall": "1.0", "Content": "it is better to announce everyone here that you are selling a local product with your own language. before they decide to pick your items.most of softwares come with a flixable optoins to replace it or upgrade it accept this one !Firmware update service will never help ...really disappointed !!", "Date": "February 11, 2013"}, {"Title": "Japanese?", "Author": "John Crotty", "ReviewID": "RQ4Y2T50PVZ4O", "Overall": "1.0", "Content": "This camera has a great \"feel\", but this particular model was worthless to me because I don't speak or read Japanese.  I was impressed with the promptness of the shipping but discouraged that the order placement did not specify that all the instructions internal and external would be in Japanese.  I had to return it for a refund.", "Date": "September 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0073N21ZO"}}