{"Reviews": [{"Title": "Not too shabby... UPDATED: \"Fantastic\"", "Author": "MeredithNCSU girl", "ReviewID": "RJF9DPXHUMCQI", "Overall": "5.0", "Content": "Ok, let me preface where this review is coming from. I am an amateur photographer who is a \"Canon Girl\" and has a Canon 50D as my primary DSLR \"love of my life\". Therefore, this may credit or discredit me in any way that you see fit in reading this! I've been in the market for a new compact for quite some time since my beloved Olympus lost its functionality last year(which happened to be my first taste in photography believe it or not several years ago..of course electronics do not last forever). I decided to take the plunge and purchase a camera that was so new that it did not have reviews on it yet!First things first, this may or may not be a surprise, but the package does NOT come with a memory card. I suppose I'm used to these things coming with some sort of crappy low memory card to at least get you started. But, no worries, SanDisk makes a pretty inexpensive and of \"ok\" quality card. Amazon does not list what kind of memory cards this takes, (SD, SDHC, SDXC)Second, MOST surprisingly, I actually read the users manual. I, like many others, tend to want to go the \"I'll figure it out as I go\" route. The manual was helpful and explained things at length.Third, software installation pretty simple...however, I did have some trouble figuring out how to actually upload some sample photos that I took, but the manual gave me a fantastic instruction. That said, this will just go to show that the manual is pretty well written and in laymen's terms should that be of concern.Fourth, went out to test drive it a bit. I suppose I feel as if I should have the knowledge/mental capacity being that I lead a part-time job being a photographer, however, it IS something new and change is difficult...BUT, it was simple to operate not to mention that it's pretty cool that the screen shows you AND MOVES with your targeted subject. I got clean, crisp photos. My favorite part of this camera is that when working with difficult \"subjects\", which in my case happened to be my rambunctious boxer/pit 2 2/12 year old dog, the moment you close on the shutter release, it captures exactly what you were intending. So, no more blurry head moves and smiles that you did not catch in time. BRILLIANT.Overall, the reason why I gave it 4 and not 5 stars is because I read about all this nifty artsy stuff you could do with the camera, however, I couldn't seem to figure it out right off hand.  (I JUST got this yesterday). Regardless, so far it seems to be a great little camera and I am looking forward to utilizing it more with events in my life that don't have much room for my big DSLR to be attached at my hip!! (note: I may update later when I get further into using it)UPDATE: 4/3/12I've had the camera now for a few weeks. I JUST figured out YESTERDAY how to use the \"artistic\" features for the camera. It took me forever to figure it out. Apparently, Canon has gotten a bit lazy and you now need to DOWNLOAD the ENTIRE manual from the CD you receive. My co-worker and I had a blast playing with the features. The toy camera, fish eye, and the miniature art features are really fun. Which is EXACTLY what I was looking for in this camera. Therefore, I upgraded my review for 5 stars!", "Date": "March 21, 2012"}, {"Title": "Good camera for those that just want to take basic photos", "Author": "Southern Girl", "ReviewID": "RWP2DWHALDH0T", "Overall": "4.0", "Content": "I do not know a lot about photography, but I was recently in the market for a small, easy to carry point and shoot camera to replace my 4 year old Canon. I decided to stick with the same brand, as I had no problems from my last camera - I just wanted something a little more up to date. The A2400 has satisfied my needs. It is great for taking photographs indoors as well as outside. My photography mainly focuses on taking shots of my son and the products I review (I am a blogger), and the many different settings allow my photos to be more fun and unique than before.I do have problems getting a clear photograph sometimes, even when my son or other subject is completely still and the camera  is on the auto setting. I don't exactly know what is causing it not to focus on the subject - but it's quite annoying, especially with a toddler. Other than that, I have no complaints.", "Date": "July 30, 2012"}, {"Title": "Love it!", "Author": "Shiala", "ReviewID": "RE26CIQD2G766", "Overall": "5.0", "Content": "I usually use my Canon EOS 60D, but I wanted a small camera to just take along to have a quality camera with me, that's not too heavy and bulky. The image quality is great. I love all the gimmicky features, some of which I used to create with Photoshop later, thus it saves me time :) It looks neat and until now I haven't had any problem with the shooting delay I read about. I recommend to get a nice secure camera bag for this one, to avoid scratches to the screen and body.Overall I love it and the images and videos are excellent!", "Date": "June 15, 2012"}, {"Title": "EXCEPTIONAL CAMERA!", "Author": "L.A. Summer", "ReviewID": "R1L2QVPAPT2CB2", "Overall": "5.0", "Content": "I'm a huge fan of Canon cameras for many years. I've used professional camera (Canon DSLR 60D) to powershot (Canon SX110IS: 9mp, 10x optical zoom) and I have to admit this Canon A2400 is A GREAT DEAL!  When it arrived in the mail, I was extremely disappointed by its size, thinking \"no way, this little junk needs to go back\".  It's smaller than most powershots out there, but once I started to turn on the flash, it blew me away. For this little camera, the flash was so amazing for capturing shots in dark rooms. Best of all, unlikeSX110IS using AA batteries, it came with a Li Battery and a charger. The video mode was also very good, allowed zoom-in/out while video-taping, and the voice was clear. I only paid 1/3  the price I paid for my SX110IS. Cameras are getting cheaper and technology is getting better. There's no reason not to own a Canon!", "Date": "August 20, 2013"}, {"Title": "Awesome camera!!!", "Author": "D. Veith", "ReviewID": "R2BL12UVM17CUP", "Overall": "5.0", "Content": "By a 14-year old girl: After looking at dozens of different point and shoot digital cameras, I finally chose this one and am so glad I did!It's great at taking pictures that come out crisp and clear. There are also a couple different effects which are really fun and cool. Plus some of the effects (like \"vivid\") make some pictures come out better. The camera is slim and pretty-I love the ice blue color! It takes a lithium ion battery, which was new territory for me, because I'm used to AAs! :) But it worked out fine and the battery charged up pretty quick. It also has a slow motion option when watching videos, which is very cool!!This is my second camera. My first was a 7MP Polaroid and although it took GREAT pictures this camera is an obvious step up.I would totally reccommend this camera!!!!!! It's amazing!", "Date": "July 30, 2012"}, {"Title": "Friendly Point and Shoot", "Author": "Bob Rossi", "ReviewID": "RKVAL5ODLY7TL", "Overall": "5.0", "Content": "I bought this camera for my wife.  She's owned a number of P&S; models of all types (Nikon, Samsung, Sony, Kodak) over the last 10 years, but this compact model seems to surpass them all for ease-of-use, quality and sharpness.  The battery stayed charged through a 3-day trip through NYC.  I research the CANON PowerShot prior to purchasing it at Amazon and had to be careful to pick the right model, the A2400, because CANON seems to have a diverse product line. It also seemed that most purchasers of this model were content with the purchase so that sealed the deal for me.", "Date": "July 7, 2013"}, {"Title": "Love, Love, Love My New Camera!", "Author": "Sunsetserenity", "ReviewID": "R3Q8IQXCB6JFB2", "Overall": "5.0", "Content": "I love, love, love my new Canon PowerShot A2400 Digital Camera.  It's compact, fits nicely in your hand, pocket or purse & takes great photographs.  If you're like me (inexperienced photographer!) but want super pictures to keep & remember, this is the camera for you.  It's a no brainer.  The directions are easy to understand and implement.  I ordered the pink color because I love pink PLUS it makes it easier to find in a dark bag or purse.  I think you'll love this camera!", "Date": "June 24, 2013"}, {"Title": "Simple to use and great photos.", "Author": "Richard J. Coleman", "ReviewID": "R6F4YLGAHC01L", "Overall": "5.0", "Content": "So glad I chose this camera.  It operates without glitches and takes beautiful photos.  There a number of settings for custom shots, but I generally just use the automatic.  The zoom is fine for typical  everyday shots.", "Date": "June 16, 2013"}, {"Title": "Use Wikipedia to shop between different PowerShot models to see differences.", "Author": "Mrs \"Reviewer with Dogs\"", "ReviewID": "R2GQR3XTSPTPO3", "Overall": "4.0", "Content": "Very slow to take pictures in low light.  Motion blur is bad in low lighting.  Hard to take pictures of young kids b/c they move around so much.  Lightweight and convenient otherwise.  Pictures are quite good outside and in good lighting.  Very intuitive and easy to use (for those of us too impatient to read through the whole user's manual.)Better than the other Canon PowerShots b/c it comes with a cord to attach to computer, battery and charger.  Must buy separate memory card (great deals on Amazon) to even use it the first time.Use Wikipedia to shop between different Canon PowerShot models.I have a DSLR but find it too big and inconvenient to use a lot of the time.  I wanted something small and cheap for my purse for use with my toddler.  I keep it in a plastic ziplock baggie in my purse to keep it clean and free from scratches as it does scratch easily and will look old quickly if you do not!", "Date": "November 23, 2013"}, {"Title": "Good Little Camera", "Author": "Ed", "ReviewID": "R6XBNXPOXZLAO", "Overall": "4.0", "Content": "Got this camera for my wife.  Good little camera but the shutter speed is VERY SLOW.  This is good for outdoor still shots but forget taking action shots.", "Date": "July 24, 2013"}, {"Title": "Good Camera", "Author": "Danielle", "ReviewID": "RY5TDO0K9H5XL", "Overall": "4.0", "Content": "Good camera, could be better but good. Buttons are somewhat hard to press, and the software you download on the computer was very difficult to use. Used a completely different device (inserted my card in a different device) to see my pics on the computer. That sucks but it does take pretty good pictures. Satisfied for the most part.", "Date": "May 23, 2013"}, {"Title": "I LOVE this camera", "Author": "D. Oswald", "ReviewID": "R34DQ7Y3UU89RI", "Overall": "5.0", "Content": "This camera goes with me everywhere I go.  It is so small and lightweight, and delivers fantastic pictures.  The ONLY complaint I would have is the lag time the camera has after taking the shot, it seems that is a bit long.  However, I am used to it and only occasionally find it irritating.  I do love it!  I also have anSLR Canon, and this one gets more use because of its size and quality.  Nice.", "Date": "May 11, 2013"}, {"Title": "Very nice pictures", "Author": "A. Clausen", "ReviewID": "R3RLRKG8X82HS3", "Overall": "4.0", "Content": "this camera was for my wife, she is hopeless with any technology requiring more than using 2 buttons, however she actually can use this camera and the pictures are very sharp.I could be wrong but I feel the battery lock is a little too flimsy, this is only a feeling and we had no problem so don't let it stop you from getting this camera.", "Date": "May 2, 2013"}, {"Title": "great camera", "Author": "Theresa \"TheresaJuneP\"", "ReviewID": "R39MLFY7D82XJ8", "Overall": "5.0", "Content": "I love this camera, it's lightweight and very easy to use.  The picture quality is great, I am very happy with this purchase", "Date": "April 27, 2013"}, {"Title": "good!", "Author": "hazel", "ReviewID": "R2LIG1RY4JND4H", "Overall": "5.0", "Content": "nice and love it. im sure my auntie will love this one.  im buying this as a gift for her.", "Date": "April 19, 2013"}, {"Title": "GREAT CAMERA!!!!", "Author": "kevrocks67", "ReviewID": "R38Z38JXI4OGM2", "Overall": "5.0", "Content": "This camera as worked great! Even though its only 720p,it still has great quality! It works great for youtubers like me. I would reccomend this camera to anyone.", "Date": "April 10, 2013"}, {"Title": "Great camera easy to use", "Author": "Walter J. Liljegren", "ReviewID": "RCDQAY6S36L5T", "Overall": "5.0", "Content": "Great camera takes very good high quality pictures.  If I find i easy to use it, anyone can use it.", "Date": "March 28, 2013"}, {"Title": "Great Camera!", "Author": "Captain Dave", "ReviewID": "R1VVYS1ZRHT1AI", "Overall": "5.0", "Content": "I got this camera for my mother to replace an older model Canon PowerShot. For the price this camera has all the features an amateur photographer needs. The 5x zoom is very clear. This camera is very easy to use. Note** this camera did not come with a memory card, so make sure to consider that into the price when purchasing this camera.", "Date": "March 22, 2013"}, {"Title": "Worst Canon camera I have ever bought", "Author": "A. Santiago Jr.", "ReviewID": "R1I4A7C6VFU2CS", "Overall": "1.0", "Content": "Since going digital, I have used nothing but Canon cameras.  The DSLR Xsi, the powershot SD500, SD550's, SD870IS's, etc.  This A2400 line is the worst I have ever seen from Canon.  For a 16 megapixel camera, it has horrible focus, colors, and it's very SLOOOW to use.  I could not believe the poor picture quality.  This one quickly was sent back and I got a Nikon Coolpix S6400 which is 10 times nicer.  It's not the fastest camera around, but it's the picture quality that matters most to me.  STAY AWAY from this one, honestly.", "Date": "January 2, 2013"}, {"Title": "good camera arrived quickly", "Author": "hollenrati", "ReviewID": "RSAUL8GEFP50C", "Overall": "5.0", "Content": "I think this camera is going to work out just fine. It was comparatively inexpensive to other point and shoots. I also appreciated a few more dollars off because I was OK with the pink. The one drawback, which I knew from reading the other reviews was you cannot shoot with this camera out of the box. You need to purchase a seperate memory card.", "Date": "April 18, 2013"}, {"Title": "So far so good", "Author": "Margarete Hays", "ReviewID": "R3CWSTKTPM96BV", "Overall": "4.0", "Content": "My only complaint is that the camera is a little cheap feeling. Of course, I didn't pay that much for it but it really does feel like a toy. So if you are ok with a very light and small camera, this is the one for you. I read the reviews so knew it didn't come with a Card - I am glad my expectations were met there. I did use the camera on a big trip and the camera seemed to hold up very well. We'll see when I develope the pictures. They look clear in the display. Takes pictures quickly and the controls are easy to figure out (I didn't read the manual).  Good little camera for at a low price.  I like it.", "Date": "April 3, 2013"}, {"Title": "I love this Canon", "Author": "Adriana Riccitelli", "ReviewID": "R4ER031UY8XHM", "Overall": "5.0", "Content": "This is my second time with this model.The previous was stolen to me from my bag... It was sad.But it was happy to see the price this time I purchased it.I recommend this camera, the photos and shots are excellent and it is very easy to use it.Love it!!!", "Date": "January 18, 2014"}, {"Title": "Christmas Gift", "Author": "Nelda Ray", "ReviewID": "R2ITU6ZP7JQLK4", "Overall": "5.0", "Content": "This was a gift so I don't know. Canon is the best camera that I know of I have one myself.", "Date": "January 16, 2014"}, {"Title": "Just OK", "Author": "SuPark", "ReviewID": "R2ILN7BJGXMHTP", "Overall": "3.0", "Content": "I bought this camera for my granddaughter's birthday - I guess it's OK for a first camera for a young girl, but it is really lacking in any features.  Should have read more closely!", "Date": "January 10, 2014"}, {"Title": "great camera for granddaughter", "Author": "Terry M. Tuck", "ReviewID": "R3UE961L8OOI7X", "Overall": "5.0", "Content": "This was a gift for my 6 year old granddaughter who loves to take pictures.  It is small and very easy for her to use.  It takes excellent pictures also.", "Date": "January 5, 2014"}, {"Title": "Love my camera", "Author": "Mimi \"Bon Bon\"", "ReviewID": "R3RK3R6DE91NSQ", "Overall": "5.0", "Content": "This camera works just like the spec says.  I bought a Fujifilm camera and NEVER AGAIN!This camera doesn't blurr, has multiple shooting modes and all the other fancy features that any good camera should have.", "Date": "January 2, 2014"}, {"Title": "good camera", "Author": "gigi", "ReviewID": "RHXKZOO958H1C", "Overall": "5.0", "Content": "Nice little point and shoot camera. Bought for our teenager, and she loves it, and the color. Thanks for making it available.", "Date": "January 1, 2014"}, {"Title": "Great camera!", "Author": "amc", "ReviewID": "RNB7JBYXX0WLP", "Overall": "5.0", "Content": "This is the third PowerShot I have owned so I obviously love the camera.  I did not realize, however, that it does not come with a memory card.  I think this item should definitely be included with the purchase.  Couldn't use it until I made a special trip to purchase one.  Other than that, this is a great camera that fits in your purse or pocket, always ready for that photo opportunity!", "Date": "December 23, 2013"}, {"Title": "Niece happy with the Camera", "Author": "Tina Meador", "ReviewID": "RMUF9B237DUBG", "Overall": "5.0", "Content": "My brother said it is even better than his camera!!! Great gift to give someone. My niece is 14 and this is her first camera. She is already able to use it as it is very user friendly.", "Date": "December 15, 2013"}, {"Title": "Great product Great Price", "Author": "Kirk D. Buehler \"Main Street Signs\"", "ReviewID": "R5I66FKTEOYPC", "Overall": "5.0", "Content": "Great for price! Its very small which I like but found that older people hate. As with all Canons extremely easy to use. Not much lag in the shutter speed so the pictures are rarely blurry. Love it. thinking on buying one for a Christmas gift.", "Date": "November 18, 2013"}, {"Title": "Canon PowerShot A400 is wonderful", "Author": "Amazon Customer", "ReviewID": "R3KRYHKGMS5SIS", "Overall": "5.0", "Content": "I love using the Canon PowerShot A400! It's compact, easy to understand and takes great pictures. I charged the battery and starting shooting pics right away", "Date": "November 7, 2013"}, {"Title": "good camera!", "Author": "skim", "ReviewID": "R2CZP43ZRJBZ5V", "Overall": "5.0", "Content": "compact, small, takes good quality pictures. i love the color of it and it is user friendly. would recommend this camera.", "Date": "November 6, 2013"}, {"Title": "A birthday present for my daughter", "Author": "Shaun Mallonee", "ReviewID": "R5ZM4P75O586R", "Overall": "5.0", "Content": "It worked perfectly for her as it's fairly easy to use.  Even her mom started using it and she has her own.", "Date": "October 6, 2013"}, {"Title": "the canon digital camers", "Author": "Hannah Bumgardner", "ReviewID": "R1F13YTBHZR1GC", "Overall": "5.0", "Content": "The Canon digital camera is a good brand of digital cameras and expensive,but Canon digital cameras take really good pictures,I love the canon digital cameras.", "Date": "September 30, 2013"}, {"Title": "Good as a second camera", "Author": "Sebastian Zelonka", "ReviewID": "RCZBN0JP94WS0", "Overall": "3.0", "Content": "This pocket camera is a good choise if you have some SLR camera and want another one to carry with you. The pictures are good in sunlight, but without natural light, the pictures are just ok.", "Date": "September 8, 2013"}, {"Title": "No memory card included", "Author": "Melody", "ReviewID": "RE4R5A9S46X65", "Overall": "4.0", "Content": "No memory card included, but besides that everything is good! It takes a little to process after snapping a picture.", "Date": "September 1, 2013"}, {"Title": "Great Camera!", "Author": "Carly", "ReviewID": "R3DVZTQ6YJTKQ2", "Overall": "5.0", "Content": "I love Canon cameras and needed a point and shoot one. This one is so great! Even if you aren't great with technology, it's easy to use and takes great, clear and bright pictures. Glad I bought it!", "Date": "August 24, 2013"}, {"Title": "Sweet little camera.", "Author": "NJ Guy \"PKS\"", "ReviewID": "R2C09QKBSPTUQS", "Overall": "4.0", "Content": "Sometimes I wonder if its worth buying 400/500 bucks camera. I am not BIG on photos. Sometimes when I am on vacation and plan to take nature pics then my Nikon D60 with 300m lens comes in handy. For all other day-to-day pics, this camera does the job.", "Date": "August 20, 2013"}, {"Title": "Great little camera", "Author": "Alice Spinler", "ReviewID": "R3IT5XTDWU5HRK", "Overall": "5.0", "Content": "It is very easy to use and takes great pictures.  I love the size, as it fits in my pocket.", "Date": "August 16, 2013"}, {"Title": "Thank you Adorama for your speedy service!", "Author": "Maya", "ReviewID": "R3MH7NT0LSOGGV", "Overall": "5.0", "Content": "I ordered this great little camera on a Thursday and it was in my hands yesterday before 11am! I didn't even request expedited shipping! Thank you Adorama, I am excited to finally have another point n' shoot (my Sony got stolen..:-( , but I'm a \"Canon gal\" so I know I will enjoy this camera.", "Date": "August 11, 2013"}, {"Title": "love this camera", "Author": "carrie suriano", "ReviewID": "RLEB0LQSSCKFN", "Overall": "5.0", "Content": "I  choose this camera because it is small and will fit in my pocket or purse.  It meets all expectations and takes great pictures, I am very happy with this purchase.", "Date": "July 28, 2013"}, {"Title": "Cute Little Camera", "Author": "Malissa Mackey", "ReviewID": "R3HFTG7TPRMODQ", "Overall": "5.0", "Content": "So far so good! It's pretty light and really easy to use. I got this to replace a huge Canon camera I was gifted with when it started to act up on me. I tried the video feature on it too, and even though the volume on the camera itself was pretty low on playback, it was really clear sound when I played it back on my laptop.Overall, I'm a happy camper.", "Date": "June 3, 2013"}, {"Title": "GREAT", "Author": "Joyce Buon", "ReviewID": "RWZNVHRX7BU37", "Overall": "5.0", "Content": "The PowerShot A2400 met my expectations of the Canon but Canon cameras always do.  I am very happy that Amazon provided me with this camera and the price was just right.  Thank you.", "Date": "May 2, 2013"}, {"Title": "picture perfect", "Author": "Tweet514", "ReviewID": "R238AM3TNNR6AE", "Overall": "5.0", "Content": "This camera is awesome.  It's nice an small, fits easily in a pocket or purse and takes great pictures! And I love the color!", "Date": "April 26, 2013"}, {"Title": "Gift", "Author": "Sexytrini", "ReviewID": "R4JY37CN6U6PX", "Overall": "4.0", "Content": "My husband and i bought this item for my god daughter as a birthday gift and she loves it no complains", "Date": "April 20, 2013"}, {"Title": "Nice looking camera", "Author": "Country Boy", "ReviewID": "R2PG5MA05IBT9N", "Overall": "5.0", "Content": "bought this camera for our granddaughter. This is her first camera, it seems simple to use and it has a built in help key.", "Date": "April 6, 2013"}, {"Title": "I love this camera it does come with a battery charger.", "Author": "Eileen", "ReviewID": "R10A372BQOW9G", "Overall": "5.0", "Content": "I am so glad I didn't listen to all the negative reviews, this camera takes beautiful pictures is really easy to set up and use, I have no idea what the bad reviewers are talking about I love the online manual, I bought this camera to keep in my pocket book so I always have one ready to take pictures this is my third canon and I am so glad I bought it. And the best part is it is pink what more can I ask for.The only bad thing I have to say is I asked customer service if it comes with a battery charge it doesn't say in the product description she said it doesnt come with one so i ordered a extra battery and a charger not sure if I am sending the extra charger back.", "Date": "March 24, 2013"}, {"Title": "Gift for my son", "Author": "Judy Deetz", "ReviewID": "RAQ0NZPFQ2JZW", "Overall": "5.0", "Content": "Gave this to my son as a birthday gift. I have one of the older canons and this one is every bit as wonderful. Service was wonderful and everything lived up to the expectations.", "Date": "March 20, 2013"}, {"Title": "Love, love, love this camera!!!", "Author": "Christine Taylor", "ReviewID": "R2GZLR5JQB10LY", "Overall": "5.0", "Content": "When I got a new phone and found out that it had more megapixels than my camera, I just had to find a new one! This camera has been great! It is small and fits in my pocket and takes wonderful pictures. I have not been disappointed and would buy it again.", "Date": "March 16, 2013"}, {"Title": "GREAT,COMPACT CAMERA", "Author": "DAVID DANKE", "ReviewID": "R1TV0EEMSKWZ2Z", "Overall": "5.0", "Content": "REALLY LIKE THE COMPACT SIZE,TAKES A REAL CLEAR PICTURE,AND IT FOCUSES GREAT...REALLY ENJOYED USING IT FOR THE BATHING SUIT CALENDER WE MADE FOR HIS BIRTHDAY!!SHIPPING WAS FAST...LIKED THE EASY  ZOOM IN AND OUT AND IT IS A NICE COLOR...MATCHES MY HONEY'S EYES!!HAVE HAD OUR NEW CAMERA FOR ABOUT A MONTH AND ALSO ENJOY TAKING PICTURES OF ALL OUR LITTLE ONES!!!", "Date": "March 5, 2013"}, {"Title": "Canon Powershot", "Author": "SFM716", "ReviewID": "R1FI048NR9H3BB", "Overall": "5.0", "Content": "I'm very happy with my new camera.  I love the small size of it and it seems to take good pictures.", "Date": "February 21, 2013"}, {"Title": "Compact + easy to use", "Author": "LEO ANTONS", "ReviewID": "R2NRKZOJ67HXA3", "Overall": "4.0", "Content": "Very compact. EZ to use. Great color accuracy. Very quick recovery after a picture is taken...Take many picures w/o waiting for the battery to recharge.", "Date": "February 17, 2013"}, {"Title": "nice camera for a great price", "Author": "T. Gerics", "ReviewID": "R2G4FWM1S3954W", "Overall": "4.0", "Content": "this was a replacement camera to one that just broke. It is great for the price, takes great pictures. It does the job", "Date": "February 1, 2013"}, {"Title": "Love it Clear Picture", "Author": "Michelle", "ReviewID": "R2ZH2RRQSBHBVL", "Overall": "5.0", "Content": "All I wanted was a pretty cheap camera that took very clear pictures this did just that I love it!", "Date": "January 28, 2013"}, {"Title": "Great camera", "Author": "Gandolf", "ReviewID": "RLVPI1PFM9ZOK", "Overall": "5.0", "Content": "I could not spend a lot of money so I did my research.For the Buck this is one of the best you can get.It has plenty of bells and whistles.", "Date": "December 28, 2012"}, {"Title": "Good product", "Author": "Mrs. Pen4you", "ReviewID": "R3VT5RY4TQVFJQ", "Overall": "5.0", "Content": "As always, Canon makes excellents products. I was looking for point-and-shoot camera with an OPTICAL zoom (dont like digital-grainy zooms). It zooms in video mode, too. You will be amazed at the picture quality of this product.", "Date": "December 28, 2012"}, {"Title": "Amazing camera", "Author": "Sniper", "ReviewID": "R3IW2YF1O0BXTV", "Overall": "5.0", "Content": "This is a very compact camera and yet it packs a whole lot of features that are really cool to have and play with.Good price too.", "Date": "December 24, 2012"}, {"Title": "Canon is hard to beat for the price and quaility", "Author": "R. Barnett", "ReviewID": "R2KOSDL1WKYE3L", "Overall": "5.0", "Content": "Canon is always my choice on cameras and printers because they deliver quaility with out the high price like other brands", "Date": "December 23, 2012"}, {"Title": "I love it", "Author": "ASAAD \"I'm an MBA student at the University o...", "ReviewID": "R1FT6GQ8HDX5XH", "Overall": "5.0", "Content": "Great price for great camera I highly recommend it for anyone who likes to take daily  pics or want to lear", "Date": "December 12, 2012"}, {"Title": "HD video is the best choice", "Author": "shufengjue", "ReviewID": "R3S57TXR0PRDV1", "Overall": "5.0", "Content": "Taking pictures with the Canon Powershot A2400 IS is fun and easy. But if you ever have questions, the camera is ready to help. Just press the \"?\" button on the back and you can get shooting advice, find out which buttons do what functions, and get your camera questions answered, right on the LCD screen. The camera also helps keep your handheld shots steady with optical image stabilization, for blur-free results.The A2400 is slim enough to fit in your pocket, quick enough to capture the moment — and smart enough to figure out the right settings for every situation so you get the best shot. In fact, it's so smart that it can automatically take a picture when your subject smiles or winks, or when you get out from behind the tripod and enter the frame. And if you decide that the moment calls for motion video instead, you can switch to HD video mode by pressing the dedicated movie button.", "Date": "December 4, 2012"}, {"Title": "Extremely Poor Image Quality", "Author": "Jim Fierro Jr.", "ReviewID": "R3LJW7RG8CBRTZ", "Overall": "1.0", "Content": "I am an intermediate photographer and am pretty knowledgeable about cameras and their different settings. My wife and I ordered this camera for our daughter for Christmas, we got it on a lightning deal for a decent price. I believe it was $69.99 (normally $129.99). After taking the camera for a test drive, I learned that the image quality of the photos from this camera even in perfect lighting and settings (I set up my lights and backdrops, the whole nine yards). I snapped a few photos of my daughter, upon looking at them on the LCD screen, the photos seem to be pretty nice but once I downloaded the photos to my computer to do a little post processing I realized that the photos are extremely dirty looking and way too noisey and there is no post processing that can fix these kind of issues. The photos appear to be extremely splotchy. So I decided that maybe it was too much for the camera to handle and took it out for a casual run at a local park. I ran into some ducks and geese and got snap happy, playing with different settings and snapping and changing settings again and snapping some more. I came home and transferred the photos to my computer and opened up Lightroom 4 to do a little post processing and the photos were the same as the first round in my studio.My opinion is stay away from this camera, I am a fan of canon and they usually produce pretty decent photos but this camera is not worth the heartache. I know people say you get what you pay for but in this case it isn't even worth that much. I can get better results going to the store and picking out a disposable 35mm film camera. Don't waste your money or time on this camera. Canon makes much better cameras than these and this is pretty disapointing for my daughter because she enjoys going out on photo shoots with me and I thought this would be a good starter camera for her. I am returning this product for a full refund and will get her something else.", "Date": "January 7, 2013"}, {"Title": "A fine little camera", "Author": "Philip R. HUGHES \"Capri142\"", "ReviewID": "R1SXJ83O7HYVH", "Overall": "4.0", "Content": "For the cost, this little camera cannot be beat! My wife recently took over our other camera, so I started looking around for another. I have never had a Canon, but after reading reviews, I decided to give it a try. I did not want something I had to make a lot of adjustments on the Canon's Auto setting takes care of that. The small size of the camera means that I can carry it easily in a pocket....and easily get it out. I don't understand other reviews that say the pictures it takes are not clear. While this camera will not give you the clarity of the pictures you get from an expensive SLR it does a fine job. Of the 5-600 pictures In have taken over the past few months, they all came out crisp and clear but for a few which were obvious operator error. My wife now is eyeing this camera. I have a feeling I will soon be using my old camera again.", "Date": "November 19, 2012"}, {"Title": "Love it!", "Author": "tcole", "ReviewID": "RXMKHWD9EOP8Q", "Overall": "5.0", "Content": "I have had this camera for almost 2 months and I use it a lot also I have owned several digital cameras, this is by far one of the easiest to use. It takes great pics every time...I haven't had a single issue with this camera....HIGHLY RECOMMEND!!!!", "Date": "May 25, 2012"}, {"Title": "Best Camera in This Price Range", "Author": "lksj", "ReviewID": "R1L55DCKC47J0U", "Overall": "5.0", "Content": "This camera has all the features I was looking for at a great price.  I purchased it for my 89 year old father so was looking for a camera easy to use that had image stabilization.  Dad loves it -- He can use it in auto mode and not have to deal with the more complicated features that are available.  The image stabilization is a real boon, he doesn't have to worry about holding the camera still.", "Date": "August 28, 2012"}, {"Title": "poor colors, grainy", "Author": "S. Cohen \"ShinBet\"", "ReviewID": "R1NGYULB1CN9GU", "Overall": "1.0", "Content": "I purchased this camera to replace my 10 year old 3Mega pixel Fuji camera.This Canon camera has by far 1/10 of picture quality and detail, and the colors are always off.... either too yellow, or too blue... I called canon, and they said this is how the camera is!!!! Yes, they admit the 10 year old Fuji takes better pictures at 3 mega pixel compare to this much higher quality camera. Thumbs down to Canon....Too bad i opened the box after 30 days of purchase, so I cant return this useless camera.", "Date": "May 8, 2013"}, {"Title": "uh-oh", "Author": "kevin's mom", "ReviewID": "R2URHA1XKB2VXM", "Overall": "1.0", "Content": "we had to throw away our old Canon camera because the pictures had too much red. Portraits were downright satanic. There's no fix  for this problem.  Reviews of this camera emphasized picture clarity, but I'm already seeing hints of the flat red coloring in some faces.also the viewfinder is horrible. Nearly impossible to see what's in the picture.", "Date": "April 17, 2013"}, {"Title": "Very good quality of both video and stills.", "Author": "Jason", "ReviewID": "R27CODBHDNAGYE", "Overall": "5.0", "Content": "It is very tiny and carried, easily. The LCD screen is a good size. Am taking it to Europe with me and plan to use it, daily.", "Date": "July 21, 2013"}, {"Title": "Excellent", "Author": "Susan Sakash", "ReviewID": "R2ANFP7DX9Q7ZQ", "Overall": "5.0", "Content": "We bought these for teenagers who were visiting from another country.  Without any instruction or direction reading they were able to take beautiful pictures indoors and out, all in focus, with the zoom and without, with a flash and without - and transfer all their pictures to a computer.  Seconds later the pictures were on facebook.  (If you're giving this to a teenager you know the importance of this.) The blue and pink ones cost much less than the black and silver - even though they were the same camera.  And they loved the colors.", "Date": "July 14, 2013"}, {"Title": "Not the best camera out there", "Author": "RiverRun", "ReviewID": "RYPMB4SBD1WGV", "Overall": "2.0", "Content": "I have not had this camera for long, about a month or two, but it ranks low on the cameras I have used. I  normally stick with my DSLR, but I bought this one to have in my purse and to use for quick videos. The video quality could receive 4 starts, but it goes out of focus very often and the only way to re-focus it is to turn the camera off and then back on. The picture quality leaves much to be desired, I will never use this camera for pictures. It's also too small for me, I am use to my large DSLR and lenses, I can barely hold this little thing...a good size for toting around, but not for comfortable use.", "Date": "May 18, 2013"}, {"Title": "it's okay", "Author": "CMTeServ", "ReviewID": "R14GXTRCA2I8M2", "Overall": "3.0", "Content": "it's okay. The buttons are easy to push wrong. The camera does as advertised, but it appears to be light quality. We'll see how it holds up.Flash on is not a feature, only auto or off", "Date": "March 1, 2013"}, {"Title": "Downgrading camera", "Author": "cassochinadoll", "ReviewID": "RGK3VHISCSBAE", "Overall": "4.0", "Content": "I like the size of this camera and I sold my Nikon Coolpix in order to get a more compact camera. I can definitely notice the difference between this one and the coolpix because the quality is different. However, this camera is much easier to use and carry around on fun nights in the city. The quality is great but not as good as my old camera. But whats the use of a great camera if it's too bulky to carry around?", "Date": "January 7, 2013"}, {"Title": "Way to hard to use for an amature", "Author": "Brenda Pence", "ReviewID": "R1RU454B3SA3EP", "Overall": "1.0", "Content": "I thought this was going to be an easy to use camera (Point and shoot) but there is soo much to  it that I can't figure it all out and have not used it hardly at all.  I wish I had never bought it.", "Date": "December 25, 2013"}, {"Title": "very dissappointed", "Author": "Shelby T.", "ReviewID": "R182ZEJU1IJK1I", "Overall": "1.0", "Content": "I purchased this camera knowing it was on the inexpensive side but not wanting to spend a lot of money being that I like to take it on my many adventures.  Not only does the lense not want to open and close properl, but the color of my photos are very blah on \"auto\" and very \"fake\" on vivid color.  Wishing I could send it back but didn't keep the box.", "Date": "October 21, 2013"}, {"Title": "Great camera", "Author": "B. Fackrell", "ReviewID": "R1UO6U50DZOIQ9", "Overall": "5.0", "Content": "I bought this for my parents who are technically challenged several months ago and they use it all the time with ease.  The quality of the photos is also great.", "Date": "August 13, 2013"}, {"Title": "Canon Powershot A2400", "Author": "Phyllis Koenigsberg", "ReviewID": "R2T7VTMM8X0S4E", "Overall": "5.0", "Content": "This camera was a very welcomed gift, the recipient was thrilled to get it.  It was exactly what we wanted.", "Date": "July 11, 2013"}, {"Title": "Brand new Canon", "Author": "Johnny Bravo", "ReviewID": "RHHG63YSGMBRR", "Overall": "4.0", "Content": "I like this camera but for me it's a bit small. I'm 6' 3\" and I guess my hands are too big. But great pictures and great price.", "Date": "June 27, 2013"}, {"Title": "Terrible", "Author": "Jacqueline Rourke", "ReviewID": "R2UF1S964RTTQY", "Overall": "1.0", "Content": "From the first use the lens has some issue.  Screen says lens error restart camera.....lousey camera.  If you can actually take a picture they aren't  bad", "Date": "May 21, 2013"}, {"Title": "Canon Powershot A2400", "Author": "L. Cate", "ReviewID": "R2FA4SJ71AGOPQ", "Overall": "4.0", "Content": "The camera is a perfect size, takes marvelous pictures, and is exactly what I wanted.  The only issue I have is the difficulty understanding the instructions.", "Date": "April 7, 2013"}, {"Title": "As expected", "Author": "SatyaKiran Watts", "ReviewID": "R2YPDPKV89SE7Z", "Overall": "4.0", "Content": "As expected. Still not sure if it suit the requirement or not but for now this item can be rated as 4 based on the look and feel", "Date": "March 27, 2013"}, {"Title": "Pink Canon", "Author": "Suzanne M Drew", "ReviewID": "R3FYHS1FJ126OK", "Overall": "5.0", "Content": "Light easy to use, great photos & videos!  Much nicer than the Kodak I was using.  Very happy with purchase.", "Date": "March 22, 2013"}, {"Title": "Great camera for a great price", "Author": "Mike O'Connor", "ReviewID": "RLH05DWW7876O", "Overall": "5.0", "Content": "Great value for the price. Small camera. Does what it is supposed to do. Filled all of my expectations of a small, affordable, digital camera.", "Date": "February 26, 2013"}, {"Title": "I'm somebody again!", "Author": "Luwhowho", "ReviewID": "R17ZPC4T67KODR", "Overall": "5.0", "Content": "My daughter ( the  photographer ), the first camera I purchased her was a compact digital Cannon somewhat like this one.  Years later she re-gifted it back to me.  I loved that camera!  January 2012 we had a house fire that was a 100% loss.  For over a year I missed my camera but now thanks to you, I got it back!  I have not yet had the opportunity to indulge in every aspect of the camera but, I LOVE this Cannon more than my last one.  A BIG THANKS!  LK", "Date": "March 25, 2013"}, {"Title": "canon power shot A2400", "Author": "L. Toumey", "ReviewID": "R1SM0KTTDKTDY9", "Overall": "3.0", "Content": "This camera meets my needs, is compact, easy to operate, produces clear and sharp photos; recharging the battery is super simple!", "Date": "January 6, 2013"}, {"Title": "Not bad but....", "Author": "S. Minnella \"Fast Draw\"", "ReviewID": "RQ9VO54RUJVIH", "Overall": "3.0", "Content": "Either there are a lot of spooks in my house or this camera has built in Orbs...Sometimes I take pics and get no Orbs and other times there are a few and sometimes there are a lot...I have no idea why. Outside pics seem to be ok. Anybody get lots of Orbs with this camera...Would like to know...:)", "Date": "April 12, 2013"}, {"Title": "Nice Camera -Read description", "Author": "V. Stephens", "ReviewID": "R2KONS2B47VFM2", "Overall": "4.0", "Content": "I -think- this was an all around nice camera. We got it about 5 days ago, but I haven't been able to use it since it doesn't have internal memory and requires a card to function. A little annoying for someone who missed her anniversary, 11 year old's birthday, my youngest's 1st birthday and now apparently Christmas. It was my understanding that if an electronic device couldn't perform it's basic function without additional products, it would clearly display that fact like in \"batteries not included\". In my case, I cannot just run to the store to buy one... but I did already order one. I understand the idea of cutting costs -but it doesn't make good business sense to disappoint your customers like this. BOTH Canon and Amazon need to be aware of that.", "Date": "December 21, 2012"}, {"Title": "lousy camera", "Author": "captoverkill", "ReviewID": "R3BD6XUO4VJIYT", "Overall": "1.0", "Content": "purchased Canon camera, case, extra batteries, memory card, etc.  Takes an okay photo, BUT is VERY confusing to use. Booklet does NOT give total instructions, made a manual from PDF file and it still does not help a lot. Had a very difficult time with downloading photos, etc. to the point that I simply trashed the whole setup!!!!!!  Wife dug it out of garbage and wants it now. Told her go for it, BUT if I see it laying around my sledge will make short work of it! VERY, VERY unsatisfied with this product and will NEVER purchase Canon again.", "Date": "May 24, 2013"}, {"Title": "Blurry Pictures and Messed Up Colors", "Author": "Eroslykos", "ReviewID": "RYN5XVH4HJZOB", "Overall": "1.0", "Content": "I bought this camera to take pictures of my daughter. I went outsife to try it out on some plants. My azeleas looked nothing like the colors that were being displayed on the camera. The camera made them washed out. So I tried taking more pictures closer to sunset. Those pics looked great on the LCD screen. When I got to my computer, all of the pictures were blurry. I had used several shooting modes. This was a huge dissapointment, so I instantly returned the camera.My advice: go with a different camera.", "Date": "April 24, 2013"}, {"Title": "Shouldn't it take better photos than the 12.1 MP Canon PowerShot?", "Author": "H. Salem", "ReviewID": "R1WX5K651QQWWE", "Overall": "2.0", "Content": "I bought the Canon Powershot A2400 IS 16.0 MP Camera because I needed a new camera and really liked the last Canon I owned.  I washed my Canon Powershot 12.1 MP and it stopped working.  I was shocked by the quality difference and not in a good way.  I expected a higher quality camera.  This camera is not only slower, but the picture quality is worse.  I adjusted the resolution and it is still not producing the same quality of photos.  The camera does take similar quality videos, however, with about the same level of sound.  I would have given my last canon 4 stars.", "Date": "June 3, 2012"}, {"Title": "much worse than my previous 5 MP camera", "Author": "Martha \"marthal96\"", "ReviewID": "R2BMI6QJJVH1ZB", "Overall": "1.0", "Content": "I've tried to get this camera to work for me, but the pictures are fuzzy and it is slow to take any so I'm missing my 3 yr old grandson's special moments and they can't be replaced.  Almost all the pictures are fuzzy or off color. Also all videos, when played back are in 10x speed for some reason.  That's from the start without me changing any settings. My previous Canon 5 MP camera is still far better than this one.  Wish I'd never bought this one and can't be more disappointed with Canon.  Note: Amazon doesn't give you very long to complain about this camera.  You have about a month to return it and it better be in perfect condition.  If not, you can only get 50% of your money back and will have to pay shipping, too.  I feel cheated by Amazon, after reading their return policy.", "Date": "August 9, 2012"}, {"Title": "so-so camera, not all that impressed, soft focus, defective?", "Author": "Grants Book Trade", "ReviewID": "R153D7GHLBHI1A", "Overall": "1.0", "Content": "I was hoping for better pics with this camera, images are soft, not sharp focus. Video quality is quite good. Menus & options are clunky and not logical.I'd send it back, but I'm tired of shopping.Took 12 days to get this camera, package weighed 1 lb, was sent slowest method possible by UPS. why not send Priority mail USPS???? Save yourself the time & trouble & wait, go to Walmart for about the same price for point & shoot cameras.  This seller did not provide tracking info. Amazon didn't provide tracking info.Follow up:I found the perfect size case by Kensignton at Goodwill for $1.99 MANIFEST IT!", "Date": "July 12, 2012"}, {"Title": "Broke instantly after being dropped", "Author": "Carrie Milnes", "ReviewID": "R3291438502QK2", "Overall": "1.0", "Content": "Pretty unhappy with this purchase, as my teenager opened it as a gift, promptly dropped it within a few days, and it doesn't work any more.", "Date": "January 16, 2013"}, {"Title": "Lovely looking camera", "Author": "Michelle", "ReviewID": "RWJUJU8RVWAQ5", "Overall": "4.0", "Content": "The camera looks great, but I give it 4 stars because I used an old memory chip I had. There were about 10 pictures on the chip, so I erased them, but after taking only 3 pictures on the camera, it said my memory card was full. I'm not sure if it's the camera's fault of the chips fault, but I've ordered another chip so we shall see. Other than that, it's a beautiful camera and it arrived promptly.", "Date": "April 12, 2012"}], "ProductInfo": {"Price": "$149.00", "Features": "2.7-inch TFT LCD display\n16.0 MP Image Sensor, DIGIC 4 Image Processor, 5x Optical Zoom, 28mm Wide-Angle lens.720p HD video recording with a dedicated movie button; Smart AUTO with 32 predefined shooting situations\nIntelligent IS with six modes to optimize image stabilization\nHelp Button provides simple explanations and easy controls of your settings\nSmart AUTO intelligently selects the proper camera settings based on 32 predefined shooting situations for capturing spectacular images with ease.\n16.0 MP Image Sensor, DIGIC 4 Image Processor, 5x Optical Zoom, 28mm Wide-Angle lens\n720p HD video recording with a dedicated movie button\nSmart AUTO with 32 predefined shooting situations\nIntelligent IS with six modes to optimize image stabilization\nHelp Button provides simple explanations and easy controls of your settings", "Name": "Canon PowerShot A2400 IS 16.0 MP Digital Camera with 5x Optical Image Stabilized Zoom 28mm Wide-Angle Lens with 720p Full HD Video Recording and 2.7-Inch LCD (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51oFJFQ2z1L._SY300_.jpg", "ProductID": "B0075SUHA8"}}