{"Reviews": [{"Title": "Wish I could give it 4.5 stars. After UPDATING TO FIRMWARE 1.10 I'm pleased with my purchase", "Author": "John Hunter", "ReviewID": "R2W37IWPPNZ8VN", "Overall": "5.0", "Content": "First off, if you want an extensive review of this camera go to cnet or dpreview.  That's where I went to do my research when I decided to buy an dSLR. Upon doing my research I decided on a mirrorless interchangeable lens system camera. I always purchased Canon cameras, but they're kind of late to this party since they're just now releasing their first mirrorless camera. I narrowed my decision down to the NX210 versus the Sony NEX-5r that is coming out in October. I believe these models stand out because of their Wi-Fi connection and ability to use your cell phone as a remote viewfinder. Ultimately I chose the Samsung because I was able to get a free 50 - 200 mm lens making it several hundred dollars cheaper than the Sony.I've had the camera for about a week now and have been satisfied with the image quality, flash coverage, manual options/controls, etc. The panoramic function is excellent and I believe that I will use it a fair amount in the future. The worst part of the camera was the Wi-Fi connection... It continually disconnected hampering the ability to use my smartphone as a viewfinder, and transferring pictures to my smartphone or computer. It just didn't work! I was contemplating returning the camera but today I went on Samsung's website and they just released firmware update 1.10 yesterday. I downloaded and installed the firmware and the Wi-Fi now functions flawlessly! IF YOU PURCHASE THIS CAMERA MAKE SURE YOU HAVE FIRMWARE 1.10 OR HIGHER. IF NOT, INSTALL IT! With the new firmware, this is a 4.5 star camera. The focusing system is not perfect and gets worse in lower light conditions. It's much better than on my previous camera (Canon SX 20), and it's probably one of the best focusing systems out there. If I had it to do over again I would've chosen this camera and I would have no problems recommending it to family and friends.UPDATE...Samsung has released firmware 01.11 and Wi-Fi connections are even more stable.  Samsung also eliminated a bug that would lock up the camera until the battery was removed.  Kudos to manufactures that continue to improve and tweak their products, even after you've surrendered your money to them.  I'm still thrilled with the picture quality and features this camera offers.  Focusing continues to be average but acceptable; maybe a future firmware upgrade will improve the accuracy and speed of the system.  I've convinced a few friends to consider an EVIL (electronic viewfinder interchangeable lens) camera such as the NX210 instead of a dSLR for their next upgrade.", "Date": "September 18, 2012"}, {"Title": "Good Camera - Pleased so far", "Author": "MICHAEL EDWARD ST LAURENT", "ReviewID": "R1A59TN7XNVLK7", "Overall": "4.0", "Content": "I purchased this camera to replace a point and shoot canon model that is about 3 years old.  My wife was always complaining about blurry pictures of our children with the old canon.  I'm not an expert photographer, but I am tech savy.  I settled on this camera over the Sony NX series because I felt the Samsung models had more features for the money.First appearances, the camera body is very slim and appears well built.  The display is awesome and seems to accurately represent the picture.  The lens adds considerable size to the camera and actually throws it off balance in my opinion.I had concerns about the external flash (the old camera always required a flash inside) but I quickly realized that I could take pictures indoors without a flash with this camera.I've only used the jpg output format with a class 10 SD card.  The smart mode is nice, as well as the i function.  I've been very pleased with the quality of pictures the automatic modes produce.  The autofocus is pretty quick.  I was able to snap clear pictures of my child swinging in a swing at a good pace.I've messed with most of the wireless settings, and my opinion is that these features are not completely polished and feel like first generation releases.The automatic backup works as advertised; you just have to install some software on your pc.The \"cloud\" MS SkyDrive mode didn't seem to work at all for me.  After 2 attempts of waiting over 1 minute for the camera to do something I got bored and moved on.The email function works, but resizes the picture.The mobile view finder was sort of a disappointment.  The feature works, but the camera seems to be in a limited mode.  No burst shots, cannot focus on a subject with the phone, etc.  All in all it works, but I just expected more.The mobile link works well BUT the mobile link app locks up after transfer (Android Galaxy S3) and force closes.  Not a huge deal as the files transfer without issue.All in all, this camera takes awesome pictures, is a joy to use (the onscreen tips are great), and I am very happy with my purchase.  I really like the i-function on the lens as it gives you more control than the smart mode, but it still is mostly automatic for shutter/aperture settings.  I think the wireless features could use a little work, but they work and bring functionality to the camera.  I've even heard my wife say she loves this camera (previously it was I hate this piece of s*** camera)Also, I've done 1 firmware update to the camera, no issues there -- went smoothly.UPDATE.I've had the camera for a couple months now.  I am still VERY pleased with the camera overall. I will also say that my phone does NOT lock up after using mobile link IF you close the app on the phone before changing the function on the camera.", "Date": "December 4, 2012"}, {"Title": "Understand what Gray Market means before buying (grey market)", "Author": "Molly M.", "ReviewID": "R3AOGHY5VARJT5", "Overall": "2.0", "Content": "First off the camera is fine, there is plenty written about it and I won't go into that here.  That is not the reason for the two star review.I bought this through Electronics Basket \"fulfilled by\" Amazon.  The listing certainly leads one to believe that you will receive a new camera sealed in a box just like anything else you buy.  Well that's just not the case.  I received the camera in a reasonable time but the seals on the box were broken.  Everything was intact inside along with a couple extra items I wasn't expecting.  One was a user manual in Arabic and some type of foreign power plug.  The packaging appeared quite worn, so I've really got no way of knowing if this is a new camera, factory return/refurbishment, display model, or something else.I did a little research and it started making more sense.  You order this and they have it shipped in from some other country and then ship it to the customer.  Probably why the price is so much better than list.  Obviously they would have to open it to put the correct power cables and manuals in the box. That's called a grey market item.  The downside is that Samsung may or may not honor the warranty, and who really knows where it came from.A little more research and I've found that this is not at all uncommon.  From what I've read it's especially bad among cameras, and I'm not sure you can buy a genuine US market camera on Amazon.  I personally don't have anything against gray market electronics, but I think it should be disclosed.  You put out that kind of money for something it should arrive in a factory sealed box.  I've been a long time Amazon shopper, buying many expensive electronic items and never had a bad experience; but this leaves a bad taste in my mouth.", "Date": "November 1, 2013"}, {"Title": "A great little camera when I feel like leaving my full size DSLR at home...", "Author": "Amazon Customer", "ReviewID": "R2QQSKK7FFPZGU", "Overall": "4.0", "Content": "My regular, full-size DSLR is a Canon 5D Mark III and weighs a ton once I've added a lens and battery grip. Plus, it's overkill for most things where I'm just shooting for my personal memories or if I'm on vacation and don't want to bring $6000+ worth of gear with me. That's where this little Samsung NX 210 comes in. It is not so small that I can put it in my pocket (that's what my tiny point and shoot is for) but compared to the 5D, it's super light and hangs comfortably around my neck and allows me all the manual controls that I could possibly want. The kit lens produces remarkably sharp pictures through the corners and color and clarity is quite good. I don't notice much chromatic aberration, but trust Lightroom's lens profiles to fix it if I have any issues. Like I said, I use this camera for personal stuff, not professional.PROS:- very light and small- decent quality of the kit lens (the 18-55)- image stabilization- the NX 210 has an additional scroll wheel on the top of the camera making it easy to change settings. I find this more familiar, like my 5D and makes it much faster to make adjustments- my #1 requirement was the ability to easily move the focus point like I can do with a DSLR - and you can do it quite easily with this camera - just click the OK button in the center of the buttons.- panoramic mode works well- came with a lens hood- came with a pop-up flash- shoots in RAW, even can be set to shoot a simultaneous RAW + JPEG so can be quickly emailed without having to go into Lightroom if I am running short on timeCONS- produces very noisy images above 1600 ISO (this camera IMO is best used with lots of available light or on a tripod)- ergonomically leaves something to be desired - specifically I wish the thumb spot was located where they've stuck the video record button- not that great for taking indoor pictures in a dark-ish room... even thought ISO can go up to 12,800 I would never go higher than 3200 with this camera - If you can't let that much natural light into the room, you'll definitely want to use the flashI definitely think the Pros outweigh the Cons here and I feel like this is a great little camera to add to my collection, when I want some manual controls but don't want to deal with a full size DSLR.", "Date": "October 19, 2013"}, {"Title": "Samsung NX210", "Author": "Warphantom", "ReviewID": "R2E87KUZ3IL7GP", "Overall": "5.0", "Content": "Recently purchased the SamsungNX 210 20.3MP Digital Camera because the price had dramatically dropped $400.00 dollars. I have been playing with the camera about a week now to familiarize myself with all the nifty functions available on the camera. The screen display is great and easy viewing; the camera zoom is also sweet; the camera freezes objects in motion for a nice crisp photo; the included flash is a welcome item (I keep the flash mounted but it is turned off in the down position); the camera comes with some preselected filters and photo magic software preinstalled; the battery took a reasonable 3hours to charge (however, if a faster charge time is required there is a quick charger available as an additional purchase); the wifi function to email works great, is quick and easy to establish. These are just a few features that stand out. Overall, I am extremely happy with my purchase and do not have a negative comment regarding the SamsungNX 210.", "Date": "March 30, 2013"}, {"Title": "Needs updated software", "Author": "psf", "ReviewID": "R36CW97D8TMCNH", "Overall": "3.0", "Content": "Camera came with firmware 1.11 which is out of date and needs to be upgraded to 2.11 to improve wireless performance.  Unfortunately, if you have a computer running OS or Windows 8/8.1 you are out of luck.  Also, the camera software is somewhat jittery especially in the \"Smart\" mode.  Samsung should get its act together and do a better job with software.", "Date": "December 28, 2013"}, {"Title": "It weighs nothing.", "Author": "L. Freel", "ReviewID": "R1BI2NK7SMAWXN", "Overall": "4.0", "Content": "This little gem is my first advanced mirror-less camera.  It's really a lot of fun to use and the iFn button on the lens works great to access the f stop, ISO etc.  I have the 18-55mm OIS lens which I would expect weighs more than the camera, but I don't know for sure.Pros:  Very light weight.  Good AMOLED screen resolution and brightness.  Came with the latest version 1.11 firmware.  The live histogram is very handy.Cons:  Can't transfer RAW files via wireless, what's up with that?  It's nearly all I shoot.Slow write time to the SD card, several seconds to transfer a shot shooting RAW. I'm using a 400x Lexar 32Gig card.Does not support iPhones only Android OS's for wireless shooting. Makes sense as they make phones with the Android OS.A highlight control menu option when selected limits the lowest ISO to 200, otherwise 100 is the norm.Random \"wallpaper\" images flash across the led screen seemingly just before the shutter is released.Can't comment on the video, not really interested in it but eventually I will check it out.I'll be taking it to San Miguel de Allende, Mexico for 20 days next month and put it to the test so I'll report back.Edit: It's not possible to upload a RAW file to the internet.  This is new to me and apparently industry wide.  I'll have to convert them to JPG or TIFF then upload.Second Edit: Just wondering how to update the firmware. Mine came with version 1.11 and now there is 1.12. I've had no luck trying to connect the camera to the PC and have Samsung's own software Intel-studio recognize it. Two PC's Win 7 and Win 8 respond the same. A window pops up telling me this model is not supported.  Also on their site there is no option to select \"cameras\" in their categories for e-mail. This is really frustrating.After a couple of days of shooting here South of the border the bothersome \"PASM\" wallpaper keeps sending itself across the screen at the least opportune times, just before shutter press.  This along with the inability to upgrade the firmware may force a return, we'll see. I reduced the star rating to two from four for the frustration factor.  More shots lost with flying wallpapers at shutter press.  It delays the shutter several seconds until they decide to clear.Update 10/29/2013  It's on it's way back for a warranty fix.  Their web site is a nightmare for filing a claim, (three attempts).  I'm hoping a fix will be to have the \"Intelli-Studio\" recognize the camera and fix it with a firmware upgrade, we'll see.  Stay tuned.Update 11/16/2013 Received it back today minus my lens!  It's listed on the repair ticket but no lens! The 800 line said to wait until tomorrow until someone can look for my lens..... on Sunday?  we'll see.On a lighter note it appears to be fixed with my 11-16mm Tokina lens on an adapter of course.  All manual settings set up and it seems to be functional.Update 11/21/2013  I finally chased the lens down to UPS holding it at my earlier request where both the lens and camera should have been held. A double snafu, one by the repair facility in NJ and second by UPS.  It was shipped back with 2 tracking numbers, one of which they told me about.  Not very nice of them.The camera finally appears to be in good working order after all of this frustration.I've upgraded the camera itself to 4 stars and the repair facility to a 2.Okay it's 5 0'clock somewhere.", "Date": "September 8, 2013"}, {"Title": "Very sophisticated, yet simple", "Author": "PaganPrincess", "ReviewID": "R3E206CG5YMKBR", "Overall": "5.0", "Content": "Not a photographer here. I wanted to have one camera with true HD video capability. Still working out all the intricacies with this camera but with the pictures and the written detail I am finding it easy to use. A camera with wifi? Who knew! Send pics to your TV screen, wow. I saw this camera for sale for $200 more elsewhere so you can not beat the price...", "Date": "March 28, 2013"}, {"Title": "Samung NX210 review", "Author": "Kennard Rolle-Whyms", "ReviewID": "R2WJYCV020I289", "Overall": "4.0", "Content": "I purchased the Samsung camera due to its price and technical specifations. I was very impressed on the overall build and image quality of the camera. Yes it is a plastic camera; however, it has a very solid feel to it as for image quality the JPEGS are excellent. Overall the NX210 is an excellent upgrade from a point and shoot.", "Date": "October 2, 2013"}, {"Title": "icon labeling wears off", "Author": "Amazon Customer \"MrsBrady\"", "ReviewID": "R8V1WBPF0XF0P", "Overall": "3.0", "Content": "Purchased this camera about a month ago. Very happy with the performance, ease of use, weight, ease of changing the lenses.  The battery life is VERY short when you use the zoom, found that out while we were in the rain forest in Costa Rica. We have since bought 2 extra batteries because of this. Also the white labeling has worn off mostly all the buttons on the back. Even the wheel has started to wear off. Very disappointing.  Bought it 3rd party so we can't exchange it. We will be returning it for a refund", "Date": "May 6, 2013"}, {"Title": "a good choice", "Author": "Zhitao", "ReviewID": "RAR9ZD9XYMFRV", "Overall": "5.0", "Content": "reasonable price, good use experience. And it helps me through a happy vacation. I can not find another better choice.", "Date": "September 5, 2013"}, {"Title": "not functional", "Author": "Neal A Gordon", "ReviewID": "R35UUDVRF70EGI", "Overall": "2.0", "Content": "I received my camera and it would lock up after intermittent use, even without a memory card. I tried updating the firmware but it would not let me.I liked the camera when it worked, but just decided to return it instead of having it repaired.", "Date": "May 28, 2013"}], "ProductInfo": {"Price": "$899.99", "Features": "20.3MP CMOS Sensor\nShutter Speeds 1/4000sec to ~30sec\nISO 100 to 12,800\n1080 30p Full HD Movie Recording\nElectronic View Finder Provides Photographers with a True Window into Reality", "Name": "Samsung NX210 Kit 20.3-megapixel Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51rxBgT5XvL._SX300_.jpg", "ProductID": "B007XJGZLE"}}