{"Reviews": [{"Title": "Overpriced, underfunctional.", "Author": "tmtowtdi", "ReviewID": "R694M6MVG7CMZ", "Overall": "2.0", "Content": "Needed a simple camera with a flash that I could use in poor light conditions. This camera does that, which is what makes the second star possible.I have owned other Vivitar products in the past, and this company has a poor history of paying attention to detail,  and appears to do virtually zero product testing before releasing new products.For example, their AVI format isn't to spec. mplayer won't read it. The USB connector doesn't make the flash accessible as a plain flash drive, it requires their proprietary software to get access to your data. (which is terrible) If you use Linux, look elsewhere.Picture quality is pretty bad, but I wasn't expecting much. (used Vivitar before) There is an aperature switch on the side for panorama or detail selection. No lense to focus. Sofware user interface is klunky. Plastic digital screen scratches easy.Typical Hong Kong garbage. Totally not worth the price.", "Date": "June 7, 2012"}, {"Title": "Its an okay camera", "Author": "H. Williams \"Holly\"", "ReviewID": "RH3FVROL0DF5R", "Overall": "3.0", "Content": "I own one of these. It is an okay digital camera but it doesn't take the greatest pictures. Sometimes the pictures are kind of blurry and not sharp enough. Also, I think its supposed to have an anti-shake feature but I am not sure how well that works. I like the fact that this camera can record videos with sound. The videos are of fairly good quality.", "Date": "August 8, 2013"}, {"Title": "DO NOT pay more than $20 for one of these in ANY condition", "Author": "Justin La Plante", "ReviewID": "R2YSNDEJ0ZRFDC", "Overall": "2.0", "Content": "This is not truly a digital camera.  It seems to be more of a VGA camera with a cheap processor that makes the jpeg files extra big and detailed but there really isn't much depth to the images.  Paying any more than $20 for one of these would just be stupid.  It is good enough for just a knock off digital cam you can snap some cheap photos with but offers nothing for a serious photographer.", "Date": "March 22, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "4x Digital Zoom\n10.1 Mega Pixels, 180 Degree Swivel Display\n1.8\" Preview Screen", "Name": "ViviCam X014N 10.1MP Digital Camera (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/31JOV-lUTxL.jpg", "ProductID": "B007UPHJ9S"}}