{"Reviews": [{"Title": "very nice setup", "Author": "chianti136", "ReviewID": "R30ERZDNP3QP6W", "Overall": "5.0", "Content": "Camera and lenses are amazing for money spent.  I bought this for my husband who is very familiar with photography and he is thrilled. Tripod and flash are good quality.", "Date": "July 3, 2013"}, {"Title": "Nice!", "Author": "emel camargo", "ReviewID": "R1B6A9SEX9TF89", "Overall": "5.0", "Content": "A dream that came true! Awesome product! The other lens is not nikon you just habe to take that into account.", "Date": "July 5, 2013"}, {"Title": "OMG!", "Author": "Alejandro E. Trimper \"aetrimper\"", "ReviewID": "RO0BBVJA7IMFC", "Overall": "5.0", "Content": "In love with everything about this bundle and can't say enough. It has everything you need to start up and go out to take some AMAZING photos. A++++++++++++++++++++", "Date": "October 12, 2013"}, {"Title": "the nikon camera is a good one!", "Author": "Brenda Mullen", "ReviewID": "R2FAG8QQHUEI7O", "Overall": "5.0", "Content": "its great....still learning all the stuff it can do. so far the pix have turned out really great. we are happy with this purchase.", "Date": "August 30, 2013"}, {"Title": "So exciting to get this package!", "Author": "Lisa Homestead", "ReviewID": "R2NH3ADQM9OS1S", "Overall": "5.0", "Content": "Amazing camera, lens, flash, tripod, 16gb sd card... there were so many extras with this purchase. I shopped around and this was truly the best deal. Thank you!!!!Love love love it!!", "Date": "July 30, 2013"}, {"Title": "like it", "Author": "Colleen Conklin \"Canon lover\"", "ReviewID": "R3MXP5LXV3V6T5", "Overall": "3.0", "Content": "I'm happy with camera. The 70-300 lens is a little bulky n heavy for my liking. Love the red though. Love having something no one else has.", "Date": "April 22, 2013"}, {"Title": "Nikon", "Author": "Shauna", "ReviewID": "R102F2WQZR4MOB", "Overall": "4.0", "Content": "Loved this item! Beautiful body and clean design. Only took a little while to figure out fully dont get me wrong im still learning new things everyday!", "Date": "March 19, 2013"}, {"Title": "Excellent product", "Author": "Rodrigo Claro", "ReviewID": "R2N4D6SB5OE2FR", "Overall": "5.0", "Content": "The package was delivered in time and everything arrived as expected.  Very good quality and fairly easy to use.  The bundle comes with everything necessary for a starter and the pictures it takes exceeds my expectations.", "Date": "May 29, 2014"}, {"Title": "Nikon D3200 Digital SLR & zoom lens.", "Author": "Nancy Isbill", "ReviewID": "R39HQD1574TNEL", "Overall": "5.0", "Content": "It was what I wanted, like the Warranty that came with it. I did not like the case it was to small, am living with it till I get a larger one.I haven't used it much, yet I do love it.", "Date": "May 19, 2014"}, {"Title": "Great camera for great price", "Author": "Amy C Lambert", "ReviewID": "R15KUZNF7WAGR6", "Overall": "5.0", "Content": "Love my new camera and what a great price!  Plus all the extras make this an even better deal.  I have taken over 500 pictures already", "Date": "May 14, 2014"}, {"Title": "One of the best purchases I have made", "Author": "Krystal", "ReviewID": "RUBK17DBF9UF4", "Overall": "5.0", "Content": "I love this product because it is easy to take with me. I like that it came with so many accessories and an extra lens. This is by far the best price for everything you get. We got a better deal here than through Costco. The battery charges quickly and lasts for a long time. I am impressed with the overall quality and ease of use of this product! The shipment did not originally arrive when expected however, was not due to the sellers fault. There was an issue between the Amazon tracking and FedEx tracking. The sellers contacted me and let me know what was happening and my shipment arrived exactly when they said it would. Sellers are very customer friendly.", "Date": "May 12, 2014"}, {"Title": "Happy Momma", "Author": "Gail Henke", "ReviewID": "R30ZOTLVZJ8UD2", "Overall": "5.0", "Content": "Love this camera.  I love photography and this camera allows me so many options.  I'm still learning but with all the tools at hand it should be easier.", "Date": "May 8, 2014"}, {"Title": "The Perfect Gift", "Author": "David E. Rothacker", "ReviewID": "RBNKN0XRBXU1C", "Overall": "5.0", "Content": "Bought this as a gift for our daughter's birthday. She loved it and couldn't believe how many items were in the package. The bundle wasn't eligible for Amazon prime and we had to pay $19.95 shipping however, the camera was delivered in the same amount of time as Amazon. Very satisfied with overall purchase- now our daughter just has to figure out how to use the camera and other items!", "Date": "May 3, 2014"}, {"Title": "Nice Camera", "Author": "Patricia Meeks", "ReviewID": "R276VLWOFPKXR9", "Overall": "5.0", "Content": "I gave this to my daughter for Christmas but wasn't sure if she would want a red camera, no need to worry she loved the color and the camera. All the accessories that came with it was great especially when your not sure what you need.", "Date": "February 18, 2014"}, {"Title": "Camera", "Author": "Gayle Glahn", "ReviewID": "R2YDMD15N101W6", "Overall": "4.0", "Content": "So far so good while using my new camera. With everything in the bundle, it is a great price. Still learning and trying to figure things out to adjust settings to get optimum color.", "Date": "July 3, 2013"}, {"Title": "Great Nikon Kit and Camera (of course)!!!", "Author": "Guiliana", "ReviewID": "R1KY5R6ESJHS0K", "Overall": "5.0", "Content": "I love this camera so far. The shipping was fast and the customer service was excellent. The kit came with everything I needed to start my personal camera accessories collection. I also love the unique color of the exterior as well.", "Date": "May 31, 2013"}, {"Title": "Came with more products than you could think you needed", "Author": "Matt Meehan", "ReviewID": "R342SCHYEHMT9Z", "Overall": "5.0", "Content": "Glad I went with this product bundle because it saved me time and money going out to buy more stuff that I would eventually need.  Only thing I need is a memory card with more space for all our new beautiful pics.", "Date": "January 9, 2014"}], "ProductInfo": {"Price": "$679.95", "Features": "KIT INCLUDES 12 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D3200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) + <2> Tamron 70-300mm Lens (Nikon) + <3> Transcend 16GB Class10 SD Card +\n<4> Nikon Digital SLR Camera Case + <5> ML-L3 Shutter Remote Control + <6> Precision Design DSLR300 Flash +\n<7> Vivitar 52mm UV Glass Filter + <8> Vivitar 62mm UV Glass Filter + <9> Precision Design 57\" Tripod +\n<10> PD 6pc Complete Cleaning Kit + <11> PD 8 SD Card Memory Card Case + <12> LCD Monitor Screen Protectors", "Name": "Nikon D3200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Red) with 70-300mm Lens + 16GB Card + Flash + Case + Filters + Remote + Tripod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51THwUyh8cL._SY300_.jpg", "ProductID": "B007X48SR8"}}