{"Reviews": [{"Title": "Great Underwater Digital Camera", "Author": "Sageduo", "ReviewID": "R2JX0SMSUL3QEV", "Overall": "5.0", "Content": "This rugged little camera takes great shots on land. I was skeptical about the underwater durability but it seems great so far. The pictures are typical of basic underwater shots without additional lighting. It was purchased for a vacation to the Caribbean to reduce luggage weight (instead of lugging my Canon T3i and lenses)and to avoid the expense of one-use underwater film cameras. I purchased the extra battery and a 32GB Class 10 SD card to accommodate videos and photos. The various settings are user friendly for anyone, even as a point & shoot. It boots super-fast and is pretty intuitive (though reading the manual is recommended). Many of the reviews I read or watched were pretty accurate and very helpful.", "Date": "May 16, 2012"}, {"Title": "Adequate but that's it", "Author": "Oscar Vasquez \"surfer\"", "ReviewID": "R2WXFWPIOTS7WI", "Overall": "3.0", "Content": "I bought to replace my lost Nikon Coolpix AW100 since I wanted to try something different.  Picture quality is good only in sunny conditions, in every other situation it takes a very bad dive, night shots have very noticeable grain; shaky pictures in low light are common, ghosty or just plain bad.  Nikon's was excellent most of the time under a wide variety of conditions.  As far as construction, this camera is not heavy.  When you are at sandy places like the beach, or deserts, or sand dunes of Utah, this camera gets lots of sand everywhere, I could not even open or close the battery compartment after just one afternoon ,... so much for a 'tough' camera.On the positive side, this camera can produce very detailed and fine close ups that are well lit.  Also, the remote shutter works adequately and combined with a tripod everyone will be in the picture, with no need to set self-timer and running towards your party.  Lens location in the center is a really good idea, no more fingers on your pictures!  Video quality is mediocre.  I feel this camera is overpriced overall in comparison to other waterproof cameras.", "Date": "August 31, 2012"}, {"Title": "Does not work in low light.", "Author": "Amanda Steele", "ReviewID": "R2ZOT1MCDBHASX", "Overall": "1.0", "Content": "I have tried many of the settings on this camera. but none seem to work in low light the only thing I found is to shoot video and pull images that way in low light.", "Date": "April 19, 2013"}, {"Title": "Not tough enough", "Author": "Ivan Z", "ReviewID": "R1HVKVCNH8I8XJ", "Overall": "4.0", "Content": "It is sturdy and have good image quality after you select ISO not beyond 800Screen is not scratch resistant, dissapointing in a product almost bulletproof", "Date": "June 27, 2012"}, {"Title": "Awesome camera.", "Author": "JoshuaJustin", "ReviewID": "R2OI6TEW70ZZ0S", "Overall": "5.0", "Content": "I bought this camera as a gift for my girlfriend and we used it on our cruise in the Caribbean. During the cruise we went zip lining, explored Aztec ruins, and even scuba dove while taking great pictures. If you're an adventurer and need a good heavy duty camera I would definitely recommend this one.", "Date": "February 18, 2013"}, {"Title": "Great \"Tuff\" Camera", "Author": "Pat Chapman", "ReviewID": "R3NTOETELBRAYM", "Overall": "4.0", "Content": "Quick to ship, item as described.I have reordered this camera over & over-stands up to many users & keeps on clicking...", "Date": "January 1, 2013"}, {"Title": "Pentax wg2", "Author": "Pen Name", "ReviewID": "R2R1UZS0AIPPJD", "Overall": "5.0", "Content": "Awesome camera!! Great video underwater!! The clip it comes with is awesome to place anywhere, I used it while zip lining. Very durable , has many settings, shooting modes. Love my purchase.", "Date": "July 26, 2012"}, {"Title": "Great quality!", "Author": "Susie Yoder", "ReviewID": "RFJX2YR0F2M86", "Overall": "5.0", "Content": "I am most impressed with the underwater and micro shots, but I love everything about this camera. I don't have to worry about sand destroying the mechinisms, nor do I worry much if I accidently bump or fumble with it. This is the coolest thing I own.", "Date": "December 17, 2012"}, {"Title": "Pentax WG-II", "Author": "kheath17", "ReviewID": "R7F8OI4IHSZYT", "Overall": "4.0", "Content": "Just bought the Pentax WG-II for my trip to Hawaii, I wanted a camera that would do it all, hiking, kayaking, zip lines, and underwater. I only gave this a 4 because I haven't used the camera enough to get all my pictures to look the way I want them. This camera is rugged and water proof and very easy to use. My wife owns the WG-I, get the WG-II it has a bigger screen and more mega pixels. So far I'm very happy with the camera.", "Date": "October 8, 2012"}, {"Title": "excellent", "Author": "FG", "ReviewID": "R1E5XY31Z9L9GM", "Overall": "5.0", "Content": "I really like this product, the brand is excellent, I recommend it. Would you purchase this item. good price and quality", "Date": "January 15, 2014"}, {"Title": "It leaks", "Author": "Donald Hartsaw", "ReviewID": "R30MBVCLT3LVQJ", "Overall": "1.0", "Content": "If you only use it in a dry area, it's great. But once you submerge it even in 6 inches of water it leaked. After about 15 minutes it died!!  I do not suggest this item to anyone unless you just want to throw away your money. I sent it back and received a full refund and used my refund to purchase a better water proof camera for just a little over half the price I paid for this one that leaked.", "Date": "December 21, 2013"}, {"Title": "Rugged, tough, and well worth it.", "Author": "S. Clemens \"ak fisher\"", "ReviewID": "R9890BJN4QF0R", "Overall": "4.0", "Content": "I LOVE this camera.  I am a professional photographer and a commercial dive harvester and have only recently begun playing with underwater photography.  I bought this to play with on a trip to Hawaii, and it was SO MUCH FUN.  It is rugged, and I have not yet had any problems with leakage at ALL, even after spending MANY consecutive hours snorkelling.  The battery life in cold Alaskan waters where I live and dive is marginal, but such is the case with cold temperatures and batteries.  I love my DSLR but this is a super fun point and shoot and it is really great to be able to use it in all weather conditions and underwater.  I recently accidentally took it down to 70' on a dive, and 50'+ on another dive and it was submerged to below its 40' rating for 20-30 minutes.  It still works.  not that I would recommend doing it all the time, but it still works.  At 70' I was unable to use any of the buttons as the pressure was too much and they wouldn't work, but I was still able to take pictures!I would like to see the depth rating increase on future versions, but I love this little camera.  I can't decide whether or not to give it 5 stars, but it really is a good buy!", "Date": "November 21, 2013"}, {"Title": "Great Camera", "Author": "Wendy S.", "ReviewID": "R3S4B00FUQIOO0", "Overall": "5.0", "Content": "I can't express how much I love this camera.  I bought it right before our trip to St. Maarten and I'm so glad I did.  It's so easy to use.  It takes really good underwater pictures and movies.  I love that we can take it in the ocean, pool, or waterpark.  I was tired of never having any beach and waterpark pictures because of the camera being in a locker somewhere.  I bought a floating wrist strap for it and wear it in the water all the time.  This is one of the best purchases I've ever made.", "Date": "November 18, 2013"}, {"Title": "Great Camera and Great Buy", "Author": "Robert And Mari Pearson", "ReviewID": "R12W02Q29TE3P2", "Overall": "5.0", "Content": "Have wanted one of these camera since saw them on a cruise.. Finally got it and worth the wait! Great for diving and rock climbing and anything in the middle.. If the Camera is what you want without all the bells and whisles this is it!!!", "Date": "October 21, 2013"}, {"Title": "GREAT PHOTOS!!!", "Author": "Lora", "ReviewID": "R18DUP16TW8CV5", "Overall": "5.0", "Content": "This is the best camera.  It was perfect at the beach because the sand didn't get caught in the lens and took great water photos.  Rented wave runners and used the clip to clip onto the vest and took it with us.  Even the guy who rented the wave runners to us asked about it and wanted to get one.  Also took to Universal Studios and it was small enough to not get in the way and It was going to rain that day and I would have never taken my larger camera with me and would have lost out on the opportunity to take photos that day but I didn't have to worry about the rain with this camera and took it with me and I have to say the photos were as good as my other camera which cost 3x more!!  I now find myself grabbing for this camera more than the other one.", "Date": "July 10, 2013"}, {"Title": "Perfect for Kids!", "Author": "Katiebug", "ReviewID": "R1O65QS5YIZ3DQ", "Overall": "4.0", "Content": "I bought this camera after reading the reviews on it in Parents magazine, which highly recommended it for people with kids.  My daughter is 7 months old and we have captured some priceless pictures of her with this great camera.Pros:  light weight, durable, video with slow motion play back (awesome), self-assist and smile capture option (great for family selfies), long lasting battery, memory (limited) without SD card, great zoom, numerous photo settings, attached caribeener a good idea.Cons:  pictures in low light work best on the kids settings (but not great), the yellow filter is poor (we have light/soft yellow walls in the house and out pictures inside don't look good if the walls are prominent), no lense cover (I am afraid the lense will get scratched), slightly to long so it doesn't fit in your pocket, caribeener itself is weak, on/off button and take the picture button are too close together and similar in size that sometimes you accidentaly turn it off.Overall though- we love it and for a small, on the go camera for families it is great.  Probably also good for the outdoor adventure type since it's tough and waterproof.  Enjoy!", "Date": "June 26, 2013"}, {"Title": "Worked great underwater, very good pictures.", "Author": "jim's travels", "ReviewID": "RQDJWR0QM002F", "Overall": "5.0", "Content": "I bought this camera for our trip to the Great Barrier Reef in Cairns. I used it twice underwater for two hours each time. The photos were excellent.We have a Canon camera which we use for our trips. It is very good in dark places like churches and museums. However, it is very sensitive to humidity or any sort of dampness. Cairns is in a rainforest and it rained every day for two weeks. So, we used the Pentax every day. It took great everyday photos.When I bought the camera, I thought of it as something to use only in wet conditions. I now see it as an everyday camera. I also like that I do not have to worry about dropping it or banging it around. I like the looks and feel and have it with me all the time when we travel.", "Date": "May 17, 2013"}, {"Title": "Nice durable duty camera", "Author": "C. Amemiya", "ReviewID": "R32MJH9ZI2643W", "Overall": "5.0", "Content": "I can take it for work and out to play. Lots of features. I havent taken it under water yet though.", "Date": "March 13, 2013"}, {"Title": "Pentax Optio WG-2 Digital Camera", "Author": "Jerry", "ReviewID": "R1TY1LZK39L5QR", "Overall": "5.0", "Content": "Amazing camera!! I have used it both under water for pictures and video, the zoom is just unreal and the focus is still crystal clear. Battery live isn't great in video mode, so I got the extra battery.", "Date": "March 9, 2013"}, {"Title": "Pentax Camera Review", "Author": "Review", "ReviewID": "RFGLE6XYCSUP8", "Overall": "5.0", "Content": "This camera has worked great since I got it. I took it on my last fishing trip and it performed without any issues.  Its super rugged, durable and takes great pictures.", "Date": "July 11, 2012"}, {"Title": "LOVE LOVE LOVE LOVE", "Author": "L Shinault", "ReviewID": "R33D0IMGAK4WK9", "Overall": "5.0", "Content": "I think I have talked a few friends into purchasing this camera.  It takes amazing pictures. I especially love the \"microscope\" setting.  The detail is awesome.  I bought the accessory kit to go with it - which is really important because it comes with a floating strap that makes it great for use in the pool.", "Date": "July 11, 2012"}, {"Title": "great camera", "Author": "JustPlainOldCliff \"Cliff\"", "ReviewID": "R3768ELLB4CWPK", "Overall": "5.0", "Content": "As a kayak fisherman I heartily endorse this camera. I have used it afloat and submerged in streams, rivers, lakes, pools and surf. Once, it suffered an annoying bout of blank display while shooting video (still captured, just had to \"shoot in the dark\") but this was at the end of a hot day fishing and capturing an hour or more of HD video. This day required use of my extra battery and the majority of my 64Gb SDXC upgrade. After a rest and reset it has been working well. The macro feature encourages my penchant for photographing insects and flowers. The slo-mo feature looks interesting for on-cam playback but I haven't tried any of those clips yet on my computer. I don't care for the Pentax gallery software. I see it as another needless learning curve as far as still images are concerned. It may be key to the slo-mo clips.", "Date": "January 11, 2013"}, {"Title": "amazing", "Author": "bruno", "ReviewID": "R3PYPOL4XGLTF2", "Overall": "5.0", "Content": "It came before I expected and the camera has no damage at all, I've really enjoyed, no problems at all, works fine", "Date": "December 27, 2012"}, {"Title": "Great Shots", "Author": "JC Wenzlick", "ReviewID": "R1XZ9IWR3K2WY", "Overall": "5.0", "Content": "I'm still playing with the many options and setting on this camera but the shots so far are beautiful.  The macro settings take amazing close up shots and the fact it's impact resistant and water proof is an added bonus.  I still have to submerge it.", "Date": "May 14, 2012"}, {"Title": "Great Camera", "Author": "Failtelorn", "ReviewID": "R3RIHIJKIBQZKZ", "Overall": "5.0", "Content": "Just received my camera today on the 28th, having ordered on the 24th.  Not bad for having to bounce over the holiday delivery time.  Came with a battery and external charger, usb cable, strong strap with the carabiner, a small plastic piece that fits on the front of the camera for the macro shots, manuals and standard paperwork.  Took the battery about an hour and a half to fully charge.  Takes about 10 seconds to float through the setup menu and then the camera is ready to use.  The manual is VERY detailed and specific about every aspect, including how the various functions work together (or not).  The only negative I see is a lack of protection to the lens or the vew screen.  You'll definitely want to find some kind of small camera case to store this in and keep a lens cleaning cloth handy.", "Date": "December 28, 2012"}, {"Title": "This is a great all around camera", "Author": "paul e lawson Jr", "ReviewID": "R2PQX2471FV443", "Overall": "5.0", "Content": "Bought this camera to replace two earlier, different brands that I finally wore out. And I hope this camera will continue to be as good as it has been so far. Sharp,clear outdoor pictures, and good indoor family camera too. They should include a carry case, but something you can hang around your neck.", "Date": "December 9, 2012"}, {"Title": "Camara for adventure and travel", "Author": "David Brown  DAVE", "ReviewID": "RAVYOK6LFYNOM", "Overall": "4.0", "Content": "Just what I was looking for as a wonderful Christmas gift this season.Will look for more options during coming year.", "Date": "December 31, 2012"}, {"Title": "good", "Author": "mario", "ReviewID": "R15THV42SLBDQV", "Overall": "5.0", "Content": "this product is good，good look and good quality if you want to take it to travel it is a good choice", "Date": "August 7, 2012"}, {"Title": "Works well for me", "Author": "Tim", "ReviewID": "R20NTNHYTKA9OC", "Overall": "4.0", "Content": "I purchased this to replace an older Pentax that I had been using for about 4 years.  I use the cameras in industrial environments where they get filthy with dust and mud.  I normally wash the camera in the sink after each job.  This one has worked well so far.  I can only hope it lasts as well as the last one, which is still working.", "Date": "August 7, 2012"}, {"Title": "Burst not in scene selection, missed swimming action shots", "Author": "Confused at Work", "ReviewID": "R3FYYNBQXYIY7A", "Overall": "1.0", "Content": "UPDATE: While packing the camera up for return, I looked at the manual & found that it did have a burst feature - but it's not located in the scene selection like in other cameras we've used. You have to press the arrow up button to find it, along with the self-timer options too. What the heck? This is an important function for sports-related shots, it should be in the scene selections menu! Not having read the manual, boy do I feel dumb & was thinking of upping the * on this. However, the fact that all my other cameras did not require me to read the manual to use it made me keep the 1* review for it's unfriendliness to me personally.Plus my husband did not like that he had to fumble through the menu to change from camera to video record & vice versa. It was strangely difficult to stop video-recording, had to press the shutter several times. Response time is very poor, took a few seconds to be done writing before we can switch the menu back to camera & by that time, my kid was out of the pool. By the way, we use Class 10 SD Extreme Plus cards so it should be fast.ORIGINAL REVIEW:Bought this based on the ratio of favorable reviews on Amazon.Sadly disappointed. Miss every action shot of my son swimming in the state championships. I snapped as he is jumping off the board, got his feet sticking out of the water. Several snaps of him rising from the water of both breaststroke & butterfly, I get pics of bubbles. Tried to snap when he went under, the camera is so freakin' smart that it delays before taking the photo, here I am thinking it'll wait for my kid to show, nope! Water or feet!Oh, the photo quality is exceptional, but if my son is not in the picture, what is the point?! I don't need clear, quality shots of feet or bubbles. Tried several options, Auto, Basic Auto (not the intelligent one), moving kids, sports (description said follows object, uh, no it did not!), all to no avail. Continuous shot is a joke! The min time lapse between shots is 10 secs. I need a continuous burst! Another annoying thing was the face/smile detection. At first it was cool, but after changing to different shot types with unsuccessful results, & resulting to always having to remove it in vain hopes of capturing wanted shots, it was a pain.To prove the camera is the problem, not I, I was able to capture said breastroke & butterfly shots with my old iPhone 3gs! Provided it wasn't super quality like the camera, but there he was, rising from the water, beautiful form captured with poor MPs. Unfortunately, I forgot about the iPhone had a camera until the last 2 events :(Perhaps this camera is way too smart for me. I'm a very amateur photographer so all I want is a basic point-and-shoot waterproof camera that takes good shots quickly & easy to navigate menu selections. I don't know how to tinker with all the other complex settings & never changed them on my previous cameras. I really don't need waterproof, but I prefer it for the occasional spillage or dropping. My first waterproof camera was the Olympus SW1030, good pics, but very slow read/write. It died after less than an hour underwater in Mexico, but the underwater pics came out beautifully. Replacement was a Fuji XP10 that died as soon as it went underwater in Key Largo. Sent it back to Fuji, they sent me a refurbished one that actually held underwater during an accidental 10-minute submersion in raging muddy river currents. Unfortunately, practically every shot is not crisp, there's an unfocusness to it, even when the focus light went on before taking shots. Both previous cameras captured good action soccer shots so there is proof that I don't need those DSLR (?) chunky cameras. This Pentax was the third replacement. Sigh! The search continues...If you're looking for quality, planned pictures, this camera is great! For quick-action shots, skip this.", "Date": "January 28, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0078KP13Q"}}