{"Reviews": [{"Title": "Mac E", "Author": "Mac E", "ReviewID": "RQPEPXX5X9MZ4", "Overall": "2.0", "Content": "I have had Liquid Image products before and was an early adopter of this ego, thinking it was as good as the other products.  While I like the size, there are flaws.  IF you get one of the older ones you will find you will need to upgrade the firmware in order for it to record video longer then ~28 minutes.  Speaking of which, the video only records in ~29 minute chunks, so you are left with multiple files a little less then a half hour long. There is also a loss of a second or two between file switching.The other annoying thing is that the buttons are hard to push and there is a delay when trying to record after you turn it on, so you don't really know if it's on or not.  The supposed 2 hour battery life is about that or perhaps a little less.There are a lot of accessories to attach this camera to a mutlitude of things.  Just make sure you're willing to pay for those accessories.  I use mine on my bike and as a dash cam on my car.That brings me to my next point of the micro SD card.  I have found that even though it states 32gb class 6+ is compatibile, it's not true.  It will try to format it and just sit there until the battery runs out.  I've even tried to plug it in while it was formatting and 16 hours later I gave up.  I have contacted customer service a few times, with no reply on the issue.  It wasn't my micro sd card, as I have been using that in my other devices since it won't work in the ego.  I do have an 8gb that works well in the ego however, but I recommend a larger one, as it fills up quickly even on 720p video.All that said, I do like the field of view and the picture quality is great.  It captures a lot on such a little device.  It has it's bugs to work through and I would either try a different brand or wait until this device is the next gen.", "Date": "April 18, 2013"}, {"Title": "fantastic", "Author": "Jeremy Cherms", "ReviewID": "R1YHDG5HD66YU7", "Overall": "5.0", "Content": "Video is great! Takes countinues video in 30 min increments. Can turn off led in settings unlike another user said in their review. Small light weight. I get about 1 1/2-2 hours depending on 720p or 1080p. Mic on the camera which works pretty good but no mic port for an exterior mic. There are a few accessories for it like a waterproof case, handlebar mount and comes with the helmet mount. I would buy it again or recommend to a friend.", "Date": "February 20, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007R9WMVC"}}