{"Reviews": [{"Title": "Great Camera At An Affordable Price", "Author": "K. Abbas", "ReviewID": "R16VN49I1VA687", "Overall": "5.0", "Content": "Camera is compact and light weight. It has all the basic features you would need for great pictures and it is fairly easy to use. I was able to play with it for less than 5 minutes and have all the controls figured out without looking at a manual. The battery life seems great as I just got back from a week long vacation and after snapping over 150 photos I still have almost a full battery. I am also very impressed with how great my pictures turned out, vivid colors and great contrast.", "Date": "March 22, 2012"}, {"Title": "Great value for the price", "Author": "D. Thierry", "ReviewID": "R2J8LWG0WCIGOL", "Overall": "5.0", "Content": "I purchased this product as I planned a last-minute visit to the Niagara Falls and, being on a business trip, I had nothing else to immortalize this moment than my smartphone and its lousy camera. After unpacking it, I first tried it indoors and was not impressed at all: mediocre yellowish pictures, noisy and grainy. I tried to disable the (weak) flash and it got worse. I was tempted to return it immediately but decided to give it a try outdoors. When I started to shoot the falls, I became very quickly addicted to this litte gizmo. In most of the cases, the camera is able to deal with the subject, although I would recommend the usage of the advanced scene mode: facing violent contrasts, the camera shoots automatically twice with different exposure parameters, which increases the odds to get a good shot. Smart.The exposure can be easily fixed manually, using the \"manual\" mode (in fact, an automatic mode that can be adjusted). In a matter of seconds, over-exposed white water on dark rocks takes texture, to the droplet. It is a bit of trial and error, but delivers quick results. The panorama function works very well, delivery much better pictures than the lousy prints available in the souvenir shop. I also gave it a chance to show how it works with video: better than average sound (if not too much wind), functional and silent zoom and again, surprising image quality. As the light changed due to overcast clouds, I adjusted the settings and the camera obediently followed, again delivering satisfying stills. The zoom works fine. It's not a super-zoom but the resolution is good enough to enable enlargement on the PC.Happy with the outdoor quality, I decided to give it another try indoors, using the advanced mode P. To my surprise, the various settings, including several white balance modes, enabled to fix the initial issues and I got noise-free, decent-quality pictures under artificial lighting. I fumbled a bit with the flash and while I find it a bit rough, it's within expectations.Outdoor picture quality is really great for the price - I was really positively surprised by the sharpness and color quality, which is still far from SLR standards but surprising for a compact. The autofocus is decent, shutter speed good, transfer speed correct. The camera behaves predictably. It is more limited indoors but still very decent once one gets used to it. I was not disturbed by the lack of functionality to adjust speed or aperture as I'm using it for point-and-shoot, which it does pretty well in general. It's not a function-rich camera, but what's built in is useful and working well (the online manual may need some polishing though).I'm giving it five stars because this Sony camera exceeds consistently my value-for-money expectations. It cannot be a substitute for more serious hardware (I own a Sony Alpha and my wife is a NEX user) but it is definitively the camera I will take on business trips or in my breast pocket for a casual walk in the park.", "Date": "May 30, 2012"}, {"Title": "awesome!", "Author": "D. Nissenbaum \"DN\"", "ReviewID": "RA7BVGG39PH1B", "Overall": "4.0", "Content": "So the image quality isn't perfect- but it's pretty darn close (the only reason this camera got 4 stars instead of 5). I like taking pictures with it. The menu features are really easy to figure out, so it's no trouble changing the settings to my liking. My favorite part of the camera? the Panorama view- I think Sony was genius with that addition! Definitely worth the money- and Sony has a pretty good name in cameras so you know it's a good investment. Total bonus- I love that my camera is red- not just boring black or silver.", "Date": "March 3, 2012"}, {"Title": "Great camera", "Author": "JRM", "ReviewID": "RER33URRXUZQA", "Overall": "5.0", "Content": "This purchase was great. Sony always delivers amazing quality. The camera has some great features and is state of the art. The bundle is a nice deal price-wise; The memory card has more than enough capacity and the case is OK (It's not as nice as others, but it's good for keeping the camera safe). I recomend this product.", "Date": "June 21, 2012"}, {"Title": "Excellent camera", "Author": "Naidyna", "ReviewID": "R9WFLUXJUMV9T", "Overall": "5.0", "Content": "This a wonderful camera. Camera is compact and light weight. 16 megapixels. You will get a GREAT camera for a little over $100.Very easy to use, takes amazing pictures for the price and size. I would highly recommend anyone buying this camera. it takes video, and panoramic pictures. fast shipping.", "Date": "June 9, 2012"}, {"Title": "great pix, easy to change modes", "Author": "iris571", "ReviewID": "R3THKU248KG3DT", "Overall": "5.0", "Content": "This is one of the best cameras I have owned.  It takes wonderful pictures and videos.  Changing modes is as easy as sliding the button up or down.  I loved it so much that when my adult son asked for a camera for his birthday I didn't even have to shop, there was no doubt which one he was getting.  So we each have one and can not sing it's praises loud enough!", "Date": "May 22, 2012"}, {"Title": "Nifty Camera", "Author": "Crafty Lady", "ReviewID": "R195SOOO8NSX32", "Overall": "5.0", "Content": "This is a fantastic camera in it's price class. I was surprised by it's size ( as small as a cell phone ) but with that said, it packs alot of punch. Takes great pictures and is easy to operate. The only drawback is low light pictures aren't as sharp as could be. All in all you get alot for the money with this Sony,", "Date": "June 11, 2012"}, {"Title": "Terrible camera for taking pics of your kids or in low lighting", "Author": "L. Gottlieb", "ReviewID": "REC43FOQG7CWK", "Overall": "2.0", "Content": "I got this as a gift and it is the worst camera I've had in years. Almost all photos indoors take forever to shoot and its a long lag between taking shots. As a result, you will never get the picture of your child you were aiming for. I've missed more great shots with this camera than I can count. I've gone back to using my iPhone because its honestly a better camera for getting the right picture of my kids.If you will be taking pictures of statues in perfect sunlight, it's fine, but anything moving and without direct sunlight, this camera is pretty much a paperweight.", "Date": "April 10, 2013"}, {"Title": "Great camera !", "Author": "oldconsumer 47", "ReviewID": "RYOLBNKZV3TPW", "Overall": "5.0", "Content": "This is my second Sony in this series. Both have taken 1000s of photos. The first one I dropped (my fault) and broke the viewing screen. I like d the Sony so I got a newer updated version with equally great results. The only little thing is the on/off switch should have a little more of a bump on it so you can feel it and not have to hunt for it the press it.I give it a 99.99999999% rating. Buy one !", "Date": "January 2, 2013"}, {"Title": "Pocket perfect", "Author": "Mecca", "ReviewID": "RDP1PX62TUVXU", "Overall": "5.0", "Content": "Great deal in a small package flash on still shots is a bit over the top but for the price it's a great cam...", "Date": "May 18, 2012"}, {"Title": "Phenomenal for the Price", "Author": "Adam Dubberly", "ReviewID": "R1KQB5PYWZLFWQ", "Overall": "5.0", "Content": "Recently bought this camera for a Thanksgiving trip to Disney.  It worked great as just a tourist camera (taking pics of the family in front of rides, etc) but also got some great shots of the castles, fireworks, and light parades.  Also, the 16 megapixels makes beautiful pictures when printed.  For the cost this is an absolutely great buy.", "Date": "December 4, 2012"}, {"Title": "Very nice camera", "Author": "Gabriel R. Castillo \"Gabe\"", "ReviewID": "R2ECEC2G56T26H", "Overall": "5.0", "Content": "Purchased it for my wife's birthday - perfect little camera that she can take anywhere and fits into a small bag. Having the 16.1 captures and prints pictures nicely and we like the other point and shoot features.  Great camera for the price!", "Date": "July 26, 2012"}, {"Title": "Fantastic Deal", "Author": "ANJAN CHAKRABARTI", "ReviewID": "R1YZIYRTB76X75", "Overall": "5.0", "Content": "I bought this recently as a gift for a family member from Amazon. The is great point and shoot camera. It also came with a 8GB card & the camera case. It is a very good deal. The shipping as fast.", "Date": "July 13, 2012"}, {"Title": "limited capability and poor results", "Author": "Frederick E. Hutchings", "ReviewID": "R2DP5Q204BEKZO", "Overall": "2.0", "Content": "Even at this price, this camera is very disappointing. It is literally too automatic and makes terrible picture decisions.  There is no substantial means for user intervention to create better quality photos. When shooting indoors w/o flash, the ISO jumps to 800 and the pix are terrible. The camera lives at f:2.6, so any depth of field is next to impossible to achieve.And, why would anyone be interested in shooting video with a still camera that cannot deliver a quality still photograph is beyond me.  Video cameras shoot video, still cameras shoot still images. Who needs it?? And panorama?? Let's worry about decent stills first.This little camera has a Zeiss designed lens... You wouldn't know it looking at the pictures...  Infinity focus is just not there... At 16mp, 13x19\" prints are noisy and mushy at all ISO settings. At 10mp and ISO 80-100, results are a little better - tolerable maybe. 8/5x11\" - letter size prints were fair at best at all ISO settings... JPEG picture quality is very soft and grainy looking at all resolution settings.... 5X7\" seems the largest acceptable prints size.I am a Leica owner (film) 2 bodies and half-dozen lenses.  I realize that a \"simple\"camera wont't deliver Leica quality, but when my wife complains about fuzzy images, there may be a problem.  She is not as discriminating about photo quality as I am; it's not what she does.When she questioned the results with this camera, I took it and compared it print for print with my Sony Alpha 100 (10mp DSLR) using to prime and a Tamron wide-angle zoom lenses to match various focal lengths.  I know the alpha sensor is bigger, but 16mp against 10mp ought to be somewhat close in quality.  It wasn't.  At almost double the resolution it clearly did not come close.Think she might like to try a Canon Powershot S100, G12, or G1X. All of these are more expensive, but the quality is the issue here. She is now using a Sony DSC-F828.  The only problem is physical size. It is only an 8mp camera and has a Zeiss zoom lens that opens to f:2.0 - f2.8 across its entire zoom range.  It is 9 years old and I have produced 13x19\" gallery prints with it with no need for photo-shop enhancement.  If Sony still made this camera with a 10 or 12mp sensor, It would still be my camera of choice.Since this is an edited re-posting, I have to add that Amazon refunded my purchase in less that 5 business days... No problem.  Have also purchased an Alpha 290 from Amazon.. If it proves a problem, the Canons are next or perhaps the Panasonic Lumix LX5.FRED HUTCHINGS", "Date": "April 22, 2012"}, {"Title": "Love this line of cameras", "Author": "Consumer816", "ReviewID": "R290O4DJK80V38", "Overall": "5.0", "Content": "Very easy to use, takes amazing pictures for the price and size. I would highly recommend anyone buying this camera.", "Date": "April 16, 2012"}, {"Title": "Good product for a great price", "Author": "amazonbuyer", "ReviewID": "RNU0RO1KES98O", "Overall": "4.0", "Content": "I bought this product in May 2012. I works great. The LCD is huge. The picture quality is very good. Can take very good quality movies and picsWhat makes me annoying is that i cannot see the last picture i have taken. I bought 5X zoom, i wish i had gotten 10X zoom instead. Would have helped in taking long shots. Easy to carry and it is light weight. Will fit in your pocket perfectly. battery life is very good. Just came back from a 4 day vacation and the battery never died. Only advise i have is that when you buy your memeory card, make sure it is atleast 10GB. I bought 4GB card from amazon and returned it for 10GB. You need the capability of taking atleast 500 pics before your memory card fills up. It will be a perfect gift for your anyone in your family", "Date": "June 4, 2012"}, {"Title": "Good camera", "Author": "Brian Long", "ReviewID": "R1MKGU2VCPABLD", "Overall": "5.0", "Content": "This camera takes nice crisp pictures.  I wasn't looking for anything along the lines of a professional camera, but I am pleasantly surprised by the quality.", "Date": "January 15, 2013"}, {"Title": "Great Camera", "Author": "Robert D. Riedle", "ReviewID": "R1MI6K3XMW02RI", "Overall": "5.0", "Content": "Great camera for very little money. Very good in low light. Very small and well built. Panorama feature very cool!", "Date": "January 15, 2013"}, {"Title": "Poor image quality and color", "Author": "TTC", "ReviewID": "R1WK90A0DD0RFQ", "Overall": "1.0", "Content": "I wanted to really like this camera.  It has a lot of features that seem pretty fancy.  Unfortunately the camera does a very poor job.  I used it for a week around and including Christmas taking about 50 or so indoor shots at all resolution modes.Image QualityBy far, most of the images were blurry.  When there was even the slightest movement, the object would be smeared across the photo.  When there were two subjects in the photo, the camera would focus on one and not the other, even if the depth was around 1 foot different.Color QualityEvery photo was washed out.  As noted in other reviews, the weak flash did not help here either.Needless to say, it will be going back.", "Date": "December 31, 2012"}, {"Title": "Camera very nice in red", "Author": "Terry Jokinen", "ReviewID": "R2DTDQ6AVGG0M5", "Overall": "5.0", "Content": "Bought this with the red carrying case for 78 year old mother in law. She was so thrilled. Works great for point and shoot.", "Date": "December 28, 2012"}, {"Title": "Gift Camera", "Author": "Donald L. Held Jr. \"Glass Man\"", "ReviewID": "R2Q1KNOQQP27JV", "Overall": "5.0", "Content": "Bought this camera for my granddaughter to use on and off campus. It does many things a teen wants, the pictures are Outstanding, close up and far away. Cost is a very good deal for a gift.", "Date": "December 27, 2012"}, {"Title": "Just what I wanted", "Author": "Rpierre185", "ReviewID": "R1NRE0EDQHLM0P", "Overall": "5.0", "Content": "I wanted an inexpensive camera to snap pictures and take random vids and this camera meets that need perfectly. I am still navigating the features and havent yet mastered all the functions, but so far so good.", "Date": "December 23, 2012"}, {"Title": "Blanco's camera", "Author": "Jane Ogletree", "ReviewID": "RLH3MO0Z9TVYD", "Overall": "5.0", "Content": "We purchased this unpon recommendation of another physician in the clinic for use with tracking treatments progression.  Has been giving us very clear and easy pictures.  A little differenct application from family photos but very effective.", "Date": "June 11, 2012"}, {"Title": "Its a point and shoot camera", "Author": "Deepan", "ReviewID": "R3BVAF0CK2GZPU", "Overall": "5.0", "Content": "This is a simple to use point and shoot camera which i bought on thanksgiving of 2013. The deal seemed good and i wanted a decent camera before my graduation. It did the job as expected. Typical SONY device. It has been doing good so far and i have left it unattended for months and it still springs up and does not drain out battery power.The finish of the camera on the outside is good and holding it feels really nice.This might not be the best if you want to use in winter since the buttons on the top could be difficult to use with the gloves on.The picture quality is decent if you know how to configure and use for different lighting settings.Overall a very good product at less than $100", "Date": "January 15, 2014"}, {"Title": "best for the value", "Author": "Dan", "ReviewID": "R1ENFGEWIEN7P4", "Overall": "5.0", "Content": "cool camera great for vaction or out with friends the sd card and the usb cable make it easy to share", "Date": "August 16, 2013"}, {"Title": "Good deal", "Author": "Jeni Gray-Roberts", "ReviewID": "R1DWY2U416E2NP", "Overall": "5.0", "Content": "This was a great bundle.  Everything works fine.  Camera is small enough to fit in pocket when hubby is not using the case.  Picture quality is exactly as expected for an affordable small camera.", "Date": "August 12, 2013"}, {"Title": "Yes", "Author": "Nunufar", "ReviewID": "R33H0NC48RQGB", "Overall": "5.0", "Content": "Bought it while it was cheaper during black Friday. My sister's been using it ever since. Takes good pictures, has easy options, nice videos. Love it. I've always bought these.", "Date": "July 23, 2013"}, {"Title": "A serious little picture machine taking great pics with sweet Carl Zeiss optics and great video too", "Author": "Thomas \"NikonD7000DSLRorg\"", "ReviewID": "R28LZQ9OFMWMX2", "Overall": "5.0", "Content": "I purchased two of these cameras, one for my fiancee and one for myself.  We both wanted something that we can always take with us.  This camera fits in a men's dress shirt pocket and is completely concealed.  We have used these cameras for the past six months and they have produced amazing pictures.  We are both extremely happy with these little photographic wonders.I own three cameras ... this one...an Olympus XZ-1 ... and a Nikon D7000 DSLR, and I use all three ...mostly the DSLR whenever I can.This camera gets 5 stars for the following reasons and considering  that it is a pocket camera (not a DSLR ;-) - digital single lens reflex camera):1)  The size of the camera is only 3.8 inches x 2.2 inches with a 3\" back review LCD screen (230k dots resolution, awesome for this little wonder) and less than an inch thin (0.8\") with control elements that even a grown man can reasonably operate.  So very compact but well designed elements.2)  The camera has 16.1 MP and has outstanding Carl Zeiss optics (5x optical zoom).Carl Zeiss optics are flawless in quality, and without the optics nothing else matters.  That this camera has such a high quality lens is a great sign of what's behind the lens.  The lens is image stabilized.Lens Type : Carl Zeiss® Vario-Tessar®Optical Zoom : 5xFocal Length (35mm equivalent) : Still 16:9: 28-140mm / Still 4:3: 25-125mm / Movie 16:9: 29-145mm(SteadyShot Standard), 30-150mm(SteadyShot Active) / Movie 4:3: 35-175mm(SteadyShot Standard), f=37-185mm(SteadyShot Active)Lens Construction : 6 elements in 5 groups (including 3 aspheric elements)Minimum Focus Distance : iAuto:AF(W:Approx..5cm(0.16') to Infinity, T:Approx.100cm(3.28') to Infinity) / Program Auto:AF(W:Approx..5cm(0.16') to Infinity, T:Approx.100cm(3.28') to Infinity)Aspheric Elements : 3Steady Shot Mode:Active : YesRegarding the 16.1 MP image sensor.  I shoot this sony with 10MP resolution because I don't like to deal with huge files and it makes little difference to my perceived quality of this image from this camera.  However the results from this camera are truly outstanding.  You can produce a good looking 20\" X 30\" poster from this 10MP image, so with 16.1 MP full resolution you will get all you ever need for casual photography ( for what this camera is really meant for).  The resolution is adjustable with the easy to use menu screen:  16.1 MP, 10MP, 5MP (straight uploadable resolution to Facebook), VGA resolution (640x480 pixels for direct computer screen for a blog for example) all in 4:3 aspect ratio.  You can also choose wide screen shooting modes (aspect ratio 16:9) in these resolutions:  12 MP and 2 MP.So really plenty of options to adjust to your needs/preferences.3)  The camera can be operated in different camera modes including P (for most manual control):Intelligent Auto (works great), Program Auto (most control for the user), Picture Effect (for the instant artist ;-), 4 modes ), and scene mode (11 scene modes wow).a)  Intelligent Auto:  This is my main mode to use this camera for plain fun snap shots without having to think.  This camera is great in focusing, choosing modes and getting the best picture for you most of the time and instantly.  In iAuto you get to further select EASY mode (simplified menu and larger font for the true point and shooter who just rather not deal with anything except take a great picture), image resolution, single shooting or continous shooting (1 fps up to 100 shots), EV (exposure correction -2.0 to +2.0) basically to adjust image brightness, iScene auto and advanced,smile detection sensitivity (three settings),Face detection (off,auto,child priority,adult priority,in camera guide,operation settings menu (time,date,sounds).b) Program Auto: this gives you more choices for those more familiar with photography.  It is actually quite amazing to me how many cool features have been carried from advanced photography into this one-click-wonder.  same controls as in a) above but in addition these... ISO settings: Auto, 80,100,200,400,800,1600,3200;  White Balance: Auto,Daylight,Cloudy,Fluorescent 1,2,3, Incandescent,Flash,One Push and One Push Set (for custom white balance, cool!); Auto Focus: Multi AF,Center AF,Spot AF; Metering Mode: Multi,Center,Spot; DRO (recovering of tones in image): Off,standard,plus;c) Picture effect:  I haven't used these...you can do it with photoshop etc, but why bother with complex software as a poin and shooter with these fun features?! ...and instant gratification with Toy Camera: shoot images with the effect of a toy camera ... i guess it sounds like a toy camera (the shutter release haha) ... Pop effect:  shoot images in pop and colorful colors ... Partial color: shoots dramatic images coloring only the extracted colors (extract red, green, blue, yellow)...like a red rose in a black and white pic ...sweet...Soft High key Effect:  shootswarm fresh photos emphasizing the bright areas.4)  It takes amazing video (i didn't buy it for video, but it does do a great job)  but hey I take it and it is a bonus to me.Video Format : MP4(AVC/H.264)Video Mode : 1280x720(Fine)(1,280x720/30fps)/1280x720(Standard)(1,280x720/30fps)/VGA(640x480/30fps)Audio Format : AACMicrophone/Speaker : Mono/monoThat sums up my reasons why I consider this a great 5 star camera and a fantastic buy for ANYONE.This is a complete one-click-wonder and may become even a serious photographers little angel in the pocket (it is for me for sure) ... because the best camera is the one you have with you ... and if it has to fit in a pocket, this definitely the best!", "Date": "May 16, 2013"}, {"Title": "Sony Cyber-Shot DSCW650", "Author": "Naiomie", "ReviewID": "R2OBEI2XODX7PA", "Overall": "5.0", "Content": "I love Sony Cyber-shot Cameras. I previously owned the W55 in pink and bought this one in silver. I made a fantastic upgrade. Now you can access the entire manuel within the camera, plus the panoramic view is included. I've had no problems with this camera. I also like that when I zoom-in to take a photo it doesn't come out blurry.", "Date": "May 13, 2013"}, {"Title": "awesome pictures", "Author": "galaxia", "ReviewID": "RVGFE8FTZAZ8Z", "Overall": "5.0", "Content": "I have been using this camera for a month and it is great! the battery life is awesome. so many features, such great photos", "Date": "May 2, 2013"}, {"Title": "Sony Camera pricelss!", "Author": "disgruntled", "ReviewID": "R3204C9JZ9I40L", "Overall": "5.0", "Content": "Love this camera. Zeiss lenz is the best. So many ways to get best results. If you like to ajust, you'll like this camera. I take photos of my art work (pictures), large and small. Lighting is never a problem. Oh, I almost forgot to say going from one thing to another isn't quick like a bunny so some people reviewed it who were impatient. Read the reivews and you'll see what I mean. I took pictures all the way through the Vatican Museum in Rome and they were excellent.", "Date": "April 13, 2013"}, {"Title": "Not what I expected", "Author": "Darlean Spangenberger", "ReviewID": "R1RC17T7OJ1QGV", "Overall": "1.0", "Content": "The battery lost it's charged after about 6 hours and we were unable to take additional pictures that we wanted.  The battery was fully charged so there is no reason it was dead after about 6 hours.  A lot of the pictures were very blurry and dark even thought we had it set on the automatic feature which is supposed to set the camera automatically for all the shots you take.Would not recommend and will probably have to get another camera to use.", "Date": "March 5, 2013"}, {"Title": "pretty good", "Author": "Bernarda Pineda \"RONALD STHORMES\"", "ReviewID": "ROVP1MCLEGFO3", "Overall": "5.0", "Content": "nice article related to the low price... now i have great pictures and good videos from a well known brand and for a good price", "Date": "January 19, 2013"}, {"Title": "A nice gift!", "Author": "Melissa N. Burnett", "ReviewID": "R2DGYIZ9D0PV1H", "Overall": "5.0", "Content": "My husband bought me this camera a few years ago, so when my daughter asked for a camera for Christmas I purchased this item quickly. It works great and she loves it!", "Date": "January 17, 2013"}, {"Title": "Won't charge from USB", "Author": "Just me \"rforster62\"", "ReviewID": "R74PIELVNHWSX", "Overall": "1.0", "Content": "A bit disappointed with my purchase. (Bought at Fry's) One charge I did from the AC charger went well but could not charge the camera from the USB while on my trip. Why Sony doesn't just include an AC to USB adapter is beyond me. Can't download the pictures to tell you how they are because the camera is dead. Will post back on that.", "Date": "December 26, 2012"}, {"Title": "Sony Cyber-shot DSC-W650 16.1 MP Digital Camera with 5x Optical Zoom...", "Author": "Bryck Antillon Zuñiga", "ReviewID": "R3AXU7APUX0W7G", "Overall": "5.0", "Content": "Impresionante rendimiento, realmente ha sido una herramienta super útil desde que la adquirí para ciertas cosas del trabajo, la calidad de fotografías en el área de macro me ha dejado más que satisfecho. Las opciones de configuraciones faciles de manipular. Realmente una excelente compra.Impressive performance, has really been a super useful tool since I bought some things to work, the quality of photographs in the macro area has left me more than satisfied. Configurations options easily manipulated. Really an excellent buy.", "Date": "December 12, 2012"}, {"Title": "Love the camera", "Author": "Crystal Richardson", "ReviewID": "R2J4XSB7K92022", "Overall": "4.0", "Content": "Amazing shots especially in low lit environments. I don't have any problems. Easy to use, very light in weight. Not bulky to carry around.", "Date": "December 2, 2012"}, {"Title": "You Get Most of What You Should Expect.", "Author": "BDavis", "ReviewID": "R2KYVOYLBL8I60", "Overall": "4.0", "Content": "It works well. A lot better than my previous camera and the camera on my phone, although that might not be saying much if you're actually into photography. But, if you are into photography, there's really no reason you should be looking into a camera like this. Is there?Anyway, my only complaint is that I can't figure out how to get night pictures to look anything like the scene I'm trying to take of picture of. Either my eyes are seriously messed up or everything looks way brighter in the pictures than they do in real life. Maybe that's a downfall of a camera of this type, but I find it annoying. I also don't like Sony's proprietary batteries and cords, but since I haven't lost any of them yet i won't complain too much. Hoepfully I won't lose any of them, bc I'm REALLY not looking forward to buying Sony brand batteries or cords, as I assume they'll be expensive due to the exclusivity of them.Still, I give this 4 stars bc I knew about the battery and the cords before I purchased the camera.", "Date": "October 20, 2012"}, {"Title": "It's ok.", "Author": "Melody O \"Paw parent\"", "ReviewID": "RY7XVYK3UW9IK", "Overall": "3.0", "Content": "It just wasn't as great as I expected. My old Sony camera with 1/2 the pixels seems to take pics just as well. I do like the larger screen, the black and white and a few other things, but I could of just stuck with my old camera and been just as happy.", "Date": "September 6, 2012"}, {"Title": "wow - value for money bundle", "Author": "subeesh", "ReviewID": "R36RYWZSVO636D", "Overall": "5.0", "Content": "no other word to explain WOWWWWWWReally good camera comes with a handy bag  and  SD card. Less than 120 bucks is a really good deal for a great camera having a lot of features", "Date": "August 23, 2012"}, {"Title": "Cámara fotografica Fabulosa/ Fabulous Foto Camera", "Author": "Elazam", "ReviewID": "R5JNKNMN0QOOK", "Overall": "5.0", "Content": "Maravillosa cámara fotográfica marca sony, colmo mis expectativas, recomiendo comprar el producto, y la garantía es fantástica / Wonderful brand sony camera, my expectations high, recommend buying the product, and the warranty is great", "Date": "August 20, 2012"}, {"Title": "bad battery door", "Author": "Gerald J. Lipchik \"griddler\"", "ReviewID": "R12SYZV4FORIL6", "Overall": "3.0", "Content": "I bought this camera and it works fine but the battery/memory card door latch broke off. I have to secure it closed with a small rubber band now. I had this problem with my last Sony camera too and next time I think I will look for another brand. The camera was over 6 months bought so I could not return it. beware.", "Date": "July 23, 2012"}, {"Title": "Great Camera", "Author": "wispofisis", "ReviewID": "R1QC53XAMY93C7", "Overall": "5.0", "Content": "Camera works great. It takes awesome pictures and video. I previously have a Sony Cyber-shot and it worked great as well but was just looking for something a bit better and looked around a bit and found this camera on sony.com but then found it cheaper on amazon. I think its great for the price only thing is I wish they would have had this model in pink. :)", "Date": "July 11, 2012"}, {"Title": "Good value.  Sometimes the blacks are too deep.", "Author": "Meng Qi", "ReviewID": "R3F0ETGMAG82ML", "Overall": "5.0", "Content": "Good camera.  Got it (slightly used) on the most popular auction website for 65 dollars.  Works out of the box.  Shoots beautiful pictures with almost no adjustment on the settings.Sometimes the blacks are too deep when the rest of the picture is bright.  For example I took a picture of my house with the garage open.  The garage and car looked meshed together in black patches.  Adjusting exposure settings or enable flash might fix the problem, but I have not tried yet.", "Date": "July 7, 2012"}, {"Title": "Love this camera!", "Author": "Penny A. Friend", "ReviewID": "R29GHJ8BYFP5V6", "Overall": "5.0", "Content": "I purchased these for my student use in my computer classes.  The image quality and options are amazing.  The panoramic feature is a favorite!", "Date": "June 11, 2012"}, {"Title": "Cheap Camera.  Battery cover pops open.  Cheap plastic catch broke off 1st day.", "Author": "Luigi", "ReviewID": "R30ZF9IP3V5YYI", "Overall": "2.0", "Content": "Great size, good carl zeiss lens, good price, BUT little details like the battery cover lock not catching and staying shut is problem.  Cheap, plastic-y unit.  Didn't last long!", "Date": "June 20, 2012"}, {"Title": "Nice pics, but...", "Author": "NAS \"NAS\"", "ReviewID": "R3W16U9G332XRB", "Overall": "3.0", "Content": "It's a very nice little camera, lots of features, but disability to check the last picture taken drives my crazy!", "Date": "April 7, 2012"}, {"Title": "Not impressed!!!", "Author": "Tilly", "ReviewID": "RP4BI8D94PPG2", "Overall": "1.0", "Content": "This is my 3rd sony Cyber shot camera and I must say I am very disappointed.  I purchased this based on the other 2, which I was very impressed with.  I would not recommend this at all, pictures are blurry, and have yellow tones, when you set on the color extraction mode, even when not wearing lipstick it makes the lips of the subject stand out bright red, which spoils the picture.  I could go on and on with my disappointment, waste of money!", "Date": "August 31, 2012"}, {"Title": "Looks and feels cheap, features are very basic, you get what you paid for", "Author": "J. Komala \"avid shopper\"", "ReviewID": "R29BW48GKK4W97", "Overall": "1.0", "Content": "I have owned many cameras from many makes and models. Currently I have two Canon DSLRs and half a dozen mirrorless compact system cameras from Sony, Samsung, Panasonic, Nikon and Pentax.In short, I know quite a bit about digital cameras, not just the technical details but also the built-quality, the aesthetic and the handling / user interface for example.I purchased this Sony W650 as a gift for my mom.Before deciding to buy it, I was torn between it and Canon Elph 100 HS. I loved the Canon P&S; cameras I owned in the past but I also loved Sony ones I had as well.Between these two, Sony W650 is newer and cheaper. It also has sweep panorama. The camera looks pretty in the pictures.However, once I have it on my hand, I can tell immediately that while the front has a nice look of brushed metal finish, the back looks like it's made of cheap plastic. If I hold the back of the camera against a light source, I can see uneven surface as if a result of a bad paint job. I got the red color one by the way.The buttons look and feel cheap as well. The zoom is not smooth / even but rather jumpy. Going through the menu, I can tell that this is not a camera I would love to use. The camera features are very basic. Eg. for the flash, you can only choose either Auto or Off (at least on the intelligent Auto mode).It is a far cry from all other point and shoot cameras I have used in the past including Sony W50/W55.I went to a local brick and mortar store to get a better comparison between many different point and shoot cameras. For a point and shoot camera, the price only makes sense as long as it is below $200. Because above that, you enter into a realm of mirrorless compact system camera which most have significatly larger sensor than typical point and shoot cameras. So I limit my price range to below $200.I went back to the other camera I was originally interested on. At the brick and mortar store, they only have the Elph 110 HS which is the newer model but for the most part identical to the 100 HS.Canon 100 HS has \"only\" 12 megapixels while Sony W650 has 16 megapixels.However, most point and shoot cameras such as these have tiny imaging sensor, 1/2.3\" (6.17mm x 4.55mm) to be exact. Higher megapixels generally means higher noise.Canon 100 HS has a more beautiful finish throughout its surface. No bad paint job LOL.Buttons are flushed, which may irk some people, but I found that they are fine. They are larger than those on the Sony and don't look like they may come off or break off easily like the Sony's.Menus look better. It has more features than the Sony's.In the end, I returned the Sony W650 and bought the Canon Elph 100HS.", "Date": "August 28, 2012"}, {"Title": "Don't waste your money", "Author": "Northern star", "ReviewID": "R61NEB4TB0LXL", "Overall": "1.0", "Content": "I bought this camera because of the price and all these seemingly great specifications, this camera is really not worth the money- it is very light and has a cheap feel to match the price- resolution on the viewfinder remainds me of my old Nokia phone from 5 years ago- takes at least 10 seconds to retrieve a photo and no instant viewing- the so-called Carl Zeiss lens is not the real thing as the brand name was licensed to Sony and lenses made elsewhere- cannot charge the camera directly as the battery needs to be taken out and charged separately each time- most importantly the picture quality is absolute crap. At 16.1mp the pictures are fuzzy and lack clarity, colors look overly saturated and they can only be used for 4x3 prints, enlarge any further you'd be better off using an iPhone insteadOverall I regret buying this and won't recommend it to anyone", "Date": "June 12, 2012"}, {"Title": "Worked for 3 months.", "Author": "Daniel Bauer \"Daniel Bauer\"", "ReviewID": "R3NK3MA6ZOY4C4", "Overall": "2.0", "Content": "I bought this camera after reading some positive reviews.  Got it in March, just in time for our Disney World trip with our kids.  Camera worked great and took great pictures.  A few weeks ago I tried to upload pictures to my computer from the camera.  For some reason, my computer wouldn't acknowledge that the camera was connected and I thought it was a computer problem since my computer is starting to fail on me.  I finally got my pictures to upload and now the camera tells me that my empty memory card is full.  I've tried several other cards, also empty and it tells me the same thing.  I'm irritated.  I've been unable to take pictures with this camera for almost a month.  I thought Sony would be more reputable.", "Date": "June 11, 2012"}, {"Title": "HORRIBLE CAMERA; HORRIBLE SUPPORT", "Author": "Ping Porsche", "ReviewID": "RGS4WJS4UTX5Z", "Overall": "1.0", "Content": "WHY CAN'T I GIVE NEGATIVE STARS?DON'T BUY THIS OR ANY OTHER SONY CAMERA!!!!!Sony makes crap cameras and their support will accuse you of breaking it.Purchase from a respectable camera maker like Canon, Nikon, or Fuji.I bought this for snorkeling and it corrupted my memory card on the first trip.OK, $10,000 trip with no pictures, because the camera corrupted the memory.Called Sony and they blamed the memory.Got two new memory cards for the next trip.OK, new trip, $5k trip with no pictures because the entire stupid camera craps out.Called Sony, no apologies, no emergency loaner, just a send it in with the receipt so we can verify it's still under warranty.Sent the camera in to the depot, on my own dime.They call and accused me of opening the camera door.What idiots! Why the hell would I do that? So I can ruin my pictures?  TWICE????!!!!!I contacted all the way up to national customer support.All idiots along the way.They didn't do a user test underwater.They just dunk it and say it's still WATER-RESISTANT, so it must be user error.F#$% OFF SONY!!!!Whatever you do, buy something else and save your money, this is a horrible product, that takes horrible pictures and is slow as mud, with a horrible touchscreen that doesn't work.", "Date": "November 28, 2012"}, {"Title": "Where's the Macro focus?", "Author": "Randy L. Haynam", "ReviewID": "RQN84Q37C0065", "Overall": "2.0", "Content": "Bought this to replace my Sony DSC-W90 and was disappointed. The DSC-W650 does not have a Macro focus setting for ultra close ups that I often use to photograph items for eBay. The package that it came in did not reflect this. It had a panaramic feature which I would rarely use.  In addition, the battery was different than my older Cybershot which means all my old spare batteries would be worthless. The memory card is also a different size which would have made all my spare Memory Stick PRO Duo cards worthless. Which also means my Sony magic Gate PRO reader would be rendered worthless.  The DSC-W650 was a a little more flimsy and harder to access the memory card and battery.  Had to take it back for a refund.", "Date": "July 13, 2012"}, {"Title": "Garbage !", "Author": "Teresa", "ReviewID": "R2P0KFJU2AV96R", "Overall": "1.0", "Content": "A really bad Camera...Doesn't look anything like the picture. The photos are a really bad quality and they come out yellow.", "Date": "November 26, 2012"}, {"Title": "Not fancy but I like it.", "Author": "Wise Thrush", "ReviewID": "RHF0G5KJXIT9G", "Overall": "5.0", "Content": "This is my second. First was stolen. I liked the original Pink/Rose color but this Red color is OK too. Fits easily in my jacket pocket. I have a tremor in my hands due to medication and the image stabilization is good enough to counter that most of the time.", "Date": "May 13, 2014"}, {"Title": "Nice", "Author": "79Rose79", "ReviewID": "R3FZFWJ0TJ5633", "Overall": "5.0", "Content": "Bought for my daughter and works great. I love the different colors to choose from. As long as you read the directions the camera works great.", "Date": "May 2, 2014"}, {"Title": "Battery cover won't close - Mediocre picture quality", "Author": "climberkent", "ReviewID": "R29ZCOZBBKVWJ7", "Overall": "2.0", "Content": "I lost my previous Cybershot and bought this one.  The battery/sim card cover doesn't lock in place.  It has a super flimsy andcheap mechanical slide that doesn't hold the door closed.  It pops open all the time and now it won't even close.I wasn't pleased with the design either.  The camera tries to be idiot proof, and as a result takes all the decisions away from thephotographer.  Focus is fair to poor.  I bought a Canon equivalent for my son and now his camera is better than mine.  His takesmuch sharper pictures than my Cybershot, and his cost less money.  I'm all done with Sony cameras.  They had a good thing going for awhile, but they've cheaped them down way too much.  I'm out.", "Date": "April 28, 2014"}, {"Title": "Wonerful quality of pictures.", "Author": "gary w petersen", "ReviewID": "R3AINNCLL88L9Z", "Overall": "5.0", "Content": "I gave this camera as a gift and have received fifty or so pictures from it over the net. The user had no training but had inadvertently left the flash on. The pictures made me envious and I would buy it for myself if I needed a new camera, Can't go wrong here,", "Date": "April 11, 2014"}, {"Title": "Digital Camera", "Author": "Shawn Smith", "ReviewID": "RSES0QGSVFGCY", "Overall": "4.0", "Content": "I am simply amazed by this little camera. It take clean, professional grade pics. I recommend this product for anyone.", "Date": "April 7, 2014"}, {"Title": "Camera Back won't close", "Author": "John G", "ReviewID": "RDSWMF10QLU8I", "Overall": "2.0", "Content": "Camera Back won't close; have to hold it shut with my hand while taking photo's. Waste of money, won't buy another Sony.", "Date": "March 30, 2014"}, {"Title": "this camera is awsome!", "Author": "Josue Joel Valverde V \"joelvalverd\"", "ReviewID": "RGGT4JA2WQRA0", "Overall": "5.0", "Content": "i love this camera, and for the price is much better. it is coming with full accessories, great camera for me", "Date": "March 8, 2014"}, {"Title": "Excellent", "Author": "VESTALIA TORRES", "ReviewID": "R1PT4D9OU6KNGI", "Overall": "5.0", "Content": "Very good product. tough, durable and economical to use that I give. 100 percent recommended for the purchase of this product.", "Date": "February 21, 2014"}, {"Title": "Premature Screen Failure", "Author": "Joe \"Joe\"", "ReviewID": "RW58ROV84KGVC", "Overall": "1.0", "Content": "Simple, adequate photos. But screen failed in 15 months of very light, gentle use, making the camera unusable.  Unsatisfactory for the money.  I won't replace it with another Sony.", "Date": "January 21, 2014"}, {"Title": "Good for amateur photographers and travelers.", "Author": "Albam", "ReviewID": "R5TRLVLKMZJYP", "Overall": "5.0", "Content": "It has everything for an amateur photographer, even in automatic mode, if you prefer it that way. Or you can turn off the automatic functions and manage those functions by your self.It has Carl Zeiss lens and that makes a difference. I have a friend with almost the same camera but with Sony lens and I can notice how colors and details are shaper in this camera.Also, because of its reduce size and weight, it's perfect for travelers (even if you have to be careful not to let it fall). However, I've had that accident a couple of times, and the camera is strong enough to survive just with some scratches.", "Date": "January 8, 2014"}, {"Title": "liked but had a glitch", "Author": "gail robinson", "ReviewID": "RKRB42FCSN3SO", "Overall": "4.0", "Content": "Received this camera as a gift and really enjoyed it. Was easy to use and really pleased until one day it started having red background/shades. Took it to a Best Buy and they said is was a manufacture error, unfortunately, warrant is not very long, and would have cost more to return than to buy another one (that is what the guy told me) At this point am looking into buying another one, or upgrade.", "Date": "December 27, 2013"}, {"Title": "GREAT CAMERA", "Author": "CT Itle-Sherry", "ReviewID": "R6ZTXQEK7G9D0", "Overall": "5.0", "Content": "Great camera, great features, slim, quality great. Love the panoramic options. Low light photos great. Carl Ziess optics are worth the price", "Date": "November 14, 2013"}, {"Title": "Great travel and all-around camera", "Author": "Jeff", "ReviewID": "R2K2RY1SQME8Q5", "Overall": "5.0", "Content": "Bought this for an extended vacation to Hawaii.  I was impressed with the abilities of this camera in a small package.  The Ziess lens was a plus.  More features than I needed, but glad it has them for all-around use at home.  It will go with us again and again.  Have a Sony Cybershot 5.0 MP camera, but this one is remarkably better.", "Date": "September 23, 2013"}, {"Title": "Nice camera, fantastic price, im injoing this camera", "Author": "david morel", "ReviewID": "R3G8NDWA6R1IM", "Overall": "4.0", "Content": "It works nice. Its picture look fantastic. I recomend this camera. The price was good. congratulation.im injoing this camera, Bye", "Date": "August 26, 2013"}, {"Title": "A Really Good Value", "Author": "OCD-I-Am \"All Things Amazon\"", "ReviewID": "R2MRC84A68OFGJ", "Overall": "4.0", "Content": "Excellent value in this bundle for the camera, case and SD card altogether in one package for the price paid. This was a gift for our son and he has had only positive things to say about the Sony camera and believes receiving the additional case and SD card at the same time was definitely a benefit.", "Date": "July 24, 2013"}, {"Title": "Love this camera", "Author": "Robert A. Smith", "ReviewID": "R354T3WL9PKK10", "Overall": "5.0", "Content": "This is the second one I have bought. We use them at work to document work instructions. They are tough and take great pictures.", "Date": "July 8, 2013"}, {"Title": "Sony DSC-W650", "Author": "Wallstreet12", "ReviewID": "R2O95W9WY4EFQ8", "Overall": "5.0", "Content": "This camera is really nice and a good deal.  Sony pictures are sharp and products are always well made. Buy it!", "Date": "July 6, 2013"}, {"Title": "AWESOME CAMERA", "Author": "adan", "ReviewID": "R15WXMZJIN31AJ", "Overall": "5.0", "Content": "For the price this camera is top notch. I bought this camera because I needed one for college, so was only interested in cheap and easy cameras. I have had it for over a year now and can honestly say it was definitely worth it. Takes clear and clean images. Has a variety of in camera options and picture affects. I have received lots of praise for some of the images Ive taken and would not consider myself a photographer. the video recording is simple, nothing special you can do with the video settings just record in 720 p fine or standard. The still images Is primarily what this camera was designed for, but the video resolution is great for recording everyday events. Would recommend this to first time buyers of digital cameras as it is cheap and easy to use. Sony is always making great products.", "Date": "July 1, 2013"}, {"Title": "Battery Cover issue", "Author": "Andrew Blaine", "ReviewID": "RWLNROMAAAINL", "Overall": "1.0", "Content": "The battery cover doesn't stay closed well, the lock doesn't keep it closed. Sending back to Sony for RMA. I purchased elsewhere and don't have my receipt, but thankfully they honored the warranty anyways.", "Date": "June 27, 2013"}, {"Title": "Great camera", "Author": "globaltrekkie", "ReviewID": "RIY3KWAVE6X31", "Overall": "4.0", "Content": "The picture quality in the day is crystal clear and the flash for low light and night time is so bright, you would think it was day time.  It also takes great images, especially of children who never stay still for a photo.  I would have given it 5 stars, but the housing seems flimsy.  I have the W350 and it is much more sturdy.  I dread dropping this camera.  I do not think it will survive.", "Date": "June 22, 2013"}, {"Title": "Present for my father", "Author": "crafty lady", "ReviewID": "R2XHB233HNZ075", "Overall": "5.0", "Content": "My dad is older and needed a camera that was simple to use and that could fit nicely in his pocket.  He loved it, and it was easy to show him how to work it.  Its a great product and I would recommend this for anyone that wants the ease of just pointing and clicking without a lot of hassle.  Great camera.", "Date": "June 17, 2013"}, {"Title": "i love it sony is the best", "Author": "wesam mohamed", "ReviewID": "R1B71EARK1232D", "Overall": "5.0", "Content": "sony is the best camera but you must take care it must carel ziuse and it has super ccd sensor very good in the dark envernoment excellent hd picture in door and out door but may be you must need buy another battery if you diceded stay out the door long time becouse battery lost spicial in the dark with work flash any way this camera is the best picture and video in door and out door", "Date": "May 9, 2013"}, {"Title": "YES", "Author": "alexdude", "ReviewID": "R2FFG7IBL3CO82", "Overall": "5.0", "Content": "I bought this to replace my purple 14MP camera I lost and it was worth it! Amazing images and video is great for cinematic wannabes.", "Date": "May 4, 2013"}, {"Title": "Don't buy this camera!", "Author": "sunshine momma", "ReviewID": "R33TPQJ1T2I7ND", "Overall": "1.0", "Content": "I have given this camera over 6 months to win my vote, and it just is a waste of money. I have tried using every function, and the picture quality is terrible. If your ONLY purpose of buying this camera is for outdoor shots during the daytime, then this is the camera for you. It takes HORRIBLE indoor pictures, they are fuzzy over 90% of the time, unless your subject is PERFECTLY still. I am so frustrated because so many people gave this camera good reviews, and it is simply junk.", "Date": "April 12, 2013"}, {"Title": "Love this Sony Camera", "Author": "Bonnie", "ReviewID": "R19YTNDSYPY5S4", "Overall": "5.0", "Content": "I really love my new Sony Camera, took it on vacation recently and it is easy to use, and easy to learn how to use, important for me as I dont like reading directions.  It took great photos, served the purpose, but I have owned a Sony in the past.", "Date": "April 1, 2013"}, {"Title": "GOOD PRODUCT", "Author": "George", "ReviewID": "R14SFWFFX02T5Z", "Overall": "4.0", "Content": "THIS IS AN EXCELLENT PRODUCT VERY GREATEST AND BEAUTIFUL. IT HAVE ESPECTACULAR COLOR AND VERY GOOD. VERY VERY VERY GOOD", "Date": "March 30, 2013"}, {"Title": "Great!", "Author": "J.L", "ReviewID": "R3E2IVUGKEF8H8", "Overall": "5.0", "Content": "I bought this camera for my Asia trip, I came back with lot of memory and great WOWs from friends and relatives. The camera is really easy to use.", "Date": "March 23, 2013"}, {"Title": "Awesome camera", "Author": "carole miller", "ReviewID": "RJC1MMFGPJM7O", "Overall": "5.0", "Content": "As always Sony is one of the best cameras.  I bought this for my son in COsta Rica and he loves it.  Says the colors are so vivid and he enjoys it.  I always can on Sony.  You do not have to guess. Other cameras we have had have not met the qualities of the this SOny.Will buy again", "Date": "March 20, 2013"}, {"Title": "Sony Camera", "Author": "Janet Rayman", "ReviewID": "R3PV2PK1XS3MLD", "Overall": "5.0", "Content": "It's an excellent camera and offers the features were looking for.  It's the third Sony camera we've owned.  Thank you,", "Date": "March 16, 2013"}, {"Title": "Great Camera", "Author": "Chad Ordean \"Chad\"", "ReviewID": "RYA0141P3ZPA3", "Overall": "5.0", "Content": "Great price, fast shipping, and good quality. Got this for gf for Christmas and has amazing picture. Camera is easy to use and offers plenty of options.", "Date": "March 12, 2013"}, {"Title": "best low price camera", "Author": "Gabi Oancea", "ReviewID": "R2BLRG5TSUW05T", "Overall": "5.0", "Content": "Best low price camera on the market and the Carl Zeiss lens are the best ever. Sony is the best ever.", "Date": "March 4, 2013"}, {"Title": "Basically OK, But Slow", "Author": "Max Poppers", "ReviewID": "R2Z5OY5MZ0SLZI", "Overall": "3.0", "Content": "Refresh rate particularly slow when using flash.Basically a good design , but I like the DSC W50 much better for low light conditions,refresh rate is considerably faster.", "Date": "March 2, 2013"}, {"Title": "EXCELLENT  PRODUCT", "Author": "Mauricio", "ReviewID": "R1L8INT3W0EOB0", "Overall": "5.0", "Content": "Buen vendedor, la entrega fue a tiempo y el producto cumple con mis expectativas, vendedor recomendado. El precio por el producto es bueno", "Date": "February 28, 2013"}, {"Title": "about the camera", "Author": "Edward A. Granzotto", "ReviewID": "R2GZ6QCJ0LAPGH", "Overall": "4.0", "Content": "i like it, best camera i had. the only complaint i have is that the on and off switch and the shudder are hard it get to.", "Date": "February 24, 2013"}, {"Title": "Love it", "Author": "EDINA PERAZIC", "ReviewID": "R3K2QQQQ4HULAX", "Overall": "5.0", "Content": "Takes clear pictures. Flash is good. Easy to use. Light weight and small enough to carry in your purse. Cute  small camera.", "Date": "February 23, 2013"}, {"Title": "Best camera and good make Sony", "Author": "Peter Manyeki Njoroge", "ReviewID": "RC173SPX11COM", "Overall": "5.0", "Content": "Since i thought of camera ,i was thinking of others make until a friend of mine took a picture of mine with a Sony one.It is the best clear and produce nice pictures and big sizes", "Date": "February 19, 2013"}, {"Title": "Gracias", "Author": "cristhw", "ReviewID": "R2SY2VFITFES3P", "Overall": "5.0", "Content": "Muchas gracias, compre desde Vevezuela con una Gif Card sin ningun contratiempo con el pago, me llego la mercancia acordada, gracias.", "Date": "February 16, 2013"}, {"Title": "I like it except flash is too bright", "Author": "Global Investor", "ReviewID": "R3MFARN6T106XG", "Overall": "3.0", "Content": "I bought this camera to replace an existing Sony Cybershot.  This new model is very nice except the flash is too bright.  When you take a picture of a person, their face is sort of washed out.  The old model didn't have this problem.", "Date": "February 11, 2013"}, {"Title": "Small", "Author": "NYCRR \"NYCRR\"", "ReviewID": "R3UOBOSCOV9RH7", "Overall": "2.0", "Content": "Small buttons Bad menu .... ..... .... .... ... ... ... ..not much else to say.... .... .... ... .", "Date": "February 9, 2013"}, {"Title": "Nice camera, great pictures", "Author": "Michelle D Lott", "ReviewID": "R1IOLPJ4V2X4AX", "Overall": "4.0", "Content": "Small, lightweight camera. Takes neat panoramic pictures. Video quality and picture quality is great. Love that it has a food picture setting since I blog about recipes.", "Date": "February 7, 2013"}, {"Title": "cool", "Author": "Ariel Liriano", "ReviewID": "R2M6UUG9R0FG3E", "Overall": "4.0", "Content": "adoro esta camara es muy versatil, facil de usar, practica y totalmete manejable, el envio fue bastante rapido una de las mejores compra que he realizado a cinceridad.", "Date": "February 7, 2013"}, {"Title": "TODO BIEN", "Author": "CARLOS EDUARDO", "ReviewID": "R2QJ86BEM185S6", "Overall": "5.0", "Content": "EL ARTICULO ESTA EN EXCELENTES CONDICIONES .LE RECOMIENDO EL VENDEDOR 100% CONFIABLEEL ARTICULO LLEGO A TIEMPOY ES BASTANTE BUENO", "Date": "February 4, 2013"}, {"Title": "execellent", "Author": "Yusleyda Cevallo G", "ReviewID": "R395KIC3W13SWW", "Overall": "5.0", "Content": "excelente producto llego en buen estado no tenfgo queja alguna , vino empacado con un abuena protecion lo que indico que los producto llegaron bien", "Date": "February 1, 2013"}, {"Title": "Excelente producto totalmente nuevo, volveria a comprarle", "Author": "Alberto Jose Salcedo Meza", "ReviewID": "RQ8ZY2WDMB1I8", "Overall": "5.0", "Content": "Excelente producto totalmente nuevo, volveria a comprarle, sencillamente excelente; muy rapido en llegar y responsable todo el tiempo, 5 estrellas", "Date": "February 1, 2013"}, {"Title": "Outstanding", "Author": "jdwaldron", "ReviewID": "R3EENS40V5S0GG", "Overall": "5.0", "Content": "Love this camera.  I have a Canon Rebel which is a great camera but this one takes outstanding pictures without changing lenses.  I especially love the panoramic and movie features.", "Date": "January 30, 2013"}, {"Title": "Great camera... battery life... meh", "Author": "Josh Means", "ReviewID": "R3PVM2U1B2DXV4", "Overall": "4.0", "Content": "Lots of cool features... as my job is day to day im able to delete photos on a \"day\" basis so that is very handy. Good pics in both low light and while moving (shivering hands). Would recommend and as mentioned above, the battery life is lack luster but sufficient.", "Date": "January 29, 2013"}, {"Title": "Bueno totalmente", "Author": "Alejandra", "ReviewID": "R2772M7V3GMSTJ", "Overall": "5.0", "Content": "Llego en perfecto estado, estoy muy contenta y agradecia con la compra, recomendable totalmente, pesonas cumplidas y correctas con lo que envian.", "Date": "January 28, 2013"}, {"Title": "Picture Perfect!", "Author": "Sophia P Sandiford", "ReviewID": "R3B1DAKRNK5YKN", "Overall": "5.0", "Content": "I am happy with this product.  The pictures are clean and nice.  The movies are lovely and the audio is crystal clear.", "Date": "January 28, 2013"}, {"Title": "Makes the work for the proce", "Author": "Omer", "ReviewID": "R104UAZ0WO1JE7", "Overall": "4.0", "Content": "For this price you get a good quality camera, the pictures are great, very light camera fits in your pants pocket.", "Date": "January 27, 2013"}, {"Title": "Excelente Camara", "Author": "Alexander Gonzalez", "ReviewID": "REWNRF63PL4FL", "Overall": "5.0", "Content": "Es lo esperado buen producto se los recomiendo, todo bien las fotos y los videos son de excelente calidad funciona bien, buena compra desde Venezuela", "Date": "January 24, 2013"}, {"Title": "Good buy!", "Author": "TomK \"truth searcher\"", "ReviewID": "R25UWNGQXQK88N", "Overall": "5.0", "Content": "Very compact and easy to use, especially in \"easy\" mode.  Has many features I didn't expect such as 360 degree scanning and movie mode with audio.  Wish the selected carry case also had room for the AC charger though.", "Date": "January 19, 2013"}, {"Title": "GREAT", "Author": "Excellent", "ReviewID": "R2JQNVOTMC54UC", "Overall": "5.0", "Content": "Great cammera for a few dollars...16.1 MP for 100 bucks..pretty good ??..works fine great pictures It came with all the cables and stuff", "Date": "January 17, 2013"}, {"Title": "UNA MUY BUENA TIENDA Y UNA EXCELENTE CAMARA TAMBIEN...", "Author": "LUIS RENE RUBIN RODRIGUEZ", "ReviewID": "R16K8VTSAR04FA", "Overall": "5.0", "Content": "UN MUY BUEN PRODUCTO, SE LOS RECOMIENDOCUBRE CON TODAS LAS ESPECIFICACIONES TECNICAS DETALLADASENELEQUIPOINTERESANTECOMPRAREALIZADA", "Date": "January 14, 2013"}, {"Title": "Cámara Beach", "Author": "Josman Ortiz", "ReviewID": "R3I0FQT8TGKQC2", "Overall": "5.0", "Content": "excelente articulo, es una muy buena cámara digital esta en perfectas condiciones, recomiendo altamente el articulo y los vendedores gracias", "Date": "January 13, 2013"}, {"Title": "Awesome camera", "Author": "SAMUEL H LA CRUZ", "ReviewID": "R1M0UTJGAUHI4M", "Overall": "5.0", "Content": "I love the fact that I got this for a Christmas present. I was surprise how great and easy was to use the camera. Perfect present.", "Date": "January 12, 2013"}, {"Title": "Excelent!!!", "Author": "HValeria", "ReviewID": "R2VJFPKSQSQWF2", "Overall": "5.0", "Content": "Excelent!!! Sony Cyber-shot DSC-W650 16.1 MP Digital Camera with 5x Optical Zoom the best pocket camera.. love the price and the foto cuality...", "Date": "January 11, 2013"}, {"Title": "Gorgeous", "Author": "D. Donohue \"dungha\"", "ReviewID": "R3B1NET9U9SQ6J", "Overall": "5.0", "Content": "I have an earlier version of this camera that I adore. This one was a birthday present for my Mom who envied my camera. She loves and it is a dream. Now I envy hers.", "Date": "January 9, 2013"}, {"Title": "Good value for the price", "Author": "GaryF", "ReviewID": "R1KV94O5KZXISY", "Overall": "3.0", "Content": "I had a previous cybershot that had a cracked screen, so I went with this newer model.  Takes great pictures, but it is slow between shots, or displaying photos.  Also, this camera (and none in the price range) have view finders anymore -- just the screen.  I prefer view finders especially in bright sunlight.  The camera is very thin and light and has a large lcd panel.", "Date": "January 9, 2013"}, {"Title": "Just Great", "Author": "Jashawn Dixon", "ReviewID": "R15E97D3N9AUBZ", "Overall": "4.0", "Content": "Just great and I love it.  Sony makes great products and I would buy more Sony items in the future", "Date": "January 7, 2013"}, {"Title": "Great compact camera", "Author": "dpres", "ReviewID": "R2RPQEQJ9DSTCZ", "Overall": "5.0", "Content": "I love this tiny powerfull camera. It takes beatiful pictures!. The panorama mode is amaizing!. For the price I highly recommend it", "Date": "January 6, 2013"}, {"Title": "Convenient to use and carry", "Author": "jay jeffrey", "ReviewID": "R2V3M0SCX5IFAO", "Overall": "4.0", "Content": "This camera was for my wife. It is small and easy enough for my wife use without any problems. She has taken 58 pictures so far and the quality is very good. If it came with carry case I would have given 5 stars.", "Date": "January 4, 2013"}, {"Title": "EXCELLENT", "Author": "Carla Hermoso \"CCHERMOSO\"", "ReviewID": "R1FHK4YRPU3KPY", "Overall": "5.0", "Content": "EXCELLENT PRODUCT!!!, IT IS FAST THE SHIPPED AND ATTENTION, THE COLOR IT IS NICE, I AM GRATEFUL, IT IS PERFECT", "Date": "January 3, 2013"}, {"Title": "Excellent", "Author": "Olga Aranguren", "ReviewID": "RHKDVIKFV7X40", "Overall": "5.0", "Content": "The item arrive on time.I recomend this product.The camara was beautifullI did choose this rating because is excellent", "Date": "January 2, 2013"}, {"Title": "wonderful pictures", "Author": "Catherine Shaffer", "ReviewID": "RWCO9ZGRL9LKW", "Overall": "4.0", "Content": "didnt like at first am getting used to it still needs something extra but will do for know until can afford a new and better one", "Date": "December 30, 2012"}, {"Title": "Awesome camera!", "Author": "Sachiko Nakata", "ReviewID": "R1QGIMHFGRZUGA", "Overall": "5.0", "Content": "I purchased this for my mom. It's really a beautiful camera and it work perfectly. Everything was brand new and the quality was awesome! Really recommended.", "Date": "December 29, 2012"}, {"Title": "Excellent", "Author": "Cora Roberts", "ReviewID": "R1I7TXJ1QXGL9E", "Overall": "5.0", "Content": "Gave this as a gift for Christmas, my mother loved it! She would not stop talking about all the features like the Panoramic View and Soft Face. It takes excellent pictures and 720 Video. I would recommend this camera to anyone who wants a good compact camera.", "Date": "December 28, 2012"}, {"Title": "Great Camera!!", "Author": "D. Bullock", "ReviewID": "R13D4KRNVGK8SH", "Overall": "5.0", "Content": "I bought this camera for my husband to take on his hunting trips.  He really likes it.  Says it is very easy to use and takes great photos!!", "Date": "December 28, 2012"}, {"Title": "Good item", "Author": "alvaro  castillo", "ReviewID": "R20FCWLY5LACCL", "Overall": "4.0", "Content": "Good item, It can in perfect conditions. I will enjoy it with friend and family. Great model and very useful.", "Date": "December 28, 2012"}, {"Title": "Excellent Camera", "Author": "Andres Blanco", "ReviewID": "R3JKSE2YUS3VT", "Overall": "4.0", "Content": "The high definition of this camera is aceptable and the price is excellent. I am very happy with this gift", "Date": "December 27, 2012"}, {"Title": "Great", "Author": "Julio soares", "ReviewID": "RDZ2G7C9GCGZC", "Overall": "5.0", "Content": "Very good camera. Looks cool. everything works just fine. The quality is great as always so what else can i ask for?", "Date": "December 27, 2012"}, {"Title": "Solid camera", "Author": "lovepups", "ReviewID": "R3E4YLTS6S7ZQO", "Overall": "5.0", "Content": "This is my third Cybershot camera.  I only upgrade to increase the megapixal count.  They are inexpensive, reliable, and take great pictures.", "Date": "December 27, 2012"}, {"Title": "i loved it", "Author": "Rebeca Lucero", "ReviewID": "R363GQ431W6SVQ", "Overall": "5.0", "Content": "I loved it, it met my expectations,I used my kamara always and I dont have any problem at the moment of used it.....", "Date": "December 26, 2012"}, {"Title": "Sony Cyber-shot Camera", "Author": "Morgannmm", "ReviewID": "R1X910M4P965RS", "Overall": "5.0", "Content": "I love this camera, it has great quality and takes wonderful pictures. I would highly recommend this to someone if they want a great camera at a great price.", "Date": "December 26, 2012"}, {"Title": "My boyfriend loved it!", "Author": "Heide W", "ReviewID": "R1KIY63XZOC8FS", "Overall": "4.0", "Content": "My boyfriend always complained about his old camera so I got him this one for Christmas, so far he seems to be having the time of his life with it.  He likes to make youtube videos with his friends so he uses his camera often", "Date": "December 26, 2012"}, {"Title": "Great camera!", "Author": "Bassman 8990", "ReviewID": "R14EEELQB069KZ", "Overall": "5.0", "Content": "Was a present for my mom for Christmas Day! She used it & loved it. It takes very clear pics & the Chrome touches on the black camera were nice! I would recommend this camera to anyone at any level or use this as a first digital camera!", "Date": "December 26, 2012"}, {"Title": "camara", "Author": "margoth conde castillo", "ReviewID": "R3UP9VU1JPF163", "Overall": "5.0", "Content": "excellent product recommended ....... not regret if you buy ... works great .... I have not had any problems so far .... good buy ... recommended", "Date": "December 24, 2012"}, {"Title": "camara", "Author": "Alberto Sanchez Perez", "ReviewID": "RGNTCDE6TKNR3", "Overall": "5.0", "Content": "siempre hemos comprado camaras sony una w-90  una a550 y ahora esta es muy versatil y la calidad de las fotografias y videos son excelentes", "Date": "December 24, 2012"}, {"Title": "Great Camera!", "Author": "Amazon Customer", "ReviewID": "RF1XLHSYM4753", "Overall": "4.0", "Content": "This is a great compact camera! I am really impressed with the picture quality for an entry level camera. Sony does a great job with the Cyber-shot line! I would highly recommend this camera for an on-the-go camera that fits easily in your purse/pocket. The camera also feels sturdy and well-made!", "Date": "December 24, 2012"}, {"Title": "works wonders.", "Author": "Joanna", "ReviewID": "R1W5113Q5QWR9E", "Overall": "5.0", "Content": "i am very pleased. i find myself wanting to tell everyone about my grreat camera. the pictures are beautifully clear.", "Date": "December 24, 2012"}, {"Title": "cool Camera", "Author": "Mike Ecu", "ReviewID": "R2K2UHOKROESRU", "Overall": "5.0", "Content": "I bought this camera as a gift for my wife. The camera is light, it takes nice pictures. During the night it seems to have a little bit of trouble when there is not enough light, I mean the light from the living room, because the pictures look a little bit yellowish. Other than that I think it is a good camera.The price was Ok I think", "Date": "December 21, 2012"}, {"Title": "Good purchase", "Author": "garykwan1981", "ReviewID": "R281WESCCNLHLJ", "Overall": "5.0", "Content": "Arrived on time...Good pricing for the package. Don't miss it. This is one of the best deal on camera ever.", "Date": "December 18, 2012"}, {"Title": "Christmas Gift", "Author": "Dmoyer", "ReviewID": "R20REHH9NPF5UP", "Overall": "5.0", "Content": "Great Camera! It's a Christmas gift,so I took it out of It's box and charged the battery and put a sim card in it so it would be ready for my wife to record and take photos for Christmas. Hope she likes the red She did have a Sony Cybershot 12.1 Mp Pink so i hope the 16.1 Mp makes up for the pink to red :)Derek M", "Date": "December 18, 2012"}, {"Title": "the best", "Author": "Cristal", "ReviewID": "R1DDX9ZPMKX6HZ", "Overall": "4.0", "Content": "takes very nice pictures!! I upgraded from a 7.2 MP to this 16 MP one and i am very pleased!!", "Date": "December 17, 2012"}, {"Title": "Love the Cyber-shot past & present", "Author": "Jo Ann Pellegrini", "ReviewID": "R31FND9XVVMX06", "Overall": "5.0", "Content": "I had a previous year's model & loved it. Took good photos, was easy to use, small enough to fit in purse or pocket. I left the old one out in the rain & ruined it. So, I didn't think twice about ordering the newer model of the same camera.", "Date": "December 14, 2012"}, {"Title": "Good camera", "Author": "Lowell Wylie", "ReviewID": "RO0ARX9YQJ7OX", "Overall": "4.0", "Content": "I purchased this model because my Kodak camera broke and they do not make that model anymore. I was disappointed that this camera did not do date stamp, which I need for my job pictures. This is a very good camera for everyday pictures. I also purchased one for my daughter.", "Date": "December 13, 2012"}, {"Title": "it's okay", "Author": "Sherry", "ReviewID": "R29P0WSHZWPYL5", "Overall": "3.0", "Content": "it's okay for the price, but expectting the shotting and image access review button react faster. Previously owned the DSC-T300, like the old one better.", "Date": "December 11, 2012"}, {"Title": "It made a great gift", "Author": "Bronson Glover", "ReviewID": "RK5V7TSCEGBFY", "Overall": "4.0", "Content": "I like it because you don't have to know alot about photography to take a good picture, but it is a little difficult to make changes if you want to tweak somthing.", "Date": "December 8, 2012"}, {"Title": "Exellent", "Author": "Ricardo Gonzalez", "ReviewID": "R3BY5E1YPNT5NH", "Overall": "5.0", "Content": "Exellent product and very good for my son and this chritsmas this year. Just what i want for he now", "Date": "December 6, 2012"}, {"Title": "Great gift for mom!", "Author": "Amit Verma", "ReviewID": "RJ6FB2PNBTKRZ", "Overall": "5.0", "Content": "My mom loves this camera.  Granted she doesn't use her camera or laptop all that often, but whenever she pulls this out she smiles.  On the camera itself, the picture quality is amazing, it's easy to use, and that cherry red color on it looks awesome.", "Date": "December 5, 2012"}, {"Title": "Excellent Camera", "Author": "Jen", "ReviewID": "R12VYAHNJU9UJ4", "Overall": "5.0", "Content": "I truly love this camera.  The pictures are so sharp and clear, no matter what the lighting conditions.  And as someone who has very shaky hands, this camera is perfect.  I haven't had a single picture ruined by shaking!", "Date": "December 5, 2012"}, {"Title": "Cool but looks very cheaply built.", "Author": "Anthony", "ReviewID": "R2U5KJ8HNERETY", "Overall": "3.0", "Content": "It snaps great photos but sadly the video performances is okay as the lens make hell a lot of noises when zooming during video hence making the sounds recorded very bad. Besides, it's very obvious that it's cheaply built as the quality of the camera exterior really looks very unstable and doesnt feel \"solid\".", "Date": "December 1, 2012"}, {"Title": "Great cost vs benefit", "Author": "Jose Almeida Jr", "ReviewID": "RUBY6LFR3RMEH", "Overall": "4.0", "Content": "Good camera! The life time of the battery is really good. The qualitty of the photos is really good too. The panomara opition is amazing. The video recoarding is enough for ehat I want. Good choice!", "Date": "November 29, 2012"}, {"Title": "Not as good as it should be...Screen is blurry", "Author": "SpeedingCheetah", "ReviewID": "R2NR81FJX2OEON", "Overall": "2.0", "Content": "I received this camera as a gift. I was previously using a Kodak EasyShare C143. The Kodak took sharper pictures and had more fine detail almost every shot. The C143 is a 12MP camera that takes pics at 4000 x 3000 at 480dpi.  This Sony camera DSC-W650, is 16.1MP and takes pics at 4608 x 3456 at 350dpi.I also compared it to my older 8MP Kodak ZD8612 IS....(3264 X 2448 at 480dpi) and those pics are still a bit sharper and clearer than this new Sony camera.The C143's auto focus was faster and noticeably more accurate than the Sony's...almost all of my pics are clear and detailed..on the Sony, lucky to have half of them turn out.I mostly take pics indoors, and the Sony's flash isn't that great. Low light performance is poor. Pictures loose significant detail at higher iso's.The HD video recording on this camera is great, definitely much better than the 2 other cams, but they aren't HD..so no real contest there.One thing I really like about this camera though, is it has a \"Easy Mode\"...where is makes the text big and camera VERY simple to use...dumbed down menus, locks out everything except pure basic functions... for those people like my folks can use...just point and press button. My 70yr old Grandma would really like that...Assuming she could remember how to turn the camera on...lol.I also noticed the LCD screen display is quite fuzzy and distorted, no where near as sharp as my old Kodak...even the text on the screen is phased out and blurry...hard to read..the screen seems to flicker or...just look out of sync...or something...hard on the eyes...and if you look at the screen from any other angle other than straight at it....eye level..it is super blurry, very bad viewing angles.I contacted Sony support...spent over an hour on the phone going through their stupid \"idiots\" method of troubleshooting, resting camera, pulling battery in and out, etc...I HATE THAT!!!... finally, the guy in India told me they will accept the cam in for repair this one time...even though I could not produce a receipt. Annoying to have to pay to ship defective things back to companies...they should cover shipping both ways, since it was their fault their quality control missed it....but...yea...what company ever does that nowadays..will update once i get cam back in..o..whenever they decide to...UPDATE: Just picked up this: Panasonic LUMIX DMC-ZS19 Digital Camera- Black  Like it much better. See my review their.UPDATE 12/27/12: Sent in cam for repair. Had to pay to ship it to them. Got call from Sony a week alter \"technician found nothing wrong\". I re-explained the issue with the lcd screen...the guy (who could barely speak English) took about 10 min of explaining to realize a hardware issue..then he quickly told me \"I update and we work on it\"...2 hrs later I get an automated email from Sony stating the camera is being shipped back to me.Received it today...and can't tell any difference. The included paperwork has marks on it indicating the lcd panel was replaced and the camera cleaned and lubricated, but the screen still looks horrible fuzzy and the menus still have a a flicker effect to them. The screen has poor viewing angles. No where near as sharp and clear as the Panasonic ZS19 camera I bought to replace this one. Despite the poor quality lcd, this Sony seems to take decent pictures, they look fine on the computer. Just annoying, as you may not be sure the picture you take is in focus or blurry or not, as the pictures always look blurry on the built in screen.", "Date": "November 28, 2012"}, {"Title": "good", "Author": "Rodrigo Gama", "ReviewID": "RP8HGGXWKNUW5", "Overall": "5.0", "Content": "I need this product and it is very good choose, I like so much my choose and  I recommend from my friends", "Date": "November 26, 2012"}, {"Title": "Excellent", "Author": "Rajiba Lochan Panda", "ReviewID": "R2RPN8EW4NUB7J", "Overall": "4.0", "Content": "Sony cyber-shot a good digicam. It got delivered on time and packing was awesome. I can recommend this. If a 4GB memory card , tey can provide with pack na, it will be awesome, otherwise need to buy separately.", "Date": "November 24, 2012"}, {"Title": "all flawless", "Author": "Edwar Castaño", "ReviewID": "R9SWS2M26UY27", "Overall": "5.0", "Content": "What else can you ask such a small camera tine many useful features and the images are perfect panoramic system is spectacular", "Date": "November 10, 2012"}, {"Title": "nice camera", "Author": "islandrd", "ReviewID": "RBC97LMNRFNXS", "Overall": "4.0", "Content": "This is not for taking rapid photos but works great for everyday use. They should have an automatic shut off for the camera after downloading pictures otherwise it stays on and runs the battery down if you do not shut it off manually .", "Date": "November 2, 2012"}, {"Title": "Great camera", "Author": "tloi913", "ReviewID": "R22R1PMSQVAY1Y", "Overall": "5.0", "Content": "I bought this camera for my Japan trip and I'm very impressed with how all my pictures came out! without this camera I would have no pictures bc I lost my phone in Japan :( Great product", "Date": "October 18, 2012"}, {"Title": "Nice handy cam for everyday use", "Author": "An ordinary voice", "ReviewID": "R4U6YFTTAO1YE", "Overall": "4.0", "Content": "I bought the SONY Cyber-shot after my CanonPowershot was water damaged and is no longer functional. While I am still partial to the picture quality of my Canon, I have begun to appreciate the PowerShot after playing around with it's various settings (eg Toy - to get a vintagy look, Pop - to pop colors etc). I think price-wise, it is a good camera and a handy one to have for trips and various occasions when you don't want to lug around a huge DSLR.", "Date": "October 18, 2012"}, {"Title": "AWESOME!!!", "Author": "pen name", "ReviewID": "R1N7U5DZK3L0DZ", "Overall": "5.0", "Content": "The camera was awesome! I enjoy it a lot. The pictures are amazing. I would totally recommend this camera to others. It's a must have. I love this camera.Great Thanks!", "Date": "October 16, 2012"}, {"Title": "Great camera", "Author": "RNreader", "ReviewID": "ROYDVA1J2UQCN", "Overall": "5.0", "Content": "Product exceeds expectations of picture quality. Easy to use. No complaints. Very satisfied with camera, especially for the low purchase price.", "Date": "October 14, 2012"}, {"Title": "Sony cyber shot", "Author": "Shopper1", "ReviewID": "R1729EQYA1U605", "Overall": "5.0", "Content": "Camera takes great pictures. . Easy to  operate  small easy to carry. Sony quality is something that you can always count on", "Date": "October 6, 2012"}, {"Title": "Class Reunion", "Author": "Audrey", "ReviewID": "ROIF00T2GZAGG", "Overall": "5.0", "Content": "I purchased the Sony Sure Shot from Amazon to take to my 60th High School Class Reunion. It was easy to use and light to carry and travel with. Pictures came out great. I would recommend it to anyone looking to buy a new camera", "Date": "September 28, 2012"}, {"Title": "lovely", "Author": "divinely", "ReviewID": "R1HFHS65BFMXEG", "Overall": "5.0", "Content": "it's cool and handy. adjusts easily and long battery life. portable and light with a very sharp image adjusts easily to light and to top it up it detects smile n captures though a bit slow but it cool.detects love it", "Date": "August 10, 2012"}, {"Title": "Great camera for the price.", "Author": "Luijo", "ReviewID": "R17Y7UTMO31G1V", "Overall": "5.0", "Content": "Great camera for the price, good panorama pictures.Daylight pictures got a nice and decent quality, nightlight pictures are sometimes blurry.", "Date": "August 6, 2012"}, {"Title": "Quality of the product", "Author": "DEWAN", "ReviewID": "R1FH5KQHJKRVL6", "Overall": "5.0", "Content": "i must say this product has been  a well made product due too i am very satisfied with the quality of the pictures", "Date": "July 26, 2012"}, {"Title": "Sony Camera", "Author": "Michael L. Pettegrew", "ReviewID": "R1B7AOWMSYMZSJ", "Overall": "5.0", "Content": "The camera was purchased as a gift for a special friend and upon that persons receipt, they were overwelmed with the camera and its capability.  Very Satisfied.", "Date": "July 10, 2012"}, {"Title": "Very happy", "Author": "Em", "ReviewID": "RQ4MMFJ7N07Y", "Overall": "5.0", "Content": "I must say that I was very happy to receive my camera in a greatly timly manner and packaged well exactly what I was looking for, thanks Amazon...Sony Cyber-shot DSC-W690 16.1 MP Digital Camera with 10x Optical Zoom and 3.0-inch LCD (Silver) (2012 Model)", "Date": "July 5, 2012"}, {"Title": "Love it", "Author": "Chanise", "ReviewID": "R1FJEMCVQCZ1PN", "Overall": "5.0", "Content": "Bought like like new as there said when i got it it looked brand new to me. I love all Sony product n they jus made my day when I got it.", "Date": "April 30, 2013"}, {"Title": "poor instructions", "Author": "The Singer", "ReviewID": "R3U1PZ6455VZQM", "Overall": "3.0", "Content": "I like the camera, however the instructions are poorly written - don't understand how the video works and that is the main reason I purchased itl", "Date": "January 5, 2013"}, {"Title": "My dad loves it", "Author": "H. Cline \"hollymolly\"", "ReviewID": "R31TXYUJLG0FHO", "Overall": "5.0", "Content": "My parents are in their 50's and I got this camera for their trip to the east coast. My dad was able to use it well enough to get some great shots while they were whale watching. My mom has a bit of a problem focusing the camera, but she's not particularly \"tech-savvy\". The case is really nicely padded and even with the case the camera is still thin enough to fit in my dad's pocket.", "Date": "December 28, 2012"}, {"Title": "sony", "Author": "Iris Reinhardt", "ReviewID": "R37QE3RDQFKPGY", "Overall": "4.0", "Content": "works great pictures clear and small compact camera will fit in purse easily.  would recommend to anyone looking for a new camera", "Date": "November 19, 2012"}, {"Title": "Piece of junk", "Author": "sswy", "ReviewID": "R31ZXN6WLG3AV8", "Overall": "1.0", "Content": "I bought this camera in August, 2012 and -- maybe I don't know what to expect from a low-end camera -- but it's very disappointing.  It's so bad I almost wonder if mine is defective.  I shot a bunch of pictures on a trip in \"Program Auto\" mode (differs from \"Intelligent Auto\" mainly in that you can set the ISO).  Where to start?Calling it 16.1 megapixels is a joke.  At full resolution, the images are so grainy and posterized that they are unusable for any purpose.  You can get OK images for sharing on the web by resampling them down to about 300,000 pixels (i.e. reduce 98%) and then sharpen in Photoshop.  But it would be easier to just buy a 1-megapixel camera and avoid the extra work.  The camera has low-resolution settings, and I will try those in the future.  Perhaps part of the problem is excessive or sloppy jpeg compression, but the camera seems to have no setting that would allow you to capture raw images even if you wanted to.The camera says it has 5x optical zoom, but fully zoomed, the pictures looked like taken through a fog that wasn't there.The camera has ISO settings up to 3200, but at 800 the quality is already so bad you might as well not bother (unless it's something urgent to photograph and you don't care about quality.)  At 400 the images are already notably degraded.The exposure metering is inconsistent.  If you start pointing at the sky, and then move down to your subject, you will get a very different image from when you start pointing at something dark and move to the subject.  The auto-focus (the only focus you get on this type of camera) is not very reliable, and quite a few images are poorly focused.  The auto-focus gets especially confused by shiny, metal objects like bronze statues.Contrast control is terrible.  Nearly every image has white burned in patches.  Sky on a cloudy day nearly always goes pure white.  I have used half a dozen digital cameras (OK, all more expensive), and this one is hands down the worst for chronic overburn.In program auto mode, the camera has a strange bias toward fast shutter and low depth of field (such as 1/320 at 3.5), so lots of images have needlessly blurred patches in the foreground or background (and you can't control that.)Perhaps I am being unreasonable, and a $100 camera is the digital equivalent of the paper box throw-away film camera, and it's not fair to expect anything in the way of image quality.  But sheesh.  The camera is so disappointing that I am tempted to put Sony down with HP on my don't buy anything ever list.  I hate to be mean but I would have saved $139 if someone had written this review six months ago.", "Date": "December 5, 2012"}, {"Title": "not worked", "Author": "Lisa M. Gadway", "ReviewID": "R1R6KH8T4AGNP1", "Overall": "1.0", "Content": "when I received my camera it wasn't working and I had to ship it out paying for postage to have it repaired. Took two weeks for repairs and the camera still isn't working. I am frustrated and don't know what I can do at this point.", "Date": "October 17, 2012"}, {"Title": "1", "Author": "michelle moscatel", "ReviewID": "RJ1YUASJZGS6C", "Overall": "3.0", "Content": "sony cyber shot dsc w65o 16,1 not working well takes bad photos lashed is broken does not close not happy with this order wouldlie to replace it thanks", "Date": "December 12, 2013"}, {"Title": "Not as advertised", "Author": "Phil & Pam Schulz", "ReviewID": "REFO37QPI3P32", "Overall": "2.0", "Content": "Not as advertised, came with 4G card memory card not 16G as advertised and also came with different  case not as nice as advertised. This was a bundle but not the Father;s Day Bundle advertised.", "Date": "December 4, 2013"}, {"Title": "Excellent", "Author": "HERMAN PIÑEREZ", "ReviewID": "R298HPTB1WZ2WI", "Overall": "5.0", "Content": "Excellent care, very friendly and cordial, the purchase was made so easy and secure. Highly recommend them. They are excellent high-quality sellers.", "Date": "November 27, 2013"}, {"Title": "Very Good Purchase", "Author": "Ivan Torrez", "ReviewID": "R2S23N6B8QF6WC", "Overall": "5.0", "Content": "Very good buy and excellent product of very good quality and excellent price very satisfied with my purchase thank you very much and very good buyed of good quality good", "Date": "September 16, 2013"}, {"Title": "Excellent", "Author": "Esteban", "ReviewID": "R3VNOA5O06MRSC", "Overall": "5.0", "Content": "I actually really liked this article, is excellent and is of good quality and I recommend others to buy it.", "Date": "September 2, 2013"}, {"Title": "This thing stopped working within a year", "Author": "R. Anaya", "ReviewID": "R27Y1WT1GO6VFM", "Overall": "1.0", "Content": "What a piece of crap from Sony.  I know you want me to buy one every year, but I will invest in something more substantial from a competitor in the future.", "Date": "July 18, 2013"}, {"Title": "good cam", "Author": "Abhijith S.", "ReviewID": "R2XYFPFN0IYEH6", "Overall": "4.0", "Content": "It is very good cam with good price and I liked the specifications very much. Please have more like this", "Date": "June 17, 2013"}, {"Title": "Mother's Day present", "Author": "clytn", "ReviewID": "R2FUGIPVZ4TCC7", "Overall": "4.0", "Content": "Got this for my mom last year and she loves it. She switched from a Kodak that was slow to take pictures. So she is very happy with this. She is capturing all of her first grandchild's precious moments. Image quality is good. Screen is easy to view pictures. Settings and buttons are simple.", "Date": "June 9, 2013"}, {"Title": "Very Compact", "Author": "Shreddy", "ReviewID": "R22KVC49JLQFQF", "Overall": "5.0", "Content": "This camera is very slim and lightweight and attractive in appearance. it is user friendly - am glad I decided to purchase another Cybershot.", "Date": "June 5, 2013"}, {"Title": "Just the right size and need.", "Author": "Deb", "ReviewID": "R1AVOUUD7DH1LC", "Overall": "5.0", "Content": "I moved to a beautiful area and wanted something I can put in my purse and keep with me at all times.  This is perfect.  The pictures come out well and it's easy to use.", "Date": "May 31, 2013"}, {"Title": "fits in my pocket", "Author": "peggy grissom", "ReviewID": "R3MNQHXQLNV9XN", "Overall": "5.0", "Content": "Easy to use AND takes GREAT pictures. I am extremely happy with it!!! The pictures are great even in a moving car!! AND IT'S RED!!!", "Date": "May 21, 2013"}, {"Title": "good product", "Author": "Grant M. Weathers", "ReviewID": "R3IGDTL4V08SQY", "Overall": "5.0", "Content": "It was just was the description said it was  my wife enjoys it alot it is now the main one she uses and takes with her when we go on trips", "Date": "May 17, 2013"}, {"Title": "perfect camera to take on a trip", "Author": "elementary ed", "ReviewID": "R2XM5Y59ZXAR7Y", "Overall": "5.0", "Content": "Easy  point n shot  great for capturing memories  stills or videos in one small package  good battery life but would suggest additional battery always makes sense to have backup battery", "Date": "May 16, 2013"}, {"Title": "Lots of slightly blurry photos", "Author": "Coffeetigo", "ReviewID": "R35EABGBWKLC02", "Overall": "2.0", "Content": "Have had this camera for almost one year. I have tried every function & scene selection but many pictures are blurry.I do not like this camera at all.", "Date": "April 25, 2013"}, {"Title": "SUPER", "Author": "KAREN PARRA", "ReviewID": "RXLXU84O6P1A0", "Overall": "5.0", "Content": "Super!!! Me encanto este procucto y entrega rápida. Espero que sigan siendo cumplidos con las entregas, exitos super bueno el servicio!!!", "Date": "March 11, 2013"}, {"Title": "good", "Author": "Maria Andreina Cañizalez Cordero", "ReviewID": "R1LWBTOGF9X5UN", "Overall": "5.0", "Content": "gracias, todo llego en muy buen estado, y la camara es espectacular, llego a tiempo y en buen estado gracias", "Date": "March 4, 2013"}, {"Title": "Sin recibir el paquete", "Author": "Rosa Montilla", "ReviewID": "R20YJYB2Z9416C", "Overall": "1.0", "Content": "Buenas tardes.Me gustaría saber cuando será entregado el paquete.En el seguimiento indica que ha sido entregado, sin embargo no sé a qué entrega se refieren,Espero sus comentarios.saludos", "Date": "February 26, 2013"}, {"Title": "Excelente", "Author": "GermanRosario", "ReviewID": "R3NJKB2VOJ3ZBF", "Overall": "5.0", "Content": "Camara de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena Ropa de muy buena calidad 100% buena", "Date": "February 15, 2013"}, {"Title": "I cant use this product even for one week.", "Author": "Jagan Mohan Karapakula", "ReviewID": "R2CCL2C6K0B5YU", "Overall": "1.0", "Content": "I cant use this product even for one week. Its spoiled on one week. I have to pay $100 to repair this.", "Date": "January 7, 2013"}, {"Title": "Very good camera", "Author": "Anise Booker", "ReviewID": "R3H9R4RD7EMADA", "Overall": "5.0", "Content": "I need a camera on a trip I was going on in a few days. I read a bunch of reviews and decided to get this one. It was a decision. No complaints.", "Date": "December 5, 2012"}, {"Title": "Excellent camera", "Author": "Patricia Fowler", "ReviewID": "RKXEO93FKLEJU", "Overall": "5.0", "Content": "I love this camera, bought as a backup camera for 10 country trip thru South America. Easy to use great value", "Date": "November 20, 2012"}, {"Title": "Sony Cyber-shot DSCW650 16.1 MP Digital Camera with 5x Optical Zoom...", "Author": "Donna", "ReviewID": "R3843A2UQAU9Q6", "Overall": "5.0", "Content": "I have this camera and purchased it as a Christmas gift. It's small, compact and perfect for a sweater or jacket pocket so you always have it available to whip out and catch that special moment.", "Date": "November 19, 2012"}, {"Title": "Small and Does a Good Job", "Author": "Ximena A. Schneider \"Shoeholic\"", "ReviewID": "R13SKHF0SDZEN9", "Overall": "5.0", "Content": "I gave this as a gift to my son.  He likes it very well.  It is easy to carry especially when traveling.", "Date": "November 18, 2012"}, {"Title": "Relatively moderate to good product for the money.", "Author": "Bruce", "ReviewID": "R1CL1MHL4CI1MC", "Overall": "3.0", "Content": "Thus far, the camera is for the most part user-friendly.I'm sure I will feel more confident in its ability to capture crisp, clear digital images after I become more accustomed to its features.Clear Close-ups & rich,genuine color are two areas I am most concerned about.Bruce Penn", "Date": "October 22, 2012"}, {"Title": "Great camera!!!", "Author": "Ag1717", "ReviewID": "RZZ6FYSQDC7X7", "Overall": "5.0", "Content": "Decided to buy this camera after using my Sony Cybershot W120 for the last few years.  Camera came quick to my house and started to use it right away.  Camera very super easy to use and takes great photos. I would recommend this great camera to anyone that wants to take nice photos easily.", "Date": "June 3, 2012"}, {"Title": "Great camera", "Author": "Brenda R.", "ReviewID": "R3L8YOWNKP0D2B", "Overall": "5.0", "Content": "Great camera! I love the compact size and the quality of images. Didn't take me long to learn all of the specs. I will be purchasing another camera for my stepmother's birthday present.", "Date": "June 1, 2012"}, {"Title": "Muy buen producto", "Author": "Edwards Mena \"MrComandoIM\"", "ReviewID": "RFSTMIWVEDTZB", "Overall": "4.0", "Content": "La camara me llego en su caja original sellada, el cargador, la bateria y otros accesorios, tal cual se muestra en la oferta. el producto es de buena calidad y lo recomiendo por su costo. esta misma camara en mi pais cuesta unos $60 mas. entonces si hay ahorro, cabe indicar que compre tambien la memoria de 4GB muy barata en conclusion la compra fue un exito.", "Date": "June 16, 2012"}, {"Title": "Price changed and Bad Camera Screen", "Author": "Robert Rojas", "ReviewID": "RT6KACSPYUK8E", "Overall": "1.0", "Content": "I am disappointed . When I turned on the camera, the screen has several horizontal lines has permanent manufacturing defects.", "Date": "November 6, 2012"}, {"Title": "its good", "Author": "Jose", "ReviewID": "R3W4QLZGP4843X", "Overall": "5.0", "Content": "This was a gift for my girlfriend.She saw from that was struck by how beautiful she is ..we use a lot in our last anniversary, takes photos very well, the image quality is excellent and the videos also.It's made of materials can be very ligedos notes that almost toy but does its job and quite well.", "Date": "January 21, 2013"}, {"Title": "Camera is great", "Author": "Shirlie Newbold", "ReviewID": "R2RKBKGGH6OSW6", "Overall": "5.0", "Content": "I had a camera like this one and it was stolen so I got another just like it.  Love it", "Date": "November 22, 2012"}, {"Title": "Buen producto", "Author": "MILTON", "ReviewID": "R178OJZ40X5ER1", "Overall": "4.0", "Content": "Buen producto, se ajusta a las necesidades familiares, fácil manejo, lo recomendaría para ir de paseo o en cualquier ocasión familiar", "Date": "July 4, 2012"}, {"Title": "Worth single penny", "Author": "Joline", "ReviewID": "R2G2W8F6SMPEWF", "Overall": "5.0", "Content": "I love it for 2 main reasons. #1. The price. You get a GREAT camera for a little over $100. #2. It has the soft skin feature which I LOVE because I have blemishes and it completely wipes it out without me having to put make-up on.", "Date": "March 10, 2012"}, {"Title": "used stuff is not great, it has a broken cracker", "Author": "Charlie", "ReviewID": "RDBAY7WQJGOUP", "Overall": "2.0", "Content": "I bought a used one 2 month ago. Everything looks good until I found a cracker between anterior and posterior cover of the camera. It did not show any functional problem yet, however it made me unhappy. In general, this camera is light, portable. It also has a good resolution. I just hope it will be OK in mechanism because of body damage. I think seller should tell this broken.", "Date": "November 13, 2012"}, {"Title": "Sonys are great!", "Author": "Carole Klein", "ReviewID": "R3L61MSRRATMU8", "Overall": "5.0", "Content": "I bought this item as a donation for a Fremont (CA) Symphony raffle, so I have not actually used it, but I have the Cybershot W-290 and I adore it.  I'm assuming that this camera works at least as well, which is fabulous!  On mine you can take Youtube quality videos  (see Goldengatebrass.com), and the photo quality is the best I've seen.  When it comes to photo and video, Sony rocks!", "Date": "May 28, 2012"}, {"Title": "NOT", "Author": "DIXIERUDD", "ReviewID": "R28ZGDIR6ZZCP", "Overall": "2.0", "Content": "I have used this camera very little. I am NOT impressed with the quality. The size of the camera was what I wanted but I am dissappointed. Especially since it is a SONY! If you are looking for a camera on the GO, keep looking.", "Date": "June 6, 2012"}, {"Title": "POOR QUALITY LOW LIGHT PHOTOS", "Author": "KAE", "ReviewID": "R344L0IPGLUVMI", "Overall": "2.0", "Content": "I TOOK SOME LOW LIGHT PICTURES THE FIRST DAY I RECEIVED THE CAMERA.. THE QUALITY AND CLARITY OF THE PICTURES ARE VERY POOR.", "Date": "May 17, 2012"}, {"Title": "Question", "Author": "Hypotenuse", "ReviewID": "R26ST6IU8RJ8HK", "Overall": "5.0", "Content": "Hi! I'm Salome,  writting from Georgia. Can you help me? Please answer me: Is this Camera on elements or not?", "Date": "October 31, 2012"}, {"Title": "Camera with video", "Author": "Wesley Tyler", "ReviewID": "R7QV5TR55350S", "Overall": "1.0", "Content": "This was not what I was looking for.  I just wanted a camera that had regular batteries and was a point and shoot, but that was digital, so this did not fit my bill.", "Date": "November 24, 2012"}, {"Title": "That's trash.", "Author": "Dr. Genao", "ReviewID": "R35KL7FHLD7JBE", "Overall": "1.0", "Content": "I,m very ungry with this camera, because  it came brokeand it did not work. no function.that the first time that happen to mee.I stopped buying used thins.I need that Amazon that review used thins before sell them.", "Date": "October 21, 2012"}, {"Title": "getting to know you.", "Author": "James Tennier \"JT\"", "ReviewID": "RA3O30VTPDQNO", "Overall": "4.0", "Content": "Bought this Cybershot as a gift for my daughter. Took pictures and had nothing but problems transferring to PC.First opinion was negative.Since then, we've gotten to know the little bugger and are quite happy with it now. It took a meeting of the bytes and bits so to speak.Further update... Transferring to PC is just a matter of moving card to PC. Who'd of thought? Click and it's done. Learning is harder without a teacher. My daughter has taken hundreds of clips and photos of our grandson and loves this camera. It was me all along and perhaps an improperly solid battery connection... No issues since.", "Date": "May 5, 2012"}], "ProductInfo": {"Price": "$174.95", "Features": "Bundle includes a soft carrying caseand 8GB SD memory card.", "Name": "Sony Cyber-Shot Father's Day Bundle DSCW650/BFD", "ImgURL": "http://ecx.images-amazon.com/images/I/41DDciLLj9L._SY300_.jpg", "ProductID": "B007WT9E0O"}}