{"Reviews": [{"Title": "Bought for use with Free Track head tracking system.", "Author": "J. Phillips", "ReviewID": "R1VVW98BFXT57J", "Overall": "5.0", "Content": "I don't even own a PS3. This camera is strongly recommended for use with Free Track on a PC and for that it is working well. Set-up was easy and it does what it is supposed to do as far as Free-Track goes. I did not remove the IR filter and I don't know if the one I got is the easy or hard one to remove. I am using a piece of un-exposed, developed camera film with both sides covered in black magic marker  as an IR bandpass filter. This is working reasonably well. The room I am using it in has windows from both sides and behind me so the light conditions are constanly changing during the day. This means I have had to adjust the settings as the light in the room changes. I am using a 3 point clip with wide angle IR LEDs. I am going to try running a little higher current to the LEDs to see if that will help with the ambient light conditions. But for now closing the curtains works good too. Of course if your not running Free-Track then none of this means anything to you.", "Date": "February 18, 2013"}, {"Title": "I got it for my PC, This webcam is surprisingly impressive for the price.", "Author": "Kherven", "ReviewID": "RZ94FHPJEV4CF", "Overall": "5.0", "Content": "I must be used to awful webcams, because I was blown away by this webcams performance. The FPS is great (FRAPs was saying 75 FPS) and the picture quality rivals a lot of affordable cameras. If you're used to picture lag or sudden movements causing the webcam to freak out, you'll be pleasantly surprised. The camera was able to easily keep up with rapid movements while keeping its high picture quality and FPS. The power (blue) light and recording (red light) are also a simple feature that leaves no question as to when the camera is on and/or capturing video.The only thing is I am using this as a PC webcam, not for the PS3. The PS3 eye was not made to be used for this and as such you won't be able to plug it in and play. You will have to install some third party drivers to make it compatible. However, a quick google search and 2 minutes of installing made this camera Skype ready along with other programs.I would recommend this to anyone wanting a PC webcam!", "Date": "May 31, 2013"}, {"Title": "Cool", "Author": "Charles Patterson", "ReviewID": "R1A36H9444UXU1", "Overall": "4.0", "Content": "I got this on time. I hooked it up and tried it out. Works great. I recommend getting the little stand for it to hook to the top of your television however otherwise, it wobbles and falls constantly.", "Date": "July 2, 2013"}, {"Title": "ten captures outta 10%%%%%%%%%%", "Author": "Movieskinny \"WayneG\"", "ReviewID": "R13B8M9ZDZHRLY", "Overall": "5.0", "Content": "Cheapest fun you are going to have on a PS3! I had a Kodak cam years ago that had very cool fun software. You could manipulate pictures, morph them, twist them, color them, and have a blast with your kids. PS Eye does all this too. The software is free at Playstation Network Store. I've only used mine a few times and got my yucks worth.There is also a couple of programs I grabbed at PSN. There is a fish tank that you can interact with, and another that moves with your movements. Another one that I haven't tried yet, is the time lapse picture snapping. In other words, I think you can use it as a monitoring camera which will take pics at certain intervals.It's twenty bucks, give it a whirl. Oh, and it does a lot more too, I just don't have all the other gear for it.", "Date": "May 6, 2013"}, {"Title": "I like it", "Author": "luis", "ReviewID": "RM6S6HT3NGB7I", "Overall": "4.0", "Content": "well, I liked this product because have a nice look,  the play Station style  and is easy to  use :)", "Date": "March 6, 2013"}, {"Title": "awesome price", "Author": "eddy", "ReviewID": "RA3RT3W43PAS9", "Overall": "5.0", "Content": "After browsing around for a while I came across this item for a decent price. I am very satisfied with my order. The delivery was very speedy and the item was brand new just as described. Very pleased", "Date": "March 1, 2013"}, {"Title": "1 Problem", "Author": "TINA D WRIGHT", "ReviewID": "R3NGLPTV85AV12", "Overall": "4.0", "Content": "Great service and arrived early . But I don't know if it's just me but the color has been going out on the cam in about 3 months of purchasing the cam :/", "Date": "May 19, 2014"}, {"Title": "small and qt", "Author": "anjo", "ReviewID": "R1GUYQV5FGZ697", "Overall": "5.0", "Content": "kind of fun,my kids love this toy.they chatting with friends by this toy and having fun,also i love to watching those kids playing....", "Date": "March 14, 2014"}, {"Title": "Really good for webcam", "Author": "WoWees8", "ReviewID": "R1F8R48MG0SJ0Y", "Overall": "4.0", "Content": "This can be used for pc which is what i use it for, and it makes a great webcam, it shoots at 70 fps and i believe 480p and if i had any complaints is the blue light is really bright but i just cover that up. also i wish there was a way to disable auto light adjust but besides that this is great!", "Date": "March 14, 2014"}, {"Title": "Good one", "Author": "Paraguayo-Tekorei", "ReviewID": "R26ZPTT40PB865", "Overall": "5.0", "Content": "Bought it used, no complaints, works fine for any play station 3 model, so much fun to play move games.", "Date": "March 13, 2014"}, {"Title": "It was new just repackaged", "Author": "juan carlos pino", "ReviewID": "R1JI2NIHYSMI6C", "Overall": "4.0", "Content": "The camera is just one piece accessory, all you need to do is connect it to the Playstation 3 and calibar it to the controller. Very simple process.", "Date": "March 10, 2014"}, {"Title": "Eye like it", "Author": "travis h biglow", "ReviewID": "RSD2DK1ICHSY4", "Overall": "5.0", "Content": "Item arrived on time and as described. Connects easily and works great. I recommend the optional camera mount, as it is not wireless and the cable can be an issue when putting camera where yo wont it.", "Date": "March 5, 2014"}, {"Title": "Still haven't used them...", "Author": "Jared Murch", "ReviewID": "RVCR2FMTPOQEE", "Overall": "5.0", "Content": "The seller was great! I got these a day or two early. I wanted to try them, so I could review the product. Unfortunately, I didn't realize that by choosing these for my motion capture software, I needed a 1/2 circle of space 27ft in diameter against a light colored wall and ground plane to utilize... Oops! I forgot to buy a gymnasium.. Can I buy that on Amazon? LOL", "Date": "February 11, 2014"}, {"Title": "Great Fast Shipping Works Perfectly", "Author": "Kassem Kassem", "ReviewID": "R3LCWEVVB917TT", "Overall": "5.0", "Content": "It came in the first day of the estimated time. It works perfectly. It came in reboxed like it says and it was a dusty but nothing you can wipe away. Everything was great so I gave it 5 stars.", "Date": "February 10, 2014"}, {"Title": "Excellent product and a good price!", "Author": "alfonso bello consuegra", "ReviewID": "R7ZA9H6500C33", "Overall": "5.0", "Content": "The product came to me well and on time, without any problem, I'm already using and it works perfectly, totally recommend.", "Date": "February 8, 2014"}, {"Title": "Using it for 3d scanning of objects", "Author": "Markham M THomas", "ReviewID": "RDL7SXZY4YJOD", "Overall": "5.0", "Content": "This product works great with Linux and provides me a camera to observe a 3d object with running a line laser across it.  This allows me to make a printable 3d object with it.", "Date": "February 4, 2014"}, {"Title": "Half price item!", "Author": "richard anderson", "ReviewID": "RHVTCQ878EHOT", "Overall": "5.0", "Content": "I work for Amazon.Fulfillment, so with my gift card during this peak I bought me a present. I waited till the last minute so the price would drop, Half Price!!", "Date": "January 24, 2014"}, {"Title": "Camera", "Author": "Velashia", "ReviewID": "RV8WBCIR0WFK5", "Overall": "5.0", "Content": "This was a gift for my 14 yr Old son. He love this it allow him to play online and the opponents see him. I would reccomend", "Date": "January 13, 2014"}, {"Title": "buy in bulk", "Author": "Leighann", "ReviewID": "R38JC1C6INBZYK", "Overall": "5.0", "Content": "I want sites what to expect when I learned this was going to be a bulk product. But to my surprise it was great! Package was great it just didn't come in the plastic bubble packaging you buy at the store.the kind no-one can open.  So that's a plus.", "Date": "January 9, 2014"}, {"Title": "Eye on you.", "Author": "Nick Corley", "ReviewID": "RZ57VUQAHGIV3", "Overall": "4.0", "Content": "I enjoy it. Great purchase. It works very well with my PS3. There's not too much I can say about it.", "Date": "January 7, 2014"}, {"Title": "It's like a gift from the NSA", "Author": "ShermanTech", "ReviewID": "RF7KUNENZ559D", "Overall": "5.0", "Content": "Yep, it watches what we do while playing games.  It's almost like Big Brother is keeping tabs on you, but it makes for a good gaming experience.", "Date": "January 4, 2014"}, {"Title": "Great Product!", "Author": "marian", "ReviewID": "R3C0WR6H8ER9UP", "Overall": "5.0", "Content": "This was perfect! exactly what we needed, and I actually liked the bulk packaging because  \"Santa\" brought it and didn't have to hide the packaging, It works great and is super easy to set up.", "Date": "January 3, 2014"}, {"Title": "Nice but", "Author": "A. A. Wiegering", "ReviewID": "RV2YYA3X03USM", "Overall": "4.0", "Content": "I still have to find out how to use it.... I wanted it to use Skype with my PS3..... we will see if can work", "Date": "February 3, 2013"}, {"Title": "Item as described, great purchase", "Author": "L.G.", "ReviewID": "R19TLPDW2S18DX", "Overall": "5.0", "Content": "Bulk packaging is the way to go, item was cheaper. Item as described- no problems with item works wonderfully well.", "Date": "January 28, 2013"}, {"Title": "Arrived Earlier than excpected", "Author": "Joseph Thomas", "ReviewID": "R3M8WZCNB3FB34", "Overall": "4.0", "Content": "It arrived in three layers of bubble wrap and was plug and play....It works great!No problems so far!Thanks", "Date": "January 19, 2013"}, {"Title": "I really liked the product so I hope they continue as hitherto met", "Author": "Alberto Coronel", "ReviewID": "R2C10DD25FA9K2", "Overall": "5.0", "Content": "The product arrived in perfect condition and I am completely satisfied with the product works great I really liked the product so I hope they continue as hitherto met", "Date": "January 15, 2013"}, {"Title": "My foster child loves this. he can talk on his playstation wiht his family that he cant see anymore on a day to day basis", "Author": "June George-Otugo", "ReviewID": "RE0E5VVZOO8QD", "Overall": "5.0", "Content": "My foster son loves this. he likes the idea of talking to his family members who he doesnt see on a day to day basis anymore", "Date": "January 11, 2013"}, {"Title": "i love it", "Author": "Liliana Vilchez", "ReviewID": "R345L8I3J8S7EX", "Overall": "5.0", "Content": "delighted, just what I was waiting, one of the perfect gifts for Christmas, my son loves, thank you very much hope to buy soon bye greetings", "Date": "December 16, 2012"}, {"Title": "Just what I needed.", "Author": "Jim Hayes", "ReviewID": "R1F8V46WBN4EL6", "Overall": "5.0", "Content": "Making a head tracking device for my PC. This fit the specifications. Worked wonderfully! Easy filter removal for those wondering.", "Date": "June 20, 2013"}, {"Title": "THIS CAMERA SEES EVERTHING.", "Author": "LORNE SANDY", "ReviewID": "R2A1INX76X1D5Q", "Overall": "5.0", "Content": "Typical of SONY, great product as per usual. It works so well, maybe I should put it to use as a security cam, just kidding. Good buy, try it and you'll see. Best Regards, Lorne Sandy.", "Date": "August 10, 2013"}, {"Title": "it was  new", "Author": "wes", "ReviewID": "R27R594LCRVQF3", "Overall": "5.0", "Content": "hopn use cam part soon  mic works grrreat  hope get a video game use cam part soon  no porn site see ps3 cam part", "Date": "June 21, 2013"}, {"Title": "Works well", "Author": "Marcus Vinicius Rangel Renno", "ReviewID": "RC89L9YAN0Q3V", "Overall": "4.0", "Content": "It works well, but it doesn't provide any excellent feature and the image is not soo good.If you don't have a webcam or if you need a cheap camera for a project I would recommend it.", "Date": "March 25, 2013"}, {"Title": "javier castillo", "Author": "javier", "ReviewID": "R3B27G5N83CLGK", "Overall": "5.0", "Content": "excelente producto vendedor muy responsable y el empaque muy bien preparado excelente producto vendedor muy responsable y el empaque muy bien preparado", "Date": "February 11, 2013"}, {"Title": "WELCOME ACCESSORY", "Author": "rumel", "ReviewID": "R22JP3GEKIIN9T", "Overall": "5.0", "Content": "This is an add on that works for me. I am now able to communicate with my grandchildren and play games with them on the playstation network.", "Date": "April 19, 2012"}, {"Title": "Product Fine, Company bad.", "Author": "Christopher Hammond", "ReviewID": "R2A4IHINDKTPA5", "Overall": "3.0", "Content": "The Eye Toy worked as stated however i paid 9 dollars for 1 day delivery to Idaho It took 4 days to get to me! Sad part is it made it to California the 1st night and then for some reason after sitting there for 2 days was sent to Louisville KY! how does that even make sense!", "Date": "June 23, 2013"}], "ProductInfo": {"Price": "$10.19", "Features": "NULL", "Name": "Sony PlayStation Eye Camera (Bulk Packaging)", "ImgURL": "NULL", "ProductID": "B0072I2240"}}