{"Reviews": [{"Title": "wife is happy", "Author": "kenny edge", "ReviewID": "R3SC7AVU70O43B", "Overall": "5.0", "Content": "This camera was a birthday present for my wife and she is absolutely happy with it. It takes great pictures! Her favorite thing about it is that she can instantly send pictures to Facebook without having to transfer to computer first! All in all it was a great buy  well 2 days after i wrote this review the camera broke lol. we tried different batteries and plugging it up but it will not come on..so she called about the warranty and the guy was very helpful and told us to send it in and they would take care of it. usually companies give you the runaround but not these guys!! i give samsung 5 stars for that but it still sucks that after spending $170+ on a camera in November and not even be able to use it on Christmas", "Date": "December 17, 2012"}, {"Title": "Samsung WB150 14.2MP WI-Fi Digital Camera", "Author": "Amazon Customer", "ReviewID": "R1G7T2L8SHZU9K", "Overall": "5.0", "Content": "This an amazing camera. Pull it out of the box set it up and start shooting. Outstanding pictures and with the wifi send the pictures to a printer smartphone or tablet with ease. It is fun and easy to use.Anyone from the novice, as I am, to the pro would enjoy this camera.", "Date": "June 20, 2013"}, {"Title": "Great feature set, good value, WiFi, only average image quality", "Author": "Bron \"Bron\"", "ReviewID": "R13C6GLO40Y6G8", "Overall": "4.0", "Content": "2013-02-16 Numerous updates and edits made below.I will come back and update this review with more details as I have more time with the camera, but first impressions are good for the price paid (~130).  It is of plasticky construction, but solid and the build quality seems good.  The white body looks nice enough.  No printed manual, but the manual (PDF) is on the CD and is quite detailed.  You can read on your PC. Tablet, or other device or print it out if you like.The big question for many seems to be the WiFi.  I have a pretty standard wifi setup and I had no problems at all.  I selected my network, chose the shared setting, entered the password (easy) and it connected right away.  No need to even read the manual, just turn the dial to WiFi and you can probably figure it out if you have set up many devices before.  Once this was done, I was able to easily upload images to my SkyDrive after entering my login info, again easy to do.  I was also able to email photos to my email account.  Transfers were quick (normal wifi transfer speeds) for the 4-6 images I tested with.  If you try to transfer 500 images it's going to take awhile, probably better to just remove the SD card and use your SD card reader (or plug the camera up via USB).  But for casual transfers of images it works fine.  So the Wifi was easy to setup and use in my opinion and works well.  USB->PC transfers were also easy and fast.  And, of course, you can pop out the SD card and use your PC card reader or external USB reader as well.Update: Also tested PC Autobackup via wifi which transfers all pictures from your camera to your PC.  This is the most efficient wifi mode and also preserves the image size and quality.  Many of the other modes (like SkyDrive, social media choices, compress the file size).  You have to install the software on your PC from the CD (which also contains the manual and Intelli-Studio software) and pair once via USB.  After that you can use the PC Autobackup option from the WiFi menu on the camera and everything works automatically and efficiently. You can also transfer pictures selectively while browsing via the playback menu.  In general, all of the wifi options I have tried have worked well.  There was one instance where a transfer \"stalled\" but when restarted it completed fine and there were no further issues.Update: In further use AutoBackup has worked fast and without any problems.  It is definitely the best mode for saving your images off the camera via Wifi.  You always have the option of using the USB connection or removing the card, but AutoBackup works well enough that I don't see any need for that unless some circumstances preclude it. This mode tracks what you have transferred and will only transfer new images/videos - nice!  Transfers are placed in a dated folder, also nice.The camera handles well.  The Menus and controls are OK and easy to use.  Full manual settings are available which is nice at this price point. SMART mode seems to work OK. Everything works pretty much like you'd expect.  Zoom toggle is a bit small, but it worked OK.PQ Update: Images look soft and a bit low contrast.  Picture quality seems about average for a P&S; travel zoom camera.  Colors are good, saturation on the lower end compared to many.  The biggest issue seems to be the aggressive noise reduction (due to the small sensor size) which smears details and causes a loss of sharpness. Contrast also seems low.  The end result is the pictures do not have the \"zing\" that most out of camera jpegs have these days, so many will be disappointed in the image quality, I think.  It is possible to add some color saturation, sharpness and contrast, but the loss of detail due to the small, budget sensor cannot be \"fixed.\" That said, apparent image quality when viewing at normal screen and print sizes is OK and this may not be a big issue for some people.  This is not a DSLR.  At this price, the quality is acceptable, and images can be tweaked in any decent editor (though the lost detail cannot be recovered). For casual use, I think it is OK.  I've seen other cameras in this price range with very similar issues.  The noise reduction smearing of small detail is the biggest negative, so if you like crisp details, this will not be a good choice for you.So, picture quality is acceptable, but not stellar.  With a bit of care, good images are possible and the wifi and other features are unique at this price level. Decide if you can live with that in exchange for the other fun features offered.  In casual use, most people are not going to notice a lot of this.  Enthusiasts will.The many various modes, scenes, and effects are all a fun plus.  The \"live panorama\" mode worked very well in my few tests so far.  I was quite impressed, actually.  I found the camera fun to use.  There is built in help that explains most of the choices on screen and the controls are well thought out (for the most part) and easy to figure out and use.So far, it looks like a decent deal at the current price.  Comes with battery, charger, USB cable, CD, and wrist strap, but no SD card.2013-02-16 Update: Video -  Surprise!  The relative quality of the videos are pretty good.  The 30fps 720p HD (1260x720) video tests I took looked pretty good.  Good color, saturation, contrast, and detail (for video) and all in all very acceptable.  The videos also transferred fine via AutoBackup over wifi, thought they take longer due to much larger file sizes.  Having an 18x optical zoom that works in video mode is a nice plus, too, and it works pretty well.  The video is as good or better than a lot of the small portable video cams I have used and they're in the mp4 format so almost all devices should be able to handle them well.  Sound is mono (as usual for low price cam video) but decent. So we have a bit of a \"sleeper\" here if you like to shoot video as well as stills.", "Date": "April 18, 2013"}, {"Title": "Nice WiFi, okay for quick pics", "Author": "TexasConsumer \"music is life\"", "ReviewID": "R13IXKJ4DHMYJ9", "Overall": "3.0", "Content": "When I found this, I thought the price was pretty fair for what I wanted.  It came with nice accessories, and was delivered quickly.I bought this so that I could easily share photos 'on the spot' through the WiFi.  As a camera, it's bulky and awkward, with no touch screen or ease of settings.  I find that even when I carry this camera with me, more often than not, I use my smart phone to snap and share.  The quality of the photos is 'okay' at best - although I could probably tweak them better if it didn't take so long to find the right icon on the the turn knob, set, and then return the knob to the photo setting. It is lightweight plastic, and feels like it's going to break if I continue to switch back and forth.  A touch screen with scrolling might make me love this camera.  It's also difficult to find the correct image resolution for sharing, as several of the photos I've sent, and received from others with the same camera wouldn't open in my email, regardless what viewer I tried to use.  I still get quicker better quality shots from my phone.", "Date": "March 23, 2013"}, {"Title": "product", "Author": "Jeff_G", "ReviewID": "R3OE1Q8HM7BQ5J", "Overall": "5.0", "Content": "i love it is excelent product, my wife love this product,, i buy mor products very zoom, excelent cuality thanks", "Date": "August 6, 2013"}, {"Title": "Great little camera...awesome deal!!", "Author": "kelkel8813", "ReviewID": "R3UNSZO0S0ETUA", "Overall": "5.0", "Content": "We bought this for our mother-in-law for get birthday. She's very happy with the camera and more importantly we are happy with the price!", "Date": "June 8, 2013"}, {"Title": "Great", "Author": "Gloria", "ReviewID": "R4LBS3KANJ82F", "Overall": "5.0", "Content": "The camera works great. I am still learning all of the features, and look forward to using it on my next vacation", "Date": "April 9, 2013"}, {"Title": "Great product!", "Author": "JOAO GILBERTO VEDOVELLO", "ReviewID": "R1WT1IAMCKN9HY", "Overall": "5.0", "Content": "I've bought this camera to take pictures in my last trip with my daughter.I was expecting something were price x quality could worth and Samsung WB150 matched those points.It have a nice optical zoom (my decision point to buy it) and a quick response during pictures.", "Date": "February 20, 2013"}, {"Title": "Excellent!!", "Author": "Ki Hyung Song \"ki song\"", "ReviewID": "R1K85DAHL5D0EV", "Overall": "5.0", "Content": "For the price it is extremely great deal. The camera is great and extra battery and SD card is also a good addition.. Other minor things are very thoughtful too.", "Date": "February 5, 2013"}, {"Title": "love this camera", "Author": "tanya", "ReviewID": "R25YWKBJWYWEE0", "Overall": "5.0", "Content": "I love this camera so far and its features. I also downloased the mobilink app and love that I can share the pics to my samsung galaxy III.", "Date": "February 5, 2013"}, {"Title": "good price great features", "Author": "Jim", "ReviewID": "R1UZFFLHBQT131", "Overall": "4.0", "Content": "I bought this camera to do familiy photos and take pictures outdoors ,with the zoom lens and the ability to use wifi and link up to your mobile devices make this a great camera", "Date": "February 2, 2013"}, {"Title": "Does not include a manual", "Author": "Mike Troxel", "ReviewID": "R3TM0UY3ARKJXQ", "Overall": "4.0", "Content": "It's a Good enough bundle but no manual included.  The owners manual booklet online does not print well. When I replied to customer service that my mom had trouble printing her manual online for her Mother's Day present, they sent me a link. Every electronic device over $50 should include instructions, especially a camera.", "Date": "May 14, 2013"}, {"Title": "Pro's outweigh Con's.", "Author": "Caribbean girl", "ReviewID": "R31IAYBYTDQZG6", "Overall": "4.0", "Content": "I bought this camera to take along with me (everywhere), I love taking pictures as hobby, I am not a professional photograher but I love photography.I did some research before my purchase.Pros: Size was gr8 fits snuggly in my handbag, made of good durable material.Built in Wi-Fi worked good when using the Mobile link + Remote viewfinder application.Ability to connect to external Wi-Fi signal is gr8 could email pictures directly from camera and upload directly to social networks eg. FB.18x optical zoom gr8 not d clearest shot always though.In scene mode there are a few options to choose from to get the best quality photo.Other added features include live panorama, split shot scary but nice might get someone in innocent trouble, picture in picture was ok would have been better if you could've use a picture from the gallery.Video is good also but I really don't use it.Smart mode is gr8 especially when my brain is in lazy mode.....lol. In program mode is ok takes alot of practice to get the best quality picture.Other items in the package was gr8 exactly what it says.Cons: whilst the camera has some good features, sadly not all picture quality is d best or maybe I need to practice more I'm still a work in progress though.", "Date": "May 3, 2013"}], "ProductInfo": {"Price": "$245.00", "Features": "Get the Best Shots, from Far Away or Up Close with an 18x Optical Zoom\nShare your Best Photos Instantly with Family and Friends With Built-in Wi-Fi\nExperience Intuitive Photo Editing Software, Right from the Camera\nEasily Transfer Photos Wirelessly to Your PC, Smartphone, or Microsoft SkyDrive\n14MP CCD Sensor Delivers Brighter and Clearer Images", "Name": "Samsung WB150 14.2MP WI-Fi Digital Camera with 18x Optical Zoom and 3-inch LC...", "ImgURL": "http://ecx.images-amazon.com/images/I/51L5rwh41AL._SY300_.jpg", "ProductID": "B007CKMTLY"}}