{"Reviews": [{"Title": "Nikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom NIKKOR ED", "Author": "Manish Srivastava", "ReviewID": "R1NBOS8QQHUA4A", "Overall": "5.0", "Content": "Good amazing deal that i got from here. So i think it is reconcilable you must buy Nikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom NIKKOR ED", "Date": "January 23, 2013"}, {"Title": "Wow , what i have been missing", "Author": "Lauren", "ReviewID": "R36KHTBLQ4GI2N", "Overall": "5.0", "Content": "I must admit after getting a iPhone with 8 megapixel and HD video I bought I was done with point and shoot cameras. However there have been many times i have missed one, such as when I am shooting in low light , long distance, sports, video for long clips , zoom on video ECT.....So when my daughter graduated from school and it was dusk my iPhone got crappy shots.I started looking into bridge cameras because i wanted the super zoom. I really like the way this camera performs for the price. It takes GREAT photos even with no flash and low light! Kids plays no problem sit in the back! My only drawback that takes it down to 4 stars is the flimsy feel to the camera......... But that aside it does it job way better than my phonegood value for the bundle , had what i needed to get going", "Date": "December 17, 2012"}, {"Title": "Great bundle", "Author": "Jo Bisa", "ReviewID": "RRGXZ9V2V5VHQ", "Overall": "4.0", "Content": "Shipment came before expected and it came with a nice bundle. I bought this for my 14 year old who fell in love with it and photos come out great. Used also for projects for school videos and is perfect.", "Date": "April 28, 2013"}, {"Title": "Awesome!", "Author": "Emily", "ReviewID": "R1KMAIW11V761A", "Overall": "5.0", "Content": "Love this camera! Easy to use and it takes beautiful, clear pictures. Zoom is amazing for this size camera. Definitely worth the money!", "Date": "February 21, 2013"}, {"Title": "Awsome pictures are easy.", "Author": "Jim Brown", "ReviewID": "R21W22T63TYZS0", "Overall": "5.0", "Content": "The Nikon COOLPIX P510 is an outstanding value.  Both still picture and movie clarity are unsurpassed.  It is easy to operate and the zoom is phenominal.", "Date": "January 30, 2013"}, {"Title": "Fantastic Camera", "Author": "Joseph Schiavone", "ReviewID": "RTMFD97BBXNXW", "Overall": "5.0", "Content": "Delivery was fast event though it was Christmas time.  I found that the camera and some accessories were received.  I did not find the tripod & usb, but all over, the camera / pocket / SD Card and cleaning.It works great, has some very good features, and it is fantastic.", "Date": "January 21, 2013"}, {"Title": "Great pictures!", "Author": "Larry Dobson", "ReviewID": "R1O9HWLASCZADH", "Overall": "5.0", "Content": "Love the camera.  Easy to operate and the pictures are great.  I have mastered many of the features and enjoy them.", "Date": "December 25, 2012"}, {"Title": "nice", "Author": "chileno", "ReviewID": "R3TELX3W8TKDIB", "Overall": "4.0", "Content": "I received, just the camera and a small case. I sent then an email asking for the remaining ordered items. They answered in few hours, apologizing yourself. I received everything after a few days. thanks", "Date": "December 24, 2012"}, {"Title": "Good Deal", "Author": "Ali", "ReviewID": "R3EE2YSIWMC0TD", "Overall": "4.0", "Content": "I bought whole of this stuff for 299$, so it was a good deal, they forgot to send me SD Ram Reader and small tripod, but stil worth it,It is an awesome camera, the quality of the pictures are great, I suggest you buy more battery with external charger with 20$, so you can use your camera everywhere,", "Date": "December 5, 2012"}, {"Title": "Very Good", "Author": "Mirella E. Dasilva \"Esther\"", "ReviewID": "R1LG7P4W6839HR", "Overall": "4.0", "Content": "I bought it on November, 22 and received on November, 26, just the camera and a small case. I sent then an email asking for the remaining ordered items. Amazon answered in few hours, apologizing yourself. Today I received everything! xDSooooo happy!!! Loved everything!!!I'm NOT a professional photographer (at least, no yet), but the camera is pretty much what I expected. The tripod is a Zeikos 59\".300 dollars very well spent. :D", "Date": "November 30, 2012"}, {"Title": "buen produto", "Author": "RICARDO MIGUEL MARTINEZFREITES", "ReviewID": "R2OH5WWPBZ334B", "Overall": "5.0", "Content": "exelente vendedor todo a tiempo una sugerencia es que coloque una foto real con los accesorios que vienen con la camara porque aparecen varios articulos y solo vino la camara, el bolso, y el kit de limpieza y memoria falto el tripoide y el lector de memoria", "Date": "January 19, 2013"}, {"Title": "BAD", "Author": "A Customer", "ReviewID": "R2TQNZHPBBC89K", "Overall": "1.0", "Content": "After spending over a week PAID ME TO BUY AS AN ARTICLE WAS THIS CHRISTMAS GIFT FOR NOW VERY HARD TO GET", "Date": "November 29, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007HABBEU"}}