{"Reviews": [{"Title": "Very Good, very small and portable", "Author": "R. Richardson", "ReviewID": "R3P5NVZPJGJIDH", "Overall": "4.0", "Content": "I bought this a couple of months ago for several reasons, the first being that it charges with a micro usb plug, as do my Kindle, my phone, and my tablet.  I use it mostly to take listing photos for eBay, but I have gotten good results outside too, Macro shots are good, as are ladnscapes.  Only a 5X zoom so don't expect much telephoto.F 2.5 is helpful, I don't know what the other reviewers are complaining about.  Price is right too.", "Date": "November 21, 2012"}, {"Title": "Great camera.", "Author": "Arctos", "ReviewID": "R1HF60BQU3F2H6", "Overall": "5.0", "Content": "I purchased this camera at Best Buy. It was on sale and the last one. At the price of $49.00 I could not resist.In three weeks it proved to be one of the best cameras I have (8-digital and 3-35mm).No comprehensive manual included, but the control buttons will reveal all the functions. The build-in software will be offered for installation at the first connection to a PC or a laptop.I tested the camera in different light conditions from bright sunny days to late evenings, outdoors and indoors, macro and zoom with impressive results.Pros:The footprint of the credit card and size Motorola Razr phone.The selection of menu, mode and functions is equal or better than most the cameras of much higher price.Near perfect optics with F-2.5 brightness (98% of all digital cameras have an F-3.5-4.5 initial opening) lens deliver life like colors and great depth perception.In the \"Smart Auto\" mode the camera is doing a great job for point and shoot, \"off the hip\" situations.In the \"Program\" mode all the functionality is offered in a wide array of configurations to choose from.With 16Gb Micro card there is enough space for nearly 2000 16Mp pictures or over 1 hour of HD 30fp/s of video.The camera is always with me in my Razr phone belt case.Cons:Are you kidding me???", "Date": "March 16, 2013"}, {"Title": "Clear, stunning, and beautiful!", "Author": "Christie G.", "ReviewID": "R2C7HG1H111H10", "Overall": "5.0", "Content": "I'm an experimental camera artist that likes to take random fun pictures.I've done amateur photography and did some professional events.Normally I would prefer canon cameras, as I have a few, but I decided to give this camera a try.I bought this camera, because I didn't want to lug around my dslr, especially when taking a quick out of town vacations,and the fact that it was on sale for one day at a store and I gave it a try.I'm super happy that I did!I like the fact that the ISO settings are from 80 - 3200, and that it has an image stabalizer.You can also play with the different settings too.I've played with all of the settings and did random test shots.This camera also has HD 720p and the video is pretty clear, compared to other point and shoot cameras that I've tried before.One thing about this camera too, is that when you plug the camera into a usb port in the computer, you have the option to install a photo editor that comes free.I have professional photography editing software already installed on my computer, but the photo editor that comes with this camera is simple and right to the point.It's good for beginners!The pictures comes out stunning and very clear!Beautiful colours are rich quality too!I would definitely recommend this camera to anyone, as this camera is very good quality made!I'm seriously happy with this camera!", "Date": "March 7, 2013"}, {"Title": "camera", "Author": "trish", "ReviewID": "R3K0P3QHD2WHRL", "Overall": "5.0", "Content": "this camera is so great its the best camera i hav gotten for this price quality of pictures is amazing,,,,,love just love it", "Date": "December 7, 2012"}, {"Title": "BUY A MICRO SD CARD NOT A REGULAR SDHC", "Author": "Brent L. Ohara \"Agent Patches\"", "ReviewID": "RF6D7Q0WSEJB0", "Overall": "3.0", "Content": "For whatever reason they have regular 8GB SDHC cards listed as \"Frequently bought together\" and either Amazon is unaware or people are just dumb. Either way, don't buy a regular card with this it takes a MICRO SD card. These are typically the same price, the difference is the physical size of the card.", "Date": "December 17, 2012"}, {"Title": "Samsung ST76 - 16MP Black Camera", "Author": "Melski", "ReviewID": "R18QIU4ERBGU25", "Overall": "5.0", "Content": "I love this camera: easy to use, has many features/options to choose from, special-visual effects (i.e., colors, black-white, vintage-rustic, blue metallic, aged sepia, blurred effect borders, etc) can take a standard photo yet have the option to also capture a backdrop 2nd or 3rd or 4th photo by taking a separate picture and have it all on the same picture. The clarity is exceptional,the zooming is high quality, takes nice pictures indoor/outdoor setting; perfect for everyday use (family gathering, birthday parties, wedding, vacation, graduation, baby showers, trade shows, outdoor retail shows, etc). I would highly recommend this camera.", "Date": "April 28, 2013"}, {"Title": "Great compact!", "Author": "bryan", "ReviewID": "RRHEYSLK23HRJ", "Overall": "5.0", "Content": "Very easy to use right out of the box. Small and packed with features that generally come with more expensive cameras.", "Date": "March 24, 2013"}, {"Title": "good buy", "Author": "Alex H.", "ReviewID": "RB5842LSYF7WL", "Overall": "4.0", "Content": "Its alot smaller then i expected but its still a great camera for point and shoot. Great quality pics and easy simply charging it use a standard micro-usb. Its agian a great buy for kids 10 n up and fun for adults too", "Date": "January 18, 2013"}, {"Title": "Excellent performanceand functionality", "Author": "Carlos Orellana", "ReviewID": "RNR7SVF58B794", "Overall": "5.0", "Content": "Easy to use and good resolution of images, the HD video it's great and your small size is genial, thanks", "Date": "December 26, 2012"}, {"Title": "gift", "Author": "Latitia Badgett", "ReviewID": "RA7H8HGKGZNVV", "Overall": "4.0", "Content": "Purchased this camera as a gift for my other half. He loves it!  Takes excellent quality pics. Can't wait to go on vacation.", "Date": "December 2, 2012"}, {"Title": "Samsung ST76 16 MP", "Author": "Fiodor Bahtiarov \"FredBah\"", "ReviewID": "R2DZ0DFBX17BFJ", "Overall": "5.0", "Content": "I already had a similar camera, I gave it to my son. I choose only this camera. Reliability, quality, ease of use, good looks. I will recommend to my friends like the camera.", "Date": "December 14, 2012"}, {"Title": "Junk!!", "Author": "Eugene Evans \"Fasteddie\"", "ReviewID": "R6HGHIER1AE7F", "Overall": "1.0", "Content": "I am very disappointed with this camera..I know it was only $69, but my kids $25 camera is better than this thing!!I made a list of the pros and cons...PROS--Small enough to put in your pocketCONS--Takes horrible picturesTakes horrible videoVERY slow shutter speedUses a \"micro\" memory cardMenu is a pain to useI would highly recommend spending an extra $20 and get a decent camera. The ad says it takes 720 hd video and it clearly does not, even in the brightest conditions,the image is very grainy and you have to stand completely still..I had to hold my breath, while taking a picture, or else the pictures where so blurry,you cant see them..Total junk!!", "Date": "November 26, 2012"}, {"Title": "too slow to take the picture.", "Author": "Jim Washington", "ReviewID": "R6O98PBJNRQGL", "Overall": "1.0", "Content": "the camera came with virtually no instructions.It takes too long to take the picture.  by the time it is readya the picture is gone.  Not pleased at all.", "Date": "January 5, 2013"}, {"Title": "good camera", "Author": "abisosweet \"abisosweet\"", "ReviewID": "R2JD1G6X50TYBX", "Overall": "4.0", "Content": "i bought this camera for my sis n she likes it. the thng she likes is that if ur taking out a pic and its fuzzy the camera automatically clears it up....gr8 buy overall, would recommend it...", "Date": "April 6, 2013"}, {"Title": "nice 100%", "Author": "FRANCISCO RAMOS", "ReviewID": "R1T8WKUQQM9I6X", "Overall": "5.0", "Content": "excellent product, what I asked was expected, quality at low cost, the finish is spectacular, I recommend this product to buyers, are you going to like, thanks ...", "Date": "March 1, 2013"}, {"Title": "excellent", "Author": "Victor J. Salazar Q.", "ReviewID": "RR8NH9W5TOWAH", "Overall": "5.0", "Content": "Very good product, I loved it, I would not hesitate to recommend the purchase or store or buy it again in this way. Excellent.", "Date": "November 19, 2013"}, {"Title": "Samsung EC-ST76ZZBPBUS ST76 16.1 MP Compact Digital Camera", "Author": "Christopher G. Lamantia \"CL_Interested\"", "ReviewID": "R2FBUOTRKCKU4U", "Overall": "5.0", "Content": "This camera does everything i hoped it would do and more. got it at a Great price a little over $40, Great condition Great deal.", "Date": "November 3, 2013"}, {"Title": "Purchased as a birthday gift for father-in-law", "Author": "mspops", "ReviewID": "R1UAKFGH1RAUSL", "Overall": "4.0", "Content": "Since I personally cannot review this, I have to go by what my father-in-law has said or hasn't said.  All he told me was that he (a) liked the features, and (b) it gets the job done for his incessant E-Bay sales postings.  He is a very burly man with exceptionally thick fingers (picture a bear of a man) and the one draw back was the small size of the camera.  However, when I suggested he invest in a stylus, he said that he could still access the feature buttons without the assistance of a stylus.  So to date, I have to rate it with 4 stars based on the above based upon the foregoing actual owner's comments.", "Date": "August 25, 2013"}, {"Title": "Stopped Working", "Author": "Mike Horowitz", "ReviewID": "R1UGB7UXGBE6D4", "Overall": "1.0", "Content": "I used the camera for a couple of days while on a trip in February and then again for one night in March. I just went to use it for the third time a week ago and it wouldn't turn on. I plugged it in to make sure that the battery was fully charged and still it didn't work. I then proceeded to plug it into my laptop to charge it to see if maybe the charger was bad. After leaving it overnight to charge from my laptop it still didn't turn on. Then, I bought another battery to see if maybe the battery wasn't taking a charge. After charging that battery fully, it still didn't turn on. I am extremely careful with my photographic equipment and keep everything in padded cases. I have never had something like this happen before. Buy something else!", "Date": "August 23, 2013"}, {"Title": "It is a pretty good camera.", "Author": "Jennifer Stich", "ReviewID": "R17OOU25C080K6", "Overall": "4.0", "Content": "I have had more expensive cameras in the past that worked better with higher quality images, however I managed to break all of them. This camera takes pretty good pictures for the price, however if you are someone that is going to use this camera a lot I might suggest getting a more expensive camera. This one has held up though and has not easily broken. The images seem slightly blurrier compared to more expensive camera images.", "Date": "August 6, 2013"}, {"Title": "Great reasonably priced camera", "Author": "rudy", "ReviewID": "R3VJOGG4M24JQX", "Overall": "5.0", "Content": "It takes great pictures and allows for videos with excellent sound and video quality and you're able to crop and edit pictures right on the camera. An extra memory card is definitely needed though.", "Date": "August 1, 2013"}, {"Title": "Camera", "Author": "falguni Patel", "ReviewID": "R3KL3QOKCZ6CRY", "Overall": "5.0", "Content": "This was a good buy because it arrived on time and was truthful to the description and my family has been using it for sure.", "Date": "July 20, 2013"}, {"Title": "Great Little Camera", "Author": "Sandjlo \"Sandjlo\"", "ReviewID": "R2DU0DYA6KNNZL", "Overall": "4.0", "Content": "This is a great little camera that fits in the smallest of purses or pockets.  The only drawback I find is that it can be easy to accidentally turn off.", "Date": "July 3, 2013"}, {"Title": "Awesomeee", "Author": "ash", "ReviewID": "RVQ96NHXRPE89", "Overall": "5.0", "Content": "Great camera, came brand new in the original box as stated and works just fine, takes great pics and just connect and the battery charges as well.", "Date": "April 22, 2013"}, {"Title": "Very Nice Camera", "Author": "Roger Pilgrim", "ReviewID": "R31M10SMH4RNIH", "Overall": "5.0", "Content": "My wife just loves this small camera. Not bulky and will fit in her purse with out any problem. It will be replacing a older Canon Power-Shot. that most open is left behind. And such a good deal, brand new,  never out of the box, and sold for used . About 75% off SRP.", "Date": "March 16, 2013"}, {"Title": "Ni muy pequeño ni muy grande, el tamaño perfecto", "Author": "Daniel", "ReviewID": "R3SP2O816B3FD9", "Overall": "5.0", "Content": "La camara es excelente, les recomiendo comprarla. me llegó a Venezuela en excelentes condiciones, sellada y con todo original. Es rápida y las fotos son espectaculares", "Date": "March 15, 2013"}, {"Title": "This is a great camera", "Author": "James McCray", "ReviewID": "R3JCWPNKEN45VE", "Overall": "5.0", "Content": "I had the 10.1MP one and it was red. Misplaced it when I moved and still haven't found it. I know Samsung makes superior products because my 10.1MP camera was better than my brothers 12MP Canon camera that Ashton Kutcher was promoting at the time. This camera takes pictures so bright and with great quality that they look like they were done by photographers. I'm taking it on my trip next week with my gf and I can't wait to see what memories we can capture. Plus the price is amazing.", "Date": "February 9, 2013"}, {"Title": "awesome", "Author": "shasta", "ReviewID": "R3B53SDB3G1AH7", "Overall": "5.0", "Content": "great camera. gave it to employees and they were ecstatic to have it as their Christmas present. thanks for the quick and easy process", "Date": "January 16, 2013"}, {"Title": "Not at all up to the CES 2012 hype....", "Author": "J. Conner \"qm2-703\"", "ReviewID": "R35IRRH07CDBAZ", "Overall": "3.0", "Content": "Wanted to get this as a replacement/upgrade for my wife's Samsung SL-605 we got from Best Buy. CES claims talked about vast video and low-light improvements \"for a camera of this price range...has a nice 2.5 lens and high ISO capabilities....\" (not exact quoting....)Well, it did not outshine the SL-605 ($89) in any aspect except brightly lit still life.  Auto WB unreliable (so was SL605) , flash recovery time slow (so was SL605),  low light actually below SL605 in some settings.ST76 uses micro SD cards, while SL605 uses full size, more easily read directly in anyone's PC when you are visiting and showing photos on PC screen.Wanted so much to love the ST76, as it is thin (its main selling point ??)....", "Date": "April 17, 2012"}, {"Title": "Disappointed", "Author": "Shannon M. Smith", "ReviewID": "R1ZNDNBH49M294", "Overall": "2.0", "Content": "Bought this as a replacement for a broken Kodak Easyshare...pictures are blurry, instructions are confusing. Very disappointed...am returning it tomorrow.", "Date": "August 26, 2012"}, {"Title": "Great Product!", "Author": "BreKen", "ReviewID": "R3R08QRMXSB2WP", "Overall": "5.0", "Content": "The Samsung ST76 is a good digital camera , i love it! It takes excellent photos, you get your money worth!", "Date": "January 2, 2013"}, {"Title": "Excelente Producto", "Author": "Roberth Reyes \"Rereyes\"", "ReviewID": "R3GA08RR2IG16O", "Overall": "5.0", "Content": "Muy buen producto y de buena calidad. se los recomiendo con confianza. el vendedor es muy responsable. gracias por la venta.", "Date": "December 27, 2012"}, {"Title": "This camera is great!", "Author": "Michael", "ReviewID": "R1G5Y09VQJLHHW", "Overall": "4.0", "Content": "I got this camera for a Christmas gift.  My friend said the camera worked very well.  It shipped quickly and was boxed up for gift wrapping. The only thing I didn't care for is he said the memory card input was for a small memory card which was not listed in the description.  He may have been confused or he may have been right, but he said the one I got him (a regular sized 8GB) didn't fit.", "Date": "December 21, 2012"}, {"Title": "a friend liked it.", "Author": "Richard Sekyanzi \"srichard\"", "ReviewID": "R36DO2AU5JIQD5", "Overall": "3.0", "Content": "good handy camera i love its pics just recieved it and it is easy to handle fast with pics and easy to use . i recommend it.", "Date": "November 30, 2012"}, {"Title": "Mixed up", "Author": "Antonella", "ReviewID": "R1R9KS4W9ZQ99Q", "Overall": "2.0", "Content": "The camera came with the wrong battery type and a usb cable that doesn't fit into the camera plug !  I am still looking for the correct ones in camera stores...Regarding the functioning I cant make any coments yet, since i havent been able to even turn it on !", "Date": "July 14, 2013"}, {"Title": "GOOD", "Author": "laura rodriguez", "ReviewID": "R19NSWT7GJYSGL", "Overall": "5.0", "Content": "GOOD PRODUCT IS A LOT LIKE ME I WILL recommend you to MY FRIENDS AND FAMILY THANK YOU FOR HAVING US", "Date": "May 22, 2013"}, {"Title": "very nice price for this camera", "Author": "Harold H. Monro Hernandez", "ReviewID": "RY7JYOUOBUSV9", "Overall": "5.0", "Content": "its a very good camera and i found very good price for them, , for all the good thing that she bring", "Date": "January 24, 2013"}, {"Title": "Good , Not perfect ..The price is very good.", "Author": "Hector Matute", "ReviewID": "R15N4FRD7YX2ZR", "Overall": "3.0", "Content": "I like the delivery  process, and product was brand new sealed.I don't like the video quality i was expecting more since is supposed to be HD video .the pictures quality were fine.For the price you pay is really get a lot more.", "Date": "April 8, 2013"}, {"Title": "Motherboard Broken", "Author": "iliana", "ReviewID": "R2K8EGDWN42BA4", "Overall": "1.0", "Content": "It does not work. It does not turn on because the motherboard is broken. Aweful. I do not recommend this.", "Date": "March 9, 2013"}, {"Title": "camera damaged", "Author": "Maricel Vaamonde", "ReviewID": "RJ5SLQ4X498IG", "Overall": "1.0", "Content": "I received the shipment but the camera does not turn on when an error occurs the procedimiendo was held on the display but just as the camera does not work.", "Date": "February 5, 2013"}], "ProductInfo": {"Price": "$129.99", "Features": "Slim body small enough to fit in a pocket\n5x Optical zoom\n16.1 MP CCD sensor", "Name": "Samsung EC-ST76ZZBPBUS ST76 16.1 MP Compact Digital Camera, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51USZMcZdML._SY300_.jpg", "ProductID": "B007261BM6"}}