{"Reviews": [{"Title": "Dedicated for astro-imaging", "Author": "T. Campbell", "ReviewID": "R1L4UNHATY88JK", "Overall": "4.0", "Content": "I've done a lot of comparisons of imaging cameras and this camera performs extremely well if you use it for it's intended purpose.I have a 5D II and a 5D III for terrestrial use.  While at a friend's observatory, he showed me images taken of M101 with a 60Da.  Knowing that a 5D II is _vastly_ better at high ISO (which maintaining low noise) as compared to a 60D (note... I wrote 60D, not 60Da) I expected my 5D II would blow the doors off his image.  Boy was I ever wrong.  Even doubling and tripling the exposure times couldn't compete.  I was convinced and bought my own 60Da.A 60Da /is/ a 60D with only one difference... the filter.  A regular DSLR has filters just in front of the sensor to block UV and IR wavelengths.  But the problem with the IR filter is that it's a slow ramp up to block long wavelength light and actually begins blocking the reds well before 600nm (IR doesn't start until about 700nm).  Rather than remove the filter entirely, Canon simply uses a much better filter so that the camera blocks very little inside the visible spectrum, but still blocks the IR wavelengths effectively.The result is a camera which is vastly more sensitive to the reds.You might wonder why you'd care.  It turns out that about 90% of all the atoms in the universe are hydrogen atoms.  Hydrogen atoms emit energy following the Ballmer series for Hydrogen wavelengths -- the strongest of which is the hydrogen alpha wavelength at 656.28nm.  That wavelength is heavily filtered OUT on a normal camera, but the 60Da allows most of that wavelength to pass unfiltered.  This results in MUCH shorter exposures to get the same image and images expose with more intensity -- especially in hydrogen rich nebulae (which turns out to be most nebulae).Standard astrophotography technique still applies... take lots of frames, learn to stack, etc. etc.A few other points worth mentioning:1)  The camera includes the AC power adapter.  This is important because when doing astro-imaging you'll be taking LOTS of sub-frames and each sub-frame will be fairly long.  E.g. you might shoot (just an example) 16-25 \"light\" frames where each frame is 4 minutes and that's just to image one object.  And then of course you'll need about half as many \"dark\" frames taken at the same settings, exposure times, and camera temperature.  Running on battery for this long would kill the battery -- so it's nice that this can run on AC power and you won't have to worry about the battery lasting.2)  The camera includes an adapter for Canon's TC-80N3 Intervalometer.  The Intervalometer (not included) has a plug designed to connect to the Canon pro bodies (three pin connector) but the 60Da has a remote trigger jack which resembles a stereo headphone jack.  The adapter allows you to use the TC-80N3 with a 60Da.Canon publishes the camera SDK to remotely control EOS cameras via USB and many astrophotography applications take advantage of this.  I noticed that in my astronomy club (a large club with a fairly high percentage of imagers) just about everyone who uses a DSLR (not everyone does) will use a Canon EOS DSLR.  I did my own informal software survey and discovered that literally every single image acquisition program I could find supported Canon... only two supported Nikon.Canon is the only manufacturer to offer a DSLR pre-modified for astro-imaging applications.  There are other companies who make CCD imaging cameras for astrophotography (not DSLRs) and many of these have cooling systems to keep noise low, monochrome imaging sensors, and robotic filter wheels (e.g. SBIG, Apogee, Finger Lakes, etc.).  This Canon 60Da isn't going to compete with a $10k SBIG camera, but it's a great camera in a nice package and I've seen some stunning images come out of this camera.BTW, you can use this camera for normal photography, but I don't recommend it.  You'll find that the reds are much stronger than you expect.  This can be adjusted with white-balance.  You would want to invest in a photographic \"gray card\" and either learn to use \"custom white balance\" (when shooting JPEG) or get a reference frame of the gray card when shooting RAW.  If your primary purpose for wanting a DSLR is for normal terrestrial use, don't get the 60Da... get a camera intended for terrestrial use.", "Date": "November 14, 2013"}, {"Title": "EXCELLENCE", "Author": "Garry G.", "ReviewID": "R1GBT9FWQG9JNU", "Overall": "5.0", "Content": "I purchased this camera to replace my dated Canon 20D for Astrophotography.  I looked at perhaps hundreds of reviews on various SLR cameras prior to purchasing the 60Da.  The 60Da has everything I needed plus it was close to what I was use to in a 20D, but it stops there.The 60Da not only takes excellent long exposure deep space tracked photos but also is a fantastic terrain, and wildlife camera as well.I track deep space objects with my Vixen Polarie mounted on a Manafratto tripod..excellent combination.I have also attached it to my Mak Cas 14\" telescope using a t adapter..it performs exactly as it should without a glitch.Great price here...I saved $100 easily.  Quickly shipped and in professional packaging.Buy this camera if you are into Astrophotography, even if you are not it will out perform most of the SLR's out there today, given you have some experience.  However the camera is easy to operate and ergonomically made.", "Date": "April 11, 2013"}, {"Title": "Great astro camera", "Author": "Kraxler", "ReviewID": "RN1VZGSBM6N7O", "Overall": "5.0", "Content": "I use the EOS 60Da for both terrestrial and astro photography. I find that the camera works great for both purposes. I have not had an issue with the removal if the ir cutoff filter when using for regular photography. When used for astro photography the all in one solution verses a dedicated specialized astro camera with laptop, and cables makes the whole process much easier and more enjoyable..  I ave also used it for astro photography with a cannon zoom lense and that also works great.  I wish the price mark up for the 60Da verses the 60D was not so steep but otherwise I'm completely satisfied.", "Date": "May 9, 2013"}, {"Title": "Canon EOS 60Da rewiew", "Author": "Bill McKenna", "ReviewID": "R2B37D2VUJA7E6", "Overall": "5.0", "Content": "I had already purchased a T2i during the summer, but being an avid astronomer, I was really looking for an older 20Da. But they were few and far between, and the prices were a little out of my range for a used camera.Then Canon released the 60Da and I was hooked. I love this feature filled camera and it not only takes exceptional astro-photographs, but day time shots are exceptional as well. My best purchase of the year!", "Date": "December 25, 2012"}, {"Title": "Cannon 60Da camera", "Author": "jimmie Roush Sr.", "ReviewID": "R33L7SJWZ6MX9Y", "Overall": "5.0", "Content": "The 60Da is a big jump in astrophotography.  I have taken a number of deep space images, and everyone has been super.  I have an observatory equipped with a large refractor.  The bulb setting and imaging set on RAW are far superior to my other Cannon TSI,especially with the Hydrogen Alpha filter;The only thing I would like to have seen them do was to place the  timer on the 3\" monitor, instead of placing it on top of the camera window.  It makes it awkward, when the telescope is at certain elevations, and you have to look over the top of the camera to see thelapse time of the shot.", "Date": "September 11, 2013"}, {"Title": "Very good for what it's designed for but...", "Author": "Amazon Customer", "ReviewID": "R3D9Z5X4IE9XEV", "Overall": "4.0", "Content": "One may want to get a used T2i and have it modified to remove the IR filter... it would be a much less expensive way to go and get better results.  This does \"OK\" for daytime shots but the color and white balance is off some, I can tell the difference.  Maybe with an IR filter on the lens would return colors to natural, haven't tried that yet.", "Date": "October 17, 2013"}, {"Title": "A+.", "Author": "S. Hunt", "ReviewID": "R1SB91YL2Z6OS5", "Overall": "5.0", "Content": "Very happy with this camera. It was purchased for a friend who is learning Astro-photography via distance education in the UK. He is really impressed with it. Prompt delivery and great packaging.", "Date": "December 16, 2012"}, {"Title": "Not a professional photographer but, wow!", "Author": "Donald Mackenzie", "ReviewID": "R1RZBWF5RQVNUT", "Overall": "5.0", "Content": "I was worried that this camera wouldn't take great everyday pictures but man, was I wrong.UpdatedAfter spending sometime with this camera, this is what I know. Please note that this is my first DSLR Camera. I have always wanted to own a DSLR and this one caught my eye.The camera does amazing work at night. I have no idea how it compares to the canon 60D but it's pitch black outside and we're getting colours from our roses that make it look like daytime. It's crisp and with the 70-200mm f/2.8 lens, I can get a picture of the moon with craters. I also got the canon shutter button thing for bulb mode and that's loads of fun.", "Date": "June 9, 2012"}, {"Title": "Lost two very quickly", "Author": "timtrice", "ReviewID": "RVECFTSCJTWPN", "Overall": "2.0", "Content": "As a budding astrophotographer I was extremely excited to get this camera and take it for a test run. Unfortunately, I wasn't able to do much with it at all. The first night I had a decent run and captured numerous images. However, for some reason, the next evening the camera would not turn on. Thankfully, Amazon not only agreed to replace the item but shipped it next day before I had even returned the first one. For that I was thankful.However, the second camera did not even make it through the first observing session. It too refused to turn on. Fed up, I purchased the 60D from a local camera store (and have had several hours of imaging without fail).I've come to learn I am not the only one who has experienced this issue. However, no one seems to know why. Two other instances I am aware of, Canon repaired the cameras (one which was out of warranty) at no charge. Canon, however, would not explain the reason for failure and only listed the \"main and bottom electronics board\" being replaced. Granted, they had an extremely quick turnaround time (under a week even covering next day shipping).My disappointment was that I chose this camera because of the infrared filter issue. I have a 60D I will eventually have to modify to capture reds of nebulae. I didn't have to do that with the 60Da. But, I couldn't in good conscience purchase a third 60Da else I'd have been deterred from AP and likely Canon for a very long time.I do know many individuals do not have issues with this camera. But that I have not done anything different with the 60Da that I've done with the 60D, I feel there is some type of issue with this particular camera and I'm sure there are others who have had similar issues that have not voiced their complaints.", "Date": "August 26, 2013"}, {"Title": "Great for astrophotography", "Author": "Paul", "ReviewID": "R1NM7DG58RER50", "Overall": "5.0", "Content": "I was using my Nikon D90 - but this camera just blows it our of the water - so to speak.  If you love to take pictures of nebulas and deep space objects - this is a great choice.  Highly recommended.  It arrived in two days and was well packaged.", "Date": "August 19, 2013"}, {"Title": "Night Sky Shooters Rejoice!", "Author": "Larry M. Cole", "ReviewID": "R6IN2RGWV0235", "Overall": "5.0", "Content": "Since I'm already familiar with Canon DSLRs, I was able to get the camera up and running in no time.  Taking this to a dark site and using a 20mm prime lens, I was able to get a wonderful, long exposure, night sky panorama in the very first image that I shot.  Thanks Canon, for supporting all of us night sky lovers!", "Date": "June 30, 2013"}, {"Title": "OK, but not ideal", "Author": "William \"Skeptic AstroImager\"", "ReviewID": "R3JFJNC833TNHS", "Overall": "3.0", "Content": "OK, I should preface this by saying that I am an astro imager with 20 years of experienceand quite a few published images and have extensive experience with real astronomicalCCD cameras.I figured I would give this a try as I already have a higher-end Canon DSLR for regularphotos and lots of Canon lenses.My take is that the 60Da is OK for very casual astroimaging of the brighter objects but that ifyou want to do serious deep sky imaging, you should really buy a dedicated astronomical CCDcamera from SBIG or one of the other manufacturers that make monochrome CCD astro cameras withfilter wheels. They are much more work and more expensive but the results are light years better!", "Date": "August 1, 2013"}, {"Title": "Literature Seems to be Unclear", "Author": "Theo Phann", "ReviewID": "RBUT4BCZJ0374", "Overall": "3.0", "Content": "It's not the capabilities of the camera that didn't sit well - it was the confusion in the description(s) about them. When I opened the box there was a little paper on top that said NOT to use this camera for \"normal pictures\" because of the enhanced red in the sensor would negatively affect them. My goal had been to use this camera for both astrophotography and regular pictures, but this new info was a deal-killer, especially for the price. I returned it and ordered the 60D instead, figuring that I could shoot in RAW for astrophotography, use third-party software to enhance the red (if needed) and then take \"normal pictures\" as well.", "Date": "October 10, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007RUIX5K"}}