{"Reviews": [{"Title": "Pentax Optio VS20", "Author": "Judy H. Gruver \"jhg\"", "ReviewID": "RYGA2GB61ODWL", "Overall": "4.0", "Content": "Nice little compact camera.  Easy to use, similar controls to other Pentax Optio cameras.Positives:  Compact size.  Simple to use controls.  Uses high capacity SD cards (cheap!)  20X Optical zoom.  Outstanding macro.Negatives:  No view finder, just the LCD screen.  Proprietary battery that requires a special charger. The 20X optical zoom is more than you can hand hold.  Unlike most Optio's, it is not water resistant. It takes a few seconds to turn on and off, because the lens has to extend/retract (no biggie, but something you have to learn to deal with.)", "Date": "June 2, 2013"}, {"Title": "Not what I was looking for!", "Author": "islander \"islander\"", "ReviewID": "R26HHYZ4B1PXUC", "Overall": "3.0", "Content": "A BIG disappointment. The price was right for this Pentax Optio VS20 16MP Digital Camera with 20X Optical Zoom and 3-Inch LCD Screen and now I think that's because the functioning is so inadequate. Especially for the shake stabilization which is either malfunctioning or absent. I thought it might be a defective item until I read an online review citing the stabilization as a major issue for this model.I wanted to upgrade my capabilities for taking bird photos. The very best I got of birds (sitting in a tree) needed a lot of enhancement on the computer to compete with unenhanced shots with my old camera. Improved zoom shots was my goal for a new camera but this doesn't give it to me. I also took many outdoor daytime and night-time pics at a local outdoor event with both this and my older camera for comparison. The older camera did as good a job on most shots. I mostly shoot outdoors and didn't take indoor shots. Also I realize now I should have checked things I didn't think of before purchasing. Having not bought a camera for years I guess I thought they all had eyepiece view finders even if they have screens - wrong! I now know that is called an EVF but this camera doesn't have one. Plus the batteries - I'm used to double AA which are easy to get about anywhere and rechargables have a loooong life. I am not familiar with the little battery in this camera which seems to have a VERY short life even after an overnight charge.Another turn off is the type and placement of some of the buttons making it all too easy to hit the wrong one by accident especially on playback.On the plus side it is light-weight, attractive and is slim-line so easily slips into a pocket purse or small camera case. It powers up quickly and has both reduced noise or no sound options. The last thing I want with unsuspecting wildlife would be a loud unusual (for them) sound to spook them so this is a big plus.I didn't even try out the video as I rarely use it.I imagine this would be a fine camera for someone not interested in zoom, action shots, EVF or type of battery BUT for me it is useless and will have to go back.UPDATE: One thing I've learned is that I don't know much about cameras - well duh! -that's why I favor point and shoot. As regards zoom (so very important to me) I've now come to realize that the number of X doesn't tell me much. It is not a standard number from company to company. For instance, I compared a 10X zoom camera (I couldn't find enough 20X cameras to easily compare)from several companies and got ranges of 35mm equivalent ranging from 24-240mm equivalent thru 25-250, 28-280, 36-360 & 38-380. So 10 x's seem to be 10 times the starting point. Obviously then knowing the starting point is vital. I wish they'd just list the 35mm equivalency.Also this camera does have a lot of auto settings I didn't try that would probably take fine pictures in most settings but that's not what I am trying to upgrade. Thus I'm moving my rating up from 2 to 3 - ie: for me, neither great nor terrible.", "Date": "May 6, 2012"}, {"Title": "I would recommend this one", "Author": "Jules", "ReviewID": "R2DWOUOGU9IEJU", "Overall": "4.0", "Content": "I do like this camera for off the hip shooting.  I can keep it in my pocket to take on everyday trips.  For serious shooting tho I still use my Pentax DLSR.The VS20 zooms in nice and close and takes good clear shots.  Video at high zoom is quite shaky tho.  Needs to have a tripod.", "Date": "September 16, 2012"}, {"Title": "A great camera.", "Author": "mac", "ReviewID": "R2G4Y9ZY1YGCZP", "Overall": "5.0", "Content": "The camera was a gift and it works really well and pictures are fantastic.Would definitely buy the camera again.", "Date": "November 27, 2012"}, {"Title": "Pictue quality is not that great", "Author": "Gary", "ReviewID": "R1EP0I18QIRAFD", "Overall": "2.0", "Content": "I replaced an older Kodak camera Ive had for 10 year. Couldn't fine a battery charger for it. So I decided to give the Pentax a try. Not very impressed over all. THe quality of the photos of the Kodak are far better than the Pentax.", "Date": "January 14, 2013"}, {"Title": "camera", "Author": "Peter T. Captain", "ReviewID": "R3HW0W7KCJSMFJ", "Overall": "5.0", "Content": "I love this camera.It is small enough to fit in your pocket and still have great zoom options.I bought it for taking pictures at outdoor concert events qand though I haven't tie i9t ot on any yet I think it will work grat", "Date": "November 16, 2012"}, {"Title": "Pentax Optio VS20", "Author": "Wade S.", "ReviewID": "RHR8F02X6UXJ3", "Overall": "3.0", "Content": "Camera works well, however it is bulky. Last Pentax digital camera I had was much thinner.  I do like the 20x optical zoom but am disappointed that it makes this camera so thick.  Also I am disappointed that this camera did not come with a case (as did the last Pentax digital camera I had)", "Date": "January 10, 2014"}, {"Title": "Great little camera", "Author": "Franki Emerson", "ReviewID": "R234XSI013LW2R", "Overall": "5.0", "Content": "I bought this camera for my mom as a Christmas present. She had another Pentax Optio that broke when she dropped it. So, I stuck with the same type of camera. She raves about this camera and says it's way better than her first on. Quality in photos and video are excellent. Definitely a good camera for a amateur photographer that wants to look like she took professional shots.", "Date": "December 22, 2013"}, {"Title": "So Far, Great.", "Author": "Howard G. Berg", "ReviewID": "R16EWHQFOCG67", "Overall": "5.0", "Content": "I bought this camera to replace a Pentax Optio RX18 I had replaced (and loved dearly) (I've since found it, Hurray!)  So far I like this camera a lot.  I have a nice Digital Camera that I can do nice things (yes, I now have 3) with, but it is not a quick point and shoot camera, which is what I wanted.  This camera gives a lot of zoom!  Regardless of what others say, the 'anti-shake' feature works pretty well.  But when one is holding a 500mm lens by hand, it's going to shake, even when you have your hands steadied.  Plus, it also takes videos.  I've tried this out, too, and I'm positively impressed.It's a bit bigger than the RX18 and it does NOT take the same batteries.  I did purchase 2 (two) D-Li122 batteries, which are the proper size for the  VS20.  The RX18 takes an LI-50B.", "Date": "December 19, 2013"}, {"Title": "Pentax Optio", "Author": "Ed Olson", "ReviewID": "R28SFP6G4AVKJ", "Overall": "4.0", "Content": "Decent Camera for the money. Should have spent a few more dollars and bought the panasonic. Overall I am happy with the purchase, and value for the money has always been Amazons strong point.", "Date": "November 13, 2013"}, {"Title": "Battery and Charger included.", "Author": "James D. Chalupnik", "ReviewID": "R10SYI7A4QE29H", "Overall": "4.0", "Content": "Perhaps I misread the material on this item. I didn't realize that a battery charger was included. So I purchased a 'Wasabi Power Battery (2-Pack) and charger. All I really needed was an extra battery.", "Date": "October 25, 2013"}, {"Title": "Battery broke after a month", "Author": "Jaime A Smith", "ReviewID": "RD08KPMCW63VI", "Overall": "2.0", "Content": "This is our second one of these cameras.  We like them and they take decent pictures.  But with this one the batter door latch broke after only a month.  Now we get to see what kind of warranty support there is.", "Date": "October 10, 2013"}, {"Title": "cammera seems to be what i've been looking for\\.  So happy i bouaght it for my vacation.  it's leaving up to my expections;", "Author": "Beverly A. Harrell", "ReviewID": "R1E7V1CSGTIXO0", "Overall": "5.0", "Content": "Very easy to use on my trip.  no matter the camera was moves it shot perfect perfections.  i was gone 11 days did 11 states and ridden 75 hours and 1758 miles.  got the most fantastic pictures looking forward to editing them and making copies.so glad i bought this and chose this camera.", "Date": "September 29, 2013"}, {"Title": "LOVE IT", "Author": "Angela", "ReviewID": "R3LQENFAVL9HXU", "Overall": "5.0", "Content": "I absolutely love this camera!!!  Very well worth the price!  I had a Pentax 35mm years ago and loved it as well - so it wasn't a hard choice to go back to another Pentax.", "Date": "May 1, 2012"}, {"Title": "Not what I thought it would be", "Author": "Gary L. Smith", "ReviewID": "R22Z6V27NKCFXC", "Overall": "1.0", "Content": "It is too technical for me I guess. I tried several times to take photos & very few of them came out like I wanted. There may be a way to adjust it but I can't figure it out. The battery seems to go down really quick.", "Date": "December 15, 2012"}, {"Title": "Worst ever", "Author": "Jen", "ReviewID": "R20XFIJBYA50HW", "Overall": "1.0", "Content": "I absolutely hate this camera. I never know when it is going to decide to take a good picture and you have almost no control of anything. On the plus side, at least I am learning lots about photography trying to figure out why my shots don't work. A few more bucks and I coulda had a Canon.", "Date": "March 5, 2013"}, {"Title": "My third Optio", "Author": "Patti S. Lane", "ReviewID": "R1SO5NMTIGS08D", "Overall": "5.0", "Content": "I have had the two versions prior to this and love them all....great little camera for the price and for what I do with a camera.", "Date": "December 11, 2012"}], "ProductInfo": {"Price": "$199.00", "Features": "3-inch LCD display\nSuperb 20X optical zoom (28-560mm equivalent); 16 megapixel sensor with sensor shift shake reduction image stabilization\nDual shutter release, zoom button and tripod mounts for ease of use in either horizontal or vertical shooting modes.\nHD video in 720p @ 30 FPS\nDigital level function ensures shots are properly level to the horizon", "Name": "Pentax Optio VS20 16MP Digital Camera with 20X Optical Zoom and 3-Inch LCD Screen (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41kv4juPT-L._SX300_.jpg", "ProductID": "B00715OTZY"}}