{"Reviews": [{"Title": "Best little camera", "Author": "Krazykay93", "ReviewID": "R1ZAFFFCKXLF67", "Overall": "5.0", "Content": "I bought this item from a local retailer on a whim.  I found some gift cards and bought a camera that was on clearance because it was the cheapest.  But the camera itself is not cheap!!It has easy to use features and is a breeze to take photos with.  The picture quality is superb and not grainy like many other comparable cameras.After seeing how great my camera was, my mother decided she needed to get a new point and shoot camera.  We went back to the store and found out to our dismay that the camera I bought was sold out.  So she went to try other cameras and finally settled on a Nikon.  She was unhappy with the picture quality and returned it for a Cannon.  Again, she was unhappy with the camera so she returned the other one.  After browsing on Amazon I came across the same camera I bought a couple months ago, and I bought it for her.  She has never been more pleased with a camera before!This is a GREAT camera at a GREAT price! You will not be disappointed!", "Date": "June 27, 2012"}, {"Title": "Awesome but....", "Author": "Jaderkinss", "ReviewID": "R1QL69WOG1KXOB", "Overall": "4.0", "Content": "I love the pictures it takes, I love all the options for the pictures (different color options and things like that) the only thing I have an issue with is the menus and stuff are really slow and sometimes take a little bit to load. Zoom feature works fantastic. I was taking pictures at a concert from probably 50 yards away and it looked like I was in the front row.", "Date": "September 23, 2013"}, {"Title": "awesome camera", "Author": "Joseph D. Thomas jr", "ReviewID": "R1SS9LFZAA1DUA", "Overall": "5.0", "Content": "Awesome camera awesome shipping very easy to use real sharp pictures. could not be happier with product, brought back some awesome Las Vegas pictures and Grand Canyon shots wonderful details!", "Date": "June 22, 2013"}, {"Title": "a 6 year old's perfect birthday present", "Author": "Kathleen E Talarico", "ReviewID": "R383XRR5T69GCI", "Overall": "5.0", "Content": "easy to handle, easy to use. The child loves it and takes pictures of items I would never have dreamed.", "Date": "December 29, 2012"}, {"Title": "Kodak", "Author": "Ida B. Scott-Hutchinson", "ReviewID": "R2A4QV8T486RGF", "Overall": "4.0", "Content": "Haven't used it yet, but I'm sure to like it.I will be taking it on vacation in a few weeks.", "Date": "December 2, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0073WNN3E"}}