{"Reviews": [{"Title": "Takes great pictures but difficult for me to hold", "Author": "Gary", "ReviewID": "R19R48DIEAFZG", "Overall": "3.0", "Content": "pros-Takes excellent pictures, zoom is great and there are plenty of user options in the menus to cover a lot of different lighting situationscons-1) The camera case that came with my package was too small for the camera to fit into.  I had go go and buy another case and that resulted in more $$.  I notice that in another review, the case was way too large.2)  The camera is not easy for me to hold.  First it is quite awkward to hold with only my right hand.  Yes, there is a small grip bar on the front of the camera that helps a bit, but with its rounded body and smooth surface, I am unable to get a comfortable and secure hold with only one hand.  Second, if I use two hands in holding the camera, I normally put the thumb of my left hand under the camera and the index finger of my left hand on the top of the camera toward the left side.  In this situation, my index finger is right on top of the flash, so when the flash automatically opens, my finger is right on top of it .  Not good.  This may not be a problem for other people, but it is bothersome to me.", "Date": "November 14, 2013"}, {"Title": "Again canon", "Author": "Ban Colman", "ReviewID": "R3EOY7222BISJ7", "Overall": "5.0", "Content": "I order this for my friend who gave me a challenge if i can get for him something great and pocket size.He was shocked when he got it.", "Date": "October 31, 2013"}, {"Title": "great package", "Author": "rb", "ReviewID": "R3OXOWSMSHMR4S", "Overall": "5.0", "Content": "great package for the money. the little flexible tripod was super for my road trip. compact, easy to use, nice pics and good zooming abilities. the 16g card did not even get full after 1300+ photos and the batteries lasted the entire day most of the time. in addition, the carrying case is light, roomy, and convenient for our moderate hikes.", "Date": "October 1, 2013"}, {"Title": "Check package", "Author": "Prabhu Narayanasamy", "ReviewID": "RM9LYXXKSJQHU", "Overall": "3.0", "Content": "I have received the package 2 days back. But just today as i checked i noticed for the missing card reader and memory card wallet. So its important to check that all your supposed to get are rightly received. And regarding the camera its worth for the dollars spent,though it is not that efficient for fast clicks as it takes minimum 5second to resume the last click.", "Date": "July 8, 2013"}, {"Title": "Awesome", "Author": "M. Twelves", "ReviewID": "R3OYDKW2CFUYBD", "Overall": "5.0", "Content": "Have had this camera for about 6 weeks, so far it's amazing. As a family with young children and no time for an SLR, this is the next best thing. The only weird thing is the placement of the flash, it does hit my finger.. but I am used to it now.", "Date": "February 17, 2013"}, {"Title": "Carrying Case Too Big", "Author": "sepehr", "ReviewID": "R142CBH2MK2Q9W", "Overall": "2.0", "Content": "Overall it is a good deal and a good camera, but when they sell a case with a camera, you would expect it to be made for the camera, not just a random case large enough to fit the camera. This case is too large.", "Date": "February 14, 2013"}], "ProductInfo": {"Price": "$369.00", "Features": "Canon PowerShot SX260 HS 12.1 MP CMOS Digital Camera with 20x Image Stabilized Zoom 25mm Wide-Angle Optical Lens and 1080p HD Video (Black)\n16 Gigabyte SDHC Secure Digital Memory Card - Universal Memory Card Wallet\nDenali Well Padded Digital Camera Carrying Case with Pocket and Strap\nLens Care & Cleaning Kit - Package of LCD Screen Protectors\nFlexible Legged Mini Table Tripod - BONUS!! Free 25 Quality Prints (Promo code on invoice)", "Name": "Canon PowerShot SX260 HS 12.1 MP CMOS Digital Camera (Black) + NB-6L Battery + 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/5123BLgxn3L._SY300_.jpg", "ProductID": "B007NLOH44"}}