{"Reviews": [{"Title": "Great camera/kit", "Author": "Howie Kaye", "ReviewID": "R28YPGFQ8G2RLX", "Overall": "4.0", "Content": "My son bought this camera and he loves it!  A couple of problems though.  We had to exchange the camera body as it was not sensing the lens being attached.  The zippers on the case are also rather fragile.", "Date": "April 7, 2013"}, {"Title": "Great Camera", "Author": "Jerry", "ReviewID": "R3NMTK0LX2JW5I", "Overall": "5.0", "Content": "This is my first SLR Camera. It has lots of features and takes great pictures.  I purchased the package that included the 55-200mm VR zoom lens which is a good addition to the camera.", "Date": "February 11, 2013"}, {"Title": "Fantastic bargain for the would be photographer", "Author": "Bobby D", "ReviewID": "R23KLND0LYCOUG", "Overall": "5.0", "Content": "This camera is so easy to use.  The point and shoot features are idiot proof, and the photos very professional looking.  If you want Nikon quality and features that could help you become an excellent photographer, I highly recommend this camera.  I bought the kit which includes an extra zoom lens, remote shutter control, memory, gadget bag, tripod, and other goodies, a bargain with the purchase of the camera.", "Date": "May 7, 2013"}, {"Title": "Great Deal", "Author": "M. Cepero", "ReviewID": "R282VRE67KSV9I", "Overall": "5.0", "Content": "as advertised everything you need to get started with photography is in this kit I added the wireless adapter and my wife", "Date": "January 9, 2013"}, {"Title": "Wonderful fairly priced package.", "Author": "Barbara T Striegel", "ReviewID": "RR2NWCN4FRB9Q", "Overall": "5.0", "Content": "this is an excellent package for a beginner to a middle amateur.I can have all of the toys I need to experiment and learn.Wonderful camera.", "Date": "December 29, 2012"}, {"Title": "Great camera", "Author": "Anil Kumar Reddy Madireddy", "ReviewID": "R2QJQV0OX4PZJS", "Overall": "5.0", "Content": "This is the first SLR camera I got and its the best.  Everyone will like this beauty.  Love it !!!", "Date": "March 28, 2013"}, {"Title": "gift for husband", "Author": "Amazon Customer", "ReviewID": "R1A3VM8J87BY8Y", "Overall": "5.0", "Content": "my husband likes it. he has taken some photos and is pleased. everything is as pictured. the package was not well taped, but i addressed this with their very customer oriented customer service rep", "Date": "December 18, 2012"}, {"Title": "Excellent", "Author": "Brian", "ReviewID": "R1D3QR4GUQO8JC", "Overall": "5.0", "Content": "Got this bundle for my wife for her bday. She loves it. Got little classes from her photographer friends on how to use it. I would definitely recommend it", "Date": "December 22, 2013"}, {"Title": "Buyer beware!", "Author": "Melissa Burgos", "ReviewID": "RB2C2CJ16TF7H", "Overall": "1.0", "Content": "Do not buy from this seller. Horrible customer service! I had try to cancel my order before it left the warehouse and they told me I would be charged bc apparently they said they don't want to go through the boxes to find my order. I had lost the $20 for shipping and handling plus they charged me another $12 for sending the package back even though I never received it. The customer service rep had an attitude the whole time on the phone bc I decided I didn't want the product from them. The items in this package are cheap but you get what you pay for", "Date": "November 27, 2013"}, {"Title": "Beautiful.", "Author": "Kim Gayton", "ReviewID": "R3LT89PVR0KWBJ", "Overall": "5.0", "Content": "Beautiful Camera....takes amazing pictures...The only thing that I do not like about this camera compared to my Canon is night pictures....Very slow in action.  So don't try to take fireworks pictures as it is way too slow for that.", "Date": "November 4, 2013"}, {"Title": "great entry camera", "Author": "J. winston", "ReviewID": "R3QH8SN5YM21B1", "Overall": "5.0", "Content": "this is a great package and the camera after you get familiar with it met all my expectations...having met a number of real pro photographers and enthusiasts they all said that it was a great choice and I agree", "Date": "October 14, 2013"}, {"Title": "Love the Nikon D3200 Camera!!!", "Author": "Lori Hoskins", "ReviewID": "R3VM1S5NG1FYO6", "Overall": "5.0", "Content": "Great camera.  Pictures very clear.  Camera easy to use for the most part.  Just haven't read all the directions on everything the camera is capable of doing.  I'm not a professional but wanted to be able to take pics from distance.  I LOVE this camera!!!", "Date": "July 17, 2013"}, {"Title": "YES!!", "Author": "Douglas Clifton", "ReviewID": "R2RXM0YRAQD21T", "Overall": "5.0", "Content": "I love this camera. I've had it now for a few months and I use it for everything. Family functions, parties, weddings. The package with the 55-200 lens was great for me, ill be able to get the close shots with the 18-55 that came with the camera and the long shots with the 55-200. Also the package came with other essential items like cleaning kit, two lens protectors, SD card holder and a flash.Great bag for a beginner photographer for someone looking to get a better camera for family functions.", "Date": "July 17, 2013"}, {"Title": "need more technology", "Author": "luis granda", "ReviewID": "R3QMEI7EK63Q9N", "Overall": "3.0", "Content": "A very good camera to take pictures but that is all it can do. For the price I would like it to have some touch screen technology at least.", "Date": "September 21, 2013"}, {"Title": "Great bang for your buck!", "Author": "Grace", "ReviewID": "R1Q0I4VE38XBVK", "Overall": "5.0", "Content": "The tripod is not the highest quality, as is apparent- but considering it comes along free when you calculate the individual costs of the other items it is well worth it!  The external flash is a bit inconvenient considering it's monstrous consumption of batteries.  Love the camera, love the bag!  And its nice to have the little extras.", "Date": "June 11, 2013"}], "ProductInfo": {"Price": "$699.95", "Features": "KIT INCLUDES 12 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D3200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + <2> Nikon 55-200mm VR DX AF-S Lens + <3> Transcend 16GB Class10 SD Card +\n<4> Nikon Digital SLR Camera Case + <5> Vivitar 52mm UV Glass Filter + <6> Additional Vivitar 52mm UV Glass Filter +\n<7> ML-L3 Shutter Remote Control + <8> Precision Design DSLR300 Flash + <9> Precision Design 57\" Tripod +\n<10> PD 6pc Complete Cleaning Kit + <11> Transcend SD Memory Card Case + <12> LCD Monitor Screen Protectors", "Name": "Nikon D3200 Digital SLR Camera & 18-55mm G VR DX AF-S Zoom Lens (Black) + 55-200mm VR Lens + 16GB Card + Flash + Case + Filters + Remote + Tripod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51XhE9GdGpL._SY300_.jpg", "ProductID": "B007X47SCY"}}