{"Reviews": [{"Title": "An unbeatable deal", "Author": "DLovely New York", "ReviewID": "R8NFHB6MXMQ6A", "Overall": "5.0", "Content": "I researched and researched to find the camera that was right for me and Fuji fine pix S 4200 was just perfect.But I needed a case and an SDcard and a battery charger and a cleaning kit and when I put all those things in the cart it was so much more expensive buying it separately.So the bundle was perfect. the camera in itself is wonderful everything works as it should it's not too heavy it's not too light it looks like a feel like a professional camera the 24x zoom is unbelievable the flash works great and with 14 megapixels it takes really great pictures.when you order you order through Amazon but the seller is beach camera and let me tell you the service is so fast I ordered the 27th it was shipped on the 29th and I got it on 31st you can't beat any of it that's why I give it five stars. Happy buying I hope you enjoy your product as much as I do.", "Date": "August 1, 2012"}, {"Title": "love this camera", "Author": "brokenhalo4ever", "ReviewID": "R1QCU7Z6YVTDGF", "Overall": "5.0", "Content": "I love the different options in this camera! I have been able to take great pictures in low light settings ....for example at a bar with a band playing with low light, colored spotlights and movement....the pictures came out great! The recording option is also  great and there was no camera shake although i was holding the camera. The zoom is awesome..at a football game that my daughter was dancing in,  i was sitting in the bleachers and was able to take almost close up pictures of her. Love this camera!", "Date": "September 4, 2012"}, {"Title": "great package", "Author": "j morgan", "ReviewID": "R277IKJEP0D7IS", "Overall": "4.0", "Content": "this was the first camera purchase in years and this package gave me everything i needed, the camera bag is a little small and can not hold everything in this kit, but that is a minor detail. everything arrived in one box quickly and the sd card that came with it was a sony class 10 , which by itself is around $40. so this package is a steal at a  price of $169 when purchased", "Date": "November 2, 2012"}, {"Title": "Great Camera!", "Author": "Randy Woods", "ReviewID": "R1YUMQC5RAHTPJ", "Overall": "5.0", "Content": "Very pleased. This is the second Fuji, I have owned and still love my first one. The increase of zoom and mp are perfect for taking any setting or occasion. We take alot of outdoor willdlife and results are great. The bundle package is the way to go and Beach Camera was \"flash\" fast in shipping. Highly recommend this camera and Beach. Thanks!", "Date": "November 15, 2012"}, {"Title": "Great deal !", "Author": "ginifer", "ReviewID": "R1IOB34LCPPQUO", "Overall": "5.0", "Content": "I am so pleased with this purchase .  I received the camera in less than 2 days - unbelievable !  I have been researching for months trying to find the right camera and this is definitely it.  IT comes with everything you need to get started and the quality is excellent.  I would recommend highly .  Takes incredible pictures and is easy to use !", "Date": "November 19, 2012"}, {"Title": "I love this camera!", "Author": "Beth S.", "ReviewID": "R3OLVM11FBCEIV", "Overall": "5.0", "Content": "I am giving this camera 5 stars because I love it!  I love the 24x zoom.  It is taking me a while to learn everything about this camera, but I am so glad that I bought it.", "Date": "November 22, 2012"}, {"Title": "Just what I wanted.", "Author": "Nicola H.", "ReviewID": "R24X73F0VYAXG2", "Overall": "5.0", "Content": "This is perfect! Only took 3 days to get here and the bundle is exactly as described. The camera feels amazing and there is so much you can do with it. You will be pleased with it.", "Date": "November 17, 2012"}, {"Title": "Great deal!", "Author": "DBai", "ReviewID": "RBPOE276NGDM8", "Overall": "5.0", "Content": "So I'm no professional photographer, but for this price range, this camera is amazing! I have an HD video camera already so won't be using that feature much.  However, I received my package at night and took some indoor, night-time pictures.  The quality was great (using the automatic setting).  I even zoomed-in to take a close-up of something on the far wall and even that turned out crisp and clear which is amazing!  Some folks had mentioned graininess indoors, but not sure why I'm not having that issue at all.I've seen a few people who noted that the included rechargeable battery pack doesn't work.  I also thought this until I realized this morning that you have to remove the batteries from the charger (they come already in there) and take off this clear plastic strip that keeps the batteries from being in contact with the metal strip.  Then, when you plug it in, the red lights will come on to show it's charging.  Also- for people who spend a lot of time in different countries, it's great that this comes with the European adapter (very small and portable so you can put it on before traveling) and a car charger.I've seen other folks complain that the case doesn't fit the camera (???).  I am able to fit the camera comfortably, with strap, and put the accessories in the various zippered pockets with space to spare.  I can't imagine how people have had a problem.... except that MAYBE they didn't realize that the internal divider that comes in the case is simply VELCROED IN! Folks- just pull that divider out! I actually scooted it to the side, put the camera in and then put the (included) tripod just on the other side of the barrier so it wouldn't scratch up against the camera.  This divider is made to be adjusted to the shape and position you want! I suppose that if you left it in the middle of the case (as it comes), the camera wouldn't fit, but it's clearly a movable/removable part...One other complaint I've seen has to do with the flash.  First - yes, the camera has a flash.  There's a little button on the left to pop it up.  And  yes, you can force the flash even when the automatic settings don't think you need it! All you do is press the button so the flash pops up and the LCD screen will show you some flash options automatically (red-eye reduction, etc...).  Scroll through those options and the second one is 'force flash' which will fire the flash on all photos (until you close the flash again).Besides that, my only complaint so far with the camera is that the SD card slot is in the battery compartment.  It's a little annoying, but no big deal.", "Date": "June 21, 2013"}, {"Title": "Great Value", "Author": "skoogy99", "ReviewID": "RT8AHGR38V7W1", "Overall": "5.0", "Content": "I purchased this camera primarily to use on an upcoming trip to Africa.  I am impressed so far with the 24x zoom, and ease of use.  Video is also pretty good, and very easy to use.", "Date": "November 19, 2012"}, {"Title": "great camera", "Author": "onnie", "ReviewID": "R2L8G9FYO1UEM0", "Overall": "5.0", "Content": "Love the camera plus all the extras that came with it. Great value easy to use takes great pics. and the zoom comes in handy.", "Date": "August 19, 2012"}, {"Title": "Great camera for a novice.", "Author": "tljyes", "ReviewID": "R15QIS1JBS2HFP", "Overall": "4.0", "Content": "I purchased this camera set after a lot of research and reading many different customer reviews.  This camera works well for me even though I am not an expert picture taker.  It has been fun experimenting with the different settings.One drawback of this whole package is the case.  The  camera barely fits inside and can't close all the way.  I need to buy a new one.  Everything else works well.The price was right and needing to get a different case is no big deal.", "Date": "April 6, 2013"}, {"Title": "fujifilm finepix s4200 camera", "Author": "James Kelly", "ReviewID": "RRH0WTTI59HOY", "Overall": "5.0", "Content": "The camera is everything it was advertised to be.  It is easy to use and has all the features of a more expensive camera.", "Date": "November 21, 2012"}, {"Title": "Love the camera!", "Author": "Laceynsc", "ReviewID": "R3A7MDPTU0J144", "Overall": "4.0", "Content": "Love the camera! The zoom is great! However, the camera bag in this package is worthless. It's too small to hold the camera. So now I've got to spend more $$ to find a bag. I've bought from this company before with no problems, but I am very disappointed that they'd put in a bag that doesn't even fit the camera.", "Date": "April 17, 2013"}, {"Title": "Great camera", "Author": "Jose Oros-Guzman", "ReviewID": "R182PIO7LRYWPT", "Overall": "5.0", "Content": "this was one of the best xmas gifts i gave. take great pictures and does what it needs. the package was very helpful", "Date": "February 15, 2013"}, {"Title": "Great camera for the price", "Author": "Gary H. Myers", "ReviewID": "R4GC5KK780A5T", "Overall": "5.0", "Content": "Does a good job of everything and is very easy to use. I have an Ebay business and needed a camera that does a great job with close ups on small objects and I am very impressed.  I love it!", "Date": "February 8, 2013"}, {"Title": "Surprised!", "Author": "Derfman", "ReviewID": "R33E5LZO7WND6W", "Overall": "5.0", "Content": "I was truly surprised that the products I received with this bundle exceeded my expectations. I have become accustomed to a lot of over-rated, on-line descriptions of merchandise, only to be disappointed upon it's arrival.Great deal for the price. Camera works better than I could hope for.", "Date": "February 4, 2013"}, {"Title": "Contento con el equipo", "Author": "Luis Oliveros", "ReviewID": "R3PVAVJWXPV11M", "Overall": "5.0", "Content": "Este es un buen equipo. Los trámites para la adquisición, envío y recepción se cumplieron con facilidad y oportunidad. Muy contento con esta adquisición.", "Date": "January 23, 2013"}, {"Title": "Good value", "Author": "Cat Fan", "ReviewID": "R13U8PNJXPSM77", "Overall": "4.0", "Content": "This camera bundle was given to my 14-year-old niece as a Christmas present. It came with plenty of accessories, and the camera took decent pictures. I didn't really get a lot of hands-on with this camera; but for the few minutes I spent with this on Christmas eve, it seemed to work well and take good pictures. I personally had a Fuji FInepix S1500 for several years that was a wonderful, little camera. The S4200 is definitely a step up but reminds me a lot of the S1500. I think my niece will appreciate the 24x optical zoom as she continues using this camera. The S4200 would be considered a \"bridge\" camera as it is lightweight and compact like a \"point and shoot\" camera yet it has the feel and advanced functions of a DSLR.Considering the price vs. features/build quality, I would definitely recommend the S4200 as a good choice for one who is interested in moving up a level from a \"point and shoot.\"", "Date": "January 7, 2013"}, {"Title": "Nice Camera and stuff", "Author": "Berry Bitty City Market", "ReviewID": "R2IK3K33T9OSGL", "Overall": "5.0", "Content": "I am still learning the camera, so I'll just say even I have been able to take acceptable plus pictures. The camera is fairly intuitive and the directions seem to have been written by someone whose English is not a second or third language. Overall I am very pleased", "Date": "December 28, 2012"}, {"Title": "Amazing DSLR camera!", "Author": "Rhonda Kay Stiles \"charlie\"", "ReviewID": "R8106XTBQOM7B", "Overall": "5.0", "Content": "Bought this Fuji film dslr camera on Amazon and we are so glad we did.  I could not justify paying a lot of money on a dslr when this Fuji dslr does everything you need it to do.  It is excellent camera and I would highly recommend it. This bundle with the camera was worth it!Fujifilm FinePix S4200 24x Optical Zoom 14 MP 3 inch LCD Digital Camera 16 GB Bundle", "Date": "March 30, 2013"}, {"Title": "I love it", "Author": "Rose", "ReviewID": "R1GGFJIOLDX7ZS", "Overall": "5.0", "Content": "I started looking for small cameras that fit in your pocket on vacation I am not sorry I chose this camera. The pictures are sharp and the bigger zoom allowed me to take pictures that I would have otherwise not taken .  There is much I need to learn as it has many features I have never used before, but I will be I am sure. The price is so reasonable, why would you not buy it.", "Date": "March 26, 2013"}, {"Title": "Best Camera investment", "Author": "Barbara Hodge", "ReviewID": "RLHYYFJ1DT74Q", "Overall": "5.0", "Content": "This camera and all the accessories has been perfect for travel, personal use and documenting incidents at our rental properties.  It is so handy to have the date stamp and the reason I chose this camern was the awesome Zoom and battery type.  Love it.", "Date": "March 10, 2013"}, {"Title": "Nice", "Author": "J. Johnson", "ReviewID": "R3FBY59IXA74AN", "Overall": "3.0", "Content": "Nice camera, the bundle was a good value. Looks like a bigger and more expensive camera. Does great outdoors but indoors, regardless of settings, the colors don't look true. It has nice zoom. Too bulky for vacation but perfect for school functions.", "Date": "March 9, 2013"}, {"Title": "amazing", "Author": "daliisa", "ReviewID": "R17IS6HKZSBMNH", "Overall": "5.0", "Content": "i love love love this camera. im an aspiring photographer  and i wanted to start out a little cheaper than 900$ for a camera and this one takes amazing shots i would definitely recommend it!!", "Date": "February 21, 2013"}, {"Title": "Decent for what I paid for it.", "Author": "Wig", "ReviewID": "R3SZP0CIU4RPIC", "Overall": "4.0", "Content": "I don't proclaim to be a camera expert. I bought this package for my wife because the little point and shoots didn't have enough options for her. She says she likes it much better than than the point and shoots she used to use. It  has more options and takes some pretty good pictures. Overall, a pretty good purchase for a mid level amateur photog.", "Date": "January 26, 2013"}, {"Title": "I am starting to like it.", "Author": "Griselda A. Hernandez", "ReviewID": "R2NL9HLGN1SOWK", "Overall": "4.0", "Content": "I am starting to like this camera. I was giving myself sometime as I had purchased 2 other cameras prior to this one on a home shopping channel that promised to be a great value but were not. So I returned them. upon doing some more research, I came across this camera. Everywhere I found it online, it had no less than 4 stars. So I decided to give it a try. I must say I am starting to like it. I must say, I got a great deal buying the bundle.", "Date": "January 14, 2013"}, {"Title": "Excelente", "Author": "Eduardoi625", "ReviewID": "R11RBPCXEKUKB3", "Overall": "5.0", "Content": "Muy buena camara, excelente precio, lo recomiendo, muy buen vendedor serio y responsable, me llego rapido y sin problemas, ok", "Date": "January 12, 2013"}, {"Title": "Camera", "Author": "Mike simpson", "ReviewID": "RFCSXT0TMDAOR", "Overall": "3.0", "Content": "It takes some getting use to. The picture isn't as clear as i thought it would be. But over all its ok.", "Date": "January 7, 2013"}, {"Title": "Great camera!", "Author": "Dylan", "ReviewID": "R1AN6IO01L6UM7", "Overall": "5.0", "Content": "This is one of the best buys i have made so far. The camera had everything i expected and more! Its not the best camera ever, but the price is very low for the camera/accessories.", "Date": "December 27, 2012"}, {"Title": "Great starter camera.", "Author": "Poohzmama", "ReviewID": "R3448HNPGU0TCR", "Overall": "4.0", "Content": "My son received as a Christmas gift and loves it. I can see him using it for years to come.", "Date": "December 25, 2012"}, {"Title": "exelente", "Author": "Ramon A. Rosario Villa", "ReviewID": "R1I9HTDXU14UG3", "Overall": "5.0", "Content": "esta camara es exelente en cuanto a presio y calida tiene todo lo de una camara profecional a muy buen presio", "Date": "December 25, 2012"}, {"Title": "Incredible value!", "Author": "Leeddy", "ReviewID": "R1FVAGLN3RJXAE", "Overall": "5.0", "Content": "I really love this camera. By no means am I professional but this camera takes some very professional looking pictures. Lots of features, easy to use and the extra value of all the products that come with the camera(tripod, rechargeable batteries, etc.) makes it an incredible value. The camera alone sells for more money at other stores.", "Date": "December 19, 2012"}, {"Title": "Good Camera for the $$$", "Author": "Odoodaday", "ReviewID": "R3EOGMOMK2GMQR", "Overall": "4.0", "Content": "This is my 4th Fuji.  Have also Fuji XP 55wm (waterproof) Fuji FinePix SL300.  My first overall fav was Fuji FinePix S700 which I had for years but broke the stem off the door to the sd card.  It could go forever on 4aa batteries.  Took fantastic pictures and movies even with only 7mp.  This one is similar but slightly bigger and more mp.  Pictures quality is good.  However, the video is fantastic.  I filmed 5 or six 500+mb movies of my friends singing and playing instruments and the sound quality was just great!  So was the picture.  I was amazed.  You do need a tripod if you want picture perfect all the time...if you move about too much, the auto focus tries to kick in. I quickly learned how to get a great music video with a great picture.", "Date": "December 16, 2012"}, {"Title": "Fujifile FinePix  S4200 - Good Camera", "Author": "Johnny Conrads", "ReviewID": "R1HFESH2BA3LP9", "Overall": "4.0", "Content": "I like this camera.  It was a great bargain with the bundled package.  The pictures are really sharp.  The zoom over about 15X really does require a tripod or some kind of support or you get some blurring even with the anti shake feature on.  I think this is typical for large zooming.", "Date": "December 13, 2012"}, {"Title": "Unexpectedly a waste of money", "Author": "Daisy", "ReviewID": "R126USZARCXUZ1", "Overall": "1.0", "Content": "After getting this product, it seemed to be exactly what i thought it would be. It takes great quality pictures and videos...until you want to play them. It does not record sound, and it's supposed to. The HD video is great, although it would be much better with sound. It doesn't take very good pictures without flash, and with flash it distorts the colors. Very good buy if you're looking to buy a starter camera that you won't be doing much with, but if you're looking for something more advanced... don't buy this product.", "Date": "January 28, 2013"}, {"Title": "Bundle review", "Author": "Trina Adams", "ReviewID": "R72Z2ADXBKKIT", "Overall": "4.0", "Content": "I choose the bundle because it had everything I needed in one package.  The neck strap for the camera had plastic clips that broke during the first round of using but company reimbursed me the cost since they cannot break up the bundle.  I appreciate them working with me to make thing right when I could no longer use the camera neck strap.", "Date": "April 21, 2014"}, {"Title": "Inlove", "Author": "bailey", "ReviewID": "R1K121XPFJR37C", "Overall": "5.0", "Content": "I love my camera!!! I use it all the time and its a great starting camera for future photographers !!! love!! love !!!! love!!!!", "Date": "April 7, 2014"}, {"Title": "A great deal!", "Author": "Billy Palmer", "ReviewID": "R3CY0RTZM3GG05", "Overall": "5.0", "Content": "I needed a good close up camera to replace one that went swiming in the Chesapeake Bay. This camera has as many features as my friends which cost twice as much. The flexable stand is useless and is next to my old camera in the Bay. The lens scratch covers don't last very long and come loose. If this one decides to go swimming I'd order another one the next day. AGREAT deal!", "Date": "February 20, 2014"}, {"Title": "Fujifilm", "Author": "Jean Carmean", "ReviewID": "R1R8VHLMTUUL69", "Overall": "5.0", "Content": "So far I have truly enjoyed this camera. Have a few more things to try out that I have recently learned. Can't wait!", "Date": "February 14, 2014"}, {"Title": "FujiFilm FinePix", "Author": "Charlene A. Hecht \"kittyrocks\"", "ReviewID": "R25V8I589QNQ6X", "Overall": "5.0", "Content": "I'm getting used to this camera.  It is easy to use I just need to work with it.  Takes goods pics.", "Date": "January 29, 2014"}, {"Title": "Excellant Bridge Camera", "Author": "Chris L", "ReviewID": "R2EO27EL1HZ8CY", "Overall": "5.0", "Content": "If you enjoy photography, but only have experience with point & shoot cameras, this model is the way to go before you move on to DSLR cameras. It has a manual mode that will allow you to control many of the aspects of a photo (like a DSLR would) & also has many pre-sets to let you capture a good image without trying to remember what the settings should be. This is great when you're learning & need to capture an image in a hurry.The view finder is a nice feature of this camera. Using it will help extend the battery life & also help you to compose & shoot images better. I don't think you'll find this feature on other cameras in this price range.I've had the camera for 3 months & so far couldn't be happier with it. This bridge camera is exactly that - a great bridge between simple point & shoots & DSLR cameras.", "Date": "January 7, 2014"}, {"Title": "updated to a digital camera", "Author": "Knights4u \"Tim\"", "ReviewID": "R2T2N9ABNJ4LMH", "Overall": "4.0", "Content": "finally bit the bullet and brought the digital.  nice camera outfit, great pictures with zoom quality.  obviously not the best camera out there but for the money and a first timer, the camera suits me just fine.  still learning how to fully use all the features available on this unit but for simple photography it shoud work for most users.  nice camera.", "Date": "January 5, 2014"}, {"Title": "Fuji happy!", "Author": "foxtrott", "ReviewID": "R25SLBBU5LC1L6", "Overall": "5.0", "Content": "Its a great camera! Still learning how to use it, but I am very happy that I purchased this camera.", "Date": "November 20, 2013"}, {"Title": "LOVE THIS CAMERA PACKAGE", "Author": "CLB in Syracuse", "ReviewID": "R1GBPWWB1XX1Y", "Overall": "5.0", "Content": "I love this camera!! It has more functions than I probably will never learn without a digital photography class but still, I was able to take good looking photos without reading the very limited instruction manual.( I went online and downloaded the full manual for this camera.) It's a good price for the package and I'm VERY satisfied. I think this would be a good camera package for any novice to intermediate photographer who wanted a quality camera without having to fork out a lot of dollars.", "Date": "November 14, 2013"}, {"Title": "Great camera", "Author": "Jim Gillum \"Jim G.\"", "ReviewID": "R2DALDAM4GBSF3", "Overall": "5.0", "Content": "Fantastic pictures at a great price...easy to use easy to carry...quick service, too....second one I bought....lost the first one...", "Date": "August 23, 2013"}, {"Title": "More features than I know what to do with!", "Author": "Nicole A. Keller", "ReviewID": "R1VDI0KGZ40YD7", "Overall": "5.0", "Content": "I decided to upgrade my camera and picked this.  Very pleased with it.  Takes excellent pictures and has the few features I wanted.  I'm sure it will take me quite a while to figure everything out!  The accessory package is nice, as it includes useful items that I probably wouldn't have thought of.", "Date": "July 11, 2013"}, {"Title": "Great for beginners", "Author": "Kevin", "ReviewID": "R3MSUXPPUK1C97", "Overall": "5.0", "Content": "Took this camera on a cruise and it took awesome pictures for simple people and a beginner! Can't wait to use the baby mode for our soon to be new arrival.", "Date": "June 22, 2013"}, {"Title": "Best Xmas gift", "Author": "Cindy A.", "ReviewID": "ROCBBP0Y294R7", "Overall": "5.0", "Content": "It's works great, I have had plenty of chances to use it and I'm amazing how great and easy it is to use and all the accessories made it more special.", "Date": "June 12, 2013"}, {"Title": "GREAT camera!", "Author": "Renae E.", "ReviewID": "R151MO8N3ITUIH", "Overall": "5.0", "Content": "This camera meets all of my expectations for close-ups of wildlife, flora and grandkids! It is simple to use and has all the features I wanted in a camera.  The price was exceptional, a great value!", "Date": "June 6, 2013"}, {"Title": "BIRTHDAY GIFTR", "Author": "granny", "ReviewID": "R1XZPHVZXU7NFM", "Overall": "4.0", "Content": "THIS WAS A GIFT FOR MY DAUGHTER AND SHE CRIED WHEN SHE OPENED IT.  SEEMS TO BE A VERY NICE CAMERA AND THE ACCESSORY WERE GREAT.", "Date": "June 5, 2013"}, {"Title": "Great Camera", "Author": "Judy", "ReviewID": "R3EM2GB1IGUX1S", "Overall": "4.0", "Content": "only problem i find with this camera is that it absolutely eats batteries....you have to be sure to take them out or the next time you try to use the camera, it is dead.", "Date": "June 1, 2013"}, {"Title": "GREAT VALUE", "Author": "ARNOLD FERNANDEZ", "ReviewID": "RY1RFGMX8IR8V", "Overall": "5.0", "Content": "You can't go wrong with this purchase,  The camera is great for the price you pay and all the extras you get and wortth every penny", "Date": "May 31, 2013"}, {"Title": "great camera", "Author": "henrietta skinner", "ReviewID": "R2RHEAWIIYJB8M", "Overall": "5.0", "Content": "great camera for the price...I got a chance to use it on vacation and it takes great pictures I love it.", "Date": "May 23, 2013"}, {"Title": "OMG!!", "Author": "J'sGoddess", "ReviewID": "R1OTI9IEEV3T0C", "Overall": "5.0", "Content": "The price on this package is amazing!! The camera is absolutely perfect!! The battery charger didn't really work, but no big deal, just use regular batteries. The memory card, seriously HUGE. I can take soooo.. many pics & videos!! Love love love this camera.. Hoping to buy one for my parents and sister. :-)", "Date": "May 22, 2013"}, {"Title": "Camera case to small.", "Author": "Phillip", "ReviewID": "R2B50VHNSAF855", "Overall": "4.0", "Content": "The camera case is to small to carry the camera and all of its belongings.  The case will not close because the case is to small.", "Date": "May 7, 2013"}, {"Title": "Like it", "Author": "Staci", "ReviewID": "R1QJKU2P9PV31T", "Overall": "4.0", "Content": "I am very excited to use this camera.  The pictures are amazing.  The camera case is too small to use for.the camera though.  But this package is far cheaper than the camera itself on most sites.", "Date": "May 1, 2013"}, {"Title": "Great Product!", "Author": "Karen Montgomery", "ReviewID": "R29ISO4Q8KDW82", "Overall": "5.0", "Content": "I am very pleased with this package, I purchased it for my husband.  It is everything he needs for taking great pictures.", "Date": "April 22, 2013"}, {"Title": "SATISFIED", "Author": "Ricardo Falconi Puig", "ReviewID": "RDWLSHOE6BXFJ", "Overall": "5.0", "Content": "I HAVE BEEN VERY GLAD WITH THE CHOICE I MADE AND I AM VERY HAPPY WITH AMAZON'S SERVICES. I JUST RECEIVED WHAT I HAD ORDERED BECAUSE I LIVE IN ECUADOR AND MY WIFE BROUGHT THE ITEMS FROM MIAMI. THANK YOU VERY MUCH.", "Date": "April 16, 2013"}, {"Title": "Excellent Camera", "Author": "Sita Loop", "ReviewID": "RSHJHMVLLX1EB", "Overall": "5.0", "Content": "However, as great as it is, you MUST use a tripod when using the 24x zoom because all the photos will be blurry. No way to hold it still enough to prevent this. This is a drawback.", "Date": "March 18, 2013"}, {"Title": "wife loves it", "Author": "james manring", "ReviewID": "RLPF9R1P30WL2", "Overall": "5.0", "Content": "My wife loves to take pictures so I bought it for her Christmas gift she loves the zoom and clear pics", "Date": "February 27, 2013"}, {"Title": "A great digital starter kit.", "Author": "dvc", "ReviewID": "R28N0PVD7UWTY4", "Overall": "5.0", "Content": "Pro's-good quality pic's and video Pretty easy to use. A good bundle of accessories.  Con's - I have not found any  yet. I wish I had  bought two.", "Date": "February 27, 2013"}, {"Title": "great camera", "Author": "Clint Simpson", "ReviewID": "R3BVZ4YW404F5M", "Overall": "5.0", "Content": "great camera at a great price. everything comes with it. the photos came put better then expected. software works well too.", "Date": "January 22, 2013"}, {"Title": "Great so far!", "Author": "Nicole U. Richins", "ReviewID": "R938XZ8G10W9E", "Overall": "4.0", "Content": "So far my daughter has been trying out all the features and this is a good bridge camera for her to learn on until she can buy a true dslr camera.", "Date": "January 19, 2013"}, {"Title": "My wife loves this camera", "Author": "Brian Frank", "ReviewID": "R38ESM0DR9DS8B", "Overall": "5.0", "Content": "This was purchased as a Christmas present for my wife. She loves the camera and it is very easy to use.The picture quality is very good.", "Date": "January 17, 2013"}, {"Title": "lie it!", "Author": "Nancy Templeton", "ReviewID": "R1PICQWRQ0OHD1", "Overall": "5.0", "Content": "beautiful camera, takes great pics, especiallyfor the price!  Use it for taking photos of artwork for submission to juried shows.", "Date": "January 3, 2013"}, {"Title": "Everything I needed and more", "Author": "Nancy", "ReviewID": "R1U5PCY49ILB64", "Overall": "4.0", "Content": "The Fujifilm Fine Pix s4200 camera was wonderful and included everything you would need to get started on creating pictures.", "Date": "December 31, 2012"}, {"Title": "great product", "Author": "kimmie", "ReviewID": "R2LK8DPVGI03E", "Overall": "4.0", "Content": "I must say i didnt know that the tripod was a mini, but even though it is, i still think it was well worth the price. it will be a christmas gift so we havent used it yet but it looks like its going to be just what we wanted :)", "Date": "December 12, 2012"}, {"Title": "Great Christmas present!", "Author": "Gordon S.", "ReviewID": "R2VO2425C640V1", "Overall": "5.0", "Content": "I have been searching for a camera like this to give as a Christmas present. The shipping was super fast and the Camera package was an unbeatable deal!", "Date": "December 11, 2012"}, {"Title": "Great Camera", "Author": "Dan R.", "ReviewID": "RNTJMUWB8M40L", "Overall": "5.0", "Content": "Fantastic buy; great camera; exactly what I had in mind when I began looking for a new camera! Excellent resources for learning to use the camera. Bundle has everything you need to begin enjoying your new camera. It was shipped the same day I ordered it.", "Date": "December 6, 2012"}, {"Title": "nice camera for the price", "Author": "srednakun", "ReviewID": "R1DUPQMQ6C7TII", "Overall": "4.0", "Content": "Got this bundle over black friday. Great deal for the price. Takes okay pictures, lots of features to play around with.", "Date": "January 30, 2013"}, {"Title": "It's Just NOT an S5000", "Author": "M. Monahan", "ReviewID": "R1JJQR7K9PE3GJ", "Overall": "4.0", "Content": "Fuji makes a fine bridge camera.  My first one (which I still have and use) is an S5000.  It is a 7 mp extrapolated to 10 mp.  It takes an excellent photo.  The main things that are great about it are missing on my other 2 FinePix cameras (an S4000 and the S4200).  As a consequence, I don't find the other 2 as user friendly.The things missing on the other 2 are:1.  a rocker switch on the rear of the camera for framing with the telephoto lens. (The newer cameras have a ring around the shutter button.  This necessitates removing the finger from the shutter button to frame the photo.)2.  a separate slot on the side of the camera to load/unload a card.  (The new cameras require opening the battery compartment to load/unload a card).3.  a focusable EVF.  (The new ones are fixed and are difficult to use as I wear glasses.)The S4200 is a fine camera in it's own right and at the right price.  (My S5000 was purchased in 2004 for over $450.00.  The S4300 was less than 1/2 that price)..  I've since discovered that the S8200 has 2 of 3 of these features.  Maybe next year!Incidentally, the S5000 is no longer available.  If you're in the market for a camera that has many of the features of a DSLR without the high cost, I recommend FinePix Cameras.  Another great thing about all of the FinePix cameras is they use 4 AA batteries rather than a proprietary battery.  Just carry a couple of spare packs of AAs with you and you're good to go for a LOT of pictures.  (The flash does use a bunch of battery, but outdoor or bright lights, you'll get a few hundred shots per 4 batteries.)Have fun!", "Date": "July 26, 2013"}, {"Title": "This bundle was a great deal; but hurry!", "Author": "David P. Miller \"Mitch Miller\"", "ReviewID": "R3VCG5T7H6SLJS", "Overall": "5.0", "Content": "I upgraded from a S5000 (which was great in it's day) and this latest version is the perfect \"next generation\" of the model. However, Fuji is getting away from the AA battery style and opting for battery packs, so they are phasing out the S4200 (4300,4400,4500) series units. Nothing wrong with the camera, just going with the market flow. Since I had a dozen rechargable batteries for the S500, this worked great for me. I haven't used the new camera much yet, but I can tell you if you're not ready to go DSLR just yet, you need to get in on this bundle from Beach Camera through Amazon as soon as possible, cause they're going fast.", "Date": "May 9, 2013"}, {"Title": "Great Camera - Great Accessories - Great Service", "Author": "Craig A Smith", "ReviewID": "R3RLXUWIMADMOQ", "Overall": "5.0", "Content": "No issues whatsoever! Just don't expect a DSLR or something, for this price, get real! That said, awesome amateur camera for this price! My fiance loved her gift. She now has the nicest camera of anybody I know, and doesn't have to stress and guard it with her life as you would if you bought a 1000 dollar semi-pro camera. This is more than adequate for most amateur photographers. Insanely customizable. Easy to use if you don't mind reading the manual when necessary and taking the time to get to know it and tinker with it. That's the fun part if you ask me. If you're not really into it, don't bother. It's no point and click kodak!", "Date": "May 4, 2013"}, {"Title": "Absolutely love!", "Author": "Savy", "ReviewID": "R2KKX9NHA9UU9", "Overall": "5.0", "Content": "I absolutely love this bundle! After years of wanting a professional camera, which was way out of my price range, I did an extensive amount of research, and came across this camera! It is my new baby! Takes amazing pictures, and it comes with everything you need! I just love to take pictures for fun, of everything from people to scenaries, this is a great camera!", "Date": "May 4, 2013"}, {"Title": "Not good at all", "Author": "Fairy", "ReviewID": "R2M7DTHM0AWMKM", "Overall": "1.0", "Content": "Purchased for my niece for Xmas. Sending it back. She wanted a dslr but she is only 11 so thought this would be great. Not so. Very hard to use. Being a photographer myself I thought I would be able t figure it out. Nope. Way to difficult. Sent it back and purchased a used real dslr. Save yourself the time, either purchase a plain point and shoot or invest in a real dslr.", "Date": "December 4, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Fujifilm FinePix S4200 24x Optical Zoom 14 MP 3 inch LCD Digital Camera 16 GB Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/51E5IlUOeOL._SY300_.jpg", "ProductID": "B007RYYVPW"}}