{"Reviews": [{"Title": "ITS GREAT I LOVE IT!!", "Author": "leesa", "ReviewID": "R3OOQJJNLRI1FB", "Overall": "5.0", "Content": "purchased this a while ago not on amazon its blue, and i absolutely love it. And cool features in the camera also.", "Date": "September 5, 2012"}, {"Title": "Kodak is Awesome, wish they still made em", "Author": "Carrie Wilson", "ReviewID": "RACGXKK2ZE4AO", "Overall": "5.0", "Content": "This is a great camera, better than my expensive camera for capturing quick pictures and no blurriness.  I LOVE it and got 1 for my daughter too and 1 for a back up so we have 2 and they r GREAT!!!!!", "Date": "January 4, 2014"}, {"Title": "pretty good quality for the price", "Author": "Florida", "ReviewID": "R34F0HPF2DUHJN", "Overall": "3.0", "Content": "Pros: size, price, screen size, easy share buttonCons: shutter button set too low and hard to find, takes too long in between shooting to snap another photo...but I discovered on my own that you can immediately take another photo if you press the right arrow button next to the ok button (too bad the manual doesn't tell this), the other buttons on top are also hard to select and set too low.Overall a decent little point and shoot camera for the price. I really like the Easy Share button! I just wish the things listed above were a bit more user friendly.", "Date": "February 20, 2013"}, {"Title": "Best Purchase Ever", "Author": "Bindi", "ReviewID": "R1RCQ9OFXUFC6X", "Overall": "5.0", "Content": "Let me just say that this little thing was the best purchase I have ever made! It had everything I needed and more, and not only that, but it was shipped swiftly and safely and I just love it.PROS:Quality of Photos- For it just being a 14MP digital camera, the quality is amazing! I'm using this camera to take photos for my scrapbook and they look great! The lighting is pretty nice, the flash, although BLINDING, works efficiently and does the job for dark places, and for action shots, it's not that blurry (sometimes).Quality of Video-  Let me just say I was not expecting the video quality to be good since it was just going to be used for a digital camera, but it was like having an HD video camera; It's pretty amazing and it even plays back sound, surprisingly!Quality of Camera-  I actually purchased this camera refurbished, so I was a little concerned that the camera would have scratches or be dirty or something crazy because I didn't really know what refurbished meant when I had purchased it.  But the camera was like brand new! The lenses were clean, the LCD screen was clean, not a scratch, dent, mark in sight! And the camera has a really nice gloss and finish overall and the blue is exactly like the picture, so you get what you pay for!Ease-  Now some may argue that the camera is too hard to use, but I found it pretty easy.  Navigating took maybe 5-10 minutes of fiddling around and guesswork but it wasn't very complex at all! The buttons were simple and taking a picture, dressing it up with some features, etc. was not hard to figure out either.Charger is easy to plug it/take out and can be used for other things.  Sometimes I misplace my Kindle Fire charger so one day, I decided to use the camera's charger and it charged it just fine! Didn't expect that but it's a nice feature in case anyone was wondering.CONS:Slow reset- My biggest issue with this camera is that it takes forever or a bit too long to get back into the picture-taking mode.  For example, let's say I take a picture at a football game.  I get one shot of the action and it's a bit blurry so I want to re-take it but the camera isn't done \"showing me the picture\" for a good 10-20-ish seconds, which is a long time when things are constantly moving.  But other than that, there's no problem with picture taking itself, just the slow response to get back into the mode.No strap or place to put one-  I walk around with my camera all the time at games for my school, events, and whatnot, so I like to have it on my wrist and ready like my old camera, however, like my iPhone, it does not have a strap to just carry it on the go or for ready-picture taking. I have to keep it in my little Kodak bag (from an old Kodak camera), which is a little inconvenient, especially if you don't have time to bustle the thing out for the picture you want.  Usually, by that point, the moment has gone if you weren't fast enough.  It's okay that it doesn't come with one, but it would be nice if they had a slot/hole for one so I could buy or make one.***POSSIBLE CON-  This isn't really a con, but it could be for others.  The camera requires a Micro SD card, so keep that in mind before purchasing.  Luckily, my dad had one from an old phone or camera so it wasn't really an issue but I could see how it could be if you were expecting to put a regular SD card in there.Overall, I love this camera so much and although I've only had it for about 4 months, it's a pretty great purchase and does the job way better than those $200+ cameras.  This is well worth the buy and I wish Kodak didn't leave the camera-business.  They make the best digital cameras, hands-down.", "Date": "December 14, 2012"}, {"Title": "kodak camera", "Author": "lorraine", "ReviewID": "RDIN5XM5QUECC", "Overall": "5.0", "Content": "i love the kodak camera.... it is so easy to use..and the pictures are nice and clear.....i am sorry the kodak company is going out of business .", "Date": "November 16, 2012"}, {"Title": "Terrible autofocus", "Author": "Scott", "ReviewID": "RKUGPOW5PYFGC", "Overall": "2.0", "Content": "HI BOUGHT THIS CAMERA A COUPLE MONTHS AGO BECAUSE OF THE LOW PRICE AND IT HAD GOOD REVIEWS. FIRST UP IT WAS CHEAP ($83.00) AND EVEN THAT WAS TO MUCH. SECOND THE PEOPLE WHO LIKED IT MUST HAVE ONLY USED A DISPOSABLE CAMERA BEFORE AND HAD VERY LITTLE CAMERA EXPERIENCE,(NO OFFENCE) INTENDED AND LAST BUT NOT LEAST THEY HAD ONLY TAKEN PICTURES OUTDOORS. THIS CAMERA WAS ABSOLULTELY HORRIFIC INSIDE. WITHOUT BRIGHT SUNSHINE THIS CAMERA TOOK BLURY PICTURES 90% OF TIME AND THE OTHER TIMES COULDNT ENEN LOCK INTO FOCUS. SO SAVE YOURSELF SOME TROUBLE AND SPEND A LITTLE MORE MONEY AND GET A BETTER CAMERA. YOU CANT GO WRONG WITH THE CANON SX260.  THE END.  SCOTT, SYRACUSE NEW YORK PS HOWEVER IT TAKES GOOD PHOTOS IN THE SUNSHINE THATS WHY I DIDNT GIVE 1 STAR", "Date": "November 14, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Zoom in tight or stay wide with the 8X wide optical zoom lens\nDedicated video record button, 720p HD video, on-camera editing\nOne-button upload to e-mail, KODAK PULSE Display and other popular social networking sites\nLi-Ion rechargeable battery and MICROSD/MICROSDHC card slot\nAdd up to 4 GB of memory and be prepared to record your memories at a moments notice", "Name": "Kodak EasyShare M583 14 MP Digital Camera with 8x Optical Zoom and 3-Inch LCD - Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/41niL4mh1TL._SX300_.jpg", "ProductID": "B00739R4KK"}}