{"Reviews": [{"Title": "Great Camera", "Author": "April", "ReviewID": "R31WXEZARXAPDQ", "Overall": "5.0", "Content": "I was a little skeptical about purchasing a Kodak camera given the company's current financial state.  The camera is very stylist-it comes in a variety of colors.  I purchased the purple model.  The camera is very easy to use and the zoom is incredible. You can set up the camera to send pictures to Flickr, Facebook, Twitter, and CVS with just the touch of a button. It has automatic and manual settings and is perfect for someone who is a beginner level photographer. It is extremely easy to use.", "Date": "June 2, 2012"}, {"Title": "My New Purple Camera!", "Author": "PLMcC", "ReviewID": "R18V8SNO4Y7XF0", "Overall": "5.0", "Content": "In the past two weeks I have purchased and returned 3 cameras from a local big box store. Unfortunately none of them met my needs ranging from too complicated to not having an acceptable zoom and speed though such was described by the manufacturer. Finally decided to go back to my old standby....AMAZON! Having owned Kodack cameras in the past, the Kodak Easyshare Z5120, in purple no less, immediately caught my eye. I received the camera within four days of ordering it. It was packed very securely. The grip is comfortable and secure to hold. It is nicely balanced which comes in handy when using the zoom feature.....less jiggle! The zoom feature takes wonderfully crisp pictures even when fully extended. Macro pics came in so detailed that it showed that someone around here needs to take up a dustrag. There are some fun features. I've taken pictures in dim and bright conditions with success. There are options to allow you to play around with some of the settings but nothing too complicated. Its not a SLR by any means but neither is it a plain old point and shoot. There is absolutely nothing about this camera that I do not like. Buy them while you can....I don't think you will be dissatisfied.", "Date": "October 29, 2012"}, {"Title": "Fantastic camera, great photos and easy to use.", "Author": "James P. Reynolds", "ReviewID": "R3EUJAD6LSCK", "Overall": "5.0", "Content": "This camera besides being a gorgeous color of purple takes great photos. The automatic setting allows quick shots or you can take more control with the manual setting and get creative.", "Date": "December 31, 2012"}, {"Title": "Easy to use and great quality pictures", "Author": "Deborah", "ReviewID": "RVRPQW3454A6G", "Overall": "5.0", "Content": "This camera is ideal for people who are not photographers, but want to take decent photos for a holiday, vacation, and day-to-day events. The camera focuses great on distant subjects--we got some great shots of hot-air balloons, allows the user to zoom in to take close up portraits without putting the camera right in the subject's face, and by using the SC card, we could take one shot after another around the Christmas tree, and not worry about getting the perfect shots so we don't waste film. The price was excellent, and the delivery prompt,", "Date": "December 27, 2012"}, {"Title": "Decent Camera", "Author": "thegoodlife", "ReviewID": "RRQIUFD0SCZW0", "Overall": "4.0", "Content": "I recently had a Kodak Z981 stolen and replaced it with this camera, which I find takes fantastic photos.Pro's - Price, Picture Quality, Zoom Capabilities, Ease of UseCon's - Camera struggles with action photos when zooming in, Camera will from time to time freeze up - forcing us to turn-off and then back on.", "Date": "April 15, 2013"}, {"Title": "Love my Kodak Easyshare Z5120 Digital Camera", "Author": "Roger A. LeBlanc", "ReviewID": "R14ZA9SWCNV7F3", "Overall": "5.0", "Content": "My son and I bought one each. It beat out my expensive Sony by a mile. More Zoom, more Pixels, and soooooo much more.I talked my brother and sister into buying one, and they love theirs too.", "Date": "February 27, 2013"}, {"Title": "Could not be happier. It does everything well.", "Author": "Tara Shipley \"Outdoor Princess\"", "ReviewID": "R32AK6HQ1HNKHP", "Overall": "5.0", "Content": "I asked for and received this camera for Christmas after reading all the reviews on it I could find and I can say it has truly exceeded my expectations. This camera is just as well built as my other two Kodaks, feels good in the hand and is not too heavy or light. It took a little bit to figure out how to use (why read directions?!) it but it has been fun learning. I have used it to take many kinds of pictures so far; low light, sunlight, in the snow, with zoom and super macro and it has done everything well after I found the right setting for each. I strongly recommend getting good rechargable batteries because like other digital cameras it will eat batteries and I also use a good class 10 SDHC memory card. The only thing that I thought was pretty lame was that it didn't come with a wrist strap but I put one on it right away because I am so scared of dropping it and I just ordered a really nice padded one that should make it feel more secure. Two tricks I've learned with it so far are if you want to take pictures of fire at night use the \"sport\" setting (flash off) and in other low light applications without flash use a tripod. There is absolutely no way I can hold it still enough/long enough for a clear photo in that setting.  I am really impressed with this camera and look forward to learning more and taking many more great pictures with it.", "Date": "April 5, 2013"}, {"Title": "Great camera!", "Author": "Marilyn Lake", "ReviewID": "R3THZSNQLNFFDH", "Overall": "5.0", "Content": "I bought this camera a couple years ago through WOOT. Takes very good photos for what it is. But, even better it shoots very high quality 780p video. Check out \"Rattlin' Sabers\" on you tube.", "Date": "April 24, 2014"}, {"Title": "Takes great pictures", "Author": "ChriS", "ReviewID": "R15OB7563WBZ5J", "Overall": "5.0", "Content": "I was looking for a new digital camera when I found this on amazon. The price was very good for the features offered. I am very happy with this camera it has 26 times optical zoom, and a whole range of automatic and manual settings. I always get good pictures with this camera. Very easy to use.", "Date": "March 7, 2014"}, {"Title": "Great Purple? Camera", "Author": "Joe R.", "ReviewID": "RH9J7823N5RM0", "Overall": "5.0", "Content": "After reading a ton of reviews on cameras in this price range there was no comparison.  The zoom is remarkable, photos are very clear, audio sounds great.  I don't use the Easyshare system but the other settings work fine.  Get yourself one,  Purple??", "Date": "June 12, 2013"}, {"Title": "Awesome", "Author": "SLL24", "ReviewID": "R2NRHR7WHNOOP1", "Overall": "5.0", "Content": "So far so good!  Glad to have a camera that does not show red eye!  Keeping my fingers crossed that it keeps working...", "Date": "April 4, 2013"}, {"Title": "Love it!", "Author": "Karry L. Hardy", "ReviewID": "R10P6FC0VZJ844", "Overall": "5.0", "Content": "Have already taken lots of pictures that have turned out beautifully! Only wish that Kodak still had the Easy Share feature available.  That part really sucks that I cant use a eyefi card and download directly to Facebook!", "Date": "April 2, 2013"}, {"Title": "Awesome camera", "Author": "Lara E. Bee", "ReviewID": "R313ARIHEKJZBV", "Overall": "5.0", "Content": "I've had this camera for a couple of days and have taken about 88 photos with it so far. I am very impressed with the photo quality---blue eyes and green eyes really stand out in the photos. I'm very happy I bought this camera and look forward to taking a lot more photos with it.", "Date": "February 16, 2013"}, {"Title": "Very good camera", "Author": "Bruce Turner \"mahler  rules!\"", "ReviewID": "R3P9Q5MTNRDG6B", "Overall": "4.0", "Content": "I've had some time to play with this camera, and in broad daylight it takes very sharp and contrasty pictures.  I've owned several digitals in the past, to even include the Panasonic DMC-FZ35, which is quite a bit more expensive and always gets stellar ratings, and the pictures from this Easyshare in broad daylight are quite a bit sharper.  The opposite is the case, though, in low light without use of the flash.  With the flash, again, the pics are clearer and sharper.  The macro is ok, not great, and you won't be able to focus on items full frame smaller than a little larger than a CD cover.  All in all for the price, if you are using this camera outside in moderate light situations, this is a great performer.  The lens does not have screw threads, though, so you will not be able to use filters (ie, polarizers).  My rating:  4 1/2 starts for solid day light situations.  For low light without flash, get another camera.", "Date": "February 16, 2013"}, {"Title": "Tough to choose ... 4 or 5 STARS", "Author": "Debrinka \"Deb\"", "ReviewID": "R28SYZY5GJ3CFZ", "Overall": "4.0", "Content": "I bought this camera to replace a 5 mp Kodak that actually worked great.  Just wanted a better zoom and more mp's.  First of all, love the color.  It's fun to have something other than black or silver.  It's taken me a bit to figure out the best settings for the best shots, but for the most part I'd say I'm happy with 8 out of 10 pictures.  Outdoor photos turn out beautifully.  The zoom is incredible, though I like to take distance photos (beaches, mountains, etc.) from a moving car and those don't always work out as well.  The videos I've taken come out crisp and clear ... One of the best parts of the camera.  I'm a bit befuddled as to why the card was put in alongside the batteries.  I prefer to transfer pictures over from the card to computer instead of using the USB cord (it's faster) taking the card out and then putting it back in can be frustrating as shutting the battery/card cover is difficult.  No wrist band, but I bought a cute (blingy) purple lanyard that works great.  Overall ~ Glad I bought it.", "Date": "June 2, 2013"}, {"Title": "great camera", "Author": "forrest reaves", "ReviewID": "RHJSPDZ2SWX6", "Overall": "5.0", "Content": "love the canera.easy to use and takes great pictues.just plug it into your computer and it does all the work for you.", "Date": "March 23, 2013"}, {"Title": "Great Camera!!! Horrible Company!!!", "Author": "Niekini1503", "ReviewID": "R7OVD10C5V5N0", "Overall": "4.0", "Content": "The camera itself is awesome.  takes great clear pictures, and i love the video record button.  it feels natural to hold and isn't awkward like some bigger cameras.  Although i love the camera i highly recommend you do not buy from this company.  they ship on their own time like there is nobody waiting for the package on the other end.  I ordered the camera on a Saturday night and was given a time frame of 3-5 days which would have been perfect for the event i was going to the next Saturday.  They didn't ship it out until the fourth day of the original time frame and then told me it would be another 7 days.  I tried to contact the company to figure out why it was taking so long, but there is not phone number on their website or on their profile with amazon.  the only way to contact them is an email through amazon, which i suspect is their way of avoiding angry customers like myself.  when i finally received an email back from them all they could say is that they shipped it the same day i ordered it which i can prove is a lie because i have the original order.  please do not support them they are what i call a fly by night company.", "Date": "June 28, 2012"}, {"Title": "smaller than expected", "Author": "Grecekia", "ReviewID": "R24U3CWUI6O9TW", "Overall": "3.0", "Content": "The camera was small and not in a manufacturer box when shipped, though it was supposed to be new. My Mom was happy for the fast delivery but not the packaging of the camera. It was just placed in a USPS box w/o cushion. Camera works well enough but only has used a few times sine she received it. Will update if anything else happens.", "Date": "December 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Closer, wider, better... everything about the KODAK EASYSHARE CameraZ5120 was designed to deliver\nFrom the dramatic 26 mm wide-angle lens to its impressive 26X zoom, this 16 MP workhorse provides extraordinary performance at every angle\nIts Optical Image Stabilization and the intelligent Smart Capture feature ensure that even the tightest shots will stay rock steady and come out looking as crisp and sharp as can be\nThe exclusive Share button makes sharing your pictures and HD videos to Facebook and more incredibly simple and is also optimized for Wi-Fi sharing with an Eye-Fi wireless memory card (Eye-Fi card not included)\nOne-button Wi-Fi sharing with Eye-Fi card: Kodak's Share button makes it easier than ever to go wireless with an Eye-Fi card-the memory card that gives your camera Wi-Fi capability", "Name": "Kodak Easyshare Z5120 Digital Camera - Purple", "ImgURL": "http://ecx.images-amazon.com/images/I/41wdAF-o%2BpL._SX300_.jpg", "ProductID": "B007RNJAMC"}}