{"Reviews": [{"Title": "Good Camera for everyday use", "Author": "Deathgripsugar", "ReviewID": "R535OIBA78ISN", "Overall": "4.0", "Content": "I bought this camera because I needed something to document my motorcycle commute in case someone (knock on wood) hits me or almost hits me. I also got this camera to document some longer trips and scenic routes.MY camera came with:-a USB charging cord (standard USB (not micro usb like on cell phones), if you have a Garmin or something, you might even have a spare USB that will work)-Quick Start instructions- Flat surface adheasive mount-Curved surface adhesive mount-Goggle mount***You will need to buy a micro SD card (32GB max, class 10) don't be cheap here, buy a known brand so you don't get write errors***Pros:-Removable battery (big big plus, since you can swap out a dead battery with a fresh one)-Water Resistant (can't dunk it, but good enough when caught in a downpour (haven't tried it yet however)-Decent video quality (720p is okay, some pixelation is visible on a hi-res screen but nothing that I care about)-LCD screen (for: aligning the view, changing settings on the fly, and for previewing videos (although the screen is small))-The remote control is neat-Easily removable lens cover-Easily adjustable camera angle and lens orientation.Cons:-Not 1080p (some people care, some don't)-The internal microphone is useless at speeds over 40mph in the wind there are all kinds of jury-rigging approaches including tape, (and i can't make this up) socks, and a combination of both, but if you care about sound then you should look at a camera that has the ability to attach an external mic.-You can't tell if the camera has stopped recording unless you hear the sound ( I think it makes a \"beep\" but if you're riding you probably won't hear it)or you can see the recording light has changed color (it's on the side of the camera). I get around this by just letting it record when i start, the battery will die long before the 32GB card fills up.Overall I recommend this as a good \"working man's\" camera. It does the job but has some limitations, but not any that would force me to pay $200 more for another camera.Notes:The battery lasts a little over 2 hours with the following settings:-720p-30fps-sound off-LCD off 20 secondseverything else is on default.-2 hours of recording is about 8GB on your card (using the aforementioned settings)-Buying the Wasabi spare batteries and chargers are strongly recommended so you can swap batteries (http://www.amazon.com/gp/product/B007KCNKP8).", "Date": "May 20, 2013"}, {"Title": "Battery doesn't charge fault.", "Author": "BinkysDad", "ReviewID": "R1TXQ1PSAO7JSV", "Overall": "3.0", "Content": "I have had a few different action-cameras and, apart from my GoPro, they have all ended up failing one way or another.I bought the Drift 720HD as an inexpensive little camera to use when I didn't want to risk my GoPro.I love the design and the sturdyness and the value and I especially like the mounts and the remote that are included in the pack.Unfortunately mine arrived with a dud battery that would not charge.  Looking at the Drift Innovation Facebook page there are an increasing number of people with the same problem.HOWEVER (and this is really important) I contacted Drift Innovation and they sent me a new battery really quickly.  I am now very happy.", "Date": "October 27, 2013"}, {"Title": "Very Nice Gear!", "Author": "chobbs42", "ReviewID": "R18JPE1R1K9P7C", "Overall": "5.0", "Content": "I purchased this camera for recording my RC planes in action.  Wow!  The video quality is super clear with a wide field of view.  I made a hat mount for the camera with the provided hardware which allows for the camera to track with my head movements.  I am using a 8 GB SD card to capture my recordings which I have never filled to capacity during flight sessions at the field (Usually 5-10 minutes per flight x 10 flights).  Supplied battery has always lasted through two to three trips out before recharging.  The remote works as intended; however, I usually use the on-board controls to start and stop recording.  I am totally happy with the purchase and would recommend to others looking for a great sport FPV type camera.", "Date": "September 27, 2013"}, {"Title": "Just Okay", "Author": "NukeLift600", "ReviewID": "R18Q0QUK9H55HO", "Overall": "3.0", "Content": "Records fine, but the mic is not so great to picking up sound and the video quality is alright. the biggest problem is the viewing on the camera itself. the camera freezes whenever i try viewing recorded videos", "Date": "August 24, 2013"}, {"Title": "Wind noise", "Author": "Ryan hagins", "ReviewID": "R346JL0FSVKFIZ", "Overall": "3.0", "Content": "Has good picture and sound. But the problem is the wind noise when riding. Depending on how you use this cam it may or may not be good. The only problem I have is the wind noise.", "Date": "April 28, 2014"}, {"Title": "BATTERY FIX!!!!!", "Author": "Doc", "ReviewID": "R12XEZQJ6T31GT", "Overall": "5.0", "Content": "My son's Drift HD720 would not come on or charge the battery.  There is a YouTube video that  suggests a fix for the Gopro camera with same problem.  This did not work for GoPro but did for the Drift.  I cannot find the video now but basically....1.) remove battery from camera. 2.)plug in charger to camera. 3.) after 5 minutes replace battery and turn on camera.  It might be turn on camera then replace battery.  This fixed his camera and it now charges fine.Iwish I could reference the correct video.", "Date": "February 16, 2014"}, {"Title": "Dead Battery, wish I could use the camera!", "Author": "AAron Rossi", "ReviewID": "R15T0HHGIAFP1W", "Overall": "3.0", "Content": "I'd give this camera a better rating, but the battery won't hold a charge for me to use it. I have to be after market batteries eventually to make it work. Been doing my research,  and seems I'm not the only one this has happened to!", "Date": "January 27, 2014"}, {"Title": "Great for a low budget camera", "Author": "discepati", "ReviewID": "RB8GLQYYGSLL7", "Overall": "4.0", "Content": "Camera seems to work fine. The refurbished model had no damage whatsoever visible to it. Came in a small non marked box.", "Date": "January 24, 2014"}, {"Title": "The provided battery died.", "Author": "Abraham M. Beane", "ReviewID": "R1QNDKWC5SJTJ1", "Overall": "3.0", "Content": "I'm glad I bought the spare battery set and charger as the included battery is dead.On the whole, the camera functions well and even in low light transitions through daylight to sunset to darkness. Also operates well under nautical twilight conditions.Microphone pulls in wind noise. Lots of wind noise.Works well as a shoulder cam for inspection work on foot. Picks up voiceover well.Only beef is the battery is toast.Note: save your videos to your computer and reformat the mini-sd chip once in a while.", "Date": "December 15, 2013"}, {"Title": "did not charge but customer support at drift is great !", "Author": "Scott Hoffmann", "ReviewID": "R13SRCMIRPN93C", "Overall": "1.0", "Content": "It did not charge, but drift was nice enough to send me the 1080 as an upgrade for free and i love that one", "Date": "November 13, 2013"}, {"Title": "Battery no charge", "Author": "Cristian Rodriguez", "ReviewID": "RGFX4HF1IEY75", "Overall": "1.0", "Content": "The battery stopped charging after the first charged, shines blue when connected to the charger and off automatically in drift hd 720", "Date": "October 10, 2013"}, {"Title": "Product is good but can be purchased far cheaper from Manufacturer", "Author": "Uklemond", "ReviewID": "R23JODF8I6DO23", "Overall": "4.0", "Content": "Make sure you check the site [...] before paying over the odds on Amazon.  Im looking at the product now on a featured merchant who claims you are saving 77 dollars when infact they are selling it for 45 more than the rrp.  At the time of writing this, you can get this camera for $129 which is the RRP.  Do not pay more.That said I LOVE THE CAMERA.  It does exactly what i want it to do.  I drive my scoot 70 miles a day on my regular commute, and this thing will capture exactly what i see.  That means if for any reason i witness an incident, so has my cam, and on two occasions that footage has been provided to the police to assist.  All bikers should have one :)  It is light and can be mounted on helmets, the bike chassis or infact anywhere you need it to be.  There are some mounts that you can purchase extra to get that better angle, but out of the box this is a great camera.", "Date": "March 26, 2013"}, {"Title": "OK for a first action cam", "Author": "phila_guy", "ReviewID": "RXX28VDYIXFWO", "Overall": "3.0", "Content": "Got this on close out at a brick and mortar store. As others have noted, the battery that comes with it is DOA and will not charge (it's probably been sitting in the box for a long time and got depleted beyond the point where it will charge again). Tried another unit at the store and same thing. Filed a problem ticket with Drift Innovations regarding the battery and all they asked for is a scan of the receipt which I emailed back to them. The replacement battery came in about 5 days via USPS. I also updated the firmware to the latest version.Since my weekend bicycle rides take longer than 2 1/2 hours, I just plugged the camera into the 1 amp outlet of a USB 10200 mAh external battery. Left the internal battery in to preserve my settings when I unplug the external USB battery. The external USB battery does charge the Drift's internal battery. I'm looking to get a smaller USB external battery to make the camera/battery combo smaller. Using a class 2 16Gb SDHC card, the camera records a 720p 30fps video for 1 hour 28 minutes at which point it starts a new recording. This is reproducible but not really an issue for me. A class 10 SDHC should fix this problem.Overall, satisfied with the camera. It handles vibration pretty well since I pump my bicycle tires to 115 psi, the camera is mounted on my handlebars, the bicycle fork is rigid and the roads I ride on are not glass smooth. No hiccups at all with the recordings. Playback on linux of the .mov files is not a problem for VLC. Kdenlive can edit the .mov files and avconv handles the video encoding.I did have a one time problem where the camera's LCD display just showed the Drift logo with \"Get Out There\" and then a blank screen. I shut the camera off, turned it back on again and held all 4 buttons down simultaneously which did a camera master reset. The camera ran as normal after that.", "Date": "August 28, 2013"}, {"Title": "battery wouldnt hold charge", "Author": "Nata Leigh", "ReviewID": "R1PIMLOAOUTMRM", "Overall": "1.0", "Content": "I bought 2 of these, one for myself and one for my fiance. Neither one of them worked. They would turn on and record while plugged in to their charger but as soon as you unplugged them they died. I left them charging for 24 hours and they still would not work correctly. Returned for a refund.", "Date": "May 5, 2014"}, {"Title": "Perfect product!", "Author": "ALEKS", "ReviewID": "RK1SSYQ5C1YR", "Overall": "5.0", "Content": "Camera with good video quality, very powerful mounting!I recommend for ski and moto sports.Is a pity that included one battery, grabs her by an hour, I recommend to buy a second battery.", "Date": "March 26, 2014"}, {"Title": "we love the drift", "Author": "Melissa Leveillee", "ReviewID": "R7GY93ZRPWXNX", "Overall": "5.0", "Content": "we are so impressed with this action camera and the amount of video it stored truly impressive we took on vacation and every piece of filming was perfect!", "Date": "January 28, 2014"}, {"Title": "good product", "Author": "Sam", "ReviewID": "R38B1R5WMOFOO7", "Overall": "5.0", "Content": "great pic and product.. set screen to off, to increase battery life.  good picture quality and easy to use .", "Date": "January 6, 2014"}, {"Title": "Great!", "Author": "Kristopher L.", "ReviewID": "RWS9WOTSU9NOE", "Overall": "5.0", "Content": "Exactly how I expected. No stickers but that's okay. It came with everything I needed to start. And it was cheap!", "Date": "January 2, 2014"}, {"Title": "battery was doa", "Author": "Michael Tenzer", "ReviewID": "RZFRZ2H11QF7G", "Overall": "2.0", "Content": "Battery dead on arrival as many reviewers stated. Camera otherwise is fine. Just plan to get a battery somewhere else.", "Date": "December 15, 2013"}, {"Title": "i put the battery in  and a card in  and it works good but the weather has been to bad to use it", "Author": "bob thomson", "ReviewID": "R1C77WKMDAIXE5", "Overall": "4.0", "Content": "its too early to rate anything really because I,m not taken it out in the cold and freezing rain but I do know it was easy to set up and seems to work good indoors", "Date": "December 14, 2013"}, {"Title": "Great action cam for the price", "Author": "TriggerhippY", "ReviewID": "R13WGYNSI7FNCI", "Overall": "4.0", "Content": "I only gave this cam 4 stars due to the low price that I got it for.  Otherwise, I'd give it a lower rating had I paid more because of it's poor video quality.  The cam produces pretty grainy video and the plastic lens creates frequent lens flares when the sun hits it.The cam records in .MOV format but I would've preferred that it record in .MP4 format like most modern cams record in.Also, the battery was totally dead when I received the cam but was able to get a new one pretty quickly by contacting Drift's customer support.The best features on this cam are the built in LCD screen and the easily rotatable lens.  If I had to purchase another action cam in the future, it might be another Drift due to the built in screen and the rotatable lens.  It just makes the cam more versatile but I do admit that the GoPros offer better recording features and better video quality.", "Date": "October 21, 2013"}, {"Title": "Great camera... poor battery", "Author": "Daniel E. Blalock", "ReviewID": "R1DMRR1X3ZDBIT", "Overall": "5.0", "Content": "I like the camera.  The battery would not charge from the start.  I contacted customer service and they are sending me a new battery.  If the new battery will charge then it will keep the five starts...otherwise, I will have to revise.", "Date": "October 14, 2013"}, {"Title": "Works", "Author": "Rick Holland", "ReviewID": "RUS9I53K7YUI", "Overall": "4.0", "Content": "Works great including remote, very compact, only negative is wind noise if mounted on a moving airplane or car prevents recording any other audio. Moving .mov files from camera to a PC or Mac is simple, plugin USB and drag and drop.", "Date": "October 2, 2013"}, {"Title": "great for its price!!!", "Author": "Christian Santos", "ReviewID": "R2C44RRGUCDPKP", "Overall": "4.0", "Content": "as good as my contour at 720p res. with a built in viewfinder and remote all for under $100 u cant beat that.", "Date": "July 1, 2013"}, {"Title": "Good Camera for everyday use", "Author": "kakhaber", "ReviewID": "RJAZOWOZVWKQX", "Overall": "5.0", "Content": "I recommend you buy a good camera for bicycle and ski area is ideal for use on a motorcycle and it's good", "Date": "June 10, 2013"}, {"Title": "Good Action Cam", "Author": "Truth Be Told", "ReviewID": "R25LLR5MU1TMW5", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2A8YBR2XXTM3UembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2A8YBR2XXTM3Urefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2A8YBR2XXTM3UchiDiv\").innerHTML = document.getElementById(\"cv_mo2A8YBR2XXTM3UhiddenPre\").innerHTML;\n};\ncv_mo2A8YBR2XXTM3Urefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2A8YBR2XXTM3Uso;\t   \n\n\nfunction cv_mo2A8YBR2XXTM3UloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2A8YBR2XXTM3Uso = new SWFObject(swfLocation, \"cv_mo2A8YBR2XXTM3UAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2A8YBR2XXTM3Uso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2A8YBR2XXTM3Uso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2A8YBR2XXTM3Uso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2A8YBR2XXTM3Uso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2A8YBR2XXTM3Uso.setAttribute(\"height\", swfHeight);\n          cv_mo2A8YBR2XXTM3Uso.setAttribute(\"width\", swfWidth);\n          cv_mo2A8YBR2XXTM3Uso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2A8YBR2XXTM3Uso.write(\"cv_mo2A8YBR2XXTM3Uflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2A8YBR2XXTM3U', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2A8YBR2XXTM3U';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2A8YBR2XXTM3U', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2A8YBR2XXTM3UloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2A8YBR2XXTM3U\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m154PYJYKCL6PH\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m154PYJYKCL6PH\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R25LLR5MU1TMW5\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m154PYJYKCL6PH/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2A8YBR2XXTM3Uduration')) {\n      document.getElementById('cv_mo2A8YBR2XXTM3Uduration').style.display='none';\n    }\n    cv_mo2A8YBR2XXTM3UloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2A8YBR2XXTM3UloadSwf(movieID, playerVersion) {\n   return _cv_mo2A8YBR2XXTM3UloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2A8YBR2XXTM3UnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2A8YBR2XXTM3U', 0, h);\n}\n\nfunction cv_mo2A8YBR2XXTM3UresetPlayer(w,h,bw,cc) {\n  cv_mo2A8YBR2XXTM3UnewHeight(h);\n\n  cv_mo2A8YBR2XXTM3Uso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2A8YBR2XXTM3Uso.addVariable(\"cacheCode\", cc);\n  cv_mo2A8YBR2XXTM3Uso.setAttribute(\"height\", h);\n  cv_mo2A8YBR2XXTM3Uso.setAttribute(\"width\", w);\n  cv_mo2A8YBR2XXTM3Uso.write(\"cv_mo2A8YBR2XXTM3Uflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2A8YBR2XXTM3URollOverImg = new Image();\ncv_mo2A8YBR2XXTM3URollOverImg.src = \"http://ecx.images-amazon.com/images/I/81Izi4Y7bBS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2A8YBR2XXTM3Upreplay = document.getElementById('cv_mo2A8YBR2XXTM3UpreplayImageId');\nif (cv_mo2A8YBR2XXTM3Upreplay) {\n  cv_mo2A8YBR2XXTM3Upreplay.onmouseover = function() {\n    cv_mo2A8YBR2XXTM3Upreplay.src = \"http://ecx.images-amazon.com/images/I/81Izi4Y7bBS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2A8YBR2XXTM3Upreplay.onmouseout = function() {\n    cv_mo2A8YBR2XXTM3Upreplay.src = \"http://ecx.images-amazon.com/images/I/81Izi4Y7bBS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2A8YBR2XXTM3Upreplay.parentNode;\n\n  var cv_mo2A8YBR2XXTM3UcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2A8YBR2XXTM3UcurrentClick) {\n      return cv_mo2A8YBR2XXTM3UcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:10 MinsThis is a great action camera for under $100.00. I use it as a dash cam and helmet cam.Here are the tech specs:  Video resolution: 720p and SD  Video format: 16:9  File format: .MOV (H.264 codec)  Sensor type: CMOS  FPS: 720p - 25/30 fps SD - 25/30/50/60 fps  Recording angle: 720p and SD - 130°  Lens rotation: 300°  Lens focal range: 0.5m to infinity  Zoom: ×4 (digital)  Photo mode: 5 megapixels  LCD Screen: 1.5\" colour TFT  Remote range: 3m (9.84ft)  Radio frequency: 433.92MHz ISM band  Built-in memory: 32MB  Memory capacity: Micro SD memory cards up to 32GB  Exposure: Auto / Manual (advanced users)  Connectivity: USB Plug & Play, mini-B USB connector  Compatibility: Windows XP & up / Mac OS 10.2 & up  Camera - 106 (L) × 55 (W) × 38 (D) mm / 145g  Remote - 52 (L) × 40 (W) × 13 (D) mm / 19g DC 3V (1xCR2032 battery included)  Power: - 1110mAh rechargeable lithium-ion battery (included); DC 3.7V  Camera Remote - DC 3V (1×CR2032 battery included)  Built-in microphone  Water resistant  Standard ¼ 20 thread for use with most tripodsI love that it has a rotatable lens. This allows me to mount it on the side of my helmet and on top of my helmet and still keep perfect viewing angle. At 720p a 30min video is about 1.19GB. Compare to other low budget action cams that I own this is by far the best. The built quality is excellent, the menus are easy to navigate,the lcd screen is small but it is very clear and easy to view past recording. It is also great that the battery is rechargeable.The only con is the internal mic picks up a lot of wind noise when riding. the battery life is good for close to 3 hours of recording before needing a recharge.I have uploaded a video showing day and night recording. The night portion of the recording is without the low light(night mode) setting activated. Since Amazon only always 100mb max for video uploads I had to split and join the video to make it fit so the video looks kind of grainy. The raw video data look better. There also seems to be an issue with the entire video not playing something must have gone wrong during the upload. I upload another video soon.I also did not experienced any issues charging the battery as other reviews have mentioned.", "Date": "September 30, 2013"}, {"Title": "battery does not charge", "Author": "Gabriele Grunig", "ReviewID": "RXM5O7CPJOHKS", "Overall": "1.0", "Content": "the Drift HD 720 camera would be just fine, but the battery does not charge.  I put it in the correct direction, updated the firmware, disconnected and reconnected everything, but the battery still does not charge.  I found the facebook site for drift and one of the posts is concerned with the no-charging issue of this camera.  Apparently, this has happened to many customers and no solution is offered.  One of the customers tried 3 cameras of this kind and the battery would charge in none of the three.Amazon.com only accepts  returns on this items, no replacement option is given.If this camera had a battery that worked, then everything else appears to be fine, just like the other customers have indicated.  The camera is very light, the remote control works, firmware update works.  Drift has posted a lot of tutorial videos that are easy to follow.", "Date": "July 13, 2013"}, {"Title": "Dead on Arrival", "Author": "Richard A Drennan \"R Drennan\"", "ReviewID": "R1C8SO742ZMASQ", "Overall": "1.0", "Content": "I received the item promptly, opened the box, it appeared as if it had been opened and used before. Installed the battery and attempted to charge it. After the recomended two hours as stated in the instructions I removed the unit from chariging cord and tried to turn it on. It did NOT work. I plugged it back in and tried again, it came on only when plugged in to power. I checked the battery with a Volt/Ohm meter and the battery was charged but appearantly the fault was in the camera. Be cautious the units at vastly reduced prices from unreliable sources. FGorunatly it was honored for return by Amazon A to Z and they paid for retun shipping and said they would credit back my money... We will see.", "Date": "November 14, 2013"}, {"Title": "This Camera Can Survive A Fall From A Roof: VIDEO PROOF", "Author": "Mr. R. C. Stowell-smith \"Robert SS\"", "ReviewID": "R3NYMSI40K6J44", "Overall": "4.0", "Content": "I picked up this camera as i was testing out some cheaper alternatives to the GoPro.Thought the price and the reviews were good so got one, Now i climb builings etc as a hobby so i didn't know how much damage this camera could take from lets say a fall.. but oh boy when the camera fell and ended up rolling of my roof.. it survived!with only a few scratches, as promised here is video proof:[...]", "Date": "May 14, 2013"}, {"Title": "Camera Looks great. if only the battery worked", "Author": "Michele Lynch \"michelelawe\"", "ReviewID": "R1420G3VYZ3T5I", "Overall": "1.0", "Content": "seems we have been afflicted by the same problem that many others have reported.  Battery arrives dead and unchargeable. Hopefully i will get sent a new battery and can update my rating once i can use the camera.", "Date": "December 26, 2013"}, {"Title": "Great support...it's a good start!", "Author": "Robstar", "ReviewID": "R1O80D6RSCU7O2", "Overall": "5.0", "Content": "As some of the other reviewers have noticed, the battery came dead out of the box.  I charged it overnight and it still wouldn't turn on.  I checked it with a multimeter & it showed 0.00v output.  I contacted Drift support and they got back to me within about 6 hours and only wanted a scan of the receipt.  I saved my amazon invoice to pdf, removed my cc digits & sent it to them.  They accepted this just fine.  They said it would take at least 3-5 days for the battery to come which would have been after the start of my trip.  Luckily, due to the other reviews here, I also bought a 15000mah external battery to run the camera from.  This seems to power the camera just fine.  I did ask them if they could get it to me any quicker, but they said they couldn't, but offered to send me 2 batteries instead of one!  Overall I had about 3 support responses in 12 hours, which is way faster than pretty much any other company I've dealt with.Support response has been fast, professional & courteous.  I will update my review after my trip & upload some video footage from my motorcycle.", "Date": "September 13, 2013"}, {"Title": "Great and affordable action camera", "Author": "Alejo_7_7", "ReviewID": "R1BH5855R8PGOW", "Overall": "4.0", "Content": "I've got this to mount for my motorcycle and I'm really happy with the purchase, the image quality is good, the sound is great and doesn't get so affected by wind noise, the remote control is also a nice featura that allows you to operate the camera no matter where it is mounted. The bad part is that now I want the drift ghost or the gopro3 to improve the video quality...The only problem I've had with the camera was a software block that it presented after a week of use, fortunaly after updating the firmware the problem was gone, so don't worry if the camera freezes when you change the video configuration. The forst thing to do after unboxing the camera must be the software update.", "Date": "August 3, 2013"}, {"Title": "This is a great camera", "Author": "WhiteandNerdy", "ReviewID": "R37ZL3FFQ1344U", "Overall": "5.0", "Content": "I bought this camera because I wanted a action camera to where I can record biking and other outdoor activities. It records amazing 720p video and it fits the palm of your hand and you can find a lot of mounts online to fit this camera, and place it just about anywhere. It is a water resistance camera and durable, I rode in the middle of a hard rain; still worked. I have not tried having the camera fully submerged without a case and I won't try soon.", "Date": "July 29, 2013"}, {"Title": "Works great.  As long as you don't intend to record any action...", "Author": "R. Vernon \"FrankenPC\"", "ReviewID": "RIKJP0L18G3GQ", "Overall": "1.0", "Content": "I purchased it.  I did the initial battery charge.  I put in a 4GB micro SD card.  I pressed record and let the unit record until the battery ran out (~1.5 hours...maxed out the SD card).  I removed the card and played the resulting BORING video on my PC.  Great!  Two days later, the unit is freshly recharged.  I'm at the Stunt flying school.  I do three test recordings with the unit mounted on my \"cans\" (headset and mic).  Works GREAT!  I get in the plane, press record, check everything...it's recording and I do my flight.  40 minutes later we roll to a stop and I check the camera.  The red light is on, but nobody is home.  It's frozen.  The video file is corrupt.  That's right.  When it came to actually recording a priceless experience, it UTTERLY failed.  I returned the junk pile to Amazon.  If this company is reading these reviews, take this message to heart:  ALL the bells and whistles are TOTALLY worthless on a device like this if it can't be RELIED UPON to perform its most basic function.  Good by.", "Date": "May 15, 2013"}], "ProductInfo": {"Price": "$229.99", "Features": null, "Name": "DRIFT HD 720 Professional HD Action Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/31O5wkko1CL._SX300_.jpg", "ProductID": "B007XTRM16"}}