{"Reviews": [{"Title": "Perfect Mother's Day Gift", "Author": "Ray", "ReviewID": "R33WB53V5B2NPA", "Overall": "5.0", "Content": "Bought for my mom who is a grandma of two. Upgrade from her Canon SD powershot. The best features for us so far are:our Pros:-Light weight-thinner than Canon SD powershots-children cartoons in front and can add music playing-do not need to remove microSD. plug the camera into computer. Just remove the wall prong end of the charger and the same chord can be plugged into the computer.-do not need to remove battery. Just plug in the charger into the wall and the chord into the camera.-you can even charge the camera while it's in the provided case.-to add more photo space, we set to 10M, which can fit 1,250 pictures with the 4G included.-If you distance yourself enough, the flash can produce good vibrant colors in auto mode (here auto mode is called Smart mode).-w/o flash, the colors via auto mode are pretty vibrant and accurate. Not too orange or blue, etc.-there's is a dedicated button on top jsut to turn on the lcd in front.-very colorful menu whose options look like iphone app icons. it's not touchscreen as far as i know. other cameras are jsut simple white text menus.Con:-switching from Photo-Video-Children mode is not in one menu. You have to go through tiny menu tabs that are only text. Not as intuitive, but one can get used to it. I was expecting a simpler menu or a switch that goes from photo to video at least. you need to go to the menu to go from photo to video to other modes. Seems like it's market was aimed towards teens and mothers of children.There are many other features we don't need like wi-fi, emailing directly from the camera, tranfering photos from camera to smartphone wirelessly, panoramic merge, color magic, fun distortions, but for our use, it's perfect and great price. So that's why i'd give it a 5 star.This kit comes in ONE box, not separate boxes like one for the camera, one for the SD card, one for the pouch. The kit is shrinkwrapped in one Samsung box. So that you can wrap as a single gift.other than the semi-intuitive menu, this is packed with more features than we need.", "Date": "May 14, 2012"}, {"Title": "Not ready for prime time or Mac users", "Author": "fgm2001 \"fgm2001\"", "ReviewID": "R2QOJ3KHBA8JUT", "Overall": "1.0", "Content": "I had a Samsung EX1 that died.  Couldn't be repaired or replaced under warranty because of no parts.  Huh? It is still currentAnyway, Samsung apologized and, after almost a month of receiving the camera finally refunded me.I did see some new EX1's but since there are no parts I did not buy another.I wanted a camera that had a swivel LCD so I could use it at odd angles and the EX1 also has a remote.No other Cameras have that.I saw this one had \"remote viewfinder\".  Exactly what I wanted.Even though designed to work with Samsung phones Samsung does make an app for the iPhone so I bought it.Well, the app didn't work.  I tried everything to no avail.As has been mentioned in other Samsung smart camera reviews Samsung Customer Service is worthless so I Spent a great deal of time searching online for a solution.I looked and looked.Finally I found where someone had gotten theirs to work on their iPhone.Seems all you have to do is flash new firmware on the camera.Now, with most cameras that's a simple process.  You go to the manufacturers web site download the new firmware to a memory card, put it in your camera, turn it on and Voila!  New firmware.Well, not Samsung.  The only way to upgrade the firmware is by connecting the camera to the computer and downloading the new firmware directly to the camera via their software.  BUT!  Their software IS NOT MAC COMPATIBLE!  ARGHHH!I decided to try to borrow and use a friends windows computer to upgrade.Before that happened the thing froze up.  Lens extended no functions!  Battery freshly charged.Had to remove the battery to reboot.  The next day, same thing!Sent it back to J&R; who promptly refunded me.Sorry, but do to having two different model Samsung cameras die and the lack of support of Samsung I can not recommend this camera or Samsung cameras in general.If you do buy one consider an extended warranty that offers a refund if not repairable as you will definitely need it.That is in the rare event your new camera lasts more than a year.I did find a solution but at a much higher cost than this camera but comparable to the EX1I purchased a Canon G-12 with an articulating screen and added a non OEM remote trigger.  Both available here.", "Date": "July 23, 2012"}, {"Title": "super rapido", "Author": "francisco martinez", "ReviewID": "R3N2GFUOYK3HX2", "Overall": "5.0", "Content": "muy buen producto y excelente calidad todo perfecto en cuanto al empaque, todo fue enviado  a tiempo y con rapides", "Date": "December 17, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.0\" TFT (460k) LCD Screen\n5x Optical Zoom / WiFi Connectivity\nCase And 4GB Card Included\nSD/SDHC Memory Card Compatible", "Name": "Samsung 16MP Camera / 4GB SD / Case Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/41eoLU6UeZL._SY300_.jpg", "ProductID": "B007XOQ2PI"}}