{"Reviews": [{"Title": "LOVE IT!!!", "Author": "Mwelling - VA", "ReviewID": "R29YQ6RGFH1MRA", "Overall": "5.0", "Content": "I purchased this bundle for myself last week and it came yesterday.  I absolutely love it.  This is the best camera I've ever owned.  Very easy to use and has so many added features.  I would highly recommend to anyone looking for a camera for every day use.  It's very small and fits into my wristlet allowing me to take it anywhere.", "Date": "November 29, 2012"}, {"Title": "What a deal!", "Author": "George E Ocegueda", "ReviewID": "RKV2QJ4B02LFC", "Overall": "5.0", "Content": "I was about to buy this camera on Walmart's websitefor $199 plus shipping when I remembered to check Amazon's price. I bought this whole package deal for under $130.  It arrived quickly and extremely happy with the quality of the camera. We now take perfect self pictures thanks to the dual view screen. The wi-fi also makes sending pics to other devices and facebook so simple. We are very happy with this Camera!George Ocegueda", "Date": "February 8, 2013"}, {"Title": "Good deal", "Author": "Paul", "ReviewID": "R2IXAH0AJPYML0", "Overall": "5.0", "Content": "This package was cheaper than purchasing the camera and the case separately.  Little tripod, cloth, etc were just bonus materials.  Also comes with a card reader that can be used to import data/photos from any type of SD card.", "Date": "December 28, 2012"}, {"Title": "It is noisy in \"Smart\" mode.", "Author": "James T. Peel \"Jim Peel\"", "ReviewID": "RF0U3AZC3GM1C", "Overall": "4.0", "Content": "The camera and its attendant accoutrements are just great. The value is stunning compared to what you can get for far more.However, in the \"Smart\" mode the thing makes clicking and motor sounds. It does not do this in \"Auto\" mode. The only thing I can come up with is that it is apparently trying to stay focused, etc., as you move it around when you are waiting to take the next picture. The sounds are annoying and it obviously is using battery power when it is making these sounds. Other than that, we are happy with our purchase and the price.", "Date": "November 25, 2012"}, {"Title": "Not bad at all", "Author": "Phi", "ReviewID": "RTBZPW0KGAGRL", "Overall": "4.0", "Content": "I love the fact that it contains wifi connections allowing the user to post on social media such as facebook and even to send pictures or videos via email. However, the fact that the display is not a touch-screen makes it a big task to use arrows to enter captions or email addresses etc. but having a samsung galaxy phone or tab makes it very easy to use the mobile link app to transfer pictures via wifi from the camera to the phone or tablet in just a matter of seconds.The scenes and modes are amazing except for the night mode which takes forever to capture and reveal the picture taken. One of the modes that really fascinates me is the children mode. It REALLY DOES DRAW CHILDREN'S ATTENTION AND WITH SMILES TOO!The front facing camera display.....AMAZING. I dont have to worry about cutting off my forehead or one side of my face anymore.I am not too familiar with other cameras but I must say I used to enjoy taking pictures with my Iphone and now thats been traded for my DV300F. Its so small and flat that it fits in wallet easily.It may not be suitable for professionals or persons who are used to more advanced cameras but for the average user or beginner its easy to use and fun to work with", "Date": "May 28, 2013"}, {"Title": "A delightful camera!", "Author": "Ikey G", "ReviewID": "R2LNRRA3UI2WNH", "Overall": "5.0", "Content": "I am impressed with the ease of use. The camera takes beautiful pictures. I love how easily it fits in my pocket when I don't want to carry a bag. The weight makes it almost unnoticeable in your pocket.", "Date": "January 27, 2013"}, {"Title": "Great camera!", "Author": "Lauren Casey", "ReviewID": "R2HQPRYC5E8MHQ", "Overall": "5.0", "Content": "I take a lot of pictures, including a lot of self-shots with my husband, and I LOVE this camera.  It is very easy to use the and front screen is very helpful for taking pictures of me and my hubby.  The pictures are very high resolution and great quality.  I highly recommend this camera to anyone", "Date": "January 2, 2014"}, {"Title": "wonderful camera", "Author": "Larry candler", "ReviewID": "R2SN8G6BFQO174", "Overall": "5.0", "Content": "I love taking pics of myself and my new grandson! So easy to use and many cool features to enjoy!", "Date": "June 12, 2013"}, {"Title": "Tricky", "Author": "S. Barrow", "ReviewID": "R1BFR9Y1QDTDJT", "Overall": "2.0", "Content": "One of the memory cards got stuck in the slot and i still can't get it out. Also, doesn't come with everything you need.", "Date": "June 7, 2013"}, {"Title": "Great camera for point & shoot", "Author": "Marvin Francis P. Roman", "ReviewID": "R25RW2DZK1PPG2", "Overall": "5.0", "Content": "If you looking for Point & Shoot camera I recommend this one. The only CONS you might whine about is the zoom or optical because it only 5x. If Samsung had put more on it probably one of the best Point & Shoot camera in the market. What more you can get on this one. Dual screen, Wifi and with 16MegaPixel. Zoom/Optical zoom naaah", "Date": "April 30, 2013"}, {"Title": "great deal... lots of extras great pictures love the dual view not taking pictures of my chin anymore", "Author": "lisa moquin", "ReviewID": "R1CODO7ARDKOK3", "Overall": "5.0", "Content": "what a great little camera ..... love it  so small but great pictures and the fact that I can send them right from my camera is a great feature", "Date": "April 27, 2013"}, {"Title": "Excellent!!!", "Author": "Curious", "ReviewID": "R1TXVRSX3IKXC6", "Overall": "5.0", "Content": "The camera is simply amazing. The dual view (ie front display) has made taking family pictures a lot of fun.", "Date": "April 4, 2013"}, {"Title": "LA CAMARA ES MUY BUENA", "Author": "jose", "ReviewID": "R34NK59ZFWENAD", "Overall": "4.0", "Content": "MUY BUENA LA CAMARA... SE LES RECOMIENDA; TRAE MUCHOS ARTICULOS POR MUY BUEN PRECIO, SE LES RECOMIENDA, MAS NADA QUE DECIR", "Date": "April 1, 2013"}, {"Title": "great camera", "Author": "D. L. Wittrock \"dlw\"", "ReviewID": "R14G09WIU8FYOI", "Overall": "5.0", "Content": "I bought this as a gift for a teenager, he absolutey loves it , especially the screen on the front since kids are into self photos", "Date": "April 1, 2013"}, {"Title": "camara", "Author": "denny rojas", "ReviewID": "R2F2L8PM5BAKGL", "Overall": "5.0", "Content": "excelente el producto esta conforme a lo que se requirio y lo que el vendedor ofrecio, lo recomiendo ampliamente se", "Date": "March 26, 2013"}, {"Title": "Camara", "Author": "Orlando Anaguano", "ReviewID": "R2XVHQOWQHCF9", "Overall": "5.0", "Content": "Muy Buen producto efectivo y como lo esperaba la camara sin defectos todos sus accesorios de buena calidad y con garnatia...", "Date": "March 26, 2013"}, {"Title": "great  team", "Author": "raul perez", "ReviewID": "R2TO6LG00OMM6D", "Overall": "5.0", "Content": "The packaging is excellent perfect thank you very muchrecommended the product is of very good quality, is all that I expected of it, is a product that I recommend to all the amazon community.I recommend it very appropriate material is expected in this type of product", "Date": "March 14, 2013"}, {"Title": "great camera with a great package", "Author": "Matthew", "ReviewID": "R2AQXHKTO6XZKG", "Overall": "5.0", "Content": "This camera takes incredible shots with a great range of effects and options. My fiance loves it with the hidden front view camera to take self or small group pictures without a cameraman. You can even upload your pictures to the web straight from the camera itself!", "Date": "March 12, 2013"}, {"Title": "excelente", "Author": "Krieger Black", "ReviewID": "R2WLHYZKUW3N8K", "Overall": "5.0", "Content": "entrega segun lo indicado asi como todos los accesorios y buen estado del mismo. Recomiendo el producto y al vendedor", "Date": "February 17, 2013"}, {"Title": "LOVE IT!!!", "Author": "paul&taylor", "ReviewID": "R9EMN7Z7JTPQF", "Overall": "5.0", "Content": "Got this for valentines day love it great quality pictures and very good camrea best by far, OH YEAH and CHEAP!!!", "Date": "January 24, 2013"}, {"Title": "Nice Package", "Author": "Mark1", "ReviewID": "R3H1XL63DNGJR6", "Overall": "4.0", "Content": "This is a great package put together by Beach Camera. All of the accessories may not be necessary but they are nice to have. This camera is fantastic. Takes nice pictures and has a big display screen to view them. I would recommend this to anyone looking for an affordable camera that is high quality.", "Date": "January 22, 2013"}, {"Title": "excellent service and product", "Author": "kim andre", "ReviewID": "R1RXQ4D39QY1FI", "Overall": "5.0", "Content": "it came in the expected time and the product was what it was advertised, would recommend to anyone looking for a great camera package", "Date": "January 19, 2013"}, {"Title": "Excelente", "Author": "Gerardini Rivas", "ReviewID": "R2PKVGPTTLOHCV", "Overall": "5.0", "Content": "Buenas nochesExcelente productoEn buenas condicionesPerfectoLindo100% SatisfechaMuchas GraciasGerardini RivasDesde El Tigre Anzoategui Venezuela.", "Date": "January 8, 2013"}, {"Title": "Fantastic camera", "Author": "Thang Nguyen", "ReviewID": "R1V90HGTLFGEQU", "Overall": "4.0", "Content": "Got this for my gf for Xmas. She loves it, the front facing camera is great for going out and snapping pictures with friends, the entire package is great.  Tripod is good also, stays in place and not else to say about it, the rest of the items are just nice little bonuses, but he camera it self is really easy to use and takes high quality pics.  Shutter speed is a little on the slow side but this camera is just ment to take pictures on the go with friends and family, so its not a big deal.  It also comes with a lot of cool shooting modes like panorama which is really fun to use.", "Date": "December 27, 2012"}, {"Title": "Decent bargain", "Author": "Amy bauman", "ReviewID": "R1K7GREARW1JGT", "Overall": "4.0", "Content": "This was my daughters Christmas gift.  It seems to take good pictures.  Wish it came with paper instructions rather than having to look on the computer.  Still have to dig into the manual to figure things out.", "Date": "December 27, 2012"}, {"Title": "rsr", "Author": "Rebecca Reeves", "ReviewID": "R9ND7R1YM5CKC", "Overall": "4.0", "Content": "Too much blurry pics, maybe I just need more practice with it. It is very small and I LOVE the front image showing. I have fun with it, but I usually go back to my old camera.", "Date": "December 25, 2012"}, {"Title": "Met Expectation", "Author": "Sri", "ReviewID": "R2YEQGE7S8PKL1", "Overall": "4.0", "Content": "Met my expectation. Delivery was faster and had all the items promised in the package. Though i would personally prefer buying a class 10 SDHC card instead of Class4.Camera is good but there times when it tests your patience. There is a delay from the time snap button of camera is pressed to when actual snap is taken.", "Date": "December 25, 2012"}, {"Title": "Awesome camera", "Author": "M. Heilbrun", "ReviewID": "R1811CNQN1I60X", "Overall": "5.0", "Content": "This camera kit is simply amazing. It does all kinds of cool things. The accessories are worth the purchase in itself. They send me a 16gb micro sd card with this kit. The camera is nicely built. It also has alot of cool functions. I would recommend this to everybody. Great fun, great deal.", "Date": "December 11, 2012"}, {"Title": "Great Product", "Author": "SB", "ReviewID": "R3RFHDN24O91ZC", "Overall": "5.0", "Content": "I read the ratings on this product and saw alot of good reviews..I ending up getting this right before a party i was going to and was unable to read the directions on how everything works, but it was so easy to use and my pictures came out amazing!!It also has a little spot on the front of the camera when you take the picture everyone can see how it came out and your able to take your own picture since it has a reverse camera effect..Ive bought a few cameras before this one and have return them, and im glad this one is just perfect for me.", "Date": "December 10, 2012"}, {"Title": "Good, but..", "Author": "Diane Gavino", "ReviewID": "R3TTX7UXTW9TR", "Overall": "3.0", "Content": "I bought this because my baby's due in 2 weeks, so I wanted to have a camera to take better quality pictures of her than my phones camera would. I loved this camera as soon as I got it. But getting the flash to work is VERY frustrating and a waste of time! It takes forever and sometimes you miss the moment you were trying to capture just by trying to get it to work! I've tried changing the settings, but just nothing worked.. no good.", "Date": "March 12, 2013"}, {"Title": "Unsatisfying.......", "Author": "Mongo", "ReviewID": "R3N9YM940FRU42", "Overall": "2.0", "Content": "I really had high hopes for this product, especially with all of the positive customer reviews. I bought this deal and the warranty for it. The camera itself.... does not take the best pictures.... The quality of the pictures almost look like webcam quality except a little better. I am very disappointed. The neat things about this deal was the bundle that came along with the camera. The camera may have some nice little features, like the photo edit and all. But if you are looking for a GOOD camera that can take some GOOD pictures, this camera is MOST DEFINITELY not the one! The little features it has, are just gimmicks to cover up for the crappy photo quality. Buy this if you wish... but it honestly... isn't great. I've had better cameras that cost just as much as this. The mp & mm of the pictures and lens do matter... Not always will the bigger number of mp will be the better... Overall, I am quite disappointed. The only use of this camera for me is to mess with it's gimmicks. I am currently ordering another camera that will be so much more worth my money.", "Date": "March 16, 2013"}, {"Title": "Doesnt work to take pictures at night", "Author": "lilly", "ReviewID": "RUUFITQA2P5YI", "Overall": "2.0", "Content": "Samsung DV300F Dual View Smart Camera - Black (EC-DV300FBPBUS)I used it during the day and it was perfect. I loved it. until I used it to take pictures at nights. It takes forever to take the picture and the quality is horrible and blury. I am so disappointed. I wish I could returned it.", "Date": "May 12, 2013"}, {"Title": "Camara Samsung", "Author": "Hugo Morales", "ReviewID": "R2TJZOQ2ZC2NA3", "Overall": "5.0", "Content": "Hello I am very pleased with the purchase. In addition to the transaction and delivery was fairly quick Venezuela therefore no hesitation in recommending them. Excellent attention.Hola me siento muy complacido con la compra del producto. Ademas que la transacciòn y entrega a Venezuela fue bastante ràpida, por consiguiente no dudo en recomendarlos. Excelente atenciòn.", "Date": "September 25, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": "Samsung DV150F 16.2 -megapixel DualView Digital Camera Bundle Includes 8 GB Memory Card, Card Reader, Deluxe Carrying Case, Mini Tripod, and 3Pcs. Lens Cleaning Kit.", "ImgURL": "http://ecx.images-amazon.com/images/I/51UOMQp6eqL._SY300_.jpg", "ProductID": "B007ROR5E6"}}