{"Reviews": [{"Title": "I LOVE IT!!", "Author": "Nima", "ReviewID": "R2BHB9B88H1CIN", "Overall": "5.0", "Content": "Birthday Present from my mom~ My very first personal camera (I usually use my aunt's canon) and I love it! I'm not a professional photographer but this camera takes really crisp pictures! Zoom is pretty good and the face tracking is really accurate~ Pixels are not all mashed up when you zoom in it warns you when you zoom in too much and you notice the increasing blurriness of the photo. Pictures in low light look really good also as though there was a light source present. I have yet to experiment much with the videos but it from the little videos i've shot, the video is pretty clear.The fact that I don't have to go mad looking for AA or AAA batteries is a SUPER PLUS! Miss perfect picture moments because of batteries and nobody loves that~  You do have to buy a memory card because the camera doesn't come with one.Terrific camera! I don't know how much she paid for the camera so I cannot comment on the price.", "Date": "March 31, 2012"}, {"Title": "SLOW Entry Level Camera", "Author": "R. Boss", "ReviewID": "RAMCM6PHXXQYW", "Overall": "3.0", "Content": "I picked up the S3300 at a Sam's Club because my S8000 started acting up while on vacation. I thought by staying in the Nikon family, all would be well.  Big mistake!!!  The extra $100 to get you into the next class of cameras is well worth it if you are more than the occasional photographer.CONSIt's S-L-O-W.  Painfully slow....so slow, that I returned it and got my money back.It's slow (and difficult) to get all 9 focus boxes to appear for a crisp clear picture.It's slow to save the picture to the SD Card (class 10)It's slow to transfer the pictures out of the camera to your computer (at least this can be fixed by taking out the SD Card and connecting it directly to your computer)30% of my pictures were blurry. Most likely because it takes forever to focus. I shot about 1000 pictures on my vacation.  30% (300) blurry photos, that's a lot.PRO'sAs crappy as the camera is to take a STILL picture, it takes great pictures while you're moving (go figure). It has a \"sports\" setting allowing you to take pictures of something that's moving, or from a moving car...and they look great!Being able to see the screen in bright daylight is also a big plus with Nikon cameras.", "Date": "June 12, 2012"}, {"Title": "Great point & Shoot!", "Author": "coolmomx2", "ReviewID": "R3012MQIR08JJQ", "Overall": "5.0", "Content": "I just got this camera yesterday and have been taking pictures in all different kinds of lighting.This camera has done great in even a dark room.I am very pleased with how quiet it is whichwill be great when shooting video's.Haven't been able to get a great super close up yet butI think that is due to my lack of understanding on just how to use all the functions of the camerajust yet.I'm not a professional photographer but as a capture every moment mom of two I havetaken thousands upon thousands of pictures.I've been through many camera's (Samsung,Kodak,Fuigi)to name a few none have come close to the quality of picture of this Nikon.I am very happywith this camera so far.I love how compact it is and the fun colors it comes in.", "Date": "May 10, 2012"}, {"Title": "Superior Nikon Quality", "Author": "Terry Schumacher", "ReviewID": "R2S06EDL6X7OJ2", "Overall": "5.0", "Content": "I have been a faithful Nikon Coolpix customer I have followed the product line all the way from the beginning, It is an excellent camera in the compact line. I love all the new features presented with this model. This item lives up to its description. I give Nikon an A plus for innovation and design. Thanks for introducing the rechargable battery.", "Date": "April 15, 2012"}, {"Title": "Indestructible?", "Author": "S. Salisbury", "ReviewID": "R16NHMKHN4CJOB", "Overall": "5.0", "Content": "My mother bought this camera on Amazon for my 10-year old daughter for Christmas.  It seemed perfect for her - very slim and easy to operate.  My daughter loved it immediately.  Unfortunately she left it outside on our swingset ... for almost a week ... and it rained/snowed every day.  They only reason we found it is that it had sleeted/snowed one night, and the kids were out playing the next morning.  I heard my daughter WAILING as she discovered the camera.  It was frozen to the swingset, encased in ice.We brought it inside and packed it in uncooked rice (an old tech trick to dry out electronics) for the 1% chance it might still work.  I assumed that was the end of the story, and that we would call this an expensive lesson in taking care of your possessions.After several days, I pulled the camera out of the rice, popped the battery back in it, and TURNED IT ON!!!  It came on just as if it had been sitting in a drawer for a week, instead of outside in winter precipitation!  I proceeded to take several pictures and played with some settings and it worked fine.  There wasn't even any moisture inside the lens.  My daughter was absolutely thrilled and has been snapping photos ever since.So I have to give it to Nikon - they made one heck of a camera here.  It's good to know that something that is meant to be taken out into the world and used is sturdy and well made.", "Date": "January 25, 2013"}, {"Title": "blurry pictures", "Author": "Upshifter", "ReviewID": "RHV09E63OI9Y4", "Overall": "1.0", "Content": "I bought a new Nikon S3300, but it was the worst small camera that I've ever had.  The pictures are blurry and have smeary artifacts.  I tried everything I could to get it to work right, even talked to other people.  Finally, disgusted, I wrote it up and sent it to Nikon's repair facility for repair.  It took 2 or 3 weeks turn around time.  They gave me a list of things they did to fix it.  It came back as blurry as it was when I sent it in.  I took it back to the dealer and got another camera.  I suppose some people will be satisfied with the S3300, but I'm not.", "Date": "October 1, 2012"}, {"Title": "Great P-N-S for the money.", "Author": "Nathan Holsopple", "ReviewID": "RSA2ESCT1N4DL", "Overall": "4.0", "Content": "I was shopping for a camera at Best Buy and I came across this little gem for $80. Instant buy.The 6X optical zoom and image stabilization (digital zoom is relatively useless as it just pixelates your photo the more you zoom!) is extremely effective and can capture moving objects quite easily. At this price-point, I'd highly recommend this camera to casual photographers on a tight budget.", "Date": "February 2, 2013"}, {"Title": "Excellent Pocket Camera but died early", "Author": "J. Mcclain \"Grampa Joe\"", "ReviewID": "R2GZJY7WIS5TNJ", "Overall": "2.0", "Content": "I'm retired, so don't have a lot of money for a good camera, to replace my defunct old SLR film camera. I'm not very \"techy\", so it had to be easy to use, intuitive menus, and still produce quality images.  You can't do better for the money.  It's worth a lot more to me than what I paid for it.  Everyone raves about the picture quality, and I just run the images through PC Paint to reduce the size for emailing.  I've stopped using the flash at all, because the camera is fast enough to work without it, indoors or out.  I use it daily, just for fun, and it does wonderfully.Well, I took it out to use, and it would not focus, the gave a lens error, and is now nonfunctional as of Aug 6, 2013. Had hoped it would have lasted longer!", "Date": "January 31, 2013"}, {"Title": "Quick, easy, nice pictures", "Author": "Valerie G. Aarne \"Valerie G.A. Grossman\"", "ReviewID": "R3TS8ODYYS21IC", "Overall": "5.0", "Content": "I have a very nice camera that I enjoy ... however it is hard to travel with.  I bought this camera to stick in my purse, so I could have a camera when I traveled.  It has now gone around the country with me and worked out quite well.  It takes nice pictures of people and nature.  The zoom works quite well.  Transferring pictures to my computer is easy.  I am very pleased with this camera. (and I struggle with technology ... but this is even easy for me!)", "Date": "September 30, 2012"}, {"Title": "nikon digital camera", "Author": "Steve", "ReviewID": "RVG1ES60J7DAQ", "Overall": "3.0", "Content": "The camera is a compact camera.  The face recognition has trouble locking on in crowds.  I have more blurry pictures than clear ones if there is multiple people in the picture or any movement.  As long as theere is no movement or a couple people the picture is clear.", "Date": "November 5, 2012"}, {"Title": "Wow! I'm super satisfied", "Author": "Bill A. Holcombe \"pethead\"", "ReviewID": "R45WRKVUJQR5E", "Overall": "5.0", "Content": "I've been looking to replace my compact camera and finally decided on this one. Upon opening the box, I was surprised how small it is. Gave it a test shot and wow ...what a great picture. The box included image transfer and movie editing software. This camera takes photos like my expensive large digital camera and is small enough to carry around like a cell phone. I highly recommend it to anyone who is looking for a compact camera that great pictures for under $100.", "Date": "October 26, 2012"}, {"Title": "Wow.  Nikon.", "Author": "Ray Woodcock", "ReviewID": "RF3KTWGE4D00E", "Overall": "5.0", "Content": "I had a very positive reaction upon opening the box.  It is really refreshing to open a product and see the things you'd expect, like a user's manual and a CD.  And then to go to the manufacturer's website and see downloads, FAQs, and more manuals.  Right from the start, I felt like I had really gotten a deal -- like this used to be a $300 camera, and they put the love and attention into it that you'd put into selling a $300 camera.Now, some additional notes, as I got into the website and the camera.The manual didn't tell me where to find my serial number, and neither did the product registration page.  Neither the outside of the box nor the bottom of the camera indicated that the number shown there (which, inspection confirmed, was the same) was the \"serial number\" OR \"S/N.\"  Oddly, the Nikon product registration page indicated that no manuals or updates were available, when that was obviously not true.I wish electronics manufacturers didn't find it necessary to use proprietary jacks and cables.  That includes this Nikon.  It would be a lot easier to pack for a trip, and there would be less risk of leaving an essential cable at home, if they would all just use the standard mini-USB cable.  One cable would handle everything.I installed the carrying strap, battery, and SDHC memory card.  Mine came with a 4GB class 4 SDHC memory card, but I replaced that with an 8GB class 10.  I had one lying around.  Not sure if that helped.  It didn't hurt.The Nikon website is not well organized.  For instance, I found myself at a page offering the answer to my question.  But I had not asked any questions.  The question being answered was, \"Where can I download the latest Nikon software updates?\"  That was a good question.  This page did not quite answer it.  It showed 20 different updates, with no indication of which, if any, applied to my particular camera.  Apparently I was supposed to load the included CD first, see what was on it, and infer that the only software applicable to me was whatever would be on the CD.  But even then, no dates were supplied:  I didn't see how I could tell whether the website's offerings were more recent than those on the CD.Starting with the CD, I looked first at the proffered ViewNX2 software.  I wasn't sure I needed it.  I had prior experience with unnecessary camera software.  I already had image editors I liked.  I figured out that the included recharger was just a transformer, from 120V AC to the USB input needed by the camera, so I put that part back in the box and just ran the USB cable directly from the computer to the camera.  As soon as I connected that, the camera turned on and let me set date and time.  I also got a dialog on the computer, offering to let me browse or import pictures, etc.  So I held off on installing ViewNX2 for now.That meant I didn't download any other updates.  There was one possible exception.  Somehow I found a webpage indicating that there was a firmware update for my camera.  But it wasn't applicable to Windows 7 nor to 64-bit operating systems.  So it wasn't useful in my case.Meanwhile, now that I had connected the cable, a light on the camera was flashing green.  The manual said this meant it was charging, and it would require 2.5 hours to charge a fully exhausted battery, and then the light would turn off.Other than that, I didn't go through the manual in detail at this point.  There was too much to learn.  Some of it was familiar from my previous camera; some was not.  It seemed more efficient to check back as I came up against specific questions.After charging the camera, I took some photos.  Excellent quality.  My previous camera was slow -- I would take a picture and then have to wait a couple of seconds before it was done saving it.  That was not an issue here.  (The SDHC card was the same one as in the previous camera.)  It saved the photos within, I think, less than a second.That was as far as I got at this point.  So far, I really like this little camera.Update, Dec. 1, 2013.  This camera has been good for me for 11 months now.  I wish it were easier to hold and use one-handed; sometimes I use it to take pictures of items indoors without a flash, and am holding a light in the other hand.  Also, for some reason, it is not transferring via cable; I have to pop out the memory card and put it into the computer each time I want to transfer pictures.  Not sure if that's a camera issue or a computer issue.  There are also times when I think it could do a better job of identifying the object of attention, in medium to low-light conditions, so as to bump up its shutter speed and avoid blurring.  Still glad I bought it.", "Date": "January 1, 2013"}, {"Title": "Sleek look, bad performance", "Author": "Mickey Mouse", "ReviewID": "R2VY1X0EOAF8P2", "Overall": "1.0", "Content": "The camera looks sleek and nice, but performance is terrible. Very, very, very, very slow in capturing the picture when you push the button. You have to be really still to get a decent quality picture. Not impressed with such a product from Nikon. Returned it back to Amazon within a week. Easy process to return to Amazon and quick refund.", "Date": "September 17, 2012"}, {"Title": "disappointed.", "Author": "NatureNics", "ReviewID": "REZLLKQBMHZT4", "Overall": "2.0", "Content": "I got this camera as a birthday present and started using it today. I am highly disappointed. My last two cameras were Canons (A540 and SD1200 IS Powershots) and I'm definitely returning this for another Canon. I tried the different settings to take some macro shots and the resolution was poor in every lighting that I tried. I am highly disappointed. I am an advanced amateur photographer and I take a lot of macro and nature photos. I do not recommend this to anyone interested in taking close-up pictures.I will admit that the light-weight design and color are awesome! Just isn't helpful if the image quality is terrible.", "Date": "June 30, 2012"}, {"Title": "Bad camera and Nikon has the WORST CUSTOMER SERVICE EVER", "Author": "pokey", "ReviewID": "RHQ8GYGY0N1VS", "Overall": "1.0", "Content": "DO NOT BUY UNDER ANY CIRCUMSTANCES. If someone gives you one as a gift, exchange it before you're even tempted to open the box.The camera is slow and takes lousy pictures. The screen is horrible. The video is incredibly grainy at any resolution. It is the worst handling camera that I've ever used. It's actually pretty surprising how poorly this thing fits in your hands. It's so awkward to hold that your hands almost always interfere with the camera's operation. Nikon uses a proprietary USB cable for this camera.All of that is almost forgivable at this price-point. It's a cheap camera and I was not expecting anything more. Had the camera actually worked, I would have given it two and a half or three stars. However my camera was also defective, and (repeatedly) trying to deal with Nikon's \"repair\" center has convinced me that Nikon is not a company that I want to do business with.My camera would not recharge its battery. The charging light comes on, but the battery does not charge. I tried a different charger, charging cable and even a different battery. None of this worked of course, because the camera is defective. So we sent the camera to Nikon for warranty repair. They had the camera for about four weeks, and sent it back to me without repairing it. The \"repair\" slip said that they had fully tested the camera, and found no trouble with it, so they sent it back as is. Obviously the camera still doesn't work.I called Nikon's repair center number which I found on their website, and explained my situation to their rep. I have experienced some bad customer service, but Nikon really takes the cake. At different points in the conversation, I was told each of the following things:1. The camera is working fine. The charging light means that it's charging.2. Charging the camera for more than three hours can damage the battery.3. The camera is not charging because I used an \"un-approved\" brand of SDHC card (Transcend) which corrupted the firmware.4. There are only four \"Nikon approved\" brands of SD card, and that they can be found in the owner's manual.5. Removing the SD card has fixed the firmware, and it really is charging now that the Transcend brand SD card is out.6. Nikon does not replace defective hardware under any circumstances, but I can send the camera back for further \"repair.\"7. Nikon does not refund defective product under any circumstances, but I can try my luck with the store that I bought the camera at.Let's take this line by line:1. I already told the rep that the light comes on, but that it isn't actually charging the battery. It's easy to tell, because the camera won't turn on even after several hours on the charger.2. This is a blatant lie. Li-Ion batteries require specific circuitry to prevent overcharging. If overcharging ever occurs, it's because the device is defective.3. This line is packed full of BS. A. SDHC cards are an industry standard. If a device accepts SDHC cards, than it accepts ALL SDHC cards. B. Transcend makes great SDHC cards. This particular card has worked, and continues to work flawlessly in every computer and device that it's ever been connected to (including this lousy camera). C. No SDHC card could affect a camera's firmware. Firmware is loaded at boot time, and is not writable from within the device's OS. Changing firmware requires special software, and should even require very strong encryption keys. If any consumer device's firmware was ever discovered to be writable via the SDHC card any respectable manufacturer would issue a recall. D. IF the firmware actually WAS corrupt, then the repair center would have found and should have fixed that.4. If there are only four brands of SDHC card that work with Nikon's cameras, then Nikon's cameras are not standards compliant. This alone (if true) would be reason enough not purchase a product, ESPECIALLY one which is meant to capture special moments. Also this should really be printed on the outside of the packaging, since most people buy media at the same time that they buy a new camera.5. If Nikon has invented a method by which a corrupted firmware can repair itself, then they have achieved a truly monumental feat of technological engineering. I have a VERY hard time believing that they have invented such a game changing technology, and that they chose to introduce it to the world by way of their entry level product.6. If Nikon were able to repair the camera in the first place, I would be writing a very different review. It took them over four weeks to not repair it when they did nothing at all. How long will they have it if they decide to do SOMETHING???7. That was the first and only honest thing that the rep said to me. I will never purchase another Nikon product, and I will take every opportunity to explain to my friends and family why I will not and why they should not.", "Date": "April 21, 2013"}, {"Title": "BAD", "Author": "katie", "ReviewID": "R3Q4W90WP3P2RM", "Overall": "1.0", "Content": "Seriously takes awful pics. I bought this for Europe, as I didn't want an expensive one in case it got stolen, however this was a total and complete waste of money. I ended up locking it back in my suitcase and using my iphone which never fails to take amazing photos. Everything is blurring and you need to stand perfectly still to see a clear pic, its not NEARLY as sharp as the iphone. Good luck if you need to ask someone else to take a pic of you and your friends! It will DEFINITELY turn out blurry.Better off taking pics with your smart phone. Sorry Nikon, I hate to give a bad review, but a camera's only job is to take good pics, and you failed big time :(", "Date": "August 5, 2013"}, {"Title": "Disappointed", "Author": "KB", "ReviewID": "RA0Y3F659A0PZ", "Overall": "2.0", "Content": "I got this camera because I thought it would be better than my fujifilm. Wrong. The picture quality was NOT any better and it was slow at \"snapping\" pictures. I read the manual front to back to see if I was operating the camera incorrectly but no I was doing it all right and still could not get a good picture. I read the reviews before buying this camera and everyone said how great it was. I was very dissapointed. I'm getting a refund and sticking to my fujifilm. It was a cheap camera but it did a better job.", "Date": "December 17, 2012"}, {"Title": "skip it", "Author": "turtle man", "ReviewID": "RD9A1GLS954TJ", "Overall": "1.0", "Content": "best thing about my purchase was i bought the warrenty, had it 5 months, took some great pic's then the camera started acking bad. fully charged and you could not turn the flash on, 6.3 gigs free space on an 8 gig card, and the camera changed to 4mp g a and you could not get the setting to go back to 16mp, ruined my family photos at the park, so i returned trying a difffrent brand", "Date": "May 9, 2013"}, {"Title": "Great camera but get a SDHC that can keep up and a second battery", "Author": "J. Shields", "ReviewID": "R3PSXG6CVYP5TM", "Overall": "5.0", "Content": "Picture quality:  Special settings worked amazingly well for fireworks and night shots.  Acceptable for dim light.  Really blurry if zoomed in and there was ANY kind of movement (you or target) when you took the picture.Menus:  Fairly intuitive menus that take maybe 5-10 second to navigate--most desired commands are maybe 4 drilldowns.Battery Life:  Purchase a second battery.  I took about 200-300 pictures per day (I worry about quality after the fact) and one battery would last about 6 hours before I had to switch to the other one.  Charging the camera mid-day (mobile charger) did not work at all.Speed:  I did my homework ahead of time.  Purchase a good \"Class 10\" memory card.  Class is a good indicator of how long it takes to take/write a picture.  My camera was noticeably faster than other's on the trip who had Class 4 and Class 2 cards.  Average wait between pictures was about 5 seconds.  Longest wait was about 10 seconds for firework shots--would have to push the shutter about 5 seconds BEFORE the actual picture I wanted.", "Date": "April 17, 2013"}, {"Title": "nice little camera", "Author": "mbp", "ReviewID": "R2XI3A737SLUFM", "Overall": "4.0", "Content": "the fact that it comes with it's own rechargeable battery makes it worth the purchase. it takes fair pictures, and the compact size is handy.", "Date": "January 25, 2013"}, {"Title": "Easy to use", "Author": "Roger Lowden", "ReviewID": "R3V1BW7B3WQ3J2", "Overall": "5.0", "Content": "I bought this for my wife, mainly because it was a Nikon. I was not disappointed, it takes excellent pictures and is  simple to use. Switching from still ti video is a snap with 1 button operation. Battery life seems fine. Recharging is simple and quick. Transferring pictures to a computer is also easy. So far I'm glad I bought it.", "Date": "January 11, 2013"}, {"Title": "Good initial impressions", "Author": "Janos Gereben", "ReviewID": "R3HFDTX4SC7SFY", "Overall": "4.0", "Content": "Size, ease of use, quality of pictures - all is good after light use for about a week.I think it's because of me, not the camera, that I cannot figure out a quick setting for shooting in poor light *without* flash. The \"evening\" setting activates flash. Any helpful hints?One reason for buying the S3300 was the promise of high light sensitivity, but how to make use of it?", "Date": "September 22, 2012"}, {"Title": "Nikon CoolpixS3300", "Author": "Rosie", "ReviewID": "R2TQY1ZPGLRZLA", "Overall": "5.0", "Content": "Perfect for what I need it for, fits perfectly into my bag for nights out. Takes great pictures and is so easy to use, would definitely recommend it....", "Date": "July 29, 2012"}, {"Title": "Not good for fun family shots.", "Author": "Mary Craig", "ReviewID": "R1WR44X1NUKLFA", "Overall": "1.0", "Content": "Way, way, way, way too SLOW!  I. want to return it. Tried to use it at Christmas with my kids but they were gone or hand turned away before the shutter clicked. Very frustrating to use.", "Date": "January 30, 2013"}, {"Title": "Nikon Coolpix S33000 ~ Disppointing!", "Author": "Krissy76", "ReviewID": "R2N87CNPN1M73S", "Overall": "2.0", "Content": "I would call myself an \"advanced hobby photographer\" and decided on the Nikon Coolpix S3300 due to a $79 deal at one of our local stores. It's technical details and features seemed promising - an upgrade in MP and zoom, compared to my old Canon. But it was a total disappointment in reality! Incredibly slow performance, blurry pictures, auto-flash not reacting properly...After just a couple of pictures it went right back in the box, I am not going to keep this thing.I sure wasn't expecting this poor quality from Nikon.", "Date": "December 16, 2012"}, {"Title": "Faulty Battery Cover", "Author": "Roger", "ReviewID": "R26UM667ZKT9SJ", "Overall": "2.0", "Content": "The battery cover for the camera is very fragile and does not lock properly.I've had this problem since the first use and would not recommend it unless you'd like to tape the battery cover shut.", "Date": "May 31, 2012"}, {"Title": "It's okay", "Author": "Michael", "ReviewID": "R61Y1IILL3IKX", "Overall": "3.0", "Content": "The picture size is great; it had better be for 16mp. But, unless you're outside in the sun the ISO seems to jump really high and you get a pretty grainy photo. If you're taking pictures to print out as 5x8 or smaller then it's not really a big deal. Otherwise, make sure you have some good lighting if you're planning on blowing up the photo. There's also a pretty mean shutter lag and sometimes the camera doesn't want to take the picture. That really makes my wife mad when we're trying to snap a photo of our 16 month old daughter and we miss that moment because of the delay. I'm sure it has something to do with the default settings but it looks for faces and when it can't find them it starts acting weird. It's not always this way; and for the most part it works well. Just don't buy this camera expecting it to be the best one you've ever owned (unless it's your first).", "Date": "October 8, 2012"}, {"Title": "It Works for Awhile", "Author": "Melody", "ReviewID": "R3PYHHQD4YFT6O", "Overall": "1.0", "Content": "Had this not even two years. It works OK. A little slow to take the pictures. Flash doesn't always work when you need it to and you can't make it flash. I have never dropped it either. Now I find out it needs updates? Yes that's right people you have to update this camera. The problem? Battery is \"exhausted\" and won't charge and the camera no longer reads the the USB cable. So we have to buy a new battery that has some charge on it so we can get the camera to turn on long enough to update it. Then we find out the instructions online to update it aren't accurate and what it tells us to do won't work for the camera. This has been a month long process trying to fix this problem. So Nikon says no problem send it in and we'll fix it for $85. That's the cost of a new one!! Basically it was a mediocre camera for a year and a half and now it is crap and useless. I expected better from NIKON.", "Date": "August 20, 2013"}, {"Title": "More Problems than Expected", "Author": "BRIAN LOPEZ", "ReviewID": "RYGINNWQXZ5LC", "Overall": "1.0", "Content": "I bought and thought Great Focused Pictures ,Until I turned on and Noticed the Lens had a Problem coming Out 75% of the time ,I would have to face down and then turn on it to fall out to be able to use. then one day i charged and went to use and the lens came out but then would not go back in and just battery died that wat and since then has been stiff and stuck.... I wish i would have knew but now just wish it could get fixed!!! Alot of money down the drain!", "Date": "August 16, 2013"}, {"Title": "Way too fragile", "Author": "T. Anderson", "ReviewID": "R2L4BYL3BIB773", "Overall": "1.0", "Content": "We purchased this camera in early July for my wifes trip to europe.  In mid July while sitting in a bus she dropped it from lap to floor.  The drop was about 2 feet.  The unit was so badly damaged that it could not be used.  Lens cover would not close and totally out of focus.  I think it should have been in warranty, but Nikon would only repair it for a cost much higher than a new one.  Get something less fragile.", "Date": "August 14, 2013"}, {"Title": "Stopped working after only 6 months!", "Author": "punkin", "ReviewID": "RNPX4BK0H5L0O", "Overall": "1.0", "Content": "We bought this camera in Dec/2012 to use for our honeymoon.  In June/2013 it stopped working!  No image at all on the screen.  We lost our receipt so we cannot even return it.  We are really upset about it.", "Date": "July 30, 2013"}, {"Title": "Worst camera ever", "Author": "Nancy L. Mcdaniel", "ReviewID": "R2W6UL4UM5TZ1A", "Overall": "1.0", "Content": "Have had two of these, and both failed within 6 months.  The first had a screen that was so distorted that you couldn't see what you were taking a photo of. . . the photos came out OK, but being able to figure out what the camera was shooting was impossible.  The second one had a dead battery after about a month of not using it.  It won't take a charge and is dead.  Before that, however, it was so slow that getting quick shots of anything was not possible. Get a Sony or a Canon or anything else.  Both were a total waste of money.", "Date": "May 7, 2013"}, {"Title": "Works great ...!!", "Author": "Nigel", "ReviewID": "R121OYXA99TTTW", "Overall": "5.0", "Content": "Another quality Nikon product...Love the fact that it automatically chooses the mode for different scenes..Love the fact that the battery is rechargeable as well......I wish though that there was a separate dock charger for the battery rather than a USB plug....Its fun to use and pictures are perfect.....", "Date": "January 28, 2013"}, {"Title": "Good Camera for the Price", "Author": "Haruko", "ReviewID": "R1W95ACAY9VSRZ", "Overall": "4.0", "Content": "This is a great little point and shoot.  I love that it came in pink.  The photos are good quality, but the flash sometimes takes what seems like a long time to warm up.  I've missed several cute cat pics because of it.", "Date": "September 26, 2012"}, {"Title": "Nikon COOLPIX S3300", "Author": "Sally", "ReviewID": "R1K398SFQU3GFW", "Overall": "5.0", "Content": "My Husband and I bought this camera for our Daughter's Graduation present 3 weeks ago. She absolutely LOVES this camera!!! Great product and great value!!! We are looking to purchase one for ourselves!", "Date": "June 9, 2012"}, {"Title": "THE CAMERA IS AWESOME", "Author": "Detective007", "ReviewID": "R1PRB0JKM0A9A", "Overall": "5.0", "Content": "The camera is perfect!!! It works perfect! The color is the same as in the picture, its very thin  and compact", "Date": "April 28, 2012"}, {"Title": "Awesome cheap camera!", "Author": "anonymous book critic", "ReviewID": "R3CGKM2GVPLWZ5", "Overall": "5.0", "Content": "I bought this camera at Walmart because it was the cheapest one they had - I knew nothing about the product at all. I just needed the camera to take some photos for an ad on gumtree. Strictly utilitarian purchase. Fast forward to my trip to Fiji... I have spent the past three days photographing the ocean, skies and flowers - WOW - this little camera took some fabulous photos. I posted them on FB, and someone commented they looked professional - and they do! These pictures could easily be gracing greeting cards or a calendar. Bright, crisp and clear - some of the photos are simply stunning. A big surprise, to be honest. I am wondering if I need an expensive SLR after all?? Hmm...", "Date": "August 2, 2013"}, {"Title": "Cute and fun camera", "Author": "MsWethany", "ReviewID": "R28Y3AL7POK0BU", "Overall": "5.0", "Content": "I got this because I needed a simple camera for taking pics of stuff I make at work. It came with instructions with many languages... just not english. Never fear- it was easy to figure out, just push buttons and see what they do. It would be nice to have a reference, but I can probably find that on the internet if I need it. No biggie. It's purple!", "Date": "July 25, 2013"}, {"Title": "On / Off button stopped working 4 months after purchase", "Author": "Zach", "ReviewID": "R3TZHT6DVI37ZM", "Overall": "3.0", "Content": "I purchased this camera as a gift for my sister. Within around 4 months of purchase, I got word that the on/off button stopped working out of the blue. Allegedly, the camera was not dropped nor was anything spilled on it. After investigating the issue myself, the button indeed no longer works 99 out of 100 times. I was able to get the camera to turn on once but was not able to get it to turn off, necessitating removing the battery. After talking to Nikon customer service, I will be sending it in to get warranty repairs done.Hope any problems that anyone else may have occur within warranty!", "Date": "June 30, 2013"}, {"Title": "great camera for the money", "Author": "subwo \"Subwo\"", "ReviewID": "RT6F7LAB0YFYN", "Overall": "5.0", "Content": "this is the second camera of this model I have purchased. i accidently broke the first by droppimg it on cement. it does way more than I need it to and is small enough not to get in the way. I like the rechargeable battery and ability to charge via USB conn.  the square trade warranty covered the price of the camera and another two year accidental warranty. no, it isn't purple like my first one buy I can live with that.", "Date": "June 8, 2013"}, {"Title": "Terrible PNS", "Author": "S.R.L.", "ReviewID": "RF8N56VBME1WK", "Overall": "1.0", "Content": "Bought this to take on a vacation because my DSLR is too bulky to drag along to most of our destinations. As soon as the camera arrived, I took it out of the packaging, charged it and began just taking random pictures around the house (mostly of my 1 year old and his toys). I could not, for the life of me, get a clear picture. I began changing settings and trying different combinations of settings - all to no avail. I can't even sit on my couch and get a clear picture of my feet propped on my ottoman!  EVERY picture is blurred. I'm just glad I discovered this before I leave on vacation and depended on this camera to capture and save those memories. I'll be returning this... You should not waste your money on this camera. Spend a few extra bucks and get something better than the Nikon COOLPIX S3300!", "Date": "June 3, 2013"}, {"Title": "Pretty slow", "Author": "sala", "ReviewID": "R2DE76G2CAOHYH", "Overall": "3.0", "Content": "I bought this today and it does have its pros and consThe pros are that the quality of the pictures are pretty good, taking a picture of a small lip ring (labret) and it shows every detail. Also another pro is that it is very easy to useThe con is that it is very slow. After taking a picture it takes about 5-10 seconds until you can take another picture. even if you take a picture and want to turn it off it still has this delay.. While it may not seem like much if you are out and can be a real problem and hassle. Im not sure if this is all or just mine.", "Date": "May 23, 2013"}, {"Title": "Takes a lot of blurry pictures", "Author": "Carmine R Graziano", "ReviewID": "R1UOEKVSCC2K52", "Overall": "3.0", "Content": "Bought this camera based on price, but it takes a lot of blurry pictures. I've tried adjusting the vibration settings etc but its very difficult to take really clear photos. This could be user error on my part but I haven't had this problem with other cameras.", "Date": "May 4, 2013"}, {"Title": "Mom loves this!", "Author": "Aunt Mimi", "ReviewID": "R3J4MO85X69IY8", "Overall": "5.0", "Content": "Bought this camera for my mother because her old Nikon finally died.  She absolutely loves this!  It is so user friendly, and she goes on and on about how easy and fun it is to use.  She is in her late 60's and a little technically challenged, so it is a great little camera for someone who does not love gadgets and learning new technology.", "Date": "May 3, 2013"}, {"Title": "Nikon Coolpix S3300", "Author": "Harvey A. Orlick", "ReviewID": "R123TM9LXLBVOW", "Overall": "3.0", "Content": "Not the best camera, but OK for the price. It takes too long to recycle, and indoor pictures blur due to motion.", "Date": "April 17, 2013"}, {"Title": "Don't move!!", "Author": "C. Gribble \"cgribble8\"", "ReviewID": "RQLVUR78ZE59T", "Overall": "3.0", "Content": "I love the picture quality---if I can hold the camera still.  Even when the camera is just held in your hand it feels slippery and ready to fall to the floor. For every problem there is a solution...I simply attach a small table top tripod and use it as a handle to keep the camera steady!!  I also use a lanyard so that the camera can hang around my neck while at the zoo.  It may look kinda funny with the small tripod but it works.", "Date": "April 13, 2013"}, {"Title": "Pretty good for the price", "Author": "Stephen Fairchild", "ReviewID": "R1BYYZ0O5G4IN3", "Overall": "4.0", "Content": "For a \"steady cam\" there is an awful lot of movement.  Otherwise a satisfactory buy for the money paid out.", "Date": "April 9, 2013"}, {"Title": "I Love It", "Author": "Dave in LA \"Book Lover\"", "ReviewID": "R3LUCF4XVPYROH", "Overall": "5.0", "Content": "This is the smallest camera I've ever handled, yet it has 16 megapixels. It takes nice pix. You have to get used to the tiny size, and not put your fingers in front of the lens, etc.The viewing screen is hard to see in bright daylight, but I think that's true of any camera lacking a viewfinder. On my previous Nikon, I was able to fit a small metal shield around the screen, which helped a lot. I don't think I can do that with this one.", "Date": "January 19, 2013"}, {"Title": "Very unsatisfied", "Author": "Book lover", "ReviewID": "RPNF249S2LEWF", "Overall": "1.0", "Content": "This camera was not what I was looking for.  It might have been because the zoom didn't work, but I didn't like the quality of the pictures and couldn't take 10 feet or more pics as the picture came out blurry.", "Date": "January 9, 2013"}, {"Title": "Great Value", "Author": "Steven J. Tramontozzi", "ReviewID": "RT67QV5M4KJW4", "Overall": "5.0", "Content": "Camera works great, so good that even my parents went out and bought their own. Proved to be a great gift and quality camera for the price. Please note it does not come with a memory card.", "Date": "January 8, 2013"}, {"Title": "Great camera", "Author": "Sue", "ReviewID": "RBHO9DBW1KQ7O", "Overall": "5.0", "Content": "Great camera for regular use by the average occasional photographer.  Would recommend to anyone. Great deal for a present. A+", "Date": "January 8, 2013"}, {"Title": "Easy to use", "Author": "Carol Simonds", "ReviewID": "R30IYIE6GUPEU1", "Overall": "5.0", "Content": "I love this camera. It is easy to use and takes great pictures...very clear and sharp pictures. It is small and light enough to carry with me in my purse.", "Date": "January 7, 2013"}, {"Title": "Nice camera", "Author": "Raymond Kalita", "ReviewID": "R3JFU5W56R8636", "Overall": "5.0", "Content": "I bought this as a gift for my granddaughter since she is the Historian for her Four-H club.  It looks nice and she has taken a lot of pictures with it. One problem I see though is the battery compartment lid seems to be very flimsy.  I hope it doesn't break.", "Date": "January 6, 2013"}, {"Title": "Great One step point and shoot", "Author": "Scott D. Dredge", "ReviewID": "R3BMNUZLHFL8B", "Overall": "5.0", "Content": "I bought this for my mother who is 61, she has hard time with most things electronic... but she has mastered this one. Great buy and great product. She loves it, so I am happy with it.", "Date": "January 4, 2013"}, {"Title": "Worked great, until... **REVISED*", "Author": "LaNedra J. \"LaNedra Gaines\"", "ReviewID": "RMAFCZEA48CIA", "Overall": "3.0", "Content": "My fiance' was extremely excited to receive his early Christmas gift. I'd previously owned a Nikon Coolpix and loved it. He'd spent the earlier part of the da taking beautiful photos and was impressed with the camera's functions. Until... all of a sudden, he went to take a photo before heading out to dinner and all of the photos started showing very blurry. It even showed blurry just looking into the LCD display. Now, the camera keeps shutting off with a \"Lens Error\" message on the LCD.Unfortunately, he's now unable to take ANY photos. I feel bad that his Christmas gift was a bust. :-(**revision** After resetting the camera, it has been working fine. He's loving it!!!!", "Date": "December 24, 2012"}, {"Title": "COOLPIX S3300", "Author": "Jennifer Grandi", "ReviewID": "R1ZKX1U8LB1AL9", "Overall": "5.0", "Content": "I love this camera!  It's easy to use, fits in my pocket, and takes beautiful pictures.  And the pink makes it very cute!", "Date": "December 23, 2012"}, {"Title": "Has major problem focusing", "Author": "E. Y. \"Erick\"", "ReviewID": "R1N56GV8S4AHKR", "Overall": "2.0", "Content": "I tried many setting and1 out of three pictures are clear. My 8 year old Canon powershot is far superior. I just wanted a wider lens and I assumed the nikon S3300 could take pictures. I guess not", "Date": "December 19, 2012"}, {"Title": "Very good camera", "Author": "wwhite0011", "ReviewID": "R1N9UP5XTLR4V4", "Overall": "4.0", "Content": "Very good camera for the money with lots of bells and whistles. Very good lens and the screen is just big enough", "Date": "December 13, 2012"}, {"Title": "Nice and slim camera", "Author": "Alejandro Rubio", "ReviewID": "RWYOJK9L0V13L", "Overall": "4.0", "Content": "Camera takes great pictures, but it's a litle bit slow to take continuous shots. Still a great buy for family pictures", "Date": "December 7, 2012"}, {"Title": "Extremely poor quality", "Author": "D. Burwick", "ReviewID": "RE9JMHJ2G50IH", "Overall": "1.0", "Content": "I purchased this camera back in May of this year to replace my Nikon Coolpix S3000 that I truly enjoyed.  I had it for several years and never had a problem until I dropped it and that was pretty much it. Totally my fault. Since I enjoyed the previous one so much - compact size, great pictures, easy charge, super easy uploading of pics, I figured this updated version of the 3000 would be the perfect fit.  I couldn't have been more wrong. In addition to the pictures not being nearly as good as the previous camera, I have had problems with it not charging or holding a charge since I had it. I charged it last Wed., did not use it at all and when I needed it for a special occasion on Sunday it was dead.  Battery exhausted after 0 use.  It now won't even turn on.  I will be using the Square Deal Warranty I thankfully purchased with this low quality camera. I would absolutely NOT recommend this camera to anyone.  It is NOT the same quality as the previous version.  Now I get to search for a new camera and hope I have better luck.  And I also must see how good that warranty I purchased with this is.........", "Date": "September 23, 2013"}, {"Title": "Worst point and shoot ever!", "Author": "Peter", "ReviewID": "RPSO1BUURF4PT", "Overall": "1.0", "Content": "I have had several Nikon point and shoots over the years, in addition to my DSLR and lenses. I like to have a point and shoot in my pocket a lot of the time, they're small and easy to carry. Previous Nikon pocket cameras have done a great job, and often getting better results than my D70s DSLR. And, let me add I always bought the Nikon model at the low end $100-$150 price range, not the higher priced models.This camera is HORRIBLE. First and foremost, the focus is dreadful. I just used it for a weekend in Telluride and had to discard at least half of my photos, as they were not in focus. Same for an earlier event a month ago. I don't know what this camera is trying to focus on, but NOTHING in the images was in focus.  I had read this on earlier reviews, but ignored it thinking it was user error. It's NOT. I have always been able to pull a pocket camera out and get a nice image no matter where I was. Not with this thing.Next up is the exposure itself. Horrid. I took some outdoor photos, granted in snow, but they were unusable, could not even rescue acceptable images with editing software. Previous models did quite well outside.The flash is also not  very powerful, I've used pocket cameras from Nikon and got good indoor photos at night, not with this thing. The photos are grainy because there simply isn't enough light, and that's assuming they are well-focused, which I've already discussed. Also, the flash is on the same side as the shutter button, so invariably if you ask someone to take a photo, you have to tell them to move the fingers that automatically are place on the front of the camera, but in this case, block the flash.I only gave it one star because I had to. This camera is a total FAIL by Nikon. I know it's a cheapy, but previous cheapies from Nikon did a respectable job to just \"get the shot\" with a camera I could easily carry in my pocket. It's a bummer I didn't listen to the reviews and bought this. Now, I need to buy another camera, AND add the cost of this one to it, when I should have just bought a better camera from the start.Might be time to spend a few extra bucks and try a Canon Powershot.", "Date": "January 10, 2013"}, {"Title": "bad product", "Author": "Fan", "ReviewID": "RTW315546UTEC", "Overall": "1.0", "Content": "This camera doesn't meet the expectation. Although ultra-slim, the quality of the pictures is really bad and blurred. Even worse than a small sony camera I got 5 years ago. Consider the sale tax and return shipping charge, would you rather choose a local store like Walmart or Bestbuy for your next purchase (at least no return fee)? I have done a lot of online shopping from Amazon, but completely unsatisfied with this purchase.", "Date": "December 15, 2012"}, {"Title": "DISAPPOINTED!", "Author": "Connecticut customer", "ReviewID": "RZL9FV7BUSBGG", "Overall": "1.0", "Content": "I purchased this camera because it had good reviews.  I took very good care of it.  But before a year was up, it flashed a message saying \"lens error\", and then ceased to work.  That was disappointing enough.  But I figured it was still under warranty.  The Nikon people said we could send it in for repairs, but they required so much documentation that we just gave up. I'll have to purchase another camera. But it won't be a Nikon Coolpix or any Nikon product.  If you do purchase a Nikon camera, make sure you save absolutely all sales records (you'll need originals!) and warranty cards, etc. because they will require you jump through a lot of hoops to qualify for the repair you should be entitled to if you can simply prove you purchased it within the time the camera was still under warranty.  In my opinion, both the camera and Nikon are duds!", "Date": "April 14, 2013"}, {"Title": "Small and user friendly digital camera", "Author": "Samantha  Summers \"SS\"", "ReviewID": "R22YX1VXFPB9LH", "Overall": "5.0", "Content": "It's very small and great to take everywhere with you.  We also have a Cannon digital camera that took too long for the flash to go off indoors so you missed every shot.  This camera is much faster and very easy to use.", "Date": "February 15, 2013"}, {"Title": "TOO MANY BLURRY PICTURES, ESPECIALLY INDOORS!", "Author": "K. Kulpinski \"kk lady\"", "ReviewID": "R2RVOS5M9VIOIK", "Overall": "2.0", "Content": "I like everything about this camera except for one thing - too many pictures come out blurry.  You think you have focused, with the green box when you press halfway down but too many are ,in fact, blurry.  Also, whenever I give this to another person to take a picture with me in it, no matter how much I stress focusing slowly and waiting for box and then pressing the rest of way w/o releasing, their pictures are blurry 9- percent of the time, even outdoors.  I have had too many pictures that I looked forward to turn out blurry.  Even in good light levels outdoors this happens.When they are not blurry they are great!  But I don't know if this is a failure of the camera or it is just way too sensitive to careful focusing with the button or what, but it is very frustrating.  I would not recommend.  I did get a good price for it, but wouldn't buy it again for even less.", "Date": "February 4, 2013"}, {"Title": "so-so", "Author": "Diogenes \"Urban Architect\"", "ReviewID": "R1U0SJ5O6C9DDS", "Overall": "3.0", "Content": "I bought this camera to augment a Kodak V1485, a point and shoot 14megapixel camera.  Kodaks seem to be no more but I had liked whatever color rendition they offered better than Canons I have dealt with and for the price, thought this would be a good possibility.  I'm always doubtful about zoom on these cheap cameras as getting one that follows focus is always iffy, or the first thing to go after some use.  So, when downloaded off the chip this camera gives a large frame size 15.3 x 11.5 approx at 300 dpi.  The old 14 megapixel camera input at 480 dpi and a smaller frame size.  This means that if you want to save the 16 megapixel image to a higher dpi, you have to settle for whatever extrapolation the editing program is going to do and so far I am not seeing a perceptible sharpness improvement to this pictures or any better quality when I have zoomed and cropped, which is the other use for these high megapixel cameras.  But the zoom is there and I needed it because the camera is a much wider angle lens when you open it up, almost a fish-eye. Usually if the zoom doesn't follow focus, I fall back on not zooming and relying on editing the image.  With this camera, I have to edit almost every shot for the fish-eye effect to get rid of the keystoning. also some of the zoom pictures are too fuzzy when zoomed--just not sharp, which tells me that the follow-focus aspect of the zoom already doesn't really work that well.  Still, I do sometimes need a wide angle camera and for the price it wasn't bad.  The color rendering seems to be okay, better than the Canons and there are options when shooting whether to go wth a vibrant color setting; also the iso change option worked fairly well. In many ways the thinking that went into the design was more useful for someone who photographs quite a lot, working with landscapes and buildings primarily.  I may have to fiddle with the focus options to avoid the \"find face\" feature and see if it improves the quality of the images.  So, I'd say it's serviceable but you won't feel as though you've gotten much bang for that 16 MP but it's short money to try it.", "Date": "January 23, 2013"}, {"Title": "A great starter camera", "Author": "William Weeks", "ReviewID": "RVAS3JGVXKJ0X", "Overall": "5.0", "Content": "We bought this for our young daughter. This was basically her first \"real\" camera. She is pretty good with electronics, but had no problem figuring out how to make it work. It was an excellent choice.", "Date": "January 22, 2013"}, {"Title": "Review of the Nikon COOLPIX S3300", "Author": "Cheryl Pietrcollo", "ReviewID": "R3JNB6F2GJ7WP7", "Overall": "5.0", "Content": "I have a small cake business, this camera out did all my expectations, clarity, picture quality & most important, ease of operation! During the holiday we had purchased 2 other cameras, they could not even touch the picture quality of the Nikon COOLPIX!  Thank U for making the purchase so easy & shopping for it just a breeze!Sincerely,Cheryl", "Date": "January 9, 2013"}, {"Title": "A great boyfriend proof cramera", "Author": "sam the boyfriend", "ReviewID": "R8W6JD2L6GC8A", "Overall": "5.0", "Content": "Wow, I just found the camera outside in the yard it had fallen out of my jacket pocket, and it raining all night and this morning so I thought for sure it would be a goner. However my girlfriend, who's camera it really is, picked it up and took another fantastic picture of my super relieved face. IT IS A GREAT LITTLE CAMERA!!You need to get a memory card tho, we got a 16 gig Sony card for 18$ at Walmart.", "Date": "January 8, 2013"}, {"Title": "Nikon Coolpi", "Author": "amma", "ReviewID": "R3Q9OXSBJM7Y3J", "Overall": "5.0", "Content": "Since I dropped my son's camera in the Gulf of Mexico, he was very excited about getting this nicer one.", "Date": "January 7, 2013"}, {"Title": "Very nice camera", "Author": "Photonman", "ReviewID": "RDCGDWBJKB7RI", "Overall": "5.0", "Content": "I purchased this camera for a friend and she really likes it. I also purchased two batteries and a charger as well as a 16 GB card and hard case. It does everything she wants it to do, has easy to understand and fairly intuitive interface / menus and fits well in her purse so its ready at a moments notice. I have many Nikon SLR's and DSLR's so Im partial and quite familiar to Nikon. This camera is a great addition to their line of point and shoot cameras. There is a wealth of extra features should she decide to get deeper into the menus, and if not it still does a great job on auto settings, and just happens to have nikon glass... A good value for your money with a color that fits everyones tastes.", "Date": "October 12, 2012"}, {"Title": "Great Camera!", "Author": "Pam Melancon", "ReviewID": "R3R5ZFSPGAYSB4", "Overall": "5.0", "Content": "This is the second Coolpix I purchased on Amazon. The 1st one I dropped and broke. I liked it so much I ordered a second. It came in just a couple of days. I am very happy with this camera and the service I get on Amazon.Pam M.", "Date": "June 4, 2014"}, {"Title": "ANALYSIS OF NIKON S3300", "Author": "TALONCRITERIUM", "ReviewID": "RZGSIVS7JAV2G", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moYL7CZB2ES4UQembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moYL7CZB2ES4UQrefresh_preplay() {\n\ndocument.getElementById(\"cv_moYL7CZB2ES4UQchiDiv\").innerHTML = document.getElementById(\"cv_moYL7CZB2ES4UQhiddenPre\").innerHTML;\n};\ncv_moYL7CZB2ES4UQrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moYL7CZB2ES4UQso;\t   \n\n\nfunction cv_moYL7CZB2ES4UQloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moYL7CZB2ES4UQso = new SWFObject(swfLocation, \"cv_moYL7CZB2ES4UQAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moYL7CZB2ES4UQso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moYL7CZB2ES4UQso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moYL7CZB2ES4UQso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moYL7CZB2ES4UQso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moYL7CZB2ES4UQso.setAttribute(\"height\", swfHeight);\n          cv_moYL7CZB2ES4UQso.setAttribute(\"width\", swfWidth);\n          cv_moYL7CZB2ES4UQso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moYL7CZB2ES4UQso.write(\"cv_moYL7CZB2ES4UQflashcontent\")) {\n          fp_resizePlayerSpace('cv_moYL7CZB2ES4UQ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moYL7CZB2ES4UQ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moYL7CZB2ES4UQ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moYL7CZB2ES4UQloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moYL7CZB2ES4UQ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m323HD0ZGRQE69\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m323HD0ZGRQE69\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RZGSIVS7JAV2G\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m323HD0ZGRQE69/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moYL7CZB2ES4UQduration')) {\n      document.getElementById('cv_moYL7CZB2ES4UQduration').style.display='none';\n    }\n    cv_moYL7CZB2ES4UQloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moYL7CZB2ES4UQloadSwf(movieID, playerVersion) {\n   return _cv_moYL7CZB2ES4UQloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moYL7CZB2ES4UQnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moYL7CZB2ES4UQ', 0, h);\n}\n\nfunction cv_moYL7CZB2ES4UQresetPlayer(w,h,bw,cc) {\n  cv_moYL7CZB2ES4UQnewHeight(h);\n\n  cv_moYL7CZB2ES4UQso.addVariable(\"resetBandwidth\", bw);\n  cv_moYL7CZB2ES4UQso.addVariable(\"cacheCode\", cc);\n  cv_moYL7CZB2ES4UQso.setAttribute(\"height\", h);\n  cv_moYL7CZB2ES4UQso.setAttribute(\"width\", w);\n  cv_moYL7CZB2ES4UQso.write(\"cv_moYL7CZB2ES4UQflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moYL7CZB2ES4UQRollOverImg = new Image();\ncv_moYL7CZB2ES4UQRollOverImg.src = \"http://ecx.images-amazon.com/images/I/819S-MRtO3S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moYL7CZB2ES4UQpreplay = document.getElementById('cv_moYL7CZB2ES4UQpreplayImageId');\nif (cv_moYL7CZB2ES4UQpreplay) {\n  cv_moYL7CZB2ES4UQpreplay.onmouseover = function() {\n    cv_moYL7CZB2ES4UQpreplay.src = \"http://ecx.images-amazon.com/images/I/819S-MRtO3S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moYL7CZB2ES4UQpreplay.onmouseout = function() {\n    cv_moYL7CZB2ES4UQpreplay.src = \"http://ecx.images-amazon.com/images/I/819S-MRtO3S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moYL7CZB2ES4UQpreplay.parentNode;\n\n  var cv_moYL7CZB2ES4UQcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moYL7CZB2ES4UQcurrentClick) {\n      return cv_moYL7CZB2ES4UQcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:39 MinsThis is a very good camera. Pictures and videos are very high quality and in some category a professional video cams. Sample on review video mount on waist. Remember may have auto shut off after 30 minutes. It have a very high quality CCD meaning a cathode plate at lens to convert visible light electromagetism to electrical eletron binary to you cam processor.", "Date": "May 28, 2014"}, {"Title": "easy to use", "Author": "Brandie", "ReviewID": "R1YPH32NIYDQOR", "Overall": "5.0", "Content": "I had an earlier version of this camera and I'd had it for about 5 years when it finally stopped working. I bought this one to replace it and it is pretty much the same but has more mega pixels and some more features so it was pretty easy to figure out how to use it. I love this camera.", "Date": "May 15, 2014"}, {"Title": "You can get a better camera for the price. The images are a bit opaque. Due to the poor quality of the images stop using it.", "Author": "KELBIS R. RAMIREZ", "ReviewID": "R2J03N4BG5AL3Q", "Overall": "2.0", "Content": "You can get a better camera for the price. The images are a bit opaque. Due to the poor quality of the images stop using it. Preferred buy another.", "Date": "May 4, 2014"}, {"Title": "great value", "Author": "Teresa F. Jordan", "ReviewID": "R275KYDI2HZMUN", "Overall": "4.0", "Content": "great value, good pictures and easy to carry.  The color also makes it visible so you are not apt to leave it somewhere.", "Date": "April 24, 2014"}, {"Title": "Very clean and complete", "Author": "Merriwin", "ReviewID": "R1ICWW52000W30", "Overall": "4.0", "Content": "The seller did an exceptional job of selling a camera complete with charging cord, battery, and there may have been an sd card (I can't remember for sure). But I do remember how clean and well packaged the camera arrived. The camera takes great pictures. The only thing that I wish I had been better informed on is that the camera has only basic point and shoot capabilities. It does not have special shooting functions like fast action shots, night shots, macro shots, etc. But for a great little camera, the price point is spot on.", "Date": "April 20, 2014"}, {"Title": "Excellent product", "Author": "Dayled Colina", "ReviewID": "R3I36OYKZHKDAP", "Overall": "5.0", "Content": "I did receive this item on time, and covered my expectations. I recommend to buy it as this is a good product", "Date": "April 13, 2014"}, {"Title": "Not what I expected from Nikon", "Author": "ken sager", "ReviewID": "RVF2HCXX5VI5H", "Overall": "3.0", "Content": "Got this little guy to replace my Sony Cybershot. I use my camera for some (very) amateur photography and vlogging for a YouTube channel. Most of the time, the photos are good quality, but sometimes they come out blurry (slow/stubborn focus?) and deceptively lighter in real life, regardless of lighting or white balance setting. The video drives me NUTS. There's a constant roar in the background when this thing records. Inside. No wind. I knew that when I bought it because I found sample footage online, but now I can't stand it. I'm looking at upgrading to something fancier so my videos look more professional.", "Date": "April 11, 2014"}, {"Title": "Digital Camera", "Author": "Shore Al \"Shore Al\"", "ReviewID": "R1FLJ73OLLSZ45", "Overall": "5.0", "Content": "Very nice pictures while very simple to use - small size so easy to keep on person, slips into top shirt pocket", "Date": "April 11, 2014"}, {"Title": "Slooooow", "Author": "Kaylia", "ReviewID": "R1D8G4ZE1TOQF2", "Overall": "3.0", "Content": "Ummmm.. this camera takes waay too long to record images and so taking pictures in quick succession cannot be considered. I use it only when I absolutely have to. Wouldn't recommend in this day and age.", "Date": "March 30, 2014"}, {"Title": "This camera is a piece of garbage….", "Author": "Dean Rocco Perrone \"DP\"", "ReviewID": "R2XJXKBKUFT5IK", "Overall": "1.0", "Content": "Let me first start off by saying I own 2 other Nikon's which are great.  I have also been a real estate appraiser for 13 years so I use cameras every single day…all day.  I literally purchased this camera a week ago…  had it in my pocket with NOTHING else,  and somehow the inside of the entire screen has cracked and spider webbed.  There is not a single mark, scratch….Nothing on the actual screen itself so I have no idea how the inside of the screen is shattered.  The camera is completely useless now.  1 week….. I have owned cameras that last several years…  This think is junk and you would be much smarter spending an extra $20-50 bucks and purchasing something else that doesn't break after 1 week.  Again….not one single mark on the actual screen yet the inside of the screen somehow is shattered.  JUNK….", "Date": "March 29, 2014"}, {"Title": "love it", "Author": "Latoya graham", "ReviewID": "R2UT7FZSNMOH0F", "Overall": "5.0", "Content": "I so love this camera! It takes the perfect pictures and can take them out easy.. thinking about getting this as a gift for aFriend.", "Date": "March 27, 2014"}, {"Title": "did not get what they advertised.", "Author": "Bertram Sweeney", "ReviewID": "R1RDD81OGHEDVQ", "Overall": "4.0", "Content": "Ii is not a s3300 it is a Nikon Coolpix s3200 it is not what they advertised. other then that its in great shape", "Date": "March 21, 2014"}, {"Title": "Love my camera", "Author": "Rosemarie Mancini", "ReviewID": "R3N58JW74UQVZB", "Overall": "5.0", "Content": "It is a small camera, works so well. Takes a Beautiful clear picture, and Love the color. I use it all the time to take pictures of everything and my Grandkids", "Date": "March 10, 2014"}, {"Title": "Nikon Coolpix S3300", "Author": "Cathleen A. Springer", "ReviewID": "R2VJWJYS4HU0D7", "Overall": "5.0", "Content": "This camera makes still and video photo taking a snap [you should pardon the expression ;)] Uploading to the computer is also really simple. The quality of the 16 MP is terrific.", "Date": "March 9, 2014"}, {"Title": "WOW", "Author": "Beverly A. Horner \"Thistle and Sun Studios\"", "ReviewID": "R99AK7NWTL843", "Overall": "5.0", "Content": "What a fantastic product.  I love using it.  The picturers are clear, it is easy to use and I would recommend using this dealer anytime.", "Date": "March 9, 2014"}, {"Title": "Like Nikon Cameras", "Author": "Pamela Ballantine", "ReviewID": "R1E44APYLNYBJZ", "Overall": "3.0", "Content": "I love the ease at which I can use this Coolpix camera,  The lens stuck and Im disappointed becasue it is the second Coolpix Ive purchased that this has happened to.", "Date": "March 1, 2014"}, {"Title": "Great camera", "Author": "sewnewss8", "ReviewID": "R15I9IIPB1IRQI", "Overall": "5.0", "Content": "I've had this for several years now.  It is a great camera, easy to use, and takes great pictures.  Fits perfectly in the case I purchased for it.", "Date": "February 28, 2014"}, {"Title": "Good", "Author": "Jason \"J\"", "ReviewID": "R2BZP1PS7OMV2E", "Overall": "4.0", "Content": "nice camera for the price, bought a used one and was happy. Still trying to learn it the camera, quality of movies and pictures are fair to good. auto focus is a little loose, but ok", "Date": "February 27, 2014"}, {"Title": "Great camera for the pocket or purse.", "Author": "joyful \"Joy\"", "ReviewID": "R38TFHELGB1BLP", "Overall": "5.0", "Content": "It's small and light and takes moving shots that my iphone can't. The info on it is easy to read and implement.", "Date": "February 23, 2014"}, {"Title": "Good Quick and Tiny", "Author": "C. Myers", "ReviewID": "R3J4EQ3EML1438", "Overall": "4.0", "Content": "Loved the idea to not have to buy batteries!  Now can just charge it like so many other electronics of today.  Holds a charge for a very long time and doesn't take long to recharge.  Only negative I would mentioned is slight difficulty taking the sd card out, but could just be me.  Wish the buttons were more easily identified, so if you don't use it regularly, it might be necessary to get the booklet out each time when using.  It is small enough to drop in a pocket but large enough to be able to grip comfortably.  Would recommend it to anyone of any age to use.  Great close ups if using to take photos of items for sale on the web.", "Date": "February 16, 2014"}, {"Title": "GOOD", "Author": "JP", "ReviewID": "R2FXR7ASAAB01A", "Overall": "4.0", "Content": "Excellent little camera, good still zoom, no problems.  I use it as a professional Home Inspector, so it gets heavy use.  Only thing I don't like, is in video mode, cannot zoom.", "Date": "February 5, 2014"}, {"Title": "lasted only a few months", "Author": "redheadsoup", "ReviewID": "R29RLLHGV8ZW6V", "Overall": "1.0", "Content": "we purchased this camera for my son from a local store. He used it twice.  a few months later we went to use it and found the view screen stopped working. I tried to find an answer on the net and found that this is a common problem with this camera.  I tried to find an answer on fixing it but could not, rumor of a recall but could not confirm it. We are very disappointed with this camera.  I will not purchase another nikon product.", "Date": "January 31, 2014"}, {"Title": "Love it!", "Author": "Sweete A", "ReviewID": "R183TYSN3ZSF3D", "Overall": "5.0", "Content": "I bought it for my guy and he simply loved it! The purple color is beautiful and it takes wonderful pictures.", "Date": "January 27, 2014"}, {"Title": "Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens", "Author": "Katelyn", "ReviewID": "REP7R6DOAG1JN", "Overall": "3.0", "Content": "I will start off by saying this isn't a bad camera, for the price you pay its decent, it does have errors and problems, specially with the lens, I have had to warrentee mine 3 times, It sort of easy to use, but it does have a more complicated and extensive features great for people who know how to use them, bad for people who don't. Comes in great colors, easy to travel with you.", "Date": "January 24, 2014"}, {"Title": "Nice camera, but watch out for battery problems", "Author": "J. Mcshane \"Joe McShane\"", "ReviewID": "R3MMKU0CAP6U2O", "Overall": "3.0", "Content": "I bought this camera because I was fed up with having to replace AA batteries in other cameras.  This camera has a Li-ion rechargeable battery, which is great.  However, one thing you have to watch out for is that if you don't use the camera for a few days, the battery will discharge and you will get the message 'battery exhausted'.  I don't think you can do anything apart from buying a new battery when this happens - once the battery is exhausted, it will not recharge.  If you buy one of these cameras, you must always make sure you use it regularly (don't go without using for more than two days) and you must always ensure there is a charge in the battery (don't let it run out).", "Date": "January 17, 2014"}, {"Title": "Small enough to always have it with you", "Author": "johnphotographer", "ReviewID": "R2L8156LB1N71C", "Overall": "5.0", "Content": "Got this for our daughter last Christmas - she always carries it - she has 2 larger cameras - but are bulky and not easily transported for a day trip.  This little one does the job", "Date": "January 8, 2014"}, {"Title": "Compact & Simple", "Author": "Robert E. Eamigh", "ReviewID": "R38268BT764CYS", "Overall": "4.0", "Content": "For the price, I found the Coolpix S3300 camera a great buy. Its size, simplicity of operation and quality of pictures makes this camera a great purchase.", "Date": "January 7, 2014"}, {"Title": "I LOVE IT", "Author": "BriMarie", "ReviewID": "RHNPQNSQR6I0W", "Overall": "5.0", "Content": "Great camera, battery life lasts and it holds a good amount of pictures. Has really good quality and is easy to use plus light weight!", "Date": "January 4, 2014"}, {"Title": "Quit after a year!", "Author": "Katie", "ReviewID": "R1R8EVYSUV93D8", "Overall": "1.0", "Content": "Had this camera for a little over a year and it quit working right in the middle of taking pictures of a school Christmas program. Very disappointed! Would not buy another.", "Date": "January 3, 2014"}, {"Title": "Wow!", "Author": "Daydreamer \"Keep calm and be a dreamer.\"", "ReviewID": "RPDNEZJJGR21Z", "Overall": "5.0", "Content": "This thing is amazing. It takes beautiful pictures even indoor in poor lights. It is a little hard to hold it still enough not to blur the pics but you can use the sports setting. I love the panorama pictures and hd video.", "Date": "December 31, 2013"}, {"Title": "Simple yet great!", "Author": "Linda Johnson", "ReviewID": "R3CMF7YEL9CP1Z", "Overall": "5.0", "Content": "I got this for my husband to take on his hunting and fishing trips.  He loves it and it gets used for about everything!  For a cheaper camera it has worked well.  We just plug it in when the battery gets low and we have not had to replace the battery yet.", "Date": "December 31, 2013"}, {"Title": "Very good", "Author": "Victor Yee", "ReviewID": "R2EZBCCAQOGUJY", "Overall": "5.0", "Content": "i did buy this camera dic-2012, and until now it has been working perfectly, it was purchased as a christmas gift for my 8 years old girl and until now no problems found on this camera, the camera is not used in a daily basis, but it has been used very often, and being used for an 8 years old child, that is quite a challenge for this camera !!I would recomend if you dont need a DSLR camera", "Date": "December 28, 2013"}, {"Title": "great value", "Author": "Nanners", "ReviewID": "RQMIL79ZQJCRE", "Overall": "5.0", "Content": "My grand daughter was thrilled with this camera when she received it. She takes everywhere. She has become a good photographer. She is looking forward to printing some of the pictures she has taken for art purposes. I would buy this camera again.", "Date": "December 26, 2013"}, {"Title": "good camera", "Author": "Dani S.", "ReviewID": "R2WX59HRVV1OUB", "Overall": "4.0", "Content": "very good camera, not used to all the functions, as long as you read the booklet that came with it, you're good.  Very helpful or I wouldn't have found half the features it has. Good zoom feature, good quality photos", "Date": "December 18, 2013"}, {"Title": "good camera.", "Author": "T. moore", "ReviewID": "R1AEIXWJ5B4EPB", "Overall": "4.0", "Content": "I like it over all, but it takes a few seconds to load picture in screen after taking but other than that it takes great pictures indoors and out and nighttime pictures are great!", "Date": "December 18, 2013"}, {"Title": "Very bad", "Author": "Alice J. Drake", "ReviewID": "R1GN804Y5UBGGF", "Overall": "1.0", "Content": "I have only had it one year and the lens cover won't open. Of course, the warranty just ran out. I won't have another.", "Date": "December 17, 2013"}, {"Title": "Nice camera - takes good pictures", "Author": "Marilee Spitsnogle", "ReviewID": "R2R8VC0EVA852E", "Overall": "5.0", "Content": "This is  nice small camera with clear photos and lots of options.  I wanted something easy with good photos and video capability.  This fits the bill nicely.  Bought one for my daughter as well.", "Date": "December 13, 2013"}, {"Title": "Great pictures, but camera is very fragile.", "Author": "Eric R", "ReviewID": "R2Y79TJYTZWV8F", "Overall": "3.0", "Content": "Great pictures, but too fragile.This was the second Mikon compact I bought and although the pictures look great, the camera breaks easily.", "Date": "December 13, 2013"}, {"Title": "worst point and shoot cam", "Author": "Arun9", "ReviewID": "R3P0LX5I9CLUK1", "Overall": "2.0", "Content": "I should have stuck to canon. This was a big disappointment. Bad photos in low light and shutter lag is quite a lot for a quick casual pic. Auto focus doesnt work properly when there are two objects, one near and one far. Agreed that not much can be expected in a point and shoot but this is by far the worst point and shoot I ever used. The small form factor is only advantage with this. small enough to easily carry around.", "Date": "December 10, 2013"}, {"Title": "Sharp images", "Author": "reno,nv \"shoegal\"", "ReviewID": "R1L4NXO00JCIGT", "Overall": "5.0", "Content": "Good cheep camera. I use it all the time to record ideas, document my work. In the past, my coolpix's have broken in a year and a half or two, but the images are very sharp, so it's worth it to have a 'throw away camera'. (This one purchased in Aug for Burningman and it still works.)", "Date": "December 6, 2013"}, {"Title": "nikon camera", "Author": "william barrios", "ReviewID": "RFB9FMY6MDXA", "Overall": "5.0", "Content": "all ok good excellent care is a reliable product and recommend it 100% sure I've used it and really work great thank you very much for your attention", "Date": "December 5, 2013"}, {"Title": "Disgusted recipient", "Author": "Susan Parker", "ReviewID": "R2XRM8N05EUUUI", "Overall": "1.0", "Content": "I am so disgusted with this product. It came in a beat up box. I plugged it in to charge the battery and the charger doesn't work. The lens is scratched on the outside and the camera looks like it got hit by a truck. I will never order from this place again. I will also never order refurbished. It isn't worth the extra savings if it doesn't work.", "Date": "December 1, 2013"}, {"Title": "I would recommend for the price", "Author": "Eric M. Rohosky", "ReviewID": "R1KWD4P1NGHMZE", "Overall": "4.0", "Content": "Few complaints..took it to Disney and it performed well. Some shots took a little time to focus but otherwise a good camera. A few of my shots were blurry but that may have been my fault by not giving it enough time to focus.", "Date": "November 26, 2013"}, {"Title": "Nice inexpensive camera", "Author": "gcbgold", "ReviewID": "R3ISC0WMIO9ZPV", "Overall": "5.0", "Content": "Works great for an inexpensive camera.  Takes nice pictures. Easy to use.  Have had it for months and no problems.", "Date": "November 23, 2013"}, {"Title": "BEWARE", "Author": "Jane E.", "ReviewID": "R37AV97V562EC9", "Overall": "1.0", "Content": "I puirchased this camera after reading reviews and thought I could handle it being 80. I just use it for family gatherings and do not abuse it. Never left my house. However, the one big moment I wanted a camera was for when I volunteered at the Wounded Warriors galA inTexas with my 2 daughters and granddaughter and guess what it did not work would not focus. Now that was a once in a lifetime event for which I had no camera. Mind you I had already returned it once at my expense, they repaired it, no explanation of what was fixed, so now this is the second return, at my expense again, this time they gave an explanation that the focus needed to be repaired. so In four mos I have returned it twice at my expense. I emailed them my concerns,no response, so wrote them a physical letter over a month ago and no response to that either. So for mE and my family we all agre say this is a loser. If a company this large does not respond to their customers concerns I for one think they don't derserve my business ever again.My family will not buy their products either and I will continue to tell everyone that asks it is a pc of junk", "Date": "November 20, 2013"}, {"Title": "Perfect little camera", "Author": "Nancy Eaton \"ne1054\"", "ReviewID": "RNDXAKH6QYRGM", "Overall": "5.0", "Content": "Compact, Fits in my purse, easy to operate and focus is nice. Replaced my old camera that was a Nikon Cool Pix. Just a different model. Love it!!", "Date": "November 17, 2013"}, {"Title": "Not terrible, but not great either.", "Author": "Ddee", "ReviewID": "R1TUTTEV17HZ3B", "Overall": "3.0", "Content": "It's alright for the price, I'm not completely thrilled, it is slow when trying to look at pictures onthe camera screen.  One thing I really don't like is that usually when you take a pictureyou can look on the screen and see the picture right away, on this camera you actuallyhave to wait a couple of seconds, push a button so you can look at the pic, then push anotherbutton to go back to picture taking mode, to me that is a total pain because you want to seeright away if the picture is good enough or if you should take another one.  Oh, the zoom is notreally all that, it doesn't zoom all that much.  Some pictures I've taken with this camera have comeout great but it does have a lot of little things that are kind of annoying.", "Date": "November 14, 2013"}, {"Title": "Loved the color!", "Author": "Wanda S. Wilson", "ReviewID": "R1DBV21RK1SF50", "Overall": "5.0", "Content": "My daughter in law loved the camera.  The only thing she has a problem sometimes with the picture going very blurry.", "Date": "November 4, 2013"}, {"Title": "Thanks for the great camera...", "Author": "D. Hogg \"Dee RN\"", "ReviewID": "RAAHT0Q30Z1LF", "Overall": "5.0", "Content": "This thin little camera is awesome. Does exactly what the seller listed. It is easy to carry and fits in my pocket. Got some great shots of the lovely fall leaves in our area.", "Date": "October 28, 2013"}, {"Title": "Great camera!", "Author": "Melissa Frierson", "ReviewID": "R2QTLO4QW3HJ9N", "Overall": "5.0", "Content": "I had this camera for a month because my friend borrowed it and then lost it. However, the month I did have it, I loved it. It has a feature to take pictures in black and white, but it filters out one color. So, you could, for instance, put on red lipstick & choose to filter red. Then take the picture and your face will be black and white but your lips will be red. Very cool feature. It also has a very long battery life. VERY IMPORTANT TO ME. great product.", "Date": "October 25, 2013"}, {"Title": "Nice Camera", "Author": "dean", "ReviewID": "R28V7Z7FCXVM34", "Overall": "4.0", "Content": "Nice replacement for the camera the locked up on me and, so I had to get a replacement stuck With Nikon CoolPix and it does OK job for $80", "Date": "October 24, 2013"}, {"Title": "Great buy!", "Author": "Lindsay Lanczynski", "ReviewID": "R2E3TC7ZKQELG6", "Overall": "5.0", "Content": "I love Nikon and this is a great buy for a very affordable price. The pictures are very clear and the zoom works wonderfully.", "Date": "October 10, 2013"}, {"Title": "Wrong color!!", "Author": "Glen Jensen", "ReviewID": "R2FKYTOYAY8ZL3", "Overall": "2.0", "Content": "The camera works fine, my wife needs it for school. Problem is it's NOT PINK! The picture of the camera I purchased very clearly shows a pink camera and I received a silver camera.  Now my wife needed it for school, so she's okay.  But I am very unsatisfied with the purchase.", "Date": "October 8, 2013"}, {"Title": "Beautiful pictures", "Author": "Gemia August", "ReviewID": "R1ROYO46D34I42", "Overall": "5.0", "Content": "Got it for my grandma to take to Rome, she loves how beautiful the pictures come out and how light weight it is. She stillis trying to learn all the features, butshe loves it. It was packaged great, came quickly and has a warranty", "Date": "October 6, 2013"}, {"Title": "Nikon COOLPIX S3300 16 MP Digital Camera w/6x Zoom NIKKOR Glass Lens", "Author": "Terrel E Chappell", "ReviewID": "R2UCTX3FLNE4GW", "Overall": "5.0", "Content": "Great camera, good packaging. I love the compactness of the camera, but it takes wonderful pictures and also great videos.", "Date": "October 3, 2013"}, {"Title": "Great camera!", "Author": "Abbegirl", "ReviewID": "R2GNJOZXFT8YO2", "Overall": "5.0", "Content": "I have never owned a digital camera. I definitely picked the right one for my first! This is an awesome camera, especially for someone who has no experience with cameras. I'm still learning about all the features, but for point and click it's great! I have a tremor that causes my hands to shake, but you could never tell by looking at my pictures. That's an even bigger plus!", "Date": "October 2, 2013"}, {"Title": "New Camera", "Author": "Lisa Orr \"Heels Fan in Kenya\"", "ReviewID": "RKTAPBTOPUKDN", "Overall": "5.0", "Content": "I have been very happy with all of the Nikon Cool Pix cameras I have had. These are great products, and I enjoy using them.", "Date": "October 2, 2013"}, {"Title": "I love the camera!", "Author": "Arthenia Bolden", "ReviewID": "R10FZCV5PKPQ8Y", "Overall": "4.0", "Content": "I would have like to receive an owners manual in English. How can I get one? Is it possible to download one?", "Date": "September 30, 2013"}, {"Title": "Love it!", "Author": "SaraG2003", "ReviewID": "R2GX0K1PHHJAHO", "Overall": "5.0", "Content": "Lightweight, durable, easy to use, thankful I found it for a great price!  Ordered it at last minute and it came very quickly.", "Date": "September 28, 2013"}, {"Title": "good camera, excellent picture", "Author": "ravi", "ReviewID": "R13M2HDC7IMMKJ", "Overall": "4.0", "Content": "- Good point and shoot camera- sharp and crisp pictures- zoom feature not much impressive but that's okay- worth the price-Recommended", "Date": "September 17, 2013"}, {"Title": "Probably too many pixels for everyday's pics to e-mail", "Author": "Isabel from Paraguay", "ReviewID": "R2SRCJEX1WYQH3", "Overall": "5.0", "Content": "I had to fix it with half definition because it took a lot  of room in my archives in the computer. I will reserve all its full definition for very special pics, not to send by e-mail, too big. Very good, and I know I still do not use it at its full. I will learn more.", "Date": "September 13, 2013"}, {"Title": "Love it", "Author": "Everton G.Hylton", "ReviewID": "R2322JI1V27W8P", "Overall": "5.0", "Content": "My favourite shade is pink . Especially fuschia .I have a lot of things that are pink . I am 43 yrs old by the way. So anything pink I will buy . But back to the camera it take great pics , very clean and clear, great resolution.", "Date": "August 30, 2013"}, {"Title": "gift", "Author": "michelle shiever", "ReviewID": "RKGMWFP3EZMOO", "Overall": "5.0", "Content": "Gift for my husband.  He loves it-nice and small with great pictures..................highly recomended.  what more can I say?  thank you", "Date": "August 29, 2013"}, {"Title": "Picture quality excellent...", "Author": "Colleen R.", "ReviewID": "R25HRX1NQ0NA7R", "Overall": "3.0", "Content": "This is actually the THIRD of this exact model I bought in 12 months.  I accidentally broke the LED display about a week after using the first one, having placed the camera and my cell phone in a small camera case.  I do wish the camera had come with some kind of protection to prevent that from happening.  The broken camera continued to take beautiful pictures and actually was fun to use because of the \"blind\" point and shoot.  I bought a second camera almost immediately and enjoyed having double the batteries, cords, etc. to keep both charged and let the broken one be my \"back up\" for the good one.  The reason I had to buy a third was that my daughter accidentally tried to charge each of the cameras and unknowingly forced a KODAK camera charger cord into the ports on both, which made them both unable to charge and the one with the unbroken display would show nothing.  So now I have one working camera with three batteries, sets of cords, etc...  Hard lessons learned.  I now wrap my cameras in an old sock to protect the display and my daughter learned to NEVER FORCE any electronic connections.  I think it stinks that the electronic industry continues to require all different sizes of batteries and does not have universal ports to charge devices.  I would have purchased an updated model the third time but felt I had invested so much into the extra batteries and cords of the broken cameras and will be fiercely protective of this third camera!", "Date": "August 29, 2013"}, {"Title": "Great value", "Author": "Jeannie Mannino", "ReviewID": "R1DGD734WP4Z0C", "Overall": "5.0", "Content": "Easy to use and takes nice clear pics for the money. Light enought that I just carry in my purse al the time.", "Date": "August 28, 2013"}, {"Title": "Cute Camera", "Author": "Danielle Byers", "ReviewID": "R1KGM7ZU5JUBL2", "Overall": "4.0", "Content": "This camera is such a cute color and really easy to use.I don't have any complaints about this camera.It shipped here on time and was easy to put together and use.I bought it just to capture my son's first years of life and it's perfect for that.", "Date": "August 27, 2013"}, {"Title": "Love Coolpix", "Author": "SavvyShopper", "ReviewID": "R1Q5J9XVSWGIV5", "Overall": "5.0", "Content": "This is about our 4th coolpix throughout 10 yrs or so, we love our cool pix, you may wonder why so many?...well one drowned, the others just couldn't take the abuse of falling any more and we are talking on average having them for about 5 plus yrs, I can say we got our money's worth, price is right so is the shipping cost, very happy campers ;0)", "Date": "August 23, 2013"}, {"Title": "Expectations Not Met", "Author": "intheWood", "ReviewID": "R2PKQ89O7YIGNH", "Overall": "3.0", "Content": "Usually I would not hesitate in purchasing a Nikon product but I am not completely happy with this purchase. I find that the battery life is very limited. I would not select another camera without a eyepiece viewer in addition to the digital viewer. When in full sun I cannot make out the image being recorded in the viewfinder. It's a \"I guess I got what I wanted\" in the picture. Otherwise the quality is exceptional and I certainly would purchase another Nikon camera model that more closely met my criteria.", "Date": "August 23, 2013"}, {"Title": "This camera was exactly what I wanted.", "Author": "Barbara ortiz", "ReviewID": "R1YN18HRYB7IEW", "Overall": "5.0", "Content": "Extremely lightweight, easy to carry in my purse.  Easy to use, and it takes really sharp photos. I love it !!", "Date": "August 21, 2013"}, {"Title": "great point & shot camera", "Author": "Dog Walker 7", "ReviewID": "R1WSTG8042OU5M", "Overall": "5.0", "Content": "I used it for the first time yesterday & I was amazed how simple it was to use.  Pictures came out great.  Definitely recommend this camera for someone someone who basically just what's to take pictures without all the fuss", "Date": "August 21, 2013"}, {"Title": "Warranty in USA?????", "Author": "Richard Gariepy", "ReviewID": "RKX1JVLFINFY6", "Overall": "5.0", "Content": "I ordered the camera and it arrived 2 days early. I like that. The contents of the box did NOT contain any USA warranty card and the service/warranty information in the box was for Europe in several European languages. When I went to the Nikon website to register the camera a notice came back stating the product may be \"gray market\". Let's hope the camera doesn't break. Oh yea, the pictures are great and the camera is fully featured and easy to use.", "Date": "August 20, 2013"}, {"Title": "headline", "Author": "Kathy Souza", "ReviewID": "RQV7R4F373QWW", "Overall": "5.0", "Content": "I love my new camera.  It is so much easier to carry and handle than the one I had before.  I loved howed it helped center the person or persons faces when taking the picture.  The pictures came out great.", "Date": "August 15, 2013"}, {"Title": "Wonderful Camera", "Author": "Xadius Heard", "ReviewID": "R36ZHP4VTBDOG0", "Overall": "5.0", "Content": "I did not want an expensive camera considering I would only use it to take 720p videos for Youtube so this camera is just what I needed. Takes great pictures, small, inexpensive, and again 720p video!", "Date": "August 4, 2013"}, {"Title": "Great Camera", "Author": "Sunni", "ReviewID": "R1I6TGB20I7XWI", "Overall": "5.0", "Content": "Can't beat this camera for the price. It is easy to use and takes great pictures. I like the extra options it has and has delivered just what I wanted in a point and shoot camera", "Date": "August 2, 2013"}, {"Title": "GREAT CAMERA!!", "Author": "Corby S Achierno", "ReviewID": "R17SNJBAG73JOW", "Overall": "5.0", "Content": "i bought this camera for my son to use on our recent cruise to the Caribbean.  It was perfect and worked great for him.  For being so small and compact, it took great pictures.  Well worth the money we spent!!!!", "Date": "August 1, 2013"}, {"Title": "Not what I really expected", "Author": "GT", "ReviewID": "R1R97Z2172OT43", "Overall": "3.0", "Content": "I wanted to replace an old NIKON 8MP so I went with this oneI should have spent a little bit more money and I think I would have gotten something betterYou have to keep the flash on all the time if not the autofocus will not work and all your pictures will be flurry", "Date": "July 25, 2013"}, {"Title": "Good Price good camera", "Author": "Johannes B", "ReviewID": "R3PAY6R1LNNWQX", "Overall": "4.0", "Content": "For the $100 I payed for this camera it's really great.the batterie lasts long enough for 1-2 days of taking picures.Sometimes the Auto Focus doesn't work very well but if you try it a few times it will work again.I can recomend this camera to everybody but if you want good pictures of the distance I would recomend a better camera.", "Date": "July 22, 2013"}, {"Title": "great for my mom", "Author": "glorybe", "ReviewID": "RFHVALUJO5SB1", "Overall": "5.0", "Content": "I ordered this as a present for my mom, who is not tech savvy and a little forgetful.  She is able to take great pictures with it.  She loves the red color and small size to fit in her purse and the large viewing area.  Great price, too.", "Date": "July 21, 2013"}, {"Title": "Nikon", "Author": "yvonne", "ReviewID": "R2KJL2013Z8ZUW", "Overall": "5.0", "Content": "Great camera for a great price. I've enjoyed using this camera on my nature walks. The instruction manual has been helpful with some of the settings.", "Date": "July 21, 2013"}, {"Title": "Great  camera", "Author": "Jeanne", "ReviewID": "R1R0Z8JGGVC98Y", "Overall": "4.0", "Content": "Great camera,great pics on my vacation! Really good price too. Very happy with this. Also had video that works with audio .", "Date": "July 18, 2013"}, {"Title": "disappointing", "Author": "Janell D Alcott", "ReviewID": "R3U37VSDIBUA09", "Overall": "3.0", "Content": "when I first purchased this camera I thought it was great, however it's not performing like I think it should. I would spend a little more money next time and get a better camera.  I do love Nikon, just not this particular camera.", "Date": "July 16, 2013"}, {"Title": "Worked great until it broke", "Author": "David P.", "ReviewID": "R1BAR4324S5EYU", "Overall": "2.0", "Content": "I bought this camera as a gift for my girlfriend. She loved it and it worked great for about 3 months. The camera was taken very good care of and never dropped. The camera still turns on and seems to function normally but the screen just shows black and it will not take pictures. Overall, very disappointing :(.", "Date": "July 15, 2013"}, {"Title": "Very happy", "Author": "robert nelson", "ReviewID": "R17BCMS8YVFTIZ", "Overall": "5.0", "Content": "We are very happy with the camera, it works great! We will use you again in the future. Thanks much", "Date": "July 14, 2013"}, {"Title": "what a great coolpix", "Author": "Palmira Hernandez", "ReviewID": "R3VLI3P8V1WOI", "Overall": "5.0", "Content": "I love the why it takes picture took it to the beach the pic. were so clear so i give this coolpix s3300 five stars!!", "Date": "July 13, 2013"}, {"Title": "Pics", "Author": "Tereza Marinho", "ReviewID": "RC2FRH99TTWZP", "Overall": "5.0", "Content": "It is a very good camera for the price. Simple to use, simple to download. I recommend it to everyone looking for a simple and good quality camera.", "Date": "July 13, 2013"}, {"Title": "good camera", "Author": "Jane Martin", "ReviewID": "R9C14WVL57F7P", "Overall": "5.0", "Content": "I had been looking for a camera that would take a picture that I didn't have to \"focus\" and basically worked for a novice like me. I have tried many and sent them back .My son in law had this camera and I took it with me to the Grand Canyon. It was easy to use and took really good pictures, so I bought one. It has a lot of features that you can learn to use but I haven't done that yet so can't comment on that. For just taking pictures and zooming onto a subject you can't beat this for the price.", "Date": "July 11, 2013"}, {"Title": "love it", "Author": "Anedra Collier", "ReviewID": "R2NJN0D45JUCNZ", "Overall": "5.0", "Content": "very good price for the quality, nice and sleek design, takes very good pictures and my hand trembles a little.", "Date": "July 6, 2013"}, {"Title": "LOVE my little camera!", "Author": "Wanda Durost", "ReviewID": "RWT8W1WZPUYJM", "Overall": "5.0", "Content": "I am giving this camera a 5 star because I have nothing bad to say about it! Love the price, the size, ease of use, takes great pictures.....would recommend it for anyone!", "Date": "July 5, 2013"}, {"Title": "awesome camera", "Author": "Scott Nelson", "ReviewID": "R24SNEO10CFB3E", "Overall": "5.0", "Content": "It's light, it's compact, and takes wonderful pictures. I recommend this camera to everyone, I take it everywhere I go.", "Date": "July 3, 2013"}, {"Title": "Great for both photos and movies.", "Author": "John M. Gillroy \"John Martin Gillroy\"", "ReviewID": "R2M219R4PMODPL", "Overall": "4.0", "Content": "This is a fantastic camera, light, potable, with great optics and is very reliable. I wish it came with a print owners manual...JMG", "Date": "July 2, 2013"}, {"Title": "excellent camera", "Author": "Brent Del Pino \"hat man\"", "ReviewID": "R2DU7TGA4FBB6V", "Overall": "4.0", "Content": "Excellent camera.  The only thing is that I did not receive the lanyard nor the charger.  The price was exceptionally good", "Date": "July 1, 2013"}, {"Title": "Amazing little camera for great price", "Author": "Theresa Lodise", "ReviewID": "R2WRJIR72GNG1D", "Overall": "5.0", "Content": "I have been participating in an online photography class and purchased this camera after my old camera broke. I like the Nikon Coolpix series because they are lightweight, easy to operate and convenient for me to use despite my physically disability. I have been amazed at the numerous features in this camera that I have learned to use through my class. Although my old camera probably possessed similar features I did not yet have the skill/knowledge to fully appreciate them. This camera has offered me new surprises everyday as I learn new things and explore/practice accessing/using the subtle adjustments/settings/features. If I have anything at all negative to say it would be that the camera has turned on at times when I have accidentally pressed the button while it was in the case, in my purse or on a strap around my neck. This concerns me because this sort of thing can result in a \"lens error\" which can jam the lens and subsequently destroy the camera. These \"lens error\" issues are in fact what meant the end of my two previous Nikons and are very common in the Coolpix series. Despite this I still have found them to be the best cameras for me.", "Date": "July 1, 2013"}, {"Title": "work", "Author": "Barbara Spicer", "ReviewID": "R257OF81FY7OVE", "Overall": "5.0", "Content": "this was bought for work and the security team is using it very day and now I can take mine back", "Date": "June 30, 2013"}, {"Title": "DOES NOT CHARGE.", "Author": "Jessie", "ReviewID": "R1LVLER2AB5AAV", "Overall": "2.0", "Content": "I am so disappointed with this camera. It records all right in HD, especially for the price.But after about four months of buying this camera brand new, it stopped charging. I even bought a new charger, but still, it would not charge. And Sony customer service is awful. Don't waste your money on this. Nikon has some great cameras, but this one is definitely not one of them. Opt for a pricier camera that is better quality.", "Date": "June 27, 2013"}, {"Title": "nikor S3300 digital camera", "Author": "mokihana", "ReviewID": "RM86HHUKGGNT6", "Overall": "5.0", "Content": "Love it!  It allows me to be a really good photographer, which I am not.  The pictures I took on my Alaska cruise came out really clear.  I didn't have that much time to practice with the camera before my cruise, but now intend to take a lot of pictures.It is just small enough that I can put it in my purse or hang it from the strap of purse.  Not heavy, easily portable.", "Date": "June 26, 2013"}, {"Title": "Review of new camera", "Author": "Franklin", "ReviewID": "R3TQR3BZU4I7T2", "Overall": "3.0", "Content": "It is compatible with the software from previous purchase and also with the older editing program I use. The previous Nikon had a problem with the gearing for the lens and would lock up. After the third time I purchased this new one at a lesser cost than the cost of fixing the lens on my old one. Its a good camera, adequate for my purposes.", "Date": "June 24, 2013"}, {"Title": "Everything I Needed", "Author": "ychuck46", "ReviewID": "R1MAUTE460QYHF", "Overall": "5.0", "Content": "Lightweight and portable, good resolution at 16MP, intuitive menu, and a good price.  All in all a very good value.", "Date": "June 22, 2013"}, {"Title": "Good value for the buy", "Author": "Prasad Nagaraja", "ReviewID": "R4B42JYZZEXHN", "Overall": "4.0", "Content": "I got this 2 weeks back and it has been doing good so far. Its a good value for the money. Basic camera with no special features.", "Date": "June 17, 2013"}, {"Title": "Great camera for that price", "Author": "Ivaylo P.", "ReviewID": "REBJEZL6Z9ET3", "Overall": "5.0", "Content": "Does descent pictures and shoots HD movie. I't easy to operate. Pull it out of your pocket turn it on shoot pic/vid turn it off and to the pocket again. For a camera under 100$ is a good value. Comes with no 40Mb+ storage, so SD card is a must. But I guess that's common among cameras of this range.The optical zoom is a nice addition although I don't care much about that feature.Nice compact design and useful.I got what I paid for.", "Date": "June 16, 2013"}, {"Title": "Good basic camera", "Author": "Yen", "ReviewID": "R1NGO8R9OCCMUE", "Overall": "4.0", "Content": "Nikon is suppose to have good products but this camera doesn't have good image quality, I have a Samsung and it takes better pictures than this Nikon, I don't know if it's because this model is a basic camera", "Date": "June 14, 2013"}, {"Title": "Arrived on-time and excellant shape", "Author": "AZGUY", "ReviewID": "R2OQVGP7ZRFW7O", "Overall": "4.0", "Content": "The camera replaced a Samsung 10mp unit that was damaged in a wreck. It worked well and was charged when it arrived. I like the unit and gave it to my stepdaughter for her use and to replace the broken unit.", "Date": "June 14, 2013"}, {"Title": "soft pics, grainy vids.", "Author": "Odn \"Odn\"", "ReviewID": "R44O1YTY6Z4N9", "Overall": "4.0", "Content": "I would probably go 3.5, but 4 is ok, because I picked it up in good shape rather cheap.  Some of the pics are ok, some awful. Some of the video is ok, anything past 20 ft seems really grainy.  I think I was expecting something better than my old Coolpix P60 before I ruined it....not so: the P60 took much better video indoors and out (and not even HD) and pics. Some of the pics are good, though and this camera is far more compact.", "Date": "June 11, 2013"}, {"Title": "Takes great pics", "Author": "Nicole Andrea Baptist", "ReviewID": "R5PVSGMOXUVD6", "Overall": "5.0", "Content": "This Nikon Coolpix  takes really great pictures. Its my favorite color. Simple to use and light weight. The only thing that would make it better is if it were waterproof!", "Date": "June 10, 2013"}, {"Title": "Very nice camera but.....", "Author": "Scott Matthew Fine", "ReviewID": "RS313IJB5ZU5P", "Overall": "4.0", "Content": "It is a very nice camera. I got it for my girlfriend and she loves it except for one issue. It takes VERY slow pictures. When you press the button it takes a few seconds to to take the picture Then it takes quite some time to save the picture and prep it for another picture. Just don't expect it to take a lot of pictures fast and you will be fine.", "Date": "June 8, 2013"}, {"Title": "Love it", "Author": "Kathy", "ReviewID": "R3KIHRXBZYGU5P", "Overall": "5.0", "Content": "Great camera for a point and shoot.  has a lot of nice features.  battery holds up pretty well. Good value.", "Date": "June 7, 2013"}, {"Title": "A great little camera", "Author": "J. Emborsky", "ReviewID": "R9JPCIYUQFPK8", "Overall": "5.0", "Content": "It is easy to use and the photos are first class. I highly recommend it and would buy another for myself or as a gift.", "Date": "June 6, 2013"}, {"Title": "great camera..", "Author": "Krissie", "ReviewID": "R2S6BOD614DPTR", "Overall": "4.0", "Content": "Bought the camera and the HDE case.. great pairing.  Camera is easy to use and manual is 'user friendly'I am not a pro, but this camera provided me with great pix and videos.  Recommend it highly.", "Date": "June 4, 2013"}, {"Title": "coolpix S3300", "Author": "richard e chestnut", "ReviewID": "R17PM5T8GWJL6B", "Overall": "4.0", "Content": "As expected, purchased a newer model to replace a older model that got damaged, will purchase again in the future", "Date": "June 2, 2013"}, {"Title": "review", "Author": "Matilda G Allen", "ReviewID": "RVPUZ4WUEJNXZ", "Overall": "5.0", "Content": "Excellent camera and the price is right. I am very happy with my purchase. Pictures are great and anyone can use it. Thank you.", "Date": "May 29, 2013"}, {"Title": "Coolpix3300", "Author": "Stingray662", "ReviewID": "RRXXTC9HTIXN7", "Overall": "3.0", "Content": "Bought this for my wife because of the color.  Color of camera is great, battery and sd card access door is cheap plastic and I wonder how long it will last.  Camera seems to take good pics for a quickie camera.", "Date": "May 25, 2013"}, {"Title": "Gorgeous camera", "Author": "Elizabeth", "ReviewID": "RXP6IH8LTLG97", "Overall": "5.0", "Content": "Absolutely amazing, its a lot better than my old Nikon Coolpix. It takes perfect pictures and has so many settings and all you have to do is charge the battery, instead of constantly buying new ones. And it was shipped really fast.", "Date": "May 24, 2013"}, {"Title": "Great", "Author": "Lois A.Rose", "ReviewID": "R10FZSP5S50HR1", "Overall": "5.0", "Content": "Takes the best pictures ever for such a small camera. It takes great action shots with no blurring---stops everything in mid motion, even my grandson.", "Date": "May 24, 2013"}, {"Title": "Great Camera", "Author": "Amazon Customer", "ReviewID": "RPLDN3SW2PZJ7", "Overall": "5.0", "Content": "I love this camera for the deal!I remember when I spent hundreds of dollars to get a 5 megapixel camera...no longer necessary!", "Date": "May 23, 2013"}, {"Title": "Great little camera", "Author": "Calla \"Calla\"", "ReviewID": "R1091RGKNCFPY9", "Overall": "5.0", "Content": "Takes great pictures! Small and compact, so it doesn't take up a lot of space. This is for the people who want a great camera without spending at least $600. Great for the price, compact, and easy to use. Is great indoor and outdoor.", "Date": "May 19, 2013"}, {"Title": "Item damaged upon receipt", "Author": "kristine will", "ReviewID": "R1NZF3TEIW0D64", "Overall": "2.0", "Content": "I have the same camera, so I ordered one for my husband.  I like the Nikon COOLPIX S3300, however, when we received our product, the screen was distorted/damaged.  We had to return it the same day.  We did however place another order for the red NIKON COOLPIX S6300.  Thank you", "Date": "May 17, 2013"}, {"Title": "Easy to use, beautiful and clear photos!", "Author": "Amalia Armijo", "ReviewID": "R2W1FPPNWIPTKQ", "Overall": "5.0", "Content": "I recently purchased this for a trip because my old camera broke. I was much more familiar with Kodak Easyshare cameras but this Nikon was easy to learn. The menus are simple, and it's easy to charge. There are so many various settings to chose, but I found if I leave it in auto, it takes perfect photos all the time. The timer is easy to use as well. Overall, I've had no problems and have been very happy with it. I've had it almost 2 months and it held up very well on my vacation. Love the beautiful pink color, too.", "Date": "May 11, 2013"}, {"Title": "Love It!", "Author": "Maria V Reynolds", "ReviewID": "R18GMXZLOG5CXA", "Overall": "5.0", "Content": "i purchased one for myself and had to get another for my daughter.  She loves taking pictures.  Good resolution great price!", "Date": "May 6, 2013"}, {"Title": "About this camera", "Author": "gopal", "ReviewID": "R1NXS8VJBOXU0T", "Overall": "5.0", "Content": "I like this camera, pictures are clear,battery life good. easy sharing and processing. very light and easy to carry around.", "Date": "April 24, 2013"}, {"Title": "So far so good!", "Author": "snicklebooper", "ReviewID": "R4FFUP23OSSNS", "Overall": "5.0", "Content": "Bought this for my daughter's 13 birthday and she loves the fun color.  I love what you get for the price.  She is able to take great pictures with it.", "Date": "April 23, 2013"}, {"Title": "My new camera", "Author": "kathy", "ReviewID": "R3GE91SKIUQJF4", "Overall": "5.0", "Content": "It was just what I was looking for - not to small and not to big  - the pictures are clear as a bell better then my old one they came in too fuzzy - thank you it's the bomb", "Date": "April 21, 2013"}, {"Title": "Great", "Author": "debra balfanz", "ReviewID": "RBY2W40OZZPPS", "Overall": "5.0", "Content": "I got it for my daughter to use for school. She tells me she really likes it. So I might get me one too.", "Date": "April 21, 2013"}, {"Title": "great cam", "Author": "marlon", "ReviewID": "R2PXFXHSB8YTVI", "Overall": "5.0", "Content": "this is a great camera . It take wonderful pictures and video. i recommend it as a cheap and effective camera", "Date": "April 20, 2013"}, {"Title": "Nikon Coolpix S3300", "Author": "Charles M", "ReviewID": "R2CEHXUDKAB4DN", "Overall": "4.0", "Content": "Takes excellent pictures. The only downside is it does not have a view finder and you must depend on the led screen. In bright sun it is sometimes hard to see. It is a nice size and easy to carry in your pocket.", "Date": "April 11, 2013"}, {"Title": "WOW", "Author": "2SF", "ReviewID": "R3FJYUHJKOK6W3", "Overall": "5.0", "Content": "I bought this camera for my 9 year old.  This camera takes AMAZING pictures!  I shoot with a Canon Rebel and am truly amazed at the quality of photos that comes from this little pocket sized camera (at a fraction of the price). : It even takes video!Only downside is that it did not come with a memory card or camera case which required an extra trip to the store.", "Date": "April 9, 2013"}, {"Title": "Great product as a gift", "Author": "Self Review", "ReviewID": "R37EOLAD4WJUUV", "Overall": "5.0", "Content": "I have purchased to gift it to my colleague on his wedding...I am sure he will love this gift and the snaps he will take on his honeymoon tour...shhhhh!", "Date": "April 9, 2013"}, {"Title": "Nikon Digital Camera.", "Author": "Judith A. Foley", "ReviewID": "R11OULY63JURIQ", "Overall": "5.0", "Content": "One of the best camera's out there.  I have no problems uploaded my pictures unto the internet.  This is  a very easy step.", "Date": "April 6, 2013"}, {"Title": "Cool", "Author": "Veronica Mendoza", "ReviewID": "R1OVFYY9OR8XH1", "Overall": "4.0", "Content": "The camera is good.  It does look a bit cheap but takes good pictures.  For the price I would recommend it.", "Date": "April 5, 2013"}, {"Title": "Average Camera", "Author": "Sarah Kretschmer", "ReviewID": "R1DTJ0974I5UXV", "Overall": "4.0", "Content": "This is just your average point and shoot camera.Nothing extremely special when it comes to a camera!But well worth the money", "Date": "April 4, 2013"}, {"Title": "Very Very good camera", "Author": "Billy W. Kiggins", "ReviewID": "R1W6OK0LX4YOAY", "Overall": "5.0", "Content": "Well review readers ,  just so you know I am a 69 year old man that has had considerable experience in photography.And without getting into a bunch of confusing details the S3300 is a very good camera .  I can be a very critical personon evaluating anything .  However for the price of this camera you can not go wrong .  99 percent of the time settingeverything on automatic will give you very good results . But when you do want to it is surprisingly controlable also .Just take the time to familiarize yourself with the controls which is very easy to do and you will enjoy this little gem .  As always , thank you Amazon for prompt service .  Have a Great day folks !  Billy  Kiggins", "Date": "April 4, 2013"}, {"Title": "Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens and 2.7-inch LCD (Silver)", "Author": "pollygirl51", "ReviewID": "R29ODCFC2SSLG2", "Overall": "5.0", "Content": "Love it! Althought I'm still learning how to use it. So far I have taken a few pictures of my daughters pets and the pictures are great.", "Date": "April 2, 2013"}, {"Title": "Great Color and size", "Author": "Amanda", "ReviewID": "R3Q5ESBZ3LNXTJ", "Overall": "5.0", "Content": "Beautiful color, the camera is really compact and easy to carry, easy to use, depending on the type of scene photographs are excellent, real good colors, flash really does its job, I recommend it.", "Date": "April 1, 2013"}, {"Title": "awesome camera", "Author": "Robert B.", "ReviewID": "R3G3YAARGAC0KZ", "Overall": "4.0", "Content": "the nikon coolpix s3300 is awesome i have it. it's cheap but takes outstanding pictures and awesome HD 720p videos", "Date": "April 1, 2013"}, {"Title": "Muy bueno", "Author": "Osiris", "ReviewID": "R1FDHD67GCQ22N", "Overall": "5.0", "Content": "Excelente cámara! Tal cual descrita... Recomendado 100  % / Excellent camera! As is described ... Recommended 100% Five star .", "Date": "March 29, 2013"}, {"Title": "Mom has arrived in the future", "Author": "Cole Carson", "ReviewID": "R1YDLP7PXOBXVS", "Overall": "5.0", "Content": "Got this for my mom for X-mas because it was definitely time she had a digital camera. It works great & is super user friendly", "Date": "March 29, 2013"}, {"Title": "Works Great", "Author": "Jimbob", "ReviewID": "R2OD9NG5IWXX39", "Overall": "5.0", "Content": "I bought this camera just before I went on a cruise. I now have pictures and videos of a great trip.", "Date": "March 29, 2013"}, {"Title": "Great point and shoot", "Author": "zeke12", "ReviewID": "R33B7HQ53D786F", "Overall": "5.0", "Content": "My last camera finally died so I replaced it with this and can't be happier.  Size, quality, pictures.  I appreciate the rechargeable battery, too.", "Date": "March 28, 2013"}, {"Title": "Excellent camera for the money", "Author": "Mrs. P", "ReviewID": "R377PBHM5R1K75", "Overall": "5.0", "Content": "I have been looking for a small, lightweight camera to carry around in my purse.  I haven't figured out all of the modes yet, but it seems to work fantastic.  I get tons of attention on facebook with every picture that I take with this camera.  The colors are crisp and bright.  Pictures are clear.  It's only problem so far seems to be large groups in crappy lighting (think indoor school choir concert).  Too many faces for it to focus on and that icky stage lighting that is very good at ruining photos.", "Date": "March 28, 2013"}, {"Title": "excellent", "Author": "Carrie kuhaupt", "ReviewID": "R1B0I6OKWOF7D0", "Overall": "5.0", "Content": "This small camera is just as good as its bigger companion, I would recomend to anyone who wants a small one.", "Date": "March 26, 2013"}, {"Title": "It takes good pictures but feels alittle on the flimsy side.", "Author": "nancy", "ReviewID": "R1AOXVTC5IR7IR", "Overall": "4.0", "Content": "I have not tried all the features but for basic picture taking, the pictures are crisp and the zoom is great. It is easy to put the pictures onto the computer too and took only minutes to figure out which, for me a huge technophobe, was a delight! It does feel abit on the flimsy side and I would be afraid to drop it. The zoom button is easy to work but still I get the feeling that if you do it too quickly, the buttom might come right off. This may sound silly but the color may have something to do with it too as if you got a silver one, you think \"metal, durability\" I purchased the 2 year accident plan just in case.", "Date": "March 26, 2013"}, {"Title": "No Regrets!", "Author": "Nodrog", "ReviewID": "RE0Y7C8RWMUQE", "Overall": "5.0", "Content": "I've always liked Nikon cameras the qualities of the pictures are superb. I have No regrets for choosing this brand camera.", "Date": "March 25, 2013"}, {"Title": "Whole fam love it...", "Author": "larry benard", "ReviewID": "R16JKPFKUGY2LB", "Overall": "5.0", "Content": "so cool camera, easy to shoot , love it ...repeat Nikon customers..will buy again, so easy for the whole family.", "Date": "March 24, 2013"}, {"Title": "awesome", "Author": "Russell J. Knisley", "ReviewID": "R37Y5JSLOFOVC3", "Overall": "4.0", "Content": "for the price, it rocks......easy to use, light and fun. worked like a champ right out of the box. Would highly recommend.", "Date": "March 23, 2013"}, {"Title": "Great!", "Author": "Crystal Spradlin", "ReviewID": "R300OHP5LUYCNB", "Overall": "5.0", "Content": "It is exactly what I expected. I love it! Great quality for a great price! Saved about $40.00 on it.", "Date": "March 23, 2013"}, {"Title": "great", "Author": "donisha harris", "ReviewID": "R318YWB16AQC57", "Overall": "4.0", "Content": "its small and easy to use and the flash don't have you seeing spots lol time to fill up the picture books", "Date": "March 22, 2013"}, {"Title": "Wonderful Camer That Fits the Budget!", "Author": "Youlanda Henry", "ReviewID": "ROL3XG66L7CZA", "Overall": "5.0", "Content": "The one downer? No extra battery. And since it doesn'y use regular old alkaline, that can be a bummer depending on where you are. But still, amazing.Crisp pictures, even in low light.", "Date": "March 21, 2013"}, {"Title": "great", "Author": "Pen Name", "ReviewID": "RH5OQ7QO84S22", "Overall": "5.0", "Content": "I love this camera. Its small easy to carry around and a great starter camera. I like the picture for how small it is and it works well.", "Date": "March 21, 2013"}, {"Title": "great camera, it's a Nikon. Enough said", "Author": "Mick", "ReviewID": "R1JIU10JSX8O0K", "Overall": "5.0", "Content": "We purchased this camera for my mother as a Christmas present and she loves it.  The camera is great and takes fanastic pictures.", "Date": "March 21, 2013"}, {"Title": "cámara", "Author": "Naicols Silva", "ReviewID": "R1VSCCQ1HWBGPW", "Overall": "5.0", "Content": "Excelente. Continuaré comprando a este vendedor. Tienda recomendada para hacer más compras internacionales. GRACIAS POR LA VENTA DEL PRODUCTO. SALUDOS", "Date": "March 19, 2013"}, {"Title": "Good camera.  Great price", "Author": "Barry Alan \"bartsky\"", "ReviewID": "RAK3X6WAMB3YN", "Overall": "4.0", "Content": "A good camera for the price I paid.  I had an earlier model that took nice photos, so I thought I would try the upgrade.  Basically the same camera.  It is very portable and fits in a pocket, so it is easy to take along anywhere.  The zoom could be clearer, but no real complaints.  It helps to read the instructions and learrn how to set the camera for best results.  Overall a good purchase.", "Date": "March 18, 2013"}, {"Title": "design", "Author": "harvey dinkin", "ReviewID": "R36ZN5QCWLPUUO", "Overall": "5.0", "Content": "quality of product and ease of use make this item ideal to carry and travel with plus the size is perfect", "Date": "March 17, 2013"}, {"Title": "Blurry pictures", "Author": "B. Barnes", "ReviewID": "R1E4YFNZN9LQ44", "Overall": "2.0", "Content": "The shutter speed is too slow, so many pictures end up blurry or misses what I intended to capture. It was a good price, but the constant repeat pictures aren't worth it.", "Date": "March 16, 2013"}, {"Title": "Great Camera", "Author": "Duke", "ReviewID": "RNN8BPJU9XJZW", "Overall": "5.0", "Content": "Got this for our daughter (8yrs) as a beginner's camera. Works great and is easy to use. She loves it, plus its pink!", "Date": "March 15, 2013"}, {"Title": "Very Good Camera", "Author": "S.Rod", "ReviewID": "RVUFVWDGM9486", "Overall": "5.0", "Content": "I got for my oldest daugther for Christmas. She love it, uses it alot for pictures and videos for her kids school games and activities.", "Date": "March 12, 2013"}, {"Title": "Love it but have to keep replacing", "Author": "TomKat", "ReviewID": "R159TRK6TKF3NK", "Overall": "2.0", "Content": "My husband bought me this camera for Christmas because we got a new grandchild. I love the camera and it takes great pictures, however we had the first one 31 days and it would not turn on. We took it back to Best Buy and they replaced it. Exactly 30 days later, the exact same thing happened. We are taking it back for a different camera.", "Date": "March 12, 2013"}, {"Title": "It's really good!!!", "Author": "Liziane", "ReviewID": "R1MCB8XIC4I5U3", "Overall": "5.0", "Content": "I love the size, the facilities, the battery lifetime and the quality of the pictures and videos. It's really easy to use!", "Date": "March 12, 2013"}, {"Title": "re my camera", "Author": "Lisa Sorenson", "ReviewID": "R1RQWLN2TA43SF", "Overall": "5.0", "Content": "It works great, easy to use and understand and was descent price. Everythiong is easy with this camera even down to carryong it with you, it doesnt take any space at all but is always there if you need it.", "Date": "March 11, 2013"}, {"Title": "Good price", "Author": "Patricia Greenleaf", "ReviewID": "R1FM74IVFJDUZ7", "Overall": "3.0", "Content": "The camera was a good buy.  Not the best camera I ever owned but it serves the purpose.  I'm not a professional photographer so it works for me.", "Date": "March 4, 2013"}, {"Title": "Love it.", "Author": "evilidcat", "ReviewID": "RRDJSTYKQN52J", "Overall": "5.0", "Content": "Great little camera. Easy to use. Easy to carry. Just a all around basic nice little camera. No need to pay a fortune for something basic.", "Date": "March 2, 2013"}, {"Title": "good deal for the price", "Author": "Elisabetta Girardi", "ReviewID": "R2X9T2YACCC16K", "Overall": "3.0", "Content": "This camera is a good deal for the price, but it's not the easiest one to use... if you give it to your kid (like I did) without many explanations, most of the pictures will come out blurry!", "Date": "March 1, 2013"}, {"Title": "Blurry photos, then display cracked", "Author": "Patti Margarita", "ReviewID": "R17LM68HZDEBH5", "Overall": "2.0", "Content": "We bought this camera for $42 on Amazon during the holidays for my daughter because it looked like a great camera for the price. I am used to a Canon 5d Mark II. The images are not crisp, so I am not sure where the image stabilization comes in. I have taken a few myself and if you are not sitting completely still and hold it for a few seconds after taking the photo, you get some blur.We had the camera on vacation with us this past week and had it in a case in a backpack and the display screen cracked. Since we only paid $42 for it, not going to pay to have it fixed. Now I come back and it is more than double the cost.", "Date": "March 1, 2013"}, {"Title": "Love this camera", "Author": "L. Orazi", "ReviewID": "R1SHQI44V7CHX6", "Overall": "5.0", "Content": "I bought this camera because I want to take good close ups of nature and people. My Iphone camera does not give me the detail I was looking for and this camera fit the bill perfectly.", "Date": "March 1, 2013"}, {"Title": "great deal", "Author": "dvmoore36", "ReviewID": "R3VDZAP5T669LR", "Overall": "5.0", "Content": "l love this nikon digital camera the fact that verything came with the camera didn't have to buy parts of this camera was great it work nothing was miss or broken just love it", "Date": "March 1, 2013"}, {"Title": "all around good camera", "Author": "Ted Kallas", "ReviewID": "R2SCTZ0MFY571V", "Overall": "5.0", "Content": "The camera met my expectations. I'm very happy with it. It is a bit slow sometimes but none the less it works great.", "Date": "February 27, 2013"}, {"Title": "Great easy to use camera", "Author": "momof3", "ReviewID": "R2AGOFC5R9L8OV", "Overall": "5.0", "Content": "Santa brought this for our 7 year old.  It's a great camera, easy to use.  Bought a small memory card to go with it and she is all set.  Probably too nice for a 7 year old but the deal at Christmas was too good to pass by.  The cheap kid cameras aren't worth it.", "Date": "February 26, 2013"}, {"Title": "My Camera is Cool", "Author": "Alvin J. Mason", "ReviewID": "RDN5R2ZXJI2EX", "Overall": "5.0", "Content": "I must say that I am an amateur when it comes to camera's but this Nikon has not let me down. It has been easy to operate and easy to learn. I love the safety feature that shuts the camera down when it's not in use. I give it a three thumbs up. Well ok, two thumbs up since that all I have.", "Date": "February 25, 2013"}, {"Title": "awesome busniess", "Author": "Monica Schaller", "ReviewID": "R2579KTWJ7U116", "Overall": "5.0", "Content": "this item didn't take anytime & it was around Christmas so that impressed me more..the camera is very nice", "Date": "February 24, 2013"}, {"Title": "This is a great product", "Author": "Rolando Gomez Rep. Dom.", "ReviewID": "R2KJJW6PEP3KO2", "Overall": "5.0", "Content": "Thank you for this great digital camera with very good performance and very nice and compact item.  I will to buy somethings more soon.", "Date": "February 24, 2013"}, {"Title": "Small, Light, and Powerful", "Author": "Charlee R Snow", "ReviewID": "RCMH9NAK4TJKI", "Overall": "5.0", "Content": "I've had this camera for 6 days and have used it every day.I'm a bird watcher.  This camera doesn't have a long enough zoom to make it a really good bird watching camera, but it does come in handy for birds in flight.  I took it to the beach and got several high definition pictures of sea birds just lounging around (you could get withing about 8 feet of most beach birds before they spook).  Best of all, I got a number of pictures of birds in flight--the wide angle lens doing good work.I take pictures of small objects to sell over the internet.  It was easy to use the menu to change the picture mode to the low def needed for on-screen photos, and the macro feature worked flawlessly.From the experiences I've had so far, I'm sure this would be a good camera to take with me when I visit the grand-kids.The only thing missing is an optical viewfinder.  Outdoor, and especially bird-in-flight pictures, would go better with an optical viewfinder.If you want a cheap, versicle camera, you could do a lot worse.", "Date": "February 24, 2013"}, {"Title": "Easy to use - affordable enough to leave at daycare", "Author": "Eric", "ReviewID": "R2NETJZVBFNLW3", "Overall": "4.0", "Content": "We bought one of these for our daycare center to use to take pictures of our kid so we don't miss what he does at daycare.  Works easy and pictures come out fairly clean.  Only complaint is red-eye tends to be prevalent in indoor pictures.", "Date": "February 23, 2013"}, {"Title": "Great deal", "Author": "cheyenne", "ReviewID": "R1ZLZ27SU9BTXD", "Overall": "5.0", "Content": "It's a basic digital camera, nothing fancy. But, still a wonderful little thing, let me tell ya!!! The pictures come out great. For the price, it's totally worth it.This would be a perfect camera for a teenager !!! ;}", "Date": "February 22, 2013"}, {"Title": "Very Good", "Author": "Gonzalo", "ReviewID": "RJ7RAE9IM1CFB", "Overall": "5.0", "Content": "Really I have no words to express how pleased I am purchasing this product exceeded my expectations because I'm so very happy.", "Date": "February 22, 2013"}, {"Title": "NOT WHAT I EXPECTED FROM NIKON", "Author": "Thom", "ReviewID": "RF4L4H8E6DNQZ", "Overall": "3.0", "Content": "I bought a Nikon Coolpix 3300 because of its compact size and 16 megapixel resolution plus a 6x optical zoom. That's all I got. Slow to save a photo. I get tired of trying to take photos with it. Image stabilization is terrible. Most of the photos come out far less quality than I get with several Olympus point and shoots.", "Date": "February 22, 2013"}, {"Title": "More for less!", "Author": "Eddie Wright", "ReviewID": "R228FYLLJOBVMO", "Overall": "5.0", "Content": "his camera covers all of the basics for the average home photog, but also packs a few welcome additions sure to delight any enthusiast.", "Date": "February 22, 2013"}, {"Title": "excelent", "Author": "agustin iglesia", "ReviewID": "R2JDVPA0WOY9N8", "Overall": "5.0", "Content": "muy buen producto. rapido facil y a tiempo la entrega. sin contratiempos en todo el proceso. lo recomiendo a a", "Date": "February 21, 2013"}, {"Title": "Size of the camera and quality of the photos are good", "Author": "Steven Mayer", "ReviewID": "RN2FN5TO4CQM4", "Overall": "5.0", "Content": "Size of the camera and quality of the photos are good.  I like the live look of the scene in the LCD.", "Date": "February 20, 2013"}, {"Title": "Love my Nikons", "Author": "Jackie Carey", "ReviewID": "R1N8T6THV0XIGS", "Overall": "5.0", "Content": "I have always used Nikons and this one lives up to its predecessors. Small, light, cool purple and easy to use. And the pictures are great.", "Date": "February 19, 2013"}, {"Title": "A great product.", "Author": "Vasanth", "ReviewID": "RE3EUX04HOAFP", "Overall": "5.0", "Content": "I got this camera for my lab purposes. It works great and does all the basic needs. The images are crisp and clear and the auto focus works good. Definitely worth the price paid.", "Date": "February 19, 2013"}, {"Title": "Love the size", "Author": "Southern Girl \"Say something about yourself!\"", "ReviewID": "R5645S9WGU0FA", "Overall": "4.0", "Content": "I just love the small size. It takes great pictures. There are 2 things that I'm disappointed in (1) the slow shutter speed and (2) no little paper manual to put in my purse.", "Date": "February 18, 2013"}, {"Title": "Nice Crisp Shots but the Camera is Slow", "Author": "Deborah A. Deal", "ReviewID": "R122X8P0RJJIIK", "Overall": "4.0", "Content": "I love the nice crisp shots I get with this camera.  The camera is very easy to use but other reviews are correct in stating that the camera is slow.... HOWEVER I think it is a great deal for the money.", "Date": "February 18, 2013"}, {"Title": "Great Gift!", "Author": "Laurie Heath", "ReviewID": "R1GOX2665ALAN3", "Overall": "5.0", "Content": "My son and daughter in law are both very happy with their new camera!  Now I will hopefully get more pictures of my sweet grandson!", "Date": "February 18, 2013"}, {"Title": "Coolpix S3300 camera", "Author": "Donn Latour", "ReviewID": "R3S7FB6N29AFWR", "Overall": "5.0", "Content": "These cameras work really well in our office.  The order was received promptly and in good condition.  We would order again, if needed.", "Date": "February 18, 2013"}, {"Title": "This is our 3rd Coolpix", "Author": "Jodi Kaufman", "ReviewID": "R23MESBZ3UKA32", "Overall": "4.0", "Content": "This looks new and improved with more pixels and higher zoom. Seems sturdier than the last one where the lens mechanism failed.", "Date": "February 17, 2013"}, {"Title": "Very solid product", "Author": "Jason ERickson", "ReviewID": "R21QEKOJTBNDTC", "Overall": "5.0", "Content": "This Camera works great for everything we need it for. It takes high quality picutres that can be used by engineers and quality inspection. Great product for the very reasonable price.", "Date": "February 13, 2013"}, {"Title": "Excellent Camera", "Author": "MrEd", "ReviewID": "R2ZP7SP0TQI0W5", "Overall": "5.0", "Content": "This is a terrific camera.  Takes great pics and has a ton of features you would expect on more expensive cameras.  I love it!!!", "Date": "February 12, 2013"}, {"Title": "Pocket", "Author": "Luchita", "ReviewID": "R1BL40KOR8PR7T", "Overall": "3.0", "Content": "It's a nice camera, easy to use and confortable. It takes good pictures and it arrived on time. I recommend it.", "Date": "February 11, 2013"}, {"Title": "handy little camera", "Author": "happy", "ReviewID": "RUYO8VKGR8RKF", "Overall": "4.0", "Content": "Used it on our vacation at the Grand Canyon's Polar Express.  Battery died out at the end of the evening, but we took a lot of pics throughout the day!", "Date": "February 10, 2013"}, {"Title": "Excellent Camera.", "Author": "S. Pandya", "ReviewID": "R2ALC5Z03Y8NC8", "Overall": "5.0", "Content": "I already have a 16 MP Sony SLR camera but wanted one camera for daily use for picnics or parties. It is just uncomfortable to carry a large camera for small events where just the high-resolution image is important not the special effects or other frills. Overall just excellent camera for the price.", "Date": "February 10, 2013"}, {"Title": "Christmas for mom", "Author": "YB", "ReviewID": "R3K0N9F9GS8F2D", "Overall": "5.0", "Content": "My mom came down for thanksgiving and her camera had a rubber bands around it holding it together. I bought this and she got it on christmas eve. She loves it and says the zoom on it is great.", "Date": "February 9, 2013"}, {"Title": "great camera", "Author": "JOE MANCUSO", "ReviewID": "R3FBJS1105PTQX", "Overall": "4.0", "Content": "we love this camera we use it for work. takes great picture. We use this camera every day. my employees take about 100 or more photos per day. so far no issue's. they like that it is small and fits in top pocket.", "Date": "February 6, 2013"}, {"Title": "Good Camera. Recommended", "Author": "Gianny Josue Villarreal Bustos", "ReviewID": "R2HEVLIAP210TH", "Overall": "5.0", "Content": "Good product, the product was shipped in accordance with the provisions.the images are of good quality, It has good size, is lightweight. Recommended", "Date": "February 4, 2013"}, {"Title": "gift for my niece", "Author": "Marci Ramsey", "ReviewID": "RV135BPHIY9P5", "Overall": "5.0", "Content": "this was a gift for my niece for Christmas, she is a Freshman in High School and has lots of dances and outings coming up. She squealed with joy when she opened it, and has been sending me pictures ever since.", "Date": "February 2, 2013"}, {"Title": "Great camara", "Author": "S. M. G.", "ReviewID": "R1EP9TSTZ3EUIL", "Overall": "5.0", "Content": "I bought this camera for my 10 year old daughter for Christmas. It is a very easy to use point and shoot camera and it takes great pictures, she loves it! She even records small movies she makes on it. The size it great too, small enough to put in your pocket. The camera take a charge off of your computer instead of batteries, which is a nice feature and the charge seems to last long. Very happy with the quality and functions this camera provides for the price!", "Date": "January 31, 2013"}, {"Title": "Fabulous!", "Author": "Terri L. Skarsten \"Terri\"", "ReviewID": "RPA9YSOC44L5A", "Overall": "5.0", "Content": "We bought a Nikon Coolpix years ago and loved it. It was recently stolen, so we bought this one. We love it. Fabulous, clear pictures. Great viewing screen. Convenient size. We're extremely happy with this Nikon Coolpix. We were so pleased with our first Nikon Coolpix, that we knew we could count on this being a great replacement.", "Date": "January 30, 2013"}, {"Title": "Easy to use and high quality", "Author": "Marilyn Brown", "ReviewID": "R3HKO0HGAKMMZ9", "Overall": "5.0", "Content": "This Coolpix is really easy to use and takes great shots. Love that I can slip it into my pocket and carry everywhere I go.", "Date": "January 30, 2013"}, {"Title": "Excellent", "Author": "Diana Stewart", "ReviewID": "R21NRR6H308TFD", "Overall": "5.0", "Content": "I ordered this for myself.  I love the quality of the pictures and it is even better that it comes in pink.  Very happy with this product.", "Date": "January 28, 2013"}, {"Title": "Cool pictures.", "Author": "Rishi Mahangi", "ReviewID": "RS4KXUO4ZX3RE", "Overall": "5.0", "Content": "This camera hits the spot,it takes very good pictures ,the zoom is very good and for 16 mp the picture is worth 1000 words.", "Date": "January 28, 2013"}, {"Title": "awsome", "Author": "tye", "ReviewID": "RKC23LEMDWGHM", "Overall": "4.0", "Content": "this little camera is as easy as it gets, just point and shoot, no s***, its true. takes really nice pictures too.", "Date": "January 28, 2013"}, {"Title": "Paid for pink , got purple", "Author": "danielle", "ReviewID": "RREWHDZ4HDX8C", "Overall": "3.0", "Content": "I could not wait to finally get my new camera in the mail , but to my surpise there in the box was a purple camera . It was suppost to be pink , but I am not picky and will enjoy it anyways no matter color . Quality is good though , takes great pics and I love the zoom .", "Date": "January 26, 2013"}, {"Title": "Excelente producto.", "Author": "Abraham Jose Padilla VE10X1004", "ReviewID": "R3DV4JMYFHLATX", "Overall": "4.0", "Content": "Este producto cumplió con las necesidades que se tenían, es de buena calidad, lo recibí en el indicado por el vendedor, recomiendo ampliamente al vendedor. Gracias por atención.", "Date": "January 22, 2013"}, {"Title": "Pictures don't turn out as good as I thought they should .", "Author": "Crowhunter", "ReviewID": "R373EHUDBR9YTH", "Overall": "3.0", "Content": "I thought it was a little to complicated to use ,I bought it for its small size but I can't get pictures to turn out as good as my old Kodak 6 Z650 .Bud Lawson", "Date": "January 20, 2013"}, {"Title": "Great camera", "Author": "achristiefan", "ReviewID": "RTG0YUV78JSNF", "Overall": "5.0", "Content": "It's little but don't let the size fool you. It's got more features than the last 2 cameras I had. I keep it in my purse to have on hand for a special moment. It's just a tad bigger than my cell phone.", "Date": "January 20, 2013"}, {"Title": "For my grandaughter", "Author": "Luciann Arends", "ReviewID": "RHAGPPS61QIT", "Overall": "5.0", "Content": "Was a Christmas present for my grandaught. She loved it and so far is working great. Was dellivered on time.", "Date": "January 18, 2013"}, {"Title": "Great Camera", "Author": "Sebastián Costa", "ReviewID": "RB6NCCHGWNYHA", "Overall": "4.0", "Content": "It will be perfect if the device has HDMI port (Maybe next time) anyway the camera takes excellent pictures and its very small (easy to transport)", "Date": "January 17, 2013"}, {"Title": "coolpix", "Author": "Freddie B.", "ReviewID": "RIVG34OBRO079", "Overall": "5.0", "Content": "I bought this camera for my dad.  He is a little behind the times and STILL does not have a decent cell phone with a decent camera on it (i.e. blackberry).  I got this for him for xmas and he loves it.  He wanted a simple-to-use camera that he can point and shoot.  He hunts a lot with his dog so it has helped him take great pictures.  He has yet to use the HD video recorder so I cannot review that feature.  Nikon is reputable brand so I went with it.", "Date": "January 16, 2013"}, {"Title": "Good solid pocket camera", "Author": "HMK", "ReviewID": "R1X3CPLFB6LH3C", "Overall": "5.0", "Content": "I've had one of these for about 5 years and have always used it with no problems...I recently purchased one for my son who is 9, for his first camera. He really likes it and seems to have learned how to use it fairly quickly!", "Date": "January 16, 2013"}, {"Title": "Want to keep forever.", "Author": "Yoshilyn", "ReviewID": "R1V13W2PI23EM5", "Overall": "5.0", "Content": "I'm no photographer, or anything, but I definitely LOVE the way this camera takes pictures. The images are crystal sharp, and does not compare at all to the last camera we had at the house. I love the brightness of it, and how great pictures come out when taken in the dark. The only thing I don't like about it is the lag the camera has after taking a picture. It takes about 5 secs so that the image can be stored into the camera and you have to wait. As  much as that bothers me, I don't mind it because the picture quality makes up for it.", "Date": "January 15, 2013"}, {"Title": "Great camera", "Author": "RetirementRocks \"CK\"", "ReviewID": "R1CI6L8KR9QTMA", "Overall": "5.0", "Content": "This camera works well, and isn't too costly!  Has good ability to find faces.The small size means I'll carry it often in my pocket.", "Date": "January 15, 2013"}, {"Title": "Good Camara", "Author": "Luis Munguia", "ReviewID": "R1CPEOHHNWLZF6", "Overall": "4.0", "Content": "This is my second Nikon I own, good camera for the price. Amazon made the purchase to be very easy and fast. The camera has every thing a point and shoot must have.", "Date": "January 14, 2013"}, {"Title": "Good camera for the price", "Author": "SCS", "ReviewID": "R1GBV4JI5RKW2C", "Overall": "4.0", "Content": "I bought this to replace an earlier model Coolpix camera.  The previous one worked very well also, but with two issues.  First, it went through batteries very quickly.  The older it got, the faster it went through them.  And secondly, the flash became inconsistent.  I don't know what is acceptable for a life span of this type of camera, but it was about 2 years on the previous one.  The price was pretty good on this, so I'm hoping to get a minimum of two years on this as well.", "Date": "January 14, 2013"}, {"Title": "excellent product", "Author": "JOY MARIA CAESAR", "ReviewID": "RQ9QQJGXWI3R9", "Overall": "5.0", "Content": "easy to use, great pictures, easy to carry, easy to connect to your PC or IPad and the quality of the product ranks supreme", "Date": "January 13, 2013"}, {"Title": "Great camera!", "Author": "Whitney Sharp", "ReviewID": "R16TM91LHKKSWK", "Overall": "5.0", "Content": "I bought this camera for my 8 year old daughter for Christmas.  She loves it!  It is a very nice, sturdy camera.  It takes great pictures and videos for the price.  It uses a rechargeable battery that is included.  It seems to last a reasonable amount of time.  We have had no problems with it, we just make sure to charge it at the end of every use.  I am very pleased with this camera and highly recommend it.", "Date": "January 12, 2013"}, {"Title": "Great camera", "Author": "El movie watcher", "ReviewID": "R6J8ZPL1K82KZ", "Overall": "5.0", "Content": "This is a great camera it does everything we need it to do and more the resolution is great very clear pictures I would def recommend getting one", "Date": "January 12, 2013"}, {"Title": "Great little camera!", "Author": "Amanda M. Texido \"Amanda\"", "ReviewID": "R2Q5KWIQJXAFPF", "Overall": "5.0", "Content": "This camera is easy to set up and use, and is the perfect size for my daughter, who loves to take pictures.  Great quality!", "Date": "January 11, 2013"}, {"Title": "A good choice.", "Author": "Toni Albert", "ReviewID": "R1Z0KLH252UXK8", "Overall": "4.0", "Content": "The recipient, my granddaughter, was thrilled with the camera.  A perfect gift for a young teen wanting to learn about photography.", "Date": "January 11, 2013"}, {"Title": "Great camera for the price", "Author": "Dengineer", "ReviewID": "RMITHRK2DENZO", "Overall": "5.0", "Content": "We were looking to replace an older, slower Nikon we owned.  We were a bit skeptical due to the price, but it turned out to be a great camera.  Quick response on turn-on, compared ot other cameras we looked at, which was it's most impressive feature.  Pictures were crisp and clear.  A fair amount of features and battery life is good.  We've had it about 3 weeks and so far, great camera for the price.", "Date": "January 11, 2013"}, {"Title": "I like it very much and would recommend it", "Author": "Hattie Y. Riddick", "ReviewID": "RGYVYW7R93ZC4", "Overall": "4.0", "Content": "It is a little smaller than I though it wold be, but it is very useful and what I really can handle.", "Date": "January 11, 2013"}, {"Title": "Very nice", "Author": "ResearchGoddess", "ReviewID": "R2LLFNEZE8GI2M", "Overall": "5.0", "Content": "Was a gift for my Mom, and she loves it.  Fits neatly in her purse.  Takes great pictures.  Video is decent.", "Date": "January 10, 2013"}, {"Title": "Great Product", "Author": "Chris Belczyk", "ReviewID": "R1K8DI2COYZ158", "Overall": "5.0", "Content": "Its working great right out of the box, and I love the look and the clear quality of the photos.", "Date": "January 10, 2013"}, {"Title": "Totally happy with this camera...", "Author": "dMarie", "ReviewID": "RM3NX08371J6E", "Overall": "5.0", "Content": "I love it's small size, easily fits in purse or pack. Easy to use, point and shoot. Easy to upload pictures and very happy with their quality. I do not regret this purchase.", "Date": "January 9, 2013"}, {"Title": "nice", "Author": "matthew kenney", "ReviewID": "R2LUMD0H6GP4ZN", "Overall": "4.0", "Content": "Its a nice clean, easy to handle and use camera. takes great pictures !! ! great product for the price.", "Date": "January 9, 2013"}, {"Title": "Nikon CoolPix S3300 Camera", "Author": "Sandra Pensyl", "ReviewID": "ROGPV137O319I", "Overall": "5.0", "Content": "This cameratakes great pictures and is easy to use and handle.  My husband, who doesn't take pictures has taken pictures with this camera and they turned out very well.", "Date": "January 9, 2013"}, {"Title": "bought as a gift for girlfriend", "Author": "Robert    B.", "ReviewID": "R39EQRYDO8OTJP", "Overall": "4.0", "Content": "small/compact with nice screenshe wanted a updated camera from her older bulky camerashe really loves the color....think she'll be happy with it over all", "Date": "January 5, 2013"}, {"Title": "Decent Nikon", "Author": "Jen B.", "ReviewID": "R1VVOZTGKMQ94T", "Overall": "4.0", "Content": "It is great Value for the price, it is really a very good point and shoot. Sleek but slow, a bit slower than usual, the shutter that isIt has a fairly good zoom, and very good picture quality", "Date": "January 4, 2013"}, {"Title": "Nice handy camera", "Author": "Michael J.", "ReviewID": "R2KFAJ1FFOWTG3", "Overall": "5.0", "Content": "Purchased as a gift for my 14 year old niece.  She likes it.  Small, handy, easy to operate.  Was able to find a matching purple case on Amazon as well, which made for a nice package.", "Date": "January 3, 2013"}, {"Title": "disappointed", "Author": "Ddad", "ReviewID": "R2WD96K61I5DUG", "Overall": "2.0", "Content": "i saw good review on this product, i dont see why after trying it for 100 pictures. pictures are not that clear. please somebody give me idea to get clear picture. iam reviewing coolpix S3300 by the way. maybe the reviews i read are for other coolpix product.", "Date": "January 3, 2013"}, {"Title": "Good camera", "Author": "xhappyx", "ReviewID": "RXTUVKJ2LO8PI", "Overall": "5.0", "Content": "Nikon Coolpix S3300 is a great camera. It is small so I can put it to my purse and it doesn't take too much space. Can carry it everywhere. Also it takes a good pictures. 6x zoom is just enough.", "Date": "January 3, 2013"}, {"Title": "Nice camera", "Author": "Kimberly Johnson \"MontanaMama\"", "ReviewID": "R1JPX0CFW1FIR6", "Overall": "4.0", "Content": "I wanted a new camera that would take great photos of my kids and their activities.  I struggle to get the photo to be crisp and clear, several times taking shaky and/or blurry photos.  It's quite possible it's how I'm taking the photo that makes them blurry or shaky-looking, so I'll have to read the book on how to use it properly.  Sturdy and fits well in my pocket.  Nikon cameras last and last.  Our last one we've had for nearly 7 years now...it was time for an upgrade.  The finished photo shows up on a handy screen at the back.  Although the screen is not large, it's not small, either.  I'd say it's just about right.", "Date": "December 31, 2012"}, {"Title": "camera", "Author": "bigisle", "ReviewID": "R1IMNDKVNSEA0J", "Overall": "5.0", "Content": "I waited till near Christmas Eve to purchase this camera!  I'm glad I waited to get this good deal!  I've used it already to 'document' my sports memorabilia....to sell online!", "Date": "December 30, 2012"}, {"Title": "Great First Camera", "Author": "twoseasons", "ReviewID": "R23DZA47K13ISD", "Overall": "5.0", "Content": "I bought the camera for my 14 year old grandson.  I liked the size of the camera and am impressed with the quality of pictures it takes.  My grandson is impressed by how easy it was for him to master the camera's functions and download his pictures into his computer.  Great first camera, but I wouldn't mind owning this one for myself.", "Date": "December 28, 2012"}, {"Title": "Poor picture quality is a deal breaker", "Author": "Stephanie", "ReviewID": "R331Q8WMJYI34W", "Overall": "2.0", "Content": "We bought this camera at another store for less than 75 dollars, and figured that for the price we would give it a try. I own a Canon Powershot Elph 310 HS and am a Canon fanatic, but I wanted to see what Nikon had to offer for a point and shoot. Having worked with a Nikon D3100 DSLR in the past, I was expecting decent results from their more affordable point and shoot line. However, after using this camera for only a day and a half, I returned it to the store and decided to get the Canon Powershot A2300 for the extra ten dollars. The main reason I returned this product was the picture quality; LOTS of noise in pictures EVEN with the flash on! It is practically impossible to take a picture with out the flash, and with the flash everything in the image is washed out. The straw that broke the camel's back was when I took a picture indoors with adequate lighting AND flash and the picture came out almost completely black:( The camera is also very slow, the time it takes for the camera to focus, take the picture etc is very long, and you are likely to miss the shot you are looking for. The build quality of the camera is attractive, and it is very small and compact, great size for your pocket or purse (one of the main reasons I purchased it)but that fact is irrelevant if your pictures all fail to turn out. Very dissapointed in this camera. For the money, the Canon is your best bet!Canon PowerShot A2300 IS 16.0 MP Digital Camera with 5x Digital Image Stabilized Zoom 28mm Wide-Angle Lens with 720p HD Video Recording (Black)", "Date": "December 28, 2012"}, {"Title": "Fine for someone not looking for fancy", "Author": "Bradley Peterson", "ReviewID": "RLGWW8WJPE9HN", "Overall": "4.0", "Content": "The camera works great, uploads pics easily and was a very nice price for someone looking for a cheaper first camera.", "Date": "December 28, 2012"}, {"Title": "Christmas gift", "Author": "Stacie Young", "ReviewID": "RSPE02HTGEG6T", "Overall": "5.0", "Content": "I bought this for my 11 year old daughter and she loves it. It is  very easy for her to use and operate.", "Date": "December 28, 2012"}, {"Title": "The camera was very very good", "Author": "Maria", "ReviewID": "R7PRPPQ2C0XWB", "Overall": "3.0", "Content": "The camera is very good, have the characteristics described in the sumary, one detail is that the bag and the memory card doesn't arrived... and the description of the product have in the package the memory card and the bag", "Date": "December 27, 2012"}, {"Title": "Great price, great camera", "Author": "seo", "ReviewID": "R24Q5I40WCJBO3", "Overall": "5.0", "Content": "Picked this up for my mom for Christmas and she loves it. It's a great little \"point and shoot\" for the money and it's very easy to use. Would very much recommend this to someone looking for a decent point and shoot for the money.", "Date": "December 27, 2012"}, {"Title": "excelente l recomiendo ampliamente", "Author": "felipe francisco troja herrera", "ReviewID": "R2FHUE3F0W8CQ9", "Overall": "5.0", "Content": "excelente producto lo recomiendo  es muy bueno toma imágenes se ven muy bien  y la calidad de los videos es muy buena  recomendado cumplidamente  muy responsables", "Date": "December 26, 2012"}, {"Title": "Muito leve e com ótima qualidade de imagem.", "Author": "danilo", "ReviewID": "R3NFPEKXEDIR17", "Overall": "4.0", "Content": "Muito leve e com ótima qualidade de imagem.Peca pela falta de opções de configuraçãoBoa qualidade de vídeo e captação de som.", "Date": "December 25, 2012"}, {"Title": "Nice camera, good price", "Author": "V. Quever \"Vern Quever\"", "ReviewID": "R2X4HLIUJ4BRZD", "Overall": "5.0", "Content": "Nice camera with good resolution, reasonable zoom lens at a good price.  Compact and easy to carry when just carrying a camera in the event that a good picture shows up.", "Date": "December 25, 2012"}, {"Title": "Satisfied Customer!! :D", "Author": "Jacob Dylan Jacob Dylan Brockway", "ReviewID": "RGC65A8AFY2NH", "Overall": "5.0", "Content": "I absolutely love it and was described exactly as they said. Buying another as a gift for my mother, perfect gift", "Date": "December 23, 2012"}, {"Title": "Camera", "Author": "Sharon", "ReviewID": "R18STC00WM4YW0", "Overall": "5.0", "Content": "Purchased this camera for my daughter's (19th) birthday and she loved it! Newly purchased so I do not know much about the performance yet but, it seems be exactly what she wanted in a camera.", "Date": "December 22, 2012"}, {"Title": "Love it", "Author": "Tammy", "ReviewID": "R1NQBYO5UV3Z6R", "Overall": "5.0", "Content": "Didn't have to wait long..Thanks for allowing me to get it fast for Christmas..Awesome as always with this company", "Date": "December 22, 2012"}, {"Title": "nice", "Author": "Andres Gutierrez", "ReviewID": "R3B6BEJWELRPI", "Overall": "5.0", "Content": "nice purchase im loving it! hoping to take awesome pics soonnice color and nice shape eitherhaving nice times", "Date": "December 20, 2012"}, {"Title": "Great Little camera", "Author": "Shoshana R Gebelmann", "ReviewID": "RAZ6NOJ48QNEZ", "Overall": "5.0", "Content": "I loved this camera, the only reason this is past tense is because I lost it at a holiday party and have ordered the next level up only because of pricing. I got this one during the Black Friday sale and was thrilled with both the stills and video quality. I highly recommend this camera, just keep track of it. I own a Nikon 5100 Digital SLR but with all the lens its allot to haul around, I would suggest wearing a lanyard to help keep track of the s3300 in a crowd.", "Date": "December 19, 2012"}, {"Title": "Nixon Coolpix", "Author": "ST \"suza\"", "ReviewID": "R3VCK3UALKE7QR", "Overall": "5.0", "Content": "Very easy to use, Picture nice & clear. , enjoying it alot taking many photo of new grand daughterreally liking this camera I would say buy it you won't be sorry", "Date": "December 19, 2012"}, {"Title": "Great camera", "Author": "ladylpn", "ReviewID": "R28K443F8VLLF3", "Overall": "5.0", "Content": "My husband spilled coffee in my old cannon that I didnt think you could beat...well I was wrong! This a Nikon is GREAT!!!", "Date": "December 18, 2012"}, {"Title": "Great camera!", "Author": "jessica strati", "ReviewID": "R34P1TRSPFKFZ3", "Overall": "5.0", "Content": "This is a very great camera! It is slim compared to the other nikons i owned. Picture look very great! It took about two hours for the battary to charge.", "Date": "December 18, 2012"}, {"Title": "Great Camera", "Author": "Kristen E.", "ReviewID": "R1T6BTPPZHDXJP", "Overall": "5.0", "Content": "Im a nikon person, I like the camera & it has all the features I need. Great price too!! Can't go wrong.", "Date": "December 18, 2012"}, {"Title": "Exactly what I wanted", "Author": "Mary F. Handley \"Mary\"", "ReviewID": "R2BJNOTP3CM214", "Overall": "5.0", "Content": "Easy to use and fits in your pocket. I won't miss lugging around my slr to the family functions!! Well worth the investment.", "Date": "December 18, 2012"}, {"Title": "incomplete item", "Author": "roxy", "ReviewID": "R1HAYUL1WBUQL4", "Overall": "4.0", "Content": "I receive the camara but the memory card that are suppose to be with it is not included, I want to receive it like tha announce said.", "Date": "December 14, 2012"}, {"Title": "GREAT!!!", "Author": "Senorpantz21", "ReviewID": "RC952Y4HGY63A", "Overall": "5.0", "Content": "You must buy this, don't hold back no matter what other reviews say.  This is top quality and is a must have if you are considering it", "Date": "December 7, 2012"}, {"Title": "Awesome camera for money", "Author": "chiefcrane", "ReviewID": "R119RRBEDQIQZD", "Overall": "5.0", "Content": "This is a great little camera for the money -  good value on the dollar - easy to handle, slips in a pocket, and easy to use the buttons - pics come out clear and bright", "Date": "December 7, 2012"}, {"Title": "Nice Camera", "Author": "B. Shockley", "ReviewID": "RABVC537X1BI5", "Overall": "4.0", "Content": "Ordered this one after my old GE camera died on me. I am amazed at the picture quality and would highly recommend this camera to anyone looking for a nice camera to take high quality pics with.", "Date": "December 6, 2012"}, {"Title": "Basically what I expected", "Author": "Jerad", "ReviewID": "R1RRFD5TJ4XCOC", "Overall": "4.0", "Content": "Good camera. My only concern was that a small section of the camera itself (bottom ledge) was visibile in the viewfinder and, thus, in pictures. This was fixed by lightly shaking the camera.....", "Date": "December 4, 2012"}, {"Title": "Nikon Coolpix S3300 16 MP Camera with 6x Zoom NIKKOR GLASS", "Author": "Blairwitch4567 \"trolqueen\"", "ReviewID": "R2UJZ1FB2Q7AWI", "Overall": "5.0", "Content": "It can be point and shoot or even in depth for someone who wants that.  I am VERY pleased with this camera!!!!!", "Date": "November 14, 2012"}, {"Title": "Nikon", "Author": "Brad Zalewski", "ReviewID": "R23EYOPCR9LTL1", "Overall": "5.0", "Content": "Love the camera! This is simple, easy to use and sold at a good price. Camera's today are basically disposable, so this is great for the price.", "Date": "November 13, 2012"}, {"Title": "he loves it!", "Author": "Rose", "ReviewID": "R2PXRKES1AYLKV", "Overall": "5.0", "Content": "Pic quality is good, video is good. color is nice. Camera was as described, we got the color we requested. happy with this product, S.O can't stop snapping pics with it so it must be what he wanted.", "Date": "November 4, 2012"}, {"Title": "Great little camera!", "Author": "Lauren Holder", "ReviewID": "R3N91YK1EME8FI", "Overall": "5.0", "Content": "Great camera! I carry it with me everywhere, and with the changing of the leaves, I'm getting great colorful, crisp photos. It's exactly what I was looking for. A small camera that takes great quality photos!", "Date": "October 25, 2012"}, {"Title": "i love this camera", "Author": "ille", "ReviewID": "RKWG3ZKN5TBVH", "Overall": "5.0", "Content": "cheap price rock solid pictures this is a steal for this products quality versus cost simple easy pictures for everyday situation in beautiful quality and contrast", "Date": "October 22, 2012"}, {"Title": "Does what I need it to do.", "Author": "Susy \"Pixiebrush\"", "ReviewID": "R30GBA5SUYSSB3", "Overall": "4.0", "Content": "Purchased this camera to replace one I purchased several years ago. Love it. Really needed the analog style lens. The only thing I wish Nikon had incorporated into this model is a touch screen. Trying to get it to focus where \"I want it too\" is not an easy task and a much needed feature for the macro shooting I will be using this camera for. Maybe next time. For the price-- this one is a keeper. Love the red color too!", "Date": "October 22, 2012"}, {"Title": "EXELENT", "Author": "JAIME", "ReviewID": "R1MW7I3XI0HQ6S", "Overall": "5.0", "Content": "EXELENT PRODUCT IS BEUTY AND EXELENT PRICE.  I recommend it. IT IS EASY TO USE THE PICTURES AND VIDEO ARE EXCELLENT", "Date": "October 18, 2012"}, {"Title": "Handy Camera", "Author": "Ann Wier Shumpert", "ReviewID": "R32UCGRO10BXOL", "Overall": "4.0", "Content": "In buying this the week before i left for a 3 wk European trip, I was concerned although i had previously owned a similar Nikon. I found this much easier to make the choice between the variety of  photo types and exposures.I was pleasantly surprised with the quality of photos that i took with near or maximum closeness i.e. the Norwegian fjords.  The photos are clear and bright.The only frustration i had was when the camera was off or asleep.  It was not instantaneous in starting.  I missed some shots i wanted when it didn't awake from the 'sleep mode' as quickly as i anticipated.i used the laniard type cloth necklace we all get fir namebadge at metings/conventions so that i was 'a tourist' in having the camera securely hanging around my neck.  I felt confident that i wouldn't drop it as i might in using only the wristlet.", "Date": "September 14, 2012"}, {"Title": "Nikon camera", "Author": "Nancy \"Buddy's Mom\"", "ReviewID": "R1AGOU8LJHIMH8", "Overall": "5.0", "Content": "Really nice camera. It takes great pictures, it is easy to use. Is is light weight and fits nicely in my purse", "Date": "September 8, 2012"}, {"Title": "Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens and 2.7-inch LCD (Silver)", "Author": "mokes2009", "ReviewID": "R1SYA82RAPM0UG", "Overall": "4.0", "Content": "The only complaint that I have about this camera is that the controls are a little slow to react.  Other than that it is light, easy to use, takes good quality photos, and a decent price. I would recommend it.", "Date": "September 6, 2012"}, {"Title": "Awesome!", "Author": "MilosMom", "ReviewID": "R99HLFBURDHIU", "Overall": "4.0", "Content": "Camera is great! Lightwieght, compact, tons of great features. A little slow on resetting to take another picture immediately after another. Still love it though!!", "Date": "September 5, 2012"}, {"Title": "Great Small Camera", "Author": "D. White \"Dew\"", "ReviewID": "R2RAHVYX0ZGOBF", "Overall": "5.0", "Content": "Purchased a Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens and 2.7-inch LCD (Silver)in August.  Easy camera to use and it takes great pictures.  Have a large Nikon Digital SLR, but wanted something I could slip in my pocket or my purse for convenience.  Camera was priced right, too.", "Date": "September 4, 2012"}, {"Title": "Best I've Had", "Author": "Ric M. Cascio", "ReviewID": "R1QQYJP85E04LH", "Overall": "5.0", "Content": "I'm not very experienced with cameras, but I've had a few and could care less about them.  This one is not only incredible in its product -- very clear pictures with gorgeous, vivid colors -- but it's very user friendly and I had no trouble transferring the photos to my computer for use with email.  NOTE:  Batteries are NOT included.  When I went to the store to buy them, and told them the price, they said they couldn't believe it.  Another great Amazon purchase.", "Date": "August 29, 2012"}, {"Title": "Great pictures", "Author": "graced", "ReviewID": "R2GM5OZ495PURR", "Overall": "5.0", "Content": "I purchased this a  month ago and am very pleased with the product.  It is very easy to use and the pictures are very clear and sharp.  I would recommend this camera highly.", "Date": "August 29, 2012"}, {"Title": "I LOVE IT!!!", "Author": "*~Missionary~*", "ReviewID": "R3J5T7HTBXGL3H", "Overall": "5.0", "Content": "The red was the perfect color, it takes nice pictures, the pictures are easy to access on your computer! I love it, it is perfect for me!!! I can't wait to use it more!!!", "Date": "August 27, 2012"}, {"Title": "coolpix", "Author": "Cookie Shimozaki", "ReviewID": "R5K8FIGWCYD73", "Overall": "5.0", "Content": "THIS CAMERA IS SUPER. IT WAS EASY TO INSTALL AND A FUN CAMERA. I USED IT A FEW TIMES AND THE PICTURES ARE CLEAR.  I HAVE NOT HAD ANY NEGATIVE PROBLEMS AND I LOVE MY NEW PICK CAMERA PLUS UNDER A 100.00 WHICH WAS A GOOD DEAL.", "Date": "August 19, 2012"}, {"Title": "Awesome", "Author": "georgina", "ReviewID": "RZJ2CFEPSG4O0", "Overall": "5.0", "Content": "Awesome camera. Sleek & easy to handle. Great color and great price especially for the quality of pictures.Great for every day use (fits in my pocket) and perfect for those special occasions.", "Date": "August 12, 2012"}, {"Title": "nikon", "Author": "amazonbuyer", "ReviewID": "R2KMP0K7EL848W", "Overall": "4.0", "Content": "I had an earlier similar model for many yrs and loved it.  Initially I upgraded and was unhappy with the quality so I landed up returning it and ordering this one.  I love it works as great as my first Nikon, is significantly cheaper and I'm hoping will last as long.", "Date": "August 6, 2012"}, {"Title": "Digital Camers", "Author": "Richard Delsigne", "ReviewID": "RY6W2DG3B7VCU", "Overall": "5.0", "Content": "Very happy with this camera, does everything we want it to and the price was right.  more words more words", "Date": "July 28, 2012"}, {"Title": "Too fragile", "Author": "Guy S. Ortmann", "ReviewID": "R6ZWQQ4858BE", "Overall": "2.0", "Content": "The camera does take nice photos. However, there is one huge problem. This was my second purchase of this item as the first one was dropped and the LCD screen shattered. I had the second one for about 2 months. Again, the LCD shattered except this time it wasn't dropped. It turns out that just a little bit of pressure in the wrong spot on the screen completely shatters the LCD and makes the camera useless by my experience. Even worse, repairs are not covered by the warranty unless it is considered a \"manufacturing\" problem. The cost of repair is basicly the same as buying a new camera. So unless you want to buy a new camera every few months, keep looking.", "Date": "August 23, 2012"}, {"Title": "Easy to use", "Author": "Dawn K. Andrus", "ReviewID": "R32VRWARNDPJHC", "Overall": "4.0", "Content": "I bought this for my 73 year old mother.  She has a hard time learning how to use electronics and was very nervous when she got it.  However, it is so easy to use that she was able to pick it up and take pictures as well as view them right away.  She loves it and uses it all the time.  This is a great camera - especially if you are looking for something easy to use.", "Date": "February 3, 2013"}, {"Title": "Don't waste your money", "Author": "Jan", "ReviewID": "R16KO24JWW45DJ", "Overall": "1.0", "Content": "I bought 2 of these for Christmas gifts in 2012.  Neither one of them is working any longer.  Great pictures while it lasted, but I expected more than 2000 pictures.  We changed SD cards, batteries, etc.  it is the camera.", "Date": "October 7, 2013"}, {"Title": "You get what you pay for", "Author": "Andrew Alexander", "ReviewID": "R11SI7BW7W6RNM", "Overall": "1.0", "Content": "I bought two of these for work to use as cheap cameras to take to site. I was looking for the cheapest camera I could find and these certainly did not disappoint my very low expectations. They are both cheap in price and in quality.The battery life is decent, but that barely makes up for the fact that they are fragile, perform badly in low light, focus slowly and pause between taking pictures. My recommendation is to save the money and get a better camera.As I said, for a $60 I was not expecting anything, and that's exactly what I got.", "Date": "July 23, 2013"}, {"Title": "perfect pictures", "Author": "D. Dalton", "ReviewID": "R3QBXF91581Y0J", "Overall": "4.0", "Content": "I pick this up as a special. It was the fourth camera I own. It was our first Nikon. It took clear pictures in low/indoor light and perfect pictures outside. It was easy to use, I really like this camera but my husband thought since it done so well we would upgrade to a better Nikon, which we did. Don't worries be happy this little camera was great!", "Date": "April 23, 2013"}, {"Title": "Amazon's Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens and 2.7-inch LCD (Silver)", "Author": "Dwranny \"Dwranny\"", "ReviewID": "R3IJPDUPE6CTHE", "Overall": "5.0", "Content": "This is a replacement for my grand daughter's identical camera which was broken by out two cat-sisters while playing near her tripod. I am proud to mention that the replacement was possible because I had placed an Amazon.com provided Square Trade Warranty. The process was very easy, quick, and convenient. BTW, I have Square Trade warranties on a great deal of items I buy and love the service and customer support system. Amazon is no \"sneeze\" either. They are fast, courteous, and professional as well.Back to the camera...the camera was priced affordably. It takes extremely clear pictures too. So far, no red-eye! Its an easy-to-use and comfortable fit in the hands. Other colors are available; however, the price increases for that option. My grand daughter is happy and so am I. Great deal and great item!", "Date": "March 2, 2013"}, {"Title": "Not bad at all", "Author": "brandy paul", "ReviewID": "R1IZUPSZ2KNFT4", "Overall": "3.0", "Content": "There are some blurry pictures but I bought this camera just to take pictures of my new baby and it has not failed me yet, her eyes come out crisp and blue and the overall color and quality is great, not to mention it is light weight and small enough to fit in a pocket. So cute I love it", "Date": "February 14, 2013"}, {"Title": "Compact, lightweight, easy to use!", "Author": "Crossfire", "ReviewID": "R1IV7844PFDG4K", "Overall": "5.0", "Content": "I've really enjoyed this camera.  I can keep it in my purse and it shoots great photos in any lighting conditions.", "Date": "February 11, 2013"}, {"Title": "Great camera for the price!", "Author": "Alaskan_Gal", "ReviewID": "R3D3EA610MH2J4", "Overall": "5.0", "Content": "I am not a \"techy\" person whatsoever so can appreciate a camera that pretty much just does what it needs to do. I can point and shoot and get a great photo. There's a lot of bells and whistles I have yet to try but will, eventually. The one thing I wish had been mentioned by Amazon is that you will need a separate memory card for photos. Again, I'm not too techy so maybe for someone a bit more in the know, they would have realized this. Me, not so much. I need stuff spelled out. The camera is capable of holding a handful of pictures in the internal memory, but if you want to take more than a few at a time, you'll need a memory card. I went to Nikon's website and was able to find recommended memory cards there.  Overall am very happy with this camera!", "Date": "February 3, 2013"}, {"Title": "I love it!!!!", "Author": "Laci", "ReviewID": "R2LAW9TYTO3Y43", "Overall": "5.0", "Content": "It is exactly what I wanted and it works very good!The usability is very easy to learn and i have it with me all the time...  :-)", "Date": "January 23, 2013"}, {"Title": "It's a Nikon.", "Author": "James Harris", "ReviewID": "R160BEBUZ7CTHI", "Overall": "4.0", "Content": "I have HIGH expectations for the camera because it is a Nikon product. I am using it for takeing a picture inventory.", "Date": "January 23, 2013"}, {"Title": "Photos aren't amazing, but it's good for the price", "Author": "PurdueGuy", "ReviewID": "R158NI4YAM9F71", "Overall": "4.0", "Content": "I'm a bit biased since I'm used to DSLR quality photos, but the photos this camera takes are ok, but not great in my book.  However, considering the price, it's a good camera for many users.", "Date": "January 22, 2013"}, {"Title": "satisfied my needs to upgrade", "Author": "Lorie Pattison", "ReviewID": "R2HW56WUCVGGMY", "Overall": "4.0", "Content": "I was ready for a new cam and upgrade from the 8 mp I owned so this camera at this price was perfect! The pics are very good, tho I am still learning the camera. I", "Date": "January 21, 2013"}, {"Title": "I love the product but I hate the idea of just adding words to meet your stupid minimum. one, two", "Author": "C. Neumann", "ReviewID": "R9UQCUWHQVQ9O", "Overall": "5.0", "Content": "I love the product but I hate the idea of just adding words to meet your stupid minimum. one, two", "Date": "January 5, 2013"}, {"Title": "good camera", "Author": "jhonatandt \"JADT\"", "ReviewID": "R1NCX10R974FT5", "Overall": "4.0", "Content": "is a basic camera and features for person who knows nothing about photography. meets the requirement in order to save time digitally unforgettable.versatile because it serves to photography and video.", "Date": "December 2, 2012"}, {"Title": "A Handy companion I needed for sometime. Great camera!", "Author": "Quiet Hut", "ReviewID": "R29BC8KTO7XQMX", "Overall": "5.0", "Content": "For years Nikon D200, D300, D90; Leica M3 have been my companion; now I have this tiny but handycamera along with my big guns when I travel. The snapshots requires this Coolpix. Great camera!", "Date": "November 22, 2012"}, {"Title": "Good camera", "Author": "Cotoa", "ReviewID": "R35TOED41BR772", "Overall": "4.0", "Content": "Nice camera for my 10 years old daughter, good for its prince, nice photos, easy to use, looks cute and good video", "Date": "October 30, 2012"}, {"Title": "Everything I would have expected", "Author": "dmr", "ReviewID": "RORDV56L4UM0T", "Overall": "5.0", "Content": "This was the first camera we purchased in about 10 years.  The advances and improvements are amazing.  Much easier to use than our old camera.", "Date": "October 25, 2012"}, {"Title": "Great product", "Author": "Pat", "ReviewID": "R3JHRSYY28PXKE", "Overall": "5.0", "Content": "I was looking for a compact and inexpensive camera to use for taking pictures of events at my work. This camera fits the bill perfectly! It is very lightweight yet sturdy, and it fits easily into my purse. It takes great pictures and is very easy to use. The large viewfinder with the \"face finder\" function helps to zero in on the people in the picture. The downloaded pictures on our website look clear and crisp. I would definitely recommend this product to others!", "Date": "October 1, 2012"}, {"Title": "Great Camera", "Author": "Thomas", "ReviewID": "R146TJUDCN7SE", "Overall": "5.0", "Content": "Very good camera.  Pictures come out in very high quality.  Very crisp images.  Perfect size camera.  Fits nicely in your pocket for on-the-go activities.  Also a video camera.  Shoots in wide screen.  Battery lasts a very long time.  Many different picture settings.", "Date": "July 26, 2012"}, {"Title": "Great Camera", "Author": "eshabluvsfood", "ReviewID": "R13F807SF45F7Y", "Overall": "5.0", "Content": "I bought this for my best friend ahd it is awesome!! She loves the color and it has a lot of cool settings its a perfect gift!!!!!", "Date": "May 29, 2012"}, {"Title": "Broke in my first week", "Author": "clp84", "ReviewID": "R3L50BNODCTKDQ", "Overall": "3.0", "Content": "The Camera is cute, light weight and takes decent photos. However, the Zoom lens in the first week got stuck and didn't take charge. Had to send it back and wait for an replacement.It wads frustrating, but Amazon solved the problem quick enough.", "Date": "September 19, 2012"}, {"Title": "I Think It's a Good Camera!", "Author": "Ellis Ivey", "ReviewID": "R3VJW8C9EXPBW4", "Overall": "3.0", "Content": "It's a good camera, but the owner's manual is written totally in a foreign language!  I think when I finally figure out all the details about the camera that I will be very satisfied.", "Date": "December 31, 2013"}, {"Title": "Wrong item, right UPC code", "Author": "A. Lindsey", "ReviewID": "R1TF0IF7N2NKXS", "Overall": "1.0", "Content": "I ordered this pink camera and received a silver one. It wasn't as if they simply grabbed the wrong item off the shelf. No. The box showed a silver camera on it. The pink camera comes in a box that shows a pink camera, the blue in a box showing a blue camera, etc. You get the idea. The problem was the UPC code for the silver camera had a new UPC sticker placed over the one printed on the box. The new sticker identified the camera as pink, even though the box shows a picture of a silver one. I returned it in exchange for another one. Guess what I got? Another silver one with a UPC sticker saying it is pink. Come on! They should know that the picture on the box corresponds to what is actually in it. So someone picks it out of the warehouse cause the label says it is pink and one of two things happen: they completely miss the fact that the picture shows a different color. Or worse, they DO realize the box shows a different color but figure that \"the UPC sticker HAS to be right, no one could have possibly put the wrong sticker on it\", and send it out anyway. Idiots! Pay attention and do your job right!", "Date": "September 12, 2013"}, {"Title": "Quality", "Author": "chrissy rice", "ReviewID": "RT96T7WRMB9KF", "Overall": "2.0", "Content": "The pictures turn out blurry if there is any movement at all. I have newborn twins, how often are they perfectly still? Not very often. Disappointed in the Nikon name at this point. Seller shipped quickly though and would do business with again.", "Date": "September 1, 2013"}, {"Title": "Handy size", "Author": "Lillian A Abrams", "ReviewID": "R2UXPVVDKFTOC3", "Overall": "1.0", "Content": "I really enjoy this camera, as it's a handy size -- doesn't take up much purse room, works fabulous for taking photos of my handmade cards to post on my blog -- and it's PINK !!", "Date": "August 9, 2013"}, {"Title": "What happened?", "Author": "Juan Herrera", "ReviewID": "R3VX1T7M7CSFN0", "Overall": "3.0", "Content": "The photo and the product you get is not the same sameThe camera is bright pink I called customer service but they said sorry but didnt replace it", "Date": "July 27, 2013"}, {"Title": "Good for the money", "Author": "C. Dohm", "ReviewID": "RRR7LO9PGFDVI", "Overall": "3.0", "Content": "It didn't do as well as my friend's camera on a recent trip to Europe. The 250 plus pictures weren't as sharp. Most of the shots had to be enhanced with Photo Gallery.", "Date": "June 27, 2013"}, {"Title": "i bought for 16 mp upgrade from my 12 mp because of the military time setting problem just like this one", "Author": "Eileen Weeks", "ReviewID": "R30HIF9U7JXHTL", "Overall": "1.0", "Content": "i bought for 16 mp upgrade from my 12 mp because of the military time setting problem just like this one,  action shots r blurry, even on  sports setting.  time stamp on photo is military time. I am not nor have I ever been in the military. I wanted my photos to say the time and date,just as it is, the hour and minute I took them, I took them, am or pm.", "Date": "June 18, 2013"}, {"Title": "a lot of power packed into such a small package", "Author": "G. McDowell", "ReviewID": "R8J2W0WYNM2AR", "Overall": "5.0", "Content": "Huge crisp bright billboard sized photos that are terrific right out of the box. The amateur novice might be overwhelmed by all the options but just play with it and have fun. Then when you need important stuff you will not be intimidated. The more you use it the more you will love it.", "Date": "June 13, 2013"}, {"Title": "Dissapointed.", "Author": "Melissa Gomez", "ReviewID": "R3POH5PRB9SPPZ", "Overall": "3.0", "Content": "I got this camera because the price was really good and it seemed to be a decent camera. For the price, it's not so bad, but I expected Much more.The auto focus works horrible, the flash is awful as well, bad quality image when there's low light, not so bad when there's no light at all but the flash. When you take a picture zoomed in, it just doesn't work at all, the quality image is BAD, and the same for video quality.The battery life is not that bad for me.The camera itself is pretty small and light.So, if you're looking for a good camera to record videos, take pictures at night, use the zoom... Do not buy this one.And I almost forgot... The camera can't take a nice picture of something in movement. And the camera is Really slow!I do regret buying this camera, I should've waited a little bit longer to buy another one; but I don't think I'll return it anyway.", "Date": "May 11, 2013"}, {"Title": "Worst camera ever!", "Author": "Joe Garcia Jr.", "ReviewID": "R2R6ALGJP00SHQ", "Overall": "1.0", "Content": "This camera is very slow to take a picture! When you also want to view the image just taken it takes so long! More than half of my pictures come out blurry and I have to keep taking them over until I get one that is acceptable.  Also the images usually come out either with too much flash and the images look basically white or they come out to dark. I have tried to change the settings but nothing works.  I have never had such problems with any other cameras that I had purchased in the past and I could not believe Nikon could make a camera that has so many problems!", "Date": "May 9, 2013"}, {"Title": "Great Gift", "Author": "Ms.Kitty333", "ReviewID": "R25JQUWLUHJBQ4", "Overall": "5.0", "Content": "I ordered this as a gift for my friend who was going on a cruise and did not have a camera.  So far, she seems to love it and says it is very easy to use.", "Date": "May 9, 2013"}, {"Title": "Now if I can just keep it out of water........I really love it.  So compact and easy to use.", "Author": "Connie H.", "ReviewID": "R2M0N9IBL31EX0", "Overall": "5.0", "Content": "Now if I can just keep it out of water...... I really love it.  So compact and easy to use.", "Date": "April 26, 2013"}, {"Title": "Yes", "Author": "Pen Name", "ReviewID": "RTCJ0FNVLA9Z0", "Overall": "5.0", "Content": "This by far is one of the best cameras made. Got it for my teenage in and it takes the best pic ever", "Date": "April 12, 2013"}, {"Title": "for all my needs:) love it", "Author": "august", "ReviewID": "R2LOC60PRAWS9D", "Overall": "5.0", "Content": "il just say for an average camera fair priced , to take pictures that you can actually see:) is like rechargable battery:) a plus lasted a full 6 hrs of charge maybe more i used it for 6 hrs first day . now  only thing il point out it the fact that i forgot to buy a memory card it holds only like 10 with out it , but still even after a card the fact that it takes pictures and no worry of the batterys every 5 snaps . ill say 5 stars  i wil be yousing it allot more ill have to repost how it goes:) il say worth the cash all the way!!! ty", "Date": "April 8, 2013"}, {"Title": "llego muy rapido", "Author": "Pablo Sozko", "ReviewID": "R18HHJX7WV21B7", "Overall": "5.0", "Content": "llego muy rapido y en el momento preciso.no tuve complicaciones ni tengo ninguna queja.Recomendado una buena camara a un costo bajo", "Date": "April 8, 2013"}, {"Title": "Totally satisfied.", "Author": "D. Jones", "ReviewID": "R2GESEHGE0Y54G", "Overall": "5.0", "Content": "For such a small camera it does a good job. The pictures are great and the video is awesome. I would recommend this to my friends.", "Date": "April 8, 2013"}, {"Title": "No memory card included", "Author": "MaggieD", "ReviewID": "R305YYSGJL9XXV", "Overall": "3.0", "Content": "I sent this camera as a gift to a person unable to get out of the house.I was shocked that it did not have a memory card included. There was an empty small plastic case for a card. Only after I visited and went out to buy a card the camera could be used.It was disappointing that it was not complete.In the end the camera takes great photos", "Date": "April 5, 2013"}, {"Title": "Great camera for the price.", "Author": "Father Emanon", "ReviewID": "R1MMFCV9TGKZCV", "Overall": "5.0", "Content": "Our Canon broke, and they wanted $125 to repair it.For a fraction of the price, we picked up this NIkon.  The picture quality blows the Canon away.  Takes great pictures inside and out, and even takes decent video.Highly recommended.", "Date": "March 18, 2013"}, {"Title": "A decent second camera", "Author": "Pop-up aficienado", "ReviewID": "R3PYTP0320ABL8", "Overall": "3.0", "Content": "I have a Nikon D600, and am trying to get really good at photography, but as a backup just for quick documentation of an image or a setting, this very small camera is handy to keep in my purse or coat.  Its size is a little problematic, especially when you are used to a full size DSLR, which is the main reason I gave it only 3 stars.", "Date": "February 17, 2013"}, {"Title": "Excelente Camara", "Author": "VE208035 JESUS ALFREDO OCHOA CUYARES", "ReviewID": "R2H838FSEVTKCV", "Overall": "5.0", "Content": "Transacción Rápida segura y confiable, buen producto y vendedor. El paquete llegó en el tiempo estimado de envío y en buen estado.", "Date": "February 9, 2013"}, {"Title": "Buena cámara", "Author": "MIGUEL", "ReviewID": "RCCLW5CCS3QTA", "Overall": "5.0", "Content": "Era justo lo que quería, el producto cumplio con mis expectativas, excelente cámara, buenas imagenes, muy buen vendedor, lo recomiendo.", "Date": "February 5, 2013"}, {"Title": "Review for coolpix", "Author": "Kathleen Gill", "ReviewID": "RPMFG4V1JAW3P", "Overall": "4.0", "Content": "Although the camera was fine, my grandson asked for it for Christmas, I found it disappointing that it didn't come with a memory card or a case.", "Date": "January 31, 2013"}, {"Title": "No SD card", "Author": "Lou", "ReviewID": "R3FE8L2SJKB2OK", "Overall": "4.0", "Content": "The camera works fine. However I was under the impression that a SD cards was included.  It wasn't, so I had to go and buy one at a cost of under $20.Regards, Lucien", "Date": "January 16, 2013"}, {"Title": "Very Nice", "Author": "Harry J. Wyant", "ReviewID": "R2YP6JBWV2KHWA", "Overall": "5.0", "Content": "Great bought for daughterin law and she just got one.  Gift certificates in future.  She wouldn't return and probably may not use iEverything as indicated in description and came promptly when ordered.  Great quick service and good quality  I like it I love it Hope this is twenty words.t but", "Date": "January 9, 2013"}, {"Title": "Did not like", "Author": "Diesel Power", "ReviewID": "R2NM7TH63IMI27", "Overall": "1.0", "Content": "I bought this camera for my wife for Charismas and when she took pictures the pictures came out blurry tested with auto focuses and still blurry….the best thing was that the return process was great and fast.", "Date": "January 3, 2013"}, {"Title": "the camera is not working properly", "Author": "July", "ReviewID": "RI9RU06QT18AS", "Overall": "1.0", "Content": "sorry the camera is not working properly, the focus is fixed, does not take pictures, how do I computer warranty?, I'm from Venezuela and here no guarantee", "Date": "January 2, 2013"}, {"Title": "Good camera", "Author": "Marissa M.", "ReviewID": "R2699X5P4O7PBP", "Overall": "4.0", "Content": "This camera is a good deal for under $100.  Takes good pictures and is easy to pick up and use immediately.  Would recommend for a beginner.", "Date": "December 30, 2012"}, {"Title": "It's a bargain", "Author": "William T.", "ReviewID": "RN4AAFBJPTV70", "Overall": "4.0", "Content": "Very appropriate accessories set, but a SD card is not present. Simple to use, but 16mp assures good quality pics.", "Date": "December 29, 2012"}, {"Title": "lcd screen in not good", "Author": "beso", "ReviewID": "R211E4EV46QBLF", "Overall": "3.0", "Content": "a picture on the Lcd screen is no good ,it seems that resulation is not big.but pictures alsow is't so good", "Date": "December 24, 2012"}, {"Title": "Poor quality, poor performance, poor batter, poor warranty coverage", "Author": "K. Weakliem \"KG\"", "ReviewID": "R1E0TDCB2KJU4", "Overall": "1.0", "Content": "This camera lasted me 10 months before it stopped working completely. I love to take pictures and would use it often and treat it with care. It has been inconsistent in its quality after the first few months, short battery life, inconsistent focusing, poor quality of pictures. The touch screen was nice but that was about it. I sent it in for the 1 year warranty repair and Nikon wanted to charge me $120 for fix it because the USB port was easy to damage, due to poor quality of design, and therefore it voided the warranty. Nikon will not repair any of it whether it is covered under warranty or not because the USB port does not work.  Nikon told me conflicting information regarding the repair and sent it back to me not repaired at all.  They have no regard to customer service either and could not bother to care that I was dissatisfied or not. I will never own a Nikon camera again after this experience!", "Date": "December 21, 2012"}, {"Title": "Nice Camera for my Kid", "Author": "Muruga Hari", "ReviewID": "R7X1XODZ0S701", "Overall": "5.0", "Content": "I purchased this camera for my daughter's birthday. She really liked it and she said it is very easy to use. She is only 8, but she loves it. It was delivered at right time. Shw wanted the purple color and she got the same. Overall my daughter is happy and I'm happy because she is happy. I too used it when we all went to South Dakota for a trip. Took lots of pictures. It wasn't that good inside the building pictures with Auto mode. I never got time to play with manual mode. For the price I paid, it is good camera.", "Date": "December 14, 2012"}, {"Title": "Just bought one", "Author": "Denni", "ReviewID": "R2ZR4BU5VG24I1", "Overall": "5.0", "Content": "I just bought this camera today- it's light, easy to use, & takes great photos! It's my 2nd small digital camera & I really like it", "Date": "December 14, 2012"}, {"Title": "Nikon Coolpix S3300 16 MP Digital Camera", "Author": "Practical Woman", "ReviewID": "R1J3M0USJ3UB23", "Overall": "3.0", "Content": "I am a Nikon girl.  This is not an expensive camera but for the money I'm sure it's as good as you can expect.", "Date": "December 5, 2012"}, {"Title": "Lens error right out of the box, will not work!", "Author": "Florence G. Bradley", "ReviewID": "R370OQBKIIVW5U", "Overall": "1.0", "Content": "Very disappointed with this camera since I just bought it today and it does not work at all!  I charged up the camera and then turned it on.  When I pressed the power button the lens extended and a blurry picture showed, followed by a lens error warning. The camera kept doing this no matter what buttons I pressed to engage it.  I also removed the battery and tried manipulating the lens to no avail! When I called customer service they asked if it was fully charged.  It was, and I even tried recharging it again but still the same problem.  Customer service with Nikon advised me to send it to them in New York.  Well I am leaving on a trip in a week so I have no time for this nonsense.  I am returning it tonight to Walmart and finding a different camera.  I have never had this happen with a brand new camera.", "Date": "May 22, 2012"}, {"Title": "Very cute and colorful camera.", "Author": "Sma57", "ReviewID": "R9RTLE4Y13BSJ", "Overall": "5.0", "Content": "My daughter loved the purple color and was delighted with the matching purple case I found on Amazon to go with it.", "Date": "February 1, 2013"}, {"Title": "Very Disappointing", "Author": "Sherri", "ReviewID": "R2NUDOKICCQH8R", "Overall": "1.0", "Content": "Extremely slow and many many blurry pictures. I would not buy this camera again. There is really nothing more to add- Spend the money for better Quality.", "Date": "January 20, 2013"}, {"Title": "Amazon's getting a little picky with the fine print!", "Author": "Randy", "ReviewID": "R2NI48MTHVV01A", "Overall": "1.0", "Content": "Nice that it was advertised as coming with a free chip - that you have to select separately.  An order packing slip would be nice also.", "Date": "December 19, 2012"}, {"Title": "very good, except the image stabilization", "Author": "suelyepp", "ReviewID": "R3P625PJG7T44C", "Overall": "3.0", "Content": "The camera has a very good resolution and a lot of modes to modify the picture, but i can't take pictures during the moviments, it not works very well.", "Date": "October 16, 2012"}, {"Title": "Sub Standard", "Author": "RJL \"RJL\"", "ReviewID": "R3FI0G7BPTSMI", "Overall": "2.0", "Content": "Nice looking camera. Controls on this are difficult to use. Pictures aren't as good as I would like. I've owned several cameras and what peeked my interest was the water proof and freeze proof option. I think it is better at that then quality of pictures and ease of use. You will be disappointed in the touch controls of this camera", "Date": "July 11, 2012"}, {"Title": "Only small fingers", "Author": "Ablejo", "ReviewID": "RJFAEJA4VFJ37", "Overall": "2.0", "Content": "The position of the button to shoot movies is right in the back corner where most people put their thumb I find myself shooting movies before I realize it. I have used 35mm cameras for 40 years and I can't change how I hold my camera now. I'm not happy with Nikon they should know better. The pictures are fine but I would not recommend.", "Date": "September 15, 2012"}, {"Title": "Great little camera", "Author": "Mrs. Owl", "ReviewID": "R3I03Q65W9F41H", "Overall": "1.0", "Content": "The camera is small, easy to take along and takes really terrific pictures.  I would give it a s a gift and feel happy knowing the gift recipient will like it as much as I do.", "Date": "September 14, 2013"}, {"Title": "lousy camera", "Author": "Basil Burrell", "ReviewID": "RAJF4C7TDN0LX", "Overall": "1.0", "Content": "I have always thought that any camera made by Nikon had to great.  This camera taught me that you can't depend on brand name to mean great product.The software that came with the S3300 was useless.  I could not delete a bad picture.  There were numerous problems with the camera.  I sent it back and don't intend to buy another Nikon product.", "Date": "June 26, 2013"}, {"Title": "I must have a lemon", "Author": "L. Nieves \"lvrofanimals\"", "ReviewID": "RXLNUDZLN2NDM", "Overall": "1.0", "Content": "First of all, I've been taking photographs for over 30 years. I have a 6mp digital cheapo that I wanted to upgrade and chose this Nikon. I have yet to get a clear picture out of this camera. First of all when you look at the scene through the display it's blurry. You have to use the telephoto/wide button to bring it into focus. then you press the shutter halfway so it'll focus it for you. What a joke 90 percent of my photos were blurry. Outdoors, indoors it didn't matter. I tried and tried, I read all the instructions I tried every setting and out of the 50 or so photos I shot I have 3 that were not blurry. I can focus faster with a single lens reflex and get perfect pictures all the time. My little 6mp camera has yet to take a blurry picture. I'm going to stick with my cheapo and do some more research but for now Nikon, deserves a big ZERO for this one.", "Date": "February 22, 2013"}, {"Title": "venezuela", "Author": "lervis zambrano", "ReviewID": "R10NA09Y6EU7G1", "Overall": "5.0", "Content": "ilike You must be over 13 in order to write reviews on Amazon. Your review will be marked as an Amazon Verified Purchase. We will email you at lervishate_422@hotmail.com as soon as your review is processed.Here are some tips for writing great reviews:  Do explain why you liked or disliked this product.  Do compare to similar products and share how long you've used this product.  Do identify specific attributes (e.g. comfort & fit of a shirt or the battery life of a camera) and whether they met your expectations.  Don't describe your seller or shipping experience (you can do that at amazon.com/feedback).  Don't include promotional content of any kind or reviews written in exchange for compensation.To see the full guidelines for writing reviews on Amazon, go here.", "Date": "February 22, 2013"}, {"Title": ";(", "Author": "Margina Leiva", "ReviewID": "R1E2YGJJAP1YKQ", "Overall": "2.0", "Content": "Not a very good camera, the screen is blury and the pictures are not very clear. not happy with this buy.", "Date": "December 7, 2012"}, {"Title": "its probably ok but i dont like the WHERE the zoom is", "Author": "nomommadrama", "ReviewID": "R1IG2N4MA0872K", "Overall": "3.0", "Content": "You zoom in and out on a turny thing, not a push up or down, and i find it more difficult to do w/ a single finger and plus, its RIGHT above the flash so my finger or another finger is constantly covering up some flash. It may be a great camera but the zooming is awkard for my hand", "Date": "May 29, 2012"}, {"Title": "Such Terrible Close Up Pictures! Return Within 3 Days", "Author": "Guang Hong", "ReviewID": "R10YBVMT71TINB", "Overall": "1.0", "Content": "I'm a ebay power seller and I take a lot of close up pictures as well as beach shots for my son.  I did not get to try the outdoor shots because the close ups are of Such Poor Quality, under room or sun light, that I returned it after just 3 days!  It completely messed up my pretty items and if my hands even shake a very tiny bit, the picture comes out totally blurry.  Does not live up to the Nikon name at all!", "Date": "April 3, 2012"}, {"Title": "dont buy this camera", "Author": "rita", "ReviewID": "R2TFLJ21HDPT23", "Overall": "1.0", "Content": "I bought this camera for a trip to Europe.  The camera's battery didnt last even for a couple of hours.  Alos, when I came home after several weeks, I couldnt return it because the window to return it closed.  Even worse, out of 150 pictures, only 90 transfered.  Amazon should be ashamed to sell this defective equipment without a 90 day return policy.  I am very upset and considering never buying from Amazon again!!!!Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens and 2.7-inch LCD (Black)", "Date": "September 7, 2012"}, {"Title": "nikon", "Author": "William E. Albart", "ReviewID": "RUN50A39UHQGY", "Overall": "4.0", "Content": "Great little camera for the money,  Had the early model of this same camera.  When swimming with it, had to replace it.", "Date": "September 2, 2012"}, {"Title": "Save your money!", "Author": "VSan", "ReviewID": "R11X4J62YSJYCX", "Overall": "1.0", "Content": "Terrible focus. Slow shutter. All images come out blurry. The flash is not right. The 6mp camera on my low budget cell is better!", "Date": "October 29, 2012"}, {"Title": "Supposedly a good camera", "Author": "Martin Weinstock", "ReviewID": "R3H79U15SWSGNV", "Overall": "4.0", "Content": "I personally don't use it but I heard of no complaints. k k k k k k k k k", "Date": "January 2, 2013"}, {"Title": ":(", "Author": "nikoloz beitrishvili", "ReviewID": "R19TWLE2ZIGGHR", "Overall": "4.0", "Content": ":P  :P :P :) :) :_) :D :D  , , ,, , , , , , , , , , , , , ,  kkf", "Date": "February 14, 2013"}, {"Title": "Junk", "Author": "Curtis Jackson", "ReviewID": "R2ROZTL0EGJW3V", "Overall": "1.0", "Content": "I took about 40 pictures. When I tryed to load them on my computer it gave up none. Not a single picture. Sent the Chinese junk back.", "Date": "December 28, 2012"}, {"Title": "This camera sucks", "Author": "cloverab", "ReviewID": "R2GEIMW1KDPOTI", "Overall": "1.0", "Content": "It takes horrible pictures and I am returning it.  I will go back to Kodak.  Don't waste your money folks.", "Date": "February 14, 2013"}], "ProductInfo": {"Price": "$105.89", "Features": "16.0 Megapixel CCD sensor\n6x Zoom-NIKKOR glass lens\n2.7-inch Bright LCD Monitor\nHD (720p) Movies", "Name": "Nikon COOLPIX S3300 16 MP Digital Camera with 6x Zoom NIKKOR Glass Lens and 2.7-inch LCD (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/41X-pPZ2FwL._SX300_.jpg", "ProductID": "B0073HSJ5Q"}}