{"Reviews": [{"Title": "VERY NICE AND GOOD CAMERA", "Author": "John Slauter \"JOHN SLAUTER\"", "ReviewID": "R28WPXONQOV60W", "Overall": "5.0", "Content": "I FOUND THIS CAMERA RECENTLY AT A PAWN SHOP YESTERDAY....I WAS A LITTLE HESITANT TO BUY IT SINCE IT HAD SUCH A LOW PRICE....SO I SPENT THE DAY LOOKING IT UP ONLINE AND RESEARCHING WHAT EVERYONE WAS SAYING ABOUT THIS CAMERA....AFTER ALL MY RESEARCHING I DID, I DECIDED THAT I SHOULD BUY IT CAUSE I WANTED A CAMERA THAT I CAN TAKE SOME GOOD PHOTOS OF MY CHILDREN FOR MY FAMILY....AFTER SPENDING ALL DAY PLAYING WITH THE EVER SO MANY OPTIONS, I'VE DECIDED THIS CAMERA WAS WELL WORTH THE $50.00 I PAID FOR IT....I WAS USING THE 15X OPTICAL ZOOM AND ZOOMING IN ON PEOPLE THAT WERE ABOUT 3/4 OF A LENGTH OF A FOOTBALL FIELD AND TAKING A PICTURE OF 2 PEOPLE AND WITH A SHAKY HAND, I TOOK THE PICTURE WITH NO BLUR CAUSE OF THE STABILIZATION BUILT IN....I PUT THE PICS ON THE COMPUTER AND WAS ABLE TO ZOOM IN ON THE PHOTO EVEN MORE....THE ONLY, I MEAN THE ONLY DOWNFALL OF THIS CAMERA FOR ME, IS THE FACT THAT IT TAKES 4 AA BATTERIES INSTEAD OF A BATTERY PACK....BUT ILL GET OVER IT SINCE IT TAKES REALLY GOOD PICS....THE VIDEO PART OF THE CAMERA QUALITY I FOUND WORKS BEST OUTSIDE, BUT STILL CAME OUT NICE INSIDE THOUGH WITH SOUND....I ADDED SOME OF MY PERSONAL PHOTOS TO GIVE YOU AN IDEA OF WHAT IT DOES....CHECK EM OUT....I HOPE THIS HELPS EVERYONE IN DECIDING ON WHETHER TO BUY OR NOT....PLEASE CLICK YES OR NO IF THIS WAS HELPFUL....THANK YOU....", "Date": "May 10, 2013"}, {"Title": "Great camera and great price", "Author": "Tootie Fruitie", "ReviewID": "R38H91LW25P45U", "Overall": "4.0", "Content": "I bought this camera for the zoom feature. At first I was very disappointed with it because every picture I would take would come out nicely on the display screen but when I uploaded them to my computer they were very blurry. So after a few phone calls to where I bought it we found out that the memory card I was using had gotten moisture in it and was causing my photos to become blurry. I bought a new memory card and the camera works amazingly! I would recommend it. Also it has tons of features to choose from and an auto feature incase you're just unsure of what kind of picture you're taking.", "Date": "June 23, 2013"}, {"Title": "Best out of 4 cameras", "Author": "Lindsey Dyess", "ReviewID": "R3BSKZ196VAN6I", "Overall": "4.0", "Content": "I bought this camera after watching reviews on Cnet and reading everything I could find about it before I decided I would buy it. I originally wanted the X500 but I didn't want to wait so I settled for the X400. It went above what I expected for the price. I took some lovely night shots (with a tripod of course) and had no problem with handheld. I don't shoot children but I could shoot a picture from a moving car and have it turn out great. I was so happy with it until I tried the macro. It was the only setting that I couldn't get my picture not to come out clear. It was always coming out blurry. So I took it back and got the Samsung WB100. I got it home only to realize that it you couldn't change the appeture (?sp) or the shutter speed just the ISO. It also started getting stuck when I would zoom out almost all the way. So it went back. I then bought a Nikon L610 only to bring it home, have it for 30 minutes and knew that I hated it. It was a great camera for a teenager who knows nothing of cameras. I will not say it is a bad camera it is just not advanced enough for me. So I went \"virtual\" shopping again. Everything I found in my price range just wasn't cutting it. So I started looking again at the GE X400 because I was really happy with it except for the macro. I searched for other peoples macro pictures and on cnet it said that the macro setting was pretty much great. So now I'm thinking it was probably operator error and I should have played with it more instead of deciding after 3 pictures it just wasn't acceptable. So I'm going back and getting this camera. I would like to get the X500 but again, I'm not patient. I don't hardly shoot macro anyway because I mainly take landscapes, street photos, and just family pictures. The quality for the price can not be beat. If you can wait, save the few bucks and order from Amazon. It is at least $20 cheaper and free shipping. I recommend this camera if you don't want to lug around a DSLR and you are a hobby photographer. The auto modes are also great so you don't have to know a ton about how to use a camera. Just wait for the little box to turn green before you shoot and pay attention to if it needs a flash or change to manual until you get a setting you don't need a flash for. I hope this helps. I am a hobby photographer who has been shooting photos for 20+ years. I have bought several digital cameras including a huge DSLR that was just to much camera for what I needed. It won't fit in your pocket but it isn't extremely heavy. Downside, it takes 4 AA batteries instead of 2 but if you use rechargeable batteries (worth it for any camera that takes AA) it doesn't eat through them. I just always carry around an extra set but that is just me.Pros: Great camera for priceOffers a lot of options including manualCons: The macro setting but that could for sure be operator error.", "Date": "June 5, 2013"}, {"Title": "Exactly what I expected", "Author": "JVE", "ReviewID": "R2UB2XCLHSYSSE", "Overall": "4.0", "Content": "This camera is exactly what I expected it to be: easy to use, it has a professional feel to it, and is loaded with the features I wanted.  Do I expect  \"professional\" result from this camera, No.  It has it's limitations, but still it takes great pictures.  In some of the reviews I read on this camera, people expected way to much from a camera in this price range. Use of common sense is lacking in some of the negative reviews.  If you want stellar results, pay 10x more, and you can have them. ( Just remember, the camera is just a tool,  it still takes creativity and skill to create great pictures!)  After 1 month of use I am still very pleased with the X400.  The battery life is great with normal usage,  especially with lithium AA's.", "Date": "September 21, 2013"}, {"Title": "it is really a nice digital camera.", "Author": "Mayobanex", "ReviewID": "R3UKY48Q53KJ1J", "Overall": "5.0", "Content": "great pictures and easy to use. I am enjoying everyday my photography hobby with this nice camera. I recommend it. :P", "Date": "September 4, 2013"}, {"Title": "GE X-400 camera", "Author": "Antonio R. Rabitti", "ReviewID": "R2C43IPPPDO7PV", "Overall": "4.0", "Content": "I am not a professional photographer, so my review is based on day by day use. It takes good pictures and, if you want to skip the automatic mode, you will be able to practice many manual controls, ideal for beginers that aim to train before go to an expensive camera.In good light conditions, as outdoor, the photo quality is very good. For indoor use, do not save the flash and you will have good pictures too.In short, the X-400 is a camera that gives you many possibilities with little money", "Date": "January 14, 2014"}, {"Title": "Nice camera", "Author": "johanns bermudez", "ReviewID": "R3U1QHAZGW2T7Q", "Overall": "5.0", "Content": "This is a really nice and cheap camera. It is better than I expected. I recoment if you need a great camera and low Price.  I enjoy it.", "Date": "October 2, 2013"}, {"Title": "A Definite step up from my old camera", "Author": "BaKaCa", "ReviewID": "R1YW68DN5FFNPI", "Overall": "5.0", "Content": "I got this as much for the Sketch feature as for its other wonderful features. I am going to start back in to the art scene and this will help a great deal with the lay out of some of the major things.I have already taken a few snapshots of some of the harleys sitting around town in sketch mode and printed them out in 8X10 to work with and its great to start from. Next its 11x14 and larger on heavy card stock for sales purposes. I'm hoping the card stock will hold the acrylic nicely.", "Date": "August 27, 2013"}, {"Title": "Taking still llife camera gets a 4 - wildlife or pets 2 stars", "Author": "Lynne R. Gregory \"Lynne\"", "ReviewID": "R1FMMV35EFP50Q", "Overall": "3.0", "Content": "This camera would get a 2 level review were this possible - depending on how you wish to use the camera the rating would be anywhere from a 2 star to a 4 star rating.If you want to just take pictures of people and buildings say on a trip - the camera is a good reasonable selection.  The camera offers to telephoto options but, the problem is that you have to go all the way to the end of the manual then click the button a second time to get to the digital which will provide the best images using the telephoto option.If you want a camera for pictures of pets or wildlife - this reviewer would recommend looking for an alternative.  This is based on several factors.  First the delay for shutter to actual take the picture is 0.9 which even taking pictures of pets results, more often than not, in a blurred image.  The second reason for the \"other alternative recommendation\" is the process of getting to the digital telephoto option.The camera manufacturer offers only a digital format of the owner's manual - a big negative when trying to work the camera - this reviewer believes if a camera needs almost 90 pages of instructions it would be a huge help to have a printed copy that can be taken with the camera.", "Date": "December 9, 2013"}, {"Title": "I really like the pictures it takes as they are sharp and the colors, it picks up, are beautiful!", "Author": "H. Anderson", "ReviewID": "R2YBAYZKWYK0IU", "Overall": "5.0", "Content": "I already have a GE camera, but I wanted to be able to take pictures of birds on the water, etc. This camera's optical zoom meets this need. The price was lower than in the stores,  so I knew it was a good buy.  This camera meets my expectations.  Guess the only negative is that the lens cover comes off too easily, and it is annoying flopping around, esp. if the wind is blowing.", "Date": "August 22, 2013"}, {"Title": "Nice camera", "Author": "R. COLE", "ReviewID": "R16UDFGLLHS9UV", "Overall": "5.0", "Content": "This was a really great deal.  I was impressed with the speed of the shipping and the quality of the product.  If I had any complaint... I hate I had to go to the Post Office to sign for this product.  It kind of takes away from why I purchase \"on line\"....I hate retail stores and lines. But for the great deal, I did not mind that much.", "Date": "December 12, 2012"}, {"Title": "Bad for video. Pic are not that good either", "Author": "Russell D. Antalosky", "ReviewID": "R1O8UXY049HA67", "Overall": "1.0", "Content": "Absolutely horrible! I wouldn't recommend it. I got it for video, and it is not good at all and the audio is terrible. (not accessible for an external mic) pics are better than video but still not good though. >:(", "Date": "November 17, 2013"}, {"Title": "bad product", "Author": "praxedes santiago", "ReviewID": "R3184LC3C7SHDO", "Overall": "1.0", "Content": "the product didn't work. it came broken the pics come out blurry and fuzzy and pic quality is very poor.", "Date": "November 11, 2012"}], "ProductInfo": {"Price": "$104.57", "Features": "Product Name: GE X400 14MP Digital Camera - Black\nProduct Number: X400\nResolution: 14 megapixel resolution\nLens: 4.9-73.5mm zoom lens\nDisplay: 2.7\" TFT LCD display", "Name": "GE X400 14MP Digital Camera - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/51R4PPCJwJL._SX300_.jpg", "ProductID": "B0084IKKX2"}}