{"Reviews": [{"Title": "Good value", "Author": "Martin", "ReviewID": "R1NZ9XJ2TF1WEO", "Overall": "5.0", "Content": "This bundle was the best value I found on the T4i -- a very good price, and contained things I actually needed.  Package arrived from Cameta camera quickly, complete and as promised. I had the older XSI previously (which I loved - gave it to my daughter).  The controls on the T4i are very similar -- nice not to have to relearn buttons, menus etc.  I have not shot videos yet but the new buttons for that appear very straightforward.  The view screen folds outward or can be returned into place, facing outward or inward / closed -- works great and great quality.  I have also been very pleased with the quality of shooting in low light conditions.  Even shooting kids basketball games (the gym lighting can be poor) even at 1800-3600 ISO the graininess is not bad at all.Also the camera bag is much bigger and deeper than I realized.  The inside main compartment can be completely custom organized for your stuff, and would probably hold two SLR's with multiple lenses and accessories.  It is fairly heavy too because of its size.  I'm sure I'll find a use for it, but I'll probably buy a smaller bag to cut down on the weight.  I don't really mind because for the price you can consider the bag and probably most of the other items \"free\" compared with just buying the camera, the 18-55 mm lens, and the memory card by themselves.", "Date": "October 3, 2012"}, {"Title": "A full professional suite for photos", "Author": "Chewie", "ReviewID": "R2T1MB0ON0TWZ2", "Overall": "5.0", "Content": "I am amazed by the electronics on the T4i.  It snaps rapid shots very quickly with the best focus I have ever experienced.  It simply takes amazing photos that truly turned my wife into a photo journalist overnight.  The camera is not heavy or too bulky so I even pack it in my rock climbing pack during some of my expeditions.  The price on Amazon meant I bought the T4i for what it would have cost me to get the T3 in a store.  Plus this kit has exactly what you need to get started.  The tripod is solid, the flash card holds plenty of photos, the bag is great, and my wife enjoys the added telephoto and wide angle lens attachments.", "Date": "January 4, 2013"}, {"Title": "resumen", "Author": "jose francisco", "ReviewID": "R2AM0WU4UR129X", "Overall": "5.0", "Content": "me gusto el producto,es justo lo que pedi y lo que decia el anuncio, es muy buena calidad y me llego a tiempo, felicitaciones  y gracias", "Date": "March 6, 2013"}, {"Title": "Awesome", "Author": "Pen Name", "ReviewID": "R2KNEW0KFWXYNV", "Overall": "5.0", "Content": "It was awsome. The best choice if you want a good camera and good stuff. I advice anyone interest for buying a camera to buy this offer without hesitation", "Date": "February 28, 2013"}, {"Title": "Love it", "Author": "Vickie", "ReviewID": "RYDF55D7D2S50", "Overall": "5.0", "Content": "I like the LCD screen that can be moved around. The videos are great also. Easy to use and takes great pictures.", "Date": "February 26, 2013"}, {"Title": "wonderful camera", "Author": "Paula Gibson", "ReviewID": "R2YNGHUZ3B72KL", "Overall": "5.0", "Content": "I love this camera it takes the best pictures..clear stable, fast...absolutely LOVE it!  Thats all I have to say...amazon makes you write too many words and need to fix this problem!!!", "Date": "January 28, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "KIT INCLUDES 13 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon EOS Rebel T4i Digital SLR Camera Body & EF-S 18-55mm IS II Lens + <2> Transcend 32GB Class10 SD Card + <3> Spare LP-E8 Battery +\n<4> Vivitar 58mm UV Glass Filter + <5> RC-6 Shutter Remote Control + <6> PD Digital SLR Camera Case +\n<7> PD 2.5x Tele & .45x Wide Lens + <8> Precision Design 58\" Tripod + <9> PD EW-60C Lens Hood +\n<10> PD 6pc Complete Cleaning Kit + <11> PD SDHC Memory Card Reader + <12> PD Memory Card Storage Wallet + <13> LCD Monitor Screen Protectors", "Name": "Canon EOS Rebel T4i Digital SLR Camera Body & EF-S 18-55mm IS II Lens with 32GB Card + Battery + Case + Tripod + Filter + Remote + Telephoto & Wide-Angle Lenses + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51gIz8CH4mL._SY300_.jpg", "ProductID": "B008R00CFS"}}