{"Reviews": [{"Title": "WG-2", "Author": "Mason.ken52", "ReviewID": "R69PSH6RSA1F4", "Overall": "5.0", "Content": "I've taken some excellent pictures with this camera. It is very rugged for such a persison camera.Ive always been a fan of Pentax and this one didn't disappoint. I haven't taken it underwater yet but im really looking forward to it.", "Date": "October 16, 2012"}, {"Title": "Well worth the money, but secure the strap tightly!", "Author": "E. Schmidt", "ReviewID": "R31V4F62Q28XG4", "Overall": "4.0", "Content": "The camera took great pictures, whether above or below water! Good contrast, and gray, vibrant colors. The only complaint is that the buckle on the web strap slipped off while snorkeling and the camera dropped like a rock (I used the web strap to tie the camera to the float nexus the string for the float looked way too flimsy to trust). Fortunately, we were only in 15 to 20 feet of water, so I was able to get it back. Otherwise a great camera and kit!", "Date": "January 21, 2014"}, {"Title": "Great camera", "Author": "bruce m o'connor", "ReviewID": "R3A7F9HDEKPI5T", "Overall": "5.0", "Content": "Great product, used it in Florida at Beach, Theme parks, & water parks.  Took great pictures and with no issues.", "Date": "September 1, 2013"}, {"Title": "Perfect", "Author": "Dennis Ohm", "ReviewID": "R13RPBMELUAT64", "Overall": "5.0", "Content": "Purchased this for our grandson and love it. He has used it in pools and the ocean. It takes great pictures both in and out of water. We've had no leakage problems so far and have used most of the accessories. Very happy with the product and its performance.", "Date": "August 27, 2013"}, {"Title": "Daughter loves it", "Author": "Russell A. Williams", "ReviewID": "R3TRPO2RX600C4", "Overall": "5.0", "Content": "Bought it for my 14 year old daughter for Christmas and she loves it.She can't wait to go under the water in our pool to see how it works.", "Date": "January 15, 2013"}, {"Title": "Good - Rugged - Waterproof Camera.", "Author": "Pat Chapman", "ReviewID": "R356VODRG7208Y", "Overall": "5.0", "Content": "Quick to ship, item as described.Rugged enough to stand up to our staff who is not always so careful with the equipment.", "Date": "January 1, 2013"}, {"Title": "Camera is great.  Accessories are ok.", "Author": "Charlie", "ReviewID": "R1TBZF5X43IB6J", "Overall": "4.0", "Content": "We love the camera.  Took it to Disney World and it survived the water park and much more.  The video camera works great for filming our kids sporting events.  Only complaint about the camera is the location of the tripod mount.  It is located near the end on the bottom instead of being centered for balance.  The little tripod that comes with the kit is useless with this camera because the weight isn't balanced.  The camera bag fits the camera but doesn't have any pockets for the extra battery or memory card.  I would recommend buying the camera and accessories separately.", "Date": "December 7, 2012"}], "ProductInfo": {"Price": "$246.95", "Features": null, "Name": "Pentax Optio WG-3 16 MP Digital Camera (Black)Premiere Bundle Includes 8GB Memory Card, Reader, Battery, Case, Tripod, Floating Wrist Strap, Screen Protectors, & Lens Cleaning Kit.", "ImgURL": "http://ecx.images-amazon.com/images/I/51QY4ArwYKL._SY300_.jpg", "ProductID": "B008PELGTC"}}