{"Reviews": [{"Title": "Great For price!", "Author": "Pen Name", "ReviewID": "R2FDMI067R51FH", "Overall": "4.0", "Content": "The device was everything and more for a great price.  The WiFi capabilities work great and the front facing LCD is great.", "Date": "December 31, 2012"}, {"Title": "Great camera", "Author": "Stefan Nieto", "ReviewID": "R9MHHB3U20C34", "Overall": "5.0", "Content": "Yo can send pictures and videos to your facebook, mail and youtube accounts right from this camera, you don't need a computer for that. Great features from this one.", "Date": "December 26, 2012"}, {"Title": "The dual screen is fantastic to take a picture while a friend or friends are not left out by being the 'camera guy'!", "Author": "Stavros \"Woma\"", "ReviewID": "R25JRQUPM5PO4T", "Overall": "5.0", "Content": "I have four digital cameras.  One is a very complex SLR with several lenses and filters, that one is great for professional use.  The other two cameras that I own are both point and shoot type, the latest one replaced an older 3mp.  The best use for the Samsung DV-300f is that you can carry it with friends and the front screen (viewfinder) allows all of us to not only be in the same picture, but also, no one is left out taking the picture. The only way do do this before was with a tripod and timer.  What a great idea, Samsung, and no skimping on the quality!", "Date": "January 21, 2013"}, {"Title": "Awesome!", "Author": "LISA LOU \"LISA MARIE\"", "ReviewID": "R3KEPC38N10FV3", "Overall": "5.0", "Content": "I really like this camera. I bought a Panasonic Lumix here on Amazon a few years ago for $100 and loved that one too but dropped it on our tile floor and the shutter wouldn't open, I was so bummed. Due to an upcoming trip I wanted to buy something more substantial, one that would zoom like 30x so I bought a $300 Nikon but it was so dang complicated and I couldn't figure out how to take a non blurry picture with the dang thing so I sold it and bought this one.I am very happy with this one..it is very easy to use. I was impressed it has wifi capabilities so that it could email a pic or two or post to facebook if the desire arose but when I tried to email one picture it was super difficult.It picked up my wifi in my house right away but typing in the email address was painstaking and then I finally got it right and then realized when she didn't get the picture that I had typed her email in wrong. SO that I wouldn't have to go through that again, I just pulled out the card and put it in the adapter and put it into my laptop and sent it like that. I also tried to download several pictures another time and had the email address right but it failed to download all pictures because it times out or something on wifi? Unsure but nonetheless it is a super cool camera and love the front view side. My besty and I had fun taking pics of ourselves together when we visited eachother at Disneyworld and we are 40!  I realized though that we could not incorporate Goofy in the picture because my arms aren't long enough to get far enough away to get my face, goofy's head with hat and my friend's face. So a walker by was nice enough to offer to take it for me. At that time we were eating at Chef Mickey's so an attendant wasn't walking around with him.Great camera at a great price!!!  I think the touchscreen one would have been better for typing in the email addresses so if you want it for that, and to post on FB and stuff I highly recommend spending a little more and getting that one.It is perfect for me though. I like it!!!", "Date": "April 12, 2013"}, {"Title": "Love this Camera!", "Author": "Mrs. Ramirez", "ReviewID": "R17POWIIJCDQ2A", "Overall": "5.0", "Content": "I have been looking for a good camera for a while and finally found it. The front LCD screen works amazingly and all of my pictures come out  great!", "Date": "January 17, 2013"}, {"Title": "Awesome Camera!!", "Author": "bab71", "ReviewID": "R38YGYXOI4U16J", "Overall": "5.0", "Content": "Anyone looking for a camera should look at this one!!  The front viewer is really cool.  The pictures are of really good quality!!  Recommend!!", "Date": "January 11, 2013"}, {"Title": "I LOVE IT!", "Author": "KPB", "ReviewID": "RE3X9NWOH253N", "Overall": "5.0", "Content": "The seller deliver it  perfectly and right on time. This camera is sooooo cool and amazing! Great and affordable.  It has a lot of features that everyone will love. If you are planning to have a very nice and affordable gift for any occasion,  have this, you surely  won't regret. :-)", "Date": "December 18, 2012"}, {"Title": "This is a great point and shooter with minor issues.", "Author": "AmznRoxs", "ReviewID": "R1LA11VJAV9QUQ", "Overall": "5.0", "Content": "One of the main reasons for getting this camera was the built in WiFi and dual view features. The WiFi isn't perfect but does the job. Including storing multiple WiFi connections so you don't have to re-enter a network key every time you want to upload a pic. What it doesn't do is upload video or more than 5 pics at a time. If you're not broadcasting your WiFi the camera may not connect.  At least I couldn't get mine too. Other than the two main reasons it does offer some other great built in features that will keep you interested and busy wanting to try them out. Works great in low light, has a fill in flash, and slow sync to name a few things. One disappointing thing was no way to manually set the f-stop for depth-of-field adjustments. I do like being able to send email, use Microsoft's Skydrive ( kind of like DropBox), upload to some photo sharing sites and social networks.The front facing screen makes it fun to do self portraits because of no more guessing about your position on the screen. Less retakes and more satisfaction... Can I get a What What! Hope this review helped.", "Date": "April 4, 2013"}, {"Title": "Great camera!", "Author": "I. Fernandez \"Just A Girl\"", "ReviewID": "RZNN47MVAXLGK", "Overall": "5.0", "Content": "Love this camera!  The wifi feature works great!  Really enjoy the front view for those self- portraits.  Size/weight of camera is great.", "Date": "March 4, 2013"}, {"Title": "FAULTY BATTERY", "Author": "Grace H.", "ReviewID": "R1FE20IH4A4H1", "Overall": "3.0", "Content": "Camera's fine BUT the battery dies within 15 minutes after a FULL CHARGE.This shouldn't happen to a new camera.I was in CHINA on vacation when this kept happening.I need to return this camera for a working one.How do I do this?", "Date": "April 3, 2013"}, {"Title": "Love it", "Author": "n/a", "ReviewID": "R12ZXRWUK8I3UA", "Overall": "5.0", "Content": "A great camera.  Excellent photos, has wi fi and I can send the photos directly to my friends and family.  The quality of the photos is excellent.  I would highly recommend it!!", "Date": "January 24, 2013"}, {"Title": "Cool Camera", "Author": "Daniel Aracena", "ReviewID": "R1TOH7XV99N34O", "Overall": "3.0", "Content": "Great size, cool features, like forward facing screen and lots of pic edits.  Although it did not come with a usb cable", "Date": "January 22, 2013"}, {"Title": "Front display can't be used for self portrait with timer. Soft image with full zoom, iphone camera could be better than this", "Author": "Da Xiong", "ReviewID": "R2MO8HKOTG76FP", "Overall": "2.0", "Content": "Once I activate the timer for self portrait, the front display changes to countdown screen & I can't see myself from it. Therefore I can't compose self portrait neither with tripod nor camera extender like xshot. Returning it as I don't have very long arm. The image is not sharp especially at full zoom.", "Date": "May 31, 2013"}, {"Title": "NICE", "Author": "Barbara Jane Gonzalez", "ReviewID": "RB2DA1NCSGKTK", "Overall": "4.0", "Content": "I so wish that owners manuals would be included. I am \"old school\"..I like to hold a book/manual in my hands....", "Date": "May 26, 2013"}, {"Title": "awesome camera", "Author": "mary charles", "ReviewID": "R2BAH1N5M1SE0X", "Overall": "5.0", "Content": "I love this camera. Especially the front screen and being able to download pics right away to facebook. Has many other great features also", "Date": "May 24, 2013"}, {"Title": "Awesome - Excellent value for the price", "Author": "Jeannine Brouillet", "ReviewID": "R1ML7VDJE09Y49", "Overall": "5.0", "Content": "I am so impressed with this camera and everything it can do.  I love the upload directly to socia media sites and the cloud storage.  The only thing is trying to sign in on the small screen and arrowing around a keyboard.  Once that is complete you only need do that once.  The other very nice feature that I did not notice in the description is the album feature which separates events.  I would suggest this to anyone that wants a lot of camera packed into one.  I haven't tried the front facing yet.", "Date": "May 3, 2013"}, {"Title": "Excellent product", "Author": "Maxine", "ReviewID": "R1NJZY9S8NVFH7", "Overall": "5.0", "Content": "I love this camera.  It is user friendly; it is compact and therefore good for travel.  I especially love how easy it is to take a self-portrait.  I highly recommend this product.", "Date": "April 26, 2013"}, {"Title": "Great point-and-shoot with a lot of features", "Author": "Alex Kofsky", "ReviewID": "R2DFG9YBRO2YN4", "Overall": "5.0", "Content": "Definitely the best camera I've ever used in this price range. TONS of features on this little guy: wi-fi, dual screen, HD video recording, and lots more. It's tiny, lightweight, and gets the job done for sure!", "Date": "October 24, 2013"}, {"Title": "Its a good camera", "Author": "jen", "ReviewID": "RVRE9P3GW5E40", "Overall": "3.0", "Content": "I like this camera.  It takes nice pics and has some cool features..like the cartoon that plays on the front so you can get the kiddies to actually look at the lens..some nice editing too.  This has a wifi capability that sounds great but the truth is you have to be somewhere where these is wifi enabled in order to upload or carry a wireless router with you...sooooo...you end up coming home and sitting in front of your computer to upload them.  kinda inconvenient.  in any event, the picture quality is good and the speed is fast and its better than my old camera.  I probably would have purchased the model without wifi for less if i had realized.", "Date": "September 24, 2013"}, {"Title": "Why can't I find a good point and shoot?", "Author": "Daniel J Pisko Jr", "ReviewID": "R1HK9Y9UPGLBUG", "Overall": "2.0", "Content": "I love Samsung everything except the cameras.  I go through point and shoots like water.  I can't find one that consistently takes a sharp picture.  This one is no exception.  Sometimes they are brilliant and sometimes out of focus.  I do construction inspections so the lighting is usually the same for nearly every picture I take.", "Date": "September 20, 2013"}, {"Title": "easy to use", "Author": "Carlos adrian villasana", "ReviewID": "R1W21EL6DZKGWW", "Overall": "5.0", "Content": "compact, durabily, easy to use, lithium ion battery is the best choice, a lot of apps in order to make the pictures social, maybe it looks better if it's has not a lot of it...", "Date": "August 31, 2013"}, {"Title": "having fun with it", "Author": "Heynonnymoose", "ReviewID": "R2C07HQ5A5EI5Z", "Overall": "5.0", "Content": "Although I'm used to 35mm slrs, this little package does a lot of things I couldn't have with those other cameras. There's also the convenience of emailing from the camera through WiFi,  and then sending this pictures to CVS through an app on my tablet, also a Samsung. Some of the things it does are in camera editing,  frames, filters, you can even shoot black and white, which is my favorite. It also lets you see yourself via a front screen at any time with the push of a button.  The drawback is that with so many settings it's awkward to operate, and too small for my big hands. But until I can afford something different,  I'm enjoying this neat little camera.", "Date": "August 1, 2013"}, {"Title": "NICE CAMERA BUT NOT AS THEY ADVERTISE IT", "Author": "JERRY FARAJALLA", "ReviewID": "RETBUK3SWFJJ9", "Overall": "3.0", "Content": "I Order this Camera because they said it is a dual view but when i recevied there is non of that dual view thing the company told me to activate something but checking the camera and the manual there is nothing so I have to return it back the next day.", "Date": "June 23, 2013"}, {"Title": "Excellent", "Author": "Sebastian Mancilla", "ReviewID": "R3DPWND1ADHP1E", "Overall": "5.0", "Content": "very good product, which includes all the applications described, and easy handling. Very sharp image at a low cost. Excellent.", "Date": "April 24, 2013"}, {"Title": "amazing camera!", "Author": "Addey Qasim Al-shboul", "ReviewID": "R2P5TW7CIB74BR", "Overall": "5.0", "Content": "amazing product yet again! great job samsung!! It does everything i want it too!!! i highly recommend this product especially for the price its going for", "Date": "April 21, 2013"}, {"Title": "This camera is awesome!", "Author": "Joy", "ReviewID": "R1OZJ6N06TM3II", "Overall": "5.0", "Content": "I would recommend this camera to any and everyone! What sold me was the dual view and the fact that it has wifi capability is just a bonus!", "Date": "April 4, 2013"}, {"Title": "camera coded", "Author": "Kathy maxwell", "ReviewID": "R1XP7DXJRYMK3F", "Overall": "5.0", "Content": "I love the Samsung smart camera. It has WI fi and an excellent focus. Best deal I've made this year.", "Date": "March 29, 2013"}, {"Title": "Love this", "Author": "cindy Dolce", "ReviewID": "R3C1YK2HISR2Z5", "Overall": "5.0", "Content": "I love this camera Im in love with the dual view and the fact that its has wifi so I can share my pics with all my friends", "Date": "March 25, 2013"}, {"Title": "Its", "Author": "foxyenid", "ReviewID": "R1JLXTW0DDMQ2Y", "Overall": "5.0", "Content": "I love my new camera,it has so many features.it will take some time to understand.but it's amazing.especially the cartoon animation..we got a awesome camera.thank you Amazon you are one of a kind..samsung you are great as well.", "Date": "February 21, 2013"}, {"Title": "Nice camara", "Author": "HARRY PETERS", "ReviewID": "R1XO9E2HMNALJO", "Overall": "5.0", "Content": "The first glance ,I like the look of it and so far it is impressive. On further use, it is a bit complicated, but soon got used to it. Love it after a few weeks use.Cobb", "Date": "July 18, 2013"}, {"Title": "love this camera", "Author": "annie", "ReviewID": "R10RN9JTMQVKFW", "Overall": "5.0", "Content": "what a great camera  This the best camera I have I have ever had ,...Great picture ez to use love it !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "July 6, 2013"}, {"Title": "SAMSUNG DIGITAL CAMERA LENS ON FRONT AND BACK", "Author": "PERKY", "ReviewID": "R6GJSUNZ4NEMR", "Overall": "5.0", "Content": "This camera was purchased as a Christmas present for a teenager.  It should be a great item as they like to take pictures of themselves and others together.Samsung DV300F Dual View Smart Camera - Blue (EC-DV300FBPUUS)", "Date": "November 10, 2012"}, {"Title": "BAIT and SWITCH", "Author": "MaxxM", "ReviewID": "R3S5VH4QXLJRJA", "Overall": "1.0", "Content": "While the camera itself may be good, he product description on Amazon states 'Dual view Smart camera - silver/red DV300FBPRUS sold by Beach Camera does not have the stated front 1.5\" LCD as stipulated in the product description. I feel highly offended and will be speaking to Amazon.MHM", "Date": "April 7, 2013"}, {"Title": "Sweet & Smart Camera", "Author": "R. Crawford \"rbtjc\"", "ReviewID": "R29EFXJCBQ5M60", "Overall": "5.0", "Content": "From the dual LCD to the built in Wi-Fi, this compact camera will meet your needs! Small enough to fit in your shirt pocket, it will be great for road trips or casual get togethers. I really like the PC auto back up feature. A few more pages of instructions would have been helpful, but getting to the different features is not a problem. The only thing I didn't care for was the color - the red is more of a dull dark pink, but I can live with it,", "Date": "February 13, 2013"}, {"Title": "This camera is soooo cool!", "Author": "R. Harshbarger \"RTFM Stupid!\"", "ReviewID": "R1X8T1OGYOT53W", "Overall": "5.0", "Content": "This camera makes it really easy to make sure you get that self-shot of you and Angelina Jolie properly framed and with its built in wi-fi, all your friends can be, nearly instantly, jealous of your meeting as it goes onto your fave social networking sites.", "Date": "August 14, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "SMART camera - Shoot, Store, Share\nInstantly Share (Wi-Fi)\nInstantly share stunning photos of you with 2View (1.5\" Front LCD)\nEasy to Use App Style Menu\nFilter effect", "Name": "Samsung DV300F 16 MP 5X Wi-Fi Dual View Digital Camera - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41z4nJD1kiL._SY300_.jpg", "ProductID": "B008RCW452"}}