{"Reviews": [{"Title": "Pleasantly Surprised!", "Author": "TD Swanbeck \"Average-Shopper\"", "ReviewID": "R3RBW6PZQ8XSII", "Overall": "4.0", "Content": "After reading poor reviews on other Vivitar point-n-shoot cameras, I was pleasantly surprised with this red camera my mom got for Christmas from my dad - so pleased in fact that my mom got ME one in white for Christmas! Nice 3.0\" touch screen is easy on the eyes - light meter lets you know when flash is needed, a variety of different light settings (even night vision!) and a nice anti-shake feature that's always active. Takes standard VGA video but will shoot 7MP HD photos (16:9 ratio) for panoramic shots like an extended family or the Grand Canyon. It also has an external speaker so that when you play back your videos you can hear the sound. Still picture quality is very good for a simple point and shoot camera. I wish it would keep the flash selection on automatic - but this may be user error, and not the camera's fault. I had a Kodak Easyshare camera(9.1 MP HD, no external speaker), and consider this one a trade-up. This camera came out August 2012 and I had not seen a review of it so far - so here's one. Happy shooting!", "Date": "December 29, 2012"}, {"Title": "Seems to work well", "Author": "avidreader", "ReviewID": "R3CB7T1JHI5LFY", "Overall": "4.0", "Content": "So far I am quite satisfied. I haven't tried to transfer pictures to my computer yet. I think the advertising material should specify that it requires a sandisk to function.", "Date": "September 23, 2013"}, {"Title": "Avoid this Camera", "Author": "Aaron Adair", "ReviewID": "R1YRUDI3W043R5", "Overall": "1.0", "Content": "Touch screen was near inoperable and beyond frustrating. The photo quality worse than a cellphone camera. Blurry in full light, blurry in low light. This camera just can't take a good photo.", "Date": "August 30, 2013"}, {"Title": "Worst camera imaginable", "Author": "Daniel", "ReviewID": "R24H5B7JVX8BEW", "Overall": "1.0", "Content": "This camera is a joke.  It constantly freezes and loses all the pictures.  I've lost close to a hundred pictures.  The auto flash will not stay on, it always reverts to manual flash so when you need the flash it won't be there when you take the picture. It wont take videos, it just freezes and the battery needs to be removed to reset it.  I've contacted tech support and there suggestions did not help at all.  Maybe this camera is a lemon, but I think it was designed to be a touchscreen camera with the most horrendous software and antiquated technology available.", "Date": "August 25, 2013"}, {"Title": "LOVE IT", "Author": "Penny", "ReviewID": "R967DWGGX77C8", "Overall": "5.0", "Content": "I received this camera as a birthday present and I really like it. It is easy to operate and it takes great pictures. Good product for the price.", "Date": "August 15, 2013"}, {"Title": "Not thrilled...", "Author": "Joe Anderson", "ReviewID": "R2VJVZQG737GWH", "Overall": "2.0", "Content": "Although it was not expensive, I expected better. Photos are fuzzy and the touch screen is a pain. I bought it because you can charge it, instead of constantly purchasing batteries. I have been told since that most cameras today share that feature.", "Date": "August 10, 2013"}, {"Title": "Memory Card", "Author": "Terri Lukens", "ReviewID": "RGZG3THEURNGP", "Overall": "3.0", "Content": "I think it would have been nice if a memory card was included. Even a small one would have been appreciated.", "Date": "December 14, 2013"}], "ProductInfo": {"Price": "$79.99", "Features": "Full 3 inch touch screen\nGreat Anti-Shake feature\nSmile detection will take a photo when someone smiles", "Name": "Vivitar 16MP Digital Camera - Red (VS130)", "ImgURL": "http://ecx.images-amazon.com/images/I/41oU-zGOm1L._SY300_.jpg", "ProductID": "B008O4824A"}}