{"Reviews": [{"Title": "LOVE, LOVE, LOVE this camera!!!!!!!", "Author": "Connie L. Dameshek", "ReviewID": "R24YFHAJAVLLJJ", "Overall": "5.0", "Content": "My husband and I just returned from a trip to Roatan and this was the ONLY camera that I used, both above and below water.  I am THRILLED with the amazing quality of the underwater pictures that I took.  Not only did the pictures look fantastic, but I was able to take video as well!  I have always wanted an underwater camera for our snorkeling trips, but was always hesitant to spend the money on one.  All I can say now is, I don't regret for one minute spending the money on this camera!  I loved it so much that I'm getting ready to buy another for a friend as her wedding shower gift!  I have read some people complaining about the bulkiness of the camera and the location of the buttons which, once I familiarized myself with the location of everything, I didn't have any problem at all.  The only thing that happened on occasion was I forgot to put the camera back into Auto mode from Underwater mode when taking land shots.  The pics still came out, just the color clarity was a little off.  I thought for all the items included in this package, it was a fantastic deal.  The extra battery was VERY handy and I loved the float strap so I didn't have to worry about the camera sinking if it slipped out of my hands.  Overall a very good deal!!  I would HIGHLY recommend this camera to anyone!", "Date": "September 24, 2013"}, {"Title": "camera is okay - left us worried after first underwater use", "Author": "K. Carter \"iam1kt\"", "ReviewID": "R1QT22DERFQYB8", "Overall": "3.0", "Content": "Admittedly, our family is rough on cameras.  It's the main reason we purchased this camera because of the reviews stating its durability, shock resistance, and ability to stand up to beach use.Our first use in Hawaii on the beach left us worried, though.  We used it to take pictures underwater and it worked fine.  However, after we turned it off and back on again, the screen was fogged up and stuck in underwater mode - none of the menu buttons would work.  It wasn't until two days later when we tried taking more photos, that the menu worked again and the screen was clear.This camera doesn't take very sharp photos and action shots must be timed perfectly.  We've used other Canon cameras in the past and have been very satisfied, but this one didn't measure up to our expectations.The package of items it comes with are okay.", "Date": "May 23, 2013"}, {"Title": "Better then expected!", "Author": "Khan", "ReviewID": "RFODB15OHPHO4", "Overall": "4.0", "Content": "I have probably spent 20 hours searching the internet for the best value on Waterproof and dustproof camera's. After selecting the Cannon D20 I was impressed with how well it filmed both in and out of water while snorkling in the Red Sea! The photo mode is good and takes great pictures if your just trying to capture basic home use photo's. If you are looking for more features, better zoom and smaller size you better stick with another camera and just avoid the water. Overall, great buy. seller was quick and kit was as described!", "Date": "April 2, 2013"}, {"Title": "Great underwater camera for snorkeling!!", "Author": "Tamra Bingham", "ReviewID": "RRAPR7S51OZXY", "Overall": "5.0", "Content": "It's a great camera.  We took it to Grand Cayman and it took great underwater pictures.The backup battery is a little weak.", "Date": "January 3, 2013"}, {"Title": "No regrets", "Author": "Happy honeymooner", "ReviewID": "RBFUCS6POF8Q5", "Overall": "5.0", "Content": "Bought this camera for a 2 week honeymoon  to Mexico and it is amazing.  Not having to worry about a camera getting too hot in the sun or sand on the lens is the first thing that was great.  But the underwater photos.....amazing.  First few days I took underwater photos in the pool only and the pictures were clear and colors very vibrant.  Then I took it on a 4 hour snorkeling excursion and it performed the same.  The pictures are amazing.  Friends thought I took pictures thru a fish tank thats how clear they were.  this camera allowed me to capture every moment I wanted of the honeymoon.  And the outdoor or indoor photos also come out great.  I went back and forth before purchasing between several cameras including the panasonic lumix ts3/ts4 and I am thrilled I stuck with a cannon.  I'm a cannon user for life.", "Date": "July 31, 2012"}, {"Title": "Kit is incomplete.", "Author": "Abhijeet", "ReviewID": "R2663HCPIN2GHH", "Overall": "3.0", "Content": "camera is good, but Battery charger is missing in the kit.Canon PowerShot D20 Shock & Waterproof GPS Digital Camera with 32GB Card + Case + Battery + Tripod + Float Strap + Accessory Kit", "Date": "June 16, 2012"}], "ProductInfo": {"Price": "$329.95", "Features": "KIT INCLUDES 11 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon PowerShot D20 Shock & Waterproof GPS Digital Camera + <2> Transcend 32GB Class10 SD Card +\n<3> Spare NB-6L Battery + <4> Vivitar Floating Camera Strap + <5> Digital Camera Pouch Case +\n<6> PD-T14 Flexible Camera Tripod + <7> PD SDHC Memory Card Reader + <8> PD 5pc Complete Cleaning Kit +\n<9> PD Memory Card Storage Wallet + <10> LCD Monitor Screen Protectors + <11> Image Recovery Software", "Name": "Canon PowerShot D20 Shock & Waterproof GPS Digital Camera with 32GB Card + Case + Battery + Tripod + Float Strap + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51esjJO71VL._SY300_.jpg", "ProductID": "B00804REG6"}}