{"Reviews": [{"Title": "This is a great try from Samsung but still has room for improvements.", "Author": "Shufeng Wang", "ReviewID": "R31O9NF9Z8NAJ2", "Overall": "5.0", "Content": "I bought this piece for my wife and took it to Italy together with my 5D3. It is the first time I put this camera in a real trip, so I do feel a lot difference and record them here when the memory is still fresh. Sorry I am not English native..With mobile phone, you can take picture anywhere and edit and share instantly. However, there is one thing the smartphone can not and will never do, ZOOM. This piece is a smartphone with superzoom lens, 21X zoom, which is nearly a telescope when you wanna record sth far. This feature is very useful when you get chance to try it. This is the first reason that I think the camera is worth to buy. The tele-zoom lens is the only value for small digital cameras, or, you can use your mobile instead..The Android system. When we all enjoy the instant photo taking and sharing, and keep online with friends, why we still stay with a classic camera, a smartphone, and a computer to connect the camera and phone? They are all in one this time, and compact. All setups are as simple as your mobile. Here are what I do with the system: added art effects in real time when taking pictures; record a nice restaurant by taking a picture with GPS tag, and later load this position from the photo into Google map so we can follow the map and go back, all happened by just touching the screen few times; add effects and share photo with friends through IMs and instagram; playing games; using GPS; browsing web; my kid compose the photos and videos into a video stream with music, just on the camera, a lot fun.. The high end hardware. It is true that Nikon do have a android model of digital camera. However, it is small screen, weak CPU, which means data-intense processing such as photo and video editing may be not so fluent. To me, it is more like altering an interface instead of changing an operating system. The advanced hardware is definitely a must, if you want an android camera.. The power charging micro-usb connector. It is true that is micro-usb connector is an important thing to me. This means when you have a lot to shot during the day, including long videos, you will not worry about the power supply any more. This is because you can carry a portable power supply (a large battery, such as my 6000mah Philips) to charge the camera at any time, with a standard usb cable. This external battery will also benefit all your android and apple devices. So for the days in Italy, I never worry about power of this camera. However, I am not saying the battery of this camera is weak, it is enough. For the whole week, there is only one day I definitely I have to charge the camera on our way. When we went back to our hotel that day, the power become 100%, fully charged! I believe you have never had this experience with other cameras..Huge screen with sharp image and instant touching response. very good experience ever to a camera..3G network is a good design, which makes you connected all the time. I mean, in my country, not Italy..Voice phone is not designed and not necessary for this camera, since this Galaxy Camera will shut down after 2hrs standby to save energy as a normal camera. So it will not work as a real phone. Use software to call your friends, such as skype.The improvements needed:1. the lens quality. Actually, it is a good lens for recording and sharing. I am just expecting the lens could be better when comparing to Nikon, canon, Sony(Zeiss) and Panasonic(Leica)2. The ccd is still too small, the size of this Galaxy should have enough room for larger sensor.I am not sure whether I am too strict to this camera since I also have a 5D3. :-)My recommendation is that this camera is worth to buy if your lifestyle is shoot & share, and enjoy the smart system.  If you can live with the image quality of you mobile phone, then this camera is much better than that.A final story, I also took a Sony TX-9 camera for my wife, since she never believe Samsung could build decent cameras! But finally, she never touched the Sony during the whole trip.Thanks for your time.", "Date": "February 19, 2013"}, {"Title": "great concept, but needs work", "Author": "Tom", "ReviewID": "R37894WVFML5JL", "Overall": "2.0", "Content": "Android on a camera is a great idea, and the functionality you get from all those apps is great, as is the fact that images can get automatically uploaded to photo sharing sites.Unfortunately, Samsung's implementation is beset by numerous problems.Foremost, the image quality you get from this camera is comparable to Samsung's $100 low-end digital cameras (e.g., the ST76). That's still better than any cell phone, but given the price, they should have done better.The camera user interface on the phone is usable but somewhat immature and gimmicky. One of the most annoying things about it something seemingly small: you can't tell where you end up when you turn on the camera; after a long wait, you end up in the photo app by default, which means the lens extends, at other times, you just end up in whatever app you were before. This means you constantly have the lens pushing into your hand. Furthermore, many Android apps don't expect anything to happen when they initialize the camera, so they do it frequently, meaning in some apps, the lens retracts and extends frequently.Build quality is poor. The shutter button fell off after a couple of weeks of use. And trying to get support from Samsung is nearly hopeless: first, they referred me to a couple of TV repair places, then they decided the only way to replace the shutter button (probably a $0.10 part that just needs to be pushed back in) is to send in the camera. Camera companies like Canon and Nikon have parts and repair centers available all over the world; with a Samsung camera, if anything breaks during a trip, you're left without a camera.My recommendation: unless you really need Android in a camera right now, wait for the next generation of Android cameras. And I probably won't buy another camera from Samsung; their support may be fine for TVs and cell phones, but cameras are mechanically more complex and are used a lot during travel, and they simply don't have the necessary support for it.", "Date": "March 2, 2013"}, {"Title": "So-So Picture Quality, Great Cnnectivity", "Author": "Thomas Bernstein", "ReviewID": "R2WN5MYTTW7QAD", "Overall": "4.0", "Content": "I bought this camera because I was really attracted to the idea of being able to edit and share my pictures without having to upload them to my computer. This camera certainly does that, and does it very very well. I won't go into more detail on that as it is identical in that regard to any smartphone. It also has superb build quality, and feels very solid (though it is also heavy, and probably wouldn't survive much of a fall). The screen on the back is also really great, boasting a bright 720P display that is actually superior to the one on the Galaxy SIII. But as an actual camera, however, it really disappoints. Especially for the price!The biggest reason someone buys a dedicated camera as opposed to using their smartphone's is for the superior image quality, and while this camera's PQ is definitely better than any smartphone's, it's not by much. The biggest issue is its problem with imaging fine detail, which is very noticeable if you crop the picture or print it in any size larger than 8x10. It is especially noticeable if you compare it with a different point and shoot camera like I did (a much cheaper Sony HX20V). It also had issues with capturing accurate colors and tended to have an unnatural cool tint to its pictures. The zoom, despite being a major selling point, was barely even usable past 15X, causing pics to lose a significant amount of detail and look like they were taken with an old flip phone camera (the Sony, on the other hand, gave crisp and beautiful shots at its max 20X zoom). The reason for this is likely a combination of slow shutter speed and poor image stabilization, which brings me to another gripe about the camera: It's slow! More than anything, it is very slow to turn on, taking several seconds (and even longer if it turns on in the Android home screen, which it sometimes does), which can be the difference of capturing that perfect surprise photo or just missing it. Most dedicated point and shoots, by comparison, take just about a second to power on. If the Galaxy Camera, for whatever reason, decides to power itself completely off, it takes closer to 20 seconds to boot up. That is WAY too long for a camera. It would also lag on occasion when switching between shooting modes, which is just as bad for the same reason. The slower shutter speed also means that taking photos of moving objects will almost always leave you with some blur, so if you plan on using this for sporting events, don't bother, especially if you plan on zooming in very far. The camera's low light capability was terrible, though I was expecting as much due to the fact that compact super zoom cameras tend to have very small sensors. Nevertheless, indoor shots were noticeably grainier than my other point and shoot.Now, all that being said, if you don't mind the so-so picture quality, this camera is pretty awesome. I configured mine to automatically upload any photo I took to Dropbox, making them available anywhere on any of my other devices. The camera also has DNLA and other cool connectivity features, which allow me to wirelessly send my photos to my smart TV or other nearby smartphones (I think they have to Galaxy phones, though). You can also send your photos through your email or vice versa, and upload them to Facebook or Picasa (or any other such service), and it's all as easy as you could imagine.Nevertheless, I still ended up returning mine due to the relatively poor PQ for the price point. Obviously you're also paying for the big screen and smartphone features, which adds to the price, but I still expected pictures that at least looked as good as $200 - $250 MSRP camera (I say MSRP because you can find some great cameras on sale that fall into this price range, especially right before they are replaced with a newer version). This camera's PQ, unfortunately, is just below that, and I just couldn't justify the purchase. For some people, though, the PQ will be good enough, and will probably love this camera to death. In that case, I highly recommend this camera! For others who care more about picture quality in their super zoom cameras, the Canon SX280 HS is absolutely awesome, and is one of the fastest point and shoots I've ever used. The Sony HX20V is also great if you can still find it (it is about to be replaced with the HX50V), and I personally prefer its pics over the Canon, though some people might feel differently.I'm hoping that the newer version will either have better PQ or a lower price point. If one of the two happens, I'll definitely pick it up again. It really is a cool camera.", "Date": "May 8, 2013"}, {"Title": "I like it, but I can see why others may not", "Author": "Russ", "ReviewID": "R1EYLAZBYJSZZT", "Overall": "4.0", "Content": "I purchased mine from at&t; for $499, and it included an extra battery and charger. I'd give it 5 stars if it were a phone, and the battery lasted longer. For DSLR pro photographers, I can imagine criticism, but for an amateur looking for a device that takes incredible high photos and video, to edit, and instantly share on the internet, and also have a smart tablet, you can't go wrong. It can be used as a phone with an app as well. Buyer must keep in mind that what you are buying is a $300 camera, and a $200-$250 wifi smart device. Mine only came with 4gb of internal memory, but Verizon's, and the unlocked versions will give you 8gb. I recommend a spare battery and charger, as it goes fast when used as a tablet. This is a fantastic device, and a fun, unique gadget, although I'm not sure the market is ready for this yet. If you don't need an android device, just buy the Samsung $300 smart camera. It's well worth the money. Or, you wait for the price to drop, which I suspect it will by the summer of 2013.", "Date": "January 10, 2013"}, {"Title": "Nice and advanced product.", "Author": "Carlos Alencar", "ReviewID": "R1S322DV3VNMHC", "Overall": "4.0", "Content": "It is amazing to have a machine counting on the whole resources of an android device. To send my photos immediatly to the cloud is fantastic. GPS and other apps are very usefull for a tourist. The hardware is also excellent,  specially the 21x zoom lenses. On the other hand, I found difficulties to find a suitable case - a high level product like that at least deserves a factory  included one.", "Date": "April 2, 2013"}, {"Title": "Excellent", "Author": "rename42", "ReviewID": "R3540435CXVDED", "Overall": "5.0", "Content": "I bought at ATT for the full $499 since I already have 2 lines. I was apprehensive due to some poor reviews but am more than pleased with the purchase. The camera works great for taking pictures and video and is an excellent mini tablet. Android apps work without a hitch and the speakers are more than adequate.", "Date": "December 28, 2012"}, {"Title": "Grey market Camera, no Warranty", "Author": "Mark Twain", "ReviewID": "R38UAJIUZIKZMD", "Overall": "1.0", "Content": "While I am sure this camera is probably fantastic, the listing does not warn the user that the Camera is grey market, and Samsung Electronic service centers in the US will NOT honor the warranty. My would require being sent to a Samsung India service center.Off to find a similar model with a US warranty.", "Date": "October 17, 2013"}, {"Title": "Great camera, but unlocked version may come from other country", "Author": "Jasmine Wen", "ReviewID": "R1NQCJ56HK0N3Z", "Overall": "3.0", "Content": "Before purchasing this camera, I found the local BestBuy has GC110 model without 3G priced at $449.  I looked it up at Amazon, found this GC100 3G version even unlocked is about $100 less.  I was very suspicious about this deal, but still made the order.The camera arrived as brand new and I am feeling better.  Love the camera and especially the screen, the biggest screen you can find for P&S; camera.  The camera package are printed in Poland language (like samsung.pl)  But the package was sealed very well and definitely not previously opened one.One small problem: the power adapter came with the package does not work: basically it charges very very slow, like 10% overnight.  Called U.S. Samsung CSR and was told to switch to PC USB, then the battery is able to charge to full quickly.  Samsung CSR (in the U.S.) could not find the IMEI# from this camera (I think it's because it's from outside of the U.S.).  But she is nice enough to offer me with a replacement adapter.  Honestly, the adapter looks cheap made, and it's black/odd and does not match with the gorgeous camera white.  I guess it could be swapped to be able to use in the U.S.Before receiving the replacement adapter, I found I can use any USB (iPhone, iPad, computers, etc) to charge it.  So, the adapter issue became a minor issue now.  Then quickly, I found out the battery drains too fast.  I think this could be common issue of an Android system or the battery is too small for this camera.  Using wifi about 30 min, I downloaded and installed some apps, read some news, the battery dropped from 100% to 80%.  Maybe some big downloads like 150M offline GPS maps had some impact.  Then with WIFI on for about 2 hours later (almost doing nothing), the battery dropped to 70%.  Then, I used the offline GPS app to guide me home about 15mins' drive, it dropped to 60%.  Wow!  Seems I will need to keep in charged all the time.  So far, I've not tried battery drain if using camera only but I will do soon.  Hopefully, if I do all tricks to conserve the battery, like turn off wifi, lower display brightness, etc, I will be able to take 350 pictures as in spec.Anyway, bought this camera for it's Android system and the huge screen.  Certainly, it has some downsides comparing to others like Canon/Nikon, but it's just what I need.  I will also need to try out 3G soon to see whether unlocking works or not.", "Date": "July 19, 2013"}, {"Title": "Insane!", "Author": "shibby", "ReviewID": "RBZ6KCRM8JADV", "Overall": "5.0", "Content": "This is the coolest camera I have ever used in my whole 40 years of living.  Honestly it is a camera and an art shop all in one.  The quality is amazing and the fun details you can add on to your photos really are remarkable.  Way to go Samsung!  Now all it needs is a microscopic printer built into it :-)", "Date": "February 25, 2013"}, {"Title": "Great camera!", "Author": "Diana Nunes", "ReviewID": "R3NKEGNXB7Y7ZS", "Overall": "5.0", "Content": "Love everything about it.  Beautiful design, easy to use, great features. Wide angle, good wifi. It's a complete tablet but if an amazing zoom to take really nice pictures! The only con is the weight, it's a bit heavy.", "Date": "May 12, 2013"}, {"Title": "Gorgeous!", "Author": "Renato Oliveira", "ReviewID": "RKZ89FQGNXUCZ", "Overall": "5.0", "Content": "This camera is absolutelly fantastic... It's a medium term between professional and portable talking about size with professional resources! Other very important points are: the connectivity (3G, Bluethoot and Wi-Fi) and the possibility to install several app to edit photos few seconds after take them. I recommend...", "Date": "April 25, 2013"}, {"Title": "Great Camera with an Amazing OS!", "Author": "lucas710", "ReviewID": "R3OKU4A0DTRPJL", "Overall": "5.0", "Content": "This is a wonderful camera. From the perfect operating system to the crisp HD video recording and the amazing photos you can take with it. I highly recommend this to anybody who needs/enjoys a point and shoot camera and wants to take amazing photos and then be able to edit them really quickly.", "Date": "September 23, 2013"}, {"Title": "LOVE it", "Author": "anna potts", "ReviewID": "RFIO37P3TJPBK", "Overall": "5.0", "Content": "AMAZING camera, LOVE itits packed with lots of features & you can put all kinds of apps on it, couldn't ask for a better camera", "Date": "July 10, 2013"}, {"Title": "Best camera out there", "Author": "G. Devlin \"Sonnja\"", "ReviewID": "R1022MKGWJ66FD", "Overall": "5.0", "Content": "I would like to say that this camera is amazing and I have many cameras you can do so much there are so many apps you can add for editing the pictures and games its a camera and a tablet all in one the best yet thanks samsung", "Date": "April 28, 2013"}, {"Title": "Awesome", "Author": "benjie ulep", "ReviewID": "R1FD1AUHBR0Y75", "Overall": "5.0", "Content": "Now I can capture photos and video and at the same time get in to the internet. The cam is so fab.", "Date": "February 11, 2013"}, {"Title": "Great camera, with great 21x optical zoom and clear pictures, is like having a mini tablet and a camera.", "Author": "Isaac Anaya", "ReviewID": "RGFHKS20O2YEK", "Overall": "5.0", "Content": "Good 21x optical zoom in picture and video, great 16 m.pixels.The screen is really clear. The touch screen is very good.The software is great, is like have a mini tablet (android) and a camera.A little bit bigger, definitely no a pocket camera.I paid $350 usd, is very fair, but  dont pay more than $450 usd in this camera is not worth it.", "Date": "January 6, 2014"}, {"Title": "everything you need in a camera and more", "Author": "john quarshie", "ReviewID": "R1AYWIZAQUTH6Q", "Overall": "5.0", "Content": "I already own one of this camera.this was a christmas gift for a friend who theatened to steal mine.awesome awesome awesome. Two other friends have started the process of purchasing one if the can find it a bit cheaper than I paid for mine.love it and cannot leave home without it", "Date": "January 3, 2014"}, {"Title": "Great Camera", "Author": "Stacy Dudley", "ReviewID": "RHAG9J6V2SELU", "Overall": "5.0", "Content": "All I get is ohhh's and ahhh's nice piece of equipment, especially for a novice.  I would recommend this camera to anyone.", "Date": "December 26, 2013"}, {"Title": "Great camera", "Author": "Donald Watkins", "ReviewID": "R24GCNDQYMXVL9", "Overall": "4.0", "Content": "This is a great camera, but.... I am a bit technology challenged so I cannot use it to its full potential, but am working on that. (thanks to youtube and a patient stepson with the same camera.  I am very proficient with older SLR's and have many great lenses, flashes, accessories and on a part time basis, sell my work.  I can't wait until I can explore all the possibilities that this camera has and add its capabilities to my photography tool box", "Date": "December 4, 2013"}, {"Title": "Arrived so fast I was really surprised at the time it came!!", "Author": "Kat \"Kat\"", "ReviewID": "R2FOM3ZYLXPERH", "Overall": "5.0", "Content": "Love the camera, its just like taking pictures with your smartphone, but with ZOOM!!... and the shipping time and handling was just perfect!", "Date": "December 3, 2013"}, {"Title": "Love this Camera", "Author": "Reji Sebastian", "ReviewID": "R2WF6ENWTL2OJZ", "Overall": "5.0", "Content": "I bought this camera couple of months ago, and I would recommend this to anyone who is technology savvy as the features  are good and easy to use.", "Date": "October 30, 2013"}, {"Title": "Incredible", "Author": "maso", "ReviewID": "R36V9TRDXJRVQO", "Overall": "5.0", "Content": "That piece of machine! Great picture quality with easy access to the menu and some photos and recordings exelentes. Your screen gets to see the whole decision making environment in a comfortably cool planes", "Date": "October 30, 2013"}, {"Title": "Awesome Camera!", "Author": "Julie", "ReviewID": "RV7PMFZC1CGO8", "Overall": "5.0", "Content": "I really love the camera! My hobby is photography and this captures beautiful shots. I also love all the editing options and of course the uploading option is amazing. Haven't yet tried out the \"expert\" setting yet but I plan on it in the near future, I do love the \"smart\" settings that you can shoot your picture in, my favorite is Macro because I prefer still objects, flowers, insects, etc! Way to go Samsung, this camera rocks!!!", "Date": "October 30, 2013"}, {"Title": "Great for the \"phonography\" enthusiast", "Author": "Billigan", "ReviewID": "R38FKFHTFZZ4K0", "Overall": "5.0", "Content": "I just got my galaxy camera yesterday. I currently use the Samsung galaxy note 3 as my cell phone, and it takes amazing photos, but the tiny lens is still restricted. The galaxy camera gives you pretty decent optics that you would find with a mid- range point and shoot camera along with a great optical Zoom. And all of my android apps I use for photography on my phone I can use right on the camera. Great product for anyone who wants to take great photos and edit and produce them on the go.", "Date": "October 30, 2013"}, {"Title": "What camera!!!!!!!", "Author": "maso", "ReviewID": "RTCXH4SLJTEJT", "Overall": "5.0", "Content": "For those who concemos android, a great help. One knows in advance what is brand new. Excellent photo quality 4.2 and 16.9, with a lot of no light for its large flashThe recording in HD is incredible, fantastic zoom more than, comfortable and easy to enter the menu for different shots.The best camera in this moment.", "Date": "October 29, 2013"}, {"Title": "Excelent!!!", "Author": "FELIPE SANCHEZ", "ReviewID": "R3AOLE788JGW2G", "Overall": "5.0", "Content": "Excelent camera!! It does everything!! You can connect with all social networks and upload your pictures instantly. This is awesome product.", "Date": "October 25, 2013"}, {"Title": "Finally found the perfect Camera!!", "Author": "T.Rich_23", "ReviewID": "R161WFUMURT1QF", "Overall": "5.0", "Content": "I love this camera, the pictures come out really clear. It took me awhile to figure out how to work it at first and I kept falling back on my Canon. But I stuck with it and now I'm finding out all of the amazing things this camera can do. I just need to find a case that will fit it now.  It's a little on the big side but I can deal with the slightly larger camera in exchange for the pictures I get.", "Date": "October 23, 2013"}, {"Title": "My first smart camera", "Author": "WILLIAM F SMITH", "ReviewID": "R9RNAFB1P8SBL", "Overall": "4.0", "Content": "This is the most I've spent on a non-DSLR camera, but it was money well spent. I like the android OS as I have many android devices and I'm familiar with it. It takes great pictures and I love having it upload to my dropbox account like my phone does. The zoom is also a great feature. My only issues are the color of the camera (The padded grip and the strap are more blue than black. In sunlight, even the body looks blue) and having to relearn how to hold the camera without my thumbs hitting the screen. Overall, I'm very satisfied.", "Date": "October 13, 2013"}, {"Title": "I LOVE THE CAMERA.", "Author": "Clifford A. Bullard \"Dora Bullard\"", "ReviewID": "R2BPB307G2CTIP", "Overall": "5.0", "Content": "This camera you cannot go wrong with this camera. I give it a 5. It has everything you ever want on a camera.", "Date": "October 8, 2013"}, {"Title": "Great w/ only one issue", "Author": "K. Mangino", "ReviewID": "R2JJ2SSC9IH7YV", "Overall": "4.0", "Content": "I really like the camera, with one exception... I had a hard time getting the image in focus at night, when I was in motion.  I took my girlfriend on a horse and carriage ride, and sat across from her to get a few photos of her while we were moving though some cobblestone streets... and all the images, unless we were stopped, were out of focus. There was enough light for the focus to work when we were moving- and it worked fine when we were stopped.  It needs image stabilization... again, I need to play with the camera more, as there might be a setting I don't know about yet for that.Other than that, the video is great, the other images came out amazing.", "Date": "October 2, 2013"}, {"Title": "Samsung Camera", "Author": "John H. Wagner III \"Rhonda\"", "ReviewID": "R1PP3B8STDCHQD", "Overall": "5.0", "Content": "I LOVEEEEEEE IT!!!!!!! Best camera I have every had that is this small...would recomend it to any one that wants one...", "Date": "October 2, 2013"}, {"Title": "Samsung Galaxy Camera EK-GC100 8GB Black, Android OS, v4.1 (Jelly Bean) 3G...", "Author": "Larry L. Schwartz", "ReviewID": "RRMU06DR8VM9J", "Overall": "5.0", "Content": "This camera is really unique.  It is a wi-fi smart-tablet and it is also combined with a very good, well thought out camera.  You can use \"Drop-Box\" to store your photos and share them with friends and loved ones.  Great Product!!!", "Date": "September 27, 2013"}, {"Title": "It said it was compatible with apple using KIES..and it is no true..it does not connect camera with MAC !!!", "Author": "Lucia Pasos", "ReviewID": "RJD99BNKCDA6O", "Overall": "1.0", "Content": "It is not COMPATIBLE with a MAC computer not even through KIES !!! I will see how i can return this item..camera is good..", "Date": "August 31, 2013"}, {"Title": "Amazing", "Author": "Amanda Faubert", "ReviewID": "R212RDGNCZN6B5", "Overall": "5.0", "Content": "We love the camera, takes great pictures. It's light easy to take with you. Setup is much like a tablet but simple. Would recommend to everyone", "Date": "August 16, 2013"}, {"Title": "I love this camera!", "Author": "JEANNE DEAUEDE", "ReviewID": "R2WJ97MYUO3HSF", "Overall": "5.0", "Content": "This is the most user friendly piece of technology ever! It doesn't come with a \"paper\" manual because you absolutely don't need one.Some of the complaints I read about was the battery life and that hasn't been a problem at all.  I videoed a demolition taking place in our town for several hours and still had 3/4 of the battery life left.Takes amazing quality pictures I am thrilled.", "Date": "August 16, 2013"}, {"Title": "I recommend", "Author": "Nadezeda Shcherbakova \"HOPE777\"", "ReviewID": "R2SOTETOFG4GDJ", "Overall": "4.0", "Content": "I like this camera. I just feel that I need something new. I love WI-FI and connection withmy Samsung Galaxy cell phone. Easy to operate because I have knowelege of my cell phone. Of course , there are many other cameras that may be better than this one. By th by, very clear and bright photos! I have paid $337. I am sure for this money this camera is good.I have everything white- computer,PC, CELL PHONE, battery charger from SAmsung,Touch Pad, now I have one more white- camera.They look together outstanding. I think if this camera can work for next 2 years, I will be happy. I have previuse SAMSUNG black camera. It has worked perfect and made perfect photos. I t has been accedently distroed in Universal Studio by crasy shark. But It is not a camera fault.Peopl, if you have money I recomend to by this camera, I have also looked more cheap camera Samsung white for $149-179. This camera looks more cheap than galaxy.Look Youtube video to make right decision.", "Date": "August 14, 2013"}, {"Title": "Pretty!", "Author": "KitsuneUdon", "ReviewID": "RMR9RREPRP80L", "Overall": "5.0", "Content": "It is a very stylish design. I think most of the cost is because of the design because the camera is not the best...haha.I like it though.", "Date": "August 12, 2013"}, {"Title": "Excellent", "Author": "RJ the buyer", "ReviewID": "RUNRWV06899T7", "Overall": "5.0", "Content": "I love it! I recommend this camera because it has a great quality of pictures. The touch screen is also responsive.", "Date": "August 12, 2013"}, {"Title": "What a treat", "Author": "Burnis V.Back", "ReviewID": "R3OVVKHEUN4OB4", "Overall": "5.0", "Content": "I wanted a good camera, and certainly got one.  It is easy to use and can do everything but make a phone call.", "Date": "July 27, 2013"}, {"Title": "OMG!", "Author": "JOSE TOVAR", "ReviewID": "RVQ5IDD0ZBIP5", "Overall": "5.0", "Content": "my expectations about the camera was so light but now I know is tremendous device for cheap price, I'm enjoying it and thanks again! I recommend it!. Thnaks Amazon Friends, fast shipping!!", "Date": "July 14, 2013"}, {"Title": "Great Android camera, but probably not the best for the price", "Author": "Sim Harbert \"noisygecko\"", "ReviewID": "RXV7J37WWWCXR", "Overall": "4.0", "Content": "While I do really like this camera, I think there are much better cameras out there for lower prices.  I got the International GSM one so that I can buy SIM cards when I travel to have maps and other data access when out of the country.  My Verizon phone is virtually useless outside the country.This camera is pretty big since the screen on the back is as big as my Galaxy Nexus.  The large screen makes it harder to hold since there is very little area to hold it with on the back.  It is very easy to hit the screen accidentally.That said, it is amazing to be able to use it to send emails, use Google Voice and even listen to music or watch Netflix.  I have Google+ automatic photo uploads going, so all my pictures are uploaded automatically as soon as I get to wifi.  Much better than EyeFi, which I could never get working very well.  It should work with Dropbox photo upload as well.The camera app is pretty good, but it has a bit of a strange interface.  It definitely could have been better.  But, it is usable and being able to clearly see the photos after shooting them is nice.  There are also a few Android apps out to enhance and modify the photos.", "Date": "August 17, 2013"}, {"Title": "camera for me", "Author": "Francie R. Sorem", "ReviewID": "RIMEFALXQ5MJM", "Overall": "5.0", "Content": "i know this is not the camera for everyone but it is the camera for me. cost is relative to how happy you are with the features. i have always heard that the most expensive feature on your electronic device is usually the one you will never use. i love all the gadgetry involved with this particular camera and find it very user friendly.very fast on the internet as well, love that i can be reading my kindle on it but ever ready to catch a great shot.", "Date": "January 29, 2013"}, {"Title": "I am DSLR user but I enjoyed using this one", "Author": "Yasser Fellimban", "ReviewID": "R30JV7S07ULOQP", "Overall": "5.0", "Content": "there are lots of things to say about this one. I am not gonna say everything. I am gonna say that this is the best point and shoot I ever used (I used more than usual).", "Date": "January 3, 2013"}, {"Title": "What a rip-off", "Author": "Sky Blue", "ReviewID": "R3K908HW7D1SEL", "Overall": "1.0", "Content": "I borrowed and extensively played with it for 2 hours and my conclusion: an utter rip-off.  It has a tiny sensor - the same size as that of Sony Cybershot DSC TX20, which is priced at one third of this one, with Carl Zeiss optics and is dust-proof, water-proof and shock-proof (although it has less optical zoom) and is supremely well-made.  Talk of value.  For this camera's street price of $620, you could almost get Sony RX100, the king of pocket camera, or even a real mirrorless or a DSLR.Its photo quality falls short of that of Sony Cybershot series.  The camera is totally mundane and no better than any $100-200 cameras, and the price premium comes solely from the fact that you can share your photos with others anytime anywhere through 3G network.  Big deal.  How can it justify the 3X price difference?  Only the most die-hard Facebook real-time updaters would fall for this feature.  If you need the SIM card and data plan for it, it might as well have a phone capability as well -- but it doesn't. The recent Nokia phones produce similar-quality photos.Samsung sells almost exactly same camera without the 3G data but with wi-fi at $150: Samsung WB150F White 14.2-megapixel Digital Camera (and that one even has a superior Schneider lens whereas this Galaxy Camera has a Samsung lens).  Other differences between the two models are minor - see for yourself. (See http://www.amazon.com/Samsung-WB150F-14-2-megapixel-Digital-Camera/dp/B0072618G0/ref=sr_1_1?s=electronics&ie;=UTF8&qid;=1355168946&sr;=1-1&keywords;=Samsung+WB150F+White+14.2-megapixel+Digital+Camera)  If you must somehow share your photos without transferring them to your computer, isn't wi-fi enough?  And yet this Galaxy Camera is 4 times more expensive, and add $10 per month data plan to that.This is the kind of product that comes from shoddy thinking. Samsung should really concentrate on raising the fundamental quality of a camera (IQ etc) rather than throwing in such auxiliary gimmicks to pump up the price.  Some may think one star is too harsh, but I really think Samsung needs to get the message.", "Date": "December 10, 2012"}, {"Title": "Works great, has plenty of features", "Author": "David Vanslyke \"Dave V\"", "ReviewID": "R1W5WU8ND7BC04", "Overall": "5.0", "Content": "so easy to use and can carry only 1 item for email, facebook and even skype.  If it had a phone, it would be all that was needed but can put in a SIM card for 3g access", "Date": "January 2, 2013"}, {"Title": "the touch screen has a mind of its own!", "Author": "roaeja \"Hey you!\"", "ReviewID": "R362HIDZP5MF01", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moBN1YFQ2PA9Q0embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moBN1YFQ2PA9Q0refresh_preplay() {\n\ndocument.getElementById(\"cv_moBN1YFQ2PA9Q0chiDiv\").innerHTML = document.getElementById(\"cv_moBN1YFQ2PA9Q0hiddenPre\").innerHTML;\n};\ncv_moBN1YFQ2PA9Q0refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moBN1YFQ2PA9Q0so;\t   \n\n\nfunction cv_moBN1YFQ2PA9Q0loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moBN1YFQ2PA9Q0so = new SWFObject(swfLocation, \"cv_moBN1YFQ2PA9Q0AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moBN1YFQ2PA9Q0so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moBN1YFQ2PA9Q0so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moBN1YFQ2PA9Q0so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moBN1YFQ2PA9Q0so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moBN1YFQ2PA9Q0so.setAttribute(\"height\", swfHeight);\n          cv_moBN1YFQ2PA9Q0so.setAttribute(\"width\", swfWidth);\n          cv_moBN1YFQ2PA9Q0so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moBN1YFQ2PA9Q0so.write(\"cv_moBN1YFQ2PA9Q0flashcontent\")) {\n          fp_resizePlayerSpace('cv_moBN1YFQ2PA9Q0', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moBN1YFQ2PA9Q0';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moBN1YFQ2PA9Q0', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moBN1YFQ2PA9Q0loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moBN1YFQ2PA9Q0\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1FXHPE7T4GU9C\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1FXHPE7T4GU9C\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R362HIDZP5MF01\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1FXHPE7T4GU9C/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moBN1YFQ2PA9Q0duration')) {\n      document.getElementById('cv_moBN1YFQ2PA9Q0duration').style.display='none';\n    }\n    cv_moBN1YFQ2PA9Q0loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moBN1YFQ2PA9Q0loadSwf(movieID, playerVersion) {\n   return _cv_moBN1YFQ2PA9Q0loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moBN1YFQ2PA9Q0newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moBN1YFQ2PA9Q0', 0, h);\n}\n\nfunction cv_moBN1YFQ2PA9Q0resetPlayer(w,h,bw,cc) {\n  cv_moBN1YFQ2PA9Q0newHeight(h);\n\n  cv_moBN1YFQ2PA9Q0so.addVariable(\"resetBandwidth\", bw);\n  cv_moBN1YFQ2PA9Q0so.addVariable(\"cacheCode\", cc);\n  cv_moBN1YFQ2PA9Q0so.setAttribute(\"height\", h);\n  cv_moBN1YFQ2PA9Q0so.setAttribute(\"width\", w);\n  cv_moBN1YFQ2PA9Q0so.write(\"cv_moBN1YFQ2PA9Q0flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moBN1YFQ2PA9Q0RollOverImg = new Image();\ncv_moBN1YFQ2PA9Q0RollOverImg.src = \"http://ecx.images-amazon.com/images/I/711dHyODz5S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moBN1YFQ2PA9Q0preplay = document.getElementById('cv_moBN1YFQ2PA9Q0preplayImageId');\nif (cv_moBN1YFQ2PA9Q0preplay) {\n  cv_moBN1YFQ2PA9Q0preplay.onmouseover = function() {\n    cv_moBN1YFQ2PA9Q0preplay.src = \"http://ecx.images-amazon.com/images/I/711dHyODz5S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moBN1YFQ2PA9Q0preplay.onmouseout = function() {\n    cv_moBN1YFQ2PA9Q0preplay.src = \"http://ecx.images-amazon.com/images/I/711dHyODz5S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moBN1YFQ2PA9Q0preplay.parentNode;\n\n  var cv_moBN1YFQ2PA9Q0currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moBN1YFQ2PA9Q0currentClick) {\n      return cv_moBN1YFQ2PA9Q0currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:27 Mins..The touchscreen was non-responsive and had to press the shutter release button to get it going.  It has now settled down and is responsive.  I think it is a matter of just getting use to a different touch screen.  It's an excellent camera and if you can get over the initial hump, with the touch screen, I think it will become a good camera.  The camera is learning your touches'.  I wish there was a touch sense control to adjust.I gave it a four star.  I don't know if it is the camera, software or just this camera.  But waiting for the touch screen to respond, is wasting my time.  It's a nice multimedia camera, heavy as a brick, but powerful.  Excellent macro and zoom.Excellent controls, plus access to Android market gadgets and apps.  If you can live with an ofter touch screen freeze up, this will make you happy.", "Date": "December 21, 2012"}, {"Title": "Wonderful camera with many possibilities.", "Author": "Peter", "ReviewID": "RWVBLXIFPMMWT", "Overall": "5.0", "Content": "I have to mention that after selling my Sony camera I was looking for a new one for over 6 months and I found it. EK-GC100 with unlock GSM is the best choice what I was looking for. As mentioned before I spent a lot of time to research this camera including price, manuals, specifications, different models of Samsung Galaxy EK-GC100/110, sellers, all reviews etc. Samsung Galaxy EK-GC100 (sold on Amazon) is the best choice and price I could find anywhere on Internet and in the store. From reviews, few people mentioned that it could be worth it to buy if this camera could be use as a phone also. Someone answered that it is too bad that this camera couldn't be used as a shaver also. But in reality you can use this camera as a phone anywhere in the world, only what you need is the SIM card (Internet data) or free WiFi and Skype to worldwide or Europe or USA subscription.", "Date": "July 21, 2013"}, {"Title": "The Item sold is Defective", "Author": "Gaurav Vyas", "ReviewID": "R37421XPHKHKMU", "Overall": "1.0", "Content": "This Samsung Galaxy Camera is not booting/starting up at all. I have used it only 2-3 times & every time it has some issue in booting/starting. Earlier I ignored it, but now it is not booting/starting at all. Its not even 8 months old & such issues. I have spent $540 for it, but all waste. I have lost all my memorable photos which I have clicked at different places/occasions. I am highly disappointed.", "Date": "August 26, 2013"}, {"Title": "great toy!", "Author": "Jean-Marc Fort", "ReviewID": "R3OHY6EN3GSIAH", "Overall": "5.0", "Content": "im not into fones etc., where it gets difficult to just dial a number!. I wanted a small camera with some gadgets but, that takes great pics. and that it! still learning and, living in the carab, plenty of subjets to practice on. still having lots of fun learning and, its great to just send cool pics to friends right away with some comments. very cool cam!!!", "Date": "June 7, 2013"}, {"Title": "Look elsewhere", "Author": "Manno", "ReviewID": "R1I13GX3XRK824", "Overall": "1.0", "Content": "I received the package right on time; unfortunately, the lens has a clear black spot in it which appears in the pictures.", "Date": "August 26, 2013"}, {"Title": "Poor Service From Vendor. Think twice before buying from this vendor!!!!", "Author": "Carmen", "ReviewID": "R8ONKUIZL5YHM", "Overall": "1.0", "Content": "I purchase a samsung galaxy camera from this vendor the camera arrived quickly.But the issue is the camera is not taking the charge it takes hours before the camera charges up.I have ask to return the camera and this was their  reply: This item has a manufacture warranty only , please refer to your warranty booklet that came with purchase you can contact samsung international  for troubleshooting , warranty, repair and replacementThe following products carry only a manufacturer’s warranty:Computers, Video Cameras, MP3 Players, iPods, iPads, Tablets, PC Hardware, Navigation, Point Cards, Software & Projectors- We will not accept any returns if the unit has been open and the factory seal is broken.I spend my hard earn money and left to fend for myself by contacting Samsung and hope that they can help!How I was suppose to know camera didn't take the charge unless I opened the product.", "Date": "August 16, 2013"}, {"Title": "Definitely worth every penny", "Author": "Austin R", "ReviewID": "R3976OHER8Z9HH", "Overall": "5.0", "Content": "At first I was taken aback by the cost of the Galaxy Camera, and couldn't figure out why my friend had recommended it to me, since I am somewhat new to photography. But, with an amazing lens, crystal clear pictures, and more than 20 shooting modes to accommodate nearly any situation, I can definitely understand now. The picture quality is outstanding, the interface is easy to use but still provides advanced features, and the Android Jelly Bean OS is great. I got upgraded to 50GB of Dropbox for 2 yrs, and now all my pictures back up as soon as I take them. I never have to worry about losing anything. The physical build quality of the Galaxy Camera is outstanding as well. It does not feel light and cheap like some Samsung phones do, but it isn't heavy either. It's weighted well and feels good in the hand. 5 Stars.", "Date": "July 26, 2013"}, {"Title": "Excelente", "Author": "YOLADAN RODRIGUEZ", "ReviewID": "R2QBA51VU673SC", "Overall": "5.0", "Content": "Escelente producto, muy apropiado para el uso en viajes y turismo. me parece una herramienta muy apropiada la recomiendo a todos", "Date": "March 23, 2013"}, {"Title": "Love it.", "Author": "Socrates Itumay Jr.", "ReviewID": "RK544VMTUWF2R", "Overall": "5.0", "Content": "Thanks for the awesome service.  I would love to order again from you guys.. Keep up the good work. Thanks again.", "Date": "March 26, 2013"}, {"Title": "camera future", "Author": "Endrio tisano", "ReviewID": "R3L2X2JFNQM6QY", "Overall": "5.0", "Content": "i think this camera open a windows on the future camerasend all pics by WiFi or data line!!best idea", "Date": "February 27, 2013"}, {"Title": "why", "Author": "bruce p sidner", "ReviewID": "R2083HDAOZPWUC", "Overall": "1.0", "Content": "Why pay 500 dollars for a camera.  there is no need for jelly bean on a camera wow you can print directly from the camera that is sarcasm by the way", "Date": "March 31, 2013"}], "ProductInfo": {"Price": "$999.00", "Features": "3G: HSDPA 850 / 900 / 1900 / 2100\nDisplay: 720 x 1280 pixels, 4.8 inches (~306 ppi pixel density) Corning Gorilla Glass 2\nCamera: 16.3 MP, 4608×3456 pixels, autofocus, 21x optical zoom, pop-up Xenon flash, AF light, Video: Yes, 1080p@30fps, 768x512@120fps\nOS: Android OS, v4.1 (Jelly Bean)\nCPU: Quad-core 1.4 GHz Cortex-A9 GPU: Mali-400MP", "Name": "Samsung Galaxy Camera EK-GC100 8GB White, Android OS, v4.1 (Jelly Bean) 3G Unlocked HSDPA 850 / 900 / 1900 / 2100 by Samsung", "ImgURL": "http://ecx.images-amazon.com/images/I/41HvORQLXQL._SX300_.jpg", "ProductID": "B008K29OHK"}}