{"Reviews": [{"Title": "Incredible camera for the money", "Author": "Syberfilm", "ReviewID": "R13QV3Q50IP6W4", "Overall": "5.0", "Content": "This camera is great. Much better then expected. I was actually surprised at how good the kit lenses were. I was going to buy some additional ones but these are more then good enough for 80% of the time.I have Nikon's and Canon's and this one kind of fell in my lap. I was just going to sell it until I started shooting with it. The colors are amazing. The HD video looks awesome as well. If you want to use this for a full time HD capture camera this cam is not for you. It lacks an external mic jack. But if you just want to capture awesome video the internal mic is fine.But the best part of this camera is it's ability to nail a shot as I want it. I just look at a scene, compose and this camera nails exposure as good as anything out there.The pictures are stunningly sharp. I would say it is as sharp as the Nikon D7000. To my not scientific tests. Just the way they look and feel.I don't really care what brand I shoot with. I just want it to take good photos. This camera does just that for a great price.I bought a Nikon to Pentax body adapter and am still amazed at the quality of exposure without using a Pentax lens. The K3-0 allows you to use tons of old Pentax lenses as well as using adapters for other lenses like the above mentioned Nikons. Note* I am using Nikon manual focus lenses with this setup. I don't know how AF lenses would work.My unit has some hot pixels. But after using the pixel mapping feature I do not see them showing up in the J-pegs. In raw this is a non-issue since when opening it up in a raw converter they are automatically fixed for you.Viewfinder is awesome. Image stabilization works great.I am pretty happy with it. I plan on buying one of the Weather sealed lenses because I love shooting in the rain. These are not water proof. They are just weather resistant. So don't take it in the pool with you.I would recommend this camera to any one getting into photography or someone who just wants to point the camera and get great shots.The supplied lenses while not perfect and not weather-sealed are great starter lenses and are all most beginners will need. The camera has so many built in features I would suggest going to the manufacturers website to read about them. This camera is very advanced for the money.", "Date": "March 12, 2013"}, {"Title": "Great camera", "Author": "Frank J. Rosati", "ReviewID": "R2ZUYZDMAQDA4V", "Overall": "5.0", "Content": "Love this camera, it takes wonderful pictures. Very easy to use and it has enough adjustments so if you had previously used a 35mm camera without all the fancy gadgets (metering, autofocus, etc..) you can get creative with your picture taking.", "Date": "April 10, 2013"}, {"Title": "i have used Pentax for over thirty years, always happy with each one, but this one is the best yet.", "Author": "nutmegglass", "ReviewID": "R2TUY1FPOPOHBW", "Overall": "5.0", "Content": "i have used Pentax for over thirty years, always happy with each one, but this one is the best yet, on every single aspect of it. it's a fabulous camera.", "Date": "June 26, 2013"}, {"Title": "Lens are not Weather Sealed", "Author": "Marc", "ReviewID": "R1YJ9QJIV8VK9N", "Overall": "1.0", "Content": "The lens supplied with this kit are NOT weather sealed.  They are the DA L which are a lower quality lens with plastic bases where they meet the camera and cheaper overall.  They are also of lower quality than the DA (no L) lens.", "Date": "February 22, 2013"}], "ProductInfo": {"Price": "$899.95", "Features": "16 Megapixel APS-C CMOS image sensor\nFully weather sealed through out the entire camera, not just the port and battery doors, for a rugged cold proof/weather proof SLR\nFull 1080p HD video 30/25/34 FPS, features h.264 compression, flexible exposure controls and HDR finishing options.\nISO speeds to 25600 with minim noise\nLow profile glass pent prism viewfinder achieves a 100% optical field of view", "Name": "Pentax K-30 Weather-Sealed 16MP CMOS Digital SLR Dual Lens Kit, 18-55mm and 50-200mm (Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/51o68ZpnY9L._SX300_.jpg", "ProductID": "B008I213BC"}}