{"Reviews": [{"Title": "Lovin' my camera!", "Author": "Melissa C. Carnes \"masonsmommy\"", "ReviewID": "RZ7GS47X1OVJW", "Overall": "5.0", "Content": "The package is quite fantastic for the price and everything was as listed. The only issue is that the bag it came with is too small to hold the camera and all the lens. But for the price - I am overlooking this and getting a slightly bigger bag.", "Date": "February 27, 2013"}, {"Title": "amazing product", "Author": "Amazon Customer", "ReviewID": "R2V6ZM56UXEDRH", "Overall": "5.0", "Content": "I'm a first time owner of a DSLR camera and I don't have any to compare it to. But so far, I AM IN LOVE with this product. It was quite a bargain to be honest because of how much stuff that came along with it. The slave flash, is ok. I haven't used it yet because it makes everything so bright. But I'm sure I'll be able to figure out how to use it right.Best purchase ever :)", "Date": "April 7, 2013"}, {"Title": "The good and the bad", "Author": "Lea A.", "ReviewID": "R3QGMNE2TFT2OL", "Overall": "4.0", "Content": "The camera and the lenses were canon brand, therefore they were wonderful. The camera itself is awesome! It's touch screen, which makes operating the camera much easier. The accessories, however, were a completely different story. Many of the accessories were of a very poor quality.", "Date": "April 2, 2013"}, {"Title": "loving the camera", "Author": "Beth M Anderosn", "ReviewID": "R1TF8CJ8OM5KAA", "Overall": "4.0", "Content": "I did a lot of looking before I picked this camera. I know I still have a lot to learn as far as using it with all the settings but so far it's been great.The only reason I didn't give 5 stars is because some of the other things in the bundle weren't that great. The bag that came with it isn't very padded and wouldn't even hold the camera and both lenses. After looking at some of the filters and other things, I was told by many that some of the things are pretty much useless. But I'm still happy with what I did receive and will use a good chunk it of at some point.", "Date": "March 9, 2013"}, {"Title": "Good Products & service", "Author": "Neel", "ReviewID": "RSTNIR1XV3K4W", "Overall": "5.0", "Content": "The packet arrived well on time & pretty much satisfied with all the aspect of handling & delivery. The bag was well packed. All the care was taken about the handling.All the listed item were shipped without missing any in these bunch of goods. That was really neat about it.all the things are functional and work really well as expected; so waited to write a review for more than month....nice job....keep it up.would recommend to buy these.", "Date": "June 17, 2013"}, {"Title": "Canon T4i", "Author": "JB 1007 jagdkg", "ReviewID": "R3L9V0H70O6IN5", "Overall": "5.0", "Content": "Have moved from point/shoot camera to SLR.  Love Canon Products.  Excellent workmanship.  All products excellent, but handbag is inadequate to hold what is needed.  Also, external flash should be replaced with adjustable unit. flash works, but could be better.", "Date": "April 21, 2013"}, {"Title": "Wonderful", "Author": "Jean G.", "ReviewID": "R3W3JGD3CJWVHE", "Overall": "4.0", "Content": "I almost forgot to write a review for the camera, however it wouldn't be nice of me because of the quality of the sale.Well, everything listed was in the package. Camera is wonderful. The other products are poor quality, but my focus was on the camera and it is fantastic.", "Date": "March 1, 2013"}], "ProductInfo": {"Price": "$945.59", "Features": "Canon EOS Rebel T4i 18 MP CMOS Digital SLR Camera Body Brand New Refurbished USA w/Manufacturer's Supplied Accessories\nCanon EF-S 18-55mm f/3.5-5.6 IS Lens w/Manufacturer's Supplied Accessories\nCanon EF 75-300mm f/4-5.6 III Telephoto Zoom Lens Brand New USA w/Manufacturer's Supplied Accessories\n16GB SDHC Class 10 Secure Digital High Speed Memory Card + USB 50 in 1 SDHC Card Reader + Memory Card Wallet\n(See Description for MORE!)", "Name": "Canon EOS Rebel T4i 18 MP CMOS Digital SLR Camera w/EF-S 18-55mm f/3.5-5.6 IS Lens (Refurbished) + EF 75-300mm f/4-5.6 III Telephoto Zoom Lens + LP-E8 Replacement Lithium Ion Battery w/External Rapid Charger + 16GB SDHC Class 10 Memory Card + 58mm Wide Angle Lens + 58mm 2x Telephoto Lens + 58mm 3 Piece Filter Kit + Mini HDMI Cable + Carrying Case + Full Size Tripod + External Flash + Multi Card USB Reader + Memory Card Wallet + Deluxe Starter Kit DavisMAX Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/61MXYSkhhzL._SY300_.jpg", "ProductID": "B008EW2N1K"}}