{"Reviews": [{"Title": "great camera.  accessories - not so much.", "Author": "515m", "ReviewID": "RV1J1HKKSSCK4", "Overall": "3.0", "Content": "a good deal for all you get, however definitely a beginner package. the camera and nikkor lenses are the real deal here.  they are exactly as you'd expect, and have been reviewed thoroughly all over the web.  (5 stars for the camera and lenses).  however the add-ons might keep you going until you really get into using them - then you'll want to upgrade.  the tripod is small and light, but not very solid.  probably good for taking group photos, but nothing w/ a longer exposure.  the wide angle and telephoto lenses are a bit of a novelty.  neat to try out, but also but not very solid.  the telephoto lens came apart the first time i tried to put it on (it screwed back together easily).  the wide angle lens, when shooting with the 18-55mm lens at its widest (18mm) setting, captures the ring frame of the wide angle lens in the photos.  the bag is handy, has two backpack style straps and holds everything nicely.  the downside is that it has a HORRIBLE chemical smell to it that fills the air.  I've had it for a couple of weeks now, and the room that it is sitting in reeks of some sort of petroleum product.  i won't use it.  this is a good package if you want a good camera with two good lenses, but i will probably cycle the accessories out as i quickly replace the ones i'll really end up using.  i've already replaced the tripod with this:  http://www.amazon.com/gp/product/B004U5U1BE/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1  (love it).  and will probably replace the wide angle lens with a proper one.", "Date": "May 19, 2013"}, {"Title": "Awesome", "Author": "Wesapea", "ReviewID": "R2XSEC39OBGK8H", "Overall": "5.0", "Content": "Awesome just what I wanted Nikon camera and lenses top-quality accessories of a lower quality but well worth the money. Very good service", "Date": "July 2, 2013"}, {"Title": "Great kit for beginners!!!", "Author": "Jake", "ReviewID": "R1LANY4QW7IKZ2", "Overall": "5.0", "Content": "I really love the D5100 body, 18-55mm and 55-200mm lenses, and the SD card as well. this kit is great and also try adding a 17-85mm f2.8 lens that will make the kit perfect.", "Date": "December 12, 2013"}, {"Title": "A good starter's kit", "Author": "Sofía Blanco", "ReviewID": "R1EWYEB3N9TJ7V", "Overall": "4.0", "Content": "The camera was in excelent conditions, and the nikkor lenses too. The SD card didn't work, I had to buy another one. The case or backpack was very handy, everything fits in there. It arrived in time and the service was excelent.", "Date": "December 6, 2013"}, {"Title": "Cheap - misleading advertisement", "Author": "Briscoe Ellett", "ReviewID": "R22PDM74X9O31I", "Overall": "1.0", "Content": "The camera and the two lenses 18-55 & the 55-200 were excellent however the rest of the package is a sale pitch.  The camera bag they shipped is a small/cheap bag NOT the one described/displayed in the ad, the tripod is flimsy and would only be used for a point and shoot camera. the exterior flash is a $5 disposable.  In the future I would recommend purchasing only the camera and two lenses and forget the rest of the trinkets.", "Date": "November 30, 2013"}, {"Title": "Great camera!", "Author": "Charlotte S.", "ReviewID": "RFL6A8MDHX6U4", "Overall": "5.0", "Content": "I love the bag it came with .... im not sure how the flash works  and the really havent used much or any of the xtras but man is this a great camera!", "Date": "May 13, 2014"}, {"Title": "!!!!!!", "Author": "dezerae silva", "ReviewID": "R1AKXCJGY209QV", "Overall": "5.0", "Content": "got my camera quickly!! exactly as described and i love it !! it works great & very cost effective great prices thank you thank you", "Date": "April 15, 2014"}, {"Title": "Awesome!", "Author": "Mickle", "ReviewID": "RELEJCUHKBB1B", "Overall": "5.0", "Content": "Awesome package!!contained everything needed for beginning photographer.  Very easy to use.  We have used both lenses and recorded videos.  Great deal!", "Date": "April 12, 2014"}, {"Title": "Great kit to start with!", "Author": "Candy Comstock", "ReviewID": "R1KHDFDK9TJGG6", "Overall": "5.0", "Content": "Great kit especially for starters. Comes with everything you need to start taking pics!!  Would highly recommend and very user friendly", "Date": "April 3, 2014"}, {"Title": "love this camera.", "Author": "Steven M Cruz", "ReviewID": "ROZMUCHV2B4LA", "Overall": "5.0", "Content": "I found this D5100 this deal and it was everything that I hoped it would be. Great camera to begin with.", "Date": "March 30, 2014"}, {"Title": "A little expensive, but worth it.", "Author": "Justin", "ReviewID": "RPUHNQN3SCT7U", "Overall": "5.0", "Content": "Cons: Some of the accessories are a little cheap. No lens cap retainers. Lens hood is basically useless.Pros: GREAT camera, backpack fits everything...and although some of the lens attachments are cheap, they produce some pretty cool effects. I've shot about 500 photos with this rig and I've yet to be disappointed. Big plus that it comes with a tripod and a Nikon VR telephoto lens. 8gb card holds more photos than I can shoot in a day.", "Date": "March 22, 2014"}, {"Title": "Nikon D5100", "Author": "Edwin Bell", "ReviewID": "R3O5ZNVQMLASDB", "Overall": "4.0", "Content": "I received the product promptly as promised. The camera and lens are exactly as advertised. The tripod is cheaply made and I will replace it with a higher quality product.", "Date": "March 3, 2014"}, {"Title": "Good camera", "Author": "luis carlos blandon", "ReviewID": "R2SW5J4XG2TSAP", "Overall": "5.0", "Content": "Excelent kit good price, i recomend it. If you are looking for a nice camera this is the best, pictures are amazing and beatiful.", "Date": "March 2, 2014"}, {"Title": "Nikon D5100 Digital SLR Camera is amazing!!", "Author": "gron0070", "ReviewID": "RDH9W3SDMBTV0", "Overall": "5.0", "Content": "Love this camera, and it came in a timely fashion.  I would recommend to anyone who is looking for a Digital SLR camera, do your research and see which ones you like. I looked at both the Canon and Nikon cameras, and they are both really good cameras.  It comes down to your preference for how the set up is and layout, and what options come on the camera. I would say that the Nikon is not as amateur friendly if you are new to a digital SLR camera.  If you choose this camera, you will not be disappointed!", "Date": "March 1, 2014"}, {"Title": "Awesome!", "Author": "Sir Dreck Body", "ReviewID": "R3PCHD563EVJYS", "Overall": "5.0", "Content": "got this deal for the Nikon camera... the accessories (stand, bag) etc... ehhhh not so much. But still an awesome buy!", "Date": "February 20, 2014"}, {"Title": "A great gift", "Author": "Jaylson J. Silveira", "ReviewID": "R3HV075S389GQR", "Overall": "5.0", "Content": "I gave this camera for my daughter. She loved it. She has been taking a lot of high quality pictures.", "Date": "February 3, 2014"}, {"Title": "nikon 5100", "Author": "Robin Rico", "ReviewID": "R20GMY4WHLCGDO", "Overall": "5.0", "Content": "I received everything as promised with the kit, with the exception of the USB memory card reader.  I love the camera.", "Date": "January 22, 2014"}, {"Title": "Love it!", "Author": "Richard Haynes", "ReviewID": "RJT9W4BJGFL4C", "Overall": "4.0", "Content": "I recomment this camera to anyone who needs a high quality point and shoot camera. I really like it because not only can I use it as a point and shoot on full automatic right now, but later as I learn more about photography I can use it in manual mode.", "Date": "January 21, 2014"}, {"Title": "Love this camera", "Author": "Kasanu", "ReviewID": "R1HEJSUKKDXN78", "Overall": "5.0", "Content": "Got the product and I really like it set is very professional. I use this camera take a lot nice picture while I travel.", "Date": "October 2, 2013"}, {"Title": "Poor quality of side items", "Author": "Debjani", "ReviewID": "R3IO36XWCO4EJE", "Overall": "1.0", "Content": "poor quality of bag, memory card, tripod. Should include cleaning kit but it is absent. Not satisfied with the product at all.", "Date": "December 30, 2013"}], "ProductInfo": {"Price": "$999.00", "Features": "16.2 MP DX-Format CMOS Sensor, 3.0\" Vari-Angle 921K Resolution LCD\n1080p HD Movies w/Full Time Autofocus, 18-55mm f/3.5-5.6G ED II AF-S DX Lens\n35mm Equivalent: 27-82.5mm Lens, In-Camera Special Effects Mode\nFast 11-Point Autofocus System, In-Camera HDR (High Dynamic Range)\nISO Sensitivity 100-6400, Built-In Speedlight Flash With i-TTL", "Name": "Nikon D5100 Digital SLR Camera with Nikon 18-55mm VR Lens And Nikon 55-200mm VR Lens + .43x Wide Angle Lens, 2.2x Telephoto Lens, 3 Piece Multi-Coated Filter Kit, Lens Hood, SLR Slave Flash, 8GB SD Memory Card, USB Card Reader, Backpack, Tripod and SSE Microfiber Cleaning Cloth", "ImgURL": "http://ecx.images-amazon.com/images/I/518U%2B48iUbL._SY300_.jpg", "ProductID": "B008O4T1HM"}}