{"Reviews": [{"Title": "Totally worthless to me!", "Author": "Jonathan S. Fisher", "ReviewID": "R3CW1V27VGLH6W", "Overall": "1.0", "Content": "This is the second digital camera I've owned, and it is a major disappointment. My six-year-old 8.1MP beats it hands down.  I received this shortly before my niece's wedding and played with it enough beforehand to figure out the basic points of operation.  It did not come with any instructions to note, just a sheet that told where to put the batteries (AAA, not lithium), the wrist strap, and the enclosed 4GB memory card.  The camera seems very flimsy, especially the door to the battery compartment, so be very careful when operating it.  The memory card just plugs into the slot with a firm push of a fingernail, with no door to keep out the dust.  The lens is recessed - again, no cover.  Out of 21 pictures that I took, only six were salvageable.  I deliberately did not set the date, because I didn't want it to appear on the pictures.  The camera included it anyway on all shots (with some random date!). Also, even though I set the flash feature, it is apparently not the default setting, because most of my pictures came out too dark.  You would think if it had any flash default at all, it would be \"on\" or \"auto.\" Nope, not a chance. You can adjust the resolution, and I set it to 12MP, but my 8MP camera takes more detailed photos.  Additionally, the touch screen is not very user-friendly, either, so you may have to touch the menu you want several times, and then try scrolling repeatedly.  While I was initially setting the language, it didn't want to scroll to \"English,\" and it took me nearly ten minutes to get out of Spanish mode. I suppose it's better than asking a toddler to sketch your cherished events with a crayon, but that's the nicest thing I've found to say about this product. I may just toss it in the garbage, because it is of no further use to me whatsoever.", "Date": "August 4, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "Takes videos\nTakes photos\nCan act like a webcam", "Name": "Vivitar VF131-BLK 14MP Digital Camera - Body Only (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41lr5PHYjyL._SX300_.jpg", "ProductID": "B008NA6Y1I"}}