{"Reviews": [{"Title": "Okay for kids", "Author": "MR RICHARD CUNLIFFE", "ReviewID": "R3HXENPBUDJJIY", "Overall": "3.0", "Content": "Brought this for my son, aged 5.  He loves it.  The picture quality is average/low and the shutter speed is very slow - but for kids, not bad.", "Date": "February 20, 2014"}, {"Title": "I used to be a professional photographer that used medium and large format camera...", "Author": "Bodhi E. \"B.\"", "ReviewID": "R1BWQERM5UHETA", "Overall": "4.0", "Content": "This thing is not a professional camera.  Don't confuse yourself there.It does take decent photographs, but the reason I bought it was for the price.  I ride a motorcycle and I wanted a camera that I could access quickly; if it were to fall out or otherwise get broken from a spill, it wouldn't be a heartbreaking loss or a financial hit.  In fact, I'll ride around with the camera dangling from the wrist strap that I attached to my glove (I ride a dual-sport and take it off-road).  I had gotten tired of digging out my phone to take a picture, especially during the rainy days common to my region.  And this thing has a flash; it takes a while for the flash to warm up but it works.  The camera itself comes up and is ready to use within a few seconds of turning it on - and has several features that I wasn't expecting from a camera in this price range.I'm considering buying a second to have on hand as backup.In short, I treat this thing as a disposable camera and it's exceeded it's expectations.  I would recommend it as such, or even as a first camera for your young aspiring photographer.  I wish only that it had an optical zoom.", "Date": "February 27, 2014"}, {"Title": "simple, easy to use.", "Author": "Lance C", "ReviewID": "R5SH04SKKJ31A", "Overall": "5.0", "Content": "If you want a basic, decently sturdy digital camera that won't confuse the crap out of you, buy this. enough said.", "Date": "March 18, 2014"}, {"Title": "bought as a gift", "Author": "terry keefer", "ReviewID": "RTCBLC1X1WXO5", "Overall": "4.0", "Content": "we bought this camera for my 12 yr old as a Christmas gift and she loves it. Great for a budding photographer.", "Date": "January 4, 2014"}, {"Title": "Terrible camera - complete rip off!", "Author": "P. Breakfield IV \"Tom Steele\"", "ReviewID": "R1F1R1QTWS6I7O", "Overall": "1.0", "Content": "What a horrible waste of money. I got this for my daughter and honestly I would have been better off with a fisher price camera. It would take better pictures. I really don't know how they get away with a camera this bad. I promise you that any cellphone would take better pictures than this camera. Avoid vivitar like plague!", "Date": "May 5, 2014"}, {"Title": "point and shoot", "Author": "archie10", "ReviewID": "R24QJTNTRW2HWW", "Overall": "3.0", "Content": "I would only get this camera to give away.  the software doesn't load correctly, there are *NO* drivers I can find anywhere on line and vivitar won't answer emails.", "Date": "March 4, 2014"}, {"Title": "Low Quality", "Author": "Bernard Gant", "ReviewID": "R3BS397U2BPTMR", "Overall": "2.0", "Content": "Low quality photos with the biggest problem being the fact that you must hold it steady up until you see the completed photo in the screen. If you fail to do so, the photo is blurry.", "Date": "May 19, 2014"}, {"Title": "Cute", "Author": "Rafael Lopez", "ReviewID": "R19D0GH1L0WJB9", "Overall": "3.0", "Content": "This was a cute purchase It is a fair product for the price and received in a reasonable amount of time. It isn't the fanciest of cameras but it is functional", "Date": "June 4, 2014"}, {"Title": "easy to use", "Author": "Jean H Allen", "ReviewID": "R3RFN9IKXKCWLS", "Overall": "4.0", "Content": "Pictures turn out clear as a bell  and as I said--easy to use'  Fits cofortably in my hands.  Not at all clumsy", "Date": "May 16, 2014"}, {"Title": "Horrendous image, worst quality", "Author": "Mario J. Fachler", "ReviewID": "R1QHNO56C6KN8F", "Overall": "1.0", "Content": "I have seeing bad products, terrible products, horrendous products, and this camera.10.1 MP ?  My 6 years old phone has a better image.Quality ?  It broke 2 days after the return window expired.A complete rip off.", "Date": "May 11, 2014"}, {"Title": "Great \"cheap\" camera", "Author": "Simmy", "ReviewID": "R1SDFNKH4S9UTL", "Overall": "4.0", "Content": "I purchased it knowing it was a cheap camera, but I was pleasantly surprised with the photos it took-- it is small but easy to hold steady so the pictures are clear.  You cannot recharge the batteries so it might get expensive over the long run, but it was purchased for a special event and that will not affect me.", "Date": "May 9, 2014"}, {"Title": "Save your money", "Author": "Luke F. Varvel", "ReviewID": "R1IT6SWRBXB1AJ", "Overall": "1.0", "Content": "Very cheap feel. Very slow zoom in and out. Blurry photos. No rechargeable battery. Not worth it. Spend a little more and get something decent.", "Date": "April 24, 2014"}, {"Title": "Never worked", "Author": "vellankinator \"Vellankinator\"", "ReviewID": "R5EW7X3Q8WGJO", "Overall": "1.0", "Content": "Bought it as a gift for a kid. Took it to my country and opened the package and loaded the batteries. Voila I see a glazed screen preceded by a weird zzzzz noise. By the time I came back the return time expired. Stupid of me not to know that I get what I pay for.", "Date": "April 11, 2014"}, {"Title": "OMG", "Author": "dk", "ReviewID": "R2GULO8XQAZEI0", "Overall": "1.0", "Content": "This camera is terrible. It is cheaply made and does not take good pictures. Will not recommend camera to anyone", "Date": "February 25, 2014"}, {"Title": "You get what you pay for........", "Author": "Cecilia Molina", "ReviewID": "R2ZLALOZQW9EZ9", "Overall": "1.0", "Content": "Worst camera I have ever bought.........don't waste your money. But, I guess the price should have warned me. I should have expected it.", "Date": "March 11, 2014"}, {"Title": "not worth the money", "Author": "Robert451", "ReviewID": "R2Z9WRSLUW98FN", "Overall": "1.0", "Content": "worked for a few pics and quit with a scrambled screen too much effort to return buyer beware my loss", "Date": "February 25, 2014"}, {"Title": "dont buy", "Author": "Carolyn Pagano \"msmamap\"", "ReviewID": "R1M88AII80TVCN", "Overall": "1.0", "Content": "piece of junk.  I thought the price was to good to be true.  It was a piece of plastic garbage. dont buy", "Date": "February 24, 2014"}], "ProductInfo": {"Price": "$29.99", "Features": "4x Digital Zoom\nAuto Flash and Red eye detection\nContinuous Shooting\n2.0\" Preview Screen\nAnti Shake", "Name": "Vivitar VX020-RED Vivicam 10.1 MP HD Digital Camera - Red", "ImgURL": "http://ecx.images-amazon.com/images/I/41YaTJ%2BwbLL._SX300_.jpg", "ProductID": "B008N9DRPA"}}