{"Reviews": [{"Title": "Genuine Nikon USA Extended (Warranty) Service Coverage", "Author": "Online Junkie", "ReviewID": "RTM2XCM4YF1C", "Overall": "5.0", "Content": "I purchased this Extended Service Coverage (ESC) a couple of weeks before my Nikon D800 turns 1 year old, so it is still under warranty. The suggested retail price of the ESC is $249.95 as per the envelope. P/N 11858. Nice that Adorama is selling this ESC for sixty bucks off the retail price. I think that's a great deal as any repair on my D800 would probably cost far more. I went online and added this purchase to my existing Nikon USA profile acct. but I was concerned because it also states \"You must register this ESC with Nikon Inc. within 10 days of your retail purchase of camera. See inside for details.\" But inside there was no more details. I obviously didn't purchase this ESC within 10 days of my camera body purchase, but the CS rep said not to worry, Nikon will honor this ESC as long as it was purchased before 1 year of ownership and while the standard warranty is still valid. Whew!I called Nikon USA at 800-NIKON-US and spoke with a customer service rep who instructed me that she will be sending me an email and I am to email her/Nikon a copy of my camera purchase receipt and my ESC purchase receipt. Once they have it on file, then I shouldn't need to show my receipts to the service dept in the future should my camera need any future repair in the next couple of years. But... you never know, so I recommend that you always keep copies of your camera and ESC purchase receipts just in case you need warranty service.Luckily, I live just a few miles away from the West Coast's Nikon USA Service Center. They moved recently and are now in Los Angeles and no longer in El Segundo, CA. It is cool that I can ride my bicycle to the service center which I did when I needed to have my D800 serviced under warranty as my pop up flash stopped working and I had them check my left AF, clean the sensor and they also updated my firmware... all free of charge under warranty. Nice that they offer this ESC for a pro camera body.Having the ease of mind that I have 2 more years of factory warranty for this expensive camera is very comforting to me, especially as I believe that I will not need to upgrade for at least 5-6 years as 36mp of resolution is huge and this camera won't be obsolete for a long time. I've read a few horror stories about those aftermarket extended warranties and no way I would buy one of those...If you are debating buying a D800, there's a few things you need to know. First, you need a really fast PC or you will go insane waiting for stuff to happen when post processing RAW files or using Photoshop on a older machine that is only 32 bit OS. Next, If you plan to shoot/process video, a quad core CPU is almost mandatory. I got an i5 3570k cpu that I can overclock if I feel the need for more speed, but so far, I'm cool with the current speed so I haven't tried to OC. If you are planning on getting a new PC, get the latest 4th Generation CPU's and if I was to build a new machine today, I'd go with the i7 quad core 4770k cpu. The 4th gen cpu's have a new graphics chip built in now and the previous generation cpu's don't have that.I upgraded my PC's in January before the 4th Gen were announced. You need a very fast and current 64 bit system to post process your D800 images in a reasonable amount of time. My new PC is an i5 quad core, Windows 8, 32gb ram and of equal importance is SATA III drives AND USB 3.0 i/o so that I can use my fast SD/CF cards that are 80+MB/s Read; 40+MB/s Write UHS-1 cards that need USB 3.0 in order to take advantage of their \"Ultra High Speed\".Summary: Great camera, great service, great price on this ESC and I highly recommend you purchase this ESC considering the high cost of this Nikon D800 camera body.", "Date": "July 3, 2013"}, {"Title": "For \"Just In Case\"", "Author": "Roy", "ReviewID": "RKC0VD3GAYXC", "Overall": "5.0", "Content": "Great, great camera.  Mine is a little more than one year old, and it is comforting to know I am protected for another two years, and the price is right.", "Date": "June 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0085QIJM2"}}