{"Reviews": [{"Title": "fantastic camera for the price!", "Author": "Camille M. Anderson \"Cami\"", "ReviewID": "RST8ZYWD0FERJ", "Overall": "4.0", "Content": "I just bought this camera today, so my review may be a tad ahead of myself, but so far I really like it. It's very straight forward and simple and takes AMAZING shots. It's super light and fits perfectly in my hands - which are small.  The front facing camera is awesome - I'm surprised Samsung is the first company to come up with this. Because we all know our forward facing phone cameras are crap. LOL. Literally, the only downside is the LCD screens are a little grainy, but I'm probably just still used to my Sony which had a beautifully crisp screen. And the pics come out great on the comp, so no complaints there!!", "Date": "August 1, 2012"}, {"Title": "It stopped working", "Author": "Marshall", "ReviewID": "R38CIM7DMXXV32", "Overall": "3.0", "Content": "I got the DV100 camera a few days ago, and I loved it because I have a 13 month old, and the little cartoon really helps. It originally would have got a 4 star rating because the shutter is a little slow, but other than that, it was fine. I hooked it up to the computer earlier to look at my photos and videos, and after about 10 minutes of being plugged in, it made a shutter sound, and disconnected from the computer. It was really hot. I tried to turn it on, and it did nothing. I plugged it back into the computer, and it would still let me view files. So I unplugged it, and tried to turn it on again. Still nothing. I let it cool for about half an hour. Tried again, and still nothing. I think the battery is shot. I don't think it's the camera itself. I'll give it till tomorrow. If nothing, then I'll exchange it for a new one.EDIT: Tried it about two hours later, and it finally turned on, but only long enough to see the battery meter flashing red. It is definitely only the battery that has the problem. It was fully charged when all this happened. I have a two year warranty on it, so I'm going to call Samsung tomorrow for a new battery. The camera itself, works great. It takes amazing pictures, and it is just a great buy. Just hopefully, this doesn't happen again, otherwise I'm going to say it's the camera that shot the battery. In that case, it's a bad camera.", "Date": "February 10, 2013"}, {"Title": "very good", "Author": "said aly", "ReviewID": "R3EQFN8IVXIK0T", "Overall": "5.0", "Content": "came on time it working very good  i will get some more  it rely helpful for me  i will tell all my friend about it", "Date": "September 18, 2013"}, {"Title": "Perfect!", "Author": "hey! :)", "ReviewID": "R38N3B2P1W3PG8", "Overall": "5.0", "Content": "Its the perfect size for convenience- and the front face camera is awesome! An awesome value for your money! buy it!", "Date": "July 1, 2013"}, {"Title": "EXCELLENT PRODUCT", "Author": "EDISSON SALAZAR", "ReviewID": "RRL7AR5YGUSML", "Overall": "5.0", "Content": "EXCELLENT PRODUCT, RECOMMEND YOU REALLY, LIKE MUCH ME, I HAVE NO COMPLAINTS ABOUT IT SO DO NOT MISS THE OPPORTUNITY TO BUY BECAUSE I CAN GIVE WITNESS THAT IF IS GOOD", "Date": "April 26, 2013"}, {"Title": "Samsung DV101 Camera", "Author": "Maria Gutierrez \"Maria G\"", "ReviewID": "R3PULL1WWT8PT3", "Overall": "1.0", "Content": "I purchased this camera 2 months ago, it's smaller than I anticipated. When I took the camera in to the store to print some pictures I was totally disappointed. I didn't get one clear picture, although it shows clear on the camera screen. Any solutions???", "Date": "February 11, 2013"}, {"Title": "I like it", "Author": "Ricardo", "ReviewID": "R2Y8RDCN6EM150", "Overall": "4.0", "Content": "It was exactly for wat I ask for, for that reason y like it and I feel good with my buy", "Date": "November 26, 2012"}, {"Title": "no memory card", "Author": "Paul Peñaherrera", "ReviewID": "R32I7BNH77E2K", "Overall": "3.0", "Content": "The camera has original memory card and did not come in this purchase. only drawback there is that the rest is good all.", "Date": "October 28, 2013"}, {"Title": "pretty good for the price", "Author": "Paul", "ReviewID": "R1CSHR2LS521F0", "Overall": "3.0", "Content": "The picture quality is very good, however the buttons on the device are fragile. The front LCD is the most exciting feature.", "Date": "February 24, 2013"}, {"Title": "dayana martinez", "Author": "dayana lucia martinez zamudio", "ReviewID": "RLCAFQVNZNDEJ", "Overall": "5.0", "Content": "recibiendo el producto hoy, en excelente condiciones, excelente calidad. gracias  recibiendo el producto hoy, en excelente condiciones, excelente calidad. gracias", "Date": "March 19, 2013"}, {"Title": "Comprador satisfeito", "Author": "lourival", "ReviewID": "R2LRP2884GI780", "Overall": "5.0", "Content": "O produto e de boa qualide, resolusao de filmagem e foto, Atendeu as espectativas. Seu vendedor cupriu prazo prometido para entrega, Ferece confianca.", "Date": "January 1, 2013"}, {"Title": "Good...", "Author": "Camilo", "ReviewID": "R1HOM3YHJ349E6", "Overall": "3.0", "Content": "When I thought about buying this camera, I thought I was going to take an excelent product, but do not feel well. One thing I did not like is that do not include memory card (you must purchase it separately). Among their duties, it do not have the ability to take a panoramic photo. The photos did not persuaded me in terms of quality. It has the advantage of the screen to the front, but does not look much the difference in quality.In short, it performs its function, but by the characteristics mentioned in the camera (like the 16 MP)  I thought I'd buy an excellent camera, but it is not. 3/5", "Date": "February 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008K831BY"}}