{"Reviews": [{"Title": "Awesome price for a great bundle", "Author": "Rachel", "ReviewID": "R18ATGL1EV6HHA", "Overall": "5.0", "Content": "Great Price for a great product!!! Everything works great, fast shipping. you really can't beat the price for this bundle! Bought the Canon t4i for video, love being able to record for 30min and shots look great!", "Date": "November 29, 2012"}, {"Title": "Canon Rebel T4i delivers quality!  Touch screen is amazing.", "Author": "musicprof53", "ReviewID": "R1JF4ZKQRY6LYM", "Overall": "5.0", "Content": "Wonderful camera!  Pictures are clear, focused, and brilliant.  The touch screen is amazing to use.  The bundled product I purchased through Amazon was received days ahead of the scheduled date of arrival.  No damage and all items were accounted for.  If you are looking for a great camera that will give you quality and simple to use, I would highly recommend this camera!  'Hope this helps you as the many reviews I've read assisted me.", "Date": "January 3, 2013"}, {"Title": "Great Buy", "Author": "Crystal Unke", "ReviewID": "R2A3GL0M08YHCR", "Overall": "5.0", "Content": "This is by far the best deal around.  I have been looking for an entry level SLR for awhile and finally settled on the T4i.  I ordered my camera around Christmas and thought that there would be more of a delay in shipping.  I was pleseantly surprise when an Amazon box was on my front door step the day after Christmas.  I priced out the T4i at Best Buy, National Camera, and Costco.  The body and two main lenses (18-55 and 55-250) would have been over $900 dollars alone.  So, it is nice to have the extras to boot!", "Date": "December 27, 2012"}, {"Title": "Totally Worth the Money", "Author": "Sameria", "ReviewID": "R3NHFWH95Q9U7M", "Overall": "5.0", "Content": "I have been researching this item for months at a time, and after all my research this was the best deal. You can't say no to it, there are some stuff you can probably do without, but with the price its a steal!! I received it a lot earlier then I anticipated, I was like a little kid in the candy store. I am now taking courses to learn how to use it to the fullest. I can't wait to snap away!", "Date": "January 9, 2013"}, {"Title": "Great for video!", "Author": "chassweeney", "ReviewID": "R2FJDXN11U0N92", "Overall": "4.0", "Content": "I am still learning about my new T4i.  I used it principally for video of basketball games so far and have not taken many stills.  The video quality is great!  The ~1 hour video files are huge!  I am contemplating the book in the \"Dummies\" series to learn more.I get positive comments on it wherever I go.", "Date": "January 20, 2013"}, {"Title": "Excellent camera and great value bundle", "Author": "Bryan - NYC", "ReviewID": "R1T2DL11S0AB6Q", "Overall": "5.0", "Content": "I have been looking for a decent quality entry level dSLR to video and photograph two new kids \"firsts\" - here it is.  The camera is light weight, we have enough stuff to carry around with kids. Web reviews are glowing for this camera. Having used it for the last week,  the quality of the pictures is fantastic, even without playing with the settings - that will take it to whole different level . A real step up in picture quality from our digital compact - Panasonic Lumix (which is good). Lots of useful extras. Very pleased with the purchase and the seller delivered everything in days and in perfect working order. Very happy.", "Date": "February 28, 2013"}, {"Title": "It's well worth the money.", "Author": "Chad", "ReviewID": "R9BC173QIC11H", "Overall": "4.0", "Content": "I sorta wish I'd saved a little more and sprang for the Nikon that's a little more expensive, but this camera is pretty awesome as well. The backpack is really really handy. The camera is legit if not quite the best in the price range. I'm very satisfied and would recommend this product bundle.", "Date": "February 17, 2013"}, {"Title": "It's great", "Author": "Carol", "ReviewID": "R1H6LKTAUAP61H", "Overall": "5.0", "Content": "This camera and extra items have been fun to play with and learn!! Taking a photography class to learn more!!", "Date": "January 18, 2013"}, {"Title": "Good Camera, accessories are spotty", "Author": "L. Clifner \"3k pgs/yr\"", "ReviewID": "R2LT6SQF7EWME", "Overall": "4.0", "Content": "The camera is really good and works well, the accessories are quite variable in their quality.Only criticism on the camera is that the plastic parts scratch easily and reveal white plastic underneath the black top coat, so it looks bad if you get scratch it.The tripod is handy, works well, and is light weightThe memory card is plenty big and fastThe screen protector is difficult to apply and scratches/smudges easily when trying to use the paper squeegee to smooth out the bubbles.The telephoto and wide angle accessories (not the Canon lenses, but the off-brand extenders) don't have very good optics and also cut a fair amount of the light.The UV filters are good.The lens cleaning kit is nice.", "Date": "February 6, 2013"}, {"Title": "Perfect !", "Author": "Amazon Customer", "ReviewID": "R3BPZ25QI64KLO", "Overall": "5.0", "Content": "This item came right after 2 days instead of a week, super fast ! Im in love with this camera. Although I know nothing about photography, this camera seems to work fine and I have no problem since the beginning. 5 stars !", "Date": "January 26, 2013"}, {"Title": "Great product", "Author": "Dave", "ReviewID": "R1Q57GWZ72LDBN", "Overall": "5.0", "Content": "Camera works wonderful, and package is quite a deal.  Pictures are super clear and with two little kids the quick shutter speed can catch every moment.  Worth the bundle, especially with the Canon rebates that were going on when I purchased the package.", "Date": "February 27, 2013"}, {"Title": "it is very good for the price", "Author": "Claudia", "ReviewID": "R1PB1T8A2AN374", "Overall": "4.0", "Content": "very good for the price, the camera met my requirements, the tripod and the bag were the items I didn't like..", "Date": "February 9, 2013"}, {"Title": "Worth the money", "Author": "MrImapcmd \"Kevin\"", "ReviewID": "R1GQNO6CGFEYM4", "Overall": "4.0", "Content": "I had been wanting to purchase this camera for a while and finally decided to pull the trigger.  After searching the web and many brick and mortar stores, I ended up at Cameta Camera via Amazon.This bundle came with everything a person needs, especially if this is your first DSLR Camera.I would defintely recommend this camera to people and point them directly to this bundle.", "Date": "February 22, 2013"}, {"Title": "Great package for fantastic price!", "Author": "Karen", "ReviewID": "REPQQSIH40F9D", "Overall": "5.0", "Content": "This is a fantastic package! I love the fact that the two main lenses are from Canon rather than a cheaper make, which turned me away from similar packages. The camera's great--I've taken it out a couple weekends now to get used to settings. Everything fits well into the backpack as well, with a little room to spare. I haven't yet used the tripod, but it seems stable and well-built. My only complaint is that the wide angle/telephoto lenses don't quite fit, even with the adapters; not sure if that's me, or the lenses, but it should be easy enough to get other adapters.", "Date": "February 18, 2013"}, {"Title": "Great deal!", "Author": "itsbec", "ReviewID": "RN8HV30R50M6P", "Overall": "5.0", "Content": "After lots of searching, I think this is the best deal out there on this camera!  Everything was in good shape when it arrived-- quickly!-- and was as advertised.  I am very pleased, both with the camera and its accessories.", "Date": "December 27, 2012"}, {"Title": "Great Camera", "Author": "Sam Okikiades", "ReviewID": "R2ZZN391NCYOI5", "Overall": "4.0", "Content": "The camera and accessories arrived ahead of schedule. It was Christmas in February.  Every item was packed with care. So happy with my purchase.", "Date": "February 11, 2013"}, {"Title": "Pro video user", "Author": "Jason", "ReviewID": "R4395K1R3LDSX", "Overall": "4.0", "Content": "Takes fantastic stills, but unfortunately at high iso the video is grainy. Compensate with wide aperture and good lighting. If you know your video stuff you should be able to produce high quality footage, however \"moiring\" on detailed surfaces, like water on a pond, is a bugger to remove in post. Great kit though, use the telephoto all the time. However the vivitar adapters cause quite a bit of distortion and the pictures appear more \"muddled\" when used. Had this camera for 1 year and I'm breaking down and buying a Full Frame to get the wide shots I want. Wonderful camera to cut your teeth on, as well as produce great content for the pro user. I still use it every day.", "Date": "January 7, 2014"}, {"Title": "Great deal", "Author": "WoodGuyNC", "ReviewID": "R2VKMAR5WOITBB", "Overall": "5.0", "Content": "Everything about this package deal right down to the extra battery was a smart purchase! I would buy again if needed.", "Date": "December 11, 2013"}, {"Title": "Awesome Bundle", "Author": "vance", "ReviewID": "R10LIXJB47EDFM", "Overall": "5.0", "Content": "I was really hesitant to buy this camera but you know having your first baby definitely spurs you to buy a good camera for the memories. This bundle is really good! My friend was scaring me saying what if you don't get the genuine lenses and other things. Well, I got this and everything was exactly as described. If you try pricing out the items individually it will cost you more. So figure out what you think you will need and then if you need majority of the items, this is a great deal. Now to figure out how to use the camera's awesome stuff... That is a different story...BTW, sports mode is so far my favorite. Good Luck!", "Date": "August 27, 2013"}, {"Title": "Canon EOS Rebel T4i DSLR Kit Rocks!", "Author": "Darrel S. Fleischman", "ReviewID": "R1IC768I66FPZW", "Overall": "5.0", "Content": "The Canon Rebel T4i is my first DSLR.  For a decade I used a Canon PowerShot G-1, which was a good all-purpose camera for its era.  The jump from 3.3 MP to 18 MP was a perfect move for me, a long-time amateur photographer (50 years).The T4i has so many features, I'd recommend downloading the user manual in .pdf format before purchasing.  It helped me decide between the T4i and the Canon 60D.  The old PowerShot G1 was extremely slow compared to the T4i.  And the G1 ate battery power rapidly with the LCD screen in use.  Not so with the T4i.I followed my son's youth baseball team's games for 2 months, capturing some great candid portraits and many great action shots (my opinion :-)).  My main subjects are landscapes, sports action, wildlife, night shots, table tops, and automobile photo shoots.With a little research in the user manual, the T4i does all those (and more that I haven't explored yet) admirably. Most of the time, I use the P mode.  Auto tends to employ the built in flash at unexpected times, so I program the camera to not flash unless I want it to.I bought the photive camera battery grip to go with, and it is an excellent addition to the T4i, balancing the camera and the 55-250 mm IS lens very well.I already had a good tripod, so I gave the one in the kit away, it being a wee bit light for the T4i with battery grip attached.The card reader is handy, avoiding having to attach the camera to my computer.Over all, the Canon EOS Rebel T4i kit is the best purchase I've made this year.", "Date": "August 9, 2013"}, {"Title": "Great for everyday and professional photography!", "Author": "mandytrimm", "ReviewID": "R3VBR7KE8D8AKH", "Overall": "5.0", "Content": "I'm a digital artist and stock artist, and photographer hobbyist so I need the best quality photos I can take. I'm not a photography major (unlike all my friends) so I won't try to explain all the brilliance of this camera and it's equipment (as they all could). I WILL say it arrived in perfect condition with ALL items listed in description.All the manuals are very helpful in learning the basics and if you grab the 'For Dummies' book it's basically a snap. For the most part you don't even HAVE to read the manual! I started playing with it straight out of shipping and picked up on what everything did in a couple hours. So basically decently easy to use and learn with simple practice.I use it all every day and have had no problems whatsoever. The lenses are fantastic and allow me a large range of zooming capabilities and high detailed photos. Pictures are very large, very crisp/detailed, and beautiful. My clients/models, friends and family are impressed with the photos I am able to take and the quality of them as much as I am. Definitely a great buy. Definitely worth every cent. If you are going to do pro photography and stock photography and you can fit it in your budget this is definitely a camera worth owning.The backpack holds everything in this bundle and THEN SOME. I love it so much! It's so easy to put everything away and get everything out in limited time. It feels really sturdy and seems to protect my gear from breaking even from a hard fall (experience tells me this). The memory card holds over 400 photos for me at over 5000px a photo. The filters are a must to keep on your lenses. The zoom efficiency on the lenses are fantastic! And the tripod is very sturdy and great! I use the tripod religiously when I do my stock photography.Everything is in great condition and works perfectly. Unfortunately as helpful as i can get. Hope this helps even a little.", "Date": "August 7, 2013"}, {"Title": "Great camera", "Author": "Smcress316", "ReviewID": "R2MJV0ETPMHY7M", "Overall": "5.0", "Content": "This camera takes great pictures and is easy for beginners to use as well as having everything that an experienced photographer could want.  The stabilization feature works great to help deliver excellent photos even from a moving vehicle or boat. I would highly recommend this camera.", "Date": "July 19, 2013"}, {"Title": "My daughter loves it.", "Author": "curtis w.", "ReviewID": "RRAUTETP2ZT7D", "Overall": "5.0", "Content": "My daughter is becoming quite the photographer and she needed better equipment.  This package is a great buy and worth the money.", "Date": "June 24, 2013"}, {"Title": "Just what I need", "Author": "walter", "ReviewID": "R1JRLLH1PPXWNE", "Overall": "5.0", "Content": "I'm learning fotography so this camera is all that I expected, everything you see on descripcion of the camera and kit is what you get, the only thing that I don't like it is that the camera make some noise when autofocus recording.", "Date": "May 25, 2013"}, {"Title": "Great Camera & Kit", "Author": "Emily McClimon", "ReviewID": "R2L2INAJ4YEFN9", "Overall": "5.0", "Content": "We are going on a trip to Europe for a few weeks and wanted to get a nice camera to have for this trip and beyond when we have a family. I think this was the right choice! Glad we got this package and excited to put it to its full use on our vacation. Got exactly what the listing said we would. Very pleased.", "Date": "May 15, 2013"}, {"Title": "Very happy with my purchase!", "Author": "LeeAnna", "ReviewID": "R2ZQZTPJYDPKI8", "Overall": "4.0", "Content": "I was a little worried about making such a big purchase online but as soon as it showed up my worries disappeared completely! I was so happy at how fast it was delivered! Everything came brand new and I love my camera! Haven't had a chance to use all the extras yet but plan on using them as soon as I get a chance! Only thing I didn't like was the wireless shutter release that came with the bundle but I purchased another so it wasn't a big deal! I recommend this purchase to anyone looking for this camera! I think you will be just as happy with it as I am!", "Date": "May 9, 2013"}, {"Title": "camera is great, tripod not so much...", "Author": "Devious Tony", "ReviewID": "R3T5N5Y2OLZFVX", "Overall": "3.0", "Content": "Shipping was on time, everything came in one big box.  The card reader isn't the same one that is shown in the picture but it works.  The tripod on the other hand is a piece of junk.  The camera mount doesn't even stay on the tripod securely, it comes loose after moving it around a bit.  If you were to hold the tripod at an angle the camera is surely going to fall right off.", "Date": "April 23, 2013"}, {"Title": "Unbeievable Bundle/Price!", "Author": "Kevin Sanderson", "ReviewID": "R2LI7MEYS2UOCX", "Overall": "5.0", "Content": "Everything was exactly as advertised and the service was super FAST!  I will definately purchase products from this company again!", "Date": "April 8, 2013"}, {"Title": "Excellent sevice", "Author": "R. Shah", "ReviewID": "R1JQ493HSF2BMA", "Overall": "4.0", "Content": "Received in time.No problems,all items were there as listed.Very good camera,beginning to get oriented.looks ideal for new DSLR user mmaking transition", "Date": "March 30, 2013"}, {"Title": "Canon Rebel T4i", "Author": "Chris Ross", "ReviewID": "R2TLKBQSK04ZAD", "Overall": "5.0", "Content": "Product came early and included everything as promised.  Products are all of high quality and each compliment the camera well.  After a lot of research, this package could not be beat.  The camera is fantastic!!!  Thank you!", "Date": "March 2, 2013"}, {"Title": "Eos digital", "Author": "William", "ReviewID": "R17ZTYQP3WGZ63", "Overall": "5.0", "Content": "This camera combo is a great investment. It takes beautiful professional quality pictures without the pro camera price!! A must for any one wanting to start shooting pics like a pro!", "Date": "February 7, 2013"}, {"Title": "Outstanding Package", "Author": "Steve", "ReviewID": "RQE4KOZGRLYO7", "Overall": "5.0", "Content": "Very pleased with everything I received from Cameta Camera. It was the same price as just the body and two lenses at a local camera store , so it was like getting the extra items for free. Fast shipping. I wont go into the camera review as others have done far better than I could. The only thing I will mention is the slow auto focus when in movie making mode. Go on you tube and search for Canon T4i test videos to see what I'm talking about. Not a big deal for me as I wanted to get back into photography and wanted a good beginners camera with room to grow which is what the Rebel series is for and this is the best Rebel, Canon offers. Takes great pictures, and great HD video if you learn to use manual focus.", "Date": "February 2, 2013"}, {"Title": "A must have", "Author": "michelle", "ReviewID": "R7HVJ670H9YCB", "Overall": "5.0", "Content": "Everything you need for a starter dslr camera, plus some!!! I'm in love!! I highly recommend this camera, the price for this kit can't be beat!", "Date": "March 6, 2013"}, {"Title": "A câmera dos meus sonhos", "Author": "Fred", "ReviewID": "R3J59KMD31PD2Q", "Overall": "4.0", "Content": "Quando decidi comprar, imaginei apenas o \"Body\", em função do preço. Mas o kit oferecido pela Amazom.com superou minhas expectativas, e comprei todo o material para realizar meu hobby com perfeição. Muito bom.", "Date": "February 10, 2013"}, {"Title": "like like like", "Author": "Span2", "ReviewID": "R39VXCTV1SDKJ3", "Overall": "5.0", "Content": "This product is so much worth for the money we paid. The picture quality is well beyond imagination, clear, bright and the best.", "Date": "March 6, 2013"}], "ProductInfo": {"Price": "$1,399.00", "Features": "KIT INCLUDES 14 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon EOS Rebel T4i Digital SLR Camera Body & EF-S 18-55mm IS II Lens + <2> Canon EF-S 55-250mm II IS Lens + <3> Transcend 32GB Class10 SD Card +\n<4> Spare LP-E8 Battery + <5> Vivitar 58mm UV Glass Filter + <6> Additional Vivitar 58mm UV Glass Filter +\n<7> RC-6 Shutter Remote Control + <8> Zeikos DSLR Sling Backpack + <9> PD 2.5x Tele & .45x Wide Lens + <10> Precision Design 58\" Tripod +\n<11> PD 6pc Complete Cleaning Kit + <12> PD SDHC Memory Card Reader + <13> PD Memory Card Storage Wallet + <14> LCD Monitor Screen Protectors", "Name": "Canon EOS Rebel T4i Digital SLR Camera Body & EF-S 18-55mm IS II Lens with 55-250mm IS Lens + 32GB Card + Tripod + Battery + Backpack + Filters + Remote + Telephoto & Wide-Angle Lenses + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51LLQmXmxZL._SY300_.jpg", "ProductID": "B008R00H5S"}}