{"Reviews": [{"Title": "Amazing Value! Don't pass this one up!", "Author": "digitalicecream", "ReviewID": "R2JWVFMS53VUGV", "Overall": "5.0", "Content": "Crisp photos! Integrated wifi, and the ability to upload directly to Facebook, Picasa, Youtube (videos), and Photobucket make this camera a winner. There's even a built in panoramic photo mode a la Android 4.0+ camera (take one continuous panoramic shot). It even charges from a micro USB adapter that doubles as your pc connector. So anywhere you can connect a USB cord, you can charge the battery.This is a perfect upgrade for our point and shoot needs and I'm really glad we were able to purchase it on sale today at a local big box store.", "Date": "June 24, 2012"}, {"Title": "Great", "Author": "Abraham", "ReviewID": "R1QHX2S4484SCH", "Overall": "5.0", "Content": "Great camera, great connectivity, simply great! The quality of the photos and videos its amazing, a great purchase, so easy to use that you can do it with one hand. Great in every aspect. The battery life is also a great feature but make sure to buy a large microSD if not the you will run out of memory before you are out of battery.", "Date": "October 25, 2012"}, {"Title": "Excellent camera for the price", "Author": "Peteris Zeltins", "ReviewID": "R2I1L0WWSNI15F", "Overall": "5.0", "Content": "Considering the price this camera takes very good quality pictures.Pros:Picture qualityCompact sizeCons:Low light performance is mediocre (this aint no DSLR)Wifi functionality requires installing Samsung software on the computer. There is no feature to automatically upload all new pics to the computerPower button sometimes doesnt react to first keypressModes have to be switched via on-screen menus, there is no rotary modes switch like on other camerasAll in all the drawbacks are mostly minor (except for low-light, but thats to be expected at this price level). I still give it 5 stars for compact size and overall pic quality.", "Date": "March 22, 2013"}, {"Title": "Love it!", "Author": "Shelley BR", "ReviewID": "R2PXOMNPQS41WE", "Overall": "5.0", "Content": "Love my new camera.  Pictures are clear, even when things are in motion.  Does not work quite as well in dim lighting.  WiFi capability is nice, but did not work when I sent some pictures from Ireland to US email addresses.  Maybe I did simething wrong, or WiFi signal was weak.  Has worked well since then in US.", "Date": "December 5, 2013"}, {"Title": "The Samsung ST200F Long zoom Smart Camera", "Author": "Gary B", "ReviewID": "R48B6G6CH00J1", "Overall": "5.0", "Content": "Samsung puts out a great camera. There isn't anything this camera won't do!!!I would recommend this camera to anyone.", "Date": "August 3, 2013"}, {"Title": "SD card for camera", "Author": "Tracy D", "ReviewID": "RTGAKYD35EWJ7", "Overall": "3.0", "Content": "The SD card advertised to go with this product is not the correct one. I purchased the camera and suggested items and they do not go together. Camera is ok, but not happy I wasted money on items I didn't need. There is no description on the camera for what size SD card it takes, so there was no way to know. Why would things that not work with this camera be advertised as going together? Disappointed.", "Date": "December 25, 2012"}, {"Title": "needed to buy mem. card extra, or i only get like 3 pics on it. also not mac compatable", "Author": "Mike Harris", "ReviewID": "R1RPDWFOLSU40W", "Overall": "3.0", "Content": "very nice cam, just didnt let me know i needed to buy a mem. card for it, they are cheap but its not ready to go out of box. and its not mac friendly which sucks cause i did not research that, and love me mac book. at any rate sweet pic quality and cool features for it, just havent got the mem. to play much. and the WI-FI seems to suck so far, as it will not connect to my WI-FI....", "Date": "December 11, 2012"}, {"Title": "Great Features. Works well with Samsung Galaxy phone", "Author": "John S \"Avid audible listener for over 10 years.\"", "ReviewID": "RKK8S5MDIBVBX", "Overall": "5.0", "Content": "I have a samsung Galaxy phone, so my review may be biased by the fact the phone and camera work well together.  With the apps I downloaded to Galaxy phone, I can use my phone as a remote viewer. The camera can easily talk to phone so I can send pictures via my cellphone. One thing I love is that it uses a standard micro usb charger so my cellphone charger works with camera.  Only wish as that it had a touch screen.", "Date": "September 21, 2013"}, {"Title": "sean", "Author": "Sean D.", "ReviewID": "R1Q5CCC5EAC08E", "Overall": "5.0", "Content": "everything is great about this camera. ordered as gift for my wife, she loves it. easy and fun. ordered extra battery pack (good) plus case and extra memory. problem with that is that when i ordered the last three as recomended i found out when i got it that i needed a mico memory, not the one they recomended. thanks amazon, now i have to buy another memory before she can use it.", "Date": "December 19, 2012"}, {"Title": "Great price", "Author": "TONY S WOO", "ReviewID": "RLH9TBGLLA3J9", "Overall": "5.0", "Content": "Great price for picture quality and feature set.  Good quality materials.  Software could be more efficient.  For example, even if there is only one email address set, but you would still need to go to a drop down box to select that one email address to send a picture out.  On the whole a good camera for its price point.", "Date": "January 1, 2013"}, {"Title": "Compact but poor image quality", "Author": "Sergey", "ReviewID": "R3ULM0FJJPJDFS", "Overall": "2.0", "Content": "This camera is very slow and has poor pictures quality. It is so hard to focus that you always miss a moment. Smart function is useless, unless scene is static", "Date": "September 9, 2013"}, {"Title": "Good Little Camera", "Author": "Eclisiast", "ReviewID": "R1D7QCNKJF7KFO", "Overall": "5.0", "Content": "I bought this for a cruise because I was tired of the terrible grainy photos you get with a camera phone. This thing did a fine job of fulfilling my needs. The photos are crisp and the 10x zoom is nice. One thing I noticed is that it doesn't handle blue light very well. I was at a music festival and anytime the stage was washed in blue light it lost most of the details and caught mostly silhouettes. Also, if you're doing a video recording, and you go to zoom, while zooming the audio drops a bit but then is restored after the zoom is finished. Kind of odd, but not a terrible thing.Being compact, it was nice to be able to shove it in a pocket and not have to deal with a bulky camera hanging around my neck.I definitely want to get something better in the future so I can capture moments more perfectly, but this camera does everything you'd expect from it's features and does them well.", "Date": "March 3, 2014"}, {"Title": "FANTASTIC PURCHASE", "Author": "Cody Costantino", "ReviewID": "R3EEQC3GSS9H6A", "Overall": "5.0", "Content": "This camera was very worth the money spent. Fast shipping. The camera itself takes fantastic pictures and has more features than I know what to do with. Even though it was used, the camera is in mint condition and the seller sent it in the original packing with all of the original instructions, software, and hardware. I am very happy with this purchase.", "Date": "February 28, 2014"}, {"Title": "Camera", "Author": "Sandy Ferstl", "ReviewID": "R2HW0NTYK1J1V4", "Overall": "5.0", "Content": "This camera is an excellent buy.  It was exactly what I have been looking for and the price was extremely reasonable.  Will purchase from Amazon again.", "Date": "February 15, 2014"}, {"Title": "Wireless photo transfer", "Author": "URL98902", "ReviewID": "R19YD79G9F3IQC", "Overall": "5.0", "Content": "I originally ordered this from another supplier, who sent me an ST200 camera (no wireless transfer).  After returning it for a credit, I ordered this and it has been everything I have expected.  It has zoom and smart photo taking.  I have taken both photos and videos with no problems in picture quality or transfer.", "Date": "August 27, 2013"}, {"Title": "Best Point and Shoot for the Money!", "Author": "airgunshooter", "ReviewID": "R1YK6PTB2H6L6D", "Overall": "5.0", "Content": "This is an EXCELLENT digi-cam, and could not ask for any more for the price!Buy the Wasabi Power Battery and Charger Kit for Samsung BP85A, EA-BP85Afor backup power, for it is a really great bargain too!I got the 16  gig Sandisk for memory and holds around 2000 pics and plenty for movies!", "Date": "August 22, 2013"}, {"Title": "perfect camera for me", "Author": "Pat Tri Cia", "ReviewID": "R1Z4CY4Z3V3MZ0", "Overall": "5.0", "Content": "Perfect camera for me at a perfect price.  The description does not say you must have a micro-card for it - so be sure you get that.  I got the one that has the adapter for the regular size card too - which is a good idea to have.  I'm not big on using it for video - but for what I use it for, mostly point and shoot - smart-automatic setting, portrait, etc. it's great!  Very sharp, clear photos.  Nice size and the charge lasts a long time.", "Date": "July 29, 2013"}, {"Title": "Great!", "Author": "María Fernanda", "ReviewID": "R2LPSNNBNRKCFO", "Overall": "4.0", "Content": "It's useful and came in good conditions. I liked it was quickly to come. Hope to enjoy it for long time", "Date": "July 6, 2013"}, {"Title": "Great purchase", "Author": "Deborah Neptune", "ReviewID": "RLHISPAX93L4V", "Overall": "5.0", "Content": "This camera syncs with my Samsung 4, like the ease at which you adapt to this camera not complicated, thanks.", "Date": "June 26, 2013"}, {"Title": "Really great camera for you money", "Author": "Javier Pintos", "ReviewID": "RTR0QMXERET3B", "Overall": "5.0", "Content": "Is a great camera, with a small price. Manu interesting functions like the wifi are of this a great option", "Date": "June 12, 2013"}, {"Title": "Disappointed in the Wifi functionality.", "Author": "Niles Donegan", "ReviewID": "R1GJQN7X30UM1J", "Overall": "1.0", "Content": "I bought the Samsung ST200F (with Wifi) so that it could communicate with my phone and computers.  The camera can send photos through the network to Skydrive, but the MobileLink app says \"A camera that is not compatible with the current application has been connected.  View supported applications.\" in a pop-up, and when I click the \"End\" button below up, the app closes.  The camera functions great as a camera, but buy it only for that, and not with the expectation of any sending of photos outside of Skydrive.", "Date": "May 28, 2013"}, {"Title": "GOOD CAMERA - DELICATE THOUGH", "Author": "E. Jung", "ReviewID": "R34NARW4OPECYD", "Overall": "3.0", "Content": "I bought this camera as a Christmas gift.  It worked really well, once I had the appropriate MICRO MEMORY CHIP.... installed in January.  It survived my trip to the London and Amsterdam.  Unfortunately, it did not survive the trip from Amsterdam to London.  The display screen was cracked in my hand luggage (75 minute flight).....  My old digital Cannon camera survived the flights (I brought it because I was not sure if I would be able to figure out how to use the new Samsung camera...).I was able to pull the images off the camera via USB cord.  Thankfully!Samsung warranties the item and repaired it within a week of mailing it to them - I had it back within 10 days.It works as good as new - it was pretty much new - had physical possession of it for less than two months and took three (3!) test photos with it prior to the trip.The flash - light function is not as advanced as I expected (high-low light contrast).  Otherwise, it was a nice upgrade from my Cannon (purchased for $399 in 2007) - more megapixels and functions.  I tested the wireless function.  I was able to email photos from the camera BUT it took a while to type in the email addresses.  It is a fun new party-vacation camera.  The battery life is pretty good and there is a gauge - so I will know when it is running down.  My previous camera did not have a gauge and died in the middle of a trip.If you don't want to walk around with an iPad or a limited smartphone, this is a pretty good camera.", "Date": "May 2, 2013"}, {"Title": "Great camera", "Author": "Marsha M. Pratt", "ReviewID": "R2SL8GA7IV224Z", "Overall": "5.0", "Content": "Simple to use and the Facebook posting is wonderful.  Happy I bought it.  I am a sucker for the newest pocket cameras.", "Date": "April 15, 2013"}, {"Title": "what a good camera", "Author": "Juanmcc", "ReviewID": "RAXWOKGTL97T9", "Overall": "5.0", "Content": "It is a really good camera, works as I expected and even better grate pictures and all the function make it a really good choice.", "Date": "April 8, 2013"}, {"Title": "Really liked it..", "Author": "Bruce O", "ReviewID": "R21N3DO6ICO4OO", "Overall": "5.0", "Content": "Got this as a present for my wife and she really likes all the features..its not an android but as long as we can download instantly to our Skydrive, we don't worry in losing our picks or not having any space..great price too..", "Date": "March 17, 2013"}, {"Title": "jesus navarro", "Author": "jesus navarro", "ReviewID": "R3EWY8RMSKJAEH", "Overall": "5.0", "Content": "edit the camera is spectacular, has several useful applications, the wi-fi is one of the most important characteristics is sharp imageexcellent article, I got just what I expected, thanks", "Date": "February 13, 2013"}, {"Title": "Ditto other comments on misguided memory card purchase: Samsung ST200F SMART WiFi Compact Digital Camera - Black 16MP 10x Optica", "Author": "YosemiteJMF", "ReviewID": "R1HK5CWPG94CCK", "Overall": "3.0", "Content": "I copied this same comment from a prior review, as I fell victim to the same issue: \"The SD card advertised to go with this product is not the correct one. I purchased the camera and suggested items and they do not go together. Camera is ok, but not happy I wasted money on items I didn't need. There is no description on the camera for what size SD card it takes, so there was no way to know. Why would things that not work with this camera be advertised as going together? Disappointed.\"", "Date": "February 4, 2013"}, {"Title": "Good camer and fasty delivery.", "Author": "Surfergirlsublime", "ReviewID": "R3NJLACNO87CWT", "Overall": "4.0", "Content": "The camera was delivered fast. It does not however come with a memory chip, so you are not able to use it right away..This was a bummer since it was a Christmas gift for my Mom. I was hoping she could use it to film the kids at Christmas morning. Seems to take a decent picture thjough but I have still not figured out how to get it to post to Facebook yet. This is probably my fault tho.", "Date": "January 28, 2013"}, {"Title": "gr8 camera", "Author": "timothy a monaghan", "ReviewID": "R1X923MGRD2I50", "Overall": "5.0", "Content": "great camera - it was a present and she loved it - I guess I have to write 9 more words", "Date": "January 17, 2013"}, {"Title": "nice camera", "Author": "TAMMY KALHORN", "ReviewID": "R15YQPEAOIB14M", "Overall": "3.0", "Content": "this camera takes great pictures1the only real thing i wasn't so happy with was how itconnects to send pictures and the fact that youcan't store the #'s to which you are sendingso you must re enter them each time", "Date": "January 14, 2013"}, {"Title": "Just an OK camera.", "Author": "Aramis Marquez", "ReviewID": "R3F1V3BKQJR3PP", "Overall": "3.0", "Content": "The camera itself does not take GREAT pictures. I've played with the settings many times and the pictures come out just a bit above decent. Also, the uploading over a wi-fi connection is painfully slow. I know it's not my connection because i've had the same problem everywhere. It is definitely much easier to upload with the usb cable connected to the computer. I wouldn't recommend it to anyone.", "Date": "February 7, 2013"}, {"Title": "Not good for bright light situations", "Author": "pjaatpdx", "ReviewID": "R2P29NL04MW5KT", "Overall": "1.0", "Content": "Point and shoot cameras no longer come with optical viewfinders (except Cannon Powershot). Since I purchased this to mostly take snowshoe pictures, it was of no use in bright sunlight as it was impossible to see subjects on the LED screen, which is the only way to compose pictures. The menu and selection buttons are very small, and can tend to give you incorrect selections unless you are very careful in pushing them. Additionally, every time you turn on the camera, by default it asks you to select between 5 settings for light, exposure, etc. Time consuming....it should just keep the one previously selected until you WANT to change it. I liked my Cannon Powershot much better...guess I'll get it repaired.", "Date": "February 21, 2013"}, {"Title": "camera review", "Author": "john E. Hamilton", "ReviewID": "RM96LMNR9FB6F", "Overall": "4.0", "Content": "I love this camera  It is easy to use ,and I have recommended it to friends and family. It,s a must have.", "Date": "December 15, 2012"}, {"Title": "Samsung ST200F Long Zoom Smart Camera - Black (EC-ST200FBPBUS)", "Author": "Vijay Patel", "ReviewID": "R2YV56G876KQEG", "Overall": "5.0", "Content": "I was a big fan of Sony but now I changed my mind after using this camera and couple of other Samsung products", "Date": "September 21, 2012"}, {"Title": "Nice little camera", "Author": "Doris J.", "ReviewID": "R97GU61V27GY4", "Overall": "3.0", "Content": "This seems like a nice little camera.  We've only used it once and we did email from it which was nice.  Time will tell but it seems like a nice unit.", "Date": "December 26, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "SMART camera - Shoot, Store, Share\nInstantly Share (Wi-Fi)\nUltra slim-line body with 10X Optical Zoom\n3\" Intelligent LCD\nLive Panorama", "Name": "Samsung ST200F SMART WiFi Compact Digital Camera - Silver 16MP 10x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41QZ-pYIBNL._SX300_.jpg", "ProductID": "B008RCW14Q"}}