{"Reviews": [{"Title": "Fantastic Entry Level DSLR", "Author": "Evil Von Der Scratchy", "ReviewID": "R1NQHFZRHI7FF0", "Overall": "5.0", "Content": "I did hours of research before purchasing the Nikon D3200 with the 18-55mm standard lens along with the additional 55-200mm lens.  I am far from an expert with any kind of SLR camera, having only experience with the normal point and shoot variety.  I didn't want to shell out excessive amounts of money for a camera that would overwhelm me.I was interested in being able to continue taking the quick snapshots that I usually do with my point and shoot, but also extend my ability to control more aspects of my pictures outside of just pressing the shutter button.  I really wanted to have the ability to dictate exactly what would go into a photo that I take, what parts of it would be in focus or out of focus, and also be able to really extend the zoom range for distances I could never get with a basic camera.I was impressed with how easy this camera was to use.  Directly out of the box, without reading any instructions the familiar picture format settings made this camera an easy transition for a rookie like me.  The main dial on the top of the camera has the icons that are recognized easily as the same picture formats that are found on the basic camera so I could just turn the dial and fly between Automatic, Portrait, Action, Landscape, and even a new \"Child\" setting just for chasing around my three year old!The lens was easy to manipulate, and with Nikon's \"VR\" or vibration reduction capability built into each lens, the process of bringing a distant shot in close was a snap.  Changing out a lens is a breeze as well.This camera is perfect for anyone like me looking to step up their own photography skills.  I am very happy that I chose this camera for my new adventures.", "Date": "June 20, 2013"}, {"Title": "The best DSLR  camera", "Author": "AP", "ReviewID": "R269WI06X4O94L", "Overall": "5.0", "Content": "It's been close to 4 months or so since I got this product. It's really great DSLR camera.  It has all the features of fancy DSLR at very affordable price.  I compared it with my friend's cannon EOS 60D  and I feel this is way better and is packed with many more features!!  Well if you are a professional photographer who takes pictures for living then you might want to research  but for rest it's perfect camera.I take pictures of my kids in contact sports and pictures are amazing. It takes like 4 frames in a second!!! No blurs or pictures that looks shaken. It  is  24 MP so pictures are fantastic. I think it is probably worth every cent I paid for it so far.Drawback is the zoom is bulky to carry around. It is annoying to carry camera, tripod and zoom around when you travel a lot. But it is still smaller and lighter than most DSLR's.", "Date": "October 15, 2012"}, {"Title": "the product is exactly what I expected", "Author": "Mag", "ReviewID": "R2WJ0X4KIQBKQZ", "Overall": "5.0", "Content": "item doesn't come with memory Card so I'd suggest you buy one before you get one. has great battery life so far.", "Date": "September 7, 2013"}, {"Title": "Make sure what you are buying stay away from the lower priced sellers.", "Author": "R Lisius", "ReviewID": "R3M70H5CLCY59G", "Overall": "5.0", "Content": "This Nikon D3200 24.2 MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR and 55-200mm f/4-5.6G ED IF AF-S DX VR Zoom-Nikkor Lenses is a great package and the camera and lens are out standing if this is your first time buying DSLR camera or if your looking at upgrading from a lower model. You should be paying 646ish. The lower priced models are most likely are an IMPORTED or \"Gray Market Item\" which means they have no USA Warranty. Make sure you go to Nikon USA website and look at there authorized retailers it will list Amazon but they also list other sellers too like Beach Camera and Cameta Camera they both are sellers here on amazon. If you know the zip code for the seller that is the best way to find out.", "Date": "February 25, 2014"}, {"Title": "No regreta", "Author": "R. Meling \"Habitat guy\"", "ReviewID": "R2C4DG8ZAPJUTM", "Overall": "5.0", "Content": "I thought about purchasing the outgoing Nikon D3100 to save a couple hundred dollars, but finally decided that I intend to use this device for several years, electing to get the latest generation.  I don't regret it.  The extra resolution of the camera allows a great deal of zooming of the pictures. This allows us to take pics of stuff that is a bit too far away, but still blow it up to a decent picture.There are far more features that I've yet to explore but I look forward to it.The big negative:  I still can't believe they wouldn't include SOME kind of memory card.  It's so absurd that they would ship you a camera that you can't use right out of the box!", "Date": "May 5, 2013"}, {"Title": "Great Camera!", "Author": "Rmt123", "ReviewID": "R11PVTFCYWTFV9", "Overall": "5.0", "Content": "Purchased this camera for a vacation I was taking. This camera performed flawlessly, and produced great pictures. I had previously been a professional photographer, but for several years I have been using a \"point and shoot\". I wanted to get back in to using a higher quality camera, but wanted something that would allow me to easily take control of the settings, and still allow me to use an automatic mode when I needed to shoot quickly. This camera gave me exactly what I wanted.The lenses that were provided were excellent for this price point, producing very sharp pictures, and great color rendition. The autofocus was extremely fast and accurate, and the image stabilization was great (I was able to handhold at 1/15 of a second, even fully zoomed out). The controls are very intuitive after you use it for a little while.The only possible suggestion I could make would be to incorporate the Wi-Fi feature without the need for additional hardware. Otherwise, I am completely satisfied.", "Date": "May 13, 2014"}, {"Title": "Great buy for the price.", "Author": "jessica", "ReviewID": "R1RGPNIMVW8THE", "Overall": "5.0", "Content": "I am very impressed with this camera. It takes great picture and is easy to use for a beginner. There are a lot of features that I need to learn but it is very user friendly.", "Date": "February 4, 2014"}, {"Title": "Take pictures like a pro", "Author": "Olivasrebel", "ReviewID": "RA24NTR31OEMS", "Overall": "5.0", "Content": "This camera is a smaller SLR and it still takes great pictures of my family and scenery. I would recommend this to anybody.  Battery life is amazing as well it takes like 500+ pics before you have to change out the battery.", "Date": "January 7, 2014"}, {"Title": "Used Product", "Author": "Elixir", "ReviewID": "R2YM7XMO3ERZCA", "Overall": "3.0", "Content": "I received the product and it seems to be used already. The original Nikon box is missing. 3 small boxes, which should be put together in a big one Nikon box, were opened before and have damages. It is quite said, because this camera was a birthday gift for my loved one.", "Date": "August 17, 2013"}, {"Title": "Love it! Great for amateur photographers!", "Author": "David M. Thomsen", "ReviewID": "R1T6QLKMVAA22Z", "Overall": "4.0", "Content": "I am by no means a professional photographer. I bought this camera because I wanted to take better pictures. Something has to be said about the seller Cameta Camera, I am in Afghanistan and they still shiped this camera to me all the way out here! AWESOME! I was having a really hard time finding someone to ship APO AE. thanks Cameta Camera! Great camera! Easy to understand! Easy to use! Great pictures. Taught me a lot! The only thing is now I want to upgrade! but I'll still keep this!", "Date": "August 20, 2013"}, {"Title": "Great entry level camera", "Author": "Jo A. deJournette", "ReviewID": "R2SHEA038VE4YB", "Overall": "5.0", "Content": "My first DSLR, and I'm very happy.  I upgraded the glass (lens) and haven't looked back.  Nice features, manageable size and weight, and produces great pics!", "Date": "July 27, 2013"}, {"Title": "Good Camera for Beginners", "Author": "Raghuveer Undinti", "ReviewID": "R37OB1EJIDZVAS", "Overall": "5.0", "Content": "This is a beginners camera. If you want to learn photography, this would be the ideal one to have. I'm very much amazed by the quality of the pictures which I have taken. I surely recommend this if you are a starter.", "Date": "April 11, 2014"}, {"Title": "NIKON are the best", "Author": "D. McNulty", "ReviewID": "RPDUVLB6A3FMV", "Overall": "5.0", "Content": "I bought this for my daughter as a Christmas gift. She uses it all the time and enjoys it very much.  We hve a older Nikon D50 from 8 years ago and it still takes great photos and works perfectly.  That was a factor in me purchasing her a Nikon.", "Date": "April 9, 2014"}, {"Title": "Great deal", "Author": "gonza", "ReviewID": "R3OA1WMOZHI5OT", "Overall": "5.0", "Content": "It`s a great deal. The camera is perfect and meets expectations. The price is very good to the quality of the devices", "Date": "March 9, 2014"}, {"Title": "Camera is as advertised and will be used often as soon as the weather improves", "Author": "Gary P.Wilson", "ReviewID": "R3M7BDJ92KQWBA", "Overall": "5.0", "Content": "Did a lot of research on the D3200 and committed to purchase one, order was processed quickly and shipped within two days. The only confusing thing was the UPS tracking system on amazon did not match up with my ups online,kept being told the package was sitting in Brooklyn for two days on one site and at the same time was in transit on another stayed home all day to receive package on the date it was supposed to arrive with no luck, it did arrive the next day in perfect condition and I would recommend this camera to a friend.", "Date": "March 4, 2014"}, {"Title": "JoeTechCo, in a word......... WOW", "Author": "Seamus Madden Masc. \"Seamus Madden M.A.S.C.\"", "ReviewID": "R27S1OCWOFBTCW", "Overall": "5.0", "Content": "It not only came a day early, and i got a camera bag too, and a battery with a charger, and a 16gb memory card......I cant find any fault with it, it works great, so on top of everything the service was prompt and reliable it came a day early and i got a camera bag too, which i wasnt expecting.So to be even more happy i bragged about JTC on my Face Book wall too, ;-)Thanks \"Guys\", :)", "Date": "March 4, 2014"}, {"Title": "Excellent value for the bundle", "Author": "Chris", "ReviewID": "R10WT1P5D33CX3", "Overall": "5.0", "Content": "This is a spectacular camera, especially for anyone looking for an entry point into the DSLR camera scene.  Takes fantastic pictures, has a bit of a built in tutorial on some of the major settings, and just works.  24.2 MP is probably more than anyone needs, but for the price, just can't be beat.  Was shipped in great time over the Christmas season, we're very happy with the purchase.", "Date": "February 3, 2014"}, {"Title": "Good Deal", "Author": "Anshul Mittal", "ReviewID": "R3L43IV4NRK891", "Overall": "4.0", "Content": "Value for money... Nikon D3200 with 18-55 and 55-200 MM lense combo is superb. The VR function if great for users withouth a tripod.", "Date": "January 13, 2014"}, {"Title": "Love our new camera!", "Author": "Shea G.", "ReviewID": "R12C89K2JQT8QY", "Overall": "5.0", "Content": "This camera is great! We have used it almost every day since we received it in the mail and couldn't be more pleased. The picture quality is amazing.", "Date": "January 8, 2014"}, {"Title": "Good", "Author": "rakel", "ReviewID": "R302WAD6C33OQC", "Overall": "5.0", "Content": "Such a good camera, really easy to use hight pictures cuallity and video and also the battery is good .", "Date": "January 7, 2014"}, {"Title": "no problems whatsoever", "Author": "Bethaney Graf", "ReviewID": "R1F261XUHSP9D8", "Overall": "5.0", "Content": "Received in excellent condition, no problems. Purchased as a Christmas gift for my husband, as our first baby is due in a couple weeks...He's in love with the camera!", "Date": "January 4, 2014"}, {"Title": "Best camera, best Nikon I have gotten, ever!", "Author": "ABGfsu", "ReviewID": "R1RM330QPY9FSP", "Overall": "5.0", "Content": "Getting this camera was an all out adventure. First of all I wanted a camera with interchangeable lenses with auto features. I first ordered a similar outfit from another supplier (I would only say its name starts with an A*) except the telephoto lens was not Vibration Reduction (VR) and cost $100 less. Big problem with that supplier was that both the Amazon site and their site listed it as \"In Stock\" so I clicked it. Big mistake! 24 hours later, not a few hours, they sent a note telling the item was out of stock with a non confirmed back-order date. I needed the item sent to my son by Dec 12th, but because he was leaving with no news about my camera, I asked the supplier to send it directly to my office address. Their sales support personnel never responded with a positive response, citing regulations that prevented them to change shipping address and so, and almost the same from Amazon. In the end I found the offer from PixiBytes and contacted them, and they promptly responded the kit was in Stock. I click the order, notify them about it, and the camera kit was picked up by FedEx a few hours later. So, I cancelled the other. When it arrived I had to say this was a Superb Camera for the price! Sorry for Canon, Sony, Panasonic or other brands' lovers, for me Nikon is still the best in semi/pro consumer cameras! I got a meeting later with several friends and they had their Canon's, Pentax's, etc, and they all fell in love with the Nikon D3200. I told them there are others models better, but they like it as it is. Many of them are sure in replacing their older ones with a Nikon soon. Only regret I have from this Nikon is that this type of camera seems it's no longer made in Japan -like my SUV-, it's assembled in Thailand. I guess that is why they can offer a camera like this for this relatively low price. I am happy with it, and it arrived in time for all my Holidays picture taking parties! If you have the bucks you may try the D5200 or even more the D7200. I am very happy with my D3200. Great camera and great supplier, Pixibytes.", "Date": "December 28, 2013"}, {"Title": "Great Camera", "Author": "victoria garcia", "ReviewID": "R2AR2UZ4UWEJZL", "Overall": "5.0", "Content": "Awesome deal came with 2 lenses best deal by far out there will do biz with them again when I upgrade again", "Date": "December 20, 2013"}, {"Title": "Awesome camera", "Author": "Andrew Raddatz", "ReviewID": "R2D6WDPSE94PUW", "Overall": "5.0", "Content": "This camera has been great.  I am just learning to take good pictures and this camera is perfect for beginners.  The shipment came on time and in great condition.", "Date": "December 18, 2013"}, {"Title": "Great entry level DSLR for me!", "Author": "Adam", "ReviewID": "RFOIWR931FUH0", "Overall": "5.0", "Content": "The Camera is great and a very nice upgrade from my point and shoots of the past. My one complaint is that the Serial # on the camera did not match with Nikon's actual website when I went to register it. That is a little sketchy to me. Other than that, great camera and good experience.", "Date": "December 12, 2013"}, {"Title": "ORGANIZED AND FULFILLED", "Author": "henry garcia gomez", "ReviewID": "RVMU3H79PTNKI", "Overall": "5.0", "Content": "EXCELLENT. THE PRODUCT OFFERED SAME AS REQUESTED. RECOMMENDED TO 100% TO MAKE YOUR SHOPPING.  DEFINITELY OTHER PRODUCTS OFFERED AGAIN BUY FOR YOU. THANK YOU", "Date": "October 20, 2013"}, {"Title": "Awesome", "Author": "Hope A.", "ReviewID": "R2IJRFQ3SWKA90", "Overall": "5.0", "Content": "I just received my Nikon D3200 and love it.  I took some great night photos of the Super moon the other night.  I am looking forward to using this camera!", "Date": "June 25, 2013"}, {"Title": "Great Camera Kit", "Author": "K-nine", "ReviewID": "R3QNXQW4PL9D0", "Overall": "5.0", "Content": "Excellent camera kit. Love the ease of operation. When I show off my pictures people thinks it was done by a professional.", "Date": "December 1, 2013"}, {"Title": "Great camera for still shots and now videos, too.", "Author": "P. Robles \"Love to read\"", "ReviewID": "R2SXOX4X1CHREO", "Overall": "5.0", "Content": "We bought this camera for its ability to not only take beautiful still shots but also video. We already own it's predecessor, but it only takes still shots. Nikons are great cameras. I especially like this camera for its light body. No more of the SLR heavy metal bodies.", "Date": "November 29, 2013"}, {"Title": "Great Camera", "Author": "S. Benson \"Sherrie\"", "ReviewID": "R2EV304ZOJVT3Q", "Overall": "5.0", "Content": "This camera is so easy to use and takes beautiful pictures. I am not a camera person and have always had trouble figuring them out, but this was easy to take out of the box and take great pictures.", "Date": "November 13, 2013"}, {"Title": "EXCELENT", "Author": "Federico Pinto", "ReviewID": "R1OMLPH32ZI4GG", "Overall": "5.0", "Content": "brillant! the camera is perfect, ligth en beautifoul. The lens kit are awsome. very robust an with excelent definition. i recomend this product and this seller 100%", "Date": "October 23, 2013"}, {"Title": "very good..", "Author": "vanessa Laya Salazar", "ReviewID": "R31PY48U54M35D", "Overall": "5.0", "Content": "Excellent camera. the pictures are perfect.I use it in Peru and photos to machupichu are precious.  i recommend this camera.", "Date": "August 2, 2013"}, {"Title": "Nice Nikon", "Author": "Deborah Roslan \"pyrola\"", "ReviewID": "R29CJD0I1UOBCU", "Overall": "5.0", "Content": "Just received the Nikon D-3200 and it's great. I still enjoy my D-60 but it can't hold a candle to this D3200.  Very user friendly and fun to use. Good battery life,light weight are the pros, camera clock is somewhat  inaccurate and the memory card was a little hot to remove after I shot a 300+ images at a wedding are the cons. Yet , the D3200 is my all around camera.", "Date": "December 13, 2012"}, {"Title": "so far so good", "Author": "janie", "ReviewID": "RHLWWOIB3BURR", "Overall": "5.0", "Content": "Just bought this camera a couple of weeks ago after doing a lot a research. This is my first DSLR after the point and shoot cameras. I bought the D3200 book for dummies. I'm trying to learn it the correct way! I so often just get something, don't read it and use it. But what happens is I don't get the full benefit of the product! I like the way the pictures are turning out. Its easier to use than I thought, but I'm still on auto focus, so....I received this timely and in perfect condition. Definitely buy from this seller again.", "Date": "August 31, 2013"}, {"Title": "USED CAMERA", "Author": "jhon ampuero", "ReviewID": "R23MOK5NGCABUK", "Overall": "1.0", "Content": "I got it used, missing some stuffs with screen scratched and he offered to make 25 bugs of discount which seemed to me funny i sent it back i and he didnt pay for shipment despite i sent the invoice inside the box as he said it was 12 usd i know its not to much but for me the worst experience, i wont buy here again.", "Date": "February 12, 2014"}, {"Title": "Great Camera", "Author": "Kelly Baer", "ReviewID": "R2FIIIWTOLMLJI", "Overall": "5.0", "Content": "I really like the Nikon D3200, Glad I got both lenses, as I've used it for swim meets, get good close up shots and it captures theaction well.  Went back and forth with this and the Canon T3i, decided to get this one since it had a higher 24 Mpixel vs 18. and the stat to shoot is faster, I did like the comfort of the Canon better, just felt better in hand, The Nikon just took a little time to get used to it.  Very nice camera!!", "Date": "January 16, 2014"}, {"Title": "Waoo!", "Author": "Forough", "ReviewID": "R2TSGJABS2PPHO", "Overall": "5.0", "Content": "I'm not a pro, but the camera is really good. I used the second lens outside, and it takes really good pictures.", "Date": "January 13, 2014"}, {"Title": "Nikon D3200 Excellent purchase", "Author": "Sean Barrett", "ReviewID": "R16EV7OEKOMRMN", "Overall": "5.0", "Content": "Very professional grade camera at a moderate price point.  Easily understandable, great quality of pictures at 24.2 Megapixel.  I got it with two lenses the 18-55 and 80-200, for a little less than $700.00.  Made a great Xmas Gift for my wife.", "Date": "December 5, 2013"}, {"Title": "Excellent camera", "Author": "F. K. Ben \"Franklin K\"", "ReviewID": "RYZ6MGX5E3PMV", "Overall": "4.0", "Content": "I am a beginner but very picky with respect to quality, so far I am very happy with this camera, and with Nikon products, the only complaint I might have is that they should be more careful with respect to packing, since the lens comes without a filter to protect the surface, you have to be very careful to look at it when you received the camera, because the cap will scratch it since there is not enough space in between the cap and the lens, that happens to me, unfortunately I dont live in the US to place a claim, also the time they give you to place the claim is very important to be aware of.", "Date": "June 1, 2013"}, {"Title": "Camera delivered specs", "Author": "Joven", "ReviewID": "R47JMOZYX0BBD", "Overall": "3.0", "Content": "For some reason, I got the impression the 55-200mm lens has a 58mm diameter.I bought filters for 58mm.The 55-200mm lens came in with 52mm.Taking pictures while zooming to a person from 50ft (indoor basketball) gets blurry since there is not enough light coming into the 52mm diameter.", "Date": "January 31, 2014"}, {"Title": "It's a good one.", "Author": "Shannon Derrick", "ReviewID": "R2BPWRZBEUCRP4", "Overall": "5.0", "Content": "This is my first Nikon camera, and I'm loving it.  It's light, easy to use, and suited perfectly for family photos and indoor sporting activities.  I would suggest a larger lens if you're wanting to get pictures on a football field.", "Date": "February 8, 2013"}, {"Title": "review on nikonD3200", "Author": "customer", "ReviewID": "RD2JCO5A3G65T", "Overall": "5.0", "Content": "it works perfectly fine. The quality of pics is good and clear, and the texture is amazing. overall, i like it very much.", "Date": "January 9, 2013"}, {"Title": "Very nice", "Author": "Mary Reinle Begley", "ReviewID": "RV1I76DYRHBSP", "Overall": "5.0", "Content": "This camera is amazing!  Easy to use and the pictures are incredible.  I love it!  I see lots of picture taking in my future.", "Date": "December 29, 2012"}, {"Title": "Buyer beware...", "Author": "SolSearcher", "ReviewID": "R1DZ1BE1DLZKY9", "Overall": "1.0", "Content": "I ordered this camera and lens from Jeffrey's.  Advertised as \"brand new factory sealed with one year warranty\".  I received the camera and lens both NOT sealed, and upon further inspection found that the warranty card for the camera said \"Warranty valid only in Japan\"  Nice that they conveniently \"forgot\" to mention this in their ad.  I trust that since it is a good brand, it'll be fine for the year!Oh...and I believe it is supposed to ship with a 16MB card...but there was no card at all. (I've already bought a 32GB card for it), but again, making the point that this seller does not deliver on what they say.The camera looks like it may be new, but who knows?When I emailed Jeffrey's about it, they gave me some non-sensical response (truly, it made no sense) and decided to try and define what \"factory sealed\" meant.Don't buy from them!!The camera looks great, charging battery as we speak...One star for my displeasure with the seller.", "Date": "December 13, 2013"}, {"Title": "Awesome!", "Author": "Pigstick", "ReviewID": "RASD70Z97D885", "Overall": "5.0", "Content": "I have been using a Sony NEX 5N for the past year (i.e. a mirrorless) which I love.  I also have a Canon S110 (also love) for carrying around in my pocket.  I had been thinking about getting the NEX 6 body but was not convinced it was a major step up for the money (although I wanted a viewfinder), and am waiting to see what new products are coming from Sony.  So, I started looking around as I have been wondering for the past year how my NEX stood up against a \"real\" DSLR.  I did the normal Nikon or Canon, if Nikon then the d3200, 5200 or 7100 etc.  I have been partly looking at this as an experiment so went for the cheapest possible body which came with the kit lense and 50-200.  In addition I got the 35mm 1.8G.  I also got the SB400 flash as one of my (few) dislikes of the NEX is the lack of options for flash.It has been an eye opener!  As I said, I love my NEX 5N, but, wow, the D3200 is awesome to use.  First off, I was amazed by the weight - it feels lighter than the NEX.  OK it is bulkier, but not to the point of inconvenience.  It fits in the same waist pouch I use along with the flash and 50-200 zoom - which also feels lighter, and is not much bigger than the NEX equivalent.  The photo quality is tremendous - photos are tack sharp and I find it much easier to set up great photos than with the NEX.  Maybe this is because it is the \"entry level\" and has fewer options - the NEX has a touch screen but the menu system is still a bit of a maze.  I am happy with the lenses I have, as my experiment continues, but I have noted how much cheaper they are than the Sony equivalent. And the quality is as good or better.So, I'm hooked.  I know this is described everywhere as a entry level, beginner etc. etc. camera but the controls are easily accessible and it takes great photos.  I haven't used the guide mode but presume it is good if you are starting out.  What astonishes me, is that I have a DSLR that is lighter, and not much bigger, than a mirrorless system which is a joy to use.  Finally, it makes me think more about the photo I am trying to take rather than just looking at the screen, I am getting better photos as a result. There is no doubt that next time I am traveling it will be with the Nikon.Negatives.  Of course nothing is perfect.  I like to use bracketing and this option is not included. Once I turn on liveview, I find myself missing the NEX. Given the enjoyment I get from using it, I still grade it five starts.If, like me, you are busy wondering what DSLR to start off with, get this camera (and the 35mm or 50mm prime lens).  It is just tremendous fun (with gorgeous photos)!!", "Date": "September 28, 2013"}, {"Title": "Perfect camera but check your needs.", "Author": "Santiago Pecha", "ReviewID": "R1BYDFMM9AOI7K", "Overall": "5.0", "Content": "Amazing camera for beguinners. The body is small and efficient. I took long time to choose it, but it is perfect for my needs. If you have doubts go to youtube and check some reviews. Some of them are pretty honest and shows the facts in action of this camera.", "Date": "September 8, 2013"}, {"Title": "Its good", "Author": "Sameh Mostafa", "ReviewID": "R1LKP5X1P9468U", "Overall": "4.0", "Content": "The camera is great, but the Battery i don't know whats wrong with it, its finished after 1 hour and have it suppose to take over 1000 pic or minimum 5 days work, but it needs to recharge every hour and have.Anyway i have to buy another battery to find the reason.Thanks for the camera its great working till now", "Date": "February 3, 2013"}, {"Title": "Nice camera", "Author": "Jose Sosa", "ReviewID": "RD5DBUGCHSVPO", "Overall": "5.0", "Content": "I bought this camera two months and a couple weeks ago, the store delivered the product very fast to Miami but I don't live in the US so I had to contract a courier service there, and it was very slow so it took two months to get here. The product came in good conditions, now I'm enjoying this amazing Nikon is a very nice camera it is very easy to handle and it is recomended for beginners like me.", "Date": "April 18, 2013"}, {"Title": "Amazing LENS and camera!", "Author": "sasha morris", "ReviewID": "R2D0WZIN830JFG", "Overall": "5.0", "Content": "I love this lens it does everything I could ever want it to do! I got the camera hoping to take better pictures and get an upgrade from my point and shoot! This is awesome I love the camera!", "Date": "March 18, 2013"}, {"Title": "Excellent", "Author": "Cecilia Sampson", "ReviewID": "R2ZUJKBI2QS6YO", "Overall": "5.0", "Content": "Es una buena marca, es de garantía, por otro lado trae un lente de mayor potencia y creo que es un buen producto para empezar un entrenamiento en foto.", "Date": "December 28, 2012"}, {"Title": "EXCELLENT", "Author": "ISMAEL", "ReviewID": "R2X1DP27FWX05F", "Overall": "5.0", "Content": "It is PHENOMENAL MACHINE, THE DELIVERY WAS PERFECT.NIKON IS EXCELLENT, WHO CAN MUST BUY.HOW SHOULD TIP NIKON, SEND A CARD WITH PLASTIC PRINCIAIS INFORMATION OF THE MACHINE.", "Date": "February 10, 2013"}], "ProductInfo": {"Price": "$969.99", "Features": "Wi-Fi Connectivity with adapter (not included)\n24.2 MP DX-format CMOS sensor\nEXPEED III Image Processing\nWide ISO sensitivity range - One-touch Full HD 1080p movie recording\nKit Includes 18-55mm f/3.5-5.6G AF-S DX VR Zoom Lens and 55-200mm f/4-5.6G ED IF AF-S DX VR Zoom-Nikkor Lens", "Name": "Nikon D3200 24.2 MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR and 55-200mm f/4-5.6G ED IF AF-S DX VR Zoom-Nikkor Lenses", "ImgURL": "http://ecx.images-amazon.com/images/I/51w7IyiDgSL._SY300_.jpg", "ProductID": "B0085VZB9Q"}}