{"Reviews": [{"Title": "Good photos, but perhaps flakey.", "Author": "Paul Carroll", "ReviewID": "RN6O3SE7M5P43", "Overall": "3.0", "Content": "I bought this camera last May, for a trip to Aruba.  I have used it on the beach in Aruba, Mexico, Peru, and the Dominican Republic.  The lens is up in the upper left corner, so you need to get used to not blocking that and keeping water droplets from being in the way.  Other than that, though, it takes good photos and video.Having said that, on this last trip, water got into the camera.  This is from using it on the surface and possibly a foot or two below water.  I do not know where the water came from - whether the water tight door, the screw mount location, or somewhere else.  But, there was a droplet on my SD card when I removed it.  What happened is that the display started dropping out.  Normally, when you turn the camera on, there is a message about making sure the door is closed.  Once the water got in the camera, the display just disappeared altogether.  No feedback.  No way of knowing what I was pointing at.  But it seemed to still keep taking photos and video.  After leaving the door open on the body for a day or two, the display started working again on occasion.  So, I was able to see that I was getting photos.  But I am not sure I can trust this camera now.  It might be time to look for another.  I may keep it for photos in wet environments, though.", "Date": "April 13, 2013"}, {"Title": "Great camera!", "Author": "Claudette Bannerman", "ReviewID": "R32MSN07H7CAJF", "Overall": "5.0", "Content": "I bought this camera as a spare to my main camera,went on a cruise and endedup using it throughout the trip. The camera took GREAT pictures, loved thefeatures and now favor this camera for travel, outings etc.  You won't bedisappointed, I certainly wasn't.", "Date": "January 7, 2013"}, {"Title": "If you want beyond durable this is for you.", "Author": "Kentucky Rob", "ReviewID": "RZMTJQ1TOS9NF", "Overall": "5.0", "Content": "I bought this camera four months ago strictly for outdoor use while hiking. So far is has performed wonderfully and I have gotten compliments on the pictures it has taken. I even have several framed and on the walls of my home. The LCD is clear and easily viewed in direct sunlight. The menu is straightforward and allows many options for whatever lighting situation you incur.Here is the bottom line on this camera. If you need one for strictly outdoor use in the rain, cold or during physical activity it is hard to beat.One last, albeit regretful, stress test. A few days ago I heard a clunking in my dryer and thought someone had put sneakers in there. When I went to get the clothes, to my horror, I see this camera! I forgot and left it in my cargo shorts. The camera went through a full wash and then a full dry on high heat!!I thought it was destroyed and pushed the start button....IT STARTED! The only defect I see after it was drenched with water and detergent, banged around for an hour and scorched with high heat is a very slight discoloration on the LCD.In other words this camera is the real deal.", "Date": "September 19, 2013"}, {"Title": "I'm torn", "Author": "Nancy pants", "ReviewID": "R1E0ANEO1JQT4Q", "Overall": "4.0", "Content": "So I really do like this camera but I had a bad experience day two. I bought this for a trip to Hawaii where I knew I'd be in the ocean and pool quite a bit. It takes pretty decent pictures. Great for daylight...night mode leaves a little to be desired . .. but then again, I didn't buy an underwater camera for night pictures. My bad experience was on a tubing trip. It took a bunch of pictures and then froze. I couldn't restart it or turn it off for a solid 10 minutes or so. I finally took the battery out and got it to reset. It worked ok after that but was a big hassle to get it working again (while in a tube). That said the next day I took it snorkeling and it worked quite well. So, maybe the freezing was a fluke? I'd also second the other commenters saying to watch the water droplets on the lens. All in all, I'd probably buy it again, it was a good value for the price. If I have it freeze again, I'll update my review.", "Date": "September 12, 2013"}, {"Title": "so far so good", "Author": "Angela Luce", "ReviewID": "R2M63R3IUFCVPN", "Overall": "5.0", "Content": "I bought this for use at a water park. Although I was a little hesitant, I did end up using it on water rides. I have also used it at the lake. I haven't submerged it, but it has gotten splashed and so far no problems. Due to it's small size and variety of picture options, it has become my go-to camera. I'm in real estate and I now use this camera instead of my $1000 Canon for taking pictures of houses. I love it's video capability and I've gotten some frame-worthy panoramic shots.", "Date": "August 26, 2013"}, {"Title": "Great camera...for 6 months.", "Author": "Running Girl", "ReviewID": "RVB23D8XZQD53", "Overall": "3.0", "Content": "Got this camera for Christmas last year and used underwater about a dozen times and on the beach for the past year.  I still get some great pictures but the waterproofing seals started to leak after about a dozen uses in salt water - snorkeling in water 5 to 10 feet deep.  Camera was rinsed in fresh water after every underwater use and dried.  After about 6 months of use all the buttons started taking turns sticking.  Have been using for the past 6 months on the beach but not underwater.  Missed several shots today because the shutter button stuck.  After pressing button many times it will unstick but very frustrating because 10 minutes later it sticks again.  The zoom button also sticks fairly regularly and I enjoy taking close ups sometimes and then back to regular distance so I'm using the zoom pretty frequently.  Now plug into computer to download new pictures and get a message that says no new pictures even though there are over 100.  Have to take the card out of the camera and put directly in card reader instead of using cable.  Have tried cleaning all buttons and cable connection inside the camera but waterproof seals are shot and buttons continue to stick some days and can only get new pictures on computer by taking the card out of the camera.I was very impressed with the quality of photos when I first started using this camera and still get some great pictures even after 1 year of use.  But now looking for a replacement because this one is just too frustrating to continue using.  Even though this camera is designed for underwater use I would not recommend it for underwater.  I've used the camera frequently over the past year and on the beach most of the time.  Picture quality is great but camera quality is not so great.If you plan to use the video feature I recommend at least 2 extra batteries.  If you want something for the beach this might fit your needs since it won't be a big problem if the camera gets splashed.  It is difficult to see your pictures on the LCD screen outdoors in bright sunlight.  I snap a lot of pictures and don't know if I got the shot until I see it on the computer because you just can't see it on the screen on the camera.  If you want it for underwater I would shop around for something else.  A dozen underwater uses in 3 months just wasn't long enough.  The waterproofing seals just didn't hold up long enough to make this camera a worthwhile purchase as far as wanting to have an underwater camera.  It is advertised as being designed for outdoor and underwater use.  Doesn't seem to be a sufficient quality build for that.  Very happy with the picture quality when the camera was new.  Very disappointed with the overall quality of the camera.", "Date": "December 7, 2013"}, {"Title": "Top Quality Camera at a Decent Price", "Author": "kg", "ReviewID": "R23NIJ863IJJZX", "Overall": "5.0", "Content": "We shoot a lot of fly-fishing themed photos and need a rugged camera to accomplish that.  This one fits the bill.", "Date": "October 29, 2013"}, {"Title": "Kathy from Las Vegas, NV", "Author": "Kathy", "ReviewID": "R2F1XDKN0CX27Z", "Overall": "3.0", "Content": "I love all the features and the fact that it is waterproof, shock proof, etc. etc.  but sometimes it just does not focus for me.  I try different settings.  I love to take pictures, but disappointed with some of the results.", "Date": "January 2, 2014"}, {"Title": "Fujifilm FinePix XP55", "Author": "Michael Rodriguez", "ReviewID": "R4NKMZ2ANV75C", "Overall": "3.0", "Content": "The camera takes great picturses but the instruction manual does not clearly explain everything for the camera.  So you are not sure what every setting the camera does.  Best keep it on factory setting, if your going to change the setting, try it before you start actually taking pictures or videos.  I found out the hard way and none of the videos I took had any sound.", "Date": "June 3, 2013"}, {"Title": "xp55", "Author": "tony", "ReviewID": "R3Q8TOZ43S3JTA", "Overall": "5.0", "Content": "forget all the bull!@#$%^&  just buy it you'll have no regrets!!!  honest!! it's in my pocket all the time!!  fisheye", "Date": "July 23, 2013"}, {"Title": "Great Camera.", "Author": "Robert H. Alamshah \"ralamsha\"", "ReviewID": "R19F38M51TC4QW", "Overall": "5.0", "Content": "Unbelievable what this camera can do and under the conditions it's designed to do them in. My daughter is taking hers (we have two) to New Zealand for a research program on Falcons and due to the climate, this will be the perfect camera for her.", "Date": "June 18, 2013"}], "ProductInfo": {"Price": "$199.99", "Features": "Water, Shock, Dust, Freeze proof\n5x Optical Zoom\n14 Megapixel Sensor\nBright & Clear 2.7\" LCD screen with Anti-reflective coating\nMicro HDMI", "Name": "Fujifilm FinePix XP55 14MP Digital Camera | Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/51qfKIF54PL._SY300_.jpg", "ProductID": "B008NC0K4I"}}