{"Reviews": [{"Title": "EXCELLENT KIT, NICE CAMERA", "Author": "Rosa Nelly", "ReviewID": "R2EJ3JOOB4QTD1", "Overall": "4.0", "Content": "This kit comes with everything that you need for starting right away taking pictures, only complain about the tripod that isn't sturdy at all, made of crapy plastic, you have to buy another a little more expensive, but guessing on the price of the whole package it doesnt matter, i gave away mine cuz i have a good quality spare. And the hdmi cable doesnt fit the camera mini hdmi port. But other than that, this is an amazing kit, amazing lenses and camera.", "Date": "July 3, 2012"}, {"Title": "very good", "Author": "Sandii", "ReviewID": "R8UDKYEXTICF", "Overall": "5.0", "Content": "widely recommended, the package was very good all the material is of good quality and is everything as they show, the camera is the best on the market and I have only to recommend it widely. was an excellent buy for my", "Date": "July 19, 2013"}, {"Title": "nice", "Author": "C. remus", "ReviewID": "R3AMN1TK2GGRR2", "Overall": "5.0", "Content": "Just a great deal. Nice folks to work with! This camera is fun to work with and easyto understand.", "Date": "January 9, 2014"}, {"Title": "Excellent Value!!", "Author": "Sherry Courtney", "ReviewID": "R3GBLBOEVU8S63", "Overall": "5.0", "Content": "Excellent Value! This was a Christmas gift for my adult daughter and she loves it! Nikon is a great camera and this package has all you need to start off right. I would recommend this camera to everyone.", "Date": "January 6, 2014"}, {"Title": "Ok. I am verry happy with my new camera", "Author": "SALVADOR CASTELLOTE", "ReviewID": "R3TACU6J5HZK1L", "Overall": "5.0", "Content": "Excelent camera and complit kit and a good price Nikon is a great tarde mark, a High technology an amaizing optic divice", "Date": "December 19, 2013"}, {"Title": "Excellent", "Author": "L W Gawlik", "ReviewID": "R39COX0BUMT7K4", "Overall": "5.0", "Content": "I have had Nikon products for more than 40 years.  This is my first foray into digital cameras.  We bought this so my son could re-shoot wedding stills that the paid photographer failed to get.  I did wedding photography years ago, so I coached him along, I was pleased with the results.  I am amazed at the power of the little camera mounted strobe. It suffers from all the limitations of a camera mounted strobe, though.  All considered, I am very impressed with this camera.", "Date": "December 11, 2013"}, {"Title": "Wonderful", "Author": "Aighmi*", "ReviewID": "R3SS06QHHJFGUD", "Overall": "5.0", "Content": "The camera and lenses are wonderful, and the other items in the kit are also excellent.  This was a fabulous birthday present!", "Date": "August 10, 2013"}, {"Title": "Nikon D3200 camera bundle", "Author": "Howard P.", "ReviewID": "R388O57SWB7W0M", "Overall": "5.0", "Content": "This is one great outfit for anyone looking to go into a Digital camera..I am still learning about the camera and what I can and can not do..But I ordered a book to help to learn every thing that the booklet does not have in it...Over all it is a great camera....Nikon D3200 24.2 MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR and 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lenses + EN-EL14 Battery + 32GB Deluxe Accessory Kit Nikon D3200 24.2 MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR and 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lenses + EN-EL14 Battery + 32GB Deluxe Accessory Kit", "Date": "July 1, 2013"}, {"Title": "love this camera!", "Author": "Sherry", "ReviewID": "ROQ16HJT8LCGF", "Overall": "5.0", "Content": "this is a great camera.  i need gto get a macro lens, and i will be even more happy.  love it", "Date": "June 6, 2013"}, {"Title": "Good value for the money", "Author": "Rick", "ReviewID": "R1OW6DYGQACU8U", "Overall": "5.0", "Content": "Good value. Takes great pictures and is versatile. While it lacks some of the features of the D5200, I am happy with it.", "Date": "April 4, 2013"}, {"Title": "Nice set up", "Author": "Julienne M. Longsworth", "ReviewID": "R1Q6BBX8TDK1FT", "Overall": "5.0", "Content": "This is exactly what we were wanting.  My kit was missing the lens cleaning kit, but when I contacted the company, they sent one out quickly.", "Date": "February 18, 2013"}, {"Title": "Love the camera and the kit", "Author": "Luke", "ReviewID": "R2FLICL1F14PUX", "Overall": "5.0", "Content": "I just love this camera, and the entire kit has been very useful to me in getting my start with DSLR photography. The carrying bag holds everything I need, the extra battery is really an essential part of this kit as is the SD card, and of course having two lenses opens up some more photography potential. I only had one problem, and that was that the card reader did not work, but Focus Camera reimbursed me for it, no problem. If you are looking to get started with DSLR cameras, here is a a great place to start! Not only is the kit good, but Focus Camera's customer service was very kind and helpful. 5 Stars, I would do business with them again in the future and recommend this kit.", "Date": "September 21, 2013"}, {"Title": "Excellent Camera Package for the money", "Author": "Jeremy L. Loomis", "ReviewID": "R2055OR1BTJR2M", "Overall": "5.0", "Content": "The is an excellent camera package for the money.  The D3200 is superb and is very easy to us and very fast.  The 55-300mm Telephoto lens is a must have and is excellent at taking picture of birds in my back yard.", "Date": "August 26, 2013"}, {"Title": "Excellent", "Author": "Patricia Hernandez", "ReviewID": "R3KX9QR9S7ZCXF", "Overall": "5.0", "Content": "Everything is ok whit the Nikon D3200 camera and all accesories. Ultil today is all right iam very happy whir this purchase.Excellent products!", "Date": "September 11, 2013"}], "ProductInfo": {"Price": "$1,299.99", "Features": "Nikon D3200 24.2 MP CMOS Digital SLR Camera Body - Black (Includes manufacturer's supplied accessories)\nNikon 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens - Nikon 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lens - Deluxe Lens Care & Cleaning Kit\n32 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL14 Reachargeable Lithium ion Replacement Battery Pack - Well Padded Multi Compartment Gadget Bag with Pockets & Strap\nFull Size 59\" Tripod W/Case - Jumpstart Guide to Digital SLR Cameras - BONUS!! HDMI cable for HDTV connection - Free 25 Quality Prints (Promo code # on invoice)", "Name": "Nikon D3200 24.2 MP CMOS Digital SLR Camera with 18-55mm f/3.5-5.6G AF-S DX VR and 55-300mm f/4.5-5.6G ED VR AF-S DX NIKKOR Zoom Lenses + EN-EL14 Battery + 32GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61h-QIteybL._SY300_.jpg", "ProductID": "B0085YJ9IW"}}