{"Reviews": [{"Title": "Up poop creek with out a paddle", "Author": "Jesse", "ReviewID": "RV0D4ZEN2LAZ5", "Overall": "1.0", "Content": "So the product came in what appeared to be warehouse water salvage.Everything smelled moldy and camera case was sealed in plastic with mold on the camera case.Called Focus Customer service and try sent me another camera case with same issue.I was charged twice at 2 different prices and talked to customer service and they refunded the lower amount MINUS a restocking fee.The 2nd camera they sent same condition as before.The camera does work however I filled out the Warrenty information because electronics and moisture never turns out good.Thanks focus camera for screwing a disabled veteran small business owner.", "Date": "October 16, 2013"}, {"Title": "great", "Author": "Amazon Customer", "ReviewID": "R19EJMT1HYONRL", "Overall": "5.0", "Content": "not only did I recieve a large bundle at a great price for a quality product, everything came as expected plus some unexpected extras", "Date": "October 20, 2013"}, {"Title": "Nikon D 3200", "Author": "Tim Smith \"PoppaTim\"", "ReviewID": "R2KUDVONB6JX2D", "Overall": "5.0", "Content": "Easy to learn to use! Takes great pictures and video. Love the fact you can use the screen rather than the viewfinder for \"some\" pictures, even thought the shooting rate is slower that with the view finder. The camera bag is excellent! If looking for a digital camera with ease of use, this is a great choice!", "Date": "May 13, 2013"}, {"Title": "Very fast delivery, great service, great combo price", "Author": "Juan G. Gonzalez", "ReviewID": "R5BDCUVHJ162Y", "Overall": "5.0", "Content": "Second camera that I buy from this seller, My first one worked great, it was new, everything just like advertized, i think even better because i got a better bag and better memory card than the one in the picture, very fast service... great deal... cant bet that.. Thanks a lot... My wife is going to love her new camera.", "Date": "November 12, 2013"}, {"Title": "Excelente Product", "Author": "Dorian R. Carcuz", "ReviewID": "RPML957HRQZAB", "Overall": "5.0", "Content": "at first I had my doubts of what is offered, as are many accessories, the camera came in its original box as well as the accessories, I've tried them all and work perfectly, the camera has a very good weight and more of the functions of models above, to be a semi-professional camera has almost nothing to envy to the professionals, it is excellent for beginners and intermediates who are in photography, meets most expectations.", "Date": "November 9, 2013"}, {"Title": "Very Happy", "Author": "torch23", "ReviewID": "RQHOSBLX1O8O7", "Overall": "5.0", "Content": "Can I just say that i ordered this product on the 30th and arrived in 2 days! Was very pleased with that. Came with everything you see on the photo. Camera works fine lense too. Tripod is not of the best quality but gets the job done. Comes with a nice bag that you could put everything you get from your order in it and still have some space. Overall the camera is awesome very pleased with this purchase.", "Date": "November 4, 2013"}, {"Title": "A very good starter kit for my 15 year old son who has taken up photography", "Author": "Jeffrey Brown", "ReviewID": "R19RT73HDJR3CW", "Overall": "4.0", "Content": "A very good starter kit for my 15 year old son who has taken up photography.  It includes everything he needs to get started.  The memory card included is not of the high-speed type but it's fine for a start.", "Date": "December 9, 2013"}, {"Title": "product is awesome but price changed.", "Author": "josiah", "ReviewID": "R2CD088L9T1VZS", "Overall": "4.0", "Content": "The camera is awsome and the accessories work just fine, I was pleased to see the SD card was a Sony class 10 and the bag seems well protected and of decent quality. The only reason this isn't a five star rating is because when I clicked buy it now at $471 with free shipping the price instantly changed to $519 with free shipping. As for the product its five stars.", "Date": "November 26, 2013"}, {"Title": "Good deal except the camera case. All items work really well. Specially Nikon D3200 is awesome, simply good.", "Author": "Paramananda", "ReviewID": "R3GNDMIVY2S1LE", "Overall": "4.0", "Content": "Very user friendly. Good for novice as well as photography enthusiasts like me :-) . It has been close to 3 months that I started using this camera and I'm happy with the results it gives.  I would have given 5 out of 5 for this bundle if the camera case was good (it is not upto the mark, airy & not protective). Nevertheless, I'm happy with the Camera D3200, tripot, car battery charger-adaptor and the accompanied lenses.  Overall, a good deal.", "Date": "November 22, 2013"}, {"Title": "It was easy to use, the guide line was pretty straight forward.", "Author": "Rey", "ReviewID": "R6S6ZANEB20OC", "Overall": "4.0", "Content": "I was so excited to try for the first time. Every thing was there in the package and it was easy to use point and shoot. Thank you.", "Date": "November 7, 2013"}, {"Title": "Very good deal", "Author": "Blanca", "ReviewID": "R27TP1WTNWSRG0", "Overall": "5.0", "Content": "I love it. I got a lot of good/useful, extra stuff with it. So far, I have used it to take regular (people/portrait) pictures,  but planning to take more landscaping pictures on my next vacation.", "Date": "January 22, 2014"}, {"Title": "Great pictures, wi-fi disappointment", "Author": "RCB", "ReviewID": "R1RPX2GVWHQHY9", "Overall": "4.0", "Content": "Bought as a gift for my wife as she is a camera bug. It was implied in the advertisement that you can do wi-fi downloads of the pictures.  Wi-Fi downloads require buying another accessory and even then it is extremely limited.", "Date": "January 9, 2014"}, {"Title": "Great Buy", "Author": "Ben", "ReviewID": "R15E38YVMSHGH1", "Overall": "5.0", "Content": "This was a great purchase for my family. With us having a newborn this will allow us to capture wonderful pictures and memories.", "Date": "January 6, 2014"}, {"Title": "This was everything I expected. Arrived quickly and everything in tact", "Author": "Rene Buckner", "ReviewID": "RCA805K7UR22A", "Overall": "5.0", "Content": "I got up early on Black Friday to purchase this same camera with just the tripod and lens extra, only 3 were available and I didn't get one.  I ordered this package from Amazon and it was a better deal and I am delighted with the purchase", "Date": "January 3, 2014"}, {"Title": "Nikon D3200", "Author": "Richard Rawe \"Rawsrocks\"", "ReviewID": "R2HAIZGJJNZ89W", "Overall": "3.0", "Content": "The Camera body is very light, and does not seem to be very strong plastic. The camera case is the cheapest thing I have seen and the camera, components, and accessories do not all fit in it. The dividers fall out and do not stay connected to velcro. The tripod is very flimsy and is not very stable. The camera bodies in camera stores seem to be heavier and stronger. I guess there is a different quality from this company and camera stores, I did not know that Nikon made different quality camera bodies.", "Date": "January 3, 2014"}, {"Title": "camara", "Author": "MJ", "ReviewID": "RV7T4N79DDKJ1", "Overall": "5.0", "Content": "the camara is the best thing in my house ,you can focus a thing and the photo is perfect i loved", "Date": "January 3, 2014"}], "ProductInfo": {"Price": "$899.99", "Features": "Nikon D3200 24.2 MP CMOS Digital SLR Camera Body - Black (Includes manufacturer's supplied accessories)\nNikon 18-55mm f/3.5-5.6G AF-S DX VR Nikkor Zoom Lens - Tiffen Filter - 5pc Deluxe Lens Care & Cleaning Kit\n32 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL14 Reachargeable Lithium ion Replacement Battery Pack - Well Padded Multi Compartment Gadget Bag with Pockets & Strap -\nFull Size 59\" Tripod W/Case - Jumpstart Guide to Digital SLR Cameras - BONUS!! HDMI cable for HDTV connection - Free 25 Quality Prints (Promo code # on invoice)", "Name": "Nikon D3200 24.2 MP CMOS Digital SLR Camera (Black) with 18-55mm f/3.5-5.6 AF-S DX VR NIKKOR Zoom Lens + EN-EL14 Battery + Tiffen Filter + 32GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61UbyzMeo9L._SY300_.jpg", "ProductID": "B0085F85HW"}}