{"Reviews": [{"Title": "Love my new camera!", "Author": "Shannon Anderson", "ReviewID": "R6OC659SLWOXW", "Overall": "5.0", "Content": "Great price for good camera.  Just what i was looking for to capture family memories!  Absolutely loved the accessory kit that came with the camera.  Excellent price and fast shipping!", "Date": "January 11, 2013"}, {"Title": "Awesome camera!!", "Author": "Carol Coleman", "ReviewID": "RZQ0FH2Q8D6VN", "Overall": "5.0", "Content": "I initially bought this camera for a trip I was making to South Africa (in fact, I'm in the middle of the trip as I write this review) and am amazed at how easy it is to use and the superior quality of the pictures.  The friends I'm traveling with are so impressed with the pictures I've taken and profess me to be a very talented photographer; however, the reality is this camera is so good, it provides everyone with professional results.  The 42X zoom is an amazing feature and so easy to focus, I look forward to using it on my upcoming safari.  The bundle is a great value and includes everything you need to get started although I bought additional batteries (I recommend you always carry a spare one) and a larger memory card.  Highly recommend!!", "Date": "January 21, 2013"}, {"Title": "Awescome camera", "Author": "psa1000", "ReviewID": "R2MVXNDVEMEVRK", "Overall": "5.0", "Content": "I was extremely happy to have purchased this item.  The camera met all of my high expectations for clarity and ease of use.", "Date": "January 7, 2013"}, {"Title": "A monster was created", "Author": "sherri", "ReviewID": "R39W2DLUAJDU9A", "Overall": "4.0", "Content": "I had a coolpix p90, bought it from a friend. I took many  pictures with it, so far I am averaging 150 pictures a day with my p510. I love all the functions and effects. And the zoom is wonderful, i've got great pics of the moon. I am not talking about a bright light, i'm talking craters. The camera has inspired me. I highly reccomend this camera.", "Date": "February 7, 2013"}, {"Title": "Easy to use, with the ability to customize", "Author": "JBach \"Jackie\"", "ReviewID": "R1X663APGA18QY", "Overall": "4.0", "Content": "I like the idea that I can use this camera as an SLR and still grab a picture on the run with auto setups.  The bundle made it significantly less expensive than purchasing items individually, although the camera is a little too heavy to be supported by the mini-tripods, so I'm not sure I'll ever use those.  It tipped over and almost off the table the first time I used one.  Overall, great camera.", "Date": "April 7, 2013"}, {"Title": "I LOVE IT!!", "Author": "Mrs. Ashley Perdomo", "ReviewID": "R30AZVTQM560OP", "Overall": "5.0", "Content": "I absolutely loved everything that came in this bundle!! it was absolutely the best birthday gift i was to get for a special person and the price was in my RIGHT in my budget!!! the delivery came 5 days early!! i was so excited to be able to track the package with UPS all the way to my door!! i will DEFINETLY BUY FROM THIS SELLER AGAIN!!!", "Date": "December 18, 2012"}, {"Title": "Great camer and accessories", "Author": "D Mac", "ReviewID": "RUKR06WADOTLZ", "Overall": "5.0", "Content": "Everything with the order was as advertised. The quality of the additional items was very good and especially liked the HMDI cable that will make showing the movies from the camera very easy on a TV or laptop.", "Date": "April 7, 2013"}, {"Title": "This is a truly amazing camera!", "Author": "Robert Callecod", "ReviewID": "R1X67QO4DTZY2I", "Overall": "5.0", "Content": "I can't believe Nikon can offer a camera with so many quality features at such a modest price.  I am a fairly serious photographer who does a lot of travelling.  Usually I have to lug around a sturdy DSL with a couple of lenses for landscape and closeup shots, plus a video camcorder for action sequences.  The Coolpix 510 replaces all that equipment in a compact, lightweight package, yet takes excellent quality images.", "Date": "March 28, 2013"}, {"Title": "Great camera", "Author": "Emma", "ReviewID": "RLQ8WMFBW5D3Z", "Overall": "5.0", "Content": "I only got this last night, but im in love! I played around with it and took some great clear crisp shots. The zoom is fantastic...all in all I am happy with this camera and can't wait to learn how to use all the features!", "Date": "March 2, 2013"}, {"Title": "great bundle! nice camera, packaged well", "Author": "snay502", "ReviewID": "R31C3PDJX9MU7D", "Overall": "5.0", "Content": "did a lot of research.  the nikon fir the bill!  wife is very happy.  best price on bundle is here.", "Date": "February 23, 2013"}, {"Title": "Nikon cameral deluxe accessory kit", "Author": "John S. Setters", "ReviewID": "R2PLSTXX9Z2C7P", "Overall": "3.0", "Content": "I think the camera is great but the bundle - not so much. The camera pouch is too small to hold anything more than the camera and the \"large\" tripod is a joke. A max height of fifty (50) inches is not very helpful. Yes it is lightweight which helps when walking around with the camera all day but when playing tourist-o, one tends to want to take photos from vantage points that were built to be vantage points. That usually means that rails were erected to prevent one from falling and guess how tall those rails usually are? Yeah. The charger and cables and memory flash cards are all nice but you really should either drop the tripod or provide one that does not require one to partly squat to use.", "Date": "June 6, 2013"}, {"Title": "Cheap tripod advertised as professional", "Author": "Gabriel", "ReviewID": "R2XOHVGNOK9NU9", "Overall": "5.0", "Content": "I am happy with everything in the package except the tripodIt was advertised as professional but is very very cheap and flimsyThe rest of the package was very good", "Date": "April 27, 2013"}, {"Title": "Camera", "Author": "Carl Hansen", "ReviewID": "R18YVGJRTTKWIY", "Overall": "5.0", "Content": "Awesome!! This camera is the newer generation of the P100 I have been using, Very nice upgrade to the old unit", "Date": "December 18, 2012"}, {"Title": "Not so pleased with my order", "Author": "Elaine", "ReviewID": "R1CZ1R0GYAWB2O", "Overall": "1.0", "Content": "I ordered this camera bundle and was really excited to get it.  Upon opening the camera box and pulling out the camera, I noticed that when I gently shook the camera there was a rattling noise and a movement.  It felt like the lens was loose in the casing.  Also, I have not ordered a point and shoot camera in awhile, but the last one I ordered was metal, this one is all plastic which gave it a cheap feel.  I contacted Focus Camera where it came from and in order to exchange(which I felt I had to do or send back the whole, huge box and everything that came with it) I had to pay for insurance and postage to ship it back.  They did not offer to help with charges.  So, although this seems like a good deal, be aware of things like this that can make it expensive real fast.", "Date": "March 8, 2013"}, {"Title": "Nikon COOLPIX P510", "Author": "RICHARD MARTINEZ", "ReviewID": "RRBZQAD55RYE2", "Overall": "5.0", "Content": "Its powerful zoom makes it a good choice for outdoor use.If you want a compact digital camera in a cut a little more professional, this model is just that. Your good resolution and ease of use make it an excellent choice to turn your love of photography into something more serious.", "Date": "February 18, 2013"}, {"Title": "This is the best camera ever!", "Author": "GW1947", "ReviewID": "R1S8A1H4SDMADX", "Overall": "5.0", "Content": "I love this camera!  It is so easy to use, the menus are simple to navigate, the 42x zoom is awesome, changing settings is a snap, picture quality is very good, ...I just can't say enough about the Coolpix P510. It's a nice compact size, bigger than a basic point & shoot, but definitely not heavy or bulky.  It's simple to shoot videos and I love the fact that you can't \"accidentally\" do that (a real problem with a former camera).  The user manual, while rather long, is excellent.....so far I haven't been able to come up with a single question it couldn't answer. Altogether, I think this is an awesome little camera and I wouldn't hesitate to recommend it to anyone.", "Date": "October 2, 2013"}, {"Title": "All Expectations Met", "Author": "Harvey C. Cannova", "ReviewID": "R1BT2DHBVI942T", "Overall": "5.0", "Content": "This was a gift for my daughter. She was thrilled and indicates all expectations were met. Therefore I am thrilled.", "Date": "September 10, 2013"}, {"Title": "Nice!", "Author": "oliver0411", "ReviewID": "RRDUSX3R67CRL", "Overall": "5.0", "Content": "I love this camera, the zoom is really spectacular, you can see 42x perfect. Ideal to rookies. Very good product. Now you can find P520.", "Date": "August 2, 2013"}, {"Title": "So far, so great", "Author": "Anthony Waugh \"TW\"", "ReviewID": "R1CWNPWZBWA29Y", "Overall": "5.0", "Content": "I have had the P510 for about a week now and it does everything that I expected and then some. It will take some time to get used to the multiple options and figure out what works best for individual situations but 'Auto' manages to cover a lot. I got the package that includes a bag and tripod and have used the latter very effectively to take some shots that the vibration reduction feature may not have been able to manage.Overall, I am very pleased and look forward to checking out some fancier shooting options.", "Date": "July 24, 2013"}, {"Title": "Good camera, could be faster", "Author": "Sandoval Wa Silva", "ReviewID": "R1RZVEW0T6P8OS", "Overall": "4.0", "Content": "Great zoom and image stabilization. The different automatic modes are basic, but efficient. I have an SLR camera and the comparison may not be fair, as the capabilities on the SLR are far superior. However, I wanted something smaller to carry around on quick trips. The processor is a little slower than what I expected, but will do the job on shorter trips.", "Date": "July 11, 2013"}, {"Title": "LOVE IT....", "Author": "Bear Ferris", "ReviewID": "RIHQXERJIMBDZ", "Overall": "5.0", "Content": "Hey...love this camera and all the accessories.  Just opening the 'goodie' box and getting to know how to use my new Nikon.  Fun, fun, fun!", "Date": "July 10, 2013"}, {"Title": "Works Good", "Author": "Mark B.", "ReviewID": "R1OVJUCHLKU5GJ", "Overall": "5.0", "Content": "It seems to work good.  We bought it for another department so I have not used it .  They seem to like it and have not heard any complaints,", "Date": "July 5, 2013"}, {"Title": "Love love love", "Author": "Tanner Simpson", "ReviewID": "RB8LUKNLSZI03", "Overall": "5.0", "Content": "Camera is great. Started a photography business with this camera and it does just as good if not better than the other ladies with their $800+ cameras!", "Date": "July 2, 2013"}, {"Title": "I'm happy with the camera", "Author": "Exequiel", "ReviewID": "R1OK58EK6A0464", "Overall": "5.0", "Content": "I love the camera, covers very well my expectations, and proves to be very complete kit. I'm anxious to try it soon.", "Date": "June 28, 2013"}, {"Title": "Great Fathers Day Gift", "Author": "Cheryl L. Carney", "ReviewID": "R3VHW6VT6Z3V85", "Overall": "5.0", "Content": "We purchased this for my husband as a father's day gift. He is very pleased with the features and capabilitiess of this camera and accessories. We just returned from vacation and the pictures he took are fantastic.", "Date": "June 28, 2013"}, {"Title": "Best Camera i have ever had", "Author": "Jeannine", "ReviewID": "R1NN6D3EGNLH4G", "Overall": "5.0", "Content": "This camera is pretty amazing. i have not had anything with this kind of quality and so happy that i had purchased this. i had recently went to the zoo with family and the pictures came out amazing. so clear and makes it look like i was standing right next to the animals. its so clear easy to use and amazing picture quality. i could not be any happier with this product.the only thing i would have to say is a down fall is just the settings and figuring which ones are the best for different situations. but if you read the manual it will help you out.", "Date": "June 8, 2013"}, {"Title": "Love it", "Author": "Mark B.", "ReviewID": "R2F1ZX22OVV453", "Overall": "5.0", "Content": "Great camera for the price. Zero complaints so far! I recommend this camera to anyone looking for a great camera at a low price", "Date": "June 1, 2013"}, {"Title": "Great Camera --- Great Bundle !", "Author": "Steven Michael Wolfe", "ReviewID": "R1JAGVFEWYJLG", "Overall": "5.0", "Content": "I already purchase one, lent it to my Daughter in college, thought I would never see it again so I bought her this bundle and she loves it. The really good news is I have mine back!Great Camera and Bundle at a very good price!", "Date": "May 25, 2013"}, {"Title": "Nikon Coolpix P510", "Author": "Mendotagirl", "ReviewID": "RZSPG401MK6C6", "Overall": "5.0", "Content": "This is an absolutely fantastic camera for the price it just has unlimited capabilities.  I bought one for myself and after using it for several months I was so impressed that  I order one for each of my 2 neieces for their high school graduation present. Be sure to put some type of insurance coverage on such as Square Trade or Canopy, you will be glad you did.", "Date": "May 21, 2013"}, {"Title": "Amazing", "Author": "Bigc0untry", "ReviewID": "RW4K7543GKXFN", "Overall": "5.0", "Content": "Amazing camera!! Couldn't beat the price for all the stuff you get with it. Cool clear snap shots every time, and even easy enough to use for all people.", "Date": "May 19, 2013"}, {"Title": "Great camera", "Author": "Grapeape", "ReviewID": "R3NBSNQ3UIFPEF", "Overall": "4.0", "Content": "It does everything I needed from a camera and more! The spare battery and other accessories are great as well!", "Date": "May 6, 2013"}, {"Title": "camera is great!", "Author": "Jessica", "ReviewID": "R2GHSNUV6ATB80", "Overall": "4.0", "Content": "Love the camera. very useful. I was not impressed with the case. The zippers broke the second day of use and I was afraid the camera would fall out. But the camera itself works great!", "Date": "May 1, 2013"}, {"Title": "Great Camera", "Author": "Melanie Wingo", "ReviewID": "R3MCC9FTOUGE0Z", "Overall": "5.0", "Content": "Love Love Love this camera and when it arrived sooner than expected I was really excited.  Came with everything you would need to start learning the art of photography.  The bag was cheaper and smaller than I expected but enough to carry the camera and extra batteries.It also came with software that I was unaware of when ordering and fell in love with when I used it.  If you love to take panoramic pics this camera and software is for you.  Zoom is the best for this priced and type of camera.  You can actually get pictures of the craters in the moon.  Wonderful.  It is also great just to take everyday pictures of children and family.  My most favorite thing I have bought myself in years", "Date": "April 29, 2013"}, {"Title": "GREAT CAMERA!", "Author": "CL \"CL\"", "ReviewID": "RO907CMVJ3NFC", "Overall": "5.0", "Content": "THIS CAMERA IS ALL IT HAS BEEN ADVERTISED TO BE AND MORE.  IT'S ZOOMING CAPABILITIES ARE THE BEST; LOVE THE TILTING DISPLAY SCREEN, AND IT'S SO MUCH LIGHTER THAN ANY ZOOM LENS CAMERA I'VE HAD.", "Date": "April 27, 2013"}, {"Title": "Big bang for the buck", "Author": "R. Grounds", "ReviewID": "RCFD7H3DVPX9J", "Overall": "5.0", "Content": "I can never see the LED displays on any cameras when shooting outdoors.  I bought this camera because it has a viewfinder and the LED display can be pivoted for shooting overhead shots or low (pets/children).  I found that the subject tracking focus mode in conjunction with shutter burst mode works great for shots of my grandson.  The owners manual is somewhat overwhelming owing to the extraordinary functionality of this camera.  Lots of special features that I have not yet had time to explore.  Love the camera.", "Date": "April 27, 2013"}, {"Title": "amazing Camera", "Author": "Makune John", "ReviewID": "RNLBRKO0O29G3", "Overall": "5.0", "Content": "i simply love this camera, i had seen it before in a store but it was way overpriced, when i saw it on amazon for $400 with all the other accessories i decided to go for it, and so far i am not dissapointed with my purchase. every accessory was inside the pack, the camera stand looks durable, so far....im only having decent pictures with the camera....havent gone through all the features yet, but i could end where I am and still be impressed. the zoom is just amazing, i zoomed a colleagues ID number and details from 40feet away....incredible.the delivery was also very on time.", "Date": "April 22, 2013"}, {"Title": "COOLPIX P510", "Author": "Daniel E Stevens", "ReviewID": "R3JSPQBU99IN5G", "Overall": "5.0", "Content": "Great camera, more than I expected, and all the  accessories. However, a Vivitar camera case for a Nikon Camera, kinda cheap.", "Date": "April 20, 2013"}, {"Title": "Love it!!", "Author": "Rachel Warner", "ReviewID": "R2Y2D95FAR1S5J", "Overall": "5.0", "Content": "I have always wanted a GOOD camera! The COOLPIX P510 was recommended by a family member. When looking to purchase I couldn't pass up all the extras it came with!! The bundle package was the way to go. Already have some AWESOME pictures and taking pictures at a wedding this weekend! Would def recommend.", "Date": "April 17, 2013"}, {"Title": "Gran Cámara", "Author": "Oscar Medina", "ReviewID": "R3SJ56723TV3FR", "Overall": "5.0", "Content": "Excelente tiempo de entrega, cumplió con todo lo descrito en la pagina de compra y de gran calidad resulto ser todos los implementos.", "Date": "April 10, 2013"}, {"Title": "Excellent", "Author": "Guillermo Andrés Díaz Rueda", "ReviewID": "RWTFSU1P1W0CG", "Overall": "5.0", "Content": "This element is excellent, fullfill all my expectations, It is so good, I'm using it constantly and it's wonderful all the options that it has", "Date": "March 29, 2013"}, {"Title": "Love my camera", "Author": "Marion Kuhn", "ReviewID": "R2C28SZUOQQIYD", "Overall": "5.0", "Content": "Great camera - just learning how to use it.  It has many features and is very easy to use so far.  I'm going to start using it for some outdoor photography this weekend, but so far I love it.", "Date": "March 28, 2013"}, {"Title": "Nikon Camera Package", "Author": "it is fun", "ReviewID": "R19W22QQDEBHVX", "Overall": "5.0", "Content": "The package was awesome for all the items included. Awesome, awesome, awesome, awesome. Very awesome and will refer to others.", "Date": "March 18, 2013"}, {"Title": "Awesome package", "Author": "kristy156", "ReviewID": "R25WHJC6IVDRVY", "Overall": "5.0", "Content": "This is the perfect package. You get everything you need all in one which is great and convienent. I found that the GoPro HERO series package is actually better for those that are active and love taking pictures.http://www.amazon.com/gp/product/B00AQ45SNO/ref=as_li_ss_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00AQ45SNO&linkCode;=as2&tag;=wwwworkoutwei-20", "Date": "March 13, 2013"}, {"Title": "camera", "Author": "george", "ReviewID": "R1RL9GE3GDI0OA", "Overall": "5.0", "Content": "love the package deal.  The camera is great and love it my daughter also bought one.  The price was also great", "Date": "March 12, 2013"}, {"Title": "Excelent", "Author": "Alan Cohen Jimenez", "ReviewID": "R3P0JD1ASV4R8M", "Overall": "5.0", "Content": "Nikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom and \"GPS\"... ist the most camera good good good", "Date": "March 10, 2013"}, {"Title": "perfect", "Author": "Marina Couto Pereira", "ReviewID": "R2EKWA69WBWJLQ", "Overall": "5.0", "Content": "I liked very much this camera.It arrived on time.I did not have any problem with it.Everything ok!", "Date": "February 22, 2013"}, {"Title": "Awesome deal!", "Author": "Jeremy", "ReviewID": "R2W6IQEFUOH9M4", "Overall": "5.0", "Content": "The Nikon is a amazing camera for its price.  Very easy to understand and operate.  I got the package deal with it and my only concern was the tripod, its pretty flimsy.  Over all you cann't beat up the price anywhere.", "Date": "February 16, 2013"}, {"Title": "Great camera", "Author": "R. Shay", "ReviewID": "R3A8SPKK22MMIK", "Overall": "5.0", "Content": "This  camera does everything I expected and then some. The telephoto is fantastic. Having the spare battery is great. I would recommend this camera to others. As a matter of fact, two of my coworkers went out and bought themselves the same camera.", "Date": "February 16, 2013"}, {"Title": "opinion about the service and the product", "Author": "Gabriel", "ReviewID": "R1RLH20NGG3V4W", "Overall": "5.0", "Content": "I am satisfied with the product i bought and I Think that is very accessible and easy to use.I would recommend it.", "Date": "February 14, 2013"}, {"Title": "Great Camera for the Price", "Author": "James A. Labanosky", "ReviewID": "R3J8EXTSC85HXK", "Overall": "5.0", "Content": "The 42X zoom lens on this camera is great and gives you a lot of flexibility in framing and composing your shots.  The menus for choosing your options for taking a picture are set up well, and the camera is very easy to use.  It is lightweight and compact, and the tilting veiwfinder is also a good feature.  My old digital camera was aImost 10 years old, and the technology (e.g. the anti-vibration feature to reduce camera shake when using the zoom lens) has really improved.  I  am very pleased with  this purchase.", "Date": "February 11, 2013"}, {"Title": "coolpix 510", "Author": "Loren Immken", "ReviewID": "R254JS7YO77U9Z", "Overall": "5.0", "Content": "I,m very happy with the whole outfit great camera I really happy with the performance of it. The outfit came on time.", "Date": "January 27, 2013"}, {"Title": "NIKON COOLPIX 510", "Author": "PABLO POLIT", "ReviewID": "R1WRHYUXRGKR86", "Overall": "5.0", "Content": "Even as I am learning to exploit all the capabilities of the camera, I am very pleased with the overall performance", "Date": "January 23, 2013"}, {"Title": "Nikon cool pix P510", "Author": "CATALINA SEDA", "ReviewID": "R3UVC9EDHR9OJS", "Overall": "5.0", "Content": "Great product and great value. Easy to use and so many accesories. picture quality is great.Item was shipped quickly. Husband was very pleased with his new toy", "Date": "January 16, 2013"}, {"Title": "Amazing Full-Featured Camera and Kit!", "Author": "Matt Kelly", "ReviewID": "R2LOD1O65SX4DU", "Overall": "5.0", "Content": "I'm truly impressed with the items included in this camera kit! I'm not often impressed by most camera kits because they include stuff you don't need or want, but this kit gives you all the items you need for using the CoolPix P510. We've found the camera to be a remarkable workhorse, portable and easy to use, while giving us unbelievable optical zoom for our weekend photography outings. With multiple lightweight tripods, extra batteries, carrying case and MUCH more, this purchase ranks among the best-value purchases we've ever made online! Thank you for putting this tremendous kit together!", "Date": "June 14, 2013"}, {"Title": "Excelente", "Author": "GABRIELA PEREZ JOAQUIM", "ReviewID": "R1NPZHIUSA7BEQ", "Overall": "4.0", "Content": "Muy buena camara....realmente excelente tomas y filmaciones tiene muchas aplicaciones para usar, lo unico malo uqe para cargar, se carga con la camara entera, no solo la bateria.", "Date": "February 15, 2013"}, {"Title": "Nikon Coopicx P510 Digital Camera", "Author": "Isabell K. Toomey", "ReviewID": "R2V2QOFZTGMILF", "Overall": "4.0", "Content": "as I stated in my comments this package was an embarassment to me when opened on Christmas.  The contents were all opened and strewen about the second carton including the camera and upon checking the contents we discovered the cord that attasched the lens cap to the camera was not included.  I would like this item sent to the recipient as it is an important part of the camera.", "Date": "January 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "This Kit includes 11 items all with USA Warranty and manufacturer's supplied accessories\nNikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom NIKKOR ED Glass Lens and GPS Record Location (Black)\n16 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader - Universal Memory Card Wallet - Pack of LCD Screen Protectors\nAdditional EN-EL5 Rechargeable Lithium ion Replacement Battery - Protective Digital Camera Carrying Case with Pockets and Strap\nFull Size 50\" Tripod w/Case - Extendable 8\" Tabletop Mini Tripod - Lens Care & Cleaning Kit - HDMI Cable for direct connection to HDTV - 25 FREE Quality Prints", "Name": "Nikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom and \"GPS\" (Black) + EN-EL5 Battery + 9pc Bundle 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/513a2MlwJML._SY300_.jpg", "ProductID": "B009EE2EUW"}}