{"Reviews": [{"Title": "Canon carries problems forward with this new camera", "Author": "general principles", "ReviewID": "R2Y4K3R44LQY8A", "Overall": "2.0", "Content": "Main objection, other than soft photos, is that the control dial cannot be reliably used [as necessary in manual mode for selecting shutter speed and aperture, and for manual focusing] without inadvertently pressing, and thus actuating, one of the other functions on the wheel, typically the iso but sometimes the self timer, although there are two other functions that can be pressed as well, putting the camera into a different configuration.  This poor design places this otherwise nice point-and-shoot superzoom camera in a class all by itself...a compromise at best.  A redesign with a much stronger spring to actuate the four functions would probably fix this deficiency.  Not sure of Canon's track record of installing kits to correct known problems. If the camera will not be used in manual mode and if soft photos are ok, the camera would be quite acceptable.  The HD capability, slow motion, as well as numerous other features are cool, but not at the expense of manual mode.  Oh, the battery is fantastic...made well over 400 shots on one charge.  Beats rechargable AA batteries (that will not work in my other Canon or probably any other Canon).", "Date": "March 14, 2013"}, {"Title": "great for the price", "Author": "Debbie L.", "ReviewID": "RQJ4ASD68KYE3", "Overall": "5.0", "Content": "I love my camera and all the extras it came with.  I had a Canon powershot 2 years ago that got damaged and knew this was a great steal!", "Date": "June 25, 2013"}, {"Title": "Love this camera!", "Author": "Amazon Customer", "ReviewID": "R22XIUNHJWGE33", "Overall": "5.0", "Content": "I have only had this camera for 2 weeks. I know little to nothing about taking pictures and I am easily frustrated with new technology.  So far so good....  I am getting some great action shots.  I have not mastered the night shots, but I will keep trying.  I do not regret buying this camera. I would recommend it to anyone who wants more than a regular point and shoot, but is not ready for a SLR or a DSLR.", "Date": "June 13, 2013"}, {"Title": "It met my basic expectations...", "Author": "Ruben Yebran", "ReviewID": "R24T8E8WZ3UR52", "Overall": "4.0", "Content": "I'm not, by far, a connoisseur, but was hoping to be wowed...Although I should write another review once  I get to know better this camera, I can tell you that:I found the bag and the Secure Digital USB Card Reader very useful.Not happy with the Universal Memory Card Wallet - Package of LCD Screen ProtectorsExtendable 8\" Tabletop Mini Tripod - Lens Care & Cleaning Kit.", "Date": "June 11, 2013"}, {"Title": "Canon Powershot SX50", "Author": "Phojo-Frog", "ReviewID": "R1NCH2WJTVL5OK", "Overall": "4.0", "Content": "Good camera and easy to use. The 1200mm zoom really reaches out and gets close nature photos. Only disappointment is the sensor quality at full zoom. There is some pixelation when blown up to 100%. Sensor quality is pretty good when not at full zoom. If you are using the photos for personal use and not stock agency submission this camera is great.", "Date": "May 18, 2013"}, {"Title": "This camera is something else!", "Author": "Harriet S.", "ReviewID": "RNIH2W5EFZZOX", "Overall": "5.0", "Content": "Beautiful pictures and the zoom is incredible - I still have much to learn about this camera as I'm just an amateur but hopefully one day I'll understand all the wonderful capabilities of this camera.", "Date": "May 15, 2013"}, {"Title": "camera", "Author": "pamela hansen", "ReviewID": "R1C826BM2KCHSA", "Overall": "5.0", "Content": "I liked everything about the camera bundle and found in other places it was more expensive and you didn't get the bundle.  Was here in plenty of time for Christmas.", "Date": "December 27, 2012"}, {"Title": "LOVE the camera - bundle was adequate", "Author": "homer0768", "ReviewID": "R2ID5436V8MM9O", "Overall": "4.0", "Content": "The CANON SX50 so far is a FANTASTIC camera-highly recommend!  Reason for 4stars is the bundle - was filled with products that were low quality & would not normally buy had I been looking for those items.  My main reason for getting this bundle over straight camera alone was it included a camera bag, and a spare battery.  Rest of the bundle was ‘filler’ but some things were OK like the SD Card wallet and the HDMI Interface cable (the table top tripod is OK for small cameras-I wouldn’t trust with SX50). I figured the bundle was probably about $50 worth of items and the bundle was only $30 extra.  So to me it was worth it even if the other stuff is inferior quality", "Date": "December 12, 2012"}, {"Title": "I am thrilled with this camera", "Author": "janet", "ReviewID": "R28RNRD7B33TSJ", "Overall": "5.0", "Content": "I made a grand choice when I picked this one.  My daughter gave me a couple of ideas to pick from.I am still learning and no doubt will for some time as it has so many features that will only improve my love for photographing.  I can now get photos inside, outside, close up and FAR away.  What a joy Canon!!!Thank YouJanet", "Date": "December 23, 2013"}, {"Title": "Love the camera, but the kit was a bomb!", "Author": "Helen L Vogel", "ReviewID": "R34M9KFBZ0Q97Y", "Overall": "3.0", "Content": "Love the camera!!!!!But, the zipper on case broke with first use, liquid lens cleaner was leaking and leaked all over everything, the usb cable, fits the camera but no my computer so am unable to watch disk, unable to use lens protector because it got soaked in the packing when the lens cleaner leaked.", "Date": "December 20, 2013"}, {"Title": "Great Camera", "Author": "Amasa D. Smith", "ReviewID": "R3PYMUD8BEXBR8", "Overall": "5.0", "Content": "The camera is great , takes grreat picture. The zoom really let you get up close and personal with your object.The only thing that frustrated‎ me was the 258 page operational manual, that you had to download to a PDF file.", "Date": "December 14, 2013"}, {"Title": "Focus camera good company and canon sx50 hs really very nice camera", "Author": "Ahmad Hamdy Taha", "ReviewID": "R2R43B681CVX99", "Overall": "5.0", "Content": "Yes i got the camera after 1 day only and its really very very niceIts good in zoom and clear", "Date": "December 2, 2013"}, {"Title": "Good", "Author": "gavk", "ReviewID": "R1C61RAGL1MHED", "Overall": "4.0", "Content": "Good for still shots. Still have not got sports mode down yet. sports mode photos are blurry. Hope to play with this some more and figure this out. worth the money.", "Date": "October 21, 2013"}, {"Title": "Complete for non professional photographer", "Author": "Juan Sabbía", "ReviewID": "R16RYEW5O23ONY", "Overall": "5.0", "Content": "A very good option for a non professional photographer. It has all the equipment you need to enjoy you vacations forever.", "Date": "October 7, 2013"}, {"Title": "Fantastic camera.", "Author": "Amazon Customer", "ReviewID": "RHC2DLRF1PUXK", "Overall": "5.0", "Content": "After reviewing cameras online and found this one to be the best choice. It was such a good choice that I ordered a second one for my son who took it on his honeymoon to Hawaii. He loved it. My other son then took our camera to Scotland and also said it was a terrific camera.", "Date": "July 29, 2013"}, {"Title": "Do not buy- Lens Error !", "Author": "ACG", "ReviewID": "R117NIVI5NOZNH", "Overall": "1.0", "Content": "I bought this camera with all expectations only to find that CANNON can do such a bad job on a product release.First the creaky noise , even when you move the camera, take picture, xoom or even when you take picture in dark. The lens makes a lot of noise in Auto & manual settings.The main problem is \"LENS ERROR\" , do not know why this occured at the very first few picture I took. I had to shut off (or it automatically shuts off), It won't restart until and unless you take out the battery & re-insert it.Look at this google search on Lens error -[...]Seems like it occurs in most of Cannon cameras.I am surprised why CANNON is selling these camera which such a majoy BUG in their product.Also my friend's experience on Cannon customer support is hopeless, just they will not help you if you have a issue with camera.Warning to all CANNON buyers!Canon PowerShot SX50 HS 12.1 MP Digital Camera with 50x Wide-Angle Optical Image Stabilized Zoom Super Bundle W/ 32 GB Secure Digital (SDHC) Mem. Card, Dig Pro Case SD USB 2.0 Card Reader, BP 1150", "Date": "December 3, 2012"}, {"Title": "Great Camera Zoom, Good Quality Pictures", "Author": "Alex", "ReviewID": "R2NTWR2ZSVV27U", "Overall": "4.0", "Content": "I bought it because I'm interested on Photography as a hobbie, after playing around with it I noticed that there aren't many options available for manual mode, so I think I'll try to get a real DLSR later on.", "Date": "January 6, 2013"}], "ProductInfo": {"Price": "$534.99", "Features": "This Kit includes 10 items all with USA Warranty and manufacturer's supplied accessories\nCanon PowerShot SX50 HS 12.1 MP Digital Camera with 50x Wide-Angle Optical Image Stabilized Zoom\nAdditional NB-10L Rechargeable Replacement Battery Pack - 16 Gigabyte SDHC Secure Digital Memory Card - Secure Digital USB Card Reader\nProtective Digital Camera Carrying Case with Pockets and Strap - Universal Memory Card Wallet - Package of LCD Screen Protectors\nExtendable 8\" Tabletop Mini Tripod - Lens Care & Cleaning Kit - HDMI Cable for direct connection to HDTV - BONUS!! FREE 25 Quality Prints (promo code# on invoice)", "Name": "Canon PowerShot SX50 HS 12.1 MP Digital Camera with 50x Optical IS Zoom + NB-10L Battery + 8pc Bundle 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/517VSMruG3L._SY300_.jpg", "ProductID": "B009LNFDFY"}}