{"Reviews": [{"Title": "Pretty nice bridge camera for the price", "Author": "T. Johnston \"Terry Jay\"", "ReviewID": "R2MBE9G9ZZ80HQ", "Overall": "4.0", "Content": "I was reluctant at first to purchase this camera thanks to its small sensor (typically smaller sensors show more noise in the images), but, since it is a backlit sensor, similar to the Pentax Q (which I thoroughly enjoy), I decided to try it.  The cost helped, too, of course.  So far, I have shot nearly 300 images since getting the camera, and, so far at least, I am very impressed with the images I have obtained.The camera build quality is okay but is nowhere near the level of the Q.  Buttons don't have much in the way of tactile feedback and actually seem somewhat mushy on my copy.  The camera itself is fairly lightweight considering the amount of glass in that zoom lens, but it is bulky, making it seem (to me) to be bigger than it really is.  I suspect those people with small hands might have difficulty with the grip -- it's very deep, but fits my hand pretty well.  The battery door, the bane of many modern cameras, seems awfully flimsy (IMO), but perhaps it is better built than it seems -- I've certainly had no problem with it so far even though it is very tight-fitting with batteries installed.  The LCD tilts nicely and solidly holds its place, no matter where it is positioned.  When I turn up the brightness, the LCD is clearly visible in the direct Texas sunlight I have to cope with.  The EVF, while being somewhat low resolution, is actually far better than I had expected, being clear enough for composition and manual focusing.  The EVF diopter adjustment can accommodate my terribly myopic eyes.  I can even see the entire view with my glasses on!On my copy of the camera, the exposure is a bit off.  I've had to dial in a -0.7 to -1.0 EV to get a better shot.  Switching to Spot metering helps a little, but the exposure is still too bright in most situations I have encountered so far.  The camera resets the EV setting to 0.0 upon restart, a bit annoying to me, but not a big deal and it may be irrelevant to the average user.Images are surprisingly clean to my eyes, but when pixel peeping I can see that noise has been handled a little too aggressively by the camera.  I suspect it would only be noticeable in huge prints, though, which I don't make very often.  Unfortunately, though, the camera provides no RAW saving capability, but the JPG engine is quite good enough for me.  I have not bothered trying any ISOs beyond 400; 400 is the max I ever use for my style of photography, even when shooting film.The lens covers a huge range (one of the selling points of the camera, right?) and the optical quality is pretty good.  However, some chromatic aberration creeps in when shooting high contrast scenes (birds against a clear sky, for example), especially at the longer focal lengths.  Again, it's really only noticeable to me when pixel peeping.  Zooming is virtually silent and reasonably fast.  For that matter, once you turn off the annoying shutter noises, the camera is incredibly quiet.  Be warned about startup/shutdown and processing times, though.  The camera is rather slow to start: positioning the lens takes a second or so and increases slightly if you have the zoom \"memory\" set -- this is where the camera returns the camera to zoom position it was last at when powered down.  Powering down also takes a second or so as the lens has to follow an interesting \"dance\" to retract into the camera.  Finally, even when pre-focused, I have noticed a modest delay in capturing/saving photos.  The camera isn't really one for you action photogs, sorry to say.  The macro is phenomenal!  While many cameras reserve macro for the widest location in the zoom range, the X-5 uses the middle end of the zoom, giving the photographer better composition options, IMO.  There is also a 1 cm macro setting that really lets you close in on your subject.Manual control is implemented better in this camera than in some others I have used.  Tapping the EV button on top will switch the control wheel between shutter speed and aperture. This arrangement works quite well for me but YMMV.What has really surprised me is the battery life.  As I wrote above, I have shot nearly 300 photos so far and the battery indicator hasn't changed since I first put in the batteries (Sanyo Eneloops).All in all, if you are interested in a bridge camera with a long zoom range, you really can't beat the Pentax X-5.  While the size might put off some, remember you are getting a zoom lens that goes from 22.3mm to 580mm (in 35mm equivalent focal lengths). It is far from perfect, but, given the cost, it is well worth the money.I know this is a rather long-winded review, but I hope someone will find it useful.", "Date": "September 23, 2012"}, {"Title": "Nice handling camera, but with strong reservations", "Author": "James G. Towns \"tech corner\"", "ReviewID": "RXXLU6BUHRC0I", "Overall": "3.0", "Content": "Having been a professional photographer with experience in Pentax quality, the X-5 is a mixed blessing to me. I like very much the design and layout of controls, the dual viewing screens (eye and tiltable 3 inch) and the overall feel in your hands. It gives you the DSLR feel, although on a smaller scale. The software is very logical and easy to figure out, plus the large instruction manual explains things nicely. The digital anti-shake performs flawlessly and is really quite breathtaking in what it can do ( i.e.- zoomed out to about 1000mm and still being able to read a sign that was a hand-held photograph)  Having praised its attributes, I have some big disappointments with the pictures it takes. In bright sunlight, the picture is certainly acceptable, but the edges are definitely soft to the extreme.  This is due, no doubt, to the camera software only providing 2 f-stops for pictures: wide open and about f-8. (price you pay for the convenience of a lo-o-o-ng zoom). Is it worth keeping?? I guess so, the price was good for the features it offers, but I really expected more from Pentax on this one.March 12th update to 1st review: I've spent a couple of weeks with the camera now and have come to like it. Lens performance is still soft on the edges to the point it sometimes gets annoying, but that lo-o-o-ng zoom can really amaze you. I zoomed in on a steeple with a clock (about 900mm) and could read all the numbers, where in the wide angle shot (22.5mm), you could not even see the steeple. Plus, I photographed the full moon full frame and could see the craters. The anti-shake software again performed flawlessly as I could hardly keep my hands steady enough to keep the moon in frame. I know being on a tripod is the proper way to shoot the moon, but I was testing the camera this way on purpose to see how it would capture a hand held photograph, using the anti-shake. Pentax aced it on that software. I'm glad I kept the Pentax.", "Date": "February 13, 2013"}, {"Title": "Very impressed!", "Author": "Sue Ellen \"Suzy\"", "ReviewID": "R3A01XBT0V334N", "Overall": "5.0", "Content": "I had the Pentax X70 and X90 and was fairly impressed with both, marginally favouring the X70. I reckoned both cameras to be underrated by the experts, but not by most users. It was thus with some confidence that I bought Pentax's latest bridge camera. First impressions suggest I was not wrong. Despite the hike in megapixels from 12 to 16  sounding warning bells, the image quality exceeds that of both the X70 and X90 and better than most of Panasonic's FZ range - and I've had most up to the FZ150. The X-5 seems comparable to that - and that is praise indeed. AND it's about 45% cheaper. How do Pentax do it?. It can't just be the saving from the brown box it comes in.It is much heavier than the X70 or X90, and that's no bad thing as Pentax's previous 2 bridge cameras felt too light to hold steady at maximum zoom. The EVF is very clear and the 3 inch screen is excellent.The only worry is the battery door, which seems a bit flimsy and you need care to close it securely. Don't know how long AA batteries will last but I've invested in some Sanyo Eneloops.For the money, this is the best bridge camera I've owned. Early days, yes, but I am very impressed!", "Date": "October 3, 2012"}, {"Title": "A really enjoyable camera to use.", "Author": "Adrian", "ReviewID": "R14SGVQPPRF0R", "Overall": "5.0", "Content": "Two weeks ago, I bought my second X5. I was making up for a mistake I made a few months ago when I sold my X5 over a SX50.I've tried Nikon superzooms, and found their photos lack colour saturation and sharpness, and the Fujifilm HS superzoom series, and dislike their software and controls, so I bought the Canon SX50 in December 2012, and when I heard the Pentax X5 came out, decided to give it a try too. They were two different beasts. I decided to keep the Canon and sell the X5 because the X5 was heavier, and I travel as light as possible. But in hindsight, that was a mistake. For although it was lighter, the SX50 was not very user friendly, at least in my hands. In the end, the X5 was a better match and I've sold the SX50 and bought the X5 again, and a Peak Camera Clip to attach to my backpack straps when I go hiking.Pros:----- - Price. Although price was not an issue for me, I can easily see that the form, features and function of the X5 exceeds that of every other superzoom of the same price. - Zoom. Funnily enough, the X5 zoom seems to goe further than 580mm, imho. I have never measured it, but having used to many, it seems to be as long as those that go to 680, 720 or even 800mm. Entirely subjective, but that's how I honestly feel about it. - Wide angle- the 22.3mm wide angle (35mm equiv) is incredibly useful. You can easily point the camera around for self portraits, or for taking landscapes, or large group photos. Really can't emphasise how useful this wide angle is. - Ergonomics. This means- is everything where it should be, is it easy to use, do things get in the way of your fingers/eyes/nose. etc. The answer is that although it looks a bit messy (compared to the Canon SX50), it's very good.eg's- the electronic eyepiece, sticks out a few mm further than most, making it easier to look through, as you don't jam your nose against the LCD screen as much. The EVF itself is only average, but it's much more comfortable to use.- There's a rubber pad where your thumb goes for easier gripping.- The right hand grip fits my hand almost perfectly. I can carry the camera very easily.- Buttons do not interfere. The Canon SX50 had a very light D ring, and often I would try to take a photo quickly, and after laboriously flipping open the 2 axis LCD, would try to take a photo, only to find I'd pressed the D ring and accessed some other function and no photo was taken. I'd then have to close that menu and restart. It wasn't just me. A Third of the time I gave the camera, in auto, to take photos for me, the user had the same thing happen to them as well. -  Fast start up. Press the on button, and you're ready to go in half a second. Much better than many compact sensor sized camera's I've used, and better than the SX50. Writing speed is a different issue though. - Good range of functions, easy to use menu system, useable information on the display. I am used to the Pentax menu though, from previous dslr's so I'm biased here. - Good battery life (although it contributes to camera weight, using x 4 AA's - Good looking camera, seems durable. - Tiltable LCD screen. It's only up and down, so not totally as versatile as two axis LCD's but I feel 90% of photos can be taken using single axis only, and it's so much quicker taking photos than fiddling with everything and needing 2 hands to balance the camera and screen. - Red dotted button for single touch video. (I never use it though) - Green dot button so you can customise the 4 D pad buttons- hold down Green button while pressing the D pad button for a customised function. - Battery cover has a lock- not just click into close position, but actual switch for lock. This again is in contrast to the SX50 which did not have the lock switch, and opened 4-5 times on me, so the battery slid out, even though there was an internal latch supposedly to hold battery in. - Oh yeah- what about the photos? Quality is good for the class, with good colour richness, accuracy and saturation, although you can adjust these too. Reasonable out of focus look, although hardly dlsr lens quality bokeh. - Decent auto focus.Cons:----- - Heavier than competitors. - Can't get rid of Pentax screen on startup- might make turning the camera on even faster. - Slowish write speed, even using a Class 10 SD card. But at least I can take the photo, due to quick start up. - Fake manual zoom/focus ring. - Can do high speed photo capture- 7-10fps? But it's reduced to 5mp. On the SX50, it was full sized. - Zoom not as far as other brands, despite it's size.Overall, Pentax has come up with a real winner. A well built, highly featured superzoom and, unusually for Pentax, aggressively priced (Pentax have a habit of pricing this at prices higher than their competitors, almost as if they don't want their products to sell......) The fact that I bought another one should say it all. I've already taken hundreds of photos with both X5's. I can't wait to take it hiking with my new Peak camera clip.Thank you for your patience- I do tend to be too wordy!", "Date": "April 21, 2013"}, {"Title": "Unbeatable at this price range.", "Author": "Kalaab M. Pickering", "ReviewID": "R2B9MPCGUTE5PQ", "Overall": "5.0", "Content": "The Pentax X-5 is my second bridge camera, the first being the GE X5.  The GE was a great camera to really learn about manual settings and so forth, but it was easy to outgrow.  I did a lot of searching before deciding on the Pentax, comparing cost, features, and other factors across the board (including DLSRs and system cameras).  My decision to purchase the Pentax involved little compromise, as the camera is full-featured and easy to use.One of the features I was undecided about in terms of bridge cameras is manual focus.  Increasingly, manufacturers are including manual focus as an option, albeit not on the same level as DSLRs.  The Pentax X-5 does include a manual focus mode (digitally controlled through the buttons on the back).  The feature is not quick, but it works extremely well.  This was the only point of compromise I made against the DSLRs I was considering, as manual focus on higher-end cameras is far more controllable and speedy.In any case, the auto focus on this camera is fast and accurate, something that the GE X5 was not capable of being.  The images on this camera are fantastic, and the digital filters can be applied after the picture is taken with the option to save the edited image separate from the original.  The non-destructive nature of this feature is certainly a treat, although it comes at the expense of being able to see the image through the filter as you're taking it.  For instance, you can't switch to a monochrome mode and see what the picture will look like in black and white before you take it.  This can present some challenges if your composition has a lot of lighter colors which would look too similar in monochrome, so you have to do some thinking in terms of composition.  This is much like film cameras and is a limitation that can help you become a better photographer, so I don't mind it too much.The zoom on this camera is fantastic.  You can maintain a high level of detail and control while zoomed in, and the twofold camera stabilizer works well to eliminate jitters at full zoom.  Still, I recommend a tripod for best results.The only thing I wish this camera had was a dedicated time-lapse feature.  It would have been nice to have a mode where the camera took pictures at 10- or 30-second intervals, but no such feature exists.  The only analog to it is actually in video mode, where it cuts frames out at intervals.  The effect is not as detailed or controllable as true time-lapse.Video on this camera is respectable, but not amazing.  The slow-motion capture on this camera suffers on a few counts, as resolution is limited to 640x480 and you can only record 15 seconds at a time (this gives you a full minute of video when you slow it down to normal speeds).  Still, it's fun to play with, as I've gotten some great videos of my kid jumping on his bed.For the price, this camera is unbeatable.  There are still some pretty clear advantages of going with a full-fledged DSLR, but if you need a camera packed with features that carries well, you're looking at the right camera.  In fact, the biggest factor that pushed me towards this camera and away from a DSLR is the portability and ease of carry.  It doesn't take much effort to keep this camera with you.  This is especially important to me, as I live by the old phrase \"The best camera you own is the one that's with you.\"  With this camera, I can have it in my bag at all times and know that the shots I take with it will be amazing.  I highly recommend this camera.", "Date": "February 7, 2013"}, {"Title": "This \"Baby Pentax\" is an amazing value", "Author": "AZSailor", "ReviewID": "R326TPX5BFT3M4", "Overall": "5.0", "Content": "Having been a Pentax afficado since my first Pentax, the legendary Spotmatic II, and doing most of my current work on the Pentax K200D ( and looking forward to the K-5 or its successor), I have found that the Pentax product line has consistently outperformed the Nikons and Canons that I have owned, especially in the 10+ Pentaxes that have never needed service... in spite of some of the tough conditions I put them to in yacht and other outdoor portraiture situations.In getting tired of hauling around my 20+ lb camera bag of Pentax goodies, I was looking for a bridge camera, and after about 6 months of researching the competition, I am very pleased with the Pentax X-5 that arrived from Amazon earlier this week.Living up to the Pentax tradition of quality workmanship, especially for the price, I found that it is a well built, solid camera, about 3/4 of the size of the K-5 and larger than most other bridge cameras that I had tried, but it sits comfortably in my hands, and at just under 5 lbs (with the AA batteries ... a Pentax feature that I love, rather than specialized batteries), it had the feel of nicely balanced camera.After my first test series, in a hand-held mode, I was amazed by the 26x zoom range and the stability of the camera in hand-held mode... on a tripod, with the digital zoom enabled, the detailed manual rates this out to a 186x zoom range.. one of my next tests, probably this weekend.What surprised me at first handling of this camera is the incredible range of features, and this compares with bridge cameras at nearly twice the price... Pentax/Ricoh have pulled off another winner. To really understand all of the features of the camera (there are hundreds), I recommend checking [...]for a great review of the camera, as well as the link to download a .pdf file of the X-5 manual, which I now carry with me on my Kindle app Android tablet.My first few hundred images yielded surprising good results, especially with the Pet Detect feature, which captured my cat in some great poses, under available light conditions. I posted several of the sunset pictures which I took with the X-5 on my facebook page, with a slew of multiple positive reviews, especially on my HDR shot processed in-camera by the X-5. In daylight, at first pass, the X-5 images compare favorably with the results from my K200D, but I'll have to check into this with more tests over the coming days... so far.. the results have been better than expected.While it is limited to the fixed zoom lens, I played around with the macro feature where a fingernail.. at about 1\" fills the frame. Looking forward to using this for jewelry and floral work that I do on some of my websites.What makes the X-5 different from other Pentax DSLR format cameras is the electronic viewfinder, supplemented with an excellent, tiltable 3\" live view display. I have used both features, and depending on your subject, the electronic finder is great for motion shots, while the display viewer is perfect for composing and the playback of images.It lacks a hot shoe contact, but the built in flash seems pretty powerful, and with one of my flash triggered slaves, the X-5 should be a very nice backup camera on my photoshoots.... and my primary camera on my exercise hikes.For the money, I don't think that anything in this price range can beat the features and quality of the X-5, but I do strongly advise reading the User's Manual to fully appreciate all the functions of this camera. In doing so, I found how easily some of the purported shortcomings in a few other reviews on the X-5 can be over-ridden, by some simple programming changes.In short, I just love this \"baby Pentax\" and know that it will be getting a lot of use on shore and on the water, especially with it's water-resistant feature, again, another feature rarely found in bridge DSLRs.", "Date": "December 7, 2012"}, {"Title": "A Huge Step Up From My Sony Point And Shoot", "Author": "Stephen Elmore \"Mark\"", "ReviewID": "R3KI0LFF74O55Q", "Overall": "5.0", "Content": "I have a Sony h55 point and shoot that has many of the settings and manual abilities of the x5 but I wanted better without going full blown dslr. While purchasing a Nikon p&s; with and for my wife at Target the x5 caught my eye. After reading tons of reviews, both pro and amateur, I decided to give it a try. Due to an error on their website and Targets willingness to price match their website I got it for $190 after my Red Card discount.I've had it for about a week, have taken about 400 throw away type photos and about half an hour of video using Duracell Nimh rechargeable batteries and a Transcend Wi-Fi 32gb class 10 card.I've tried out just about every scenario I can think of and changed a bunch of things around just to see what it's capable of. Battery life.Using the rechargeable batteries and Wi-Fi card and wirelessly sending everything to other devices has used about half of the battery life which I have found amazingly better than the Sony. Ease of use and ergonomics.I have big clunky hands and am used to a much smaller camera so it took several dozen shots to get the hang of not holding it like the Sony to get the best and fastest usage of the buttons. Once I got the hang of it somewhat I found the ergonomics to be very finger friendly and the balance of weight to size to be very nice feeling and easy to get my hands into the right position quickly and comfortably. If this will be your first step up from a pocket camera it will have a learning curve on how to hold it and multi task with different fingers comfortably. Settings.I have found it very handy to have several pre set options on the big wheel vs having to go to the menu, scenes, choose. The dedicated video start button is also a nice feature and is put in a place where it's harder to accidentally start shooting a video when you meant to tap the gallery button instead. I found the necessity to press buttons harder a plus but some may find this a minus. As I wrote before, my hands are big and clunky so I'm very apt to touch the wrong button at any given time so the extra pressure needed makes the oops not a big oops.Included Software I can't comment on because my photos will be sent to my tablets and phone wirelessly for any edits or other things I'll do with them so I haven't even unpacked the CD for the desktop. The onboard software for editing on the camera itself is easy to use and does a nice job, my favorite being gray out everything but a chosen color for some unique effects.Display.I really like the tilt outer display but use it only sparingly. The biggest thing I've missed since my old 35mm dayseye focal lens. This one isn't optical and isn't the best at color reproduction within but it does the job more than adequately. One thing I liked about my old Samsung digital, and would've loved on this one was an optical viewfinder to help with battery life if nothing else. On the Samsung using the optical vs LCD tripled the battery life as well as giving a 35mm camera feel that I was used to. On the Sony I just never quite got the hang of no viewfinder besides on the back. Startup and Save times.This and the inability to optically zoom while shooting a video are my only negatives for this unit. From what I've read, a slower save time is the norm for a bridge type camera so I knew going into it wasn't going to be super fast at startup or save times.  Both are much much faster than my h55 but not as fast as the wife's Nikon (l16?). Most shots are saved and the camera is ready again in under a second but it occasionally needs about 2 seconds to write to the card and be ready to shoot once more. Startup time is about as long as it takes for me to get the lens cap situated like I want so it's really no wasted time for me while waiting anyway. Videos.I decided on this over a very similar Fujifilm version because of the 1080 vs 720 capability. I shoot a lot of video and make still shots of my children, animals, etc because it's much easier to get the right still that way. I've found this to be a great usage on the videos shot from this camera. I get the stills I want that are high quality to look at and large file sizes for printing. This one seriously blows away my Sony when zoomed out at not only lack of blur but color accuracy and realism. It films in .mov for ease of use with QuickTime so I convert them to .mp4 for ease of use on my Android devices. I got some really cool stills of a Seahawk (aka Osprey) diving into the Appomattox river and bringing out a fish. Photos.As I wrote before I've put it through its paces in every light and environment condition I can imagine at this point and have found in normal to bright lighting it takes photos on the bright side but 1 step down from 0 on the EV setting takes it back to natural in most cases,2 steps down at most. Low to no light I've found it to be very natural in coloring and accurate unless I set it up totally wrong. This is why I'm taking throw away photos so I can get the personality of the camera. Manual focus is pretty cool, thigh not super fast to setup. As an example I took a few photos of a tree in the rain from inside my truck using this and was able to get the tree in 1 shot, the raindrops on the windshield in another and a mixture of both in yet another.Macro focus is awesome and makes some beautiful shots of flora and insects.The zoom is another reason I got it but I had no idea how much better 26x is than 14x is at bringing things in closer. The wow factor for me with the zoom maxed out is not only the accuracy of the photos but also how well the image stabilization works under the extreme condition. I've been using a monopod often because I can't hold myself still enough to keep the focal object in center without it. The anti shake makes a very stable shot but holding by hand the stable is well off center from my desired result. It looks like my 5 year old got a hold of my camera and started shooting things. I guess what I'm saying is the camera is much better than the operator in this case without the user having something to stabilize the device. I do get an occasional out of focus shot when zoomed out fully and in totally dark trying to use focus assist but good golly what I was shooting totally dark and 25-50' away so I'm not saying that as a negative of the camera but a negative of the users choice of what I was trying to do and 8 of 10 came out fine.I find myself using Program the most so far because it's almost like Auto but gives me abilities to fine tune some things that Auto won't allow. I'll  use User with the settings I've got from Program  at some point as my most used probably. If I get to the point where manual is most used, like on the Sony, I'll know it's time to think about the next level for me. Overall impression.Some complain about the build quality and battery door but I like the feel and weight and haven't had any problems with the battery door not closing right or feeling unsecured. I just use both thumbs to line it up before closing and it easily snaps into place. Using a Wi-Fi card will help me not need to use the door as often also.If you are looking for $600+ camera results, you might be very disappointed but if you, like me, want very very good shots with a camera small enough and easy enough to carry and use with kids in tow this one is a keeper. This is not some dslr wanna be but what it is is a nice step up from the standard no nonsense, no user settings camera.I always used Pentax in my 35mm days and it's good to see the company still makes a good product that's an excellent value.", "Date": "June 16, 2013"}, {"Title": "Pentax X-5 or Nikon Coolpix P520", "Author": "J. Welch \"abalonebabe\"", "ReviewID": "R1GDD6NL4DPVIS", "Overall": "4.0", "Content": "I bought the Nikon at Costco.  I didn't know anything about it; but it was offered at $50 discount.  It's is a great camera; but I decided I do not NEED GPS or wireless feature so I researched online for a camera with same other features and found the X-5.  I saved $200 after buying this camera including an additional Extreme 32 GB HDSD memory  card.  I took photos to compare and found both cameras very close in quality of my usual macro jewelry shots.  Also, the 1080 video was same in both.  Of course, the zoon is 26X in the Pentax as compared to 42X; but I rarely use that focal length because it is hard to hold steady.  And the 2 MP difference between the two is undetectable to me.Features I prefer in the X-5 and were important to me:  The EVF button to change from large display to viewfinder; it uses AA batteries so the camera is always free to use. I also like the one language operating manual which is complete for everything I will ever want to do with the camera.I'm keeping the Pentax X-5.Goods reviews:  http://digital-photography-school.com/pentax-x-5-review and http://digital-photography-school.com/nikon-coolpix-p520", "Date": "June 23, 2013"}, {"Title": "Value for Money, quality without extravagance", "Author": "BergerKing", "ReviewID": "R14M2BNQCOABUY", "Overall": "5.0", "Content": "Cons: No Manual Zoom, only two selectable aperture values.The above are the only two negatives I have for this camera.It looks good, love the tiltable LCD screen ( there's better screens out there, but not at this price).Focus rather quickly, good image quality for a sensor of this size.Obvious strengths in its macro ability, showing rather good details.Again.... You can get better cameras but not one with such all rounded capability at this price point!", "Date": "November 19, 2012"}, {"Title": "Stepping up to a better camera!", "Author": "KRK", "ReviewID": "R4YW8G5X3G32W", "Overall": "5.0", "Content": "So far, I have been very pleased with this camera.  I'm definitely an amateur, and definitely on a learning curve with this camera.  So many fun, helpful features to learn.Definitely, you can take great pictures using just the default settings. :)Am very pleased with the viewfinder and with the LCD screen image quality too.  Having a viewfinder was a requirement for me.  The viewfinder allows me to compose pictures when in the bright sunlight at the beach!!!", "Date": "October 29, 2012"}, {"Title": "Great value and versatile", "Author": "Chicago John \"Rirelguvat vf rinarfprag.\"", "ReviewID": "R2MKOASPHQU6BK", "Overall": "5.0", "Content": "After reading the many helpful reviews here, I decided to buy one.  I've had a K-5 for about a year and a Pentax 300mm DA SMC that I did a quick comparsion against.  Hand-held from my deck at full optical extension, the X-5 is approximately equivalent to a 380mm lens in an APS-C sensor format; i.e., if you shot a subject at 380mm with a K-5, the image would be just about the same size for the X-5 at full extension. As you would expect, contrast and resolution is marginally better for the K-5 Pentax 300mm combination, but not bad at all for the X-5.  I decided to do a similar comparison at wide angle against the Tamron 10-24mm super wide angle lens in the K-5 with APS-C sensor.  The wide angle on the X-5 lens is equivalent in terms of image size on the K-5 with the Tamron lens at 17 mm is the same as the widest setting on the X-5 lens.So for those of use who don't have the means to use full frame 35mm sensors, in terms of the typical DSLR, this X-5 camera produces images equivalent in size to a range of 17 - 380 mm; at 16MP.  Not bad for an all-in-one camera.After some tests, the selection between a high and low f/number in Manual mode seems to produce identical Depth of Field results suggesting that this \"aperture\" selection is really just a EV difference, likely done electronically; the same sort of effect you would get by using a 3.5 EV neutral density filter, allowing you to use a slower shutter speed than otherwise possible.  From what I see, I would say the lens aperture is fixed.  Although I wasn't able to change DoF, the choice of \"f/numbers\" could be useful in achieving the desired exposure under bright conditions.You can turn it on without removing the lens cap if you turn it on by holding down the playback button and you're in playback mode and if you don't, mine didn't pop the lens cap off as someone said would happen; I was just asked to confirm when I had removed it.  No problem.I like it that you can program the \"Green Button\" as a separate function button and assign often used operations to the four-way controller.  I programmed mine with ISO, Focus Area, Exposure Metering Area, and White Balance, the four things I tend to change most often, so I can reset ISO, for example, or the other three quickly with just a few button presses.I like being able to turn off the big LCD and see the smaller version through the viewfinder, but the tilt-out LCD is great for taking pictures of plants that are closer to the ground; when I get down on my knees at my age it's hard to get back up again :)It does a very nice job with close-up focusing, and whereas I had been using a Tamron 90mm macro lens with the K-5, the X-5 will do just fine for documentation purposes.  I'd tried to use my Optio W80 for wildflowers, but with the noise issues there at even moderate ISO, no viewfinder, no tilting LCD, and various other problems (such as no manual controls), the X-5 solves all those without being too heavy and bulky to carry around for three hours in the summer sun.It would have been nice to have a separate slot for the SD card so you didn't have to open the battery compartment every time you need to get it out, and I'm hopeful that the Pentax design engineers picked the right materials so it lasts awhile.  It's very similar to my K100D Super battery compartment latch and that's lasted for 5-6 years with 15,000 shots without any signs of a problem.Even through there will be a significant loss in dynamic range, still I can use Adobe Camera Raw with the jpgs.  I'm expecting the D-Range options to make up a little of the difference but I guess I'll have to start paying more attention to exposure than I have been.So that's a quick first impression, and I'll update this after a month or so of use in the field and on an upcoming vacation, leaving the heavy camera bag and tripod at home.", "Date": "August 14, 2013"}, {"Title": "Inexpensive, versatile camera that takes great pics.", "Author": "David Atkinson", "ReviewID": "R2URN6P7BPHMTQ", "Overall": "5.0", "Content": "The Pentax X-5 is a great camera. I wanted a versatile camera I could leave in the glove compartment of my car, so I would not miss great photo ops that appeared before me. It has a 26x optical zoom, which allows great shots from a distance as well as the ability to shoot macro as close as 1cm away (less than half an inch). While the X-5 does not replace my DSLR is is an amazing addition to my camera collection. I highly recommend it.", "Date": "February 20, 2013"}, {"Title": "Guess I got the dud", "Author": "CharlieSnAZ", "ReviewID": "R3AGZO6M2YS5IR", "Overall": "2.0", "Content": "Caught a sale at a brick & mortar. First thing I noticed was the size as it's a pretty chubby unit. It has to be for the size of the lens and to hold the 4 AA batteries. Parts, like the popup flash and battery door, felt flimsy. A serviceable neck strap, lens cover and batteries were included along with a manual and CD. I took it to Desert Botanical Garden for some trial shots.An Optical Viewfinder, I feel, is a must have for those of us who benefit from bifocals. That's an addition that brought me to this camera in the first place. Although the primary screen is very nice, I can't see it well, especially in the bright sun.The zoom is very fast but the autofocus didn't seem to be able to keep pace as seen through the viewfinder. Several shots were delayed and some missed. The fast zoom prohibited smooth, incremental adjustments.  The viewfinder image was grainy and lacked color and gentle contrast; a poor grayscale appearance.  That image was so bad that I could not distinguish a shadow from a hole in the ground, literally, and had to keep looking aside to see if the Roundtail Ground Squirrel was still posing.  The finale was the viewfinder developing a vertical stripe, noise-like, extending along the right side of the image covering about 20%.Most of the 50 or so pictures I took look great. However, when the continuous shot mode was employed, it was painfully slow to cycle. Ultimately, this unit was a major disappointment despite its \"on paper\" great features and abilities. To avoid some questions: 1) fresh batteries-yes, 2) knowledge of camera settings and their use-yes, 3) Class 10 SDHC card-yes, 4)unusually high expectations-compared to my old Canon PowerShot A560, this Pentax was slow and took more time to get a decent picture.", "Date": "June 17, 2013"}, {"Title": "Nice camera with a bit of shoddy thrown in", "Author": "Kimtee", "ReviewID": "RFO0ECJGGUHRU", "Overall": "4.0", "Content": "Just received this camera and happy overall with image quality, although still haven't given it a read test drive. The zoom and stabilization features excellent and the camera easy to navigate, which I think will allow for quick photo taking when traveling. I was surprised that no san card included since last couple cameras came with the a cheapie. A detail that does concern me is the battery holder; the hinged flap is quite flimsy and does not close easily. Although there's a lock to keep the four AA batteries in place, the flap seems quite cheap so hope it doesn't break easily when swapping batteries. I bought this as a \"bridge camera\" and for the price, can't be beat. I did a great deal of foot work in reading reviews of this and competitor cameras and this won me over for a number of reasons. I was especially drawn to the viewfinder, which many cameras in this price range don't have and the quick, easy way it can be engaged, switching easily from the screen to viewfinder with click of a button. The screen also pulls out to adjust its angle, something that's helpful when accommodating for various changes in light.", "Date": "June 25, 2013"}, {"Title": "Great camera, super price", "Author": "Terry Cornelius \"Woodcanoeguy\"", "ReviewID": "R1CNTQ60IUCRAR", "Overall": "5.0", "Content": "You can read all the specs elsewhere.....I ordered this Monday and it arrived today....immediately went out in our farmyard and snapped some test pics.  All I can say is WOW.......clean, crisp images...perfectly exposed.  The 5mp ones looked almost as good as the 16mp pics.....the 16 are superb.  For $230 this is a real bargain for all the features and is now replacing my Sony and Nikon cameras.", "Date": "December 5, 2012"}, {"Title": "Defective--Freezes frequently", "Author": "Richard Hill", "ReviewID": "R22Y4QQL575KT2", "Overall": "2.0", "Content": "I believe I would have rated this camera at 4 stars, except it was defective and needed to be returned.  The problem was it froze repeatedly.  I would press the button to release the shutter, capturing the shot in the view finder, but nothing happened after that.  That image remained in the viewfinder indefinitely.  The only way I found to unfreeze it was to remove the batteries.  Occasionally, the freezing would happen while it was writing the picture to the card;  in that case, the viewfinder would be black and the power switch would blink.  Again, that went on indefinitely until the batteries were removed.  Pressing any button would have no effect while the camera was frozen.  The happened often after just one or two shots.  I believe the longest the camera worked without freezing was 6 or 7 shots.  I looked on-line for advice and found little;  I tried re-formatting the card--that had no effect on the situation.Had the camera worked without freezing, I would have been happy with it.  It had a good feel, turned on quickly and had a wide assortment of settings.  The electronic stabilization worked extremely well--pictures taken at full zoom were crisp and well-focused.One thing I did not like about the Pentax is that you cannot screw a u/v lens to the front, so the lens is completely unprotected once the lens cover is removed.  It was a hassle to remove the cover each time you started up the camera, and then remember to replace it after each use.  My old camera had a tube that covered the lens even when it was fully extended which accepted a u/v lens.  As a result, the primary lens was fully protected at all times without any operator intervention.After returning this camera, I decided to Panasonic Lumix FZ200.  It seems to have much the same features of the Pentax, but accepts filters over the lens.  It requires a specific battery (an additional advantage of the Pentax is that it uses 4 standard AA batteries), and is considerable more expensive than the Pentax, but seems to have similar features otherwise.", "Date": "March 2, 2014"}, {"Title": "Pentax is not what it used to be.", "Author": "Farthion", "ReviewID": "R2IXPRGYI010L9", "Overall": "3.0", "Content": "The X-5 is a GREAT camera, except at night with the flash.The pictures were clear and crisp.  The color was fine.  The start-up and shutter speeds were OK and it has a hell of a telephoto ability.  The sliding screen in the back makes for easy awkward-angle pictures.  The options were sufficient for most people's point 'n shoot needs or for something a touch more sophisticated.Why just three stars, then?The issue is with the flash (at least based on the posts of others and my own trouble-shooting of it).Using the default settings in auto and with the flash in a darkened environment (night shooting), this device will take about 4-6 pictures, then lock up.  You have to pop the battery compartment open, close it back up and start the thing again, at which point it says \"battery depleted\" and turns off again.  (The batteries are FINE, by the way).  Turning it back on gets you back to the normal screen.I tried this today in day and night use (darkened room simulated night).  In daylight, it took pictures fine (20 in a row, no problems).  I even used flash in the daylight (again, 20 in a row, no problem).  I went into the dark room and took 20 without flash.  No problem.  I popped up the flash, got about 8 pictures and it locked up.  I reset, took 20 more without flash and had no problems.  I popped up the flash unit and it locked up after 6.  I reset, left the flash unit up and it locked up after 5.  The fun part is that this only happened to me on auto.  I went to check the other \"usual user\" setting and switched to SCN then I took 20 low-light flash shots without a single hitch.So there is a work-around, but since Pentax barely acknowledges they make these things (you can't find them on the Ricoh sight, there are no firmware updates and it took me about a hour to find a manufacturer's site that even listed the X-5) and it's been out for nearly a year and a half without any firmware updates, it's not likely they'll ever issue a firmware update to deal with the problem.There are some relatively cheap lighting options for indoor use available (which I'll be getting) that can make this camera functional for everything else except night-time flash.  If the SCN setting works well, then you have what you need.  But avoid the AUTO function if you're taking flash shots.  If it had better support and a fix, this would probably earn four stars from a pro using it as a fast back-up, and at least four or five stars from most beginners as their main camera.", "Date": "February 24, 2014"}, {"Title": "Quality blew me away!", "Author": "Nick P.", "ReviewID": "R16DEFDN403LK3", "Overall": "5.0", "Content": "I purchased the X-5 because it seemed less complicated than the refurbished Canon SX10, I purchased about a year ago. let's compare the cameras from two points one, the Canon hands down beats the Pentax in terms camera finish. But inside the Canon is just too much computer for me. I find myself consulting the manual all the time. And this wastes the time I devoted to taking pictures. Enter the Pentax X-5 for half the price on a retail basis. Pentax you messed up big time for discontinuing this camera!  My wife & I went to a wild animal park  the week end before Easter and shot some of the \"creatures\" . I got a picture of a couple of mandarin ducks. Rather than have an 11x14 enlargement made which is my testing \"tool\", I decided to blow it up to 16x20. Wow, oh wow, was my reaction! The duck are sharp as a tack! The color (which is native to ducks) comes out and hits you in the face! I went out and bought a $45 frame to hang in my house! Yes PENTAX, you really messed up discontinuing this camera. People if you can find a left over Pentax X-5 grab it is my ultimate recommendation-45+ yrs professional wedding photographer -retired.", "Date": "April 21, 2014"}, {"Title": "Best camera out there in this price range!!!", "Author": "A. Wilson", "ReviewID": "R1GEOEI4VB3AVL", "Overall": "5.0", "Content": "I love this camera.  It has an incredible zoom capability (I've taken pictures from a cliff of surfers in the water below me, and the zoom is good enough that I can practically see their expressions), it takes awesome action shots, and generally does everything I want it to do.  The hundred dollar difference between this camera and a cheap point-and-shoot is more than worth it.  If you want a better camera than this one, you'll probably going to have to fork over a whole lot more cash.  For me, this is all I will need for a long time.  Oddly, I enjoy the fact that it uses AA batteries...I've had troubles in the past with chargers for proprietary lithium batteries getting lost, and then you're out of luck.  I just use rechargeable AA batteries, and then switch them out as needed.  Bottom line...I don't think you're going to find a better camera for this price.  Two thumbs up!", "Date": "December 7, 2013"}, {"Title": "Pretty great deal for a mega-zoom bridge digital camera", "Author": "R. Alfonso \"rixmac\"", "ReviewID": "R3K0HFT3KUVTIC", "Overall": "4.0", "Content": "If you've moved back to slrs of the digital kind, you will probably think this is one slugglsh and low light hating camera. If you have stayed mostly with the altoid container-sized point and shoots, you will probably find this to be quite an amazing sub $200 camera. Stay away from full zoom in in medium to low light and you'll be pleased with the pictures.", "Date": "November 29, 2013"}, {"Title": "Way beyond a point and shoot camera!", "Author": "RioRichard", "ReviewID": "R2IKN1B7S8PS97", "Overall": "5.0", "Content": "The X-5 is everything I hoped it would be and has so many options, etc., it is like a pro camera in your hands. The 26X magnification will reach out there and touch some one or some thing. It sure makes photography fun. I do far less editing with this camera than I did with my old one. You do need to read the manual in order to get the most out of your X-5 Silver.", "Date": "August 29, 2013"}, {"Title": "Love it", "Author": "Lm", "ReviewID": "R2KO6YSKAWJN4I", "Overall": "5.0", "Content": "We bought a Pentax camera about 15 years ago and loved it. Since then the pixels on digital cameras have increased so we wanted to upgrade. Took this one on vacation. Easy to use; great for quick capture movies and can take nearly any type of picture. So excited about this camera, thinking about taking a photograpghy class.", "Date": "January 11, 2013"}, {"Title": "Very good Stabilized Zoom", "Author": "F. Lum", "ReviewID": "R1BCGD24LLUFI6", "Overall": "3.0", "Content": "I got this to replace my SP-560UZ 8.0 megapixel with18x zoom, which just fits in my pants pocket.  This camera is a little too large to fit.  I do a lot of outdoor shots so both have the eye piece to get good shots.  The on/off button on this camera is quite difficult to find and activate, especially in a rush to take a shot.  I have to remove the cover to look at shots I took, which is a hinderance, because I have to put it back on, when done, to protect the lens.  The cover clicks on well.The stabilized zoom is a pleasure to work with.  The digital kicks in, after the optical zoom, to give a longer range.  Need a tripod, of course, to do that, though.  Makes you wonder how snipers can be so steady on their shots.  On the other hand, the wide angle is very good.  The battery indicator is a big help too.  However, rechargeable batteries sort of die on the spot, when they run out, so not much warning is shown.  AA batteries are easy to get as other cameras have special batteries.Will read and study more of the manual  to see how to use the rest of its features.  Tried the movie shots, but rarely use them.  If I want movies, I'll use a movie camera.I waited a week too long to buy this camera so it cost me $50 more.  Still worth it though. Especially with so many cameras no longer come with an EV.  The tilt display/view feature is not that useful for me.  I take my shots straight on.  Shoot em as you see em.The SD card this uses is more of a standard, and available is huge sizes.  The xD card I was using on the SP560uz is too special and best I could get was 2gb size.  It sufficed for my needs, though.  I would be inclined to take some movies with this 32gb SD card I purchased.", "Date": "July 28, 2013"}, {"Title": "Nice Camera! Nice Price!", "Author": "Jeffrey Spring", "ReviewID": "R5VZ3XTS9L8P4", "Overall": "5.0", "Content": "I couldn't be more pleased. While it did lack some \"basic\" features like a UV filter and threads for one, this seems to be the \"norm\" for this level of product. Images are sharp. Color is good. Camera is small, yet easy to grip. The tilt display/viewer is indispensable for my uses. I do a lot of ground level photography and get tired of laying in the mud. The standard viewer is also clear and one does not have to miss shots because of bright daytime lighting conditions rendering the LCD useless. The ability to select aperture or shutter speed manual exposures and particularly manual \"focus\" is just icing on the cake. The zoom takes a bit to get used to (it's very fast). I also like the infrared focus assist for low light conditions. I have been a Nikon user for years (I still have my Nikon F), but was disappointed with the P520. Plus it didn't work on aperture setting when it arrived, so I returned it. Amazon was fine with that. I really wanted the tilt back, so I looked around for quite some time until I found this camera. Pentax has been the staple for photography art students for years and they have a good reputation for ruggedness and overall dependability. Add to that, it costs much less than some others, made my decision easy. This camera may have more features than you need, but it has a very reliable and accurate \"Auto\" mode, so you can just point and shoot and feel confident you got the shot you wanted. In summation (finally) I would highly recommend this camera.", "Date": "November 26, 2013"}, {"Title": "My go to camera", "Author": "LA in N.C. \"LA\"", "ReviewID": "R3IOXDHCLZRP9V", "Overall": "4.0", "Content": "I'm on a trip to the Turks & Caicos now and decided to take this camera instead of my heavy DSLR, the Canon EOS Rebel t3. Best choice for me! I had not used this  Pentax much because the Rebel is so excellent, but now I love this one.I used these functions for the first time:HDR..so much fun to see the crazy colors it does, like a paintingall the scene choices are very good, 19 different ones..even a food one which I use a lot for memories on my trip.the full moon photo was not perfect but that's because I had no tripod.GREAT ZOOM and stabilizationMovie shakes a lot but again that's me..I'm no movie maker!I am concerned about opening and closing the battery and card compartment. I would have liked a compartment for just the card. The door feels like it will break off.  I open this constantly and have to be careful.The manual is 208 pages...very complete, so I carry it when I use the cameraand Yes bright is VERY bright, I need to experiment more.The camera is plastic and will wear over time.The flip up screen is fun and useable for some situations, but not many for me.The EVF is wonderful as I believe I get a better picture when I use it. Very hard to see the screen in bright light.ALSO Battery life is amazing, I've taken well over 700 shots and it still shows full battery (hope this is true!)ENJOY", "Date": "April 27, 2013"}, {"Title": "OK.  Can't they do better?", "Author": "John Barbur", "ReviewID": "R1UU53XFVHLJYV", "Overall": "4.0", "Content": "The battery compartment latch is very, very, very flimsy.  I have had another camera with a similar latch, and it broke.  This camera requires four batteries.  Other equally good cameras require only two batteries with the same ability to hold the charge and take numerous pictures over time.  Be prepared to purchase several quads of rechargeable batteries to feed the camera.  It is slow to obtain an initial image (missed that picture!); the zoom is very jerky (slight touch zooms rapidly in or out).  And most frustrating, the focus on face feature randomly seizes on objects not wanted to be in focus.  So, expect to take many pictures, with different focal points, to get the desired image that is in focus.  Otherwise, this camera is OK.", "Date": "September 20, 2013"}, {"Title": "Perfect color depiction.", "Author": "Judith R. Heinemann", "ReviewID": "R2YARQK50KFEH3", "Overall": "5.0", "Content": "A lot of camera for $200.  Thank you. Pentax color is complete accuracy.Light and user friendly with comfortable grip.", "Date": "January 26, 2014"}, {"Title": "Camera", "Author": "Mary Roth", "ReviewID": "R2BZVM04WELLT2", "Overall": "5.0", "Content": "Perfect camera for the between small, pocket camera and large, multi-lens outfit (I have both) - I've used Pentax for years and prefer them, so was thrilled to find this camera in their collection.  Great pics.", "Date": "October 25, 2013"}, {"Title": "Pentax Camera", "Author": "Nancy Lomerson", "ReviewID": "R2S9JV3BYDMNE8", "Overall": "4.0", "Content": "My brother has always used Pentax camera equipment.  He was very particular in what he used.  I like this camera very much.  I must agree with other reviewers about the door to the batteries and Memory Card.  I wish the door was easier to open and close.  Seems kind of flimsy, but overall, real nice camera.  Thanks.", "Date": "October 24, 2013"}, {"Title": "Amazing camera achieving price/value breakthrough", "Author": "Paul M. Leong", "ReviewID": "R1C598NQ2G4PGT", "Overall": "5.0", "Content": "I love taking macro shots with my Pentax X-5.  I did compare it with my Nikon 105mm F2.8 and was very impressed with Pentax X-5 macro shots.  Great value for the price.  Light and compact enough to carry on hiking trips and the lens range 22.5mm - 580mm is good to cover all my shooting requirements.  Awesome product!  Great all-around bridge camera.  It will be my companion camera to go with my D3.Ricoh Imaging/Pentax got it right this time.", "Date": "October 10, 2013"}, {"Title": "Great camera", "Author": "ruth blair", "ReviewID": "R313OW8G99BZB2", "Overall": "5.0", "Content": "Even better than I expected. Especially like the macro settings, great for extreme close ups. The editing software is more versatile than Kodak. Definitely go for rechargeable batteries because it takes 4 AA's, the good news is the camera is kind on the power so those batteries will keep you running for days. Overall very pleased, it's not rugged, I'm pretty sure a couple good bounces off the ground and it would be toast, but I use it to photograph jewelry, clothing and assorted stuff for eBay. It's nice to switch to the viewfinder to take pics outside without shooting blind because the large screen looses its charm in the bright sunlight, nice to have the option. Pretty intuitive on the technology, not difficult to learn how to use all the bells and whistles. I've had it a couple of months now and so far very pleased.", "Date": "September 13, 2013"}, {"Title": "A Good Buy", "Author": "James Jones", "ReviewID": "R19LWZBZH75R7D", "Overall": "4.0", "Content": "I consider this camera a good buy for the money, lots more features than most camera's  for the price. (Maybe too many features for this novice) Takes excellent pictures, haven't tried the movies yet.I love the choice of viewfinder, or LCD screen, I use the viewfinder the most. A slight negative would be the camera's weight, a bit heavier than I expected. A bigger negative for me is the instruction book, in my opinion, not clear enough about some of the features, I'm not a practiced photographer.This would be an excellent buy for the person who knows more about digital photography, it has lots of bells and whistles.", "Date": "June 15, 2013"}, {"Title": "Great Bridge Camera", "Author": "Geri", "ReviewID": "R1I0IURLT6FILV", "Overall": "4.0", "Content": "Pros:Great in low light. The flash doesn't pop up automatically, like my Pentax K-r DSLR, so I forget to pop it up sometimes. Surprisingly, most of those photos came out rather well, even without a flash. The Zoom feature is phenomenal! The optical zoom is equivalent to my K-r 300 mm zoom lens (without the weight). The additional digital zoom is amazing! Of course you need to use a tripod to get a good shot at that level of zoom, but it's great. It's so convenient to carry & have the wide angle to zoom abilities without having to carry a bagful of equipment. It doesn't have a real adjustable aperture. It uses a ND digital filter to adjust the light, so you don't get the blurred background in close-ups & zoomed photos, but sometimes, I like that.  It's like my old point & shoot. The ND filter feature solves the mystery of why all of my point & shoot photos had such deep depth-of-field in all the photos! The Macro & Super-macro features are amazing! I took photos of my jewelry, some at ~ 3\" & the detail is superb!Cons: What's up with the pink flare in some photos? Someone else mentioned that also. I got it while photographing jewelry on a red velvet background.  I also, like someone else, found that some photos were slightly overexposed. I set my EV compensation to -.3 & saved it in \"User\" mode. I don't like face detection, so I also turned that off in \"User\" mode. I just use \"User\" mode now most of the time.The video is good. I like it better than my K-r. The K-r has a noisy image stabilizer which turns up in the video audio.  I like the X-5 video. Can do low to high def video. Also has a quick red button that can switch to video in a flash while in still photo mode! Very convenient. Oh, & the tiltable 3\" screen is great. My K-r doesn't do that.The software that came with it didn't work very well. I installed it & it recognizes the photos that were on my computer before I installed it, but nothing that I put on after. I updated it & still the same. I deleted it & reinstalled & re-updated & still the same. I just deleted it. I have other software.This is a Keeper.  I love my Pentax.  Have been using Pentax since the K-1000 in 1970.", "Date": "June 11, 2013"}, {"Title": "Excellent capability for the price", "Author": "d.geyer2@ix.netcom.com", "ReviewID": "R3GJLWVTF2WW5M", "Overall": "5.0", "Content": "I was curious as to whether or not a point and shoot camera for this price would deliver useful images so I bought one to try it out.  I use the camera as a simple point and shoot and have only used the camera in the auto mode so I imagine there are things the camera can do that I have not yet tried out, however, the images I have taken, in a number of different light level situations are clear and sharp and the image stabilization works well.  If there are other cameras out there that give this good an optical/image performance for the price I don't know of them.  I use rechargeable AA batteries and they last a long time.  The only potential downer for this camera might be that the camera is not a pocket camera - has a decent lens on it - sort of mid-way in size between a DSLR and a pocket camera.", "Date": "June 9, 2013"}, {"Title": "Lens needed repair.", "Author": "David Kagel", "ReviewID": "R19RB34R5VJDMX", "Overall": "3.0", "Content": "After 5 months of infrequent use, the lens stopped working and camera shut down. The lens did not retract into housing at shut down, then would not turn on. Error message. Sent to Pentax for warranty repair, no charge repair. Overall easy to use for beginner and many functions to use as my daughter learns more about photography.", "Date": "May 28, 2013"}, {"Title": "love my new camera", "Author": "Julie Bayliss", "ReviewID": "R31AMKZP7U0LDT", "Overall": "5.0", "Content": "I wanted a camera that has a actual viewfinder. the buttons and setting are large enough that I can see without having to put on my glasses. It is a nice weight. Has some heft to it but not too heavy. It takes awesome nighttime pictures. Inside pictures are very good. I still need to experiment a little with that.", "Date": "January 11, 2013"}, {"Title": "This is a Great Camera!", "Author": "BIZ-EE \"Southern Style\"", "ReviewID": "R2JR4YI6HPK06B", "Overall": "5.0", "Content": "I had a Pentax Optio and then display stopped working after 5 years of great use.  I have been looking for another camera that had super macro and Pentax finally came out with this one. It takes great pictures and is easy to use.  It serves all my needs in a camera.", "Date": "December 10, 2012"}, {"Title": "Almost a masterpiece camera", "Author": "Federico Sánchez \"Frederick\"", "ReviewID": "RP0AO3VYRJ3VN", "Overall": "4.0", "Content": "Almost perfect, what a shame that it doesn't record sound in stereo, very practical it uses 4 AA batteries, the little sister or the Pentax K-5", "Date": "November 26, 2012"}, {"Title": "Under Exposure?", "Author": "mateo52 \"invisible man\"", "ReviewID": "R1WD8IE6M64EI1", "Overall": "4.0", "Content": "At this point I don't know if I even qualify as a hobbyist but I did want a dependable camera in the bridge category for special events and vacation photography and with due acknowledgement of the ego factor, at least look like I might have some photographic skills without taking on the full challenges of a DSLR. I've been an advocate of the Pentax family of products since the 70's but with all of the prominence of Nikon and Canon at the price point I was comfortable with I kind of assumed that's where I would gravitate. However, after evaluation of competitive models including the Nikon Coolpix L810, Canon Powershot SX500 and Fujifilm Finepix S4000, based on my non-negotiable first requirement - dual viewfinders - I realized the show pony brands would have to stay in the paddock and old reliable was likely to be saddled up again. As with the other models, the X-5 has a 3\" LCD screen and it is tiltable but I prefer a viewfinder with diopter adjustment especially in bright sunlight situations and that pretty much excluded each of the others under consideration.The X-5 has an ample range of features with an easy to follow comprehensive instruction manual. In my opinion, it also has the look and feel of DSLR with what I consider to be logical placement of mode buttons and controls while obviously not requiring the level of expertise a DSLR would demand. A lot of attention is presently devoted to zoom ranges with 50x zooms growing in popularity but at 26x with lens range from 22.5mm to 580mm thus far this camera appears to be more than adequate and on both ends of the spectrum (close up and long range),  I have been pleased with my results, close shots more so than long range but noise there is  more than likely my lack of talent than the fault of the device. Even so, for standard size prints I have created with an Epson Expressions 800 printer, none have appeared noticeably grainy. Just playing around with the macro button has allowed me to take some great close ups inches from my subject. At this point, I still haven't mastered the zoom function to my satisfaction without use of a tripod so I can't really rave about the anti-shake technology. For those who may wish to work with the RAW filetypes, that option is not available and the slow start up to initial image may render the X-5 unsuitable for those who concentrate on action shots yet for the casual camera user like me I don't believe either of those factors are deal breakers.The camera requires four AA batteries which are installed in the same general area as the SD slot so the compartment door there may get a bit of activity, which might become a concern down the road as it doesn't seem to be the most well designed feature of the camera body although it does lock securely. Additionally, there is a curious dance routine the lens engages in at shutdown that takes a few times to get used to as it initially appears the lens might be malfunctioning.However, for the this market segment the X-5 is a model that should be one on your short list.", "Date": "November 3, 2013"}, {"Title": "Great Camera for the price", "Author": "nelsaadi", "ReviewID": "R1Z3F3XUQFV8K6", "Overall": "5.0", "Content": "I just got this camera couple days ago and I have been so pleased with it so far. Everything is just as advertised. I have read numerous reviews and there is absolutely nothing wrong with the battery door compartment. I have been reading the manual and experimenting as I go and I am on information overload. So much functions and advance features for this camera that you can experiment as you go , or just put in automatic mode and go on and you will not be disappointed. Go and get this camera as soon as you cam you will not be sorry", "Date": "June 7, 2013"}, {"Title": "A big step forward for my photography", "Author": "Howard R. Cooper", "ReviewID": "R2HZXDC040A0GR", "Overall": "5.0", "Content": "After but 2 days of inspection and trial shots, I find the camera has great possaibilaties. A complaint however. The advertisement promised two flash cards to be included in the package.  No cards were in the shipment, however.  I tried to get someone to acknowledge that the promised  cards were not sent.  Amazon, who took the order, and BJ's Wharehouse Co. refused to acknowledge it, and I have a copy of the ad with the BJ name on the ad. The product seems great, but the company that handles the customers are not to be trusted.", "Date": "March 28, 2013"}, {"Title": "Great Camera", "Author": "B.Guerrero", "ReviewID": "R25ERM9B4ZG9NC", "Overall": "5.0", "Content": "This camera is great! It captures every color and just makes the picture look great. I am glad with my purchase. Battery life is good. Video is great. A must buy. I am really enjoying my camera.", "Date": "March 23, 2013"}, {"Title": "Great camera", "Author": "Four Eyes", "ReviewID": "R2PQ57HKZ4ZDZC", "Overall": "5.0", "Content": "Easy to hold...great super macro...I find good battery life with lithium(uses double A)...useful to have view finder as well as articulated screen.", "Date": "May 28, 2014"}, {"Title": "Love this Pentax", "Author": "Anita iorizzo", "ReviewID": "RBL400ATX545G", "Overall": "5.0", "Content": "It's light weight, easy to set up and takes great pictures. I've never been disappointed. If you are looking for an easy camera this is it.", "Date": "May 19, 2014"}, {"Title": "It's a great little camera.", "Author": "David Darragh", "ReviewID": "R2YXTECDJINPV9", "Overall": "5.0", "Content": "My Pentax X-5 takes amazing pictures.  I like it's size.  I having lots of fun learning all of the settings and what it can do.", "Date": "May 17, 2014"}, {"Title": "Great", "Author": "MICHAEL SAMEK", "ReviewID": "R23DFYCWETZE6S", "Overall": "5.0", "Content": "All the  ad said wish I bought it a lot sooner takes great pictures and videos.  Fast delivery . thanks again, now let me get back to taken pictures.", "Date": "May 13, 2014"}, {"Title": "Excellent", "Author": "Tammy Long", "ReviewID": "RWGFT5XP6CILF", "Overall": "5.0", "Content": "It is a great camera with good up close pictures. Only one complaint, the battery door does not go on very easily. You need to set the door just right for it to click. Otherwise, it is terrific.", "Date": "May 9, 2014"}, {"Title": "Nice Camera for the price", "Author": "Yonatan \"Yonatan\"", "ReviewID": "RJA6R2BQTDF7A", "Overall": "4.0", "Content": "I was very surprised by the image quality of this camera.  My intent with the camera was to have something light and portable when I didn't want to lug around my DSLR and its lenses.  If fulfills that requirement nicely.  I didn't expect to see quality like my K-5 but I do believe you can make decent 11x14 prints as long as cropping on the images into too severe.The images have fewer negative sharpening effects than my compact Nikon with the same megapixel count.  My 16x20 blowup from the Nikon all have little white outlines around everything from over-sharpening.  What I don't like about the camera and, I want to stress I am overcritical being a professional:  Focusing is slow so either you need to prefocus or use manual focus if the shot needs to be recorded at the very instant you place your finger on the shutter.  Problem 2 - Auto mode only works in 'bright' mode and often produces overexposed pictures.  Use Program mode instead and set for natural mode and almost every image will come out perfect.  There are ample scene modes.  A word on zoom lens.  Not perfect, but not bad either and better than most 'bridge' cameras.  On the longest end of the zoom, best to use a tripod.  At the long focal length, no anti-shake in any camera will totally stop the blur without something to steady the camera.Now one of the reasons I bought this camera now is because it is being discontinued and a replacement will probably be forthcoming with a huge 60X or thereabout zoom lens to compete with Nikon and Canon and Sony.  25x zooms are bad enough to control distortion, but the lenses of this huge magnification are a disaster and just done for marketing purposes.My overall impression - at $279 its a bargain - at $189 which I paid for it on Amazon - it's a steal!", "Date": "May 6, 2014"}, {"Title": "Great for me", "Author": "Christine Harrison", "ReviewID": "R3MEG76FQI89OV", "Overall": "5.0", "Content": "I love this camera.  It works just fine for me as a beginner.  My pictures are clear and I feel like I am actually able to enjoy taking pictures.", "Date": "May 3, 2014"}, {"Title": "Great Mid-Range Camera", "Author": "Thad L McMullen", "ReviewID": "R1SVF18FDPT47D", "Overall": "5.0", "Content": "This is two year old technology but I'm really impressed with the Pentax X-5 thus far.  It takes really good still pictures and the 1080p video is awesome.  As a private investigator, the ability to imprint the date/time stamp (DTS) on the still pictures is great.  I couldn't quite figure out how to make the DTS display on the video but it is captured in the metadata file so I use iMovie to display the DTS.  I really don't have any complaints at this point but I'll post an update in a few weeks if I run across any negative issues regarding the X-5.", "Date": "March 31, 2014"}, {"Title": "Perfect Travel Camera", "Author": "Darrell Katz", "ReviewID": "R3U9W6EU8NWA05", "Overall": "5.0", "Content": "Smaller than a dSLR, but loaded with useful options, this is a perfect camera for travel or any time lugging a full size rig is a burden.  The X-5 has a good array of manual adjustments to fine tune your photography needs and the Auto setting is just right for most quick snap shots.  Using AA batteries is another plus when traveling; no need to carry a charger - just pop into any store and buy more batteries.", "Date": "March 29, 2014"}, {"Title": "nice camera", "Author": "Todd Wood", "ReviewID": "R38CH0JG5Y35R0", "Overall": "5.0", "Content": "I find that it is easy to operate so far. Haven't had it very long. Replaces a older digital camera.  The price was good.Like the image stabilization. I don't like the battery door very much seems flimsy and I have a little trouble getting it shut but it does stay shut. Choose the Pentax because have a Pentax K1000 and love it.", "Date": "March 16, 2014"}, {"Title": "Very happy", "Author": "Dale E. Marwood", "ReviewID": "RO4QPIXA98TV6", "Overall": "5.0", "Content": "Takes great pics, love the multi-exposure feature for taking pictures of my boys playing sports. I also use it for work.", "Date": "March 8, 2014"}, {"Title": "Excellent camera for the money", "Author": "Amazon Customer \"Pavel Z\"", "ReviewID": "R2DGGGDYINM91T", "Overall": "5.0", "Content": "Excellent camera for the money. The viewfinder was something I considered a must for the good digital camera. Optical zoom is extremely good. It has all the features a moderately advanced photographer may need. The menus are simple and friendly. I own this camera for a couple of weeks now and it works flawlessly. For the price it is just what most people need.", "Date": "March 7, 2014"}, {"Title": "Pentax Functionality across brands is great", "Author": "Paul E Sanchez", "ReviewID": "R2HW76S0YVYG85", "Overall": "5.0", "Content": "I never knew what I was missing with the increased resolution. I like to zoom in on photos for scientific detail and has now become my field camera for must have shots.", "Date": "March 2, 2014"}, {"Title": "Love this camera.", "Author": "susan", "ReviewID": "RP8EX3KBAA17Q", "Overall": "5.0", "Content": "I was looking for a camera that would take great pictures, that wasn't overly complicated. This camera works great. Priced right and arrived quickly.", "Date": "February 17, 2014"}, {"Title": "Pretty Good Camera", "Author": "David S. Greenberg \"DG\"", "ReviewID": "R1HL2Q15QVET5V", "Overall": "5.0", "Content": "I like the camera so far.  It is fairly easy to use.  I am still learning it's features.  Does anybody know where I can find a user group or book that would tell me more about the camera?  It comes with a printed manual which is a pleasant surprise.  The manual is pretty complete.  I am just looking for something more with hints, tips, and lessons.  The auto picture seems to do a pretty good job adapting to different conditions.  With it being winter, I have not found much opportunity to take pictures except of snow.  I am looking forward to this spring when the flower bloom and leaves come out.  I like these general purpose cameras over the SLR's because you don't have to carry a lot of lens and you still get pretty good pictures and they are much more economical.  This camera comes at a pretty good price for what you are getting.", "Date": "February 16, 2014"}, {"Title": "Super.", "Author": "Ken", "ReviewID": "R29CNCQ9MVFOYA", "Overall": "5.0", "Content": "Love the little size of this but so versatile. The optical zoom is fantastic. The quality of pictures is much better then the phone or small digital cameras we have been using in the past. I look forward to using this on my next vacation.", "Date": "January 13, 2014"}, {"Title": "Okay", "Author": "steven emmons", "ReviewID": "R3245DBE3SAJJ5", "Overall": "3.0", "Content": "Camera is okay but not quite what I was expecting. The focus is difficult and it's hard to take a clear shot.", "Date": "January 7, 2014"}, {"Title": "Great Camera", "Author": "stephen wilson", "ReviewID": "RH1VFAPWOUEBX", "Overall": "5.0", "Content": "It is everything I hoped for and more. On auto takes perfect pictures. I am going to the Rockies and expect many wonderful pictures", "Date": "September 7, 2013"}, {"Title": "Simply Beautiful!", "Author": "Jim", "ReviewID": "R16P11JO3QW1N5", "Overall": "5.0", "Content": "Beautiful Camera for the money, Simple to operate, nice sharp, clear photos, and great videos!  This camera has it all!  I love the grip, I will not drop this one!  If you buy this Camera you will not be disappointed!", "Date": "April 21, 2013"}, {"Title": "Great DSLR-like Camera", "Author": "tslick", "ReviewID": "RN5C0BORVJ7IW", "Overall": "4.0", "Content": "This is my first Pentax Camera (Pentax X-5)so I was a little leery as to whether I should buy this or not. After playing around with it in store(Target)I found it to be of better quality than Sony and Fujifilm cameras which are very popular on todays market. I was greatly impressed with the image quality and I found that close ups (Flowers, small objects, etc.) were quite clear. Although, it did take a while for the camera to focus on up close objects, which is not a big deal. The macro mode is very sufficient and produces sharp, up-close images. The interface was very easy to figure out after I played around with it for a while. The viewfinder is great for sunny days but if your taking shots that are really close to you, I suggest you use the 3 inch LCD (Which is very impressive might I say). One flaw was the use of FOUR AA batteries. The Lithium Ion battery used in most Point-and-Shoot cameras is much easier than using rechargeable batteries. That's the only reason this gets 4 stars. Plus the battery compartment door is hard to shut and feels like it's going to break off if you push too hard. On the plus side, The price was also very reasonable, you get vivid images with a price that is 1/6 that of DSLR cameras. This is definitely a great starter camera for those who want to upgrade from a small point-and-shoot but aren't quite ready for that DSLR technology or price for that matter. I definitely recommend this camera to any person with any level of photography experience.", "Date": "May 14, 2013"}, {"Title": "great product", "Author": "Rosina E. Rojas \"yaya\"", "ReviewID": "R3DEOXYZQ5AP3Y", "Overall": "5.0", "Content": "great product we love it. my son is very excited with his camera. this is the best present he ever got", "Date": "January 7, 2013"}, {"Title": "Super fast shipping", "Author": "Robert L Scott", "ReviewID": "R1CLRP00G3NXLU", "Overall": "5.0", "Content": "Just what I wanted, it is so much better than the small camera I had before and the pictures are superior.", "Date": "July 10, 2013"}, {"Title": "Pentax X5", "Author": "Jojn Pacetti", "ReviewID": "R2EKE7MI8LLNGX", "Overall": "3.0", "Content": "it is a decent camera.  just a little slow, but this is what I expected. takes good pictures outside with zoom.", "Date": "April 29, 2013"}, {"Title": "It's slow and clunky", "Author": "Mary \"jypsee\"", "ReviewID": "RXMDT3SCJ378L", "Overall": "2.0", "Content": "The camera is loaded with features, but so what?  It's slow focusing, the optical (?) zoom during video is really, really bad.  The camera hates and refuses to focus in low light.  The EVF is really grainy and barely useable.  I returned it.", "Date": "June 17, 2013"}, {"Title": "Disappointing", "Author": "TRANDTR \"T.  Ritchie\"", "ReviewID": "R28FGJRNVSWZZ8", "Overall": "2.0", "Content": "This camera is something of a disappointment.  I've been a Pentax used for 40 years and have always loved them.  Well built, incredible SMC lenses, rugged perfection.  But this one just isn't.  I realize I'm comparing apples and oranges putting a Spotmatic up against a modern, low end digital, but I still expected the quality and dependability that Pentax has always represented.  This camera (X5) takes beautiful photographs.  Every camera does.  I've never heard anyone say...\"This thing takes crappy pictures!\"...about any camera.  I had this camera for four months and it quit working.  It powered up alright, but the auto focus locked up, the shutter was inoperative as well as all other electronic functions.  I changed batteries..restarted several times etc. etc...all the usual.  Still frozen.  Disappointing......  Another point about general operation...the zoom does not function while in video mode.  Was this an oversight?  I found the FACE finding function to be an annoyance, but you can disable it.  When turning the camera on, a message comes onscreen saying the lens cap is still in place....and then the camera shuts off.  What purpose could this serve?  What if I just wanted to look at my pictures?  I don't need to remove the cap for that.  Just another annoyance.  Thankfully Amazon was good about refunding my money, and I now have a new Olympus on the way.  I cant wait to try it.", "Date": "November 16, 2013"}, {"Title": "Pentax", "Author": "Rob R. Prouty", "ReviewID": "RF9PON6MMU0UJ", "Overall": "4.0", "Content": "Camera works fine I will have to spend some time on settings program is good for working with pictures have retouched several allready", "Date": "December 22, 2013"}, {"Title": "pentax x5", "Author": "huntzip", "ReviewID": "R25WCECQIDKXVY", "Overall": "4.0", "Content": "Just got for Christmas. So far, so good. Works very well. I love the veiwfinder and tilting sreen- makes  it so easy  to use in bright  sunlight.", "Date": "December 28, 2012"}, {"Title": "Had one many years ago.", "Author": "Gerry D \"Music Lover\"", "ReviewID": "R3Q5HQ93H9IHPF", "Overall": "5.0", "Content": "Like the feel and ease of use.  Wanted to use the direct view window.Had  one years ago and missed it.", "Date": "June 8, 2013"}, {"Title": "Excellent light gathering & images!  Zoom weakness.", "Author": "J. Burt \"SciFiOne\"", "ReviewID": "R1YA134REK4RWG", "Overall": "4.0", "Content": "Oct 2013 update. We took this to the UK. The light gathering capability of the lens is amazing. It is so powerful that it was almost impossible to get the flash to fire! And the finished image quality is superb. Often, in the same scene, my iPhone saw nothing but black, even with the flash, where this camera was totally clear without the flash. Impressive and amazing. So far, unless you need the features below, I can recommend the camera.The optical zoom is not adjustable during video shooting. It can be set before recording starts but after recording starts only the digital zoom operates. This is a significant problem.The rear display cannot be moved to every angle, such as viewing from the front. I expected this and its range of motion is wide enough for everything I've done. It is not a problem for me but I thought I'd mention it.", "Date": "June 16, 2013"}, {"Title": "Great little camera!", "Author": "Lena Lopez", "ReviewID": "R3NGLVY9EZOE62", "Overall": "5.0", "Content": "We haven't had this camera long enough to really give it a proper review but so far we love it!  Takes clear and sharp pictures with excellent color reproduction and is fairly easy to operate with all the functions we've used so far.  Downloads are a snap.", "Date": "May 12, 2013"}, {"Title": "Pentax or FujiFilm", "Author": "Wilcox1976", "ReviewID": "R37N0OLM48WQCP", "Overall": "4.0", "Content": "Yes it seems that the Fuji company make lots of cameras others place their names on. Try GE and this Pentax.  But that's okay I owned a FujiFilm S700 since 2007 and It just broke recently.Likes: 3\" LCD, Viewfinder with diopter adjustment, The pictures it can take without a flash are amazing.  I sell on ebay and photos with glare are really annoying... So this is nice because I can shoot without flash. I can shoot close up without even having to turn on the macro settingThe BAD:I hate having to open the battery door to get the SD card out. Battery doors seem to be the first thing to break.No printed legend to identify how to install the 4 batteries.Four $$$ batteries. A rechargeable pack would be sweet!Buttons, Buttons, Buttons - There are tooo many buttons on this camera. It even has a Green Button!Pullout tilting LCD screen... Could have lived without that. Looks like another thing to breakManual Flash popup button. I liked having it popup when needed.Well that is about it for now. Will update some more later.Blessings,John 20:29", "Date": "March 19, 2014"}, {"Title": "Great camera, but not waterproof like the headline claims", "Author": "RS", "ReviewID": "R3OCB1PMUFG8PA", "Overall": "5.0", "Content": "This is a great camera, for a great deal, but this is not a waterproof camera like the headline claims.", "Date": "October 10, 2012"}, {"Title": "great", "Author": "sixgun", "ReviewID": "R2ERJ49DI0YUZA", "Overall": "5.0", "Content": "great camera for everything just an all around easy to use camera.I love mine. makes nykons look like trash!", "Date": "December 24, 2012"}, {"Title": "Love it.", "Author": "Norman B Army", "ReviewID": "R2UI4MQ92ZJUHT", "Overall": "5.0", "Content": "Have not used it a lot yet but so far it is wonderful, clear pictures and easy to us.  Could tell you more after I go onour trip, plan to get a lot of use out of it then.", "Date": "August 23, 2013"}, {"Title": "Buy a Real Camera", "Author": "Wellvideo", "ReviewID": "R4KW9205JJF8F", "Overall": "2.0", "Content": "I didn't like it. It's inability to shoot fast as advertised is false even though there is a setting for it and even using a class 10 SD card. I don't use it and replaced it with a Pentax K5! For me it was a waste of money.", "Date": "November 19, 2013"}, {"Title": "Mega zoom with caveats", "Author": "J. Thomas \"jimmyjames8\"", "ReviewID": "R9ZLNM3RSCJEX", "Overall": "3.0", "Content": "Great feature set including a view finder.  Good ergonomics if a little small.  Plastic lenses.  Slightly washed out color.  Extreme end of zoom range gives blurry pictures at long distance.  Mine had a fly spec on the inside of the outer lens and it took about 5 tries in setting the date and time for it to take.  I returned the camera.  This camera has been discontinued by Pentax.", "Date": "May 28, 2013"}, {"Title": "Favorate Camera.", "Author": "Craig", "ReviewID": "R1GDJOFKHWBE3Q", "Overall": "5.0", "Content": "Came on time in good working order in a good amount of time to the correct street address to my home.", "Date": "December 9, 2012"}, {"Title": "cheap junk", "Author": "mariak \"maria4767\"", "ReviewID": "R3HHC64R24JO3V", "Overall": "1.0", "Content": "This camera felt rather flimsey and the battery door was a pain to use. But, for the price I thought it might be okay, I was wrong. It froze up after about 20 shots so I sent it back the second day and replaced it with a fuji. I have 3 DSLRs and one is a really nice Pentax, I thought this would be pretty good for a walk about camera. Not so. Amazon was great about my returning it though, I'd give them 5 stars, but the camera 0 if I could.m", "Date": "December 14, 2012"}, {"Title": "really waterproof??", "Author": "atila", "ReviewID": "R3PSDJTWN9NTG0", "Overall": "3.0", "Content": "Pentax X-5 Waterproof Digital Camera with 26x Optical Image Stabilized Zoom with 3-Inch LCDi bougth this camera, last mont-4 th oct.i want to learn that this camera  really Waterproof Digital Camera or not. to days deals i show that only ;Pentax X-5 16 Digital Camera with 26x Optical Image Stabilized Zoom with 3-Inch LCD (S ...so i want to know that camera realy waterproof or not?", "Date": "October 31, 2012"}, {"Title": "Do not Buy!", "Author": "Walter E. Hamler", "ReviewID": "RGB2D65V0YHR", "Overall": "1.0", "Content": "It's a piece of crap, I hate to say. I have owned the Pentax brand almost my entire life and this is the first one I did not like.", "Date": "January 23, 2013"}], "ProductInfo": {"Price": "$229.95", "Features": "16 megapixel backlit CMOS sensor\nA large 26X optical zoom (22.3-580mm equivalent) lens\nLarge 3\" tiltable LCD screen for easy shooting at any angle and electronic viewfinder with 230k pixels and diopter\nSensor shift image stabilization\n1080p video @ 30 FPS with h.264 compression", "Name": "Pentax X-5 silver 16 Digital Camera with 26x Optical Image Stabilized Zoom with 3-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51MNoBGRv6L._SX300_.jpg", "ProductID": "B0091TC3OC"}}