{"Reviews": [{"Title": "Wrong Lens otherwise good", "Author": "Chris Johnson", "ReviewID": "R7GMVW5QCS9OZ", "Overall": "2.0", "Content": "I was supposed to get a 18-55mm WR lens as advertised and I ended up getting a 18-55mm lens that was not weather resistant (WR). Aside from that, I got everything that and in good shape for a relatively good price.", "Date": "January 18, 2013"}, {"Title": "it is ok, but the lens is 18-55DAL rather than 18-55WR", "Author": "peter", "ReviewID": "R2MQT8MTLUBFLD", "Overall": "4.0", "Content": "In general , the package is good deal. The only disappointed thing is that the lens is not 18-55 WR.", "Date": "April 23, 2013"}, {"Title": "VERY satisified!!!1", "Author": "Mary Roth", "ReviewID": "R19VESAZYMSJTB", "Overall": "5.0", "Content": "Better than promised - great value for the money - had I bought everything individually, would have cost far more than this package.", "Date": "February 22, 2013"}, {"Title": "Great Camera w/WR lens cheap accessories", "Author": "wheelthrown", "ReviewID": "R1DO9E437KPCQZ", "Overall": "4.0", "Content": "The K-30 is pretty nice upper level beginner dslr. I like having the two quick adjustment wheels for shooting in aperture and shutter priority, most other brands only give you one wheel on an entry level camera. I did get an 18-55 DA WR lens with my kit unlike the previous review, ive used it in the rain and snow without issue. The camera bag in this set is a joke you cant even put the camera with the lens off in it let alone any of the accessories. The filter set is decent and the high speed SD card is great but the wide angle lens and the 2x telephoto lens are practically useless. That said i dare you to find a better deal on the k-30 with a WR lens for less! I spent over a week looking and this is the best deal. Then I got a bunch of extra lens' used on ebay for $25-$50 bucks each so I can play with primes and a real telephoto.Summary:1)K-30 Pro - Great camera. Easy to use. Easy to setup to get the shots you want. Has pop up flash. Two adjustment wheels. RAW button. Con - Battery doesn't last long (especially with flash)2)18-55 da wr lens Pro - decently sharp, weather resistant :-) Con - not really a zoom, not much bokeh (wide DOF)3)SD card is great4)Filter lens GREAT5)Extra battery and travel charger set are excellent6)2x telephoto adapter is really only for macro7)super wide angle lens makes lens hard to focus and picks up glare8)Tripod is super cheap (get one at walmart for $20 and throw this one away)9)The camera case is way to small to hold the camera body and lens even when they are disassembled. (get a sling)So I can say I have no regrets with this purchase of this item from this seller, but be aware that alot of the accessories are junk and you will have to buy a few more things bag and tripod.-J", "Date": "February 5, 2013"}], "ProductInfo": {"Price": "$595.29", "Features": "16.3Mp APS-C CMOS Image Sensor\nFull 1080p30 HD Video h.264 Compression\nPRIME M Processing Optimized for Video\nAdvanced SAFOX IXi+ Autofocus\nLarge Wide Angle Viewable 3.0\" LCD", "Name": "Pentax K30 Digital Camera with 18-55mm Lens Kit (Black) + 32GB SDHC Class 10 Memory Card + Extended Life Battery + External Rapid Travel Quick-Charger + USB Card Reader + Memory Card Wallet + Shock Proof Deluxe Case + 3 Piece Professional Filter Kit + Super Wide Angle Lens + 2x Telephoto Lens + Professional Full Size Tripod + Accessory Saver Bundle!", "ImgURL": "http://ecx.images-amazon.com/images/I/61xV8MEQuhL._SY300_.jpg", "ProductID": "B0091T5RY0"}}