{"Reviews": [{"Title": "Just What I Needed", "Author": "J Crotts \"warrior spirit\"", "ReviewID": "RNGTKJTOIY79F", "Overall": "5.0", "Content": "This camera is perfect for someone on a budget but needing some of the more sophisticated features of cameras with interchangeable lenses. At 57 I'm just now getting back into photography after a 30 year absence, and I needed something simple, yet professional in it's aspects. And when it comes to teaching an old dog new tricks, this camera does it very nicely. I started out in 35mm film and the Pentax X-5 is the perfect camera to learn digital photography. Pentax is one of the best cameras on the market and this one does not disappoint. Battery life is superb, picture quality is excellent, and it fits my average hands very comfortably. I expected something more 'plastic', considering the price, but the weight, design, and sturdy construction gives this camera the feel of a 'real professional'. And you can't beat the price!  Overall, this great little camera will have you creating beautiful photos and artwork in a snap. The manual, which came with mine (I understood from various sources that I would have to download it but was pleasantly surprised otherwise) explains everything in great detail, with plenty of images and charts to teach you everything you need to know. To all those other fancy smancy high priced models...eat your heart out!! This is a real winner for Pentax!", "Date": "March 4, 2013"}, {"Title": "Awesone gift that even i enjoy", "Author": "Paul Rodríguez", "ReviewID": "R18BKGSM384WM5", "Overall": "5.0", "Content": "I puechased this for my girlfriend And she loves it cause it feels very resistant And the fact that its so easy to use is just awesone.The camera came very quickly And it brought more things than the actual photo.Now, regarding the camera, it has gone beyond expectation And You defenetly get more for what You paid.", "Date": "January 12, 2014"}, {"Title": "Need a kit? Buy this one.", "Author": "T. Macion \"Games + Tea = Love\"", "ReviewID": "R173YSZWBF3FM3", "Overall": "5.0", "Content": "I wanted a digital camera that would be enough for home use that could provide high quality images from a beginner's point-of-view (look great, but not necessarily great enough for a professional or championships because who has that kind of money for personal use!). I also wanted the ability to use it via remote, with a tripod, ran on AAs or a rechargeable battery pack, and a video+audio recording option. This camera fit everything I wanted perfectly. This camera by itself new costs $199+. You could in theory save some by buying elsewhere if you've already collected things like tripods or batteries, but I needed everything as this is my first camera. Individually, the rechargeable AAs and their station is $25+, tripods about $25+ together, memory card maybe $10. And the other things you might needs, like the case, cleaning wipes, etc. If you need more than just the camera, this kit really fits the bill to keep more of your $ in your pocket.If you are a beginner to photography, this camera might seem like a little bit too much camera for you, but you pick up on it quickly. Some of the controls seem a little awkward, but like I said, you pick up on it quick. If you are tired of the grainy images from drug store disposable cameras, then this is a good investment.", "Date": "November 23, 2013"}, {"Title": "best camera for beginners!", "Author": "scooby doo", "ReviewID": "R363AL6D96UAJ8", "Overall": "5.0", "Content": "I am not a professional photographer, I am only a person who enjoys taking photos of wild life, landscapes, etc. and this camera does it all.  The zoom is fantastic, I can take photos of birds close up even though I am fifty feet away from the subject.  The pictures are clear, colorful, and the camera has several different settings.  Great camera.", "Date": "June 11, 2013"}, {"Title": "Great deal for the money", "Author": "Maurice G. Lacourse \"mglacourse\"", "ReviewID": "R291S7KWD1BAOC", "Overall": "4.0", "Content": "Bought this as a gift for my daughter.  She loves it.  Takes great pictures and she was more than pleased with all the extras that came with it.  Very prompt arrival - easily beating the estimate!  I'd have given it 5 stars had it not been for the camera coming with a battery that I suspect was defective.  It would need recharging after only taking a few pictures.  Ordered a replacement at another vendor and the cost was minimal.  Would encourage anyone to buy this product from the vendor!", "Date": "January 21, 2013"}], "ProductInfo": {"Price": "$224.95", "Features": "KIT INCLUDES 12 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Pentax X-5 Megazoom Digital Camera (Silver) + <2> PD-C10 Camera/Camcorder Case + <3> Transcend 16GB Class 4 SD Card +\n<4> PD 4x AA Batteries & Charger + <5> Zeikos 50\" Compact Tripod + <6> PD Memory Card Storage Wallet +\n<7> PD SDHC Memory Card Reader + <8> PD Flexible Table Mini Tripod + <9> LCD Monitor Screen Protectors +\n<10> PD 5pc Complete Cleaning Kit + <11> PD Mini Spudz Microfiber Cloth + <12> Image Recovery Software", "Name": "Pentax X-5 Megazoom 16.0 MP Digital Camera (Silver) with 16GB Card + Batteries/Charger + Case + 2 Tripods + Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61b1nad2QVL._SY300_.jpg", "ProductID": "B009DO1F1C"}}