{"Reviews": [{"Title": "Love this Camera!!!", "Author": "Murth \"themurth\"", "ReviewID": "R1M54U3KBHR0ZA", "Overall": "5.0", "Content": "I am a proud owner of the Pentax K-5 and very happy with everything about it.  I just received the Pentax K-5 II and tested it out.  I tried it in a low light situation and the images are better.  In addition, the LCD screen on the back of the camera is much better and I can better determine if the image is tack sharp or not.  I would highly recommend to spend the extra amount and go for the K-5 II instead of the K-5 at a discount.  PS - I believe Pentax is giving Canon and Nikon a run for their money.  My advice would be to buy the body only and then invest in a good prime lens.  The one to have is the 31mm.  It is unbelievably sharp!  I have the 100mm micro and the 55mm lenses.  Both very good but, the 31mm is in a league all to itself.  I hope this review helps.", "Date": "December 18, 2012"}, {"Title": "Pentax K-5II, my perfect camera", "Author": "Jose Luis Ramirez Cuevas", "ReviewID": "R3M5M5XQZS7JTE", "Overall": "5.0", "Content": "I've had the K-5 for almost two years and it's been my workhorse. 30,000 photos of almost perfect autofocus, and almost perfect high ISO shooting. I was very satisfied with it, except for about 10% of my photos where the K-5 would simply not autofocus, but so wouldn't any other camera, so switching brands wouldn't help at all.Enter the K-5II. I had many reviews and had asked people in other forums if they had found any significant differences between the K-5 and K-5II regarding autofocus in extreme low light. The responses I got pushed me over the edge so I thought I should give it a try.Oh, man, does the K-5II deliver. Pentax built around the critically acclaimed K-5, giving it a better LCD screen, and most importantly, at least for me, amazing autofocus accuracy in low light. I shot more than 8000 photos in December,  from different dance festivals, and all the shots I couldn't previously get with the K-5, the K-5II did. Mixed light, single spotlight, horizontal spotlights, all of very low intensity, the K-5II locked focus without a problem with little to no hunting. These events I shoot are essentially the same every year, with the same lights, and the previous two years the K-5 didn't help much in the low light scenes.Other than predictive autofocus and accuracy everything is essentially the same. The autofocus speed is still great, I would say perfect for my needs. This is said by someone that shoots mostly ballet presentations.", "Date": "December 31, 2012"}, {"Title": "Everything I expected and more", "Author": "duane dewald", "ReviewID": "R2GCGUJHYP2LUH", "Overall": "5.0", "Content": "I bought this to replace a K100D.  The online reviews say it all.  It is nice to be able to use old Pentax lenses and still take advantage of shake reduction.  Ergonomics and menus are much improved/", "Date": "January 26, 2013"}, {"Title": "Wow--that's all I can say!  Wow!", "Author": "B. Thomas", "ReviewID": "R2TPVPOPL84UE5", "Overall": "5.0", "Content": "I recently bought this camera body after doing a lot of research about it.  It was a real toss up between it and the K 30.  I decided on this one mainly because of the external flash socket since I have an older studio light I would like to use with it.  I really liked the lower price of the K 30 and its reviews were outstanding.  I like that both have the water resistance and temperature fluctuation ability--because I like to do outside shots especially in inclement weather.  I liked that the K 30 was set up very much like my Kr and, of course, I liked the cheaper price too.  However, I did buy the K5 II and I am very happy with it.  Today I started taking pictures with it using it with and without the built-in flash--outstanding!!!!  I tried again with the Kr to compare the two and, well, there isn't any.  I have never been able to get such good exposure and color saturation with so little effort.  I love this new body.  I did find it to be heavier than I am used to and I will have to get used to the dial placement--but I can live with that.  This camera feels very solid.  If you do any wildlife or bird photography you will love the shutter--it makes almost no sound.  This was an expensive purchase for me but I feel it will be well worth it in the long run.  I purchased this through Electronic Basket and it came with all the kit was supposed to have--correct battery, manual, etc.  The Pentax box was opened and the lens was removed--because I did not purchase the lens, just the body.  I expected that it might come to me in a Pentax box with just the body and the accessories and not a box that advertised the lens as well.  Not a big deal to me though.  The seller was SUPER fast and was also good to converse with me before I made my purchase.  No complaints.", "Date": "May 29, 2013"}, {"Title": "Spectacular Camera", "Author": "AudioFreakwency", "ReviewID": "RC32PDO1IUY5Q", "Overall": "5.0", "Content": "Firstly, I am no professional photographer. Secondly, being a grad student, I have to manage my finances very carefully. With these two things being said, I find that the Pentax K-5 II to be an affordable semi-pro DSLR that exceeds my expectations. I am technologically knowledgeable enough to know that MPix ratings are not the only deciding criteria, and it pains me to see people lugging around >20MPix DSLRs, with lenses that only render close to 8MPix resolution. Heck, I met this person shooting a Nikon D5100, I think, and when I asked her what lens she had, she said she had a Zoom Prime. What a joke. Enough said.Anyway, my inclination towards Pentax is two fold: Firstly, my dad used to have a Pentax MX-1 in the film days, and I started off with a DSLR (again I was even poor-er then, so a Pentax K-x). Loved the interface, but with a 18-55 kit lens @ F3.5 Max, there was only so much I could do with DOF etc etc. Secondly, a company without a great marketing department, if had made it this far, the weighting factor for good cameras is, formidable for Canikon, huge.I moved from the K-x, to the K-01, to now the K-5 II. Again the 250$ difference between the IIs and II was a big deal for me. Especially since every new camera I moved to, I had to sell the older one, with much difficulty, and waiting to find a Fellow Pentaxian.I loved the K-01, but it had trouble focusing with its contrast-detect AF. Also the e-dial broke. However, Pentax (now Ricoh) eventually refunded me the full amount I had paid for the camera.OK, coming back to the Pentax K-5 II:Pros:Dynamic Range, fantastic when shooting landscapes and portraits (in color), the latter I cannot show examples of, because I only do portraits in B/WBackward compatibility to old Pentax glass, sometimes I am lucky enough to find specimens at the local thrift store for $10. In-body Shake-reduction particularly is, a blessing, in this case.I find the user interface much simpler that my friends Nikon of a similar class.Two mode dials (hence it being labelled as a semi-pro model) comes in particularly handy, when shooting in TAv mode.AF is a HUUUUUGE improvement over K-x, and definitely over the CD-AF of the K-01. It focuses instantly with my Sigma 50mm F1.4 HSM (even at F1.4). With my Tamron 18-200, it's OK, can hunt 1-2 times in low light, but it does eventually lock on, as opposed to the K-01, that would keep hunting.Battery life: Outstanding. On my trip to CA (Yosemite, SF, Mono lake) I counted 1284 shots on a single charge, and there was still juice left (I never use flash, except when bouncing off the in-built flash with a credit card, thanks to DigitalRev). I bought a Wasabi Power battery just to have as a backup, it works fine, but I didn't have to use it.With a Class 10 SDXC, I can manually fire 5fps, no problems.The LCD of 921K dots is a great improvement over the last models I had owned.Cons:More AF points would definitely be better. When doing hand-held of static objects, this isn't an issue, because one can always center AF, and while holding the shutter button half-way, recompose and shoot. However, tripod mounting can call for more AF points.High ISO (past 1600) is not something I'd consider. Well, for any camera, any make. So boasting about ISOs up to 51200, is pointless.A split-prism focusing screen would be golden. This is reminiscence from the 'old film days', but it worked when there was no AF systems in cameras, right? SO if Pentax is backward compatible, and especially when using manual lenses, a Split-prism would be phenomenal.Cons for some, but seriously, ask yourself why you take photos, if this matters:No me too factor. Everyone around you will be one of them, Canikonians. I personally like to stand out, being cheap, whilst taking good photos.As DXO Mark says: this camera is generating some serious appreciation from the professional arena.I recommend it, and I would buy it again in a heart-beat, well, if I had more money that is.Pictures speak larger than words, so here are some examples:500px [dot] com/shrin12References:dxomark [dot] com/Cameras/Camera-Sensor-Database/Pentax/K-5-II", "Date": "November 13, 2013"}, {"Title": "Things NOT Mentioned", "Author": "J. A. Coyle", "ReviewID": "R2N8PC4J7T0IZ4", "Overall": "5.0", "Content": "Two things I do not see mentioned in the other reviews are:1. There is no users manual and2. The battery is a D-LI90P (not the D-LI90 used in the K-5).So, if you have some extra K-5 batteries, plan on buying some new ones for this model.I also checked pentaximaging.com and, under items included, there is no mention of a manual. Too bad. The manual set Pentax apart.Technically, I have nothing to add to the other reviews except that the On/Off toggle seems stiffer than the K-5.My five stars is for the price/performance of the camera.Update: According to Pentax support, there is a manual provided. They recommended returning the camera I recieved to the vendor. I am following their recommendation.Update II: After returning the original camera I ordered again but from another vendor. The second camera came with a manual and a D-LI90 battery. Go figure...", "Date": "February 21, 2013"}, {"Title": "Top of the Line", "Author": "Amazon Customer", "ReviewID": "R31JWU9KC7FLIK", "Overall": "5.0", "Content": "Very nice body, lots of features. Manual needs to be improved. Had to order a book on the K-7 to make sense of the menus.", "Date": "July 10, 2013"}, {"Title": "Escstatic!", "Author": "Charles Mahr", "ReviewID": "R3TIP4BTKJXKNY", "Overall": "5.0", "Content": "This is an outstanding camera!  I am a professional photographer and have debated the use of Pentax vs other known brands and found that this is the perfect camera for my business.  I primarily shoot portraiture along with some landscape and wildlife. I have found that this cameras abilty to shoot all genre of photography far exceeds some of the noteworthy full-frame cameras.  The greates plus is the cost. When comparing the various makes on the market and the cost of each as opposed to their capabilities, THIS IS THE ONE TOO BUY! Great color, great fps, ease of use, and weight/bulk. Recommend this for all photography enthusiasts.", "Date": "August 8, 2013"}, {"Title": "good camera, but found a dead spot。", "Author": "shaun", "ReviewID": "R3VDGOAZ9EPN77", "Overall": "4.0", "Content": "good camera, but found a dead spot in lcd and gray light at the corner, not much hassle to get it returned and fixed.", "Date": "June 29, 2013"}, {"Title": "Best Camera I have Owned.", "Author": "J. Martin", "ReviewID": "R1X5GBWOCEN4FY", "Overall": "5.0", "Content": "And I have been taking pictures for over 35 years. I am a Pentax user, and have lenses that date back to 1948 that work on this camera. The low light focusing ability is outstanding, the shutter whispers, and it is great for sports and wildlife photography. This is a fully customizable  professional level camera. I wouldn't recommend jumping to this level if you are a point and shoot photographer. Try the Pentax k-30, k-50, or k-500 instead.You won't miss having a full frame camera.", "Date": "December 21, 2013"}, {"Title": "Amazing auto white balance", "Author": "R. Dasuki", "ReviewID": "RTBGME9CFDDSK", "Overall": "5.0", "Content": "I am a long term pentax user started with *ish body. There are plenty of reviews of how great this camera so I'll just add a major improvement for me over my older pentax camera (K20), auto white balance. With K20, my biggest complain is shooting indoor under incandescent lights and no flash, images have yellowish and unnatural tint. Yes, you could do manual white balance and post process pictures, but who has time to do all that, I just like to point and shoot.  It also has a auto-iso feature in fix aperture setting that work really well. That new feature and AWB improvement has allow me to skip using flash and get more natural looking pictures. This has also push me over and get sigma lens 17-50 2.8 when it was on sale on ebay. With that lens, I could shoot in a practically dark room and still get a decent images. And yes, auto focus has significantly improved as well, especially with fast lenses.", "Date": "August 21, 2013"}, {"Title": "A good choice for a family camera with professional aspirations", "Author": "Michael  J. Cunningham", "ReviewID": "R1E9ZDWGPVEW4I", "Overall": "5.0", "Content": "I have been an avid photographer for most of my life, but have had poor luck with a battery of lower quality point and shoot digital cameras. I decided, after much research, to go with the Pentax K5ii and could not be happier with the decision. For someone like me, who likes to have control over the picture, and my wife that wants to point and shoot and get a good result, the K5ii is a very happy medium.The green auto function with a 50mm f1.8 setting will get pictures in almost any light, and with auto focus, not drive someone crazy while the camera tries it's best to find a good focusing point, after which point, the picture is lost. Our last Nikon had this problem and as a result my wife would not use it.This camera is powerful, but IS also very simple to use. Here are the benefits as I see them:- Wonderful color rendition. Looks like beautiful KodaColor slides from a medium format camera from a studio in the 70s.- Great battery life. Almost 1000 pictures from one charge. Amazing!- Low light natural shots with very fast accurate autofocus. Let's you gets shots you would miss with another camera.- Fast auto shooting when needed (up to 7 frame per second)- Doubles as a video camera for those family moments- Huge range of lenses, including the Limited series. Uses all the Pentax lenses from my camera in the 70s.- Relatively small for a high performance SLR- Ideal for the aspiring amateur with a wife/husband who is technically challenged. (Hope my wife does not read this one!)Disadvantages:- It's still bigger than a point and shoot, but you get what you pay for- At 16MP would probably be too low a resolution for all \"professional\" applications, but I can put more than 1000 pictures on a 32GB card- Was advertised as a \"metallic solid\" feel device. Still feels very plastic like to me, but that's probably just a persona preference.All in all a wonderful device, of which I hope to use for many years to come.- No need for a flash. The camera will take good low light pictures.", "Date": "April 28, 2014"}, {"Title": "great camera", "Author": "Judy Bonghi \"vchal\"", "ReviewID": "R1KZNY7486BRQT", "Overall": "5.0", "Content": "I started my love for SLR's back in the 80's with an Olympus OM 10.  I used a few cameras since, the last being a lumix with lots of auto features.  It is a great little camera.  However, with an upcoming trip to China I wanted to step up my game and researched and bought this Pentax.  I have to admit at first it was a little intimidating..but as I started to read the book, and see the features it brought me back to my first love..understanding and using the manual features of an SLR camera.  This is a great camera…and boy was I excited when I learned it had digital filters. This might not be new news to all you advanced dslr users, but to me it is a great feature, along with all the others on this camera.  I love it! and can't wait to see what I can do with it during my travels.", "Date": "March 29, 2014"}, {"Title": "Expected much", "Author": "Eilert O.", "ReviewID": "R2MI6XIZD6J1V2", "Overall": "5.0", "Content": "Not disappointed.  Noticeably better focusing than my prior K7.  Sharper images (not sure why, however).  Otherwise, handles very much like the K7.", "Date": "June 27, 2013"}, {"Title": "Are there better. Of course, It will cost much more though.", "Author": "VINCENT CHEN \"Vincedog3\"", "ReviewID": "R16YHBUL4I65UE", "Overall": "5.0", "Content": "Being around cameras with friends, and family for many years, I have had Canons, Nikons, Olympus, and Sony's, and Pentax.I wanted a replacement for my fine, though limited Sony NEX-5n. Lens choices, lack of a viewfinder, could never really warm up to the EVF that was the option on the NEX-5n. Sold that combination, and moved on.Moved to my new home in the Northwest. Wanted a camera for the action I would see, hiking fishing, site seeing etc. The Canon T5i was sweetheart choice with its touchscreen, small size, and reasonable price.I wanted great portability, great build, low price. Ready to buy, call it good!Then I came across the Pentax K-5II. Here is a camera I had been watching, but could not afford. All the things I liked, but the price! To be fair, Canon, and Nikon were the same.So Amazon here had it for almost half off. Could not resist. Bought it sight unseen. What a nut I thought. But as they say crazy as a fox.My quick observations.Quality of build. Excellent. Reminds me of my old D200 Nikon. But much lighter. A good thing. The Magnesium alloy body with 75 seals is very confidence inspiring in the hand. Dials, switches are easy to work. Size is a bit small, but a trifle bigger than the Canon T5i I was going to purchase. Looking closely at a battery grip for my big hands to have place to be.Use, and operation could not be easier for me. Compared to the Sony, this is easy well thought out with lesser things I don't worry much about out of the way. Would like the shooting mode i.e. multi frame shooting self timer etc. more accessible though. Also the mode shutter speed, and aperture are backwards from what I am used too. No big deal there, just mentioning.With the 18-55mm WR lens, couldn't be happier for things close up, but distance, and low light, not so much. Good, like my other kit lenses, plus the seal around the mount. Nothing bad, just nothing special.Going to get a 35mm prime, and a 70-300 for the distance game, the former for low light, bokeh stuff.I love the color, and detail best. Better than my Olympus E10, but my E10 has better glass, seems sharper than the K5, but the speed of focus, and operation make the Oly a slug!Wide dynamics, and great shadow detail, make my post work fun, and easy. So not much need be said here, other than, I confirm what most have said here. Very capable, fun to use, built well, nice image quality especially low light ISO, My favorite DSLR so far. My next for the record would have been my Nikon D90 with battery grip, and 50mm f.1.8 lens. I want an F1.8 or F1.4 for my K5. We'll see how that goes. A winner, and recommended, the K5!", "Date": "April 8, 2014"}, {"Title": "This beauty is classic example of getting bang for Your buck", "Author": "Gregory Topor", "ReviewID": "R213XDZPQ69R7A", "Overall": "5.0", "Content": "let me start off with saying i have try them \"all\"...Canon 60D with 50mm f1.4 and 70-200mm f4 IS L and 24-105mm f4 L, Nikon D7000 with primes, Sony A77 with 16-50mm f2.8, Micro 43 GH3 with 12-35mm f2.8, 35-100m f2.8, Pana/leica 25mm f1.4, Olympus 45mm f1.8, Olympus om-d micro 43, Sony A57 with multiple Minolta lenses, Pentax k-30 and many others....until K-5II with 18-135mm WR arrived at my door step.My k-5II with 18-135mm was purchased at different well known electronic store located in NYC for $800, same week i was able to sell super quickly kit lens for $300 bringing down cost of K-5II body to $500.This is the camera that puts smile on my face each time I use it to take portraits of my 5 months old daughter and family. I have paired it with Pentax DA35mm f2.4 prime lens, Pentax DA50mm f1.8 and Sigma 17-50mm f2.8 zoom lens also purchased Metz 52 flash gun for it. There is sooooo many more old cheap lenses made by/for Pentax bodies available out there.Low light capabilities of this body and nice fast lens can get you really far as far as low light photography goes, to be honest i don't think there is other APS-C sensored camera that can match it, yes its that good, best there is as far as can tell after testing out so many before.My set up of K-5II with DA35mm, DA50mm, Sigma 17-50mm f2.8 and flash gun cost me ~ $1600....I mean crappy Sony A77 with 16-50mm f2.8 cost ~$1400 and is no match for K-5II paired with sigma 17-50mm f2.8 attached to it, which in my case was less than $1100To me the choice is clear...if You need DSLR that You need to perform exceptionally well not only on the sunny day but also in low light where You would be using higher ISO this is Your absolutely best bet.Well done Pentax, well done !!!!!!", "Date": "January 17, 2014"}, {"Title": "Just Love it.", "Author": "Juan Carlos Nunez \"Kickman\"", "ReviewID": "R1EM3DWBPM19OE", "Overall": "5.0", "Content": "Change my old pentax kx, it is a great jump, everything changes, quality and image resolution is awsome.  Body feels robust in hands.  16mpx is more than enough for a hobbie.  Im completely satisfied.", "Date": "December 24, 2013"}, {"Title": "K-5", "Author": "Smeckatella", "ReviewID": "RQ7AP68XCFT1V", "Overall": "5.0", "Content": "This is an exceptional camera that is well built and produces exceptional photos with the minimum of effort. While out on my first shoot of Santa and the kids a child accidentally pulled the camera off of a chair. It hit the floor and bounced a couple of times. My heart fell into my socks. I picked up the camera, wiped it off and took some test photos. It worked quite well for the rest of the shoot. I am confident in saying it is rugged, also.", "Date": "December 24, 2013"}, {"Title": "Excellent upgrade from older Pentax DSLR", "Author": "Amazon Customer", "ReviewID": "R1BFAJZW6O98VH", "Overall": "5.0", "Content": "I have used a K20D for several years, until I noticed color fringing on random images. It is not worth the expense to repair when I can upgrade and still use many lenses, including some cult classic K mount ones such as a Vivitar 90mm Series I. So far I am very pleased with the newer model.", "Date": "August 26, 2013"}, {"Title": "What a great purchase !!!", "Author": "bonifacy", "ReviewID": "R204EL97EZX7IX", "Overall": "5.0", "Content": "I,m user of Pentax system from 1975. I started with Spotmatic to LX in 35 mm photography.  Then 6x7 system, I,m using 'till today. Now I can use all my lenses with new Pentax K-5 II  including lenses from Pentax 6x7 with special adapter. So my words are - I love it.  with regards Ben Malolepszy.", "Date": "August 20, 2013"}, {"Title": "Excellent SLR", "Author": "Derek Visser", "ReviewID": "RL4WF8ZO83OAH", "Overall": "5.0", "Content": "After the Pentax Ist D* I had for over 6 year, an excellent new SLR that meets all my expectations.", "Date": "April 4, 2013"}, {"Title": "Outstanding semi-pro DSLR", "Author": "Rock Chalk", "ReviewID": "RN8KF1PIROO32", "Overall": "5.0", "Content": "This is an amazing and refined DSLR. It never missed focus even under low light. I used it in near darkness, and under low tungsten light. High ISO is impressive. The image quality is excellent. I love the in-body stabilization, the quiet shutter, and the weather sealing. Great value for the money.", "Date": "July 13, 2013"}, {"Title": "Open box?", "Author": "James A. Mitchell", "ReviewID": "R1HGTYSBKLR3F7", "Overall": "5.0", "Content": "Box beat up.  Think it might have been open box, although not noted.  Love the camera...can't beat Pentax for the price.", "Date": "February 18, 2013"}, {"Title": "excellent camera", "Author": "Budleys", "ReviewID": "R29SQ9CN2K2IFF", "Overall": "5.0", "Content": "Has a lot of features and capabilities.One of the best features is that you can use all of your older Pentax lens.Good sold camera", "Date": "June 14, 2013"}, {"Title": "Pentax K-5 II Body.. Love it.", "Author": "J. Harris \"Majorjch\"", "ReviewID": "R1L70LLS9C4Y0M", "Overall": "5.0", "Content": "Have two so that I don't have to change lens.. Love the Weather resistance features as I work and shoot pictures in both Hot, Humid and Dusty climates.  Excellent response and picture quality.", "Date": "November 7, 2013"}, {"Title": "The Rodney Dangerfield of Digital SLR manufacturers builds a Prosumer wonder in the K5 II", "Author": "M. Diana \"MPDSR422\"", "ReviewID": "R2T8Y0MO8TRETM", "Overall": "4.0", "Content": "The K5 II takes spectacular photos. You can take all the techno-babble and tons of comparative specs showing how Pentax doesn't measure up to the big two (Canon and Nikon) and stick it! Look at the photographic evidence and choose. I spent weeks looking at specs comparing the 60D, the soon to be released 70D and the D7100 before buying the K5II. That didn't include time spent researching the value of not having a low pass filter. Photographers love specs as much as Fantasy Football fans. Comparing lenses and sensors and engines and bokeh and field of view and on and on provides nourishment for the soul! If you are a pro it is simply buying tools for your business. We get it. Pentax has been bought and sold a few times and missed out of the digital revolution, but they still make superb glass and build cameras with features that skirt the edges of professions gear at less than half the price. Pentax has had a lousy promotional strategy and little or no effort to capture the USA consumer market. Try to find a Pentax DSLR to put your hands on prior to purchase. Good luck outside of major cities (Last week stores in Washington DC didn't have one for me to hold in my hands.). I bought my K5II body sight unseen. I snapped my favorite lens on it and the result is stunning. My only reason for not giving 5 stars  is the camera has no option to shoot RAW in auto mode. My K10D offers Raw as an option in auto so I don't get it.If you are in the market give the K5II a look. You won't be dissapointed,", "Date": "September 5, 2013"}, {"Title": "Welcome moderate upgrades of an already . . .", "Author": "R. Martin", "ReviewID": "R2RL26XCHYTTJG", "Overall": "5.0", "Content": ". . . excellent camera. Used my K-5 in Costar Rica with excellent results. My 15-year old granddaughter demonstrated outstanding artistic and technical ability on that trip so I bought the K-5 II and passed the K-5 on to her to add to her kit. The K-5 has some welcome improvements, but I really wanted an excuse to pass on the K-5 to her, and this was a good opportunity to do that. Both of us are pleased with the K-5 versions - whisper-quiet shutter for nature photography, rapid autofocus for action, plenty of MPs for cropping and extensive enlarging, etc.By the way, we have installed KatzEye OptiBrite precision focusing screens for improved accuracy and tack-sharp manual focusing.", "Date": "February 3, 2013"}, {"Title": "SURPASSED ALL EXPECTATIONS", "Author": "JIM KUYPER", "ReviewID": "RVFLLY1QER4GZ", "Overall": "5.0", "Content": "I orderd on one day & rcvd... the next!have taken some action shots at a football game....scenic views in the mountains...has renewed my interest in photographysolid solid build...just like my Spotmatic I bought in 1969 an 3-4 more since.", "Date": "September 13, 2013"}, {"Title": "Pantax K-5 II", "Author": "Patrick J. Murray", "ReviewID": "R1WLJT525U0OFA", "Overall": "5.0", "Content": "I have had Pentax cameras for quite awhile, the K-5 II  is one of their best !  This is an excellent camera Pentax  has done it right.", "Date": "June 19, 2013"}, {"Title": "Great camera.", "Author": "Victor", "ReviewID": "R3CK0SHPAV5EBO", "Overall": "5.0", "Content": "I have upgraded from my old K-7 to this one and absolutely love it. It really is a couple of steps up.", "Date": "June 12, 2013"}, {"Title": "Pentax makes great gear period!", "Author": "Phil B.", "ReviewID": "R3PJB1O3YQA8XQ", "Overall": "5.0", "Content": "I thought K7 was great. K5II is even better. The build quality is amazing as are the electronics and 3\" display", "Date": "June 9, 2013"}, {"Title": "I got a dud!!", "Author": "Telescopeman", "ReviewID": "R3MB5IQUOP6V1", "Overall": "1.0", "Content": "The K-5ii arrived on time thru Amazon Prime. The packaging was all intact. When I opened the actual box containing the Pentax, I was struck by the fact that there was no paperwork , no product registration, no guarantee no packing slip, nothing.I unpacked the camera  and battery. It appeared that the battery came fully charged. Inserted battery into the camera, turned it on and waited...and waited... and waited for the lcd to light up. Nothing at all happened for 10-15 seconds and then the battery icon appeared and indicated a full charge.And that was all I got, just the little icon.....nothing else lit up or came on. I reinserted the battery several times and pushed every button,singly and in combination repeatedly, and NOTHING ELSE HAPPENED.I'm obviously returning this dud, and I will repurchase the K-5ii, and I'm certain that I'll have a glowing review to share.As an Amazon Prime customer I'm not happy that I have to absorb the $25 return shipping and insurance charges, by UPS, for a product that is useless.", "Date": "September 25, 2013"}, {"Title": "Could've been great, but never made it there", "Author": "Teapot Tales", "ReviewID": "R35PJGL1ZFV41X", "Overall": "2.0", "Content": "Note: I had to return this camera primarily due to a SERIOUS manufacturing defect and because of its serious video recording limitations.These days when you buy a digital camera, you expect it to do more than take still photos.So, when it comes to taking still photos, it is a decent camera.Other than that, it is a trouble. And this is why I'm stating this:1) The video recording is done with a hugely outdated MJPEG in a monaural mode (32000 bps ONLY !!!) using a SINGLE integrated mike. Using an external mike might be problematic as the cam may refuse to record in a stereo sound mode even if you have a compatible stereo mike (such as TASCAM TX-2M).2) The video clip length is limited to 8mins and 49 secs. No matter what.3) The camera's sensor tends to overheat after 15-20 minutes of activity.4) There is no sound analyzer indicator displayed, so you have no idea whether the cam records sound or not, and if does, then how.5) Once this line of cams is gone and if you own an external battery grip, then you're out of luck, because the Ricoh corp will make buy a new one, even though there is no real difference between the older and the newer grips, so do keep it in mind especially since the original grip costs no less than $180.Basically, if you're planning to record ANY video at all, then this is definitely NOT a cam for you. Think ten times before you buy it.In general, I think that Pentax has lost its edge and I am hugely disappointed with it. Their tech support is practically non-existent.", "Date": "April 1, 2014"}, {"Title": "Forget about external flash!", "Author": "singlet902", "ReviewID": "RRDP5MHO1CLCW", "Overall": "2.0", "Content": "I am very disappointed because I really wanted this camera to work out. People complain about the AF, but it works good enough and great in low light. It takes great pictures. Handles high ISO better than any other Apsc. My favorite part is probably the ergonomics and control layout. BUT! I went through three of them, and they all fail to communicate properly with an external flash. They did the same thing with my pentax540 and Metz50.  Nither bounce or zoom would adjust for close objects. Blown out every time, and sometimes so over exposed all I could see is white! My kx does not do this with either flash. Read about the k5 having this problem, but hoped they would have fixed it for this camera. I could have kept it and tried to compensate with EV, but I shouldnt have to with a thousand dollar camera. Shame on you pentax!  If you dont need to use external flash, it's an awesome camera. If they dont release something soon that has the whole package, than I am going to have to jump ship. Hate to do it", "Date": "April 24, 2013"}, {"Title": "Pentax K-5II - a big bang for your buck but no where near Full Frame quality", "Author": "Mehdi M.", "ReviewID": "R2C3NISUMVX31U", "Overall": "3.0", "Content": "I had the opportunity of using this camera for over a month and this is what I have to say. Previously I was a Canon T4i user and as compared to that APS-C Canon, this  camera is a hell lot better. In terms of color saturation, sharpness, vibrance and features I must say this surpases the entire Rebel line with ease. Would even give tough time to the EOS 7D, 60D and 70D. However some sources claim that this also beats the Canon EOS 6D and the 5D Mark III in image quality and low light performance. Well this is not the case really. In terms of low light noise this camera is a shade better as compared to the Canon T4i. I do a lot of night sky photography and the Milkyway is a particular object of interest. I was disappointed to see the results of the K-5II. In terms of noise they were at least as noisy as the Canon T4i at ISO 3200 and 6400. I must commend on color reproduction though, which was stellar under those extreme low light circumstances, but in terms of noise you need to get one thing straight; nothing beats a full frame sensor. It is because of this reason I returned the camera and went on with my original planned purchase of the Canon EOS 6D  and boy I am so delighted to make the switch!Also Pentax lenses are fairly over-priced and the focal length range availability is an issue. Make sure you do your due diligence before diving into the Pentax world.", "Date": "November 8, 2013"}], "ProductInfo": {"Price": "$1,099.95", "Features": "16.3 Mega pixel APS-C CMOS sensor with integrated AD conversation circuitry\nHigh sensitivity 80-51200 ISO range with excellent noise performance\nAir gap free 3-Inch LCD with 921,000 dots of resolution\nPentax body based shake reduction stabilization system\nFully weather sealed and coldproof design and speedy 7FPS captures for fast action shots", "Name": "Pentax K-5 II 16.3 MP DSLR Body Only (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Cee5aJfjL._SX300_.jpg", "ProductID": "B0099J8A2S"}}