{"Reviews": [{"Title": "Not easy to install", "Author": "LoveTheSun", "ReviewID": "RB7BE0626WUFO", "Overall": "1.0", "Content": "According to the specs, this camera is supposed to work with systems other than Alarm.comWell GOOD LUCK WITH THAT.About the ONLY thing I can do, is get it to see an IP address. I can't connect into that IP, can't access the camera and there IS NO DOCS on this camera besides \"log into your alarm.com account\"This leads me to say that, you can't use this camera with ANYTHING but Alarm.com", "Date": "January 27, 2013"}, {"Title": "Awesome", "Author": "Woody Seiders", "ReviewID": "RTN5DZ60GURRU", "Overall": "5.0", "Content": "This is by far one of the easiest cameras to set up and install. Actually has a good picture and i love watching my house and dogs when we are not home. Have two trying to buy two more.", "Date": "December 2, 2012"}, {"Title": "Quality camera with extras.", "Author": "R Whitworth", "ReviewID": "R3TDR5NYW5ELB5", "Overall": "4.0", "Content": "So far these cameras seem to be working well.  I replaced Dropcam cameras since these work with my security system.  They are, however, quite a bit larger than the Dropcam's.  The picture quality seems good.  There are many features that can be accessed through the alarm.com website.", "Date": "December 5, 2013"}, {"Title": "Good camer, but pricey", "Author": "Andrew W. Coleman \"Andy\"", "ReviewID": "R1EO4IS5OL13DG", "Overall": "4.0", "Content": "I have this camera as part of my Vivint (alarm.com) installation and it is a great, easy to install camera.  I am looking to purchase more because of how easy it is to add additional cameras.  Only thing I don't like is the price...", "Date": "August 3, 2013"}, {"Title": "An OK camera...", "Author": "Jennifer F. Schulz", "ReviewID": "R1FOEDIVEJNKFP", "Overall": "3.0", "Content": "This camera is OK. Very easy to set up if you're not an idiot. Must have an alarm company that can walk you through it, and Livewatch was great. I turned off the night vision because I have it in a window where it is not flat to the glass, and when I turn on night vision all I see is the reflection of the led lights. It is a bit too pricey (Livewatch charges $350), but I am not an expert either so it works for now and I can use it well with my alarm system. A lot better than the indoor one I had with no night vision. That one stunk. This one can still make out shapes in the dark but you can't see faces well. Everything is black and white. I will attach a video soon.", "Date": "July 27, 2013"}, {"Title": "Great in concept but not reliable and no support", "Author": "Christopher", "ReviewID": "R3N30U1JUJ2JZ1", "Overall": "1.0", "Content": "The monitoring security service I use, uses Alarm.com for their web and iPhone interfaces. Alarm.com does appear to be the best in that its better than others but no where near as good as it could be. There were a lot of setup issues. They didn't mention it needed to be plugged in to power so assumed it would work off of batteries like all the sensors. Also to setup you need an ethernet cable not provided unless you use a router with WPS. To note, a quick google search will show you WPS routers are HIGHLY insecure so this device should not promote WPS and should instead include an ethernet cable. The pictures do not show that unlike most corner motion sensors this one attached to a semi long pole that attaches to the wall that is white but the screws aren't white so doesn't look great. Next issue was my password wouldn't work because it was too secure. This device which only works with alarm.com  has old software that doesn't let passwords with any characters, so if you have a complex password you may need to change it to something simpler. Which in my case meant changing the password on my router, then changing it on the two nests in my host, the 2 iPhones, the 1 iPod, the three Apple TVs, the tv receiver the wifi tv and the 2 iPads to all connect to the new password. It ended up being a major project. I told Alarm.com about the issues they said to tell my vendor which was SafeMart and they said they would tell Alarm.com but SafeMart was not helpful. They said the device has a backup battery (it does not). They (rep named Greg I think?) said they would look into my issues and get back the following day. Also that chat took about an hour since he would go quiet for about 7 minutes at a time and then come back since apparently they also answer phones and they take calls while on chat with customers and dont tell customers when they are on a call. It's been several months and no word from them in regards to that. After all that eventually got it installed and thought ok, they have issues but as long as it works now thats all that matters. Sadly no. The motion sensor does not appear to work. It is suppose to detect motion but in my several tests it only works if you are about 4 to 5 inches in front of the device. I asked support about this at SafeMart they didn't seem to think it even had a motion detector. I provided them links and showed them that it did and they were like oh.. hmm. And never got back to me. I figured since I knew more about the product than they did they wouldn't be of any help anyway and once again Alarm.com won't help since they say you have to go to your vendor. Everyonce in a while if I'm a couple feet a way and do jumping jacks it detects motion for a second. As for video quality, if you set it to the highest it is good quality for this price of a camera, but not great if you are use to looking at video on say a smart phone. The night vision looks good however, another big big bug is that is doesn't go on consistently. There is a setting to say whether it should turn on more often or less often, but regardless of the setting, sometimes its pitch black and it wont turn on, other times it works as expected, other times sporadic. If I'm at home and look at video through my iPhone (on our home wifi) the video is relatively close to live video, a second or two behind and doesn;t slow down our internet. However if I view the video through alarm.com at home it slows our internet down which is comcast's highest speed 100mbps to a snail pace. This seems to be a bug with their web interface. Also it uses Java so if you use up-to-date Chrome on a Mac for instance it won't work so you will have to use another browser. When viewing the videos from remote locations it's about a 7 second delay. About 4 out of 10 times it gives an error saying it can't connect to the camera. Sometimes restarting the app helps, sometimes unplugging and replugging the camera works. We have two of these and both are equally flaky. Also other than unplugging there is no way to have the camera turned off when your at home. Alarm.com already has geofencing meaning they know when your home or not, or they could simply have an option that says disable camera feed when the alarm isn't enabled but no such option and alarm.com says they dont have plans for this feature yet. The Green Led on the face of it can be turned off in the settings. Overall it's not reliable, and if you are using SafeMart they have little to no knowledge about it and will be off little to no help and Alarm.com won't listen to your complaints about bugs or security issues. That being said, for residential customers, alarm.com and safemart still is the best affordable option in comparison to others so unfortunately at the moment we are stuck using these cameras and software until Nest of another modern company creates a progressive alternative.", "Date": "May 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009VHD2ZS"}}