{"Reviews": [{"Title": "awesome", "Author": "kirk m.", "ReviewID": "R3SBLVKJK9EQ9D", "Overall": "5.0", "Content": "I have this camera about nine months now and it is really top of the line. I havent had any issues with the camera except the battery strenght indicator sometimes isnt so accurate, I noticed this once when using the camera the indicator was showing about 70% charge but the camera would not focus and it was onlynafter charging it that it started back focusing properly.But all in all super camera greta zoom, good night shots, might be a little slow between shots but no complaints otherwise", "Date": "January 10, 2014"}, {"Title": "camera and nature", "Author": "Amenold", "ReviewID": "R1SYPZQDYRLXM4", "Overall": "5.0", "Content": "I'm enjoying my new toy. My Nikon P 510, 16.1 MP allows me to better appreciate nature. Nature plus Nikon is happiness.", "Date": "September 3, 2013"}, {"Title": "Best deal for the money.", "Author": "PB", "ReviewID": "R17OKZ3ANZVAP0", "Overall": "5.0", "Content": "Very nice camera and great service.  Is a great deal. I would recommend it to anyone.  Very good pictures and very nice video and audio.", "Date": "June 18, 2013"}, {"Title": "Nikon coolpix", "Author": "Dawn", "ReviewID": "R1WG22KB8HND6G", "Overall": "5.0", "Content": "Just as discribed in adArrived next day as stated.Love the camera the pictures are very clear and beautiful. I've had a Kodak that was simler to this one but I have to say my Nikon the pictures are much more clearer <3", "Date": "June 11, 2013"}, {"Title": "Buenesima", "Author": "Gabriel Alles", "ReviewID": "R1R3L67851C7GP", "Overall": "5.0", "Content": "Todo lo que esperaba acerca de esta camara y mucho mas.Un zoom impresionante que permite unos acercamientos muy disfrutables", "Date": "March 5, 2013"}, {"Title": "My 2nd coolpix", "Author": "Celia", "ReviewID": "R21SEL12WN7FGD", "Overall": "4.0", "Content": "The shutter speed is a little slower than my other coolpix but pictures are crisp and clear.  Hesitates when I turn on, have to press button more than once", "Date": "March 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "This Kit includes 7 items all with USA Warranty and manufacturer's supplied accessories\nNikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom NIKKOR ED Glass Lens and GPS Record Location (Black)\n8 Gigabyte SDHC Secure Digital Memory Card - Universal Memory Card Wallet\nProtective Digital Camera Carrying Case with Pockets and Strap - Package of LCD Screen Protectors\nExtendable 8\" Tabletop Mini Tripod - Lens Care & Cleaning Kit - BONUS!! FREE 25 Quality Prints (promo code# on invoice)", "Name": "Nikon COOLPIX P510 16.1 MP CMOS Digital Camera with 42x Zoom and \"GPS\" (Black) + 6pc Bundle 8GB Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51m9mhXaLmL._SY300_.jpg", "ProductID": "B009EDS7E0"}}