{"Reviews": [{"Title": "Camera 5, bundle 2", "Author": "tech boo", "ReviewID": "R2JFI94Z2DU3BH", "Overall": "2.0", "Content": "Bought this bundle for a very good price. $165 which really makes the camera around $130-$140.  The camera is all I wanted it to be. So this review is really on the bundle.Pros:Great camera at an even more discounted price.16gb SD card class 10.** update** see cons below ** (4) Rechargeable batteries with charger.Cons:Camera bag that wasn't made for this camera. Way too big and came with a PINK tag.  Really? PINK???**update**The batteries can't hold a charge. Store bought batteries of any make will hold their charge while not being used better. Now I really question the value. So besides the camera, the SD card is the extra worth it's salt.Neutral:  (stuff that came, but do not need)LCD screen protectors and cleaning kit.SD to USB reader.Mini tripod.I really hoped the camera case was for this camera. It is so big that it is larger than my camcorder bag.  Since this was one of two things that made this bundle worth the extra money over just the camera alone, it is a disappointment.  The SD card was the other thing I wanted. Guess ill just have to go bag shopping now.Overall a good purchase and worth the price I paid. Now it's $20 more ($185), and at that price probably not worth it for the bundle over buying things separately and getting exactly what you want.", "Date": "December 26, 2012"}, {"Title": "All is great!", "Author": "Purchaserr", "ReviewID": "RF8P5LDOX6RDJ", "Overall": "4.0", "Content": "The camera works wonderfully. I got everything I was told I was going to get. The only problem was is that the rechargable batteries never charge. After the red light turns green, I put them in my camera and it says I'm running low in battery. But, other than the batteries, everything else is GREAT.", "Date": "January 18, 2013"}, {"Title": "Canon PowerShot", "Author": "winteridge2 \"DeerJohn\"", "ReviewID": "R3QZYPEK2MJT6Z", "Overall": "5.0", "Content": "this was purchased as a Christmas gift, but we got to test it after.  Well packaged, fast shipping, and everything was there.  Appears easy to operate, and takes sharp, clear photos.  I am sure she will enjoy it, once she learns all the many functions.", "Date": "January 10, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009LNGRLI"}}