{"Reviews": [{"Title": "G15--exceeds!", "Author": "George Hillard", "ReviewID": "R2TS0WYHR4G9CL", "Overall": "5.0", "Content": "I thought the G15 would be good; I needed 'capability'..that is, really clear images and ability to work well in low light. Also needed a lighter camera than I had been using. I am still learning the G15 but find it easy to use and VERY capable. It is superb quality. Example of capability: watched the installation of a large stained glass window recently; finished about 10 pm. In low light conditions got a great shot of the glass (yes, lit from inside) and the brick building outside in the semi-dark. Auto mode, no flash. Great color, clear images.Order/delivery through Amazon (Beach Camera) was quick and flawless.", "Date": "December 24, 2012"}, {"Title": "Great camera!!", "Author": "Sue Steakley", "ReviewID": "R3FFHS0Y7N0PPZ", "Overall": "5.0", "Content": "I have had 3 of the previous models of the \"G\" series and this one is by for superior!! Great sharpness and color!!", "Date": "March 4, 2013"}, {"Title": "good relation price-quality", "Author": "Martín Tejeda", "ReviewID": "R11UGV4O58WLUP", "Overall": "4.0", "Content": "Easy to handle, very nice photos with excelent color balance, Good quality with dark shadows.Good relation price-quality. Not so good when focus small points", "Date": "February 2, 2014"}, {"Title": "Great P&S; Camera", "Author": "alison", "ReviewID": "RSZTE6Q6A95HJ", "Overall": "5.0", "Content": "Best part is the 1.8 to 2.8 lens.Still learning all the custom settings.Perfect camera for me.Small enough, ergonomics are very good.", "Date": "January 1, 2014"}, {"Title": "fast and handy", "Author": "Pedrito Tongpo", "ReviewID": "R309QPBZR26TCI", "Overall": "5.0", "Content": "I have a G10 but repair is almost as expensive than having G15 so I bought this and I'm very satisfied", "Date": "December 1, 2013"}, {"Title": "A Pretty Good Camera", "Author": "Harry Lipson", "ReviewID": "R19U1K7A8QMXCN", "Overall": "4.0", "Content": "For a point and shoot camera, this is fantastic.  There may be newer 2013 technology, but the G15 takes nice photos.  It is simple to use, very straightforward, and the zoom feature is quite decent.  I would recommend this, but only for someone who wants to buy a point and shoot camera.  It beats a cellphone hands down.", "Date": "November 12, 2013"}, {"Title": "Useful package deal", "Author": "Cath \"Cath\"", "ReviewID": "R2NWUYI0KCX7KT", "Overall": "5.0", "Content": "The camera is great and it was useful not to have to worry about having all the right bits to  start off as this was a gift.", "Date": "October 2, 2013"}, {"Title": "My son loves it !", "Author": "Paul M. Kankula", "ReviewID": "R38S6CNPW5406C", "Overall": "5.0", "Content": "I guess this thing has all the features that a kid would desire.  I've seen some of his pictures and they look great.", "Date": "February 20, 2013"}], "ProductInfo": {"Price": "$449.00", "Features": null, "Name": "Canon PowerShot G15 12.1 MP Digital Camera with 5x Wide-Angle Optical Image Stabilized Zoom Deluxe Bundle With With 8 GB Secure Digital High Capacity (SDHC) Memory Card, Digpro Compact Camera Deluxe Carrying Case", "ImgURL": "http://ecx.images-amazon.com/images/I/419n2CgS0lL.jpg", "ProductID": "B009I26V9U"}}