{"Reviews": [{"Title": "Good camera, crummy software", "Author": "Lonnie E. Supnick \"Big Kahuna\"", "ReviewID": "R1Z51AUIYT2W61", "Overall": "5.0", "Content": "I'm not a camera guru so don't give my opinion of the camera too much weight.  But the photos seem much better than my old Canon, which had fewer pixels and not as good a lens.  Like the burst mode capability.  Battery life seems really good and this package included a second battery which, although not an OEM brand, seems to last as long as the original.The Panasonic software that comes with the camera is almost worthless, unless you have no experience with transferring photos via Windows.  It is slow and clunky and seems about 10 years out of date.  For example, the software that came with my Canon camera gives you the option of transferring only new photos that have not been already transferred.  The Panazonic software does not have this option so you have to uncheck the pictures you don't want and manually check those you do.  The software stores photo bursts in separate sub-folders, which makes it harder to look at a sequence of photos taken on one occasion.  I stopped using this software and used Windows Explorer to transfer the photos to my computer instead.  Windows XP needs the driver installed with this software to recognize the camera when it is plugged in.  Windows 8 does not.Despite my rant about the crummy software provided with the camera, I'm happy with the rest of this package.", "Date": "September 25, 2013"}, {"Title": "So far so good", "Author": "Chris Carty", "ReviewID": "RFDTYZ9BSRXXB", "Overall": "4.0", "Content": "We have used the Camera several times since we purchased.  Takes good photos and has a nice zoom.  We did order a 32GB SD card though.  16G just does not hold many videos.", "Date": "May 15, 2013"}, {"Title": "Electronic Engineer", "Author": "David vu", "ReviewID": "R35L3RC7ZWG78R", "Overall": "4.0", "Content": "The product is great specially it can be used as video recorder. But it doesn't have AC adapter aivailable. So it is unconvenient for a long recording", "Date": "November 9, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009CZW6DS"}}