{"Reviews": [{"Title": "Protects my Hero3 Black!", "Author": "FRF Productions", "ReviewID": "RO2AZJ587QAXW", "Overall": "5.0", "Content": "My GoPro Hero3 Black sometimes cannot always be in it's original protective hard case that it comes with, due to weight or other reasons. In the past I have scratched a couple Hero2 lenses. I was looking for this exact product to save my lens in the event it comes in contact with something it shouldn't while using the \"naked\" case.Build Quality is highPicture Quality is unaffectedWorks as it should!Thanks,TonyFRF Productions.com", "Date": "April 15, 2013"}, {"Title": "plastic \"lens\" problems", "Author": "Tom D", "ReviewID": "R1BOYYAULLPCHF", "Overall": "3.0", "Content": "This clearly isn't optically great to begin with, but my unit came with a bit of adhesive that was tough to get off the lens.  I used a microfiber cloth and lens cleaning solution, but I still managed to get a few small scratches on the soft plastic \"lens\" portion.  In most light, it isn't noticeable on the final image, but when the sun hits it (akin to lens flare), the scratches are noticeable.  It would be nice if GoPro simply included filter threads on the camera's lens, so we didn't have to resort to funny friction-fit doodads like this.Learn from my goof: treat the lens very gently, it scratches easily.", "Date": "February 5, 2014"}, {"Title": "Okay but pricey", "Author": "J. I.", "ReviewID": "R1002N680F24LY", "Overall": "3.0", "Content": "When I purchased this lens cover I was expecting a nice lens cover for the price. The lens cover will slip on to protect lens but is way overpriced, over $20 with shipping. Looking at the construction it is not worth the high price paid. It does slip over the lens but is a little loose fitting on mine and it would have been nice if they would have added a tie down loop. Adding a tie down loop would allow for a small lanyard to catch the lens if it slips off.", "Date": "December 31, 2013"}, {"Title": "it does the job", "Author": "Yoyoyo", "ReviewID": "RTGR1LNZ3SEHX", "Overall": "4.0", "Content": "it does the job, so i cant complain at the moment. at least you know that if your copter falls off the sky with you zenmuse gimble on it, they lens of the gopro will be fine. because the zenmuse doesnt support the gopro with the waterproof hard case.", "Date": "November 27, 2013"}, {"Title": "Oh but it does affect the shots and video", "Author": "Joyce", "ReviewID": "RKRCLF33TMY8L", "Overall": "3.0", "Content": "I have tried mine on the hero 3 and it shows a dark hue around the perimeter of the lens. It looks like a vignette. I think I will be returning it. I would rather spend more and get one that does not have this problem. I dont know how anyone else hasnt commented on this.", "Date": "September 12, 2013"}, {"Title": "HERO3 Lens Protector", "Author": "Lectricman", "ReviewID": "R1GNX7K9BF8KW5", "Overall": "4.0", "Content": "\"MUST-HAVE ITEM\" for aerial Hero3 on a gimbal users!!!The Good:  Would not fly without it. Completely protects the lens from damage. Well made, professional quality. Picture is unaffected in most situations by having this installed.The Bad: Will show dings and scratches. But better this than the lens. Slip-on fit losses its grip after 10 installs. Lens should be glass.Suggestions: - Use Schotz water white UV glass. No Exceptions! We pros would all pay 50-100 bux for that. While you are at it just make a \"filter holder\" that attaches the same exact way but allows for interchangeable filter gel squares to go in front of the glass disc. - Make the fit tighter allowing for better security and allowing the user to set the filter slightly away from the front center of the camera lenses curvature.  - For the love of gawd at least make a polarizer.Review: I love this item. Its saved my camera lens from being ruined in 2 different crashes. If you have to fly the Hero3 naked you'd be foolish to not use this product unless you are a top pro flyer that never crashes and lands perfectly every time. The one I received works superbly with my Hero3 mounted on an ARRIS CM2000 gimbal with its camera cage. The front carbon plate on the gimbal gives the proper spacing preventing the front of the lens and the filter from touching one another. The slip-on grip lost its tightness after about 10 install/deinstalls. I corrected the issue by easily adding a strip of aluminum tape on a portion of the inside of the sleeve. Worked great. This item will give you lens flare when pointing into the sun but it looks acceptable unless you are a lens-flare-phobe. You know who you are. Finger print oil will cause the image to wash out badly when pointing into the sun. Keep it clean on both sides.Conclusion: Buy one, don't leave earth without it!", "Date": "August 31, 2013"}, {"Title": "Love these", "Author": "Schuyler j Hagglund", "ReviewID": "R23QEMGWW49XWK", "Overall": "5.0", "Content": "I have six GoPro Hero 3 Black Editions and I want to keep them nice...this does the trick. I bought 4 and I love them.", "Date": "July 24, 2013"}, {"Title": "You get just what you ordered", "Author": "Parker Gyokeres", "ReviewID": "R3TCO1X7IJ5L5O", "Overall": "5.0", "Content": "It's a ring with a piece of plex on the end of it, but it fits perfectly, is optically transparent and will save your butt from being chewed off by the wife when you won't have to explain how the lens on your gopro was scratched because you were cheap and stupid.  There are more expensive options, but this works just as well.", "Date": "July 21, 2013"}, {"Title": "Can give the impression there is a thumb print.", "Author": "Carl Tyler", "ReviewID": "ROQPZSDG16SIW", "Overall": "3.0", "Content": "I found with mine, if I push the cap all the way on, it makes contact with the GoPro lens.  This then leads to a small area in the center of pictures that is out of focus, making it appear as if there is a thumb print.  So I always have to remember, not to put the lens cap on all the way.Was pretty good value.", "Date": "July 11, 2013"}, {"Title": "a must have for Phantom Owners", "Author": "rt66west", "ReviewID": "R3JW0CUJINC804", "Overall": "5.0", "Content": "I wish the lens was made out of Glass instead of the easily scratched plastic, but Sending a Go Pro up naked and unprotected means you have to replace the camera lens itself should a accident happen. This does provide a little protection from destroying the camera lens during flight.", "Date": "July 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BT0IVRO"}}