{"Reviews": [{"Title": "Oh so easy", "Author": "BostonBoy", "ReviewID": "R2QS2G21LJ7MW", "Overall": "5.0", "Content": "I have wanted a new camera only to have wifi capability which my old camera did not. I looked at reviews for the new wifi version of my old camera but they did not sound positive - hard to get wifi to connect. The reviews for this camera did and so far, I am finding this true. I have spend just about 15 minutes exploring the basics without a manual and everything is so intuitive. I was able to successfully link to my home wifi network and email myself a test picture. It also presents a list of photo storage services which I plan to explore. Will report back to confirm uploading to one of these services is also easy. Thanks Samsung!", "Date": "August 25, 2013"}, {"Title": "Excellent camera!", "Author": "James C. Kim \"drkimm\"", "ReviewID": "R3EO31VNAYP4U", "Overall": "5.0", "Content": "Its an excellent camera with many different features. The manual took a long time to read it but it was worth the effort.", "Date": "January 4, 2014"}, {"Title": "Great camera easy to use", "Author": "Karyn \"Karyn Whisler\"", "ReviewID": "R7UV2SLZAT4B6", "Overall": "5.0", "Content": "Arrived on time, no damages, takes amazing pictures the front screan really helps with taking family photos that we need everyone together in the photos come out clean and have pleanty of features to play around with user friends easy set up and set up to my laptop was a brease come with a booklet thats easy to fallow along in over all great product the screan protectores are easy to apply and im not sure what i will se the tiny tipod for it is fairly small i might end up getting a bigger one but the tripod is good quility and for everything i got i am happy with the price and products :)", "Date": "November 16, 2013"}, {"Title": "Replacement for TL205", "Author": "Pasqualina Vecchione", "ReviewID": "R3IULWJP7K44I9", "Overall": "4.0", "Content": "I liked my TL205, (dropped it), did everything that it needed to do, compact and not very expensive.I have not used the DV150F but it looks like it does more than the TL205.  So far I am happy with it.", "Date": "September 12, 2013"}], "ProductInfo": {"Price": "$174.00", "Features": "1.5\" Dual View Front LCD\nSMART features - Social Media Upload, E-mail, Direct Link, Mobile Link\nPC Auto-backup, Remote Viewfinder, All share, Cloud Service\n720p HD Video", "Name": "Samsung DV150F 16.2MP Dual-View Smart Camera w/ Built-in Wi-Fi in Cobalt Black + 8GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51xSu0PZbaL._SY300_.jpg", "ProductID": "B00BQMCGAS"}}