{"Reviews": [{"Title": "Good camera but is it worth the money?", "Author": "M&A;", "ReviewID": "R180BZUQZNLY8E", "Overall": "3.0", "Content": "To start with I do own the V1 and all the Nikon 1 lenses except for the 10-100 PD zoom. I just borrowed my friends V2 for the weekend and did some comparisons between the two to see if it would be worth upgrading to the new V2. These are only my initial impressions and only for still photography. I do not shoot video so I have no opinion on the video capabilities of this camera.  I consider myself an advanced amateur when it comes to photography and have sold some of my work at local art shows and craft fairs.  I use mainly a D3X and the D800 for my work but have come to enjoy the 1 series (it took awhile) for its light weight, compatibility with F mount lenses, and more than adequate image quality for those times when I do not want to carry a DSLR.It seems that Nikon has not learned its lesson with the V1 and is still overpricing its top of the line 1 series cameras. Even with the $50 instant rebate the camera is seriously overpriced for what you are actually getting.  At today's price of the V1; (Nikon is giving them away) of $299 there is no real reason to buy the V2.  That difference in price is not getting you much more for the extra money that has to be spent; in fact you are giving up some features.So what are you paying a premium price for compared to the V1:Well you get:An improved 14.2 MP sensor vs. a 10MP, not a big change in IQ but it is welcome. Base ISO has been increased to 160 vs. 100 from the V1. Just be aware the mechanical shutter has a maximum speed of 1/4000 of a second. If you shoot at large apertures this may present a problem in bright light. You may have to switch to the electronic shutter which has a maximum speed of 1/16,000 of a second. You get a better more direct way to access functions like white balance, ISO, metering, and exposure mode without going back into the menus.  Image review can now be turned off if you desire.  These items are much welcomed and are a big improvement over the V1.Nikon adds yet another \"silly mode\" to the \"smart photo selector\" & \"motion snapshot\" called the \"best moment capture\" which allows you to pick the best frame of a 40 frame sequence. These are totally useless IMHO and should be ignored as should the auto exposure mode.A redesigned body with a built in grip and flash.  Also a rear command dial has been added which allows easier control of camera functions. The exposure mode dial has been relocated so that is less likely to be inadvertently changed. I have put gaffers tape on my V1 exposure mode dial to keep it where I want it. These are welcomed features and are big improvements to the handling of the camera.The electronic viewfinder (EVF) seems different from the V1. During use objects seem to jump around almost like the refresh rate is not high enough and the color seems to be off sometimes. In low light it seems grainier and not as sharp as the V1. I wonder why Nikon changed anything from the V1 since the V1 has an excellent EVF.HDR has been added to the shooting menu. IMHO Nikon should have added auto exposure bracketing rather than in camera HDR to allow the user to process their own images using an external program such as Photomatix or Photoshop instead of the camera processing the image on its own.The camera will now provide 15fps vs. 5fps in AFC.  There are some minor differences in the AF-C focus mode. There are now brackets in the \"detailed\" display of the LCD and EVF that shows you where your subject should be to acquire focus. Also the manual does not discuss any limitations of the AF system at the higher frame rates as the V1 manual does. Need to do more testing on that. Other than that the AF seems to be just as fast and accurate as the V1.So far so good you say, but hold on; you are losing some things that you might have wanted:No IR sensor in the back of the camera, if you want to use the IR remote you have to point it at the front of the camera now. The V1 had sensors in the front and back. This can be a real pain if you use a tripod since you now have to stand in front of the camera to use the remote.You also lose the interval timer which is a nice feature to shoot time lapse photography, the feature was on the V1 but it looks like it has been dropped from the V2.The V2 will only use the electronic shutter when you either put it in the silent photography mode or change your frame rate to greater than 5 FPS. So if you need a fast shutter speed say to take a picture in bright light with a large aperture to get that shutter speed greater than 1/4000 you have to go into the menus and either turn on silent photography or change your frame rate. The V1 allowed you shift from mechanical to electronic shutter by using the function button.For all of you that own other Nikon equipment you will now have to buy yet another type of battery if you want spares. The V1 uses a battery that is used in the D600, D800, and the D7000. I guess that Nikon felt they were losing money because owners were not buying enough spare batteries and chargers so we have yet another battery to add to our collection.The option for sound settings in the setup menu has disappeared. Now instead of being able to control the sound of the electronic shutter and autofocus/self-timer separately you now have a silent photography selection in the shooting menu which turns off both. In addition when you turn on silent photograph it automatically selects the electronic shutter. So if I want to turn off the beeps for autofocus but still have the shutter sound or keep the mechanical shutter active I am out of luck. If shooting flash with silent photography turned on I am now stuck with a 1/60 sync speed. In certain cases I like to hear the shutter to confirm the picture was taken but want to turn off the autofocus beeps because the beeps seem to disturb people more than the shutter sound. There should be way to control sound level for each function not just a master switch for all sound which also selects the electronic shutter. Nikon takes a step in the wrong direction.So Nikon is giving some but it also taking back some with the feature set. I always thought that newer models take steps in the forward direction and not backwards.But the real reason that the V2 is still not worth the extra money are the items that were wrong with the V1 and are still not incorporated into the V2.  What are these you may ask?The camera still does not have a standard hotshoe. This means that you will have to buy the 1 series flashes if want to use an external flash. Another thing that has yet to be incorporated is ability to use the built in flash as a remote commander. Since Nikon has not produced an adapter to use a standard flash on 1 series cameras you cannot use one of Nikons wonderful external flashes as a remote commander either.Speaking of flashes, Sync speed is still 1/250 of a second for the mechanical shutter and only 1/60 of a second with the electronic shutter. My D40 had a sync speed of 1/500 of a second. There is no reason not to add either FP high speed sync to the mechanical shutter or a faster sync speed on the electronic shutter.  The higher sync speed becomes very useful to stop motion in certain situations when using flash.The Auto ISO feature still does not have the ability to for the user to input a minimum shutter speed that tells the camera when to increase or decrease the ISO. The thing that makes this annoying is that Nikons preset value shutter speed (seems to be around 1/30 of second) of when to increase ISO are still to low IMO for use on lenses without VR such as the new 18.5 mm 1.8. Not all of us are human tripods. The newer Nikons also take lens focal length into account when determining the correct ISO; the V2 does not seem to take this into consideration. So if you want to use auto ISO the camera now forces you to go into shutter priority so that you can maintain your shutter speed fast enough to prevent blur in your photographs.The camera still does not display RGB histograms. This is totally unacceptable on camera in which costs this much and exposure is so critical to control noise due its small sensor size.  The luminous histogram will not always show when a channel is blown out. My Canon S90 has this ability and it costs a lot less.No programmable function button or user setting. There should be at least one function button that is user programmable for our shooting needs instead of only having only what Nikon thinks we need available.  Also there should be at least two custom setting banks that allow the user to change from one bank to the other at will so that each setting does not have to be changed individually when conditions dictate a change in settings (i.e. switching from landscape to sports photography).Also if you own the V1 you have probably have had to buy spare accessory port covers since they are small and easy to lose, well the V2 accessory port covers are also small and easy to lose and they are not the same.Last but not least is that auto exposure bracketing has still not been added. Since this camera has a limited dynamic range, when you take a picture in a high contrast situation, HDR photography becomes important. Without this feature I am severely limited when I choose to use HDR because I must adjust the exposure manually which takes time and forces me to use a tripod. Nikons in camera HDR has limitations and is not as good as using a program such as Photoshop or Photomatix.The worst part of all this is a lot of these things can be fixed with firmware updates, but Nikon has chosen not update the V1 and I do not see them doing it with the V2 either. So if you value these things in your photography do not expect Nikon to add features to the camera with firmware updates.After weighing the good with the bad I feel that the V2 while a big improvement over the V1 still does not command the premium price tag Nikon has put on it. (Even with the $50 instant rebate)  The V1 with its discount is a steal at this time and is a great camera once you adapt to it. Things like not being able to turn picture preview off or having to go into the menu to change ISO, WB, or exposure mode will probably annoy you at first but over time you tend to adapt to the camera. The V2 is also a great camera, better than the V1 in some respects, worse in others, but not worth the extra money you will need to spend to own it, remember most are going to have to buy spare batteries which are only used in the V2.So in a nut shell if you are looking at a V2 should you buy it?  The V1 price cannot be beat right now and the image quality of the V2 is not that much different than the V1. If I did not own the V1 already I would buy it in a heartbeat vs. the V2.  Am I going to upgrade? No, not at this time, I am going to wait until Nikon discounts the camera to a price that is more reasonable as they have done with the V1 or wait for the V3.", "Date": "December 3, 2012"}, {"Title": "Excellent interchangeable lens travel camera", "Author": "Albert \"DrAlAlDr\"", "ReviewID": "RSMSRUIBOJAAW", "Overall": "5.0", "Content": "I have multiple digital cameras, from point and shoots to travel zooms to super zooms to Nikon D7000.  I also travel a lot, for business and some for pleasure.  I've found I can get by these days with a travel zoom when I'm traveling by myself on business, but on vacations with my wife I want more...but I hate lugging around the D7000 and the big, bulky lenses.  I've followed the mirrorless category of cameras for a while, but the micro 4/3rds class just didn't cut it for me because while the camera bodies were smaller than a D7000 or even D3200, the lenses are about the same size due to the sensors being similar in size.  Sorry Sony NEX user, but this is the problem with that camera and other 4/3rds in my opinion.  That meant going with a smaller sensor to get smaller lenses, but travel zooms are too small and that creates problems - especially with excessive megapixels (the smaller the sensor and the more megapixels, the greater the noise - even at low ISOs).  So I was very interested in the Nikon 1 series.  The sensor is between Nikon's DX and much smaller travel zoom/point and shoots, so it uses smaller lenses - but I still can switch lens like a DSLR (and number of Nikon 1 lenses is growing).  The V2 limits itself to 14 megapixels, so with the larger sensor noise is much better than a travel zoom/point and shoot, though not quite that of DSLR (but I'm ok with trade-off for travel).  The V2 is MUCH more user friendly than V1 or J1.  I like the various shooting modes, and while it isn't perfect, it is a darn good camera and fun to shoot with.  The charger is compact (plugs fold in), and the flash is decent.  I like having option of a EVF for certain situations, like sunny days.  And, best of all, the V2 with lens attached is about the same size as a super zoom, so smaller than a DSLR and thus easier to take on trips - including international travel.  I have the 10-30 mm lens and the 30-110 mm lens, which are good for starters.  Looking forward to getting the 18.5mm fast lens and 10-100 mm zoom, which will make this camera even more useful when traveling.  Have seen a few reviews start to come out.  While people complain about the price, the fact is there isn't much else that fills the gap in sensor size, and Nikon has clearly put a lot of research into this camera.  So while I'd be happier if it was cheaper (aren't we all happier if we can get anything we want cheaper?), I am finding I love this camera and the Nikon 1 system overall.  For vacations where we have to fly, it will replace my D7000 most of the time.", "Date": "January 27, 2013"}, {"Title": "For me this is the new standard", "Author": "Craig E. Dupler \"Enkido\"", "ReviewID": "R3SOXLMNF81ORK", "Overall": "5.0", "Content": "This camera marks my return to being a somewhat serious amateur shutter bug.  I'm 63.  Previous serious cameras have included a Nikon Ftn, F2s, Nikonos, and a Nikon FA which I still have.  I have lost track of the many utilitarian digital snap shooter cameras that I've had over the past couple decades.  Back in the day (mostly the 70's and early 80's) I had a few nice shots that were published or otherwise won awards, and even made a few bucks selling prints.  So that should give you a notion of how to rate my comments and objectivity.  I was no pro, but a very contented amateur that went to the first and third versions of the Nikon School (if they still have that seminar or something like it, I would recommend it to anyone).I like the Nikon 1 v2 more than a little.  It's convinced me that the investment in the pentaprism and mirror assemblies no longer add anything to the camera, including the weight needed to make it steady in the hands.  That of course was the problem with small cameras (apologies to old Leica fans).  There was something about the SLR design and weight that just worked well in the hands.  Digital cameras until recently seemed to require the same general layout and feel of the old SLR's to work well in the hands.  In my opinion, the v2 feels great.  Yes it is a little smaller, but the Nikkor 1 lenses (I have 4) somehow compensate by being very nimble and smooth.  My fingers do not feel squeezed onto the smaller control surfaces as I feared they might.Ok, so it feels good in the hands, but can it take a decent pics on demand (within the limits of the user's abilities of course)?  First, let's face it, the original Nikon F had some light leakage issues when pushing it in harsh light conditions.  Lens hoods and a little light lubricant on the F mount were necessary.  The light leaks went away with the F2 and the FA, and I liked the FA so well that the F3, 4, 5 and 6 never felt like they would do anything that the FA wasn't doing for me.  I had the 35 1.4, 55 1.2, the 43-86 and 80-200 zooms.  Those work horses were fantastic on the FA.  So does the v2 at least measure up to that experience?  Yes, and more.  I have the 6.7-13, the 10-30, the 10-100 zooms, and the thoroughly amazing 32mm f1.2 speed demon.The Nikon 1 mounts are smooth, tight, and quiet.  The click of the lens lock is not nearly as audible as it was with the F mount lenses.  The only issue I have had so far is a little full spectrum prism glare when working with the light source too far forward and no lens hood in place.  The hoods are necessary!  I just wish that Nikon had figured out how to have them slide in and out of the lens barrels for the zooms the way the old fixed focal medium telephoto F mount lenses did.  Fiddling with the hood to flip it around from its reversed parked position is too cumbersome, although it is better than not having them nest on the lens in reverse at all the way they were in the old days.Another question that comes up with the Nikon 1 Nikkor lenses is the variety of sizes in the front thread mounts.  52mm for a big family (or any other size thread) is being ignored.  However, with modern digital sensors and logic, most filter requirements have gone away.  Maybe I'll add a polarizer or a few ND filters some day, or play with some orange sunsets, but right now I'm getting everything I want out of the bare glass.Another question is whether the compactness of the 10-30 merit its bag weight and space with the other two zooms in place?  Maybe not, but it should be kept in the backpack or car or where ever the heavier stuff like a tripod are being kept, because there are times when taking just that one small lens on the camera with no more accessories than maybe a spare battery in one's pocket is more than enough, and anything more is definitely in the way.  The v2 cannot somehow magically become a high quality pocket camera, but it does get pretty small and innocuous when it is only sporting the 10-30, so for now I'm keeping it around and even carrying it in the gadget bag most of the time.Now about that 32mm f1.2: I thought I knew something about low natural light photography.  I've done quite a lot of it over the past 40 years.  However, this lens on this camera totally changes that game.  It really has the ability to capture what natural human vision can see.  Forget the flash with this lens.  You don't need it, even in the most dimly lit rooms or outdoors at dusk or in the pre-dawn morning.  The lens is expensive, but it is worth every penny.Ok, so out on the net there are quite a few people carping about the v2.  They don't like the proprietary hot shoe concept or some of the tech specs compared to a Sony or some other box.  Ok, but for me a camera starts with its feel in my hands, the range and quality of the lenses that compliment that feel, and whether or not it does the job (i.e. getting the pics my mind starts framing around what I'm seeing).  This box does that for me and does it well, and my Nikons have always been good to me.  I have not liked and have sometimes even hated some of Nikon's other boxes.  I really don't like their top of the line digital boxes.  They are just too bulky and heavy.  Maybe folks who like large format SLR's like the Pentax 6x7 or the Hasselblad like the bulk of them, but I find them annoying.  The smaller Nikons that I've settled on and lived with over the years have made me happy, and the v2 is now filling that need.  Will it last me as long as the FA did (it didn't die until Kodachrome disappeared). Who knows?  But, it is off to a very good start.", "Date": "June 13, 2013"}, {"Title": "Much better than Nikon J1", "Author": "Michael Wu", "ReviewID": "RP7IYP0XPSIY9", "Overall": "5.0", "Content": "I am writing this review for those with kids that want something better than a point and shoot and don't want to lug around a heavy DSLR. This is a great camera. I was going to give it 4 stars for the price. But then decided against it. To some price might not be a factor. Besides who knows what the price might be discounted to at the time of this reading. At it's current price, it's really expensive. I can buy a D5200 for the price. But then.. it's almost like comparing a light weight laptop vs. a heavier one with more power. You pay a premium for lightweight.I have the Nikon J1 and 2 small kids. My goal was to find a camera that is light weight, small in size and fast enough to capture moments with decent quality. I've been disappointed with the J1 as the number of good images that I get are a lot less than I anticipated and would have returned it if I didn't accidentally scratch the body.I have a vacation coming up where I don't want to bring my D90 along and clearly the J1 wasn't cutting it. So I decided to give the V2 a shot. I did consider the V1, but it's out of stock in white (I want to be able to reuse my J1 white lenses). The following are my opinions of the camera (from someone who relies more on auto modes than making manual adjustments):Looks and Feel:The pictures on the web of the V2 look horrible. But it looks much better in person. It's much lighter and smaller than my D90 and although heavier than the J1, the weight is hardly noticeable in comparison. I especially like the layout of the V2. It's very similar to my D90 and much easier to use. Turning on/off is fast (though the switch is the only part on the camera that feels cheap. I can deal with it as its much easier to use than having to find an push a button). Less clutter around where your thumb would rest (minimizing the times I accidentally switch modes on the J1). Can't emphasis the benefit of the grip as it's easy to lose grip and drop the J1 (luckily only on carpet so far). It really feels and looks like a mini DLSR where as the J1 feels like an upgraded compact point and shoot.Performance:Image quality isn't DLSR, but it's not meant to be. It is darn good though. Better than my Sony point and shoot. Key thing for me is that it's much faster than my point and shoot and it actually captures a lot of sharp images (more than J1) with good colors. This is the key deciding factor in keeping the camera. It will work great in my situation, need a light, small camera that will perform well so that I can carry all the kids stuff and keep up with them. Note that I am not a professional or would even consider myself an enthusiast. But I can tell a good picture from a bad.", "Date": "January 24, 2013"}, {"Title": "My Backup for the D800", "Author": "Edgar Betancourt \"HD Lover\"", "ReviewID": "R10LXYH8FGLDR4", "Overall": "4.0", "Content": "I bought this the v2 for my wife since she likes a small camera form factor. It also serves as a backup for my D800. Up to now we are delighted with the V2's performance.Its stills are excellent for up to 8x 10's. Among its strengths is how darned fast it is, it focuses instantly and well. Its metering and exposure are right on every time. With the d800 as a comparison point, Im actually quite surprised about how slick the auto setting is in figuring out tough lighting conditions to get excellent shots, what might take 2 or three pics on my d800 is done perfectly the first time on the V2. GIven its electronic shutter with image stabilization it shoots excellent handheld high def video, the d800 on the other hand, needs a tripod. Everyone is always picking at the D800 for being slow (4FPS), well the v2 shoots at 60 FPS perfectly (IMO probably 5 times faster than anyone will ever need unless taking pictures of bullet trajectories!) Compared to the Sony's I think the cameras are really a different animals the Sony's are in general larger, have heavier, biggerr lenses plus you are stuck with the usual sony only appendages, with the V2 (adapter) I can use essentially any nikon AF lens, my 300mm 2.8 looks ridiculous attached to it but works perfectly with it. The NEX larger sensor does provide IQ at APS-C level but that is not what the V2 is about its about very small size with interchangeable lens flexibility and exceptional speed. The only negative I can find is its so so high ISO performance. In regards to the hot shoe, the included flash works pretty well, regular hotshoe sized flashes as my SB910 are bigger and heavier than the V2 thus if you want an external flash you are probably better off with the smaller J and V series flash unit. In summary the V2 will fill the ticket for those that want a camera that is point and shoot in size with very good IQ and has the flexibility of interchangeable lenses, the excellent video is a bonus.", "Date": "July 17, 2013"}, {"Title": "Good product, Poor price", "Author": "Albie \"Do Right\"", "ReviewID": "RWC9MZGNTJI3I", "Overall": "4.0", "Content": "Lol...I really need to buy cameras after they have been out for a while. I bought this V2 when it first came out....ouch.I own the Nikon J1, almost all the Nikon 1 lenses, and have owned several Nikon DSLR's. I also have the adapter FT-1 to goof around with my other DX/FX lenses.You can read more detailed reviews of the V2 elsewhere, but overall the V2 is a great little camera with DSLR focusing speed when the light is good. The V2 is better than my J1 with respect to focusing in dim lighting. My J1 sometimes can't even lock in focus in poor lighting. I don't see any difference in image quality between the J1 and V2. The grip and better controls make the V2 easier to use than the J1. The V2 still has that greenish cast like all the recent N1 and DSLR cameras from Nikon; most people won't notice this. Both the J1 and V2 are so light that I rarely use my Nikon DSLR. I usually have the 10-30 on the J1 and the 18.5 f1.8 or the 30-110 on the V2. Since they are so light, I usually have both cameras around my neck so that I don't have to change lenses with the V2. I would have bought the V1 instead of the J1 if the V1 had a build in flash. The V2 has a built in flash.Like the J1, the V2 video is very good. That is probably the best reason I like the Nikon 1 cameras because they do both photo and video pretty well. When the kids are running around the Nikon 1 camera's video keep the kids in focus in good light. DSLR's will focus in and out trying to keep up with moving objects.If price is a problem, then wait for the V2 to drop in price or get the V1 if you don't mind that the V1 has no built in flash.", "Date": "April 3, 2013"}, {"Title": "Just what I was looking for", "Author": "james staley", "ReviewID": "R2JJSJ6UI8PZMC", "Overall": "5.0", "Content": "I needed a small ligtweight but decent camera for travel. This is it! Hats off to Nikon, now if I was only a little more talented at taking photos.", "Date": "May 6, 2013"}, {"Title": "Finally an actual compact rival to full-size DSLR", "Author": "Peter W. Coe \"Mr COE\"", "ReviewID": "R1G4MJ3S2X4BQ4", "Overall": "5.0", "Content": "I own or have owned Canon D30 - 50 & 7 as well as Nikon D7000, and have tried the Panasonic GX1 compact.  The Nikon V2 is finally a compact camera the can keep up with the DSLR.  Focus is fast and accurate.  Continous shooting is also fast and many of the frame settings are individually metered producing fantastic shots.  Low light is some of the best Ive seen. Build & Feel are strong and hefty, but still give the light tuck away concept.  Video is the best ive seen in any camera and even better than camcorders, even though Mpeg is the only format, but I view on computer only anyway.  I could go on and on, but I havent found any faults with the camera itself at all.  My only issue is with Nikon and the small selection of lens choices.  Yes they have the Nikon FT-1 mount adapter, allowing you to put any Nikkor lens on this V2 compact body, but a fullsize 18-300 lens on this little guy, kinda defeats the purpose, even though the 2.7 conversion factor puts some kick into your larger lenes.  Great camera for the profesional and serious picture takers.  Somewhat expensive, but its a rare product that does what it says it does..", "Date": "March 31, 2013"}, {"Title": "Great little camera!", "Author": "Eli Akin", "ReviewID": "R1V6KDBNNCB1LV", "Overall": "5.0", "Content": "This is a great camera! Shoots well in all situations including low light. The viewfinder takes a little getting used to but I have gone from a d80 to the 1 v2 and with it being so small, it is simply hard to beat! I look forward to purchasing the FT-1 mount and trying out some different lenses.", "Date": "May 23, 2013"}, {"Title": "Great Camera", "Author": "Hunter", "ReviewID": "R8LILGEGTMMTV", "Overall": "5.0", "Content": "I bought it ! This is a great Camera. Try it and remember Buy more Battery to extra energyB009WZS3QWThe camera is fairly feature full and indicates that Nikon is dead serious in pursuing the MILC portion of the market.For one thing, the hybrid auto focus system relies on a 73 point AF array to deliver accuracy and very precise focus, even on moving subjects.Continuous shooting is a stand out: photographers can capture approximately 15 up to 45 fps; you can also shoot a run of 40 frames at approximately 60 fps. Taking it further, you can shot at 400 or 120 fps with a size limitation of 640×240 or 320×120 pixels respectively. The camera's internal memory can store up to 100 successive images.A novel mode is the Enhanced Motion Snapshot Mode which saves a four second movie file plus a separate JPEG image; alternatively you can save a 10 second movie file without a separate JPEG image.And there's Best Moment Capture Mode, an advanced creative mode that allows you to `slow down' a moment while you are shooting. By pressing the shutter button halfway down when focused, photographers can capture approximately 1.33 seconds of live action, while the subject is displayed at five times slower than real time. Helps you catch that instant when things are happening real fast.Get this with more special offer:B009W4E4S4", "Date": "July 10, 2013"}, {"Title": "V2 is a mixed picture for me", "Author": "M. Winchester", "ReviewID": "RZ4LFVOPSKJ09", "Overall": "3.0", "Content": "It retains most of what was solid about the V1. It has added to it's pixel count, but base ISO is also boosted, so new real improvement in that department and for my shooting, that was it's biggest weakness. For a compact camera, with it's own lenses, and pretty good to excellent light, it is a solid performer. Add the FT-1, with the limit of only a single centered focus point, and it's reach is nice, but it's a lot tougher to get the desired composition, since I'm usually using bigger glass and a big tripod just to try to keep it still enough. Focus and recompose isn't an option and I rarely have my subject in the center of the lens. I had hoped they would have improved the ISO performance some and addressed the limitations imposed when the FT-1 is attached. They did neither. More pixels, to be sure, but still at a fairly high sticker price. If you don't need the higher pixel count - get a V1.", "Date": "April 23, 2013"}, {"Title": "Rod jr", "Author": "rodney", "ReviewID": "R100XPB6ZL2MKR", "Overall": "5.0", "Content": "Was amazed by how easy it was to use. I had no camera experience what so ever and this one was recommended to me and I love it", "Date": "April 13, 2014"}, {"Title": "A great take-along camera", "Author": "C. Norris \"afishionado\"", "ReviewID": "R3914F9FAM3KXM", "Overall": "5.0", "Content": "This camera is better than my iPhone, much smaller than my Canon DLSR, and easy to carry - unobtrusive.  That said, the quality of the pictures does not compare well to my Canon with top of the line lenses.  Hard to get much of a bokeh with this camera no matter what lens you put on it.  Also does not always focus properly so I usually wind up with some pictures that at not in proper focus.  Still a great walk-around camera for its purpose.", "Date": "August 15, 2013"}, {"Title": "I love it", "Author": "Jiefu li", "ReviewID": "R144VVPEYSB3TA", "Overall": "5.0", "Content": "i love this camara, this is what i am looking for. I just suggest to buy your own lence. the 10-30mm is not really useful.....", "Date": "November 3, 2013"}, {"Title": "A good and friendly travel shooter", "Author": "Lee Mclaughlin \"Lee Mac\"", "ReviewID": "R1NJ1FMX92R9JG", "Overall": "3.0", "Content": "For the travel photographer this is a good choice..with the caution that enlargements about 9X12 will look a bit 'thin' and grainy.  While I love the new focus speed and feature for looping a group of frames in slow motion in order to select the perfect moment...this is great if you want to stop your shooting and stare into the viewfinder for awhile in this process.  Great for the shooter that does not shoot fast in action settings.I am a bit disappointed with the focus function when shooting candids in constantly changing lighting and angles.In my first days outside shooting people and dogs and kids, I was actually shocked that the camera made so many errors in exposure and focus.I shoot with a Cana mark ll and a hoard of \"L\" lenses. But I am still healing from very serious neck surgery and need to have a smaller camera package for extended shooting. My Canon gear is just too heavy for me just yet.The Nikon package is really great if you don't push it for speed performance.  It just does not hit the mark for me in my heavy shooting style.There are other 'silly' functions like Nikon took away the interval timer function..why?  There are other weird functions that are frustrating to an advanced shooter. I think the camera should be much cheaper.  I also purchased the OM-D Olympus and side by side it outshine the Nikon 3 to 1 -So- bottom line...if you shoot modestly and are not a power shooter-action junkie, then this could be an excellent choice for travel. If you do want to shoot like Rambo you might be disappointed.", "Date": "May 10, 2013"}, {"Title": "unit over heats when used for a long time", "Author": "VMorg", "ReviewID": "R1TXIFTIMOGT1A", "Overall": "3.0", "Content": "easy to use however when using for a long time camera overheats and wants to shut downother features are okay", "Date": "July 24, 2013"}, {"Title": "Too heavy/bulky for use as a vacation camera", "Author": "Kymerator", "ReviewID": "RDB2LWZ0S3B5Q", "Overall": "3.0", "Content": "It's fast to focus, and I liked the quality of pictures taken in low light, but I purchased it specifically for a vacation and it was both HEAVY and BULKY.  I used a replacement cross-body strap to take some of the strain off my neck, but it's an odd shape and bounced uncomfortably on my hip and was constantly banging into things.  Also, zooming must be done by rotating the barrel of the lens, so I always had to use two hands.  This was not convenient when trying to shoot over the crowd or for quick street photography of interesting people.  In the long run, I would have been just as happy/miserable carrying my Canon Rebel T2i even though it is physically larger.  As soon as I got home, I bought the pocket-size Canon PowerShot SX280 to use as a vacation camera, which is what most of my fellow travelers were using.  We were shooting side by side, and in some cases their pictures were better than mine. Also, with the Powershot I can turn it on, shoot with one hand, and stick it back in my pocket.  If I did not own a DSLR, this Nikon might have been an okay purchase, but its weight makes me hesitant to grab it in most circumstances.", "Date": "November 20, 2013"}, {"Title": "Nikon 1 V2", "Author": "Judy Oyer \"zipreader\"", "ReviewID": "R3ASYYDGSXWBYL", "Overall": "3.0", "Content": "It was not quite what I expected and I returned it and purchased a Sony, which I like but it is heavy also.", "Date": "May 1, 2013"}, {"Title": "Why? NEX-6 is superior", "Author": "M. Luu", "ReviewID": "R3JIUBSW112LMM", "Overall": "1.0", "Content": "why would any buy this camera? the sony nex-6 is superior in every respect and cost about the same.nikon 1 cx sensors are smaller than micro 4/3; that's just pathetic. sony nex camera have aps-c size sensor that will blow this camera out of the water.", "Date": "January 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BTWC3RG"}}