{"Reviews": [{"Title": "Early thoughts...", "Author": "Chris Newman", "ReviewID": "RW4VC9S0QU0DP", "Overall": "5.0", "Content": "Just a few thoughts after a week of limited use.I wanted a point & shoot camera that would fit in my pocket to carry at all times. I am a pro photographer but don't want always to be hauling a bag of heavy DSLR's around.  But the camera had to have the following:-1. Small and well made.2. 24mm equivalent lens at the short end. Didn't care much about the tele end so 120mm was more than enough for my needs.3. Need WiFi connection so could fire and view what camera was seeing from my cell phone or tablet.4. Needed RAW file format.5. GPS nice addition but not the most important thing for me - I could live without it.Well the P330 has all the above and I can tell you that can be hard to find in a small point and shoot (I consider the Canon G15 too big and besides I have a G11).Noise levels seem low at 400 ASA I have not tested at higher ISO's but hardly ever use them. In Photoshop CS6 the noise in a blue sky looked good and with noise reduction applied it then just about disappeared. I have the noise set to LOW in the camera as didn't want to softern the image - although that may not happen with this camera. There is a LOW, MEDIUM and HIGH setting for noise.I found setting the aperture hard to figure out as I kept mis-reading the book. In Apperture Priority or Manual the aperture is set by turning the 4 way controler on the back of the camera and I was pressing different sides of this wheel.The ON/OFF button is flush with the top of the camera body so it is best to turn on or off the camera by using a finger nail tip rather than the pad of the finger. It is designed this way (I guess) to stop the camera being accidently turned on or off during use.Images seem sharp and what you see on the view finder (no viewfind eyepeice) is what you get as far as exposure goes.I put a 64GB SanDisk 45MB/sec card in it and that works fine. Thats about all I can contribute for now. I am sure more detailed reviews will appear shortly. But I'm happy with this well made and good looking camera.Oh, I do have one issue with Nikon.  There appears to be only the limited VIEW NX2 software (that came on CD with the camera) to convert the cameras RAW files (NRW format, not NEF) into TIFF or JPEG. I think Nikon could have updated CAPTURE to co-inside with this camera launch. It does not even appear to be included in the next Adobe Camera RAW conversion update for Photoshop. Too many RAW formats nobody can keep up - apparently even the camera manufactures.  That's as of today April 2, 2013.Correction: As of today April 4, 2013 Adobe have just released Camera RAW update 7.4 and included the NRW format used by the Nikon P330- yea!!! It appears to see the camera as the Nikon P6000 but looks to be making the corrections OK. My earlier information was incorrect. Life just got a whole lot better for NRW shooters, which is the only way to go for serious picture takers. JPG's are fine for snapshots.New Update June 14, 2013: Adobe just added the P330 to their ACR lens corrections a few days ago (around 6/7/2013). I took the camera to Thailand and used it daily where it replaced DLSR's and tripod some days unless I was planning something serious. I set the ISO to Auto, something I would not do for serious photography but liked the results better than flash, which is unpredictable for quick pickup and shoot pics. I know many would disagree and that's OK but as a pro I find I have to take several shots before the flash lights the subject just right, unless you get lucky. I have a very high regard for this little dude.  Of couse it's not perfect - what is?. It may not be your personal first choice but with its W/A lens (24mm on 35mm camera) and slips into pocket unnoticed, I'm just glad I laid my money down.", "Date": "April 2, 2013"}, {"Title": "Smallest, tinkerers camera ever.", "Author": "The Noise", "ReviewID": "RPS66ELZNDEV7", "Overall": "4.0", "Content": "This is going to be a long review but before I start, I don't want to scare anyone.. this camera is not hard to use, anyone could use it.However, I want to emphasize how this camera could satisfy a most hard core photographer among us, even those who shoot in manual and RAW modes.This review is from a photography enthusiast. I am a hobbyist, not a pro, but I am serious about my hobby. I own cameras like the Nikon D600, D5100, Olympus m4/3 system and their excellent e-pm2. I've owned Canon DSLRs and SLRs, even their tiny ELPH 300, I've started with photography in early 90s, with a 35mm Nikon FM2 camera.Let's start with the reason why anyone serious about photography would buy this camera. The word is: size. If you're looking for image quality, value, control, feel.. DSLRs, m4/3 cameras have that. But what they all lack is the ability for you to put the camera in a pocket and always have it on you. But would it be possible to still retain some of the control \"big\" cameras offer even in a tiny pocketable point and shoot camera?I started my search for an advanced point and shoot few months back and everything led me to the Sony's excellent rx100. But something kept me from pulling the trigger and getting it. Maybe it was the $650 price tag. And it's not that I couldn't afford it, but I wanted something I wouldn't have to baby. If I dropped it, I wouldn't be too upset about it. Something in a small package that could give near enough decent pictures bigger cameras can produce and give me the control that I want.I have not considered many Canon options, just because I am not a fan of the Canon UIs. I have owned multiple Canons in my life and they were all fine cameras, it's just not my preference. So keep that in mind, there may be a Canon camera out there that may suit you better, I just haven't considered it for personal (and subjective) reasons.I have however considered cameras from the following manufacturers: Sony, Olympus, Panasonic, Fujifilm and Ricoh. After a lot of deliberation I came down to the following choices.- Sony:  rx100, pound for pound champ, point and shoot. Huge image quality from a tiny camera. Not without its issues. Sony UI is not the most intuitive to me. Battery life may be of a concern, however ~300 shots is plenty for me. It is slightly bigger than the Coolpix P330 and like I explained slightly more than I wanted to spend.- Panasonic:  Lumix LX-7. Great camera. This was the closest contender. I handled one actually from a friend who owns one. Camera feels solid, I thought it felt better than Coolpix P330. It is bigger as well though. This was the main concern, as well as the issue of a lens cap. Although the latter has a solution in form of a foldable lens cap that can be obtained for ~$10. Fantastic Leica lens as well. There was even a recent sale of this camera at $300. Similar sensor size as the P330 and without any scientific tests I am assuming should be capable of similar if not better picture quality properties as the P330.Since size was the main criteria for the pick, here is the reference comparaison tool that I used to drive my decision: [...]I have received the camera few days ago and have put it trough its paces. I mostly shoot in manual mode on my DSLRs but I do like Aperture Priority as well on my smaller cameras. I exclusively shoot RAW, as I enjoy post processing and the flexibility RAW files provide in post. I would have been happy with just the ability to disable noise reduction but having RAW is so much better. On the topic of Noise Reduction. I am not a fan of it, I don't like how it tends to turn images into mush. I would much rather have noise, and convert the image to black and white if the noise was an issue. I find it quite annoying that point and shoot cameras or smart phone cameras don't have a way to disable noise reduction.Pros:  - Size. This camera is not only tiny and easily fits in my pockets, it is also very light. (I've uploaded an image of the camera next to my D600 for size comparaison)  - Relatively fast lens (good low light performance). f/1.8 at the wide end, similar to the rx100 in aperture.  - RAW support. It is so nice having this. This means you can rescue badly exposed images and manage the tonal quality not possible with jpegs.  - Manual Exposure: ISO, shutter speed, aperture size are all easy to adjust. If you want to get creative and do some light painting you can. The camera even has a Neutral Density filter option. Haven't had a chance to test it yet.  - 1/1.7\" sensor and low megapixel count. Bigger than the 1/2.3\" sensor size which ships in most point and shoot cameras, combined with lower than average megapixel count. Means, photo cells on the sensor can gather more light, resulting in better low light performance (less noise). I am getting relatively low levels of noise at ISO 800, and ISO 1600 is better than expected. I commend Nikon for electing to go with a low megapixel sensor despite the trend of \"more megapixel the better\" marketing nonsense!  - The screen is nice and bright.  - If you're a Nikon shooter, you'll feel right at home with the settings menus.  - Flash. Nikon has long been known for great Flash implementations. I feel the Flash provided is great. And I have achieved great results with it.All this combines and creates a sum of a very capable advanced point and shoot camera. The image quality I am getting has exceeded my expectation. The pros I have listed far outweigh the cons I am going to list. Most of the cons are not serious flaws, and should be considered there because of the tradeoff of creating such a small camera with these capabilities.Cons:  - Sluggish AF. There is a 4 second delay after you take a photo in RAW mode. During that time you can't shoot an image, but you can't even get a focus lock either. This is the most annoying of the flaws. Since there is no buffer, this means that if you miss the shot, you're done.  - UI can appear sluggish at times as well.  - The big unmarked dial to the right. I feel it's somewhat underutilized, it often doesn't do anything depending on which mode you're operating in. Yet it's a nice dial, with a decent tactile feel. I think it's a bit of a missed opportunity here as it could have been programmable. Since I only shoot in AP mode, I don't get to use either top dials much, and I like dials. I would much rather use it, than the dial on the back around the OK button.  - On/Off button, probably the biggest flaw, and it's maybe just an issue with my copy of the camera. But there is a tactile disconnect between the click sound you get when you click it and the camera actually getting the signal to turn off or on. After you push the button you have to push even more for it to register your command. Since it's a pocket camera, I'd rather have it be little harder to turn on by accident though. The lens extending in your pocket could be awkward, so it's not that big of a deal I guess.  - FN button operation was unintuitive to me. I am used to designating its function in the menu and then just using that function with it. But FN actually lets you pick a different option which I feel takes away from the usability of the function. Can't complain much though, I am glad to have this option at all on a point and shoot.  - Lack of a stand alone battery charger. I think a camera in this category should have this. Even my ELPH 300 had this, and it's a category below the P330.  - Build quality feels ok. But just ok. People complain about the battery/sd card door, but I don't have an issue with this. The battery door is spring loaded and metal. Not sure what the issue is. I appreciate how light the camera is.  - Another missed opportunity I think is with the flash. I think it could have been bouncable. Like the rx100 has a small flash which can be tilted upwards to bounce the light off the ceiling, or a side in portrait holding position. This is nitpicking though. A business card does the trick.In conclusion: Anyone looking for an advanced point and shoot camera cannot go wrong with the Nikon Coolpix P330 in my opinion. The camera punches above its weight in the current market.edit: couldn't link to the actual camera size comparaisons since Amazon doesn't allow it. Google camerasize website if you want to compare for yourself.edit: It looks like the free software that ships with the camera Nikon NX2 automatically corrects lens distortion when developing RAW files. I have removed the following item from the list of Cons to reflect this, but will keep it in the review in case anyone runs into this:\"  - Lens distortion. This is not really a con, since you can't really expect corrective lens elements in such a small zoom lens. When shooting jpeg, this is corrected by the camera. But when you shoot RAW you get the actual data sensor sees. And from this you can tell the vignetting and the lens distortion is quite pronounced. This is easily correctable in post processing software like Aperture or Lightroom. Currently Lightroom doesn't have a profile for the lens, but manual correction works ok for the time being. It's something to keep in mind for all of us RAW shooters. And hopefully Adobe will add the lens correction profile for this camera in the future.\"EDIT UPDATE 2:After taking the camera out for shooting over the weekend. I have realized it is not the most responsive of cameras. In fact Auto Focus can be quite stubborn about not locking focus and I have missed quite a few shots due to shutter lag and general sluggishness. I feel as an advanced compact the camera should be more responsive, because what good are all the features if you miss the shots? I am going to knock a star of my review for this reason.", "Date": "April 12, 2013"}, {"Title": "Excellent pocket camera - Impressive speed, level of control, and build quality", "Author": "P. Ramsey", "ReviewID": "R1YYNZRSNU24CY", "Overall": "5.0", "Content": "April 9, 2013 - I will update this review as I continue to use this camera. Here are my initial reactions.I debated the Canon S110 and Nikon P7700 but ultimately decided to choose the P330 due to its size and positive leaning initial reviews/previews. This camera is constructed well. Some don't like the finish or material feel, but I'd like to push back and say that the whole body of the camera is well designed and feels quite solidly built. My only gripe is the battery door, but I'm willing to bet that Nikon ensured that it would survive most situations thrown at it. I like that the camera is simply a box, it looks like a camera with no frills, no gimmicks. It functions like this as well.Nikon menus are familiar to me and they are well appreciated when it comes to basic electronic usage/knowledge. The logic is good, and it just plain works. The display is bright and can be seen under sunny conditions when used. The buttons and dials deliver a satisfying click-feedback. The rubber grips on the front/back provide a lot of comfort and confidence for one handed shooting. This camera is a lot smaller than what I expected, and that's a great thing because that's why I bought it!Auto-mode seems well acquainted for people and landscape shots in decent lighting. Go in close and try macro out, you'll need to help it by setting the auto-focus to close shooting. Immediately, the camera will become a macro master in this mode. The burst mode is fast and quite impressive. My overall impression of the speed is very good considering the size of the camera. I remember when point and shoots simply couldn't take decent pictures due to their shutter speed (or lack of). You can select a shutter speed that exceeds any allowance of light entrance, to me, that's impressive.The flash is very intense and quick, mostly good for those situations where there is no alternative light source and you're taking a picture of a medium range subject. I actually found that in most cases, it wasn't needed at all. The camera lens takes up a lot of work for lower light situations. This makes me appreciate the fact that the flash is opened by a mechanical switch, because it helps me decided whether or not its needed, instead of the camera making a bad decision for me.Video is impressive and the VR really improves any jellies that might come about. I'm impressed by the quality and autofocus. Really excellent stuff, Nikon.Overall, this camera is really great for someone who appreciates DSLR quality but doesn't want to haul all their gear with them all the time. Would highly recommend so far.", "Date": "April 9, 2013"}, {"Title": "Has issues.", "Author": "S. Salim", "ReviewID": "R13YGZ6KMHGEP", "Overall": "3.0", "Content": "I have been using ancient 2006 Canon A620 P&S; (back in the day A-series had PSAM modes and a decent 1/1.7\" sensor) and was ready for an upgrade: everything that was good before, plus higher sensitivity, image stabilization and compactness. I considered Canon S110 and Nikon P330. The latter had a slight edge in optical quality and lower noise, so I got Nikon. Unfortunately, I was quite disappointed, especially regarding \"what was good before\". I have tested the camera under a number of shooting conditions for ~1 week of active shooting. Problems in the order of importance:# I normally shoot in P mode, however, here it is useless. Why? Because it picks non-optimal shutter/aperture combination (or too high an ISO if left on auto ISO). It would go for 1 to 3 stops smaller aperture and would therefore need to up the exposure time and/or ISO. What good is a fast lens when camera doesn't use it?  Zoom invariably results in camera selecting F/7.1 although it can do wider. Also, an unrelated issue is that maximum zoom often produces underexposed images. The above applies to Auto mode as well.# Focus sometimes lies! I was making tripod portraits. Focusing square confirmed focus on subject. However, when I reviewed the picture the subject was not in focus, but background was. Several times in a row the same problem. I gave up.# What you see is NOT what you get. The display shows images that appear much warmer (under AWB setting) than any computer monitor, and with too much backlight. Looks impressive, but quite unrealistic.# Focusing sometimes fails completely when trying a quick shot.# Menu Settings. Menu not optimized for quick changes because it goes over more than one screen. Also, as many have pointed out, the menu takes a while to appear. 'Fn' button in the front is not convenient either.# No orientation sensor.Old Canon had none of the above issues.Things I liked (but which are probably not exclusive to P330):* Wide field of view compared to old P&S;* Good quality at ISO800* Excellent optical quality (slightly better than Canon S110), though not a quantum leap compared to Canon A620 and not quite like Nikon P7700* Good quality videoIn closing. This camera has great optical quality and is in principle capable of great shots, but one should be willing to spend more time and use manual settings. Otherwise, the results will be satisfying, but not optimal.(P.S. I am not loyal to any brand; used to own Nikon SLR)", "Date": "July 16, 2013"}, {"Title": "Great image and build quality, quirky handling", "Author": "Michael C. Jackson \"MysticMCJ\"", "ReviewID": "R3RO9SIC8G34DB", "Overall": "4.0", "Content": "The last Nikon P-series compact I owned was the P5100 - Which delivered excellent image quality, was built extremely well, but suffered at high ISOs and had a frustrating interface.I replaced it with the S90, which I loved, and then a Fuji XF1, which is great but flawed - much in the same way as this P330 is.  In reading over my XF1 review, this isn't too far removed - Many of my complaints are the same.The P330 is my first foray back into the Nikon compact world, as it seemed to be close to what I loved in the S90, and close what I have been looking for - A reasonably high quality sensor, great wide angle, some advanced controls, good in low light for the class, and most importantly, pocketable.The sensor and the lens deliver extremely well for the class.  I have no complaints there, you can get WONDERFUL output from this, exceeding the S90 and the XF1 - and even reasonable in low light.The build quality is also excellent - This seems as if it will be a very durable camera.  I have to say that adding the textured surface to the lens \"barrel\" was a nasty practical joke by Nikon - It exists only to trick you that it may do something.  However, this is a solidly built camera.My complaints are mostly the same ones I had with the P5100, in that the interface is sluggish and quirky.  It's \"typically Nikon\" in that it matches much of the Coolpix series, but still isn't as geared towards advanced users as it should be for where it is positioned.  It will remember where you were last, but it's not exactly quick to navigate.  The dials are arguably most effective within the menu system, as they allow for changing options without going into the submenu, but the responsiveness leaves much to be desired.Which brings me to the next point - The \"command dials\" are completely useless most of the time, and cannot be reprogrammed.  This is a massive oversight, in my opinion.  The entire reason I (and many others) loved the S90 was because in addition to providing good quality output for a compact at the time, it had EXTREMELY rapid handling - assigning white balance to one control and exposure compensation to another allowed for a level of handling never before seen in a pocketable camera.The functions on both are fixed - The command dial adjusts the program shift in P mode, and the shutter speed in M and S mode, and that's it.  The rear dial adjusts aperture in A mode, and is largely useless outside of that.  Again, they are more useful within menus.Why on earth would you provide \"advanced\" handling features and restrict them so greatly?  Even an \"easy ISO\" mode or SOMETHING would have been better than the \"nothing\" they do most of the time.  Don't kid yourself -- how often do you shoot in Aperture Priority mode on a camera like this?  Given that your DOF is EXTREMELY limited by the small sensor and the aperture/focal length combinations available, \"not much\" is my guess.  So the rear dial is mostly there to spin uselessly.The FN button is theoretically interesting, but is thwarted by slowness.  It was not immediately apparent how to remap it, which is done through the FN menu itself.  It improves things some, and it's probably the most useful of the \"advanced\" controls.The ability to use FN or some other button to go into a quick menu, like the My Menu function on the Nikon DSLRs, would have been incredible, and would have really brought quicker handling to the camera.In short, there is a certain degree of customization I've come to expect from an \"advanced\" compact camera.  The P330 falls short here, rather severely, and that compromises what could otherwise be an excellent camera for advanced users.I would have loved an external charger, the internal charging wasn't apparent to me on looking over the product.  Easily remedied by buying third party batteries and a charger.  I'm on the fence about this one...  In some ways, it simplifies what you have to carry.  However, it makes an extra battery about useless.  You basically have to treat it like a smartphone.  Which would be fine if it used the same size USB cable as anything else I had, but of COURSE it's different.  If the battery lasted longer, then this wouldn't be as much of an issue.Slow image-to-image shots if you aren't in a continuous mode, and it takes a long time to write to the card.  Might as well get some coffee if the buffer is full, you won't be doing anything for a while.It's not all bad news, though.  The built-in ND filter is very unusual for the class, and if you aren't screwing with settings, the handling is great and the shutter is responsive.  Still handles quite good, for a coolpix.  Does a wonderful job with exposure and auto white balance.  And again, impeccable image quality.I'm really torn on this.  I want to love it for the output and features, but the usability suffers.  If you don't care about the handling I care about, it's outstanding.  I suspect that I will like it over time, but I'm not in love with it just yet.  For my portability and quality needs, it's probably the best compromise at this time, but it's no S110 killer.Compared to Canon S90, which I owned prior: The S90 has better handling by far, whereas the P330 has better focus speed, low light capability, and higher quality output.  Improvements to the S series since would likely make the S110 a better choice.Compared to Fuji XF1, which I also own (although it's on permanent loan) - Ignoring price, it's a toss-up.  The XF1 handles a bit better and is very responsive, but is bigger.  The P330 is more pocketable, and seems more durable.  EXR sensor on XF1 is handy, P330 has better full-res output -- real world difference is negligible.  Lens is more useful on P330, and doesn't crawl into the higher aperture ranges as fast.  XF1 has more special effects, if that's your thing.  P330 has GPS, and is slightly quieter.  Both suck batteries down like you wouldn't believe.  RAW format more usable in P330, if that's your thing.  ND filter is nice in P330.  While very similar, I have to give the edge to the P330 for portability and features, even if they aren't as immediately accessible.", "Date": "June 5, 2013"}, {"Title": "Great Little Camera", "Author": "MrSteveP", "ReviewID": "R3D20U0GOYNCZH", "Overall": "5.0", "Content": "I purchased this camera over the Canon S110/120. The images produced by the P330 are great. The optics, larger sensor & f 1.8 lens all help. The camera is solid and has a nice heft to it. The assignable function button is a nice feature as well as a dedicated wheel on the top of the camera for adjusting settings. Priced under $280 this is an enthusiasts pocket camera that seems to fly under the radar. I have owned a Canon S95 and feel that at the current price of the S120 at over $400, cannot find it a better option than the P330 with very similar attributes. Aside from no touchscreen and lack of built in wi-fi (neither of which are important to me, although the P330 does have GPS) this Nikon is a powerful camera that deserves consideration and is a  bargain in its class at this price.", "Date": "November 12, 2013"}, {"Title": "Excellent", "Author": "Ed Straker", "ReviewID": "R17NBOXGUY56AX", "Overall": "5.0", "Content": "After my Sony RX100 went back for repairs (under warranty) for the second time, I bought this as a backup camera. For about half the price of the Sony it does an excellent job. Image quality is sharp. The litmus test is low light with no flash and it still excels. Both boot and focus times are very good. RAW capabilities exist but WiFi unfortunately is an option. I have always shot in Auto mode to date as well. Basically this is the same size as the Sony, half the price but definitely not half the image quality. Having both cameras now, I would not spend the extra cash for the RX100. If you're looking for a compact camera as your primary or DSLR backup in this price range - I recommend the Nikon.", "Date": "April 24, 2013"}, {"Title": "Fantastic Pocket Camera!", "Author": "Photo_Guy", "ReviewID": "RC2AXWOBIJV9W", "Overall": "5.0", "Content": "I've had quite a few higher end point and shoot cameras and this one is the best I've used so far.  I've owned the Canon S90, S95, and S110 flavors as well as the Nikon P300.  All the others took nice pictures but was always missing the \"wow\" of a DSLR (I know completely in a different category).  I will say the very first images from my P330 indeed had that wow factor... especially with very minor touch ups! The macro mode also really shines on this camera!  Is it perfect?  Not a chance! The on button has to be mashed firmly and sometimes takes a couple tries and the menus could be laid out better.  I'm using a SanDisk Extreme card so the files write pretty fast but still could be quicker in between shots. I do wish this had a touch screen like the S110 has as well as an external battery charger (the battery is removable and charger is available though).  That being said, the image quality is amazing for a point and shoot and definitely worth the minor issues for me. I've uploaded a few sample pictures if you care to check them out.", "Date": "June 8, 2013"}, {"Title": "Pleasantly surprised!", "Author": "MeDC", "ReviewID": "R3NGS69262ZA0Q", "Overall": "5.0", "Content": "I purchased this camera to replace a lemon from another big brand, and boy was I surprised. Let's start with the 24mm wide angle lens and the f/1.8 aperture. That makes for some pretty impressive low-light photos. Yes, the f-stop goes up pretty fast when you zoom, but it's great to have. The menu is laid out quite nicely. The Function Button on the front of the camera is a handy and welcome addition. Whether shooting in full auto mode, straight manual or somewhere in between, this camera has the latitude to help a novice shoot better and a pro capture the image exactly as it appears in your mind. Photo quality is great. I was happy to see this camera shoots in RAW mode, but be warned - there's a bit of a lag time as the 27mb photos are written to your disk. There are some awesome features like shooting 60 frames at one push of the button. It's not a tiny camera, but it's not a behemoth either. My major gripe is about the charger. It's a USB charger, and a long cord that hooks into the camera itself. Fine if you have only only battery, but a bit of an inconvenience when you have a couple of spares you want to charge. Otherwise, I couldn't be happier. This camera may be a wee bit pricey, but a great picture is worth more than a thousand words.", "Date": "May 11, 2013"}, {"Title": "Very Good- Needs tweaking to get full potential", "Author": "Lectrolink \"Lectrolink\"", "ReviewID": "R2XMBZULW6TKIC", "Overall": "4.0", "Content": "I have had this cam about 10 days, my gf bought it for me as a birthday gift. I wanted it for the larger than average sensor, 1.8 lens, pocketable size, RAW capability, macro capability, and decent price. Overall, I like the style and size of the camera (I have it in white), and it has an impressive array of settings and controls including GPS, wifi capability, and 1080P video. I will not address those bells and whistles in this review, only image quality.The P330 is capable of very good image quality, but to get the best out of it, it takes some tweaking. Shooting in jpeg, I compared the different quality settings. Even at 200% magnification, there really was not much visible difference between 12 MP and 8 MP settings. However, there was a more visible difference between Normal and Fine quality settings. I would say for casual photos that will be emailed or file shared with friends & family, or used for web publishing, stay with the 8MP Fine setting (file sizes average 3 MP). You will not be able to tell the difference from 12MP Fine, even at 100% image size. But if there is a chance the photo will ever be blown up and printed larger than 8 x 10\", definitely shoot full resolution.Shooting JPEG, even in good daylight at lowest ISO (80), you can still see JPEG artifacts at high magnification on the computer monitor. It is not terrible, but it does not look as good as a DSLR photo, but no one expects it to be as good, since the P330 has a much smaller sensor. I also recommend keeping the noise setting on LOW, to help preserve detail, especially in dimmer light. I have assigned the front Fn button to access ISO because it saves two extra button presses when accessing via the menu.I usually have ISO set to auto range between 80-400. While some noise is evident at ISO 400, it's not bad and can easily be dealt with in post processing. The colors of the JPEG images look pleasing overall, but there is some evidence of hue shifts. If true color is essential, shoot in RAW-that seems to be very accurate colorwise.I have set my User setting to be optimum for handheld low light conditions. My settings are: Aperture Mode @ 1.8 (incidentally, to keep the lens at 1.8 means no possibility of telephoto, since the 1.8 setting is only available at the widest 24mm focal length; you'll have to move in and out with your feet, not the zoom lever); ISO- auto range 80-400; Picture Control- Standard; Exposure Compensation- minus.3; noise-low; Active D-Lighting- OFF; Vibration Reduction- ON; Continuous Mode- BSS (Best Shot Selector). This last one has proved useful handheld in low light: keep the shutter pressed down and it will take a photo about every two seconds until you release and then automatically choose the sharpest version to save.But to get the highest photo quality from the P330, you should shoot in RAW. For RAW, I use Picture Control set to Natural and the sharpness turned down to 0 (better to adjust these things in post). The RAW images will have more accurate color, fewer digital artifacts and will accept sharpening and noise reduction better for an overall creamier, smoother yet sharper result. The NRW RAW files generated by the P330 are BIG- about 26MP each. For comparison, my Pentax DSLR DNG RAW files average only about 11 MP--that with a 16MP sensor! The other issue with RAW files from the P330 is that there is an enormous amount of lens distortion at the wide end of the tele range. What are supposed to be straight lines curve like rainbows. With JPEGs, the camera removes the distortion; with RAW, you must use software to remove it. I use both Adobe Lightroom 4 and Photoshop CS6. Lightroom 4.4 (which uses Adobe Camera RAW 7.4) does not have a lens profile for the P330, so you must use the manual controls to compensate for it. The current Camera RAW used in CS6 (8.2) does have the P330 lens profile, so it is one click and done.To sum up, to get photos that look close to a large sensor DSLR with the P330, you will need to shoot RAW and use post-process software that can correct the lens distortion. Unfortunately, the corners of the P330 photos will never be as sharp as what a good DSLR lens will give you. The P330 also has other operational issues such as slow image process times and slow focus, which other reviewers have commented on. Nevertheless, this cam offers a lot of flexibility and quality for the methodical shooter willing to dive deep into the menus to get the best from it. I will also add that the camera is extremely good for close ups and macro style shooting with very deep depth of field and extraordinary sharpness. When I am photographing things like jewelry, the P330 is preferable over my DSLR.", "Date": "September 19, 2013"}, {"Title": "Great little camera", "Author": "R. Garnett", "ReviewID": "R3FQIPDPX6BQ0R", "Overall": "5.0", "Content": "Better IQ than Canon S110 according to reviews. To me the colors seem more film-like and natural than the S canon's.  Exposure, white balance, right on the money.  Good dynamic range for a small camera.  What do want in a camera?  I need to print quality 11X15 prints now and then and I need a camera that fits in a shirt pocket. The Coolpix 3300 does this fine. Perhaps the manual could use clearer instructions.  One reviewer complained than in P,  the camera chose an aperture that was too small.  Well if it is too small shift  to a larger aperture using the control ring.  That's why they call it \"program shift.\"  I shoot raw and I use center focusing (normal). I'm not about to use track focusing on this type of camera. You need to be able to take your time, a few seconds at least.  It does not work well with sports, fidgety children, dogs and cats (unless they are old or asleep).This is my  first Nikon pocket camera and I'm quite happy with it.", "Date": "August 1, 2013"}, {"Title": "Will I use my DSLR again?", "Author": "Blossom", "ReviewID": "RG5OVMI9JKVBU", "Overall": "4.0", "Content": "After traveling with an expensive and heavy DSLR that I left in my room a bit too often, I decided that on my next trip I would bring a light camera that could ride along in my pocket.  There are a lot of options and reviews out there.... heaven knows what the best choice is.  That being said, I am very satisfied with this camera.  Image quality is excellent, particularly in low light situations.  Menus are a bit quirky, and the on-off switch sometimes seems to have a mind of its own.", "Date": "August 5, 2013"}, {"Title": "Auto-Focus not accurate; slow; IQ ok but not worth the premium", "Author": "ST", "ReviewID": "R3DVRU1MG2Q4BD", "Overall": "2.0", "Content": "I made my purchase after comparing reviews and specs with Canon and others in the same price range.I returned it due to AF problems--green AF indicator indicates focused subject but when reviewed on monitor the focus was usually the background. I tested it under different settings and scenes but same results or just plain inconsistent.Also, the camera is actually slow, shot-to-shot and when transitioning from camera to movie (or vice versa).  Wasn't really impressed.  At this price range some would expect WIFI built into the device, instead you have to buy a Nikon adapter (~$50) if you want that capability. This is not a big deal for some until you actually start to use a camera that has WIFI built-in--especially convenient when traveling and sharing on the fly.IQ is just okay; it's like any other point and shoot, really, unimpressive, and It's not worth the premium if you ask me. If I'm buying a P&S; I don't expect much in terms of IQ but i think the extra cost of this camera is for censor/IQ and so one would expect it to be better.  Others might have their opinions on this, and your experience may vary, but I'm convinced that if you want great IQ shots use a DSLR.  P&S; are for fast, fun shots and convenience when traveling.Honestly, I really wanted this camera to work. I like Nikon cameras; I have a Nikon DSLR and I love it.  My last point and shoot which i still have is a Canon SD630 and it's great, too.  So, believe you me, I was hesitant when I decided to buy the Samsung WB250f to replace the P330 but, for all the reasons above and half the price, I couldn't be happier, so far.", "Date": "September 24, 2013"}, {"Title": "Great little camera", "Author": "Bob Trabucco", "ReviewID": "R3TLXB0ZCAIMGE", "Overall": "5.0", "Content": "Great camera.  Does what a basic little point and shoot should.  Good size. Great picture quality.  Only downside is that it eats up batteries so order a couple extra", "Date": "June 7, 2013"}, {"Title": "Nice, compact - great pictures", "Author": "Paul G.", "ReviewID": "R1NIMGPUVCH53F", "Overall": "4.0", "Content": "I purchased this camera prior to a long trip to europe.  It was between this and the comparable canon.  I am not a huge camera enthusiast, so i can't give you or even understand the real fine details that others have posted.  From my perspective.* It had GPS, which i really wanted on our trip.  I will say that it was difficult to get it to lock on all the time* The lens was just a little faster than the canon, and i knew i would be inside buildings and churches in low light and wished to maximize the low light.  I was incredibly pleased at the quality of pictures in dark areas an no flash.* Again, because i was in low light areas, i wanted to take pictures in raw format so that i would have maximum flexibility to lighten and touch up pictures taken in almost dark, later.*And as importantly as anything i wanted to drop this camera in my pocket.*Lastly there has been complaints that it takes time to write the picture to the sim.  This is true, it lags a bit.  It didn't bother me or get in my way.  But that probably is because of my requirements.  If this is important to you - then you need to consider this.It met all my requirements.  The pictures were excellent.  I had no issues with using buttons rather than a touch screen - in fact that is my preference.  It is a solid, lightweight camera that takes what i consider high end quality pictures.The only issue i had, as mentioned, is that the GPS was spotty.  However, it worked for a majority of our pics and were well worth it.", "Date": "September 20, 2013"}, {"Title": "Wonderful sharp photos with sufficient manual controls. Great camera at this price!", "Author": "Orientalthorn", "ReviewID": "RGJ71BN0668EH", "Overall": "5.0", "Content": "I have tested this camera for a month now and I am very impressed by the picture quality. Takes fantastic macro photos. True, it is a little slow compared to many but I do not usually take action photography. I have tried several cameras before settling on the Nikon P330.I tried Canon S110, Panasonic Lumix LX7, Nikon P7700 and Canon G15. The G15 is awesome and the Panasonic LX7 is definitely one of the best, but because I was looking for something that is easily pocketable and takes good quality photos with GPS and WiFi option, I decide to stick with the Nikon P330.It is well built and encompassed all the things I was looking for in a camera. Not to mention it is an incredibly good looking piece of equipment! ;) I also purchased the WiFi adapter and it works perfectly with my iPhone and iPad.", "Date": "June 27, 2013"}, {"Title": "Just what I wanted - almost", "Author": "Keith in Dallas \"K\"", "ReviewID": "R2AJI4WSPBTH7G", "Overall": "4.0", "Content": "I was looking for a camera that I could take with me when I travel. My want list was: GPS tagging, HDR or exposure bracketing, panorama, RAW, and a ND filter, 1/1.7\" sensor, and most important - pocketable. I, of course, ruled out the G15, Olympus xz-1 and 2, and the Lumix LX-7 due to size. My other options were a travel zoom, such as the SZ30. Without sacrificing image quality and my want list, the only two cameras that met my requirements were the Nikon P330 and Canon S100. I didn't want to have to worry about the lens problem, so I crossed off the S100. That left me with on choice, the P330. I also wanted wifi, but the P330 is compatible with eye-fi cards and has an optional adapter. When it went on sale for $296, I didn't hesitate.Now, after using it for 3 weeks, here are my impressions:The good:- Great size - pocketable, but not too small that it becomes unusable.- Comfortable to hold- Very light weight making it more comfortable in a pocket.- Great features. Has it all. Wish the Panorama mode didn't limit you to 180 degrees or 360 degrees.- Very very good picture quality. Better than a P&S.; Obviously, not as good as a DSLR.- RAW files are very detailed. Can really get a lot from the RAW files if you want to spend time post processing- great for scenery/landscape- great for portraitsThe Bad:- Feels cheap and plastic. However, this is also good as it makes it light weight. You decide.- Slow UI. Navigating through the menus is slow, requiring multiple presses of the same button before a response.- Slow performance. Not the camera for action shots, or if you are in a hurry.- Slow focus in low light. Sometimes have to switch to manual as the AF won't work.- not great for moving objectsHonestly, that's about it for the bad. I do not have an issue with the on/off button, except that it is small. I will mainly use the camera for travel and geo tagging where it will always be with me. My Pentax K-30 takes outstanding images, but too big for travel. Most of my travel pictures are scenic areas of interest, which makes this camera perfect. Up to this point I have been using my iPhone 4S when I don't have my DSLR. The iPhone image quality is not even close to the P330 image quality. Yes, the slowness of the UI, and focus can be frustrating. But, if Nikon ever gets their head out of their arse, a firmware update can easily fix these issues. Overall, it fits my needs. It is not a speed demon. If I am going to take any kind of action shot, or have my DSLR available, I will choose it over the P330. But, to me, the excellent image quality of the P330 far exceeds the bothersome slowness of the camera. I can live with the slowness, but never poor image quality. Obviously, the new Sony RX100ii at $700 will blow the P330 out of the water. But, for a second always have it with you camera, that takes excellent pictures, for under $300, I find it hard to beat.", "Date": "October 9, 2013"}, {"Title": "Finally an Improved P300", "Author": "sailorboy414", "ReviewID": "R1XCP91F50TK8Q", "Overall": "5.0", "Content": "If you had a P300 you were probably very happy with it. P300 always took very good low light photos, but there was a lot of noise processing, making pictures somewhat soft. P330 with a larger sensor and options to regulate noise reduction help make photos even better. I was not near US so I couldn't buy the camera from Amazon,  I bought it in Hong Kong.... for about $20 more. I also considered Olympus XZ-10, as they had it available in Hong Kong. It is a nice camera, but I found some sample pics on  the internet that raised concerns about quality of daytime pics in bright light. So I chose to stay loyal to Nikon and I don't regret it. I haven't had too much time to test it fully, but so far I am impressed with speed of focus, excellent macro, great low light capability. Only thing I would trade is GPS for a function ring on the front. Build quality is fantastic. Overall, especially for the price and compactness, a great pocket camera.I did notice some comments regarding the power button. I have no fingernails to speak of, and I have zero problems turning the camera on. Yes, you have to give it a solid press... it is a mechanism to prevent the camera from turning on in you pocket by an accidental press (your finger will go on the power button when you pull it out of the pocket), possibly breaking the lens. There is a slight lag in the first set of menus, but once you get in the menu there is no lag, in any case that can be resolved by a firmware update. I think the quality is great. Camera turns on quickly, playback is instant. No issues. In the end, in this segment people are in it for the compactness & picture quality. I think this camera delivers great value for the price.I just found this link so I wanted to add it [...] It may help with the decision. I am glad I chose the P330.", "Date": "April 2, 2013"}, {"Title": "CLOSE TO DSLR QUALITY IN A SUB $300 COMPACT", "Author": "T. Irwin \"Tom Orange County CA\"", "ReviewID": "R1L23BPAV6LYNV", "Overall": "5.0", "Content": "If you are a DSLR shooter looking for a reasonably priced compact that takes great pictures, put the Coolpix P330 on your shopping list.  Images are significantly better than Nikon's Coolpix S8100, S8200, S9100, S9200 series and Canon's S95 series (have not used S110 or S120) Familiar buttons/functions for Nikon shooters including Fn, auto-ISO and S, A, M and P modes.  Delivers rich, well balanced, eye popping colors, very sharp images and exceptional skin tones.  Found best IQ for casual shooting is in P Mode, Auto-ISO 80-400 and Flash -0.3 EV.  ISO to 800 is excellent.  Suggest shoot in RAW and process in Lightroom.  Shot-to-shot recovery time is quite sensitive to SD card.  Using SanDisk Extreme 45 MB/sec took  about 2 seconds between shots while using their 30MB/second card took about 6 seconds.  Cons: no viewfinder and consumes battery quickly.  Pick up 2nd battery (I got two + car/house charger from Wasabi for $20).  Overall an excellent camera for DSLR shooters looking for a pocket-able camera that produces excellent, near DSLR images for under three hundred dollars.  Check ADORAMA Nikon refurbished currently seventy dollars less.", "Date": "January 10, 2014"}, {"Title": "Good camera", "Author": "Timothy David Lister", "ReviewID": "RH54NVNMPW0JV", "Overall": "5.0", "Content": "Just took this camera through ASIA and Europe with me. I don't know s*** about cameras and used a phone cam before this so take it with a grain of salt. Very happy with camera. Auto mode does the job and takes great pics. No blurry issues, fast response time, good enough build quality. Would recommend for average user.", "Date": "November 2, 2013"}, {"Title": "Digital Zoom wasn't working", "Author": "CT", "ReviewID": "R2RNUJCV77Y7A8", "Overall": "3.0", "Content": "I really waned to like this camera.  The specs seem to be just right, the white color is definitely attractive and the size is perfect.  A few years back I purchased a Fuji H20 and ignored the warnings that it is slow.  But really wasn't too bothered about it.  So, when I read the reviews about this camera I figured \"slow\" a couple of years later would be faster than what I was used to from my other camera.  Nope, if anything it felt slower still.  And in this camera it bothered me more as it's purpose was to have it handy at a moments notice.  So, instead of exchanging it for one with a functioning digital zoom, I simply returned it and spent twice as much instead on a Ricoh GR--but I am VERY happy now.", "Date": "October 5, 2013"}, {"Title": "Best compact, very fast lens, great Macro ability", "Author": "Al D", "ReviewID": "RHN5BGA3VPVIU", "Overall": "5.0", "Content": "This is an great compact camera for folks who want to use manual camera settings along with the automatic modes.  If you're looking for just a point and shoot then skip this and get a cheaper camera.The Macro setting allows close up shots as good as my Nikon DSLR with Macro lens.  The close up shots alone justify the cost of this compact camera.  The lens is very fast w/ F1.8 at 24mm for indoor shots without flash.  The dials and menus all work very well.  The images have better detail than any other compact camera I've used.  I now only use my DSLR for longer zoom, action shots, taking picture of the moon.  In other words the P330 now serves the majority of my photo tasks.  I'm very happy with this camera.", "Date": "September 16, 2013"}, {"Title": "typical Nikon", "Author": "Ken Dahl", "ReviewID": "R1DV7G55PKUKCC", "Overall": "5.0", "Content": "I did a lot of research, for originally Fuji was the leader in making pocket digital cameras, but Nikon has done it again!  The P330 is flat-out the best digital pocket camera on the market.  True, some others have much longer zooms, but ALL zoom lenses have to compromise resolution.  What Nikon does is supply a large backlit CMOS sensor, which means you can zoom the file later.  Further, the P330 is the only pocket digital camera that makes manual operation practical.  Sure, the auto features are superb, but every serious photographer has to resort to manual now and then.", "Date": "August 29, 2013"}, {"Title": "Great vacation option to DSLR", "Author": "Todd R Gregson", "ReviewID": "ROH36KB53F0V0", "Overall": "5.0", "Content": "I have a Nikon DSLR, but sometimes don't like lugging it on vacation.  The Nikon P330 did a great job on a recent family vacation of bridging the gap between a typical point and shoot and my DSLR.  The \"scenes\" modes were very helpful, and the pictures turned out great.  I really liked the way the panorama mode worked, and having the ability to record movies as well saved me from carrying around a heavy pack every day.  The build construction is very good, and I have not experienced any issues.  The claims of delay to write RAW photos were experienced, but I don't tend to shoot back to back photos and bought a fast memory card, so this was not a problem for me.Overall, this is an excellent camera for the $$.", "Date": "August 24, 2013"}, {"Title": "Good build quality.", "Author": "Richard Runser", "ReviewID": "R1O91ZJM2OSHQI", "Overall": "4.0", "Content": "Nikon is one camera you Expect to be well built.  For a very small camera it takes good photos.  I'm afraid I'm spoiled by full image SLR cameras, and in unfair comparison, the images on the Nikon were not of the same resolution and color quality.  It took a few days to adjust my thinking to accept that the small size is what I want, and willing to sacrifice image quality a little bit, for the several important benefits of this quite good camera.", "Date": "August 17, 2013"}, {"Title": "Impeccable Image Quality!! Extremely Compact!", "Author": "Bob GlickSmith \"Bob GlickSmith\"", "ReviewID": "R212IMWRP3POTD", "Overall": "5.0", "Content": "I am a professional photographer and educator—in the field for over 20 years, and in the classroom for the last 4. I have been looking for a \"compact\" point and shoot camera that processes a RAW image file. The P330 is that and more. Truly \"pocketable\" and the image quality from a fully processed RAW file is impeccable. I had looked at the P7100, 7000 and others. The size and weight of those units take them out of the \"pocket–point & shoot\" variety very quickly, and the large sensor CoolPix A is not cost effective. This camera P330) has all the functionality I need in the palm of my hands.  I love it. . . .  bgs.", "Date": "January 30, 2014"}, {"Title": "Great camera", "Author": "Starla D Reynolds", "ReviewID": "R16EDIR17BZESG", "Overall": "5.0", "Content": "Handles and feels awesome. Look and size are great for the quality and options. Takes beautiful photo's and super easy to use. I have always used a Canon Powershot, but the transition was seamless. Very happy with my purchase.", "Date": "January 7, 2014"}, {"Title": "So Far, So Good", "Author": "Dennis J. Price", "ReviewID": "R1JR89BRY5LTMQ", "Overall": "5.0", "Content": "So far I have been very happy with this camera. The fit and finish are typical Nikon quality. Higher quality Nikon's are never very cheap but for me always worth the money. I just don't want to have to buy another on in a year.I also have a Nikon D80 Digital SLR that kicks butt!! It's too big and bulky to carry around for every day use. The P330 fits the need perfectly.", "Date": "August 4, 2013"}, {"Title": "Great Consumer Buy", "Author": "Teach90", "ReviewID": "R83XPYY92O3TP", "Overall": "5.0", "Content": "After looking in the Consumer Reports for a new camera I came along this one. It was number one on the list.It was a good price so I bought it. It takes a little time to learn about the choices and setting up but then it's easy to use. I love my camera.", "Date": "September 2, 2013"}, {"Title": "Great small camera!", "Author": "Lois Deakyne", "ReviewID": "RGTEB9W2GTS90", "Overall": "5.0", "Content": "Many features such as panorama view in 180 and 360, pet shots, special low light settings, and easy  to use buttons.", "Date": "October 23, 2013"}, {"Title": "Perfect", "Author": "Christina Arnone", "ReviewID": "R2H1ES5FNAZXW9", "Overall": "5.0", "Content": "I love this camera..my favorite is the 1.8 aperture...I captured some awesome night pics in Bora Bora!! Great weight and size..just all around good point and shoot. Coolpix' are great!", "Date": "October 19, 2013"}, {"Title": "Great product", "Author": "Fernando Khoury Francisco Jr.", "ReviewID": "R2BWODV5206131", "Overall": "5.0", "Content": "I just loved the camera. It's the greater pocket camera I've ever seen.The battery doesnt last long. So, I suggest you to take another batery, besides the original.", "Date": "August 19, 2013"}, {"Title": "Consumer reports was right.", "Author": "roy gagnon", "ReviewID": "R1YODOTY6FWM49", "Overall": "5.0", "Content": "I love the camera. I haven't used the flash yet because it takes great pix without it. Almost in total darkness.", "Date": "August 10, 2013"}, {"Title": "Terrible camera", "Author": "C. Burns", "ReviewID": "R16JALIG2RA3XD", "Overall": "1.0", "Content": "I previously owned two Canon Powershot cameras, and I had absolutely zero problems with them over a 7 year period.  I recently purchased a Nikon D5100, so decided to stick with Nikon for my next point and shoot.  The P330 seemed to offer all the features I wanted, and the initial reviews seemed positive.  The camera took nice pictures, but the body of the camera felt cheap since it was plastic, compared to the metal bodies of the Powershot cameras.Several months ago I got a \"lens error\" with the P330, so I sent it in for a warranty repair.  I received the camera back just prior to the expiration of the warranty, and now the flash is not working.  I contacted Nikon about getting the camera repaired again, and now they are quoting me a $109.00 repair fee.  This is very bothersome, as this is how they sent the camera back to me.  Do they even bother to check whether the camera functions before they return it to the customer?  The camera has never been dropped or handled roughly, so two major camera problems in several weeks is unacceptable.I will never buy a Nikon point and shoot again...", "Date": "May 29, 2014"}, {"Title": "High sensitivity sensor and high quality pictures.", "Author": "Dmitri Toptygin", "ReviewID": "R1280Z5B934M54", "Overall": "5.0", "Content": "I have 41 years of experience in photography. Since 1977 I have been using only SLR cameras. Coolpix P330 is not an SLR camera; I bought it as a birthday present for my wife, who wanted to have a small camera that would easily fit in her purse. Obviously, and SLR camera would not fit in a purse. So after a careful choice I picked P330. My wife is quite happy with this camera, and so am I. In terms of sensor sensitivity and picture quality this camera can beat many SLR-s that were made seven to nine years ago. Also after about six months of use we found no serious problems. It is convenient and easy to use for a non-professional.", "Date": "May 27, 2014"}, {"Title": "Nice Camera", "Author": "Hollis", "ReviewID": "R36VUG3VYF1KJJ", "Overall": "5.0", "Content": "This is my first Nikon camera. I am very pleased. Very nice features and programs for a pocket camera. The software is very user friendly. The battery has enough power to last all day. On vacation recently I probably made 40-50 shots per day. It has a program for almost every lighting and action level that makes it really easy to just point and shoot. However you must accept that an auto focus has it's limitations in extreme situations. You must lightly press the shutter button on each shot and give it time to focus. in dim light you may need to do it 2-3 times until it focuses correctly.", "Date": "May 15, 2014"}, {"Title": "What a camera", "Author": "Neal S. Morris \"chiefgjt\"", "ReviewID": "R38OCUUAEBP27I", "Overall": "5.0", "Content": "Have only used the camera a short time but am really impressed with all the features and marvel at the detail of almost any type photo situation.  The low light feature is outstanding and will be very helpful in museums and other venues where flash is not allowed.  Overall I love this camera.", "Date": "May 12, 2014"}, {"Title": "Good for the price Good build Quality", "Author": "Waylone", "ReviewID": "R3MYYFWBYJ554Q", "Overall": "4.0", "Content": "I usually use Sony or Canon but I tried my first Nikon. I had a Canon G12 very nice but almost as large as my Sony Nex 6So I sold that and went for this. Build is good and Optional Wifi is a plus.Image seem very good. No it's not going to replace you Dslr or ever mirror less. But for under $300 this is a very good P&S;I was think about the Sony RX100 but could not justify that cost.I think you wont be disappointed with this unit given the cost", "Date": "May 6, 2014"}, {"Title": "Super quality camera!!!", "Author": "Al \"Al\"", "ReviewID": "R1UYK9VX5Q0VZD", "Overall": "5.0", "Content": "This is a great camera, but I had thought that the newer version, the P340, would be just as great, but with the addition of wifi.  As it turns out, at least in my opinion, this has a tad more clearer, sharper images than the P340, so that's why I kept this one.  I highly recommend it as the wifi is a minor sacrifice to give up for consistently crispier images.", "Date": "April 24, 2014"}, {"Title": "Good point n shot for the price.", "Author": "Michael K. \"Braveit1\"", "ReviewID": "R3JMT7B1YS9Y9Q", "Overall": "5.0", "Content": "I have several DSLR's.  A D600, D300s, and a D200.  I also have had a few point-n-shoot cameras for when I don't need the DSLR's.  My Nikon P500 was very noisy at any ISO level.  The Canon A620 was great until it broke but was old.  This P330 is much more advanced.  There are several new features including a much hight usable ISO range and the ability to shoot RAW+JPG format.  RAW may not be very inportant to the average point-n-shoot user but because I shoot RAW in my DSLRs it's always in my workflow.  LightRoom had no problems reading the RAW format.  There are also manual modes and a interval timer which is good for time laps.  The quickest setting for the interval is only 30 seconds (would have liked a 15 second option) but that is not that bad.  It can also be set to take up to 120 shots in a second (although at a lower resolution) which is good for trying to capture fast moving objects like a baloon popping or milk drops at just the right time.  There are two panaromic modes.  One is a stitch assist and the other is a continious sweap.  There is also a 3d Picture mode.  This is where you take a picture and then a second one using the first to line up features.  The firmware then creates a file you can view on a 3D TV or moniter.  I have been able to lift this camera on my DJI Phantom quadcopter but it is at the max weight of 20g with the stock props.", "Date": "April 22, 2014"}, {"Title": "Much liked.", "Author": "G. Facaros", "ReviewID": "RKPDY0UUWCZA8", "Overall": "5.0", "Content": "I like it a lot and will like it more when I learn to use all of its features.  Takes good pictures.", "Date": "April 21, 2014"}, {"Title": "Solid, Miniature, Feature Laden, Fast Premium Lens, SemiPro Camera for Travel or Backup", "Author": "Classical Recording Collector", "ReviewID": "R1C44A2Q6R0N1E", "Overall": "5.0", "Content": "I own a Nikon Coolpix 7700 and bought this camera for my wife to replace a not so impressive plastic bodied P&S; Canon that's being held together with tape.  I love this P330 so much I hate to part with it! It's not another cheap plastic camera, but rather a small, dense in-the-hand, metal bodied precision instrument.  It has a premium fast f1.8 (to f5.6) 5x optical zoom lens that protrudes only 1/4 inch when closed beyond the body; it is definitely pocketable.  The 12 MP CMOS sensor is the same as in the Coolpix 7700/7800 models.  The controls are well laid out and well marked.  The 3 inch screen is bright and sharp.  Everything exudes quality.I must confess to not having field tested it yet, although I've taken a few pictures around the house in the different modes.  Pictures are very sharp.  Menu selection allows display of the various parameters (shutter speed, aperture, flash status, histogram) but not ISO. Exposure compensation, however, can be changed +/- 3.0 stops in these auto modes to produce the saturation desired.  It works well in the auto, shutter and aperture priority modes, but, unfortunately the manual mode falls short, as it does in my Coolpix P7700.  Regardless of the aperture & shutter combination shown, the screen image brightness remains the same, and only when captured and displayed do you see what you've got; that's no help.Overall, however, I'm pleased with this purchase, especially at the price advertised on Amazon, which is $80+ lower than at the major photo store I frequent.  I would recommend this model to anyone who values big camera performance in a pocketable size.", "Date": "April 18, 2014"}, {"Title": "excellwnt Buy", "Author": "John Morodore", "ReviewID": "R2ZAPBKWDLGH57", "Overall": "5.0", "Content": "Excellent small camera. I now feel safe ro leave my big camera at hime and take this one and still get quality photos.", "Date": "April 13, 2014"}, {"Title": "Awesome Camera", "Author": "Stoker", "ReviewID": "R27FYO05CTZGS", "Overall": "5.0", "Content": "If you're wanting a really nice point and shoot camera that will take amazing photos even in low light all while fitting in your pocket, then this is the camera for you. I love it!", "Date": "March 19, 2014"}, {"Title": "Excellent camera", "Author": "Joonha Lee", "ReviewID": "R3VQBXWPZD2FBQ", "Overall": "5.0", "Content": "I give this camera 5 stars because it's compact, easy to carry and takes amazing pictures at night. Does everything I expect and more!", "Date": "March 14, 2014"}, {"Title": "Nikon P330", "Author": "John Q", "ReviewID": "R3J6ZTJLCX5BL2", "Overall": "5.0", "Content": "Wow what an amazing camera, it is a small P7700 (that I also have) it can go into your shirt or pants pocket, it is full of advanced features including RAW, HDR,", "Date": "March 10, 2014"}, {"Title": "Nice looking and works well", "Author": "Dennis Bean", "ReviewID": "R3BROUJ5005LGR", "Overall": "4.0", "Content": "This is a good camera for the money.  Has lots of features, but as an amateur, it is easy to work.", "Date": "March 10, 2014"}, {"Title": "love it", "Author": "Tim", "ReviewID": "R2P03VLC7JFOF7", "Overall": "5.0", "Content": "haven't really got to get into it as much as I will but so far I have been totally satisfied with the performance of this camera", "Date": "March 7, 2014"}, {"Title": "Great compact for on-the-go photog", "Author": "Levi", "ReviewID": "R1Z0HXD9270PDV", "Overall": "4.0", "Content": "I'll try to make this short and informative, and helpful to those in the market for a compact camera.I bought the p330 because of the name, the available features, and the price. At the time of this review, I paid a little bit over $250 here in Amazon. This is also considered as discontinued because the p340 is out already. Regarding the p340, I believe the only difference is the built-in wifi, more scene options, tenths of ounces lighter, etc... not that would be significantly different from the p330 that I care about.I chose Nikon because simply, I'm used to the Nikon UI. I had the D60 and the D90 and was pretty happy with the user-friendly menus ergonomics, and I've never had an issue so far.Now in regards to features/body, I really like the simplicity of the design. Being a minimalist, I like the matte black color uni-color of the body with no colorful accents. It also has a square-ish design rather than rounded, and no bulking portion aside from the lens. Not too much buttons but not too few. I've only used the camera for a day at the beach  and so far I've gotten acquainted with the menu and buttons. A few things that I've noticed so far:1) I wish I could assign the FN button to adjust exposure comp. The settings that I could assign the FN button for seems very limited.2) I wish I the lens would pop back in when I'm in play mode (pic review).3) I wish the on/off button isn't as close to the shutter button as I keep on pressing the shutter when I'm trying to turn the camera off.4) After I recorded a video and turned the camera off, when I wanted to turn it back on, it wouldn't. I had to take out the battery and put it back in to get the camera to turn off. This happened about two or three times. I bought the Nikon wireless adapter as well and had not have any issues so far. I've transferred a couple of images to an iphone and it worked. Setting up the connection is needs a little bit of work but once you're connected it's pretty easy to upload files.Now for the pic quality, I think they're great. For the price and for being a compact camera, I'm glad there's Manual mode to adjust shutter and aperture.These are all I have since I've only had the camera for one day. Hopefully I can add more into this review sometime in the future.", "Date": "March 1, 2014"}, {"Title": "quality of the pictures by this camera are so great", "Author": "Jenny Hwajin Lee", "ReviewID": "RNDWL6901OETK", "Overall": "5.0", "Content": "i have high-bride, mirrorless camera which is over 700bucks, but this camera, nikon one is almost as good as my fancy mirrorless camera..i just love it! light, easy to carry around and pictures are just great. satisfied.", "Date": "February 22, 2014"}, {"Title": "Loving this Nikon...", "Author": "Lorraine King", "ReviewID": "RPPFFIK3EE019", "Overall": "5.0", "Content": "Love this camera for quality picture taking and size. Very easy to use and takes professional photos. I like to take my camera everywhere and this is the perfect size. It's a great first camera to explore with before investing in a DSLR.", "Date": "February 7, 2014"}, {"Title": "Great Pocket Pro Camera... if you learn how to use it correctly.", "Author": "cinemaniak \"cinemaniak\"", "ReviewID": "R25IIEMHBF94PI", "Overall": "5.0", "Content": "Took this camera on a vacation to Sweden in the extremely cold month of January 2014. Didn't have time to \"learn\" the camera since I took it new, straight out of the box. Realized what the camera could and couldn't do in the first hours of shooting - it is a point and shoot after all.After the first day of \"testing\" I discovered: 1) The correct flash to subject distance for ultimate flash coverage. 2) The extreme value of the Hand Held 3-exposure Night Setting. 3) Focusing with telephoto - going past minimum focus distance. 4) Using the macro setting properly. 5) And if I was lazy, switching it to Auto Scene Mode.This camera took awesome night shots on our subarctic cruise in extreme weather. I also used the Sports mode extensively for higher shutter speeds and for rapid fire captures. The video feature, perfect.After 3000 captures, I say: \"What a fantastic camera.\" And: Nikon brand batteries are way cheaper than Canon (I took 3 batteries). Only thing I didn't like was the \"Raise the Flash\" warning that popped up every time I used the Auto Scene mode. By the way... the pics turned out extremely sharp and the colors awesome.", "Date": "February 3, 2014"}, {"Title": "Noise in Video Mode", "Author": "Brittany", "ReviewID": "R22I3ZO9A1A5GT", "Overall": "3.0", "Content": "I gave this camera three stars because it had a lot of features I liked and the few test shots that I took with it were pretty good; however there was one issue I just couldn't get past so I returned it. I purchased this camera to supplement my DSLR since I wanted something a little more portable and more importantly something that took short videos. The problem with this camera was that there is a small motor that is ALWAYS running and can be heard in any video taken. I tried turning everything possible off (I assumed it was the auto focus motor making the noise) but nothing I did got rid of the noise. I called NIKON and they said it shouldn't be making any noise so I exchanged it for another camera (same model), but that one did the exact same thing. I ended up returning it and purchasing a Canon G15 and I am really happy with that camera.", "Date": "January 2, 2014"}, {"Title": "Nikon coolpix P330", "Author": "Donald Garcia", "ReviewID": "R2ML7JFPGJS1MB", "Overall": "5.0", "Content": "I find it well made, easy to get nice sharp pics for my wife. It works well for her on auto, and good for me with plenty of features to keep me happy.  The Wasabi batteries and charger make life easy..Also got a 16gb San Disk.  Its all good.... Don", "Date": "January 1, 2014"}, {"Title": "very good camera but...", "Author": "Z@@K", "ReviewID": "R34YGR92BE8C12", "Overall": "4.0", "Content": "I'm not an expert but I was looking for a camera with a good picture quality and GPS built in.The pictures of Coolpix P330 are great especially with night shots , I would like to give it 5 stars but the only thing that bothered me is the GPS signal receiver , it takes too long time to find the signal outdoor and impossible to find it indoor. I tried to update the GPS file inside the camera nut nothing changed.", "Date": "December 25, 2013"}, {"Title": "We tried several different brands and models, this one won!", "Author": "Clark Kent \"Snowman\"", "ReviewID": "RVEZCPAVJTDY0", "Overall": "5.0", "Content": "My wife loves to have a compact camera in her purse for instant use.  Over the past couple of months we have been looking for a quality replacement compact cam. We even tried different brands.  The P330 is great in many ways.  The video is outstanding. Unlike her older pocket cam, the P330 locks onto focus and holds it as the scene changes.  Still picture quality is very good.  Much better than her older compact.  We both are amazed at the menu system and the wide number of options it offers, especially for a compact cam.Now that there has been a price reduction, this is a great buy for a pocket size compact.", "Date": "December 4, 2013"}, {"Title": "Exceptional lens and sensor, Barely adequate UI", "Author": "C. Martin", "ReviewID": "R2V7YGBC4FI3VI", "Overall": "3.0", "Content": "I've owned a couple of DSLRs and a bunch of pro-sumer/enthusiast compacts over the past decade. Not looking for professional results from this camera, just decently usable JPGs in all light conditions. I've used this camera for several months including 2 months of traveling. I'm about to carry it on a 2,650 mile thru-hike of the Pacific Crest Trail.First, the good.- The combination of exceptionally bright lens for a compact camera (f/1.8 at the wide end), and a larger sensor than usual, means that this camera has significantly more signal and less noise to work with in low-light situations than its peers. With practice and skill, you will get gorgeous handheld low-light photos out of this camera. ISO 400 looks great. ISO 800 is usable, but you lose some sharpness with Nikon's default noise reduction processing, which is pretty aggressive.- Also, the really wide 24mm equivalent is great, especially for landscapes and indoor shots. You can stand in a corner of a room and capture most of what's going on.- I chose this instead of the Canon S100/S110 because the lens gets brighter/wider and you can expose for longer: 60 seconds rather than 15.Now, the bad.- The UI is usable, but barely. A few things that should be quickly accessible are buried in the main menu. You can assign the function button to control the ISO setting, but then you need to dig into the menu to change white balance. Nikon's interface feels much clunkier than Canon's, for example. In manual mode, the top dial (which controls shutter speed) is stiff and doesn't turn very smoothly. Not a big deal for me: I usually shoot in aperture priority mode, using the better rear dial.- There are some glitches, too. Sometimes, the camera doesn't turn on, and you need to remove and re-insert the battery. This happens to me every couple of days on a hiking trip. Only takes a few seconds to fix, but sometimes you miss the shot.- You can only charge with the included USB cable using the included AC adapter, not from another source of USB power. Lame!On balance, if you are patient enough to deal with the barely functional UI, you will be rewarded with exceptionally good low-light performance and image quality for a compact camera.", "Date": "March 23, 2014"}, {"Title": "VERY GOOD CAMERA", "Author": "DFESS", "ReviewID": "R2VP8X0XKJ2XGF", "Overall": "4.0", "Content": "I BOUGHT THIS CAMERA BASED ON CONSUMER REPORTS REVIEW. IT HAS MET MOST OF THE REQUIERMENTS . ITS PICTURE QUALITY IS BETTER THAN THE CANNON 110 HS THAT IT IS REPLACING. I HAD TO GLUE A RISER ON THE ON/OFF BUTTON SINCE IT WAS TOO SMALL FOR MY THUMB", "Date": "January 8, 2014"}, {"Title": "Nikon P330 vs Canon S-95", "Author": "Richard A. Reynolds \"Richardar\"", "ReviewID": "R3I9FRBRON6ESL", "Overall": "4.0", "Content": "Great service from Amazon. Ordered camera and 2 days later it arrived. Tested it immediately and there was a software problemwith the date. E-mailed Amazon for instructions on return. Within an hour had the forms and returned the camera later Monday.In the e-mail they stated the new camera was on its way. On Thursday I received the second camera that appears to workas expected.That is great service.Performed a test between the new Nikon P330 and my Canon S-95 that has served me well with good results. Magnified the results ofeach camera 100X side by side on Adobe software. It appeared that the results rested strongly on the side of the P330. Only 4comparisons but the Nikon impressed me. Nikon was sharper while the Canon was a bit soft. I purchased the Nikon because of thenewer sensor,the small size of the camera and good reviews. It was compared favorably with the Nikon P770.There is one really bad feature about the camera if you happen to be left handed. Connecting he strap takes a piece of theadand a nettle to pull it through. For right handers it is quite simple. As for size, the P330 is not much larger than the Canonand can easily be carried in a pocket when necessary.", "Date": "June 27, 2013"}, {"Title": "Still checking it out", "Author": "ex-enguneer", "ReviewID": "R721N47K98QHM", "Overall": "4.0", "Content": "So far so good. Going to use it for digiscoping. Still setting it up with a mechanical shutter release. One star off for not having a remote shutter release, but, knew that going in, so maybe it should only be a 1/2 star off. Takes good pics through the scope when there is no movement associated with the taking of the picture. Will start to get the \"Dawn\" test in another week or so when the weather gets a bit better around here.", "Date": "March 16, 2014"}, {"Title": "This is my first Nikon. I like it except for...", "Author": "Pat", "ReviewID": "RZ95MUZSEY1BA", "Overall": "3.0", "Content": "Pros:-It takes a clearer photo and has much less background noise for portrait type stills than the Panasonic Lumix point & shoot cameras I'd been using.-The flash is a quick flip, rather than a setting. It's convenient and visually obvious.-It has a rubberized finger rest on the front.-It's fairly easy to use.Cons:-It has a noisy \"click\" when shooting. I don't think there is a \"shut off\" for the sound.-It's slow to open up.-The battery charger isn't able to charge (my extra battery) outside the camera, while I am using the camera.-The charger is compact and actually fits in a small camera case, but the cord does't fit.-The lens cover doesn't open occasionally and I have to help it open.-It's boxy and does't feel anywhere near as nice as a small Panasonic Lumix.", "Date": "January 24, 2014"}, {"Title": "Cool little camera", "Author": "Cameron", "ReviewID": "R28C7NEXI5NUHE", "Overall": "5.0", "Content": "Great for a higher end point and shoot. GPS feature is a nice touch. Recommend getting the wifi adaptor for transferring photos.", "Date": "July 19, 2013"}, {"Title": "No thanks", "Author": "M. moore \"M. moore\"", "ReviewID": "R2ST2PCKP6RVD", "Overall": "3.0", "Content": "If you are coming from a P310, keep it. The build quality, UI speed and capabilities are much better, and I can't emphasize that enough. As soon as held the P330 I instantly could tell the body was a different material, the shutter and aperture dials where cheaper and when you read reviews about how you have to use your nail to get the power button to work, it's a design flaw. The P310 power button is identical and it works every time. I've seen it on every P330 I've used and you will be more than annoyed when you try 5 times to get it to turn on.If the P330 is your first advanced Nikon PAS you will probably be impressed with image quality and all its capabilities.The P330 menu system is terribly laggy and non responsive and it feels like it isn't recognizing your clicks as you go through settings so you end up tapping twice to move once up it down. The P310 is not like this and if you're coming from a P310 you will be terribly annoyed.Is the P330 a great PAS? Yes. Is it worth $376? Not when you can find the P310 for $200, noise and image quality was only slightly better, not enough to justify buying a P330 for $376 when the P310 is $200.Will you be annoyed with just about everything with the P330 if you are coming from a P310? Absolutely in every single way. Don't believe me? Buy one and find out for yourself, just don't sell your P310 right away.", "Date": "March 29, 2013"}, {"Title": "Proprietary charging cable", "Author": "Claus", "ReviewID": "R29DI518AY5I85", "Overall": "2.0", "Content": "The little fact that a special charging cable is needed to recharge the battery has become a major annoyance over time.  It uses a generic USB charger but the cable doesn't have a micro-USB plug but a plug that looks nearly identical but is incompatible.  This means you'll need to carry a dedicated cable just to charge the camera.  Had I known how annoying this got I would have picked the Canon over the Nikon.Otherwise the camera is a fine P&S; camera.  I ended up never using the GPS feature mainly because it would just drain the batteries unnecessarily.", "Date": "April 22, 2014"}, {"Title": "five out of five stars", "Author": "Bernard Geiger", "ReviewID": "R1XVSPT8M574ZT", "Overall": "5.0", "Content": "fantastic product. highly recommended! professional photographer are using the nicon P330. have seen photos made with NICON P330 before purchase.", "Date": "October 10, 2013"}, {"Title": "Good camera, but not excellent colors", "Author": "Jerry C. Finlinson", "ReviewID": "R1FA00887ZZSHB", "Overall": "4.0", "Content": "I have used this a bit this winter and spring, but don't like the colors in the photos as well as the Canon S110 that I had been using, so I use that most of the time.", "Date": "May 17, 2014"}, {"Title": "nice camera but a bit heavy", "Author": "Nancy Piedlow", "ReviewID": "R3U8F3PN0MJIST", "Overall": "4.0", "Content": "It is a good camera but a bit heavy. I like to carry my camera in my purse.  Takes good pictures.", "Date": "December 10, 2013"}, {"Title": "not worth the trouble nor the price", "Author": "Edwin Caban", "ReviewID": "R1Z5LQSDJEU2OK", "Overall": "1.0", "Content": "after just 4 months flash doesnt work and know its left up to the recipian to send it back to nikon for repairs and charges unknown until they test it.", "Date": "February 26, 2014"}, {"Title": "Nikon COOLPIX P330", "Author": "W. Schroder \"kaseymoe\"", "ReviewID": "R3W0VTNF7GYUUI", "Overall": "4.0", "Content": "Great camera, great pictures, fairly easy wifi upload.  I am kinda rough on cameras and I dropped it off the sofa onto the extended lens which broke the lens off.  So now I have to see if I can get it repaired and maybe give it to my (grown) children.  In the meantime I have just bought a Panasonic Lumix \"Tough\" camera that is waterproof, shockproof, and (hopefully) me-proof!", "Date": "June 28, 2013"}, {"Title": "Underwhelmed", "Author": "Simon Fell \"coffee jockey\"", "ReviewID": "R16GQN968W5LF1", "Overall": "2.0", "Content": "I was expecting great things from this camera, but I've been underwhelmed so far, the auto focus is so slow, I haven't been able to get anything close to a usable shot from anything thats moving. The USB & AV ports are very similar in size/shape and right next to each other, its easy to try and plug the cable into the wrong socket. The supplied charger connects to the USB port on the camera, rather than being a separate battery charger, so if you want to charge a battery and use the camera at the same time you'll need to buy an additional charger. The new RAW format it generates seems to be not very well supported (currently not supported by Apple's Aperture product for example). I wish i'd gotten the Fuji or Sony instead.", "Date": "July 28, 2013"}, {"Title": "Focus lacks in low-light (returned)", "Author": "Rachael Myers", "ReviewID": "R2JRNLZ699T0AF", "Overall": "1.0", "Content": "Granted, I've only had it for an hour - but I have been trying it out on various subjects that are still and moving, in both well lit and poorly lit rooms. I'm disappointed to say that it doesn't focus very well when available light is low. I'm a pro photographer looking for a decent quality point & shoot for when I don't want to lug my big camera around. I feel like I'm probably going to send this back but I'll take another day to play. Disappointed.UPDATEI returned the camera. The focus was ridiculously horrible and unacceptable. Focused on exactly what I didn't want it to.", "Date": "March 28, 2014"}, {"Title": "not impressed.", "Author": "Brian Morella", "ReviewID": "R137S7D0EBT8LF", "Overall": "1.0", "Content": "returned this camera, was not fast at all and the pictures were still a little fuzzy.  I would not recommend this camera.", "Date": "January 22, 2014"}, {"Title": "It is defective, how do I return it", "Author": "joe atkinson", "ReviewID": "R379WUBSXFD0F4", "Overall": "1.0", "Content": "The inside of the lens gets condensation inside on damp days.  The pictures have a round white area. We would like to exchange the camera immediately.  The camera is good but this one is defective.", "Date": "September 5, 2013"}, {"Title": "I would've chosen NO STARS if I have the option", "Author": "Dimashqi2020", "ReviewID": "R3QHE8KEZ1GMK", "Overall": "1.0", "Content": "I can't categorize myself as professional photographer,but I know a thing or two about composition, focus, and aperture control.  I am an avid enthusiast.  The Nikon Coolpix P330 failed me on all categories.  I bought it in the morning, just to be returned the same night.I've owned similar cams before like the Canon S95, and most recently the Sony HX30V (and I thought that was bad), the Sony was an \"angel in comparison\".  Now that I am done with my ranting, I will be objective.1- I could not get ONE single shot of my toddler with out the blur.  The AF is slowwww with an emphasis on the sssss.  The shutter speed is inadequate.  And the images, to my surprise, do not compare to anything acceptable.2- In a household condition, normal house light:  if using a flash, it would be over exposed with dark backgrounds, if no flash, then the picture is grainy or dark.  I thought this device had a 1.24 sensor, but it seems not to par with other similar cameras and brand.3- Nikon itself does not recommend continuous AF during movie shooting, the reason being:  YOU CAN HEAR THE MECHANICS IN THE VIDEO.4- I can hear the camera zoom.  As if the gears are of an industrial nature (exaggerating), rather than being quite like a consumer product.5- Too intense of a flash, which is not helpful in most family pictures.6- Shot-to-shot is very slow, you can almost nap between them.  The only way to get around that if you get a 95bps Extreme Pro SD card.  (which is very pricey)7- The cable for power charging and AV are Nikon proprietary.  You would think you can use a common ISB cable for connecting to the charger, but NO.8- Nikon menu is bleak in comparison with Canon and Sony.9- You have to download the pdf user manual.10- I'll go back to my first pet peeve:  One clear picture of my toddler, for every 5 shots taken !!Notes:(I ended up with Canon G15, and could not be happier)(I considered Canon SX280, Nikon coolpix S9500, Canon S110, Canon G1x, Nikon J3/S1/V2/J1)(The Sony DSC-HX30V was a nice camera, but the images where always dark, reddish, or over saturated)Final thoughtDid I mention that the P330 was slowwwww?  (Shutter, AF, Recording, etc.)", "Date": "June 19, 2013"}, {"Title": "Beware, no memory card in package.  What good is a camera without a memory card?  Nikon cutting expenses?", "Author": "Novice Norm \"N280\"", "ReviewID": "R39BXHH20VZTP4", "Overall": "4.0", "Content": "Have a memory card handy.  Did not include one with purchase. So far, no other problems. ReceivedSatisfied with purchase.", "Date": "September 14, 2013"}, {"Title": "a malfunctioning and poorly designed camera", "Author": "dr. b. bicking", "ReviewID": "R1BYSSFP3FMM1G", "Overall": "1.0", "Content": "The battery is constantly malfunctioning making the camera unusable. I was on a once-in-a-lifetime trip in Malaysia in August and this happened constantly. The on/off button is also malfinctioning, besides that is very poorly designed. What good are all kinds of features when their usability is way below par!?", "Date": "November 20, 2013"}, {"Title": "Piece of JUNK", "Author": "Diana", "ReviewID": "R2TTL6RD26UC6I", "Overall": "1.0", "Content": "I used this camera for the first time at a Holiday luncheon and took pictures of my work associates and the some of the pictures were really out of focus. But that's not the worst part! When I got home and went to look a the pictures, they were gone! The camera erased them all by itself! I had a memory card in there so that's not the reason. This is unacceptable for a camera! I'm returning the camera and buying a Sony or Canon. Now all my important Holiday pictures that I took are gone! I have to tell my supervisor this when I go back to work. This doesn't look well for me as a program coordinator. Very angry and very unhappy with this camera.", "Date": "December 21, 2013"}], "ProductInfo": {"Price": "$299.95", "Features": "1/1.7 image sensor\nF/1.8 lens\nWi-Fi capable with WU-1a adapter (not included)\n1080p HD video with stereo sound\nRAW (NRW) capability", "Name": "Nikon COOLPIX P330 12.2 MP Digital Camera with 5x Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41UdlFi3VqL._SX300_.jpg", "ProductID": "B00BOZCSQE"}}