{"Reviews": [{"Title": "Great camera", "Author": "howard c. himelstein", "ReviewID": "RBHYQEXFOO37V", "Overall": "4.0", "Content": "This point and shoot camera has many features and requires effort to master them.  There is no printed instructional manual, butthe cd is extensive.  Still learning how to use it.", "Date": "October 24, 2013"}, {"Title": "Great little camera", "Author": "Amazon Customer", "ReviewID": "R2Z8M7JU8WJ8WP", "Overall": "5.0", "Content": "Versatile little camera, I love it. We had a Slr and this is much more convenient and almost as good.", "Date": "June 13, 2013"}, {"Title": "This one is a winner", "Author": "Rob", "ReviewID": "R2K0ZMUMIMLK70", "Overall": "5.0", "Content": "I found this camera to be just as it read it to be. The 24x zoom is great and the photos nice and sharp on its 3.0 LDC  and there are all kinds of different settings that will come in handy. I'm sure I will enjoy taking lots of photos with this camera.", "Date": "January 9, 2014"}, {"Title": "Great little camera!", "Author": "Dee56", "ReviewID": "R1KZ1709MLIKXY", "Overall": "5.0", "Content": "The camera is user friendly and takes clear pictures. The zoom lense lets me take pictures of animals and other subjects that are off in the distance or close up of flowers etc. It is a small size, but not too small. It's great to carry around in my backpack, purse or coat pocket. The camera comes with everything ready to start taking pictures.I would definitely recommend this camera!", "Date": "October 14, 2013"}, {"Title": "Great Camera", "Author": "Lu", "ReviewID": "RCJZ00LUJYPKO", "Overall": "5.0", "Content": "Haven't had a great deal of time to play with the camera but every picture I've taken has been excellent.  Lots to learn but on auto it is still great.  Since purchased with extras was very surprised that a camera case was included and a large memory card, plus the camera comes with a battery to the kit contained an extra battery (and I ordered another battery not knowing this) so now have three batteries.  I am leaving for France in 5 days - the results of the photos on that trip - most taken from a moving bus will tell the true story of how satisfactory I feel the camera is compared to the Canon I have been using with MUCH less zoom.  If set to 8 mp will get pictures of just about the same quality as the 16mp and twice the number of photos on the memory card.", "Date": "August 30, 2013"}, {"Title": "nice camera", "Author": "edmond mullane", "ReviewID": "R1717YGPMGQI7P", "Overall": "4.0", "Content": "price was right with the addition of the extra battery & small tripod. Used the tripod and the timer to allow me to join in the pictures. Nice camera.", "Date": "November 8, 2013"}, {"Title": "Awesome camera", "Author": "Dixies Mommy", "ReviewID": "R1SMYSG9E49L1A", "Overall": "5.0", "Content": "This camera has alot of great features,, I'm still learning about them.I love how great the prints look.....It is very small and easy to carry in my pocket.", "Date": "October 9, 2013"}, {"Title": "So far so good", "Author": "Mike Donnell", "ReviewID": "R1JCD5RCPSR35V", "Overall": "5.0", "Content": "have only had the camera for a month and have not used all it's features. Bought it from reading other reviews and also for the zoom lens, works great. Bought the package mainly for the extra battery, thought I would throw the tripod away but it has become a must have whenever I take the camera with me, have used the camera and stand all over : the car , a boat  on a golf cart, great little item when you want to include yourself in shots.", "Date": "October 7, 2013"}, {"Title": "love my camera", "Author": "dixie fredrickson", "ReviewID": "R1C7JM7TSUU20F", "Overall": "5.0", "Content": "I took the time to learn all the other modes of the camera and took it to Europe and the pics are wonderful.  easy to use as well.", "Date": "October 3, 2013"}, {"Title": "great camera... BUT", "Author": "J. Fonte \"Piper Warrior II\"", "ReviewID": "R3P0XPOLTZMNMP", "Overall": "4.0", "Content": "lets be honest here: i love this camera.i really do. it's compact, fully state of the art, and feature laden.  full HD video. and it addresses my major complaints from a previous olympus point&shoot;, that being the delay between shutter button pressing & the actual picture being taken (a full second was too long), and the time it took to \"store\" the picture on the memory card and be ready for another picture.  This camera probably has a faster CPU chip to process the data quicker.  BUT:  i had to return this and am awaiting an exchange because the lens was not aligned properly, and the left side of every picture had the blurred plastic lens housing showing in it.  I could push the lens to the right with a bit of pressure to align it and clear up the picture, but it reverted back after pressure was removed.  So its a manufacturing error for it happening, and Poor quality control for not catching it.  If the 2nd one is the same I will have to look for another camera.  PS remember it does NOT come with a memory card. I bought the \"kit\" from an amazon vendor which included it.", "Date": "June 29, 2013"}, {"Title": "Great camera - great company", "Author": "Herbster", "ReviewID": "R1O5J3S4IY0Q7T", "Overall": "5.0", "Content": "What an outstanding camera.  I am a rank amateur when it comes to photography.  This camera makes me look like a pro.  Camera is easy to use and takes superb, razor sharp pictures under all conditions.  I have owned many different cameras in the past and was never happy with them.  After extensive research I decided on the SZ-16.  I am 100% pleased.  I also purchased the printed manual from Olympus so I have a handy reference when needed.  Olympus e-mails me tips on photography, etc. which I keep for reference.  I have had the camera some months now and look forward to continued photographic success.  The service/information from Olympus is top drawer.  I highly recommend this camera to all.", "Date": "May 16, 2014"}, {"Title": "What a great camera for the price", "Author": "Wadie", "ReviewID": "RVUXW19AZTLFX", "Overall": "5.0", "Content": "I did a ton of research. I read all the reviews here, on assorted camera sites, and on Consumer Reports. I wrote down specs and compared. My need was to get good pictures of my lovely grand-nieces and my dogs, in the sun and in the shade. I like to make photo books. I wanted to get shots that could be cropped and enlarged and still look good. I have an older Cannon Elph SD 600. It took nice pictures but it was only 6 megapixels. I was looking for a camera with good zoom, over 15 megapixels, a good flash, and capable of taking repeat pictures quickly. And be less than $200.00. That eliminated the Cannons. I really like their software so I wasn't happy about that. Finally my choices narrowed down to the Olympus and a Fuji. The Olympus got the nod because CR said the flash was bright and had excellent range. They were correct! I've been bouncing around taking pictures of everything for two days now. The pics are clear with great detail. Indoors and low light shots look great. My dogs are even more handsome in 16 megapixels!I saw a few comments about the Olympus being tough to use right out of the box. I had no trouble picking up most of the basic moves, and this is something I do okay at, but not at genius level. The software works great.The package deal included a case (ok), a tripod (ok), a cleaning kit (ok), an SD card (great) and an extra battery (great and a surprise)! It's always nice to get stuff with your new stuff.My only mildly not- happy surprise was that the battery charges inside the camera. Not a huge deal though. I just needed to find a stable place to plug it in so the camera didn't get knocked over.All in all I am quite happy!!", "Date": "April 5, 2014"}, {"Title": "More than I expected", "Author": "Garry", "ReviewID": "R1AIC3KXMEG09M", "Overall": "5.0", "Content": "The Memory and the battery that came in the bundle were better quality than I expected and I am happy with them.  The camera also proved to be better than I expected and I had high expectations based on my history with Olympus cameras.  Controls are pretty intuitive and I found that I could use many functions of the camera without going into the manual.  The reaction time of the camera is very good.  I took some pictures of opportunity that many other cameras would not have been fast enough to do.  I bought this camera to be the fill in between my cell phone camera and my DSLR.  My biggest concern right now is that my DSLR is not going to get as much use as it used to.  My wife found the magic settings on the camera and then I had a hard time getting it away from her.I did look at the other brands pretty closely before choosing this camera.  After all it is about 25% more than the other brands.  All I can say is that it is worth it.", "Date": "August 24, 2013"}, {"Title": "Very Good", "Author": "Robert B Carpenter", "ReviewID": "R102YEC85QCZG3", "Overall": "5.0", "Content": "I am a Novice and do not take many pictures, I do think this camera will do the job,, I look forward to my next trip", "Date": "June 22, 2013"}, {"Title": "What a great camera", "Author": "Kacy", "ReviewID": "R1WAXYNW755YYW", "Overall": "5.0", "Content": "This is the best camera I have ever owned. I have shot over 800 pictures & have yet to take it off of the auto mode- each shot is perfect & crystal clear. I do a lot of night shooting & these pictures are clear & clean with no adjustment.  I 'd reccommed this camera for anyone wanting a good solid grab & go.  I look forward to having this for years", "Date": "May 22, 2014"}, {"Title": "Great package", "Author": "Grejam", "ReviewID": "R2IXSFW4USTOT7", "Overall": "5.0", "Content": "Less than a week, but I Iove the package.1) Consumer Reports recommended the camera and rated it very good for image, flash, and camera start-up.  No problems so far.2) Camera is pretty easy to figure out how to use.  Use the installation CD for the manual which you can print for old timers like me.3) Good price.  This appears to be an older model, not available from many places.  But its what I wanted.Other point and shoot mega-zooms seemed to have mixed reviews, and cost more.", "Date": "May 6, 2014"}, {"Title": "An Excellent Bargain", "Author": "Skeeter", "ReviewID": "R373TT8KCDXEHO", "Overall": "5.0", "Content": "I purchased this camera due to having such a hard time getting the SD card for my old Coolpix. I couldn't be happier. I used to be a novice photographer and this one fits the bill. My only complaint would be that the tripod is extremely small but that doesn't have anything to do with the camera. The picture quality is excellent and it's extremely easy to use. And lets not forget about the 27X zoom. Super easy to zoom in and the picture quality is still great. I haven't even had to look at the instructions. It also comes with an extra lithium battery so you never have to worry about the batteries dying. Love, love love this camera along with all the extras. I believe this package is the way to go and only cost 10 dollars more for all of it. You will not be disappointed. I highly recommend this one.", "Date": "May 3, 2014"}, {"Title": "Close up.", "Author": "c. hedgecock", "ReviewID": "R28KJRZOUVS9QO", "Overall": "5.0", "Content": "If you like taking close up photo's this is the camera for you...  I LOVE, love, love it!  Pictures are crisp and more detailed than any other camera I've owed and unlike my last camera, a Canon (which used dozens of AA batteries a year) this Olympus comes with TWO rechargeable batteries. I am very happy with this camera.", "Date": "April 19, 2014"}, {"Title": "A great camera with a 30x powerful zoom lens.", "Author": "Steve B", "ReviewID": "RFGZABXXPN74B", "Overall": "5.0", "Content": "I looked at and read many reviews before deciding on this camera.  I was specifically looking for a camera that had a fairly powerful zoom lens to catch close ups of birds and other animals in my back yard and yet small enough to still carry in a pocket.The 30x zoom takes amazing close up photos.  I already took this camera on a seven day cruise in the Caribbean in February and it took very great photos.  I would definitely recommend it.", "Date": "March 13, 2014"}, {"Title": "Great Camera & accessories", "Author": "Tonyv", "ReviewID": "R2Z9UH8YJPKY7T", "Overall": "5.0", "Content": "Everything needed in one order:- Arrived early.- Easy to use.- Great, sharp pictures.- Recommended over the Fuji & Panasonic cameras with similar features this camera replaced.", "Date": "March 6, 2014"}, {"Title": "Intermittent problem", "Author": "Marina Shalmon", "ReviewID": "R3E7GORHUAB98E", "Overall": "2.0", "Content": "I can not rate this camera.I love the quality of the pictures and particularly the zoom. It it worked, I would give it 5 stars.However, from time to time it does not power up and does not charge. After fiddling with the battery, taking it out and putting it back in, or fiddling with the charger cable, it starts working again.Amazon graciously accepted to let me return it 2 months after delivery.I am reluctant now to order the same camera.", "Date": "June 2, 2014"}], "ProductInfo": {"Price": "$174.95", "Features": "Olympus Stylus SZ-16 iHS Digital Camera with 24x Optical Zoom and 3-Inch LCD (Silver)\n16GB Memory Card + Deluxe Carrying Case\nReplacement Lithium Battery\n3pc Lens Cleaning Kit + Flexible Mini Table-top Tripod", "Name": "Olympus Stylus SZ-16 iHS Digital Camera (Silver) Bundle with 16GB Memory Card, Replacement Lithium Battery, Deluxe Carrying Case, & More", "ImgURL": "http://ecx.images-amazon.com/images/I/51C03iz36-L._SY300_.jpg", "ProductID": "B00BOYQH44"}}