{"Reviews": [{"Title": "Good Kit!", "Author": "DesertRat71", "ReviewID": "R10B14YKG7H5AB", "Overall": "3.0", "Content": "This kit came from Cameta Camera in New York. I had occasion to contact them due to a shipping issue; the person who answered the phone spoke flawless English (a rarity in today's American Business \"Customer Service\") and couldn't have been nicer or more helpful in resolving the issue.The kit itself was very good and provided the accessories I needed to get up and running with this camera. The lens shipped is outstanding and versatile, a thousand dollar value on its own, and the D7100 is easily living up to all the positive reviews I've read about it. The kit lens is large enough, however, to cast a shadow on your image if you use the built-in flash.Which brings me to the one disappointment and the reason I'm giving the kit 4 stars instead of 5. The external flash that's included is too basic for the camera. It's a little like putting retreads on a Ferrari; they'll work but you can't drive the car anywhere near its potential. I bought the Nikon SB-700 separately and have put the kit flash in a drawer as a backup. Considering the price as-is, I wouldn't mind paying extra to have a full-featured flash included instead of paying for the one that currently ships with the kit.*** Update ***Having had occasion to use the tripod I've found that it's too flimsy for this kit. The camera/lens combination makes for substantial weight. Mounting it on the kit tripod made the setup top heavy to the point that I was concerned that a gust of wind might knock it over.The camera and lens are proving to be outstanding.In retrospect, buying the camera, lens, and then the accessories separately would have been a better value than this particular kit.", "Date": "August 8, 2013"}, {"Title": "Best Nikon Kit EVER!", "Author": "lisa bragg", "ReviewID": "R2FS8CT6ZJBUQ3", "Overall": "5.0", "Content": "I LOVE my new camera! The kit that came with it is fabulous! I would recommend this package to anyone. Excited to take my camera on vacation. Great deal!", "Date": "May 9, 2013"}, {"Title": "Nikon D7100", "Author": "Timothy Alan Wise", "ReviewID": "R24M4TJOQKQAJO", "Overall": "5.0", "Content": "It takes some time to learn the features.  But once you do, it's worth it.  I make a piece of fruit sitting on my kitchen counter look like it needs to go in a magazine!!!", "Date": "January 21, 2014"}, {"Title": "Nikon D7100", "Author": "Nancy Fuller", "ReviewID": "R1L39NVK25TRJT", "Overall": "5.0", "Content": "I needed to upgrade my camera and after going to two camera classed where everyone in both classes a Nikon except me and one other person I went out to get this one.  I compared prices and this was the best with all the extras.  Can't wait to finish my classes and learning how to take great pictures.", "Date": "July 26, 2013"}], "ProductInfo": {"Price": "$2,159.95", "Features": "KIT INCLUDES 14 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D7100 Digital SLR Camera Body + <2> Nikon 18-300mm VR DX AF-S Lens + <3> Nikon Digital SLR Camera Case +\n<4> Transcend 64GB SDXC 10 Card + <5> Spare EN-EL15 Battery + <6> Battery Charger +\n<7> Vivitar 77mm UV Glass Filter + <8> ML-L3 Shutter Remote Control + <9> Precision Design DSLR300 Flash + <10> Precision Design 58\" Tripod +\n<11> HDMI to Mini-HDMI Cable + <12> PD 6pc Complete Cleaning Kit + <13> PD Memory Card Storage Wallet + <14> LCD Monitor Screen Protectors", "Name": "Nikon D7100 Digital SLR Camera Body with 18-300mm Lens + 64GB Card + Battery & Charger + Case + Flash + Filter + Tripod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/511mLI-FlOL._SY300_.jpg", "ProductID": "B00BSUJPW0"}}