{"Reviews": [{"Title": "The best value for money", "Author": "Daniel Omar Pereira G", "ReviewID": "R2YOV9O2XY8UPR", "Overall": "5.0", "Content": "Acquired this kit for our new Nikon camera and the results were excellent, the batteries were recognized without problems the camera, and the card reader, mini tripod, and screen protector are an essential supplement for this camera, received in Colombia , South America on time ...", "Date": "September 27, 2013"}, {"Title": "Great", "Author": "John", "ReviewID": "R2LSGYR0XXUO95", "Overall": "5.0", "Content": "The products so far work excellent.  I am writing this mainly because the DavisMax bent over backward and corrected the glitch we had in the package of items.  This is a little quick to write a review for the quality of the products, but as now (3 weeks) they are still going strong and have not failed me.", "Date": "January 16, 2014"}, {"Title": "Extra Batteries, Charger, etc", "Author": "South Florida", "ReviewID": "R14H4AUJ89YR4T", "Overall": "4.0", "Content": "The charger I received was defective and the shipper was kind enough to replace it and not make me pay postage to return the defective one.  This is an example of how to do business and earn trust.  Everything now is fine.", "Date": "December 23, 2013"}, {"Title": "Very good deal", "Author": "Tom Wayburn", "ReviewID": "R2JFE5ID07ISSA", "Overall": "5.0", "Content": "Excellent bargain.  Many useful and instructive objects.  The storage disk holder made me realize that storage disks are a viable repository of photos as opposed to the hard disks in our compute, thus saving the trouble of downloading photos.", "Date": "December 10, 2013"}, {"Title": "Spend More", "Author": "tnywes", "ReviewID": "RKJCF7F1IX5R9", "Overall": "2.0", "Content": "Quality of items poor. Screen saver is a joke. Not designed to give smooth coverage. Will try batteries for while and see how they fare.", "Date": "November 24, 2013"}, {"Title": "Great procuct, great price", "Author": "Georgie", "ReviewID": "R2FA99OOZCS92B", "Overall": "5.0", "Content": "I was going to purchase this bundle at a store nearby and theirs had a couple less items in it and it was more expensive, I got this bundle and its great and you can't beat the price", "Date": "November 13, 2013"}, {"Title": "one batery no proforming right", "Author": "charles ryan", "ReviewID": "R8AWHVDH8DCOC", "Overall": "3.0", "Content": "all was well. till one of the batteries would not recharge on the second day. all else fine. the package came in the two day window. That was nice.", "Date": "October 25, 2013"}], "ProductInfo": {"Price": "$17.99", "Features": "Package Includes: 2 Halcyon Brand Battery & Halcyon Brand Wall & Car Rapid Charger\nBattery Specs: 1200 mAh with Premium Japanese Cells\nMemory Card Wallet + USB SDHC Card Reader\nMini Table Top Tripod + Pack of LCD Screen Protectors + Lens/LCD Maintenance Cleaning Kit\n(See Description for MORE!)", "Name": "Two Halcyon 1200 mAH Lithium Ion Replacement EN-EL19 Battery and Charger Kit + Memory Card Wallet + SDHC Card USB Reader + Deluxe Starter Kit for Nikon Coolpix S3500 20.1 MP Digital Camera and Nikon EN-EL19", "ImgURL": "http://ecx.images-amazon.com/images/I/518M5H9BSeL._SY300_.jpg", "ProductID": "B00BPZF76G"}}