{"Reviews": [{"Title": "No spare battery; the downside of buying \"Fulfillment\" items.", "Author": "Arrow Rock", "ReviewID": "R3QYF6Q5FC8AIF", "Overall": "1.0", "Content": "One star not because of a camera problem, but because of a customer service problem.This is a \"Beach Camera, Fulfilled by Amazon\" item.  That means the Amazon warehouse stores merchandise provided by Beach and, when an Amazon customer wants one, ships it from the Amazon warehouse.  In the case of a camera bundle, Beach packs and seals a box containing the camera and the various bundle items.  You can also order the identical bundle from Beach in NJ, for the same price, including free shipping.  My Amazon warehouse is one state away, so UPS delivered the package the day after It was shipped.  Amazon does a great job and their fulfillment service adds value for businesses, expanding their market and adding to Amazon's volume.But Beach forgot to include the spare battery in the box I received.  And that little fault exposed a big flaw in the fulfillment service.  I contacted Amazon and was informed I could return the entire camera bundle, but they would not send the missing battery.  I called Beach and was told I had to deal with Amazon because they had shipped me the incomplete package.  The very friendly Beach customer service rep seemed not to know that Beach, not Amazon, had left the battery out of the bundle package.  Both answers were not helpful.  I had opened the camera and tried it out as soon as I got it.  It is now a used camera and someone would lose money if I returned it to Amazon, and I would lose the return shipping cost.  Beach sells this generic replacement battery for $15.  I bought one at an Internet auction site for $4.33 including shipping, which is less than what it would cost to return the bundle to Amazon.So now I know that I should have bought this bundle direct from Beach.  The battery might still have been missing, but they would have replaced it without any buck passing and finger pointing.Pros:The camera is quite nice.The 32 GB SDHC card is genuine Sony and works.The battery charger is OK.The card reader is OKThe tripod is OKThe lens cleaning kit is OKCons:The spare battery was not in the box.The \"Digital universal case\" is big enough to hold four of these cameras.  I will buy a better-fitting case.Amazon does not correct missing item issues on fulfillment sales by sending replacement items.", "Date": "May 30, 2013"}, {"Title": "The best Camera I have ever owned", "Author": "Andy", "ReviewID": "R26FXRSAIE6MSC", "Overall": "5.0", "Content": "I bought this camera after my brother in law did a lot of research for a small point and shoot with good zoom and lot's of megapixel. After he shared his findings, I purchased the camera to take on a European trip. This camera exceeded my wildest expectations. It does everything from taking very sharp pictures while in a moving vehicle to clear sharp pictures at night. The battery life is very long. Recharged twice snapping pictures and video over 14 days. I can not say enough about this camera. I predict it will be a very talked about camera.", "Date": "September 18, 2013"}, {"Title": "Awesome camera!", "Author": "Kathleen L. Luther", "ReviewID": "R1PRF5VL8MMH0I", "Overall": "5.0", "Content": "Love the zoom,auto adjust for settings! It's light weight and compact. Quality videos and hi res pix. You can zoom in or out when doing videos. Excellent macros and far away as well, craters on the moon and pollen grains in a flower! Love the chip that removes so I can upload to computer in a USB port. Tried uploading to computer from camera by wifi connection mode several times, takes a long time and disconnects. Don't care, love the camera! Like big view screen, too.", "Date": "September 24, 2013"}, {"Title": "Good camera other stuff ehhh", "Author": "T. Young", "ReviewID": "R344R7JS841LWG", "Overall": "4.0", "Content": "First the camera takes great pictures especially when the light is good.  I bought it to take on vacation to Alaska along with my dSLR.  I found in certain setting this one took better pics than my MUCH more expensive slr.  Fully recommend the camera.Now the rest of the stuff.  Like many others have said, the battery charger doesn't work for the battery.  Wasn't a huge deal for me but may be or others.  The tripod and case are functional but I don't use either (note: the case I got was appropriately sized for the camera and is of pretty good quality - no complaints from me on this).  The memory card is needed as the camera doesn't come with one.  Holds a lot of pics.  It is always nice to have a second battery.  They seem to hold the charge pretty well.  The USB adapter is nice depending on how you prefer to download our pics off the memory card.All and all I have no reservations about recommending this as long as you understand the battery charger doesn't work.", "Date": "September 13, 2013"}, {"Title": "Small and handy - picture quality is poor.", "Author": "R. Erb", "ReviewID": "R3G5HNGG1H9T9T", "Overall": "3.0", "Content": "This is a super zoom with a relatively small image sensor.  I knew going in that picture quality would not be the best and this is the case.  Do not expect to enlarge any image this camera takes - it will not be pretty.  For images that fill the frame AND are taken with good lighting the camera does a decent job.  That will be its only purpose for me, zooming in on too distant architectural items during travel.  I have other cameras to use for everything else.This really is a small camera, easily fitting in ones pocket (in fact it is smaller than the Canon S100) which did surprise me.  Shooting options are almost as limited as the image quality but sufficient for my intended use.  I would not recommend it for anything other than my intended use as stated above.", "Date": "July 17, 2013"}, {"Title": "great camera", "Author": "J. Morris", "ReviewID": "R1CF8M9HMR1JFC", "Overall": "5.0", "Content": "What a great camera and a great camera package.  I love all the extras that came with the camera, which are worth alot of money in themselves.  This price is even better than Sam's Club!!", "Date": "May 18, 2013"}, {"Title": "What a fantastic Camera.", "Author": "Cornelis", "ReviewID": "R1LB3SPFI2YWNZ", "Overall": "5.0", "Content": "I have owned many cameras, this one is coming close to perfect without breaking the bank to purchase and a caddy to lug around.", "Date": "May 6, 2013"}, {"Title": "Good, but not excellent.", "Author": "Denis", "ReviewID": "R1CMLK2LIRSLJZ", "Overall": "4.0", "Content": "Camera is nice, delivered in time, but if You want to order it, You should know there is no USB into microUSB cord, so you can't connect camera to computer.. It's not a problem, because there is a card reader, wifi and battery charger, but still a little bit disappointing. Other stuff is just right as it subscribed. I'm fully satisfied with this purchase. Thank you.", "Date": "August 18, 2013"}, {"Title": "Incompatible Charger", "Author": "michael kourmoulakis", "ReviewID": "R2BEI0SCTWS08G", "Overall": "4.0", "Content": "The package came with an external travel charger for a Casio NP-20, NP-60. This Charger is not compatible with the Sony NP-BX1 battery that this camera uses.", "Date": "June 16, 2013"}, {"Title": "Good Quality Shots, Nice Zoom, Crappy view-screen in sunlight", "Author": "eclecticwhyzas \"Vadim\"", "ReviewID": "R10SCUEEOT0AZQ", "Overall": "4.0", "Content": "I got this kit because at the time it seemed the best deal.  You can get the camera cheaper alone unless you like/need the miniature tripod, the 32GB card and the extra battery (which you can also get inexpensively). The battery charger that came with it is the wrong one and, according to the rep I called, he gets a lot of calls about Sony chargers being wrong. They are just middle-men so they can't/won't check or swap out for the correct one. He was willing to cut $15 off and forget that I didn't have a charger. (I worked out a more reasonable deal with him and bought the charger elsewhere.) The camera, which is the main feature here, is small, easy to store in your pocket--although it does come with a case-- and easy to operate.  It takes great photos for a small camera (it takes great photos for many cameras) at 18.2 MP but if you need to take a shot with the sun in your face or behind you, you will be pressed to see what you are shooting on the LCD (not unlike any LCD screens). I live in a sunny area so it does cause problems. If fingerprints annoy you on an LCD, this will drive you nuts.  It is a magnet for smears of all sorts and since it is small you almost have to touch it to operate it--but it does clean of easily enough. It is sturdy metal and feels like something real, not plastic. I've got better cameras, but I get a lot of comments on the quality of the shots I've taken with this. I'm pleased with it, but the filler in the package (except for the card) is typical filler from China; not unlike most products.", "Date": "June 13, 2013"}, {"Title": "Surprisingly high quality images.", "Author": "m.eckholm", "ReviewID": "R3O7PD4X4VEI90", "Overall": "5.0", "Content": "This camera surprised me with it's image quality and feature set.  It did amazingly well in low light and the zoom is really impressive.  The bundle makes a lot of sense too- just the right stuff.", "Date": "November 18, 2013"}, {"Title": "Good", "Author": "Elizabeth Cadme", "ReviewID": "R2L0PY2NUSDKIW", "Overall": "4.0", "Content": "All was ok except the charger, because not correspond to the camera's battery. I will keep the charger, may be someday it will be used.", "Date": "November 13, 2013"}, {"Title": "Excellent !", "Author": "Tracy Johnson", "ReviewID": "R2E8KW9DD31910", "Overall": "5.0", "Content": "Excellent battery life. Use more than my DSLR now. Crisp picture. Awkward button locations on some but otherwise excellent camera", "Date": "September 8, 2013"}, {"Title": "Camera has all of the bells and whistles plus some", "Author": "William E. Wistehuff", "ReviewID": "R17NPKZODVO99H", "Overall": "5.0", "Content": "This camera has a lot of capability.  My old digital was 10 years old and I thought it was great when I got it.  This camera far exceeds its capability.  So far it appears easy to use but I have a lot to learn yet.  It will take some practice to use all of its capability but likewise it works well as a point and shoot.", "Date": "September 2, 2013"}, {"Title": "this is the best camera i've owned", "Author": "D. C. Clegg", "ReviewID": "R211SZAEJ5WG7G", "Overall": "5.0", "Content": "i love the convenience of having a small point and shoot camera.  this one has all the bells and whistles without being too complicated.", "Date": "August 12, 2013"}, {"Title": "I liked the Camera", "Author": "ADRIANO GOMES CESAR", "ReviewID": "R3NIMF3FJKQ51T", "Overall": "4.0", "Content": "The camera is very good, the interface with my iPhone worked ... the only problem is that the extra charger was not the correct model and I could not use it.PS. I didn't send a note to the seller, so I can't complain.", "Date": "July 12, 2013"}, {"Title": "Impressed more than I thought I could be - Can't stop talking it up to anyone who will listen", "Author": "Jerome J. Kalke", "ReviewID": "R2SK63ZFD860F1", "Overall": "5.0", "Content": "This is my fourth Sony \"still\" camera - all the others have been handed down and in the family except the one I dropped and toasted the display.  I am blown away by the picture quality and features.  I don't know how often I will use the 360 Panorama but nonetheless is really cool.  There in not enough room here to list all the complements but minimal picture shake shooting video while walking is very impressive along side the incredible zoom with its smooth control.  I would buy it again.  I would recommend it to anyone.  An amazing pocket camera for all users, and oh-yah, there  is the terrific battery life as promised.  No complaints so far after about a month us use.  I can't help but miss an optical viewfinder for occasional use but maybe I am just old fashion.....", "Date": "June 25, 2013"}, {"Title": "Burst Shot is GREAT!!", "Author": "Jena Ray", "ReviewID": "RTJR237QU7UVN", "Overall": "5.0", "Content": "I have been shopping around for months for a camera that takes great action shots from a distance!!  And for a reasonable price, so far I couldn't be happier with the Sony DCS-WX300.  I have captured some great shots of my son playing baseball.  The casing of the camera is great and very sturdy unlike the plastic cameras I have in the past.  Also its size is a huge plus for me, it is nice being able to fit it in my bag and not have to lug around a huge camera bag full of attachments.", "Date": "June 18, 2013"}], "ProductInfo": {"Price": "$289.00", "Features": "DSC-WX300/B Black 18.2MP Digital Camera with 20x Opt. Image Stabilized Zoom\n32 GB Secure Digital High Capacity (SDHC) Memory Card - Class 10\nCompact Digital Camera Deluxe Carrying Case - BTC4, NP-BX1 1600MAH Battery Pack\nPremium Tech AC/DC Battery Charger, Hi-Speed SD USB 2.0 Card Reader\nFlexible Mini Table-top Tripod, 3pc. Lens Cleaning Kit", "Name": "Sony DSC-WX300/B DSC-WX300 WX300 WX300B WX300/B DSCWX300B 18 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD (Black) 32GB Bundle with 32GB SDHC Card, Spare Battery, Rapid External Charger, Case, SD Card Reader + More", "ImgURL": "http://ecx.images-amazon.com/images/I/51ajiJvs-QL._SY300_.jpg", "ProductID": "B00BM8ITJI"}}