{"Reviews": [{"Title": "So Much Canon Goodness Packed Into This Tiny Fella!", "Author": "Marc Jordan \"Marky Da'  Saint\"", "ReviewID": "R3C821SB1VE0IA", "Overall": "5.0", "Content": "As we all know, Canon's S90 - S100 models have pretty much set the bar in The Advanced Point And Shoot market for the last 4 1/2 yrs... Until recently ( With the advent of The Sony RX100). Canon sales more cameras than almost all other brands combined, this does not indicate, however; that they are the best in all categories, but that they are either the best over all, or at least in the top 5 for most classes of cameras.  I have owned many Canon Cameras and printers over the years, and I have been very happy with most of them, but I also place a lot of stock in fellow Amazon customer's reviews. For many months, I noticed that every other review, or updated one, for The Powershot S100 indicated a nasty lens error.  That said, this time around researching advanced P&S;'s, I decided to see what other Brands such as: Nikon, Fuji, Panny and Sony were offering... What I found was this, Other brands have really took notice of The Canon S and SX line's success and or offering very stiff competition!  Sony has, IMHO, set the New Standard with the almost perfect Advanced P&S;, The RX100. My coworker owns one, and it stomps all others in this now crowded class! Only problem is that it cost over $650.00, but the image quality, and low light rendering are truely amazing! Needless to say, Sony discounts its products about as often as Apple discounts its products... NEVER! The Panny Lumix LX5 and LX7, Nikon P300 and P310 and Fuji X10, are all now offering very good to excellent image quality in this class. You saw correct! I did include The Nikon Coolpix P310!  Nikon has really stepped their game up with The Coolpix Line, in fact; this was the only model that came close to The Canon S100 and S110's Bang-For-Your-Buck. Price, it is $200 less than Canon S110, $450 less than The Sony RX100, while offering excellent I.Q., pocketabillity, low light performance and manual controls... Sans Raw mode. Came so close to getting The Nikon P310, before you judge me, just take a gander at the online sample shots of this camera!  In the end, I came back to The Canon S110.  Chose The newer S110 over The S100 in the hopes of avoiding The Lens Error (Fingers Crossed). So happy with this camera! The S110 looks identical to The S100, but let me tell you, Canon has made some huge improvements with The 110. Canon has improved upon the sensor and auto focus speed of this model, added usable ISO, WiFi and touchscreen functionallity. Low light performance is a lot like that of The S95 and S100 combined. Allow me to explain. Sometimes The S100's colors would be a little off in low light, casting an orangish hue... as if shot in sepia. The Powershot S95 rendered sharp, detailed and very accurate colors in lowlight, but the lens was a bit slow under these conditions.  I don't know what Canon did, but there is almost zero lag in AF, despite others claim that this is a slower lens or sensor than its predecessors. Color, contrast and sharpness are spot on! I predict that the next S model will have a larger sensor to be competitive with The Sony RX100's lowlight performance, but until then, I have to say that the S110 is very close in low light image quallity and will surpass the Sony, although at the cost of a higher price point and perhaps a larger form factor because of the larger sensor.  Battery life has never been an issue with me, because I rarely took over 100 pictures in a day and never used GPS tagging or logging. I also rarely shoot video clips longer than 10 min. in a day,also buy cheap aftermarket Batt.s as back-up. Canon's addition of WiFi to The S-Line is really cool and useful; I use it way more than I thought I would!  It is implemented very well with this camera, much smoother and faster than using Eye-Fi's top of the line card... That's an $80 dollar value right there! Lol  Also, I already own a Canon SX-230HS and many extra batteries. The S110 uses the same battery ( NBL-5) as The SX-230. Yes! Winning! WiFi connection with your smartphone or iPhone is almost instantaneous, once the App. is opened on the device, or printer turned on. GPS functions are combined with these WiFi transmissions between your phone and camera, and they are thus also instantanious.  The WiFi operates very efficently, and a cool, bright, blue LED lights up on the top of the camera when it is connected. It flashes when busy. The Camera asks if you would like to geotag or log your location while connected to your phone or computer. It is a 2 second affair, so GPS no longer drains your battery. Built-in GPS and Eye-Fi cards do not work nearly as seemless as this! I had issues when first setting this connection up, because I thought I could bypass the step where you connect the Camera to a computer via USB cable and run software CD...  You have to do this step! I think you may have to also Register your S110 for it to properly set up initial WiFi.  Touchscreen: Very Responsive, and can be adjusted.... Nuff said on that.  CONS: The things I don't like about The Canon Powershot S110 are pretty much all ergonomically based. These things are true of the entire S series, and perhaps the indicative of the entire Class of these type cameras. They are not easily handled or operated... even on Auto! EXAMPLE: A friend, family memb., or pedestrian says, \"Hey, YOUR NAME HERE, I noticed you are taking everyone else's picture, would you like me to take yours with the group?\" You have to explain that this really tiny, hard to press button turns the camera ON. When it turns on be careful, because the flash is going to come up over here. If you want to zoom in it's the tiny switch here next to the shutter button. Now, you only want to press the shutter button halfway to compose the shot... it'll beep when ready, then you push it all the way down to take the shot. See? Some ergonomic issues have gotten better with this version of The \"S\".... others the same or worse. 1. Front grip is gone. 2. As on all The S Models, power button is way too small and recessed. 3.Mode wheel blocks index finger from shutter button. 4.Flash makes camera hard to handle with left hand. 5. if touchscreen shutter is on, camera will take picture if finger contacts screen before you are ready. I guess some things have to be sacrificed for a small form factor, but I feel comfortable giving anyone my Canon Elph 300HS and it is the smallest P&S; ever produced!  There is no loud knocking noise when zooming in video, but there is a slight wherling sound when I zoom in video.  Hard to notice and can only be heard when passage is very quiet during playback, but it's there... none the less. Wish Canon would get that worked out. All and all EXCELLENT IMAGE QUALITY and cool added features, deffinately recommended! The White is very cool looking and although glossy does not show prints as much as I had anticipated.  The Black/Mat is sleek and modern looking like a stealth plane.... was a hard decision to make!  UPDATE: Have now taken close to 400 shots. Still going strong!  There are a few points that I should add to my review. Some I forgot, and some are new discoveries.  1. Wifi connection.: I own a Huawi Glory/Mercury Android smartphone which is still running Gingerbread. The S110 connects flawlessly with this phone, but what I found out is, you must be near an open WiFi network or hot spot for it to work. The Camera's Wifi will not work over 3G or tethered to your phones mobile hotspot. Also, The S110's WiFi will not connect wirelessly to Windows7 Basic,Starter or any OS older, such as XP or Vista. It won't work on Macs older than OSX 10 or whatever Apple's answer for Windows 7 was. I was told by a Canon Rep. that it works well with full versions of Windows 7, and extremely well with Windows 8. We will see. Waiting for Black Fri. to snag a Windows8 computer.  2. Touchscreen Shutter: Amazingly, the touchscreen functionallity of The S110  has really impressed my friends and family. It really comes in handy when I  give The S-110 to someone, in order to get in the picture myself or for  some one to swipe through the pictures, using their finger to preview.  3. Price Point: I purchased The Powershot S110 for $390 used, and it came  new, in box with all contents still sealed in plastic. Nice! The main reason  I purchased the S110 over the S100 was it was only $38 dollars more at that  time, and I felt that was a small Diff. to pay to hopefully avoid The Lens  Error. I really am happy with this little camera. The functions and menues  are very easy and quick to access with the lens ring and touchscreen. Before  I was using Auto way too much... Now, I am truely learning, in a fun easy way  about F-stops, apperature, ISO, white balance, shutter speed, etc.  Things  that I already kinda knew about with my Eos T3 and even my S95, but seemed  to much trouble or laborious, are now fun and easily implemented to play  around with. I am having, \"A Ha moments,\"  where I think aaah, that's why  that turned  out good or bad with my DSLR... The S-110 is the perfect learning tool to  whip out of your pocket, purse, or Camera Case and start learning and  capt-  uring. I also played around with The Canon G15 and G1X. Salesman at camera  store told me that G15 used pretty much the same sensor,lens and processor  as The Canon S100 and S110.  The Powershot G1X really impressed me with its  image quality though; seemingly better than even the more expensive, Sony RX  100! I understood why when he told me it had an SLR sized sensor. The G1X is  a beast, though! Holding it, it felt the size and weight of my T3 without the  lens! Way too large, but may be Canon's answer to The New Sony, Panny, Fuji  and Olympias in this class. He offered it to me at the same price as the G15  $550 plus Uncle Sam's cut (Tax), but it still was more than I could afford.  So here I am. A happy S110 owner. Lol", "Date": "October 21, 2012"}, {"Title": "Touch screen and other thoughts", "Author": "Peacefrog", "ReviewID": "R26CU3JYQHQRVE", "Overall": "4.0", "Content": "Been using my new white S110 for a few days now and my initial impressions are:Build Quality - Very good, nicely finished has the look and feel of a quality productFeatures:  Touch screen is responsive, AF is speedy even in low light, knurled front ring makes adjustments easy and fast, typically good,  easy-to-follow menu system and initial setup.  LCD is bright and visible even in Florida sunlight.  Auto white balance seems pretty good.  The Auto function works surprisingly well choosing a scene mode and applying image parameters.  With the Auto mode, I have not witnessed any unexpected blown-out highlights and shadow detail is pretty good.  Image stabilization appears to work very well, perhaps 3 stops worth.  Conversely, wireless setup is a monster nightmare that involves Canon Gateway, registering, modifying your network settings and then just maybe it will work. After almost 30 minutes of tinkering,  I was able to transfer 16 photos to my laptop but it took almost 15 minutes to accomplish the transfer.  Much easier to just use a card reader and then upload photos to social media sites, email, etc.  Canon has not made this feature user-friendly.  I will not be using the wireless capability.Image Quality:  Very good up to 800 ISO - little noise, good detail, and color.  1600 is still good.  3200 perhaps for small prints only.Overall:  Good camera; however, Canon's engineers made the wireless curse-worthy.  Build quality, image quality, handling, ergonomics are all above average.  My only caveat involves the price...kind of pricey for a couple of features over the S100.  If you can find an S100 with a serial number above 42xxx (infamous lens error problem), you'll have basically the same camera as the S110 sans the touch screen and the wireless features at a much less expensive cost.  I plan to keep my S110 since it is so very pocket-able, fast, and puts out very decent images especially at lower ISO levels.  Canon states that the S110 has a newly designed lens.  I am just hoping they have rectified the frequent lens error problem of the S100.  Time will tell.", "Date": "October 26, 2012"}, {"Title": "You'll Regret Purchasing This Camera", "Author": "Zero Cool", "ReviewID": "RB2DMHJRNA9WD", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo393BSDM6VP7OKembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo393BSDM6VP7OKrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo393BSDM6VP7OKchiDiv\").innerHTML = document.getElementById(\"cv_mo393BSDM6VP7OKhiddenPre\").innerHTML;\n};\ncv_mo393BSDM6VP7OKrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo393BSDM6VP7OKso;\t   \n\n\nfunction cv_mo393BSDM6VP7OKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo393BSDM6VP7OKso = new SWFObject(swfLocation, \"cv_mo393BSDM6VP7OKAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo393BSDM6VP7OKso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo393BSDM6VP7OKso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo393BSDM6VP7OKso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo393BSDM6VP7OKso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo393BSDM6VP7OKso.setAttribute(\"height\", swfHeight);\n          cv_mo393BSDM6VP7OKso.setAttribute(\"width\", swfWidth);\n          cv_mo393BSDM6VP7OKso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo393BSDM6VP7OKso.write(\"cv_mo393BSDM6VP7OKflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo393BSDM6VP7OK', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo393BSDM6VP7OK';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo393BSDM6VP7OK', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo393BSDM6VP7OKloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo393BSDM6VP7OK\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m2S1VQV0BOXYBU\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m2S1VQV0BOXYBU\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RB2DMHJRNA9WD\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m2S1VQV0BOXYBU/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo393BSDM6VP7OKduration')) {\n      document.getElementById('cv_mo393BSDM6VP7OKduration').style.display='none';\n    }\n    cv_mo393BSDM6VP7OKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo393BSDM6VP7OKloadSwf(movieID, playerVersion) {\n   return _cv_mo393BSDM6VP7OKloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo393BSDM6VP7OKnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo393BSDM6VP7OK', 0, h);\n}\n\nfunction cv_mo393BSDM6VP7OKresetPlayer(w,h,bw,cc) {\n  cv_mo393BSDM6VP7OKnewHeight(h);\n\n  cv_mo393BSDM6VP7OKso.addVariable(\"resetBandwidth\", bw);\n  cv_mo393BSDM6VP7OKso.addVariable(\"cacheCode\", cc);\n  cv_mo393BSDM6VP7OKso.setAttribute(\"height\", h);\n  cv_mo393BSDM6VP7OKso.setAttribute(\"width\", w);\n  cv_mo393BSDM6VP7OKso.write(\"cv_mo393BSDM6VP7OKflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo393BSDM6VP7OKRollOverImg = new Image();\ncv_mo393BSDM6VP7OKRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81WjRQ21NhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo393BSDM6VP7OKpreplay = document.getElementById('cv_mo393BSDM6VP7OKpreplayImageId');\nif (cv_mo393BSDM6VP7OKpreplay) {\n  cv_mo393BSDM6VP7OKpreplay.onmouseover = function() {\n    cv_mo393BSDM6VP7OKpreplay.src = \"http://ecx.images-amazon.com/images/I/81WjRQ21NhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo393BSDM6VP7OKpreplay.onmouseout = function() {\n    cv_mo393BSDM6VP7OKpreplay.src = \"http://ecx.images-amazon.com/images/I/81WjRQ21NhS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo393BSDM6VP7OKpreplay.parentNode;\n\n  var cv_mo393BSDM6VP7OKcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo393BSDM6VP7OKcurrentClick) {\n      return cv_mo393BSDM6VP7OKcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:15 MinsWhile the S110 has great features, it suffers from the fatal lens error that has become synonymous with Canon's Powershot S line of cameras.  This Powershot S110 failed with a lens error during a family vacation - leaving me with just my lousy smartphone camera.  I had it for only 20 days when it failed.I've owned the S10, S80, S95, and now this S110.  With the exception of the S95, ever single model has had a lens error.  Until now I've just dealt with it (returned / repaired) because of the excellent image quality and features.  I can no longer ignore these lens issues and I will no longer be buying Canon cameras.  Frankly, I feel like kind of a fool for giving Canon so many chances.Do yourself a favor and search for Powershot lens errors.  Most importantly, don't ignore what you find!  This is a great camera when it works - which is why there are so many 5 star reviews.  Read the 1 star reviews to get an idea how common the lens error is - then decide if you want to take a chance on this camera.", "Date": "June 26, 2013"}, {"Title": "A solid enthusiast compact", "Author": "S. Vogt", "ReviewID": "R1JH8HNPRP2DHR", "Overall": "5.0", "Content": "The Canon Powershot S110 brings some key performance improvements as well as the touchscreen which makes this 4th generation S series camera probably the best yet.The photo quality from this camera is impressive considering its sensor size. If I was to be really nit-picky I would say that the sharpening in the JPEGs appears a little crude at times and the colors aren't as punchy or contrasty by default as they were in the S100. But color performance is still pretty good (I like the colors better than the ones from the Sony RX100), detail capture is very good, and ISO performance is excellent. At ISO 800 the camera does a very nice job balancing out detail retention and noise reduction and even ISO1600 photos look good as long as you're not blowing them up to huge sizes. Shooting RAW will help you wring out even more detail. Dynamic range is also quite good. The camera tends to overexpose in bright conditions and blow out highlights. Which is pretty typical for this class of camera. Taking everything into account though, I would say the S110 probably has the best overall image quality of any of the S-series cameras so far.Canon uses the same 5x F2-F5.9 lens as they did in the S100. It's unfortunate they haven't taken the opportunity to put a faster lens in this model because most of the competitors have much faster lenses on their cameras. That said, the lens is fairly sharp. It also zooms in and out fairly quickly.Sadly, the camera has lost the little indent on the front which helped give you a more secure grip. However, the surfaced is textured in such a way where you can still get a decent grip, and it's not slippery like the Sony RX100. The LCD screen is 460k dots, and while it's pretty decent, I think Canon should have taken the opportunity to upgrade the resolution with this model. The big update this year with the LCD is that it is now a touch screen. To be honest, it's not very practical for adjusting camera settings but does work extremely well for touch focus and touch shutter. It's a much better setup than having to go into the menu to adjust the focus area. The touchscreen overall, though, is very responsive and works well.The control ring up front remains on this model and is still excellent to use. With decisive clicks everytime you adjust something. You can of course customize the control ring up front to adjust a number of settings.As far as performance goes, shot to shot times are about the same as the S100 but autofocus performance has improved on this model. I wouldn't say the camera has blazing fast autofocus but it should be plenty quick enough in most shooting situations.As for the video, it is surprisingly good for such a small camera but is most suitable for short clips.This model has since been replaced by the newer S120. The S120 is a faster camera overall and has better video capabilities. Plus it has a slightly faster lens but still F5.7 on the telephoto end. I have also heard some say that the S120 is worse at high ISO but it appears about the same to me. If you're a still shooter who doesn't dabble into serious video shooting or need the extra burst performance, you can get the same photo quality and still respectable performance from the S110 at a much cheaper price.", "Date": "December 5, 2012"}, {"Title": "Lens Error on Day Two", "Author": "KK", "ReviewID": "RGM7O3RO082PZ", "Overall": "1.0", "Content": "My wife purchased after I did some research.  Day one we were both very excited to used the s110 and anxious to learn more about the many features.  Day two we experienced repeated LENS ERROR.  It is headed back to Amazon.  Will replace with another choice.  Serious problem on day two indicates serious quality control issues at Canon.", "Date": "June 28, 2013"}, {"Title": "Amazing Subcompact Camera That Is Now a Best Buy", "Author": "Roger James \"Doc\"", "ReviewID": "R16N3NOBE2XKRB", "Overall": "5.0", "Content": "The S110 is a truly amazing subcompact camera and is probably the best pocket able camera for under $350 you can buy at today's prices.  The Sony RX100 is probably the best subcompact camera but it costs twice the S110 price and is missing some key new features that separate it from the subcompact camera competition. I rated the S110 5 stars because it is a great subcompact camera at a great price. The price does fluctuate so watch for a good deal if you decide to buy.I upgraded my Canon S95 which is still working perfectly two years later after taking over 5000 images. The images I've taken with that camera rival the other more expensive digital cameras with larger sensors and lenses that I own.  It's one camera I always have with me. When you compare the S95 with the S110, they almost look identical. There are of course a few changes in the button layout and the surface appearance. Why change a successful camera?  The S110 is a tad heavier by a fraction of an ounce over the S95. The interface is the typical Canon interface and it's easy to find your way around. The separate video button is now standard on virtually all cameras today so that's not so special but it is nice to have.The S110 has many new and improved features that make this camera an even a better camera than earlier versions. The processor, sensor and zoom have changed but the basic camera shape remains the same. The things I like a lot that are either new or improved from the Canon S95. The biggest changes came in the S100 released a year ago. That model while improving on the S95 had some lens issues on a number of the cameras especially when it was first released. You can see some of the negative reviews list the problems. If you didn't have a bad lens, you probably loved that camera. Today it sells for more than the S110 which is surprising.The S110 has much faster autofocusing.  It allows faster image capture. New image processor. Here are some other things which add greatly to the user experience.1. Touch Screen interface. Helps in focusing on subject and faster setting things up.2. WiFi that replaces the GPS unit is not present on S95. There are many possibilities with this...3. F2 starts wider at 24mm instead of 28mm equiv.4. Wider zoom range 5X versus 3.8X. So its wider and with more telephoto.5. Better low light capability and a much expanded ISO range. Very high ISO images are possible.6. Expanded digital zoom up to 20X is surprisingly good but not typical super zoom quality.7. Many more manual and custom settings possible.8. Expanded compensation9. Slightly improved ergonomics with thumb rest and slightly rougher texture on the surface, allowing a better grasp. You still need the wrist strap  for safety reasons.10. Full high definition video, 1080P at 24FPS with separate video button.11. Slightly stronger flash.12. Excellent and expanded image stabilization. (Which is pretty good)13. Excellent image quality with the new CMOS sensor. Much better low light images.14. Many advanced features. (it does take time to try everything)15. Separate charger for the battery, allows charging second battery while using the other battery16. Has a new level meter to help keep your camera positioned correctly. It does help at times.17. Contains some self-help on the LCD that can be removed.The things that are not so great and that are not improvements.1. Smaller battery, the same as the earlier SD series. It means fewer pictures per charge. Two of my earlier Canon subcompacts used the same battery so I now have spares.2. Change from CCD to CMOS sensor brings some change in image quality and noise.3. Flash pop up location pushes finger and can startle an unsuspecting holder.4. HD video is MP4 and allows less video footage but is easier to edit.5. Still only a small starter manual. Manual is PDF and can be downloaded.6. No remote trigger. You can set delayed shutter snap at 2 or 10 seconds.7. Button placement is similar but different. The power button is harder to push. The shutter button is larger.8. The same popup flash that will hit your finger if you don't change your left hand position.9. Build quality is very good but is not at the level of the Sony RX100. It is a combination of metal and plastic. Does feel very solid.10. As you zoom out to about 100mm, the F stop is over F5 and not so great for low light. You may need to raise the ISO to get an image.If you do decide to buy this camera or the Sony RX100, Panasonic LX7, you will not want to retire your dSLR, or Super zoom or whatever because those cameras offer features not possible with a very small camera without viewfinder. The Canon S110 is truly pocket-able and at the current price is half the price of the Sony RX100 making this camera seem like a best buy in the subcompact field. A subcompact camera is a must have camera because, you can carry it everywhere. The current crop of smartphones can take a decent images for the internet but don't come close to the image quality or convenience of the Canon S110 and other subcompact cameras.", "Date": "April 2, 2013"}, {"Title": "Len Error on arrival", "Author": "Positron \"Positron\"", "ReviewID": "RJFR7TVQ3OEAY", "Overall": "1.0", "Content": "Received the camera, charged the battery, powered on for the first time and got the \"Lens Error\" message. Restart didn't help. Sad to see s110 still has the Lens Error as s100. Had to send it back to Amazon on the same day. Wish I could post a picture to show the error.", "Date": "May 15, 2013"}, {"Title": "Lens Error", "Author": "Tim A NYC", "ReviewID": "RIH1EZAH32OCO", "Overall": "1.0", "Content": "I have owned for less than 60 days, taken less than 100 photos, no damage at all, and out of the blue I now get the \"Lens Error\" message.  Lens will extend, but never retract.  Changing batteries, giving it a rest, nothing seems to work.", "Date": "July 14, 2013"}, {"Title": "A Point & Shoot for DSLR Users", "Author": "David McPherson", "ReviewID": "R357VESP1QHSVH", "Overall": "5.0", "Content": "This review is from the perspective of a long time Nikon DSLR user.  My regular camera is a Nikon D300s with the battery grip and several lenses.  I have been looking for an easily portable camera to carry when I don't need or want the heavy gear.  My goal was to reproduce the functions of the DSLR in a small package and do it for under $400.  This review looks at my five most important DSLR functions and explains how they are reproduced in the S110.Shooting in Camera RawI always shoot my DSLR in RAW mode and custom crop and process every image.  It sounds like a pain, but thanks to automated features in programs like Photoshop and Photoshop Elements, it isn't a big deal and the results are worth it. If this is new for you, the difference between capturing a picture in JPEG and RAW is in the ability to further manipulate the images later.  For example, assume you have set your camera to use: 1) Auto White Balance, 2) No Exposure Compensation, 3) Medium Sharpening, and 4) produce the image in JPEG format.  The camera takes the picture, applies your settings and records it as a JPEG file.  If you shoot the same picture in RAW with the same settings, the camera notes your settings and may apply them to the thumbnail that it shows you, but what you download from the camera is the data collected from the sensor without the settings applied.  This is why pictures from a cheap point-and-shoot (P&S;) camera may look better out of the camera than pictures from a DSLR or advanced P&S.;  But, the trouble comes when your JPEG settings don't give you what you expected.  Suppose you get the pictures on your computer and they have a green cast from the lighting, they are under-exposed and under-sharpened.  If you shot them in JPEG, you may be out of luck without doing extensive fiddling.  If you shot them in RAW, you use your processing software's RAW converter and change the settings to what they should have been to give you the shot you wanted.  Basically, you adjust RAW images on your computer like your camera produces JPEG images in the camera.  The computer gives you more processing power, more sophisticated processing software, and the ability to change the settings until you get the image you want.  Combine this with the fact that JPEG compression will hurt image quality and RAW images come out of the camera uncompressed and you can see why shooting in RAW mode is more work, but can provide a much better outcome.  The primary reason for selecting any of the cameras in this class of advanced point-and-shoots is the ability to record images in RAW format.  If you plan to leave the camera in JPEG mode, you can save yourself some money, get a good camera, and get very nice pictures by choosing a different camera that takes only JPEGs.Front Control RingYou can assign 8 preprogrammed functions to the front ring.  I use the control ring to change the lens zoom settings.  The focal length changes in fixed steps of the standard prime lenses from 24mm to 120mm. I find the control ring works much faster than trying to frame with the zoom lever on the top of the camera.  After using a range finder and SLR cameras for years, it is natural to have this control on the front of the camera and I love the ability to program it with the push of a button.  I have been surprised by how this one feature simplifies shooting with the S110.Display InformationI don't know if I will ever get used to framing on the screen of a P&S.;  I prefer the \"real\" optical viewfinder of a SLR. But, none of the cameras in this class have an optical viewfinder, to get that feature you will pay another $100 and get a larger camera.  The S110's display gives me all of the information I get when using my DSLR and more.  When framing the shot, I see the battery level, shooting mode (e.g. RAW), the exposures remaining on my SD card, the length of video I could shoot, the flash setting, horizontal level, exposure compensation, f-stop, and ISO.  When I press the shutter button, the display clears at the top and then shows me the information on that shot along the bottom of the display: exposure meter mode, horizontal level, f stop (in aperture priority), exposure compensation, and ISO setting.Aperture Priority ModeCameras in this class will allow you to choose Aperture, Shutter, and Manual mode in addition to a bazillion scene settings.  Like my DSLR, I keep the S110 in aperture priority nearly all the time and use the back thumb wheel to change the aperture.  If you have read the reviews for this camera and the others in this class you know that you lose a lot of aperture range as you extend the zoom.  For example, the aperture range is f 2.0 to f 8.0 at 24mm and at 50mm the aperture range is f4 to f8.  The relatively fast lens helps get good pictures in low light situations.  The problem is that the relatively small sensor gives little control over the depth of field, again an issue with this class of cameras that is not unique to the S110.Exposure CompensationThe camera's meter is always a good place to start.  But, I often find that I need to increase or decrease the exposure to accurately capture the mood of the scene.  The exposure compensation process is simple with the S110; press the top of the rear control dial and rotate the dial to select the exposure increase or decrease.  The display then previews the shot with the new setting.If you have read the other reviews, you know that it is a good idea to buy a second battery.  I own at least two batteries for all my cameras, so I was not surprised or disappointed by the battery life.The S110 is not intended to replace your DSLR.  But, Canon has taken the DSLR's controls and wrapped them around a point and shoot sensor to give photographers a great small camera that they can carry virtually everywhere.", "Date": "June 25, 2013"}, {"Title": "Preferred this over the RX100", "Author": "PieInTheSkie", "ReviewID": "R2IUJQ7ZMMKIA8", "Overall": "4.0", "Content": "Before any camera pro jumps on me for choosing the S110 over the RX100, let me first explain why:- I am not a photographer or even an amateur one. I want quality photos and video when I am out, but easy.- It has to be easy for my wife to use- It has to fit easily into a pair of jeans pockets- I do not print photos or do any touch-ups. What I get from the camera, is what I have.- I currently own a Canon S95 and love it - just do not like that its only 720p video and cannot zoom during video- The touchscreen is very useful and makes it easy to make sure I have the right focus. Zooming on photos was easy and second nature. Going back to S95, I quickly found myself trying to touch its screen.That said, I felt the RX100 did take better photos. Its a superb camera, but consider these:- Its bulky compared to the S110, and though it fits in my jeans pockets, it is not comfortable- The UI is difficult sometimes to navigate. My wife could not figure it out. I was able to figure it out and did enjoy it, but the wife did not like it at all.  Neither could a few friends - at least not easily.- The video was better on the RX100 (60p vs Canon's 24p)  but the Canon's video was very good also.- The battery life was better on the RX100 (my biggest gripe with the S110 is that I need to have a spare battery)- In a blind photo comparison on the laptop, 3 out of 4 family members picked the Canon's photos.  It is probably because of the image processing that the Canon does.  While I know that a true photographer would edit the RAW photos in Photoshop - that is not me. What the camera gives me is what I share.- The price - double the price of the S110, just didn't seem justified for a point-and-shoot person.  Perhaps for the photographers out there looking for a companion to their DSLR, but not for meI give it 4 stars because of the poor battery life and that 24p video is not enough", "Date": "January 9, 2013"}, {"Title": "Great small camera", "Author": "maxmach", "ReviewID": "R1HU6R5QVOD040", "Overall": "4.0", "Content": "The camera delivers what canon intended, great pics in a small package. I am very happy with it.....I am not a professional, I had a S95 before this, and I was thinking of getting the G15. But I didn't. I really value the face that you can put this in your pocket or somwhere small, and it takes sharp pictures. I also like the fact that everyone thinks that it is \"just\" another $100 camera. It doesn't stand out looks wise which I like.The picture quality is superb, the menu choices are all one needs. I have taken this camera skiing, to the beach, wading into the ocean, backpacking, I do not baby it. So far so good.", "Date": "December 1, 2012"}, {"Title": "Pretty amazing camera!", "Author": "P. Saini", "ReviewID": "R2DBGAB49MLN4R", "Overall": "5.0", "Content": "This is my first camera from Canon's S-series.  I've never owned or used the S95 or S100; additionally, I'm not a professional.  I do have a Canon SLR crop camera (Rebel XSi witht the 580EXII speedlight and several lenses including some L lenses), which I love and have used for the past several years.I had a 7-day trip to Paris coming up and really didn't want to carry my SLR around.  I also didn't want to miss out on amazing pictures and memories of my first trip to the beatiful city.  I made the decision to go with the S line and originally came here to Amazon to buy the S100.  To my amazement, there was a note that the S110 was just a few days away from being released, and with the groans of the lens error that S100 owners complained about, I chose to try the upgrade.I've go to say that the S110 is pretty amazing. I took over 1800 pictures and 50+ HD movies and was blown away by what this camera can do.  Moreover, its low-light capability is truly amazing...I hardly ever used the flash whenever some light source was in my shot.  The manual settings are great for achieving specific shots.The build quality is great.  There is no viewfinder, but I'm more than happy with the large toughscreen.  Battery life is as expected although not as long as in my SLR (which is expected due to the smaller batter size).  The white body is beautiful and definitely draws attention in a sea of black cameras.  The camera is compact, but obviously no where near the size of those mini Canon elph's.I found the startup to be quite fast.  I was able to pull out this camera while on the move, take a couple of shots and put away the camera, all in a really short duration of time.Let's be clear though..this doesn't produce SLR quality pics, but for its size and convenience,it's a great option for those traveling light, or those that don't want to invest in a SLR right now.Hope this helps!", "Date": "November 26, 2012"}, {"Title": "EXCELLENT IMAGES & EXCELLENT SIZE", "Author": "Jonathon", "ReviewID": "R3LXQSU2VL57L6", "Overall": "4.0", "Content": "This is my backup Canon camera.  I also have a 6D and a T4i; both made by Canon.  I'm a Canon fan and I admit it.I do not shoot professional photography but I do travel the world for a career and I take my cameras with me all of the time.  That means a great amount of what I shoot is outdoor but when I do shoot inside I just can't stand a slow camera with shutter lag/delay.I had Canon's wonderful S95 (this model previously) and later I purchased Canon's dismal S100.  The S100 was a mistake in so many ways and I won't detail that here but the Canon S110 is now under my direction and I so love it!My needs come down to my travels and I don't like handing over my SLR's to strangers or to people that might drop it if I am asking for shots of myself/wife to be taken by another.  There are also certain times I just don't want to bring the SUV of cameras along for a day where it is essential for quality photography.Canon's S110 shoots near SLR like quality that is so good that I can pick out the individual blades of grass in a outdoor shot.  Or the stunning blue skies so detailed that the camera image is even better looking than that of the actual sky itself.It's fast.  Even inside.  I can get 100 shots out of it in just minutes.  It races to process the prior shot and stands ready for the next shot.This is a POINT & SHOOT camera so you do have limits.  Yes, there are tons of potential settings but for a Point & Shoot; leaving in the AUTO mode isn't a bad thing.Is it perfect? NO WAY.Canon fails on battery life with the S110.  Yet in fairness, most have asked for a small pocket camera that can mirror-image SLR quality.  Plus, at just $325 in price.  So you'll need an extra battery at all times.  Add to that the very slow recharge time it takes to recharge your Canon wafer-thin battery.Now let's go to Canon's infamous POP-UP FLASH.  It will push your thumb away from the body as it pops up so NEVER hold the camera without the strap to secure it.  This POP-UP flash has been complained about for years but Canon hasn't changed it and they must have their reasons why.  There's also no rubber grip on the cameras body front so again, have that strap always in use and around your hand so that you don't drop this camera.If you want detailed SPECS here, I'm not going to list them as you can see them online at so many places including AMAZON.COM.  My review here is SIMPLE.  It's about image quality, camera response and speed and the pro's and con's.This is a great (GREAT) camera for the money and it comes from the top name in digital photography.Worth every dollar.", "Date": "March 18, 2013"}, {"Title": "Just what I have been looking for!", "Author": "dmeye", "ReviewID": "RSVA5VYNKXVXF", "Overall": "5.0", "Content": "I do not know much about cameras, but I really enjoy taking pictures on trips and as a hobby.  I have always had a cheap point and shoot, but this time I wanted to upgrade to something a bit nicer, but was small enough to fit into my pocket.  I did hours of research into the best cameras, and I came up with this camera.After taking it on my first trip, I could not be happier with its performance.  The low-light shots are phenomenal, and I have had people ask me what kind of camera I used.  I took most of the pictures in Auto mode because I am still learning how to use all of the features and even those photos turned out well.  For the photos that I changed all of the settings manually, they came out even better with lots of detail and clarity.  I can't wait to learn more about the features and use it one more trips!", "Date": "February 2, 2013"}, {"Title": "Lens Error and Battery Issue", "Author": "IPA Lover", "ReviewID": "R2L8YWAH99Y5G0", "Overall": "1.0", "Content": "I had the S95 for several years and loved it until I misplaced it.  I bought this one despite the negative battery reviews.  They turned out to be true.  A day and a half into a climbing trip the battery started flashing that it was about to die. Then the lens stuck open.  The battery life alone was enough to make me return it but I could not get the lens to close before putting it in the return box.  Charging the battery and putting it back in did not do the trick.  Extremely disappointing.", "Date": "June 7, 2013"}, {"Title": "Camera is for images and Canon S110 does it perfectly", "Author": "Dr. RATAN SINGHDEO", "ReviewID": "R3A66C64HIONJG", "Overall": "5.0", "Content": "Recently I have written many reviews in Amazon and other web sites.So far recent camera I have used Fuji XF1, Olympus XZ1 and Canon Ixus 255.And gone through reviews of Canon S110 and saw images in Flickr.Other web sites like Cameralab,Photographyblog reviewed images from Canon S110 are excellent.True to all reviews images of Canon S110 are excellent with accurate colors rendition.Strength of camera :1.Absolute image quality.2.Color accuracy and rendition.3.Sharp images.4.Although it's maximum focal value is 5.9 ,but still it's quite sharp without any issues.You can check it's other sibling Canon Ixus 255 which produces almost same out put of images even at tele end of f6.9. I found in practical life Canon S110 is much better in image section,although theoretically it's lens is having f5.9 at tele end.I am convinced about Canon's strong processor which does great job.5.High dynamic range with low noise.7.Night pictures are good,but do not compare with f1.4 lens.But it's quite good.At ISO 800 almost all images can be shoot at night,no need to enhance further.8.Wi-fi connectivity.8. A gem in designing and built quality.9. Very useful PSAM mode.10.Touch screen focus and shutter apart from physical control.Pinch and Zoom action of LCD is very useful for me.11.All filters are really usable and fantastic unlike other camera.WEAKNESS OF CAMERA1.Macro shots are ok.I just use normal focal length of 4-5 CM and gives out standing results.Olympus XZ1, Fuji XF1 excel for macro.2.Night photography can be better.Fuji Xf1 excel, but my lens of Fuji xf1 shown 2 times error in 3 months.I sold it without second thought.Useless lens retraction design of XF1.I was not convinced at all about Fuji XF1.My all uploads can be seen in flickr.com for comparison purpose.3.HDR mode is not hand held.You have to use a tripod or rest over a hard surface.4.Battery back up could be better.Final words:Canon S110 is under rated camera available now at great price.Its sibling Canon Ixus 255  produces good images with low price,but output from Canon S 110 is excellent due to its outstanding  Digic processor.Without any hesitation I can recommend Canon S 110.", "Date": "March 23, 2014"}, {"Title": "Amazing pocket power", "Author": "Seattle consumer \"contrarian\"", "ReviewID": "R22694RVTP1139", "Overall": "5.0", "Content": "I almost went down the black hole of getting a DSLR but ultimately decided that this very compact camera would do 95% of anything I might want to do as a budding enthusiast. There are just a few places where this camera falls short and I mention them in case they are important to you and not because I think the camera is deficient in any way.Obviously, you are not going to get great control or options with flash; you are stuck with the puny built-in flash which does a fine job for casual photos. It does give some control over how the flash triggers and is exposed if you want to tweak what you can with this size flash but results can be iffy. There are practically zero options for using off-camera flash.If you are looking to push creative limits you should know that the camera is limited to a 15 second exposure time. Some say the 15 sec exposure maximum is an arbitrary decision by Canon, some say they did it to avoid overheating the camera sensor and/or killing the battery.Also limiting creative choices, it can not go higher than f8, meaning the aperture can't get very small in order to limit the amount of light. This limits depth of field and taking longer exposures.One other thing that bugs me with cameras like this is that it is trying to be everything to everyone, ie appeal to point & shoot as well as expert audience. Ultimately, one gets in the way of the other. I wish I could make all the idiot options disappear. Is anyone outside of Japan really taking headshots of people so the camera will recognize and tag them in future photos? This is all taken care of in off-camera photo management now and seems really stupid. And all the crazy \"wink to take the picture\" and \"take a picture when detecting a new face\" options are useless to me. Maybe these will amuse you and you will find them useful. You can largely ignore these options but they still occupy space in the menus.I care not about video options but this camera can do full HD with image stabilization.So, those are some things to think about when choosing this over a DSLR. That said, it does offer some pretty amazing power and control for a compact camera. If you can live with the limitations then you won't be disappointed. There are lots of ways to customize various buttons and controls on the camera, adjusting to your needs and tastes.I would recommend this camera to anyone looking for an excellent mix of portability and picture control, as well as a causal shooter who thinks they might want to take advantage of greater control as they grow. If you are looking for absolute control and creative options, get a DSLR. If you are strictly a point & shoot person, get a cheaper Powershot. This camera exists as a bridge between those worlds.", "Date": "February 3, 2013"}, {"Title": "Love it", "Author": "Sedona", "ReviewID": "R5QHVOZTJ5AVU", "Overall": "5.0", "Content": "This is the perfect camera for \"aim and shoot\" beginners like me. I love the 3 inch LCD screen and the quality of photos.", "Date": "July 6, 2013"}, {"Title": "Good quality for a point and shoot", "Author": "w", "ReviewID": "R2O2YFV90G98Y5", "Overall": "5.0", "Content": "Some context for this review: I usually shoot with a DSLR and bought this camera to supplement my DSLR in places where a bigger camera might be harder to bring.  For that purpose, this camera works great.Some more specifics:The image quality is great for what it is.  The 2.0 aperture on the wide end is pretty good, but it closes down really quickly if you zoom in.  It's fine for taking pictures of food in a dimly lit restaurant if you want a wide-angled view (which I usually use), but the quick progression to F4 or so once you zoom in can be a bit annoying.  The low light capabilities of this camera aren't bad, and shots taken at 1600 ISO are certainly usable, definitely if you want to share the pictures via the web.  They also clean up OK in tools like lightroom.  Overall, the image quality isn't nearly as good as DSLR, but it offers a lot in a small package.The touchscreen is surprisingly useful.  I use it primarily to scroll through pictures in the view mode and also to pick a focus point when shooting a picture.  Being able to zoom into an image using pinch-to-zoom and then scrolling around with a touchscreen is pretty nice.The physical knobs are good for choosing options, and they are configurable as well.  I changed the settings so that the main dial deals with ISO and the small dial on the back changes aperture, and it works great.Overall, a solid camera for the money.  The image quality isn't the best, but it's good for the price and the size.", "Date": "June 29, 2013"}, {"Title": "Doesn't compare to the S95", "Author": "Katie", "ReviewID": "R1U2278BQF9SC3", "Overall": "3.0", "Content": "I was forced to buy this camera after my husband dropped and broke my S95 which I had loved and enjoyed for years.  The S110 was supposed to be just an upgrade of the S95 but with a touch screen and new wireless capabilities.  However, the image quality of the S110 is nowhere near that of the S95.  The white balance is completely off causing images to appear much \"cooler\" than they should and there was no way to correct this with white balance adjustment.  The photos that come out of the S95 were very vivid and crisp - those from the S110 were dull and the colors all seemed off.  I don't know what was changed between these two models to make such a difference in image quality but it was so noticeable that I had to send the S110 back because I was so unhappy with it.Additionally, I found the touchscreen to be more annoying than anything.  If you accidentally touch it when you don't mean to it changes your focal point and it is really frustrating.  There is no way to turn off the touchscreen feature either.I have read many reviews comparing the S95 to the S110 and read that other users were also frustrated with the white balance issue.  If you have the ability to get your hands on an S95 I would go for that or splurge for a G-series canon point and shoot.", "Date": "April 21, 2013"}, {"Title": "DO NOT BUY", "Author": "Kristin", "ReviewID": "R398NPCN2J2I9F", "Overall": "1.0", "Content": "I had this camera for less than three months with only moderate use and no damage when it just stopped working! I got a \"lens error\" message and the lens refused to retract. I had to ship it back to Canon (AT MY COST) for repairs and I have no idea when I'll get it back.", "Date": "March 19, 2013"}, {"Title": "So much packed into a small size, a mighty subcompact camera", "Author": "Ananda B.", "ReviewID": "R2KJT4GOW76RV7", "Overall": "4.0", "Content": "The intelligence that has gone into the design of the PowerShot S110 is immense. To use this camera well and get the best image quality, be prepared to study its dense 330+ page manual carefully. Then practice employing those features that are useful for you, (once you discover just what they are). This camera has major 'Geek' appeal as you uncover all its bells and whistles. It is worth the investment of time required to learn this camera. If you want only point and shoot simplicity, look at Canon's Elph line instead.", "Date": "March 30, 2013"}, {"Title": "Most Pocketable Advance Compact Available", "Author": "Shawn C.", "ReviewID": "R1VSOA2QVZ8GI0", "Overall": "5.0", "Content": "I tried few of the advance compacts, Sony RX100, Panasonic LX3, LX7, and Canon Powershot S90, S100.  Sony RX100 is the best in this category considering image quality and size.  Panasonic LX7 and many others are simply too big to be pants pocketable.  If it isn't pants pocketable, you have much better options in similar sized mirrorless cameras.  Nikon 1 and Olympus PM2 comes to mind.  Also, if it's too big, it can't be your always carry camera.  STILL, there is one issue with RX100.  RX100 is just too darn expensive.  It costs more than many of the entry mirrorless cameras.  It's fine if you are only getting RX100 for everything, but if you have multiple camera systems, like a DSLR and a Mirrorless system, then RX100 seems bit too much as you would probably want to use your \"portable\" mirrorless camera as well.  I don't want to spend more on a compact than my mirrorless camera or even a DSLR.  It will be for snap shots... for always carry type of thing.So, my only other option is Canon Powershot S series.  You can get S110 currently for $200.  S110 take great quality pictures for a compact camera.  I like the jpegs out of the camera and you are able to shoot raw as well.  The new touch screen on the camera is very useful.  Now, it doesn't have all the controls in buttons and dials.  Many of the features are in the menu or quick menus options.  I can live with that since I bought it for convenience for snaps with \"better\" image quality than my cell phone.  If you want a serious camera for photography that is portable, you really should get a mirrorless camera since compact cameras are compromise cameras.  LX7 has a great lens, but mirrorless camera has prime lenses that can easily beat it.  Sony RX100 has a great  sensor but even Nikon 1 with their prime lenses can beat it in my opinion as I own them together before.  (Nikon 1 with 18.5mm f/1.8 lens can get sharp images with decent bokeh compared with Sony RX100, and it has DSLR like af speed and incredible burst rate.)  Canon Powershot S110 is perfect carry everywhere truly pocketable camera.  There is nothing better in this size.  Again, there is nothing better in this SIZE.  Any bigger, just get a mirrorless as a jacket pocketable camera.  Sony Nex 3N and Olympus PM2 are very jacketpockable.  Nikon 1 J1, J2, J3, S1 of course is another option.  As for a \"compact\" camera, Canon Powershot S beats others in terms of price, convenience (no lens cap), size, features (touch screen), and has similar image quality as other \"advance compacts\".One more thing, the wifi on S110 is pretty useless.  You have to be on wireless network to share pictures with you phone or tablet wirelessly.  That kind of defeats the purpose if you are outdoors.  Also, no remote shutter or view finder capability as with Samsung cameras.  If you won't use the touch screen, S100 with GPS is probably better for you.  As for me, I like the touch focus feature on S110, so I went with S110 over other Powershot S series.  (Also S95 has 28mm wide versus 24mm on S100 or S110)  Well, here is it.  If you have other systems and want truly a carry everywhere camera, Canon Powershot S110 is as good as it gets.  If you are looking to get one compact as your only camera because you will never carry multiple lenses, LX7 or RX100 or other bigger advance compact may fit you better with more buttons and dials.", "Date": "March 15, 2014"}, {"Title": "Just great!", "Author": "Detroit4ever", "ReviewID": "R213W1ZP1XKG2R", "Overall": "5.0", "Content": "This S110 is a great camera to have.  It is a pocket camera with a lot of features.  What I love most about it is its low light abilities in stills and video.  I don't like using a flash for indoor shots, and with the S110 you don't need a flash in most cases.  High ISO settings are very usable with little noise.  Low light video quality is hard to beat - I had a M4/3 with a MUCH larger sensor and the low light video was terrible.  The S110 takes wonderful pictures.  I have a larger super-zoom (with a marginally smaller sensor 1/2.3) that I use for bright light situations and when I need a longer reach.  Honestly, because of the size and image quality of the S110, I often use it more.  I debated the need to having 2 cameras, but the combination I have make sense at a lower cost vs owning a DSLR with the need for multiple lenses.  If you want a portable camera with great image quality and a variety of settings, this is the camera to have.", "Date": "January 12, 2014"}, {"Title": "Incredible in low-light", "Author": "Max Nealon", "ReviewID": "R3TLYM22F26Q13", "Overall": "5.0", "Content": "I bought this for a recent trip to the UK.I already have a G12, 40D and 20D, but wanted something that was easier to pocket and travel with.There are two things that I did not like initially - the touch-screen seemed to attract my tight thumb, forcing focus onto the top right corner and the battery looked rather small.Both became non-issues.The focusing was fast and accurate and once you train you thumb to non-overhang the the grip area, all is good, the battery life seems to be a few hundred shots.The camera performed beautifully on my trip - the controls are intuitive, the image quality is excellent.But to me, the real stand-out is the low-light ability. The combination of the sensor and the IS means that you can shoot in close-to-darklenss and get an amazingly good shot.I am very happy with its abilities...", "Date": "December 24, 2013"}, {"Title": "Very satisfied", "Author": "Sam", "ReviewID": "R2PI2XJBHBDIVM", "Overall": "5.0", "Content": "I will leave the long, detailed and technical reviews to others.  I am not a professional.  I do have a Canon 50D and a 5D Mark II with more lenses than I like to admit and I fancy myself as a competent photographer.  A few years ago I gave my S90 (which I enjoyed immensely to my son.  When he was married a couple of years ago I was the wedding photographer and did a pretty good job with all of my \"professional\" equipment/lenses, etc.  He and his bride went to England for their honeymoon.  As with most younger people today they traveled light and carried his S90.  The pictures he came home with reminded me of just how good these little cameras are.  I was headed out to California for a visit recently and I didn't want to carry all of the big equipment so I bought the S110 (the S120 was available, but for almost $200 more I simply couldn't justify the cost/benefit of marginal upgrades).  As most of the reviews note, the video is amazing!  And, the photos are good right out of the box.  Battery life is somewhat of an issue, but it is a simple matter of carrying a backup battery and the secondary battery from STK filled the bill at about $14 and works fine.  I highly recommend this camera.", "Date": "December 19, 2013"}, {"Title": "Glad I chose this over a different unit", "Author": "David Smith", "ReviewID": "RADKBRLMPC3QO", "Overall": "5.0", "Content": "I was looking into a similar-spec'ed unit from another brand so I could replace my wife's aging point n' shoot, but my photographer buddy kept telling me this camera was better based on the size of the image sensor and misc. other bits n' bobs. I can't speak to major distinctions between cameras but, I can say that this camera has so far exceeded my expectations. This thing has a glut of features I'll probably never use but I can say with assurance that the image quality is fantastic even in lower-light situations. Also, the movie mode is pretty awesome. I really wasn't thinking that buying this unit would be like picking up a camera and camcorder in one unit but it might as well be.", "Date": "August 20, 2013"}, {"Title": "great images", "Author": "Cristopher Carter", "ReviewID": "R2K6POA1RSA5EO", "Overall": "4.0", "Content": "love this camera.It takes amazing photos. bought it to upgrade from the s90 that I still love.yes the wifi is a pain and not the easiest to connect to and use. if that is your main reason to get this camera then look elsewhere. but it shooting in RAW format and having the option of manual control is high on your list plus great photo images then look no further.", "Date": "July 27, 2013"}, {"Title": "Phenominal for me.", "Author": "William Palazzo", "ReviewID": "RC3X2228CMUEF", "Overall": "5.0", "Content": "This is the very best point and shoot camera I ever owned. Amazing pictures and I am still learning all the advanced features. The pictures and video when hooked up to my TV are just extremely outstanding in quality.", "Date": "July 7, 2013"}, {"Title": "Another Canon winner", "Author": "L. Freeman", "ReviewID": "R3I0RMO1OKG8NC", "Overall": "4.0", "Content": "Great size.  Great touch screen.  Photos are large and brilliant.  We have had many Canons and this does not disappoint.  The next variation is supposedly coming out this fall of 2013, but I opted for this model in time for a recent family vacation.  It proved its worth, like almost all our Canons of the past.  My only complaint is the battery life.  I think between the photos, videos, and running the touch screen, I'd estimate our battery life is a 1/4 to 1/2 what the Canon we replaced was (SD790).  I have also used the wireless feature and it works great... but still find myself connecting via USB out of habit.So, other than a noticeable shorter battery life, this camera does not disappoint.", "Date": "June 4, 2013"}, {"Title": "Good pictures for a P&S;, some user issues.", "Author": "OT \"OT\"", "ReviewID": "R14O5RIXNU7Y95", "Overall": "4.0", "Content": "Canon S110! I haven't had a Canon brand point-and-shoot since an Powershoot S10 failed me on numerous occasions, including on 911 and on a few job surveys.Due to overwhelming recommendations I chose this model S110 to supersede my third Samsung camera. This Canon has a touch screen and a sturdy body. The buttons are relatively easy for me and nothing has accidentally turned on by rubbing against things in my bag.Generally I'd say this is a very nice camera although a bit pricey above $300-I have no comment on the wireless function. The pictures are clear and the camera is fast. I like that!I am not going to comment on general specs that you can find out on your own. But rather a few personal experience issues that may or may not matter to you, especially since you're probably much smarter than I am:1. Why is there a zoom button on the lens and another zoom button on the shooter button? Why are there two buttons doing the same thing? The one on the lens looks kind of cool but is ergonomically lacking and not any better than the small one. On custom settings it does work for aperture and such, but I do that on my larger camera. Still getting used to this.2. I do have a big problem with the battery. To me its is far more important than the wireless stuff. These days so most peripherals plug in AND CHARGE via USB. This Canon has a separate battery charger like the P S10 from 1999, and you need to open the body and take out the battery, put it in a charging saddle and put that in the wall. Okay. And instead of it charging when plugged into USB, it drains if on the USB and is turned on. This is outdated by many years. Uploading the photos via USB should mean replenishing battery power. Seriously! Yes this is very annoying and cumbersome and I really don't need or want more chargers (junk) around the house or on my trips.3. My fingers keep accidentally pressing \"stuff\" on the touch screen.4. The flash pops up under an ergonomically natural finger position where I'm holding the camera. I turned it off altogether, since the camera is great in darker areas anyway.5. The finish of the body is slippery and have come close to dropping it a few times. I am not the type to drop things like this, and I never liked having a wrist chord on my cameras.Reading the reviews, I am concerned about a future lens failure, especially at critical moments. Because that is when they occur. I naively expected Canon to have repaired this issue from the S100 model, -which is why I didn't buy the S100. Buying a product from a reputable company should not be a roulette and I wouldn't mind some comments on that one.I am also a little annoyed that this camera feels (to me) a bit overloaded with gadgetry. A somehow simpler camera is more desirable, and a on/off button for the touch screen would be helpful. I wonder if the battery would last longer that way.But hey. It shoots great pictures for a P&S; and so far I have had good luck with the video, minus some focusing issues when on the move. Another reason why I chose it: 1920x1080-H.264! Tripod preferred and gives you great results.Generally the function buttons are fine to use and well thought out. The on/off button takes an effort -which prevents it from accidentally going on. Good thinking, Canon.Canon makes nice cameras and I have an old 10 Rebel and the HV30, both great and lasted a long time.*** Update 6-25-2013. Whoops! My daughters last day at school and the camera is dead and says to charge the battery. I foolishly left it plugged into the computer the day before uploading a lot of work photos. I'm so used to things charging that way. Either its foolish me or foolish Canon designers. Take a pick. Missed pictures at last day of school is how much? Half  a star? ;-)", "Date": "May 4, 2013"}, {"Title": "4 star for image & 3 star for video qualities", "Author": "A Customer", "ReviewID": "R1TOTAS1A2UZ2N", "Overall": "3.0", "Content": "The image quality is excellent for both day & night times.  But if the person / object is moving just a little bit, the photo would come out blurry.For the videos taken using Auto mode, I can hear the knocking sound of the Auto Focus clearly even when a person in the video is talking. When I zoom in or out, I can hear the hardware noise every clearly in the video. NOT RECOMMENDED.", "Date": "April 8, 2013"}, {"Title": "Great Camera! Prior Owner of s95", "Author": "sa", "ReviewID": "R2WR8214WD0Q7L", "Overall": "4.0", "Content": "This camera is a very nice improvement over the prior versions. I owned an s95 and really liked it but sold it planning to upgrade to the s100. Decided to wait and use an old Canon camera until this came out. I love the touch screen. Very nice for tapping to focus on a particular area or face as well as for playback of pics. You can zoom easily and flick to view the saved pictures. The wifi feature is really nice for transfering the photos to your phone or just browsing the photos that are located on the camera on your phone and deciding which ones to bring over. Nice addition Canon! Very sharp photos!", "Date": "December 2, 2012"}, {"Title": "This is a Gadget!", "Author": "Krishnan", "ReviewID": "R1QTGZRCAAUS6S", "Overall": "5.0", "Content": "Canon Powershot S110 is a cute, sophisticated, palm top camera with all features like quality pictures, 5x zoom, FULL HD Video, wifi etc.This is a gadget.If you are looking for a decent camera which is smaller than your shirt pocket, then this is it.Here are the key features of Canon S110.1. Solid body with attractive design. Very sophisticated look.2. Amazingly small size which is smaller than a standard shirt pocket.3. Flash auto feature automatically pops up like a robot whenever low-light detected.4. Very intelligent rough surface to avoid slipping the camera out of your hand.(Sony RX100 could easily slips off your hand).5. Decent quality pictures. (Sony HX50V pictures when zoomed, quality deteriorates).6. Touch Screen. Amazing!7. This is Canon, the branding.Battery life is okay for most family usage. If you take plenty of videos and photo continuously, then you maycarry an extra battery. Memory card you need to buy extra. I bought a Sony 32GB one which is enough for normalfamily photography requirements.If you are looking for a camera which gives quality pictures for both standard and high zoom,then you may need to go for large size cameras. Canon Powershot is a camera which givesthe quality of large camera, at the same time you can put it in your pocket and noneed to carry the huge stuff all time. 5x zoom is enough for most family photographs.There are small cameras which can zoom, eg. SONY HX50V, but the quality of images when zoomed on PCis disappointing. Sony HX50V is good for wildlife/nature photography. Also, its largerthan Canon S110. Not good for shirt pocket, but can put it in your pants pocket.The reason I bought this camera is that I don't want to carry a huge camera always with me, butat the same time, I need the image quality of a large camera.Summary:Canon PowerShot S110 is a very intelligently designed camera with sophisticated looks and great body design, cute and tiny camera,with auto popup flash, 5x Optical Zoom, even more zoom digitally for both still and HD Video,rough surface to avoid slipping out of your hand, WIFI and even touch screen!", "Date": "August 24, 2013"}, {"Title": "Fantastic small camera", "Author": "Kelly", "ReviewID": "RBBFO0AF8H1TX", "Overall": "5.0", "Content": "We just took this camera on a trip to Italy and were blown away by what it was capable of.  Low light in the churches was not a problem.  Detail both from close up and far away was excellent.  We didn't figure out the wifi yet but I'm sure it is a great feature.  The touch screen was really helpful too.", "Date": "July 27, 2013"}, {"Title": "takes pictures", "Author": "Alex \"Alex\"", "ReviewID": "R3DBO8RCAKOQSF", "Overall": "5.0", "Content": "This camera is pretty ridiculously awesome. Takes great night pictures and has lots of very good modes for image capture. Not sure about the video yet, but the images come out very vivid and crisp. The camera itself is very fast to respond, however it chews batteries pretty fast. Luckily there are cheap batteries you could buy here on Amazon and elsewhere, and they all charge super fast, so i'd recommend getting two or three more for image posterity. This camera has the coveted HDR feature, naturally though, the camera has to be very still for the series of images it takes, so i recommend a small tri-pod. It takes a couple seconds then to combine them, like any other camera on HDR function. Haven't had any lens issues, but if i do i'll certainly post here about it.. that was my only concern when buying this camera. A lot of people complained about the flash popping out where naturally a person holds their left index finger on the camera; hindrance at first, but with a little brain effort it isn't that difficult to simply not put your finger on the one tiny spot anymore. So far i love this camera. If something changes i'll complain to the messes here.UPDATE:Have been using this camera for about 4 months now. Still love it, still use it excessively and still burn through a battery a day. One thing to note after much experimentation: the sound that's recorded when zooming in and out. It's there. So if you're planning to make movies with this thing, reconsider, the zooming sound is pretty annoying. It's still amazing for picture taking though.", "Date": "January 2, 2013"}, {"Title": "How to choose among \"enthusiast compact cameras\"", "Author": "James R. Asker", "ReviewID": "R23C4X9O0HHMA7", "Overall": "5.0", "Content": "I have an S90, the predecessor of this camera, and I love it. It's a wonderful machine. I'm sure the S100 and S110 only improve on it. However, if you are in the market for a highly capable, very compact camera, be aware that there are some other outstanding competitors today. I was looking for the very best digital camera that I could easily put in a pocket, when I bought my Canon. It was very tempting to bend that \"pocketable\" requirement for a little more capability in another parameter, but my approach was that if it wouldn't easily go in my pocket, I might as well use a DSLR and get the greater speed and flexibility of a bigger camera with interchangeable lenses. So, keeping that in mind: if I were looking to buy a truly \"pocketable\" high-end camera today, I'd also look at the Fuji XF-1 and especially the Sony DSC-RX100, but not cameras like the Canon G15, which is a wonderful \"compact\" and in significant ways \"better\" than the S110 but won't fit in a normal pants pocket. The thing that is intriguing about the RX100 is that the sensor is much larger than the one in the S110. (The RX100 is also considerably more expensive, however.) Sensor size is a much more important driver of quality and versatility than the number of pixels. My advice is pay attention to sensor size and the lens; ignore megapixels. A great resource to help you decide is DPReview.com, a fount of all sorts of information on digital photography. Search \"enthusiast zoom compact cameras\" for their roundup of the entire field.", "Date": "March 29, 2013"}, {"Title": "Works great but...", "Author": "Hardright", "ReviewID": "RTIXSD6XXFNO6", "Overall": "4.0", "Content": "It is supposed to be better than the S100.  Well it is if you talk about the quick auto focus.  But battery life is still a problem.  Doesn't last me 2 dives.  Would have given it 5 stars if not for the battery life.Oh yes, I have an underwater housing for this (Ikelite) and it works very well.", "Date": "December 5, 2012"}, {"Title": "Love it!", "Author": "n. kamm", "ReviewID": "R23S0GH9LNMKFY", "Overall": "5.0", "Content": "I'm not going to touch much on the quality of the photos/videos this camera takes because it's simply beautiful. I was even able to capture a decent photo of Aurora Borealis. So here are some other highlights.I owned the S100 for a while but lost it while I was traveling so replaced it with this S110. The one major complaint I had with the S100 was that it had a very slow response time when using flash. So slow that when I would ask strangers to take a photo for me, I'd have to explain to them each time that they need to hold the shutter down for a while (on average 3~5 seconds). With the S110, however, it's significantly faster. It works like how it should (on average <1~2 seconds).It also takes better pictures under low light conditions (without flash). Even when capturing against the sun in the background, you can still clearly see the person's face (where normally it would be too dark).Wifi Capability - The wifi capability is SO useful. I don't even care that they took off the GPS geotag that they had in the S100 (because it didn't even work that well to begin with). The built in wifi doesn't mean it connects to a wifi hotspot. It BECOMES the wifi hotspot for your devices (phone, tablet, etc) to connect to. It allows you to use your phone's GPS to geotag each pictures taken by the camera. The best feature about this that I absolutely LOVE, is that it lets me transfer my camera photos directly onto my device through this wifi connection (very fast, too). This makes photo sharing SO much easier. For example, I can take a photo of a waterfall with my camera, then transfer it onto my phone, then upload it or email it to someone right ON THE SPOT, while I'm still standing in front of the waterfall (as long as I have phone reception).Underwater Housing compatibility - I have an underwater housing for the S100 (Canon WP-DC43). I did not want to purchase a new one for the S110 because they cost almost as much as a brand new S110 on Amazon. Great news is that the underwater housing for the S100 works just fine! The only thing is, the power on/off button does not align. All of the other buttons work fine. You can get around the power button issue by pressing the photo review button to turn on the camera and pressing the shutter button to take photos, and make sure to adjust the automatic shut off time (not to waste too much battery) to let it turn off on its own.I love this camera <3I think one complaint I might have though, is the power on/off button. Why the heck did they shrink it so small? It makes it difficult to turn it on/off when wearing gloves. Oh well it's still manageable.", "Date": "April 7, 2014"}, {"Title": "Screaming good deal!", "Author": "Ellsworth Toohey", "ReviewID": "R13CZRLRF5KUW0", "Overall": "5.0", "Content": "This is a very nice, good quality point and shoot camera for everyday carry. I have owned earlier versions and have passed them on to family members wanting more than iphone quality photos.  At a little more than 200, this is a very good camera for the money. It will require you to spend some time learning the capabilities if you want to use it to its full potential. Read the instructions and don't beat it up too much and your time and money will be well spent.", "Date": "January 10, 2014"}, {"Title": "What a gem!", "Author": "Dr. Siri Jodha S. Khalsa", "ReviewID": "R18IXQX20FS6I1", "Overall": "5.0", "Content": "This replaced an elph500HS that was stolen. I love this camera - both the creative flexibility it allows and the power of its auto modes. Unlike the elph500, access to the shutter and aperture priority modes is easy, as is bracketing. The high-dynamic range feature is great - despite what the manual says it can actually be used without a tripod (if you have a steady hand). Yea, battery life isn't that great (the elph500 had a bigger battery, why did they skimp on this model?)", "Date": "September 14, 2013"}, {"Title": "Just love this camera! Bright lens (f.2.0) makes the difference when comparing to other cameras.", "Author": "E. Nakahara", "ReviewID": "R2ISAT27A3NG2K", "Overall": "5.0", "Content": "I was a very happy owner of a Canon S90 for more than four years and had no plans to replace it, because it is a very well constructed camera, make very nice pictures (bright lens, f.2.0) and never had any problem. But after being robbed, this was my obvious choice, and I have no regrets. The only thing that disappointed me was the WiFi feature (not really easy/practical to use). Also, Canon did not provide the MiniHDMI to HDMI cable as part of the package contents, and changed the model of the battery/changer (almost the same size as previous models, but not compatible; not sure if the specifications improved in this model).", "Date": "June 4, 2013"}, {"Title": "Great Point & Shoot with manual mode and smart phone transfer", "Author": "dh80", "ReviewID": "R5585ZA0JMLER", "Overall": "5.0", "Content": "This is a great point and shoot camera. I'm a professional photographer, but wanted a small portable point and shoot for personal use. I'm very happy with this purchase. I haven't used the video on this camera yet, so my review only relates to the camera capabilities.Things I like most include intuitive manual mode operation, smartphone transfer, touch screen focus point setting.Pros:Aperture capability of up to 2.0ISO capability of up to 12,800. Very usable at 3200 and 6400 ISO.Easy to use manual controls (easy access turn wheel for shutter speed and aperture, push button for ISO)Live View exposure adjustment on screen using manual modesEasy focus point adjustment (touch screen to change focus point)Small and portableSmartphone (and other device) transfer. Transferring to my iPhone is a breeze.Auto mode exposure is good.Cons:I really haven't found any cons yet. If you buy this expecting point and shoot performance, you'll be very happy. If you buy this expecting DSLR/SLR performance, you'll be disappointed. This is a 5-star point and shoot camera.", "Date": "May 13, 2013"}, {"Title": "Good shirt pocket camera.", "Author": "Slamron", "ReviewID": "R258GOI77VOSTS", "Overall": "4.0", "Content": "I bought it for my wife. I use it when I don't feel like logging my Nikon D600 with heavy Zeiss lenses.I would have loved it even more if it had an electronic view finder. The screen is barely visible when the sun is behind you.Otherwise it take well balanced pictures.", "Date": "May 11, 2013"}, {"Title": "Excellent Image Quality in and Incredible Small Package", "Author": "Paul Mejia", "ReviewID": "R25M9NDG75U3E3", "Overall": "5.0", "Content": "For starters I am a Nikon person.. BUT when it comes to P&S; Cameras my choices have always been Canon, I had many Nikon,Olympus,Panasonic... but Canon's always has the best image quality over all.The Canon Powershot S110 does not disappoint, It has a simple look, fit's easy in a pocket, it's super fast to start up (less than 2 seconds!!), strong flash and very smart features.This model allows you to transfer images to your phone,Ipad or PC without the need for cables all via WiFi. touchscreen is a nice feature but I don't use it much since i still like the little wheel in the back, plus the ring around the lens can be assigned to do different things that suit your needs ( I use it to select between JPG,RAW, or RAW+JPG ) Did I mention it shoots RAW!!?.Battery life is OK, not great but OK.. I do have multiple batteries that fit this camera ( I had the Canon SX200IS which this replaced and uses the same battery). I will recommend buying a spare or 2.The body is rough so it does not slip out of your hands but I always wrap the lanyard on my hand just in case ;)I am happy with the purchase I am sure you will too, the image sensor is larger that the average P&S; on the market this also adds to better image quality.", "Date": "March 16, 2013"}, {"Title": "funny usability, great pictures", "Author": "who", "ReviewID": "RJ6REHGWDTQNB", "Overall": "4.0", "Content": "Like the earlier reviews described, there are multiple usability aspects that leave a bit to be desired. The pop-up flash is precariously located - anyone using this camera for the first time is likely to feel the sudden jutting flash letting you know where not to put your left index finger. Other than that, the touch screen seems to have a reasonable amount of basic functionality. The dials are standard - I'm guessing they'll work on getting the touch screen/buttons/dials all worked out better in the next version.What was most important to me was photo quality and all my more photographically inclined friends insisted on canon recommending this camera or the S95. My initial impressions - the photos are great. Low light auto seems to be quite good. Also, it is reasonably fast to focus, and the colors are vivid. I don't know much about the battery life yet. I'll be updating this review in a few months after I use it more, but as of now, I am happy with the product in spite of the high price for a point and shoot..", "Date": "January 2, 2013"}, {"Title": "Still Not as good as S95, Head to Head Comparison (Update)", "Author": "Tech Reviewer", "ReviewID": "R1FRATW6QWB02F", "Overall": "4.0", "Content": "Originally bought this to replace my wife's S95 after it was stolen. We both had S95s; so after seeing some of her pictures with the new camera and not being very impressed, I decided to do some head to head comparisons. What I found was that the S95 was consistently sharper, had deeper and more accurate contrast, was brighter and somewhat more saturated than the S110. So we are giving away the S110 to a family member and I ordered a S95 for my wife. If you need the bells and whistles, it takes pretty good pictures, but if you are mostly looking for image quality, the S95 is excellent.Update Nov. 25 - Thanks for the comments about making the comparison on pictures downloaded to the computer, not by comparing the LCD screen in max resolution. After redoing the comparison with downloaded pictures at 100%, the sharpness seems to be about the same, a bit less noise on the 110, but the colors were noticeably more accurate, brighter and more saturated and contrast was better on the 95. Verdict- still giving away the s110 but giving it one more star than originally.", "Date": "November 19, 2012"}, {"Title": "Not so good low light - shutter cover fails", "Author": "Jones \"Bookman\"", "ReviewID": "R16CHN2INHNWQ6", "Overall": "3.0", "Content": "I have always loved Canon point and shoots.  In fact my best pictures have been with my original Canon S400 and/or my DSLR.  I purchased the S110 as an upgrade and expected better shots.  Outdoor photos in good lighting and also videos turn out great.  However, the camera can't take decent low light pictures, hardly anything great indoors.  BUT the worst thing is that literally 3 days after receiving this camera, the shutter cover on the outside of the lens failed to open.  This is a huge defect.  Three days??  Common.", "Date": "August 12, 2013"}, {"Title": "Nice Travel Camera", "Author": "Jay T", "ReviewID": "R2517H35QT2GZF", "Overall": "4.0", "Content": "Overall, I've been pleased with this camera. I just used it for a week in Florida/Disney World (left the camera gear at home), and the results were pretty good. Maybe a little soft, but nothing too noticeable. I took quite a few outdoor low-light shots - and those turned out great.", "Date": "June 7, 2013"}, {"Title": "Canon S110 Powershot camera", "Author": "fairweather", "ReviewID": "R215BKEXTZIS25", "Overall": "5.0", "Content": "This camera does everything.  It is extremely capable and if you are not simply using it as a point and shoot camera can be confusing at first for the novice.  For those into photography, changing F-stops, shutter speeds, focus, etc.  this camera does it all.  I have a 32 GB memory card installed.  Tons of room for photos, videos, etc.  One great feature: from turning on the camera to snapping a pic-- less than three (3) seconds.  Extremely small profile, easy to carry, very light.  Touchscreen, wifi, and 5X zoom, auto macro built-in..  Shoots in RAW format for you pros.  Use it as a carry anywhere/anytime camera.  Only drawback I see is battery drain time if you are uploading wifi videos or pics--get an extra battery to go along with this camera.  I've had it for about a month now and love it.", "Date": "June 6, 2013"}, {"Title": "Stick with the older model S95", "Author": "RoadRunnerz", "ReviewID": "RIPNFD5VHMAW8", "Overall": "2.0", "Content": "I purchased the Canon S95 for my mom several years back. It was a great camera and although she normally just uses it in auto-mode, the pictures are amazing quality. I recently was in the market for a similar small camera and thought I would try the new Canon S110 out.I was extremely disappointed at the low picture quality when snapping shots in auto. Things were blurry and out-of-focus. I changed to manual mode and it seemed to make things better, but not having a dependable auto limits the usefulness of a camera.I returned this product and opted on buying a used Canon S95 through Amazon Reseller. I am very happy with it and saved about $120 over the S110.", "Date": "August 3, 2013"}, {"Title": "CANON PS S110", "Author": "Click \"mrmanny\"", "ReviewID": "RB2BV7RGY8AYL", "Overall": "1.0", "Content": "Two days old, 18 photos and then LENS ERROR. It is intermittent but cannot be trusted to work when you want to take photos so it goes back to the vendor tomorrow. Guess it will be Nikon if you want the larger 1.7 sensor.", "Date": "June 8, 2013"}, {"Title": "one of the best travel cameras", "Author": "J. Bedard", "ReviewID": "R2WYWBRXIDVOLS", "Overall": "5.0", "Content": "I took this camera with me on a one-month trip through Europe last summer. I used it in all kinds of situations and it performed excellent. I have received many complements on the night-time photography done with a tripod.", "Date": "April 6, 2014"}, {"Title": "All the Right Camera Traits", "Author": "Andi C Bair", "ReviewID": "R3IOID49CLZ736", "Overall": "5.0", "Content": "Canon S110 has a lot of functionality in a small box. Let me use my usual disclaimer, in the interest of fairness, and admit that many cameras by reputable makers (and there are many) deliver what they promise. It is more about what camera traits you are looking for. So, I would suggest to anyone looking to buy one to google 'camera trait search' and get the lay of the land.The S110 is a fixed lens camera (point and shoot, some would say), with 12.1 resolution (megapixels), and x5 zoom. Probably the most important point for this class of cameras is the sensor size, which is 1/1.7 inch CMOS-type. That is just a number, but one that matters. Most point and shoots have a 1/2.3 inch sensor, which is a couple of steps worse than the S110.It does not have a viewfinder, which many in its class don't. The ISO rating is 12,800 which makes it work better in low light. The video is a Full HD- that is 1980x1080 resolution. The camera gives you the option to control manually both the exposure and the focus. It does not have a hot shoe for an external flash option. That is not unexpected for its size and category. The LCD screen is a 461,000 resolution touchscreen, and the burst rate- for fast action- is 2.1. This is not a camera for sports photography, but it will perform well in continuous mode. The camera also does RAW processing which would be useful if you did not want to be limited by JPEG storage only. And all this with a light camera weighing only 198 grams.Overall, great camera. Having been into photography for a while, I do stress though that you do a camera trait search. That will also tell you more about what you want.", "Date": "March 11, 2014"}, {"Title": "Great Camera Marked Down to a Bargain Price", "Author": "D. Higbee", "ReviewID": "RE1AHCAQKJP43", "Overall": "5.0", "Content": "Since Canon's Powershot S110 is \"last year's\" model, it's marked down to about half price.  This is a bargain, on one of the best prosumer-type cameras that fits comfortably in your pocket.  I had had a short relationship with the excellent Panasonic LX7, and came back to Canon when I saw the markdown.  Photo quality is excellent, exposures are correct even in tricky lighting, and the camera is way speeder than my old Powershot S95.  I find the dials and menus easy to navigate, and I haven't had to crack the manual.  It takes great photos whether you want to go all automatic, or whether you like manual controls.  At this price, you can't go wrong.By the way, I recommend the Flipbac FBG2 Camera Grip - it fits well, adds little bulk, and makes it much easier to snap photos with one hand.  Flipbac FBG2 Camera Grip for Point & Shoot Digital CamerasThe BUILT E-CE20-SBM Neoprene Compact Camera Envelope, Summer Bloom is a wonderful little case that has just enough room for your camera and an extra battery.", "Date": "January 23, 2014"}, {"Title": "Great Camera", "Author": "DFB \"consumer\"", "ReviewID": "R2J182QKA48SD6", "Overall": "5.0", "Content": "bought this because my phone camera no longer focuses. More than that, I find the phone camera cumbersome and slow to use.This is small and can be difficult to hold while shooting, but I keep it in my pocket, I wanted small. This camera offers 100% control of settings, and optical stabilization. PSAM and even custom settings can be saved. A dial around the lens that can be assigned manual focus, zoom, ISO and more.Great pictures, 12mg sensor (plenty for a 1/1.7 chip) .Just what I wanted. No need to replace my phone!TIP: turn it on/off with the 'play' button, not power. Get a LowePro D-Wrap.", "Date": "January 9, 2014"}, {"Title": "wide angle shots", "Author": "kaye", "ReviewID": "R8NRW7KCLSEGG", "Overall": "5.0", "Content": "I bought this about a year ago. It's not rugged but it's perfect for travelling as its wide angle shots really capture the scenery. It fell once, and the lens mechanism got broken immediately. But fortunately it was  still covered by Canon warranty so they fixed it for free.", "Date": "December 15, 2013"}, {"Title": "Small but mighty", "Author": "Rhonda Partin Johnson", "ReviewID": "R1NN5OJQ1769MD", "Overall": "5.0", "Content": "I own a 'professional' Canon 60d that is absolutely wonderful, but I wanted something I could slip into my pocket and just take off with. This little thing does the trick.  I'm sure there are other cameras that are 'cheaper' that will do a good job,  but this one functions like a DSLR without the drama.  It does an amazing job in bright light and absolutely incredible in low light. The colors are vibrant and subjects are distinct...even before editing.  Usually with a 'point and shoot' camera, I don't do much editing...I use them more for candid type pictures.  This little thing even does a great job in arena's where the lighting is usually awful for taking any pictures.  Concerts came out great...basketball games came out great, with uniforms showing true to color.I've owned this camera for 9 months now...so I've given it a true test.The biggest down fall to this camera is where the flash button pops up.  It's right where I hold the camera with my left hand.  I've gotten used to it but if I hand the camera to someone else to take a picture that I'm going to be in, there finger 'holds down' the pop up flash.", "Date": "December 15, 2013"}, {"Title": "Best compact camera for bicycling and traveling", "Author": "Benjamin Slivka \"Ben Slivka\"", "ReviewID": "R1AL8WAU78XVWP", "Overall": "5.0", "Content": "I bought my first digital camera (an Olympus D600-L, 1.2mp, 3x optical zoom, ~$800) in 1997.  The compact flash cards (giant by the standards of SD, let alone microSD cards) only held 12 or 24 exposures (shades of film), but the ability to upload them quickly to the web was such an improvement over film cameras.  I upgraded to smaller, higher-resolution cameras over the years, and bought my first digital SLR in 2002 (a Canon D60): which produced fantastic images with almost no shutter lag.  But all of these cameras were a bit bulky (especially the SLR).The I bought a PowerShot S95 in August, 2010.  What a delight!  Small enough to fit into my shorts pocket or in the back pocket of my bicycle jersey, decent (10mp) resolution and zoom, and tolerable shutter lag.The S110 is a nice upgrade to the S100 (which I also owned) and the S95 -- a bit more resolution, a few more features (HDR) -- while still retaining the compact size, easy-to-use controls, and great image quality.I did some side-by-side shooting comparisons between my most recent SLR (a Canon 40D) and the S110 -- and the S110 photos are better (the only advantage the SLR has is zero shutter lag and snapping of a series of shots).I may never use an SLR again.", "Date": "October 29, 2013"}, {"Title": "Awesome", "Author": "Sooganthy Nadarajah", "ReviewID": "R3PUEN5AFGTAST", "Overall": "5.0", "Content": "I bought this after trying several point and shoots. Nothing comes close to this one. The Image stabilization along with the quality of the photos are quite close to  my husbands DSLR ones. Am extremely happy with this product.", "Date": "October 2, 2013"}, {"Title": "Performs as Expected", "Author": "Robin L. Bring", "ReviewID": "RYH51DBNXGCCH", "Overall": "5.0", "Content": "Takes great pictures; compact; easy to use . . . totally pleased.  I can tuck it in a pocket or my purse and be assured of having a good picture of the unexpected sight or event.  I do not carry a cell phone, certainly not a smart phone, so this is a good fit for my lifestyle.", "Date": "August 14, 2013"}, {"Title": "Great pictures and HD video", "Author": "Maria Ferguson", "ReviewID": "R22ZS8K66F7TN8", "Overall": "5.0", "Content": "I own a Nikon D-60 with a Nikkor zoom so I'm used to great pictures.  Because of plans to take my Grandson to Disney, I decided I didn't want to lug around the Nikon, it's heavy.  I've always loved Canon camera's and printers so decided to give this one a try.  I love it.  It is amazingly lightweight and small but the pictures are honestly almost as good as the Nikon.  The zoom naturally isn't as good for far away shots but for up close shots zoomed in, it's superior.  The HD video is superb better than my Canon CMOS pro.  I sure I will get some amazing shots of my Grandson at Disney.  I recommend buying a few extra batteries as these run out pretty quick.", "Date": "May 7, 2013"}, {"Title": "Piece of crap died in 2 months", "Author": "A. G. Tzelepis", "ReviewID": "R1SCNR5IT9YW7M", "Overall": "1.0", "Content": "\"Lens Error\"Just like the \"legendary\" S100, S95, etc.Do not buy this garbage.Now Amazon says I can't return it because it's past 30 days? A $400 goddamned camera dies in 2 months and I have to jump through hoops to get my money back.", "Date": "April 26, 2013"}, {"Title": "PowerShot S110", "Author": "JL", "ReviewID": "R2I7XYC8M8RZEB", "Overall": "5.0", "Content": "This is a great little camera takes excellent shots low light shots and the videos it takes are high quality as well.", "Date": "August 19, 2013"}, {"Title": "Couldn't any happier", "Author": "mhemling33", "ReviewID": "RWW7MVJ141A20", "Overall": "5.0", "Content": "So far the camera has done everything I could want of it. I am no photographer I just wanted something a little nicer then your average point and shoot and this worked out perfectly. I have even started to mess with manual setting and I am really impressed about everything it can do. It's ability to act as a wifi hotspot so you can link your phone/tablet to it and send pictures is actually really nice since they can't take the memory card like a computer. The video quality is excellent and the picture quality is better then I imagined. If you are an average person looking for something a little nicer grab this you wont be disappointed.", "Date": "July 7, 2013"}, {"Title": "Powerful, compact, incredible camera. We LOVE it!", "Author": "Randall A. Juip", "ReviewID": "R25F6J7XB581DE", "Overall": "5.0", "Content": "I have owned three cameras in this family - the S90, which was replaced by a newer, shinier S100, which was the victim of some clumsy stair negotiation, and now, this model, the S110. They were all fantastic cameras, but after about 1000 pictures, I have to declare the S110 the best yet.It's sturdy. Compact. And its amazing. It helps that I'm photographing my gorgeous wife and amazingly beautiful children, but even when I'm shooting landscapes, crowd shots or self-portraits(!), the shots turn out amazingly well. This camera is so good, and the images are so rich and colorful that, after I batch import my shots from the S110 and my Canon 40D into my computer, I have a difficult time telling which camera shot which pictures.Canon is consistently producing well-built, sturdy, competent cameras. The S110 is no exception to this. You'll never be able to fit a full DSLR into your back pocket, but fret not! With the S110, you'll be in good shape anyway.", "Date": "February 26, 2013"}, {"Title": "Very good point and shoot.", "Author": "Happy camper", "ReviewID": "R261LPK2MMYLMK", "Overall": "4.0", "Content": "Given how good the phone cameras are today and how much easier it is to use a phone as a camera since you always have it with you, a point and shoot has to do some things significantly better than a phone to be worth bothering.Having an iPhone 5, the canon s110 does a few things better.  It does better in low light and allows for zooming. While zooming isn't critical since you can reframe things digitally afterwards, the s110 is still going to focus faster and take cleaner shots. Someday soon though, I don't think there will be much point in owning a point and shoot. It will be your phone or a dslr.", "Date": "January 3, 2013"}, {"Title": "Decent camera with cool features and some flaws, but ultimately outgunned.", "Author": "Jetmaker", "ReviewID": "R27AQISP3R0UE0", "Overall": "3.0", "Content": "I'd been shopping the Canon S110 versus the Sony DSC-RX100. I bought the S110 hoping it would be a good enough camera at its price point and save me the $300 price difference. I had it for a week and was generally pleased despite a few flaws, but the thought of the RX100 photo quality kept nagging at me. So I relented and ordered the RX100 and have made a thorough comparison conducting extensive side by side photo shoots. Though the S110 has some really nice features that make it tempting to keep, and also save the extra money, the RX100 photo quality exceeds it by such a large degree that I ended up sending the S110 back. The following is the summary of my comparison.The S110 is lightweight and easy to grasp. The button labels printed on the camera are larger and easier to read and the buttons themselves are larger than those on the RX100. It's menu system is intuitive and easy to use and is aided even more by the touch screen. The touch screen also enhances the photo-taking functions by activating a secondary function for the control ring when you place your thumb on the right hand edge of the screen. The wi-fi is a convenient time saver. However the app won't work on my Android tablet which was a big disappointment. Picture quality on the S110 is inconsistent. Auto mode produces photos that are overexposed, overly vivid, and the color tempurature far too much on the cool side. They are essentially unusable for me. You can get decent pictures in Program AE mode but you will need to play with settings to find what works best for you in given conditions. Even then you may be in for some post-processing work to get them \"dialed in\". Overall I feel my six year old Canon SD800IS produces equal or better results. HDR mode requires a tripod (or very steady hand) and does not always produce a good end results in-camera. Further post-processing is still needed. Battery life on the S110 is poor. It is made worse by the fact that the battery indicator gives little warning of battery death. It did leave me stranded with a dead battery once. You'll need spares with you at all times. The Canon software is very good and makes uploading easy and also provides excellent info on all the settings used in the photos.RX100 picture quality is phenomenally better than S110 in almost all cases. The only exception is in macro mode where the S110 is close (but the RX100 still better). The DRO and HDR functions on the RX100 are worth the price of admission by themselves by ensuring very good in-camera results. The low light capabilities of the Sony are incredible and in another league entirely than the Canon. The RX100 menu system is sometimes awkward, forcing you to push buttons or turn dials unnecessarily to scroll through options. It is also not as intuitive as the S110 so you sometimes have to use some trial and error to find the function you want. The screen is very bright after setting it to sunshine mode, and it has very nice resolution. It is noticeably better than the S110 screen. Due to its weight and large diameter lens the handing quality of the RX100 is not as sure footed as the Canon. Sony made an ergonomic blunder in putting the movie button beside the thumb rest which makes the thumb pad much smaller than it could have been, which I think would have greatly aided the handling quality. I prefer the smooth operation of the Sony function ring as opposed to the clunky detents of the Canon. The Sony software is good and has a couple of unique features but overall I preferred the Canon software.To conclude, the S110 is a very good integrated design package that has some cool features. Its battery life is a frustrating inconvenience. But its generally unremarkable photo quality and poor Auto mode seal its fate for me. The RX100 has stellar photo quality but is less refined in menu and handling than the Canon. The RX100 has a much better screen and battery life. Both have good software. The shortfalls of the RX100 versus S110 are minor. The S110 has the cool features of wi-fi and touch screen that are nice conveniences that one can ultimately live without. As an overall package for my needs and budget the RX100 wins even at the much higher price point.", "Date": "June 9, 2013"}, {"Title": "Lens & Flash failures", "Author": "Mamagiggles", "ReviewID": "R2S0PFRW8I6NVJ", "Overall": "1.0", "Content": "Great camera when it works. Had 2 lens failures where the lens motor dies. Had to send to service center in Va. Beach twice in 6 months. Flash just burned out last week and not covered. Avoid canon point & shoots. When you send them back and the repairs not covered, if you don't want to pay return shipping and labor to diagnose, they keep the camera, fix it then sell it as a refurb.", "Date": "March 8, 2013"}, {"Title": "Excellent", "Author": "Darcy M. Wilson", "ReviewID": "R3T5NU4NV8ZDVJ", "Overall": "5.0", "Content": "This camera is small and easy to use.  My daughter took it on a trip to Europe and returned with many wonderful photos.", "Date": "April 5, 2014"}, {"Title": "Canon Quality", "Author": "M Douglas Otten", "ReviewID": "R3B6ZP6Y24YAKN", "Overall": "4.0", "Content": "So simple and easy to use, compact and easy to carry. I use it for location scouting and my personal camera, then I don't need to take my professional camera into the field unless it is getting paid to be there.", "Date": "January 27, 2014"}, {"Title": "Nice Camera", "Author": "SYED ARIF RAHMAN", "ReviewID": "R21BWV88I9B533", "Overall": "5.0", "Content": "Good picture quality and HD video. Takes great picture in low light places with out flash. Perfect to carry in your pant's pocket.  When using flash, picture does not look good....", "Date": "January 9, 2014"}, {"Title": "Excellent camera", "Author": "Cybershopper", "ReviewID": "R21O4RY7C10NFG", "Overall": "4.0", "Content": "Got this at 219, a great price. This camera takes great pictures day or night, the auto mode works really well and has all the manual controls if you need it. Overall speed of the camera is more than fast enough. Wi fi is actually pretty easy...to your smartphone that is, haven't tried to connect wirelessly to my computer. The free canon gateway app is easy to use and downloading pics from the s110 to your phone is painless. Never tried using the video yet. Battery life seems weak as just taking 80 or so photos without any video already has depleted the battery half way. Wish the lcd screen resolution was better, but the touchscreen is very responsive and great to use. Overall though for 219 with a free memory card and case its an awesome deal.", "Date": "January 7, 2014"}, {"Title": "Great compact camera", "Author": "uL", "ReviewID": "R1OE03KR4CW7SJ", "Overall": "5.0", "Content": "Very small, fits in pants pocket. great pictures, even in low light. nice advanced settings (e.g., Aperture) not available in basic compact models.", "Date": "January 2, 2014"}, {"Title": "Awesome Camera", "Author": "Ali Moosvi", "ReviewID": "R2NYVK257I56TV", "Overall": "5.0", "Content": "I bought this camera with the objective of getting a decent Hi-Def video and  still pictures.  I have this camera for several months now and have used it both indoor and outdoors, day time and night time.  The night video I took recently at a wedding party with no special lighting far exceeded my expectations.  The daytime vidoe is fabulous. In fact, when I played it on my 1080p 70\" Sony TV, the video and quality was better than any of the Hi-Def channels I get on my dish newtworks.  This camera provides a true 1080p hi-def video quality Vs the hi-def TV channels that actually broadcadst a max of 720p resolution on dishnetwork.The still camera pictures are pretty decent both indoors and outdoors. It could be better if I spend some time reading the basics on what settings to use in various situations.I have seen videos and pictures from the bulky expensive SLR cameras taken by semi-professionals and when I compare them to the Canon S110 pictures/videos taken by me (an amateur),  I feel proud. My pictures and videos are equally good if not better at 1/3rd of the cost plus the convenience of carrying the camera in my pocket. It is hard to believe that Canon can pack so much video and still picture quality in a compact camera.This camera also has some other features that are nice such as WiFi, direct HDMI connectivity, etc.The only con is the flash location.  It is in located on the camera where you would normally keep one of your left hand fingers.  The first few times I was startled but once you get used to it you know not to keep your finger there.I will recommend this camera to anyone hands down.", "Date": "December 31, 2013"}, {"Title": "Nice size, good photos", "Author": "Roy E. Lachman", "ReviewID": "R1QV9QWSVFWDJG", "Overall": "5.0", "Content": "I was looking for a small point-and-shoot that took better quality photos than my lower-end point and shoot, and was quickly ready for new photos.  This has a large sensor, and does the trick.  Very good size--not too big to put in your pocket, but not so small it is awkward to use.  Only drawback--if it is that--is that it has a lot of features to choose from if you stray from automatic settings.  You don't have to learn them, but they are there if you want higher levels of control, etc. Remarkable how much is in a small package.", "Date": "December 31, 2013"}, {"Title": "Perfect Vacation Camera", "Author": "HappyBirthdayToMe", "ReviewID": "R1A6YXHRPMLVVY", "Overall": "5.0", "Content": "I like this camera so much.I'm a self-described camera fail in choosing camera duds over the years. I ordered this one a little too close to a much anticipated overseas vacation and consequently didn't leave myself too much time to learn all the features before leaving.This little pocket camera didn't disappoint, even just on the Auto settings at short notice. It captured all I wanted to and more. I was thrilled to not have been disappointed with memories of my vacation of a lifetime. The feedback on my holiday photos has been great from others. I even ended up with stellar photos taken from a window of a fast moving vehicle taken at a moment's notice.I had the chance to play around with a few features on vacation and look so forward to getting to know more.I love the looks of it with it's simple and basic design and not a lot of bling and complicated buttons and dials. For a plain looking little camera, it has so much capability.I suggest giving yourself some time to learn what it can do before an important event, buy an extra battery or two and a good case (which I did), and play to your hearts content.I can't wait to get to know this camera inside and out with all of the great features it has. Finally, for me, a winner.", "Date": "December 17, 2013"}, {"Title": "This is now at a great price in December, 2013", "Author": "M. Hale", "ReviewID": "R5UGC54KFF82Q", "Overall": "4.0", "Content": "Solid camera.  Now at a wonderful price.  I'm using is as a carry-around and also for digiscoping with a birding scope.  Works very well and very much well priced at 219.", "Date": "December 9, 2013"}, {"Title": "WOW!", "Author": "Debbie C.", "ReviewID": "R1CS7EV5XN7GDQ", "Overall": "5.0", "Content": "I love this camera!!!  It is so easy to use and takes fantastic pictures and videos.  I love the amount of zoom you get for such a small camera.  My son graduated from basic training and then airborne school (was my reason for a new camera).  I was able to take the camera with me both times.  I now have awesome pictures and was not weighted down by carrying a heavy camera around.  It's very user friendly and if you ever owned a similar camera you can almost figure out how to use it on your own.", "Date": "October 27, 2013"}, {"Title": "Good Camera for Photo, but very bad battery life, over heat on video", "Author": "Savann", "ReviewID": "R3VOR1GM1062WG", "Overall": "3.0", "Content": "I bought this camera for my family vacation, I have been a Canon user for all my life. This camera is one of the best point and shoot camera in term of photo quality, but very weak battery life. If you want buy this camera for video, you need to think twice, because of over heat issue.", "Date": "September 5, 2013"}, {"Title": "No more need for my Canon SLR", "Author": "S. Bagley", "ReviewID": "R7IOLK053N41T", "Overall": "5.0", "Content": "A few weeks before taking a trip overseas my other Canon PowerShot was dropped and you could hear a sound in the camera although it continued to take great pictures.  Not wanting to take the risk with a faulty lens I purchased this camera knowing I would be taking pictures in low light situations where the built-in flash wouldn't help the exposure.  This camera was able to handle everything with little to no manipulation from the auto setting (turn off the flash and let the fast lens do it's job).  Highly recommend.", "Date": "June 26, 2013"}, {"Title": "Great Camera, with new wifi functionality!", "Author": "Camilo Delfino", "ReviewID": "R265F7XNB3ODGW", "Overall": "5.0", "Content": "Great pocket camera, small size, big sensor and fast lens that make you able to do great night shots, and even play with some light painting with long exposure times!", "Date": "June 12, 2013"}, {"Title": "Excellent camera", "Author": "Redhead18", "ReviewID": "R1O69I9RHMF9B2", "Overall": "5.0", "Content": "High quality pictures for the price. The images are wonderful quality and the camera is easy to useand light weight. The battery charger is simple and easy to use. Not many wires to contend with.", "Date": "June 1, 2013"}, {"Title": "Great", "Author": "Alia", "ReviewID": "R3TGO1C5ENRFVD", "Overall": "5.0", "Content": "I haven't used a point and shoot since my 4MP Canon elph years ago. I was looking first for a compact camera that could shoot in RAW, which this does. It also has a full manual mode, which is fantastic if you're a DSLR user that isn't really accustomed to point and shoots, or just want a nice manual camera that isn't as large as your DSLR. The control rings are customizeable by function, and even the touch focus can be turned on and off . The screen is large and bright, and the photos are crystal clear (even when taking underwater photos  with the canon underwater casing). It has only been a couple weeks, so I have not used the wifi functions yet, but I could not be happier with this camera and the quality of photos.", "Date": "May 29, 2013"}, {"Title": "Great Little Camera", "Author": "Ryan Shimada", "ReviewID": "R10VFI1DEL2LX4", "Overall": "4.0", "Content": "Like the camera, good size took some great photos, and was allot better than I expected I would recommend it it anyone looking for a small camera with more control.", "Date": "May 28, 2013"}, {"Title": "Great Product", "Author": "Charly", "ReviewID": "R2Q3OLW4MPE7C8", "Overall": "4.0", "Content": "Its a great camera, I bought this to update my S95, I still havent notice big changes in quality of the photos but it definitely has a better look and new specs like Wifi and touchscreen, so far it has perform perfect.", "Date": "May 6, 2013"}, {"Title": "Would be perfect if wifi function and gps worked better", "Author": "staticantics", "ReviewID": "R3TBK5E84V7YRQ", "Overall": "4.0", "Content": "This is such a great camera. It performs awesome, gives me all of the manual and raw functions i want and need that fits in my pocket.Two gripes only.Unfortunately the built in WiFi functionality only works with Canon apps or direct to social networks via Canon's image sharing service.Likewise with the GPS. If you dont carry around your smartphone and do GPS logging with the Canon app on your smartphone, the GPS function is almost useless.I hold out hope that future improvements will make the WiFi better, but for picture quality and battery life, I'm a happy camper.", "Date": "April 9, 2013"}, {"Title": "Fast delivery excellent price", "Author": "Amazon Customer \"NutsoNutz\"", "ReviewID": "R3BVJ4SS4V5J8L", "Overall": "5.0", "Content": "I have owned and owe canon cameras. The s100 series hits it out of a \"ballpark\". Picture quality is great and manual function control reaches that of an SLR camera.", "Date": "January 3, 2013"}, {"Title": "When You Can't Carry a DSLR", "Author": "Stephen Gamble \"Music Maven\"", "ReviewID": "R14JVXYYYM8WRK", "Overall": "5.0", "Content": "This is an upgrade to the S100 which has been discontinued. The major concerns have been addressed with only slight annoyances remaining. I had the S100 and while it served me well after a coworker purchased the S110, I sold my S100 and purchased the S110. If you are a serious amateur to pro, the one rule is, you never go anywhere without a camera so if I'm out, this is on my belt and have caught some amazing images. At 12.1 MP I can post process up to 16 x 22 without loss of quality. I must emphasize I am using resizing software to accomplish that but is minimal resize and could go farther. My opinion is this is the best pocket camera on the market as I always do my research before purchasing. My suggestions would be to add a second battery, a belt carry case (if your a guy) or a case to protect if your a women. The screen protector: LARMOR by GGS Self-Adhesive Optical Glass LCD Screen Protector for CANON is great and there is a small pocket tripod that I cannot locate right now but very handy.Enjoy !!!", "Date": "May 15, 2013"}, {"Title": "Great pictures, easy wifi uploading", "Author": "Marcus Censor", "ReviewID": "R3HSY04H07JXAI", "Overall": "5.0", "Content": "Having owned the s90 and the s95, I knew to expect good things from this camera. It's the perfect compromise between portability and features. I have been especially impressed with the Macro focus shots I've been able to get. Low-light performance is also very good.I carry my white s110 in the COSMOS ® Dark Brown PU Leather Case Cover Bag For Canon Powershot S110 Digital Camera with Cosmos Fastening Strap and it looks very sharp.A word about wifi transfers: the speed at which photos and movies are uploaded to your computer depends on your home internet speed, not on the s110. Reviewers who experience slow uploads shouldn't blame the s110. I use the wifi option to upload photos to my laptop after a day of shooting and it's a very easy process.", "Date": "April 28, 2013"}, {"Title": "Solid camera, worth the money, has lots of capabilities, good low light performance", "Author": "J. Osgood", "ReviewID": "R33XMB4N1A3YOK", "Overall": "4.0", "Content": "I like this camera quite a bit.  I'm happy with my purchase and think it is worth the rather steep price tag.  I have been a long-time Canon point and shoot user.  My previous camera was the SD880IS.  The S110 is a significant step-up.  The camera is very fast.  Photo quality is excellent and the low light performance is strong.  I can see myself using this camera for a very long time.", "Date": "January 17, 2013"}, {"Title": "WIFI IS AWFUL!!!", "Author": "robert balotin \"Robert J Balotin, MD\"", "ReviewID": "R14CJT40MN3VR2", "Overall": "4.0", "Content": "Great cameraGood pics, relatively easy to useWIFI system is awful, very difficult to set up, customer service has been limited, I find it near impossible to contact them during their limited hours, the two times I tried the call failed.  Their email support is extremely limited.  Needless to say I still don't have any WIFI set up after three weeks.  Don't buy this camera if you care about this feature.", "Date": "January 12, 2013"}, {"Title": "Cannon PowerShot S110 - Covers more ground", "Author": "Parker Hallam", "ReviewID": "RBL4BKBYR7H76", "Overall": "5.0", "Content": "The Canon PowerShot S110 is a sleek and light weight camera that may be compact but comes loaded with advanced features. What I liked most about the digital camera is that it is WiFi compatible meaning I can post my photos on social networking sites without having to wait to download onto my computer. The 12.1 MP ensure high resolution images and even more I can click away without having to worry about low light as the camera delivers stunning images even in low light. The touch panel LCD makes it convenient to browse through images and for setting as well. I can get more than what I want as the 24mm wide angle lens can captures more pictures on my frame. Apart from this there are loads of shooting modes to choose from. Power Shot S110 is definitely a must have for travelers.", "Date": "November 16, 2012"}, {"Title": "Zoom broke after a few months--Grrr Camera costs too much for this to happen", "Author": "Jane F. Gilgun \"I'm a professor at the Univer...", "ReviewID": "R3MC4RPKE9IRPS", "Overall": "1.0", "Content": "I was satisfied with the camera for a few months. Then I noticed that when I used the zoom, I could hear the whirr. After that, it was hard to control the zoom.  Now the zoom doesn't work at all. This is inexcusable for an camera this expensive and that had such rave reviews.", "Date": "November 25, 2013"}, {"Title": "Beware - software doesn't work on a Mac", "Author": "Lonchodomas", "ReviewID": "R3HR1FYEGK8XNU", "Overall": "4.0", "Content": "4/27/13The software mentioned in the below review has been updated and works.  For that reason, I am going to up the rating on this product.  It was previously 3 stars.  I now rate it 5 stars.  I do warn you, the software installation could be frustrating.  When I connect my camera wirelessly to my computer, iPhoto wants to open as a default.  I can close that, and then open ImageBrowser EX.  That will import the photos.Since the previous writing, I took an overseas trip, and found the 24 mm wide angle lens very good for photographing architecture and art inside cathedrals.  My primary interest in this camera was the wide angle lens and smaller size.I wish the wireless transfer to my Nexus 7 was faster, but it works.I have taken photos in the evening, and low light conditions seem to work well for me.========At the time of this writing (3/2/13), part of the software that comes with this camera (CameraWindow DC 8) does not work on an iMac (I'm running O/S 10.7.5).  The Cannon help desk told me this, after I had fooled with the setup for a couple hours, and finally called help.  They say an update is coming out.  If it does, I'll try to update this review.  What this means, is that some of the suave wireless features advertised by Cannon, don't work with the iMac.I should point out, the software does install.  But what will happen, when you try to connect, you'll get an error message that says Camera Not Found.  And this is true whether you're using the USB cable, or trying to connect wirelessly.I was able to setup the wireless to transfer files to my Nexus 7 tablet.  To do this, I had to download a Cannon app from the Google App store.  And then on the camera, the transfer is done when choosing the Android phone option.  This will only work if you are signed onto WiFi.I am also able to use the WiFi to transfer files to my desktop.  But its done through iPhoto.  The help desk said iPhoto couldn't do it, but it does work.So in essence, the Cannon S110 does what I want.  I'm able to transfer files onto my tablet when I'm in a WiFi zone.  And using WiFi, I'm able to transfer photos into iPhoto.But I'm not able to use CameraWindow DC 8, and then the Cannon iMage Gateway (web based).  And that's disappointing.I do not have a full review of the hardware yet.  But I wanted to get this note out, to let purchasers with iMac's be aware.I should add one more thing.  Because the camera comes with WiFi capability, I bought a regular SD card.  On my other camera, I have a Eye-Fi CD card.  That's basically a WiFi retrofit.  Setting up Eye-Fi can be finicky too.  But I think the file transfer speed on Eye-Fi might be faster than what I'm seeing with the Cannon.I'm hoping this camera turns out to be a good camera.  I have taken pictures with it, and they've come out well.  My primary interest in it is that it has some wide angle capability (24 mm).  I'm not an expert on cameras, but wanted something with more of a wide angle than my previous camera.If the software is fixed, and and the camera turns out well, I'll increase my present 3 star rating.  But for now, I can't give it more than 3 stars.", "Date": "March 2, 2013"}, {"Title": "What a great little P&S;!", "Author": "Shannon Guy", "ReviewID": "R32NC54IAH0I7Z", "Overall": "5.0", "Content": "I am anti point and shoot camera, but I had seen some amazing work done with one of these, and decided to check it out myself. I was still unsure about it when I finally purchased it- and was quickly impressed. I love all the options, being able to manually change settings, the video quality is amazing... and the slow motion video has brought tons of laughter into our home! I purchased the underwater housing for this, and have done some testing with it, and been VERY impressed! This little guy has changed my views on P&S; cameras!", "Date": "May 18, 2014"}, {"Title": "Outstanding pocket camera", "Author": "John \"MacTruck\"", "ReviewID": "R3J94VKU0HLT9B", "Overall": "5.0", "Content": "I have owned this camera for about 8 months and 2000 pictures.  It still works flawlessly and I love the Canon Android app that lets me transfer pictures to my phone with the S110's wi-fi.  I can't say that the picture quality matches my wife's Canon DSLR, but I have taken many more 'keepers' with this camera since it's so much easier to bring along while traveling.  I added a protective film to the LCD screen and the touch controls still work great.", "Date": "March 28, 2014"}, {"Title": "I upgraded from another Canon Pro S series", "Author": "Cabbit", "ReviewID": "R14L40YI1Y2A5J", "Overall": "5.0", "Content": "I won't go in to too much technical detail. I am not a professional photographer, but I know several, and they all recommended this. My most frustrating experience is that most point-and-shoot cameras do not handle low-light situations. I am a night owl and typically take photos at night, in a bar, at a restaurant; so it was crucial to not get grainy, or over-exposed photos when using flash. Every \"low light\" setting on any point-and-shoots have been disappointing, as if turning on the flash and strobing it was going to help. Low aperture, mid-high ISO will get you a pretty beautiful dimly lit alley-way shot on a rainy night.Menu is intuitive. LCD touch screen is massive, so make sure to get a protective cover. Wireless setup is pretty flawless. The camera software is a bit slow, but preferable to others, I think. Transfer can be slow depending on your network configuration, obviously.Be SUPER careful about putting your finger on the flash bulb cause it pops up right where you want to stabilizing the camera while shooting.Portability wise it's a little bigger than the typical point-and-shoot, but I'm a functional kind of girl and much prefer beautiful photos than a candy-colored snapper in my purse.", "Date": "February 22, 2014"}, {"Title": "Absolutly best bang for buck point and shoot!", "Author": "Dammika J \"Dammika\"", "ReviewID": "R15CMLMDHWQU5G", "Overall": "5.0", "Content": "I have the Sony RX100 II now which is what I replaced this with, I gave my old S110 to my aunt and bought a new one for my parents.Both parties equally technologically challenged, both parties now sending great quality pictures.this camera is my absolute fav worth every penny very highly recommended.!It's not as good as the Sony Rx100, but it's more pocket able, lighter and is much better value for money. The 2nd best packet point and shoot yuo can buy I would say!", "Date": "February 21, 2014"}, {"Title": "Amazing Little Camera", "Author": "SD Cardsmith", "ReviewID": "RKSHQ4OLC46L9", "Overall": "5.0", "Content": "It's amazing what Canon could do with this little, convenient camera. Great design and user interface, even better photos, and the video quality is a bonus...if you can find one it's a great deal.", "Date": "January 26, 2014"}, {"Title": "great little raw shooting camera", "Author": "Rmac \"scuba47\"", "ReviewID": "R19Q1IRQJLBBWA", "Overall": "5.0", "Content": "I like shooting in raw. This little pocket camera gives the user so much control over shooting, it's a fantastic camera.I like the control, but battery life is short, you need an extra battery which is no problem; batteries are cheap.I give the camera a 5 star because it is a 5 star camera.", "Date": "January 26, 2014"}, {"Title": "Just right", "Author": "James Brenneman", "ReviewID": "R3QI060ETLC0E", "Overall": "4.0", "Content": "Got it for my mom. She is struggling with the awkward controls but she likes it!Images are great and no real cons to mention.", "Date": "January 17, 2014"}, {"Title": "Great little camera", "Author": "José Ignacio Atria", "ReviewID": "R2MCFPM6SLQOIE", "Overall": "4.0", "Content": "Whe my Canon HS 210 s stopped working, I decided to have this camera.  Great decision: when I was in Times Squeare, NY, I got great pictures in low light conditions. Nontheless, I think it's not as fast as they say, I mean focusing takes some more seconds long before focusing.", "Date": "January 9, 2014"}, {"Title": "Love the Canon S110", "Author": "Cutie", "ReviewID": "R17PYQW19JBN32", "Overall": "5.0", "Content": "I love this compact Canon S110.  I have the white camera, which is cute and beautiful.  The images are clear and sharp.  I love the touch screen.  For the Wi-Fi, I can connect this camera to my smartphone to view the photos from my camera on my smartphone, I can send my photos directly from this camera to Canon Image Gateway, Facebook, Twitter, Youtube, and other person emails.  But I cannot send send my photos from this camera to my computer and printer wirelessly.  To setup the Wi-Fi, I watched the video from youtube.  Reading the manual on the CD is hard to understand on how to setup the Wi-Fi.", "Date": "January 7, 2014"}, {"Title": "Best camera for the size", "Author": "qualityonly \"erosennin\"", "ReviewID": "R2EP2NBUP0BB02", "Overall": "5.0", "Content": "Best build quailty, ergonomic and super compact for such big sensor in compact size.  Good low light quality, and the touch screen is very nice, bright and responsive.  It also have very good wifi for streaming or remote control via phone.  Not as good as SLR but no SLR have this size and the f/2 lens is very bright with automatic lenscap.  It is smaller than your phone and have much higher image quality than any phone even compared to 24 Mpix nokia.  Because the size of the sensor and lens speed matter the most out of just stupid megapixel.", "Date": "December 30, 2013"}, {"Title": "A DSLR quality feature set from a tiny box", "Author": "C. J. Clavadetscher \"quickshot carl\"", "ReviewID": "R1Z8EVF5D3ZP1U", "Overall": "5.0", "Content": "This is an amazing camera for its size, which is \"diminutive\"... It has all the features of cameras far larger EXCEPT for a hot shoe. It has a very fast lens, super quality, and has generated for me superb images including under very low light.  Easy to use. Results you will love. Very smart DIGIC chip. I shot a night XMAS event two weeks ago with this and the shots got rave reviews. Enough said.", "Date": "December 24, 2013"}, {"Title": "Really impressed with this camera.", "Author": "asher", "ReviewID": "R2WBAXBEVNOGF1", "Overall": "5.0", "Content": "I just received and am getting acquainted but so far so good.  It takes amazing pictures in the night time.  I really like how it's a literally point and shoot camera.  I can't be bothered with changing settings for each picture I want to take.  I just want to take a picture and this camera has met those needs for me.  I would recommend this camera to others.  Oh and yes it does take getting used to the location of the flash but it's not a killer for me.", "Date": "December 9, 2013"}, {"Title": "Much easier than the big guys.", "Author": "Glagen \"glagen\"", "ReviewID": "R2G70S8QQOIJ9N", "Overall": "5.0", "Content": "Bought to take on the 2 week trip as our Cannon Eos proved to be much too heavy to lug around all day.  This little guy takes great pics and has plenty of flexibility.  Slip in your pocket and off you go!  Would definitely recommend", "Date": "December 9, 2013"}, {"Title": "Had a the previous incarnation of this camera...lasted 6 years and tens of thousands of photos.  So far, just as happy with this", "Author": "Thor Kennedy", "ReviewID": "R1NUEWMQ9MD77Q", "Overall": "5.0", "Content": "The wireless option is awesome.  I'm able to transfer to my iPad wherever I'm at.I am a point and shoot....kind of guy, and the automatic mode is my friend. The camera is a fantastic machine for a really good value.  The one thing that I would change would be to add back the traditional viewfinder....but I'll get over 'old school' someday soon.This being my 2nd point and shoot, Canon compact, I'd definitely recommend it.  Great photos!!!!!", "Date": "September 14, 2013"}, {"Title": "Just  a great camera, no errors here.", "Author": "Robert", "ReviewID": "R1FFO7FK0TIONW", "Overall": "5.0", "Content": "Love it. Great portable pocket camera with all the functions I need and then some. No lens error here, or any other  error for that matter.", "Date": "August 20, 2013"}, {"Title": "GOOD CAMERA", "Author": "Lee S. Pendleton", "ReviewID": "R2JWVS494KEUS7", "Overall": "4.0", "Content": "iT'S FINE.  MUCH BETTER THAN WHAT I HAD BEFORE.  PARTICULARLY LIKE THE RAPID SHOOTING SEQUENCES.  QUITE EASY TO USE AND INTUITIVE.", "Date": "June 1, 2013"}, {"Title": "Wow, wotta camera!", "Author": "Raincoconuts", "ReviewID": "R3790LWS0Z23EM", "Overall": "5.0", "Content": "Compact, fits comfortably Case Logic(ed) in the front pocket of my jeans! Tested in Bhutan last week, it does well!Low light was a problem with my 5 year old Canon Elph, the S110 takes some spectacular pictures even in low light.The camera is easy to use, controls feel good, not too comfortable with the wi-fi seems overly complicated to set up,I'm not doing it anytime soon.", "Date": "May 31, 2013"}, {"Title": "This is a great camera", "Author": "Pmac", "ReviewID": "R38Z5L5TN4RLEN", "Overall": "5.0", "Content": "I don't know crap about cameras and so I'm still figuring out the inner workings of this thing, but so far I love it. Have been trying to venture from \"auto\" mode, but auto takes such good pictures that it doesn't motivate you to expand your skills. You can basically turn it on, press the shutter button, and take a great picture. Didn't see it in many other reviews that here is also a simple app available for android/apple that will let you view/download pics from the phone on your phone tablet. Cool. Also takes good video, was able to take pics/vids of my new daughter being born in what some might consider a bothersome level of detail. Worth the money.", "Date": "April 25, 2013"}, {"Title": "Excelent camera, but not perfect", "Author": "Hervandil M. S. Anna", "ReviewID": "R2EWIGWU4VU2AE", "Overall": "4.0", "Content": "The camera itself is wonderful.Nice functions, lots of settings and there is a slow motion video very interesting.But I didn't like two things:1) It is very difficult to not lock the flash when it goes up. The place where it is located is very close to the place where we naturally place our fingers.2) The Wi-FI function is not very easy to use. It should be something more direct to connect to computers.Despite those two issues, it is a good choise!", "Date": "April 17, 2013"}, {"Title": "Impressive camera . . .", "Author": "The Rabbi", "ReviewID": "R218OEKMMKFEGZ", "Overall": "5.0", "Content": "I continue to be impressed with the Canon S110 -- both picture quality and features.  This camera has many useful features packed into a small package, more flexibility than most people will need.  It is my take-everywhere camera and I rarely encounter a situation where it is not up to the job at hand.  In my opinion, it is the current king of the compact digital cameras.", "Date": "March 25, 2013"}, {"Title": "Great Camera!", "Author": "Raul Amador", "ReviewID": "R1I3USL4CLOCZL", "Overall": "5.0", "Content": "Has a lot of manual adjustments but, takes great pictures in Auto as well. Low light pictures look great. My SLR will be used less now that we have a serious compact camera. It will not replace an SLR but, it's a great camera to have on you all the time. Transferring pictures to my phone is simple and allows me to share them instantly.", "Date": "December 28, 2012"}, {"Title": "The best!!!", "Author": "Ernesto Olascoaga", "ReviewID": "R1G7O54ACV0FGV", "Overall": "5.0", "Content": "Excellent, it works better than expected. Very easy to use. Excellent pictures. Canon keeps the leadership. It is very light.", "Date": "December 28, 2012"}, {"Title": "Finally got a smiling picture from my 3 yr old.", "Author": "Deja", "ReviewID": "R1PUG7JVTCY9T2", "Overall": "5.0", "Content": "The two best features for me (a mom and a photo nut) are the smile recognition feature and the spot color feature.The smile recognition feature has enabled me to actually get a shot of my 3 yr old smiling instead of his normal \"cheese\" face where one eye is shut and his lip is snarled.The spot color is really cool. You choose which color you want the picture to show and the rest of the picture turns black and white. I have tried this quite a few times and it works wonderfully. Really cool for those special effects.These are my two favorite features, but I really love the entire camera. From the white outer casing to the huge touch screen LCD this camera is awesome and takes fantastic pictures in all kinds of light. So glad I bought it.P.S. The HD video recording is amazing. Even in low light the videos look awesome!", "Date": "December 4, 2013"}, {"Title": "Realistic travel option", "Author": "brandon adams", "ReviewID": "RE0LP7X5HK996", "Overall": "5.0", "Content": "I substituted this for my entry level dslr, and was extremely impressed by the ease of use with the touch screen and camera ring.I would recommend for anyone who values mobility, and is willing to sacrifice a minor amount of quality to avoid carrying around a full bodied camera.", "Date": "September 4, 2013"}, {"Title": "Canon Power Shot 110", "Author": "DAVID W. COOK", "ReviewID": "RPRC4WVE7HQUA", "Overall": "5.0", "Content": "This is a great camera.  Only problem is that it is so smart, it takes forever to learn all the aspects of the thing.  If you just take automatic pictures it is ready to go and takes fantastic pictures.  if you download the manual and print it out, be prepared to print 346 pages.  This camera does so many things I cannot mention all of them.  But to give you and idea...you can set the camera for a delayed shutter so you can get in the picture....and you make shutter click by blinking you eye....amazing.Buy it, you'll like it.DWCNOLNew Orleans", "Date": "June 27, 2013"}, {"Title": "Love the camera", "Author": "B. A. Sardinas \"Warlock\"", "ReviewID": "R1UBW2CAH06C5D", "Overall": "5.0", "Content": "JPEG + RAW in a small package.  Good value. Works like a pro camera in an ultra portable package. woot.", "Date": "April 1, 2013"}, {"Title": "Still one of the best", "Author": "HC \"Quik MKIV\"", "ReviewID": "R2RIE8DBEHHRXV", "Overall": "5.0", "Content": "I've owned every generation of PowerShot \"S\" models, and they keep getting better. Fast to focus, and great shot outputs. The manual controls are intuitive and quick to master. I carry this little guy as a backup, and when I just don't want to haul around all that (SLR) glass. Highly recommended.", "Date": "March 6, 2013"}, {"Title": "canon powershot s110", "Author": "Ken S. Shimizu", "ReviewID": "R33U9VEI0NPYMG", "Overall": "4.0", "Content": "although, you cant compare these point and shoots to an slr,  this is a very good camera.  i like the idea that you can just pocket it and the hd video is excellent.  the only gripe i have is the location of the pop-up flash.  it's in an area that i usually place my finger (maybe it's just me) and if the flash tries to pop up and my finger is there, sometimes it will get an error message and i have to power down and restart camera.", "Date": "February 20, 2013"}, {"Title": "Makes me feel like a protographer lol", "Author": "Applecrumble and Finch", "ReviewID": "R2VF7YQ5FGTFH4", "Overall": "5.0", "Content": "Man this camera is off the chain....i can take photos in low light...high light...while the object is moving...while im moving...and i only 2wice since christmas have i had to delete 2 or 3 photos cause of the blurriness cause its that darn good...sometimes with the touchscreen i even forget that its not an iphone...pulled it out once or twice to make a call as well...bruajaj...very awesome product", "Date": "February 16, 2013"}, {"Title": "Amazing Camera", "Author": "Amazon Customer", "ReviewID": "R2YGCDHVSVC8K", "Overall": "5.0", "Content": "This little camera is phenomenal! Image quality is great for this sized rig, the front dial is outstanding, touchscreen is responsive and by no means a gimmick. It is just as responsive as the iPhone 5 touchscreen, and just as useful. Wifi has proven to be a bit tricky to get working, but this does not hold me back from the recommendation. It is so slender that I find I'd often opt to carry it over my Canon G9. No way that it will replace a DSLR, but it is the latest evolution in the compact point-and-shoots.", "Date": "January 13, 2013"}, {"Title": "Great PS Camera", "Author": "Josh Yang", "ReviewID": "RID33KFBVIUL6", "Overall": "4.0", "Content": "This is a great point and shoot camera.  one of the best that I have ever used.  the price was a little to high, but you get what you pay for!", "Date": "December 30, 2012"}, {"Title": "Its a good small size camera to have when you need it", "Author": "Anna", "ReviewID": "RKYTCCMGWAO8I", "Overall": "4.0", "Content": "I have my Canon EOS Rebel T4i for taking photos on vacations, nature and special memorable occasions.  I was also looking to invest in a small digital camera just to have when you go out to parties, the beach and for every day.  This camera takes better images than my iPhone 5 so its perfect for what I need.  This camera is so small that it fits into my small crossbody bag and I can carry it with me every day because you just never know when you will need to snap a photo.The price is also worth it, when compared to other small digital cameras.", "Date": "January 10, 2013"}, {"Title": "Good enough in this size and price level", "Author": "M. E. Özsoy \"twingo\"", "ReviewID": "R3I2W7EOEOAA36", "Overall": "4.0", "Content": "Pros:*Good size*Nice touchscreen response*Built quality and feel*Overall response speed*Best choice in piano white color, forget the black and grey versionsCons:*No preset for fast moving object shots*Fair battery life*Wi-fi is hard to adjust (hint.Use S120 softwares for camera window)*No Euro plug included*No printed manuals included, only in CD", "Date": "January 7, 2014"}, {"Title": "Love my Canon S110", "Author": "Eddie G", "ReviewID": "R1MUAP8ENPY7U4", "Overall": "5.0", "Content": "I'm a Canon fanatic.  I have four generations of Canon cameras from the original Canon Elph 135 mmm to this one. I love the way the feel in my hands and their ease of operations, not to mention the quality of the photographs produced.  I would fully recommend this product to anyone who is in the market.", "Date": "January 3, 2014"}, {"Title": "Canon S110 12.1 MP Digital Camera with 3-Inch LCD Screen (Silver)", "Author": "JJS \"jjsifo\"", "ReviewID": "RMLBD8V7ZPBHL", "Overall": "4.0", "Content": "This camera delivers excellent image quality for the price,compact,very high quality built.Probably one of the best deals available today.And the seller is great also.", "Date": "December 12, 2013"}, {"Title": "Excelent Camera", "Author": "Rodrigo Sampaio", "ReviewID": "RZ8CF4W9O8K9D", "Overall": "5.0", "Content": "Excellent point and shoot. Great films. It's the best camera for every situation.  The size is perfect To fit the jeans front pocket.", "Date": "September 13, 2013"}, {"Title": "Value for money!", "Author": "Umesh Satyanarayana \"Umesh\"", "ReviewID": "R1D7O2GASX677C", "Overall": "5.0", "Content": "Good value for money!  Appealing design, features are good.  Enjoyed using in both video and still photography mode.  Thanks Canon!", "Date": "September 4, 2013"}, {"Title": "Great Value, Great Camera", "Author": "Jimmy Tree", "ReviewID": "R3KSK83D1TWIPM", "Overall": "5.0", "Content": "This camera has the perfect size, quality pictures and price combination .  I would recommend this latest version from Canon over all previous models.", "Date": "April 30, 2013"}, {"Title": "I am enjoying this camera. A good supplement for a dSLR. A good camera for anyone.", "Author": "MP \"MP\"", "ReviewID": "R3SJEYD3KV9P0T", "Overall": "4.0", "Content": "I bought this camera because I do not want to take my dSLR on my kayaking trips. I am slowy learning all the features & menus.  It is a struggle for me since there is no owner's manual and I am not very literate in camera computer language.Anyway, the wide angle lens is amazingly sharp. I am still figuring out how to adjust brightness and other functions.The camera size and weight are what I need.I am ordering another one for my sister. But boy, it costs $100 less than when I ordered mine 4 months ago. Bummer.", "Date": "March 15, 2013"}, {"Title": "Big camera in a small body", "Author": "Kofty", "ReviewID": "R1KTIXT57TX0AF", "Overall": "5.0", "Content": "Makes amazing photos from the very beginning - but have to use Auto mode a lot, as its numerous functions need a bit of an explanation (to be found in a 335 page pdf, but well worth the read).I love this camera because 1) it is so small it fits into my trouser pockets, 2) it gives me a range of options - from a real wide angle to a very good zoom and 3) it makes excellent photos.I will invest some more time to investigate more functions, maybe the WiFi connection (boy does that sound complicated) - but in combination with my Mac and iPhoto/Aperture, the Canon S110 is all the camera I need to have.", "Date": "March 14, 2013"}, {"Title": "Great camera! WOW quality!", "Author": "Daniel A.", "ReviewID": "R3BZKLK3F0VG43", "Overall": "5.0", "Content": "If you are looking to buy this camera, you already know it's one of the best in this format.But man the quality on this is fantastic!I had many point and shoot over the years, and i never knew they can be this tight and well constructed.Buy it you will not regret it!", "Date": "February 12, 2013"}, {"Title": "Gave us beautiful perfect pictures!", "Author": "Philip Olivan", "ReviewID": "R4H4VAEUYS4SW", "Overall": "5.0", "Content": "After hearing so much about S95, we wanted to look for the latest version of the S product line, and viola S100 and S110 were on our list. After taking some pictures, the camera exceeded our expectations by a mile! Those cameras are highly recommended!", "Date": "December 30, 2012"}, {"Title": "I love this little camera!", "Author": "N. Master \"ndmaster\"", "ReviewID": "R2DR5OB09XPN6T", "Overall": "5.0", "Content": "I am using this camera as a replacement for my broken DSLR. The picture quality is great for a camera at this price point. Even better is the video and playback quality. It performs decent in low light, even though it is not a particularly low light capable lens. Another benefit is the WiFi capability, making it easy to upload photos to your computer or wherever you want to store them.", "Date": "May 28, 2014"}, {"Title": "Great camera", "Author": "chuck", "ReviewID": "R1N74P8LWS3XCQ", "Overall": "4.0", "Content": "Has many features that are available on my SLR digital. Good for travel. Only dislike I have is the lens ring sticks out quite a bit.", "Date": "May 1, 2014"}, {"Title": "Goodbye Power Shot SD1100 IS", "Author": "Susan Beach", "ReviewID": "R3NSJY3D5RWUG9", "Overall": "5.0", "Content": "HELLO Power Shot S110!  I have thoroughly enjoyed using my old SD1100 and was sad to see it go but enjoying the bigger viewing screen and image stabilizer.", "Date": "May 1, 2014"}, {"Title": "nice feature set", "Author": "Cory Kreikemeier", "ReviewID": "R3CQYNPIU52ME3", "Overall": "5.0", "Content": "very well done, WIFI to phone/computer works very well for transferring photos, love these options and this was an upgrade for us from the S95 so we already knew the camera would do great but it has exceeded our expectations so far", "Date": "March 3, 2014"}, {"Title": "Great small camera", "Author": "Robert E. Broadhurst Jr.", "ReviewID": "R1OJM0K9FAV6QN", "Overall": "5.0", "Content": "I have a big DSLR camera that I use for landscape photography and this one for just about everything else.I wanted to have a small camera as a carry around camera, this one is perfect!  It's very compact.When I researched small cameras, this one came out on top. When I went to the store,I told the person I wanted a small camera that takes great photos to see what he would recommend.He said that there's only one choice, the Canon Powershot.This camera takes great low light photos and is perfect for when you are taking photos of people when at a party, reunion or when sightseeing.  It does not zoom as much as other cameras, but I have my big DSLR for those situations.  I also have used the PowerShot for taking videos and it does a nice job.  The other thing this Powershot is good for is taking photos of home interiors, so if you are a Realtor or doing home improvements, you can't beat this camera.", "Date": "March 2, 2014"}, {"Title": "Love it.", "Author": "Chris Wyant", "ReviewID": "RSZMZC08HQF4", "Overall": "5.0", "Content": "I purchased this camera for my girlfriend whom is an aspiring photographer. Unfortunately the first camera had dead pixels/black lines on the screen. Amazon was quick to ship out a new one that has since been flawless.  I normally don't write reviews I just wanted to point out that Amazon did a great job of taking care of me here. I considered buying one of these for my self for the days I don't wish to carry around my Canon 5D.", "Date": "February 27, 2014"}, {"Title": "Good all around", "Author": "Manitauk", "ReviewID": "RKAVEJTTY3DJN", "Overall": "5.0", "Content": "Wanted something small and inexpensive enough to not hesitate to take it everywhere, and was willing to take a little hit in quality to get it. Didn't have to. Photos look amazing, video is great. Does everything for which we were considering getting the next step up.", "Date": "February 24, 2014"}, {"Title": "excellent camera for the average user", "Author": "ysugar", "ReviewID": "R3479SJR2W1CWD", "Overall": "5.0", "Content": "this camera is great for the average user or someone a little more serious on vacation. the full manual controls are a must have for anyone that is used to shooting manual on a dslr.", "Date": "February 24, 2014"}, {"Title": "Good picture and build quality", "Author": "shovenose", "ReviewID": "R8UP6LWNYLX5S", "Overall": "4.0", "Content": "This camera has a good picture, solid build quality, a reasonable intuitive design and button layout, and battery life is better than expected. However, low light performance is not as good as I hoped for the price. Video is also pretty bad. Popup flash is cool though.Overall I'd highly recommend this if you need something compact. If you're serious about photography while this does not have the same flexibilty and large sensor as a DSLR however it does carry most of the software options for it in manual mode.", "Date": "February 19, 2014"}, {"Title": "Good quality pictures", "Author": "jack chiang", "ReviewID": "R22ABT6II7DRJ0", "Overall": "4.0", "Content": "Very good quality pictures. Very handy and easy to use.the only dislike is the pop up flash light that get in the way of holding the camera.", "Date": "February 17, 2014"}, {"Title": "Ecellent point and shoot", "Author": "Stephane Cojot-goldberg", "ReviewID": "RE041XAG78RQ0", "Overall": "5.0", "Content": "Very pleasant to use. Controls are easily accessible. Good quality paper prints. Light, bright screen and 24mm lens. Bravo Canon.", "Date": "February 7, 2014"}, {"Title": "Great", "Author": "Steph", "ReviewID": "R19TO4B2LV7USX", "Overall": "5.0", "Content": "I loved my camera. It is so perfect that you can send pics to your phone. I used it during my trip in the US.", "Date": "February 4, 2014"}, {"Title": "Nice camera", "Author": "Fabio Machado", "ReviewID": "R204UB6SV3DMI", "Overall": "5.0", "Content": "This camera proved to be everything that I wanted. Nice pics, manual or automatic settings, good night time resolution, etc.", "Date": "January 31, 2014"}, {"Title": "Great camera", "Author": "Jacob", "ReviewID": "R36LXM0GT9XGAV", "Overall": "5.0", "Content": "Great camera, takes really awsome pictures, great point and shot, the wifi is a great feature that all cameras should have!!", "Date": "January 30, 2014"}, {"Title": "Love this camera!", "Author": "Marla Cross", "ReviewID": "RKYAAZU9R86KL", "Overall": "5.0", "Content": "This in an amazing camera. I haven't had a ton of time to learn it all yet, but I have yet to take a bad picture with it. I researched for months before finally making the choice to purchase this one, and I am 100% satisfied with it!", "Date": "January 23, 2014"}, {"Title": "Canon s110", "Author": "Mdrudge", "ReviewID": "R1UKVNATCZYZAP", "Overall": "4.0", "Content": "Happy with the quality of pictures and size of the camera.  I have owned previous Canons so I am excited to see how much better this one is.", "Date": "January 8, 2014"}, {"Title": "Great pictures, small sized.", "Author": "Jose E. Roshardt", "ReviewID": "RT7TYCD3O78NX", "Overall": "5.0", "Content": "Great pictures, small sized.  Good for traveling and business.  Elegant design, may be the only \"con\" would be that it doesn't have an optical visor.", "Date": "December 7, 2013"}, {"Title": "quick delivery and worked as published.", "Author": "MFMP \"The Azua Man\"", "ReviewID": "R2LMD82PI98AAP", "Overall": "5.0", "Content": "quick delivery and worked as published. no problems at all.  taking superb pictures.  saved over 100.00 compared to a new camera and this one was a new.", "Date": "November 23, 2013"}, {"Title": "All the functions of big camera in a convenient size", "Author": "Jenny T.", "ReviewID": "R2TPF1KJ2IUN9W", "Overall": "5.0", "Content": "So far so good!  Love the large screen and it's a touch screen!  I shot photos all over Europe for a month.  The camera is very user-friendly and I love all the functionalities - I haven't even used them all yet.  I need to sit down and read the manual since there have been a lot of upgrades since my last PowerShot camera.  Good thing with Canon's is that they are very consistent so you can almost always figure out how touse it without the manual.", "Date": "October 19, 2013"}, {"Title": "Great point and shoot camera", "Author": "FERNANDO LORDELO", "ReviewID": "R333OFJ7PJGRH7", "Overall": "5.0", "Content": "Very fast camera, nice touch screen interface, many manual controls, F2.0 lens takes beautiful shots in low light conditions. Definitely a great buy!", "Date": "March 28, 2013"}, {"Title": "One of the best cameras I've ever owned (and I've had quite a few)", "Author": "Ezra", "ReviewID": "R21DPKIG8CI7ND", "Overall": "5.0", "Content": "The thing I hate about the camera the most is that I think I'm a pretty good photographer but everyone always says \"your pictures all look so great, you must have a great camera\" I usually just scowl and say \"I have six cameras\".  You will never get credit as this camera always does. But yes for anything you can put in your pocket, this camera totally rocks.  It's the camera that more SLR junkies take with them when they leave their SLR at home.  You can control almost everything and if you are doing underwater stuff it's better than anything I've ever owned at any price.  If you get the dive housing and the aftermarket underwater filter and set the camera to underwater it is truly amazing. Here's some video I shot [...]The wifi is useless so don't bother with that, but I'm in it for the image.", "Date": "November 20, 2013"}, {"Title": "Canon S110 is Super", "Author": "William D. Jobe \"broncobill44\"", "ReviewID": "R3S8U8W16ZS6YG", "Overall": "5.0", "Content": "This little mid priced camera is easy to sue and is easy to carry on hikes, to parties, and other events. I am enjoying it for ease of use and photo quality.", "Date": "March 3, 2013"}, {"Title": "Some feature new, some removed make it an optional update", "Author": "Robert Cozzi", "ReviewID": "R3JP4GZAJRJV55", "Overall": "4.0", "Content": "The previous S100 included a GPS, I owned that camera. The image quality is very good and its great to have GPS tagging your photo locations (unless you don't travel or don't care about that). Most people ask \"Where was this taken\" The bad news, the NEW S110 had its GPS removed (from the prior S100 model) and replaced with a questionable Wi-Fi feature. While all of Nikon's new point & shoots are adding Wi-Fi on top of GPS or GPS on top of Wi-Fi, CANON choose to remove GPS; replacing it with Wi-fi. There for, I have no value in this new model and will return it.Pro: Great images, easy to use, wonderful ergonomics, and nice LCD.Cons: No GPS, not great (just okay) battery life.If you don't care about GPS, this is a great camera, just make sure you turn off the Wi-Fi to increase your battery life.Why am I miffed at CANON for removing GPS and replacing it with Wi-Fi? I own DSLRs that include optional add-ons for wi-fi and/or GPS. I find the wi-fi option cute, but unnecessary today, but GPS to be extremely useful. I am assuming CANON did market research and decided a larger majority of SmartPhone uses want to transmit their photos to their phones. (Not sure why these folks aren't just using the camera in their phones instead of an S110, but whatever.) For me, loading the photos onto my laptop and not seeing where they were taken is sometimes disappointing. But that's just me, you may not care, so in that case, you'll not find a better camera, and if you're like me and really want GPS, get the S100 instead.", "Date": "February 5, 2013"}, {"Title": "Great camera", "Author": "Dr. David Groce", "ReviewID": "RBDKGHZ81AD1J", "Overall": "5.0", "Content": "Liked the Canon s95; this camera is even better.  It fits in my pocket and takes great pictures including raw.", "Date": "November 24, 2012"}, {"Title": "Shutter release problems. Avoid this camera", "Author": "shelly butler", "ReviewID": "R8XL1ZTPMKM0G", "Overall": "1.0", "Content": "I had problems with the shutter release button, which started out sporadically, but now the shutter button won't work at all. Pressing the button will focus the image, but will not take the photo. Canon is refusing to repair my camera unless I pay $160 even though this seems to be a widespread problem. Canon's excuse is that the warranty has expired, but the problem wasn't so bad in the beginning, so I didn't feel the need to repair it ( I thought I wasn't focusing properly), but it got progressively worse over time.", "Date": "May 26, 2014"}, {"Title": "terrible battery performance", "Author": "papillon", "ReviewID": "R2HG0QPRFXM3T0", "Overall": "1.0", "Content": "I did not bought this from amazon but wanted to write the review here for larger audience.This camera will start showing battery pack is low with within 50 shots or few minutes of videoNot usable for a day trip or talking at least few hundred picture and video without a 2nd battery packThe wifi is simply a joke... the setup is horrible and very complex almost no real use unless going through all canon website and their links ... and turning on your wifi will drain the battery in hours..This is a rip off from s100 and no wonder the camera is on sale in many website under 220 (abes of main) just because this is a bad product", "Date": "May 16, 2014"}, {"Title": "Best Point and Shoot I've used", "Author": "M D", "ReviewID": "R31TCFHOWBLNNX", "Overall": "5.0", "Content": "I bought this mainly for filming travel & vlogs.  I haven't really taken any photos with it, but I can say for video, its got amazing stabilization, great audio and it's a perfect size.  One thing to note is that as far as I can tell there are no manual controls in video, the only thing I saw was the ability to turn on and off a built in ND filter which was nice for daytime stuff.  It looks like you can also setup a flat picture profile.  It's no wonder Casey Neistat says its the best camera ever made :)", "Date": "April 14, 2014"}, {"Title": "This camera is amazing", "Author": "L. Pagan", "ReviewID": "R2F7QE8XFF1188", "Overall": "5.0", "Content": "I've never had a really good quality camera before - mostly just used to the ones on my phones. But this just blew me away. I'm certainly no photography expert, and I'm sure a really expensive DSLR could wipe the floor with this, but for ease of use for the quality of the pictures - amazing! I've just been shooting in auto mode and everything comes out crystal clear with true-to-life color.And since I snatched it for about half the price since the newer model came out, I have to say it's completely worth it.", "Date": "February 13, 2014"}, {"Title": "Awesome with CMOS 'chip'", "Author": "MacBobT \"catso\"", "ReviewID": "R4WP5H97LGAW7", "Overall": "5.0", "Content": "I forgot what it's called, not exactly a 'chip, but it really improves digital photos along with Canon's software. So far I've only used auto, haven't gotten to A or S preferred. The video mode works well also. Buy it when it's on sale for two-nineteen.", "Date": "January 26, 2014"}, {"Title": "Quality Good, but Video has AF annoying SOUND!!", "Author": "Andrea L. Lunsford", "ReviewID": "R13146RGYYRBBW", "Overall": "3.0", "Content": "This camera has depth of field which makes the background images blurry while focuses on the target item up close. It has face recognition which you can set up and all that jazz. Great. Well, the video part sucks and here's why: the video is excellent ok? But the auto focus knocks REALLY LOUD while you're taking a video. It's annoying and distracting and it is almost a deal breaker because I make a daily vlog that relies on a good camera with good sound. The annoying clicks, clanks, and knocking is so distracting that its all you focus on. There is an auto focus lock, but you greatly lose quality when you do this. Why didn't anyone think about this? Why does no one mention it?!", "Date": "December 23, 2013"}, {"Title": "Record Button Has Moved", "Author": "Amazoon \"2MuchStuff\"", "ReviewID": "R9BVQEEBVWWMA", "Overall": "3.0", "Content": "I recently purchased the S110 for for my wife, who was used to using the Canon S95 (which she accidentally dropped). While she's generally pleased with the performance of the camera, she did complain about the position of the (dedicated) video record button. On the S95, she was used to simply pressing the shutter button to activate the RECORD function, but now there's a dedicated button which is located to the right of the LCD screen. Because of this, she can no longer hold up her camera at concerts, etc. and hit RECORD with one finger. She needs both hands. I mentioned to her that there may be a menu setting which will allow the shutter to activate video recording like the S95 did, but I haven't explored this yet. There's also the classic \"shutter lag\" that this camera series suffers from, but that's not a deal breaker (at least for me). All said, it's a solid camera that takes rich, colorful photos. I'd give it 3.5 stars.", "Date": "December 20, 2013"}, {"Title": "Little Camera that Could", "Author": "Michael Ray", "ReviewID": "R3W2KWYA2CM2DG", "Overall": "5.0", "Content": "Big brother to the S95 I have been using.....the touch focus feature in on screen composing ....was a leap forward.....now if it only had a phone feature !", "Date": "December 17, 2013"}, {"Title": "Mixed bag", "Author": "Harriet", "ReviewID": "RFHALADS97OE3", "Overall": "3.0", "Content": "Easy to carry in pocket or purse but controls too small to use easily. On/Off control tiny. Since my previous digital camera was a Canon, how to use the camera's basic functions were intuitive to use. Still need to study the manual to learn the more advanced options. Not impressed with picture quality in zoom mode. Like the touch screen option to take photos although when I go to use the two finger expansion of the image, I am as often as not libel to take an unexpected picture as well!", "Date": "November 4, 2013"}, {"Title": "Sweeeet", "Author": "Christopher Buzon", "ReviewID": "RQNCBE8LQ9TED", "Overall": "5.0", "Content": "If you are considering this camera you already know it's amazing.  Buy a 32 gig card with it, take some video, shoot a lot.  Regret nothing.", "Date": "October 13, 2013"}, {"Title": "Solid camera", "Author": "Offsky", "ReviewID": "R32ECV2EMEL7GO", "Overall": "4.0", "Content": "The wrist strap was extremely difficult for me to thread through the tiny holes.  Maybe I was just unlucky. Otherwise good camera.", "Date": "May 14, 2013"}, {"Title": "Comprado desde España - Excelente elección", "Author": "CedricPuchalski", "ReviewID": "R1DB3ZYMZKRVUA", "Overall": "5.0", "Content": "He comprado este cámara desde España y ha sido una muy buena elección.El precio con respecto al mismo producto en España es muy inferior.", "Date": "February 27, 2013"}, {"Title": "Amazing pictures in/out doors but apparent white noise in video", "Author": "Choonik Lee", "ReviewID": "R2E0IUPRJ9F3X3", "Overall": "5.0", "Content": "Amazing indoor outdoor pictures. But there is obvious white noise recorded during video taking. For a recording of very quiet scene, you will definitely notice it. However, considering its amazing picture quality, I will say this is a keeper!Wifi connection with my iPhone 5 was smooth through my wifi router at home. The camera itself works as wifi hotspot, which lets you connect your smart device directly to S110. I'm giving 4.5 stars!", "Date": "February 18, 2013"}, {"Title": "Great for golf recording", "Author": "Todd D Heugly", "ReviewID": "RABXK0LBY8KCQ", "Overall": "5.0", "Content": "I am a golf instructor and have been very pleased with this camera.  The slow motion sports recordingis great for recording golf swings.  You can record at 120 fps with good picture quality and at 240 fps with a little less clear picture quality, but nothing to sway you from buying this camera.  Good job Canon.", "Date": "February 13, 2013"}, {"Title": "Great camera", "Author": "ryan hoffman", "ReviewID": "R91AV3PTMGF5X", "Overall": "5.0", "Content": "Excellant picture taking and easy to take pictures.The WiFi is a little complicated, but doesn't take away from the overall usefullness of the camera", "Date": "February 8, 2013"}, {"Title": "Great little camera.", "Author": "W.H. \"WPH\"", "ReviewID": "R1CTPWOQWMFXP", "Overall": "5.0", "Content": "Easy to use.  Take high quality photo for a pocket camera.  Amazing HD video.  Very nice optics. Battery life is excellent as well.  It was hard to decide whether to get this white one or the black one.", "Date": "January 27, 2013"}, {"Title": "Great product, as-expected shipping", "Author": "Scott Galla", "ReviewID": "R1YZQ4FT5NZZGA", "Overall": "5.0", "Content": "Great camera, compact.  You get what you pay for and if you're looking for a compact point and shoot, this is the one to buy.  Only downside would be that the interface for uploading photos is sometimes clunky.", "Date": "December 27, 2012"}, {"Title": "Previous PowerShot owner who upgraded and is SUPER HAPPY", "Author": "K. Shelby", "ReviewID": "R1B1W38HZ5VH8W", "Overall": "5.0", "Content": "I owned my other PowerShot since 2007 and decided to buy a new one this year since my low-light pics were less than desirable with my old camera.  OMG!!  This camera is fantastic on the auto setting and I love the camera.  I also read some low reviews about getting the wi-fi established but I had no issues getting mine working since I called Canon customer service and had them walk me through the process.  Bottom line, I love this camera and it is worth every penny!", "Date": "January 22, 2013"}, {"Title": "Great Product", "Author": "Nirvana", "ReviewID": "RWH7AT98P3TTY", "Overall": "5.0", "Content": "I love this camera.  The picture quality is great and it's very easy to use.  The new wifi feature makes this as camera as useful as the camera app on the iphone.  The only complaint I have is the setup process is not as friendly.", "Date": "January 13, 2013"}, {"Title": "I have posted videos on Youtube with this camera.", "Author": "Dennis K. McCann", "ReviewID": "R2B1M2GTGIJFR", "Overall": "4.0", "Content": "People in my dance group ask my to come and tale pictures and videos.  I selected this camera because it has good low light lever response.", "Date": "February 15, 2014"}, {"Title": "Exellent, compact camera", "Author": "G. Courtade", "ReviewID": "RXKIF00N6BB03", "Overall": "5.0", "Content": "I have owned several cameras in this \"S\" series and this is the best so far. Everything works well and it is nicely made. The image quality is superb especially for the size of the camera. It's very compact and convenient as well as very capable. MT highest recommendation!", "Date": "February 13, 2014"}, {"Title": "Compact, but with just enough controls", "Author": "JH", "ReviewID": "R2BNKROL3E6ZQD", "Overall": "5.0", "Content": "The S110 is a pretty little camera that fits easily in a pocket or jacket, and at the same time takes nicer pictures than a smartphone. What's really neat about it is that it's got just enough manual controls to satisfy someone used to a larger, camera with more manual controls. The control ring around the lens is especially neat.", "Date": "February 3, 2014"}, {"Title": "Gave it as a gift", "Author": "Dustin Cote", "ReviewID": "RAQNUP5RBL7RQ", "Overall": "4.0", "Content": "Seems like a good camera, but I gave it as a gift so I don't have too much insight.  It looked pretty solid out of the box and my parents (not terribly technically inclined) were able to figure out the basics of taking pictures and connecting it to wi-fi.", "Date": "January 31, 2014"}, {"Title": "Good Camera", "Author": "Jack G. Scott", "ReviewID": "R12GITUJLU1GRK", "Overall": "5.0", "Content": "Purchased as a Christmas gift for my son.  So far, he likes it a lot, but hasn't really had much of a chance to use it yet.  The camera arrived when it was promised and so far so good.", "Date": "December 13, 2013"}, {"Title": "Wifi function is GREAT!", "Author": "M. Hsu \"Lizard\"", "ReviewID": "R1EBB69SNU7ZYI", "Overall": "5.0", "Content": "I was debating on S100 and LX7 last Thanksgiving.  S110 has signifcant higher price at that time. S100 was slow and has lag. I ended up with LX7. However, I found LX7 was a bit large size for me especially with case on it. For the whole year, I ended up taking my DSLR D90 most of the time since LX7 wasn't really that convenient after all(e.g. lens cap, setting, Will go into more detail). I sold it last month.Then, I notice the price drop on S110. It is much smaller camera. Excellent pictures! exactly what I need.  The major function that I like the most is the WIFI. I can set my Nexus 5 to connect to S110 and upload my photos into my Facebook, Flicker, or let it dropbox!!!  I can share it, back up, and not afraid of sd card problem or camera lost!  I think this Camera is much better deal and take much better pictures and has function similar to Samsung Galaxy Zoom.", "Date": "December 3, 2013"}, {"Title": "small sweet different", "Author": "soumya sitaraman", "ReviewID": "R795PM33S634A", "Overall": "4.0", "Content": "I like the HD video this little camera has to offer and the standardized battery that is the same as my earlier powershot.Was a little disappointed with that cannon reconfigured buttons and changed working features. Client comfort comes from familiarity and ease of use.5x zoom was a BIG down…there are other options with 20x and a better megapixel rating but batteries, chargers etc are different!!!!!", "Date": "April 20, 2013"}, {"Title": "Worth buying", "Author": "Pen Name", "ReviewID": "R1KB1ENFFLSP4T", "Overall": "5.0", "Content": "Great camera for the price. Loving it. Best buy ever. From the first moment I started using it, I fell in love with it! Easy to use controls plus great pics", "Date": "February 22, 2013"}, {"Title": "Canon PowerShot S110", "Author": "Michele Wahnsiedler", "ReviewID": "R2X5TA5IYQCQ4F", "Overall": "5.0", "Content": "This is a great little camera.  It's easy to use, and it takes great videos too.  It's simple enough for me to understand.", "Date": "February 19, 2013"}, {"Title": "Wanted to love it, instead returning it", "Author": "lindros", "ReviewID": "R2G4JPMRHZZU9X", "Overall": "2.0", "Content": "As the owner of an S95 (purchased December 2010 from Amazon), I wanted to love this camera.  We had to replace the S95 after it met its fate (or rather, dust and some liquid permeated the image sensor).After 5 days with the S110, it's going back.  The price is incredible - 41% less than the S95 in a mere three years.The feature set - on paper - is also class-leading (including a touchscreen).  The camera is also faster to start up and menu responsiveness is outstanding.  The rough surface is great to hold - very impressive and smart by Canon.Unfortunately, the image quality has been terrible (blurry on 80% of the shots).  The flash coverage is rubbish (compared with my S95).  Not sure why it's all so bad... but I'm holding out for the next generation.", "Date": "December 18, 2013"}, {"Title": "Very good,I very like it", "Author": "zhoubin", "ReviewID": "RMAP4QY6QQTK5", "Overall": "5.0", "Content": "Black Very good,I very like it.Hope can buy such a good product！It supports multiple languages, very good！If cheaper then even better。", "Date": "December 31, 2013"}, {"Title": "Easy to Use camera.", "Author": "Zuhair Y. Al Zuhair", "ReviewID": "R3P4S45931RUA5", "Overall": "5.0", "Content": "But as many other electronic devices, there is no catalog with the camera explaining in details all the different options it can perform. have to search more to find out how it really operates", "Date": "July 6, 2013"}, {"Title": "Superb functionality", "Author": "heri", "ReviewID": "R2412E8EQ43QLB", "Overall": "5.0", "Content": "Just love the camera and fully enjoying its instant clicking n opening closing . Light weight is big advantage and the colors in image reflects as amazing and picture quality is awesome!!", "Date": "January 22, 2013"}, {"Title": "Meets all my expectations", "Author": "Gary Scott", "ReviewID": "R1VRSKMKQ238VN", "Overall": "5.0", "Content": "Meets all my expectations easy to use and has all the features I require from a small point and shoot camera", "Date": "January 19, 2013"}, {"Title": "Canon PowerShot S110 12.1 MP Digital Camera with 5x Wide-Angle Optical Image Stabilized Zoom (Black)", "Author": "BONNIE J MATTHEWS", "ReviewID": "R15RA0N2DULYKK", "Overall": "5.0", "Content": "I am a Canon user and I love this PowerShot. It is everything you could want in a compact/pocket size camera. I have used it in various lighting situations and Canon lives up to its name once again. I received the camera as promised even during the Christmas holiday's, the package was perfect and I am very happy. You can't go wrong with this purchase!", "Date": "January 18, 2013"}, {"Title": "Amazing little camera", "Author": "Amazon Customer \"Jim B\"", "ReviewID": "R2G4K4NI5K87BX", "Overall": "4.0", "Content": "This camera is truly amazing. Lots of great features. The only drawback is that it's just a 5x zoom. If you don't need more zoom than that, this camera is great for most applications.", "Date": "January 4, 2013"}, {"Title": "Furious", "Author": "Nathan's Mama", "ReviewID": "R1ZHZG2XB9TNWS", "Overall": "1.0", "Content": "We returned this camera in January since the lens cover stopped opening.  Just now had a chance to review the video we took with it on Christmas Day.  The videos are horrible and pixelated. Not a clear picture at all.  I have a canon 40D and am a canon person but I am incredibly frustrated at how my twins' first Christmas videos are essentially ruined.", "Date": "March 26, 2013"}, {"Title": "Stopped working within 4 months", "Author": "brittany frederick", "ReviewID": "R2QKX0236955KI", "Overall": "2.0", "Content": "I barely used this camera.. I just used it every once in a while for a few videos and photos every now and then. Within month four of owning it, it just stopped working. It won't turn on. I tried recharging the battery, I even bought a new battery thinking maybe that was the problem- but it was in fact the camera itself. I'm very upset.", "Date": "January 20, 2014"}, {"Title": "Could Have Been Great", "Author": "kwikgoal", "ReviewID": "R2APXHW2AIIHW2", "Overall": "3.0", "Content": "I purchased this camera as a replacement for an older Canon.  The reviews for the camera were fairly positive, with the stickler being the possibility of getting the lemon lens.  One of the deciding factors for me when compared to others in this price range was that the batter/charger were the same as my old camera.  Well, I have been using the camera for several weeks now, and believe I have seen the good and the bad of this camera.Pros:Solid body.  Built to last.Generally great pictures.Auto focus works very well.Auto flash is very good.  Only comes on when needed.Good view screen with decent touch interface.Videos are good to.Cons:The flash is in the wrong spot.The picture snap response is slow (auto focus?).The processing speed is slow (buffer?).  Forget rapid shooting; you really have to wait a long time between pics.Unfortunately, I didn't hold this camera before I bought it.  When the flash comes on, inevitably my finger is in the way.  I don't see how you can hold this camera well without running into this.  Maybe it is designed to be used with only one hand, but I won't probably ever do that.  I have had others play with it too, and they say the same thing (without any prompting).The problem I had with my old camera was that it was too slow when I lined up a shot and pressed the button.  Sometimes it seemed like 2 or 3 seconds before it would snap the picture.  It also took a long time before you could snap another shot.  I thought some newer hardware would fix that, but I was wrong.  Different body, different software, same issues.I will keep the camera, but will definitely try the camera before buying next time.  Though the camera is generally very good, the cons really weigh on this one.  I would not recommend this camera to anyone.", "Date": "January 13, 2014"}, {"Title": "Good camera but not yet a Canon", "Author": "Point and shoot camera buying guide", "ReviewID": "R368CR1WZ1R0DM", "Overall": "4.0", "Content": "Overall, I quite satisfy with this camera. There is only one thing that I expect more from a camera with this sensor size is the ISO performance. Despite the fact that Canon makes this camera aiming for low light shooters, this camera is not quite there yet. For a general shooting purpose, it's perfect otherwise.More reviews at http://bestpointandshootcamera4u.com", "Date": "June 19, 2013"}, {"Title": "Great Camara", "Author": "M. Rodriguez", "ReviewID": "R3A1WBBCAKPARE", "Overall": "5.0", "Content": "By far,  the best pocket camera in the market!!! I highly recommend it!! You can take great pictures and not spending a lot of money!!", "Date": "January 29, 2014"}, {"Title": "Great camera!", "Author": "R. Belleza", "ReviewID": "R2KNVT49UP30AG", "Overall": "4.0", "Content": "Great camera, love the features especially that it's WiFi capable. Love the feel of the body. Only negative is that it doesn't have a viewfinder, but that didn't matter to me.", "Date": "November 16, 2012"}, {"Title": "bad quality", "Author": "Tatyana", "ReviewID": "R3Q1LENJEXYXNT", "Overall": "1.0", "Content": "just after few months of use, camera started to overheat. And after that time you can't even exchange it or return.", "Date": "May 27, 2014"}, {"Title": "canon s110", "Author": "Marty J. Burke \"burkex1\"", "ReviewID": "R1AH9WYFMDUJBH", "Overall": "4.0", "Content": "Can someone help me with the setting for this camera.. just want to take good pictures of kids in sports and family stuff. thers 16:9.. 3:2 4:3 etc.. which should i be on..the one issue I dislike is the on/off utton hard to turn on", "Date": "April 1, 2013"}, {"Title": "Best Christmas present ever!!", "Author": "Jackie Martino", "ReviewID": "R3589M6BKUYF28", "Overall": "5.0", "Content": "My dauughter  has wanted a good camera for a long time . So she was so excited when she opened this camera!She has a cousin who has the 100 model and her dad says its as good as the rebel without the bulk", "Date": "January 23, 2013"}, {"Title": "Z Best Point & Shoot", "Author": "T. J. Williams \"Closet Billonaire\"", "ReviewID": "R31XUXNV8P92FZ", "Overall": "5.0", "Content": "This little camera is amazing.  Delivers great shoots in low light and outside on bright sunny day.  Perfect size--easy to carry, take along-- even when shooting with Nikon D600 DSLR.  Highly recommend!!", "Date": "January 19, 2013"}, {"Title": "Wasn't that great the first night, much better now.", "Author": "Farshad", "ReviewID": "R1DJHYEKIHH03S", "Overall": "4.0", "Content": "The first night I opened it, I was not at all impressed, I wish I had just kept my SD4000 IS PowerShot and asked for something else for Christmas.  I took pictures side by side and it wasn't that impressed.  Not sure what the problem was then (condensation?  The box sat outside for hours before I brought it in and opened it) but it has gotten better.1) There are lots of improvements over my older Canons but this is definitely bulkier and bigger2) The wireless feature works great with my home wifi and my Android.  Took no time at all to setup either.3) Low light pictures do seem a lot more bright, as if there is a hidden flash, but are grainy.4) Camera is solid, feels great in your hand5) The \"ring\" isn't a smooth turning one, it \"clicks\" quite awkwardly between each setting, so you go clicking through options and not in a way you can run through them, one at a time, and not smooth at all, I find myself using the menu items instead.6) The touchscreen is awesome!7) Touchscreen picture taking is useless, you'd be taking pictures all the time, there is no way to hold the camera really without touching the screenIn the end, I was quite happy to get a new and fairly cheap camera, but it simply isn't THAT much better than my SD4000, except in low light, and then not super low light, just low light.I have since ordered and received the Sony RX100.  Which is why I waited to return this camera, wanted to compare them side by side.  After a couple of days of \"playing\" (yes I'm clearly not a professional, but I'd guess nor are most consumers), here are my thoughts:1) The picture quality of the RX100 is better, but not always, and not that much more, sure it has a lot more pixels, but over all, not a huge difference.  For just pictures, for ordinary consumer, I'd say get the S110, for being almost half the price, the pictures aren't THAT much different.2) The RX100's menus are awesome for those who aren't well versed in photography, it actually explains what each setting does and is for, even with a sample picture, and then within each has sub menus explaining what they do, with yet more pictures, and finally has a help button.  FANTASTIC!3) S110's wifi is great, RX100 has none.  Sending pictures to your phone and then posting or emailing them on the fly is really great.4) As great as the S110's low light \"brightness\" is, the RX100 is a good 10 times better on really low lights.  When there is enough light for you to see fairly clearly, they seem close, but when it's dark enough where you can't make out too clearly what you are looking at, and you can no longer see the colors, the RX100 can still take pictures that look like a cheap camera WITH a flash took (with a flash of course they both look great), where as the S110 takes pictures similar to what your eyes see when it's that dark.  The RX100 really shines with no flash in pretty darn dark settings.5) There are lots of other things the RX100 does, but might not be of interest to you, but they are there, like take pictures while recording video (but only in interlaced video, when I put it on p it doesn't let me take pictures), but those pictures aren't as great as doing so without video recording in room conditions.  The function ring is much better as well.6) S110's touchscreen awesomeness is missing7) You can still put an S110 in your back pocket, though it would be like a thick heavy wallet.  The RX100 however is almost a centimeter thicker and most of that is the lens sticking out further so I wouldn't call it a pocket camera.  The S110 feels better (grainy, square metal feel, but the Sony has a smooth more rounded metal finish) and looks better.", "Date": "December 29, 2012"}, {"Title": "Apple compatibility", "Author": "sbenisch", "ReviewID": "R1A2GSIBS2NJ7O", "Overall": "5.0", "Content": "Apple's Aperture recognizes the RAW format used by this camera.  This camera's WiFi is designed to connect easily with Apple's Macs.These features (among others) appeal to me, as I shop for a new camera.I'd appreciate comments from Apple users.", "Date": "April 17, 2014"}, {"Title": "Still learning everything it can do.", "Author": "Rosemarie Hayes", "ReviewID": "R390TBG0F9C2ZQ", "Overall": "5.0", "Content": "Enjoying the pictures I think you should say what you need to have the camera work in the display, it would make it easier I had to order twice.", "Date": "May 31, 2013"}, {"Title": "We love Canon Camera's", "Author": "James Hayden \"Tell us about yourself!\"", "ReviewID": "R2E4S6P24SW1T6", "Overall": "5.0", "Content": "This Canon Camera is awesome.  The pictures are tremendous and the features are wonderful.  Wi-Fi is great.  Buy it now!  You will not regret it!!!", "Date": "January 7, 2013"}, {"Title": "iffy camera", "Author": "N. Chaudhari", "ReviewID": "R139FT2J3GU6Q1", "Overall": "2.0", "Content": "I've been using this camera for a while now and it seemed decent at first but I think I can say now that I'm not a big fan of this one. I have almost canon exclusively and have loved many of my previous ones like the s1000 and the a80 along with my dslr. In a pinch I  like to rely of the auto setting and just shoot and go. Maybe I still need to figure out the settings but the focus target is so erratic a lot of shots just come out focused on something seemingly random. In that hurried moment, the picture is lost, something you may not even realize until you have time later to look them over. I just took it again on a trip hiking and while some did come out very well, about 1/4 of the shots got thrown away from bad focus or too blurry (even trying to balance on a rock). Some pictures will come out in raw+jpg while others just jpg. More settings and issues I need to reread on. So overall as canon pocket cameras go I wish I could return this and try another one.", "Date": "August 12, 2013"}, {"Title": "Can't connect to Wi-Fi if you're on a Mac", "Author": "heel5man", "ReviewID": "R1OKC0M9OCCBYA", "Overall": "3.0", "Content": "I have owned the S90, S95 and S100 and they're great cameras. I bought the S110 mostly to get the wi-fi and GPS. The problem is that to activate the wi-fi, you need to be able to connect the S110 to your computer and it couldn't be done with a recent version of Mac OS. Canon tech support said the driver was due in mid-October, but that it was delayed. I returned the camera. Hopefully it will be available soon, but I wasn't willing to wait for it.", "Date": "November 5, 2012"}, {"Title": "Many Thanks", "Author": "Ahmed Al seraihi", "ReviewID": "RA4RN5DZ9G68F", "Overall": "5.0", "Content": "I received my order in same date and at good candation  5 star is good .Many Thanks for you", "Date": "February 20, 2013"}, {"Title": "Billy", "Author": "William Bowman", "ReviewID": "R3C61A2ID116KM", "Overall": "4.0", "Content": "Expensive. Meets expectations and is intuitive and easy to use. About ae food as a point and shoot compact camera gets.", "Date": "January 27, 2013"}, {"Title": "Canon PowerShot S110", "Author": "Ashley Smith", "ReviewID": "R1MULUSFWM9GPE", "Overall": "1.0", "Content": "I bought this camera bases on reviews from another website. When I received it from amazon you could tell the box was already opened and the camera had been used. Finger prints all over the screen. But that was not why I gave it one star. It was because all the pictures I took with it came out blurry and with a yellow tint to them. Sending this camera back to amazon.", "Date": "December 28, 2013"}, {"Title": "Canon S110 Digital Camera", "Author": "Motorcycle Traveler", "ReviewID": "R2A94KWG17G7CP", "Overall": "3.0", "Content": "The camera arrived with everything in the box that should be there.  The number of shots per battery charge is poor enough that I went to the effort to purchase a spare battery (not from Amazon).  Another small issue with the camera is the pop-up flash.  It's right where you tend to hold the camera with your left hand which blocks the flash.  If I had it to do again, i might pick another camera (different flash location, and a longer zoom.)  Picture quality is decent.  12mp seems to meet my needs.  Operationally, it seems pretty straight forward to operate.  Only real disappointment is that 2-3 weeks after purchase the price dropped by over 12%.  Had I known that was coming, I would have waited to purchase.", "Date": "January 4, 2013"}, {"Title": "A good camera", "Author": "David McAllister", "ReviewID": "R3BVKPG3NIBCRB", "Overall": "4.0", "Content": "...but it is impossible to insert the hand strap into the place allotted for it. I guess you just have to be careful not to drop the camera while using it. They should ship them with the strap already attached.", "Date": "August 4, 2013"}, {"Title": "can't connect iPhone 5 to camera", "Author": "tc", "ReviewID": "R2YUI96NZXOX60", "Overall": "3.0", "Content": "I've been trying for 2 days to connect the camera using the camera as an access point to an iphone 5.  The iphone just won't connect.  There is a little addendum in the box that explains that when trying to connect an iphone, it will \"appear\" to not be connected and the network connecting icon on the iphone will keep spinning, but it really is connected.  Well...that isn't the case for me.  It just won't connect.I've been on with canon tech support for 30 minutes now (on hold now)...and they only have androids to test it on.  So he is checking for other solutions.But as of now, the direct connect from the camera to the iphone is not working.", "Date": "December 13, 2012"}, {"Title": "case", "Author": "Zzqamanda", "ReviewID": "R2LIDKP5L5URO2", "Overall": "4.0", "Content": "It was supposed to contain a case but it didn't. Besides that, I found the product favorable.I like it", "Date": "December 13, 2013"}, {"Title": "Is Canon going down the tubes?", "Author": "hhnewman", "ReviewID": "R3QF10V18N5N2T", "Overall": "2.0", "Content": "I have been a Canon lover for the last twenty years and bought an s110 about six weeks ago, choosing it over the earlier models because of the wifi system to connect to my Macs. To my complete dismay, it is a mess; I've spent hours attempting by myself to download image to no avail. I've tried their software which, after installed, appears to not be removable unless you trash the entire Canon Utilities folder (I had hoped that their wifi app in itself would do the job without the annoying other apps).  Furthermore, after you install CameraWindow, you can't disable it.I then called Canon, and wasted an hour with a fellow who know nothing and who kept putting me on hold to talk to other people.  In the end the best they could offer was to install their proprietary software, which came out to be a nightmare.So, Canon, a company known and respected for quality, knowingly puts out a defective product and collects money from its devoted customers, then forces them to use defective software.In my world this is called 'Squeezing the Monkey,' the last gasps of a corporation on the way out.", "Date": "February 25, 2013"}, {"Title": "I bought the camera for the wifi capability", "Author": "steve allen", "ReviewID": "R30NIRFHTFRTKS", "Overall": "1.0", "Content": "after an hour with the Canon tec dept who could figuer out how to link the camera to our wifi they blamed it on ATT.  Then an hour with a very knowledgeable ATT tec person who finally said the problem is clearly not our U Verse wifi.  I had been able to simpliy link both my home computer to the UVerse wifi with no problem but not this camera.  I called back to Canon tec group.  This time I got a very smart guy who tried it once and seeing it didn't work said this Canon  Power Shot S110 will not connect to wifi.  He went on to say it is the best camera of its type the Canon has made, but the wifi part doesn't work.  He went on to say the only camera that will link to wifi is the N. The N isn't the camera I wanted.  Since the only reason I bought the camera was because of the wifi capability it turned out to be worthless to me.", "Date": "May 22, 2013"}, {"Title": "Canon camera a piece of junk", "Author": "Herbert Glaser", "ReviewID": "R3PSKT3UQP9MKE", "Overall": "1.0", "Content": "I will never buy another Canon camera product. Purchased a Canon S100 15 months ago. The camera drained the two new batteries I bought plus the  included one. I returned the camera to the retail dealer who sent it to Canon for repair. The warranty expired after 1 year and Canon wants $195.00 to repair a camera that cost about $300.00. What a piece of junk....I barely used the camera during the 15 months of ownership.", "Date": "February 21, 2014"}, {"Title": "Does not work in cold weather", "Author": "Paupard", "ReviewID": "R1T3TARERL6V5X", "Overall": "1.0", "Content": "This camera does not work outside when it is cold. It is a useless camera unless you live in a warm climate.", "Date": "January 19, 2014"}, {"Title": "No Video", "Author": "W. J. Smith \"Wendy\"", "ReviewID": "R1ODV1XU4A4WT9", "Overall": "1.0", "Content": "For some reason the video on this camera has NEVER worked.  When I press the button and have it on the video setting, it just takes a still shot.  I just contacted Canon to see what they can do...", "Date": "September 19, 2013"}, {"Title": "Don't buy for WIFI, Terrible Usability", "Author": "A. Alami \"climber\"", "ReviewID": "R1YY6A9ZE6LI8K", "Overall": "2.0", "Content": "False advertising on the WIFI.  Purchased this model mainly because of the WIFI and have been very disappointed with how hard it is to setup.  First off the package comes with a CD for install, out of our 3 computers in the house none have a CD player.  Canon's website is not user friendly and after 30 minutes of downloading various files we still can't get the wifi to work, won't connect to our home network, printer, laptop.  The download just included thier image browser program which is lacking when compared to Picasa.  I just want a simple camera that's intuitive, easy to use, and works. They should have one package bundle to download and take lessons from Apple.  The help files on the canon site are lacking in information or detail.  BTW- I'm a very technical person who runs an internet startup.", "Date": "July 12, 2013"}, {"Title": "No Viewfinder in This Nice Little Camera", "Author": "Spoilin' Grandma", "ReviewID": "RKHJMVNYDINM1", "Overall": "3.0", "Content": "The Technical Details (under \"See More Technical Details\", the expanded list) state that this camera has an electronic viewfinder.  IT DOES NOT!  I ordered this camera on December 4, 2013 and received it on December 10.  Before I ordered it, I contacted customer service to confirm that it did indeed have a viewfinder, as I had found conflicting information on various sites.  The rep stated with absolute certainty that it actually had a viewfinder.  It does not.  During three different communications with Amazon people, I was assured that the description would be changed so that others would not experience the same inconvenience that I did.  Now, 42 days after my purchase, they still have not changed the description.This looked like a great little camera--good reviews, convenient size, etc.  Unfortunately, because of the nearing holidays and the loss of time regarding this mixup, I was pressured into buying another Amazon camera (which was quite overpriced) and given more inaccurate information and assurances from Amazon rep's.  The bottom line is that I spent approximately $475 for another camera to get the viewfinder and still have not received the credit I was promised.  I was told to order it with expedited shipping, and I would be reimbursed for the special shipping.  Now they refuse to refund it.  I waited for more than a month to write this review, hoping I would be treated fairly, but Amazon has refused to honor their rep's commitments.  This is the greatly condensed version of this fiasco.  It has been a total disaster.'", "Date": "January 15, 2014"}, {"Title": "clips.blur.on.and.off", "Author": "branda", "ReviewID": "RRQ65UN6Y9PP2", "Overall": "1.0", "Content": "The camera is not what I expected to be for the money I paid.The flashing doesnt always work and it takes too long to snap a picture from one to the next..The worst part is that.the.camera.blurs.while.taking.a.clip..I.already.received.a.replacement.from.Amazon.but.the.replacement.is.just.the.same.faulty....", "Date": "March 6, 2014"}, {"Title": "Review_Canon powershot s110", "Author": "JUNG,SUNKYUNG", "ReviewID": "R3P2PWE7P3MJ6S", "Overall": "4.0", "Content": "Actually, i don't know how to use this and carmera.but it is useful and easy for me.it is very good", "Date": "January 3, 2014"}, {"Title": "Won't work with Windows 7", "Author": "Michael March", "ReviewID": "RABOS3TQLXU13", "Overall": "1.0", "Content": "I got the camera, loaded the software, took some shots. I went to download, it downloaded 80 then froze. I called Canon they said, \"Change your operating system to Windows 8 from windows 7. The sales pitch says, of course, that it works with Windows 7.  I'm done with Canon", "Date": "January 30, 2014"}, {"Title": "No way", "Author": "AH, Florida.", "ReviewID": "R1A8K83H7LUSLR", "Overall": "1.0", "Content": "Small and all that but pictures lack clarity, zoom is a mess as well.not comparable to a dslr, better than an iPhone camera but not by much", "Date": "December 15, 2013"}, {"Title": "light problem", "Author": "Bluesea", "ReviewID": "R2VQ4HQTNMP4LP", "Overall": "1.0", "Content": "It is not easy to hold with two hands because of the light position. And the light is too strong in the short distance. The picture is too white when using the light. The white balance is the big problem when using the light.", "Date": "April 2, 2014"}, {"Title": "A step backwards", "Author": "Simple honest man", "ReviewID": "R30MZ4LEEHMED0", "Overall": "2.0", "Content": "I wish I hadn't purchased this model.  The previous one had the features I wanted .  this model has GPS, but only if connected to your iPhone.", "Date": "January 27, 2013"}, {"Title": "Rullophotography.com says buy something else", "Author": "Rayboy", "ReviewID": "RL3RUCDIYW3DG", "Overall": "2.0", "Content": "The focus is sooooo sloooow it will blow your mind, especially if you are used to the speed of a DSL and yes I know they are two different animals BUT wow!!!", "Date": "September 13, 2013"}], "ProductInfo": {"Price": "$449.99", "Features": "Built-in Wi-Fi for Image Transfer to Social Sites, PC, IOS and Android Devices\n5x Optical Zoom with 24mm Wide-Angle Lens and 3\" capacitive touch screen\n1080p Full HD Video With a Dedicated Movie Button,12-bit Multi Aspect Recording in RAW + JPEG\nHigh-speed AF, High-speed Burst HQ for a maximum of 10 frames\nNB-5L Rechargeable Lithium-Ion Battery Pack, 3.7VDC, 1120mAh", "Name": "Canon S110 12.1 MP Digital Camera with 3-Inch LCD Screen (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41UzqD8WzBL._SX300_.jpg", "ProductID": "B00CBYMWNQ"}}