{"Reviews": [{"Title": "impressive", "Author": "Dcraftfrombr", "ReviewID": "R3QYVY4TAIVXAG", "Overall": "5.0", "Content": "As an owner of many Lumix cameras in the past including the DMC-FZ30, FZ50, FZ100 and the ZS3, I had always hated that I could not take good low-light pictures. Particularly I wanted to take pictures inside the home without a flash and be impressed. I did not want to buy a DSLR and have to learn how to be a photographer, I just wanted a point-n-shoot that would take good idiot-proof pictures. Finally, it looks like the DMC-LF1 is a winner in that category. For a small pocket camera that has an EVF (very helpful when shooting outdoors)I think the pictures look great. You can see a few sample pics at[...]I was worried that the 7x zoom may not be enough, but the 1st 4 sample pictures show that it is. Most of the sample pictures were taken with the iA mode.Also like the option to control the camera from my smartphone. To position the camera across the room, sit down in my chair and take my own picture is nice.I have yet to see how it does in trying to take pictures of bands in a nightclub setting. I don't give it much hope that a $500 pocket camera can do that justice, but I'm hopeful.The only negative comment I can make is that the on/off button is in a bad spot. I find myself reaching for the shutter and accidently turning the camera off insteadAdded a few more pics including some Hot Air Balloons.Even video taken in a nightclub came out pretty good. However, the video recording apparently stops at 30 minutes or about 3.5gb. I uploaded a video clip, but since smugmug does not support the mt2s format, I had to convert it to mp4 which is much more compressed.", "Date": "July 13, 2013"}, {"Title": "A great all-around, connected, pocket camera", "Author": "maxmasa31 \"maxmasa31\"", "ReviewID": "RJDV7UU5OVT9F", "Overall": "4.0", "Content": "Right off the bat, no, the Lumix DMC-LF1 does NOT produce images that rival the RX100.  I've owned both and if image quality (resolution, sharpness, noise, shallow depth of field) is your ONLY priority, stop reading this review and go buy the RX100 or RX100 Mk II.  The larger 1\" sensor really does make a big difference.But image quality isn't the be-all-and-end-all of cameras, otherwise I wouldn't have sold my Sony four months ago. So my review won't be comparing the two cameras, as that's already been done to death.  No, I'll be focusing on why I chose the LF1 and what I see are the pros and cons.Pros:- Size.  The LF1 is surprisingly small, especially taking into account that it has a viewfinder.- Connectivity.  I love that I can easily connect to and control it or transfer images to my Nexus 7 and iPhone 5.  If you have an NFC-compatible device, it pairs easily, without the need to manually input the SSID and password.  It can be hit-or-miss at times and may take up to a minute to pair devices.- Viewfinder.  This is a pro and a con, actually.  I love that it's there, but it's of VERY low-quality (washed out, low-resolution, tunnel-vision).  Despite that, I use it regularly and it does have a diopter adjustment for users with glasses.- Control.  With the control ring on the lens, the wheel by the d-pad in the back, and the Fn and Q button, most users will have access to most controls they need quickly.- RAW.  Another pro and con.  I like that I can shoot RAW, but I don't like that it's not the open DNG format.  C'mon camera makers, just standardize DNG!!  You also can't preview RAW photos in the iOS or Android apps--JPEG only.- Zoom.  My zoom lens for my \"big-boy\" camera is only about 3x, but the LF1 has a 7x zoom.  If I'm getting a compact camera, I want something that goes farther than that, otherwise, what's the point?  I'd have two cameras with almost the exact same focal length.- Creative control.  I love that if I shoot in JPEG, I can later add all the in-camera effects.  For example, with all the other cameras I've used, if I wanted an in-camera B&W; photo, I'd have to shoot in B&W; and that's all I'd have.  With the LF1, I can use any PASM mode and just convert the image later using any of the 13 effects.- In-camera battery charging.  Yes, I know some people hate it, but I actually love it.  I don't like lugging extra chargers on vacation.  Plus, I always have a USB battery pack with me, so I can charge the camera anywhere and not worry about swapping batteries.  No dead batteries!- Made in Japan.  Checking the photography forums, I know this means something to others as well, so I wanted to put it out there.- Excellent image stabilization.  And I mean EXCELLENT.  Because of the lens ring and viewfinder, I tend to hold the LF1 like a mini rangefinder, so even without stabilization, I could probably squeeze off a clear shot at 1/25 second.  With Panasonic's IBIS, I fired off a surprisingly blur-free image at 1/4 sec.!  Crazy!Cons:- Poor customization.  The control dials can only be set to a handful of preset modes, many of which aren't necessarily the modes I'd use or are outright redundant.  I guess I'm spoiled from having used the Ricoh GRD4 for the past two years, but I like being able to assign any function I want to any button.- No Auto High-ISO limits.  Let's be honest, with a compact camera, you don't want to shoot higher than ISO800.  Other enthusiast compacts allow users to put an ISO limit, but the LF1 does not, so I'd be wary of using AutoISO, lest you fire one off at ISO3200 and have a watercolor painting instead of a photo.- Proprietary charging cable.  Well, I don't know about proprietary, as I think I've seen the connection before, but if Sony can adopt microUSB (and they're notorious for proprietary everything), I don't see why other companies can't.  It's just one more cable I have to carry and worry about losing.- No grip.  When a camera is this small, it needs one.  The extra-smooth metal finish only exacerbates the \"bar of soap\" feeling.- No in-camera RAW conversion.  Some premium compacts offer this, so I was sad to learn that the LF1 does not.  This is especially troublesome, as you can't view RAW files in either iOS or Android apps.  So if you want to use your tablet or smartphone to preview your images, you'll have to shoot either completely in JPEG or in JPEG+RAW (which wastes memory card space).Overall, I'm quite happy with the LF1.  It offers many features I had wanted in a compact camera and with good image quality up to ISO800 (and even ISO1600, if you convert to B&W;).  The IBIS, f2.0 lens, and RAW all help to counteract the low-light woes of most compact cameras, allowing most photographers to keep noise to a minimum by shooting at ISO400 in most situations.  It also excels in macro photography, with a 3cm minimum focus distance at full wide and bokeh looks quite pleasant.The LF1 isn't for everyone, but if you want a viewfinder, longer zoom, and wireless connectivity with remote control, this is your only choice that will fit in your pocket and still be under $500.  The number one reason to buy any camera--image quality--is certainly still there, but it's not perfect (no camera is), so for that, I'll give the Lumix LF1 a very solid four stars.--Update 11/25/13: After taking the camera with me on vacation and using it extensively, I've noticed some things I didn't cover.  The biggest being the poor placement of the power button.  I can't even count how many times I accidentally turned it on when I was putting it into my camera pouch or even just holding it.  Based on its position, it should be a switch instead of a button to prevent accidentally extending the lens while in a pouch.This also pointed out another flaw: the power button can be unresponsive.  There were times when I thought I had turned the camera on while in its pouch, but was mistaken.  However, while this was helpful in not damaging the lens, it was a giant pain when I wanted to quickly take a shot and the camera wouldn't power on!I would lower my rating to 3 stars because of these issues, but I found the handling and responsiveness (shot-to-shot and auto-focus speed) of this camera, combined with the excellent shake reduction exceeded my expectations, so I'll give it 3.5 stars.", "Date": "October 21, 2013"}, {"Title": "Good but not perfect", "Author": "now what", "ReviewID": "R1Q7IU95BPP85H", "Overall": "4.0", "Content": "Just got my new LF1 and charged up the battery.  So far, I'm glad I bought it.**See updates below--I'm still glad I bought it.Background:  I do mostly sports and action shooting, outdoors.  I also do some candid shots of people, and some scenic shots.  I exhibit in two online galleries (occasionally I make a sale) and I'm currently putting together a photo book.  I like to do post processing, including special effects.  But I don't want to do it to compensate for poor image quality out of the camera.I have two other cameras, FZ150 and Pentax k-5.  I've had a lot of others, from \"tough\" cams to other DSLRs, but I'm not a collector.  My goal is one camera for each purpose: DSLR for high res and surfing from a fixed shooting spot, \"bridge\" superzoom for outdoor action shots when \"walking around\" (I don't always like toting the heavier camera).  I also want to end up with a \"tough\" cam for water & surf shots; so far I have had the Canon D10 (sold it) and the TG-1 (returned it)--I'm still waiting for a \"tough\" cam with decent IQ and, hopefully RAW.  The TG-1 was great in most other respects (although it lacked user control of shutter speed, etc.), so I'm hoping that one day Oly will decided to add a decent sensor.  Finally, I want to have a small camera with a viewfinder (an absolute must; this is why I got rid of the otherwise excellent ZS15) and decent IQ, with RAW a highly desirable feature.  Finally, I want some zoom and I absolutely require decent burst: absolute minimum 4fps (5-7fps is better) and enough burst depth for at least 3 seconds of action.On paper the LF1 fills the bill: decent-sized small sensor, reasonable pixel pitch, OK zoom, good burst, RAW, VF.The bad----Battery charging in camera is inconvenient, and made worse by the absurdly short USB cable supplied.  C'mon, charge me 5 cents more and add a foot or so to the cable.  Better yet, provide external charger.  This is the first thing on my \"to buy\" list.  I don't know how long it actually took to charge the battery, since I was at the dentist the whole time.  The manual says 160 minutes, I don't think I was gone quite that long.--White camera is not all white; the back is an ugly putty color.  I'm not trying to make a fashion statement, but if you tell me it's white, sell me something that is white all over.--Camera feels a little cheaper in terms of build than, say, the ZS15.  Also doesn't have the same comfortable (pleasurable?) feel when operating buttons and dials.--[Added after further use] The rear dial also has a \"push in\" function.  Dual functions are nice, but in this case I have found that often when trying to turn the dial to change the shutter speed (Manual mode), I apply enough downward pressure to activate the \"push in\" function (Flash).  My solution is to re-train myself to turn the dial on the other side, using a different finger.  Maybe there's no way to design around this type of problem, but I have never has this type of thing (one control interfering, basically, with another) with any other camera I've owned.The good----So far images are very acceptable.  I haven't noticed the extreme fall-off in resolution at the corners reported by many users and reviewers.  I made a point of taking some pictures of foliage at full zoom and the corners looked fine.  In terms of overall image crispness, I think the FZ150 does better*, which is a bit disappointing since both have 12mp and in theory the larger sensor on the LF1 (1/1.7in vs. 1 / 2.3in for the FZ150) should mean larger pixels and hence better IQ.  Maybe it's the lens, or the software, or the marriage of the sensor and the lens, but the LF1 is definitely not better, IQ-wise, than the FZ150 and might be a little weaker.*[Added after further use] After comparison testing, I have to revise the above.  In general, this LF1 generated marginally better images than the FZ150.  Interestingly, I ended up using RAW with the FZ150 and accidentally had the LF1 set to JPEG, so the LF1 JPEGs held their own against the FZ150 RAW.  I also took some more foliage shots and although there might have been a slight fall-off at the corners at full zoom, I don't think I would have seen it if I hadn't been looking for it.  And I'm not sure it was really there--power of suggestion and all that.--Good performance in bad light.  I started shooting at 5PM on a gray day.  First shots were hand held, indoors, no flash (I used burst mode, 5fps).  I shot in a room poorly lit with only natural light from a window, at f/3.2, ISO80, 1/20th second (due to 5fps), no zoom.  Hand held.  Very, very nice results.  Low noise (not visible unless you enlarged the image) and zero camera shake.  At 1/20th sec.!  I later took some single shots using P mode, hand held, no flash, only one floor lamp in the room, and was amazed.  Great color, shading and clarity.  The LF1 selected ISO 200 and went from there.  This is really a nice indoor camera--too bad I never shoot indoors!  ;-P--Good performance in flat light.  I shot some outdoor shots at various zoom lengths.  Really a poor time for photography, overcast, late afternoon, very flat light.  Pictures were just as good as anything else under these conditions.  Clarity was good and it was easy to ramp up the contrast and colors in PhotoShop.--Good burst in JPEG: I got 25 images at 5fps before the camera slowed.  RAW wasn't so good: only 8 shots at 5fps.  This is kind of a downer since I always shoot RAW, but...it's a pocket camera.  BTW, I tried both a class 6 card and a class 10 card and there was NO difference at all.  Same number of shots either way, and same speed.--RW2 files via DNG or FastStone.  I hate the Pany software and I don't like to load up my computer with a lot of junk, so I converted the files with Adobe DNG converter (free).  I've been using this for years and it's very nice.  Also reduces file size considerably in some cases.  The version I had didn't recognize the newer RW2 files from the LF1, but it was a matter of a couple of minutes to download and install the necessary update (v 8.1).  I also use FastStone Image Viewer (free) to preview images and do minor edits; FS reads everything, including RW2.--Viewfinder: despite all the online techno-griping based on specs, the fact is that the VF works just fine.  It wasn't grainy or pixellated, the diopter is convenient, and you can use it while wearing glasses.  You also can easily read the displayed settings (with or without your glasses).  In bright light outdoors, any VF is better than none.--Two control wheels.  Just like the big dogs!  One around the lens, the on the back.  Very handy.  I will have to get used to the way they are set up and located, but they will save a lot of menu digging.  Very nice for quickly changing exposure settings and shutter speed.  The indicator readout is very good.--Two \"hot buttons\" may be assigned for shooting settings that you want to change quickly and/or often, using the Function button and the Quick Menu (/Trash) button.  For example, I normally shoot RAW but sometimes want to change quickly.  And I often need to change ISO in a hurry in changing light conditions (or when I need to turn toward or away from a light source to catch a subject).  I've set the Function button to provide immediate access to the RAW/JPEG choices.  The Quick Menu (/Trash) button is now set to open the ISO dial.  One push to access the ISO dial, one quick turn of the dial, and I've changed ISO with a minimum of lost time.  Both of these buttons will retain their settings with the power off.The so-so--Shooting burst (5fps AF), the continuous AF was erratic.  Of a 10-shot burst of flying birds, the 4th and 7th frames were out of focus.  The birds (pelicans) were flying by about 80 yards away so there wasn't much change of distance.  For situations like this I would prefer single AF but that isn't an option.Bottom lineNot perfect, but with RAW, good burst, VF, decent zoom, small size, good control setup including two dials and two user-set control buttons, pretty good control setup, and acceptable IQ, it really is unique.  I wish the ZS15 had a VF--if it did I would still have mine and I wouldn't need the LF1--but it didn't so here we are.Now all I need is a nice sunny day with some extreme contrasts of white foam on a deep blue sea, with lots of action and movement, and I can find out if this camera really is a keeper or not.  I'll report back when that happens.................One day later: still no really good light, but I've taken some more pictures and done some comparison mano a mano with an FZ150 (see above for details).  So far, the LF1 is still a keeper; I don't seem to have the issues reported by other users and comparisons with the FZ150 (which consistently has gotten outstanding ratings by professionals and enthusiasts alike) are equal if not slightly better.BTW, when I talk about IQ and clarity, I am talking about images viewed using at least 2x enlargement (about 24x18in at 300ppi).............Another day later: finally got some good sun.  The images were very good--there's nothing like decent lighting.  I normally try to underexpose (to avoid blown highlights) and then lighten up the image in PP.  This camera, even shooting JPEG, is very good for that--the shaded areas preserve detail very well.  I'll try to post a couple of samples on the product page, with the understanding that they have been lightened up in PP.I'm still not wildly enthusiastic about this camera, but I'm happy with it.  The IQ is very good for a small-sensor cam and it's all about taking pictures.  This obviously can't match the FZ150 for zoom, and unfortunately can't match it for choices (single AF being one) or burst depth when shooting RAW.  But the FZ150 is/was one of the most widely-praised bridge cameras of the past few years, so it is a tough act to follow.  The LF1 is a very nice piece of equipment.  And if the best camera there is, is the one you have with you, this makes it a lot easier to have one with me..............Update, 8/7/2013 (this is also in an exchange of comments)I continue to have mixed feelings about this camera.It is great for shooting any person-sized or detailed subject (like a charming Craftsman house) that is less than about 200-300 feet away; after that it has neither the zoom nor the resolution to end up with a good closeup. Of course, at greater distances it's still good for landscapes.The burst is still an issue for me. Today I tried to catch tennis players making contact with the ball on serve. The 10fps setting, which only captures about 1 second of action, missed every time due to the slight lag after pressing the shutter button. Even when trying to start early to compensate, all I ended up with were shots of follow-through. I then tried 5fps; this allowed me to get shots throughout the entire serve, but unfortunately the images were all recorded before or after the moment of impact. Also when shooting some distant surf shots the AF seemed to interfere with the 5fps speed I had selected. I imagine that the problem was the distance; even though the focal length wasn't changing the camera might well have kept looking for something to focus on against an otherwise featureless sea. I use single-point focus, so unless I kept the moving subject pretty close to the center of the frame (not always easy at distance) the camera was picking up something else. (This problem can occur with DSLRs as well, especially on hazy days.)On the other hand, I have gotten decent, focused shots of flying gulls and pelicans using 5fps and literally shooting from the hip (no time to get set up).I realize that I'm spoiled by the K-5 and the FZ150, both outstanding cameras in their respective classes and both with more zoom (I keep a 55-300mm on the K-5 most of the time) and better burst depth. I keep reminding myself that on days like today, I just didn't feel like lugging a larger camera around; I put the LF1 in my pocket, got on my bike and cruised around looking for things to shoot. I have done this with the other cameras, and it works well, but they are heavier and more cumbersome. So it all comes down to what one feels like giving up to get convenience. The LF1 has obvious limitations, but it certainly is convenient, and you can get good results. At various zoom ranges, I got some great pictures of seals on a rock, a Craftsman beach house, an installation sculpture at the local MOCA, etc. (Nothing moving very fast, and nothing very far away.) Also some flowering trees and a closeup of flower bed. They aren't Great Art, but they would print out nicely at 12x16 and they look very nice on a monitor.The price is a bit high for what you get, but in bright sunlight an LCD is useless and this is perhaps the only real \"pocket\" cam with a VF.-------------UPDATE 6-6-2014I have gotten rid of the LF1; the issues with AF in burst mode, plus limited zoom range, made me quit using it.Re: my earlier comment: \"this is perhaps the only real \"pocket\" cam with a VF\"--no longer.  I'm going to get the ZS40, which has the same basic feature set, plus much more zoom, much deeper burst at 5fps (100 frames) and better video (1080p60, etc.).  I'm not keen on the massive megapixel count on this small sensor, but the megapixel wars seem to have started up again.  (I have become an all-Pany shooter, with a GH3, my trusty FZ150, and next the ZS40--I hope.)  So far Panasonic seems to have the best combination of still IQ and good video options, plus useful lenses for interchangeable lens models).", "Date": "July 31, 2013"}, {"Title": "Best balance of cost vs features right now", "Author": "Thomas H. Cannon", "ReviewID": "R2WTPIAKZKPFDY", "Overall": "4.0", "Content": "I bought the Lumix DMC-LF1 to replace a couple of Canon Powershots I have been using as pocket and travel cameras for a few years now. For that purpose I have found it to be very good especially in indoor situations with natural light. I chose this model after many years of being a Canon user for two main reasons. Firstly I have trouble seeing LCD screens outdoors and wanted a viewfinder but still have a pocket sized camera. The viewfinder is small but I have not had any problems using it and I like having shooting information right there in the viewfinder, unlike some others that have optical as opposed to electronic finders. Try using it with both eyes open if squinting is an issue for you. Secondly I wanted WIFI capability built in. The Panasonic app you need for your device (phone, tablet, etc.) is very easy to use, great for controlling the camera on a tripod or uploading photos to a tablet. Just be sure to download the correct app for this camera (you need the Panasonic Image App). Low light performance is very good and images are pretty clean to ISO 800 but not so much past there. I don't use the flash except for fill in, it isn't very powerful and casts too warm a color for indoors, like an incandescent bulb. I have found the lens to be very sharp except at the longest focal length, but still acceptable for snapshots even there. If you are someone who makes prints exceeding 8X10 you likely should be looking for a camera with a larger sensor like the new Sony RX100. For me the compactness of this camera outweighed that consideration. The small size and and lack of a front grip can make getting clear pictures a little difficult even with the image stabilization turned on. I find I get better hand held shots using the self timer, but I have large fingers. Two other things to consider are that the smallest possible aperture is f8 and f2 is only possible at the widest angle. Also it isn't possible to shift exposure on P mode which I find annoying at times. It is a little on the expensive side compared to some others but at $349 for the white model, with the EVF, fast lens, compact size, and WIFI going for it I think it has the best balance of cost and features available at the moment.", "Date": "December 2, 2013"}, {"Title": "Excellent small \"don't leave home without it\" camera", "Author": "William R Kennedy", "ReviewID": "RCXKKUQPI231L", "Overall": "5.0", "Content": "Even more compact than the ZS15 that it replaced in this role, and more capable in everything but long zoom. More zoom would be appreciated, but 7x (equals 200mm equiv) is long enough so you don't have that \"is that all there is?\" feeling that you get from 3x or 4x. I put a flipbac G2 camera grip on the front: Perfect to curl my middle finger around for a secure one-handed hold on the camera, although I do have to go to a two-hand hold to clear the flash window in the rare cases I want flash. Lowepro Volta 20 case fits the camera perfectly, and can be used on its belt loop, loose in a jacket pocket, or with the camera's wrist strap hanging out. Design of the case makes it easy to get the camera out and in quickly and safely.The EVF is good enough, not wonderful, but a lifesaver when the sun is behind you. Put time in to get the diopter setting right and then be sure not to move it: It is hard to get your nose, your finger and your eye all in the right places to adjust it, and it does make a difference when you are composing with the EVF.My work mostly goes on websites, so my image quality standards may not be as high as yours, but even when I have used cropping to get the rest of the zoom range that Canon sx30 and now Panasonic fz200 have spoiled me for, I have not seen obvious flaws.I was very pleased with the in-camera panorama setting: Could not be easier, and does a very respectable job. Also usable without even reading the manual is leaving the camera on the mantlepiece or on a tripod near the bird-feeder and controlling the camera, including zoom, via wireless smartphone.Not an inexpensive camera, but I call it good value for its feature set and I look forward to what it pushes other makers into doing to catch up.", "Date": "October 29, 2013"}, {"Title": "Don't Buy This for the Viewfinder.", "Author": "Upward Call", "ReviewID": "R16RT7KDB0Y1OP", "Overall": "3.0", "Content": "EVF Viewfinder - meh.It is very small.I thought it would rescue me from those times the big screen washed out in bright sunlight.It has not been much help in these situations.(The optical viewfinder in my Canon A1200 is much brighter, and was very helpful in this situation.)No Printed Manual:Other than the auto IA mode, you'll likely need more than a little time with the 265 page manual, which comes only on a CD and not a printed paper copy.Otherwise the Camera Okay but Pricey.I expect the other camera makers to quickly match these features somewhere in their product lines in the next round of new cameras.Might want to wait and see before taking a jump into an LF1.On/OFF Button easily mistaken for the shutter button.More than once I have turned the camera \"OFF\" rather than triggering a photo.Not good ergonomics to have both buttons side by side.Bought this Panasonic Lumix LF1 as part of the Holy Grail Search to find THE camera to fill the void between my iPhone and my DSLR.But- Outdoors morning sunlight wiped out the display in the LCD screen. Different day, and different location, afternoon sunlight wiped out the display in the LCD screen  Both times, when I really needed it, the EVF was useless for seeing my subject and framing my shot. It is time-consuming and fidgety to access the EVF, you'll need to engage a switch to make it illuminate, and since it is small, you'll need to get your eyeball *right*in*there* to see the display. Having accomplished this, it does not provide anything useful enough to represent an improvement over what you can see of the sunlight-compromised LCD display. (As a kid, did you play the game of looking backwards through a pair of binoculars? It feels a lot like that.)I like the Panasonic Lumix camera series in general, and the LF1 *is* a very nice pocket-able camera. (I am carrying it around in my pocket where ever I go.) The 7 to 1 zoom is nice enough. The video is nice enough. The ability to set the controls manually is nice enough. There are many genuinely helpful unique features like the artificial horizon display to show when the camera is honestly horizontal.**BUT**After two months of trying to adapt my habits to the features of the camera, I am still looking for a useful, viewfinder-equipped pocket camera.Post script:I have been *very* pleased by the quality of the video from this camera.Looks great even when played back on a large screen tv.The price has dropped by a hunded dollars since I bought mine.And Consumer Reports is carrying it favorably on their \"advanced camera\" short list for the people doing holiday shopping research.", "Date": "September 22, 2013"}, {"Title": "fantastic camera and $300 cheaper than the Leica C. same camera", "Author": "M. DiOrio \"mpdio\"", "ReviewID": "RIMPHCQNTSWOI", "Overall": "4.0", "Content": "i wasn't sure at first. i have an LX7 which i love. but when i saw it was $300 cheaper tha the same camera,the Leica C,i thought i'd give it a try. i i\\didn't need a $300 copy of light room .so what really sold me is the view finder and the panorama mode. The regular images seem fine for what i do. email and 4x6 prints that i send out as postcards.Actually if ind the images very good. I did by the lvf2 for the lx7 but hate putting it on and off and very bulky to put in a shoulder bag for traveling so i sent it back.I hate using the lcd screen.i'm 64 years old and have been using nikons and Leica for40 years. i love having a view finder. this one is great. it works for me. plus i can get the info for the shot in it. i like the feature and a lot of camera makers just don't care to build one in their cameras.NOw as to the panorama mode. I love panorama shots and it couldn't be easier and faster thatn with the lF1.there are many creative setting.but i like B&W; ones. so that's easy too.I do love my LX7 as i loves my LX5.i thought they were the best point and shoot cameras on the market and told many friends to but one.now i have the dilemma of keeping or selling the LX7. this litle camera about the size of a regular iPod is a wonderfull tool. i highly recommend itif you need the red Leica dot go ahead and buythe Leica C,but you're wasting $300", "Date": "November 14, 2013"}, {"Title": "Perfect Camera for travel, etc., for many reasons", "Author": "J. Stein", "ReviewID": "R179F3XEKTWNO3", "Overall": "5.0", "Content": "Received this camera as a belated birthday gift (after a lot of research on my part). The fact it has an electronic viewfinder as well as a screen is the key feature I needed. No more trying to cover the screen so I could see what I was aiming the camera at. Since my favorite types of photos include macro flower photos I was thrilled with the various settings (AF, AF-Macro and AF-Macro-Zoom where you can get as close as 3 cm). Also, the camera is FAST. I was able to negate the effects of a pretty breezy day and out of 282 pictures I took at Como Zoo Gardens (yes, 282 pics - I was giving it a real workout) only 8 were blurry and I think that may have been due to my fiddling with the controls when I should have let the camera do its thing. I found the colors were very true with no color adjustments needed in Photoshop. I haven't shot in RAW yet but have the option of shooting both RAW and jpeg at the same time. Will be using this as my main camera on a trip to Switzerland this fall - only taking another small backup camera with - you know, in case I drop it off Switzerland's Richenbach Falls!This camera is worth every cent (my dear husband) paid for it.", "Date": "July 12, 2013"}, {"Title": "Better than expected", "Author": "Irwin Fletcher", "ReviewID": "R13IJOE0J0Q4FT", "Overall": "5.0", "Content": "Replacing a broken Canon S100, looked at this, the RX100 Sony and the newer S120.  Having dealt with the defective lens-error of death on the Canon, it came down to the others.  The Sony is obviously the best of the bunch, but much thicker (don't think I could comfortably pocket it) and could have almost bought both other cameras for the price.  I haven't used the EVF on the LF1 but made a few adjustments to the color and found it to be a fantastic point and shoot.  Photo quality was better than what I had with S100 and color accuracy comes close to my Nikon D7000.  If stopped all the way down, you get a bit of softness in the corners but 2 seconds in CS6 and that solved it for the few shots where that comes in to play.  Battery goes fast so buy a spare, but the same was true with my Canon.  Size, ergonomics and looks are top notch (I chose the white version).  I process the photos through Aperture and the quality is stunning for the sensor size.  I only used the RX100 in store so never got to download to the computer to compare, but honestly I'm 100% happy with the output of the LF1.  Outdoors, it truly shines.  Took some very nice wide angle landscapes and love being able to use the focus ring for functions.  Looking now for a good screen protector for the back glass.  Very satisifed.", "Date": "January 2, 2014"}, {"Title": "Best pocket camera", "Author": "D. L. Howe \"dave\"", "ReviewID": "R3I0SXJ03L1RP", "Overall": "5.0", "Content": "After about a month's use I like this camera; it fits in my pocket and takes good pictures.  That isn't much of a review so let me get a little technical.  I am an experienced photographer with a lot of high end camera gear.  It turns out I take most of my pictures with my pocket camera - just because it is the camera I always have with me.Here's what I like.  Reasonable pixel density to match the current technology for image stabilization (IS) and zoom range.  Here's how it works:  The light enters the lens, travels past the iris, past the shutter and to the sensor.  Within the sensor there are millions of pixels; tiny, tiny solar cells - each with electrical circuitry.  A twelve megapixel camera has twelve million pixels.  If you were to cram more pixels into the sensor each pixel would be smaller - which means it would capture less light.  Less light makes it harder for the camera to focus and get a good picture.  Additionally, more pixels makes the camera more susceptible camera shake.  Studies have shown that most blurry pictures got that way not by being out of focus but by camera shake.  The LF1 gives the pixels extra room by using a comparatively large sensor for a pocket camera.  The image stabilization of the Panasonic pocket cameras is, in my opinion, far ahead of the competition.A curious thing happens when you zoom out - to a more telephoto view.  The camera stops down (reduces the aperture size) letting in less light.  The camera maker can offset this by increasing the lens size but then it would be too big to fit in the pocket.  A case in point is the excellent Panasonic FZ200 which also has 12 megapixels.  On that camera the aperture stays wide when zooming - but the lens is quite large.  The LF1 designers recognized the limits of current technology and limited the pixel count to 12 megapixels and the zoom to 200mm equivalent.  Usually more is better - but it is good to recognize the limits of current technology.When a digital camera takes a  picture the raw information from the pixels is sent to a small computer and processed into a JPG image.  The user has the ability to adjust the processing, controlling things like contrast and saturation.  I like the vivid setting - it brightens the picture up so it appears more like what I thought I was seeing.  In the normal setting pictures look like scientific evidence - accurate but boring.  Some high end cameras (like the LF1) give the user the option to capture and process the RAW data in a PC, rather than in the built-in computer in the camera.  With this option you can tease out a little extra detail and dynamic range in a picture.  Having the ability to capture a scene in RAW (as well as JPG) gives me the option of using the camera for that surprise, once in a lifetime shot when I want the best possible.The LF1 is quite capable as a video camera offering high definition video.  I only use 720HD because it is easier to process in my PC and I can't see the difference when I view 720 or 1080HD.  Because the camera produces video at 60P (60 frames per second) it is possible - in the PC, during post processing, to slow down the picture to half speed without loss of detail.  I have even experimented with  quarter speed and find it OK.All in all this is the best pocket camera I have ever owned.  I recommend it highly.", "Date": "August 29, 2013"}, {"Title": "An ideal pocket camera", "Author": "ASL4", "ReviewID": "R3KT6EANFGQEVM", "Overall": "5.0", "Content": "Let me start by discussing the viewfinder, since that is the feature that sets this camera apart from some worthy competitors. Reviews are all over the map, some say it's a total fail, others love it, and still others fall in the middle, usually in a grumbling way. To me it is essential b/c I wear reading glasses and don't want to have to put them on to frame shots via the LCD. And, I vastly prefer holding a camera to my face rather than out in front of me. So I both need and want an EVF. And this one is totally usable. I turn off all display info so I have maximum real estate to frame the shot, and it works fine. Yes, it's small, but you're buying the camera precisely b/c it is small, so unless Panny can figure out some sort of collapsible EVF that can be small in your pocket and yet big in actual use, this is the next best thing. It has a diopter adjustment that, at least for me, gets things reasonably sharp but hardly razor sharp. So, \"very usable\" rather than \"delightful.\" If you like to see various shooting data in the EVF then the small size may seem more restrictive to you than it does to me. Moving on, the images are very good. A little flat in terms of contrast, but with a 2-second tweak either in-camera or in whatever software you use (even just iPhoto) you can bump up the color with a click and the results are great. I went with my family to Universal and, in IA mode, got great shots of my wife and son on a roller coaster, while zoomed in to full 200mm tele length. I got great low-light shots as well.  I like the Panny user interface, post-shot in-camera effects, and scene modes. They are all very easy to learn. My one niggle is that I wish they had used a slider as an on/off switch, rather than the button. It's easy to turn it on/off accidentally, yet at the same time sometimes when I go to turn it on and feel like I've pressed the button, it doesn't respond, and I realize I haven't pressed quite hard enough, even though it felt like it engaged. I even found myself wondering whether, at least under some conditions, you need to hit the button twice to turn it on. I'll have to explore that. But for a very pocketable camera, the usability and quality are great. If you don't need (or tend to use) an EVF, then there may be better options for you (the Canon s120, which has the added benefit of a slightly textured surface, for one), but I applaud Panny for incorporating an EVF into such a small, wonderful camera. I know the 1/1.7 chip will make the technically obsessed groan, but before you dismiss it for that, check out what it can actually do. I take it with me everywhere.", "Date": "February 28, 2014"}, {"Title": "mostly great, except the USB connector", "Author": "Brent Boyer", "ReviewID": "R17KNZMXSV0RDJ", "Overall": "4.0", "Content": "I bought a Canon SD 110 earlier this year.  Loved its compactness and reasonable image quality (for the camera size).  But ended up returning it because the utter crap battery indicator, which would show 3 bars flat and then the next time I wanted to use it, would be totally out of battery.So, I bought this Panasonic model, hoping that it would offer the same compactness and image quality, its battery indicator would work better.I am happy to report that the compactness is really good.  And I think its image quality beats the Canon SD 110s (perhaps due to a bigger image sensor).  The 7X zoom is also appreciated.  The battery indicator seems to work better too.So why am I not giving this 5 stars?Because some idiotic engineer (or evil MBA swine?) at Panasonic decided that it would be a good idea to use a proprietary USB cable connector.  Why oh why did you do this, Panasonic, when there is a perfectly capable industry standard micro USB cable connector format?I got burned badly by this on a recent vacation, when I temporarily lost my camera box, and could not use my wife's Samsung Galaxy S3's USB cable to connect to my camera.  That Samsung smart phone uses bog standard micro USB.  If Sammy can use those, why can't you, Panny?", "Date": "September 16, 2013"}, {"Title": "Check my images.", "Author": "phazelag \"phazelag\"", "ReviewID": "RIGUWUNADDGAU", "Overall": "5.0", "Content": "I love this camera.All cameras have strengths and weaknesses, but this camera is my favorite go to camera for most things that also fits in my pocket.Here are the wide variety of images I have made with it (I am not a commercial photographer so I dont have an agenda other than to help someone make an informed decision);  [...]The lens is very good but all of these small cameras have a smaller aperture on the zoom end so dont expect miracles at full zoom in low light.  But because this sensor is a little larger than most small cameras the higher ISO images are still very nice.  You can seem my examples used at full zoom under many conditions.Macro is fun too!Also the Face detection try using this to get more focused shots.  My favorite feature is the Low Light Handheld scene mode.  If you subject is still it will take 5 or so images and combine them together to make a super sharp and well exposed image in poor light.  It works great!I shoot in this manual, aperture priority all the time for specific shots, but the iAuto mode is the best I have used on any camera.  Its like it knows what you want to do.  Panasonic is building a great reputation with their iAuto on all their cameras.", "Date": "December 20, 2013"}, {"Title": "Love this Camera!", "Author": "C. Lee", "ReviewID": "RN4BKNDMWNSE8", "Overall": "5.0", "Content": "I spend a lot of time researching all of cameras out there until one of the reviews mentioned the LF1. The compact travel size, f2 lens, evf, raw, and longer 7x zoom all appealed to me. Still a little undecided on this under-rated camera,  I came upon a review from a real photographer, Olivier Duong on The inspired eye, period net . It is a real world review with examples of what the Lf1 camera can do by the average user. I quickly decided to purchase this camera and am happy I did. Next, I downloaded online the 285 page Manual. There is a lot to learn. The brief time I have with this camera has impressed me. The pictures are sharp. (sharper than my zs-3) Macro is great. Low light shots indoor without flash. Happy with the zoom and EZ extended zoom, if needed. The EVF is great to have in bright sunlight. I purchased two extra batteries and charger to go with the LF1. Have yet to take videos or using wi-fi. Looking forward to explore the many features. The LF1 sure beats carrying around a heavy dslr camera.Sent from my iPad", "Date": "March 2, 2014"}, {"Title": "Good camera, but needs improvements.", "Author": "J. Klein", "ReviewID": "R2GCXMQ3KSYJ8R", "Overall": "3.0", "Content": "Overall, this is a good camera.But a big annoyance for me was that the camera's LCD screen is inaccurate.  It frequently blows out highlights even though the camera captured a properly exposed image.The bright parts of an image appear too bright, and the dark parts appear too dark.So there's no way to know how the image came out until I review the images on my computer.  A big hassle.Image quality is good, but sometimes I noticed some color casting.  (similar to other Panasonic models?)I was very impressed with the low-light performance.Focusing is fast and accurate, and I was able to capture low-noise shots even at higher ISO's.However..  The camera does have a quirk even in this area.In P mode, the slowest shutter speed is 1/4 second.So if the scene is really dark, you can't capture it unless you allow the camera to raise the ISO to 1600.  If you select a lower ISO, the image comes out black.In order to get slower shutter speeds, you have to go to Manual mode.(This is a hassle if you like to take night shots.I wish the camera would automatically slow the shutter speed down for you to say 1 second.)Another quirk is that the camera doesn't have a 3-second timer - it only has 10-second timer.Also, oddly, the camera doesn't let you adjust the image contrast or sharpness.  (even my old cheapo 6MP camera has these controls!)Another issue is that the camera's battery life isn't very good.One contributing factor is probably that in menu screens the background color is white, instead of black.  (I wish you could set the background to black - that would save a lot of juice.)There is also this bright white splash screen that displays every time you power down the camera - it's an unnecessary drain on the battery IMO.Another thing that could help extend battery life is if the screen would automatically dim after, say, 30 seconds of inactivity.There are also issues with the camera's ergonomics.First off, the camera is too slippery and easy to drop.It desperately needs a proper rubber grip in the front; that would make the camera a lot more enjoyable to use.Also, I found the zoom lever way too stiff.  I had to push it with my fingernail.Another thing is the location of the power button.  I think it's too easy to accidentally press it; I think the power button should be smaller and located more toward the center.Also, a minor ergonomics issue is that on the LCD screen, the various icons and histogram are a bit too large - they could be made smaller, taking advantage of the high-res LCD.So all in all, I liked the camera's image quality and HD video quality (though 1080p would've been nice).The image stabilizer works well, both for photos and video.The camera focuses very well, and takes properly exposed shots with better dynamic range than cheaper models.The low-light performance is also very good (unless the scene is very very dark, for which you'll have to switch to M mode to get slow enough shutter speeds).Also, the camera is small, lightweight, and pocketable, which is a definite plus.(though it does have ergonomics issues)So, if Panasonic could fix the issues I mentioned above, I would give it 5 stars.", "Date": "January 26, 2014"}, {"Title": "Great camera, which fits pocket", "Author": "Diether in CA", "ReviewID": "RJ0Q4LIWQJJSX", "Overall": "4.0", "Content": "Good photo quality, vewfinder option is very useful in bright light situations. So far (after about 4 weeks owning it) I am very satisfied.Charging battery in camera has not been a major limitation, because of the good battery life (500+ photos without flash).", "Date": "August 30, 2013"}, {"Title": "The new Panasonic Lumix DMC-LF1", "Author": "beverly wellerstein", "ReviewID": "R2TB984BM3TZCG", "Overall": "5.0", "Content": "My previous camera was also a Panasonic Lumix but I wanted to upgrade the features and my new camera is just what I wanted.  I had ordered two different cameras previously, but they didn't feel comfortable for me to operate and I returned them.  I was so familiar with the Lumix operation and this new camera is very similar but superior. I was able to just pick it up and shoot away and the pictures I've gotten are just what I expected, terrific.  I particularly like the electronic view finder when the sun makes it difficult to see the screen.  I'm very happy with my purchase and highly recommend it.", "Date": "August 20, 2013"}, {"Title": "Panasonic LF1 Photographer's Compact Camera review by Dale (update Oct. 25 2013)", "Author": "Dale Thorn", "ReviewID": "RCONMSDVKRKG0", "Overall": "5.0", "Content": "This review covers my use of the new Panasonic LF1 camera for general-purpose photography, shooting JPEG format images only. Note that a large part of the approximately $500 USD price for this camera is for the Leica lens, a high-quality f2.0 to f5.9 'DC Summicron' lens that should compare favorably to the f1.4 Leica lens used in the Panasonic LX7 camera and its Leica equivalents. The LX7 lens is one stop brighter than the LF1 lens at wide angle, and on the long end of the zoom the difference is f2.3 to f5.9 - a big advantage for the LX7 in brightness, but not in reach, since the LF1 goes out to 200 mm (135 equivalent) whereas the LX7 maxes out at 90 mm. The other major differences between these equally-priced (MSRP) cameras is the tiny viewfinder built into the LF1, and the fact that the LF1 is about half the size and weight of the LX7. It seems odd to me, given the newness of both the LX7 and LF1, that a comparable camera like the LF1 would be so much smaller, with viewfinder, and with a much longer lens.Note on viewfinder: I don't use the EVF, but I have looked at it and it works fairly well. My judgement is that it's good for framing/composition, and shows enough detail so that you know what detail is being included in the image. But if you're focusing manually and want to make sure that the focus is critically sharp, it might be better to use the LCD screen.Having owned both Leica cameras and Panasonic cameras with Leica lenses, I have a pretty good idea of what the differences are between lenses made by Leica for their professional cameras and Leica lenses made by Panasonic. My impression (just that - I don't have insider secrets on these things) of most of the Panasonic Leica lenses for regular consumer cameras like the TZ5, ZS7 etc. is that they're a fairly economical lens meeting minimum Leica requirements for those cameras. On the other hand, the Leica lenses Panasonic has made for the so-called \"Enthusiast Compact\" cameras like the LX3, LX5, and LX7 etc. are more professional from what I've surmised, and the f2.0 Summicron lens that's built into the LF1 is not equal to those better lenses when examining the images at 100 percent on an average good quality monitor.Note on lens sharpness: I have some test images on my dalethorn site under Leica D-Lux6-2 (the Leica D-Lux6 is made by Panasonic, and is functionally identical to the Panasonic LX7). The center of each of the two test images is comparable, but as you scroll to the sides and corners you'll see where the resolution falls off somewhat for the LF1. The LF1 is using an f4.7 aperture, so it actually has an advantage over the D-Lux6/LX7 in terms of how conventional lenses work. The way conventional lenses do work, by stopping the aperture down using shutter blades and so on, may not apply to these cameras if these cameras are making those aperture adjustments electronically.The LF1 has a full complement of manual controls to go with the automatic and enhanced-auto settings that most users enjoy. Aperture Priority, Shutter Priority, and Manual control are on the main selector dial, and everything else is found via the Menu/Set button, the circular selector around the Menu/Set button, or the programmable 'Fn' button. One of the really handy features with the LF1 is the 'Step-Zoom' setting, especially when making comparisons to other cameras where you need to shoot at the same effective focal length. The minimum macro focus distance is 3 cm, or slightly more than one inch. Note that the 'Zoom Macro' feature is an electronic (not purely optical) enhancement, and will reduce the image quality proportionate to the extra magnification it provides. The LF1 has a separate video button on the back at the top right, and before those separate buttons became common on digital cameras, important beginning parts of videos could be lost from having to switch the dial to video mode.I've read complaints about the tripod socket being on the end instead of more centered, but the obvious advantage is that it leaves the battery and memory compartment free so the tripod attachment doesn't have to be unscrewed when there's a need to change the battery. Panasonic warns about attempting to use a tripod mount with a screw that's 5.5 mm or greater in length. Checking my own tripod, monopod, ZipShot mini-tripod, and Steady-Aim camera stabilizer, the first 3 are OK in that regard, but the last item has a ~7.5 mm screw length, so you should be very careful when attaching such items to the camera that you don't screw it on too tightly and possibly damage the camera's tripod mount.Camera forums are rife with complaints about the price of replacement batteries, and I always recommend carrying at least a second battery so shooting can continue if the first battery runs down. Contrary to what many people suggest - saving money with third-party batteries, I consider the price difference and if it's huge, I need to know why. Before I could even consider a very cheap battery, I would need several independent reviews that affirm the quality of that particular battery as well as the reliability of the manufacturer of that battery. On top of that, I would need to know that if their battery damaged my camera, they would pay to replace my camera promptly. Lithium-ion batteries can be very dangerous. If the price difference were less than my expenses in replacing a defective battery (packaging, shipping, time wasted, loss of battery for a period of time), I would certainly get the camera manufacturer's battery.I'm currently building a set of images for the LF1 at my dalethorn website, so check there occasionally to see what sort of results I'm getting with this camera. I made some initial comparisons to the Leica D-Lux6 (same as Panasonic LX7) camera that has an equally-high quality lens and high price, and viewing the images at 100 percent size on the screen, it's easy to see where the LF1's 12 megapixels compared to the LX7's 10 megapixels increases the LF1's advantage. On the other hand, I hear from some expert users that the LX7 has a different design, particularly in the different type of Leica lens built into each camera, so that the LX7 may have advantages I haven't discovered as yet. Note that when the final image is not a 4:3 ratio crop (i.e. the largest setting of the LF1 is 4000x3000, or 4:3, while the LX7 is 3648x2736, also 4:3), the LF1's pixel advantage will shrink, since the LX7's multi-aspect sensor makes a 3968 pixel width image at the 16:9 ratio setting.Summarizing, the LF1 should be a great camera for a person who wants high image quality, simple design and operation, and isn't greatly concerned about the high-performance features most professional users (i.e. mostly DSLR users) demand for their tasks. Those might include ultra-fast auto-focus and shot-to-shot times, large data buffers to allow for bursts up to dozens of images at a time, ability to deal with fast-moving subjects, and so on.", "Date": "July 24, 2013"}, {"Title": "Panasonic Lumix DMC-LF1", "Author": "Bernard Greenberg", "ReviewID": "RWDNC3P9Q1NOJ", "Overall": "5.0", "Content": "Great shots and easy to use. The EVF is superb and the IA setting is marvelous for night shots and back lighting.", "Date": "September 25, 2013"}, {"Title": "Loving this camera.", "Author": "David Hutchinson", "ReviewID": "R1O31GO7UT5MUQ", "Overall": "4.0", "Content": "I am a serious amateur photographer. When I am not shooting with a DSLR or a Micro 4/3rds camera I will always have a camera on my belt.  Recently I acquired the Panasonic Lumix DMC-LF1 after researching similar small cameras.  I wanted a small, fast camera that shoots in high quality RAW mode with a longer zoom than most compact cameras. Additionally I wanted to be able to do decent macro shooting with the camera. This camera fills the bill.  Most of my shooting with this camera is done on my daily walks in a nearby park.  The pictures that I have processed  have been good.  I am still learning all of the functions of this camera. The camera is only about 2/3rds the size of my smartphone.  It is really portable.  The camera also shoots wirelessly to a smartphone or PC, but I haven't really figured this out yet. All in all I am loving this camera.", "Date": "October 9, 2013"}, {"Title": "Amazing for its size", "Author": "Deborah B. Adler", "ReviewID": "RXCBROFGE9LXX", "Overall": "5.0", "Content": "This is a wonderful camera. I almost never bother carrying my Nikon D-50 any more! The LF1 is versatile, infinitely configurable, with a very sharp lens. It's always in my purse, so I never miss a good shot any more. Wide angle, macro, indoor, action...you name it, the LF1 can do it. And it's image stabilized, so the photos come out sharp, day or night. Highly recommended for the price.", "Date": "May 5, 2014"}, {"Title": "Perfect for aging eyes", "Author": "Amazon Customer", "ReviewID": "R1WXVNZB9HBVL5", "Overall": "5.0", "Content": "The electronic view finder (EVF) worked perfectly for the following reasons:1.  Can see to take and review photos in sunlight.2.  Can see the settings and messages without my reading glasses because the EVF info is set to infinity.3.  Can more precisely frame photos.For a point and shoot guy the pictures seemed great to me especially in low light or back lit situations.  I also really liked the step dial around the lens for zooming more precisely.Bottom line I would recommend and purchase again.", "Date": "April 2, 2014"}, {"Title": "Superb Camera for Enthusiasts", "Author": "SALLY J. DICKERSON", "ReviewID": "R2OCX6YZ4TJD6U", "Overall": "5.0", "Content": "This camera likely has more features than a snapshooter would want or use but for photo enthusiasts looking for a feature-packed pocketable camera it is absolutely excellent. The electronic viewfinder is no way like looking through an SLR but perfectly fine for composing and framing images in bright light, using longer focal lengths or when extra protection against camera shake is an asset. The image stabilization provides a solid two stops longer shutter speed than I can hand hold without it. ISO settings as high as 3200 are completely usable. If light levels required it, I would not hesitate to use 6400 for an image to be printed as 8x10 or 12800 for a 4x6, though both would show some degredation. The zoom extends to 200mm but with digital assist it reaches to 800mm, a setting that furnishes remarkably good quality 8x10s. There is an enormous array of less frequently used more specialized settings available, but these workhorse functions are providing dramatically more latitude and quality than I ever expected from such a small camera.", "Date": "January 6, 2014"}, {"Title": "A step above", "Author": "W. Stinson \"alpine trekker\"", "ReviewID": "R3LANDCXODGBFI", "Overall": "5.0", "Content": "I love cameras that I can carry with me in a pocket or on my belt. I also like great image quality. So, when I saw that the LF1 has a fast lens and a larger sensor than a typical point and shoot, I ordered one. After shooting a few hundred images, I am impressed with the image quality. The f2/0 28-200mm (equivalent) lens is excellent and the bigger sensor is a plus, especially in low light. My biggest complaint about the camera is that the power comes on too easily when inserting or removing it from a pocket or case. It just needs a firmware upgrade to add another second or so of holding down the button so that it doesn't turn on/off unintentionally. Hopefully, Panasonic has noticed this problem.  I've also read some complaints about the viewfinder but I find it adequate for composing in bright light or when I want the camera at my eye. Moreover, I think other reviewers have overlooked a big plus to this viewfinder. It works for people who use reading glasses and are farsighted. My wife, for example, doesn't take pictures, because without her reading glasses, the lcd screen is a blur. With the lf1, she can adjust the diopter to match her prescription and see a clear image in the viewfinder. She's taking pictures again! So, for those looking for a step up in quality form the ZS series, as well as those who wear glasses and want to compose and shoot on a compact without their glasses on, this camera is recommended.", "Date": "April 14, 2014"}, {"Title": "Returning it, but not because of the viewfinder...", "Author": "juddwood", "ReviewID": "R25QKMKSP5CSPJ", "Overall": "3.0", "Content": "I really wanted to like this camera, and my first impressions were very positive. First of all, it's very small given its sensor size and zoom range. Also, it feels like it's high quality. I personally have found the viewfinder to be useful. Yes, it's small, but I would say I used it easily half of the time vs the rear LCD screen. I think it's more than adequate.My two (pretty major) gripes with this camera are, first and foremost, image quality and, second, the wifi. Image quality just isn't that great, and with at least some of that attributable to the lens. The center of most images I shot were pretty sharp, but detail suffers in the corner extending well into the frame. Compared to my wife's Canon S110 the images have a noticeable lack of sharpness and contrast, and I don't think the S110 is all that great; compared to the Panasonic LX7, it gets even worse. Other things that don't help the LF-1 are the slower aperture(s) on the lens as focal length increases, as images even at ISO 400 show some nasty noise in darker areas. The out-of-camera jpegs show a heavy-handed approach to noise reduction, too.The wifi simply wasn't working for me. I tried syncing the camera using the (Android) app and, after following all available instructions (countless times), it never worked. I could get the camera to connect, but the connection would drop almost immediately; I also connected the two using NFC, but that wouldn't stay connected, either (I haven't had trouble using the same phone with other wifi-enabled devices).So, that's my take. Put a sharper lens on it (preferably wider on the short end!) and sort out the wifi and I'm a buyer.", "Date": "March 9, 2014"}, {"Title": "Great compact camera -- except for the non-standard USB connector", "Author": "Randy Prakken \"airpor41\"", "ReviewID": "R3O58HI5SZ2T6H", "Overall": "4.0", "Content": "Takes good pictures.  Easy to use.  Fits in my pocket.  Would be 5 stars but for the stupid USB connector.I selected this for the WiFi remote shutter release for bird pictures.  WiFi was a bit difficult to set up on a Samsung S4 but once I found the right S4 setting * it works fine.  I have transferred pics to my S4 and then up to the Internet which works fine.  Also, plugging the (non-standard) cable into a powered USB hub allows trivial drag and drop to Windows 7 and charges the camera in a reasonable time too.Haven't used the viewfinder much but expect to on bright summer days.  It seems acceptable to me, especially given its size.  I like the focus adjustment on it too, because I wear glasses.Using a LowePro wrap -- perfect case.* S4 setting:  Disable WiFi -> Advanced -> Auto network switch.  Wish Panasonic documented that fact, because I wasted several hours on it.", "Date": "February 25, 2014"}, {"Title": "Excellent, but not perfect", "Author": "Yarii", "ReviewID": "R3S344WOJOACHV", "Overall": "5.0", "Content": "I'd been waiting for the LF1 to go on sale; when it was introduced last year, it was close to $500. I waited a year, and I'm not disappointed. I tried and returned a camera very comparable, the Canon S100, due to poor battery life and my preference for Panasonic cameras. If I'm not shooting with my Panasonic, it's a Sony. If you don't want full manual control (PASM), I recommend either the Sony WX300 or the latest WX350 camera. Images are stunning and Sony videos are unsurpassed in quality from a point & shoot camera. These two Sony cameras are very similar in size to the LF1. But I opted for this LF1 because I wanted full manual control if I choose to do so. Plus the LF1 and Canon S100, S110, and S120 all shoot RAW, but not the Sony cameras I mention above. The Sony cameras also have smaller sensors, letting in less light. The Canons above have approximately the same size sensor as the LF1.OK, back to the Panasonic LF1:Battery Life: Not as great as I hoped, but not as bad as the Canon S100. And Panasonic, like the others, is now cutting corners and not providing a separate battery charger.  I can shoot around 200 images and a few videos before the battery needs recharged.Build Quality: Made in Japan. Excellent fit and finish. The finish is a little too slick though. You can buy adhesive grippers made to fit this camera, which I may eventually do.Photo Quality: Excellent, bright colors, even on the iA setting. One thing I like about this camera is if I don't want to use Aperture Priority, I can still get the blurred background on iA by pushing on the wheel (up) and setting the dial to the far left.  Voila! An easy-to-do bokeh effect. This camera is also great in low-light conditions - I set the flash to automatic but it rarely flashes unless the room is extremely dark.User Interface: Easy-to-understand graphics. Of course, it's all what you are \"used to\". Canon enthusiasts think Canon menus are easy to understand. I beg to differ, even though I've owned several Canons in the past.  Sony and Panasonic have the easiest UI's.Other:Memory Card: Like 99.9% of cameras, you need to buy a memory card. I recommend a Class 10 SDHC card if you do videos.Case: I like small clingy cases, the smaller the better to toss the camera in my bag. Olympus makes the perfect neoprene case for this, but take into account there is no extra room for a spare battery if you choose this case.Note:  Whatever case you choose, the viewfinder of this camera sticks out a little bit and may \"catch\" when you're trying to put this camera in a case.  Also, the Case Logic case I had this in before buying the Olympus case....it wasn't a full zipper and several times I accidentally turned the camera \"on\" while putting in the case, as careful as I tried to be. Luckily, I didn't damage the zoom motor.The Viewfinder: I didn't buy this camera for the viewfinder. It's OK and unless it's a very sunny day and I can't see the LCD screen, that's the only time I use the EVF.  I bought this camera for the small size and a sensor that's a little larger than other cameras.Links:Sony WX300: I own this camera, it also takes great photos, and movies are super, but it does not have full manual control:Sony DSC-WX300/B 18.2 MP Digital Camera with 20x Optical Image Stabilized Zoom and 3-Inch LCD (Black)Sony WX350 (the newest): Sony WX350 18 MP Digital Camera (Black)Olympus Case (fits this camera perfectly but snug): Olympus Horizontal Neoprene and Nylon Case with Velcro Closure (Black)SDHC Class 10 Card: Transcend 16GB Class 10 SDHC Flash Memory Card (TS16GSDHC10E)", "Date": "May 27, 2014"}, {"Title": "LF 1 very satisfactory", "Author": "Steve S.", "ReviewID": "R1AJJS8SA35B9T", "Overall": "5.0", "Content": "I like this camera a lot.  Got it after reading many reviews, primarily because of the optical viewfinder, which is merely adequate but a lot better than none at all.I was surprised to find that I like the camera's performance better than my Canon S100, although its a close call.I like small, high end, extremely pocketable cameras, and dread their demise at the hands of cell phones.", "Date": "April 29, 2014"}, {"Title": "Sharp photos, accurate colors, good dynamic range", "Author": "T. Fiero", "ReviewID": "R3E45PDZOCZM12", "Overall": "4.0", "Content": "I've had the Lumix LF1 for 2 months and have been pleased with its performance. Image quality is generally very good--though you can't expect it to match the output of a good DSLR or more expensive point-and-shoots with larger sensors, such as the Sony RX-100. I'm particularly impressed with the excellent image stabilization (evident when taking hand-held videos), the good dynamic range (for capturing detail in brightly lit or shadowed areas), the panorama function that can be selected from the top dial, and the very good low light performance when taking indoor shots without a flash. The LFI has numerous advanced functions that I haven't tried yet.The LF1 is almost too small for my hands, but the small size is also very convenient--you can drop it in a pocket or slip it into a small case and carry it on your belt. Battery life is a bit short due to the small size of the battery; when traveling you'll want to carry 1 or 2 spares.Overall, this is a very good, classy compact point-and-shoot that takes great casual shots on the iA setting and offers lots of creative options for the enthusiast. BTW, CR gives it a high rating.", "Date": "April 24, 2014"}, {"Title": "Great photos; form factor could be better", "Author": "Rich B", "ReviewID": "R17BE2C77KV82B", "Overall": "4.0", "Content": "This is small and easily pocketable, which is what I wanted to replace my Canon Elph.  Takes great photos, with almost no shutter lag and has capabilities that most people will never use.  With the downloadable software, through Wi-Fi can transfer photos to computer (slow), or even use my iPhone as a remote.Menus can be a bit confusing, but have worked through that.  The only cons for me is that the power button is too close to the shutter button and can accidentally turn off when trying to snap a photo.  With more use and familiarity, I assume that will lessen.  The other negative is that the finish is a bit slick with no finger hold in the front.  I bought some scrap pebble grained leather wrapped the front part and glued it.  Besides not being so slick, it now looks like one of the older Leica range finder cameras.", "Date": "March 20, 2014"}, {"Title": "Lightweight, clear pics - but beware of battery performance", "Author": "D.N.Wijewardane", "ReviewID": "RAFUN7SMGMIIE", "Overall": "4.0", "Content": "I enjoy the small slim format and the view finder (small, but gives a fair view of the world/perspective) besides the many standard features that reviewers have commented on.However, the battery performance is not great: I fully charged the genuine battery that came with the package and used the genuine charger and was surprised (-in 8C spring weather as well as separately in a warm concert hall at night) to find the battery indicator quickly goes down to 50% with a few flashes (say 10) and photos (say 20 max), a couple of video clips (say 15 secs each) and a few photo playback reviews in between. Both in indoor and in outdoor use (each session started with a fully charged battery), the battery ran down much faster than I expected.I own a 4-5 year old Canon S90 which is in mint condition after use worldwide but I was missing Wifi, a quicker focus+picture click, a smaller form factor, a viewfinder, more uptodate hardware ... and wanted to try a Leica lens. I have yet not unpacked the second Canon battery I ordered from Amazon with my 5 year old purchase and never needed to; the original battery lasted for many, many photos+ video+ playback in one session! A second Panasonic battery seems to cost around $40 +/- : a lot!I would appreciate any users' referrals on good alternative batteries though I am nervous not to use Panasonic brand stuff in case there is no safety protection circuitry for the camera on charging (it warns thus in the Manual!).Further, the software that comes on CD PhotofunStudio 9.2AE is not Mac compatible, alas; the Silkypix Studio for processing RAW is Mac compatible. I would expect Panasonic to offer OS 10.9 compatible stuff by now. Photos upload via iPhoto fine although the movie clips do not import (.mov format is not being recognised by iPhoto).The Wifi connectivity, as another reviewer mentions, seems abit limited. Three options including Manual connection are given but I have not been able to get the camera recognised on my Home Time Capsule which does not have button-press wifi configuration... Surely this configuration can be made easier ? I can't get Panasonic Wifi config PINs accepted by my TC. I am not a router genius.The Panasonic App on iPhone and remote pairing (like using Reflector on Apples) is good.Overall seems a great little camera but the battery issue is certainly a surprise. I strongly recommend buyers to get an extra battery. Amazon's small Case Logic cases ($5?) are excellent fit and protection, with extra room.", "Date": "February 23, 2014"}, {"Title": "Exceptional!", "Author": "Jack", "ReviewID": "R1RGCUISLGU2RO", "Overall": "5.0", "Content": "I debated between this and the Canon S120. The longer focus, EVF, and cheaper price convinced me to give the Panasonic a try. I'm glad I did! The images this camera produces are exceptional for a point and shoot. Colors are true, yet vibrant. The camera feels good in the hand and feels well made. The view finder is small, but better than anticipated.Outdoor shots are gorgeous and indoor shots exceed those produced by my 4 year old DSLR. Best of all, this camera is small and easily pocketable. It doesn't draw attention to you while traveling and is so easy to carry. I like this camera so much that during a recent vacation I left my DSLR at home. When I got home and downloaded the pictures all I could say is \"wow\"!While the video produces great results (stabilization works very well and the camera is quick to focus while zooming) it does drain the battery very quickly.  The only other negative I can find,and this is a stretch, is the power button is placed next to the shutter release. More than once I shut off the camera instead of snapping a picture.This is a great little camera.", "Date": "February 17, 2014"}, {"Title": "Good camera and features", "Author": "Ronald H Thomassin", "ReviewID": "RLU5V4P4O1DOD", "Overall": "4.0", "Content": "Camera is compact and seems to have great photo quality. Plus the integrated viewfinder is nice to have available. Can  be charged without removing battery and can also transfer photos without taking out the memory card.", "Date": "December 9, 2013"}, {"Title": "Small Camera with Big Features", "Author": "BeeRichard", "ReviewID": "R32P842K19F4EU", "Overall": "5.0", "Content": "This camera is great for the pocket.  The stability program is great for long zoom -- no blurred shots.  Excellent low light performance.  Packed with so many features it competes with my Nikon SLR.", "Date": "September 23, 2013"}, {"Title": "Small Size Yet Awesome Performance", "Author": "Mac", "ReviewID": "R1XFOFWS1DWKSH", "Overall": "5.0", "Content": "Perfect size camera to take great pics even panoramics!For the price you cannot go wrong with this camera.Would definitely recommend this product.", "Date": "April 26, 2014"}, {"Title": "Packing 10 pounds of features in a One pound bag.", "Author": "Ron", "ReviewID": "R3QEKPVGWZQLP", "Overall": "5.0", "Content": "Okay I finally decided to purchase a compact after years of being a pack horse to my Nikons.  I owned a Sony DSC W80 for casual shots around the house.  But I was looking for something more advanced and decided on the LF 1.  WOW what a package.  I will follow up on my experience as soon as I feel I have mastered all of the functions but so far its a dream come true.", "Date": "February 5, 2014"}, {"Title": "Excellent indoor/low-light photos and fast!", "Author": "John R Young", "ReviewID": "R15PE8ZDPPBWXI", "Overall": "5.0", "Content": "I returned a Nikon Coolpix AW110 to Best Buy because it failed to do the two most fundamental things my wife and I want a point and click camera to do - take fast photos and take superb photos indoors and in low light.  The Panasonic Lumix LF1 simply beats the AW110 into the ground in terms of doing both of those critical things better.We live in MN and are indoors a lot.  Plus we have kids and a dog and all of those are constantly moving and create the potential for blurry images or missed images.  So we need great indoor performance and a fast camera.  We have owned a Canon Powershot Elph 220 HS and the Nikon Coolpix AW110 in the past, and hands down the Panason Lumix LF1 takes a much better picture for a point and click camera.  We are delighted and love this camera.Both with and without a flash, the photos come out looking great, color is reproduced very well, and people are not washed out by an overly agressive flash.  The auto mode on this camera is very good and we will likely never use the more advanced features.  It's just that you need a good camera like this to take great indoor, low light photos fast.I am very impressed and happy with this purchase.Other things I like about this camera: the battery can charge right in the camera, so no extra charger to lug around, just a USB cord and a plug-in adapter; the camera is small enough to fit in a larger pant pocket or a small Lowpro 10 case from Best Buy; the menu system has a nice popup message describing each feature on the menu - that means less poring over the manual; the charging cable can plug in to a regular USB port (although the port on the camera is not microUSB - see below).Things I don't like: I wish the WiFi and NFC worked with my Windows Phone 8 device and not just Android and iOS; I wish the USB port for charging the battery was a normal microUSB port, instead it is a very small, proprietary connection on the camera; I wish the charging cable was about 1-2 feet longer (maybe they sell a longer one).All around, a great camera.", "Date": "December 31, 2013"}, {"Title": "Great camera, horrible wi-fi connection", "Author": "E. A. Lind", "ReviewID": "R2Y0OF71E5ZPT1", "Overall": "3.0", "Content": "I just got this camera--it looks very nice so far.  Be warned, though, that the wifi connection options are in practice just terrible.  I have had two panasonic cameras with this feature and both have proved so frustrating that I have just given up on them.  Also the connectivity to an iPhone is terrible, requiring new entry of codes and passwords each time you want to connect.  I think they would have done better just to forget about this until they could do a better implementation.  I mean, having to re-enter manually your SSID and password each time???? Give me a break.", "Date": "January 29, 2014"}, {"Title": "Nice camera if you don't want to take a camera with you", "Author": "bart honhoff", "ReviewID": "R1LP9N2T69E64L", "Overall": "5.0", "Content": "The camera is that small and flat, that you can bring it always with you if you don't want to bring a bigger compact (like an LX7) with you. It fits nicely in your shirt pocket. Quality is as mentioned in dpreview.com. Good, but noise does already start with ISO 100. Luckily you can have RAW output as well, which is supported by my favorite photo-workflow tool DXO version 9.", "Date": "May 26, 2014"}, {"Title": "perfect small camera", "Author": "russ \"russ\"", "ReviewID": "R39SPCGYX9RERF", "Overall": "5.0", "Content": "i can't seem to be able use the screen as most people can- so was very excited about this camera which actually has a viewfinder.  it's tiny and the pictures are great.  perfect for carrying in your pocket or handbag", "Date": "May 11, 2014"}, {"Title": "Ideal Pocket Camera", "Author": "Charles West", "ReviewID": "R3T79I4QP5A7Q2", "Overall": "4.0", "Content": "The LF1 size and weight is as advertised. Easy to carry. Some controls are a bit small for adult male fingers; as an example, the diopter wheel works for the EVF, but is very tiny.Build quality is very good, as to be expected from Panasonic. I'm still learning the camera, but the scene mode shots I've taken with the LF1 are nearly as good as my Fugifilm HS 50 set on the same mode. I was surprised and pleased.Even on sale, it was a bit expensive at $299, but I expect to use the camera extensively on travels in the near future and the ease of transport will, I believe, mitigate the cost of the LF1.", "Date": "April 19, 2014"}, {"Title": "Great Camera", "Author": "R. jay \"jay\"", "ReviewID": "R3HHL279PZF4DW", "Overall": "5.0", "Content": "This camera is the best camera I have ever owned. Great picture quality day or night. EV is very helpful.", "Date": "March 1, 2014"}, {"Title": "Jury STILL out!", "Author": "dalman88", "ReviewID": "R1Y5KX15LHQY3C", "Overall": "4.0", "Content": "Just got it and still learning all the bells and whistles.  Far more complicated than my lil' old Canon SD1100 IS. Which I have taken all over the world with GREAT results. Controls are NOT intuivitive.  YOU have to RTFM.  Not easy to do since it's only on PDF.  The battery life is abysmal. Not sure why.  Does WiFi suck it down?  How can I turn THAT off?  I would say beware of cheap batteries and chargers on Amazon and pop for OEM.  However.  The quality of the pix are quite outstanding.  There is a learning curve with any new camera and I hope I live long enough to master the features I may use.", "Date": "February 27, 2014"}, {"Title": "Panasonic Lumix LF1", "Author": "Ubaldito", "ReviewID": "R76ESSEQRO2UG", "Overall": "5.0", "Content": "It is a joy to use, simple, fast, light.  It takes excellent pictures.  Would have preferred having a battery charger instead of having to connect the camera for the battery to charge....Fast and efficient delivery.  Thanks.", "Date": "December 19, 2013"}, {"Title": "Out of the park", "Author": "Roger ray Rogers", "ReviewID": "R3LDQP0F624X8E", "Overall": "5.0", "Content": "Outstanding camera Better than I thought Nice size would recommend to any photo person with skills out of the park", "Date": "March 28, 2014"}, {"Title": "PAID $299- Great PRICE - READ THIS REVIEW* FROM A REAL PERSON", "Author": "M. Lopez \"Eik\"", "ReviewID": "RVW8XJ3VEPOCV", "Overall": "5.0", "Content": "Short and sweet! This camera is by far the best compact I have had!!!WIFI direct, I am able to connect to my Samsung S3 zoom in out and take photos. Download right into to phone...Photos are great even at night...Mike L.", "Date": "December 30, 2013"}, {"Title": "就算不拍照拿在手里也不错", "Author": "Hang Sun", "ReviewID": "RUMINXNAHDULT", "Overall": "5.0", "Content": "it is a very excellent camera with this price. Much better than iPhone 5s.and the lf1 looks very very cool.", "Date": "May 29, 2014"}, {"Title": "Just What I Wanted", "Author": "C. Baader", "ReviewID": "R2HLWDQNZ6U2JL", "Overall": "5.0", "Content": "After reading the other reviews, I picked this camera - just what I wanted...compact and easy to use, with options available for the more advanced photographer...I'll probably learn the more advanced features as I get more experienced.", "Date": "April 12, 2014"}, {"Title": "Small but able", "Author": "deevee", "ReviewID": "R183ZXIE0V18GH", "Overall": "4.0", "Content": "Small evf and not sharp but better than nothingNice build and useful focal lengthBody could use a little grip", "Date": "March 2, 2014"}, {"Title": "Great Photo Quality", "Author": "A. Simmons", "ReviewID": "R35CF6QF7Y5RK9", "Overall": "5.0", "Content": "I read so many different reviews on many Panasonic cameras and actually purchased the SZ1, SZ3, and return them both due to the picture quality.  I have had the LF1 for about a week and loving the camera and features.  Still learning, but so far I LOVE IT!", "Date": "August 17, 2013"}, {"Title": "Very poor quality for a mid-range point-and-shoot", "Author": "Scott", "ReviewID": "R2EA5YYQJL5T5R", "Overall": "1.0", "Content": "I've had lots of cameras:  everything from full-frame DSLR's to more point-and-shoots than I can count.  This is the least impressed I've ever been with a camera!I love technology.  I was excited to try out this WiFi and NFC with my phone.  What an  absolute waste of time!  After spending nearly an hour alternating between the instructions and the camera and constant dropped connections, I gave up.  I've never been defeated by tech before!  The WiFi \"feature\" is outright clunky and worthless!  It's time consuming and poorly implemented in this camera!  Don't bother.The power button on this thing is another problem.  It's on the top right - right next to the shutter release button.  And they're both buttons (the power button is slightly recessed).  So far, every time I hand the camera to someone and tell them to take a shot, they instinctively press the power button, shutting the camera off instead of taking a photo.  Just who engineered this camera, a third grader?Now for the good news:  I bought this camera because the imaging chip is slightly larger than the chips in similar cameras - hence a better photo.  I've taken a few photos and so far they are turning out very good.  Accurate color and lots of customized control on this camera make it almost like carrying a much higher quality camera.If the Wi-Fi and power buttons were fixed, this camera would be worth every penny, but it's difficult for me to justify spending this much on technology that is just plain clumsy and totally useless.  Yes, I know you buy a camera for pictures, but I was willing to pay more for this expensive camera because of the added technology.  It's too bad it's such a disappointment.UPDATE:I finally had a few minutes free to check the lens sharpness on this camera.  I noticed that the edges are extremely soft (out of focus) while the center of the photo is razor sharp - certainly not what I'd expect from a camera in this price range!  I'll add a couple of photos of text to the image gallery so you can see exactly what I mean.  I would like to think that maybe I just got a defective camera, but other reviews mentioning identical problems have convinced me not to waste any more time on this camera.I'm returning this camera and downgrading it from 2-stars to 1-star.", "Date": "March 24, 2014"}, {"Title": "Too slow", "Author": "Pat M.", "ReviewID": "R3B52Q9K1SMJ19", "Overall": "2.0", "Content": "Camera was too slow - wouldn't let me take continuous frames. Also took too long to focus on the subject.", "Date": "February 16, 2014"}, {"Title": "Save Your Money...", "Author": "Anonymous", "ReviewID": "RHIBXWFLKCE9F", "Overall": "1.0", "Content": "... and buy a Canon PowerShot SX110 IS -- the images are sharper.I purchased a Lumix DMC-LF1 (because it had a viewfinder) to replace the above five-year-old camera and despite having 33% more pixels, a Leica lens, more recent technology, and a price twice that of the Canon, the photos are simply not as sharp. And, customer service is appalling.Unfortunately, I had injured my hand I could not try the camera out within the two-week return period of Ritz Camera, the seller. Thinking it must be a lemon, I called the phone number on the warranty card twice; after being transferred twice each time, I was put on hold and then cut off, first after eight minutes and then 31 minutes.  Calling the number on the repair service webpage resulted in being on hold for 94 minutes, at which point I gave up.  Calling the service site in McAllen, Texas resulted in the phone ringing and ringing... and ringing, never to be answered!Ultimately, I sent the camera to the service site only to be told that it was \"working within specifications.\"  This was the first time I deviated from a Canon camera, and certainly will be the last!  If for no other reason than Panasonic's execrable customer service, buy another brand.", "Date": "March 20, 2014"}, {"Title": "Great camera, terrible software", "Author": "John Rundle", "ReviewID": "R3EXYKKE60OUCM", "Overall": "4.0", "Content": "The camera itself I like very much.  It is the best pocketable camera with a viewfinder that I am aware of.  The manual is another matter:  To format a memory card, for example, you need to take the camera off the default iA setting and then scroll down the the 8th page of the setup screen.  The manual only says the you need to format the card.  Battery charging is also a problem.  Battery charging can only be done in-camera with a proprietary, too-short cable.  If only it could be charged with a cell-phone charging cable!  But it can't, so users would be well advised to get an external charger.", "Date": "March 12, 2014"}, {"Title": "good product", "Author": "KeriA", "ReviewID": "RN9F5879K0BP7", "Overall": "5.0", "Content": "works as it should, nice and sturdy, good stuff and does not stink.  I am writing this review to fill up the words.", "Date": "February 17, 2014"}, {"Title": "Excellent camera choice", "Author": "Claudia", "ReviewID": "RP6XW3YRJ88X", "Overall": "5.0", "Content": "Very easy to use for a novice and am looking forward to really developing by photographic skills with this camera.Since it fits in my pocket, I take so many more pictures.", "Date": "January 2, 2014"}, {"Title": "Not Good Image Quality", "Author": "G. Donaldson", "ReviewID": "R2V5VA4H8ZOZ89", "Overall": "2.0", "Content": "I bought this for my wife for a trip abroad.  We are dismayed by the poor quality image.  She is shooting at ISO 80, Aperture priority, and processing the RAW images (JPEG Fine is lousy) with Silkypix or PhotoDirector, converting to TIFF, and doing further editing with PhotoStudio 6.  The RAW images even at the best settings have significant noise and are \"soft\" at any focal length even prior to any processing.  This is a baseline issue which cannot really be corrected with post-shot processing.  Whether this is an artifact due to production variation or a basic design flaw in the camera is impossible to tell, but the camera is probably going back to Amazon.", "Date": "February 5, 2014"}, {"Title": "Proprietary USB Charge Cable and No External Charger", "Author": "T. Ta \"The one and only!\"", "ReviewID": "RDDWK0FQE9ZD9", "Overall": "3.0", "Content": "I hope people find this tidbit of info useful because I was not aware of it. I'm coming from Canon and Canon cameras come with an external charger. Canon also uses standard mini USB instead of proprietary USB.  It's enough reason for me to return the camera alone because I am 100% against these practices.", "Date": "August 22, 2013"}, {"Title": "Panasonic lf1", "Author": "Dickson", "ReviewID": "R1P4OGEADY0QUA", "Overall": "4.0", "Content": "Picture quality is good, not as good as my wifes Sony rx100. I like the EVF, works pretty good for it's size. Would like a little more zoom.", "Date": "August 17, 2013"}, {"Title": "the power cable does not fit !", "Author": "christophe", "ReviewID": "R1AEH8IK6JXGTI", "Overall": "1.0", "Content": "We have a pb. We have used the camera for those last weeks. It is nice, We are happy with it.The pb is that the power cable does not have the correct size so as to enter in the camera itself....!!! :-(We would like to know if Amazon can fix this and send us a new and useful one ! thanks. Otherwise, WE CAN USE THIS CAMERA ANYMORE ! or buy another power cable. But honestly we can not understand how it happened ! thanks in advance.", "Date": "April 23, 2014"}, {"Title": "Unusable viewfinder", "Author": "Sprocket", "ReviewID": "R2ZLO27CRTL7L4", "Overall": "2.0", "Content": "I bought this model because it had a viewfinder and larger sensor.  The viewfinder is not usable.  I can tell there's something out there but it is WAY too fuzzy to use for taking pictures.This camera also has a light plastic feel, not at all like my old Panasonic Lumix DMC-FX07 which feels substantial even though it is compact.", "Date": "September 5, 2013"}, {"Title": "SELLING point is the stumbling block.", "Author": "A. Tay \"Private Tay\"", "ReviewID": "R2JBBC4DFG3TR5", "Overall": "3.0", "Content": "The f2.0 lens at the widest setting is goodBut I bought this camera because I wanted an optical viewfinderSo framing would be easier when shooting fast moving stuff or against the lightAnd here's where the product\\feature doesn't deliver:you have to manually select between viewfinder or screen to viewin other words, unlike most other cameras, there is no sensor on the eyepiece (so when the camera is against your eye, the viewfinder automatically kicks in)I use it to video a car vandalI don't know when he's going to strikeBut when I see him and turn on the camera, it's annoyingIf the last time I had used the screen (instead of the viewfinder), then viewing is done on the screenTo switch to viewfinder, I have to hit a small LVF (Live Viewfinder) buttonWell, I film in near darknessSo it's not easy to always hit the LVF switchShame", "Date": "October 23, 2013"}], "ProductInfo": {"Price": null, "Features": "The only pocketable premium zoom digital camera with an adjustable Electronic ViewFinder (EVF)\nHigh sensitivity 12.1 MP MOS sensor\n13 built-in creative controls plus Panaroma and Retouch modes\nBright F/2.0-5.9 7X zoom\nWirelessly links to Smartphone (Wi-Fi and NFC enabled)", "Name": "Panasonic Lumix DMC-LF1 12 MP Digital Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Rjnl99bRL._SX300_.jpg", "ProductID": "B00CFCTDMC"}}