{"Reviews": [{"Title": "Don't go by the \"Frequently Bought Together\" suggestion!", "Author": "Shadow Ferret", "ReviewID": "R2XVQYT4DOK9U5", "Overall": "4.0", "Content": "The camera itself is a great deal, however, it comes with a 4gb micro-memory card. Do NOT go by the \"Frequently Bought Together\" suggestion Amazon posts with this camera. It suggested a \"Transcend 16GB Class 10 SDHC Flash Memory Card (TS16GSDHC10E) $12.95\" so I clicked the \"Add Both to Cart.\" When the items arrived, it turns out the Transcend 16gb is a HUGE memory card, the size of a postage stamp and totally useless with this camera. So I had to ship it back. Not sure why Amazon would list these items together like this when they clearly don't go together.", "Date": "September 10, 2013"}, {"Title": "Great", "Author": "J. Darden", "ReviewID": "R5I2XK6CA5NYA", "Overall": "5.0", "Content": "Needed a more compact camera for travel.  Chose because of size and features.  Received and set up.  Very excited about all of the different possibilities and uses for this camera.  Haven't had a chance to put all features to the test but my initial testing was very impressive.  I believe I made the best choice.", "Date": "July 30, 2013"}, {"Title": "The pictures are good, it is easy to use.", "Author": "PW \"PW\"", "ReviewID": "RGA0I4BOVTXOG", "Overall": "4.0", "Content": "The pictures are good, and it is easy to use.  I like the WIFI feature a lot that it can sync with my Samsung Galaxy phone or share the pictures via facebook, etc.  With its 10X zoom without a view finder, It is a bit hard to find and zoom into a distant object using the screen, it just takes longer time for the LCD display to show it.  But overall, I am happy with the purchase.", "Date": "October 16, 2013"}, {"Title": "Great Cam!", "Author": "Maria Carolina Aced", "ReviewID": "R3147SU5Y429HK", "Overall": "5.0", "Content": "Got it a few days ago! Havent tried all the features but seems very cool! And pics are great. Brings a case with zipper and aa 4 gb sd card. Go for it!", "Date": "September 18, 2013"}, {"Title": "purchased as a gift", "Author": "queenme", "ReviewID": "R194TC0IC79ZE5", "Overall": "3.0", "Content": "as far as I know the recipient has enjoyed it! and it says 10 more words are required, there you go!", "Date": "September 8, 2013"}, {"Title": "Wow!", "Author": "Kathryn M. Wasileski", "ReviewID": "R1QEDTKVK11NVO", "Overall": "5.0", "Content": "Pretty amazing little camera. It works well with my Galaxy tablet. I have just begun to learn about all the amazing things it can do! So far, it has been easy to use. I tried the panoramic feature, and it was so easy with great results.  I also tried the email feature, and it, too, worked well. Who ever thought I'd be sending emails with a tiny camera!", "Date": "September 1, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Sensor Resolution:16.1 Megapixel\nAE/AF Control:Face-priority AF, Subject-tracking AF\nAV Interfaces:Composite video/audio\nDigital Video Format:H.264\nOptical Sensor Size:1/2.3\"", "Name": "Samsung ST200F Digital Camera, 16.0 MP, 27mm 10X Zoom (Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/51wiFRuC42L._SY300_.jpg", "ProductID": "B00C30JJ2U"}}