{"Reviews": [{"Title": "Canon EOS T3 Package", "Author": "Marvin Hughey \"polka dancer\"", "ReviewID": "R2JOXLMWV6HDL", "Overall": "4.0", "Content": "This camera was a very pleasant surprise.  The lenses were exceptional, the bag wasn't quite big enough for everything included.  The tripod is short, but I had a larger one so it still was ok. I found this to be a very nice package deal for someone wanting more than a credit card camera. Cannot go wrong for the money.", "Date": "October 27, 2013"}, {"Title": "Great bargain on a gret product.", "Author": "Ralph", "ReviewID": "R218NW0759ZNIO", "Overall": "5.0", "Content": "It was like Christmas opening the box and getting all those wonderful extra products to compliment my new camera. Several extra lens's, photo bag, tripod, 16GB card, extra battery, several lens filters, etc., etc.The supplier was very good to deal with and everything arrived in a timely fashion and very well packed. Thank you!", "Date": "October 19, 2013"}, {"Title": "Canon EOS Rebel T3 Digital Camera SLR Kit", "Author": "Rachel W.", "ReviewID": "R1ASM0VNSV57ZB", "Overall": "5.0", "Content": "Pefect!!!! It's such a great deal ever!This 16GB kit includes everything I want. Love the wide angle and telephoto lens, great quality.Though the Tripod is not that in high quality, it works well and is easy to carry.", "Date": "September 15, 2013"}, {"Title": "widely exceeded my expectations, thank you very much", "Author": "maria noelia ferri", "ReviewID": "R1DNMAY5Z3IR5L", "Overall": "5.0", "Content": "with my family needed a camera and allowed us to make this purchase photographs of our vacation in disney world, thank you very much", "Date": "January 18, 2014"}, {"Title": "Great Deal", "Author": "Anthony Kostecki", "ReviewID": "R3UVDZTM6DX2CZ", "Overall": "5.0", "Content": "A great deal compared to big box stores. Everything came neatly packaged and organized. I couldn't believe I got all the extras for less than the price of just the camera at some stores.", "Date": "March 14, 2014"}, {"Title": "satisfied", "Author": "coorscur", "ReviewID": "R34NCBLFMTVYD6", "Overall": "5.0", "Content": "a great starter SLR camera at an extremely reasonable price.  only drawback - the camera bag is not near big enough to hold all the items.  easy to use, takes clear crisp photos.  using mostly for birding.", "Date": "March 2, 2014"}, {"Title": "Great starter camera", "Author": "Amazon Customer", "ReviewID": "R1IYGS04Q6AKX5", "Overall": "5.0", "Content": "For the price, this is a great starter package that any amateur photographer should take advantage of.  This camera takes exceptional pictures.  I agree with another comment though that the bag in the package is quite small for everything that is included.", "Date": "February 4, 2014"}, {"Title": "Great Bundle For A Great Price!", "Author": "fivemark", "ReviewID": "R1Y41E2EOHYAES", "Overall": "5.0", "Content": "I'm enjoying this camera a lot. It's perfect for learning how to shoot using depth-of-field. The only problem that I can think of is the little tripod that was included in the bundle -- it's a little flimsy, but it's not to bad. The tripod might be better for a little sports camera like the GoPro, but other than that, I'm very pleased with the performance of the camera.", "Date": "February 23, 2014"}, {"Title": "More than I ever dreamed!", "Author": "jeannie maxwell", "ReviewID": "R2U2AN92GUR2QA", "Overall": "5.0", "Content": "This is a great kit! I researched extensively and always come back to Amazon because of the deals and prices. I'm still tinkering with all of the extras but the camera came to great use on our European three week vacation. My photos came out amazing and the camera is user friendly. I plan on going beyond the basics and really diving into some of the manual settings. Couldn't ask for anything more! This is a great buy!", "Date": "October 30, 2013"}, {"Title": "Wow!  That's all I can say - WOW!", "Author": "kstock", "ReviewID": "R2M54VXEJGB86F", "Overall": "5.0", "Content": "We purchased this camera kit for our 15 year-old, budding photographer.  I had done about 2 years of research and found that this camerawas the best quality/value for the money.  It's also a great starter camera for someone starting out with a DSLR.  When it came time to actually purchase the camera, I did even more research and found that this was the best deal possible.  I was a little nervous at first, thinking maybe some of the items might be off-brand or cheap (like the filters).  Holy smokes!  Was I impressed with this kit. Everything in the description came securely packaged in a box - inside of another box (which made me know for sure that nothing was going to be damaged).  Everything was brand new in original packaging.  The camera is fantastic. The lenses are awesome.  I am thrilled by the amount of items in this package.  If you purchased everything separately, it would cost a few hundred dollars more. In fact, the camera, 2 lenses, and memory card are sold at a lot of other places for $450.  But, the memory card isn't even as large as the one in this kit.  Long story short, this kit was better than we even expected.  To the people who said the tripod was cheap - the one in our kit is not cheap at all. It's a nice, sturdy tripod.  To the people who said the case is cheap.  Nope - it's a very, high-quality case.  To the people who said the case is too small - the case is not small at all. There is plenty of room for your camera equipment.  However, this kit comes with SOOOO many items, you cannot possibly fit EVERYTHING in the case.  But, it is roomy enough for the camera, lenses, filters, batteries, etc.  We are so impressed with everything in the kit.  The seller gave us exactly what was promised.  And, it came super fast too.  We had a 1 day delay but that was the fault of UPS (who's truck was delayed).  I would highly recommend this kit - from this seller.", "Date": "June 5, 2014"}, {"Title": "Excellent Buy", "Author": "Steve Darwin", "ReviewID": "RVDNK8NRBBK6P", "Overall": "5.0", "Content": "This is a very high quality item and is well worth the money. It will provide an awesome experience for many years!", "Date": "June 5, 2014"}, {"Title": "Best camera kit!!!", "Author": "Sherral", "ReviewID": "R2A2EWT2U4IIW4", "Overall": "5.0", "Content": "I love this kit!!!! It has everything you need if you are just starting out. I like the included filters and wide angle and zoom lens. The bag is small but I was able to fit everything in it and the tripod isn't the best but it gets the job done for now. Best camera purchase ever!!!", "Date": "June 4, 2014"}, {"Title": "AWESOME", "Author": "Brenda Hopkins", "ReviewID": "R1AYY4Q16DMPHZ", "Overall": "5.0", "Content": "Love the camera and all the extras were an awesome bonus.  This is a great camera.  I am very pleased with it.  The extra lens were an excellent bonus.  If i had one issue with the package, the bag is too small for all the stuff and very cheaply made.  The camera lens and all the other stuff makes up for that.  Especially loved the extra battery.", "Date": "June 2, 2014"}, {"Title": "Awsome", "Author": "Bailee Barber", "ReviewID": "R2QTBO1QK2UN0X", "Overall": "5.0", "Content": "This was my daughters first professional camera. It takes great pictures and is so easy to operate. Love it. Everything was as promised", "Date": "May 11, 2014"}, {"Title": "Very nice camera & goodies package", "Author": "Robert Sylvia", "ReviewID": "R2VOJGMG7Y3IQD", "Overall": "4.0", "Content": "Purchased this camera and accessories package as a gift for my son.  I have purchased other Canon products, including cameras and have always been pleased with their products, and the photo quality in the case of the cameras.  This camera has not disappointed.  The photo color quality is rich & vivid.  Plus all of the the accessories included make it an outstanding first DSLR kit for him, and I'm sure many good times & outstanding photos will follow.  I'll likely move back to a Canon DSLR camera for my next camera, and I would definitely recommend this product to others.Lastly, the purchase transaction was handled very well & the product was received in the time frame promised.", "Date": "May 7, 2014"}, {"Title": "I love it!", "Author": "Chris", "ReviewID": "R1P7GM9A888XEH", "Overall": "5.0", "Content": "I love the camera and all the accessories.  I am thoroughly enjoying it and need to learn more about this very versatile camera.", "Date": "May 4, 2014"}, {"Title": "in love", "Author": "Jessica", "ReviewID": "R3CD005O45BYAQ", "Overall": "5.0", "Content": "I've been using this for about 2 months already, I took my time with it, shot football games, portraits, and squirmy kids. and it literally has everything I need. I've bought extra stuff since then but it was a great start up package. the price wasn't too bad either. great buy, don't regret it at all.", "Date": "April 3, 2014"}, {"Title": "A terrific bundle", "Author": "browneyedgirl", "ReviewID": "RX91C7OFLSW4Y", "Overall": "5.0", "Content": "This Canon camera bundle was a gift for a friend, but I know first hand how much he loves it.", "Date": "March 1, 2014"}, {"Title": "Great deal", "Author": "laura van pelt", "ReviewID": "R3ONP3HT7OCTUN", "Overall": "5.0", "Content": "Love this camera! My school mates are jealous because I got such a great deal on this camera and lens kit. I did however purchase another camera bag as the one included wasn't what I needed.Went to Amazon for that too, and got a great bag at a fantastic price.", "Date": "February 12, 2014"}, {"Title": "Great starter kit!", "Author": "A. P. Kruebbe", "ReviewID": "R15L18KW3T5GGW", "Overall": "5.0", "Content": "Purchased this Canon EOS kit for a 14 year old novice and it is quite the camera.  Great set of lenses.  Well worth it for the beginner. Only downside is the size of the camera bag.  We purchased the AmazonBasics Backpack for SLR Cameras and Accessories-Black and it was a perfect size to fit all of the equipment & lenses that are included in this kit.", "Date": "January 28, 2014"}, {"Title": "Good company", "Author": "Justin Nevarez", "ReviewID": "R2CLG3G9JYRLA8", "Overall": "5.0", "Content": "It was a great kit got wife shopping all done it 15 min. And no Lines you have to wait in.", "Date": "January 1, 2014"}, {"Title": "Great set for next stage in photography", "Author": "Tony", "ReviewID": "R3G6HBLWPVNGM4", "Overall": "5.0", "Content": "Gift for my daughter.  She loves it.  Great set to help her explore photography.  Bought this with an idiot's guide to photography and they work well together.", "Date": "November 25, 2013"}, {"Title": "Camera bag issue", "Author": "Barbara Locke", "ReviewID": "R3725TWF04N4JW", "Overall": "4.0", "Content": "Very pleased with my camera and all the accessories with the exception of the camera bag. By day 3 it was already ripping at the seams :-(", "Date": "October 31, 2013"}, {"Title": "Lens cleaner rupture", "Author": "Joshua", "ReviewID": "R2J4DGQ0961EFE", "Overall": "2.0", "Content": "The lens cleaner fluid container burst in the packaging, getting unpleasant-smelling liquid all over everything.  Fortunately, everything seems to be working.", "Date": "November 9, 2013"}], "ProductInfo": {"Price": "$509.00", "Features": "Kit Includes 16 Products -- All Brand New with Manufacturer supplied accessories, and Warranty:\nCanon EOS Rebel T3 Digital Camera SLR Kit With Canon EF-S 18-55mm IS II and Canon 75-300mm III Zoom Lens + Transcend 16 GB Class 10 SD Card\n45x Wide Angle Lens (58mm) + 2.5x Telephoto Lens (58mm) + LP-E10 High Capacity Lithium-Ion Battery Pack + 2 Zeikos 58mm UV Filters\nSDHC Card Reader + Large Camera and Lens Case + Memory Card Wallet + Digital Camera Cleaning Kit\nExtra Lens Cap + CapKeeper + Screen Protector + 50-Inch Tripod --- Exclusive by TheImagingWorld", "Name": "Canon EOS Rebel T3 Digital Camera SLR Kit With Canon EF-S 18-55mm IS II + 16 GB Super Kit -- Includes: Canon 75-300mm III Lens + Large Vidpro Multi-Lens Case (Black) + Transcend 16 GB Class 10 SDHC Card + Zeikos Card Reader + LP-E10 High Capacity Lithium-Ion Battery Pack + 2 Zeikos 58mm UV Filters + Memory Card Storage Wallet + Digital Camera Cleaning Kit + Extra Lens Cap + Capkeeper + Screen Protector + .45x Wide Angle Lens (58mm) + 2.5x Telephoto Lens (58mm) + 50-inch Tripod", "ImgURL": "http://ecx.images-amazon.com/images/I/51nKpL-WXtL._SX300_.jpg", "ProductID": "B00CW109S8"}}