{"Reviews": [{"Title": "Early Failure", "Author": "Richard L. Eaton", "ReviewID": "R36E34K7AJZBYD", "Overall": "3.0", "Content": "The bundle is marginally worth the extra dollars.  I would buy it all separately next time. The extra battery and battery charger is a great idea.  The extras are both supposed to be compatible, however, the voltage and amps are ever so slightly different that I wonder about interchangeability.  After about 3 weeks and 300+ great photos, the camera no longer would stay powered up.  It would turn on briefly enough that one could see that the battery indicator showed fully charged and then the camera would power down.  I tried the extra battery, same result.  There are many EOS users out there that have contributed to various user forums about the same problem.  Solutions ranged from pulling the battery to pulling the lens and the battery to pulling the memory card.  Great, that's all I want is a camera in which I have to do resets of some form.  Although the camera was purchased from Amazon, it was through Cardinal Camera.  I sent them an e-mail and they responded immediately.  They decided to send me a new battery and charger thinking that it sounded like a battery problem.  They said if that didn't work to call Canon Service.  The battery arrived in just a few days. The new battery made no difference, so I boxed up the camera, insured it and sent it via Fed-ex to Canon.  So now I am out $24 for the boxing/shipping/insurance and don't have my camera.  Canon said that they typically take 7-10 after it arrives to service it.  So the story could end well.  Now I will wonder when it will give out again.  This is the downside of not buying from a local camera dealer.  Will update!August 23, 2013: Canon Service does keep you informed about what is happening and notifies you when they are shipping it back to you.  The repair was at no charge.  They replaced the circuit board.  Works well today, but will now always wonder when/if it will fail again and how much it will cost me if it fails outside of warranty.", "Date": "August 4, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CBYVRD2"}}