{"Reviews": [{"Title": "Lot's of amazing items", "Author": "christina260", "ReviewID": "R24A29NEGLU39B", "Overall": "5.0", "Content": "We love our new camera. It's very sophisticated and has more functions than we know what to do with. You have so many options that the list is endless. The accessories will keep you busy for ages. The long range lens is amazing and can help take the most detailed photos you can imagine. We have used the tripod on several occasions and we have filled the carry bag with all kinds of new accessories for our camera. This camera has endless choices of filters you can purchase for it and other lens options that will give you great looking photos.", "Date": "July 26, 2013"}], "ProductInfo": {"Price": "$1,199.00", "Features": "18.0 Megapixel CMOS (APS-C) sensor, 14-bit A/D conversion, ISO 100-12800 (expandable to H: 25600) for shooting from bright to dim light and high performance DIGIC 5 Image Processor for exceptional image quality and speed.\n9-point all cross-type AF system (including a high-precision dual-cross f/2.8 center point) for exceptional autofocus performance when shooting with the viewfinder and Hybrid CMOS AF increases autofocus speed when shooting photos and movies in Live View.\nHigh speed continuous shooting up to 5.0 fps allows you to capture all the action.\nEOS Full HD Movie mode with Movie Servo AF for continuous focus tracking of moving subjects, manual exposure control and multiple frame rates (1080: 30p (29.97) / 24p (23.976) / 25p, 720: 60p (59.94) / 50p, 480: 30p (29.97) / 25p), built-in stereo microphone, manual audio level adjustment, and Video Snapshot with editing for expanded movie shooting options.\nVari-angle Touch Screen 3.0-inch Clear View LCD monitor II (approximately 1,040,000 dots) with smudge-resistant coating features multi-touch operation and Touch AF for an easy and intuitive experience, flexible positioning, and clear viewing even when outdoors.", "Name": "Canon EOS Rebel T5i 18.0 MP CMOS Digital Camera with EF-S 18-55mm f/3.5-5.6 IS STM Zoom Lens + EF 75-300mm f/4-5.6 III \"USM\" Telephoto Zoom Lens + 10pc Bundle 32GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51VBHGkWwEL._SY300_.jpg", "ProductID": "B00COTIKU2"}}