{"Reviews": [{"Title": "Missed shots gone forever", "Author": "Virgil O. Ermitano", "ReviewID": "R31Q2QD288OVQ1", "Overall": "5.0", "Content": "We went to Europe with my camera but lost my battery at the airport. I bought a replacement in Munich but it was very expensive and it was only rated 850 mah. These almost triple the rating at 2200 mah. I have two so that is almost six times longer and I paid a whole lot less for these. While in Europe, my battery only lasted until noon. I wish I had these batteries then, it would have been nice not missing all those important shots I could have had. Since I'm not going back there, those missed shots are gone forever. On our next trip, wherever that maybe, I'm ready with my new batteries.", "Date": "October 14, 2013"}, {"Title": "work great but they're not 2200 more like 1200mAh", "Author": "maverick75", "ReviewID": "R3V27WT85WLBG", "Overall": "4.0", "Content": "Been testing these for a while and they work great, just they're not the 2200mAh they claim to be.I have some 1250mAh power2000 batteries and they last the same amount as those, not any longer.but still they're a great deal for the price, I'm completely happy.If you plan to do long shoots or video with the M definitely have at least 3-5 batteries.", "Date": "April 28, 2014"}, {"Title": "Could be a bit better than the Canon version", "Author": "Doctor Ken", "ReviewID": "R2LYKVJXGMTIUG", "Overall": "5.0", "Content": "This charger is AC/DC with both a car lighter input and an AC cord input.  The form factor is a bit different, but overall comparable in size to the original.  This now becomes my travel charger!  The Rebel SL1 is not very battery hungry so three batteries mean I won't need to charge very often.", "Date": "March 23, 2014"}, {"Title": "Works Perfectly", "Author": "M. Son", "ReviewID": "R27H5ICX3GND7Y", "Overall": "5.0", "Content": "I was able to charge the two batteries quickly and tested them in my Canon and they were recognized and showed a perfect charge.  Will buy more.", "Date": "February 17, 2014"}, {"Title": "fantastic battery", "Author": "Dalibor Moyzes \"artist-photographer\"", "ReviewID": "R1QGWLL6H8L35P", "Overall": "5.0", "Content": "much longer life on my canon m camera compare to the original battery ... why spend 50 on canon battery, when this one is better", "Date": "February 14, 2014"}, {"Title": "Great buy and holds the charge pretty well", "Author": "Amazon Customer", "ReviewID": "R3ORFZUSEII8AO", "Overall": "4.0", "Content": "We bought these batteries as a backup for the original batteries. Until now no problems with them and they hold the charge pretty well. Great buy! and fast delivery.", "Date": "February 7, 2014"}, {"Title": "EXACTLY AS ADVERTISED", "Author": "Bill McLean \"Is this worth the price?\"", "ReviewID": "RJWYLV4EMAMVL", "Overall": "5.0", "Content": "Two high capacity Lithium batteries, one A/C battery charger, and one 12k Volt car battery charger.  All new and nicely packaged, and sold at a modest price.  My Canon EOS-M camera is happy.  I am happy.", "Date": "December 13, 2013"}, {"Title": "Size problems", "Author": "Rajbir Bhattacharjee", "ReviewID": "RYTFU64IWTOMH", "Overall": "2.0", "Content": "The power backup of the two batteries is decent. However, one of the two batteries I got is slightly too big, and gets stuck in the battery compartment of my EOSM. It takes quite some effort and probing with a ball point pen or something else to pry it out of the battery chamber.Of the two batteries, only one of them had this problem. But given the cost, I think it is OK.", "Date": "June 2, 2014"}, {"Title": "Halcyon 2200 MAH", "Author": "Photo Belle \"Photo belle\"", "ReviewID": "RYO30W5HEDU24", "Overall": "5.0", "Content": "These are for my husband's camera.  They charge well and seem to work well.  They keep the camera operating for a much lower cost than original batteries.", "Date": "May 5, 2014"}, {"Title": "Great!", "Author": "Carla", "ReviewID": "R1R5GPU5SM8HJT", "Overall": "5.0", "Content": "Charges fast.  When taking hundreds of pics of my grandkids at a time no problems, just drop in a fresh battery and charge the depleted one as I go. Really a great deal all around good price and good product!", "Date": "May 1, 2014"}, {"Title": "good batteries for Canon EOS M ...", "Author": "rtcii", "ReviewID": "R37L5GK0TXL8RW", "Overall": "5.0", "Content": "Work well for addition batteries for the Canon EOS M, even though the camera does not recognize the Halcyon battery inserted.  An extra tap to the camera menu enables the camera to acknowledge the battery.The charger is smaller than the original Canon battery charger and the 110 V AC prongs are retractable, not so with the Canon which is a rat tail power cord.  A plus is a 12 V car power cord.", "Date": "April 28, 2014"}, {"Title": "Good buy", "Author": "El Jefe", "ReviewID": "R33VDY55II1G37", "Overall": "5.0", "Content": "I have only drained the factory battery once taking portraits at work, and I was glad I had these spares. I use the auto charger attachment and always keep a charged battery in the back of my jeep and use the factory one at home.I have used the factory charger and these batteries OK. I have used the factory battery and this charger OK.I have not noticed a difference in capacity of the battery or charge speed of the charger. There is nothing obviously different from the factory, but I really haven't made any empirical measurements either.", "Date": "February 23, 2014"}, {"Title": "One holds charge pretty well, the other....", "Author": "C. Smith", "ReviewID": "R3E6O0GWBQLLON", "Overall": "2.0", "Content": "Not sure if these have the energy density of the lower rated (mAH) CanonOEM battery, but having 3 batt's now, I can shoot a few hours of video andbe pretty certain to have sufficient power.", "Date": "March 31, 2014"}, {"Title": "Not bad, but not that impressive either.", "Author": "Plutonius", "ReviewID": "R4JXUUADG57YZ", "Overall": "3.0", "Content": "Not the most impressure battery in the word. I highly doubt the MAH rating as this performs just the same as the run of the mill Canon lens. Not bad, but not that impressive either.", "Date": "December 7, 2013"}], "ProductInfo": {"Price": "$17.99", "Features": "Package Includes: 2 Halcyon Brand Battery & 1 Halcyon Brand Wall & Car Rapid Charger\nBattery Specs: 2200 mAh with Premium Japanese Cells\nHalcyon Support: Includes 5 Year Halcyon Replacement Warranty. Full Membership Access to Halcyon Customer Support Website\nFrustration Free Packaging. No wasteful and dangerous plastic blister packs.\nCompatible with all cameras which take Canon LP-E12 Batteries", "Name": "Two Halcyon 2200 mAH Lithium Ion Replacement Battery and Charger Kit for Canon EOS M 18.0 MP Compact Systems Camera and Canon LP-E12", "ImgURL": "http://ecx.images-amazon.com/images/I/51acy5P7ETL._SY300_.jpg", "ProductID": "B00C32SPDW"}}