{"Reviews": [{"Title": "Great Camera for a Nice Low Price!", "Author": "Reid Boyce \"Reid\"", "ReviewID": "R2U0W03PZQQWBC", "Overall": "4.0", "Content": "I just purchased this from target for Black Friday after a nice weekend taking pictures in Portland, OR, imgur.com/a/FNFVg, I am happy to say I am extremely pleased with this camera! It takes nice crisp photos, and it definitely feels worth more than 140 dollars to me! The flash is not a problem and when you pop it up it goes off when needed. You can easily engage the flash by popping it up and hitting the up directional button and selecting \"Fill Flash\" so it will always go off even when the camera thinks it isn't needed! If you are thinking about the Nikon COOLPIX L620 18.1 MP CMOS Digital Camera with 14x Zoom Lens and Full 1080p HD Video (Black) because of the sometimes slightly cheaper price and more megapixles I would still urge you to get this camera! The zoom on this camera is ages better and the wider lens on this camera is going to give you great close up shots! I zoomed completely down a city street with this camera and had excellent results with the photos I took! Megapixles aren't everything and where the L620 lacks, this camera heavily succeeds and should not be over looked!The screen: the screen isn't super good or anything, it shows the pictures you took in somewhat good detail. But to be honest who cares if the screen on the camera is good, we only should really care about picture quality!The Build Quality: Overall I am super happy I bought this camera. It is super sturdy and has no trouble being tossed in a backpack and going along for a hike with you. It comes with a camera strap and lens cap which are both of high quality. The camera it self seems very well put together and has that Nikon feel.The Picture: The photos are super crisp and I love them! Way better than any picture I would normally have taken with my cell phone. This camera definitely helps me take photos that will capture memories for years to come, and I will have no regrets when I look back at the pictures later on.If you are looking for a camera to take on a nice hike or bring into a concert then I would recommend this one! If you are trying to replace your super fancy DSLR, then you will want to look elsewhere, but for the price of this camera, you really get a super great deal!**EDIT**: Noise while zooming in a video, okay I just tested this and I do agree the noise is a bit loud. Because of this I will drop my review down to 4 stars, I still highly recommend this camera if you are using it for mainly pictures though! If you are using this thing to shoot movies a lot however,  I would urge caution in zooming if you are going to use the included microphone on the camera. There are some really simple solutions for this though!- Use a separate microphone- Be more mindful of zooming while taking video shots! The best shots in films don't do a lot of zooming usually.- After making a video, edit it on your computer! add some music to your videos and get rid of the wind noise and random things you will pick up with the camera's microphone anyway! Get creative!", "Date": "December 1, 2013"}, {"Title": "Massive zoom", "Author": "James  Balbuena", "ReviewID": "RA2GKRBDD5XZP", "Overall": "4.0", "Content": "I got this camera because I use it a lot in situations where I need the zoom feature (sport events, concerts, etc). Having a 26x optical zoom on a camera for less than $200 is fantastic. This allows me to really get close to the subject even tough I am far away. The only issue I have with the camera is that some images apper a bit blurry. I will be trying to use a tripod more often to see if that helps. As other reviewers encountered the same problem, I thought I mention this anyway. Otherwise, great camera.", "Date": "December 2, 2013"}, {"Title": "Nikon coolpix L320", "Author": "Scalovi", "ReviewID": "R1H4IM8X4QEOTE", "Overall": "4.0", "Content": "Excellent camera for the price! The quality of pictures is exceptional and the zoom lens does a great job. Easy to use right out of the box for average person. Nikon did a great job on this one.", "Date": "January 8, 2014"}, {"Title": "Amazing for the Money!", "Author": "Garry_James", "ReviewID": "RE7OWANY5RMTI", "Overall": "5.0", "Content": "I too bought this Nikon L320 at Target Black Friday sale.  Almost immediately got on a plane for Nicaragua and have been shooting for 10 days.  So far I've taken over a thousand shots.  I have a bag full of Zeiss lenses that are great but they don't have image stabilization.  This camera has an amazing IS  that is definitely needed for hand-held tele shots.  I took pictures of iguanas from 300 yards away from a pitching canoe on the San Juan River.  The pictures are amazing.  Here's a link to a photo album on Shutterfly:  [...]Some of these are a little blurry from rain wiped off the lens (not the camera's fault).  But in general, this camera produces great results at a great price.", "Date": "December 17, 2013"}, {"Title": "Very impressive bridge camera", "Author": "Jose Quintana", "ReviewID": "R2X8ZWDVP8ZAW1", "Overall": "5.0", "Content": "I am very satisfied with this purchase. This camera far exceeds the capabilities of my previous camera (I had a HP 5MP compact camera).Anyway, I will not delve into the qualities and characteristics of this fantastic Nikon camera, but I confess to you if you want to buy a good camera bridge and have no money to buy an SLR, this camera is what you seek. The features of this camera far outweigh compact cameras and is very close to the SLRs.", "Date": "April 30, 2014"}, {"Title": "Really deserves five stars", "Author": "Shirley Smith", "ReviewID": "RTPVQAM1H6HBU", "Overall": "5.0", "Content": "If you have an interest in photography, this is the ideal camera for you. It has an excellent zoom, super clear photos and great modes and effects. Really amazing camera with a good price.", "Date": "March 11, 2014"}, {"Title": "Lot of bang for the buck", "Author": "R. Noel \"Raven-roost\"", "ReviewID": "RAEM85F9UK7R1", "Overall": "4.0", "Content": "First off, for under $140, gotta realize you're not getting a DSLR or a high zoot pro camera.  If you lower your expectations to fit the price, this is a great camera for the value. You get a high zoom, large MP's and (thankfully!) the ability to use AA batteries. Granted, it doesn't let you use manual settings and is a bit slower than some with the shutter speed, but given its cost, it's a lot of camera for the buck.  I would recommend for those ready to step up from a point-and-shooter but don't yet have the wallet or need to a true prosumer package.", "Date": "December 29, 2013"}, {"Title": "I returned it", "Author": "Sr.Kathy", "ReviewID": "R2LUR7FHZGP57E", "Overall": "2.0", "Content": "I wanted it to take sports pics at Basketball games. The delay from pressing the button to the actual pic was too long. Missed all of the action shots.", "Date": "December 18, 2013"}, {"Title": "Great camera for everyday use", "Author": "Morgan W.", "ReviewID": "R1QJTIRWYC7B8B", "Overall": "4.0", "Content": "I purchased this camera after realizing that all of the pictures I had taken over the past few years were taken with cell phone cameras and were terrible quality.  This camera takes good quality pictures, that look good when enlarged to anything below 8 X 10.  At this level the quality just barely starts to drop off.My only complaint is that the memory card slot is located in the same compartment with the batteries, which try to fall out every time I remove or replace the memory card.", "Date": "May 16, 2014"}, {"Title": "Great Camera", "Author": "Laura Cozad", "ReviewID": "R1T3L5D6TJHDAH", "Overall": "5.0", "Content": "This is a great camera.  It takes great pictures, very easy to navigate the initial set up of the camera. I would highly recommend this camera.", "Date": "May 13, 2014"}, {"Title": "Decent camera", "Author": "Justin", "ReviewID": "R2818MPTU375HJ", "Overall": "4.0", "Content": "I've been using this for about 2 months now, and here are my thoughts.The biggest problem I have with this camera is the blurriness. At first I thought it was just the view screen, because it is terribly low resolution, but its the actual pictures once downloaded.  It does fine in conditions with lots of light, but indoor and afternoon/ night photos almost always come out slightly blurry, regardless of settings. It even happens sometimes when it is set down with a timer! Very frustrating. I only paid $130 but if I had paid the full retail I would have returned it already.My next biggest complaint is the zoom. I was exstatic to find a 26X zoom on such a relatively cheap camera, but its so fast and jumpy! The shortest tap sends it about 3 or 4 times further than you would reasonably expect, and it takes a full second or two to actually start zooming once the button is pressed.Everything else about this camera is great, i spent 20 bucks on rechargeable batteries which last longer than I expected, especially since battery life seems to be the biggest complaint in reviews.Overall, I would say you definitely don't want this camera if you want to take quick, good pictures without messing with settings, but if you're on a budget and want a camera capable of taking great pictures with a bit of effort, this is the one for you!", "Date": "March 16, 2014"}, {"Title": "Nikon for great price", "Author": "corey alcorn", "ReviewID": "R3N5WGMVH2AZ89", "Overall": "5.0", "Content": "Received it very quickly after order. It was an amazing price and came with everything needed. Except sd card. But who doesn't have one of those laying around", "Date": "March 12, 2014"}, {"Title": "Great camera - love the zoom", "Author": "Lindsey", "ReviewID": "R2FOANTSU5HKLR", "Overall": "4.0", "Content": "I am not a photography expert, but I bought this camera on the advice of a friend who recommended Nikon. I love the zoom, because it allows for me to get some wildlife pictures I couldn't get with my point-and-shoot pocket camera. It's not a very quick camera, but it's quick enough for my needs. I would recommend it for someone who is travelling or birding and who is willing to carry a slightly heavier camera.", "Date": "February 12, 2014"}, {"Title": "NIKON L320 CAMERA", "Author": "james r. thomas", "ReviewID": "R26NYLW9RHZRD7", "Overall": "4.0", "Content": "A FRIEND HAS A L310 AND I TRIED IT AND DESIDED TO GET ONE FOR MYSELF, BUT LOOKING I SAW THIS MODEL AND THE PRICE WAS GREAT. I HAVEN'T USED IT YET BUT I HOPE IT WILL BE BETTER THEN THE OLDER MODEL, WITH IT'S 24X LENS AND 16 MEGAPIXELS FOCUS.", "Date": "February 10, 2014"}, {"Title": "Nikon cool pix camera", "Author": "Kristie Cintron", "ReviewID": "RHHKOKK6UWBJK", "Overall": "4.0", "Content": "The camera is as described and came quickly:) my 11 year old daughter really likes it. She enjoys taking pictures and wanted a nice camera. The only thing I would change is give batteries. I wish it came with a rechargeable battery.", "Date": "January 28, 2014"}, {"Title": "Decent camera for the price.", "Author": "C. Lombardo \"babyboomer\"", "ReviewID": "R395TV05I7JJSW", "Overall": "4.0", "Content": "I happened to pick this camera up at a local department store for a clearance price of $90.  At that price, it's a very decent camera.  The sound quality on the video is a lot better than my other point and shoot digital camera.  The pictures I took indoors with a flash were decent using full auto setting.  Haven't had a chance to use it outdoors in daylight.  It has quite a few screen settings that I am going to try as well. I will say it is slow to go from one shot to the next ( I am using a Class 10 SD card) but not any worse than other point and shoot digital cameras I have owned.  It's got a great feel to it and is pretty compact. This is a nice little camera to have as a 2nd camera to tote around here and there when you don't really need your big digital SLR and multiple lenses.", "Date": "January 4, 2014"}, {"Title": "Hate it", "Author": "Earl Stacy", "ReviewID": "R3K2RGMKKUAEM", "Overall": "1.0", "Content": "Takes regular batteries  takes way to long to take and snap pictures. And it quit working at my granddaughters birthday party", "Date": "January 2, 2014"}, {"Title": "Great Camera - Great Price", "Author": "Lori - VA", "ReviewID": "R3CDXKXOFGR6N3", "Overall": "5.0", "Content": "I received the camera last night, and have been playing around with it.  I am very pleased with the quality of the pictures.  It is a great camera for the price. I can't wait to take more pictures using all the different features.  :-)", "Date": "December 6, 2013"}, {"Title": "Nikon Coolpix L320 16.1MP - Black", "Author": "Stevie", "ReviewID": "R27K62MVBLO548", "Overall": "4.0", "Content": "I own a DSLR and love it however, I wanted something less cumbersome for everyday use. I recently bought the Nikon Coolpix L320 because of the price and reputation of Nikon. For a point and shoot camera it does a great job. My photos are clear and the color is spot on. The video feature is easy to use, picture and sound are crisp. The Coolpix L320 has easy to use features and screen modes. I would recommend this camera for everyday use or as a starter.", "Date": "December 12, 2013"}, {"Title": "Camera Defective", "Author": "Jeremiah", "ReviewID": "R3MDCAXZOKN783", "Overall": "1.0", "Content": "Great pictures and easy too use, though not much for more advanced users to in terms of more manual control. Two weeks after use the lens extended all the way out and the camera gave an error stating \"remove lens cap power off and power back on. The lens cap was not on and the camera would not turn on. Amazon paid for return shipping and issued a full refund promptly.", "Date": "February 13, 2014"}, {"Title": "Dissatisfied with the manual and the clearness of the pictures", "Author": "James P Bradley", "ReviewID": "R3LPV21EAIJ0J9", "Overall": "3.0", "Content": "It doesn't give the clear pictures that I expected and the manual for the camera doesn't give good enough explanations on how to get the best out of the camera. Very poor manual.", "Date": "January 1, 2014"}, {"Title": "It's okay", "Author": "lili", "ReviewID": "RKOAM4PE70G6A", "Overall": "4.0", "Content": "I really need an affordable camera that can zoom pretty far for my graduation, so I bought this.For $120 camera, it's not all that bad. Not so many feature like the newest Coolpic L model, but still working fine. Gets a little blurry once in a while, and when I zoom it to the max, the inside lens is shaky even when you are holding it steadily.  It can only zoom so far, when it pass the limit, it only use the inside lens, the external doesn't move anymore. You get what you pay for, won't be fair to compare this to high quality camera.", "Date": "December 17, 2013"}, {"Title": "Just okay.", "Author": "N. Paul", "ReviewID": "R17PFHMO5KZHY8", "Overall": "3.0", "Content": "I just bought this camera for my wife. I have used it a couple of times. Overall, it is a great camera for a beginner who wants pictures of the family or vacations.The first thing that I noticed was that you have to select the highest quality from the menu to get the best picture.It works really well outdoors. Indoors not so well, even with the flash, it seems to have a hard time focusing on the target.The zoom is kinda sluggish and doesn't move very fluid-like.The stabilization is not the best. I got better results by using a tripod.What did impress me was the battery life. Usually any camera that uses 'AA' batteries doesn't last long. This lasted a few long sessions.The quality of the pictures is pretty good, I would have thought better for a 16.1mp. I might have to play with the menu. They just don't seem to be as sharp as I was expecting them to be.The video seems to be pretty good as well, but only outdoors, indoors is a waste of time.It's easy to use and easy to download the pictures to the computer.Perfect for the beginner.", "Date": "December 1, 2013"}, {"Title": "Focus delay is so long you miss the picture", "Author": "Karen Cressman", "ReviewID": "RQ2JKAKHJPGQH", "Overall": "2.0", "Content": "I received this camera as a Christmas gift from a friend who purchased it at Target's Black Friday special. I have had 4 people try using it to make sure I was not shaking when I held the camera since there is no view finder, but every single one of them had blurry pictures. The delay for the camera to focus and take the picture caused me to miss every picture of my great nephews birthday party. The only pictures that were clear were still shots with no people in them. The irony is that my friends bought me this camera because they thought my Kodak Z612 was too slow. The Kodak takes far better pictures than this camera and the delay is a fraction of the time the L320 takes to shoot. Plus, you have to open the flash, it won't open on its own and the auto flash kept turning off. I read the reviews posted to determine if I got a faulty camera or it was a common problem with this model. Based on other reviews, I will be returning the Nikon L320. I don't trust exchanging it for another one. I am shocked that Nikon would make a camera so inferior. I use to think of them as the Lexus of cameras.", "Date": "January 16, 2014"}, {"Title": "student in photography class", "Author": "Jon besore", "ReviewID": "R2HIBLSXCTF283", "Overall": "5.0", "Content": "I was recently given this Camera as an early Christmas present. I absolutely love it. For someone looking for a first time camera, this would definally be the one for them. This camera works great, easy to use, and also very lightweight compared to alot of other cameras.Indefinably recommend to anyone looking for not-so expensive camera.", "Date": "December 25, 2013"}, {"Title": "Thought it was a good deal, until I started using it.  Nothing \"wrong\" with it, just not much \"right\" with it", "Author": "Image7801", "ReviewID": "R2HFDB6YSEBLE7", "Overall": "2.0", "Content": "Don't get me wrong, I LOVE Nikon cameras.  Well, SOME Nikon cameras.  I've had two Nikon D-SLR's (D40, D90) and really loved them.  My D90 is still my standard semi-pro camera and don't have any plans to replace it.  I had a Nikon Coolpix L1 that I bought in about 2008, which still works pretty well.  But, I've always turned to Canon for point and shoot cameras.  I should have stuck with that philosophy before I bought this one.  I got this camera from a national retailer on a Black Friday deal.  The price was killer and I was proud of myself for snagging the last one.  The build quality seems pretty stout, and the operations are pretty typical of Nikon's lower-end Coolpix cameras, which means they're simplistic to a fault.  I don't know if it's me needing to have more control or if I just had unrealistic expectations for this camera.  First, the good things:  1) Long zoom 2) Wide angle.  Both of these were essential when I wanted the next point and shoot.  I don't like narrow angle lenses or the ability to zoom way in to capture an image.  This camera gave me both in one package.  Now, the bad things:  1) Slow focus 2) Slow shutter (so to speak) 3) Slow image saving 4) Too much automation (to the point that I couldn't even figure out how to get a fill flash!) 5) Just overly simple.  Again, I may have had unrealistic expectations about this camera, but I was just hugely disappointed.  So, away it went and I got a new Canon SX700 (at only 3 1/2 times the price of the Nikon - Not really a fair comparison).  My advice - If you just want a wide angle, high zoom, simple camera, this will work.  But if you need more than that, stay away...", "Date": "April 14, 2014"}, {"Title": "Nice little camera", "Author": "Roger Chandler", "ReviewID": "R17FN07UO389VK", "Overall": "3.0", "Content": "I read all the reviews and did not expect a lot so,... I got what I expected, a nice little camera that does just what I needed. I take still photos of my paintings for posting on the internet and also Real Estate photos of houses. I followed the directions and most of the photos are crisp and clear.Roger Chandler[...]", "Date": "March 6, 2014"}, {"Title": "Excellent camera", "Author": "Enrique Alberto", "ReviewID": "R2FJXZLAU785MY", "Overall": "5.0", "Content": "I'm very happy  with the camera. It's espectacular.I love the zoom!!! The photo quality is very good.Perhaps it should bring a film to protect the screen. I bought one for celular and put it on.", "Date": "February 24, 2014"}, {"Title": "Fantastic Mother loving camera I love it its so saucy like omg", "Author": "TESS!!!!!!!!!!!!!", "ReviewID": "R1JBEC8PMFOG7A", "Overall": "5.0", "Content": "I chose this rating because it is really versatile, and you can do a bunch of different settings on it. I hope that someone will use this camera for good and meaningful reasons. Thank you so much for this award. It means the world to me", "Date": "February 13, 2014"}, {"Title": "perfect gift", "Author": "david davis", "ReviewID": "R3T703B1XN0UGG", "Overall": "5.0", "Content": "Bought this for a gift for my daughter.....it is a great camera and she loves it. Great Christmas present with lasting memories for her.", "Date": "January 16, 2014"}, {"Title": "A good choice!", "Author": "Victor Olivelli", "ReviewID": "R1DLNX3SECS089", "Overall": "5.0", "Content": "This camera has fulfilled my expectations! its a semi compact camera with excellent optical zoom!I recommend it for those wanting a versatil camera but very friendly!", "Date": "January 3, 2014"}, {"Title": "U get what u pay", "Author": "jose", "ReviewID": "RWHS37QANVHBT", "Overall": "5.0", "Content": "It takes good pictures just read the manual take ur time it works fine for me im amateur so no biggie I get better ill buy a better one duh!", "Date": "December 28, 2013"}, {"Title": "Great middle ground camera.", "Author": "Allison Schlupp", "ReviewID": "R2CGOM43ZK7XX6", "Overall": "5.0", "Content": "I both this camera at Target for black friday and I LOVE it. I am from NJ and it snowed yesterday and I got some great snow shots. My sister has a DLSR and obviously it is not up to that caliber but it is great for what I need it for. Not a simple point and shoot, but not a simple point and shoot either.  I am excited to use it to take pictures on vacations and of nature during all of the seasons. I own a mac and with some of the effects of iPhoto my pictures looked professional and really high quality. No, it is not small enough to be a point and shoot to fit in your pocket, but for higher quality pictures i would 100% recommend! I hope to one day own a DSLR but for right now this is great. Wish there was a viewfinder, but still great!", "Date": "December 11, 2013"}, {"Title": "Unbelievably shoddy/ broke immediately", "Author": "R. Price", "ReviewID": "R3HHEPT61USG4C", "Overall": "1.0", "Content": "Was so excited about this camera.  Immediately disappointed with the clumsy and flimsy battery/SD compartment cover.  Still, took 5 pictures, ok quality only in zoom, then camera suddenly failed, with zoom extended, no screen display.  Changed batteries TWICE.  Nothing.  It's going back and I will be getting a different camera.  So disappointed.  I've been using Nikon SLRs for over 35 years (still own and use my original one & have 4 different ones) and have never had a failure. Pure junk for this lesser model.", "Date": "January 15, 2014"}, {"Title": "Blurry shots", "Author": "Sandra Schloessmann", "ReviewID": "R1WJB9GHQG280U", "Overall": "2.0", "Content": "We did not have success in taking indoor pictures.  The pictures were extremely blurry, despite trying a variety of settings.  We purchased it at Black Friday at Target as well.  We will unfortunately return this item.", "Date": "December 25, 2013"}, {"Title": "nikon coolpix", "Author": "loretta arter", "ReviewID": "RV3HEMZCV0ZVQ", "Overall": "3.0", "Content": "was hoping for a nice clear picture. not as clear as espected.  It takes a long time to focus in before a picture can be taken.", "Date": "February 21, 2014"}, {"Title": "Have to agree. Some pictures are blurry", "Author": "Denise \"Nisy\"", "ReviewID": "R274EGDLNUCBOL", "Overall": "3.0", "Content": "I also purchased this camera from Target on Black Friday. Since then I have been playing around with the camera and I have to agree that some pictures do come out blurry. I have a point and shoot Canon A2300 and the pictures on that camera come out much clearer. I did play with the settings on this camera a bit and I personally found that on the 8 megapixels the pictures come out the best. I plan to take this camera with me on my next vacation and hopefully everything will be smooth. If not, next black Friday I wait and purchase something better.UPDATE****This camera is terrible. Went away for the weekend and all the pictures I tried to take with the zoom were all blurry. It was ridiculous. I have purchased another camera already. DO NOT BUY!!!", "Date": "December 16, 2013"}, {"Title": "Nice design and concept, poor picture quality", "Author": "Ella", "ReviewID": "R1KRIIFAHPME1G", "Overall": "2.0", "Content": "I purchased this camera on black Friday for $100 at Target as well and although the design, feel and concept is perfect- the picture quality sucks. I did not expect DSLR quality pictures but I did at least expect the pictures to look better than point and shoots or cell phone pictures. Like others have said the pictures come out extremely blurry. I also question the advertised 16.1 megapixels, the pictures tell a different story. Looks like 8 or less megapixel picture quality.Do not get caught up in the deign or feel of the camera, beyond the surface is a really poor quality camera. I can not pay even $100 for a camera that just looks good (although tempting), so this camera will be returned.Try again Nikon, you could really have a winner with us beginners if you succeed in matching quality with the design of this camera. 2 stars for size, design and zoom capability.", "Date": "January 1, 2014"}, {"Title": "Not worth it", "Author": "Crystal", "ReviewID": "RNK6J2FDUYRBV", "Overall": "1.0", "Content": "Brand new and took just one picture and it turned off, now it won't turn back on. Will return it.", "Date": "December 24, 2013"}, {"Title": "Horrible picture quality.  Avoid this camera.", "Author": "Matthew C. Raphael", "ReviewID": "R1VY9QKOK7B66H", "Overall": "1.0", "Content": "If I could give this camera no stars, I would.  Horrible picture quality.  Grainy and blurred.  Out of 20 shots, only a few were passable.  Even then, our point and shoot camera did a better job.", "Date": "December 7, 2013"}, {"Title": "Terrible would not even give to a 8 yr. old for his/her first camera", "Author": "Patricia Muir", "ReviewID": "R23S0MEZ6E3S0G", "Overall": "1.0", "Content": "Blurry pictures,  auto focus off, even setting at 880 ISO and max picture does not help.  Settings hard to set and keep", "Date": "December 10, 2013"}, {"Title": "DO NOT BUY THIS CAMERA!", "Author": "JOSEPH", "ReviewID": "RVC259XCP9BSR", "Overall": "1.0", "Content": "DO NOT BUY THIS CAMERA. The left 25% of every picture is blurry, the camera has some good features but good pictures is not one of them. Save yourself a headache and pass on this camera, and perhaps on all nikon products. Just wish I could rate it at 0 stars.", "Date": "December 6, 2013"}, {"Title": "Bought three weeks ago and love it!", "Author": "Margaret", "ReviewID": "R36CGELNJQ29PU", "Overall": "5.0", "Content": "I bought this camera a few weeks ago and took it to my family's Thanksgiving get together - I was very pleased with the pictures I got from it. For the price, it's definitely a great camera. I was thinking about going for a more expensive camera but my budget is a tad tight and I heard good things about this camera. It's super easy to use and is the perfect size. I don't have to carry around a camera case like I would if I chose a camera with a separable lens but it still takes great pictures.", "Date": "December 2, 2013"}, {"Title": "Blurry Blurry, Seems Cheaply put together.", "Author": "l.robertson", "ReviewID": "R174KCWRA8EP05", "Overall": "1.0", "Content": "Can not turn flash on and leave it on. This makes for dark pictures in some cases, blurry pictures in others. Tried all the camera \"modes\" and it did not get any better. You will get some good shots if your subject is sleeping, that is it.", "Date": "December 1, 2013"}, {"Title": "Not a very good camera", "Author": "jpdingdong \"Jon P.\"", "ReviewID": "RUJLHE9F47O8E", "Overall": "1.0", "Content": "I bought at target on Black Friday for $100 new and will be returning it shortly. Here's why:- Pictures have no warmth. They consistently look faded and washed out.- Camera feels flimsy due to the extensive use of cheap plastic.- Battery door feels like it could easily break off- Doesn't come with a rechargeable battery- When you zoom while shooting a movie, the lens motor is unbelievably loud. What was Nikon thinking? On playback this noise is  comical. - Having to manually remove the a lens cap makes taking pictures on the fly a bit of a hassleI'm really shocked that Nikon would put their name on this. Making a pretend plastic DSLR in shape only adds no value. It has a non-detachable lens mount and is too big to put in your pocket so I'm not seeing what the upside is here.", "Date": "December 2, 2013"}], "ProductInfo": {"Price": "$249.99", "Features": "High-performance NIKKOR lens\nEXPEED C2 image-processing engine\nSmart portrait system\nPet portrait mode\nOne-touch 720p HD movie recording", "Name": "Nikon Coolpix L320 16.1MP Digital Camera with 26x Optical Zoom - BLACK", "ImgURL": "http://ecx.images-amazon.com/images/I/41I1wBLg8%2BL._SX300_.jpg", "ProductID": "B00CDGQVKM"}}