{"Reviews": [{"Title": "excellent pictures", "Author": "Pila", "ReviewID": "R16A4JB7ZWJSFJ", "Overall": "5.0", "Content": "I purchased this for one of my trips to Kauai and wanted underwater pictures from snorkeling and diving trips. There was not one of these for an IPhone 5 on the Island. It came overnight and I have captured some awesome shots of sea turtles, tropical fish and coral. It has worked as well as expected and people can't believe that my photos were taken with an I Phone.", "Date": "December 19, 2013"}, {"Title": "Unbelievable! I, me,  worst photographer on the planet, took GREAT underwater pics", "Author": "Asradel \"Az\"", "ReviewID": "R72NSZVM0OUXR", "Overall": "5.0", "Content": "I bought my Watershot housing on the Big Island at Oshima's Dive Shop in Kailua-Kona about three weeks ago. I met a professional photographer on a beach there at a picnic table where he was removing his iPhone from the housing. I was fascinated by it immediately as it looked incredibly beefy- which would be the #1 requirement for anything taking my iPhone on a little submarine ride. He, the photographer who was all of maybe 27 years old, gave it a ringing endorsement. He also said that it was $100, which was doable. I had to have one! But I have the iPhone 5, so it cost me the $110 you're seeing here. I only went in twice more and took pics but even that meager usage justified the cost. One thing I will caution you about is the overheating issue that there's very little you can do about it in a watertight case. I just personally felt more comfortable removing it from the housing when I wasn't using it underwater. Probably just being paranoid but that phone got HOT. So purchase this sucker with confidence as it will give you back returns in feeling cool and like you are an Expert vacation photographer. LOTSA bragging rights come with this little gizmo.", "Date": "March 5, 2014"}, {"Title": "What an amazing housing", "Author": "G H", "ReviewID": "R3MJ2J0AOANZ9P", "Overall": "5.0", "Content": "Took this to Jamaica twice for scuba diving.  Amazing, crystal clear shots down to 60 feet so far.  Would highly recommend for anyone who dives or swims and has an iphone and wants to take underwater pictures!", "Date": "February 13, 2014"}, {"Title": "Couldn't swim without it !", "Author": "Jennifer Crocker", "ReviewID": "R2GOQC26D0Z3O5", "Overall": "5.0", "Content": "Since I got this I haven't been in the ocean, pool or lake without it. Next to my American Express card, I wouldn't leave home without it.", "Date": "August 31, 2013"}, {"Title": "Worked great.", "Author": "BigShowSJG", "ReviewID": "RV03XWFNTDJ1V", "Overall": "5.0", "Content": "I only took it to about 55' down, but it stayed water tight. Very easy to use, easy to set up, and took surprisingly great shots.", "Date": "March 4, 2014"}, {"Title": "Works Great", "Author": "diveman05", "ReviewID": "R1SFOYEH5H8378", "Overall": "5.0", "Content": "use this for work to take pictures of corals we sell.  So far everything is great, haven't tried it at depths yet but i would have no problem taking it diving with me.  Very solid construction.", "Date": "October 3, 2013"}, {"Title": "Good quality product, but...", "Author": "Ricky", "ReviewID": "R37EQLA4L8Q6RG", "Overall": "4.0", "Content": "The product appears to be of very good quality and I wanted to be able to use it.  However, I permanently keep my iPhone 5S in a slim Otterbox protective case, which is very difficult to remove and reinstall.  The Watershot housing is tight fitting to the iPhone and a phone with a protective case on it will not fit in the housing, and I therefore had to return it.  It would be nice to have an underwater housing that would accommodate a phone with a case, perhaps with multiple size spacers that could fit in the housing, for a \"one size fits all\" solution that would also work for those who do not use an iPhone case.  Therefore, I cannot comment on or review the performance of the housing, but I gave it 4 stars for the apparent quality.", "Date": "February 11, 2014"}, {"Title": "In the end, didnt work for me.", "Author": "bb99", "ReviewID": "R3F4HBMKM1NXOH", "Overall": "3.0", "Content": "I bought this as kind of a bulletproof way to shoot in the water, and it fits the bill there, no doubt.  The issue is mostly that its just not useful for anything else.  You can use any of the features of the phone inside, so no audio, no screen control etc.  only think is that you have tthese fixed waterproof buttons which forces you to move screen icons around to be able to do different things like switch on the camera etc.  makes it so that you wonder if apples next software update will render the things useless by moving things around on the interface.  Anyway, I just didnt find myself stoked to use it because of the sacrifices.  I think for somebody that is doing a lot of snorkeling and water photography, possibly this might be an option for them, but from what ive seen it wont work with ios7.", "Date": "August 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CLVLZTG"}}