{"Reviews": [{"Title": "Great camera overall.", "Author": "Student", "ReviewID": "R17I0N0INWRL2P", "Overall": "5.0", "Content": "Going from the a390 I read the specs in the upgrades which really impressed me. I need an upgrade that was affordable where I could still use all my equipment as lenses and such.The two main features I really was looking for we're megapixels which is a great jump from 14.2 to 20.1 and ISO noise reduction.A huge upgrade in my opinion is such a small feature but one of my favorite suprises in my eyes. That is when looking through the viewfinder the a390 is rather small and still has guide lines where it crops out the picture. The a58 does not crop as well as its viewfinder is much larger. It make the picture much easier to see as well as focus on small details when manul focusing.Other small features are just an additional help and great upgrades as well. HD video recording. Being able to view the picture while still looking through the viewfinder.One downfall to the a58 is that the flash mount is different than the a390 when forces me to buy a seperate flash for this camera. But that is not a problem with me for how much this camera offers for the price it's listed.I bought the camera body alone with no lenses at a low price and got great results with the camera already using the Rokinon 8mm and the 50mm f1.8.", "Date": "July 25, 2013"}, {"Title": "Heck of a deal at the price I paid", "Author": "Robert H. Schoon \"Compulsive DIYer\"", "ReviewID": "R1O5KFQADBXFXD", "Overall": "5.0", "Content": "Very happy.  Have an old Minolta 7D that I'm moving up from.  This camera kicks butt.  I think as long as you never play with the next model up, you'll be very happy for many years.", "Date": "January 18, 2014"}, {"Title": "great value", "Author": "robert ball", "ReviewID": "R2TFHWQ2HDV3KP", "Overall": "5.0", "Content": "For the price this camera is great IF you get good lenses. Vintage Minolta lenses are reasonably priced and some are outstanding.", "Date": "January 4, 2014"}], "ProductInfo": {"Price": "$529.89", "Features": "20.1MP Exmor HD APS-C CMOS Sensor, 15-Point AF with 3 Cross-Type Sensors\nTranslucent Mirror Technology, Auto Object Framing and Auto HDR\n8fps Full Resolution Continuous Shooting, SVGA OLED Tru-Finder 1,440k-Dot EVF\n2.7\" 460.8k-Dot Tilting LCD Monitor, Full HD 1080i/p Video at 60 or 24fps\nSteadyShot INSIDE Image Stabilization, ISO 100-16000 with Noise Reduction", "Name": "Sony SLTA58 20.1MP Digital SLR Camera with 2.7-Inch LCD Screen (Black Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/41X7C4E6uTL._SX300_.jpg", "ProductID": "B00CKW6ICA"}}