{"Reviews": [{"Title": "My First Move from 35mm and nice but still point and shoots", "Author": "Shanty Gray - PC Guru - Apple Novice", "ReviewID": "RBNQMC6XZNBTD", "Overall": "5.0", "Content": "I, for my last point and shoot Samsung 850F does very good job.  When I , as most read nothing, want to start shooting, charged battery full.  This package, as I priced each piece, even at this vendor, was closer to 890 with the 75-300, which I wanted this 55-250 not to have a whole between 55-75, as who really used 300mm that often as a personal.BUY THIS. If you want to take the leap, small, not heavy for what you are buying.  There is no comparison, even at 8 megapixel setting, compared to 15MP point and shoots.  I was so happy to get this small back pack instead of camera bags. I load everything in it, everything but the tripod.  I had wished as picture the tripod was not a full size, but no complaints, it is a decent one also, but will go buy a mini telescope type that will attach to the backpack. Have not setup to use the remote, but surely that will do what it says as well.You ever know how you feel when you buy something at a good price and you later say, \"I wish I would have got more\" while not needed with a camera, that is the feeling I get from this at what it was $749 or whatever at the time free shipping.  I am sure if I become a photag, I will move up over the years, but so far, this does amaze me with standard lens, how nice the marco takes pictures. We all wish we could push the lens on the subject, but still is great, a crop brings it closer even.  I WOULD RECOMMEND THIS PACKAGE TO ANYONE THAT FIRST MAKES THE MOVE TO DLSR", "Date": "January 25, 2014"}, {"Title": "Fair so far", "Author": "Richard Hoffman", "ReviewID": "R1BEXVI1827K7G", "Overall": "2.0", "Content": "The camera worked on my European Cruise for one week, the would not work. I need to get this repaired, by Canon??", "Date": "August 31, 2013"}], "ProductInfo": {"Price": "$869.95", "Features": "CANON SL1 KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties\n<1> Canon EOS Rebel SL1 Digital SLR Camera & EF-S 18-55mm IS STM Lens + <2> Canon EF-S 55-250mm II IS Lens + <3> Transcend 64GB SDXC 10 Card +\n<4> Spare LP-E12 Battery for Canon + <5> Battery Charger for LP-E12 + <6> PD 58mm (UV/CPL/ND8) Filters + <7> Vivitar 58mm UV Glass Filter +\n<8> RC-6 Shutter Remote Control + <9> PD 2.5x Tele & .45x Wide Lens + <10> PD DSLR Sling Backpack + <11> Precision Design 58\" Tripod +\n<12> PD SDHC Memory Card Reader + <13> PD 6pc Complete Cleaning Kit + <14> PD Memory Card Storage Wallet + <15> LCD Monitor Screen Protectors", "Name": "Canon EOS Rebel SL1 Digital SLR Camera & EF-S 18-55mm IS STM Lens with EF-S 55-250mm IS Lens + 64GB Card + Battery + Backpack + Tele/Wide Lenses Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51AWI9kfWrL._SY300_.jpg", "ProductID": "B00CJJ1RN4"}}