{"Reviews": [{"Title": "Awesome lens for an awesome price!", "Author": "Booyan", "ReviewID": "R3LNS9Q6IWR1B7", "Overall": "5.0", "Content": "This lens run for more than $600 in other adds but for a little over $400 I got this same lens plus the cleaning kit, rubber hood, and UV filter - what a deal.  The lens drastically improved my capabilities watching my son's football games.  I can see the look on his face while he is on the field, even from the nose bleed section in the stands.  Though I like flower hoods, they rotate with the lens during focusing which can lose its effectiveness, but the rubber hood is somewhat telescopic, but when extended it blocks that bright light from all angles regardless of  focusing because of its even-edged design.  All in all, you can't beat this price, it's a steal.", "Date": "August 31, 2013"}, {"Title": "Buy it!", "Author": "Legal Eagle", "ReviewID": "R1NBGM434DV9XK", "Overall": "5.0", "Content": "The lens is made in Japan.  The picture quality is equal to my Canon 18 - 135 mm lens which came with my Canon t4i camera, i.e., very sharp.  A tripod is not necessary with this lens.", "Date": "November 24, 2013"}, {"Title": "Excelent deal for amazing telephoto zoom lens", "Author": "Erick Alanis Villaverde", "ReviewID": "R2WUJB3BS1KNGS", "Overall": "5.0", "Content": "Although still is an expensive lens it has being really valuable, the cost compared to mortar and brick stores or other options in Amazon is really good. I have taken great pictures for long distance objects that I was not able to do it with my 18-55 mm lens for my Rebel T4i and as well as zooming objects to get more details. The stabilizer helps to take amazing pictures, I used it taking pictures in a football game and it was able to capture players moving with great details. The accessories are ok as they were included in the package.", "Date": "October 18, 2013"}, {"Title": "Great Lens at a Great Price", "Author": "Jason Landers", "ReviewID": "R1V74OAJJDHVLD", "Overall": "5.0", "Content": "I had some doubts about this lens due to the asking price.  It arrived brand new in the box will all the warranty information and a nice accessory package.  I am a photography enthusiast who also has to take A LOT of pictures at work.  I use the lens on my T2i and it works great for both my work and personal needs taking outdoor nature photos.", "Date": "September 19, 2013"}, {"Title": "Quality lens, great pictures", "Author": "Courtney Long", "ReviewID": "R1KVN5GB90LHFN", "Overall": "5.0", "Content": "I use this lens with an EOS 7D and have gotten some excellent results. The shots are clear and it works pretty well with the AF on the camera. I have only used the first stabilizer mode. With this lens I've taken some wonderful portraits at about 220mm, pictures of the moon, sunrise over the lake, and birds in flight. I did have some flare when shooting the sunrise and I don't know if that's between the UV filter and the lens, or something internal to the system of elements. Overall, this is a wonderful lens and I use it often.", "Date": "November 30, 2013"}, {"Title": "Lives up to its Reputation as \"the hidden L-Lens!\"", "Author": "hhbva", "ReviewID": "R3VD7X99G0XOZB", "Overall": "5.0", "Content": "I used this lens on a recent visit to Everglades National Park on both my full-frame (EOS 6D) and crop-frame (EOS Rebel 5Ti/700D) bodies, and the results were equally satisfying, very sharp images at all focal lengths; in fact, I had difficulty discerning any difference in sharpness between this lens and my two L-lenses (EF 24-105 mm F4L IS USM and EF 70-200 mm F4L IS USM). The primary reason I bought this particular lens was its 480 mm-equivalent reach on the EOS Rebel 5Ti, which proved more than adequate for some stunning, tack-sharp images of Blue Herons, Snowy Egrets, Anhingas and Ospreys at significant distances. I highly recommend this lens to all wildlife photographers under normal lighting conditions. I have not tested it in twilight (dawn or dusk), although I have few concerns on that score because both Canon bodies I use produce very acceptable/printable images at higher ISO settings.", "Date": "January 30, 2014"}, {"Title": "Great for soccer games", "Author": "m", "ReviewID": "R2BMZ2P7Q1B64", "Overall": "5.0", "Content": "Wanted a modestly priced lens that could capture distance shots quickly. I've been pleased with the results.  Also used it for nature shots. Find it to be a very versatile lens.", "Date": "January 25, 2014"}, {"Title": "Great Lens- Nice Kit", "Author": "Gregero", "ReviewID": "R2RYDMWPGPUNHS", "Overall": "4.0", "Content": "My wife does photography of landscapes, wildlife and race trucks along with some portrait photography. For the price, this lens excels in the first three of those categories. It's IS allows action to be stopped without blur from the photographer's shaking and the telephoto capabilities really allow her to reach out there as if she were next to the subject. It's a heavy lens and does get a little tiring to hold up, but I'm sure one can get use to it. I say it's the next best stop from an L lens which are ridiculous in price for us. Just as most reviews say, and as with most lenses of this price range, it gets a little soft at full zoom. It seems to do best at 200-250mm.", "Date": "January 23, 2014"}, {"Title": "Great bargain", "Author": "MSG", "ReviewID": "R2KW1NGHYV84PR", "Overall": "5.0", "Content": "For the price of this set, the lens performs quite well.Even at 300mm photos come out quite well, sometimes the manual focus can be quite sensitive and I've had a hard time getting proper focus without auto focus.The autofocus is relatively quick and the stabilizer works quite well and has proven very useful.It's nothing magical, but I certainly got what I paid for.", "Date": "January 22, 2014"}, {"Title": "AMAZING FOR THE PRICE!", "Author": "Mitchel W.", "ReviewID": "R1SA3BKDJ2GIP0", "Overall": "5.0", "Content": "If you're in need of a telephoto lens, don't even think twice to buy this product! It's a must have for the price! I use this to film NCAA sports and it's incredibly effective.", "Date": "January 13, 2014"}, {"Title": "70-300 Rocks!", "Author": "B. Negy Jr.", "ReviewID": "R3DJ1E0CCHE1WP", "Overall": "5.0", "Content": "It does the job! I used to use the 55-250mm but shelved that Len! Even the 70mm is sharp as well as the full zomm(300mm)!", "Date": "January 4, 2014"}, {"Title": "Great lens and price!", "Author": "ARM", "ReviewID": "R18T8S6OSR8JQH", "Overall": "5.0", "Content": "A great lens at a great price. We take photos while on travel adventures around the world so this new lens will increase our reach from our present 16-135mm f/4-5.6 IS USM telephoto zoom,  Can't wait to use it in Australia and Africa in the coming year.", "Date": "January 2, 2014"}, {"Title": "Love this lens", "Author": "Karen McCrory", "ReviewID": "R3D4LO7M5IHYLH", "Overall": "5.0", "Content": "I love this lens. Crisp and clear pictures, nice zoom and stabilizer is excellent. Did not have to use a tripod or monopod to get great pictures", "Date": "December 29, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DY94BUE"}}