{"Reviews": [{"Title": "Out performed Sony's battery", "Author": "Than Ho", "ReviewID": "R3FR0ZS242QCGE", "Overall": "5.0", "Content": "I bought these because I figured I would need at least one extra battery for my extended family trip.  I didn't expect much since the price is so cheap.  However, I had a chance to compare it to my brand new Sony's battery and it outlasted the Sony's.", "Date": "January 3, 2014"}, {"Title": "Works well and a good price", "Author": "Gadget Dude \"revlisoft\"", "ReviewID": "R19DSUDA8WVHUS", "Overall": "5.0", "Content": "I got these to go along with my Sony RX100M2.  It arrived quickly and works perfectly with my new camera.  Good, cheap and effective.", "Date": "September 12, 2013"}, {"Title": "Good value", "Author": "K. carroll", "ReviewID": "R2MSETTUJGITJQ", "Overall": "5.0", "Content": "The batteries last at least as long as the OEM.  The charger is very useful - not having to charge in the camera is a bonus.The seller shipped very quickly.  Two batteries AND a charger for less than the price of a single OEM battery, good deal!", "Date": "May 10, 2014"}, {"Title": "So far, so good.", "Author": "finnfam", "ReviewID": "R35RZ0DJ5BEALH", "Overall": "5.0", "Content": "The charger is compact, and charged the 2 included batteries in addition to my original Sony battery in a little over one hour each.  I like the small size of the charger and the folding prongs which will make it easy to transport.  The batteries appear to be well made and in initial tests, seem to have longevity similar to the OEM Sony battery.  I haven't tried the car charger, but I assume it will work fine.  Initial impression: a good value for the money.  Time will tell on durability.", "Date": "March 7, 2014"}, {"Title": "Halcyon 1800mAH Replacement Battery", "Author": "Francis Wong", "ReviewID": "R2Q86ZNWZ80IJ0", "Overall": "5.0", "Content": "I bought this when it states the cells are from Japan. From the packaging, it looks like made in China. Anyway when I charged it full to use on the Sony RX100 which I bought used without batteries I noticed that this battery can easily last half a day with about a hundred shots and with the LCD on the camera screen on. Quite impressive as compared to other 3rd party brands which boost high mAH but can only run for a short time. Worth to invest on especially at only a fraction of  the original price.", "Date": "February 28, 2014"}, {"Title": "Great for the price", "Author": "Ricardo R.", "ReviewID": "RPNI1OOR9XZ2W", "Overall": "5.0", "Content": "I have used one battery of the two and it has performed great. Charges quickly and lasts the same or even a little longer than the Sony battery.", "Date": "February 20, 2014"}, {"Title": "Quick delivery!", "Author": "AKS", "ReviewID": "R35S05I5PT1MYL", "Overall": "5.0", "Content": "Batteries and charger worked as described and quick delivery.  Charged both batteries and used them both for an all day photo trip.", "Date": "January 18, 2014"}, {"Title": "SPARE Sony Action Cam Batteries", "Author": "Billy Yee \"cyrus D. virus\"", "ReviewID": "RJOJFIIDEZJMA", "Overall": "5.0", "Content": "EXACT FIT!  Outlasting the OEM SONY battery by at least 30 mins.  Having 3 batteries is a must for LOSG trips without the charger and if you have a 32 or higher GIG card in the Action Cam.  aven at HD video, over 4 hours....takes 2 batteries.  Price So cheap! Product works on Sony Action Cam 30!!  The recharger with Car adapter is a Definately PLUS!!  CHarging battery while driving to or from, without comprimise.", "Date": "January 18, 2014"}, {"Title": "Great product for the price! I highly recommend!", "Author": "WINKY", "ReviewID": "R2ZQDTVG44XG46", "Overall": "5.0", "Content": "This is a great product for the price! I needed an extra charger and batteries. This package is as good as the original equipment supplied with my camera. I highly recommend!", "Date": "December 12, 2013"}, {"Title": "Worry free", "Author": "Nana", "ReviewID": "R29VH0XYRSR0LH", "Overall": "5.0", "Content": "These batteries were so reasonable I was quick to order them as our backups. I've been caught in photo situations and remorseful when the battery went dead - usually at the worst moments. With the arrival of our 2 grandchildren, my husband and I each have 2 backups now! Shipping was efficient - packed well and arrived quickly.", "Date": "September 29, 2013"}, {"Title": "Excellent product - I think", "Author": "Harry Puncec", "ReviewID": "R1QG0ABVDYMXFH", "Overall": "4.0", "Content": "How do you judge a battery?  I received these in the mail, plugged them in, and they recharged fully.  So far so good.  They seem to be working fine in my Sony RX100 camera and that too is good.  The key is how long they hold a charge under normal use and in all conditions, and I won't know that for a long time.  If I think of it down the road I may return here and change my rating up or down.  Stay tuned ...", "Date": "February 27, 2014"}, {"Title": "Price is great, however", "Author": "dan", "ReviewID": "R3SQA83DPWT59S", "Overall": "4.0", "Content": "I'm afraid I was over zealous in the purchase of these as I thought they would fit my Sony AS-15HD unfortunately they were the wrong size.  And the fault was 100% mine for not checking the battery codes better. I'm hoping someone I know can use them as it isn't worth it to me to return them. But I was able to have a laugh at my own expense so that in itself is cheap entertainment!I did charge them up using 110AC and both batteries took a charge in approximately the same amount of time.Cheers,", "Date": "February 10, 2014"}, {"Title": "Must have accessory for Sony RX100 camera", "Author": "Timothy M. Welter \"Tim Welter\"", "ReviewID": "RVMIU6A9RO1SA", "Overall": "5.0", "Content": "A must have addition to the Sony RX100. The external charger is very handy. The spare batteries work well and it is so nice to be able to charge the batteries while using the camera. For some reason the camera doesent give much advance notice that tha battery is low. It just shuts down. A spare battery can save the day. Also I think the price is very reasonable.", "Date": "June 7, 2014"}, {"Title": "Excellent performance for the price", "Author": "Larry Krainson", "ReviewID": "RZGEPXNKPOFIP", "Overall": "5.0", "Content": "Great battery performance, small ac and dc charger at a great price point. I've gotten longer life out of each of these than the Sony battery that came with the camera. They are an excellent replacement/spare.", "Date": "June 2, 2014"}, {"Title": "Smoking bargain", "Author": "Scott", "ReviewID": "R1E5J2MZ7UO4A", "Overall": "5.0", "Content": "Got these for a trip to Scotland. The charger is easier to use than the one that came with my camera, and these batteries have longer life than the stock one.", "Date": "April 28, 2014"}, {"Title": "Affordable but performs great!", "Author": "H. Do \"Lens Craze\"", "ReviewID": "R15VHW7R5M74F0", "Overall": "5.0", "Content": "Glad I bought these. They work as well as the OEM one. Costs a fraction of the OEM. Wall charger is great. Now I can shoot while my spare battery is charging.", "Date": "April 23, 2014"}, {"Title": "Long Lasting", "Author": "Suzi", "ReviewID": "R3CE15F696WU3D", "Overall": "5.0", "Content": "I, for the longest time, couldn't figure out how to charge the batteries. Normally for a Sony battery charger that comes with the purchase, you'd place the battery with the letters like E D or K facing the front. Whereas, this Halcyon charger makes you face the battery *front* faced towards the inside.I didn't know that for a really really long time. I had three batteries that I'd switch off on and I thought the batteries were getting charged the whole time.So when it FINALLY died on me during a trip, I face desked myself real hard & I found out I haven't been charging any of them...ever. But they worked for what seemed like forever.", "Date": "April 15, 2014"}, {"Title": "Charger and extra batteries", "Author": "M. E. Moore", "ReviewID": "R1Y7T1Y377RACO", "Overall": "5.0", "Content": "This is a nice product group. A charger external of the camera and extra batteries is necessary when traveling. It's an economical package and a great value.", "Date": "April 14, 2014"}, {"Title": "A must have item...", "Author": "ToddColorado", "ReviewID": "R1H3WKCESVDVSQ", "Overall": "5.0", "Content": "This is a must-have item for Sony owners using cameras with \"X Type\" batteries {Sony NP-BX1 Lithium Ion} that want to have 'extra' batteries charged and at the ready.  The Halcyon replacement batteries are 1800mAh {3.6V} -vs- the Sony @ 1240mAh, so they last even longer in the field on a full charge. I'm using with the RX100 II, and they work perfectly.Only complaint was that the Charger Kit came without any instructions of any kind and it took me awhile to make sure I was loading the batteries correctly into to charger. Call me crazy, but unless you look very carefully at where the battery 'contacts' line-up with the charger 'probes' you won't get any AC charging. Problem solved.", "Date": "April 6, 2014"}, {"Title": "Disappointing", "Author": "Amazon Customer", "ReviewID": "RRXY6X6832G", "Overall": "1.0", "Content": "The mechanism that holds the battery in placedfailed almost immediately. I sent the charger backto Amazon. To say I \"hated\" it as the one star ratingindicates is misleading. It just failed to work, so Ireturned it.", "Date": "March 6, 2014"}, {"Title": "The charger is fine , however the batteries are not", "Author": "John Garwood \"RFT John\"", "ReviewID": "R2BNNNLIF2IAP8", "Overall": "2.0", "Content": "The charger worked fine but is brand new !  The batteries capacity does not seem to be as advertised. The life when used as compared to the battery that came with my camera is far less. Its still not a bad deal just not anything to get excited about.", "Date": "January 27, 2014"}], "ProductInfo": {"Price": "$15.99", "Features": "Package Includes: 2 Halcyon Brand Battery & 1 Halcyon Brand Wall & Car Rapid Charger\nBattery Specs: 1800 mAh with Premium Japanese Cells\nHalcyon Support: Includes 5 Year Halcyon Replacement Warranty. Full Membership Access to Halcyon Customer Support Website\nFrustration Free Packaging. No wasteful and dangerous plastic blister packs.\nCompatible with all cameras which take Sony NP-BX1 Batteries", "Name": "Two Halcyon 1800 mAH Lithium Ion Replacement Battery and Charger Kit for Sony Cyber-shot DSC-RX100 II Digital Camera and Sony NP-BX1", "ImgURL": "http://ecx.images-amazon.com/images/I/51dGFfdwALL._SY300_.jpg", "ProductID": "B00DP3H88G"}}