{"Reviews": [{"Title": "Everything you need in one package.", "Author": "The Hobbyist", "ReviewID": "R2D9P20274GYCS", "Overall": "5.0", "Content": "The Canon as you would expect, performs flawlessly. I'm not a pro photographer, so i'll leave the geek terms to those guys, but the clarity of pics under all conditions is startling to me. It's much easier to take a good picture with this camera, than it is to take a bad one. Partly due to the same autofocus sensor used in the EOS 7D.The photo sensor has an extra chip built into it that provides auto focus at every single pixel. Which in laymans terms means that the video capture on this is excellent, also under all conditions.The ISO settings (pretty much the range of light the camera needs to take a detailed pic) go from 100-12,800, expandable to 25,600. At 12,800 you can take night shots with just street lighting.But what really sold this camera for me, were the ergonomics. That's what put this camera heads and shoulders above the Nikon D7100, which was the other camera i'd narrowed my selections down to. And the fact that it has Canon's new DIGIC 5+ image processor, was icing on the cake. (built in wifi, too)As I mentioned, i'd narrowed down my choices between this camera and the Nikon D7100. But worth noting is that Nikon eliminated the anti-aliasing feature because it allows for a slight improvement in accuracy. But the very first photo I took with the D7100 I looked at, was distorted by aliasing. And aliasing is sort of like a screen door mesh effect that can wind up in photos of things like a parkway background with trees.This supposedly is rare, but considering it happened on the very first shot I took with the camera, it was just one more check mark on the Canon side.Speaking of the ergonomics though, this camera more so than any other camera I picked up, felt like it belonged in my hands, even though it's a little bit smaller than the 60D, and i've got fairly big hands. It just has a better sense of balance, even with a big lens attached.Add to that the small lcd screen on top of the camera just behind the shutter button, where you can adjust multiple settings including auto focus and ISO settings.If I was going to make one single statement about this camera's ergonomics, it's that everything is right where it seems that it should be, and you can make just about every adjustment with dedicated buttons, instead of having to scroll endlessly through menus.For a non-professional like myself, this is the perfect camera. The auto focus system is so good, in both still shot and video, that I can use it liberally while I learn the manual functions.One final comment: I spent a lot of time on camera selection, as well as which vendor to go with. Cameta has a very high rating on Amazon, so I decided to go with them, and i'm glad I did.Everything was superbly wrapped, and the box contains everything under the sun in this kit, including camera body, two lenses, case, flash, tripod, memory card, battery, usb cable, filters, sd adapter, and a lens care kit,  and of course the biggy always being the U.S. warranty cards for lenses and camera body. No grey market goods here folks!", "Date": "December 27, 2013"}], "ProductInfo": {"Price": "$1,499.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon EOS 70D Digital SLR Camera & EF-S 18-55mm IS STM Lens + <2> Canon EF-S 55-250mm II IS Lens + <3> Transcend 64GB SDXC 10 Card +\n<4> Spare LP-E6 Battery + <5> RC-6 Shutter Remote Control + <6> Precision Design DSLR300 Flash + <7> Precision Design 58\" Tripod +\n<8> PD Digital SLR Camera Case + <9> 58mm UV Filter + <10> Additional 58mm UV Filter + <11> PD HDMI to Mini-HDMI Cable +\n<12> PD SDHC Memory Card Reader + <13> PD 6pc Complete Cleaning Kit + <14> LCD Screen Protectors + <15> PD Memory Card Storage Wallet", "Name": "Canon EOS 70D Digital SLR Camera & EF-S 18-55mm IS STM Lens with 55-250mm Lens + 64GB Card + Battery + Case + Filters + Flash + Tripod + Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51s%2BFmoiRYL._SY300_.jpg", "ProductID": "B00DWHVMRS"}}