{"Reviews": [{"Title": "Great Deal!", "Author": "LB222", "ReviewID": "R32QWC7HT38KLB", "Overall": "5.0", "Content": "I was a little nervous to buy this particular one since it said \"import\" and was so much cheaper than at the store, but it works wonderful and I can't tell any difference from the one my girlfriend bought at Best Buy!", "Date": "November 19, 2013"}, {"Title": "Great lens, okay extras", "Author": "Biblia Fyle", "ReviewID": "R36UFX8YRC6PW5", "Overall": "5.0", "Content": "Lens works great! The extras have all worked very well, except for the lens keeper, which has already fallen off.", "Date": "November 15, 2013"}, {"Title": "Amazing Price.... Much Lower than Anywhere Else!", "Author": "Jerry", "ReviewID": "R10TQ8T0WHCBIC", "Overall": "5.0", "Content": "Love my additional camera lens and accessories. The price can't be beat and the 55-250mm lens allows me to capture images like a pro. Thanks Amazon for providing me with the best possible deal PERIOD!", "Date": "August 21, 2013"}, {"Title": "inexpensive, responsive and light", "Author": "Bike Commuter", "ReviewID": "R33DRG098M6GT7", "Overall": "4.0", "Content": "Wanted a lens to supplement my 135mm canon.  This is what I could afford.  It is light and focus seems to be quick enough to catch a bird in flight.Works well with my 40D", "Date": "April 9, 2014"}, {"Title": "GOOD PRODUCT", "Author": "Ulises", "ReviewID": "R3L9G84WJ6GHLZ", "Overall": "5.0", "Content": "THE LENS IS WONDERFULL! IS COMPATIBLE WITH MY CANNON 7D, VERY HEAVY, YOU SHOULD BE STRONGER FOR USE MANY TIME WITH THIS LENS.", "Date": "June 7, 2014"}, {"Title": "Gift for my wife & she loves it!", "Author": "Kyle A Jones", "ReviewID": "R2PRCGKQ6OLUZ7", "Overall": "4.0", "Content": "Everything was as advertised. Wife has been utilizing everything in the pack sense receiving. She loves the new lens and it takes great photos from a distance. Haven't had any problems with quality.I would recommend to any amateur photographer.", "Date": "June 4, 2014"}, {"Title": "Like this product!", "Author": "Josue Sotoj", "ReviewID": "R32Z1GL002TEMJ", "Overall": "5.0", "Content": "Not so good under poor light situations, to be honest, you need to test it under different lights conditions so you can know it's limitations. Something i like about the lens, is the image stabilizer, cause it really helps. In conclusion it's a great product for that price!!  I'm happy with it!  I would definitely recommend it.", "Date": "May 16, 2014"}, {"Title": "Great Deal", "Author": "Haley", "ReviewID": "R2XWE521NMQIO4", "Overall": "5.0", "Content": "Fantastic lens for the price. It's well made, we use it for sports photography (race cars) and it works flawlessly.", "Date": "May 9, 2014"}, {"Title": "Very Good Product", "Author": "Heidi L. Gergurich", "ReviewID": "R2SYROFOGMOGPI", "Overall": "4.0", "Content": "I love the lens it works great, all the accessories are a super addition to your camera.  The lens hood works really well, I also have a hard flower lens hood and every time you zoom out you can see it through the viewfinder, so I love this one, because you do not see it at all.  The only reason I did not give 5 stars is the photo depicting the lens bag is not the one you get,  but the description is correct, it's just a drawstring bag.  I would recommend this product to anyone; it has been a great addition to my camera.", "Date": "May 8, 2014"}, {"Title": "Canno EF-S 55-250mm and stuff", "Author": "N. Abdallah", "ReviewID": "R3VTI25UREHQ98", "Overall": "5.0", "Content": "I was looking for a telephoto that had the stabilization and auto focus feature for my Canon Rebel T3i.I had just purchased my camera and it came with the standard lens of 18mm-55mm. Which is a great lens for pictures that I can get pretty close to. But I needed something that if I was out in nature, I could get some decent shots with a zoom. Not one to want to disturb nature doing its thing.This lens for the price is perfect, a little noisy when using the auto focus, but that is a huge lens its trying to work with.The price was perfect. I also bought the 2 year year protection plan.The squeezey bulb air cleaner is awesome. Love the rubber hood. Nice to have an extra set of filters. Now I have enough for both lenses. The cleaner brush is 'eh, i would rather use the bulb and a cleaning cloth, (one comes with this kit too). Extra lens keeper too!!If your looking for a canon lens with auto focus and stabilization feature at a decent price. Get this one. You won't be disappointed.", "Date": "April 28, 2014"}, {"Title": "Excellent product and accessories", "Author": "Regina M. Robinson", "ReviewID": "RK6DLSQPQGSOV", "Overall": "5.0", "Content": "I received these products and immediately started using the zoom.  It does a great job and although I haven't begun using the other items, I am impressed by the quality of everything.", "Date": "April 27, 2014"}, {"Title": "Excellent deal", "Author": "John", "ReviewID": "R305EGHHGA3VON", "Overall": "5.0", "Content": "Well worth the price, no problems, works better than I thought. I wasn't sure about the lense because it didn't come fromCanon Live and learn.", "Date": "April 15, 2014"}, {"Title": "Used the lens and it works well", "Author": "Ray Hess", "ReviewID": "R9X47D1O2L1WB", "Overall": "5.0", "Content": "I'm not much of a photographer so a wanted a decent telephoto for my canon rebel with autofocus, no issues, and as inexpensive as this type of lens could be.  This one fit the bill and I've been happy with it so far.  It has worked fine.  I bought the package deal because it was the same price as the lens alone.  I like the cap holder, the soft case and use the rubber lens shade (wrong name).  I have not tried any of the other pieces so I cannot comment on them.  Overall, I'm very satisfied and would buy again.  However, not being a true photographer I cannot really comment on the lens itself other than it works for what I wanted.", "Date": "April 7, 2014"}, {"Title": "Love my lens!", "Author": "kurt", "ReviewID": "R103D4G5FIIBWE", "Overall": "5.0", "Content": "Very happy with this lens!! Lives up to my expectations! Love it. Would highly recommend it. If you don't have it...Get it!", "Date": "April 4, 2014"}, {"Title": "Great Lens", "Author": "E. E. Osmann", "ReviewID": "R1TA40HRJNYCXE", "Overall": "5.0", "Content": "For the price, this lens is worth every cent.  I prefer the quality of the pictures taken with this lens over the stock 14-45mm lens that came with the camera when it was purchased with a lens.  Worth the money for a f4 lens.", "Date": "April 1, 2014"}, {"Title": "Good Lens for the price!!", "Author": "JL Feth", "ReviewID": "R1AH61OA6NT565", "Overall": "4.0", "Content": "I have used this lens briefly.as I just bought it about 6 weeks ago.So far it has been what I was wanting to do.Good price!!", "Date": "March 17, 2014"}, {"Title": "Loved it.", "Author": "KMM", "ReviewID": "RAQM8ZFDZVYLS", "Overall": "5.0", "Content": "It came earlier than expected. It works great. Love the price.  Great bang for your buck. I am so excited to have this lense.", "Date": "March 11, 2014"}, {"Title": "Worked Great for Me", "Author": "Kevin M", "ReviewID": "R1GLE7M7PV00TD", "Overall": "5.0", "Content": "I'm not a photography expert, but this worked great for me.  I was concerned buying an non-warrantied version would be a problem without a warranty etc.. but after almost a year the lens has been flawless for me.  The bundle stuff looks great but is mostly junk which we eventually threw away.", "Date": "March 11, 2014"}, {"Title": "Everything as expected", "Author": "lenhinger", "ReviewID": "R1U63JHOWHC6GZ", "Overall": "5.0", "Content": "The lens works great. Good quality photos. The only negative is the cord to attach the lens cap that quickly took off, a shame. But definitely worth buying the kit.", "Date": "March 2, 2014"}, {"Title": "buy this lens", "Author": "Tim", "ReviewID": "RM0IOXLB59KT7", "Overall": "5.0", "Content": "amazing product for the price. honestly the cpl and fld filters arent really useful but im using the uv filter as a protector for the lens.", "Date": "February 16, 2014"}, {"Title": "Great deal!", "Author": "Nonchalante", "ReviewID": "RLX2QA1BEDEHJ", "Overall": "5.0", "Content": "The delivery was super prompt.  And the product was even better than I thought. A great buy when we got all the accessories for the same price others offered for the lens alone.", "Date": "January 19, 2014"}, {"Title": "great buy", "Author": "Michael Croom", "ReviewID": "R1OXDBZI9J6B9U", "Overall": "5.0", "Content": "i finally got my lens and loving it, ready to get out and do a lot more shot with this lens!!!", "Date": "January 10, 2014"}, {"Title": "Great value", "Author": "jt", "ReviewID": "RRLCEYCPREKF7", "Overall": "5.0", "Content": "I was suspect of purchasing this, I think the (Import) part of it was making me somewhat suspicious.  What I received was a lens that appears to be identical to the Canon lens that costs $100 + more.  I have compared the product with a friends lens and I can't see any difference in them.  While I haven't used it much yet, so far it appears to work fine.If you are planning on purchasing the 55-250mm lens, I would recommend this.", "Date": "January 5, 2014"}, {"Title": "perfect christmas present for my friend.", "Author": "MONTYHADES", "ReviewID": "R3CH267Y5ODNI4", "Overall": "5.0", "Content": "I was not that sure after reading one review, but then it only had few, which one said that even for an import item it was very good, so I went for it and got it, first of all, I don't own  camera, but my friend does, and she is been wanting one lens, at the regular electronic stores those lens are very expensive, so looking at a price like this and the one at the store, well, just scary to think what I will get, but having in my hands and borrowing one from a friend, they are actually the same and mine costed half his, so anyway, my friend was very happy with her new lens, so if you are thinking in getting it, you will love it..", "Date": "January 2, 2014"}, {"Title": "this made me fall in love with my camera again", "Author": "n8k", "ReviewID": "R3BYWH5CKPTJDR", "Overall": "5.0", "Content": "I had a 18-135mm kit lens and frankly I was unimpressed because the shots I was taking with it could be taken with a smart phone. This lens gives me something that has a zoom that allows me to take awe inspiring shots that are sharp as a tack. Now, I'm just an amateur so I'm sure there are better lenses out there, but for the money, you cannot go wrong with this lens. It's amazing what you can capture with this lens. You will definitely impress friends and family with this lens. I was a bit cautious about the \"Import\" tag but I can't tell any difference between the non-imported version. Granted I haven't had the opportunity to compare it face to face, but judging by the images in other Amazon listings this is the same thing. Highly recommended! I repeat, you cannot go wrong with this lens.", "Date": "May 4, 2014"}, {"Title": "Good value and service", "Author": "Story Teller", "ReviewID": "R33M396FIJCNAE", "Overall": "5.0", "Content": "The lens works excellently, the combination of accessories is very helpful. I particularly like the lens bag and cover.  A great value.  It was well packaged and arrived on time and in good shape.", "Date": "January 15, 2014"}], "ProductInfo": {"Price": "$329.99", "Features": "This kit includes 11 items, Lens includes manufacturer's supplied accessories, All items are backed with Hot Deals Electronics 1 year 100% Satisfaction Guarantee\nCanon EF-S 55-250mm f/4.0-5.6 IS II Telephoto Zoom Lens for Canon Digital SLR Cameras (import, backed by Hot Deals Electronics 1 year guarantee)\nUV (Ultraviolet) Protection Filter - CPL (Circular Polarizer) Filter - FL-D (Fluorescent) Filter - Filter Case - Soft Rubber Lens Hood\nPull String Closer Neoprene Soft Lens Pouch with Clip & Belt Loop - High Quality 2 in 1 Lens Cleaning Pen\nHigh Quality Dust Cleaner Blower - Universal Lens Cap Keeper - HeroFiber® Ultra Gentle Cleaning Cloth (the most effective way to clean all optical surfaces)", "Name": "Canon EF-S 55-250mm f/4.0-5.6 IS II Telephoto Zoom Lens (Import) for Canon EOS 7D, 60D, EOS Rebel SL1, T1i, T2i, T3, T3i, T4i, T5i, XS, XSi, XT, & XTi Digital SLR Cameras + 10pc Bundle Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51gjK0lhG%2BL._SY300_.jpg", "ProductID": "B00DOI8ZAW"}}