{"Reviews": [{"Title": "Canon 70D First Impressions", "Author": "S. Burg", "ReviewID": "R3HGVPZ5IEWOI3", "Overall": "5.0", "Content": "This is going to be short, since I've not had the chance to do a whole lot of shooting as yet. Consider it a \"just out of the box\" impression. I already have a Canon 5D Mk III, and a number of L series lenses. I wanted a \"backup camera\" for video shooting, and I was intrigued by the new auto-focus system offered on the 70D.So far, I'm extremely pleased with this camera. The 18-35 mm kit lens gives a lot of range, and I tested the camera out with my other lenses. The L series lenses work very well, and auto-focusing is fast, smooth, and doesn't search around much even in very low light. The camera is not as heavy as the 5D Mk III, but feels solid enough, and not all that different in the hands. Even with the 70-300mm f4-5.6L IS USM zoom - my heaviest lens at the moment - the camera feels surprisingly balanced.The crop sensor obviously changes the effect of the lenses, but having a full sensor and a crop sensor both, it's like having 2 sets of lenses. My 70-300mm zoom now has an effective reach up to 480 mm (on the Canon 70D) due to the crop factor of 1.6. To me, this is kind of a bonus, though not in itself a reason to buy the camera. Smaller sized sensors result in an apparent increase in focal length, and a greater depth of field, but this is a generalization and each lens has its own properties that affect the image as well. Read the reviews of individual lenses when considering how each one reacts to different types of camera bodies.The main thing to take note of is that while the Canon 70D will accept all the EF and EF-L lenses, it is designed to use the EF-S series lenses as well. In fact, the EF-S series lenses are custom tailored specifically for the Canon 70D and (as far as I know) other APS-C crop sensor cameras made by Canon. These lenses - and the kit lens is one of them - will not work on a full frame camera like the Canon 5D mkIII; the rear element extends back into the camera body in a way that makes it impossible to attach lenses of this series to full frame sensor cameras. Even if they could be attached, I suspect the captured image might suffer from serious vignetting and other problems.For a thorough understanding of how the APS-C, full frame and other types of sensors interact with various lenses, I highly recommend doing some research on the web. There's a lot of good information out there, and this is a fairly involved subject that I don't even want to attempt to dive into here :)One thing I couldn't figure out before having the camera in my possession deserves a mention. This is my first experience with a fold-out LCD screen on a DSLR, and I had no idea how the display would deal with flipping around 180 degrees. Would it be upside down? This was the first thing I tried, and the screen auto-flips when it is rotated. Maybe everyone else already knows this - but I didn't! Anyway, the fold-out display is a great feature, and it also folds face-in to protect the display when not in use.The ability to touch various points on the LCD display while in Live View or shooting video, and shift focus while shooting is - to me at least - worth the price of admission. If Canon eventually updates the 7D and/or the 5D Mk III, this functionality would be most welcome!Purely as a \"gut reaction\" - I really like the 70D immensely. And it seems a very good value for the price. This may actually become my preferred \"walk-around camera, though time will tell.EDIT - 10/22/2013: I've spent a lot more time with the camera now, so I can add to my earlier comments.While I purchased the 70D mainly for shooting video, I recently used it to shoot bracketed exposures for HDR (high dynamic range) panoramas. A friend of mine had a nodal camera head (The \"Ninja\" head) which allowed for precise rotation of the camera to cover a full 360 degree field-of-view. The Canon 70D allows for up to 7 bracketed exposures via the AEB controls. The plates were shot in the RAW (CR2) format, using the kit lens, and stitched together using PTGui software.After some initial trial runs, where we ironed out the kinks in the whole process, the results were exceptional. For those who may be wondering \"why do you want a 32 bit HDR 360 panorama at 10k-16k resolution?\" it is used to create realistic lighting and reflections in a 3D/CG software (i.e. Modo or Maya, for example). The 3D scene can be lit entirely by the 360 panoramic image, producing a very convincing result.At any rate, the Canon 70D delivered terrific results doing something I didn't even foresee when I bought the camera. I will try and upload some of the tests (where the photographic panorama serves as both background and light-source) if I can figure out how to do so on the Amazon site.EDIT - 11/9/2013: A note to anyone who intends to shoot green screen (for color keyed composites) or do precise color grading in post production: The video output from the 70D is not YCbCr 4:2:2 compression. This is not apparent to the naked eye when viewing the video footage, but it becomes an issue when attempting to work with the footage in a post environment. The firmware update for the Canon 5D addressed this problem by enabling 4:2:2 color output via the HDMI port to an external recording device (I use the Atomos Ninja 2 for this) but currently uncompressed \"clean\" HDMI is not enabled on the Canon 70D. I have my fingers crossed this will be dealt with in an update to the firmware.This is not a huge issue unless you intend to do extensive manipulation of your video footage in post production, but it is something to consider with this camera and DSLRs in general. There are workarounds, of course, but that can entail a fair amount of time & effort, particularly when extracting color key mattes (masks) involving fine edge detail or areas of transparency.That being said, the footage is nevertheless beautiful. And I suspect this technical point should not be an issue for most people considering buying the Canon 70D. The CR2 (camera raw) files are not at all affected by this, it's a factor limited to the HD video.", "Date": "August 30, 2013"}, {"Title": "Nice update to an already strong predecessor for semi-pro photographers...video functionality is unreal", "Author": "Josh Webb", "ReviewID": "R23Y8VS8GR4T83", "Overall": "4.0", "Content": "Background info on my experience/use: semi pro portrait/event photographer, professional landscape photographer. Cameras past and present: canon 5D mark III, Canon 7D (owned currently), Leica M3 35mm film, Canon 60D, And Canon t3iThe nitty gritty on this camera after a week of use:Build/functionality-Its a solid update to the popular 60d dslr. Smaller profile than its predecessor however the grip and feel of the camera still remains solid.  And much more girth than its younger siblings in the Rebel series.  The redesign of button locations on the rear of the camera make for a fluid interface to the menus screens while maintaining the appeal that higher quality SLRs have had with dedicate Aperature and Shutter speed wheels.  The added perk of the New touch screen technology from the T4i and T5i have greatly improved the speed to many obscure functions sometimes needed in the depths of software.  Its actually pretty fantastic to say the least.Photo Quality-With the addition of the newer Digic 5+ processor the picture quality is only gradually enhanced from the previous Digic 4 of the older generations and 60D. What you will notice a difference in is the rate at which photos can be shot and processed. 7 fps puts this camera closer to the 7D in respects of action photography.  I did have high hopes for better low light photos with a new processor since the 60D essentially used a 4 year old unit but unfortunately they look almost identical.  It seems you will need to step into a full frame like the 6d or the 5D mark ii & iii to get a substantial difference in quality above 1600 ISO that only a larger sensor can provide.Video Quality-What really sets this camera apart from the rest of the line up(except the 5D mark III) is its incredible ability to process video (and with touch screen focus!!!)  Its active autofocus tracks well with lenses.  Multiple modes allow you to change focus settings quickly thru simple strokes on the screen.  This camera has built in stereo recording unlike the mono of the 60D.  It does however lack a good amount of creative features within the camera for video recording. But lets me honest, most of us who do photography and cinematography often do all of our editing from computer software outside of the camera ie lightroom/photoshop etc.  With the STM lenses its fairly quick in its focusing and extremely quiet since they were design specifically for camera bodies like the 70D, t4i, and t5i in a video application.  Most of my lenses are USM or L series which make for much quicker focusing than even the STM but do sacrifice a bit of more noise (still much better than the cheap kit lens tho).Overall this camera is a solid performer.  It is a jack of all trades.  Photos to video, it does a dang decent job on it all with a big emphasis on the video side of things.  In short.  If you need an all around camera this is it.  If you need a camera for only still photography you may be better off buying a 7D or full frame camera for the money even tho it does do a \"pretty good\" job much like the original 60D. Either way you cant lose.  I promise.********To anyone using Lightroom 4.4 or lower this camera is not compatible with the CR2 aka RAW files for editing.  If you shoot RAW you will need to buy the new Adobe Lightroom 5 and update it to the 5.2 version to even get it to view.  Anyone shooting in jpeg will be fine.", "Date": "September 6, 2013"}, {"Title": "Excellent Value", "Author": "Michael DiDomenico", "ReviewID": "R1GN5OJHZ992XQ", "Overall": "5.0", "Content": "I just received my new CANON 70D a week ago. I have been reading every review that has come available on the Internet and also You-tube. I have also talked to a few Professionals who use CANON equipment to get their view. I will not bore you with all of my talk, but I will give you some things that I have found out since receiving my unit.AUTO FOCUSThis is a huge jump from my 60D. It has the 7D - 19 point AF and all cross point. It makes for a fast AF and cleaner photo's. I am amazed at how many more AF points lock onto a subject when using the auto focus sequence.DUAL PIXEL, LIVE VIEWI would think these go hand in hand, and they work quickly and well. The camera is quick to focus, acquires moving subjects and allows for great photo's. Very impressive upgrade from the LIVE VIEW on my 60D.VIDEOI shot a video today while at the zoo and the clarity was excellent, so was the color saturation. Full HD is by default and it is excellent for what I will use it for when traveling. I also was not using one of the new STM lenses and when zooming in and out, there wasn't any noise on the video. I was not using an external mic.I have tried all of the scene modes and found them to be a good selection. I like the HDR mode and also the multiple photo mode, something I guess people have been interested in seeing from CANON. I have been very impressed with the camera. It is a good upgrade from the 60D, it has much more to offer and the higher PIXEL Count shows up in the photo's, as does the increased FPM. 7 FPM seems so much faster than the 5.3 of the 60D.I have already recommended this to a couple of my friends who are looking into upgrading their equipment.11-07-2013I wanted to let people know that I am getting about 950 photo's and about 25 minutes of video per battery charge. I am not using Wi-Fi right now.3-9-2014went to the NUCLEAR COWBOYZ show and shot over 45 minutes of video and about 150 stills. Many of my video was at ISO 6400 as this was an indoor event. Outstanding quality with my 24-105mm, f/4, 'L' lens. Most of the stills were at ISO 6400-12800 and shot in sport mode for high speed. The quality is very good in the stills [I do not blow up to 10 times], and the video's were very good. I was amazed and the people who watched my video's in HD were surprised. Once more I know that I have a very good camera.", "Date": "October 31, 2013"}, {"Title": "A jack-of-all-trades with the best amateur video available", "Author": "D. Alexander", "ReviewID": "R1KOB439K3FCKA", "Overall": "5.0", "Content": "I like this camera a lot. It's a vast upgrade from the 60D, combining the best features of that body, the T5i, 6D, and 7D, with superior movie motion tracking. It's the first DSLR I can recommend for amateur video without a caveat for slow autofocus. Shooting stills from the rear LCD still favors mirrorless and hybrid bodies, but employing the 70D's viewfinder pulls the advantage back to Canon.I've listed the history of this line so you can get a feel for where it slots.MODEL EVOLUTION:==== 50D /200815MP9-point AF, all cross-points6.3 fps, 16 raw96% viewfinder640 x 480 LCDAF micro-adjustmentAF joystickFlash sync socketCF memory cards==== 60D /2010+ 18MP+ 1080p/720p/480p movies+ Mono mic+ 720 x 480 LCD+ LCD articulates+ Metering improved+ White balance improved+ Wireless flash control+ HDR / MSNR / exposure merge+ Raw conversion and filters on-camera+ Movie crop zoom (7X, 480p)+/- SD cards+/- simplified button layout-- 5.3 fps, 16 raw-- no AF joystick-- no AF micro-adjust-- no flash sync socket-- lesser build==== 7D /2009+ 19-point AF, all cross-points+ 8 fps, 25+ raw+ AF joystick+ AF micro-adjust+ Magnesium chassis+ 100 % viewfinder+ Flash sync port+ Weather-sealing(ish)+ Video sound level adjustment+/- CF cards+/- larger-- 640 x 480 LCD-- LCD won't articulate-- Movie crop zoom-- HDR / MSNR / exposure merge==== 70D /2013+ 20 MP, noise improved+ 'Dual Pixel AF' in Live View+ LCD articulates+ LCD touchscreen+ 720 x 480 LCD+ Wifi built-in+ Silent-shooting w/ viewfinder+ Scene Intelligent Auto mode+ Stereo mics+ Video compression improved+ Movie crop zoom (3X, 1080p)+ HDR / MSNR / exposure merge+/- SD cards+/- smaller+ /- weather sealing+/- simplified button layout-- 7 fps, 16-23 raw-- no AF joystick-- no spot-AF or AF-point expansion-- no flash sync port-- lesser buildViewed from another angle, here's where we've seen the major features before:* 20MP sensor* Dual-Pixel AF* 16-shot raw buffer, 60-shot jpeg buffer (60D)* 19-point AF system (7D)* Swivel LCD screen (60D)* Touchscreen LCD (T5i)* Simplified rear control layout (6D)* Wifi (6D)* AF micro-adjustment (7D)* Stereo microphones (T5i)* Silent shooting through the viewfinder (5D III)* Movie crop zoom (T3i)* IPB and ALL-I video compression (5D III)* On-camera raw conversion, movie editing, and effects preview (T5i)* Scene Intelligent Auto mode (T5i)It's like a greatest-hits album; there's almost nothing from the parts bin that hasn't made an appearance.HANDLING AND NEW FEATURES:No surprise: it feels like a 60D. Small compared to the 40D/50D/7D, but without the handling compromises you'd see moving to a T5i. General build is fine except for the mushy buttons. It isn't brickish like the 7D and the other two to a lesser extent. The difference shows up on the scale: this body mirrors the 60D and weighs 6 ounces less than the 7D, splitting the difference between that and a T5i. Good for travel, though lens weight tends to dictate the DSLR experience at this level.Canon has rejiggered the button layout to match the 6D. A new button near the shutter changes AF modes. Five buttons have switched functions relative to the 60D. Menu adjustments are faster because you can use both thumbs. If you're shooting multiple bodies, the 70D pairs best with a 6D, and the 7D with the 5D III. Earlier bodies require more acclimation.Coming from the 40D/50D/7D, I'm not keen on the rear dial and D-pad. The dial works, it's just small. The D-pad, though, is at least an inch from the AF-on button. If you're using it for direct AF point selection and the AF-on button to AF, you'll wear out your thumb in a hurry. The 40D/50D/7D all have a separate hat-switch in a more ergonomic position. That aside, there's the question of weather-sealing. Regardless of what Canon says, pretend it's a sieve if you're in more than a drizzle. The 'it got wet' repair isn't cheap and the kit lenses aren't sealed.The big addition for the 70D is the touchscreen. The implementation is straight from the T5i: if you can adjust a setting with the physical UI, you can adjust it by touch. This significantly lowers the EOS learning curve. The touchscreen is capacitive and almost as responsive as a modern smartphone, unless you're wearing non-conductive gloves.How does touch change things in practice? If you're a novice, it makes things accessible. Press the Q button to pull up all the major camera functions and tap to adjust. If you're more advanced, it simplifies Live View autofocus. You don't have to place focus points on your subject or pan a focus box with the D-pad. Just tap. It's so much faster. This yields huge dividends when coupled with LCD articulation for off-angle shooting (of high or low objects), studio shooting from a tripod, and most especially with movies, where you have no time for adjustments and don't want to shake the camera by mashing buttons. Picture review also benefits. Phone gestures (e.g., pinch zoom, swiping) make checking focus vastly quicker and more flexible than on any other non-touch EOS camera.Wifi is also new. I didn't care much for it on the 6D, but it's growing on me for one reason: I can get a live feed to my phone with AF control. That's a big deal. You've always been able to remotely trigger EOS bodies with radio transmitters, but you can't preview the shot, change settings, or move the AF point. Third-party software will do all that, but only with a cable. It's always been an either-or thing. Now you can have both with a free Canon app that'll work with Android or iOS.Wireless control opens a lot of creative possibilities. Put the camera on a bear path or strap it to your car. Make it a flexible second-shooter at a wedding or behind a hockey net. Take a selfie or a group shot without prefocusing or hoping there's contrast in front of an AF point. Move pictures to the phone, process in Instagram, and upload to Flickr. Shoot in one room and have an assistant sort pictures in another on a different floor. I'm sure I've barely scratched the surface.Wireless limitations? A few. You can't take or send movies when Wifi is on (and the setting won't change automatically, you'll probably end up binding it to your custom menu), the app has only bare-bones functionality, live preview is sluggish, and a transfer rate of 2 MB/s makes it impractical to move 25 MB raw files. You wouldn't do any better with an Eye-Fi card; the X2 version is about half as fast.Because it combines a touchscreen with most of the hardware controls from Canon's professional bodies, this body leaves a lot of room to grow. It won't be intimidating for long if you're coming from a Rebel.VIEWFINDER AUTOFOCUS:Like all DSLRs that can display a live feed to the rear LCD, the 70D has multiple autofocus systems. The primary is for stills shot through the viewfinder. The other is for stills or movies composed from the rear LCD.The AF array for viewfinder shooting is a 19-point system pulled from the 7D. It covers the same area as the 9-point array from the 40/50/60D/T5i/T4i, but the hit-rate in AI-Servo (Canon's motion-tracking mode) with fast or unpredictable movement improves by at least half. That applies to the full grid and, to a lesser extent, the center point alone. The older system was already a third better than the one in the T2i/T3i/SL1. Thanks to the dense AF grid, the 70D is much less likely to miss during full-grid shooting for lack of having a point on contrast.While it's definitely an upgrade over the 60D, there are few caveats to this system relative to the 7D:First, it has only three of the 7D's five AF modes: Full Auto (19 point), Zone AF (5 zones), and Single-Point (1 point). It's missing Spot AF (1 point, reduced size) and AF Point Expansion (1 point, reverts to local outer points if necessary). Will you miss them? Maybe. Spot AF makes it easy to hit a very small target with a fast lens, like an eye instead of an eyebrow. AF Point Expansion is great for motion when you want to use a specific AF point, but with a fallback so the camera won't give up if that point misses.Zone AF isn't a perfect substitute. It groups points into areas that you can select, but the point chosen within each area is always the one over the closest subject. If your subject is surrounded by other viable closer subjects, that may cause a miss noticeable with a fast lens.Second, there's more button-pressing than with the 40D/50D/60D for single-point shooters. The earlier bodies can directly select the outer AF points (where eyes typically end up in portraits) with one thumb movement. This 70D can't because the rocker only goes 8 ways (plus a center button) for 19 points. There's no custom function to ignore middle points. Zone AF gives the same economy of thumb movement, but without the same precision from each zone.Third, certain older lenses may be more consistent with the 60D system. I've had trouble in the past with false focus confirmations on a 7D paired with a 50/1.4 and 50/1.8. Firmware updates since may have negated that issue; I don't know. The 70D hasn't hinted at it so far. Still, whatever you buy, give it a controlled bench test before you trust it in the field. Even four-digit gear has quality control variation.Three other narrow points of note: like the 7D, this body has AF microadjustment, an AF offset intended to tune out manufacturing variability in lenses and bodies. Third-party, wide-aperture, and telephoto lenses benefit most. Less so lenses with older AF mechanisms (e.g., 50/1.8, 50/1.4) and those that misfocus variably at different distances or lighting. We've also had a custom function switcheroo. The 7D had one for ignoring obstructions in AI-Servo. The 70D replaces that with one that controls sensitivity to objects that change speed erratically. The 70D also loses the 7D's ability to bind an alternate AF point or zone to a button.In aggregate though, I'm pleased with what I've seen so far. Full-grid automatic AF and AI-Servo on the 60D and before were not ideal. The focus points were too far apart, the selection method was not predictable, and AI Servo was not consistent with static subjects. As a result, I used One Shot with single-point selection for most subjects. This 70D is actually usable in full-auto. When I had a 7D, I found myself in full-auto or Zone AF with AI Servo about half the time shooting f/2.8 or above. I see no reason to change that with the 70D, so I'm not as disappointed about the loss of the other two AF modes as I could be.LIVE VIEW AUTOFOCUS:The 70D's Live View AF is a revolutionary feature, so let's start with deep background. Skip the next three paragraphs if you're already familiar.Live View focusing has always been a challenge for true DSLRs. Absent a translucent light-robbing mirror, you can't get a live feed to the rear LCD without disabling the main phase-detect AF array. In the past, that left you with focus from whatever the camera could divine from image data, the same 'contrast-detect' AF used in point-and-shoot cameras, mirrorless bodies, and phones. But unlike phase-detect, the camera doesn't know which direction or how far to focus. So it guesses. And hunts.Fine for still subjects and small sensors if it's done right. Not so much a DSLR; Canon's implementation in every body before the T4i was pretty much unusable with any moving subject. The T4i sensor had a couple of phase-detect pixels in the middle to make things less bad. The SL1 expanded that system to 65% frame coverage, which made it Canon's best hands-off movie DSLR.But the SL1 is hardly perfect even within the phase-detect AF area. It's usable with subjects that don't move toward or away from the camera too quickly (about a third as fast as the main phase-detect AF array could track), but it still gets confused, it's not brilliant in low-light, and there's a subtle back-and-forth focus-racking when it settles on a subject and when tracking anything.Enter the 70D. Canon's made every pixel over the same area capable of phase-detect with a technique they call 'Dual Pixel AF.' And they've done it without any obvious effect on image quality, while ditching contrast-detect entirely for most lenses. Apparently Canon employs wizards.What performance can you expect relative to the SL1 and the main phase-detect array?(+) In Movie Servo mode, it responds almost instantly to scene changes. Focusing on static objects in general is very quick, although a few mirrorless bodies are even faster. Enabling face detection adds a slight delay, and more if there's no face in the scene.(+) Different lenses change focus at different speeds. None of them seem to run at maximum speed. The change algorithm is tuned for pleasing transitions.(+) There's no focus-racking when focus stops. All mirrorless bodies still do this in low light and most in bright light.(+) It keeps subjects that move at one speed in focus instead of repeatedly snapping in and out of focus. Here again, some mirrorless bodies can track things even faster, but the object won't actually be in focus for as long. With the kit lenses in good light, it'll hold focus on a subject moving directly at the camera from close range at 7-10 MPH. Indoors in low light, closer to 3-5 MPH. Movement can be much faster if it's far away or tangent to the camera.(+) Focus accuracy is very high. AF-M does not, and need not, apply here.(+) USM lenses work as fast as STM, though USM may be audible on the audio track in quiet settings. STM lenses are capable of smoother transitions.(+) It works down to EV 0, half the light of the SL1 and almost even with the main array. Almost candlelight.(+) Face-tracking is effective even with conventional indoor household lighting.(+/-) It works with lenses as slow as f/11, a full stop ahead of the SL1 and two ahead of the main array. Not Canon teleconverters, however. A third-party TC that doesn't report the aperture? Maybe.(-) The main array is still more responsive with erratic movement.(-) A few lenses don't work with it. The ones that matter are: 14/2.8L MK1, 24/1.4L MK1, 16-35/2.8L MK1, 28-70/2.8L, and 80-200/2.8L.(-) Contrast-detect is the fallback for unsupported lenses, Movie Crop Zoom, and some teleconverters.It's just incredibly confident. The subject was out of focus. Now it's in focus. If you choose your own AF points, it looks like a professional focus-pull. The only difference is that you can't (as yet) control the transition pace. That may well become an update down the road, and I'm sure Canon will improve speed and predictive ability in future generations. A version of this system may eventually even obviate the main array. But for now, it's good enough. Great, even. Finally.STILLS:Image quality is very good. There's about a half-stop less noise in JPEG and raw relative to the 18MP bodies and less low-frequency blotchiness at high ISOs. JPEG noise processing has improved. Colors are preserved better at high ISOs. I'd run this body to ISO 6400ish for full-res shots. The 6D is two solid stops ahead if low-light is your highest priority.Dynamic range is about the same, though you can add a stop back to the highlights with Highlight Tone Priority. I use that feature constantly in daylight; it's worth the noise to keep the whites intact. Nikon leads here with the D5200 and D7100. Those two also have slightly more detail from their 24 MP sensors, similar high-ISO noise, and less shadow noise at low ISO. Color noise in deep shadows is still there with the 70D, so you can't be quite as aggressive boosting low tones in post.That aside, a deep 16-23 frame raw buffer, 7 FPS (7.5 in raw), and the 7D's AF system make this a legitimate sports camera. It wasn't so long ago that Canon's 1D series capped out at 8 FPS. Stills shooting with Live View is a different story, though. You can still bang out frames at full speed, but you won't be able to see or track anything. The live feed doesn't come back until a few seconds after you've released the shutter button. Focus is fixed from the first frame. Better mirrorless bodies show intermediate frames and continue to focus, but that's partly out of necessity. I don't rely on Live View for scenarios that need quick feedback.MOVIES:If this is your first foray into DSLR video, you'll be impressed. The right lenses give creamy backgrounds and professional-looking subject isolation, often with the subject you actually intended. Such are the benefits of that trick AF system. But don't expect the stills-centric interface to feel quite as natural as that of a purpose-built video camera.The 70D's feature set borrows a few things from the 5D III: 1080p/30, 720p/60, 480p/30, Time Code support, and a choice of IPB and ALL-I compression. Missing are the 5D III's headphone jack, uncompressed HDMI video, live audio gain control, and both Av and Tv modes (M is still available). We might eventually see one or all of these arrive via Magic Lantern's inevitable piggyback firmware. New to the 70D is onboard stereo sound. It has an ambiance that the mono mics from the 60D and 7D can't match, but like every onboard setup, it picks up camera and lens noise in quiet environments. There's a jack for an external mic. Maximum recording time is a half-hour. Battery life is 1-2 hrs depending on temperature, AF use, and lens stabilization, though you can double it with the battery grip.Image quality is Canon's status quo despite the new compression. Color and contrast are strong by default. Resolution hasn't changed: it's somewhat soft at 1080p, but in a way that's only apparent with high-detail scenics or when shown back-to-back with Panasonic's GH3 or a video-only body like the Blackmagic Cinema Camera. Moiré control (of false coloring and interference patterns on subjects with repeating fine detail) is decent. Better than the 6D, short of the 5D III. You'll still see some edge-crawling with horizontal features. Noise is subtle enough until about ISO 800.A key returning feature is Movie Digital Zoom. It's a menu option last available with the T3i that lets you zoom from 3X to 10X in 1080p mode. The higher zoom levels aren't that interesting, but 3X mode has 1:1 pixel mapping, so you lose very little quality. It's effectively a free teleconverter without the light loss. In 35mm terms, it turns your kit 18-135 into 600mm on the long end. Two caveats: it only works with contrast-detect AF and it can't be enabled while recording is in progress. Macro shooting and the sort of fixed composition and focus shots common to professional productions benefit most.Like the 7D and 60D before it, the sole on-camera editing controls trim the beginning and end of the clip. Achieving that on a computer takes surprising effort. If you're not post-processing, shoot in IPB, trim the footage in-camera, copy it to your system, and use Handbrake or AVS Video Converter to bring it down to a size suitable for Youtube or Vimeo. IPB doesn't hold up to major changes in colors or tone curve in post; choose ALL-I for a more serious production.What are we missing? Mostly out-of-the-box thinking. Given what Magic Lantern has added to the 5D III (raw video, HDR video, a thousand other features) solely through reverse-engineering, one wonders where Canon might have gone. Even the more prosaic 1080p/60 and a less indifferent downsampling algorithm would have been appreciated. Still, I've a greater appreciation for what's already there now that it's actually in focus.LENSES:Both kit lenses are excellent. The 18-135 STM is much improved over the USM version that came with the 60D and earlier kit choices like the 28-135 USM. Strong points include a smooth zoom action, no zoom creep, and nearly inaudible focus and stabilization. It's a little heavy and bulky compared to the 18-55 STM, but I'd still favor the longer zoom range. There's no image-quality benefit to the shorter lens.Some thoughts on future additions:* Primes are often lighter, smaller, cheaper, available in wider apertures, optically better, and subject to less less manufacturing variation. They're less convenient, less versatile, updated less often, and can cause you to miss shots in fast-paced shooting environments.* An f/2.8 lens on this body is just fast enough for most indoor use without flash. You'll want a flash for anything slower. A flash can provide more even, pleasing pictures, at the expense of a bulkier, attention-attracting rig.* Third-party lenses tend to have less initial cost, better warranties, and more aggressive designs. AF and optical performance is often (but not always) inferior to OEM lenses, quality control and service can be less consistent, and resale values are lower. Value varies by lens model. Some are better than the OEM equivalents (e.g., Tamron 70-300 VC, Sigma 35/1.4). Some fill holes in the OEM lineup (e.g., Sigma 50-150/2.8 OS, 30/1.4, 18-35/1.8). And some are lesser substitutes, but still competitive (e.g., Sigma 10-20/4-5.6).Try Canon's 85/1.8 if you're looking for an economical leap in subject isolation relative to the kit lenses.MEMORY:Video chews through storage space. A 32GB SD card is good for about 45 minutes with ALL-I compression and two hours with IPB. 8GB and 16GB cards are plenty for stills. Size aside, interface responsiveness isn't much affected by card speed. Faster cards have three advantages: they can shoot longer high-speed raw bursts (up to 22-23), clear the picture buffer more quickly, and record video at the highest quality without risking a speed warning. In one-shot mode, this difference is invisible; very fast cards would only make sense if you were time-limited on card-to-computer transfers with a USB 3.0, SATA, or Firewire card reader.IN SUM:This is the most significant DSLR Canon has introduced since the 7D. It's the first one I've reviewed without some major caveat. And that's unusual. Canon doesn't often make game-changing cameras. They do what they did with the 30D, T3i, T5i, and 6D: make incremental improvements and leave a lot on the table. That's not what happened here, and so much the better. The 70D is significant because it has most of the 7D's AF unit, which is serious business because Canon differentiates cameras with AF performance. It's significant because Canon has licked the movie AF problem that stopped me from ever recommending a DSLR to normal people for movies, while leapfrogging even Sony's pellicle-mirror DSLR-alikes, a former class leader. And it's significant because it combines these upgrades with a physical and touch UI that makes them accessible to a broad cross-section of users. Truly, well-played.But should you buy one? Maybe. Like every new DSLR, it's expensive, and the old ones depreciate like dairy products. There's no question the major upgrades are in Live View. If you're all about stills through the viewfinder, plenty of bodies from the 40D onward could satisfice. But for videos with moving subjects, this is the zero square. There's nothing from Canon behind it. If I had $700 to buy a movie DSLR that would fit into a small bag, I'd save another $500 and buy a bigger bag rather than take the SL1 over the 70D.vs. 7D - New at $1500, the 7D's a nonstarter. Used at $750 and with the enhancements from firmware 2.0, it's a bargain for viewfinder stills if you don't need silent shooting. It's faster, more usable, more configurable, and built like rocks. It's also short an articulating touchscreen and completely inept in movies without manual focus, but focus peaking in Magic Lantern makes that easier.vs. 60D - New, it's barely half the price of this 70D. Viewfinder focus is pretty decent, the framerate is high enough if you're not relying on your pictures for dinner, and it has the same nifty articulating LCD less the touchscreen. A fine camera. I'd buy that used 7D first without a second thought.vs. T5i - At $750, this camera is $150 more than the 60D. It has the awkward honor of being a consumer-class device that's harder to use in movie mode than the semi-pro 70D. That accompanies a lesser build, lesser physical UI, very small raw buffer, no Wifi, no AF-M, no top LCD, no movie zoom, and the 60D's older phase-array AF. To me, the step down is not worth $450.vs. 6D - This full-frame body has appeared for $1500 in some places. It has far better noise control in low light: almost two full stops on the 70D, with a very sensitive center AF point to match. Physical size and layout are similar, but framerate and motion tracking with the main phase array are way behind, as is Live View AF. No LCD tilt or touch. Full-frame lenses cost half again more. The 70D is a better choice for most people, but weigh the 6D if you shoot methodically and care most about subject isolation and low-light performance.vs. Nikon D7100 - Stills have more detail and dynamic range and respond better to post-processing. The main AF array is better than the 70D's and more configurable, but offset by a 6-frame raw buffer. No LCD tilt or touch. No Wifi. Dual SD cards. AF assist lamp. Intervalometer. The physical UI is better, though the menu UI is less polished, as are some software features. Video can be uncompressed over HDMI and 1080i/60, but motion AF is Rebel T5i-caliber. On the system side, Canon has better service and cheaper lenses in some categories. Stills would have to be a much higher priority than movies to favor this over the 70D.Post if you have any questions -- I'll answer them. If you intend to downvote, please leave a comment so I can correct the inaccuracy.", "Date": "August 29, 2013"}, {"Title": "Love this camera", "Author": "Leather", "ReviewID": "R3B8YJ0C8JCCX6", "Overall": "5.0", "Content": "I am coming from a T3I (which I was more than happy with the image quality but needed more features). But when I got this 70D I just could not believe how sharp the pictures are and the colors are so true! I have been using the 55-250mm IS STM and 18-1235mm IS STM lens with this camera and the whole set up works fantastic. I did not think I would like the touch screen but it turns out I use it most of the time to adjust my settings. The video and shooting autofocus work great although I have had a few times where it would not autofocus on something usually in really low light conditions. When I posted some pictures on facebook all my friends and family commented on how much my photography has improved (they didn't know I got a new camera) I like to photograph wildlife, and the pictures of birds are just amazing you can see each fiber in their feathers and the small cracks in their talons. I find myself constantly looking for things to photograph just because it seems like each photo pleasantly surprises me. The shutter speed and FPS work great so that I can freeze the birds midflight and get tack sharp photos too. I highly recommend this camera!", "Date": "November 8, 2013"}, {"Title": "remarkable camera", "Author": "John Anderson", "ReviewID": "R33LDATW9DZ3FP", "Overall": "5.0", "Content": "This is the third Canon DSLR that I have used (20d way back when, 7d more recently, now this), and I think it may well be the best in just about every respect. The good/bad is that it is feels much lighter than the 7d, and as a result I decided to take it with me on a quick trip to Europe. The \"bad\" part of this is that I have to agree with the reviewers that complain about the control wheel feeling \"cheap\". It does, and it scares me, but so far it has worked flawlessly.  Beyond this however the camera has more than met my expectations straight out of the box.  The extra pixels are immediately noticeable when you crop a picture, the added speed makes photographing wildlife or difficult indoor situations a breeze, the autofocus is downright spectacular.  I find that getting used to the touch screen may take some time & again I worry a tad about the durability of a screen that can be rotated six ways from Sunday, but the controls are all in the right places & the menus on the touch screen make sense and are easy to get through. Overall I would say that if you are looking for a really spectacular DSLR under 2000 bucks, look no further!", "Date": "October 11, 2013"}, {"Title": "What an upgrade...", "Author": "Chaz", "ReviewID": "R16DAXPBUX6BJ1", "Overall": "5.0", "Content": "I was on the fence with buying this as I had the 60D as my 2nd camera, and didn't know if this would worth the extra cost to upgrade, but it was and is. I LOVE this camera. The autofocus in video is AMAZING... I have been using this camera mounted on a 10 foot jib crane, and finally can get video camera quality focus on a DSLR. It's seriously one of the smartest upgrades I've ever made. I also own a 5DMIII, and that camera is amazing as most owners of it can tell you, but still, the auto focus on the 5DMIII isn't in the same field as the 70D. Which is saying a lot as the 5DMIII cost me over $3,000.I read some reviewers saying that \"True Film Makers\" or \"Photographers\" will never use auto focus, and they just make me laugh. I'm a professional film maker and photographer, it's what I do for a living, and I can say that if you find a tool that helps you achieve the end result you are going for, simply and affordably, then get it. This is that tool. I honestly favour this camera to my 5D, and I wish it was in my possession a long time ago, as I can think of a dozen projects it would have helped having dramatically.If you're looking at upgrading from the 60D or Rebel series DSLRs then don't think about it, buy this. If you have a 5D and you're thinking of this as a 2nd camera for your kit then you NEED this one. I am über satisfied with this purchase and would make it again and again, in fact I'm most likely going to be buying 2 more 70D bodies for a project coming up. At the price you get more bang for your buck than any piece of equipment I've purchased thus far.", "Date": "October 8, 2013"}, {"Title": "Continuous Focus Video Works Great even with non-STM lenses", "Author": "TourniquetRules", "ReviewID": "R16XC254D7XQ60", "Overall": "5.0", "Content": "Very happy with this camera.  For reference have used a 1DS MKII, 10D, 20D, and 60D previously and am a prosumer user.  I used a SanDisk Extreme Pro 64GB SDXC card.  These are my impressions after 3 days of use. I was most interested in the new continuous focus while shooting video...especially with non-STM lenses.  I bought the 18-135mm STM lens as a package.  I used my 85mm L lens and shot at f/1.2 and 35mm L and shot at f/1.4 to really test its ability. The camera was able to continuously focus very well.  When it did lose the focal point I was able to quickly redirect it without stopping the action.  Big improvement over the 60D.  The 18-135 STM was very smooth and was more accurate at maintaining focus.  It won't replace a small handheld video camera anytime soon for most casual occasions....but someday it might. I used the Wifi functions on the iPad 3/Macbook Pro.  A big plus is that you can touch the LCD to type in passwords, etc.  It worked as promised with a solid Wifi connection.  I used it for remote shooting and transferring files (1.5MB/s in my nonscientific tests).", "Date": "September 2, 2013"}, {"Title": "Excellent DSLR for beginner and intermediate photographers alike", "Author": "Chris C.", "ReviewID": "R1O78C9IEO4H65", "Overall": "5.0", "Content": "Awesome camera. Purchased to have a graphic designer friend (also a casual amateur photographer) do an engagement photo shoot of me and my fiancé, figuring for the cost I would save of hiring a true professional I would have a great camera to show for it at the end of the day. The photos came out amazing. I myself am very much an amateur and this is my first DSLR - while this is not the most basic in Canon's line-up, as with a lot of tech, I tend to go with the more pro-sumer models so there is plenty of room to grow before needing to upgrade down the line. I had been waiting a few years for Canon to release the perfect model with the right feature set for me, and the 70D is it. There are a lot of auto or semi-auto modes good for the beginner, as well as full manual controls (which is really why you would want to buy a camera like this anyway). The camera has excellent build quality without being too heavy. Live view looks great on the articulating screen, though I surprisingly quickly realized I much preferred the viewfinder (which also incidentally saves a TON of battery power - during our shoot we shot 478 photos (without flash) over 2.5 hrs, almost exclusively using the viewfinder, and included battery was still full when we were done). The included 18mm-55mm kit lens is, well, the included kit lens; no frills but sufficient to get you started. Have not played with the onboard wi-fi yet, nor the video which is actually supposed to be one of the major strengths of this model. All in all, very satisfied with this purchase thus far, and looking forward to capturing many memories to come with this camera.", "Date": "November 6, 2013"}, {"Title": "Unbelievable camera, the best I've ever owned!", "Author": "Chris P. OConnell \"Chris P. OConnell\"", "ReviewID": "R25636BK5FIQD5", "Overall": "5.0", "Content": "There's so much to love about this camera that deciding where to start is a challenge.My absolute favorite feature on this camera is that you can easily attach your smart phone to it.  Via wifi one can control the shutter or transfer pictures wirelessly.  You can see exactly what the camera sees from your phone's screen!  This is a great feature because you don't have to buy a dedicated shutter release.Canon was super smart about how they implemented this wireless connectivity.  The camera itself creates an access point that your device can attach to.  Once you've connected your phone to the camera's hotspot you just launch the Canon app.  You can even change the shutter speed and aperture on the camera from your phone.The screen on this camera is AWESOME!  It can pivot and turn allowing you to take pictures without being forced to look through the eye hole.  The screen is vivid and colorful.  Oh, and by the way, the screen is touch controlled.  At first I kind of laughed at this feature, like \"ha, who would ever use that?\"  I can't tell you how awesome the touch screen is, it's sensitive and accurate and a complete pleasure to work with.  What's better is that almost every control you might ever need to adjust while shooting is accessible through the screen, meaning you don't have to fumble around with buttons, knobs or navigate menus to adjust your shot settings.The 70D has a reasonable HDR shooting mode, which is a function I always want on my cameras.  Some of the Sony cameras have pretty awesome HDR, taking up to 7 pictures to combine together.  The 70D can take 3 pictures at different exposures and combine them together, which in many cases is adequate.Of course the picture quality is astounding on Canon's 70D.  Right out of the box I took 3 pictures of friends in my house that just blew me away.  I knew after 10 minutes of shooting with this device that I made the right purchase.I've owned the Canon 20D and 50D in the past.  One thing that always drove me crazy was that the battery meter.  The meter previously had four indications, Full, Medium, Low and flashing (very low).  On my previous cameras the battery meter would show full, then be at low, skipping the midrange all together.  The Canon 70D's battery meter is far more accurate, meaning you aren't surprised by a dead battery all of a sudden.While we're at it, the battery life is superb on the 70D.I never really cared much about shooting video with my cameras before.  The 70Ds video shooting is SO incredibly good that I am now looking for opportunities to record things!  Last night I recorded my friend's harp recital.  I was standing in the doorway across the room and just using the built in microphone.  The sound was good (though one can purchase a wireless microphone for better sound), and the video quality was out of this world.The only real complaint I have with this camera is that it seems challenged by scenes with highly differing contrasts.  The first evening after receiving the 70D I went for walk a little bit before sunset.  I was taking pictures of brick buildings with the sky above them.  The brick looked overly dark and lacked detail.  I had several other similar experiences shooting with bright skies.  The pictures were so concerning I called Canon tech support (which was excellent by the way).  They looked at my raw images and said the camera was fine.After using the 70D for some time now I've learned to compensate by setting the ISO to auto or adjusting the metering mode.  Most DSLRs I've owned have had their own \"personality.\"  Learning the nuances of these cameras takes a little time.All in all, this is by far the best camera I've ever owned.  I can't recommend it enough!", "Date": "November 17, 2013"}, {"Title": "Best bang for the money, hands down.", "Author": "Photo Cubics Inc", "ReviewID": "R3601TX27Y1DJQ", "Overall": "5.0", "Content": "I have several Canon Cameras. I'm a pro. My specialty is product and jewelry photography, and some fashion. For Fashion I use  Nikon D800, for everything else, Canons. Anyhow, we make promotional videos and have been using the 5D Mk ii and iii, and they are great, but auto focus is troublesome at best. So when I read about the 70D I decided to go for it with the 18-135 lens and a super fast 80mb/s transfer rate memory card, are real must for high end video. I chose the Wasabi spare batteries over Canon, always do because they are better than the original Canon Batteries and a lot more affordable, must have spares, and that was it for the purchase. When the camera arrived I jumped right in. If you have experience with Canon cameras it is easy to adapt. I went through everything without reading the manual, and then hit a snag with video audio levels, so then I went for the manual which was no help, so then to the info Disc that comes with all Canons. Ahhh, there it is. It is the single issue I have with the 70D... the audio control is buried and also not as flexible as it needs to be (NEEDS TO BE, hello Canon, READ THIS).Otherwise the video on the 70D is light years ahead of anyone else in DSLRs. The focusing system is killer, image quality is superb, and the audio, once found and set is sufficiently good, it is stereo.The still shots from the 70D are in line with a 5D mark ii. You can read the specs for the other features, that's not my job here.Some people said the camera feels cheap... not at all, not sure what crawled up their pipe to make them say that... you buy a 70D because you're not buying a 5D mk iii or 1DX. The one complaint I have of all Canon cameras is the software... it is lame compared to Nikon Software (they offer priced pro versions, Canon does not) you have to have PhotoShop when you have a Canon, and it makes no sense because I know Canon could easily enhance their editing software (NEEDS TO BE, hello Canon, READ THIS). Keep it in context and the 70D is the best all around camera Canon has ever made by far. I paid $1,199 on Amazon, look for that price, the package deals are not good deals yet, maybe in a year, but for now get the 70D with the 18-135mm STM lens and be super happy.", "Date": "December 13, 2013"}, {"Title": "Great image quality & amazing autofocus!", "Author": "P.K. Frary \"Gochugogi\"", "ReviewID": "R3IWEVV2JC75C2", "Overall": "5.0", "Content": "The 70D is targeted at advanced photo and video hobbyists, packing cutting edge technology and sophisticated features into a compact body. It's also a familiar camera--at least to EOS shooters--feeling like a marriage of prior models: form factor and controls of the 60D and AF and viewfinder of the 7D. Toss in Wi-Fi, enhanced high ISO, a new 20.2MP Dual Pixel CMOS and that's the 70D in a nutshell.CONSTRUCTION boasts superb fit and finish: polycarbonate body shell, matte black paint and stainless steel undercarriage for strength. Thick textured rubber and finger groove make for a secure grip. The shutter has the same metallic click-clack as the 60D and is louder than the 7D and 6D. Fortunately, silent drive mode fades operation to pianissimo, making it idea for stage and ceremonies.Like the 60D, the 70D has a crystal clear 3.0\" 1,040,000 dot LCD. The big deal is the addition of touch screen ability. Touch sensitivity is as good as an iPhone 5 and ideal for LiveView shooting in dim light. The swivel LCD is handy for video and ground level macro. The only negative of the LCD is it hits L-plates and flash brackets when swiveled to the side.CONTROLS: DSLRs are about control and nobody buys one to use in full auto. Don't like the results of auto exposure or AF? They're easy to override or directly control. Plus, controls and features may be customized, allowing multiple ways to do the same thing. For example, I assigned electronic level activation to the DOF button and programmed C mode with my favorite drive, AF and exposure settings.Buttons and wheels feel solid and can be operated while looking through the viewfinder. If coming from a 50D or 7D, you'll need to adjust to the lack of a joystick, flash exposure compensation (FEC) button and white balance button. However, you can assign FEC to the SET button and a FEC scale appears in the viewfinder. Finally, the 7D's toggle switch for LiveView and video migrated to the 70D, a big improvement over the 60D's clumsy Mode dial video.AUTOFOCUS: The 70D inherited the 7D's blazing fast 19-point cross type AF array. I found it senstitive and sure-footed in most light. Canon only included three of the 7D's five AF modes: zone, manual selection and 19-point auto. Spot and expanded point AF are MIA. Nevertheless, a big step up from 9-point 60D AF.Using single point AF mode (manual selection of a single point) and a tripod, I shot test patterns both flat and inclined with several lenses. AF was highly accurate, locking on the point I selected on my inclined ruler. And it was consistent in performance from close focus to infinity. On the other hand, the 19-point auto select mode didn't do well with the ruler (flat target was fine). It was not able to guess which line I wanted in focus and varied with each shot. I expected this to happen but it illustrates photographers need to control the point of focus and shouldn't expect cameras to read their mind. All three modes performed perfectly at infinity and with flat objects.New DSLR users need to understand that the three main AF modes are not designed to recognize human faces like a point and shoot or iPhone. However, face recognition AF is available in LiveView and video modes.In real world use I found auto focus excellent. However, there are dozens of AF options and it took me weeks to figure out what worked best for me. Manually selecting individual AF points is amazingly accurate: near 100% hit rate for difficult subjects, e.g., macro or tight facial portraits (lock on an eye). On the other hand, 19-point auto-select is fast--press 'n lock--but often guesses wrong--maybe a 75% hit rate. Cameras aren't smart enough to make a choice between a rock, tree or cloud, so I avoid 19-point auto select mode and full auto. Finally, Zone focus is the best of both worlds: you pick the zone--top, bottom, center, right or left--and the camera guesses at the subject within the selected area. Zone focus is perfect for stopped down shooting with wide angle lenses and shooting from the hip, e.g., street photography, close to a 100% hit rate when used for the right situation.IMAGE QUALITY is the same as the 60D from ISO 100 to 800, i.e., great! I developed RAW images in Aperture and DPP and was pleased with the detail, color rendition and noise control. At ISO 1600 and above the 70D pulls away from the 60D with a notch better noise performance. The 70D has slightly less noise than the 60D at high ISO but, most significantly, noise is less prone to banding artifacts and more grain-like. Also, grain-like noise is easier to control with noise reduction plug-ins like Topaz Denoise: I can squeeze out another stop of acceptable high ISO over my 60D (or lift shadows more aggressively).VIDEO: I'm primarily a still photographer but shoot video occasionally. And yet I found video operation on the 70D surprisingly easy. First, contrast detection AF during video is a mammoth improvement from previous DSLRs: faster, movie servo AF grabs faces like magic and focus-pulls are a snap with the touch screen. However, focus is poky compared to M4/3 cameras, e.g., Olympus Pen E-P5. That said, the improved contrast detection AF is a great feature, especially for holiday video shooters! You can use manual focus if you need more control. If you disable face recognition AF speeds up considerably.I shoot video of my ensemble, Leeward Coast Guitars (search on YouTube), and the file size limit of 4GB (FAT spec) spoiled long pieces: most DSLRs stop recording midway in the track! The 70D solves this gotcha by automatically and seamlessly spliting files greater than 4GB for extended video recording.Think of EOS Wi-Fi as a fancy remote control: via the EOS Remote app you can set exposure, select AF points, fire the shutter, etc. You can use LiveView or save images on your iPhone, iPad or Droid. Wi-Fi eats batteries fast, so carry spares. My main complaint is Wi-Fi is needlessly complicated to set up. Also, you can't upload directly to FB or photo sharing sites but, instead, must upload to Canon's awkward cloud based photo service and transfer from there.VIEWFINDER: Optical viewfinder quality is excellent. The specs of 98% coverage and .95x magnification are less than the 100% coverage and 1.0x of the 7D. However, viewfinder clarity and brightness are a level above the 60D and 7D. Even with a F4 zoom the viewfinder is a pleasure to use: bright, grainless, smooth and vivid. The transmissive LCD display--transparent LCD over the focusing screen--can display icons, AF patterns, metering patterns, grid and plain matte screens and an electronic level.FLASH: The popup flash is great for fill and snapshots, and functions as a wireless E-TTL master. My 430EX II worked great as a slave bounced off walls and ceilings. Both bounce and direct flash images were well exposed. This is one of the few cameras I rarely need to touch FEC.FINAL BURB: The 70D is a petite, nimble and capable instrument, and a significant upgrade over the 60D. Plus, it's easy on the shoulder, captures impressive images and video and is an ideal travel and hiking DSLR.", "Date": "April 3, 2014"}, {"Title": "A Worthwhile Update", "Author": "Jay A.", "ReviewID": "R388BQLXH1UULX", "Overall": "5.0", "Content": "This review is coming from someone upgrading from a Canon Kiss X4 (T2i/550D). I've had the T2i for around 2 years and even though it can take great pictures (IMHO) I find the camera lacking, mainly in focus points and burst/buffer. I mainly shoot sports (often basketball) and events, so low light performance is important for me. For sports I shoot 1/400 upwards and up to ISO 3200 with the T2i and with post processing I turn in a lot of good shots. On the 70D, I shoot the same settings (for now) but ISO 3200 shots look cleaner and I've had a lot more shots that did not need any post noise reduction. Also, I've had a lot more in focus shots, the focusing system is leaps and bounds what I was used to. Using my trusty EF 85 f/1.8 shooting sports has never been better. I was thinking of waiting for the successor to the 7D, but I figured if and when it does arrive I probably can't even afford it. Anyone coming from a Rebel body will feel this is a significant step up. Highly recommended.UPDATE 11/11/13: A month using this camera and I am very pleased with the performance. Battery life is almost twice than the T2i. Read some reviews and most are saying the image quality is incremental from the previous 18MP Canon but after editing hundreds of RAW files the noise is well managed and colors seem more vivid. I tried to keep my T2i ISO at 800 (or lower) as much as possible, with the 70D the 1600 is the new 800. On a side note, I'm glad that I am able to use a 3rd party (Photive) battery for this. I had second thoughts but turns out the Canon charger worked and battery had no issues whatsoever.", "Date": "October 13, 2013"}, {"Title": "Best Canon at this price point yet!", "Author": "Chris Kiess", "ReviewID": "RLBKDCTVPPTFW", "Overall": "5.0", "Content": "I have had this camera for a little over a month now and am only working with the kit lens and body right out of the box. I am not using any hot shoe flashes, extra lenses, filters etc., which is the best thing about this camera - it is superb right out of the box as a stock set up. And, I do mean superb. I have owned Canons for about the past 20 years and have to say this is the best I have owned yet for the price point.The stock lens: Excellent lens for a kit lens and truly responsive in terms of focus vs. stabilization and lighting. This, of course, also works in conjunction with the sensor and chip. But, this is a nice, solid lens at a good cost.Video: The primary selling point on this is the focus when using video. I have to try pretty hard to trick the camera in order to see any focus problems when recording video. It's easier to trick the camera in low light, but I think this is the best video I have ever shot with a camera. The audio seems to be on par or above with most cameras in this price range. But, a nice shotgun mike would probably make a nice addition for the serious videographer. I've never considered myself a serious videographer, but this camera could change that.Battery Life: Battery life seems very good and I am still working off the same charge from when I pulled the camera out of the box about a month ago. However, to me this has never been an issue since I ALWAYS carry a spare battery. I may consider a battery grip for this camera and have owned a couple of Canon battery grips with previous Canons. As a result, battery life has never been much of a concern for me.Speed: The speed of the camera is excellent and I have worked in situations where I fired a number of bursts with great success.Form Factor: I think this is a nicely sized camera and the controls are very well placed for my hands. Everyone has different hands and mine tend to be a little smaller. But, I do like the size and feel of this Canon. It is significantly larger than the Rebels and I think that is what I like about it since I always felt the Rebel was a bit small.On-camera Flash: The last thing I'll mention is the on-camera flash. It's the best I have used yet. Hands down. I am not a big flash user because I shoot a lot of naturally lit subjects. But, I have used this one with a lot of success and am pleasantly surprised at how well it works.Overall, I can't say anything bad about this camera. I wish I could offer up something constructive. But it appears as though Canon got everything right in this one. Even the interface...though I am sure there will be plenty of nit-pickers out there, the interface is pretty intuitive with minimal use.This is truly the best Canon I have ever owned.", "Date": "December 20, 2013"}, {"Title": "Worth the upgrade from a Rebel - amazing auto-focus and packed with great features", "Author": "BVIKE", "ReviewID": "R1T1XHWP5YT2ZN", "Overall": "5.0", "Content": "After using my Canon Rebel T1i/500D for about 4 years, and investing in some nice lenses (EF-S 18-55mm f/2.8 IS USM, EF 50mm f/1.4 USM, EF 70-300mm f/4.0-5.6 IS USM) I decided I needed to upgrade my camera body and take advantage of some of the latest technology to improve my shots.  I have had the Canon 70D for about a month now, and I am super happy with my purchase so far.I had two main reason for wanting an upgrade to my camera body:  (1) I wanted improved AF options, as with the shallow depth of field of some of my lenses, I often had a hard time using the AF on the T1i and getting the right object in focus.  The T1i has a limited number of AF points, no Cross-Type points, and manually selecting the AF point is not easy on the T1i.  (2) I have started shooting more video with my DSLR, and I was intrigued with the Dual Pixel auto-focus ability of the 70D.  When choosing a new body, I narrowed my choices down to the 6D and the 70D.  In the end, I chose the 70D because of the increased number of cross-type AF points (19), and the new Dual Pixel AF for shooting video, and it comes at a lower price (while clearly sacrificing some of the image quality of the full-frame sensor on the 6D).  I also got to keep all my current lenses with the 70D, whereas my EF-S lenses would not have worked on the 6D.After shooting with the 70D for a month, here are my impressions so far:Pros:-AF!  The Auto-Focus is light years ahead of the T1i, and my shots have improved significantly as a result.  I love the ability to switch quickly between the 3 different AF options by hitting the small button next to the shutter release button.  I usually leave it in the Auto-Selection AF mode, and found that the 19 cross-type AF points do a MUCH better job of auto-selecting the focus points.  When the camera doesn't select the right objects, I usually switch to single-point selection, and then use the toggle on the back of the camera to move to the correct point.  I can do all of this in about 1-second while still looking through the viewfinder the whole time.-Flip-Out Touch-screen LCD:  I didn't realize how much I would like this, but I really do.  I have used the flip-out option several times when shooting at odd angles using the LiveView option, or when shooting video.  The touch-screen also works very well, with all the familiar gestures from your touch-screen phone (swipe to view next photo, pinch to zoom, etc.).  I also like that in Live-View, I can simply touch the screen on the point I want the camera to focus on, and the camera focuses to that point and releases the shutter.-WiFi: I have found the WiFi most useful for using the EOS Remote app on my iPhone to remotely view photos, or control the camera from my iPhone.  Similar to the camera's own touch-screen, I can use a \"LiveView\" on my iPhone and simply touch my iPhone screen on the focal point and the camera focuses and releases the shutter.  You can also remotely change all the settings of the camera from the phone.  I have also used the WiFi to transfer photos to my computer, but its pretty slow, so I usually just use the USB cable instead.-Drive Modes:  The camera has a lot of great drive modes, including a burst-mode of 7 per second.  I also like that is has a silent drive mode, which is something I didn't have on the T1i and is great when shooting during a quiet event.-Dual-Pixel AF with video.  This works as advertised, and I found playing the the 3 different AF options to be really easy to use and intuitive.  You can either have it auto-focus and track faces (works well if the face isn't moving too fast), AF zone mode (meaning you choose a certain zone of the screen and the camera focuses on whatever moves into that zone), or just touch a point on the screen and the camera will focus to it until you touch somewhere else.-Viewfinder:  The viewfinder is light years ahead of my T1i.  I can tell much more easily if I am in focus and I also have enjoyed using the level option (a little icon tells you if you are holding the camera level or tilting it to one side or another).Cons:-The camera is much bigger and heavier than the T1i.  In some ways this is better to balance out the weight of some of my lenses, but still it is definitely heavier and larger than what I am used to holding/carrying for the last 4 years.-Plastic-feel - I was hoping for over $1,000+ camera-body that it would feel less plasticky, but unfortunately this one does not.  I guess you need to move up to the 5D to get a more metallic-feel to the camera.-Focus noise in video.  While the AF works well in video, unless you have the new STM lens, the focusing makes a lot of clicking noises that are picked up in your video.  My USM lenses are really loud in the video.  I really wish now that I had gotten the kit-lens so I at least had one STM lens for shooting video, especially when I know I want the ambient audio to sound clean and am not just planning to dub over music or something.-Only one card slot.  Would have been nice to add the extra card slot for more video-shooting capacity, or backing up photos.Final thoughts: If you are thinking of upgrading from a camera-body similar to the T1i/500D, this camera offers a huge jump in technology that makes a big difference in the quality of your shots and video, as well as some huge improvements in convenience and usability (flip-out touch-screen LCD, WiFi, improved viewfinder, etc.).  I think you get a lot of value for the price, if you are willing to live without a full-frame sensor, I can't imagine a better camera for hobbyist photo and video enthusiasts for this price.", "Date": "December 6, 2013"}, {"Title": "Review mostly for still image photography and compared to 6D and T2i (550D)", "Author": "rai777", "ReviewID": "RVLIMKP4P8QDB", "Overall": "3.0", "Content": "Second Update (3/15): I tried another sample and phase detection autofocus works a lot better on this one.  Maybe not as good as I would expect, but the keeper rate is considerably higher. If this would have been my first copy, I probably would have never noticed (as I would not have looked at it that critically).  The noise is surprisingly a little worse than on my first copy and matches that of my T2i exactly.  So I bumped it up a star, but not back to the original 4 stars, given the existence of QC problems and lack of improvement in sensor performance.===========================================================================================================================Update: While I was able to get some nice shots in earlier sessions (primarily with the 400mm lens), I did encounter the autofocus problem now that others have noticed with faster lenses.  It seems to be limited to the center autofocus point, but in certain shooting situations, it missed focus in about 30-50% of my shots. In comparison, my old T2i, while not perfect, missed only 3% with the same shots and lens and the 6D was perfect.  I wanted to like it and gave it a few more tries and chances, but the results were consistent (in a bad way).  Not acceptable in my book.===========================================================================================================================I understand that the \"game changing\" capabilities of this camera are on the video side, but I don't shoot a lot of video and there are plenty reviews out there on that topic.  Just briefly, I did try it out and it is a tremendous step up. I was able to take well focused and shake-free footage with both the 18-135mm STM kit lens as well as my 24-105mm L lens, without really trying much...My main review though is for the still image use and comparing it to my aging T2i (which this will replace) and my Canon 6D.  I have not had the camera for long, so I'm not covering close to all features, but focus on the primary ones (80/20 rule).It was between the T5i, 60D and the 70D for me, prior to picking the 70D.Pros:- While just a bit smaller, the body is almost identical to the 6D, with similar layout and pretty much the same feel (which I love).  For some, who want more ruggedness, such as found in the 7D or 5D's, this might be a negative.  However, if I look at my trusty Rebel T2i, which has been used in rain, on the beach, thrown in the backpack on many bike rides and abused in hours and hours of astrophotography sessions (usually covered in frozen dew), it still looks and behaves almost like new.  So I think the 70D will do just fine.- Touch flip screen. I like my buttons and I am slow to adjust to what the touch screen offers, but I am catching on.  Especially selecting the focus point by touch is a nice feature.  Responsiveness is just as good as on my iPod Touch.- Auto-focus. I have not explored it in detail, but out of the box it works great.  I often take photos of birds in flight and I got a lot more keepers compared to my other bodies.  The camera was tracking nicely when shooting a low flying eagle against the background of trees and fields.- 7 fps.  Works like a charm (after I got used to the somewhat tinny sound of the shutter).- Good kit lens.  Comes surprisingly close to the 24-105mm L lens, but with a wider range and a lot lower price.  I posted a separate review under the individual lens item on Amazon.  In summary, well worth it the extra money.- Wireless.  Same as the 6D.  Using your smart phone or iPad/iPod as a remote, without much complications, is something that I got hooked on with the 6D.- Long exposure behavior (I use it for astro pictures at 2-5 minute exposure) is really no difference to the already great T2i.  Some stated concerns that the new sensor design (with the split photodiodes per pixel) might have a negative impact here. But based on first tests, it does not.Cons:- Image quality is pretty much the same as with the T2i.  Now, the T2i has great image quality (especially based on the year when it came out), but noise and dynamic range are practically the same. In fact, I can't tell the difference between unprocessed results from both sensors, even at 100%, for ISO 800 and below. Only for higher ISO and longer exposures one can see a little improvement (but not much more than you can expect in variances from the same sensor model).  The only significant difference is that DPP takes a lot longer to generate the high definition view...  Now, in a way, that still justifies having a full frame camera (and I prefer the smaller APS-C sensor for astrophotography and wild life), the 6D is just an order of magnitude better when it comes to image quality, but one could have hoped for some improvements over the last 4-5 years here.  Others have done it.Note: Some report significant low light performance improvements over the older 18 MP sensor, but you might want to check the noise reduction settings in DPP.  For the same camera settings, the 70D produces much more aggressive image settings than my T2i, which makes the 70D performance look much better at first glance.  Setting noise reduction to 0 (or the same value) for both, will make such differences mostly go away...Overall, the additional features (such as wireless, better auto-focus, better body, LCD display) make it worth the higher price compared to the T5i and 60D (at least the first two here) to me, but ultimately, you can probably take the same quality still pictures with all three (at least if the subject is not moving too fast...).", "Date": "February 17, 2014"}, {"Title": "Technological Masterpiece", "Author": "cocre", "ReviewID": "R34VIG7JLS363C", "Overall": "5.0", "Content": "You can read long detailed reviews elsewhere, I just want to add my two cents. At first I compared the Canon T5i to the Nikon D3200 and settled on the Nikon, but when I went to hit the order button the price of the Nikon kit had gone up by several hundred dollars so I went the next level up and started over. After much research I settled for the Canon 70D over the Nikon D7100. As a straight up still camera, the Nikon holds the edge, but when all things are considered I thought the Canon the better fit for me.I really like the built in wireless. You can use it with the Canon apps to take simple shots or the third party DSLR Controller app (Android) and control many if not most of the 70D functions from your droid phone or tablet. The autofocus with the STM kit lens is so quiet, you think is must not be working. It also works perfectly while shooting videos where the focus changes during the shot. Absolutely no noise from the lens is picked up in the audio. The onboard flash is weak, but when coupled with the Canon Speedlite 430EX II flash they can work as a master/slave team and “talk” to one another to provide superb results.The Canon 70D is a technological masterpiece. It produces excellent quality stills and videos under a variety of conditions. I highly recommend the product.", "Date": "November 25, 2013"}, {"Title": "Great camera all around with only minor issues.", "Author": "Dan", "ReviewID": "R1UL2AIV3RRLUO", "Overall": "5.0", "Content": "My main camera is the Canon 5D Mark III and currently have been using the Canon 7D as my backup camera. I purchased the Canon 70D to compliment/replace my 7D for my video/photo projects.I have been very pleased with the 70D and do have a full review on my website learningcameras.com with sample images and raw files for download so you can see the quality.Overall, the camera is an improvement in every way from the 60D and even an improvement on the 7D in terms of image/video quality. Noise levels are low, even when shooting RAW and the video quality is great though not a vast improvement. It did suffer from moire so keep that in mind. Noise levels in video were an improvement on the 7D but about what I have seen from the Nikon D7100 which is good up to 1600-3200 ISO. The live view AF works perfectly and was tracking objects without an issue. It works even better when tracking faces which is nice. Overall the camera is a great improvement and a worthy competitor to the Nikon D7100. The Nikon D7100 has a bit more pro feel, build, and features like dual SD card slots, but the Canon 70D held its own with more consumer friendly features like great video AF and WiFi.", "Date": "September 10, 2013"}, {"Title": "Fantastic New Camera", "Author": "Joshua D. Liberman", "ReviewID": "RX25SWBTY33G3", "Overall": "5.0", "Content": "If you do not HAVE to have a full frame DSLR, this is the best Canon APS-C DSLR ever.  Even better, if makes a great second body if you shoot full frame but want to have more options for your existing lenses.  Remember, with a multiplier of 1.6, your 200s are 320s, and your 85 portrait lens becomes a 135 sports lens!  Though it does share the same batteries and of course, flashes, with the 6D full frame, it does not share battery grips, remote releases, etc.  Same on you for that little slap in the face, Canon.Overall, just a fantastic camera with several minor improvements over the 60D and all the earlier xxD models.  It would be nice if Canon would adopt a consistent naming methodology though!", "Date": "October 30, 2013"}, {"Title": "HDR Shots with the Canon 70D", "Author": "M. Martin", "ReviewID": "R4FIE4IQCKJMB", "Overall": "5.0", "Content": "I’m impressed this camera automatically takes bracketed, different exposure shots and combines them into one image three different ways – ranging from (1) fully automatic, (2) some control (both in-camera processed), then (3) auto taken for post processing in software such as Photomatix. (1) Fully automatic uses the Special Scene Mode (SCN) called HDR Backlight Control mode. Three continuous shots are taken at different exposures then in-camera processed into one JPEG image, with a wide tonal range, that minimizes blocked-up shadows and improves highlights. (2) With more control options, use the HDR (High Dynamic Range) Shooting mode found under the camera 4 tab. Again, three images of different exposures are automatically captured then in-camera merged resulting in a single JPEG image. This mode allows selection of the exposure range to as much as +- 3 EV. It also allows for doing this once or for every shot until the setting is disabled. You can also select whether the images are Auto Image Aligned (in-camera) or not. (3) The camera also does Auto Exposure Bracketing (AEB). Under the camera 3 tab, turn the dial to set the exposure range. In the Custom Function Settings C.Fn 1-5, the number of shots taken with AEB can be changed from the usual 3 shots to 5 or 7. When set at 5, you can vary the exposure all the way to +-6 EV. Shots can be taken in RAW and/or JPEG, saved to the memory card for post processing in your favorite software.", "Date": "October 13, 2013"}, {"Title": "Just what I needed!", "Author": "D. Tomczak", "ReviewID": "R2JBKSV40Y7XIN", "Overall": "5.0", "Content": "After reading everything that was out there about this camera, I decided to buy one. I wanted more shots per second and this baby flies. Beats my 5D Mark 2 hands down. I love the new focus system, it gives me nice sharp pic's right where I want them. Of course it took me a little while to figure out just how to use this camera correctly, but I am very happy with it and it works with all my lens, price was right in my book. I pull this one out before my Mark 2. Hope this helps you.", "Date": "October 2, 2013"}, {"Title": "Great DSLR !", "Author": "Dr Fareed Rajack FRCS (Glasg) Ophth", "ReviewID": "R3663T1FWFFTHO", "Overall": "5.0", "Content": "I had this on my wish list for a short time when I noticed the price reduction, and I snapped it up . I am upgrading from a T5i, and this camera is seriously amazing ! I would advise that you learn how to use it first, by reading the books available . I have NO problems with the autofocus , and the pictures are crisp and sharp as ever . I saw people complaining in their reviews - Again you have to know what you are doing .This is not a point and shoot . Also I got a spanking brand NEW camera from Amazon .It's a good thing I ignored some of those negative reviews and am now the owner of one superb camera . Now if only Amazon can get the Tamron 150-600mm for my 70D !", "Date": "May 2, 2014"}, {"Title": "Solid buy for a new shooter looking to learn", "Author": "Michael Demaio", "ReviewID": "RY9J85F8X972V", "Overall": "5.0", "Content": "This is a great camera and the packaged kit lens is quite good if you get the 18-135mm. The price is a little high at $1500 but chances are you can snag it for $1200-1300 sometime. I thought strongly about buying this or the Nikon D7100. In terms of dynamic range and overall still quality/sharpness the 7100 is a little better. If pictures are really your only concern than you may be better off with that model. In terms of an overall package though - the 70D is hard to beat at this level.I give the final edge to the 70D based on the complete package you get. IQ - the 7100 is a touch ahead. The 70D is better in many areas though - namely usability. The 70D is so easy to use and change settings with, thanks to the capacitive touch screen which is just like the touch screen on a nice smartphone. The 70D has great high ISO performance with usable shots up to about 6400 ISO or maybe even a touch higher (personal use of course). The 70D is one of the best cameras when it comes to video as well. This is one area where the 70D beats the D7100 quite badly. Pair this camera with an STM lens and you've got camcorder like video on a DSLR.The 18-135mm kit lens gives you a great range as a walk around lens. For casual photographers this lens + a fast prime (50mm 1.8) will probably be all you'll ever need. If you're into other types of photography such as landscape photography then you'll want a 10-22, 11-16, or a long telephoto for wildlife like a 55-250 (budget option), etc. There's a good bit of distortion on the wide end, but if you're a casual photographer it doesn't matter much, and you can always fix it easily in lightroom or photoshop. The lens is relatively sharp, especially for a kit lens.Overall, if you think you might ever want to shoot video then I'd definitely take this over Nikon, Sony, or any other manufacturer's current offerings in the price range. If IQ in still photos is your only concern then you may be better off with an offering from Sony (such as the A77) or the D7100 from Nikon.", "Date": "January 13, 2014"}, {"Title": "Superb Upgrade from XSi", "Author": "Jeff M. Stahl", "ReviewID": "R3BZ4BRG6MR3M0", "Overall": "5.0", "Content": "Amazing camera and a huge upgrade from my ageing XSi.  I recently took this camera and the EF-S 55-250mm F4-5.6 IS STM Lens to the 2013 Formula 1 Grand Prix and was simply amazed at both the photos and video I was able to capture.  Even with the cars traveling at speeds up to 200Mph, I was able to capture sharp and crisp photos that looked like I was 2' away from them.  While I have a *lot* of learning to do, I already love the camera and look forward to using it more and more as time goes on.", "Date": "November 25, 2013"}, {"Title": "Wonderful camera which suits my needs ... only minor firmware issues", "Author": "SD", "ReviewID": "R33FZ2YW4I0EQH", "Overall": "5.0", "Content": "Before I review some of the features of this magnificent camera here is my background. I am an intermediate level family photographer with advanced knowledge of computer software and tech gadgets. Canon 70D is my first DSLR which I got about a week ago. Previously I had film SLR, several advanced digital cameras and camcorders. I needed a DSLR which can capture videos and take photos in low light. I have to say this is a wonderful camera which suits my needs. Every good thing you read regarding this camera's focusing ability, video capabilities, LiveView (LV) shooting is mostly true. There are a few shortcomings, most of which I think can be corrected with future firmware updates (if Canon wishes).1. The Wi-Fi feature is great for sending photo to your phone or tablet or email or sharing on social media sites but it needs to be disabled manually for movie shooting and USB connection which is very annoying. Wi-Fi should automatically get disabled when switching to Movie mode or when USB cable is connected (with a pop-up message).2. I miss the AF assist light. Good thing is the strobe flash AF assist has a good range and works with most lens but the strobe flash AF assist has some limitations as mentioned below (apart from startling your photographed subject).3. LiveView (LV) focusing is absolutely brilliant with the touch to focus capability. But in low light AF assist strobe fires only in ViewFinder (VF) mode and not in LV mode. Hence in low light, in LV mode the camera will not focus at all! After communicating with Canon support, I tried the P mode and found in P-mode only if AF quick mode is selected, AF assist works. However in AF quick mode you cannot select a region to focus (tap to focus)!4. The horizontal level indicator is a neat feature but in LV mode there is no way to show the level while shooting (as an overlay).5. Also I didn't find a way to enable/disable flash using the \"Quick Control\" button in advanced modes such as P. It is however present in basic modes such as A+!6. While capturing video if you want to take a still photo, there is quite a few frame drops (about 1 sec as mentioned in the manual) even when using SD card with 95mb/s speed. My old Canon camcorder has \"Dual Shot\" without any frame-drop. I wish Canon could implement \"dual shot\" in this camera as well.7. In LV mode, when you are switching between still photo shooting modes using mode dial, LV switches off which is somewhat annoying.8. The 19 cross-type AF points is more than what I need but there is no way to select the AF points in Basic modes (A+, No Flash, CA) when using VF. I think including this option (at least in the creative auto (CA) mode) would have been a good thing for novice users.9. Lastly, I think it would be really convenient, if in VF mode, when you are switching shooting modes using mode dial, the LV panel could automatically show the information about that shooting mode. This will be really helpful if you are using SCN mode as there is no way to know what scene you have previously selected in the top LCD.In summary this is great camera for taking excellent quality photo and video in most situations (including low light). As Canon has incorporated so many features in this camera for the LiveView (LV) shooting, I think they need to include all the features of ViewFinder (VF) shooting in LV mode and tweak the firmware a little bit. Also I have to say, I am extremely glad I made this purchase.UPDATE (9/24/2013): Regarding electronic horizontal level indicator. It is possible to show it as overlay in Live View (LV) mode but only when you are not using \"face detection + tracking\"!!!Also when you are using continuous shooting in LV mode the screen becomes blank! The canon customer service said it is not possible to capture image and show the live view at the same time. This means continuous shoot is not useable in LV mode!", "Date": "September 13, 2013"}, {"Title": "I love this camera!* (But it doesn't play nice with 3rd party lenses!)", "Author": "Parker", "ReviewID": "R1FW55BSDFDI8C", "Overall": "5.0", "Content": "Buying a new camera is so difficult... at first i couldn't decide between this camera, or taking the plunge and going full-frame with the only slightly more expensive 6D, or just waiting for the oft-rumored but finally (apparently) confirmed 7D mark II... but i went with the 70D, and I am happy with my decision, here's why:Although i do shoot a decent amount of still photography, I mainly wanted a dslr for filmmaking and videography. If you're reading this review, you already know about the 70D's insanely cool autofocusing technology. Let me tell you this.. it is worth the hype! it definitely works. Whether you're focusing on the foreground, background, or anything in between, with just a tap of the touchscreen the 70D will smoothly and decisively pull focus right to where you want it, every time, without the nasty searching/bouncing back and forth that made autofocus infamously unusable on older cameras/autofocus systems. I think that lots of filmmakers are so used to pulling focus manually that they scoff at the idea of an autofocus system doing the work for them, but it makes nailing the shot so much faster/easier, so why not?! It has facial tracking, so you can really just set the camera up, frame your scene and roll, and have all the confidence in the world that whether your talents are approaching or moving away from the camera or whatever, they will stay in perfect, crisp focus. This allows me to shoot faster lenses at really wide apertures for that glorious shallow depth of field all dslr filmmakers lust after, and not worry about the talent's face going out of focus with the slightest head bob.I bought the 70D body only without the STM kit lenses most are shipping with. On my nifty fifty canon 50mm 1.8 i get fantastic image quality, but the lens motor does make a bit of noise, that can sometimes be noticeable. This is the same with my Tamron 28-75 f2.8 (fantastic lens for the 70D, by the way)(<-- SAD DAY!It's actually not, see edit below) but it doesn't matter much to me since i record audio separately away from the camera with a zoom recorder anyway, and just sync later in post, but apparently these new STM lenses are whisper quiet, so they would take care of that focusing noise, if it mattered to me. At some point i plan on purchasing the 40mm 2.8 STM pancake lens, because i hear it's a great bargain lens for this camera, and it wouldn't hurt to have that silent shooting option if needs be, but for now the main lenses that i use, the 50mm and 28-75mm, are just fine on the 70D.I also really like the articulated touch screen, it is so convenient! My first night of shooting with the 70D i had to stand on a rickety ladder and hold the camera up above my head to get the shot that i wanted. On a normal camera this would have been impossible as i couldn't see the screen, but not on the 70D! it was a cinch to simply flip out the screen and rotate it down to easily pull focus and see what i was filming. It can also be very useful when you have to be in front of the camera, and are still trying to control what goes on behind it, as you can just rotate the screen all the way forward, and not to have to pester whatever unlucky friend you roped into helping you film your project every five seconds about what the shot looks like, lighting, focus, etc.I have read several reviews making the bold claim that the 70D is in fact the greatest APS-C sensor camera...ever. I have to say that from the little time i've owned it, i can see why. In the past i have mostly shot on on an older 7D. Head to head, the 70D barely edges out the 7D, but yet the 7D is still like four or five hundred dollars more! The 70D gets you 2 more megapixels, the articulated touch screen, wifi onboard (which i have yet to use, but still) and of course the wondrous video autofocus, as well as the ability to shoot stills in live mode, which is very cool. Both cameras are weather sealed, so there's that. I do miss the solid built-like-a-tank magnesium body of the 7D, but the 70D is simply a better camera all around, and as it should be, it's like 5 years newer!Some reviewers have mentioned that the quick control wheel/dial thing feels cheap and rather chintzy, and i have to concur, it's definitely the 'cheapest' feeling part of the 70d, but with the the other dial on the front near the shutter button as well the touch screen i never really have to use that dial anyway, so it's not really a big deal.Photography wise, i am getting fantastic photos, as i expected. A nice fast frames per second shooting speed and a large enough buffer make shooting lots of pictures very quickly in RAW a breeze, and thus far the camera has performed very well in low light conditions. I have yet to really test the high iso-to-noise ratios, but i expect to perform decently in this aspect as well.Overall, i am very, very pleased with my purchase of this camera. If you're into filmmaking and can't afford a full frame camera, this is the one for you. The autofocus makes everything very easy, and i have heard of filmmakers that prefer this camera over their 5D Mark III. Now I'm just waiting for MagicLantern to get updated for the 70D's firmware and  I will be a very happy man.Edit:A word to the wise: There are well-documented problems with 3rd party lenses (i.e Tamron, Sigma, etc.) functioning properly while recording video on the 70D. I have to return my new Tamron 24-75mm lens because of this problem. It shoots stills just fine, but the moment i try and shoot video, after a very brief period of time (like maybe 30 seconds to a minute) the camera will stop recording and display the dreaded error message \"please ensure that lens is properly attached\". While this seems like it's more the lens manufacturer's fault than canon's, all the same, if you have pricey, high quality 3rd party lenses, or are thinking of purchasing some for this camera (let's be honest, so much cheaper than canon's own lenses, it's really hard not to) just don't be surprised if they don't play nice while shooting video on the 70D. :(", "Date": "February 24, 2014"}, {"Title": "This camera will spoil you.....", "Author": "Floyd Goodrich \"Jim G.\"", "ReviewID": "R2W940TNQUM48L", "Overall": "5.0", "Content": "I've owned a lot of different DSLR cameras like the Rebel XT, T3i, 5DM2, SL1, and some Sony NEX and Panasonic FZ cameras too. I've had my 70D for about two months and like others have said this is darned near a perfect camera. I love the video this camera makes, its a game changer with the new sensor and Canon STM lenses that are completely silent while taking video. I have the 18-135mm STM and its a stellar all around lens. This camera makes taking pictures or video in low light easy, no visible noise at even very high ISO. The swivel touch screen makes changing modes very easy, no more menu diving for most adjustments.Yes this 70D is a major breakthrough with its duel sensor, its the fastest focusing camera I've ever owned and the focus is perfect all of the time or at least 99.9% of the time. Great burst rate of 7fps and the on board flash works well. This camera will serve me well for quite a few years I suspect.", "Date": "December 24, 2013"}, {"Title": "The one you have been waiting for...", "Author": "Nerdy Dad \"I want my toys!\"", "ReviewID": "R11UV6EFH6ZT9M", "Overall": "5.0", "Content": "I'm an upgrader and a long time (10+ years) of the rebel line. I was impressed when the T-line came out. This one ups the ante for me. I'm by no means a pro, but the gamut of features on this camera makes it possible for 'semi' shooters to expand their creativity. The wifi function may be on the novelty side for now, but I see it to have a BIG potential. I have a NAS, I find it very convenient to transfer my files into it without turning my PC on. For those days you just want to off load the card and deal with post-processing later on.I've had Canon most of my photography hobby days, so needless to say image quality is my #1 like about Canon. This one continues that tradition. I will post some pictures later.It's a little bit pricier that the rebel line of course. This is the camera for you if you have been holding off upgrading to a higher line...Canon has taken some of the best features of their camera lines, form the 1D to the Rebel line and put it together in a nice package.", "Date": "October 2, 2013"}, {"Title": "Excellent Camera!", "Author": "J. L. Senn \"sennister\"", "ReviewID": "RKCM6JAYGAK8I", "Overall": "5.0", "Content": "This is an excellent camera. I will not go into all of the great features of the 70D since there are plenty of posts to extoll its virtues. However, let me give a little advise.Even if you already have compatible lenses, I encourage you to get this camera WITH one of the kit lenses, not body only. Here is the reason: the two options for kit lenses are STM lenses, which are made to be absolutely silent during autofocus. And on the 70D, the autofocus is used a LOT during video capture. My non-STM lenses are very very loud when I use them on my 70D to record video - enough to make them nearly unusable for video. So I highly encourage anyone who is looking to get a 70D to get it with one of the kit lenses. When purchased with the body, you get a nice discount on the lens. I have the 18-135 and it is a great lens. Canon does not have many STM lenses at the moment, so don't expect to find many alternatives for video other than the kit lenses. I hope this helps.I upgraded from a 20D, so this is night-and-day difference for me. Also, the amazon price was $1200 when I bought it - and I am surprised that the price has dropped at all.  Great deal on a great camera.", "Date": "November 30, 2013"}, {"Title": "Excellent Quality Build and Impressive Photos", "Author": "Susy", "ReviewID": "RP2KEPRWFOJ9B", "Overall": "5.0", "Content": "TOUCHSCREENI love the touchscreen on this camera. It's surprisingly accurate, responsive, and fluid. For previewing pictures, it recognizes pinch and zoom and swipe gestures. It's large and bright with a very sharp display.ISO CAPACITYThis camera has amazing ISO. I spent Christmas at a relative's house with a new baby. Unfortunately, the whole house was dimly lit, so I was glad the 70D had some great ISO. I used 3200 ISO with a 60-80 shutter speed to get the exposure right and came away with some great baby shots. The noise in the photos is minimal and the color in the photo is still vivid and accurate.WIFI CAPABILITY & SETUP EFFORTAt first I was disappointed with the WiFi on this camera because it was kind of complicated to set up the first time (no thanks to the vague instruction manual - try YouTube for better tutorials), but once I had it set up, it's been great and connects quite quickly when WiFi is enabled. If you're out in the field without Internet, you can set the camera up to act as a WiFi access point to preview or transfer photos to your smartphone or tablet. However, if you're downloading pictures to your device, a real internet connection will be faster than using the camera as an access point. I think there is room for improvement with the WiFi system and I'm sure they'll be streamlining it in the future.KIT LENSI haven't used the kit lens much so I can't elaborate on it a lot. I usually shoot with a 24-105mm lens, so this lens feels a little cheaper than the L quality I'm accustomed to. But overall, it seemed like a nice lens and shoots nice pictures.BATTERY LIFEWithout WiFi the battery life is quite good. I could probably do an entire day of shooting with the WiFi off without changing batteries. With WiFi on (especially when the camera is acting as the access point), the battery goes pretty quickly. However, as long as you have a backup along, you'll be fine. I purchased two off-brand batteries as backups to the Canon battery, and I've never been left stranded yet and I use the WiFi a lot.SUMMARYOverall this is a great camera and I highly recommend it!", "Date": "January 3, 2014"}, {"Title": "Perfect mid-range DSLR", "Author": "qban", "ReviewID": "R12FAGM0M8JZJ5", "Overall": "5.0", "Content": "Coming from a T2i the image quality is excellent (specially in low light). Colors are very bright but of course can be turned down for a more natural look if you desire. Viewfinder AF works extremely quick coupled with either USM or STM lenses and it also works under very dimmed lightning, very impressed. The camera's overall performance is fantastic, shot to shot is very fast even using the built in flash it doesn't hiccup.Now to Dual Pixel AF I have nothing to compare this to, so needless to say i think its the greatest thing since sliced bread. It works as advertised, very quick and precise, specially with STM lenses. With USM it works very well, but you can still see it hunt for focus sometimes. I do not shoot video very often, but i do find Dual Pixel AF very useful  when shooting macro because i can get the camera in very tight spaces with no need to look through the viewfinder. Now to what it does NOT do... while it can keep track of a subject on screen (for instance a dog or a person) for objects moving quick, or when panning to shoot an object, it lacks the speed of the viewfinder AF.Loves:Performance -shot-to-shot, Image quality, low light quality, speedSwivel screen - Once you have this. you will never want anything elseTouch screen - touch to shoot pic comes in handyWiFi - remote control the camera with your phoneDual Pixel AF - Works as advertised, definitely great for video or difficult spaces where looking through the screen is easierMultishot noise reduction and HDR", "Date": "September 2, 2013"}, {"Title": "Very good camera with only a few minor issues.", "Author": "Robert Benda", "ReviewID": "R2RD4RU7LM3KF7", "Overall": "4.0", "Content": "As a family camera, this is an excellent choice.  It's well made, easy to use, and the focus is very good - no hunting and pecking but smooth and quick.For video it's live auto-focus is excellent - use the swivel touch screen to keep the focus on a moving subject.The only reason I didn't give it 5 stars are the button layouts make it a little counter-intuitive to find and change manual settings like white balance.Of course it's not as good as a full frame camera like the 5dmarkii in low light, or for it's dynamic range.  However, it's still very good.", "Date": "December 11, 2013"}, {"Title": "I love the 70D", "Author": "James A. Boone \"Jimbob\"", "ReviewID": "R3HIFQWHRATRQD", "Overall": "5.0", "Content": "I had the 50D before I had this and could never get more than about 60% good pictures I would call good.  With the 70D I cal achieve more than 80% good pictures without even trying.  The color and gamma are about perfect.  All that needs to be done to finish pictures is to resize them.I give this camera 10 stars.", "Date": "October 14, 2013"}, {"Title": "Great camera", "Author": "Jamie Katz \"Jamie Katz, reader and writer\"", "ReviewID": "R1OZQJGAN0I642", "Overall": "5.0", "Content": "I purchased this to replace a 60D, which I really enjoyed.  But I wanted better video performance and better high speed focusing as my daughter zips around on a spirited young horse and will be competing a lot this summer.  So I picked up the 70D just before the holidays.  Don't know exactly why, but I ended up with an array of excellent (for me) photos, both of people (not staged) and of a snowy beach scene at sunset.  The landscapes were probably the finest and most distinct I've ever come up with.  Perhaps it's just that the lowlight capability of the 70D is stronger, but I've been delighted with how well the camera performed (in really cold weather, I might add).  And I haven't even had a chance to put this to the horsebacking riding test--though I got some lovely bird shots.  So all in all, I haven't begun to truly tap the full capacity of this camera, but it has already proven to be a stellar performer.  I'm an enthusiast who has little time for post-processing and who can only take photos on weekends, so I don't pretend to be particularly knowledgable.  But I've learned enough about horse photography, in particular, to have a few folks want my photos for their websites--and the 70D looks like it will expand the range in which I'll be able to operate.  No problems yet, nothing that I've found problematic.  Just a really good camera that will take me years to really learn but will provide me with strong photos and videos.", "Date": "January 6, 2014"}, {"Title": "A nice step up", "Author": "Szoo2", "ReviewID": "R176OKM4E06B5Q", "Overall": "5.0", "Content": "My first Canon DSLR was an EOS 40D that I bought in 2007 to photograph my daughter's senior year as a collegiate gymnast. I really liked it as there was no shutter lag and burst speeds help get the action. I thought about upgrading as I got more into wildlife photography, especially birds. My photos were never quite consistently as sharp as I wanted even shooting from tripod, etc. I passed on the 50D and 60D, and thought about going full frame with the 6D or 5D MkIII.  But I had too much money invested in APS-C lenses and the crop factor helps get me a little closer.  When the 70D came out, it had doubled the pixel count of my 40D, an innovative dual pixel focusing scheme, significantly increased ISO, WiFi and a tilting LCD screen. I can control the camera with my smart phone when shooting from tripod to reduce vibrations even further.  It shoots HD videos, uses the more compact SD memory cards, has in camera HDR and lots of other new features not found on my 40D or earlier successors. My photos are sharper, shutter is very smooth and it is physically slightly smaller and lighter than the 40D.  All of which I am enjoying every time I use this camera.", "Date": "March 22, 2014"}, {"Title": "Better than expected", "Author": "Dominic Mcfadden", "ReviewID": "R3JBR891348810", "Overall": "5.0", "Content": "I had a T2i T3i and currently own a Canon 6D.  This camera surprised me because of its fast focus system.  I read other reviews and people try to compare this to other cameras.  I must say it's in a different class.  Obviously my 6D kills it in low light and of course it's a full frame camera.  The 70D has a faster focus system and the video is amazing because of the tracking system.  This is as close as you can get with a dslr instead of a camcorder.  I was really shocked at the pics.  Don't listen to the negative reviews.  Cameras serve different purposes and if you want an all around camera to add to your existing line up, you won't be disappointed.  Do what I did, just get it!!!!!", "Date": "March 15, 2014"}, {"Title": "Amazing Camera", "Author": "Sage Wheeler", "ReviewID": "R1Q9ZS75IRDQIE", "Overall": "5.0", "Content": "I'm a semi-pro user, I mostly do weddings, engagements, and baby shots for friends.  It's not my day job, but I have pretty high demands.  Other than not being a full frame camera, this 70D is nearly flawless.  Combined with the Sigma 18-50 2.4 lens, I shot about a thousand flawless photos over the last week (engagement photos, birthday party).  The auto-focus (which was horrible on my 40d) is spot on 99.9% of the time.  I couldn't be happier. The color is nice, though I did tweak the vibrancy a bit on most my photos, but they were true to life, I just like my colors bolder. The resolution was adequate for my prints up to 30 inches. The bride and groom were very pleased at how \"easy\" it was to walk around and shoot a bunch of photos without having to do a lot of re-shoots and lighting fixes.", "Date": "May 29, 2014"}, {"Title": "Auto White Balance is Almost Perfect", "Author": "D.H.L.", "ReviewID": "R1FSGZJZVMKO85", "Overall": "5.0", "Content": "One of my gripes over the past years with digital cameras has been the AWFUL automatic white balance.  I had Canon 20d, 30d & 40d and Pro 1, G6, G9 and G11, Sx50 HS, Pentax ist, Panasonic FZ200, and i.m.h.o. all their auto white balance was horrible.  Just to get any accurate white balance with any of them, you had to work hard with it and even raw wasn't simple, even in after processing. -- My point; pay this much for a camera, and it better have auto white balance that \"works\", right off the memory card.  Well this is the first of this breed that I have seen work, and as you saw above I went through a bunch.  This works well, and the plethora of upgraded features from the previous models is, well \"what I expected from these things years ago\". I'm kind of sick of putting up with these issues this long, but hey, \"finally accomplished\" is better than never.", "Date": "January 22, 2014"}, {"Title": "Great camera", "Author": "DMac", "ReviewID": "R3J89XZAU7DRV9", "Overall": "5.0", "Content": "I highly recommend this camera. Have been using it for a couple months now and it's doing things my Rebels couldn't do. Like auto bracketing for HDR post processing. Great high speed shutter for kids' sports. Pop up flash is always available for portrait fill outdoors (or indoors). Nice combination of auto-modes and fully manual modes. I've been waiting and watching Canon camreas for many years. Have been a Rebel user all these years, putting my money into their L lenses, but not pulling the trigger on the camera body until one came out that had the best feature set and price combination. That camera body, for me, is the 70D. Have shot a couple months now and am completely satisfied with the photos this captures. More importantly this camera combines ease of use with many \"auto\" modes along with total manual controls as well. And the pop up flash gets a lot of use as a fill in outdoor portraits without having to lug around a separate flash unit. Great high speed shutter for my kids' sporting events. Great exposure bracketing for HDR shooting.", "Date": "February 3, 2014"}, {"Title": "Big upgrade from 50D", "Author": "T. Artrip", "ReviewID": "R2CXEP1M4L05W0", "Overall": "5.0", "Content": "I just upgraded from my Canon EOS 50D to this camera.  What jumped out at me upon first use was the improvement in autofocus.  It just seems to \"know\" which part of the picture I want to focus on (problematic with the 50D).  It is also smaller, quicker and produces better images.  Much improved button layout, too.I haven't used the movie-mode capabilities, but am looking forward to doing so.  The Wi-Fi capabilities seem intriguing, too, especially the ability to remotely control the camera from a smart phone.I've kept my 50D, but I may never go back :-)", "Date": "December 28, 2013"}, {"Title": "Superb Camera", "Author": "Lih Fong", "ReviewID": "R1C84MJV86FG20", "Overall": "5.0", "Content": "High ISO enabled good pictures in indoor. Extremely fast focusing speed. Built in Wifi allows sharing photos with smartphones and you can also use the smartphone as a remote. Definitely worth the money", "Date": "December 26, 2013"}, {"Title": "70D What a great camera!", "Author": "J. Kendall", "ReviewID": "R8DUV7FSECJXL", "Overall": "5.0", "Content": "Great camera - much better than the rebel series that I have been using for years. The bigger size makes holding it easier but it takes a whole to get used to the control locations.", "Date": "December 2, 2013"}, {"Title": "WOW!", "Author": "fvaron", "ReviewID": "R1LJE45K92AR05", "Overall": "5.0", "Content": "I was an amateur and now an enthusiast/semi-pro. Previous body was a XSi Rebel and have been looking to upgrade for the past year. Finally decided on the 70D.  Wow wow  was my first impression shooting people/nature scenes this weekend. Like any new system there is the typical learning curve but very easy to use. I feel like a kid at Christmas! I also recently purchased the Sigma 18-35mm lens and combined with the 70D has turned into a fabulous combination! Take the time to carefully read the manual on setting it up. The EOS iOS app for the live view capture is a faster connection versus the CamRanger. Haven't checked the antenna range yet versus the CamRanger (100' vs. 150'). I would highly recommend this camera for those upgrading from the Rebel series.UPDATE on video: I have had little experience with using video on a DSLR but shot one today of a model rocket launch and the autofocus worked as it should.As for an earlier comment about this camera being a game changer....YES!!", "Date": "September 1, 2013"}, {"Title": "Amazing camera - buy the necessary additional equipment", "Author": "Brady", "ReviewID": "R2WECZ5K8B5J4K", "Overall": "5.0", "Content": "This camera is amazing. I'm just an amature that likes shooting video and pictures. This camera delivers exceptionally well on both fronts. In addition to this camera I bought a bunch of stuff (manfrotto 561 monopod, video mic pro shotgun mic (in hindsight I should of bought the stereo mic instead), external flash, video led light, 2 L brackets for mounting mics and flashes, h1n audio recording device (btw this is how you work around the fact the camera does not have a headphone jack -- buy a headphone jack splitter put it into the H1N and have two cords come out, one as head phones and one straight into your camera. I also bought a camera bag to hold all the stuff, lens filters to protect the lenses, and a 50mm 1.8 lens. I love my set up. I can shoot pretty much anything I want (i.e. hand held with the L brackets and stationary shots using he monopod). In total I spent around $2300. If you have the dough, drop it! You won't regret it.", "Date": "January 8, 2014"}, {"Title": "70D Fun and flexibility!", "Author": "Scott Anderson \"Sharpsburg\"", "ReviewID": "R38PJ7NH3HLLRN", "Overall": "5.0", "Content": "The Canon EOS 70D borrows many features from the Canon lineup.  It has built in wifi, but no GPS, fully-articulated touch-screen display from the T4i, which is very versatile, crisp and fully functional.  The 63 zone metering system and movie quality are also brought over from previous models.  I do like the design which flows over from the 60D which was a design change from my 40D.  It's lighter than the 7D since it's not made from magnesium alloy.  The true pleasure is the 7fps continual shooting, to capture a wide variety of shots at a faster clip than previous models.The greatest feature however is the large CMOS 20.2 Megapixel sensor with Dual Pixel AF capabilities.  I'm not too versed in the camera lingo but I can honestly say the tracking speed and live stills is incredible, and the camera really allows a novice Photographer to really put forth some high quality images.  I also like that it's smaller and lighter than the 7D.  I've never owned one, but have held the model at several times and was not impressed with its heft on my neck.I like the system and the price range.  I have paired with several lenses from my t4i and enjoy the quality of build, and features this camera brings to the market.  I wish I could have taken part in early reviews of this system so I could have been working with these awesome features.  Canon certainly has a high quality lineup, and has gone the distance in putting forth a lower priced high quality camera for the masses.  I'll update my review as time permits, so until then enjoy!Update:  The review was before the camera walked off.  Perhaps having a Canon label on the neck strap is not all that's wrapped up to be.  More like a walking advertisement.  If anyone from Canon sees this and wants to take pity on me, I'd gladly accept.", "Date": "August 28, 2013"}, {"Title": "Excellent upgrade for Canon owners", "Author": "Dpietro", "ReviewID": "R1I7IJLO4M0W1F", "Overall": "4.0", "Content": "Over time I have migrated up the line of Canon DSLR cameras from the early Rebel series through to the 60d (the 70d predecessor).  As such I am heavily invested in Canon compatible lenses so any thought of switching to another brand of camera body such as Nikon or Pentax is really out of the question.  So for anyone comparing the 70d to any cameras from competing camera manufacturers this is not the review that you will find most helpful.  But for those who may be considering moving up the Canon line or hopping in for the first time hopefully I can help.  From the first use the 70d is an impressive camera.  It looks, feels, and can operate much like the 60d that I owned previously so I could use it right out of the box.  But as I become more familiar with the 70d I am finding the upgrades from the previous generation are significant and useful in actual use.  The touchscreen is much more than a gimmick, it is my go to method of set up when I turn the camera on.  I can immediately see my settings and make alterations with a touch of a finger.  I find autofocus to be faster and more accurate with all my lenses than had been the case with the 60d.  I appreciate the ability to fine tune the autofocus plus or minus if any lens combination were to yield consistent front or back focusing issues.  I really like the revision to the autofocus point selection options in the viewfinder.  Gone are the red dots that the 60d had replaced by what I find to be more useful squares with increased options for point selection including a zone focusing mode that the 60d lacks.  Net result is that I have more \"keeper\" shots than before.  I tend to default to the viewfinder for my composition but the Live View option on the 70d is so good that I am using it as well.  Simply compose a shot, touch the specific point on the Live View screen and the 70d can be set up to quickly focus on that spot and shoot.  The sensitivity of the autofocus points in Live View is also excellent, arguably more accurate than what can be achieved through the viewfinder.  Finally a word about Video performance.  Spectacular!  Again the upgrade from previous models is significant with better focus tracking and wonderful HD performance.  One caution, some third party lenses may not work well in Video mode or may have other compatibility issues with this camera that did not show up on the 60d.  My Tamron 28-70 VC and 18-270 PZD for example failed to record video with this camera body.  In my case Tamron service was aware of the issue and under warranty upgraded my lenses firmware and now everything works perfectly.  But I suggest checking first if you intend to use third party glass on this body", "Date": "February 23, 2014"}, {"Title": "A Joy to Operate", "Author": "Robert Summers", "ReviewID": "R2E0EZHU542ZVZ", "Overall": "5.0", "Content": "I have purchased a series of Nikon DSLR cameras over the years, but decided to purchase this Canon EOS 70D camera based on the good reviews of its video capability. I have not been disappointed. Videos are excellent. However, I've been surprised to find that the thing I like best about this camera is it's ease of use, particularly Canon's implementation of the LCD monitor touch screen. Every feature of the camera can be easily and rapidly accessed on the LCD monitor touch screen with no menus to manually scroll through. It even implements iPhone-like viewing of images you have taken. Simply squeeze two fingers together to display more than a single photo, of drag your fingers apart to return to a single photo. Going from Nikon to Canon is like going from a Microsoft PC to an Apple PC. It just works. It is a joy to operate.", "Date": "February 22, 2014"}, {"Title": "Another winner from Canon", "Author": "F. Ehorn", "ReviewID": "R3CCFFPH94T66C", "Overall": "5.0", "Content": "It was time to upgrade from my trusty, but dated 20D.  The 70D has proven to be just what the doctor ordered; namely, way more megapixels, larger and articulated LCD panel, a useful touchscreen for making adjustments on the fly, enhanced focus point layout, many of the same controls I am used to, etc.  One very fine feature is the ability to use the LCD screen to provide extra sharp focus.  Just hit one button, pull out the screen and zoom in to the area you wish to be in perfect focus.  Note, not every AF lens in your bag finds 'exact' focus in the real world!  That can be a big deal when you are doing the family portraits, for example.  The list of adjustments and features available are more extensive than I am willing to describe here.  (It is always wise to download the .pdf operating manual before you buy, IMHO.)  This camera also has capabilities to take HD movies, although that is not my personal reason for buying this camera.  Most of my work is done with a tripod and with a cable release.  Highly recommended by this experienced amateur.", "Date": "February 5, 2014"}, {"Title": "Excellent camera at a terrific price.", "Author": "Robert Hanks", "ReviewID": "REOURJIA4LK9J", "Overall": "5.0", "Content": "I purchased the 70D with the 18-135mm lens a few months back and paid much more than Amazon's current price of $1,249. THIS IS AN EXCELLENT MID-LEVEL dSLR AT A PHENOMENAL PRICE!  Since my purchase, I have continually checked features and pricing of comparable cameras from Nikon and Olympus.  They are higher priced and do not have the quality of this camera.  While it may take a while for a beginning amateur photographer to learn how to use all the numerous features, it is well worth the learning experience.  Being able to produce high quality photos, however, is almost immediate, thanks to the many automated controls built in.  And while this camera has only been on the market for a short time, there are already numerous how-to books available written specifically for the 70D.  I know you will enjoy working with this camera.  It certainly justifies the high ratings.", "Date": "January 1, 2014"}, {"Title": "Perfect upgrade from T2i", "Author": "Christian J. Paul", "ReviewID": "R1WE16W71DNUN3", "Overall": "5.0", "Content": "This is a perfect upgrade from the T2i.  I love this camera.  It has a fast focusing system and the 7fps is great for sports shooting.", "Date": "December 29, 2013"}, {"Title": "Marvellous", "Author": "Miguel", "ReviewID": "R3S6MSGBISGGJ1", "Overall": "5.0", "Content": "I have been using this camera during a couple of days and i can say only good things about it. Very good quality pictures", "Date": "December 29, 2013"}, {"Title": "Great camera", "Author": "Leo Chaillou", "ReviewID": "R7CHQITHSD3IP", "Overall": "5.0", "Content": "Traded up from a 40d.The images are fantastic grabs focus fast video is easy to use will recommend to friends", "Date": "December 27, 2013"}, {"Title": "*insane Gollumesque giggling*", "Author": "Brian Connors", "ReviewID": "RTXJ57XXFMU93", "Overall": "5.0", "Content": "Canon would like you to know that they can make a 40 megapixel image sensor. They just see no reason to, as they have better things to do with chip real estate.Canon's finally delivered a DSLR that combines the best of still shooting and video without compromising either, although it seems to have knocked their product matrix sideways by rendering the 7D irrelevant. For sports photographers, the blisteringly fast frame rate for still shots is competitive with some very expensive gear indeed. For videographers, video quality is excellent and isn't limited to the 4GB/12 minute shot limit that previous Canon cameras were stuck with; the half-hour recording time is more than enough to make sure you can get a long sequence all at once without having to worry as much about losing some of it between shots. And the autofocus function is one of the most sophisticated I've seen -- the touch screen enables insanely easy spot focus, and though I've not tried it myself, my understanding is that it does quite well with moving objects. Canon has also chosen to opt out of the megapixel wars once again; 20.2Mpx is only a modest upgrade from the 18 that was standard on their previous generation of APS image sensors, but you'll need to invest in some extremely expensive lenses in order to have a reason to care about the difference. (Incidentally, the new 18-55mm STM kit lens is sweet -- fast, silent, and straightforward. It is focus-by-wire, though, so if you're not a fan, get the body without a lens.)It does have a few downsides, but I don't feel like they really affect the star rating. One is that the wifi function is absolutely byzantine -- you will definitely want to read the (separate) wifi manual, and at least in the initial firmware it lacks the web interface that the Wireless File Transfer modules for Canon's higher-end cameras have. (It also supports EyeFi cards, presumably because Canon already had the drivers in the OS build and didn't see a need to take them out.) Another is that I have yet to find an on-screen live audio monitor; Magic Lantern has traditionally provided this as a third-party addon, but they have yet to hack the 70D, so you may have to do some black magic with cables and headphones to get usable audio monitoring. (It also does not yet seem to be supported by gphoto, meaning that using it on a Linux system is likely to be exciting in all the wrong ways.)So, on the whole, this isn't yet a hacker's camera, but for pretty much all regular purposes, it's damn close to perfect. It's pricier than the Rebel series, but if you've got the budget it's worth it.", "Date": "December 17, 2013"}, {"Title": "Best AF available at this time in a SLR", "Author": "Marty", "ReviewID": "R1HHM5V2JM8MRT", "Overall": "5.0", "Content": "AF system is amazing. I moved up from a 4Ti. Definitely worth the price for a mid level SLR. If you want to take video pictures, this is the only SLR available at this time, where your subject will remain in focus as they move. Still pics and features also top notch.", "Date": "December 16, 2013"}, {"Title": "Amazing picture quality!", "Author": "Mona Cawley", "ReviewID": "R35ZL1L7P69DNU", "Overall": "5.0", "Content": "I love the new Canon EOS 70D!  It is an upgrade for me from the EOS XSi and I must say the photo quality is amazing.  The range of the ISO and the shutter speed is great and the difference it makes in the picture quality is amazing!  I am an amateur photographer but am growing in my skills and was ready for an upgrade.  For the money I think this camera is well worth it.  There are several bells and whistles so if you are not used to the range of creative settings and usually shoot in the automatic settings you would probably better with a cheaper DSLR.", "Date": "December 2, 2013"}, {"Title": "Great upgrade!", "Author": "R. Certain", "ReviewID": "R1GZ3ES6FKP0SU", "Overall": "5.0", "Content": "I had a Canon Rebel T3 and was looking to upgrade my camera. Really liked the higher MP count and the fact that this camera had a touchscreen. Yes, it is a crop sensor, but that just means I have to stand back a little farther. For what I typical shoot, this hasn't been a problem. The addition of the touch screen makes it much easier for me to adjust settings. As with most Canon cameras, this has tons of settings that can be adjusted to suit your needs. The higher MP count is great... if you plan on making large prints. For most people that will buy a camera just to put pictures on the internet, the 20.2 really wont' make much of a difference to them. But for photographers, both pro and enthusiast, that want the ability to produce some nice size prints for clients, this camera will definitely do the job. The camera is comfortable to hold, and is lite but doesn't feel cheap. I believe it is still mostly plastic, but is well built. I am definitely happy with this purchase.", "Date": "November 4, 2013"}, {"Title": "Fantastic even without a magnesium body!", "Author": "JynX", "ReviewID": "R15KGXT3FLQQWB", "Overall": "5.0", "Content": "I have a Canon 50D that I have needed a replacement for and was happy when I heard they were releasing the 70D. To my surprise it was not going to have a mag body just plastic.  I had my concerns being that I fall a lot due to medical conditions and coming from the 50D. IM AM DELIGHTED with the 70D! It has a hefty and rugged body feel and touch. Does not in any way feel like the Rebel line bodies. Its the 50D replacement I have been waiting for!", "Date": "September 17, 2013"}, {"Title": "Incredible camera", "Author": "BlueAggieFan", "ReviewID": "R1AQ8TVFVM8IVE", "Overall": "5.0", "Content": "I purchased this camera as an upgrade from the Canon EOS Rebel XTi that I've had for the past several years. I was trying to choose between this and the 7D, but opted for the 70D because of the ability of the camera to have continuous autofocus while shooting video.Although the Rebel XTi has been a great camera for me, I wanted something that would give me a higher resolution, as well as higher ISO speeds which help with the low-light situations at my kids' indoor sporting events, dance recitals, and plays. I also thought it would be great to capture video without having to carry around a second camera. Well, this camera not only met my expectations, but it blew them away!I love the quality of the images and the autofocus seems to be nearly flawless at finding and tracking moving subjects (like dancers and athletes). The low light performance is fantastic with the noise levels almost unnoticeable even at ISO 6400. I no longer get motion blur like I did with my old camera, even when I set my aperture at f/2.8, and the maximum ISO, and only got 1/80 of a second shutter speeds.Additionally the video quality has far exceeded my expectations, although the built-in microphones tend to pick up more ambient noise than I would have expected. Still, this is easily corrected via an external microphone.This camera has even been a great choice for my wife. She is a complete amateur at photography and even her pictures taken in full-auto mode have been fabulous.I would highly recommend this camera to anyone (amateur to prosumer).", "Date": "May 24, 2014"}, {"Title": "AMAZING CAMERA", "Author": "drossa", "ReviewID": "R1K3VCB1PKUBCP", "Overall": "5.0", "Content": "BUY THIS CAMERA! I had a Rebel XS and was in the process of upgrading. Looked at the 60d and the 7d and the this just came out and did the research and it was a no brainer. Better than the 60d and the 7d for only $1000. It has built in wifi that syncs to your phone, tablet and computer. Can control camera from a App that has a remote trigger. Has the upgraded 19 pt focus system, 20 mega pixels and the list goes on. The swivel screen I thought might be a annoyance but I do not think twice about it. If anything it is an added bonus for video needs if ever, why not! Body is not too big and not too small, just right! If you want a bigger body then just get a added grip, problem solved. AWESOME CAMERA, NO REGRETS!", "Date": "May 22, 2014"}, {"Title": "Great Camera", "Author": "Scott Comins", "ReviewID": "R3N1GJH8PTM1P1", "Overall": "5.0", "Content": "I have been a prosumer photographer for years. In 2008 I got my first DSLR, Nikon D90. A month ago I sold it and upgraded to the Canon 70D. Part of my work is product photography and the 70D is working great. Great exposure, focus is good and the ease of wi-fi file transfer is icing on the cake. Battery life is great with the wi-fi turned off. I shoot, then turn on the wi-fi to download the images to extend battery.  I have not had the opportunity to fully test the video capability, but the few short clips I tried looked great. I do like the active focus while filming. The kit lens (18-135) is quiet. I haven't edited any of the video, so I do no know if the lens sounds show up on the video.", "Date": "January 19, 2014"}, {"Title": "Great camera", "Author": "Jim Ryser", "ReviewID": "RDLVVVGNHUU2B", "Overall": "5.0", "Content": "I received this camera for Christmas. I am a hobbyist photographer, not a professional.  I have an EOS 50D which I have liked a lot and shot thousands of pictures that were sharp, generally well exposed and focused and the camera is rock solid.  The 70D is a little lighter weight and the grip on the right side feels much better, very comfortable for my hands.  The menu and controls are a little different so there is a learning curve in using the camera.  So far it feels faster in focusing and setting exposure, The focusing has many more points to consider and required me to adjust to use it effectively.  The colors are better and exposure is better and requires less adjusting later.  I really like the level feature and it has almost eliminated straightening photos.  The swing out LCD is a nice feature that I had way back when on my Canon PowserShot G3 that I liked and missed when Canon discontinued the feature.  I am glad to see it back.  I haven't used the WiFi or Movie features yet.  I plan to set up WiFi but am not sure it will improve my work flow.  It will be interesting to give it a try.  Movies have not been a medium that interest me, but now that it is available I plan on learning about it and giving it a try.  Bottom line, the camera is more complex than the EOS 50D and requires more study and experimentation to get the most out of it.", "Date": "January 8, 2014"}, {"Title": "The Goods", "Author": "MB \"MB\"", "ReviewID": "R2ZSMXD0X2PQR1", "Overall": "5.0", "Content": "I upgraded from a Canon T2i and this camera is awesome.  It's bigger than the T2i and the upgraded features are excellent.  Love the flip out rear touch screen LCD.  The STM lense is super quick and very quiet which great for video work.  The auto fucus is just what I wanted and a large reason I picked this camera.I used this in an all day wedding/reception recently and it was flawless.", "Date": "February 3, 2014"}, {"Title": "As Great As Advertised!", "Author": "Ed Pie. \"nkdgolf\"", "ReviewID": "R2DRPI9UISCXRM", "Overall": "5.0", "Content": "I am a current T4I owner.  Saw the reviews of this camera and decided it was a needed upgrade.First off, I watched the price of the body and kit lens go way up AFTER the holiday season.  I wanted the \"body only\" and quickly found the price of the body only was still the same.  So, being the smart person I am I immediately bought the body only at $949.  Within a few days the price of the body only (after the holiday) went to a current price of $1199!Not sure about the politics of the price increase or decrease but as a pretty experienced photographer I can say this is a awesome camera.Fast focus is unbelievable and low light photography with the right lens is amazing.Have toyed with the video and it appears it is as good as advertised but will report back more later.If you have a T4I or T3I or even a T5I and are looking for an easy upgrade this is it.", "Date": "January 19, 2014"}, {"Title": "Bang for the buck!", "Author": "Sir_King", "ReviewID": "RP0O80CIZXH3W", "Overall": "5.0", "Content": "Attention Canon 7d lovers! This camera is for you. The AF and shutter speed was designed with 7d enthusiasts in mind. Looks and feels great. Great and fast auto focus. i believe 19 pts. High iso pics definitely look better than the T4i, T5i and even the 7d. The 7d is slightly faster with continous shooting but the 70d makes that up with awesome video and the ability to focus on a moving subject and keeping the rest of the frame in focus. Do yourself a favor and pic this up. Its a keeper!", "Date": "January 11, 2014"}, {"Title": "MY favorite camera!!!", "Author": "Kenny S. \"Kenny S.\"", "ReviewID": "R19XMHZO11GITP", "Overall": "5.0", "Content": "I love this  camera !!! I used to own the Canon 20d and was great at photographing weddings and events. I took a break and tried out the Nikon cameras. I could not master it so i am back to Canon and this new camera is amazing! I love it !!! I have a 50mm lens and will be getting better lenses....", "Date": "December 17, 2013"}, {"Title": "Takes excellent pictures, especially for an amateur like me.", "Author": "Jason", "ReviewID": "R29U6M7SLOHDVA", "Overall": "5.0", "Content": "Excellent camera. I'm no pro, but the initial pictures I've taken make me look like one. I have pictures of my daughters with the depth tuned to blur the background and the pictures are amazing ... using fully automatic settings. In the hands of a pro this would be an even better camera.", "Date": "November 25, 2013"}, {"Title": "This is a great camera for the price", "Author": "Rackmoon", "ReviewID": "R2WQ6O1B83F5P3", "Overall": "5.0", "Content": "Was considering getting the 5D mark III, but it was a little over my price range. This camera does everything the more expensive camera does... Great pix... Movies... plus you get 1.6 mag factor which means a lot when you shoot wildlife as I do. It has performed flawlessly for me, and I'm getting some great reviews on my pictures! The low light performance is way beyond what I was able to get with my last camera... the 40D, which I loved dearly. (actually, I still have the 40D, but have not touched it since I got the 70D)Since the menus and operation are similar between the two cameras, it was a snap to get started with the 70D. The main difference is being able to shoot movies now... flip one switch and press the record button! Can't get much easier than that! Way to go Canon!", "Date": "February 24, 2014"}, {"Title": "Great Camera!", "Author": "ChrisRT", "ReviewID": "R17PLJ81H04NFE", "Overall": "5.0", "Content": "I purchased the Canon 70D just before Christmas last year to replace my previous camera that was ten years old.  When researching my purchase, I initially thought I would purchase the Canon T5i, but after reading various reviews, I decided to go for the 70D.  I figured that as long as I was investing in a new DSLR camera, I would go for the extra features of the mid-level 70D.  I am not a professional photographer, but I was looking for good, high quality photos and I knew the 70D would give me all that I was looking for in a camera for many years to come.  I went with the 18-135mm lens, as it will give me the best overall range for just about any photos that I will want to take.  On the first day of shooting photos, I did a quick look at the info with the camera and decided to try taking some night shots of Christmas lights, just to see what I would get.  I ended up with some very nice photos, without even using a tripod.  On general photos, the quality has been excellent.  The speed of the 70D is also very fast.  I had hated the lag time when taking photos with my old camera or cell phone camera, but that is not an issue at all with the 70D.  I have a lot more to learn about using the 70D and its many features and capabilities, but thus far I am very impressed and highly recommend this camera.", "Date": "February 9, 2014"}, {"Title": "A Good Step Up", "Author": "D. White", "ReviewID": "R1QUBQMMTQY33D", "Overall": "5.0", "Content": "As a long time Canon user, I was ready for the next level of performance for both stills and video. So far the 70D has met or exceeded my expectations. The articulated touch screen makes live view, video and menu settings very convenient. While I often use the P mode to shoot with specific ISO settings and aperture or shutter priority for their specific functions, I have found the full Auto performance to be very impressive and usually leave it as my default setting.The HDR (High Dynamic Range) scene function has proven useful and is much more convenient than the old method of taking individual images and doing post processing in the computer.Because the flash often will pop up when taking pictures in Auto that have any back lighting, I appreciate the \"no flash\" dial setting as a convenient way to keep the flash disabled.I have not shot extensive video yet, but the test clips I have done are all well focused and great resolution.I look forward to enjoying the 70D for some time to come.", "Date": "December 8, 2013"}, {"Title": "Upgraded from a Rebel T2i to 70D - Very pleased", "Author": "Laureli", "ReviewID": "R28PT7ZBAJLMAW", "Overall": "5.0", "Content": "This was an upgrade… I use a sigma 30mm 1.4 and often keep my aperture at 1.4.. with my t2i I often had an issue with it focusing at that aperture.. however the 70D takes MUCH CLEARER shots and is super easy and self explanatory to use.  It has some amazing added features, also.  I love the autofocus on video. I have two young kids and this is a great bonus.  I'd recommend it to someone who is looking for a nice upgrade, for sure!!", "Date": "October 23, 2013"}, {"Title": "So glad I broke down and got this", "Author": "Remittance Girl", "ReviewID": "RU0LNYXXPHUT0", "Overall": "5.0", "Content": "I spent years trying to get the best I could out of my old Canon Rebel 400D, but I finally bit the bullet for this one. And I'm so glad I did. I've spent the last three weeks photographing pretty much everything and all the shots make me look like I'm actually a decent photographer.", "Date": "December 13, 2013"}, {"Title": "Great camera- maybe a challenge for novice", "Author": "Glenn Stevens \"Annandale\"", "ReviewID": "R3B0EZD0G6BG60", "Overall": "5.0", "Content": "I just purchased this beauty with the 18-55 STM lens and the 55-250 IS lens kit.  This is my first DSLR, making the jump from point and shoot zoom camera (Panasonic FZ100).  I am very impressed with the image quality in low or ambient light, where the ISO is under 1000.  What I am trying to figure out however is how to zoom while in autofocus? The camera was attractive to me because of the revolutionary auto focus (AF) feature (which works great) and the ability to do video recording without have a camcorder.  Well for the camcorders/ zoom camera with video taping capablities I have used, I am able to manually adjust the zoom to pan out or in on my subjects. However in reading the literature I am warned not to adjust the zoom rings when in AF mode.  So unless I am missing something, how can the camera be comparable to a camcorder?11/30 UpdateSo I have had more time to work with the camera and getting used to its ergonomics.  I strongly recommend that if you are not familiar with the Canon ergonomics to play with it for a while and acclimatize yourself.  There are lots of buttons and dials to press and turn plus the LCD touch screen options, so you have a lot of ground to cover in just knowing what and when to press what. But not to worry, for beginners devote the time to understand the fuctions of the buttons, dials and icons (it is like learning a foreign language, increased use is required for mastery).  I am working with the A+  (Automated) basic mode for starters, (which essentially makes the camera a point and shoot) and reading the instruction manual as I go along. (Yes that is a must as you tend to press buttons and you can get unexpected results).  So I have video-taped (and yes I was able to use the zoom rings on the lens to pan in and out) for the most part th AF works brilliantly, as I was moving the camera across the objecs in my viewing area it failed to focus as it could not make up its mind what the primary object was due to a change in the backdrop as the camera moved horizontally across the plane of view. That is so minor, but I thought you should know and I doubt very much if some will notice this) The quality of the images are very impressive and moreso if you use the Canon supplied software to do some post edting. I take the pictures both in RAW format and JPG to get a sense of comparision.  Please note RAW takes up more memory than JPG.  I also purchased the PNY 62GB SXD memory card, I would rather have more than less. So I may post additional updates as I continue to use the camera.  I will be going to the Caribbean next week, which will give me ample opportuity to test the camera even more.12/1  UpdateSo the journey continues and I am really liking this camera, especially once you get over the initial shock and adjustments to the ergonomics and user experience. Canon engineers put a lot of thought into making thi a powerful \"easy to use\" camera.  Dare I say read the supplied instruction manual on the CD (not the handbook) and with camera in hand to cover each section slowly until you get familiar with the settings and usage.  I ued the telephoto 55-250mm IS supplied kit lens and was blown away with image accuracy and quality of the close up shots. I did some close ups of outdoor and family indoor shots under varying lighting conditions and in all instance great images. Once you have played enough with the A+ (Fully Automatic Shooting) mode, I recommend going to the SCENE (Special scene) mode and work through those settings  (Page 81 on the PDF instruction manual). Again each scene mode has auto features enabled (Aperture setting: measuring how much light is allowed to hit the sensor ( f/1  to f/5.6).  The smaller the denominator the wider the aperture, hence allowing more light from the subject to fall on the sensor). Shutter speed, how long th shutter remains open 1/x is also set automatically, as well as the ISO setting.) If you are new to DSLR I strongly recommend you spend some time understanding what these 3 terms mean and how they influence the quality of the picture taken.  As promised I will provide an update once I return from my Caribbean trip, based on what I have seen so far I am excited.", "Date": "November 28, 2013"}, {"Title": "Great Entry Sports and Wildlife Camera", "Author": "George Duke \"The Shooter\"", "ReviewID": "RASMDQDBGKG0U", "Overall": "5.0", "Content": "I take sports and wildlife photos  with a 7D , so I'm comparing Canon 70d camera to the 7d.pros (for sports photographers)- Very good price for this type of camera- 7 frames per second is fast enough for sports. Of course  faster is better but it will do for a beginner.- Noise handling at high ISO is very acceptable for sports photos.- I like the  focusing and keeping focus on the action, and in my humble opinion it is good or even better than the 7D.- I love the touch screen.Cons:- Plastic body.- Absence of joystick. I use the joystick on 7D to move focus points to compose the quick action. You  need to use the top wheel on 70D which makes it considerably slower.I think this  is a great  beginner camera for sports and wildlife photographers. Put a nice L series lens and  and you're on your can start making your  professional looking  photos.", "Date": "October 5, 2013"}, {"Title": "Built in Raw image processing and Multiple Exposure mode", "Author": "robert ryan \"robsphotos\"", "ReviewID": "R2UJ18PTHE8FU9", "Overall": "5.0", "Content": "I'm lazy and don't like the read manuals but came across a video on features of the camera i just bought and i love the built in RAW iamge processing and the multiple exposure mode. I sold my Canon t4i and stepped up to the Canon 70d and this was a great move. Very impress that every shot is sharp and in focus. I thought my eyes were getting bad, but no, it was the camera and the non STM 18-135 lens.", "Date": "September 14, 2013"}, {"Title": "Amazing Camera", "Author": "Michael & Crystal", "ReviewID": "R3J2B0NRPT6NCZ", "Overall": "5.0", "Content": "I upgraded from the aging Rebel XTi and the improvement is difficult to put into words. This camera/lens produce amazing photos and videos.  The auto-focus is superb and completely quiet with the STM lens. I purchased the 50mm 1.8 with this camera and although the AF is too loud for video, it is a great complement to this camera with the wide aperture.  I can still use manual focus for video with the 50mm.I have heard about one issue with the 70D on wide (>2.8) apertures.  The issue is reported to be with the view-finder not focusing as clearly as possible compared to live view.  I've been unable to reproduce this issue on the 18-135mm STM lens that came with it as it's max aperture is 3.5.  However I have seen a slight difference on the 50mm if I zoom to 3:1 in Lightroom.  Honestly, I don't feel this issue should deter you from purchasing, the camera is amazing.  Canon will probably respond with an update to resolve the issue as they have in the past.  Since the camera is obviously capable of correctly focusing, so a firmware update should fix the problem.I have loved the camera and finally fill the need to push my photography skills to the next level and use Manual mode more and more often.  Thanks to Canon for an amazing product and Amazon for quick flawless delivery.", "Date": "March 6, 2014"}, {"Title": "Absolutely love it!", "Author": "Yoav Sagi", "ReviewID": "R1XIPNRF953KRR", "Overall": "5.0", "Content": "I have upgraded from the 30D, and in one word - WOW. This camera is fabulous: the noise in high ISO is very low, it is full of great features (WiFi, focusing, user configurable modes, and many more), the movies it produces are just outstanding (the dual pixel technology really works!), and the ergonomics is very nice (better than the 30D, in my opinion). In short, if you have the money to spare, buy this camera and you will not regret it.", "Date": "December 26, 2013"}, {"Title": "Perfect camera for serious photographer", "Author": "Emily Brewer", "ReviewID": "R2JLFH87CDYMS9", "Overall": "5.0", "Content": "This is the first SLR I have owned, and it took me a long time to decide what model to purchase.  Canon was a no-brainer - I wouldn't buy anything else.  I use a T3i at work and was impressed with its functionality, but wanted something a little more professional for my personal use.  Photography is my favorite hobby/passion, and the review that sold me was someone who said that the 70D was \"a camera to grow into.\"  That's the perfect summary for this camera.  It has the auto settings for amateur photographers but also plenty of creative settings if you want to try something new.  I used this at my cousin's graduation this past weekend - gymnasium pictures are notoriously impossible to take, but all the pictures turned out perfectly.  I've enjoyed learning more about my hobby through this camera - and I am certainly growing into it!", "Date": "May 19, 2014"}, {"Title": "Great camera!", "Author": "edgar", "ReviewID": "R3I3A2Q1FFSOMH", "Overall": "5.0", "Content": "Great buy highly recommend you buy itexpensive but its well worth your money!only bad thing i would say is not being able to use the wifi feature with videos", "Date": "April 30, 2014"}, {"Title": "Upgraded from a Canon Rebel XS", "Author": "Astanax Tahlmarine", "ReviewID": "R1SAEKV5OM42PA", "Overall": "5.0", "Content": "I went the Canon DSLR route due to looking at astrophotography. The entry level camera recommended on a particular website, at the time, was a Canon Rebel XS. The website was of course outdated. However, I found a Rebel XS on clearance, and so bought it. After accumulating four lenses, I kicked myself for not waiting to buy a Nikon instead. It had all the bells and whistles and the Rebel XS was bare bones. I didn't realize how bare bones until after I bought it. It did force me to learn how to do things manually, however, rather than depend on Nikon's automatic features such as snow, sand, fireworks, etc. scenes mode.Earlier this month, I decided to get a new camera. Of course it had to be a Canon that could fit my previous four lenses. So I looked, and was going to get a 60D, but the online store was out of stock. So I found the 70D. I liked it more because it boasted the auto focus mode like a camcorder, and could shoot video, something sorely abesent on my Rebel XS but prevalent on my earlier model point and shoot camera that was made before the Rebel XS came to market. I did a comparison at a certain website, and the only thing that the Rebel XS beat the 70D in was weight, and that it could turn on and be ready to go just a little bit quicker. I also got the 18-135mm STM lens for video. The lenses I have are very noisy despite two of them being hypersonic motors as their focusing.My only real upset with this is that the infrared remote requires me to be in front before it will take the photo. Maybe it is something all cameras with an infrared sensor has problems with. I was able to utilize the wireless aftermarket shutter remote that I bought for my Canon Rebel XS, and use it without having to manually switch the camera to turn on the infrared sensor and wait for the two second mark. That was a nice surprise, because I thought it wouldn't work.I still have to get used to the focusing bit. Some photos, like one reviewer said, are indeed soft, and I notice it on the black rectangles/squares when I thought it was in focus in the viewfinder, and the photo simply is not. However, the viewfinder size, as well as ISO setting is way beyond my Rebel XS, with a few nice features (Miniature mode and HDR mode is my favorite) thrown in. I wouldn't say the photo quality is much nicer in my opinion, because I have printed out two 11x14s and I really cannot tell a quality difference from 10 MP to 20.2 MP at that size. It could also be attributed to the glass I'm using. I saw one man with a Canon T3i taking photos with a Class L lens while I tested my 70D at a butterfly exhibit (Florida) and so I believe he was getting better photos with the glass being a lot better.For the Nikon users whom might get on here and say that this particular camera sucks, I've been to three different tourist attractions, and for some reason, I've seen only one or two Nikons in a sea of Canons. So apparently Canon is doing something to win over these tourists to Florida. I even helped a woman with her Canon EOS 60D due to it being very similar to the 70D.", "Date": "March 20, 2014"}, {"Title": "Great Camera for Pro and Novice alike!", "Author": "Daniel", "ReviewID": "R1ADGB22SJ6VEX", "Overall": "5.0", "Content": "I bought the Canon 70D upgrading from a Nikon L820, for the purpose of enhancing my abilities in photography. I studied for about two days before picking this up, never used a DSLR, and it is incredibly easy to use. I only shoot in manual, I don't see an advantage with the other modes. Most people know when it is time for them to upgrade. If your camera does not do what you want it to, it may be time. My Nikon L820 only takes good photos with the flash, or in great light, and its video was just terrible. The 70D takes amazing pictures with its 20.2 MP sensor, video looks exactly as seen by the naked eye. Although video does have moire when filming fine lines or even lines that are close together. While filming landscapes or indoor environments pretty much non existent. Auto focus is great, manual focus is great. Video is about average when indoors or in low light, but that's to be expected. First DSLR, worth every penny!If I can figure out how to put up pictures I will definately do so.", "Date": "March 18, 2014"}, {"Title": "Love it", "Author": "Amazon Shopper \"consumer\"", "ReviewID": "R2QF5LDV4ENLL2", "Overall": "5.0", "Content": "Go read a professional review for real information, way too much to cover here. I will give a few impressions:Coming from an older, cheaper rebel, this one is so much nicer. The size is larger - almost fits as nice as the full frame ones in your hand. Yes it is heavier, but I really don't notice the weight difference in use. The power switch is opposite, that takes some getting used to. The items that really make a difference - the shutter speed is so much faster, almost too fast. I get 2 or 3 shots when I only want one - although that does work in my favor from time to time. The \"mode\" dial requires a push and turn to change - this is so nice, I can't tell you how many pictures I lost due to the dial turning while putting/removing it from the case before I realized what had happened. The ability to tune the focus on a per-lens basis - way cool. The WI-FI function is not very easy to use, and really slow - not something you'll use to download 100+ shots. The focus system is also a huge step up from older rebels, although I would have preferred the center pattern selection to be a tighter grouping - I still find I have to use single center focus point for soccer games. A word about the lens bundled - yes it is silent, I means really silent when focusing - like spooky silent. It does the camcorder focus hunt from time to time (although there are deep menu options with this camera to influence the focus selection criteria (although not as many as the 5D Mark III's...), you'll probably never dig that deep to change them in real time shooting situations.). Now if Canon would ever release the updated 100-400mm lens.....", "Date": "March 7, 2014"}, {"Title": "exceeds expectations", "Author": "Bill Hansen \"Bill Hansen\"", "ReviewID": "R26ZCUUX1TT3RP", "Overall": "5.0", "Content": "Moving from a Canon 50D to the 70D, I've had a lot of learning to do, but it's been enjoyable and worthwhile. The 70D's sensor and focusing are so much better than those of the 50D that the photographic experience is much more enjoyable for me. (Disclaimer - my use is for action shots; someone who takes landscapes and photos of other relatively static subjects would probably be completely satisfied with the 50D.) Image quality and high ISO performance are a delight, and the improvements in how the cameras Menu and its many features can be accessed make it easy, almost intuitive, to use most of the camera's many features. Very highly recommended.", "Date": "February 1, 2014"}, {"Title": "Amazing camera!", "Author": "Larry Bradley", "ReviewID": "RSANPTCVBOG3F", "Overall": "5.0", "Content": "Moving up from my old T1i was the best move for me.  The new focusing capabilities are incredible.  I also have found that in low-light situations it can have some occasional difficulties obtaining a sharp focus but I can switch to manual in those instances and get the picture.  Extremely fast shutter action, quiet, 7+ snaps per second.  I had been drooling over the possibilities of getting a 7D for a year but when the 70D caught my attention it was all over.  I have not tested the WiFi yet but will soon.  The touch screen is the best feature Canon added to this camera; simply swipe through photos, pinch to zoom... Setting changes are so quick and easy.  The size is a good bit bigger than the T1i, but not nearly as heavy as the 7D.  You won't go wrong with the true HD video capabilities either.  Buy this camera!!!", "Date": "January 16, 2014"}, {"Title": "OK I was scared.", "Author": "Lab Tech Mom", "ReviewID": "R10HR1LB276P2D", "Overall": "5.0", "Content": "when I bought this camera, I was scared to buy something I thought I was maybe overspending on a product I would not need.  This camera has won me over and it works great.  If you read all the hype, when you get it you will be a little disappointed it doesn't have a scratch your butt button isn't on it.  I ended up putting more money into a camera than I had planed, And my nervous stomach ache is gone.  I bought the right one.  What is crazy it isn't even that expensive for what it does.  I do recommend getting a bundled lens it is cheaper than trying to hunt for them online.", "Date": "January 14, 2014"}, {"Title": "very good", "Author": "KB P.", "ReviewID": "R31LTMCA6SWO8Q", "Overall": "5.0", "Content": "I have not had much time to use this beautiful camera... However in the times I have Wow awesome! Its a bit small if you're use to the Mark III so it has taken some adjustments. I love the fact that its not as heavey and bulky.", "Date": "January 10, 2014"}, {"Title": "As Perfect As IT GETS!", "Author": "Bestbeast333 \"Mr.666\"", "ReviewID": "R38N90SOT3EXTB", "Overall": "5.0", "Content": "I'm a beginner to photography, and this camera is extremely user friendly.  You do have to know some of the basics of how DSLR cameras work.  This one makes going through the menus so much easier.  Simply put:  I LOVE MINE!", "Date": "December 17, 2013"}, {"Title": "Perfect for action and video (video is unbeatable)", "Author": "Andrea Kirschke", "ReviewID": "RNL6VEXKS48DT", "Overall": "4.0", "Content": "This Camera I perfect for action photography it is super fast and the autofocus is always right on.The wifi function is very nice but just a gadget for fun.The live view focus is super fast and and combined with the touch it is unbeatable in video and live view mode.The feeling in the hand is similar to the on find in the 5d III it is just way lighter.Another big pro is the variety of lenses, because you can either use the pro lenses with the ef connection or the cheaper ef-s lenses, where canon just recently added the new stm type which is as quiet as the pro lenses, which is nice for video, and a lot faster in focusing then the older ef-s lenses, which is nice for action. Yes they are not as fast as the l-lenses/pro lenses but they are a lot cheaper and for that money it is way better then anything else.The only thing that is a little bit sad is that already with an iso of 3200, you can notice a strong noise.", "Date": "June 1, 2014"}, {"Title": "AWESOME!!!", "Author": "Andrew Pierce", "ReviewID": "R1V6C5UTCEPGAN", "Overall": "5.0", "Content": "I started off with a T3I and upgraded to the 70D for the video, but this camera is just amazing all around. Now I just have and use the T3I for back up. Highly recommended!!", "Date": "May 29, 2014"}, {"Title": "Great camera and lots of features, problem with wi-fi connectivity", "Author": "Reginald G Myrick", "ReviewID": "R2FROH03ZMYVU8", "Overall": "4.0", "Content": "Camera takes great pictures and has lots of great features.  Had to return it to Canon to have them check out the wireless operating capability since I am unable to sync it to my laptop.", "Date": "May 22, 2014"}, {"Title": "Excellent", "Author": "GUSTAVO I GUZMAN G", "ReviewID": "R2P1DVELSWOFA8", "Overall": "5.0", "Content": "The quality and que materials is so good, meets the specifications of the website and sending fulfilled in time. I am satisfied with my purchase.", "Date": "April 21, 2014"}, {"Title": "Excellent", "Author": "GUSTAVO I GUZMAN G", "ReviewID": "R2P1DVELSWOFA8", "Overall": "5.0", "Content": "The quality and que materials is so good, meets the specifications of the website and sending fulfilled in time. I am satisfied with my purchase.", "Date": "April 21, 2014"}, {"Title": "Impressions after one family travel event", "Author": "speddu", "ReviewID": "R1BP72POYNYIHE", "Overall": "4.0", "Content": "Please note that this review is just my personal opinion and I might be wrong. Also I have not compared it to any products by Nikon - the review below is only for Canon folks.I will start with the negatives first.The Ugly:Plasticky Dial :Canon- Please use metal for the heavily used parts.The Bad:Noise: There is considerable noise in low light both in photos and videos.(realistic low light conditions like indoors during evening time)  . Not sure why canon is trading noise for megapixels.I am very disappointed with the amount of noise at this price pointMoire: It was unbearable in some shots (especially the Ocean shots)LowLight Focus: Even with 50mm/1.4 the camera struggled to get focus of dimly lit subjects.Lemon: After using my camera for 10 days the buttons on the back (Menu/Playback/Q) stopped working. They worked again when I tilted the camera at an angle and this might be because of some loose contact . I am in the process of getting the device replaced as it is still within the return time-frameThe Good:It has everything except a full framesensor.Video AF was excellent. (with decent light conditions)Color Saturation and Image quality were good (with decent light)7fps was fast enough for me.Weather resistance was useful.Tilt screen was useful.18-135 lens image stabilization seems to be good. during some video shots I didn't expect the video to be stable but i was surprised to see a decent shot.Pricing was goodConclusion:All the ugly and bad points (except for the lemon part) seems to be been done intentionally by cannon to balance their lineup.I was split between 6D and 70D and ended up buying 70D as I will be using all those bells and whistles than the full-frame. This is just my personal preference. In general Full-Frames are better.Most likely in a year or two we will see a full-frame from cannon having the same 70D features. that is a combination of 6d and 70d (today that is 5d, but expensive for non-professionals)Advice:For Families:if you are looking for a camera to get family photos(events and travel) and are trying to buy DSLR please do your self a favor and  try the mirrorless cameras first (Cannon should be coming out with a new EOS-M soon) . DSLRs come with a lot of baggage. All the beautiful photos that u see online  are not only using DSLR but have considerable stabilizing equipment and do not forget that the photographer has considerable experience.For Hobbyists/Enthusiasts/ Price Conscious:This is a good camera for us till a full-frame with Video-AF is released by Canon.", "Date": "December 4, 2013"}, {"Title": "Great camera if APS-C-sized sensor is what you're looking for", "Author": "D. Johnson", "ReviewID": "R3GN4O1D97MGT0", "Overall": "5.0", "Content": "I love this camera.I find myself often grabbing the 70D instead of my 6D (a full-frame model) for casual shooting because my EF-S 18-135mm STM lens gives me a broader zoom range than any EF lens I own, because the camera has a built-in flash, and because the autofocus for video mode works very well.  When I get serious about my pictures I nearly always use my 6D for its better low-light performance, cleaner images, and better control over depth-of-field, but I find myself using my 70D a lot more than I ever thought I would.  It's a great all-around camera.No crop-sensor camera can match a full-frame camera when it comes to overall quality of image, but if your budget doesn't allow you to purchase full-frame, or you're doing wildlife photography (where the focal length multiplier works to your advantage), I wholeheartedly recommend the 70D.  Great image quality, easy to use, super fast in every way.If you're debating between this and a Nikon model, here are the differences... Canons focus quite a bit faster and do a better job with coloring of skin tones.  Nikons have the advantage when it comes to color for landscapes (particularly in the greens), and they have a better flash system.  Nikon tends to put more features into their cameras at a given price point, where Canon focuses more on the tried-and-true, making the cameras easy to use in favor of throwing every bell and whistle in.  Neither holds a particular general advantage when it comes to lenses -- both are great.  You aren't really going to go wrong with either system.", "Date": "March 26, 2014"}, {"Title": "All in one", "Author": "twony", "ReviewID": "R3JSYEV4N79MUE", "Overall": "4.0", "Content": "I really like the features of this camera. The still photos can't be touched. However, even thought the video side is awesome, I find it bulky and hard to balance. I have a professional Canon video camera. It's balanced and positioning of all controls makes sense for video. This camera with any attached lens does not balance well for any length of time. If you're interested in video production, buy a dedicated video camera.", "Date": "December 27, 2013"}, {"Title": "Excellent camera, build quality could use a little work.", "Author": "avEnthusiast \"avEnthusiast\"", "ReviewID": "RANWWF964WEJ3", "Overall": "3.0", "Content": "I had to get mine replaced  because the shutter button suddenly stopped bouncing back up. It would still work but it was not tactile. It's surprising because I've only had the camera for a few weeks and hadn't really taken it out of the house. Maybe I got a bad piece, I still expect better quality control for a camera that cost over a 1000 dollars two stars of for that.", "Date": "January 31, 2014"}, {"Title": "Fantastice camera.", "Author": "David Chase", "ReviewID": "R26F1Q7BK3MLLC", "Overall": "5.0", "Content": "I cant say enough about this camera and every one around me cant stop saying how great my pictures are with this camera.Its a must buy if you want great wildlife photos, cant beat 7 fps.", "Date": "October 9, 2013"}, {"Title": "Research focus problems before you buy it", "Author": "S Barker", "ReviewID": "R1SJBFOTMNCW58", "Overall": "1.0", "Content": "I got one that has the focus problem.  Based on all the great reviews, it may only be only some batches - I do not know.  All I know is that sometimes (15% of the time) I get a nice clear picture,  but most of the time the pictures are out of focus. This occurs with or without a tripod, and both with manual and autofocus.  I have tried most of the tests, micro-adjustments, and other recommendations for those with similar problems, but nothing gives me a consistent focused picture.", "Date": "May 27, 2014"}, {"Title": "The next best thing to getting a full frame", "Author": "Elizabeth", "ReviewID": "RVVHGZ8WQENZK", "Overall": "4.0", "Content": "I have used many DSLRs including Nikon. I was always hesitant to purchase one because of price and i didn't think it would change the way i took pictures. I actually purchased a T5i because of an amazing Christmas deal. But when i read a review of the 70D online, and understood the differences, i immediately knew i needed to step up to a mid-range body.The 70D is an amazing camera. Some of the stand out features are the vari-angle touchscreen lcd, wifi, 19 autofocus points, live view auto focus (Dual Pixel CMOS AF) and the the burst rate is high and consistent.I also love the fact that you get add'l buttons such as dof preview, af, drive, iso, meter mode, af on, ae lock and af point selection. These buttons are customized via the custom controls and i have mine set up for back button focusing.If you have already mastered your Txi Rebel or other entry level DSLR and want to step up without going to a full frame, the 70D is the best choice.", "Date": "April 29, 2014"}, {"Title": "Easy to use, with good image quality and lots of options.", "Author": "Rodney Cyr", "ReviewID": "R3V0AZ0MUE8S98", "Overall": "5.0", "Content": "This camera replaced my Canon 60D, which now serves as backup.  The image quality is excellent, with good, low ISO noise up to ISO 3200, and, with good noise-reduction software, up to 12,800.Although I bought it for ISO 25,600, where the image quality is adequate with noise reduction, I find its video features very good.  Most useful is its ability to autofocus while shooting video.  With my 60D, I had to focus manually, or use autofocus in still-picture mode before switching to video.  I don't shoot much video, but when I do, I like the capabilities of the 70D.I can think of three features that might be improved:1) The camera does three-shot HDR (high dynamic range) by combining three images at different exposures.  But to do this, it is necessary to switch from RAW to JPG output in one camera menu, the enable HDR in another menu.  The camera could do this automatically.  Further, I would like the camera to save one of the three exposures as a RAW or JPG image for me to work with on my computer.2) The camera has more options for choosing autofocus points than I know what to do with.  The 60D was simpler; I could choose any one autofocus point or use all of them merely by turning one dial on the camera.  The 70D requires me to push some buttons first.3) The camera is a bit heavy, but then, so was my 60D.  I new this before buying the camera.", "Date": "February 23, 2014"}, {"Title": "Great product", "Author": "isphrazy", "ReviewID": "R183J5OFH8UURF", "Overall": "5.0", "Content": "I really like the touch screen and wifi integration in this product. The operations are really easy, and I really like this camera", "Date": "February 4, 2014"}, {"Title": "Great product", "Author": "isphrazy", "ReviewID": "R183J5OFH8UURF", "Overall": "5.0", "Content": "I really like the touch screen and wifi integration in this product. The operations are really easy, and I really like this camera", "Date": "February 4, 2014"}, {"Title": "Love This Camera!", "Author": "Amazon Customer", "ReviewID": "R3R8GK2E6Q4BZ4", "Overall": "5.0", "Content": "I actually was planning to purchase the Rebel T5i when I noticed this camera was on sale.  Nice upgrade from my Rebel T1i.  I couldn't be happier with it.  I've only had it a few weeks, but so far it has worked very well.  The autofocusing system works nicely and focuses much faster than my Rebel.  But the main thing to me is the DIGIC 5+ processor makes the camera so much faster and takes much better night shots than my Rebel.  I know this is not comparing apples to apples, but it is an awesome camera.  I'm so glad that I decided to upgrade.", "Date": "January 17, 2014"}, {"Title": "Buy this camera!!", "Author": "Bucky", "ReviewID": "R1PYPYFPU16AOD", "Overall": "5.0", "Content": "If there was a 6-star rating, I would have awarded it.  The camera is everything it was advertised.  Highly recommended.", "Date": "December 15, 2013"}, {"Title": "great camera", "Author": "Carl", "ReviewID": "R3RDO0IJ0HWO7K", "Overall": "5.0", "Content": "For those of you considering this against the 60d, consider what you are doing with it.  the 60d is probably the best value on the market currently because of this camera recently being released however you you plan to do video much this camera with continuous auto focus is a must.  the other feature that is very nice to me is the 7 frames per second, having both cameras that is sometimes the difference between getting and missing a good shot.  for the beginner photographer my honest advice in the current market is to get a 60d and a nice lens.  if you can't afford a nice lens to go with it get a cheaper camera.  I am using this camera with tameron 17-50 vc and a cannon 70-300 IS L and love it.", "Date": "November 30, 2013"}, {"Title": "If you can find it, buy it!", "Author": "Joel G. Dietrich \"VED creator\"", "ReviewID": "R176SDMD8MQKYY", "Overall": "5.0", "Content": "Of all the DSLR's that I've owned and used, the 70D sets a new high-water mark.  Ease of use, clarity of pictures, combination of still and video photography make the 70D the camera for novices, semi and full professional photographers alike.  The logical choice for integrating the latest photographic technology into anyones photographic solutions.  A best buy by any measure.", "Date": "November 5, 2013"}, {"Title": "Got a used camera from Amazon", "Author": "S. King", "ReviewID": "R1E4T1SSDHXYVP", "Overall": "3.0", "Content": "OK, this is a first for me when dealing with Amazon.  I received an obviously used camera.  Yes, I bought it direct from Amazon and not from a third party.  I took it out of the box and the Live View mode wasn't working reliably: I had to reset the camera twice by pulling the battery out in the first few hours of use.  I asked Amazon for a replacement.By comparing the original to the replacement, it became obvious that I was shipped a product that someone else had already used, and possibly returned due to the problems I saw.  Here are signs you can use if you suspect similar:-The USB cable and neck strap should be sealed in individual plastic bags.  Mine were loose.-The manuals should be sealed.  There should be a CD and several errata and warranty cards loose.  Mine were all loose.-The used camera had the battery fully charged.  The replacement started charging from 0-49%.-The rear lens cap on the kit lens was marred noticeably.-The shutter would click when the live view button was pressed, but the LCD screen would stay blank.  The only way to recover from this was to remove and reseat the battery.-The first camera was set up to shoot RAW.  The default out of the box is typically jpeg.-Images taken with the camera were numbered starting at 2561 instead of 0001.-The date was set on the first camera.  The replacement asked me to set date and time.To their credit, Amazon made it right quickly and without cost to me, but the fact that it happened at all is a bit of a shock.  At the end of the day, trust the glowing reviews of this product.  It's a great camera with an outstanding feature set.  Just don't unknowingly get someone else's problem.  My guess is an unscrupulous 70D owner bought a second camera from Amazon and swapped them rather than just sending their camera in for service.  Not cool.", "Date": "June 6, 2014"}, {"Title": "Great camera", "Author": "R. Greco \"RG\"", "ReviewID": "R3BIKDW0FX7AQD", "Overall": "5.0", "Content": "I bought this camera for videography and couldn't be more happy with it. Shoots some great footage. Such an upgrade from my T5i.", "Date": "May 19, 2014"}, {"Title": "Best crop sensor out there", "Author": "Brandon C. Diamond \"BDiamond\"", "ReviewID": "R1XR94FQM1G8B2", "Overall": "5.0", "Content": "Love this camera, takes great video (my primary use) and has a great sensor and autofocus system in place. I used to turn off my AF in my T4i, but I actually get some good use out of this one.", "Date": "May 15, 2014"}, {"Title": "Excellent Camera with Great Features", "Author": "GreatIdeas \"GreatIdeas\"", "ReviewID": "R1HWDFV3H0DYDK", "Overall": "5.0", "Content": "This is an excellent camera and provides all the features I need such as HDR and High Speed shots. The camera has a good feel to it and although it is a bit heavier that previous camera I've owned it still feels good in my hands.", "Date": "May 8, 2014"}, {"Title": "Nice camera", "Author": "Andre Branco", "ReviewID": "R3VJ19TJKMH1T2", "Overall": "5.0", "Content": "Very good camera. The improvement to the auto focus system makes a big difference. It works fast, it is precise and silent. The camera also has a good grip and the detachable lcd screen is a nice to have feature", "Date": "January 31, 2014"}, {"Title": "Buy this camera", "Author": "Craige Campbell", "ReviewID": "R1QA3BY4I46HM3", "Overall": "5.0", "Content": "Most amazing camera I have ever owned. I dare you to take a bad picture. It will be the last one you buy.", "Date": "November 28, 2013"}, {"Title": "My first DSLR", "Author": "S. L. Moore", "ReviewID": "R3AHUKU91ZL99J", "Overall": "5.0", "Content": "This is my first DSLR, so you may want to take this review with a grain of salt. I finally decided to get this camera over one of the mirrorless options (I didn't go with a Nikon model, because the controls seemed more ergonomic to me on the Canons) and I do not regret my decision one bit. I enjoy doing a little macro work, along with family portraiture and some landscape photography when i have time.This camera is everything I wanted it to be and I have 0 complaints.", "Date": "October 10, 2013"}, {"Title": "Best Canon I've Used So Far", "Author": "Thomas S Macioszek", "ReviewID": "R1TVOB2DWCT47C", "Overall": "5.0", "Content": "Let me start off by saying I have never used the full frame models. I have most recently had the T3i and before that I had the XT years ago. This model is just incredible. I use it for everything... family photos, wildlife, birds and astronomy. The 7 frames per second come in VERY handy for bird shots. With the Wi-Fi feature I was able to set up the tripod just a few feet from my bird feeder and sit safely on the other side of the yard and with my iPhone remotely take pictures of the birds without disturbing them. The touch-screen display is very handy. I didn't think that would be something I'd use much, but the more I use it the more I want to use it. I use only Sigma lenses on it right now... the 30mm \"A\", the 18-200 \"C\", and the 150-500. They all work great on this camera. If you're looking for something to upgrade from the T3i, this is it (unless your budget can afford FF).", "Date": "April 24, 2014"}, {"Title": "New Canon user!", "Author": "Chris", "ReviewID": "R1ULXSJDY3I34C", "Overall": "5.0", "Content": "Coming from using Nikons (D7000 and D600), I got tired of terrible back focus issues and oil spots on my sensor. I made the switch to Canon, and so far I am extremely impressed. This 70D has some amazing features packed in for the price. The new autofocus system in live view for video and photo is groundbreaking and lightyears ahead of what my D7000 and D600 could do. Also, having built-in Wifi on a camera is something I thought I would never use, but I was wrong. This feature is so cool! It's nice to be able to shoot a photo and transfer it directly to my iPhone to edit and share! Oh, and same thing with the touch screen. \"Who would ever need or want a touch screen on their DSLR?\" is what I thought previously to owning this camera.. well now the answer to that question is quite simply, ME! It is amazing! From entering wifi passwords in on the touch screen keyboard to tapping focus in live view very similar to the way you would do so on your smart phone.. this feature is now a must have. I can't wait to use this more in the future for some videos. It works extremely well and I'm so glad I have it! Overall, I am very excited about my switch to Canon, I have no complaints thus far and the only thing I need to do now is learn this new button layout which I am not at all used to. But in the end, I know it will be worth it!!!", "Date": "March 6, 2014"}, {"Title": "Great step up from my 40D", "Author": "Bernard V. Bauer", "ReviewID": "R1U9QJ1JF964TH", "Overall": "5.0", "Content": "Extreme low light sensitivity fit with all of my prior and recently acquired canon and 3rd party lenses.  Also lie the wireless feature and the tilt screen.  This is the best camera except for my Canon Mark5II", "Date": "December 9, 2013"}, {"Title": "Love at fist click", "Author": "David D. Kay", "ReviewID": "R35M80GWLPZ2Z1", "Overall": "5.0", "Content": "I wanted this camera so bad for months and months and finally saved up the cash and went for it. I love this camera so much, takes amazing photos, touch screen, Wifi, I love it. I def recommend this camera to any amateur photographer like myself.", "Date": "April 30, 2014"}, {"Title": "My favorite SLR camera", "Author": "FS", "ReviewID": "RFEA1GZUF550A", "Overall": "5.0", "Content": "I love this camera. It takes amazing photos. Paired with the EF-S lens it takes great videos as well.  I've had several Canon Rebels and this one beats them all hands down.", "Date": "March 16, 2014"}, {"Title": "Wow", "Author": "Amazon Customer", "ReviewID": "R1TV6EU1K7Q9F", "Overall": "5.0", "Content": "I bought this for the video as an upgrade form the 60D.  This camera far exceeds my expectations.  I cannot imagine how it could be any better.", "Date": "March 5, 2014"}, {"Title": "Great Camera.  Great Features.", "Author": "Marvelous Marv \"big_daddy_marvelous\"", "ReviewID": "R3RB5VPCDOMBAL", "Overall": "5.0", "Content": "I love it.  I have used this model for several months.  I am very happy with this purchase.  I had rented a 7D in the past and this 70D feels and operates like the 7D, BUT has the articulating screen which is also a touch screen.  High quality design.  I can't say enough.  Glad I bought it.", "Date": "March 1, 2014"}, {"Title": "Excellent.", "Author": "Benjamin Monroe", "ReviewID": "R2DN02EKOYDP7B", "Overall": "5.0", "Content": "I upgraded from an XSI and felt that this was the right level of upgrade.  I researched the different models and this one best suit my needs.  I had to relearn a lot of controls because they are in different locations than I was used to.  The focus tracking is fast and accurate, a special feature off this camera.  I don't feel like I over or under spent.  It is not just a minor improvement from the XSI it is a significant advancement.  Due to the cost I would recommend  beginners consider this the high end of the prosumer grade and would recommend having experience with other SLR models before spending money on the pro level cameras; Unless you have the cash to burn, then by all means go ahead.", "Date": "February 26, 2014"}, {"Title": "So Happy", "Author": "Myra H", "ReviewID": "R10DORZ7OBTWJX", "Overall": "5.0", "Content": "I found the process of finding the right DSLR daunting.. I did loads of research and STILL didn't feel secure with any one camera. It is a pricey thing to buy on a whim, but I finally settled on the 70D and I am pleased to tell you it's a great camera. It does everything I need and more. I am a film student, so it has become my easy, low-cost way of practicing shots and editing footage. The photos come out stunning, too!", "Date": "February 20, 2014"}, {"Title": "Amazing! Does everything it's hyped to do!", "Author": "Sonofajohn", "ReviewID": "R123G3C9DBBICP", "Overall": "5.0", "Content": "I actually bought this camera on a whim with the expectation to try it out and see if it did what everyone was raving about with the expectation to send it back if it wasn't a significant step from my T2i. Its amazing! Low light blows my T2i out of the water. Live view focuses perfect and instantly! The live focusing during video is amazing! You can watch it put squares around faces and track them all over the screen focusing on them as they come towards you or away. The only thing is that if you're using anything but the new STM lenses you will hear the focus. Although this model put the stereo mics on top instead of next to the lens so it is better you will still hear the lens focusing in quiet scenes, but way worth it!I cannot say enough good stuff about this camera for the price!Touchscreen!Awesome low light!The mode selector goes 360 so you don't have to turn it all the way back to switch to another function!A separate switch to go from video to photo!Silent mode is awesome!High speed shutter is crazy fast!I just love it. If you're upgrading from any of the crop frame cameras it is totally worth it!", "Date": "February 17, 2014"}, {"Title": "Love this body; former 20D and 40D user", "Author": "Mitch Miller", "ReviewID": "R107S0HVIN56CN", "Overall": "5.0", "Content": "I have been a long time Canon user, with two 20D bodies, and a 40D.  Although I don't especially need the low light / high ISO ability of this camera, I love the WIFI connection.  I run a photo booth service and have been able to go completely wireless now, downloading and printing within seconds of taking a picture.", "Date": "February 14, 2014"}, {"Title": "What a Camera!!!", "Author": "jimp", "ReviewID": "R3U8PCTO5Z4672", "Overall": "5.0", "Content": "Great camera ,great lens...and for the money...no better deal on planet earth. I am a Canon junkie...started with a TX back in the 70's and have owned 6 Canon DSLR's including 5D markIII and 7D ( I still have both). Since I received the 70D (about a week) my 50D is on ebay and this camera and lens are my daily rig.Light weight, super sharp pics , wonderful video and the new dual pixel focusing is terrific .The \"pop out touch screen\" is worth the price of the camera....what ease and flexibility.As a test I took the same subject with 5D 28-70 \"L\" lens ; 7D 10-20 Sigma(great lens) and the 70D 18-55STM ...all were shot at 18mm except 28-70 at 28 all on \"P\" auto. The human eye cannot tell the difference!Jim Pfister", "Date": "February 12, 2014"}, {"Title": "Just have to add my 2 cents", "Author": "TriTroy", "ReviewID": "R3GDERXHATV361", "Overall": "5.0", "Content": "Can't say much that other, well qualified individuals have said. This is a great camera.  I debated the lens choice in the kit and ended up with the 18-135mm as a \"do it all\" type lens.  I also needed to dig out my other EOS lenses to see what I have.  I'm coming from digital point and shoots though I used to use the EOS 630/620 cameras when film was still the media of choice so while not new to photography, I am new to the current bunch of DSLR's out there.  I thought this was a good price point for a \"prosumer\" DSLR.  My primary focus is nature and underwater shooting though I'd like to continue to try out other areas.  I believe this camera will allow me to do most anything I can think of as a non-professional.I'm excited about photography again and think this machine gives me the tools to be as creative as I used to be with film and not just a post production guy, perhaps that's why I used to love slide film.Now, just have to sell the spouse on an Ikelite housing......", "Date": "December 13, 2013"}, {"Title": "Best camera on the market", "Author": "Rick Vollweiler", "ReviewID": "R1CXU7ES3ZC93Z", "Overall": "5.0", "Content": "I am a cannon person and this camera in my opinion is by far the best camera for the money they have come out with. The focusing and crisp and true to color is fantastic.", "Date": "November 19, 2013"}, {"Title": "Got a used camera from Amazon", "Author": "S. King", "ReviewID": "R1E4T1SSDHXYVP", "Overall": "3.0", "Content": "OK, this is a first for me when dealing with Amazon.  I received an obviously used camera.  Yes, I bought it direct from Amazon and not from a third party.  I took it out of the box and the Live View mode wasn't working reliably: I had to reset the camera twice by pulling the battery out in the first few hours of use.  I asked Amazon for a replacement.By comparing the original to the replacement, it became obvious that I was shipped a product that someone else had already used, and possibly returned due to the problems I saw.  Here are signs you can use if you suspect similar:-The USB cable and neck strap should be sealed in individual plastic bags.  Mine were loose.-The manuals should be sealed.  There should be a CD and several errata and warranty cards loose.  Mine were all loose.-The used camera had the battery fully charged.  The replacement started charging from 0-49%.-The rear lens cap on the kit lens was marred noticeably.-The shutter would click when the live view button was pressed, but the LCD screen would stay blank.  The only way to recover from this was to remove and reseat the battery.-The first camera was set up to shoot RAW.  The default out of the box is typically jpeg.-Images taken with the camera were numbered starting at 2561 instead of 0001.-The date was set on the first camera.  The replacement asked me to set date and time.To their credit, Amazon made it right quickly and without cost to me, but the fact that it happened at all is a bit of a shock.  At the end of the day, trust the glowing reviews of this product.  It's a great camera with an outstanding feature set.  Just don't unknowingly get someone else's problem.  My guess is an unscrupulous 70D owner bought a second camera from Amazon and swapped them rather than just sending their camera in for service.  Not cool.", "Date": "June 6, 2014"}, {"Title": "No GPS -- otherwise great", "Author": "B. A. Hendricks", "ReviewID": "R3EWDZM4JDELGY", "Overall": "4.0", "Content": "I bought this on pre-order, and it's been a fantastic little camera.  My only real disappointment is that it does not have a built-in GPS sensor and I haven't figured out how to make the Canon IOS app work with the GPS.  I do like the iPhone app -- handy.  Haven't done much night shooting, but that's on my to-do list.", "Date": "June 5, 2014"}, {"Title": "Great Camera", "Author": "Rafael Perez", "ReviewID": "RUAS4MKZEN0OE", "Overall": "5.0", "Content": "It cost a lot, but it works perfect. The body is solid, the controls are perfectly placed at least for my hand.", "Date": "May 20, 2014"}, {"Title": "BUY this product", "Author": "Tom & Sue O. \"Retired Geek\"", "ReviewID": "R3BZM4RDAY1IZB", "Overall": "5.0", "Content": "I sold my T4i and a couple lens and bought this. GREAT decision I made.Pleased with the product, naturally, and continue to be Canon fanatics!", "Date": "May 16, 2014"}, {"Title": "Great Camera", "Author": "Rafael Perez", "ReviewID": "RUAS4MKZEN0OE", "Overall": "5.0", "Content": "It cost a lot, but it works perfect. The body is solid, the controls are perfectly placed at least for my hand.", "Date": "May 20, 2014"}, {"Title": "BUY this product", "Author": "Tom & Sue O. \"Retired Geek\"", "ReviewID": "R3BZM4RDAY1IZB", "Overall": "5.0", "Content": "I sold my T4i and a couple lens and bought this. GREAT decision I made.Pleased with the product, naturally, and continue to be Canon fanatics!", "Date": "May 16, 2014"}, {"Title": "one of my favorites", "Author": "Andre Lawrence", "ReviewID": "RHJTT3ZNVXXLZ", "Overall": "5.0", "Content": "More than what I was expecting, this camera has changed the way I view, and use a DSLR camera. RAW...", "Date": "May 16, 2014"}, {"Title": "Excellent camera", "Author": "Scott Nunnally", "ReviewID": "R3KOGSWLYRXPYU", "Overall": "5.0", "Content": "The camera arrived in excellent shape and I was very impressed with the features, particularly the auto-focus. The touch screen is a huge bonus.", "Date": "May 13, 2014"}, {"Title": "Everything I hoped it would be.", "Author": "S. Jaleel", "ReviewID": "R1A6DIR9GQBNVI", "Overall": "5.0", "Content": "If you are reading this review, then consider that I am easily enamored coming from my previous camera, the 30D, which I now use as a backup. I have been wanting to pull the trigger the last few years when Canon would release successor after successor to the 30D, and finally did it with this one after playing with the touchscreen a bit at a popular electronics store.The 70D is QUICK! It is quick to focus - whether via the viewfinder or liveview, and the menu is quick as well. Traversing the menu via the touchscreen also makes things a lot easier - I have it set to sensitive.  I won't harp on too much about the video autofocusing capabilities since enough has been said about it - but it is awesome.Things that I find myself doing after a month of ownership, that I couldn't do on the 30D:LiveView - manual focusing via liveview, and the ability to zoom in to confirm focus.. holy crap!! My manual lenses give me 100% success rate now in indoor dimlit settings.Wifi - connect to smartphone:  I can now quickly do some in-cam edits on raw captures, transfer a jpg version from the camera to my iPhone, and send it to eager parents/models/whoever I did the shoot for.Sensor-cleaning: Greeted with a 'sensor cleaning' message each time I turn the camera on and off, via \"ultrasonic vibrations\". Regardless of its effectiveness, it makes me feel better ;-)..wish it had:Considering the camera is crazy customizable, I am disappointed that there is no way to assign a shortcut key to preview the image in 100% to maintain my chimping habit.  I find myself using the touchscreen and the 'pinch out' gesture to zoom in for this purpose.  Friend's prosumer Nikon has this and I am jealous.  I tell 'em Canon is trying to make me a good photog by keeping my chimping tendencies in check.", "Date": "February 12, 2014"}, {"Title": "Very Happy", "Author": "A. Lamoreaux", "ReviewID": "R2KXOBZSAKDFYC", "Overall": "5.0", "Content": "I love this camera! I considered many options and specifications for a camera that fit my needs. I am so happy with the 70D. I only regret not purchasing the kit lens that came with it. Shipping was fast but the box was slightly damaged when I received it but I doubt that was the seller's fault. I would buy this camera again.", "Date": "January 19, 2014"}, {"Title": "Great", "Author": "Puntito", "ReviewID": "R3QDM47LV88J6H", "Overall": "5.0", "Content": "best camera, is great, everything i was hoping and more. great colors, nice menu, and the 18-135mm lens is a good option in a kit, the guides in the kit are good, the wifi function is fast and easy to use (love it).", "Date": "January 15, 2014"}, {"Title": "Great Camera", "Author": "Manuel Madriz", "ReviewID": "R8NSCSFSSRY8C", "Overall": "5.0", "Content": "Im very happy with the product, all the reviews i read where about right!! Great features, very confortable to hold.", "Date": "January 12, 2014"}, {"Title": "Excellent  camera", "Author": "Fabio", "ReviewID": "RHTGM6E4DQBH1", "Overall": "5.0", "Content": "The main feature: the all new autofocus function that is extremely efficient for film making and, to a lesser extent, to photography too.", "Date": "January 7, 2014"}, {"Title": "70D", "Author": "G. Fortuna \"GF\"", "ReviewID": "R4B5WPKU251CV", "Overall": "5.0", "Content": "I like this camera and this is an upgrade from my canon eos t3i which I enjoyed I got it with the 18-135 lens", "Date": "January 1, 2014"}, {"Title": "Great Camera!", "Author": "Lem", "ReviewID": "R3JH4PGUKDSXOZ", "Overall": "5.0", "Content": "Awesome camera! This is what I've been looking for. The video is sharp and clear. Canon you did a great job on this camera. Click here for my video review: [...]", "Date": "November 30, 2013"}, {"Title": "Incredible Videos & Still Photos! Easy to use interface! LOVE IT!!!!", "Author": "Judith Lindsay", "ReviewID": "R3JNPXQ35VV9QK", "Overall": "5.0", "Content": "I spent many, many months researching DSLR cameras. I am in advanced video classes in college and was thrilled that Canon came out with this camera. I have had it for 2 weeks and have already gotten fantastic videos as well as still photography! Will write more detailed review after a few more months! This camera really is a game changer as they are calling it!", "Date": "October 7, 2013"}, {"Title": "It's the camera for me", "Author": "Anthony Bernard Chaney", "ReviewID": "R3KAOVRLRE0NFB", "Overall": "5.0", "Content": "I bought the canon 60D in 2010 and loved it from the start, as a way to make the best possible videos on a budget.  However, I ended up having to equip it with a 'follow focus' rig in order to keep things in focus - sort of a hit or miss proposition at times.  Then the 70D came out!  I watched several youtube videos on the camera and became convinced it was the answer to one of my biggest problems: keeping things in focus that were moving. I bought it for Christmas and find it to be an incredible camera, for me!", "Date": "May 21, 2014"}, {"Title": "Great camera!", "Author": "angeposs \"angeposs\"", "ReviewID": "RF4P25I7T97UI", "Overall": "5.0", "Content": "I am really impressed with the 70D.  it is a definitely step up from the 40D.  Even the higher ISO setting are much better than expected (not as good as the 5D3, my other camera, but then it's not as expensive either).  Great auto focusing.  Nice size.  I loved the 40D for its size and weight.  This feels as good or better. Others have written more extensive reviews on all the technical aspects so I won't bother.  I am very pleased with it.", "Date": "March 21, 2014"}, {"Title": "Great new features and supurb quality photos", "Author": "Scott LaBorde", "ReviewID": "R1QVL6N7SO2YPD", "Overall": "5.0", "Content": "This has been an excellent addition to my photography setup.  It takes great pictures, easy to use, and consistently delivers quality.", "Date": "March 19, 2014"}, {"Title": "Well worth the price.", "Author": "Richard C.", "ReviewID": "R1U0N9YI3Q8585", "Overall": "5.0", "Content": "I moved up from a Rebel t1i and am just now learning all that this model will do.  Everything has been fairly easy and makes sense.  I am very happy with all results to date.", "Date": "March 15, 2014"}, {"Title": "awesome upgrade", "Author": "bigphil", "ReviewID": "R26KL7VCIMWL8X", "Overall": "5.0", "Content": "upgraded from a 40D that has served us well for over 5 years.  this camera is light and has a great range of settings, ISO.  Stock canon lenses are much improved over what came standard on a canon camera 5-7 years ago.  This body is actually noticeably lighter than the 40D and 30D are.  have yet to try videoing but looking forward to it.", "Date": "March 15, 2014"}, {"Title": "Canon EOS 70D Body", "Author": "RTW", "ReviewID": "RWYMASEG4RKIK", "Overall": "5.0", "Content": "I am a novice photographer…that said, the 70D has lived up to and surpassed my expectations.  I've not used it very long nor have I become familiar with all the features…but it takes a great picture.  From my perspective, the camera is put together and displays are clear and quickly apparent.  I have no regrets making this purchase.  I wish the instruction manuals were written by humans...", "Date": "March 14, 2014"}, {"Title": "It does it all!", "Author": "David A. Zelaya", "ReviewID": "R1KCT6CCUKZZCB", "Overall": "5.0", "Content": "I have used Canon cameras since 1971 when I bought a classic- the F1.  Since then, I've upgraded twice but this is the ultimate.  It takes outstanding photographs, of course, and it accepts all of my Canon lenses, but it's also easy to operate and easy to handle.  I can't wait for improved weather so that I can get outdoors to take some landscape shots.", "Date": "March 14, 2014"}, {"Title": "For the pice it's the best", "Author": "Brian J. Hein", "ReviewID": "R2V7PV0AF5SPN2", "Overall": "5.0", "Content": "I have a Canon t3i, but I couldn't pass up all the extras plus the speed that this camera shoots at. Do I want more you always do, do I need more probably not. This is a great camera for anyone. If your looking for a new camera or and upgrade this one should be on your shot list. There are plenty of comments on the pros and I don't have any cons.Amazon shipping was right on time.", "Date": "March 14, 2014"}, {"Title": "For the pice it's the best", "Author": "Brian J. Hein", "ReviewID": "R2V7PV0AF5SPN2", "Overall": "5.0", "Content": "I have a Canon t3i, but I couldn't pass up all the extras plus the speed that this camera shoots at. Do I want more you always do, do I need more probably not. This is a great camera for anyone. If your looking for a new camera or and upgrade this one should be on your shot list. There are plenty of comments on the pros and I don't have any cons.Amazon shipping was right on time.", "Date": "March 14, 2014"}, {"Title": "Superb Camera", "Author": "John Wozniak", "ReviewID": "R1HN04B2PKEAUM", "Overall": "5.0", "Content": "I bought this body to replace my faithful Canon Rebel.  After having used my Rebel for sometime learning to use a DSLR (as opposed to just a point & shoot), I was ready to move up to a more capable body, and I could not be more happier with the performance of the 70D.  The resolution, the performance, the features are all amazing!  The ability to setup the camera on a tripod and then connect to it via wifi from my iPad mini to control taking picture with a LIVE view just blows me away, gotta love tech.  I have also used the movie mode and the quality of the video as good if not better than my camcorder.", "Date": "February 28, 2014"}, {"Title": "Too good for me", "Author": "dodgyankles", "ReviewID": "R3VD36CUQIQTII", "Overall": "4.0", "Content": "I wish I knew how to use this thing better. That said, even my limited skills have resulted in amazing pics. I do wish at times I could soften the image because the detail can be too telling. I also wish there were more edit options on the camera and an easier path to direct internet upload.", "Date": "February 18, 2014"}, {"Title": "I love this camera!", "Author": "Pamela Burch", "ReviewID": "R3EG4MLB173HVR", "Overall": "5.0", "Content": "This is my3rd Canon SLR camera and I am more than thrilled with it so far.  There is SO much more that I haven't even tried yet.  I love how crisp and clear the pictures are.  I look forward to learning everything about it.", "Date": "February 15, 2014"}, {"Title": "Easy to use Quality pictures", "Author": "waszett", "ReviewID": "R2G3R1VM6AASOP", "Overall": "5.0", "Content": "We received this camera just before Christmas and didn't have time to play with it before Christmas Day. I did however charge the battery instantly. This  didn't stop me from taking it to our family Christmas party & using it on the fly. I quickly became familiar with the camera and the pictures were great quality.", "Date": "February 15, 2014"}, {"Title": "Amazing Camera", "Author": "Skandrannan \"Skandrannan\"", "ReviewID": "R309T8W7XQJJ05", "Overall": "5.0", "Content": "Canon has really it the mark on this camera.  The layout of the features is just right and easy to understand.  Picture quality is as good as any professional line canon.  When backpacking I like the slightly liter weight.", "Date": "February 1, 2014"}, {"Title": "Wow!", "Author": "Michael Bandfield", "ReviewID": "R1IW05KNT70X6A", "Overall": "5.0", "Content": "I am very impressed with this camera. It far exceeds my expectations on so many levels and I am not prepared to give it an objective review yet. I will need several months to become proficient to the point where the new functions become 2nd nature. So far the basic operations retain enough of the Canon heritage that my hands instinctively 'know' enough to give me a running start. I think this is the beginning of a new love affair. Thanks Canon!I bought the 70D body-only as sold and shipped from Amazon; and it was delivered complete and on-time as expected with no hassles.", "Date": "January 31, 2014"}, {"Title": "Good camera", "Author": "J. Lin \"Jack\"", "ReviewID": "R2QS704HDDWJC5", "Overall": "5.0", "Content": "Brought it to take pics at our boys' basketball game.  Works well.  a bit heavy than our old rebel Xsi...", "Date": "January 31, 2014"}, {"Title": "Canon EOS 70D 20.2 MP Digital SLR Camera with Dual Pixel CMOS AF (Body only)", "Author": "Vibert", "ReviewID": "R16GO0OWOISAHZ", "Overall": "5.0", "Content": "Product arrived in a timely manner, securely packed. The product certainly was deserving of all the superlatives said about it. I used it with my Canon EF 70-200mm F/2.8 non-IS lens (the older version) and was pleasantly surprised at the improved sharpness, focusing speed.", "Date": "January 14, 2014"}, {"Title": "perfect", "Author": "YICHEN", "ReviewID": "R363UJU5FDLMJF", "Overall": "5.0", "Content": "wonderful camera！very fast！i use it when i was in San Juan and it brought me much fun. It is worth to buy", "Date": "January 10, 2014"}, {"Title": "Very happy so far", "Author": "M", "ReviewID": "R10GAYIKLYD0CW", "Overall": "5.0", "Content": "Purchased to replace a 30D along with the STM 18-135 and IS 70-300.  Quite a bit of new features to learn, especially video.  If you are considering switching from a traditional camcorder form factor to a DSLR, be prepared for the form factor change.  Camcorder operation was relatively easy with one hand including zoom, while DSLR is definitely a two-hand technique if not using camera rigs, etc.Focus is very fast and sharp.Battery life seems to be quite a bit less than the 30D (yes, I have WLAN turned off and do not use live-view when shooting).Still learning the camera, so this review is first draft.", "Date": "January 8, 2014"}, {"Title": "This Camera is Work of Art (technical beauty) that Creates Truly Beautiful Pictures", "Author": "C. HAWKINS", "ReviewID": "R1MPQXA6ASZGJX", "Overall": "5.0", "Content": "I had recently gotten interested in photography again, it was something I was very interested in as a child but just couldn't afford good camera equipment.  I had my father's old film Nikon, which was good but I wasted a lot of my hard earned minimum wage money getting crappy shots developed -- that was back in the 70s.  I have the Canon G15 which is a really good camera which takes surprisingly good pictures (my wife took it for herself after I bought the 70D), and has a lot of good and useful features.  This Canon 70D that I recently bought is in a different league in its ability to take magnificent shots.  I was on the fence on whether to get the Nikon D7100 or the Canon 70D and did a lot of online research comparing the two and the consensus is the Canon 70D edges out the Nikon D7100 (check for yourself, please don't just take my word for it).I really liked taking pictures with my G15 and it was very handy.  I bought my Canon 70D at a Black Friday sale at Fry's Electronics.  I am so happy with this camera I use it all the time, and I get great shots with it whether I'm on the bay in a boat, or in the park, in the city, or just walking around the neighborhood.  You can even select the focus points right on the touch screen if you like.  I could go on and on -- it is simply a wonderful, wonderful camera.  Believe the glowing reviews,  Canon's passion for delivering the best cameras available really shines through with this Canon 70D.", "Date": "January 4, 2014"}, {"Title": "Must have", "Author": "Dave Gibas", "ReviewID": "R2VI4QM27JCN6T", "Overall": "5.0", "Content": "Love this camera. Used it for the holidays for the first time and I was pleasantly impressed. HD movies were sharp.", "Date": "January 4, 2014"}, {"Title": "Best option in the semi pro category", "Author": "Neil", "ReviewID": "R1WW7W9W6SWEXM", "Overall": "5.0", "Content": "Having started out with the Canon T4i I was looking for something which gave me even more control over the camera. So much of my comparison was with the T4i benchmark. The 70D proved to be the best fit. The output is much more improved over any of the the entry level camera. The remarkable feature over the T4i was the 19 point auto focus. Also it has ISO increments in 1/3rd stops. Overall I would say if you are looking to graduate from an entry level camera to a semi pro, go for it.However I still had to return the camera because of Amazon's fault and not because of the camera itself. Why? That's a different story with the Amazon customer service which I do not want to put here.", "Date": "January 3, 2014"}, {"Title": "Excellent Camera", "Author": "Steve Schweizer", "ReviewID": "R19YF0NVUFASEQ", "Overall": "5.0", "Content": "Recently upgraded from the Canon 20D. It was 10+ years old. It was time. This camera has more features. My wife loves the 8 shots per second while shooting my sons pitching and hitting at baseball games.", "Date": "January 2, 2014"}, {"Title": "Upgraded from 30D to 70D  Not disappointed at all", "Author": "James Peach", "ReviewID": "R1KNUR67MJWHBW", "Overall": "5.0", "Content": "we owned a 30D for ... what seems to be ever.  My youngest daughter decided to take my car keys and scratch the face of the 30D's display up so bad that it was practically impossible to see anything on.I made the decision to start reseaching new camera's,  I spent a lot of time focused between the Nikon and the canon.  We were about to switch to nikon until i saw the pre review for the 70D in July.My only wish is that the camera had a built in GPS,  we really like Geotaging our photo's as we are Expats that travel the world.", "Date": "October 17, 2013"}, {"Title": "Canon 70D", "Author": "RT \"RT\"", "ReviewID": "R2N503683D5F9S", "Overall": "5.0", "Content": "I am new to DSLR and a beginner photographer. I have owned this camera for a month and the photos that it takes are outstanding!. I also shoot videos of my kids and this canon does a excellent job at it. I would highly recommend this camera.", "Date": "October 2, 2013"}, {"Title": "a leap in continous AF (in good light).", "Author": "B. franklin \"book worm\"", "ReviewID": "R3DGSE8NMBK57O", "Overall": "4.0", "Content": "After taking an early retirement from weddings and events, I recently pick this up because I needed a reliable camera system for indoor flash photography for dancers in dim lights.  High Image Quality from Poor light, quick focusing moving subjects, .... were my primary intend for this.  Basically, I'm getting this so, I won't miss a shot shooting photo journalist style.Since there are so many reviews to read, I'm keeping it short.PROFastest and most reliable AF in its class in good outdoor light.with a wide 80% dedicated to AF (in AF-C mode), it works nicely with Flash that has the AF illuminating light.Overlay of info in view finder makes composition a piece of cake.The red AF confirmation in view finder keeps my eye on the subject not having to wonder off center.The kit lens focus in near silent.  Of all the L lenses I've used, this sounded like how cat walks, dead silent.Articulated screen is awesome.wireless flash works as expected.Nice Hi ISO; doing ISO 3200 more often now.CONISO-A mode under expose (by 1.5 to 2EV) frequently with external flash on bracket.buttons are not back-lit.  I know one day I will get used to the positions of the button.  But, having back-lit buttons would flatten the learning curve, while I am looking at the picture on LCD and change parameter at the same time.The lens 18-135mm has good focal length; it's sharpness fall off quickly toward the corners.can battery be charged via USB?  This way, I can charge it while the car is running rather than getting (my 5th) brick invertor.can the battery charger charge TWO batteries fast at the same time?I'd consider a full frame version, if the cons are fix.for those who are trying to compare 70D and Nikon 7100.  check out this vid: [...]", "Date": "December 25, 2013"}, {"Title": "Wonderful piece of equipment", "Author": "Liam", "ReviewID": "R160MYP7TEFZRC", "Overall": "5.0", "Content": "I am a Canon fan but the 70D has surpassed all my expectations. Once I got familiar with the buttons and touch screen I found it so easy to use.  It’s a big, solid camera with a good feel. I would recommend a second battery as I feel it could be heavy on juice. The processer and the high ISO seem to be good. I haven’t extended it yet.The only drawback was the battery charger which is USA socket only and I had to get adaptors immediately.", "Date": "April 16, 2014"}, {"Title": "fantastic camera.", "Author": "R. parry \"rp\"", "ReviewID": "R2VG21NIP7SGLC", "Overall": "5.0", "Content": "I have a number of high end point and shoot (Canon G9, Canon s100, Canon s90) and a Canon Rebel 3ti. This is clearly the best camera I own. I upgraded with the 70D and it is far far superior to the Rebel in options, camera feel, quality and exceptional pictures. It is only slightly heavier than the Rebel but is so much better balanced with the larger lenses I have (Sigma 18-250mm and Sigma 10-20mm) that it is much easier to carry and shoot. I didn't think I would use the touch screen but I find I use it quite a bit when taking multiple shots using a tripod especially in early dawn or night.", "Date": "April 5, 2014"}, {"Title": "Best XXD Yet", "Author": "Liscia", "ReviewID": "RBI3Y5QLZK1KB", "Overall": "5.0", "Content": "Everything they say about it is true -and more. Have owned 20, 30, 40D's but skippedthe 50 and 60. I was debating on this or the 5D III but I cannot justify the extraexpense for that full-frame and though I have mostly L glass primes/zooms I don'twant to give up using my EF-S60mm or the  EF-S 10-22mm Zoom. Video onthe 70D is fantastic and tho I'm not too much into video I might be using this more.", "Date": "March 23, 2014"}, {"Title": "Yes - I LOVE it!", "Author": "Amazon Customer", "ReviewID": "R31XIKVX4382I6", "Overall": "5.0", "Content": "After years of learning and working with my Rebel T2i, I reached a place where I just could not go any further.  It was time to upgrade.  This camera was in my price range and it has taken my photography to a whole new level.  The quality of my images is vastly improved and I just can't say enough about how pleased I am with my choice.  I am still learning with this camera - but everytime I take it out is better than the last.  I am so happy I went with this camera.", "Date": "March 16, 2014"}, {"Title": "Love it!", "Author": "Elaine R \"Elaine R\"", "ReviewID": "R3JFVM7GI67A3R", "Overall": "5.0", "Content": "I love this camera, it is an upgrade from my 40D EOS. It has HD video and an HDR setting, very easy to use.It has an easy to use touch screen and you can also download an app that let's you control the shutter from your phone.", "Date": "December 19, 2013"}, {"Title": "Very satisfied.", "Author": "Dragwood", "ReviewID": "R1KN9HMO1CE3AN", "Overall": "5.0", "Content": "The build quality of this camera is about as best as you can get before jumping to a full aluminum frame. The picture quality is very crisp and great color saturation. I'm thoroughly impressed with the auto focus system. I have been able to take perfect focus shots of birds flying towards me. The touch screen is very much like a smart phone. Fairly smooth scrolling (not as smooth as an iPhone) with high resolution display. If your interested in getting the best bang for your money then look no further. This has many qualities of its more expensive siblings without the cost attached. As a side note i had to get a replacements as it had some dust spots on the sensor out of the box. Amazon (as usual) replaced the camera no questions asked over night. I cannot overstates how good the customer services is when buying from Amazon. When you add to that a retailer that consistently offers great prices, i find it hard shopping anywhere else. Buy with confidence.", "Date": "November 26, 2013"}, {"Title": "Very nice camera", "Author": "Vlad", "ReviewID": "R3FBRMNVUV1KOA", "Overall": "5.0", "Content": "This camera is the first camera i owned and im still trying to learn photography with dlsr cameras and how to use the lens with the different settings on this camera. The video quality is very nice along with the sharpness and color of the pictures it produces. I currently own the 50mm f/1.8, the 70-200 f/2.8 zoom lens, and the 10-22 f/3.5-4.5 zoom lens for it. The 50mm lens takes fantastic portrait pictures.", "Date": "November 4, 2013"}, {"Title": "Great Camera, All in one! More than mid-range DSLRs", "Author": "ALAS", "ReviewID": "R3SXKA0ALNSSE8", "Overall": "5.0", "Content": "Previously I have had different version of Nikon, D5000 and D5100. But I did not own them. I decided to buy mine and my choices were Nikon D5200, D7100 and Canon 70D. Although D7100 is a truly great camera, I chose 70D based on my vast reviews. Some people believe that D7100 image quality is significantly better than 70D, but I would say 70D is even better in both low and high ISO (based on dpreview.com test images, check them [...]The bulit-in wireless connection is an awesome feature that one camera can have. Other than all these, the brand new dual pixel sensor make it much more faster to autofocus using 19 cross-type AF points. If you use STM type lenses, you will never hear any \"rrr-rrr-rrr\" sound as some Nikon lenses or Standard Canon lenses do.Never forget that how easy is video recording using its touch screen It is a great camera and you will enjoy if you get that.", "Date": "September 3, 2013"}, {"Title": "Canon 70D", "Author": "Robert Emblanc", "ReviewID": "RAF08C1BALTQK", "Overall": "5.0", "Content": "Better picture resolution, lighter than his predecessor, fast shooting, a screen which u can turn around.So far it is one of my best outdoor camera.", "Date": "December 4, 2013"}, {"Title": "WOW", "Author": "Simiakos", "ReviewID": "R14AT46F72D8II", "Overall": "5.0", "Content": "I am a bit overwhelmed but after taking a class I am LOVING this camera.  A lot of features that you need help with.  I bought a quick tutorial with Michael the Maven and it was great to get me started.", "Date": "March 18, 2014"}, {"Title": "I love this", "Author": "solidol", "ReviewID": "R1B748SU7UIPFV", "Overall": "5.0", "Content": "I love this camera. I bought this for shooting in my project.I have seen a lot of improvements comparing with old ones.What I like is auto focus follow during shooting.This works very well even though you cannot change focus speed.", "Date": "February 26, 2014"}, {"Title": "So Far, So Good", "Author": "David J", "ReviewID": "R2NSNBJ5KS21E1", "Overall": "4.0", "Content": "This was an upgrade for me.  I am used to the Rebel T series.  I was shocked in the weight difference of the 70d vs the Rebel T models.  The 70d is quite a bit heavier and the lens is heavy as well.  I got this because of the CMOS live feature that is supposed to be quite advanced for SLR cameras.  I will update this review in the future with my pros and/or cons.", "Date": "February 20, 2014"}, {"Title": "Great camera", "Author": "Gene Bottoni", "ReviewID": "R1TA66YYGJB4SR", "Overall": "5.0", "Content": "I have done a lot of testing and I am very happy. The dual pixel and 20.2mp are working very well. I can't wait to start taking a trip and giving it a workout. If you are looking for a replacement or new camera , this one won't let you down.", "Date": "January 15, 2014"}, {"Title": "Good pick.", "Author": "das", "ReviewID": "R3OWAE9X87FNKT", "Overall": "5.0", "Content": "It's a nice camera,I like this camera very much. the quality of photos are very good. I suggest 100% for this camera.", "Date": "January 12, 2014"}, {"Title": "Camera for dummies", "Author": "Reinaldo Plaza", "ReviewID": "R1FXUQL87S3NRJ", "Overall": "5.0", "Content": "I bougth this camera because my 5d markII got some white pixels at high iso, so i cannot use it on video. This camera is an excellent buy, you can work in low ligth in 3200 iso, i put it in 6400 but the noise got to high, but i can use it. The wifi is perfect for me, i can shot a photo on a wedding and send it to my phone in a minute. The autofocus is perfect, i call this camera DSLR for dummies, everyone can use it and always stay in focus the shot, not everything at low ligth this do not work.", "Date": "December 30, 2013"}, {"Title": "THE BEST CAMERA FOR INTERMEDIATE AND PROFESSIONAL PHOTOGRAPHERS", "Author": "mm", "ReviewID": "R3RMUSV35MBQ89", "Overall": "5.0", "Content": "I purchased this camera 2 months ago. The features that is has got, makes my life easy to take a nice shot. It gives you variety of white balance options, by which you can take 3 shots and pick the more favorable one.The Streo sound recording and AF during the video taking has made it out-lier amongst other products.I highly recommed this camera.", "Date": "December 18, 2013"}, {"Title": "Blown away...", "Author": "Allen K. Shorter \"thespacemonkey\"", "ReviewID": "R1Y1F8OIOBWNU", "Overall": "5.0", "Content": "This is just a really solid and good camera body with some amazing focusing. I moved up from a 40D and I cannot believe how much better my photos are. Easily 2-3X a better product than the 40D...which was a darn nice camera already.", "Date": "April 25, 2014"}, {"Title": "Upgraded from a Canon 40D to this model", "Author": "Tamara Torres", "ReviewID": "R1CISVD2BC8T0Y", "Overall": "5.0", "Content": "I absolutely love this new camera. I upgraded from a 40D and was looking into something more up to date and reliable for my freelance photography business. Now, I was on a pretty tight budget and this was all I could afford. I've already had it for about a month and a half and done about 10 portrait shoots with this (which is what I mostly use it for) and I love the quality of the images. I'm happy, clients are happy, so it's a win-win. The touch screen is amazing and the video is as well. Definitely worth reading a more in-depth review depending on what you'll be using it for but totally worth every penny.", "Date": "April 22, 2014"}, {"Title": "Great Camera with Excellent Continuous Focus in Video Mode", "Author": "Fallbrook Avocados \"Bill\"", "ReviewID": "R12JWI5N2BE06D", "Overall": "5.0", "Content": "This replaces a Canon T3i which is also an excellent camera except that there is no automatic continuous focus in video mode.  The focus on the 70D in video mode works great.  Too bad it does not have a headphone output.  The wifi connection is handy for shutter release, although a little tricky to set up.  The burst mode is great for sports photos.", "Date": "April 21, 2014"}, {"Title": "Excellant Camera", "Author": "Dave Marks", "ReviewID": "R34PIVWW1NXCE6", "Overall": "4.0", "Content": "I'm a professional photographer and we have ventured into the photo booth business.  That is the reason I bought this camera.  Perfect for this use, using the kit lens.Impressed with the features.", "Date": "April 18, 2014"}, {"Title": "My new camera", "Author": "ter", "ReviewID": "REB0Q8CTH3J3I", "Overall": "5.0", "Content": "My canon EOS 70D is as awesome as I was hoping it would be!! I love it. I upgraded from a canon rebel t2i. I am sooo happy I did. This camera is very user friendly :)", "Date": "March 24, 2014"}, {"Title": "Amazing - Better than expected", "Author": "cblock", "ReviewID": "R1PLJ4BCR0MU8N", "Overall": "5.0", "Content": "Amazing camera - the wifi capabilities are incredible (app for EOS remote and live view on ipad/iPhone/computer/other devices); the picture quality out of the box if perfect (nice bokeh with the kit lens) and great touch screen featured, auto focus grids, programming capabilities.  So glad I waited an splurged on this!", "Date": "March 19, 2014"}, {"Title": "Autofocus is loud", "Author": "Lagarto", "ReviewID": "R21QPPHNDY2I4P", "Overall": "5.0", "Content": "I love the cam except for one thing - video autofocus is loud and picked up by the cam in a way which is completely distracting. I wish canon would engineer a remote wireless microphone, where you could place the mic somewhere else in the room to get away from the camera body. Other than this one flaw, though, I like all the rest of the improvements Canon made over the 60D. The touch screen is really amazing.", "Date": "March 15, 2014"}, {"Title": "Good Camera", "Author": "Nelu", "ReviewID": "R1Z8VXV6NCVHKH", "Overall": "4.0", "Content": "I get good quality of pictures and it is easy to operate it. Have the 60D as well and they are quite similar.", "Date": "March 14, 2014"}, {"Title": "Excellent!", "Author": "Arthur R. Rumaya", "ReviewID": "R31I362IE0CZ4T", "Overall": "5.0", "Content": "I upgraded from a 30D and this is a MAJOR step up. It's fast, quiet, and has much more accurate color quality.", "Date": "February 6, 2014"}, {"Title": "Amazing Camera", "Author": "Frances", "ReviewID": "R47F3BZZCVGOO", "Overall": "5.0", "Content": "I love this camera, I wish I could give it more stars because it deserves it! I highly recommend this camera.", "Date": "January 24, 2014"}, {"Title": "Canon 70D", "Author": "G. C. \"Bookworm\"", "ReviewID": "R16TKDVRNP61DW", "Overall": "5.0", "Content": "This is a fantastic camera for the price!  I use it as a back up to my 5DM3.  I love the fact that it can use both EF and EF-S lenses.  I also love the fact that like the 5DM3, it has a \"silencer\" mode so that the shutter makes a minimal of clicking noise.  This is especially helpful in event photography.Update (3/11/14):Did several tests side by side with my 5DM3 and 70D in low light (restaurant settings) without flash.  At the same ISO (3200 used)  and aperture (f2.8 used), the 70D auto set the shutter speed to 1/40 whereas the 5DM3 auto set shutter at 1/60.  So the sensor on the 70D is not as sensitive in low light conditions as the 5DM3.", "Date": "January 15, 2014"}, {"Title": "Super happy !!!", "Author": "Sade'", "ReviewID": "R2IL59E5U8D02K", "Overall": "5.0", "Content": "Bought my camera at bestbuy and even the sales associates where excited about this camera , all of them they were going off on its effects, I read the reviews and everyone was crazy about it. So far I played around with it and I am amazed, I have a Nikon D5200 , this camera is by far better and faster. It's worth the money I'm so happy I bought it. According to the sales associate it's literary an investment, your money will never be wasted. I love the touch screen effect to take a picture, I love the video sensor effect how u touch the thing u want to focus on and it follows it.  I'm learning as I go because Canon is nothing like Nikon. This camera is so much fun. I loveeeee it. So happy.", "Date": "January 4, 2014"}, {"Title": "One Great Digital Camera", "Author": "william migora", "ReviewID": "RINTER9BWX42L", "Overall": "5.0", "Content": "Just The BEST! I have 2 other Canon cameras and I bought this one because of the 20 megapixels and the fast shooting 7 frames per second which will capture any kind of movement. I upgraded from the Canon 60D because of this. Incidentally, the 60D is a great camera also. All the features are good. Just remember when you buy the body only, it doesn't come with a memory card. Fortunately I have extra cards that I use. I really am extremely pleased with the quality and the performance of this camera. I cannot say enough good things about it.", "Date": "November 28, 2013"}, {"Title": "Amazon said it was new, it was not.", "Author": "Dan Cobb", "ReviewID": "R2GIUFA4OS479D", "Overall": "3.0", "Content": "Amazon sold this 70d to me as new, it came with with a memory card with other peoples pictures on it.Obviously not new.", "Date": "February 1, 2014"}, {"Title": "Bought this camera for its auto-focus, returned this camera due to autofocus", "Author": "thank you", "ReviewID": "R2Y4SNEJBDTF9C", "Overall": "1.0", "Content": "1. The 19 point autofocus system, when using auto-select mode in the viewfinder, consistently miss-focus the pictures, with my Canon 300mm F4 IS L lens. (The situation is much better when using liveview auto-focus. )2. The 19 point autofocus, when using auto-select mode in the viewfinder,  will ONLY focus on the closest subject, no matter what the main subject of the frame is. For example, if there is a cup sits on a table, even the cup occupied the main area of the frame, the autofocus points, nonetheless, will almost always keep locking on the front surface of the table in front of the cup, while miss-focus the cup, which is actually the main subject.  (The situation is much better when using liveview auto-focus. )3. It is a Brand New Camera, and when I first opened the package, I found quite a few specks of small dusts on the assembly mirror, it is UNACCETABLE manufacturing control when you consider how EXPENSIVE this 1 pound little machine is.Shame on Canon, This camera will DESERVE one Star.", "Date": "April 27, 2014"}, {"Title": "High School Film Student", "Author": "Alexander Zemaitis", "ReviewID": "R3DYTLWQ41R9RT", "Overall": "5.0", "Content": "I love my Canon 70D so much! I am a film student at an art high school and it has performed exceptionally with photos and videos. I have made multiple short films (I was accepted to a handful of student film fests), have filmed and photographed birthday parties/events, and turned a Nikon enthusiast into a Canon lover. From the design to the long list of functions/settings, this camera will AMAZE you!!!", "Date": "March 30, 2014"}, {"Title": "High School Film Student", "Author": "Alexander Zemaitis", "ReviewID": "R3DYTLWQ41R9RT", "Overall": "5.0", "Content": "I love my Canon 70D so much! I am a film student at an art high school and it has performed exceptionally with photos and videos. I have made multiple short films (I was accepted to a handful of student film fests), have filmed and photographed birthday parties/events, and turned a Nikon enthusiast into a Canon lover. From the design to the long list of functions/settings, this camera will AMAZE you!!!", "Date": "March 30, 2014"}, {"Title": "Great camera", "Author": "RLS", "ReviewID": "R3AUBPTVX2OGLN", "Overall": "5.0", "Content": "A great camera body I only wished I had bought it sooner and not spent my money twice when I bought a less expensive body and needed to move up in action.", "Date": "November 1, 2013"}, {"Title": "my main camera", "Author": "Kontrakami", "ReviewID": "R2O2SGBQNJT14D", "Overall": "5.0", "Content": "Incredible product. I like the weight because it makes you steady. And all my pictures look incredible! It is an improvement from the 60D!", "Date": "October 2, 2013"}, {"Title": "Quite a camera", "Author": "R. Ross", "ReviewID": "R181YTG06E2N1A", "Overall": "4.0", "Content": "I upgraded from a Canon Rebel to the 70d.  I like all the features on the camera and as soon as I work my way through the 400 plus page manual, I am sure that I will take advantage of the versatility that this camera offers.  I look forward to expanding my photographic skills using the 70d.", "Date": "December 26, 2013"}, {"Title": "Almost Perfect Auto Focus", "Author": "PaceyPimps", "ReviewID": "R2B06QF2MJTZMA", "Overall": "5.0", "Content": "Love the photos and how fast it auto focuses. Video beats GH3 or the GX7 in auto focus but still not as fast i wish it to be but way i mean way better than T5i i had before.  On screen touch with swivel is so nice and the Wifi works well.1. 80D requests are bigger screen in HD. 2. SL1 form factor. 3. even faster AF", "Date": "December 10, 2013"}, {"Title": "Everything I wanted in a camera", "Author": "Kate Comings", "ReviewID": "R3A63BWLMV3XJ6", "Overall": "5.0", "Content": "I wanted to upgrade my Rebel XS. I had already researched the specifications on a lot of cameras, and the 70D had everything I want, but it wasn't available yet! I had to wait a long time. I love this camera. It has enough ISO range for all the conditions I have encountered so far, and I haven't noticed any noise in the images. It feels great in my hands. The books about how to use this camera aren't out yet, and I usually learn from one of those, but it has been easy to figure out where all the settings are. I have only used it for taking photos in manual mode.", "Date": "October 11, 2013"}, {"Title": "Amazon is selling used cameras as new!", "Author": "Clinton J. Wolf \"Clint Wolf\"", "ReviewID": "R3A5WXTJ3UB0P9", "Overall": "1.0", "Content": "I purchased this camera about a month ago. I have been very happy with my 60Ds, but wanted to get the additional focus points. Upon using the camera for the first time, and transferring the photos to my computer, I noticed that the first image number was number 7695! This means that someone (or multiple people) had used this particular camera, had taken 7694 photos with it, returned it, and now I purchased it with 7694 photos \"on\" the shutter. In other words, I paid for a new camera and got a used one!I immediately returned it.When you purchase a new camera, the first image should say (when transferred to your computer) img_0001, the next img_0002, etc.This has absolutely nothing to do with your memory card. It just shows how many \"clicks\" are on your shutter, in your camera. If you receive a camera that says anything other than img_0001 on your first photo taken, you have a used camera!I have a feeling that this is going on all the time, and people don't catch it (it happened to me with a few other cameras I purchased from Amazon...I returned all of them). Do not pay full price for a used camera! If you get a camera that is used I would return it and keep doing so until you get a new one. If you have any questions, please let me know.", "Date": "March 25, 2014"}, {"Title": "Beware: Not as Advertised", "Author": "Tumangad Barsanga", "ReviewID": "R2K95TF3SYE83E", "Overall": "1.0", "Content": "This Canon EOS 70D sold by Amazon.com does not have Wi-Fi capability, the opposite of the original product description on the Canon USA website.", "Date": "June 7, 2014"}, {"Title": "intial impressions", "Author": "Ted Hunger", "ReviewID": "RX713KWJN1D45", "Overall": "4.0", "Content": "so far so good.  about an hour of use, my rating may change. a few tips. I wanted to buy this camera through amazon because I really like how they ship, BUT they do not take pay pal (they should) so I decided to go with one call via eBay for 999.00, no state sales tax. I am from NY and the taxes  here are outrageous. I sold my canon 5dmark ii to get this camera, I also have a t3i.I love the speed of this camera shooting jpeg with a fast sd card , that's right you should  have a fast card (80 mb's will do) for this camera especially shooing RAW (lab tests later) video tracking was decent with my 28-105mm canon lens. tracking will vary do to lens speed and shooting conditions. being a videographer for many years DSLR'S  have a way to go to match pro-Sumer video cameras.this camera feels good in my small hand and the weight is just right. I  am not a big fan of touch screen operation because the screen gets smudged in a hurry, being anal retentive/ a clean freak this gets annoying to me but I will make the best of it.* always put a screen shield on this camera ASAP you'll be glad you did.the 3 main reasons I sold my 5D mark ii was it didn't have a swivel screen , I love the swivel screen, its a must for video shooting. the on camera flash. I have an external speed light/flash I just really never find myself using it. I feel I have most shooting situations covered with the on camera flash although it has its drawbacks. camera 7 FPS is awesome + 20 MP is pretty cool.one problem I did encounter is the battery charger. I put the dead battery that came with the camera on the charger and left it to charge thinking nothing of it.4 hours later I see the battery still blinking rapidly ....ooops I guess I should read the directions. the directions state if the red blinking light flashes rapidly its not charging . its not charging ? I have never heard of this.why is there a communication problem between a new battery and the battery charger?...following the directions I separated the battery from the charger and put it back on....still blinking rapidly.....repeated this action again and finally the battery started to charge. NOT COOL.I have 2 after market batteries that would no charge on this charger .Bummer I then ordered an aftermarket charger for 5 $ no big deal. keep in mind that this battery charger is the same battery charger that comes with the 5dmark ii 7D and a few other models. I should be able to charge after market batteries on this charger.sample picture from my sigma 170-500mm on auto where beautiful.l this camera raised the level of usefulness on this sometimes tricky to use lens. The in camera aberration and ISO reduction really works. I will update after I put this camera through a more rugged workout .", "Date": "June 1, 2014"}, {"Title": "Fantastic", "Author": "David J. Cattuzzo \"DC Cleaner\"", "ReviewID": "RLE097V13AVOH", "Overall": "5.0", "Content": "Replaced a 50d which I loved, until that rogue wave hit me. Anyway this is a great camera with too many features to mention. Haven't found one thing I don't like.", "Date": "May 2, 2014"}, {"Title": "Great Camera", "Author": "WillowTree", "ReviewID": "R3VJPAGSN7796Y", "Overall": "5.0", "Content": "Was so nervous to buy a new camera but it is wonderful!  Love it and so glad I purchased it!  It was very well packaged and came as said! LOve it!", "Date": "March 13, 2014"}, {"Title": "Great Camera.", "Author": "Miguel C.", "ReviewID": "R5VMLWYALH40", "Overall": "5.0", "Content": "All I have to say is that this is a GREAT camera! I am very happy with it. There were no problems with the camera when it arrived or with the packaging.", "Date": "February 13, 2014"}, {"Title": "Wife is Happy with the new camera! I'm happy!", "Author": "Rafael Vieyra", "ReviewID": "R3DQV2Y77SN8NO", "Overall": "5.0", "Content": "Wife is Happy with Her new camera! Great camera, amazing features! What an upgrade to Her photography gear. Excellent deal!", "Date": "February 10, 2014"}, {"Title": "Great reviews are justified.", "Author": "Byron Roselli", "ReviewID": "R3AE23XZM6X8D1", "Overall": "5.0", "Content": "Given as a gift within my family and I am amazed at the features and quality of the photos and videos.  Great alternative to point and shoot cameras or smart phone cameras. A must for  families.  Great reviews are justified.", "Date": "January 16, 2014"}, {"Title": "Love it, great back up camera", "Author": "Matthew \"Photographer\"", "ReviewID": "R3V4079FZ3MR05", "Overall": "5.0", "Content": "I bought this when it was on sale for a great price, its the real deal even got it checked out by canon to make sure it survived the trip over here. It is great for someone who wants to shoot video and still have the option to take great pictures. You can go to their website for all the specs. I have been using it for a month and enjoy it very much. feel free to ask me questions", "Date": "January 15, 2014"}, {"Title": "good", "Author": "Jona", "ReviewID": "R16BB361TBVO5I", "Overall": "5.0", "Content": "a lot of potential. I am still learning how to use it. But I am excited to get this product.", "Date": "January 9, 2014"}, {"Title": "Canon EOS 70 D", "Author": "Nancy Lalic", "ReviewID": "R3N58RBI5O493Z", "Overall": "5.0", "Content": "This was a birthday present for my son.  He travels a lot and he likes taking tons of pictures.  What he also likes about this camera, was the camcorder feature.  He is extremely happy with this camera since he has the option of taking pictures or a video.  He feels also that this is a top quality camera.", "Date": "January 5, 2014"}, {"Title": "I Got Your Service!!", "Author": "Don", "ReviewID": "R2KGTQ6DG8QC6T", "Overall": "5.0", "Content": "This is for Amazon. 10 stars!!! The reason: The item was \"delivered\" last week but I never got it.  Said so in an email and the next day they sent a replacement. NO QUESTIONS ASKED!! now granted I have spent thousands on Amazon products and I'm sure that help qualify for this type of replacement but still... THAT'S SERVICE!  And oh yea.. the camera is great.  Read the reviews of others who write better and and know much more about it than I do.", "Date": "November 12, 2013"}, {"Title": "Performs like a pro camera", "Author": "ARNEL GARCIA", "ReviewID": "RVP1HRZQ8EB8Q", "Overall": "5.0", "Content": "Extremely fast and accurate focusing. The touchscreen,  IOS app and remote utility software are very useful.  Dual pixel technology, I believe is the future of digital imaging that we now use.", "Date": "April 11, 2014"}, {"Title": "Helpful, great illustrations", "Author": "Donald L Parker", "ReviewID": "R2M8O6ZSWBSY9W", "Overall": "4.0", "Content": "I have had a DSLR previously, but always kept it in full auto mode. I am determined to learn about creative photography and I have apparently picked a high end camera to begin with. I hope I can learn to use 20% of the features on this camera. Seems like a good camera, the rest is up to me.  Mike Browne and other tutorials on YouTube will help me.", "Date": "January 21, 2014"}, {"Title": "Helpful, great illustrations", "Author": "Donald L Parker", "ReviewID": "R2M8O6ZSWBSY9W", "Overall": "4.0", "Content": "I have had a DSLR previously, but always kept it in full auto mode. I am determined to learn about creative photography and I have apparently picked a high end camera to begin with. I hope I can learn to use 20% of the features on this camera. Seems like a good camera, the rest is up to me.  Mike Browne and other tutorials on YouTube will help me.", "Date": "January 21, 2014"}, {"Title": "A Great Camera", "Author": "Duardy Estrella", "ReviewID": "RKUXCZD7XZ4IN", "Overall": "5.0", "Content": "This camera is just amazing! I'm really happy with my purchase! You will get what you really expect! Nice pictures! More accurates photos and a nice low ligth performance! This camera is really fast (almost as fast as 7D) and the wireless feature makes my life easier. So I think this is the best camera option, excluding the full frame cameras! The touch screen is reallly useful and let you set your camera controls faster than anyone. I had a T3i which is a nice consumer camera, but the 70D is other history!", "Date": "November 27, 2013"}, {"Title": "Nice one", "Author": "M. Breault \"rossypink\"", "ReviewID": "RHU3QMXBU15JS", "Overall": "5.0", "Content": "take good clear photos and not so heavy to carry on while you are field trip. Awesome camera has wifi", "Date": "October 11, 2013"}, {"Title": "Review of Canon 70D; some shortcomings", "Author": "buzz_sunset_beach", "ReviewID": "R3106PVC3LYUB7", "Overall": "4.0", "Content": "I received my 70D ahead of ETA; thank you Amazon.  The camera takes great pics especially in low light and great movies as well.  I have not tried any of the movie editing capabilities; will report later.  I am using the 18-135m kit lens.Please take the following comments with a grain of salt as I have only had this camera for one week and have only shot ~2500 pics so far.  Interestingly enough the battery still has a charge left after all the pics and a dozen movie clips of some 41sec to 2min duration.  I should note that I used the viewfinder primarily rather than the LCD screen for the pics.I found it very frustrating that the camera does not have a dedicated button for movies.  Instead, you have to flip the switch and use the live view mode.  I was attending a concert and wanted to alternate between pictures and movie clips.  I had to switch back and forth and was frustrated as I prefer to use the viewfinder but HAVE to use live view for movies.  I am comparing this to my Lumix FZ200 which takes just as good movies with a dedicated button and has a 600mm f2.8 Leika lens and cost 1/3 the price of the 70D.  That is why I took one star away.I found the touch LCD and touch control screen on top of the 70D quite useful and adapted to them quickly.  Not only do these allow you to change settings as needed, but this is also an excellent training tool in learning the trade offs and influences on each other when you change the various parameters (aperture, ISO, speed, etc.).As a side note, and not related to the 70D itself,  I also ordered a lens hood and assorted filters [make sure you attach a UV, or other, filter immediately to protect the lens].  The lens hood I received was poor.  Be careful and make sure that the hood you get can be applied together with the lens cap!  This one did not go on if the lens cap was on, nor could you put the lens cap on if the hood was attached.  It goes without saying that the hood was not reversible.  Get a snap-on one rather than a screw on type.", "Date": "March 24, 2014"}, {"Title": "Great camera", "Author": "Justin Mermelstein", "ReviewID": "R1J6OQC7S6T8SD", "Overall": "5.0", "Content": "Everything as advised. As close as a pro camera as you're going to get for the price point. Quality build, too. Feels like an expensive camera. Video auto-focus is phenomenal.", "Date": "March 10, 2014"}, {"Title": "good camera", "Author": "Craig", "ReviewID": "R1AR21JRI6VUVJ", "Overall": "5.0", "Content": "I am not a professional photographer but taking pictures with this camera sure makes me feel like one. It produces high quality pictures and videos.", "Date": "March 10, 2014"}, {"Title": "I love you 70D", "Author": "Ryan T. Begley \"Ryan\"", "ReviewID": "R3KDDK9V0YLVY3", "Overall": "5.0", "Content": "An awesome crop sensor camera that has a new way of focusing during video and is just a joy to shoot and record with. I would highly recommend it. Watch YouTube videos instead of reading communist reviews on here.", "Date": "February 1, 2014"}, {"Title": "More than what I expected", "Author": "Nuga", "ReviewID": "R1YF1Q5AAVJRF5", "Overall": "5.0", "Content": "It was a gift, and the receiver was so happy for it and he sees great potentials in this camera.", "Date": "October 30, 2013"}, {"Title": "Awesome", "Author": "M. Garcia", "ReviewID": "R2PMNKU0XHY7H7", "Overall": "5.0", "Content": "I debated between the T5i and this 70D.  I am very glad to have gone with the 70D.  It is an awesome camera with the features that I needed.", "Date": "May 11, 2014"}, {"Title": "awsome camera", "Author": "Perry T Lockhart", "ReviewID": "R2L9FSRXGV12LL", "Overall": "5.0", "Content": "I love this camera, it was a replacement for my rebel xt. The images and movies are very good, it has a lot of features that I will take some time to figure out. Obviously you can tell I am a amateur photographer by my simplistic terms. That doesn't stop me from liking this camera.", "Date": "April 23, 2014"}, {"Title": "excelent camera", "Author": "Daniel", "ReviewID": "R3GTPH24N41ZRJ", "Overall": "5.0", "Content": "Excelent camera with very fast focus.Great quality pictures. 19 focus points. 7 pictures / seconds.I highly recommend this purchase.", "Date": "April 4, 2014"}, {"Title": "Amazing!", "Author": "Ronald A. Gadiane", "ReviewID": "R15CTMTQSBVS2A", "Overall": "4.0", "Content": "This is what i want it's easy to connect to my smartphone. I can take multiple pictures for any positions.", "Date": "January 3, 2014"}, {"Title": "What a beauty", "Author": "Emmanuel N. Macaraeg", "ReviewID": "RVM1R8XG3ERPV", "Overall": "5.0", "Content": "I gave my T21 to my daughter and replaced it with this camera and I am beginning to like this more and more. I haven't fully explored its capabilities but since having it, I have already fell in love with its features.", "Date": "December 25, 2013"}, {"Title": "My first dslr", "Author": "BP \"billATL\"", "ReviewID": "R2O2QS3TDQSS8T", "Overall": "5.0", "Content": "This is a great camera I'm very happy with it.  Even the kit lens aren't bad.  I highly recommend it.", "Date": "April 13, 2014"}, {"Title": "Amazing camera!", "Author": "CaffeinatedCajun", "ReviewID": "R2O3CRWAEOL9VH", "Overall": "5.0", "Content": "The reviews I've seen on the two kit lenses, everyone says to go with the 18-55.  And so I did.. I'm super satisfied!  I love this camera and it'll work perfect for action/sports/kids as well as all of the other fun pictures to be taken.  I would choose this camera every time.", "Date": "March 8, 2014"}, {"Title": "Very Nice Camera", "Author": "AmazonCustomer \"AmazonCustomer\"", "ReviewID": "R2G0PAYU9WKVLK", "Overall": "5.0", "Content": "Takes really good pictures and does a good job with videos as well.  We should have gotten an external mic to cut wind noise down when we took video.  We also want to get a wide angle lens for taking better scenery pictures.  Overall,a camera that has more capabilities than us.", "Date": "October 12, 2013"}, {"Title": "Consider Other Suppliers", "Author": "Colin Lucas-Mudd", "ReviewID": "R2OQFIFANWC3AY", "Overall": "1.0", "Content": "Read the professional reviews. This is a great camera. As a long-time Canon user with a 5D MKIII, multiple 'L' series lenses, etc. I could say little else. This is a perfect only body for the serious photographer or a second for full-frame owners. However, consider other sellers.Amazon's performance on my purchase was appalling and possibly fraudulent. This particular purchase was a gift for my sister in Europe, ordered four days before my recent trip. On delivery the box was clearly re-sealed, accessory packaging opened, and other signs of hasty re-packaging evident. Immediate contact with Amazon resulted in an assurance that the product was new and that there was no way this was a returned/re-packaged product. After discussion, Amazon agreed to send a replacement but this did not arrive in time for my flight and was cancelled.I wrote, I called, I suggested that the replacement be delivered directly. The response was negative or arrogant to the extreme. As a result, I've paid full-price for an 'open-box' (being charitable) product. Oh yes, the proof... Come on Amazon, you can train your packaging staff better than that. The included strap was from a 5D, not 70D, and (I now know having bought another) that packaging was missing. Fraudulent or just sharp practice is debatable. Poor customer service is beyond doubt.", "Date": "May 1, 2014"}, {"Title": "I like this camera", "Author": "Brian Ginett", "ReviewID": "R1RUHW2IEG2HT3", "Overall": "5.0", "Content": "I am still learning all the new features of this camera. I am pleased with the image quality and the easy transition from my prior camera. I expect that it will take awhile longer to become comfortable with this camera.", "Date": "December 26, 2013"}, {"Title": "Magnificent DSLR", "Author": "E. Navarro", "ReviewID": "R2DWDMZXV5MOJL", "Overall": "4.0", "Content": "Been using the camera for a month, there are no complaints about it. I added the grip, a couple of batteries and gone to shoot. There have been some great pictures and some not as good or worthless. My fault and not the camera. I have used Xsi, 7D, 6D, 60D, 5Dii  5Diii and Nikon D90, D600 , D7000, and D7100. All the cameras do a great job efficiently. The important part is the photographic result, fortunately all this camera's do a great job.The 70D is a worthy replacement to the 60D but if you already own a 60D keep using it.I believe that no camera will make you 100% happy but again, who cares. Isn't the idea to capture an image and display it?Conclusion> It is a worthy, light camera capable of good images when properly exposed. The icing on the cake is the Touch Screen with multi-touch operation, as well as Touch AF! Excellent!", "Date": "October 19, 2013"}, {"Title": "IN LOVE", "Author": "Kendall McKinney", "ReviewID": "RFSPRXN55R7CE", "Overall": "5.0", "Content": "This camera is more than I could have every hoped for! I previously have the Canon T3i and this absolutely blows it out of the water! It's safe to say I'M IN LOVE!!!", "Date": "September 18, 2013"}, {"Title": "Yup. Love it.", "Author": "T. Kiesche \"Big Quiche\"", "ReviewID": "R1JBX6M1T9Y1N3", "Overall": "5.0", "Content": "It's taken me a little while to get used to not using a full sensor, but... With the addition of one new wide angle lens... I haven't touched my other cameras since buying this one.Shot: [...]Shot: [...]Shot: [...]Shot: [...]Shot: [...]", "Date": "May 9, 2014"}, {"Title": "Great camera", "Author": "allie", "ReviewID": "R1QQQ4W1OIAOG3", "Overall": "5.0", "Content": "Great product! Arrived in perfect condition. Exceeded all my expectations and I can not wait to get out there and experiment!", "Date": "March 5, 2014"}, {"Title": "Love it, but the time/date battery failed already.", "Author": "EFlyGuy", "ReviewID": "R3N5B1VW0DD3H9", "Overall": "5.0", "Content": "I love the features, light-weight and performance. The T1i was my first DSLR, I've learned a lot from that and was ready to step up to the next level. I have a lot more to learn, but already appreciate the AF improvements, and higher ISO range. The only negative is that after only a few weeks, it would occasionally lose time and date, meaning if I had to start shooting quickly, my pictures would have the wrong timestamp. Canon has handled the warranty repair, but still an inconvenience and disappointment.", "Date": "November 20, 2013"}, {"Title": "my first camera", "Author": "Karla Lane", "ReviewID": "R1ER0JM4RPUQ8G", "Overall": "5.0", "Content": "I love it... I don't know how to use it or what I'm doing with a camera like this, but I have it now and LOVE it. I love that I can use my phone to take pics. Who needs a camera guy then you have a Iphone. The videos it shots is amazing too. It's so easy to use and user friendly. Love the touche screen too.", "Date": "March 11, 2014"}, {"Title": "Wonderful First DSLR", "Author": "Stratos Diakoniarakis", "ReviewID": "RY15QA77RN2ET", "Overall": "5.0", "Content": "I've always wanted to get a DSLR and this is my first one. I was torn between this one and the Nikon D7100. I chose the Canon because of it's better video capabilities while the image quality was very close. So far I'm loving it and learning about DSLR's in general. I have quickly grasped most of it's capabilities and love creating HDR photos using Photomatix. I love this camera and fully recommend it to everyone looking to upgrade from the Rebel line.", "Date": "October 27, 2013"}, {"Title": "Never been happier!", "Author": "Francisco", "ReviewID": "R1M2AR4WHV793O", "Overall": "5.0", "Content": "I've just updated from a Canon Rebel XTi, to this camera. Never been happier. The camera is excellent in every way I could wish for. Its made of the best materials and has unlimited functionalities. This is the best camera a non professional can get!The WiFi feature is also very nice to take pictures alone or if you are only two, without having to bother anybody, or even worst... when you ask somebody to take a picture of you and your girlfriend o whomever, and they take the worst picture ever!!!!Now, with a mini tripod and your phone, you can see where to stand and whats the photo is going to look like!It has a LOT of cool features, and the way it films is superior to every other SLR, just look at the new video features and you will be gladly surprised.", "Date": "October 24, 2013"}, {"Title": "Focus issue???? Sign the petition!", "Author": "Mr. BuyMore \"HK\"", "ReviewID": "R110CBY5MKWL2W", "Overall": "4.0", "Content": "I really like the camera but there may be one big flaw. Focussing with live view is no problem but focussing correctly when using fast lenses (Sigma f1.8) through the viewfinder results in many missed shots. I have tried micro adjustments but that doesn't seem to work as the camera is inconsistent in how it misses focus. Research online indicates that the camera is simply not good enough for these fast lenses and that the only way acquire accurate focus is by using liveview....I am not sure if this is true....I expected a camera at this price point to do better. If you agree please sign the petition here and maybe we can get Canon to change this:[...]Update 3/27/14:Check out this video for more info: www dot youtube dot com / watch?v=cA6JnzYSDJEThis is a real problem and if I could still return the camera I would.CANON PLEASE RESPOND. Or better yet....fix it!Update 3/30/14I am sending the camera in for repairsThe lenses I use on this camera are the:- Sigma 1.8 18-35mm- Canon 1.8 85mm- Canon 3.5-5.6 18-135mmUpdate 4/5/14I did send camera in on 4/31Got it back from Canon on 4/4 - SUPER FAST TURNAROUNDFocus seems to be much improved but larger aperture and low light...Liveview focus is still more accurate.Added 1 star", "Date": "March 26, 2014"}, {"Title": "Great Camera", "Author": "Paul", "ReviewID": "R302P453M0KC1D", "Overall": "5.0", "Content": "Clear pictures, easy to use.  Kit lens is great outside, but need better aperture for inside sports.  Camera body is fantastic.", "Date": "April 8, 2014"}, {"Title": "Perfect camera", "Author": "Olivia Jones", "ReviewID": "R315LRCSEYB897", "Overall": "5.0", "Content": "My husband loves it and has taken many beautiful pics of our newborn baby girl. Very user friendly. Great buy.", "Date": "April 14, 2014"}, {"Title": "Service was excellent", "Author": "Fadi", "ReviewID": "R1HCK2REG0NOIP", "Overall": "5.0", "Content": "Service was excellent, Thanks for all Amazon's team. I hope all the best for all staff.Thankswith my best regards", "Date": "January 16, 2014"}, {"Title": "Great model", "Author": "Alejandro Martinez", "ReviewID": "R50RB72E0QH78", "Overall": "5.0", "Content": "Great new camera model from Canon, totally worth it. Great price for the specs, size and quality in this model.", "Date": "October 22, 2013"}, {"Title": "Defective in full auto mode", "Author": "GLG", "ReviewID": "RRWN3R73CZ52X", "Overall": "2.0", "Content": "I really liked this camera but had to return it for a defect.  Photos were often blurry when using the full auto mode.  Occasionally the built-in flash didn't fire even in low light situations.  I thought about getting a replacement but worried about quality control.UPDATE:  I decided to take a chance and purchase a replacement 70D (from a different online retailer this time) and I'm having similar focus issues with it.  The flash is working 100% this time but the images are still blurry when using full auto through the viewfinder (live view focuses properly).  I'm using the kit lens (ef-s 18-135 stm).  It appears the 19-point auto-focus is not focusing on the points indicated in the viewfinder, but on something closer.  It also chooses a high ISO when using the flash (like 1600) guaranteeing some graininess.  If this camera was for me I would keep it because I never use the auto-mode anyway, but it's my wife's and she does.  It will be returned.", "Date": "May 1, 2014"}, {"Title": "Focus Issue using the viewfinder", "Author": "Thomas D. Torkelson", "ReviewID": "R2F9FUJBOA3WWO", "Overall": "2.0", "Content": "I was very anxious for this camera to arrive with all the hype about its enhanced focusing attributes especially for LiveView and in Movie mode.  My first trial shots with this camera yielded some that I thought were pretty soft for the pixel count of the camera.  In subsequent photography outings I am getting less than 30% focused issues.  I was discouraged until someone asked me if I was having focus issues because they were debating on whether to buy this camera but the large volume of focusing issue feedback was making him think twice.  I had not heard of any focusing issues but a quick internet search on \"70D focus issues\" yielded a large volume of unhappy customers who have spent a lot of time researching the issue.  It appears that using the viewfinder can cause a large percentage of images to be out of focus but using the LiveView will almost always focus sharply.  I am still trying to figure out how to hold the camera so that I can tap on the back viewing screen where I want the focus.  I really need to use a mono-pod or tri-pod but this seems a hassle especially for action shots.", "Date": "April 8, 2014"}, {"Title": "Worth it!", "Author": "JD", "ReviewID": "R2JYCZ5B1T4PVR", "Overall": "5.0", "Content": "If you are looking for a high quality camera, this is a good one.I'm happy with my purchase !", "Date": "April 4, 2014"}, {"Title": "Fast, Fast,  Fast shipping!!!!", "Author": "Engelbert S.", "ReviewID": "R3H9NSXKDYHX0Q", "Overall": "5.0", "Content": "Shipping was fast,  great looking camera. Finally got to hold one, see one and own one:) Just wating for my 24-105mm come in.  Thanks", "Date": "January 19, 2014"}, {"Title": "Best Camera, on average", "Author": "Richard Barrier", "ReviewID": "RLMLFDQISKS2H", "Overall": "5.0", "Content": "While there are a small handful of cameras that best the 70D in specific categories, this is the best one on average.  I'm very happy with no regrets.", "Date": "November 20, 2013"}, {"Title": "Auto Focus Problems on 3 Canon 70d's", "Author": "Mr. Ralph J. Secoy", "ReviewID": "R2MB84LEU2OVK", "Overall": "1.0", "Content": "I am at a loss to see the overwhelming positive reviews of the Canon 70D, although this is a large part of my purchasing them.  All 3 that I tried had the same Auto Focus problems that could not be corrected by the AF Micro Adjustment.  Since my purchases, I have seen that others have similar problems under reviews at other sites.", "Date": "December 29, 2013"}, {"Title": "Did not work.", "Author": "John E. Taylor", "ReviewID": "R2TBS3SUOLYY33", "Overall": "1.0", "Content": "Arrived quickly as promised, but would not recognize or format mem card.  Radio Shack folks provided several types listed in the manual as acceptable , but none worked.  Returned for replacement - hope it's OK!", "Date": "April 5, 2014"}, {"Title": "Got a USED EOS 70D From Amazon", "Author": "davahad", "ReviewID": "R4JNXKKA54AGF", "Overall": "1.0", "Content": "Bought the package and an additional lens for over $1,800 and I guess Amazon thinks it is OK to ship used product.  Box was worn from opening, LCD Display had fingerprints all over it, and the lens had fingerprints and misc other spots on it.Needed this for a birthday this Saturday so returning to Amazon for a refund and going to Best Buy and get them to match the price.I am not likely to ever purchase a big ticket item from Amazon as I don't want used cameras, etc.", "Date": "January 30, 2014"}, {"Title": "Great Camera...", "Author": "M. Jones", "ReviewID": "R261YUG9XG394H", "Overall": "5.0", "Content": "I had the camera 2 days and have to return it due to a faulty SD card slot.  For whatever reason it won't read a single SD card I have - formatted ones that work great on another DSLR I have.Not sure what happened but the camera is amazing and hopefully this is a one-off scenario but with the photos I was able to take they were amazing.  Didn't get to try out the video as things broke too soon but hopefully no-one else runs into this as inside the pins and everything look good.  Maybe just a freak thing.", "Date": "August 31, 2013"}, {"Title": "Autofocus confirmation beep", "Author": "FreddieMurry", "ReviewID": "R1B7RGVYZYM25B", "Overall": "4.0", "Content": "I liked the IQ from this sensor, however, I returned it because I could barely hear the autofocus confirmation beep. Sometimes I heard it but I seemed to constantly be checking to hear it, and it drove me crazy. Might not seem like a big deal to others but I like the confirmation beep. I also felt that there were just a lot of bells and whistles that I wouldn't need, and since I am (as of right now) mainly a stills shooter and do not do much video, I returned the camera and got a refurbished 60D and couldn't be happier. The 60D was a big step up from my t3i. I used the money I saved and invested in some 2.8 glass from sigma. If you do video then this could be a good option.", "Date": "December 17, 2013"}, {"Title": "fine camera", "Author": "Ryan A. Dos Santos", "ReviewID": "R2HO9C5KPE5TDL", "Overall": "4.0", "Content": "No real complaints to date. Liking the new features having moved up from a canon t3i. Will comment again as I make more use of this camera.", "Date": "March 10, 2014"}, {"Title": "Nice camera", "Author": "Francis Pham", "ReviewID": "RV3B6NLC0E2J5", "Overall": "5.0", "Content": "It it nice camera but I like Canon 6d better than.It is worthy for $1300 to do as is it.Thanks", "Date": "March 1, 2014"}, {"Title": "its grate and nice cameras", "Author": "adnan", "ReviewID": "R20SHK6LDC5RY9", "Overall": "5.0", "Content": "if any one want a nice and simi por cam have to taken this oneim use it and happy with it", "Date": "October 5, 2013"}, {"Title": "Way over rated.", "Author": "Shaer", "ReviewID": "R3E0073JLI4M44", "Overall": "2.0", "Content": "The camera is nice and good, but over rated.It has many cons, some are serious, example:1.Build quality, no way close to a $1000 camera. In fact the poor build quality affects the controls, like the rear wheel, it's so cheap plastic that it's difficult to turn.2.Focus: With the kit lens(I have the 18-135mm) is good and accurate, but forget about it if you will use most other lenses. I tried the 50mm 1.4, the 50mm 1.8 and the 85mm 1.8, and with all of them the camera can not focus except in live view. I tried 3 cameras and all have the same problem. I was wondering how canon would release a camera with major defect like this. The dpreview web site noticed the same thing. Read their review. They were polite and blamed them selves not the canon. Surprising!3.The video: While many say it's great, it's no way compared to the Sony cameras. Also the canon is sticking to the 30p. No 60p.4.Custumization: poor for a 1K camera. Example: you can not assign the buttons you like. No comparison to other offerings from Olympus, Panasonic or Sony. I wish I can assign the WB to a button, but you can not. The Sony RX10 has 3 custom WB and the 70D has just one.5.WB: if you want to chance the custom WB, you have to go and dig into the main menu. A 4 or 5 steps. Coupled with the fact you have just 1 custom WB, is a difficult job.6.Program shift: you have to do it for every single shot if you shoot in P mood. It does not remember it.And so many cons.7.Focus, for the second time: Only good for stationary subject. Regardless of the focus mode you use, none works well for moving subjects.The camera takes nice pictures, but there are many better options, and with the release of the new Sony A6000, this camera is good only if you already invested in canon glass, and sadly most of it won't work with this camera.", "Date": "February 13, 2014"}, {"Title": "Love it, after a very long wait", "Author": "Bernard Icore", "ReviewID": "R47GJEELTKHTB", "Overall": "5.0", "Content": "the product is what I have order and expected and was not disappointed. Would recommend to my friend without hesitation.", "Date": "September 8, 2013"}, {"Title": "Huge defect in the 70D; Extreme underexposure using bounce flash", "Author": "RS \"RSCPA\"", "ReviewID": "R22HC643CPD047", "Overall": "2.0", "Content": "I am an amateur photographer and my new 70D that I purchased a couple months ago at B&H; has been doing the same underexposure stunt that so many others have experienced (For example, see in depth discussions by searching the internet for Canon 70D bounce flash underexposure).This occurs whether I'm bouncing the flash off a white ceiling that's about eight feet high or using a Sto-fen diffuser attached to my Canon 430ex II in E-TTL mode.Whether the lens being used is the Canon 15-85 or the 55-250 STM, all low light indoor photos with the diffuser attached and with the flash head tilted 45 degrees, or 180 degrees, or direct facing are very underexposed. Same results with bouncing the flash off the ceiling. The photos are even more underexposed when I'm zooming in on the subject.However, If I use Flash Exposure Lock(FEL) before snapping the photo, they all come out looking great, zooming in or not. Without using FEL, the pictures are way underexposed.If I use the same flash setup in the flash's manual mode, without using FEL, and adjust the power down to say 1/2 or 1/4 or somewhere in between, the photos seem properly exposed (as long as I dial in the correct flash power adjustment). With a zoom that has a variable aperture, it's a hit and miss approach and quite cumbersome.Also, I tried the same lenses attached to my Canon T3i taking the same photos as I did with the 70D using the same flash and diffuser without using FEL. The photos all came out looking perfect with no underexposure whatsoever. Then I tried using FEL with the T3i. There was no difference between using FEL and not using it on my T3i. All photos with and without FEL were properly exposed and looked great.I use bounce flash indoors a lot for our one year old granddaughter. I never had this problem, or any other issue, with my T3i. I guess I'll have to resort to FEL use, but that amount flashes takes a toll on an infant. She begins to cry after a few photos if I'm using FEL for each one. Plus, it's hard to get candid shots when an FEL pre-flash is being used.This isn't what I bargained for when I \"upgraded\" my camera body.I'm now wondering if this will negatively effect exposures on outside fill flash photos with a diffuser attached.The fact that Canon hasn't addressed this yet is disconcerting to say the least. Unless they come up with a fix fairly quickly, I'm not sure I'd ever buy another Canon camera after this.", "Date": "March 31, 2014"}, {"Title": "Disappointing Camera", "Author": "Tokugawa Ieyasu \"Careful Buyer\"", "ReviewID": "R3CB6JRE0A4UPF", "Overall": "2.0", "Content": "I researched this camera well online before deciding to purchase. Most reviews made it sound like a great camera. Took it out for trials 3 times and was disappointed with all 3 shoots. Video focus tracking only worked half the time when handheld. Quality of the videos was not full HD when viewed at home. Photo colors were not true unless taken in direct sunlight. You expect much more from a 20.2mp camera. Half of the still photos were not clearly focused. I have cheaper canons that do a better job. Might have received a flawed unit or the kit lens is junk, but I'm sending it back for a refund. See the Amazon review by Mr. Ralph J. Secoy. Same issues.", "Date": "January 1, 2014"}, {"Title": "Err 30", "Author": "columbus", "ReviewID": "R2ZLZT256E9E1P", "Overall": "1.0", "Content": "Never got to take even 1 shot with this camera, straight out of the box I got Error code Err 30 which is a lens error I tried it with the lens off and with it on and still got the same error code.  When i called canon the guy treated me as if I was stupid and was telling me there is no way that there can be a err 30 code because thats a lens error and usually happens after a lot of use.  Said i can send my brand new camera for repair.  so needless to say I sent it back to Amazon for a refund. I gave it a 1 star because of the customer service I received from canon not for the camera itself because i never got see how the camera performs.", "Date": "September 26, 2013"}, {"Title": "Fantastic camera held back by poor software and auto focus issues", "Author": "Ryan Henderson", "ReviewID": "R3VLJZ1BJN074O", "Overall": "2.0", "Content": "Lots of great positive reviews on here.  Here are some cons to think about if they effect you:- Cannot sync full sized JPG and RAW files to Android- Cannot directly upload to Facebook or my TV via DLNA- Cannot take video while WIFI is enabled- Does not support USB 3.0- No IR focus headlight.  Uses flash for low-light focus which will blind your subject.- Image quality in low light a bit noisy- Auto-Focus on the center focus point required +17 manual focus adjustment with a new 50mm f1.4.  Note, MFA adjustments only apply to P, Av, Tv and M modes.Search for Youtube video \"70D Bad Focus Issues\" by CameraRec Toby for more info on the focusing issue.", "Date": "February 26, 2014"}, {"Title": "Why I returned 70D+EF 24mm f/1.4 lens", "Author": "Phoenix Rising", "ReviewID": "R2BZFLFOIPUREY", "Overall": "4.0", "Content": "I consider myself an avid photographer. I currently own a Canon Xti + Tamron 17mm-50mm f/2.8 lens. I also own a Canon PowerShot s95. I am extremely happy with both cameras. Because my wife and I recently had our first born child, I started searching for a low light camera + lens combo that is capable of autofocusing during video, which the s95 cannot.My search brought me to the 70D + EF 24mm f/1.4 II USM lens combo. I'm not going to restate all the excellent attributes of the camera and lens. I took some amazing natural light / low light pictures and video of my daughter with the 70D + EF 24mm f/1.4.However, I couldn't see myself lugging that thing around everywhere. I can put the s95 in my pocket; can't do that with the 70D + EF 24mm f/1.4. The more I thought about it, I realized that the hefty 70D + EF 24mm f/1.4 would get in the way of me taking the pictures and video I want to take. Simply put, I upgraded the wrong camera. I should've bought a replacement for the Canon PowerShot s95.So I sent the 70D + EF 24mm f/1.4 back and purchased the Sony RX100 II. I've always been a Canon loyalist. But I decided to buy the Sony because of all the rave reviews I've read; it should meet my needs (hasn't arrived yet). But I haven't completely abandoned Canon; I also picked up a Canon EF 85mm f/1.8 USM that I'll use on the Canon Xti body.Bottom line: the 70D is a fantastic camera. But to justify the expense, make sure you're going to use it to its fullest potential. Something like a Canon Rebel T5i + Canon EF 28 mm f/1.8 USM may be just what you need.", "Date": "February 5, 2014"}, {"Title": "Canon EOS 70D rating", "Author": "gennie", "ReviewID": "R3S3RJY10YLOED", "Overall": "4.0", "Content": "I've not had the time to use it like I plan to, but so far, I've taken some good photos with it.  I was a little disappointed with the weight.  I added a 18-270 Tamron lens to it, which is lighter than some others with this range.  I had an earlier EOS model that I'd had for several years and was expecting this one to feel about the same.  As usual, several things have changed, so it will take me some time to feel totally comfortable with it.  I'd researched it, consider the Nikon, but I still think I've made the right choice for me.", "Date": "December 1, 2013"}, {"Title": "Two Defective Units Before Heading to Best Buy", "Author": "Credo", "ReviewID": "R3NA6SQ8MW241C", "Overall": "1.0", "Content": "Do not buy a 70D from Amazon.  I bought two and both were defective out of the box.  I ended up driving to Best Buy and buying one that was okay.I own about $10,000 worth of cameras and lenses, many of which I attempted to buy from Amazon.  The overwhelming majority of the camera equipment I've bought from Amazon has been defective.  I'm honestly beginning to wonder if Amazon buys some manufacturer's QC rejects for a discounted price.Triple check everything you buy from Amazon for defects and also verify that you haven't bought a counterfeit item.  I frequently catch counterfeit products and I destroy them prior to returning them for refund.  I encourage you to do the same.", "Date": "November 22, 2013"}, {"Title": "break battery", "Author": "Justin", "ReviewID": "R34YG6ELCGWYNY", "Overall": "1.0", "Content": "the Battery does not work, even I charge the power. When I get the battery, there is no power in it. I think this product was opened before I get it.", "Date": "March 18, 2014"}, {"Title": "putting this in 1 star just because of audio.", "Author": "Ian Jensen \"Spaghettiman\"", "ReviewID": "R3KH4HGRXBSFD5", "Overall": "1.0", "Content": "Audio plug is worthless. Microphone is even more worthless.I plugged in external shotgun mic with a 1/8 adapter. It was snapping and noisyThe onboard microphone was just as bad. Snapping and noisy and well worthless. Just garbage", "Date": "April 14, 2014"}, {"Title": "It's probably a great camera with the right lens and in the right hands but make sure this is what you really want", "Author": "Ruben Miranda", "ReviewID": "R1Y4ARS6I26OVT", "Overall": "3.0", "Content": "I researched and waited for this camera to go on sale and pulled the trigger.  The first thing I did was charge the battery, the next thing I did was take photos of my daughter.  My home is reasonably well lit and I was surprised when the flash popped up as I attempted to take a photo of my daughter.  This is probably due to the kit lens and so I disabled the flash and tried to take photos in the existing light, I then took more photos with the flash.  I also took some video which caused the lens to hunt even though the camera was pointed directly at my daughter and the room was well lit.  When I put the SD card into my computer really wanted to be excited and wanted to love what I was seeing but I wasn't. I realized I might get better results with a better (prime?) lens but I also realized that the camera was just too big and heavy and that I was probably going to leave it home most of the time. I have owned DSLR's before, and I was happy with my Nikon which died after getting sand in the lens which was too expensive to replace. That day I was taking my family out for dinner and I wanted to bring the camera but I just could not imagine lugging it around and finding room for it on the table.  It started to dawn on me that I might not have been realistic in my selection and that while I would not mind spending money on better glass and maybe even mastering the controls and settings that would get me the photos I wanted, I really need something more portable. Perhaps I need two cameras? One like this and another small P&S; I can carry in my pocket. Maybe there is a middle ground, a camera that can offer both small size and great features. With that I have decided to return this camera and either wait for the Sony A6000 or maybe find something else better suited to my needs (small with a changeable lens).  Micro four thirds? a sony RX100? there are so many options, just sadly not this one.", "Date": "February 25, 2014"}, {"Title": "Really, What about this?", "Author": "Mike M. \"MrMikeFla\"", "ReviewID": "R1XJ0ZRDF71YO7", "Overall": "3.0", "Content": "I Just have one big observation, CHEAP!! I don't mean the price (that's not cheap)I mean the construction. Come on Canon, It feels like I am holding a $200.00 Rebel. I know it's not a \"PRO\" camera but it is a \"prosumer\". That middle level just below Pro and way above consumer. I hate the feel!! No one will say it but switch from a solid \"prosumer\" camera like my Canon 40D (now 7 years old) and the 70D feels like a kids toy. I am afraid to shoot with it! The menu wheel feels like it cost $2 bucks and should be on a $40.00 camera. I don't care how good it works, give me form and function!! If I can't buy a Pro camera for $4000.00 give me one that feels like a pro camera (like you did with the 40D). I waited 7 years to upgrade and I feel like I bought a toy. I'm not sure I will keep it...", "Date": "September 6, 2013"}, {"Title": "Over priced", "Author": "Barrington Shopper \"Concerned Consumer\"", "ReviewID": "R2MSV5TIC60I0A", "Overall": "2.0", "Content": "Over priced not a full frame sensor. For a $1200 camera it should have a full frame senor.Their still not there yet. We have to hold off until they produce a camera with a full frame senor for a reasonable price. So we wait.....", "Date": "May 19, 2014"}, {"Title": "Should be better in 2013", "Author": "Jonathan", "ReviewID": "RQSU0TOJZ2JI7", "Overall": "3.0", "Content": "Images are softer than expected. The swivel touch screen is not really comfortable to use with your left hand (considering your right hand is holding the camera). The focusing appeared to be very fast and accurate except later I found most of my images were not properly focused. This is most likely due to the lens I used (Sigma 18-35mm f/1.8), but cannot say with 100% certainty.", "Date": "November 6, 2013"}, {"Title": "Revised Review", "Author": "richard", "ReviewID": "R2CC8G0254TGVT", "Overall": "5.0", "Content": "I've been planning to purchase the 70D EF-S 18-135 IS STM for my wife for our anniversary in a few days.I watched the price go from $1,249 before the holidays to almost $1,500 after the holidays.She's a Canon girl with 3 Canons already.But - NO. NO CANON this time. I don't care which are the whiz-bang features nor who sets the prices (Canon, itself, I presume).$200-$300 more after the holidays! They don't need my money. They won't be receiving it either.For all of your Canon groupies:I have since ordered and received the Canon 70d - AT THE SALE PRICE THAT I HAD ORIGINALLY WANTED.As I have said all along, we LOVE Canon products. I just did not like the more expensive price.The 70d is one magnificent piece of technology.5-Star all the way!!!! ESPECIALLY at $1,249.00!!!!!!!!", "Date": "January 7, 2014"}], "ProductInfo": {"Price": "$1,199.00", "Features": "Canon's innovative Dual Pixel CMOS AF enables you to shoot video like a camcorder with smooth, fast, and accurate autofocus; lets you enjoy instant and precise autofocus even when shooting stills from a variety of angles with the freedom provided by the Vari-angle LCD. 19-point all cross-type AF system (including a high-precision f/2.8 dual cross-type AF center point) with a wide area arrayfor exceptional autofocus performance and greater compositional freedom when shooting with the viewfinder. Intelligent Viewfinder with superimposed LCD display provides approximately 98% field of view, and Multi-Aspect ratio in Live View broadens your choices in composition.\n20.2 Megapixel CMOS (APS-C) sensor, 14-bit A/D conversion, ISO 100-12800 (expandable to H: 25600) for shooting from bright to dim light and high performance DIGIC 5+ Image Processor for exceptional image quality and processing speed.\nEOS Full HD Movie mode with Movie Servo AF for improved continuous focus tracking of moving subjects, manual exposure control and multiple frame rates (1080: 30p (29.97) / 24p (23.976) / 25p, 720: 60p (59.94) / 50p, 480: 30p (29.97) / 25p), built-in stereo microphone, manual audio level adjustment with attenuator function to reduce audio clipping, and Video Snapshot with editing for expanded movie shooting options.\nVari-angle Touch Screen 3.0-inch Clear View LCD monitor II (approximately 1,040,000 dots) with smudge-resistant coating features multi-touch operation and Touch AF for an easy and intuitive experience, flexible positioning, and clear viewing even when outdoors in sunlight.\nBuilt-in wireless technology allows you to wirelessly transfer your images to social networking sites through CANON iMAGE GATEWAY, share your images with wireless-enabled Canon cameras, or upload virtually anywhere on your iOS® or Android(TM) smartphone* with the free download of the EOS Remote app.", "Name": "Canon EOS 70D 20.2 MP Digital SLR Camera with Dual Pixel CMOS AF  (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/41bSUoj8HJL._SX300_.jpg", "ProductID": "B00DMS0GTC"}}