{"Reviews": [{"Title": "Great Price!", "Author": "Lem", "ReviewID": "R158VFUVJXFZCA", "Overall": "5.0", "Content": "I returned my Canon 70D camera from another seller when I saw this crazy deal. It comes with so many acceroies for the same price as the other Seller who is just selling the camera and lens. Anyways the camera is awesome, I don't have to manually focus on my subject anymore. The video is sharp and clean. Click here for my video review: https://www.youtube.com/watch?v=_Z5aahLQ1kM", "Date": "November 30, 2013"}, {"Title": "Love it but the tripod is a joke", "Author": "G. Carstensen", "ReviewID": "R2O36HE07Y32JX", "Overall": "4.0", "Content": "All in all I am happy with this package - especially the lenses and the cam. However the mini tripod is a joke. It will not cary the 70D... bummer.", "Date": "October 3, 2013"}, {"Title": "Canon EOS 70D sweeeeet", "Author": "David Howard", "ReviewID": "RBJM7D7XJ37R3", "Overall": "5.0", "Content": "because I bought this Canon package 2 weeks before a photo opportunitiy of a lifetime with little or no photo experience.  I came back with pictures that look like national geographic was behind the camera.", "Date": "November 4, 2013"}, {"Title": "Go for it!", "Author": "Vimal Varghese", "ReviewID": "R3GL87CZL1NRTV", "Overall": "4.0", "Content": "Exceptionally good camera and deal.  Waiting to try with Canon 24-70mm lens which should be the best companion for this 70D", "Date": "January 29, 2014"}, {"Title": "excellent enthusiast camera.", "Author": "JetTech", "ReviewID": "R1J1S2LT3JQSRD", "Overall": "5.0", "Content": "Upgrading from a rebel xti I'm very happy with this purchase. I bought all my glass before getting decent body. I was split between this and the 6D. I do wish it was better in low light but it has other features that make up for it. Don't get me wrong it is still a good performer in low light. I can live using my 580 exii flash for those low light moments. I don't shoot weddings therefore I don't have such a necessity for full frame. This camera has a very decent 7 frames a second. The touch screen is excellent and acts just as a smart phone. The fact that it articulates in every direction is also a plus for those overhead shots or video. The wireless function is also nice for viewing pictures and deleting them in the field without a computer or having to hold the camera. It also comes in handy for sharing pictures on-the-go. Another nice feature is that it's not as heavy as the 7D or the 5D. Overall this camera is hard to beat at this price level given all the features it offers. I have it paired with a 24-105 f4L which has come to life off of the rebel. My 70-200 f2.8L is ii now has a camera attached to it since it only had a \"Glorified lens cap\" with the xti. I have not tired my 50mm 1.4 or my 18-200. I know I won't be disappointed. I got some amazing shots of my family on our last vacation and hope to capture many more moments.", "Date": "January 24, 2014"}, {"Title": "Great Camera", "Author": "Jeff W Sesterhenn", "ReviewID": "R2VAXKHURF71KK", "Overall": "5.0", "Content": "I Love this camera.  I mainly bought it to photograph my kids sports, and with its speed, I have captured some great shots, and thats just in easy mode.  I am very please with it right now.", "Date": "January 8, 2014"}, {"Title": "Canon EOS 70D", "Author": "B. Parris", "ReviewID": "R1RCYNLM365UG6", "Overall": "5.0", "Content": "I received the 70D just days after it was released.  I had researched several different cameras before deciding on that model.  I am not a professional photographer but wanted to enhance my amateur skills and this camera is providing the platform for that. My wife and I have completed three photography courses and plan several more. I like the 70D so much, I bought one for my wife at Christmas.  I read all the pro and con statements about this camera and comparisons to other cameras.  Most are just personal preferences with a few technical comparisons.The 70D is a great camera. Canon has hit another home run with this model.", "Date": "January 2, 2014"}, {"Title": "Love the camera and the bundle!", "Author": "Rodrigo Crespo", "ReviewID": "R2S0LTU4PYJN3X", "Overall": "5.0", "Content": "First, the price was great lot the stuff I got and everything was new and working perfectly. Second, did I tell you I love this camera? Great features for a semi pro like myself and it's really easy to use.", "Date": "December 31, 2013"}, {"Title": "Gift for our son", "Author": "Christine Coolidge-Strauch", "ReviewID": "R2FR3SXWPL03U9", "Overall": "5.0", "Content": "Our Son was very Happy with camera but, the bag is way to small for the camera and lens and accessories.", "Date": "December 27, 2013"}, {"Title": "Outstanding Camera", "Author": "Larry LaRue Brown", "ReviewID": "R2CGFOKO5SLG0S", "Overall": "5.0", "Content": "Is a very capable camera with the features needed to take photography to the next level.  Still experimenting and will let you know when I have some more experience how it stacks up with my expectations. Having extensive experience with ultra high speed cameras/photography it is interesting to experiment with the other end of the spect per second frames per second wise.", "Date": "December 23, 2013"}, {"Title": "GOOD PACKAGING", "Author": "laelly", "ReviewID": "R2GBOYVUSIVPII", "Overall": "5.0", "Content": "absolutely love this camera for movies !And love all the other accessories includedGood purchase, compare to the other store, you have more for cheaper", "Date": "December 25, 2013"}], "ProductInfo": {"Price": "$1,199.00", "Features": "EOS 70D 20.2 MP CMOS (APS-C) Digital SLR Camera with 3\" LCD (Body Only)\n32GB Secure Digital SD Memory Card\nCompact Deluxe Gadget Bag - DC74\n3pc. Lens Cleaning Kit", "Name": "Canon EOS 70D 20.2 MP Digital SLR Camera with Dual Pixel CMOS AF (Body Only) 32GB Pro Kit - Includes camera, 32GB Secure Digital SD Memory Card, Compact Deluxe Gadget Bag - DC74m 3pc. Lens Cleaning Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/516UAPcwrUL._SY300_.jpg", "ProductID": "B00DQXJM6Q"}}