{"Reviews": [{"Title": "Nice bundle for expecting parents & amateur photogs", "Author": "Patrick", "ReviewID": "R2YECTR3PRCJ85", "Overall": "5.0", "Content": "The extra batteries and memory card alone make this bundle worth it.  The tripod is also a must for night shots, action, video and portraits.  I only 10% into the features of the camera and it has already amazed me.  Best point and shoot on the market with HD capabilities.", "Date": "September 19, 2013"}, {"Title": "Consider Your Hands", "Author": "molde music", "ReviewID": "R3EMVDTSL6H6HJ", "Overall": "4.0", "Content": "Just received this \"little\" Sony RX100M2 camera. Have taken a few shots and these are my initial comments:1) This Camera is small. Good and bad in some ways. Great to put in your pocket and go. Small enough to be carried everywhere. I even put it my pocket when I go bike riding. This size camera also brings an other consideration. . . how big are your hands? Mine are average for a male. However, I am having to get use to holding the camera correctly for its size. When holding the camera with my right hand to shoot, it is difficult to not press the \"info\" button accidentally at the bottom right hand corner. Just press it again to turn off. Also difficult to not press the flash side of the control wheel accidentally. Both just inconvenient, just hard to get use to. Sony has designed a rubbery grip at the top next to the \"Record\" button but I tend to want to hold it at the bottom corner.2) Highly recommend getting the Sony AG-R1 grip or equivalent. You will definitely need additional grip assistance on the front side of this camera. It literally is so small and compact that anyone's hands have to adjust to this little gem of a camera.3) Great pics so far and I'm not not even accustom to all the settings. A little bit difficult to control highlight areas so far but will be fun to get to learn more of this camera's traits. I take pics for a living and this camera is just plain fun to use. The flash is quite versatile in that you can adjust the tilt direction of the flash but will have to hold and tilt the flash head yourself, there is not preset adjustment built into the flash. My only real complaint so far is the refresh rate, a little slow but certainly acceptable, just not great in that aspect.4) Auto-focus in Macro setting is not perfect. May need to adjust the focus area smaller to help auto0focus feature. It tends to falter in this area a little. But manual focus is always an option too, so no big deal.5) Love the \"control ring\" to the rear of the lens. You can set this to function how you like. The default out of the box seems to be to control zoom.6) Do not expect a \"real\" instruction manual with the product. To get that you will need to visit the Sony website and type in the model number and download the PDF of the manual.7) Considering this camera and its size, having it shoot in RAW format and with a full 1\" size sensor is the best part ! Hard to find that on a compact digital camera.So far not disappointed in this little gem of a camera. Will update later after using the camera more.", "Date": "January 16, 2014"}, {"Title": "Big Performance in a Small, Convenient Package", "Author": "James P. Beard", "ReviewID": "RGYD0S6TUFMT2", "Overall": "5.0", "Content": "I was looking for all of the DSLR features I could get in a small, easily transported package.  After a lot of research on most of the small cameras on the market I opted for this model.  After two months of use I know I made the right decision.  I shoot primarily RAW photos and 60P HD video.  This camera handles both very well. Since my primary camera is a SONY Alpha99 I adapted easily to the menu and feature list and find that I now use this camera 90% of the time.  I don't need to list all the features, you can find those on any product description.  But, I don't think there is another small camera in the same class.  As info I did purchase the recommended SONY flash (very compact and useful) and the accessory external microphone (probably useful but I haven't used it enough to tell).  I would buy this camera again without question.", "Date": "January 15, 2014"}, {"Title": "Great product", "Author": "Joshua Askew", "ReviewID": "R27S9JS9SZJ1MR", "Overall": "5.0", "Content": "Great great product.  Could not be happier.  Wonderful purchase.  Kudos to Sony.  Best camera I have ever purchased in this life.", "Date": "January 9, 2014"}, {"Title": "Best value for camera package", "Author": "Alexron \"MUSIC EDITOR\"", "ReviewID": "R24IBYDOP0NX1U", "Overall": "5.0", "Content": "excellent value for camera accessories, I Love my Sony camera. compact, a little heavy but the results are incredible. Great latitude on low light situations and when you think that its close to impossible to get a descent shot on night scenes, just click and the camera do its magic, you will be surprised of the quality and results.Cant go wrong with this purchase.", "Date": "December 10, 2013"}, {"Title": "Best point and shot camera I ever had - best tool jump start your photography learning", "Author": "Victor", "ReviewID": "RLSL3M83F1IW3", "Overall": "4.0", "Content": "I am happy with the investment I made on the pack.Only 1 star missing to perfection here - it needs the leather cover or hand-held grip as the camera body is very very slippery!", "Date": "October 2, 2013"}, {"Title": "major crippling video WB issue", "Author": "Casey Mcgonagle", "ReviewID": "R3QKBFRIL5X2W5", "Overall": "1.0", "Content": "what is one of the main differences between this camera and the rx100? this camera can be controlled remotely via smartphone which is a really useful concept if you record yourself. Too bad you can't use a custom white balance setting if controlling via mobile phone. Why can't the remote app just record with the settings in the camera? Is there a reason? Sony tech support says it does not work because you cannot do it. Thanks Sony.Is 1 star a harsh rating? I just returned the $450 RX100 because I realized I needed a remote control solution, one of the only things this camera has over the previous model. Unfortunately the remote control function is crippled for no reason . It only allows you to shoot in automatic settings. Worthless.", "Date": "January 8, 2014"}, {"Title": "Not that swell of a deal", "Author": "Steve T. Raney", "ReviewID": "R3E18EKTFELOYF", "Overall": "3.0", "Content": "Has some glitches in it.  Auto focus does not work well.  Bigggest bug is the slowness of the shutter when snapping multiple frames.  Other issues that I refuse to list here.", "Date": "October 22, 2013"}], "ProductInfo": {"Price": "$748.00", "Features": "1-Inch 20.2 MP Exmor R sensor for extreme low-light shots\nBright F1.8 Carl Zeiss Vario-Sonnar T lens w/3.6x zoom\nTiltable 3\" Display\nUp to ISO 12800 sensitivity", "Name": "Sony Cyber-shot DSC-RX100M2/B RX100M2 RX100M II RX100MII 20.2MP Wi-Fi Digital Camera Bundle with Sony 32GB Memory Card + Wasabi Power Replacement Battery for Sony DSC-RX1 + Sony Black Carrying Case + Wrist Grip Strap + Camera Accessories", "ImgURL": "http://ecx.images-amazon.com/images/I/51ZBjEe1y4L._SY300_.jpg", "ProductID": "B00DUX23YU"}}