{"Reviews": [{"Title": "Elph keeps getting better, and smaller.  The perfect bridge between Phone and DSLR.", "Author": "S. Power", "ReviewID": "R1M2PQPQ0M5LEX", "Overall": "5.0", "Content": "I first bought a Canon Elph over a decade ago because of its small size, quality build, and excellent pictures.  We have purchased several since then because they keep getting better.  This is no exception.  Faster, smaller, and ever better pictures than its predecessors, Canon keeps me coming back for the latest Elph.I have bought nothing but Canon Elph cameras since first trying them in about 2000, with one exception.  Last December we bought a Canon PowerShot SX50 HS 12MP Digital Camera with 2.8-Inch LCD (Black), thinking that the camera in our Google Nexus 4 Phone 8GB - Unlocked was so good that we could use it for day to day shooting and use the SX50 for more deliberate photography.  Although I don't regret buying the SX50, the theory about the camera phone replacing our old Canon Elph was flawed.  The camera in the Nexus 4 (or Iphone 5) is great for a phone, but nowhere near as good as a real camera.  On the other end of the spectrum, the SX50 is outstanding, but is so large and bulky that we find ourselves never wanting to bring it anywhere.  This Elph 520 is the perfect bridge between the camera phone and the real camera (SX50 or a real DSLR).  It is as easy to carry as the phone and takes pictures that are almost as good as a DSLR.The only thing that I wish Canon would do better is picture sharing.  We considered the Canon PowerShot ELPH 530 HS 10.1 MP Wi-Fi Enabled CMOS Digital Camera with 12x Optical Image Stabilized Zoom 28mm Wide-Angle Lens with 1080p Full HD Video and 3.2-Inch Touch Panel LCD (Black) for this reason but were scared away by the bad reviews.  Whether over Wifi or Bluetooth, Canon needs to make a simple way to quickly share the pictures we take onto Facebook or other sharing sites.  The only reason we ever reach for our phone instead of this camera is because of the easy of sharing.Until Canon comes out with a camera that can transmit pictures over wifi or Bluetooth better, I recommend this camera.  It takes great pictures, is very fast, and is built like a Rolex Watch.", "Date": "June 15, 2013"}], "ProductInfo": {"Price": "$344.99", "Features": "This kit includes 12 items, Camera includes all manufacturer's supplied accessories & Warranty, Additional accessories are backed with Hot Deals Electronics 1 year 100% Satisfaction Guarantee\nCanon PowerShot ELPH 520 HS 10.1 MP CMOS Digital Camera with 12x Optical Image Stabilized Zoom 28mm Wide-Angle Lens and 1080p Full HD Video Recording (Black)\n16 Gigabyte MicroSD High Capacity Memory Card - SD USB Memory Card Reader - Universal Memory Card Wallet\nAdditional NB-9L Rechargeable Lithium ion Replacement Battery - Compact Hardshell Digital Camera Carrying Case with Inner Pocket & Neck Strap\nFull Size 50\" Tripod w/Case - HDMI Cable for High Definition TV connection - Flexible Mini Table Tripod - Lens Care & Cleaning Kit - Package of LCD Screen Protectors - Quality Fiber Cleaning Cloth", "Name": "Canon PowerShot ELPH 520 HS 10.1 MP CMOS Digital Camera (Black) + NB-9L Battery + 10pc Bundle 16GB Deluxe Accessory Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/51AiYjPxodL._SY300_.jpg", "ProductID": "B00D8FQKEE"}}