{"Reviews": [{"Title": "Be careful if you buy from Focus!", "Author": "Be_Fair", "ReviewID": "R2ZX706XY4E0QL", "Overall": "3.0", "Content": "Very disappointed, I got the package today and discovered that it's not a NEW camera (as stated on Amazon site). NO SONY seal on the box, had finger prints, etc. and was not able to replace it with a brand NEW. Be Careful!!!", "Date": "August 28, 2013"}, {"Title": "refurbished camera + junk = not worth the trouble", "Author": "D. Erikalov", "ReviewID": "RE3OBFA5UCCTZ", "Overall": "2.0", "Content": "I am not rating the camera (which is excellent) but the kit.I feel that Focus Camera sells discounted refurbished cameras. My camera was defective (flash not working) so I returned it. Also, I hate (excuse the strong word) cheap junk and this kit is full of cheap junk, except the extra battery and SDHC card.", "Date": "November 6, 2013"}, {"Title": "Great camera, and good accesories", "Author": "B. Morris", "ReviewID": "R262ZJNLIWE76H", "Overall": "5.0", "Content": "I got this camera on Saturday, so I haven't had time to play with it that much.  So far it seems very good.  My one disappointment is the wifi transferred photos are lower quality (1616 x 1080) and you can't change it.  However, this is good enough for social media sharing.In terms of this bundle, the memory card and case are genuine Sony products.  The HDMI cable, battery, and tripod are third party.  Basically, this is a great deal, as the Sony 64 gig memory card would cost you something like $37 on its own.  Some of the accessories are not that useful, but given this camera is selling for MSRP everywhere (including Amazon), this is a good deal.", "Date": "August 26, 2013"}, {"Title": "Amazing camera; lots of thoughtful accessories", "Author": "Retinadoc \"Retinadoc\"", "ReviewID": "R2ALQFLRA90YPD", "Overall": "5.0", "Content": "The camera is amazing.  So compact, but very dense and solid.  The images are extremely detailed, and rival those of my Canon 50D, a large traditional DSLR camera.  The image quality is leagues above any other point/shoot camera currently on the market.  The accessories provided by Focus Camera were very generous and thoughtful.  This is one of my Amazon purchases I am the most satisfied with!", "Date": "September 12, 2013"}, {"Title": "Great Camera", "Author": "Jonathan Stewart \"jonathan_stewart2\"", "ReviewID": "R2QKK036AXWQIF", "Overall": "4.0", "Content": "I'm a semi-pro, using the a99, looking for something pocketable that wouldn't take pictures that looked like they came from a cell phone.  Here are my impressions after using the RX100II on a weeklong trip to the Alaskan tundra:Pros:1.  Image quality is the best I've seen on a compact, probably as good or better than my old Sony a55 DLSR.2.  Auto focus is fast and accurate, as long as you're not shooting through a dirty window.3.  The built-in flash is surprisingly powerful.4.  Front control ring multi-function is intuitive and easy.5.  Menus and control layouts are familiar to existing Sony DSLR users.6.  Lens zoom range is very useful, and f/1.8 at the widest end is helpful in low light.7.  Decent low light performance, which includes image stabilization.8.  Small size opens new possibilities for portability, and less intimidating when shooting candids.9.  Pretty good battery life.10.  Solid build and hand feel.11.  Can be charged with any micro-USB cell phone chargerCons:1.  Manually adjusting shutter speed using the back control ring is a hassle.  One false push and you've turned on your flash instead of changing your shutter speed, since the ring serves multiple purposes.2.  Manual focus is difficult, since it's electronic without the feedback you'd get from a regular lens.  Focus peaking helps, but the focus magnifier just makes things worse.3.  Auto focus differentiates poorly when shooting through dirty glass, and there's no way to select a focus point, as with a DSLR.4.  Auto WB is not as accurate as I would like, tending to be warmer than necessary.5.  When shooting in auto mode, the camera defaults to higher ISO instead of larger aperture in lower light situations.6.  The images are still somewhat noisy at high ISO, above 800, but acceptable.7.  No GPS8.  Sony Play Memories cellular app is quirky, and you can't access the photos on your phone unless the camera is connected. I have to turn off cellular data on my Samsung GS4 to get the phone to connect, then turn it back on to share a photo, losing the camera connection.Despite the shortcomings, I'm very happy with the RX100II, mainly because the image quality is just so good for a compact, and while not quite offering the level of control of my a99, it comes pretty close.", "Date": "January 24, 2014"}, {"Title": "Elated with the low light performance", "Author": "Shayan Sanyal", "ReviewID": "R155VE3H7UH9MX", "Overall": "5.0", "Content": "The camera is awesome, and am pleased with its low light performance. The feature that gets the most use is the NFC transfer to smartphone. Love that I can Instagram moments after taking the shot on my RX 100.The bundle is good, if only for the travel tripod, the sdhc 64gb card. Would be good to throw in an external battery charger for the extra battery.", "Date": "December 30, 2013"}, {"Title": "Takes great photos", "Author": "2Perno", "ReviewID": "R258FUSEM1PLTT", "Overall": "5.0", "Content": "I am amazed by how small this camera is, its multiple features, and what great photos it takes in dark places.  The package is the way to go and Focus shipped it out quickly.  I own a Nikon D300 and it takes some effort to lug it around.  I wanted a small camera for travel that approaches DSLR quality and this camera appears to fit that function.  Its quality is well above a point and shoot.  It has many useful intelligent scenes and does a great job selecting them automatically, or you can shoot manually.  Wifi is easy to set up with an iPad and  the ability to tilt the LCD is a great feature.  I have only two negative comments.  First, the users manual is not complete (many \"add details\") and you don't get a printed copy or even a CD.  Second, Focus advertised a battery charger in the package.  Instead, I received a disk reader.  The second issue wasn't a big problem because I was going to order a Sony battery charger anyway.", "Date": "January 31, 2014"}, {"Title": "on importing videos with accessory package from Focus", "Author": "jim", "ReviewID": "RJT491VOVHD1O", "Overall": "3.0", "Content": "They provide a card reader and cable, which will read pictures but not movies.  The error message you will get in PlayMemories is, \"Videos that cannot be imported by PlayMemories were found.  To import and play all the found media files, your camera must be recognized by PlayMemories Home.  Connect the camera to this computer using a USB cable, and restart PlayMemories Home.\"  The cable you will need for this is a Micro HDMI to USB cable, which is not supplied in the Focus package.  However, that is only needed if you want to use the PlayMemories program -- otherwise you can locate the memory card when connected to your computer with the card reader & cable, and easily copy the videos from the card to computer HD.  Small point, but if using the Sony PlayMemories software, it can only import pictures with the cables supplied.", "Date": "January 3, 2014"}, {"Title": "Phony pumping reviews", "Author": "Jim - PA", "ReviewID": "R1XW8JKHNVRDA4", "Overall": "3.0", "Content": "Careful with these Focus Camera reviews. Some are clearly bogus pumpers extolling the virtues of the camera and Focus Camera bundle. Any company doing this makes me nervous and is not getting my purchase - unethical and probably problems after purchase.", "Date": "May 8, 2014"}, {"Title": "Wouldn't buy again", "Author": "T. Jackson", "ReviewID": "R2FC4EK6GBJYA9", "Overall": "3.0", "Content": "This camera had so much hype as \"the best point and shoot ever.\"  So being that I'm a camera nerd - I had to try it.  Well I have been a little disappointed.  I guess for $700 I was hoping for SUPER AWESOME pictures - and all I have gotten are pictures that are just fine.  I walked around all day taking the same pictures with this camera, a cheaper canon point and shoot, and the canon SL1.  The SL1 had the best pictures by far!  And that camera was only $500. I'm not giving up on this guy - I'm going to play with it through the Summer.  BUT here is my tip - If your just a normal person taking pictures of your kids, friends and family - I would not spend $700 on this camera.  You can get just as good of pictures with a cheaper camera.Plus this was Prime - and it was super late - took about 2 weeks to get this.Update, May 26:  I just took this camera on my Disney trip so I would not have to lug a DSLR around the parks and I was SO DISAPOINTED !!!!  I almost stopped to buy a new camera while I was there.  Luckily I had Disney's Photopass - so no worries. This camera is going on Ebay today - I would not spend $700 on this camera!!!!!!!!!", "Date": "April 12, 2014"}, {"Title": "Sony RX100M II Bundle from Focus Camera", "Author": "Matthew Maciejewski", "ReviewID": "R11SES6VJNGZ3A", "Overall": "5.0", "Content": "This is a review of the bundle from Focus Camera, not the Sony RX100 II.I was skeptical of buying this bundle after reading some of the other reviews about the camera being refurbished. However, the camera that I received in my bundle appears to be brand new. It came in a sealed Sony box with Sony documentation (instructions, warranty, etc).In addition to the camera and some minor accessories, the bundle came with a Sony 64GB SDXC memory card and a Sony case, which made it a pretty good deal.", "Date": "January 6, 2014"}, {"Title": "Extremely satisfied", "Author": "Erwin Renooij", "ReviewID": "R1K6WS1OYLFVJG", "Overall": "5.0", "Content": "I ordered this camera a couple of months back and I made beautiful photos with it. Everybody is surprised by the quality of the photos and people can't believe they were made with a compact camera. The camera performs extremely well in low light. I went to Las Vegas and was able to make astonishing pictures of all the lightened casinos during night, whereas my Samsung SII couldn't make something that was close to a picture. I can recommend this camera to everybody who wants a high performance camera without having to carry around one of these big heavy DSLRs.", "Date": "November 18, 2013"}, {"Title": "Sony camera", "Author": "Quang Bui", "ReviewID": "RATE73WKJ4KXK", "Overall": "4.0", "Content": "Excellent lenses, good size camera, great zoom, but the placement of the flash on the left side is not convenient; Instruction manual does not provide enough details.", "Date": "June 3, 2014"}, {"Title": "wood grip essential!!", "Author": "jj cegys", "ReviewID": "R1DTLUNUA3MUNC", "Overall": "5.0", "Content": "get the premium wood hand grip from JB camera designs.....$25.....you will not regret and it looks awesome on the sony camera.....other accessories appreciated", "Date": "May 16, 2014"}, {"Title": "Excellent value", "Author": "Amazon Customer", "ReviewID": "R2AXH8PE2MCKHN", "Overall": "5.0", "Content": "The order was placed on a Sunday and was received the next day. The camera is easy to use and the picture quality is excellent.", "Date": "March 31, 2014"}, {"Title": "Basically the camera is a very good camera.", "Author": "Dominic Leung", "ReviewID": "R1PQKVO6F8NW4Y", "Overall": "4.0", "Content": "The camera is perfectly good except the charger is missing, the card reader is too slow to respond n the small tripod is not strong enough to do the suppport.", "Date": "February 22, 2014"}, {"Title": "Everything right + extras", "Author": "Thomas M. Brod, MD", "ReviewID": "R293YY39SOV10D", "Overall": "5.0", "Content": "Great camera, delivered fast.  Lots of extras. Once I was sure I was getting the right model, all proceeded smoothly.", "Date": "January 4, 2014"}, {"Title": "5 STARS - Perfect Pocket Camera if you have the $$$", "Author": "Michael L. Shanks \"MikeLee777\"", "ReviewID": "RWSS7TVQ649AC", "Overall": "5.0", "Content": "5 STARS - This camera does it all, so many features, options, a clear DSLR replacement in a camera that can fit in my pocket, which is exactly what I was looking for.Will take me months to master all the features, but took less than 2 min. to start snapping my 1st pictures.ONLY negative, the memories s/w does NOT run on Mac's, makes no sense to me, and who really cares, but would think Sony wouldn't ignore so many Mac users, would think that is right in middle of audience that they are trying to reach.", "Date": "November 27, 2013"}, {"Title": "Good deal.  Better than Amazon.", "Author": "2thS8R", "ReviewID": "R1K2G1YVMTIXJQ", "Overall": "5.0", "Content": "Same price as Amazon with free accessories.  Most but not accessories are useful.  I like the camera stand, case, memory card.", "Date": "November 13, 2013"}, {"Title": "Great purchase", "Author": "serious pen", "ReviewID": "R2VWMFCFPOKZQX", "Overall": "5.0", "Content": "Great offer. Camera is awesome and the bundle definitely added extra value, especially the memory card and battery. I was in doubt  when reading some early reviews, which could be misleading, at least to me. Now as a customer, I don't see why buying the stand-alone camera for similar price.", "Date": "November 6, 2013"}, {"Title": "RX100 mark II from Focus Camera", "Author": "Paul D. Bui", "ReviewID": "R23WQC0S4SWK00", "Overall": "5.0", "Content": "An excellent purchase that arrived promptly with bundled accessories.  Highly recommended are the optional grip, Gary Friedman's wonderful book, and [expensive] EVF.  Among those, GF's ebook widely opened my eyes (and will yours) not only on the rx100m2 but also shooting photos with my other DSLRs, Nikon and Canon alike.", "Date": "September 4, 2013"}, {"Title": "Great camera", "Author": "Nas", "ReviewID": "R3N9DZYFCE74ET", "Overall": "5.0", "Content": "There are ofcourse better reviews out there, so go read them! The camera is great. But it's not \"pocket-ready\" compact. Regardless, I chose this over the S120 because of the bigger sensor.", "Date": "October 22, 2013"}, {"Title": "Great Camera", "Author": "CItyBee", "ReviewID": "RV8S42051IYJ9", "Overall": "5.0", "Content": "Expensive but no regrets. The camera takes great pictures and is small enough that I take it everywhere I go.", "Date": "September 24, 2013"}, {"Title": "A great camera for DSLR owners that want a small travel unit", "Author": "Charles E. Gabe", "ReviewID": "RHZEC7RR48D2W", "Overall": "5.0", "Content": "I usually shoot with a Canon DSLR, but I wanted a second camera for \"point and shoot\" use that would be small and easy to carry for simple travel work. I did a lot of research and decided on this Sony because of its low-light capabilities, large sensor, and relatively fast lens. I have been really happy with it so far. It has so many features and shooting modes that it can handle many situations. Two particular features I like are : 1. the articulating view screen on the back, and 2. the flash head can be tilted backward to bounce the light off of a ceiling. The camera is truly small enough to fit in your jeans pocket. It is more expensive than a lot of its competitors, but the large sensor and great performance make it worthwhile for me.", "Date": "October 17, 2013"}, {"Title": "Great travel Camera", "Author": "axsym911", "ReviewID": "RZBWCMWHJCSA2", "Overall": "5.0", "Content": "Low light photography is superb. Sony software sort of sucks though . . but then it always has. Give this camera some good light and the details just keep coming.", "Date": "September 19, 2013"}, {"Title": "Functions for both pros and amatuers", "Author": "David Jones", "ReviewID": "R2SPBWWKLVE725", "Overall": "5.0", "Content": "This is a highly functional camera with options for those with years of photography experience all the way down to those, like my wife, who just want a point and shoot for family gatherings.  While my dad, who made a living behind a camera, will use the many features within the menus, my loving while will simply place the selector on Auto and shoot away.The color, warmth and tonal range are excellent as well as the low light operation.  I highly recommend this camera for a carry about when the shot has to look great, but you haven't read all the latest on scene setup.", "Date": "April 27, 2014"}, {"Title": "The Absolute Best Camera Ever", "Author": "Smoothbassman", "ReviewID": "R3OOQBYHOGLDON", "Overall": "4.0", "Content": "This package was sick.  All of the accessories that you might need in one package was awesome.I don't need to talk about this camera. It is just that good.  The photos that I have taken with this rival my $2,000 DSLR.  Just make sure you are aware of the variable aperture when zoomed out.  That can throw some folks off if your not paying attention.  Also set your Fn button up for your most needed features and it makes navigating the menus a dream!The package is OK.  The camera bag is just big enough to fit the camera in.  If you have anything extra it just will not fit.The battery is great, and the SD card is perfect size.The card reader that was pictured is not the one that you get in the box.  You actually get a better one that is more compact, so I liked that.Haven't used the remainder of the items yet, but you get what is pictured.", "Date": "February 22, 2014"}, {"Title": "Best pocket camera.  Period", "Author": "R. Pearson", "ReviewID": "R1RCWE63HMH3AK", "Overall": "5.0", "Content": "Without a doubt, this is the best pocket camera.  I normally shoot with Nikon gear but this little guy is what I carry with me 24/7.", "Date": "February 8, 2014"}, {"Title": "Worth the price over RX100", "Author": "Vincent", "ReviewID": "RPG0ZYPG6R5I4", "Overall": "5.0", "Content": "Very good camera.  Worth the additional cost over the RX100.  I use the flip LCD ALL THE TIME.  Especially shooting low.", "Date": "December 9, 2013"}, {"Title": "Best point and shoot I've ever used!", "Author": "A.Wheatley", "ReviewID": "R3PE7252A8YZ7F", "Overall": "5.0", "Content": "Great quality images, a lot of nice features abs presets. Love the auto panorama function.  NFC connectivity has proved to be very handy and we've used it more than I ever imagined.  This is a great bundle deal on a fantastic camera!Not a professional by any stretch of imagination, had the LX-5 previous to this and this is a more versatile platform.  One of the best point and shoots I've ever used!", "Date": "November 19, 2013"}, {"Title": "Great Walk About Camera", "Author": "bmatsu", "ReviewID": "R1LYCJ1I8855OH", "Overall": "4.0", "Content": "The camera is great, I intend to carry around it around with me when I am not using my A77 setup. It has a lot of the same  features as the A77. The lens is a good size and speed for the type of shooting I like to do.I wanted something that was more than a point and shoot, so I could play with exposer times and depth of field. So far so good. I like the size of the camera with the MegaGear Ever Ready case made for the Rx100M II, it made it feel better in my large hands, and not so slippery when I am working the controls. Plus it fits in my shoulder bag, case and all without taking up too much space. The extras you get with this kit is just saves me time and money looking for all the bits and pieces.Overall I think this little camera will fit the bill when I am on the run. Can't wait to give it a real run down.", "Date": "November 18, 2013"}, {"Title": "Lots of power packed into a Small Package - Bundle a Great Value!", "Author": "R.G.", "ReviewID": "RW3CTRVOWJ92S", "Overall": "5.0", "Content": "Great value with the battery, card, and case. Haven't really used the rest too much, but everything came in great condition. The camera is awesome. Great low-light photos, and very easy manual mode for a point and shoot, and Auto Mode also works great for quick precious moments and run and gun shots. That large sensor makes a HUGE difference. I have a couple of DSLRs and a micro four thirds, but I was looking for something less cumbersome and more portable for some upcoming trips, and this camera is perfect! Not as small as others like my old Canon s95 and s100, but this camera performs better than them both (and I love Canon).For all you tech junkies, this thing pairs with my phone with ease (Samsung Galaxy Note 3). With the NFC sharing feature, transferring photos to my phone is as easy as tapping them together. Now the photos across my social media apps will look even more stunning :)If there is one thing I would complain about, it is that the camera itself doesn't come with a charger (charge through the camera). Not very useful if you want to shoot while you're charging. I would suggest getting a separate charger and some batteries. I've seen them on Amazon for around $20, and I'll probably do so before going on my trips.Other than that small thing, I have no regrets buying.", "Date": "November 15, 2013"}, {"Title": "The best camera in years under $2000", "Author": "H. H. Tucker", "ReviewID": "RZRBYH1EMJ9M6", "Overall": "5.0", "Content": "worked great out of teh box.  Lots to learn as this is soo much more than a point and shoot.I have recomemneded it to severial people.  Finally a camera taht is good for more than 3 years.", "Date": "November 14, 2013"}, {"Title": "recommendation", "Author": "olav ruud", "ReviewID": "R1A6LNABWPHF0M", "Overall": "5.0", "Content": "would recommend this to any serious photographer who wants a quality camerawould recommend this to any serious photographer who wants a quality camera", "Date": "October 20, 2013"}, {"Title": "A great bundle for a great point-and-shoot camera...", "Author": "C'est Moi", "ReviewID": "R2L0YJ36C831S6", "Overall": "5.0", "Content": "How about that? Focus has bundled together all the accessories you would need as a beginner with an awesome camera. I had heard about Sony's RX100 from several of my friends about a year ago, all of whom claimed it to be the best point-and-shooter. I believed them. But I didn't need a new camera back then. And then I dropped my canon and was in need of a new camera. Looked into all the different models and compared reviews etc. I came to the conclusion that Sony's RX100M2 was a no brainer, now only if I could justify paying almost double that of a great canon camera (s110 and such). Seeing this Focus bundle the decision was made easier. So, I ordered  it. After using it for about a month, I have to say I am truly impressed by picture quality. If you are bothered by unnatural color in flash photography like I am, then you are going to love this. For the most part, in natural light or lack of it, this camera takes great pictures! I actually haven't even played around with all the settings, just using the automatic everything, I can take great pictures with this. For me, that's the true purpose of a point-and-shoot. If I really wanted to mess around with the settings I'd get a semi-pro DSLR. But with this camera you have option to mess around with quite a few settings to your hearts content as well.One thing missing from many of the reviews in amazon is how great the battery life is. In the one month I've gotten the camera, I've charged the original battery twice. First was the first time. Second time was after only losing 25% battery, but because I was going on a short trip. How many pictures have I been able to take in that time? 200+! That's right. And not just that, I've viewed my pictures in the camera many times, I've transferred the pictures from the camera to the phone over nfc/wifi several times, and I've also controlled the camera with my phone several times. Yet the battery never drained too much! This time I'm going to wait until the battery drains completely, because until the original battery drains, I can't even get to the focus' bundled additional battery to test that out.The focus bundle is also quite brilliant. It comes with an original Sony pouch, that I use. The included 64 GB SDXC was needed very much, for I always take pictures at the highest possible resolution setting. The red cloth pouch was not needed for me as I'm a guy, but I'm sure girls would prefer that instead. The second battery is always handy, though since the camera is so great with battery life, I actually haven't gotten to it yet. The stands are useful, especially since I can remotely control this camera using my phone. Many places I cannot put the camera down to take our picture, now I can take our group shot with me included, thanks to these stands. (comes with two stands, one for even surface, one for uneven surface, I've used both kinds before with other cameras). Thanks Focus for making an awesome bundle.The best thing about this bundle? Definitely the awesome camera. However, Focus being able to keep the price as low as the camera's regular  market retail is also amazing. So, to me this pretty much meant, I got great and useful accessories for the camera all for FREE. Hey the genuine Sony 64 GB SDXC Class 10 memory card alone was worth a good 50 bux to me! Sony Class Memory SF64UY TQMNI can nit pick a few things and say the camera fell short on certain things such as:1. the remote control software for phone to control the camera isn't fully featured (better to say barely featured), pretty much all you can do is to hit a button to take a picture, after you've adjusted the camera physically.2. the playmemories app for playstation 3 only recognizes the internal storage of the camera, and not the SD card (that makes ps3 integration pretty much useless), also there aren't a great deal of documentation for the PS3 integration with the camera (possibly since this is quite a new feature)but that's where I'll stop and say, there's really no better camera out there. These two points and others, appear to me should be easily ratified via software upgrades. The nfc/wifi on this camera works so flawlessly to connect to phones that, I didn't have to read the manual even once so far (with the playmemories app on your phone).Great job Sony. And great job Focus.", "Date": "November 2, 2013"}, {"Title": "Nice compact camera, steep cost.", "Author": "Warren", "ReviewID": "R2F3E6270MTUGL", "Overall": "4.0", "Content": "The camera has the ability to take some remarkable photos, although I found the default settings lack a lot of saturation when taking landscape photos.  Thankfully, users have nearly endless customization abilities.  This isn't a replacement for a full frame DSLR, but it can easily supplement your professional equipment when traveling or when you find yourself in places where hulling around a large full size camera is less than ideal.", "Date": "October 14, 2013"}, {"Title": "sony pocket shooter", "Author": "Beth Foster", "ReviewID": "R1X8KK3EVZ5GDJ", "Overall": "4.0", "Content": "Used my New Sony in Italy for 10 days. Had the great sharpness and quality photos I wanted. A little contrasty, but considering full sun everyday and dark shadows with marble and white stone it did good. This camera fits in your pocket! No bulky camera to carry around. Pictures inside cathedrals without flash were great. Great panoramic photos! Tilting viewfinder, worked over crowds. Liked the 64 card instead of 32 from Focus Camera. Used the Tripod with the camera on the ground and used my smart phone to control it. Overall great little camera!!!!", "Date": "September 16, 2013"}, {"Title": "accessories", "Author": "Sean Cranor", "ReviewID": "R3U7W4SKBXN45B", "Overall": "4.0", "Content": "This is a great camera, but the accessories offered by Focus Camera, in this bundle are worthless.  Do yourself a favor and just buy quality accessories if you need them.", "Date": "August 13, 2013"}], "ProductInfo": {"Price": "$698.00", "Features": "New 20.2 MP 1-inch Exmor R CMOS Sensor\nCarl Zeiss T* F1.8 3.6x optical zoom\nFull HD Movies at 60p/60i/24p\nTiltable 3.0\" Xtra Fine LCD\nWireless sharing to smartphones and tablets", "Name": "Sony DSC-RX100M II DSC-RX100M2 DSC-RX100MII RX100M2 RX100MII DSC-RX100M II 20.2MP Wi-Fi Digital Camera with F1.8 Carl Zeiss Vario-Sonnar T Lens and Full HD 1080p Video at 60fps + Sony 64GB SDHC Class 10 Memory Card + Wasabi NP-BX1 Battery Pack + Sony Camera Case + Micro HDMI Cable + Focus Multi Memory Card Wallet", "ImgURL": "http://ecx.images-amazon.com/images/I/51usYgJGtQL._SY300_.jpg", "ProductID": "B00E3FYJ5K"}}