{"Reviews": [{"Title": "awesome product and price", "Author": "brandon huynh", "ReviewID": "RR5XCUDU5IW65", "Overall": "5.0", "Content": "This battery and charger kit works great and very inexpensive. It worth the money spent. Thanks.I am strongly recommend this kit.", "Date": "March 29, 2014"}, {"Title": "Great Value", "Author": "Bob", "ReviewID": "R3VYZ5TG2WQJQD", "Overall": "5.0", "Content": "This was ordered along with a Samsung WB250F camera that DIDN\"T include a battery charger., So this unit did the trick.  Works great for charging batteries OUT OF THE SAMSUNG CAMERA!!.  Appreciate the Euro adapter for the charger.  The two extra batteries are almost a necessity for todays digital cameras.  Fast service and a good price.", "Date": "May 26, 2014"}, {"Title": "Great deal!", "Author": "perk", "ReviewID": "R1YOHFG6J5FF0O", "Overall": "5.0", "Content": "Reasonably priced, work great as expected for a battery.  And got 2 batteries with charger in this terrific deal. I recommend!", "Date": "May 17, 2014"}, {"Title": "I like it", "Author": "Daniel Marinoff", "ReviewID": "R1P5KBPTZRXJV1", "Overall": "4.0", "Content": "they work.", "Date": "May 2, 2014"}, {"Title": "PERFECT", "Author": "Hanzel Sanchez \"CRCh\"", "ReviewID": "RCJAFHWVF0BI3", "Overall": "5.0", "Content": "I am really happy withy this purchase, as now I have, besides my camaera's battery, 2 extra ones that I can carry with the charger and do not have to worry about my camera turning off all of the sudden.", "Date": "April 26, 2014"}, {"Title": "great price", "Author": "Susan Hinde \"Barefootbrit\"", "ReviewID": "RA0YIU6MBSQ4S", "Overall": "5.0", "Content": "Nice package, works well with my Samsung WB250 camera. So far battery is as good (or even better) than the Samsung battery", "Date": "April 14, 2014"}, {"Title": "Just what I needed", "Author": "R Hall", "ReviewID": "R3TMTAIPFQQEYH", "Overall": "5.0", "Content": "So far so good.  You always need more batteries.  Having two will be good and the charger is really handy.", "Date": "March 24, 2014"}, {"Title": "Sean", "Author": "MENG  E. CHOU", "ReviewID": "RWDQSLNN6KEZW", "Overall": "4.0", "Content": "It is a good products for after market.  I bought it for my Samsung WB150. It is work good.The price very low than other.  In the future will buy again from this brand.Thank YouSean", "Date": "February 23, 2014"}, {"Title": "Cheap backup power for travel and home", "Author": "Dennis B. Taylor", "ReviewID": "R3OVB9NVDXQSCF", "Overall": "5.0", "Content": "Nice charger for car and home as well as travel overseas due to wall and auto plugs and variable voltage input. batteries are very low cost when purchased in this package. The batteries are cheaply made  but function and fit just fine in my Samsung WB350 camera, which makes this an ideal package for low cost backup power on a trip or at home.", "Date": "February 12, 2014"}, {"Title": "Two Halcyon 1350 mAH Lithium ion Replacement Battery and Charger Kit", "Author": "Ken", "ReviewID": "R1HXPM9T4CWJ7P", "Overall": "5.0", "Content": "These are excellent products.  I have used these items and found them to be very helpful in taking pictures. I would certainly recommend these products.  Ken", "Date": "February 11, 2014"}, {"Title": "Nice set", "Author": "Danica", "ReviewID": "R2DAHW8365KEDJ", "Overall": "5.0", "Content": "Ordered this set of batteries and charger for a camera we have had, but had no charger. Batteries worked right away In the camera, just like the original. Great price too! Thanks again Amazon!", "Date": "February 3, 2014"}, {"Title": "I like it", "Author": "Russell Dayton", "ReviewID": "RTREZMVIL6V1X", "Overall": "5.0", "Content": "Nice features such as charging and charged lights and auto shut off when charge complete. Plus automatic dual volt and cycles for traveling abroad. R.D.", "Date": "January 24, 2014"}, {"Title": "Two Halcyon 1350 mAH Lithium Ion Replacement Battery and Charger Kit for...", "Author": "Donald", "ReviewID": "R396F3G0QJ4ZKJ", "Overall": "3.0", "Content": "The finishing on the battery body is not smooth with ridges that stick up slightly above the flat surfaces and the charger pen connectors are a bit lack luster in composition, but it works and the batteries do charge within the stated two hour time, so I would say that for the money it is a decent purchase. The cells are Japanese, but the construction is made in China. The life of these batteries has yet to be established through use and I will update this review when that information becomes available. I would say these earn a three and one half star rating, but since I cannot do that I am posting three stars.", "Date": "January 10, 2014"}, {"Title": "Good for the money.", "Author": "Stevie Ray", "ReviewID": "RGEL6Q6A0G7O8", "Overall": "3.0", "Content": "It's a decent battery. Will definitely do well in the field. Door I found the original better the cam with Samsung WBH hundred last little bit longer but regardless I have three better than all with the car charger I doubt I'll be running out of juice", "Date": "January 7, 2014"}, {"Title": "replacements batteries", "Author": "mark hagenlock", "ReviewID": "R1X1KS10VE7100", "Overall": "2.0", "Content": "speed of shipment, packaging, no problem. Batteries however are both larger than the factory Samsung batteries they are to replace. About 1/32\" longer. Doesn't seem like much, but it is enough that the spring loaded retainer will not return to it's hold position without help. No doubt this will cause premature failure to the battery retainer.", "Date": "January 12, 2014"}], "ProductInfo": {"Price": "$14.99", "Features": "Package Includes: 2 Halcyon Brand Battery & 1 Halcyon Brand Wall & Car Rapid Charger\nBattery Specs: 1350 mAh with Premium Japanese Cells\nHalcyon Support: Includes 5 Year Halcyon Replacement Warranty. Full Membership Access to Halcyon Customer Support Website\nFrustration Free Packaging. No wasteful and dangerous plastic blister packs.\nCompatible with all cameras which take Samsung SLB-10A Batteries", "Name": "Two Halcyon 1350 mAH Lithium Ion Replacement Battery and Charger Kit for Samsung WB250F Smart Digital Camera and Samsung SLB-10A", "ImgURL": "http://ecx.images-amazon.com/images/I/51bs54C9TvL._SY300_.jpg", "ProductID": "B00EPFSTN6"}}