{"Reviews": [{"Title": "came with wrong user's manual.", "Author": "neutrino", "ReviewID": "R3OSAH3RKOX06U", "Overall": "3.0", "Content": "The camera is great although  rather  complicated for a point and shoot. Image quality is quite good, but unless you view them on a very nice monitor, hard to tell the difference from less expensive camera.I am very concerned about the package I received. Wrong and poorly printed user's manual came with the camera. When I power on the camera, language was not set in English. The box only has Japanese characters all over it, no English. I suspect this is a repackaged merchandise from Asian market although I can't confirm that.", "Date": "January 22, 2014"}, {"Title": "Best DSLR alternative to-date!", "Author": "Gary A. Jenkins", "ReviewID": "R1OQ4NDTUCF1H3", "Overall": "5.0", "Content": "I consider myself a photo-enthusiast and have only used Nikon SLRs and DSLRs over the years.  Having all the gear is great but I really want to take good, quality images without loosing the ability to manually adjust and use filters.  I found the perfect solution with Sony's RX100M2.  This camera is amazingly versatile.  Worried you'll loose the ability to attach the CPL or ND filter? Check Magfilters and threader adapter ring. Your shoulders will love you!", "Date": "December 10, 2013"}, {"Title": "dissappointed", "Author": "Abe", "ReviewID": "R3V37Q93DT26FZ", "Overall": "3.0", "Content": "At first looking at size in the  picture seems large enough, but when I got it , was really dissappointed, you don't have enough space to hold it", "Date": "October 7, 2013"}], "ProductInfo": {"Price": "$729.99", "Features": "20.2MP 1\" Exmor R BSI CMOS Sensor\n35mm Equivalent Focal Length: 28-100mm\nFull HD 1080i/p Video at 60 and 24 fps\nBuilt-In Wireless and NFC Connectivity\nHigh Speed AF & Manual Exposure Control", "Name": "Sony Cyber-shot DSC-RX100M II DSC-RX100 II Digital Camera 32GB Package", "ImgURL": "http://ecx.images-amazon.com/images/I/515v1vEmbtL._SY300_.jpg", "ProductID": "B00E4XKA4U"}}