{"Reviews": [{"Title": "Top notch package deal!", "Author": "The Mask", "ReviewID": "R2GE68BWH9WKL8", "Overall": "5.0", "Content": "I've been hankering after a D7100 for a while, and Cameta Cameras had the best deal ANYWHERE (and I do mean anywhere - I live near Dubai, and even their tax-free status couldn't give a better price).  The camera itself is first-rate, and such a step up from the D7000 that it's totally worth buying if you can squeeze out the extra $$$.  The only thing I'd have liked to have seen would have been a hinged/foldout screen, as I've found them to be so useful in awkward shooting situations I've found myself in with other cameras I own.The rest of the package was also first-rate.  Everyone recognizes that Nikon just don't make a bad lens, but this 18-140mm is excellent - beautifully sharp and precise, and not too much of a handful on the front of the camera.The other goodies were exactly as specified, and do what they say on the can.  Special mention must go to the backpack case, as it is fantastic.  Details were sketchy on the website, and they weren't easy to find anywhere else on the 'net, so I was delighted to find that the backpack case is very well thought out, and packs in everything you're likely to need for a photo expedition (unless you need to strap on a really serious/heavy tripod).All in all, I'm delighted with this purchase.", "Date": "January 7, 2014"}, {"Title": "I like this camera very much", "Author": "Yudan L.", "ReviewID": "R2BKB0PF2P1YDN", "Overall": "5.0", "Content": "It is my first professional camera, it's very easy to start with auto model to take pictures, this camera made my trip to Washington more fantastic.", "Date": "December 15, 2013"}], "ProductInfo": {"Price": "$1,459.95", "Features": "KIT INCLUDES 10 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon D7100 Digital SLR Camera Body + <2> Nikon 18-140mm VR DX AF-S Lens +\n<3> Transcend 32GB SDHC 300x Card + <4> Spare EN-EL15 Battery +\n<5> 67mm UV Filter + <6> Precision Design ML-L3 Remote + <7> PD Laptop/Tablet DSLR Backpack +\n<8> PD 6pc Complete Cleaning Kit + <9> PD 8 SD Card Memory Card Case + <10> LCD Screen Protectors", "Name": "Nikon D7100 Digital SLR Camera Body with 18-140mm VR Lens + 32GB Card + Backpack + Battery + Filter + Remote Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/617tu3uz0TL._SY300_.jpg", "ProductID": "B00EV2Y6JY"}}