{"Reviews": [{"Title": "Well worth it!", "Author": "Andrew Chin", "ReviewID": "RZL2UNVAIANOB", "Overall": "4.0", "Content": "light weight, so very easy to point and shoot.  Display is awesome with highly defined resolution and colors.  Zoom is powerful and accurate at details even at 50 feet distance.", "Date": "November 10, 2013"}, {"Title": "WOW !", "Author": "John Blayse", "ReviewID": "R2XR3UOHPAJUDI", "Overall": "5.0", "Content": "This is a good package for SX510. It's easy to use and awesome optical zoom. But I Prefer SX500 with the same package because of SX500 has 16.0 MP CMOS and extra function than SX510.Take it:B0096U81BA", "Date": "October 14, 2013"}, {"Title": "Great Value. Wi-Fi and Geotagging Capability a Big Plus", "Author": "John Hinchman", "ReviewID": "RXOV2M452WPXY", "Overall": "5.0", "Content": "Great value. The zoom that I needed and wi-fi is a definite plus. The ability to geotag photos using iPhone was great surprise.", "Date": "December 11, 2013"}, {"Title": "Great Buy", "Author": "geegee", "ReviewID": "R78W3JTKG46DX", "Overall": "5.0", "Content": "I bought this for my teen son to make videos.  Its very easy to use, pictures are clear.  He's having a good time making videos & taking pictures. Comes with lots of accesories.", "Date": "September 12, 2013"}, {"Title": "Great Option for an On-The-Go Camera", "Author": "D. K. Garcia", "ReviewID": "R2OP0V6TQVO8J0", "Overall": "5.0", "Content": "For a small, on-the-go, durable camera, this is a very well designed, feature rich offering.  After researching several options at this price point, this was definitely the best choice for our needs.", "Date": "November 19, 2013"}, {"Title": "Sx510 Canon", "Author": "Terry Robitaille", "ReviewID": "R2SPCUKH6KG8GH", "Overall": "5.0", "Content": "We love the small camera . IT takes great picture and easy too use. The caring case and everything that was promised with the camera was perfect . We are very pleased with the seller.", "Date": "January 6, 2014"}, {"Title": "LOVE IT", "Author": "barbara franklin", "ReviewID": "R16KR8AUSMEALO", "Overall": "5.0", "Content": "I haven't had a new camera in a few years so I was due for one.The camera was shipped EXTREMELY fast.  The quality is great, the zoom, macro etc..It is somewhat of a tight squeeze to fit most of the items into the camera bag, but you can easily go buy a bigger bag.The direction are a little confusing for me, I don't consider myself to be tech savvy.Great camera for the price. I did price comparing and Amazon had the cheapest price for the amount of items you received.", "Date": "January 15, 2014"}, {"Title": "Soo cool", "Author": "Jeremy", "ReviewID": "R26EL887YIFCSN", "Overall": "5.0", "Content": "I love this!!! I got this for my wife and she has been taking beautiful pictures with it. And it comes with all those cool things too. When I first got the box, I have to say, I thought it was empty. It was really light. But upon opening it  I saw that the product was WELL protected and every thing came brand new and nothing was missing. No damage. As for the camera itself.. It was definitely worth it. My wife loves it and had no problem figuring out the settings. It's not the BESTEST camera in the world but its PERFECT for my wife, who wants to get into photography. I totally recommend.", "Date": "April 17, 2014"}, {"Title": "Awesome", "Author": "Lozen27", "ReviewID": "R36VUQ8FMZTKJQ", "Overall": "5.0", "Content": "Awesome camera!  I took a picture of the moon and you can see the craters along the edges!(I don't have a very steady hand when zooming)  I would buy it again! It would let me insert the picture in the actual ad.  I hope the photo helps people make a decision!", "Date": "March 23, 2014"}, {"Title": "Excellent Camera", "Author": "ceejay", "ReviewID": "R193CYVQKRNPDI", "Overall": "5.0", "Content": "Camera is easy to operate.  I haven't tried the Wifi yet.  The Bundle is well worth the price.  Lots of extras and an excellent camera to boot.", "Date": "December 11, 2013"}, {"Title": "Exactly what we needed", "Author": "toni baker", "ReviewID": "R4V4ABLAW6KWN", "Overall": "5.0", "Content": "Camera is exactly what we needed for our upcoming, very large, family vacation.  The accessories included were such a great bonus.We can't wait to use it!!", "Date": "May 15, 2014"}, {"Title": "Nice!", "Author": "Suedelady", "ReviewID": "R39QFNWXOCP7QL", "Overall": "4.0", "Content": "This is a great little camera and you can't beat the price for what your getting. My husband is an avid photographer and swears by canon so this was a great gift for him.  It is compact and totally portable yet very clear and powerful for any type of picture taking!! Highly recommend to anyone that wants an \"on the go\" camera!", "Date": "March 20, 2014"}, {"Title": "Not as good as my old Kodak", "Author": "Msluvtodraw \"Msluvtodraw\"", "ReviewID": "R2PCF42SZ7WQMB", "Overall": "3.0", "Content": "I bought this to replace my old kodak camera to take pictures of my artwork but the quality is much worse. The kodak pictures are sharp and clear while the Canon pictures are slightly blurry. I'm very disappointed with this camera. Now I have a camera with such poor quality that I am stuck using the old one. Also I drew an elk with pastel and with the canon the fur looks green while the kodak color is true to the drawing. A photographer friend tried fooling with it but couldn't get the color to be true to the drawing.", "Date": "May 11, 2014"}, {"Title": "Great zoom!", "Author": "Inspired Adult Pianist", "ReviewID": "R21B37TO9WVU0I", "Overall": "4.0", "Content": "This camera definitely has the incredible zoom I was looking to acquire.  I have to figure out how to take pictures that aren't blurry though.  If a person moves in anyway during a shoot, they will be blurry.  I haven't read the manual about shutter speeds yet, so perhaps this camera is a gem waiting to be discovered.", "Date": "January 3, 2014"}, {"Title": "Great complete package for a starter!", "Author": "Steven H. Poulos \"Success Coach\"", "ReviewID": "R14OI443ZSRH43", "Overall": "5.0", "Content": "LOVED the complete package combo pack! Includes everything you need to get your camera up and running. If I were to have just bought the camera by itself, I would have had to go out and buy all these accessories separately and probably end up costing me an extra $50!Thanks for the great combo pack of high quality goods to get me started!", "Date": "June 6, 2014"}, {"Title": "No Vacation with This Camera!", "Author": "Mary  Schaefer", "ReviewID": "R1MWJSL7I9XFEH", "Overall": "1.0", "Content": "I began on Auto  and was SO disappointed with the washed-out color.  I tried it both inside and outside on a sunny day, as well as inside  with flash in the evening.  I can't tell you how much I wish I hadn't purchased this camera!  I was planning on taking it on a vacation trip, but I will not do so, as I know colors will not be true.", "Date": "June 6, 2014"}, {"Title": "I cannot believe they sent me a used one", "Author": "Ivy.", "ReviewID": "R1IBCDOSDH65YV", "Overall": "2.0", "Content": "The amazon Prime is still very promising. love the 2-day deliverI read a lot of good reviews about this product but when I open the box, it's DEFINITELY a used Camera!There is no protect film on the LED display, no tape on the box, no protect film on the battery. Everything is lose in the box. First time I experience this from Amazon, very very disappointing...I didn't give one star because I still thing this is a good camera~~", "Date": "June 5, 2014"}, {"Title": "Lovvvvve this camera….excellent quality cause it is Canon ;)", "Author": "MakeMIneCountry", "ReviewID": "R3QW2HYWLDN5EL", "Overall": "5.0", "Content": "Love this camera. We were looking for a mid-size Canon. We have numerous other digital Canons and we were looking for something in between, this fills the bill perfectly. No Complaints on our part. Get one you will love it just as we do! No regrets!", "Date": "May 29, 2014"}, {"Title": "Love it !", "Author": "Travl4fun", "ReviewID": "R3PT2G0LM878B1", "Overall": "5.0", "Content": "My husband bought this for me, for our upcoming safari.  I am not literate when it comes to cameras, so when I opened this and started playing with it, I soon realized it's very user friendly ! I love all the gadgets it came with, I really like how light weight it is, since it will be hanging on my neck.  It takes great pictures, was easy to set up, and can't wait to take it on my next trip :)", "Date": "May 19, 2014"}, {"Title": "Real Camera", "Author": "Broderick G. Lemons", "ReviewID": "R3FFO95QBN45C5", "Overall": "5.0", "Content": "I looooove my camera in every way!!! It shoots and print great pics! The flash may be a bit tricky, but great for semi professional photography.", "Date": "May 13, 2014"}, {"Title": "Great Zoom", "Author": "Peter Breyfogle", "ReviewID": "R15V63GL8J5NUD", "Overall": "4.0", "Content": "The zoom and the mode selection are great.  I got pictures that have never turned out before.  It is a little bigger then I am used to, but that is the price for the features.", "Date": "May 9, 2014"}, {"Title": "very good camera, but delivered with one day delay", "Author": "Ingrid", "ReviewID": "R2JCUYJQEN7CIA", "Overall": "5.0", "Content": "The camera is very good and meet the expectations. Is very good for a advanced compact camera. ABuy with all the acessories, it worth, if you buy them later, separetely they will be expensiver. The product was delivered with one day delay,", "Date": "May 5, 2014"}, {"Title": "Love this camera!", "Author": "Becca Davis", "ReviewID": "RCX3BGGEZOUZM", "Overall": "5.0", "Content": "Takes great pictures, easy instructions, small size makes it manageable to carry on my walks. I'm still trying to figure out the wi-fi but I believe the problem is with the Canon website.", "Date": "May 4, 2014"}, {"Title": "Very pleased", "Author": "Lillian Caruthers", "ReviewID": "R1YLW9XEME362S", "Overall": "5.0", "Content": "Very pleased with the camera. Takes beautiful pics. Still getting familiar with the features but only wished it came with a owners manual to take with u on ur travels to get to know it better. That's the only thing I dislike of the package other that it's a great camera.", "Date": "April 24, 2014"}, {"Title": "Great Camera!", "Author": "Angie C.", "ReviewID": "R254FT4B79M1Q6", "Overall": "4.0", "Content": "Love the camera.  Takes great pictures.  Was a bit tricky to set us the Wi-Fi but was successful!  Highly Recommend!", "Date": "March 16, 2014"}, {"Title": "Awesome!", "Author": "Markie Mar", "ReviewID": "R2RGNNI2VGJR64", "Overall": "5.0", "Content": "Birthday gift for my daughter. She is taking a photography class next year and needed a camera. She loves it! And the price was great!", "Date": "March 11, 2014"}, {"Title": "camera", "Author": "Bruce Tracy", "ReviewID": "RXIK83VYCXWTM", "Overall": "5.0", "Content": "My wife really lobes it, i have not been able to use it very much because shre always has it", "Date": "March 10, 2014"}, {"Title": "nice equipment reasonably priced", "Author": "Big Mac", "ReviewID": "R2XEE4ACZHMR4S", "Overall": "5.0", "Content": "the camera is great.  The accessories are of light construction, but useful to a degree. i recommend this package highly", "Date": "February 20, 2014"}, {"Title": "Love it!!", "Author": "Brynn", "ReviewID": "R35G1I3M3YZ1KV", "Overall": "5.0", "Content": "This camera is very high quality and i love how clear the photos are. I recommend this great product to anyone!!!!", "Date": "February 16, 2014"}, {"Title": "why did you choodse this rating?", "Author": "Pat B.", "ReviewID": "RA8V3J3VKGL4", "Overall": "5.0", "Content": "the canon bundle is a great bargain - love the camera ! have always bought canon - whether camcorders or cameras", "Date": "January 22, 2014"}, {"Title": "Wow", "Author": "Astig 14", "ReviewID": "R3T4OMQMUN09RN", "Overall": "5.0", "Content": "Arrived earlier than expected. I love the pictures and are very clear. Easy to use, havent tried the wifi yet though. With all the accessories included, I say money's worth.", "Date": "January 21, 2014"}, {"Title": "I which it was bigger its nice but too small for me.", "Author": "amy", "ReviewID": "R3GL927SFGQX3O", "Overall": "3.0", "Content": "i which it was bigger very small for me, but it is okay for what using, thank you have nice day.", "Date": "May 18, 2014"}, {"Title": "Picture must be totally still to come out clear!!!!!", "Author": "Mommy", "ReviewID": "R39DWAX776GZRU", "Overall": "1.0", "Content": "The Zoom works fantastic however if your subject moves or slightly moves the picture is always blurry!!!!!!  This camera is not worth a dime unless your subject is always completely STILL.......PICK ANOTHER CAMERA!!!!!!", "Date": "February 6, 2014"}, {"Title": "color of the picture does not meet my expectation", "Author": "menji  wu", "ReviewID": "R1BO4A96SOL20Q", "Overall": "3.0", "Content": "the camera is all right, but the color of the picture does not meet my expectation. the contrast of the color is not much", "Date": "January 26, 2014"}, {"Title": "Canon PowerShot SX510 HS", "Author": "Timothy E. Adair", "ReviewID": "R1CWWNW0G0Y83L", "Overall": "4.0", "Content": "I am very pleased with the camera.  It works very well, nice sharp pictures and an awesome zoom.  The only issue I had was that the card reader that came with the kit doesn't work.  There is something bent or broken inside that will not allow you to plug the memory card into it.  It should be noted as well that the WiFi won't work with Vista.  It set right up on my wife's computer that runs 7.  I gave it 4 stars because of the card reader issue.  I like it when everything in a purchase works right our of the box.", "Date": "January 26, 2014"}, {"Title": "WiFi needs help.", "Author": "Don Maurer", "ReviewID": "RHWPZ8ANQYFCD", "Overall": "3.0", "Content": "WiFi very difficult if not impossible. Cannon image limits what you can do. Takes too long to focus in. Does take nice pocs.", "Date": "November 26, 2013"}, {"Title": "Not what it seems.", "Author": "Dina", "ReviewID": "R10M6INWFQY604", "Overall": "1.0", "Content": "The item is not what it seems. I would like to have my money back. But they're aren't allowing that.", "Date": "May 6, 2014"}], "ProductInfo": {"Price": "$229.00", "Features": "12.1 Megapixel High-Sensitivity CMOS sensor\nCanon DIGIC 4 Image Processor\n1080p Full HD video\n30x Optical Zoom and 24mm Wide-Angle lens\nOptical Image Stabilizer", "Name": "Canon PowerShot SX510 HS 12.1 MP CMOS Digital Camera with 30x Optical Zoom and 1080p Full-HD Video Ultimate Bundle With 32GB Secure Digital High Capacity (SDHC) Card, Digpro CompactDeluxe Carrying Case, Extra Battery , Tripod , HDMI Cable, Reader", "ImgURL": "http://ecx.images-amazon.com/images/I/41CkZE3alGL.jpg", "ProductID": "B00ETAU00C"}}