{"Reviews": [{"Title": "S120 first thoughts and vs RX100", "Author": "Just Chris", "ReviewID": "R10G4P3H70R2K1", "Overall": "5.0", "Content": "Just got this camera and have less than 100 pictures through it and although every year I buy one of these and end up returning it, it looks like this \"S\" might be a keeper finally.Like most of its predecessors it's built very well, feels good in the hand, and most of the buttons have good feedback. It has gotten a little more rounded over the years but I like it, square camera with smooth edges that don't annoy me in the pocket.Out of the pocket this camera is probably adjustability-overkill for most people that haven't dared of taking their camera out of AUTO mode.  Whether you like shooting in AUTO or you do choose to leave AUTO behind, the S120 rewards you with a very fast interface, fast response (focus/shutter), and the ability to view and share your images across other devices quickly.I am a Canon guy.  That should not be missed here because I am a little biased, but I have an iphone(5) for my day to day camera.  My weekend camera is a Canon 6D and a bag of L lenses. I bought the S120 to bridge the gap between the two. I am not a professional,  but sometimes I want professional pics without using my phone or lugging a big DSLR kit around with me - enter the S120.With the S120 Canon FINALLY offers a simple camera that seems to do everything I want well.  What do I want?- Ability to capture amazing pictures without carrying 20# of lenses with me.- Ability to hand my wife/kids a camera that they can use too.- Fast power up, fast focus, fast capture.- Great video if the situation calls for it, on the fly, no delay.- EASY way to transfer pictures to my phone (for when I do want to send them elsewhere).- Canon menus, because they make sense to me.It does all of these in my opinion, quite well.If you are looking for a camera that outshines just about anything else on the shelf under 700$ and can avoid bulking your pants pocket - this is the one.Whats in the box:- Canon S120 camera.- Canon (NB6-LH) battery.- Canon wall charger (CB-2LY).- Canon wrist cord.- Registration documents.- Warranty info.A couple other things I wanted to mention...WiFi -- It's actually useful now!  This model features a new wifi setup for transferring pictures to your smartphone. I have had this on (2) other units (S110 and EOS 6D) and never use it because it's a pain. With this model I just go into \"play\" mode on the camera, press the wifi button (up on the D pad) , it immediately asks what I want to connect to, I select \"smartphone\" and it says start the phone application and point it to this hotspot. Once I do that, I am on the phone browsing pictures. Scrolling through images (large JPEG) on the camera is pretty quick, downloading is pretty quick, disconnecting and getting back to shooting is just as quick.  Now you can literally turn wifi on, send a specific image over to your phone, turn wifi off, in the matter of a couple seconds and a few button clicks.I won't go into what the old way was, because if I could remember it I would actually use it!RX100 vs S120 -- Just before the S120 was announced I finally broke down and bought an RX100 (new).  Not the M2 model but the original, for 600$.  I loved the pictures it took, they were amazing amazing images.Compared to the S120 (in circumstances so far) they are possibly a little better comparing auto mode to auto mode.  What I like about the Canon vs the Sony is the Canon seems to capture more how I see things as opposed to the Sony which wanted to make everything look like a carnival if left untouched (it liked to make all the colors exotically vibrant from my perspective).  If this were just about images there would have been some tough decisions to make and hairs to split over this.The size and weight of RX100 to S120 it's no contest:S120. I can put the S120 in a pair of khaki's and go sit in meetings or walk around all day with no worries. The RX100 just felt too darn heavy, and it's larger lens tube sticking out from the front was annoying getting in and out of pockets.  The S120 is still a true pocket-friendly camera is what I am getting at.Build quality-wise both feel like finely crafted machines.  The S120 will remind you of other point and shoot cameras and its finish is something I would feel ok with putting in a bag with no case.  The RX100 felt like some sort of surgical tool, I mean in a good way - but I felt like putting down on a desk would damage the desk or possibly the finish on the camera.  Another strange thing is the S120 feels good in the hand and has some heft but nothing bad.  The RX100 felt a little heftier but in a way that I felt if I dropped it, it's life was over - it was just waiting for an opportunity to spill its guts. I would expect the S120 to take a small hit or some tumbling without ending it.Cost - Although money can be irrelevant to most photographic geeks when it comes to \"getting the shot\" , I didn't understand why the Sony was hundreds more. The \"why\" of this is in other parts of the review here so I won't get into it more.  I will just say I had a $1,000 budget for my perfect point and shoot, and now I have 550$ to go spend on something else.Software - I left this for last because I suspect this is where Canon bias comes in.  It is also something I suspect is different in the newer model Rx-100(M2) so may not be as relevant. The S120 UI is quick and also very efficient. The RX-100 by comparison was a little slow, and (at least for me) I never felt like I could quickly get to the settings I wanted to without forcing some customization. Neither is over-glitzy or annoying to use, but the Sony one just felt like it was fighting me sometimes when I would change something and then have to re-find it.I hope you enjoyed this review and I will update it as relevantly as is feasible.If there is more you'd like to see added or something I missed please comment and let me know, and thanks for reading this!-Chris", "Date": "October 2, 2013"}, {"Title": "Most pocketable pro-quality camera you can currently get - picked it over RX100M II", "Author": "Alex B.", "ReviewID": "R14FOMF4T0U1W5", "Overall": "5.0", "Content": "I love this little camera. My previous camera was a Canon S100, and I loved it, too. But I really wanted the wi-fi functionality so that I could share pictures with friends and family at moment's notice and not have to wait until I got home (which, half the time I would forget to do anyway). The wi-fi feature works very well. You can upload photos directly to your phone or tablet by connecting to the camera's built-in wi-fi hotspot. Or you can upload pictures directly to the web by connecting the camera to a wi-fi hotspot with internet connectivity. Both ways work great.Before this one I bought a Sony RX100M II. Great little camera, but it wasn't really pocketable (yes, you could fit it into a jeans pocket, but you would probably hurt yourself if you tried walking with it). Also, the menu wasn't as intuitive or smooth. Plus, it was rather slow to navigate between images in playback mode, not something I was used to since owning the S100, which was very quick.You can't go wrong with either camera, and it really depends on what you value more. For me, the size and weight of the camera was more important than slightly better image quality of the Sony. I wanted a camera that I could bring with me anywhere and not worry about it, and this one is perfect for that.I had both cameras to compare side by side. In terms of portability, even though the size & weight look pretty similar on paper, it's no contest when it actually comes down to carrying the camera - Canon S120 wins. If I was going to carry the Sony, it would always be in hand or in a case. That defeats the whole point of having a pocketable camera. I might as well carry a larger & better camera if I'm going to carry it in a case.While the image quality was slightly better in the RX100M II (especially in low light), it wasn't *that* much better. After carrying around both cameras for a week, I definitely prefer the Canon in terms of portability. I could slip it into my jeans or jacket pocket and forget about it - not something I could say about the Sony.Both cameras are built like a tank - fantastic build quality. However, I think that the Canon would probably survive a fall onto concrete/marble floor better than the Sony, which has an articulating screen & huge lens.Pros of the Canon S120:- Small, lightweight, & most importantly pocketable!!!- Quite a bit cheaper than the Sony RX100M II ($450 vs $750)- Wider angle (24mm vs 28mm)- Longer optical zoom (5x vs 3.6x)- Touch screen is very nice - useful for manual focusing, menu navigating, picture browsing, etc- Faster, smoother, and more intuitive user interface - the Sony user interface felt much slower- Better optical stabilization - I noticed that I got more sharp pictures hand-held at night than with the Sony (on auto mode)- Built-in neutral density filter - can do really cool motion blur effects during daytime- Better automatic mode - closer to the way I want the pictures exposed - skin tones in particular are more natural looking- Very cool built-in HDR mode- Continuous 9.8fps burst mode until the card fills up - that's awesome! (very few cameras have this)- Clicky selector ring around the lens - the Sony also has one, but it's smooth (no click feedback), and therefore harder to select settings accurately. I found myself under-rotating or over-rotating the ring when trying to select settings on the Sony.Pros of the Sony RX100M II that I will miss:- Sweep panorama - great feature - I don't get why Canon still didn't get this one- 20MP - awesome detail - you can really use digital zoom with so many pixels- Huge 1\" sensor - better quality pics in the dark, but not *that* much better- Longer battery life - no big deal as extra batteries are small enough to carry- Extremely fast focus & shutter - a little faster than the Canon- Long flash range - you can also manually tilt the flash to bounce off of the ceiling- Articulating screen - can tilt the screen in different directions- NFC quick connect feature - very quick tap & connect on some NFC enabled phones", "Date": "November 18, 2013"}, {"Title": "Perfect pocket camera when you don't want to bring a DSLR", "Author": "Mark Sanchez", "ReviewID": "R12I2HG3C3IV1J", "Overall": "5.0", "Content": "The S120 is a fantastic pocket camera to use when you don't want to carry around your DSLR.  For the last couple years the camera I use is a Canon DSLR.  Even though I have 2 older ELPH's, I always have used my DSLR until now.  The Canon S120 is pretty amazing for a pocket sized camera and works perfect as the camera to grab when you don't want to carry the big DSLR.  There are definitely some advantages and disadvantages worth pointing out.I've been using the S120 for 1 week now.  From power up to 1st shot takes barely 1 second.  Shutter lag is slightly longer than my DSLR (T3i), but hardly noticeable and completely acceptable.  I really like the amazing resolution on the LCD.  It almost makes up for not having a viewfinder since I can really see the focus on my shots, but the downside of course is that framing is so much harder without a viewfinder, but that's the tradeoff of a point and shoot.  The pictures look fantastic to me.  Low light shooting is pretty good with the lens at its shortest focal length and f1.8.  Zoomed shots in low light are pretty dark even with high ISO and should be steadied with a tripod or support.  Shots in good light are quick to focus and sharp when hand-held.  The built in flash absolutely stinks compared to speedlites, but such is the way with tiny built-in's.  I wish Canon would give you off-camera wireless like they do on their new DSLR's.I don't have the STM lens capability, so this not may be true to everyone, but I enjoy using the S120's video shooting much more than my DSLR despite the sensor size advantage due to contrast detection's focus advantage while shooting.  The focus and optical zoom is sharp and silent while shooting.  The 60p frame rate makes shots look a little artificially smooth, but things look very realistic too.The menu system is good and familiar to me as a Canon user.  I've tried out some of the filters and effects, and they work pretty well and are neat to use.  Bracketing and HDR options are great and very quick, as is the background blur mode thanks to the very fast shooting speeds.  Speaking of which, if you set a continuous shooting shutter, the speeds are as fast as advertised.  I'm using an older Class 10 SD card, made by Lexar, that isn't fast enough for my DSLR's video capture, but works great for all shooting modes on the S120.  So I'll say you definitely don't need as fast of a card in this camera as you do in your DSLR.Wi-Fi setup allows access to Canon's Image Gateway, the smart phone app (Canon Camera Window), and ability to transfer files directly through a Wi-Fi access point.  Initial setup take a little time, but once set, it's easy to use the Wi-Fi modes.  Battery life is a little short.  Granted I spent a lot of time playing around with settings and not shooting, but I could easily burn through a battery in an afternoon.  I'd rather have a compact camera with a small battery though, so it's a fair tradeoff.  The size of the camera can't be beat for this level of camera. There's quite a bit of mass to the solid construction, but it could stay in my pocket all day.I'm very impressed with the S120.  The initial price is pretty high and I debated just getting the S110 and saving $100, but in the end I decided that this was going to replace the use of my DSLR in a lot of circumstances, so worth paying a little extra.  The S120's compact size, 1/1.7\" sensor, f1.8 lens, fast shooting speeds, and features focused on DSLR users (like RAW and the selector ring) really won me over.", "Date": "October 10, 2013"}, {"Title": "Worth carrying another device", "Author": "Brian", "ReviewID": "R1UYELY4B7GTHL", "Overall": "5.0", "Content": "I chose the Canon S120 because I wanted a true pocket camera that takes great pictures and videos. The review sites cover the S120 pretty well, so I'll focus more on why I chose it, how I use it, and how I like it. And since a memory card isn't included, I also ordered a 32 GB (80 MB/s) SanDisk Extreme SDHC Class 10 UHS-1 memory card for storage.  This card easily handles continuous shooting and the supported HD video modes.My previous digital cameras have also been Canon point and shoots (mostly ELPHs). I've gotten used to putting them in my pocket to take with me on trips and to special events. However, smartphone cameras have improved to the point where I started leaving my aging ELPH at home. But even the best phones have notable limitations, and there are times when I want much better pictures than what my smartphone is capable of taking.I still wanted the convenience of carrying a pocket camera, so I wasn't interested in a bulky camera body and kit lens, or even a compact that doesn't fit in my pocket. So I narrowed it down to the Canon S120 and the Sony RX100. The Sony's 1\" sensor was intriguing; however, this Canon's 1/1.7\" sensor is still substantially larger than anything that I've used before. Plus, the S120's image quality typically gets pretty good reviews.I decided that either the Sony or Canon would give me acceptable pictures, and it wasn't necessarily about which one takes the \"best\" photos. The price was important, but the size was the deciding factor. I looked at a Sony at our local Best Buy; and the (arguably minor) additional thickness made it too big to carry in my front pocket. Sure I could put it in a case; but if wanted to do that, I'd add the Fujifilm X20, Canon G16, Panasonic LX7, and Olympus XZ-2 to my list.I also take pictures of marine reef aquariums, so I appreciate the S120's manual controls which allow me to adjust the white balance, aperture, ISO, and shutter speed. Plus, the option to shoot in RAW format is real bonus for this type of photography. Reef tank lighting and moving fish can be a challenge for typical point and shoot cameras; however, I'm impressed with how well this camera handles these shooting conditions.Its 922,000 pixel, 3\" touchscreen is sharp, allowing for accurate manual focus adjustments. In addition, the S120 supports either manual focus magnification or peaking (which highlights the edges of objects that are in focus). This is helpful for extreme close ups. However, the autofocus is quick and you can use the touchscreen to select your subject. The camera will even continue to focus on that subject as it moves, or while you frame the shot.Previously, I had been using a Canon ELPH for travel, a Canon A-series (w/ some manual controls) for taking pictures of marine reef tanks, and a Cisco Flip for occasional videos. The Canon S120 replaces and improves on all three of these cameras. I sure won't miss juggling both the Flip and the ELPH around on vacations. Plus, the S120 is small enough to comfortably carry in the front pocket of a pair of loose fitting jeans.The pictures that I've taken have been good, even in lower light without a flash. I'm glad the flash doesn't pop up whenever the camera detects low light. I typically just zoom out to 24mm (f/1.8) to get the shot; however, you can easily activate the flash when needed. It has 3 different intensity settings, and does a good job preventing red eye (without using those annoying strobe flashes). Now I can finally take decent indoor and evening pictures.Even so, I wish the sensor was a little larger and/or the lens was a little brighter (especially at telephoto). Understandably, when shooting in low light without a flash, the photos can be slightly grainy or blurry. However, the processor handles high ISO well, and holding the camera against a solid surface can help reduce blur from camera shake during longer exposures. For me, this is an acceptable trade off for having such a pocketable camera.Some people use the Canon S120 when they don't want to carry a DSLR; but I use it when I want to take much better pictures and videos than what my phone can take. Now, instead of leaving my camera at home, I bring it along with me (in my pocket). It's a much better camera than my older ELPHs, but I basically use it the same way. Previous Canon point and shoot users (of any series) should be comfortable shooting quality pictures and videos with this camera.I'm pleased with this purchase, and consider it to be a good overall value. While not perfect, the S120 is the best camera that I've owned. It's not quite as small as an ELPH, but it's still small enough to carry in a pocket. And while I frequently use the Auto mode, its manual controls are invaluable whenever I need them (or if I just want to get more artistic). Finally, the ability to take quality 1080p/60p movies (in MP4 format) is the icing on the cake.", "Date": "October 10, 2013"}, {"Title": "Canon S120 vs Sony RX100", "Author": "Jeff Aski", "ReviewID": "R1XD772R3ZZRY4", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3AOFJ63CGDGLEembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3AOFJ63CGDGLErefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3AOFJ63CGDGLEchiDiv\").innerHTML = document.getElementById(\"cv_mo3AOFJ63CGDGLEhiddenPre\").innerHTML;\n};\ncv_mo3AOFJ63CGDGLErefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3AOFJ63CGDGLEso;\t   \n\n\nfunction cv_mo3AOFJ63CGDGLEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3AOFJ63CGDGLEso = new SWFObject(swfLocation, \"cv_mo3AOFJ63CGDGLEAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3AOFJ63CGDGLEso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3AOFJ63CGDGLEso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3AOFJ63CGDGLEso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3AOFJ63CGDGLEso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3AOFJ63CGDGLEso.setAttribute(\"height\", swfHeight);\n          cv_mo3AOFJ63CGDGLEso.setAttribute(\"width\", swfWidth);\n          cv_mo3AOFJ63CGDGLEso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3AOFJ63CGDGLEso.write(\"cv_mo3AOFJ63CGDGLEflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3AOFJ63CGDGLE', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3AOFJ63CGDGLE';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3AOFJ63CGDGLE', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3AOFJ63CGDGLEloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3AOFJ63CGDGLE\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1DE9VYZ4Y53GZ\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1DE9VYZ4Y53GZ\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1XD772R3ZZRY4\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1DE9VYZ4Y53GZ/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3AOFJ63CGDGLEduration')) {\n      document.getElementById('cv_mo3AOFJ63CGDGLEduration').style.display='none';\n    }\n    cv_mo3AOFJ63CGDGLEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3AOFJ63CGDGLEloadSwf(movieID, playerVersion) {\n   return _cv_mo3AOFJ63CGDGLEloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3AOFJ63CGDGLEnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3AOFJ63CGDGLE', 0, h);\n}\n\nfunction cv_mo3AOFJ63CGDGLEresetPlayer(w,h,bw,cc) {\n  cv_mo3AOFJ63CGDGLEnewHeight(h);\n\n  cv_mo3AOFJ63CGDGLEso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3AOFJ63CGDGLEso.addVariable(\"cacheCode\", cc);\n  cv_mo3AOFJ63CGDGLEso.setAttribute(\"height\", h);\n  cv_mo3AOFJ63CGDGLEso.setAttribute(\"width\", w);\n  cv_mo3AOFJ63CGDGLEso.write(\"cv_mo3AOFJ63CGDGLEflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3AOFJ63CGDGLERollOverImg = new Image();\ncv_mo3AOFJ63CGDGLERollOverImg.src = \"http://ecx.images-amazon.com/images/I/81GNUAeNrwS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3AOFJ63CGDGLEpreplay = document.getElementById('cv_mo3AOFJ63CGDGLEpreplayImageId');\nif (cv_mo3AOFJ63CGDGLEpreplay) {\n  cv_mo3AOFJ63CGDGLEpreplay.onmouseover = function() {\n    cv_mo3AOFJ63CGDGLEpreplay.src = \"http://ecx.images-amazon.com/images/I/81GNUAeNrwS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3AOFJ63CGDGLEpreplay.onmouseout = function() {\n    cv_mo3AOFJ63CGDGLEpreplay.src = \"http://ecx.images-amazon.com/images/I/81GNUAeNrwS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3AOFJ63CGDGLEpreplay.parentNode;\n\n  var cv_mo3AOFJ63CGDGLEcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3AOFJ63CGDGLEcurrentClick) {\n      return cv_mo3AOFJ63CGDGLEcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:12 MinsI use point and shoots for video as much as stills, so I'm always on the lookout for the best of both worlds. The Canon S120 comes close to what I like.I also own the Sony RX100, which has been the champion of point and shoots for me. What I don't like about the RX100 is the 28mm lens, slow f stops when you start to zoom, and the AVCHD codec.What I like about the Canon S120 is the 24mm wide angle lens, the MP4 codec for both 1080/60p and 30p and the amazing dynamic stabilization in video mode.What I don't like about the Canon S120 is the terrible battery life (30 mins on full charge), the slow lens when zooming, and the lack of manual control over aperture/shutter/ISO in video mode. Seriously Canon, why leave that out?", "Date": "November 12, 2013"}, {"Title": "A point and shoot for professionals and amateurs alike", "Author": "Perry M. Rogers", "ReviewID": "REZ98ZHS48UWZ", "Overall": "5.0", "Content": "Build Quality 5/5Picture Quality (for category) 5/5Portability 5/5Options and Settings 5/5User Friendly 5/5This is the best S-series camera Canon has come out with by far. The S110 and S100 do not compare to this one in terms of picture quality and features available. I have used the Powershot G15 and G1x as well and the picture quality is almost identical. For the size of this camera, I will be using this one over the G1x any time I travel from now on. It fits perfectly and comfortably in your pocket, unlike the G1x and G15. That alone is almost a game changer when on vacation.The build quality is quite excellent for a touchscreen point and shoot. It is made of the same durable texturized plastic that the G1x is made from, something most point and shoots are lacking. Since it is so new, I still dont know how strong the touch screen is, but it is really responsive and seems very durable. The physical buttons are very responsive and easy to use. You can easily hand this to somebody else to take a picture for you if needed without much instruction besides \"press the button on top\".The settings and features available are really exhaustive for a point and shoot. RAW compatibility, manual mode, f/1.8 aperture, 9.4 fps shooting, in-camera HDR, GPS, and tons of other features help take amazing photos for professional editing. Only major thing lacking is an external flash hot-shoe, but the included flash is not terrible and the sensor takes pretty good low-light pictures anyway. When using manual mode, the control ring is really a great alternative for the dial that DSLRs use.As far as amateur features go, the WiFi is the best part. Its really easy to use and you can easily transfer photos to your iPhone in seconds. Really nice for sending high-quality pictures to your friends or posting to facebook if you dont have your computer with you and you want to free up some space on the memory card.The video quality is just as good as the G15. I could not tell a difference between the two at all.The startup speed is a little longer than most DSLRs, but still good for a point and shoot at about 1 second.This camera will be relevant for a while. The features and picture quality are simply amazing for the size of this thing. When you dont want to lug around all the equipment needed for a DSLR, and need something to fit in a pocket, this camera is for you.", "Date": "November 18, 2013"}, {"Title": "No Cellphone Will Ever Get These Shots.", "Author": "Coug Moog \"s_gil\"", "ReviewID": "R6YM22BQ658TG", "Overall": "5.0", "Content": "Now that direct wi-fi works with the Canon app and the iPhone is capable of processing RAW using Photogene, etc. I have found a good reason to upgrade from my S95. The S95 still takes wonderful pics and is one of the best pocket cameras in existence. I use an Eye-Fi Pro X2 card for wifi with that camera and it works, sort of.This one works right. You can choose using a thumbnail menu which images to send to your phone, process them with some very good smartphone photo apps, combine images, colorize, add text, crop, whatever you want to do, then upload the resulting image in real time.The very best smartphone lens and sensor are toys next to this camera. One of my favorite things to do is take a 3-shot bracket, wi-fi the images to my phone and process an HDR shot using the phone's superior processor.A good smartphone or tablet and the S120 make an exciting mobile imaging team.", "Date": "November 14, 2013"}, {"Title": "Almost perfect camera for a traveler", "Author": "Mannymal", "ReviewID": "R37XSU97OR27YV", "Overall": "5.0", "Content": "I bought this camera for a trip to Seoul, and wanted something more powerful than my cell phone camera or a normal point and shoot. This camera performed admirably for every scene I could throw at it, including low light shots. I am not a professional photographer or reviewer, so I will leave you to Google for good reviews, which there are a few. I will only comment from the point of view of a normal user.Image quality is, as stated above, excellent. I took some beautiful images with this, which my friends remarked were near professional quality.Build quality seems extremely good. Its a solid little camera with very little plastic used. Its just about the perfect weight, and the size is perfect. Small enough to comfortably fit in your pocket, without being too small to be comfortable in use.The LCD screen is beautiful. And if you need a better view, you can connect it to your tablet or smartphone via the WiFi connection, which worked very well. The Canon CW app for iOS 7 worked very well and never let me down. It even allows to attach location data from your smartphones GPS.The only drawbacks: NO PANORAMA MODE. Don't look for it. Its not there. Big shame, I could certainly have used it to great effect where I was. I had to fall back to my iPhone 5 for that function. Also the battery life is mediocre. Plan to get  spare battery to keep around if you are gonna see heavy use. I nearly ran out of juice one day, and you can't charge it via USB while its in the camera, this would at least have let me juice it back up with my travel charger.I am keeping this a five star review because the pros outweigh the cons heavily, but this is more of a four-and-a-half star product.", "Date": "November 15, 2013"}, {"Title": "S120 to go with the RX100", "Author": "Atari44", "ReviewID": "R37B9PFCQQU2AL", "Overall": "4.0", "Content": "Won't rehash most reviews, but I bought this for its video capabilities and to complement my RX100 Mk II.  Like a reviewer said before, the video image stabilization is amazing.  Videos when walking are fairly stable and are watchable compared to the RX100 when walking around.I also had the S110 and original RX100.  I bought this for the upgrade in video to 1080p 60fps and 30fps.  The S110 maxed out at 1080p 24 fps.  The RXs can shoot 1080 60p video in AVCHD, which plays choppy on older laptops - (mid spec'd laptops 4-5 years old).  But the RXs video quality is better in lowlight, evening situations than the S120.  Much less noise, very clean picture whereas the S120  gets very noisy in lowlight.  In daylight, the S120 is clean and sharp.  So, the RX100 wins in video quality in lowlight and the Canon is just as good in daylight and but better in stabilization.For photos, most review sites can give detailed image comparisons. Imaging resource, cameralabs, or dpreview etc.. In daylight the S120 shoots nice pictures with good detail. It's not as sharp as the RXs, but that's only seen when pixel peeping. In lowlight the RXs resolve more detail and are less noisy.  I would say I didn't like the lowlight high ISO pics from the S120.  They were noisy and \"mushy\".If you're a S110 owner and want 60 fps for video, I'd say go for it. That's the reason I upgraded.  Overall, the S120 looks and performs like a better camera.  The body finish is smoother, the control ring turns easier, and its buttons are bigger and rounder, which makes it good for underwater shooting.  I put the S120 into a Dicapac underwater bag and accessing the buttons and pressing the shutter was easy.  Burst mode in this camera is extremely fast, much faster than the S110.  The speed of operation seems zippier over the S110.  Battery life is about the same which isn't really good, couldn't get through a day of shooting without it running out. The S120 uses NB-6L, a change from the S110.  Spare batteries for the S120 are definitely recommended.Uploading video clips to a smartphone or tablet via WiFi and then to Facebook or Instagram works really well too.  The video quality and stabilization beat that of a smartphone or tablet.  The video gets compressed when transferring via WiFi to a smart device so file size isn't an issue.  Miniature mode video and certain filters are pretty fun too.  Using this underwater or on a mountain bike trip is definitely possible.  Makes this a nice multipurpose camera.If you're not into video but want a good pocket cam, Fujifilm XQ1 just came out as an S120 competitor. It has a bigger sensor and Fuji is gaining popularity with their new sensor design.  Might be worth a look. The video I believe is just average, but it's being praised for its picture quality and color.Overall, I like this camera, I'm happy with it, I'm glad I upgraded from the S110 because it has 1080 60fps and 30fps video.  Also it's a nicer camera to handle and the burst mode and operation speed is faster.  So it feels like it's an overall upgrade rather than an refresh of the older model.  And if this had come out before the Sony RX boom, I probably would have just stuck to this camera for my pocket camera.  If I could, I'd give this camera 4.5 stars.", "Date": "November 25, 2013"}, {"Title": "Worth the Wait, a Truly Great Pocket Camera!", "Author": "Don Mago \"Bob\"", "ReviewID": "R2ZJUN4EG9AN0L", "Overall": "5.0", "Content": "Ok, here's my take on the wonderful Canon S120. If that opening seems a bit balanced in favor of the S120, it is meant to be. This is the camera I have been waiting for. In fact, I pre-ordered my S120 on September 8th, thirty days before it was forecast to be available on Amazon. I got two notices before the order became final. I received a shipping notice and the camera subsequently arrived via Lasership in perfect order and one day earlier, October 7th, than estimated. Through tracking I found I might not be home when the camera arrived and called Lasership to ask the driver to leave it on my doorstep. Lasership contacted the driver directly at that minute and made it so, a great shipping company.Now for the S120, I am an amateur wanting RAW format and HD, high quality, video in a pocket camera with above average low light capabilities. I also wanted Wi-Fi. I had looked at the Sony DSC-RX100M II but was scared away by the very high price point. Just as I was about to settle for less, Canon announced the S120 which met all of my criteria and then some. I already have a Canon SD 500 and a SD 990, both top of the line pocket cameras but each lacking in HD video and RAW format capabilities. The Digic6 processor put it all over the top for the S120. My expectations have so far been met.For anyone wanting fantastic, very professional results, the S120's built-in special effects, modes and scenes will deliver surprisingly pleasing results with little effort. The High Dynamic Range setting almost eliminates any need for adjustment of brightness, contrast and saturation, effortlessly delivering print-ready photos right out of the camera. The front-located Control Ring around the lens can be set to control several different functions and is knurled, sized and located to make it very easy to control while shooting. I like to use it for step zooming.The videos and photos can now be set to the same, matching aspect ratio (16x9 or 4x3), making videos using photos and video clips very easy to assemble. Speaking of video clips, the very handy Hybrid Auto Mode simultaneously records both a still shot and a short 2 to 4 sec video clip for each shot taken. I am currently exploring this interesting feature which I believe will greatly enhance the videos I assemble.Some downsides I feel are worth mentioning. First there is the lack of a remote audio socket. The auto wind noise reduction feature of the built-in stereo microphone works only marginally well. Users of the S120 that want high quality sound to match the very high quality (HD and 60 fps) video may want to invest in a stand-alone recorder such as the Zoom HN4. I don't yet have one of these and am using the quality cassette recorder from my old stereo set for indoor sound recording.I got the Wi-Fi setup to work but still have plenty of questions on using the system. The Canon instruction booklet (comes with the camera) and Canon User Manual (available only as a *.pdf file) provide enough instruction to make the system work. However to ensure the system is working securely I feel one should be familiar with the meaning of the terms like SSID, WEP, WPA, MAC (Media Access Control, not the Apple Mac), IP, DHCP, etc. I have made the system transfer photos and videos to my PC but still harbor concerns about the possibilities for security leaks. Perhaps someone could address this specifically in another review.As for accessories, I recommend a remote power supply, ACK-DC40 or equivalent. It fits easily to replace the battery. In my opinion there is ample room for most tripod bases to hold the camera and connect the power supply. Others have said this is a problem, I think not. The distance from the mount screw center-line to the outside of the connector on the bottom of the camera is 1 1/2 inches, allowing a tripod base of at least 2 3/4 inches square to be used.I purchased a Sandisk Extreme 32 GB 80MB/s Class 10 UHS-1 memory card which, based on present experience, will be very adequate for any full day of shooting. I plan on getting two more equivalent cards but at 16 GB each. Extra batteries are a must. Based on the large number of positive reviews I bought a Wasabi charger and two spare NB-6LH batteries on Amazon. I will report if any problems in a followup. In any case, at minimum, I will carry one spare battery at all times.The OEM PSC-900 case is a perfect fit, looks great, and is handy to use. The case loops onto my belt and in locations where I worry about having someone rip off the S120 I first run the hand strap under my belt, the camera through the hand strap loop, then place the camera in the case. I can still fairly quickly pull the camera from the case and un-loop it to shoot. The little inconvenience is worth the extra security. There is little protection from rain or dust with this case and in wet or damp situations I place the camera and case in a zip lock bag and into my pocket.Bottom line, this is a great camera and worth the upgrade if you want a true pocket camera and plan to take many photos and videos. Pros and amateurs alike can produce very high quality photos and videos under low light conditions. I feel many pros will find this a better choice for freedom while traveling and still getting top quality results. The S120 compares favorably almost all along the line to the much lauded Sony DSC-RX100M II at 40% less cost.Bob", "Date": "October 26, 2013"}, {"Title": "Buy this camera!", "Author": "lng", "ReviewID": "R28YTYA3BK2BA3", "Overall": "5.0", "Content": "I had a Canon G15 for about a year and loved it, but with a curious toddler and a baby on the way, I wanted something that I'd actually be able to carry with me wherever I went. So, I started looking at cameras again and after testing a few at home, was sold on the S120. Photos are beautiful, lots of great settings and manual options. The photos are even better than those I took with the G15 (and those were quite good) and even low-light pics look good. Best of all, the camera is tiny, making it easy to carry in my purse or diaper bag, so I never miss a shot. I can't recommend this camera highly enough.", "Date": "December 2, 2013"}, {"Title": "Fast, portable, and love the wifi feature!", "Author": "Cristiano", "ReviewID": "RUVU4SF9XYD5O", "Overall": "5.0", "Content": "I've had the Canon S90 for the last five years and it truly served me well. I was in the market for a new portable camera with RAW and after comparing the Sony RX100 to the Canon S120, I decided to go with the S120. I was hesitant to go with the S120 because it looked exactly like the S90 and I wanted something different but I've discovered that the S120 is a completely different beast!Here are the things that have made this upgrade a worthy investment:1. High Resolution screen: The S120 has a 922,000 dot 3 inch LCD screen, almost double the S90's. Colors are richer and details are sharper!2. Built-In Wifi: I like to share lots of photos and photo collages on facebook and instagram. The S120 allows me to import high-resolution photos into my iPhone with ease. My instagram uploads never looked better (no more grainy iPhone selfies)! I had to snoop around to figure things out as the instruction manual and online blogs offered nothing. If you want simple instructions, I've provided them below.3. Faster overall usage: The shutter speed is fast and the camera's burst feature is awesome (9.4 fps).4. HDR mode: The HDR mode is very useful for scenic, high contrast scenes when you want all the details and shadow areas to come forth!5. Wide Angle: The focal length is 5.2–26.0mm (or 35mm film equivalent: 24–120mm). This is slightly wider than the S90 and the Sony RX100. It may not seem like much but it makes a big difference when shooting various scenes.6. Versatile: I've clumsily dropped the camera twice already (once on asphalt and once in a restaurant) and despite some cosmetic scruffs, the camera works great.Downsides: The battery life on the S120 is definitely shorter than the S90. Be sure to buy a couple of generic batteries for the S90/S120 and carry them with you.How to Import Photos into Your SmartphoneDo not use Canon ImageGateway, you will waste your time with a registration system that doesn't even work (as of April 2014).1. To start importing photos into your smartphone, you've first got to set it up. Do this at home on your wireless network. Connect your smartphone to your wireless network. Connect your camera to your wireless network. Take a few photos, go into playback mode on your S120, press up on the spin dial, select \"Add a Device,\" and then follow the prompts to add your smartphone onto your S120.2. Go to the Apple AppStore and download an app called \"Canon CW.\"3. Once your smartphone is setup and recognized by your S120 camera, you have two options to import photos. The first option (at home on your wireless network): Go to playback mode on your S120, press up on the spin dial, select the smartphone icon, and the camera will begin searching for the smartphone on your wireless network. Turn your smartphone on (make sure it's connected to your wireless network) and open the \"Canon CW\" app (your camera will say \"Start dedicated app on target device\"). The app should recognize your camera and allow you to preview the photos. Select only the photos you want to import. If the app doesn't recognize the camera, try quitting the app and open it up again.The second option (on the road with no wireless network): Go to playback mode on your S120, press up on the spin dial, select the smartphone icon, and the camera will create a wireless access point. Turn your smartphone on, go to your network settings, and then select the access point that your camera has created. Then open up the \"Canon CW\" app and it's the same as above.I hope this helps someone. I spent hours before I figured this out on my own.", "Date": "May 16, 2014"}, {"Title": "I Must Chime In", "Author": "Your Uncle Willie \"Uncle Willie\"", "ReviewID": "R1MST3HJVRW5F9", "Overall": "5.0", "Content": "I've had the S120 for 2 weeks now and have put it thru it's paces .. my S95 was my constant companion in the years I used it and it performed flawlessly over 15,000 shutter clicks  .. I still can't decide if I want to sell it ..There are plenty of pro reviews out there .. as well as a goodly number of reviews here on Amazon .. so, I'm not going to really review the camera other than to say, it is performing for me as flawlessly as my trusty S95 did ..What I am saddened by here in the review section is the number of folks that slam, and rate 3 stars or less, an otherwise fantastic camera .. because of things like the WI FI setup, or the focus assist lamp, or the battery charge life .. etc ..Learn the camera .. this is not a $70.00 point and shoot .. it is a highly advanced pocket cam that requires a degree of study and commitment .. it is a Photographers camera, first and foremost .. and although many of the issues that some have with it can be corrected by learning the camera, nothing can be gained by not learning the camera .. and yes, it requires a degree of commitment ..Myself, and I know it can be debated, however, I believe that the S120 is the best camera of it's type in the World today .. overall .. feature for feature and quality of photographs .. if you are willing to devote the time it requires to learn ..03_21_2014 ,, and let me add the ridiculous reviews that slam the CAMERA over the need to download a PDF manual ...", "Date": "March 4, 2014"}, {"Title": "Canon S120 Excellent Camera - Definite Improvement over the S95", "Author": "T. Barker", "ReviewID": "RZ7M1ZHPGH1XK", "Overall": "5.0", "Content": "I'll write a longer review later, but I wanted to share my first impressions of the new Canon Powershot S120 after some initial use.This camera rocks. Many DEFINITE improvements over my previous Canon S95 from 2 years ago. Speed to turn on, speed to focus, speed to snap a photo, speed to recover and snap the next photo, etc. are AMAZING. Right out of the box these are the fundamental features that are most important and noticeable in my opinion, and they are substantially better than previous models. Finally, you can shoot a photo and IMMEDIATELY shoot the next photo. Of course it doesn't hurt that the SD cards are faster now as well. No point fooling around with cheap SD cards. I bought a SanDisk Extreme PRO 32 Gb (95 MB/s up and down) SD card, so I'm sure this helps.I notice the lens in this camera allows it to take non-flash photos in much darker conditions, so the flash does NOT automatically pop up all the time like the old one used to. The HD video is great, and the focus adjusts appropriately as you zoom in and out. Haven't tried the WiFi file transfers yet, but this feature should be slick.NOW for the only downside I've noticed so far. BATTERY LIFE IS ABYSMAL. I haven't properly benchmarked it yet, but off the top of my head after only 40 or 50 photos (at most) the first charge was done. I couldn't believe it when I looked at the battery indicator after 20 photos and maybe a 30 second video and it was already showing 50%. That's something like 1/4 of the power I had available on the old S95. WOW.", "Date": "January 5, 2014"}, {"Title": "This Camera - Canon S120 - is a Winner!", "Author": "Phillip \"Phillip\"", "ReviewID": "R2JDONBPURVJW2", "Overall": "5.0", "Content": "I highly recommend this camera!  For being just a point and shoot, this camera truly provides the ease of use for everyone while affording high-end features found in DSLR cameras; having the option to manually control shutter speed and aperture, as well as the ability the shoot in RAW is awesome.  Please note, RAW images require post-processing to add sharpness, saturation, and so on (Adobe Lightroom is highly recommended for this).  The image quality of this camera is quite impressive.  I have not yet printed any of the images to a size larger than 8x10, but I truly anticipate that I will not be disappointed in the color and quality of the image.  In regards to the settings for this camera, the menus are easy to access and intuitive compared to cameras from other manufacturers.If you are looking to invest in more than just a point and shoot that will capture memories of life both at home and on the road, this is your camera.  Having gone through several different models of Canon point and shoot cameras, I have found a winner with this one.  And, it complements my DSLRs perfectly!", "Date": "December 12, 2013"}, {"Title": "Can't record movies without battery dying", "Author": "E. Pendergrass", "ReviewID": "R2OF4WGZ6ILKC5", "Overall": "3.0", "Content": "I would give this camera 5 stars if it weren't for one problem.  Unless the weather is warm and the battery completely full, I can't record 1080p 30fps movies for more than about 30s without the battery dying and the camera turning off.I've turned of IS and continuous focus to see if that improves battery life but it doesn't.  I bought this camera expecting to shoot movies about 25% of the time.  It's completely unsuitable for that.  I even have 2 spare batteries but they don't solve the problem.This camera does take excellent pictures and shoots quickly.  The f1.8 wide angle lens is great.  I love the ring on the front and the abundance of hardware controls.  The screen looks good.  WiFi is a bit difficult to set up but once done is super convenient.I even dropped this camera in the water while it was on and it still worked after I dried it out.  This happened after I noticed the movie recording problems and the two are not related.Still, if you expect to take movies outside don't get this camera because it's nothing but frustration.  My Canon SD880 IS could shoot 720p all day long in freezing temperatures.  This camera needs better power management.", "Date": "December 29, 2013"}, {"Title": "The best camera I've ever had", "Author": "May", "ReviewID": "RLZU3QHZIVVZC", "Overall": "5.0", "Content": "I am strictly a point and shoot camera type of person. I've owned Kodak, Sony Cybershot, Canon S95 and this is the best ever and I highly recommend it. My boyfriend owns a DLSR camera, and even he is impressed with the quality of this little camera. I am absolutely blown away with the Stars feature. I had it in my backyard, set it to the Stars function, click, waited 20 minutes and I captured a beautiful star trail right in my own backyard. I have friends asking me about this camera and they are sold when I tell them how good it is. My most favorite feature is the wifi. It is so easy to connect and you can upload & share pictures instantly. I travel alot, and I can easily take this with me anywhere. If you are debating between the S95 or S120? The S95 had a few minor flaws in my opinion. The S120 got it right.I need to warn everyone though that I had a little mishap before I got this camera. Amazon sent me the right box, but WRONG camera!! As soon as I emailed Amazon about it, they shipped me the correct camera.", "Date": "January 27, 2014"}, {"Title": "Great small camera", "Author": "David", "ReviewID": "R38APG4W5F6J86", "Overall": "5.0", "Content": "This is an excellent pocket-sized camera. I got it because I wanted a pocketable camera with more manual control than my previous Canon ELPH series camera. This camera is convenient to carry, takes great pictures for a camera of this size, and offers a lot of control options. I have been very happy with this camera.A couple things to consider:This camera is larger than Canon's ELPH series cameras because of the lens ring extension on the front. The textured surface on the lens ring can catch on the edge of your pocket while inserting the camera making it less convenient to carry than a camera without the lens ring.The S110 is a very similar camera with a lower resolution display and other differences, but it is significantly cheaper. I like the display on the S120, but I would seriously consider the S110 if I bought it again.The WiFi function does not seem to have the ability to transfer RAW images.", "Date": "May 4, 2014"}, {"Title": "Wonderful photos", "Author": "molly in 808", "ReviewID": "R1HBVD13ZWPZY", "Overall": "5.0", "Content": "Have had this camera for about 3 months, now.  Its primary use is for taking pictures.  I have been more than pleased with the quality of the photos I have taken, which are primarily of my grandchildren,  The photos are clear and the colors are natural and pleasing. I mostly use the P or AV modes to take my pictures.  I use the TV mode to take action soccer shots. If lighting is sufficient for indoor shots, I do not turn on the flash.  I previously owned an s95 and presently also own an sx260, which I use mainly for traveling.  This s120 is superior to both of these cameras.  I had wanted to try a dslr, but it is just too heavy to \"grab and go.\"  My s120 fits all my needs with excellent quality photos to boot--simply love it!!", "Date": "March 22, 2014"}, {"Title": "Almost a pro in a compact body", "Author": "César Jacó Habitzreuter", "ReviewID": "R1N4BE87P25EPT", "Overall": "5.0", "Content": "I'm impressed with the results of this camera.Good points are:- Files in raw format;- Front ring which enables fast configuration changes;- The focus and shooting are fast;- The video quality is also very good;- And the most prominent is its capacity with night shots or low light environments.Negative points are:- Does not have integrated GPS and requires connections with smarthphone or tablet;The performance of this camera is almost comparable to a current entry DSLR, but in a compact body that fits in any pocket.", "Date": "March 16, 2014"}, {"Title": "Upgrading from my Canon Powershot S95", "Author": "T. A. Dinh \"iAmAlexander408\"", "ReviewID": "R1RWSW5AA9CB95", "Overall": "5.0", "Content": "Hello! It's been awhile since I've written a review for Amazon so definitely I wanted to let everyone know this is one of the best pocket cameras from Canon. I loved the S95 but unfortunately it has not functioned for me lately so I decided to take the jump for the S120.The S120 low light function is brilliant, I'm amazed at the night scene setting where I'm able to get a fantastic picture when there's very little light around. I'm mainly using the camera in Auto mode and it does very well for me.Pros1. Wi-Fi very handy when needing to transfer files2. Fantastic low light capability3. Compact and Lightweight fits perfectly in my pocket4. Takes pictures really quickCons1. The battery does not last very long, within 30 minutes after recording the low battery light blinks already2. The microphone is at the top, if you're recording you have to watch where you put your fingers3. There tends to be a lag when going from playback pictures back to camera mode, it could be faster!4. May be difficult for a beginner if they don't know how to function the scenes properlyOverall I'm happy with the purchase. I've made over 80 videos to this day with the camera everyday. If you're curious on the video quality I highly suggest you check out on YouTube \"iAmAlexander408\". You'll see all my video vlogs I made that are all mainly used from this camera.", "Date": "January 12, 2014"}, {"Title": "You need at least 3 batteries to use it for video!", "Author": "hockeydude44 \"hockeydude44\"", "ReviewID": "RYVWCGMAMJXGU", "Overall": "3.0", "Content": "This camera is great for amateurs and prosumers.  I love the incredible depth of field, image stabilization for video, and picture quality.  However, recording video on this camera will suck the battery dry in a matter of minutes.  If you plan on filming a night out, day at the park, or anything more than a single video, then plan on bringing at least 2 spare batteries.  I've noticed that I only get about 10 minutes or less of recording time before the camera battery is completely drained.  I hope they fix this in their next model!", "Date": "April 20, 2014"}, {"Title": "awesome little camera", "Author": "Kari Kessel", "ReviewID": "RMA0UB6UTQ1YS", "Overall": "5.0", "Content": "Short and sweet: great quality pics, awesome size for easily carrying it in a pocket or purse, and easy to figure basic functions out, altho you have to go online for the full manual and learning the finer details (and I learned a LOT by reading thru it!)I also found the BEST little camera bag for it - perfect size and nice padding, with a pocket for extra batteries and memory card = Swiss Gear Legacy.", "Date": "February 10, 2014"}, {"Title": "Canon PowerShot...", "Author": "Don", "ReviewID": "R3834M50OXW4X2", "Overall": "5.0", "Content": "Yes your smart phones take good picture and they are with you all the time. But this camera does it all and then some. This is a perfect camera to take any where you are going to shoot video or pictures. It is in a class of its own. Highly recommend it.", "Date": "February 2, 2014"}, {"Title": "The Best Game in Town", "Author": "Peter Besenbruch", "ReviewID": "R2WVL1P3Q4OO6W", "Overall": "4.0", "Content": "Canon targets the S series of cameras at people who want a decent quality camera that fits into most any pocket. It shares its electronics with the larger G series cameras.What defines \"decent?\" The lens is fairly well made, if a bit fuzzy in the corners on full wide angle shots. The body of the camera is made of this remarkable, new material, called \"metal.\" The metal body gives the camera considerable weight and heft. The screen is fairly large, boasts almost 4 times the resolution of other camera screens, and is touch sensitive. The camera interface is a combination of touch, buttons and rotating rings. It's really rather well thought out.Above all, the S120 features a 1/1.7\" sensor for lower noise per given ISO sensitivity level. Aside from lower noise images, the larger sensor makes fewer demands on the resolving power of the lens. In practice that means you can use slower lenses, or higher f ratios.Most ultra compacts use a 1/2.3\" sensor. The upside to the smaller sensor is you can use a smaller lens and other parts to achieve similar results. Therefore, it is all the more remarkable that Canon managed to keep the size of this camera down. They managed it by shortening the overall focal length of the lens. Yes, this is a 5x zoom, but it zooms from 24-120mm, rather than the more typical 28-140. They also gave it a fairly long focal ratio on telephoto shots. While f5.7 is faster that what is offered on an ultra cheap camera, it's still pretty slow.What does increasing the camera size give you? Look at the G series cameras. Aside from a not-so-great viewfinder, you get a larger lens. Not only is it longer (28-140), it's faster (f1.8-2.8), too. The greater lens speed carries with it two advantages. First, you can shoot in dimmer light. Second, because faster lenses deliver higher resolution, the G series cameras can take full advantage of the sensor's 12 mega-pixels throughout the zoom range. The S120 can take some advantage of 6 mega-pixels at full telephoto zoom. I'll exaggerate a bit (but only a bit) and say that the S120 is actually a good 6 mega-pixel camera.To put it baldly, the G series is significantly better than the S series for taking pictures, unless you want a very small camera. If \"size matters,\" then the S120 is the best game in town.", "Date": "December 11, 2013"}, {"Title": "Best truly-pocketable hiking camera I've owned", "Author": "peacefrog", "ReviewID": "R1DX3TPHGLAGV8", "Overall": "5.0", "Content": "For a landscape hiking camera this is a real winner. Perhaps the best out there over-all.  Pocketable, built really well, packed with DSLR-like control. I simply set the ISO around 100, the aperture fairly high, and snap away. The results are fantastic. I do virtually no post-processing. Then in the evenings, I’ll raise the ISO and lower the aperture and get amazing lower light stuff without the flash. For icing on the cake, videos are super clear and enjoyable and the darn thing can send images to my iPad!My only gripe is that the battery on this model doesn't last quite as long as some other point and shoots I've used.", "Date": "March 9, 2014"}, {"Title": "A small high quality camera.", "Author": "Alban Arthuan", "ReviewID": "R6PAVUNBZ6LSZ", "Overall": "5.0", "Content": "It's fun taking pictures of stars and also objects that are scene in the moonlight.  With the ISO maximum setting at 12800, night time  pictures would appeared as daylight.  Shadows are no problem with this camera.  I do wish they would make a reference book for this particular camera because there are so many features.  You also need to buy a separate case for it, but you can get that at anyplace such as Walmart.", "Date": "January 28, 2014"}, {"Title": "Canon s120", "Author": "OZAN", "ReviewID": "R1YVJNIGGBE6E8", "Overall": "5.0", "Content": "I really liked this camera, very nice colours, hd quality, wifi is great, easy handle, i can recommend without doubt.", "Date": "January 17, 2014"}, {"Title": "Take good and reliable photos", "Author": "Ralph 965 \"Ralph 965\"", "ReviewID": "R1LMON210LCOL1", "Overall": "5.0", "Content": "I bought this camera only after a few months I bought the Sony NEX6.  I need a small carried around camera, which is available when I need it.  The NEX6, is relatively small but still you need a bag to carry it around.  To me, the S120 is an amazing little camera that gives you the photos you want under whatever conditions.  The DIGIT 6 definitely makes a big difference, and can give you the photos like what you see with your eyes even in evening light and dark indoor without flash.  If you really care about high quality photos instead of usable photos, this may not meet your standards.  The small sensor on S120 is no compare to my NEX 6's APSC sensor.  However, other than the noise level, the S120 provides reliable photos better in every aspect than the NEX6.", "Date": "January 11, 2014"}, {"Title": "awesome", "Author": "Jimbo \"Jim\"", "ReviewID": "R3TAB2SB2PDFAD", "Overall": "5.0", "Content": "great photos and videos on our vacation.  jpg are a bit soft but that can be changed.  raw files not that much better than jpg but you can't expect too much from a small sensor.  can't beat it for a pocket point and shoot.  fast lens comes in very handy.", "Date": "January 4, 2014"}, {"Title": "Very good pictures", "Author": "TONY J. WHEELER \"Tony\"", "ReviewID": "R3FPI706N3Q5QL", "Overall": "5.0", "Content": "Very happy.  Still much to learn about the camera but initial photos look very good indeed.  As usual a good price and excellent service from Amazon.", "Date": "January 3, 2014"}, {"Title": "High performance compact", "Author": "Jim Smiley", "ReviewID": "R857KV4O0X8YZ", "Overall": "5.0", "Content": "The S110 is a better value, but the improvement in software in the S120 makes an incrementally better photo and video.  The wifi connection to my iPad is so complicated I have yet to succeed, but reading the memory card directly in a MacBook Pro is easy and a mini USB cable also works easily.", "Date": "April 25, 2014"}, {"Title": "Canon Tiny Camera", "Author": "rshackle", "ReviewID": "R18A7GJOZZZ350", "Overall": "5.0", "Content": "The Canon Power Shot S120 is a great little camera that sacrifices little in exchange for portability. I bought this for my wife to take on a European trip where my Nixon SLR would have been a pain to carry,  and her smart phone wouldn't provide comparable quality of photos. Not only does this take beautiful pictures; but it also handles HD video. Transferring pictures is easy to a PC,  smart phone or tablet.  So she can transfer her pictures and have plenty of space for more photos or video.", "Date": "April 20, 2014"}, {"Title": "Love My Canon S120", "Author": "Michael Devine", "ReviewID": "R2X7JSM9CY6U8V", "Overall": "5.0", "Content": "Portable for hiking and with the new digic 6 sensor takes \"amazing\" photos. So many awesome features like star mode that allow you to get creative after dark too. Honestly I love this camera..Check my Instagram gallery at hikeraz for some sample photos..BUY IT PEOPLE!", "Date": "April 19, 2014"}, {"Title": "Crystal clear still photos", "Author": "Michael S.", "ReviewID": "RK8JECHKZ6KTX", "Overall": "5.0", "Content": "Have used the Canon S120 for 4 weeks.  Have taken very clear, high quality indoor and outdoor shots  using the Auto setting. Very compact and transportable.  Fits in trouser and shirt pockets.  Battery life was acceptable when used for stills only.  Appeared to run down when used for slow motion video.  Quick start up and fast shot to shot turnaround.  Vast improvement over s95.", "Date": "January 10, 2014"}, {"Title": "Clear winner", "Author": "Renovator", "ReviewID": "R35S1CAHFPRLKR", "Overall": "5.0", "Content": "I have tried Nikon CoolPix 9500 prior to this camera. There is a huge class difference between these two cameras, the later being the clear winner. Better picture in the low light and self explanatory touch screen menu makes your job so easy to navigate. You lose nothing buying this camera and it would be a great investment.", "Date": "January 12, 2014"}, {"Title": "Very good camera", "Author": "Tetiana Kiriazova", "ReviewID": "R1NZQB4R43PT85", "Overall": "5.0", "Content": "It is compact, light, and the quality of the pictures is very good! Zoom is only x5, but nevertheless  everything else met my expectations.", "Date": "December 13, 2013"}, {"Title": "Love This Camera.", "Author": "Stills Photographer", "ReviewID": "R1D649JHEKI9QU", "Overall": "5.0", "Content": "Upgraded from S95 Canon. Came quickly, everything complete. I love the camera. I can quickly change where it focuses just by using my finger on the screen.", "Date": "November 28, 2013"}, {"Title": "Great Camera", "Author": "TerriC", "ReviewID": "R3V40YS70ZB53C", "Overall": "5.0", "Content": "Love the camera. I have not read through all of the very large manual which is not included. There are so many options but even in full auto mode the pictures are clear and sharp. This camera has a great zoom and is very small and easy to carry around in your pocket.", "Date": "December 18, 2013"}, {"Title": "If it's good enough for me as an artist/designer, it's good enough for my wife.", "Author": "Richard Fosselman", "ReviewID": "R22ROISGQD34SZ", "Overall": "5.0", "Content": "I used to have the s100, so I gave it to my wife and got the s120. The latest model is spectacular.", "Date": "February 18, 2014"}, {"Title": "Fiddly enough for a semi-pro photographer", "Author": "Michelle", "ReviewID": "R240LYH5YXOU9P", "Overall": "5.0", "Content": "I use a dSLR camera (Nikon *gasp*) on a daily basis and wanted something small and easily portable to throw in my purse for those spontaneous moments and for when I go to those places with placards that read \"NO PROFESSIONAL PHOTOGRAPHERS\".The camera is fiddly enough that I can go fully manual and adjust settings to my heart's content.It's not really a great camera for the Nikon shooter, though, I suspect - it's not really evident where certain settings are stored (though according to my Canon dSLR friends, it makes sense to them) and navigating the preset settings isn't as intuitive as I would have liked.As others have noted, the instruction manual IS a pdf online, so it's not even feasible to carry the manual around during that learning period... unless you don't mind burning up your smart phone's battery by storing the manual THERE and constantly referring to it.I love the wi-fi capability; I have the photos sent to my (Android) phone where I can do a little post-processing in Snapseed (and will accept recommendations for other photo editors!) before posting to Facebook, Flickr, or Instagram.", "Date": "June 5, 2014"}, {"Title": "Awesome Camera.", "Author": "DAS", "ReviewID": "R1CLGIQ41N8TLJ", "Overall": "5.0", "Content": "I am not a camera expert but I want nice pictures and videos.  I have a Canon T3i DLSR and a Vixeo G20 video camera but wanted something smaller to use everyday.  This camera is small and takes excellent photos and video.  Very happy with it.  Pricey though.", "Date": "June 3, 2014"}, {"Title": "Great small camera.", "Author": "Judith A. Grubbs", "ReviewID": "R322NGE4CTOBVC", "Overall": "5.0", "Content": "I replaced my PowerShot S95 with this camera.  Great camera as a backup for larger DSL.  Very good indoor and low light shots.  I carry it in my purse all the time.  The pictures are miles ahead of the quality of phone shotsl.", "Date": "April 25, 2014"}, {"Title": "Very nice camera", "Author": "Kenny", "ReviewID": "R2FLC0RI4HKMS9", "Overall": "5.0", "Content": "I've used this camera for about a month now and I am very happy with it.  Pictures are very clear, color is true and it's a breeze to use.  Bought a case to carry it and just enjoy the whole experience.  I'm partial to Canon anyway but I researched carefully.  This was highly rated and I concur.", "Date": "April 14, 2014"}, {"Title": "Strong, simply!", "Author": "Robert B. Hollingsworth \"ApexMan\"", "ReviewID": "R15NLY9IUWWN0K", "Overall": "5.0", "Content": "Such a stout performer in a small, strong package!  I replaced a 6 year old S780, all that this camera features is comparable/surpasses my G12!", "Date": "April 7, 2014"}, {"Title": "Great travel camera", "Author": "Amazon Customer", "ReviewID": "R1KA8JJYPJNQU", "Overall": "5.0", "Content": "As a serious amateur, I find this Canon PowerShot to be a great camera to use when I don't feel like carrying my DSLR.  I use it for casual parties, travel where I don't want to pack the larger camera and lenses, and outdoors with my kids.  The quality of the pictures and video are excellent.  The camera is very responsive for a point and shoot, and I enjoy the flexibility to take pictures in RAW when I want too.  I use the Wifi sparingly because I don't really need to transfer pics wireless and I find it drains the battery very quickly.  On the whole, I think this is an excellent compact camera capable of great pictures.", "Date": "March 31, 2014"}, {"Title": "excellent camera .. wifi could use some work on direct transfer...", "Author": "sterling wong", "ReviewID": "R7ZGGOZVGP7RL", "Overall": "5.0", "Content": "Its fast and useful with a great lens.  Wifi sucks as it can not directly transfer to a mobile phone like the Samsung cameras. The image quality is excellent.", "Date": "March 30, 2014"}, {"Title": "Great camera for underwater", "Author": "Juergen Hauber \"Performent43\"", "ReviewID": "R25GIS4YIYF2TB", "Overall": "5.0", "Content": "I purchased this with the Canon Waterproof Case WP-DC51, made specifically for this camera.  It worked very well underwater.  I was impressed with the ability to change the white balance setting for underwater use.  Pictures and videos are sharp and clear.", "Date": "March 26, 2014"}, {"Title": "Great little pocket camera", "Author": "FS", "ReviewID": "R1BLOB59A2F4F4", "Overall": "5.0", "Content": "This camera takes great photos and especially in low light. I like that it doesn't have to use the flash when indoors. I've had the S90 and S95. I've been lucky and haven't had the dreaded \"lens error\". The only thing I would like is a longer zoom.", "Date": "March 16, 2014"}, {"Title": "I have owned Many Canon Powershots, this is the best one yet!", "Author": "S. Oppenheim \"samoppenheim.com\"", "ReviewID": "R21129D06JLHVP", "Overall": "5.0", "Content": "I have owned the PS s90, and PS s70. The older models had a titanium body, this one is almost as hardy. the older ones also shot RAW, had manual settings, and could control the flash output *(very helpful). This does all that just as well and now it also has wifi for sending your completed photographs via internet to online sites and your computer.Highly recommended pocket-sized professional quality *(when used carefully) camera.", "Date": "January 12, 2014"}, {"Title": "I have owned Many Canon Powershots, this is the best one yet!", "Author": "S. Oppenheim \"samoppenheim.com\"", "ReviewID": "R21129D06JLHVP", "Overall": "5.0", "Content": "I have owned the PS s90, and PS s70. The older models had a titanium body, this one is almost as hardy. the older ones also shot RAW, had manual settings, and could control the flash output *(very helpful). This does all that just as well and now it also has wifi for sending your completed photographs via internet to online sites and your computer.Highly recommended pocket-sized professional quality *(when used carefully) camera.", "Date": "January 12, 2014"}, {"Title": "Has everything I need", "Author": "Andi C Bair", "ReviewID": "R15KJ0FQHR0S9U", "Overall": "5.0", "Content": "Canon S120 is a feature-rich camera. It does what it promises, and does it well. I have to admit, though, that many cameras by reputable makers (and there are many) deliver what they promise. It is more about what camera traits you are looking for. So, I would suggest to anyone looking to buy one to google 'camera trait search' and get the lay of the land.The S120 is a fixed lens camera (point and shoot, some would say), with 12.1 resolution (megapixels), and x5 zoom. Probably the most important point for this class of cameras is the sensor size, which is 1/1.7 inch CMOS-type. That is just a number, but one that matters. Most point and shoots have a 1/2.3 inch sensor, which is a couple of steps worse than the S120.It does not have a viewfinder, which many in its class don't. The ISO rating is 12,800 which makes it work better in low light. The video is a Full HD- that is 1980x1080 resolution. The camera gives you the option to control manually both the exposure and the focus. It does not have a hot shoe for an external flash option. That is not unexpected for its size and category. The LCD screen has a 922,000 resolution touchscreen, and the burst rate- for fast action- of 9.4 is a great feature. Few cameras in its class have a burst capability that delivers like this one. The camera also does RAW processing which would matter if you did not want to be limited by JPEG storage only. And all this with a light camera weighing only 217 grams.Overall, great camera. Having been into photography for a while, I do stress though that you do a camera trait search. That will also tell you more about what you want.", "Date": "March 11, 2014"}, {"Title": "Absolutely love this camera!", "Author": "Liz", "ReviewID": "R1KCVWQAV3YNXH", "Overall": "5.0", "Content": "I also have the PowerShot S110 (which I will be selling) and there is a noticeable difference between the two. I am so glad that I bought this one. I highly recommend it to everyone looking for a small camera. Be aware that it has no viewfinder so taking photos outdoors might be a bit tricky if you solely rely on the LCD screen.", "Date": "February 4, 2014"}, {"Title": "great clear shots", "Author": "Richard L. France", "ReviewID": "R3745BT5WIMNBK", "Overall": "4.0", "Content": "This camera takes clear, fast shots so we can capture grandchildren on the go.  My only gripe is the pop-up flash that is right where my left hand wants to hold the camera.  Its automatic if needed so you can hinder its use if your hand is in the way.", "Date": "January 20, 2014"}, {"Title": "Blown out highlights, unable to focus in dark", "Author": "M5", "ReviewID": "RNWU4N8DGJKA5", "Overall": "1.0", "Content": "I have been a longtime fan of the Canon S series cameras. I shoot Nikon SLRs, but have been a Canon compact fan for many years now. Prior to this S120 I used the S95 and then the S100. I have been using my new S120 for a week now on vacation and this is a horrible step backwards. Do not buy this camera. I wish I had my S100 with me :(  The first of two major flaws is its blown out highlights -- virtually in any mode. This new sensor is an issue -- despite its reported better qualities. The other major issue that has me wanting to throw this camera off a bridge is its total inability to get a focus lock at night. I am talking about basic high contrast images -- such as shooting Cinderalla Castle at Walt Disney World at night. Nope, that is too much for this camera. I am so sick and tired of hearing that beep and seeing a focus box with an exclamation mark because this sensor cannot handle night shots. This is a big part of my shooting repertoire so I am really mad about that one. Canon has lost a customer in me as I now need to find a camera that can handle metering and night shots more adeptly. Once I get home I will have this camera on Kijiji and will go back to my S100 (which is far superior and recommended, in my opinion).", "Date": "March 8, 2014"}, {"Title": "Not all that great especially for the price", "Author": "Angela K. Grupas \"DrGrupas\"", "ReviewID": "R22B3DTSCOTBS3", "Overall": "3.0", "Content": "Uses up the battery like crazy - no way to turn off the WiFI that I believe sucks battery power.  Get at least 2 extra batteries if you buy this camera. Have used a S100 but prefer the S95. Have 2 - S95 Cannons that I like better than either of them. Some of the controls have been moved to the menu's from the back control buttons to make room for the WiFI connection controls - I have no interest in uploading photos from the camera via WiFI. This seems to be the main benefit of this camera. Takes great photos and the larger 12mp versus 10mp of the S95 has some advantages. 3x vs 5x is a slight advantage. S120 is heavier than S95. Strap is stiff and not flexible enough. Get a used S95 for about $150", "Date": "January 11, 2014"}, {"Title": "Love this camera", "Author": "Jesse Spychalla", "ReviewID": "R26PMGI43Q98YA", "Overall": "5.0", "Content": "This camera was a little more expensive that what I am used to, but it was worth it.  The pictures are amazing and it out performs any other camera I've ever had.  If I had one thing I would change it would be the zoom.  The super zoom cameras are nice to have, but this has normal average zoom capabilities.  Occasionally after taking a picture they look blurry on the screen, but when you look at them on the computer they are clear as can be and compete with DSLR camera.", "Date": "April 28, 2014"}, {"Title": "Best camera I have owned", "Author": "Sachman Bhatti", "ReviewID": "R3OBMRCJXPJWR8", "Overall": "5.0", "Content": "I considered getting a DSLR but I wanted something portable and more point and shoot.  The quality of images from this camera are great, the features astounding and I am more than pleased with this purchase.", "Date": "April 21, 2014"}, {"Title": "Fantastic Camera", "Author": "Erin J. \"Erin J\"", "ReviewID": "R3PS9CPDKI8D9U", "Overall": "5.0", "Content": "This is just what I was looking for.  Professional quality photos with just the push of a button!  Amazing photos have come from this camera.  I am far from a pro but you couldn't tell from the fantastic photos I've been able to take!  Thank you Cannon for delivering once again!  One great camera!!!!", "Date": "April 18, 2014"}, {"Title": "An outstanding camera.", "Author": "Bob Moon", "ReviewID": "RRQACXTR4Q9WH", "Overall": "5.0", "Content": "I have read hundreds of camera reviews, and hundreds of posts on camera forums. Opinions and claims abound. High praises and major put downs can be found about any camera by any company. There comes a point when you have to decide what you expect a camera to do, and how skillfully you are able to make use of the camera in you hands.I own a Canon S95 and now an S120. The S95 captured very satisfying images but picked up a bit of dust on the sensor which I could not dislodge, and the cost of having Canon do it is prohibitive. If not for that I would still be shooting the S95, but having said that the S120 has some nice improvements in every area, but will the images be remarkably different or somehow better than the S95? And that is always the question; will the next camera make your photographs better? The answer is maybe and probably not. Here's why.A camera can only capture what you compose. What the camera can capture is the result of what you see and how you see it. If your objective is to record images to remind you of a moment, or to share with others, those images exist in you, and a camera can only record what first exists in your imagination as you compose a shot. In other words, a camera is perhaps the least important factor as long as it meets the most basic requirements of a camera. You,the photographer, are the most important factor. You are the best lens. You are the ultimate sensor.In the hands of an inspired photographer the S120 can capture remarkable images, and to the eye of the vast majority of people the images the S120 can record are ultimately satisfying, and considering that you can have it with you at all times makes the S120 a perfect camera. That is what I think of the S120, I think it is a perfect camera, and I thought that about the S95 as well for this simple reason; they both record what I see, and what I hope others will see. That is what a camera can do, but it doesn't do it by itself. You make the camera amazing. No matter the price tag or sensor size or lens, you are the most brilliant aspect of any camera.", "Date": "February 17, 2014"}, {"Title": "I love it.", "Author": "Soylent Green", "ReviewID": "R10VBM6GRCE4TX", "Overall": "5.0", "Content": "It's just a great camera. Hi def pictures look fantastic on TV and so does video. Great build quality and feels solid in your hands.", "Date": "December 28, 2013"}, {"Title": "Incredible little camera", "Author": "Alan Rosenthal", "ReviewID": "R1HNKFNDGAGPC5", "Overall": "5.0", "Content": "I bought this as a gift for my daughter before she went on a trip. She loved it, and immediately started taking some great photos with it. It is extremely versatile. Hard to imagine that so much can be packed into such a small package.", "Date": "December 20, 2013"}, {"Title": "still slow in some scenarios", "Author": "S. Lopez", "ReviewID": "R6OKQJBFKIWD3", "Overall": "3.0", "Content": "Its a good camera when lighting is adequate.  However, in flash mode there is still a long delay before the exposure is taken.  This results in a lot of missed shots or shots taken just a quarter second too late, even when people are posing for a photo. I expected more given the newer Digic processor.The ability to shoot in raw is of course what makes this camera a good deal.  and that doesn't disappoint.  But I've found it isn't always the more portable replacement for a good DSLR in casual settings that I had hoped for.", "Date": "January 27, 2014"}, {"Title": "I liked the S series.  Did I get a lemon?", "Author": "Ginger Lee", "ReviewID": "R2ZS3NW2HO9LA0", "Overall": "3.0", "Content": "I tried and really liked the Canon S100 and S110.  In fact, I got sharper photos from the S110 than from the Sony RX100 when comparing side-by-side, at least in low light.  So I was glad to see the S120 go down in price--and purchased it.  Photos seem \"okay\" but are often a little blurry, even after using the flash and a tripod and especially after cropping.  At one point, I noticed that the camera was set to \"fine\" rather than \"superfine\".  Would that account for such a difference?  I really did not like the manual flash, but I suppose that resulted from complaints about the automatic pop-up flash from some customers.  I will return the S120 and am at a complete loss now as to whether to go back to an older S camera, try the RX100 again although there were some issues with it too, or look at something such as the Fuji XQ1.  I refuse to pay the big bucks for the RX100 Mark II.  Suggestions that are not derogatory are welcome.", "Date": "December 14, 2013"}, {"Title": "errors", "Author": "R. Brans", "ReviewID": "R2C4OJ8FFI1A9L", "Overall": "2.0", "Content": "Half of the time when starting up I get a \"memory card error\". Although it starts up ok the next time, it could mean I miss my shot. Very annoying.", "Date": "April 21, 2014"}, {"Title": "User Guide", "Author": "saunterer", "ReviewID": "R3FTGJTQ0O900", "Overall": "3.0", "Content": "Have barely used the camera, but it is different enough from my prior Canon camera that I have needed to refer to the User Guide. Be aware that the User Guide is not included with the camera, but is online as a pdf file. The pdf is 215 pages! It is difficult to navigate online. If you print it out it will be over an inch thick and weigh more than the camera!", "Date": "March 22, 2014"}, {"Title": "Not as good as expected.", "Author": "Doktorek \"Doktorek\"", "ReviewID": "RBWLOD4TCMDXE", "Overall": "3.0", "Content": "This camera takes killer Videos. Anti-shake device works as if you had this camera on Glide-Cam mount. Awesome. But photos Im not really impressed with. For outside it maybe ok. But indoors its not so good. But old S80 took better pictures.  It takes very good pics in dark places where you dont need flash BUT when you put the flash on it takes too long to for the flash to load power to the lamp. You also have to pop the flash up manually everytime (my wife hated that) and when you take pictures in wide angle (24mm focus) edges of pictures long elongated (if you have a face on the edge of your photo - it looks stretched out - I really didnt like that). I took pictures with at wide angle with different cameras and I have never seen this happening on any photos. Battery life is not so great.  It is really weird. Battery didnt last me too long on a full charge.", "Date": "November 17, 2013"}, {"Title": "Perfect pocket camera", "Author": "Roberto Rosselló", "ReviewID": "R1C0YA64KYXCB1", "Overall": "5.0", "Content": "Help me when you don't want to bring a DSLR.Fast power up, fast focus, fast capture.EASY way to transfer pictures.", "Date": "May 2, 2014"}, {"Title": "Great Camera", "Author": "MikeB", "ReviewID": "RT41QP1D4A1GM", "Overall": "4.0", "Content": "I just received my camera. I ordered it yesterday and selected one-day shipping. It arrive at 7:40 PM the next day. I opened the outer box and the first thing I noticed - the Canon box is not sealed. It seems all the components are in plastic bags, but just folded over (no seal). The screen on the back of the camera had someone's fingerprints on it. And if things couldn't get any worse - The camera is $20 less expensive than yesterday.Since I'm not convinced I received a 'new' camera, it's going back. I did not opt to purchase what appears to be either repackaged or refurbished.When I receive the new camera I can update the review.******UPDATE*******I have been informed by many that Canon does not seal their boxes. That being said...I will keep the camera. I don't have a full review yet, but I will say I am happy so far. There are a couple things I'm not happy with, and I don't think they'll be much of a surprise. The first is wifi. If the camera has wifi, why can't I just use the menu to set it up? I have four Canon cameras. This is my third point-and-shoot and I have a 70D. Each time I have to go through the install and try to make it a point to only install what is necessary I end up with all this crap software on my computer.Another complaint is with HDR. Regardless of mode, why can't HDR always be on or off with the mode I'm shooting in? It seems HDR is its own mode. What if I want to shoot HDR of a landscape, or HDR of a portrait? Am I not understanding this feature? Perhaps....", "Date": "December 13, 2013"}, {"Title": "Great Camera but forget the wifi", "Author": "A. J. Frank", "ReviewID": "RP8YMLR7RV4D3", "Overall": "3.0", "Content": "Just got the camera and it takes high quality pictures.But unless you run an IT department and enjoy spending a hour or more fussing with wifi and computer networks, forget the wifi set up.  Very complicated, difficult and time-consuming,Plus Canon was too cheap to include a hook up cable for the camera to your computer.  Grrrrrrrrhh.", "Date": "February 28, 2014"}, {"Title": "Great Camera but forget the wifi", "Author": "A. J. Frank", "ReviewID": "RP8YMLR7RV4D3", "Overall": "3.0", "Content": "Just got the camera and it takes high quality pictures.But unless you run an IT department and enjoy spending a hour or more fussing with wifi and computer networks, forget the wifi set up.  Very complicated, difficult and time-consuming,Plus Canon was too cheap to include a hook up cable for the camera to your computer.  Grrrrrrrrhh.", "Date": "February 28, 2014"}, {"Title": "Apple compatibility", "Author": "sbenisch", "ReviewID": "R34FZLWCOBUWCX", "Overall": "5.0", "Content": "Apple's Aperture recognizes the RAW format used by this camera.  This camera's WiFi is designed to connect easily with Apple's Macs.I don't own this camera, but am leaning towards buying it for these (among other) reasons.  I'd appreciate comments from other Apple users.", "Date": "April 17, 2014"}, {"Title": "CANON S100", "Author": "C Thomas Simonton", "ReviewID": "R1UZ76WQRG53Q8", "Overall": "5.0", "Content": "Love it.  I have owned all three versions since came. The camera fits my situation. Low light capability with portability. And now being able to transfer directly to my iPhone or iPad . Super super. As far as the CANOPY PROTECTION. HAVE NOT RECEIVED IT. It was come to my California address but suspect Christmas mailing got things mixed. Could you please email  me and advise. Thanks CTS", "Date": "January 20, 2014"}, {"Title": "So much capability, you'll want want the manual for anything beyond Automatic mode. Except the manual is only an awkward PDF.", "Author": "Faithful Observer", "ReviewID": "REHE2XNUU0MHW", "Overall": "4.0", "Content": "UPDATE after five months of use:Would I buy this camera again?  If nothing to sway me has come out since, probably I would. And I would still have the same regrets.  Mostly my review discusses the absurd documentation format; there are other extensive reviews of the camera itself.  If you use the camera intensively, on an ongoing basis (as a professional would), you'll learn it well enough and soon enough.  If you use it for only one type of photography, you'll probably find it capable and won't need to learn all the other features (although in that case, this may be more camera than you need, or a specialized model might serve you even better). But if you use it now and then, in a wide variety of situations, it will be frustrating at many times.Canon seems oddly insensitive to this user need. A new example: I figured, hey, load the manual (or key pages) into the camera, so it's always there and I can read it right on its screen! But printing the manual and shooting each page is not the best way to do that (a waste of color ink, loss of sharpness, etc.). Shooting the PDF pages off the computer screen, even a very high res one, is possible, but awkward and results in moire.  So, I figured, import it into a PDF converter, or a PDF reader that can save pages as JPEGs, or make JPEGS by importing into Photoshop.  Rant over, right?  NO -- CANON HAS PASSWORD-PROTECTED ITS MANUAL! You can do nothing with the PDF except read it in a PDF reader in Canon's format, and print it, in Canon's format. I've worked with countless PDF manuals for consumer and professional products, and have NEVER encountered a \"secured\" PDF manual from any other manufacturer. Canon Support says they do this with all their manuals, because they're copyrighted. Does anyone get the point in that? They're protecting against who doing what?A couple other recent observations:* I use Canon's software to download my photos.  Contrary to claims, the vertical shots come out horizontal, requiring me to have Windows rotate them.  I will check further into this.* When the camera is connected to your computer, disconnect it as soon as you are finished with your task. Apparently the camera will not go into sleep mode, and you'll deplete the battery rather quickly.  Canon's AC adapter is too awkward a rube goldberg contraption to bother with for this. (Remove battery, insert dummy battery (provided), into which you plug the cord. The cord, protruding out the bottom as it does, interferes with resting the camera on its base and might interfere with your tripod head. When done, replace the real battery.)* Apparently it would be possible for Canon to enable the current S120 to be operated remotely by a smartphone, by updating software or firmware. There is, I think, already an unauthorized aftermarket hack for this (which I haven't researched in detail). I hear they have recently enhanced some other existing products via software. If you would like Canon to enable remote operation in your S120, maybe it would help to let Canon know. My guess is they don't want to cannibalize sales of the G16, which already has this capability, but it would be a nice goodwill move.It seems Canon has great camera engineers, too many lawyers, sufficient pleasant US-based tech support people, probably a lot of professional-relations experts, and one overworked soul in a hidden-away Consumer Satisfaction office that nobody hears.=========================================================INITIAL REVIEW:Let me start by noting that I've only had this camera for a few weeks of occasional use. So I'll let other reviewers discuss the actual camera.  This is mainly about its documentation, which falls far shorter of excellence than the camera does.  I'm not new to photography, and maybe with this camera that's a handicap. I used Canon SLRs for decades and many other film cameras, but my digital camera experience is limited to a couple of relatively early models, both by other makers. I also have experience at writing spec sheets, instructions and product descriptions, so I know what's possible. Canon is surely up to the task of producing documentation that is more usable than this.  Also, please note that although it may seem I'm coming down too hard on them, to Canon's credit they have already approved and posted a version of this review on their own site, and I would not be surprised if many of my complaints and suggestions could be directed as well at other manufacturers.  While shopping, I was told that electronic-only documentation is the way things are headed.----------------------------------------I also want to make another thing clear: After hours and hours of research, and talking and trying out half a dozen very close contenders in this and nearby categories (including the Canon G16, G15, SX280 and cameras by other manufacturers), I remain confident I chose the camera I want. One of the key items on my wishlist was manual operations -- for versatility and in hopes of reducing the shutter lag that apparently every digital camera this side of a high-end DSLR must suffer. Also important was the ability to quickly make manual settings by way of actual buttons. This is a good camera for that reason, too, once you get to know them.Now if only I could figure out how to use those buttons. NO PRINTED MANUAL? Canon, what are you thinking? Apparently Canon once planned to print it, because it is laid out in a totally non-printer-friendly format (about 9x5, each page having two columns), and comes to 216 pages -- divisible by 4, as a printed booklet would probably be. Even using a popular PC printer utility and an automatic duplex printer, I am unable to get this down to a smaller size. Printed on average-weight paper, it is heavier and four times larger than the camera! What is the point of a pocketable camera when its manual requires a briefcase?So, I've tried accessing it on my smartphone. Not that much more convenient. Because it's a PDF, not formatted for the phone, it's hard to read and navigate. The internal links work if you zoom in enough, and it may be searchable, but manual navigation can still be a pain, harder than simply flipping through pages. (Your experience may vary, depending on app.) Canon put all this effort into wi-fi capability, yet has no doc app? No Kindle/Nook version? At least give us an RTF version in standard page-size format, so users can reformat according to their needs. But we'll never be able to print on paper as thin as Canon can, and compact binding will still be a hassle for most people. I realize the camera's price point is an important mark Canon must hit. So, if nothing else, include a self-liquidating coupon offer. I'd willingly pay US $5 to get a pocketable copy.And, while an electronic version is not a perfect substitute, why not take full advantage of an electronic document's lack of length limitations? I mean, this camera is often referred to as the Pro's pocketable, yet terms such as \"fill flash,\" \"computer,\" \"shutter,\" \"aperture,\" \"priority\" and \"focal length\" do not appear in the meager index. Doubtless they are covered, but it's a guessing-game to figure out where. (Granted, if I happen to be sitting at my computer while taking pictures, I can search the PDF file. But even then, for example, the phrase \"shutter priority\" or even just \"priority\" is not found.)And while the instructions are reasonably intelligible, the discussion of most topics is VERY terse. There's a reasonable argument for not overwhelming the consumer, but again, since this camera is virtually in Pro territory, there's no reason the electronic manual can't be even half again as robust. (And I'll add that a reproducible electronic version would still be appreciated, in case the printed one gets destroyed.)The camera does come with a compact \"Getting Started\" guide. At about 140 pages (70pp per language, English and Spanish), it measures roughly 4x6 inches, 3/16 inch thick. Its first half will get you set up to shoot, take you through shooting your first photos, looking at them on camera's screen, and erasing them. The second half is on setting up the wi-fi, including even how to send photos to another camera, and how to download photos to your computer USING WI-FI. There Is NO coverage of how to download photos over a (not included) USB cable. In fact, even in the PDF, that isn't covered till page 174, in the \"Accessories\" section. (Don't confuse this \"Saving images to a computer\" to the discussion having the same name in the wi-fi section.) Both these discussions assume you have downloaded Canon's software, which is discussed at the start of the wi-fi section.All this focus on wi-fi, wi-fi, WI-FI, and yet no wi-fi remote-control capability (which some reviews have erroneously reported)?Canon, what are you thinking?Partly as a result of the camera's extensive options and capabilities, partly as a result of Canon's crippling our ability to learn them, I'm a long way from getting to know the S120 well enough for a comprehensive review. But it may help some users if I mention these stumbling blocks, which are easy to get past if you're aware of them.* Read the first 20 pages of the manual, to be sure you understand which buttons and dials the manual's symbols refer to.* If you do that, you'll know that on the Modes dial, \"Tv\" means Shutter Priority and \"Av\" means Aperture Priority. I belabor this point so that you won't forget.  Again, what was Canon thinking?  \"Let's avoid terminology that's been used for decades and and instead call shutter-priority 'Time Value'!\"  Maybe they figured novices would think \"Ap\" means \"Automatic program\"? (That works both ways; you can imagine what I first thought \"Tv\" is for.)  TIP: Actual Automatic mode is highlighted in green.* One way to print the manual (so far the most compact way I've found) is to center the page on an 8.5x11 sheet (so that duplex printing will print both sides in register), allowing about an inch for binding (do a test sheet). If your printer doesn't do two-sided printing automatically, be VERY careful that it does not skip a sheet (manual feeding might be advisable). Print the cover and last page on heavier paper if you can. Trim to size, allowing generous binding margin. Clamp using binder clips. Work some glue into the binding (I brushed on some contact cement). Drive 1/2-inch staples (you do have a heavy-duty stapler, right?) generously from both sides (they won't fold, but should hold for some time). After drying, cover the spine and staples with good quality duct, shipping or fabric tape. You might find it easier to carry by rolling it up -- comes to about the size of a 35mm-format 135mm lens case. (Ironic, eh? You're looking at a pocketable camera in order to avoid that bulk!) That will induce some wear-and-tear (especially), but rejoice, you can always produce it again. Other binding alternatives are: binder clips; punch and use binding posts. It will be about ½-inch thick.* When using the index, don't rely on only the instructions found at that page. Some functions are not available in all modes. So, also read the start of that section, for things the manual assumes you already know. (For example, the instructions on adjusting flash intensity assume you know they work only in \"P\" (Program) mode, not in \"Auto.\" Not knowing this drove me nuts the other evening!)* You can reassign the front control ring's function, but apparently only in P mode? Anyway, apparently not in Auto.* Might as well read at least the first several pages of each section right away (through Section 5, so you'll understand the various shooting Modes).* In Windows 7, at least, you can download images simply by connecting a USB cable and the camera will appear as a drive on your computer.* The instructions for downloading Canon's software are embedded in the wi-fi sections, but they apply even if you're not using wi-fi.  After following instructions to connect the camera, the software might start automatically. I had to use the second fallback approach (which worked okay).  You may or may not find the download and organizing procedures intuitive, but once I sorted things out, it worked.  If you're connected by USB in Windows 7, you might want to remind yourself why put yourself through this when you can just copy the images over.  Answer: The limitations of simply dragging them are listed on p 175 of the manual.  One of them is to retain raw formatting. Another is so that verticals will retain their orientation. So I checked the folder where my images wound up, and VOILA, there they were.  With all of the verticals shown horizontally.  Sigh.* For the software, the manuals send you to an \"/icpd/\" folder at Canon's site. (Amazon won't let me include the actual address.)  You'll need your serial number. From that address, you'll have to navigate several levels to reach the S120 section, and then choose the link to downloads. I can only guess why Canon doesn't provide a shortcut, via, say, \"/s120/\" (which currently produces a \"page not found\"), or with a cryptic character or two if they must.But no, as with providing more accessible documentation for the camera, that would make it easy.So, learning how to use the S120 to the full extent of its capabilities, in a wide range of tasks and situations, is probably going to take longer than I hoped.  Nevertheless, I'm still hopeful that by this time next year, I'll look back at this review and wonder why it seemed such a big deal.Meanwhile, if a competitor in this category does all this stuff better, will you please let me and Canon know?", "Date": "December 17, 2013"}, {"Title": "Takes great pictures, but really is a drag on battery power", "Author": "ray \"discodancnqueen\"", "ReviewID": "R1NWSE634BUID9", "Overall": "3.0", "Content": "I think if I kept it in Auto mode all the time then the battery might last longer, but I shoot in Tv and Av a lot as well as movie mode. I'm open to suggestions.", "Date": "March 3, 2014"}, {"Title": "Do your homework before buying.....", "Author": "K. Hymel", "ReviewID": "R3BFP24BN7UBKI", "Overall": "3.0", "Content": "Takes nice, bright & sharp pics, don't get me wrong........ but the constantmenu-navigating gets tiresome.  If i had known then what i know now, iwould have shopped for something more friendly.  Something perhapswith a viewfinder and a more-easy-to-use Menu.  Think twice here.  Readreviews.  OH, and the WiFi has been really impossible to connect to mypush-button WPS router.", "Date": "January 17, 2014"}, {"Title": "Just Received S120,, Orange Focus Beam is Painful!", "Author": "Timothy Pender \"Tim\"", "ReviewID": "R1CZ4QWI81PVKR", "Overall": "1.0", "Content": "I just received the S120 which was a gift for my wife.I am still feeling my way around but there seems to be a lot of options on this camera however I hope to be able to do 99% of my shooting in AUTO mode. Primary use will be pictures of grandkid and general \"quick shots\".Recycle speed without a flash seems very fast and well as power \"on\" to first picture. Picture quality seems good and touch focus is nice.Biggest problem I am having is the very bright blinding orange \"spotlight\" that shines in a subjects face before the picture is taken. I assume this is the autofocus beam.  My wife has complained that this beam is very painful and leaves a spot before her eyes. If there is not a way to disable this, it is a show stopper. I have explored the menu items and thought I had it off but it is still there.Update.. 2/13/2014This camera will be going back. Went to record a video of the neighbor using his backhoe to clean my drive way and 10\" into the video the battery indicator turned Red and about 30\" in the camera shut off. Battery was at 75% when I started. This is a defect that Canon needs to fix.Tim", "Date": "February 8, 2014"}, {"Title": "Picture lighting uneven", "Author": "Vernon L Jenkins", "ReviewID": "R19LZB963BKNYK", "Overall": "2.0", "Content": "I heard good things about this camera.  Used it twice.  I basically wanted a point and shoot.  The photos were over lit, and grainy.  Same with the video function.  Very grainy textured picture.  I believe I over paid for this camera", "Date": "January 3, 2014"}, {"Title": "It's Ok", "Author": "Jim3579", "ReviewID": "RTG4RB76NMU2", "Overall": "2.0", "Content": "It's an ok camera.  Takes decent pictures but could just use my Iphone.  Same quality and always on me.  I thought it would be handy to use with the ap and remote.  Turns out this camera does not support the remote that the ap has to offer.  For the money I wouldn't suggest this camera.  The book that comes with it doesn't really tell you much refers you to an electronic book that you can find at the Canon web site.  Doesn't take multiple shots even though it's supposedly set to do so.  Very disappointed in the abilities of this camera and the lack of information supplied with it.  I was hoping for something smaller that I could carry more easily than my T4i", "Date": "April 21, 2014"}, {"Title": "did not like photo quality", "Author": "ELSA \"ES\"", "ReviewID": "RDQE5GGR39IEU", "Overall": "1.0", "Content": "Did not like the photo quality. I am not a professional though. But, on automatic setting, I did not like various option I have triedI could not get wireless to use.The build quality and portability is really quite within comfort limit. The coloring of the photo was ok but the zoom was not flexible.I found readying the canon website reviews for each model quite informative and eye opening before you do any purchase. This model is pretty new and the reviews are limited in number.", "Date": "December 18, 2013"}, {"Title": "BOX NOT SEALED, WARRANTY IS VOID!", "Author": "Coach James", "ReviewID": "R21DIUH531R9JO", "Overall": "1.0", "Content": "This camera is great, takes photos with good IQ!Review is for amazon.com purchase! Bought this camera and paid to have it delivered the next day.Problems:1) NO SEAL ( WARRANTY IS VOID, per Andres an Amazon chat rep). So if you want your warranty better think twice about getting it from AMAZON unless you have the time to return and for them to ship to a newer sealed box of it. Read the other couple reviews, this is not the first time they shipped unsealed box of this item.2) No 16BG FREE MEMORY CARD (the reason why I purchased it from amazon, limited time only).3) Paid to get it next day, amazon rep can send free 16GB memory card for free 2 day shipping. What a joke!", "Date": "December 15, 2013"}, {"Title": "Don't deal with Cannon", "Author": "DAO", "ReviewID": "R2S793TS8BA0PT", "Overall": "1.0", "Content": "Camera not bad.  HOWEVER, if you try to get the full PDF manual for this, don't attempt it.  When you go to the Cannon site, it downloads a zip file that will then load additional programs on your computer that you did not request.  I spent an hour clenaing my computer up from this programs.Then I called Tech Support to get just the PDF manual.  They now wanted access to my computer via LogMeIn. This I refused to allow.  Then I was told to contact Cannon Tech Support, who I thought I was already dealing with, but no the number for Cannon Tech support was a subcontractor.  Then told it would cost me $80 an hour for this.Then told to dial another number 800-828-4040, after holding for an hour, I gave up.I guess I'll either have to return this gift due to the simple fact that I cannot get a manual for it!!!!Q!Stay away from this company", "Date": "December 26, 2013"}], "ProductInfo": {"Price": "$449.00", "Features": "Built-in Wi-Fi technology allows you to wirelessly transfer your images to social networking sites through CANON iMAGE GATEWAY\nUpload virtually anywhere on your iOS or Android device with free download of the Canon Camera Window app\nCapture beautiful 1080p full HD video in stereo sound with a dedicated movie button, zoom while shooting and play back videos on an HDTV via the HDMI output\n12.1 megapixel high-sensitivity 1/1.7-inch CMOS sensor combined with the Canon DIGIC 6 image processor for exceptional low-light performance with an ISO range of 80-12800\nBright f/1.8 lens with 5x optical zoom and 24mm wide angle view", "Name": "Canon PowerShot S120 12.1 MP CMOS Digital Camera with 5x Optical Zoom and 1080p Full-HD Video", "ImgURL": "http://ecx.images-amazon.com/images/I/51kSP-miS0L._SY300_.jpg", "ProductID": "B00EFILNV8"}}