{"Reviews": [{"Title": "Wonderful Gift!!", "Author": "DENIS JOHNSTONBAUGH", "ReviewID": "R1DGZA31AWZPHM", "Overall": "5.0", "Content": "I got this camera as a gift for my wife to replace her old Canon; let me tell you see is very very happy!!  My wife is a food blogger and takes a lot of pictures of food and she would have to spend hours 'touching up' pictures before she would post them.  Right out of the box she was taking and posting untouched photo's!!  The bonus was receiving all the other items that made this a wonderful \"gift package\"!  Nothing better in life than a happy woman!!!  THANKS!!!", "Date": "January 3, 2014"}, {"Title": "AWESOME Camera and AWESOME Bundle", "Author": "Carmen Castro \"C.C.\"", "ReviewID": "RUQ6UNDLUY8KI", "Overall": "5.0", "Content": "AWESOME PRODUCT! This seller offered a brand new product for a lower price and more accessories than any other I've seen. The lens aren't the best lens out there, but they work for starters and the camera is awesome! Definitely recommend it!", "Date": "November 4, 2013"}, {"Title": "Quality Package", "Author": "Camila Carvalho Arruda", "ReviewID": "R25YUYYESDAEZL", "Overall": "5.0", "Content": "It is a quality package. Consists of all camera parts and good quality too. Only it took to deliver, but worth it. I recommend. ThanksDavisMax", "Date": "December 17, 2013"}, {"Title": "Lens", "Author": "Hollice", "ReviewID": "RA3B4B8HIIGT3", "Overall": "4.0", "Content": "The overall bundle was great, the camera is the beautiful. Just a little thing though, the macro lens that goes on another lens, does not fit on top of the 50mm, which is slightly annoying. The two extra batteries was a surprise (for some reason I thought it was including the battery that came with the camera).", "Date": "January 13, 2014"}, {"Title": "Canon EOS 70D Bundle", "Author": "Infiltrator7", "ReviewID": "R2JUGFE4DNBN9T", "Overall": "5.0", "Content": "What can I say? This bundle has everything an amateur photographer needs. Very complete and reliable, superb quality items. You will feel confident of this purchase! It's just quality at an awesome price! BUY IT!", "Date": "March 13, 2014"}, {"Title": "LOVE THIS CAMERA", "Author": "ashley", "ReviewID": "R27KC6IUWJQOWR", "Overall": "5.0", "Content": "I've never had a nice camera before and decided to get one since we travel and move around a lot. (my husband is active duty air force) It's pretty easy to figure it out and takes AMAZING pictures. The lenses aren't the best but they work for a beginner!", "Date": "February 25, 2014"}, {"Title": "Great camera, great value", "Author": "gforce", "ReviewID": "RQHSJPM4JPS9I", "Overall": "5.0", "Content": "I am very pleased with this camera.  The wi-fi feature is very useful to get those photos on social media quickly. Takes great photos.", "Date": "February 21, 2014"}, {"Title": "Canon 70D", "Author": "S. palmer", "ReviewID": "R3O6EL4AYAAHH8", "Overall": "3.0", "Content": "I love the camera but the lenses are not the best.  If know anything about cameras and lenses look for a good deal on the body and buy the lenses separate.  I still haven't priced every thing out but I believe I may have bought this package cheaper piece by piece but this being my first camera purchase this sounded like a good deal. You do get a lot in the package but other then the body nothing is above low to mid range equipment.", "Date": "April 7, 2014"}, {"Title": "pretty good package", "Author": "Richard A. Gotner \"Rick\"", "ReviewID": "R28X4HA4VP3UOL", "Overall": "5.0", "Content": "I love the camera, and the lenses included.  The tripod is nice, but the plate that mounts to my camera busted on the first use.  Lots of other doodads included.  Arrived quickly and wee packaged.", "Date": "April 5, 2014"}, {"Title": "Camera, lenses, filters are good, but cheap stuff sucks.", "Author": "Sebastian Solter Marin \"Sebastian Sölter\"", "ReviewID": "REBOOY3PYLYZ7", "Overall": "4.0", "Content": "Cámera it's perfect, lens are excellent, the flash included sucks, the bag it's terrible, but those are 2 things that you maybe have to buy after anyway. You will miss the 18-55 lens and i had to buy it for $180 USD anyway (perfect to record videos and more options in your shots). I'd buy too the grip for this camera at $70 usd and i love it!", "Date": "March 29, 2014"}, {"Title": "Canon 70D camera", "Author": "allen smith", "ReviewID": "R3JKI6TPWQK8GU", "Overall": "5.0", "Content": "Everything arrived as advertsed. Camera is awesome, I will need to take class to use to its potential. All accessories arrived at same time, no problems with ordering, very easy way to shop even for an older person", "Date": "March 18, 2014"}, {"Title": "Amazing!", "Author": "Kalie", "ReviewID": "R1YY4JPIJVEC0P", "Overall": "5.0", "Content": "I've always loved Canons and recentlyy husband bought me this camera. I absolutely love it! Couldn't be happier with the camera itself. The bundle however is a little bit of a botched deal, need certain attachments to fit some of the lenses and such.", "Date": "February 17, 2014"}, {"Title": "Incredible kit for the price", "Author": "Lisa A Pattan", "ReviewID": "R1PES6QW5M0URH", "Overall": "5.0", "Content": "I am still going to classes to figure out how to use it all, but am very impressed by the price and amount of stuff that I got with it.  It pretty much made me a shopping Goddess at work now, they all have me looking for deals!  ha ha", "Date": "February 17, 2014"}, {"Title": "An excellent starter package", "Author": "jpdylon", "ReviewID": "R3QZ13MUUMEKQB", "Overall": "5.0", "Content": "The 70d is definitely a camera worth spending the bucks on, and the davis max package makes it even more worth while. The plethora of accessories that comes with the package including various lenses, filters, tripod, flashes, chargers, and more. The two lenses included are good for beginners. About the only thing I would have liked better is if I had a choice of a wide angle lens with the package instead of all the small lenses and filters.Shipping was prompt and customer service excellent. Definitely recommended as a good package to start off a DSLR hobby with.", "Date": "February 10, 2014"}, {"Title": "Excellent camera the rest not so great!", "Author": "Andrew Salanik", "ReviewID": "RPRAIII75XOUB", "Overall": "2.0", "Content": "Not hating but there are a few things that needs mentioning. Why did you send me 3 batteries and one of them do not fit the camera? Also, only the filters along with the macro wide lenses only match the 58mm telephoto lens. The regular 55mm has no filters nor am I able to attach the other two lens.  Other than that the camera is beautiful but for the price I expected a bit more than a telephoto lens start up kit.", "Date": "June 3, 2014"}, {"Title": "Great", "Author": "Strat Parrot", "ReviewID": "R1LUOZO8Y59786", "Overall": "5.0", "Content": "This is a great kit, I really like the lenses that came with the camera. The bag is a bit small for the items that come with it and the tripod is a little cheap but still a value add.", "Date": "May 16, 2014"}, {"Title": "Great Camera", "Author": "Rusty C.", "ReviewID": "R2IP2DVQNQ7MXU", "Overall": "5.0", "Content": "The camera is perfect! The two Canon lens are great. The extras, filters, lens extensions and such are a waste of packaging and I would have happier without them since now I have to make a place to store them until I throw them out. The extra batteries and charger are a welcomed addition. I wish I would have gotten the package with the telephoto/zoom lens rather than this package with the 50mm and 75-300 zoom. I'm still happy with the purchase.", "Date": "April 30, 2014"}, {"Title": "Best Bundle for the money", "Author": "Connie Brewer", "ReviewID": "R3BV2US99XG6Q", "Overall": "5.0", "Content": "I shopped around and found for the money I was going to spend, this bundle was the best going. Plus I only had to wait a few days for it to arrive. I plan on buying more camera supplies from them and will recommend DavisMax web site to everyone.", "Date": "April 28, 2014"}, {"Title": "lots of stuff in this bundle", "Author": "Drokpa", "ReviewID": "R24UCIP4T1R4I6", "Overall": "4.0", "Content": "When you see the ad listing all that stuff, it seems like such a good deal! And it is, really. But I don't need all that stuff, and the flash, the tripod and etc are not the best quality. I'm glad I chose the 50 mm prime lens and the long lens rather than getting the standard 18-135 mm kit lens that most of the kits come with, because it is easy to find a cheap used 18-135mm lens. That lens is really handy, but the 50 mm lens  and 75-300 lens is a better value. I was disappointed to realize that each of these lenses take different size filters. The \"macro\" and \"wide angle\" filters that come with this kit only fit the long lens. And the extra battery only works with the replacement charger - not with the Canon OEM charger.All in all, its a great deal, but not 'too good to be true'.", "Date": "April 23, 2014"}, {"Title": "LENS/FILTERS", "Author": "Beltecezar G.", "ReviewID": "R94W5FWBXN2R", "Overall": "2.0", "Content": "Camera is great but the filters and the Vivitar lenses in the bundle DOES NOT fit!  Why bundle it together if they don't fit together?!?!?!?!", "Date": "April 20, 2014"}, {"Title": "Such a great deal.", "Author": "larissac", "ReviewID": "RCHK9OJXRR6TD", "Overall": "5.0", "Content": "I ordered this package because it is such a great when you compare the price of just camera bodies or camera bodies and lenses. This package comes with plenty of stuff to make this a great deal, but I think the camera body and lenses alone are worth it. My one complaint is that the macro and wide angle lenses aren't actually lenses. They are add-ons that you would screw onto your existing lens. HOWEVER, these lenses don't fit on the 50mm. It's kind of pointless to have a macro lens on the telephoto lens, but it does fit. The macro and wide angle lens each had a piece of paper with them that said that to find compatible parts, contact the company. I e-mailed the company and they were incredibly rude about it and as of yet I still have not found adapters or anything to make the macro and wide angle lens work with my beloved 50mm.Additionally, the camera bag isn't very nice. I already own a very nice camera bag and so the one that comes with this set will just be for the random stuff I need to store at home. I will probably never take it out of the house. The tripod isn't the best quality, either, but I already had a really nice tripod, too, so I wasn't too upset about that.Even though there were some bummers about this kit, I'm so completely happy with it. The 70D is amazing and takes excellent quality pictures. I upgraded from a T3i to the 70D and have not looked back. The 70D has wifi and a (huge!) touch screen. This is such a great deal and I am so happy with my purchase.", "Date": "March 6, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Canon EOS 70D 20.2 MP dual pixel CMOS digital SLR camera body\nCanon EF 75-300mm f/4-5.6 III telephoto zoom lens\nCanon EF 50mm f/1.8 II SLR lens brand new\nTwo LP-E8 rechargeable lithium ion replacement battery + external rapid quick-charger and car charger", "Name": "Canon EOS 70D 20.2 MP Dual Pixel CMOS Digital SLR Camera + EF 75-300mm f/4-5.6 III Telephoto Zoom Lens + Canon EF 50mm f/1.8 II SLR Lens + Two LP-E6 Replacement Lithium Ion Battery + External Rapid Charger + 32GB SDHC Class 10 Memory Card + 58mm Wide Angle Lens + 58mm 2x Telephoto Lens + 58mm 3 Piece Filter Kit + 58mm Macro Close Up Kit + Mini HDMI Cable + Carrying Case + Full Size Tripod + Multi Card USB Reader + Memory Card Wallet + Deluxe Starter Kit DavisMAX Bundle", "ImgURL": "http://ecx.images-amazon.com/images/I/512yvg5HMuL._SY300_.jpg", "ProductID": "B00EPOJDNM"}}