{"Reviews": [{"Title": "great packege deal!", "Author": "steven spencer", "ReviewID": "R3CANJNLECEFJV", "Overall": "5.0", "Content": "I bought this package for my wife for Christmas and she loves it. It came with everything you should ever need to take some nice pictures plus some.", "Date": "January 19, 2014"}, {"Title": "Very Pleased! :-)", "Author": "Sherrie Kibler", "ReviewID": "R1OHHCQ3Z0KQ3R", "Overall": "5.0", "Content": "This was to be my 16 year old sons' BIG gift for Christmas as he has been asking for the last two years.  I could not have been happier then I was when I received the box filled with all the goodies and conscientiously packed very well to keep it all safe thru the delivery process --- shipping was also pretty quick -- I have to say I am VERY pleased and would highly recommend buying from them.  I am so glad I researched and did my homework by coming across this bundle....and not only am I super pleased but my son is escatic and has been taking pictures ever since opening his gift(s).  also a great time for him as well since he is signed up for Photography Class soon:)) Woot!  Thank You Very Much -- I will be sure to recommend you should any one I know is looking for a great camera bundle:))  Btw, this camera takes beautiful and I mean beautiful pictures!  :-)", "Date": "January 2, 2014"}, {"Title": "Very Happy", "Author": "Barry W. Sanderlin", "ReviewID": "R2HU2OB5GNI76O", "Overall": "5.0", "Content": "My wife wanted a camera so that she could begin learning photography. This turned out to be a perfect match. And Camet Camera gave us fast, friendly service.", "Date": "December 27, 2013"}], "ProductInfo": {"Price": "$614.95", "Features": "KIT INCLUDES 15 PRODUCTS -- All BRAND NEW Items with all Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Canon EOS Rebel T3 Digital SLR Camera Body & EF-S 18-55mm IS II Lens + <2> Canon EF 75-300mm III Lens + <3> Transcend 64GB SDXC 10 Card +\n<4> Spare LP-E10 Battery for Canon + <5> Battery Charger for LP-E10 + <6> Precision Design DSLR300 Flash + <7> Precision Design 58\" Tripod +\n<8> PD Digital SLR Camera Case + <9> PD 2.5x Tele & .45x Wide Lens + <10> PD 58mm (UV/CPL/ND8) Filters + <11> 58mm UV Filter +\n<12> PD SDHC Memory Card Reader + <13> PD 6pc Complete Cleaning Kit + <14> PD 8 SD Card Memory Card Case + <15> LCD Screen Protectors", "Name": "Canon EOS Rebel T3 Digital SLR Camera & 18-55mm IS Lens with 75-300mm Lens + 64GB Card + Battery + Charger + Case + Filters + Tripod + Flash + Tele/Wide Lens Kit", "ImgURL": "http://ecx.images-amazon.com/images/I/61iY8y0W9-L._SY300_.jpg", "ProductID": "B00F2M5HRC"}}