{"Reviews": [{"Title": "base is solid, cover tends to fall off", "Author": "Jan M. Kossowski", "ReviewID": "R2H27RIL5E3PR1", "Overall": "2.0", "Content": "I bought this case for newly purchased Nikon Coolpix P520. The brown artificial leather looks good, has a nice feel, very well done stitching.The base attaches to camera with a knob that is slightly misaligned, which requires considerable force to tighten/loosen the knob. Which means you will have to fight it every time you want to remove SD card, or charge the camera, as the base of this case covers the gate on the camera behind which you will find SD card slot and USB charger connector. On the bright side, the base is very sturdy and will protect the camera well if dropped.The lens and top cover attached to the base with three large snap connectors. It is quite rigid, and makes this small camera rather bulky looking. When you open it up for picture taking, it hangs down below the lens on single snap connector obstructing camera's view so that you will want to detach it entirely, meaning you are prone to misplace/loose the cover. If you try bending it down without detaching so that you can take your shot without cover obstructing your view, it will likely snap off anyway as the connector does not hold well.Overall I wish I have not made this purchase.", "Date": "December 27, 2013"}, {"Title": "Very Nice Case.", "Author": "M. C. Bowers \"History Reader\"", "ReviewID": "R22I76M8W1ZLRM", "Overall": "5.0", "Content": "Very good quality, very low price.  Nice.Fits well enough. Body cover fits very well.  Of course, the body cover needs to be removed for access to USB, battery, memory.  Lens cover a bit bulky, but extra size could help cushion a drop.If you want a leather case, this is a good one to choose.  (The case did not come with the box shown in the picture, but was well wrapped and protected for shipment.)", "Date": "December 9, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "Excellent design specially for Nikon COOLPIX P520 18.1 MP Digital Camera with 42x Zoom\nFor Nikon COOLPIX P520 18.1 MP Digital Camera\nMade by excellent leather! Durable! Soft and Smooth-feeling!\n1 leather case + 1 shoulder strap\nBRAND NEW CAMERA CASE,FAST SERVICE , %100 SATISFACTION", "Name": "TechCare Tm \"Ever Ready\" Protective Black Leather Camera Case, Bag for Nikon Coolpix P520 18.1 Mp Digital Camera (DARK BROWN)", "ImgURL": "http://ecx.images-amazon.com/images/I/413nAQ9TMWL._SX300_.jpg", "ProductID": "B00F7R6JHE"}}