{"Reviews": [{"Title": "Good Midway Camera", "Author": "trickflame", "ReviewID": "R26KYNHVXMBOP6", "Overall": "5.0", "Content": "A good camera to get if you're looking for something not quite as expensive as a DSLR, but want more quality than you'll get from a $50 point and shoot camera. The casing is metal, as opposed to plastic like other cameras in it's price range, which makes it both look nicer and I'm guessing makes it sturdier as well, though I haven't beaten it up enough to know for sure.One really useful feature is the Smart auto mode, which chooses filters and setting to best fit the picture you're trying to take. While it's doing that it also tells you what it's using, and I feel like that helped me to learn more about what settings to use for the different types of pictures I've been taking. The zoom on the camera is impressive, and I don't notice too much difference in quality, though if you plan to take it all the way to 26x you'll probably need either a tripod or the hands of a surgeon.As a warning, this camera takes 4 aa batteries, which I actually like, as I like taking nature photos and can just keep a small supply of batteries handy and take pictures indefinitely, but It's probably a good idea to buy a battery charger and rechargable batteries.The camera comes with a lens cap and lens cap strap, a shoulder strap, instruction manual, and 4 aa batteries, it does not however have an SD card included, so if you plan on getting this as a gift for someone, make sure to pick up one for cheap. I recommend the Sandisk Extreme SD cards. They can be a bit more expensive, but they have a fast data transfer rate, and that will help you make sure you get just the right moment. If you're using for portraits or other things where you can reliably have the subject in place for awhile, you'll be fine with a less speedy SD card.Lastly, if this camera is a bit too pricey, I recommend looking at the WB100, the two cameras are nearly identical, except the WB100 is only 16 MP. I hope this review was helpful.", "Date": "December 12, 2013"}, {"Title": "Day 1- so far, so good", "Author": "Vaderson III", "ReviewID": "R14MVOSZ459PDK", "Overall": "3.0", "Content": "I just purchased this camera and I am impressed so far but to be fair, I'm coming from using an iPhone for most/all of my picture taking needs.I was pretty let down to notice there was no real user's manual to instruct me on all the different features and how to use them. So I'm sure there's things I haven't even gotten into- simply for the lack of know-how.The battery compartment was a little tricky (which I noticed in another review here but hope that person returns as I think I know the trick after struggling with it awhile- and it's an easy \"fix\"). There's a little trigger there that implies you just switch it up and the thing should open. But you need to push it up then push out the flap then it flips open.. Should be easy from now on.I like that as you switch the settings knob at the top there is a brief explanation of what the setting changes as far as the picture is concerned. But it's literally on the screen for a second then disappears. I had to go back a few time shuts to be able to read and comprehend the one sentence that was there. But I guess if it was there lover it would get annoying after you have it memorized.There were no instructions on how to connect the lens cap lanyard either. Which may be common sense for some but as a beginner I was disappointed to not find even te slightest instruction on that. I was under the impression it should attach to the lens cap as well as the camera itself- so it could dangle there out of the way while in use- all the whole staying attached to the camera so you don't misplace it. But from what I was able to do to it- it attaches to the cap itself then just has a medium-length loop that hangs free from the camera (so maybe you could loop it on your finger while you're shooting- probably not quite long enough to wear on my wrist). I'll be keeping in te camera bag so as not to lose it.Luckily I asked beforehand if it came with an SD card. It does not. So you will need to purchase one when you purchase the camera. I did that but as I was taking my first shots and exploring the camera I noticed that it wasn't saving to the SD card that I had properly installed. So I'm not sure if there is a setting I need to change (no User's guide so good luck to me on figuring that out for myself- which I have not been able to do after 15mins of trying). Perhaps once the camera's minimal storage is filled it will switch over to the SD?? I honestly have no idea!The quality of the taken images is really nice. Took some figuring out with the flash and all and how to have that set but once it is- the pictures are phenomenal! I had it on the \"children\" option in the Scene setting (another very nice feature that allows you to pre-choose what type of picture you are trying to capture) but I guess te \"children\" setting leave out the flash?--because I couldn't get the flash operating while in that scene. The little red one went off but when I opened the \"normal\" (again, I'm not a professional photog so excuse my minimal knowledge of proper terms) flash- it just wouldn't go off and when I went into flash settings while in thy scene- there wasn't an option to have it on- only off. It may be something I can figure out in time or of I ever get my hands on a User's Guide (I saw one commenter say the tech folks said they could buy one for $32... REALLY?? I already spent nearly $200 on the camera now I need to fork over another $32 to find out how to use it?!?! I have NEVER heard of ANYTHING not coming with a User's Guide.. Never mind having to BUY it separately! That takes a lot of nerve and someone will probably hear from me about it... )Like I said, it's only day one with this and I'll try to remember to come back later on to update my review of it. So far, it's a nice camera, takes quality photos when the settings are right, takes 4AA batteries, does not come with a User's Guide, is constructed of metal which I can only assume makes it more durable than a plastic one but that's just an assumption on my part, it's a little heavier than others but is more comfortable to hold, battery compartment is trickier than they make it look but it does work.. It's nice.. I just hope I can figure out all the features without a manual.", "Date": "March 1, 2014"}, {"Title": "Great Camera", "Author": "Lindsey Asher", "ReviewID": "R2YKQP2MUYRI05", "Overall": "5.0", "Content": "Personally, I love this camera! It has a nice big viewing screen, and a sleek beautiful design. This camera takes great photos and is easy to operate. I am in love with it. Lots of cool settings. You can edit your photos as soon as you take them right on your camera! Two thumbs up :)", "Date": "March 2, 2014"}, {"Title": "love it", "Author": "Ginger Dean", "ReviewID": "R2310JB024WPHU", "Overall": "5.0", "Content": "Great camera- easy to use- nice clear pictures- easy to use.and at a great price too. Got the package with the sd ,case too.You can't beat it.", "Date": "March 23, 2014"}, {"Title": "Great camera!", "Author": "T. Smith", "ReviewID": "R14FOAOMAEH12N", "Overall": "5.0", "Content": "It takes wonderful pictures.  The only thing to remember is that it is a bigger camera and a small flat one.  But the better pictures are so worth it.", "Date": "March 27, 2014"}, {"Title": "Loved it!", "Author": "Erin A. Laszlo", "ReviewID": "R13FW8QXFCTDIE", "Overall": "5.0", "Content": "Fantastic picture,  great value!  My only complaint complaint is I didn't realized it would be AA batteries instead of lithium ion.", "Date": "April 29, 2014"}, {"Title": "users manual", "Author": "Steve Stiller", "ReviewID": "R2O1IE33UGPJKU", "Overall": "3.0", "Content": "This camera is loaded with features but unfortunately they are not intuitive and Samsung does not provide a users guide. I was told by tech rep that I can buy one for 32 bucks. No thanks.", "Date": "February 25, 2014"}, {"Title": "Camera ok", "Author": "Janet White", "ReviewID": "RF88TDNKHNBW", "Overall": "4.0", "Content": "The pictures are great.  I worry about the quality of the camera houseing.  I wouldn't want to drop it by accident or bump it to hard on something for fear of cracking it.", "Date": "February 2, 2014"}, {"Title": "Bad instructions and no release to open door on batteries so cannot use.", "Author": "Ellen Reed", "ReviewID": "R2Y24T78ZKYWQB", "Overall": "1.0", "Content": "Put batteries in and cannot open the door again to check batteries. Also, could not go in to set up camera because I hit the wrong button.", "Date": "December 11, 2013"}], "ProductInfo": {"Price": "$205.09", "Features": "20.2MP 1/2.3\" CCD Sensor\n22.3-579.8mm f/3.1-5.9 Optical Zoom Lens\nDual Optical and Digital Stabilization\n3.0\" 460K-dot LCD Display\nHD 1280 x 720p Video Recording\nSmart Auto and Live Panorama Modes\nIn-Camera Photo Editing\nSmart Filter and Split Shot\ni-Launcher Software Included\nOperates on 4 AA Batteries", "Name": "Samsung WB110 20.2 Digital Camera with 26.0x Optical Image Stabilized Zoom with 3.0-Inch TFT LCD Screen (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Jra7KP30L._SY300_.jpg", "ProductID": "B00F8NHHAK"}}