{"Reviews": [{"Title": "So happy about my camera!", "Author": "Jannie Annie", "ReviewID": "R2K4Q0TM5EBT0I", "Overall": "5.0", "Content": "I read up on this camera on tech site and the reviews were good. I searched the internet, even searched on ebay before coming back to the more trustworthy Amazon. At the time of my purchase the Nikon Coolpix L820 black camera was $219 and in red it was $258. I wasn't willing to pay almost $40 more for a color, so I searched more for about a week. Then I found this refurbished one in plum (the description stated that it is refurbished by the manufacturer, Nikon) so what could be better than that?  I read the lone review stating how their camera was \"just like new.\" I took and chance and to my delight, my camera came looking and working just like new! No scratches, dents or flaws. The only difference I can see is that it has a generic box but it is filled with all of the cables, wires, instruction booklet and even a pack of double AA batteries. I am also pleasantly pleased with the plum color (that I wasn't so sure about, but took a chance because the savings was soo good). Anyway, I couldn't be happier and I liked saving of almost $100 bucks! Oh, and it came with a 90 day warranty! The company was Beach Camera.", "Date": "February 4, 2014"}, {"Title": "Excellent camera for the money", "Author": "David in Lex \"David\"", "ReviewID": "RQ0878TF4NVUL", "Overall": "5.0", "Content": "The Nikon long lens is really amazing. The camera seems to have a huge depth of field on long-lens closeups. I think this is because it has high-quality optics in combination with the high quality CMOS low-light sensor. What this means is that the camera can take long-lens closeups while still retaining a relatively small lens opening. If you take, say a closeup of a bird in a tree using the long lens, the bird will be in focus, but also the background that is at a different distance from the camera than the bird.  My experience with SLR cameras employing long lenses is that you could get the subject in focus but the background at a different distance ends up fuzzy. This is a fun camera to experiment with, and in particular to see how good quality point-and-shoot cameras have come relative to the much more bulky and expensive DSLRs. There may be places where a bulky DSLR has an advantage, in particular, in making very large paper prints, but 99 % of photography nowadays is not printed out in 16\" x 20\" paper. I think it would be fun to take the exact same long-lens photo using this camera and a $500+ DSLR setup, print it out maybe at 11\" x 17\" and see exactly what the differences are!.", "Date": "March 5, 2014"}, {"Title": "YAY!", "Author": "I_bought_it", "ReviewID": "RLW93KGX1HSQY", "Overall": "5.0", "Content": "so I got this and started using it right away. its so nice and worth the price. I was irritated with the fact that with the flash not being on all the pics were blurry so I had to change the ISO to 3600 but after that -it w-orked very- nicely.", "Date": "March 3, 2014"}, {"Title": "love my camera", "Author": "Michelle Adams", "ReviewID": "R3ENO1QAH8ZKTX", "Overall": "5.0", "Content": "I always choose nikon. its a great camera thank you so much awesome awesome awesome its works wonderful great pictures", "Date": "April 2, 2014"}, {"Title": "I’m off to Yosemite!", "Author": "John Bell", "ReviewID": "RHMMO8QVG7X4X", "Overall": "5.0", "Content": "A digital that feels like a camera!  And acts like one. And has the looks.  Ansel would have approved.  jbs", "Date": "March 9, 2014"}, {"Title": "great camera", "Author": "Cheryl A. Jarrett", "ReviewID": "RVNR3Y74OH0NQ", "Overall": "5.0", "Content": "great camera.......wasn't sure it would being unknowingly,  \"refurbished\" when I purchased it.  All in all it turned out ok because it had a 2 year warranty.  Happy with it so far, working great!", "Date": "April 26, 2014"}, {"Title": "Awesome!", "Author": "William A. Hulett", "ReviewID": "R23SQMMNY6ZKYK", "Overall": "5.0", "Content": "Love the camera. I had a friend who has the exact camera so having used it before i knew it was what i wanted. Love it!", "Date": "April 15, 2014"}, {"Title": "great camera for the price!!!", "Author": "M. Romero \"MerrC\"", "ReviewID": "R1LLEJS5UHOSO1", "Overall": "5.0", "Content": "I am still testing it, if you want to practice before jumping to another more pro, this is the camera to start", "Date": "March 18, 2014"}, {"Title": "nice camera, ok picture quality", "Author": "J. T. Glembocki", "ReviewID": "R9GN6H1AINR6R", "Overall": "2.0", "Content": "I tested it head to head against my 7yr old Olympus super-zoom, and my older camera had better picture quality.", "Date": "March 17, 2014"}, {"Title": "Camera Is best for price", "Author": "Jonathan Lane", "ReviewID": "R1TI4FO2GHI0ZT", "Overall": "5.0", "Content": "The camera is really good in image/video quality, but the only downside is that the camera feels cheap. But I don't really care about that, I would Definitely recommend this to a friend.", "Date": "March 13, 2014"}, {"Title": "Good camera but heavy", "Author": "SUSAN LIENESCH \"akamaisue\"", "ReviewID": "R2SZS90GDTHTNJ", "Overall": "3.0", "Content": "I wanted to use this for a purse camera, but, with the 4 AA batts in it, it's really too heavy. Takes great pictures, and is probably the coolest looking camera I've ever owned, but I find myself avoiding using it.", "Date": "March 12, 2014"}, {"Title": "Great pictures", "Author": "Central Washington \"Wash\"", "ReviewID": "R2H2C44FGHRNT8", "Overall": "4.0", "Content": "This camera seems really good. My neighbor has the same one and also loves hers. I would have given it 5 stars if it had an internal rechargeable battery. It is easy to use and pretty shutter speed. It is the best camera I have seen for the price.", "Date": "February 23, 2014"}, {"Title": "Great Camera for the Price", "Author": "C. G. Miles \"SanJoseKappa\"", "ReviewID": "R2M2QXQB1KU4SM", "Overall": "4.0", "Content": "This camera has a good set of features for an inexpensive point and shoot camera. The user guide that came with the camera was not comprehensive enough to for me to take full advantage of the the nice features of the device.  Otherwise, I may have rate the Camera 5 stars.", "Date": "January 1, 2014"}, {"Title": "the battery compartment is a bad joke", "Author": "Chatos", "ReviewID": "R7FIEKJ30DS2W", "Overall": "1.0", "Content": "a camera that does not work because out of battery power is totally and utterly useless is she not ?I have been buying on Amazon for years and this is my first bad review ever !!the problem with this camera is a flimsy very cheaply made battery compartment - instead of a fix rechargeable unite - you have to buy your own batteries and as the rechargeable ones are a tiny but larger they do not fit into the battery compartment well - with the result that it opens up and batteries fall out or its hard to close - this is an amazingly bad part of this camera - SHAME on you NIKON  - go to bed now and no dinner !!!  :-)  no seriously avoid this camera for one with fix build in power unite", "Date": "March 8, 2014"}, {"Title": "some problems with description", "Author": "R. Debertin \"Dr book fan\"", "ReviewID": "R15UC7RUWEKBVT", "Overall": "3.0", "Content": "Received as a gift description said new with one year warranty.  Came and was refurbished and no one year warranty just the 90 day Nikon warranty.  Mine was sold by Beach camera.", "Date": "February 19, 2014"}, {"Title": "This is a very nice fully-automatic compact camera", "Author": "Karin Conover-Lewis \"klclewis3\"", "ReviewID": "R21GBMD0SDR2GC", "Overall": "4.0", "Content": "This is a very nice fully-automatic compact camera. It comes loaded with exposure presets for virtually any situation, it is packed with features and takes very, very nice pictures at very high resolution. It allows for easy exposure compensation, but it does not allow for ANY manual setting of aperture or shutter speed. Programs include a \"Museum\" setting, which will not allow the flash to operate -- very useful in many situations other than museums, in which the accidental firing of a flash could be annoying. All in all, I've been extremely pleased with the shots I'm getting with this camera, and until I can afford a pro DSLR it will suffice nicely.", "Date": "April 20, 2014"}, {"Title": "Disapointed", "Author": "Mase", "ReviewID": "R3977ZPBJHXYJP", "Overall": "1.0", "Content": "Beach Cameras.....honestly l was realy disapointed. I ordered a new camera they decided to send me  an old one refurbished. I returned the camera and they dont even care about the guest cost..l have to do that with my cost again. Im sorry l dont see a reason of doing a business with Beach Cameras anymore. Not even to apologies for sending a wrong description order. Its fine though..l will say do business with them, be ready for disapointment.", "Date": "June 5, 2014"}, {"Title": "Nikon cool pix easy to use", "Author": "roishene johnson", "ReviewID": "R31K17A6TK7AC5", "Overall": "5.0", "Content": "Best choice for a Dance Mom and mother of an active 12 yr old who likes to perform all year.", "Date": "May 21, 2014"}, {"Title": "It's great!", "Author": "MaineJoy", "ReviewID": "R100WOF7R3DOLB", "Overall": "4.0", "Content": "The camera itself is everything I expected.  My one concern was as stated above I ordered it with a full 1 year warranty butwhen the camera arrived it said it only had a 3 month warranty. ??????  THAT WASN'T GOOD!  Was going to write and ask about that before I gave it a good review, but the camera itself to this point seems to be working as far as my limited knowledge understands.  What happens in 4 months if I find something is wrong?", "Date": "March 10, 2014"}, {"Title": "Very happy!", "Author": "Amazon Customer \"crazy cat lady\"", "ReviewID": "R2EVPGHBE5H4KO", "Overall": "5.0", "Content": "This was to replace an outdated Lumix TZ3 (2006) and I couldn't be happier! I'm a Nikon DSLR shooter already and this is a fantastic walk around camera! I take it with me everywhere. While it won't fit well in a purse, it's perfect for a backpack or small camera case like the small Case Logic Xbody. The crisp detail in the photos was a real surprise! Even at a full zoom the quality is comparable to the full out quality in my 70-300mm lens on the D90. The file size makes for an easily editable photo as well. Lots of data to work with and very little quality degradation in a fairly close crop. Of course, it won't stand up to DSLR standards on all fronts. You can't shoot in MASP but you do have some control over White Balance and ISO. It has Single and Continuous shooting modes as well as a timer but no remote functionality. Small price to pay for a nice little camera to use every day. I'm also impressed with the in-camera editing! Lot's of good tools to choose from in a P&S;! It also has a decent range of 'scene' modes to choose from and they function very well. All in all, I'm very happy with it!", "Date": "February 27, 2014"}, {"Title": "Digital Camera.", "Author": "Hamid Mahmood", "ReviewID": "R3C1W5BC77IBLH", "Overall": "1.0", "Content": "Battery is not re-chargable. Its Battery compartment gets a little difficult to close. Not a very good return for your money.", "Date": "May 22, 2014"}], "ProductInfo": {"Price": "$169.95", "Features": "KIT INCLUDES 1 PRODUCTS -- All Items Include Manufacturer-supplied Accessories + Full USA Warranties:\n<1> Nikon Coolpix L820 Digital Camera (Plum) - Factory Refurbished", "Name": "Nikon Coolpix L820 Digital Camera (Plum) includes Full 1 Year Warranty", "ImgURL": "http://ecx.images-amazon.com/images/I/51RhkmQvl%2BL._SY300_.jpg", "ProductID": "B00F2YZV0S"}}