{"Reviews": [{"Title": "Super Quality and Usability, but this should have been Incorporated into the Original X-M1 and X-A1 Bodies", "Author": "Ray \"A Reader\"", "ReviewID": "R3JKM2QHNFHHK3", "Overall": "5.0", "Content": "This is a high quality machine aluminum part that fits securely into the Fuji X-M1 and X-A1 cameras, and solves the issue of the thin hand grip that so many people have noted on these models. It's a very high quality build, including the screw that mounts the part into the camera body, and incorporates a rubberized gripping surface. It completely changes the feel and grip of the X-M1 and X-A1 cameras (the part works for both, since both cameras have the same body). It's far too expensive, particularly when one considers this shape could have been easily built directly into these camera models at no different cost than the current shape, but no company bats a 1000. There are so few things of note to complain about with these cameras, and so we can better accept this deficiency. Once this part is attached, the camera is much easier to hold, with a greatly increased protrusion to hold onto, and the grippy rubberized part to further help.The part is pretty lightweight, and anchors firmly when screwed into place. A fully metal tripod mount is machined into the bottom (and also brings the new tripod mount in line with the axis of the lens, rather than slightly offset as is the tripod mount in the camera body itself), but note that, when this grip is in place, both the battery cover and the card slot are completely covered, requiring removal of the grip to either change the battery or physically access the card. This is an original Fuji part, although made in China. If you have a Fuji X-M1 and/or an X-A1 camera, this mount may be of great interest to you, particularly if you are using the large 55-200mm lens that is long and heavy, making gripping the camera a bit more challenging when using this lens. Five stars (but I wish it were a bit less expensive).", "Date": "March 17, 2014"}, {"Title": "Excellent accessory priced too highly", "Author": "Amazon Customer", "ReviewID": "R1NYXAX7ZKUUOC", "Overall": "4.0", "Content": "This is an excellent accessory for the X-M1 which makes the camera much easier and natural to handle. However, it does cost far more than it should at $90. The way Fuji keeps dropping the price of its cameras, the hand grip now costs about 1/6th the price of the camera. That's not right.", "Date": "December 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F4F7TQE"}}