{"Reviews": [{"Title": "leica C Type 112", "Author": "Julius Glickstein", "ReviewID": "R1N8JQDESH66U2", "Overall": "4.0", "Content": "This camera is very similar to Canon S110 - size, ergonomics. Its is made in Japan, my guess is that Canon was involved. Only the top of the camera is dark red. The rest of the camera body is black.PlusIt has EVF - very big plus for meLonger zoomFastIt slightly thinner than Canon S110Control rings have much better feel that Canon has. My Canon has slightly lose central control ring around the lens.ConsCanon has better interfaceAdobe Lightroom came as the download from Leica website. I had some issues with this download/or websiteI didn't check video abilities and wi-fi.So far I like it.Forgot to mention that the supplied software doesn't work on XP and Vista. You need windows 7 & higher, Mac.And there is a Panasonic Lumix DMC-LF1 12 MP Digital Camera, which is a copy of Leica C or vise versa. I don't have Lumix so can't provide any opinions. However the similarity between Canon S110 Leica C and Lumix DMC-LF1 is obvious.Took several night photos yesterday 10/15/13. ISO 1600, F 4.5. AF very fast, Canon results are slightly better. I guess nobody is going to do proff. job with this camera. So for extra $250 you'll have Leica camera with red label instead of similar (and less expensive) Canon or Lumix in your pocket while traveling or whatever. Again don't forget that its Japan made with German lens and good EVF in comparison with Canon S110 which doesn't have EVF.10/28/2013So far couldn't make wi-fi working. Possibly I'm doing something wrong. However with my older Samsung connection to wi-fi was easy.  Yesterday checked panorama mode and other modes being in Manhattan. On Canon the camera start preparation of the file as soon as the pointer is at the end of the frame, same on Samsing. On Leica preparation of the file starts much earlier. However the image is crisp. All pervious Leica's I returned. I guess this is a keeper.", "Date": "October 15, 2013"}, {"Title": "What an amazing treat", "Author": "Coop", "ReviewID": "R30KFZ2P2MPF5R", "Overall": "5.0", "Content": "I had always wanted a Leica, but already had a Hasselblad and a nice Nikon DSLR, so I had just envied others.  However, when I saw the C 112 online I couldn't resist, as it filled a completely different niche.  It has far surpassed my expectations, as it has within its programs many functions that I was not even aware of when I ordered it.  Additionally, once you have run through the manual and gotten a handle on the multitude of menu options (which are actually quite easy to activate), it is a snap to use and produces absolutely Leica-quality pictures, at a tiny fraction of the cost of the full size Leicas.  I haven't yet downloaded the included Lightroom software because I first need to upgrade my Mac, but I expect similarly great results from that.  Incidentally, when I did try to download it and found it unopenable, I emailed Leica's support and they responded within hours from Germany, both advising me of what system requirements I would need and also crediting me back for the unsuccessful download (you're only allowed three total).  A fantastic camera.", "Date": "December 16, 2013"}, {"Title": "Stunning Little Performer!", "Author": "James Maier \"carbon111\"", "ReviewID": "R35QT7ZS2TI8RV", "Overall": "5.0", "Content": "As much as I love my big cameras, I can't really carry any of them with me 24/7...and that's where the little Panasonic LX5 used to come in. The main problem was that it was not exactly \"pocketable\" (even less so with the EVF attached) but more of a \"big coat pocket camera\". My venerable LX5 had seen a lot of use and was getting a bit long-in-the-tooth. I'd been looking for a replacement and had been looking carefully at the Panasonic LX7 and, when it was introduced a few months ago, the Panasonic LF1. At the time, the most striking thing about the LF1 was the reach it had for something that size - 28mm-200mm (full-frame equivalent)!When Leica announced their version of the LF1 recently for a reasonable $200 mark-up, it was a no-brainer as the body style was much nicer and I needed another copy of Lightroom 5 (which is normally about $150 by itself). Plus, I preferred a warranty through Leica rather than Panasonic as they've been so very helpful over the years with my M8, M9 and M lenses, often going that extra mile for me.I've been absolutely loving the C! In my opinion it is certainly a step up from the LX5 in terms of telephoto reach and photo quality. It's no M9 obviously but, turned off with its lens collapsed, it is exceedingly tiny and really can live in my pants pocket 24/7. Being able to tether it to a tablet or phone is also a welcome bit of utility.I love the macro capabilities, the decent low-light ability, the RAW file capability and the presence of a EVF on something this tiny. For what it's worth, the EVF won't win any prizes but it certainly does the job in bright light and that's all I need it for.This is a camera that you can always have with you and it's capable of stunning, high quality images, especially if you shoot in RAW format.", "Date": "January 14, 2014"}, {"Title": "Very compact, and beautiful camera", "Author": "DANIEL DE LA CRUZ", "ReviewID": "R1BMNJFL0VRIRL", "Overall": "5.0", "Content": "Very compact, and beautiful camera.  Takes quality pictures and is easy to use. Viewfinder and good telephoto lens a plus compared to other cameras.", "Date": "December 12, 2013"}, {"Title": "Leica C camera-perfect!", "Author": "Joe R.", "ReviewID": "R3TX800ZDZLNBR", "Overall": "5.0", "Content": "The Leica C is just what I was looking for, lightweight, compact, with plenty of manual options for those times when I want to be more creative.", "Date": "November 13, 2013"}], "ProductInfo": {"Price": "$699.00", "Features": "Leica DC Vario-Summicron f/2-5.9 (at maximum wideangle and telephoto settings)/ 6-42.8 mm ASPH. (35 mm camera equivalent: 28-200 mm)\n1/1.7\" MOS sensor. Primary color filter. Total pixel number: 12,800.000. Effective pixels: 12,100.000\nWiFi / NFC, image back up and camera operation with Android and iOS smartphones\nFull HD Video\nBuilt-in electronical viewfinder (200,000 Pixel)\nLeica DC Vario-Summicron 6-42.8 mm f/2-5.9 ASPH (28-200 mm 35 equiv)\n12 MP 1/1,7″ sensor\nDimensions (W x H x D) Approx. 103 x 63 x 28 mm / 4.06 x 2.48 x 1.10 in (lens retracted).\nWeight Ca. 173/195 g / 6.1/6.9 oz (withou/with card and battery).\nScope of delivery Camera body, battery charger/AC adapter (Leica ACA-DC11), rechargeable battery (Leica BP-DC14), wrist strap, AV cable, USB cable, CD with long instructions (PDF) , short instructions, Guarantee Card .\nFlash Built-in.\nDigital zoom Max. 4 x.", "Name": "Leica C Typ112 Compact Digital Camera, Dark Red", "ImgURL": "http://ecx.images-amazon.com/images/I/31C3PIB%2BAiL._SX300_.jpg", "ProductID": "B00FN0A2Q4"}}