{"Reviews": [{"Title": "Sony made a 5 star revolutionary camera", "Author": "T. Hosford", "ReviewID": "R15UZQCVQ7A9TD", "Overall": "5.0", "Content": "I picked up my a7 directly from the Sony Store on November 15th in Hong Kong.  The first one I received was okay except it had a mushy delete/c3 button (it didn’t click when pressed), so I refused it and had to wait until the next day to get another one.  The second body had all buttons and dials working properly, so I took it home with a giant smile on my face.  I purchased the camera, body only.  I also purchased the Zeiss 35mm F 2.8.Why I chose the a7 over the a7R.1. It has less megapixels.  Yes, you read correctly.  99.9% of the photos I take live in iPhoto.  The only thing 36mp does compared to 24mp is take up more drive space.  Also, I have a 20” x 30” blown up photo in my living room that I took on my old 12mp D300 and it looks amazing.  So, 24mp is way more than enough for me.2. It has Phase Detection Auto focus (PDAF), and the a7R does not.  I wanted this faster focus because I will mainly use this for photographing my 6-month old growing up.3. It has the low pass filter. I don’t want to have to remove moiré in photoshop or GIMP.  I don’t even want to deal with photoshop or GIMP except for maybe that .1% of photos that don’t live in iPhoto. Also, this camera is also the home camcorder, and it is very difficult to remove moiré from video. (however, from test shots I have been seeing, the a7r doesn’t appear to have significant moiré problems, so this may not be all that important.)Now that you understand where I am coming from, here is my review.This is by far the best camera I have ever owned.  Just in case you got here by accident, this is the smallest and lightest full frame changeable lens digital camera ever made.  Full Frame just means that all the lenses out there for 35mm film cameras will look the same on this sensor.  The pictures are amazing, the autofocus is lightning fast, and everything just feels like it should.  It makes taking pictures very easy and fun.  I moved to Sony NEX because I would often leave my Nikon D300 in the hotel, or at home because it was so darn bulky and heavy.You can stop reading now.  It is a 5 star camera.  The rest of the review consists of my comments about the various features on the camera.FIT and FINISH: The a7 feels extremely well put together, and exudes quality.  The a7 has two differences from the a7R build.  The a7 has a polymer front plate instead of magnesium, and it has polymer dials instead of aluminum.  But, I cannot tell the difference between this camera and the a7R.  They feel the exactly same to me (but this was only a showroom examination).  If you owned both for a while, you could probably determine the difference, but it is really hard to.  The a7’s weight is about 1/3oz more (9g).CONNECTIONS: This camera has a standard mic in port, headphone out port, micro USB, and a micro HDMI out.  It also has Sony’s new MI hot shoe.  This is based on the standardized hot shoe size.  There are extra contacts at the front for using all sorts of attachments, but it will also fire off a regular Nikon or Cannon flash (you will need to use manual mode, though).  It also takes the regular SD cards (but will also accept the Sony memory stick type).  It uses the same battery as the NEX-6, which is the Infolithium-W, so all those accessories or AC adapters and battery chargers will work here.BATTERY: This camera does really burn through the battery.  It depletes noticeably faster than the NEX-6.  You should buy an extra battery and a wall charger.  The camera is designed for “in camera” charging using the USB cable.  However, this means your camera is out of commission while the battery is charging (which is 310 minutes in the camera according to the user manual).  The wall charger is a must… and ONLY buy Sony batteries, and only from a big box store, a Sony store, or reputable camera shop.  There are fakes even on amazon (many are only “fulfilled by amazon”).  The last thing you want is a fake battery melting inside your $1,699+tax camera.  Six months ago one of mine (marked Sony and bought through amazon) did melt, but it melted in my wall charger and not my NEX-6.  Thank goodness.HOT SHOE: This camera uses the new style Sony hot shoe.  So, if you have a lot of “auto lock” accessories, you will need an adapter.  But, the good thing is that the new hot shoe is the standard kind, so it will fire even off brand speed lights (although, you will need to use the manual metering mode on the flash… it only receives the “fire” command from the camera, not all the settings).  It is the same hot shoe as the a99 and the NEX-6, and is the shoe Sony will be using on all new products that have a hot shoe.SHUTTER SOUND: Some have complained about the “loud shutter.” It is louder than the NEX-6, but not by much. I would not consider it “loud.” The a7 has the electronic front curtain shutter, so it is quieter than the a7R.  Anyway, this is NOT the camera to bring to the gym locker room to take illegal pictures of your fellow members, but it’s not so loud as to get you ejected from a friend’s wedding.VIEWFINDER: The viewfinder is beautiful.  Also, the sensitivity for detecting your eye is better implemented than on the NEX-6.  Now, it will usually stay on the rear LCD and only change when your eye is against the finder.  On the NEX-6, it would often think anything nearby is an eye and turn off the LCD.  Also, Sony has done something with the lens in the finder.  I find the screen to look VERY sharp and VERY easy to see.  It is a large improvement on the NEX-6 (and I love that finder).ERGONOMICS: The ergonomics of this camera are simply amazing.  The only downside is that the shutter release may feel a bit high (it is on the camera top, not the grip top like the NEX-6).  I thought so at first, but now it feels normal.  I love the two dials and the rear wheel.  However, it is easy to accidently hit the rear wheel and change your ISO.  You can lock this wheel and require hitting the “fn” to unlock it, but I haven’t found it to be that disruptive.MENUS:  I love the menus.  They are not the NEX style menus, but a single menu screen with all of the various groupings across the top.  It is very easy to navigate to find what you are after (I still forget where certain things are on my NEX-6, with its awkward menus).  There is an option to overlay the NEX style “tiles,” but that is just a top screen.  Once you are past that top screen, the menus are the same.THE MODE DIAL: Sony took the mode dial from the NEX-6 and fixed the two complaints I had about it.  They added 2 custom slots to store all settings.  So, if you are shooting and have everything set up perfectly for a common situation, just hit memory in the menu and set it to “1” or “2.”  Now, when you turn the mode dial to “1” everything is exactly as you had set it.  The second thing they did is get rid of having 2 different “auto” settings.  Now, you have just one “auto” slot and pick if you want it to use “intelligent auto” or “intelligent auto+”.  And… if you thought that two autos on the mode dial was a good idea, you can always put the second auto in one of your custom slots.  So, everyone is happy.AUDIO: This camera lets you adjust your microphone input gain.  It also shows you your recording levels, so you can see if you are getting your volume blown out or have your gain set too low.VIDEO:  This camera has a dedicated “movie” location on the mode dial which you can set up any way you like.  You can also press the movie record button from any of the other modes to record a video.  The advantage of the movie mode is that the standby time is optimized for video.  So, you can see your audio levels and have zebra striping on before you start recording.CUSTOMIZABLE BUTTONS:  This camera lets you customize almost all buttons.  I think “menu,” “play,” and up on the click wheel are the only buttons that don’t allow some level of customization.  C1, C2, C3, and left, right, down, and center on the click wheel are 100% customizable.  The Fn menu is customizable, but the Fn button always will go to this menu.  The shutter release is customizable to remove AF and AE on 1/2 click (stop the camera from trying to refocus and re-meter when you snap a shot).  The AF/MF – AEL button is fully customizable.  Movie button can be turned off while not in movie mode.  And the main front and back dials can be swapped between aperture and shutter speed.  The rear click wheel is customizable, but I think the default of ISO is the best.LENSES – NON-SONY: The wonderful thing about the mirrorless camera is that the film plane is much closer to the lens mount than the SLRs.  This means that you can fit an adapter in there and run old SLR lenses exactly how they were meant to be (i.e. the distance to the sensor is the same as the lens makers designed the lens for).  I have an adapter for Nikon lenses, and love using them on the camera.  Just make sure the adapter is “full frame” compatible because some adapters were designed for NEX’s smaller sensor and will block light around the edges.  One cool thing is that Metabones makes a smart-adapter for Canon lenses that allows full electronic control and focus of the Canon AF lenses.  Most adapters require manual aperture and focus, like the one I have for Nikon (but the camera still works just fine and meters perfectly).  And all the leica rangefinder lenses are manual, anyway… so it works just the same (but with TTL viewfinding and focus peaking and focus zooming!!!).MANUAL FOCUS: Because adapted lenses will mostly be focused manually, manual focus is important.  Sony has a brilliant system for this.  They use a thing called focus peaking which puts a highlight on hard edges (you can chose white, yellow, or red).  Anyway, if something is in focus, it will get this highlight (I use yellow in general).  Also, it has a focus zoom function that will give you magnification into a very small part of the picture.  So, if you are focusing a portrait, you can zoom in so that the person’s eye fills the whole view finder. You can get that focus sharper than you could ever hope for using an optical view finder.  It almost feels like cheating.LENSES –SONY FE-MOUNT: The a7 / a7R are the first of a new line of cameras.  So, native FE-mount full frame lenses are limited.  In fact, there were only 2 when I bought this camera.  The kit zoom, and the Zeiss 35mm F2.8.  The Zeiss 55mm F1.8 will be out by Christmas.  And, a Zeiss 24-70 F4 and Sony 70-200G F4 are coming in Q1-2014. So, there will be 5 native lenses in a couple months.  Sony has published a roadmap and will have 15 lenses out in the next two years.  However, you can get the Sony adapter so you can use all the Sony A-mount lenses (with full autofocus!).  That adapter is about $400, and the one without the special autofocus motor is $300.  One thing to be warned about is that all of the native lenses are…  um…  kind of pricy.  Some would say, overpriced.LENSES – SONY E-MOUNT: The camera is also backwards compatible with all of your NEX lenses that were designed for the smaller APS-C sensor.  By default, the camera will use those lenses exactly as they appeared on one of the APS-C cameras, by cropping down the full frame image.  (On the A7, pictures will be 10.5MP, on the a7R it is 15.75MP) This means you will use only an APS-C sized section of the image sensor.  You can turn this off and use the whole sensor, but you will get heavy vignetting because those lenses were not designed to cover full frame.  (Note: The SEL 10-18 zoom is one lens that will cover the full frame at 16mm-18mm.  No other SEL lenses will cover the frame that I know of, but all will actually cover more area than APS-C… you will just need to manually crop the image later and decide how much vignetting you will accept.)Minor Annoyances:1. I have the PAL version of the camera, but set it to NTSC video mode.  For some reason, the camera gives me a warning “Running in NTSC” every single time I start the camera.  I mean, every single time.  This is annoying.  Sony needs to come up with a way to disable this alert.  If you buy from USA Amazon, you should not have this issue unless you switch to PAL mode (I assume).2. If you are wearing glasses , the viewfinder has to be up to your eye in just the right way before it will recognize your eye and turn on.  It works flawlessly with contacts or no glasses.  I wish there was a “glasses mode” that would make it more sensitive.  However, I still prefer this to the over-sensitive NEX-6 which thinks everything anywhere close to the back of the camera is your eye.COMPATIBILITY WITH ACCESSORIES – (That I have actually tested)Stereo Microphone - ECM-XYST1M:  The Sony web page says this is compatible, but it is not really.  If you put it on, it will record sound.  But, under the current firmware, you are unable to adjust audio levels.  You can see my Amazon review for this microphone about its way too sensitive auto setting that will crank up the microphone during silence so you always get a low hiss in the background.  I thought this would be resolved with the a7’s ability to adjust input gain… but for some reason, the audio levels feature gets disabled when you attach this microphone.  The menu item just grays out!  Do not buy this for use with the a7. (I have notified Sony about this and will update here if a firmware update solves this issue)MI Shoe External Flash - HVLF20M:  This is the small one, not the giant speed light that is larger than the a7.  I really like this flash.  It meters through the camera and is small and light.  It folds down out of the way (which also turns it off).  It can only point forward or bounce off the ceiling, but that is okay for most needs. If you want more than that, you probably need to get creative with tape and a 3x5 index card to direct the light where you want.  For what it is, it’s great.  It takes AAAs.  But, be careful… there is an identical looking version that is for Sony’s old style hot shoe and it will not fit on the a7 without a separate adapter.  Be sure the version you get is for the MI Shoe (you can just copy and paste the item code I mention above).", "Date": "December 1, 2013"}, {"Title": "Razor sharp images ... With different glass than the kit lens", "Author": "stephen", "ReviewID": "RBVCCNV7YZT9X", "Overall": "5.0", "Content": "There are many excellent reviews on here, so I thougt I would focus (no pun intended) on how to get good inexpensive lenses for the camera that will make it shine and give you a well rounded start at your kit without leaving you begging for food on the freeway exit ramp. I purchased the A7K (the one with the 28-70 kit lens). I do semi-pro work with photography and videography. I know good glass, but on the photography side have elected to stay away from the larger 5D MIII AND D800(E) cameras ... Just wanted to be more portable and stealthy in my street photography. I own a Sony RX1 with a DXO RATING OF 93 on the that sensor coupled with the excellent Zeiss f2.0. The sensor on the A7K has a DXO rating of 90 so it's a little less than the RX1. That's not to say the A7 is not sharp ... It is very, very sharp ... Just not with the kit lens.So ... I took my excellent Sigma 30mm f2.8 from my Nex 6 and removed the baffle ( a common mod since then the Sigma can cover full frame). And there is a very, very tiny amount of vignetting at f2.8 and is actually very good up to around f4. All the vignetting is so light it can easily be removed in Lightroom. But that lense is absolutely tack sharp in the  IQ department. Check all the reviews ... This is a $199 lens that rivals the new Sony FE 35mm f2.8 at a fourth of the cost (with the baffle removed ... 3 tiny screws and 3 minutes of work).Then I researched and got the Samyang 14mm  f2.8 super wide. This lense retails for around $348 on amazon, and has been tested by different mags and dozens of reviews to be practically equivalent to a $1400 super wide. You can get this lens under the Rokinon branding. The only thing is, of course, is that you have to use this lense with an adaptor to the e-mount. Since I use the inexpensive Sony LEA-1, it does not auto focus (the lens would not support it anyway) ... So you have to manually focus. I find that with this lens, the A7 peaking function is a little off or uncertain, so I simply assign the C1 custom button to the focus magnifier function and eyeball it without peaking instead.But ... My star lens is the Sony A-mount SAL50M28 50mm f2.8. I put this beauty on the A7 via the LEA-1 adaptor, and beautiful things happen. That A7 is predictable and dead on accurate. And the peaking is full off until exactly (not almost) in focus. That makes manually focusing with mid level peaking fast, effortless and very accurate ... An absolute pleasure to use. This is the only lense I have used thus far that makes me feel just as comfortable shooting as I do with auto focus shooting. Plus (the very best part) the lense is unbelievably sharp and flat across the frame. When I saw that 16 people on Amazon gave it five stars, I was skeptical ... But now, I'm a believer. Amazing sharpness and even though, yes 50mm is handy for macro work, this lens is da bomb for street photography. Chances are I will rarely take this lens off my camera. Even for 50mm landscape shots, a 100% crop reveals individual pine needles on a pine tree at 120 yards away ... With dead on color and absolutely no noise or optical distortion. The lens is completely flat and is about 1:1.1 or 1:1.2 ... In other words, subjects in your images look the same size as what your eyes see.This $598 sony 50mm just boosted the sharpness of my A7 to what seems to be slightly beyond 5D MIII territory. And finally that lens, with the small Sony adaptor attached is about the same size as the original A7 kit lens. Before, I just had a pro camera ... Now I am getting pro images out of it. What a difference!  All else with the camera is high quality, pro build and everything I could hope for in manual control functions that are all easily assignable to the many physical controls that are easily and intuitively placed around the camera. So now, with an Nex-6, a Canon T2i, a Sony RX1 and my new A7,  I finally feel like things are reasonaby well covered. But the A7 takes me into another league altogether. It's easy to carry with me, I get pro results, it's rock solid, ultra configurable to the way I want to shoot, etc. We're having fun now.UPDATE: I was so impressed with the leap in IQ from the Alpha A-mount lenses that I purchased the LA-EA4 adaptor. This is the adaptor you want ... fast AF and actually much smaller looking and feeling than what the pictures of it on the camera would seem to indicate. If fact, I am so impressed by the auto focusing response and lightness of the unit that I decided to simply make the A-mounts my lens collection. Of course I save a lot of money, but once I research the lenses for 5 star average reviews, I can buy them at around 50 to 60 percent what the FE lenses would cost. So far, in addition to the (not so sharp) 28-70 kit lens that came with the A7, I have the A-mount Sony 50mm F2.8 ($450), the Sony 50mm F1.4 ($550), and a SUPERB Sony 100mm F2.8 ($800). These are all full frame lenses and the pros who have used them are virtually unanimous on their virtues.At first glance it may seem that I do a lot of macro work since the 50f2.8 and 50f1.4 and 100f2.8 are all hyped as macro lenses. But, even though they seem to be superb at macro shooting, my purpose was use in street photography. Everyone knows the 50mm is preferred by many street photographers, thus the purchase of the two 50mm lenses. But, sometime I don't want to get too close to my subject so that I can capture the moment without them feeling uncomfortable or ruining the look and feel I am trying to capture. The 100mm f2.8 gives me that bit of telephoto but is still razor sharp like a good quality prime should be. It let's me be about twice the distance away while shooting and still fill the frame with my subject scene.IMHO ... A KEY TO GREAT IQ ON THE A7 ... No matter what you've heard about 1/60th of a second being fast enough to freeze the action in street scenes, switch to M (manual mode) on your mode dial. Then set your Aperture to either shallow depth of field (f1.4-3.2, etc) or deep depth of field (f8-16) and put the shutter speed at minimum 1/320th second. With this camera you have nothing to worry about when in Manual mode. Your auto focus still works, you select the aperture you want for bokeh or for focus across the frame with one of the two horizontal dials, then set, and forget, the shutter speed to 1/320 to 1/500th second with the other horizontal dial.The reason why this setup is key is that the lack of sharpness the A7  sometimes exhibits in images can be traced to too slow of a shutter speed. Now you may be thinking, \"Well ... DUH?\"  But remember, in addition to hand steadiness, you can also have camera vibration from the shutter event itself. Your hand may be relatively steady, and your subject relatively still, but camera vibration can still sabotage your shot ... even at 1/60th of a second. A fast shutter speed will capture the picture before the vibration \"echoes\" reverberate through the camera body. Forgive the technical stuff, I'm a scientist by training :)  When you leave the shutter speed at this fast speed, you only have to decide which effect you want your aperture to have and set it. THE COOL THING IS ... the A7 will continue to set the ISO automatically for you, if you have set the menu selection for ISO to AUTO. So, your shot always turns out! You can even set the bracketing for AUTO ISO in the menu system to make sure the camera does not select an ISO that is too noisy (higher than 3200 or 6400). While the A7 can remain relatively noiseless until around 3200, a shot at 6400 is completely usable in all but the largest print sizes ... and 6400 shots are better than missing the shots. That's why I set my upper ISO limit to 6400. Shots that have a little ambient light usually never take my A7 above 1600-3200 ISO so I'm usually safe.So, you can see that shooting in M, with the shutter frozen at faster speeds, then simply choosing Aperture for whatever you happen to be shooting that day, can be like an AUTO mode since the camera will make it all right for you with the AUTO ISO. I usually agree with the ISO the AUTO ISO sets, so I'm happy. The end result of this coffee-powered write-up is that, with the shutter speed at 1/320 to 1/500, the 100% crops on my images have improved in sharpness by close to 300% from what they were when the camera selected 1/60th to 1/80th sec shutter speed. Again, I think this is likely due to camera vibration rather than lack of steady hand ... though both are important.  With the kit lens, I now have a family of 4 lenses, 3 of which produce great IQ, that auto focus fast and produce very good results. It may be a long time before I feel the need to buy any FE lens. I know they will be good, but they are somewhat expensive. With the A-mounts, I spent a lot less getting my kit outfitted (and let my wallet cool off), plus, I have everything I need today ... instead of having to wait a year or two. The key to this plan was the LA-EA4 adaptor which only adds about 10-15% to the overall size and mass of the camera plus lens unit. You have a great camera! Enjoy it.", "Date": "January 13, 2014"}, {"Title": "Perfect for my needs, but not for everyone's", "Author": "spheremusic", "ReviewID": "R1XT5RA0679QCK", "Overall": "5.0", "Content": "BOTTOM LINE (if you're in a hurry): A fantastic camera that has delivered consistently excellent results for me across a range of lenses. The A7R has a better sensor, but there have also been some shutter vibration issues with that more expensive body, which you might want to research before making your choice.I'm an experienced amateur street and art photographer; I don't make a living from photography, but I aim to produce professional-quality images. I'm good with gadgets and can find my way around menus. I think anybody reviewing a camera owes it to the reader to provide this kind of context right off the bat. If you're a wedding photographer or just want to take snapshots of your kids, your criteria and concerns are likely different from mine.I bought the A7 with kit lens to complement my Nikon D800 and lenses. I wanted something smaller, lighter, and less conspicuous without sacrificing too much in image quality. I sold my OM-D E-M5 and lenses to finance this purchase; the E-M5 is a great, very responsive camera but ultimately I felt the image quality wasn't good enough for my purposes now, and certainly wouldn't be good enough 2-3 years from now. High ISO images, in particular, had unacceptable levels of noise. Cropped images looked awful. This is also why I decided to pass on the E-M1, which sounds like a beast, performance-wise, but doesn't improve substantially on the E-M5's image quality, especially in low light. Only about 10% of the shots I keep were coming from the E-M5, while 50% were coming from my D800, 20% were coming from my Sigma DP2 Merrill, and another 20% from my Ricoh GR (APS-C sensor), which I take everywhere. I've also recently owned a Sony RX100 (first version) and a Canon Rebel T2i. The cameras just named are my current-generation points of reference.Before opening the box I'd read discouraging things about AF speed. I'm not sure what camera and lens those reviewers were using, but my A7 with kit lens focuses very quickly, even in low light with the focus assist lamp turned off (some have reported that turning the lamp off actually seems to help). Furthermore, focus on this lens is extremely quiet--at first I thought nothing was happening, but lo and behold, the shots were in focus. In daylight it seems to focus almost as fast as the E-M5High ISO noise is minimal at 1600, well-controlled at 3200, and still usable at 6400. I can't say that about the E-M5, which I didn't dare push past 3200 lest I get harsh chroma noise that that no amount of post-processing could redeem.Before receiving the A7 I also read complaints about the JPEG engine. I only shoot RAW (I'm now editing the files with Lightroom 5.3RC), so this isn't an issue for me. I realize this camera is meant to be an entry-level full-frame, but I assume if you're willing to pay more for full frame it must be because you want the best in image quality; if you want the best in image quality, you need to go RAW. If you want to shoot tons of casual JPEGs and can't be bothered to post-process, there are plenty of wonderful APS-C options from which to choose, including the Fuji X series cameras, which deliver beautiful JPEGs right out of the camera. The Olympus M43 JPEGs are also very nice as long as you're not shooting under extreme conditions.Image quality on the whole is excellent, standing up to comparison with my D800, with files only two-thirds the size. Sony sensors (including that in the Nikon) tend to deliver images that feel way too cold and digital to my taste unprocessed, but the D800 and A7 give me enough detail, dynamic range, and color depth to process and crop to my liking.The kit lens isn't the sharpest (I prefer primes anyway), though I haven't yet encountered the chromatic aberration noted by another reviewer. Many reviews have been lukewarm, but I think it's an accomplishment in its own right: small, extremely light, quiet, stabilized, and great value. I wouldn't use it with the 36MP A7R, and if one wants to shoot landscapes or portraits or night shots one obviously needs to use more specialized lenses, but this is a solid daytime walkabout zoom. I think it's definitely worth the $300 kit price bump, though maybe not the $500 it costs when bought new separately.The menu system is a bit involved, but it felt familiar to me after living for a year with the RX100.The body is larger and heavier than the E-M5 if you do a careful comparison, but not by enough to really notice when you're shooting. In real-world situations, it feels about the same.Now some CONS:The startup time is very slow, maybe the slowest of any camera I've ever used. I hope a firmware update will improve that a bit.Battery life is poor and there isn't a charger included. Big deal! You can pick up a Wasabi two-pack with charger for $27. Problem solved.The shutter is loud. I was hoping that the electronic first curtain would make for a stealthier shutter sound than the honking A7R, and it IS better, but still far from stealthy.In sum, this camera isn't perfect, but it has met my early expectations and exceeded the dampened expectations caused by a few early reviews. I don't regret selling my E-M5 for a second. And while it isn't perfect, it's a very impressive first effort at a full-frame mirrorless body for the masses. Future iterations will only get better, and as the lens selection fills out I think we'll eventually see a dramatic shake-up in the format landscape. It's becoming increasingly absurd to have slapping mirrors in front of super-high resolution digital sensors, and if you can get full-frame this small and this inexpensive, M43 mirrorless is also very much under threat, as are Leica bodies. Where M43 really has the edge is with compact telephoto lenses, an advantage that the M43 players haven't fully exploited with top-notch long lenses (the Olympus 75 1.8 is a notable exception, though it isn't really that long).As the system stands today, I'd say this and the A7R are best for fine art, street, and travel photography. Event and sports photographers and photojournalists will obviously stick to their fully-evolved DSLR systems for now, while casual shooters are probably best off with one of the countless APS-C options available in all sizes.In the coming days I'll do some testing with a Leica Summarit 90mm 2.5f that I purchased especially for use with this camera, as well as with my Zeiss ZF lenses, and update this review. The ability to use this camera with most, if not all, of the stellar legacy lenses already out there was another major factor in my decision to buy, and I'm looking forward to seeing what it can do. I'll also be picking up either the 35 2.8 or 55 1.8 ZA lens once my wallet cools off a bit.Update (12/5/13):I've had a chance to try the body with the Leica Summarit 90mm f/2.5, the Zeiss 21mm f/2.8 ZF.2 and the Zeiss 100mm f/2 Makro-Planar ZF.2. I'm a photographer and not a gear tester so my experiments weren't rigorously controlled, but here are some subjective impressions.The Leica works like a dream with this camera. I could get derailed singing the praises of this lens, but since this a review of the camera I'll just say that the A7's two-stage MF magnification assist is great and the focus peaking function is even greater, especially when you don't have forever to focus. It's MUCH easier to use non-native lenses with this camera than with the Oly E-M5. Now I see what I was missing in not having a NEX. Manual focusing is also easier and more accurate than with the D800/Zeiss combo.I was wondering whether there would be any vignetting or corner smearing with the Zeiss 21, as these issues have been reported with some super-wide M-mount lenses. No such issues with the F-mount Zeiss, I guess because of the much longer flange distance.The Zeiss 100 more or less performed as expected, but there is one fly in the ointment: I did notice greater night-time haloing and flare from bright lights at the same aperture with the Zeiss than with the Leica or with the same Zeiss mounted on my D800 (on which that lens also exhibited some haloing, more than the Nikon 70-200 f/2.8 VR II at the same focal length and aperture). This could be remedied by stopping down, but sometimes that isn't always an option. There was some haloing (though much less) with the 21 as well. This might be a function of my adapter (I'm using the Vello) or it may be something that can't really be remedied with this combination. I'm not an expert in optics so I can't really say (if anybody reading this is, please enlighten me!). With the Leica in my bag I don't plan on using the 100 much with the A7 anyway (except for occasional macro work), and both Zeiss lenses made everything a little too front heavy. I did buy this camera for the lightness and compactness, after all, and slapping an all-metal DSLR lens on the front kind of negates that benefit.A lot of people are currently testing the gamut of legacy lenses on this camera with more rigor than I have; you can find links to those tests on the Sony Alpha rumors website or do Google and Flickr searches if you're curious about how a particular lens plays with this camera. For my part, I'm both excited and financially terrified at the prospect of getting more M-mount lenses to use with the A7. It really is a great combination--one just has to do one's homework on the super-wides before diving in. Focal lengths 35 mm and higher generally seem to be fine. (UPDATE: The Zeiss Biogon 35 f/2 ZM has very blurry corners with the A7 according to the tests I've seen. I'm revising my recommendation: One should check the tests for any non-native lens that one wants to pair with the A7 before purchasing. The results can be unpredictable.) Many of the Voigtlander and Zeiss M-mount lenses are excellent and reasonably priced, and peaking makes manual focusing as easy as pie. Amazing. This camera just may displace the D800 as the one I use most.Update (12/6/13):DxO has given the A7's sensor a rating of 90, compared with a 96 for the D800E, a 95 for the A7R and the D800, a 94 for the D600 and 610, and a 93 for the RX1. I was hoping the A7 would score closer to the D600, which has a very similar Sony sensor, or at least the RX1, so I am a little disappointed, as I do trust the objectivity of DxO ratings. The A7 does have the advantage of slightly faster PDAF focus, but given that neither the A7 nor the A7R is really suited for action photography, that's not a very compelling selling point. The A7R also beat the A7 at high ISOs, despite having higher pixel density. The A7 still outperforms the Leica M Typ 240 (84), and is well ahead of the Olympus EM5 (71) and EM1 (73). I'm still happy with my purchase, but if this were to be my only camera and not a complement to the D800, I would certainly pay the $600 extra for the A7R body.Update (12/23/13)There have been reports of vibration issues in certain specialized with the shutter of the A7R. You can Google it, or go directly to the Sony Alpha Rumors website to learn more. This is not an issue with the electronic first curtain shutter used on the A7. In light of this emerging problem--disappointing for a $2300 camera--I'm happy to stay with the A7, which has continued giving me excellent results in the three weeks I've had it. I've been putting it through its paces on a trip to Tokyo, where I've been using a large number of (incredible bargain) legacy Nikon lenses with outstanding results. I'll update with a fuller report soon.", "Date": "December 3, 2013"}, {"Title": "The perfect camera", "Author": "Richard", "ReviewID": "R3TEOF8DEMZ6IJ", "Overall": "5.0", "Content": "As an enthusiast photographer, that I am,  I wanted to give a review from that perspective rather than a more technical perspective from , perhaps, a professional, which I am not capable of doing just yetUpon opening the box for the first time, I was immediately struck by the small form factor (and somewhat retro look - but just my opinion) and light-weight of the camera body.  Indeed, I wasn't sure, at first, there was my camera inside the Amazon box UPS handed to me upon delivery (and UPS will require your signature for this item.  Otherwise they are going to leave with nothing and come back another day).This camera body looks sharp.  It's not completely magnesium metal body like its A7R higher priced sibling, but, rather, a mixture of metal and better plastics.  But very hard to tell the difference.  Point being, no one's going to accuse you of having anything less than a fine well-built camera. It feels good in the hand.  A good grip for your right-hand.  It's built like a tank.  And it's weather sealed.All the buttons are where I want them to be.  Perhaps the shutter button could be a little farther forward but it should be just a matter of getting use to it.  The menu system is far easier to use and navigate than on my NEX6.  And the NFC between the camera and my Android phone (Galaxy S4) is fast and convenient.  The remote control function works very well.  Checking latency revealed a very, very slight hesitency.  But so minor.  You'll hardly notice it.  Just a nit-pick on my part (like the shutter button-certainly no game changers).I bought two lenses (there are only 5 of the FE lenses out as of this writing but Sony is releasing a total of 15 by 2015).  The 35mm (very light) and the 55mm somewhat heavier and built well.  I use the 35mm as a walk-around street lens because it compliments the light-weight and portability of the full-frame A7.  In fact, this is why I bought the A7 in the first place.  For street photography and scenics.  At first I thought it would be a good 'stealth' camera for the street, but I have come to realize that with todays digital age we're just fooling ourselves if we think they don't know what we're doing.  These two lenses, by the way, are Carl Zeiss and they have received some of the highest praise of any lenses on the market today.  (A word of note, Sony is coming out with a 70-200mm lens full-frame for this camera April 20 2014 here on Amazon, $1495.00).So yes, the lens are expensive.  But they are proving their worth.  But one of the great advantages of these Sony cameras are their absolute adaptability too legacy lenses given numerous availability of lens-mount adapters for Minolta, Leica, Hasselbad, and then, of course, there's Nikon and Canon, as well as some others.  So there is a way to get around the expense if you have legacy lenses laying around.  Or you can buy some great glass on ebay cheaply which I'm told can rival, in some cases, some of the great glass of today.Finally, another great accessory which I bought, is Sonys Battery Grip which allows the use of 2 batteries and has a great form factor for the camera giving it a great grip, especially for larger hands as I have.  Also I like the button placement.As you can see.  I can't say enough about this camera.  But it's totally worth it.  In fact it's a steal at this price for what it does as a full-frame camera.  With the 35mm lens (minus the battery grip), you can throw it in your shoulder bag or pocketbook, go about your day, and take stellar pictures.  You won't regret this purchase.If my review helped you in anyway, and I sincerely hope it did, please check yes in the comments section below.  Have a great day.  Richard", "Date": "April 13, 2014"}, {"Title": "Comprehensive A7 review", "Author": "PhotoGraphics", "ReviewID": "R2YA91YLIKTWGF", "Overall": "5.0", "Content": "I am a professional photographer/graphic artist but will not be reviewing this camera from the perspective of comparing it in any way to specialized pro gear. That would not be fair to any camera or anyone considering the A7 as it fits into its own niche. There are dozens of reviews on the internet written by authors who have a long and extensive experience in publishing camera reviews. I suggest you do a search and read them all from beginning to end, especially the very in-depth analysis at dpreview. Then of course, consider the many reviews posted here at Amazon, some of them very well written and, as always, some of them based more on personal opinion and brand preference than fact. This review will strive to hit the most important things you should know when considering this very unique camera and justifying to yourself the worth to you at a price very close to $2000.WHAT IS THE A7?When a new product category is innovated it is hard to peg it into a nice neat box. Putting aside its price for a moment, the A7 is neither a pocket camera, bridge camera, enthusiast DSLR nor pro-grade shooter. As a full-frame, small body, interchangeable lens mirrorless camera it stands in a very uncrowded field. It is too large to appeal to pocketcam fans, way too expensive to match the super-zoom bridge cameras on price, about 3X as expensive as popular enthusiast DSLR's with kit lenses and all-around lacks almost everything a pro photographer looks for, particularly ruggedness and easy access to a wide variety of industry-standard lens mounts and other accessories. Yet it is being cited time and again as one of the most exciting cameras of the era and for good reason. My assessment (backed by Sony) is that the A7 is directed at someone who is serious about image quality and willing to give up things like fast burst shooting, ultra-fast auto focusing, i.e. the classic Leica rangefinder photographer who doesn't have a Leica budget and isn't ready to give up some technological assistance quite yet in favor of strictly manual photography. For many it might be considered an ideal street camera because of its unassuming looks and shoot-from-the-hip capabilities.WHAT IS THE BEST APPLICATION FOR A CAMERA LIKE THIS?One answer might be \"if you've got the bucks for a top-end toy, go for it\".  Most people do not have an extra $2k laying around for a camera. The question might be better answered that the A7 is not a do-all, perfect solution for everyone camera.  The ideal target user is one whose creativity demands the image quality of a full-frame sensor but does not intend to use the camera in the rough and tumble world of photojournalism or sports photography. Someone who can take the time to compose and adjust a camera manually and finds that freedom lacking in point-and-shoots or bridge cameras and despite the higher image quality of prosumer DSLR's finds them too cumbersome as a compact takealong street camera. For me it has finally satisfied that niche I needed and wanted to produce images the way I see them and imagine them without the compromise of tiny image sensors or the bulk and complexity of my pro gear. In other words an oversized pocket camera created for perfectionists.WHAT ARE ITS STONG POINTS?The physical size of the image sensor is what makes this camera sizzle. Regardless of \"megapixels\" there is simply no way to produce the best possible imagery using smaller than full-frame sensors. The abundance of manual controls and customizable presets, interchangeable (and sometimes superb) lenses, a smooth-feeling zoom and focus ring, a best-in-class electronic viewfinder (so good you forget it's not optical), excellent ergonomics, solid and water-resistant body construction and electronics that don't get in the way of creativity go a long way toward making this camera worth it's hefty price tag.  Once you get past specs and opinions and get it in your hands you get a satisfying feeling of the glory days of photography and an urge to push it to its limits.WHAT ARE ITS WEAK POINTS?I often tell my students that a camera doesn't make a photograph, a photographer does. And the A7, as a photographic tool, give a creative photographer much of what s/he needs to create superb imagery. But in the physics of camera design there is no such thing as perfection. The most egregious error that could be made is to waste the A7's potential by never exploring beyond the kit lens. Don't get me wrong, the kit lens is very capable and when purchased in combo with the body is very attractively priced, but it imposes limitations on a camera that is so much more capable.  Putting aside what I do for a living and any comparison to high-end pro gear if I never took the kit lens off the camera I would be missing out on much of what Sony had in mind in designing it. While Sony is in the infancy stage of offering quality lenses specifically designed for the A7/R (as of this review's date there are 4 with more to come), the brilliance of the design plus the ingenuity of after-market manufacturers translates to there being several affordable adapters that permit you to use many of your existing lenses (even non-Sony lenses) or specialty lenses that may fit a particular need of yours.OBSERVATIONS:* Slightly slower startup time than the typical DSLR but nowhere near unacceptable* Shutter sound a bit loud for stealth photography but not as bad as some reviews would have you believe* Battery life is just okay, there's a lot going on in this camera electronically and the battery just doesn't have the stamina to keep up with it. Hint: keep the WiFi set to the airplane mode and your battery life will increase substantially.* Stiff shutter button (the detent feels great but the pressure to release is just a little strong)* Too easy to turn camera off when trying to use front control dial. This is probably the most serious design issue I've found. Nearly every time I use the camera my forefinger either shuts the camera off when I am trying to use the front dial or, possibly worse, accidentally changes a setting while I am reaching for the shutter release. Simply put, the front dial is in the wrong location* My personal preference would have been that Sony designed the manual focus switch to be a mechanical switch/button rather than a menu item. The autofocus is pretty accurate but not as accurate as my eye and brain. It is a multi-step process to switch to manual focus (which is focus-by-wire, by the way) ... neither being a positive feature for a camera in this league.* But there is a nice happy ending to the focus button issue which, after a little menu setup, can work out quite well. The AEL button doubles as an AF/MF button. It's placed in an easy-to-access location and simply what it does it permits switching momentarily from MF to AF to take a quick \"read\" then taking control back over from there to fine-tune the manual focus for the shoot, OR it will momentarily switch from AF to MF to let the camera do all the focus thinking and first and then switch to MF (which gives a temporary enlargement to assure perfect focus). I know it sounds a bit complicated but it is brilliant in actual use.  Personally I'm getting in the habit of letting the camera tell me what it thinks is right but taking quick corrective action if I suddenly decide to switch to a different point of focus. PS-there is a third focusing option which is Direct Manual Focus. Similar to both of the above the camera defaults to autofocus but when the user turns the focus ring they can take direct control to touch-up focus.* Sony's downloadable PlayMemories software is very consumer-oriented, but it is necessary if you wish to take advantage of the camera's built-in WiFi. It is good for quickly downloading a few files but snail-like if you have more than about a dozen files to download. Its worst feature is by default it wants to search your hard drive and load every photo it finds into Sony's album organizer. You can turn that feature off but it switches on again automatically every time you connect the camera. In my case I have about 100,000 photos stored on several connected hard drives and PlayMemories insists it knows better how to organize them than me. It doesn't.BOTTOM LINE - PICTURE QUALITY - DOES IT DELIVER?If you read the paragraph above you understand that for my non-business (i.e. family time, vacation, fun excursions) usage I have finally migrated from a decent enthusiast DSLR to a this nice mirrorless camera.  The ultimate bottom line is that sensors, processors and other components have simply gotten better and the A7 is simply more capable than my 60D (which was equipped with one of Canon's best lenses rather than a kit lens). When used with a Leica prime lens on the A7 I can accomplish some photographic magic that transcends marketing hype. I have this sense that nothing mechanical (other than the misplaced front dial) about the camera is holding me back. Let me edit that ... the camera, mechanically, is not the most capable for high-speed sports photography and will sometimes struggle with autofocus (which I rarely use) in low light. But as a manual camera for exacting creative projects the A7 may rank as one of a handful of best-ever photographic tools and when used as such its little trivial foibles simply melt away. The A7 is especially adept in the role of a \"street camera\", one that does not impose or intimidate and is capable of a good degree of stealth photography due to having the tiltable live-view view screen on the back as well as a very good eye-level viewfinder.Here are some random thoughts that did NOT directly affect how many \"stars\" this product earned:* The packaging, for the selling price, is very low grade to the point of being cheap. I don't feel Sony adequately protects a $2000 product nor presents it in a way befitting its price.* There is a comprehensive instruction manual included in the box, but it small with a tiny typeface and printed on the cheapest paper imaginable.  At the time I received my camera there was no comparable PDF file at the Sony website available for download.* There are no software disks in the box. Sony directs you to a special website to download their Personal Memories software, which is very consumer-oriented. More difficult to locate is Sony's unique RAW file converter, developer, editor available at their website as well as a third bit of software. The RAW file editor crashed and would not work. That gave me my first opportunity to deal with Sony's tech support which was inadequate, I kept getting off-topic responses from them to the point where the rep simply gave up and I had to request the issue be escalated, and as of this review nothing has been able to fix the issue.* There isn't a starter SD card included in the box. That is not a big deal because anymore most people (especially those who buy a $2000 camera) want to carefully select exactly which card they feel best suits their needs.* Sony obviously hit the mark with a perfectly sized, ergonomically excellent, lightweight camera body. How much better would this camera have felt if the kit lens was about the same overall volume in size and about the same weight as the body?  Of course it's possible, especially at Sony, a kit lens that is half the size and weight would have put this camera over the moon.* I have owned over 100 film and digital cameras. I strongly suggest that despite your skill level you live with this camera set to the \"Auto\" position for at least the first few days. During that time take note of your shooting habits before ever delving into the menu system. There are a staggering number of different configurations you can assign to each \"Custom\" button plus dozens of other user-defined setups. Resist the urge to start setting them all until you get the feeling for the overall camera. Then proceed slowly. I assure at some point you will feel this camera is an extension of your brain if you take the time to set it up properly.* If you are used to having a built-in flash you will have to get unused to it and that's not necessarily a bad thing. Pro photographers don't use built-in flashes for a very good reason; they can absolutely ruin what would have been a great photograph. Take the opportunity to learn to work with light and if there is no light, add it judiciously rather than have a xenon bulb explode a torrent of light flatly and directly at your subject.* Anyone reading this should be clear that virtually any camera stumbles when using auto-focus in low light. The A7 is actually better than many others in low light for two reasons ... it has probably the brightest AF illuminator I've ever seen, it's been able to focus on someone's face across a darkened room.  Use it if you want to autofocus in low light conditions. And the manual focus has some features that make it easy to use and accurate in near darkness, specifically the aforementioned superb viewfinder and the ability to temporarily magnify a select part of your subject to permit precise focusing.* I also have a Sony \"bridge\" camera that has both an electronic viewfinder and a rear screen. Many of the reviews for that camera criticize the fact that it requires a manual switch to go from using one viewfinder to the other (it doesn't sense your eye to switch automatically). I totally disagree, I much prefer to choose which viewfinder manually. One reason is I don't want my entire face lit up by the bright rear screen when I am taking candid photos in a darkened area.  To set it to one or the other you must dive deep into the menu to choose one viewfinder or the other. The eye sensor is also too sensitive ... I can be using the rear screen to compose a shot and if I move my hand to use one of the rear buttons the sensor thinks that's my eyeball and shuts off the rear screen. That can be very annoying when it happens just as I am about to capture an image.Final score about 4.75 stars.  Since Amazon doesn't permit fractional ratings the A7 will be rounded up to 5 stars.  There really are no compelling negatives to not consider this camera once you are really fully aware of what it does, and what it doesn't do.  And that has to be a decision that you alone make, not based on brand-name fans or anyone else's reviews.", "Date": "February 19, 2014"}, {"Title": "A perfect balance between artistry, gadgetry and nostalgia", "Author": "Dr JS", "ReviewID": "R16GE6BYHFIRS5", "Overall": "5.0", "Content": "As a 20+ years Canon shooter, leaving Canon is one the hardest decision I have ever made.  But at the end, SONY's little Alpha 7 have won me over.  Let's be perfectly clear, this Camera is not right for everyone.  Whether or not you like this Camera, will depend on your shooting style, shooting history, and technical competency.  Here is a list of pros and cons for me:Pro:* One of the best full size sensor currently on market* One incredible performer in low light* A beautiful electronic viewfinder and under most conditions make you forget you are not using an optical viewfinder* Very helpful focus aid for manual focus shooters (peaking and magnification)* Professional quality bodies with well thought out designs* Very small and light (with the right lenses)* Short flange focal distance means almost all vantage manual focus lenses can be adopted* Body very aggressively priced at $1700.  With discount, it is an even better deal.* Good WIFI implementation and connectivity to the web and smartphones. A well thought-out strategy for social media/sharingCons:* Paucity of full frame E lenses and lenses are very expensive* Battery drains fast* JPG quality leaves something to be desired* Doesn't come with a dedicated charger* Some control are less intuitive and not as conventional* AF is still sluggish compared to high end DSLR* Lack accessories to support studio shooting (ie. wireless flash controller)While sports and bird photographers will be underwhelmed by the lack of lenses selection and slow AF performance, street and travel photographers would be equally delighted by this camera's image quality, weight reduction and portability.  Case and point, A7 with a 35mm Zeiss prime lens weights a mere 530 g or just only slightly over one pound!  For discreet street photography, it doesn't get any better than this.  In this regard, A7 probably best approximate the Lecia M9 rangefinder experience for street photography.  Of course, Lecia will sets you back $7000 for body only!One reason for me to pickup this Camera is its ability to shoot many (or should I say almost all) of the legacy manual focused glasses.  Any vantage glasses from the famous last year (Canon, Lecia, Nikon, Olympus, etc) can be adapted to be used on this camera.  If you don't mind working in manual focus mode, these lenses produces very respectable images with classical 60/70/80s flares.  Working with these lenses bought me back to the days when I was learning how to take pictures on my father's Canon AE1.  In fact, I took very first few pictures on this Camera with his 50mm FD lenses.  Although I bought my Camera with a nicely appointed 35mm Zeiss 2.8 lenses, it left neglected in my covered while I was busy exploring one vantage after another.  A7's ability to use these lenses its full frame glory, is nothing short of a revelation.  SONY's ability to focus peak and magnify view finder on the fly, make using manual focus vantage lenses a joy.  In fact, I think this Camera is best enjoyed with small and fast light prime lenses from the 80s.  For example, the Canon FD looks to be made for the SONYs both in style and performance. Lecia glasses are simply stunning both in quality and appearance when mated to the A7.A7 is an extraordinary complex camera with a lot of options.  It is a sad thing that SONY didn't include a manual with the box and the online manual doesn't help but scratch the bare surface of its capabilities.  It will take time, dedication, and no how to master this camera.  Even thought some of the control and menu still feels some what less thought out comparing to professional photography tools from Nikon and Canon.  With this said, a little familiarization and work is all that stood between hours after hours of enjoyment.I find working with A7 is a more deliberate picture making process. This is not good or bad, just different. This again reminds me how I used to take pictures shooting film. With this said, A7 has no shortage of modern gadget appeals.  SONY has a well implemented WIFI application suite which is sure to please many.  Right in the camera, you can establish direct link with smartphone/tablet, upload photos to computer and post pictures to facebook/flickr.  The remote shooting application is intriguing and sure to delight my kids' self addictive generation. SONY also have downloadable applications which you can get/buy to compliment this Camera's appeal.To summarize, A7 is a beautifully crafted piece of engineering marvel and a perfect balance between artistry, gadgetry and nostalgia.  It may not be a perfect camera, but SONY gets my vote for its forward thinking and innovation.", "Date": "March 10, 2014"}, {"Title": "Finally got my a7, worth it.", "Author": "Uncle J", "ReviewID": "ROGHAQ2C4GWIK", "Overall": "4.0", "Content": "After about 6 months of research and waiting, I got my a7, knowing that it is not a perfect camera, but that it is exactly what wanted. There are a ton of reviews of this camera out there telling you the pro's and con's and its features, you can read about them or watch a ton of video reviews, there is no lack of information about this camera on the internet, especially after it was named camera of the year by pop-photo magazine. So to variate from a typical review, I will give you a different perspective from a camera junkie who loves photography and has been doing it for a long time...This camera is targeted to the semi-pro or high end consumer who wants great quality pictures in a small package (you know that already) what I'll tell you is that, as that semi-pro, I'm surprised and very pleased with my new a7. I've been shooting it for about 15 days now, I have the Zeiss 55mm f1.8 and the 24-70mm f4. The zoom lens is great (though it's gotten some bad reviews), but I really like the 55mm F1.8, which couples great with the full-frame sensor on this beast. But since this review is for the a7, I'll focus on the camera it self:In my opinion, the camera really delivers in the Image Quality department, IQ is truly awesome and distinctive, specially if you compare it to other mirror-less cameras. No doubt the best IQ for any mirror-less camera option up-to-date (APR-2014), I had a Canon 5D mk3, (which I eventually got rid of due to its size and weight) and the pictures from this a7 are just as good as the 5Dmk3, in my opinion (without getting into technical details); however, its performance is not up-to-par with a pro-level-full-frame DSLR. This camera has some really cool features, but there are some annoying things that could be improved, like way the camera does auto ISO, the way apps work, and the (sometimes sluggish) focus system. Yet these are things that you can easily overcome by learning how to use the camera and tweaking it your way. Which brings me to another point: this camera is HIGHLY customizable, unlike previous versions of the NEX. Like any DSLR, you have to learn how to use this before you can start to get great shots consistently.The reason why I could not give it 5 stars is because I do not think its performance is optimized. By performance I mean the focus system, the battery life, the time it takes to turn it on, the slow FPS rate, the lack of stabilization-system (in-camera), and the AutoISO. But again, these are things that you can easily overcome.There is a large selection of compact mirror-less options out there, what makes this camera stand out is the large full-frame sensor, which produces some really special shots, better than any other mirror-less option out there. I also have an OMD EM5, which I love, and enjoy much. But it does not produce the quality images that I get from this a7. They are two different cameras, that in my opinion complement each other. Keeping in mind that the Sony FE system is still relatively new, the lens selection will hopefully grow for native mount full frame lenses, but having the option to adapt lenses from other systems and use the focus peaking system, makes this camera a ready-to-go option as well.The camera is easy to use, having had NEX cameras in the past, I feel that this menu system is an improvement, though there is still the need to dig around to find what you want. With the difference that you can customize the a7 to have all the features you use and need assigned to any button you want! Overall the camera feels rugged, solid/sturdy, not too heavy, not too light, VERY portable for a full frame with this type of IQ, and it is a total pleasure to use with just about any lens.There are complaints about the quality of the JPEGs, and clunkyness of the shutter vibration, which may cause camera-shake in long exposures. I recently updated the firmware, which is supposed to improve the IQ of JPEGs, and I really find the quality of my pictures (JPEGs and RAW) very nice, which is the main reason why I got this. Though I have to admit that for my special shots I only shoot RAW, then I work in post production using Lightroom 5, which has worked very well.As far as video, I don't use it often. Yesterday I went to a botanical garden and shot some video of flying butterflies, and I found the video quality of the MP4s in HD pretty decent, the camera does a great job focusing while panning and following moving objects. Again, I do not use the video much, and I'm not a video expert, but it does a decent job for what I've seen so far.Overall this is great buy, for $1600+ (at the time of this writing) it is the lowest priced high-end camera with a full-frame sensor, not to mention all of the features it has and the weather sealing... That's GREAT value! I think Sony will work out the kinks of the shutter noise and other performance issues in a later version of the camera, and me being the camera-junkie that I am, will probably upgrade when that comes out. That is not to say that I would upgrade right away. This is a very capable camera, that is a pleasure to use, and it produces pro-level images. In the end, as much as you love new technology and fancy features, good pictures are NOT taken by a good camera, they're taken by a good photographer! Which is why I really value how the camera feels when I am using it, the more comfortable you are with the camera, the better your pictures will likely be. I know you are reading this as part of your research to help you make a decision, so what I say to you is that: Understand that this is NOT a perfect camera, and that there are some things that a DSLR will do better, but if you want to have a very portable camera, capable of producing pro-level, high quality shots, with a few shortcomings, at a relatively affordable price for a full-frame, then this is your best bet right now. But if you don't mind carrying around a bigger camera, bigger lenses, and you have more money to spare, then there are better choices for you. I hope this helped you get closer to making a decision... Happy Shooting  ;)UPDATE (for HDR lovers):I've had the camera for almost a month now, recently took it to a trip in which I had a long lay-over in Paris, so I decided to go sight-seeing and took bracketed shots of the Eiffel Tower, Notre Dame, and other monuments. Then I put the shots together using HDR software. The results are absolutely stunning! this camera is spectacular for those who love to do HDR photographs. Let me be clear though: Not the HDR pictures that come out straight from the camera, but rather taking bracketed shots at different exposure levels then using HDR Efx pro or other software. The reason why this camera is so good for HDR is because of the different bracketing options, and the amazing dynamic range in each shot, even in low light and hand held (using the 24-70 that has OSS) I got surprising results that I have not had with my beloved OMD- EM5. I am really pleased with this camera.", "Date": "April 1, 2014"}, {"Title": "This is a wonderful camera", "Author": "jro \"JRO\"", "ReviewID": "R1IPUWD7EJ342K", "Overall": "5.0", "Content": "Hi you all. This is an amazing camera. You wouldn't be disappointed. The lens?... is so so. If I would had bought it again, I wouldn't bother to buy the lens. I would rather buy the la ea4 adapter and get the minolta/sony A lenses. I got that adapter and had been shooting the Old Minolta AF lenses with great results. I am not reviewing the camera cause there are plenty of reviews online.", "Date": "March 31, 2014"}, {"Title": "Fantastic Camera, Questionable Front Plate/Mount. Not great kit lens.", "Author": "Robbie Carman \"colorist•online•ed...", "ReviewID": "R2XHPEWEJO81O0", "Overall": "3.0", "Content": "Over the past few years I've collected Canon 5 and 6Ds, and Nikon D600s/800sI have a full frame fetish for sure. Once the A7/A7r were announced I was really excited, the biggest problem I've had with the full frame DSLRs is size especially for travel or quick runs around town.I wanted something easier to travel with, and because these cameras are mirror-less and very easy to adapt to the wide variety of full frame lenses I have  - Canon, Nikon, Rokinon, Sigma as well as a couple true video lenses I have, I was really looking forward to this system.I've tried some of the M34 systems and was left feeling....well not impressed.When I got the Sony I was over the moon, stunning image quality, much faster than expected autofocus, lots of manual control.  OLED viewfinder that was just awesome and a very well functioning semi-articulating screen.While I'm not a pixel peeper, there isn't a lot of terrible bad things you can say about this camera - it's a new class and performs really well.Here are my biggest gripes, that for me have forced me to just exchange the camera.1.  With the Sony Kit lens there is an unacceptable amount of rotational play at the mount.  Now, I'm not talking and inch or something, but the wiggle is there at the mount point. Its somewhere between a 1/16 and 1/32nd of inch.  Yeah I know, a little OCD.2. The wiggle would be fine if it not for the copy of the kit lens I got. The zoom ring is very stiff, which is usually a good thing.  But because of the torque required to spin the zoom barrel, the lens first rotates at the \"wiggle point\" on the mount and then the lens barrel moves. Its a weird feeling, but not a huge deal, but its a detail that I've become obsessed about. Its super annoying and gives me doubts about the system build quality.To be fair, I went to the Sony store and EVERY lens I mounted to the a7 in store as well as my own copy did this. Additionally, their other DSLRS like the A99 did the same thing.  BUT, only with Sony lenses!  If I put an adapter on for my Canon or Nikon lenses no problem at the mount point.  I don't know what to say here. I can't figure out why Sony lenses (not Zeiss) have this problem.Frustrating for sure, as no Canon or Nikon body/mount I have had as ever done this.3.  This is actually my biggest gripe, and I'm not sure it can fixed on the current version of the A7.The front panel (where it connects to the mount) is plastic, not metal as compared to the A7r. With the kit lens and the torque involved to turn the zoom barrel on my copy of the lens, to the right side of the lens mount (when looking at the camera right below the a7 logo) there is a noticeable amount of body flex and an audible \"creak\" at that point. It's like there is a screw loose on the inside of the body itself.The kit lens is light. So while annoying, I could live with it. However when I put some old Nikor Lenses (all metal) on the body or even my newish Rokinon 35mm Cinema lens even with slight movements, the body flexed this panel and gave an audible creak.Sorry, this is not something I want on a $2k kit. I've initiated a exchange with my current setup, however I'm worried because of the torque needed on the kit lens and the fact that the front panel is plastic this will continue with the replacement.Fingers crossed.", "Date": "February 19, 2014"}, {"Title": "Amazed by the image quality and ease of use.", "Author": "Thomas Roy", "ReviewID": "R2XR1KZ6TWDY6", "Overall": "5.0", "Content": "As a professional for over 30 years I have used and owned a lot of camera gear. This camera fills a role like a Leica for me, small and highest  quality. Originally I was going to buy the A7R as my D800E is amazing but decided the A7 was going to be good for handheld and travel work.  I love the camera, I can get sharp images even at low shutter speeds. I bought a voigtlander 21 f4 lens, very, very sharp, but edges and corners are poor closer to infinity. I have 3 contax lenses, the 45 and 90 are leica quality on this camera. The 28 is amazing as well, but better all over past f4, and corners aren't perfect but so good overall that I will probably keep this lens. Focus peaking is magic and makes manual lenses a breeze to use, along with the clarity of the evf for critical focus. I am now buying the Sigma 30 2.8 and will remove the rear baffle to get most of the full frame. That will give me auto focus for stills and video, if that works well I will buy the 19 and 60. Tried the sony 16 but it was really bad in corners and video was grainy.  I have a d7100 which is 24 MP and it is great for sure, no complaints, but the images with great glass on the A7 remind me of my D800E. I sold my Fuji XPro 1, which is a great  camera but handheld it was often disappointing and awful to autofocus but the Sony is better on the street  in practical situations. Fuji actually has better lenses and the xe2 and future cameras will be great but this Sony has a lot going for it and full frame is a big deal. Actually you can now buy a cheap Nex camera as a second body for tighter cropped images and that would be hard to beat.", "Date": "January 3, 2014"}, {"Title": "Killer full frame Camera", "Author": "Alan & Pam Shefland", "ReviewID": "RW62BYJIXA9NS", "Overall": "5.0", "Content": "I had been waiting for a camera like this, a compact inter-changable lens full frame semi-pro beauty with wonderful IQ. I love it. It's not perfect....battery should last longer, more lenses will be welcomed, customer service could be stronger.", "Date": "May 4, 2014"}, {"Title": "Great camera! Sony has hit a home run with this one.", "Author": "albert", "ReviewID": "RED8RD9JWS5KC", "Overall": "5.0", "Content": "To start off, I'd just like to mention that I am not a professional photographer. I am a serious hobbyist traveler photographer, mainly photographing my travel adventures as well as photographing my children's precious moments when I'm at home.I must say, this Sony A7 really hits the bulls-eye for my needs. I used to carry a Nikon D600 with a 24-70mm f/2.8G \"beast\" lens. The complete system was quite cumbersome and heavy but the combination of the full framed Nikon D600 and the 24-70mm lens took absolute stunning shots when I was on the go. When Sony came out with the RX1r, I decided to give it a try and I was truly amazed with the quality of the pictures I was able to take with that camera. The RX1r's ability to take hand held night shots made that camera a real winner for me. Though my main issue with the RX1r was that I was stuck with the 35mm lens. That made the travel photography difficult but as a full frame \"point and shoot\" camera, the RX1r was as good as it gets. Then the A7 and A7r came out and general apples to apples, it looked as if the A7 was essentially a interchangeable lens version of the Sony RX1 series cameras. Being so happy with the RX1r, I decided to get the A7r paired with the Sony SEL2470Z Vario-Tessar T* FE 24-70mm F4 ZA OSS Lens.The A7r took FANTASTIC photos during good light conditions but my main issue was that it was TERRIBLE in low light. At just an ISO of 1200, you can already see a hint of noise in low light conditions and once you bump that up to 2000+, the photos are generally polluted with noise. At 6400, it's essentially game over. As my home is generally not very well lit, using the A7r to take photos of my children only created photos that were generally not photo album worthy. However, the A7r really shines once you slap on a tripod and take scenery shots or when lighting is good. The imagine quality on the A7r is EXCEPTIONAL and the level of detail is top notch quality. The larger MP capabilities of the A7r are utilized very well. But since I generally shoot in low light and only 20% of my shots are scenic, I returned the A7r and got the A7 instead.Image quality wise, the A7 performs MUCH better in low light conditions over the A7r. There is a significant reduction in noise at ISO 2000 and 3200 shots and at ISO 6400, many of the shots I got were still very good.  I generally found that the A7 performed better with portrait shots while the A7r really thrived with landscape shots. The autofocus on the A7r had a tendency to hunt more while the A7 was quicker in focusing, especially in low light conditions. I believe this is mainly due to the fact that the A7 has Phase Detection Auto focus (PDAF), while the A7r does not. Many have complained that the A7 also has a slow autofocus compared to other DSLR cameras on the market but I honestly can't really tell the difference. Compared to the A7r's 36.4 MP, the A7 does have a lower MP at \"just\" 24.3. Though I honestly, I doubt you'll really tell the difference unless you do some serious cropping or you do photography that really just requires high MPs.Exterior wise, both the A7 and A7r essentially look and feel exactly the same. Though the A7r has more metallic parts, like the dials and apparently the body as well, you generally can not tell the difference between them. Both the A7 and A7r are very nice to hold and shoot with. Both feel very fluid and crisp. The A7r does make a bit more noise when taking shots and the A7 is noticeably more quiet. I know some have complained that the A7 is still noisy when taking shots but I don't find it bothersome and I actually quite like the sound it makes. Coming from the Nikon D600, I did find that I had to get used to the layout of the Sony cameras. The menu system as well as the location of certain commands are not where I was used to them being. Though after a few days with the camera, navigating through the camera became a breeze. My only main complaint would be that the \"zoom\" button is a bit of a stretch for my fingers and does require for me to preposition my grip on the camera in order to press is properly.Battery life for the A7 and A7r are borderline decent to poor as you generally would get about 350 to 400 shots before you need a battery swap. I purchase a Wasabi battery charger and extra batteries to solve that problem. I also found the Wasabi wall battery charger much better than using Sony's direct to camera charging system. Another drawback I've noticed is that the start up time of the camera is relatively slow compared to the RX1r and significantly slow when compared to the Nikon D600.I never shoot video with my cameras so I'm sorry to say I can't comment on the A7's video capabilities.Overall, the A7 is a fantastic camera. Granted the A7r had a higher MP, the A7 just suited my shooting needs better (low light shots, portraits, running after the kids shots and travelling shots). Furthermore, even when paired with the larger SEL2470Z Vario-Tessar 24-70mm lens over the standard 28-70mm kit lens, the over all size and weight is still a HUGE upgrade over the significantly larger Nikon D600 and heavier the Nikon 24-70mm f/2.8G \"beast\" lens. The A7 really gave me the flexibility to carry the camera almost everywhere, making it perfect for my travel photography, while at the same time giving me the perfect shots that I look for in a camera, making it the perfect go to camera for me. All that's left is to hope Sony comes out with better and a wider range of lenses soon, which according to the news reports out there, they will.PS: If you see a Nikon D600 and a Nikkor 24-70mm lens for sale on eBay anytime soon, there's a good chance it's mine!I hope this review helps!", "Date": "March 11, 2014"}, {"Title": "Breakthrough camera, but with some reservations after two months of use", "Author": "Wat", "ReviewID": "R3DSOM3DSJGDZD", "Overall": "4.0", "Content": "On paper, I thought this would be the holy grail of cameras for me. In the end, it’s still a truly great camera, just not quite as perfect as I hoped.I’ve owned way, way too many cameras over the years across multiple formats and brands. Olympus, Panasonic, Leica, Sony, Nikon, Canon, Pentax…it’s quite ridiculous. In my defense I always used the cameras for months and not just for a few weeks.That said, my two favorite cameras in terms of image quality and ease of use were the Olympus E-M5 and Nikon D600. For comparison purposes, I’ll just focus on the D600 and keep in mind this isn’t a comprehensive list, just things that make the biggest difference to me (and maybe you).Advantages the D600 over the A7:- Much faster focusing, especially in low light- Better flash metering- Better out of camera JPEGs (this is subjective, I’m simply stating I like the colors and rendering for my tastes)- Better low light performanceAdvantages of the A7 over the D600”- Much smaller and lighter- EVF (I do prefer a high quality EVF over OVF, again personal bias)- Amazing video- Slightly sharper imagesIn the end I sold the D600 and kept the A7. The small size for a full frame camera is truly a breakthrough. It’s small when I want to carry a camera all the time and I can also add the optional battery grip for times I want to use it in the studio for better ergonomics and a more “pro” look (I know it’s silly, but people’s perceptions still matter sometimes).I own the FE 35mm and 55mm Zeiss lenses and both are awesome. I tried out the 28-75mm lens that came with the camera, but sold it. I was thinking of picking up the upcoming 24-70 f/4 Zeiss lens, but for the price, I decided to pick up the Sony RX10 which has a smaller sensor (but still relatively large 1” size) and a very cool 24-200mm f/2.8 lens. They are only $100 apart in price. I’ll save this for the RX10 review, but it’s an amazing camera and make a nice mate to the A7 with the primes.", "Date": "January 30, 2014"}, {"Title": "Best camera I have ever used", "Author": "Mike Bokeh", "ReviewID": "R1T0H6MQUWV4GY", "Overall": "5.0", "Content": "What a delight, this Sony A7 is a photographers dream. Sony is way out front with this. Small, light, compact, tough as nails, brilliant design. The viewfinder is excellent, and I can't wait to see how they improve it in the coming years. The back LCD is the best and brightest I have ever used making back shooting in the sun a real possibility, perfect for astrophotography. The focus peaking is amazing, manual lenses come to life in real environments. Auto lenses get it done, with speed focus and aperture changes instant.I have nothing to complain about really, as usual the menus are good but not great, a few features I use a lot are hidden, and there could always be more programmable keys. Also the inability to cross use the special features like the in camera exposure stacking and HDR with timer is a little annoying. Would like to see less restrictions but I suppose that is what the will put in the next version with more memory. Write speeds on Long Exposure are about equal to the exposure time so the buffer is limited. Continuous shooting is machine gun speeds, I can rip off 10 shots and be back shooting in 2 seconds.Ok, now back to what is great, everything else. Full frame is amazing, with good glass it is mind boggling. And good glass that is manual focus is all over Amazon from Minlota's Rokkor series of the 70's, Quntaray, tamron, Sigma and Leica. Go look find the cheap adapters and see what you have been missing. Sony makes an adapter for it's alpha lenses and that even switches the focus to phase focusing for better results. I haven't bothered with that yet because the chinese adapters are so cheap and work so well even some of the automatic canon stuff will work on this.This is so much easier to carry than a DSLR, and yet the pictures are fantastic, huge, detailed, color rich. The only limitations are your lenses so start saving up. Rented an OTUS lens..my goodness I never knew such imaging was possible. Added Nikon lenses and now a canon EF from Tamron Vi VC with the Commlite addaptor, I will let you know about that auto lens adapter soon.The Kit lens (14-70mm) is actually a blast and I picked that up used as well, no regrets. There are faster sports cameras, but this thing with OSS can really grab anything short of a bullet so don't listen to the detractors. For the price it can do anything. Go buy a Nikon D4 if you are shooting the Olympics for NBC, otherwise use this and get there with twice the lenses because of the lighter weight.I bought an external Sony charger and Sony batteries, they get over 1000 shots RAW+JPG per charge. Buy Sony folks, don't go cheap on this. I do shut off the camera between shots so I get better life than some.Get a fast big memory card for this. I love the internal charging of the battery, it uses a standard Android car charger plug! I use a 64GB Sony class 14 card and am happy, though a faster card never hurts for long exposure work.CONS: Lack of built in stabilization on the sensor and Sony's slow roll out of lenses are both annoying, that being said this is one of the best cameras ever made, a game changer, and the results with good glass are ASTOUNDING. Pro quality, and I have sold stock photos already. 6000x4000 people, for under $2k.I shoot in Shutter Priority or Aperture priority with manual lenses, the AUTO feature is great with the kit lens but obviously defaults to goofy settings on manual lenses. You need to know how to use an SLR to get the results from this. A remote trigger works with my Android phone and hopefully Sony will build it into the Smartwatch 2 at some point. the buttons and dials all work very well, I think the exposure dial is almost perfect, though my Fuji x series does spoil me.You cannot find a better camera if you are looking for an all weather portable pro shooter. Well the A7R is better in some ways at least for tripod work but not for day to day shooting.Low light capabilities of this sensor are unreal. Video is great but huge files and not quite what the most serious pros are looking for in video frame rates perhaps. Still, it works great with a manual lens and puts out Bluray quality. Great headphones jacks and mic jacks!Ergonomics are spot on. Connectors rock solid. Manual programming hot buttons easy to setup. Getting out of zoom in play mode is annoying, but you will figure it out. Most menu items are well placed.So much love for Sony, such a stellar piece of equipment. Run and buy one, collect good glass. Profit.", "Date": "May 31, 2014"}, {"Title": "Overall the A7 is easily the best mirrorless full frame interchangeable lens digital in mass production today", "Author": "customer", "ReviewID": "R18I1X16QQ0X7M", "Overall": "5.0", "Content": "Anyone seriously considering the A7 probably is or was trying to decide between it and the A7R, since there are really no other close competitors (considering all including price). There are very real trade offs between the A7 and A7R, the A7R might be slightly better at certain very specific tasks, but overall the A7 provides better images in a wider range of situations. Contrast and color depth can be especially stunning from the A7, the A7R not so much. But for anyone ready to buy, but just can't decide, RENT each one first! You can probably rent either for a weekend for under $100 (maybe roundtrip shipping included).", "Date": "March 23, 2014"}, {"Title": "Love this camera.", "Author": "JStoltzfus", "ReviewID": "R1J4DM5REYVT0V", "Overall": "5.0", "Content": "Disclaimer off the top: I am not a professional photographer. I'm an obsessed and informed enthusiast.This camera is amazing. And I'm not the first to say so. Go read one of the hundred other review websites where they gush about it. I can't add anything more to the conversation about how good the image quality is or how great it is to shoot with it.Instead I'm posting this review to discuss some of the issues people have raised about this camera.THE LCD DISPLAYA lot of people are upset that it's not a touchscreen. It doesn't bother me in the slightest.With my previous SLR I would check settings on the LCD and then use the viewfinder to compose the shot. Not so with the A7. I rarely use the viewfinder. Instead I do it all with the LCD. This wasn't a conscious decision. It just felt nature. I also don't mind that the LCD doesn't fully articulate, or swing out like some other cameras do. Though it may look a bit curious to only slide out as it does I prefer this. I had a camera with a fully articulating LCD before and I didn't care for it. It required you to fold the display out to swivel up. This means you're looking to the left of your camera. Kind of annoying. I much prefer the simple method Sony employed here.SHUTTER SOUNDI'm fine with it. It clicks at a reasonable volume to me.NO FLASHI don't want an onboard flash. I prefer to shoot in natural light. And if I do want a flash I'm going to buy an external flash and shoe mount it anyway. An onboard flash is a waste to me. I'm glad Sony realized this.LENSESI did not buy the \"kit\" lens, 28-70mm. Some of the reviews on it weren't so kind. Instead I opted to rent a number of lenses, including a Metabones adapter to try Canon and older Zeiss lenses. They were all great. Some didn't allow for autofocus but manually focuses with focus peaking on was as good as advertised. However I had the best time using the Zeiss 35mm 2,8 glass that was specifically designed for the A7. It took fantastic pictures and the profile was so small. I had read some negative reviews about that lens but I loved using it. It's definitely going to be the first lens I purchase.AUTOFOCUSIt is sometimes sluggish in lower light situations. Not horrible but of note.SPOT FOCUSI haven't seen anyone discuss this so maybe it's my problem but I take issue with how you move the spot focus. On my old Nikon I'd half depress the shutter, it would auto-focus on a single point, and then I could use the arrow dial to move the point of focus. That's not how the Sony works. I have to press a custom button first, then arrow the point of focus to the new location, then depress the shutter to auto-focus, and then take the picture. Maybe I'm missing something. But as of right now this does slow me down.THE MANUALWhen I got my first Nikon I read the manual front to back and it made sense. The manual for the Sony A7 was long, robotic, and confusing. I eventually gave up and went to YouTube videos to learn how to use it.ACCESSORIESI got the Sony VGC1EM Digital Camera Battery Grip because I loved using a battery grip with my Nikon. The Sony grip is fantastic but I'm not sure yet how much I'll use it. One of the best features of this camera is it's small profile. The jury is still out on this one.Since my camera got smaller it only made sense that my camera bag should too. I grabbed the ONA Bowery Shoulder Bag. It's beautiful and doesn't cry CAMERA HERE! And though it is small it can hold more than you think.Due to poor battery life of the A7 batteries I also picked up the Wasabi Power Battery (2-Pack).", "Date": "February 20, 2014"}, {"Title": "Low light focus issues and high iso not good", "Author": "Jholmes", "ReviewID": "R3B0CKKQN4X8AW", "Overall": "2.0", "Content": "Like everyone else I was waiting for this camera as if it was my first child..I got the A7 with kit lens. I have been using Panasonic and Sony NEX mirrorless cameras for a few years now as well as some Nikon and Canon DSLRs.Specifically - NEX 5n, 6 and 7. Panasonic G3, G5, G6, GX7. Canon T3i, SL1. Nikon 3200, 5200 and D600.On paper this looks like a fantastic camera and Sony have achieved a remarkable milestone in the Camera industry.But in real life use there are some real concerns with this camera. I am not going to list all the features like most reviews do, which do not tell you about whats important...The first problem I have found is that in any mode with the Camera set to Auto ISO, it is opting to choose really high ISOs. I performed comparisons indoors with lots of bright lighting and in the evening with ample lighting with my NEX 6, D600 and G6 photographing the same objects under the same lighting. The A7 constantly chooses 3200, 6400 and even wildly high numbers like 12800. All the other cameras will use 800 (D600), 1600 (NEX 6), 1000-1600 (G6). Yes the lens is f3.5 but so are the lenses for the other cameras.This is a problem because the A7's jpeg engine is really smudging the picture details at 1600, 3200 and higher.Under natural daylight, it will use ISO 100 mostly but even on cloudy days it won't opt to use slightly higher ISOs whereas the other cameras will detect that there is less natural light and go up to ISO 400.The resulting photos under natural daylight are also not as bright and punchy like the D600 - which shares a similar 24mp full frame sensor. The resolution detail is about the same though. But I can't help notice that overall the pictures are really bland and not any better than my other cameras.The low light focusing is not great either. The Sony NEXs and the A7 will display a green dotted line box when it can't lock focus onto something. This is happening much more frequently with the A7 and less with the other cameras resulting in out of focus shots. Whats the point of having a full frame sensor that is supposed to be better in low light if you can't get the camera to Autofocus in the SAME lighting that m43 and aps-c cametas are able to ?The GX7 and SL1 have awesome low light autofocus.In good daylight the Autofocusing is very fast and accurate - better than NEX 6 and 7 and similar to the G6 and GX7. I have also tried lots of focusing tests with and without the pdaf enabled and like on the NEX 6, do not see a real difference(The NEX 7 does not have pdaf).I did perform some long exposure shots under street lighting and of the stars at 5,10,15 and 30 seconds and they are decent in terms of sharpness and detail, however compared to the NEX 6 and aps-c dslrs, especially the d5200 and d600, the colors are bland and highlights (areas of brightness) are really blown out.One thing that is missing from both the RX1 and A7 is the remote commander option in drive mode which allows you to use a remote to control the shutter which is useful in Bulb mode. Both the NEX 6 and 7 have this. I do not see a remote wire option either from Sony in their list of accesories..so to use Bulb mode you have to turn on the wifi which drains the battery even more and use your phone or tablet...The battery life on this camera is terrible. It is worse than my NEX 6, 7 and GX7. Wifi is off and I even turned off the pre-focus setting.The camera is well built like the NEXs. It is very ergonimic and easy to hold and light and has a substantial grip.The placement of the shutter button should have been on the top of the grip like it is on the NEX 6 and 7. The Menu button protrudes a little too far and is loose and plasticky.Sony's decision starting with the NEX 6 and recent NEX 5x models to not supply a battery charger but instead a usb wire to charge the battery in the camera is just plain cheap.I really was looking forward to this camera but I honestly cannot recommend it.PROS -- Full Frame sensor.- Light, small and well built body and comfortable to hold and carry around.- Wifi works well.- Can select different focus areas.- Better Menu than NEX.- Lots of customizable buttons.CONS -- Auto ISO opts to be too high.- Low light autofocus is worse than lesser cameras.- IQ not any better than lesser cameras.- Not a lot of native lens choices yet.- Battery life is bad.- No builtin flash.- Has same creative style options/filters as NEX 5x and 6 - nothing new.- No Touch screen.- No builtin time lapse or stop motion.- Limited options for shutter control in Bulb mode.**Small Update**- I forgot to mention about the Video..It is not bad but again not bright and sharp like the NEX 6 or 7 and definitely nowhere near as good as on a Panaosnic G6 or GX7. Again, having a full frame sensor you would expect better.- Just for kicks I tried 2 NEX E mount lenses on the A7 to make sure that the High ISO issue is not due to the A&'s Kit lens. I tried the PZ 16-50 that came with my NEX 6 and also my Zeiss F.18 24mm - same problem. I can't believe it. I put these cameras side by side and the A7 constantly chooses outrageous High ISOs !!!- I am going to go to BB and pick up another copy JUST so I can be 100% sure that there is not something wrong with this unit.**Final Update**- I spent most of the afternoon at 2 different BB's. The first had some A7's in stock so I took my NEX 6 and the new A7 and showed the most knowledgeable camera person there the issue - side by side with my NEX 6. Even in BB with all the bright lights the camera was opting to use very high ISO's, while the NEX 6 would never go above 1000. Then the BB employee took a brand new A7 out of a box, put in the battery and the lens...and bam !  The same problem, we spent an hour and tried every single setting - no change. He said that Sony may be setting the ISO higher than normal to ensure clear pictures. But he also noticed that the camera was not only choosing high ISOs but also crazy shutter speeds. Example, the NEX 6 chose ISO 200 at 1/60 of a second at f3.5, but pointing the A7 in the same direction, it chose ISO 800 at 1/160 of a second at f3.5.I then went to the second BB where I originally bought the camera and showed the guy who originally sold me the camera and he also confirmed that the camera is opting too high of an ISO for the lighting conditions. While there we also tried the D600 with the 24-85 f3.5 lens and it would not budge over ISO 800 at all. We also tried the Sony 20mm f2.8 lens - same problem.So there you have it. Actual real world, really verified with multiple copies and multiple lenses.Try it yourself. Take any recent m43/dslr camera set it up side by side with the A7 and you will see these problems.", "Date": "December 1, 2013"}, {"Title": "Great Camera", "Author": "Paul L Randall", "ReviewID": "R3QLKOJA6WJA7M", "Overall": "5.0", "Content": "Most people are raving about the Sony A7r and do not mention this camera. But I think that for the majority of people, even those who rave about the A7r, this camera would be good enough. The full frame sensor produces extraordinary images and I have been able to use the camera successfully with many older lenses, however the Sony Ziess 35mm lens is incredibly sharp. Unless you are making very large, mural size prints, this camera will deliver and you can save the $800 difference in price and buy another lens.", "Date": "May 26, 2014"}, {"Title": "Best Mirrorless Yet", "Author": "E. J Tastad \"ejt\"", "ReviewID": "R32W7O0QJRFVW2", "Overall": "5.0", "Content": "If you are in the market for a large sensor mirrorless camera, the Sony doesn't disappoint.I was fortunate enough to receive an A7 for review shortly after buying one myself.  Since I received this A7 for review, I returned my A7 and bought an A7R, so I could compare the two.What the A7 has that the A7R does not?+ electronic first curtain shutter+ 1/250 max flash sync speed+ much shorter EVF blackout+ much less shutter lag (time from focus complete to shutter opening)+ PDAF on sensorWhat the A7R has that the A7 does not:+ Higher Resolution sensor+ Better high ISO performance in RAW (1/3 stop)+ Better sensor flare resistance+ Metal front plate and mode knobWhere to start with the Sony A7? It is a really great camera. Full frame image sensor for stunning image quality, excellent grip for shooting all day long, light weight for a light pack. What more could I ask for? The only real issue is a lack of lenses for the larger sensor size.Build Quality:I notice the build is slightly on the cheap side for the price, it really doesn't feel any better built than the NEX 6. Paint and feel of the buttons could be a bit better, sealing could also be better around the lens mount and compartment doors. Paint in buttons is sort of cheap looking, not applied that well. I wonder how long grip material will last. That being said, the camera is really nice to hold. The grip is excellent and can easily hold the camera with just your finger tips, although I wouldn't recommend that.Viewfinder:Turn off image review. Again, turn off image review. It is an EVF and the preview image will closely resemble the final image unless you are using flash. Again, turn off image review. Okay, now that I have said that 3 times I will say why. Image review ruins EVF experience. With image review off the EVF is back nearly instantly after a shot is taken and you can frame the next shot. Basically OVF like response. With image review on you are stuck looking at an image in your viewfinder until you can half press the shutter and you lose a second or so trying to get your viewfinder back and another second trying to find your subject again.The EVF is amazing. This is the first mirrorless camera where I use the viewfinder almost exclusively. This is because it is very high resolution and produces a nice what you see is what you get image, and even manually focusing can be done precisely at f/1.4 with the viewfinder alone, no focus peaking necessary.Response time is quick, although there is a fraction of a second delay before the viewfinder turns on when you put it to your eye. Again, try not to think of this as an OVF, instead try to think of advantages given by an EVF and understand its limitations. In super low light for example the refresh rate will drop substantially, but this is in light levels where you have troubles with OVF as well.Autofocus:Much improved over older cameras, especially when using newer lenses (35/2.8, 55/1.8, or 28-70). In mid to low light levels, performance will drop dramatically. The AF assist light in this camera is somewhat helpful in some circumstances with this camera as it is in a better location and not as blocked by the lens as it was on the NEX cameras.Remember to keep contrast on your subject in low light. Taking pictures in low back lit lighting is asking for bad photos and poor focus performance. You need some fill light, use a stand light in your house or a bounce flash if you have one.In good light I get superb focus performance (fairly comparable to my A99, but with much better accuracy). Predictive focusing is still a bit of a problem, but you can work around this with the short shutter lag in the A7 by depressing the shutter button all the way in AF-S mode and it will take the shot nearly instantly after it is focusing, so you can usually get the first shot in focus, which helps a lot.I have had no issues with accuracy, if you are having problems it might be your technique. Select a smaller flexible point size (see the book) so it doesn't overlap the background, use the Eye AF (defaults to center button, but you can change it, only works if face detect box is visible around subject). Try to avoid strong back light if there also isn't some contrast on subject. Try not to lean into or away from subject (or make sure they don't sway) while using a lens like 55mm f/1.8 with extremely shallow depth of field.Performance:I could basically shoot as much as I wanted without hitting buffer limit in RAW. Obviously if you shoot bursts or very high rate shooting for a long period of time you will have issues. With Image Review off, EVF performance is excellent and blackout is minimal.Battery life is poor, keep an extra or two laying around or use a USB battery pack to top off your camera when it isn't being used.Image Quality:Excellent, but not as good as A7R. The A7 RAW image quality is not quite at other Sony 24 MP full frame sensor levels, but is close. I think the sensor loses a bit of performance for added PDAF support and appears to have similar performance to the A99, but 1/2 stop better because it has no translucent mirror that the A99 always shoots through. If you use the LAEA4 you should see similar performance to A99. I have no issues with image quality.  The A7 has an issue where if the sun or bright light is in the frame you will get some additional reflections from the sensor, and this is greatly reduced with the A7R.Controls/Customization:The camera is extremely customizable. You can adjust about 10 different buttons to almost any function. I would suggest spending a couple hours going through every menu option. First set one of the buttons to act as a help button, and then you can press it on every menu item and read what it does (basically same information as in book, but much handier). After you learn the camera you can assign the button to something useful again.The menus are a huge improvement over the NEX, but still kind of a jumble. If you are used to the A99 they combined many of the photo and video functions on the same menu pages which is highly confusing, but at least they are linear and you can go through them pretty quickly, unlike the NEX.The shutter release is a soft touch shutter, and it is very sensitive. Try not to bump it. I think most people will really like the feel of a soft touch shutter after you have used it for some time. Positioning is a problem for some people, but if you have an old 70s/80s film camera they are almost in exactly the same spot. I have no issue with it, and actually like it.Bottom Line:This is a really great performing camera. It is 2nd best in mirrorless class image quality (A7R taking the lead), and a really nice set of professional level features. All it needs is more lenses, and Sony is promising a lot of those as soon as they can. Get the A7 vs the A7r if you want a quieter shutter with faster flash sync speed and a bit faster focus system in good light. Get the A7r if you want higher resolution, a little better build materials (front plate is mag-alloy instead of plastic) and slightly better high ISO image quality when viewed at same print/web size, and presumably video quality is a bit better on A7r too.If you shoot with older lenses the A7 is amazing. With the full size sensor you get a lot better performance out of the older adapted lenses on the A7 due to the lower resolution requirements vs APS-C, and the focal lengths look as they should with no crop factor. The size of the body is perfect with the mid to small sized SLR lenses.I have never been so happy with a camera purchase.  If I was being hyper critical I would rate it 4 stars, but for a review on this site I don't think that is fair, it is a 5 star for sure.After using both cameras extensively, they are the same camera body, with very different uses.  The A7R is definitely the landscape/detail oriented camera, and the A7 the more general purpose and event camera.", "Date": "January 15, 2014"}, {"Title": "A specialized, \"artisan\" camera - huge improvement over NEX-7 - nothing else like it for SLR legacy lens users.", "Author": "Jefenator", "ReviewID": "R1JEVO1D76ON9Z", "Overall": "5.0", "Content": "I could write 5000 words about this, but my main point would be: if you enjoy using old 35mm SLR lenses in the wide-to-normal range, this camera body is a total no-brainer. I used to enjoy the NEX-7 with legacy glass, but going full-frame makes an enormous difference. Obviously the viewing angles are wider but the coarser pixel grid also makes it much easier to achieve critical detail. The EVF is vastly improved, as is the control layout and menu system (though the latter still has room for improvement). I'm also very pleased with the lower noise, better low light performance and truer colors. If you want bells & whistles, there's WiFi & NFC connectivity.The more expensive A7r offers more resolution and less plastic. I'm perfectly satisfied with this cheaper unit. It feels plenty sturdy, is more forgiving on old optics and also gives you the electronic front curtain for the shutter, which quickens response and cuts down on noise and vibration. (The one thing I do miss from the NEX-7 is the more \"snappy\" feel of the shutter.)", "Date": "March 10, 2014"}, {"Title": "An amazing camera but not quite perfect - Firmware update makes big difference", "Author": "Colin Brown \"Colin Brown Microsoft MVP\"", "ReviewID": "RH98GI97TSGJD", "Overall": "5.0", "Content": "Perfect?The Sony A7 is a new breed of mirrorless DSLR.  Yes Sony and other manufacturers have done mirrorless DSLR's in the past, like the NEX series, but they were all APS-C cameras. What is making people sit up and take notice about Sony's new A7 series is that they are full frame (35.8x23.9mm sensor as opposed to APS-C at 22.5x15mm).The A7 features a lightweight magnesium alloy and composite weather sealed body.  The body is about half as large again as the NEX 3 but about 2/3 the size of a normal DSLR, a lot thinner and quite a bit lighter weighing in at a paltry 474g (just over 1lb) including battery (but not lens).Most of the back of the camera is taken up with a 1.23 million pixel, 3 inch tiltable (84 degrees up and 45 degrees down) LCD.  Unfortunately the LCD does not swivel, only tilts and there is a slight problem with the tilting as well. When you tilt the screen fully forward, the camera will no longer sit flat when you put it down.  Another thing I don't particularly like about the LCD is that it is not a touch screen. Sony, please take a leaf out of the Canon playbook and make your screen touch sensitive. I'm so used to having a touch screen and it comes in handy in so many situations that going back to a non-touch screen seems almost painful at times. Especially when you are trying to move the focal point. On my Canon you simply touch the screen where you want to focus and that's it, simple and quick. Now do that on the A7....The A7 sports a full complement of buttons and dials as you would expect from a camera in this price range.  All the main dials are within easy reach when shooting and the exposure compensation dial I love. Very easy to reach with your thumb whilst shooting.  The front and rear dials vary in function by what mode you have the camera in although both can be programmed to have different functions if you wish.  There are also 3 programmable buttons (the third also doubling as the trash can button). You can also program the down switch on the directional controller as you wish so really there are 4 programmable buttons available to you to set up camera functions the way you wish.Another major highlight for me is the 2.4 million pixel (yes you read that right, 2.4 million pixel) fully electronic viewfinder which sports a 0.71x magnification.  This is just such a joy to use.  The viewfinder has sensors so that it automatically switches off the LCD and enable the viewfinder when your face gets close to it.  The viewfinder displays all the information you could want (as with most other things on the A7, this is programmable so you can display the information that you wish) and in the center is the best leveling system I have ever used. It's a breeze to make sure the camera is level is any and all of its axis. The viewfinder is very crisp and sharp and because its an electronic viewfinder, shows you exactly what you are shooting.  Adjust the ISO and the viewfinder reflects the change.  Adjust the aperture and the viewfinder reflects the change. It is simply a joy to use.I've read of people saying that the A7's shutter is loud. Personally I haven't found that its much louder than my Canon or Nikon DSLRs. There is a electronic first curtain shutter mode you can put it in that reduces the noise of the shutter if you do find it loud.  This eliminates the need for the shutter to first close, then open again to start a new picture. Instead it starts with the shutter open for live viewing then electronically gating the sensor to start the exposure, the physical second curtain shuts to end the exposure and take the picture which gives you only a single curtain sound. As I said however I don't find that the shutter is that loud to start with, but this is an option you have in your arsenal that you may employ in a studio environment.  I've taken portraits and asked the models if they thought it was off-putting or too loud and nobody said that it was.Sony has come out with a new iteration of their Bionz (I have no idea if Bionz is short for something or really means anything) processor, the Bionz X. Coupled with the 24 Megapixel full frame sensor, makes for a formidable team, but there are some problems with it.When you put the camera in fully automatic mode, even in good light, the A7 will almost always default to ISO 6400 and will adjust the shutter speed to compensate, rather than taking the ISO down.As a quick test one thing I like to do is take a picture in good lighting then import it into Cyberlink Photodirector and hit the auto correct function for white balance to see much the Photodirector thinks the image is off.  This is by no means a scientific test but it gives me a good indicator of how good well balanced the shot is.  Over time I've found that my Canon is about 10-13 points off, my Nikon has a slightly greater range being 10-15 points off.  I took a few shots over different days and therefore different lighting conditions with the A7, imported them into Cyberlink (JPG, not RAW - more on that in a bit) and found that the Sony crushed the other being off on average only 3 points.  The auto white balance on the A7 is almost perfect.With the new Boinz X processor, Sony has decided to compress both the JPGs (which are compressed anyway) and also their RAW (ARW) files.  Unfortunately there are very few programs at the moment that will read Sony's new ARW RAW files.  Adobe Lightroom 5.1 being one of the only ones except for Sony's native programs (playmemories and Image Data Converter).  Cyberlink have indicated that there will be an update to Photodirector to support the new files, so for the moment, I hope you like Adobe Lightroom.  You can Use Image Data Converter to Import the new ARW format and export them as a TIFF to import into other programs that don't support the new ARW format. Image Data Converter however is an extremely slow program.This leads to one of my major gripes about the A7, the over processing of JPGs.  I went out and took some pictures of a particularly nice cloud formation. One of the JPGs was compressed down to a size of 1856K, another one (the only difference being a different aperture setting) was sitting at 2944K.  When you look at the pictures and zoom in they are just over processed. The JPGs have lost a lot of detail, especially in subtle graduations that often find in clouds and the sky (something I love to shoot, along with sun rises and sunsets).  Setting \"High ISO NR\" to off slightly alleviates this problem however you end up with really rough images when shooting at high ISO, so you have to remember to turn it back on again, which takes you back to losing detail in subtle graduations.  I think Sony have gone too far in processing files to reduce noise to the detriment of JPG files (this isn't a problem with the RAW files however Sony are still compressing their RAW files a little much for my liking and you are back to the problem of not much software at the moment supporting the new ARW files) and this is something I'd love to see corrected in a firmware update for the camera.  Now in saying that, when shooting landscapes or portraits this isn't so much of a problem, so don't think its a killer for the camera because it certainly is not, but something that to me Sony does need to do something about.Low light shooting with the A7 is good, mainly I think due to the extra light that is captured with the full frame sensor.  I had no problem shooting crisp, clear pictures in a karaoke bar setting which was very dark, had strobe and disco lights going and a smoky atmosphere. The only problem that I did face was that sometimes the autofocus would not lock on at all or took a little long to focus, so I simply switched to manual focus however this was a fairly extreme situation.  My canon however focused with no problem in this situation. In other night or dusk situations the auto focus worked fine.The A7 comes with built in wifi and you can download apps for the iphone, iPad and Android platforms to take advantage of this. You can easily transfer photos from the A7 to your phone or tablet and also use your phone or tablet as a remote to take pictures.  I particularly found this feature handy when shooting the moon with a long lens (1300mm) as the slightest movement would blur the picture, even when set on a good heavy tripod. So I just setup the shot and used my iPad to take the pictures without having to touch or disturb the camera.  Sony has also gone down a new path in that you can download applications to the camera for different effects.  If you have a wireless network setup in your house, you don't even need to connect the camera to your computer to do this, you can do it all in the camera itself. Some of these applications put back functionality that was removed from the A7 but was present in the NEX line of cameras, like partial color, a feature I loved to play around with on the NEX (Basically you can select a certain color, red, blue or whatever and that is the only color that will show in the picture, the rest of picture is black and white.  You can get some good artsy shots using this).  Some of these applications you do need to pay for however.  When you connect your camera to your wireless network, chances are that you have some sort of password that you will need to enter, this is pain to do on the A7 and again another reason why I would love to see a touch sensitive screen on it.This leads on nicely to the battery.  The A7 takes the same NP-FW 50 battery that you find in the NEX line.  Whilst this battery gave you good battery life on the NEX line, it does not on the A7.  You will quickly find your battery draining. You can put the camera in airplane mode (turn off wifi) which will help prolong the life of the battery but on average I was getting around 300-340 pictures from a full charge. For this reason you will definitely want to invest in extra batteries for the A7 (if you have an existing NEX then you will already have one lying around).The A7 does not have a built in flash but has a multi-interface shoe to attach one (or external microphones or a host of other peripherals).  I didn't find this a problem for the most part as it does shoot well in low light situations but chances are you will need to get one sooner or later.  The Sony HVLF20M external flash comes in at around the $150 mark.Sony is investing heavily in its e-mount adapter and as such all the new cameras Sony has recently announced take e-mount lenses including the A7 series.  There are two types of E-mount lenses, the older NEX style which are APS-C and the newer FE full frame E-mount lenses. If you have an old NEX then you can use these lenses with the A7. When you attach a lens, you can put the camera into one of three modes.  Auto detects which type of lens you have and adjusts the picture according, giving you either full frame mode, or cropped APS-C mode.  In APS-C mode the focal length will increase by 1.5 times and resolution will drop to only 10 megapixels.  So although the A7 will take NEX style APS-C lenses, why would you want to attach these to the camera.  Even the NEX 3 has a 16 megapixel resolution.  The last mode will use the full sensor and resolution but you will obviously get severe vignetting in your pictures (basically it shoots as a circle in the center with black borders).What you want is the new FE lenses.  Sony has announced that they will produce 15 FE lenses over the course of the next year and there are currently 5 on the market including a beautiful Carl Zeiss 55mm f1.8 lens.  Next month Sony will launch a 70-200 F4 FE zoom. One thing you will notice is that Sony native FE E-mount lenses are expensive.  The 55mm lens comes in at $1000 and the 70-200 will be coming in at $1500.One of the biggest benefits of the A7 however is that you can attach virtually any lens you want to the camera with the correct adapter.  If you want to attach Sony A mount lenses you can with the LA-EA4 adapter.  If you have existing Canon EF full frame lenses hanging around, you can attach those with the Metabones Mark III adapter.  Adapters aren't cheap weighing in on average at $400 each, but that's a small price to pay for being able to use your existing collection of lenses.There is so much to say about the A7 that it is hard to put it all down in a short review but I hope I've managed to touch on most of the points you'll be interested in.So in answering the question I posed at the start, is the Sony A7 (this is a review of the A7, not the A7R which I don't have) the perfect camera?  It is a wonderful camera and due to its weight and size is a great piece of kit to carry around with you, a lot lighter and smaller than a standard DSLR. I now carry the A7 virtually everywhere I go (you never know when a good shot will present itself). Image quality if superb for RAW images and even JPG's are very good (depending on what you are shooting and whether you need or want to zoom in and crop afterwards) and battery life is little on the short side.  So in answer to the question, unfortunately no, the A7 is not the perfect camera, but its very close.I would give the A7 4.5 stars but unfortunately with Amazon's rating system you cannot. It's worth more than 4 stars but is just shy of a full 5 stars.Update 1:  Sony has just announced that they will be coming out with a firmware update to the A7 and A7R on March 19th which may mitigate some of the shortcomings that I felt the camera had.  The update should include faster startup times (which weren't too bad), better image quality (main shortcoming for JPGs), faster Auto focus and more.  I'll do another update once I have the new firmware as see if anything has changed for the better.Update 2 :On 19th March Sony released v1.02 of the firmware for the A7/A7R cameras.  First off, I'm very happy to see Sony taking an active approach to their new line of Mirrorless cameras.  It's normally quite unusual to get a firmware update this close to a launch of a product.The new firmware update resolves a number of problems including reducing start-up time (which weren't that bad to begin with), adds support for the newly released 70-200mm FE lens, adds support for some additional Playstation Memories apps and the big one, improves image quality.IQ was one of the big things that I noticed and pointed out in my review above, especially with regards to JPEG's.  The compression seemed to be overly aggressive and the resultant loss of detail in your pictures was noticeable.  This was especially true if you were shooting with speed priority continuous mode (third shooting mode down after single and continuous in the settings).So have the updates made any difference?  The answer is a resounding yes.  Startup times of the camera are slightly improved, especially when you turn the camera off then immediately back on again.  I've not tried the new Playstation Memories apps yet but image quality in JPEGs is very much improved.  This has resulted in larger JPG files but I will gladly trade off the extra space for more detail.  I haven't noticed that much difference, if any, in the RAW files.  They still appear sharp and laced with detail even though they Sony is using a compressed RAW image format.I would still recommend shooting with RAW (I personally use the RAW+JPG) and using those files for your images, but I still use JPGs especially to quickly transfer to my phone or tablet and send to someone/post whilst I'm away from my computers.  The increase in the quality of the JPEGs is noticeable to the point that they are now useable.One area where I especially noticed this was when taking sky/cloud shots and sunsets.  So comparing shots taken with firmware 1.02 against the original 1.00 release, there is marked improvement.Overall then, kudos to Sony for releasing this firmware patch so soon after the camera's initial release and I hope they keep updating and tweaking the settings and releasing firmware updates in the future.The A7 is still not a perfect camera (see review above, especially with regards to no touch screen) but it has made a great leap forwards. As such I've changed my rating to reflect the changes with this firmware update.", "Date": "March 3, 2014"}, {"Title": "Great Camera for the Serious  Hobbyist !!!", "Author": "Computer Bob", "ReviewID": "RJ689V8OZNF5K", "Overall": "5.0", "Content": "First Let me tell you were I am coming from.  I would consider myself as an advanced hobbyist.  By profession I am a computer programmer so the latest in tech is what impresses me.  That is why I am drawn to Sony.I have owned several cameras ranging from a Canon T1i to a Sony A55.  My latest was a Sony A77.  The Sony A7 is by far my favorite camera.Now that you understand where I am coming from, here is my review.BATTERY: This camera does use a small battery.  It does this to keep the size of the camera down.  If you normally shoot 1,000's of photos in a single day, this problem is easy to fix; just purchase extra batteries and a charger.SHUTTER SOUND: I have read several reviews and have seen several videos about this camera.  If this is all that you can find wrong then Sony really does have a hit.  I really do not find the sound offensive in any way.VIEWFINDER: I have grown to love the EVF.  It shows so much more information to the photographer through the viewfinder.  It shows levels, histograms, parameters and guide lines.  It shows what the picture is going to look like when it is saved NOT what it looks like in real life.  This way you can see when it is out of focus or under or over exposed or the white balance is off.  I prefer this viewfinder over an optical one.  I will never go back.MENUS: This camera has several different menu styles. I am sure that you can find one that you like.CONTROLS: There are a lot of controls all over this camera.  It takes some getting use to.  I found it difficult at first to locate the controls in the dark but I am now getting used to there locations.  Almost all of the controls are customizable to your preferences.LENS: I purchased the kit lens with my A7.  It seems to work just fine.  It is tack sharp.  I think that prime Zeiss lenses would be better but they are too expensive for a hobbyist.  I am glad they are there for the serious professional.  I am looking for a 18-300mm travel lens.  But I am having a hard time finding one in a full frame housing.  I am a little disappointed in the available adapters that adapt other brand lenses to the A7.  The videos show very slow focusing speed.  I am looking into the Sony LA4 adapter so I can use A-Mount glass but most do not have stabilization.A7 vs A7R:  I really thought about the decision between an A7 and an A7R.  I decided on the A7 for focusing speed.  Most of the videos about the A7R were by serious professional photographers with expensive manual focusing lenses.  I think that is a great choice for them.  They will have the ultimate in picture quality.  But my camera needs to be a jack of all trades camera.  I also take pictures of little children and animals on the run.  I need fast focusing.  My A7 does great outdoors.  It is definitely faster than my Canon t1i but is very slightly slower than my Sony A77.  It is still usable.  It is my recommendation to get the A7 if you are getting a camera for use in all needs.  Get the A7R if you are a landscape photographer that has a massive budget for prime and very expensive lenses for the ultimate in picture quality.  24MPix is plenty for my needs and I play heavily in Lightroom.LOW LIGHT:  This camera is amazing in low light.  I can take pictures with the kit lens inside with no flash.  I do not even need one.  (I would need one if I were doing portrait work.)  I get clear images with a shutter speed of 1/30 and an ISO of 3200.  That is unheard of from my A77.In conclusion, I would highly recommend this camera for the serious hobbyist.  I would give it 5/5 stars.------ Update (high zoom lens) --------I have been trying to find a high zoom lens for my A7.  I have several choices:1.  Go with a Sony A-mount full frame lens with an adapter.  The length and weight of this combination is a real concern here.  The purpose is for a travel lens that is easy to pack yet gives me 'decent' but not perfect quality.  I would go with this is a were a shooter for a magazine.2.  Go with Canon/Nikon/Leica glass with an adapter.  Again length and weight are an issue.  I would also have to put up with slow or manual focus.  By the time I got focus, the deer would be gone into the trees.3.  Use Sony E-mount lenses.  Here I have to deal with the crop factor (images are 3936x2624 pixels; plenty for my purposes).  I decided to sacrifice a little quality for travel convenience.  First I tried the Sony 18-200 LE lens.  Sony has disabled the in-lens stabilization in this lens and have done this for almost all for their e-mount lens when used on an A7!  This is not good for shooting hand held at 200mm.  I returned that lens and got the Tamron 18-200 diIII lens.  The in-lens stabilization is NOT disabled here.  Image quality is NOT perfect nor tack sharp at 100% magnification.  It is good at normal magnification.  It is not very good indoors as it has slower glass.  It does a good; although not perfect; job outdoors.  I would recommend this solution while we wait for a full frame e-mount solution from Sony.  The Tamron lens is about the same size as the FE24-70 kit lens that came with the camera;  so it is very good from a portable standard.  Focus is also accurate and quick.Conclusion:  If you need perfect quality get a Zeiss prime lens.  If you need portability and are willing to sacrifice a little quality the Tamron 18-200 diIII lens is a good choice while we wait for another Sony alternative. I do NOT know why Sony has disabled OSS in most of their e-mount in-lens stabilizated lenses when mounted on an A7, but Sony has.  Sony has confirmed this with an e-mail to me.", "Date": "December 8, 2013"}, {"Title": "A7 review from a previous Nex 6 owner", "Author": "Rohit Surya", "ReviewID": "R2PB38YDR0RB75", "Overall": "5.0", "Content": "There are lot of reviews with good technical and professional information so i will keep it straight forward. I used a canon eos m, olympus EPL5 and sony nex 6 before moving to full frame. The nex 6 in particular is an excellent camera when paired to a good glass but the cost for a the body and few good lenses was almost the same as the A7.The A7 is an excellent camera for anyone who is looking to move up to full frame. If you are like me who wants best quality and is a pixel peeper i am sure this camera will not disappoint you. Get the Zeiss 35mm FE lens and you will be happy for a long time. This is a good combo to go One camera, One Lens for one year. Im sure by then the FE system will be matured with more lens options and you will be a master of the 35mm focal length and can branch out to more if needed. I have used every single DSLR in the market and a few more mirrorless cameras from my friends and this system works best for my needs. If you are in a similar boat i hope my review helps you!Good luck!", "Date": "December 13, 2013"}, {"Title": "Impressive camera with loads of potential", "Author": "Shane O. Laake \"camera nerd\"", "ReviewID": "R3Q8Q3P2A6DAW3", "Overall": "4.0", "Content": "The A7 is a tough camera to review these days as it's really the start of a new system, yet it's compatible with so many others.  In that vein I'll examine the camera and it's own ecosystem (itself a work in progress) as well as the immense possibilities the compatibility offers.  Ultimately, your mileage will very based on your uses.I was surprised to see a not too bloated box, as some Nikon kits are much bigger, and while the camera and to a lesser extent the lens is smaller than a full frame SLR, the relatively compact package was a plus.  The camera itself makes a great impression, and while I read the A7R adds a bit more to the build, this body holds it own.  It's also compact in absolute terms and positively so in full frame terms.  Sadly the camera foregoes a built in flash.  That's disappointing, though not entirely uncommon (unfortunately) in full frame bodies.  My initial fears of the angular body impeding comfort were unfounded, and while my large hands prefer a larger grip (available but not yet evaluated), it's not much worse than a SLR without a grip added.  Ergonomics are good, though different than what I'm used to from my D90 and X-E2 (no surprise).Sadly, the grip brings up one of the challenges to this system: everything is so gosh darn expensive.  The body and kit are relative steals, which is great, but everything else (fortunately Sony abandoned proprietary memory formats years ago) is high, even compared to what I'm used to from Nikon.  The only flash costs a ton (it seems well equipped, but even then $100 overpriced), lenses are limited, but like earlier systems they are pricey compared with other first party offerings, and even a battery charger is extra.  In short, the camera itself is a great value, but if a complete setup is in the cards, do yourself a favor and price the full setup.In regards to using the camera, the menus again are different than what I'm used to, but honestly none of the major systems have usability down, but all are serviceable.  I never was happy with JPG output, despite trying a few things in the settings.  I did enjoy the large EVF, and the oled's quality and refresh rate allow me to avoid yearning for a true SLR.  The eye sensor however was a disappointment.  It was too eager to switch on and off, and it may in part contribute to the meager battery life.  In use the poor battery life (especially in light of not having a flash) joined the poor (and odd) auto ISO behavior.  Granted auto-ISO is a luxury coming from film, but it's a staple and powerful tool in digital, and the tendency to stick to 1/60 without the ability change the shutter setting.  The WiFi capabilities seem stout for studio shooters, but it lacks the ability to leverage a smartphones GPS.  I didn't use the apps, which appear limited.All in all most of the above pales in comparison with what this camera excels at.  It takes damn good pictures.  As noted before I wasn't thrilled with the JPGs, but I love what I get with RAW.  High ISO is amazing, detail is great, and the 24MP sensor doesn't overwhelm glass the way 36MP can (it can however challenge most lenses).  The included lens delivers good results stopped down, but the lens begs for a slightly better option.  For now the native solutions are limited and pricey.  I've yet to try the Zeiss options, but they get favorable reviews (as they should for the price).  In the longer term the first party lineup will expand, but I wonder what 3rd party options will exist.  Sadly there is no other full frame mirrorless (excluding Leica), so manufacturers will need to design primarily for this mount.  Granted full frame SLR lenses may be modified, but they will be bigger and not benefit from the inherent advantages of a lens designed for a short flange distance.Adapters open up a whole new world, and frankly this camera is the universal lens recipient.  It can take virtually any lens.  ANY LENS!  It can AF (and auto aperture) with any Sony, Minolta, and many Canon autofocus lenses.  That's A mount, E mount, FE mount, and EF mount.  Wowzers!  As with most mirrorless bodies, you can forgo autofocus and aperture and mount many more lenses, so that opens up the rest of the lenses out there.  The fact that full frame lenses keep their relative focal lengths is a huge plus, and lenses designed for cropped sensors still benefit from a 10MP cropped mode (which you can override--another plus).  The manual focus assists, including one of the better peeking implementations make manually focusing possible, even for those who never had to do that before.  I tried out a Nikon G adapter and 50mm and 85mm primes.  Ultimately I see this as a nice to have feature and a bridge to a better native lens lineup, but many users may see this as a powerful core feature or something they never use.If Sony can deliver a solid lens lineup, cheaper accessory options, and enhance the firmware a bit (especially auto ISO), this is a 5 star camera.  Likewise, if you're looking for a full frame camera to use great MF lenses on, this is a 5 star camera.  For now, I'd say it's a 4 star camera at its core, and one of the most impressive cameras I've ever used.", "Date": "January 25, 2014"}, {"Title": "Finally allowed me to stop using film", "Author": "Hudson Gardner", "ReviewID": "R1M10PMZC1L3ZB", "Overall": "5.0", "Content": "For years I have been using film cameras of various kinds, from point and shoots to Leicas. I have stuck with film because of the range of tones and light that it allows, and the diminutive size of the cameras that yield unparalleled results.The only competitor film has, in my opinion, are cameras with \"full frame\" sized sensors and larger, and even these were not true competitors until 1 or 2 years ago. Since this camera has the best sensor currently manufactured, it is literally the bleeding edge of image quality, and in dynamic range and sharpness it easily destroys 35mm color negative film, and is on par with, but still surpassed by, 120 aka medium format film.Most people who shoot film these days either scan it at home with a Nikon Coolscan (discontinued) or at a lab ($$$). I have been a member of the former group for years. However, I recently realized that with a good macro lens and a camera such as the Sony, it might be possible to get rid of the scanner, and I began to realize how much the scanner (now over a decade old technology) was limiting the results I was getting. The digital noise the scanner created during scanning was f888ing up my results. I had two options: go digital, or learn how to make color prints. Digital didn't seem to be an option.. then the Sony came along.I was surprised by the quality for the size. I was interested in the RX1 when it appeared, but wanted the flexibility of selecting my own lenses. The A7 allows me to do just that, and in fact I am using the same lens that I have used for years, a Voigtlander Nokton 35mm f/1.4. This camera is tiny with the lens mounted (smaller than a Leica), and the lens still gives the \"analog\" rendering I am looking for (read: imperfect).Now onto the IMAGE QUALITYThe images that come from this camera blow me away. Once processed properly, they are seriously indistinguishable (and a lot better than) film. If I want them to look hazy and grainy, I shoot at F/2 and underexpose. I add some grain PP. Result: indistinguishable from what I shot with my Bessas and Leicas.If I want medium format-esque images, I just stop down a bit. About highlights: I have yet to blow the sensor out with highlights. Unbelievable.HANDLINGI don't use AF lenses on this camera.It responds very quickly, I can turn it on and by the time I bring it to my eye it is ready to rock and roll.The EVF is great. Manually focusing with it takes practice. Tip: turn off focus peaking in extremely contrasty or backlit situations, as it will just screw up your focusing. Leave it on LOW for most of the other time. Set peaking level to C2, and it will become second nature to flick it on and off.Final question: why can't sony make it possible to sleep the camera without turning it off? The EVF keeps the camera turned ON when one is carrying it on their shoulder, as the proximity sensor in the viewfinder \"detects\" your side as if it were your eye. Oh well.", "Date": "February 11, 2014"}, {"Title": "Svelte Full-Frame Goodness", "Author": "Kort \"Art, Music, Book & Movie Enthusiast\"", "ReviewID": "R2NSUV2O4EQCUE", "Overall": "4.0", "Content": "The short version:Sony's compact, full-frame, mirror-less, interchangeable lens camera body, with a respectable kit lens, produces wonderful photos. Its performance isn't always quite on par with similar DSLRs and doesn't have many dedicated lenses available, but it is smaller and priced more competitively. It can also make use of a broad range of legacy lenses from other camera systems, making it quite versatile.The long version:The Sony a7 is the lightest and smallest full-frame sensor, mirror-less, interchangeable lens, digital camera currently made. It is a first, and as such, has some growing pains. But on the whole, it is an amazing, fairly compact camera system -- with a full-frame sensor! You get DSLR-like performance with this more compact package in most instances. Aside from improved overall responsiveness (speed between shots and focusing) and image quality, what this means for the uninitiated is that you'll get a much shallower depth of field, especially when the subject is close and the aperture is low (open). This is ideal for portraiture and creates very pleasing bokeh (out of focus background elements). The a7 produces much less noisy images than compact digicams in low-light conditions as well.Camera aficionados and photography experts are more likely to know what they are getting when they choose this camera and may be reading these reviews just to see what other user's experiences have been. I'm preface this review by saying this is my first full frame DSLR style camera. I've been shooting with SLRs since the 80s and have owned a wide range of digital bridge and point-and-shoot cameras (including other Sonys), but never stepped up to a digital model -- though I have used them. I recently purchased a Fujifilm X-S1 12MP EXR, and aside from the longer range of its fixed lens and some aspects unique to it, and I have to say that the a7K surpasses it in almost every other aspect. The menu system here is a bit more complex than on point-and-shoot models, but a power user wants that in a nearly $2k full-frame body. I'm sure that there is better glass out there, but I find the provided 28-70mm kit lens quite good. As it now stands, there is a limited selection of lenses made for / optimized to this camera (4 currently), so if you want maximum flexibility, you would probably want to go with a full-frame Nikon or Cannon body. They will be significantly larger though, not mirror-less, and likely more expensive. Also, with adaptors, the Sony a7 can make use of any number of legacy lenses you might have laying around from your film SLR days. You will have some cropping issues, but this is a wonderful option to have.The a7 has a TON of neat features and options I could comment on, but will try to be brief and speak to the basics. I will likely revisit this review after further use, and when I have the opportunity to use it with different lenses. So from the perspective of a first time DSLR user, here are my likes and dislikes:PROs:* Exceptional image quality. The 24MP CMOS sensor is fantastic and produces good JPEG images and even better RAW files.* Exceptional build quality. This camera is solid in the hand and has some weatherproofing.* Respectable kit lens for the cost, though I wish it had a bit more zoom.* Top-notch HD movie capture in a variety of formats and quality options. Built-in microphone and headphone ports.* Great ergonomics. The a7 is a pleasure to use. Yes, there is shutter noise, but there is something very satisfying about that 'click' when you snap off a shot.* Extensive customization options. I've still not fully explored every setting this camera has to offer. Auto mode will produce good photos, but the a7 shines when you customize the settings.* Very responsive. While startup times vary and previous DSLR users may find them tad slow, focusing, shot-to-shot and read times are impressive (with a fast SDHC card - I recommend the SanDisk Extreme 64 GB SDXC). This may not be the ideal camera for a dedicated sports photographer, but I've had good luck shooting my daughter's night soccer games. The focusing system is superior to that of the a7R.* Bright, hi-res, 3\" tilting LCD. I wish it swung side to side as well, but it still adds flexibility when shooting. The a7 also offers a very accurate on-screen electronic level.* The 100% coverage, 2.4M dot OLED is what I prefer for shooting. It's an amazing digital viewfinder and is proximity activated.* In camera battery charging. Some may complain that the a7 doesn't come with an external charger, but considering the price of the camera, getting a 3rd party external charger with 2 extra batteries is quite affordable (and recommended - mine is the Wasabi Power Battery (2-Pack) and Charger).* 24.3 MP resolution. That's enough pixels to allow for cropping and high quality print images. A low enough pixel count to make the most of the sensor, work well in low-light, and not have (overly) unwieldy file sizes. I prefer this to the 36.4 MP of the a7R.* Cool Sony mode options such as Panorama and HDR, just to name a couple.* Wi-Fi and smartphone connectivity.* The option to use any number of lenses made for other camera with the purchase of the proper adapter.CONs:* No built-in flash.* Lack of lenses built to make the most of the a7's sensor. As of this writing, there are only 4, but more are promised soon. Sony E-Mount lenses are compatible, but there is some cropping.* The multi-level menus can be a bit complex until you are really familiar with this camera.* Autofocus is usually accurate and fast, but not always and less so in low light.* I've found battery life to be decent, but not on par with similar DSLRs. You want to have backups for a full day of shooting.* With the provided 28-70mm kit lens, it's not ideal for macro photography.* It took me a while to get iPhoto to recognize the camera when attached so that I could directly download photos. You'll need to play with you connection settings in the menus.Who isn't this camera for? Those looking for a pocketable camera, folks on a tight budget, serious sports photographers, or previous full-frame DSLR users expecting the same quality and speed that they are used to in this compact body.I'm really enjoying using the Sony a7. It looks, feels and acts the part of a high-end, well designed, quality modern camera. As a person who has primarily used bridge cameras and smaller digicams over the course of his digital career, I'm quite happy with the manual focus kit lens Sony provides. I wish the 28-70mm lens was slightly faster and had a little longer reach, but given the a7's 24.3 MP sensor, I can crop a bit if need be. It has thus far been very versatile, performing admirably for portraiture, landscapes, sports and close-up photography. Video too! It will be months before I've fully explored all that the a7 with this lens has to offer, but I can safely say than for it's performance, form factor, flexibility and cost, it is the best camera I've yet to own. As I mentioned before, two items you may want to immediately purchase with this camera are a fast and large memory card, and additional batteries with a charger. Both of those items set me back under $100. A camera bag to hold your equipment is a good investment as well. For the a7, a good budget option is the Evecase Universal Black/Grey Large DSLR Camera Travel Case/Bag with Strap. For those looking to use 3rd party lenses with the a7, keep in mind the added cost of the adapters.I'm giving the a7 4 stars for it's minor imperfections, but in reality I \"love it\", so perhaps should have given it 5. For the sake of objectivity and quick reference, I'll stick with 4. However, I have a hard time imagining anyone who has only used fixed lens digicams up to this point not loving this camera and the photos and video it produces. More demanding photographers may feel differently, but good luck finding a new full-frame body AND kit lens anywhere else at this price.~ Kort", "Date": "February 6, 2014"}, {"Title": "In mirror-less cameras, this is one heck of a pro-camera at consumer prices", "Author": "Stuart I. Riley", "ReviewID": "RCATENIZFPKKX", "Overall": "5.0", "Content": "Okay, if you are into photography, but want more than point-and-shoot, or step to full-frame digital, Sony's A7 and A7R should be something to consider. I am not a professional, but have used many professional setups as an amateur. I believe the technology has caught up with simple to use, and yet elegant gear. Although not expensive, it's certainly not cheap. This camera is solidity built as many models costing 3, 4, or up to 10 times as much.  It's only down-fall, if any, is its size for those who have big hands or who want the big feeling bulk of DSLR camera gear.  I am impressed with the amount of manual to fully automated ways to use it while acknowledging quality along the way.", "Date": "May 19, 2014"}, {"Title": "Amazing camera....", "Author": "Confucious", "ReviewID": "R3TDDNQDX8SA8S", "Overall": "5.0", "Content": "This an amazing camera and a first full frame camera for me. I've only owned good ole' point and shoot cameras and then upgraded to my first DSLR, a Canon Xti. This camera is night and day compared to the Xti. While you can't really compare them the A7 is beast on its own. Upon opening the box I noticed how small the body is. It is small and light. I thought it would be too small for my big chubby hands but once I held it was a nice fit. It felt like I have total control of it. The button layouts are a bit different on the camera. Especially the shutter button. It reminded me of a retro camera that had the shutter buttons on top. It is not a touch screen so not a big deal since my xti wasn't either. I like to start messing with the camera and trying to figure out what does what. Then I go to the manual and start checking it out. This helps in familiarizing yourself with the camera and its button functions. The camera itself is really great. Mostly have been using it taking snap shots of my kids. It takes really beautiful and sharp photos. I'm able to print poster size prints for the home and they are super sharp. First time I have ever been able to achieve that. You can take video as well which is great. I remember lugging around a camera and a camcorder trying to get the both of both worlds. Hated that the camera had video functionality but was lacking and vice versa with the camcorder that took photos. This camera can do both well. Excellent capability of taking great video. Although it takes them in 29 minute sections I only use no more than 5 minutes to capture my kids moments. The camera can start a bit slow starting up compared to what is available today. I'm not used to having my camera turning on quickly either as I had an xti. The camera has built in wifi as well. What is great is being able to see photos taken from the camera and view them on your phone to quickly share moments with friends and family. Now I have to purchase a bigger hard drive to make space for all the great photos that I have on my computer since after all this is a 24mp camera. Overall this a great camera that took a bit of learning due to the layout of buttons and being used to the canon xti interface. I would highly recommend this camera.", "Date": "February 27, 2014"}, {"Title": "New school meets old school!", "Author": "MTurney", "ReviewID": "R3CUM801Z6I9MS", "Overall": "5.0", "Content": "This is a fantastic camera. There are numerous reviews out there which you can easily find - see DP Review, DxO, and Luminous Landscape to name a few. But what I want to convey is that for the first time since film, I feel I am excited again about photography. Being able to use my old Minolta glass with the Fotasy NAMDT Pro Minolta MD MC Lens to Sony NEX E-Mount adapter and Sony A7 is wonderful and makes for unique images. My latest wedding shoot has an 'analog' look, even though I am well aware of the full-frame 24MP digital technology actually capturing the light. I couldn't be happier as a working pro and lover of light writing!", "Date": "June 7, 2014"}, {"Title": "Awesome!", "Author": "halfmonkey", "ReviewID": "RSGV5O20J0TWN", "Overall": "5.0", "Content": "O love this camera. Sure there are some things that I would modify or improve or change but no electronic device is perfect especially when considering how fast the manufacturers update the products. WIth that said, I'm still very happy to own this camera. It's a light weight full frame camera with direct controls. It takes beautiful pictures and I have it matched with the Sony 55mm 1.8 FE lens. I don't want to lug around a 4 pound plus camera system when I want full frame and this camera is nowhere near as heavy as the canikon full frame cameras.", "Date": "June 2, 2014"}, {"Title": "Very nice but not the battery", "Author": "Niu Zhaoqun", "ReviewID": "R1I3UXO9NVHMJ2", "Overall": "5.0", "Content": "Pro:Image quality with kit lens is good enoughGood low light photosGood focus speed in good lightCon:Battery! You need a grip for sure.No charger come with it. You have to charge the battery in body.I don't think it is very weather sealed", "Date": "February 26, 2014"}, {"Title": "Wonderful compact full frame camera", "Author": "Arthur O. Fritz", "ReviewID": "ROK5J2FG5XJG9", "Overall": "5.0", "Content": "So I have had this camera now for almost 2 months now.  For the \"cheaper\" model I could not be more happy. I have tested out the kit lens to do some portraits in a studio and I am actually surprised on how nice the images came out.  A little soft, but still very acceptable images.  I have read reviews about people being upset that it does not handle low light well or they are upset that it does not come with an external charger.  If you are going to purchase something that is going to cost you this much money, then you should probably do a little research and figure out what is going on like I did.  I knew what it was coming with and what the limitations were before purchasing it.Pros:- Great way to get started into full frame image quality- Amazing low light capabilities (slow AF though) Focus manually!- Very portable and lightweight- Beautiful image quality (using other lenses)- Seeing what your image will look instantly after changing settings since it is a mirrorless camera- Phase detect AFCons:- If you plan on buying the grip, just know that you cannot charge the battery with the grip on.  You need to remove the grip, install the battery back in the camera and then charge (unless you an external charger)- Shooting in a studio with strobes...when you dial in settings and stop it down, it will get dark and you cannot see anything.  When you go to focus it will light back up and re-focus (sometimes not what you intend to focus on).  If you put it in manual it will not light up and you cannot see what is going on.**edit**So going into the settings and changing live view will disable this- and of course the battery life.  300-400 shots on average.  Most people carry a spare so not that big of a deal.- Not good for fast moving subjectsAgain, I knew the limitations of what I was getting into when I bought this camera.  It is not stopping me from taking pictures by any means. I love the camera and am still giving it 5 stars because of the image quality.  I have the kit lens, 35mm 2.8 and 55mm 1.8 and I get excited everytime I go to look at the pictures I have taken with both of my Zeiss lenses.  I know this may not be nearly as in depth as some other reviews, but it is short and to the point.  Hope you enjoy the camera as much as I do!", "Date": "February 4, 2014"}, {"Title": "SonyA7 camera", "Author": "Angelica T. Alfaro", "ReviewID": "R1R5SA5IRFLA2Q", "Overall": "5.0", "Content": "The camera arrived within 48 hours!  Everything included just as seller described.  Camera brand new & in mint condition!  Nice thank you Note from seller!  Camera is well built, solid and nice looking!  Has buttons to customize to your programming.  I am using one of the buttons to zoom in pictures on the LCD screen, awesome clarity. Menu easy to follow. Weight & size very good!!  This is one of the reasons I bought this camera!  Great for traveling!  Now I don't need to carry all my Nikon gear.  I am watching a lot of tutorials to really learn the settings, so I cannot give a thorough review....right now, until I actually go out and try it out,  mind you I am just a hobby photographer!  I am really excited to be able to use some of my nikon lenses on this camera with the metabones nikon G to sony nex adaptor ($139). I have taken a few day shots and the clarity and color is quite impressive!  So far I love this camera!  I was going to buy the Nikon 610 but this A7 is cheaper, lighter, smaller, & almost does the same thing!!!!  However, I will always be a Nikon fan.", "Date": "March 19, 2014"}, {"Title": "A good studio and portrait camera", "Author": "Tri D.", "ReviewID": "R36LQ9VT8X4USV", "Overall": "5.0", "Content": "The A7 is better suited for studio and portrait. It's a great camera to use everyday as well but definitely not for sports action or telezoom. There's no telezoom lens until April and it's only 200mm.If you buy the A7/R with the Zeiss 35mm, 55mm and 24-70mm then you will have a solid system for portrait, studio and walk around system. You will probably be able the take the best pictures you've ever taken for something this compact.Pros1. Amazing Picture Quality especially in RAW(ARW new format). Update your software to read this format. IQ higher than 5DMK3 but lower than Nikon D800.2. There are dedicated dials for aperture, shutter and exposure. No messing around with menus.3. Great EVF. The eye detection works great. It will turn off the screen and turn on the EVF when you put your face up on it.4. Hybrid AF has decent PDAF especially in daylight. Much faster and more accurate than any of the NEX series. Slower than my 5DMK3 and Nikon D800.5. Available Zeiss lenses are some of the best on the market regardless of what system you compare to. Check DXOmark to confirm.6. Very portable with the 35mm7. In camera usb charging. Great for traveling because there's one less thing to lose/carry/forget.8. NFC is convenient to quickly sling photos to your Android devices. Apple devices uses wifi which is also fast but a little less convenient.9. SD memory slot actually support UHS-1 speeds!! finally! My Nex 5R was severely handicapped because it only supported Class 10.10. Full Frame sensor. Compared to APS-C Nex series: less noise, more picture, etc...11. Video quality looks great. It has continuous focus and works well. Quality is higher than a Nikon D800 but lower than the 5DMK3.Cons1. Slow AF low light compared to DSLRs2. Battery life is short. Buy extra batteries and external charger!3. Bigger lens can throw the balance off and make it easy to slip out of your hands.4. Shutter vibrations confirmed to blur pictures under 1/160. Keep shutter speed 1/160 at least. Recommend 1/250.5. Very limited FE mount lens selection. You can use other E mount lens but most lenses will force you to crop.6. In camera usb charging. Charge time unacceptable ~5-6 hours.7. No dual memory slots.8. AF too slow to be effective for sports or anything fast moving.9. Scene modes doesn't work that well sometimes because of shutter vibrations. I don't think most people will be using these modes anyways.10. Annoying squishy feeling shutter button. There's no click to it at all.11. No touch screen. Don't understand this decision. I want a touch screen because it makes videos a whole lot easier.I don't see a point in reiterating what many reviews have already said so I will just answer the most common questions and misinformation. I will also update more as I go.The high ISO problem in Auto mode and shutter vibrationsFrom what I've researched, these cameras have sensor shakes due to the shutter impacts. Anything slower than 1/160 sec shutter speed will show up in the picture. It is easily noticeable when you are at 1/60 and below. I highly recommend you use 1/250 or faster speed. I normally choose higher shutter speed anyways since the 55mm and 35mm does not have OSS. But OSS does not eliminate the shutter vibrations, just the hand shakes problems. So regardless of what lens you use, use high shutter speed.I honestly don't see much IQ degradation from ISO 320 to 1600 due to noise or details. It's when you hit 6400 that it becomes a problem. The sony A7/R will still have better IQ at ISO 1600 than an OMD EM1 at ISO 320. I wouldn't call that a con.In manual mode, auto iso should work properly if you choose aperture and shutter speed yourself. It should only come up with the correct ISO or the picture will be too bright. The complaints here sounds like people moving up from enthusiasts cameras and not fully knowing the professional side. Auto everything doesn't work and you don't use it. Pros will use some auto settings but not fully auto. The most common modes are aperture priority, shutter priority and manual. The high ISO problem also disappear when you turn off DRO. I prefer HDR over DRO anyways.If you buy this camera and pair it with good lens like the Zeiss 55mm and 35mm, then most of your problems are solved. You will actually get better IQ than a 5DMK3 with a 50mm 1.2L(I have this set up as well so I know). The 5DMK3 will have better AF, AF speed, and much much longer battery life though. Depending whether you are shooting from a Tripod or not, your choices are clear.The battery problem.We don't have much choices here. I hate the idea of a compact pro camera that can only get 340 shots. The good news is there is actually a battery grip. The bad news about that is it adds more bulk, weight and kind of defeating the whole purpose of being compact.However, I do like the added bulk of the grip. It does balance out the camera when you use bulkier lens like the Zeiss 55mm. It also gave me better grip and I feel more confident about not dropping it. Having 2 batteries does give me roughly the same amount of shoot time as a 5DMK3 with no battery grip. The bonus with the A7 is that it is still lighter and less bulky than the 5DMK3.It cost about $250 and there's bundles here for $250 with some accessories with a half decent SD card for back up. I would pick the one with the wall battery charger. I hate the in camera charging for obvious reasons.Good luck and I hope I answered the questions.I wish I could rate the camera as 4.5 stars. It seriously meets most marks. What it lacks is battery life(easy to fix) and good native lens collection(takes some time). There are only 4 FF Zeiss lenses but they are amazing. The 55mm Zeiss($1000) rivals the $4000 Otus for Nikon. I highly recommend you use the Zeiss 35mm and 55mm lens with this. It's actually relatively cheap compared to its performance.", "Date": "March 6, 2014"}, {"Title": "Not for kids/action", "Author": "DH", "ReviewID": "R36TUK7NAW6RDH", "Overall": "4.0", "Content": "I have two small children whom take up 80% of my photos.  I bought this camera in order to save some weight and space for family shots mainly while chasing them around, and to have the capability of taking some nice photos for framing.I'll get the bad out of the way first.  The AF system is nowhere near competitive with a dSLR.  Particularly true in lower light situations (hanging around in the house).  I tried both the Zeiss 35 and 55 lenses, and while they created some very beautiful shots, most of the time I found I was fumbling around with focus trying to lock on.  In well lit conditions, it was not as big of a deal, unless the subject was moving.I actually ended up returning the camera due to this reason, as I found it just did not suit my needs.One other gripe - lenses.  I think as of now there are only three available.  The kit zoom and the two Zeis primes.  This will undoubtedly change in the future, but there definitely needs to be more native lenses for the camera to make it attractive to serious shooters.  Yes, you can use adapters for other lenses, but at the cost of performance in most cases.  Also, the two primes are very expensive.However, I dont want to leave an all bad review because I think this camera is an important step in the right direction for photogs.  The build quality was great, and in my opinion the physical design was beautiful.  Coming from a D700 Nikon, the grip felt a little small for my liking, but not so much so that I didnt feel like I had a sure grasp on it.  When focus did manage to lock when I wanted it to, this thing takes amazing photos, as it should with such a great sensor paired with those two (very expensive) primes.I would imagine if you do a lot of landscape or still shots, this camera would be perfect for your needs.  However, if you take any action shots or have small children who move around a lot while you're shooting (particularly in medium to low light), stick with your dSLR (or invest in one).", "Date": "January 27, 2014"}, {"Title": "Replaced my E-M5!", "Author": "Ambercool", "ReviewID": "R2MFO9FVEK58U7", "Overall": "5.0", "Content": "I thought that this camera would supplement my E-M5, because I love Olympus glass and camera bodies.  Once I paired the 35mm Zeiss to the A7 for street shooting I was stuck with it.  It was raining terribly in NY for 2 days and everyone hid their cameras away when it started to rain.  I still kept my A7 out and continued to shoot.My only complaint with this camera is that it doesn't have the amazing dust and sensor cleaning as the E-M5, and the shutter is really loud.  People definitely know I'm shooting them and in NY it's normal so no one really cares.", "Date": "May 14, 2014"}, {"Title": "Game changing camera, subpar kit lens", "Author": "Mike", "ReviewID": "R3T5L7RVYHBYOF", "Overall": "4.0", "Content": "I wish I could give the camera 5 stars and the lens 2.  I took off one star for Sony shipping this with a kit lens that is subpar for this level camera.  I won't go into a long review but I disagree with the DPreview website who claimed this is one of the best kit lenses they've tested.  The lens itself is not up to the task of being mated to a full frame 24MP camera.  It is soft at wide open apertures and it has moderate to heavy chromatic aberration near the edges.  The Sony software (both their raw developing tool and the in-camera JPEG's) process the photos to fix the chromatic aberration automatically so that might be what is complicating the reviews since the processing is made to hide the poor performance of the lens.  In the end though the processing, while it tries to address some of the lens issues, adversely affects image quality at the same time: images are just not as sharp as they could be with a lens that is good optically and doesn't require all the \"massaging\" to eliminate problems.The camera itself is a beauty!  I've not been a Sony fan in the past but I am now with this camera.  Controls are laid out in a very logical and usable fashion.  IQ and high ISO performance are fantastic (if you stop down the lens a bit).  I did not run into the auto ISO issue posted by another reviewer: I find the ISO speeds chosen by the auto ISO to be right on par with what needs to be used for the given lighting conditions and focal length.  It chooses an ISO speed that is appropriate to get the needed shutter speed based on lighting, aperture, and focal length of the lens (more tele zooms require higher shutter speed).I do find that Sony overprocesses both JPEGs and raw files (with their raw software) particularly at high ISO.  At anything over about ISO 3200, there is so much noise reduction being applied that some edges look almost like smeared clay.  The way to avoid this and get the best IQ is to shoot raw and use a third party raw developing tool that is compatible with the A7/A7R like Qimage Ultimate or Lightroom.  There you can decide what type and how much (if any) noise reduction to apply after developing the raw photo.  The camera appears to produce fine noise grain and not a lot of chroma noise which is nice because the grain is easier to deal with and can be preferable over heavy noise reduction that waters down edges and detail.Overall I believe this camera will be a game changer.  There are a multitude of benefits when you lose the age-old mirror and allow the main sensor to actually SEE what it is shooting!  You get better exposure control and far more accurate focus: gone are the days of front/back focusing due to the focus sensor being a separate sensor from the image sensor.  Having come from a Panasonic GH2 and having used (briefly) an Olympus OMD-EM1, this shoots like a full frame version of those cameras but with better control layout and ergonomics.  It just needs a bigger selection of lenses, particularly an \"affordable\" zoom that is of better quality than the kit lens.", "Date": "December 2, 2013"}, {"Title": "Great Camera", "Author": "Phil", "ReviewID": "R3LAM5CD7VFVQ6", "Overall": "4.0", "Content": "I am giving this camera 4 stars because to be 5 it should be excellent in every way. The camera just rocks all around with only a couple minor nit picks. I will say I am happy to report that the FE 35mm focuses great and even in dim light at 6400 ISO it is still reasonably quick. I think most people miss the fact that you need contrast in an object for contrast auto focus to work especially in low light. My only issues with the camera are when reviewing or playing an image it takes a second or two for it to enlarge after you hit the enlarge button, not sure why. Second, is having to run through a couple button pushes to access the af area to be able to move the flexible spot's location. Not a huge deal and maybe there is an easier way I haven't found yet. Otherwise I knew everything I was buying into so am obviously okay with other known negatives like battery life, not a big deal, buy a couple extras and you're set.-------------------- Update after 2 weeksI just wanted to clarify an issue. I stated that it took a couple seconds to enlarge an image while previewing. This was actually due to the fairly large raw file and my sd card having a slower transfer rate. Glad it's not the camera anyway.", "Date": "December 17, 2013"}, {"Title": "love it", "Author": "E. Smith", "ReviewID": "R3SVHW10MFQMBE", "Overall": "5.0", "Content": "I was previously using all Nikon cameras and with an adapter can now use those on this camera (no autofocus with that particular adapter). This takes some getting used to b/c it is so much smaller than the Nikons (D200, D5100, and D700) that I have - but that's a good thing for the most part. I sometimes fat finger a switch or put it into bracket mode - but other than that I love it.The battery life isn't great and it fills the buffer pretty quickly (even with 45mb/s cards).The images quality is fantastic for what I shoot, and amusingly I get positive comments on the shutter sound (not sure why).The autofocus on it is a little weird compared to the Nikons, but works great once you get used to it (it has a lot of neat facial/smile/etc recognition as well, if that is your thing).The tilt out screen and what you see is what you get while shooting is really nice. The tilt screen allows me to shoot much lower, without crouching as much, and the lightweight camera/lens combo with that means less back strain after a day full of moving around shooting.I am contemplating getting rid of my other cameras and just having this one.", "Date": "January 27, 2014"}, {"Title": "Full-Frame Glory!", "Author": "rbhatta \"A Dinosaur you can trust!\"", "ReviewID": "R3IXVAYBY8QDBR", "Overall": "4.0", "Content": "There are number of good reviews already shared by Amazon customers on this product, I will try to keep this review as non-redundant as possible while still trying to share my experiences.  To give you a background, I am not a professional photographer by any means but I do have passion for photography & love reviewing new gadgets.Over the years, I have come across several sub-compact point & shoot also some high-end digital SLRs from Canon, Fujifilm & Sony as I have access to them via Amazon for `production build' reviewing purposes and have shared my thoughts with Amazon community with several unbiased reviews in the past after thoroughly testing them from an engineer's point of view.Having said, here is the review for Sony α7K, It is going to be a long review. Feel free to comment & explore any sub-topics you desire or read my overall impression in the end of this Sony α7K review.Look & feel - Comfortably solid! - 4 stars!---------------------------------Sony has this camera body with `retro' looking edges. At first you feel the look is from the past by-gone era but honestly, the design grows onto you pretty fast with easy to learn intuitive menu system & placement of buttons. I had no problems in getting used to the camera. The customizable buttons feature makes it even better if you do not like a function assigned to a specific dial. Sony has done a tremendous work with the shape & size of this camera. This camera is way less bulky than most DSLR's that I have owned in the past. Sony α7K feels very comfortable in hand. The grip is sure; comfortably solid, the body is magnesium alloy with dust and moisture sealing giving you peace of mind - one could not ask for more!Electronic View Finder & Articulated 3-inch display - Very useful! - 4 ½ stars!-------------------------------------------------------------------I love both these features, while I prefer optical View finder (Too much to ask for this price range) this EVF is pretty darn good on this camera. It is 'XGA' quality presented using OLED with 2.4m-dot precision and 0.71 x magnifications. The clarity on this 'EVF' is superb and is found more or less centrally located on the camera body. Also, by using the 'EVF' the camera is close to your body and at eye level facilitates very stable shake free shots. The 'EVF' does allow you to get excellent quality preview of the exposure but tends to become little bit grainy in extreme low lit conditions but still usable. Having said, if you do not like 'EVFs' then there is an articulated 3-inch display with 921k-dot pixel resolution which can be tilted so that you can compose shots with camera raised up or below waist level effortlessly. BTW, this is not a touch screen display but the menu buttons icons make you want to touch them as the display is that brilliant. Shooting video is a pleasure using this excellent LCD display.Full HD 1080p Video Recording - Excellent quality! - Full 5 stars!---------------------------------------------------The Sony α 7K features full 1080p video recording either at 1920 x 1080 (60p, 60i, 24p), 1440 x 1080 (30p), 640 x 480 (30p) both in MP4 & AVCHD formats; the included microphone is stereo but also allows for headphone & microphone jacks for even better input or monitoring. Video quality is pristine and allows full manual controls while shooting video. The video quality is top-notch making it very compelling to use instead of an additional bulky camcorder. You definitely can create professional quality video using this camera with minimal effort.Sensor & Auto-focus - Slightly faster AF than a Sony α7R - 3 stars!-------------------------------------------------------Sony α7K Full-Frame 24.3 MP Interchangeable Digital Lens Camera with 28-70mm kit lens supplied uses a `Hybrid auto-focus' system using on-chip Phase detection & low-pass filter making this camera little bit faster in real-life auto-focus tests when compared with the 36.3 megapixel big brother Sony α7R. While the more expensive Sony α7R is geared towards professionals who would benefit from the large 36.3 megapixel sensor for incredible details. This 24.3MP sensor is perfect for an individual who likes to take casual footage under well lit conditions or one who can accept reasonable response time needed from the auto-focus system to capture those precious moments in full-frame digital glory. In this case 24.3 MP is still pretty incredible detail for such footage's and is whole lot cheaper to own than a Sony α7R. This camera Sony α7K was not designed for capturing sports footage or fast moving objects as Auto-focus still is slow at best especially in 'low-light' conditions.Shutter noise - Subjectively quieter! - 3 stars!--------------------------------------The Sony α7 with the included kit lens actually sounds more like Sony NEX series which in my opinion is much quieter than Sony α7R; this is primarily because this camera uses different exposure technique wherein the physical shutter is already open for live view and merely gates the sensor down electronically to start the exposure. In this method all you hear is single brief `click' of a single curtain sound. Sony α7R also being a tad slower than Sony α7K making the sound last longer which we perceive as louder in my opinion. Having said, it does not mean you can conspicuously take photos and hope that no one notices you - You will get noticed when you hear that satisfying clack that a Sony α7K makes.Picture quality - Very good! - 4 ½ stars!-----------------------------While most general users of this product will find picture quality incredibly outstanding in all respects especially in lower sensitivities with the included kit lens. Having said, the beauty of the image sensor can be put to better use by opting better lenses. For example: A Sony SEL35F28Z Camera Lens which definitely will cost you more but will give you sharper images. Using the included kit lens, RAW files compares well with most other high end DSLRs like Nikon at same levels of sensitivities. The JPEG mode however has some undesired post processing especially with images with high ISOs. Most users probably will never notice it till you start zooming into pixel levels but worth mentioning it.Battery, USB cable & charger - Average - 3 ½ stars!---------------------------------------Battery life is average at best. It does seem to eat batteries somewhat faster than most DSLRs I have owned. Also, the idea of charging battery internally in a high-end camera like this will make some camera enthusiasts unhappy including me. I wished Sony included a regular wall charger and an `extra battery' in the kit which accepts batteries directly for charging rather than having to plug your camera to charge the battery. Having said there is an upside to this, you can charge your camera anywhere there is `USB port `availability - granted it will take forever to charge with 500mA output available from your PC. The included 2.1A charger works well but cumbersome to use with the short cheap looking USB cable they provide in the kit.Flash - `No Flash' included in the kit - Zero stars!---------------------------------------This is by far the greatest oversight on Sony's part for not including a simple `basic camera flash' on the body of the camera. Granted the camera is very good to capture images in low light conditions it just does not make sense to provide a `hot-shoe' and not give you a basic flash in the kit for the price you pay. Having a built-in flash comes handy every so often. This is by far the greatest disappointment for me.Overall impression - Very good! - 3 ½ stars!================================The base specification is impressive so are the features. Picture quality is really very good with rich details even when zoomed to max in post processing; I am not saying Sony α 7 with the included kit lens is perfect but very close to perfect. The excellent grip and intuitive revised menu system facilitates taking good pictures with less learning curve. The availability of sophisticated third party lens adapters opens up whole lot of new possibilities to experiment with. If you opt for better lenses you can definitely make it a whole lot better camera. The ease of use especially noting the smaller and lighter compared to most other cameras of similar specifications makes up for the difference. This overall is a good product no doubt in that.Amazon does not allow me to rate 3 ½ stars and just to be fair and generous I am rating this with 4 stars! Hope you agree. Feel free to comment, criticisms are welcome :-)", "Date": "January 23, 2014"}, {"Title": "BIGGER IS DEFINITELY BETTER!!", "Author": "Dan Vang", "ReviewID": "RJNJF6WH7N5FO", "Overall": "5.0", "Content": "By far the best small compact camera out there!From the first photos I've taken, this is an awesome camera.  I really wanted a camera that could take low light pictures in our home and out and about without using fill flash.  Taking pictures of our two year old son on even the Samsung Galaxy S4 camera, which is a great cell phone camera, there was a lot of motion blur and shutter delay where we would miss the \"moment\" in the picture.Very low noise at ISO 6400, which is unbelievable as my old Canon 40D probably would go to ISO800 for similar noise levels.  Don't even think about using my other camera Sigma DP Merrill at ISO above 200 (different beast altogether).If you are looking for a high iso, low light, then full frame certainly delivers!  Will never go back to APSC, and don't even think of M4/3, which for a few hundred bucks more than the OMD1, you can get this beauty!  Sometimes bigger is better!The only qualm I have now, and have yet to figure out, is how to get the wifi and nfc working with my SG4 and computer. It is trickier then it seems to be stated...", "Date": "December 7, 2013"}, {"Title": "Sony is stepping up", "Author": "steve", "ReviewID": "R2LWB6T0SOWGBX", "Overall": "4.0", "Content": "I am a Canon user currently have 1Dx and 5DIII for studio and outdoor photography.I was looking to buy portable and good image quality just like an DSLRs for everyday use so that I can take photos of my 1 yr old son and street photography with easy access. I was about to buy Canon SL1, but Sony announced full frame small body few months ago. So I decided to wait for A7 since spec looks very promising.When It finally came out, I purchased Zeiss 35mm with A7 body which created excellent combination. Folks, this is the one~!!! Its not a perfect camera(I'll say better than the most DSLRs for small body) but this camera just make me want to take it everywhere I go. I also took this camera to shoot some Wedding photos and pictures turned out to be nice.  Also I love how WI-FI works so that I can transfer images to my iPhone with few clicks without the USB wire.  This means I can post images right away to my Facebook or homepage~ After having Sony A7, I look at other people that carries Huge DSLRs or even something small like Canon EOS Rebel, I kinda laugh at them because my A7 is full frame with smallest body~! I can carry my son on right hand and have my A7 on left hand~ hahaha SO MUCH EASIER compare to 5DIII or 1Dx (Duh~)Even though, probably most of regular consumers are turned down because of A7's price range.  YES! Its expansive, but for Full Frame Sensor with small body, Its a deal for me~!!Second, most of people doesn't even know what is full frame sensor anyway....so maybe for regular consumers or for starting off photography people may better off with other cheaper DSLRs. I recommend  NEX6 or 7 for Sony and REBELs or SL1, 7D, even 6D from CANON.I love this camera, but I am giving 4 stars because there are so many spaces can be improved to be perfect.(Well, nothing will be perfect..)  I guess Sony just down graded few or left out  because they will release next version every year even though they are capable of doing it...MAKES SENSE for business but not cool for consumers...", "Date": "January 11, 2014"}, {"Title": "Big IQ in a small package.", "Author": "A. G. Smith", "ReviewID": "R335MVWOTTJKBC", "Overall": "4.0", "Content": "Operational speed is not quite you can get out of a top of the line DSLR.This camera is small and light enough to take just about anywhere.USB charging in the camera is a god send.  I can charge from the wall, computer, laptop, USB connection in my car.Battery life is on the short side.  Around 300 shots on a charge with Wifi disabled but that seems acceptable to me.No dedicated charger included was a bit shocking but the batteries are compatible with the NEX line so if you have one that charger will work.This camera utilizes the same battery that is used in the NEX 5N.", "Date": "January 24, 2014"}, {"Title": "AWESOME Camera", "Author": "David Strom \"dnstrom\"", "ReviewID": "RTWZRGFKSQPU6", "Overall": "5.0", "Content": "Love this Camera, Upgraded from a NEX 7 and I love it.  Love the older type of menus rather the the funky weird NEX 7 menus.I'd recommend this to anyone wanting a full frame camersain a small package!I can't wait for some new lenses as well!", "Date": "January 29, 2014"}, {"Title": "Not a DSLR replaement but overall a great camera.  Still looking into the high ISO.", "Author": "®", "ReviewID": "RM7BXO7Z1BGCX", "Overall": "4.0", "Content": "Updates 12/24/13:+ raw noise not much different then d600.  I shoot indoor without flash a lot.  (bar, events, etc)  So I need larger sensor and prime lens.+ NFC works very well.  I now own the nexus 7 with nfc.  It connect very fast and you don't have to enter the passcode.+ Sony updated their remote software.  The one that came with the software won't change iso, aperture, shutter speed and touch screen focus point on the cellphone or tablet.  Sony fixed all this with verion 2 updater.  To update you mush connect to your modemn have a psn account to download.  Under application, pick playmemories when login, there a apps to update.  I also installed flickr and direct installed (facebook is a option too.+I am giving this a 4.5 for fun factor but very frustrating to figure out all the options int the beginning.* Remember to put the camera in airplane mode to save battery if not using wifi, nfc, uploading.-------------------------------------------------------------------------------This is a nice little expensive camera and by no means a dslr replacement.  All that, I think it is a 7/10, one being the high price and then some performance factors and few features I wanted wasn't there.  I am a photo enthusiast and carry my camera around quite a bit (having a sony nex3 for awhile).  My main system and an all my lenses are Nikon.  I own the D600 and 2 other dslr bodies and 9-10 lenses for it.  I am looking for a small, portable, street camera that can maybe take Nikon lenses; as I have no plan on buying into another system.  I also looked into the fuji x-e1 and 2, x-m1 series, Olympus em-5, Sony nex5t and 6, Samsumg NX300.  I shoot RAW and use lightroom 5.3 instead of jpeg and the slow and odd sony raw converter.Why I picked the A7 kit:+ Body Design, small body, great layout.  I actually like the look, not perfect but good.+ Not a DSLR (got 3 of them, wanted something different)+ Full frame sensor, so there will be little to no drop-off in IQ (image quality, not brain test)from my main camera the d600.+ Phase detection AF (sony nex3 was contrast and it didn't focus very fast or well in lower lighting situation).  The A7 PDAF focused quite fast indoor, but not so good on moving objects (tracking) as I would like to believe in a PDAF dslr.+ tilting screen and wifi, this is 2013 and not 2010.+ I already have a nikkor to nex adaptor already so that is good.+ focus peaking (the area is highlighted when in focus for manual lens, I picked yellow) the nex3 didn't have and it is necessary to have when using manual lenses these days.+ The kit lens isn't that bad, it is good for a kit lens standard and much better than the nex kit lens.  I think they were a little lazy in the design.  Looks like an alpha lens stuck on a nex (there is no nex vs alpha, but this is obviously a nex mount).  There is almost a 1\" shim space between the mount and rear element.  Lecia has short/ compact lenses on their camera, this a milc too.  There are lens distortion with this kit lens, so I turn on the lens correction in Lightroom.+ Like Nikon, I can use aps-c  lens on a full frame.  No real benefits, but it is nice to have that option.+ Same dynamic range and color profile I am used too.  Sony makes sensor for some Nikon, fuji, hasselbald, Olympus, Pentax....+ Startup is quite fast or instant like dslr, 1st gen nex3 was ridiculously slow.+ 1/8000s shutter speed, my d7000 had it but the d600 was only 1/4000s.  Very useful in sunny places and a large aperture lenses.+ A lot of AF points covering most of the screen except the edge on PDAF (100% for CDAF), I don't need to shift and recompose some of my shoots.  Just move the AF point around.+ Movie/ Video mode, wow the kit lens is good for something here.  It focuses very quietly and fast.  Video looks very smooth, I'll always like avchd, I think this can do 1080p.  But in low lighting I use the manual 50mm 1.8d Nikon lens, it is very easy to use with zebra (highlight blowout pattern) and focus peaking (I use yellow to show me what is in focus).  Well my manually focusing skill is beginner for now.  I uploaded few youtube samples, see link in comment.+ Mentioned layout again, I have all the major settings programed, there are 3 programmable buttons.  Changing the setting is a breeze.Negatives:- Cost, I don't think it should cost 60% more than the Nex 7.  Most people aren't going to buy a $2k camera.- IQ (noise), at first it looked odd when viewing raw in Sony raw converting software (too much noise reduction or something), I got a hold of lightroom5.3 and it looks much better.  The other thing is I was using the kit lens and had to hyper drive the ISO and it produced a lot of noises.  I then used my Nikon lens to get the larger aperture, but I still  think this sensor might have a tad more noise than the Nikon D600same 24mp full frame sensor.  I am still learning Sony a7 so my settings might not be right yet.  I have uploaded some samples to flickr of dark indoor and outdoor situation, see link in comment below.  In regular well lit, sunny situation you can't tell too much of a different between many cameras.  I reevaluate this after I get more familiar with this camera on the higher iso and maybe compare it to the d600 side by side.  I don't want to be a technical photographer; by from my experiences, said the a7 has a little more noise.- No touchscreen, com-mon, this is a pure digital camera.  Just because the pros don't need it, doesn't mean most of the people buying theses don't?  I like the Samsung nx3000 and Sony nex5t touchscreen, fun and easy to use.  You can turn it off if it offends you.  Maybe I am used to cellphone photography.- C2 button is hard to press, because it is recess and close to the eyepiece.- I didn't like using the Nex3 at all, so was ready yo give up on the NEX family.  While it is still mostly the same, the small things like PDAF really help make things funner to use.- No IBIS, Sony is trying to steal Canikon shooters, give us some ibis for our manual lenses.- No battery charger and battery drain fast.  You can keep your DSLR on all day and it won't drain that much.- PDAF while faster then CDAF is still not the same as dslr PDAF.  I uploaded some car panning at night, the A7 couldn't do it.  See flickr link in comment.- There are no playmemory apps (software used to control and share photo on the A7 by phone) for window phone, only apple and android. I am the few people that has a window phone.  I do have an android tablet and got it work/control the A7.  You can take photo, but you can't pick the AF point by phone.  Didn't see where you can change the setting either, hopefully somebody can write a good app to have more controls sicne it is an open source.- Sony raw software isn't as quick and user friendly as lightroom, I have better IQ from processing my RAW from Lightroom 5.3 beta.  Actually it looks like a mess with the sony software. (edit I looked red I but I re-calibrated my monitor so it looks fine, tad bit of noise reduction added, I think editing the raw and saving to raw is slow compared to lightroom non-destructive raw editing)- no pop-up flash (there has been 2x I could have used a builtin fash, not going to walk-around with a external flash), they could of placed a flash on the big sony triangle head.Neutral/ notes:* Comes with no software cd, you have to download it after plugging your camera to the computer.* I prefer OVF, but this EVF is quite good.  Colors are still more saturated then real life, but it is getting better.* Won't mind GPS (none here), sometimes you don't recall where you were at.* The fps didn't feel snappy, so not an action/sport camera here.* Virtually no lenses for this system.  The 28-70mm kit and 35mm.  Sony knows most people will be using adapter for this camera.  Look up metabone if you want an autofocus adapter.  I am just manually focusing it with focus peaking.* You can hear the shutter as other has mentioned, maybe street photographer trying to sneak some shots might be worry, but I am not.* AF assist light is quite bright (reddish), I shoot indoor wutie a bit so I need all the AF help.* How do you turn off the AF beeping?* You can't edit the EXIF data in the camera to include your email and copyright info like for Nikon.  Or I haven't found it yet.I actually ordered the Fuji X-e1 about 2 months ago and after I heard rumors of the x-e2 and A-7 with PDAF, I returned it.  I thought it was tad sharper then my d7000 16mp, but it didn't wow me like all the reviews people posted.  X-e1 color were a little flat, since it has more green sensor then red or blue like in bayer.  I just didn't know much about Samsung NX300 except playing with it at the store.  I passed on the OMD-5 smaller sensor and it had a body size almost the same as the A7.My background is I shoot digital and some film.  I have a sprocket rocket, Nikon FM2, Bronica film camera.  I been asking Nikon for a milc and they only provide the 1 system that seem boring to use and has a tiny sensor.  Another thing Nikon has been stubborn to add is a tilting screen, touchscreen, wifi on higher end models.  They came out with the first dslr with movie mode, the first tilting screen on the d5000 series,  an android P&S; camera, but didn't really place it most of these features on their prosumer or enthusiast models.This camera is definitely a keeper for me now.  Like how it feels in my hand and it is different from the dslr.  Brings the fun back into photography.  I will look into the noise and probably give it a  4 stars later.  While the A7 looks a little silly with the long kit lens, it look awesomes with the Nikon aperture ring lenses on it.  I didn't want to spend 2k on a new camera with a good d600 I already had, so held out for a week.  But in the end I knew I had to get it and very happy with it (not looking into the big hole in the bank account)", "Date": "December 9, 2013"}, {"Title": "Awesome little Full Frame Camera", "Author": "KYUMIN SHIM", "ReviewID": "R1IIQQP7O4XLP2", "Overall": "5.0", "Content": "I've been shooting with this for little less than a month now.I knew what it's strong point and weak point before I bought it (googled it a lot). I was really satisfied withIQ. also 28-70 FE lens is doing its job great, really light.AF is better than I expected but still want to see improvement on next model. most of the time AF is good, (not great)but when you shoot in low light condition, it might be fail few times before you take solid one.few custom keys make it easier to use. EVF is great, too but everybody has a different taste so I can't say anything.Problem can be lack of AF lenses yet. I knew it, and I'm using it with Sigma 30mm 2.8 without baffle ( there is slight vignetting, but it's usable.), 28-70 FE lens which I use the most. Right now, I don't have any problem with it's lack of lens, but would happyto see if Sony makes more lens, and hopefully in good price, too.Prossmall size, weight, Image quality, easy to use, EVFConslack of glasses, battery, AF in low light.I'll update after I use it more.", "Date": "December 27, 2013"}, {"Title": "The IQ is spectacular!", "Author": "Dunner", "ReviewID": "R327V6I8RASZJT", "Overall": "5.0", "Content": "I got the A7 w/ Zeiss 35mm F2.8 FE.  This is a huge upgrade from my Sony NEX 5n w/ Zeiss 24mm F1.8 E.I shoot mostly in low light conditions and the A7 focuses quickly and the IQ is spectacular!", "Date": "December 7, 2013"}, {"Title": "Camera is Five Stars, but Sony makes me regret having bought it", "Author": "Caron", "ReviewID": "R2XKFUWM408SVF", "Overall": "1.0", "Content": "As so many others have said, this camera is revolutionary, and a joy to use. Unfortunately, dealing with Sony has been nonstop problems and headaches, so much so that I can't in good conscience tell anyone to purchase it. Between bad manuals/documentation, poorly working and confusing accessories (just track buying an off camera flash cable setup for this - its impossible) the entire experience is horrible.Plus, I pre-ordered the new 70-200 lens on March 4 - a quality lens is critical to using this camera - and not only are they a month past the expected release date and I still don't have it, their customer service was rude and unhelpful.Sadly, I have to suggest not buying this camera, unless Sony can get their act together.", "Date": "May 2, 2014"}, {"Title": "Great step in the right direction.", "Author": "Isaac B. Sloan", "ReviewID": "R3JI0BNJA7RMYD", "Overall": "4.0", "Content": "Great image quality. The focus is more accurate than most DSLR's I've owned including the d800 and 5D MK3. The high end DSLRs do seem to focus faster though at least than the kit lens I have with my A7. Controls leave something to be desired. Would prefer to have a user friendly system like the 5d or d700, d800, or at even something as good as the Lumix GH3.", "Date": "December 4, 2013"}, {"Title": "It's a good camera but some issues with Raw conversion.", "Author": "Minyan Zhu \"Jinx\"", "ReviewID": "R19XQSMD6G2Q4I", "Overall": "3.0", "Content": "This camera seems to do everything you ask of it. However, it's very complicated with it's never ending menus and electronically minded operation.Now for the nasty bits. The shutter vibration limited my hand holding operation on this camera down to only 1/50th of a second. On my DSLRs, I can handhold at least one stop slower on the shutter speed and two shutter speeds slower on my Leicas. So a big no no from me on this point.Here is my biggest complaint. Sony's .ARW raw format is proprietary to sony, so if you want the most detail out of your camera, you have to use the slow as molasses silkypix from sony to extract the most detail, sharpness and color out of your files. I'm not sure why Sony is so stubborn about not releasing their algorithms with Adobe Lightroom and Photoshop. As far as the .JPGs go.... well they're okay, definitely not fuji quality and definitely alot more information to be derived from the sensor in .raw format.There are good bits to the camera too. It's image quality has promise of greatness, and it can take any lens on the market with the proper adapter.  The EVF is nice bright and clear and makes manual focusing a joy.In time I'm sure pressure from users will force sony to give up their .ARW secrets, but for now, I'm gonna hang out on the sidelines and wait until that moment happens. I'm sure in their next revision, they'll simplify the menus, improve the shutter action and share their raw algorithms with Adobe.", "Date": "December 23, 2013"}, {"Title": "Game Changer", "Author": "Johnny Schroepfer", "ReviewID": "RULWZY4ODM26M", "Overall": "5.0", "Content": "You can't find a higher quality piece of hardware for the price. It's an incredible piece of hardware and the combination of size and performance is second to none. Highly recommend the A7 as it clearly competes with the best full frame DSLR's out there.", "Date": "December 7, 2013"}, {"Title": "Great camara", "Author": "Howard", "ReviewID": "R3223HGD1VUC5Q", "Overall": "5.0", "Content": "Everything is good for my daily use. The kit lense is superb and sharp at this price.Battery life is short. Be sure to prepare an alternative battery and a wall charger.", "Date": "December 18, 2013"}, {"Title": "Great Kit", "Author": "Andrew", "ReviewID": "R1PZV7DU8BZFMD", "Overall": "5.0", "Content": "I have too many good things to say about this camera.  Instead of taking all night to write a review, I will just say, this camera is near perfect.", "Date": "January 2, 2014"}, {"Title": "The future is here", "Author": "Roger McEvilly (the guilty bystander)", "ReviewID": "R2LPARP9DK5NNS", "Overall": "4.0", "Content": "Stop the whinging. A couple of hard facts.All things electronic get smaller and less expensive over time, as well as better quality.I bought the Sony Alpha 7 as a budding enthusiast's first entry into higher level/DSLR cameras, because I wanted a top quality full frame camera that was smaller and lighter than the bigger Canon 5D and the Nikon D800, as well as being about 2/3 the price, as well as also being strong and weatherproof. The Sony alpha 7 fits all this.I know this camera is a bit high level for entry level knowledge, but I thought: why upgrade in a year or two when you can just get the upgrade now and then grow into it? It becomes part of the challenge; knowing one has a top quality full frame camera that has top quality picture POTENTIAL, one can learn and grown into it, even if one doesn't know how to use it all yet. The same thing goes for the better lenses which aren't out yet, I'm happy to wait a few months to grow into this camera, which is why Sony is marketing it like this I suspect-camera first better lenses later-for people just like me. I can use the kit lens to get used to it until February 2014, and get a better lens then, and it's still cheaper than the Canon 5D or the Nikon D800.I almost bought the Canon 5D Mark 3 a few weeks ago until someone at the shop told me about the newer Sony Alpha 7 coming out. It's about half the size and 2/3 the price, for something that is almost the same quality overall-its was a no-brainer.  The only other ones I considered was the new Olympus OM-D series, which are also quite small and good quality, but the Sony has the full frame.I don't know enough about the specifics about why some people are complaining about a few points about this camera compared to the bigger models, but I can tell you what the market will think: the smaller full frame cameras will eventually iron out these bugs and weaker points.Another thing: whether the A7K or the A7R? Another hard rule in electronics is that the very top range stuff usually has extra features at significantly higher prices, that most people won't use or need. It's the same here. Unless you are a pro, I would skip the A7R. It doesn't even come with any lenses as it expects you to be a pro with heaps of lenses already. Save yourself ~$600 and get the A7K, unless you are a pro.The battery life is apparently weak compared to other cameras. I found this sort of thing with some of the new smartphones as well, which only lasted about a day, but then figured out just to turn a few things off and they last 3-4 days, which is fine. I suspect the same with this camera. For a non-professional, a hundred shots a day is enough, this camera is fine at that level. Pros might want to take 500 shots in a day but most other people don't. I might get an extra battery and carry it around, but again, I suspect I wont need it.People want a camera which they can travel with more easily, take snaps on the go, and not worry about rain, tripods, or bulky heavy cameras and lenses. The Nikon D800 and Canon 5d are not exactly small in this area, and when travelling with luggage, and getting on and off planes, buses, and so on, it makes a difference. Their full kits take up half my luggage. Sorry, but smaller higher level/DSLR cameras are the future. Same thing happened with phones, computers etc, the only exception is bigger screen TVs, but these have gotten thinner so the volume has actually gone down, even though the size of the screen has gone up-I used to have one of the earlier big screen TVs and it was so big and thick you needed a forklift to move it.I'm happy with the shots and will learn all the specifics and stuff on the go, and get the better lenses later. I'm also taking it travelling, so it's the best one for me by far. The guy at the shop told me its strong, weatherproof and sturdy, so I expect to have it for years.", "Date": "December 1, 2013"}, {"Title": "Will update review after warranty issue...", "Author": "Shopaholic", "ReviewID": "R18R7D2EP322HD", "Overall": "4.0", "Content": "Unfortunately, my Sony a7K arrived with a defective lens.  I am not sure exactly what is wrong, but the auto focus will not work.  When shaken very gently, I can hear something rattling around inside then lens.I received this Sony a7K through the Amazon Vine review program.  As such, I cannot use the typical Amazon return process to exchange it for a new camera.  I am also required to write a review within a certain period of time, which is the reason I am writing this now.  I am currently dealing with Sony's warranty department to facilitate a repair or replacement of the lens.  For now, as to not negatively scew the reviews, I will give it a 4 star rating.  The 1 star is being removed for quality control issues.  (In all fairness, the outer packing box looked like it had been through a war, so it might have been damaged by the carrier.)  When I receive the lens and have a chance to properly try out the camera, I will update this review.", "Date": "February 23, 2014"}, {"Title": "Nice camera in January, but there's trouble ahead I'm afraid....", "Author": "Nicholas", "ReviewID": "RFCM1KJ9P6M3W", "Overall": "1.0", "Content": "This camera is amazing for its size, and is producing great pictures. Unfortunately, it has a major, major design flaw - overheating.This is limiting the amount of time you can shoot video before the camera puts up an overheating warning and shuts off.Sony are aware of the issue - the back of each camera has a permanently-printed warning saying the camera \"gets warm during use, but this is not a malfunction\".Using this camera in a chilly North America January is fine - but for the last week I've been using it in temperatures of between 75-80 degrees. Even in the shade, recording times vary between 15-30 minutes before an orange temperature symbol appears, and then a text warning saying the camera is shutting off due to overheating.This has been a problem with earlier, cheaper Sony NEX cameras and I would have expected Sony to have resolved the issue by now. Come the summer, I expect we'll hear a lot more about the issue & have more data points showing the recording time / ambient temperature trade-off.", "Date": "January 31, 2014"}, {"Title": "My Incredible New Sony a7K Camera", "Author": "Kent J. Smythe", "ReviewID": "RZEE364WJHFHX", "Overall": "5.0", "Content": "I'm a Big fan of Sony cameras, I have several for different purposes. I've mainly been using my Nex-3 and Nex-5 cameras for capturing fun photos, nature stuff & other things to amuse myself and my Nex cameras have never let me down.This weekend my new Sony a7K arrived  and I've spent this weekend playing with it and my mind is blown.It's a small, light weight camera that feels great in my hands as I'm going around taking some fun nature shots and the detail of these photos has shocked me. I never knew the dirt that the plants are in that I'm shooting could look so fascinating. My other cameras have 16 MP resolution and the a7K's 24.3 MP makes a mind-blowing difference.It's like when I had an incredible Sony standard def TV and I saw the Sony HDTV for the first time, there was no going back, it was what I must have.While I will still use my Sony Nex-3 & Nex-5 for out and about simple fun, the Sony a7K is what I will be using for my important projects.I photograph original artwork for consideration in art shows and I want the highest resolution possible. I know that the Sony a7K will capture the amazing colors and incredible rich detail that I need to show in these paintings.I Love that the Sony a7K is fully compatible with my E-mount lens from my other Sony cameras.This camera is so easy to use and I can tell that as my using the Sony a7K continues, I'll continue to to grow with this incredible camera, I have so far to grow but it's not a scary camera to work with.I really love the great battery life that the battery delivers,shooting all day and there's still power there for me.I LOVE this camera and I look forward to capturing the sumptuous colors and the incredible fine details in the subjects I shoot with this amazing camera.", "Date": "January 19, 2014"}, {"Title": "doesnt work well with leica lenses, wacky raw file processing", "Author": "lennyhpc", "ReviewID": "R2KLGUY3IB4V16", "Overall": "3.0", "Content": "Tried it myself with more than 10 modern rangefinder type lenses made by Leica and Zeiss from 21mm to 90mm, those dark and blurry image corners/edges really turned me off.  Definitely not a Leica M replacement.  Also you have to use Sony proprietary software to process raw files (Adobe RAW 5.3rc works, but the the output is not as good as Sony Image Data Converter 4), out of camera jpg are awful without much detail even with the highest setting.", "Date": "January 2, 2014"}, {"Title": "Very Nice, sharp pictures", "Author": "canonlover", "ReviewID": "R27UYZEH533WJ4", "Overall": "4.0", "Content": "The Sony A7 is a great camera that gives very nice results. It is light and handles very well. It will be nice when the new FE lenses are available.", "Date": "December 1, 2013"}, {"Title": "will not charge", "Author": "OhSoHumble", "ReviewID": "R11YP4LA9D9F5S", "Overall": "1.0", "Content": "I just got my brand new camera in the mail today. I inserted the battery, switched the camera power toggle to 'off' and plugged it in... to discover that I got a defective camera. It just will not charge. Lovely.", "Date": "April 24, 2014"}, {"Title": "UPDATED (12/11/13). Are you kidding me? This is the slowest Auto Focus I've seen and worse jpeg quality. HORRIBLE!!!!!!", "Author": "Fima", "ReviewID": "R6566E6K0PTWX", "Overall": "1.0", "Content": "Update 12/11/13:You CAN get a decent picture out of it IF YOU BUY Latest version of LIGHTROOM or you download sony Image Data Converter old version that was made for nex. Remove all the processing of the camera, export it to tiff and import top lightroom or anything else.So sony didnt bother creating a normal software that can at least process its own raw files.And because of some idiotic fanboys that think that buying an expensive software to get goo results from the camera is ok, sony keeps producing this overrated cameras.In conclusion: I would keep this cam if it was $1000 with the kit lens. It feels to me like beta version of a camera.--------------------------------------------------------------------------------------------------------------------------------------I bought the package with kit lens.Are you kidding me? This is the slowest Auto Focus I've seen. HORRIBLE!!!!!!I have owned nikon d90, nikon d300s, Nikon D700 (full frame) and (I am an idiot for selling it) is Olympus OMD micro 4/3.As I said. Update to come. But here is what I have so far.* I open the box and don't see any charger. Guess what. You can only charge your battery IN CAMERA!!!!! WHAT? This is full frame professional camera. So I cannot shoot and charge my other battery? And do NOT tell me to buy extra charger when I paid 2K for this package.* Just got it. Its dark already, so I put on the light in the room full time to take some test pictures. 1/25, 5.6, iso 6400 70mmIt focuses slower than all the cameras I had before UNLESS YOU GIVE IT TIME TO PREFOCUS!!!!!!!! I reminds me my friend's Pentax from 6 years go that is known for slow focus.UPDATE ON QUALITY TO COME....... (I am looking for a software to open the raw files. Downloaded the sony raw viewer it cant open them)", "Date": "December 2, 2013"}], "ProductInfo": {"Price": null, "Features": "World's lightest interchangeable lens full-frame camera\nFull Frame 24.3 MP resolution with 14-bit RAW recording\nFast Hybrid AF with phase-detection for DSLR-like speed\nModel: ILCE7/B", "Name": "Sony a7 Full-Frame 24.3 MP Interchangeable Digital Lens Camera - Body Only", "ImgURL": "http://ecx.images-amazon.com/images/I/41jzROrsrVL._SX300_.jpg", "ProductID": "B00FRDUZXM"}}