{"Reviews": [{"Title": "Stunning Images, Great Camera - the Camera that D600 Should Have Been", "Author": "Sterling G. Wells", "ReviewID": "R373RH84ZOCBO6", "Overall": "5.0", "Content": "Edit for clarity: I do actually own the D610.Nikon has finally got it right with the D610 - it is truly a fantastic camera, and that's quite a statement coming from a former D600 owner like myself.The D600 was an absolute debacle; after 2 replacements I still had massive dust and oil problems.  I strongly disagree with the way Nikon \"handled\" the D600 problem, but people should know that the D610 is truly a fantastic camera.  I was motivated to write this review after I saw numerous people writing poor reviews of the D610 based on their disapproval of Nikon's actions.I don't think it's fair to criticize the D610 based on the shortcomings of its predecessor, so I wanted to take the time to say that all of the problems I had with the D600 seem to have been solved with this camera.  My D610 produces absolutely fantastic images and there hasn't been a hint of the dust or oil problems that plagued the D600.For detailed analysis of this camera and its image quality, check out DXOmark.com; they do a much better job of objectively reviewing cameras than I can.  But in my opinion the D610 is an excellent camera.  I highly recommend it.", "Date": "November 2, 2013"}, {"Title": "Nice upgrade from D90", "Author": "Ran Xerox", "ReviewID": "R2E74V2VRJGHBC", "Overall": "5.0", "Content": "If you own a D600, and have an issue with spots on your images, search the internet for \"Technical Service Advisory for Nikon D600\".  Nikon is replacing all of the defective shutters.I have had the D610 since Oct 22 and I am very impressed with everything about this camera.  This is my first FX format camera and I love it.  A friend of mine has the the D600 and he has never had an issue with oil on the sensor so I was never worried about it with the D610.  I purchased through Amazon and the packing was awesome, just make sure someone is home to sign for it : ) .  I own the Sigma 35mm F1.4 DG, Nikon 50mm f/1.8D, the Nikon 85mm f/1.8G, and the Tamron AF 70-200mm f/2.8.  Nikon SB-600 flash works with it fine.  It does have a DX crop mode that you can use on a non DX lens, might help with the the long end of a zoom for sports to make a 200mm equal to a 300mm.  Nice big viewfinder image helps me with focus issues I had on the D90.  I loved the D90 but the D610 is on a different level.  I use this for high school and college sports, orchestra and band.  The quiet shutter mode has helped with the indoor events.After using it this weekend, I have noticed that there is a big improvement with low light focus on the Tamron AF 70-200mm f/2.8/D610 over the D90. It did not \"hunt\" like with the D90, I think because it could find contrast easier. I tried shooting in the shadows, even though it found contrast in very low light it was not always in focus but did not hunt all over - and it was a usable shot instead of no shot. It correctly did not auto select DX with the Tamron. With the D610 the \"70\" end of the 70-200 is now much more usable. Essentially with the D90 I was carrying a 105-300 lens. Now I don't need to bring a second lens if I can stand 5 or 6 feet back to get waist to head coverage shots. I did not notice color or corner issues in the shots I got, I was expecting to see problems.Shooting an indoor swim meet I noticed the corners where very sharp with no perception of light fall off. There was no focus hunting at all, and I took over 100 shots. Because of the higher resolution of the D610, I was able to crop to get a lot closer to the subject. For sports this combo is awesome, use the 3D mode for auto focus.The Sigma 35mm F1.4 DG is amazing.  I will probably use this lens most of the time.  The only lens I will need to take along with is the Nikon 85mm f/1.8G . Between the two lens and switching to \"DX\" mode, I will have essentially 35, 50(dx crop), 85 and 127(dx crop) in primes with me.I hope this helps someone switching from DX to FX.", "Date": "October 24, 2013"}, {"Title": "Come on over, the shutter is fine.", "Author": "R. M. Evans \"R. M. Evans\"", "ReviewID": "R2UMCI1O3KO05D", "Overall": "5.0", "Content": "I don't usually write product reviews, but I feel like there are a lot of people who may need a little encouragement before deciding to purchase this camera. Reading through this product page can certainly drive one crazy trying to filter through actual reviews and the bitter remarks about D600s and sensor debris. I owned a D600 and it did have problems with oil spots on the sensor. I understand that not all D600s have this problem, but mine did, even after it was refurbished by Nikon. For those of you who have a D600 with no problems, you lucked out and have no reason to upgrade to the D610. For those who DID have problems with a D600 and are feeling apprehensive, come on over to the D610. I'm happy with mine. And finally, for those who have not owned either camera and are wondering if it is a camera worthy of purchase, maybe you're considering going from DX to FX, I highly recommend it. I also own a D7000, which I love, but I wanted to make the jump to an FX body. The D600 was the natural choice for me with its \"affordable\" price and overall fantastic performance. Oil issues aside, I really liked the D600. And since the D610 is virtually identical in specifications I know it will perform amazingly.I do a lot of long exposure photographs of stars out in the desert. The low-light capabilities of this camera have been nothing short of impressive. The amount of noise in the images at higher ISOs (1600 and 3200) has been dramatically reduced from the shots I was taking with the D7000. My other focus is wildlife photography, for which I will still primarily use my D7000, but the D610's 6fps burst rate is a really nice feature in case some Bar-Tailed Godwit(rare bird) flies by while I'm taking some seascape shots.The Nikon D610 is a great camera that I highly recommend. I hope this information is helpful.Happy shooting!", "Date": "November 11, 2013"}, {"Title": "Great FX camera - No oil problem (I owned also the D600)", "Author": "Andrea", "ReviewID": "R1BICZI0SN0212", "Overall": "5.0", "Content": "I have the D610 since December 14 2013, and I wanted to wait for some time and after a few thousands pictures  before I'd write the review.I owned 2 D600s that I loved for the image quality and its features but they had the dust/oil problem - I managed to sell them and I bought the D610, that I can confirm does not have the oil issue. The D610 behaves as the D600 that I consider a great camera and one of the best on the market.For the people that are complaining in this thread about the D600 and Nikon customer service, I must also say that my experience with the Nikon NY service center has been more than satisfactory - they have been very professional and helpful when I sent the D600s for the shutter replacement; After the shutter replacement, the D600s did not present oil on the sensor.With the D610 I decided to do the following test to make sure that if there was dust on the sensor it was not generated by the camera.The camera arrived with a clean sensor, so I mounted a prime lens (50 mm F/1.8) and I made about 500 shots without changing the lens; then I checked again taking a white picture at f22/ISO 100 and the sensor was still clean as the first \"check\" picture.Then I changed the lens and I mounted a zoom lens (28-300mm) and shot a few hundred pictures before I checked the sensor that a this time had a few dust spots  (~10) spots - they had the same pattern of the D600 on the left top corner and also at the bottom right corner of the picture - I continued to shoot other 500 pictures before I checked again and at this time the sensor had about 40 spots also at the right upper corner.At this point I cleaned the sensor using a dry method (not wet, needed if it was oil) and I was able to fully remove all the dust/spots from the sensor.After the cleaning I mounted the prime lens and I shot again about 500 pictures before checking the sensor that was still clean.From my experience, the dust appears to find a way from the zoom to the sensor, even if I'm very careful making sure that the zoom is clean inside - the dust may cluster to the corners because of the whirl generated by the mirror.", "Date": "January 4, 2014"}, {"Title": "Excellent Intro FX Camera", "Author": "Seacrash", "ReviewID": "R3TCD1UA8XP4OD", "Overall": "5.0", "Content": "I am in the process of starting a photography business and had big decisions to make when it came to which brand and model I was going to go with for my 1st SLR.  I like to be different than the masses so I was leaning towards Nikon over Canon.  I was looking at purchasing the D600, but then read about the oil spot problems and decided to hold off.  I couldn't justify buying the D800 for the money, but didn't want to throw my money away on the D600.  With no good options left, I reluctantly decided that Canon was my only good option (although I definitely would have considered Pentax if they were producing an SLR at the time).Just as I was about to make the purchase, I saw that Nikon released the D610.  I was ecstatic--thinking that timing is everything and that this might actually be the one for me.  Positive reviews started flowing in--other than unhappy D600 owners.  I will say that I sympathize with D600 owners because I would be mad as hell too after spending that kind of money.  Needless to say, I don't rush out to buy something the day it hits the market.  Especially, for $2k--I want to read a good sample of reviews first.  Even though it's tough to support a company that left it's customers high and dry, I decided that this D610 was the camera for me and hoped that Nikon had learned it's lesson on the D600 so that a debacle like that doesn't happen again.On to the camera itself.  I've owned it for about 2 months now and have to say I'm very pleased with the purchase.Pros:*** Picture Quality--has been phenomenal.  It's amazing the level of detail 24 MP can provide.  The RAW files are big--so I mostly work with the JPEGs.  Make sure you have a big enough hard drive and fast enough computer to handle these files.  I have the 27\" iMac and it works seamlessly.*** 6 FPS--is plenty fast unless you are shooting extremely fast moving subjects*** Quiet shutter--is definitely quieter than regular shutter, but I wouldn't say it's close to silent*** Dual Memory Card Slots--huge feature--you can use the 2nd slot from backup or solely for video or 1st slot for RAW / 2nd slot for JPEG (what I use)*** Built-in Flash--I will mostly be using an external flash, but it's still a very nice feature to have in case you need it*** U1 and U2 modes--these are customized settings that you can manually program to be able to use with the flip of a switch--certainly a nice feature to save time when shooting events such as weddings, etc.***Low light photography--is exceptional.  Photos end up being much brighter than they are to the naked eye--it's pretty unreal how much light this image sensor can pick up.Cons:*** As others have stated, the 39 point auto focusing system is by no means terrible, but it does \"hunt\" at times--especially in low light.  That's one of the main extras you're paying for in the D800, D4, etc.  I imagine there is much faster reliable focusing on those models.  Still the focus system is good enough for my purposes.I also highly recommend using Lightroom 5 as your photo editor--it's way better than iPhoto and some of the others.  And do yourself a favor--to take full advantage of this camera--invest in good glass.  I have the Nikon 24-70 f/2.8 and 70-200 f/2.8 and both combine with this camera for stunning detail.  If you're investing this much money in a camera, don't go cheap on the glass.  I also recommend buying the battery grip, if for no other reason than the camera feels much better in the hands.  I can get 4 fingers on the body instead of 3 which makes me worry a lot less about my grip slipping.And lastly, I've had no oil spot sensor problems after about 2,000 pictures.  I hope this review is helpful.  I'd be happy to answer any questions you have about this model.  Cheers!UPDATE (03/2014): I've now owned the camera for 4 months and have taken over 4,000 pictures.  There has been no dust/oil spot issues whatsoever.  I continue to be extremely happy with the camera and am always discovering new settings/capabilities.  I purchased the book, \"Mastering the Nikon D610\" by Darrell Young.  It has really helped me understand the full functionality of the camera.  The user's manual is not the easiest/most helpful reading material as you can imagine.  I continue to get compliment after compliment about the quality of the images this camera produces (even from Canon owners of the 5DMIII and 6D).  Once I decided on Nikon, I know I was torn deciding between the d800 and this camera.  I feel confident in saying that this is the best bang for your buck in the current Nikon line.  In fact, I like this camera so much that I've decided to purchase a 2nd one (being a wedding photographer--I need two full frame bodies).", "Date": "January 24, 2014"}, {"Title": "Best proSumer Nikon DSLR to date", "Author": "Robert Cozzi", "ReviewID": "R1CR8XJG0G5WUD", "Overall": "4.0", "Content": "I owned the D600 and replaced it with this D610.I had the spots on the D600 and was hopeful this model corrected that issue. More on this later.Pros:Improved and noticeably better White Balance over the D600. My in-door \"people\" pictures now look as good as my friends photos who use Canon 5D or 6D DSLRs. This is a great new feature.Good speed for multiple shoots--not Nikon D4s fast, but good enough for everyday things or the occasion soccer match.Scene mode allows you to take great sunset pics when you don't have time to adjust the camera. I don't use the rest of those \"scene\" settings so I can't comment on how good or bad they are, but most cameras have a pretty good set of these I would expect this one to also support them.Full-frame sensor (great depth of field shots using my 50mm lens).Built-in flash is great (my Canon friends are jealous) for most short barrow lenses. Use an external flash for longer lenses.Seeming better LCD color than the D600/D800, but remember that image is not the image recorded, just what is displayed on the camera's LCD so (for example) you could set the LCD to B/W in theory, if you preferred.AE-L/AF-L button can be reprogrammed to AF-ON if you're like me and like to focus and then shoot.Good photo buffer size. I can shoot 12 images in both Raw+JPEG before it starts buffering.  Then get another 3 off in only a second or two. The recording-to-card speed is depended on the SD cards you're using.Cons:Slow Expeed 3 CPU. The Nikon Expeed 4 is out in the new DX format camers, this one could have used it as well. I'm guessing Expeed 4 will be in all new models this year, so if they once again update the D610 to D620 it will probably include Expeed 4 which would help (slow to start up the Menus).Would really like the AF-ON to work in conjunction with the shutter release. Here's what I mean: I would like the camera to use AF-ON when I press AF-ON. When I do not press AF-ON, I would like the shutter to work normally; meaning focus, then shoot. Today I have to toggle between these two modes. Perhaps a dedicated AF-ON button would provide this kind of feature?Recommendations:If you want an FX camera, get a D610 or if you're a megapixel freak, consider the D800/D800e. If you can wait \"5 minutes\" there may be an updated D800 coming out in 2014 that would probably use the Expeed 4 chip; that might be cool.  While there could potentially be a D620 in 2014, I would say if you need a camera buy this one. If you don't then wait a few months and see what happens.Dust Spots: [EDIT: I forgot to include this in the original post] All DSLR cameras have spots on them. It is just that most people moving from the compact \"PowerShot\" or \"CoolPix\" to DSLR FX notice the spots for the first time. The D600 had a shutter or mechanism defect that caused particles of something (some say oil, some say dust, some say grease) to appear in photos at F8 to F22. Most notably on bluesky or snow landscape shots. I too had this issue, a friend of mine also owns a D600 and he did not experience that issue.The D610 has dust on it, already. Do I notice it at less than F8? No. Is it as severe as the D600? No way! In fact it is what I would term \"normal\". Meaning it is the same as you'd expect to see on the D800, D4, Canon 5D, 6D and all the DX format cameras that have a shutter. D610 is probably a bit better and certainly no worse than the \"cleanest\" out there. A few puffs of air with the mirror locked up and the spots are gone.[Update: Dust spots are returning after more and more photos, Nikon support notified me to send it in to someone specific rather than the general support address. \"We've not seen this in this model before.\" said the support supervisor. So I'm sending it in. Fortunately I do not think this is oil or whatever was on the D600, it appears to be only dirty/dust particles probably from metal on metal during shutter release. I'm sure it'll be resolved.]", "Date": "February 4, 2014"}, {"Title": "Camera is great -- Amazon was not that great", "Author": "Whitedoves", "ReviewID": "R25MCYT7GB70FQ", "Overall": "3.0", "Content": "This camera is great, captures a lot of detail, a couple of notches above the D7000 that I had.However, I was quite disappointed by Amazon.  They initially shipped (as I fortunately discovered later) a used camera.  I was a bit suspicious as the camera came with the language, date, and time zone already preset.  I later chanced to check the shutter count using Exif data on the image, and found the camera already had 17,400 shutter clicks!!  Very disappointing considering the cost of the camera/lens was almost $3,000.Buyer beware.", "Date": "March 25, 2014"}, {"Title": "Love my Camera", "Author": "Fliptastic", "ReviewID": "R3M1TME7VO55E7", "Overall": "5.0", "Content": "Let me start off by saying I am not a technical camera expert.  I'm a portrait photographer and just a few years in.  I've been shooting with a d90 and have wanted a full frame camera.  I've been eyeing the 800 for six months.  When I saw the 610 was coming out it was less money for the same features I was looking for I got it, but I got so much more than just a full frame camera.  I GOT EVEN SHARPER PICTURES!  My pictures are tack sharp.  Same lens, but my pictures look so much better.  Everything that frustrated me before (fuzzy eyes despite doing everything right with focus, shutter speed and light), has now magically been fixed with the 610. Noise is reduced, low light options are better...The 610 has taken my photographs to a whole new level.  I thought getting another Nikon would be an easy learn, but I did have to re-learn the in's and out's of this camera, but all in all it only took a few days.  Also I was frustrated to find out that my photographs would not load in Lightroom as the camera is so new Lightroom has not come out with version 5.3 to support it.  However that is not Nikon's problem.  After much research I did find out you can download the 5.3 beta version and that pretty much saved me.  I LOVE this camera.  I'm so excited I got it.  No regrets!", "Date": "November 11, 2013"}, {"Title": "Just buy it already", "Author": "DH", "ReviewID": "R3AE0NV54PUI7O", "Overall": "5.0", "Content": "First off, the fact that anyone would rate this camera 1 star is a complete joke.  Moving on.I've had the D80, D700, and Sony A7 (briefly) before this camera.  I thought I wanted to move away from dSLR's and moved to the A7 for a more compact system with what I thought would be equal performance.  I was entirely wrong.  The A7 focus system is nowhere near as sophisticated as the D610/D700 or even D80 for that matter.  So, I returned the A7 and went back to my good old faithful nikon lenses and the D610 and I'm so happy I did.  Coming from a D700, the image results are just as amazing.  I needed a camera with video, and this thing certainly fills  that role nicely.  There are two things I would change about this camera if I was forced to nitpick.  First is the mode selector dial, it's a pain to use compared to my D700, second is a slightly larger AF focus area (for those rare shots where you need to focus/compose on something towards the edge of the frame.  That's it.  Everything else is perfect.  Battery life, customization, menus, FPS, everything.  Yes it isn't forged out of a rhino skin, but it is still tough/weather sealed.  Unless you are a (clumsy) full time pro who needs a tank of a camera, this should suit you.  I did tons of research and reading on all cameras available at the time I bought my D610.  Let me save you from doing that as well, just buy it.  You'll love it.  If you need to print billboards, consider the D800, but if not stick with the D610.I feel like I need to say it again, if you voted this camera 1 star you are either completely in over your head with a camera you cant control or you are lying.", "Date": "February 4, 2014"}, {"Title": "So far so good!!!", "Author": "Jim", "ReviewID": "R1XA3G7DEABY8I", "Overall": "5.0", "Content": "I bought this body to go along with my D700 and D7000 (I may sell my D7000 now). Loving the D610 so far!!! The color balance is slightly greener compared to the D700 and D7000 but shooting RAW it's really not a big deal (Lightroom 5.3 RC is out now!).The D610 should fit my needs perfectly!!!", "Date": "November 11, 2013"}, {"Title": "No Dust Issues, Georgious Photo's", "Author": "Chester F. Saj", "ReviewID": "RFDSMM0NY693C", "Overall": "5.0", "Content": "My D700 dies and I needed a new FX camera so I settled on the D610. I figured Nikon would fix the dust problems to save face. I have to say, they did. Great camera fantastic low light, and daylight pics.I would recommend this to a friend.Only one caveat, when you buy this camera from Amazon, you get concierge service. Someone who makes sure it all goes smoothly.She helped me get it a day sooner, But, not her fault, the packaging was terrible, especially for a $2000 camera.Problem was, there was hardly any, Nikon box in a shoe box with no packing! It was sliding around inside the outer box. Ask the concierge to make sure it gets packed on all 6 sides. Just an FYI.", "Date": "October 23, 2013"}, {"Title": "Astonishing", "Author": "Chupacabra", "ReviewID": "R23GOF5III11IP", "Overall": "5.0", "Content": "As a part time portrait photographer let me assure you this camera is wonderful. Put an 85 1.4 g or even something like a 70-200mm f4 on it and the results are simply astonishing. The D600 it replaces has upset some past users (like the two one star reviewers above who have not even used the D610) but this camera is faultless. And a bargain for the price. Excellent build, ergonomics, dual card slots (a must for paid work) as well as a built in flash for triggering your speedlights. Highly recommended.", "Date": "October 21, 2013"}, {"Title": "Great quality", "Author": "Siddartha Gurrawar", "ReviewID": "R1GS7QR6660FY9", "Overall": "5.0", "Content": "I have been waiting for a few months now to buy a full frame but was waiting for an update to D610. Just got my D610 two days ago and started shooting. Picture quality is awesome and second to none. Auto focus is fast and accurate. I am very happy with the autofocus speed of this camera and it makes taking portraits so easy. I was able to shoot up to 5000 ISO with minimal noise. Shot around 800 pics so far and I do not see any issues with sensor spots so far. As it is predicted, they might have fixed the shutter and sensor dust/oil issue.Dual memory card slots is nice and I dont have to carry additional cards with me. I put 32 GB in each of the slots and is more than enough for shooting raw all day long. It is heavy compared to other DX format cameras and heavier than 7100 but feels strong and comfortable to hold using a single hand. I am planning to take advantage of the CLS system and upgrade my strobes to use nikon flashes so that I could use TTL mode all the time. Continuous shooting speed of 6f/s is not much higher than the d600, but I think it would suffice my requirements.Autofocus system is fast. One issue is that most of the 39 points are at the center of the frame. It would have been great if it had more focus points such as D7100. I think the autofocus system used in both cameras is fast but not the same. I own a couple of DX cameras. But I never expected the performance of FX in low light would be this good compared to my previous DX. If you are planning to upgrade to FX and have been thinking for a while, this is the one to get. I am still testing it and have couple of other shoots lined up. I will post more details after this weekend.One issue is that adobe lightroom does not recognize the RAW files out of this camera. We might have to use some exif tool to hack around the camera info in raw files to get them to work in lightroom. Nikon provided their software along with the camera that recognizes the RAW files of D610 but it does not compare to lightroom in functionality. Eagerly waiting for adobe to release their update so that D610 pics could be edited.  I am hoping they will release the update in next few weeks as I have few shoots lined up and do not want to hack around the raw files to process them. Overall its a great camera. I do not see any issues with oil or sensor so far at 800 shots.Update:HSS sync mode on this works great with my SB-700 and I am now able to take pics in broad daylight. Battery life is great. I was able to take 600 shots in RAW and still had enough battery left for another 200 shots. I am using Exiftool to convert the pics metadata to process in lightroom. Lightroom 5.3 should fix this issue. It is already out on beta release but I am waiting for the official release. I used 35mm 1.8g DX prime lens  and 24-85 FX lens on this camera. Camera automatically recognized the lens and worked in crop mode while using the DX lens. Even in crop mode, images had amazing detail and I was able to crop and still get a pretty decent picture. For all those who are familiar DX cameras, this camera is heavy and considerably heavier than the other DX models but is built like a tank. If you plan to use a tripod, this camera would require a very sturdy tripod. I used it on my old tripod ( my mistake:)) and almost dropped the camera.No sensor issues at 4000 shots so far. Picture quality is awesome even when using DX lens and after cropping.", "Date": "October 21, 2013"}, {"Title": "Love this camera", "Author": "Amazon Customer", "ReviewID": "R1OG33ZNW6VGOF", "Overall": "5.0", "Content": "They say this is a back up for Pro's. Nah. Aside the D800, this is THE camera to have. Don't let anyone tell you different. If you can't get the 800 GET THIS. *Update - I have taken over 5000 shots now and no oil issue. Still going with no problems.", "Date": "February 21, 2014"}, {"Title": "The Best Value in Photography", "Author": "Donald Scarinci", "ReviewID": "RGQN5IF5E90GV", "Overall": "5.0", "Content": "This camera is the best value in photography.  When it comes to post processing your images in photoshop, the 24.3 megapixel size is just right.  The 36 megapixels in the Nikon D800 take too long to process.  The 16 megapixels are not quite enough when you want to do a tight crop or a large print.This camera has all the feature you will need.  For more details see [...]", "Date": "February 15, 2014"}, {"Title": "D610 review from a D700 user", "Author": "Jeff", "ReviewID": "RTNH7TQYRS46B", "Overall": "5.0", "Content": "Like many D700 owners, I had been waiting a while for a direct update of that camera, but it never came. The D800 seemed like overkill at 36MP, and the D600/610 lacked some of the pro features that the D700 had. But after a lot of research and agonizing, I decided to take a chance on the D610 and, so far, I'm really glad I did.I shoot weddings, events, and portraits professionally, and also do some freelance photojournalism. Low-light capabilities are really important to me, and the D700 has a well-earned reputation as an absolute beast in low light. I also like to use a two-body combination to avoid having to change lenses. For several years I'd been using the D700 with the 70-200 f/2.8 VRII, along with a D300S fitted with a Sigma 17-50 f/2.8. The combo served me well, but I was getting increasingly dissatisfied with the image quality on the D300S and tried to avoid going above ISO800 whenever possible. I seriously considered getting a second (used) D700 before ultimately deciding to go with the newer technology and higher megapixel count of the D610.These are my unscientific impressions, pro and con. If you need a detailed and/or technical review, there are plenty of them out there, and if you're about to spend two grand on a camera you should read them.The image quality is fantastic. Some friends described the D700 as \"magical\" in terms of image quality, and I agreed, but the D610 is even better. The colors and white balance seem more accurate, the tonal gradations more subtle, and while I used to think 12MP was more than enough, I can definitely see the advantage to having 24MP at my disposal. I was a little worried that the larger files would slow down my processing (I always shoot RAW), but I've got a pretty fast i7 Windows machine, and Lightroom5 works just fine. Yes, it takes longer to import and export and build previews, but the increased resolution and detail are worth the tradeoff. As one of my pro friends says, it's always better to have more megapixels than less. You can crop away or downsize if you need to, but you can't add them if they aren't there.It's a low-light beast -- just as good as, and maybe a little better than, the D700. You can shoot clean images at ISO1600 all day long; ISO3200 is no problem; and even 6400 is completely usable with a little noise-reduction in Lightroom.The autofocus system is very capable. This was one of my concerns, since the D610 uses only a 39-point system, compared to the 51 points in the D700 and other Nikons. According to the spec sheets and some reviews, the D610 wasn't supposed to perform as well in low light, but I've found to work just fine, especially when you have the AF-assist lamp activated. It's fast and accurate, especially when using the center point, which I do most of the time. It's not perfect - but my D700 isn't perfect, either. As many reviewers have said, the 39 points don't cover enough of the image area, but I haven't found this to be a serious problem.The body, while lacking some of the external controls of the D700 (and nearly identical D300S), is \"pro enough\" for me. It's a little smaller and lighter than either of those, but feels robust enough and comfortable in my average-sized hands, and it balances well with heavier lenses. I would prefer to have the other models' dedicated switches for focus mode and metering method, but I'm finding that I actually like the D610's position for the ISO button (bottom left on rear of the camera) better than the top position of the other two. Some users will also miss the separate AF-On button of the pro models, but you can program the D610's AE-L/AF-L switch to serve as a back-button focus if you like. Still, it's a little farther away from the command dial than the dedicated button on the other models. I'm not a big back-button focus user, so it's not a problem.This may seem like a small thing, but I love the shutter sound on the camera. It's somehow smoother or more muffled than the others, even when you're not shooting in \"Quiet Mode.\" The D700's shutter sounds like the crack of a rifle shot in comparison.All in all, I'm very happy with the camera. I still use the D700 a lot, but with every shoot, I'm finding that I'm ending up with more and more images from the D610, which I usually pair with the very good (though also not perfect) 24-120mm f/4. If you're on the fence about the camera, just buy it.", "Date": "May 2, 2014"}, {"Title": "Another review", "Author": "Joseph", "ReviewID": "R1ELRN6H6ZVWRN", "Overall": "5.0", "Content": "Not sure why my first review is gone, but here we go with a better one anyway...I been saving up for the D800 forever but this came out and this is better because of the file size that gets stored on your computer. Plus you can get an awesome lens and the body for the price of the D800 body only. Buy from a photography store or best buy because I heard Nikon doesn't take anything bought from Amazon \"as I'm told\".Who's this camera for? If you love doing weddings, this is it because of low light capabilities and quiet mode.Landscape? Amazing resolution this camera does even with kit lens.Portraits? Depends on your lens, if you use prime, 2.8's, this camera rocks it!Which makes my next point. Are you a real photographer or a hobby photographer?For serious photographers who use the 2.8 lenses for weddings, portraits... This is for you for a great price. For people who just shoot to post photos and don't care, think twice because of the price. You can get a D3300. Or a Canon if you choose them for about $1,000. Have any question I will try my best to answer.", "Date": "February 18, 2014"}, {"Title": "Cream of the crop.", "Author": "MassMan", "ReviewID": "R1PGVALN4CYJQC", "Overall": "5.0", "Content": "Always a Nikon fan, I recently switched to Canon for their full frame offering, a 6D. I was so utterly disappointed in it's horrific ergonomics that I couldn't switch back to Nikon fast enough.I've owned a D100, D200, D300 and used a D600 and various other Nikon film SLRs years ago.The best just keeps getting better.The low light ability is amazing. People will look at me funny when I'm shooting and my flash doesn't fire. They will say \"your flash didn't go off\" and I will just say \"yes, I know\".  Natural lighting is always nicer and this camera is a stunner. Plus, when you want a flash, there is one.  Shame on Canon for not including one on the 6D!! Fill flash in backlit situations is always a nice option....... if you have it !!", "Date": "April 29, 2014"}, {"Title": "Great Full Frame Camera", "Author": "Brian", "ReviewID": "R1NXQQBMWB7IC9", "Overall": "5.0", "Content": "Amazing camera.  I have upgraded from a D5100 to the D610.  Was easy to learn and customize the menu and buttons to my preferences just using the manual.", "Date": "March 31, 2014"}, {"Title": "Outstanding camera", "Author": "Steve Felker", "ReviewID": "R1QFIKZKCK23X5", "Overall": "5.0", "Content": "Let me start by saying that I do actually own this camera, unlike most of the people who decided to chime in and write a fraudulent review.  It doesn't say Verified Owner simply because I didn't buy it here.So, on to the camera.  It has exceeded all of my expectations.  All of my existing lenses work perfectly, and even my old flash mostly works (auto TTL doesn't work, but I can live with that until I buy a new flash).  The build quality is superb, and the picture quality it unmatched at this price point.  There is a fantastic review of this camera on photographylife dot com, go check it out.As for all of the D600 owners who are complaining and posting negative reviews for this model...  If you bought your D600 in the first couple weeks after it was released, then by all means, speak up on the D600 product page, you have every right to be upset about how you were treated.  I'd be throwing mine through a window at the Nikon corporate headquarters about now.  If, however, you bought your camera after that, then you really have no one to blame but yourself.  I almost bought the D600 when it was released, but I didn't rush in, and actually did some research first (it was $2500 after all!).  After only a week following its release, news of the oil and dust issue was making the rounds in photography circles, and shortly after that, it went viral on the internet.  Because of this, I passed, as should everyone else.  I was even considering spending the extra money on the D800, but they couldn't seem to get the left-side focus issues resolved, so I passed on that one too.  With the release of the D610, which allegedly fixed the oil and dust issue, I was still skeptical, I again waited a while to see what the early adopters had to say.  After everything looked good, I made my purchase, and I am very happy I did.", "Date": "November 2, 2013"}, {"Title": "Great first full frame", "Author": "jgo", "ReviewID": "R2GSJ5LRF97NF1", "Overall": "5.0", "Content": "I got this camera last week. Before the D610, I had used the D5100 for about a year, and before that the D60 for a really, really long time. I think the biggest differences between the D610 and the other cameras I used was the low light performance and the quick auto focus. I shoot a lot of sports, both indoor and outdoor, and need a fast shutter speed. I was able to bump up the iso to over 2000 and still get an acceptable picture. This is a great camera and I recommend it to people who are looking to make the jump from a crop sensor. Also, Adobe just released Lightroom 5.3 so the raw files can now be processed.", "Date": "November 11, 2013"}, {"Title": "An amazing camera with a couple of minor irritants....", "Author": "Sowmyan Ranganathan \"SR\"", "ReviewID": "R3188O75NJB40M", "Overall": "4.0", "Content": "This camera has a lot of reasons to love....1) Small size - cannot see a marked difference in size over the D90 despite the full frame sensor2) Low light performance - incredible low light performance - I have been able to capture portrait images with minimal noise in tough light conditions...much better than my D903) Depth of field - I am getting much better depth of field with this camera compared to the D90 (no slouch) with the same lenses4) Ability to crop due to the larger size images - the size makes it easy to crop and still get decent size images for larger prints5) Speed of focus - this camera focuses very fast and as a result I find myself capturing images quicker than ever before6) Size of viewfinder - Much easier as you can see the entire image and feels larger than my D907) More natural feel to images - I find the images to have more range and see a lot more tones in similar light8) Ability to zoom in \"Live View\" with a manual focus lens to get sharper focus (makes the manual focus lenses much more valuable)9) Two SD card slots - very convenientConcerns I have:1) The focus points are bunched up. If you want to focus on objects that are not within that central region, you have to use another approach (Hold the AF/AE and then recompose).  This has been the case for me a few times....2) The dual dials with locks are a pain to use (not easy to rotate)Still have to figure out a few things -1) Setting up U1 & U2 - get to my settings for most common types of photography quickly2) In-camera HDR - looks very promising3) AF fine-tuningSo far the pictures have turned out very well ...one thing I struggled with is using AF-A.  Have had to resort to single-point AF mode to get better focus on my subject (especially with landscapes, it is easy to have your subject out of focus in AF-A mode).I chose this over the D7100 (it is about half the price) because I had a few FX lenses that I really liked and wanted to take advantage of.  Can't go wrong with either...I tried the D7100 out and loved it as well.", "Date": "December 16, 2013"}, {"Title": "It's a fatastic camera", "Author": "Yellowdog", "ReviewID": "R20IX6GK5A11NO", "Overall": "5.0", "Content": "being a owner of many Nikon cameras in the past, the current I have is Nikon D800. Until most recent, I purchased this smaller size of D610 so I can switch in between with these two FX format cameras. My first impression of picture quality was stunning. The only thing that I am missing from this D610 was Nikon famous crisp shutter release sound. I realized Nikon has changed the shutter mechanism to be a bit quiet and less vibration, but it did not really bother me once I get used to it. Over all, I am impressed with this newly released D610.", "Date": "October 23, 2013"}, {"Title": "Amazing sensor in this camera", "Author": "S. Clyde", "ReviewID": "RURW6N4VVI3ZA", "Overall": "5.0", "Content": "I finally decided to make the jump to FX from my old DX D80. I couldn't quite justify the price tag of the D800 or any of the others, however. Fortunately I have not been disappointed at all with the D610. This camera's ability (paired with a good lens) to reproduce real-life colors is astonishing. In good light, I often feel that many pictures I take need little to no editing, especially in terms of color accuracy to the moment being captured.There are lots of other great perks to this camera as well. The live view is a welcome addition, though admittedly I prefer the view finder. There are lots of neat image processing features, but most, if not all require shooting in JPEG, which I almost never do. I'd rather do most of it in post processing anyway though.If you're not quite comfortable with manual modes yet (hopefully you are when you're considering spending this much on a camera) there are a lot of scene options available.", "Date": "April 7, 2014"}, {"Title": "So far so good", "Author": "T. O Rice \"timr688\"", "ReviewID": "R233FV3RAKF41O", "Overall": "5.0", "Content": "Have about 1600 shots and have yet to see the dreaded sensor spots.  Bought it to replace a D7000/18-200mm kit and am happy thus far.  Love the extra light sensitivity, as well as the ability to actually use ISO (which is useless on small frame).  Am also happy with the lens.  So far no creep, although I anticipate some eventually.  No need to go into great detail as there are plenty of reviews for the D600 and the 28-300mm.  Suffice it to say I have no complaints.Edit:  Over 4,000 shots and no spots.  Still no complaints about the camera.  The 28-300mm lens, however, shows substantial creep.", "Date": "February 5, 2014"}, {"Title": "Excellent!!!!!", "Author": "nmccamy", "ReviewID": "R20614XZ99LQQY", "Overall": "5.0", "Content": "I personally believe that Amazon should remove the comments here that are related to the D600 camera.  Most of them are sore losers, stuck with the inferior D600 and venting their frustrations in a puerile fashion.  Their reviews are not relevant to the D610 and only skew the ratings of an otherwise excellent camera.", "Date": "November 7, 2013"}, {"Title": "STUNNING!!! Very high build quality", "Author": "Drumachine", "ReviewID": "RAE2A667QL0CB", "Overall": "5.0", "Content": "STUNNING!!! Honestly I LOVE THIS CAMERA!!!! The images this camera produces are mind bending. The three lenses I purchased with this camera is the Nikon Prime 50 1.8. SHARP SHARP SHARP!!! The Nikon 28-300 VRII and the Nikon 14-24. WOW I LOVE NIKON!!! Glad I didn't pickup the D800 This produces the most amazing images I have ever seen and It's much lighter and less expensive than the D800, which is more of a studio camera. I'm a landscape nature extreme photographer so this camera satisfies more than all my needs.", "Date": "December 12, 2013"}, {"Title": "Really? Really?", "Author": "Coreyredd", "ReviewID": "R3N6HA7K7NW1X6", "Overall": "5.0", "Content": "This is a review for a new DSLR. There are people buying this brand new camera looking for reviews on the 610. This is not a forum to voice your inability to solve your 600 issues with Nikon. If you did not buy this camera. Do not leave bad reviews for those purchasing this camera. Your ridiculous. Sell your camera and go to Canon if you wish. But this is to inform new buyers about this specific model. Keep it that way. Don't poison the well. Perhaps you should have read more reviews about the 600.", "Date": "November 13, 2013"}, {"Title": "Loved the Camera, wish the diopter would work.", "Author": "MadMac", "ReviewID": "R27G8VOE5NF8UQ", "Overall": "3.0", "Content": "A LOT of research lead me to this camera, I chose this over the D800 to get the two user modes. I'm picking up photography after 30 years away, and I wanted a good FX format. The first camera came, and I could not get the viewfinder to come in focus. I thought I just didn't know how to work the viewfinder - and I shot 300 frames before I figured out the diopter didn't work.So, I returned it (AMZN did a good job here, though I had to do the shipping myself). Second camera shows up the next day. First thing I did was unbox it, power it on with a lens, and you guessed right - same problem. It went right back in the box - I didn't shoot a single frame - and I'll return it when AMZN and I work out the how (the first camera hasn't even made it back to them yet).But what prompts my review here, is that the online research indicates this is a very, very common problem, which includes the D800. My measure of \"common problem\" was finding more than five other instances like mine where I was shipped two consecutive cameras with the same problem. That's either manufacturing problems or it's poorly engineered and gets broken in shipping.You can find out what a working diopter looks like by searching on YouTube for \"Nikon D610 Diopter\". I should have shot some video of what a broken version looks like, since I've had two of them, but suffice to say that on the first camera - I didn't even know there was a status line at the bottom of the viewfinder with the speed/fstop etc.This WAS the right camera for me - if the viewfinder worked, I'd recommend it with five stars. But it doesn't. The most upsetting thing, is the loss of my time to figure this all out. Without Nikon admitting there is a problem - I'm off the Nikon gear. And it was the perfect Camera for me.", "Date": "April 2, 2014"}, {"Title": "Best step up to full frame ever.", "Author": "thegreatga", "ReviewID": "RZUM6T78CMETW", "Overall": "5.0", "Content": "I know the D600 had issues, but the 610 NONE!  I love this thing and take it everywhere.  The speed it focuses, meters, adapts are great.  The only thing I wish it had was dedicated ISO buttons like the D800.  While the D600 does have a dual purpose ISO button, I'd rather it be dedicated on the top or side.  I love the speed of the shutter, it moves so quick and solid it feels like a machine gun, and it feels like it's built to work.  I've had a Nikon D60, D90, and now the D610 and it's my favorite.  I've given my D90 to my opposite, and she used to love it but now she's played with my D610 I have to fight her off.  I debated quite a while on getting a D7100 and not going full frame, but in the end i'm glad I did.  Going full frame has given me so much more in my frames, and the opportunity to utilize my entire lens collection much better.  Also going back to DX lens has with this camera is a snap, it automatically switches back and shows a box within the viewfinder on whats in the frame.  The only negative thing about this camera is the battery life, this thing eats batteries so be prepared to purchase a replacement battery.  The ISO range and quality on this camera is subperb compared to my other models, where before moving above 1000 ISO was amost a no go, with the D610 its no problem the pictures still look amazing.", "Date": "May 22, 2014"}, {"Title": "Great Camera", "Author": "yayad", "ReviewID": "R3R4QZ47SGDUXY", "Overall": "5.0", "Content": "I bought this camera in October 2013. I'm an amateur photographer, I owned a D5000 for 3 years, on which I learned the basics of photography, I also invested in some decent lenses (not the top of the line but good ones e.g. Sigma 17-50 f2.8 (DX), Sigma 150-500 (FX), Nikon 35mm f1.8(DX)). I was interested in exploring new grounds with a full frame body and the D610 was a great choice. It was extremely easy for me to adapt to the new body and know my way to most of the essential buttons on the camera. The image quality, especially at low light with high ISO is stunning, noise is low and I usually get rid of it in lightroom.In my opinion, it is an excellent choice for an entry level FX. I got a 50mm f1.8G Nikon with it and I love it too.The only thing that owners of DSLR such as the D3000/D5000 series is the getting used to the two dials as well as the relatively new button locations such as the ISO, bracketing, AF settings ...etc. Once you get a good handle of those technical issues, you would concentrate more on the shot and produce stunning images.I know that this is is not a technical review of the camera, but I don't think also that this is a good place for full tech reviews more than personal opinions. I use the camera regularly and love it.", "Date": "May 21, 2014"}, {"Title": "Excellent in low light/high ISO", "Author": "Dick Locke", "ReviewID": "RKPVRW4WIV81W", "Overall": "5.0", "Content": "The things that drove me to acquire this camera were 1) the full-frame chip and 2) the performance at high ISO values & low light.  As I do a lot of night photography the latter is significant advantage, even over my D7000 which isn't bad.The camera takes excellent pictures even at ISO 3200.", "Date": "April 13, 2014"}, {"Title": "Love it", "Author": "canon", "ReviewID": "R21T1CZQDMAF1N", "Overall": "5.0", "Content": "It is my dream camera. Fully meet my expectation. This camera will give me more than what I'm capable to use.", "Date": "April 11, 2014"}, {"Title": "I love the 610!", "Author": "K. Ryan", "ReviewID": "R1KW2M3QL6XFVH", "Overall": "5.0", "Content": "I waited for Nikon to fix the issues with the D600 and I'm glad that I did. I'm a D7100 owner and I started shooting with a D40 about 4 years ago. I then graduated to the D7000 (which I sold to get the 7100) and have slowly improved my photography skills. I'm a novice and just enjoy shooting for the fun of it. A few friends think that I take great shots and suggest that I sell some prints, which inspired me to take the plunge and get a full frame camera. I love the D610. The extra sharpness that this sensor gives me is amazing! I'm so glad that I made this purchase. Being able to shoot video at 60fps (at 720) is a plus for me as well, and I get usable images even shooting at ISO 64000!!!I think I'll be using this camera for years to come!", "Date": "November 27, 2013"}, {"Title": "BEST DSLR ever made!", "Author": "M. Schau", "ReviewID": "R3NBP8I62IIQDM", "Overall": "5.0", "Content": "Upgraded to the D610 from my D90. Hands down, BEST DSLR ever made! If you look through the negative reviews, make note that NONE of them were written by a person that has used or owned the D610. Its a fabulous camera.", "Date": "November 15, 2013"}, {"Title": "Wonderful Camera", "Author": "Robert Mckay Jones", "ReviewID": "R35964PAD5J3JH", "Overall": "5.0", "Content": "I am an advanced amateur and this is my first full frame SLR.  Had it for a month and love the camera.  Upgraded from a D90 and D7100 which were also great, but I wanted the benefits a full frame camera provided.  Nikon does a wonderful job. The camera is slightly heavier than the D7100 and with the Nikon 28-300 lens is a couple of pounds, but what a wonderful picture.  Very pleased!", "Date": "February 4, 2014"}, {"Title": "Warning: This is a review of the actual camera!", "Author": "Jigsore", "ReviewID": "R2C98C436M2V5C", "Overall": "4.0", "Content": "This will not be a long review, but just enough to get some thoughts out there. First of all, I am not a very experienced photographer, but through the years, I have owned a couple of nice DSLR's, and many point and shoot models. A little over a year ago I purchased a D600. The picture quality was easily the best I have ever seen, and even with my limited skill set, I was getting many pro level photos out of it. My mother in law, who is a very advanced photographer was starting to use some of my shots for her desktop wallpaper, etc. After about 1500 clicks, I started to notice the specks on certain photos. After doing some research, I learned about the oil splatter issue, and returned the camera to Nikon for repair. They kept it for over a month due to a parts delay. Upon receiving the camera back from Nikon, it immediately had the oil issue again. First frame out of the box. I don't even think they did anything to my camera except possibly clean the sensor. I returned the camera once again, and this time the turn around was only about a week and a half. Again, spots on the sensor. So, I sold the camera to a friend of mine who is adept at sensor cleaning, and didn't seem to think it was that big of a deal. Next thing I know, the D610 is announced, and the word is that the shutter oil issue has been addressed. I decided to give Nikon one last try because I already had Nikon FX lenses, and the  PQ with the D600 was so outstanding, but promised myself that this would be the last chance they get due to cost. Well, I have had the camera since launch day, and I'm happy to say that it has been superb! So far, so good! Now I can focus on learning more about how to be a better photographer, than spending my time cleaning up my photos in Lightroom. I feel burned by Nikon for sure, but the camera is a winner. The experience was not.", "Date": "December 3, 2013"}, {"Title": "Awesome Nikon Full Frame Camera", "Author": "S. Mallory", "ReviewID": "R3H24JTQ7J2XJV", "Overall": "5.0", "Content": "It's an awesome camera.  I loved my Nikon D7000, but this is a lot better.  From the get-go, this has been a pleasure to shoot.  I fart in the general direction of all the people who gave this camera 1 or 2 stars - without having used it - because they weren't happy with the D600 and the way Nikon handled its faults.  Rate this camera on its merits, not because you're mad at the D600 and Nikon.", "Date": "November 10, 2013"}, {"Title": "Good camera (yes, I own the D610 and yes, I owned the D600 too)", "Author": "LA", "ReviewID": "R190RPCAIJCVKJ", "Overall": "5.0", "Content": "As the title says, this camera has \"fixed\" the problems that plagued the D600.  I had purchased the D600 as a pre-order when it first came out.  I had sensor oil spots within the first 100 images and I dealt with spending endless amounts of time cleaning up my images in Photoshop.  I had over 10,000 actuations on it (with sports photography) and had returned it to Nikon 5 times for sensor cleanings.  Actually, on the 4th return they replaced the shutter and the spots still returned.  So with my 1 yr. warranty approaching this fall I put my foot down with them and they offered me a full refund, which I took.  This was in September.  I heard the rumors about the D610 and waited until I could read a few reviews and tests on it.  Satisified with what I was seeing on the reviews I went ahead and purchased the D610 in November.  While I haven't had time to use it extensively since I received it I DO have about 500 actuations on my D610 and so far so good.  NO nasty oil spots.  It is such a pleasure to have clean images again.  I am very happy so far with the purchase.  I just wish the Nikon haters who don't even own it would stop posting all of their negative crap and trying to ruin the camera.  This camera is fine and has addressed the issues that the D600 had.", "Date": "January 2, 2014"}, {"Title": "Stunning images! Awesome camera!", "Author": "Jayant Kumar Gandhi", "ReviewID": "R225UX4F9JW57H", "Overall": "5.0", "Content": "Beware: All the bad reviews on Amazon are backlash of issues with D600. This version is supposed to fix those issues and the fix is working perfectly :)I upgraded from D3100 to D610 a few months ago. I love this camera. The images I get from this are so much better. I love the U1/U2 modes, the flash commander and infrared remote support. Much higher percentage of pictures from this camera become popular on 500px compared to D3100. Friends and family have been loving the pictures much more too.For the record I have only been using Nikon 28-300mm lens along with this body.", "Date": "May 6, 2014"}, {"Title": "Really impressed, coming from D7100", "Author": "Frankie \"Frankie\"", "ReviewID": "R33O6YPD22YX5W", "Overall": "5.0", "Content": "I was pretty happy with my DX-format D7100 (in the past I've also had a D7000, D90, D80, D70 and before that a Kodak 14N Nikon-mount full-frame camera) but had also looked forward to going back to full-frame when it became a little more affordable. Finally tried a \"refurbished\" D600 (before Nikon announced they were AT LAST going to address the problems with that model) but the sensor had dozens of oil spots right out of the box, so I returned it, coughed up the extra $$ and got a D610. I could not be happier, sometimes wondering if this might be the last digital camera upgrade I'll need (well, at least for 2-3 years!) I got it with the 18-35mm lens and am extremely impressed with sharpness/acuity as well as camera handling. There seems to be a \"depth\" to my images now I didn't see so much with the D7100 (usually with a very good 16-85mm on it.) The dynamic range seems greater than the D7100 had (I can't quote specs on this, just saying I noticed a real-world difference in Lightroom right away.) I cannot imagine why I'd need more resolution (say, a D800) for the work I do, which includes the occasional 24x36-inch print of landscapes, which look fantastic IMHO. At least some of the credit here should perhaps go to the 18-35FX lens, which probably outshines the 16-85DX in equivalent situations.We all know by now that Nikon has been very short-sighted in their handling of the D600 debacle. Nikon Japan and their US service departments are totally out of touch with their customer base in my view, simply awful to their customers, see Thom Hogan articles for more. But this particular camera hits the mark, for me at least. I have been increasingly tempted to go over to Canon like a couple of my buddies have done but will hang in there and hope Nikon sees the light, their recent offer of a fix/replace for the D600 is a small step in the right direction but way too late.", "Date": "April 28, 2014"}, {"Title": "Best Price Performance Nikon Camera", "Author": "Luis M. Chong", "ReviewID": "R3OX3Z3CPCNOBK", "Overall": "5.0", "Content": "I have had the opportunity to field test my N610 and after one month we have found an extraordinary ruggedness, reliability and price performance and reliability compared vs D300, D300s, D600 and D800.", "Date": "April 25, 2014"}, {"Title": "Money VERY Well-Spent!", "Author": "Contractor", "ReviewID": "R1PBBHU4LIZSQ4", "Overall": "5.0", "Content": "I don't think I can say anything bad about this camera.  I upgraded from the D90, and this camera is leaps and bounds beyond what I've been use to.  Much better picture quality in low lighting with minimal grain at high ISO.  The sharpness and picture quality in general is amazing.  I can zoom in 100X, and have the eyes of my clients still be tack sharp.This is a great camera for me as I am starting my own small business in portraiture.  I am very pleased with this purchase, and will probably end up buying a second down the road.", "Date": "March 22, 2014"}, {"Title": "theoretical good features-the worst customer service ever", "Author": "Jorge Anadon Arnillas", "ReviewID": "R1XT7D1KRVF596", "Overall": "1.0", "Content": "The camera D610 was bought in amazon.com in February, it was okay but with 1200 shoots, it started to have some spots in the images, always in the same area, and ruining my pics from Greek Islands.People said it is dirtiness in the sensor, the sensor was checked by nikkon seller and it's okay, it is clean. Then I contacted customer service from USA, they asked me for some files, they recommend me to send the camera, in fact they just give me a link with lot of requirements to send the camera, I asked the Spanish nikkon service if they could have a look, as I am living in Spain. and they said no, the camera should be sent to USA. The delivery expenses are not cover by Nikkon,  the delivery cost is 200 euros. and maybe the issue could be not cover by the warranty. Meanwhile Nikon just replies with confusing mails.It is unbelievable for me, that a brand as Nikon have this kind of warranties and customer services. Some people told me that they face many problems with Nikon D600, and I didm't believe them it was a mistake to buy this camera, The features are nice, camera is nice but when you have a problem, you are lost! In my case the only solution they offer me is spending 200 euros and then waiting for the camera for probably more than 2 months.Spending $2000 and receiving this customer service....no comments.Nikon D610 24.3 MP CMOS FX-Format Digital SLR Camera with 24-85mm f/3.5-4.5G ED VR AF-S Nikkor Lens", "Date": "May 15, 2014"}, {"Title": "D610", "Author": "Gary S.", "ReviewID": "R3KD1UB72B6YXU", "Overall": "5.0", "Content": "Received the D610 about a week ago. So far it looks like a five star purchase. I also have a D5100 & though it takes great photos the D610 is a real step up. I took low light shots at a Christmas program this weekend shooting 2.8f @ 6400 ISO to get enough shutter speed to minimize blurring. I was surprised that at even 6400 most of the photos needed minimal PP for noise, some I didn't use the noise filter at all. I bought this camera mainly for it's low light abilities and I'm not disappointed.", "Date": "December 10, 2013"}, {"Title": "A Great Camera for Walking Around with a Prime Lens (Apologies to the Df)", "Author": "P. Rowlands", "ReviewID": "R3MAUSQW3ZIJ2X", "Overall": "5.0", "Content": "I just bought the D610 as a backup for my D800 and for macro photography. The D610 is a great camera and the 24.3 mp sensor is much more forgiving than the D800's, especially for hand-held, natural light macro. And; my 65 year neck is very grateful; it's quite a bit lighter than the D800. Coupled with my 60mm micro-nikkor \"G\" lens, it's turning into a superb \"walking around\" camera. So far, after about a week, I've found the image quality to be excellent and my images are very sharp with the micro-nikkor. It's also very quiet. I'm used to the D800, which has a really noisy shutter release guaranteed to scare all the wildlife away.I only have two minor \"gee, I wish it would do this\" comments.  The auto-bracket function limits you to only 3 frames, at 0.3, 0.7, 1, 2 or 3 ev; not a deal-beaker, but I like to do HDR and I wish Nikon had designed the camera to do 5, or better  yet, 7 frames. The D800 will allow you to auto-bracket up to 9 frames but at no more than 1 ev increments. A little consistency, Nikon, please! Second, there doesn't seem to be a way of programming the multi-selector center button so that pushing it in playback mode immediately brings up the luminance histogram. You can do this with the D800 and I find it very convenient. Still the D610 costs a third less, so again, no deal-breaker.BTW, a bit of advice: If you want more objective reviews on the D610, go visit the product page on the B&H; Photo's website, in addition to Amazon's.", "Date": "November 30, 2013"}, {"Title": "Excellent camera, despite what the D600 trolls are saying", "Author": "Mike G", "ReviewID": "R22072BNC0CFDJ", "Overall": "5.0", "Content": "First off, I know it's crazy talk but, I think Amazon should only allow customers to review here if they actually own the camera.  If you own the D600 and are unhappy with it, please review it there.I'm an amateur at photography and upgraded from the entry level D3100.  This was definitely an overkill upgrade but I've always wanted to take professional grade photos.  I took the Michael Maven online D600 class which shows all features and settings (highly recommended) and purchased a few FX lenses: 1.4 50mm prime, 28-70mm 2.8 (refurbished), and a 70-300 4.5 VR2. I specifically waited until this camera came out due to all of the reported dust and oil issues from the D600.  After about 2000 shots, no dust or oil issues at all.As expected, picture quality is excellent.  There is a noticeable difference in contrast from my DX, even in auto mode.  The colors just seem to pop.  Also as expected, low light shots are brighter and can be shot with lower ISOs.  I'm not super impressed with the low light auto white balance but it's possible that it's on par with every other DSLR.  I just shoot in RAW so I can modify the white balance and exposure after the fact.  The auto white balance was supposedly modified from the D600 so not sure if it's improved or they made it worse!Overall it's a great camera and probably was a smart decision vs. the Canon 6D.  Seems like the Canon performs better in low light and has better video.  I just wasn't impressed with any photo samples from it.", "Date": "December 3, 2013"}, {"Title": "Based on the merits of the camera itself.....", "Author": "Thomas W. McGill", "ReviewID": "R3UDYJTU6CTV9V", "Overall": "5.0", "Content": "Every. Single. One. Of. The. 1. Stars. Are. People. Who. Felt. Burned.The problem is, that has 0 to do with this product.This is not the time or place to start complaining.The bottom line is the 610 is an excellent camera and I use as backup to my D800.  It's not as nice as the D800, nor it is as expensive.  This is an incredible full frame as it is.To the users of the D600:  Get over it, after a few thousand actuation and you'll have something every bit as good as the D610, likely at a lower price.", "Date": "November 13, 2013"}, {"Title": "love my 610", "Author": "Angela Dawson", "ReviewID": "R3V6WN2TZ0OLZZ", "Overall": "5.0", "Content": "First off, I love my new 610. Reviews are for the 610 model! We know the 600 had issues. Don't dis this product because you don't like Nikon's decision to release the 610. Add bad remarks to the 600!! Ok vent over.I really love the 610. Had about two weeks and I can't wait to take more images! Right now it's paired with Nikkor 50mm 1.4 g. Awesome images! I've used my DX lenses and they offered great images as well. I can't say enough about. I'm upgradeng from a d70. Big step but I looked over all my options and this was the best for me. If I get more work and jobs, my next step will.be the D800E. But for the work load I have it's perfect for me. -- Angie", "Date": "November 5, 2013"}, {"Title": "Great camera", "Author": "Erick", "ReviewID": "R3TNGROOXO18GZ", "Overall": "5.0", "Content": "Love my new D610, quality built, focus speed and the rich details I get, specially shooting in raw, it is my first full frame and I really enjoy it.", "Date": "May 20, 2014"}, {"Title": "Love the D610", "Author": "Keith Sparbanie \"Photographic Artist\"", "ReviewID": "R3EOVU7TT4A0B9", "Overall": "5.0", "Content": "Been waiting a long time to upgrade from my digital dinosaur, the D100. I was tempted to  save money and go for the D7100 and I'm glad I didn't. This camera is perfect for my needs right now.", "Date": "May 9, 2014"}, {"Title": "Works like a Nikon", "Author": "J. W. Nelson \"JWNELSON\"", "ReviewID": "R2QYUQ2XEDOK9E", "Overall": "5.0", "Content": "Does lots of stuff -- Time lapse, multi-exposure, filter effects, wide dynamic range by combining two photos and other post processing magic.  I found no noise at ISO 1600 (@ full mag.).  The more I learn, the more I love it.The 28-300 lens is very nice -- no zoom creep on mine.  It's pretty sharp in the corners.  I'm all around happy", "Date": "December 20, 2013"}, {"Title": "Buy it from B&H; instead. Same price plus free battery and memory card.", "Author": "Hunter", "ReviewID": "R1CH9QOQEFM690", "Overall": "2.0", "Content": "I'm a longtime Amazon customer but they screwed up on this one.  I purchased a new camera and what they sent me was a used one with 769 shutter clicks!  Not even factory refurbished.  Fingerprints all over it.  Nothing sealed.  I sent it back and ordered it from B&H; Photo.  Same price as Amazon but they also throw in-free spare battery-free Ruggard camera bag-free 16 GB memory cardI don't have any stake in B&H; and I am not benefiting from sending people there, but I recognize superior service and wanted to pass this along.", "Date": "April 17, 2014"}, {"Title": "Nikon replaced my D600 with D610!", "Author": "whmitty \"whmitty\"", "ReviewID": "R2CNG04OP8IW5V", "Overall": "5.0", "Content": "First, this is more of a notice than a full-on review of the D610 which is basically a \"spotless\" D600. I urge everyone with a defective D600 to contact Nikon and and see about getting a replacement D610. The dismal handling of the sensor problem by Nikon has precipitated a class action suit against them for not properly addressing the D600 shutter box failure before now. Perhaps that got their attention. They had already replaced my shutter box and it did not adequately solve my problem so I again contacted them and they decided to replace my D600 with the new D610. Even if they have not already replaced your shutter box they may want to cut to the chase and offer to let you send your bogus D600 in and they'll then send you a new D610 within a couple of days. I guess I should give them some points for that but they dropped the ball big time waiting this long.Anyway, for those only having heard of the D600 problems don't let those reports discourage you from buying the D610. I received my new D610 from Nikon last week and am happy to report this camera generates the same high quality photos I got from the D600 when I purchased it over a year ago except without the dreaded spotting.I'll forgo effusive stories about the great images I got with the D600 when the spots were not visible because there have been countless other excellent reviews of the D600 and the D610 is identical in that regard MINUS the spots. So the bottom line is that the D610 is an outstanding full frame option.", "Date": "April 13, 2014"}, {"Title": "nikon d610", "Author": "Bet", "ReviewID": "R1AU2MYOWXSB48", "Overall": "5.0", "Content": "Love the camera, it takes great pictures.  Has a lot of features I have not mastered yet.  Will have to read the book, their is a lot to remember until you use it a lot.  Would recommend it to anyone.", "Date": "February 5, 2014"}, {"Title": "Awesome images", "Author": "Michael C.", "ReviewID": "R34APNOBN9I0IH", "Overall": "4.0", "Content": "I had D300 for five years, just bought D610 this month. Image quality appear to be twice better than D300. I'm happy to move to FX. I just wish it has built-in WIFI. Maybe at this point Nikon cares more about image quality than WIFI. The WU-1B device does not connect to PC using a router, only mobile devices. I bought Nikon 1.8 and 2.8 lens. Aperture mode doesn't appear consistent in exposure level from wide opening to smaller apertures. The image taken at wide open appears to be always slightly darker than the rest. It's only slightly but no big deal. It can be fixable by adjusting shutter speed or ISO. I tested aperture mode range using D300 and D7100 and it appears to produce the same results so I would guess it's the general Nikon camera itself. Nikon probably thinks it's no big deal fixing this little problem that no one has complained about or notice. In White Balance, it has incandescent and no tungsten like Canon camera has. It appears slightly yellow, not white enough, but will try to test it some more. I would recommend the camera for excellent image quality but warn it has no built-in WIFI. Not many people are happy with WU-1B.", "Date": "January 30, 2014"}, {"Title": "Just Love this camera!!!", "Author": "Diane B. Harrish \"2 whippets mom\"", "ReviewID": "R2KNYJ4CWQS59I", "Overall": "5.0", "Content": "Prior to this camera I had a D7000 and was very happy with it but an event came up that I had to shoot in a low light auditorium and heard good things about it. I tried to hold a D800, and a D3 but both of those were way to heavy for me, not to mention I did not want to pay that much for a camera at this time, want to invest in better lens.Well I shot two events with this camera, both with no flash and was amazed at the quality of the pictures. Even in bright sun when sometimes I had to shoot with a flash, now I bump up my ISO and never get the flash in the sunglass's anymore.I also love the full frame and really glad I made the change. There was no learning curve since this camera is very similar to the D7000 and D7100. I have not had any oil problems with this camera and pretty much think this has been corrected. So if you want to go full frame and have a lot of money go with the D800, but if you want a great full frame that is a better value I would chose this one. It will not disappoint.", "Date": "June 7, 2014"}, {"Title": "Good so far", "Author": "angelina cooper", "ReviewID": "R1MABZMTBDLX23", "Overall": "5.0", "Content": "I love this camera so far. The photos are very vibrant and sharp. I had no problems adjusting the settings because I am a Nikon junkie anyway. I will one day give a more in depth review once I shoot more with this camera.", "Date": "May 24, 2014"}, {"Title": "Great camera", "Author": "Adam Hays", "ReviewID": "R32OT795S6LHCD", "Overall": "4.0", "Content": "I really like this camera.  I shoot with Nikon D3, D3s, D800e and I needed another full frame camera for portraits and bridal shots with a little more resolution than my D3 series cameras and the image quality is great with the D610.  My only gripe about the camera is the maximum shutter of 1/4000 of a second.  I love to shoot fast primes wide open in bright sunlight and 1/4000 of a second is not fast enough.  Great studio camera.", "Date": "April 30, 2014"}, {"Title": "Great Upgrade", "Author": "OneHour \"OneHour\"", "ReviewID": "R1NXD7XW408QLD", "Overall": "5.0", "Content": "I just upgraded my D7000 to D610 w/24-70 f2.8 and loved them!  My first forray into the world of FX.  Granted that it will be my bday/xmas presents for the next 5 years and then some, but it was worth it. I have taken close to 120,000 shots with my old D80 and D7000.  I thought that I have gotten some sharp pictures.  I was wrong. One thing that attracted me to D610 is the fact that most functions and dials are very close to D7000.  I was able to adapt to the camera without much effort. That was the deciding factor between the D610 and D800.  The D610 with the help of the 24-70mm lens is allowing me to be able to take shots in low-light condition that I have not been able to do with the D7000.  The D610/lens combo has allowed me to take very sharp pictures of my youngest at full speed during one of his recent soccer game.  The 6 frames per second seemed very responsive.  Comparing to my D7000, the D610 performs much better, producing much sharper images.  So far, I have not had to use Lightroom 5.0 to correct many pictures.I have not had a chance to test the video, but then again, call me old-timer, but I use the DSLR for still pictures.  I use my Sony HD video recorder for the specific purpose of recording motion!  If by chance I need a quick recording of the current event, then I use the video portion of the DSLR with no expectation other than to capture the moment!There are only two regrets that I have: 1) I miss my 18-200mm DX lens, much more versatile and lighter.  The zoom during a sporting event is needed, but it will have to wait until after I have recovered monetarily wise.  I am, however, eyeing on the 70-300mm f4.5-5.6.  That will complete the 24-70mm and 50mm 1.8 that I already have (can't afford the 70-200mm f2.8 ... had I won the mega millions on Tues ... the world of photography would have been mine!),  2) The second is letting go my four DX lenses and the D7000 which are being passed down to my son.  They are in good hands with him!  His \"hand-me-down\" D80 is being passed down even further to his younger brother.I currently own Nikon D610 as well as Canon Elph 520 point and shoot and Sony NEX-5R (not to mention my trusty Canon AE-1).  I love them all.  They each have their own unique strength.  Btw, for those who will try to goat me into the \"debate,\" I will respectfully decline to answer or comment.  This is my review of the product that I own, how I feel about what I bought, and how THIS product has performed for ME! ... and yes ... this is my first review ... and no ... I don't spend time to review all of the items that I purchased from Amazon.  It takes too much time!Update: Jan 1, 2014Took 952 shots (10.92GB), varying locations and venues, daylight to night time.  The D610 performed as well as its user's ability (me).  I got great shots and then some that are not so great (mostly due to low-light without a tripod).  I poured over the pictures by enlarging them in Adobe Lightroom and there were NO oil spots as indicated by a couple of the reviewers.  Perhaps, I am such an amateur that I don't know what an oil spot on the sensor looks like if it hits me square on the face!  Now, there were four shots that have spots (water spots), but there was a light sprinkle of rain during our outing.  Side-by-side with my sons' D7000 and D80, the D610's shots were sharper.  My third son was using my Sony NEX-5R. In the low-light, I had the ISO up to 3200 with no noise (f2.8). The D7000 was able to keep up.  The Sony NEX-5R struggled with the low light without the flash.  The D80 could not stay clean that high of ISO.  In the bright daylight, I like the Sony NEX-5R colors the best, then comes the D610 and then the D7000.One other interesting note that I didn't include before (due to the fact that it might cause controversy), an old friend bought the D600 about 7 months ago.  I did ask him about the D600's problem(s) during my 6 month research of the D600 and the D800 (while saving up the $).  To date, he has not had any.  Perhaps, he is one of the lucky ones.  I have seen his pictures of his daughters during their volleyball tournaments as well as his son's theatrical performances.  They were very sharp even under low light conditions.  He uses the 70-200mm, f2.8 lens.  These pictures were reasons why I decided to upgrade from my D7000!I will update if things change with my D610. As of today, I still love my new D610. My brother-in-law looked at it last night.  He is contemplating on upgrading his D700.  I told him to look make sure that he gives his D700 a chance to perform first!", "Date": "December 19, 2013"}, {"Title": "Great Camera, It's a Keeper for sure!", "Author": "Lauren C", "ReviewID": "R23RC65MY7XWEU", "Overall": "5.0", "Content": "Ok enough of the D600 bashing on the D610 review section please.You haters can go ahead and unlike the review if you wish, I understand the way you all may feel ( i would be angry if I was in the same predicament), but this is not the place for it, send down your blood pressure and move on...This review are for those actually interested in knowing how the D610 performs and not the d600.I've had my D610 for over a month now and absolutely love it. I moved up from the d5100 which I really used as a toy, now that my love and knowledge of using dslr has grown it was time for an upgrade of my camera and lenses.I didn't buy mine on Amazon but at B&H; since they were offering an extra camera bag, battery and memory included as a package for the same price.Anyways, all I can say is other than the AF which isn't an issue for me (just focus and recompose if necessary) I have no complaints. It really is super fast at 6 frames per sec, no oil specks (have taken about 2000 images with it already and sensor is still clean as a whistle), the location of the buttons to use are very convenient (I've already gotten used to them) and great image quality, (not to mention as expected when using it with my 50mm prime, the images are simply amazing).Other than reviewing all the technical nitty gritty stuff for reviews (which I'm not going to get into) this baby offers all that it claims to provide and I love it!", "Date": "December 9, 2013"}, {"Title": "610 an excellent camera", "Author": "Tikigirl", "ReviewID": "R3TJD3X8KOT9HX", "Overall": "5.0", "Content": "I've owned both Canon and Nikon FX cameras and I have to say I'm stunned by the quality and connivence of the 610. I can understand 600 users being upset, but being a first adopter of any company's product line comes with risks. Say you bought a $3,000 HDTV from Sony. Do you think they would give their customers a higher model TV if their earlier model had a problem. Of course not. Same with cars and anything else. You do your research, stay away from being a first adopter, stick with a name brand, and your chances of having a problem are reduced, but it is still a possibility of a problem. 600 users - just get over it.", "Date": "November 1, 2013"}, {"Title": "D7000 to D610", "Author": "R. Ostrom \"Rayooo\"", "ReviewID": "R297C9FPSY7385", "Overall": "5.0", "Content": "I'd owned a D7000 for a few years and it was far and away my best experience thus far with any digital camera.  My initial idea was to simply sell my 7000 and change to a 7100.  Upon the fast sale of my 7000, I was just about set to buy a 7100 when once again it hit me..do I want to go FX?  I'd heard of the issues with the D600, and then realized the D610 had been released, which seemed clearly as a means of fixing the shutter debris issue that many had talked about on the 600.I read many of the new reviews on the 610 and it seemed clear that the issue had been resolved, so I purchased one.I of course checked the sensor right off, it was spotless...after around 1000 shots it remains spotless, actually it's cleaner than my D7000 typically was. I'd cleaned the D7000 sensor a couple times in 3 years.The operation of the D610 is so similar to my 7000 that there's almost zero learning curve.  The low light performance is just another notch better than my 7000.All in all I'm extremely happy with it. ..but now I've got to consider some FX glass.", "Date": "January 12, 2014"}, {"Title": "Great full frame camera!", "Author": "Michael W. Howard", "ReviewID": "R207OXGLV2YITG", "Overall": "5.0", "Content": "I am very pleased with the Nikon D610. Excellent build quality, intuitive interface, many control options, compact and ergonomic. I've owned many great Nikons over the years, from the old film Nikon Photomic FTN to Nikkormats, to various Coolpix variations, as well as their first digital SLR, and this one is an incremental improvement on all of it's predecessors. Love the 28-300 zoom too, but my favorite is the 85mm 1.4G  lens. As close to a perfect camera as I've yet seen.", "Date": "January 9, 2014"}, {"Title": "Proud D610 Owner", "Author": "tadingle", "ReviewID": "R36JKTWK0XGXQE", "Overall": "5.0", "Content": "I am the proud owner of the new Nikon D610.  I cannot confirm the problems of the original D600 owners but I can tell you that the D610 is one amazing piece of engineering.  I have owned many different brands from Canon, Sony, and now Nikon.  I originally started my Nikon relationship with the famous D80.  I then upgraded to the D7100, which was a wonderful camera.  Now, I own the amazing D610.  I will not get too technical because that has been done time and time again.  However, I must say that focus is extremely strong, I have seen no dust at all on the sensor, and the image quality is simply immaculate.  I am extremely happy with this purchase.  I cannot wait to continue to put this wonderful machine through its paces.  I will update this review after more use.", "Date": "December 6, 2013"}, {"Title": "Great Camera!", "Author": "Evan", "ReviewID": "RL920RXK3GWW", "Overall": "4.0", "Content": "I have only had this camera for about a week so I can't speak for longevity. This camera offers some great features and great picture quality! So far I have no complaints and love it! I understand the issues with the D600 and also understand that this is \"basically\" the same camera. But, it is NOT!", "Date": "November 27, 2013"}, {"Title": "Impressed", "Author": "Cara Hinojosa", "ReviewID": "R1VGU7F6GL6ID4", "Overall": "5.0", "Content": "I have been using the D610 for almost 3 months now. I purchased it after reading all of the sensor spotting problems on the D600. After 6,000+ shots, so far no problems with the sensor. Great quality images and very usable controls/settings on the camera.", "Date": "January 10, 2014"}, {"Title": "First FX", "Author": "Wela34", "ReviewID": "R2FHPFFMHO303N", "Overall": "5.0", "Content": "I switched from a D7000 to this amazing camera!!  I'm so happy I don't think I will ever go back to using my D7000.  Auto focus in low light is perfect. If your going from DX to FX you won't regret buying this camera.  I'm now saving up for my 70-200mm!", "Date": "December 25, 2013"}, {"Title": "Ignore the negative reviews", "Author": "M. Jones", "ReviewID": "R29IZKAVN48PYL", "Overall": "5.0", "Content": "This camera is excellent. I upgraded from a D90, and I could not be more pleased with this camera. I have seen none of the reported issues from the D600. So if you have been waiting to find out if the problems have been resolved, then you should be able to get this one with confidence.", "Date": "December 31, 2013"}, {"Title": "First FX DSLR", "Author": "MJ", "ReviewID": "R2OURZJM29A85T", "Overall": "5.0", "Content": "Really impressed with picture quality and ease of use. I'm an amateur photographer who is delighted with the camera and lenses so far.", "Date": "January 3, 2014"}, {"Title": "great camera", "Author": "Marcus", "ReviewID": "R14VH1CK2CSJ9K", "Overall": "5.0", "Content": "Thanks thank you thank youLove it nothing better one of the best Nikon cameras I had ever had thank you", "Date": "June 6, 2014"}, {"Title": "Ignore the negative reviews", "Author": "M. Jones", "ReviewID": "R29IZKAVN48PYL", "Overall": "5.0", "Content": "This camera is excellent. I upgraded from a D90, and I could not be more pleased with this camera. I have seen none of the reported issues from the D600. So if you have been waiting to find out if the problems have been resolved, then you should be able to get this one with confidence.", "Date": "December 31, 2013"}, {"Title": "First FX DSLR", "Author": "MJ", "ReviewID": "R2OURZJM29A85T", "Overall": "5.0", "Content": "Really impressed with picture quality and ease of use. I'm an amateur photographer who is delighted with the camera and lenses so far.", "Date": "January 3, 2014"}, {"Title": "Great camera!", "Author": "merlin", "ReviewID": "R2CG24YRFSHRCB", "Overall": "5.0", "Content": "Is one of the best camera I ever have. The autofocus is fast, great camera fantastic low light, and daylight pics. You will love it", "Date": "October 26, 2013"}, {"Title": "Mixed feelings.", "Author": "Heston Quan", "ReviewID": "R39FR94NIBYEB2", "Overall": "4.0", "Content": "***Be wary!! Some models come with a broken diopter control! I got one***Compared to the D700:Pros:-Better in low light.-Nice file size.-Video capability.Cons:-D700's performance is a lot better (faster FPS w/MB-D10 and reacts faster)-Not as sturdy. Feels like a D200.-SD Cards and controls need getting used to.*I bought this camera mainly for non-sports usage. I tried it on a couple of soccer games and noticed that on occasional sequence shots, the first frame will be about a third of a stop darker than the following frames. Happened multiple times. Might stick with not shooting fast action sports with it because it doesn't seem to have that problem otherwise.Update - 3/20:-Upset the price dropped $100 after I bought it.-After running over 10k photos through the camera, I still like the file size, but I can't trust the camera to do the job with it's auto-focus on objects that are moving around a lot. You would think that after a seven-plus year difference between it and the D700, the auto focus technology would be a lot better. It's not. It's a step back.-The Auto WB is actually pretty good. Although, the yellowish/green cast of the LCD on the back would tell you different.", "Date": "February 23, 2014"}, {"Title": "One Nikon to Rule them all", "Author": "Douglas A. Clark \"dcedit\"", "ReviewID": "R2Z0XTLVLWDI3I", "Overall": "5.0", "Content": "I have a D70 and a D3100, so this was quite an upgrade for me. I love everything about my new camera. I got the 28-300 kit - Super fast focus and handles low light situations pretty well. It is a little more weight than I am used to, but I paired it with a BlackRapid strap and all is good. I'm not real crazy about the bag that came with the kit but I guess it was an added bonus.I also took some photos with my 50 portrait lens and wow - INCREdible detail - plus the 610 gets the focus right far more consistently than my old D3100 was doing.Overall very pleased so far - Glad I stuck with Nikon.", "Date": "January 15, 2014"}, {"Title": "Great entry level full frame dslr", "Author": "Michael Robinson", "ReviewID": "R1YUUT9OZCK6X3", "Overall": "5.0", "Content": "I believe this is the best value in a full frame dslr.If you do not believe me read dxomark.com,they list this sensor higher than Canon 7000$ dslr sensors.I find the programed u1 and u2 feature to actually make this camera a better choice for every body including people thinking of purchasing a  d800 and d4 camera's which are very specialized cameras.If you are a Nikon person(heavily invested in Nikon equipment including dx)the d610 is the better choice for the average photographer.If your moving up from a dx dslr,don't worry all your lens are compatible on the d610.Just make the full frame plunge, the extra light the sensor takes in makes pictures soo much better and easier to compose.If you have the money, I can not think of a reason not to buy the d610.", "Date": "December 17, 2013"}, {"Title": "I Love my D610", "Author": "P Sandoval", "ReviewID": "R2EKI4Z3HLQI99", "Overall": "5.0", "Content": "Ok so I owned a D600 did not have any issues with that one. I now own the D610 and don't have any issues to report on this one either. For all other people that have exhibit issues with their own D600 Nikon has offered to repair the issue. It's not like they stand by and did nothing. And rather than having the issue continue they released the D610. It's a great camera both are really great cameras. It's a dirty sensor guess what In time they all get dirt dust whatever on the sensor. Clean it and get over it it's not like the camera does t work. Just specks on the sensor. Either way this new edition is well worth the investment worth every penny. For anyone interested in purchasing this camera just do it you won't regret it one bit. Disregard all the rants from non D610 owners. I Did.", "Date": "November 5, 2013"}, {"Title": "Nikon D610 is Fantastic DSLR", "Author": "Dave M", "ReviewID": "R4UBXSNSBPL54", "Overall": "5.0", "Content": "After using this camera, I feel very put upon if I have to step back to my D90.  While the D90 is a very utilitarian product, it doesn't compare to the fantastic D610.", "Date": "January 9, 2014"}, {"Title": "My first impressions of the new (affordable) FX Nikon DSLR - With an update after having the D610 for 6 months!", "Author": "blackhawkjohn", "ReviewID": "R2ILE59RUPV7P8", "Overall": "5.0", "Content": "First; Kudos to Amazon for prompt and reliable service. Now, let's talk Nikon! I have been a Nikon shooter for over 40 years. I guess I haven't found a compelling reason to use anything else. If you are thinking of making the transition to an FX (full frame) camera, you might want to have a look at the new Nikon D610! I have been shooting with DX cameras and hadn't made the leap to FX due, entirely, to their price tags! But, as with all things digital, the prices will eventually come down.I decided on buying the FX format D610 camera because of 1) price and 2) similarity to equipment I already use. Allow me to explain. When the D7100 was released for sale back in March 2013, I pre-ordered one to backup my D300s. The D7100 turned out to be my primary camera and the D300s became my backup! When Nikon announced the D610 I discovered that it uses the same battery as the D7100. And that the controls are nearly identical to the D7100. That's what did it for me!I already owned 2 FX lenses which I've been using on my DX cameras, so the upgrade was less painful. FX lenses are expensive and the ones I already had were perfect for the D610 and the type of photos I make. Having said that, my DX lenses will work well on the D610 - which gives me the option of an auto-crop function (1.5X factor)  to accommodate DX lenses.The controls are in the same location as the D7100 which made for a short learning curve on the D610. I have just started making photos with the 610 and so far, I am very happy with the results. The overall pixel dimensions are only slightly larger than the 7100 - 4016 X 6016, where the 7100 is 4000 X 6000. The real difference is the FX format is that the pixels are larger on the larger FX sensor and the file sizes are about 8 mb larger. That doesn't sound like much until you need to apply a major crop to an image - in that case, I'll take all the pixels I can get.The D610 is a speed demon! 6 high resolution RAW frames per second! A word of caution tho on FPS ratings. You need to be using an extreme SDHC card with a write speed of 94 mb/sec or faster. Not all UHS-1 rated cards are equal. You'll find them rated as UHSC-1, Class 10 with speeds ranging from 45 mb/sec to 95 mb/sec. The higher the card speed, the faster you can shoot! Amazon sells some Sony 16gb SDHC card, twin packs (2 cards) for around $35. (see my review on these cards posted elsewhere)I'll be updating this review as I make more photographs with this amazing camera. I decided to give my first impressions if it'd help someone who is debating on going to the FX format. Go for it!______________________________________________________________________________________________________________________________________________________________________________________________MAY 2014 UPDATE on my D610...I have made just over 5000 images since I bought the camera 6 months ago. Guess what? I LOVE THIS CAMERA and, NO, there aren't any sensor spots which plagued the D600. Nikon solved this problem by redesigning the shutter in the D610. It's my understanding that Nikon will replace the shutter in your D600 at no charge and you'll find info on that at the NikonUSA web site. Now, back to the D610...IMHO, this is the best bang for the buck! As I mentioned in my earlier review, the D610 and the D7100 are very similar in form and function, with a couple of minor diffs. The ISO on the D610 will go down to 25 ISO and the D7100 has a minimum ISO rating of 100. Not a problem. The ISO settings button on the D610 is located one button lower than the D7100. I have recently decided to shoot using the Auto ISO setting and it works very well. The image quality is what I've grown to expect from Nikon - superb! In fact, I purchased the new Nikkor 105 f-2.8 Micro lens, which I can use on both bodies. It's the first Nikkor Micro that has VR (vibration reduction) and when I mount it on the D7100 it becomes a 157 mm f-2.8 which is great for shooting things that can do you harm and the additional distance can get you out of the way of the available light.The D610 is great camera! If you don't have a few extra thousand $ to spend on the D4s or the D800e, this is a no-brainer for getting into an FX camera.", "Date": "December 18, 2013"}, {"Title": "Exceptional Images!", "Author": "seamus", "ReviewID": "RMDDOSYV5VXQ", "Overall": "5.0", "Content": "Nikon D600I didn't buy my camera from Amazon-got it as a surprise gift from wife who knew I wanted it. The images of this camera are exceptional and to me that's what it's all about. As an enthusiast this camera suffices for my needs and the cost benefit for a full frame is acceptable. Other than the placement of the ISO button which doesn't make it easy to change and keep your eye at the finder at the same time (a minor irritation for me)  this full frame is a must to have. I have just been shooting the whole afternoon till evening-no dust or oil particles here. If nikon was correcting the dust/oil issue in this camera (IMO that was the purpose for the release of the D610) they have succeeded. If you hesitated to buy, like I did on the D600 after reports oil and dust, I wouldn't hesitate on the D610.", "Date": "October 26, 2013"}, {"Title": "Great camera worth the investment if you don't own the D600.", "Author": "Bruce A. Jastrow \"Photography\"", "ReviewID": "R140GI3UFOZ9S0", "Overall": "5.0", "Content": "Great camera solid made has quiet shooting modes and only a hint of improvements over the D600,  Best of all there is no oil spots.", "Date": "November 29, 2013"}, {"Title": "Wonderful Camera, but spots on sensor", "Author": "BookLover", "ReviewID": "RFR72P2HETQXV", "Overall": "3.0", "Content": "I really, really, liked this camera and loved the photos. I had the D600, but due to sensor issues, Nikon refunded my money for the D600. When the D610 came out, I waited and it seemed like the sensor problem was resolved, so I bought it. Very happy with it, had the automatic sensor cleaner on at both start up and shut down, and it looked like the pictures were clear. I went on a two week vacation the day after getting the camera, NEVER changed the lens (so doubtful much dust would have gotten in via lens changing), and was pretty happy. Then, I got home where I was able to download my pictures onto my home computer w/ 21\" monitor and start doing some conversions to B&W;, that's when I saw it - a multitude of sensor spots on the image. Sensor clean and blowing w/ a Giotto blower did no good. So I packed up the camera and returned it. I think that the spots probably would have disappeared w/ a wet cleaning, but here's the catch - Nikon requires that only a certified Nikon facility clean the camera, or warranty is voided. And I just didn't want to get on the carousel of sending my camera to California every time I had sensor spots that could not be removed by regular means. I clean my own Nikon D70s with a swab with no issues, and if Nikon didn't have warnings to consumers about the D610 needing to be returned to Nikon for cleaning to keep the warranty, I'd probably have cleaned it and kept the camera, But better to send it back while I can still get a refund.As for the 28-300 lens - loved it.Shoulder bag - great, and worked wonderfully on my road trip to carry my camera, computer, power cords, etc.", "Date": "March 5, 2014"}, {"Title": "Glad I waited for the 610", "Author": "Matthew McLelland \"outdoor guy\"", "ReviewID": "R2O33U7X6DXVUH", "Overall": "5.0", "Content": "I wanted - really wanted - to buy the 600 a year ago but like most of you, was scared by the thousands of negative reviews for white balance issues and dust spots.  So I struggled through 12 months with my trusty Nikon D90 - anxiously awaiting for Nikon to do something.  The 610 was, eventually, their response.  Even though they never admitted (publically) an issue, the creation of this model is undeniable proof that the 600 was flawed.  I hope Nikon suffers because of this - its a classic example of how not to respond to a flawed product.  I was very close to switching to Canon at one point.I'm glad I waited - so far, I can find no issues with this camera.  The D600 is a much better solution for me than the D800 simply because I don't need the 36MP sensor - which is fantastic but creates larger file sizes than I really need for the type of photography that I do.  You can read all the super tech opinions on other reviews - I'd just be echo-ing their opinions.  I'll simply add that if you were like me and waiting for the D600 fiasco to reach an acceptable solution - the 610 is your answer.", "Date": "December 19, 2013"}, {"Title": "Dust spot issue continues", "Author": "Elizabeth Haslam \"Liz\"", "ReviewID": "R16DSCYB72UHE4", "Overall": "1.0", "Content": "I bought the 600 and sent it back 4 times for repair and replacement.  Ultimately I demanded and Nikon agreed to give me my money back.  I decided being an early adopter was not a good strategy.  So when the 610 came out I waited several months to see if this camera repaired the dust/spot issue.  I really didn't want all the megapixels of the 800.  The 600/610 seemed to hit a sweet spot in affordability and megapixels.  I had this camera a few weeks and I began noticing dust through out the sensor.  I decided it must be the lens.  So I cleaned three lenses thoroughly and tried each--50 mm, 28 to 300 and 14 to 24.  Each image taken, no matter the lens showed an increasing accumulation of dust in the upper left hand corner. Ground hog day all over again.  I sent it back and bought the 800e and so far I am a happy camper but have a late/hate relationship with Nikon.", "Date": "January 8, 2014"}, {"Title": "KEEP OFF THIS PAGE IF YOU ARE NOT REVIEWING THE D610 !", "Author": "Bart Sayle", "ReviewID": "R2LWOORXWFOENZ", "Overall": "5.0", "Content": "The D610 is a great camera!I also have the D3s, 700, 7000 and was holding out for the 800E after seeing the reviews for the D600.So I'm happy that I waited and Nikon solved most of the problems for the 610.Amazon should take down all but bone fide reviews of the 610 in this stream.It's cluttered with resentful comments from resentful buyers of a different camera - the 600.Most of these people bought the camera even though there were many early reviews of its faults!Go to the Nikon 600 page to post your angry, upset One-Stars and leave this page to real owners and users of the 610!", "Date": "December 4, 2013"}, {"Title": "Outstanding!", "Author": "atticus", "ReviewID": "R5D33M5W0K3O", "Overall": "5.0", "Content": "Fantastic camera, fantastic service from UniquePhoto.  Arrived a day ahead of schedule.  Just couldn't be more pleased.  Will definitely shop with them in future.One thing.  Lens caps do not appear to have a hole to thread a string for safekeeping.  I can work on that.", "Date": "May 12, 2014"}, {"Title": "FX not really worth the added cost.", "Author": "K-Dub", "ReviewID": "R2O4BRYFDB9QIH", "Overall": "3.0", "Content": "Have been using DX Nikons since the D70, and was ready to be blown away by the difference in FX with the 610, but quite the opposite was the case. Aside from the added pixels per image and a slightly more spacious viewfinder, I could not find an additional $800-900-worth of value over the D7000 I now own. Amazingly, the 610, together with a 70-300 VR FX zoom, created a seriously vignetted image on a clear, sunny day in one of my test runs, something I never get with a DX body. Internal camera controls may have been able to deal with that flaw, but why should I even have to worry about it? Never had to with film cameras... Anyway, my curiosity with respect to FX has been completely satisfied and I won't have to spend any more in the future to try it again. However, kudos to Amazon for allowing me to return it and even refunding shipping for both directions! Now that's a big deal!", "Date": "April 9, 2014"}, {"Title": "Love it!", "Author": "Lacy", "ReviewID": "R1V4TN7R1MJI2N", "Overall": "5.0", "Content": "I love the D610. The photos are clear, crisp..and the camera is a delight to handle. The numerous features offer a flexibility I have not had before. While I almost always shoot in aperture mode it is a delight to realize I have so many options and the control functions are easy to use and understand. There are no signs of oil spots and I have used mine to shoot several 1000 shots so far. This is my first FX format camera and I will not be going back! I have read extensive reviews of this camera and they have all been positive until I came here...seems people are still upset about the D600?", "Date": "December 18, 2013"}, {"Title": "love my first full frame camera", "Author": "IB", "ReviewID": "R46WEQYCX5EQJ", "Overall": "5.0", "Content": "the d610 is a wonderful upgrade from my d7000, which was awesome too, and by the way, i would still have had it not been brazenly stolen right off my back in Spain", "Date": "December 27, 2013"}, {"Title": "Auto-focus doesn't work ..and the dust saga continues. Where's the quality control NIKON?", "Author": "ASETH", "ReviewID": "R3HT741YTHMNBY", "Overall": "2.0", "Content": "I have been a D5000 user for the last 4 years. Decided to upgrade recently and after researching the D7100, the D610 (and it's predecessor the D600) as well as the D800, I settled on the D610. The camera arrived about 10 days before I was leaving on a trip and during those 10 days I played around with the settings / controls and shot some pictures in and around the house. Everything seemed to be fine. The first time I tried to use it on the trip the shutter would not release. Luckily I was carrying my backup body and after some experimentation with different lenses I quickly realized that the issue was that the auto-focus mechanism in the camera had stopped working. After taking a few shots under manual focus at F/22 I also noticed 5-6 fairly large dust/oil spots on images with blue skies.I just got back from the trip and Amazon was extremely helpful in setting up the return / exchange so the camera is going back today (luckily it's within 30 days of delivery!). I will request a replacement for now hoping the replacement will not be another lemon. Will seriously consider selling all my Nikon gear and switching to Canon if that happens - which is a shame because I do believe that Nikon makes a great product, when it works.", "Date": "April 10, 2014"}, {"Title": "Great camera", "Author": "MurphysArt", "ReviewID": "R2CSD5KWGCJ4DA", "Overall": "5.0", "Content": "I expect my star rating to reflect anything further I could say about this product. I bought it, I use it and I like it!", "Date": "December 22, 2013"}, {"Title": "D610 with oil spots out of the box", "Author": "bcn2", "ReviewID": "R2KQFZQ8IQ0MVE", "Overall": "1.0", "Content": "Just received a new D610. Same oil spot issue left upper quadrant as with my previous D600. Started out with 3 spots on 5th shot, after 200 clicks now 10-15spots. You see these spots best when taking pictures of a deep blue sky with higher aperture F13,  70-300 lens zoomed out. Doesn't look like Nikon has fixed the sensor/oil issue with this camera. Has anyone had this issue with their D610?", "Date": "December 14, 2013"}, {"Title": "No dust/oil issues", "Author": "R. Pedrosa", "ReviewID": "R3DJ0GGSR41Q7Z", "Overall": "5.0", "Content": "The problem seem sto have been solved, there's a test on that already in the internet (google Mansurov). This is the great camera that the D600 was supposed to be, w/o any issues.", "Date": "October 23, 2013"}, {"Title": "Buy it", "Author": "Mauricio Fuzimoto", "ReviewID": "R3RYLTYNXV1Y8J", "Overall": "5.0", "Content": "Full frame is The camera. Great image and good touch and fellingI recomend for serious lovers and enjoy it", "Date": "January 28, 2014"}, {"Title": "Happy with the Upgrade", "Author": "D. Sims", "ReviewID": "R1X241ZJN3BBFV", "Overall": "5.0", "Content": "Great camera body.  I have noticed a marked upgrade in quality from my D200 images.  Also like the internal editing feature which allows some creative work in the camera.  It preserves the original file and saves the edited as a new file.  Low light, hi ISO pictures have very little digital noise.", "Date": "December 7, 2013"}, {"Title": "Astonishing Image Quality", "Author": "Phantom", "ReviewID": "R1E5GQ48S8U7I7", "Overall": "5.0", "Content": "Let me first say that I own and have used a D600 for 7 months now, and since that product is going away, I haven't had any serious dust/oil issues, and this the exact same camera without those issues, I felt is was fair to review it here. Certainly more fair than the other D600 owners who flamed this new version in other reviews below. To be clear, I don't own the D610 also, but have put the D600 (same exact camera/sensor, but with different shutter) through the paces.I moved up to full-frame after using a Nikon D5100 APS-c camera for a few years. First trip out with it was to Zion NP and the Grand Canyon. The controls are easy to use and certainly a step up for me having more buttons on camera with direct access to ISO, WB, and more. As others have and will mention, the RAW image quality just blows you away. Even after 7 months, when I import files into my MacBook, I still can't believe how good the dynamic range, detail, and colors are. Furthermore, if you really want to play with the images in Aperture/LR, it's amazing how far you can stretch them without degrading the image quality. Lifting shadows or dimming highlights if necessary expands the already great DR. The Sony sensors that Nikon has been using in here and in others really are the best on the market right now. I can't imagine needing anything more than 24 megapixels unless I were a pro making wall-sized prints.Since I wasn't heavily vested in the Nikon system before, and had used and enjoyed Canon cameras in the past, I took several months debating between the D600/610 and the Canon 6D. The Nikon seemed like a clear winner but was still hesitant because of the dust/oil issue (and Canon does have a nice lens offering). Now that the shutter has been replaced in the D610, I really think it's no contest. Unless you're heavily vested in Canon glass, the D610 is the way to go. The 100% viewfinder coverage really seals the deal. After using 95% coverage in my old D5100 (the 6D is 97%), I couldn't stand 'guessing' at what was going to be in the edges of the frame and really didn't want to have to live with that again in a $2k camera.I bought a new 18-35G lens with mine which has been great too. It is unfortunate Nikon has kind of screwed many of the D600 owners by not originally addressing the dust issue, but for what it is the D600/610 is an absolutely phenomenal camera.", "Date": "October 23, 2013"}, {"Title": "Great camera - lousy Nikon customer loyalty practices", "Author": "Gene Piatigorski", "ReviewID": "R21ZA4HBDD9X1F", "Overall": "4.0", "Content": "I purchased this camera to get into the FX format. My current camera is the D7000 (that I love too). My previous camera was the Nikon D80. Before that I owned various Nikon film cameras, that I no longer use.I sympathize with those that purchased the D600, and I am just as pissed off about Nikon's lack of customer loyalty by not providing a remedy for the D600 fiasco. My recommendation to those that still have the Nikon warranty and their state laws allow it, to claim 'lemon' law for the camera after the 3 sensor cleaning attempts from the Nikon customer service and the re-occurrence of the spot issue after the cleaning has been performed.I tested my D610 for the sensor spots by shooting at F22 as soon as it came out of the box. My camera does NOT have the issue. The sensor appears to be squeaky clean - first out of the box, and then after the many test shots.I was considering the Canon 5D Mark III because of the D600 fiasco. Since I am a long-time (decades) Nikon camera user, I have a collection of lenses and that tipped the scale for me towards the Nkon D610 given the multiple reviews that informed me that this camera does not seem to suffer from the sensor spots issues. I also considered the Sony A7 (and A7R), as well as the Nikon D800. Sony was ruled out for the same reason as the Canon. Although, I was intrigued by the smaller form factor in a full frame package. However, the current lack of body-specific lenses for the A7 was another reason I wound up eliminating the Sony. Since the lenses that fit the body currently were not designed to be physically smaller to match the body size. The D800 was too much camera for my needs and was too slow for my most frequent use cases - sports/action photograhy. I did not want to deal with the size of the files coming from the D800 (I typically shoot RAW to be able to post-process). I also considered getting the D7100. If I did not own the D7000 already, I would probably have settled for that. However great the D7100 features are, that camera is not significantly different from the D7000 for my needs, tipping the scale towards the D610 (since I wanted a full frame camera in the first place).The D610, for me, represents the best value for my purposes. Part of me wishes that I could have the budget to invest into the Canon lens market and purchased the 5D M3 just to keep solidarity with the D600 customers who have been treated very unfairly by Nikon. Unfortunately, at this time I can not. Given the opportunity in the future, I will likely move away from Nikon. For that reason, I took away one star from an otherwise great camera.", "Date": "December 13, 2013"}, {"Title": "Iniatial impression of Nikon 610 and Nikor 28 300 lens.", "Author": "Will Hogan", "ReviewID": "R3NL8TT0AN9SMU", "Overall": "5.0", "Content": "This is clearly a good choice for my interests as a wildlife photographer. Its full frame sensor and relatively high megapixels allow good speed as well a good low light performance. So far, I am very impressed.", "Date": "January 12, 2014"}, {"Title": "Awesome!", "Author": "Gregory Duggan", "ReviewID": "R2Z9BHIDHKPDK7", "Overall": "5.0", "Content": "This takes nikon to a whole newEven. Best camera ever for entry level full frame photographers. You will love it.", "Date": "October 23, 2013"}, {"Title": "This camera is AWESOME!...", "Author": "ChicagoAmazonian", "ReviewID": "R2ZQ0BMZDWUE36", "Overall": "5.0", "Content": "... Unfortunately, some of the reviewers here aren't. Amazon product reviews for the Nikon D610 are no place to air your grievances with its predecessor.", "Date": "October 28, 2013"}, {"Title": "Love this camera!", "Author": "Nick Garcia", "ReviewID": "RQACXVTKZ65T2", "Overall": "5.0", "Content": "i had been researching the d600 for months...and i was just waiting for the price drop.then i decided to bite the bullet on the 610, it's fantastic!", "Date": "January 26, 2014"}, {"Title": "Great cam - nicely priced", "Author": "ICONMAKER", "ReviewID": "R184XIN74MR5B0", "Overall": "5.0", "Content": "Camera has everything going for it. It's not too heavy incredibly versatile and all my images have never been this sharp. Love this cam - btw- full time pro 25 years.", "Date": "December 15, 2013"}, {"Title": "My Take (coming from a Sony)", "Author": "Amazon Customer", "ReviewID": "RDV69X1G7Y63M", "Overall": "3.0", "Content": "This is an initial review of this kit - be mindful this was after one day (7hrs) of making it a point to go out and take practice shots and to better familiarize myself with Nikon. Bear in mind that others that are coming from a Sony might find this more helpful or anyone who has never used a Nikon.I am coming from 7yrs of using Sony Alpha (700 & 77)and the reason I changed was the noise performance on Sony's is dreadful.Now, I can see the weight being an issue from hand-holding this all day (same I used to do with the Sony). The grip in comparison is smaller so there isnt the same comfort level when walking or moving about. I did this throughout the day but I was more aware of my grip then normal.There are a ton of features/options on this camera so that takes some time to understand them and find the right mix. I was a big fan of the in camera enhancement on the Sony for vividness but have yet to dial that in on the Nikon.At the moment I am not a fan of the selection method for such things as ISO, WB & Metering - the need to perform this with dual buttons is cumbersome and tedious.I can also say from when the moment that you take a picture, it saves to the memory card and is ready for viewing - the Nikon is much slower then the Sony.All in all I am neutral at the moment on this purchase - in the back of my mind I am wondering if the Canon 6D would have been a better choice. Time will tellPS - I did forget to mention that it appears as if I already might have spots on the sensor...I am not as forgiving on products as the cost increase so at the $3K range - not pleased.**UPDATE 4/6/14**Ok, I am uploading two pictures from a series of tests that now unfortunately make my decision to send this product back. Plane and simple - when a consumer makes a purchase in any dollar range let alone the $3K mark I expect a level of quality and even more so on a model that should have had corrections for certain defects.", "Date": "April 5, 2014"}, {"Title": "Excellent Filter -- No Distortion", "Author": "Elderly User", "ReviewID": "R1WD818XZ26ZXN", "Overall": "5.0", "Content": "I took photographs at max resolution on a Nikon D610 (FX) and I could not see any defects when using this filter.", "Date": "March 10, 2014"}, {"Title": "Still the oil/dust issue", "Author": "ana ortega", "ReviewID": "R6R6QXTAL04J0", "Overall": "1.0", "Content": "I had a D90 for 6 years, never cleaned it and never had dust problems with the sensor filter. Now I bought the Nikon D610 and since I received it, there is dust or oil spots in the sensor. Nikon Support just told me to cleaned it as it says in the manual but obviously the 2 spots are still in all my pictures!!! I regret not changing to Canon!!", "Date": "February 21, 2014"}, {"Title": "Great Camera!!!", "Author": "Side Car Bubbler", "ReviewID": "RXX4N6M8ZGCIK", "Overall": "5.0", "Content": "I am new and I only have about 500 images through my D610.  My images have been crisp and the overall behavior of the camera has been flawless.  I am loving my decision.", "Date": "December 15, 2013"}, {"Title": "Blurry Viewfinders in 2 D610's", "Author": "John L. Mcdonald", "ReviewID": "R2CF4OIN4S7L3G", "Overall": "1.0", "Content": "I ordered a D610 and received it on Jan 26th. Charged up the battery and tried to use it. Viewfinder was very blurry, could not be resolved by using the diopler adjustment. Called Amazon and they sent me another one ASAP. I was to have UPS pick up the package at my home. I picked up the second one at the UPS office on Jan 28th. Again camera has a blurry viewfinder. Spoke to several people at Nikon Service. Nothing they had me try worked. They wanted me to send it in, to them, for repair. I did not want to wait a couple of months for this. Contacted Amazon to return the 2nd one, tried to change to get a D800. 2 strikes and the 610 was out. Amazon said I had to return the 2nd camera at my expense, It has been sent back costing me over $47. I lost my home to a fire on Dec 11th, need a camera to get back to doing some work, until insurance replaces my lost equipment. I have never had this much problem in 33 yrs of Nikon camera usage.", "Date": "January 31, 2014"}, {"Title": "Oil Spots", "Author": "mp_atl", "ReviewID": "R1CYIPUYB8E0O0", "Overall": "1.0", "Content": "I am a professional photographer and have always used Nikon until now.  There was well documented issues with the D600 and this was the supposed fix, but oil spots are still present on the D610.  I purchased 2 different D610s and straight out of the box a few hundred shutter clicks and the oil begins to build up.  Save yourself time and headache and purchase Canon 6d .", "Date": "May 15, 2014"}, {"Title": "Good camera except that it shares the same fatal flaw as the D600", "Author": "Mkeverydaycnt \"MEDC\"", "ReviewID": "R3VQUL5B0F8SIP", "Overall": "2.0", "Content": "Lots of dirt and oil spots...AGAIN.  As the owner of a D200, D90 and D7000, I have had more than a little bit of experience with Nikon.  The D600/610 are simply engineering nightmares.  Nikon is aware of the issue and yet they continue to crank out the same bad product.  Now, the problem DOES resolve after about 5000 shots...but, why should anyone pay this kind of coin and have their first 5000 shots be ruined due to a manufacturing error?", "Date": "January 1, 2014"}, {"Title": "Color bands during 2+ minutes long exposure due to light leaking into eyepiece", "Author": "Avocet", "ReviewID": "RM12P65GTJQLO", "Overall": "3.0", "Content": "In my previous post, I wrote about the strange color band found in my long exposure shots with the d610, i.e. 2+ minutes. I posted a complaint about it on my instagram, and a friend gave me some insight about this issue. It turns out that the strange color band was the result of light leaking into the EYEPIECE. When you are doing a long exposure shot, make sure you use your eye piece cover or else light will leak into it and onto your sensor. In addition, I have read that this issue happens to other nikon's higher end cameras, like the d700. Still, I think this is really poor designing on nikon's part. Why does my entry level nikon d7000 have no issue with light leaking into the eyepiece yet a more expensive, semi pro d610 have this issue is beyond me. Maybe it was a marketing strategy. Maybe they want the inconvenience of placing on that eyepiece every time we shoot long expo so it will annoy us enough to buy more expensive nikon cameras like the D3x or something. But in terms of the camera's performance and image quality, I am pleased with the d610 results. I even like the image quality of this camera more than canon's 5d mark iii, a 3400$ camera compared to 2000$.Sample pics of color bands:[...][...][...]", "Date": "November 19, 2013"}, {"Title": "I have completely lost faith in Nikon with the D610", "Author": "jpogar", "ReviewID": "RM9YQAN9ZAO57", "Overall": "1.0", "Content": "After having some challenges with my last Nikon (D300), I thought it might have been an isolated issue.  I was very excited to order and receive my Nikon D610 thinking the issues with the D600 were resolved.  However, out of the box, the viewfinder was completely blurry.....couldn't see a thing. Tried adjusting with the diopter control, looked on Nikon support site, and nothing worked to correct it.  After doing some research online, it appears I'm not the only one to have this issue.  I was also unhappy with the lens hood included with the 24-85mm lens.  It was so loose, it kept rotating around and fell off a few times.  I REALLY wanted to like this camera and there are a lot things I like about Nikon, but feel their quality has really suffered in the last few years.  With the price of the Canon 6D dropping today, I'm sending this Nikon back and moving to Canon.  I have always felt the brands were close, but this has put me over the edge toward Canon.", "Date": "March 7, 2014"}, {"Title": "Wake up Nikon, it's 2014 already!!! Where is Wi-Fi and GPS???", "Author": "A-T", "ReviewID": "RL897RXZRB3KX", "Overall": "3.0", "Content": "It almost meets all my needs, has good reviews and I almost bought it!But I think I'll wait for a Wi-Fi + GPS model as we're living in XXI century not Stone Age.", "Date": "April 15, 2014"}, {"Title": "Still oil spot issues", "Author": "dadasha", "ReviewID": "R2KYGVVMHXBWJY", "Overall": "1.0", "Content": "Ｉbought this camera on Dec 12. 2013. After 800 shots. Same oil spot issue is on  left corner (three of them) after F13. I do suspect Nikon's technical talents. Really disappointed.", "Date": "January 12, 2014"}, {"Title": "my \"new\" camera have only 3 months and don't  work autofocus", "Author": "E. Escamilla \"E:E\"", "ReviewID": "R2H2EUYC63XCIB", "Overall": "1.0", "Content": "my ''new'' camera only have 3 months and don't work autofocus bottom i need a change my camera and the sensor about camera is very unclean.I buy New camera I never buy refurbished or used camera I'm very angry.", "Date": "March 21, 2014"}, {"Title": "Didn't see any benefit for my needs", "Author": "Brandon C. Diamond \"BDiamond\"", "ReviewID": "R163C4YD8CXD56", "Overall": "2.0", "Content": "Went to this from some crop sensor Canons. I use this for mostly video and didn't notice anything over the top that warranted the higher price tag. I said in the title for my needs only b/c I prefer the Canon menu system and set up.", "Date": "May 15, 2014"}, {"Title": "Ignore many of the poor reviews", "Author": "Copper", "ReviewID": "R1K5T5QQVBWDZD", "Overall": "5.0", "Content": "I do not own this product  - I haven't even handled one.  However as an interested Nikon user, I thought I would give it 5 stars to compensate for the bitter folk who likewise don't own one but are giving it 1 star to sabotage the rating.  They are dissatisfied with Nikon over the D600 oil issue - fair enough, but to hijack another product page is pretty juvenile and very misleading to potential buyers of the D610.", "Date": "November 3, 2013"}, {"Title": "Great camera, but Nikon needs to pull it's head out of its butt.", "Author": "Amazon Customer", "ReviewID": "R10ETZC5PX6F1B", "Overall": "3.0", "Content": "I have been a Nikon fan since I could afford to buy my first camera - a Nikon F3HP - an outstanding camera that was bullet-proof.  I became an early digital convert and have been waiting patiently for a full-frame digital camera that made sense for me to buy and leverage my base of full frame lenses.  i've never liked the DX format when it comes to wide angle shots.  The specs of the D600 and D800 are outstanding and both cameras feel great, but I watched in disbelief as Nikon let this D600 shutter issue play out on the Internet.  Now it appears to be addressed with the D610 and my experience with the camera has been excellent.  My concern now is that a company that manages product issues in such poor fashion with their loyal customer base is probably going to fail in long run.  The market is too competitive.  Canon and Sony and others have great products.  Nikon needs to treat its customers better if is going to survive as a company.  The D600 issue was such a basic product/PR issue and Nikon seemed clueless about doing the right thing.  I would have bought the 600 or 800 earlier if this issue hadn't played out over the past year, but I am hesitant to invest further in such a poorly managed company.  Nikon should be doing something for its d600 owners --- trade-in, credit, rebuild --- and should start by admitting and managing the issue straight up.  Product issues happen --- Nikon needs to show that it has the integrity to do the right thing to maintain its brand and customer base.  I can assume from Nikon's past history that if there's a problem with the D610, then they will burry their heads and focus on a D620.  So, the D610 gets 5 stars for now but the company behind it gets 1 star, averaging out to 3 stars.", "Date": "October 27, 2013"}, {"Title": "Two wrongs do sometimes make a right", "Author": "MancalaHal", "ReviewID": "R1INS2NGVKJSFZ", "Overall": "5.0", "Content": "First off, a full disclosure is in order:  I have not purchased the D610.  That fact puts me in the same category as the numbnuts who likewise have not bought the D610 but who nonetheless have given it one star solely on the basis of some quality issue that a previous Nikon model had (and who probably comprise most, if not all, the one-star reviews the D610 has received).If my phony five-star review can cancel out one of their phony one-star reviews and thereby edge the average review a little closer to what it should be in reality, well, then I've done my good deed for the day for all of those who use these ratings with the expectation that they are real reviews by people who have actually bought the product reviewed.", "Date": "December 2, 2013"}, {"Title": "Outdated Video Focus, and stunning quality problem with Nikon", "Author": "Goldberg", "ReviewID": "R3NQVVS99AIJK7", "Overall": "1.0", "Content": "If you are buying latest DSLR camera at this price point, you will shoot video and thus you want to have video autofocus that actually works.D610 uses contrast detection autofocus that is clueless. Whenever you zoom or change the subject during video recording, autofocus goes back and forth and frequently loses focus completely.Canon's 70D uses phase detection autofocus, and when I tested it, works very very well.And I thought as D610 is announced \"after\" 70D, it would incorporate the new phase detection autofocus, but it did not. Then I wondered \"why\" Nikon replaced D600 with D610 in such a hurry.... well, see the rest of the 1 star review.... I think I will dump Nikon  brand too, as who knows what kind of problem D610 will have in a few months?", "Date": "December 14, 2013"}, {"Title": "Dirty company behind dirty image sensor", "Author": "Orico", "ReviewID": "R1ZQEAVWQWN6LO", "Overall": "1.0", "Content": "I owned a D600 and \"enjoyed\" the same dust/oil spot issues as everyone else who are \"lucky\" enough to trust nikon's brand. It is a shame that nikon does't face the problem of their own creation and tries to avoid the by releasing D610 within less than one year after D600, treating  all nikon's customer like fools. I urge anyone considering Nikon products think twice , there are simply many other trustworthy vendors out in the market.", "Date": "December 31, 2013"}, {"Title": "A 'Fixed' D600 but a Failed Nikon Brand", "Author": "Dan", "ReviewID": "R2OYAMF6REOKZW", "Overall": "1.0", "Content": "I purchased the Nikon D600 when it first came out and THANKFULLY returned it when the dust/oil began to pop up on the sensor. I feel horrible for anyone that kept the D600 and now has a faulty camera out of warranty that has (essentially) been decommissioned from Nikon as a faulty product they don't want to fix. Thus the D610: a Nikon D600 with no dust and oil issues.For those who didn't get caught up in the D600 disaster, the D610 is a great camera in almost all aspects. For photographers, it offers great performance and features in a full frame camera. For videographers, you may want to skip the D610 as you can't change the aperture while recording or in live view making changing your exposure just about impossible. It's a bummer because the quality was very good but this made it unusable for me. Back to photographs, I'm in awe by the amount of dynamic range in the camera (shooting RAW) and love dual SD card slots and the heavy duty body (although it has a more plastic feel than the Canon 7D). It is a great all around camera and I love the photo quality I am able to achieve. It feels and operates more like a pro camera than the Canon 6D and has a good (but not unbelievable) AF system.However, a DSLR is more than just a camera because you are buying an ecosystem. You will be investing in a company with lenses, batteries, bodies, and will likely be sticking with that company for a long time for future cameras as you will be stuck with proprietary gear. As a result I have a difficult time recommending the D610 for those not already stuck in Nikon gear. The D610 is a great camera in many respects but Nikon has fumbled the ball big time and failed to stand up to a widespread product defect that I had. Nikon is a professional brand and a pro needs to be able to rely on their equipment and the brand behind it to fix/solve every issue. Thankfully my D800 has not had as many issues (though has had some that Nikon will not address) but I can no longer recommend the D610 for anyone not stuck with Nikon at this point. For those heavily invested in Nikon gear, The D610 is a great camera but I would not rely on it for a long term investment. I believe the price will drop heavily in the next 12 months and I don't think the issue is over yet.", "Date": "November 21, 2013"}, {"Title": "Trust the New Nikon and the Nikon Company Now?", "Author": "William Kazak", "ReviewID": "R37OQD6SV11LN9", "Overall": "2.0", "Content": "I have followed the reports of the D600 issues and I don't like Nikon anymore, in general terms. This \"new\" body, the D610, if purchased, implies your acceptance that the previous issues are now fixed and your trust of Nikon to do the right thing concerning warrenty work. Sorry, I cannot do that now. In addition to poor quality control at Nikon,there are a few features in the Nikon D610 that I would find hard to accept. As mentioned, the AF points are too close together and seem suited to a DX camera and not an FX camera as this is and FX camera. Also, there is no PC socket in the camera. A PC socket can be handy, especially in emergencies. It is so easy to carry an inexpensive PC cord as a spare to the very expensive TTL cords which can \"pull apart\" while in use. Do you trust the new camera? Not really because I don't trust Nikon.", "Date": "December 16, 2013"}, {"Title": "I would not recommend the D610 (if you're not already invested in Nikon lenses).", "Author": "tall2010", "ReviewID": "R3F4DRCH7VIO3D", "Overall": "2.0", "Content": "If you're not already heavily invested into the Nikon system do yourself a favor and check out the Canon 6D.I used to own a D600, D610 is the same camera.Canon 6D offers:++ Much better control layout.++ Excellent WIFi integration and App is actually working unlike that D600 WiFi dongle nightmare(you can switch from manual to Av, Tv on the camera without issues and also control aperture, ISO etc. from the App).+ Better grip for larger hands+ Better overall quality (Made in Japan). D600 Made in Thailand.+ Better button feel and operation+ Quieter shutter sound (difficult to explain, simply sounds more solid, not as \"clunky/loud\" as on D600)o Image quality is outstandingo AF is absolutely OKo frame rate/s is not an issue for meo max flash sync speed is fine for what I need it for (it's not as fast as on the D600)o Single SD card is fine (never used 2 cards before)- lower resolution (not an issue typically. 20Mp is OK)- No flash is a problem sometimes- No time-lapse function integrated in camera (I liked this feature on the D600, however, haven't used it much).In conclusion: I'd no recommend the D610 because you simply don't know how Nikon will handle any possibleissues in the future.I'd rather go with the much larger company and a better made camera. Canon 6D. I did.", "Date": "November 7, 2013"}, {"Title": "Same as D600", "Author": "NT", "ReviewID": "R1BH94XF0KY3X7", "Overall": "3.0", "Content": "Sold my D600 with dust issues and replaced with the D610. it is too early to judge the durability of D610. The Image quality is the same as D600. Took a loss in selling the D600, and so the effective price of this D610 is more than the listed price, in my case.Will be the same for the other D600 owners, who like the D600 for what it produces but have to replace with a D610 because of the shutter issue and thereby end up profiting Nikon in the short run", "Date": "October 27, 2013"}, {"Title": "Nikon Could Have Avoided All This", "Author": "M. T", "ReviewID": "R353UR1YNL4V1J", "Overall": "1.0", "Content": "Nikon to avoid all these negative comments, all you really needed to do was announce that if anyone who bought a d600 who is experiencing dust or oil issues, return it to the Nikon repair center and they will install the new updated shutter mechanism of the d610.  So the people who bought it won't feel like Nikon just dumped them for new customers willing to pay 2k for basically a camera that has be QC'd.  Treat your customer base right and they will be loyal to you. When you pull stuff like this, it makes people question what type of company you're turning into.", "Date": "November 3, 2013"}, {"Title": "Shame on you Nikon", "Author": "H. C. Balcioglu", "ReviewID": "R2IOEP39HI3NAL", "Overall": "1.0", "Content": "I am a loyal Nikon user and a semi professional photographer who spent around $15K on Nikon lenses and cameras in the last few years. Let`s start by stating the obvious - D610 is the D600 that actually works. As such, this review is for the product formerly called as D600, which was then \"updated\" to D610. My experience is that after purchasing this product for ~$2000, i found out that the camera I received was plagued by the well known sensor dust issue - so now I have to spend another $2000 for D610 to eventually get the product I was initially promised. For effectively more than $4000, as in my case, this product deserves a 1 star. If you are lucky enough to be making your purchase today, getting a D610 may be a 5 star purchase for you as the camera is actually pretty good.　The rating also reflects a warning for new purchasers - shame on you Nikon for the unfair treatment of your loyal customers.", "Date": "November 28, 2013"}, {"Title": "Nikon gives the middle finger to its D600 customers", "Author": "too_much_crap", "ReviewID": "RZMHE841KETKK", "Overall": "1.0", "Content": "The Nikon D610 is merely the Nikon D600 with an attempt to fix the dust/oil spots which have caused an outrage for the past year. By doing this, they are sticking the middle finger to all the D600 users and further alienating their loyal customer base.I sent my Nikon D600 to be warranty \"repaired\" in September 2013 and the invoice claims \"shutter replaced\" but THE DUST SPOTS CONTINUE TO EXIST. Nikon continues to show poor customer service and refuses to admit they released a faulty product.Why doesn't Nikon just recall all the D600s and send their customers a D610, if it is even any good?I encourage ALL D600 users to give the D610 a poor review until Nikon addresses the D600 problem by offering an exchange.", "Date": "October 26, 2013"}, {"Title": "I do not recommend buying the D610", "Author": "glenwells", "ReviewID": "R3JJD6J6T4CRHR", "Overall": "1.0", "Content": "Bought a D600 in October 2013 - My fifth DSLR and third full frame. It suffers from significant amounts of dust showing up in my landscape shots 10X more than any other DSLR I have owned. The shots are serioulsy affected and need a lot of un-necessary work for them to be useable.I would warn people off buying the D610 because if it has any sort of fault or issue in the future Nikon will first deny it or offer a lame failed fix.Like the others here I feel that Nikon warranty is worth a ballon on a stick.look at a different manufacturer do not take the £1500 risk.", "Date": "November 26, 2013"}, {"Title": "Correction for a problem that does not exist?", "Author": "REKN", "ReviewID": "RF1OXU1H8EMBM", "Overall": "1.0", "Content": "Soooo, nikon lied to its d600 customers about the dirty sensor problem. Then it developed a correction to the problem that did not exist. They put that correction in a new camera, but did not offer a fix/upgrade to the d600 customers they lied to. Now nikon has it's schills on this cite complaining about the negative comments from customers who were lied to. Keep it up nikon!!", "Date": "November 4, 2013"}, {"Title": "I do not recommend buying the D610", "Author": "glenwells", "ReviewID": "R3JJD6J6T4CRHR", "Overall": "1.0", "Content": "Bought a D600 in October 2013 - My fifth DSLR and third full frame. It suffers from significant amounts of dust showing up in my landscape shots 10X more than any other DSLR I have owned. The shots are serioulsy affected and need a lot of un-necessary work for them to be useable.I would warn people off buying the D610 because if it has any sort of fault or issue in the future Nikon will first deny it or offer a lame failed fix.Like the others here I feel that Nikon warranty is worth a ballon on a stick.look at a different manufacturer do not take the £1500 risk.", "Date": "November 26, 2013"}, {"Title": "Correction for a problem that does not exist?", "Author": "REKN", "ReviewID": "RF1OXU1H8EMBM", "Overall": "1.0", "Content": "Soooo, nikon lied to its d600 customers about the dirty sensor problem. Then it developed a correction to the problem that did not exist. They put that correction in a new camera, but did not offer a fix/upgrade to the d600 customers they lied to. Now nikon has it's schills on this cite complaining about the negative comments from customers who were lied to. Keep it up nikon!!", "Date": "November 4, 2013"}, {"Title": "Nikon D610 potential shadowed by the D600 oil issues", "Author": "H. Perez \"DentBook\"", "ReviewID": "R2NIBUPM6HCQUH", "Overall": "1.0", "Content": "I bought the D600 about a year ago and since then the camera presents the evil dust oil issues. The issue was not resolved after sensor cleaning, actually it got worst making the camera completely useless. The first few pictures I took with the camera (less than 1,800) were amazing but the oil issues ruined the others after. I'm pretty sure that the replacement (D610) have the potential to be a great camera as the D600 but just the fact that Nikon didn't want to acknowledge the issue and provide the right solution is unacceptable. They know that even cleaning the sensor is not the solution. Many D600 customer has been complaining that after multiple sensor cleaning and even \"change in sensor\" (done at a Nikon Center) the camera recur in the same dust-oil issues. Please my concern is for those that are about to buy the new D610 after my experience with the D600...what are the guarantee that you have as a customer that Nikon will take care of any problem that you can possibly face with a $2,000 camera? Right now many D600 owners (including me) have a camera that not only is useless but because of this issue it can be resell. The right solution will be to replace the D600 for the\"new\" D610 to those that like me have a $2,000 useless camera in a bag. Please Nikon be responsible and be more customer conscious, if you really know what business is and value your customers.", "Date": "October 27, 2013"}, {"Title": "Really Nikon, really?", "Author": "c-dub-ya", "ReviewID": "R3T107AVY5SBNQ", "Overall": "1.0", "Content": "The D610 might be a fine camera but, like the SB-910, is clearly just another insult to current Nikon customers. The well-documented and widespread oil/dust issues with the D600 prompted Nikon to fix the issue. Unfortunately, they didn't actually do anything to fix the D600 for anyone who owned it. They simply tell us to buy a new camera or else you are screwed.", "Date": "November 25, 2013"}, {"Title": "D600 will always overlap D610", "Author": "mohammed al-madani", "ReviewID": "R2R2U1BEJQKNSD", "Overall": "1.0", "Content": "As a Nikon D600 owner I should have just as much right as Nikon, by them completely scrapping the D600 and replacing it with the D610. Therefor, I should be given the option to either refund my whole purchase amount, or given credit towards trading in my malfunction Nikon D600 for any other Nikon camera of my choice. It?s absurd for a multi-national corporation like Nikon to completely ignore all the D600 owners complaints and not address them properly in the form of a recall or service advisory. Nikon neglect their clients who have put faith in them in the form of their hard earned money, and decided to re-release the D600 with a new shutter mechanism and name it the D610. All while still not addressing us the D600 owners and early adopters. DSLR purchases such as this are a once every 10 year purchase for many including me, I have dreamed and saved up in order to own a Full-Frame camera only to be let down and negligent by Nikon.", "Date": "November 8, 2013"}, {"Title": "Migrated user from Nikon to Canon.", "Author": "Vincent", "ReviewID": "R1UYMXEZG99PN", "Overall": "1.0", "Content": "I'm proud to become Nikonians, Because I bought the lay waste D600 and Nikon treated me as greatly as tomfool. This is the best place that I can raise my voice.  I'm a big fan of Nikon but not any more. I'm the Nikon user of D300, D700, D600. Nikon as brand you are losing your credibility and reputation, just because of stupid, nasty D600. You are making product for the customer, By loosing the existing loyal customer, how you going to survive.  Like me 1000's of customers already migrated to Canon. If this happen in near future the brand will vanish soon, Your attitude towards the customers will ruin your business.You needs to treat your customers better if you want to survive as a company.Nikon should do trade-in for the existing loyal customers else this forum will continue on D610.", "Date": "October 22, 2013"}, {"Title": "Lemon cameras! third class customer service! Avoid", "Author": "H. Rasheed", "ReviewID": "R1JWYJ7I3VS8DD", "Overall": "1.0", "Content": "Totally agree with others. Horrible customer service, virtually non existent. very unreliable products. unreliable engineering.  I would not recommend to buy a Nikon. Get Canon full frame. Nikon does not take responsibility of its faulty products. Nikon makes shutters that develops dust and oil spots issue that never goes away even after shutter replacement. Canon & Sony never had those problems. Unless you want to clean the sensor every week, Do yourself a favor, avoid this. Avoid being taken again & again & again by Nikon customer service rep. Avoid the pain of calling & emailing them for weeks. Get Canon Full frame ..... much better !", "Date": "November 18, 2013"}, {"Title": "D600 loser .....", "Author": "D600 Loser ....", "ReviewID": "R2R32I0MZPFK0V", "Overall": "1.0", "Content": "What a nightmare!  We have had our D600 for a year and it's been into the shop three times for the same issue. Oil drops on the sensor.  Nikon replaced the shutter but has taken a new response as of today.  They say some dust is normal and that there is software out there to remove spots if needed.  WOW!  I had a D200 and cleaned the sensor ONCE in five years, and this camera has needed cleaning 30-45 days after I receive it back from the factory three times in a row.  If this is normal dust, why is it accumulating all in the left, upper side of the picture?  Why are others having so many issues?  Why is there a new D610 replacement that has a new shutter mechanism, it was released in a year with little upgrade otherwise?  Mnnn, could it be Nikon is trying to get out of the D600 business because the camera is defective and they can't fix the problem?  They don't care, that is the worse part.  At this point, I would guide you to Canon.  Nikon doesn't stand behind their products.  This particular issue is ripe for a class action suit in my opinion.  If the bad reviews were mixed, I would say it's bad luck.  But just about every bad review has the same issue with oil on the sensor.", "Date": "November 22, 2013"}, {"Title": "DOn't BUY THIS!", "Author": "T. F", "ReviewID": "R29JEI2AIS3YKP", "Overall": "1.0", "Content": "Nikon spit in the face of its customers with this product - repair/replace all shutter mechanisms of D600 users or take it on the chin.", "Date": "November 26, 2013"}, {"Title": "Nikon should refund D600 owners", "Author": "Jayw", "ReviewID": "R2NLDU8V00BIQH", "Overall": "1.0", "Content": "As thousands of D600 owners show frustration with the oil issue, Nikon should simply refund us or offer a real solution to the problem.", "Date": "November 12, 2013"}, {"Title": "Product with a design flaw!", "Author": "Nav3000", "ReviewID": "RENJB1IF6POE6", "Overall": "1.0", "Content": "It's interesting to see Nikon releasing a faulty product into the marketplace...only to fix it one year later with a new product and not addressing the defect in the original product!!This may be a relatively small blip for Nikon, however, I wonder how much they care about people who invested $2K and have to live with a badly designed product.I own a D600 and have had to send it in for sensor muck issues for over 5 times in less than an year. The muck issue crops even after the sensor and shutter mechanism are replaced - Nikon claims to have replaced the my D600's sensor at least two times, however, the dust keeps cropping up.This speaks volumes about how Nikon chooses to run their product development and the sort of company they are turning into. As a consumer, I have no option but to either live with a product with a design flaw or spend another $2K on the improvement - or maybe dump the brand, go Canon....The clear message is that, with Nikon, \"Brand loyalty does not equate to Customer Service\"...", "Date": "November 13, 2013"}, {"Title": "D600 owners vs Nikon", "Author": "starsia", "ReviewID": "R3O2GNP8V9P24U", "Overall": "3.0", "Content": "I want this D610 so much but can't get myself to buy it because of how Nikon mistreats the D600 owners. I wonder why there isn't law suit in place. I understand that Electronic Lemon Law wasn't passed, but what about the Uniform Commercial Code or the Magnuson-Moss Warranty Act.", "Date": "November 7, 2013"}, {"Title": "Seen the D600 issue, We can also see this D610 circus.", "Author": "Sudi", "ReviewID": "R3LB9NAUBV2XIM", "Overall": "1.0", "Content": "Shame on Nikon for handling the D600 dust/oil issue. D610 is not the answer. They are not listening to their customers and we are loosing trust in Nikon. When Company's pride is more important than it's loyal customers, you know that Nikon has its priorities sadly misplaced.", "Date": "November 5, 2013"}, {"Title": "Trust other reviewers - DO NOT BYE THIS! I hope Nikon learns and respects its loyal customers. Go Canon.", "Author": "SAT", "ReviewID": "R3463KIW9PBHMK", "Overall": "1.0", "Content": "Trust the other reviewers - DO NOT buy it..go to Canon..especially because of the way Nikon has decided to treat its loyal customers.....!! I am regretting a D600 purchase!", "Date": "November 20, 2013"}, {"Title": "Hmm..", "Author": "awodb11", "ReviewID": "R3DDDQT8EBBZOZ", "Overall": "1.0", "Content": "I have owned the 200, 300, 600, 700. I have always been a Nikon user, but its time for a change. The Nikon dust issues actually were a shaving issue the shutter was causing. Nikon never admitted to this, just released another camera. The video is also not even close to other formats. I love Nikon, that said I am moving on with a heavy heart. Maybe this pixel war will someday be over, when everyone realizes that we don't need billboard images of dogs playing and birthday cakes.Adam", "Date": "October 31, 2013"}, {"Title": "Be wary of buying this camera - If it is flawed Nikon will only fix it in the D620", "Author": "Michael", "ReviewID": "R237D42U05VM75", "Overall": "1.0", "Content": "Horrible Customer service gives this camera the 1 star.  Just waiting for my $2000 investment to break so I can be told to buy the D620.  Time to make the switch to Cannon.Yes this camera appears to be better than the D600 but I'm so upset with Nikon right now.  They don't deserve good customers right now until they take care of the 600", "Date": "December 5, 2013"}, {"Title": "D610 reviews", "Author": "Mark A. Faccone", "ReviewID": "R1HZ682BM72C4X", "Overall": "2.0", "Content": "Before Nikon deserves a good review on this particular camera, they really need to step up to the proverbial customer service plate and satisfy the d600 owners, not throw them under the bus like they have done", "Date": "November 16, 2013"}, {"Title": "Bad Business Move by Nikon", "Author": "Brian K. Klein", "ReviewID": "R2WVIB652F8HRQ", "Overall": "1.0", "Content": "I have this camera, it's the D610-10. It's no wonder Nikon's profits were below expectations the past couple of years. They're saturating the market with tons of the same cameras, not offering support to retain their customers, and light years away from having as good video quality as Canon, Panasonic, or even Sony.There were so many complaints about the D600 having problems... why discontinue it and rebadge it as a 610? To \"solve\" the spots issue? This only proves further that Nikon is at fault with the engineering and manufacturing of this camera.Technically my score is 0/5 but Amazon only allows 1/5 at the lowest. Would not recommend to anyone. Please try Canon or Sony (since the Nikon sensors are designed by Sony anyways).", "Date": "October 31, 2013"}, {"Title": "Nikon has failed its faithful.", "Author": "Jeremiah Baer", "ReviewID": "R2LW4K20298IVW", "Overall": "1.0", "Content": "I've never seen a company treat its loyal users worst than Nikon, the D610 is a joke, switched to canon.", "Date": "November 30, 2013"}, {"Title": "Nikon D600 oil problem", "Author": "MHill", "ReviewID": "R31RUFQD2H9200", "Overall": "1.0", "Content": "Anyone know if there is a recall or replacement option available for D600?Despite of the fact that I love taking pictures with my Nikon D600, THE OIL/DUST issue is a major pain and Nikon is not willing to address it. I bought the camera last year and have had multiple conversations with customer service regarding the issue that they don't want to acknowledge. And Nikon just released the fix in the form of a new camera, with nothing for the D600 users - it's totally unprofessional and unacceptable. When people ask me about what camera to buy now, I just direct them to Canon...", "Date": "October 22, 2013"}, {"Title": "Angry D600 user coming to terms with the D610", "Author": "Doctor C", "ReviewID": "R1G85MLSXU865C", "Overall": "4.0", "Content": "I'm changing my former 1 star review.  Why did I give them a 1 star review?  Because I was very upset with Nikon's handling of the D600, the camera that's nearly identical to this one.  They never admitted a problem, gave simple \"have you tried not changing the lenses in a dust filled area?\" responses, and after attempting to fix my D600 a few times, I have simply given up on that and came to an understanding with Nikon.  That's all I will say about that.The D610 on its own merits is a solid 4.25 star full frame camera.  Why not 5 star?  because it's still using the same sensor as the D600 which came out last year.  It's a year old sensor being sold today for $100 cheaper than the D610 did initially.  The AF points are still somewhat centered in the middle but in the real world, very usable.  I should know, I've used the D600 for a year.  The sensor is still one of the best full frame ones out there so having used the D600 and spending some time with the D610, it will likely be my next camera.I wish it was't like this.  I wish I would have just bought the D600 and there were no issues and Nikon would have offered a recall but they didn't.  Still, I don't see myself ever going to Canon (that was a bluff) - Sony, maybe but not Canon.  No need to bash Nikon anymore.  They have learned their lesson hopefully.  They have brought dishonor to themselves with the D600 so maybe now they will follow the righteous path.Update *March 2014*I was looking for a camera to replace my D600 and decided to buy the D610 after the first price drop.  This really is what the D600 SHOULD have been.  No dust or oil.  Not thrilled that I'm using 2 year old technology, but that's all Nikon has now.", "Date": "October 28, 2013"}, {"Title": "Don't buy Nikon D6xx", "Author": "Andrew G Libertin", "ReviewID": "R33FBC9M153LX8", "Overall": "1.0", "Content": "Don't buy the Nikon D610. Nikon abandoned the D600 owners with a faulty camera design and after sending my $2000 body back twice, it still has debris deposition. I can't shoot thirty photos without spots in a blue sky!!Even if Nikon improved the D610, I wouldn't trust it or Nikon's service. They will let you hang and waste $2000!Buy a Canon full frame. It is solid, maybe better (definitely for video), and is proven reliable. Or buy my D600...cheap, LOL", "Date": "November 14, 2013"}, {"Title": "Not Happy", "Author": "hifirocka", "ReviewID": "R10P41C58OHA8I", "Overall": "1.0", "Content": "Quality of the pictures same as from Nikon D5100 :-(.This camera IS NOT AN UPGRADE!Besides that: Poor costumer service!In one year we will see the D620 with GPS and WLan...DO NOT BUY IT.", "Date": "October 31, 2013"}, {"Title": "Theiving Nikon", "Author": "S. Ortisi \"SuperSal\"", "ReviewID": "R2X5EOXMHQYA0N", "Overall": "1.0", "Content": "nikon gets one star because there's no way of giving it a zero.  a camera is only as good as the company that stands behind it.  i have had other nikons, and these bums really do not have any respect for their loyal consumers.i bought a couple of cameras that substituted inches for centimeters in the advertising, e.g., promising photo-quality exposures up to 16 x 20 inches when the fact was 16 x 20 centimeters.  these were small, compact cameras.my first nikon was the old analog F-5.  THAT was a camera, but those days are long gone now.  Today, upper management is more concerned with how much of a bonus they'll walk away with instead of returning customers.SHAME on you Nikon.  and SHAME on you AMAZON for not taking care of your customers by preventing thieving manufacturers like NIKON from selling their goods on your web site.Time to buy a CANON on another web site.", "Date": "December 3, 2013"}, {"Title": "From d600 user", "Author": "shoter77", "ReviewID": "RHA3XKY07VEGW", "Overall": "1.0", "Content": "Nikon just rolled over all the d600 users. Yes, this is not a d610 review! If Nikon has the audacity to give the middle finger to all d600 users by releasing a new product just to get pass a faulty release, we, the d600 users have the right to say our voice here!Yes, nikon this is the screaming voice of all your loyal d600 that you cashed on. We are still cleaning our sensor the every other week! How dare you nikon?", "Date": "October 21, 2013"}, {"Title": "Nikon answer to their failure", "Author": "Zorglub", "ReviewID": "R308A7WP2A5TL7", "Overall": "1.0", "Content": "the 610 should not be here,I ve been with Nikon since the non digital one and the d600 issues should have been traited another way,here another 'almost 2000 dollars' to fix and to spent,its easier for them and just show how they care about the people who spent lot of money on a camera with issues,Canon would have done differently i bet.Im sure this 610 is a great camera but its just the previous one,600, with no issues.", "Date": "November 10, 2013"}, {"Title": "Same as 600 but for now minus the oil spots.", "Author": "chrismike2009", "ReviewID": "R3I3I1F2OMXQW0", "Overall": "2.0", "Content": "Very sorry to steal the thunder from new 610 owners, but what Nikon has done to 600 owners and distributers is nothing less then thaft. I had 2 and bailed out just in time.  Both cameras are pretty much the same, minus the oil on 610 but then who knows.  Somehow Nikon needs to be schooled that this is wrong. No one should be allowed to do that to a consumer, no one.Cheers,", "Date": "November 7, 2013"}, {"Title": "Nikon needs to replace the oily d600", "Author": "cameraman", "ReviewID": "R3O5TZTDTC2PU4", "Overall": "1.0", "Content": "Not screw over its customers as they have here. Not a very good move Nikon. I'm not getting sucked in again. I'm off to Sony.", "Date": "October 20, 2013"}, {"Title": "Oil stains", "Author": "Mehdi M.", "ReviewID": "RRI3C6H3NNAG1", "Overall": "1.0", "Content": "I am reallly disgusted to have read about the oil stain on sensor problem for the D600, and whats bothering me even more is Nikon's non-acceptance of the issue!! Why would anyone want to spend $1996 on a camera body they are unsure about in terms of sensor integrity and in some cases AF issues. I am not at all confident about the D610 likewise the D600. I was always a Nikon fan but have now moved to Canon for good! Canon has undoubtedly the best customer service ever. Thumbs down for Nikon", "Date": "October 21, 2013"}, {"Title": "It takes a special kind of gift, in wrong direction, to buy this junk", "Author": "K. Yi", "ReviewID": "R1TDDY3O390GE3", "Overall": "1.0", "Content": "Ask millions of previous Nikon D600 owner, how they feel about being dumped by Nikon.  Those invested on the earlier version, they can't sell it; they are stuck with this super-expensive junk... Do yourselves a favor by dropping a oil on your car paint job, and observe how quickly oil can deteriorate paint job.  Whether oil spill detectable is irrelevant.  Protective coating used on electronics, such as ones used to protect the photo sensors, are not built to withstand same harsh environments as the automotive paintings.  Was it really the shutter mechanism that is spattering oil over the sensor, or is Nikon lying again?", "Date": "October 18, 2013"}], "ProductInfo": {"Price": "$2,599.95", "Features": "24.3 megapixel FX-format CMOS censor\nRemarkable AF performance with compatibility up to f/8\nIntelligent Scene Recognition System with 3D Color Matrix Metering II\nBroadcast-quality full 1080p HD video\nWi-Fi compatibility with optional WU-1b wireless mobile adapter", "Name": "Nikon D610 24.3 MP CMOS FX-Format Digital SLR Camera with 24-85mm f/3.5-4.5G ED VR AF-S Nikkor Lens", "ImgURL": "http://ecx.images-amazon.com/images/I/51VIvQJSAiL._SX300_.jpg", "ProductID": "B00FOTFA7U"}}