{"Reviews": [{"Title": "Great Camera!", "Author": "Design49er", "ReviewID": "R1EWUGPC0S8ZLG", "Overall": "5.0", "Content": "New to me, had for around a month so far, coming from couple of Panasonics the latest being an LX5 which I loved shooting with but wanted a slightly larger, more substantial and professional machine with built-in eyepiece viewfinder (I had the clip on EV for the LX5 but it was sort of a bother to use) and wider angle lens capabilities - the GX7 fits the bill.The Panasonic Lumix LX5 with Leica 24mm f/2.0 lens is probably the sharpest picture-taking camera and lens combo I've ever had, after many earlier years with Nikon film cameras with their 24mm f/2.8 and 105mm f/2.5 both of which I thought were sharp as tacks.  The Leica/Panasonic lens I think, is a sharper tack than those great lenses.  Like the wonderful Leica rangefinders, think that the LX5 could have a more ideal distance from the rear of the lens to the sensor, and that the old Nikon film lenses had to be designed to miss that big flapping mirror, which must complicate lens design that rangefinder systems avoid.  The LX5 Leica 24mm f/2.0 - I think, might also use this to its advantage of this factor as it is razor sharp.The GX7 of course you have to combine with a lens - one of the biggest reasons for getting it was so I could use it with the Panasonic 7-14mm f/4.0 super-wide zoom.  Have that lens now and the combo is fantastic for the way I see and shoot - it is so wide I have to adjust to it which I'm doing.  The 7-14mm is very sharp as well, though maybe a tick behind the Leica but hard to tell as the viewing angles are so different, details I was used to seeing with the Leica are \"stretched\" in the Panasonic and therefore may not be viewable in the results because the wider focal length puts objects in front of you further away, lessening specific details I could have seen in a shorter focal length lens - my idea anyway.The GX7 I'm liking a lot for the many controls that are easier to access quickly without thinking than in the LX5.  Buttons and levers abound in a larger body that make it easier to manipulate.  The touch screen is a huge plus, now able to make changes often and quickly without having to figure out which physical button on the body to use and press.  Zooming in and out of pictures I've taken using finger strokes like on an iPhone is great.  In pre-set scenes it has a good panorama shooting feature that stitches things together, again, like an iPhone.The eyepiece viewfinder I love, being old school and like to compose my pictures within a dark, focused visual environment as opposed to doing it on a large LCD screen.  With the super-wide lens, I have to check the edges of the frames of shots as you can get distortion and bowing if you're out of alignment.  The GX7 has cool vertical and horizontal alignment lines that move with you that help check this for me when composing.  A great feature is that the eyepiece viewfinder turns on when you put your eye to it, then switches to the LCD screen when you pull away.  Very smart.Got a really good Gariz half camera case, because I wanted a minimal case that allowed me to keep the big Panasonic zoom on all the time.  The Gariz case is beautifully designed and made and am waiting for a shotgun strap that will give me fast shooting response times even when around my neck.  The thin metal base plate is genius.Moreover, the GX7 looks good, looks like a professional machine in all black, has grown-up controls, knobs, levers, all black shutter button in a package that's easier for me to hold and use than the LX5 was.  All controls are marked with clear white painted text on the camera body, very pro-looking and easy to see for me, without glasses which is nice.  The LX5 was a fingertip camera for me, the GX5 I hold and cradle but it's not huge and heavy like a DSLR but has similar picture-taking qualities.I realize now, that though I take informal pictures with my iPhone when I have to, and when something is important I make sure I have the GX7.  There is a real difference in the end results.  The GX7 turns on immediately, zap, takes a picture immediately, pow.  My iPhone takes forever to focus and adjust exposure, plus whatever else it's thinking about in the eternity before the shutter goes off.With this camera, digital photography is finally getting close to fulfilling it's promise.  Can't wait for the future!", "Date": "February 21, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FL5DDCG"}}