{"Reviews": [{"Title": "You Get What You Pay For", "Author": "William Bash \"Someone Who Still Cares\"", "ReviewID": "R39S6UM1VCCOMO", "Overall": "5.0", "Content": "This review is from: Sony DSCRX10/B Cyber-shot 20.2 MP Digital Still Camera with 3-Inch LCD Screen (Electronics)The reader of this review can, or has already, looked into the Features, Specifications, typical Applications, and others reviews of this Sony product. So I will not go into this products detailed operational features and capabilities. This review is being written from a different perspective, reflecting only a few highlights herein. Simply saying that this newer particular Sony product is:A very powerful Advanced Point and Shoot camera. It utilizes many of the same features as found on Sony's Alpha DSLT type products, and Sony's (series) RX100 MKII Camera. This models ability to capture outstanding color rendering in low light is extremely impressive. It is also very \"fast\" in capturing an image under varying conditions (typically using a SDHC 45mb/sec Memory Card), and it is even slightly faster with a 60+mb/sec. Memory Card. Video (live action) is better than what I obtain with even more expensive DSLR/DSLT cameras I use. Action shots such as a Duck taking off, Geese flying overhead, or a Deer trotting by are captured nicely - even without having to take hi-speed shots, or numerous frames per second. Of course you have the P,S,A,M, and Auto Mode of operation typically found on all higher-end P&S; products. I utilize the \"P\" Programmable Auto, or \"M\" Full Manual Modes as my typical norm. You can get really close (Macro type) shooting for those detailed snap shots such as a Bee gather Pollen, or the Ice crystal formed on a Pine Tree Needle. The (8.3x) Lens Optical Zoom capability provides enough magnification for most all common usages - plus you can extend even further using the Cameras Internal Digital Zoom. Taking photos under \"fragmented shadows\" or \"backlit\" subjects are handled automatically (HDR), or you can adjust the Exposure and Depth of Field Manually to achieve a photograph image that looks professional. Fully charged Battery to number of shots capability is very high - approaching 400+ (of course there are variables) - but always carry a fully charged spare.Enough of the operational details here - you can gather more from various sources. So the real question becomes \"Is this new Sony Camera worth ALL the money retail sales are demanding at this time (around $1,300)? After all it \"is\" just a Point and Shoot Camera, not a DSLR/DSLT type product - Right? Only you can answer that yourself. However this Sony product out performs the competitions products in Light Gathering capabilities across the full Focusing Range. Some of the newer products by Panasonic and Olympus are somewhat similar, and Canon has just announced their new GX1 MKII product (but NO Viewfinder) but with a \"full frame\" Sensor. This Sony RX10 with its 1\" Sensor does a great job, and is nearly the size of a DSLR/DSLT's \"APS-C\" 1.5 Focusing Ratio Sensor - in simple terms that means Good!So yes, this is a great Camera product, and Sony continues to lead the industry in innovations for the consumers market. Now with all this positive \"stuff\" being said - there is one drawback with Sony (as a company) that drives many of us nuts. Their detailed \"User Help Guides\" (Sony's terminology) are typically some 250+/- Pages and must be downloaded via their Web Site which are free. In the past couple years Sony has finally provided their \"Detailed User Guides\" in a \"PDF\" (Programmable Data File) type Formatting. PDF's normally provide detail in a typical human way of accessing, much in the same manner a hardcopy book uses for referencing: Meaning having: A Table Of Contents, Chapters, Page Numbers, and Index at the end, etc. The \"User Help Guide\" for this product is (417 pages).However, Sony's method of accessing necessary operational and functional information for the user in this 417pg. \"Users Help Guide\" (and other Sony detailed Manuals) is in what is known as: \"Cascading Style Sheets design content\".There is NO traditional \"Table Of Contents\" with: a designated Subject/Topic and Page Number reference. There is NO Index at the end with a Page Number to refer to. The \"User Help Guide\" individual pages are numbered - but for no reason - nor accessibility to, or by page. This whole accessing concept utilizes \"Subject Headers\" that you electronically click on, which then takes you to a \"sub-header\", you click again, and you are taken to the specific subject you are trying to gain insight into the Operational Usage, Function, or Settings (in which there is minimal information provided).Now that you are finally at the specific \"Subject or Topic\" for operational information or instruction - unfortunately Sony is typically providing only a very short synopsis of information or instruction (as in a one sentence answer). You can locally Print any Page(s), but you will NOT have ANY form of indexing or paging reference to go to in hardcopy form. Many of us have advised Sony that this methodology is very cumbersome. Users need to have the option of printing a hard copy of this detailed Users Guide, with the contents displayed in a traditional book type format containing a \"Table of Contents\" referencing \"Page Numbering\" in a traditional manner, and be able to place this detailed Users Guide into a binder(s) enabling normal access to its contents without having to use a computer, go on line, or other electronic means. There is NO Disc provided with this camera package, and other manufacturers are doing the same thing to cut costs!This is another Sony Camera product that contains an \"Internal Help Guide\". Access it by: Going into Menu Mode - move the pointer to an \"Operation or Subject setting\" - Press the \"delete key\" (garbage can symbol), a definition will be displayed on the Rear LCD with a few words answer covering most subjects. Once again a great feature also found on several Sony and other brands of camera products, but the internal help guide as programmed into the RX10 is weaker, and contains far less information than on some of Sony's other Camera products (i.e.: their HX9, HX10, HX200, Alpha's, etc.).Simply stated - Sony products are great. This RX10 Camera has a very high build quality. I also own and use Canon and Nikon high end products, and I am very impressed with this new Sony RX10 product. There is very little information contained in Sony's 30pg. general Users Manual that comes with the camera, and most of those pages are dedicated to T&C;'s, Do's and Don'ts. In the electronic accessed 417pg. detailed \"Users Help Guide\" there are dozens of literally wasted pages, very few Pictures or Illustrations. Documentation is poorly done. Canon and Nikon's detailed User Manuals are downloadable, or contained on a CD that is packaged with some of their higher-end products, and contain very good Illustrations, Photos, and detailed Operational Instructions. Repeating - this new Sony DSC-RX10 Camera Product \"is\" an excellent camera, very advanced for a Point & Shoot, is well made, and captures images superbly, thus a 5-star rating. This unit is more like a smaller A77 Alpha Series DSLT product but with a fixed Lens, and 1\" Sensor vs. the A77's slightly larger APS-C Sensor. But Sony's detailed User Help Guide, and instructional methodologies need dramatically improved.", "Date": "March 13, 2014"}, {"Title": "At last I found my Ideal Camera.", "Author": "tonee_ann", "ReviewID": "RC660VTKB67SH", "Overall": "5.0", "Content": "This camera is very fast taking pictures. This is not a point & shoot camera as I used too. You have to learn about the different settings.I don't have to change lense which is very good. This camera is built solid. I took a lot of pictures over at Mount Rushmore SD, I am very pleased with the results. Pictures are very crisp, colorful & clear. I am glad I found this camera. The price I paid for is worth it. If you want to learn  how to use this camera, Just go to Utube, Plenty of tips over there how to use this camera. That's where I went for help.  This is a good bundle too. Thank you. I've owned 4 sony cameras 2 different brand, But I found this RX10 the best. Short & simple.. I am satisfied with my camera.", "Date": "March 9, 2014"}, {"Title": "Sony DSC-RX10  is and awesome camera", "Author": "Roger \"RogerATM\"", "ReviewID": "R2FW3VBV2NC6I8", "Overall": "5.0", "Content": "I received the Sony DSC-RX10 and am very impressed with this camera. It has a huge number of manual controls and can also be used with the automatic setting. Although this is not a DSLR, I found that it performs better than my old DSLR, so I gave that one to my grand daughter and will use this as my primary camera. This camera works very well in low light but also has a built0in flash. I also liked the articulated viewer.The kit had a number of poor items, including the tripod. However, at this price with items provided such as the external flash, extra battery with a charger, and the 64G SD card it is a great deal! I am very happy but sorry that this is the last one offered by this vendor.", "Date": "February 13, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00GCB5TRU"}}