{"Reviews": [{"Title": "Horrible picture quality!", "Author": "Reece Kirby", "ReviewID": "R1HCB8FOBVHP1R", "Overall": "2.0", "Content": "The way the photos turn out is awful. They tried to put too many megapixels into too small of a camera so the pictures come out grainy. I will be returning this product. When using the flash it isn't horrible but still not great. You'll have better quality with less megapixels.", "Date": "March 3, 2014"}, {"Title": "defective item", "Author": "Stephen Kelley", "ReviewID": "R27ON1TWTHHQQN", "Overall": "1.0", "Content": "I used this camera for MAYBE 10 pictures at most. The lens stopped working and wouldn't retract or take a pic. \"lens error\" displayed. I tried to contact the seller but got no response in 3-4 days. Returned to Amazon for a refund. bleah.", "Date": "April 22, 2014"}, {"Title": "great point and shot camera with superior lenses for this type of camera", "Author": "mark shoemaker", "ReviewID": "R2PK87T6SCGHGM", "Overall": "4.0", "Content": "800 pixs from trip to Europe all done with ease and satisfaction for the price a good choice for a back up camera or a causal carry along", "Date": "May 19, 2014"}, {"Title": "a lot to like", "Author": "HCI faculty", "ReviewID": "RTDEGE1WK28LQ", "Overall": "4.0", "Content": "bought this camera yesterday and took it on a walk with my dog.  I was delighted with the pictures!only shortcoming is it is a bit slow but recording 4MB images in such a small package should take time.", "Date": "May 4, 2014"}, {"Title": "Coolpix", "Author": "Nia H Imman", "ReviewID": "R2ZGCYYIQVFC9F", "Overall": "5.0", "Content": "Coolpix S3600 20.1 with 8x zoom is sized to fit in your hand a bright cools takesgreat pictures click and go good for an amiture", "Date": "May 1, 2014"}, {"Title": "it is simpler to operate and is a better fit into a shirt pocket", "Author": "R. Williams", "ReviewID": "RIGO8BOXSTF91", "Overall": "5.0", "Content": "My older Nikon simply stopped working.  I figured it would cost as much to repair it as to replace it.  The new one has more MP and, although it is less versatile, it is simpler to operate and is a better fit into a shirt pocket.  Given its size and cost, I don't think there is any reasonable way to improve it.", "Date": "May 5, 2014"}, {"Title": "Slow and bad quality pics.", "Author": "Daniel Drees", "ReviewID": "R26T3IR41T6YQH", "Overall": "1.0", "Content": "Camera was slow to take photos.  It was able to focus most times, but I did not get the shot I wanted since the \"moment\" was over before it focused..", "Date": "April 27, 2014"}, {"Title": "Too slow", "Author": "Amazon Customer", "ReviewID": "R2ZNYHRX6A6RZ", "Overall": "2.0", "Content": "I don't use this camera anymore and only used it for a few weeks.  As I have found with every digital camera I have ever owned, it takes too long to take the picture.  I am trying to take pictures of a toddler and I only have that split second to get a good picture.  This just doesn't cut it in that department.  I have tried several settings and can't get it to take fast enough pictures.", "Date": "March 30, 2014"}, {"Title": "Nice camera, new.", "Author": "Sassy Suzy", "ReviewID": "R5CK54RVTPIH", "Overall": "5.0", "Content": "beautiful versatile camera.  I had a red one just like it and it was stolen so this was a replacement.  Nice picture quality.Easy to use.", "Date": "June 8, 2014"}, {"Title": "Great buy.", "Author": "Celia de los Santos", "ReviewID": "R2EX1NH2N69V8I", "Overall": "4.0", "Content": "I like this camera because it's small and a great deal, but also because I can just buy batteries when the batteries die in it.Takes great pictures too. Super fast shipping and arrived when they said it would.", "Date": "June 4, 2014"}], "ProductInfo": {"Price": null, "Features": "8x optical zoom and 16x Dynamic Fine Zoom\n18 Scene Modes for effortless photos\nHD 720p videos with sound bring your memories to life\nTarget Finding AF for accurate, intelligent autofocus", "Name": "Nikon COOLPIX S3600 20.1 MP Digital Camera with 8x Zoom NIKKOR Lens and 720p HD Video (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41IlkoQWYJL._SX300_.jpg", "ProductID": "B00HQ4W5HO"}}