{"Reviews": [{"Title": "Just thrilled with this camera! I'm impressed!", "Author": "Carmylita", "ReviewID": "R15BWJIQT509LQ", "Overall": "5.0", "Content": "After trying and returning 7 cameras I settled on this one. All in the same price range. Panasonic, Sony, Canon, another Nikon, and finally this sweet machine.I haven't put it through it's paces yet, but I'm delighted with the zoom, the quality of the pictures. Ease of use, and so many options I have not begun to try then all.The screen is awesome and has an anti glare coating.The lens is perfect and of high quality.The size and feel is great. It feels solid and well built. With the white color it just looks elegant, as well as performing elegantly. Smooth zoom, great low light, and superb anti shake performance.I will not be using the Wi Fi feature, so I can't comment on that.It has a tripod mount. Many of today's point and shoot leave this feature out. It also has a macro setting (dedicated button, instead of the camera deciding for you automatically) which lacks in many point and shoot cameras these days, and was one of the deciding factors as to why I chose this camera.I have been a huge photography hobbyist, the better part of 50+ years, and I'm extremely choosy about the camera I buy. I research for months, and try a lot of cameras before making a decision. I'm very informed at the time of purchase. I was semi professional. I'm not just a casual user. Choosing this camera was a very informed decision.The detail in the photos I've taken so far is incredible.I will update this review as I learn more.", "Date": "April 8, 2014"}, {"Title": "Great little camera", "Author": "B. Bernard", "ReviewID": "R3EW4IMV7HMCI0", "Overall": "5.0", "Content": "I have had this camera for 3 weeks and haven't used all of it's features but am very impressed. I wanted a small camera that would fit in my purse and after looking at some mini ones I decided on this camera because it looked more substantial and I had a Nikon in the past that I was very happy with. The reviews were good so I purchased it. I had a little trouble setting up wifi, but it works fine now, however it should be noted that you can send photos to a smartphone for sharing but cannot directly send them from the camera. For me it will be easier to just download them to my computer and send from there.The camera takes terrific photos in daylight and in low light. They are very sharp. The 12x zoom is great. I am an amateur photographer so I can't begin to describe all the possibilities that the camera is capable of, but if you are looking for a good point and shoot camera that is very portable and easy to use, I highly recommend this one.", "Date": "May 7, 2014"}, {"Title": "Tons of cool options", "Author": "Joe Dancho", "ReviewID": "ROA02HAJXQXOB", "Overall": "5.0", "Content": "This camera was to replace my aging Canon point-and-shoot and was able to get it delivered in 2 days and was still $25 cheaper then the camera store down the road. Tons of cool options and effects on this camera, really fast and I would highly recommend getting a Class 10 SD card for this camera as this will assure that you are getting your true 1080 HD video and super fast clicking for action shots. Love it.", "Date": "May 16, 2014"}, {"Title": "Amazing Digital Pocket Camera", "Author": "pajorg", "ReviewID": "R1RAY6PPRLJGPV", "Overall": "5.0", "Content": "It has all the features that some $500+ cameras have, including 9 frames per sec. on continuous setting, a full length movie-video setting with microphone, a stabilization feature, 24x zoom, automatic focusing, and many lighting and tone features.  How about  a built in program to recognize cat's and dog's faces and go to continuous setting automatically at 3 frames per second if you hold the shutter down?  It also has a built in Wi-Fi for getting pictures to the internet for sharing.  It's so new, there were no testimonials when I bought it, came out Jan 7, 2014.", "Date": "March 23, 2014"}, {"Title": "great picture", "Author": "Anthony Kolberg", "ReviewID": "R38MS9USCIAI0V", "Overall": "5.0", "Content": "Small, nice pictures, blurry free. Even when the object your snapping is moving no blur. Glad I chose this camera", "Date": "May 24, 2014"}, {"Title": "Alot of functionality", "Author": "Andrew O'Neill", "ReviewID": "RNAHUYM0LB79T", "Overall": "4.0", "Content": "Great price, nice and compact. Great resolution. Prefect for travelers and sharper than a smart phone. It will not disappoint.", "Date": "June 7, 2014"}, {"Title": "Coolpix s6800", "Author": "Marlene Andre \"avid reader\"", "ReviewID": "R2UEEVYOQCT8X3", "Overall": "5.0", "Content": "I was given this camera on Mothr's Day. I've been taking pictures at different times of day, getting used to the camera. I have to say I'm very impress by the quality of the pictures. Even at the beach on a very sunny day, the camera adjusted the settings and the colors came out natural not wased out. So far I'm very pleased with it.  I would highly recommend. Small and light enough to carry in my purse; I have it with me all the time.", "Date": "June 2, 2014"}, {"Title": "A great camera and easy to use!", "Author": "GL", "ReviewID": "R2J7B3KG423PN2", "Overall": "5.0", "Content": "This camera takes great pictures!  It is easy to use but also has many unique additional features to use for effects.", "Date": "May 20, 2014"}, {"Title": "Disappointing", "Author": "Gregory N. Funk \"Pluribus\"", "ReviewID": "R2FX7EF5F3HRFH", "Overall": "3.0", "Content": "Bought the camera for my wife's upcoming trip. Camera takes gorgeous pictures but is very slow. the flash has auto and off modes only so it flashes when it wants to only. Over-all I am very disappointed with this camera.", "Date": "May 30, 2014"}, {"Title": "coolpix s6800", "Author": "James H.", "ReviewID": "R698NLF0UKTYU", "Overall": "3.0", "Content": "I just got my  nikon coolpix s6800 today. Everything works except the panoramic view setting. Out of the twenty plus times I used it only 3 worked. Most of the time it said it was unable to do it and the other times when it was halfway done it stopped. Not too happy. Other than that it's nothing to brag about. I'll keep you posted. My wife ordered one for herself before this one came today. I hope she has better luck with hers. Time will tell..............", "Date": "May 24, 2014"}, {"Title": "not for trips.", "Author": "areyn", "ReviewID": "RTICZA3B3WJ6Q", "Overall": "3.0", "Content": "Nice size and design, takes decent photos but battery doesnt last a whole 150 shots with no flash. between that and the price. bummer.", "Date": "February 18, 2014"}, {"Title": "Just Got It and Want to Give it A Chance", "Author": "A. Walker", "ReviewID": "R14T02H0OKDKJL", "Overall": "2.0", "Content": "Well since I was prompted to make a review, I will. At this time, I am not satisfied with this, but it is early. It appears that the shutter speed is slow. so my pictures are blurred. Now I do agree, I probably need more time to get familiar with it. I read the manual and if I am not mistaken, it was kind of encouraging the use of a tripod. This camera is equipped with a VR (vibration reduction) feature, but in my opinion, it is not very good. When I was shopping for a fairly simple point and shoot, I went this route. I actually got this camera because I have the more sophisticated Nikon 1 V1 and when I want to get in the picture, I can not get good pictures because not everybody can use it or is intimidated by it. I have contacted Nikon to see if I am missing something and awaiting a response from them. I am so close to returning it. I must give it to marketing. The write up and making the Wi-Fi feature sound like the best thing since sliced bread. really did their job. A model like this should not be so complicated, in my opinion. Afterall, it falls under the heading, \"Point and Shoot\".", "Date": "March 13, 2014"}, {"Title": "poor product information/poor customer relations", "Author": "Linda Sebastian", "ReviewID": "RI2KVPZ37OJZZ", "Overall": "2.0", "Content": "I just got this camera and I think I am going to like it a lot. However, I was not able to use the camera until I purchased a separate memory card.  The user manual that came with the camera said nothing about a memory card specification.  So I got a popular one on Amazon, and it turns out it is not the correct one.  I read the user manual I had to download, and could not find specs their either.  Customer support finally sent me a very nice email with all of the approved memory disks listed.  For such a nice camera at a pretty steep price, I think this is very poor customer relations.  I have had the camera now four days and still not able to use it because I am waiting for a memory card that should have come with the camera.", "Date": "April 26, 2014"}], "ProductInfo": {"Price": null, "Features": "Get even closer to what matters - 12x Optical Zoom and in even farther with 24x Dynamic Fine Zoom\nYour smartphone\"s new best friend - Built-in Wi-Fi for instant photo sharing and remote camera control with a compatible iOS or Android devices\nFocus where you want it - Target Finding AF for accurate, intelligent autofocus", "Name": "Nikon COOLPIX S6800 16 MP Wi-Fi CMOS Digital Camera with 12x Zoom NIKKOR Lens and 1080p HD Video (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41rTCcNEK0L._SX300_.jpg", "ProductID": "B00HQ4W6W8"}}