{"Reviews": [{"Title": "The HX400V is a Big Step Forward for Sony", "Author": "Capt. Aero", "ReviewID": "RQB989GLMM1HU", "Overall": "5.0", "Content": "I couldn't care less about a few silly post-capture, in-camera picture effects. The purpose of a good camera is to take pictures out in the field, not play around with them afterward. There's plenty of time for that, after you get home.The image quality and the quick, effective functions of this model, put it far ahead of the deficient HX300 of last year. I sent that one back after 5 days, but this one is a keeper. Even at full-size, most of its photos look presentable and at normal full-screen viewing sizes, they are sparkling good.  I didn't think anyone could put 21 Megapixels on a tiny sensor like this and get good results, but Sony has proved me wrong.The photo and video quality clear out to the end of the 1,200mm lens is sharp. The HX300 lost resolution at full zoom. With video, you can engage the Active Stabilization Mode and get 1.41X, or a 1,692mm equivalent in focal-length and there's no loss of quality. There are several other superzoom brands on sale now, that seem to match the HX400V in some specifications, but their overall performance for all purposes falls behind this one.I recommend getting the Sony ECM-XYST1M stereo hotshoe mike, to put on this camera. It picks up distant sounds well and mostly eliminates wind noise using a furnished furry wind sock. Breathing sounds from the operator are not recorded, which is a problem if the built-in mikes are used. The two elements can be swiveled out wide or pointed ahead for varied pickup patterns. I also bought two sets of Wasabi  NP-BX1 batteries and chargers here on Amazon. You don't get an external charger with the camera and having 5 batteries and two chargers gives me plenty of backup power and charging capability. This brand of battery seems to have the best reputation for an after-market source.The autofocus for both photos and video is quick and solid. There is no better camera for shooting flying birds or aircraft. The low-light abilities of it are amazing and the unique multiple-exposure modes make it possible to get good photos in very dim light.There's a KiwiFotos lens adaptor tube here on Amazon that is built to fit the HX300. Although it is claimed that the lens is the same size as that of the HX400V, it is not. The HX400V outer lens housing is 1mm larger in diameter and this adaptor will not fit. Perhaps KiwiFotos will build a new one later that matches the HX400V.Although this camera is listed here and at other dealers in the USA as the HX400 (B), it is in fact the HX400V (B) they are selling. This model has GPS and the HX400 that is sold in some other countries, does not have GPS.", "Date": "April 5, 2014"}, {"Title": "Amazing camera for the price", "Author": "dsct61", "ReviewID": "R3Q0FKP9NLG2Q4", "Overall": "5.0", "Content": "I caught this camera at a lower price when it was available for pre-order only and thought I'd give it a try.  My primary reason for wanting a mega-zoom camera is for birding, but I've also tried shots indoors and close up flower photography.I am not a serious photographer, so my review will not be technically rigorous.  I do enjoy my casual photography, especially when I come home with a few \"keeper\" shots like I've been lucky enough to do with this camera.I have been extremely pleased with this camera.  Even in auto mode the photos have exceeded my expectations, even at the highest range of zoom.  The details are staying crisp (water droplets on a loon's head, the iridescence of feathers) and the focus speed/shutter speed have allowed me to catch a couple photos I would not have thought possible with a camera of this type.I'm looking forward to learning more about this camera's capabilities and becoming more adept with the mega-zoom.", "Date": "April 16, 2014"}, {"Title": "Superb features, however can lack in photo quality", "Author": "MyKeyReviews", "ReviewID": "R27NSR9VQOC1CX", "Overall": "3.0", "Content": "♦ Brief ♦The HX400V is new to Sony's 2014 range of bridge cameras. For the size, it's extremely lightweight and very comfortable to hold. In addition, I personally found it fairly easy to navigate, both internally and externally.This camera boasts about quite a lot of things; large mega-pixel photos, new Bionz-X processor, \"premium\" 50x optical zoom, Wi-Fi/NFC, GPS, viewfinder, tilt-screen, hotshoe and a whole load of different settings to get the most out of your photos. Sounds mouth-watering, doesn't it? But is it really all what it perceives?♦ Box Contents & Recommended Extras ♦- Box Contents: HX400V Bridge Camera | Battery | USB Cable | AC Adaptor | Power Cable | Shoulder Strap | Instruction Manual.- Recommended Extras: SDHC Memory Card* | Spare Battery.* There's no flash memory(well, enough to take 4 photos), so getting one of these are a must! (You can go for any brand you want, however I would recommend a memory card with no less than 8GB memory capacity & of class 10).♦ Ease of Use & Navigation ♦I honestly really like the cameras layout, both software and external, I personally found the camera to be very easy to use.In the menu, you have everything set out in their appropriate tabs, so once you've had a good look around, it's pretty easy to remember where everything is located.One much liked aspect about this camera is its 'Fn' (Function) button; this gives you access to 12 settings (11 of which are customisable to your own liking), so changing settings have never been so quick.NFC has always been a feature I adore, this allows you to control the camera with your smartphone using the Playmemories mobile app (though does lack in setting adjustments), plus you can also use this to send over photos over to your phone with one tap (providing your phone supports NFC).There are also a ton of different modes to choose from such as auto, aperture, shutter, manual, scene, sweep panoramic and much more.And if you think that was enough, you can download certain apps from the playmemories camera apps store, some are free and others have a price to pay, normally between £4-£8 per app. These range from time lapse, motion shots, bracketing and more.The best way to get these apps onto the camera in my opinion is by connecting the camera directly to you computer via the included cable.That all said, there are a couple of things about the camera I didn't quite get on well with:1) Viewfinder: Not user friendly for people who wear glasses!2) Battery compartment: My tripod has a mid-sized camera plate, where the memory card is stored in the same compartment, I have to take the camera off if I want to gain access to it.So when it comes down to the cameras external and software features, this camera has a lot to be proud of.♦ Photo & Video Quality ♦If you're not the type of person who likes to dig deep into the photos quality when viewed at its actual size, then I don't think you'd be that disappointed. Most photos taken with this camera look good when viewed on a computer, HDTV, or when posted on social networking sites such as Facebook, but when you really get close to the photo by viewing it at its actual size, you start to see quite a few discrepancies in quality.I found that mainly when shooting in cloudy and lower lighting conditions, you start to lose quality in the photos. They start to lack in sharpness, edges can seem jagged and some posterization can be seen when viewing the photo in its actual size. These issues get increasingly noticeable when more zoom is used, and that's just with optical zoom, not digital.The problem by having advanced photo settings such as \"Aperture Priority\", \"Shutter Priority\" & \"Manual Exposure\" available, is that it will be more enticing for people who want to get the most out of their photos, but those who want to to do just that are more likely to be picky with quality.Video quality on the other hand I found to be rather good, but for goodness sake, if you're planning on using the 50x zoom, do so with a tripod. At the max focal length any slight movement in your positioning will be much noticed in the footage.♦ Final Opinion ♦✔ Pros:✓ 1080p video.✓ Comfortable to hold with great grip.✓ Decent tilt-screen.✓ Easy to use & navigate around.✓ NFC & Wi-Fi Capability.✓ Sweep panoramic mode makes panoramic photos easy to do.✓ Variety of modes to choose from.✖ Cons:✘ Increasing the zoom really degrades image quality.✘ Memory card slot could have been better placed.✘ Noticeable noise and posterization in photos taken within cloudy and darker scenes.✘ Photos not so good when viewed in actual size resolutions (100%).✘ Viewfinder isn't so good for people who wear glasses.The camera itself is really nice and I love all the features it has to offer, however I just get the feeling you're paying out more for all these extra features than the photo quality.If the camera ever drops below the $350 mark, then I'd say go for it providing you're not planning to produce large prints or viewing them at their actual size, but for $420... a bit too much for the quality produced.Out of 5, I personally would rate this camera with 3.5/5 stars.", "Date": "May 21, 2014"}, {"Title": "Quality Images and convenient operation alongside a serious limitation in wifi", "Author": "Gross Benjamin \"Benny G.\"", "ReviewID": "R2A6LT6DKGKMZA", "Overall": "5.0", "Content": "I got this camera a week ago.Photos are great for all the lens focal length.Surprising depth of field and beautiful BocaVery pleased with purchase.The camera replaces my  hx100 cameraRelative to the last camera ,lens cover less comfortable and is not released by itself when the camera openedSlightly larger cameraMy only disappointment -I did not know that WIFI use is limited to a number of countries because of a limittation in \"play memories\" application.  in the and if you are not there you can not transfer photos from your camera to a Smartphones or a pc  through wifi and mor then that- You can not control the camera using Smartphones.Hope that the issue will find a solution soon.", "Date": "April 6, 2014"}, {"Title": "It took lots of practice shots to get good photos", "Author": "Mike S.", "ReviewID": "R3L93K8NC2HBK6", "Overall": "4.0", "Content": "I'm finally close to nailing exposures. Detail is a lot better now that I pretty much have hdr and dr down. Expose for max brightness in manual at around 1.3 to 1.7. This thing was really pissing me off. There's a video on youtube with street traffic and bicyclists that sold me, but all I got was blurry garbage at full zoom. I'm hoping I cracked the secret code with the exposure setting. Macro shots are where this camera shines. It has a one centimeter focus distance.Low priced add-ons:Vivitar 3\" LCD Hood 2x Magnifier: http://www.amazon.com/gp/product/B005M23KKS/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1Wasabi Power Battery (2-Pack) and Charger: http://www.amazon.com/gp/product/B008SFPMRK/ref=oh_details_o02_s00_i01?ie=UTF8&psc;=1", "Date": "May 22, 2014"}, {"Title": "Fantastic Zoom", "Author": "Eric A.", "ReviewID": "R1TP2L9QZADKTJ", "Overall": "5.0", "Content": "This takes some of the most phenomenal pictures I've ever seen with the optical zoom at max.  I could not be more pleased.", "Date": "May 22, 2014"}, {"Title": "just a great camera!", "Author": "Michael J. Stuckert", "ReviewID": "R3UA2EEWZ25W21", "Overall": "5.0", "Content": "fantastic camera.  I took a foto of the moon from the Seattle space needle.  you can see all the craters.  almost impossible to take a bad foto.  50x zoom with image stabilization makes it a real tourist camera.", "Date": "June 7, 2014"}, {"Title": "Great!", "Author": "lynnie", "ReviewID": "R189PC2FAX848I", "Overall": "5.0", "Content": "Camera comes with basic manual (36+pages) to help familiarize owner with the equipment and then has a built in manual that can be accessed to further enhance understanding of the various features.  With a little work, set up can be accomplished quickly and then the function button on top of camera can be activated for quick access to white balance, ISO setting, Flash adjustment, and 9 other features for quick access during field use.Viewfinder is very good which makes composition a snap and images are crisp.  Great camera for \"field work\" as magnification allows one to get closer and capture crisp images.  Recommend for anyone doing wildlife/bird photography!", "Date": "May 31, 2014"}, {"Title": "Great camera for the ultra-zoom lover", "Author": "ssaroop", "ReviewID": "R2NIYJCUD3FMJF", "Overall": "5.0", "Content": "I bought this camera for my wife for her birthday and she completely loves it. The 50X zoom is really hard to beat especially with both the traditional zoom lever around the shutter release and the SLR-like zoom ring. The colors are beautiful as well making this the near perfect camera for her. The only down-side is the lack of RAW and the compression artifacts you can see in the full size image.", "Date": "May 26, 2014"}, {"Title": "Perfect simple family DSLR", "Author": "L. Chan", "ReviewID": "R2L16AGMEQ2UU9", "Overall": "4.0", "Content": "Its got everything needed for the starter. Big zoom = Big satisfaction.  Lots of modes--some a little tricky, but makes for it to be more than just an iPhone.  Great video.", "Date": "May 19, 2014"}, {"Title": "Wonderful camera", "Author": "trisha spettel", "ReviewID": "R1NU60TYYZOSF9", "Overall": "5.0", "Content": "Wonderful camera I just love it...I use it everywhere I go. Great for close up shots!! As a pro I use it as my back up camera sometimes too.", "Date": "May 13, 2014"}, {"Title": "Better than the HX300 I bought last year", "Author": "Charlottes Web", "ReviewID": "RALITGS2YNVVX", "Overall": "5.0", "Content": "I bought the HX300 last year and with the few changes they made on the HX400 it was well worth the money.  Small changes but huge when it comes to the pictures you get from them.", "Date": "April 26, 2014"}, {"Title": "no real issues yet", "Author": "Dan Cooch", "ReviewID": "R12OFHX5CW2J4G", "Overall": "4.0", "Content": "I've only used this a limited amount of time for the past month.  Everything seems to do fine.  The only issues I have are the instructions.  The user manual is not how to use, only what things are.  You must call Sony and they will tell you a web site, then you can download a PDF that is an actual user manual.  Incredibly poor planning on Sony's part.  They have NO ONE who is familiar with this camera so if you have a question, don't plan on getting any help.  Just learn to read the file they will direct you too.  Camera works well, takes good pictures but support is TERRIBLE.", "Date": "June 3, 2014"}, {"Title": "Sony Hx400/B", "Author": "Frank Romo Jr.", "ReviewID": "R1VI8TVB19GIRJ", "Overall": "3.0", "Content": "I purchased this camera and found it too complicated for my understanding; as a owner of several bridge-cameras, I didn't care for the menu set-up with it. I can usually work a camera by manipulating it and finding all the high-lights needed. But this one was beyond my scope of easy, it's well made and I'm sure for those who have the understanding of detail functions, I say have at it. For the first time buyer of a Sony bridge camera, I highly recommend the HX200, HX300 system, over this camera. I made a review on this camera, and received all kinds of criticism for not giving a high rating. I responded to those, that if if they purchased a system they couldn't understand, would they keep it regardless? I'm sorry, but if I'm to give a review, I back it up, I found a professional photographer on dpreview.com who had purchased this camera and found it equally detailed to operate.Mind you, I've been into photography since 1961, shooting all kinds of cameras; as a former combat photographer, I can say, you have to be able to work with a camera as it were your second appendage. I mean, live it and shoot it without having to read all kinds of menus for your next shot. So, sorry if I digress from the issue at hand but my buttons had been pushed by the esoteric, who feel, more is better, and show off their camera as a status symbol, rather than a working tool, to capture the moment at hand.", "Date": "May 10, 2014"}, {"Title": "Disappointing!  No In Camera Editing!", "Author": "Samuel", "ReviewID": "RWXPTSHLGNDAW", "Overall": "2.0", "Content": "When I ordered this camera, I was excited to see the next step in Sony's evolution of the HX series as I was very happy with the HX300.  However, I was very disappointed to see that Sony eliminated many of the in-camera editing features that made these cameras really fun to use.  With this model,  you need to select what you want the image to look like BEFORE you shoot!  This completely eliminates the fun of editing after you shoot either in illustration or watercolor mode.  Very limiting.  The added feature of downloading \"play memory\" apps is also aggravating because these features should be included in the price of the camera, and if you do, you still can't edit already existing shots to the degree you could on the HX300.  I gave it two stars only because it has a little longer zoom, but I would have gladly given that up for the after shot editing! Project leader on this model should be replaced!", "Date": "April 4, 2014"}], "ProductInfo": {"Price": null, "Features": "Clear Image Zoom ZEISS Lens\n20.4MP Exmor R CMOS Sensor for superb low  light images\nKeep your subject in focus with Lock-On AF\nSimple connectivity to smartphones via Wi-Fi w/NFC3\nMap your images with GPS tagged photos\nEnhance features w/ downloadable camera apps\n4K quality still image output via HDMI2\nMotion Shot Video traces subject movement", "Name": "Sony HX400V/B 20.4 MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41Js6Xigx9L._SX300_.jpg", "ProductID": "B00I8BIB18"}}