{"Reviews": [{"Title": "Excellent camera, but loses a star for proprietary connector/cable and lack of separate charger", "Author": "Albert \"DrAlAlDr\"", "ReviewID": "R2LZ1R7RIZQ2Y3", "Overall": "4.0", "Content": "So I read all the reviews here as well as all the professional reviews I could find and purchased this camera from a third party to get it sooner.  I've had it now a couple days and am impressed with the camera itself - I would give it 5 stars if I were just rating the camera.The build quality is excellent and it feels solid.  The image quality is excellent given the small sensor and 18 megapixels (though I agree with many that it might have been even better if there were only 16 or fewer megapixels).  Yes there is noise at higher ISOs (above 400), but I expected that and it seems very good to excellent for this class of camera.  FYI, [...] has sample shots and nice review of the Canon sx700 with a comparison to Panasonic zs40.  His verdict is that the image quality and noise reduction are similar overall - one edges the other in some situations, the other edges ahead in other situations (it will be interesting to see the [...] review of the Panasonic when it comes out in the near future).The 30x lens is lovely!  Nice and wide to great distance.  The image stabilizing works well.  Focusing is fast, except at long zoom and very low light (which is typical of this class of cameras).  I've seen some reviews complain about the low resolution of the electronic viewfinder (EVF), so I was surprised to find it is much better than I expected - once I used the diopter control to adjust it for my glasses.  Best, at least it has an EVF for those bright, sunny days when that pretty much wipe out your ability to see the LCD!!  Nothing else in this class has that.  As for the LCD, it is large and sharp.  The various display options show a lot of information, and there is an optional histogram (though small).  There is a dedicated function button that you can program as you choose, and a programable wheel around the lens that I am impressed with, though I am just learning how useful it is.  Again, I'm not aware of other travel zooms with these features.  I saw one review that complained about the shadows from the lens barrel when it is at full zoom, so I tested this and I have not seen a shadow with the flash.  I also saw someone complain that the flash was too bright for portraits and needed to be adjustable.  Again, I haven't seen any travel zooms with adjustable flashes, but the other option is to decrease the exposure so the sensor captures less light - which this camera allows.  In fact, the camera has exposure bracketing so that you can automatically capture 3 photos at different exposures then pick the best one (though I don't think this will work with the flash engaged).  Again, something I can't recall seeing on most travel zooms.  Finally, when you do take a picture, you have the option of saving it in raw format (capturing all information), or one of two jpeg formats, or both.  Again, I can't recall a travel zoom that has allowed this in the past, though many people have asked for it.A few advanced features that I've only just begun to try out.  It has WiFi and I tried this out with my iPad using the free Panasonic Imaging App.  It works ok, but the app really needs some documentation/help screens, because these are not provided in the little WiFi guide that comes with the camera.  There is an airplane mode for when you fly, and I can see maybe setting the function button to that if you fly a lot.  The GPS function seems easy to use and I like the landmarks feature that is included, but be aware the GPS stays on even when you turn off the camera, unless you put the camera in airplane mode.  This means the GPS will be a constant drain on the batteries.  So I've turned it off when I am at home - just hope I remember to turn it on when I travel.  It is worth noting that other travel zooms may have WiFi and others have GPS, but only a few have both.  Another feature I like is that you can turn on a display that shows both the horizontal and vertical axes of the camera vs. the earth in order to level the camera - very nice feature that I've never seen on a travel zoom before.So overall, I really like this camera.  It is well designed and lets you do so many things and produces great pictures.  It is a great travel zoom.So why don't I give this camera 5 stars?  Because I'm rating what's in the box, as well as what isn't.  What's in the box is a USB charger and cable, but the connection on the camera is to an unusual micro USB connection that is essentially proprietary to Panasonic.  So if you lose that cable, you can't use just any old cable to charge the camera, you have to get a new one from Panasonic.  Worse, digital cameras eat batteries, so you should always carry a spare and a charger so you can charge the spare while you are using the camera.  The problem here is that Panasonic doesn't include a separate charger in the box - you only have the option of charging batteries in the camera.  So what if you want to use the camera and have a spare battery that needs charging?  TOUGH LUCK, SUCKER!!  True, you can buy a third party charger (and get a good deal on a pair of extra batteries at the same time), but for a $450 camera, that is outrageous.  So  I knocked a star off of what's in the box due to the proprietary connector/cable and the lack of a separate charger.  Neither of these are deal breakers since you can buy a third party charger, but they sure piss me (and others) off.", "Date": "April 10, 2014"}, {"Title": "Pocket Rocket UPDATED MAY 2, 2014", "Author": "Wat", "ReviewID": "R1AQCHBQBQL5BB", "Overall": "5.0", "Content": "I never thought I would go back to a small sensor compact, especially with quality options like the Sony RX series or any of the Olympus/Panasonic micro four thirds cameras.Why the ZS40 then?The main selling points to me on paper and now in actual use are:1) 24-720mm lensThis is an amazing range for such a small body. The lens is sharpest from 24mm to around 300mm. Anything above that I will bump the aperture up a stop or two. This usually means I have to set the ISO around 400 to still get decent shutter speed. ISO 400 is quite good.2) Built-in EVFWhen I first looked through the EVF, I thought it was way too small. I took it to an Okaland A's baseball game in brutal sun and the EVF worked fantastic. The rear LCD was beyond useless in the overpowering sun and the EVF really saved the day. I was able to get nice wide shots of the crowd and zoom in super close to the players. Using the EVF also let me steady the camera better. The best part was that the camera was so small I had it in a belt case and barely knew it was there until the times I needed it.3) RAW supportUsually RAW is just a waste on such a small sensor, but you can squeeze a decent amount of extra detail depending on how well you nailed the exposure. The latest LR and Adobe updates now support the RAW files so that's a big plus for me now.4) 1080p 60p video and stabilizationReally great video quality. Already took some great family videos, footage at the ballgame, and some indoor action. The lowlight video is still not as good as some Sony cameras, but it's much better than previous Panasonic cameras.5) StylishThis is a personal thing, but I really like the two tones gun metal grey and black body of the ZS40.What about the negatives?Lack of a separate battery charger is definitely a downer, especially for a compact camera that costs this much.Image quality is still no match for larger sensor cameras.Limited customization, no way to adjust flash strength or assign any function to custom buttons.So why 5 stars?Like most cameras, the ZS40 is a matter of trade offs. For me, there is nothing in this size class that has this much range, a built-in EVF, great video quality, and very good (or good enough) image quality.My main camera is the Sony A7R with either the 35mm or 55mm prime attached to it. Superb image quality and great video, but larger, no stabilization, a slower shutter (which means not as great for capturing fast kids), and limited range.But added in a camera bag with the ZS40, I have every situation covered, but with very little space taken up in the carry bag.I wasn't sure paying close to five hundred dollars would make sense, but the real world usage situations the ZS40 excels at have me sold. I know this camera will come down in price in time, but this is a case where paying the premium of full price has so far paid off in shots and video I would have been hard pressed to get without it.I purchased a set of two third party spare batteries that came with an external charger on Amazon to complete the ZS40 travel kit. It costs less than one official battery.Wishlist for ZS50I really would love a tilt LCD, even if it adds a bit of bulk to the body.I would also love a hotshoe since adding better light is much needed for such a small sensor.Bigger grip. The nub is not bad, but with such a big zoom range, a more substantial grip would go a long way.Hope this helps.UPDATE MAY 2nd 2014I've officially owned the ZS40 for close to six weeks now and have been using it regularly since my initial review. I continue to be impressed by the camera.Some tips I can share from my usage:- You can playback images you've taken without fully turning on the camera (which extends the lens) by pressing and holding the Play arrow. The rear LCD will light up and you can look through your images, but the lens will not extend. Turn the camera back off by hitting the power button or you can fully wake the camera by tapping the shutter button- The C1 and C2 dial save customs settings and are handy when you have things you shoot often, but require lots of menu diving. On mine, C1 shoots in manual mode with smallest quality JPEGS and locked at ISO 100. I use this setting to trigger off camera flashes to take product photos for the web. For C2, I've set it to the Sports mode setting which is perfect for capturing my fast moving kids. I could use the SCN function to activate Sports mode, but I like to use different SCN types so it's not always left on Sports. Assigning it to C2 allows me to change the dial once and go straight to shooting in Sports mode.- The iAuto setting works extremely well. I've come to use it often for times I'm not going for a specific look. I also enable the flash as the fill flash function seems to work fairly well. In dark situations the light is still too bright though.", "Date": "April 14, 2014"}, {"Title": "ZS40 - A Computer that takes Photos", "Author": "21st Century Hermit", "ReviewID": "RG62T03N4MOID", "Overall": "5.0", "Content": "Pros:- Pocketable- 30X Zoom Lens (24-720mm equivalent)- EVF- Adjustment ring around lens- Adjustment wheel around 4-way controller- GPS with logging and geotagging- Amazing menusCons:- Internal battery charge via non-standard cable- 18 MP sensor- No MapsBODY:The body is completely covered in an elastomer (all the black areas on the silver version), while great in hand, this rubber coating impedes the insertion into small pockets. No professional or user review has ever mentioned the rubber coating, it was a complete surprise to me. The front raised grip and rear thumb rest are well placed and are all you need for a secure grip of such a light camera.LENS & SENSORThe lens and sensor have to be discussed together. The 30X zoom would not be possible without the tiny sensor, even then the maximum aperture f/3.5-f/6.3 is dim. The lens has 5 aspherical elements with 10 aspherical surfaces, only possible at this price by molding, not grinding, the elements. A decade ago a single aspherical element was a big deal, how far we've come. The tiny CMOS sensor has the light gathering pixels on one side and control transistors on the other, unlike a CCD sensor. Why 18MP, only because the stupid MP race has yet to end, more tiny pixels is not better, just adds digital noise. Don't expect miracles, this camera is more about world class memories than world class images.ADJUSTMENT RINGS:The two adjustment rings, one around the lens and another around the 4-way controller are amazingly handy and user configurable. Their function changes depending on the mode you set unless you \"lock\" them via the menu. I locked the lens ring to zoom only. When you zoom, it provides more steps and 35mm equivalent focal lengths on either display. The wheel around the 4-way falls easy to your thumb, I mainly use it to cruise the menus.5-AXIS OISOptical image stabilization is the way to go and the ZS40 incorporates Panasonic's latest and greatest evolution of OIS. Yes you really can take steady photos at 720mm focal length.EVFThe electronic view finder is a key element of the ZS40. In bright light conditions it is viewable when the LCD might not. It has a adjustment to compensate for your individual vision. Another benefit is placing the camera to your head affords an addition steadying point for long zoom photos and video. To those of us with bifocals, one's arms may not be long enough to focus on the LCD, the EVF solves this.GPSThe GPS has both geotagging and logging. Add to this a POI database of 5-million points. I tested the geotagging, logging and POI database on a recent trip to the Grand Canyon and was impressed with all three. I was able to import the photos into BaseCamp and see them in map context, no more \"where did I take that photo?\". The logger will record a point every 15-sec and I can easily convert the NEMA or KML file to GPX to view the track distance or see it on a topo map. The GPS uses external data (Assist Data) to speed GPS acquisition. The ZS40 instantly found my router and downloaded the data, very impressed. The data is updated weekly and you'll need to update at least monthly for fastest acquisition. The battery life was as good or better than any Garmin I've used (I own five), still you'll want to carry spare batteries. The batteries are tiny, light and inexpensive, get an external charger while you're at it.POCKETABLE:My test for pocketability is the chest pocket of my polo shirts, the ZS40 passes. I added a neck lanyard for the occasional out-of-pocket escape. This feature goes to the best camera is the one you have with you. For most that is the near ubiquitous smartphone.MENUS:The menus are very easy to read on the LCD and each has a text scroll to explain its function. There are so many menu options that Panasonic did an excellent job of attempting to simplify the complexity.VIDEOYou can take AVCHD Lite (1280 x 720, 60p) video until the battery is dead. All the high end AVCHD formats are capped at 30-minutes. Most would find 30 min ample, but in case you want to set and forget, you can. I took a short video of a mountain stream with a series of falls and played it back on my HDMI monitor, just like being there, the sound and video were amazing.CONCLUSION:For me a near perfect combination of a pocketable high zoom camera with a very functional GPS. The EVF solves many viewing problems of modern digital cameras while adding an insignificant amount to weight or size. For many hikes this will be all I'll need, for longer hikes I'll add one of the Garmin's for the Topo Maps. This a complicated computer that takes photos, don't expect to learn it in a day. It'll grow on you as you learn its many features. I'm still learning.", "Date": "April 17, 2014"}, {"Title": "A dream too far.", "Author": "D. L. Howe \"dave\"", "ReviewID": "R2U2XMAYMPOZBW", "Overall": "3.0", "Content": "4/18/2014 - see comments after 6 weeks with the camera at the end of this review.The ZS40 marks the beginning of a new breed of pocket cameras with advanced features. Last year, when I was planning on replacing my aged Panasonic ZS15 I considered the ZS30 but eventually settled on the excellent Lumix LF1 - which had many of the advanced features of today's ZS40. In my dreams I envisioned a camera that combined the advanced features of the LF1 with the long and wide lens of the ZS30. The ZS40 is that camera, my dream come true.Today's digital cameras differ from the film cameras of yesteryear in that they contain a very powerful computer.  The computer in the ZS40 is able to analyze the picture you are about to take select the best settings.  If it is too dark the computer will turn on the flash. To take maximum benefit of the computer use the control dial on the top of the camera (I will call it the PASM dial) and select iA (for intelligent Automatic).  Some things to be careful about:  Set your camera to take the best quality JPG.  When saving the picture on your computer (any time, not just after editing) be sure to adjust the quality of the JPG compression to less compression - better quality.  In Paintshop Pro the setting is under options in the \"Save as\" dialog.  The program you use may be different.Beyond iAuto the ZS40 has a multitude of advanced features that will allow you to take your photography to the next level.  To begin using the advanced features switch to the \"P\" Programmed mode (on the top dial).  In the \"P\" mode the camera uses (mostly) the same automatic settings but it allows the photographer to override certain settings.  For instance, if your subject is backlit you might want to set the exposure compensation to over expose a little.  That will lighten the entire picture making the shadow part properly exposed even though the rest of the picture will be too light.  The thing to do is to just play with the camera and experiment with what settings can be changed - before you go out for that special picture.  If in doubt take the picture two (or three or four...) ways, with different settings.The A setting is APERTURE priority - which means you \"insist\" that the camera use the aperture you specify - but the camera's computer can choose the shutter speed (and the ISO).  I recommend you go into the menu and set the ISO limit to 800 - before letting the computer manipulate it, higher settings may cause photos taken in low light to show noise (freckles of dark spots).  The S setting means you to \"insist\" that the camera use a specific shutter speed but you will allow the computer to choose the aperture (to get the correct exposure) and of course the ISO.  The M setting is for manual and it means you will specify shutter and aperture - but let the computer select the ISO (within the range you have previously set in the menu).  You can also use the menu dial on the back to set a specific ISO.A significant advanced feature of the ZS40 is the manual focus.  Say, for example, you want to take a picture of a bird in a tree - but there are some twigs and leaves in the way so the camera mistakenly focuses on them instead of the bird.  Switch to manual focus (on the menu dial on the back) and then focus using the large ring that surrounds the lens in the front of the camera.  As you begin to turn the knob the LCD (and viewfinder) shows an enlarged picture of the subject to assist in the focus.For years Panasonic cameras have led the way with their image stabilization.  The top of the line was called Power OIS (Optical Image Stabilization - done within the lens).  Now, with the ZS40 Panasonic is providing Power OIS plus Hybrid stabilization.  What that means for us is that when use the camera it will try to compensate for any camera movement.  Look carefully at your photos taken using the zoom lens at its fully zoomed setting.  If the pictures look fuzzy or out of focus the cause may be camera movement.  As you zoom to the maximum setting the image stabilization has to work harder to steady the image until at some point (depending on how steady you hold the camera) it can't keep up with the lens and the picture is \"fuzzy\".  I find I can only hold steady up to about 20x (400-500mm equivalent).  You may be able to hold steady longer, but it is a good idea to experiment so you know your limits.If you find you can't hold the camera steady set the camera down onto something.  A tripod would be nice if you have one with you.  If you set the camera on a table, or fence post (or rock or anything) you can use the 2 second (or 10 second) timer to take the picture without holding or moving the camera.  The ZS40 gives the option of controlling the camera with a phone or tablet.  Once your phone or tablet has the Panasonic application you can change zoom, focus point and aperture or shutter settings on the touch screen of your phone before activating the shutter.  That amounts to wireless remote from hundreds of feet away - great for wildlife.The viewfinder is great for aiming the camera, especially for things like birds in flight.  Because the viewfinder allows for optical correction it should be a favorite for folks who wear glasses.  Shooting through the viewfinder makes for a steady camera (rather than holding the camera out front to look at the LCD) - a real boon for the long telephoto lens of the ZS40.  For shooting birds in flight set the camera to use multiple focus points, rather than a single point.  That way it will be easier for the camera to detect and focus on the bird.All digital cameras process electrical signals from the sensor into RAW data (ones and zero's for the computer).  Then the computer can use the RAW data to create a JPG image.  The ZS40 allows the user to download the RAW data into their home computer and manipulate it themselves to create a JPG image that is different than the one the camera computer might create.  Panasonic makes RAW manipulation software available to owners of the ZS40 - details come with the camera.Depth of field refers to the area of the picture that is in focus.  Various camera adjustments make the depth of field greater and some make it less.  If you wanted, for example, to take a picture of a flower and have the flower sharply in focus while the background is blurry back up and use the telephoto to zoom.  The greater the zoom (greater focal length) the shallower the depth of field.  Take the first shot using iA, then switch to aperture priority.  Adjust the aperture to the smallest number (larger aperture) and take the picture again.  The larger the aperture the smaller the depth of field.Now say you wanted to take a picture of a baseball bat, at just the moment the bat hits the baseball.  The ZS40 has the ability to take many shots in rapid sequence.  Use the menu dial on the back of the camera to set the camera to take 40 shots per second (reduced to 5MP images).  The speed adjustment is activated by pressing the display button after choosing burst mode from the menu control.  Pre-focus the camera at the spot where the impact will take place (by half pressing the shutter or switching to manual focus) then JUST before impact hold the shutter button down.Enjoy the camera and HAVE FUN.ADDED:  If you would like to discuss the camera and/or have specific questions I suggest you go to Amazon's dpreview web site (google it) - then click on FORUMS and Panasonic Compact Camera Talk.  There you will see examples and comments from other users of the ZS40 and other Panasonic Compact Cameras.  Regards, DaveADDED April 18, 2014:  After six weeks with the camera I stopped using it and have sent it on down the road (eBay).  Looking at the pictures I took during my time with the camera - they were mixed; good snapshots but nothing that could hold up to any post processing in the computer - just not sharp enough.  It is a real shame because the camera has all the good stuff and it is very well made - but in the end it comes down to getting good pictures.  I blame Panasonic for putting too many pixels into too small a sensor (though it seems like all brands are doing it).  I have gone back to using my trusty Lumix LS1 as a backup to my high end cameras - The LF1 is a truly amazing camera and I highly recommend it rather than the ZS40.", "Date": "March 31, 2014"}, {"Title": "Great camera for travel.", "Author": "SL", "ReviewID": "RO6MGGQ84C1SH", "Overall": "4.0", "Content": "Very long zoom on a small sensor camera normally means not so good picture quality. The ZS40 is not perfect: Pictures taken with ISO above 400 will show a lot of artifacts and the lens is not fast at all. The IOS, however, is top notch and will allow pictures taken at very low speed without problem. What I really like on this camera, however, is how reach in features it is. WIFI and GPS are very helpful when you travel. The EVF is something you normally don't find on cameras like this. Try to use the screen when shooting on a beach and you will know the importance of it. Overall, Panasonic did a pretty good job with this solid, well built, compact camera.", "Date": "May 1, 2014"}, {"Title": "Amazing Camera!", "Author": "autarkis", "ReviewID": "R4AZDZJE0PDPF", "Overall": "5.0", "Content": "I have been a fan of the Panasonic travel zooms for a long time, but this time the purchase was for my wife.  She loves it!  Just the right size to carry everywhere, and the image quality is amazing!  The zoom range really surprised her, coming from Micro 4/3rds and small DSLRs, the size of the camera gives no indication of how far the zoom can reach.She loves to take pictures of architectural details as well as close up of flowers, and this camera does it all very well. IQ at max zoom is not perfect, but even I am amazed at how good it is.  We bought a two pack of batteries with an external charger, and have been pleased that the batteries can last a few days with moderate use.  The built-in viewfinder was probably the biggest selling point, and although I struggle a little with its resolution due to only using TTL optical viewfinders, she loves it.GPS works quickly and accurately compared to other P&S;, and even compared to a handheld GPS unit.  We havn't shot with RAW yet, waiting for Adobe coverage, nor used the manual focus, but the video quality is good.Overall five stars and no problems recommending.  The price will come down, but we will cover some of the cost when my wife sells her M4/3, she is not going back!", "Date": "May 19, 2014"}, {"Title": "It's a miracle", "Author": "B. Kellar", "ReviewID": "R3O44N78K5260F", "Overall": "5.0", "Content": "I bought it for an overseas trip after a lot of comparison shopping.  I'm very satisfied with it.  I love the fantastic zoom range and the HD videos (I set it to record mp4 videos before the trip, so no problems there).  The rear screen is very sharp and clear.  I never had to use the built-in viewfinder.  I set up the WiFi so I could transfer photos to my smartphone and tablet easily with the app...really pretty cool!  I recharged it every night and I never ran out of power even though I had a backup battery with me.  I don't mind that it has its own cable, because I keep the cable in the camera pouch that I bought with the camera.  It takes fine low-light shots too.  It can take several low-light shots and add them together automatically.  The panorama shots are easy and work well.  I still haven't tried all of the features and picture modes, so I expect to have even more fun with it.  The zoom is incredible, along with motion stabilization.  I would say that's the best feature.  I took many fine high-zoom pictures without a tripod.  I recommend it!", "Date": "May 30, 2014"}, {"Title": "Best Camera Yet", "Author": "Linda S Jimenez", "ReviewID": "RCLZC7A9KWYUV", "Overall": "5.0", "Content": "Over the years I have purchased camera after camera trying to find just the right one.  I wanted a camera with a fast shutter speed to capture my fast moving grandchildren.  I wanted a small camera I could fit in my purse.  I wanted a camera with a long telephoto lens in order to capture scenery and animals when I travel.Finally, after spending way too much money experimenting, I have found just the right camera for me!  This camera has all the features I've been looking for.  And it's very easy to use, too.", "Date": "May 8, 2014"}, {"Title": "Fabulous point and shoot with a great zoom.", "Author": "Patricia G. McKown", "ReviewID": "RBCED195CJAUU", "Overall": "5.0", "Content": "This is my fifth Lumix and every one of them has been outstanding. I love this camera for its ease of use, great optical zoom and sharp detail.", "Date": "May 5, 2014"}, {"Title": "A Great Camera", "Author": "pck", "ReviewID": "R105FQKKLBL8L9", "Overall": "5.0", "Content": "A very nice camera with all the latest functions allowing for a great deal of creativity.The addition of the viewfinder make the camera truly useful in all sunny conditions.No longer does one have to point and hope.", "Date": "May 20, 2014"}, {"Title": "Beginner", "Author": "Snickers", "ReviewID": "RV2K888UNB876", "Overall": "4.0", "Content": "as a beginner, I could have used a bit more DIY instruction for using the camera the first time user", "Date": "June 2, 2014"}, {"Title": "Had to call and get a AC Adapter replacement the day the camera arrived", "Author": "Nicole Peterson", "ReviewID": "R3OV97HBJS05D6", "Overall": "4.0", "Content": "Camera arrived and I immediately read and followed the instructions on how to put the battery in, connect it to the AC Adapter and begin charging the battery. The AC Adapter is faulty and I had to call Panasonic Support to get a replacement. The battery charges just fine if connected via USB port either from my laptop or my surge protector, but it won't charge at all via the AC adapter plugged into an electric outlet. I found Panasonic Support very helpful and understanding and they helped me with the process to request a new AC Adapter. The faulty AC Adapter is my reason for not giving a 5 star rating. For a brand new camera, and how much it cost, it should not have been delivered with a faulty AC Adapter.Camera is light weight, small and perfect for traveling. I've been playing around with the different settings and features, but so far, I'm happy with it. I did notice that when the camera is set to Intelligent Auto mode, the pictures are a little blurry so I've mainly been using the Program AE mode so I don't get blurry photos. I played with the Night setting in the Scenes mode and was AMAZED at the stars it captured. I didn't even see all of those stars in the sky with my \"naked eye\"! The zoom on the camera is phenomenal and for this, I'm very happy that I purchased this camera and didn't go with the other camera brand that I was looking at.I was a bit disappointed that it didn't come with a \"starter\" SD card (again, thinking about the cost of the camera here; I realize that SD cards don't come standard with most cameras). The \"built in memory\" of the camera only supports one photo. I don't understand why, since the built in memory is supposed to be 12 MG. So until I can purchase an SD card, I can only take one photo at a time when I'm trying out the different camera modes.I love the ability to send photos via WiFi to my SmartPhone (I have an iPhone 5). So far, because I can only take one pic at a time, I've only been able to test out sending Single pics. I'll test out sending Multiple pics when I have a SD card.", "Date": "May 25, 2014"}, {"Title": "tops", "Author": "Jimmy", "ReviewID": "RC8DUXXUW8S5A", "Overall": "5.0", "Content": "While i have not yet had a chance to learn all there is to learn about the Lumix ZS40S, so far it exceeds my expectations. It has lots of options, yet it has a certain simplicity to it. I previously owned 1 of the earlier generations of the Lumix.this Lumix is the Tops.", "Date": "May 5, 2014"}, {"Title": "great dissapointment", "Author": "M. G. Mioc", "ReviewID": "R33ZLGF7FS0LHM", "Overall": "2.0", "Content": "Unfortunately, after about 7 years of using the Panasonic Lumix TZ series cameras (and upgrading almost every year), It is for the first time I am very disappointed with the latest model, the TZ-60.Besides the known issues, I discovered several critical quality issues that mark a significant worsening from the previous models.Hidden problems:1. very poor quality wide angle shots (with very visible soft/blurred/unclear corners)2. very poor quality night shots (under/over exposed or with high noise)3. poor quality panorama shots (low resolution, occasional banding and blurred areas)4. no possibility to adjust the colour saturation for most of the shooting modes5. very short PROPRIETORY charging cable6. poor location of the flash (too close to the grip and with no protection from obstructing the flash when holding the camera)7. poor ergonomics of the on/off button (hard to voluntarily press but at the same time easy to accidentally press – much worse that the excellent sliding switch from the previous models)8. problematic iA mode (inadvertently detecting backlit scenes and shooting multiple shots)9. self timer timing complicated to select (switching between 2 and 10 seconds)Known issues:1. no separate battery charger in the box (for an almost 400 Euro flagship TZ model)2. insufficient long exposure time of 4 seconds3. no possibility to use the zoom for the panorama shots.Therefore, have decided to return the camera for a full refund.", "Date": "May 19, 2014"}, {"Title": "Amazing Camera", "Author": "Chris VH", "ReviewID": "RD1RKHHTLCPJ7", "Overall": "5.0", "Content": "I received this camera as a gift and absolutely love it.  It has Wi-Fi which is easy to use and I am able to connect it to my twitter, facebook and instagram accounts.  The creative motive is fun, super easy and amazing.Really enjoy using this camera.My wife wrote a review here. [...]", "Date": "May 17, 2014"}, {"Title": "Poor Choice for Charging Method!!", "Author": "D. Lection \"Myundai1203\"", "ReviewID": "R3EW8BITC2M2IV", "Overall": "3.0", "Content": "I bought this camera because it has so many positive features and attributes. However, it is saddening to see Panasonic choose to use a proprietary cable to charge camera battery inside the camera. I am surprised a this for a couple of reasons:  1) sometimes these batteries expand if accidentally overcharged. In this case, this would render the battery likely to be unremovable from the camera. Second, since the charger connects to any USB power supply, any supply could be used, therefore tempting the possibility that the battery could be overcharged in the camera.There are many OEM battery chargers out there than can charge the battery ... but Panasonic does not offer an OEM version of an external charger ... very sad.", "Date": "April 7, 2014"}, {"Title": "Beware: not USB, wifi bug, terrible support", "Author": "Roger", "ReviewID": "R2MDFF4IFV6DLD", "Overall": "1.0", "Content": "I bought this to upgrade from my four year old ZS7.  I particularly didn't want to carry around device specific chargers or cables, having simplified my life to using standard micro-usb. (The camera is a \"travel zoom\" hence the TZ60 model number elsewhere, and travelling is when cables and chargers matter.) The wifi connectivity, better zoom, better sensors etc are also nice bonuses.Sadly it turns out that for some insane reason Panasonic does not use a standard micro-USB connector on the camera itself, but instead one of a very similar size.  This means you can *only* use the cable they supply.  If you do not have that cable you *cannot* charge the battery as there is no separate charger supplied with the camera.  The non-camera end will plug in to standard USB on a computer for charge and data. The supplied cable is about 1ft. Charging using the cable takes 3 hours and the camera must be turned off - eg no charging while uploading photos over wifi or reviewing them from the Android/iOS app. You can of course overcome these limitations by spending more money on more batteries and a charger.The camera is also bigger by enough that earlier cases don't fit, and it doesn't fit most compact camera cases at the stores like the ZS7 does.  After trying many cases I can report that the Sony LCS-CSJ is the smallest case I have found that the camera will fit in.The rest of the camera functions well and is covered by numerous other reviews on the net.  It is sad that they messed up charging so badly - using a standard device connector would have made things so simple.Edit: they also won't let you enter a space in wifi passwords.  This has been escalated with their support (2 chats, 6 phone calls with annoying IVR, constant misrecognition, hang ups, 1 unanswered email etc).  Panasonic's outsourced support is dreadful and does not address the issue.  You are stuck with this serious bug, and with very useless support.Edit2: changed to one star due to dire support.  Support will not do anything about the issue.  By that I mean they refuse to actually escalate it or report it to Panasonic.  Eventually they did tell me you can't enter spaces, repeating back what I just told them.  It is also very clear that support do not have access to the devices and I'm reasonably sure have never read the manual.  Amusingly they do surveys after support chat/call with the former just redirecting to the home page, and the latter not recognising the numbers you type 3 questions in if you are giving dissatisfied answers!", "Date": "April 2, 2014"}, {"Title": "Panasonic needs to offer some disclaimers", "Author": "Sandy D. Scott", "ReviewID": "R105NBV2SY2XEH", "Overall": "1.0", "Content": "The reason I purchased this camera was to have a camera of reasonable quality as a pocket carry around. One of the main features that was the catalyst for deciding on this particular model was the fact that it supported RAW format. Needless to say, I was more than disappointed after shooting some pictures in RAW, to discover that the RAW format from this camera was not supported by Aperture which I use as my photo import medium. I wrote to Panasonic yesterday and had this reply waiting this morning:Thank you for your inquiry. We do apologize for your inconvenience but unfortunately the software that was provided with the camera is not compatible with MAC at all and as a result we recommend using Imovie 11' or higher as well as Iphoto in order to transfer your videos and pictures.We hope this information is helpful to you. Thank you for contacting Panasonic.On their suggestion, I tried iPhoto (I could not however imagine why Apple's lesser product would support something that the superior product did not). Not surprisingly, iPhoto also did not recognize RAW files from the camera.  I think Panasonic should make statements about supporting certain products in their literature - not in their notes to customers after purchase.I also find it disappointing that the battery cannot be charged outside of the camera and requires a proprietary cable.  In all fairness to the camera itself, it seems easy to use and the picture quality is excellent, but based on the above, it does not meet my personal needs and hence I give it two stars.Added 4-17-14I tempted to decrement my review by one star, but for now I will leave it at 2 stars.  The last time I used my camera, a week or so ago, the battery was indicating two bars on the battery icon.  I have used this camera very little since the last full charge.  I was carrying it on my bicycle today (one of the reasons I purchased this camera) and saw a good shot, stopped, fired off two or three shots only to hear a beep with a message announcing that I had no more battery power after which the camera powered down.  Two observations: 1)  The battery on this camera is very unimpressive as far as length of time between charges and 2) Wouldn't it be wonderful if the first beep would happen giving the user a bit of warning that he has very little power left leaving at least enough for a few shots before it unceremoniously shuts itself down.I am beginning to rue the fact that I did not listen to some expert advice regarding a portable carry-around camera choice - had I done so, the logo on the camera would say \"Canon!\"Added a few minutes later after uploading the few shots I took prior to the camera shutting down with a dead battery:I could not believe the fact that the half dozen or so shots I took prior to the camera shutting down came out completely blurry.  I have never had a blurry shot with this camera and I can only assume that when the power is about to run out, the AF ceases to function properly.  I was wearing sunglasses at the time and I was in bright sun and noted through the EVF that the shots did not seem to be in focus, but assumed that I was just seeing them correctly.  Wrong!  This is now the catalyst for me to reduce my review to one star.  Anyone want to buy a Lumix ZS40 at a discount?", "Date": "April 4, 2014"}, {"Title": "Not All Panasonic", "Author": "Gerald R Diehl", "ReviewID": "R2CD4RR17R6JME", "Overall": "1.0", "Content": "I ordered this camera through Net Sale strictly on a $10 lower price figuring they were all selling the same product.  Not true.  When the camera arrived in included a cheaper non-Panasonic charger which would not charge the camera.  Even though it was non-functional, I got stuck paying the freight to return it.  Certainly not happy with Net Sale, but, as a long standing customer of Amazon, very disappointed in them for letting me get suckered into cheapened up components and the extra work and expense of returning a defective item.  I thought Amazon protected its customers.  Now I must determine if I only buy simple items from Amazon and electronics elsewhere.", "Date": "May 20, 2014"}, {"Title": "If it is as reliable as a ZS20 look for something elase", "Author": "Basenjis Rule", "ReviewID": "R180Y6DQTEJSMJ", "Overall": "2.0", "Content": "I bought the ZS20 after reading the great reviews.  At first, I was impressed but then 9 months later I had the first problem.  The lens cover was not fully opening.  Ruined most photos from a vacation grip.  I returned it for warranty service.  The service was terrible.  I had to wait more than a month to have the camera back.  (This after I called and wrote to complain.)  Now six months later, on another great vacation of a lifetime, the camera did the same thing and got even worse.  Same problem.  When I contacted Panasonic I was told I am SOL because it is out of warranty.  Almost $300 I paid and wasted on this camera.  I did not use this camera everyday and it failed twice and gave me terrible pictures.  So guess what... goodbye Panasonic and hello to a real camera maker such as Canon.", "Date": "April 24, 2014"}], "ProductInfo": {"Price": "$449.99", "Features": "Eye level viewfinder (EVF) for improved viewing and stability\nLeica 30X Super Zoom (24-720mm) stabilized for still & HD Video\nLens mounted control ring for improved feature control versatility\nFuture Proofed with GPS and Wi-Fi with NFC", "Name": "Panasonic DMC-ZS40S Digital Camera with 3.0-Inch LCD (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41GJ3O%2BPvtL._SX300_.jpg", "ProductID": "B00IOTTLZY"}}