{"Reviews": [{"Title": "Tough and Fun Little Camera", "Author": "TJ Winston", "ReviewID": "RUBSNQSQBIGGJ", "Overall": "4.0", "Content": "Received my Canon D30 on 04/25/2014.  These will be my impressions after 4 weekends of shooting.  I have taken the camera underwater on 5 occasions.  Three times in pools, once snorkeling in a fresh water spring, and once in the Gulf of Mexico (Salt Water).  With no issues.  The seals seem to perform very well.I started a Flickr Group for photos taken with this camera-  Go to Flickr --> Groups --> Search Groups --> Canon PowerShot D30.  (Amazon will not allow me to post the link??)  I posted some photos of the camera itself, as well as a demonstration of the \"Sunlight LCD Mode\"  Scroll all the way to the bottom of the group to see these.Impression is 4-Star.It is impossible to compare this camera to a DSLR/SLT, so I will evaluate it on what it is- a point and shoot that you can take into the water, and can take a little punishment.The build quality is very good, and the camera feels solid in my hand.  The body is made of a nice composite material, and the rubber grips seem tacky enough to hold on to in cold/wet conditions.The buttons are well positioned, and the menus are intuitive.The power up is lightning fast.  It takes about one second from pushing the power button until you can take a shot.\"Turnaround\" time between shots is rather slow, in my opinion, however, I improved this slightly by turning OFF the preview function.High ISO performance is typical of a point and shoot with a lot of noise.Shooting underwater is a ton of fun.  The shots are fun to look at, but it is more luck than skill as to whether you will get a keeper shot or not, particularly with kids swimming, etc.  It is difficult to frame a shot underwater without the use of a snorkel mask or goggles.  Make sure to switch the camera over to the underwater modes, or else the camera may struggle to find an apropriate shooting mode.I've taken one underwater vide while snorkeling with good results.  There is an intermittent \"clicking\" noise as the focus adjusts.  The mic is OK.  On the plus side, the buffering at the end of the 3.5 minute video only took about 2 seconds.Battery life is good.  I have taken 250 still shots, about 5 minutes of video, kept the camera on for quite a while between shots, reviewed a lot of photos, and the indicator finally dropped to 2/3 charge.  I typically keep the GPS off, but I have noticed that the battery drains significantly faster with the GPS enabled.The reason I waited for, and paid more for this camera than the competition or the D20 was the \"Sunlight LCD Mode\"  We live in Florida, and I do a lot of shooting at the beach/pool, and in heavy sun.  I have never had an LCD screen that can be clearly seen in the sun.  The Sunlight LCD Mode must be activated in the settings menu- It is not turned on from the factory.  Once activated, it remains on the next time you power the camera up.  In my opinion, this camera performs 25% better than most LCD's in the sunlight.  Not perfect, not ideal, but noticeably better than anything I have experienced to date. I found the LCD to be readable and viewable in strong sun, with sunglasses on, so I will say that it is a true \"Pro\" of this camera.Overall, this is a fun camera to take to the beach, pool, or snorkeling.  The image quality will never compete with a DSLR or even most \"Point and shoots\" due to the lens cover.  The features are more akin to what you would find on a smart phone app than a \"real\" camera, but good luck taking any of those things into the water with you!!!Take Care...TJ", "Date": "April 26, 2014"}, {"Title": "Amazing picture quality!", "Author": "Zoe", "ReviewID": "R2NIMAXWGWKZQK", "Overall": "5.0", "Content": "I have only had this camera a couple of hours, but already I am in love. I have taken photo's in the house and in the pool underwater and I am so thrilled with the clarity and colour of the photo's. It's totally intuitive to use, nice and light and feels good in your hands. I don't usually leave reviews but well I am so happy with it, as it just came out I thought I would post one. Thank you to the other reviewer for mentioning the bright LCD screen, I too live in Florida so this is a must. I bought it for an upcoming snorkeling holiday and know its going to be perfect for our families needs. If you are looking for something fun, waterproof, that takes awesome photo's, this is your camera!", "Date": "April 29, 2014"}, {"Title": "Identical to D20 but with greatly improved case and depth rating?", "Author": "7 \"7\"", "ReviewID": "RTIHKHI5C2H6H", "Overall": "4.0", "Content": "I own the predecessor to the Canon D30; the D20. I love it! Good image quality (IQ) for a waterproof camera (Sorry, IQ really is relative as non-waterproof point-and-shoot (PNS) cameras at this price point have far better IQ). My D20 handles continuous bouncing in my front pocket while trail running with no problems yet after about 6 months of solid use. 50 to 100+ miles of bouncing in my front pocket or backpack so far. I love the Color Swap effect mode as well. I have not submerged it yet but it has been rained on many times without incident.So this brings me to the D30. I cannot find anything different with it other than the case (and modest button layout change) and depth rating from the D20. They both have in common:12.1MP 1/2.3\" CMOS sensorDIGIC 4 image processor5.0mm-25.0mm F3.9-4.8 lensISO 100-32003.0\" 461,000 pixel screenFlash range 1 to 11 feetSame Scene ModesShutter Range 15sec-1/1600sec1.9fps maximum frame advanceNB-6L batteryAnd on and on...I honestly believe that the D30 is the same camera as the D20 in a different case. And I have to admit, I can't stand the D20's case as it's got a very awkward shape and it is very slippery. I literally smeared Shoe Goo all over the front and sides of it for grip. My girlfriend HATES the way it looks now but has to admit it solved the slip problem. The D30 addresses the slipperiness of the D20 with an actual finger grip on the front. Plus the D30 has a totally different depth rating of 82 feet, which is 49 feet deeper than the D20's 33 feet. This is something that really interests me as I had a Lumix TS3 fatally leak at literally under 8 INCHES submersion shooting video in a koi pond while being rated for 40 feet. Depth ratings are lies and all I need is a genuine, no-excuses-never-ever-fail-for-any-reason depth rating of 10 feet. I figure an 82 foot rating should genuinely provide 10+ feet.So aside from drastically improved depth rating and case design, can anyone verify any differences between the D20 and D30? Thanks! :)", "Date": "May 1, 2014"}, {"Title": "Great rugged camera", "Author": "Jackattack \"Jackattack\"", "ReviewID": "R1MZQ0NHAY7DUF", "Overall": "5.0", "Content": "We bought this camera so we could take it underwater on our vacation trip. Its been great so far. Cant complain about the picture quality, from all the pictures we took underwater and on land the pictures came out great. Its easy to hold and feels tough enough that if its dropped i wouldnt give it a second thought. The battery life is really good, took a whole days worth of pics and still had plenty of juice left in it. We also took some videos, my only gripe would be that it doesnt seem to pickup audio as loud as we would have liked. It could have been that we needed to be closer to the camera. Overall fun, rugged camera which will provide years of family fun.", "Date": "May 26, 2014"}, {"Title": "Initial Reaction - Mediocre Picture Quality", "Author": "Ed Straker", "ReviewID": "R2C4ILNRALEVW5", "Overall": "3.0", "Content": "Received the camera today and took three outdoor pics in auto mode. Took the same three pics with my older Nikon P330 and there is no comparison for a camera that cost about the same (actually now P330 is less): Nikon much better IQ. Canon pictures are soft and colors are not as real. Low light the 1.8 aperture Nikon is excellent, on par with my Sony RX100 - can't expect the Canon to compete there either. So in the end, I will keep the Canon for underwater pics - I hope these will be acceptable. The 85' depth is a feature I need and why I chose it over other uw point and shoots. For me, even though the IQ could be better, it beats carrying around expensive and bulky underwater housings on vacation.", "Date": "May 10, 2014"}, {"Title": "Amazon has incorrect information on this camera", "Author": "patsy dillard", "ReviewID": "R2KF0MHIRFWIKN", "Overall": "3.0", "Content": "This camera is just okay.  Nothing great outside of the obvious waterproofing, slow picture speed, pretty good video (not good audio), BUT Amazon advertises it as having super slow motion.  IT DOES NOT!  I looked through the entirety of the directions, played with the camera in all modes, and finally (when all else fails!) went to the canon website.  They prominently display the features of the cameras, and show super slow motion for those that include it.  The D30 is NOT a camera with super slow motion, according to their website.  Amazon needs to correct this.  Looking back, i would probably spend a bit more for an olympus that is faster and has more features.", "Date": "May 10, 2014"}], "ProductInfo": {"Price": "$329.00", "Features": "World's deepest* waterproof camera down to 82 ft. below sea level. * As of January 20, 2014. For compact-type waterproof digital cameras.\nShockproof to 6.5 feet, and temperature-resistant from 14 degrees to 104 degrees Fahrenheit.  Based on Canon Standard.\nCapture stunning 1080p Full HD video with a dedicated movie button.\n12.1 Megapixel High-Sensitivity CMOS sensor combined with the Canon DIGIC 4 Image Processor creates the Canon HS SYSTEM, which helps provide excellent low-light performance.\nSunlight LCD mode helps reduce glare so it's easy to shoot or share photos outdoors.", "Name": "Canon PowerShot D30 Waterproof Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41-V0lhwW3L._SX300_.jpg", "ProductID": "B00I58LNF0"}}